Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/nginx/nginx.*.004.xlf
Languages: es, ja, ko, ru, zh_cn

source: This module is not built by default, it should be enabled with the <code>--with-http_secure_link_module</code> configuration parameter.
es: Este m&oacute;dulo no est&aacute; construido por defecto, debe habilitarse con el <code>--with-http_secure_link_module</code> configuraci&oacute;n --with-http_secure_link_module .
ko: 이 모듈은 기본적으로 빌드되지 않으며 <code>--with-http_secure_link_module</code> 구성 매개 변수를 사용하여 활성화해야합니다 .

source: This module is not built by default, it should be enabled with the <code>--with-http_slice_module</code> configuration parameter.
es: Este m&oacute;dulo no est&aacute; construido por defecto, debe habilitarse con el <code>--with-http_slice_module</code> configuraci&oacute;n --with-http_slice_module .
ko: 이 모듈은 기본적으로 빌드되지 않으며 <code>--with-http_slice_module</code> 구성 매개 변수를 사용하여 활성화해야합니다 .

source: This module is not built by default, it should be enabled with the <code>--with-http_spdy_module</code> configuration parameter.
es: Este m&oacute;dulo no est&aacute; construido por defecto, debe habilitarse con el <code>--with-http_spdy_module</code> configuraci&oacute;n --with-http_spdy_module .
ko: 이 모듈은 기본적으로 빌드되지 않으며 <code>--with-http_spdy_module</code> 구성 매개 변수를 사용하여 활성화해야합니다 .

source: This module is not built by default, it should be enabled with the <code>--with-http_ssl_module</code> configuration parameter.
es: Este m&oacute;dulo no est&aacute; construido de forma predeterminada, debe habilitarse con el <code>--with-http_ssl_module</code> configuraci&oacute;n --with-http_ssl_module .
ko: 이 모듈은 기본적으로 빌드되지 않으며 <code>--with-http_ssl_module</code> 구성 매개 변수를 사용하여 활성화해야합니다 .

source: This module is not built by default, it should be enabled with the <code>--with-http_stub_status_module</code> configuration parameter.
es: Este m&oacute;dulo no est&aacute; construido por defecto, debe habilitarse con el <code>--with-http_stub_status_module</code> configuraci&oacute;n --with-http_stub_status_module .
ko: 이 모듈은 기본적으로 빌드되지 않으며 <code>--with-http_stub_status_module</code> 구성 매개 변수를 사용하여 활성화해야합니다 .

source: This module is not built by default, it should be enabled with the <code>--with-http_sub_module</code> configuration parameter.
es: Este m&oacute;dulo no est&aacute; construido por defecto, debe habilitarse con el <code>--with-http_sub_module</code> configuraci&oacute;n --with-http_sub_module .
ko: 이 모듈은 기본적으로 빌드되지 않으며 <code>--with-http_sub_module</code> 구성 매개 변수를 사용하여 활성화해야합니다 .

source: This module is not built by default, it should be enabled with the <code>--with-http_v2_module</code> configuration parameter.
es: Este m&oacute;dulo no est&aacute; construido por defecto, debe habilitarse con el <code>--with-http_v2_module</code> configuraci&oacute;n --with-http_v2_module .
ko: 이 모듈은 기본적으로 빌드되지 않으며 <code>--with-http_v2_module</code> 구성 매개 변수를 사용하여 활성화해야합니다 .

source: This module is not built by default, it should be enabled with the <code>--with-http_xslt_module</code> configuration parameter.
es: Este m&oacute;dulo no est&aacute; construido por defecto, debe habilitarse con el <code>--with-http_xslt_module</code> configuraci&oacute;n --with-http_xslt_module .
ko: 이 모듈은 기본적으로 빌드되지 않으며 <code>--with-http_xslt_module</code> 구성 매개 변수를 사용하여 활성화해야합니다 .

source: This module is not built by default, it should be enabled with the <code>--with-mail</code> configuration parameter.
es: Este m&oacute;dulo no est&aacute; construido por defecto, debe habilitarse con el <code>--with-mail</code> configuraci&oacute;n --with-mail .
ko: 이 모듈은 기본적으로 빌드되지 않으며 <code>--with-mail</code> 구성 매개 변수를 사용하여 활성화해야합니다 .

source: This module is not built by default, it should be enabled with the <code>--with-mail_ssl_module</code> configuration parameter.
es: Este m&oacute;dulo no est&aacute; construido de forma predeterminada, debe habilitarse con el <code>--with-mail_ssl_module</code> configuraci&oacute;n --with-mail_ssl_module .
ko: 이 모듈은 기본적으로 빌드되지 않으며 <code>--with-mail_ssl_module</code> 구성 매개 변수를 사용하여 활성화해야합니다 .

source: This module is not built by default, it should be enabled with the <code>--with-stream_geoip_module</code> configuration parameter.
es: Este m&oacute;dulo no est&aacute; construido por defecto, debe habilitarse con el <code>--with-stream_geoip_module</code> configuraci&oacute;n --with-stream_geoip_module .
ko: 이 모듈은 기본적으로 빌드되지 않으며 <code>--with-stream_geoip_module</code> 구성 매개 변수를 사용하여 활성화해야합니다 .

source: This module is not built by default, it should be enabled with the <code>--with-stream_realip_module</code> configuration parameter.
es: Este m&oacute;dulo no est&aacute; construido por defecto, debe habilitarse con el <code>--with-stream_realip_module</code> configuraci&oacute;n --with-stream_realip_module .
ko: 이 모듈은 기본적으로 빌드되지 않으며 <code>--with-stream_realip_module</code> 구성 매개 변수를 사용하여 활성화해야합니다 .

source: This module is not built by default. Download and install instructions are available <a href="../njs/install">here</a>.
es: Este m&oacute;dulo no est&aacute; construido por defecto. Las instrucciones de descarga e instalaci&oacute;n est&aacute;n disponibles <a href="../njs/install">aqu&iacute;</a> .
ko: 이 모듈은 기본적으로 빌드되지 않습니다. 다운로드 및 설치 지침은 <a href="../njs/install">여기에 있습니다</a> .

source: This module requires <a href="https://www.perl.org/get.html">Perl</a> version 5.6.1 or higher. The C compiler should be compatible with the one used to build Perl.
es: Este m&oacute;dulo requiere <a href="https://www.perl.org/get.html">Perl</a> versi&oacute;n 5.6.1 o superior. El compilador de C deber&iacute;a ser compatible con el que se us&oacute; para construir Perl.
ko: 이 모듈에는 <a href="https://www.perl.org/get.html">Perl</a> 버전 5.6.1 이상 이 필요합니다 . C 컴파일러는 Perl을 빌드하는 데 사용되는 컴파일러와 호환 가능해야합니다.

source: This module requires the <a href="http://www.maxmind.com/app/c">MaxMind GeoIP</a> library.
es: Este m&oacute;dulo requiere la biblioteca <a href="http://www.maxmind.com/app/c">MaxMind GeoIP</a> .
ko: 이 모듈에는 <a href="http://www.maxmind.com/app/c">MaxMind GeoIP</a> 라이브러리 가 필요합니다 .

source: This module requires the <a href="http://www.openssl.org">OpenSSL</a> library.
es: Este m&oacute;dulo requiere la biblioteca <a href="http://www.openssl.org">OpenSSL</a> .
ko: 이 모듈에는 <a href="http://www.openssl.org">OpenSSL</a> 라이브러리 가 필요합니다 .

source: This module requires the <a href="http://xmlsoft.org">libxml2</a> and <a href="http://xmlsoft.org/XSLT/">libxslt</a> libraries.
es: Este m&oacute;dulo requiere las bibliotecas <a href="http://xmlsoft.org">libxml2</a> y <a href="http://xmlsoft.org/XSLT/">libxslt</a> .
ko: 이 모듈에는 <a href="http://xmlsoft.org">libxml2</a> 및 <a href="http://xmlsoft.org/XSLT/">libxslt</a> 라이브러리 가 필요합니다 .

source: This module requires the <a href="https://github.com/gperftools/gperftools">gperftools</a> library.
es: Este m&oacute;dulo requiere la biblioteca <a href="https://github.com/gperftools/gperftools">gperftools</a> .
ko: 이 모듈에는 <a href="https://github.com/gperftools/gperftools">gperftools</a> 라이브러리 가 필요합니다 .

source: This module utilizes the <a href="http://libgd.org">libgd</a> library. It is recommended to use the latest available version of the library.
es: Este m&oacute;dulo utiliza la biblioteca <a href="http://libgd.org">libgd</a> . Se recomienda utilizar la &uacute;ltima versi&oacute;n disponible de la biblioteca.
ko: 이 모듈은 <a href="http://libgd.org">libgd</a> 라이브러리를 사용합니다 . 사용 가능한 최신 버전의 라이브러리를 사용하는 것이 좋습니다.

source: This module was available as part of our <a href="http://nginx.com/products/">commercial subscription</a> until 1.13.10. It was superseded by the <a href="ngx_http_api_module">ngx_http_api_module</a> module in 1.13.3.
es: Este m&oacute;dulo estuvo disponible como parte de nuestra <a href="http://nginx.com/products/">suscripci&oacute;n comercial</a> hasta el 1.13.10. Fue reemplazado por el <a href="ngx_http_api_module">ngx_http_api_module</a> m&oacute;dulo en 1.13.3.
ko: 이 모듈은 1.13.10까지 <a href="http://nginx.com/products/">상용 구독의</a> 일부로 제공되었습니다 . <a href="ngx_http_api_module">1.13.3</a> 의 ngx_http_api_module 모듈 로 대체되었습니다 .

source: This module was superseded by the <a href="ngx_http_v2_module">ngx_http_v2_module</a> module in 1.9.5.
es: Este m&oacute;dulo fue reemplazado por el m&oacute;dulo <a href="ngx_http_v2_module">ngx_http_v2_module</a> en 1.9.5.
ko: 이 모듈은 1.9.5 에서 <a href="ngx_http_v2_module">ngx_http_v2_module</a> 모듈로 대체되었습니다 .

source: This parameter should be specified before the list of values.
es: Este parámetro debe ser especificado antes de la lista de valores.
ko: 이 매개 변수는 값 목록보다 먼저 지정해야합니다.

source: This restriction does not apply to responses that will be <a href="#fastcgi_cache">cached</a> or <a href="#fastcgi_store">stored</a> on disk.
es: Esta restricci&oacute;n no se aplica a las respuestas que se <a href="#fastcgi_store">almacenar&aacute;n</a> en <a href="#fastcgi_cache">cach&eacute;</a> o en disco.
ko: 이 제한은 디스크에 <a href="#fastcgi_cache">캐시</a> 되거나 <a href="#fastcgi_store">저장</a> 될 응답에는 적용되지 않습니다 .

source: This restriction does not apply to responses that will be <a href="#proxy_cache">cached</a> or <a href="#proxy_store">stored</a> on disk.
es: Esta restricci&oacute;n no se aplica a las respuestas que se <a href="#proxy_store">almacenar&aacute;n</a> en <a href="#proxy_cache">cach&eacute;</a> o en disco.
ko: 이 제한은 디스크에 <a href="#proxy_cache">캐시</a> 되거나 <a href="#proxy_store">저장</a> 될 응답에는 적용되지 않습니다 .

source: This restriction does not apply to responses that will be <a href="#scgi_cache">cached</a> or <a href="#scgi_store">stored</a> on disk.
es: Esta restricci&oacute;n no se aplica a las respuestas que se <a href="#scgi_store">almacenar&aacute;n</a> en <a href="#scgi_cache">cach&eacute;</a> o en disco.
ko: 이 제한은 디스크에 <a href="#scgi_cache">캐시</a> 되거나 <a href="#scgi_store">저장</a> 될 응답에는 적용되지 않습니다 .

source: This restriction does not apply to responses that will be <a href="#uwsgi_cache">cached</a> or <a href="#uwsgi_store">stored</a> on disk.
es: Esta restricci&oacute;n no se aplica a las respuestas que se <a href="#uwsgi_store">almacenar&aacute;n</a> en <a href="#uwsgi_cache">cach&eacute;</a> o en disco.
ko: 이 제한은 디스크에 <a href="#uwsgi_cache">캐시</a> 되거나 <a href="#uwsgi_store">저장</a> 될 응답에는 적용되지 않습니다 .

source: This server will filter requests ending with <code>.gif</code>, <code>.jpg</code>, or <code>.png</code> and map them to the <code>/data/images</code> directory (by adding URI to the <code>root</code> directive&rsquo;s parameter) and pass all other requests to the proxied server configured above.
es: Este servidor filtrar&aacute; las solicitudes que terminen con <code>.gif</code> , <code>.jpg</code> o <code>.png</code> y las asignar&aacute; al directorio <code>/data/images</code> (agregando URI al par&aacute;metro de la directiva <code>root</code> ) y pasar&aacute; todas las dem&aacute;s solicitudes al servidor proxy configurado anteriormente.
ko: 이 서버는 <code>.gif</code> , <code>.jpg</code> 또는 <code>.png</code> 로 끝나는 요청을 필터링 하여 <code>root</code> 지시자의 매개 변수에 URI를 추가 하여 <code>/data/images</code> 디렉토리에 맵핑하고 다른 모든 요청을 위에 구성된 프록시 서버로 전달합니다.

source: This variable may contain outdated information since the corresponding database field is deprecated.
es: Esta variable puede contener información obsoleta,ya que el campo de la base de datos correspondiente está desactualizado.
ko: 해당 데이터베이스 필드는 더 이상 사용되지 않으므로이 변수에는 오래된 정보가 포함될 수 있습니다.

source: This will be a simple server that listens on the port 8080 (previously, the <code>listen</code> directive has not been specified since the standard port 80 was used) and maps all requests to the <code>/data/up1</code> directory on the local file system. Create this directory and put the <code>index.html</code> file into it. Note that the <code>root</code> directive is placed in the <code>server</code> context. Such <code>root</code> directive is used when the <code>location</code> block selected for serving a request does not include own <code>root</code> directive.
es: Este ser&aacute; un servidor simple que escuchar&aacute; en el puerto 8080 (anteriormente, la directiva <code>listen</code> no se especific&oacute; desde que se us&oacute; el puerto est&aacute;ndar 80) y <code>/data/up1</code> todas las solicitudes al directorio / data / up1 en el sistema de archivos local. Cree este directorio y coloque el archivo <code>index.html</code> en &eacute;l. Tenga en cuenta que la directiva <code>root</code> se coloca en el contexto del <code>server</code> . Dicha directiva <code>root</code> se usa cuando el bloque de <code>location</code> seleccionado para atender una solicitud no incluye <code>root</code> directiva ra&iacute;z propia .
ko: 이 서버는 포트 8080에서 수신 대기하고 (이전 에는 표준 포트 80이 사용 된 이후에 <code>listen</code> 지시문이 지정되지 않은) 단순 서버 이며 모든 요청을 로컬 파일 시스템 의 <code>/data/up1</code> 디렉토리에 맵핑합니다 . 이 디렉토리를 작성하고 <code>index.html</code> 파일을 넣으 십시오. 점을 유의 <code>root</code> 지시자가에 위치 <code>server</code> 컨텍스트. 이러한 <code>root</code> 지시문은 요청을 처리하기 위해 선택된 <code>location</code> 블록에 자체 <code>root</code> 지시문이 포함되지 않은 경우에 사용됩니다 .

source: This will set up a server that will route all requests except for requests for static images to the proxied server operating on <code>localhost:9000</code> through the FastCGI protocol.
es: Esto configurar&aacute; un servidor que enrutar&aacute; todas las solicitudes, excepto las solicitudes de im&aacute;genes est&aacute;ticas, al servidor proxy que opera en <code>localhost:9000</code> a trav&eacute;s del protocolo FastCGI.
ko: 이는 정적 이미지 요청을 제외한 모든 요청을 FastCGI 프로토콜을 통해 <code>localhost:9000</code> 에서 작동하는 프록시 서버로 라우팅하는 서버를 설정 합니다.

source: Time intervals can be specified in milliseconds, seconds, minutes, hours, days and so on, using the following suffixes:
es: Los intervalos de tiempo pueden especificarse en milisegundos,segundos,minutos,horas,días y así sucesivamente,utilizando los siguientes sufijos:
ko: 다음 접미사를 사용하여 시간 간격을 밀리 초, 초, 분, 시간, 일 등으로 지정할 수 있습니다.

source: Time of the last reload of configuration, in milliseconds since Epoch.
es: Tiempo de la última recarga de la configuración,en milisegundos desde la época.
ko: Epoch 이후 마지막 구성 다시로드 시간 (밀리 초)입니다.

source: Time of the last reload of configuration, in the ISO 8601 format with millisecond resolution.
es: Tiempo de la última recarga de la configuración,en el formato ISO 8601 con resolución de milisegundos.
ko: 밀리 초 해상도의 ISO 8601 형식으로 구성을 마지막으로 다시로드 한 시간입니다.

source: Timer events
es: Eventos del temporizador
ko: 타이머 이벤트

source: To add a <code>task</code> into a queue of a specified thread pool <code>tp</code> at runtime, use the <code>ngx_thread_task_post(tp, task)</code> function. To execute a function in a thread, pass parameters and setup a completion handler using the <code>ngx_thread_task_t</code> structure:
es: Para agregar una <code>task</code> a una cola de un grupo de subprocesos especificado <code>tp</code> en tiempo de ejecuci&oacute;n, use la funci&oacute;n <code>ngx_thread_task_post(tp, task)</code> . Para ejecutar una funci&oacute;n en un hilo, pase par&aacute;metros y configure un controlador de finalizaci&oacute;n usando la estructura <code>ngx_thread_task_t</code> :
ko: 런타임에 지정된 스레드 풀 <code>tp</code> 의 큐에 <code>task</code> 을 추가하려면 <code>ngx_thread_task_post(tp, task)</code> 함수를 사용하십시오. 스레드에서 함수를 실행하려면 <code>ngx_thread_task_t</code> 구조를 사용하여 매개 변수를 전달하고 완료 핸들러를 설정하십시오 .

source: To add a handler to the header filter chain, store its address in the global variable <code>ngx_http_top_header_filter</code> at configuration time. The previous handler address is normally stored in a static variable in a module and is called by the newly added handler before exiting.
es: Para agregar un controlador a la cadena de filtros de encabezado, almacene su direcci&oacute;n en la variable global <code>ngx_http_top_header_filter</code> en el momento de la configuraci&oacute;n. La direcci&oacute;n del controlador anterior normalmente se almacena en una variable est&aacute;tica en un m&oacute;dulo y es llamada por el controlador reci&eacute;n agregado antes de salir.
ko: 헤더 필터 체인에 핸들러를 추가하려면 구성시 글로벌 변수 <code>ngx_http_top_header_filter</code> 에 해당 주소를 저장하십시오 . 이전 핸들러 주소는 일반적으로 모듈의 정적 변수에 저장되며 종료하기 전에 새로 추가 된 핸들러에 의해 호출됩니다.

source: To add a new backup server, send:
es: Para agregar un nuevo servidor de respaldo,enviar:
ko: 새 백업 서버를 추가하려면 다음을 보내십시오.

source: To add a new primary server, set its parameters to non-default values and mark it as &ldquo;<code>down</code>&rdquo;, send:
es: Para agregar un nuevo servidor primario, establezca sus par&aacute;metros en valores no predeterminados y m&aacute;rquelo como " <code>down</code> ", env&iacute;e:
ko: 새 기본 서버를 추가하려면 해당 매개 변수를 기본값이 아닌 값으로 설정하고 " <code>down</code> " 으로 표시하십시오 .

source: To add a new server, specify its address in the &ldquo;<code>server=</code>&rdquo; parameter. Without other parameters specified, a server will be added with other parameters set to their default values (see the <a href="ngx_http_upstream_module#server">http</a> or <a href="../stream/ngx_stream_upstream_module#server">stream</a> &ldquo;<code>server</code>&rdquo; directive).
es: Para agregar un nuevo servidor, especifique su direcci&oacute;n en el par&aacute;metro " <code>server=</code> ". Sin otros par&aacute;metros especificados, se agregar&aacute; un servidor con otros par&aacute;metros configurados a sus valores predeterminados (consulte la directiva <a href="ngx_http_upstream_module#server">http</a> o " <code>server</code> " de <a href="../stream/ngx_stream_upstream_module#server">transmisi&oacute;n</a> ).
ko: 새 서버를 추가하려면&ldquo; <code>server=</code> &rdquo;매개 변수에 주소를 지정하십시오 . 다른 매개 변수를 지정하지 않으면 서버에 다른 매개 변수가 기본값으로 설정되어 추가됩니다 ( <a href="ngx_http_upstream_module#server">http</a> 또는 <a href="../stream/ngx_stream_upstream_module#server">스트림</a> &ldquo; <code>server</code> &rdquo;지시문 참조).

source: To add a node to a tree, allocate a new node, initialize it and call <code>ngx_rbtree_insert()</code>:
es: Para agregar un nodo a un &aacute;rbol, asigne un nuevo nodo, <code>ngx_rbtree_insert()</code> y llame a ngx_rbtree_insert () :
ko: 트리에 노드를 추가하려면 새 노드를 할당하고 초기화 한 다음 <code>ngx_rbtree_insert()</code> 호출 하십시오 .

source: To allocate memory from system heap, use the following functions:
es: Para asignar la memoria de la pila del sistema,utilice las siguientes funciones:
ko: 시스템 힙에서 메모리를 할당하려면 다음 기능을 사용하십시오.

source: To apply new configuration, send the <code>reload</code> signal to nginx as described in the previous sections.
es: Para aplicar una nueva configuraci&oacute;n, env&iacute;e la se&ntilde;al de <code>reload</code> a nginx como se describe en las secciones anteriores.
ko: 새로운 구성을 적용하려면 이전 섹션에서 설명한대로 <code>reload</code> 신호를 nginx로 전송하십시오 .

source: To apply the new configuration, start nginx if it is not yet started or send the <code>reload</code> signal to the nginx&rsquo;s master process, by executing:
es: Para aplicar la nueva configuraci&oacute;n, inicie nginx si a&uacute;n no se ha iniciado o env&iacute;e la se&ntilde;al de <code>reload</code> al proceso maestro de nginx, ejecutando:
ko: 새 구성을 적용하려면 nginx가 아직 시작되지 않은 경우 시작하거나 다음을 실행 하여 <code>reload</code> 신호를 nginx의 마스터 프로세스로 보냅니다 .

source: To avoid this, either the line redefining the log should be commented out, or the <code>debug</code> level specification should also be added:
es: Para evitar esto, se debe comentar la l&iacute;nea que redefine el registro o se debe agregar la especificaci&oacute;n del nivel de <code>debug</code> :
ko: 이를 피하려면 로그를 재정의하는 행을 주석 처리하거나 <code>debug</code> 레벨 스펙도 추가해야합니다.

source: To build nginx on the Microsoft Win32<sup>&reg;</sup> platform you need:
es: Para construir nginx en la plataforma Microsoft Win32 <sup>&reg;</sup> , necesita:
ko: Microsoft Win32 <sup>&reg;</sup> 플랫폼 에서 nginx를 빌드하려면 다음이 필요합니다.

source: To build nginx:
es: Para construir Nginx:
ko: nginx를 빌드하려면 :

source: To build only njs command-line <a href="cli">utility</a>, run <code>./configure</code> and <code>make njs</code> commands from njs root directory. The utility is available as <code>./build/njs</code>.
es: Para construir solo la <a href="cli">utilidad de</a> l&iacute;nea de comandos de njs , ejecute <code>./configure</code> y <code>make njs</code> comandos de njs desde el directorio ra&iacute;z de njs. La utilidad est&aacute; disponible como <code>./build/njs</code> .
ko: 단지 NJS 명령 줄 빌드하려면 <a href="cli">유틸리티</a> 를 실행 <code>./configure</code> 를 하고 <code>make njs</code> NJS 루트 디렉토리에서 명령을. 이 유틸리티는 <code>./build/njs</code> 로 제공됩니다 .

source: To build the hash table, call the <code>ngx_hash_init(hinit, key_names, nelts)</code> function:
es: Para construir la tabla hash, llame a la funci&oacute;n <code>ngx_hash_init(hinit, key_names, nelts)</code> :
ko: 해시 테이블을 작성하려면 <code>ngx_hash_init(hinit, key_names, nelts)</code> 함수를 호출하십시오.

source: To compile a module into nginx statically, use the <code>--add-module=/path/to/module</code> argument to the configure script. To compile a module for later dynamic loading into nginx, use the <code>--add-dynamic-module=/path/to/module</code> argument.
es: Para compilar un m&oacute;dulo en nginx de forma est&aacute;tica, use el <code>--add-module=/path/to/module</code> en el script de configuraci&oacute;n. Para compilar un m&oacute;dulo para una carga din&aacute;mica posterior en nginx, use el <code>--add-dynamic-module=/path/to/module</code> .
ko: 모듈을 nginx에 정적으로 컴파일하려면 configure 스크립트에 <code>--add-module=/path/to/module</code> 인수를 사용하십시오. 나중에 nginx로 동적로드하기 위해 모듈을 컴파일하려면 <code>--add-dynamic-module=/path/to/module</code> 인수를 사용하십시오.

source: To configure an HTTPS server, the <code>ssl</code> parameter must be enabled on <a href="ngx_http_core_module#listen">listening sockets</a> in the <a href="ngx_http_core_module#server">server</a> block, and the locations of the <a href="ngx_http_ssl_module#ssl_certificate">server certificate</a> and <a href="ngx_http_ssl_module#ssl_certificate_key">private key</a> files should be specified:
es: Para configurar un servidor HTTPS, el par&aacute;metro <code>ssl</code> debe estar habilitado en los <a href="ngx_http_core_module#listen">sockets de escucha</a> en el bloque del <a href="ngx_http_core_module#server">servidor</a> , y se deben especificar las ubicaciones del <a href="ngx_http_ssl_module#ssl_certificate">certificado</a> del servidor y <a href="ngx_http_ssl_module#ssl_certificate_key">los</a> archivos de clave privada :
ko: HTTPS 서버를 구성하려면 <code>ssl</code> 매개 변수를 사용하도록 설정해야합니다 <a href="ngx_http_core_module#listen">소켓을 듣고</a> 에 <a href="ngx_http_core_module#server">서버</a> 블록과의 위치 <a href="ngx_http_ssl_module#ssl_certificate">서버 인증서</a> 및 <a href="ngx_http_ssl_module#ssl_certificate_key">개인 키</a> 파일 지정해야합니다.

source: To configure ip-hash load balancing, just add the <a href="ngx_http_upstream_module#ip_hash">ip_hash</a> directive to the server (upstream) group configuration:
es: Para configurar el equilibrio de carga de ip-hash, simplemente agregue la directiva <a href="ngx_http_upstream_module#ip_hash">ip_hash</a> a la configuraci&oacute;n del grupo del servidor (ascendente):
ko: ip-hash로드 밸런싱을 구성하려면 <a href="ngx_http_upstream_module#ip_hash">ip_hash를</a> 추가하십시오 . 지시문을 서버 (업스트림) 그룹 구성에 추가하십시오.

source: To configure load balancing for HTTPS instead of HTTP, just use &ldquo;https&rdquo; as the protocol.
es: Para configurar el equilibrio de carga para HTTPS en lugar de HTTP, simplemente use "https" como protocolo.
ko: HTTP 대신 HTTPS에 대한로드 밸런싱을 구성하려면 프로토콜로 "https"를 사용하십시오.

source: To convert a Unicode string to hex, first, it should be converted to a byte string and then to hex:
es: Para convertir una cadena de Unicode a hexágono,primero debe ser convertida a una cadena de bytes y luego a hexágono:
ko: 유니 코드 문자열을 16 진수로 변환하려면 먼저 바이트 문자열로 변환 한 다음 16 진수로 변환해야합니다.
