Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/nginx/nginx.*.004.xlf
Languages: es, ja, ko, ru, zh_cn

source: Sets the maximum size of chunks into which the response body is <a href="http://www.chromium.org/spdy/spdy-protocol/spdy-protocol-draft2#TOC-Data-frames"> sliced</a>. A too low value results in higher overhead. A too high value impairs prioritization due to <a href="http://en.wikipedia.org/wiki/Head-of-line_blocking"> HOL blocking</a>.
ja: レスポンスボディが<a href="http://www.chromium.org/spdy/spdy-protocol/spdy-protocol-draft2#TOC-Data-frames">スライス</a>されるチャンクの最大サイズを設定します。値が小さすぎると、オーバーヘッドが大きくなります。値が高すぎると、<a href="http://en.wikipedia.org/wiki/Head-of-line_blocking">HOLブロッキングの</a>ために優先順位付けが損なわれます。
ru: Устанавливает максимальный размер кусков , в которую тело ответа <a href="http://www.chromium.org/spdy/spdy-protocol/spdy-protocol-draft2#TOC-Data-frames">нарезанные</a> . Слишком низкое значение приводит к увеличению накладных расходов. Слишком высокое значение ухудшает приоритизацию из-за <a href="http://en.wikipedia.org/wiki/Head-of-line_blocking">блокировки HOL</a> .
zh_cn: 设置将响应主体<a href="http://www.chromium.org/spdy/spdy-protocol/spdy-protocol-draft2#TOC-Data-frames">切成</a>的块的最大大小。太低的值会导致更高的开销。太高的值会由于<a href="http://en.wikipedia.org/wiki/Head-of-line_blocking">HOL阻塞</a>而影响优先级。

source: Sets the maximum size of chunks into which the response body is sliced. A too low value results in higher overhead. A too high value impairs prioritization due to <a href="http://en.wikipedia.org/wiki/Head-of-line_blocking"> HOL blocking</a>.
ja: 応答本文がスライスされるチャンクの最大サイズを設定します。値が小さすぎると、オーバーヘッドが大きくなります。値が高すぎると、<a href="http://en.wikipedia.org/wiki/Head-of-line_blocking">HOLブロッキングの</a>ために優先順位付けが損なわれます。
ru: Устанавливает максимальный размер блоков, на которые разбивается тело ответа. Слишком низкое значение приводит к увеличению накладных расходов. Слишком высокое значение ухудшает приоритизацию из-за <a href="http://en.wikipedia.org/wiki/Head-of-line_blocking">блокировки HOL</a> .
zh_cn: 设置将响应主体切成的块的最大大小。太低的值会导致更高的开销。太高的值会由于<a href="http://en.wikipedia.org/wiki/Head-of-line_blocking">HOL阻塞</a>而影响优先级。

source: Sets the maximum size of the buffer used for reading images. When the size is exceeded the server returns error 415 (Unsupported Media Type).
ja: 画像の読み込みに使用するバッファの最大サイズを設定します。サイズを超えると、サーバーはエラー415(サポートされていないメディアタイプ)を返します。
ru: Устанавливает максимальный размер буфера,используемого для чтения изображений.При превышении размера сервер возвращает ошибку 415 (Неподдерживаемый тип носителя).
zh_cn: 设置用于读取图像的缓冲区的最大大小。当超过该大小时,服务器将返回错误 415(不支持的媒体类型)。

source: Sets the memcached server address. The address can be specified as a domain name or IP address, and a port:
ja: memcached サーバのアドレスを設定します。アドレスは、ドメイン名またはIPアドレス、ポートを指定できます。
ru: Устанавливает адрес кэшируемого сервера.Адрес может быть указан в качестве доменного имени или IP-адреса,а также порта:
zh_cn: 设置memcached服务器地址。该地址可以指定为域名或IP地址以及端口。

source: Sets the minimum <code><i>number</i></code> of file accesses during the period configured by the <code>inactive</code> parameter of the <a href="#open_file_cache">open_file_cache</a> directive, required for a file descriptor to remain open in the cache.
ja: <a href="#open_file_cache">open_file_cache</a>ディレクティブの <code>inactive</code> パラメーターで構成された期間中のファイルアクセスの最小 <code><i>number</i></code> を設定します。これは、ファイル記述子がキャッシュ内で開いたままになるために必要です。
ru: Устанавливает минимальное имеет <code><i>number</i></code> доступов файлов в течение периода , настроенного <code>inactive</code> параметром <a href="#open_file_cache">open_file_cache</a> директивы, необходимый для дескриптора файла , чтобы оставаться открытым в кэше.
zh_cn: 设置由<a href="#open_file_cache">open_file_cache</a>指令的 <code>inactive</code> 参数配置的时间段内的文件访问的最小 <code><i>number</i></code> ，这是文件描述符在高速缓存中保持打开状态所必需的。

source: Sets the minimum <code><i>size</i></code> for parts of a response stored on disk, starting from which it makes sense to send them using <a href="ngx_http_core_module#sendfile">sendfile</a>.
ja: <a href="ngx_http_core_module#sendfile">sendfile</a>を使用して送信するのが理にかなっている、ディスクに格納されている応答の一部の最小 <code><i>size</i></code> を設定します。
ru: Устанавливает минимальный <code><i>size</i></code> частей ответа, хранящихся на диске, начиная с которого имеет смысл отправлять их с помощью <a href="ngx_http_core_module#sendfile">файла sendfile</a> .
zh_cn: 设置存储在磁盘上的响应部分的最小 <code><i>size</i></code> ，从该<i>大小</i>开始，可以使用<a href="ngx_http_core_module#sendfile">sendfile</a>发送它们。

source: Sets the minimum HTTP version of a request required to compress a response.
ja: レスポンスを圧縮するために必要なリクエストのHTTPバージョンの最小値を設定します。
ru: Устанавливает минимальную версию HTTP запроса,необходимую для сжатия ответа.
zh_cn: 设置压缩响应所需的请求的最小HTTP版本。

source: Sets the minimum length of a response that will be gzipped. The length is determined only from the &ldquo;Content-Length&rdquo; response header field.
ja: gzip圧縮される応答の最小の長さを設定します。長さは、「Content-Length」応答ヘッダーフィールドからのみ決定されます。
ru: Устанавливает минимальную длину ответа, который будет заархивирован. Длина определяется только из поля заголовка ответа Content-Length.
zh_cn: 设置将被压缩的响应的最小长度。长度仅由&ldquo; Content-Length&rdquo;响应头字段确定。

source: Sets the number of client datagrams at which binding between a client and existing UDP stream session is dropped. After receiving the specified number of datagrams, next datagram from the same client starts a new session. The session terminates when all client datagrams are transmitted to a proxied server and the expected number of <a href="#proxy_responses">responses</a> is received, or when it reaches a <a href="#proxy_timeout">timeout</a>.
ja: クライアントと既存のUDPストリームセッション間のバインディングがドロップされるクライアントデータグラムの数を設定します。指定された数のデータグラムを受信した後、同じクライアントからの次のデータグラムは新しいセッションを開始します。セッションは、すべてのクライアントデータグラムがプロキシサーバーに送信され、予想される数の<a href="#proxy_responses">応答</a>が受信されたとき、または<a href="#proxy_timeout">タイムアウト</a>に達したときに終了します。
ru: Устанавливает количество клиентских дейтаграмм, при котором сбрасывается связь между клиентом и существующим сеансом потока UDP. После получения указанного количества дейтаграмм следующая дейтаграмма от того же клиента начинает новый сеанс. Сеанс завершается, когда все клиентские дейтаграммы передаются на прокси-сервер и получено ожидаемое количество <a href="#proxy_responses">ответов</a> , или когда <a href="#proxy_timeout">истекает таймаут</a> .
zh_cn: 设置客户端数据报的数量，客户端和现有UDP流会话之间的绑定将在此丢弃。收到指定数量的数据报后，来自同一客户端的下一个数据报将启动一个新会话。当所有客户端数据报都发送到代理服务器并接收到预期的<a href="#proxy_responses">响应</a>数时，或者达到<a href="#proxy_timeout">超时</a>时，会话终止。

source: Sets the number of datagrams expected from the proxied server in response to a client datagram if the <a href="ngx_stream_core_module#udp">UDP</a> protocol is used. The number serves as a hint for session termination. By default, the number of datagrams is not limited.
ja: <a href="ngx_stream_core_module#udp">UDP</a>プロトコルが使用されている場合、クライアントのデータグラムに応答してプロキシサーバーから予期されるデータグラムの数を設定します。番号は、セッション終了のヒントとして機能します。デフォルトでは、データグラムの数は制限されていません。
ru: Устанавливает количество датаграмм, ожидаемых от прокси-сервера в ответ на датаграмму клиента, если используется протокол <a href="ngx_stream_core_module#udp">UDP</a> . Номер служит подсказкой для завершения сеанса. По умолчанию количество дейтаграмм не ограничено.
zh_cn: 如果使用<a href="ngx_stream_core_module#udp">UDP</a>协议，则设置代理服务器响应客户端数据报而期望的数据报数。该数字用作会话终止的提示。默认情况下，数据报的数量不受限制。

source: Sets the number of items that will be scanned during one iteration (1.7.12). By default, <code>purger_files</code> is set to 10.
ja: 1回の反復中にスキャンされるアイテムの数を設定します（1.7.12）。デフォルトでは、 <code>purger_files</code> は10に設定されています。
ru: Устанавливает количество элементов, которые будут сканироваться за одну итерацию (1.7.12). По умолчанию для <code>purger_files</code> установлено значение 10.
zh_cn: 设置一次迭代（1.7.12）期间要扫描的项目数。默认情况下， <code>purger_files</code> 设置为10。

source: Sets the path and other parameters of a cache. Cache data are stored in files. Both the key and file name in a cache are a result of applying the MD5 function to the proxied URL. The <code>levels</code> parameter defines hierarchy levels of a cache: from 1 to 3, each level accepts values 1 or 2. For example, in the following configuration
ja: キャッシュのパスとその他のパラメータを設定します。キャッシュデータはファイルに保存されます。キャッシュ内のキーとファイル名はどちらも、プロキシされたURLにMD5関数を適用した結果です。 <code>levels</code> キャッシュのパラメータ定義の階層レベル：1から3まで、各レベルは、次のような構成において、例えば値1または2を受け付け
ru: Устанавливает путь и другие параметры кеша. Данные кеша хранятся в файлах. И ключ, и имя файла в кэше являются результатом применения функции MD5 к проксируемому URL-адресу. Параметр <code>levels</code> определяет уровни иерархии кеша: от 1 до 3, каждый уровень принимает значения 1 или 2. Например, в следующей конфигурации
zh_cn: 设置缓存的路径和其他参数。缓存数据存储在文件中。缓存中的密钥和文件名都是将MD5功能应用于代理URL的结果。的 <code>levels</code> 参数定义了一个高速缓存层级：从1到3，每个电平接受值1或2。例如，在下面的结构

source: Sets the path and other parameters of a cache. Cache data are stored in files. The file name in a cache is a result of applying the MD5 function to the <a href="#proxy_cache_key">cache key</a>. The <code>levels</code> parameter defines hierarchy levels of a cache: from 1 to 3, each level accepts values 1 or 2. For example, in the following configuration
ja: キャッシュのパスとその他のパラメータを設定します。キャッシュデータはファイルに保存されます。キャッシュ内のファイル名は、MD5関数を<a href="#proxy_cache_key">キャッシュキー</a>に適用した結果です。 <code>levels</code> キャッシュのパラメータ定義の階層レベル：1から3まで、各レベルは、次のような構成において、例えば値1または2を受け付け
ru: Устанавливает путь и другие параметры кеша. Данные кеша хранятся в файлах. Имя файла в кэше является результатом применения функции MD5 к <a href="#proxy_cache_key">ключу кеша</a> . Параметр <code>levels</code> определяет уровни иерархии кеша: от 1 до 3, каждый уровень принимает значения 1 или 2. Например, в следующей конфигурации
zh_cn: 设置缓存的路径和其他参数。缓存数据存储在文件中。高速缓存中的文件名是将MD5功能应用于<a href="#proxy_cache_key">高速缓存键的结果</a>。的 <code>levels</code> 参数定义了一个高速缓存层级：从1到3，每个电平接受值1或2。例如，在下面的结构

source: Sets the path and other parameters of a cache. Cache data are stored in files. The file name in a cache is a result of applying the MD5 function to the <a href="#scgi_cache_key">cache key</a>. The <code>levels</code> parameter defines hierarchy levels of a cache: from 1 to 3, each level accepts values 1 or 2. For example, in the following configuration
ja: キャッシュのパスとその他のパラメータを設定します。キャッシュデータはファイルに保存されます。キャッシュ内のファイル名は、MD5関数を<a href="#scgi_cache_key">キャッシュキー</a>に適用した結果です。 <code>levels</code> キャッシュのパラメータ定義の階層レベル：1から3まで、各レベルは、次のような構成において、例えば値1または2を受け付け
ru: Устанавливает путь и другие параметры кеша. Данные кеша хранятся в файлах. Имя файла в кэше является результатом применения функции MD5 к <a href="#scgi_cache_key">ключу кеша</a> . Параметр <code>levels</code> определяет уровни иерархии кеша: от 1 до 3, каждый уровень принимает значения 1 или 2. Например, в следующей конфигурации
zh_cn: 设置缓存的路径和其他参数。缓存数据存储在文件中。高速缓存中的文件名是将MD5功能应用于<a href="#scgi_cache_key">高速缓存键的结果</a>。的 <code>levels</code> 参数定义了一个高速缓存层级：从1到3，每个电平接受值1或2。例如，在下面的结构

source: Sets the path and other parameters of a cache. Cache data are stored in files. The file name in a cache is a result of applying the MD5 function to the <a href="#uwsgi_cache_key">cache key</a>. The <code>levels</code> parameter defines hierarchy levels of a cache: from 1 to 3, each level accepts values 1 or 2. For example, in the following configuration
ja: キャッシュのパスとその他のパラメータを設定します。キャッシュデータはファイルに保存されます。キャッシュ内のファイル名は、MD5関数を<a href="#uwsgi_cache_key">キャッシュキー</a>に適用した結果です。 <code>levels</code> キャッシュのパラメータ定義の階層レベル：1から3まで、各レベルは、次のような構成において、例えば値1または2を受け付け
ru: Устанавливает путь и другие параметры кеша. Данные кеша хранятся в файлах. Имя файла в кэше является результатом применения функции MD5 к <a href="#uwsgi_cache_key">ключу кеша</a> . Параметр <code>levels</code> определяет уровни иерархии кеша: от 1 до 3, каждый уровень принимает значения 1 или 2. Например, в следующей конфигурации
zh_cn: 设置缓存的路径和其他参数。缓存数据存储在文件中。高速缓存中的文件名是将MD5功能应用于<a href="#uwsgi_cache_key">高速缓存键的结果</a>。的 <code>levels</code> 参数定义了一个高速缓存层级：从1到3，每个电平接受值1或2。例如，在下面的结构

source: Sets the path to a log file and configures the shared memory zone that is used to store currently active sessions.
ja: ログファイルのパスを設定し、現在アクティブなセッションを保存するために使用される共有メモリゾーンを設定します。
ru: Устанавливает путь к файлу журнала и настраивает зону разделяемой памяти,которая используется для хранения текущих активных сеансов.
zh_cn: 设置日志文件的路径,并配置用于存储当前活动会话的共享内存区。

source: Sets the path, <a href="#log_format">format</a>, and configuration for a buffered log write. Several logs can be specified on the same configuration level. Logging to <a href="../syslog">syslog</a> can be configured by specifying the &ldquo;<code>syslog:</code>&rdquo; prefix in the first parameter. The special value <code>off</code> cancels all <code>access_log</code> directives on the current level.
ja: バッファリングされたログ書き込みのパス、<a href="#log_format">形式</a>、および構成を設定します。同じ構成レベルで複数のログを指定できます。<a href="../syslog">Syslog</a>へのログ記録は、最初のパラメーターに「 <code>syslog:</code> 」プレフィックスを指定することで構成できます。特別な値 <code>off</code> は、現在のレベルのすべての <code>access_log</code> ディレクティブをキャンセルします。
zh_cn: 设置缓冲日志写入的路径，<a href="#log_format">格式</a>和配置。可以在同一配置级别上指定多个日志。可以通过在第一个参数中指定&ldquo; <code>syslog:</code> &rdquo;前缀来配置登录到<a href="../syslog">syslog</a>。特殊值 <code>off</code> 取消当前级别的所有 <code>access_log</code> 指令。

source: Sets the path, <a href="#log_format">format</a>, and configuration for a buffered log write. Several logs can be specified on the same level. Logging to <a href="../syslog">syslog</a> can be configured by specifying the &ldquo;<code>syslog:</code>&rdquo; prefix in the first parameter. The special value <code>off</code> cancels all <code>access_log</code> directives on the current level.
ja: バッファ付きログ書き込みのパス、<a href="#log_format">形式</a>、および構成を設定します。同じレベルで複数のログを指定できます。<a href="../syslog">syslog</a>へのロギングは、最初のパラメーターで「 <code>syslog:</code> 」プレフィックスを指定することによって構成できます。特別な値 <code>off</code> は、現在のレベルのすべての <code>access_log</code> ディレクティブをキャンセルします。
ru: Устанавливает путь, <a href="#log_format">формат</a> и конфигурацию для буферизованной записи журнала. На одном уровне можно указать несколько журналов. Запись в <a href="../syslog">системный журнал</a> можно настроить, указав префикс &laquo; <code>syslog:</code> &raquo; в первом параметре. Специальное значение <code>off</code> отменяет все директивы <code>access_log</code> на текущем уровне.
zh_cn: 设置缓冲日志写入的路径，<a href="#log_format">格式</a>和配置。可以在同一级别上指定多个日志。可以通过在第一个参数中指定&ldquo; <code>syslog:</code> &rdquo;前缀来配置登录到<a href="../syslog">syslog</a>。特殊值 <code>off</code> 取消当前级别的所有 <code>access_log</code> 指令。

source: Sets the path, format, and configuration for a buffered log write. Several logs can be specified on the same configuration level. Logging to <a href="../syslog">syslog</a> can be configured by specifying the &ldquo;<code>syslog:</code>&rdquo; prefix in the first parameter. The special value <code>off</code> cancels all <code>access_log</code> directives on the current level. If the format is not specified then the predefined &ldquo;<code>combined</code>&rdquo; format is used.
ja: バッファリングされたログ書き込みのパス、形式、および構成を設定します。同じ構成レベルで複数のログを指定できます。<a href="../syslog">Syslog</a>へのロギングは、最初のパラメーターに「 <code>syslog:</code> 」プレフィックスを指定することで構成できます。特別な値 <code>off</code> は、現在のレベルのすべての <code>access_log</code> ディレクティブをキャンセルします。形式が指定されていない場合は、事前定義された「 <code>combined</code> 」形式が使用されます。
zh_cn: 设置缓冲日志写入的路径，格式和配置。可以在同一配置级别上指定多个日志。可以通过在第一个参数中指定&ldquo; <code>syslog:</code> &rdquo;前缀来配置登录到<a href="../syslog">syslog</a>。特殊值 <code>off</code> 取消当前级别的所有 <code>access_log</code> 指令。如果未指定格式，则使用预定义的&ldquo; <code>combined</code> &rdquo;格式。

source: Sets the path, format, and configuration for a buffered log write. Several logs can be specified on the same level. Logging to <a href="../syslog">syslog</a> can be configured by specifying the &ldquo;<code>syslog:</code>&rdquo; prefix in the first parameter. The special value <code>off</code> cancels all <code>access_log</code> directives on the current level. If the format is not specified then the predefined &ldquo;<code>combined</code>&rdquo; format is used.
ja: バッファ付きログ書き込みのパス、フォーマット、および構成を設定します。同じレベルで複数のログを指定できます。<a href="../syslog">syslog</a>へのロギングは、最初のパラメーターで「 <code>syslog:</code> 」プレフィックスを指定することによって構成できます。特別な値 <code>off</code> は、現在のレベルのすべての <code>access_log</code> ディレクティブをキャンセルします。形式が指定されていない場合は、事前定義された「 <code>combined</code> 」形式が使用されます。
ru: Устанавливает путь, формат и конфигурацию для буферизованной записи журнала. На одном уровне можно указать несколько журналов. Запись в <a href="../syslog">системный журнал</a> можно настроить, указав префикс &laquo; <code>syslog:</code> &raquo; в первом параметре. Специальное значение <code>off</code> отменяет все директивы <code>access_log</code> на текущем уровне. Если формат не указан, используется предопределенный &laquo; <code>combined</code> &raquo; формат.
zh_cn: 设置缓冲日志写入的路径，格式和配置。可以在同一级别上指定多个日志。可以通过在第一个参数中指定&ldquo; <code>syslog:</code> &rdquo;前缀来配置登录到<a href="../syslog">syslog</a>。特殊值 <code>off</code> 取消当前级别的所有 <code>access_log</code> 指令。如果未指定格式，则使用预定义的&ldquo; <code>combined</code> &rdquo;格式。

source: Sets the protocol and address of a proxied server and an optional URI to which a location should be mapped. As a protocol, &ldquo;<code>http</code>&rdquo; or &ldquo;<code>https</code>&rdquo; can be specified. The address can be specified as a domain name or IP address, and an optional port:
ja: プロキシサーバーのプロトコルとアドレス、および場所をマップする必要があるオプションのURIを設定します。プロトコルとして、「 <code>http</code> 」または「 <code>https</code> 」を指定できます。アドレスは、ドメイン名またはIPアドレス、およびオプションのポートとして指定できます。
ru: Устанавливает протокол и адрес прокси-сервера, а также необязательный URI, с которым должно быть сопоставлено местоположение. В качестве протокола можно указать &laquo; <code>http</code> &raquo; или &laquo; <code>https</code> &raquo;. Адрес может быть указан как доменное имя или IP-адрес, а также необязательный порт:
zh_cn: 设置代理服务器的协议和地址以及位置应映射到的可选URI。作为协议，可以指定&ldquo; <code>http</code> &rdquo;或&ldquo; <code>https</code> &rdquo;。该地址可以指定为域名或IP地址，以及一个可选端口：

source: Sets the protocol and address of a uwsgi server. As a <code><i>protocol</i></code>, &ldquo;<code>uwsgi</code>&rdquo; or &ldquo;<code>suwsgi</code>&rdquo; (secured uwsgi, uwsgi over SSL) can be specified. The address can be specified as a domain name or IP address, and a port:
ja: uwsgiサーバーのプロトコルとアドレスを設定します。 <code><i>protocol</i></code> として、「 <code>uwsgi</code> 」または「 <code>suwsgi</code> 」（セキュアなuwsgi、SSLを介したuwsgi）を指定できます。アドレスは、ドメイン名またはIPアドレス、およびポートとして指定できます。
ru: Устанавливает протокол и адрес uwsgi-сервера. В качестве <code><i>protocol</i></code> можно указать &laquo; <code>uwsgi</code> &raquo; или &laquo; <code>suwsgi</code> &raquo; (защищенный uwsgi, uwsgi через SSL). Адрес может быть указан как доменное имя или IP-адрес, а также порт:
zh_cn: 设置uwsgi服务器的协议和地址。作为 <code><i>protocol</i></code> ，&ldquo; <code>uwsgi</code> &rdquo;或&ldquo; <code>suwsgi</code> &rdquo;（担保uwsgi，uwsgi通过SSL）可以被指定。该地址可以指定为域名或IP地址以及端口：

source: Sets the protocol for a proxied server. Supported protocols are <a href="ngx_mail_imap_module">IMAP</a>, <a href="ngx_mail_pop3_module">POP3</a>, and <a href="ngx_mail_smtp_module">SMTP</a>.
ja: プロキシされたサーバーのプロトコルを設定します。サポートされるプロトコルは、<a href="ngx_mail_imap_module">IMAP</a>、<a href="ngx_mail_pop3_module">POP3</a>、および<a href="ngx_mail_smtp_module">SMTP</a>です。
ru: Устанавливает протокол для прокси-сервера. Поддерживаемые протоколы: <a href="ngx_mail_imap_module">IMAP</a> , <a href="ngx_mail_pop3_module">POP3</a> и <a href="ngx_mail_smtp_module">SMTP</a> .
zh_cn: 设置代理服务器的协议。支持的协议为<a href="ngx_mail_imap_module">IMAP</a>，<a href="ngx_mail_pop3_module">POP3</a>和<a href="ngx_mail_smtp_module">SMTP</a>。

source: Sets the request <code><i>variable</i></code> to the given <code><i>value</i></code> after the authorization request completes. The value may contain variables from the authorization request, such as <code>$upstream_http_*</code>.
ja: 認証リクエストが完了した後、リクエスト <code><i>variable</i></code> を指定された <code><i>value</i></code> に設定します。値には、 <code>$upstream_http_*</code> などの認証リクエストからの変数を含めることができます。
ru: Устанавливает для <code><i>variable</i></code> запроса заданное <code><i>value</i></code> после завершения запроса авторизации. Значение может содержать переменные из запроса авторизации, например <code>$upstream_http_*</code> .
zh_cn: 授权请求完成后，将请求 <code><i>variable</i></code> 设置为给定 <code><i>value</i></code> 。该值可以包含授权请求中的变量，例如 <code>$upstream_http_*</code> 。

source: Sets the root directory for requests. For example, with the following configuration
ja: リクエストのルートディレクトリを設定します。例えば、次のような設定の場合
ru: Устанавливает корневую директорию для запросов.Например,со следующей конфигурацией
zh_cn: 设置请求的根目录。例如,使用以下配置

source: Sets the server name that is used:
ja: 使用するサーバー名を設定します。
ru: Устанавливает используемое имя сервера:
zh_cn: 设置使用的服务器名称。

source: Sets the shared memory zone and the maximum allowed number of connections for a given key value. When this limit is exceeded, the server will close the connection. For example, the directives
ja: 共有メモリゾーンと、指定されたキー値に対して許可される最大接続数を設定します。この制限を超えると、サーバは接続を終了します。例えば
ru: Устанавливает зону разделяемой памяти и максимально допустимое количество подключений для заданного ключевого значения.При превышении этого предела сервер закроет соединение.Например,директивы
zh_cn: 设置共享内存区和给定键值的最大允许连接数。当超过这个限制时,服务器将关闭连接。例如,指令

source: Sets the shared memory zone and the maximum allowed number of connections for a given key value. When this limit is exceeded, the server will return the <a href="#limit_conn_status">error</a> in reply to a request. For example, the directives
ja: 共有メモリゾーンと、指定されたキー値の最大許容接続数を設定します。この制限を超えると、サーバーはリクエストに応答して<a href="#limit_conn_status">エラー</a>を返します。たとえば、ディレクティブ
ru: Устанавливает зону общей памяти и максимально допустимое количество подключений для данного значения ключа. При превышении этого лимита сервер вернет <a href="#limit_conn_status">ошибку</a> в ответ на запрос. Например, директивы
zh_cn: 设置共享内存区域和给定键值的最大允许连接数。当超过此限制时，服务器将返回<a href="#limit_conn_status">错误</a>以回复请求。例如，指令

source: Sets the shared memory zone and the maximum burst size of requests. If the requests rate exceeds the rate configured for a zone, their processing is delayed such that requests are processed at a defined rate. Excessive requests are delayed until their number exceeds the maximum burst size in which case the request is terminated with an <a href="#limit_req_status">error</a>. By default, the maximum burst size is equal to zero. For example, the directives
ja: 共有メモリゾーンとリクエストの最大バーストサイズを設定します。リクエストレートがゾーンに設定されたレートを超える場合、リクエストの処理は遅延され、リクエストは定義されたレートで処理されます。過剰なリクエストは、その数が最大バーストサイズを超えるまで遅延され<a href="#limit_req_status">ます</a>。この場合、リクエストはエラーで終了します。デフォルトでは、最大バーストサイズはゼロです。たとえば、ディレクティブ
ru: Устанавливает зону разделяемой памяти и максимальный размер пакета запросов. Если частота запросов превышает скорость, настроенную для зоны, их обработка откладывается, так что запросы обрабатываются с определенной скоростью. Чрезмерные запросы задерживаются до тех пор, пока их количество не превысит максимальный размер пакета, и в этом случае запрос завершается с <a href="#limit_req_status">ошибкой</a> . По умолчанию максимальный размер пакета равен нулю. Например, директивы
zh_cn: 设置共享内存区域和请求的最大突发大小。如果请求速率超过为区域配置的速率，则会延迟其处理，以便以定义的速率处理请求。过多的请求将被延迟，直到其数量超过最大突发大小为止，在这种情况下，该请求将因<a href="#limit_req_status">错误</a>而终止。默认情况下，最大突发大小等于零。例如，指令

source: Sets the size of the buffer used for proxying. By default, the buffer size is equal to one memory page. Depending on a platform, it is either 4K or 8K.
ja: プロキシに使用するバッファのサイズを設定します。デフォルトでは、バッファサイズは1メモリページに相当します。プラットフォームに応じて、4K または 8K のいずれかになります。
ru: Устанавливает размер буфера,используемого для проксирования.По умолчанию размер буфера равен одной странице памяти.В зависимости от платформы,он может быть либо 4K,либо 8K.
zh_cn: 设置用于代理的缓冲区的大小,默认情况下,缓冲区大小等于一个内存页。默认情况下,缓冲区大小等于一个内存页。根据平台的不同,缓冲区大小为4K或8K。

source: Sets the size of the buffer used for sending data.
ja: データ送信に使用するバッファのサイズを設定します。
ru: Устанавливает размер буфера,используемого для отправки данных.
zh_cn: 设置用于发送数据的缓冲区大小。
