Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/nginx/nginx.*.004.xlf
Languages: es, ja, ko, ru, zh_cn

source: Sets the size of the per <a href="../ngx_core_module#worker_processes">worker</a> input buffer.
ja: <a href="../ngx_core_module#worker_processes">ワーカー</a>ごとの入力バッファーのサイズを設定します。
ru: Устанавливает размер буфера ввода для каждого <a href="../ngx_core_module#worker_processes">рабочего</a> .
zh_cn: 设置每个<a href="../ngx_core_module#worker_processes">工作程序</a>输入缓冲区的大小。

source: Sets the status code to return in response to rejected requests.
ja: 拒否されたリクエストに応答して返すステータスコードを設定します。
ru: Устанавливает код статуса для возврата в ответ на отклоненные запросы.
zh_cn: 设置拒绝请求时返回的状态码。

source: Sets the tag of syslog messages. Default is &ldquo;<code>nginx</code>&rdquo;.
ja: syslogメッセージのタグを設定します。デフォルトは「 <code>nginx</code> 」です。
ru: Устанавливает тег сообщений системного журнала. По умолчанию - &laquo; <code>nginx</code> &raquo;.
zh_cn: 设置系统日志消息的标签。默认值为&ldquo; <code>nginx</code> &rdquo;。

source: Sets the text that should be changed in the &ldquo;Location&rdquo; and &ldquo;Refresh&rdquo; header fields of a proxied server response. Suppose a proxied server returned the header field &ldquo;<code>Location: http://localhost:8000/two/some/uri/</code>&rdquo;. The directive
ja: プロキシされるサーバー応答の「Location」および「Refresh」ヘッダーフィールドで変更する必要があるテキストを設定します。プロキシされたサーバーがヘッダーフィールド「 <code>Location: http://localhost:8000/two/some/uri/</code> 」を返したとします。ディレクティブ
ru: Задает текст, который необходимо изменить в полях заголовка &laquo;Местоположение&raquo; и &laquo;Обновить&raquo; ответа проксируемого сервера. Предположим, прокси-сервер вернул поле заголовка &laquo; <code>Location: http://localhost:8000/two/some/uri/</code> &raquo;. Директива
zh_cn: 设置应在代理服务器响应的&ldquo;位置&rdquo;和&ldquo;刷新&rdquo;标头字段中更改的文本。假设代理服务器返回了标头字段&ldquo; <code>Location: http://localhost:8000/two/some/uri/</code> &rdquo;。指令

source: Sets the timeout for communication with the authentication server.
ja: 認証サーバとの通信のタイムアウトを設定します。
ru: Устанавливает таймаут для связи с сервером аутентификации.
zh_cn: 设置与认证服务器通信的超时。

source: Sets the timeout for expecting more data from the client, after which the connection is closed.
ja: クライアントからより多くのデータを期待するためのタイムアウトを設定し、その後、接続を閉じます。
ru: Устанавливает тайм-аут для ожидания от клиента большего количества данных,после чего соединение закрывается.
zh_cn: 设置从客户端获取更多数据的超时时间,超时后关闭连接。

source: Sets the timeout of inactivity after which the connection is closed.
ja: 接続を終了するまでの非アクティブ状態のタイムアウトを設定します。
ru: Устанавливает тайм-аут бездействия,по истечении которого соединение закрывается.
zh_cn: 设置关闭连接的非活动时间。

source: Sets the timeout that is used before proxying to the backend starts.
ja: バックエンドへのプロキシを開始する前に使用するタイムアウトを設定します。
ru: Устанавливает таймаут,который используется перед началом проксирования на бэкэнд.
zh_cn: 设置向后端代理开始前的超时。

source: Sets the type of transformation to perform on images:
ja: 画像に対して実行する変換の種類を設定します。
ru: Устанавливает тип преобразования для выполнения на изображениях:
zh_cn: 设置要对图像执行的变换类型。

source: Sets the types and sizes of caches that store session parameters. A cache can be of any of the following types:
ja: セッションパラメータを保存するキャッシュのタイプとサイズを設定します。キャッシュは以下のタイプのいずれかになります。
ru: Устанавливает типы и размеры кэшей,в которых хранятся параметры сессии.Кэш может быть любого из следующих типов:
zh_cn: 设置存储会话参数的缓存类型和大小。缓存可以是以下任何一种类型。

source: Sets the value of the <code>modifier1</code> field in the <a href="http://uwsgi-docs.readthedocs.org/en/latest/Protocol.html#uwsgi-packet-header">uwsgi packet header</a>.
ja: <a href="http://uwsgi-docs.readthedocs.org/en/latest/Protocol.html#uwsgi-packet-header">uwsgiパケットヘッダーの</a> <code>modifier1</code> フィールドの値を設定します。
ru: Устанавливает значение поля <code>modifier1</code> в <a href="http://uwsgi-docs.readthedocs.org/en/latest/Protocol.html#uwsgi-packet-header">заголовке пакета uwsgi</a> .
zh_cn: 设置的值 <code>modifier1</code> 字段在<a href="http://uwsgi-docs.readthedocs.org/en/latest/Protocol.html#uwsgi-packet-header">uwsgi分组报头</a>。

source: Sets the value of the <code>modifier2</code> field in the <a href="http://uwsgi-docs.readthedocs.org/en/latest/Protocol.html#uwsgi-packet-header">uwsgi packet header</a>.
ja: <a href="http://uwsgi-docs.readthedocs.org/en/latest/Protocol.html#uwsgi-packet-header">uwsgiパケットヘッダーの</a> <code>modifier2</code> フィールドの値を設定します。
ru: Устанавливает значение поля <code>modifier2</code> в <a href="http://uwsgi-docs.readthedocs.org/en/latest/Protocol.html#uwsgi-packet-header">заголовке пакета uwsgi</a> .
zh_cn: 设置的值 <code>modifier2</code> 字段在<a href="http://uwsgi-docs.readthedocs.org/en/latest/Protocol.html#uwsgi-packet-header">uwsgi分组报头</a>。

source: Sets the verification depth in another cluster server certificates chain.
ja: 別のクラスタサーバ証明書チェーンの検証深度を設定します。
ru: Устанавливает глубину проверки в другой цепочке серверных сертификатов кластера.
zh_cn: 设置另一个集群服务器证书链的验证深度。

source: Sets the verification depth in the client certificates chain.
ja: クライアント証明書チェインの検証深度を設定します。
ru: Устанавливает глубину проверки в цепочке клиентских сертификатов.
zh_cn: 设置客户证书链的验证深度。

source: Sets the verification depth in the gRPC SSL server certificates chain.
ja: gRPC SSLサーバ証明書チェーンの検証深度を設定します。
ru: Устанавливает глубину проверки в цепочке сертификатов сервера gRPC SSL.
zh_cn: 设置gRPC SSL服务器证书链的验证深度。

source: Sets the verification depth in the proxied HTTPS server certificates chain.
ja: プロキシされた HTTPS サーバ証明書チェーンの検証深度を設定します。
ru: Устанавливает глубину проверки в цепочке прокси-серверных сертификатов HTTPS.
zh_cn: 设置代理HTTPS服务器证书链的验证深度。

source: Sets the verification depth in the proxied server certificates chain.
ja: プロキシされたサーバ証明書チェインの検証深度を設定します。
ru: Устанавливает глубину проверки в цепочке прокси-серверных сертификатов.
zh_cn: 设置代理服务器证书链的验证深度。

source: Sets the verification depth in the secured uwsgi server certificates chain.
ja: セキュリティ保護された uwsgi サーバ証明書チェーンの検証深度を設定します。
ru: Устанавливает глубину проверки в защищенной цепочке сертификатов сервера uwsgi.
zh_cn: 设置安全的wsgi服务器证书链的验证深度。

source: Setting Up FastCGI Proxying
ja: FastCGI プロキシの設定
ru: Настройка FastCGI-проксирования
zh_cn: 设置FastCGI代理

source: Setting Up a Simple Proxy Server
ja: 簡易プロキシサーバの設定
ru: Настройка простого прокси-сервера
zh_cn: 设置一个简单的代理服务器

source: Setting up NGINX Plus environment on Amazon EC2
ja: Amazon EC2上にNGINX Plus環境を設定する
ru: Настройка среды NGINX Plus на Amazon EC2
zh_cn: 在Amazon EC2上设置NGINX Plus环境。

source: Setting up hashes
ja: ハッシュの設定
ru: Установка хэшей
zh_cn: 设置哈希值

source: Several <code>grpc_ssl_conf_command</code> directives can be specified on the same level. These directives are inherited from the previous configuration level if and only if there are no <code>grpc_ssl_conf_command</code> directives defined on the current level.
ja: 複数の <code>grpc_ssl_conf_command</code> ディレクティブを同じレベルで指定できます。これらのディレクティブは、現在のレベルで <code>grpc_ssl_conf_command</code> ディレクティブが定義されていない場合にのみ、前の構成レベルから継承されます。
zh_cn: 可以在同一级别上指定几个 <code>grpc_ssl_conf_command</code> 指令。当且仅当当前级别上未定义 <code>grpc_ssl_conf_command</code> 指令时，这些指令才从先前的配置级别继承。

source: Several <code>http2_push</code> directives can be specified on the same configuration level. The <code>off</code> parameter cancels the effect of the <code>http2_push</code> directives inherited from the previous configuration level.
ja: 複数の <code>http2_push</code> ディレクティブを同じ構成レベルで指定できます。 <code>off</code> パラメータは、効果解除 <code>http2_push</code> の前の設定レベルから継承された指令を。
ru: На одном уровне конфигурации можно указать несколько директив <code>http2_push</code> . Параметр <code>off</code> отменяет действие директив <code>http2_push</code> , унаследованных от предыдущего уровня конфигурации.
zh_cn: 可以在同一配置级别上指定几个 <code>http2_push</code> 指令。的 <code>off</code> 参数取消的效果 <code>http2_push</code> 从以前的配置级别继承指令。

source: Several <code>js_import</code> directives can be specified.
ja: いくつかの <code>js_import</code> ディレクティブを指定できます。
zh_cn: 可以指定几个 <code>js_import</code> 指令。

source: Several <code>proxy_cookie_domain</code> directives can be specified on the same level:
ja: 同じレベルで複数の <code>proxy_cookie_domain</code> ディレクティブを指定できます。
zh_cn: 可以在同一级别上指定几个 <code>proxy_cookie_domain</code> 指令：

source: Several <code>proxy_cookie_flags</code> directives can be specified on the same configuration level:
ja: 同じ構成レベルで複数の <code>proxy_cookie_flags</code> ディレクティブを指定できます。
zh_cn: 可以在同一配置级别上指定几个 <code>proxy_cookie_flags</code> 指令：

source: Several <code>proxy_cookie_path</code> directives can be specified on the same level:
ja: 同じレベルで複数の <code>proxy_cookie_path</code> ディレクティブを指定できます。
zh_cn: 可以在同一级别上指定几个 <code>proxy_cookie_path</code> 指令：

source: Several <code>proxy_redirect</code> directives can be specified on the same level:
ja: 同じレベルで複数の <code>proxy_redirect</code> ディレクティブを指定できます。
zh_cn: 可以在同一级别上指定几个 <code>proxy_redirect</code> 指令：

source: Several <code>proxy_ssl_conf_command</code> directives can be specified on the same level. These directives are inherited from the previous configuration level if and only if there are no <code>proxy_ssl_conf_command</code> directives defined on the current level.
ja: 複数の <code>proxy_ssl_conf_command</code> ディレクティブを同じレベルで指定できます。これらのディレクティブは、現在のレベルで <code>proxy_ssl_conf_command</code> ディレクティブが定義されていない場合にのみ、前の構成レベルから継承されます。
zh_cn: 可以在同一级别上指定几个 <code>proxy_ssl_conf_command</code> 指令。当且仅当当前级别上没有定义 <code>proxy_ssl_conf_command</code> 指令时，这些指令才从先前的配置级别继承。

source: Several <code>ssl_conf_command</code> directives can be specified on the same level:
ja: 同じレベルで複数の <code>ssl_conf_command</code> ディレクティブを指定できます。
zh_cn: 可以在同一级别上指定几个 <code>ssl_conf_command</code> 指令：

source: Several <code>uwsgi_ssl_conf_command</code> directives can be specified on the same level. These directives are inherited from the previous configuration level if and only if there are no <code>uwsgi_ssl_conf_command</code> directives defined on the current level.
ja: 複数の <code>uwsgi_ssl_conf_command</code> ディレクティブを同じレベルで指定できます。これらのディレクティブは、現在のレベルで <code>uwsgi_ssl_conf_command</code> ディレクティブが定義されていない場合にのみ、前の構成レベルから継承されます。
zh_cn: 可以在同一级别上指定几个 <code>uwsgi_ssl_conf_command</code> 指令。当且仅当当前级别上未定义 <code>uwsgi_ssl_conf_command</code> 指令时，这些指令才从先前的配置级别继承。

source: Several functions for numeric conversion are implemented in nginx. The first four each convert a string of given length to a positive integer of the indicated type. They return <code>NGX_ERROR</code> on error.
ja: 数値変換用のいくつかの関数がnginxに実装されています。最初の4つはそれぞれ、指定された長さの文字列を指定された型の正の整数に変換します。エラー時に <code>NGX_ERROR</code> を返します。
ru: В nginx реализовано несколько функций для преобразования чисел. Первые четыре преобразуют строку заданной длины в положительное целое число указанного типа. В <code>NGX_ERROR</code> ошибки они возвращают NGX_ERROR .
zh_cn: nginx中实现了一些用于数字转换的函数。前四个分别将给定长度的字符串转换为指示类型的正整数。错误时返回 <code>NGX_ERROR</code> 。

source: Several requests specified on one page and processed by proxied or FastCGI/uwsgi/SCGI/gRPC servers run in parallel. If sequential processing is desired, the <code>wait</code> parameter should be used.
ja: 1つのページで指定され、プロキシサーバーまたはFastCGI / uwsgi / SCGI / gRPCサーバーによって処理されるいくつかのリクエストは、並行して実行されます。順次処理が必要な場合は、 <code>wait</code> パラメーターを使用する必要があります。
ru: Несколько запросов, указанных на одной странице и обрабатываемых прокси-серверами или серверами FastCGI / uwsgi / SCGI / gRPC, выполняются параллельно. Если требуется последовательная обработка, следует использовать параметр <code>wait</code> .
zh_cn: 在一页上指定并由代理服务器或FastCGI / uwsgi / SCGI / gRPC服务器处理的多个请求并行运行。如果需要顺序处理，则应使用 <code>wait</code> 参数。

source: Severity of error messages is determined by nginx, thus the parameter is ignored in the <code>error_log</code> directive.
ja: エラーメッセージの重大度はnginxによって決定されるため、 <code>error_log</code> ディレクティブのパラメーターは無視されます。
ru: Серьезность сообщений об ошибках определяется nginx, поэтому параметр игнорируется в директиве <code>error_log</code> .
zh_cn: 错误消息的严重性由nginx决定，因此在 <code>error_log</code> 指令中将忽略该参数。

source: Shared memory
ja: 共有メモリ
ru: Общая память
zh_cn: 共享内存

source: Shared memory is used by nginx to share common data between processes. The <code>ngx_shared_memory_add(cf, name, size, tag)</code> function adds a new shared memory entry <code>ngx_shm_zone_t</code> to a cycle. The function receives the <code>name</code> and <code>size</code> of the zone. Each shared zone must have a unique name. If a shared zone entry with the provided <code>name</code> and <code>tag</code> already exists, the existing zone entry is reused. The function fails with an error if an existing entry with the same name has a different tag. Usually, the address of the module structure is passed as <code>tag</code>, making it possible to reuse shared zones by name within one nginx module.
ja: 共有メモリは、プロセス間で共通のデータを共有するためにnginxによって使用されます。 <code>ngx_shared_memory_add(cf, name, size, tag)</code> 関数は、新しい共有メモリエントリ追加 <code>ngx_shm_zone_t</code> を循環します。関数はゾーンの <code>name</code> と <code>size</code> を受け取ります。各共有ゾーンには一意の名前を付ける必要があります。指定された <code>name</code> と <code>tag</code> 持つ共有ゾーンエントリがすでに存在する場合、既存のゾーンエントリが再利用されます。同じ名前の既存のエントリに異なるタグがある場合、関数はエラーで失敗します。通常、モジュール構造のアドレスは <code>tag</code> として渡されるため、1つのnginxモジュール内で名前で共有ゾーンを再利用することができます。
ru: Общая память используется nginx для обмена общими данными между процессами. Функция <code>ngx_shared_memory_add(cf, name, size, tag)</code> добавляет в цикл новую запись общей памяти <code>ngx_shm_zone_t</code> . Функция получает <code>name</code> и <code>size</code> зоны. Каждая общая зона должна иметь уникальное имя. Если запись общей зоны с указанным <code>name</code> и <code>tag</code> уже существует, существующая запись зоны используется повторно. Функция завершается ошибкой, если существующая запись с тем же именем имеет другой тег. Обычно адрес структуры модуля передается как <code>tag</code> , что позволяет повторно использовать разделяемые зоны по имени в одном модуле nginx.
zh_cn: Nginx使用共享内存在进程之间共享公共数据。该 <code>ngx_shared_memory_add(cf, name, size, tag)</code> 功能增加了一个新的共享存储记录 <code>ngx_shm_zone_t</code> 一个周期。该函数接收区域的 <code>name</code> 和 <code>size</code> 。每个共享区域必须具有唯一的名称。如果具有提供的 <code>name</code> 和 <code>tag</code> 的共享区域条目已经存在，则现有的区域条目将被重用。如果具有相同名称的现有条目具有不同的标记，则该函数将失败并显示错误。通常，模块结构的地址作为 <code>tag</code> 传递，从而可以在一个nginx模块中按名称重用共享区域。

source: Shared memory zone with slab allocator:
ja: スラブアロケータと共有メモリゾーン。
ru: Общая зона памяти с аллокатором слябов:
zh_cn: 带板块分配器的共享内存区。

source: Shared zone entries are mapped to actual memory in <code>ngx_init_cycle()</code> after the configuration is parsed. On POSIX systems, the <code>mmap()</code> syscall is used to create the shared anonymous mapping. On Windows, the <code>CreateFileMapping()</code>/ <code>MapViewOfFileEx()</code> pair is used.
ja: 設定が解析された後、共有ゾーンエントリは <code>ngx_init_cycle()</code> で実際のメモリにマップされます。POSIXシステムでは、 <code>mmap()</code> syscallを使用して共有匿名マッピングを作成します。Windowsでは、 <code>CreateFileMapping()</code> / <code>MapViewOfFileEx()</code> ペアが使用されます。
ru: Записи общих зон отображаются в фактическую память в <code>ngx_init_cycle()</code> после анализа конфигурации. В системах POSIX для создания общего анонимного сопоставления используется системный вызов <code>mmap()</code> . В Windows используется пара <code>CreateFileMapping()</code> / <code>MapViewOfFileEx()</code> .
zh_cn: 解析配置后，共享区域条目将映射到 <code>ngx_init_cycle()</code> 中的实际内存。在POSIX系统上， <code>mmap()</code> syscall用于创建共享的匿名映射。在Windows上，使用 <code>CreateFileMapping()</code> / <code>MapViewOfFileEx()</code> 对。

source: Similar formatting rules are applied to &ldquo;<code>do</code>&rdquo; and &ldquo;<code>while</code>&rdquo; loops:
ja: 「 <code>do</code> 」および「 <code>while</code> 」ループにも同様のフォーマット規則が適用されます。
ru: Аналогичные правила форматирования применяются к циклам &laquo; <code>do</code> &raquo; и &laquo; <code>while</code> &raquo;:
zh_cn: 类似的格式设置规则适用于&ldquo; <code>do</code> &rdquo;和&ldquo; <code>while</code> &rdquo;循环：

source: Since <a href="changes#njs0.3.8">0.3.8</a>, if a <code>callback</code> is not provided, the <code>Promise</code> object that resolves to the subrequest response object is returned.
ja: <a href="changes#njs0.3.8">0.3.8</a>以降、 <code>callback</code> が提供されていない場合、サブリクエスト応答オブジェクトに解決される <code>Promise</code> オブジェクトが返されます。
zh_cn: 从<a href="changes#njs0.3.8">0.3.8开始</a>，如果未提供 <code>callback</code> ，则返回解析为子请求响应对象的 <code>Promise</code> 对象。

source: Since OpenSSL 0.9.8j this option is enabled by default. If nginx was built with SNI support, then nginx will show this when run with the &ldquo;-V&rdquo; switch:
ja: OpenSSL 0.9.8j以降、このオプションはデフォルトで有効になっています。nginxがSNIサポートを使用してビルドされている場合、nginxは「-V」スイッチを指定して実行するとこれを表示します。
ru: Начиная с OpenSSL 0.9.8j, эта опция включена по умолчанию. Если nginx был собран с поддержкой SNI, то nginx покажет это при запуске с ключом &laquo;-V&raquo;:
zh_cn: 从OpenSSL 0.9.8j开始，默认情况下启用此选项。如果nginx是使用SNI支持构建的，则当使用&ldquo; -V&rdquo;开关运行时，nginx将显示此信息：

source: Since addresses in a group are not required to be unique, specific servers in a group are referenced by their IDs. IDs are assigned automatically and shown when adding a new server or viewing the group configuration.
ja: グループ内のアドレスは一意である必要はないので、グループ内の特定のサーバーはそのIDで参照されます。IDは自動的に割り当てられ、新しいサーバーを追加したり、グループ構成を表示したりするときに表示されます。
ru: Так как адреса в группе не обязательно должны быть уникальными,на конкретные серверы в группе ссылаются по их идентификаторам.ID-адреса назначаются автоматически и отображаются при добавлении нового сервера или просмотре групповой конфигурации.
zh_cn: 由于不要求组中的地址是唯一的,所以组中的特定服务器由其ID引用。ID会自动分配,并在添加新服务器或查看组配置时显示。

source: Since most allocations in nginx are made from nginx internal <a href="#pool">pool</a>, enabling ASan may not always be enough to debug memory issues. The internal pool allocates a big chunk of memory from the system and cuts smaller allocations from it. However, this mechanism can be disabled by setting the <code>NGX_DEBUG_PALLOC</code> macro to <code>1</code>. In this case, allocations are passed directly to the system allocator giving it full control over the buffers boundaries.
ja: nginxのほとんどの割り当てはnginx内部<a href="#pool">プール</a>から行われるため、ASanを有効にしてもメモリの問題をデバッグするのに必ずしも十分ではない場合があります。内部プールは、システムからメモリの大きなチャンクを割り当て、システムから小さな割り当てをカットします。ただし、このメカニズムは、 <code>NGX_DEBUG_PALLOC</code> マクロを <code>1</code> に設定することで無効にできます。この場合、割り当てはシステムアロケータに直接渡され、バッファ境界を完全に制御できます。
zh_cn: 由于nginx中的大多数分配都是由nginx内部<a href="#pool">池进行的</a>，因此启用ASan可能并不总是足以调试内存问题。内部池从系统分配大量内存，并从系统中减少较小的分配。但是，可以通过将 <code>NGX_DEBUG_PALLOC</code> 宏设置为 <code>1</code> 来禁用此机制。在这种情况下，分配将直接传递到系统分配器，从而完全控制缓冲区边界。

source: Since variables are evaluated only when they are used, the mere declaration even of a large number of &ldquo;<code>map</code>&rdquo; variables does not add any extra costs to connection processing.
ja: 変数は使用時にのみ評価されるため、多数の「 <code>map</code> 」変数を宣言するだけでも、接続処理に余分なコストがかかることはありません。
ru: Поскольку переменные оцениваются только тогда, когда они используются, простое объявление даже большого количества &laquo; <code>map</code> &raquo; переменных не добавляет дополнительных затрат на обработку соединения.
zh_cn: 由于仅在使用变量时才对它们进行求值，因此即使是大量&ldquo; <code>map</code> &rdquo;变量的声明也不会增加连接处理的额外成本。

source: Since variables are evaluated only when they are used, the mere declaration even of a large number of &ldquo;<code>map</code>&rdquo; variables does not add any extra costs to request processing.
ja: 変数は使用時にのみ評価されるため、多数の「 <code>map</code> 」変数を宣言するだけで、リクエスト処理に余分なコストがかかることはありません。
ru: Поскольку переменные оцениваются только тогда, когда они используются, простое объявление даже большого количества &laquo; <code>map</code> &raquo; переменных не добавляет дополнительных затрат на обработку запроса.
zh_cn: 由于仅在使用变量时才对它们进行求值，因此即使是大量&ldquo; <code>map</code> &rdquo;变量的简单声明也不会为请求处理增加任何额外成本。

source: Since variables are evaluated only when used, the mere existence of even a large number of declared &ldquo;<code>geo</code>&rdquo; variables does not cause any extra costs for connection processing.
ja: 変数は使用時にのみ評価されるため、宣言された「 <code>geo</code> 」変数が多数存在するだけで、接続処理に追加のコストが発生することはありません。
ru: Поскольку переменные оцениваются только при использовании, простое существование даже большого количества объявленных &laquo; <code>geo</code> &raquo; переменных не вызывает каких-либо дополнительных затрат на обработку соединения.
zh_cn: 由于仅在使用变量时才对其进行评估，因此即使仅存在大量声明的&ldquo; <code>geo</code> &rdquo;变量也不会为连接处理带来任何额外成本。

source: Since variables are evaluated only when used, the mere existence of even a large number of declared &ldquo;<code>geo</code>&rdquo; variables does not cause any extra costs for request processing.
ja: 変数は使用時にのみ評価されるため、宣言された「 <code>geo</code> 」変数が多数存在するだけで、リクエスト処理に追加のコストが発生することはありません。
ru: Поскольку переменные оцениваются только при использовании, простое существование даже большого количества объявленных &laquo; <code>geo</code> &raquo; переменных не вызывает каких-либо дополнительных затрат на обработку запроса.
zh_cn: 由于仅在使用变量时才对其进行评估，因此即使仅存在大量声明的&ldquo; <code>geo</code> &rdquo;变量也不会为请求处理带来任何额外成本。

source: Since version 0.8.48, this is the default setting for the server name, so the <code>server_name ""</code> can be omitted. In earlier versions, the machine&rsquo;s
ja: バージョン0.8.48以降、これはサーバー名のデフォルト設定であるため、 <code>server_name ""</code> は省略できます。以前のバージョンでは、マシンの
ru: Начиная с версии 0.8.48, это значение по умолчанию для имени сервера, поэтому <code>server_name ""</code> можно не указывать. В более ранних версиях машина
zh_cn: 从版本0.8.48开始，这是服务器名称的默认设置，因此可以省略 <code>server_name ""</code> 。在早期版本中，机器的

source: Since version 1.11.0, this directive can be specified multiple times to load certificates of different types, for example, RSA and ECDSA:
ja: バージョン 1.11.0 以降では、このディレクティブを複数回指定して、RSA や ECDSA などの異なるタイプの証明書を読み込むことができます。
ru: Начиная с версии 1.11.0,эту директиву можно указывать несколько раз для загрузки сертификатов разных типов,например,RSA и ECDSA:
zh_cn: 从1.11.0版本开始,这条指令可以指定多次来加载不同类型的证书,例如RSA和ECDSA。

source: Since version 1.15.9, variables can be used in the <code><i>file</i></code> name when using OpenSSL 1.0.2 or higher.
ja: バージョン1.15.9以降、OpenSSL 1.0.2以降を使用する場合、 <code><i>file</i></code> 名に変数を使用できます。
ru: Начиная с версии 1.15.9, переменные могут использоваться в имени <code><i>file</i></code> при использовании OpenSSL 1.0.2 или выше.
zh_cn: 从1.15.9版开始，使用OpenSSL 1.0.2或更高版本时，可以在 <code><i>file</i></code> 名中使用变量。

source: Since version 1.15.9, variables can be used in the <code><i>file</i></code> name when using OpenSSL 1.0.2 or higher:
ja: バージョン1.15.9以降、OpenSSL 1.0.2以降を使用する場合、 <code><i>file</i></code> 名に変数を使用できます。
ru: Начиная с версии 1.15.9, при использовании OpenSSL 1.0.2 и выше в имени <code><i>file</i></code> можно использовать переменные :
zh_cn: 从1.15.9版开始，使用OpenSSL 1.0.2或更高版本时，可以在 <code><i>file</i></code> 名中使用变量：

source: Since version 1.17.2, the method accepts escaped URIs and supports redirections to named locations.
ja: バージョン 1.17.2 以降、このメソッドはエスケープされた URI を受け入れ、名前付きの場所へのリダイレクトをサポートしています。
ru: Начиная с версии 1.17.2,метод принимает экранированные URI и поддерживает перенаправления в именованные места.
zh_cn: 从1.17.2版本开始,该方法接受转义的URI,并支持重定向到命名的位置。

source: Since version 1.3.13, nginx implements special mode of operation that allows setting up a tunnel between a client and proxied server if the proxied server returned a response with the code 101 (Switching Protocols), and the client asked for a protocol switch via the &ldquo;Upgrade&rdquo; header in a request.
ja: バージョン1.3.13以降、nginxは特別な動作モードを実装しており、プロキシサーバーがコード101（Switching Protocols）で応答を返し、クライアントがリクエストの「アップグレード」ヘッダー。
ru: Начиная с версии 1.3.13, nginx реализует специальный режим работы, который позволяет настроить туннель между клиентом и прокси-сервером, если проксируемый сервер вернул ответ с кодом 101 (протоколы переключения), а клиент запросил переключение протокола через Заголовок &laquo;Обновление&raquo; в запросе.
zh_cn: 从1.3.13版开始，nginx实施了特殊的操作模式，如果代理服务器返回了代码为101（交换协议）的响应，并且客户端通过请求中的&ldquo;升级&rdquo;标头。
