Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/nginx/nginx.*.004.xlf
Languages: es, ja, ko, ru, zh_cn

source: The variable&rsquo;s value is made available in locations processed by the <a href="ngx_http_proxy_module#proxy_pass">proxy_pass</a>, <a href="ngx_http_fastcgi_module#fastcgi_pass">fastcgi_pass</a>, <a href="ngx_http_uwsgi_module#uwsgi_pass">uwsgi_pass</a>, and <a href="ngx_http_scgi_module#scgi_pass">scgi_pass</a> directives when the request body was read to a <a href="#client_body_buffer_size">memory buffer</a>.
es: El valor de la variable est&aacute; disponible en ubicaciones procesadas por las <a href="ngx_http_fastcgi_module#fastcgi_pass">directivas </a><a href="ngx_http_proxy_module#proxy_pass">proxy_pass</a> , fastcgi_pass , <a href="ngx_http_uwsgi_module#uwsgi_pass">uwsgi_pass</a> y <a href="ngx_http_scgi_module#scgi_pass">scgi_pass</a> cuando el cuerpo de la solicitud se lee en un <a href="#client_body_buffer_size">b&uacute;fer de memoria</a> .
ko: 변수의 값은 요청 본문을 <a href="#client_body_buffer_size">메모리 버퍼</a> 로 읽을 때 <a href="ngx_http_proxy_module#proxy_pass">proxy_pass</a> , <a href="ngx_http_fastcgi_module#fastcgi_pass">fastcgi_pass</a> , <a href="ngx_http_uwsgi_module#uwsgi_pass">uwsgi_pass</a> 및 <a href="ngx_http_scgi_module#scgi_pass">scgi_pass</a> 지시문으로 처리 된 위치에서 사용 가능 합니다 .

source: The way nginx and its modules work is determined in the configuration file. By default, the configuration file is named <code>nginx.conf</code> and placed in the directory <code>/usr/local/nginx/conf</code>, <code>/etc/nginx</code>, or <code>/usr/local/etc/nginx</code>.
es: La forma en que funcionan nginx y sus m&oacute;dulos se determina en el archivo de configuraci&oacute;n. Por defecto, el archivo de configuraci&oacute;n se llama <code>nginx.conf</code> y se coloca en el directorio <code>/usr/local/nginx/conf</code> , <code>/etc/nginx</code> o <code>/usr/local/etc/nginx</code> .
ko: nginx 및 해당 모듈의 작동 방식은 구성 파일에서 결정됩니다. 기본적으로 구성 파일 이름은 <code>nginx.conf</code> 이며 <code>/usr/local/nginx/conf</code> , <code>/etc/nginx</code> 또는 <code>/usr/local/etc/nginx</code> 디렉토리에 있습니다.

source: The zero value disables buffering of responses to temporary files.
es: El valor cero desactiva el almacenamiento en memoria intermedia de las respuestas a los archivos temporales.
ko: 값이 0이면 임시 파일에 대한 응답 버퍼링이 비활성화됩니다.

source: Then the <code>debug</code> level should be set with the <a href="ngx_core_module#error_log">error_log</a> directive:
es: Luego, el nivel de <code>debug</code> debe establecerse con la directiva <a href="ngx_core_module#error_log">error_log</a> :
ko: 그런 다음 <a href="ngx_core_module#error_log">error_log</a> 지시문을 사용 하여 <code>debug</code> 레벨을 설정해야합니다 .

source: Then the modules should be compiled using the <code>--add-module</code> configuration parameter:
es: Luego, los m&oacute;dulos deben compilarse usando el par&aacute;metro de configuraci&oacute;n <code>--add-module</code> :
ko: 그런 다음 <code>--add-module</code> 구성 매개 변수를 사용하여 모듈을 컴파일해야합니다 .

source: Then there&rsquo;s the <code>ngx_http_process_request_t</code> structure that contains a lot of pointers to other structures. Because these pointers are really irrelevant to this script, and because they have the same size, it is possible to just replace them with void pointers. Instead of changing definitions, it is better to add appropriate typedefs, though:
es: Luego est&aacute; la estructura <code>ngx_http_process_request_t</code> que contiene muchos punteros a otras estructuras. Debido a que estos punteros son realmente irrelevantes para este script y debido a que tienen el mismo tama&ntilde;o, es posible reemplazarlos con punteros vac&iacute;os. Sin embargo, en lugar de cambiar las definiciones, es mejor agregar typedefs adecuadas:
ko: 그런 다음 다른 구조에 대한 많은 포인터를 포함하는 <code>ngx_http_process_request_t</code> 구조가 있습니다. 이러한 포인터는이 스크립트와 관련이 없으며 크기가 동일하기 때문에 포인터를 void 포인터로 대체 할 수 있습니다. 정의를 변경하는 대신 적절한 typedef를 추가하는 것이 좋습니다.

source: There are many <a href="http/ngx_http_proxy_module">more</a> directives that may be used to further configure a proxy connection.
es: Hay muchas <a href="http/ngx_http_proxy_module">m&aacute;s</a> directivas que se pueden utilizar para configurar a&uacute;n m&aacute;s una conexi&oacute;n proxy.
ko: 프록시 연결을 추가로 구성하는 데 사용할 수있는 지시문이 <a href="http/ngx_http_proxy_module">더</a> 많이 있습니다.

source: There are other ways that allow sharing a single IP address between several HTTPS servers. However, all of them have their drawbacks. One way is to use a certificate with several names in the SubjectAltName certificate field, for example, <code>www.example.com</code> and <code>www.example.org</code>. However, the SubjectAltName field length is limited.
es: Hay otras formas que permiten compartir una &uacute;nica direcci&oacute;n IP entre varios servidores HTTPS. Sin embargo, todos tienen sus inconvenientes. Una forma es utilizar un certificado con varios nombres en el campo de certificado SubjectAltName, por ejemplo, <code>www.example.com</code> y <code>www.example.org</code> . Sin embargo, la longitud del campo SubjectAltName es limitada.
ko: 여러 HTTPS 서버간에 단일 IP 주소를 공유 할 수있는 다른 방법이 있습니다. 그러나 그들 모두 단점이 있습니다. 한 가지 방법은 SubjectAltName 인증서 필드에 여러 이름의 인증서를 사용하는 것입니다 (예 : <code>www.example.com</code> 및 <code>www.example.org</code> ) . 그러나 SubjectAltName 필드 길이는 제한되어 있습니다.

source: There are several types of processes in nginx. The type of a process is kept in the <code>ngx_process</code> global variable, and is one of the following:
es: Hay varios tipos de procesos en nginx. El tipo de proceso se mantiene en la variable global <code>ngx_process</code> y es uno de los siguientes:
ko: nginx에는 여러 유형의 프로세스가 있습니다. 프로세스 유형은 <code>ngx_process</code> 전역 변수에 유지되며 다음 중 하나입니다.

source: There are some server names that are treated specially.
es: Hay algunos nombres de servidores que son tratados especialmente.
ko: 특별히 취급되는 일부 서버 이름이 있습니다.

source: There are two additional numeric conversion functions. Like the first four, they return <code>NGX_ERROR</code> on error.
es: Hay dos funciones de conversi&oacute;n num&eacute;ricas adicionales. Como los primeros cuatro, devuelven <code>NGX_ERROR</code> en caso de error.
ko: 두 가지 추가 숫자 변환 기능이 있습니다. 처음 네 개와 마찬가지로 오류가 발생하면 <code>NGX_ERROR</code> 를 반환 합니다.

source: There are two basic usage scenarios when an external request is needed:
es: Hay dos escenarios básicos de uso cuando se necesita una solicitud externa:
ko: 외부 요청이 필요한 경우 두 가지 기본 사용 시나리오가 있습니다.

source: There are two types of strings in njs: a Unicode string (default) and a byte string.
es: Hay dos tipos de cadenas en njs:una cadena Unicode (por defecto)y una cadena de bytes.
ko: njs에는 두 가지 유형의 문자열 인 유니 코드 문자열 (기본값)과 바이트 문자열이 있습니다.

source: There could be several <code>add_header</code> directives. These directives are inherited from the previous level if and only if there are no <code>add_header</code> directives defined on the current level.
es: Podr&iacute;a haber varias directivas <code>add_header</code> . Estas directivas se heredan del nivel anterior si y solo si no hay directivas <code>add_header</code> definidas en el nivel actual.
ko: <code>add_header</code> 지시문 이 여러 개있을 수 있습니다 . 이러한 지시문은 현재 레벨에 정의 된 <code>add_header</code> 지시문 이없는 경우에만 이전 레벨에서 상속 됩니다.

source: There could be several <code>add_trailer</code> directives. These directives are inherited from the previous level if and only if there are no <code>add_trailer</code> directives defined on the current level.
es: Podr&iacute;a haber varias directivas <code>add_trailer</code> . Estas directivas se heredan del nivel anterior si y solo si no hay directivas <code>add_trailer</code> definidas en el nivel actual.
ko: <code>add_trailer</code> 지시문 이 여러 개있을 수 있습니다 . 이러한 지시문은 현재 레벨에 정의 된 <code>add_trailer</code> 지시문 이없는 경우에만 이전 레벨에서 상속 됩니다.

source: There could be several <code>limit_conn</code> directives. For example, the following configuration will limit the number of connections to the server per a client IP and, at the same time, the total number of connections to the virtual server:
es: Podr&iacute;a haber varias directivas <code>limit_conn</code> . Por ejemplo, la siguiente configuraci&oacute;n limitar&aacute; el n&uacute;mero de conexiones al servidor por IP de cliente y, al mismo tiempo, el n&uacute;mero total de conexiones al servidor virtual:
ko: <code>limit_conn</code> 지시문 이 여러 개있을 수 있습니다 . 예를 들어 다음 구성은 클라이언트 IP 당 서버에 대한 연결 수와 가상 서버에 대한 총 연결 수를 제한합니다.

source: There could be several <code>limit_req</code> directives. For example, the following configuration will limit the processing rate of requests coming from a single IP address and, at the same time, the request processing rate by the virtual server:
es: Podr&iacute;a haber varias directivas <code>limit_req</code> . Por ejemplo, la siguiente configuraci&oacute;n limitar&aacute; la tasa de procesamiento de solicitudes provenientes de una &uacute;nica direcci&oacute;n IP y, al mismo tiempo, la tasa de procesamiento de solicitudes por parte del servidor virtual:
ko: <code>limit_req</code> 지시문 이 여러 개있을 수 있습니다 . 예를 들어 다음 구성은 단일 IP 주소에서 오는 요청의 처리 속도와 가상 서버의 요청 처리 속도를 제한합니다.

source: There could be several <code>proxy_cookie_domain</code> directives:
es: Podr&iacute;a haber varias directivas <code>proxy_cookie_domain</code> :
ko: <code>proxy_cookie_domain</code> 지시문 이 여러 개있을 수 있습니다 .

source: There could be several <code>proxy_cookie_path</code> directives:
es: Podr&iacute;a haber varias directivas <code>proxy_cookie_path</code> :
ko: 여러 <code>proxy_cookie_path</code> 지시문 이있을 수 있습니다 .

source: There could be several <code>proxy_redirect</code> directives:
es: Podr&iacute;a haber varias directivas <code>proxy_redirect</code> :
ko: 여러 <code>proxy_redirect</code> 지시문 이있을 수 있습니다 .

source: There could be several <code>xslt_param</code> directives. These directives are inherited from the previous level if and only if there are no <code>xslt_param</code> and <a href="#xslt_string_param">xslt_string_param</a> directives defined on the current level.
es: Podr&iacute;a haber varias directivas <code>xslt_param</code> . Estas directivas se heredan del nivel anterior si y solo si no hay directivas <code>xslt_param</code> y <a href="#xslt_string_param">xslt_string_param</a> definidas en el nivel actual.
ko: 여러 <code>xslt_param</code> 지시문 이있을 수 있습니다 . 이러한 지시문은 현재 레벨에 정의 된 <code>xslt_param</code> 및 <a href="#xslt_string_param">xslt_string_param</a> 지시문 이없는 경우에만 이전 레벨에서 상속 됩니다.

source: There could be several <code>xslt_string_param</code> directives. These directives are inherited from the previous level if and only if there are no <a href="#xslt_param">xslt_param</a> and <code>xslt_string_param</code> directives defined on the current level.
es: Podr&iacute;a haber varias directivas <code>xslt_string_param</code> . Estas directivas se heredan del nivel anterior si y solo si no hay directivas <a href="#xslt_param">xslt_param</a> y <code>xslt_string_param</code> definidas en el nivel actual.
ko: 여러 <code>xslt_string_param</code> 지시문 이있을 수 있습니다 . 이러한 지시문은 현재 레벨에 정의 된 <a href="#xslt_param">xslt_param</a> 및 <code>xslt_string_param</code> 지시문 이없는 경우에만 이전 레벨에서 상속 됩니다.

source: There is a bunch of commonly used type/name combinations:
es: Hay un montón de combinaciones de tipo/nombre comúnmente usadas:
ko: 일반적으로 사용되는 여러 유형 / 이름 조합이 있습니다.

source: There is a limit of 10 internal redirects per request to prevent request processing cycles that can occur in incorrect configurations. If this limit is reached, the error 500 (Internal Server Error) is returned. In such cases, the &ldquo;rewrite or internal redirection cycle&rdquo; message can be seen in the error log.
es: Hay un l&iacute;mite de 10 redireccionamientos internos por solicitud para evitar ciclos de procesamiento de solicitudes que pueden ocurrir en configuraciones incorrectas. Si se alcanza este l&iacute;mite, se devuelve el error 500 (Error interno del servidor). En tales casos, el mensaje de "reescritura o ciclo de redireccionamiento interno" se puede ver en el registro de errores.
ko: 잘못된 구성에서 발생할 수있는 요청 처리주기를 방지하기 위해 요청 당 10 개의 내부 리디렉션이 제한되어 있습니다. 이 한계에 도달하면 오류 500 (내부 서버 오류)이 리턴됩니다. 이러한 경우 "다시 쓰기 또는 내부 리디렉션주기"메시지가 오류 로그에 표시 될 수 있습니다.

source: There is a possibility that the main process and then worker processes will grow in size after every reconfiguration. If the main process grows to an unacceptable size, the <a href="../control#upgrade">live upgrade</a> procedure can be applied without changing the executable file.
es: Existe la posibilidad de que el proceso principal y luego los procesos de trabajo aumenten de tama&ntilde;o despu&eacute;s de cada reconfiguraci&oacute;n. Si el proceso principal crece a un tama&ntilde;o inaceptable, el procedimiento de <a href="../control#upgrade">actualizaci&oacute;n en vivo</a> se puede aplicar sin cambiar el archivo ejecutable.
ko: 기본 프로세스와 작업자 프로세스는 재구성 할 때마다 크기가 커질 수 있습니다. 기본 프로세스가 허용 할 수없는 크기로 커지면 실행 파일을 변경하지 않고 <a href="../control#upgrade">라이브 업그레이드</a> 절차를 적용 할 수 있습니다.

source: There is also a standalone <a href="cli">command line</a> utility that can be used independently of nginx for njs development and debugging.
es: Tambi&eacute;n hay una utilidad de <a href="cli">l&iacute;nea de comandos</a> independiente que se puede usar independientemente de nginx para el desarrollo y la depuraci&oacute;n de njs.
ko: njs 개발 및 디버깅을 위해 nginx와 독립적으로 사용할 수 있는 독립형 <a href="cli">명령 행</a> 유틸리티도 있습니다.

source: There is no need to enable <code>accept_mutex</code> on systems that support the <a href="events#epoll">EPOLLEXCLUSIVE</a> flag (1.11.3) or when using <a href="http/ngx_http_core_module#reuseport">reuseport</a>.
es: No hay necesidad para que <code>accept_mutex</code> en sistemas que soportan la <a href="events#epoll">EPOLLEXCLUSIVE</a> indicador (1.11.3) o cuando se utiliza <a href="http/ngx_http_core_module#reuseport">reuseport</a> .
ko: 수 있도록 할 필요가 없습니다 <code>accept_mutex</code> 를 지원 시스템에 <a href="events#epoll">EPOLLEXCLUSIVE를</a> 사용하는 경우 플래그 (1.11.3) 또는 <a href="http/ngx_http_core_module#reuseport">reuseport은</a> .

source: There is no space after the function name and opening parenthesis. Long function calls are wrapped such that continuation lines start from the position of the first function argument. If this is impossible, format the first continuation line such that it ends at position 79:
es: No hay espacio después del nombre de la función y del paréntesis de apertura.Las llamadas a funciones largas están envueltas de tal manera que las líneas de continuación comienzan desde la posición del primer argumento de la función.Si esto es imposible,formatea la primera línea de continuación de tal manera que termine en la posición 79:
ko: 함수 이름과 여는 괄호 뒤에 공백이 없습니다. 긴 함수 호출은 연속 행이 첫 번째 함수 인수의 위치에서 시작되도록 줄 바꿈됩니다. 이것이 불가능한 경우, 첫 번째 연속 행을 위치 79에서 끝나도록 형식화하십시오.

source: There is nothing special about this name, it is just one of a myriad of invalid domain names which never intersect with any real name. Other invalid names like &ldquo;<code>--</code>&rdquo; and &ldquo;<code>!@#</code>&rdquo; may equally be used.
es: No hay nada especial en este nombre, es solo uno de una mir&iacute;ada de nombres de dominio inv&aacute;lidos que nunca se cruzan con ning&uacute;n nombre real. Tambi&eacute;n se pueden utilizar otros nombres no v&aacute;lidos como &ldquo; <code>--</code> &rdquo; y &ldquo; <code>!@#</code> &rdquo;.
ko: 이 이름에는 특별한 것이 없으며 실제 이름과 절대 교차하지 않는 무수한 잘못된 도메인 이름 중 하나 일뿐입니다. &ldquo; <code>--</code> &rdquo;및&ldquo; <code>!@#</code> &rdquo; 과 같은 다른 잘못된 이름도 동일하게 사용할 수 있습니다.

source: There is one subtlety however: since the &ldquo;Upgrade&rdquo; is a <a href="https://tools.ietf.org/html/rfc2616#section-13.5.1">hop-by-hop</a> header, it is not passed from a client to proxied server. With forward proxying, clients may use the <code>CONNECT</code> method to circumvent this issue. This does not work with reverse proxying however, since clients are not aware of any proxy servers, and special processing on a proxy server is required.
es: Sin embargo, hay una sutileza: dado que la "actualizaci&oacute;n" es un encabezado <a href="https://tools.ietf.org/html/rfc2616#section-13.5.1">salto a salto</a> , no se pasa de un cliente a un servidor proxy. Con el proxy de reenv&iacute;o, los clientes pueden utilizar el m&eacute;todo <code>CONNECT</code> para evitar este problema. Sin embargo, esto no funciona con el proxy inverso, ya que los clientes no conocen ning&uacute;n servidor proxy y se requiere un procesamiento especial en un servidor proxy.
ko: 그러나 "업그레이드"는 <a href="https://tools.ietf.org/html/rfc2616#section-13.5.1">홉별</a> 헤더이기 때문에 클라이언트에서 프록시 서버로 전달되지 않습니다. 정방향 프록시를 사용하면 클라이언트가 <code>CONNECT</code> 메서드를 사용 하여이 문제를 피할 수 있습니다 . 그러나 클라이언트가 프록시 서버를 인식하지 못하고 프록시 서버에서의 특수 처리가 필요하므로 리버스 프록시에서는 작동하지 않습니다.

source: These directives are inherited from the previous level if and only if there are no <code>error_page</code> directives defined on the current level.
es: Estas directivas se heredan del nivel anterior si y solo si no hay directivas <code>error_page</code> definidas en el nivel actual.
ko: 이러한 지시문은 현재 레벨에 정의 된 <code>error_page</code> 지시문 이없는 경우에만 이전 레벨에서 상속 됩니다.

source: These directives are inherited from the previous level if and only if there are no <code>limit_conn</code> directives on the current level.
es: Estas directivas se heredan del nivel anterior si y solo si no hay directivas <code>limit_conn</code> en el nivel actual.
ko: 이러한 지시문은 현재 레벨에 <code>limit_conn</code> 지시문 이없는 경우에만 이전 레벨에서 상속 됩니다.

source: These directives are inherited from the previous level if and only if there are no <code>limit_req</code> directives on the current level.
es: Estas directivas se heredan del nivel anterior si y solo si no hay directivas <code>limit_req</code> en el nivel actual.
ko: 이러한 지시문은 현재 레벨에 <code>limit_req</code> 지시문 이없는 경우에만 이전 레벨에서 상속 됩니다.

source: These macros receive a reference to an HTTP request <code>ngx_http_request_t</code>. The main configuration of a request never changes. Server configuration can change from the default after the virtual server for the request is chosen. Location configuration selected for processing a request can change multiple times as a result of a rewrite operation or internal redirect. The following example shows how to access a module's HTTP configuration at runtime.
es: Estas macros reciben una referencia a una solicitud HTTP <code>ngx_http_request_t</code> . La configuraci&oacute;n principal de una solicitud nunca cambia. La configuraci&oacute;n del servidor puede cambiar de la predeterminada despu&eacute;s de que se elige el servidor virtual para la solicitud. La configuraci&oacute;n de ubicaci&oacute;n seleccionada para procesar una solicitud puede cambiar varias veces como resultado de una operaci&oacute;n de reescritura o redirecci&oacute;n interna. El siguiente ejemplo muestra c&oacute;mo acceder a la configuraci&oacute;n HTTP de un m&oacute;dulo en tiempo de ejecuci&oacute;n.
ko: 이 매크로는 HTTP 요청 <code>ngx_http_request_t</code> 에 대한 참조를 받습니다 . 요청의 기본 구성은 변경되지 않습니다. 요청에 대한 가상 서버가 선택된 후 서버 구성이 기본값에서 변경 될 수 있습니다. 요청을 처리하기 위해 선택한 위치 구성은 다시 쓰기 작업 또는 내부 리디렉션의 결과로 여러 번 변경 될 수 있습니다. 다음 예제는 런타임시 모듈의 HTTP 구성에 액세스하는 방법을 보여줍니다.

source: This <code>location</code> block specifies the &ldquo;<code>/</code>&rdquo; prefix compared with the URI from the request. For matching requests, the URI will be added to the path specified in the <a href="http/ngx_http_core_module#root">root</a> directive, that is, to <code>/data/www</code>, to form the path to the requested file on the local file system. If there are several matching <code>location</code> blocks nginx selects the one with the longest prefix. The <code>location</code> block above provides the shortest prefix, of length one, and so only if all other <code>location</code> blocks fail to provide a match, this block will be used.
es: Este bloque de <code>location</code> especifica el prefijo " <code>/</code> " en comparaci&oacute;n con el URI de la solicitud. Para solicitudes coincidentes, el URI se agregar&aacute; a la ruta especificada en la directiva <a href="http/ngx_http_core_module#root">ra&iacute;z</a> , es decir, a <code>/data/www</code> , para formar la ruta al archivo solicitado en el sistema de archivos local. Si hay varios bloques de <code>location</code> coincidentes , nginx selecciona el que tiene el prefijo m&aacute;s largo. El bloque de <code>location</code> anterior proporciona el prefijo m&aacute;s corto, de longitud uno, por lo que solo si todos los dem&aacute;s bloques de <code>location</code> no proporcionan una coincidencia, se utilizar&aacute; este bloque.
ko: 이 <code>location</code> 블록 은 요청의 URI와 비교 하여 " <code>/</code> "접두사를 지정합니다 . 일치하는 요청의 경우 로컬 파일 시스템에서 요청 된 파일의 경로를 형성하기 위해 <a href="http/ngx_http_core_module#root">루트</a> 지시문에 지정된 경로 , 즉 <code>/data/www</code> 에 URI가 추가됩니다 . 일치하는 <code>location</code> 블록 이 여러 개인 경우 nginx는 가장 긴 접두사를 가진 블록을 선택합니다. 위 의 <code>location</code> 블록은 길이가 1 인 가장 짧은 접두사를 제공하므로 다른 모든 <code>location</code> 블록이 일치하지 않는 경우에만 이 블록이 사용됩니다.

source: This allows performing a random seeking at any time, or starting playback in the middle of the timeline.
es: Esto permite realizar una búsqueda aleatoria en cualquier momento,o iniciar la reproducción en medio de la línea de tiempo.
ko: 이를 통해 언제든지 임의 검색을 수행하거나 타임 라인 중간에 재생을 시작할 수 있습니다.

source: This article assumes the reader has a general knowledge of nginx internals and <a href="#see_also">DTrace</a>.
es: Este art&iacute;culo asume que el lector tiene un conocimiento general de los componentes internos de nginx y <a href="#see_also">DTrace</a> .
ko: 이 기사는 독자가 nginx internals와 <a href="#see_also">DTrace에</a> 대한 일반적인 지식을 가지고 있다고 가정합니다 .

source: This causes an internal redirect to the specified <code><i>uri</i></code> with the client request method changed to &ldquo;<code>GET</code>&rdquo; (for all methods other than &ldquo;<code>GET</code>&rdquo; and &ldquo;<code>HEAD</code>&rdquo;).
es: Esto provoca una redirecci&oacute;n interna al <code><i>uri</i></code> especificado con el m&eacute;todo de solicitud del cliente cambiado a " <code>GET</code> " (para todos los m&eacute;todos que no sean " <code>GET</code> " y " <code>HEAD</code> ").
ko: 이로 인해 클라이언트 요청 메소드가 " <code>GET</code> "( " <code>GET</code> "및 " <code>HEAD</code> " 이외의 모든 메소드)으로 변경된 상태 에서 지정된 <code><i>uri</i></code> 로 내부 경로 재 지정됩니다 .

source: This command should be executed under the same user that started nginx.
es: Este comando debe ser ejecutado bajo el mismo usuario que inició nginx.
ko: 이 명령은 nginx를 시작한 동일한 사용자로 실행해야합니다.

source: This configuration creates a simple web page with basic status data which may look like as follows:
es: Esta configuración crea una simple página web con datos básicos de estado que puede tener el siguiente aspecto:
ko: 이 구성은 다음과 같은 기본 상태 데이터가 포함 된 간단한 웹 페이지를 만듭니다.

source: This configuration shows that in order for a health check to pass, the response to a health check request should succeed, have status 200, and contain &ldquo;<code>Welcome to nginx!</code>&rdquo; in the body.
es: Esta configuraci&oacute;n muestra que para que se apruebe una verificaci&oacute;n de estado, la respuesta a una solicitud de verificaci&oacute;n de estado debe tener &eacute;xito, tener el estado 200 y contener &ldquo;&iexcl; <code>Welcome to nginx!</code> " en el cuerpo.
ko: 이 구성은 상태 확인을 통과하려면 상태 확인 요청에 대한 응답이 성공하고 상태가 200이며 " <code>Welcome to nginx!</code> 몸에.

source: This directive appeared in version 0.3.0.
es: Esta directiva apareció en la versión 0.3.0.
ko: 이 지시문은 버전 0.3.0에 나타났습니다.

source: This directive appeared in version 0.6.23.
es: Esta directiva apareció en la versión 0.6.23.
ko: 이 지시문은 버전 0.6.23에 나타났습니다.

source: This directive appeared in version 0.7.2.
es: Esta directiva apareció en la versión 0.7.2.
ko: 이 지시문은 버전 0.7.2에 나타났습니다.

source: This directive appeared in version 0.7.24.
es: Esta directiva apareció en la versión 0.7.24.
ko: 이 지시문은 버전 0.7.24에 나타났습니다.
