Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/nginx/nginx.*.004.xlf
Languages: es, ja, ko, ru, zh_cn

source: To create a hash that works with wildcards, use the <code>ngx_hash_combined_t</code> type. It includes the hash type described above and has two additional keys arrays: <code>dns_wc_head</code> and <code>dns_wc_tail</code>. The initialization of basic properties is similar to a regular hash:
es: Para crear un hash que funcione con comodines, use el tipo <code>ngx_hash_combined_t</code> . Incluye el tipo de hash descrito anteriormente y tiene dos matrices de claves adicionales: <code>dns_wc_head</code> y <code>dns_wc_tail</code> . La inicializaci&oacute;n de propiedades b&aacute;sicas es similar a un hash regular:
ko: 와일드 카드와 함께 작동하는 해시를 만들려면 <code>ngx_hash_combined_t</code> 유형을 사용하십시오 . 위에서 설명한 해시 유형을 포함하고 <code>dns_wc_head</code> 및 <code>dns_wc_tail</code> 두 개의 추가 키 배열이 있습니다. 기본 속성의 초기화는 일반 해시와 유사합니다.

source: To create a variable, use the <code>ngx_http_add_variable()</code> function. It takes as arguments a configuration (where the variable is registered), the variable name and flags that control the function's behaviour:
es: Para crear una variable, use la funci&oacute;n <code>ngx_http_add_variable()</code> . Toma como argumentos una configuraci&oacute;n (donde se registra la variable), el nombre de la variable y banderas que controlan el comportamiento de la funci&oacute;n:
ko: 변수를 만들려면 <code>ngx_http_add_variable()</code> 함수를 사용하십시오 . 함수 (변수가 등록 된) 구성, 변수 이름 및 함수의 동작을 제어하는 ​​플래그를 인수로 사용합니다.

source: To deal with a tree as a whole, you need two nodes: root and sentinel. Typically, they are added to a custom structure, allowing you to organize your data into a tree in which the leaves contain a link to or embed your data.
es: Para tratar con un árbol en su conjunto,se necesitan dos nodos:raíz y centinela.Normalmente se añaden a una estructura personalizada,lo que permite organizar los datos en un árbol en el que las hojas contienen un enlace o incrustación de los datos.
ko: 트리 전체를 다루려면 루트와 센티넬이라는 두 개의 노드가 필요합니다. 일반적으로 사용자 정의 구조에 추가되어 잎에 데이터에 대한 링크를 포함하거나 포함하는 트리로 데이터를 구성 할 수 있습니다.

source: To deal with synchronization, the following wrappers over <code>pthreads</code> primitives are available:
es: Para hacer frente a la sincronizaci&oacute;n, est&aacute;n disponibles los siguientes contenedores sobre primitivas <code>pthreads</code> :
ko: 동기화를 처리하기 위해 <code>pthreads</code> 프리미티브에 대한 다음 랩퍼를 사용할 수 있습니다.

source: To enable a debugging log, nginx needs to be configured to support debugging during the build:
es: Para habilitar un registro de depuración,nginx necesita ser configurado para soportar la depuración durante la construcción:
ko: 디버깅 로그를 활성화하려면 빌드 도중 디버깅을 지원하도록 nginx를 구성해야합니다.

source: To initialize a tree:
es: Para inicializar un árbol:
ko: 트리를 초기화하려면

source: To insert keys into a hash keys array, use the <code>ngx_hash_add_key(keys_array, key, value, flags)</code> function:
es: Para insertar claves en una matriz de claves hash, use la funci&oacute;n <code>ngx_hash_add_key(keys_array, key, value, flags)</code> :
ko: 해시 키 배열에 키를 삽입하려면 <code>ngx_hash_add_key(keys_array, key, value, flags)</code> 함수를 사용하십시오.

source: To install nginx/Windows, <a href="https://nginx.org/en/download.html">download</a> the latest mainline version distribution (1.17.2), since the mainline branch of nginx contains all known fixes. Then unpack the distribution, go to the nginx-1.17.2 directory, and run <code>nginx</code>. Here is an example for the drive C: root directory:
es: Para instalar nginx / Windows, <a href="https://nginx.org/en/download.html">descargue</a> la &uacute;ltima distribuci&oacute;n de la versi&oacute;n principal (1.17.2), ya que la rama principal de nginx contiene todas las correcciones conocidas. Luego descomprima la distribuci&oacute;n, vaya al directorio nginx-1.17.2 y ejecute <code>nginx</code> . Aqu&iacute; hay un ejemplo para el directorio ra&iacute;z de la unidad C::
ko: nginx / Windows를 설치하려면 nginx 의 메인 라인 분기에 알려진 모든 수정 사항이 포함되어 있으므로 최신 메인 라인 버전 배포 (1.17.2)를 <a href="https://nginx.org/en/download.html">다운로드</a> 하십시오. 그런 다음, 배포를 풀고의 nginx-1.17.2 디렉토리로 이동하고, 실행 <code>nginx</code> . 다음은 C 드라이브의 루트 디렉토리 예입니다.

source: To make a particular location emit the &ldquo;<code>application/octet-stream</code>&rdquo; MIME type for all requests, the following configuration can be used:
es: Para hacer que una ubicaci&oacute;n en particular emita el tipo MIME " <code>application/octet-stream</code> " para todas las solicitudes, se puede utilizar la siguiente configuraci&oacute;n:
ko: 특정 위치 에서 모든 요청에 ​​대해 " <code>application/octet-stream</code> "MIME 유형을 내보내려면 다음 구성을 사용할 수 있습니다.

source: To mark an existing server as &ldquo;<code>down</code>&rdquo;, send:
es: Para marcar un servidor existente como " <code>down</code> ", env&iacute;e:
ko: 기존 서버를 " <code>down</code> " 으로 표시하려면 다음을 전송하십시오.

source: To minimize the number of accesses to FastCGI servers when populating a new cache element, the <a href="#fastcgi_cache_lock">fastcgi_cache_lock</a> directive can be used.
es: Para minimizar el n&uacute;mero de accesos a los servidores FastCGI cuando se <a href="#fastcgi_cache_lock">llena</a> un nuevo elemento de cach&eacute;, se puede usar la directiva fastcgi_cache_lock .
ko: 새 캐시 요소를 <a href="#fastcgi_cache_lock">채울</a> 때 FastCGI 서버에 대한 액세스 수를 최소화하기 위해 fastcgi_cache_lock 지시문을 사용할 수 있습니다.

source: To minimize the number of accesses to SCGI servers when populating a new cache element, the <a href="#scgi_cache_lock">scgi_cache_lock</a> directive can be used.
es: Para minimizar el n&uacute;mero de accesos a los servidores SCGI cuando se <a href="#scgi_cache_lock">llena</a> un nuevo elemento de cach&eacute;, se puede utilizar la directiva scgi_cache_lock .
ko: 새 캐시 요소를 <a href="#scgi_cache_lock">채울</a> 때 SCGI 서버에 대한 액세스 수를 최소화하기 위해 scgi_cache_lock 지시문을 사용할 수 있습니다.

source: To minimize the number of accesses to proxied servers when populating a new cache element, the <a href="#proxy_cache_lock">proxy_cache_lock</a> directive can be used.
es: Para minimizar el n&uacute;mero de accesos a servidores proxy cuando se <a href="#proxy_cache_lock">llena</a> un nuevo elemento de cach&eacute;, se puede usar la directiva proxy_cache_lock .
ko: 새 캐시 요소를 <a href="#proxy_cache_lock">채울</a> 때 프록시 서버에 대한 액세스 수를 최소화하기 위해 proxy_cache_lock 지시문을 사용할 수 있습니다.

source: To minimize the number of accesses to uwsgi servers when populating a new cache element, the <a href="#uwsgi_cache_lock">uwsgi_cache_lock</a> directive can be used.
es: Para minimizar el n&uacute;mero de accesos a los servidores uwsgi cuando se llena un nuevo elemento de cach&eacute;, se puede usar la directiva <a href="#uwsgi_cache_lock">uwsgi_cache_lock</a> .
ko: 새 캐시 요소를 채울 때 uwsgi 서버에 대한 액세스 수를 최소화하기 위해 <a href="#uwsgi_cache_lock">uwsgi_cache_lock</a> 지시문을 사용할 수 있습니다.

source: To modify other parameters of an existing server, send:
es: Para modificar otros parámetros de un servidor existente,enviar:
ko: 기존 서버의 다른 매개 변수를 수정하려면 다음을 전송하십시오.

source: To modify the address of an existing server, send:
es: Para modificar la dirección de un servidor existente,enviar:
ko: 기존 서버의 주소를 수정하려면 다음을 전송하십시오.

source: To obtain the current time, it is usually sufficient to access one of the available global variables, representing the cached time value in the desired format.
es: Para obtener la hora actual,suele bastar con acceder a una de las variables globales disponibles,que representa el valor de tiempo en caché en el formato deseado.
ko: 현재 시간을 얻으려면 일반적으로 캐시 된 시간 값을 원하는 형식으로 나타내는 사용 가능한 전역 변수 중 하나에 액세스하는 것으로 충분합니다.

source: To obtain the time explicitly, use <code>ngx_gettimeofday()</code>, which updates its argument (pointer to <code>struct timeval</code>). The time is always updated when nginx returns to the event loop from system calls. To update the time immediately, call <code>ngx_time_update()</code>, or <code>ngx_time_sigsafe_update()</code> if updating the time in the signal handler context.
es: Para obtener la hora expl&iacute;citamente, use <code>ngx_gettimeofday()</code> , que actualiza su argumento (puntero a <code>struct timeval</code> ). La hora siempre se actualiza cuando nginx vuelve al bucle de eventos desde las llamadas al sistema. Para actualizar la hora inmediatamente, llame a <code>ngx_time_update()</code> o <code>ngx_time_sigsafe_update()</code> si est&aacute; actualizando la hora en el contexto del manejador de se&ntilde;ales.
ko: 시간을 명시 적으로 얻으려면 <code>ngx_gettimeofday()</code> 사용 하여 인수를 업데이트합니다 ( <code>struct timeval</code> 포인터 ). nginx가 시스템 호출에서 이벤트 루프로 돌아올 때 시간이 항상 업데이트됩니다. 신호 핸들러 컨텍스트에서 시간을 업데이트하는 경우 시간을 즉시 업데이트하려면 <code>ngx_time_update()</code> 또는 <code>ngx_time_sigsafe_update()</code> 호출 하십시오 .

source: To prevent DNS spoofing, it is recommended configuring DNS servers in a properly secured trusted local network.
es: Para evitar el "spoofing" de DNS,se recomienda configurar los servidores de DNS en una red local de confianza debidamente asegurada.
ko: DNS 스푸핑을 방지하려면 올바르게 보안 된 신뢰할 수있는 로컬 네트워크에서 DNS 서버를 구성하는 것이 좋습니다.

source: To prevent unauthorized access, the expression may contain some information about the client, such as its address and browser version.
es: Para evitar el acceso no autorizado,la expresión puede contener alguna información sobre el cliente,como su dirección y la versión del navegador.
ko: 무단 액세스를 방지하기 위해 표현식에는 클라이언트의 주소 및 브라우저 버전과 같은 일부 정보가 포함될 수 있습니다.

source: To protect data in shared memory from concurrent access, use the mutex available in the <code>mutex</code> field of <code>ngx_slab_pool_t</code>. A mutex is most commonly used by the slab pool while allocating and freeing memory, but it can be used to protect any other user data structures allocated in the shared zone. To lock or unlock a mutex, call <code>ngx_shmtx_lock(&amp;shpool-&gt;mutex)</code> or <code>ngx_shmtx_unlock(&amp;shpool-&gt;mutex)</code> respectively.
es: Para proteger los datos en la memoria compartida del acceso concurrente, use el mutex disponible en el campo <code>mutex</code> de <code>ngx_slab_pool_t</code> . Un mutex es el m&aacute;s com&uacute;nmente utilizado por el grupo de bloques al asignar y liberar memoria, pero se puede usar para proteger cualquier otra estructura de datos de usuario asignada en la zona compartida. Para bloquear o desbloquear un mutex, llame a <code>ngx_shmtx_lock(&amp;shpool-&gt;mutex)</code> o <code>ngx_shmtx_unlock(&amp;shpool-&gt;mutex)</code> respectivamente.
ko: 공유 메모리의 데이터를 동시 액세스로부터 보호하려면 <code>ngx_slab_pool_t</code> 의 <code>mutex</code> 필드 에서 사용 가능한 mutex를 사용하십시오 . 뮤텍스는 메모리를 할당하고 해제하는 동안 슬랩 풀에서 가장 일반적으로 사용되지만 공유 영역에 할당 된 다른 사용자 데이터 구조를 보호하는 데 사용할 수 있습니다. 뮤텍스를 잠 그거나 잠금 해제하려면 <code>ngx_shmtx_lock(&amp;shpool-&gt;mutex)</code> 또는 <code>ngx_shmtx_unlock(&amp;shpool-&gt;mutex)</code> 각각 호출하십시오 .

source: To quickly process static sets of data such as server names, <a href="http/ngx_http_map_module#map">map</a> directive&rsquo;s values, MIME types, names of request header strings, nginx uses hash tables. During the start and each re-configuration nginx selects the minimum possible sizes of hash tables such that the bucket size that stores keys with identical hash values does not exceed the configured parameter (hash bucket size). The size of a table is expressed in buckets. The adjustment is continued until the table size exceeds the hash max size parameter. Most hashes have the corresponding directives that allow changing these parameters, for example, for the server names hash they are <a href="http/ngx_http_core_module#server_names_hash_max_size">server_names_hash_max_size</a> and <a href="http/ngx_http_core_module#server_names_hash_bucket_size">server_names_hash_bucket_size</a>.
es: Para procesar r&aacute;pidamente conjuntos de datos est&aacute;ticos como nombres de servidores, valores de directivas de <a href="http/ngx_http_map_module#map">mapas</a> , tipos MIME, nombres de cadenas de encabezado de solicitud, nginx usa tablas hash. Durante el inicio y cada reconfiguraci&oacute;n, nginx selecciona los tama&ntilde;os m&iacute;nimos posibles de tablas hash, de modo que el tama&ntilde;o del dep&oacute;sito que almacena claves con valores hash id&eacute;nticos no supere el par&aacute;metro configurado (tama&ntilde;o del dep&oacute;sito hash). El tama&ntilde;o de una tabla se expresa en cubos. El ajuste contin&uacute;a hasta que el tama&ntilde;o de la tabla excede el par&aacute;metro de tama&ntilde;o m&aacute;ximo de hash. La mayor&iacute;a de hashes tienen las directivas correspondientes que permiten cambiar estos par&aacute;metros, por ejemplo, para el hash de nombres de servidor son <a href="http/ngx_http_core_module#server_names_hash_max_size">server_names_hash_max_size</a> y <a href="http/ngx_http_core_module#server_names_hash_bucket_size">server_names_hash_bucket_size</a> .
ko: 서버 이름, <a href="http/ngx_http_map_module#map">맵</a> 지시문 값, MIME 유형, 요청 헤더 문자열 이름과 같은 정적 데이터 세트를 빠르게 처리하기 위해 nginx는 해시 테이블을 사용합니다. 시작 및 각 재구성 중에 nginx는 해시 값이 동일한 키를 저장하는 버킷 크기가 구성된 매개 변수 (해시 버킷 크기)를 초과하지 않도록 가능한 최소 해시 테이블 크기를 선택합니다. 테이블의 크기는 버킷으로 표시됩니다. 테이블 크기가 해시 최대 크기 매개 변수를 초과 할 때까지 조정이 계속됩니다. 대부분의 해시에는 이러한 매개 변수를 변경할 수있는 해당 지시문이 있습니다 (예 : 서버 이름 해시의 경우 <a href="http/ngx_http_core_module#server_names_hash_max_size">server_names_hash_max_size</a> 및 <a href="http/ngx_http_core_module#server_names_hash_bucket_size">server_names_hash_bucket_size)</a> .

source: To reduce the processor load it is recommended to
es: Para reducir la carga del procesador se recomienda
ko: 프로세서로드를 줄이려면 다음을 수행하는 것이 좋습니다.

source: To reduce the processor load, it is recommended to
es: Para reducir la carga del procesador,se recomienda
ko: 프로세서로드를 줄이려면 다음을 수행하는 것이 좋습니다.

source: To register a pool cleanup, call <code>ngx_pool_cleanup_add(pool, size)</code>, which returns a <code>ngx_pool_cleanup_t</code> pointer to be filled in by the caller. Use the <code>size</code> argument to allocate context for the cleanup handler.
es: Para registrar una limpieza de grupo, llame a <code>ngx_pool_cleanup_add(pool, size)</code> , que devuelve un puntero <code>ngx_pool_cleanup_t</code> para que lo complete la persona que llama. Utilice el argumento de <code>size</code> para asignar contexto al controlador de limpieza.
ko: 풀 정리를 등록하려면 호출자가 채울 <code>ngx_pool_cleanup_t</code> 포인터를 리턴하는 ngx_pool_cleanup_add <code>ngx_pool_cleanup_add(pool, size)</code> 를 호출하십시오. 정리 인수에 컨텍스트를 할당 하려면 <code>size</code> 인수를 사용하십시오 .

source: To remove a node, call the <code>ngx_rbtree_delete()</code> function:
es: Para eliminar un nodo, llame a la funci&oacute;n <code>ngx_rbtree_delete()</code> :
ko: 노드를 제거하려면 <code>ngx_rbtree_delete()</code> 함수를 호출하십시오 .

source: To remove a node, update a DNS record of a cluster hostname and remove the IP address of the node. All other nodes will eventually discover that the node is removed, close connections to the node, and will no longer try to connect to it. After the node is removed, it can be stopped as described above. In case of static configuration, other nodes need to be reloaded in order to stop sending updates to the removed node.
es: Para eliminar un nodo,actualice un registro DNS de un nombre de host del cluster y elimine la dirección IP del nodo.Todos los demás nodos eventualmente descubrirán que el nodo ha sido removido,cerrarán las conexiones con el nodo,y ya no intentarán conectarse a él.Después de que el nodo es removido,puede ser detenido como se describe arriba.En caso de configuración estática,los otros nodos necesitan ser recargados para dejar de enviar actualizaciones al nodo eliminado.
ko: 노드를 제거하려면 클러스터 호스트 이름의 DNS 레코드를 업데이트하고 노드의 IP 주소를 제거하십시오. 다른 모든 노드는 결국 노드가 제거되었음을 발견하고 노드에 대한 연결을 닫고 더 이상 연결하려고하지 않습니다. 노드가 제거 된 후 위에서 설명한대로 중지 할 수 있습니다. 정적 구성의 경우 제거 된 노드로 업데이트 전송을 중지하려면 다른 노드를 다시로드해야합니다.

source: To remove a server, specify its ID:
es: Para eliminar un servidor,especifique su ID:
ko: 서버를 제거하려면 해당 ID를 지정하십시오.

source: To send the response body, call the <code>ngx_http_output_filter(r, cl)</code> function. The function can be called multiple times. Each time, it sends a part of the response body in the form of a buffer chain. Set the <code>last_buf</code> flag in the last body buffer.
es: Para enviar el cuerpo de la respuesta, llame a la funci&oacute;n <code>ngx_http_output_filter(r, cl)</code> . La funci&oacute;n se puede llamar varias veces. Cada vez, env&iacute;a una parte del cuerpo de respuesta en forma de cadena de b&uacute;fer. Establezca el indicador <code>last_buf</code> en el &uacute;ltimo b&uacute;fer del cuerpo.
ko: 응답 본문을 보내려면 <code>ngx_http_output_filter(r, cl)</code> 함수를 호출하십시오 . 이 함수는 여러 번 호출 될 수 있습니다. 매번, 응답 본문의 일부를 버퍼 체인 형태로 보냅니다. 마지막 바디 버퍼에서 <code>last_buf</code> 플래그를 설정하십시오 .

source: To start a new node, update a DNS record of a cluster hostname with the IP address of the new node and start an instance. The new node will discover other nodes from DNS or static configuration and will start sending updates to them. Other nodes will eventually discover the new node using DNS and start pushing updates to it. In case of static configuration, other nodes need to be reloaded in order to send updates to the new node.
es: Para iniciar un nuevo nodo,actualizar un registro DNS de un nombre de host del cluster con la dirección IP del nuevo nodo e iniciar una instancia.El nuevo nodo descubrirá otros nodos del DNS o de la configuración estática y comenzará a enviar actualizaciones a ellos.Otros nodos eventualmente descubrirán el nuevo nodo usando DNS y comenzarán a enviar actualizaciones a él.En caso de configuración estática,otros nodos necesitan ser recargados para enviar actualizaciones al nuevo nodo.
ko: 새 노드를 시작하려면 새 노드의 IP 주소로 클러스터 호스트 이름의 DNS 레코드를 업데이트하고 인스턴스를 시작하십시오. 새 노드는 DNS 또는 정적 구성에서 다른 노드를 발견하고 업데이트를 보내기 시작합니다. 다른 노드는 결국 DNS를 사용하여 새 노드를 발견하고 업데이트를 시작합니다. 정적 구성의 경우 새 노드로 업데이트를 보내려면 다른 노드를 다시로드해야합니다.

source: To start nginx, run the executable file. Once nginx is started, it can be controlled by invoking the executable with the <code>-s</code> parameter. Use the following syntax:
es: Para iniciar nginx, ejecute el archivo ejecutable. Una vez que se inicia nginx, se puede controlar invocando el ejecutable con el par&aacute;metro <code>-s</code> . Utilice la siguiente sintaxis:
ko: nginx를 시작하려면 실행 파일을 실행하십시오. nginx가 시작되면 <code>-s</code> 매개 변수 를 사용하여 실행 파일을 호출하여 제어 할 수 있습니다 . 다음 구문을 사용하십시오.

source: To start playback, the player first needs to read metadata. This is done by sending a special request with the <code>start=0</code> argument. A lot of encoding software insert the metadata at the end of the file. This is suboptimal for pseudo-streaming, because the player has to download the entire file before starting playback. If the metadata are located at the beginning of the file, it is enough for nginx to simply start sending back the file contents. If the metadata are located at the end of the file, nginx must read the entire file and prepare a new stream so that the metadata come before the media data. This involves some CPU, memory, and disk I/O overhead, so it is a good idea to <a href="http://flowplayer.org/plugins/streaming/pseudostreaming.html#prepare"> prepare an original file for pseudo-streaming</a> in advance, rather than having nginx do this on every such request.
es: Para iniciar la reproducci&oacute;n, el reproductor primero debe leer los metadatos. Esto se hace enviando una solicitud especial con el argumento <code>start=0</code> . Una gran cantidad de software de codificaci&oacute;n inserta los metadatos al final del archivo. Esto es sub&oacute;ptimo para la pseudo-transmisi&oacute;n, porque el reproductor tiene que descargar el archivo completo antes de comenzar la reproducci&oacute;n. Si los metadatos se encuentran al principio del archivo, es suficiente que nginx simplemente comience a enviar el contenido del archivo. Si los metadatos se encuentran al final del archivo, nginx debe leer todo el archivo y preparar una nueva transmisi&oacute;n para que los metadatos est&eacute;n antes que los datos multimedia. Esto implica una sobrecarga de CPU, memoria y E / S de disco, por lo que es una buena idea <a href="http://flowplayer.org/plugins/streaming/pseudostreaming.html#prepare">preparar un archivo original para la pseudo-transmisi&oacute;n.</a> de antemano, en lugar de que nginx haga esto en cada solicitud.
ko: 재생을 시작하려면 먼저 플레이어가 메타 데이터를 읽어야합니다. <code>start=0</code> 인수 와 함께 특수 요청을 보내면 됩니다. 많은 인코딩 소프트웨어가 파일 끝에 메타 데이터를 삽입합니다. 이는 플레이어가 재생을 시작하기 전에 전체 파일을 다운로드해야하기 때문에 의사 스트리밍에는 적합하지 않습니다. 메타 데이터가 파일의 시작 부분에있는 경우, nginx가 단순히 파일 내용을 보내기 시작하기에 충분합니다. 메타 데이터가 파일의 끝에있는 경우 nginx는 전체 파일을 읽고 메타 데이터가 미디어 데이터 앞에 오도록 새 스트림을 준비해야합니다. 여기에는 일부 CPU, 메모리 및 디스크 I / O 오버 헤드가 포함되므로 <a href="http://flowplayer.org/plugins/streaming/pseudostreaming.html#prepare">의사 스트리밍을 위해 원본 파일</a> 을 준비하는 것이 좋습니다 사전에 nginx가 그러한 모든 요청에 ​​대해이를 수행하는 대신.

source: To stop a node, send the <code>QUIT</code> signal to the instance. The node will finish zone synchronization and gracefully close open connections.
es: Para detener un nodo, env&iacute;e la se&ntilde;al <code>QUIT</code> a la instancia. El nodo finalizar&aacute; la sincronizaci&oacute;n de la zona y cerrar&aacute; con gracia las conexiones abiertas.
ko: 노드를 중지하려면 <code>QUIT</code> 신호를 인스턴스로 보내십시오 . 노드는 영역 동기화를 마치고 열린 연결을 정상적으로 닫습니다.

source: To support seeking, H.264-based formats store metadata in a so-called &ldquo;moov atom&rdquo;. It is a part of the file that holds the index information for the whole file.
es: Para admitir la b&uacute;squeda, los formatos basados ​​en H.264 almacenan metadatos en un denominado "&aacute;tomo moov". Es una parte del archivo que contiene la informaci&oacute;n del &iacute;ndice de todo el archivo.
ko: 탐색을 지원하기 위해 H.264 기반 형식은 메타 데이터를 소위 "moov atom"에 저장합니다. 전체 파일에 대한 색인 정보를 보유하는 파일의 일부입니다.

source: To traverse a tree and insert new values, use the "<code>insert_value</code>" functions. For example, the <code>ngx_str_rbtree_insert_value</code> function deals with the <code>ngx_str_t</code> type. Its arguments are pointers to a root node of an insertion, the newly created node to be added, and a tree sentinel.
es: Para recorrer un &aacute;rbol e insertar nuevos valores, utilice las funciones " <code>insert_value</code> ". Por ejemplo, la funci&oacute;n <code>ngx_str_rbtree_insert_value</code> trata con el tipo <code>ngx_str_t</code> . Sus argumentos apuntan a un nodo ra&iacute;z de una inserci&oacute;n, el nodo reci&eacute;n creado que se agregar&aacute; y un &aacute;rbol centinela.
ko: 트리를 탐색하고 새 값을 삽입하려면 " <code>insert_value</code> "함수를 사용하십시오 . 예를 들어, <code>ngx_str_rbtree_insert_value</code> 함수는 <code>ngx_str_t</code> 유형을 처리합니다. 인수는 삽입의 루트 노드, 새로 추가 할 노드 및 트리 센티넬에 대한 포인터입니다.

source: To turn a connection between a client and server from HTTP/1.1 into WebSocket, the <a href="https://tools.ietf.org/html/rfc2616#section-14.42">protocol switch</a> mechanism available in HTTP/1.1 is used.
es: Para convertir una conexi&oacute;n entre un cliente y un servidor de HTTP / 1.1 a WebSocket, se utiliza el mecanismo de <a href="https://tools.ietf.org/html/rfc2616#section-14.42">cambio de protocolo</a> disponible en HTTP / 1.1.
ko: 클라이언트와 서버 간의 연결을 HTTP / 1.1에서 WebSocket으로 <a href="https://tools.ietf.org/html/rfc2616#section-14.42">전환</a> 하기 위해 HTTP / 1.1에서 사용 가능한 프로토콜 스위치 메커니즘이 사용됩니다.
