Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/nginx/nginx.*.004.xlf
Languages: es, ja, ko, ru, zh_cn

source: Specifies a <code><i>file</i></code> with trusted CA certificates in the PEM format used to <a href="#proxy_ssl_verify">verify</a> the certificate of the proxied server.
ja: プロキシされたサーバーの証明書を<a href="#proxy_ssl_verify">検証するために</a>使用されるPEM形式の信頼できるCA証明書を含む <code><i>file</i></code> を指定し<i>ます</i>。
ru: Задает <code><i>file</i></code> с доверенными сертификатами CA в формате PEM, который используется для <a href="#proxy_ssl_verify">проверки</a> сертификата прокси-сервера.
zh_cn: 指定一个具有PEM格式的受信任CA证书的 <code><i>file</i></code> ，该<i>文件</i>用于<a href="#proxy_ssl_verify">验证</a>代理服务器的证书。

source: Specifies a <code><i>file</i></code> with trusted CA certificates in the PEM format used to <a href="#ssl_verify_client">verify</a> client certificates and OCSP responses if <a href="#ssl_stapling">ssl_stapling</a> is enabled.
ja: <a href="#ssl_stapling">ssl_stapling</a>が有効になっている場合にクライアント証明書とOCSP応答を<a href="#ssl_verify_client">検証するために</a>使用されるPEM形式の信頼できるCA証明書を含む <code><i>file</i></code> を指定し<i>ます</i>。
ru: Задает <code><i>file</i></code> с доверенными сертификатами CA в формате PEM, который используется для <a href="#ssl_verify_client">проверки</a> сертификатов клиентов и ответов OCSP, если <a href="#ssl_stapling">ssl_stapling</a> включен.
zh_cn: 指定一个具有PEM格式的受信任CA证书的 <code><i>file</i></code> ，如果启用了<a href="#ssl_stapling">ssl_stapling，</a>则该<i>文件</i>用于<a href="#ssl_verify_client">验证</a>客户端证书和OCSP响应。

source: Specifies a <code><i>file</i></code> with trusted CA certificates in the PEM format used to <a href="#ssl_verify_client">verify</a> client certificates.
ja: クライアント証明書の<a href="#ssl_verify_client">検証に</a>使用されるPEM形式の信頼できるCA証明書を含む <code><i>file</i></code> を指定し<i>ます</i>。
ru: Задает <code><i>file</i></code> с доверенными сертификатами CA в формате PEM, который используется для <a href="#ssl_verify_client">проверки</a> сертификатов клиентов.
zh_cn: 指定带有用于<a href="#ssl_verify_client">验证</a>客户端证书的PEM格式的受信任CA证书的 <code><i>file</i></code> 。

source: Specifies a <code><i>file</i></code> with trusted CA certificates in the PEM format used to <a href="#uwsgi_ssl_verify">verify</a> the certificate of the secured uwsgi server.
ja: 保護されたuwsgiサーバーの証明書を<a href="#uwsgi_ssl_verify">検証するために</a>使用されるPEM形式の信頼できるCA証明書を含む <code><i>file</i></code> を指定し<i>ます</i>。
ru: Задает <code><i>file</i></code> с сертификатами доверенных центров сертификации в формате PEM, используемый для <a href="#uwsgi_ssl_verify">проверки</a> сертификата защищенного сервера uwsgi.
zh_cn: 指定一个带有PEM格式的受信任CA证书的 <code><i>file</i></code> ，该证书用于<a href="#uwsgi_ssl_verify">验证</a>受保护的uwsgi服务器的证书。

source: Specifies a <code><i>file</i></code> with trusted CA certificates in the PEM format used to <a href="#zone_sync_ssl_verify">verify</a> the certificate of another cluster server.
ja: 別のクラスターサーバーの証明書を<a href="#zone_sync_ssl_verify">確認するために</a>使用されるPEM形式の信頼できるCA証明書を含む <code><i>file</i></code> を指定し<i>ます</i>。
ru: Задает <code><i>file</i></code> с сертификатами доверенных центров сертификации в формате PEM, используемый для <a href="#zone_sync_ssl_verify">проверки</a> сертификата другого кластерного сервера.
zh_cn: 指定带有PEM格式的受信任CA证书的 <code><i>file</i></code> ，该<i>文件</i>用于<a href="#zone_sync_ssl_verify">验证</a>另一台群集服务器的证书。

source: Specifies a <code><i>size</i></code> of the <a href="stream_processing#preread_phase">preread</a> buffer.
ja: <a href="stream_processing#preread_phase">先読み</a>バッファの <code><i>size</i></code> を指定し<i>ます</i>。
ru: Задает <code><i>size</i></code> буфера предварительного <a href="stream_processing#preread_phase">чтения</a> .
zh_cn: 指定 <code><i>size</i></code> 的的<a href="stream_processing#preread_phase">预读</a>缓冲区。

source: Specifies a <code><i>timeout</i></code> for reading the PROXY protocol header to complete. If no entire header is transmitted within this time, the connection is closed.
ja: PROXYプロトコルヘッダーを読み取って完了する <code><i>timeout</i></code> を指定します。この時間内にヘッダー全体が送信されない場合、接続は閉じられます。
ru: Задает <code><i>timeout</i></code> для завершения чтения заголовка протокола PROXY. Если за это время не передается полный заголовок, соединение закрывается.
zh_cn: 指定 <code><i>timeout</i></code> 以读取PROXY协议标头完成。如果在此时间内未传输整个标头，则连接将关闭。

source: Specifies a <code><i>timeout</i></code> of the <a href="stream_processing#preread_phase">preread</a> phase.
ja: <a href="stream_processing#preread_phase">先読み</a>フェーズの <code><i>timeout</i></code> を指定します。
ru: Задает <code><i>timeout</i></code> - <a href="stream_processing#preread_phase">аут</a> фазы предварительного чтения .
zh_cn: 指定 <code><i>timeout</i></code> 了的<a href="stream_processing#preread_phase">预读</a>阶段。

source: Specifies a <code><i>value</i></code> to send to the client. The value can contain text, variables, and their combination.
ja: クライアントに送信する <code><i>value</i></code> を指定します。値には、テキスト、変数、およびそれらの組み合わせを含めることができます。
ru: Задает <code><i>value</i></code> для отправки клиенту. Значение может содержать текст, переменные и их комбинации.
zh_cn: 指定要发送给客户端的 <code><i>value</i></code> 。该值可以包含文本，变量及其组合。

source: Specifies a database used to determine the country depending on the client IP address. The following variables are available when using this database:
ja: クライアントの IP アドレスに応じて国を決定するために使用するデータベースを指定します。このデータベースを使用する際には、以下の変数を使用できます。
ru: Определяет базу данных,используемую для определения страны в зависимости от IP-адреса клиента.При использовании этой базы данных доступны следующие переменные:
zh_cn: 根据客户的IP地址,指定用于确定国家的数据库。使用该数据库时,可使用以下变量。

source: Specifies a database used to determine the country, region, and city depending on the client IP address. The following variables are available when using this database:
ja: クライアントの IP アドレスに応じて国、地域、および都市を決定するために使用するデータベースを指定します。このデータベースを使用する際には、以下の変数を使用できます。
ru: Определяет базу данных,используемую для определения страны,региона и города в зависимости от IP-адреса клиента.При использовании этой базы данных доступны следующие переменные:
zh_cn: 指定一个数据库,用于根据客户端IP地址确定国家、地区和城市。使用该数据库时,可使用以下变量。

source: Specifies a database used to determine the organization depending on the client IP address. The following variable is available when using this database:
ja: クライアントの IP アドレスに応じて組織を決定するために使用するデータベースを指定します。このデータベースを使用する場合は、次の変数を指定します。
ru: Определяет базу данных,используемую для определения организации в зависимости от IP-адреса клиента.При использовании этой базы данных доступна следующая переменная:
zh_cn: 根据客户的 IP 地址,指定用于确定机构的数据库。使用此数据库时,可使用以下变量。

source: Specifies a file that implements location and variable handlers in njs.
ja: njsのロケーションハンドラと変数ハンドラを実装したファイルを指定します。
ru: Указание файла,реализующего обработчики местоположения и переменных в njs.
zh_cn: 指定在njs中实现位置和变量处理程序的文件。

source: Specifies a file that implements location and variable handlers in njs:
ja: njsのロケーションハンドラと変数ハンドラを実装したファイルを指定します。
zh_cn: 指定在njs中实现位置和变量处理程序的文件。

source: Specifies a file that implements server and variable handlers in njs.
ja: njsでサーバーや変数のハンドラを実装するファイルを指定します。
ru: Указание файла,реализующего обработчики серверов и переменных в njs.
zh_cn: 指定在njs中实现服务器和变量处理程序的文件。

source: Specifies a file that implements server and variable handlers in njs:
ja: njsでサーバーや変数のハンドラを実装するファイルを指定します。
zh_cn: 指定在njs中实现服务器和变量处理程序的文件。

source: Specifies a file that keeps user names and passwords, in the following format:
ja: ユーザー名とパスワードを保持するファイルを次の形式で指定します。
ru: Указание файла,в котором хранятся имена пользователей и пароли,в следующем формате:
zh_cn: 指定保存用户名和密码的文件,格式如下。

source: Specifies a load balancing method for a server group where the client-server mapping is based on the hashed <code><i>key</i></code> value. The <code><i>key</i></code> can contain text, variables, and their combinations (1.11.2). Usage example:
ja: クライアント/サーバーマッピングがハッシュされた <code><i>key</i></code> 値に基づいているサーバーグループの負荷分散方法を指定します。 <code><i>key</i></code> 、テキスト、変数、およびこれらの組み合わせ（1.11.2）を含むことができます。使用例：
ru: Задает метод балансировки нагрузки для группы серверов, где отображение клиент-сервер основано на хешированном значении <code><i>key</i></code> . <code><i>key</i></code> может содержать текст, переменные и их комбинации (1.11.2). Пример использования:
zh_cn: 指定服务器组的负载平衡方法，在该服务器组中，客户端-服务器映射基于散列 <code><i>key</i></code> 。该 <code><i>key</i></code> 可以包含文本，变量，以及它们的组合（1.11.2）。用法示例：

source: Specifies a load balancing method for a server group where the client-server mapping is based on the hashed <code><i>key</i></code> value. The <code><i>key</i></code> can contain text, variables, and their combinations. Note that adding or removing a server from the group may result in remapping most of the keys to different servers. The method is compatible with the <a href="https://metacpan.org/pod/Cache::Memcached">Cache::Memcached</a> Perl library.
ja: クライアント/サーバーマッピングがハッシュされた <code><i>key</i></code> 値に基づいているサーバーグループの負荷分散方法を指定します。 <code><i>key</i></code> 、テキスト、変数、およびこれらの組み合わせを含めることができます。グループにサーバーを追加または削除すると、ほとんどのキーが別のサーバーに再マッピングされる可能性があることに注意してください。このメソッドは、<a href="https://metacpan.org/pod/Cache::Memcached">Cache :: Memcached</a> Perlライブラリと互換性があります。
ru: Задает метод балансировки нагрузки для группы серверов, где отображение клиент-сервер основано на хешированном значении <code><i>key</i></code> . <code><i>key</i></code> может содержать текст, переменные и их комбинации. Обратите внимание, что добавление или удаление сервера из группы может привести к переназначению большинства ключей другим серверам. Метод совместим с библиотекой <a href="https://metacpan.org/pod/Cache::Memcached">Cache :: Memcached</a> Perl.
zh_cn: 指定服务器组的负载平衡方法，在该服务器组中，客户端-服务器映射基于散列 <code><i>key</i></code> 。该 <code><i>key</i></code> 可以包含文本，变量，以及它们的组合。请注意，从组中添加或删除服务器可能会导致将大多数密钥重新映射到其他服务器。该方法与<a href="https://metacpan.org/pod/Cache::Memcached">Cache :: Memcached</a> Perl库兼容。

source: Specifies a time during which a client may reuse the session parameters.
ja: クライアントがセッションパラメータを再利用できる時間を指定します。
ru: Определяет время,в течение которого клиент может повторно использовать параметры сессии.
zh_cn: 指定客户端可以重复使用会话参数的时间。

source: Specifies a timeout for the SSL handshake to complete.
ja: SSLハンドシェイクが完了するまでのタイムアウトを指定します。
ru: Определяет тайм-аут для завершения рукопожатия SSL.
zh_cn: 指定SSL握手完成的超时时间。

source: Specifies a version starting from which a browser is considered modern. A browser can be any one of the following: <code>msie</code>, <code>gecko</code> (browsers based on Mozilla), <code>opera</code>, <code>safari</code>, or <code>konqueror</code>.
ja: ブラウザが最新と見なされるバージョンを指定します。ブラウザは、 <code>msie</code> 、 <code>gecko</code> （Mozillaベースのブラウザ）、 <code>opera</code> 、 <code>safari</code> 、 <code>konqueror</code> のいずれかです。
ru: Задает версию, начиная с которой браузер считается современным. Браузер может быть любым из следующих: <code>msie</code> , <code>gecko</code> (браузеры на основе Mozilla), <code>opera</code> , <code>safari</code> или <code>konqueror</code> .
zh_cn: 指定一个版本，从该版本开始，浏览器被认为是现代的。浏览器可以是以下任意一种： <code>msie</code> ， <code>gecko</code> （基于Mozilla的浏览器）， <code>opera</code> ， <code>safari</code> 或 <code>konqueror</code> 。

source: Specifies how to compare modification time of a response with the time in the &ldquo;If-Modified-Since&rdquo; request header field:
ja: 応答の変更時間を「If-Modified-Since」リクエストヘッダーフィールドの時間と比較する方法を指定します。
ru: Определяет, как сравнивать время модификации ответа со временем в поле заголовка запроса &laquo;If-Modified-Since&raquo;:
zh_cn: 指定如何将响应的修改时间与&ldquo; If-Modified-Since&rdquo;请求标头字段中的时间进行比较：

source: Specifies in which cases a request should be passed to the next server:
ja: どのような場合にリクエストを次のサーバーに渡すかを指定します。
ru: Указывает,в каких случаях запрос должен быть передан на следующий сервер:
zh_cn: 指定在哪些情况下应将请求传递给下一个服务器。

source: Specifies log format.
ja: ログの形式を指定します。
ru: Определяет формат журнала.
zh_cn: 指定日志格式。

source: Specifies that a given location can only be used for internal requests. For external requests, the client error 404 (Not Found) is returned. Internal requests are the following:
ja: 指定された場所が内部要求にのみ使用できることを指定します。外部リクエストの場合、クライアント エラー 404 (Not Found)が返されます。内部リクエストは以下の通りです。
ru: Указывает,что данное местоположение может быть использовано только для внутренних запросов.Для внешних запросов возвращается ошибка клиента 404 (Не найдена).Внутренние запросы следующие:
zh_cn: 指定指定的位置只能用于内部请求。对于外部请求,将返回客户端错误404(Not Found)。内部请求有以下几种。

source: Specifies that a group should use a load balancing method where a connection is passed to a randomly selected server, taking into account weights of servers.
ja: サーバーの重みを考慮して、ランダムに選択されたサーバーに接続を渡すロードバランシング方法をグループで使用することを指定します。
ru: Указывает,что группа должна использовать метод балансировки нагрузки,при котором соединение передается на случайно выбранный сервер с учетом веса серверов.
zh_cn: 指定组应该使用负载均衡的方法,即考虑到服务器的权重,将连接传递给随机选择的服务器。

source: Specifies that a group should use a load balancing method where a connection is passed to the server with the least average time and least number of active connections, taking into account weights of servers. If there are several such servers, they are tried in turn using a weighted round-robin balancing method.
ja: グループが、サーバーの重みを考慮して、平均時間とアクティブな接続数が最も少ないサーバーに接続を渡す負荷分散方法を使用することを指定します。このようなサーバが複数ある場合は、重み付きラウンドロビン分散方式を使用して順番に試されます。
ru: Указывает,что группа должна использовать метод балансировки нагрузки,при котором соединение передается на сервер с наименьшим средним временем и наименьшим количеством активных соединений с учетом веса серверов.Если таких серверов несколько,то они поочерёдно испытываются методом взвешенной балансировки по кругу.
zh_cn: 指定一个组应该使用负载均衡方法,在考虑服务器权重的情况下,将连接传递给平均时间最少、活动连接数最少的服务器。如果有几个这样的服务器,则使用加权循环平衡法依次尝试。

source: Specifies that a group should use a load balancing method where a connection is passed to the server with the least number of active connections, taking into account weights of servers. If there are several such servers, they are tried in turn using a weighted round-robin balancing method.
ja: サーバーの重みを考慮して、アクティブな接続数が最も少ないサーバーに接続を渡す負荷分散方法をグループで使用することを指定します。このようなサーバが複数ある場合は、重み付きラウンドロビン分散方式を使って順番に試行されます。
ru: Указывает,что группа должна использовать метод балансировки нагрузки,при котором соединение передается на сервер с наименьшим количеством активных соединений с учетом веса серверов.Если таких серверов несколько,то они поочерёдно испытываются методом взвешенной балансировки по кругу.
zh_cn: 指定一个组应该使用负载均衡方法,在考虑服务器权重的情况下,将一个连接传递给活动连接数最少的服务器。如果有几个这样的服务器,则使用加权循环平衡法依次尝试。

source: Specifies that a group should use a load balancing method where a request is passed to a randomly selected server, taking into account weights of servers.
ja: グループがサーバーの重みを考慮してランダムに選択されたサーバーにリクエストを渡すロードバランシング方法を使用することを指定します。
ru: Указывает,что группа должна использовать метод балансировки нагрузки,при котором запрос передается на случайно выбранный сервер с учетом веса серверов.
zh_cn: 指定一个组应该使用负载均衡的方法,即在考虑到服务器权重的情况下,将请求传递给随机选择的服务器。

source: Specifies that a group should use a load balancing method where a request is passed to the server with the least average response time and least number of active connections, taking into account weights of servers. If there are several such servers, they are tried in turn using a weighted round-robin balancing method.
ja: グループが、サーバーの重みを考慮して、平均応答時間とアクティブな接続数が最小の サーバーにリクエストを渡す負荷分散方法を使用することを指定します。このようなサーバーが複数ある場合は、重み付きラウンドロビン分散法を使用して順番に試されます。
ru: Указывает,что группа должна использовать метод балансировки нагрузки,при котором запрос передается на сервер с наименьшим средним временем отклика и наименьшим количеством активных соединений с учетом веса серверов.Если таких серверов несколько,то они поочерёдно испытываются методом взвешенной балансировки по кругу.
zh_cn: 指定一个组应该使用负载均衡方法,在考虑服务器权重的情况下,将请求传递给平均响应时间最少、活动连接数最少的服务器。如果有几个这样的服务器,则使用加权循环平衡法依次尝试。

source: Specifies that a group should use a load balancing method where a request is passed to the server with the least number of active connections, taking into account weights of servers. If there are several such servers, they are tried in turn using a weighted round-robin balancing method.
ja: グループが、サーバーの重みを考慮して、アクティブな接続数が最も少ないサーバーにリクエストを渡す負荷分散方法を使用することを指定します。このようなサーバーが複数ある場合は、重み付きラウンドロビン分散方式を使って順番に試されます。
ru: Указывает,что группа должна использовать метод балансировки нагрузки,при котором запрос передается на сервер с наименьшим количеством активных соединений с учетом веса серверов.Если таких серверов несколько,то они по очереди пробуются методом взвешенной балансировки по кругу.
zh_cn: 指定一个组应该使用负载平衡方法,即考虑到服务器的权重,将请求传递给活动连接数最少的服务器。如果有几个这样的服务器,则使用加权循环平衡法依次尝试。

source: Specifies that a group should use a load balancing method where requests are distributed between servers based on client IP addresses. The first three octets of the client IPv4 address, or the entire IPv6 address, are used as a hashing key. The method ensures that requests from the same client will always be passed to the same server except when this server is unavailable. In the latter case client requests will be passed to another server. Most probably, it will always be the same server as well.
ja: クライアントIPアドレスに基づいてサーバー間でリクエストを分散させるロードバランシング方法をグループで使用することを指定します。クライアントの IPv4 アドレスの最初の 3 オクテット、または IPv6 アドレス全体がハッシュキーとして使用されます。この方法により、同じクライアントからのリクエストは、このサーバが利用できない場合を除き、常に同じサーバに渡されます。後者の場合、クライアントのリクエストは別のサーバに渡されます。ほとんどの場合、同じサーバが常に同じサーバであることになります。
ru: Указывает,что группа должна использовать метод балансировки нагрузки,при котором запросы распределяются между серверами на основе IP-адресов клиентов.Первые три октета клиентского IPv4-адреса,или весь IPv6-адрес,используются в качестве ключа хэширования.Этот метод гарантирует,что запросы от одного и того же клиента будут всегда передаваться на один и тот же сервер,за исключением случаев,когда этот сервер недоступен.В последнем случае клиентские запросы будут передаваться другому серверу.Скорее всего,это всегда будет один и тот же сервер.
zh_cn: 指定一个组应该使用负载均衡的方法,即根据客户端IP地址在服务器之间分配请求。客户端IPv4地址的前三个八位数或整个IPv6地址被用作散列键。该方法确保来自同一客户端的请求将始终传递给同一服务器,除非该服务器不可用。在后一种情况下,客户端的请求将被传递到另一台服务器。很可能,它也将始终是同一台服务器。

source: Specifies that server ciphers should be preferred over client ciphers when the SSLv3 and TLS protocols are used.
ja: SSLv3 および TLS プロトコルを使用する場合、クライアント暗号よりもサーバ暗号を優先することを指定します。
ru: Указание на то,что шифры сервера должны быть предпочтительнее клиентских шифров,когда используются протоколы SSLv3 и TLS.
zh_cn: 指定当使用SSLv3和TLS协议时,服务器密码应该优先于客户端密码。

source: Specifies that server ciphers should be preferred over client ciphers when using the SSLv3 and TLS protocols.
ja: SSLv3 および TLS プロトコルを使用する際に、クライアントの暗号化方式よりもサーバの暗号化方式を優先することを指定します。
ru: Указание на то,что шифры сервера должны быть предпочтительнее клиентских шифров при использовании протоколов SSLv3 и TLS.
zh_cn: 指定在使用SSLv3和TLS协议时,服务器密码应该优先于客户端密码。

source: Specifies the &ldquo;Referer&rdquo; request header field values that will cause the embedded <code>$invalid_referer</code> variable to be set to an empty string. Otherwise, the variable will be set to &ldquo;<code>1</code>&rdquo;. Search for a match is case-insensitive.
ja: 埋め込み <code>$invalid_referer</code> 変数が空の文字列に設定されるようにする「Referer」リクエストヘッダーフィールド値を指定します。それ以外の場合、変数は「 <code>1</code> 」に設定されます。一致の検索では大文字と小文字は区別されません。
ru: Задает значения поля заголовка запроса &laquo;Referer&raquo;, в результате чего встроенная переменная <code>$invalid_referer</code> будет установлена ​​в пустую строку. В противном случае переменная будет установлена ​​в &laquo; <code>1</code> &raquo;. При поиске совпадения регистр не учитывается.
zh_cn: 指定将导致嵌入的 <code>$invalid_referer</code> 变量设置为空字符串的&ldquo; Referer&rdquo;请求标头字段值。否则，变量将设置为&ldquo; <code>1</code> &rdquo;。搜索匹配项不区分大小写。

source: Specifies the <a href="events">connection processing</a><code><i>method</i></code> to use. There is normally no need to specify it explicitly, because nginx will by default use the most efficient method.
ja: 使用する<a href="events">接続処理</a> <code><i>method</i></code> を指定します。nginxはデフォルトで最も効率的な方法を使用するため、通常は明示的に指定する必要はありません。
ru: Определяет используемый <code><i>method</i></code> <a href="events"> обработки подключения</a> . Обычно нет необходимости указывать его явно, потому что nginx по умолчанию будет использовать наиболее эффективный метод.<i></i>
zh_cn: 指定要使用的<a href="events">连接处理</a> <code><i>method</i></code> 。通常无需显式指定它，因为默认情况下nginx将使用最有效的方法。

source: Specifies the DTD file that declares character entities. This file is compiled at the configuration stage. For technical reasons, the module is unable to use the external subset declared in the processed XML, so it is ignored and a specially defined file is used instead. This file should not describe the XML structure. It is enough to declare just the required character entities, for example:
ja: 文字実体を宣言するDTDファイルを指定します。このファイルは設定段階でコンパイルされます。技術的な理由から、モジュールは処理されたXMLで宣言された外部サブセットを使用することができないため、これは無視され、代わりに特別に定義されたファイルが使用されます。このファイルはXML構造を記述してはいけません。例えば、必要な文字実体だけを宣言すれば十分です。
ru: Указание файла DTD,объявляющего символьные сущности.Этот файл компилируется на этапе конфигурации.По техническим причинам модуль не может использовать внешнее подмножество,объявленное в обрабатываемом XML,поэтому оно игнорируется и вместо него используется специально заданный файл.Этот файл не должен описывать структуру XML.Достаточно,например,объявить только нужные символьные сущности:
zh_cn: 指定声明字符实体的DTD文件。这个文件是在配置阶段编译的。由于技术原因,该模块无法使用处理后的XML中声明的外部子集,因此会忽略它,而使用一个特殊定义的文件。这个文件不应该描述XML结构。例如,只声明所需的字符实体就足够了。

source: Specifies the HTTP <code><i>method</i></code> to use in requests forwarded to the proxied server instead of the method from the client request. Parameter value can contain variables (1.11.6).
ja: クライアント要求からのメソッドではなく、プロキシサーバーに転送される要求で使用するHTTP <code><i>method</i></code> を指定します。パラメータ値には変数を含めることができます（1.11.6）。
ru: Задает <code><i>method</i></code> HTTP для использования в запросах, пересылаемых на прокси-сервер, вместо метода из клиентского запроса. Значение параметра может содержать переменные (1.11.6).
zh_cn: 指定在转发给代理服务器的请求中使用的HTTP <code><i>method</i></code> ，而不是客户端请求中的方法。参数值可以包含变量（1.11.6）。

source: Specifies the enabled ciphers for connections to a proxied server. The ciphers are specified in the format understood by the OpenSSL library.
ja: プロキシされたサーバへの接続で有効な暗号化方式を指定します。暗号化方式は OpenSSL ライブラリが理解する形式で指定します。
ru: Определяет включенные шифры для подключений к прокси-серверу.Шифры задаются в формате,понятном библиотеке OpenSSL.
zh_cn: 指定用于连接到代理服务器的启用的密码。密码是以OpenSSL库理解的格式指定的。

source: Specifies the enabled ciphers for connections to another cluster server. The ciphers are specified in the format understood by the OpenSSL library.
ja: 別のクラスタサーバへの接続で有効な暗号化方式を指定します。暗号化方式は OpenSSL ライブラリによって理解される形式で指定されます。
ru: Определяет включенные шифры для подключений к другому серверу кластера.Шифры задаются в формате,понятном библиотеке OpenSSL.
zh_cn: 指定连接到另一个群集服务器的已启用的密码,密码以OpenSSL库理解的格式指定。密码是以OpenSSL库理解的格式指定的。

source: Specifies the enabled ciphers for requests to a gRPC SSL server. The ciphers are specified in the format understood by the OpenSSL library.
ja: gRPC SSL サーバへのリクエストで有効な暗号化方式を指定します。暗号化方式は OpenSSL ライブラリが理解する形式で指定します。
ru: Определяет включенные шифры для запросов к gRPC SSL-серверу.Шифры задаются в формате,понятном библиотеке OpenSSL.
zh_cn: 指定向gRPC SSL服务器发送请求时启用的密码。密码是以OpenSSL库理解的格式指定的。

source: Specifies the enabled ciphers for requests to a proxied HTTPS server. The ciphers are specified in the format understood by the OpenSSL library.
ja: プロキシされた HTTPS サーバへのリクエストに対して有効な暗号化方式を指定します。この暗号化方式は OpenSSL ライブラリが理解する形式で指定されます。
ru: Определяет включенные шифры для запросов к проксированному HTTPS серверу.Шифры задаются в формате,понятном библиотеке OpenSSL.
zh_cn: 指定向代理HTTPS服务器请求时启用的密码。密码是以OpenSSL库理解的格式指定的。

source: Specifies the enabled ciphers for requests to a secured uwsgi server. The ciphers are specified in the format understood by the OpenSSL library.
ja: 安全な uwsgi サーバへのリクエストに対して有効な暗号化方式を指定します。暗号化方式は OpenSSL ライブラリが理解する形式で指定します。
ru: Определяет включенные шифры для запросов к защищенному серверу uwsgi.Шифры задаются в формате,понятном библиотеке OpenSSL.
zh_cn: 指定向安全的uwsgi服务器发出的请求所启用的密码,密码以OpenSSL库理解的格式指定。密码是以OpenSSL库理解的格式指定的。
