Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/nginx/nginx.*.004.xlf
Languages: es, ja, ko, ru, zh_cn

source: Synchronously tests permissions for a file or directory specified in the <code>path</code> (<a href="changes#njs0.3.9">0.3.9</a>). If the check fails, an error will be returned, otherwise, the method will return undefined.
ja: <code>path</code> （<a href="changes#njs0.3.9">0.3.9</a>）で指定されたファイルまたはディレクトリのアクセス許可を同期的にテストします。チェックが失敗した場合はエラーが返され、そうでない場合はメソッドは未定義を返します。
zh_cn: 同步测试在 <code>path</code> （<a href="changes#njs0.3.9">0.3.9</a>）中指定的文件或目录的权限。如果检查失败，将返回错误，否则，该方法将返回未定义。

source: Synchronously unlinks a file by <code>path</code> (<a href="changes#njs0.3.9">0.3.9</a>).
ja: <code>path</code> （<a href="changes#njs0.3.9">0.3.9</a>）でファイルのリンクを同期的に解除します。
zh_cn: 通过 <code>path</code> （<a href="changes#njs0.3.9">0.3.9</a>）同步取消链接文件。

source: Synchronously writes <code>data</code> to a file with provided <code>filename</code>. If the file does not exist, it will be created, if the file exists, it will be replaced. The <code>options</code> parameter is expected to be an object with the following keys:
ja: <code>data</code> れた <code>filename</code> でファイルに同期的にデータを書き込みます。ファイルが存在しない場合は作成され、ファイルが存在する場合は置き換えられます。 <code>options</code> パラメータは、以下のキーを持つオブジェクトであることが予想されます。
ru: Синхронно записывает <code>data</code> в файл с указанным <code>filename</code> . Если файл не существует, он будет создан, если файл существует, он будет заменен. Ожидается <code>options</code> параметр options будет объектом со следующими ключами:
zh_cn: 同步将 <code>data</code> 写入具有提供的 <code>filename</code> 的文件中。如果文件不存在，将创建它；如果文件存在，将被替换。该 <code>options</code> 参数预计将使用下列按键的对象：

source: Synchronously writes <code>data</code> to a file with provided <code>filename</code>. The <code>data</code> is expected to be a string or a Buffer object (<a href="changes#njs0.4.4">0.4.4</a>). If the file does not exist, it will be created, if the file exists, it will be replaced. The <code>options</code> parameter is expected to be an object with the following keys:
ja: <code>data</code> れたファイル <code>filename</code> ファイルにデータを同期的に書き込みます。 <code>data</code> 文字列またはバッファオブジェクト（ことが期待される<a href="changes#njs0.4.4">0.4.4</a>）。ファイルが存在しない場合は作成され、ファイルが存在する場合は置き換えられます。 <code>options</code> パラメータは、以下のキーを持つオブジェクトであることが予想されます。
zh_cn: 同步将 <code>data</code> 写入具有提供的 <code>filename</code> 的文件中。该 <code>data</code> 应为字符串或Buffer对象（<a href="changes#njs0.4.4">0.4.4</a>）。如果该文件不存在，则将创建它；如果该文件存在，则将被替换。该 <code>options</code> 参数预计将使用下列按键的对象：

source: TLS/SSL termination. The <a href="ngx_stream_ssl_module">ngx_stream_ssl_module</a> module is invoked at this phase.
ja: TLS / SSL終了。<a href="ngx_stream_ssl_module">ngx_stream_ssl_module</a>モジュールは、この段階で呼び出されます。
ru: Завершение TLS / SSL. На этом этапе вызывается модуль <a href="ngx_stream_ssl_module">ngx_stream_ssl_module</a> .
zh_cn: TLS / SSL终止。该<a href="ngx_stream_ssl_module">ngx_stream_ssl_module</a>模块在这个阶段被调用。

source: Template literals: multiline strings, expression interpolation, nesting templates (<a href="changes#njs0.3.2">0.3.2</a>)
ja: テンプレートリテラル：複数行の文字列、式の補間、ネストテンプレート（<a href="changes#njs0.3.2">0.3.2</a>）
ru: Литералы шаблонов: многострочные строки, интерполяция выражений, шаблоны вложенности ( <a href="changes#njs0.3.2">0.3.2</a> )
zh_cn: 模板文字：多行字符串，表达式插值，嵌套模板（<a href="changes#njs0.3.2">0.3.2</a>）

source: Terminate the array with the special value <code>ngx_null_command</code>. The <code>name</code> is the name of a directive as it appears in the configuration file, for example "worker_processes" or "listen". The <code>type</code> is a bit-field of flags that specify the number of arguments the directive takes, its type, and the context in which it appears. The flags are:
ja: 特別な値 <code>ngx_null_command</code> で配列を終了します。 <code>name</code> それがコンフィギュレーションファイルに表示される例「worker_processes」または「聞く」ために、ディレクティブの名前です。 <code>type</code> ディレクティブが取る引数の数、タイプ、およびそれが現れるコンテキストを指定するフラグのビットフィールドです。フラグは次のとおりです。
ru: Завершите массив специальным значением <code>ngx_null_command</code> . <code>name</code> является именем директивы , как представляется , в конфигурационном файле, например , &laquo;worker_processes&raquo; или &laquo;слушать&raquo;. <code>type</code> представляет собой битовое поле флагов , которые определяют количество аргументов , директива принимает, его тип, и контекст , в котором он появляется. Флаги:
zh_cn: 使用特殊值 <code>ngx_null_command</code> 终止数组。该 <code>name</code> 是出现在配置文件中，例如&ldquo;worker_processes&rdquo;或&ldquo;听&rdquo;一个指令的名称。该 <code>type</code> 是指定的指令采用的参数的数量，类型，以及它所在的背景标志的位字段。标志是：

source: Tested OS and platforms
ja: テスト済みのOSとプラットフォーム
zh_cn: 经过测试的操作系统和平台

source: Text Decoder
ja: テキストデコーダ
zh_cn: 文本解码器

source: Text Encoder
ja: テキストエンコーダ
zh_cn: 文本编码器

source: The $r Request Object Methods
ja: r リクエストオブジェクトメソッド
ru: Объектные методы запроса $r
zh_cn: $r请求对象方法

source: The &ldquo;<a href="https://tools.ietf.org/html/rfc5861#section-3">stale-while-revalidate</a>&rdquo; extension of the &ldquo;Cache-Control&rdquo; header field permits using a stale cached response if it is currently being updated.
ja: 「Cache-Control」ヘッダーフィールドの「<a href="https://tools.ietf.org/html/rfc5861#section-3">stale-while-revalidate</a>」拡張機能により、現在更新中の古いキャッシュされた応答を使用できます。
ru: Расширение &laquo; <a href="https://tools.ietf.org/html/rfc5861#section-3">stale-while-revalidate</a> &raquo; поля заголовка &laquo;Cache-Control&raquo; позволяет использовать устаревший кэшированный ответ, если он в настоящее время обновляется.
zh_cn: 如果&ldquo; Cache-Control&rdquo;头字段的&ldquo; <a href="https://tools.ietf.org/html/rfc5861#section-3">stale-while-revalidate</a> &rdquo;扩展当前正在更新，则允许使用过期的缓存响应。

source: The &ldquo;<code>expire</code>&rdquo; parameter of a <a href="ngx_http_keyval_module">key-value</a> pair can be <a href="#postHttpKeyvalZoneData">set</a> or <a href="#patchHttpKeyvalZoneKeyValue">changed</a> since <a href="#api_version">version</a> 5.
ja: <a href="ngx_http_keyval_module">キーと値の</a>ペアの「 <code>expire</code> 」パラメーターは、<a href="#api_version">バージョン</a>5以降で<a href="#postHttpKeyvalZoneData">設定</a>または<a href="#patchHttpKeyvalZoneKeyValue">変更</a>できます。
zh_cn: 自<a href="#api_version">版本</a>5起，可以<a href="#postHttpKeyvalZoneData">设置</a>或<a href="#patchHttpKeyvalZoneKeyValue">更改</a><a href="ngx_http_keyval_module">键值</a>对的&ldquo; <code>expire</code> &rdquo;参数。

source: The &ldquo;Authorization&rdquo;, &ldquo;Content-Length&rdquo;, &ldquo;Content-Range&rdquo;, &ldquo;Content-Type&rdquo;, &ldquo;ETag&rdquo;, &ldquo;Expect&rdquo;, &ldquo;From&rdquo;, &ldquo;Host&rdquo;, &ldquo;If-Match&rdquo;, &ldquo;If-Modified-Since&rdquo;, &ldquo;If-None-Match&rdquo;, &ldquo;If-Range&rdquo;, &ldquo;If-Unmodified-Since&rdquo;, &ldquo;Max-Forwards&rdquo;, &ldquo;Proxy-Authorization&rdquo;, &ldquo;Referer&rdquo;, &ldquo;Transfer-Encoding&rdquo;, and &ldquo;User-Agent&rdquo; request headers can have only one field value (<a href="changes#njs0.4.1">0.4.1</a>). Duplicate field values in &ldquo;Cookie&rdquo; headers are separated by semicolon (<code>;</code>). Duplicate field values in all other request headers are separated by commas.
ja: 「Authorization」、「Content-Length」、「Content-Range」、「Content-Type」、「ETag」、「Expect」、「From」、「Host」、「If-Match」、「If-Modified- 「Since」、「If-None-Match」、「If-Range」、「If-Unmodified-Since」、「Max-Forwards」、「Proxy-Authorization」、「Referer」、「Transfer-Encoding」、「User -Agent」リクエストヘッダーは、1つのフィールド値（<a href="changes#njs0.4.1">0.4.1</a>）のみを持つことができます。「Cookie」ヘッダーの重複するフィールド値は、セミコロン（ <code>;</code> ）で区切られます。他のすべてのリクエストヘッダーの重複するフィールド値は、コンマで区切られます。
zh_cn: &ldquo;授权&rdquo;，&ldquo;内容长度&rdquo;，&ldquo;内容范围&rdquo;，&ldquo;内容类型&rdquo;，&ldquo; ETag&rdquo;，&ldquo;期望&rdquo;，&ldquo;来自&rdquo;，&ldquo;主机&rdquo;，&ldquo; If-Match&rdquo;，&ldquo; If-Modified-自&rdquo;，&ldquo;如果不匹配&rdquo;，&ldquo;如果范围&rdquo;，&ldquo;如果未经修改则&rdquo;，&ldquo;最大转发&rdquo;，&ldquo;代理授权&rdquo;，&ldquo;推荐人&rdquo;，&ldquo;传输编码&rdquo;和&ldquo;用户&rdquo; -&ldquo;代理&rdquo;请求标头只能具有一个字段值（<a href="changes#njs0.4.1">0.4.1</a>）。&ldquo; Cookie&rdquo;标题中重复的字段值用分号（ <code>;</code> ）分隔。所有其他请求标头中的重复字段值均以逗号分隔。

source: The &ldquo;Foo&rdquo; response header can be accessed with the syntax: <code>headersOut.foo</code> or <code>headersOut['Foo']</code>.
ja: 「Foo」応答ヘッダーには、 <code>headersOut.foo</code> または <code>headersOut['Foo']</code> の構文でアクセスできます。
zh_cn: 可以使用以下语法访问&ldquo; Foo&rdquo;响应标头： <code>headersOut.foo</code> 或 <code>headersOut['Foo']</code> 。

source: The <a href="#fs_accesssync"><code>access()</code></a> method can accept the following flags. These flags are exported by <code>fs.constants</code>:
ja: <a href="#fs_accesssync"> <code>access()</code> </a>メソッドは、以下のフラグを受け入れることができます。これらのフラグは <code>fs.constants</code> によってエクスポートされます：
zh_cn: 该<a href="#fs_accesssync"> <code>access()</code> </a>方法可以接受下列标志。这些标志由 <code>fs.constants</code> 导出：

source: The <a href="#http_limit_conns_">/http/limit_conns/</a> data were added in <a href="#api_version">version</a> 6.
ja: <a href="#http_limit_conns_">/ HTTP / limit_conns /</a>データがで追加された<a href="#api_version">バージョン</a>6。
zh_cn: 的<a href="#http_limit_conns_">/ HTTP / limit_conns /</a>中加入数据<a href="#api_version">版本</a>6。

source: The <a href="#http_limit_reqs_">/http/limit_reqs/</a> data were added in <a href="#api_version">version</a> 6.
ja: <a href="#http_limit_reqs_">/ HTTP / limit_reqs /</a>データがで追加された<a href="#api_version">バージョン</a>6。
zh_cn: 的<a href="#http_limit_reqs_">/ HTTP / limit_reqs /</a>中加入数据<a href="#api_version">版本</a>6。

source: The <a href="#http_location_zones_">/http/location_zones/</a> data were added in <a href="#api_version">version</a> 5.
ja: <a href="#http_location_zones_">/ HTTP / location_zones /</a>データは、で追加された<a href="#api_version">バージョン</a>5。
zh_cn: 的<a href="#http_location_zones_">/ HTTP / location_zones /</a>中加入数据<a href="#api_version">版本</a>5。

source: The <a href="#resolvers_">/resolvers/</a> data were added in <a href="#api_version">version</a> 5.
ja: <a href="#resolvers_">/レゾルバ/</a>データは、添加した<a href="#api_version">バージョン</a>5。
zh_cn: 的<a href="#resolvers_">/解析器/</a>中加入数据<a href="#api_version">版本</a>5。

source: The <a href="#stream_limit_conns_">/stream/limit_conns/</a> data were added in <a href="#api_version">version</a> 6.
ja: <a href="#stream_limit_conns_">/ストリーム/ limit_conns /</a>データを添加した<a href="#api_version">バージョン</a>6。
zh_cn: 的<a href="#stream_limit_conns_">/流/ limit_conns /</a>数据中加入<a href="#api_version">版本</a>6。

source: The <a href="../http/ngx_http_keyval_module#keyval">keyval</a> and <a href="../http/ngx_http_keyval_module#keyval_zone">keyval_zone</a> directives are available as part of our <a href="http://nginx.com/products/">commercial subscription</a>.
ja: <a href="../http/ngx_http_keyval_module#keyval">KEYVAL</a>と<a href="../http/ngx_http_keyval_module#keyval_zone">keyval_zone</a>ディレクティブは、私たちの一部として利用可能です<a href="http://nginx.com/products/">商用サブスクリプション</a>。
zh_cn: 该<a href="../http/ngx_http_keyval_module#keyval">KEYVAL</a>和<a href="../http/ngx_http_keyval_module#keyval_zone">keyval_zone</a>指令都可以作为我们的部分<a href="http://nginx.com/products/">商业订阅</a>。

source: The <code><i>fill</i></code> parameter may be a <code><i>string</i></code>, <code><i>Buffer</i></code>, <code><i>Uint8Array</i></code>, or <code><i>integer</i></code>.
ja: <code><i>fill</i></code> パラメータとすることができる <code><i>string</i></code> 、 <code><i>Buffer</i></code> 、 <code><i>Uint8Array</i></code> 、または <code><i>integer</i></code> 。
zh_cn: 所述 <code><i>fill</i></code> 参数可以是 <code><i>string</i></code> ， <code><i>Buffer</i></code> ， <code><i>Uint8Array</i></code> ，或 <code><i>integer</i></code> 。

source: The <code>Foo</code> request header can be accessed with the syntax: <code>headersIn.foo</code> or <code>headersIn['Foo']</code>.
ja: <code>Foo</code> ：要求ヘッダが構文でアクセスすることができる <code>headersIn.foo</code> 又は <code>headersIn['Foo']</code> 。
zh_cn: 所述 <code>Foo</code> 请求报头可以与所述语法访问： <code>headersIn.foo</code> 或 <code>headersIn['Foo']</code> 。

source: The <code>TextDecoder</code> produces a stream of code points from a stream of bytes (<a href="changes#njs0.4.3">0.4.3</a>).
ja: <code>TextDecoder</code> はバイト（ストリームからコードポイントのストリームを生成<a href="changes#njs0.4.3">0.4.3</a>）。
zh_cn: 所述 <code>TextDecoder</code> 从字节（流产生的代码点的流<a href="changes#njs0.4.3">0.4.3</a>）。

source: The <code>TextEncoder</code> object produces a byte stream with UTF-8 encoding from a stream of code points (<a href="changes#njs0.4.3">0.4.3</a>).
ja: <code>TextEncoder</code> のオブジェクトは、コード・ポイント（のストリームからUTF-8エンコーディングのバイトストリームを生成<a href="changes#njs0.4.3">0.4.3</a>）。
zh_cn: 所述 <code>TextEncoder</code> 对象产生具有UTF-8从码点（流编码字节流<a href="changes#njs0.4.3">0.4.3</a>）。

source: The <code>equal</code> parameter is a substring for delimiting keys and values in the query string, by default is &ldquo;<code>=</code>&rdquo;.
ja: <code>equal</code> パラメータは、デフォルトでは、クエリ文字列内のキーと値を区切るためのサブストリング「です <code>=</code> 」。
zh_cn: 该 <code>equal</code> 参数是用于在查询字符串限定的键和值的子字符串，通过默认值是&ldquo; <code>=</code> &rdquo;。

source: The <code>key</code> is a pointer to a function that creates the hash integer key from a string. There are two generic key-creation functions: <code>ngx_hash_key(data, len)</code> and <code>ngx_hash_key_lc(data, len)</code>. The latter converts a string to all lowercase characters, so the passed string must be writable. If that is not true, pass the <code>NGX_HASH_READONLY_KEY</code> flag to the function, initializing the key array (see below).
ja: <code>key</code> 文字列からハッシュ整数キーを生成する関数へのポインタです。2つの一般的なキー作成関数があります： <code>ngx_hash_key(data, len)</code> と <code>ngx_hash_key_lc(data, len)</code> 。後者は文字列をすべて小文字に変換するため、渡された文字列は書き込み可能である必要があります。そうでない場合は、 <code>NGX_HASH_READONLY_KEY</code> フラグを関数に渡して、キー配列を初期化します（以下を参照）。
zh_cn: 该 <code>key</code> 是指向从字符串创建哈希整数键的函数的指针。有两个通用的密钥创建函数： <code>ngx_hash_key(data, len)</code> 和 <code>ngx_hash_key_lc(data, len)</code> 。后者将字符串转换为所有小写字符，因此传递的字符串必须可写。如果不正确，则将 <code>NGX_HASH_READONLY_KEY</code> 标志传递给该函数，以初始化键数组（请参见下文）。

source: The <code>load.js</code> file contains the library-loading code that stores its handle in the global namespace:
ja: <code>load.js</code> ファイルには、グローバル名前空間でそのハンドルを保存するライブラリローディングのコードが含まれています。
zh_cn: 该 <code>load.js</code> 文件包含库加载代码存储其在全局命名空间句柄：

source: The <code>ngx_http_keyval_module</code> module (1.13.3) creates variables with values taken from key-value pairs managed by the <a href="ngx_http_api_module#http_keyvals_">API</a> or a variable (1.15.10) that can also be set with <a href="../njs/examples#requests">njs</a>.
ja: <code>ngx_http_keyval_module</code> モジュール（1.13.3）は、によって管理されるキーと値のペアから採取された値を持つ変数を作成する<a href="ngx_http_api_module#http_keyvals_">API</a>もで設定することができ、または可変（1.15.10）<a href="../njs/examples#requests">NJSを</a>。
zh_cn: 所述 <code>ngx_http_keyval_module</code> 模块（1.13.3）使用从被管理的键-值对中获得的值的变量<a href="ngx_http_api_module#http_keyvals_">的API</a>的是还可以与设置或可变（10年1月15日）<a href="../njs/examples#requests">NJS</a>。

source: The <code>ngx_stream_set_module</code> module (1.19.3) allows setting a value for a variable.
ja: <code>ngx_stream_set_module</code> モジュール（1.19.3）は、変数の値を設定することができます。
zh_cn: 所述 <code>ngx_stream_set_module</code> 模块（1.19.3）允许设置一个变量的值。

source: The <code>off</code> parameter cancels the effect of the <code>proxy_cookie_domain</code> directives inherited from the previous configuration level.
ja: <code>off</code> パラメータは、の効果解除 <code>proxy_cookie_domain</code> の前の設定レベルから継承された指令を。
zh_cn: 的 <code>off</code> 参数取消的效果 <code>proxy_cookie_domain</code> 从以前的配置级别继承指令。

source: The <code>off</code> parameter cancels the effect of the <code>proxy_cookie_flags</code> directives inherited from the previous configuration level.
ja: <code>off</code> パラメータは、の効果解除 <code>proxy_cookie_flags</code> の前の設定レベルから継承された指令を。
zh_cn: 的 <code>off</code> 参数取消的效果 <code>proxy_cookie_flags</code> 从以前的配置级别继承指令。

source: The <code>off</code> parameter cancels the effect of the <code>proxy_cookie_path</code> directives inherited from the previous configuration level.
ja: <code>off</code> パラメータは、の効果解除 <code>proxy_cookie_path</code> の前の設定レベルから継承された指令を。
zh_cn: 的 <code>off</code> 参数取消的效果 <code>proxy_cookie_path</code> 从以前的配置级别继承指令。

source: The <code>off</code> parameter cancels the effect of the <code>proxy_redirect</code> directives inherited from the previous configuration level.
ja: <code>off</code> パラメータは、の効果解除 <code>proxy_redirect</code> の前の設定レベルから継承された指令を。
zh_cn: 的 <code>off</code> 参数取消的效果 <code>proxy_redirect</code> 从以前的配置级别继承指令。

source: The <code>off</code> parameter prohibits the use of the cache.
ja: <code>off</code> パラメータは、キャッシュの使用を禁止します。
zh_cn: 该 <code>off</code> 参数禁止使用的缓存。

source: The <code>options</code> parameter is expected to be an object with the following keys:
ja: <code>options</code> パラメータは、以下のキーを持つオブジェクトであることが予想されます。
zh_cn: 该 <code>options</code> 参数预计将使用下列按键的对象：

source: The <code>separator</code> parameter is a substring for delimiting key and value pairs in the query string, by default is &ldquo;<code>&amp;</code>&rdquo;.
ja: <code>separator</code> パラメータは、デフォルトでは、クエリ文字列にキーと値のペアを区切るためのサブされています「 <code>&amp;</code> 」。
zh_cn: 该 <code>separator</code> 参数是查询字符串划定键和值对的子串，默认是&ldquo; <code>&amp;</code> &rdquo;。

source: The <code>targetStart</code> is an integer specifying the offset within target at which to begin writing, by default is 0. The <code>sourceStart</code> is an integer specifying the offset within buffer from which to begin copying, by default is 0. The <code>sourceEnd</code> is an integer specifying the offset within buffer at which to stop copying (not inclusive) by default is <code><i>buf.length</i></code>.
ja: <code>targetStart</code> は、デフォルトで、書き込みを開始するためにターゲット内のオフセットれる指定する整数であり、0ザさ <code>sourceStart</code> では、デフォルトでは、コピーを開始し、そこからバッファ内のオフセットを指定する整数であり、0ザさ <code>sourceEnd</code> はオフセットを指定する整数です。デフォルトでコピーを停止するバッファ内（包括的ではない）は <code><i>buf.length</i></code> です。
zh_cn: 所述 <code>targetStart</code> 是整数指定目标内的偏移处开始写入，默认情况下是0。 <code>sourceStart</code> 是整数，指定在缓冲区内的偏移，从此处开始进行复印时，由缺省值是0。 <code>sourceEnd</code> 为整数指定的偏移默认情况下，要停止复制（不包括）的缓冲区中的缓冲区是 <code><i>buf.length</i></code> 。

source: The File System module provides operations with files.
ja: ファイルシステムモジュールは、ファイルの操作を提供します。
zh_cn: 文件系统模块提供对文件的操作。

source: The Query String module provides support for parsing and formatting URL query strings (<a href="changes#njs0.4.3">0.4.3</a>). The Query String module object is returned by <code>require('querystring')</code>.
ja: クエリ文字列モジュールは、URLクエリ文字列（<a href="changes#njs0.4.3">0.4.3</a>）の解析とフォーマットのサポートを提供します。クエリ文字列モジュールオブジェクトは、 <code>require('querystring')</code> によって返されます。
zh_cn: 查询字符串模块为解析和格式化URL查询字符串（<a href="changes#njs0.4.3">0.4.3</a>）提供支持。查询字符串模块对象由 <code>require('querystring')</code> 返回。

source: The address can be specified as a domain name or IP address, with an optional port (1.3.1, 1.2.2). If port is not specified, the port 53 is used. Name servers are queried in a round-robin fashion.
ja: アドレスはドメイン名またはIPアドレスとして指定でき、オプションでポート(1.3.1、1.2.2)を指定することができます。ポートを指定しない場合は、53番ポートが使用されます。ネームサーバーはラウンドロビン方式で照会されます。

source: The address can be specified as a domain name or IP address, with an optional port. If port is not specified, the port 53 is used. Name servers are queried in a round-robin fashion.
ja: アドレスはドメイン名またはIPアドレスとして指定でき、オプションでポートを指定することができます。ポートが指定されていない場合は、53番ポートが使用されます。ネームサーバーはラウンドロビン方式で問い合わせを行います。

source: The arguments to <code>ngx_regex_exec()</code> are the compiled regular expression <code>re</code>, the string to match <code>input</code>, an optional array of integers to hold any <code>captures</code> that are found, and the array's <code>size</code>. The size of the <code>captures</code> array must be a multiple of three, as required by the <a href="http://www.pcre.org/original/doc/html/pcreapi.html">PCRE API</a>. In the example, the size is calculated from the total number of captures plus one for the matched string itself.
ja: <code>ngx_regex_exec()</code> の引数は、コンパイルされた正規表現 <code>re</code> 、 <code>input</code> に一致する文字列、見つかった <code>captures</code> を保持する整数のオプションの配列、および配列の <code>size</code> です。 <code>captures</code> 配列のサイズは、<a href="http://www.pcre.org/original/doc/html/pcreapi.html">PCRE APIで</a>要求されているように、3の倍数である必要があります。この例では、サイズはキャプチャの総数に一致した文字列自体の1を加えたものから計算されます。

source: The configuration file, webpack.config.js:
ja: 設定ファイル、webpack.config.js。

source: The cookie can also be specified using regular expressions. In this case, <code><i>cookie</i></code> should start from the &ldquo;<code>~</code>&rdquo; symbol.
ja: Cookieは、正規表現を使用して指定することもできます。この場合、 <code><i>cookie</i></code> は「 <code>~</code> 」記号で始まる必要があります。

source: Prior to version 1.5.13, the default value depended on the size of the processor&rsquo;s cache line.
zh_cn: 在1.5.13版本之前，默认值取决于处理器的缓存行的大小。

source: Prior to version 1.5.13, the default value was 512.
zh_cn: 在1.5.13版本之前,默认值是512。

source: Prior to version 1.7.6, a <code><i>key</i></code> could contain exactly one variable.
zh_cn: 在版本1.7.6之前， <code><i>key</i></code> 可以只包含一个变量。

source: Prior to version 1.9.5, the default value was 1 32k.
zh_cn: 在1.9.5版本之前,默认值为1 32k。

source: Prior to version 1.9.8, the default value was 256 on all platforms.
zh_cn: 在1.9.8版本之前,所有平台的默认值为256。

source: Process I/O events by calling a handler, specific to the event notification mechanism, chosen by nginx configuration. This handler waits for at least one I/O event to happen, but only until the next timeout expires. When a read or write event occurs, the <code>ready</code> flag is set and the event's handler is called. For Linux, the <code>ngx_epoll_process_events()</code> handler is normally used, which calls <code>epoll_wait()</code> to wait for I/O events.
zh_cn: 通过调用特定于事件通知机制的处理程序来处理I / O事件，该处理程序由nginx配置选择。该处理程序等待至少一个I / O事件发生，但仅等到下一个超时到期为止。发生读或写事件时，将设置 <code>ready</code> 标志并调用事件的处理程序。对于Linux，通常使用 <code>ngx_epoll_process_events()</code> 处理函数，该处理函数调用 <code>epoll_wait()</code> 来等待I / O事件。

source: Process posted events by calling <code>ngx_event_process_posted()</code>. The function repeatedly removes the first element from the posted events queue and calls the element's handler, until the queue is empty.
zh_cn: 通过调用 <code>ngx_event_process_posted()</code> 处理发布的事件。该函数反复从发布的事件队列中删除第一个元素，并调用元素的处理程序，直到队列为空。

source: Processing of one or more of these response header fields can be disabled using the <a href="#fastcgi_ignore_headers">fastcgi_ignore_headers</a> directive.
zh_cn: 可以使用<a href="#fastcgi_ignore_headers">fastcgi_ignore_headers</a>指令禁用对这些响应头字段中的一个或多个的处理。

source: Processing of one or more of these response header fields can be disabled using the <a href="#proxy_ignore_headers">proxy_ignore_headers</a> directive.
zh_cn: 可以使用<a href="#proxy_ignore_headers">proxy_ignore_headers</a>指令禁用对这些响应头字段中的一个或多个的处理。

source: Processing of one or more of these response header fields can be disabled using the <a href="#scgi_ignore_headers">scgi_ignore_headers</a> directive.
zh_cn: 可以使用<a href="#scgi_ignore_headers">scgi_ignore_headers</a>指令禁用对这些响应头字段中的一个或多个的处理。

source: Processing of one or more of these response header fields can be disabled using the <a href="#uwsgi_ignore_headers">uwsgi_ignore_headers</a> directive.
zh_cn: 可以使用<a href="#uwsgi_ignore_headers">uwsgi_ignore_headers</a>指令禁用对这些响应头字段中的一个或多个的处理。

source: Profiles will be stored as <code>/path/to/profile.&lt;worker_pid&gt;</code>.
zh_cn: 配置文件将存储为 <code>/path/to/profile.&lt;worker_pid&gt;</code> 。

source: Provides the configuration file context in which the HTTP server directives are specified.
zh_cn: 提供指定HTTP服务器指令的配置文件上下文。

source: Provides the configuration file context in which the directives that affect connection processing are specified.
zh_cn: 提供配置文件上下文,在其中指定影响连接处理的指令。

source: Provides the configuration file context in which the mail server directives are specified.
zh_cn: 提供指定邮件服务器指令的配置文件上下文。

source: Provides the configuration file context in which the stream server directives are specified.
zh_cn: 提供配置文件上下文,在其中指定流服务器指令。
