Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/nginx/nginx.*.004.xlf
Languages: es, ja, ko, ru, zh_cn

source: The <code>ngx_stream_proxy_module</code> module (1.9.0) allows proxying data streams over TCP, UDP (1.9.13), and UNIX-domain sockets.
es: El m&oacute;dulo <code>ngx_stream_proxy_module</code> (1.9.0) permite transferir flujos de datos a trav&eacute;s de TCP, UDP (1.9.13) y sockets de dominio UNIX.
ja: <code>ngx_stream_proxy_module</code> モジュール（1.9.0）は、データをプロキシ可能TCP、UDP（1.9.13）上ストリーム、およびUNIXドメインソケット。
ko: <code>ngx_stream_proxy_module</code> 모듈 (1.9.0)의 데이터를 TCP, UDP (1.9.13), 및 UNIX 도메인 소켓을 통해 스트림을 프록시 허용한다.
ru: Модуль <code>ngx_stream_proxy_module</code> (1.9.0) позволяет проксировать потоки данных через сокеты TCP, UDP (1.9.13) и UNIX-домена.
zh_cn: 所述 <code>ngx_stream_proxy_module</code> 模块（1.9.0）允许进行代理通过TCP，UDP（1.9.13）和UNIX域套接字数据流。

source: The <code>ngx_stream_realip_module</code> module is used to change the client address and port to the ones sent in the PROXY protocol header (1.11.4). The PROXY protocol must be previously enabled by setting the <a href="ngx_stream_core_module#proxy_protocol">proxy_protocol</a> parameter in the <code>listen</code> directive.
es: El m&oacute;dulo <code>ngx_stream_realip_module</code> se utiliza para cambiar la direcci&oacute;n del cliente y el puerto a los enviados en el encabezado del protocolo PROXY (1.11.4). El protocolo PROXY debe habilitarse previamente configurando el par&aacute;metro <a href="ngx_stream_core_module#proxy_protocol">proxy_protocol</a> en la directiva <code>listen</code> .
ja: <code>ngx_stream_realip_module</code> モジュールは、プロキシ・プロトコル・ヘッダ（1.11.4）で送信されたものとクライアントアドレスとポートを変更するために使用されます。PROXYプロトコルは、 <code>listen</code> ディレクティブで<a href="ngx_stream_core_module#proxy_protocol">proxy_protocol</a>パラメータを設定して、事前に有効にする必要があります。
ko: <code>ngx_stream_realip_module</code> 모듈은 프록시 프로토콜 헤더 (1.11.4)에 보낸 사람에 대한 클라이언트의 주소와 포트를 변경하는 데 사용됩니다. <code>listen</code> 지시문 에서 <a href="ngx_stream_core_module#proxy_protocol">proxy_protocol</a> 매개 변수를 설정하여 PROXY 프로토콜을 미리 활성화해야합니다 .
ru: Модуль <code>ngx_stream_realip_module</code> используется для изменения адреса и порта клиента на те, которые отправлены в заголовке протокола PROXY (1.11.4). Протокол PROXY должен быть предварительно включен путем установки параметра <a href="ngx_stream_core_module#proxy_protocol">proxy_protocol</a> в директиве <code>listen</code> .
zh_cn: 所述 <code>ngx_stream_realip_module</code> 模块是用来改变客户端地址和端口，以在代理协议报头（1.11.4）发送的那些。必须通过在 <code>listen</code> 指令中设置<a href="ngx_stream_core_module#proxy_protocol">proxy_protocol</a>参数来预先启用PROXY协议。

source: The <code>ngx_stream_return_module</code> module (1.11.2) allows sending a specified value to the client and then closing the connection.
es: El m&oacute;dulo <code>ngx_stream_return_module</code> (1.11.2) permite enviar un valor especificado al cliente y luego cerrar la conexi&oacute;n.
ja: <code>ngx_stream_return_module</code> モジュール（1.11.2）は、クライアントに、指定された値を送信し、接続を閉じることができます。
ko: <code>ngx_stream_return_module</code> 모듈 (1.11.2) 클라이언트에 지정된 값을 전송하고 연결을 종료 허용한다.
ru: Модуль <code>ngx_stream_return_module</code> (1.11.2) позволяет отправить указанное значение клиенту и затем закрыть соединение.
zh_cn: 所述 <code>ngx_stream_return_module</code> 模块（1.11.2）允许发送一个指定的值给客户端，然后关闭连接。

source: The <code>ngx_stream_split_clients_module</code> module (1.11.3) creates variables suitable for A/B testing, also known as split testing.
es: El m&oacute;dulo <code>ngx_stream_split_clients_module</code> (1.11.3) crea variables adecuadas para las pruebas A / B, tambi&eacute;n conocidas como pruebas divididas.
ja: <code>ngx_stream_split_clients_module</code> モジュール（1.11.3）は、分割テストとして知られているA / Bテストに適した変数を作成します。
ko: <code>ngx_stream_split_clients_module</code> 모듈 (1.11.3)도 분할 테스트 알려진 A / B 테스팅에 적합한 변수를 생성한다.
ru: Модуль <code>ngx_stream_split_clients_module</code> (1.11.3) создает переменные, подходящие для A / B-тестирования, также известного как сплит-тестирование.
zh_cn: 所述 <code>ngx_stream_split_clients_module</code> 模块（1.11.3）创建一个适合于A / B测试，也称为分割测试变量。

source: The <code>ngx_stream_ssl_module</code> module (1.9.0) provides the necessary support for a stream proxy server to work with the SSL/TLS protocol. This module is not built by default, it should be enabled with the <code>--with-stream_ssl_module</code> configuration parameter.
es: El m&oacute;dulo <code>ngx_stream_ssl_module</code> (1.9.0) proporciona el soporte necesario para que un servidor proxy de flujo funcione con el protocolo SSL / TLS. Este m&oacute;dulo no est&aacute; construido de forma predeterminada, debe habilitarse con el <code>--with-stream_ssl_module</code> configuraci&oacute;n --with-stream_ssl_module .
ja: <code>ngx_stream_ssl_module</code> モジュール（1.9.0）は、SSL / TLSプロトコルで動作するストリームプロキシサーバーに必要なサポートを提供します。このモジュールはデフォルトではビルドされません <code>--with-stream_ssl_module</code> 設定パラメーターで有効にする必要があります。
ko: <code>ngx_stream_ssl_module</code> 의 모듈 (1.9.0)는 SSL / TLS 프로토콜 작업에 스트림 프록시 서버에 필요한 지원을 제공합니다. 이 모듈은 기본적으로 빌드되지 않으며 <code>--with-stream_ssl_module</code> 구성 매개 변수를 사용하여 활성화해야합니다 .
ru: Модуль <code>ngx_stream_ssl_module</code> (1.9.0) обеспечивает необходимую поддержку потокового прокси-сервера для работы с протоколом SSL / TLS. Этот модуль не создается по умолчанию, его следует включить с помощью параметра конфигурации <code>--with-stream_ssl_module</code> .
zh_cn: 所述 <code>ngx_stream_ssl_module</code> 模块（1.9.0）提供了一种用于流代理服务器工作与SSL / TLS协议的必要的支持。默认情况下未构建此模块，应使用 <code>--with-stream_ssl_module</code> 配置参数启用它。

source: The <code>ngx_stream_ssl_module</code> module supports variables since 1.11.2.
es: El m&oacute;dulo <code>ngx_stream_ssl_module</code> admite variables desde 1.11.2.
ja: <code>ngx_stream_ssl_module</code> モジュールは、1.11.2以降の変数をサポートしています。
ko: <code>ngx_stream_ssl_module</code> 모듈 1.11.2 때문에 변수를 지원한다.
ru: Модуль <code>ngx_stream_ssl_module</code> поддерживает переменные с 1.11.2.
zh_cn: 该 <code>ngx_stream_ssl_module</code> 模块支持自1.11.2变量。

source: The <code>ngx_stream_ssl_preread_module</code> module (1.11.5) allows extracting information from the <a href="https://tools.ietf.org/html/rfc5246#section-7.4.1.2">ClientHello</a> message without terminating SSL/TLS, for example, the server name requested through <a href="https://tools.ietf.org/html/rfc6066#section-3">SNI</a> or protocols advertised in <a href="https://tools.ietf.org/html/rfc7301">ALPN</a>. This module is not built by default, it should be enabled with the <code>--with-stream_ssl_preread_module</code> configuration parameter.
es: El m&oacute;dulo <code>ngx_stream_ssl_preread_module</code> (1.11.5) permite extraer informaci&oacute;n del mensaje <a href="https://tools.ietf.org/html/rfc5246#section-7.4.1.2">ClientHello</a> sin terminar SSL / TLS, por ejemplo, el nombre de servidor solicitado a trav&eacute;s de <a href="https://tools.ietf.org/html/rfc6066#section-3">SNI</a> o protocolos anunciados en <a href="https://tools.ietf.org/html/rfc7301">ALPN</a> . Este m&oacute;dulo no est&aacute; construido de forma predeterminada, debe habilitarse con el <code>--with-stream_ssl_preread_module</code> configuraci&oacute;n --with-stream_ssl_preread_module .
ja: <code>ngx_stream_ssl_preread_module</code> モジュール（1.11.5）がから情報を抽出でき<a href="https://tools.ietf.org/html/rfc5246#section-7.4.1.2">たClientHello</a> SSL / TLSを終了せずにメッセージ、例えば、を通じて要求されたサーバ名<a href="https://tools.ietf.org/html/rfc6066#section-3">SNI</a>またはプロトコルがでアドバタイズ<a href="https://tools.ietf.org/html/rfc7301">ALPN</a>。このモジュールはデフォルトではビルドされません <code>--with-stream_ssl_preread_module</code> 設定パラメーターで有効にする必要があります。
ko: <code>ngx_stream_ssl_preread_module</code> 모듈 (1.11.5)는 정보 추출있게 <a href="https://tools.ietf.org/html/rfc5246#section-7.4.1.2">의 ClientHello</a> SSL을 종료하지 않고 메시지 / TLS는, 예를 들어, 서버 이름을 요청 <a href="https://tools.ietf.org/html/rfc6066#section-3">SNI</a> 또는 프로토콜 보급 <a href="https://tools.ietf.org/html/rfc7301">ALPN</a> . 이 모듈은 기본적으로 빌드되지 않으며 <code>--with-stream_ssl_preread_module</code> 구성 매개 변수를 사용하여 활성화해야합니다 .
ru: Модуль <code>ngx_stream_ssl_preread_module</code> (1.11.5) позволяет извлекать информацию из сообщения <a href="https://tools.ietf.org/html/rfc5246#section-7.4.1.2">ClientHello</a> без завершения SSL / TLS, например, имя сервера, запрошенное через <a href="https://tools.ietf.org/html/rfc6066#section-3">SNI,</a> или протоколы, объявленные в <a href="https://tools.ietf.org/html/rfc7301">ALPN</a> . Этот модуль не создается по умолчанию, его следует включить с помощью параметра конфигурации <code>--with-stream_ssl_preread_module</code> .
zh_cn: 所述 <code>ngx_stream_ssl_preread_module</code> 模块（1.11.5）允许提取所述信息<a href="https://tools.ietf.org/html/rfc5246#section-7.4.1.2">的ClientHello</a>而不终止SSL消息/ TLS，例如，服务器名称通过请求<a href="https://tools.ietf.org/html/rfc6066#section-3">SNI</a>或协议中通告<a href="https://tools.ietf.org/html/rfc7301">ALPN</a>。默认情况下未构建此模块，应使用 <code>--with-stream_ssl_preread_module</code> 配置参数启用它。

source: The <code>ngx_stream_upstream_hc_module</code> module (1.9.0) allows enabling periodic health checks of the servers in a <a href="ngx_stream_upstream_module#upstream">group</a>. The server group must reside in the <a href="ngx_stream_upstream_module#zone">shared memory</a>.
es: El m&oacute;dulo <code>ngx_stream_upstream_hc_module</code> (1.9.0) permite habilitar comprobaciones de salud peri&oacute;dicas de los servidores de un <a href="ngx_stream_upstream_module#upstream">grupo</a> . El grupo de servidores debe residir en la <a href="ngx_stream_upstream_module#zone">memoria compartida</a> .
ja: <code>ngx_stream_upstream_hc_module</code> モジュール（1.9.0）の中のサーバの定期的な健康診断を可能にすることができ<a href="ngx_stream_upstream_module#upstream">グループ</a>。サーバーグループは<a href="ngx_stream_upstream_module#zone">共有メモリに</a>存在する必要があります。
ko: <code>ngx_stream_upstream_hc_module</code> 의 모듈 (1.9.0)은 상기 서버의 주기적 상태 확인을 가능하게 허용 <a href="ngx_stream_upstream_module#upstream">기</a> . 서버 그룹은 <a href="ngx_stream_upstream_module#zone">공유 메모리에</a> 상주해야합니다 .
ru: Модуль <code>ngx_stream_upstream_hc_module</code> (1.9.0) позволяет включать периодические проверки работоспособности серверов в <a href="ngx_stream_upstream_module#upstream">группе</a> . Группа серверов должна находиться в <a href="ngx_stream_upstream_module#zone">общей памяти</a> .
zh_cn: 所述 <code>ngx_stream_upstream_hc_module</code> 模块（1.9.0）允许使服务器定期健康检查在一<a href="ngx_stream_upstream_module#upstream">组</a>。服务器组必须驻留在<a href="ngx_stream_upstream_module#zone">共享内存中</a>。

source: The <code>ngx_stream_upstream_module</code> module (1.9.0) is used to define groups of servers that can be referenced by the <a href="ngx_stream_proxy_module#proxy_pass">proxy_pass</a> directive.
es: El m&oacute;dulo <code>ngx_stream_upstream_module</code> (1.9.0) se usa para definir grupos de servidores que pueden ser referenciados por la directiva <a href="ngx_stream_proxy_module#proxy_pass">proxy_pass</a> .
ja: <code>ngx_stream_upstream_module</code> モジュール（1.9.0）はで参照することができるサーバのグループを定義するために使用される<a href="ngx_stream_proxy_module#proxy_pass">proxy_passの</a>ディレクティブ。
ko: <code>ngx_stream_upstream_module</code> 의 모듈 (1.9.0)을 참조 할 수있는 서버 그룹을 정의하기 위해 사용된다 <a href="ngx_stream_proxy_module#proxy_pass">proxy_pass의</a> 지시자.
ru: Модуль <code>ngx_stream_upstream_module</code> (1.9.0) используется для определения групп серверов, на которые может ссылаться директива <a href="ngx_stream_proxy_module#proxy_pass">proxy_pass</a> .
zh_cn: 所述 <code>ngx_stream_upstream_module</code> 模块（1.9.0）被用于定义可以由被引用的服务器组<a href="ngx_stream_proxy_module#proxy_pass">proxy_pass</a>指令。

source: The <code>ngx_stream_upstream_module</code> module supports the following embedded variables:
es: El m&oacute;dulo <code>ngx_stream_upstream_module</code> admite las siguientes variables integradas:
ja: <code>ngx_stream_upstream_module</code> モジュールは以下の埋め込み変数をサポートしています。
ko: <code>ngx_stream_upstream_module</code> 모듈은 다음과 같은 포함 된 변수를 지원합니다 :
ru: Модуль <code>ngx_stream_upstream_module</code> поддерживает следующие встроенные переменные:
zh_cn: 该 <code>ngx_stream_upstream_module</code> 模块支持以下内置变量：

source: The <code>ngx_stream_zone_sync_module</code> module (1.13.8) provides the necessary support for synchronizing contents of <a href="ngx_stream_upstream_module#zone">shared memory zones</a> between nodes of a cluster. To enable synchronization for a particular zone, a corresponding module must support this feature. Currently, it is possible to synchronize HTTP <a href="../http/ngx_http_upstream_module#sticky">sticky</a> sessions, information about <a href="../http/ngx_http_limit_req_module">excessive HTTP requests</a>, and key-value pairs both in <a href="../http/ngx_http_keyval_module">http</a> and <a href="ngx_stream_keyval_module">stream</a>.
es: El m&oacute;dulo <code>ngx_stream_zone_sync_module</code> (1.13.8) proporciona el soporte necesario para sincronizar el contenido de <a href="ngx_stream_upstream_module#zone">las zonas de memoria compartida</a> entre los nodos de un cl&uacute;ster. Para habilitar la sincronizaci&oacute;n para una zona en particular, un m&oacute;dulo correspondiente debe admitir esta funci&oacute;n. Actualmente, es posible sincronizar sesiones <a href="../http/ngx_http_upstream_module#sticky">pegajosas</a> HTTP , informaci&oacute;n sobre <a href="../http/ngx_http_limit_req_module">solicitudes HTTP excesivas</a> y pares clave-valor tanto en <a href="../http/ngx_http_keyval_module">http</a> como en <a href="ngx_stream_keyval_module">stream</a> .
ja: <code>ngx_stream_zone_sync_module</code> モジュール（1.13.8）を、コンテンツ同期させるために必要なサポートを提供<a href="ngx_stream_upstream_module#zone">共有メモリ領域を</a>、クラスタのノード間を。特定のゾーンの同期を有​​効にするには、対応するモジュールがこの機能をサポートしている必要があります。現在、HTTP <a href="../http/ngx_http_upstream_module#sticky">スティッキー</a>セッション、<a href="../http/ngx_http_limit_req_module">過剰なHTTPリクエスト</a>に関する情報、およびキーと値のペアを<a href="../http/ngx_http_keyval_module">http</a>と<a href="ngx_stream_keyval_module">streamの</a>両方で同期することが可能です。
ko: <code>ngx_stream_zone_sync_module</code> 의 모듈 (1.13.8)의 내용 동기화에 필요한 지원을 제공하는 <a href="ngx_stream_upstream_module#zone">공유 메모리 영역을</a> 클러스터의 노드 사이를. 특정 영역에 대한 동기화를 활성화하려면 해당 모듈이이 기능을 지원해야합니다. 현재 HTTP <a href="../http/ngx_http_upstream_module#sticky">고정</a> 세션, <a href="../http/ngx_http_limit_req_module">과도한 HTTP 요청</a> 에 대한 정보 및 <a href="../http/ngx_http_keyval_module">http</a> 및 <a href="ngx_stream_keyval_module">stream</a> 모두에서 키-값 쌍 을 동기화 할 수 있습니다 .
ru: Модуль <code>ngx_stream_zone_sync_module</code> (1.13.8) обеспечивает необходимую поддержку для синхронизации содержимого <a href="ngx_stream_upstream_module#zone">зон общей памяти</a> между узлами кластера. Чтобы включить синхронизацию для определенной зоны, соответствующий модуль должен поддерживать эту функцию. В настоящее время, можно синхронизировать HTTP <a href="../http/ngx_http_upstream_module#sticky">липкие</a> сессии, информацию о <a href="../http/ngx_http_limit_req_module">чрезмерных запросов HTTP</a> , и пар ключ-значение , как в <a href="../http/ngx_http_keyval_module">HTTP</a> и <a href="ngx_stream_keyval_module">потоке</a> .
zh_cn: 所述 <code>ngx_stream_zone_sync_module</code> 模块（1.13.8）提供了用于同步的内容的必要支持<a href="ngx_stream_upstream_module#zone">共享存储器区域</a>的簇的节点之间。要为特定区域启用同步，相应的模块必须支持此功能。当前，可以同步HTTP <a href="../http/ngx_http_upstream_module#sticky">粘性</a>会话，有关<a href="../http/ngx_http_limit_req_module">过多HTTP请求的</a>信息以及<a href="../http/ngx_http_keyval_module">http</a>和<a href="ngx_stream_keyval_module">stream中</a>的键值对。

source: The <code>ngx_time()</code> and <code>ngx_timeofday()</code> macros return the current time value in seconds and are the preferred way to access the cached time value.
es: Las <code>ngx_time()</code> y <code>ngx_timeofday()</code> devuelven el valor de tiempo actual en segundos y son la forma preferida de acceder al valor de tiempo almacenado en cach&eacute;.
ja: <code>ngx_time()</code> と <code>ngx_timeofday()</code> マクロは、秒単位の現在時刻値を返し、キャッシュされた時刻の値にアクセスするための好ましい方法です。
ko: <code>ngx_time()</code> 및 <code>ngx_timeofday()</code> 매크로는 초 현재 시간 값을 반환하고 캐시 시간 값에 액세스 할 수있는 좋은 방법입니다.
ru: <code>ngx_time()</code> и <code>ngx_timeofday()</code> макросы возвращают текущее значение времени в секундах , и являются предпочтительным способом доступа кэшированных значений времени.
zh_cn: 所述 <code>ngx_time()</code> 和 <code>ngx_timeofday()</code> 宏返回以秒为单位的当前时间值，并且对访问缓存时间值的首选方式。

source: The <code>ngx_time_t</code> structure represents time with three separate types for seconds, milliseconds, and the GMT offset:
es: La estructura <code>ngx_time_t</code> representa el tiempo con tres tipos separados para segundos, milisegundos y el desplazamiento GMT:
ja: <code>ngx_time_t</code> 構造は、秒、ミリ秒のための3つの別々の種類と時間を表し、GMTのオフセット：
ko: <code>ngx_time_t</code> 구조 초, 밀리 초 동안 세 개의 유형의 시간을 나타내고, GMT 오프셋 :
ru: Структура <code>ngx_time_t</code> представляет время с тремя отдельными типами секунд, миллисекунд и смещения GMT:
zh_cn: 该 <code>ngx_time_t</code> 结构表示时间与三个单独的类型秒，毫秒，和GMT的偏移：

source: The <code>ngx_tm_t</code> structure is an alias for <code>struct tm</code> on UNIX platforms and <code>SYSTEMTIME</code> on Windows.
es: La estructura <code>ngx_tm_t</code> es un alias para <code>struct tm</code> en plataformas UNIX y <code>SYSTEMTIME</code> en Windows.
ja: <code>ngx_tm_t</code> 構造はの別名である <code>struct tm</code> UNIXプラットフォーム上と <code>SYSTEMTIME</code> Windows上で。
ko: <code>ngx_tm_t</code> 구조의 별칭입니다 <code>struct tm</code> UNIX 플랫폼 및 <code>SYSTEMTIME</code> Windows에서.
ru: Структура <code>ngx_tm_t</code> - это псевдоним <code>struct tm</code> на платформах UNIX и <code>SYSTEMTIME</code> в Windows.
zh_cn: 该 <code>ngx_tm_t</code> 结构是一个别名 <code>struct tm</code> 在UNIX平台和 <code>SYSTEMTIME</code> 在Windows上。

source: The <code>off</code> parameter cancels the effect of all <code>proxy_cookie_domain</code> directives on the current level:
es: El par&aacute;metro <code>off</code> cancela el efecto de todas <code>proxy_cookie_domain</code> directivas proxy_cookie_domain en el nivel actual:
ja: <code>off</code> パラメータは、すべての効果取り消し <code>proxy_cookie_domain</code> の現在のレベルのディレクティブを：
ko: <code>off</code> 매개 변수는 모든 효과 취소 <code>proxy_cookie_domain</code> 의 현재 수준에 대한 지침을 :
ru: Параметр <code>off</code> отменяет действие всех директив <code>proxy_cookie_domain</code> на текущем уровне:
zh_cn: 该 <code>off</code> 参数取消所有的效果 <code>proxy_cookie_domain</code> 电流电平指示：

source: The <code>off</code> parameter cancels the effect of all <code>proxy_cookie_path</code> directives on the current level:
es: El par&aacute;metro <code>off</code> cancela el efecto de todas <code>proxy_cookie_path</code> directivas proxy_cookie_path en el nivel actual:
ja: <code>off</code> パラメータは、すべての効果取り消し <code>proxy_cookie_path</code> の現在のレベルのディレクティブを：
ko: <code>off</code> 매개 변수는 모든 효과 취소 <code>proxy_cookie_path</code> 의 현재 수준에 대한 지침을 :
ru: Параметр <code>off</code> отменяет действие всех директив <code>proxy_cookie_path</code> на текущем уровне:
zh_cn: 该 <code>off</code> 参数取消所有的效果 <code>proxy_cookie_path</code> 电流电平指示：

source: The <code>off</code> parameter cancels the effect of all <code>proxy_redirect</code> directives on the current level:
es: El par&aacute;metro <code>off</code> cancela el efecto de todas <code>proxy_redirect</code> directivas proxy_redirect en el nivel actual:
ja: <code>off</code> パラメータは、すべての効果取り消し <code>proxy_redirect</code> の現在のレベルのディレクティブを：
ko: <code>off</code> 매개 변수는 모든 효과 취소 <code>proxy_redirect</code> 의 현재 수준에 대한 지침을 :
ru: Параметр <code>off</code> отменяет действие всех директив <code>proxy_redirect</code> на текущем уровне:
zh_cn: 该 <code>off</code> 参数取消所有的效果 <code>proxy_redirect</code> 电流电平指示：

source: The <code>off</code> parameter disables adding or modifying the &ldquo;Expires&rdquo; and &ldquo;Cache-Control&rdquo; response header fields.
es: El par&aacute;metro <code>off</code> inhabilita la adici&oacute;n o modificaci&oacute;n de los campos de encabezado de respuesta "Expires" y "Cache-Control".
ja: <code>off</code> 「期限切れ」と「のCache-Control」レスポンスヘッダフィールドを追加または変更するパラメータが無効になります。
ko: <code>off</code> 은 "만료"와 "캐시 제어"응답 헤더 필드를 추가하거나 수정하는 매개 변수 사용하지 않습니다.
ru: Параметр <code>off</code> отключает добавление или изменение полей заголовка ответа &laquo;Expires&raquo; и &laquo;Cache-Control&raquo;.
zh_cn: 的 <code>off</code> 参数禁用添加或修改&ldquo;过期&rdquo;和&ldquo;缓存控制&rdquo;响应的报头字段。

source: The <code>offset</code> defines the offset of a field in a module configuration structure that holds values for this particular directive. The typical use is to employ the <code>offsetof()</code> macro.
es: El <code>offset</code> define el desplazamiento de un campo en una estructura de configuraci&oacute;n de m&oacute;dulo que contiene valores para esta directiva en particular. El uso t&iacute;pico es emplear la macro <code>offsetof()</code> .
ja: <code>offset</code> は、この特定のディレクティブの値を保持するモジュール構成構造のフィールドのオフセットを定義します。典型的な使用法は、 <code>offsetof()</code> マクロを使用することです。
ko: <code>offset</code> 은이 특정 지시문에 대한 값을 보유하는 모듈 구성 구조에서 필드 의 오프셋을 정의합니다. 일반적인 용도는 <code>offsetof()</code> 매크로 를 사용하는 것 입니다.
ru: В <code>offset</code> определяет смещение поля в структуре конфигурации модуля , который содержит значение для этой конкретной директивы. Обычно используется макрос <code>offsetof()</code> .
zh_cn: 所述 <code>offset</code> 限定在保持值对于该特定指令的模块配置结构的字段的偏移量。典型的用法是使用 <code>offsetof()</code> 宏。

source: The <code>optional</code> parameter (0.8.7+) requests the client certificate and verifies it if the certificate is present.
es: El par&aacute;metro <code>optional</code> (0.8.7+) solicita el certificado del cliente y lo verifica si el certificado est&aacute; presente.
ja: <code>optional</code> パラメータ（0.8.7+）は、クライアント証明書を要求し、証明書が存在する場合、それを検証します。
ko: <code>optional</code> 인증서가있는 경우 매개 변수 (0.8.7+) 클라이언트 인증서를 검증을 요청합니다.
ru: <code>optional</code> параметр (0.8.7+) запрашивает сертификат клиента и проверяет его , если сертификат присутствует.
zh_cn: 的 <code>optional</code> 参数（0.8.7+）请求的客户端证书和验证，如果该证书是存在的。

source: The <code>optional</code> parameter requests the client certificate and verifies it if the certificate is present.
es: El par&aacute;metro <code>optional</code> solicita el certificado del cliente y lo verifica si el certificado est&aacute; presente.
ja: <code>optional</code> 証明書が存在する場合、パラメータは、クライアント証明書と検証、それを要求します。
ko: <code>optional</code> 인증서가있는 경우 매개 변수는 클라이언트 인증서를 검증을 요청합니다.
ru: <code>optional</code> параметр запрашивает сертификат клиента и проверяет его , если сертификат присутствует.
zh_cn: 该 <code>optional</code> 参数请求客户端证书，并验证其证书是否存在。
