Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/nginx/nginx.*.004.xlf
Languages: es, ja, ko, ru, zh_cn

source: The <code>optional_no_ca</code> parameter (1.3.8, 1.2.5) requests the client certificate but does not require it to be signed by a trusted CA certificate. This is intended for the use in cases when a service that is external to nginx performs the actual certificate verification. The contents of the certificate is accessible through the <a href="#var_ssl_client_cert">$ssl_client_cert</a> variable.
es: El par&aacute;metro <code>optional_no_ca</code> (1.3.8, 1.2.5) solicita el certificado de cliente pero no requiere que est&eacute; firmado por un certificado de CA confiable. Esto est&aacute; dise&ntilde;ado para el uso en casos en los que un servicio externo a nginx realiza la verificaci&oacute;n del certificado real. Se puede acceder al contenido del certificado a trav&eacute;s de la variable <a href="#var_ssl_client_cert">$ ssl_client_cert</a> .
ja: <code>optional_no_ca</code> のパラメータ（1.3.8、1.2.5）は、クライアント証明書を要求しますが、信頼されたCA証明書によって署名されることを必要としません。これは、nginxの外部にあるサービスが実際の証明書の検証を実行する場合の使用を目的としています。証明書の内容には、<a href="#var_ssl_client_cert">$ ssl_client_cert</a>変数を介してアクセスできます。
ko: <code>optional_no_ca</code> 의 매개 변수 (1.3.8, 1.2.5) 클라이언트 인증서를 요청하지만이 신뢰할 수있는 CA 인증서로 서명 할 필요가 없습니다. 이는 nginx 외부의 서비스가 실제 인증서 확인을 수행하는 경우에 사용하기위한 것입니다. 인증서 내용은 <a href="#var_ssl_client_cert">$ ssl_client_cert</a> 변수를 통해 액세스 할 수 있습니다 .
ru: Параметр <code>optional_no_ca</code> (1.3.8, 1.2.5) запрашивает сертификат клиента, но не требует, чтобы он был подписан доверенным сертификатом CA. Это предназначено для использования в случаях, когда служба, внешняя по отношению к nginx, выполняет фактическую проверку сертификата. Содержимое сертификата доступно через переменную <a href="#var_ssl_client_cert">$ ssl_client_cert</a> .
zh_cn: 该 <code>optional_no_ca</code> 参数（1.3.8，1.2.5）要求客户端证书，但不要求它由受信任的CA证书进行签名。这用于在nginx外部的服务执行实际证书验证的情况下使用。可通过<a href="#var_ssl_client_cert">$ ssl_client_cert</a>变量访问证书的内容。

source: The <code>optional_no_ca</code> parameter requests the client certificate but does not require it to be signed by a trusted CA certificate. This is intended for the use in cases when a service that is external to nginx performs the actual certificate verification. The contents of the certificate is accessible through requests <a href="ngx_mail_auth_http_module#auth_http_pass_client_cert">sent</a> to the authentication server.
es: El par&aacute;metro <code>optional_no_ca</code> solicita el certificado de cliente pero no requiere que est&eacute; firmado por un certificado de CA confiable. Esto est&aacute; dise&ntilde;ado para el uso en casos en los que un servicio externo a nginx realiza la verificaci&oacute;n del certificado real. Se puede acceder al contenido del certificado a trav&eacute;s de solicitudes <a href="ngx_mail_auth_http_module#auth_http_pass_client_cert">enviadas</a> al servidor de autenticaci&oacute;n.
ja: <code>optional_no_ca</code> のパラメータは、クライアント証明書を要求しますが、信頼されたCA証明書によって署名されることを必要としません。これは、nginxの外部にあるサービスが実際の証明書の検証を実行する場合の使用を目的としています。証明書の内容には、認証サーバーに<a href="ngx_mail_auth_http_module#auth_http_pass_client_cert">送信さ</a>れた要求を通じてアクセスできます。
ko: <code>optional_no_ca</code> 의 매개 변수는 클라이언트 인증서를 요청하지만이는 CA 인증서를 신뢰 서명 할 필요가 없습니다. 이는 nginx 외부의 서비스가 실제 인증서 확인을 수행하는 경우에 사용하기위한 것입니다. 인증 내용은 인증 서버로 <a href="ngx_mail_auth_http_module#auth_http_pass_client_cert">전송 된</a> 요청을 통해 액세스 할 수 있습니다 .
ru: Параметр <code>optional_no_ca</code> запрашивает сертификат клиента, но не требует, чтобы он был подписан доверенным сертификатом CA. Это предназначено для использования в случаях, когда служба, внешняя по отношению к nginx, выполняет фактическую проверку сертификата. Содержимое сертификата доступно через запросы, <a href="ngx_mail_auth_http_module#auth_http_pass_client_cert">отправленные</a> на сервер аутентификации.
zh_cn: 该 <code>optional_no_ca</code> 参数请求客户端证书，但不要求其签署由受信任的CA证书。这用于在nginx外部的服务执行实际证书验证的情况下使用。通过<a href="ngx_mail_auth_http_module#auth_http_pass_client_cert">发送</a>到身份验证服务器的请求可以访问证书的内容。

source: The <code>optional_no_ca</code> parameter requests the client certificate but does not require it to be signed by a trusted CA certificate. This is intended for the use in cases when a service that is external to nginx performs the actual certificate verification. The contents of the certificate is accessible through the <a href="#var_ssl_client_cert">$ssl_client_cert</a> variable.
es: El par&aacute;metro <code>optional_no_ca</code> solicita el certificado de cliente pero no requiere que est&eacute; firmado por un certificado de CA confiable. Esto est&aacute; dise&ntilde;ado para el uso en casos en los que un servicio externo a nginx realiza la verificaci&oacute;n del certificado real. Se puede acceder al contenido del certificado a trav&eacute;s de la variable <a href="#var_ssl_client_cert">$ ssl_client_cert</a> .
ja: <code>optional_no_ca</code> のパラメータは、クライアント証明書を要求しますが、信頼されたCA証明書によって署名されることを必要としません。これは、nginxの外部にあるサービスが実際の証明書の検証を実行する場合の使用を目的としています。証明書の内容には、<a href="#var_ssl_client_cert">$ ssl_client_cert</a>変数を介してアクセスできます。
ko: <code>optional_no_ca</code> 의 매개 변수는 클라이언트 인증서를 요청하지만이는 CA 인증서를 신뢰 서명 할 필요가 없습니다. 이는 nginx 외부의 서비스가 실제 인증서 확인을 수행하는 경우에 사용하기위한 것입니다. 인증서 내용은 <a href="#var_ssl_client_cert">$ ssl_client_cert</a> 변수를 통해 액세스 할 수 있습니다 .
ru: Параметр <code>optional_no_ca</code> запрашивает сертификат клиента, но не требует, чтобы он был подписан доверенным сертификатом CA. Это предназначено для использования в случаях, когда служба, внешняя по отношению к nginx, выполняет фактическую проверку сертификата. Содержимое сертификата доступно через переменную <a href="#var_ssl_client_cert">$ ssl_client_cert</a> .
zh_cn: 该 <code>optional_no_ca</code> 参数请求客户端证书，但不要求其签署由受信任的CA证书。这用于在nginx外部的服务执行实际证书验证的情况下使用。可通过<a href="#var_ssl_client_cert">$ ssl_client_cert</a>变量访问证书的内容。

source: The <code>path</code> and <code>method</code> fields of <a href="#def_nginx_error">nginx error object</a> were removed in <a href="#api_version">version</a> 4. These fields continue to exist in earlier api versions, but show an empty value.
es: Los campos de <code>path</code> y <code>method</code> del <a href="#def_nginx_error">objeto de error nginx</a> se eliminaron en la <a href="#api_version">versi&oacute;n</a> 4. Estos campos contin&uacute;an existiendo en versiones anteriores de la API, pero muestran un valor vac&iacute;o.
ja: <a href="#def_nginx_error">nginxエラーオブジェクト</a>の <code>path</code> と <code>method</code> フィールドは、<a href="#api_version">バージョン</a> 4で削除されました。これらのフィールドは、以前のAPIバージョンでも引き続き存在しますが、空の値を示します。
ko: <a href="#def_nginx_error">nginx 오류 객체</a> 의 <code>path</code> 및 <code>method</code> 필드는 <a href="#api_version">버전</a> 4 에서 제거되었습니다 .이 필드는 이전 API 버전에서는 계속 존재하지만 빈 값을 표시합니다.
ru: В <code>path</code> и <code>method</code> поля <a href="#def_nginx_error">Nginx объекта ошибки</a> были удалены в <a href="#api_version">версии</a> 4. Эти поля продолжают существовать в более ранних версиях API, но показать пустое значение.
zh_cn: <a href="#def_nginx_error">Nginx错误对象</a>的 <code>path</code> 和 <code>method</code> 字段在<a href="#api_version">版本</a> 4中已删除。这些字段在较早的api版本中继续存在，但显示为空值。

source: The <code>perl/lib/hello.pm</code> module:
es: El m&oacute;dulo <code>perl/lib/hello.pm</code> :
ja: <code>perl/lib/hello.pm</code> モジュール：
ko: <code>perl/lib/hello.pm</code> 모듈 :
ru: Модуль <code>perl/lib/hello.pm</code> :
zh_cn: 该 <code>perl/lib/hello.pm</code> 模块：

source: The <code>post</code> argument is the <code>ngx_conf_post_t</code> object itself, and the <code>data</code> is a pointer to the value, converted from arguments by the main handler with the appropriate type.
es: El argumento de <code>post</code> es el objeto <code>ngx_conf_post_t</code> en s&iacute; mismo, y los <code>data</code> son un puntero al valor, convertido a partir de argumentos por el controlador principal con el tipo apropiado.
ja: <code>post</code> 引数がある <code>ngx_conf_post_t</code> オブジェクト自体、及び <code>data</code> 値へのポインタである、適切な型のメインハンドラによって引数から変換されました。
ko: <code>post</code> 인수는이다 <code>ngx_conf_post_t</code> 객체 자체, 그리고 <code>data</code> 값에 대한 포인터, 적절한 유형의 주요 핸들러에 의해 인수에서 변환.
ru: <code>post</code> аргумента является <code>ngx_conf_post_t</code> самого объекта, а также <code>data</code> , представляет собой указатель на значение, преобразуются из аргументов в основном обработчике с соответствующим типом.
zh_cn: 该 <code>post</code> 参数是 <code>ngx_conf_post_t</code> 对象本身，而 <code>data</code> 是一个指针的值，从参数转换由主处理机用适当的类型。

source: The <code>post</code> field has two purposes: it may be used to define a handler to be called after the main handler has completed, or to pass additional data to the main handler. In the first case, the <code>ngx_conf_post_t</code> structure needs to be initialized with a pointer to the handler, for example:
es: El campo de <code>post</code> tiene dos prop&oacute;sitos: se puede usar para definir un controlador que se llamar&aacute; despu&eacute;s de que se haya completado el controlador principal o para pasar datos adicionales al controlador principal. En el primer caso, la estructura <code>ngx_conf_post_t</code> debe inicializarse con un puntero al controlador, por ejemplo:
ja: <code>post</code> フィールドには2つの目的があります：メインのハンドラが完了した後に呼び出されるハンドラを定義するために、またはメインハンドラに追加のデータを渡すために使用することができます。最初のケースでは、 <code>ngx_conf_post_t</code> 構造体をハンドラーへのポインターで初期化する必要があります。次に例を示します。
ko: <code>post</code> 필드는 두 가지 용도 : 메인 처리기가 완료된 후 호출하는 핸들러를 정의하거나 메인 처리기에 추가 데이터를 전달하는 데 사용될 수있다. 첫 번째 경우, <code>ngx_conf_post_t</code> 구조는 핸들러에 대한 포인터로 초기화해야합니다. 예를 들면 다음과 같습니다.
ru: Поле <code>post</code> имеет две цели: его можно использовать для определения обработчика, который будет вызываться после завершения основного обработчика, или для передачи дополнительных данных основному обработчику. В первом случае структуру <code>ngx_conf_post_t</code> нужно инициализировать указателем на обработчик, например:
zh_cn: 该 <code>post</code> 字段有两个目的：它可以被用来定义一个处理程序将被称为主处理程序完成后，或以另外的数据传递给主处理机。在第一种情况下，需要使用指向处理程序的指针来初始化 <code>ngx_conf_post_t</code> 结构，例如：

source: The <code>process</code> object is a global object that provides information about the current process (<a href="changes#njs0.3.3">0.3.3</a>).
es: El objeto de <code>process</code> es un objeto global que proporciona informaci&oacute;n sobre el proceso actual ( <a href="changes#njs0.3.3">0.3.3</a> ).
ja: <code>process</code> オブジェクトは、現在のプロセス（約情報提供グローバルオブジェクトである<a href="changes#njs0.3.3">0.3.3を</a>）。
ko: <code>process</code> 목적은 현재 프로세스 (약 정보를 제공하는 글로벌 목적 <a href="changes#njs0.3.3">0.3.3을</a> ).
ru: Объект <code>process</code> - это глобальный объект, который предоставляет информацию о текущем процессе ( <a href="changes#njs0.3.3">0.3.3</a> ).
zh_cn: 所述 <code>process</code> 对象是全局对象，它提供有关当前进程（信息<a href="changes#njs0.3.3">0.3.3</a>）。

source: The <code>proxy_protocol</code> parameter (1.11.4) allows specifying that all connections accepted on this port should use the <a href="http://www.haproxy.org/download/1.5/doc/proxy-protocol.txt">PROXY protocol</a>.
es: El par&aacute;metro <code>proxy_protocol</code> (1.11.4) permite especificar que todas las conexiones aceptadas en este puerto deben utilizar el <a href="http://www.haproxy.org/download/1.5/doc/proxy-protocol.txt">protocolo PROXY</a> .
ja: <code>proxy_protocol</code> のパラメータ（1.11.4）は、このポートで受け入れたすべての接続が使用すべきことを指定することができ<a href="http://www.haproxy.org/download/1.5/doc/proxy-protocol.txt">PROXYプロトコル</a>。
ko: <code>proxy_protocol</code> 의 매개 변수 (1.11.4)를하면이 포트에 모든 연결이 사용하도록 지정할 수 있습니다 <a href="http://www.haproxy.org/download/1.5/doc/proxy-protocol.txt">PROXY 프로토콜을</a> .
ru: Параметр <code>proxy_protocol</code> (1.11.4) позволяет указать, что все соединения, принимаемые на этом порту, должны использовать <a href="http://www.haproxy.org/download/1.5/doc/proxy-protocol.txt">протокол PROXY</a> .
zh_cn: 所述 <code>proxy_protocol</code> 参数（1.11.4）允许指定这个端口上接受的所有连接应使用<a href="http://www.haproxy.org/download/1.5/doc/proxy-protocol.txt">代理服务器协议</a>。

source: The <code>proxy_protocol</code> parameter (1.5.12) allows specifying that all connections accepted on this port should use the <a href="http://www.haproxy.org/download/1.5/doc/proxy-protocol.txt">PROXY protocol</a>.
es: El par&aacute;metro <code>proxy_protocol</code> (1.5.12) permite especificar que todas las conexiones aceptadas en este puerto deben utilizar el <a href="http://www.haproxy.org/download/1.5/doc/proxy-protocol.txt">protocolo PROXY</a> .
ja: <code>proxy_protocol</code> のパラメータ（1.5.12）は、このポートで受け入れたすべての接続が使用すべきことを指定することができ<a href="http://www.haproxy.org/download/1.5/doc/proxy-protocol.txt">PROXYプロトコル</a>。
ko: <code>proxy_protocol</code> 의 매개 변수 (1.5.12)을하면이 포트에 모든 연결이 사용하도록 지정할 수 있습니다 <a href="http://www.haproxy.org/download/1.5/doc/proxy-protocol.txt">PROXY 프로토콜을</a> .
ru: Параметр <code>proxy_protocol</code> (1.5.12) позволяет указать, что все соединения, принимаемые на этом порту, должны использовать <a href="http://www.haproxy.org/download/1.5/doc/proxy-protocol.txt">протокол PROXY</a> .
zh_cn: 所述 <code>proxy_protocol</code> 参数（1.5.12）允许指定这个端口上接受的所有连接应使用<a href="http://www.haproxy.org/download/1.5/doc/proxy-protocol.txt">代理服务器协议</a>。

source: The <code>proxy_protocol</code> parameter (1.5.12) changes the client address to the one from the PROXY protocol header. The PROXY protocol must be previously enabled by setting the <code>proxy_protocol</code> parameter in the <a href="ngx_http_core_module#listen">listen</a> directive.
es: El par&aacute;metro <code>proxy_protocol</code> (1.5.12) cambia la direcci&oacute;n del cliente a la del encabezado del protocolo PROXY. El protocolo PROXY debe habilitarse previamente configurando el par&aacute;metro <code>proxy_protocol</code> en la directiva <a href="ngx_http_core_module#listen">listen</a> .
ja: <code>proxy_protocol</code> のパラメータ（1.5.12）は、PROXYプロトコル・ヘッダからの1つのクライアントのアドレスを変更します。PROXYプロトコルは、<a href="ngx_http_core_module#listen">listen</a>ディレクティブで <code>proxy_protocol</code> パラメータを設定して、事前に有効にする必要があります。
ko: <code>proxy_protocol</code> 의 파라미터 (1.5.12)는 PROXY 프로토콜 헤더 중 하나에 클라이언트의 주소를 변경한다. <a href="ngx_http_core_module#listen">청취</a> 지시문 에서 <code>proxy_protocol</code> 매개 변수를 설정하여 PROXY 프로토콜을 미리 활성화해야합니다 .
ru: Параметр <code>proxy_protocol</code> (1.5.12) изменяет адрес клиента на адрес из заголовка протокола PROXY. Протокол PROXY должен быть предварительно включен путем установки параметра <code>proxy_protocol</code> в директиве <a href="ngx_http_core_module#listen">listen</a> .
zh_cn: 所述 <code>proxy_protocol</code> 参数（1.5.12）更改客户端地址来从代理协议报头的一个。必须通过在<a href="ngx_http_core_module#listen">listen</a>指令中设置 <code>proxy_protocol</code> 参数来预先启用PROXY协议。

source: The <code>request_body_no_buffering</code> flag enables the unbuffered mode of reading a request body. In this mode, after calling <code>ngx_http_read_client_request_body()</code>, the <code>bufs</code> chain might keep only a part of the body. To read the next part, call the <code>ngx_http_read_unbuffered_request_body(r)</code> function. The return value <code>NGX_AGAIN</code> and the request flag <code>reading_body</code> indicate that more data is available. If <code>bufs</code> is NULL after calling this function, there is nothing to read at the moment. The request callback <code>read_event_handler</code> will be called when the next part of request body is available.
es: La bandera <code>request_body_no_buffering</code> habilita el modo sin b&uacute;fer de leer el cuerpo de una solicitud. En este modo, despu&eacute;s de llamar a <code>ngx_http_read_client_request_body()</code> , la cadena <code>bufs</code> podr&iacute;a conservar solo una parte del cuerpo. Para leer la siguiente parte, llame a la funci&oacute;n <code>ngx_http_read_unbuffered_request_body(r)</code> . El valor de retorno <code>NGX_AGAIN</code> y el indicador de solicitud <code>reading_body</code> indican que hay m&aacute;s datos disponibles. Si <code>bufs</code> es NULL despu&eacute;s de llamar a esta funci&oacute;n, no hay nada para leer en este momento. La solicitud de devoluci&oacute;n de llamada <code>read_event_handler</code> se llamar&aacute; cuando la siguiente parte del cuerpo de la solicitud est&eacute; disponible.
ja: <code>request_body_no_buffering</code> フラグは、要求本体を読み取るの非バッファ・モードを可能にします。このモードでは、 <code>ngx_http_read_client_request_body()</code> を呼び出した後、 <code>bufs</code> チェーンがボディの一部のみを保持する場合があります。次の部分を読むには、 <code>ngx_http_read_unbuffered_request_body(r)</code> 関数を呼び出します。戻り値 <code>NGX_AGAIN</code> およびリクエストフラグ <code>reading_body</code> は、さらに多くのデータが利用可能であることを示します。この関数を呼び出した後に <code>bufs</code> がNULLの場合、現時点で読み取るものはありません。リクエストコールバック <code>read_event_handler</code> は、リクエストボディの次の部分が利用可能になったときに呼び出されます。
ko: <code>request_body_no_buffering</code> 플래그는 요청 본문을 읽는 버퍼링 모드를 가능하게한다. 이 모드에서 호출 한 후 <code>ngx_http_read_client_request_body()</code> 는 <code>bufs</code> 의 체인은 신체의 일부를 유지할 수 있습니다. 다음 부분을 읽으려면 <code>ngx_http_read_unbuffered_request_body(r)</code> 함수를 호출하십시오 . 리턴 값 <code>NGX_AGAIN</code> 및 요청 플래그 <code>reading_body</code> 는 더 많은 데이터가 사용 가능함을 나타냅니다. 경우 <code>bufs</code> 이 NULL이 함수를 호출 이후, 순간에 읽을 수있는 것은 없다. 요청 본문의 다음 부분이 사용 가능하면 요청 콜백 <code>read_event_handler</code> 가 호출됩니다.
ru: <code>request_body_no_buffering</code> флаг позволяет небуферизованному режиму чтения запроса тела. В этом режиме, после вызова <code>ngx_http_read_client_request_body()</code> , то <code>bufs</code> цепь может держать только часть тела. Чтобы прочитать следующую часть, вызовите функцию <code>ngx_http_read_unbuffered_request_body(r)</code> . Возвращаемое значение <code>NGX_AGAIN</code> и флаг запроса <code>reading_body</code> указывают, что доступны дополнительные данные. Если после вызова этой функции <code>bufs</code> имеет значение NULL, в данный момент читать нечего. Обратный вызов запроса <code>read_event_handler</code> будет вызван, когда станет доступна следующая часть тела запроса.
zh_cn: 所述 <code>request_body_no_buffering</code> 标志使得能够读取请求主体的缓冲模式。在这种模式下，调用 <code>ngx_http_read_client_request_body()</code> 之后， <code>bufs</code> 链可能只保留主体的一部分。要阅读下一部分，请调用 <code>ngx_http_read_unbuffered_request_body(r)</code> 函数。返回值 <code>NGX_AGAIN</code> 和请求标志 <code>reading_body</code> 指示有更多数据可用。如果调用此函数后 <code>bufs</code> 为NULL，则此刻没有任何内容可供读取。当请求正文的下一部分可用时，将调用请求回调 <code>read_event_handler</code> 。

source: The <code>resolve</code> parameter instructs nginx to monitor changes of the IP addresses that correspond to a domain name of the node and automatically modify the configuration without the need of restarting nginx.
es: El par&aacute;metro <code>resolve</code> le indica a nginx que monitoree los cambios de las direcciones IP que corresponden a un nombre de dominio del nodo y que modifique autom&aacute;ticamente la configuraci&oacute;n sin la necesidad de reiniciar nginx.
ja: <code>resolve</code> パラメータ指示するには、ノードのドメイン名に対応し、自動的にはnginxのを再起動を必要とせずに設定を変更することをIPアドレスの変更を監視するためにnginxの。
ko: <code>resolve</code> 매개 변수에 지시는 노드의 도메인 이름에 해당하는 자동이의 nginx를 재시작 할 필요없이 구성을 수정하는 IP 주소의 변경을 감시하기 위해서 nginx에.
ru: Параметр <code>resolve</code> указывает nginx отслеживать изменения IP-адресов, соответствующих доменному имени узла, и автоматически изменять конфигурацию без необходимости перезапуска nginx.
zh_cn: 该 <code>resolve</code> 参数指示nginx的监控IP地址的变化对应于节点的域名，并自动修改配置，而不需要重新启动Nginx的。

source: The <code>revalidated</code> field in <a href="#caches">caches</a> was added in <a href="#version">version</a> 3.
es: El campo <code>revalidated</code> en <a href="#caches">cach&eacute;s</a> se agreg&oacute; en la <a href="#version">versi&oacute;n</a> 3.
ja: <a href="#caches">キャッシュ</a>の <code>revalidated</code> フィールドは、<a href="#version">バージョン</a> 3で追加されました。
ko: <a href="#caches">캐시</a> 의 <code>revalidated</code> 필드가 <a href="#version">버전</a> 3 에 추가되었습니다 .
ru: <code>revalidated</code> поле в <a href="#caches">кэшах</a> было добавлено в <a href="#version">версии</a> 3.
zh_cn: 在 <code>revalidated</code> 现场<a href="#caches">缓存</a>中添加<a href="#version">版本</a> 3。

source: The <code>set</code> field defines a handler that processes a directive and stores parsed values into the corresponding configuration. There's a number of functions that perform common conversions:
es: El campo <code>set</code> define un controlador que procesa una directiva y almacena los valores analizados en la configuraci&oacute;n correspondiente. Hay una serie de funciones que realizan conversiones comunes:
ja: <code>set</code> フィールドは、対応する構成に値を構文解析指令格納を処理するハンドラを定義します。一般的な変換を実行する多くの関数があります：
ko: <code>set</code> 필드는 해당 구성에 값을 파싱하여 저장 지시어를 처리하는 처리기를 정의한다. 일반적인 변환을 수행하는 여러 기능이 있습니다.
ru: Поле <code>set</code> определяет обработчик, который обрабатывает директиву и сохраняет проанализированные значения в соответствующей конфигурации. Есть ряд функций, которые выполняют обычные преобразования:
zh_cn: 该 <code>set</code> 字段定义，其处理解析值到相应的配置的指令，并存储处理程序。有许多函数可以执行常见的转换：

source: The <code>set</code> handler allows setting the property referenced by the variable. For example, the set handler of the <code>$limit_rate</code> variable modifies the request's <code>limit_rate</code> field:
es: El manejador de <code>set</code> permite configurar la propiedad a la que hace referencia la variable. Por ejemplo, el controlador de conjunto de la variable <code>$limit_rate</code> modifica el campo <code>limit_rate</code> de la solicitud :
ja: <code>set</code> ハンドラは、変数が参照するプロパティを設定することができます。たとえば、 <code>$limit_rate</code> 変数のsetハンドラーは、リクエストの <code>limit_rate</code> フィールドを変更します。
ko: <code>set</code> 핸들러는 변수가 참조하는 속성을 설정 할 수 있습니다. 예를 들어, <code>$limit_rate</code> 변수 의 set 핸들러 는 요청의 <code>limit_rate</code> 필드를 수정합니다 .
ru: <code>set</code> обработчик позволяет установить свойство , на который ссылается переменная. Например, обработчик <code>$limit_rate</code> переменной $ limit_rate изменяет поле <code>limit_rate</code> запроса :
zh_cn: 该 <code>set</code> 处理程序允许设定由变量引用的属性。例如， <code>$limit_rate</code> 变量的set处理程序修改请求的 <code>limit_rate</code> 字段：

source: The <code>spdy</code> parameter (1.3.15-1.9.4) allows accepting <a href="ngx_http_spdy_module">SPDY</a> connections on this port. Normally, for this to work the <code>ssl</code> parameter should be specified as well, but nginx can also be configured to accept SPDY connections without SSL.
es: El par&aacute;metro <code>spdy</code> (1.3.15-1.9.4) permite aceptar conexiones <a href="ngx_http_spdy_module">SPDY</a> en este puerto. Normalmente, para que esto funcione, tambi&eacute;n se debe especificar el par&aacute;metro <code>ssl</code> , pero nginx tambi&eacute;n se puede configurar para aceptar conexiones SPDY sin SSL.
ja: <code>spdy</code> パラメータ（1.3.15-1.9.4）が受諾可能に<a href="ngx_http_spdy_module">SPDY</a>このポートでの接続を。通常、これを機能させるには、 <code>ssl</code> パラメーターも指定する必要がありますが、nginxは、SSLなしでSPDY接続を受け入れるように構成することもできます。
ko: <code>spdy</code> 파라미터 (1.3.15-1.9.4)은 수용성 허용 <a href="ngx_http_spdy_module">SPDY</a> 이 포트에 연결. 일반적으로 이것이 작동하려면 <code>ssl</code> 매개 변수도 지정해야하지만 SSL없이 SPDY 연결을 허용하도록 nginx를 구성 할 수도 있습니다.
ru: Параметр <code>spdy</code> (1.3.15&ndash;1.9.4) позволяет принимать <a href="ngx_http_spdy_module">SPDY-</a> соединения на этом порту. Обычно, чтобы это работало, также должен быть указан параметр <code>ssl</code> , но nginx также может быть настроен на прием SPDY-соединений без SSL.
zh_cn: 的 <code>spdy</code> 参数（1.3.15-1.9.4）允许接受<a href="ngx_http_spdy_module">SPDY</a>这个端口上的连接。通常，要使其正常工作，还应指定 <code>ssl</code> 参数，但是也可以将nginx配置为接受不带SSL的SPDY连接。

source: The <code>src/core/ngx_rbtree.h</code> header file provides access to the effective implementation of red-black trees.
es: El archivo de encabezado <code>src/core/ngx_rbtree.h</code> proporciona acceso a la implementaci&oacute;n efectiva de &aacute;rboles rojo-negro.
ja: <code>src/core/ngx_rbtree.h</code> ヘッダファイル赤黒木の効果的な実施へのアクセスを提供します。
ko: <code>src/core/ngx_rbtree.h</code> 헤더 파일은 레드 - 블랙 트리의 효과적인 이행에 대한 액세스를 제공합니다.
ru: <code>src/core/ngx_rbtree.h</code> заголовочный файл обеспечивает доступ к эффективной реализации красно-черных деревьев.
zh_cn: 在 <code>src/core/ngx_rbtree.h</code> 头文件提供了访问的有效执行红黑树。
