Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/nginx/nginx.*.004.xlf
Languages: es, ja, ko, ru, zh_cn

source: Sets the <code><i>address</i></code> and <code><i>port</i></code> for the socket on which the server will accept requests. It is possible to specify just the port. The address can also be a hostname, for example:
ja: サーバーがリクエストを受け入れるソケットの <code><i>address</i></code> と <code><i>port</i></code> を設定します。ポートのみ指定することも可能です。アドレスは、ホスト名にすることもできます。次に例を示します。
ru: Устанавливает <code><i>address</i></code> и <code><i>port</i></code> для сокета, на котором сервер будет принимать запросы. Можно указать просто порт. Адрес также может быть именем хоста, например:
zh_cn: 设置服务器将在其上接受请求的套接字的 <code><i>address</i></code> 和 <code><i>port</i></code> 。可以仅指定端口。该地址也可以是主机名，例如：

source: Sets the <code><i>name</i></code> and <code><i>size</i></code> of the shared memory zone that keeps the key-value database. Key-value pairs are managed by the <a href="../http/ngx_http_api_module#stream_keyvals_">API</a>.
ja: Key-Valueデータベースを保持する共有メモリゾーンの <code><i>name</i></code> と <code><i>size</i></code> を設定します。キーと値のペアは<a href="../http/ngx_http_api_module#stream_keyvals_">API</a>によって管理されます。
ru: Устанавливает <code><i>name</i></code> и <code><i>size</i></code> зоны общей памяти, в которой хранится база данных &laquo;ключ-значение&raquo;. Пары "ключ-значение" управляются <a href="../http/ngx_http_api_module#stream_keyvals_">API</a> .
zh_cn: 设置保留键值数据库的共享内存区域的 <code><i>name</i></code> 和 <code><i>size</i></code> 。键值对由<a href="../http/ngx_http_api_module#stream_keyvals_">API</a>管理。

source: Sets the <code><i>name</i></code> and <code><i>size</i></code> of the shared memory zone that keeps the key-value database. Key-value pairs are managed by the <a href="ngx_http_api_module#http_keyvals_">API</a>.
ja: Key-Valueデータベースを保持する共有メモリゾーンの <code><i>name</i></code> と <code><i>size</i></code> を設定します。キーと値のペアは<a href="ngx_http_api_module#http_keyvals_">API</a>によって管理されます。
ru: Устанавливает <code><i>name</i></code> и <code><i>size</i></code> зоны общей памяти, в которой хранится база данных &laquo;ключ-значение&raquo;. Пары "ключ-значение" управляются <a href="ngx_http_api_module#http_keyvals_">API</a> .
zh_cn: 设置保留键值数据库的共享内存区域的 <code><i>name</i></code> 和 <code><i>size</i></code> 。键值对由<a href="ngx_http_api_module#http_keyvals_">API</a>管理。

source: Sets the <code><i>number</i></code> and <code><i>size</i></code> of buffers used to compress a response. By default, the buffer size is equal to one memory page. This is either 4K or 8K, depending on a platform.
ja: 応答の圧縮に使用されるバッファの <code><i>number</i></code> と <code><i>size</i></code> を設定します。デフォルトでは、バッファサイズは1メモリページに相当します。これは、プラットフォームに応じて4Kまたは8Kです。
ru: Устанавливает <code><i>number</i></code> и <code><i>size</i></code> буферов, используемых для сжатия ответа. По умолчанию размер буфера равен одной странице памяти. Это либо 4K, либо 8K, в зависимости от платформы.
zh_cn: 设置用于压缩响应的缓冲区的 <code><i>number</i></code> 和 <code><i>size</i></code> 。默认情况下，缓冲区大小等于一个内存页。根据平台的不同，它可以是4K或8K。

source: Sets the <code><i>number</i></code> and <code><i>size</i></code> of buffers used to decompress a response. By default, the buffer size is equal to one memory page. This is either 4K or 8K, depending on a platform.
ja: 応答の解凍に使用されるバッファーの <code><i>number</i></code> と <code><i>size</i></code> を設定します。デフォルトでは、バッファサイズは1メモリページに相当します。これは、プラットフォームに応じて4Kまたは8Kです。
ru: Устанавливает <code><i>number</i></code> и <code><i>size</i></code> буферов, используемых для распаковки ответа. По умолчанию размер буфера равен одной странице памяти. Это либо 4K, либо 8K, в зависимости от платформы.
zh_cn: 设置用于解压缩响应的缓冲区的 <code><i>number</i></code> 和 <code><i>size</i></code> 。默认情况下，缓冲区大小等于一个内存页。根据平台的不同，它可以是4K或8K。

source: Sets the <code><i>number</i></code> and <code><i>size</i></code> of the buffers used for reading a response from a disk.
ja: ディスクからの応答の読み取りに使用されるバッファーの <code><i>number</i></code> と <code><i>size</i></code> を設定します。
ru: Устанавливает <code><i>number</i></code> и <code><i>size</i></code> буферов, используемых для чтения ответа с диска.
zh_cn: 设置用于从磁盘读取响应的缓冲区的 <code><i>number</i></code> 和 <code><i>size</i></code> 。

source: Sets the <code><i>number</i></code> and <code><i>size</i></code> of the buffers used for reading a response from the FastCGI server, for a single connection. By default, the buffer size is equal to one memory page. This is either 4K or 8K, depending on a platform.
ja: 単一の接続に対して、FastCGIサーバーからの応答の読み取りに使用されるバッファーの <code><i>number</i></code> と <code><i>size</i></code> を設定します。デフォルトでは、バッファサイズは1メモリページに相当します。これは、プラットフォームに応じて4Kまたは8Kです。
ru: Устанавливает <code><i>number</i></code> и <code><i>size</i></code> буферов, используемых для чтения ответа от сервера FastCGI для одного соединения. По умолчанию размер буфера равен одной странице памяти. Это либо 4K, либо 8K, в зависимости от платформы.
zh_cn: 为单个连接设置用于从FastCGI服务器读取响应的缓冲区的 <code><i>number</i></code> 和 <code><i>size</i></code> 。默认情况下，缓冲区大小等于一个内存页。根据平台的不同，它可以是4K或8K。

source: Sets the <code><i>number</i></code> and <code><i>size</i></code> of the buffers used for reading a response from the SCGI server, for a single connection. By default, the buffer size is equal to one memory page. This is either 4K or 8K, depending on a platform.
ja: 単一の接続に対して、SCGIサーバーからの応答の読み取りに使用されるバッファーの <code><i>number</i></code> と <code><i>size</i></code> を設定します。デフォルトでは、バッファサイズは1メモリページに相当します。これは、プラットフォームに応じて4Kまたは8Kです。
ru: Устанавливает <code><i>number</i></code> и <code><i>size</i></code> буферов, используемых для чтения ответа от SCGI-сервера для одного соединения. По умолчанию размер буфера равен одной странице памяти. Это либо 4K, либо 8K, в зависимости от платформы.
zh_cn: 设置用于单个连接的，用于从SCGI服务器读取响应的缓冲区的 <code><i>number</i></code> 和 <code><i>size</i></code> 。默认情况下，缓冲区大小等于一个内存页。根据平台的不同，它可以是4K或8K。

source: Sets the <code><i>number</i></code> and <code><i>size</i></code> of the buffers used for reading a response from the proxied server, for a single connection. By default, the buffer size is equal to one memory page. This is either 4K or 8K, depending on a platform.
ja: 単一の接続で、プロキシサーバーからの応答の読み取りに使用されるバッファーの <code><i>number</i></code> と <code><i>size</i></code> を設定します。デフォルトでは、バッファサイズは1メモリページに相当します。これは、プラットフォームに応じて4Kまたは8Kです。
ru: Устанавливает <code><i>number</i></code> и <code><i>size</i></code> буферов, используемых для чтения ответа от прокси-сервера для одного соединения. По умолчанию размер буфера равен одной странице памяти. Это либо 4K, либо 8K, в зависимости от платформы.
zh_cn: 设置用于从单个服务器读取代理服务器响应的缓冲区的 <code><i>number</i></code> 和 <code><i>size</i></code> 。默认情况下，缓冲区大小等于一个内存页。根据平台的不同，它可以是4K或8K。

source: Sets the <code><i>number</i></code> and <code><i>size</i></code> of the buffers used for reading a response from the uwsgi server, for a single connection. By default, the buffer size is equal to one memory page. This is either 4K or 8K, depending on a platform.
ja: 単一の接続で、uwsgiサーバーからの応答の読み取りに使用されるバッファーの <code><i>number</i></code> と <code><i>size</i></code> を設定します。デフォルトでは、バッファサイズは1メモリページに相当します。これは、プラットフォームに応じて4Kまたは8Kです。
ru: Устанавливает <code><i>number</i></code> и <code><i>size</i></code> буферов, используемых для чтения ответа от сервера uwsgi для одного соединения. По умолчанию размер буфера равен одной странице памяти. Это либо 4K, либо 8K, в зависимости от платформы.
zh_cn: 为单个连接设置用于从uwsgi服务器读取响应的缓冲区的 <code><i>number</i></code> 和 <code><i>size</i></code> 。默认情况下，缓冲区大小等于一个内存页。根据平台的不同，它可以是4K或8K。

source: Sets the <code><i>number</i></code> and <code><i>size</i></code> of the per-zone buffers used for pushing zone contents. By default, the buffer size is equal to one memory page. This is either 4K or 8K, depending on a platform.
ja: ゾーンのコンテンツのプッシュに使用されるゾーンごとのバッファーの <code><i>number</i></code> と <code><i>size</i></code> を設定します。デフォルトでは、バッファサイズは1メモリページに相当します。これは、プラットフォームに応じて4Kまたは8Kです。
ru: Устанавливает <code><i>number</i></code> и <code><i>size</i></code> буферов для каждой зоны, используемых для передачи содержимого зоны. По умолчанию размер буфера равен одной странице памяти. Это либо 4K, либо 8K, в зависимости от платформы.
zh_cn: 设置用于推送区域内容的每个区域缓冲区的 <code><i>number</i></code> 和 <code><i>size</i></code> 。默认情况下，缓冲区大小等于一个内存页。根据平台的不同，它可以是4K或8K。

source: Sets the <code><i>number</i></code> of requests after which the response will be cached.
ja: 応答がキャッシュされるまでの要求 <code><i>number</i></code> を設定します。
ru: Устанавливает <code><i>number</i></code> запросов, после которых ответ будет кэшироваться.
zh_cn: 设置请求 <code><i>number</i></code> ，之后将缓存响应。

source: Sets the <code><i>size</i></code> of the buffer per each request in which the request body may be saved before it is started to be processed.
ja: 処理が開始される前に要求本文を保存できる各要求ごとのバッファーの <code><i>size</i></code> を設定します。
ru: Устанавливает <code><i>size</i></code> буфера для каждого запроса, в котором тело запроса может быть сохранено до того, как он будет запущен для обработки.
zh_cn: 设置每个请求的缓冲区 <code><i>size</i></code> ，请求主体在开始处理之前可以保存在其中。

source: Sets the <code><i>size</i></code> of the buffer used for reading IMAP commands. By default, the buffer size is equal to one memory page. This is either 4K or 8K, depending on a platform.
ja: IMAPコマンドの読み取りに使用されるバッファーの <code><i>size</i></code> を設定します。デフォルトでは、バッファサイズは1メモリページに相当します。これは、プラットフォームに応じて4Kまたは8Kです。
ru: Устанавливает <code><i>size</i></code> буфера, используемого для чтения команд IMAP. По умолчанию размер буфера равен одной странице памяти. Это либо 4K, либо 8K, в зависимости от платформы.
zh_cn: 设置用于读取IMAP命令的缓冲区的 <code><i>size</i></code> 。默认情况下，缓冲区大小等于一个内存页。根据平台的不同，它可以是4K或8K。

source: Sets the <code><i>size</i></code> of the buffer used for reading SMTP commands. By default, the buffer size is equal to one memory page. This is either 4K or 8K, depending on a platform.
ja: SMTPコマンドの読み取りに使用されるバッファの <code><i>size</i></code> を設定します。デフォルトでは、バッファサイズは1メモリページに相当します。これは、プラットフォームに応じて4Kまたは8Kです。
ru: Устанавливает <code><i>size</i></code> буфера, используемого для чтения команд SMTP. По умолчанию размер буфера равен одной странице памяти. Это либо 4K, либо 8K, в зависимости от платформы.
zh_cn: 设置用于读取SMTP命令的缓冲区的 <code><i>size</i></code> 。默认情况下，缓冲区大小等于一个内存页。根据平台的不同，它可以是4K或8K。

source: Sets the <code><i>size</i></code> of the buffer used for reading data from the proxied server. Also sets the <code><i>size</i></code> of the buffer used for reading data from the client.
ja: プロキシされたサーバーからのデータの読み取りに使用されるバッファーの <code><i>size</i></code> を設定します。また、クライアントからのデータの読み取りに使用されるバッファーの <code><i>size</i></code> を設定します。
ru: Устанавливает <code><i>size</i></code> буфера, используемого для чтения данных с прокси-сервера. Также устанавливает <code><i>size</i></code> буфера, используемого для чтения данных от клиента.
zh_cn: 设置用于从代理服务器读取数据的缓冲区的 <code><i>size</i></code> 。还设置用于从客户端读取数据的缓冲区的 <code><i>size</i></code> 。

source: Sets the <code><i>size</i></code> of the buffer used for reading the <code>.f4x</code> index file.
ja: <code>.f4x</code> インデックスファイルの読み取りに使用されるバッファの <code><i>size</i></code> を設定します。
ru: Устанавливает <code><i>size</i></code> буфера, используемого для чтения индексного файла <code>.f4x</code> .
zh_cn: 设置用于读取 <code>.f4x</code> 索引文件的缓冲区的 <code><i>size</i></code> 。

source: Sets the <code><i>size</i></code> of the buffer used for reading the first part of the response received from the FastCGI server. This part usually contains a small response header. By default, the buffer size is equal to one memory page. This is either 4K or 8K, depending on a platform. It can be made smaller, however.
ja: FastCGIサーバーから受信した応答の最初の部分を読み取るために使用されるバッファーの <code><i>size</i></code> を設定します。通常、この部分には小さな応答ヘッダーが含まれています。デフォルトでは、バッファサイズは1メモリページに相当します。これは、プラットフォームに応じて4Kまたは8Kです。ただし、小さくすることはできます。
ru: Устанавливает <code><i>size</i></code> буфера, используемого для чтения первой части ответа, полученного от сервера FastCGI. Эта часть обычно содержит небольшой заголовок ответа. По умолчанию размер буфера равен одной странице памяти. Это либо 4K, либо 8K, в зависимости от платформы. Однако его можно сделать меньше.
zh_cn: 设置用于读取从FastCGI服务器接收到的响应的第一部分的缓冲区的 <code><i>size</i></code> 。这部分通常包含一个小的响应头。默认情况下，缓冲区大小等于一个内存页。根据平台的不同，它可以是4K或8K。但是，它可以做得更小。

source: Sets the <code><i>size</i></code> of the buffer used for reading the first part of the response received from the SCGI server. This part usually contains a small response header. By default, the buffer size is equal to one memory page. This is either 4K or 8K, depending on a platform. It can be made smaller, however.
ja: SCGIサーバーから受信した応答の最初の部分を読み取るために使用されるバッファーの <code><i>size</i></code> を設定します。通常、この部分には小さな応答ヘッダーが含まれています。デフォルトでは、バッファサイズは1メモリページに相当します。これは、プラットフォームに応じて4Kまたは8Kです。ただし、小さくすることはできます。
ru: Устанавливает <code><i>size</i></code> буфера, используемого для чтения первой части ответа, полученного от SCGI-сервера. Эта часть обычно содержит небольшой заголовок ответа. По умолчанию размер буфера равен одной странице памяти. Это либо 4K, либо 8K, в зависимости от платформы. Однако его можно сделать меньше.
zh_cn: 设置用于读取从SCGI服务器接收到的响应的第一部分的缓冲区的 <code><i>size</i></code> 。这部分通常包含一个小的响应头。默认情况下，缓冲区大小等于一个内存页。根据平台的不同，它可以是4K或8K。但是，它可以做得更小。

source: Sets the <code><i>size</i></code> of the buffer used for reading the first part of the response received from the proxied server. This part usually contains a small response header. By default, the buffer size is equal to one memory page. This is either 4K or 8K, depending on a platform. It can be made smaller, however.
ja: プロキシされたサーバーから受信した応答の最初の部分を読み取るために使用されるバッファーの <code><i>size</i></code> を設定します。通常、この部分には小さな応答ヘッダーが含まれています。デフォルトでは、バッファサイズは1メモリページに相当します。これは、プラットフォームに応じて4Kまたは8Kです。ただし、小さくすることはできます。
ru: Устанавливает <code><i>size</i></code> буфера, используемого для чтения первой части ответа, полученного от прокси-сервера. Эта часть обычно содержит небольшой заголовок ответа. По умолчанию размер буфера равен одной странице памяти. Это либо 4K, либо 8K, в зависимости от платформы. Однако его можно сделать меньше.
zh_cn: 设置用于读取从代理服务器接收到的响应的第一部分的缓冲区的 <code><i>size</i></code> 。这部分通常包含一个小的响应头。默认情况下，缓冲区大小等于一个内存页。根据平台的不同，它可以是4K或8K。但是，它可以做得更小。

source: Sets the <code><i>size</i></code> of the buffer used for reading the first part of the response received from the uwsgi server. This part usually contains a small response header. By default, the buffer size is equal to one memory page. This is either 4K or 8K, depending on a platform. It can be made smaller, however.
ja: uwsgiサーバーから受信した応答の最初の部分を読み取るために使用されるバッファーの <code><i>size</i></code> を設定します。通常、この部分には小さな応答ヘッダーが含まれています。デフォルトでは、バッファサイズは1メモリページに相当します。これは、プラットフォームに応じて4Kまたは8Kです。ただし、小さくすることはできます。
ru: Устанавливает <code><i>size</i></code> буфера, используемого для чтения первой части ответа, полученного от сервера uwsgi. Эта часть обычно содержит небольшой заголовок ответа. По умолчанию размер буфера равен одной странице памяти. Это либо 4K, либо 8K, в зависимости от платформы. Однако его можно сделать меньше.
zh_cn: 设置用于读取从uwsgi服务器接收的响应的第一部分的缓冲区的 <code><i>size</i></code> 。这部分通常包含一个小的响应头。默认情况下，缓冲区大小等于一个内存页。根据平台的不同，它可以是4K或8K。但是，它可以做得更小。

source: Sets the <code><i>size</i></code> of the buffer used for reading the response received from the gRPC server. The response is passed to the client synchronously, as soon as it is received.
ja: gRPCサーバーから受信した応答の読み取りに使用されるバッファーの <code><i>size</i></code> を設定します。応答は、受信されるとすぐに同期的にクライアントに渡されます。
ru: Устанавливает <code><i>size</i></code> буфера, используемого для чтения ответа, полученного от сервера gRPC. Ответ передается клиенту синхронно, как только он получен.
zh_cn: 设置用于读取从gRPC服务器接收到的响应的缓冲区的 <code><i>size</i></code> 。收到响应后，该响应就会立即同步传递给客户端。

source: Sets the <code><i>size</i></code> of the buffer used for reading the response received from the memcached server. The response is passed to the client synchronously, as soon as it is received.
ja: memcachedサーバーから受信した応答の読み取りに使用されるバッファーの <code><i>size</i></code> を設定します。応答は、受信されるとすぐに同期的にクライアントに渡されます。
ru: Устанавливает <code><i>size</i></code> буфера, используемого для чтения ответа, полученного от сервера memcached. Ответ передается клиенту синхронно, как только он получен.
zh_cn: 设置用于读取从内存缓存服务器接收到的响应的缓冲区的 <code><i>size</i></code> 。收到响应后，该响应就会立即同步传递给客户端。

source: Sets the <code><i>size</i></code> of the buffer used for storing the response body of a subrequest. By default, the buffer size is equal to one memory page. This is either 4K or 8K, depending on a platform. It can be made smaller, however.
ja: サブリクエストのレスポンスボディを保存するために使用されるバッファの <code><i>size</i></code> を設定し<i>ます</i>。デフォルトでは、バッファサイズは1メモリページに相当します。これは、プラットフォームに応じて4Kまたは8Kです。ただし、小さくすることはできます。
ru: Устанавливает <code><i>size</i></code> буфера, используемого для хранения тела ответа подзапроса. По умолчанию размер буфера равен одной странице памяти. Это либо 4K, либо 8K, в зависимости от платформы. Однако его можно сделать меньше.
zh_cn: 设置用于存储子请求的响应主体的缓冲区的 <code><i>size</i></code> 。默认情况下，缓冲区大小等于一个内存页。根据平台的不同，它可以是4K或8K。但是，它可以做得更小。

source: Sets the <code><i>size</i></code> of the slice. The zero value disables splitting responses into slices. Note that a too low value may result in excessive memory usage and opening a large number of files.
ja: スライスの <code><i>size</i></code> を設定します。ゼロの値は、応答をスライスに分割することを無効にします。値が小さすぎると、メモリが過剰に使用され、多数のファイルが開かれる可能性があることに注意してください。
ru: Устанавливает <code><i>size</i></code> среза. Нулевое значение отключает разделение ответов на фрагменты. Обратите внимание, что слишком низкое значение может привести к чрезмерному использованию памяти и открытию большого количества файлов.
zh_cn: 设置切片的 <code><i>size</i></code> 。零值禁用将响应拆分为片。请注意，太低的值可能会导致过多的内存使用并打开大量文件。

source: Sets the <code><i>time</i></code> for which a browser should keep the cookie. The special value <code>max</code> will cause the cookie to expire on &ldquo;<code>31 Dec 2037 23:55:55 GMT</code>&rdquo;. If the parameter is not specified, it will cause the cookie to expire at the end of a browser session.
ja: ブラウザがCookieを保持する <code><i>time</i></code> を設定します。特別な値 <code>max</code> により、Cookieは「 <code>31 Dec 2037 23:55:55 GMT</code> 」に期限切れになります。パラメータが指定されていない場合、ブラウザセッションの終了時にCookieが期限切れになります。
ru: Устанавливает <code><i>time</i></code> течение которого браузер должен хранить файл cookie. Специальное значение <code>max</code> приведет к тому, что срок действия cookie истечет &laquo; <code>31 Dec 2037 23:55:55 GMT</code> &raquo;. Если параметр не указан, это приведет к тому, что срок действия cookie истечет в конце сеанса браузера.
zh_cn: 设置 <code><i>time</i></code> 为其浏览器应该保持的cookie。特殊值 <code>max</code> 将导致Cookie在&ldquo; <code>31 Dec 2037 23:55:55 GMT</code> &rdquo; 过期。如果未指定该参数，它将导致cookie在浏览器会话结束时过期。

source: Sets the <code><i>timeout</i></code> between two successive read or write operations on client or proxied server connections. If no data is transmitted within this time, the connection is closed.
ja: クライアント接続またはプロキシサーバー接続での2つの連続する読み取りまたは書き込み操作間の <code><i>timeout</i></code> 設定します。この時間内にデータが送信されない場合、接続は閉じられます。
ru: Устанавливает <code><i>timeout</i></code> между двумя последовательными операциями чтения или записи в соединениях клиента или прокси-сервера. Если в течение этого времени данные не передаются, соединение закрывается.
zh_cn: 设置客户端或代理服务器连接上两次连续的读取或写入操作之间的 <code><i>timeout</i></code> 。如果在此时间内没有数据传输，则连接将关闭。

source: Sets the <code><i>timeout</i></code> between two successive read or write operations on connection to another cluster node. If no data is transmitted within this time, the connection is closed.
ja: 別のクラスターノードへの接続での2つの連続した読み取りまたは書き込み操作間の <code><i>timeout</i></code> 設定します。この時間内にデータが送信されない場合、接続は閉じられます。
ru: Устанавливает <code><i>timeout</i></code> между двумя последовательными операциями чтения или записи при подключении к другому узлу кластера. Если в течение этого времени данные не передаются, соединение закрывается.
zh_cn: 设置与另一个群集节点的连接在两次连续读取或写入操作之间的 <code><i>timeout</i></code> 。如果在此时间内没有数据传输，则连接将关闭。

source: Sets the <code><i>variable</i></code> to a JOSE header parameter identified by key names. Name matching starts from the top level of the JSON tree. For arrays, the variable keeps a list of array elements separated by commas.
ja: <code><i>variable</i></code> をキー名で識別されるJOSEヘッダーパラメータに設定し<i>ます</i>。名前のマッチングは、JSONツリーの最上位から始まります。配列の場合、変数はコンマで区切られた配列要素のリストを保持します。
ru: Устанавливает <code><i>variable</i></code> в параметр заголовка JOSE, идентифицируемый именами ключей. Сопоставление имен начинается с верхнего уровня дерева JSON. Для массивов переменная хранит список элементов массива, разделенных запятыми.
zh_cn: 将 <code><i>variable</i></code> 设置为由键名标识的JOSE标头参数。名称匹配从JSON树的顶层开始。对于数组，该变量保留以逗号分隔的数组元素列表。

source: Sets the <code><i>variable</i></code> to a JWT claim parameter identified by key names. Name matching starts from the top level of the JSON tree. For arrays, the variable keeps a list of array elements separated by commas.
ja: <code><i>variable</i></code> をキー名で識別されるJWTクレームパラメーターに設定し<i>ます</i>。名前のマッチングは、JSONツリーの最上位から始まります。配列の場合、変数はコンマで区切られた配列要素のリストを保持します。
ru: Устанавливает для <code><i>variable</i></code> параметр утверждения JWT, определяемый именами ключей. Сопоставление имен начинается с верхнего уровня дерева JSON. Для массивов переменная хранит список элементов массива, разделенных запятыми.
zh_cn: 将 <code><i>variable</i></code> 设置为由键名标识的JWT声明参数。名称匹配从JSON树的顶层开始。对于数组，该变量保留以逗号分隔的数组元素列表。

source: Sets the HTTP protocol version for proxying. By default, version 1.0 is used. Version 1.1 is recommended for use with <a href="ngx_http_upstream_module#keepalive">keepalive</a> connections and <a href="ngx_http_upstream_module#ntlm">NTLM authentication</a>.
ja: プロキシのHTTPプロトコルバージョンを設定します。デフォルトでは、バージョン1.0が使用されます。<a href="ngx_http_upstream_module#keepalive">キープアライブ</a>接続および<a href="ngx_http_upstream_module#ntlm">NTLM認証</a>での使用には、バージョン1.1をお勧めします。
ru: Устанавливает версию протокола HTTP для проксирования. По умолчанию используется версия 1.0. Версия 1.1 рекомендуется для использования с соединениями <a href="ngx_http_upstream_module#keepalive">keepalive</a> и <a href="ngx_http_upstream_module#ntlm">аутентификацией NTLM</a> .
zh_cn: 设置用于代理的HTTP协议版本。默认情况下，使用1.0版。建议将1.1版与<a href="ngx_http_upstream_module#keepalive">keepalive</a>连接和<a href="ngx_http_upstream_module#ntlm">NTLM身份验证配合使用</a>。

source: Sets the SMTP protocol extensions list that is passed to the client in response to the <code>EHLO</code> command. The authentication methods specified in the <a href="#smtp_auth">smtp_auth</a> directive and <a href="https://tools.ietf.org/html/rfc3207">STARTTLS</a> are automatically added to this list depending on the <a href="ngx_mail_ssl_module#starttls">starttls</a> directive value.
ja: <code>EHLO</code> コマンドに応答してクライアントに渡されるSMTPプロトコル拡張リストを設定します。<a href="#smtp_auth">smtp_auth</a>ディレクティブと<a href="https://tools.ietf.org/html/rfc3207">STARTTLSで</a>指定された認証方法は、<a href="ngx_mail_ssl_module#starttls">starttls</a>ディレクティブの値に応じて、このリストに自動的に追加されます。
ru: Устанавливает список расширений протокола SMTP, который передается клиенту в ответ на команду <code>EHLO</code> . Методы аутентификации, указанные в директиве <a href="#smtp_auth">smtp_auth</a> и <a href="https://tools.ietf.org/html/rfc3207">STARTTLS</a> , автоматически добавляются в этот список в зависимости от <a href="ngx_mail_ssl_module#starttls">значения</a> директивы starttls .
zh_cn: 设置响应 <code>EHLO</code> 命令传递到客户端的SMTP协议扩展列表。<a href="#smtp_auth">smtp_auth</a>指令和<a href="https://tools.ietf.org/html/rfc3207">STARTTLS</a>中指定的身份验证方法将根据<a href="ngx_mail_ssl_module#starttls">starttls</a>指令值自动添加到此列表中。

source: Sets the URI to which an original request will be mirrored. Several mirrors can be specified on the same configuration level.
ja: 元のリクエストがミラーリングされる URI を設定します。同じ構成レベルで複数のミラーを指定することができます。
zh_cn: 设置将原始请求镜像到的URI。可以在同一配置层指定多个镜像。

source: Sets the URI to which an original request will be mirrored. Several mirrors can be specified on the same level.
ja: オリジナルのリクエストがミラーリングされる URI を設定します。同じレベルで複数のミラーを指定することができます。
ru: Устанавливает URI,в который будет зеркалироваться оригинальный запрос.Несколько зеркал могут быть заданы на одном уровне.
zh_cn: 设置将原始请求镜像到的URI。可以在同一层次上指定多个镜像。
