Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/nginx/nginx.*.004.xlf
Languages: es, ja, ko, ru, zh_cn

source: Sets a <code><i>parameter</i></code> that should be passed to the uwsgi server. The <code><i>value</i></code> can contain text, variables, and their combination. These directives are inherited from the previous configuration level if and only if there are no <code>uwsgi_param</code> directives defined on the current level.
ja: uwsgiサーバーに渡す必要のある <code><i>parameter</i></code> を設定します。 <code><i>value</i></code> 、テキスト、変数、およびその組み合わせを含むことができます。これらのディレクティブは、現在のレベルで <code>uwsgi_param</code> ディレクティブが定義されていない場合にのみ、前の構成レベルから継承されます。
zh_cn: 设置一个 <code><i>parameter</i></code> 应传递给uwsgi服务器。该 <code><i>value</i></code> 可以包含文本，变量及其组合。当且仅当当前级别上没有定义 <code>uwsgi_param</code> 指令时，这些指令才从先前的配置级别继承。

source: Sets a <code><i>parameter</i></code> that should be passed to the uwsgi server. The <code><i>value</i></code> can contain text, variables, and their combination. These directives are inherited from the previous level if and only if there are no <code>uwsgi_param</code> directives defined on the current level.
ja: uwsgiサーバーに渡す <code><i>parameter</i></code> を設定します。 <code><i>value</i></code> 、テキスト、変数、およびその組み合わせを含むことができます。これらのディレクティブは、現在のレベルで <code>uwsgi_param</code> ディレクティブが定義されていない場合にのみ、前のレベルから継承されます。
ru: Устанавливает <code><i>parameter</i></code> который должен быть передан серверу uwsgi. <code><i>value</i></code> может содержать текст, переменные и их комбинации. Эти директивы наследуются от предыдущего уровня тогда и только тогда, <code>uwsgi_param</code> на текущем уровне не определены директивы uwsgi_param .
zh_cn: 设置一个 <code><i>parameter</i></code> 应传递给uwsgi服务器。该 <code><i>value</i></code> 可以包含文本，变量及其组合。当且仅当当前级别上没有定义 <code>uwsgi_param</code> 指令时，这些指令才从上一级继承。

source: Sets a <code><i>value</i></code> for the specified <code><i>variable</i></code>. The <code><i>value</i></code> can contain text, variables, and their combination.
ja: 指定された <code><i>variable</i></code> <code><i>value</i></code> を設定し<i>ます</i>。 <code><i>value</i></code> 、テキスト、変数、およびその組み合わせを含むことができます。
ru: Устанавливает <code><i>value</i></code> для указанной <code><i>variable</i></code> . <code><i>value</i></code> может содержать текст, переменные и их комбинации.
zh_cn: 为指定的 <code><i>variable</i></code> 设置一个 <code><i>value</i></code> 。该 <code><i>value</i></code> 可以包含文本，变量及其组合。<i></i><i></i>

source: Sets a Perl handler for the given location.
ja: 指定された場所のPerlハンドラを設定します。
ru: Устанавливает обработчик Perl для данного местоположения.
zh_cn: 为指定的位置设置一个Perl处理程序。

source: Sets a data filter.
ja: データフィルタを設定します。
ru: Устанавливает фильтр данных.
zh_cn: 设置数据过滤器。

source: Sets a data filter. Since <a href="../njs/changes#njs0.4.0">0.4.0</a>, a module function can be referenced.
ja: データフィルターを設定します。<a href="../njs/changes#njs0.4.0">0.4.0</a>以降、モジュール関数を参照できます。
zh_cn: 设置数据过滤器。从<a href="../njs/changes#njs0.4.0">0.4.0开始</a>，可以引用模块功能。

source: Sets a file name that keeps profiling information of nginx worker process. The ID of the worker process is always a part of the file name and is appended to the end of the file name, after a dot.
ja: nginxワーカープロセスのプロファイリング情報を保持するファイル名を設定します。ワーカープロセスのIDは常にファイル名の一部であり、ファイル名の末尾にドットの後に付加されます。
ru: Устанавливает имя файла,который хранит информацию о профилировании рабочего процесса nginx.Идентификатор рабочего процесса всегда является частью имени файла и добавляется в конец имени файла,после точки.
zh_cn: 设置一个保存nginx工作进程信息的文件名。工作进程的ID始终是文件名的一部分,并附加在文件名的末尾,用点号表示。

source: Sets a file name that will be appended after a URI that ends with a slash, in the value of the <code>$fastcgi_script_name</code> variable. For example, with these settings
ja: <code>$fastcgi_script_name</code> 変数の値で、スラッシュで終わるURIの後に追加されるファイル名を設定します。たとえば、これらの設定で
ru: Устанавливает имя файла, которое будет добавлено после URI, заканчивающегося косой чертой, в значении переменной <code>$fastcgi_script_name</code> . Например, с этими настройками
zh_cn: 设置文件名，该文件名将以 <code>$fastcgi_script_name</code> 变量的值附加在以斜杠结尾的URI之后。例如，使用这些设置

source: Sets a gzip compression <code><i>level</i></code> of a response. Acceptable values are in the range from 1 to 9.
ja: 応答のgzip圧縮 <code><i>level</i></code> を設定します。許容値は1から9の範囲です。
ru: Устанавливает <code><i>level</i></code> сжатия ответа gzip . Допустимые значения находятся в диапазоне от 1 до 9.
zh_cn: 设置响应的gzip压缩 <code><i>level</i></code> 。可接受的值范围是1到9。

source: Sets a pause between iterations (1.7.12). By default, <code>purger_sleep</code> is set to 50 milliseconds.
ja: 反復間の一時停止を設定します（1.7.12）。デフォルトでは、 <code>purger_sleep</code> は50ミリ秒に設定されています。
ru: Устанавливает паузу между итерациями (1.7.12). По умолчанию для <code>purger_sleep</code> установлено значение 50 миллисекунд.
zh_cn: 设置迭代之间的暂停（1.7.12）。默认情况下， <code>purger_sleep</code> 设置为50毫秒。

source: Sets a string to replace and a replacement string. The string to replace is matched ignoring the case. The string to replace (1.9.4) and replacement string can contain variables. Several <code>sub_filter</code> directives can be specified on one configuration level (1.9.4). These directives are inherited from the previous level if and only if there are no <code>sub_filter</code> directives defined on the current level.
ja: 置換する文字列と置換文字列を設定します。置換する文字列は、大文字と小文字を区別せずに一致します。置換する文字列（1.9.4）と置換文字列には変数を含めることができます。1つの構成レベル（1.9.4）で複数の <code>sub_filter</code> ディレクティブを指定できます。これらのディレクティブは、現在のレベルで <code>sub_filter</code> ディレクティブが定義されていない場合にのみ、前のレベルから継承されます。
ru: Устанавливает заменяемую строку и заменяемую строку. Заменяемая строка сопоставляется без учета регистра. Строка для замены (1.9.4) и строка замены могут содержать переменные. На одном уровне конфигурации (1.9.4) можно указать несколько директив <code>sub_filter</code> . Эти директивы наследуются от предыдущего уровня тогда и только тогда, <code>sub_filter</code> на текущем уровне не определены директивы sub_filter .
zh_cn: 设置要替换的字符串和替换字符串。忽略大小写匹配要替换的字符串。要替换的字符串（1.9.4）和替换字符串可以包含变量。可以在一个配置级别（1.9.4）上指定几个 <code>sub_filter</code> 伪指令。当且仅当当前级别上未定义 <code>sub_filter</code> 指令时，这些指令才从上一级继承。

source: Sets a string to replace and a replacement string. The string to replace is matched ignoring the case. The string to replace (1.9.4) and replacement string can contain variables. Several <code>sub_filter</code> directives can be specified on the same configuration level (1.9.4). These directives are inherited from the previous configuration level if and only if there are no <code>sub_filter</code> directives defined on the current level.
ja: 置換する文字列と置換文字列を設定します。置換する文字列は、大文字と小文字を区別せずに照合されます。置換する文字列（1.9.4）および置換文字列には変数を含めることができます。同じ構成レベル（1.9.4）で複数の <code>sub_filter</code> ディレクティブを指定できます。これらのディレクティブは、現在のレベルで <code>sub_filter</code> ディレクティブが定義されていない場合にのみ、前の構成レベルから継承されます。
zh_cn: 设置要替换的字符串和替换字符串。忽略大小写匹配要替换的字符串。要替换的字符串（1.9.4）和替换字符串可以包含变量。可以在同一配置级别（1.9.4）上指定几个 <code>sub_filter</code> 伪指令。当且仅当当前级别上未定义 <code>sub_filter</code> 指令时，这些指令才从先前的配置级别继承。

source: Sets a string to search for in the error stream of a response received from a FastCGI server. If the <code><i>string</i></code> is found then it is considered that the FastCGI server has returned an <a href="#fastcgi_next_upstream">invalid response</a>. This allows handling application errors in nginx, for example:
ja: FastCGIサーバーから受信した応答のエラーストリームで検索する文字列を設定します。 <code><i>string</i></code> が見つかった場合、FastCGIサーバーが<a href="#fastcgi_next_upstream">無効な応答</a>を返したと見なされます。これにより、nginxでアプリケーションエラーを処理できます。次に例を示します。
ru: Устанавливает строку для поиска в потоке ошибок ответа, полученного от сервера FastCGI. Если <code><i>string</i></code> найдена, считается, что сервер FastCGI вернул <a href="#fastcgi_next_upstream">неверный ответ</a> . Это позволяет обрабатывать ошибки приложения в nginx, например:
zh_cn: 设置一个字符串，以在从FastCGI服务器接收到的响应的错误流中进行搜索。如果找到该 <code><i>string</i></code> ，则认为FastCGI服务器已返回<a href="#fastcgi_next_upstream">无效响应</a>。这样可以处理nginx中的应用程序错误，例如：

source: Sets a text that should be changed in the <code>domain</code> attribute of the &ldquo;Set-Cookie&rdquo; header fields of a proxied server response. Suppose a proxied server returned the &ldquo;Set-Cookie&rdquo; header field with the attribute &ldquo;<code>domain=localhost</code>&rdquo;. The directive
ja: プロキシされるサーバー応答の「Set-Cookie」ヘッダーフィールドの <code>domain</code> 属性で変更する必要があるテキストを設定します。プロキシされたサーバーが属性「 <code>domain=localhost</code> 」を含む「Set-Cookie」ヘッダーフィールドを返したとします。ディレクティブ
ru: Задает текст, который должен быть изменен в атрибуте <code>domain</code> в полях заголовка &laquo;Set-Cookie&raquo; ответа проксируемого сервера. Предположим, прокси-сервер вернул поле заголовка &laquo;Set-Cookie&raquo; с атрибутом &laquo; <code>domain=localhost</code> &raquo;. Директива
zh_cn: 设置应在代理服务器响应的&ldquo; Set-Cookie&rdquo;标头字段的 <code>domain</code> 属性中更改的文本。假设代理服务器返回属性为&ldquo; <code>domain=localhost</code> &rdquo; 的&ldquo; Set-Cookie&rdquo;头字段。指令

source: Sets a text that should be changed in the <code>path</code> attribute of the &ldquo;Set-Cookie&rdquo; header fields of a proxied server response. Suppose a proxied server returned the &ldquo;Set-Cookie&rdquo; header field with the attribute &ldquo;<code>path=/two/some/uri/</code>&rdquo;. The directive
ja: プロキシされるサーバー応答の「Set-Cookie」ヘッダーフィールドの <code>path</code> 属性で変更する必要があるテキストを設定します。プロキシされたサーバーが属性「 <code>path=/two/some/uri/</code> 」を含む「Set-Cookie」ヘッダーフィールドを返したとします。ディレクティブ
ru: Устанавливает текст, который должен быть изменен в атрибуте <code>path</code> в полях заголовка &laquo;Set-Cookie&raquo; ответа проксируемого сервера. Предположим, прокси-сервер вернул поле заголовка &laquo;Set-Cookie&raquo; с атрибутом &laquo; <code>path=/two/some/uri/</code> &raquo;. Директива
zh_cn: 设置应在代理服务器响应的&ldquo; Set-Cookie&rdquo;标头字段的 <code>path</code> 属性中更改的文本。假设代理服务器返回&ldquo; Set-Cookie&rdquo;头字段，其属性为&ldquo; <code>path=/two/some/uri/</code> &rdquo;。指令

source: Sets a time after which <a href="#open_file_cache">open_file_cache</a> elements should be validated.
ja: <a href="#open_file_cache">open_file_cache</a>要素が検証されるまでの時間を設定します。
ru: Устанавливает время, по истечении которого элементы <a href="#open_file_cache">open_file_cache</a> должны быть проверены.
zh_cn: 设置一个时间，在此时间之后，将验证<a href="#open_file_cache">open_file_cache</a>元素。

source: Sets a time during which a browser should keep the cookie. The parameter <code>max</code> will cause the cookie to expire on &ldquo;<code>31 Dec 2037 23:55:55 GMT</code>&rdquo;. The parameter <code>off</code> will cause the cookie to expire at the end of a browser session.
ja: ブラウザがCookieを保持する時間を設定します。パラメータ <code>max</code> により、Cookieは「 <code>31 Dec 2037 23:55:55 GMT</code> 」に期限切れになります。パラメータを <code>off</code> すると、ブラウザセッションの終了時にCookieが期限切れになります。
ru: Устанавливает время, в течение которого браузер должен хранить файл cookie. Параметр <code>max</code> приведет к тому, что срок действия cookie истечет &laquo; <code>31 Dec 2037 23:55:55 GMT</code> &raquo;. Параметр <code>off</code> приведет к тому, что cookie истечет в конце сеанса браузера.
zh_cn: 设置浏览器保留cookie的时间。参数 <code>max</code> 将导致Cookie在&ldquo; <code>31 Dec 2037 23:55:55 GMT</code> &rdquo; 过期。参数 <code>off</code> 将导致cookie在浏览器会话结束时过期。

source: Sets a timeout during which an idle keepalive connection to an upstream server will stay open.
ja: 上流サーバーへのアイドル状態のキープアライブ接続が開いたままになるタイムアウトを設定します。
ru: Устанавливает тайм-аут,во время которого простаивающее постоянное соединение с сервером upstream будет оставаться открытым.
zh_cn: 设置与上游服务器的空闲keepalive连接保持开放的超时时间。

source: Sets a timeout for <a href="#fastcgi_cache_lock">fastcgi_cache_lock</a>. When the <code><i>time</i></code> expires, the request will be passed to the FastCGI server, however, the response will not be cached.
ja: <a href="#fastcgi_cache_lock">fastcgi_cache_lockの</a>タイムアウトを設定します。ときに <code><i>time</i></code> 満了し、要求がFastCGIのサーバに渡されます、しかし、応答がキャッシュされません。
ru: Устанавливает тайм-аут для <a href="#fastcgi_cache_lock">fastcgi_cache_lock</a> . Когда <code><i>time</i></code> истекает, то запрос будет передан на сервер FastCGI, однако, ответ не будет кэшировать.
zh_cn: 为<a href="#fastcgi_cache_lock">fastcgi_cache_lock</a>设置超时。当 <code><i>time</i></code> 到期时，请求将被传递到FastCGI服务器，但是，响应不会被缓存。

source: Sets a timeout for <a href="#proxy_cache_lock">proxy_cache_lock</a>. When the <code><i>time</i></code> expires, the request will be passed to the proxied server, however, the response will not be cached.
ja: <a href="#proxy_cache_lock">proxy_cache_lockの</a>タイムアウトを設定します。ときに <code><i>time</i></code> 満了し、要求がプロキシ・サーバーに渡されます、しかし、応答がキャッシュされません。
ru: Устанавливает тайм-аут для <a href="#proxy_cache_lock">proxy_cache_lock</a> . Когда <code><i>time</i></code> истекает, то запрос будет передан проксированным серверу, однако, ответ не будет кэшировать.
zh_cn: 设置<a href="#proxy_cache_lock">proxy_cache_lock</a>的超时时间。当 <code><i>time</i></code> 到期时，请求将被传递给代理的服务器，但是，响应不会被缓存。

source: Sets a timeout for <a href="#scgi_cache_lock">scgi_cache_lock</a>. When the <code><i>time</i></code> expires, the request will be passed to the SCGI server, however, the response will not be cached.
ja: <a href="#scgi_cache_lock">scgi_cache_lockの</a>タイムアウトを設定します。ときに <code><i>time</i></code> 満了し、要求がSCGIサーバに渡されます、しかし、応答がキャッシュされません。
ru: Устанавливает тайм-аут для <a href="#scgi_cache_lock">scgi_cache_lock</a> . Когда <code><i>time</i></code> истекает, то запрос будет передан на сервер SCGI, однако, ответ не будет кэшировать.
zh_cn: 为<a href="#scgi_cache_lock">scgi_cache_lock</a>设置超时。当 <code><i>time</i></code> 到期时，请求将被传递到SCGI服务器，但是，响应不会被缓存。

source: Sets a timeout for <a href="#uwsgi_cache_lock">uwsgi_cache_lock</a>. When the <code><i>time</i></code> expires, the request will be passed to the uwsgi server, however, the response will not be cached.
ja: <a href="#uwsgi_cache_lock">uwsgi_cache_lockの</a>タイムアウトを設定します。ときに <code><i>time</i></code> 満了し、要求がuwsgiサーバーに渡されます、しかし、応答がキャッシュされません。
ru: Устанавливает тайм-аут для <a href="#uwsgi_cache_lock">uwsgi_cache_lock</a> . Когда <code><i>time</i></code> истекает, то запрос будет передан на сервер uwsgi, однако, ответ не будет кэшировать.
zh_cn: 为<a href="#uwsgi_cache_lock">uwsgi_cache_lock</a>设置超时。当 <code><i>time</i></code> 到期时，请求将被传递给uwsgi服务器，但是，响应不会被缓存。

source: Sets a timeout for DNS operations, for example:
ja: DNS操作のタイムアウトを設定します。
ru: Устанавливает таймаут,например,для операций с DNS:
zh_cn: 例如,设置DNS操作的超时。

source: Sets a timeout for name resolution, for example:
ja: 名前解決のタイムアウトを設定します。
ru: Устанавливает таймаут,например,для разрешения имен:
zh_cn: 例如,设置名称解析的超时。

source: Sets a timeout for transmitting a request to the FastCGI server. The timeout is set only between two successive write operations, not for the transmission of the whole request. If the FastCGI server does not receive anything within this time, the connection is closed.
ja: FastCGI サーバーに要求を送信するためのタイムアウトを設定します。タイムアウトは、2 つの連続した書き込み操作の間にのみ設定され、要求全体の送信には設定されません。FastCGI サーバーがこの時間内に何も受信しない場合、接続は閉じられます。
ru: Устанавливает таймаут для передачи запроса на FastCGI сервер.Устанавливает таймаут только между двумя последовательными операциями записи,а не для передачи всего запроса.Если FastCGI-сервер за это время ничего не получит,соединение закрывается.
zh_cn: 设置向FastCGI服务器发送请求的超时。超时仅在两个连续的写操作之间设置,而不是针对整个请求的传输。如果FastCGI服务器在这段时间内没有收到任何信息,则连接关闭。

source: Sets a timeout for transmitting a request to the SCGI server. The timeout is set only between two successive write operations, not for the transmission of the whole request. If the SCGI server does not receive anything within this time, the connection is closed.
ja: リクエストを SCGI サーバに送信する際のタイムアウトを設定します。タイムアウトは 2 回の連続した書き込み操作の間にのみ設定され、リクエスト全体の送信には設定されません。この時間内に SCGI サーバが何も受信しなかった場合、接続は閉じられます。
ru: Устанавливает таймаут для передачи запроса на сервер SCGI.Устанавливает таймаут только между двумя последовательными операциями записи,а не для передачи всего запроса.Если в течение этого времени SCGI сервер ничего не получает,соединение закрывается.
zh_cn: 设置向SCGI服务器传输请求的超时。超时只在两个连续的写操作之间设置,而不是针对整个请求的传输。如果SCGI服务器在这段时间内没有收到任何东西,则连接被关闭。

source: Sets a timeout for transmitting a request to the gRPC server. The timeout is set only between two successive write operations, not for the transmission of the whole request. If the gRPC server does not receive anything within this time, the connection is closed.
ja: リクエストを gRPC サーバに送信するためのタイムアウトを設定します。タイムアウトは2つの連続した書き込み操作の間にのみ設定され、リクエスト全体の送信には設定されません。gRPCサーバがこの時間内に何も受信しなかった場合、接続は閉じられます。
ru: Устанавливает таймаут для передачи запроса на сервер gRPC.Устанавливает таймаут только между двумя последовательными операциями записи,а не для передачи всего запроса.Если в течение этого времени gRPC-сервер ничего не получит,соединение закрывается.
zh_cn: 设置向gRPC服务器发送请求的超时。超时只在两个连续的写操作之间设置,而不是针对整个请求的传输。如果gRPC服务器在这段时间内没有收到任何内容,则关闭连接。

source: Sets a timeout for transmitting a request to the memcached server. The timeout is set only between two successive write operations, not for the transmission of the whole request. If the memcached server does not receive anything within this time, the connection is closed.
ja: memcached サーバにリクエストを送信するためのタイムアウトを設定します。タイムアウトは 2 回の連続した書き込み操作の間にのみ設定され、リクエスト全体の送信には設定されません。この時間内に memcached サーバが何も受信しない場合、接続は閉じられます。
ru: Устанавливает таймаут для передачи запроса на memcached-сервер.Устанавливает таймаут только между двумя последовательными операциями записи,а не для передачи всего запроса.Если за это время memcached-сервер ничего не получит,соединение закрывается.
zh_cn: 设置向memcached服务器传输请求的超时。超时只在两个连续的写操作之间设置,而不是针对整个请求的传输。如果在这个时间内,memcached服务器没有收到任何东西,连接就会被关闭。

source: Sets a timeout for transmitting a request to the proxied server. The timeout is set only between two successive write operations, not for the transmission of the whole request. If the proxied server does not receive anything within this time, the connection is closed.
ja: プロキシされたサーバにリクエストを送信するためのタイムアウトを設定します。タイムアウトは 2 つの連続した書き込み操作の間にのみ設定され、リクエスト全体の送信には設定されません。プロキシされたサーバがこの時間内に何も受信しなかった場合、接続は閉じられます。
ru: Устанавливает таймаут для передачи запроса на прокси-сервер.Таймаут устанавливается только между двумя последовательными операциями записи,а не для передачи всего запроса.Если в течение этого времени проксированный сервер ничего не получает,соединение закрывается.
zh_cn: 设置向代理服务器传输请求的超时。超时只在两个连续的写操作之间设置,而不是针对整个请求的传输。如果代理服务器在这段时间内没有收到任何东西,则关闭连接。

source: Sets a timeout for transmitting a request to the uwsgi server. The timeout is set only between two successive write operations, not for the transmission of the whole request. If the uwsgi server does not receive anything within this time, the connection is closed.
ja: リクエストを uwsgi サーバに送信するためのタイムアウトを設定します。タイムアウトは2つの連続した書き込み操作の間にのみ設定され、リクエスト全体の送信には設定されません。この時間内に何も受信しなかった場合、接続は閉じられます。
ru: Устанавливает таймаут для передачи запроса на сервер uwsgi.Устанавливает таймаут только между двумя последовательными операциями записи,а не для передачи всего запроса.Если за это время сервер uwsgi ничего не получит,соединение закрывается.
zh_cn: 设置向uwsgi服务器发送请求的超时。超时只在两个连续的写操作之间设置,而不是针对整个请求的传输。如果uwsgi服务器在这个时间内没有收到任何东西,连接就会被关闭。

source: Sets a timeout for transmitting a response to the client. The timeout is set only between two successive write operations, not for the transmission of the whole response. If the client does not receive anything within this time, the connection is closed.
ja: 応答をクライアントに送信するためのタイムアウトを設定します。タイムアウトは、2 つの連続した書き込み操作の間にのみ設定され、応答全体の送信には設定されません。クライアントがこの時間内に何も受信しない場合、接続は閉じられます。
ru: Устанавливает таймаут для передачи ответа клиенту.Таймаут устанавливается только между двумя последовательными операциями записи,а не для передачи всего ответа.Если в течение этого времени клиент ничего не получает,соединение закрывается.
zh_cn: 设置向客户端传输响应的超时。超时只在两个连续的写操作之间设置,而不是针对整个响应的传输。如果客户端在这段时间内没有收到任何东西,则关闭连接。

source: Sets a value for the &ldquo;P3P&rdquo; header field that will be sent along with the cookie. If the directive is set to the special value <code>none</code>, the &ldquo;P3P&rdquo; header will not be sent in a response.
ja: Cookieとともに送信される「P3P」ヘッダーフィールドの値を設定します。ディレクティブが特別な値 <code>none</code> に設定されている場合、「P3P」ヘッダーは応答で送信されません。
ru: Устанавливает значение для поля заголовка &laquo;P3P&raquo;, которое будет отправлено вместе с файлом cookie. Если для директивы установлено специальное значение <code>none</code> , заголовок &laquo;P3P&raquo; не будет отправлен в ответ.
zh_cn: 为&ldquo; P3P&rdquo;标头字段设置一个值，该值将与Cookie一起发送。如果指令设置为特殊值 <code>none</code> ，则不会在响应中发送&ldquo; P3P&rdquo;标头。

source: Sets a value for the <code>$ancient_browser</code> variables.
ja: <code>$ancient_browser</code> 変数の値を設定します。
ru: Устанавливает значение для переменных <code>$ancient_browser</code> .
zh_cn: 为 <code>$ancient_browser</code> 变量设置一个值。

source: Sets a value for the <code>$modern_browser</code> variables.
ja: <code>$modern_browser</code> 変数の値を設定します。
ru: Устанавливает значение для переменных <code>$modern_browser</code> .
zh_cn: 为 <code>$modern_browser</code> 变量设置一个值。

source: Sets a value of a variable. The command has the following parameters:
ja: 変数の値を設定します。コマンドには以下のパラメータがあります。
ru: Устанавливает значение переменной.Команда имеет следующие параметры:
zh_cn: 设置变量的值。该命令的参数如下。

source: Sets access permissions for newly created files and directories, e.g.:
ja: 新しく作成されたファイルやディレクトリのアクセス権限を設定します。
ru: Устанавливает права доступа для вновь создаваемых файлов и каталогов,например:
zh_cn: 设置新创建的文件和目录的访问权限,例如:。

source: Sets an additional path for Perl modules.
ja: Perl モジュールの追加パスを設定します。
ru: Устанавливает дополнительный путь для модулей Perl.
zh_cn: 设置Perl模块的附加路径。

source: Sets an additional path for njs modules.
ja: njsモジュールの追加パスを設定します。
ru: Устанавливает дополнительный путь для njs модулей.
zh_cn: 设置njs模块的附加路径。

source: Sets an njs function as a location content handler.
ja: njs関数をロケーションコンテンツハンドラとして設定します。
ru: Устанавливает функцию njs как обработчик контента местоположения.
zh_cn: 设置一个njs函数作为位置内容处理程序。

source: Sets an njs function as a location content handler. Since <a href="../njs/changes#njs0.4.0">0.4.0</a>, a module function can be referenced.
ja: njs関数をロケーションコンテンツハンドラーとして設定します。<a href="../njs/changes#njs0.4.0">0.4.0</a>以降、モジュール関数を参照できます。
zh_cn: 将njs函数设置为位置内容处理程序。从<a href="../njs/changes#njs0.4.0">0.4.0开始</a>，可以引用模块功能。

source: Sets an njs function for the specified variable.
ja: 指定された変数にnjs関数を設定します。
ru: Устанавливает функцию njs для указанной переменной.
zh_cn: 设置指定变量的njs函数。

source: Sets an njs function for the specified variable. Since <a href="../njs/changes#njs0.4.0">0.4.0</a>, a module function can be referenced.
ja: 指定された変数にnjs関数を設定します。<a href="../njs/changes#njs0.4.0">0.4.0</a>以降、モジュール関数を参照できます。
zh_cn: 为指定的变量设置一个njs函数。从<a href="../njs/changes#njs0.4.0">0.4.0开始</a>，可以引用模块功能。

source: Sets an njs function which will be called at the <a href="stream_processing#access_phase">access</a> phase.
ja: <a href="stream_processing#access_phase">アクセス</a>フェーズで呼び出されるnjs関数を設定します。
ru: Устанавливает функцию njs, которая будет вызываться на этапе <a href="stream_processing#access_phase">доступа</a> .
zh_cn: 设置将在<a href="stream_processing#access_phase">访问</a>阶段调用的njs函数。

source: Sets an njs function which will be called at the <a href="stream_processing#access_phase">access</a> phase. Since <a href="../njs/changes#njs0.4.0">0.4.0</a>, a module function can be referenced.
ja: <a href="stream_processing#access_phase">アクセス</a>フェーズで呼び出されるnjs関数を設定します。<a href="../njs/changes#njs0.4.0">0.4.0</a>以降、モジュール関数を参照できます。
zh_cn: 设置一个njs函数，该函数将在<a href="stream_processing#access_phase">访问</a>阶段被调用。从<a href="../njs/changes#njs0.4.0">0.4.0开始</a>，可以引用模块功能。

source: Sets an njs function which will be called at the <a href="stream_processing#preread_phase">preread</a> phase.
ja: <a href="stream_processing#preread_phase">先読み</a>フェーズで呼び出されるnjs関数を設定します。
ru: Устанавливает функцию njs, которая будет вызываться на этапе <a href="stream_processing#preread_phase">предварительного чтения</a> .
zh_cn: 设置将在<a href="stream_processing#preread_phase">预读</a>阶段调用的njs函数。
