Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/nginx/nginx.*.004.xlf
Languages: es, ja, ko, ru, zh_cn

source: Returns a new <code>buf</code> that references the same memory as the original, but offset and cropped by <code><i>start</i></code> and <code><i>end</i></code>. If <code><i>end</i></code> is greater than <a href="#buf_length"><code>buf.length</code></a>, the same result as that of end equal to <a href="#buf_length"><code>buf.length</code></a> is returned.
ja: 元のメモリと同じメモリを参照するが、 <code><i>start</i></code> と <code><i>end</i></code> によってオフセットおよびトリミングされた新しい <code>buf</code> を返します。場合 <code><i>end</i></code> より大きい<a href="#buf_length"> <code>buf.length</code> </a>、端とが等しいと同じ結果<a href="#buf_length"> <code>buf.length</code> が</a>返されます。<i></i><i></i><i></i>
zh_cn: 返回一个新的 <code>buf</code> ，该buf引用与原始内存相同的内存，但通过 <code><i>start</i></code> 和 <code><i>end</i></code> 偏移并裁剪。如果 <code><i>end</i></code> 大于<a href="#buf_length"> <code>buf.length</code> </a>，则返回与end等于<a href="#buf_length"> <code>buf.length</code> </a>相同的结果。

source: Returns a new <code>buf</code> that references the same memory as the original, but offset and cropped by the <code><i>start</i></code> and <code><i>end</i></code> values. The method is not compatible with the <code>Uint8Array.prototype.slice()</code>, which is a superclass of Buffer. To copy the slice, use <code>Uint8Array.prototype.slice()</code>.
ja: 元のメモリと同じメモリを参照するが、 <code><i>start</i></code> 値と <code><i>end</i></code> 値によってオフセットおよびトリミングされた新しい <code>buf</code> を返します。このメソッドは、Bufferのスーパークラスである <code>Uint8Array.prototype.slice()</code> と互換性がありません。スライスをコピーするには、 <code>Uint8Array.prototype.slice()</code> を使用します。<i></i><i></i>
zh_cn: 返回一个新 <code>buf</code> 引用相同的内存作为原始，但偏移和由裁剪 <code><i>start</i></code> 和 <code><i>end</i></code> 的值。该方法与Buffer的超类 <code>Uint8Array.prototype.slice()</code> 不兼容。要复制切片，请使用 <code>Uint8Array.prototype.slice()</code> 。

source: Returns a new Buffer which is the result of concatenating all the Buffer instances in the list. If there are no items in the list or the total length is 0, a new zero-length Buffer is returned. If <code><i>totalLength</i></code> is not specified, it is calculated from the Buffer instances in list by adding their lengths. If <code><i>totalLength</i></code> is specified, it is coerced to an unsigned integer. If the combined length of the Buffers in list exceeds <code><i>totalLength</i></code>, the result is truncated to <code><i>totalLength</i></code>.
ja: リスト内のすべてのBufferインスタンスを連結した結果である新しいBufferを返します。リストに項目がない場合、または全長が0の場合、新しい長さゼロのバッファーが返されます。 <code><i>totalLength</i></code> が指定されていない場合は、リスト内のBufferインスタンスの長さを加算して計算されます。 <code><i>totalLength</i></code> が指定されている場合は、符号なし整数に強制<i>変換</i>されます。リスト内のバッファの合計の長さが <code><i>totalLength</i></code> を超える<i>場合</i>、結果は <code><i>totalLength</i></code> に切り捨てられ<i>ます</i>。
zh_cn: 返回一个新的Buffer，它是连接列表中所有Buffer实例的结果。如果列表中没有项目或总长度为0，则返回一个新的零长度缓冲区。如果未指定 <code><i>totalLength</i></code> ，则根据列表中的Buffer实例通过添加它们的长度来计算得出。如果指定了 <code><i>totalLength</i></code> ，则将其强制为无符号整数。如果列表中Buffers的组合长度超过 <code><i>totalLength</i></code> ，则结果将被截断为 <code><i>totalLength</i></code> 。

source: Returns a new Unicode string from a byte string where each byte is replaced with a corresponding Unicode code point.
ja: 各バイトが対応する Unicode コードポイントに置き換えられたバイト文字列から新しい Unicode 文字列を返します。
zh_cn: 从一个字节字符串中返回一个新的Unicode字符串,其中每个字节都被一个对应的Unicode码点取代。

source: Returns a new string containing a part of an original string between <code>start</code> and <code>end</code> or from <code>start</code> to the end of the string.
ja: 間の元の文字列の一部含む新しい文字列を返し <code>start</code> と <code>end</code> やから <code>start</code> 文字列の最後までを。
ru: Возвращает новую строку, содержащую часть исходной строки между <code>start</code> и <code>end</code> или от <code>start</code> до конца строки.
zh_cn: 返回一个新字符串，该字符串包含字符串的 <code>start</code> 和 <code>end</code> 之间或从 <code>start</code> 到结束之间的原始字符串的一部分。

source: Returns a new string with matches of a pattern (<code>string</code> or a <code>regexp</code>) replaced by a <code>string</code> or a <code>function</code>.
ja: <code>string</code> または <code>function</code> 置き換えられたパターン（ <code>string</code> または <code>regexp</code> ）に一致する新しい文字列を返します。
ru: Возвращает новую строку с совпадениями с шаблоном ( <code>string</code> или <code>regexp</code> ), замененным <code>string</code> или <code>function</code> .
zh_cn: 返回一个新的字符串，该字符串的模式匹配（ <code>string</code> 或正则 <code>regexp</code> ）被 <code>string</code> 或 <code>function</code> 替换。

source: Returns a newly constructed <code>TextEncoder</code> that will generate a byte stream with UTF-8 encoding.
ja: UTF-8エンコーディングでバイトストリームを生成する新しく構築された <code>TextEncoder</code> を返します。
zh_cn: 返回一个新构造的 <code>TextEncoder</code> ，它将生成采用UTF-8编码的字节流。

source: Returns a number representing the code point value of the character at the given <code>position</code>; <code>undefined</code> if there is no element at position.
ja: 指定された <code>position</code> にある文字のコードポイント値を表す数値を返します。位置に要素がない場合は <code>undefined</code> 。
ru: Возвращает число, представляющее значение кодовой точки символа в данной <code>position</code> ; <code>undefined</code> , если в позиции нет элемента.
zh_cn: 返回一个数字，该数字表示给定 <code>position</code> 处字符的代码点值；如果位置上没有元素，则为 <code>undefined</code> 。

source: Returns a string from one or more Unicode code points.
ja: 1つ以上のUnicodeコードポイントから文字列を返します。
ru: Возвращает строку из одной или нескольких точек кода Юникода.
zh_cn: 返回一个或多个Unicode码点的字符串。

source: Returns a string of a specified <code>length</code> with the pad <code>string</code> applied to the end of the specified string (<a href="changes#njs0.2.3">0.2.3</a>).
ja: 指定 <code>length</code> れた <code>string</code> の末尾にパッド文字列を適用して、指定された長さの文字列を返します（<a href="changes#njs0.2.3">0.2.3</a>）。
ru: Возвращает строку указанной <code>length</code> с добавленной <code>string</code> к концу указанной строки ( <a href="changes#njs0.2.3">0.2.3</a> ).
zh_cn: 返回指定 <code>length</code> 的 <code>string</code> ，并将填充字符串应用于指定字符串（<a href="changes#njs0.2.3">0.2.3</a>）的末尾。

source: Returns a string of a specified <code>length</code> with the pad <code>string</code> applied to the start of the specified string (<a href="changes#njs0.2.3">0.2.3</a>).
ja: 指定 <code>length</code> れた <code>string</code> の先頭にパッド文字列を適用して、指定された長さの文字列を返します（<a href="changes#njs0.2.3">0.2.3</a>）。
ru: Возвращает строку указанной <code>length</code> с <a href="changes#njs0.2.3">добавочной </a> <code>string</code> примененной к началу указанной строки ( 0.2.3 ).
zh_cn: 返回指定 <code>length</code> 的 <code>string</code> ，并将填充字符串应用于指定字符串（<a href="changes#njs0.2.3">0.2.3</a>）的开头。

source: Returns a string representing one Unicode code unit at the specified <code>index</code>; empty string if index is out of range. The index can be an integer between 0 and 1-less-than the length of the string. If no index is provided, the default is <code>0</code>, so the first character in the string is returned.
ja: 指定された <code>index</code> 1つのUnicodeコード単位を表す文字列を返します。インデックスが範囲外の場合は空の文字列。インデックスは0から1までの整数で、文字列の長さよりも小さくなります。インデックスが提供されない場合、デフォルトは <code>0</code> なので、文字列の最初の文字が返されます。
ru: Возвращает строку, представляющую одну кодовую единицу Unicode по указанному <code>index</code> ; пустая строка, если индекс вне допустимого диапазона. Индекс может быть целым числом от 0 до 1 - меньше длины строки. Если индекс не указан, значение по умолчанию - <code>0</code> , поэтому возвращается первый символ в строке.
zh_cn: 返回一个字符串，该字符串表示指定 <code>index</code> 处的一个Unicode代码单元；如果索引超出范围，则为空字符串。索引可以是0到1之间的整数，小于字符串的长度。如果未提供索引，则默认值为 <code>0</code> ，因此返回字符串中的第一个字符。

source: Returns a string that contains the concatenation of specified <code>strings</code>.
ja: 指定された <code>strings</code> の連結を含む文字列を返します。
ru: Возвращает строку, содержащую объединение указанных <code>strings</code> .
zh_cn: 返回一个字符串，其中包含指定 <code>strings</code> 的串联。

source: Returns a string with the name of the encoding used by <a href="#textdecoder"><code>TextDecoder()</code></a>, read-only.
ja: <a href="#textdecoder"> <code>TextDecoder()</code> </a>で使用されるエンコーディングの名前を含む文字列を読み取り専用で返します。
zh_cn: 返回一个字符串，该字符串具有<a href="#textdecoder"> <code>TextDecoder()</code> </a>所使用的编码名称（只读）。

source: Returns a string with the specified <code>number</code> of copies of the string.
ja: 文字列の指定されたコピー <code>number</code> を持つ文字列を返します。
ru: Возвращает строку с указанным <code>number</code> копий строки.
zh_cn: 返回具有指定 <code>number</code> 的字符串副本的字符串。

source: Returns a string with the text decoded from the <code>buffer</code> by <a href="#textdecoder"><code>TextDecoder()</code></a>. The buffer can be <code>ArrayBuffer</code>. The <code>options</code> is <code>TextDecodeOptions</code> dictionary with the property:
ja: <a href="#textdecoder"> <code>TextDecoder()</code> </a>によって <code>buffer</code> からデコードされたテキストを含む文字列を返します。バッファは <code>ArrayBuffer</code> にすることができます。 <code>options</code> ある <code>TextDecodeOptions</code> はプロパティで辞書：
zh_cn: 返回从解码的文本字符串 <code>buffer</code> 由<a href="#textdecoder"> <code>TextDecoder()</code> </a>。缓冲区可以是 <code>ArrayBuffer</code> 。该 <code>options</code> 是 <code>TextDecodeOptions</code> 与物业词典：

source: Returns an array that contains the command line arguments passed when the current process was launched.
ja: 現在のプロセスが起動したときに渡されたコマンドライン引数を含む配列を返します。
ru: Возвращает массив,содержащий аргументы командной строки,переданные при запуске текущего процесса.
zh_cn: 返回一个包含当前进程启动时传递的命令行参数的数组。

source: Returns an integer which is the index of the first occurrence of <code><i>value</i></code> in Buffer, or <code><i>-1</i></code> if Buffer does not contain value. The <code><i>value</i></code> can be a <code>string</code> with specified <code><i>encoding</i></code> (by default <code><i>utf-8</i></code>), <code>Buffer</code>, <code>Unit8Array</code>, or a number between 0 and 255.
ja: Bufferで最初に出現する <code><i>value</i></code> インデックスである整数を返します。Bufferに<i>値</i>が含まれていない場合は <code><i>-1</i></code> を返します。 <code><i>value</i></code> は、指定された <code><i>encoding</i></code> （デフォルトでは <code><i>utf-8</i></code> ）、 <code>Buffer</code> 、 <code>Unit8Array</code> 、または0〜255の<i>数値の</i> <code>string</code> することができます。<i></i><i></i>
zh_cn: 返回一个整数，该整数是Buffer中第一次出现 <code><i>value</i></code> 的索引；如果Buffer不包含value ，则返回 <code><i>-1</i></code> 。该 <code><i>value</i></code> 可以是具有指定 <code><i>encoding</i></code> （默认为 <code><i>utf-8</i></code> ）， <code>Buffer</code> ， <code>Unit8Array</code> 或0到255之间的数字的 <code>string</code> 。<i></i><i></i>

source: Returns an object containing the user environment.
ja: ユーザー環境を含むオブジェクトを返します。
ru: Возвращает объект,содержащий пользовательское окружение.
zh_cn: 返回一个包含用户环境的对象。

source: Returns configuration of a particular server in the HTTP upstream server group.
ja: HTTPアップストリームサーバーグループ内の特定のサーバーの設定を返します。
ru: Возвращает конфигурацию конкретного сервера в группе серверов HTTP upstream.
zh_cn: 返回HTTP上游服务器组中某个服务器的配置。

source: Returns configuration of a particular server in the stream upstream server group.
ja: ストリームアップストリームサーバーグループ内の特定のサーバーの設定を返します。
ru: Возвращает конфигурацию конкретного сервера в группе серверов потокового восходящего потока.
zh_cn: 返回流上游服务器组中特定服务器的配置。

source: Returns configuration of each server in a particular HTTP upstream server group.
ja: 特定の HTTP アップストリームサーバーグループ内の各サーバーの設定を返します。
ru: Возвращает конфигурацию каждого сервера в определенной группе серверов HTTP upstream.
zh_cn: 返回特定HTTP上游服务器组中每个服务器的配置。

source: Returns configuration of each server in a particular stream upstream server group.
ja: 特定のストリームアップストリームサーバーグループ内の各サーバーの設定を返します。
ru: Возвращает конфигурацию каждого сервера в определенной группе серверов потокового восходящего потока.
zh_cn: 返回特定流上游服务器组中每个服务器的配置。

source: Returns key-value pairs for each HTTP keyval shared memory <a href="ngx_http_keyval_module#keyval_zone">zone</a>.
ja: 各HTTP keyval共有メモリ<a href="ngx_http_keyval_module#keyval_zone">ゾーンの</a>キーと値のペアを返します。
ru: Возвращает пары ключ-значение для каждого HTTP - keyval общей памяти <a href="ngx_http_keyval_module#keyval_zone">зоны</a> .
zh_cn: 返回每个HTTP keyval共享存储<a href="ngx_http_keyval_module#keyval_zone">区的</a>键/值对。

source: Returns key-value pairs for each stream keyval shared memory <a href="../stream/ngx_stream_keyval_module#keyval_zone">zone</a>.
ja: 各ストリームのkeyval共有メモリ<a href="../stream/ngx_stream_keyval_module#keyval_zone">ゾーンの</a>キーと値のペアを返します。
ru: Возвращает пары ключ-значение для каждой совместно используемой памяти потока keyval <a href="../stream/ngx_stream_keyval_module#keyval_zone">зоны</a> .
zh_cn: 返回每个流keyval共享存储<a href="../stream/ngx_stream_keyval_module#keyval_zone">区的</a>键/值对。

source: Returns key-value pairs stored in a particular HTTP keyval shared memory <a href="ngx_http_keyval_module#keyval_zone">zone</a>.
ja: 特定のHTTP keyval共有メモリ<a href="ngx_http_keyval_module#keyval_zone">ゾーンに</a>保存されているキーと値のペアを返します。
ru: Возвращает пар ключ-значение , хранящееся в конкретной HTTP - keyval совместно используемой памяти <a href="ngx_http_keyval_module#keyval_zone">зоны</a> .
zh_cn: 返回存储在特定HTTP keyval共享存储<a href="ngx_http_keyval_module#keyval_zone">区</a>中的键值对。

source: Returns key-value pairs stored in a particular stream keyval shared memory <a href="../stream/ngx_stream_keyval_module#keyval_zone">zone</a>.
ja: 特定のストリームkeyval共有メモリ<a href="../stream/ngx_stream_keyval_module#keyval_zone">ゾーンに</a>格納されているキーと値のペアを返します。
ru: Возвращает пар ключ-значение , хранимое в конкретном потоке keyval совместно используемой памяти <a href="../stream/ngx_stream_keyval_module#keyval_zone">зоны</a> .
zh_cn: 返回存储在特定流keyval共享内存<a href="../stream/ngx_stream_keyval_module#keyval_zone">zone</a>中的键值对。

source: Returns match of a string against a <code>regexp</code>. The optional <code>limit</code> parameter is an integer that specifies a limit on the number of splits to be found.
ja: <code>regexp</code> に対する文字列の一致を返します。オプションの <code>limit</code> パラメーターは、検出する分割数の制限を指定する整数です。
ru: Возвращает совпадение строки с <code>regexp</code> . Необязательный параметр <code>limit</code> - это целое число, указывающее ограничение на количество найденных разделений.
zh_cn: 返回字符串与 <code>regexp</code> 的匹配。可选的 <code>limit</code> 参数是一个整数，它指定要找到的分割数的限制。

source: Returns nginx version, build name, address, number of configuration reloads, IDs of master and worker processes.
ja: nginx のバージョン、ビルド名、アドレス、設定のリロード数、マスタープロセスとワーカープロセスの ID を返します。
ru: Возвращает версию nginx,имя сборки,адрес,количество перезагрузок конфигурации,идентификаторы основных и рабочих процессов.
zh_cn: 返回nginx版本、构建名称、地址、配置重载次数、主进程和工作进程的ID。

source: Returns statistics of client connections.
ja: クライアント接続の統計情報を返します。
ru: Возвращает статистику клиентских подключений.
zh_cn: 返回客户端连接的统计数据。

source: Returns statistics stored in a particular resolver <a href="ngx_http_core_module#resolver_status_zone">zone</a>.
ja: 特定のリゾルバー<a href="ngx_http_core_module#resolver_status_zone">ゾーンに</a>保存されている統計を返します。
zh_cn: 返回存储在特定解析器<a href="ngx_http_core_module#resolver_status_zone">区域</a>中的统计信息。

source: Returns status information for each <a href="ngx_http_core_module#resolver_status_zone">resolver zone</a>.
ja: 各<a href="ngx_http_core_module#resolver_status_zone">リゾルバーゾーンの</a>ステータス情報を返します。
zh_cn: 返回每个<a href="ngx_http_core_module#resolver_status_zone">解析器区域的</a>状态信息。

source: Returns status information for each HTTP <a href="ngx_http_api_module#status_zone">server zone</a>.
ja: 各HTTP <a href="ngx_http_api_module#status_zone">サーバーゾーンの</a>ステータス情報を返します。
ru: Возвращает информацию о состоянии для каждой <a href="ngx_http_api_module#status_zone">зоны</a> HTTP- сервера .
zh_cn: 返回每个HTTP <a href="ngx_http_api_module#status_zone">服务器区域的</a>状态信息。

source: Returns status information for each HTTP <a href="ngx_http_api_module#status_zone_location">location zone</a>.
ja: 各HTTP<a href="ngx_http_api_module#status_zone_location">ロケーションゾーンの</a>ステータス情報を返します。
zh_cn: 返回每个HTTP<a href="ngx_http_api_module#status_zone_location">位置区域的</a>状态信息。

source: Returns status information for each HTTP <a href="ngx_http_limit_conn_module#limit_conn_zone">limit_conn zone</a>.
ja: 各<a href="ngx_http_limit_conn_module#limit_conn_zone">HTTPlimit_connゾーンの</a>ステータス情報を返します。
zh_cn: 返回每个HTTP <a href="ngx_http_limit_conn_module#limit_conn_zone">limit_conn区域的</a>状态信息。

source: Returns status information for each HTTP <a href="ngx_http_limit_req_module#limit_req_zone">limit_req zone</a>.
ja: 各<a href="ngx_http_limit_req_module#limit_req_zone">HTTPlimit_reqゾーンの</a>ステータス情報を返します。
zh_cn: 返回每个HTTP <a href="ngx_http_limit_req_module#limit_req_zone">limit_req区域的</a>状态信息。

source: Returns status information for each stream <a href="../stream/ngx_stream_limit_conn_module#limit_conn_zone">limit_conn zone</a>.
ja: 各ストリーム<a href="../stream/ngx_stream_limit_conn_module#limit_conn_zone">limit_connゾーンの</a>ステータス情報を返します。
zh_cn: 返回每个流<a href="../stream/ngx_stream_limit_conn_module#limit_conn_zone">limit_conn zone的</a>状态信息。

source: Returns status information for each stream <a href="ngx_http_api_module#status_zone">server zone</a>.
ja: 各ストリーム<a href="ngx_http_api_module#status_zone">サーバーゾーンの</a>ステータス情報を返します。
ru: Возвращает информацию о состоянии для каждой <a href="ngx_http_api_module#status_zone">зоны</a> потокового сервера .
zh_cn: 返回每个流<a href="ngx_http_api_module#status_zone">服务器区域的</a>状态信息。

source: Returns status of a particular HTTP <a href="ngx_http_api_module#status_zone_location">location zone</a>.
ja: 特定のHTTP<a href="ngx_http_api_module#status_zone_location">ロケーションゾーンの</a>ステータスを返します。
zh_cn: 返回特定HTTP<a href="ngx_http_api_module#status_zone_location">位置区域的状态</a>。

source: Returns status of a particular HTTP <a href="ngx_http_limit_conn_module#limit_conn_zone">limit_conn zone</a>.
ja: 特定の<a href="ngx_http_limit_conn_module#limit_conn_zone">HTTPlimit_connゾーンの</a>ステータスを返します。
zh_cn: 返回特定HTTP <a href="ngx_http_limit_conn_module#limit_conn_zone">limit_conn区域的状态</a>。

source: Returns status of a particular HTTP <a href="ngx_http_limit_req_module#limit_req_zone">limit_req zone</a>.
ja: 特定の<a href="ngx_http_limit_req_module#limit_req_zone">HTTPlimit_reqゾーンの</a>ステータスを返します。
zh_cn: 返回特定HTTP <a href="ngx_http_limit_req_module#limit_req_zone">limit_req区域的状态</a>。

source: Returns status of a particular HTTP server zone.
ja: 特定の HTTP サーバーゾーンの状態を返します。
ru: Возвращает статус определенной зоны HTTP-сервера.
zh_cn: 返回特定HTTP服务器区域的状态。

source: Returns status of a particular HTTP upstream server group and its servers.
ja: 特定の HTTP アップストリームサーバーグループとそのサーバーの状態を返します。
ru: Возвращает статус конкретной группы серверов верхнего уровня HTTP и их серверов.
zh_cn: 返回某个HTTP上游服务器组及其服务器的状态。

source: Returns status of a particular cache.
ja: 特定のキャッシュの状態を返します。
ru: Возвращает статус определенного кэша.
zh_cn: 返回某个缓存的状态。

source: Returns status of a particular stream <a href="../stream/ngx_stream_limit_conn_module#limit_conn_zone">limit_conn zone</a>.
ja: 特定のストリーム<a href="../stream/ngx_stream_limit_conn_module#limit_conn_zone">limit_connゾーンの</a>ステータスを返します。
zh_cn: 返回特定流<a href="../stream/ngx_stream_limit_conn_module#limit_conn_zone">limit_conn zone的状态</a>。

source: Returns status of a particular stream server zone.
ja: 特定のストリームサーバーゾーンの状態を返します。
ru: Возвращает статус определенной зоны сервера потоков.
zh_cn: 返回特定流服务器区域的状态。

source: Returns status of a particular stream upstream server group and its servers.
ja: 特定のストリームアップストリームサーバーグループとそのサーバーの状態を返します。
ru: Возвращает статус определенной группы серверов восходящего потока и его серверов.
zh_cn: 返回特定流上游服务器组及其服务器的状态。

source: Returns status of client HTTP requests.
ja: クライアントのHTTPリクエストの状態を返します。
ru: Возвращает статус HTTP-запросов клиента.
zh_cn: 返回客户端HTTP请求的状态。

source: Returns status of each HTTP upstream server group and its servers.
ja: 各HTTPアップストリームサーバーグループとそのサーバーの状態を返します。
ru: Возвращает статус каждой группы серверов HTTP upstream и их серверов.
zh_cn: 返回每个HTTP上游服务器组及其服务器的状态。

source: Returns status of each cache configured by <a href="ngx_http_proxy_module#proxy_cache_path">proxy_cache_path</a> and other &ldquo;<code>*_cache_path</code>&rdquo; directives.
ja: <a href="ngx_http_proxy_module#proxy_cache_path">proxy_cache_path</a>およびその他の「 <code>*_cache_path</code> 」ディレクティブによって構成された各キャッシュのステータスを返します。
ru: Возвращает состояние каждого кеша, настроенного с помощью <a href="ngx_http_proxy_module#proxy_cache_path">proxy_cache_path</a> и других директив &laquo; <code>*_cache_path</code> &raquo;.
zh_cn: 返回由<a href="ngx_http_proxy_module#proxy_cache_path">proxy_cache_path</a>和其他&ldquo; <code>*_cache_path</code> &rdquo;指令配置的每个缓存的状态。

source: Returns status of each stream upstream server group and its servers.
ja: 各ストリームアップストリームサーバーグループとそのサーバーの状態を返します。
ru: Возвращает статус каждой группы серверов восходящего потока и его серверов.
zh_cn: 返回每个流上游服务器组及其服务器的状态。

source: Returns status of slabs for a particular shared memory zone with slab allocator.
ja: slab allocatorで特定の共有メモリゾーンのslabの状態を返します。
ru: Возвращает состояние слябов для определенной разделяемой зоны памяти с помощью аллокатора слябов.
zh_cn: Returns status of slab for a particular shared memory zone with slab allocator.

source: Returns status of slabs for each shared memory zone with slab allocator.
ja: slab allocatorで各共有メモリゾーンのslabの状態を返します。
ru: Возвращает состояние слябов для каждой разделяемой зоны памяти с помощью аллокатора слябов.
zh_cn: 返回每个有板块分配器的共享内存区的板块状态。

source: Returns synchronization status of a cluster node.
ja: クラスタノードの同期状態を返します。
ru: Возвращает статус синхронизации узла кластера.
zh_cn: 返回集群节点的同步状态。

source: Returns the PID of the current parent process.
ja: 現在の親プロセスの PID を返します。
ru: Возвращает PID текущего родительского процесса.
zh_cn: 返回当前父进程的PID。

source: Returns the PID of the current process.
ja: 現在のプロセスのPIDを返します。
ru: Возвращает PID текущего процесса.
zh_cn: 返回当前进程的PID。

source: Returns the byte length of a specified value, when encoded using <code><i>encoding</i></code>. The value can be a <code>string</code>, <code>Buffer</code>, <code>TypedArray</code>, <code>DataView</code>, or <code>ArrayBuffer</code>. If the value is a <code><i>string</i></code>, the <code>encoding</code> parameter is its encoding, can be <code><i>utf-8</i></code>, <code><i>hex</i></code>, <code><i>base64</i></code>, <code><i>base64url</i></code>; by default is <code><i>utf-8</i></code>.
ja: <code><i>encoding</i></code> を使用して<i>エンコード</i>された場合、指定された値のバイト長を返します。値には、 <code>string</code> 、 <code>Buffer</code> 、 <code>TypedArray</code> 、 <code>DataView</code> 、または <code>ArrayBuffer</code> を指定できます。値が <code><i>string</i></code> 場合、 <code>encoding</code> パラメータはそのエンコーディングであり、 <code><i>utf-8</i></code> 、 <code><i>hex</i></code> 、 <code><i>base64</i></code> 、 <code><i>base64url</i></code> のいずれかになります。デフォルトは <code><i>utf-8</i></code> です。
zh_cn: 当使用 <code><i>encoding</i></code> 编码时，返回指定值的字节长度。该值可以是 <code>string</code> ， <code>Buffer</code> ， <code>TypedArray</code> ， <code>DataView</code> 或 <code>ArrayBuffer</code> 。如果值为 <code><i>string</i></code> ，则 <code>encoding</code> 参数为其编码，可以为 <code><i>utf-8</i></code> ， <code><i>hex</i></code> ， <code><i>base64</i></code> ， <code><i>base64url</i></code> ；默认情况下是 <code><i>utf-8</i></code> 。

source: Returns the length of the string.
ja: 文字列の長さを返します。
ru: Возвращает длину строки.
zh_cn: 返回字符串的长度。

source: Returns the number of abnormally terminated and respawned child processes.
ja: 異常終了してレスポーンされた子プロセスの数を返します。
ru: Возвращает количество аномально прерванных и передохнувших процессов у ребенка.
zh_cn: 返回异常终止和重新生成的子进程的数量。

source: Returns the number of bytes in Buffer.
ja: バッファ内のバイト数を返します。
zh_cn: 返回Buffer中的字节数。

source: Returns the part of the string between <code>start</code> and <code>end</code> or from <code>start</code> to the end of the string.
ja: 戻り値の間の文字列の一部 <code>start</code> 及び <code>end</code> やから <code>start</code> 文字列の最後に。
ru: Возвращает часть строки между <code>start</code> и <code>end</code> или от <code>start</code> до конца строки.
zh_cn: 返回字符串在 <code>start</code> 和 <code>end</code> 之间或从 <code>start</code> 到结束的部分。
