Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/nginx/nginx.*.004.xlf
Languages: es, ja, ko, ru, zh_cn

source: The <code>ngx_http_upstream_conf_module</code> module allows configuring upstream server groups on-the-fly via a simple HTTP interface without the need of restarting nginx. The <a href="ngx_http_upstream_module#zone">http</a> or <a href="../stream/ngx_stream_upstream_module#zone">stream</a> server group must reside in the shared memory.
es: El m&oacute;dulo <code>ngx_http_upstream_conf_module</code> permite configurar grupos de servidores ascendentes sobre la marcha a trav&eacute;s de una interfaz HTTP simple sin la necesidad de reiniciar nginx. El <a href="ngx_http_upstream_module#zone">http</a> o el grupo de servidores de <a href="../stream/ngx_stream_upstream_module#zone">flujo</a> deben residir en la memoria compartida.
ja: <code>ngx_http_upstream_conf_module</code> モジュールは、nginxのを再起動する必要がなく、簡単なHTTPインターフェースを介してオンザフライ上流のサーバグループを設定することができます。<a href="ngx_http_upstream_module#zone">HTTP</a>または<a href="../stream/ngx_stream_upstream_module#zone">ストリーム</a>サーバグループは、共有メモリ上に存在する必要があります。
ko: <code>ngx_http_upstream_conf_module</code> 모듈의 nginx를 재시작 할 필요없이 즉석에서 간단한 HTTP 인터페이스를 통해 업스트림 서버 그룹을 구성 할 수 있습니다. <a href="ngx_http_upstream_module#zone">HTTP</a> 또는 <a href="../stream/ngx_stream_upstream_module#zone">스트림</a> 서버 그룹은 공유 메모리에 상주해야합니다.
ru: Модуль <code>ngx_http_upstream_conf_module</code> позволяет настраивать группы вышестоящих серверов на лету через простой интерфейс HTTP без необходимости перезапуска nginx. Группа <a href="ngx_http_upstream_module#zone">http</a> или <a href="../stream/ngx_stream_upstream_module#zone">потокового</a> сервера должна находиться в общей памяти.
zh_cn: 所述 <code>ngx_http_upstream_conf_module</code> 模块允许在即时经由简单的HTTP接口配置上游服务器组，而不需要重新启动Nginx的。的<a href="ngx_http_upstream_module#zone">HTTP</a>或<a href="../stream/ngx_stream_upstream_module#zone">流</a>服务器组必须驻留在共享存储器中。

source: The <code>ngx_http_upstream_hc_module</code> module allows enabling periodic health checks of the servers in a <a href="ngx_http_upstream_module#upstream">group</a> referenced in the surrounding location. The server group must reside in the <a href="ngx_http_upstream_module#zone">shared memory</a>.
es: El m&oacute;dulo <code>ngx_http_upstream_hc_module</code> permite habilitar controles de salud peri&oacute;dicos de los servidores en un <a href="ngx_http_upstream_module#upstream">grupo</a> referenciado en la ubicaci&oacute;n circundante. El grupo de servidores debe residir en la <a href="ngx_http_upstream_module#zone">memoria compartida</a> .
ja: <code>ngx_http_upstream_hc_module</code> モジュール内のサーバの定期的な健康診断を可能にすることができ<a href="ngx_http_upstream_module#upstream">グループ</a>周囲の場所で参照します。サーバーグループは<a href="ngx_http_upstream_module#zone">共有メモリに</a>存在する必要があります。
ko: <code>ngx_http_upstream_hc_module</code> 모듈은 상기 서버의 주기적 상태 확인을 가능하게 허용 <a href="ngx_http_upstream_module#upstream">그룹</a> 주변의 위치에서 참조. 서버 그룹은 <a href="ngx_http_upstream_module#zone">공유 메모리에</a> 상주해야합니다 .
ru: Модуль <code>ngx_http_upstream_hc_module</code> позволяет включать периодические проверки работоспособности серверов в <a href="ngx_http_upstream_module#upstream">группе,</a> указанной в окружающем местоположении. Группа серверов должна находиться в <a href="ngx_http_upstream_module#zone">общей памяти</a> .
zh_cn: 所述 <code>ngx_http_upstream_hc_module</code> 模块允许使服务器定期健康检查在一<a href="ngx_http_upstream_module#upstream">组</a>在周边位置引用。服务器组必须驻留在<a href="ngx_http_upstream_module#zone">共享内存中</a>。

source: The <code>ngx_http_upstream_module</code> module is used to define groups of servers that can be referenced by the <a href="ngx_http_proxy_module#proxy_pass">proxy_pass</a>, <a href="ngx_http_fastcgi_module#fastcgi_pass">fastcgi_pass</a>, <a href="ngx_http_uwsgi_module#uwsgi_pass">uwsgi_pass</a>, <a href="ngx_http_scgi_module#scgi_pass">scgi_pass</a>, <a href="ngx_http_memcached_module#memcached_pass">memcached_pass</a>, and <a href="ngx_http_grpc_module#grpc_pass">grpc_pass</a> directives.
es: El m&oacute;dulo <code>ngx_http_upstream_module</code> se utiliza para definir grupos de servidores que pueden ser referenciados por las <a href="ngx_http_fastcgi_module#fastcgi_pass">directivas </a><a href="ngx_http_proxy_module#proxy_pass">proxy_pass</a> , fastcgi_pass , <a href="ngx_http_uwsgi_module#uwsgi_pass">uwsgi_pass</a> , <a href="ngx_http_scgi_module#scgi_pass">scgi_pass</a> , <a href="ngx_http_memcached_module#memcached_pass">memcached_pass</a> y <a href="ngx_http_grpc_module#grpc_pass">grpc_pass</a> .
ja: <code>ngx_http_upstream_module</code> モジュールによって参照することができるサーバのグループを定義するために使用される<a href="ngx_http_proxy_module#proxy_pass">proxy_pass</a>、<a href="ngx_http_fastcgi_module#fastcgi_pass">fastcgi_pass</a>、<a href="ngx_http_uwsgi_module#uwsgi_pass">uwsgi_pass</a>、<a href="ngx_http_scgi_module#scgi_pass">scgi_pass</a>、<a href="ngx_http_memcached_module#memcached_pass">memcached_pa​​ss</a>、及び<a href="ngx_http_grpc_module#grpc_pass">grpc_passの</a>ディレクティブ。
ko: <code>ngx_http_upstream_module</code> 모듈은 참조 할 수있는 서버 그룹을 정의하는 데 사용됩니다 <a href="ngx_http_proxy_module#proxy_pass">proxy_pass</a> , <a href="ngx_http_fastcgi_module#fastcgi_pass">fastcgi_pass</a> , <a href="ngx_http_uwsgi_module#uwsgi_pass">uwsgi_pass</a> , <a href="ngx_http_scgi_module#scgi_pass">scgi_pass</a> , <a href="ngx_http_memcached_module#memcached_pass">memcached_pass</a> 및 <a href="ngx_http_grpc_module#grpc_pass">grpc_pass의</a> 지시를.
ru: Модуль <code>ngx_http_upstream_module</code> используется для определения групп серверов, на которые могут ссылаться <a href="ngx_http_proxy_module#proxy_pass">директивы proxy_pass</a> , <a href="ngx_http_fastcgi_module#fastcgi_pass">fastcgi_pass</a> , <a href="ngx_http_uwsgi_module#uwsgi_pass">uwsgi_pass</a> , <a href="ngx_http_scgi_module#scgi_pass">scgi_pass</a> , <a href="ngx_http_memcached_module#memcached_pass">memcached_pass</a> и <a href="ngx_http_grpc_module#grpc_pass">grpc_pass</a> .
zh_cn: 所述 <code>ngx_http_upstream_module</code> 模块用于定义可以由被引用的服务器组<a href="ngx_http_proxy_module#proxy_pass">proxy_pass</a>，<a href="ngx_http_fastcgi_module#fastcgi_pass">fastcgi_pass</a>，<a href="ngx_http_uwsgi_module#uwsgi_pass">uwsgi_pass</a>，<a href="ngx_http_scgi_module#scgi_pass">scgi_pass</a>，<a href="ngx_http_memcached_module#memcached_pass">memcached_pa​​ss</a>，和<a href="ngx_http_grpc_module#grpc_pass">grpc_pass</a>指令。

source: The <code>ngx_http_upstream_module</code> module supports the following embedded variables:
es: El m&oacute;dulo <code>ngx_http_upstream_module</code> admite las siguientes variables integradas:
ja: <code>ngx_http_upstream_module</code> モジュールは以下の埋め込み変数をサポートしています。
ko: <code>ngx_http_upstream_module</code> 모듈은 다음과 같은 포함 된 변수를 지원합니다 :
ru: Модуль <code>ngx_http_upstream_module</code> поддерживает следующие встроенные переменные:
zh_cn: 该 <code>ngx_http_upstream_module</code> 模块支持以下内置变量：

source: The <code>ngx_http_userid_module</code> module sets cookies suitable for client identification. Received and set cookies can be logged using the embedded variables <a href="#var_uid_got">$uid_got</a> and <a href="#var_uid_set">$uid_set</a>. This module is compatible with the <a href="http://www.lexa.ru/programs/mod-uid-eng.html">mod_uid</a> module for Apache.
es: El m&oacute;dulo <code>ngx_http_userid_module</code> establece cookies adecuadas para la identificaci&oacute;n del cliente. Las cookies recibidas y configuradas se pueden registrar utilizando las variables integradas <a href="#var_uid_got">$ uid_got</a> y <a href="#var_uid_set">$ uid_set</a> . Este m&oacute;dulo es compatible con el m&oacute;dulo <a href="http://www.lexa.ru/programs/mod-uid-eng.html">mod_uid</a> para Apache.
ja: <code>ngx_http_userid_module</code> モジュールは、クライアント識別に適したクッキーを設定します。受信および設定されたCookieは、埋め込み変数<a href="#var_uid_got">$ uid_got</a>および<a href="#var_uid_set">$ uid_set</a>を使用してログに記録できます。このモジュールは、Apache の<a href="http://www.lexa.ru/programs/mod-uid-eng.html">mod_uid</a>モジュールと互換性があります。
ko: <code>ngx_http_userid_module</code> 모듈은 클라이언트 식별에 적합 쿠키를 설정합니다. 포함 된 변수 <a href="#var_uid_got">$ uid_got</a> 및 <a href="#var_uid_set">$ uid_set을</a> 사용하여 수신 및 설정 쿠키를 기록 할 수 있습니다 . 이 모듈은 Apache 용 <a href="http://www.lexa.ru/programs/mod-uid-eng.html">mod_uid</a> 모듈 과 호환됩니다 .
ru: Модуль <code>ngx_http_userid_module</code> устанавливает файлы cookie, подходящие для идентификации клиента. Полученные и установленные файлы cookie могут регистрироваться с помощью встроенных переменных <a href="#var_uid_got">$ uid_got</a> и <a href="#var_uid_set">$ uid_set</a> . Этот модуль совместим с модулем <a href="http://www.lexa.ru/programs/mod-uid-eng.html">mod_uid</a> для Apache.
zh_cn: 所述 <code>ngx_http_userid_module</code> 模块设置适合于客户端标识的cookie。可以使用嵌入式变量<a href="#var_uid_got">$ uid_got</a>和<a href="#var_uid_set">$ uid_set</a>记录接收和设置的cookie 。该模块与Apache 的<a href="http://www.lexa.ru/programs/mod-uid-eng.html">mod_uid</a>模块兼容。

source: The <code>ngx_http_userid_module</code> module supports the following embedded variables:
es: El m&oacute;dulo <code>ngx_http_userid_module</code> admite las siguientes variables integradas:
ja: <code>ngx_http_userid_module</code> モジュールは以下の埋め込み変数をサポートしています。
ko: <code>ngx_http_userid_module</code> 모듈은 다음과 같은 포함 된 변수를 지원합니다 :
ru: Модуль <code>ngx_http_userid_module</code> поддерживает следующие встроенные переменные:
zh_cn: 该 <code>ngx_http_userid_module</code> 模块支持以下内置变量：

source: The <code>ngx_http_uwsgi_module</code> module allows passing requests to a uwsgi server.
es: El m&oacute;dulo <code>ngx_http_uwsgi_module</code> permite pasar solicitudes a un servidor uwsgi.
ja: <code>ngx_http_uwsgi_module</code> モジュールはuwsgiサーバーに要求を渡すことができます。
ko: <code>ngx_http_uwsgi_module</code> 모듈은 uwsgi 서버로 요청을 전달 할 수 있습니다.
ru: Модуль <code>ngx_http_uwsgi_module</code> позволяет передавать запросы на сервер uwsgi.
zh_cn: 该 <code>ngx_http_uwsgi_module</code> 模块允许传递请求到服务器uwsgi。

source: The <code>ngx_http_v2_module</code> module (1.9.5) provides support for <a href="https://tools.ietf.org/html/rfc7540">HTTP/2</a> and supersedes the <a href="ngx_http_spdy_module">ngx_http_spdy_module</a> module.
es: El m&oacute;dulo <code>ngx_http_v2_module</code> (1.9.5) proporciona soporte para <a href="https://tools.ietf.org/html/rfc7540">HTTP / 2</a> y reemplaza al m&oacute;dulo <a href="ngx_http_spdy_module">ngx_http_spdy_module</a> .
ja: <code>ngx_http_v2_module</code> モジュール（1.9.5）のためのサポートを提供<a href="https://tools.ietf.org/html/rfc7540">HTTP / 2</a>と優先さ<a href="ngx_http_spdy_module">ngx_http_spdy_module</a>モジュール。
ko: <code>ngx_http_v2_module</code> 모듈 (1.9.5)을위한 지원을 제공하는 <a href="https://tools.ietf.org/html/rfc7540">HTTP / 2</a> 및 대체합니다 <a href="ngx_http_spdy_module">ngx_http_spdy_module</a> 모듈.
ru: Модуль <code>ngx_http_v2_module</code> (1.9.5) обеспечивает поддержку <a href="https://tools.ietf.org/html/rfc7540">HTTP / 2</a> и заменяет модуль <a href="ngx_http_spdy_module">ngx_http_spdy_module</a> .
zh_cn: 所述 <code>ngx_http_v2_module</code> 模块（1.9.5）提供了一种用于支持<a href="https://tools.ietf.org/html/rfc7540">HTTP / 2</a>，并取代<a href="ngx_http_spdy_module">ngx_http_spdy_module</a>模块。

source: The <code>ngx_http_v2_module</code> module supports the following embedded variables:
es: El m&oacute;dulo <code>ngx_http_v2_module</code> admite las siguientes variables integradas:
ja: <code>ngx_http_v2_module</code> モジュールは以下の埋め込み変数をサポートしています。
ko: <code>ngx_http_v2_module</code> 모듈은 다음과 같은 포함 된 변수를 지원합니다 :
ru: Модуль <code>ngx_http_v2_module</code> поддерживает следующие встроенные переменные:
zh_cn: 该 <code>ngx_http_v2_module</code> 模块支持以下内置变量：

source: The <code>ngx_http_xslt_module</code> (0.7.8+) is a filter that transforms XML responses using one or more XSLT stylesheets.
es: El <code>ngx_http_xslt_module</code> (0.7.8+) es un filtro que transforma las respuestas XML utilizando una o m&aacute;s hojas de estilo XSLT.
ja: <code>ngx_http_xslt_module</code> （0.7.8+）は、変換XML応答は、1つ以上のXSLTスタイルシートを使用して、そのフィルタです。
ko: <code>ngx_http_xslt_module</code> (0.7.8+)는 변환 된 XML 응답은 하나 이상의 XSLT 스타일 시트를 사용하는 필터이다.
ru: <code>ngx_http_xslt_module</code> (0.7.8+) представляет собой фильтр , что ответы преобразования XML с помощью одного или нескольких таблиц стилей XSLT.
zh_cn: 所述 <code>ngx_http_xslt_module</code> （0.7.8+）是一个过滤器，使用一个或多个XSLT样式表转换的XML响应。

source: The <code>ngx_inline</code> macro should be used instead of <code>inline</code>:
es: La macro <code>ngx_inline</code> debe usarse en lugar de en <code>inline</code> :
ja: <code>ngx_inline</code> マクロが代わりに使用されるべきである <code>inline</code> 。
ko: <code>ngx_inline</code> 의 매크로 대신 사용해야합니다 <code>inline</code> :
ru: <code>ngx_inline</code> макрос должен использоваться вместо <code>inline</code> :
zh_cn: 该 <code>ngx_inline</code> 宏应该被用来代替 <code>inline</code> ：

source: The <code>ngx_mail_ssl_module</code> module provides the necessary support for a mail proxy server to work with the SSL/TLS protocol.
es: El m&oacute;dulo <code>ngx_mail_ssl_module</code> proporciona el soporte necesario para que un servidor proxy de correo funcione con el protocolo SSL / TLS.
ja: <code>ngx_mail_ssl_module</code> モジュールは、SSL / TLSプロトコルで動作するようにメールプロキシサーバーに必要なサポートを提供します。
ko: <code>ngx_mail_ssl_module</code> 모듈은 SSL / TLS 프로토콜 작업에 대한 메일 프록시 서버에 필요한 지원을 제공합니다.
ru: Модуль <code>ngx_mail_ssl_module</code> обеспечивает необходимую поддержку почтового прокси-сервера для работы с протоколом SSL / TLS.
zh_cn: 该 <code>ngx_mail_ssl_module</code> 模块提供了一个邮件代理服务器工作与SSL / TLS协议提供必要的支持。

source: The <code>ngx_regex_exec_array()</code> function accepts the array of <code>ngx_regex_elt_t</code> elements (which are just compiled regular expressions with associated names), a string to match, and a log. The function applies expressions from the array to the string until either a match is found or no more expressions are left. The return value is <code>NGX_OK</code> when there is a match and <code>NGX_DECLINED</code> otherwise, or <code>NGX_ERROR</code> in case of error.
es: La funci&oacute;n <code>ngx_regex_exec_array()</code> acepta la matriz de elementos <code>ngx_regex_elt_t</code> (que son simplemente expresiones regulares compiladas con nombres asociados), una cadena para hacer coincidir y un registro. La funci&oacute;n aplica expresiones de la matriz a la cadena hasta que se encuentra una coincidencia o no quedan m&aacute;s expresiones. El valor de retorno es <code>NGX_OK</code> cuando hay un partido y <code>NGX_DECLINED</code> de otro modo, o <code>NGX_ERROR</code> en caso de error.
ja: <code>ngx_regex_exec_array()</code> 関数の配列受け付ける <code>ngx_regex_elt_t</code> （単に関連付けられた名前付き正規表現をコンパイルしている）要素、一致する文字列、およびログ。この関数は、一致が見つかるか、式がなくなるまで、配列の式を文字列に適用します。戻り値は <code>NGX_OK</code> が一致するとき <code>NGX_DECLINED</code> さもなければ、又は <code>NGX_ERROR</code> エラーの場合。
ko: <code>ngx_regex_exec_array()</code> 함수의 배열을 받아 <code>ngx_regex_elt_t</code> (단지 관련된 이름을 가진 정규 표현식을 컴파일) 요소, 경기에 문자열 및 로그를. 이 함수는 일치하는 것이 발견되거나 더 이상 표현식이 남아 있지 않을 때까지 배열의 표현식을 문자열에 적용합니다. 일치하는 경우 반환 값은 <code>NGX_OK</code> 이고 , 그렇지 않으면 <code>NGX_DECLINED</code> , 오류 인 경우 <code>NGX_ERROR</code>
ru: Функция <code>ngx_regex_exec_array()</code> принимает массив элементов <code>ngx_regex_elt_t</code> (которые представляют собой просто скомпилированные регулярные выражения со связанными именами), строку для сопоставления и журнал. Функция применяет выражения из массива к строке до тех пор, пока не будет найдено совпадение или не останется больше выражений. Возвращаемое значение - <code>NGX_OK</code> при совпадении и <code>NGX_DECLINED</code> в противном случае или <code>NGX_ERROR</code> в случае ошибки.
zh_cn: 所述 <code>ngx_regex_exec_array()</code> 函数接受的阵列 <code>ngx_regex_elt_t</code> 元件（其刚编译与相关联的名称正则表达式），一个字符串匹配，以及日志。该函数将数组中的表达式应用于字符串，直到找到匹配项或不再有其他表达式为止。返回值是 <code>NGX_OK</code> 当存在匹配和 <code>NGX_DECLINED</code> 否则，或 <code>NGX_ERROR</code> 在错误的情况下。

source: The <code>ngx_stream_access_module</code> module (1.9.2) allows limiting access to certain client addresses.
es: El m&oacute;dulo <code>ngx_stream_access_module</code> (1.9.2) permite limitar el acceso a determinadas direcciones de clientes.
ja: <code>ngx_stream_access_module</code> モジュール（1.9.2）は、特定のクライアントアドレスへのアクセスを制限することができます。
ko: <code>ngx_stream_access_module</code> 의 모듈 (1.9.2)는 특정 클라이언트 주소에 대한 액세스를 제한 할 수 있습니다.
ru: Модуль <code>ngx_stream_access_module</code> (1.9.2) позволяет ограничить доступ к определенным адресам клиентов.
zh_cn: 所述 <code>ngx_stream_access_module</code> 模块（1.9.2）允许限制访问某些客户端地址。

source: The <code>ngx_stream_core_module</code> module is available since version 1.9.0. This module is not built by default, it should be enabled with the <code>--with-stream</code> configuration parameter.
es: El m&oacute;dulo <code>ngx_stream_core_module</code> est&aacute; disponible desde la versi&oacute;n 1.9.0. Este m&oacute;dulo no est&aacute; construido de forma predeterminada, debe habilitarse con el <code>--with-stream</code> configuraci&oacute;n --with-stream .
ja: <code>ngx_stream_core_module</code> モジュールは、バージョン1.9.0以降で使用可能です。このモジュールはデフォルトではビルドされません <code>--with-stream</code> 設定パラメーターで有効にする必要があります。
ko: <code>ngx_stream_core_module</code> 모듈은 버전 1.9.0부터 사용할 수 있습니다. 이 모듈은 기본적으로 빌드되지 않으며 <code>--with-stream</code> 구성 매개 변수를 사용하여 활성화해야합니다 .
ru: Модуль <code>ngx_stream_core_module</code> доступен с версии 1.9.0. Этот модуль не собирается по умолчанию, его нужно включить с помощью параметра конфигурации <code>--with-stream</code> .
zh_cn: 该 <code>ngx_stream_core_module</code> 模块是自1.9.0版本。默认情况下未构建此模块，应使用 <code>--with-stream</code> 配置参数启用它。

source: The <code>ngx_stream_core_module</code> module supports variables since 1.11.2.
es: El m&oacute;dulo <code>ngx_stream_core_module</code> admite variables desde 1.11.2.
ja: <code>ngx_stream_core_module</code> モジュールは、1.11.2以降の変数をサポートしています。
ko: <code>ngx_stream_core_module</code> 모듈 1.11.2 때문에 변수를 지원한다.
ru: Модуль <code>ngx_stream_core_module</code> поддерживает переменные с 1.11.2.
zh_cn: 该 <code>ngx_stream_core_module</code> 模块支持自1.11.2变量。

source: The <code>ngx_stream_geo_module</code> module (1.11.3) creates variables with values depending on the client IP address.
es: El m&oacute;dulo <code>ngx_stream_geo_module</code> (1.11.3) crea variables con valores que dependen de la direcci&oacute;n IP del cliente.
ja: <code>ngx_stream_geo_module</code> モジュール（1.11.3）は、クライアントのIPアドレスに応じた値を持つ変数を作成します。
ko: <code>ngx_stream_geo_module</code> 의 모듈 (1.11.3) 클라이언트의 IP 주소에 따라 값이 변수를 생성한다.
ru: Модуль <code>ngx_stream_geo_module</code> (1.11.3) создает переменные со значениями в зависимости от IP-адреса клиента.
zh_cn: 该 <code>ngx_stream_geo_module</code> 模块（1.11.3）创建了这取决于客户端的IP地址值的变量。

source: The <code>ngx_stream_geoip_module</code> module (1.11.3) creates variables with values depending on the client IP address, using the precompiled <a href="http://www.maxmind.com">MaxMind</a> databases.
es: El m&oacute;dulo <code>ngx_stream_geoip_module</code> (1.11.3) crea variables con valores que dependen de la direcci&oacute;n IP del cliente, utilizando las <a href="http://www.maxmind.com">bases de</a> datos MaxMind precompiladas .
ja: <code>ngx_stream_geoip_module</code> モジュール（1.11.3）がプリコンパイル使用して、クライアントのIPアドレスに応じた値を持つ変数を作成し、<a href="http://www.maxmind.com">MaxMindの</a>データベースを。
ko: <code>ngx_stream_geoip_module</code> 모듈 (1.11.3)의 값이 미리 컴파일하여 클라이언트의 IP 주소에 따라 생성하여 변수 <a href="http://www.maxmind.com">MaxMind의</a> 데이터베이스.
ru: Модуль <code>ngx_stream_geoip_module</code> (1.11.3) создает переменные со значениями в зависимости от IP-адреса клиента, используя предварительно скомпилированные базы данных <a href="http://www.maxmind.com">MaxMind</a> .
zh_cn: 所述 <code>ngx_stream_geoip_module</code> 模块（1.11.3），依赖于客户端的IP地址值，并使用预编译创建变量<a href="http://www.maxmind.com">的MaxMind</a>数据库。

source: The <code>ngx_stream_js_module</code> module is used to implement handlers in <a href="../njs/index">njs</a> &mdash; a subset of the JavaScript language.
es: El m&oacute;dulo <code>ngx_stream_js_module</code> se usa para implementar controladores en <a href="../njs/index">njs</a> , un subconjunto del lenguaje JavaScript.
ja: <code>ngx_stream_js_module</code> モジュールは、中のハンドラを実装するために使用される<a href="../njs/index">NJS</a> JavaScript言語のサブセットを- 。
ko: <code>ngx_stream_js_module</code> 모듈에서 핸들러를 구현하는 데 사용됩니다 <a href="../njs/index">NJS</a> 자바 스크립트 언어의 부분 집합을 -.
ru: Модуль <code>ngx_stream_js_module</code> используется для реализации обработчиков в <a href="../njs/index">njs</a> - подмножестве языка JavaScript.
zh_cn: 该 <code>ngx_stream_js_module</code> 模块用于实现处理器在<a href="../njs/index">NJS</a> - JavaScript语言的一个子集。

source: The <code>ngx_stream_keyval_module</code> module (1.13.7) creates variables with values taken from key-value pairs managed by the <a href="../http/ngx_http_api_module#stream_keyvals_">API</a>.
es: El m&oacute;dulo <code>ngx_stream_keyval_module</code> (1.13.7) crea variables con valores tomados de pares clave-valor administrados por la <a href="../http/ngx_http_api_module#stream_keyvals_">API</a> .
ja: <code>ngx_stream_keyval_module</code> モジュール（1.13.7）は、によって管理されるキーと値のペアから取られた値を持つ変数を作成<a href="../http/ngx_http_api_module#stream_keyvals_">APIを</a>。
ko: <code>ngx_stream_keyval_module</code> 의 모듈 (1.13.7)를 관리하여 키 - 값 쌍에서 촬영 변수 값 생성 <a href="../http/ngx_http_api_module#stream_keyvals_">API를</a> .
ru: Модуль <code>ngx_stream_keyval_module</code> (1.13.7) создает переменные со значениями, взятыми из пар ключ-значение, управляемых <a href="../http/ngx_http_api_module#stream_keyvals_">API</a> .
zh_cn: 所述 <code>ngx_stream_keyval_module</code> 模块（1.13.7）使用从被管理的键-值对获得的值的变量<a href="../http/ngx_http_api_module#stream_keyvals_">的API</a>。

source: The <code>ngx_stream_limit_conn_module</code> module (1.9.3) is used to limit the number of connections per the defined key, in particular, the number of connections from a single IP address.
es: El m&oacute;dulo <code>ngx_stream_limit_conn_module</code> (1.9.3) se utiliza para limitar el n&uacute;mero de conexiones por clave definida, en particular, el n&uacute;mero de conexiones desde una &uacute;nica direcci&oacute;n IP.
ja: <code>ngx_stream_limit_conn_module</code> モジュール（1.9.3）は、特に、単一のIPアドレスからの接続の数を定義されたキーごとの接続の数を制限するために使用されます。
ko: <code>ngx_stream_limit_conn_module</code> 의 모듈 (1.9.3)은 특히 정의 키당 연결의 수를 제한하는 데 사용되며, 하나의 IP 어드레스로부터의 접속의 수.
ru: Модуль <code>ngx_stream_limit_conn_module</code> (1.9.3) используется для ограничения количества подключений на определенный ключ, в частности, количества подключений с одного IP-адреса.
zh_cn: 所述 <code>ngx_stream_limit_conn_module</code> 模块（1.9.3）被用于限制每个定义的键连接的数量，尤其是，从一个单一的IP地址的连接的数量。

source: The <code>ngx_stream_log_module</code> module (1.11.4) writes session logs in the specified format.
es: El m&oacute;dulo <code>ngx_stream_log_module</code> (1.11.4) escribe registros de sesi&oacute;n en el formato especificado.
ja: <code>ngx_stream_log_module</code> モジュール（1.11.4）は、指定された形式でセッションログを書き込みます。
ko: <code>ngx_stream_log_module</code> 모듈 (1.11.4) 지정된 형식으로 세션 로그를 기록합니다.
ru: Модуль <code>ngx_stream_log_module</code> (1.11.4) записывает журналы сеанса в указанном формате.
zh_cn: 所述 <code>ngx_stream_log_module</code> 模块（1.11.4）在指定的格式写入会话日志。

source: The <code>ngx_stream_map_module</code> module (1.11.2) creates variables whose values depend on values of other variables.
es: El m&oacute;dulo <code>ngx_stream_map_module</code> (1.11.2) crea variables cuyos valores dependen de los valores de otras variables.
ja: <code>ngx_stream_map_module</code> モジュール（1.11.2）は、その値が他の変数の値に依存する変数を作成します。
ko: <code>ngx_stream_map_module</code> 의 모듈 (1.11.2)는 그 값이 다른 변수의 값에 의존하는 변수를 생성한다.
ru: Модуль <code>ngx_stream_map_module</code> (1.11.2) создает переменные, значения которых зависят от значений других переменных.
zh_cn: 所述 <code>ngx_stream_map_module</code> 模块（1.11.2）创建变量，其值依赖于其它变量的值。
