Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/nginx/nginx.*.004.xlf
Languages: es, ja, ko, ru, zh_cn

source: Specifies the enabled ciphers. The ciphers are specified in the format understood by the OpenSSL library, for example:
ja: 有効な暗号化方式を指定します。暗号化方式は、OpenSSL ライブラリが理解する形式で指定します。
ru: Определяет включенные шифры.Шифры задаются в формате,понятном библиотеке OpenSSL,например:
zh_cn: 指定已启用的密码,密码以OpenSSL库理解的格式指定。密码器是以OpenSSL库理解的格式指定的,例如。

source: Specifies the log format, for example:
ja: ログの形式を指定します。
ru: Указывает,например,формат журнала:
zh_cn: 指定日志格式,例如。

source: Specifies the output format of a log. The value of the <code>$body_bytes_sent</code> variable is aggregated across all requests in a session. The values of all other variables available for logging correspond to the first request in a session.
ja: ログの出力形式を指定します。 <code>$body_bytes_sent</code> 変数の値は、セッション内のすべてのリクエストにわたって集計されます。ロギングに使用できる他のすべての変数の値は、セッションの最初のリクエストに対応しています。
ru: Задает выходной формат журнала. Значение переменной <code>$body_bytes_sent</code> агрегируется по всем запросам в сеансе. Значения всех других переменных, доступных для регистрации, соответствуют первому запросу в сеансе.
zh_cn: 指定日志的输出格​​式。 <code>$body_bytes_sent</code> 变量的值在会话中的所有请求中汇总。可用于记录的所有其他变量的值对应于会话中的第一个请求。

source: Standard <a href="https://tools.ietf.org/html/rfc3875#section-4.1">CGI environment variables</a> should be provided as SCGI headers, see the <code>scgi_params</code> file provided in the distribution:
ja: 標準の<a href="https://tools.ietf.org/html/rfc3875#section-4.1">CGI環境変数</a>はSCGIヘッダーとして提供する必要があります。配布物に含まれる <code>scgi_params</code> ファイルを参照してください。
ru: Стандартные <a href="https://tools.ietf.org/html/rfc3875#section-4.1">переменные среды CGI</a> должны быть предоставлены как заголовки SCGI, см. Файл <code>scgi_params</code> , предоставленный в дистрибутиве:
zh_cn: 标准<a href="https://tools.ietf.org/html/rfc3875#section-4.1">CGI环境变量</a>应作为SCGI标头提供，请参见分发中提供的 <code>scgi_params</code> 文件：

source: Standard <a href="https://tools.ietf.org/html/rfc3875#section-4.1">CGI environment variables</a> should be provided as uwsgi headers, see the <code>uwsgi_params</code> file provided in the distribution:
ja: 標準の<a href="https://tools.ietf.org/html/rfc3875#section-4.1">CGI環境変数</a>はuwsgiヘッダーとして提供する必要があります。ディストリビューションで提供されている <code>uwsgi_params</code> ファイルを参照してください。
ru: Стандартные <a href="https://tools.ietf.org/html/rfc3875#section-4.1">переменные среды CGI</a> должны быть предоставлены как заголовки uwsgi, см. Файл <code>uwsgi_params</code> , предоставленный в дистрибутиве:
zh_cn: 标准<a href="https://tools.ietf.org/html/rfc3875#section-4.1">CGI环境变量</a>应作为uwsgi标头提供，请参阅发行版中提供的 <code>uwsgi_params</code> 文件：

source: Start MSYS bash.
ja: MSYSのbashを起動します。
ru: Начните MSYS bash.
zh_cn: 启动MSYS bash。

source: Starting from 1.17.0, status information can be collected per <a href="ngx_http_core_module#location">location</a>. The special value <code>off</code> disables statistics collection in nested location blocks. Note that the statistics is collected in the context of a location where processing ends. It may be different from the original location, if an <a href="ngx_http_core_module#internal">internal redirect</a> happens during request processing.
ja: 1.17.0以降、ステータス情報は<a href="ngx_http_core_module#location">場所</a>ごとに収集できます。特別な値 <code>off</code> は、ネストされたロケーションブロックでの統計収集を無効にします。統計は、処理が終了する場所のコンテキストで収集されることに注意してください。リクエストの処理中に<a href="ngx_http_core_module#internal">内部リダイレクト</a>が発生した場合、元の場所とは異なる場合があります。
zh_cn: 从1.17.0开始，可以按<a href="ngx_http_core_module#location">位置</a>收集状态信息。特殊值 <code>off</code> 禁用嵌套位置块中的统计信息收集。注意，统计是在处理结束的位置的上下文中收集的。如果在请求处理期间发生<a href="ngx_http_core_module#internal">内部重定向</a>，则该地址可能与原始位置不同。

source: Starting from nginx 0.8.12 and FreeBSD 5.2.1, <a href="#aio">aio</a> can be used to pre-load data for <code>sendfile()</code>:
ja: nginx 0.8.12およびFreeBSD 5.2.1以降では、<a href="#aio">aio</a>を使用して <code>sendfile()</code> のデータをプリロードできます。
ru: Начиная с nginx 0.8.12 и FreeBSD 5.2.1, <a href="#aio">aio</a> можно использовать для предварительной загрузки данных для <code>sendfile()</code> :
zh_cn: 从nginx 0.8.12和FreeBSD 5.2.1开始，可以使用<a href="#aio">aio</a>来预加载 <code>sendfile()</code> 的数据：

source: Starting from version 0.8.42, it is possible to specify either a redirect URL (for codes 301, 302, 303, 307, and 308) or the response body <code><i>text</i></code> (for other codes). A response body text and redirect URL can contain variables. As a special case, a redirect URL can be specified as a URI local to this server, in which case the full redirect URL is formed according to the request scheme (<code>$scheme</code>) and the <a href="ngx_http_core_module#server_name_in_redirect">server_name_in_redirect</a> and <a href="ngx_http_core_module#port_in_redirect">port_in_redirect</a> directives.
ja: バージョン0.8.42以降、リダイレクトURL（コード301、302、303、307、および308の場合）または応答本文 <code><i>text</i></code> （他のコードの場合）のいずれかを指定できるようになりました。応答本文テキストとリダイレクトURLには変数を含めることができます。特殊なケースとして、リダイレクトURLをこのサーバーのローカルURIとして指定できます。その場合、完全なリダイレクトURLは、要求スキーム（ <code>$scheme</code> ）と<a href="ngx_http_core_module#server_name_in_redirect">server_name_in_redirect</a>および<a href="ngx_http_core_module#port_in_redirect">port_in_redirect</a>ディレクティブに従って形成されます。
ru: Начиная с версии 0.8.42, можно указать либо URL-адрес перенаправления (для кодов 301, 302, 303, 307 и 308), либо основной <code><i>text</i></code> ответа (для других кодов). Основной текст ответа и URL-адрес перенаправления могут содержать переменные. В особом случае, перенаправление URL - адрес может быть указан в качестве URI локального к этому серверу, и в этом случае формируются полный URL переадресации согласно схеме запроса ( <code>$scheme</code> ) и <a href="ngx_http_core_module#server_name_in_redirect">server_name_in_redirect</a> и <a href="ngx_http_core_module#port_in_redirect">port_in_redirect</a> директив.
zh_cn: 从版本0.8.42开始，可以指定重定向URL（对于代码301、302、303、307和308）或响应正文 <code><i>text</i></code> （对于其他代码）。响应正文和重定向URL可以包含变量。作为一种特殊情况，可以将重定向URL指定为该服务器本地的URI，在这种情况下，将根据请求方案（ <code>$scheme</code> ）以及<a href="ngx_http_core_module#server_name_in_redirect">server_name_in_redirect</a>和<a href="ngx_http_core_module#port_in_redirect">port_in_redirect</a>指令来形成完整的重定向URL 。

source: Starting, Stopping, and Reloading Configuration
ja: 設定の起動、停止、およびリロード
ru: Запуск,остановка и перезагрузка Конфигурация
zh_cn: 启动、停止和重新加载配置

source: Starting, stopping, removing a cluster node
ja: クラスタノードの起動、停止、削除
ru: Запуск,остановка,удаление узла кластера...
zh_cn: 启动、停止、移除群集节点。

source: Static and global variables may be initialized on declaration:
ja: 静的変数とグローバル変数は、宣言時に初期化することができます。
ru: Статические и глобальные переменные могут быть инициализированы при объявлении:
zh_cn: 静态变量和全局变量可以在声明时初始化。

source: Statistics of DNS requests and responses per particular <a href="ngx_http_core_module#resolver_status_zone">resolver zone</a>.
ja: 特定の<a href="ngx_http_core_module#resolver_status_zone">リゾルバーゾーン</a>ごとのDNS要求と応答の統計。
zh_cn: 每个特定<a href="ngx_http_core_module#resolver_status_zone">解析器区域</a>的DNS请求和响应的统计信息。

source: Status data for memory slots (8, 16, 32, 64, 128, etc.)
ja: メモリスロット(8、16、32、64、128など)のステータスデータ
ru: Данные о состоянии для слотов памяти (8,16,32,64,128 и т.д.).
zh_cn: 存储器插槽的状态数据(8、16、32、64、128等)。

source: Stops processing and returns the specified <code><i>code</i></code> to a client. The non-standard code 444 closes a connection without sending a response header.
ja: 処理を停止し、指定された <code><i>code</i></code> をクライアントに返します。非標準コード444は、応答ヘッダーを送信せずに接続を閉じます。
ru: Останавливает обработку и возвращает указанный <code><i>code</i></code> клиенту. Нестандартный код 444 закрывает соединение без отправки заголовка ответа.
zh_cn: 停止处理并将指定的 <code><i>code</i></code> 返回给客户端。非标准代码444关闭连接而不发送响应头。

source: Stops processing the current set of <code>ngx_http_rewrite_module</code> directives.
ja: <code>ngx_http_rewrite_module</code> ディレクティブの現在のセットの処理を停止します。
ru: Останавливает обработку текущего набора директив <code>ngx_http_rewrite_module</code> .
zh_cn: 停止处理当前的 <code>ngx_http_rewrite_module</code> 指令集。

source: Stream Connections Limiting:
ja: 流れの接続が制限されている。
zh_cn: 流连接限制。

source: Stream Keyval Shared Memory Zone:
ja: ストリームキーバル共有メモリゾーン。
ru: Зона общей памяти Stream Keyval:
zh_cn: 流Keyval共享内存区。

source: Stream Server Zone:
ja: ストリームサーバーゾーン。
ru: Серверная зона Stream:
zh_cn: 流服务器区。

source: Stream Session
ja: ストリームセッション
ru: Сессия по течению
zh_cn: 流会

source: Stream Upstream Server:
ja: ストリームアップストリームサーバー。
ru: Сервер потоковой передачи:
zh_cn: 流上行服务器。

source: Stream Upstream:
ja: 上流に流れます。
ru: Поток вверх по течению:
zh_cn: 流上游。

source: Stream Zone Sync Node:
ja: ストリームゾーン同期ノード。
zh_cn: 流区同步节点。

source: Stream code should include
ja: ストリームコードには
ru: Код потока должен включать
zh_cn: 流代码应包括

source: Strings are matched ignoring the case.
ja: 文字列は大文字小文字を無視してマッチします。
ru: Строки сопоставляются,игнорируя дело.
zh_cn: 字符串的匹配忽略了大小写。

source: Structure types are defined using <code>typedef</code>. Inside structures, member types and names are aligned:
ja: 構造型は <code>typedef</code> を使用して定義されます。内部構造では、メンバーのタイプと名前が調整されています
ru: Типы структуры определяются с помощью <code>typedef</code> . Внутри структур типы членов и имена выровнены:
zh_cn: 结构类型是使用 <code>typedef</code> 定义的。内部结构，成员类型和名称对齐：

source: Subrequests Chaining
ja: サブリクエストのチェイニング
zh_cn: 子请求链

source: Subrequests are normally created in a body filter, in which case their output can be treated like the output from any explicit request. This means that eventually the output of a subrequest is sent to the client, after all explicit buffers that are passed before subrequest creation and before any buffers that are passed after creation. This ordering is preserved even for large hierarchies of subrequests. The following example inserts output from a subrequest after all request data buffers, but before the final buffer with the <code>last_buf</code> flag.
ja: サブリクエストは通常​​、ボディフィルターで作成されます。その場合、それらの出力は、明示的なリクエストからの出力のように扱うことができます。つまり、サブリクエストの出力は、サブリクエストの作成前に渡されたすべての明示的なバッファの後で、作成後に渡されるバッファの前に、クライアントに送信されます。この順序は、サブリクエストの大きな階層でも保持されます。次の例では、すべてのリクエストデータバッファーの後で、 <code>last_buf</code> フラグを使用して最終バッファーの前に、サブリクエストからの出力を挿入します。
ru: Подзапросы обычно создаются в фильтре тела, и в этом случае их вывод можно рассматривать как вывод любого явного запроса. Это означает, что в конечном итоге выходные данные подзапроса отправляются клиенту после всех явных буферов, которые передаются перед созданием подзапроса, и перед любыми буферами, которые передаются после создания. Этот порядок сохраняется даже для больших иерархий подзапросов. В следующем примере вывод подзапроса вставляется после всех буферов данных запроса, но перед последним буфером с флагом <code>last_buf</code> .
zh_cn: 子请求通常是在主体过滤器中创建的，在这种情况下，子请求的输出可以像任何显式请求的输出一样对待。这意味着，在创建子请求之前传递的所有显式缓冲区之后，以及在创建之后传递的任何缓冲区之前，最终将子请求的输出发送到客户端。即使对于较大的子请求层次结构，也保留此排序。下面的示例将子请求的输出插入所有请求数据缓冲区之后，但在带有 <code>last_buf</code> 标志的最终缓冲区之前。

source: Subrequests are primarily used to insert output of one request into another, possibly mixed with other data. A subrequest looks like a normal request, but shares some data with its parent. In particular, all fields related to client input are shared because a subrequest does not receive any other input from the client. The request field <code>parent</code> for a subrequest contains a link to its parent request and is NULL for the main request. The field <code>main</code> contains a link to the main request in a group of requests.
ja: サブリクエストは主に、あるリクエストの出力を別のリクエストに挿入するために使用され、他のデータと混合される可能性があります。サブリクエストは通常​​のリクエストのように見えますが、親と一部のデータを共有します。特に、サブリクエストはクライアントから他の入力を受信しないため、クライアント入力に関連するすべてのフィールドが共有されます。サブリクエストの <code>parent</code> であるリクエストフィールドには、その親リクエストへのリンクが含まれており、メインリクエストではNULLです。フィールド <code>main</code> には、リクエストのグループ内のメインリクエストへのリンクが含まれています。
ru: Подзапросы в основном используются для вставки вывода одного запроса в другой, возможно, смешанного с другими данными. Подзапрос выглядит как обычный запрос, но передает некоторые данные своему родительскому объекту. В частности, все поля, относящиеся к вводу клиента, являются общими, потому что подзапрос не получает никаких других данных от клиента. <code>parent</code> поле запроса для подзапроса содержит ссылку на свой родительский запрос и имеет значение NULL для основного запроса. Поле <code>main</code> содержит ссылку на основной запрос в группе запросов.
zh_cn: 子请求主要用于将一个请求的输出插入到另一个请求中，并可能与其他数据混合。子请求看起来像普通请求，但与其父共享一些数据。特别是，共享所有与客户端输入有关的字段，因为子请求不会从客户端接收任何其他输入。子请求的 <code>parent</code> 请求字段包含指向其父请求的链接，主请求为NULL。 <code>main</code> 字段在一组请求中包含指向主要请求的链接。

source: Subrequests are related to the concept of active requests. A request <code>r</code> is considered active if <code>c-&gt;data == r</code>, where <code>c</code> is the client connection object. At any given point, only the active request in a request group is allowed to output its buffers to the client. An inactive request can still send its output to the filter chain, but it does not pass beyond the <code>ngx_http_postpone_filter</code> and remains buffered by that filter until the request becomes active. Here are some rules of request activation:
ja: サブリクエストは、アクティブなリクエストの概念に関連しています。 <code>c-&gt;data == r</code> 場合、リクエスト <code>r</code> はアクティブと見なされます。ここで、 <code>c</code> はクライアント接続オブジェクトです。どの時点でも、要求グループ内のアクティブな要求のみが、そのバッファーをクライアントに出力できます。非アクティブなリクエストは、その出力をフィルターチェーンに送信できますが、 <code>ngx_http_postpone_filter</code> を通過せず、リクエストがアクティブになるまでそのフィルターによってバッファーされたままになります。リクエストのアクティベーションのルールは次のとおりです。
ru: Подзапросы связаны с концепцией активных запросов. Запрос <code>r</code> считается активным, если <code>c-&gt;data == r</code> , где <code>c</code> - объект клиентского подключения. В любой момент только активный запрос в группе запросов может выводить свои буферы клиенту. Неактивный запрос все еще может отправлять свой вывод в цепочку фильтров, но он не выходит за пределы <code>ngx_http_postpone_filter</code> и остается в буфере этого фильтра, пока запрос не станет активным. Вот несколько правил активации запроса:
zh_cn: 子请求与活动请求的概念有关。如果 <code>c-&gt;data == r</code> ，则请求 <code>r</code> 被认为是活动的，其中 <code>c</code> 是客户端连接对象。在任何给定点，仅允许请求组中的活动请求将其缓冲区输出到客户端。无效的请求仍可以将其输出发送到过滤器链，但是它不会超出 <code>ngx_http_postpone_filter</code> 的范围，并一直由该过滤器缓冲，直到请求变为活动状态为止。以下是一些请求激活规则：

source: Such code can be transpiled: this means performing a number of transformations that rewrite newer language features in accordance with an older standard. For example, <a href="https://babeljs.io/"> babel</a> project can be used to this purpose.
ja: このようなコードはトランスパイルすることができます。これは、古い標準に従って新しい言語機能を書き換える多くの変換を実行することを意味します。たとえば、<a href="https://babeljs.io/">babel</a>プロジェクトはこの目的に使用できます。
zh_cn: 可以编译这样的代码：这意味着执行许多转换，以根据较旧的标准重写较新的语言功能。例如，可将<a href="https://babeljs.io/">babel</a>项目用于此目的。

source: Such names are called wildcard names.
ja: このような名前をワイルドカード名と呼びます。
ru: Такие имена называются подстановочными знаками.
zh_cn: 这样的名字叫做通配符名字。

source: Support for <code>SHA</code> scheme was added only to aid in migration from other web servers. It should not be used for new passwords, since unsalted SHA-1 hashing that it employs is vulnerable to <a href="http://en.wikipedia.org/wiki/Rainbow_attack">rainbow table</a> attacks.
ja: <code>SHA</code> スキームのサポートは、他のWebサーバーからの移行を支援するためにのみ追加されました。使用する無塩SHA-1ハッシュは<a href="http://en.wikipedia.org/wiki/Rainbow_attack">レインボーテーブル</a>攻撃に対して脆弱であるため、新しいパスワードには使用しないでください。
ru: Поддержка схемы <code>SHA</code> была добавлена ​​только для облегчения миграции с других веб-серверов. Его не следует использовать для новых паролей, так как несоленое хеширование SHA-1, которое он использует, уязвимо для атак с использованием <a href="http://en.wikipedia.org/wiki/Rainbow_attack">радужной таблицы</a> .
zh_cn: 添加了对 <code>SHA</code> 方案的支持，只是为了帮助从其他Web服务器进行迁移。不应将其用于新密码，因为它采用的未加盐SHA-1哈希很容易受到<a href="http://en.wikipedia.org/wiki/Rainbow_attack">彩虹表</a>攻击。

source: Supported methods:
ja: サポートされている方法。
ru: Поддерживаемые методы:
zh_cn: 支持的方法:

source: Symbolic links in the pathname are allowed and not checked. This is the default behavior.
ja: パス名のシンボリックリンクは許可され、チェックされません。これがデフォルトの動作です。
ru: Символические ссылки в каталоге разрешены и не проверяются.Это поведение по умолчанию.
zh_cn: 允许在路径名中使用符号链接,但不检查。这是默认行为。

source: Sync Zone:
ja: シンクゾーン。
zh_cn: 同步区。

source: Synchronization information per each shared memory zone.
ja: 各共有メモリゾーンごとの同期情報。
ru: Информация о синхронизации для каждой общей зоны памяти.
zh_cn: 每个共享内存区的同步信息。

source: Synchronization information per node in a cluster.
ja: クラスタ内のノードごとの同期情報。
ru: Информация о синхронизации для каждого узла в кластере.
zh_cn: 集群中每个节点的同步信息。

source: Synchronization status of a shared memory zone.
ja: 共有メモリゾーンの同期状態。
ru: Состояние синхронизации разделяемой зоны памяти.
zh_cn: 共享内存区的同步状态。

source: Synchronously appends specified <code>data</code> to a file with provided <code>filename</code>. If the file does not exist, it will be created. The <code>options</code> parameter is expected to be an object with the following keys:
ja: 指定されたファイル <code>filename</code> ファイルに指定された <code>data</code> を同期的に追加します。ファイルが存在しない場合は作成されます。 <code>options</code> パラメータは、以下のキーを持つオブジェクトであることが予想されます。
ru: Синхронно добавляет указанные <code>data</code> в файл с указанным <code>filename</code> . Если файл не существует, он будет создан. Ожидается <code>options</code> параметр options будет объектом со следующими ключами:
zh_cn: 将指定的 <code>data</code> 同步追加到具有提供的 <code>filename</code> 的文件中。如果文件不存在，将创建它。该 <code>options</code> 参数预计将使用下列按键的对象：

source: Synchronously appends specified <code>data</code> to a file with provided <code>filename</code>. The <code>data</code> is expected to be a string or a Buffer object (<a href="changes#njs0.4.4">0.4.4</a>). If the file does not exist, it will be created. The <code>options</code> parameter is expected to be an object with the following keys:
ja: 指定された <code>data</code> を、指定されたファイル <code>filename</code> ファイルに同期的に追加します。 <code>data</code> 文字列またはバッファオブジェクト（ことが期待される<a href="changes#njs0.4.4">0.4.4</a>）。ファイルが存在しない場合は作成されます。 <code>options</code> パラメータは、以下のキーを持つオブジェクトであることが予想されます。
zh_cn: 将指定的 <code>data</code> 同步追加到具有提供的 <code>filename</code> 的文件中。该 <code>data</code> 应为字符串或Buffer对象（<a href="changes#njs0.4.4">0.4.4</a>）。如果文件不存在，将创建它。该 <code>options</code> 参数预计将使用下列按键的对象：

source: Synchronously changes the name or location of a file from <code>oldPath</code> to <code>newPath</code> (<a href="changes#njs0.3.4">0.3.4</a>).
ja: ファイルの名前または場所を <code>oldPath</code> から <code>newPath</code> （0.3.4）に同期的に変更し<a href="changes#njs0.3.4">ます</a>。
zh_cn: 将文件的名称或位置从 <code>oldPath</code> 同步更改为 <code>newPath</code> （<a href="changes#njs0.3.4">0.3.4</a>）。

source: Synchronously computes the canonical pathname by resolving <code>.</code>, <code>..</code> and symbolic links using <a href="http://man7.org/linux/man-pages/man3/realpath.3.html">realpath(3)</a>. The <code>options</code> argument can be a string specifying an encoding, or an object with an encoding property specifying the character encoding to use for the path passed to the callback (<a href="changes#njs0.3.9">0.3.9</a>).
ja: を解決することにより、正規のパス名を同期的に計算し <code>.</code> 、 <code>..</code> および<a href="http://man7.org/linux/man-pages/man3/realpath.3.html">realpath（3）</a>を使用したシンボリックリンク。 <code>options</code> 引数は、符号化、またはコールバック（に渡されるパスに使用する文字エンコーディングを指定するエンコーディングプロパティを持つオブジェクトを指定する文字列であってもよい<a href="changes#njs0.3.9">0.3.9を</a>）。
zh_cn: 通过解析同步计算规范路径名 <code>.</code> ， <code>..</code> 和使用<a href="http://man7.org/linux/man-pages/man3/realpath.3.html">realpath（3）的</a>符号链接。该 <code>options</code> 参数可以是指定的编码，或用编码属性指定编码以用于传递给回调（路径中的人物的对象的字符串<a href="changes#njs0.3.9">0.3.9</a>）。

source: Synchronously creates a directory at the specified <code>path</code> (<a href="changes#njs0.4.2">0.4.2</a>). The <code>options</code> parameter is expected to be an <code>integer</code> that specifies the <a href="#fs_mkdirsync_mode">mode</a>, or an object with the following keys:
ja: 指定された <code>path</code> （<a href="changes#njs0.4.2">0.4.2</a>）にディレクトリを同期的に作成します。 <code>options</code> であることが期待されるパラメータ <code>integer</code> 指定<a href="#fs_mkdirsync_mode">モード</a>、または以下のキーを持つオブジェクトを：
zh_cn: 在指定 <code>path</code> （<a href="changes#njs0.4.2">0.4.2</a>）同步创建目录。该 <code>options</code> 参数预期为一个 <code>integer</code> ，指定<a href="#fs_mkdirsync_mode">模式</a>，或与下列键的对象：

source: Synchronously creates the link called <code>path</code> pointing to <code>target</code> using <a href="http://man7.org/linux/man-pages/man2/symlink.2.html">symlink(2)</a> (<a href="changes#njs0.3.9">0.3.9</a>). Relative targets are relative to the link&rsquo;s parent directory.
ja: <a href="http://man7.org/linux/man-pages/man2/symlink.2.html">symlink（2）</a>（<a href="changes#njs0.3.9">0.3.9</a>）を使用して、 <code>target</code> を指す <code>path</code> と呼ばれるリンクを同期的に作成します。相対ターゲットは、リンクの親ディレクトリを基準にしています。
zh_cn: 同步创建称为链路 <code>path</code> 指向 <code>target</code> 使用<a href="http://man7.org/linux/man-pages/man2/symlink.2.html">符号链接（2） </a>（<a href="changes#njs0.3.9">0.3.9</a>）。相对目标相对于链接的父目录。

source: Synchronously reads the contents of a directory at the specified <code>path</code> (<a href="changes#njs0.4.2">0.4.2</a>). The <code>options</code> parameter is expected to be a string that specifies <a href="#fs_readdirsync_encoding">encoding</a> or an object with the following keys:
ja: 指定された <code>path</code> （<a href="changes#njs0.4.2">0.4.2</a>）にあるディレクトリの内容を同期的に読み取ります。 <code>options</code> パラメータが指定をする文字列であることが期待される<a href="#fs_readdirsync_encoding">エンコード</a>または以下のキーを持つオブジェクト：
zh_cn: 同步读取指定 <code>path</code> （<a href="changes#njs0.4.2">0.4.2</a>）上目录的内容。该 <code>options</code> 参数预计是一个字符串，它指定<a href="#fs_readdirsync_encoding">编码</a>或与下列键的对象：

source: Synchronously removes a directory at the specified <code>path</code> (<a href="changes#njs0.4.2">0.4.2</a>).
ja: 指定された <code>path</code> （<a href="changes#njs0.4.2">0.4.2</a>）のディレクトリを同期的に削除します。
zh_cn: 同步删除指定 <code>path</code> （<a href="changes#njs0.4.2">0.4.2</a>）上的目录。

source: Synchronously returns the contents of the file with provided <code>filename</code>. The <code>options</code> parameter holds <code>string</code> that specifies encoding. If an encoding is specified, a string is returned, otherwise, a Buffer object (<a href="changes#njs0.4.4">0.4.4</a>) is returned.
ja: 指定された <code>filename</code> 持つファイルの内容を同期的に返します。 <code>options</code> パラメータが保持している <code>string</code> を指定でエンコードすることを。エンコーディングが指定されている場合は文字列が返され、指定されていない場合はBufferオブジェクト（<a href="changes#njs0.4.4">0.4.4</a>）が返されます。
zh_cn: 同步返回文件 <code>filename</code> 和提供的filename的内容。该 <code>options</code> 参数包含 <code>string</code> 指定编码。如果指定了编码，则返回字符串，否则，返回Buffer对象（<a href="changes#njs0.4.4">0.4.4</a>）。

source: Synchronously returns the contents of the file with provided <code>filename</code>. The <code>options</code> parameter holds <code>string</code> that specifies encoding. If not specified, a <a href="#string_tobytes">byte string</a> is returned. If <code>utf8</code> encoding is specified, a Unicode string is returned. Otherwise, <code>options</code> is expected to be an object with the following keys:
ja: 指定された <code>filename</code> でファイルのコンテンツを同期的に返します。 <code>options</code> パラメータが保持している <code>string</code> を指定でエンコードすることを。指定しない場合、<a href="#string_tobytes">バイト文字列</a>が返されます。場合 <code>utf8</code> エンコーディングが指定されている、Unicode文字列が返されます。それ以外の場合、 <code>options</code> は次のキーを持つオブジェクトであると想定されます。
ru: Синхронно возвращает содержимое файла с указанным <code>filename</code> . Параметр <code>options</code> содержит <code>string</code> , определяющую кодировку. Если не указано, возвращается <a href="#string_tobytes">байтовая строка</a> . Если указана кодировка <code>utf8</code> , возвращается строка Unicode. В противном случае ожидается , что <code>options</code> будут объектом со следующими ключами:
zh_cn: 同步返回具有提供的 <code>filename</code> 的文件内容。该 <code>options</code> 参数包含 <code>string</code> 指定编码。如果未指定，则返回<a href="#string_tobytes">字节字符串</a>。如果指定 <code>utf8</code> 编码，则返回Unicode字符串。否则， <code>options</code> 应该是具有以下键的对象：
