Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/nginx/nginx.*.004.xlf
Languages: es, ja, ko, ru, zh_cn

source: Returns the part of the string of the specified <code>length</code> from <code>start</code> or from <code>start</code> to the end of the string.
ja: 指定された文字列の一部を返します <code>length</code> から <code>start</code> またはからの <code>start</code> 文字列の末尾に。
ru: Возвращает часть строки указанной <code>length</code> от <code>start</code> или от <code>start</code> до конца строки.
zh_cn: 返回指定的字符串的一部分 <code>length</code> 从 <code>start</code> 或从 <code>start</code> 到字符串的末尾。

source: Returns the position of the first occurrence of the <code>searchString</code>. The search is started at <code>fromIndex</code>. Returns <code><i>-1</i></code> if the value is not found. The <code>fromIndex</code> is an integer, default value is 0. If <code>fromIndex</code> is lower than 0 or greater than <a href="#string_length">String.prototype.length</a>, the search starts at index <code><i>0</i></code> and <code><i>String.prototype.length</i></code>.
ja: <code>searchString</code> が最初に出現する位置を返します。検索は <code>fromIndex</code> から開始されます。値が見つからない場合は <code><i>-1</i></code> を返します。 <code>fromIndex</code> のは、デフォルト値は0である場合は、整数である <code>fromIndex</code> の場合よりも0よりも低い以上で<a href="#string_length">String.prototype.length</a>、検索インデックスで始まり <code><i>0</i></code> と <code><i>String.prototype.length</i></code> 。
ru: Возвращает позицию первого вхождения <code>searchString</code> . Поиск начинается с <code>fromIndex</code> . Возвращает <code><i>-1</i></code> , если значение не найдено. <code>fromIndex</code> представляет собой целое число, значение по умолчанию равно 0. Если <code>fromIndex</code> ниже , чем 0 или больше <a href="#string_length">String.prototype.length</a> , поиск начинается с индекса <code><i>0</i></code> и <code><i>String.prototype.length</i></code> .
zh_cn: 返回 <code>searchString</code> 第一次出现的位置。搜索从 <code>fromIndex</code> 开始。如果找不到该值，则返回 <code><i>-1</i></code> 。所述 <code>fromIndex</code> 是一个整数，默认值为0。如果 <code>fromIndex</code> 比低于0或更大<a href="#string_length">String.prototype.length</a>，搜索开始于索引 <code><i>0</i></code> 和 <code><i>String.prototype.length</i></code> 。

source: Returns the position of the last occurrence of the <code>searchString</code>, searching backwards from <code>fromIndex</code>. Returns <code><i>-1</i></code> if the value is not found. If <code>searchString</code> is empty, then <code>fromIndex</code> is returned.
ja: 戻り値の最後に出現する位置 <code>searchString</code> から逆方向に検索、 <code>fromIndex</code> の。値が見つからない場合は <code><i>-1</i></code> を返します。場合 <code>searchString</code> のが空である場合、 <code>fromIndex</code> のが返されます。
ru: Возвращает позицию последнего вхождения <code>searchString</code> с поиском в обратном направлении от <code>fromIndex</code> . Возвращает <code><i>-1</i></code> , если значение не найдено. Если <code>searchString</code> пуста, возвращается <code>fromIndex</code> .
zh_cn: 返回最后一次出现的 <code>searchString</code> 的位置，从 <code>fromIndex</code> 向后搜索。如果找不到该值，则返回 <code><i>-1</i></code> 。如果 <code>searchString</code> 为空，则返回 <code>fromIndex</code> 。

source: Reverse proxy implementation in nginx includes in-band (or passive) server health checks. If the response from a particular server fails with an error, nginx will mark this server as failed, and will try to avoid selecting this server for subsequent inbound requests for a while.
ja: nginx のリバースプロキシの実装には、インバンド(またはパッシブ)サーバーのヘルスチェックが含まれています。特定のサーバからのレスポンスがエラーで失敗した場合、nginx はこのサーバを失敗したものとしてマークし、しばらくの間、以降のインバウンドリクエストでこのサーバを選択しないようにします。
ru: Реализация обратного прокси в nginx включает внутриполосную (или пассивную)проверку работоспособности сервера.Если в ответе с определенного сервера возникнет ошибка,то nginx пометит этот сервер как неудавшийся и постарается на некоторое время избежать выбора этого сервера для последующих входящих запросов.
zh_cn: nginx中的反向代理实现包括带内(或被动)服务器健康检查。如果某台服务器的响应出现错误,nginx会将这台服务器标记为失败,并会暂时避免选择这台服务器进行后续的入站请求。

source: Reverse proxy implementation in nginx includes load balancing for HTTP, HTTPS, FastCGI, uwsgi, SCGI, memcached, and gRPC.
ja: nginx でのリバースプロキシの実装には、HTTP、HTTPS、FastCGI、uwsgi、SCGI、memcached、gRPC のロードバランシングが含まれています。
ru: Реализация обратного прокси в nginx включает балансировку нагрузки для HTTP,HTTPS,FastCGI,uwsgi,SCGI,memcached и gRPC.
zh_cn: nginx中的反向代理实现包括HTTP、HTTPS、FastCGI、uwsgi、SCGI、memcached和gRPC的负载均衡。

source: Rotating Log-files
ja: ログファイルの回転
ru: Вращающиеся лог-файлы
zh_cn: 旋转日志文件

source: Run configure script:
ja: configureスクリプトを実行します。
ru: Запустите скрипт настройки:
zh_cn: 运行配置脚本。

source: Run make:
ja: 走れ
ru: Бегите:
zh_cn: 运行使。

source: Run the <code>tasklist</code> command-line utility to see nginx processes:
ja: <code>tasklist</code> コマンドラインユーティリティを実行して、nginxプロセスを確認します。
ru: Запустите <code>tasklist</code> утилиту командной строки , чтобы увидеть Nginx процессы:
zh_cn: 运行 <code>tasklist</code> 命令行实用程序以查看nginx进程：

source: Running as a service.
ja: サービスとして実行されています。
ru: Работает как служба.
zh_cn: 作为服务运行。

source: SCGI and uwsgi protocols do not have a notion of keepalive connections.
ja: SCGI と uwsgi プロトコルには keepalive 接続の概念がありません。
ru: Протоколы SCGI и uwsgi не имеют понятия keepalive-соединений.
zh_cn: SCGI和uwsgi协议没有keepalive连接的概念。

source: SNI has been supported since 0.5.23.
ja: SNIは0.5.23からサポートされています。
ru: SNI поддерживается с версии 0.5.23.
zh_cn: 从0.5.23开始支持SNI。

source: SPDY protocol version for SPDY connections, or an empty string otherwise;
ja: SPDY 接続の場合は SPDY プロトコルのバージョン、そうでない場合は空文字列。
ru: Версия протокола SPDY для соединений SPDY,или пустая строка в противном случае;
zh_cn: 用于SPDY连接的SPDY协议版本,否则为空字符串。

source: SSI Commands
ja: SSIコマンド
ru: команды SSI
zh_cn: SSI命令

source: SSI commands have the following generic format:
ja: SSI コマンドには、以下のような汎用的なフォーマットがあります。
ru: SSI команды имеют следующий общий формат:
zh_cn: SSI 命令具有以下通用格式。

source: SSL certificate chains
ja: SSL証明書チェーン
ru: цепочки сертификатов SSL
zh_cn: SSL证书链

source: SSL operations consume extra CPU resources. On multi-processor systems several <a href="../ngx_core_module#worker_processes">worker processes</a> should be run, no less than the number of available CPU cores. The most CPU-intensive operation is the SSL handshake. There are two ways to minimize the number of these operations per client: the first is by enabling <a href="ngx_http_core_module#keepalive_timeout">keepalive</a> connections to send several requests via one connection and the second is to reuse SSL session parameters to avoid SSL handshakes for parallel and subsequent connections. The sessions are stored in an SSL session cache shared between workers and configured by the <a href="ngx_http_ssl_module#ssl_session_cache">ssl_session_cache</a> directive. One megabyte of the cache contains about 4000 sessions. The default cache timeout is 5 minutes. It can be increased by using the <a href="ngx_http_ssl_module#ssl_session_timeout">ssl_session_timeout</a> directive. Here is a sample configuration optimized for a multi-core system with 10 megabyte shared session cache:
ja: SSL操作は追加のCPUリソースを消費します。マルチプロセッサシステムでは、使用可能なCPUコアの数以上のいくつかの<a href="../ngx_core_module#worker_processes">ワーカープロセス</a>を実行する必要があります。最もCPUを集中的に使用する操作は、SSLハンドシェイクです。クライアントごとのこれらの操作の数を最小限に抑える方法は2つあります。1つは<a href="ngx_http_core_module#keepalive_timeout">キープアライブ</a>接続で1つの接続を介して複数のリクエストを送信できるようにする方法で、もう1つはSSLセッションパラメータを再利用して、並列接続と後続の接続でSSLハンドシェイクを回避する方法です。セッションは、ワーカー間で共有され、<a href="ngx_http_ssl_module#ssl_session_cache">ssl_session_cache</a>ディレクティブによって構成されたSSLセッションキャッシュに保存されます。キャッシュの1メガバイトには、約4000セッションが含まれます。デフォルトのキャッシュタイムアウトは5分です。これは、<a href="ngx_http_ssl_module#ssl_session_timeout">ssl_session_timeout</a>ディレクティブ。以下は、10メガバイトの共有セッションキャッシュを備えたマルチコアシステム用に最適化されたサンプル構成です。
ru: Операции SSL потребляют дополнительные ресурсы ЦП. В многопроцессорных системах должно быть запущено несколько <a href="../ngx_core_module#worker_processes">рабочих процессов</a> , не меньше количества доступных ядер ЦП. Самой интенсивной операцией с использованием ЦП является квитирование SSL. Существует два способа минимизировать количество этих операций для каждого клиента: первый - разрешить соединениям <a href="ngx_http_core_module#keepalive_timeout">keepalive</a> для отправки нескольких запросов через одно соединение, а второй - повторно использовать параметры сеанса SSL, чтобы избежать квитирования SSL для параллельных и последующих соединений. Сеансы хранятся в кэше сеансов SSL, совместно используемом работниками и настраиваемом директивой <a href="ngx_http_ssl_module#ssl_session_cache">ssl_session_cache</a> . Один мегабайт кеша содержит около 4000 сессий. Таймаут кеширования по умолчанию составляет 5 минут. Его можно увеличить, используя<a href="ngx_http_ssl_module#ssl_session_timeout">ssl_session_timeout</a> . Вот пример конфигурации, оптимизированной для многоядерной системы с 10-мегабайтным общим кешем сеанса:
zh_cn: SSL操作会消耗额外的CPU资源。在多处理器系统上，应运行多个<a href="../ngx_core_module#worker_processes">工作进程</a>，不少于可用CPU内核的数量。最耗CPU的操作是SSL握手。有两种方法可以最大程度地减少每个客户端的这些操作数量：第一种方法是通过启用<a href="ngx_http_core_module#keepalive_timeout">keepalive</a>连接来通过一个连接发送多个请求，第二种方法是重用SSL会话参数，以避免并行和后续连接的SSL握手。这些会话存储在工作进程之间共享的SSL会话缓存中，并由<a href="ngx_http_ssl_module#ssl_session_cache">ssl_session_cache</a>指令进行配置。一兆字节的缓存包含大约4000个会话。默认的缓存超时为5分钟。可以通过使用<a href="ngx_http_ssl_module#ssl_session_timeout">ssl_session_timeout</a>指令。这是针对具有10 MB共享会话缓存的多核系统进行优化的示例配置：

source: Same as the &ldquo;<code>address</code>&rdquo; parameter of the <a href="ngx_http_upstream_module#server">http</a> or <a href="../stream/ngx_stream_upstream_module#server">stream</a> upstream server.
ja: <a href="ngx_http_upstream_module#server">http</a>または<a href="../stream/ngx_stream_upstream_module#server">ストリームの</a>上流サーバーの「 <code>address</code> 」パラメーターと同じです。
ru: То же, что и параметр &laquo; <code>address</code> &raquo; восходящего <a href="ngx_http_upstream_module#server">http</a> или <a href="../stream/ngx_stream_upstream_module#server">потокового</a> сервера.
zh_cn: 与<a href="ngx_http_upstream_module#server">http</a>或<a href="../stream/ngx_stream_upstream_module#server">流</a>上游服务器的&ldquo; <code>address</code> &rdquo;参数相同。

source: Same as the &ldquo;<code>down</code>&rdquo; parameter of the <a href="ngx_http_upstream_module#down">http</a> or <a href="../stream/ngx_stream_upstream_module#down">stream</a> upstream server.
ja: <a href="ngx_http_upstream_module#down">http</a>または<a href="../stream/ngx_stream_upstream_module#down">ストリームの</a>上流サーバーの「 <code>down</code> 」パラメーターと同じです。
ru: То же, что и параметр &laquo; <code>down</code> &raquo; восходящего <a href="ngx_http_upstream_module#down">HTTP-</a> или <a href="../stream/ngx_stream_upstream_module#down">потокового</a> сервера.
zh_cn: 与<a href="ngx_http_upstream_module#down">http</a>或<a href="../stream/ngx_stream_upstream_module#down">流</a>上游服务器的&ldquo; <code>down</code> &rdquo;参数相同。

source: Same as the &ldquo;<code>fail_timeout</code>&rdquo; parameter of the <a href="ngx_http_upstream_module#fail_timeout">http</a> or <a href="../stream/ngx_stream_upstream_module#fail_timeout">stream</a> upstream server.
ja: <a href="ngx_http_upstream_module#fail_timeout">http</a>または<a href="../stream/ngx_stream_upstream_module#fail_timeout">ストリームの</a>上流サーバーの「 <code>fail_timeout</code> 」パラメーターと同じです。
ru: То же, что параметр &laquo; <code>fail_timeout</code> &raquo; восходящего сервера <a href="ngx_http_upstream_module#fail_timeout">http</a> или <a href="../stream/ngx_stream_upstream_module#fail_timeout">потока</a> .
zh_cn: 与<a href="ngx_http_upstream_module#fail_timeout">http</a>或<a href="../stream/ngx_stream_upstream_module#fail_timeout">流</a>上游服务器的&ldquo; <code>fail_timeout</code> &rdquo;参数相同。

source: Same as the &ldquo;<code>max_conns</code>&rdquo; parameter of the <a href="ngx_http_upstream_module#max_conns">http</a> or <a href="../stream/ngx_stream_upstream_module#max_conns">stream</a> upstream server.
ja: <a href="ngx_http_upstream_module#max_conns">http</a>または<a href="../stream/ngx_stream_upstream_module#max_conns">ストリームの</a>上流サーバーの「 <code>max_conns</code> 」パラメーターと同じです。
ru: То же, что параметр &laquo; <code>max_conns</code> &raquo; восходящего сервера <a href="ngx_http_upstream_module#max_conns">http</a> или <a href="../stream/ngx_stream_upstream_module#max_conns">потока</a> .
zh_cn: 与<a href="ngx_http_upstream_module#max_conns">http</a>或<a href="../stream/ngx_stream_upstream_module#max_conns">流</a>上游服务器的&ldquo; <code>max_conns</code> &rdquo;参数相同。

source: Same as the &ldquo;<code>max_fails</code>&rdquo; parameter of the <a href="ngx_http_upstream_module#max_fails">http</a> or <a href="../stream/ngx_stream_upstream_module#max_fails">stream</a> upstream server.
ja: <a href="ngx_http_upstream_module#max_fails">http</a>または<a href="../stream/ngx_stream_upstream_module#max_fails">ストリームの</a>上流サーバーの「 <code>max_fails</code> 」パラメーターと同じです。
ru: То же, что &laquo; <code>max_fails</code> параметра&raquo; из <a href="ngx_http_upstream_module#max_fails">HTTP</a> или <a href="../stream/ngx_stream_upstream_module#max_fails">потоковой</a> вышестоящего сервера.
zh_cn: 与<a href="ngx_http_upstream_module#max_fails">http</a>或<a href="../stream/ngx_stream_upstream_module#max_fails">流</a>上游服务器的&ldquo; <code>max_fails</code> &rdquo;参数相同。

source: Same as the &ldquo;<code>route</code>&rdquo; parameter of the <a href="ngx_http_upstream_module#route">http</a> upstream server.
ja: <a href="ngx_http_upstream_module#route">http</a>アップストリームサーバーの「 <code>route</code> 」パラメーターと同じです。
ru: То же, что параметр &laquo; <code>route</code> &raquo; восходящего <a href="ngx_http_upstream_module#route">HTTP-</a> сервера.
zh_cn: 与<a href="ngx_http_upstream_module#route">http</a>上游服务器的&ldquo; <code>route</code> &rdquo;参数相同。

source: Same as the &ldquo;<code>service</code>&rdquo; parameter of the <a href="ngx_http_upstream_module#service">http</a> or <a href="../stream/ngx_stream_upstream_module#service">stream</a> upstream server (1.9.13).
ja: <a href="ngx_http_upstream_module#service">http</a>または<a href="../stream/ngx_stream_upstream_module#service">ストリームの</a>上流サーバー（1.9.13）の「 <code>service</code> 」パラメーターと同じです。
ru: То же, что и параметр &laquo; <code>service</code> &raquo; восходящего <a href="ngx_http_upstream_module#service">http</a> или <a href="../stream/ngx_stream_upstream_module#service">потокового</a> сервера (1.9.13).
zh_cn: 与<a href="ngx_http_upstream_module#service">http</a>或<a href="../stream/ngx_stream_upstream_module#service">流</a>上游服务器（1.9.13）的&ldquo; <code>service</code> &rdquo;参数相同。

source: Same as the &ldquo;<code>slow_start</code>&rdquo; parameter of the <a href="ngx_http_upstream_module#slow_start">http</a> or <a href="../stream/ngx_stream_upstream_module#slow_start">stream</a> upstream server.
ja: <a href="ngx_http_upstream_module#slow_start">http</a>または<a href="../stream/ngx_stream_upstream_module#slow_start">ストリームの</a>上流サーバーの「 <code>slow_start</code> 」パラメーターと同じです。
ru: То же, что &laquo; <code>slow_start</code> параметра&raquo; из <a href="ngx_http_upstream_module#slow_start">HTTP</a> или <a href="../stream/ngx_stream_upstream_module#slow_start">потока</a> вышестоящего сервера.
zh_cn: 与<a href="ngx_http_upstream_module#slow_start">http</a>或<a href="../stream/ngx_stream_upstream_module#slow_start">流</a>上游服务器的&ldquo; <code>slow_start</code> &rdquo;参数相同。

source: Same as the &ldquo;<code>weight</code>&rdquo; parameter of the <a href="ngx_http_upstream_module#weight">http</a> or <a href="../stream/ngx_stream_upstream_module#weight">stream</a> upstream server.
ja: <a href="ngx_http_upstream_module#weight">http</a>または<a href="../stream/ngx_stream_upstream_module#weight">ストリームの</a>上流サーバーの「 <code>weight</code> 」パラメーターと同じです。
ru: То же, что и параметр &laquo; <code>weight</code> &raquo; восходящего <a href="ngx_http_upstream_module#weight">HTTP-</a> или <a href="../stream/ngx_stream_upstream_module#weight">потокового</a> сервера.
zh_cn: 与<a href="ngx_http_upstream_module#weight">http</a>或<a href="../stream/ngx_stream_upstream_module#weight">流</a>上游服务器的&ldquo; <code>weight</code> &rdquo;参数相同。

source: Same as the <a href="../stream/ngx_stream_upstream_module#down">down</a> parameter of the stream upstream server.
ja: ストリームアップストリームサーバーの<a href="../stream/ngx_stream_upstream_module#down">ダウン</a>パラメータと同じです。
ru: То же, что и параметр <a href="../stream/ngx_stream_upstream_module#down">down</a> восходящего потокового сервера.
zh_cn: 与流上游服务器的<a href="../stream/ngx_stream_upstream_module#down">down</a>参数相同。

source: Same as the <a href="../stream/ngx_stream_upstream_module#fail_timeout">fail_timeout</a> parameter of the stream upstream server.
ja: ストリーム上流サーバーの<a href="../stream/ngx_stream_upstream_module#fail_timeout">fail_timeout</a>パラメーターと同じです。
ru: То же, что и параметр <a href="../stream/ngx_stream_upstream_module#fail_timeout">fail_timeout восходящего</a> потокового сервера.
zh_cn: 与流上游服务器的<a href="../stream/ngx_stream_upstream_module#fail_timeout">fail_timeout</a>参数相同。

source: Same as the <a href="../stream/ngx_stream_upstream_module#max_conns">max_conns</a> parameter of the stream upstream server.
ja: ストリーム上流サーバーの<a href="../stream/ngx_stream_upstream_module#max_conns">max_conns</a>パラメーターと同じです。
ru: То же, что и параметр <a href="../stream/ngx_stream_upstream_module#max_conns">max_conns</a> восходящего потокового сервера.
zh_cn: 与流上游服务器的<a href="../stream/ngx_stream_upstream_module#max_conns">max_conns</a>参数相同。

source: Same as the <a href="../stream/ngx_stream_upstream_module#max_fails">max_fails</a> parameter of the stream upstream server.
ja: ストリームアップストリームサーバーの<a href="../stream/ngx_stream_upstream_module#max_fails">max_fails</a>パラメーターと同じです。
ru: То же, что и параметр <a href="../stream/ngx_stream_upstream_module#max_fails">max_fails восходящего</a> потокового сервера.
zh_cn: 与流上游服务器的<a href="../stream/ngx_stream_upstream_module#max_fails">max_fails</a>参数相同。

source: Same as the <a href="../stream/ngx_stream_upstream_module#server">address</a> parameter of the stream upstream server. When adding a server, it is possible to specify it as a domain name. In this case, changes of the IP addresses that correspond to a domain name will be monitored and automatically applied to the upstream configuration without the need of restarting nginx. This requires the <a href="../stream/ngx_stream_core_module#resolver">resolver</a> directive in the &ldquo;<code>stream</code>&rdquo; block. See also the <a href="../stream/ngx_stream_upstream_module#resolve">resolve</a> parameter of the stream upstream server.
ja: ストリーム上流サーバーの<a href="../stream/ngx_stream_upstream_module#server">アドレス</a>パラメータと同じです。サーバーを追加するときに、ドメイン名として指定できます。この場合、ドメイン名に対応するIPアドレスの変更が監視され、nginxを再起動する必要なく、上流の構成に自動的に適用されます。これには、「 <code>stream</code> 」ブロックに<a href="../stream/ngx_stream_core_module#resolver">resolver</a>ディレクティブが必要です。ストリーム上流サーバーの<a href="../stream/ngx_stream_upstream_module#resolve">resolve</a>パラメーターも参照してください。
ru: То же, что и параметр <a href="../stream/ngx_stream_upstream_module#server">адреса</a> восходящего потокового сервера. При добавлении сервера можно указать его как доменное имя. В этом случае изменения IP-адресов, соответствующих доменному имени, будут отслеживаться и автоматически применяться к восходящей конфигурации без необходимости перезапуска nginx. Для этого требуется директива <a href="../stream/ngx_stream_core_module#resolver">преобразователя</a> в блоке &laquo; <code>stream</code> &raquo;. См. Также параметр <a href="../stream/ngx_stream_upstream_module#resolve">разрешения</a> восходящего потокового сервера.
zh_cn: 与流上游服务器的<a href="../stream/ngx_stream_upstream_module#server">地址</a>参数相同。添加服务器时，可以将其指定为域名。在这种情况下，将监控与域名对应的IP地址的更改，并将其自动应用于上游配置，而无需重新启动nginx。这需要&ldquo; <code>stream</code> &rdquo;块中的<a href="../stream/ngx_stream_core_module#resolver">resolver</a>指令。另请参阅流上游服务器的<a href="../stream/ngx_stream_upstream_module#resolve">resolve</a>参数。

source: Same as the <a href="../stream/ngx_stream_upstream_module#service">service</a> parameter of the stream upstream server. This parameter cannot be changed.
ja: ストリーム上流サーバーの<a href="../stream/ngx_stream_upstream_module#service">サービス</a>パラメータと同じです。このパラメーターは変更できません。
ru: То же, что и <a href="../stream/ngx_stream_upstream_module#service">служебный</a> параметр восходящего потокового сервера. Этот параметр нельзя изменить.
zh_cn: 与流上游服务器的<a href="../stream/ngx_stream_upstream_module#service">服务</a>参数相同。此参数无法更改。

source: Same as the <a href="../stream/ngx_stream_upstream_module#slow_start">slow_start</a> parameter of the stream upstream server.
ja: ストリーム上流サーバーの<a href="../stream/ngx_stream_upstream_module#slow_start">slow_start</a>パラメーターと同じです。
ru: То же, что и параметр <a href="../stream/ngx_stream_upstream_module#slow_start">slow_start восходящего</a> потокового сервера.
zh_cn: 与流上游服务器的<a href="../stream/ngx_stream_upstream_module#slow_start">slow_start</a>参数相同。

source: Same as the <a href="../stream/ngx_stream_upstream_module#weight">weight</a> parameter of the stream upstream server.
ja: ストリーム上流サーバーの<a href="../stream/ngx_stream_upstream_module#weight">重み</a>パラメーターと同じです。
ru: То же, что и параметр <a href="../stream/ngx_stream_upstream_module#weight">веса</a> восходящего потокового сервера.
zh_cn: 与流上游服务器的<a href="../stream/ngx_stream_upstream_module#weight">weight</a>参数相同。

source: Same as the <a href="ngx_http_upstream_module#address">address</a> parameter of the HTTP upstream server. When adding a server, it is possible to specify it as a domain name. In this case, changes of the IP addresses that correspond to a domain name will be monitored and automatically applied to the upstream configuration without the need of restarting nginx. This requires the <a href="ngx_http_core_module#resolver">resolver</a> directive in the &ldquo;<code>http</code>&rdquo; block. See also the <a href="ngx_http_upstream_module#resolve">resolve</a> parameter of the HTTP upstream server.
ja: HTTPアップストリームサーバーの<a href="ngx_http_upstream_module#address">アドレス</a>パラメータと同じです。サーバーを追加するときに、ドメイン名として指定できます。この場合、ドメイン名に対応するIPアドレスの変更が監視され、nginxを再起動する必要なく、上流の構成に自動的に適用されます。これには、「 <code>http</code> 」ブロックに<a href="ngx_http_core_module#resolver">リゾルバー</a>ディレクティブが必要です。HTTPアップストリームサーバーの<a href="ngx_http_upstream_module#resolve">resolve</a>パラメータも参照してください。
ru: То же, что и параметр <a href="ngx_http_upstream_module#address">адреса</a> восходящего HTTP-сервера. При добавлении сервера можно указать его как доменное имя. В этом случае изменения IP-адресов, соответствующих доменному имени, будут отслеживаться и автоматически применяться к восходящей конфигурации без необходимости перезапуска nginx. Для этого требуется директива <a href="ngx_http_core_module#resolver">преобразователя</a> в блоке &laquo; <code>http</code> &raquo;. См. Также параметр <a href="ngx_http_upstream_module#resolve">разрешения</a> восходящего HTTP-сервера.
zh_cn: 与HTTP上游服务器的<a href="ngx_http_upstream_module#address">地址</a>参数相同。添加服务器时，可以将其指定为域名。在这种情况下，将监控与域名对应的IP地址的更改，并将其自动应用于上游配置，而无需重新启动nginx。这需要在&ldquo; <code>http</code> &rdquo;块中使用<a href="ngx_http_core_module#resolver">resolver</a>指令。另请参阅HTTP上游服务器的<a href="ngx_http_upstream_module#resolve">resolve</a>参数。

source: Same as the <a href="ngx_http_upstream_module#down">down</a> parameter of the HTTP upstream server.
ja: HTTPアップストリームサーバーの<a href="ngx_http_upstream_module#down">ダウン</a>パラメータと同じです。
ru: То же, что и параметр <a href="ngx_http_upstream_module#down">down</a> восходящего HTTP-сервера.
zh_cn: 与HTTP上游服务器的<a href="ngx_http_upstream_module#down">down</a>参数相同。

source: Same as the <a href="ngx_http_upstream_module#drain">drain</a> parameter of the HTTP upstream server.
ja: HTTPアップストリームサーバーの<a href="ngx_http_upstream_module#drain">ドレイン</a>パラメーターと同じです。
ru: То же, что и параметр <a href="ngx_http_upstream_module#drain">стока</a> вышестоящего HTTP-сервера.
zh_cn: 与HTTP上游服务器的<a href="ngx_http_upstream_module#drain">drain</a>参数相同。
