Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/nginx/nginx.*.004.xlf
Languages: es, ja, ko, ru, zh_cn

source: The name of an HTTP upstream server group.
es: El nombre de un grupo de servidores HTTP upstream.
ko: HTTP 업스트림 서버 그룹의 이름

source: The name of an upstream server group.
es: El nombre de un grupo de servidores de subida.
ko: 업스트림 서버 그룹의 이름

source: The name of the cache zone.
es: El nombre de la zona de caché.
ko: 캐시 영역의 이름입니다.

source: The name of the server specified in the <a href="../stream/ngx_stream_upstream_module#server">server</a> directive.
es: El nombre del servidor especificado en la directiva del <a href="../stream/ngx_stream_upstream_module#server">servidor</a> .
ko: <a href="../stream/ngx_stream_upstream_module#server">서버</a> 지시문에 지정된 서버의 이름입니다 .

source: The name of the server specified in the <a href="ngx_http_upstream_module#server">server</a> directive.
es: El nombre del servidor especificado en la directiva del <a href="ngx_http_upstream_module#server">servidor</a> .
ko: <a href="ngx_http_upstream_module#server">서버</a> 지시문에 지정된 서버의 이름입니다 .

source: The name of the shared memory <a href="../stream/ngx_stream_upstream_module#zone">zone</a> that keeps the group&rsquo;s configuration and run-time state.
es: El nombre de la <a href="../stream/ngx_stream_upstream_module#zone">zona de</a> memoria compartida que mantiene la configuraci&oacute;n del grupo y el estado de tiempo de ejecuci&oacute;n.
ko: 그룹의 구성 및 런타임 상태를 유지 하는 공유 메모리 <a href="../stream/ngx_stream_upstream_module#zone">영역</a> 의 이름입니다 .

source: The name of the shared memory <a href="ngx_http_upstream_module#zone">zone</a> that keeps the group&rsquo;s configuration and run-time state.
es: El nombre de la <a href="ngx_http_upstream_module#zone">zona de</a> memoria compartida que mantiene la configuraci&oacute;n del grupo y el estado de tiempo de ejecuci&oacute;n.
ko: 그룹의 구성 및 런타임 상태를 유지 하는 공유 메모리 <a href="ngx_http_upstream_module#zone">영역</a> 의 이름입니다 .

source: The name of the shared memory zone with slab allocator.
es: El nombre de la zona de memoria compartida con el asignador de placas.
ko: 슬랩 할당자가있는 공유 메모리 영역의 이름입니다.

source: The name of the upstream server group.
es: El nombre del grupo de servidores upstream.
ko: 업스트림 서버 그룹의 이름

source: The nginx array type <code>ngx_array_t</code> is defined as follows
es: El tipo de matriz nginx <code>ngx_array_t</code> se define de la siguiente manera
ko: nginx 배열 유형 <code>ngx_array_t</code> 는 다음과 같이 정의됩니다.

source: The nginx processes handle the following signals:
es: Los procesos nginx manejan las siguientes señales:
ko: nginx 프로세스는 다음 신호를 처리합니다.

source: The nginx string type <code>ngx_str_t</code> is defined as follows:
es: El tipo de cadena nginx <code>ngx_str_t</code> se define de la siguiente manera:
ko: nginx 문자열 유형 <code>ngx_str_t</code> 는 다음과 같이 정의됩니다.

source: The number of accepted, dropped, active, and idle connections.
es: El número de conexiones aceptadas,abandonadas,activas y ociosas.
ko: 수락, 끊어짐, 활성 및 유휴 연결 수입니다.

source: The number of bytes received by this node.
es: El número de bytes recibidos por este nodo.
ko: 이 노드가 수신 한 바이트 수입니다.

source: The number of bytes sent by this node.
es: El número de bytes enviados por este nodo.
ko: 이 노드가 보낸 바이트 수입니다.

source: The number of client connections that are currently being processed.
es: El número de conexiones de clientes que se están procesando actualmente.
ko: 현재 처리중인 클라이언트 연결 수입니다.

source: The number of client requests that are currently being processed.
es: El número de solicitudes de clientes que se están procesando actualmente.
ko: 현재 처리중인 클라이언트 요청 수

source: The number of failed health checks.
es: El número de controles sanitarios fallidos.
ko: 실패한 상태 확인 횟수입니다.

source: The number of free and used memory pages.
es: El número de páginas de memoria libres y usadas.
ko: 사용 가능한 메모리 페이지와 사용 된 메모리 페이지 수

source: The number of messages received by this node.
es: El número de mensajes recibidos por este nodo.
ko: 이 노드가 수신 한 메시지 수

source: The number of messages sent by this node.
es: El número de mensajes enviados por este nodo.
ko: 이 노드가 보낸 메시지 수

source: The number of peers this node is connected to.
es: El número de pares a los que este nodo está conectado.
ko: 이 노드가 연결된 피어 수입니다.

source: The number of records that need to be sent to the cluster.
es: El número de registros que deben ser enviados al grupo.
ko: 클러스터로 전송해야하는 레코드 수

source: The number of responses with &ldquo;<code>1xx</code>&rdquo; status codes.
es: El n&uacute;mero de respuestas con c&oacute;digos de estado " <code>1xx</code> ".
ko: " <code>1xx</code> "상태 코드 가있는 응답 수입니다 .

source: The number of responses with &ldquo;<code>2xx</code>&rdquo; status codes.
es: El n&uacute;mero de respuestas con c&oacute;digos de estado " <code>2xx</code> ".
ko: " <code>2xx</code> "상태 코드 가있는 응답 수입니다 .

source: The number of responses with &ldquo;<code>3xx</code>&rdquo; status codes.
es: El n&uacute;mero de respuestas con c&oacute;digos de estado " <code>3xx</code> ".
ko: " <code>3xx</code> "상태 코드 가있는 응답 수입니다 .

source: The number of responses with &ldquo;<code>4xx</code>&rdquo; status codes.
es: El n&uacute;mero de respuestas con c&oacute;digos de estado " <code>4xx</code> ".
ko: " <code>4xx</code> "상태 코드 가있는 응답 수입니다 .

source: The number of responses with &ldquo;<code>5xx</code>&rdquo; status codes.
es: El n&uacute;mero de respuestas con c&oacute;digos de estado &ldquo; <code>5xx</code> &rdquo;.
ko: " <code>5xx</code> "상태 코드 가있는 응답 수입니다 .

source: The number of responses with status codes 1xx, 2xx, 3xx, 4xx, and 5xx.
es: El número de respuestas con los códigos de estado 1xx,2xx,3xx,4xx y 5xx.
ko: 상태 코드가 1xx, 2xx, 3xx, 4xx 및 5xx 인 응답 수입니다.

source: The number of sessions completed with <a href="../stream/ngx_stream_core_module#var_status">status codes</a> 2xx, 4xx, or 5xx.
es: El n&uacute;mero de sesiones completadas con los <a href="../stream/ngx_stream_core_module#var_status">c&oacute;digos de estado</a> 2xx, 4xx o 5xx.
ko: <a href="../stream/ngx_stream_core_module#var_status">상태 코드</a> 2xx, 4xx 또는 5xx로 완료된 세션 수입니다 .

source: The number of unsuccessful attempts to allocate memory of specified size.
es: El número de intentos fallidos de asignar memoria de un tamaño determinado.
ko: 지정된 크기의 메모리를 할당하지 못한 횟수입니다.

source: The oldest and most robust method to resolve the issue is to assign a separate IP address for every HTTPS server:
es: El método más antiguo y robusto para resolver el problema es asignar una dirección IP separada para cada servidor HTTPS:
ko: 이 문제를 해결하는 가장 오래되고 가장 강력한 방법은 모든 HTTPS 서버에 대해 별도의 IP 주소를 할당하는 것입니다.

source: The omitted private part includes the module version and a signature and is filled using the predefined macro <code>NGX_MODULE_V1</code>.
es: La parte privada omitida incluye la versi&oacute;n del m&oacute;dulo y una firma y se llena usando la macro predefinida <code>NGX_MODULE_V1</code> .
ko: 생략 된 개인 부분은 모듈 버전 및 서명을 포함하며 사전 정의 된 매크로 <code>NGX_MODULE_V1</code> 을 사용하여 채워 집니다 .

source: The opposite of the &ldquo;<code>down</code>&rdquo; parameter of the <a href="ngx_http_upstream_module#down">http</a> or <a href="../stream/ngx_stream_upstream_module#down">stream</a> upstream server.
es: Lo opuesto al par&aacute;metro " <code>down</code> " del <a href="ngx_http_upstream_module#down">http</a> o servidor de <a href="../stream/ngx_stream_upstream_module#down">flujo</a> ascendente.
ko: <a href="ngx_http_upstream_module#down">http</a> 또는 <a href="../stream/ngx_stream_upstream_module#down">스트림</a> 업스트림 서버 의 " <code>down</code> "매개 변수와 반대입니다 .

source: The optimal value depends on many factors including (but not limited to) the number of CPU cores, the number of hard disk drives that store data, and load pattern. When one is in doubt, setting it to the number of available CPU cores would be a good start (the value &ldquo;<code>auto</code>&rdquo; will try to autodetect it).
es: El valor &oacute;ptimo depende de muchos factores que incluyen (pero no se limitan a) la cantidad de n&uacute;cleos de CPU, la cantidad de unidades de disco duro que almacenan datos y el patr&oacute;n de carga. En caso de duda, establecerlo en el n&uacute;mero de n&uacute;cleos de CPU disponibles ser&iacute;a un buen comienzo (el valor &ldquo; <code>auto</code> &rdquo; intentar&aacute; detectarlo autom&aacute;ticamente).
ko: 최적의 값은 CPU 코어 수, 데이터를 저장하는 하드 디스크 드라이브 수 및로드 패턴을 포함하여 많은 요인에 따라 달라집니다. 확실하지 않은 경우, 사용 가능한 CPU 코어 수로 설정하면 좋은 시작이됩니다 ( " <code>auto</code> " 값 은 자동 감지를 시도합니다).

source: The optional &ldquo;<code>fields</code>&rdquo; argument in the request line specifies which fields of the requested objects will be output:
es: El argumento " <code>fields</code> " opcional en la l&iacute;nea de solicitud especifica qu&eacute; campos de los objetos solicitados se mostrar&aacute;n:
ko: 요청 라인 의 선택적 " <code>fields</code> "인수는 요청 된 객체의 어떤 필드가 출력 될 것인지 지정합니다.

source: The optional <code>state</code> parameter specifies a <code><i>file</i></code> that keeps the current state of the key-value database in the JSON format and makes it persistent across nginx restarts.
es: El par&aacute;metro de <code>state</code> opcional especifica un <code><i>file</i></code> que mantiene el estado actual de la base de datos de clave-valor en formato JSON y lo hace persistente en los reinicios de nginx.
ko: 선택적 <code>state</code> 매개 변수 는 키-값 데이터베이스의 현재 상태를 JSON 형식으로 유지하고 nginx를 다시 시작해도 지속적으로 유지 하는 <code><i>file</i></code> 을 지정합니다 .

source: The optional <code>sync</code> parameter (1.15.0) enables <a href="../stream/ngx_stream_zone_sync_module#zone_sync">synchronization</a> of the shared memory zone. The synchronization requires the <code>timeout</code> parameter to be set.
es: El par&aacute;metro de <code>sync</code> opcional (1.15.0) habilita la <a href="../stream/ngx_stream_zone_sync_module#zone_sync">sincronizaci&oacute;n</a> de la zona de memoria compartida. La sincronizaci&oacute;n requiere que se establezca el par&aacute;metro de <code>timeout</code> .
ko: 선택적 <code>sync</code> 매개 변수 (1.15.0)는 공유 메모리 영역의 <a href="../stream/ngx_stream_zone_sync_module#zone_sync">동기화</a> 를 가능하게 합니다 . 동기화에는 <code>timeout</code> 매개 변수가 설정되어야합니다.

source: The optional <code>sync</code> parameter (1.15.0) enables <a href="ngx_stream_zone_sync_module#zone_sync">synchronization</a> of the shared memory zone. The synchronization requires the <code>timeout</code> parameter to be set.
es: El par&aacute;metro de <code>sync</code> opcional (1.15.0) habilita la <a href="ngx_stream_zone_sync_module#zone_sync">sincronizaci&oacute;n</a> de la zona de memoria compartida. La sincronizaci&oacute;n requiere que se establezca el par&aacute;metro de <code>timeout</code> .
ko: 선택적 <code>sync</code> 매개 변수 (1.15.0)는 공유 메모리 영역의 <a href="ngx_stream_zone_sync_module#zone_sync">동기화</a> 를 가능하게 합니다 . 동기화에는 <code>timeout</code> 매개 변수가 설정되어야합니다.

source: The optional <code>timeout</code> parameter (1.15.0) sets the time after which key-value pairs are removed from the zone.
es: El par&aacute;metro de <code>timeout</code> opcional (1.15.0) establece el tiempo despu&eacute;s del cual los pares clave-valor se eliminan de la zona.
ko: 선택적 <code>timeout</code> 매개 변수 (1.15.0)는 영역에서 키-값 쌍이 제거 된 후 시간을 설정합니다.

source: The optional <code>token</code> parameter specifies a variable that contains JSON Web Token. By default, JWT is passed in the &ldquo;Authorization&rdquo; header as a <a href="https://tools.ietf.org/html/rfc6750">Bearer Token</a>. JWT may be also passed as a cookie or a part of a query string:
es: El par&aacute;metro de <code>token</code> opcional especifica una variable que contiene JSON Web Token. De forma predeterminada, JWT se pasa en el encabezado "Autorizaci&oacute;n" como un <a href="https://tools.ietf.org/html/rfc6750">token de portador</a> . JWT tambi&eacute;n se puede pasar como una cookie o como parte de una cadena de consulta:
ko: 선택적 <code>token</code> 매개 변수는 JSON 웹 토큰을 포함하는 변수를 지정합니다. 기본적으로 JWT는&ldquo;Authorization&rdquo;헤더에 <a href="https://tools.ietf.org/html/rfc6750">Bearer Token</a> 으로 전달됩니다 . JWT는 쿠키 또는 쿼리 문자열의 일부로 전달 될 수도 있습니다.

source: The optional <code>two</code> parameter instructs nginx to randomly select <a href="https://homes.cs.washington.edu/~karlin/papers/balls.pdf">two</a> servers and then choose a server using the specified <code>method</code>. The default method is <code>least_conn</code> which passes a connection to a server with the least number of active connections.
es: El par&aacute;metro opcional <code>two</code> indica a nginx que seleccione al azar <a href="https://homes.cs.washington.edu/~karlin/papers/balls.pdf">dos</a> servidores y luego elija un servidor usando el <code>method</code> especificado . El m&eacute;todo predeterminado es <code>least_conn</code> que pasa una conexi&oacute;n a un servidor con el menor n&uacute;mero de conexiones activas.
ko: 선택적 <code>two</code> 매개 변수는 nginx에 <a href="https://homes.cs.washington.edu/~karlin/papers/balls.pdf">두</a> 서버 를 무작위로 선택한 다음 지정된 <code>method</code> 사용하여 서버를 선택하도록 지시 합니다 . 기본 방법은 최소 활성 연결 수가있는 서버로 연결을 전달하는 <code>least_conn</code> 입니다.

source: The optional <code>two</code> parameter instructs nginx to randomly select <a href="https://homes.cs.washington.edu/~karlin/papers/balls.pdf">two</a> servers and then choose a server using the specified <code>method</code>. The default method is <code>least_conn</code> which passes a request to a server with the least number of active connections.
es: El par&aacute;metro opcional <code>two</code> indica a nginx que seleccione al azar <a href="https://homes.cs.washington.edu/~karlin/papers/balls.pdf">dos</a> servidores y luego elija un servidor usando el <code>method</code> especificado . El m&eacute;todo predeterminado es <code>least_conn</code> que pasa una solicitud a un servidor con el menor n&uacute;mero de conexiones activas.
ko: 선택적 <code>two</code> 매개 변수는 nginx에 <a href="https://homes.cs.washington.edu/~karlin/papers/balls.pdf">두</a> 서버 를 무작위로 선택한 다음 지정된 <code>method</code> 사용하여 서버를 선택하도록 지시 합니다 . 기본 방법은 최소 수의 활성 연결을 가진 서버로 요청을 전달하는 <code>least_conn</code> 입니다.

source: The optional mask parameter can be used to limit the CPUs available for automatic binding:
es: El parámetro de la máscara opcional se puede utilizar para limitar las CPU disponibles para la vinculación automática:
ko: 선택적 마스크 매개 변수를 사용하여 자동 바인딩에 사용 가능한 CPU를 제한 할 수 있습니다.

source: The output header in a subrequest is always ignored. The <code>ngx_http_postpone_filter</code> places the subrequest's output body in the right position relative to other data produced by the parent request.
es: El encabezado de salida en una sub-solicitud siempre se ignora. El <code>ngx_http_postpone_filter</code> coloca el cuerpo de salida de la subquest en la posici&oacute;n correcta en relaci&oacute;n con otros datos producidos por la solicitud principal.
ko: 하위 요청의 출력 헤더는 항상 무시됩니다. <code>ngx_http_postpone_filter</code> 는 부모의 요청에 의해 생성 된 다른 데이터에 대한 권리의 상대 위치에 subrequest의 출력 체를 놓는다.

source: The parameter <code>off</code> cancels the addition of charset to the &ldquo;Content-Type&rdquo; response header field.
es: El par&aacute;metro <code>off</code> cancela la adici&oacute;n de charset al campo de encabezado de respuesta "Content-Type".
ko: <code>off</code> 매개 변수 는 "Content-Type"응답 헤더 필드에 문자 세트 추가를 취소합니다.

source: The parameter cannot be used along with the <a href="#hash">hash</a> and <a href="#ip_hash">ip_hash</a> load balancing methods.
es: El par&aacute;metro no se puede utilizar junto con los m&eacute;todos de equilibrio de carga <a href="#hash">hash</a> e <a href="#ip_hash">ip_hash</a> .
ko: 이 매개 변수는 <a href="#hash">해시</a> 및 <a href="#ip_hash">ip_hash</a> 로드 밸런싱 방법 과 함께 사용할 수 없습니다 .

source: The parameter cannot be used along with the <a href="#hash">hash</a> load balancing method.
es: El par&aacute;metro no se puede utilizar junto con el m&eacute;todo de equilibrio de carga <a href="#hash">hash</a> .
ko: 이 매개 변수는 <a href="#hash">해시</a> 로드 밸런싱 방법 과 함께 사용할 수 없습니다 .

source: The parameter is a regular expression matching all URIs ending with <code>.gif</code>, <code>.jpg</code>, or <code>.png</code>. A regular expression should be preceded with <code>~</code>. The corresponding requests will be mapped to the <code>/data/images</code> directory.
es: El par&aacute;metro es una expresi&oacute;n regular que coincide con todos los URI que terminan en <code>.gif</code> , <code>.jpg</code> o <code>.png</code> . Una expresi&oacute;n regular debe ir precedida de <code>~</code> . Las solicitudes correspondientes se asignar&aacute;n al directorio <code>/data/images</code> .
ko: 이 매개 변수는 <code>.gif</code> , <code>.jpg</code> 또는 <code>.png</code> 로 끝나는 모든 URI와 일치하는 정규식 입니다. 정규식 앞에 <code>~</code> 가 와야 합니다. 해당 요청은 <code>/data/images</code> 디렉토리에 매핑됩니다 .

source: The parameters <code>create</code> and <code>lookup</code> specify variables that indicate how new sessions are created and existing sessions are searched, respectively. Both parameters may be specified more than once, in which case the first non-empty variable is used.
es: Los par&aacute;metros de <code>create</code> y <code>lookup</code> especifican variables que indican c&oacute;mo se crean nuevas sesiones y se buscan sesiones existentes, respectivamente. Ambos par&aacute;metros pueden especificarse m&aacute;s de una vez, en cuyo caso se utiliza la primera variable no vac&iacute;a.
ko: 매개 변수 <code>create</code> 및 <code>lookup</code> 은 각각 새 세션을 만들고 기존 세션을 검색하는 방법을 나타내는 변수를 지정합니다. 두 매개 변수를 두 번 이상 지정할 수 있으며이 경우 비어 있지 않은 첫 번째 변수가 사용됩니다.

source: The parameters description can contain variables, for example, the whole line of parameters can be taken from a single variable:
es: La descripción de los parámetros puede contener variables,por ejemplo,toda la línea de parámetros puede tomarse de una sola variable:
ko: 매개 변수 설명에는 변수가 포함될 수 있습니다. 예를 들어, 전체 매개 변수 행은 단일 변수에서 가져올 수 있습니다.

source: The parameters of the <code>route</code> method specify variables that may contain routing information. The first non-empty variable is used to find the matching server.
es: Los par&aacute;metros del m&eacute;todo de <code>route</code> especifican variables que pueden contener informaci&oacute;n de ruta. La primera variable no vac&iacute;a se utiliza para encontrar el servidor coincidente.
ko: <code>route</code> 메소드 의 매개 변수는 라우팅 정보를 포함 할 수있는 변수를 지정합니다. 비어 있지 않은 첫 번째 변수는 일치하는 서버를 찾는 데 사용됩니다.

source: The previous versions of nginx used <a href="../http/configuring_https_servers#compatibility">different</a> ciphers by default.
es: Las versiones anteriores de nginx usaban cifrados <a href="../http/configuring_https_servers#compatibility">diferentes</a> de forma predeterminada.
ko: 이전 버전의 nginx 는 기본적으로 <a href="../http/configuring_https_servers#compatibility">다른</a> 암호를 사용 했습니다.

source: The previous versions of nginx used <a href="configuring_https_servers#compatibility">different</a> ciphers by default.
es: Las versiones anteriores de nginx usaban cifrados <a href="configuring_https_servers#compatibility">diferentes</a> de forma predeterminada.
ko: 이전 버전의 nginx 는 기본적으로 <a href="configuring_https_servers#compatibility">다른</a> 암호를 사용 했습니다.

source: The problem above can be solved by including only the relevant and necessary structure and type definitions in the DTrace script. DTrace has to know sizes of structures, types, and fields offsets. Thus dependencies can be further reduced by manually optimizing structure definitions for use with DTrace.
es: El problema anterior puede resolverse incluyendo en el guión de DTrace sólo las definiciones de estructura y tipo pertinentes y necesarias.DTrace tiene que conocer los tamaños de las estructuras,tipos y campos de compensación.Así pues,las dependencias pueden reducirse aún más optimizando manualmente las definiciones de las estructuras para su uso con DTrace.
ko: 위의 문제는 DTrace 스크립트에 관련이 있고 필요한 구조 및 유형 정의 만 포함하여 해결할 수 있습니다. DTrace는 구조, 유형 및 필드 오프셋의 크기를 알아야합니다. 따라서 DTrace와 함께 사용할 구조 정의를 수동으로 최적화하여 종속성을 더욱 줄일 수 있습니다.

source: The rate is specified in requests per second (r/s). If a rate of less than one request per second is desired, it is specified in request per minute (r/m). For example, half-request per second is 30r/m.
es: La tasa se especifica en las solicitudes por segundo (r/s).Si se desea una tasa de menos de una solicitud por segundo,se especifica en solicitudes por minuto (r/m).Por ejemplo,media solicitud por segundo es 30r/m.
ko: 비율은 초당 요청 (r / s)으로 지정됩니다. 초당 1 회 미만의 요청이 필요한 경우 분당 요청 (r / m)으로 지정됩니다. 예를 들어, 초당 절반 요청은 30r / m입니다.

source: The redirection happens after the request is fully parsed and the variables, such as <code>$request_uri</code>, <code>$uri</code>, <code>$args</code> and others, are available.
es: La redirecci&oacute;n ocurre despu&eacute;s de que la solicitud se analiza por completo y las variables, como <code>$request_uri</code> , <code>$uri</code> , <code>$args</code> y otras, est&aacute;n disponibles.
ko: 요청이 완전히 파싱되고 <code>$request_uri</code> , <code>$uri</code> , <code>$args</code> 등의 변수 를 사용할 수있게 되면 리디렉션이 발생 합니다.

source: The regular expressions interface in nginx is a wrapper around the <a href="http://www.pcre.org">PCRE</a> library. The corresponding header file is <code>src/core/ngx_regex.h</code>.
es: La interfaz de expresiones regulares en nginx es una envoltura de la biblioteca <a href="http://www.pcre.org">PCRE</a> . El archivo de encabezado correspondiente es <code>src/core/ngx_regex.h</code> .
ko: nginx의 정규식 인터페이스는 <a href="http://www.pcre.org">PCRE</a> 라이브러리를 둘러싼 래퍼 입니다. 해당 헤더 파일은 <code>src/core/ngx_regex.h</code> 입니다.

source: The regular expressions used by nginx are compatible with those used by the Perl programming language (PCRE). To use a regular expression, the server name must start with the tilde character:
es: Las expresiones regulares utilizadas por nginx son compatibles con las utilizadas por el lenguaje de programación Perl (PCRE).Para usar una expresión regular,el nombre del servidor debe comenzar con el carácter tilde:
ko: nginx가 사용하는 정규식은 Perl 프로그래밍 언어 (PCRE)가 사용하는 정규식과 호환됩니다. 정규식을 사용하려면 서버 이름이 물결표 문자로 시작해야합니다.

source: The replacement block content is processed in the included request context.
es: El contenido del bloque de reemplazo se procesa en el contexto de la solicitud incluida.
ko: 대체 블록 컨텐츠는 포함 된 요청 컨텍스트에서 처리됩니다.

source: The request header field value that contains an optional port is also used to replace the client port (1.11.0). The address and port should be specified according to <a href="https://tools.ietf.org/html/rfc3986">RFC 3986</a>.
es: El valor del campo del encabezado de la solicitud que contiene un puerto opcional tambi&eacute;n se usa para reemplazar el puerto del cliente (1.11.0). La direcci&oacute;n y el puerto deben especificarse de acuerdo con <a href="https://tools.ietf.org/html/rfc3986">RFC 3986</a> .
ko: 선택적 포트를 포함하는 요청 헤더 필드 값은 클라이언트 포트 (1.11.0)를 대체하는 데에도 사용됩니다. 주소와 포트는 <a href="https://tools.ietf.org/html/rfc3986">RFC 3986</a> 에 따라 지정해야합니다 .

source: The rest of a line after the <code>#</code> sign is considered a comment.
es: El resto de una l&iacute;nea despu&eacute;s del signo <code>#</code> se considera un comentario.
ko: <code>#</code> 기호 뒤의 나머지 줄 은 주석으로 간주됩니다.

source: The resulting configuration of a proxy server will look like this:
es: La configuración resultante de un servidor proxy se verá así:
ko: 프록시 서버의 결과 구성은 다음과 같습니다.

source: The resulting configuration of the <code>server</code> block should look like this:
es: La configuraci&oacute;n resultante del bloque del <code>server</code> deber&iacute;a verse as&iacute;:
ko: <code>server</code> 블록 의 결과 구성 은 다음과 같아야합니다.

source: The resulting file should be used in the <a href="ngx_http_ssl_module#ssl_certificate">ssl_certificate</a> directive:
es: El archivo resultante debe usarse en la directiva <a href="ngx_http_ssl_module#ssl_certificate">ssl_certificate</a> :
ko: 결과 파일은 <a href="ngx_http_ssl_module#ssl_certificate">ssl_certificate</a> 지시문 에서 사용해야 합니다.
