Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/nginx/nginx.*.004.xlf
Languages: es, ja, ko, ru, zh_cn

source: The <a href="ngx_http_upstream_module#server">max_fails</a> directive sets the number of consecutive unsuccessful attempts to communicate with the server that should happen during <a href="ngx_http_upstream_module#server">fail_timeout</a>. By default, <a href="ngx_http_upstream_module#server">max_fails</a> is set to 1. When it is set to 0, health checks are disabled for this server. The <a href="ngx_http_upstream_module#server">fail_timeout</a> parameter also defines how long the server will be marked as failed. After <a href="ngx_http_upstream_module#server">fail_timeout</a> interval following the server failure, nginx will start to gracefully probe the server with the live client&rsquo;s requests. If the probes have been successful, the server is marked as a live one.
es: La directiva <a href="ngx_http_upstream_module#server">max_fails</a> establece el n&uacute;mero de intentos fallidos consecutivos de comunicarse con el servidor que deber&iacute;an ocurrir durante <a href="ngx_http_upstream_module#server">fail_timeout</a> . De forma predeterminada, <a href="ngx_http_upstream_module#server">max_fails</a> se establece en 1. Cuando se establece en 0, las comprobaciones de estado est&aacute;n deshabilitadas para este servidor. El par&aacute;metro <a href="ngx_http_upstream_module#server">fail_timeout</a> tambi&eacute;n define cu&aacute;nto tiempo se marcar&aacute; el servidor como fallido. Despu&eacute;s del intervalo de <a href="ngx_http_upstream_module#server">fail_timeout</a> despu&eacute;s de la falla del servidor, nginx comenzar&aacute; a sondear con gracia el servidor con las solicitudes del cliente en vivo. Si las sondas han tenido &eacute;xito, el servidor se marca como activo.
ja: <a href="ngx_http_upstream_module#server">max_fails</a>ディレクティブセットに間に起こるはずのサーバーと通信するために連続して失敗した試行回数<a href="ngx_http_upstream_module#server">fail_timeoutを</a>。デフォルトでは、<a href="ngx_http_upstream_module#server">max_fails</a>は1に設定されています。0に設定すると、このサーバーのヘルスチェックが無効になります。<a href="ngx_http_upstream_module#server">fail_timeoutの</a>パラメータも失敗したとして、サーバーがマークされますどのくらいの期間を定義します。サーバー障害に続く<a href="ngx_http_upstream_module#server">fail_timeout</a>間隔の後、nginxは、ライブクライアントのリクエストを使用してサーバーを正常に検証し始めます。プローブが成功した場合、サーバーはライブプローブとしてマークされます。
ko: <a href="ngx_http_upstream_module#server">max_fails는</a> 세트를하는 동안 발생해야 서버와 통신하는 연속 실패 시도 횟수 지시어 <a href="ngx_http_upstream_module#server">fail_timeout를</a> . 기본적으로 <a href="ngx_http_upstream_module#server">max_fails</a> 는 1로 설정되어 있습니다. 0으로 설정하면이 서버에 대한 상태 확인이 비활성화됩니다. <a href="ngx_http_upstream_module#server">fail_timeout의</a> 매개 변수는 실패로 서버가 표시됩니다 시간을 정의합니다. 서버 장애 후 <a href="ngx_http_upstream_module#server">fail_timeout</a> 간격이 지나면 nginx는 라이브 클라이언트의 요청으로 서버를 정상적으로 검사하기 시작합니다. 프로브가 성공한 경우 서버는 활성화 된 것으로 표시됩니다.
ru: В <a href="ngx_http_upstream_module#server">max_fails</a> директива устанавливает число последовательных неудачных попыток общения с сервером , что должно произойти во время <a href="ngx_http_upstream_module#server">fail_timeout</a> . По умолчанию для <a href="ngx_http_upstream_module#server">max_fails</a> установлено значение 1. Когда установлено значение 0, проверки работоспособности для этого сервера отключены. Параметр <a href="ngx_http_upstream_module#server">fail_timeout</a> также определяет, как долго сервер будет помечен как отказавший. По <a href="ngx_http_upstream_module#server">истечении</a> интервала fail_timeout после сбоя сервера nginx начнет корректно проверять сервер с помощью запросов живого клиента. Если проверки прошли успешно, сервер помечается как активный.
zh_cn: 该<a href="ngx_http_upstream_module#server">max_fails</a>指令设置连续不成功的尝试与中应该发生的服务器进行通信的数量<a href="ngx_http_upstream_module#server">fail_timeout</a>。默认情况下，<a href="ngx_http_upstream_module#server">max_fails</a>设置为1。当它设置为0时，将禁用此服务器的运行状况检查。该<a href="ngx_http_upstream_module#server">fail_timeout</a>参数还定义如何，只要服务器失败将被标记。服务器故障后的<a href="ngx_http_upstream_module#server">fail_timeout</a>间隔后，nginx将开始使用实时客户端的请求来正常探测服务器。如果探测成功，则将服务器标记为活动服务器。

source: The <a href="ngx_http_upstream_module#service">service</a> parameter value of the <a href="ngx_http_upstream_module#server">server</a> directive.
es: El valor del par&aacute;metro de <a href="ngx_http_upstream_module#service">servicio</a> de la directiva del <a href="ngx_http_upstream_module#server">servidor</a> .
ja: <a href="ngx_http_upstream_module#server">サーバー</a>ディレクティブの<a href="ngx_http_upstream_module#service">サービス</a>パラメータ値。
ko: <a href="ngx_http_upstream_module#server">서버</a> 지시문 의 <a href="ngx_http_upstream_module#service">서비스</a> 매개 변수 값입니다 .
ru: Значение <a href="ngx_http_upstream_module#service">служебного</a> параметра директивы <a href="ngx_http_upstream_module#server">сервера</a> .
zh_cn: <a href="ngx_http_upstream_module#server">服务器</a>指令的<a href="ngx_http_upstream_module#service">服务</a>参数值。

source: The <code>$gzip_ratio</code> variable can be used to log the achieved compression ratio.
es: La variable <code>$gzip_ratio</code> se puede utilizar para registrar la relaci&oacute;n de compresi&oacute;n lograda.
ja: <code>$gzip_ratio</code> 変数が達成される圧縮率を記録するために使用することができます。
ko: <code>$gzip_ratio</code> 변수가 달성 압축비를 기록하는데 사용될 수있다.
ru: <code>$gzip_ratio</code> переменная может быть использована для входа достигнутого коэффициента сжатия.
zh_cn: 的 <code>$gzip_ratio</code> 变量可用于记录实现的压缩比。

source: The <code>/data/w3/i/top.gif</code> file will be sent in response to the &ldquo;<code>/i/top.gif</code>&rdquo; request.
es: El archivo <code>/data/w3/i/top.gif</code> se enviar&aacute; en respuesta a la solicitud &ldquo; <code>/i/top.gif</code> &rdquo;.
ja: <code>/data/w3/i/top.gif</code> のファイルは、「に対応して送信されます <code>/i/top.gif</code> 」要求。
ko: <code>/data/w3/i/top.gif</code> 의 파일이 "에 대한 응답으로 전송됩니다 <code>/i/top.gif</code> "요구.
ru: <code>/data/w3/i/top.gif</code> файл будет отправлен в ответ на &laquo; <code>/i/top.gif</code> &raquo; запрос.
zh_cn: 该 <code>/data/w3/i/top.gif</code> 文件将响应&ldquo;发送 <code>/i/top.gif</code> &rdquo;的要求。

source: The <code><i>connections</i></code> parameter sets the maximum number of idle keepalive connections to upstream servers that are preserved in the cache of each worker process. When this number is exceeded, the least recently used connections are closed.
es: El par&aacute;metro de <code><i>connections</i></code> establece el n&uacute;mero m&aacute;ximo de conexiones keepalive inactivas a servidores ascendentes que se conservan en la cach&eacute; de cada proceso de trabajo. Cuando se excede este n&uacute;mero, se cierran las conexiones utilizadas menos recientemente.
ja: <code><i>connections</i></code> 各ワーカープロセスのキャッシュに保存されている上流のサーバーにアイドル状態のキープアライブ接続の最大数を設定するパラメータ。この数を超えると、最も使用頻度の低い接続が閉じられます。
ko: <code><i>connections</i></code> 설정 매개 변수는 유휴 연결 유지 연결의 최대 수는 각 작업자 프로세스의 캐시에 보존하는 서버를 업스트림합니다. 이 수를 초과하면 가장 최근에 사용한 연결이 닫힙니다.
ru: Параметр <code><i>connections</i></code> устанавливает максимальное количество неактивных соединений keepalive с вышестоящими серверами, которые сохраняются в кэше каждого рабочего процесса. При превышении этого числа самые последние использованные соединения закрываются.
zh_cn: 的 <code><i>connections</i></code> 参数集空闲存活的最大连接数到上游即在每个工作进程的高速缓存保存服务器。超过此数目时，将关闭最近最少使用的连接。

source: The <code><i>domain</i></code> and <code><i>replacement</i></code> strings can contain variables:
es: El <code><i>domain</i></code> y las cadenas de <code><i>replacement</i></code> pueden contener variables:
ja: <code><i>domain</i></code> と <code><i>replacement</i></code> た文字列は、変数を含めることができます。
ko: <code><i>domain</i></code> 및 <code><i>replacement</i></code> 문자열 변수를 포함 할 수 있습니다 :
ru: В <code><i>domain</i></code> и <code><i>replacement</i></code> строка может содержать переменные:
zh_cn: 该 <code><i>domain</i></code> 和 <code><i>replacement</i></code> 字符串可以包含变量：

source: The <code><i>file</i></code> must contain 80 or 48 bytes of random data and can be created using the following command:
es: El <code><i>file</i></code> debe contener 80 o 48 bytes de datos aleatorios y se puede crear usando el siguiente comando:
ja: <code><i>file</i></code> 、ランダムなデータの80のまたは48バイトが含まれている必要があり、次のコマンドを使用して作成することができます。
ko: <code><i>file</i></code> 임의의 데이터의 80 또는 48 바이트를 포함해야하며 다음 명령을 사용하여 만들 수 있습니다 :
ru: <code><i>file</i></code> должен содержать 80 или 48 байт случайных данных и может быть создан с помощью следующей команды:
zh_cn: 该 <code><i>file</i></code> 必须包含80或48个字节的随机数据，并且可以使用以下命令创建：

source: The <code><i>file</i></code> name can contain variables.
es: El nombre del <code><i>file</i></code> puede contener variables.
ja: <code><i>file</i></code> 名は、変数を含めることができます。
ko: <code><i>file</i></code> 이름은 변수를 포함 할 수 있습니다.
ru: Имя <code><i>file</i></code> может содержать переменные.
zh_cn: 该 <code><i>file</i></code> 名可以包含变量。

source: The <code><i>path</i></code> and <code><i>replacement</i></code> strings can contain variables:
es: La <code><i>path</i></code> y las cadenas de <code><i>replacement</i></code> pueden contener variables:
ja: <code><i>path</i></code> と <code><i>replacement</i></code> 文字列は、変数を含めることができます。
ko: <code><i>path</i></code> 및 <code><i>replacement</i></code> 문자열 변수를 포함 할 수 있습니다 :
ru: В <code><i>path</i></code> и <code><i>replacement</i></code> строки могут содержать переменные:
zh_cn: 该 <code><i>path</i></code> 和 <code><i>replacement</i></code> 字符串可以包含变量：

source: The <code><i>path</i></code> value can contain variables, except <code>$document_root</code> and <code>$realpath_root</code>.
es: El valor de la <code><i>path</i></code> puede contener variables, excepto <code>$document_root</code> y <code>$realpath_root</code> .
ja: <code><i>path</i></code> 値は除いて、変数を含めることができます <code>$document_root</code> や <code>$realpath_root</code> 。
ko: <code><i>path</i></code> 값은 변수를 포함 제외시켰다 수 <code>$document_root</code> 와 <code>$realpath_root</code> .
ru: Значение <code><i>path</i></code> может содержать переменные, кроме <code>$document_root</code> и <code>$realpath_root</code> .
zh_cn: 该 <code><i>path</i></code> 值可以包含变量，除了 <code>$document_root</code> 和 <code>$realpath_root</code> 。

source: The <code><i>uri</i></code> value can contain variables.
es: El valor <code><i>uri</i></code> puede contener variables.
ja: <code><i>uri</i></code> 値は、変数を含めることができます。
ko: <code><i>uri</i></code> 값은 변수를 포함 할 수있다.
ru: Значение <code><i>uri</i></code> может содержать переменные.
zh_cn: 该 <code><i>uri</i></code> 值可以包含变量。

source: The <code>EPOLLRDHUP</code> (Linux 2.6.17, glibc 2.8) and <code>EPOLLEXCLUSIVE</code> (Linux 4.5, glibc 2.24) flags are supported since 1.11.3.
es: Los <code>EPOLLRDHUP</code> (Linux 2.6.17, glibc 2.8) y <code>EPOLLEXCLUSIVE</code> (Linux 4.5, glibc 2.24) son compatibles desde 1.11.3.
ja: <code>EPOLLRDHUP</code> する（Linux 2.6.17、glibcの2.8）と <code>EPOLLEXCLUSIVE</code> する（Linux 4.5、glibcでは2.24）のフラグが1.11.3以降でサポートされています。
ko: <code>EPOLLRDHUP</code> (리눅스 2.6.17, glibc는 2.8) 및 <code>EPOLLEXCLUSIVE</code> (리눅스 4.5의 glibc 2.24) 플래그는 1.11.3부터 지원됩니다.
ru: <code>EPOLLRDHUP</code> (Linux 2.6.17, Glibc 2.8) и <code>EPOLLEXCLUSIVE</code> (Linux , 4.5, Glibc 2.24) флаги поддерживаются так 1.11.3.
zh_cn: 该 <code>EPOLLRDHUP</code> （Linux的2.6.17，glibc的2.8）和 <code>EPOLLEXCLUSIVE</code> （Linux的4.5，glibc的2.24）标志1.11.3以来的支持。

source: The <code>JSON</code> object (ES 5.1) provides functions to convert njs values to and from JSON format.
es: El objeto <code>JSON</code> (ES 5.1) proporciona funciones para convertir valores njs hacia y desde el formato JSON.
ja: <code>JSON</code> のオブジェクト（ES 5.1）へとJSON形式からコンバートNJS値に機能を提供します。
ko: <code>JSON</code> 의 객체 (ES 5.1) 및 JSON 포맷 변환에서의 값 NJS하는 기능을 제공한다.
ru: Объект <code>JSON</code> (ES 5.1) предоставляет функции для преобразования значений njs в формат JSON и обратно.
zh_cn: 的 <code>JSON</code> 对象（ES 5.1）提供的功能，以转换NJS值和从JSON格式。

source: The <code>NGX_CORE_MODULE</code> is the most basic and thus the most generic and most low-level type of module. The other module types are implemented on top of it and provide a more convenient way to deal with corresponding domains, like handling events or HTTP requests.
es: El <code>NGX_CORE_MODULE</code> es el m&aacute;s b&aacute;sico y por lo tanto el tipo de bajo nivel m&aacute;s gen&eacute;rico y la mayor parte de m&oacute;dulo. Los otros tipos de m&oacute;dulos se implementan sobre &eacute;l y proporcionan una forma m&aacute;s conveniente de tratar con los dominios correspondientes, como manejar eventos o solicitudes HTTP.
ja: <code>NGX_CORE_MODULE</code> は、最も基本的かつモジュールのため、最も一般的かつ最も低レベルのタイプです。他のモジュールタイプはその上に実装され、イベントやHTTPリクエストの処理など、対応するドメインを処理するためのより便利な方法を提供します。
ko: <code>NGX_CORE_MODULE</code> 는 가장 기본적이고 모듈 따라서 가장 일반적이고 가장 낮은 수준의 유형입니다. 다른 모듈 유형은 그 위에 구현되며 이벤트 또는 HTTP 요청 처리와 같은 해당 도메인을 처리하는보다 편리한 방법을 제공합니다.
ru: <code>NGX_CORE_MODULE</code> является самым основным и , таким образом, наиболее общим типом и наиболее низкого уровня модуля. Другие типы модулей реализуются поверх него и обеспечивают более удобный способ работы с соответствующими доменами, например обработку событий или HTTP-запросов.
zh_cn: 该 <code>NGX_CORE_MODULE</code> 是最基本的，因此模块的最上位及最低电平的类型。其他模块类型在其顶部实现，并提供了更方便的方式来处理相应的域，例如处理事件或HTTP请求。

source: The <code>Object</code> constructor corresponds to a standard JS object.
es: El constructor de <code>Object</code> corresponde a un objeto JS est&aacute;ndar.
ja: <code>Object</code> 標準JSオブジェクトのコンストラクタに相当します。
ko: <code>Object</code> 표준 JS 객체 생성자 대응한다.
ru: Конструктор <code>Object</code> соответствует стандартному объекту JS.
zh_cn: 该 <code>Object</code> 的构造对应于标准JS对象。

source: The <code>SCRIPT_FILENAME</code> parameter is used in PHP for determining the script name, and the <code>QUERY_STRING</code> parameter is used to pass request parameters.
es: El par&aacute;metro <code>SCRIPT_FILENAME</code> se usa en PHP para determinar el nombre del script, y el par&aacute;metro <code>QUERY_STRING</code> se usa para pasar par&aacute;metros de solicitud.
ja: <code>SCRIPT_FILENAME</code> のパラメータは、スクリプト名を決定するためのPHPで使用され、 <code>QUERY_STRING</code> のパラメータは、リクエストパラメータを渡すために使用されます。
ko: <code>SCRIPT_FILENAME</code> 의 파라미터들은 스크립트 이름을 결정 PHP에 사용되고, <code>QUERY_STRING</code> 의 파라미터는 요청 파라미터를 전달하는 데 사용된다.
ru: Параметр <code>SCRIPT_FILENAME</code> используется в PHP для определения имени скрипта, а параметр <code>QUERY_STRING</code> используется для передачи параметров запроса.
zh_cn: PHP中的 <code>SCRIPT_FILENAME</code> 参数用于确定脚本名称， <code>QUERY_STRING</code> 参数用于传递请求参数。

source: The <code>TLSv1.1</code> and <code>TLSv1.2</code> parameters (1.1.13, 1.0.12) work only when OpenSSL 1.0.1 or higher is used.
es: Los par&aacute;metros <code>TLSv1.1</code> y <code>TLSv1.2</code> (1.1.13, 1.0.12) funcionan solo cuando se usa OpenSSL 1.0.1 o superior.
ja: <code>TLSv1.1</code> と <code>TLSv1.2</code> パラメータ（1.1.13、1.0.12）にOpenSSL 1.0.1以上が使用されているだけの作業。
ko: <code>TLSv1.1</code> 및 <code>TLSv1.2</code> 파라미터 (1.1.13, 1.0.12)은 OpenSSL 1.0.1 이상을 사용하는 작업 만.
ru: Параметры <code>TLSv1.1</code> и <code>TLSv1.2</code> (1.1.13, 1.0.12) работают только при использовании OpenSSL 1.0.1 или выше.
zh_cn: 的 <code>TLSv1.1</code> 和 <code>TLSv1.2</code> 工作参数（1.1.13，1.0.12）的OpenSSL 1.0.1或更高时才使用的工作。

source: The <code>TLSv1.1</code> and <code>TLSv1.2</code> parameters work only when OpenSSL 1.0.1 or higher is used.
es: Los par&aacute;metros <code>TLSv1.1</code> y <code>TLSv1.2</code> funcionan solo cuando se usa OpenSSL 1.0.1 o superior.
ja: <code>TLSv1.1</code> と <code>TLSv1.2</code> パラメータは、OpenSSL 1.0.1以上が使用されている場合にのみ動作します。
ko: <code>TLSv1.1</code> 및 <code>TLSv1.2</code> 은 OpenSSL 1.0.1 이상을 사용하는 경우 매개 변수에만 작동합니다.
ru: Параметры <code>TLSv1.1</code> и <code>TLSv1.2</code> работают только при использовании OpenSSL 1.0.1 или выше.
zh_cn: 该 <code>TLSv1.1</code> 和 <code>TLSv1.2</code> 工作参数仅使用OpenSSL的1.0.1或更高时工作。

source: The <code>TLSv1.3</code> parameter (1.13.0) works only when OpenSSL 1.1.1 built with TLSv1.3 support is used.
es: El par&aacute;metro <code>TLSv1.3</code> (1.13.0) funciona solo cuando se usa OpenSSL 1.1.1 construido con soporte TLSv1.3.
ja: <code>TLSv1.3</code> の TLSv1.3サポート付きで構築されたOpenSSL 1.1.1を使用する場合、パラメータ（1.13.0）がのみ機能します。
ko: <code>TLSv1.3</code> 의 TLSv1.3 지원 내장은 OpenSSL 1.1.1을 사용하는 경우 매개 변수 (1.13.0)는에만 작동합니다.
ru: Параметр <code>TLSv1.3</code> (1.13.0) работает только при использовании OpenSSL 1.1.1, созданного с поддержкой TLSv1.3.
zh_cn: 该 <code>TLSv1.3</code> 使用OpenSSL的1.1.1 TLSv1.3支持内置参数时（1.13.0）才起作用。

source: The <code>auto</code> parameter is supported starting from versions 1.3.8 and 1.2.5.
es: El par&aacute;metro <code>auto</code> es compatible a partir de las versiones 1.3.8 y 1.2.5.
ja: <code>auto</code> パラメータは、バージョン1.3.8および1.2.5以降でサポートされています。
ko: <code>auto</code> 매개 변수는 버전 1.3.8과 1.2.5부터 지원됩니다.
ru: Параметр <code>auto</code> поддерживается начиная с версий 1.3.8 и 1.2.5.
zh_cn: 该 <code>auto</code> 参数支持从1.3.8和1.2.5版本开始。

source: The <code>build</code> parameter (1.11.10) enables emitting a <a href="../configure#build">build name</a> along with nginx version.
es: El par&aacute;metro de <code>build</code> (1.11.10) permite emitir un <a href="../configure#build">nombre de compilaci&oacute;n</a> junto con la versi&oacute;n de nginx.
ja: <code>build</code> パラメータ（1.11.10）が発光可能<a href="../configure#build">ビルド名を</a> nginxのバージョンと一緒に。
ko: <code>build</code> 매개 변수 (1.11.10)는 발광 할 수 <a href="../configure#build">빌드 이름을</a> nginx를 버전과 함께.
ru: Параметр <code>build</code> (1.11.10) позволяет указывать <a href="../configure#build">имя сборки</a> вместе с версией nginx.
zh_cn: 使用 <code>build</code> 参数（1.11.10）可以生成<a href="../configure#build">版本名称</a>以及nginx版本。

source: The <code>compare()</code> function is a classic comparator function that returns a value less than, equal to, or greater than zero. To speed up lookups and avoid comparing user objects that can be big, an integer hash field is used.
es: La funci&oacute;n <code>compare()</code> es una funci&oacute;n de comparaci&oacute;n cl&aacute;sica que devuelve un valor menor, igual o mayor que cero. Para acelerar las b&uacute;squedas y evitar comparar objetos de usuario que pueden ser grandes, se utiliza un campo hash de n&uacute;mero entero.
ja: <code>compare()</code> 関数は戻り値より小さい、等しい、またはゼロより大きいことを古典的な比較関数です。検索を高速化し、大きくなる可能性のあるユーザーオブジェクトの比較を回避するために、整数ハッシュフィールドが使用されます。
ko: <code>compare()</code> 함수 반환 값보다 같거나 제로보다 큰 것을 고전 비교 함수이다. 조회 속도를 높이고 사용자 개체가 클 수있는 비교를 피하기 위해 정수 해시 필드가 사용됩니다.
ru: Функция <code>compare()</code> - это классическая функция компаратора, которая возвращает значение меньше, равное или больше нуля. Чтобы ускорить поиск и избежать сравнения пользовательских объектов, которые могут быть большими, используется целочисленное хеш-поле.
zh_cn: 的 <code>compare()</code> 函数是一个典型的比较器函数返回小于一个值，等于或大于零。为了加快查找速度并避免比较可能很大的用户对象，使用了一个整数哈希字段。

source: The <code>conf/geo.conf</code> file could contain the following lines:
es: El archivo <code>conf/geo.conf</code> podr&iacute;a contener las siguientes l&iacute;neas:
ja: <code>conf/geo.conf</code> ファイルには、以下の行を含めることができます：
ko: <code>conf/geo.conf</code> 파일은 다음 행을 포함 할 수있다 :
ru: <code>conf/geo.conf</code> файл может содержать следующие строки:
zh_cn: 该 <code>conf/geo.conf</code> 文件可能包含以下行：

source: The <code>conf</code> field defines which configuration structure is passed to the directory handler. Core modules only have the global configuration and set <code>NGX_DIRECT_CONF</code> flag to access it. Modules like HTTP, Stream or Mail create hierarchies of configurations. For example, a module's configuration is created for <code>server</code>, <code>location</code> and <code>if</code> scopes.
es: El campo <code>conf</code> define qu&eacute; estructura de configuraci&oacute;n se pasa al controlador de directorio. Los m&oacute;dulos principales solo tienen la configuraci&oacute;n global y establecen la bandera <code>NGX_DIRECT_CONF</code> para acceder a ella. M&oacute;dulos como HTTP, Stream o Mail crean jerarqu&iacute;as de configuraciones. Por ejemplo, se crea la configuraci&oacute;n de un m&oacute;dulo de <code>server</code> , <code>location</code> y <code>if</code> &aacute;mbitos.
ja: <code>conf</code> に設定構造がディレクトリハンドラに渡されたフィールド定義。コアモジュールはグローバル構成のみを持ち、 <code>NGX_DIRECT_CONF</code> アクセスするためにNGX_DIRECT_CONFフラグを設定します。HTTP、Stream、Mailなどのモジュールは、構成の階層を作成します。たとえば、モジュールの構成は、 <code>server</code> 、 <code>location</code> 、および <code>if</code> スコープに対して作成されます。
ko: <code>conf</code> 의 어떤 구성 구조 필드를 정의 디렉토리 핸들러로 전달됩니다. 코어 모듈은 전역 구성 만 있으며 <code>NGX_DIRECT_CONF</code> 플래그를 설정 하여 액세스합니다. HTTP, Stream 또는 Mail과 같은 모듈은 구성 계층을 만듭니다. 예를 들어 <code>server</code> , <code>location</code> 및 <code>if</code> 범위에 대한 모듈 구성이 작성됩니다 .
ru: Поле <code>conf</code> определяет, какая структура конфигурации передается обработчику каталога. Базовые модули имеют только глобальную конфигурацию и устанавливают флаг <code>NGX_DIRECT_CONF</code> для доступа к ней. Такие модули, как HTTP, Stream или Mail, создают иерархию конфигураций. Например, конфигурация модуля создаются для <code>server</code> , <code>location</code> и <code>if</code> прицелы.
zh_cn: 在 <code>conf</code> 字段定义该配置结构被传递给该目录处理程序。核心模块仅具有全局配置，并设置 <code>NGX_DIRECT_CONF</code> 标志以对其进行访问。HTTP，Stream或Mail之类的模块会创建配置层次结构。例如，将为 <code>server</code> ， <code>location</code> 和 <code>if</code> scope 创建模块的配置。

source: The <code>config</code> file is a POSIX shell script that can set and access the following variables:
es: El archivo de <code>config</code> uraci&oacute;n es un script de shell POSIX que puede establecer y acceder a las siguientes variables:
ja: <code>config</code> ファイルには、次の変数を設定し、アクセスすることができますPOSIXシェルスクリプトです：
ko: <code>config</code> 파일은 다음과 같은 변수를 설정하고 액세스 할 수있는 POSIX 쉘 스크립트입니다 :
ru: <code>config</code> файл сценария POSIX оболочки , который можно установить и получить доступ к следующим переменным:
zh_cn: 该 <code>config</code> 文件是一个POSIX shell脚本，可以设置和访问下列变量：

source: The <code>configure</code> command supports the following parameters:
es: El comando <code>configure</code> admite los siguientes par&aacute;metros:
ja: <code>configure</code> コマンドは、次のパラメータをサポートしています。
ko: <code>configure</code> 명령은 다음 매개 변수를 지원합니다 :
ru: Команда <code>configure</code> поддерживает следующие параметры:
zh_cn: 的 <code>configure</code> 命令支持以下参数：

source: The <code>default</code> parameter is not permitted if <a href="#proxy_pass">proxy_pass</a> is specified using variables.
es: El par&aacute;metro <code>default</code> no est&aacute; permitido si <a href="#proxy_pass">proxy_pass</a> se especifica mediante variables.
ja: <code>default</code> 場合は、パラメータが許可されていない<a href="#proxy_pass">proxy_passは、</a>変数を使用して指定されています。
ko: <code>default</code> 경우 매개 변수는 허용되지 않습니다 <a href="#proxy_pass">proxy_pass이</a> 변수를 사용하여 지정됩니다.
ru: Параметр по <code>default</code> не разрешен, если <a href="#proxy_pass">proxy_pass</a> указан с использованием переменных.
zh_cn: 在 <code>default</code> ，如果参数中不允许<a href="#proxy_pass">proxy_pass</a>使用变量指定。

source: The <code>default_server</code> parameter has been available since version 0.8.21. In earlier versions the <code>default</code> parameter should be used instead.
es: El par&aacute;metro <code>default_server</code> est&aacute; disponible desde la versi&oacute;n 0.8.21. En versiones anteriores, se deber&iacute;a utilizar el par&aacute;metro <code>default</code> .
ja: <code>default_server</code> パラメータは、バージョン0.8.21以降で利用可能です。以前のバージョンでは、代わりに <code>default</code> パラメーターを使用する必要があります。
ko: <code>default_server</code> 의 매개 변수는 버전 0.8.21부터 사용할 수있다. 이전 버전에서는 <code>default</code> 매개 변수를 대신 사용해야합니다.
ru: Параметр <code>default_server</code> доступен с версии 0.8.21. В более ранних версиях вместо этого следует использовать параметр по <code>default</code> .
zh_cn: 自0.8.21版本以来， <code>default_server</code> 参数已可用。在早期版本中，应改用 <code>default</code> 参数。
