Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/nginx/nginx.*.004.xlf
Languages: es, ja, ko, ru, zh_cn

source: The total number of attempts to allocate memory of specified size.
es: El número total de intentos de asignar memoria de tamaño especificado.
ko: 지정된 크기의 메모리를 할당하려는 총 시도 횟수입니다.

source: The total number of bytes read from the cache.
es: El número total de bytes leídos de la memoria caché.
ko: 캐시에서 읽은 총 바이트 수입니다.

source: The total number of bytes read from the proxied server.
es: El número total de bytes leídos del servidor proxy.
ko: 프록시 서버에서 읽은 총 바이트 수입니다.

source: The total number of bytes received from clients.
es: El número total de bytes recibidos de los clientes.
ko: 클라이언트로부터받은 총 바이트 수입니다.

source: The total number of bytes received from this server.
es: El número total de bytes recibidos de este servidor.
ko: 이 서버에서받은 총 바이트 수입니다.

source: The total number of bytes sent to clients.
es: El número total de bytes enviados a los clientes.
ko: 클라이언트에 전송 된 총 바이트 수입니다.

source: The total number of bytes sent to this server.
es: El número total de bytes enviados a este servidor.
ko: 이 서버로 전송 된 총 바이트 수입니다.

source: The total number of bytes written to the cache.
es: El número total de bytes escritos en el caché.
ko: 캐시에 쓴 총 바이트 수입니다.

source: The total number of client connections forwarded to this server.
es: El número total de conexiones de clientes reenviadas a este servidor.
ko: 이 서버로 전달 된 총 클라이언트 연결 수입니다.

source: The total number of client requests forwarded to this server.
es: El número total de solicitudes de clientes remitidas a este servidor.
ko: 이 서버로 전달 된 총 클라이언트 요청 수입니다.

source: The total number of client requests received from clients.
es: El número total de solicitudes de clientes recibidas de los clientes.
ko: 클라이언트로부터받은 총 클라이언트 요청 수입니다.

source: The total number of client requests.
es: El número total de solicitudes de clientes.
ko: 총 클라이언트 요청 수

source: The total number of completed client sessions.
es: El número total de sesiones de clientes completadas.
ko: 완료된 총 클라이언트 세션 수입니다.

source: The total number of completed sessions, and the number of sessions completed with status codes &ldquo;<code>2xx</code>&rdquo;, &ldquo;<code>4xx</code>&rdquo;, or &ldquo;<code>5xx</code>&rdquo;.
es: El n&uacute;mero total de sesiones completadas y el n&uacute;mero de sesiones completadas con los c&oacute;digos de estado " <code>2xx</code> ", " <code>4xx</code> " o " <code>5xx</code> ".
ko: 완료된 총 세션 수 및 상태 코드 " <code>2xx</code> ", " <code>4xx</code> "또는 " <code>5xx</code> " 로 완료된 세션 수

source: The total number of configuration <a href="../control#reconfiguration">reloads</a>.
es: El n&uacute;mero total de <a href="../control#reconfiguration">recargas</a> de configuraci&oacute;n .
ko: 구성의 총 수 <a href="../control#reconfiguration">를 다시로드</a> .

source: The total number of connections accepted from clients.
es: El número total de conexiones aceptadas de los clientes.
ko: 클라이언트가 수락 한 총 연결 수입니다.

source: The total number of connections completed without creating a session.
es: El número total de conexiones completadas sin crear una sesión.
ko: 세션을 만들지 않고 완료된 총 연결 수입니다.

source: The total number of dropped client connections.
es: El número total de conexiones de clientes abandonados.
ko: 삭제 된 총 클라이언트 연결 수입니다.

source: The total number of expired and revalidated responses read from the cache (see <a href="ngx_http_proxy_module#proxy_cache_revalidate">proxy_cache_revalidate</a> and other &ldquo;<code>*_cache_revalidate</code>&rdquo; directives.
es: El n&uacute;mero total de respuestas caducadas y revalidadas le&iacute;das del cach&eacute; (consulte <a href="ngx_http_proxy_module#proxy_cache_revalidate">proxy_cache_revalidate</a> y otras directivas " <code>*_cache_revalidate</code> ".
ko: 캐시에서 읽은 만료 및 재확인 된 총 응답 수 ( <a href="ngx_http_proxy_module#proxy_cache_revalidate">proxy_cache_revalidate</a> 및 기타&ldquo; <code>*_cache_revalidate</code> &rdquo;지시문 참조)

source: The total number of expired responses not taken from the cache.
es: El número total de respuestas caducadas no tomadas de la memoria caché.
ko: 캐시에서 가져 오지 않은 총 만료 된 응답 수입니다.

source: The total number of expired responses read from the cache (see <a href="ngx_http_proxy_module#proxy_cache_use_stale">proxy_cache_use_stale</a> and other &ldquo;<code>*_cache_use_stale</code>&rdquo; directives).
es: El n&uacute;mero total de respuestas caducadas le&iacute;das de la cach&eacute; (consulte <a href="ngx_http_proxy_module#proxy_cache_use_stale">proxy_cache_use_stale</a> y otras directivas &ldquo; <code>*_cache_use_stale</code> &rdquo;).
ko: 캐시에서 읽은 만료 된 총 응답 수입니다 ( <a href="ngx_http_proxy_module#proxy_cache_use_stale">proxy_cache_use_stale</a> 및 기타&ldquo; <code>*_cache_use_stale</code> &rdquo;지시문 참조).

source: The total number of expired responses read from the cache while responses were being updated (see <a href="ngx_http_proxy_module#proxy_cache_use_stale_updating">proxy_cache_use_stale</a> and other &ldquo;<code>*_cache_use_stale</code>&rdquo; directives).
es: El n&uacute;mero total de respuestas caducadas le&iacute;das del cach&eacute; mientras se actualizaban las respuestas (consulte las <a href="ngx_http_proxy_module#proxy_cache_use_stale_updating">directivas proxy_cache_use_stale</a> y otras directivas &ldquo; <code>*_cache_use_stale</code> &rdquo;).
ko: 응답이 업데이트되는 동안 캐시에서 읽은 만료 된 총 응답 수입니다 ( <a href="ngx_http_proxy_module#proxy_cache_use_stale_updating">proxy_cache_use_stale</a> 및 기타&ldquo; <code>*_cache_use_stale</code> &rdquo;지시문 참조).

source: The total number of failed SSL handshakes.
es: El número total de apretones de manos SSL fallidos.
ko: 실패한 총 SSL 핸드 셰이크 수입니다.

source: The total number of handled connections. Generally, the parameter value is the same as <code>accepts</code> unless some resource limits have been reached (for example, the <a href="../ngx_core_module#worker_connections">worker_connections</a> limit).
es: El n&uacute;mero total de conexiones gestionadas. Generalmente, el valor del par&aacute;metro es el mismo que <code>accepts</code> a menos que se han alcanzado algunos l&iacute;mites de recursos (por ejemplo, los <a href="../ngx_core_module#worker_connections">worker_connections</a> l&iacute;mite).
ko: 처리 된 총 연결 수입니다. 일반적으로, 파라미터 값과 동일 <code>accepts</code> 일부 자원 한계에 도달하지 않은 경우 (예를 들어, <a href="../ngx_core_module#worker_connections">worker_connections가</a> 제한).

source: The total number of records stored in the shared memory zone.
es: El número total de registros almacenados en la zona de memoria compartida.
ko: 공유 메모리 영역에 저장된 총 레코드 수입니다.

source: The total number of requests completed without sending a response.
es: El número total de solicitudes completadas sin enviar una respuesta.
ko: 응답을 보내지 않고 완료된 총 요청 수입니다.

source: The total number of requests rejected due to the queue overflow.
es: El número total de solicitudes rechazadas debido al desbordamiento de la cola.
ko: 큐 오버 플로우로 인해 거부 된 총 요청 수입니다.

source: The total number of responses not found in the cache.
es: El número total de respuestas no encontradas en el caché.
ko: 캐시에서 찾을 수없는 총 응답 수입니다.

source: The total number of responses not looked up in the cache due to the <a href="ngx_http_proxy_module#proxy_cache_bypass">proxy_cache_bypass</a> and other &ldquo;<code>*_cache_bypass</code>&rdquo; directives.
es: El n&uacute;mero total de respuestas no <a href="ngx_http_proxy_module#proxy_cache_bypass">buscadas</a> en la cach&eacute; debido a las directivas proxy_cache_bypass y otras directivas " <code>*_cache_bypass</code> ".
ko: <a href="ngx_http_proxy_module#proxy_cache_bypass">proxy_cache_bypass</a> 및 기타 " <code>*_cache_bypass</code> "지시문 으로 인해 캐시에서 찾지 못한 총 응답 수입니다 .

source: The total number of responses not taken from the cache (misses, expires, or bypasses due to <a href="ngx_http_proxy_module#proxy_cache_bypass">proxy_cache_bypass</a> and the likes).
es: La cantidad total de respuestas que no se toman de la cach&eacute; (fallas, <a href="ngx_http_proxy_module#proxy_cache_bypass">caducas</a> o omisiones debido a proxy_cache_bypass y similares ).
ko: 캐시에서 가져 오지 않은 총 응답 수 ( <a href="ngx_http_proxy_module#proxy_cache_bypass">proxy_cache_bypass</a> 등 으로 인해 누락, 만료 또는 우회 )

source: The total number of responses obtained from this server.
es: El número total de respuestas obtenidas de este servidor.
ko: 이 서버에서 얻은 총 응답 수입니다.

source: The total number of responses read from the cache (hits, or stale responses due to <a href="ngx_http_proxy_module#proxy_cache_use_stale">proxy_cache_use_stale</a> and the likes).
es: El n&uacute;mero total de respuestas le&iacute;das de la cach&eacute; (aciertos o respuestas obsoletas debido a <a href="ngx_http_proxy_module#proxy_cache_use_stale">proxy_cache_use_stale</a> y me gusta).
ko: 캐시에서 읽은 총 응답 수 ( <a href="ngx_http_proxy_module#proxy_cache_use_stale">proxy_cache_use_stale</a> 등 으로 인해 적중 또는 오래된 응답 )

source: The total number of responses sent to clients and the number of responses with status codes &ldquo;<code>1xx</code>&rdquo;, &ldquo;<code>2xx</code>&rdquo;, &ldquo;<code>3xx</code>&rdquo;, &ldquo;<code>4xx</code>&rdquo;, and &ldquo;<code>5xx</code>&rdquo;.
es: El n&uacute;mero total de respuestas enviadas a los clientes y el n&uacute;mero de respuestas con los c&oacute;digos de estado &ldquo; <code>1xx</code> &rdquo;, &ldquo; <code>2xx</code> &rdquo;, &ldquo; <code>3xx</code> &rdquo;, &ldquo; <code>4xx</code> &rdquo; y &ldquo; <code>5xx</code> &rdquo;.
ko: 클라이언트에 전송 된 총 응답 수 및 상태 코드가 " <code>1xx</code> ", " <code>2xx</code> ", " <code>3xx</code> ", " <code>4xx</code> "및 " <code>5xx</code> " 인 응답 수입니다 .

source: The total number of responses sent to clients.
es: El número total de respuestas enviadas a los clientes.
ko: 고객에게 보낸 총 응답 수입니다.

source: The total number of responses written to the cache.
es: El número total de respuestas escritas en el caché.
ko: 캐시에 쓴 총 응답 수입니다.

source: The total number of session reuses during SSL handshake.
es: El número total de reutilizaciones de sesión durante el apretón de manos SSL.
ko: SSL 핸드 셰이크 중 총 세션 재사용 횟수입니다.

source: The total number of sessions completed with <a href="../stream/ngx_stream_core_module#var_status">status codes</a> &ldquo;<code>2xx</code>&rdquo;.
es: El n&uacute;mero total de sesiones completadas con los <a href="../stream/ngx_stream_core_module#var_status">c&oacute;digos de estado</a> &ldquo; <code>2xx</code> &rdquo;.
ko: <a href="../stream/ngx_stream_core_module#var_status">상태 코드</a> " <code>2xx</code> "로 완료된 총 세션 수입니다 .

source: The total number of sessions completed with <a href="../stream/ngx_stream_core_module#var_status">status codes</a> &ldquo;<code>4xx</code>&rdquo;.
es: El n&uacute;mero total de sesiones completadas con los <a href="../stream/ngx_stream_core_module#var_status">c&oacute;digos de estado</a> &ldquo; <code>4xx</code> &rdquo;.
ko: <a href="../stream/ngx_stream_core_module#var_status">상태 코드</a> " <code>4xx</code> "로 완료된 총 세션 수입니다 .

source: The total number of sessions completed with <a href="../stream/ngx_stream_core_module#var_status">status codes</a> &ldquo;<code>5xx</code>&rdquo;.
es: El n&uacute;mero total de sesiones completadas con los <a href="../stream/ngx_stream_core_module#var_status">c&oacute;digos de estado</a> &ldquo; <code>5xx</code> &rdquo;.
ko: <a href="../stream/ngx_stream_core_module#var_status">상태 코드</a> " <code>5xx</code> "로 완료된 총 세션 수입니다 .

source: The total number of successful SSL handshakes.
es: El número total de apretones de manos SSL exitosos.
ko: 성공적인 SSL 핸드 셰이크의 총 수

source: The total number of unsuccessful attempts to communicate with the server.
es: El número total de intentos fallidos de comunicación con el servidor.
ko: 서버와의 통신에 실패한 총 횟수입니다.

source: The traversal is pretty straightforward and can be demonstrated with the following lookup function pattern:
es: La travesía es bastante sencilla y puede demostrarse con el siguiente patrón de función de búsqueda:
ko: 순회는 매우 간단하며 다음 조회 기능 패턴으로 시연 할 수 있습니다.

source: The type for nginx pools is <code>ngx_pool_t</code>. The following operations are supported:
es: El tipo de agrupaciones nginx es <code>ngx_pool_t</code> . Las operaciones siguientes son compatibles:
ko: nginx 풀의 유형은 <code>ngx_pool_t</code> 입니다. 다음 작업이 지원됩니다.

source: The use of a port in redirects is controlled by the <a href="#port_in_redirect">port_in_redirect</a> directive.
es: El uso de un puerto en redirecciones est&aacute; controlado por la directiva <a href="#port_in_redirect">port_in_redirect</a> .
ko: 경로 재 지정에서 포트 사용은 <a href="#port_in_redirect">port_in_redirect</a> 지시문에 의해 제어됩니다 .

source: The use of the primary server name in redirects is controlled by the <a href="#server_name_in_redirect">server_name_in_redirect</a> directive.
es: El uso del nombre del servidor primario en las redirecciones est&aacute; controlado por la directiva <a href="#server_name_in_redirect">server_name_in_redirect</a> .
ko: 리디렉션에서 기본 서버 이름의 사용은 <a href="#server_name_in_redirect">server_name_in_redirect</a> 지시문에 의해 제어됩니다 .

source: The value &ldquo;<code>always</code>&rdquo; will cause nginx to unconditionally wait for and process additional client data.
es: El valor " <code>always</code> " har&aacute; que nginx espere incondicionalmente y procese datos adicionales del cliente.
ko: " <code>always</code> " 값 은 nginx가 추가 클라이언트 데이터를 무조건 대기하고 처리하게합니다.

source: The value &ldquo;<code>off</code>&rdquo; tells nginx to never wait for more data and close the connection immediately. This behavior breaks the protocol and should not be used under normal circumstances.
es: El valor " <code>off</code> " le dice a nginx que nunca espere m&aacute;s datos y cierre la conexi&oacute;n inmediatamente. Este comportamiento rompe el protocolo y no debe usarse en circunstancias normales.
ko: " <code>off</code> " 값 은 nginx가 더 많은 데이터를 기다리지 않고 연결을 즉시 닫도록 지시합니다. 이 동작은 프로토콜을 손상 시키므로 정상적인 상황에서는 사용해서는 안됩니다.

source: The value <code>clean</code> will cause the temporary files left after request processing to be removed.
es: El valor <code>clean</code> har&aacute; que se eliminen los archivos temporales que quedan despu&eacute;s del procesamiento de la solicitud.
ko: <code>clean</code> 값 은 요청 처리 후 남은 임시 파일을 제거합니다.

source: The value <code>data</code>:<code><i>$variable</i></code> can be specified instead of the <code><i>file</i></code> (1.15.10), which loads a certificate from a variable without using intermediate files. Note that inappropriate use of this syntax may have its security implications, such as writing secret key data to <a href="../ngx_core_module#error_log">error log</a>.
es: Se puede especificar el valor de <code>data</code> : <code><i>$variable</i></code> lugar del <code><i>file</i></code> (1.15.10), que carga un certificado de una variable sin utilizar archivos intermedios. Tenga en cuenta que el uso inadecuado de esta sintaxis puede tener implicaciones de seguridad, como escribir datos de clave secreta en el <a href="../ngx_core_module#error_log">registro de errores</a> .
ko: 값 <code>data</code> : <code><i>$variable</i></code> 은 <code><i>file</i></code> (1.15.10) 대신 지정 될 수 있으며 중간 파일을 사용하지 않고 변수에서 인증서를로드합니다. 이 구문을 부적절하게 사용하면 비밀 키 데이터를 <a href="../ngx_core_module#error_log">오류 로그에</a> 쓰는 것과 같이 보안에 영향을 줄 수 있습니다 .

source: The value <code>data</code>:<code><i>$variable</i></code> can be specified instead of the <code><i>file</i></code> (1.15.10), which loads a secret key from a variable without using intermediate files. Note that inappropriate use of this syntax may have its security implications, such as writing secret key data to <a href="../ngx_core_module#error_log">error log</a>.
es: Se puede especificar el valor de <code>data</code> : <code><i>$variable</i></code> lugar del <code><i>file</i></code> (1.15.10), que carga una clave secreta de una variable sin utilizar archivos intermedios. Tenga en cuenta que el uso inadecuado de esta sintaxis puede tener implicaciones de seguridad, como escribir datos de clave secreta en el <a href="../ngx_core_module#error_log">registro de errores</a> .
ko: 값 <code>data</code> : <code><i>$variable</i></code> 은 <code><i>file</i></code> (1.15.10) 대신 지정 될 수 있으며 중간 파일을 사용하지 않고 변수에서 비밀 키를로드합니다. 이 구문을 부적절하게 사용하면 비밀 키 데이터를 <a href="../ngx_core_module#error_log">오류 로그에</a> 쓰는 것과 같이 보안에 영향을 줄 수 있습니다 .

source: The value <code>data</code>:<code><i>certificate</i></code> can be specified instead of the <code><i>file</i></code> (1.15.10), which loads a certificate without using intermediate files. Note that inappropriate use of this syntax may have its security implications, such as writing secret key data to <a href="../ngx_core_module#error_log">error log</a>.
es: Se puede especificar el valor <code>data</code> : <code><i>certificate</i></code> lugar del <code><i>file</i></code> (1.15.10), que carga un certificado sin utilizar archivos intermedios. Tenga en cuenta que el uso inadecuado de esta sintaxis puede tener implicaciones de seguridad, como escribir datos de clave secreta en el <a href="../ngx_core_module#error_log">registro de errores</a> .
ko: 중간 파일을 사용하지 않고 인증서를로드하는 <code><i>file</i></code> (1.15.10) 대신 <code>data</code> : <code><i>certificate</i></code> 값을 지정할 수 있습니다 . 이 구문을 부적절하게 사용하면 비밀 키 데이터를 <a href="../ngx_core_module#error_log">오류 로그에</a> 쓰는 것과 같이 보안에 영향을 줄 수 있습니다 .<i></i>

source: The value <code>data</code>:<code><i>key</i></code> can be specified instead of the <code><i>file</i></code> (1.15.10), which loads a secret key without using intermediate files. Note that inappropriate use of this syntax may have its security implications, such as writing secret key data to <a href="../ngx_core_module#error_log">error log</a>.
es: Se puede especificar el valor <code>data</code> : <code><i>key</i></code> en lugar del <code><i>file</i></code> (1.15.10), que carga una clave secreta sin utilizar archivos intermedios. Tenga en cuenta que el uso inadecuado de esta sintaxis puede tener implicaciones de seguridad, como escribir datos de clave secreta en el <a href="../ngx_core_module#error_log">registro de errores</a> .
ko: 중간 파일을 사용하지 않고 비밀 키를로드하는 <code><i>file</i></code> (1.15.10) 대신 <code>data</code> : <code><i>key</i></code> 값을 지정할 수 있습니다 . 이 구문을 부적절하게 사용하면 비밀 키 데이터를 <a href="../ngx_core_module#error_log">오류 로그에</a> 쓰는 것과 같이 보안에 영향을 줄 수 있습니다 .<i></i>

source: The value <code>engine</code>:<code><i>name</i></code>:<code><i>id</i></code> can be specified instead of the <code><i>file</i></code> (1.7.9), which loads a secret key with a specified <code><i>id</i></code> from the OpenSSL engine <code><i>name</i></code>.
es: El valor <code>engine</code> : <code><i>name</i></code> : <code><i>id</i></code> se puede especificar en lugar del <code><i>file</i></code> (1.7.9), que carga una clave secreta con un <code><i>id</i></code> especificado del <code><i>name</i></code> motor OpenSSL .
ko: <code><i>file</i></code> (1.7.9) 대신 <code>engine</code> : <code><i>name</i></code> : <code><i>id</i></code> 값을 지정할 수 있습니다.이 <i>파일</i> 은 OpenSSL 엔진 <code><i>name</i></code> 에서 지정된 <code><i>id</i></code> 를 가진 비밀 키를로드합니다 .<i></i>

source: The value <code>engine</code>:<code><i>name</i></code>:<code><i>id</i></code> can be specified instead of the <code><i>file</i></code>, which loads a secret key with a specified <code><i>id</i></code> from the OpenSSL engine <code><i>name</i></code>.
es: El valor <code>engine</code> : <code><i>name</i></code> : <code><i>id</i></code> se puede especificar en lugar del <code><i>file</i></code> , que carga una clave secreta con un <code><i>id</i></code> especificado del <code><i>name</i></code> motor OpenSSL .
ko: <code><i>file</i></code> 대신 <code>engine</code> : <code><i>name</i></code> : <code><i>id</i></code> 값을 지정할 수 있습니다 . 이 값 은 OpenSSL 엔진 <code><i>name</i></code> 에서 지정된 <code><i>id</i></code> 를 가진 비밀 키를로드합니다 .<i></i><i></i><i></i>

source: The value of <code>$uri</code> may change during request processing, e.g. when doing internal redirects, or when using index files.
es: El valor de <code>$uri</code> puede cambiar durante el procesamiento de la solicitud, por ejemplo, al realizar redireccionamientos internos o al utilizar archivos de &iacute;ndice.
ko: 요청 처리 중에 (예 : 내부 리디렉션을 수행 할 때 또는 인덱스 파일을 사용할 때) <code>$uri</code> 값 이 변경 될 수 있습니다.

source: The value of the original string is hashed using MurmurHash2. In the example given, hash values from 0 to 21474835 (0.5%) correspond to the value <code>".one"</code> of the <code>$variant</code> variable, hash values from 21474836 to 107374180 (2%) correspond to the value <code>".two"</code>, and hash values from 107374181 to 4294967295 correspond to the value <code>""</code> (an empty string).
es: El valor de la cadena original se hash utilizando MurmurHash2. En el ejemplo dado, los valores hash de 0 a 21474835 (0.5%) corresponden al valor <code>".one"</code> de la variable <code>$variant</code> , los valores hash de 21474836 a 107374180 (2%) corresponden al valor <code>".two"</code> y hash los valores de 107374181 a 4294967295 corresponden al valor <code>""</code> (una cadena vac&iacute;a).
ko: 원래 문자열의 값은 MurmurHash2를 사용하여 해시됩니다. 주어진 예에서, 0-21474835 (0.5 %)의 해시 값 은 <code>$variant</code> 변수 의 <code>".one"</code> 값에 해당하고 21474836-107374180 (2 %)의 해시 값은 <code>".two"</code> 값에 해당 하고 hash 107374181에서 4294967295까지의 값은 <code>""</code> (빈 문자열) 값에 해당합니다 .

source: The values of <code>ngx_errno</code> and <code>ngx_socket_errno</code> can be passed to the logging functions <code>ngx_log_error()</code> and <code>ngx_log_debugX()</code>, in which case system error text is added to the log message.
es: Los valores de <code>ngx_errno</code> y <code>ngx_socket_errno</code> se pueden pasar a las funciones de registro <code>ngx_log_error()</code> y <code>ngx_log_debugX()</code> , en cuyo caso el texto de error del sistema se agrega al mensaje de registro.
ko: <code>ngx_errno</code> 및 <code>ngx_socket_errno</code> 값은 로깅 함수 <code>ngx_log_error()</code> 및 <code>ngx_log_debugX()</code> 로 전달 될 수 있으며 ,이 경우 시스템 오류 텍스트가 로그 메시지에 추가됩니다.

source: The variable is available only for new sessions.
es: La variable está disponible sólo para nuevas sesiones.
ko: 변수는 새 세션에만 사용할 수 있습니다.

source: The variable is deprecated, the <code>$ssl_client_escaped_cert</code> variable should be used instead.
es: La variable est&aacute; en desuso, la variable <code>$ssl_client_escaped_cert</code> debe usarse en su lugar.
ko: 이 변수는 더 이상 사용되지 않으며 <code>$ssl_client_escaped_cert</code> 변수를 대신 사용해야합니다.

source: The variable is fully supported only when using OpenSSL version 1.0.2 or higher. With older versions, the variable is available only for new sessions and lists only known ciphers.
es: La variable está totalmente soportada sólo cuando se utiliza la versión 1.0.2 o superior de OpenSSL.Con versiones anteriores,la variable está disponible sólo para nuevas sesiones y sólo lista los cifrados conocidos.
ko: 변수는 OpenSSL 버전 1.0.2 이상을 사용하는 경우에만 완전히 지원됩니다. 이전 버전에서는 변수가 새 세션에서만 사용 가능하며 알려진 암호 만 나열합니다.

source: The variable is supported only when using OpenSSL version 1.0.2 or higher. With older versions, the variable value will be an empty string.
es: La variable sólo se admite cuando se utiliza la versión 1.0.2 o superior de OpenSSL.Con versiones anteriores,el valor de la variable será una cadena vacía.
ko: 변수는 OpenSSL 버전 1.0.2 이상을 사용하는 경우에만 지원됩니다. 이전 버전에서는 변수 값이 빈 문자열이됩니다.
