Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/nginx/nginx.*.004.xlf
Languages: es, ja, ko, ru, zh_cn

source: The <code>ngx_http_auth_jwt_module</code> module (1.11.3) implements client authorization by validating the provided <a href="https://tools.ietf.org/html/rfc7519">JSON Web Token</a> (JWT) using the specified keys. JWT claims must be encoded in a <a href="https://tools.ietf.org/html/rfc7515">JSON Web Signature</a> (JWS) structure. The module can be used for <a href="http://openid.net/specs/openid-connect-core-1_0.html">OpenID Connect</a> authentication.
es: El m&oacute;dulo <code>ngx_http_auth_jwt_module</code> (1.11.3) implementa la autorizaci&oacute;n del cliente al validar el <a href="https://tools.ietf.org/html/rfc7519">JSON Web Token</a> (JWT) proporcionado utilizando las claves especificadas. Las declaraciones de JWT deben estar codificadas en una estructura de <a href="https://tools.ietf.org/html/rfc7515">firma web JSON</a> (JWS). El m&oacute;dulo se puede utilizar para la autenticaci&oacute;n <a href="http://openid.net/specs/openid-connect-core-1_0.html">OpenID Connect</a> .
ja: <code>ngx_http_auth_jwt_module</code> モジュール提供を検証することによって（1.11.3）を実装するクライアント許可<a href="https://tools.ietf.org/html/rfc7519">JSONウェブトークン</a>指定されたキーを使用して（JWT）を。JWTクレームは、<a href="https://tools.ietf.org/html/rfc7515">JSON Web Signature</a>（JWS）構造でエンコードする必要があります。このモジュールは、<a href="http://openid.net/specs/openid-connect-core-1_0.html">OpenID Connect</a>認証に使用できます。
ko: <code>ngx_http_auth_jwt_module</code> 의 모듈 제공 유효성을 검사하여 (1.11.3) 구현 클라이언트 인증 <a href="https://tools.ietf.org/html/rfc7519">JSON 웹 토큰</a> 지정된 키를 사용하여 (JWT)을. JWT 클레임은 <a href="https://tools.ietf.org/html/rfc7515">JSON</a> ( JSON Web Signature ) 구조 로 인코딩해야합니다 . 이 모듈은 <a href="http://openid.net/specs/openid-connect-core-1_0.html">OpenID Connect</a> 인증에 사용될 수 있습니다 .
ru: Модуль <code>ngx_http_auth_jwt_module</code> (1.11.3) реализует авторизацию клиента, проверяя предоставленный <a href="https://tools.ietf.org/html/rfc7519">веб-токен JSON</a> (JWT) с помощью указанных ключей. Утверждения JWT должны быть закодированы в структуре <a href="https://tools.ietf.org/html/rfc7515">веб-подписи JSON</a> (JWS). Модуль может использоваться для аутентификации <a href="http://openid.net/specs/openid-connect-core-1_0.html">OpenID Connect</a> .
zh_cn: 所述 <code>ngx_http_auth_jwt_module</code> 模块通过验证所提供的（1.11.3）实现客户机授权<a href="https://tools.ietf.org/html/rfc7519">JSON网络令牌</a>使用指定键（JWT）。JWT声明必须以<a href="https://tools.ietf.org/html/rfc7515">JSON Web签名</a>（JWS）结构进行编码。该模块可用于<a href="http://openid.net/specs/openid-connect-core-1_0.html">OpenID Connect</a>身份验证。

source: The <code>ngx_http_auth_jwt_module</code> module supports embedded variables:
es: El m&oacute;dulo <code>ngx_http_auth_jwt_module</code> admite variables integradas:
ja: <code>ngx_http_auth_jwt_module</code> モジュールは、組み込み変数をサポートしています。
ko: <code>ngx_http_auth_jwt_module</code> 모듈 내장 변수를 지원한다 :
ru: Модуль <code>ngx_http_auth_jwt_module</code> поддерживает встроенные переменные:
zh_cn: 该 <code>ngx_http_auth_jwt_module</code> 模块支持嵌入变量：

source: The <code>ngx_http_auth_request_module</code> module (1.5.4+) implements client authorization based on the result of a subrequest. If the subrequest returns a 2xx response code, the access is allowed. If it returns 401 or 403, the access is denied with the corresponding error code. Any other response code returned by the subrequest is considered an error.
es: El m&oacute;dulo <code>ngx_http_auth_request_module</code> (1.5.4+) implementa la autorizaci&oacute;n del cliente en funci&oacute;n del resultado de una subconsulta. Si la subconsulta devuelve un c&oacute;digo de respuesta 2xx, se permite el acceso. Si devuelve 401 o 403, se deniega el acceso con el c&oacute;digo de error correspondiente. Cualquier otro c&oacute;digo de respuesta devuelto por la solicitud secundaria se considera un error.
ja: <code>ngx_http_auth_request_module</code> サブリクエストの結果に基づいて、モジュール（1.5.4+）実装のクライアント許可。サブリクエストが2xx応答コードを返す場合、アクセスは許可されます。401または403を返す場合、アクセスは拒否され、対応するエラーコードが表示されます。サブリクエストによって返されたその他の応答コードはエラーと見なされます。
ko: <code>ngx_http_auth_request_module</code> subrequest의 결과에 기초하여, 모듈 (1.5.4+)를 구현 클라이언트 인증. 서브 요청이 2xx 응답 코드를 리턴하면 액세스가 허용됩니다. 401 또는 403을 반환하면 해당 오류 코드로 액세스가 거부됩니다. 서브 요청에 의해 리턴 된 다른 응답 코드는 오류로 간주됩니다.
ru: Модуль <code>ngx_http_auth_request_module</code> (1.5.4+) реализует авторизацию клиента на основе результата подзапроса. Если подзапрос возвращает код ответа 2xx, доступ разрешен. Если он возвращает 401 или 403, доступ запрещается с соответствующим кодом ошибки. Любой другой код ответа, возвращенный подзапросом, считается ошибкой.
zh_cn: 在 <code>ngx_http_auth_request_module</code> 基于一个子请求的结果模块（1.5.4+）实现客户机授权。如果子请求返回2xx响应代码，则允许访问。如果返回401或403，则使用相应的错误代码拒绝访问。子请求返回的任何其他响应代码都被视为错误。

source: The <code>ngx_http_autoindex_module</code> module processes requests ending with the slash character (&lsquo;<code>/</code>&rsquo;) and produces a directory listing. Usually a request is passed to the <code>ngx_http_autoindex_module</code> module when the <a href="ngx_http_index_module">ngx_http_index_module</a> module cannot find an index file.
es: El m&oacute;dulo <code>ngx_http_autoindex_module</code> procesa las solicitudes que terminan con el car&aacute;cter de barra (' <code>/</code> ') y produce una lista de directorios. Por lo general, se pasa una solicitud al m&oacute;dulo <code>ngx_http_autoindex_module</code> cuando el m&oacute;dulo <a href="ngx_http_index_module">ngx_http_index_module</a> no puede encontrar un archivo de &iacute;ndice.
ja: <code>ngx_http_autoindex_module</code> モジュールプロセスのスラッシュ文字で終わるリクエスト（「 <code>/</code> 」）とディレクトリのリストを生成します。通常、<a href="ngx_http_index_module">ngx_http_index_module</a>モジュールがインデックスファイルを見つけられない場合、リクエストは <code>ngx_http_autoindex_module</code> モジュールに渡されます。
ko: <code>ngx_http_autoindex_module</code> 모듈을 처리 슬래시 문자로 끝나는 요청 ( ' <code>/</code> ') 및 디렉토리 목록을 생성합니다. 일반적으로 <a href="ngx_http_index_module">ngx_http_index_module</a> 모듈이 색인 파일을 찾을 수없는 경우 요청이 <code>ngx_http_autoindex_module</code> 모듈 로 전달 됩니다.
ru: Модуль <code>ngx_http_autoindex_module</code> обрабатывает запросы, заканчивающиеся символом косой черты (' <code>/</code> '), и создает список каталогов. Обычно запрос передается модулю <code>ngx_http_autoindex_module</code> , когда модуль <a href="ngx_http_index_module">ngx_http_index_module</a> не может найти индексный файл.
zh_cn: 所述 <code>ngx_http_autoindex_module</code> 与斜杠字符结束模块进程的请求（&ldquo; <code>/</code> &rdquo;），并产生一个目录列表。通常，当<a href="ngx_http_index_module">ngx_http_index_module</a>模块找不到索引文件时，会将请求传递给 <code>ngx_http_autoindex_module</code> 模块。

source: The <code>ngx_http_browser_module</code> module creates variables whose values depend on the value of the &ldquo;User-Agent&rdquo; request header field:
es: El m&oacute;dulo <code>ngx_http_browser_module</code> crea variables cuyos valores dependen del valor del campo de encabezado de solicitud "User-Agent":
ja: <code>ngx_http_browser_module</code> モジュールは、値が「ユーザエージェント」要求ヘッダフィールドの値に依存する変数を作成します。
ko: <code>ngx_http_browser_module</code> 의 모듈은 그 값이 "사용자 에이전트"요청 헤더 필드의 값에 의존하는 변수를 작성
ru: Модуль <code>ngx_http_browser_module</code> создает переменные, значения которых зависят от значения поля заголовка запроса &laquo;User-Agent&raquo;:
zh_cn: 所述 <code>ngx_http_browser_module</code> 模块创建变量，其值依赖于&ldquo;用户代理&rdquo;请求头字段的值：

source: The <code>ngx_http_charset_module</code> module adds the specified charset to the &ldquo;Content-Type&rdquo; response header field. In addition, the module can convert data from one charset to another, with some limitations:
es: El m&oacute;dulo <code>ngx_http_charset_module</code> agrega el juego de caracteres especificado al campo de encabezado de respuesta "Content-Type". Adem&aacute;s, el m&oacute;dulo puede convertir datos de un juego de caracteres a otro, con algunas limitaciones:
ja: <code>ngx_http_charset_module</code> モジュール「のContent-Type」レスポンスヘッダフィールドに指定された文字セットを追加します。さらに、モジュールはデータをある文字セットから別の文字セットに変換できますが、いくつかの制限があります：
ko: <code>ngx_http_charset_module</code> 모듈은 "Content-Type을"응답 헤더 필드에 지정된 캐릭터 세트를 추가합니다. 또한이 모듈은 한 문자 세트에서 다른 문자 세트로 데이터를 변환 할 수 있지만 몇 가지 제한 사항이 있습니다.
ru: Модуль <code>ngx_http_charset_module</code> добавляет указанную кодировку в поле заголовка ответа Content-Type. Кроме того, модуль может конвертировать данные из одной кодировки в другую с некоторыми ограничениями:
zh_cn: 所述 <code>ngx_http_charset_module</code> 模块将指定的字符集的&ldquo;内容类型&rdquo;响应报头字段。此外，该模块可以将数据从一种字符集转换为另一种字符集，但有一些限制：

source: The <code>ngx_http_core_module</code> module supports embedded variables with names matching the Apache Server variables. First of all, these are variables representing client request header fields, such as <code>$http_user_agent</code>, <code>$http_cookie</code>, and so on. Also there are other variables:
es: El m&oacute;dulo <code>ngx_http_core_module</code> admite variables incrustadas con nombres que coinciden con las variables del servidor Apache. En primer lugar, se trata de variables que representan campos de encabezado de solicitud de cliente, como <code>$http_user_agent</code> , <code>$http_cookie</code> , etc. Tambi&eacute;n hay otras variables:
ja: <code>ngx_http_core_module</code> モジュールのサポートApacheサーバ変数を一致する名前を持つ変数を埋め込まれました。まず、これらは <code>$http_user_agent</code> 、 <code>$http_cookie</code> などのクライアント要求ヘッダーフィールドを表す変数です。他の変数もあります：
ko: <code>ngx_http_core_module</code> 모듈 지원은 아파치 서버 변수와 일치하는 이름을 가진 변수를 포함. 우선, 이들은 <code>$http_user_agent</code> , <code>$http_cookie</code> 등과 같은 클라이언트 요청 헤더 필드를 나타내는 변수 입니다. 또한 다른 변수가 있습니다 :
ru: Модуль <code>ngx_http_core_module</code> поддерживает встроенные переменные с именами, соответствующими переменным сервера Apache. Прежде всего, это переменные, представляющие поля заголовка клиентского запроса, такие как <code>$http_user_agent</code> , <code>$http_cookie</code> и так далее. Также есть другие переменные:
zh_cn: 该 <code>ngx_http_core_module</code> 模块支持嵌入变量相匹配的Apache服务器变量的名称。首先，这些是代表客户端请求标头字段的变量，例如 <code>$http_user_agent</code> ， <code>$http_cookie</code> 等。另外还有其他变量：

source: The <code>ngx_http_dav_module</code> module is intended for file management automation via the WebDAV protocol. The module processes HTTP and WebDAV methods PUT, DELETE, MKCOL, COPY, and MOVE.
es: El m&oacute;dulo <code>ngx_http_dav_module</code> est&aacute; dise&ntilde;ado para la automatizaci&oacute;n de la gesti&oacute;n de archivos a trav&eacute;s del protocolo WebDAV. El m&oacute;dulo procesa los m&eacute;todos HTTP y WebDAV PUT, DELETE, MKCOL, COPY y MOVE.
ja: <code>ngx_http_dav_module</code> モジュールは、WebDAVプロトコル経由でファイル管理の自動化を目的としています。このモジュールは、HTTPおよびWebDAVメソッドのPUT、DELETE、MKCOL、COPY、およびMOVEを処理します。
ko: <code>ngx_http_dav_module</code> 모듈은 WebDAV 프로토콜을 통해 파일 관리 자동화를위한 것입니다. 모듈은 HTTP 및 WebDAV 메소드 PUT, DELETE, MKCOL, COPY 및 MOVE를 처리합니다.
ru: Модуль <code>ngx_http_dav_module</code> предназначен для автоматизации управления файлами по протоколу WebDAV. Модуль обрабатывает методы HTTP и WebDAV PUT, DELETE, MKCOL, COPY и MOVE.
zh_cn: 所述 <code>ngx_http_dav_module</code> 模块是用于经由WebDAV协议文件管理自动化。该模块处理HTTP和WebDAV方法PUT，DELETE，MKCOL，COPY和MOVE。

source: The <code>ngx_http_empty_gif_module</code> module emits single-pixel transparent GIF.
es: El m&oacute;dulo <code>ngx_http_empty_gif_module</code> emite GIF transparente de un solo p&iacute;xel.
ja: <code>ngx_http_empty_gif_module</code> モジュールは、単一ピクセルの透明GIFを発します。
ko: <code>ngx_http_empty_gif_module</code> 모듈은 단일 픽셀 투명한 GIF을 방출한다.
ru: Модуль <code>ngx_http_empty_gif_module</code> генерирует однопиксельный прозрачный GIF.
zh_cn: 所述 <code>ngx_http_empty_gif_module</code> 模块发射单像素透明GIF。

source: The <code>ngx_http_f4f_module</code> module provides server-side support for Adobe HTTP Dynamic Streaming (HDS).
es: El m&oacute;dulo <code>ngx_http_f4f_module</code> proporciona soporte del lado del servidor para Adobe HTTP Dynamic Streaming (HDS).
ja: <code>ngx_http_f4f_module</code> モジュールは、Adobe HTTPダイナミックストリーミング（HDS）のためのサーバー側のサポートを提供します。
ko: <code>ngx_http_f4f_module</code> 모듈은 어도비 HTTP 다이내믹 스트리밍 (HDS)에 대한 서버 측 지원을 제공합니다.
ru: Модуль <code>ngx_http_f4f_module</code> обеспечивает поддержку на стороне сервера для Adobe HTTP Dynamic Streaming (HDS).
zh_cn: 所述 <code>ngx_http_f4f_module</code> 模块提供的Adobe HTTP动态流（HDS）服务器端支持。

source: The <code>ngx_http_fastcgi_module</code> module allows passing requests to a FastCGI server.
es: El m&oacute;dulo <code>ngx_http_fastcgi_module</code> permite pasar solicitudes a un servidor FastCGI.
ja: <code>ngx_http_fastcgi_module</code> モジュールは、FastCGIのサーバに要求を渡すことができます。
ko: <code>ngx_http_fastcgi_module</code> 모듈은 FastCGI를 서버에 요청을 전달 할 수 있습니다.
ru: Модуль <code>ngx_http_fastcgi_module</code> позволяет передавать запросы на сервер FastCGI.
zh_cn: 该 <code>ngx_http_fastcgi_module</code> 模块允许传递请求到服务器的FastCGI。

source: The <code>ngx_http_fastcgi_module</code> module supports embedded variables that can be used to set parameters using the <a href="#fastcgi_param">fastcgi_param</a> directive:
es: El m&oacute;dulo <code>ngx_http_fastcgi_module</code> admite variables incrustadas que se pueden usar para establecer par&aacute;metros mediante la directiva <a href="#fastcgi_param">fastcgi_param</a> :
ja: <code>ngx_http_fastcgi_module</code> モジュールをサポート使用してパラメータを設定するために使用することができる組み込みの変数<a href="#fastcgi_param">fastcgi_paramの</a>ディレクティブを：
ko: <code>ngx_http_fastcgi_module</code> 모듈을 지원하여 설정 파라미터로 사용될 수있다 매립 변수 <a href="#fastcgi_param">fastcgi_param의</a> 지시자 :
ru: Модуль <code>ngx_http_fastcgi_module</code> поддерживает встроенные переменные, которые можно использовать для установки параметров с <a href="#fastcgi_param">помощью</a> директивы fastcgi_param :
zh_cn: 所述 <code>ngx_http_fastcgi_module</code> 模块支撑件嵌入变量可用于使用所设置的参数<a href="#fastcgi_param">fastcgi_param</a>指令：

source: The <code>ngx_http_flv_module</code> module provides pseudo-streaming server-side support for Flash Video (FLV) files.
es: El m&oacute;dulo <code>ngx_http_flv_module</code> proporciona soporte de pseudo-streaming del lado del servidor para archivos Flash Video (FLV).
ja: <code>ngx_http_flv_module</code> モジュールは、Flashビデオ（FLV）ファイル用の疑似ストリーミングサーバー側のサポートを提供します。
ko: <code>ngx_http_flv_module</code> 모듈은 플래시 비디오 (FLV) 파일에 대한 의사 스트리밍 서버 측 지원을 제공합니다.
ru: Модуль <code>ngx_http_flv_module</code> обеспечивает поддержку псевдопотока на стороне сервера для файлов Flash Video (FLV).
zh_cn: 该 <code>ngx_http_flv_module</code> 模块提供了对Flash视频（FLV）文件伪流传服务器端支持。

source: The <code>ngx_http_geo_module</code> module creates variables with values depending on the client IP address.
es: El m&oacute;dulo <code>ngx_http_geo_module</code> crea variables con valores que dependen de la direcci&oacute;n IP del cliente.
ja: <code>ngx_http_geo_module</code> モジュールは、クライアントのIPアドレスに応じた値を持つ変数を作成します。
ko: <code>ngx_http_geo_module</code> 모듈은 상기 클라이언트 IP 주소에 따라 값이 변수를 생성한다.
ru: Модуль <code>ngx_http_geo_module</code> создает переменные со значениями в зависимости от IP-адреса клиента.
zh_cn: 该 <code>ngx_http_geo_module</code> 模块创建与这取决于客户端的IP地址值的变量。

source: The <code>ngx_http_geoip_module</code> module (0.8.6+) creates variables with values depending on the client IP address, using the precompiled <a href="http://www.maxmind.com">MaxMind</a> databases.
es: El m&oacute;dulo <code>ngx_http_geoip_module</code> (0.8.6+) crea variables con valores que dependen de la direcci&oacute;n IP del cliente, utilizando las <a href="http://www.maxmind.com">bases de</a> datos MaxMind precompiladas .
ja: <code>ngx_http_geoip_module</code> モジュール（0.8.6+）はプリコンパイル使用して、クライアントのIPアドレスに応じた値を持つ変数を作成し、<a href="http://www.maxmind.com">MaxMindの</a>データベースを。
ko: <code>ngx_http_geoip_module</code> 모듈 (0.8.6+)의 값이 미리 컴파일하여 클라이언트의 IP 주소에 따라 생성하여 변수 <a href="http://www.maxmind.com">MaxMind의</a> 데이터베이스.
ru: Модуль <code>ngx_http_geoip_module</code> (0.8.6+) создает переменные со значениями в зависимости от IP-адреса клиента, используя предварительно скомпилированные базы данных <a href="http://www.maxmind.com">MaxMind</a> .
zh_cn: 所述 <code>ngx_http_geoip_module</code> 模块（0.8.6+）与根据客户端的IP地址值，并使用预编译创建变量<a href="http://www.maxmind.com">的MaxMind</a>数据库。

source: The <code>ngx_http_get_flushed_variable()</code> and <code>ngx_http_get_indexed_variable()</code> functions are used to obtain the value of a variable. They have the same interface - accepting an HTTP request <code>r</code> as a context for evaluating the variable and an <code>index</code> that identifies it. An example of typical usage:
es: Las <code>ngx_http_get_flushed_variable()</code> y <code>ngx_http_get_indexed_variable()</code> se utilizan para obtener el valor de una variable. Tienen la misma interfaz: aceptan una solicitud HTTP <code>r</code> como contexto para evaluar la variable y un <code>index</code> que la identifica. Un ejemplo de uso t&iacute;pico:
ja: <code>ngx_http_get_flushed_variable()</code> 及び <code>ngx_http_get_indexed_variable()</code> 関数は、変数の値を取得するために使用されます。それらは同じインターフェースを持っています- 変数とそれを識別する <code>index</code> を評価するためのコンテキストとしてHTTPリクエスト <code>r</code> を受け入れます。一般的な使用例：
ko: <code>ngx_http_get_flushed_variable()</code> 와 <code>ngx_http_get_indexed_variable()</code> 함수는 변수의 값을 획득하기 위해 사용된다. HTTP 요청 수락 - 그들은 동일한 인터페이스가 <code>r</code> 변수를 평가하는 상황과 같은 <code>index</code> 하는 것을 식별 그것을. 일반적인 사용법의 예 :
ru: Функции <code>ngx_http_get_flushed_variable()</code> и <code>ngx_http_get_indexed_variable()</code> используются для получения значения переменной. У них одинаковый интерфейс - принятие HTTP-запроса <code>r</code> в качестве контекста для оценки переменной и <code>index</code> который ее идентифицирует. Пример типичного использования:
zh_cn: 所述 <code>ngx_http_get_flushed_variable()</code> 和 <code>ngx_http_get_indexed_variable()</code> 函数用于获得变量的值。它们具有相同的接口-接受HTTP请求 <code>r</code> 作为评估变量的上下文以及标识该变量的 <code>index</code> 。典型用法示例：

source: The <code>ngx_http_grpc_module</code> module allows passing requests to a gRPC server (1.13.10). The module requires the <a href="ngx_http_v2_module">ngx_http_v2_module</a> module.
es: El m&oacute;dulo <code>ngx_http_grpc_module</code> permite pasar solicitudes a un servidor gRPC (1.13.10). El m&oacute;dulo requiere el m&oacute;dulo <a href="ngx_http_v2_module">ngx_http_v2_module</a> .
ja: <code>ngx_http_grpc_module</code> モジュールはgRPCサーバー（1.13.10）に要求を渡すことができます。モジュールには<a href="ngx_http_v2_module">ngx_http_v2_module</a>モジュールが必要です。
ko: <code>ngx_http_grpc_module</code> 모듈은 gRPC 서버 (1.13.10)로 요청을 전달 할 수 있습니다. 이 모듈에는 <a href="ngx_http_v2_module">ngx_http_v2_module</a> 모듈이 필요합니다 .
ru: Модуль <code>ngx_http_grpc_module</code> позволяет передавать запросы на сервер gRPC (1.13.10). Для модуля требуется модуль <a href="ngx_http_v2_module">ngx_http_v2_module</a> .
zh_cn: 该 <code>ngx_http_grpc_module</code> 模块允许传递请求到服务器GRPC（10年1月13日）。该模块需要<a href="ngx_http_v2_module">ngx_http_v2_module</a>模块。

source: The <code>ngx_http_gunzip_module</code> module is a filter that decompresses responses with &ldquo;<code>Content-Encoding: gzip</code>&rdquo; for clients that do not support &ldquo;gzip&rdquo; encoding method. The module will be useful when it is desirable to store data compressed to save space and reduce I/O costs.
es: El m&oacute;dulo <code>ngx_http_gunzip_module</code> es un filtro que descomprime las respuestas con " <code>Content-Encoding: gzip</code> " para los clientes que no admiten el m&eacute;todo de codificaci&oacute;n "gzip". El m&oacute;dulo ser&aacute; &uacute;til cuando se desee almacenar datos comprimidos para ahorrar espacio y reducir los costos de E / S.
ja: <code>ngx_http_gunzip_module</code> モジュール「との回答を解凍フィルタである <code>Content-Encoding: gzip</code> 方式をコードする「GZIP」をサポートしていないクライアントのために」。モジュールは、スペースを節約し、I / Oコストを削減するために圧縮されたデータを保存することが望ましい場合に役立ちます。
ko: <code>ngx_http_gunzip_module</code> "모듈과 응답을 압축 해제하는 필터입니다 <code>Content-Encoding: gzip</code> 방법을 인코딩"GZIP "를 지원하지 않는 고객을 위해". 공간을 절약하고 I / O 비용을 줄이기 위해 압축 된 데이터를 저장하는 것이 바람직한 경우이 모듈이 유용합니다.
ru: Модуль <code>ngx_http_gunzip_module</code> - это фильтр, который распаковывает ответы с помощью &laquo; <code>Content-Encoding: gzip</code> &raquo; для клиентов, которые не поддерживают метод кодирования &laquo;gzip&raquo;. Модуль будет полезен, когда желательно хранить данные в сжатом виде для экономии места и снижения затрат на ввод-вывод.
zh_cn: 该 <code>ngx_http_gunzip_module</code> 模块是与解压缩响应的过滤器&ldquo; <code>Content-Encoding: gzip</code> &rdquo;为不支持&ldquo;压缩&rdquo;编码方法的客户。当需要存储压缩的数据以节省空间并减少I / O成本时，该模块将非常有用。

source: The <code>ngx_http_gzip_module</code> module is a filter that compresses responses using the &ldquo;gzip&rdquo; method. This often helps to reduce the size of transmitted data by half or even more.
es: El m&oacute;dulo <code>ngx_http_gzip_module</code> es un filtro que comprime las respuestas usando el m&eacute;todo "gzip". Esto a menudo ayuda a reducir el tama&ntilde;o de los datos transmitidos a la mitad o incluso m&aacute;s.
ja: <code>ngx_http_gzip_module</code> モジュールは、圧縮応答が「GZIP」方法を使用して、そのフィルタです。これは多くの場合、送信されるデータのサイズを半分またはそれ以上削減するのに役立ちます。
ko: <code>ngx_http_gzip_module</code> 모듈 습포 응답이 "GZIP"방법을 사용하는 필터이다. 이것은 종종 전송 된 데이터의 크기를 절반 이상 줄이는 데 도움이됩니다.
ru: Модуль <code>ngx_http_gzip_module</code> - это фильтр, сжимающий ответы с помощью метода &laquo;gzip&raquo;. Это часто помогает уменьшить размер передаваемых данных вдвое или даже больше.
zh_cn: 所述 <code>ngx_http_gzip_module</code> 模块是使用&ldquo;gzip的&rdquo;方法压缩响应的滤波器。这通常有助于将传输数据的大小减少一半甚至更多。

source: The <code>ngx_http_gzip_static_module</code> module allows sending precompressed files with the &ldquo;<code>.gz</code>&rdquo; filename extension instead of regular files.
es: El m&oacute;dulo <code>ngx_http_gzip_static_module</code> permite enviar archivos precomprimidos con la extensi&oacute;n de nombre de archivo &ldquo; <code>.gz</code> &rdquo; en lugar de archivos normales.
ja: <code>ngx_http_gzip_static_module</code> モジュールを使用すると、通常のファイルではなく、ファイル名拡張子が「 <code>.gz</code> 」の事前圧縮ファイルを送信できます。
ko: <code>ngx_http_gzip_static_module</code> 모듈은 "와 미리 압축 파일을 전송 할 수 있습니다 <code>.gz</code> 대신 일반 파일의"파일 이름 확장자.
ru: Модуль <code>ngx_http_gzip_static_module</code> позволяет отправлять предварительно <code>.gz</code> файлы с расширением имени файла &laquo; .gz &raquo; вместо обычных файлов.
zh_cn: 该 <code>ngx_http_gzip_static_module</code> 模块允许发送的&ldquo;预压缩文件 <code>.gz</code> &rdquo;文件扩展名，而不是常规文件。

source: The <code>ngx_http_headers_module</code> module allows adding the &ldquo;Expires&rdquo; and &ldquo;Cache-Control&rdquo; header fields, and arbitrary fields, to a response header.
es: El m&oacute;dulo <code>ngx_http_headers_module</code> permite agregar los campos de encabezado " Expires " y "Cache-Control", y campos arbitrarios, a un encabezado de respuesta.
ja: <code>ngx_http_headers_module</code> モジュールは、レスポンスヘッダに、「有効期限」と「キャッシュ・コントロール」ヘッダフィールド、及び任意のフィールドを追加することを可能にします。
ko: <code>ngx_http_headers_module</code> 모듈 응답 헤더의 "만료"및 "캐시 제어"헤더 필드에, 임의의 필드를 추가 허용한다.
ru: Модуль <code>ngx_http_headers_module</code> позволяет добавлять поля заголовка &laquo;Expires&raquo; и &laquo;Cache-Control&raquo;, а также произвольные поля в заголовок ответа.
zh_cn: 所述 <code>ngx_http_headers_module</code> 模块允许添加的&ldquo;到期&rdquo;和&ldquo;缓存控制&rdquo;报头字段，和任意字段，到响应报头。
