Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/nginx/nginx.*.004.xlf
Languages: es, ja, ko, ru, zh_cn

source: Reading or discarding the client request body from a subrequest is not allowed. It must always be done in the main request. When a subrequest is created, it inherits the parent's <code>request_body</code> object which can be used by the subrequest if the main request has previously read the request body.
ja: サブリクエストからのクライアントリクエストボディの読み取りまたは破棄は許可されていません。常にメインリクエストで実行する必要があります。サブリクエストが作成されると、それは親の <code>request_body</code> オブジェクトを継承します。これは、メインリクエストが以前にリクエストボディを読み取っていた場合に、サブリクエストで使用できます。
zh_cn: 不允许从子请求中读取或丢弃客户端请求主体。它必须始终在主请求中完成。创建子请求后，如果主请求先前已读取请求正文，则该子请求将继承父请求的父对象的 <code>request_body</code> 对象。

source: Reads a 32-bit, big-endian float from <code>buf</code> at the specified <code><i>offset</i></code>.
ja: 指定された <code><i>offset</i></code> <code>buf</code> から32ビットのビッグエンディアンフロートを読み取ります。<i></i>
zh_cn: 从 <code>buf</code> 处以指定的 <code><i>offset</i></code> 读取32位的big-endian浮点数。

source: Reads a 32-bit, little-endian float from <code>buf</code> at the specified <code><i>offset</i></code>.
ja: 指定された <code><i>offset</i></code> <code>buf</code> から32ビットのリトルエンディアンフロートを読み取ります。<i></i>
zh_cn: 从 <code>buf</code> 读取指定 <code><i>offset</i></code> 处的32位，小端浮点数。

source: Reads a 64-bit, big-endian double from <code>buf</code> at the specified <code><i>offset</i></code>.
ja: 指定された <code><i>offset</i></code> <code>buf</code> から64ビットのビッグエンディアンdoubleを読み取ります。<i></i>
zh_cn: 从 <code>buf</code> 处以指定的 <code><i>offset</i></code> 读取64位big-endian double 。

source: Reads a 64-bit, little-endian double from <code>buf</code> at the specified <code><i>offset</i></code>.
ja: 指定された <code><i>offset</i></code> <code>buf</code> から64ビットのリトルエンディアンdoubleを読み取ります。<i></i>
zh_cn: 从 <code>buf</code> 处以指定的 <code><i>offset</i></code> 读取64位little-endian double 。

source: Reads the <code><i>byteLength</i></code> from <code>buf</code> at the specified <code><i>offset</i></code> and interprets the result as a big-endian integer supporting up to 48 bits of accuracy. The <code><i>byteLength</i></code> parameter is an integer between 1 and 6 specifying the number of bytes to read.
ja: 指定された <code><i>offset</i></code> <code>buf</code> から <code><i>byteLength</i></code> を読み取り、その結果を最大48ビットの精度をサポートするビッグエンディアン整数として解釈します。 <code><i>byteLength</i></code> パラメータが読み取るバイト数を指定する1と6の間の整数です。<i></i><i></i>
zh_cn: 从 <code>buf</code> 处以指定的 <code><i>offset</i></code> 读取 <code><i>byteLength</i></code> ，并将结果解释为支持最高48位精度的big-endian整数。所述 <code><i>byteLength</i></code> 参数是指定要读取的字节数1和6之间的整数。<i></i><i></i>

source: Reads the <code><i>byteLength</i></code> from <code>buf</code> at the specified <code><i>offset</i></code> and interprets the result as a big-endian, two's complement signed value supporting up to 48 bits of accuracy. The <code><i>byteLength</i></code> parameter is an integer between 1 and 6 specifying the number of bytes to read.
ja: 指定された <code><i>offset</i></code> <code>buf</code> から <code><i>byteLength</i></code> を読み取り、その結果をビッグエンディアン、最大48ビットの精度をサポートする2の補数符号付き値として解釈します。 <code><i>byteLength</i></code> パラメータが読み取るバイト数を指定する1と6の間の整数です。<i></i><i></i>
zh_cn: 从 <code>buf</code> 处以指定的 <code><i>offset</i></code> 读取 <code><i>byteLength</i></code> ，并将结果解释为big-endian（二进制补码），支持高达48位的精度。所述 <code><i>byteLength</i></code> 参数是指定要读取的字节数1和6之间的整数。<i></i><i></i>

source: Reads the <code><i>byteLength</i></code> from <code>buf</code> at the specified <code><i>offset</i></code> and interprets the result as a little-endian integer supporting up to 48 bits of accuracy. The <code><i>byteLength</i></code> parameter is an integer between 1 and 6 specifying the number of bytes to read.
ja: 指定された <code><i>offset</i></code> <code>buf</code> から <code><i>byteLength</i></code> を読み取り、その結果を最大48ビットの精度をサポートするリトルエンディアン整数として解釈します。 <code><i>byteLength</i></code> パラメータが読み取るバイト数を指定する1と6の間の整数です。<i></i><i></i>
zh_cn: 从 <code>buf</code> 处以指定的 <code><i>offset</i></code> 读取 <code><i>byteLength</i></code> ，并将结果解释为支持最高48位精度的Little-Endian整数。所述 <code><i>byteLength</i></code> 参数是指定要读取的字节数1和6之间的整数。<i></i><i></i>

source: Reads the <code><i>byteLength</i></code> from <code>buf</code> at the specified <code><i>offset</i></code> and interprets the result as a little-endian, two's complement signed value supporting up to 48 bits of accuracy. The <code><i>byteLength</i></code> parameter is an integer between 1 and 6 specifying the number of bytes to read.
ja: 指定された <code><i>offset</i></code> <code>buf</code> から <code><i>byteLength</i></code> を読み取り、結果をリトルエンディアンとして解釈します。2の補数の符号付き値は、最大48ビットの精度をサポートします。 <code><i>byteLength</i></code> パラメータが読み取るバイト数を指定する1と6の間の整数です。<i></i><i></i>
zh_cn: 从 <code>buf</code> 处以指定的 <code><i>offset</i></code> 读取 <code><i>byteLength</i></code> ，并将结果解释为little-endian（二进制补码），支持最高48位精度。所述 <code><i>byteLength</i></code> 参数是指定要读取的字节数1和6之间的整数。<i></i><i></i>

source: Red-Black tree
ja: 赤黒の木
zh_cn: 红黑树

source: Redirected and rewritten requests become internal and can access the <a href="../http/ngx_http_core_module#internal">internal</a> locations. Internal requests have the <code>internal</code> flag set.
ja: リダイレクトおよび書き換えられた要求は内部になり、<a href="../http/ngx_http_core_module#internal">内部の</a>場所にアクセスできます。内部リクエストには <code>internal</code> フラグが設定されています。
zh_cn: 重定向和重写的请求成为内部的，并且可以访问<a href="../http/ngx_http_core_module#internal">内部</a>位置。内部请求设置了 <code>internal</code> 标志。

source: Redirection for old browsers:
ja: 古いブラウザへのリダイレクト。
zh_cn: 旧浏览器的重定向。

source: Reduces timer resolution in worker processes, thus reducing the number of <code>gettimeofday()</code> system calls made. By default, <code>gettimeofday()</code> is called each time a kernel event is received. With reduced resolution, <code>gettimeofday()</code> is only called once per specified <code><i>interval</i></code>.
ja: ワーカープロセスのタイマー解決を減らし、行われる <code>gettimeofday()</code> システムコールの数を減らします。デフォルトでは、カーネルイベントが受信されるたびに <code>gettimeofday()</code> が呼び出されます。解像度を下げると、 <code>gettimeofday()</code> は指定された <code><i>interval</i></code> 1回だけ呼び出され<i>ます</i>。
zh_cn: 降低工作进程中的计时器分辨率，从而减少进行的 <code>gettimeofday()</code> 系统调用的次数。默认情况下，每次接收内核事件时都会调用 <code>gettimeofday()</code> 。在降低分辨率的情况下，每个指定的 <code><i>interval</i></code> 只能调用一次 <code>gettimeofday()</code> 。<i></i>

source: Regular expression server name captures have been supported since 0.7.40.
ja: 正規表現サーバ名のキャプチャは 0.7.40 からサポートされています。
zh_cn: 从0.7.40开始支持正则表达式服务器名称捕获。

source: Regular expression server names have been supported since 0.6.7.
ja: 0.6.7 から正規表現サーバ名がサポートされました。
zh_cn: 从0.6.7开始支持正则表达式服务器名称。

source: Regular expressions
ja: 正規表現
zh_cn: 正则表达式

source: Regular expressions are tested sequentially and therefore are the slowest method and are non-scalable.
ja: 正規表現は順次テストされるため、最も遅い方法であり、スケーラブルではありません。
zh_cn: 正则表达式是依次测试的,因此是最慢的方法,而且是不可扩展的。

source: Regular expressions can contain captures (0.7.40) that can later be used in other directives.
ja: 正規表現はキャプチャを含むことができます (0.7.40)。
zh_cn: 正则表达式可以包含捕获(0.7.40),以后可以在其他指令中使用。

source: Regular expressions can contain captures (0.7.40) that can later be used in other directives:
ja: 正規表現はキャプチャを含むことができます (0.7.40)。
zh_cn: 正则表达式可以包含捕获(0.7.40),以后可以在其他指令中使用。

source: Regular expressions names
ja: 正規表現名
zh_cn: 正则表达式名称

source: Release Date: 01 Feb 2017
ja: 発売日:2017年02月01日
zh_cn: 发布日期:2017年02月01日

source: Release Date: 01 February 2017
ja: 発売日:2017年2月01日
zh_cn: 发布日期:2017年2月1日

source: Release Date: 03 April 2018
ja: 発売日:2018年04月03日
zh_cn: 发布日期:2018年04月03日

source: Release Date: 03 March 2020
ja: 公開日:2020年3月3日
zh_cn: 发布日期:2020年3月3日

source: Release Date: 04 Apr 2017
ja: 発売日:2017年04月04日
zh_cn: 发布日期:2017年04月04日

source: Release Date: 04 April 2017
ja: 公開日:2017年04月04日
zh_cn: 发布日期:2017年4月4日

source: Release Date: 07 July 2020
ja: 公開日:2020年7月07日
zh_cn: 发布日期:2020年7月7日

source: Release Date: 08 Aug 2017
ja: 公開日:2017年08月08日
zh_cn: 发布日期:2017年08月08日

source: Release Date: 08 August 2017
ja: 公開日:2017年8月08日
zh_cn: 发布日期:2017年08月08日

source: Release Date: 09 Oct 2017
ja: 発売日:2017年10月09日
zh_cn: 发布日期:2017年10月9日

source: Release Date: 09 October 2017
ja: 公開日:2017年10月09日
zh_cn: 发布日期:2017年10月9日

source: Release Date: 11 August 2020
ja: 公開日:2020年8月11日
zh_cn: 发布日期:2020年8月11日

source: Release Date: 13 August 2019
ja: 公開日:2019年8月13日
zh_cn: 发布日期:2019年8月13日

source: Release Date: 13 Dec 2016
ja: 発売日:2016年12月13日
ru: Дата выхода:13 декабря 2016 г.
zh_cn: 发布日期:2016年12月13日

source: Release Date: 13 December 2016
ja: 公開日:2016年12月13日
zh_cn: 发布日期:2016年12月13日

source: Release Date: 15 August 2019
ja: 公開日:2019年8月15日
zh_cn: 发布日期:2019年8月15日

source: Release Date: 16 April 2019
ja: 公開日:2019年4月16日
ru: Дата выхода:16 апреля 2019 г.
zh_cn: 发布日期:2019年4月16日

source: Release Date: 18 September 2018
ja: 発売日:2018年9月18日
ru: Дата выхода:18 сентября 2018 г.
zh_cn: 发布日期:2018年9月18日

source: Release Date: 19 June 2018
ja: 発売日:2018年6月19日
ru: Дата выхода:19 июня 2018 г.
zh_cn: 发布日期:2018年6月19日

source: Release Date: 19 May 2020
ja: 公開日:2020年5月19日
zh_cn: 发布日期:2020年5月19日

source: Release Date: 19 November 2019
ja: 公開日:2019年11月19日
zh_cn: 发布日期:2019年11月19日

source: Release Date: 20 Nov 2017
ja: 発売日:2017年11月20日
ru: Дата выхода:20 ноября 2017 г.
zh_cn: 发布日期:2017年11月20日

source: Release Date: 20 November 2017
ja: 発売日:2017年11月20日
zh_cn: 发布日期:2017年11月20日

source: Release Date: 21 January 2020
ja: 公開日:2020年1月21日
zh_cn: 发布日期:2020年1月21日

source: Release Date: 21 May 2019
ja: 公開日:2019年5月21日
ru: Дата выхода:21 мая 2019 г.
zh_cn: 发布日期:2019年5月21日

source: Release Date: 22 October 2019
ja: 公開日:2019年10月22日
zh_cn: 发布日期:2019年10月22日

source: Release Date: 23 April 2020
ja: 公開日:2020年4月23日
zh_cn: 发布日期:2020年4月23日

source: Release Date: 24 Jan 2017
ja: 発売日:2017年1月24日
ru: Дата выхода:24 января 2017 г.
zh_cn: 发布日期:2017年1月24日

source: Release Date: 24 January 2017
ja: 発売日:2017年1月24日
zh_cn: 发布日期:2017年1月24日

source: Release Date: 25 December 2018
ja: 発売日:2018年12月25日
ru: Дата выхода:25 декабря 2018 г.
zh_cn: 发布日期:2018年12月25日

source: Release Date: 25 June 2019
ja: 公開日:2019年6月25日
ru: Дата выхода:25 июня 2019 г.
zh_cn: 发布日期:2019年6月25日

source: Release Date: 26 February 2019
ja: 公開日:2019年2月26日
ru: Дата выхода:26 февраля 2019 г.
zh_cn: 发布日期:2019年2月26日

source: Release Date: 26 March 2019
ja: 公開日:2019年3月26日
ru: Дата выхода:26 марта 2019 г.
zh_cn: 发布日期:2019年3月26日

source: Release Date: 27 Dec 2016
ja: 発売日:2016年12月27日
ru: Дата выхода:27 декабря 2016 г.
zh_cn: 发布日期:2016年12月27日

source: Release Date: 27 December 2016
ja: 発売日:2016年12月27日
zh_cn: 发布日期:2016年12月27日

source: Release Date: 27 Jun 2017
ja: 発売日:2017年6月27日
ru: Дата выхода:27 июня 2017 г.
zh_cn: 发布日期:2017年6月27日

source: Release Date: 27 June 2017
ja: 公開日:2017年6月27日
zh_cn: 发布日期:2017年6月27日

source: Release Date: 27 November 2018
ja: 発売日:2018年11月27日
ru: Дата выхода:27 ноября 2018 г.
zh_cn: 发布日期:2018年11月27日

source: Release Date: 29 September 2020
ja: 発売日:2020年9月29日
zh_cn: 发布日期:2020年9月29日

source: Release Date: 3 Apr 2018
ja: 発売日:2018年4月3日
ru: Дата выхода:3 апреля 2018 г.
zh_cn: 发布日期:2018年4月3日

source: Release Date: 30 October 2018
ja: 発売日:2018年10月30日
ru: Дата выхода:30 октября 2018 г.
zh_cn: 发布日期:2018年10月30日

source: Release Date: 31 Aug 2017
ja: 発売日:2017年8月31日
ru: Дата выхода:31 августа 2017 г.
zh_cn: 发布日期:2017年8月31日

source: Release Date: 31 August 2017
ja: 発売日:2017年8月31日
zh_cn: 发布日期:2017年8月31日

source: Release Date: 31 July 2018
ja: 発売日:2018年7月31日
ru: Дата выхода:31 июля 2018 г.
zh_cn: 发布日期:2018年7月31日

source: Release Date: 31 May 2018
ja: 発売日:2018年5月31日
ru: Дата выхода:31 мая 2018 г.
zh_cn: 发布日期:2018年5月31日

source: Removed properties of the <a href="reference#stream">Stream</a> object: <code>s.OK</code>, <code>s.ABORT</code>, <code>s.AGAIN</code>, <code>s.DECLINED</code>, <code>s.ERROR</code> (replaced with <a href="reference#s_allow"><code>s.allow()</code></a>, <a href="reference#s_done"><code>s.done()</code></a>, <a href="reference#s_deny"><code>s.deny()</code></a>).
ja: <a href="reference#stream">Stream</a>オブジェクトのプロパティを削除しました： <code>s.OK</code> 、 <code>s.ABORT</code> 、 <code>s.AGAIN</code> 、 <code>s.DECLINED</code> 、 <code>s.ERROR</code> （<a href="reference#s_allow"> <code>s.allow()</code> </a>、<a href="reference#s_done"> <code>s.done()</code> </a>、<a href="reference#s_deny"> <code>s.deny()</code> に</a>置き換えられました）。
zh_cn: 删除<a href="reference#stream">Stream</a>对象的属性： <code>s.OK</code> ， <code>s.ABORT</code> ， <code>s.AGAIN</code> ， <code>s.DECLINED</code> ， <code>s.ERROR</code> （已替换为<a href="reference#s_allow"> <code>s.allow()</code> </a>，<a href="reference#s_done"> <code>s.done()</code> </a>，<a href="reference#s_deny"> <code>s.deny()</code> </a>）。

source: Removed properties of the <a href="reference#stream">Stream</a> object: <code>s.OK</code>, <code>s.ABORT</code>, <code>s.AGAIN</code>, <code>s.DECLINED</code>, <code>s.ERROR</code> (replaced with <a href="reference#s_allow">s.allow()</a>, <a href="reference#s_done">s.done()</a>, <a href="reference#s_deny">s.deny()</a>).
ja: <a href="reference#stream">Stream</a>オブジェクトの削除されたプロパティ： <code>s.OK</code> 、 <code>s.ABORT</code> 、 <code>s.AGAIN</code> 、 <code>s.DECLINED</code> 、 <code>s.ERROR</code> （<a href="reference#s_allow">s.allow（）</a>、<a href="reference#s_done">s.done（）</a>、<a href="reference#s_deny">s.deny（）に</a>置き換えられました）。
ru: Удалены свойства объекта <a href="reference#stream">Stream</a> : <code>s.OK</code> , <code>s.ABORT</code> , <code>s.AGAIN</code> , <code>s.DECLINED</code> , <code>s.ERROR</code> (заменены на <a href="reference#s_allow">s.allow ()</a> , <a href="reference#s_done">s.done ()</a> , <a href="reference#s_deny">s.deny ()</a> ).
zh_cn: 删除<a href="reference#stream">Stream</a>对象的属性： <code>s.OK</code> ， <code>s.ABORT</code> ， <code>s.AGAIN</code> ， <code>s.DECLINED</code> ， <code>s.ERROR</code> （已替换为<a href="reference#s_allow">s.allow（）</a>，<a href="reference#s_done">s.done（）</a>，<a href="reference#s_deny">s.deny（）</a>）。

source: Removes a server from a stream server group.
ja: ストリームサーバーグループからサーバーを削除します。
ru: Удаляет сервер из группы серверов потокового вещания.
zh_cn: 从流服务器组中删除一个服务器。

source: Removes a server from an HTTP upstream server group.
ja: HTTP アップストリーム サーバー グループからサーバーを削除します。
ru: Удаляет сервер из группы серверов HTTP upstream.
zh_cn: 从HTTP上游服务器组中删除一个服务器。

source: Removes a server from the group.
ja: グループからサーバーを削除します。
ru: Удаляет сервер из группы.
zh_cn: 从组中删除服务器。

source: Removes whitespaces from both ends of a string.
ja: 文字列の両端から空白を削除します。
ru: Удаляет пробелы с обоих концов строки.
zh_cn: 删除字符串两端的空白。

source: Request Argument
ja: 要求引数
ru: Запрос Аргумента
zh_cn: 请求论证

source: Request body
ja: リクエストボディ
ru: Орган запроса
zh_cn: 申请机构

source: Request finalization
ja: 確定申告を依頼する
ru: Завершение запроса
zh_cn: 请求定稿

source: Request parameters:
ja: パラメータを要求します。
ru: Параметры запроса:
zh_cn: 请求参数:

source: Request redirection
ja: リクエストリダイレクト
ru: Переадресация запроса
zh_cn: 请求重定向

source: Requests are logged in the context of a location where processing ends. It may be different from the original location, if an <a href="ngx_http_core_module#internal">internal redirect</a> happens during request processing.
ja: リクエストは、処理が終了する場所のコンテキストで記録されます。リクエストの処理中に<a href="ngx_http_core_module#internal">内部リダイレクト</a>が発生した場合は、元の場所とは異なる場合があります。
ru: Запросы регистрируются в контексте места, где заканчивается обработка. Оно может отличаться от исходного, если во время обработки запроса происходит <a href="ngx_http_core_module#internal">внутреннее перенаправление</a> .
zh_cn: 请求记录在处理结束位置的上下文中。如果在请求处理期间发生<a href="ngx_http_core_module#internal">内部重定向</a>，则该地址可能与原始位置不同。

source: Requests sent within early data are subject to <a href="https://tools.ietf.org/html/rfc8470">replay attacks</a>. To protect against such attacks at the application layer, the <a href="#var_ssl_early_data">$ssl_early_data</a> variable should be used.
ja: 初期のデータ内で送信されたリクエストは、<a href="https://tools.ietf.org/html/rfc8470">リプレイ攻撃の</a>対象になります。アプリケーション層でのこのような攻撃から保護するには、<a href="#var_ssl_early_data">$ ssl_early_data</a>変数を使用する必要があります。
ru: Запросы, отправленные с ранними данными, подвергаются <a href="https://tools.ietf.org/html/rfc8470">атакам</a> с повторением . Для защиты от таких атак на прикладном уровне следует использовать переменную <a href="#var_ssl_early_data">$ ssl_early_data</a> .
zh_cn: 在早期数据中发送的请求会受到<a href="https://tools.ietf.org/html/rfc8470">重播攻击</a>。为了防止在应用程序层遭受此类攻击，应使用<a href="#var_ssl_early_data">$ ssl_early_data</a>变量。

source: Required to add a backup server.
ja: バックアップサーバーの追加が必要です。
ru: Требуется добавить резервный сервер.
zh_cn: 需要增加一个备份服务器。

source: Resets counters of SSL handshakes and session reuses.
ja: SSLハンドシェイクとセッション再利用のカウンタをリセットします。
ru: Сбрасывает счетчики SSL рукопожатий и повторного использования сессии.
zh_cn: 重置SSL握手和会话重用的计数器。

source: Resets counters of abnormally terminated and respawned child processes.
ja: 異常終了した子プロセスとレスポーンした子プロセスのカウンタをリセットします。
ru: Сбрасывает счетчики аномально прерванных и передохнувших детских процессов.
zh_cn: 重置异常终止和重新生成的子进程的计数器。

source: Resets statistics in a particular resolver zone.
ja: 特定のリゾルバゾーンの統計情報をリセットします。
zh_cn: 重置特定解析器区域的统计数据。

source: Resets statistics of accepted and discarded connections, sessions, received and sent bytes in a particular stream server zone.
ja: 特定のストリームサーバーゾーンでの、受け入れられた接続、破棄された接続、セッション、受信および送信されたバイト数の統計をリセットします。
ru: Сбрасывает статистику принятых и отмененных соединений,сессий,принятых и отправленных байт в определенной зоне сервера потоков.
zh_cn: 重置特定流服务器区域内已接受和已放弃的连接、会话、已接收和已发送字节的统计。

source: Resets statistics of accepted and discarded requests, responses, received and sent bytes in a particular HTTP server zone.
ja: 特定の HTTP サーバゾーンで受け入れられたリクエストと破棄されたリクエスト、レスポンス、受信されたバイト数、送信されたバイト数の統計をリセットします。
ru: Сбрасывает статистику принятых и отклоненных запросов,ответов,полученных и отправленных байтов в определенной зоне HTTP сервера.
zh_cn: 重置特定HTTP服务器区域内已接受和已丢弃的请求、响应、接收和发送字节的统计。

source: Resets statistics of accepted and discarded requests, responses, received and sent bytes in a particular location zone.
ja: 特定のロケーションゾーンで受け入れられたリクエストと破棄されたリクエスト、レスポンス、受信したバイト、送信したバイトの統計をリセットする。
zh_cn: 重置特定位置区域内已接受和已丢弃的请求、响应、接收和发送字节的统计。

source: Resets statistics of accepted and dropped client connections.
ja: 受理したクライアント接続とドロップしたクライアント接続の統計情報をリセットします。
ru: Сбрасывает статистику принятых и прерванных клиентских соединений.
zh_cn: 重置已接受和已放弃的客户端连接的统计。

source: Resets statistics of cache hits/misses in a particular cache zone.
ja: 特定のキャッシュゾーンでのキャッシュヒット/ミスの統計をリセットします。
ru: Сбрасывает статистику попаданий/промахов в кэше в определенной зоне кэша.
zh_cn: 重置特定缓存区的缓存命中/丢失统计。

source: Resets the &ldquo;<code>reqs</code>&rdquo; and &ldquo;<code>fails</code>&rdquo; metrics for each memory slot.
ja: 「リセット <code>reqs</code> 」と「 <code>fails</code> 各メモリスロットのための」メトリック。
ru: <code>reqs</code> метрики &laquo; reqs &raquo; и &laquo; <code>fails</code> &raquo; для каждого слота памяти.
zh_cn: 复位&ldquo; <code>reqs</code> &rdquo;和&ldquo; <code>fails</code> &rdquo;的度量为每个存储器插槽。

source: Resets the connection limiting statistics.
ja: 接続制限の統計情報をリセットします。
zh_cn: 重置连接限制统计。

source: Resets the number of total client HTTP requests.
ja: クライアントの総HTTPリクエスト数をリセットします。
ru: Сбрасывает количество общих HTTP-запросов клиента.
zh_cn: 重置客户端HTTP请求的总数。

source: Resets the requests limiting statistics.
ja: リクエスト制限の統計情報をリセットします。
zh_cn: 重置限制请求的统计。

source: Resets the statistics for each upstream server in an upstream server group and queue statistics.
ja: アップストリームサーバグループ内の各アップストリームサーバの統計情報とキューの統計情報をリセットします。
ru: Сбрасывает статистику для каждого восходящего сервера в группе восходящих серверов и статистику очереди.
zh_cn: 重置上游服务器组中每个上游服务器的统计和队列统计。

source: Resets the statistics for each upstream server in an upstream server group.
ja: アップストリームサーバーグループ内の各アップストリームサーバーの統計情報をリセットします。
ru: Сбрасывает статистику для каждого восходящего сервера в группе восходящих серверов.
zh_cn: 重置上游服务器组中每个上游服务器的统计。

source: Resolver Zone:
ja: リゾルバーゾーン。
zh_cn: 解决者区。

source: Resolving of names into IPv6 addresses is supported starting from version 1.5.8.
ja: IPv6アドレスへの名前解決はバージョン1.5.8から対応しています。
ru: Поддерживается преобразование имен в IPv6-адреса,начиная с версии 1.5.8.
zh_cn: 从1.5.8版本开始支持将名称解析为IPv6地址。

source: Response Objects
ja: レスポンスオブジェクト
ru: Объекты реагирования
zh_cn: 响应对象

source: Response body
ja: レスポンスボディ
ru: Орган реагирования
zh_cn: 回复机构

source: Response header
ja: レスポンスヘッダ
ru: Заголовок ответа
zh_cn: 响应头

source: Returning Fastest Response from Proxy
ja: プロキシからの最速レスポンスを返す
ru: Самая быстрая реакция прокси-сервера
zh_cn: 从代理服务器返回最快的响应

source: Returns &ldquo;<code><i>utf-8</i></code>&rdquo;, read-only.
ja: 読み取り専用の「 <code><i>utf-8</i></code> 」を返します。
zh_cn: 返回&ldquo; <code><i>utf-8</i></code> &rdquo;，只读。

source: Returns <code>true</code> if a string begins with the characters of a specified string, otherwise <code>false</code>. The optional <code>position</code> parameter is the position in this string at which to begin search for <code>searchString</code>. Default value is 0.
ja: 文字列が指定された文字列の文字で始まる場合は <code>true</code> を返し、それ以外の場合は <code>false</code> を返します。オプションの <code>position</code> パラメーターは、 <code>searchString</code> の検索を開始するこの文字列内の位置です。デフォルト値は0です。
ru: Возвращает <code>true</code> , если строка начинается с символов указанной строки, иначе <code>false</code> . Необязательный параметр <code>position</code> - это позиция в этой строке, с которой следует начать поиск <code>searchString</code> . Значение по умолчанию - 0.
zh_cn: 如果字符串以指定字符串的字符开头，则返回 <code>true</code> ，否则返回 <code>false</code> 。可选的 <code>position</code> 参数是此字符串中开始搜索 <code>searchString</code> 的位置。预设值为0。

source: Returns <code>true</code> if a string ends with the characters of a specified string, otherwise <code>false</code>. The optional <code>length</code> parameter is the the length of string. If omitted, the default value is the length of the string.
ja: 文字列が指定された文字列の文字で終わる場合は <code>true</code> を返し、それ以外の場合は <code>false</code> を返します。オプションの <code>length</code> パラメーターは、文字列の長さです。省略した場合、デフォルト値は文字列の長さです。
ru: Возвращает <code>true</code> , если строка заканчивается символами указанной строки, в противном случае - <code>false</code> . Необязательный параметр <code>length</code> - это длина строки. Если не указан, значением по умолчанию является длина строки.
zh_cn: 如果字符串以指定字符串的字符结尾，则返回 <code>true</code> ，否则返回 <code>false</code> 。可选的 <code>length</code> 参数是字符串的长度。如果省略，则默认值为字符串的长度。

source: Returns <code>true</code> if a string is found within another string, otherwise <code>false</code>. The optional <code>position</code> parameter is the position within the string at which to begin search for <code>searchString</code>. Default value is 0.
ja: 文字列が別の文字列内で見つかった場合は <code>true</code> を返し、それ以外の場合は <code>false</code> を返します。オプションの <code>position</code> パラメータは、 <code>searchString</code> の検索を開始する文字列内の位置です。デフォルト値は0です。
ru: Возвращает <code>true</code> , если строка найдена в другой строке, иначе <code>false</code> . Необязательный параметр <code>position</code> - это позиция в строке, с которой следует начать поиск <code>searchString</code> . Значение по умолчанию - 0.
zh_cn: 如果在另一个字符串中找到一个字符串，则返回 <code>true</code> ，否则返回 <code>false</code> 。可选的 <code>position</code> 参数是字符串中开始搜索 <code>searchString</code> 的位置。预设值为0。

source: Returns SSL statistics.
ja: SSLの統計情報を返します。
ru: Возвращает статистику по SSL.
zh_cn: 返回SSL统计数据。

source: Returns a JSON representation of <code>buf.</code><code>JSON.stringify()</code> implicitly calls this function when stringifying a Buffer instance.
ja: <code>buf.</code> JSON表現を返します。 <code>JSON.stringify()</code> は、Bufferインスタンスを文字列化するときに、この関数を暗黙的に呼び出します。
zh_cn: 返回 <code>buf.</code> 的JSON表示形式。当对Buffer实例进行字符串化时， <code>JSON.stringify()</code> 隐式调用此函数。

source: Returns a list of first level HTTP endpoints.
ja: 第一レベルの HTTP エンドポイントのリストを返します。
ru: Возвращает список конечных точек HTTP первого уровня.
zh_cn: 返回一级HTTP端点的列表。

source: Returns a list of first level stream endpoints.
ja: 最初のレベルのストリームエンドポイントのリストを返します。
ru: Возвращает список конечных точек потока первого уровня.
zh_cn: 返回一级流端点的列表。

source: Returns a list of root endpoints.
ja: ルートエンドポイントのリストを返します。
ru: Возвращает список корневых конечных точек.
zh_cn: 返回一个根端点的列表。
