Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/nginx/nginx.*.004.xlf
Languages: es, ja, ko, ru, zh_cn

source: This directive appeared in version 0.7.59.
es: Esta directiva apareció en la versión 0.7.59.
ko: 이 지시문은 버전 0.7.59에 나타났습니다.

source: This directive appeared in version 0.7.7.
es: Esta directiva apareció en la versión 0.7.7.
ko: 이 지시문은 버전 0.7.7에 나타났습니다.

source: This directive appeared in version 0.7.9.
es: Esta directiva apareció en la versión 0.7.9.
ko: 이 지시문은 버전 0.7.9에 나타났습니다.

source: This directive appeared in version 0.8.0.
es: Esta directiva apareció en la versión 0.8.0.
ko: 이 지시어는 버전 0.8.0에 나타났습니다.

source: This directive appeared in version 0.8.11.
es: Esta directiva apareció en la versión 0.8.11.
ko: 이 지시어는 버전 0.8.11에 나타났습니다.

source: This directive appeared in version 0.8.18.
es: Esta directiva apareció en la versión 0.8.18.
ko: 이 지시어는 버전 0.8.18에 나타났습니다.

source: This directive appeared in version 0.8.22.
es: Esta directiva apareció en la versión 0.8.22.
ko: 이 지시어는 버전 0.8.22에 나타났습니다.

source: This directive appeared in version 0.8.7.
es: Esta directiva apareció en la versión 0.8.7.
ko: 이 지시어는 버전 0.8.7에 나타났습니다.

source: This directive appeared in version 1.0.3.
es: Esta directiva apareció en la versión 1.0.3.
ko: 이 지시문은 버전 1.0.3에 나타났습니다.

source: This directive appeared in version 1.0.5.
es: Esta directiva apareció en la versión 1.0.5.
ko: 이 지시문은 버전 1.0.5에 나타났습니다.

source: This directive appeared in version 1.1.12.
es: Esta directiva apareció en la versión 1.1.12.
ko: 이 지시문은 버전 1.1.12에 나타났습니다.

source: This directive appeared in version 1.1.15.
es: Esta directiva apareció en la versión 1.1.15.
ko: 이 지시문은 버전 1.1.15에 나타났습니다.

source: This directive appeared in version 1.1.18.
es: Esta directiva apareció en la versión 1.1.18.
ko: 이 지시문은 버전 1.1.18에 나타났습니다.

source: This directive appeared in version 1.1.2.
es: Esta directiva apareció en la versión 1.1.2.
ko: 이 지시문은 버전 1.1.2에 나타났습니다.

source: This directive appeared in version 1.1.4.
es: Esta directiva apareció en la versión 1.1.4.
ko: 이 지시어는 버전 1.1.4에 나타났습니다.

source: This directive appeared in version 1.11.0.
es: Esta directiva apareció en la versión 1.11.0.
ko: 이 지시문은 버전 1.11.0에 나타났습니다.

source: This directive appeared in version 1.11.10.
es: Esta directiva apareció en la versión 1.11.10.
ko: 이 지시어는 버전 1.11.10에 나타났습니다.

source: This directive appeared in version 1.11.11.
es: Esta directiva apareció en la versión 1.11.11.
ko: 이 지시어는 버전 1.11.11에 나타났습니다.

source: This directive appeared in version 1.11.2.
es: Esta directiva apareció en la versión 1.11.2.
ko: 이 지시문은 버전 1.11.2에 나타났습니다.

source: This directive appeared in version 1.11.3.
es: Esta directiva apareció en la versión 1.11.3.
ko: 이 지시문은 버전 1.11.3에 나타났습니다.

source: This directive appeared in version 1.11.4.
es: Esta directiva apareció en la versión 1.11.4.
ko: 이 지시문은 버전 1.11.4에 나타났습니다.

source: This directive appeared in version 1.11.5.
es: Esta directiva apareció en la versión 1.11.5.
ko: 이 지시문은 버전 1.11.5에 나타났습니다.

source: This directive appeared in version 1.11.6.
es: Esta directiva apareció en la versión 1.11.6.
ko: 이 지시문은 버전 1.11.6에 나타났습니다.

source: This directive appeared in version 1.11.8.
es: Esta directiva apareció en la versión 1.11.8.
ko: 이 지시문은 버전 1.11.8에 나타났습니다.

source: This directive appeared in version 1.13.10.
es: Esta directiva apareció en la versión 1.13.10.
ko: 이 지시문은 버전 1.13.10에 나타났습니다.

source: This directive appeared in version 1.13.12.
es: Esta directiva apareció en la versión 1.13.12.
ko: 이 지시어는 버전 1.13.12에 나타났습니다.

source: This directive appeared in version 1.13.2.
es: Esta directiva apareció en la versión 1.13.2.
ko: 이 지시어는 버전 1.13.2에 나타났습니다.

source: This directive appeared in version 1.13.9.
es: Esta directiva apareció en la versión 1.13.9.
ko: 이 지시문은 버전 1.13.9에 나타났습니다.

source: This directive appeared in version 1.15.1.
es: Esta directiva apareció en la versión 1.15.1.
ko: 이 지시어는 버전 1.15.1에 나타났습니다.

source: This directive appeared in version 1.15.3.
es: Esta directiva apareció en la versión 1.15.3.
ko: 이 지시문은 버전 1.15.3에 나타났습니다.

source: This directive appeared in version 1.15.6.
es: Esta directiva apareció en la versión 1.15.6.
ko: 이 지시어는 버전 1.15.6에 나타났습니다.

source: This directive appeared in version 1.15.7.
es: Esta directiva apareció en la versión 1.15.7.
ko: 이 지시어는 버전 1.15.7에 나타났습니다.

source: This directive appeared in version 1.15.8.
es: Esta directiva apareció en la versión 1.15.8.
ko: 이 지시문은 버전 1.15.8에 나타났습니다.

source: This directive appeared in version 1.17.1.
es: Esta directiva apareció en la versión 1.17.1.
ko: 이 지시문은 버전 1.17.1에 나타났습니다.

source: This directive appeared in version 1.3.15.
es: Esta directiva apareció en la versión 1.3.15.
ko: 이 지시어는 버전 1.3.15에 나타났습니다.

source: This directive appeared in version 1.3.3.
es: Esta directiva apareció en la versión 1.3.3.
ko: 이 지시어는 버전 1.3.3에 나타났습니다.

source: This directive appeared in version 1.3.6.
es: Esta directiva apareció en la versión 1.3.6.
ko: 이 지시어는 버전 1.3.6에 나타났습니다.

source: This directive appeared in version 1.3.7.
es: Esta directiva apareció en la versión 1.3.7.
ko: 이 지시어는 버전 1.3.7에 나타났습니다.

source: This directive appeared in version 1.5.1.
es: Esta directiva apareció en la versión 1.5.1.
ko: 이 지시어는 버전 1.5.1에 ​​나타났습니다.

source: This directive appeared in version 1.5.12.
es: Esta directiva apareció en la versión 1.5.12.
ko: 이 지시어는 버전 1.5.12에 나타났습니다.

source: This directive appeared in version 1.5.6.
es: Esta directiva apareció en la versión 1.5.6.
ko: 이 지시어는 버전 1.5.6에 나타났습니다.

source: This directive appeared in version 1.5.7.
es: Esta directiva apareció en la versión 1.5.7.
ko: 이 지시어는 버전 1.5.7에 나타났습니다.

source: This directive appeared in version 1.5.8.
es: Esta directiva apareció en la versión 1.5.8.
ko: 이 지시어는 버전 1.5.8에 나타났습니다.

source: This directive appeared in version 1.5.9.
es: Esta directiva apareció en la versión 1.5.9.
ko: 이 지시어는 버전 1.5.9에 나타났습니다.

source: This directive appeared in version 1.7.0.
es: Esta directiva apareció en la versión 1.7.0.
ko: 이 지시어는 버전 1.7.0에 나타났습니다.

source: This directive appeared in version 1.7.10.
es: Esta directiva apareció en la versión 1.7.10.
ko: 이 지시어는 버전 1.7.10에 나타났습니다.

source: This directive appeared in version 1.7.11.
es: Esta directiva apareció en la versión 1.7.11.
ko: 이 지시어는 버전 1.7.11에 나타났습니다.

source: This directive appeared in version 1.7.2.
es: Esta directiva apareció en la versión 1.7.2.
ko: 이 지시어는 버전 1.7.2에 나타났습니다.

source: This directive appeared in version 1.7.3.
es: Esta directiva apareció en la versión 1.7.3.
ko: 이 지시어는 버전 1.7.3에 나타났습니다.

source: This directive appeared in version 1.7.5.
es: Esta directiva apareció en la versión 1.7.5.
ko: 이 지시어는 버전 1.7.5에 나타났습니다.

source: This directive appeared in version 1.7.7.
es: Esta directiva apareció en la versión 1.7.7.
ko: 이 지시어는 버전 1.7.7에 나타났습니다.

source: This directive appeared in version 1.7.8.
es: Esta directiva apareció en la versión 1.7.8.
ko: 이 지시어는 버전 1.7.8에 나타났습니다.

source: This directive appeared in version 1.7.9.
es: Esta directiva apareció en la versión 1.7.9.
ko: 이 지시어는 버전 1.7.9에 나타났습니다.

source: This directive appeared in version 1.9.0.
es: Esta directiva apareció en la versión 1.9.0.
ko: 이 지시어는 버전 1.9.0에 나타났습니다.

source: This directive appeared in version 1.9.11.
es: Esta directiva apareció en la versión 1.9.11.
ko: 이 지시문은 버전 1.9.11에 나타났습니다.

source: This directive appeared in version 1.9.13.
es: Esta directiva apareció en la versión 1.9.13.
ko: 이 지시어는 버전 1.9.13에 나타났습니다.

source: This directive appeared in version 1.9.2.
es: Esta directiva apareció en la versión 1.9.2.
ko: 이 지시어는 버전 1.9.2에 나타났습니다.

source: This directive appeared in version 1.9.3.
es: Esta directiva apareció en la versión 1.9.3.
ko: 이 지시어는 버전 1.9.3에 나타났습니다.

source: This directive appeared in version 1.9.4.
es: Esta directiva apareció en la versión 1.9.4.
ko: 이 지시문은 버전 1.9.4에 나타났습니다.

source: This directive appeared in version 1.9.7.
es: Esta directiva apareció en la versión 1.9.7.
ko: 이 지시어는 버전 1.9.7에 나타났습니다.

source: This directive appeared in versions 1.1.0 and 1.0.6.
es: Esta directiva apareció en las versiones 1.1.0 y 1.0.6.
ko: 이 지시어는 버전 1.1.0 및 1.0.6에 나타났습니다.

source: This directive appeared in versions 1.1.4 and 1.0.7.
es: Esta directiva apareció en las versiones 1.1.4 y 1.0.7.
ko: 이 지시문은 버전 1.1.4 및 1.0.7에 나타났습니다.

source: This directive appeared in versions 1.3.0 and 1.2.1.
es: Esta directiva apareció en las versiones 1.3.0 y 1.2.1.
ko: 이 지시문은 버전 1.3.0 및 1.2.1에 나타났습니다.

source: This directive appeared in versions 1.3.1 and 1.2.2.
es: Esta directiva apareció en las versiones 1.3.1 y 1.2.2.
ko: 이 지시문은 버전 1.3.1 및 1.2.2에 나타났습니다.

source: This directive can be used to create local copies of static unchangeable files, e.g.:
es: Esta directiva puede ser usada para crear copias locales de archivos estáticos inalterables,por ejemplo:
ko: 이 지시문은 다음과 같이 정적 변경 불가능한 파일의 로컬 사본을 작성하는 데 사용할 수 있습니다.

source: This directive is available as part of our <a href="http://nginx.com/products/">commercial subscription</a>.
es: Esta directiva est&aacute; disponible como parte de nuestra <a href="http://nginx.com/products/">suscripci&oacute;n comercial</a> .
ko: 이 지침은 <a href="http://nginx.com/products/">상용 가입의</a> 일부로 제공됩니다 .

source: This directive is ignored on Linux, Solaris, and Windows.
es: Esta directiva es ignorada en Linux,Solaris y Windows.
ko: 이 지시문은 Linux, Solaris 및 Windows에서 무시됩니다.

source: This directive is obsolete since version 1.5.7. An equivalent <a href="#sticky">sticky</a> directive with a new syntax should be used instead:
es: Esta directiva est&aacute; obsoleta desde la versi&oacute;n 1.5.7. En su lugar, debe usarse una directiva <a href="#sticky">pegajosa</a> equivalente con una nueva sintaxis:
ko: 이 지시문은 버전 1.5.7부터 사용되지 않습니다. 대신 새 구문을 사용 하는 동등한 <a href="#sticky">고정</a> 지시문을 사용해야합니다.

source: This directive is only available on systems that have the <code>openat()</code> and <code>fstatat()</code> interfaces. Such systems include modern versions of FreeBSD, Linux, and Solaris.
es: Esta directiva solo est&aacute; disponible en sistemas que tienen las <code>openat()</code> y <code>fstatat()</code> . Estos sistemas incluyen versiones modernas de FreeBSD, Linux y Solaris.
ko: 이 지시문은 <code>openat()</code> 및 <code>fstatat()</code> 인터페이스 가있는 시스템에서만 사용할 수 있습니다. 이러한 시스템에는 최신 버전의 FreeBSD, Linux 및 Solaris가 포함됩니다.

source: This directive is used for debugging.
es: Esta directiva se utiliza para la depuración.
ko: 이 지시어는 디버깅에 사용됩니다.

source: This directive was made obsolete in version 1.1.8 and was removed in version 1.7.6. An equivalent <a href="#limit_conn_zone">limit_conn_zone</a> directive with a changed syntax should be used instead:
es: Esta directiva qued&oacute; obsoleta en la versi&oacute;n 1.1.8 y se elimin&oacute; en la versi&oacute;n 1.7.6. En su lugar, deber&iacute;a usarse una directiva <a href="#limit_conn_zone">limit_conn_zone</a> equivalente con una sintaxis modificada:
ko: 이 지시문은 버전 1.1.8에서 폐기되었으며 버전 1.7.6에서 제거되었습니다. 대신 구문이 변경된 동등한 <a href="#limit_conn_zone">limit_conn_zone</a> 지시문을 사용해야합니다.

source: This directive was made obsolete in version 1.15.0. The <code>ssl</code> parameter of the <a href="ngx_http_core_module#listen">listen</a> directive should be used instead.
es: Esta directiva qued&oacute; obsoleta en la versi&oacute;n 1.15.0. En su lugar, debe usarse el par&aacute;metro <code>ssl</code> de la directiva <a href="ngx_http_core_module#listen">listen</a> .
ko: 이 지시문은 버전 1.15.0에서 폐기되었습니다. <a href="ngx_http_core_module#listen">listen</a> 지시문 의 <code>ssl</code> 매개 변수를 대신 사용해야합니다.

source: This directive was made obsolete in version 1.15.0. The <code>ssl</code> parameter of the <a href="ngx_mail_core_module#listen">listen</a> directive should be used instead.
es: Esta directiva qued&oacute; obsoleta en la versi&oacute;n 1.15.0. En su lugar, debe usarse el par&aacute;metro <code>ssl</code> de la directiva <a href="ngx_mail_core_module#listen">listen</a> .
ko: 이 지시문은 버전 1.15.0에서 폐기되었습니다. <a href="ngx_mail_core_module#listen">listen</a> 지시문 의 <code>ssl</code> 매개 변수를 대신 사용해야합니다.

source: This example clones the current request and sets a finalization callback for the subrequest.
es: Este ejemplo clona la solicitud actual y establece una llamada de finalización para la subpetición.
ko: 이 예에서는 현재 요청을 복제하고 하위 요청에 대한 마무리 콜백을 설정합니다.

source: This function in the example is used to initialize the <code>preconfiguration</code> field of the HTTP module context and is called before the parsing of HTTP configuration, so that the parser can refer to these variables.
es: Esta funci&oacute;n en el ejemplo se usa para inicializar el campo de <code>preconfiguration</code> del contexto del m&oacute;dulo HTTP y se llama antes del an&aacute;lisis de la configuraci&oacute;n HTTP, para que el analizador pueda referirse a estas variables.
ko: 예제에서이 함수 는 HTTP 모듈 컨텍스트 의 <code>preconfiguration</code> 필드 를 초기화하는 데 사용되며 구문 분석기가 이러한 변수를 참조 할 수 있도록 HTTP 구성 구문 분석 전에 호출됩니다.

source: This functionality is available as part of our <a href="http://nginx.com/products/">commercial subscription</a>.
es: Esta funcionalidad est&aacute; disponible como parte de nuestra <a href="http://nginx.com/products/">suscripci&oacute;n comercial</a> .
ko: 이 기능은 <a href="http://nginx.com/products/">상용 가입의</a> 일부로 제공됩니다 .

source: This guide gives a basic introduction to nginx and describes some simple tasks that can be done with it. It is supposed that nginx is already installed on the reader&rsquo;s machine. If it is not, see the <a href="install">Installing nginx</a> page. This guide describes how to start and stop nginx, and reload its configuration, explains the structure of the configuration file and describes how to set up nginx to serve out static content, how to configure nginx as a proxy server, and how to connect it with a FastCGI application.
es: Esta gu&iacute;a ofrece una introducci&oacute;n b&aacute;sica a nginx y describe algunas tareas sencillas que se pueden realizar con &eacute;l. Se supone que nginx ya est&aacute; instalado en la m&aacute;quina del lector. Si no es as&iacute;, consulte la p&aacute;gina <a href="install">Instalaci&oacute;n de nginx</a> . Esta gu&iacute;a describe c&oacute;mo iniciar y detener nginx y volver a cargar su configuraci&oacute;n, explica la estructura del archivo de configuraci&oacute;n y describe c&oacute;mo configurar nginx para ofrecer contenido est&aacute;tico, c&oacute;mo configurar nginx como servidor proxy y c&oacute;mo conectarlo con una aplicaci&oacute;n FastCGI.
ko: 이 안내서는 nginx에 대한 기본적인 소개와 함께 수행 할 수있는 몇 가지 간단한 작업을 설명합니다. nginx가 리더기 시스템에 이미 설치되어 있다고 가정합니다. 그렇지 않은 경우, <a href="install">nginx 설치</a> 페이지를 참조하십시오. 이 안내서는 nginx를 시작 및 중지하는 방법과 구성을 다시로드하는 방법, 구성 파일의 구조를 설명하고 정적 콘텐츠를 제공하기 위해 nginx를 설정하는 방법, nginx를 프록시 서버로 구성하는 방법 및이를 연결하는 방법을 설명합니다. FastCGI 응용 프로그램.

source: This is a wrong, cumbersome, and ineffective way. The right way is to define a separate server for <code>example.org</code>:
es: Esta es una forma incorrecta, engorrosa e ineficaz. La forma correcta es definir un servidor separado para <code>example.org</code> :
ko: 이것은 잘못되고 성가 시며 비효율적 인 방법입니다. 올바른 방법은 <code>example.org</code> 에 별도의 서버를 정의하는 것입니다 .

source: This is already a working configuration of a server that listens on the standard port 80 and is accessible on the local machine at <code>http://localhost/</code>. In response to requests with URIs starting with <code>/images/</code>, the server will send files from the <code>/data/images</code> directory. For example, in response to the <code>http://localhost/images/example.png</code> request nginx will send the <code>/data/images/example.png</code> file. If such file does not exist, nginx will send a response indicating the 404 error. Requests with URIs not starting with <code>/images/</code> will be mapped onto the <code>/data/www</code> directory. For example, in response to the <code>http://localhost/some/example.html</code> request nginx will send the <code>/data/www/some/example.html</code> file.
es: Esta ya es una configuraci&oacute;n funcional de un servidor que escucha en el puerto est&aacute;ndar 80 y es accesible en la m&aacute;quina local en <code>http://localhost/</code> . En respuesta a las solicitudes con URI que comienzan con <code>/images/</code> , el servidor enviar&aacute; archivos desde el directorio <code>/data/images</code> . Por ejemplo, en respuesta a la solicitud <code>http://localhost/images/example.png</code> , nginx enviar&aacute; el archivo <code>/data/images/example.png</code> . Si dicho archivo no existe, nginx enviar&aacute; una respuesta indicando el error 404. Las solicitudes con URI que no comiencen con <code>/images/</code> se asignar&aacute;n al directorio <code>/data/www</code> . Por ejemplo, en respuesta a <code>http://localhost/some/example.html</code> request nginx enviar&aacute; el archivo <code>/data/www/some/example.html</code> .
ko: 이미 표준 포트 80에서 수신 대기하고 로컬 시스템 ( <code>http://localhost/</code> 에서 액세스 할 수있는 서버의 작동중인 구성입니다 . <code>/images/</code> 시작하는 URI가있는 요청에 응답 하여 서버는 <code>/data/images</code> 디렉토리 에서 파일을 보냅니다 . 예를 들어, <code>http://localhost/images/example.png</code> 요청 에 응답하여 nginx는 <code>/data/images/example.png</code> 파일 을 보냅니다 . 이러한 파일이 존재하지 않으면 nginx는 404 오류를 나타내는 응답을 보냅니다. <code>/images/</code> 시작하지 않는 URI가있는 요청 은 <code>/data/www</code> 디렉토리에 매핑됩니다 . 예를 들어 <code>http://localhost/some/example.html</code> 에 대한 응답으로요청 nginx는 <code>/data/www/some/example.html</code> 파일 을 보냅니다 .

source: This method also decrements the <code>tries</code> counter.
es: Este m&eacute;todo tambi&eacute;n reduce el contador de <code>tries</code> .
ko: 이 방법은 또한 <code>tries</code> 카운터를 감소시킵니다 .

source: This module implements handling of HTTP Dynamic Streaming requests in the &ldquo;<code>/videoSeg1-Frag1</code>&rdquo; form &mdash; extracting the needed fragment from the <code>videoSeg1.f4f</code> file using the <code>videoSeg1.f4x</code> index file. This module is an alternative to the Adobe&rsquo;s f4f module (HTTP Origin Module) for Apache.
es: Este m&oacute;dulo implementa el manejo de solicitudes HTTP Dynamic Streaming en el <code>/videoSeg1-Frag1</code> &ldquo; / videoSeg1-Frag1 &rdquo;, extrayendo el fragmento necesario del archivo <code>videoSeg1.f4f</code> utilizando el archivo de &iacute;ndice <code>videoSeg1.f4x</code> . Este m&oacute;dulo es una alternativa al m&oacute;dulo f4f de Adobe (M&oacute;dulo de origen HTTP) para Apache.
ko: 이 모듈은 " <code>/videoSeg1-Frag1</code> "형식 으로 HTTP 동적 스트리밍 요청 처리를 구현 하여 <code>videoSeg1.f4x</code> 색인 파일을 사용하여 <code>videoSeg1.f4f</code> 파일 에서 필요한 조각을 추출 합니다. 이 모듈은 Apache 용 Adobe f4f 모듈 (HTTP Origin Module)의 대안입니다.

source: This module is available as part of our <a href="http://nginx.com/products/">commercial subscription</a>.
es: Este m&oacute;dulo est&aacute; disponible como parte de nuestra <a href="http://nginx.com/products/">suscripci&oacute;n comercial</a> .
ko: 이 모듈은 <a href="http://nginx.com/products/">상용 가입의</a> 일부로 제공됩니다 .

source: This module is not built by default, it should be enabled with the <code>--with-google_perftools_module</code> configuration parameter.
es: Este m&oacute;dulo no est&aacute; construido de forma predeterminada, debe habilitarse con el <code>--with-google_perftools_module</code> configuraci&oacute;n --with-google_perftools_module .
ko: 이 모듈은 기본적으로 빌드되지 않으며 <code>--with-google_perftools_module</code> 구성 매개 변수를 사용하여 활성화해야합니다 .

source: This module is not built by default, it should be enabled with the <code>--with-http_auth_request_module</code> configuration parameter.
es: Este m&oacute;dulo no est&aacute; construido por defecto, debe habilitarse con el <code>--with-http_auth_request_module</code> configuraci&oacute;n --with-http_auth_request_module .
ko: 이 모듈은 기본적으로 빌드되지 않으며 <code>--with-http_auth_request_module</code> 구성 매개 변수를 사용하여 활성화해야합니다 .

source: This module is not built by default, it should be enabled with the <code>--with-http_dav_module</code> configuration parameter.
es: Este m&oacute;dulo no est&aacute; construido por defecto, debe habilitarse con el <code>--with-http_dav_module</code> configuraci&oacute;n --with-http_dav_module .
ko: 이 모듈은 기본적으로 빌드되지 않으며 <code>--with-http_dav_module</code> 구성 매개 변수를 사용하여 활성화해야합니다 .

source: This module is not built by default, it should be enabled with the <code>--with-http_flv_module</code> configuration parameter.
es: Este m&oacute;dulo no est&aacute; construido por defecto, debe habilitarse con el <code>--with-http_flv_module</code> configuraci&oacute;n --with-http_flv_module .
ko: 이 모듈은 기본적으로 빌드되지 않으며 <code>--with-http_flv_module</code> 구성 매개 변수를 사용하여 활성화해야합니다 .

source: This module is not built by default, it should be enabled with the <code>--with-http_geoip_module</code> configuration parameter.
es: Este m&oacute;dulo no est&aacute; construido por defecto, debe habilitarse con el <code>--with-http_geoip_module</code> configuraci&oacute;n --with-http_geoip_module .
ko: 이 모듈은 기본적으로 빌드되지 않으며 <code>--with-http_geoip_module</code> 구성 매개 변수를 사용하여 활성화해야합니다 .

source: This module is not built by default, it should be enabled with the <code>--with-http_gunzip_module</code> configuration parameter.
es: Este m&oacute;dulo no est&aacute; construido por defecto, debe habilitarse con el <code>--with-http_gunzip_module</code> configuraci&oacute;n --with-http_gunzip_module .
ko: 이 모듈은 기본적으로 빌드되지 않으며 <code>--with-http_gunzip_module</code> 구성 매개 변수를 사용하여 활성화해야합니다 .

source: This module is not built by default, it should be enabled with the <code>--with-http_gzip_static_module</code> configuration parameter.
es: Este m&oacute;dulo no est&aacute; construido por defecto, debe habilitarse con el <code>--with-http_gzip_static_module</code> configuraci&oacute;n --with-http_gzip_static_module .
ko: 이 모듈은 기본적으로 빌드되지 않으며 <code>--with-http_gzip_static_module</code> 구성 매개 변수를 사용하여 활성화해야합니다 .

source: This module is not built by default, it should be enabled with the <code>--with-http_image_filter_module</code> configuration parameter.
es: Este m&oacute;dulo no est&aacute; construido por defecto, debe habilitarse con el <code>--with-http_image_filter_module</code> configuraci&oacute;n --with-http_image_filter_module .
ko: 이 모듈은 기본적으로 빌드되지 않으며 <code>--with-http_image_filter_module</code> 구성 매개 변수를 사용하여 활성화해야합니다 .

source: This module is not built by default, it should be enabled with the <code>--with-http_mp4_module</code> configuration parameter.
es: Este m&oacute;dulo no est&aacute; construido por defecto, debe habilitarse con el <code>--with-http_mp4_module</code> configuraci&oacute;n --with-http_mp4_module .
ko: 이 모듈은 기본적으로 빌드되지 않으며 <code>--with-http_mp4_module</code> 구성 매개 변수를 사용하여 활성화해야합니다 .

source: This module is not built by default, it should be enabled with the <code>--with-http_perl_module</code> configuration parameter.
es: Este m&oacute;dulo no est&aacute; construido de forma predeterminada, debe habilitarse con el <code>--with-http_perl_module</code> configuraci&oacute;n --with-http_perl_module .
ko: 이 모듈은 기본적으로 빌드되지 않으며 <code>--with-http_perl_module</code> 구성 매개 변수를 사용하여 활성화해야합니다 .

source: This module is not built by default, it should be enabled with the <code>--with-http_random_index_module</code> configuration parameter.
es: Este m&oacute;dulo no est&aacute; construido por defecto, debe habilitarse con el <code>--with-http_random_index_module</code> configuraci&oacute;n --with-http_random_index_module .
ko: 이 모듈은 기본적으로 빌드되지 않으며 <code>--with-http_random_index_module</code> 구성 매개 변수를 사용하여 활성화해야합니다 .

source: This module is not built by default, it should be enabled with the <code>--with-http_realip_module</code> configuration parameter.
es: Este m&oacute;dulo no est&aacute; construido por defecto, debe habilitarse con el <code>--with-http_realip_module</code> configuraci&oacute;n --with-http_realip_module .
ko: 이 모듈은 기본적으로 빌드되지 않으며 <code>--with-http_realip_module</code> 구성 매개 변수를 사용하여 활성화해야합니다 .
