Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/nginx/nginx.*.004.xlf
Languages: es, ja, ko, ru, zh_cn

source: Sets an njs function which will be called at the <a href="stream_processing#preread_phase">preread</a> phase. Since <a href="../njs/changes#njs0.4.0">0.4.0</a>, a module function can be referenced.
ja: <a href="stream_processing#preread_phase">先読み</a>フェーズで呼び出されるnjs関数を設定します。<a href="../njs/changes#njs0.4.0">0.4.0</a>以降、モジュール関数を参照できます。
zh_cn: 设置将在<a href="stream_processing#preread_phase">预读</a>阶段调用的njs函数。从<a href="../njs/changes#njs0.4.0">0.4.0开始</a>，可以引用模块功能。

source: Sets an offset in bytes for byte-range requests. If the range is beyond the offset, the range request will be passed to the FastCGI server and the response will not be cached.
ja: バイト範囲要求のオフセットをバイト単位で設定します。範囲がオフセットを超えている場合、範囲要求は FastCGI サーバーに渡され、応答はキャッシュされません。
ru: Устанавливает смещение в байтах для запросов байт-диапазона.Если диапазон находится за пределами смещения,то запрос диапазона будет передан FastCGI-серверу и ответ не будет кэширован.
zh_cn: 设置字节范围请求的偏移量。如果范围超出了偏移量,范围请求将被传递给FastCGI服务器,响应将不会被缓存。

source: Sets an offset in bytes for byte-range requests. If the range is beyond the offset, the range request will be passed to the SCGI server and the response will not be cached.
ja: バイト範囲リクエストのオフセットをバイト単位で設定します。範囲がオフセットを超えている場合、範囲リクエストは SCGI サーバに渡され、レスポンスはキャッシュされません。
ru: Устанавливает смещение в байтах для запросов байт-диапазона.Если диапазон находится за пределами смещения,запрос диапазона будет передан на SCGI сервер,и ответ не будет записан в кэш.
zh_cn: 为字节范围请求设置一个以字节为单位的偏移量。如果范围超过了偏移量,范围请求将被传递给SCGI服务器,响应将不会被缓存。

source: Sets an offset in bytes for byte-range requests. If the range is beyond the offset, the range request will be passed to the proxied server and the response will not be cached.
ja: バイト範囲リクエストのオフセットをバイト単位で設定します。範囲がオフセットを超えている場合、範囲リクエストはプロキシされたサーバに渡され、レスポンスはキャッシュされません。
ru: Устанавливает смещение в байтах для запросов байт-диапазона.Если диапазон находится за пределами смещения,то запрос диапазона будет передан прокси-серверу и ответ не будет кэшироваться.
zh_cn: 为字节范围请求设置一个以字节为单位的偏移量。如果范围超出了偏移量,范围请求将被传递给代理服务器,响应将不会被缓存。

source: Sets an offset in bytes for byte-range requests. If the range is beyond the offset, the range request will be passed to the uwsgi server and the response will not be cached.
ja: バイト範囲リクエストのオフセットをバイト単位で設定します。範囲がオフセットを超えている場合、範囲リクエストは uwsgi サーバに渡され、レスポンスはキャッシュされません。
ru: Устанавливает смещение в байтах для запросов байт-диапазона.Если диапазон находится за пределами смещения,запрос диапазона будет передан на сервер uwsgi и ответ не будет кэшироваться.
zh_cn: 为字节范围请求设置一个以字节为单位的偏移量。如果范围超出了偏移量,范围请求将被传递给wsgi服务器,响应将不会被缓存。

source: Sets arbitrary OpenSSL configuration <a href="https://www.openssl.org/docs/man1.1.1/man3/SSL_CONF_cmd.html">commands</a> when establishing a connection with the gRPC SSL server.
ja: gRPC SSLサーバーとの接続を確立するときに、任意のOpenSSL構成<a href="https://www.openssl.org/docs/man1.1.1/man3/SSL_CONF_cmd.html">コマンドを</a>設定します。
zh_cn: 与gRPC SSL服务器建立连接时，设置任意的OpenSSL配置<a href="https://www.openssl.org/docs/man1.1.1/man3/SSL_CONF_cmd.html">命令</a>。

source: Sets arbitrary OpenSSL configuration <a href="https://www.openssl.org/docs/man1.1.1/man3/SSL_CONF_cmd.html">commands</a> when establishing a connection with the proxied HTTPS server.
ja: プロキシされたHTTPSサーバーとの接続を確立するときに任意のOpenSSL構成<a href="https://www.openssl.org/docs/man1.1.1/man3/SSL_CONF_cmd.html">コマンドを</a>設定します。
zh_cn: 与代理HTTPS服务器建立连接时，设置任意OpenSSL配置<a href="https://www.openssl.org/docs/man1.1.1/man3/SSL_CONF_cmd.html">命令</a>。

source: Sets arbitrary OpenSSL configuration <a href="https://www.openssl.org/docs/man1.1.1/man3/SSL_CONF_cmd.html">commands</a> when establishing a connection with the proxied server.
ja: プロキシサーバーとの接続を確立するときに、任意のOpenSSL構成<a href="https://www.openssl.org/docs/man1.1.1/man3/SSL_CONF_cmd.html">コマンドを</a>設定します。
zh_cn: 与代理服务器建立连接时设置任意的OpenSSL配置<a href="https://www.openssl.org/docs/man1.1.1/man3/SSL_CONF_cmd.html">命令</a>。

source: Sets arbitrary OpenSSL configuration <a href="https://www.openssl.org/docs/man1.1.1/man3/SSL_CONF_cmd.html">commands</a> when establishing a connection with the secured uwsgi server.
ja: 保護されたuwsgiサーバーとの接続を確立するときに、任意のOpenSSL構成<a href="https://www.openssl.org/docs/man1.1.1/man3/SSL_CONF_cmd.html">コマンドを</a>設定します。
zh_cn: 与安全的uwsgi服务器建立连接时设置任意的OpenSSL配置<a href="https://www.openssl.org/docs/man1.1.1/man3/SSL_CONF_cmd.html">命令</a>。

source: Sets arbitrary OpenSSL configuration <a href="https://www.openssl.org/docs/man1.1.1/man3/SSL_CONF_cmd.html">commands</a>.
ja: 任意のOpenSSL構成<a href="https://www.openssl.org/docs/man1.1.1/man3/SSL_CONF_cmd.html">コマンドを</a>設定します。
zh_cn: 设置任意的OpenSSL配置<a href="https://www.openssl.org/docs/man1.1.1/man3/SSL_CONF_cmd.html">命令</a>。

source: Sets buffer size for reading client request body. In case the request body is larger than the buffer, the whole body or only its part is written to a <a href="#client_body_temp_path">temporary file</a>. By default, buffer size is equal to two memory pages. This is 8K on x86, other 32-bit platforms, and x86-64. It is usually 16K on other 64-bit platforms.
ja: クライアント要求本文を読み取るためのバッファサイズを設定します。リクエストの本文がバッファより大きい場合、本文全体またはその一部のみが<a href="#client_body_temp_path">一時ファイルに</a>書き込まれます。デフォルトでは、バッファサイズは2つのメモリページと同じです。これは、x86、その他の32ビットプラットフォーム、およびx86-64では8Kです。他の64ビットプラットフォームでは通常16Kです。
ru: Устанавливает размер буфера для чтения тела запроса клиента. В случае, если тело запроса больше, чем буфер, все тело или только его часть записывается во <a href="#client_body_temp_path">временный файл</a> . По умолчанию размер буфера равен двум страницам памяти. Это 8K на x86, других 32-битных платформах и x86-64. Обычно это 16 КБ на других 64-битных платформах.
zh_cn: 设置用于读取客户端请求正文的缓冲区大小。如果请求主体大于缓冲区，则将整个主体或仅将其一部分写入<a href="#client_body_temp_path">临时文件</a>。默认情况下，缓冲区大小等于两个内存页。在x86，其他32位平台和x86-64上为8K。在其他64位平台上，通常为16K。

source: Sets buffer size for reading client request header. For most requests, a buffer of 1K bytes is enough. However, if a request includes long cookies, or comes from a WAP client, it may not fit into 1K. If a request line or a request header field does not fit into this buffer then larger buffers, configured by the <a href="#large_client_header_buffers">large_client_header_buffers</a> directive, are allocated.
ja: クライアント要求ヘッダーを読み取るためのバッファサイズを設定します。ほとんどのリクエストでは、1Kバイトのバッファで十分です。ただし、リクエストに長いCookieが含まれている場合や、WAPクライアントからのリクエストの場合は、1Kに収まらない可能性があります。要求行または要求ヘッダーフィールドがこのバッファーに収まらない場合は、<a href="#large_client_header_buffers">large_client_header_buffers</a>ディレクティブによって構成されたより大きなバッファーが割り当てられます。
ru: Устанавливает размер буфера для чтения заголовка запроса клиента. Для большинства запросов достаточно буфера размером 1 Кбайт. Однако, если запрос включает длинные файлы cookie или исходит от клиента WAP, он может не уместиться в 1 КБ. Если строка запроса или поле заголовка запроса не помещаются в этот буфер, то выделяются более крупные буферы, настроенные директивой <a href="#large_client_header_buffers">large_client_header_buffers</a> .
zh_cn: 设置用于读取客户端请求标头的缓冲区大小。对于大多数请求，一个1K字节的缓冲区就足够了。但是，如果请求包含较长的Cookie或来自WAP客户端，则该请求可能不适合1K。如果请求行或请求标头字段不适合此缓冲区，<a href="#large_client_header_buffers">则将</a>分配由large_client_header_buffers指令配置的较大缓冲区。

source: Sets caching time for different response codes. For example, the following directives
ja: 異なるレスポンスコードのキャッシュ時間を設定します。例えば、以下のディレクティブは
ru: Устанавливает время кэширования для различных кодов ответа.Например,следующие директивы
zh_cn: 设置不同响应代码的缓存时间。例如,以下指令

source: Sets configuration depending on a request URI.
ja: リクエストURIに応じた設定を設定します。
ru: Устанавливает конфигурацию в зависимости от URI запроса.
zh_cn: 根据请求URI设置配置。

source: Sets configuration for a virtual server. There is no clear separation between IP-based (based on the IP address) and name-based (based on the &ldquo;Host&rdquo; request header field) virtual servers. Instead, the <a href="#listen">listen</a> directives describe all addresses and ports that should accept connections for the server, and the <a href="#server_name">server_name</a> directive lists all server names. Example configurations are provided in the &ldquo;<a href="request_processing">How nginx processes a request</a>&rdquo; document.
ja: 仮想サーバーの構成を設定します。 IPベース（IPアドレスに基づく）と名前ベース（「Host」要求ヘッダーフィールドに基づく）の仮想サーバーは明確に区別されていません。代わりに、<a href="#listen">listen</a>ディレクティブはサーバーの接続を受け入れる必要があるすべてのアドレスとポートを記述し、<a href="#server_name">server_name</a>ディレクティブはすべてのサーバー名をリストします。構成例は、「<a href="request_processing">nginxがリクエストを処理する方法</a>」ドキュメントに記載されています。
ru: Устанавливает конфигурацию для виртуального сервера. Нет четкого разделения между виртуальными серверами на основе IP (на основе IP-адреса) и на основе имен (на основе поля заголовка запроса &laquo;Хост&raquo;). Вместо этого директивы <a href="#listen">listen</a> описывают все адреса и порты, которые должны принимать соединения для сервера, а директива <a href="#server_name">server_name</a> перечисляет все имена серверов. Примеры конфигураций представлены в документе &laquo; <a href="request_processing">Как nginx обрабатывает запрос</a> &raquo;.
zh_cn: 设置虚拟服务器的配置。基于IP的虚拟服务器（基于IP地址）和基于名称的虚拟服务器（基于&ldquo;主机&rdquo;请求标头字段）之间没有明确区分。取而代之的是，<a href="#listen">listen</a>指令描述应接受服务器连接的所有地址和端口，而<a href="#server_name">server_name</a>指令列出所有服务器名称。 &ldquo; <a href="request_processing">nginx如何处理请求</a> &rdquo;文档中提供了示例配置。

source: Sets facility of syslog messages, as defined in <a href="https://tools.ietf.org/html/rfc3164#section-4.1.1">RFC 3164</a>. Facility can be one of &ldquo;<code>kern</code>&rdquo;, &ldquo;<code>user</code>&rdquo;, &ldquo;<code>mail</code>&rdquo;, &ldquo;<code>daemon</code>&rdquo;, &ldquo;<code>auth</code>&rdquo;, &ldquo;<code>intern</code>&rdquo;, &ldquo;<code>lpr</code>&rdquo;, &ldquo;<code>news</code>&rdquo;, &ldquo;<code>uucp</code>&rdquo;, &ldquo;<code>clock</code>&rdquo;, &ldquo;<code>authpriv</code>&rdquo;, &ldquo;<code>ftp</code>&rdquo;, &ldquo;<code>ntp</code>&rdquo;, &ldquo;<code>audit</code>&rdquo;, &ldquo;<code>alert</code>&rdquo;, &ldquo;<code>cron</code>&rdquo;, &ldquo;<code>local0</code>&rdquo;..&ldquo;<code>local7</code>&rdquo;. Default is &ldquo;<code>local7</code>&rdquo;.
ja: <a href="https://tools.ietf.org/html/rfc3164#section-4.1.1">RFC 3164で</a>定義されているように、syslogメッセージの機能を設定します。ファシリティは、「 <code>kern</code> 」、「 <code>user</code> 」、「 <code>mail</code> 」、「 <code>daemon</code> 」、「 <code>auth</code> 」、「 <code>intern</code> 」、「 <code>lpr</code> 」、「 <code>news</code> 」、「 <code>uucp</code> 」、「 <code>clock</code> 」、「 <code>authpriv</code> 」、「 <code>ftp</code> 」、「 <code>ntp</code> 」、「 <code>audit</code> 」、「 <code>alert</code> 」、「 <code>cron</code> 」、「 <code>local0</code> 」..「 <code>local7</code> 」デフォルトは「 <code>local7</code> 」です。
ru: Устанавливает возможность сообщений системного журнала, как определено в <a href="https://tools.ietf.org/html/rfc3164#section-4.1.1">RFC 3164</a> . Средство может быть одним из &laquo; <code>kern</code> &raquo;, &laquo; <code>user</code> &raquo;, &laquo; <code>mail</code> &raquo;, &laquo; <code>daemon</code> &raquo;, &laquo; <code>auth</code> &raquo;, &laquo; <code>intern</code> &raquo;, &laquo; <code>lpr</code> &raquo;, &laquo; <code>news</code> &raquo;, &laquo; <code>uucp</code> &raquo;, &laquo; <code>clock</code> &raquo;, &laquo; <code>authpriv</code> &raquo;, &laquo; <code>ftp</code> &raquo;,&laquo; <code>ntp</code> &raquo;,&laquo; <code>audit</code> &raquo;,&laquo; <code>alert</code> &raquo;,&laquo; <code>cron</code> &raquo;,&laquo; <code>local0</code> &raquo;..&laquo; <code>local7</code> &raquo;. По умолчанию &laquo; <code>local7</code> &raquo;.
zh_cn: 设置syslog消息的功能，如<a href="https://tools.ietf.org/html/rfc3164#section-4.1.1">RFC 3164中</a>所定义。设施可以是&ldquo; <code>kern</code> &rdquo;，&ldquo; <code>user</code> &rdquo;，&ldquo; <code>mail</code> &rdquo;，&ldquo; <code>daemon</code> &rdquo;，&ldquo; <code>auth</code> &rdquo;，&ldquo; <code>intern</code> &rdquo;，&ldquo; <code>lpr</code> &rdquo;，&ldquo; <code>news</code> &rdquo;，&ldquo; <code>uucp</code> &rdquo;，&ldquo; <code>clock</code> &rdquo;，&ldquo; <code>authpriv</code> &rdquo;，&ldquo; <code>ftp</code> &rdquo;，&ldquo; <code>ntp</code> &rdquo;，&ldquo; <code>audit</code> &rdquo;，&ldquo; <code>alert</code> &rdquo;，&ldquo; <code>cron</code> &rdquo;，&ldquo; <code>local0</code> &rdquo; ..&ldquo; <code>local7</code> &rdquo;。默认值为&ldquo; <code>local7</code> &rdquo;。

source: Sets names of a virtual server, for example:
ja: 仮想サーバーの名前を設定します。
ru: Устанавливает имена,например,виртуального сервера:
zh_cn: 例如,设置虚拟服务器的名称。

source: Sets one or more flags for the cookie. The <code><i>cookie</i></code> can contain text, variables, and their combinations. The <code>secure</code>, <code>httponly</code>, <code>samesite=strict</code>, <code>samesite=lax</code>, <code>samesite=none</code> parameters add the corresponding flags. The <code>nosecure</code>, <code>nohttponly</code>, <code>nosamesite</code> parameters remove the corresponding flags.
ja: Cookieに1つ以上のフラグを設定します。 <code><i>cookie</i></code> 、テキスト、変数、およびこれらの組み合わせを含めることができます。 <code>secure</code> 、 <code>httponly</code> 、 <code>samesite=strict</code> 、 <code>samesite=lax</code> 、 <code>samesite=none</code> パラメータは対応するフラグを追加します。 <code>nosecure</code> 、 <code>nohttponly</code> 、 <code>nosamesite</code> パラメータは、対応するフラグを削除します。
zh_cn: 为cookie设置一个或多个标志。该 <code><i>cookie</i></code> 可以包含文本，变量，以及它们的组合。在 <code>secure</code> ， <code>httponly</code> ， <code>samesite=strict</code> ， <code>samesite=lax</code> ， <code>samesite=none</code> 参数添加相应的标志。的 <code>nosecure</code> ， <code>nohttponly</code> ， <code>nosamesite</code> 参数移除对应的标志。

source: Sets parameters for a shared memory zone that will keep states for various keys. In particular, the state includes the current number of connections. The <code><i>key</i></code> can contain text, variables, and their combination. Requests with an empty key value are not accounted.
ja: さまざまなキーの状態を保持する共有メモリゾーンのパラメータを設定します。特に、状態には現在の接続数が含まれます。 <code><i>key</i></code> 、テキスト、変数、およびその組み合わせを含むことができます。空のキー値を持つリクエストは考慮されません。
ru: Устанавливает параметры для общей зоны памяти, в которой будут храниться состояния различных клавиш. В частности, в состояние входит текущее количество подключений. <code><i>key</i></code> может содержать текст, переменные и их комбинации. Запросы с пустым значением ключа не учитываются.
zh_cn: 设置共享内存区域的参数，该参数将保留各种键的状态。特别是，状态包括当前的连接数。该 <code><i>key</i></code> 可以包含文本，变量，他们的组合。密钥值为空的请求不予考虑。

source: Sets parameters for a shared memory zone that will keep states for various keys. In particular, the state includes the current number of connections. The <code><i>key</i></code> can contain text, variables, and their combinations (1.11.2). Connections with an empty key value are not accounted. Usage example:
ja: さまざまなキーの状態を保持する共有メモリゾーンのパラメータを設定します。特に、状態には現在の接続数が含まれます。 <code><i>key</i></code> 、テキスト、変数、およびこれらの組み合わせ（1.11.2）を含むことができます。空のキー値を持つ接続は考慮されません。使用例：
ru: Устанавливает параметры для общей зоны памяти, в которой будут храниться состояния различных клавиш. В частности, в состояние входит текущее количество подключений. <code><i>key</i></code> может содержать текст, переменные и их комбинации (1.11.2). Соединения с пустым значением ключа не учитываются. Пример использования:
zh_cn: 设置共享内存区域的参数，该参数将保留各种键的状态。特别是，状态包括当前的连接数。该 <code><i>key</i></code> 可以包含文本，变量，以及它们的组合（1.11.2）。空键值的连接不予考虑。用法示例：

source: Sets parameters for a shared memory zone that will keep states for various keys. In particular, the state stores the current number of excessive requests. The <code><i>key</i></code> can contain text, variables, and their combination. Requests with an empty key value are not accounted.
ja: さまざまなキーの状態を保持する共有メモリゾーンのパラメータを設定します。特に、状態には現在の過剰な要求の数が格納されます。 <code><i>key</i></code> 、テキスト、変数、およびその組み合わせを含むことができます。空のキー値を持つリクエストは考慮されません。
ru: Устанавливает параметры для общей зоны памяти, в которой будут храниться состояния различных клавиш. В частности, в состоянии хранится текущее количество избыточных запросов. <code><i>key</i></code> может содержать текст, переменные и их комбинации. Запросы с пустым значением ключа не учитываются.
zh_cn: 设置共享内存区域的参数，该参数将保留各种键的状态。特别是，状态存储当前的过多请求数。该 <code><i>key</i></code> 可以包含文本，变量，他们的组合。密钥值为空的请求不予考虑。

source: Sets permitted methods of <a href="https://tools.ietf.org/html/rfc2554">SASL authentication</a> for SMTP clients. Supported methods are:
ja: SMTPクライアントに許可する<a href="https://tools.ietf.org/html/rfc2554">SASL認証</a>方式を設定します。サポートされているメソッドは次のとおりです。
ru: Устанавливает разрешенные методы <a href="https://tools.ietf.org/html/rfc2554">аутентификации SASL</a> для клиентов SMTP. Поддерживаемые методы:
zh_cn: 为SMTP客户端设置允许的<a href="https://tools.ietf.org/html/rfc2554">SASL身份验证</a>方法。支持的方法有：

source: Sets permitted methods of authentication for IMAP clients. Supported methods are:
ja: IMAP クライアントで許可される認証方法を設定します。サポートされている方法は以下の通りです。
ru: Устанавливает разрешенные методы аутентификации для IMAP клиентов.Поддерживаемые методы:
zh_cn: 设置IMAP客户端允许的认证方式。支持的方法有:

source: Sets permitted methods of authentication for POP3 clients. Supported methods are:
ja: POP3 クライアントで許可される認証方法を設定します。サポートされている方法は以下の通りです。
ru: Устанавливает разрешенные методы аутентификации для POP3 клиентов.Поддерживаемые методы:
zh_cn: 设置POP3客户端允许的认证方式。支持的方法是:

source: Sets severity of syslog messages for <a href="http/ngx_http_log_module#access_log">access_log</a>, as defined in <a href="https://tools.ietf.org/html/rfc3164#section-4.1.1">RFC 3164</a>. Possible values are the same as for the second parameter (level) of the <a href="ngx_core_module#error_log">error_log</a> directive. Default is &ldquo;<code>info</code>&rdquo;.
ja: <a href="https://tools.ietf.org/html/rfc3164#section-4.1.1">RFC 3164で</a>定義されているように、<a href="http/ngx_http_log_module#access_log">access_log</a>のsyslogメッセージの重大度を設定します。可能な値は、<a href="ngx_core_module#error_log">error_log</a>ディレクティブの2番目のパラメーター（レベル）と同じです。デフォルトは「 <code>info</code> 」です。
ru: Устанавливает серьезность сообщений системного журнала для <a href="http/ngx_http_log_module#access_log">access_log</a> , как определено в <a href="https://tools.ietf.org/html/rfc3164#section-4.1.1">RFC 3164</a> . Возможные значения такие же, как для второго параметра (уровня) директивы <a href="ngx_core_module#error_log">error_log</a> . По умолчанию - &laquo; <code>info</code> &raquo;.
zh_cn: 设置<a href="http/ngx_http_log_module#access_log">access_log</a>的syslog消息的严重性，如<a href="https://tools.ietf.org/html/rfc3164#section-4.1.1">RFC 3164中</a>所定义。可能的值与<a href="ngx_core_module#error_log">error_log</a>指令的第二个参数（级别）相同。默认为&ldquo; <code>info</code> &rdquo;。

source: Sets some parameters used during SSI processing, namely:
ja: SSI 処理中に使用されるいくつかのパラメータを設定します。
ru: Устанавливает некоторые параметры,используемые при обработке SSI,а именно:
zh_cn: 设置SSI处理过程中使用的一些参数,即:

source: Sets the <a href="https://tools.ietf.org/html/rfc2449">POP3 protocol</a> extensions list that is passed to the client in response to the <code>CAPA</code> command. The authentication methods specified in the <a href="#pop3_auth">pop3_auth</a> directive (<a href="https://tools.ietf.org/html/rfc2449">SASL</a> extension) and <a href="https://tools.ietf.org/html/rfc2595">STLS</a> are automatically added to this list depending on the <a href="ngx_mail_ssl_module#starttls">starttls</a> directive value.
ja: <code>CAPA</code> コマンドに応答してクライアントに渡される<a href="https://tools.ietf.org/html/rfc2449">POP3プロトコル</a>拡張リストを設定します。<a href="#pop3_auth">pop3_auth</a>ディレクティブ（<a href="https://tools.ietf.org/html/rfc2449">SASL</a>拡張）および<a href="https://tools.ietf.org/html/rfc2595">STLSで</a>指定された認証方法は、<a href="ngx_mail_ssl_module#starttls">starttls</a>ディレクティブの値に応じて、このリストに自動的に追加されます。
ru: Устанавливает список расширений <a href="https://tools.ietf.org/html/rfc2449">протокола POP3,</a> который передается клиенту в ответ на команду <code>CAPA</code> . Методы аутентификации, указанные в директиве <a href="#pop3_auth">pop3_auth</a> ( расширение <a href="https://tools.ietf.org/html/rfc2449">SASL</a> ) и <a href="https://tools.ietf.org/html/rfc2595">STLS</a> , автоматически добавляются в этот список в зависимости от <a href="ngx_mail_ssl_module#starttls">значения</a> директивы starttls .
zh_cn: 设置响应于 <code>CAPA</code> 命令而传递给客户端的<a href="https://tools.ietf.org/html/rfc2449">POP3协议</a>扩展列表。<a href="#pop3_auth">pop3_auth</a>指令（<a href="https://tools.ietf.org/html/rfc2449">SASL</a>扩展名）和<a href="https://tools.ietf.org/html/rfc2595">STLS</a>中指定的身份验证方法将根据<a href="ngx_mail_ssl_module#starttls">starttls</a>指令值自动添加到此列表中。

source: Sets the <a href="https://tools.ietf.org/html/rfc3501">IMAP protocol</a> extensions list that is passed to the client in response to the <code>CAPABILITY</code> command. The authentication methods specified in the <a href="#imap_auth">imap_auth</a> directive and <a href="https://tools.ietf.org/html/rfc2595">STARTTLS</a> are automatically added to this list depending on the <a href="ngx_mail_ssl_module#starttls">starttls</a> directive value.
ja: <code>CAPABILITY</code> コマンドへの応答としてクライアントに渡される<a href="https://tools.ietf.org/html/rfc3501">IMAPプロトコル</a>拡張リストを設定します。<a href="#imap_auth">imap_auth</a>ディレクティブと<a href="https://tools.ietf.org/html/rfc2595">STARTTLSで</a>指定された認証方法は、<a href="ngx_mail_ssl_module#starttls">starttls</a>ディレクティブの値に応じて、このリストに自動的に追加されます。
ru: Устанавливает список расширений <a href="https://tools.ietf.org/html/rfc3501">протокола IMAP,</a> который передается клиенту в ответ на команду <code>CAPABILITY</code> . Методы аутентификации, указанные в директиве <a href="#imap_auth">imap_auth</a> и <a href="https://tools.ietf.org/html/rfc2595">STARTTLS</a> , автоматически добавляются в этот список в зависимости от <a href="ngx_mail_ssl_module#starttls">значения</a> директивы starttls .
zh_cn: 设置响应 <code>CAPABILITY</code> 命令传递给客户端的<a href="https://tools.ietf.org/html/rfc3501">IMAP协议</a>扩展列表。根据<a href="ngx_mail_ssl_module#starttls">starttls</a>指令值，将<a href="#imap_auth">imap_auth</a>指令和<a href="https://tools.ietf.org/html/rfc2595">STARTTLS</a>中指定的身份验证方法自动添加到此列表中。

source: Sets the <code><i>address</i></code> and <code><i>port</i></code> for IP, or the <code><i>path</i></code> for a UNIX-domain socket on which the server will accept requests. Both <code><i>address</i></code> and <code><i>port</i></code>, or only <code><i>address</i></code> or only <code><i>port</i></code> can be specified. An <code><i>address</i></code> may also be a hostname, for example:
ja: IPの <code><i>address</i></code> と <code><i>port</i></code> 、またはサーバーが要求を受け入れるUNIXドメインソケットの <code><i>path</i></code> を設定します。 <code><i>address</i></code> と <code><i>port</i></code> 両方、または <code><i>address</i></code> のみ、または<i>ポート</i>のみを <code><i>port</i></code> できます。 <code><i>address</i></code> また、例えば、ホスト名とすることができます。
ru: Устанавливает <code><i>address</i></code> и <code><i>port</i></code> для IP или <code><i>path</i></code> для сокета домена UNIX, по которому сервер будет принимать запросы. Оба <code><i>address</i></code> и <code><i>port</i></code> , или только <code><i>address</i></code> или только <code><i>port</i></code> может быть указан. <code><i>address</i></code> также может быть имя хоста, например:
zh_cn: 设置IP 的 <code><i>address</i></code> 和 <code><i>port</i></code> ，或服务器将在其上接受请求的UNIX域套接字的 <code><i>path</i></code> 。既可以指定 <code><i>address</i></code> 和 <code><i>port</i></code> ，也可以仅指定 <code><i>address</i></code> 或 <code><i>port</i></code> 。一个 <code><i>address</i></code> 也可以是主机名，例如：

source: Sets the <code><i>address</i></code> and <code><i>port</i></code> for the socket on which the server will accept connections. It is possible to specify just the port. The address can also be a hostname, for example:
ja: サーバーが接続を受け入れるソケットの <code><i>address</i></code> と <code><i>port</i></code> を設定し<i>ます</i>。ポートのみ指定することも可能です。アドレスは、ホスト名にすることもできます。次に例を示します。
ru: Устанавливает <code><i>address</i></code> и <code><i>port</i></code> для сокета, на котором сервер будет принимать соединения. Можно указать просто порт. Адрес также может быть именем хоста, например:
zh_cn: 设置服务器将在其上接受连接的套接字的 <code><i>address</i></code> 和 <code><i>port</i></code> 。可以仅指定端口。该地址也可以是主机名，例如：
