Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/nginx/nginx.*.004.xlf
Languages: es, ja, ko, ru, zh_cn

source: The &ldquo;<a href="https://tools.ietf.org/html/rfc5861#section-4">stale-if-error</a>&rdquo; extension of the &ldquo;Cache-Control&rdquo; header field permits using a stale cached response in case of an error.
es: La extensi&oacute;n &ldquo; <a href="https://tools.ietf.org/html/rfc5861#section-4">obsoleta-si-error</a> &rdquo; del campo de encabezado &ldquo;Cache-Control&rdquo; permite usar una respuesta obsoleta en cach&eacute; en caso de error.
ja: 「Cache-Control」ヘッダーフィールドの「<a href="https://tools.ietf.org/html/rfc5861#section-4">stale-if-error</a>」拡張により、エラーが発生した場合に古いキャッシュされた応答を使用できます。
ko: "Cache-Control"헤더 필드 의 " <a href="https://tools.ietf.org/html/rfc5861#section-4">stale-if-error</a> "확장은 오류 발생시 오래된 캐시 된 응답 사용을 허용합니다.
ru: Расширение &laquo; <a href="https://tools.ietf.org/html/rfc5861#section-4">stale-if-error</a> &raquo; поля заголовка &laquo;Cache-Control&raquo; позволяет использовать устаревший кэшированный ответ в случае ошибки.
zh_cn: &ldquo; Cache-Control&rdquo;标头字段的&ldquo; <a href="https://tools.ietf.org/html/rfc5861#section-4">stale-if-error</a> &rdquo;扩展允许在出现错误的情况下使用过期缓存响应。

source: The &ldquo;<code>%s</code>&rdquo; format is suitable to output time in seconds.
es: El formato " <code>%s</code> " es adecuado para imprimir el tiempo en segundos.
ja: 「 <code>%s</code> 」形式は、秒単位で時間を出力するのに適しています。
ko: " <code>%s</code> "형식은 시간을 초 단위로 출력하는 데 적합합니다.
ru: Формат &laquo; <code>%s</code> &raquo; подходит для вывода времени в секундах.
zh_cn: &ldquo; <code>%s</code> &rdquo;格式适合于以秒为单位输出时间。

source: The &ldquo;<code>/</code>&rdquo; request will match configuration A, the &ldquo;<code>/index.html</code>&rdquo; request will match configuration B, the &ldquo;<code>/documents/document.html</code>&rdquo; request will match configuration C, the &ldquo;<code>/images/1.gif</code>&rdquo; request will match configuration D, and the &ldquo;<code>/documents/1.jpg</code>&rdquo; request will match configuration E.
es: El &ldquo; <code>/</code> petici&oacute;n&rdquo; coincidir&aacute; con la configuraci&oacute;n A, la &ldquo; <code>/index.html</code> solicitud&rdquo; coincidir&aacute; con la configuraci&oacute;n B, el &ldquo; <code>/documents/document.html</code> solicitud&rdquo; coincidir&aacute; configuraci&oacute;n C, el &ldquo; <code>/images/1.gif</code> &rdquo; solicitud coincidir&aacute; configuraci&oacute;n D, y la solicitud " <code>/documents/1.jpg</code> " coincidir&aacute; con la configuraci&oacute;n E.
ja: 「 <code>/</code> 」リクエストは構成Aと一致し、「/ <code>/index.html</code> 」リクエストは構成Bと一致し、「 <code>/documents/document.html</code> 」リクエストは構成Cと一致し、「 <code>/images/1.gif</code> 」リクエストは一致します構成D、および「 <code>/documents/1.jpg</code> 」リクエストは構成Eと一致します。
ko: &ldquo; <code>/</code> &rdquo;요청은 구성 A와 일치하고&ldquo; <code>/index.html</code> &rdquo;요청은 구성 B와 일치하고&ldquo; <code>/documents/document.html</code> &rdquo;요청은 구성 C와 일치하며&ldquo; <code>/images/1.gif</code> &rdquo;요청과 일치합니다 구성 D 및 " <code>/documents/1.jpg</code> "요청은 구성 E와 일치합니다.
ru: Запрос &laquo; <code>/</code> &raquo; будет соответствовать конфигурации A, запрос &laquo; <code>/index.html</code> &raquo; будет соответствовать конфигурации B, запрос &laquo; <code>/documents/document.html</code> &raquo; будет соответствовать конфигурации C, запрос &laquo; <code>/images/1.gif</code> &raquo; будет соответствовать конфигурация D, а запрос &laquo; <code>/documents/1.jpg</code> &raquo; будет соответствовать конфигурации E.
zh_cn: &ldquo; <code>/</code> &rdquo;请求将匹配配置A，&ldquo; <code>/index.html</code> &rdquo;请求将匹配配置B，&ldquo; <code>/documents/document.html</code> &rdquo;请求将匹配配置C，&ldquo; <code>/images/1.gif</code> &rdquo;请求将匹配配置D，&ldquo; <code>/documents/1.jpg</code> &rdquo;请求将与配置E相匹配。

source: The &ldquo;<code>/s/link?md5=_e4Nc3iduzkWRm01TBBNYw&amp;expires=2147483647</code>&rdquo; link restricts access to &ldquo;<code>/s/link</code>&rdquo; for the client with the IP address 127.0.0.1. The link also has the limited lifetime until January 19, 2038 (GMT).
es: El <code>/s/link?md5=_e4Nc3iduzkWRm01TBBNYw&amp;expires=2147483647</code> &ldquo; / s / link? Md5 = _e4Nc3iduzkWRm01TBBNYw &amp; expires = 2147483647 &rdquo; restringe el acceso a &ldquo; <code>/s/link</code> &rdquo; para el cliente con la direcci&oacute;n IP 127.0.0.1. El enlace tambi&eacute;n tiene una vida &uacute;til limitada hasta el 19 de enero de 2038 (GMT).
ja: 「 <code>/s/link?md5=_e4Nc3iduzkWRm01TBBNYw&amp;expires=2147483647</code> 」リンクは、IPアドレス127.0.0.1のクライアント <code>/s/link</code> 「/ s / link」へのアクセスを制限します。また、リンクには2038年1月19日（GMT）までの有効期限があります。
ko: " <code>/s/link?md5=_e4Nc3iduzkWRm01TBBNYw&amp;expires=2147483647</code> "링크 는 IP 주소가 127.0.0.1 인 클라이언트 <code>/s/link</code> " / s / link "에 대한 액세스를 제한 합니다. 링크는 2038 년 1 월 19 일 (GMT)까지 수명이 제한되어 있습니다.
ru: <code>/s/link?md5=_e4Nc3iduzkWRm01TBBNYw&amp;expires=2147483647</code> &laquo; / s / link? Md5 = _e4Nc3iduzkWRm01TBBNYw &amp; expires = 2147483647 &raquo; ограничивает доступ к &laquo; <code>/s/link</code> &raquo; для клиента с IP-адресом 127.0.0.1. Ссылка также имеет ограниченный срок действия до 19 января 2038 г. (GMT).
zh_cn: &ldquo; <code>/s/link?md5=_e4Nc3iduzkWRm01TBBNYw&amp;expires=2147483647</code> &rdquo;链接限制了IP地址为127.0.0.1的客户端对&ldquo; <code>/s/link</code> &rdquo;的访问。链接的有效期也有限，直到2038年1月19日（GMT）。

source: The &ldquo;<code>@</code>&rdquo; prefix defines a named location. Such a location is not used for a regular request processing, but instead used for request redirection. They cannot be nested, and cannot contain nested locations.
es: El prefijo " <code>@</code> " define una ubicaci&oacute;n con nombre. Esta ubicaci&oacute;n no se utiliza para un procesamiento de solicitudes regular, sino que se utiliza para la redirecci&oacute;n de solicitudes. No se pueden anidar y no pueden contener ubicaciones anidadas.
ja: 「 <code>@</code> 」接頭辞は、名前付きの場所を定義します。このような場所は、通常の要求処理には使用されませんが、要求のリダイレクトに使用されます。ネストすることはできず、ネストされた場所を含めることもできません。
ko: " <code>@</code> "접두사는 명명 된 위치를 정의합니다. 이러한 위치는 일반 요청 처리에 사용되지 않고 대신 요청 리디렉션에 사용됩니다. 중첩 될 수 없으며 중첩 된 위치를 포함 할 수 없습니다.
ru: Префикс &laquo; <code>@</code> &raquo; определяет именованное местоположение. Такое расположение не используется для обычной обработки запроса, а вместо этого используется для перенаправления запроса. Они не могут быть вложенными и не могут содержать вложенных расположений.
zh_cn: &ldquo; <code>@</code> &rdquo;前缀定义命名位置。这样的位置不用于常规请求处理，而是用于请求重定向。它们不能嵌套，也不能包含嵌套位置。

source: The &ldquo;<code>if</code>&rdquo; keyword is separated from the condition by one space. Opening brace is located on the same line, or on a dedicated line if the condition takes several lines. Closing brace is located on a dedicated line, optionally followed by &ldquo;<code>else if</code> / <code>else</code>&rdquo;. Usually, there is an empty line before the &ldquo;<code>else if</code> / <code>else</code>&rdquo; part:
es: La palabra clave " <code>if</code> " est&aacute; separada de la condici&oacute;n por un espacio. La riostra de apertura est&aacute; ubicada en la misma l&iacute;nea, o en una l&iacute;nea dedicada si la condici&oacute;n toma varias l&iacute;neas. La llave de cierre se encuentra en una l&iacute;nea dedicada, opcionalmente seguida de " <code>else if</code> / <code>else</code> ". Por lo general, hay una l&iacute;nea vac&iacute;a antes de la parte " <code>else if</code> / <code>else</code> ":
ja: 「 <code>if</code> 」キーワードは、条件から1つのスペースで区切られます。左中括弧は同じ行にあるか、条件が複数行の場合は専用行にあります。閉じ中括弧は専用行にあり、オプションで「 <code>else if</code> / <code>else</code> 」が後に続きます。通常、「 <code>else if</code> / <code>else</code> 」の前に空行があります：
ko: &ldquo; <code>if</code> &rdquo;키워드는 조건과 하나의 공백으로 구분됩니다. 여는 중괄호는 조건이 여러 줄이 필요한 경우 동일한 줄 또는 전용 줄에 있습니다. 닫는 중괄호는 전용 줄에 있으며 선택적으로 " <code>else if</code> / <code>else</code> "가 뒤에옵니다 . 일반적으로 " <code>else if</code> / <code>else</code> "부분 앞에는 빈 줄이 있습니다 .
ru: Ключевое слово &laquo; <code>if</code> &raquo; отделяется от условия одним пробелом. Открывающая фигурная скобка находится на той же строке или на выделенной строке, если условие занимает несколько строк. Закрывающая фигурная скобка находится в специальной строке, за которой может следовать &laquo; <code>else if</code> / <code>else</code> &raquo;. Обычно перед частью <code>else if</code> / <code>else</code> стоит пустая строка :
zh_cn: &ldquo; <code>if</code> &rdquo;关键字与条件之间用一个空格隔开。开括号位于同一行，或者，如果情况需要多行，则位于专用行。右括号位于专用行上，可选地后跟&ldquo; <code>else if</code> / <code>else</code> &rdquo;。通常，&ldquo; <code>else if</code> / <code>else</code> &rdquo;部分之前有一个空行：

source: The &ldquo;<code>switch</code>&rdquo; keyword is separated from the condition by one space. Opening brace is located on the same line. Closing brace is located on a dedicated line. The &ldquo;<code>case</code>&rdquo; keywords are lined up with &ldquo;<code>switch</code>&rdquo;:
es: La palabra clave " <code>switch</code> " est&aacute; separada de la condici&oacute;n por un espacio. La riostra de apertura se encuentra en la misma l&iacute;nea. La riostra de cierre se encuentra en una l&iacute;nea dedicada. Las palabras clave de " <code>case</code> " est&aacute;n alineadas con " <code>switch</code> ":
ja: 「 <code>switch</code> 」キーワードは、条件から1つのスペースで区切られます。開きブレースは同じ行にあります。クロージングブレースは専用ラインにあります。「 <code>case</code> 」キーワードは「 <code>switch</code> 」と並んでいます：
ko: &ldquo; <code>switch</code> &rdquo;키워드는 조건과 하나의 공백으로 구분됩니다. 여는 중괄호는 같은 줄에 있습니다. 결산 버팀대는 전용선에 있습니다. &ldquo; <code>case</code> &rdquo;키워드는&ldquo; <code>switch</code> "로 구성됩니다.
ru: Ключевое слово &laquo; <code>switch</code> &raquo; отделяется от условия одним пробелом. Открывающая скобка находится на той же строке. Закрывающая скобка находится на выделенной строке. В &laquo; <code>case</code> ключевые слова&raquo; выстроены с &laquo; <code>switch</code> &raquo;:
zh_cn: &ldquo; <code>switch</code> &rdquo;关键字与条件之间用一个空格隔开。撑杆位于同一行。闭合支架位于专用线路上。&ldquo; <code>case</code> &rdquo;关键字与&ldquo; <code>switch</code> &rdquo; 对齐：

source: The &ldquo;Keep-Alive: timeout=<code><i>time</i></code>&rdquo; header field is recognized by Mozilla and Konqueror. MSIE closes keep-alive connections by itself in about 60 seconds.
es: Mozilla y Konqueror reconocen el campo de encabezado "Keep-Alive: timeout = <code><i>time</i></code> ". MSIE cierra las conexiones Keep-Alive por s&iacute; mismo en unos 60 segundos.
ja: 「Keep-Alive：timeout = <code><i>time</i></code> 」ヘッダーフィールドは、MozillaおよびKonquerorによって認識されます。MSIEは、約60秒でキープアライブ接続を自動的に閉じます。
ko: &ldquo;Keep-Alive : timeout = <code><i>time</i></code> &rdquo;헤더 필드는 Mozilla와 Konqueror에 의해 인식됩니다. MSIE는 약 60 초 내에 연결 유지 연결을 자체적으로 닫습니다.
ru: Поле заголовка &laquo;Keep-Alive: timeout = <code><i>time</i></code> &raquo; распознается Mozilla и Konqueror. MSIE закрывает поддерживающие соединения самостоятельно примерно за 60 секунд.
zh_cn: Mozilla和Konqueror可以识别&ldquo;保持活动：超时= <code><i>time</i></code> &rdquo;标题字段。MSIE会在大约60秒内自行关闭保持活动的连接。

source: The &ldquo;X-Accel-Expires&rdquo; header field sets caching time of a response in seconds. The zero value disables caching for a response. If the value starts with the <code>@</code> prefix, it sets an absolute time in seconds since Epoch, up to which the response may be cached.
es: El campo de encabezado "X-Accel-Expires" establece el tiempo de almacenamiento en cach&eacute; de una respuesta en segundos. El valor cero inhabilita el almacenamiento en cach&eacute; para una respuesta. Si el valor comienza con el prefijo <code>@</code> , establece un tiempo absoluto en segundos desde Epoch, hasta el cual la respuesta puede almacenarse en cach&eacute;.
ja: 「X-Accel-Expires」ヘッダーフィールドは、応答のキャッシュ時間を秒単位で設定します。ゼロの値は、応答のキャッシュを無効にします。値が <code>@</code> 接頭辞で始まる場合は、エポックからの絶対時間を秒単位で設定します。この時間までは、応答がキャッシュされます。
ko: "X-Accel-Expires"헤더 필드는 응답의 캐싱 시간을 초 단위로 설정합니다. 값이 0이면 응답 캐싱이 비활성화됩니다. 값이 <code>@</code> 로 시작하면 접두어로 하면 응답이 캐시 될 수있는 Epoch 이후의 절대 시간 (초)을 설정합니다.
ru: В поле заголовка &laquo;X-Accel-Expires&raquo; задается время кеширования ответа в секундах. Нулевое значение отключает кеширование ответа. Если значение начинается с префикса <code>@</code> , оно устанавливает абсолютное время в секундах с начала эпохи, до которого ответ может быть кэширован.
zh_cn: &ldquo; X-Accel-Expires&rdquo;标头字段设置响应的缓存时间（以秒为单位）。零值禁用缓存响应。如果该值以 <code>@</code> 前缀开头，则它设置自Epoch以来的绝对时间（以秒为单位），直到该时间为止，响应都可以被缓存。

source: The <a href="#break">break</a>, <a href="#if">if</a>, <a href="#return">return</a>, <a href="#rewrite">rewrite</a>, and <a href="#set">set</a> directives are processed in the following order:
es: Las directivas <a href="#break">break</a> , <a href="#if">if</a> , <a href="#return">return</a> , <a href="#rewrite">rewrite</a> y <a href="#set">set</a> se procesan en el siguiente orden:
ja: <a href="#break">ブレークは</a>、<a href="#if">場合</a>、<a href="#return">戻り値は</a>、<a href="#rewrite">書き換え</a>、および<a href="#set">セット</a>ディレクティブは、次の順序で処理されます。
ko: <a href="#break">휴식</a> , <a href="#if">경우</a> , <a href="#return">반환</a> , <a href="#rewrite">재 작성</a> 및 <a href="#set">설정</a> 지침은 다음과 같은 순서로 처리됩니다
ru: <a href="#break">Перерыв</a> , <a href="#if">если</a> , <a href="#return">возвращение</a> , <a href="#rewrite">переписать</a> , и <a href="#set">набор</a> директив обрабатываются в следующем порядке:
zh_cn: 该<a href="#break">休息</a>，<a href="#if">如果</a>，<a href="#return">回报</a>，<a href="#rewrite">改写</a>，和<a href="#set">一套</a>指令按以下顺序进行处理：

source: The <a href="#def_nginx_http_upstream_conf_server">drain</a> parameter was added in <a href="#api_version">version</a> 2.
es: El par&aacute;metro de <a href="#def_nginx_http_upstream_conf_server">drenaje</a> se agreg&oacute; en la <a href="#api_version">versi&oacute;n</a> 2.
ja: <a href="#def_nginx_http_upstream_conf_server">ドレイン</a>パラメータがに追加されました<a href="#api_version">バージョン</a> 2。
ko: <a href="#def_nginx_http_upstream_conf_server">드레인</a> 파라미터 첨가 하였다 <a href="#api_version">버전</a> 2.
ru: Параметр <a href="#def_nginx_http_upstream_conf_server">стока</a> был добавлен в <a href="#api_version">версии</a> 2.
zh_cn: 所述<a href="#def_nginx_http_upstream_conf_server">漏极</a>中的溶液中加入参数<a href="#api_version">版本</a> 2。

source: The <a href="#discarded">discarded</a> field in <a href="#server_zones">server_zones</a> was added in <a href="#version">version</a> 6.
es: El campo <a href="#discarded">descartado</a> en <a href="#server_zones">server_zones</a> se agreg&oacute; en la <a href="#version">versi&oacute;n</a> 6.
ja: <a href="#server_zones">server_zones</a>の<a href="#discarded">破棄された</a>フィールドは、<a href="#version">バージョン</a> 6で追加されました。
ko: <a href="#discarded">폐기</a> 필드 <a href="#server_zones">server_zones을</a> 첨가 하였다 <a href="#version">버전</a> 6.
ru: <a href="#discarded">Отбрасываются</a> поле в <a href="#server_zones">server_zones</a> было добавлено в <a href="#version">версии</a> 6.
zh_cn: 在<a href="#discarded">丢弃</a>在字段<a href="#server_zones">server_zones</a>中加入<a href="#version">版本</a> 6。

source: The <a href="#generation">generation</a> field was added in <a href="#version">version</a> 5.
es: El campo de <a href="#generation">generaci&oacute;n</a> se agreg&oacute; en la <a href="#version">versi&oacute;n</a> 5.
ja: <a href="#generation">世代の</a>フィールドが中に追加されました<a href="#version">バージョン</a> 5。
ko: <a href="#generation">세대</a> 필드에 추가 된 <a href="#version">버전</a> 5.
ru: Поле <a href="#generation">генерации</a> было добавлено в <a href="#version">версии</a> 5.
zh_cn: 该<a href="#generation">发电</a>场在加入<a href="#version">版本</a> 5。

source: The <a href="#header_time">header_time</a> and <a href="#response_time">response_time</a> fields in <a href="#upstreams">upstreams</a> were added in <a href="#version">version</a> 5.
es: Los campos <a href="#header_time">header_time</a> y <a href="#response_time">response_time</a> en <a href="#upstreams">upstream</a> se agregaron en la <a href="#version">versi&oacute;n</a> 5.
ja: <a href="#upstreams">アップストリーム</a>の<a href="#header_time">header_time</a>および<a href="#response_time">response_time</a>フィールドは、<a href="#version">バージョン</a> 5で追加されました。
ko: <a href="#upstreams">업스트림</a> 의 <a href="#header_time">header_time</a> 및 <a href="#response_time">response_time</a> 필드 는 <a href="#version">버전</a> 5 에서 추가되었습니다 .
ru: В <a href="#header_time">header_time</a> и <a href="#response_time">response_time</a> поля <a href="#upstreams">выше по потоку</a> были добавлены в <a href="#version">версии</a> 5.
zh_cn: <a href="#version">版本</a> 5 中添加了<a href="#upstreams">上游</a>中的<a href="#header_time">header_time</a>和<a href="#response_time">response_time</a>字段。

source: The <a href="#id">id</a> and <a href="#max_conns">max_conns</a> fields in <a href="#upstreams">upstreams</a> were added in <a href="#version">version</a> 3.
es: Los campos <a href="#id">id</a> y <a href="#max_conns">max_conns</a> en <a href="#upstreams">upstream</a> se agregaron en la <a href="#version">versi&oacute;n</a> 3.
ja: <a href="#upstreams">アップストリーム</a>の<a href="#id">id</a>および<a href="#max_conns">max_conns</a>フィールドは、<a href="#version">バージョン</a> 3で追加されました。
ko: <a href="#upstreams">업스트림</a> 의 <a href="#id">id</a> 및 <a href="#max_conns">max_conns</a> 필드 는 <a href="#version">버전</a> 3 에서 추가되었습니다 .
ru: В <a href="#id">Идентификация</a> и <a href="#max_conns">max_conns</a> поля <a href="#upstreams">выше по потоку</a> были добавлены в <a href="#version">версии</a> 3.
zh_cn: <a href="#version">版本</a> 3 中添加了<a href="#upstreams">上游</a>的<a href="#id">id</a>和<a href="#max_conns">max_conns</a>字段。

source: The <a href="#name">name</a> and <a href="#service">service</a> fields in <a href="#upstreams">http</a> and <a href="#stream_upstreams">stream</a> upstreams were added in <a href="#version">version</a> 8.
es: Los campos de <a href="#name">nombre</a> y <a href="#service">servicio</a> en <a href="#upstreams">http</a> y <a href="#stream_upstreams">stream</a> upstream se agregaron en la <a href="#version">versi&oacute;n</a> 8.
ja: <a href="#upstreams">http</a>および<a href="#stream_upstreams">ストリーム</a>アップストリームの<a href="#name">名前</a>および<a href="#service">サービス</a>フィールドは、<a href="#version">バージョン</a> 8で追加されました。
ko: <a href="#upstreams">http</a> 및 <a href="#stream_upstreams">스트림</a> 업스트림 의 <a href="#name">이름</a> 및 <a href="#service">서비스</a> 필드 가 <a href="#version">버전</a> 8에 추가되었습니다 .
ru: В <a href="#name">имени</a> и <a href="#service">сервисные</a> поля в <a href="#upstreams">HTTP</a> и <a href="#stream_upstreams">поток</a> выше по потоку были добавлены в <a href="#version">версии</a> 8.
zh_cn: <a href="#version">版本</a> 8 中添加了<a href="#upstreams">http</a>和上游<a href="#stream_upstreams">流中</a>的<a href="#name">名称</a>和<a href="#service">服务</a>字段。

source: The <a href="#nginx_build">nginx_build</a> and <a href="#ppid">ppid</a> fields were added in <a href="#version">version</a> 8.
es: Los campos <a href="#nginx_build">nginx_build</a> y <a href="#ppid">ppid</a> se agregaron en la <a href="#version">versi&oacute;n</a> 8.
ja: <a href="#nginx_build">nginx_build</a>と<a href="#ppid">PPID</a>フィールドが中に追加された<a href="#version">バージョン</a> 8。
ko: <a href="#nginx_build">nginx_build</a> 와 <a href="#ppid">PPID</a> 필드에 추가 된 <a href="#version">버전</a> 8.
ru: В <a href="#nginx_build">nginx_build</a> и <a href="#ppid">PPID</a> поля были добавлены в <a href="#version">версии</a> 8.
zh_cn: 该<a href="#nginx_build">nginx_build</a>和<a href="#ppid">PPID</a>在加场<a href="#version">版</a> 8。

source: The <a href="#pid">pid</a> field was added in <a href="#version">version</a> 6.
es: El campo <a href="#pid">pid</a> se agreg&oacute; en la <a href="#version">versi&oacute;n</a> 6.
ja: <a href="#pid">PID</a>フィールドが中に追加されました<a href="#version">バージョン</a> 6。
ko: <a href="#pid">PID</a> 필드가 추가 된 <a href="#version">버전</a> 6.
ru: Поле <a href="#pid">pid</a> было добавлено в <a href="#version">версии</a> 6.
zh_cn: 该<a href="#pid">PID</a>字段加入<a href="#version">版本</a> 6。

source: The <a href="#queue">queue</a> status data were added in <a href="#version">version</a> 6.
es: Los datos del estado de la <a href="#queue">cola</a> se agregaron en la <a href="#version">versi&oacute;n</a> 6.
ja: <a href="#queue">キューの</a>ステータスデータがで追加された<a href="#version">バージョン</a> 6。
ko: <a href="#queue">큐</a> 상태 데이터에 첨가 <a href="#version">버전</a> 6.
ru: Данные о статусе <a href="#queue">очереди</a> были добавлены в <a href="#version">версии</a> 6.
zh_cn: 在<a href="#queue">队列</a>中添加状态数据<a href="#version">版本</a> 6。

source: The <a href="#respawned">respawned</a> field in <a href="#processes">processes</a> was added in <a href="#version">version</a> 5.
es: El campo <a href="#respawned">reaparecido</a> en <a href="#processes">procesos</a> se agreg&oacute; en la <a href="#version">versi&oacute;n</a> 5.
ja: <a href="#respawned">再生成</a>のフィールド<a href="#processes">のプロセスが</a>で追加された<a href="#version">バージョン</a> 5。
ko: <a href="#processes">프로세스</a> 의 <a href="#respawned">respawned</a> 필드가 <a href="#version">버전</a> 5 에 추가되었습니다 .
ru: Поле <a href="#respawned">respawned</a> в <a href="#processes">процессах</a> было добавлено в <a href="#version">версии</a> 5.
zh_cn: 在<a href="#respawned">重生</a>在现场<a href="#processes">过程</a>中加入<a href="#version">的版本</a> 5。

source: The <a href="#selected">selected</a> field in <a href="#upstreams">upstreams</a> was added in <a href="#version">version</a> 4.
es: El campo <a href="#selected">seleccionado</a> en <a href="#upstreams">upstreams</a> se agreg&oacute; en la <a href="#version">versi&oacute;n</a> 4.
ja: <a href="#selected">選択された</a>フィールド<a href="#upstreams">のアップストリームを</a>添加した<a href="#version">バージョン</a> 4。
ko: <a href="#selected">선택된</a> 필드 <a href="#upstreams">업스트림을</a> 첨가 하였다 <a href="#version">버전</a> 4.
ru: <a href="#selected">Выбрано</a> поле в <a href="#upstreams">выше по потоку</a> было добавлено в <a href="#version">версии</a> 4.
zh_cn: <a href="#version">版本</a> 4 中添加了<a href="#upstreams">上游中</a>的<a href="#selected">选定</a>字段。

source: The <a href="#server_zones">server_zones</a>, <a href="#caches">caches</a>, and <a href="#load_timestamp">load_timestamp</a> status data were added in <a href="#version">version</a> 2.
es: Los datos de estado <a href="#server_zones">server_zones</a> , <a href="#caches">caches</a> y <a href="#load_timestamp">load_timestamp</a> se agregaron en la <a href="#version">versi&oacute;n</a> 2.
ja: <a href="#server_zones">server_zones</a>、<a href="#caches">キャッシュ</a>、および<a href="#load_timestamp">load_timestampの</a>ステータスデータを添加した<a href="#version">バージョン</a> 2。
ko: <a href="#server_zones">server_zones</a> , <a href="#caches">캐시</a> 및 <a href="#load_timestamp">load_timestamp의</a> 상태 데이터에 추가 된 <a href="#version">버전</a> 2.
ru: В <a href="#server_zones">server_zones</a> , <a href="#caches">кэша</a> и <a href="#load_timestamp">load_timestamp</a> данных о состоянии были добавлены в <a href="#version">версии</a> 2.
zh_cn: 该<a href="#server_zones">server_zones</a>，<a href="#caches">高速缓存</a>和<a href="#load_timestamp">load_timestamp</a>中添加状态数据<a href="#version">的版本</a> 2。

source: The <a href="#sessions">sessions</a> status data and the <a href="#stream_discarded">discarded</a> field in stream <a href="#stream_server_zones">server_zones</a> were added in <a href="#version">version</a> 7.
es: Los datos de estado de las <a href="#sessions">sesiones</a> y el campo <a href="#stream_discarded">descartado</a> en la secuencia <a href="#stream_server_zones">server_zones</a> se agregaron en la <a href="#version">versi&oacute;n</a> 7.
ja: <a href="#sessions">セッション</a>状態データと<a href="#stream_discarded">、廃棄</a>ストリーム内のフィールド<a href="#stream_server_zones">server_zonesは、</a>で追加された<a href="#version">バージョン</a> 7。
ko: 스트림 <a href="#stream_server_zones">server_zones</a> 의 <a href="#sessions">세션</a> 상태 데이터 및 <a href="#stream_discarded">삭제 된</a> 필드 가 <a href="#version">버전</a> 7에 추가되었습니다 .
ru: В <a href="#version">версии</a> 7 были добавлены данные о состоянии <a href="#sessions">сеанса</a> и поле <a href="#stream_discarded">отброшенных</a> в поток <a href="#stream_server_zones">server_zones</a> .
zh_cn: 所述<a href="#sessions">会话</a>状态数据和所述<a href="#stream_discarded">丢弃</a>在流场<a href="#stream_server_zones">server_zones</a>中加入<a href="#version">版本</a> 7。
