Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/nginx/nginx.*.004.xlf
Languages: es, ja, ko, ru, zh_cn

source: The directive also defines what is considered an <a href="ngx_http_upstream_module#max_fails">unsuccessful attempt</a> of communication with a server. The cases of <code>error</code>, <code>timeout</code> and <code>invalid_header</code> are always considered unsuccessful attempts, even if they are not specified in the directive. The cases of <code>http_500</code>, <code>http_503</code>, and <code>http_429</code> are considered unsuccessful attempts only if they are specified in the directive. The cases of <code>http_403</code> and <code>http_404</code> are never considered unsuccessful attempts.
es: La directiva tambi&eacute;n define lo que se considera un <a href="ngx_http_upstream_module#max_fails">intento fallido</a> de comunicaci&oacute;n con un servidor. Los casos de <code>error</code> , <code>timeout</code> y <code>invalid_header</code> siempre se consideran intentos fallidos, incluso si no est&aacute;n especificados en la directiva. Los casos de <code>http_500</code> , <code>http_503</code> y <code>http_429</code> se consideran intentos fallidos solo si se especifican en la directiva. Los casos de <code>http_403</code> y <code>http_404</code> nunca se consideran intentos fallidos.
ko: 이 지시문은 또한 서버와의 통신에 <a href="ngx_http_upstream_module#max_fails">실패한</a> 것으로 간주되는 사항을 정의 합니다. 의 경우 <code>error</code> , <code>timeout</code> 및 <code>invalid_header</code> 는 항상이 지침에 규정되지 않은 경우에도 실패한 시도로 간주됩니다. 의 경우 <code>http_500</code> , <code>http_503</code> 및 <code>http_429</code> 는 그들이 지시에 지정된 경우에만 성공하지 못한 시도로 간주됩니다. <code>http_403</code> 및 <code>http_404</code> 의 경우는 실패한 시도로 간주되지 않습니다.
ru: Директива также определяет, что считается <a href="ngx_http_upstream_module#max_fails">неудачной попыткой</a> связи с сервером. Случаи <code>error</code> , <code>timeout</code> и <code>invalid_header</code> всегда считаются неудачными попытками, даже если они не указаны в директиве. Случаи <code>http_500</code> , <code>http_503</code> и <code>http_429</code> считаются неудачными попытками, только если они указаны в директиве. Случаи <code>http_403</code> и <code>http_404</code> никогда не считаются неудачными попытками.

source: The directive also defines what is considered an <a href="ngx_http_upstream_module#max_fails">unsuccessful attempt</a> of communication with a server. The cases of <code>error</code>, <code>timeout</code> and <code>invalid_response</code> are always considered unsuccessful attempts, even if they are not specified in the directive. The case of <code>not_found</code> is never considered an unsuccessful attempt.
es: La directiva tambi&eacute;n define lo que se considera un <a href="ngx_http_upstream_module#max_fails">intento fallido</a> de comunicaci&oacute;n con un servidor. Los casos de <code>error</code> , <code>timeout</code> y <code>invalid_response</code> siempre se consideran intentos fallidos, incluso si no est&aacute;n especificados en la directiva. El caso de <code>not_found</code> nunca se considera un intento fallido.
ko: 이 지시문은 또한 서버와의 통신에 <a href="ngx_http_upstream_module#max_fails">실패한</a> 것으로 간주되는 사항을 정의 합니다. 의 경우 <code>error</code> , <code>timeout</code> 및 <code>invalid_response</code> 는 항상이 지침에 규정되지 않은 경우에도 실패한 시도로 간주됩니다. <code>not_found</code> 의 경우 는 실패한 시도로 간주되지 않습니다.
ru: Директива также определяет, что считается <a href="ngx_http_upstream_module#max_fails">неудачной попыткой</a> связи с сервером. Случаи <code>error</code> , <code>timeout</code> и <code>invalid_response</code> всегда считаются неудачными попытками, даже если они не указаны в директиве. Случай <code>not_found</code> никогда не считается неудачной попыткой.

source: The directive can also be specified using regular expressions. In this case, <code><i>domain</i></code> should start from the &ldquo;<code>~</code>&rdquo; symbol. A regular expression can contain named and positional captures, and <code><i>replacement</i></code> can reference them:
es: La directiva tambi&eacute;n se puede especificar mediante expresiones regulares. En este caso, el <code><i>domain</i></code> debe comenzar con el s&iacute;mbolo " <code>~</code> ". Una expresi&oacute;n regular puede contener capturas posicionales y con nombre, y el <code><i>replacement</i></code> puede hacer referencia a ellas:
ko: 지시문은 정규식을 사용하여 지정할 수도 있습니다. 이 경우 <code><i>domain</i></code> 은 " <code>~</code> "기호로 시작해야합니다 . 정규식에는 명명 된 위치 캡처와 위치 캡처가 포함될 수 있으며 <code><i>replacement</i></code> 는이를 참조 할 수 있습니다.
ru: Директиву также можно указать с помощью регулярных выражений. В этом случае <code><i>domain</i></code> должен начинаться с символа &laquo; <code>~</code> &raquo;. Регулярное выражение может содержать именованные и позиционные захваты, и <code><i>replacement</i></code> может ссылаться на них:

source: The directive can also be specified using regular expressions. In this case, <code><i>path</i></code> should either start from the &ldquo;<code>~</code>&rdquo; symbol for a case-sensitive matching, or from the &ldquo;<code>~*</code>&rdquo; symbols for case-insensitive matching. The regular expression can contain named and positional captures, and <code><i>replacement</i></code> can reference them:
es: La directiva tambi&eacute;n se puede especificar mediante expresiones regulares. En este caso, la <code><i>path</i></code> debe comenzar desde el s&iacute;mbolo &ldquo; <code>~</code> &rdquo; para una coincidencia que distingue entre may&uacute;sculas y min&uacute;sculas , o desde los s&iacute;mbolos &ldquo; <code>~*</code> &rdquo; para una coincidencia que no distingue entre may&uacute;sculas y min&uacute;sculas. La expresi&oacute;n regular puede contener capturas con nombre y posicionales, y el <code><i>replacement</i></code> puede hacer referencia a ellas:
ko: 지시문은 정규식을 사용하여 지정할 수도 있습니다. 이 경우 <code><i>path</i></code> 는 대소 문자를 구분하는 &ldquo; <code>~</code> &rdquo;기호 또는 대소 문자를 구분하지 않는 &ldquo; <code>~*</code> &rdquo;기호로 시작해야합니다 . 정규식에는 명명 된 위치 캡처와 위치 캡처가 포함될 수 있으며 <code><i>replacement</i></code> 는이를 참조 할 수 있습니다.
ru: Директиву также можно указать с помощью регулярных выражений. В этом случае <code><i>path</i></code> должен начинаться либо с символа &laquo; <code>~</code> &raquo; для сопоставления с учетом регистра, либо с символов &laquo; <code>~*</code> &raquo; для сопоставления без учета регистра. Регулярное выражение может содержать именованные и позиционные захваты, и <code><i>replacement</i></code> может ссылаться на них:

source: The directive can be specified (1.1.11) using regular expressions. In this case, <code><i>redirect</i></code> should either start with the &ldquo;<code>~</code>&rdquo; symbol for a case-sensitive matching, or with the &ldquo;<code>~*</code>&rdquo; symbols for case-insensitive matching. The regular expression can contain named and positional captures, and <code><i>replacement</i></code> can reference them:
es: La directiva se puede especificar (1.1.11) mediante expresiones regulares. En este caso, la <code><i>redirect</i></code> debe comenzar con el s&iacute;mbolo &ldquo; <code>~</code> &rdquo; para una coincidencia que distinga entre may&uacute;sculas y min&uacute;sculas, o con los s&iacute;mbolos &ldquo; <code>~*</code> &rdquo; para una coincidencia que no distinga entre may&uacute;sculas y min&uacute;sculas. La expresi&oacute;n regular puede contener capturas con nombre y posicionales, y el <code><i>replacement</i></code> puede hacer referencia a ellas:
ko: 지시문은 정규식을 사용하여 지정할 수 있습니다 (1.1.11). 이 경우 <code><i>redirect</i></code> 은 대 / 소문자를 구분하는 " <code>~</code> "기호로 시작 하거나 대 / 소문자를 구분하지 않는 " <code>~*</code> "기호로 시작해야합니다 . 정규식에는 명명 된 위치 캡처와 위치 캡처가 포함될 수 있으며 <code><i>replacement</i></code> 는이를 참조 할 수 있습니다.
ru: Директиву можно указать (1.1.11) с помощью регулярных выражений. В этом случае <code><i>redirect</i></code> должно начинаться либо с символа &laquo; <code>~</code> &raquo; для сопоставления с учетом регистра, либо с символа &laquo; <code>~*</code> &raquo; для сопоставления без учета регистра. Регулярное выражение может содержать именованные и позиционные захваты, и <code><i>replacement</i></code> может ссылаться на них:

source: The directive can be specified on the <code>stream</code> level starting from version 1.7.11, and on the <code>mail</code> level starting from version 1.9.0.
es: La directiva se puede especificar en el nivel de <code>stream</code> partir de la versi&oacute;n 1.7.11 y en el nivel de <code>mail</code> partir de la versi&oacute;n 1.9.0.
ko: 지정 문은 버전 1.7.11부터 <code>stream</code> 레벨 및 버전 1.9.0부터 <code>mail</code> 레벨 에서 지정할 수 있습니다 .
ru: Директива может быть указана на уровне <code>stream</code> начиная с версии 1.7.11, и на уровне <code>mail</code> начиная с версии 1.9.0.

source: The directive has the following parameters:
es: La directiva tiene los siguientes parámetros:
ko: 지시문에는 다음과 같은 매개 변수가 있습니다.
ru: Директива имеет следующие параметры:

source: The directive is applicable only for subrequests with response bodies saved into memory. For example, such subrequests are created by <a href="ngx_http_ssi_module#ssi_include_set">SSI</a>.
es: La directiva es aplicable solo para sub-solicitudes con cuerpos de respuesta guardados en la memoria. Por ejemplo, <a href="ngx_http_ssi_module#ssi_include_set">SSI</a> crea estas subpeticiones .
ko: 지시문은 응답 본문이 메모리에 저장된 하위 요청에만 적용됩니다. 예를 들어, 이러한 하위 요청은 <a href="ngx_http_ssi_module#ssi_include_set">SSI에</a> 의해 작성됩니다 .
ru: Директива применима только для подзапросов, тела ответов которых сохранены в памяти. Например, такие подзапросы создаются <a href="ngx_http_ssi_module#ssi_include_set">SSI</a> .

source: The directive is ignored if <a href="events#kqueue">kqueue</a> connection processing method is used, because it reports the number of new connections waiting to be accepted.
es: La directiva se ignora si se <a href="events#kqueue">usa el</a> m&eacute;todo de procesamiento de conexiones kqueue , porque informa el n&uacute;mero de conexiones nuevas que esperan ser aceptadas.
ko: <a href="events#kqueue">kqueue</a> 연결 처리 방법을 사용하는 경우 지시문은 무시 되기를 기다리는 새 연결 수를보고하므로 무시됩니다 .
ru: Директива игнорируется, если используется метод обработки соединения <a href="events#kqueue">kqueue</a> , поскольку он сообщает о количестве новых соединений, ожидающих принятия.

source: The directive is only available on FreeBSD and Linux.
es: La directiva sólo está disponible en FreeBSD y Linux.
ko: 지시문은 FreeBSD 및 Linux에서만 사용할 수 있습니다.
ru: Директива доступна только на FreeBSD и Linux.

source: The directive is supported when using OpenSSL 1.1.1 or higher (1.15.4) and <a href="https://boringssl.googlesource.com/boringssl/">BoringSSL</a>.
es: La directiva es compatible cuando se usa OpenSSL 1.1.1 o superior (1.15.4) y <a href="https://boringssl.googlesource.com/boringssl/">BoringSSL</a> .
ko: 이 지시문은 OpenSSL 1.1.1 이상 (1.15.4) 및 <a href="https://boringssl.googlesource.com/boringssl/">BoringSSL을</a> 사용할 때 지원됩니다 .
ru: Директива поддерживается при использовании OpenSSL 1.1.1 или выше (1.15.4) и <a href="https://boringssl.googlesource.com/boringssl/">BoringSSL</a> .

source: The directives <a href="ngx_http_ssl_module#ssl_protocols">ssl_protocols</a> and <a href="ngx_http_ssl_module#ssl_ciphers">ssl_ciphers</a> can be used to limit connections to include only the strong versions and ciphers of SSL/TLS. By default nginx uses &ldquo;<code>ssl_protocols TLSv1 TLSv1.1 TLSv1.2</code>&rdquo; and &ldquo;<code>ssl_ciphers HIGH:!aNULL:!MD5</code>&rdquo;, so configuring them explicitly is generally not needed. Note that default values of these directives were <a href="#compatibility">changed</a> several times.
es: Las directivas <a href="ngx_http_ssl_module#ssl_protocols">ssl_protocols</a> y <a href="ngx_http_ssl_module#ssl_ciphers">ssl_ciphers</a> se pueden usar para limitar las conexiones para incluir solo las versiones fuertes y los cifrados de SSL / TLS. Por defecto, nginx usa &ldquo; <code>ssl_protocols TLSv1 TLSv1.1 TLSv1.2</code> &rdquo; y &ldquo; <code>ssl_ciphers HIGH:!aNULL:!MD5</code> &rdquo;, por lo que generalmente no es necesario configurarlos expl&iacute;citamente. Tenga en cuenta que los valores predeterminados de estas directivas se <a href="#compatibility">cambiaron</a> varias veces.
ko: 지시문 <a href="ngx_http_ssl_module#ssl_protocols">ssl_protocols</a> 및 <a href="ngx_http_ssl_module#ssl_ciphers">ssl_ciphers</a> 를 사용하여 SSL / TLS의 강력한 버전 및 암호 만 포함하도록 연결을 제한 할 수 있습니다. 기본적으로 nginx는 " <code>ssl_protocols TLSv1 TLSv1.1 TLSv1.2</code> "및 " <code>ssl_ciphers HIGH:!aNULL:!MD5</code> "를 사용하므로 일반적으로 명시 적으로 구성 할 필요가 없습니다. 이 지시문의 기본값은 여러 번 <a href="#compatibility">변경되었습니다</a> .

source: The directives are inherited from the previous level if and only if there are no <code>limit_conn</code> directives on the current level.
es: Las directivas se heredan del nivel anterior si y solo si no hay directivas <code>limit_conn</code> en el nivel actual.
ko: 지시문은 현재 레벨에 <code>limit_conn</code> 지시문 이없는 경우에만 이전 레벨에서 상속 됩니다.

source: The elements of the array are available in the <code>elts</code> field. The <code>nelts</code> field holds the number of elements. The <code>size</code> field holds the size of a single element and is set when the array is initialized.
es: Los elementos de la matriz est&aacute;n disponibles en el campo <code>elts</code> . El campo <code>nelts</code> contiene el n&uacute;mero de elementos. El campo de <code>size</code> tiene el tama&ntilde;o de un solo elemento y se establece cuando se inicializa la matriz.
ko: 배열의 요소는 <code>elts</code> 필드 에서 사용할 수 있습니다 . <code>nelts</code> 의 필드 요소의 수를 보유하고 있습니다. <code>size</code> 필드는 하나의 요소의 크기를 유지하고 어레이가 초기화 될 때 설정된다.

source: The event loop has the following stages:
es: El bucle de eventos tiene las siguientes etapas:
ko: 이벤트 루프에는 다음 단계가 있습니다.

source: The exact names hash table is searched first. If a name is not found, the hash table with wildcard names starting with an asterisk is searched. If the name is not found there, the hash table with wildcard names ending with an asterisk is searched.
es: Primero se busca la tabla de hachís de los nombres exactos.Si no se encuentra un nombre,se busca en la tabla de hash con nombres comodines que empiezan con un asterisco.Si no se encuentra el nombre,se busca en la tabla de hash con nombres comodines que terminan con un asterisco.
ko: 정확한 이름 해시 테이블이 먼저 검색됩니다. 이름을 찾지 못하면 별표로 시작하는 와일드 카드 이름을 가진 해시 테이블이 검색됩니다. 이름을 찾을 수 없으면 별표로 끝나는 와일드 카드 이름이있는 해시 테이블이 검색됩니다.

source: The example above results in log entries like these:
es: El ejemplo anterior da lugar a entradas de registro como éstas:
ko: 위의 예는 다음과 같은 로그 항목을 생성합니다.

source: The expression should contain the secured part of a link (resource) and a secret ingredient. If the link has a limited lifetime, the expression should also contain <code>$secure_link_expires</code>.
es: La expresi&oacute;n debe contener la parte segura de un enlace (recurso) y un ingrediente secreto. Si el enlace tiene una vida &uacute;til limitada, la expresi&oacute;n tambi&eacute;n debe contener <code>$secure_link_expires</code> .
ko: 표현은 링크 (자원)의 보안 부분과 비밀 성분을 포함해야합니다. 링크의 수명이 제한된 경우 표현식에도 <code>$secure_link_expires</code> 포함되어야합니다 .

source: The file path can contain variables (0.7.6+), but such logs have some constraints:
es: La ruta del archivo puede contener variables (0.7.6+),pero tales registros tienen algunas restricciones:
ko: 파일 경로에는 변수 (0.7.6+)가 포함될 수 있지만 이러한 로그에는 몇 가지 제약 조건이 있습니다.

source: The file path can contain variables, but such logs have some constraints:
es: La ruta de los archivos puede contener variables,pero tales registros tienen algunas restricciones:
ko: 파일 경로에는 변수가 포함될 수 있지만 이러한 로그에는 몇 가지 제약 조건이 있습니다.

source: The file should be in the DER format as produced by the &ldquo;<code>openssl ocsp</code>&rdquo; command.
es: El archivo debe estar en el formato DER producido por el comando " <code>openssl ocsp</code> ".
ko: 파일은 " <code>openssl ocsp</code> "명령 으로 생성 된 DER 형식이어야합니다 .

source: The files can be compressed using the <code>gzip</code> command, or any other compatible one. It is recommended that the modification date and time of original and compressed files be the same.
es: Los archivos se pueden comprimir usando el comando <code>gzip</code> o cualquier otro compatible. Se recomienda que la fecha y la hora de modificaci&oacute;n de los archivos originales y comprimidos sean las mismas.
ko: <code>gzip</code> 명령 또는 다른 호환 가능한 파일을 사용하여 파일을 압축 할 수 있습니다 . 원본 파일과 압축 파일의 수정 날짜와 시간은 같은 것이 좋습니다.

source: The final DTrace script can be downloaded from <a href="http://nginx.org/download/trace_process_request.d">here</a>.
es: El script final de DTrace se puede descargar desde <a href="http://nginx.org/download/trace_process_request.d">aqu&iacute;</a> .
ko: 최종 DTrace 스크립트는 <a href="http://nginx.org/download/trace_process_request.d">여기</a> 에서 다운로드 할 수 있습니다 .

source: The final phase where the result of a client session processing is recorded. The <a href="ngx_stream_log_module">ngx_stream_log_module</a> module is invoked at this phase.
es: Fase final donde se registra el resultado del procesamiento de una sesi&oacute;n de cliente. El m&oacute;dulo <a href="ngx_stream_log_module">ngx_stream_log_module</a> se invoca en esta fase.
ko: 클라이언트 세션 처리 결과가 기록되는 마지막 단계입니다. <a href="ngx_stream_log_module">ngx_stream_log_module</a> 모듈은이 단계에서 호출됩니다.

source: The first name becomes the primary server name.
es: El primer nombre se convierte en el nombre del servidor principal.
ko: 이름이 기본 서버 이름이됩니다.

source: The first parameter defines a <code><i>file</i></code> that will store the log. The special value <code>stderr</code> selects the standard error file. Logging to <a href="syslog">syslog</a> can be configured by specifying the &ldquo;<code>syslog:</code>&rdquo; prefix. Logging to a <a href="debugging_log#memory">cyclic memory buffer</a> can be configured by specifying the &ldquo;<code>memory:</code>&rdquo; prefix and buffer <code><i>size</i></code>, and is generally used for debugging (1.7.11).
es: El primer par&aacute;metro define un <code><i>file</i></code> que almacenar&aacute; el registro. El valor especial <code>stderr</code> selecciona el archivo de error est&aacute;ndar. El registro en <a href="syslog">syslog</a> se puede configurar especificando el prefijo " <code>syslog:</code> ". El registro en un <a href="debugging_log#memory">b&uacute;fer de memoria c&iacute;clica</a> se puede configurar especificando el prefijo " <code>memory:</code> " y el <code><i>size</i></code> b&uacute;fer , y generalmente se usa para depurar (1.7.11).
ko: 첫 번째 매개 변수는 로그를 저장할 <code><i>file</i></code> 을 정의합니다 . 특수 값 <code>stderr</code> 은 표준 오류 파일을 선택합니다. " <code>syslog:</code> "접두사를 지정하여 <a href="syslog">syslog에</a> 로깅을 구성 할 수 있습니다 . <a href="debugging_log#memory">순환 메모리 버퍼에</a> 로깅 은 " <code>memory:</code> "접두사 및 버퍼 <code><i>size</i></code> 를 지정하여 구성 할 수 있으며 일반적으로 디버깅 (1.7.11)에 사용됩니다.<i></i>

source: The first parameter sets a timeout during which a keep-alive client connection will stay open on the server side. The zero value disables keep-alive client connections. The optional second parameter sets a value in the &ldquo;Keep-Alive: timeout=<code><i>time</i></code>&rdquo; response header field. Two parameters may differ.
es: El primer par&aacute;metro establece un tiempo de espera durante el cual una conexi&oacute;n de cliente Keep-Alive permanecer&aacute; abierta en el lado del servidor. El valor cero deshabilita las conexiones de cliente de mantenimiento. El segundo par&aacute;metro opcional establece un valor en el campo de encabezado de respuesta "Keep-Alive: timeout = <code><i>time</i></code> ". Pueden diferir dos par&aacute;metros.
ko: 첫 번째 매개 변수는 연결 유지 클라이언트 연결이 서버 쪽에서 열린 상태로 유지되는 시간 초과를 설정합니다. 값이 0이면 연결 유지 클라이언트 연결이 비활성화됩니다. 선택적 두 번째 매개 변수는&ldquo;Keep-Alive : timeout = <code><i>time</i></code> &rdquo;응답 헤더 필드에 값을 설정 합니다. 두 매개 변수가 다를 수 있습니다.

source: The first parameter sets the name of the cookie to be set or inspected. The cookie value is a hexadecimal representation of the MD5 hash of the IP address and port, or of the UNIX-domain socket path. However, if the &ldquo;<code>route</code>&rdquo; parameter of the <a href="#server">server</a> directive is specified, the cookie value will be the value of the &ldquo;<code>route</code>&rdquo; parameter:
es: El primer par&aacute;metro establece el nombre de la cookie que se instalar&aacute; o inspeccionar&aacute;. El valor de la cookie es una representaci&oacute;n hexadecimal del hash MD5 de la direcci&oacute;n IP y el puerto, o de la ruta del socket del dominio UNIX. Sin embargo, si se especifica el par&aacute;metro " <code>route</code> " de la directiva del <a href="#server">servidor</a> , el valor de la cookie ser&aacute; el valor del par&aacute;metro " <code>route</code> ":
ko: 첫 번째 매개 변수는 설정하거나 검사 할 쿠키의 이름을 설정합니다. 쿠키 값은 IP 주소 및 포트 또는 UNIX 도메인 소켓 경로의 MD5 해시를 16 진수로 나타낸 것입니다. 그러나 <a href="#server">서버</a> 지시문 의 " <code>route</code> "매개 변수 가 지정된 경우 쿠키 값은 " <code>route</code> "매개 변수 의 값이 됩니다.

source: The first phase after accepting a client connection. The <a href="ngx_stream_realip_module">ngx_stream_realip_module</a> module is invoked at this phase.
es: La primera fase despu&eacute;s de aceptar una conexi&oacute;n de cliente. El m&oacute;dulo <a href="ngx_stream_realip_module">ngx_stream_realip_module</a> se invoca en esta fase.
ko: 클라이언트 연결을 수락 한 후 첫 번째 단계. <a href="ngx_stream_realip_module">ngx_stream_realip_module</a> 모듈은이 단계에서 호출됩니다.

source: The first subrequest of an active request becomes active right after creation.
es: La primera subpetición de una petición activa se activa justo después de la creación.
ko: 활성 요청의 첫 번째 하위 요청은 생성 직후 활성화됩니다.

source: The first three parameters select an object. This can be either the whole http or stream upstream server group, or a specific server. Without other parameters, the configuration of the selected group or server is shown.
es: Los primeros tres parámetros seleccionan un objeto.Puede ser todo el grupo de servidores http o stream upstream,o un servidor específico.Sin otros parámetros,se muestra la configuración del grupo o servidor seleccionado.
ko: 처음 세 개의 매개 변수는 객체를 선택합니다. 전체 http 또는 스트림 업스트림 서버 그룹이거나 특정 서버 일 수 있습니다. 다른 매개 변수가 없으면 선택한 그룹 또는 서버의 구성이 표시됩니다.

source: The first two of the names mentioned above can be combined in one:
es: Los dos primeros nombres mencionados pueden combinarse en uno:
ko: 위에서 언급 한 이름 중 처음 두 가지를 하나로 결합 할 수 있습니다.

source: The flags for directive types are:
es: Las banderas para los tipos de directiva son:
ko: 지시문 유형의 플래그는 다음과 같습니다.

source: The following articles describe load balancing with NGINX Plus in more detail:
es: Los siguientes artículos describen el balanceo de carga con NGINX Plus con más detalle:
ko: 다음 기사에서는 NGINX Plus의로드 밸런싱에 대해 자세히 설명합니다.

source: The following commands are supported:
es: Se admiten los siguientes comandos:
ko: 다음 명령이 지원됩니다.

source: The following configuration sets up a session log and maps requests to sessions according to the request client address and &ldquo;User-Agent&rdquo; request header field:
es: La siguiente configuraci&oacute;n establece un registro de sesi&oacute;n y asigna las solicitudes a las sesiones de acuerdo con la direcci&oacute;n del cliente de solicitud y el campo de encabezado de solicitud "Usuario-Agente":
ko: 다음 구성은 세션 로그를 설정하고 요청 클라이언트 주소 및 "User-Agent"요청 헤더 필드에 따라 요청을 세션에 매핑합니다.

source: The following connection processing methods are supported:
es: Se admiten los siguientes métodos de procesamiento de conexiones:
ko: 다음과 같은 연결 처리 방법이 지원됩니다.

source: The following example creates a subrequest with the URI of <code>/foo</code>.
es: El siguiente ejemplo crea una subquest con el URI de <code>/foo</code> .
ko: 다음 예제는 URI가 <code>/foo</code> 인 하위 요청을 작성합니다 .
