Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/nginx/nginx.*.004.xlf
Languages: es, ja, ko, ru, zh_cn

source: When <a href="#fastcgi_buffering">buffering</a> of responses from the FastCGI server is enabled, and the whole response does not fit into the buffers set by the <a href="#fastcgi_buffer_size">fastcgi_buffer_size</a> and <a href="#fastcgi_buffers">fastcgi_buffers</a> directives, a part of the response can be saved to a temporary file. This directive sets the maximum <code><i>size</i></code> of the temporary file. The size of data written to the temporary file at a time is set by the <a href="#fastcgi_temp_file_write_size">fastcgi_temp_file_write_size</a> directive.
es: Cuando el <a href="#fastcgi_buffering">almacenamiento</a> en b&uacute;fer de las respuestas del servidor FastCGI est&aacute; habilitado y la respuesta completa no encaja en los b&uacute;feres establecidos por las directivas <a href="#fastcgi_buffer_size">fastcgi_buffer_size</a> y <a href="#fastcgi_buffers">fastcgi_buffers</a> , una parte de la respuesta se puede guardar en un archivo temporal. Esta directiva establece el <code><i>size</i></code> m&aacute;ximo del archivo temporal. El tama&ntilde;o de los datos escritos en el archivo temporal a la vez lo establece la directiva <a href="#fastcgi_temp_file_write_size">fastcgi_temp_file_write_size</a> .
ko: 때 <a href="#fastcgi_buffering">버퍼링</a> FastCGI를 서버에서 응답이 활성화되어, 전체 응답이 설정 한 버퍼에 맞지 않는 <a href="#fastcgi_buffer_size">fastcgi_buffer_size</a> 및 <a href="#fastcgi_buffers">fastcgi_buffers</a> 지시, 응답의 일부가 임시 파일로 저장할 수 있습니다. 이 지시문 은 임시 파일 의 최대 <code><i>size</i></code> 를 설정 합니다. 한 번에 임시 파일에 기록되는 데이터 크기는 <a href="#fastcgi_temp_file_write_size">fastcgi_temp_file_write_size</a> 지시문에 의해 설정됩니다 .

source: When <a href="#fastcgi_buffering">buffering</a> of responses from the FastCGI server is enabled, limits the total <code><i>size</i></code> of buffers that can be busy sending a response to the client while the response is not yet fully read. In the meantime, the rest of the buffers can be used for reading the response and, if needed, buffering part of the response to a temporary file. By default, <code><i>size</i></code> is limited by the size of two buffers set by the <a href="#fastcgi_buffer_size">fastcgi_buffer_size</a> and <a href="#fastcgi_buffers">fastcgi_buffers</a> directives.
es: Cuando se habilita el <a href="#fastcgi_buffering">almacenamiento</a> en b&uacute;fer de respuestas del servidor FastCGI, limita el <code><i>size</i></code> total de los b&uacute;feres que pueden estar ocupados enviando una respuesta al cliente mientras la respuesta a&uacute;n no se ha le&iacute;do por completo. Mientras tanto, el resto de b&uacute;feres se pueden usar para leer la respuesta y, si es necesario, almacenar parte de la respuesta en un archivo temporal. Por defecto, el <code><i>size</i></code> est&aacute; limitado por el tama&ntilde;o de dos b&uacute;feres establecidos por las directivas <a href="#fastcgi_buffer_size">fastcgi_buffer_size</a> y <a href="#fastcgi_buffers">fastcgi_buffers</a> .
ko: 때 <a href="#fastcgi_buffering">버퍼링</a> FastCGI를 서버에서 응답이 활성화되어, 총 제한 <code><i>size</i></code> 응답이 아직 완전히 읽지 않은 상태에서 클라이언트에 응답을 보내는 바쁜 될 수 있습니다 버퍼를. 그 동안 나머지 버퍼를 사용하여 응답을 읽고 필요한 경우 응답의 일부를 임시 파일로 버퍼링 할 수 있습니다. 기본적으로 <code><i>size</i></code> 는 <a href="#fastcgi_buffer_size">fastcgi_buffer_size</a> 및 <a href="#fastcgi_buffers">fastcgi_buffers</a> 지시문으로 설정된 두 개의 버퍼 <i>크기</i> 로 제한됩니다 .

source: When <a href="#lingering_close">lingering_close</a> is in effect, this directive specifies the maximum time during which nginx will process (read and ignore) additional data coming from a client. After that, the connection will be closed, even if there will be more data.
es: Cuando <a href="#lingering_close">lingering_close</a> est&aacute; en efecto, esta directiva especifica el tiempo m&aacute;ximo durante el cual nginx procesar&aacute; (leer&aacute; e ignorar&aacute;) datos adicionales provenientes de un cliente. Despu&eacute;s de eso, la conexi&oacute;n se cerrar&aacute;, incluso si habr&aacute; m&aacute;s datos.
ko: 때 <a href="#lingering_close">lingering_close가</a> 적용되는이 지침 지정의 nginx가 처리되는 동안 최대 시간은 클라이언트에서 오는 추가 데이터 (읽기 무시). 그 후에는 더 많은 데이터가 있더라도 연결이 닫힙니다.

source: When <a href="#lingering_close">lingering_close</a> is in effect, this directive specifies the maximum waiting time for more client data to arrive. If data are not received during this time, the connection is closed. Otherwise, the data are read and ignored, and nginx starts waiting for more data again. The &ldquo;wait-read-ignore&rdquo; cycle is repeated, but no longer than specified by the <a href="#lingering_time">lingering_time</a> directive.
es: Cuando <a href="#lingering_close">lingering_close</a> est&aacute; en vigor, esta directiva especifica el tiempo m&aacute;ximo de espera para que lleguen m&aacute;s datos del cliente. Si no se reciben datos durante este tiempo, la conexi&oacute;n se cierra. De lo contrario, los datos se leen y se ignoran, y nginx comienza a esperar m&aacute;s datos nuevamente. El ciclo "esperar-leer-ignorar" se repite, pero no m&aacute;s de lo especificado por la directiva <a href="#lingering_time">lingering_time</a> .
ko: 때 <a href="#lingering_close">lingering_close가</a> 적용되는이 지시어를 지정 더 많은 클라이언트 데이터 대기 시간을 최대 도착합니다. 이 시간 동안 데이터가 수신되지 않으면 연결이 닫힙니다. 그렇지 않으면 데이터를 읽고 무시하고 nginx가 더 많은 데이터를 다시 대기하기 시작합니다. "wait-read-ignore"주기는 반복되지만 <a href="#lingering_time">lingering_time</a> 지시문에 의해 지정된 시간보다 길지 않습니다 .

source: When <a href="#proxy_buffering">buffering</a> of responses from the proxied server is enabled, and the whole response does not fit into the buffers set by the <a href="#proxy_buffer_size">proxy_buffer_size</a> and <a href="#proxy_buffers">proxy_buffers</a> directives, a part of the response can be saved to a temporary file. This directive sets the maximum <code><i>size</i></code> of the temporary file. The size of data written to the temporary file at a time is set by the <a href="#proxy_temp_file_write_size">proxy_temp_file_write_size</a> directive.
es: Cuando el <a href="#proxy_buffering">almacenamiento</a> en b&uacute;fer de las respuestas del servidor proxy est&aacute; habilitado y la respuesta completa no encaja en los b&uacute;feres establecidos por las directivas <a href="#proxy_buffer_size">proxy_buffer_size</a> y <a href="#proxy_buffers">proxy_buffers</a> , una parte de la respuesta se puede guardar en un archivo temporal. Esta directiva establece el <code><i>size</i></code> m&aacute;ximo del archivo temporal. El tama&ntilde;o de los datos escritos en el archivo temporal a la vez lo establece la directiva <a href="#proxy_temp_file_write_size">proxy_temp_file_write_size</a> .
ko: 때 <a href="#proxy_buffering">버퍼링</a> 을 프록시 서버로부터의 응답이 활성화되어, 전체 응답이 설정 한 버퍼에 맞지 않는 <a href="#proxy_buffer_size">proxy_buffer_size</a> 및 <a href="#proxy_buffers">proxy_buffers</a> 지시, 응답의 일부가 임시 파일로 저장할 수 있습니다. 이 지시문 은 임시 파일 의 최대 <code><i>size</i></code> 를 설정 합니다. 한 번에 임시 파일에 기록되는 데이터의 크기는 <a href="#proxy_temp_file_write_size">proxy_temp_file_write_size</a> 지시문에 의해 설정됩니다 .

source: When <a href="#proxy_buffering">buffering</a> of responses from the proxied server is enabled, limits the total <code><i>size</i></code> of buffers that can be busy sending a response to the client while the response is not yet fully read. In the meantime, the rest of the buffers can be used for reading the response and, if needed, buffering part of the response to a temporary file. By default, <code><i>size</i></code> is limited by the size of two buffers set by the <a href="#proxy_buffer_size">proxy_buffer_size</a> and <a href="#proxy_buffers">proxy_buffers</a> directives.
es: Cuando el <a href="#proxy_buffering">almacenamiento</a> en b&uacute;fer de las respuestas del servidor proxy est&aacute; habilitado, limita el <code><i>size</i></code> total de los b&uacute;feres que pueden estar ocupados enviando una respuesta al cliente mientras la respuesta a&uacute;n no se ha le&iacute;do por completo. Mientras tanto, el resto de los b&uacute;feres se pueden usar para leer la respuesta y, si es necesario, almacenar parte de la respuesta en un archivo temporal. De forma predeterminada, el <code><i>size</i></code> est&aacute; limitado por el tama&ntilde;o de dos b&uacute;feres establecidos por las directivas <a href="#proxy_buffer_size">proxy_buffer_size</a> y <a href="#proxy_buffers">proxy_buffers</a> .
ko: 때 <a href="#proxy_buffering">버퍼링</a> 을 프록시 서버의 응답의 것이 활성화되어, 총 제한 <code><i>size</i></code> 응답이 아직 완벽하게 읽을 수있는 동안 클라이언트에 응답을 전송 바쁜 될 수 있습니다 버퍼를. 그 동안 나머지 버퍼를 사용하여 응답을 읽고 필요한 경우 응답의 일부를 임시 파일로 버퍼링 할 수 있습니다. 기본적으로 <code><i>size</i></code> 는 <a href="#proxy_buffer_size">proxy_buffer_size</a> 및 <a href="#proxy_buffers">proxy_buffers</a> 지시문에 의해 설정된 두 개의 버퍼 크기에 의해 제한됩니다 .

source: When <a href="#scgi_buffering">buffering</a> of responses from the SCGI server is enabled, and the whole response does not fit into the buffers set by the <a href="#scgi_buffer_size">scgi_buffer_size</a> and <a href="#scgi_buffers">scgi_buffers</a> directives, a part of the response can be saved to a temporary file. This directive sets the maximum <code><i>size</i></code> of the temporary file. The size of data written to the temporary file at a time is set by the <a href="#scgi_temp_file_write_size">scgi_temp_file_write_size</a> directive.
es: Cuando el <a href="#scgi_buffering">almacenamiento</a> en b&uacute;fer de las respuestas del servidor SCGI est&aacute; habilitado y la respuesta completa no encaja en los b&uacute;feres establecidos por las directivas <a href="#scgi_buffer_size">scgi_buffer_size</a> y <a href="#scgi_buffers">scgi_buffers</a> , una parte de la respuesta se puede guardar en un archivo temporal. Esta directiva establece el <code><i>size</i></code> m&aacute;ximo del archivo temporal. El tama&ntilde;o de los datos escritos en el archivo temporal a la vez lo establece la directiva <a href="#scgi_temp_file_write_size">scgi_temp_file_write_size</a> .
ko: 때 <a href="#scgi_buffering">버퍼링</a> SCGI 서버에서 응답이 활성화되어, 전체 응답이 설정 한 버퍼에 맞지 않는 <a href="#scgi_buffer_size">scgi_buffer_size</a> 및 <a href="#scgi_buffers">scgi_buffers</a> 지시, 응답의 일부가 임시 파일로 저장할 수 있습니다. 이 지시문 은 임시 파일 의 최대 <code><i>size</i></code> 를 설정 합니다. 한 번에 임시 파일에 기록되는 데이터 크기는 <a href="#scgi_temp_file_write_size">scgi_temp_file_write_size</a> 지시문에 의해 설정됩니다 .

source: When <a href="#scgi_buffering">buffering</a> of responses from the SCGI server is enabled, limits the total <code><i>size</i></code> of buffers that can be busy sending a response to the client while the response is not yet fully read. In the meantime, the rest of the buffers can be used for reading the response and, if needed, buffering part of the response to a temporary file. By default, <code><i>size</i></code> is limited by the size of two buffers set by the <a href="#scgi_buffer_size">scgi_buffer_size</a> and <a href="#scgi_buffers">scgi_buffers</a> directives.
es: Cuando el <a href="#scgi_buffering">almacenamiento</a> en b&uacute;fer de las respuestas del servidor SCGI est&aacute; habilitado, limita el <code><i>size</i></code> total de los b&uacute;feres que pueden estar ocupados enviando una respuesta al cliente mientras la respuesta a&uacute;n no se ha le&iacute;do por completo. Mientras tanto, el resto de los b&uacute;feres se pueden usar para leer la respuesta y, si es necesario, almacenar parte de la respuesta en un archivo temporal. De forma predeterminada, el <code><i>size</i></code> est&aacute; limitado por el tama&ntilde;o de dos b&uacute;feres establecidos por las directivas <a href="#scgi_buffer_size">scgi_buffer_size</a> y <a href="#scgi_buffers">scgi_buffers</a> .
ko: 때 <a href="#scgi_buffering">버퍼링</a> SCGI 서버에서 응답이 활성화되어, 총 제한 <code><i>size</i></code> 응답이 아직 완전히 읽지 않은 상태에서 클라이언트에 응답을 보내는 바쁜 될 수 있습니다 버퍼를. 그 동안 나머지 버퍼를 사용하여 응답을 읽고 필요한 경우 응답의 일부를 임시 파일로 버퍼링 할 수 있습니다. 기본적으로 <code><i>size</i></code> 는 <a href="#scgi_buffer_size">scgi_buffer_size</a> 및 <a href="#scgi_buffers">scgi_buffers</a> 지시문으로 설정된 두 개의 버퍼 크기에 의해 제한됩니다 .

source: When <a href="#uwsgi_buffering">buffering</a> of responses from the uwsgi server is enabled, and the whole response does not fit into the buffers set by the <a href="#uwsgi_buffer_size">uwsgi_buffer_size</a> and <a href="#uwsgi_buffers">uwsgi_buffers</a> directives, a part of the response can be saved to a temporary file. This directive sets the maximum <code><i>size</i></code> of the temporary file. The size of data written to the temporary file at a time is set by the <a href="#uwsgi_temp_file_write_size">uwsgi_temp_file_write_size</a> directive.
es: Cuando el <a href="#uwsgi_buffering">almacenamiento</a> en b&uacute;fer de las respuestas del servidor uwsgi est&aacute; habilitado y la respuesta completa no encaja en los b&uacute;feres establecidos por las directivas <a href="#uwsgi_buffer_size">uwsgi_buffer_size</a> y <a href="#uwsgi_buffers">uwsgi_buffers</a> , una parte de la respuesta se puede guardar en un archivo temporal. Esta directiva establece el <code><i>size</i></code> m&aacute;ximo del archivo temporal. El tama&ntilde;o de los datos escritos en el archivo temporal a la vez lo establece la directiva <a href="#uwsgi_temp_file_write_size">uwsgi_temp_file_write_size</a> .
ko: 때 <a href="#uwsgi_buffering">버퍼링</a> uwsgi 서버에서 응답이 활성화되어, 전체 응답이 설정 한 버퍼에 맞지 않는 <a href="#uwsgi_buffer_size">uwsgi_buffer_size</a> 및 <a href="#uwsgi_buffers">uwsgi_buffers</a> 지시, 응답의 일부가 임시 파일로 저장할 수 있습니다. 이 지시문 은 임시 파일 의 최대 <code><i>size</i></code> 를 설정 합니다. 한 번에 임시 파일에 기록되는 데이터의 크기는 <a href="#uwsgi_temp_file_write_size">uwsgi_temp_file_write_size</a> 지시문에 의해 설정됩니다 .

source: When <a href="#uwsgi_buffering">buffering</a> of responses from the uwsgi server is enabled, limits the total <code><i>size</i></code> of buffers that can be busy sending a response to the client while the response is not yet fully read. In the meantime, the rest of the buffers can be used for reading the response and, if needed, buffering part of the response to a temporary file. By default, <code><i>size</i></code> is limited by the size of two buffers set by the <a href="#uwsgi_buffer_size">uwsgi_buffer_size</a> and <a href="#uwsgi_buffers">uwsgi_buffers</a> directives.
es: Cuando el <a href="#uwsgi_buffering">almacenamiento</a> en b&uacute;fer de las respuestas del servidor uwsgi est&aacute; habilitado, limita el <code><i>size</i></code> total de los b&uacute;feres que pueden estar ocupados enviando una respuesta al cliente mientras la respuesta a&uacute;n no se ha le&iacute;do por completo. Mientras tanto, el resto de b&uacute;feres se pueden usar para leer la respuesta y, si es necesario, almacenar parte de la respuesta en un archivo temporal. De forma predeterminada, el <code><i>size</i></code> est&aacute; limitado por el tama&ntilde;o de dos b&uacute;feres establecidos por las directivas <a href="#uwsgi_buffer_size">uwsgi_buffer_size</a> y <a href="#uwsgi_buffers">uwsgi_buffers</a> .
ko: 때 <a href="#uwsgi_buffering">버퍼링</a> uwsgi 서버에서 응답이 활성화되어, 총 제한 <code><i>size</i></code> 응답이 아직 완전히 읽지 않은 상태에서 클라이언트에 응답을 보내는 바쁜 될 수 있습니다 버퍼를. 그 동안 나머지 버퍼를 사용하여 응답을 읽고 필요한 경우 응답의 일부를 임시 파일로 버퍼링 할 수 있습니다. 기본적으로 <code><i>size</i></code> 는 <a href="#uwsgi_buffer_size">uwsgi_buffer_size</a> 및 <a href="#uwsgi_buffers">uwsgi_buffers</a> 지시문에 의해 설정된 두 개의 버퍼 크기에 의해 제한됩니다 .

source: When <code>true</code>, adds a <a href="../stream/ngx_stream_upstream_module#backup">backup</a> server. This parameter cannot be changed.
es: Cuando es <code>true</code> , agrega un servidor de <a href="../stream/ngx_stream_upstream_module#backup">respaldo</a> . Este par&aacute;metro no se puede cambiar.
ko: 때 <code>true</code> 하는 추가 <a href="../stream/ngx_stream_upstream_module#backup">백업</a> 서버. 이 매개 변수는 변경할 수 없습니다.

source: When <code>true</code>, adds a <a href="ngx_http_upstream_module#backup">backup</a> server. This parameter cannot be changed.
es: Cuando es <code>true</code> , agrega un servidor de <a href="ngx_http_upstream_module#backup">respaldo</a> . Este par&aacute;metro no se puede cambiar.
ko: 때 <code>true</code> 하는 추가 <a href="ngx_http_upstream_module#backup">백업</a> 서버. 이 매개 변수는 변경할 수 없습니다.

source: When HTTP/1.1 chunked transfer encoding is used to send the original request body, the request body will be buffered regardless of the directive value unless HTTP/1.1 is <a href="#proxy_http_version">enabled</a> for proxying.
es: Cuando se usa la codificaci&oacute;n de transferencia fragmentada HTTP / 1.1 para enviar el cuerpo de la solicitud original, el cuerpo de la solicitud se almacenar&aacute; en b&uacute;fer independientemente del valor de la directiva, a menos que HTTP / 1.1 est&eacute; <a href="#proxy_http_version">habilitado</a> para el proxy.
ko: HTTP / 1.1 청크 전송 인코딩을 사용하여 원래 요청 본문을 보내는 경우 HTTP / 1.1 을 프록시에 <a href="#proxy_http_version">사용할 수</a> 없는 경우 지시문 값에 관계없이 요청 본문이 버퍼링됩니다 .

source: When HTTP/1.1 chunked transfer encoding is used to send the original request body, the request body will be buffered regardless of the directive value.
es: Cuando se utiliza la codificación de transferencia de trozos HTTP/1.1 para enviar el cuerpo de la solicitud original,el cuerpo de la solicitud se almacena en un búfer independientemente del valor de la directiva.
ko: HTTP / 1.1 청크 전송 인코딩을 사용하여 원래 요청 본문을 전송하면 지시문 값에 관계없이 요청 본문이 버퍼링됩니다.

source: When a connection to the proxied server cannot be established, determines whether a client connection will be passed to the next server.
es: Cuando no se puede establecer una conexión con el servidor proxy,determina si la conexión del cliente se pasará al siguiente servidor.
ko: 프록시 서버에 대한 연결을 설정할 수 없으면 클라이언트 연결이 다음 서버로 전달되는지 여부를 결정합니다.

source: When a request is finalized, its parent is activated.
es: Cuando se finaliza una solicitud,se activa su padre.
ko: 요청이 완료되면 해당 부모가 활성화됩니다.

source: When a worker process receives the shutdown or terminate command from the master, it invokes the <code>exit_process</code> handler.
es: Cuando un proceso de trabajo recibe el comando shutdown o terminate del maestro, invoca el controlador <code>exit_process</code> .
ko: 작업자 프로세스가 마스터로부터 shutdown 또는 terminate 명령을 수신하면 <code>exit_process</code> 핸들러를 호출 합니다.

source: When adding a server, it is possible to specify it as a domain name. In this case, changes of the IP addresses that correspond to a domain name will be monitored and automatically applied to the upstream configuration without the need of restarting nginx (1.7.2). This requires the &ldquo;<code>resolver</code>&rdquo; directive in the <a href="ngx_http_core_module#resolver">http</a> or <a href="../stream/ngx_stream_core_module#resolver">stream</a> block. See also the &ldquo;<code>resolve</code>&rdquo; parameter of the <a href="ngx_http_upstream_module#resolve">http</a> or <a href="../stream/ngx_stream_upstream_module#resolve">stream</a> upstream server.
es: Al agregar un servidor, es posible especificarlo como un nombre de dominio. En este caso, los cambios de las direcciones IP que corresponden a un nombre de dominio ser&aacute;n monitoreados y aplicados autom&aacute;ticamente a la configuraci&oacute;n ascendente sin la necesidad de reiniciar nginx (1.7.2). Esto requiere la directiva " <code>resolver</code> " en el bloque <a href="ngx_http_core_module#resolver">http</a> o <a href="../stream/ngx_stream_core_module#resolver">stream</a> . Consulte tambi&eacute;n el par&aacute;metro " <code>resolve</code> r " del servidor <a href="ngx_http_upstream_module#resolve">http</a> o de <a href="../stream/ngx_stream_upstream_module#resolve">flujo</a> ascendente.
ko: 서버를 추가 할 때 서버를 도메인 이름으로 지정할 수 있습니다. 이 경우 도메인 이름에 해당하는 IP 주소의 변경 사항이 모니터링되고 nginx (1.7.2)를 다시 시작할 필요없이 업스트림 구성에 자동으로 적용됩니다. <a href="ngx_http_core_module#resolver">http</a> 또는 <a href="../stream/ngx_stream_core_module#resolver">stream</a> 블록 에 " <code>resolver</code> "지시문 이 필요합니다 . <a href="ngx_http_upstream_module#resolve">http</a> 또는 <a href="../stream/ngx_stream_upstream_module#resolve">스트림</a> 업스트림 서버 의 " <code>resolve</code> "매개 변수를 참조하십시오 .

source: When both AIO and <a href="#sendfile">sendfile</a> are enabled on Linux, AIO is used for files that are larger than or equal to the size specified in the <a href="#directio">directio</a> directive, while <a href="#sendfile">sendfile</a> is used for files of smaller sizes or when <a href="#directio">directio</a> is disabled.
es: Cuando tanto AIO como <a href="#sendfile">sendfile</a> est&aacute;n habilitados en Linux, AIO se usa para archivos que son mayores o iguales al tama&ntilde;o especificado en la directiva <a href="#directio">directio</a> , mientras que <a href="#sendfile">sendfile</a> se usa para archivos de tama&ntilde;os m&aacute;s peque&ntilde;os o cuando <a href="#directio">directio</a> est&aacute; deshabilitado.
ko: Linux에서 AIO와 <a href="#sendfile">sendfile</a> 이 모두 활성화 된 경우 <a href="#directio">directio</a> 지시문에 지정된 크기보다 크거나 같은 파일에는 AIO가 사용되고 <a href="#sendfile">sendfile</a> 은 작은 크기의 파일이나 <a href="#directio">directio</a> 가 비활성화 된 파일에 사용됩니다.

source: When buffering is disabled, the request body is sent to the FastCGI server immediately as it is received. In this case, the request cannot be passed to the <a href="#fastcgi_next_upstream">next server</a> if nginx already started sending the request body.
es: Cuando el almacenamiento en b&uacute;fer est&aacute; desactivado, el cuerpo de la solicitud se env&iacute;a al servidor FastCGI inmediatamente a medida que se recibe. En este caso, la solicitud no se puede pasar al <a href="#fastcgi_next_upstream">siguiente servidor</a> si nginx ya comenz&oacute; a enviar el cuerpo de la solicitud.
ko: 버퍼링이 비활성화되면 요청 본문이 수신되는 즉시 FastCGI 서버로 전송됩니다. 이 경우, nginx가 이미 요청 본문 전송을 시작한 경우 요청을 <a href="#fastcgi_next_upstream">다음 서버</a> 로 전달할 수 없습니다 .

source: When buffering is disabled, the request body is sent to the SCGI server immediately as it is received. In this case, the request cannot be passed to the <a href="#scgi_next_upstream">next server</a> if nginx already started sending the request body.
es: Cuando el almacenamiento en b&uacute;fer est&aacute; deshabilitado, el cuerpo de la solicitud se env&iacute;a al servidor SCGI inmediatamente a medida que se recibe. En este caso, la solicitud no se puede pasar al <a href="#scgi_next_upstream">siguiente servidor</a> si nginx ya comenz&oacute; a enviar el cuerpo de la solicitud.
ko: 버퍼링이 비활성화되면 요청 본문이 수신되는 즉시 SCGI 서버로 전송됩니다. 이 경우, nginx가 이미 요청 본문 전송을 시작한 경우 요청을 <a href="#scgi_next_upstream">다음 서버</a> 로 전달할 수 없습니다 .

source: When buffering is disabled, the request body is sent to the proxied server immediately as it is received. In this case, the request cannot be passed to the <a href="#proxy_next_upstream">next server</a> if nginx already started sending the request body.
es: Cuando el almacenamiento en b&uacute;fer est&aacute; desactivado, el cuerpo de la solicitud se env&iacute;a al servidor proxy inmediatamente a medida que se recibe. En este caso, la solicitud no se puede pasar al <a href="#proxy_next_upstream">siguiente servidor</a> si nginx ya comenz&oacute; a enviar el cuerpo de la solicitud.
ko: 버퍼링이 비활성화되면 요청 본문이 수신되는 즉시 프록시 서버로 전송됩니다. 이 경우, nginx가 이미 요청 본문 전송을 시작한 경우 요청을 <a href="#proxy_next_upstream">다음 서버</a> 로 전달할 수 없습니다 .

source: When buffering is disabled, the request body is sent to the uwsgi server immediately as it is received. In this case, the request cannot be passed to the <a href="#uwsgi_next_upstream">next server</a> if nginx already started sending the request body.
es: Cuando el almacenamiento en b&uacute;fer est&aacute; deshabilitado, el cuerpo de la solicitud se env&iacute;a al servidor uwsgi inmediatamente a medida que se recibe. En este caso, la solicitud no se puede pasar al <a href="#uwsgi_next_upstream">siguiente servidor</a> si nginx ya comenz&oacute; a enviar el cuerpo de la solicitud.
ko: 버퍼링이 비활성화되면 요청 본문이 수신되는 즉시 uwsgi 서버로 전송됩니다. 이 경우, nginx가 이미 요청 본문 전송을 시작한 경우 요청을 <a href="#uwsgi_next_upstream">다음 서버</a> 로 전달할 수 없습니다 .
