Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/nginx/nginx.*.004.xlf
Languages: es, ja, ko, ru, zh_cn

source: Pseudo-streaming works in alliance with a compatible Flash player. The player sends an HTTP request to the server with the start time specified in the query string argument (named simply <code>start</code> and specified in seconds), and the server responds with the stream such that its start position corresponds to the requested time, for example:
zh_cn: 伪流与兼容的Flash Player结合使用。播放器使用在查询字符串参数中指定的开始时间（命名为 <code>start</code> 并以秒为单位）将HTTP请求发送到服务器，然后服务器以流进行响应，使其开始位置与请求的时间相对应，例如：

source: Put <code>*.d.ts</code> files to a place where you editor can find it.
zh_cn: 将 <code>*.d.ts</code> 文件放到编辑器可以找到它的地方。

source: Puts the <a href="ngx_http_upstream_module">http</a> upstream server into the &ldquo;draining&rdquo; mode (1.7.5). In this mode, only requests <a href="ngx_http_upstream_module#sticky">bound</a> to the server will be proxied to it.
zh_cn: 将<a href="ngx_http_upstream_module">http</a>上游服务器置于&ldquo;排水&rdquo;模式（1.7.5）。在这种模式下，仅<a href="ngx_http_upstream_module#sticky">绑定</a>到服务器的请求将被代理到该服务器。

source: Python compatible syntax, supported since PCRE-4.0
zh_cn: 与Python兼容的语法,从PCRE-4.0开始支持。

source: Query String
zh_cn: 查询字符串

source: Sets the maximum size of chunks into which the response body is <a href="https://www.chromium.org/spdy/spdy-protocol/spdy-protocol-draft2#TOC-Data-frames"> sliced</a>. A too low value results in higher overhead. A too high value impairs prioritization due to <a href="https://en.wikipedia.org/wiki/Head-of-line_blocking"> HOL blocking</a>.
zh_cn: 设置将响应主体<a href="https://www.chromium.org/spdy/spdy-protocol/spdy-protocol-draft2#TOC-Data-frames">切成</a>的块的最大大小。太低的值会导致更高的开销。太高的值会由于<a href="https://en.wikipedia.org/wiki/Head-of-line_blocking">HOL阻塞</a>而影响优先级。

source: Sets the maximum size of chunks into which the response body is sliced. A too low value results in higher overhead. A too high value impairs prioritization due to <a href="https://en.wikipedia.org/wiki/Head-of-line_blocking"> HOL blocking</a>.
zh_cn: 设置将响应主体切成的块的最大大小。太低的值会导致更高的开销。太高的值会由于<a href="https://en.wikipedia.org/wiki/Head-of-line_blocking">HOL阻塞</a>而影响优先级。

source: Sets the value of the <code>modifier1</code> field in the <a href="https://uwsgi-docs.readthedocs.org/en/latest/Protocol.html#uwsgi-packet-header">uwsgi packet header</a>.
zh_cn: 设置的值 <code>modifier1</code> 字段在<a href="https://uwsgi-docs.readthedocs.org/en/latest/Protocol.html#uwsgi-packet-header">uwsgi分组报头</a>。

source: Sets the value of the <code>modifier2</code> field in the <a href="https://uwsgi-docs.readthedocs.org/en/latest/Protocol.html#uwsgi-packet-header">uwsgi packet header</a>.
zh_cn: 设置的值 <code>modifier2</code> 字段在<a href="https://uwsgi-docs.readthedocs.org/en/latest/Protocol.html#uwsgi-packet-header">uwsgi分组报头</a>。

source: Since version 1.5.9 and prior to version 1.11.5, this parameter was available as part of our <a href="https://nginx.com/products/">commercial subscription</a>.
zh_cn: 从1.5.9版开始，在1.11.5版之前，此参数已作为我们的<a href="https://nginx.com/products/">商业订阅的</a>一部分提供。

source: Support for <code>SHA</code> scheme was added only to aid in migration from other web servers. It should not be used for new passwords, since unsalted SHA-1 hashing that it employs is vulnerable to <a href="https://en.wikipedia.org/wiki/Rainbow_attack">rainbow table</a> attacks.
zh_cn: 添加了对 <code>SHA</code> 方案的支持，只是为了帮助从其他Web服务器进行迁移。不应将其用于新密码，因为它使用的未加盐SHA-1哈希很容易受到<a href="https://en.wikipedia.org/wiki/Rainbow_attack">彩虹表</a>攻击。

source: TERM, INT
ru: ТЕРМ,ИНТ
zh_cn: 术语,INT

source: The <a href="../http/ngx_http_keyval_module#keyval">keyval</a> and <a href="../http/ngx_http_keyval_module#keyval_zone">keyval_zone</a> directives are available as part of our <a href="https://nginx.com/products/">commercial subscription</a>.
zh_cn: 该<a href="../http/ngx_http_keyval_module#keyval">KEYVAL</a>和<a href="../http/ngx_http_keyval_module#keyval_zone">keyval_zone</a>指令都可以作为我们的部分<a href="https://nginx.com/products/">商业订阅</a>。

source: The <a href="https://hg.nginx.org/nginx-dev-examples">nginx-dev-examples</a> repository provides nginx module examples.
zh_cn: 的<a href="https://hg.nginx.org/nginx-dev-examples">nginx的-DEV-实例</a>存储库提供nginx的模块的例子。

source: The <a href="https://hg.nginx.org/njs">repository</a> with njs sources can be cloned with the following command: (requires <a href="https://www.mercurial-scm.org">Mercurial</a> client):
zh_cn: 可以使用以下命令克隆具有njs源的<a href="https://hg.nginx.org/njs">存储库</a>：（需要<a href="https://www.mercurial-scm.org">Mercurial</a>客户端）：

source: The <code>least_time</code> method is available as a part of our <a href="https://nginx.com/products/">commercial subscription</a>.
zh_cn: 该 <code>least_time</code> 方法可作为我们的一个组成部分<a href="https://nginx.com/products/">商业订阅</a>。

source: The <code>ngx_http_auth_jwt_module</code> module (1.11.3) implements client authorization by validating the provided <a href="https://tools.ietf.org/html/rfc7519">JSON Web Token</a> (JWT) using the specified keys. JWT claims must be encoded in a <a href="https://tools.ietf.org/html/rfc7515">JSON Web Signature</a> (JWS) structure. The module can be used for <a href="https://openid.net/specs/openid-connect-core-1_0.html">OpenID Connect</a> authentication.
zh_cn: 所述 <code>ngx_http_auth_jwt_module</code> 模块通过验证所提供的（1.11.3）实现客户机授权<a href="https://tools.ietf.org/html/rfc7519">JSON网络令牌</a>使用指定键（JWT）。JWT声明必须以<a href="https://tools.ietf.org/html/rfc7515">JSON Web签名</a>（JWS）结构进行编码。该模块可用于<a href="https://openid.net/specs/openid-connect-core-1_0.html">OpenID Connect</a>身份验证。

source: The <code>ngx_http_geoip_module</code> module (0.8.6+) creates variables with values depending on the client IP address, using the precompiled <a href="https://www.maxmind.com">MaxMind</a> databases.
zh_cn: 所述 <code>ngx_http_geoip_module</code> 模块（0.8.6+）与根据客户端的IP地址值，并使用预编译创建变量<a href="https://www.maxmind.com">的MaxMind</a>数据库。

source: The <code>ngx_http_spdy_module</code> module provides experimental support for <a href="https://www.chromium.org/spdy/spdy-protocol">SPDY</a>. Currently, <a href="https://www.chromium.org/spdy/spdy-protocol/spdy-protocol-draft3-1">draft 3.1</a> of SPDY protocol is implemented.
zh_cn: 该 <code>ngx_http_spdy_module</code> 模块提供实验支持<a href="https://www.chromium.org/spdy/spdy-protocol">SPDY</a>。目前，SPDY协议<a href="https://www.chromium.org/spdy/spdy-protocol/spdy-protocol-draft3-1">草案3.1</a>已实施。

source: The <code>ngx_stream_geoip_module</code> module (1.11.3) creates variables with values depending on the client IP address, using the precompiled <a href="https://www.maxmind.com">MaxMind</a> databases.
zh_cn: 所述 <code>ngx_stream_geoip_module</code> 模块（1.11.3），依赖于客户端的IP地址值，并使用预编译创建变量<a href="https://www.maxmind.com">的MaxMind</a>数据库。

source: The <code>proxy_protocol</code> parameter (1.11.4) allows specifying that all connections accepted on this port should use the <a href="https://www.haproxy.org/download/1.5/doc/proxy-protocol.txt">PROXY protocol</a>.
zh_cn: 所述 <code>proxy_protocol</code> 参数（1.11.4）允许指定这个端口上接受的所有连接应使用<a href="https://www.haproxy.org/download/1.5/doc/proxy-protocol.txt">代理服务器协议</a>。

source: The <code>proxy_protocol</code> parameter (1.5.12) allows specifying that all connections accepted on this port should use the <a href="https://www.haproxy.org/download/1.5/doc/proxy-protocol.txt">PROXY protocol</a>.
zh_cn: 所述 <code>proxy_protocol</code> 参数（1.5.12）允许指定这个端口上接受的所有连接应使用<a href="https://www.haproxy.org/download/1.5/doc/proxy-protocol.txt">代理服务器协议</a>。

source: The <code>sync</code> parameter is available as part of our <a href="https://nginx.com/products/">commercial subscription</a>.
zh_cn: 该 <code>sync</code> 参数可作为我们的部分<a href="https://nginx.com/products/">商业订阅</a>。
