Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/nginx/nginx.*.004.xlf
Languages: es, ja, ko, ru, zh_cn

source: The following example gets a pointer to a location configuration of standard nginx core module <a href="../http/ngx_http_core_module">ngx_http_core_module</a> and replaces the location content handler kept in the <code>handler</code> field of the structure.
es: El siguiente ejemplo obtiene un puntero a una configuraci&oacute;n de ubicaci&oacute;n del m&oacute;dulo principal nginx est&aacute;ndar <a href="../http/ngx_http_core_module">ngx_http_core_module</a> y reemplaza el controlador de contenido de ubicaci&oacute;n que se mantiene en el campo del <code>handler</code> de la estructura.
ko: 다음 예제는 표준 nginx 코어 모듈 <a href="../http/ngx_http_core_module">ngx_http_core_module</a> 의 위치 구성에 대한 포인터를 가져 와서 구조 의 <code>handler</code> 필드에 보관 된 위치 컨텐츠 핸들러를 대체합니다 .

source: The following example is a body filter that inserts the string &ldquo;foo&rdquo; before each incoming buffer. The new buffers allocated by the module are reused if possible. Note that for this example to work properly, setting up a <a href="#http_header_filters">header filter</a> and resetting <code>content_length_n</code> to <code>-1</code> is also required, but the relevant code is not provided here.
es: El siguiente ejemplo es un filtro de cuerpo que inserta la cadena "foo" antes de cada b&uacute;fer entrante. Los nuevos b&uacute;feres asignados por el m&oacute;dulo se reutilizan si es posible. Tenga en cuenta que para que este ejemplo funcione correctamente, tambi&eacute;n es necesario configurar un <a href="#http_header_filters">filtro de encabezado</a> y restablecer <code>content_length_n</code> a <code>-1</code> , pero el c&oacute;digo relevante no se proporciona aqu&iacute;.
ko: 다음 예제는 각 수신 버퍼 앞에 문자열 "foo"를 삽입하는 본문 필터입니다. 모듈에서 할당 한 새 버퍼는 가능한 경우 재사용됩니다. 이 예제가 제대로 작동하려면 <a href="#http_header_filters">헤더 필터를</a> 설정하고 <code>content_length_n</code> 을 <code>-1</code> 로 재설정 해야하지만 여기에는 관련 코드가 제공되지 않습니다.

source: The following example of a header filter module adds the HTTP header "<code>X-Foo: foo</code>" to every response with status <code>200</code>.
es: El siguiente ejemplo de un m&oacute;dulo de filtro de encabezado agrega el encabezado HTTP " <code>X-Foo: foo</code> " a cada respuesta con estado <code>200</code> .
ko: 다음 헤더 필터 모듈 예제는 HTTP 헤더 " <code>X-Foo: foo</code> "를 상태 <code>200</code> 인 모든 응답에 추가합니다 .

source: The following example performs a redirect to a named location @foo.
es: El siguiente ejemplo realiza una redirección a un lugar llamado @foo.
ko: 다음 예제는 명명 된 위치 @foo로 리디렉션을 수행합니다.

source: The following example performs an internal redirect with the new request arguments.
es: El siguiente ejemplo realiza una redirección interna con los nuevos argumentos de la solicitud.
ko: 다음 예제는 새 요청 인수로 내부 경로 재 지정을 수행합니다.

source: The following example produces a complete HTTP response with "foo" as its body. For the example to work as subrequest as well as a main request, the <code>last_in_chain</code> flag is set in the last buffer of the output. The <code>last_buf</code> flag is set only for the main request because the last buffer for a subrequest does not end the entire output.
es: El siguiente ejemplo produce una respuesta HTTP completa con "foo" como cuerpo. Para que el ejemplo funcione como una solicitud <code>last_in_chain</code> y como una solicitud principal, el indicador last_in_chain se establece en el &uacute;ltimo b&uacute;fer de la salida. El indicador <code>last_buf</code> se establece solo para la solicitud principal porque el &uacute;ltimo b&uacute;fer para una subpesta no finaliza toda la salida.
ko: 다음 예제는 "foo"를 본문으로하여 완전한 HTTP 응답을 생성합니다. 예제가 기본 요청뿐만 아니라 서브 요청으로 작동하기 위해 <code>last_in_chain</code> 플래그는 출력의 마지막 버퍼에 설정됩니다. <code>last_buf</code> subrequest 대한 마지막 버퍼가 전체 출력을 종료하지 않으므로 플래그는 메인 요청에 설정된다.

source: The following example reads a client request body and returns its size.
es: El siguiente ejemplo lee el cuerpo de la solicitud de un cliente y devuelve su tamaño.
ko: 다음 예제는 클라이언트 요청 본문을 읽고 크기를 반환합니다.

source: The following example shows a filter module config file assuming for a module with just one source file, <code>ngx_http_foo_filter_module.c</code>.
es: El siguiente ejemplo muestra un archivo de configuraci&oacute;n de m&oacute;dulo de filtro asumiendo un m&oacute;dulo con un solo archivo fuente, <code>ngx_http_foo_filter_module.c</code> .
ko: 다음 예제는 소스 파일이 하나 인 모듈 <code>ngx_http_foo_filter_module.c</code> 를 가정하는 필터 모듈 구성 파일을 보여줍니다 .

source: The following example shows the minimum required settings for PHP:
es: El siguiente ejemplo muestra la configuración mínima requerida para PHP:
ko: 다음 예제는 PHP에 필요한 최소 설정을 보여줍니다.

source: The following example shows the output of running this script:
es: El siguiente ejemplo muestra el resultado de la ejecución de este guión:
ko: 다음 예제는이 스크립트를 실행 한 결과를 보여줍니다.

source: The following fields of the request determine how the request body is read:
es: Los siguientes campos de la solicitud determinan cómo se lee el cuerpo de la solicitud:
ko: 요청의 다음 필드는 요청 본문을 읽는 방법을 결정합니다.

source: The following formatting functions support nginx-specific types:
es: Las siguientes funciones de formato admiten tipos específicos de nginx:
ko: 다음 포맷팅 함수는 nginx 특정 타입을 지원합니다 :

source: The following functions convert <code>time_t</code> into the indicated broken-down time representation. The first function in each pair converts <code>time_t</code> to <code>ngx_tm_t</code> and the second (with the <code>_libc_</code> infix) to <code>struct tm</code>:
es: Las siguientes funciones convierten <code>time_t</code> en la representaci&oacute;n de tiempo desglosada indicada. La primera funci&oacute;n de cada par convierte <code>time_t</code> en <code>ngx_tm_t</code> y la segunda (con el infijo <code>_libc_</code> ) en <code>struct tm</code> :
ko: 다음 함수는 <code>time_t</code> 를 표시된 분류 시간 표시 로 변환 합니다. 각 쌍의 첫 번째 함수는 <code>time_t</code> 를 <code>ngx_tm_t</code> 로 변환 하고 두 번째 함수 ( <code>_libc_</code> 접두어 포함 )를 <code>struct tm</code> 으로 변환합니다 .

source: The following functions perform case conversion and comparison:
es: Las siguientes funciones realizan la conversión y comparación de casos:
ko: 다음 함수는 대소 문자 변환 및 비교를 수행합니다.

source: The following items can be tested in a response:
es: Los siguientes elementos pueden ser probados en una respuesta:
ko: 다음 항목을 응답으로 테스트 할 수 있습니다.

source: The following load balancing mechanisms (or methods) are supported in nginx:
es: Los siguientes mecanismos (o métodos)de equilibrio de la carga son compatibles con nginx:
ko: nginx에서는 다음과 같은 로드 밸런싱 메커니즘이 지원됩니다.

source: The following macros are available for accessing configuration for HTTP modules at runtime.
es: Las siguientes macros están disponibles para acceder a la configuración de los módulos HTTP en tiempo de ejecución.
ko: 런타임시 HTTP 모듈의 구성에 액세스하기 위해 다음 매크로를 사용할 수 있습니다.

source: The following macros are available. for accessing configuration for HTTP modules at configuration time. They all take <code>ngx_conf_t</code> reference as the first argument.
es: Est&aacute;n disponibles las siguientes macros. para acceder a la configuraci&oacute;n de los m&oacute;dulos HTTP en el momento de la configuraci&oacute;n. Todos toman la referencia <code>ngx_conf_t</code> como primer argumento.
ko: 다음과 같은 매크로를 사용할 수 있습니다. 구성시 HTTP 모듈 구성에 액세스합니다. 모두 <code>ngx_conf_t</code> 참조를 첫 번째 인수로 사용합니다.

source: The following macros simplify string initialization:
es: Las siguientes macros simplifican la inicialización de las cadenas:
ko: 다음 매크로는 문자열 초기화를 단순화합니다.

source: The following modules are typically used as references. The <code>ngx_http_copy_filter_module</code> reads the data for other filter modules and is placed near the bottom of the list so that it is one of the first to be executed. The <code>ngx_http_write_filter_module</code> writes the data to the client socket and is placed near the top of the list, and is the last to be executed.
es: Los siguientes m&oacute;dulos se utilizan normalmente como referencias. El <code>ngx_http_copy_filter_module</code> lee los datos de otros m&oacute;dulos de filtro y se coloca cerca del final de la lista para que sea uno de los primeros en ejecutarse. El <code>ngx_http_write_filter_module</code> escribe los datos en el socket del cliente y se coloca cerca de la parte superior de la lista, y es el &uacute;ltimo en ejecutarse.
ko: 다음 모듈은 일반적으로 참조로 사용됩니다. <code>ngx_http_copy_filter_module</code> 는 다른 필터 모듈에 대한 데이터를 판독하고 실행하는 최초의 하나가되도록 목록의 하단에 배치되어있다. <code>ngx_http_write_filter_module</code> 는 클라이언트 소켓에 데이터를 기록하고 목록의 상단에 배치하고, 실행하는 것이 마지막이다.

source: The following optional parameters are supported:
es: Se admiten los siguientes parámetros opcionales:
ko: 다음과 같은 선택적 매개 변수가 지원됩니다.

source: The following parameters are supported:
es: Se admiten los siguientes parámetros:
ko: 다음과 같은 매개 변수가 지원됩니다.

source: The following parameters can be configured:
es: Se pueden configurar los siguientes parámetros:
ko: 다음과 같은 매개 변수를 구성 할 수 있습니다.

source: The following parameters can be defined:
es: Se pueden definir los siguientes parámetros:
ko: 다음과 같은 파라미터를 정의 할 수 있습니다.

source: The following password types are supported:
es: Se admiten los siguientes tipos de contraseña:
ko: 다음 비밀번호 유형이 지원됩니다.

source: The following special parameters are also supported:
es: También se admiten los siguientes parámetros especiales:
ko: 다음과 같은 특수 매개 변수도 지원됩니다.

source: The following status information is provided:
es: Se proporciona la siguiente información sobre la situación:
ko: 다음과 같은 상태 정보가 제공됩니다.

source: The following two <code>#include</code> statements must appear at the beginning of every nginx file:
es: Las siguientes dos declaraciones <code>#include</code> deben aparecer al principio de cada archivo nginx:
ko: 모든 nginx 파일의 시작 부분에 다음 두 가지 <code>#include</code> 문이 나타나야합니다.

source: The following two records
es: Los siguientes dos registros
ko: 다음 두 레코드

source: The full URI of a requested link looks as follows:
es: La URI completa de un enlace solicitado tiene el siguiente aspecto:
ko: 요청 된 링크의 전체 URI는 다음과 같습니다.

source: The full list can be viewed using the &ldquo;<code>openssl ciphers</code>&rdquo; command.
es: La lista completa se puede ver usando el comando " <code>openssl ciphers</code> ".
ko: " <code>openssl ciphers</code> "명령을 사용하여 전체 목록을 볼 수 있습니다 .

source: The full list of formatting options, supported by these functions is in <code>src/core/ngx_string.c</code>. Some of them are:
es: La lista completa de opciones de formato, admitidas por estas funciones, se encuentra en <code>src/core/ngx_string.c</code> . Algunos de ellos son:
ko: 이 함수가 지원하는 전체 포맷 옵션 목록은 <code>src/core/ngx_string.c</code> 에 있습니다. 그들 중 일부는 다음과 같습니다.

source: The full redirect URL is formed according to the request scheme (<code>$scheme</code>) and the <a href="ngx_http_core_module#server_name_in_redirect">server_name_in_redirect</a> and <a href="ngx_http_core_module#port_in_redirect">port_in_redirect</a> directives.
es: La URL de redireccionamiento completo se forma de acuerdo con el esquema de solicitud ( <code>$scheme</code> ) y las directivas <a href="ngx_http_core_module#server_name_in_redirect">server_name_in_redirect</a> y <a href="ngx_http_core_module#port_in_redirect">port_in_redirect</a> .
ko: 전체 리디렉션 URL은 요청 체계 ( <code>$scheme</code> ) 및 <a href="ngx_http_core_module#server_name_in_redirect">server_name_in_redirect</a> 및 <a href="ngx_http_core_module#port_in_redirect">port_in_redirect</a> 지시문에 따라 구성됩니다.

source: The function <code>ngx_add_timer(ev, timer)</code> sets a timeout for an event, <code>ngx_del_timer(ev)</code> deletes a previously set timeout. The global timeout red-black tree <code>ngx_event_timer_rbtree</code> stores all timeouts currently set. The key in the tree is of type <code>ngx_msec_t</code> and is the time when the event occurs. The tree structure enables fast insertion and deletion operations, as well as access to the nearest timeouts, which nginx uses to find out how long to wait for I/O events and for expiring timeout events.
es: La funci&oacute;n <code>ngx_add_timer(ev, timer)</code> establece un tiempo de espera para un evento, <code>ngx_del_timer(ev)</code> elimina un tiempo de espera establecido previamente. El &aacute;rbol rojo-negro del tiempo de espera global <code>ngx_event_timer_rbtree</code> almacena todos los tiempos de espera establecidos actualmente. La clave en el &aacute;rbol es de tipo <code>ngx_msec_t</code> y es el momento en que ocurre el evento. La estructura de &aacute;rbol permite operaciones r&aacute;pidas de inserci&oacute;n y eliminaci&oacute;n, as&iacute; como el acceso a los tiempos de espera m&aacute;s cercanos, que nginx usa para averiguar cu&aacute;nto tiempo esperar para eventos de E / S y para expirar eventos de tiempo de espera.
ko: <code>ngx_add_timer(ev, timer)</code> 함수 는 이벤트에 대한 시간 초과를 설정하고 <code>ngx_del_timer(ev)</code> 는 이전에 설정된 시간 초과를 삭제합니다. 글로벌 타임 아웃 레드-블랙 트리 <code>ngx_event_timer_rbtree</code> 는 현재 설정된 모든 타임 아웃을 저장합니다. 트리의 키는 <code>ngx_msec_t</code> 유형 이며 이벤트가 발생하는 시간입니다. 트리 구조는 빠른 삽입 및 삭제 작업과 가장 가까운 타임 아웃에 대한 액세스를 가능하게합니다. nginx는 I / O 이벤트 대기 시간과 타임 아웃 이벤트 만료 시간을 알아내는 데 사용합니다.

source: The function <code>ngx_http_finalize_request(r, rc)</code> expects the following <code>rc</code> values:
es: La funci&oacute;n <code>ngx_http_finalize_request(r, rc)</code> espera los siguientes valores <code>rc</code> :
ko: <code>ngx_http_finalize_request(r, rc)</code> 함수 는 다음 <code>rc</code> 값을 예상 합니다.

source: The function <code>ngx_http_named_location(r, name)</code> redirects a request to a named location. The name of the location is passed as the argument. The location is looked up among all named locations of the current server, after which the requests switches to the <code>NGX_HTTP_REWRITE_PHASE</code> phase.
es: La funci&oacute;n <code>ngx_http_named_location(r, name)</code> redirige una solicitud a una ubicaci&oacute;n con nombre. El nombre de la ubicaci&oacute;n se pasa como argumento. La ubicaci&oacute;n se busca entre todas las ubicaciones con nombre del servidor actual, despu&eacute;s de lo cual las solicitudes cambian a la fase <code>NGX_HTTP_REWRITE_PHASE</code> .
ko: <code>ngx_http_named_location(r, name)</code> 함수 는 요청을 명명 된 위치로 리디렉션합니다. 위치 이름이 인수로 전달됩니다. 현재 서버의 이름이 지정된 모든 위치에서 위치가 조회 된 후 요청이 <code>NGX_HTTP_REWRITE_PHASE</code> 단계로 전환됩니다 .

source: The function <code>ngx_http_output_filter(r, cl)</code> invokes the body filter chain by calling the first body filter handler stored in the <code>ngx_http_top_body_filter</code> variable. It's assumed that every body handler calls the next handler in the chain until the final handler <code>ngx_http_write_filter(r, cl)</code> is called.
es: La funci&oacute;n <code>ngx_http_output_filter(r, cl)</code> invoca la cadena de filtros de cuerpo llamando al primer controlador de filtro de cuerpo almacenado en la variable <code>ngx_http_top_body_filter</code> . Se supone que cada controlador de cuerpo llama al siguiente controlador de la cadena hasta que se llama al controlador final <code>ngx_http_write_filter(r, cl)</code> .
ko: <code>ngx_http_output_filter(r, cl)</code> 함수 는 <code>ngx_http_top_body_filter</code> 변수에 저장된 첫 번째 본문 필터 핸들러를 호출하여 본문 필터 체인을 호출합니다 . 모든 핸들러가 최종 핸들러 <code>ngx_http_write_filter(r, cl)</code> 가 호출 될 때까지 체인의 다음 핸들러를 호출한다고 가정합니다 .

source: The function <code>ngx_http_read_client_request_body(r, post_handler)</code> starts the process of reading the request body. When the body is completely read, the <code>post_handler</code> callback is called to continue processing the request. If the request body is missing or has already been read, the callback is called immediately. The function <code>ngx_http_read_client_request_body(r, post_handler)</code> allocates the <code>request_body</code> request field of type <code>ngx_http_request_body_t</code>. The field <code>bufs</code> of this object keeps the result as a buffer chain. The body can be saved in memory buffers or file buffers, if the capacity specified by the <a href="../http/ngx_http_core_module#client_body_buffer_size">client_body_buffer_size</a> directive is not enough to fit the entire body in memory.
es: La funci&oacute;n <code>ngx_http_read_client_request_body(r, post_handler)</code> inicia el proceso de lectura del cuerpo de la solicitud. Cuando el cuerpo se lee por completo, se llama a la devoluci&oacute;n de llamada <code>post_handler</code> para continuar procesando la solicitud. Si falta el cuerpo de la solicitud o ya se ha le&iacute;do, se llama inmediatamente a la devoluci&oacute;n de llamada. La funci&oacute;n <code>ngx_http_read_client_request_body(r, post_handler)</code> asigna el <code>request_body</code> campo de petici&oacute;n de tipo <code>ngx_http_request_body_t</code> . El campo <code>bufs</code> de este objeto mantiene el resultado como una cadena de b&uacute;fer. El cuerpo se puede guardar en b&uacute;fer de memoria o b&uacute;fer de archivo, si la capacidad especificada por <a href="../http/ngx_http_core_module#client_body_buffer_size">client_body_buffer_size</a> directiva no es suficiente para que quepa todo el cuerpo en la memoria.
ko: <code>ngx_http_read_client_request_body(r, post_handler)</code> 함수 는 요청 본문을 읽는 프로세스를 시작합니다. 본문을 완전히 읽으면 요청 처리를 계속 <code>post_handler</code> 콜백이 호출됩니다. 요청 본문이 없거나 이미 읽은 경우 콜백이 즉시 호출됩니다. 함수 <code>ngx_http_read_client_request_body(r, post_handler)</code> 할당 <code>request_body</code> 유형의 요구 필드 <code>ngx_http_request_body_t</code> 를 . 이 객체 의 필드 <code>bufs</code> 는 결과를 버퍼 체인으로 유지합니다. <a href="../http/ngx_http_core_module#client_body_buffer_size">client_body_buffer_size에서</a> 지정한 용량 인 경우 본문을 메모리 버퍼 또는 파일 버퍼에 저장할 수 있습니다. 지시문은 몸 전체를 메모리에 맞추기에 충분하지 않습니다.

source: The function fails if <code>max_size</code> or <code>bucket_size</code> parameters are not big enough.
es: La funci&oacute;n falla si los par&aacute;metros <code>max_size</code> o <code>bucket_size</code> no son lo suficientemente grandes.
ko: <code>max_size</code> 또는 <code>bucket_size</code> 매개 변수가 충분히 크지 않으면 함수가 실패합니다 .

source: The function name in a definition starts with a new line. The function body opening and closing braces are on separate lines. The body of a function is indented. There are two empty lines between functions:
es: El nombre de la función en una definición comienza con una nueva línea.La apertura y el cierre del cuerpo de la función están en líneas separadas.El cuerpo de una función está sangrado.Hay dos líneas vacías entre las funciones:
ko: 정의의 함수 이름은 줄 바꿈으로 시작합니다. 기능 본체 개폐 괄호는 별도의 라인에 있습니다. 함수의 본문이 들여 쓰기됩니다. 함수 사이에는 두 개의 빈 줄이 있습니다.

source: The function recognizes wildcards and adds keys into the corresponding arrays. Please refer to the <a href="../http/ngx_http_map_module#map">map</a> module documentation for the description of the wildcard syntax and the matching algorithm.
es: La funci&oacute;n reconoce comodines y agrega claves en las matrices correspondientes. Consulte la documentaci&oacute;n del m&oacute;dulo de <a href="../http/ngx_http_map_module#map">mapas</a> para obtener una descripci&oacute;n de la sintaxis de comodines y el algoritmo de coincidencia.
ko: 이 함수는 와일드 카드를 인식하고 해당 배열에 키를 추가합니다. 와일드 카드 구문 및 일치 알고리즘에 대한 설명은 <a href="../http/ngx_http_map_module#map">맵</a> 모듈 설명서를 참조하십시오 .

source: The function returns NULL in case of error or a pointer to <code>ngx_http_variable_t</code> otherwise:
es: La funci&oacute;n devuelve NULL en caso de error o un puntero a <code>ngx_http_variable_t</code> en caso contrario:
ko: 이 함수는 오류가 발생하면 NULL을 반환하거나 그렇지 않으면 <code>ngx_http_variable_t</code> 에 대한 포인터를 반환 합니다.

source: The hash bucket size parameter is aligned to the size that is a multiple of the processor&rsquo;s cache line size. This speeds up key search in a hash on modern processors by reducing the number of memory accesses. If hash bucket size is equal to one processor&rsquo;s cache line size then the number of memory accesses during the key search will be two in the worst case &mdash; first to compute the bucket address, and second during the key search inside the bucket. Therefore, if nginx emits the message requesting to increase either hash max size or hash bucket size then the first parameter should first be increased.
es: El par&aacute;metro de tama&ntilde;o del cubo de hash se alinea con el tama&ntilde;o que es un m&uacute;ltiplo del tama&ntilde;o de la l&iacute;nea de cach&eacute; del procesador. Esto acelera la b&uacute;squeda de claves en un hash en los procesadores modernos al reducir el n&uacute;mero de accesos a la memoria. Si el tama&ntilde;o del dep&oacute;sito de hash es igual al tama&ntilde;o de la l&iacute;nea de cach&eacute; de un procesador, el n&uacute;mero de accesos a la memoria durante la b&uacute;squeda de claves ser&aacute; de dos en el peor de los casos: primero para calcular la direcci&oacute;n del dep&oacute;sito y segundo durante la b&uacute;squeda de claves dentro del dep&oacute;sito. Por lo tanto, si nginx emite el mensaje solicitando aumentar el tama&ntilde;o m&aacute;ximo de hash o el tama&ntilde;o del dep&oacute;sito de hash, primero se debe aumentar el primer par&aacute;metro.
ko: 해시 버킷 크기 매개 변수는 프로세서 캐시 라인 크기의 배수 인 크기에 맞춰집니다. 이는 메모리 액세스 수를 줄임으로써 최신 프로세서의 해시에서 키 검색 속도를 높입니다. 해시 버킷 크기가 하나의 프로세서 캐시 라인 크기와 같으면 키 검색 중 메모리 액세스 수는 최악의 경우 두 개가됩니다. 먼저 버킷 주소를 계산하고 두 번째는 버킷 내부의 키 검색 중입니다. 따라서 nginx가 해시 최대 크기 또는 해시 버킷 크기를 늘리도록 요청하는 메시지를 내 보내면 첫 번째 매개 변수를 먼저 늘려야합니다.

source: The hash keys are stored in <code>ngx_hash_keys_arrays_t</code> and are initialized with <code>ngx_hash_keys_array_init(arr, type)</code>: The second parameter (<code>type</code>) controls the amount of resources preallocated for the hash and can be either <code>NGX_HASH_SMALL</code> or <code>NGX_HASH_LARGE</code>. The latter is appropriate if you expect the hash to contain thousands of elements.
es: Las claves hash se almacenan en <code>ngx_hash_keys_arrays_t</code> y se inicializan con <code>ngx_hash_keys_array_init(arr, type)</code> : el segundo par&aacute;metro ( <code>type</code> ) controla la cantidad de recursos preasignados para el hash y puede ser <code>NGX_HASH_SMALL</code> o <code>NGX_HASH_LARGE</code> . Este &uacute;ltimo es apropiado si espera que el hash contenga miles de elementos.
ko: 해시 키는 <code>ngx_hash_keys_arrays_t</code> 에 저장되고 ngx_hash_keys_array_init <code>ngx_hash_keys_array_init(arr, type)</code> 으로 초기화됩니다 . 두 번째 매개 변수 ( <code>type</code> )는 해시에 사전 할당 된 자원의 양을 제어하며 <code>NGX_HASH_SMALL</code> 또는 <code>NGX_HASH_LARGE</code> 입니다. 후자는 해시에 수천 개의 요소가 포함될 것으로 예상되는 경우 적합합니다.

source: The head queue node is not linked with any data. Use the <code>ngx_queue_init(q)</code> call to initialize the list head before use. Queues support the following operations:
es: El nodo de la cola principal no est&aacute; vinculado con ning&uacute;n dato. Utilice la <code>ngx_queue_init(q)</code> para inicializar el encabezado de la lista antes de su uso. Las colas admiten las siguientes operaciones:
ko: 헤드 큐 노드가 데이터와 연결되어 있지 않습니다. 사용하기 <code>ngx_queue_init(q)</code> 호출을 사용하여 목록 헤드를 초기화하십시오. 큐는 다음 작업을 지원합니다.

source: The keys array needs to be sorted, and initialization results must be added to the combined hash. The initialization of <code>dns_wc_tail</code> array is done similarly.
es: La matriz de claves debe ordenarse y los resultados de inicializaci&oacute;n deben agregarse al hash combinado. La inicializaci&oacute;n de la matriz <code>dns_wc_tail</code> se realiza de manera similar.
ko: 키 배열을 정렬해야하며 초기화 결과를 결합 된 해시에 추가해야합니다. <code>dns_wc_tail</code> 배열 의 초기화 도 비슷하게 수행됩니다.
