Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/nginx/nginx.*.004.xlf
Languages: es, ja, ko, ru, zh_cn

source: The <code>default_server</code> parameter, if present, will cause the server to become the default server for the specified <code><i>address</i></code>:<code><i>port</i></code> pair. If none of the directives have the <code>default_server</code> parameter then the first server with the <code><i>address</i></code>:<code><i>port</i></code> pair will be the default server for this pair.
es: El par&aacute;metro <code>default_server</code> , si est&aacute; presente, har&aacute; que el servidor se convierta en el servidor predeterminado para la <code><i>address</i></code> especificada : par de <code><i>port</i></code> . Si ninguna de las directivas tiene el par&aacute;metro <code>default_server</code> , entonces el primer servidor con el par <code><i>address</i></code> : <code><i>port</i></code> ser&aacute; el servidor predeterminado para este par.
ja: <code>default_server</code> パラメータが存在する場合、サーバは、指定のデフォルト・サーバになる場合があります <code><i>address</i></code> ： <code><i>port</i></code> のペア。 <code>default_server</code> ディレクティブにもdefault_serverパラメーターがない場合、 <code><i>address</i></code> ： <code><i>port</i></code> ペアを持つ最初のサーバーがこのペアのデフォルトサーバーになります。
ko: <code>default_server</code> 의 매개 변수가 존재하는 경우, 서버는 지정의 기본 서버가 될 원인이됩니다 <code><i>address</i></code> : <code><i>port</i></code> 쌍. 지시문에 <code>default_server</code> 매개 변수 가 없으면 <code><i>address</i></code> : <code><i>port</i></code> 쌍을 가진 첫 번째 서버 가이 쌍의 기본 서버가됩니다.
ru: Параметр <code>default_server</code> , если он присутствует, приведет к тому, что сервер станет сервером по умолчанию для указанной пары <code><i>address</i></code> : <code><i>port</i></code> . Если ни одна из директив не имеет параметра <code>default_server</code> , тогда первый сервер с парой <code><i>address</i></code> : <code><i>port</i></code> будет сервером по умолчанию для этой пары.
zh_cn: 的 <code>default_server</code> 参数，如果存在的话，将导致服务器成为指定的默认服务器 <code><i>address</i></code> ： <code><i>port</i></code> 对。如果所有指令均没有 <code>default_server</code> 参数，则 <code><i>address</i></code> ： <code><i>port</i></code> pair 的第一台服务器将是该对的默认服务器。

source: The <code>delay</code> parameter (1.15.7) specifies a limit at which excessive requests become delayed. Default value is zero, i.e. all excessive requests are delayed.
es: El par&aacute;metro de <code>delay</code> (1.15.7) especifica un l&iacute;mite en el que las solicitudes excesivas se retrasan. El valor predeterminado es cero, es decir, todas las solicitudes excesivas se retrasan.
ja: <code>delay</code> パラメータ（1.15.7）は、過剰な要求が遅れるとなっ限度を指定します。デフォルト値はゼロです。つまり、すべての過剰なリクエストは遅延されます。
ko: <code>delay</code> 매개 변수 (1.15.7)는 과도한 요청이 지연 될하는 제한을 지정합니다. 기본값은 0입니다. 즉, 모든 과도한 요청이 지연됩니다.
ru: Параметр <code>delay</code> (1.15.7) указывает предел, при котором чрезмерные запросы становятся задержанными. Значение по умолчанию - ноль, т.е. все лишние запросы задерживаются.
zh_cn: 的 <code>delay</code> 参数（1.15.7），用于指定过多的请求变得延迟的限制。默认值为零，即所有多余的请求都会延迟。

source: The <code>epoch</code> parameter sets &ldquo;Expires&rdquo; to the value &ldquo;<code>Thu, 01 Jan 1970 00:00:01 GMT</code>&rdquo;, and &ldquo;Cache-Control&rdquo; to &ldquo;<code>no-cache</code>&rdquo;.
es: El par&aacute;metro <code>epoch</code> establece "Expires" en el valor " <code>Thu, 01 Jan 1970 00:00:01 GMT</code> ", y "Cache-Control" en " <code>no-cache</code> ".
ja: <code>epoch</code> パラメータセットは、「値に「有効期限」 <code>Thu, 01 Jan 1970 00:00:01 GMT</code> 「に」、そして「のCache-Control」 <code>no-cache</code> 」。
ko: <code>epoch</code> 파라미터 세트는 "값"만료 " <code>Thu, 01 Jan 1970 00:00:01 GMT</code> "을 "및"캐시 제어 " <code>no-cache</code> ".
ru: Параметр <code>epoch</code> устанавливает для &laquo;Истекает&raquo; значение &laquo; <code>Thu, 01 Jan 1970 00:00:01 GMT</code> &raquo;, а для &laquo;Cache-Control&raquo; - значение &laquo; <code>no-cache</code> &raquo;.
zh_cn: 该 <code>epoch</code> 参数设置&ldquo;过期&rdquo;值&ldquo; <code>Thu, 01 Jan 1970 00:00:01 GMT</code> &rdquo;和&ldquo;缓存&rdquo;到&ldquo; <code>no-cache</code> &rdquo;。

source: The <code>error</code> parameter also permits using a stale cached response if a FastCGI server to process a request cannot be selected.
es: El par&aacute;metro de <code>error</code> tambi&eacute;n permite usar una respuesta en cach&eacute; obsoleta si no se puede seleccionar un servidor FastCGI para procesar una solicitud.
ja: <code>error</code> 要求を処理するためにFastCGIサーバを選択することができない場合は、パラメータも古いキャッシュされた応答を使用可能にします。
ko: 또한 <code>error</code> 매개 변수는 FastCGI 서버가 요청을 처리 할 수없는 경우 오래된 캐시 된 응답 사용을 허용합니다.
ru: Параметр <code>error</code> также позволяет использовать устаревший кэшированный ответ, если сервер FastCGI для обработки запроса не может быть выбран.
zh_cn: 该 <code>error</code> 参数还允许使用旧的缓存响应如果不能选择处理请求一个FastCGI的服务器。

source: The <code>error</code> parameter also permits using a stale cached response if a proxied server to process a request cannot be selected.
es: El par&aacute;metro de <code>error</code> tambi&eacute;n permite usar una respuesta en cach&eacute; obsoleta si no se puede seleccionar un servidor proxy para procesar una solicitud.
ja: <code>error</code> 要求を処理するために、プロキシサーバーを選択することができない場合は、パラメータも古いキャッシュされた応答を使用可能にします。
ko: <code>error</code> 파라미터는 요청을 처리 할 수있는 프록시 서버가 선택 될 수없는 경우, 오래된 캐시 된 응답을 이용 가능하게한다.
ru: Параметр <code>error</code> также позволяет использовать устаревший кэшированный ответ, если прокси-сервер для обработки запроса не может быть выбран.
zh_cn: 该 <code>error</code> 参数还允许使用旧的缓存响应如果不能选择一个代理服务器处理请求。

source: The <code>error</code> parameter also permits using a stale cached response if a uwsgi server to process a request cannot be selected.
es: El par&aacute;metro de <code>error</code> tambi&eacute;n permite usar una respuesta obsoleta en cach&eacute; si no se puede seleccionar un servidor uwsgi para procesar una solicitud.
ja: <code>error</code> 要求を処理するuwsgiサーバーを選択することができない場合は、パラメータも古いキャッシュされた応答を使用可能にします。
ko: <code>error</code> 파라미터는 요청을 처리하기 uwsgi 서버가 선택 될 수없는 경우, 오래된 캐시 된 응답을 이용 가능하게한다.
ru: Параметр <code>error</code> также позволяет использовать устаревший кэшированный ответ, если сервер uwsgi для обработки запроса не может быть выбран.
zh_cn: 该 <code>error</code> 参数还允许使用旧的缓存响应如果不能选择处理请求一个uwsgi服务器。

source: The <code>error</code> parameter also permits using a stale cached response if an SCGI server to process a request cannot be selected.
es: El par&aacute;metro de <code>error</code> tambi&eacute;n permite usar una respuesta obsoleta en cach&eacute; si no se puede seleccionar un servidor SCGI para procesar una solicitud.
ja: <code>error</code> 要求を処理するSCGIサーバを選択することができない場合は、パラメータも古いキャッシュされた応答を使用可能にします。
ko: <code>error</code> 파라미터는 요청을 처리 할 SCGI 서버가 선택 될 수없는 경우, 오래된 캐시 된 응답을 이용 가능하게한다.
ru: Параметр <code>error</code> также позволяет использовать устаревший кэшированный ответ, если сервер SCGI для обработки запроса не может быть выбран.
zh_cn: 该 <code>error</code> 参数还允许使用旧的缓存响应如果不能选择处理请求的服务器SCGI。

source: The <code>escape</code> parameter (1.11.8) allows setting <code>json</code> or <code>default</code> characters escaping in variables, by default, <code>default</code> escaping is used. The <code>none</code> parameter (1.13.10) disables escaping.
es: El par&aacute;metro de <code>escape</code> (1.11.8) permite configurar <code>json</code> o caracteres de escape <code>default</code> en las variables, por defecto, se usa el escape <code>default</code> . El par&aacute;metro <code>none</code> (1.13.10) deshabilita el escape.
ja: <code>escape</code> パラメータ（1.11.8）が設定できます <code>json</code> または <code>default</code> 、デフォルトでは、変数にエスケープ文字を <code>default</code> エスケープが使用されています。 <code>none</code> パラメータ（1.13.10）がエスケープ無効にします。
ko: <code>escape</code> 매개 변수 (1.11.8)의 설정을 허용 <code>json</code> 또는 <code>default</code> , 기본적으로 변수에 이스케이프 문자를 <code>default</code> 이스케이프가 사용됩니다. <code>none</code> 매개 변수 (1.13.10)은 탈출하지 않습니다.
ru: Параметр <code>escape</code> (1.11.8) позволяет установить экранирование символов <code>json</code> или по <code>default</code> в переменных, по умолчанию <code>default</code> экранирование по умолчанию . Параметр <code>none</code> (1.13.10) отключает экранирование.
zh_cn: 的 <code>escape</code> 参数（1.11.8）允许设置 <code>json</code> 或 <code>default</code> 字符逸出变量，默认情况下， <code>default</code> 逸出被使用。在 <code>none</code> 参数（10年1月13日）禁止逃逸。

source: The <code>escape</code> parameter (1.11.8) allows setting <code>json</code> or <code>default</code> characters escaping in variables, by default, <code>default</code> escaping is used. The <code>none</code> value (1.13.10) disables escaping.
es: El par&aacute;metro de <code>escape</code> (1.11.8) permite configurar <code>json</code> o caracteres de escape <code>default</code> en las variables, por defecto, se usa el escape <code>default</code> . El valor <code>none</code> (1.13.10) inhabilita el escape.
ja: <code>escape</code> パラメータ（1.11.8）が設定できます <code>json</code> または <code>default</code> 、デフォルトでは、変数にエスケープ文字を <code>default</code> エスケープが使用されています。 <code>none</code> 値（1.13.10）がエスケープディセーブル。
ko: <code>escape</code> 매개 변수 (1.11.8)의 설정을 허용 <code>json</code> 또는 <code>default</code> , 기본적으로 변수에 이스케이프 문자를 <code>default</code> 이스케이프가 사용됩니다. <code>none</code> 값 (1.13.10)가 이탈하지 않도록.
ru: Параметр <code>escape</code> (1.11.8) позволяет установить экранирование символов <code>json</code> или по <code>default</code> в переменных, по умолчанию <code>default</code> экранирование по умолчанию . Значение <code>none</code> (1.13.10) отключает экранирование.
zh_cn: 的 <code>escape</code> 参数（1.11.8）允许设置 <code>json</code> 或 <code>default</code> 字符逸出变量，默认情况下， <code>default</code> 逸出被使用。在 <code>none</code> 值（10年1月13日）禁止逃逸。

source: The <code>flag</code> option can accept the following values:
es: La opci&oacute;n de <code>flag</code> puede aceptar los siguientes valores:
ja: <code>flag</code> オプションは、次の値を受け入れることができます。
ko: <code>flag</code> 옵션은 다음과 같은 값을 사용할 수 있습니다 :
ru: Параметр <code>flag</code> может принимать следующие значения:
zh_cn: 该 <code>flag</code> 选项可以接受以下值：

source: The <code>format</code> parameter sets the custom session log format configured by the <a href="#session_log_format">session_log_format</a> directive. If <code>format</code> is not specified, the predefined &ldquo;<code>combined</code>&rdquo; format is used.
es: El par&aacute;metro de <code>format</code> o establece el formato de registro de sesi&oacute;n personalizado configurado por la directiva <a href="#session_log_format">session_log_format</a> . Si <code>format</code> no se especifica, el &ldquo;predefinido <code>combined</code> se utiliza el formato&rdquo;.
ja: <code>format</code> パラメータは、によって構成されているカスタムセッションログ形式設定<a href="#session_log_format">session_log_formatの</a>ディレクティブを。 <code>format</code> が指定されていない場合、事前定義された「 <code>combined</code> 」形式が使用されます。
ko: <code>format</code> 매개 변수에 의해 구성된 사용자 세션 로그 형식 설정 <a href="#session_log_format">session_log_format의</a> 지시를. 경우 <code>format</code> 지정되지 않은, 미리 정의 된 " <code>combined</code> "형식이 사용됩니다.
ru: Параметр <code>format</code> устанавливает настраиваемый формат журнала сеанса, настроенный директивой <a href="#session_log_format">session_log_format</a> . Если <code>format</code> не указан, используется предопределенный &laquo; <code>combined</code> &raquo; формат.
zh_cn: 该 <code>format</code> 参数设置由配置的自定义会话日志格式<a href="#session_log_format">session_log_format</a>指令。如果 <code>format</code> 不指定，预定义的&ldquo; <code>combined</code> 使用&rdquo;的格式。

source: The <code>get</code> and <code>set</code> handlers are called to obtain or set the variable value, <code>data</code> is passed to variable handlers, and <code>index</code> holds assigned variable index used to reference the variable.
es: Los controladores <code>get</code> y <code>set</code> se llaman para obtener o establecer el valor de la variable, los <code>data</code> se pasan a los controladores de variables y el <code>index</code> contiene el &iacute;ndice de variable asignado que se utiliza para hacer referencia a la variable.
ja: <code>get</code> 及び <code>set</code> ハンドラが取得または変数の値を設定するために呼ばれ、 <code>data</code> 可変ハンドラに渡され、 <code>index</code> 変数を参照するために使用される変数のインデックスを割り当て保持します。
ko: <code>get</code> 및 <code>set</code> 핸들러를 얻거나 변수 값을 설정 불리는, <code>data</code> 변수 핸들러에 전달하고, <code>index</code> 변수를 참조하는 데 사용되는 변수 인덱스를 할당 보유하고있다.
ru: <code>get</code> и <code>set</code> обработчиков вызываются , чтобы получить или установить значение переменного, <code>data</code> передаются в переменные обработчик, и <code>index</code> трюмы присваивается переменной индекс , используемой для ссылки на переменном.
zh_cn: 的 <code>get</code> 和 <code>set</code> 处理程序调用以获取或设置变量值， <code>data</code> 被传递给可变处理程序和 <code>index</code> 保存指派用于引用变量变量索引。

source: The <code>get</code> handler is responsible for evaluating a variable in the context of a specific request, for example:
es: El controlador <code>get</code> es responsable de evaluar una variable en el contexto de una solicitud espec&iacute;fica, por ejemplo:
ja: <code>get</code> ハンドラは、例えば、特定の要求のコンテキストで変数を評価するための責任があります：
ko: <code>get</code> 핸들러는 예를 들어, 특정 요청의 컨텍스트에서 변수를 평가하는 책임이있다 :
ru: <code>get</code> обработчик отвечает за оценку переменного в контексте запроса конкретного, например:
zh_cn: 该 <code>get</code> 处理程序负责在特定请求的情况下评估的变量，例如：

source: The <code>header</code> parameter (1.13.1) allows creating a session right after receiving response headers from the upstream server.
es: El par&aacute;metro de <code>header</code> (1.13.1) permite crear una sesi&oacute;n inmediatamente despu&eacute;s de recibir los encabezados de respuesta del servidor ascendente.
ja: <code>header</code> パラメータ（1.13.1）は右上流サーバからの応答ヘッダを受信した後にセッションを作成できます。
ko: <code>header</code> 파라미터 (1.13.1)의 바로 상류 서버로부터 응답 헤더를 수신 한 후 세션을 생성 할 수 있습니다.
ru: Параметр <code>header</code> (1.13.1) позволяет создать сеанс сразу после получения заголовков ответа от вышестоящего сервера.
zh_cn: 的 <code>header</code> 参数（1.13.1）允许正确的从上游服务器接收响应标头之后创建会话。

source: The <code>http.js</code> file:
es: El archivo <code>http.js</code> :
ja: <code>http.js</code> のファイル：
ko: <code>http.js</code> 의 파일 :
ru: <code>http.js</code> файл:
zh_cn: 该 <code>http.js</code> 文件：

source: The <code>http2</code> parameter (1.9.5) configures the port to accept <a href="ngx_http_v2_module">HTTP/2</a> connections. Normally, for this to work the <code>ssl</code> parameter should be specified as well, but nginx can also be configured to accept HTTP/2 connections without SSL.
es: El par&aacute;metro <code>http2</code> (1.9.5) configura el puerto para aceptar conexiones <a href="ngx_http_v2_module">HTTP / 2</a> . Normalmente, para que esto funcione, tambi&eacute;n se debe especificar el par&aacute;metro <code>ssl</code> , pero nginx tambi&eacute;n se puede configurar para aceptar conexiones HTTP / 2 sin SSL.
ja: <code>http2</code> パラメータ（1.9.5）を受け入れるようにポートを構成する<a href="ngx_http_v2_module">HTTP / 2</a>接続を。通常、これが機能するためには、 <code>ssl</code> パラメーターも指定する必要がありますが、nginxは、SSLなしでHTTP / 2接続を受け入れるように構成することもできます。
ko: <code>http2</code> 매개 변수 (1.9.5)을 수용 할 수있는 포트 구성 <a href="ngx_http_v2_module">HTTP / 2</a> 연결을. 일반적으로 이것이 작동하려면 <code>ssl</code> 매개 변수도 지정해야하지만 SSL없이 HTTP / 2 연결을 허용하도록 nginx를 구성 할 수도 있습니다.
ru: Параметр <code>http2</code> (1.9.5) настраивает порт для приема соединений <a href="ngx_http_v2_module">HTTP / 2</a> . Обычно, чтобы это работало, также должен быть указан параметр <code>ssl</code> , но nginx также может быть настроен на прием HTTP / 2-соединений без SSL.
zh_cn: 所述 <code>http2</code> 参数（1.9.5）配置端口接受<a href="ngx_http_v2_module">HTTP / 2</a>连接。通常，要使其正常工作，还应指定 <code>ssl</code> 参数，但也可以将nginx配置为接受不带SSL的HTTP / 2连接。

source: The <code>id</code> parameter identifies the session to which a request is mapped. The <code>id</code> parameter is set to the hexadecimal representation of an MD5 hash (for example, obtained from a cookie using variables). If this parameter is not specified or does not represent the valid MD5 hash, nginx computes the MD5 hash from the value of the <code>md5</code> parameter and creates a new session using this hash. Both the <code>id</code> and <code>md5</code> parameters can contain variables.
es: El par&aacute;metro <code>id</code> identifica la sesi&oacute;n a la que se asigna una solicitud. El par&aacute;metro <code>id</code> se establece en la representaci&oacute;n hexadecimal de un hash MD5 (por ejemplo, obtenido de una cookie usando variables). Si este par&aacute;metro no se especifica o no representa el hash MD5 v&aacute;lido, nginx calcula el hash MD5 a partir del valor del par&aacute;metro <code>md5</code> y crea una nueva sesi&oacute;n con este hash. Tanto los par&aacute;metros <code>id</code> como <code>md5</code> pueden contener variables.
ja: <code>id</code> パラメータは、要求がマッピングされたセッションを識別する。 <code>id</code> パラメータ（例えば、変数を使用して、クッキーから得られた）MD5ハッシュを16進表現に設定されています。このパラメーターが指定されていないか、有効なMD5ハッシュを表していない場合、nginxは <code>md5</code> パラメーターの値からMD5ハッシュを計算し、このハッシュを使用して新しいセッションを作成します。 <code>id</code> パラメータと <code>md5</code> パラメータの両方に変数を含めることができます。
ko: <code>id</code> 파라미터는 요청이 매핑 된 세션을 식별한다. <code>id</code> 파라미터 (변수를 사용하여 쿠키로부터 획득, 예를 들어,)은 MD5 해시의 16 진수 표현으로 설정된다. 이 매개 변수를 지정하지 않거나 유효한 MD5 해시를 나타내지 않으면 nginx는 <code>md5</code> 매개 변수 의 값에서 MD5 해시를 계산 하고이 해시를 사용하여 새 세션을 만듭니다. <code>id</code> 및 <code>md5</code> 매개 변수 모두 변수를 포함 할 수 있습니다.
ru: Параметр <code>id</code> определяет сеанс, которому сопоставлен запрос. Параметр <code>id</code> установлен в шестнадцатеричное представление хэша MD5 (например, полученного из файла cookie с использованием переменных). Если этот параметр не указан или не представляет действительный хэш MD5, nginx вычисляет хеш MD5 из значения параметра <code>md5</code> и создает новый сеанс, используя этот хеш. Оба <code>id</code> и <code>md5</code> параметры могут содержать переменные.
zh_cn: 的 <code>id</code> 参数标识到其中请求被映射到的会话。的 <code>id</code> 参数设置为MD5哈希的十六进制表示（例如，从使用变量一个cookie获得）。如果未指定此参数或不代表有效的MD5哈希，则nginx从 <code>md5</code> 参数的值计算MD5哈希，并使用此哈希创建新会话。无论是 <code>id</code> 和 <code>md5</code> 参数可以包含变量。

source: The <code>if</code> parameter (1.7.0) enables conditional logging. A request will not be logged if the <code><i>condition</i></code> evaluates to &ldquo;0&rdquo; or an empty string. In the following example, the requests with response codes 2xx and 3xx will not be logged:
es: El par&aacute;metro <code>if</code> (1.7.0) habilita el registro condicional. No se registrar&aacute; una solicitud si la <code><i>condition</i></code> eval&uacute;a como "0" o una cadena vac&iacute;a. En el siguiente ejemplo, las solicitudes con los c&oacute;digos de respuesta 2xx y 3xx no se registrar&aacute;n:
ja: <code>if</code> パラメータ（1.7.0）条件付きのロギングを有効にします。 <code><i>condition</i></code> が「0」または空の文字列と評価された場合、リクエストはログに記録されません。次の例では、応答コード2xxおよび3xxのリクエストはログに記録されません。
ko: <code>if</code> 파라미터 (1.7.0)는 조건부 로깅 할 수있다. <code><i>condition</i></code> 이 "0"또는 빈 문자열로 평가 되면 요청이 기록되지 않습니다 . 다음 예에서 응답 코드가 2xx 및 3xx 인 요청은 기록되지 않습니다.
ru: Параметр <code>if</code> (1.7.0) включает условное ведение журнала. Запрос не будет зарегистрирован, если <code><i>condition</i></code> оценивается как &laquo;0&raquo; или пустая строка. В следующем примере запросы с кодами ответа 2xx и 3xx не будут регистрироваться:
zh_cn: 所述 <code>if</code> 参数（1.7.0）使条件的日志记录。如果 <code><i>condition</i></code> 评估为&ldquo; 0&rdquo;或空字符串，则不会记录请求。在以下示例中，将不会记录响应代码为2xx和3xx的请求：

source: The <code>if</code> parameter enables conditional logging. A session will not be logged if the <code><i>condition</i></code> evaluates to &ldquo;0&rdquo; or an empty string.
es: El par&aacute;metro <code>if</code> habilita el registro condicional. No se registrar&aacute; una sesi&oacute;n si la <code><i>condition</i></code> eval&uacute;a como "0" o una cadena vac&iacute;a.
ja: <code>if</code> パラメータが条件付きのログを有効にします。 <code><i>condition</i></code> が「0」または空の文字列と評価された場合、セッションはログに記録されません。
ko: <code>if</code> 매개 변수는 조건부 로깅을 할 수 있습니다. <code><i>condition</i></code> 이 "0"또는 빈 문자열로 평가 되면 세션이 기록되지 않습니다 .
ru: Параметр <code>if</code> включает условное ведение журнала. Сеанс не будет регистрироваться, если <code><i>condition</i></code> оценивается как &laquo;0&raquo; или пустая строка.
zh_cn: 该 <code>if</code> 参数允许有条件的记录。如果 <code><i>condition</i></code> 评估为&ldquo; 0&rdquo;或空字符串，则不会记录会话。

source: The <code>keepalive</code> field of an upstream server was removed in <a href="#version">version</a> 5.
es: El campo <code>keepalive</code> de un servidor ascendente se elimin&oacute; en la <a href="#version">versi&oacute;n</a> 5.
ja: アップストリームサーバーの <code>keepalive</code> フィールドは、<a href="#version">バージョン</a> 5で削除されました。
ko: 업스트림 서버 의 <code>keepalive</code> 필드는 <a href="#version">버전</a> 5 에서 제거되었습니다 .
ru: Поле <code>keepalive</code> вышестоящего сервера было удалено в <a href="#version">версии</a> 5.
zh_cn: 在<a href="#version">版本</a> 5 中删除了上游服务器的 <code>keepalive</code> 字段。

source: The <code>key</code> is a pointer to a function that creates the hash integer key from a string. There are two generic key-creation functions: <code>ngx_hash_key(data, len)</code> and <code>ngx_hash_key_lc(data, len)</code>. The latter converts a string to all lowercase characters, so the passed string must be writeable. If that is not true, pass the <code>NGX_HASH_READONLY_KEY</code> flag to the function, initializing the key array (see below).
es: La <code>key</code> es un puntero a una funci&oacute;n que crea la clave de n&uacute;mero entero hash a partir de una cadena. Hay dos funciones gen&eacute;ricas de creaci&oacute;n de claves: <code>ngx_hash_key(data, len)</code> y <code>ngx_hash_key_lc(data, len)</code> . Este &uacute;ltimo convierte una cadena en todos los caracteres en min&uacute;sculas, por lo que la cadena pasada debe poder escribirse. Si eso no es cierto, pase el indicador <code>NGX_HASH_READONLY_KEY</code> a la funci&oacute;n, inicializando la matriz de claves (ver m&aacute;s abajo).
ja: <code>key</code> 文字列からハッシュ整数キーを生成する関数へのポインタです。2つの一般的なキー作成関数があります： <code>ngx_hash_key(data, len)</code> と <code>ngx_hash_key_lc(data, len)</code> 。後者は文字列をすべて小文字に変換するため、渡された文字列は書き込み可能でなければなりません。そうでない場合は、 <code>NGX_HASH_READONLY_KEY</code> フラグを関数に渡して、キー配列を初期化します（以下を参照）。
ko: <code>key</code> 문자열에서 해시 정수 키를 생성하는 함수에 대한 포인터입니다. <code>ngx_hash_key(data, len)</code> 및 <code>ngx_hash_key_lc(data, len)</code> 두 가지 일반 키 작성 기능이 있습니다. 후자는 문자열을 모든 소문자로 변환하므로 전달 된 문자열은 쓰기 가능해야합니다. 이것이 사실이 아닌 경우, <code>NGX_HASH_READONLY_KEY</code> 플래그를 함수에 전달 하여 키 배열을 초기화하십시오 (아래 참조).
ru: <code>key</code> является указателем на функцию , которая создает хэш целочисленный ключ из строки. Есть две общие функции создания ключей: <code>ngx_hash_key(data, len)</code> и <code>ngx_hash_key_lc(data, len)</code> . Последний преобразует строку во все символы нижнего регистра, поэтому переданная строка должна быть доступной для записи. Если это не так, <code>NGX_HASH_READONLY_KEY</code> флаг NGX_HASH_READONLY_KEY функции, инициализируя массив ключей (см. Ниже).
zh_cn: 该 <code>key</code> 是指向从字符串创建哈希整数键的函数的指针。有两个通用的密钥创建函数： <code>ngx_hash_key(data, len)</code> 和 <code>ngx_hash_key_lc(data, len)</code> 。后者将字符串转换为所有小写字符，因此传递的字符串必须是可写的。如果不正确，则将 <code>NGX_HASH_READONLY_KEY</code> 标志传递给该函数，以初始化键数组（请参见下文）。

source: The <code>least_time</code> method is available as a part of our <a href="http://nginx.com/products/">commercial subscription</a>.
es: El m&eacute;todo de tiempo <code>least_time</code> est&aacute; disponible como parte de nuestra <a href="http://nginx.com/products/">suscripci&oacute;n comercial</a> .
ja: <code>least_time</code> の方法は、私たちの一部として提供され<a href="http://nginx.com/products/">、市販のサブスクリプション</a>。
ko: <code>least_time</code> 의 방법은 우리의 일환으로 볼 수 있습니다 <a href="http://nginx.com/products/">상업 가입</a> .
ru: Метод <code>least_time</code> доступен как часть нашей <a href="http://nginx.com/products/">коммерческой подписки</a> .
zh_cn: 该 <code>least_time</code> 方法可作为我们的一个组成部分<a href="http://nginx.com/products/">商业订阅</a>。
