Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/nginx/nginx.*.004.xlf
Languages: es, ja, ko, ru, zh_cn

source: The JIT is available in PCRE libraries starting from version 8.20 built with the <code>--enable-jit</code> configuration parameter. When the PCRE library is built with nginx (<code>--with-pcre=</code>), the JIT support is enabled via the <code>--with-pcre-jit</code> configuration parameter.
es: El JIT est&aacute; disponible en bibliotecas PCRE a partir de la versi&oacute;n 8.20 construida con el par&aacute;metro de configuraci&oacute;n <code>--enable-jit</code> . Cuando la biblioteca PCRE se construye con nginx ( <code>--with-pcre=</code> ), el soporte JIT se habilita a trav&eacute;s del <code>--with-pcre-jit</code> .
ja: JITは、 <code>--enable-jit</code> 構成パラメーターでビルドされたバージョン8.20以降のPCREライブラリーで使用できます。PCREライブラリがnginx（-- <code>--with-pcre=</code> ）でビルドされている場合、JITサポートは <code>--with-pcre-jit</code> 構成パラメーターを介して有効になります。
ko: JIT는 <code>--enable-jit</code> 구성 매개 변수로 빌드 된 버전 8.20부터 PCRE 라이브러리에서 사용 가능 합니다. PCRE 라이브러리가 nginx ( <code>--with-pcre=</code> ) 로 빌드 되면 <code>--with-pcre-jit</code> 구성 매개 변수 를 통해 JIT 지원이 사용 가능합니다 .
ru: JIT доступен в библиотеках PCRE, начиная с версии 8.20, созданной с параметром конфигурации <code>--enable-jit</code> . Когда библиотека PCRE собирается с помощью nginx ( <code>--with-pcre=</code> ), поддержка JIT включается с помощью параметра конфигурации <code>--with-pcre-jit</code> .
zh_cn: 在使用 <code>--enable-jit</code> 配置参数构建的8.20版本开始的PCRE库中，可以使用JIT 。当使用nginx（-- <code>--with-pcre=</code> ）构建PCRE库时，将通过 <code>--with-pcre-jit</code> 配置参数启用JIT支持。

source: The NGINX environment variable is used internally by nginx and should not be set directly by the user.
es: La variable de entorno NGINX es utilizada internamente por nginx y no debe ser establecida directamente por el usuario.
ja: NGINX 環境変数は nginx によって内部的に使用され、ユーザーが直接設定すべきではありません。
ko: NGINX 환경 변수는 nginx에 의해 내부적으로 사용되며 사용자가 직접 설정해서는 안됩니다.
ru: Переменная окружения NGINX используется внутри nginx и не должна устанавливаться непосредственно пользователем.
zh_cn: NGINX环境变量是nginx内部使用的,不应该由用户直接设置。

source: The PCRE library supports named captures using the following syntax:
es: La biblioteca PCRE soporta capturas con nombre usando la siguiente sintaxis:
ja: PCRE ライブラリは、以下の構文を使用して名前付きキャプチャをサポートしています。
ko: PCRE 라이브러리는 다음 구문을 사용하여 명명 된 캡처를 지원합니다.
ru: Библиотека PCRE поддерживает именованные захваты,используя следующий синтаксис:
zh_cn: PCRE库支持使用以下语法命名捕获。

source: The PROXY protocol must be previously enabled by setting the <code>proxy_protocol</code> parameter in the <a href="#listen">listen</a> directive.
es: El protocolo PROXY debe habilitarse previamente configurando el par&aacute;metro <code>proxy_protocol</code> en la directiva <a href="#listen">listen</a> .
ja: PROXYプロトコルは、<a href="#listen">listen</a>ディレクティブで <code>proxy_protocol</code> パラメータを設定して、事前に有効にする必要があります。
ko: <a href="#listen">청취</a> 지시문 에서 <code>proxy_protocol</code> 매개 변수를 설정하여 PROXY 프로토콜을 미리 활성화해야합니다 .
ru: Протокол PROXY должен быть предварительно включен путем установки параметра <code>proxy_protocol</code> в директиве <a href="#listen">listen</a> .
zh_cn: 必须通过在<a href="#listen">listen</a>指令中设置 <code>proxy_protocol</code> 参数来预先启用PROXY协议。

source: The PROXY protocol version 2 is supported since version 1.13.11.
es: El protocolo PROXY versión 2 está soportado desde la versión 1.13.11.
ja: PROXYプロトコルバージョン2はバージョン1.13.11からサポートされています。
ko: PROXY 프로토콜 버전 2는 버전 1.13.11부터 지원됩니다.
ru: Протокол PROXY версии 2 поддерживается с версии 1.13.11.
zh_cn: 从1.13.11版开始支持PROXY协议的第2版。

source: The SNI support status has been shown by the &ldquo;-V&rdquo; switch since 0.8.21 and 0.7.62.
es: El estado de soporte de SNI se muestra mediante el conmutador "-V" desde 0.8.21 y 0.7.62.
ja: SNIサポートステータスは、0.8.21および0.7.62以降、「-V」スイッチによって示されています。
ko: SNI 지원 상태는 0.8.21 및 0.7.62 이후&ldquo;-V&rdquo;스위치로 표시되었습니다.
ru: Статус поддержки SNI отображается переключателем &laquo;-V&raquo; с 0.8.21 и 0.7.62.
zh_cn: 从0.8.21和0.7.62开始，&ldquo;-V&rdquo;开关显示了SNI支持状态。

source: The TZ variable is always inherited and available to the <a href="http/ngx_http_perl_module">ngx_http_perl_module</a> module, unless it is configured explicitly.
es: La variable TZ siempre se hereda y est&aacute; disponible para el m&oacute;dulo <a href="http/ngx_http_perl_module">ngx_http_perl_module</a> , a menos que se configure expl&iacute;citamente.
ja: TZ変数は、明示的に構成されていない限り、常に継承され、<a href="http/ngx_http_perl_module">ngx_http_perl_module</a>モジュールで使用できます。
ko: TZ 변수는 명시 적으로 구성되지 않는 한 항상 <a href="http/ngx_http_perl_module">ngx_http_perl_module</a> 모듈에서 상속되고 사용 가능합니다 .
ru: Переменная TZ всегда наследуется и доступна модулю <a href="http/ngx_http_perl_module">ngx_http_perl_module</a> , если она не настроена явно.

source: The UDP proxy functionality is not supported.
es: La funcionalidad del proxy UDP no está soportada.
ja: UDP プロキシ機能はサポートされていません。
ko: UDP 프록시 기능은 지원되지 않습니다.
ru: Функция UDP-прокси не поддерживается.

source: The WebDAV specification only allows creating files in already existing directories. This directive allows creating all needed intermediate directories.
es: La especificación WebDAV sólo permite crear archivos en directorios ya existentes.Esta directiva permite crear todos los directorios intermedios necesarios.
ja: WebDAV 仕様では、既存のディレクトリにしかファイルを作成することができません。このディレクティブは、必要とされるすべての中間ディレクトリを作成することができます。
ko: WebDAV 스펙은 기존 디렉토리에 파일을 작성하는 것만 허용합니다. 이 지시문을 사용하면 필요한 모든 중간 디렉토리를 작성할 수 있습니다.
ru: Спецификация WebDAV позволяет создавать файлы только в уже существующих каталогах.Эта директива позволяет создавать все необходимые промежуточные директории.

source: The WebP format support appeared in version 1.11.6. To transform images in this format, the <code>libgd</code> library must be compiled with the WebP support.
es: El soporte del formato WebP apareci&oacute; en la versi&oacute;n 1.11.6. Para transformar im&aacute;genes en este formato, la biblioteca <code>libgd</code> debe compilarse con el soporte WebP.
ja: WebP形式のサポートはバージョン1.11.6で登場しました。この形式で画像を変換するには、 <code>libgd</code> ライブラリをWebPサポート付きでコンパイルする必要があります。
ko: WebP 형식 지원은 버전 1.11.6에 나타났습니다. 이 형식으로 이미지를 변환하려면 <code>libgd</code> 라이브러리가 WebP 지원으로 컴파일되어야합니다.
ru: Поддержка формата WebP появилась в версии 1.11.6. Чтобы преобразовать изображения в этот формат, библиотека <code>libgd</code> должна быть скомпилирована с поддержкой WebP.

source: The XML output can be transformed using the <a href="ngx_http_xslt_module">ngx_http_xslt_module</a> module.
es: La salida XML se puede transformar utilizando el m&oacute;dulo <a href="ngx_http_xslt_module">ngx_http_xslt_module</a> .
ja: XML出力は、<a href="ngx_http_xslt_module">ngx_http_xslt_module</a>モジュールを使用して変換できます。
ko: <a href="ngx_http_xslt_module">ngx_http_xslt_module</a> 모듈을 사용하여 XML 출력을 변환 할 수 있습니다 .
ru: Вывод XML можно преобразовать с помощью модуля <a href="ngx_http_xslt_module">ngx_http_xslt_module</a> .

source: The above examples are for an <a href="ngx_http_upstream_module">http</a> upstream server group. Similar examples for a <a href="../stream/ngx_stream_upstream_module">stream</a> upstream server group require the &ldquo;<code>stream=</code>&rdquo; parameter.
es: Los ejemplos anteriores son para un grupo de servidores ascendentes <a href="ngx_http_upstream_module">http</a> . Ejemplos similares para un grupo de servidores de <a href="../stream/ngx_stream_upstream_module">flujo</a> ascendente requieren el par&aacute;metro " <code>stream=</code> ".
ja: 上記の例は、<a href="ngx_http_upstream_module">http</a>アップストリームサーバーグループ用です。<a href="../stream/ngx_stream_upstream_module">ストリーム</a>アップストリームサーバーグループの同様の例では、「 <code>stream=</code> 」パラメーターが必要です。
ko: 위의 예는 <a href="ngx_http_upstream_module">http</a> 업스트림 서버 그룹에 대한 것입니다. <a href="../stream/ngx_stream_upstream_module">스트림</a> 업스트림 서버 그룹의 유사한 예 에는 " <code>stream=</code> "매개 변수가 필요합니다 .
ru: Приведенные выше примеры относятся к группе вышестоящих серверов <a href="ngx_http_upstream_module">http</a> . Подобные примеры для группы восходящих <a href="../stream/ngx_stream_upstream_module">потоковых</a> серверов требуют параметра &laquo; <code>stream=</code> &raquo;.

source: The above rules also apply to sub-expressions, where each sub-expression has its own indentation level:
es: Las reglas anteriores también se aplican a las subexpresiones,en las que cada subexpresión tiene su propio nivel de indentación:
ja: 上記の規則は、各部分式が独自のインデントレベルを持つ部分式にも適用されます。
ko: 위의 규칙은 하위 표현식에도 적용되며, 각 하위 표현식에는 고유 한 들여 쓰기 수준이 있습니다.
ru: Вышеуказанные правила применяются также к подвыражениям,где каждое подвыражение имеет свой уровень отступов:

source: The actual items are stored in list parts, which are defined as follows:
es: Los artículos reales se almacenan en partes de la lista,que se definen de la siguiente manera:
ja: 実際の項目はリストパーツに格納されており、以下のように定義されています。
ko: 실제 항목은 목록 파트에 저장되며 다음과 같이 정의됩니다.
ru: Фактические элементы хранятся в списках,которые определяются следующим образом:

source: The address can also be specified using variables (1.11.3):
es: La dirección también puede especificarse utilizando variables (1.11.3):
ja: アドレスは変数を使って指定することもできます(1.11.3)。
ko: 주소는 변수 (1.11.3)를 사용하여 지정할 수도 있습니다.
ru: Адрес можно также указать с помощью переменных (1.11.3):

source: The address of the server that accepted status request.
es: La dirección del servidor que aceptó la solicitud de estado.
ja: ステータス要求を受け付けたサーバのアドレス。
ko: 상태 요청을 수락 한 서버의 주소입니다.
ru: Адрес сервера,принявшего запрос о статусе.

source: The arguments to <code>ngx_regex_exec()</code> are the compiled regular expression <code>re</code>, the string to match <code>s</code>, an optional array of integers to hold any <code>captures</code> that are found, and the array's <code>size</code>. The size of the <code>captures</code> array must be a multiple of three, as required by the <a href="http://www.pcre.org/original/doc/html/pcreapi.html">PCRE API</a>. In the example, the size is calculated from the total number of captures plus <code>1</code>one for the matched string itself.
es: Los argumentos de <code>ngx_regex_exec()</code> son la expresi&oacute;n regular compilada <code>re</code> , la cadena para coincidir con <code>s</code> , una matriz opcional de enteros para contener las <code>captures</code> que se encuentran y el <code>size</code> la matriz . El tama&ntilde;o de la matriz de <code>captures</code> debe ser m&uacute;ltiplo de tres, como lo requiere la <a href="http://www.pcre.org/original/doc/html/pcreapi.html">API de PCRE</a> . En el ejemplo, el tama&ntilde;o se calcula a partir del n&uacute;mero total de capturas m&aacute;s <code>1</code> para la cadena coincidente.
ja: <code>ngx_regex_exec()</code> の引数は、コンパイルされた正規表現 <code>re</code> 、一致する文字列 <code>s</code> 、見つかった <code>captures</code> を保持する整数のオプションの配列、および配列の <code>size</code> です。<a href="http://www.pcre.org/original/doc/html/pcreapi.html">PCRE APIで</a>必要とされるように、 <code>captures</code> 配列のサイズは3の倍数でなければなりません。この例では、サイズは、キャプチャの総数に、一致した文字列自体の <code>1</code> を加えたものから計算されます。
ko: <code>ngx_regex_exec()</code> 에 대한 인수 는 컴파일 된 정규 표현식 <code>re</code> , <code>s</code> 와 일치하는 문자열 , 발견 된 <code>captures</code> 를 보유 할 선택적 정수 배열 및 배열의 <code>size</code> 입니다. <code>captures</code> 배열 의 크기 는 <a href="http://www.pcre.org/original/doc/html/pcreapi.html">PCRE API에</a> 필요한대로 3의 배수 여야합니다 . 이 예에서 크기는 총 캡처 수에 일치하는 문자열 자체에 대해 <code>1</code> 을 더한 값에서 계산 됩니다.
ru: Аргументами для <code>ngx_regex_exec()</code> являются скомпилированное регулярное выражение <code>re</code> , строка для сопоставления <code>s</code> , необязательный массив целых чисел для хранения любых найденных <code>captures</code> и <code>size</code> массива . Размер массива <code>captures</code> должен быть кратен трем, как того требует <a href="http://www.pcre.org/original/doc/html/pcreapi.html">PCRE API</a> . В этом примере размер рассчитывается из общего количества захватов плюс <code>1</code> для самой совпадающей строки.

source: The authenticity of a requested link is verified by comparing the checksum value passed in a request with the value computed for the request. If a link has a limited lifetime and the time has expired, the link is considered outdated. The status of these checks is made available in the <code>$secure_link</code> variable.
es: La autenticidad de un enlace solicitado se verifica comparando el valor de suma de comprobaci&oacute;n pasado en una solicitud con el valor calculado para la solicitud. Si un enlace tiene una vida &uacute;til limitada y el tiempo ha expirado, el enlace se considera obsoleto. El estado de estos controles est&aacute; disponible en la variable <code>$secure_link</code> .
ja: 要求されたリンクの信頼性は、要求で渡されたチェックサム値を、要求に対して計算された値と比較することによって検証されます。リンクのライフタイムに制限があり、時間が経過した場合、リンクは古くなっていると見なされます。これらのチェックのステータスは、 <code>$secure_link</code> 変数で利用可能になります。
ko: 요청 된 링크의 신뢰성은 요청에 전달 된 체크섬 값과 요청에 대해 계산 된 값을 비교하여 확인됩니다. 링크 수명이 제한되어 있고 시간이 만료 된 경우 링크가 오래된 것으로 간주됩니다. 이러한 점검의 상태는 <code>$secure_link</code> 변수 에서 사용 가능 합니다.
ru: Подлинность запрошенной ссылки проверяется путем сравнения значения контрольной суммы, переданного в запросе, со значением, вычисленным для запроса. Если ссылка имеет ограниченное время жизни и время истекло, ссылка считается устаревшей. Статус этих проверок доступен в переменной <code>$secure_link</code> .

source: The available string representations are:
es: Las representaciones de cuerda disponibles son:
ja: 利用可能な文字列表現は以下の通りです。
ko: 사용 가능한 문자열 표현은 다음과 같습니다.
ru: Доступны строковые представления:

source: The average time to connect to the upstream server.
es: El tiempo medio de conexión al servidor de subida.
ja: 上流のサーバーに接続するまでの平均時間。
ko: 업스트림 서버에 연결하는 평균 시간입니다.
ru: Среднее время подключения к восходящему серверу.

source: The average time to connect to the upstream server. Prior to version 1.11.6, the field was available only when using the <a href="../stream/ngx_stream_upstream_module#least_time">least_time</a> load balancing method.
es: El tiempo promedio para conectarse al servidor ascendente. Antes de la versi&oacute;n 1.11.6, el campo solo estaba disponible cuando se usaba el m&eacute;todo de equilibrio de carga de tiempo <a href="../stream/ngx_stream_upstream_module#least_time">m&iacute;nimo</a> .
ja: アップストリームサーバーに接続するための平均時間。バージョン1.11.6より前は、このフィールドは<a href="../stream/ngx_stream_upstream_module#least_time">least_time</a>ロードバランシング方式を使用する場合にのみ使用できました。
ko: 업스트림 서버에 연결하는 평균 시간입니다. 버전 1.11.6 이전에는이 ​​필드는 <a href="../stream/ngx_stream_upstream_module#least_time">최소 시간</a> 로드 밸런싱 방법을 사용하는 경우에만 사용 가능했습니다 .
ru: Среднее время подключения к вышестоящему серверу. До версии 1.11.6 это поле было доступно только при использовании <a href="../stream/ngx_stream_upstream_module#least_time">метода</a> балансировки нагрузки less_time .

source: The average time to get the <a href="ngx_http_upstream_module#var_upstream_header_time">response header</a> from the server (1.7.10). Prior to version 1.11.6, the field was available only when using the <a href="ngx_http_upstream_module#least_time">least_time</a> load balancing method.
es: El tiempo promedio para obtener el <a href="ngx_http_upstream_module#var_upstream_header_time">encabezado de respuesta</a> del servidor (1.7.10). Antes de la versi&oacute;n 1.11.6, el campo solo estaba disponible cuando se usaba el m&eacute;todo de equilibrio de carga de tiempo <a href="ngx_http_upstream_module#least_time">m&iacute;nimo</a> .
ja: サーバーから<a href="ngx_http_upstream_module#var_upstream_header_time">応答ヘッダー</a>を取得する平均時間（1.7.10）。バージョン1.11.6より前は、このフィールドは<a href="ngx_http_upstream_module#least_time">least_time</a>ロードバランシング方式を使用する場合にのみ使用できました。
ko: 서버에서 <a href="ngx_http_upstream_module#var_upstream_header_time">응답 헤더</a> 를 가져 오는 데 걸리는 평균 시간 (1.7.10) 버전 1.11.6 이전에는이 ​​필드는 <a href="ngx_http_upstream_module#least_time">최소 시간</a> 로드 밸런싱 방법을 사용하는 경우에만 사용 가능했습니다 .
ru: Среднее время получения <a href="ngx_http_upstream_module#var_upstream_header_time">заголовка ответа</a> от сервера (1.7.10). До версии 1.11.6 это поле было доступно только при использовании <a href="ngx_http_upstream_module#least_time">метода</a> балансировки нагрузки less_time .

source: The average time to get the <a href="ngx_http_upstream_module#var_upstream_header_time">response header</a> from the server.
es: El tiempo promedio para obtener el <a href="ngx_http_upstream_module#var_upstream_header_time">encabezado de respuesta</a> del servidor.
ja: サーバーから<a href="ngx_http_upstream_module#var_upstream_header_time">応答ヘッダー</a>を取得する平均時間。
ko: 서버에서 <a href="ngx_http_upstream_module#var_upstream_header_time">응답 헤더</a> 를 가져 오는 데 걸리는 평균 시간 입니다.
ru: Среднее время получения <a href="ngx_http_upstream_module#var_upstream_header_time">заголовка ответа</a> от сервера.

source: The average time to get the <a href="ngx_http_upstream_module#var_upstream_response_time">full response</a> from the server (1.7.10). Prior to version 1.11.6, the field was available only when using the <a href="ngx_http_upstream_module#least_time">least_time</a> load balancing method.
es: El tiempo promedio para obtener la <a href="ngx_http_upstream_module#var_upstream_response_time">respuesta completa</a> del servidor (1.7.10). Antes de la versi&oacute;n 1.11.6, el campo solo estaba disponible cuando se usaba el m&eacute;todo de equilibrio de carga de tiempo <a href="ngx_http_upstream_module#least_time">m&iacute;nimo</a> .
ja: サーバーから<a href="ngx_http_upstream_module#var_upstream_response_time">完全な応答</a>を取得するための平均時間（1.7.10）。バージョン1.11.6より前は、このフィールドは<a href="ngx_http_upstream_module#least_time">least_time</a>ロードバランシング方式を使用する場合にのみ使用できました。
ko: 서버에서 <a href="ngx_http_upstream_module#var_upstream_response_time">전체 응답</a> 을 얻는 데 걸린 평균 시간 (1.7.10). 버전 1.11.6 이전에는이 ​​필드는 <a href="ngx_http_upstream_module#least_time">최소 시간</a> 로드 밸런싱 방법을 사용하는 경우에만 사용 가능했습니다 .
ru: Среднее время получения <a href="ngx_http_upstream_module#var_upstream_response_time">полного ответа</a> от сервера (1.7.10). До версии 1.11.6 это поле было доступно только при использовании <a href="ngx_http_upstream_module#least_time">метода</a> балансировки нагрузки less_time .

source: The average time to get the <a href="ngx_http_upstream_module#var_upstream_response_time">full response</a> from the server.
es: El tiempo promedio para obtener la <a href="ngx_http_upstream_module#var_upstream_response_time">respuesta completa</a> del servidor.
ja: サーバーから<a href="ngx_http_upstream_module#var_upstream_response_time">完全な応答</a>を取得するための平均時間。
ko: 서버에서 <a href="ngx_http_upstream_module#var_upstream_response_time">전체 응답</a> 을 얻는 데 걸리는 평균 시간 입니다.
ru: Среднее время получения <a href="ngx_http_upstream_module#var_upstream_response_time">полного ответа</a> от сервера.

source: The average time to receive the first byte of data.
es: El tiempo promedio para recibir el primer byte de datos.
ja: 1バイト目のデータを受信するまでの平均時間。
ko: 데이터의 첫 바이트를받는 평균 시간입니다.
ru: Среднее время получения первого байта данных.

source: The average time to receive the first byte of data. Prior to version 1.11.6, the field was available only when using the <a href="../stream/ngx_stream_upstream_module#least_time">least_time</a> load balancing method.
es: El tiempo promedio para recibir el primer byte de datos. Antes de la versi&oacute;n 1.11.6, el campo solo estaba disponible cuando se usaba el m&eacute;todo de equilibrio de carga de tiempo <a href="../stream/ngx_stream_upstream_module#least_time">m&iacute;nimo</a> .
ja: データの最初のバイトを受信する平均時間。バージョン1.11.6より前は、このフィールドは<a href="../stream/ngx_stream_upstream_module#least_time">least_time</a>ロードバランシング方式を使用する場合にのみ使用できました。
ko: 데이터의 첫 바이트를받는 평균 시간입니다. 버전 1.11.6 이전에는이 ​​필드는 <a href="../stream/ngx_stream_upstream_module#least_time">최소 시간</a> 로드 밸런싱 방법을 사용하는 경우에만 사용 가능했습니다 .
ru: Среднее время получения первого байта данных. До версии 1.11.6 это поле было доступно только при использовании <a href="../stream/ngx_stream_upstream_module#least_time">метода</a> балансировки нагрузки less_time .

source: The average time to receive the last byte of data.
es: El tiempo promedio para recibir el último byte de datos.
ja: データの最後のバイトを受信する平均時間。
ko: 데이터의 마지막 바이트를받는 평균 시간입니다.
ru: Среднее время получения последнего байта данных.

source: The average time to receive the last byte of data. Prior to version 1.11.6, the field was available only when using the <a href="../stream/ngx_stream_upstream_module#least_time">least_time</a> load balancing method.
es: El tiempo promedio para recibir el &uacute;ltimo byte de datos. Antes de la versi&oacute;n 1.11.6, el campo solo estaba disponible cuando se usaba el m&eacute;todo de equilibrio de carga de tiempo <a href="../stream/ngx_stream_upstream_module#least_time">m&iacute;nimo</a> .
ja: データの最後のバイトを受信する平均時間。バージョン1.11.6より前は、このフィールドは<a href="../stream/ngx_stream_upstream_module#least_time">least_time</a>ロードバランシング方式を使用する場合にのみ使用できました。
ko: 데이터의 마지막 바이트를받는 평균 시간입니다. 버전 1.11.6 이전에는이 ​​필드는 <a href="../stream/ngx_stream_upstream_module#least_time">최소 시간</a> 로드 밸런싱 방법을 사용하는 경우에만 사용 가능했습니다 .
ru: Среднее время получения последнего байта данных. До версии 1.11.6 это поле было доступно только при использовании <a href="../stream/ngx_stream_upstream_module#least_time">метода</a> балансировки нагрузки less_time .

source: The basic status information will be accessible from the surrounding location.
es: La información básica sobre el estado será accesible desde el lugar que lo rodea.
ja: 基本的なステータス情報は、周辺の場所からアクセスできるようになります。
ko: 기본 상태 정보는 주변 위치에서 액세스 할 수 있습니다.
ru: Основная информация о состоянии будет доступна из близлежащих окрестностей.

source: The buffer size must not exceed the size of an atomic write to a disk file. For FreeBSD this size is unlimited.
es: El tamaño de la memoria intermedia no debe exceder el tamaño de una escritura atómica en un archivo de disco.Para FreeBSD este tamaño es ilimitado.
ja: バッファサイズは、ディスクファイルへのアトミックライトのサイズを超えてはなりません。FreeBSD ではこのサイズは無制限です。
ko: 버퍼 크기는 디스크 파일에 대한 원자 쓰기 크기를 초과해서는 안됩니다. FreeBSD의 경우이 크기는 무제한입니다.
ru: Размер буфера не должен превышать размер атомарной записи в дисковый файл.Для FreeBSD этот размер неограничен.

source: The build is configured using the <code>configure</code> command. It defines various aspects of the system, including the methods nginx is allowed to use for connection processing. At the end it creates a <code>Makefile</code>.
es: La compilaci&oacute;n se configura mediante el comando <code>configure</code> . Define varios aspectos del sistema, incluidos los m&eacute;todos que nginx puede utilizar para el procesamiento de conexiones. Al final crea un <code>Makefile</code> .
ja: ビルドは、 <code>configure</code> コマンドを使用して構成されます。 nginxが接続処理に使用できるメソッドを含む、システムのさまざまな側面を定義します。最後に <code>Makefile</code> を作成します。
ko: 빌드는 <code>configure</code> 명령을 사용하여 구성 됩니다. nginx가 연결 처리에 사용할 수있는 방법을 포함하여 시스템의 다양한 측면을 정의합니다. 마지막에 <code>Makefile</code> 을 만듭니다 .
ru: Сборка настраивается с помощью команды <code>configure</code> . Он определяет различные аспекты системы, включая методы, которые nginx может использовать для обработки соединения. В конце он создает <code>Makefile</code> .
