Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/nginx/nginx.*.004.xlf
Languages: es, ja, ko, ru, zh_cn

source: The <code>src/core/ngx_thread_pool.h</code> header file contains relevant definitions:
es: El archivo de encabezado <code>src/core/ngx_thread_pool.h</code> contiene definiciones relevantes:
ja: <code>src/core/ngx_thread_pool.h</code> ヘッダファイルは、関連する定義が含まれています。
ko: <code>src/core/ngx_thread_pool.h</code> 헤더 파일 관련 정의가 포함되어 있습니다 :
ru: <code>src/core/ngx_thread_pool.h</code> заголовочный файл содержит соответствующие определения:
zh_cn: 在 <code>src/core/ngx_thread_pool.h</code> 头文件包含的相关定义：

source: The <code>ssl</code> parameter (0.7.14) allows specifying that all connections accepted on this port should work in SSL mode. This allows for a more compact <a href="configuring_https_servers#single_http_https_server">configuration</a> for the server that handles both HTTP and HTTPS requests.
es: El par&aacute;metro <code>ssl</code> (0.7.14) permite especificar que todas las conexiones aceptadas en este puerto deben funcionar en modo SSL. Esto permite una <a href="configuring_https_servers#single_http_https_server">configuraci&oacute;n</a> m&aacute;s compacta para el servidor que maneja solicitudes HTTP y HTTPS.
ja: <code>ssl</code> パラメータ（0.7.14）は、このポートで受け入れすべての接続がSSLモードで動作するように指定できます。これにより、HTTP要求とHTTPS要求の両方を処理するサーバーの<a href="configuring_https_servers#single_http_https_server">構成</a>がよりコンパクトになります。
ko: <code>ssl</code> 매개 변수 (0.7.14)을하면이 포트에 모든 연결이 SSL 모드에서 작동하도록 지정 할 수 있습니다. 이를 통해 HTTP 및 HTTPS 요청을 모두 처리하는 서버에 대해 보다 컴팩트 한 <a href="configuring_https_servers#single_http_https_server">구성</a> 이 가능 합니다.
ru: Параметр <code>ssl</code> (0.7.14) позволяет указать, что все соединения, принимаемые через этот порт, должны работать в режиме SSL. Это позволяет получить более компактную <a href="configuring_https_servers#single_http_https_server">конфигурацию</a> сервера, который обрабатывает запросы HTTP и HTTPS.
zh_cn: 该 <code>ssl</code> 参数（0.7.14）允许指定此端口上接受所有的连接应在SSL模式下工作。这样可以为处理HTTP和HTTPS请求的服务器提供更紧凑的<a href="configuring_https_servers#single_http_https_server">配置</a>。

source: The <code>ssl</code> parameter allows specifying that all connections accepted on this port should work in SSL mode.
es: El par&aacute;metro <code>ssl</code> permite especificar que todas las conexiones aceptadas en este puerto deben funcionar en modo SSL.
ja: <code>ssl</code> パラメータは、このポートで受け入れすべての接続がSSLモードで動作するように指定できます。
ko: <code>ssl</code> 매개 변수는이 포트에서 받아 모든 연결이 SSL 모드에서 작동하도록 지정 할 수 있습니다.
ru: Параметр <code>ssl</code> позволяет указать, что все соединения, принимаемые на этом порту, должны работать в режиме SSL.
zh_cn: 该 <code>ssl</code> 参数允许指定此端口上接受所有的连接应在SSL模式下工作。

source: The <code>ssl</code> parameter of the <a href="ngx_http_core_module#listen">listen</a> directive has been supported since 0.7.14. Prior to 0.8.21 it could only be specified along with the <code>default</code> parameter.
es: El par&aacute;metro <code>ssl</code> de la directiva <a href="ngx_http_core_module#listen">listen</a> se admite desde 0.7.14. Antes de 0.8.21, solo se pod&iacute;a especificar junto con el par&aacute;metro <code>default</code> .
ja: <a href="ngx_http_core_module#listen">listen</a>ディレクティブの <code>ssl</code> パラメーターは0.7.14以降サポートされています。0.8.21より前は、 <code>default</code> パラメーターと一緒にしか指定できませんでした。
ko: <a href="ngx_http_core_module#listen">listen</a> 지시문 의 <code>ssl</code> 매개 변수는 0.7.14부터 지원되었습니다. 0.8.21 이전에는 <code>default</code> 매개 변수 와 함께 만 지정할 수있었습니다 .
ru: <code>ssl</code> параметр <a href="ngx_http_core_module#listen">слушать</a> директива была поддержана так 0.7.14. До 0.8.21 его можно было указать только вместе с параметром по <code>default</code> .
zh_cn: 从0.7.14开始，一直支持<a href="ngx_http_core_module#listen">listen</a>指令的 <code>ssl</code> 参数。在0.8.21之前，只能与 <code>default</code> 参数一起指定。

source: The <code>stream.js</code> file:
es: El archivo <code>stream.js</code> :
ja: <code>stream.js</code> ファイル：
ko: <code>stream.js</code> 파일 :
ru: <code>stream.js</code> файл:
zh_cn: 该 <code>stream.js</code> 文件：

source: The <code>sync</code> parameter (1.13.8) enables <a href="../stream/ngx_stream_zone_sync_module#zone_sync">synchronization</a> of the shared memory zone.
es: El par&aacute;metro de <code>sync</code> (1.13.8) habilita la <a href="../stream/ngx_stream_zone_sync_module#zone_sync">sincronizaci&oacute;n</a> de la zona de memoria compartida.
ja: <code>sync</code> パラメータ（1.13.8）が可能と<a href="../stream/ngx_stream_zone_sync_module#zone_sync">同期</a>共有メモリ・ゾーンのを。
ko: <code>sync</code> 파라미터 (1.13.8)을 가능하게 <a href="../stream/ngx_stream_zone_sync_module#zone_sync">동기화</a> 공유 메모리 영역을.
ru: Параметр <code>sync</code> (1.13.8) включает <a href="../stream/ngx_stream_zone_sync_module#zone_sync">синхронизацию</a> зоны разделяемой памяти.
zh_cn: 的 <code>sync</code> 参数（1.13.8）使<a href="../stream/ngx_stream_zone_sync_module#zone_sync">同步</a>共享存储器区。

source: The <code>sync</code> parameter (1.15.3) enables <a href="../stream/ngx_stream_zone_sync_module#zone_sync">synchronization</a> of the shared memory zone.
es: El par&aacute;metro de <code>sync</code> (1.15.3) habilita la <a href="../stream/ngx_stream_zone_sync_module#zone_sync">sincronizaci&oacute;n</a> de la zona de memoria compartida.
ja: <code>sync</code> パラメータ（1.15.3）が可能と<a href="../stream/ngx_stream_zone_sync_module#zone_sync">同期</a>共有メモリ・ゾーンのを。
ko: <code>sync</code> 파라미터 (1.15.3)을 가능하게 <a href="../stream/ngx_stream_zone_sync_module#zone_sync">동기화</a> 공유 메모리 영역을.
ru: Параметр <code>sync</code> (1.15.3) включает <a href="../stream/ngx_stream_zone_sync_module#zone_sync">синхронизацию</a> зоны разделяемой памяти.
zh_cn: 的 <code>sync</code> 参数（1.15.3）使<a href="../stream/ngx_stream_zone_sync_module#zone_sync">同步</a>共享存储器区。

source: The <code>sync</code> parameter is available as part of our <a href="http://nginx.com/products/">commercial subscription</a>.
es: El par&aacute;metro de <code>sync</code> est&aacute; disponible como parte de nuestra <a href="http://nginx.com/products/">suscripci&oacute;n comercial</a> .
ja: <code>sync</code> パラメータは、私たちの一部として提供され<a href="http://nginx.com/products/">、市販のサブスクリプション</a>。
ko: <code>sync</code> 매개 변수는 우리의 일환으로 볼 수 있습니다 <a href="http://nginx.com/products/">상업 가입</a> .
ru: Параметр <code>sync</code> доступен в рамках нашей <a href="http://nginx.com/products/">коммерческой подписки</a> .
zh_cn: 该 <code>sync</code> 参数可作为我们的部分<a href="http://nginx.com/products/">商业订阅</a>。

source: The <code>threads</code> parameter defines the number of threads in the pool.
es: El par&aacute;metro de <code>threads</code> define el n&uacute;mero de subprocesos en el grupo.
ja: <code>threads</code> パラメータは、プール内のスレッドの数を定義します。
ko: <code>threads</code> 매개 변수는 풀의 스레드 수를 정의합니다.
ru: Параметр <code>threads</code> определяет количество потоков в пуле.
zh_cn: 该 <code>threads</code> 参数定义池中的线程数。

source: The <code>transparent</code> parameter (1.11.0) allows outgoing connections to a FastCGI server originate from a non-local IP address, for example, from a real IP address of a client:
es: El par&aacute;metro <code>transparent</code> e (1.11.0) permite que las conexiones salientes a un servidor FastCGI se originen desde una direcci&oacute;n IP no local, por ejemplo, desde una direcci&oacute;n IP real de un cliente:
ja: <code>transparent</code> パラメータ（1.11.0）は、FastCGIのサーバへの発信接続は、クライアントの実際のIPアドレスから、例えば、非ローカルIPアドレスから発信できます。
ko: <code>transparent</code> 매개 변수 (1.11.0)는 FastCGI를 서버로 나가는 연결 클라이언트의 실제 IP 주소, 예를 들어, 로컬이 아닌 IP 주소에서 발생 할 수 있습니다 :
ru: Параметр <code>transparent</code> (1.11.0) разрешает исходящие подключения к серверу FastCGI с нелокального IP-адреса, например, с реального IP-адреса клиента:
zh_cn: 所述 <code>transparent</code> 参数（1.11.0）允许一个FastCGI的服务器传出连接从一个非本地的IP地址发起，例如，来自客户端的实际IP地址：

source: The <code>transparent</code> parameter (1.11.0) allows outgoing connections to a memcached server originate from a non-local IP address, for example, from a real IP address of a client:
es: El par&aacute;metro <code>transparent</code> e (1.11.0) permite que las conexiones salientes a un servidor memcached se originen desde una direcci&oacute;n IP no local, por ejemplo, desde una direcci&oacute;n IP real de un cliente:
ja: <code>transparent</code> パラメータ（1.11.0）は、memcachedサーバへの発信接続は、クライアントの実際のIPアドレスから、例えば、非ローカルIPアドレスから発信できます。
ko: <code>transparent</code> 매개 변수 (1.11.0)는 memcached를 서버로 나가는 연결 클라이언트의 실제 IP 주소, 예를 들어, 로컬이 아닌 IP 주소에서 발생 할 수 있습니다 :
ru: Параметр <code>transparent</code> (1.11.0) разрешает исходящие подключения к серверу memcached с нелокального IP-адреса, например, с реального IP-адреса клиента:
zh_cn: 所述 <code>transparent</code> 参数（1.11.0）允许分布式缓存服务器传出连接从一个非本地的IP地址发起，例如，来自客户端的实际IP地址：

source: The <code>transparent</code> parameter (1.11.0) allows outgoing connections to a proxied server originate from a non-local IP address, for example, from a real IP address of a client:
es: El par&aacute;metro <code>transparent</code> e (1.11.0) permite que las conexiones salientes a un servidor proxy se originen desde una direcci&oacute;n IP no local, por ejemplo, desde una direcci&oacute;n IP real de un cliente:
ja: <code>transparent</code> パラメータ（1.11.0）は、プロキシサーバへの発信接続は、クライアントの実際のIPアドレスから、例えば、非ローカルIPアドレスから発信できます。
ko: <code>transparent</code> 매개 변수 (1.11.0)는 프록시 서버로 나가는 연결 클라이언트의 실제 IP 주소, 예를 들어, 로컬이 아닌 IP 주소에서 발생 할 수 있습니다 :
ru: Параметр <code>transparent</code> (1.11.0) разрешает исходящие подключения к прокси-серверу с нелокального IP-адреса, например, с реального IP-адреса клиента:
zh_cn: 所述 <code>transparent</code> 参数（1.11.0）允许与代理服务器传出连接从一个非本地的IP地址发起，例如，来自客户端的实际IP地址：

source: The <code>transparent</code> parameter (1.11.0) allows outgoing connections to a uwsgi server originate from a non-local IP address, for example, from a real IP address of a client:
es: El par&aacute;metro <code>transparent</code> e (1.11.0) permite que las conexiones salientes a un servidor uwsgi se originen desde una direcci&oacute;n IP no local, por ejemplo, desde una direcci&oacute;n IP real de un cliente:
ja: <code>transparent</code> パラメータ（1.11.0）はuwsgiサーバへの発信接続は、クライアントの実際のIPアドレスから、例えば、非ローカルIPアドレスから発信できます。
ko: <code>transparent</code> 매개 변수 (1.11.0)는 uwsgi 서버로 나가는 연결 클라이언트의 실제 IP 주소, 예를 들어, 로컬이 아닌 IP 주소에서 발생 할 수 있습니다 :
ru: Параметр <code>transparent</code> (1.11.0) разрешает исходящие подключения к серверу uwsgi с нелокального IP-адреса, например, с реального IP-адреса клиента:
zh_cn: 所述 <code>transparent</code> 参数（1.11.0）允许一个uwsgi服务器传出连接从一个非本地的IP地址发起，例如，来自客户端的实际IP地址：

source: The <code>transparent</code> parameter (1.11.0) allows outgoing connections to an SCGI server originate from a non-local IP address, for example, from a real IP address of a client:
es: El par&aacute;metro <code>transparent</code> e (1.11.0) permite que las conexiones salientes a un servidor SCGI se originen desde una direcci&oacute;n IP no local, por ejemplo, desde una direcci&oacute;n IP real de un cliente:
ja: <code>transparent</code> パラメータ（1.11.0）はSCGIサーバへの発信接続は、クライアントの実際のIPアドレスから、例えば、非ローカルIPアドレスから発信できます。
ko: <code>transparent</code> 매개 변수 (1.11.0)는 SCGI 서버로 나가는 연결 클라이언트의 실제 IP 주소, 예를 들어, 로컬이 아닌 IP 주소에서 발생 할 수 있습니다 :
ru: Параметр <code>transparent</code> (1.11.0) разрешает исходящие подключения к серверу SCGI с нелокального IP-адреса, например, с реального IP-адреса клиента:
zh_cn: 所述 <code>transparent</code> 参数（1.11.0）允许一个SCGI服务器传出连接从一个非本地的IP地址发起，例如，来自客户端的实际IP地址：

source: The <code>transparent</code> parameter allows outgoing connections to a gRPC server originate from a non-local IP address, for example, from a real IP address of a client:
es: El par&aacute;metro <code>transparent</code> e permite que las conexiones salientes a un servidor gRPC se originen desde una direcci&oacute;n IP no local, por ejemplo, desde una direcci&oacute;n IP real de un cliente:
ja: <code>transparent</code> パラメータはgRPCサーバへの発信接続は、クライアントの実際のIPアドレスから、例えば、非ローカルIPアドレスから発信できます。
ko: <code>transparent</code> 매개 변수는 gRPC 서버로 나가는 연결 클라이언트의 실제 IP 주소, 예를 들어, 로컬이 아닌 IP 주소에서 발생 할 수 있습니다 :
ru: Параметр <code>transparent</code> разрешает исходящие подключения к серверу gRPC с нелокального IP-адреса, например, с реального IP-адреса клиента:
zh_cn: 所述 <code>transparent</code> 参数允许一个GRPC服务器传出连接从一个非本地的IP地址发起，例如，来自客户端的实际IP地址：

source: The <code>udp</code> parameter configures a listening socket for working with datagrams (1.9.13). In order to handle packets from the same address and port in the same session, the <a href="#reuseport"><code>reuseport</code></a> parameter should also be specified.
es: El par&aacute;metro <code>udp</code> configura un conector de escucha para trabajar con datagramas (1.9.13). Para manejar paquetes de la misma direcci&oacute;n y puerto en la misma sesi&oacute;n, tambi&eacute;n se debe especificar el par&aacute;metro <a href="#reuseport"> <code>reuseport</code> </a> .
ja: <code>udp</code> パラメータは、データグラム（1.9.13）を操作するためのリスニングソケットを設定します。同じセッションで同じアドレスとポートからのパケットを処理するには、<a href="#reuseport"> <code>reuseport</code> </a>パラメータも指定する必要があります。
ko: <code>udp</code> 매개 변수는 데이터 그램 (1.9.13) 작업을위한 청취 소켓을 구성합니다. 동일한 세션에서 동일한 주소 및 포트의 패킷을 처리하려면 <a href="#reuseport"> <code>reuseport</code> </a> 매개 변수도 지정해야합니다.
ru: Параметр <code>udp</code> настраивает прослушивающий сокет для работы с дейтаграммами (1.9.13). Чтобы обрабатывать пакеты с одного и того же адреса и порта в одном сеансе, также следует указать параметр <a href="#reuseport"> <code>reuseport</code> </a> .
zh_cn: 该 <code>udp</code> 参数配置一个监听套接字用于数据报（1.9.13）工作。为了在同一会话中处理来自相同地址和端口的数据包，还应该指定<a href="#reuseport"> <code>reuseport</code> </a>参数。

source: The <code>worker_connections</code> directive in the nginx configuration limits the number of connections per nginx worker. All connection structures are precreated when a worker starts and stored in the <code>connections</code> field of the cycle object. To retrieve a connection structure, use the <code>ngx_get_connection(s, log)</code> function. It takes as its <code>s</code> argument a socket descriptor, which needs to be wrapped in a connection structure.
es: La directiva <code>worker_connections</code> en la configuraci&oacute;n de nginx limita el n&uacute;mero de conexiones por trabajador nginx. Todas las estructuras de conexi&oacute;n se crean previamente cuando un trabajador inicia y se almacenan en el campo de <code>connections</code> del objeto de ciclo. Para recuperar una estructura de conexi&oacute;n, use la funci&oacute;n <code>ngx_get_connection(s, log)</code> . Toma como <code>s</code> argumento un descriptor de socket, que debe ser envuelto en una estructura de conexi&oacute;n.
ja: nginx構成の <code>worker_connections</code> ディレクティブは、nginxワーカーごとの接続数を制限します。ワーカーが起動すると、すべての接続構造が事前に作成され、サイクルオブジェクトの <code>connections</code> フィールドに格納されます。接続構造を取得するには、 <code>ngx_get_connection(s, log)</code> 関数を使用します。これは、 <code>s</code> 引数としてソケット記述子を受け取ります。これは、接続構造でラップする必要があります。
ko: nginx 구성 의 <code>worker_connections</code> 지시문은 nginx 작업 자당 연결 수를 제한합니다. 모든 연결 구조는 작업자가 시작되어 사이클 객체 의 <code>connections</code> 필드에 저장 될 때 미리 만들어 집니다. 연결 구조를 검색하려면 <code>ngx_get_connection(s, log)</code> 함수를 사용하십시오. 그것은 그것으로 소요 <code>s</code> 연결 구조에 싸여 할 필요가 인수 소켓 기술자.
ru: В <code>worker_connections</code> директива в пределах конфигурации Nginx количество соединений на Nginx работника. Все структуры соединительных precreated , когда начинается рабочая и находятся в <code>connections</code> поля объекта цикла. Чтобы получить структуру соединения, используйте <code>ngx_get_connection(s, log)</code> . Он принимает в качестве аргумента <code>s</code> дескриптор сокета, который должен быть заключен в структуру соединения.
zh_cn: <code>worker_connections</code> 配置中的worker_connections指令限制了每个nginx worker的连接数。所有连接结构都是在工作人员启动时预先创建的，并存储在循环对象的 <code>connections</code> 字段中。要检索连接结构，请使用 <code>ngx_get_connection(s, log)</code> 函数。它作为其 <code>s</code> 参数套接字描述符，它需要被包裹在一个连接结构。

source: The <code>write</code> parameter determines whether the API is read-only or read-write. By default, the API is read-only.
es: El par&aacute;metro de <code>write</code> determina si la API es de solo lectura o de lectura y escritura. De forma predeterminada, la API es de solo lectura.
ja: <code>write</code> パラメータは、APIは、読み取り専用または読み取り書き込みをされたか否かを判定する。デフォルトでは、APIは読み取り専用です。
ko: <code>write</code> 매개 변수는 API가 읽기 전용 여부를 읽기 - 쓰기를 결정합니다. 기본적으로 API는 읽기 전용입니다.
ru: Параметр <code>write</code> определяет, доступен ли API только для чтения или для чтения-записи. По умолчанию API доступен только для чтения.
zh_cn: 的 <code>write</code> 参数确定API是否是只读或读写。默认情况下，API是只读的。

source: The <code>zero</code> flag is useful when results are to be passed to libraries that require zero-terminated strings, and prefixes are handy when dealing with filenames.
es: La <code>zero</code> es &uacute;til cuando los resultados se van a pasar a bibliotecas que requieren cadenas terminadas en cero, y los prefijos son &uacute;tiles cuando se trata de nombres de archivos.
ja: <code>zero</code> の結果がゼロで終わる文字列を必要とするライブラリに渡されるとき、フラグが有用であり、ファイル名を扱うときにプレフィックスが便利です。
ko: <code>zero</code> 결과는 제로 끝나는 문자열을 필요로 도서관에 전달 될 때 플래그는 유용하고, 파일 이름을 처리 할 때 접두어가 편리합니다.
ru: <code>zero</code> флаг полезен , когда результаты должны быть переданы в библиотеки , которые требуют нулевого законченных строк и префиксы удобны при работе с именами файлов.
zh_cn: 当将结果传递到需要以零结尾的字符串的库时， <code>zero</code> 标志很有用；在处理文件名时，前缀很方便。

source: The Crypto module provides cryptographic functionality support. The Crypto module object is returned by <code>require('crypto')</code>.
es: El m&oacute;dulo Crypto proporciona compatibilidad con la funcionalidad criptogr&aacute;fica. El objeto del m&oacute;dulo Crypto es devuelto por <code>require('crypto')</code> .
ja: Cryptoモジュールは、暗号化機能のサポートを提供します。暗号モジュールオブジェクトは <code>require('crypto')</code> によって返されます。
ko: 암호화 모듈은 암호화 기능을 지원합니다. Crypto 모듈 객체는 <code>require('crypto')</code> 에 의해 반환됩니다 .
ru: Модуль Crypto обеспечивает поддержку криптографических функций. Объект модуля Crypto возвращается с помощью <code>require('crypto')</code> .
zh_cn: 加密模块提供加密功能支持。Crypto模块对象由 <code>require('crypto')</code> 返回。

source: The File System module provides operations with files. The module object is returned by <code>require('fs')</code>.
es: El m&oacute;dulo Sistema de archivos proporciona operaciones con archivos. El objeto del m&oacute;dulo es devuelto por <code>require('fs')</code> .
ja: ファイルシステムモジュールは、ファイルの操作を提供します。モジュールオブジェクトは <code>require('fs')</code> によって返されます。
ko: 파일 시스템 모듈은 파일 작업을 제공합니다. 모듈 객체는 <code>require('fs')</code> 에 의해 반환됩니다 .
ru: Модуль файловой системы обеспечивает операции с файлами. Объект модуля возвращается с помощью <code>require('fs')</code> .
zh_cn: 文件系统模块提供文件操作。该模块对象由 <code>require('fs')</code> 返回。

source: The HTTP protocol is used to communicate with the authentication server. The data in the response body is ignored, the information is passed only in the headers.
es: El protocolo HTTP se utiliza para comunicarse con el servidor de autenticación.Los datos en el cuerpo de respuesta son ignorados,la información se pasa sólo en los encabezados.
ja: 認証サーバとの通信にはHTTPプロトコルを使用します。レスポンスボディのデータは無視され、情報はヘッダのみで渡されます。
ko: HTTP 프로토콜은 인증 서버와 통신하는 데 사용됩니다. 응답 본문의 데이터는 무시되고 정보는 헤더에만 전달됩니다.
ru: Протокол HTTP используется для связи с сервером аутентификации.Данные в теле ответа игнорируются,информация передается только в заголовках.
zh_cn: HTTP协议用于与认证服务器通信。响应体中的数据被忽略,信息只在头部传递。

source: The HTTP request object is available only in the <a href="../http/ngx_http_js_module">ngx_http_js_module</a> module. All string properties of the object are <a href="#string">byte strings</a>.
es: El objeto de solicitud HTTP solo est&aacute; disponible en el m&oacute;dulo <a href="../http/ngx_http_js_module">ngx_http_js_module</a> . Todas las propiedades de cadena del objeto son <a href="#string">cadenas de bytes</a> .
ja: HTTPリクエストオブジェクトは、<a href="../http/ngx_http_js_module">ngx_http_js_module</a>モジュールでのみ使用できます。オブジェクトのすべての文字列プロパティは<a href="#string">バイト文字列</a>です。
ko: HTTP 요청 객체는 <a href="../http/ngx_http_js_module">ngx_http_js_module</a> 모듈 에서만 사용할 수 있습니다 . 객체의 모든 문자열 속성은 <a href="#string">바이트 문자열</a> 입니다.
ru: Объект HTTP-запроса доступен только в модуле <a href="../http/ngx_http_js_module">ngx_http_js_module</a> . Все строковые свойства объекта являются <a href="#string">байтовыми строками</a> .
zh_cn: HTTP请求对象仅在<a href="../http/ngx_http_js_module">ngx_http_js_module</a>模块中可用。对象的所有字符串属性都是<a href="#string">字节字符串</a>。

source: The ID of the HTTP upstream server. The ID is assigned automatically and cannot be changed.
es: El ID del servidor HTTP upstream.El ID se asigna automáticamente y no puede ser modificado.
ja: HTTPアップストリームサーバのIDです。ID は自動的に割り当てられ、変更することはできません。
ko: HTTP 업스트림 서버의 ID입니다. ID는 자동으로 할당되며 변경할 수 없습니다.
ru: Идентификатор восходящего HTTP-сервера.ID назначается автоматически и не может быть изменен.
zh_cn: HTTP上游服务器的ID。该ID是自动分配的,不能更改。

source: The ID of the master process that started the <a href="#pid">worker process</a>.
es: El ID del proceso maestro que inici&oacute; el <a href="#pid">proceso de trabajo</a> .
ja: <a href="#pid">ワーカープロセス</a>を開始したマスタープロセスのID 。
ko: <a href="#pid">작업자 프로세스</a> 를 시작한 마스터 프로세스의 ID입니다 .
ru: Идентификатор главного процесса, запустившего <a href="#pid">рабочий процесс</a> .
zh_cn: 启动<a href="#pid">工作进程</a>的主进程的ID 。

source: The ID of the master process that started the <a href="ngx_http_status_module#pid">worker process</a>.
es: El ID del proceso maestro que inici&oacute; el <a href="ngx_http_status_module#pid">proceso de trabajo</a> .
ja: <a href="ngx_http_status_module#pid">ワーカープロセス</a>を開始したマスタープロセスのID 。
ko: <a href="ngx_http_status_module#pid">작업자 프로세스</a> 를 시작한 마스터 프로세스의 ID입니다 .
ru: Идентификатор главного процесса, запустившего <a href="ngx_http_status_module#pid">рабочий процесс</a> .
zh_cn: 启动<a href="ngx_http_status_module#pid">工作进程</a>的主进程的ID 。

source: The ID of the request, equals the value of the <a href="ngx_http_core_module#var_request_id">$request_id</a> variable.
es: El ID de la solicitud es igual al valor de la variable <a href="ngx_http_core_module#var_request_id">$ request_id</a> .
ja: リクエストのID 。<a href="ngx_http_core_module#var_request_id">$ request_id</a>変数の値と同じです。
ko: 요청의 ID는 <a href="ngx_http_core_module#var_request_id">$ request_id</a> 변수 의 값과 같습니다 .
ru: ID запроса равен значению переменной <a href="ngx_http_core_module#var_request_id">$ request_id</a> .
zh_cn: 请求的ID等于<a href="ngx_http_core_module#var_request_id">$ request_id</a>变量的值。

source: The ID of the server.
es: La identificación del servidor.
ja: サーバーのIDです。
ko: 서버의 ID입니다.
ru: Идентификатор сервера.
zh_cn: 服务器的ID。

source: The ID of the stream upstream server. The ID is assigned automatically and cannot be changed.
es: La identificación del servidor de flujo ascendente.El ID se asigna automáticamente y no puede ser modificado.
ja: ストリームアップストリームサーバの ID です。ID は自動的に割り当てられ、変更することはできません。
ko: 스트림 업스트림 서버의 ID입니다. ID는 자동으로 할당되며 변경할 수 없습니다.
ru: Идентификатор сервера потокового восходящего потока.ID назначается автоматически и не может быть изменен.
zh_cn: 流上游服务器的ID。该ID是自动分配的,不能更改。

source: The ID of the worker process that handled status request.
es: La identificación del proceso del trabajador que manejó la solicitud de estatus.
ja: ステータス要求を処理したワーカープロセスのID。
ko: 상태 요청을 처리 한 작업자 프로세스의 ID입니다.
ru: Идентификатор рабочего процесса,который обрабатывал запрос на статус.
zh_cn: 处理状态请求的工人进程的ID。
