Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/nginx/nginx.*.004.xlf
Languages: es, ja, ko, ru, zh_cn

source: When buffering is disabled, the response is passed to a client synchronously, immediately as it is received. nginx will not try to read the whole response from the FastCGI server. The maximum size of the data that nginx can receive from the server at a time is set by the <a href="#fastcgi_buffer_size">fastcgi_buffer_size</a> directive.
es: Cuando el almacenamiento en b&uacute;fer est&aacute; deshabilitado, la respuesta se pasa a un cliente de forma s&iacute;ncrona, inmediatamente como se recibe. nginx no intentar&aacute; leer la respuesta completa del servidor FastCGI. El tama&ntilde;o m&aacute;ximo de los datos que nginx puede recibir del servidor a la vez lo establece la directiva <a href="#fastcgi_buffer_size">fastcgi_buffer_size</a> .
ko: 버퍼링이 비활성화되면 응답이 수신되는 즉시 클라이언트에 동 기적으로 전달됩니다. nginx는 FastCGI 서버에서 전체 응답을 읽으려고하지 않습니다. nginx가 한 번에 서버에서 수신 할 수있는 최대 데이터 크기는 <a href="#fastcgi_buffer_size">fastcgi_buffer_size</a> 지시문에 의해 설정됩니다 .

source: When buffering is disabled, the response is passed to a client synchronously, immediately as it is received. nginx will not try to read the whole response from the SCGI server. The maximum size of the data that nginx can receive from the server at a time is set by the <a href="#scgi_buffer_size">scgi_buffer_size</a> directive.
es: Cuando el almacenamiento en b&uacute;fer est&aacute; deshabilitado, la respuesta se pasa a un cliente de forma s&iacute;ncrona, inmediatamente como se recibe. nginx no intentar&aacute; leer la respuesta completa del servidor SCGI. El tama&ntilde;o m&aacute;ximo de los datos que nginx puede recibir del servidor a la vez lo establece la directiva <a href="#scgi_buffer_size">scgi_buffer_size</a> .
ko: 버퍼링이 비활성화되면 응답이 수신되는 즉시 클라이언트에 동 기적으로 전달됩니다. nginx는 SCGI 서버에서 전체 응답을 읽으려고하지 않습니다. nginx가 한 번에 서버에서 수신 할 수있는 최대 데이터 크기는 <a href="#scgi_buffer_size">scgi_buffer_size</a> 지시문에 의해 설정됩니다 .

source: When buffering is disabled, the response is passed to a client synchronously, immediately as it is received. nginx will not try to read the whole response from the proxied server. The maximum size of the data that nginx can receive from the server at a time is set by the <a href="#proxy_buffer_size">proxy_buffer_size</a> directive.
es: Cuando el almacenamiento en b&uacute;fer est&aacute; deshabilitado, la respuesta se pasa a un cliente de forma s&iacute;ncrona, inmediatamente como se recibe. nginx no intentar&aacute; leer la respuesta completa del servidor proxy. El tama&ntilde;o m&aacute;ximo de los datos que nginx puede recibir del servidor a la vez lo establece la directiva <a href="#proxy_buffer_size">proxy_buffer_size</a> .
ko: 버퍼링이 비활성화되면 응답이 수신되는 즉시 클라이언트에 동 기적으로 전달됩니다. nginx는 프록시 서버에서 전체 응답을 읽으려고 시도하지 않습니다. nginx가 한 번에 서버에서 수신 할 수있는 최대 데이터 크기는 <a href="#proxy_buffer_size">proxy_buffer_size</a> 지시문에 의해 설정됩니다 .

source: When buffering is disabled, the response is passed to a client synchronously, immediately as it is received. nginx will not try to read the whole response from the uwsgi server. The maximum size of the data that nginx can receive from the server at a time is set by the <a href="#uwsgi_buffer_size">uwsgi_buffer_size</a> directive.
es: Cuando el almacenamiento en b&uacute;fer est&aacute; deshabilitado, la respuesta se pasa a un cliente de forma s&iacute;ncrona, inmediatamente como se recibe. nginx no intentar&aacute; leer la respuesta completa del servidor uwsgi. El tama&ntilde;o m&aacute;ximo de los datos que nginx puede recibir del servidor a la vez lo establece la directiva <a href="#uwsgi_buffer_size">uwsgi_buffer_size</a> .
ko: 버퍼링이 비활성화되면 응답이 수신되는 즉시 클라이언트에 동 기적으로 전달됩니다. nginx는 uwsgi 서버에서 전체 응답을 읽으려고 시도하지 않습니다. nginx가 한 번에 서버에서 수신 할 수있는 최대 데이터 크기는 <a href="#uwsgi_buffer_size">uwsgi_buffer_size</a> 지시문에 의해 설정됩니다 .

source: When buffering is enabled, nginx receives a response from the FastCGI server as soon as possible, saving it into the buffers set by the <a href="#fastcgi_buffer_size">fastcgi_buffer_size</a> and <a href="#fastcgi_buffers">fastcgi_buffers</a> directives. If the whole response does not fit into memory, a part of it can be saved to a <a href="#fastcgi_temp_path">temporary file</a> on the disk. Writing to temporary files is controlled by the <a href="#fastcgi_max_temp_file_size">fastcgi_max_temp_file_size</a> and <a href="#fastcgi_temp_file_write_size">fastcgi_temp_file_write_size</a> directives.
es: Cuando el b&uacute;fer est&aacute; habilitado, nginx recibe una respuesta del servidor FastCGI tan pronto como sea posible, guard&aacute;ndola en los b&uacute;feres establecidos por las directivas <a href="#fastcgi_buffer_size">fastcgi_buffer_size</a> y <a href="#fastcgi_buffers">fastcgi_buffers</a> . Si la respuesta completa no cabe en la memoria, una parte se puede guardar en un <a href="#fastcgi_temp_path">archivo temporal</a> en el disco. La escritura en archivos temporales est&aacute; controlada por las directivas <a href="#fastcgi_max_temp_file_size">fastcgi_max_temp_file_size</a> y <a href="#fastcgi_temp_file_write_size">fastcgi_temp_file_write_size</a> .
ko: 버퍼링이 활성화되면 nginx는 가능한 한 빨리 FastCGI 서버로부터 응답을 수신하여 <a href="#fastcgi_buffer_size">fastcgi_buffer_size</a> 및 <a href="#fastcgi_buffers">fastcgi_buffers</a> 지시문에 의해 설정된 버퍼에 저장합니다 . 전체 응답이 메모리에 맞지 않으면 일부를 디스크 의 <a href="#fastcgi_temp_path">임시 파일</a> 에 저장할 수 있습니다 . 임시 파일에 쓰는 것은 <a href="#fastcgi_max_temp_file_size">fastcgi_max_temp_file_size</a> 및 <a href="#fastcgi_temp_file_write_size">fastcgi_temp_file_write_size</a> 지시문에 의해 제어됩니다 .

source: When buffering is enabled, nginx receives a response from the SCGI server as soon as possible, saving it into the buffers set by the <a href="#scgi_buffer_size">scgi_buffer_size</a> and <a href="#scgi_buffers">scgi_buffers</a> directives. If the whole response does not fit into memory, a part of it can be saved to a <a href="#scgi_temp_path">temporary file</a> on the disk. Writing to temporary files is controlled by the <a href="#scgi_max_temp_file_size">scgi_max_temp_file_size</a> and <a href="#scgi_temp_file_write_size">scgi_temp_file_write_size</a> directives.
es: Cuando el almacenamiento en b&uacute;fer est&aacute; habilitado, nginx recibe una respuesta del servidor SCGI lo antes posible, guard&aacute;ndola en los b&uacute;feres establecidos por las directivas <a href="#scgi_buffer_size">scgi_buffer_size</a> y <a href="#scgi_buffers">scgi_buffers</a> . Si la respuesta completa no cabe en la memoria, una parte se puede guardar en un <a href="#scgi_temp_path">archivo temporal</a> en el disco. La escritura en archivos temporales est&aacute; controlada por las directivas <a href="#scgi_max_temp_file_size">scgi_max_temp_file_size</a> y <a href="#scgi_temp_file_write_size">scgi_temp_file_write_size</a> .
ko: 버퍼링이 활성화되면 nginx는 가능한 빨리 SCGI 서버로부터 응답을 수신하여 <a href="#scgi_buffer_size">scgi_buffer_size</a> 및 <a href="#scgi_buffers">scgi_buffers</a> 지시문이 설정 한 버퍼에 저장합니다 . 전체 응답이 메모리에 맞지 않으면 일부를 디스크 의 <a href="#scgi_temp_path">임시 파일</a> 에 저장할 수 있습니다 . 임시 파일 쓰기는 <a href="#scgi_max_temp_file_size">scgi_max_temp_file_size</a> 및 <a href="#scgi_temp_file_write_size">scgi_temp_file_write_size</a> 지시문에 의해 제어됩니다 .

source: When buffering is enabled, nginx receives a response from the proxied server as soon as possible, saving it into the buffers set by the <a href="#proxy_buffer_size">proxy_buffer_size</a> and <a href="#proxy_buffers">proxy_buffers</a> directives. If the whole response does not fit into memory, a part of it can be saved to a <a href="#proxy_temp_path">temporary file</a> on the disk. Writing to temporary files is controlled by the <a href="#proxy_max_temp_file_size">proxy_max_temp_file_size</a> and <a href="#proxy_temp_file_write_size">proxy_temp_file_write_size</a> directives.
es: Cuando el almacenamiento en b&uacute;fer est&aacute; habilitado, nginx recibe una respuesta del servidor proxy lo antes posible, guard&aacute;ndola en los b&uacute;feres establecidos por las directivas <a href="#proxy_buffer_size">proxy_buffer_size</a> y <a href="#proxy_buffers">proxy_buffers</a> . Si la respuesta completa no cabe en la memoria, una parte se puede guardar en un <a href="#proxy_temp_path">archivo temporal</a> en el disco. La escritura en archivos temporales est&aacute; controlada por las directivas <a href="#proxy_max_temp_file_size">proxy_max_temp_file_size</a> y <a href="#proxy_temp_file_write_size">proxy_temp_file_write_size</a> .
ko: 버퍼링이 활성화되면 nginx는 프록시 서버로부터 가능한 빨리 응답을 받아 <a href="#proxy_buffer_size">proxy_buffer_size</a> 및 <a href="#proxy_buffers">proxy_buffers</a> 지시문에 의해 설정된 버퍼에 저장합니다 . 전체 응답이 메모리에 맞지 않으면 일부를 디스크 의 <a href="#proxy_temp_path">임시 파일</a> 에 저장할 수 있습니다 . 임시 파일에 쓰는 것은 <a href="#proxy_max_temp_file_size">proxy_max_temp_file_size</a> 및 <a href="#proxy_temp_file_write_size">proxy_temp_file_write_size</a> 지시문에 의해 제어됩니다 .

source: When buffering is enabled, nginx receives a response from the uwsgi server as soon as possible, saving it into the buffers set by the <a href="#uwsgi_buffer_size">uwsgi_buffer_size</a> and <a href="#uwsgi_buffers">uwsgi_buffers</a> directives. If the whole response does not fit into memory, a part of it can be saved to a <a href="#uwsgi_temp_path">temporary file</a> on the disk. Writing to temporary files is controlled by the <a href="#uwsgi_max_temp_file_size">uwsgi_max_temp_file_size</a> and <a href="#uwsgi_temp_file_write_size">uwsgi_temp_file_write_size</a> directives.
es: Cuando el almacenamiento en b&uacute;fer est&aacute; habilitado, nginx recibe una respuesta del servidor uwsgi lo antes posible, guard&aacute;ndola en los b&uacute;feres establecidos por las directivas <a href="#uwsgi_buffer_size">uwsgi_buffer_size</a> y <a href="#uwsgi_buffers">uwsgi_buffers</a> . Si toda la respuesta no cabe en la memoria, una parte se puede guardar en un <a href="#uwsgi_temp_path">archivo temporal</a> en el disco. La escritura en archivos temporales est&aacute; controlada por las directivas <a href="#uwsgi_max_temp_file_size">uwsgi_max_temp_file_size</a> y <a href="#uwsgi_temp_file_write_size">uwsgi_temp_file_write_size</a> .
ko: 버퍼링이 활성화되면, nginx는 가능한 빨리 uwsgi 서버로부터 응답을 수신하여 <a href="#uwsgi_buffer_size">uwsgi_buffer_size</a> 및 <a href="#uwsgi_buffers">uwsgi_buffers</a> 지시문에 의해 설정된 버퍼에 저장합니다 . 전체 응답이 메모리에 맞지 않으면 일부를 디스크 의 <a href="#uwsgi_temp_path">임시 파일</a> 에 저장할 수 있습니다 . 임시 파일에 쓰는 것은 <a href="#uwsgi_max_temp_file_size">uwsgi_max_temp_file_size</a> 및 <a href="#uwsgi_temp_file_write_size">uwsgi_temp_file_write_size</a> 지시문에 의해 제어됩니다 .

source: When buffering is enabled, the data will be written to the file:
es: Cuando se active el buffer,los datos se escribirán en el archivo:
ko: 버퍼링이 활성화되면 데이터가 파일에 기록됩니다.

source: When buffering is enabled, the entire request body is <a href="ngx_http_core_module#client_body_buffer_size">read</a> from the client before sending the request to a FastCGI server.
es: Cuando el almacenamiento en b&uacute;fer est&aacute; habilitado, todo el cuerpo de la solicitud se <a href="ngx_http_core_module#client_body_buffer_size">lee</a> del cliente antes de enviar la solicitud a un servidor FastCGI.
ko: 버퍼링이 활성화되면 요청을 FastCGI 서버로 보내기 전에 클라이언트에서 전체 요청 본문을 <a href="ngx_http_core_module#client_body_buffer_size">읽습니다</a> .

source: When buffering is enabled, the entire request body is <a href="ngx_http_core_module#client_body_buffer_size">read</a> from the client before sending the request to a proxied server.
es: Cuando el almacenamiento en b&uacute;fer est&aacute; habilitado, todo el cuerpo de la solicitud se <a href="ngx_http_core_module#client_body_buffer_size">lee</a> del cliente antes de enviar la solicitud a un servidor proxy.
ko: 버퍼링을 사용 하면 프록시 서버로 요청을 보내기 전에 클라이언트에서 전체 요청 본문을 <a href="ngx_http_core_module#client_body_buffer_size">읽습니다</a> .

source: When buffering is enabled, the entire request body is <a href="ngx_http_core_module#client_body_buffer_size">read</a> from the client before sending the request to a uwsgi server.
es: Cuando el almacenamiento en b&uacute;fer est&aacute; habilitado, todo el cuerpo de la solicitud se <a href="ngx_http_core_module#client_body_buffer_size">lee</a> del cliente antes de enviar la solicitud a un servidor uwsgi.
ko: 버퍼링이 활성화되면 요청을 uwsgi 서버로 보내기 전에 클라이언트에서 전체 요청 본문을 <a href="ngx_http_core_module#client_body_buffer_size">읽습니다</a> .

source: When buffering is enabled, the entire request body is <a href="ngx_http_core_module#client_body_buffer_size">read</a> from the client before sending the request to an SCGI server.
es: Cuando el almacenamiento en b&uacute;fer est&aacute; habilitado, todo el cuerpo de la solicitud se <a href="ngx_http_core_module#client_body_buffer_size">lee</a> del cliente antes de enviar la solicitud a un servidor SCGI.
ko: 버퍼링이 활성화되면 SCGI 서버로 요청을 보내기 전에 클라이언트에서 전체 요청 본문을 <a href="ngx_http_core_module#client_body_buffer_size">읽습니다</a> .

source: When checking symbolic links (parameters <code>on</code> and <code>if_not_owner</code>), all components of the pathname are normally checked. Checking of symbolic links in the initial part of the pathname may be avoided by specifying additionally the <code>from</code>=<code><i>part</i></code> parameter. In this case, symbolic links are checked only from the pathname component that follows the specified initial part. If the value is not an initial part of the pathname checked, the whole pathname is checked as if this parameter was not specified at all. If the value matches the whole file name, symbolic links are not checked. The parameter value can contain variables.
es: Al verificar enlaces simb&oacute;licos (par&aacute;metros <code>on</code> y <code>if_not_owner</code> ), normalmente se verifican todos los componentes del nombre de ruta. La verificaci&oacute;n de enlaces simb&oacute;licos en la parte inicial del nombre de ruta puede evitarse especificando adicionalmente el par&aacute;metro <code>from</code> = <code><i>part</i></code> . En este caso, los enlaces simb&oacute;licos se verifican solo desde el componente de nombre de ruta que sigue a la parte inicial especificada. Si el valor no es una parte inicial del nombre de ruta verificado, se verifica todo el nombre de ruta como si este par&aacute;metro no estuviera especificado en absoluto. Si el valor coincide con el nombre del archivo completo, los enlaces simb&oacute;licos no se verifican. El valor del par&aacute;metro puede contener variables.
ko: 기호 링크 (매개 변수 <code>on</code> 및 <code>if_not_owner</code> )를 검사 할 때 경로 이름의 모든 구성 요소가 정상적으로 검사됩니다. <code>from</code> = <code><i>part</i></code> 매개 변수 를 추가로 지정하여 경로명의 초기 부분에서 기호 링크를 점검하지 않아도됩니다 . 이 경우 심볼릭 링크는 지정된 초기 부분 다음에 오는 경로 이름 구성 요소에서만 확인됩니다. 값이 점검 된 경로명의 초기 부분이 아닌 경우,이 매개 변수가 전혀 지정되지 않은 것처럼 전체 경로명이 점검됩니다. 값이 전체 파일 이름과 일치하면 기호 링크가 확인되지 않습니다. 매개 변수 값은 변수를 포함 할 수 있습니다.

source: When creating a file with the PUT method, it is possible to specify the modification date by passing it in the &ldquo;Date&rdquo; header field.
es: Al crear un archivo con el m&eacute;todo PUT, es posible especificar la fecha de modificaci&oacute;n pas&aacute;ndola en el campo de encabezado "Fecha".
ko: PUT 방식으로 파일을 생성 할 때 "날짜"헤더 필드에 수정 날짜를 전달하여 수정 날짜를 지정할 수 있습니다.

source: When describing a conversion table to UTF-8, codes for the UTF-8 charset should be given in the second column, for example:
es: Al describir una tabla de conversión a UTF-8,los códigos para el conjunto de caracteres UTF-8 deben darse en la segunda columna,por ejemplo:
ko: UTF-8로 변환 테이블을 설명 할 때 UTF-8 문자 세트의 코드는 두 번째 열에 제공되어야합니다. 예를 들면 다음과 같습니다.

source: When enabled, only one request at a time will be allowed to populate a new cache element identified according to the <a href="#fastcgi_cache_key">fastcgi_cache_key</a> directive by passing a request to a FastCGI server. Other requests of the same cache element will either wait for a response to appear in the cache or the cache lock for this element to be released, up to the time set by the <a href="#fastcgi_cache_lock_timeout">fastcgi_cache_lock_timeout</a> directive.
es: Cuando est&aacute; habilitado, solo se permitir&aacute; una solicitud a la vez para completar un nuevo elemento de cach&eacute; identificado de acuerdo con la directiva <a href="#fastcgi_cache_key">fastcgi_cache_key</a> al pasar una solicitud a un servidor FastCGI. Otras solicitudes del mismo elemento de cach&eacute; esperar&aacute;n a que aparezca una respuesta en el cach&eacute; o el bloqueo de cach&eacute; para que se libere este elemento, hasta el tiempo establecido por la directiva <a href="#fastcgi_cache_lock_timeout">fastcgi_cache_lock_timeout</a> .
ko: 활성화되면 한 번에 하나의 요청 만 FastCGI 서버에 요청을 전달 하여 <a href="#fastcgi_cache_key">fastcgi_cache_key</a> 지시문에 따라 식별 된 새 캐시 요소를 채울 수 있습니다 . 동일한 캐시 요소의 다른 요청은 응답이 캐시에 나타날 때까지 기다리거나 <a href="#fastcgi_cache_lock_timeout">fastcgi_cache_lock_timeout</a> 지시문이 설정 한 시간까지이 요소가 해제 될 때까지 캐시 잠금을 기다립니다 .

source: When enabled, only one request at a time will be allowed to populate a new cache element identified according to the <a href="#proxy_cache_key">proxy_cache_key</a> directive by passing a request to a proxied server. Other requests of the same cache element will either wait for a response to appear in the cache or the cache lock for this element to be released, up to the time set by the <a href="#proxy_cache_lock_timeout">proxy_cache_lock_timeout</a> directive.
es: Cuando est&aacute; habilitado, solo se permitir&aacute; una solicitud a la vez para completar un nuevo elemento de cach&eacute; identificado de acuerdo con la directiva <a href="#proxy_cache_key">proxy_cache_key</a> al pasar una solicitud a un servidor proxy. Otras solicitudes del mismo elemento de cach&eacute; esperar&aacute;n a que aparezca una respuesta en el cach&eacute; o el bloqueo de cach&eacute; para que se libere este elemento, hasta el tiempo establecido por la directiva <a href="#proxy_cache_lock_timeout">proxy_cache_lock_timeout</a> .
ko: 사용 가능한 경우 한 번에 하나의 요청 만 프록시 서버에 요청을 전달 하여 <a href="#proxy_cache_key">proxy_cache_key</a> 지시문에 따라 식별 된 새 캐시 요소를 채울 수 있습니다 . 동일한 캐시 요소에 대한 다른 요청은 응답이 캐시에 나타날 때까지 기다리거나 <a href="#proxy_cache_lock_timeout">proxy_cache_lock_timeout</a> 지시문이 설정 한 시간까지이 요소가 해제 될 때까지 캐시 잠금을 기다립니다 .

source: When enabled, only one request at a time will be allowed to populate a new cache element identified according to the <a href="#scgi_cache_key">scgi_cache_key</a> directive by passing a request to an SCGI server. Other requests of the same cache element will either wait for a response to appear in the cache or the cache lock for this element to be released, up to the time set by the <a href="#scgi_cache_lock_timeout">scgi_cache_lock_timeout</a> directive.
es: Cuando est&aacute; habilitado, solo se permitir&aacute; una solicitud a la vez para completar un nuevo elemento de cach&eacute; identificado de acuerdo con la directiva <a href="#scgi_cache_key">scgi_cache_key</a> al pasar una solicitud a un servidor SCGI. Otras solicitudes del mismo elemento de cach&eacute; esperar&aacute;n a que aparezca una respuesta en el cach&eacute; o el bloqueo de cach&eacute; para que se libere este elemento, hasta el tiempo establecido por la directiva <a href="#scgi_cache_lock_timeout">scgi_cache_lock_timeout</a> .
ko: 활성화되면 한 번에 하나의 요청 만 SCGI 서버에 요청을 전달 하여 <a href="#scgi_cache_key">scgi_cache_key</a> 지시문에 따라 식별 된 새 캐시 요소를 채울 수 있습니다 . 동일한 캐시 요소에 대한 다른 요청은 응답이 캐시에 나타날 때까지 기다리거나 <a href="#scgi_cache_lock_timeout">scgi_cache_lock_timeout</a> 지시문이 설정 한 시간까지이 요소가 해제 될 때까지 캐시 잠금을 기다립니다 .

source: When enabled, only one request at a time will be allowed to populate a new cache element identified according to the <a href="#uwsgi_cache_key">uwsgi_cache_key</a> directive by passing a request to a uwsgi server. Other requests of the same cache element will either wait for a response to appear in the cache or the cache lock for this element to be released, up to the time set by the <a href="#uwsgi_cache_lock_timeout">uwsgi_cache_lock_timeout</a> directive.
es: Cuando est&aacute; habilitado, solo se permitir&aacute; una solicitud a la vez para completar un nuevo elemento de cach&eacute; identificado de acuerdo con la directiva <a href="#uwsgi_cache_key">uwsgi_cache_key</a> al pasar una solicitud a un servidor uwsgi. Otras solicitudes del mismo elemento de cach&eacute; esperar&aacute;n a que aparezca una respuesta en el cach&eacute; o el bloqueo de cach&eacute; para que se libere este elemento, hasta el tiempo establecido por la directiva <a href="#uwsgi_cache_lock_timeout">uwsgi_cache_lock_timeout</a> .
ko: 활성화되면 요청을 uwsgi 서버에 전달 하여 <a href="#uwsgi_cache_key">uwsgi_cache_key</a> 지시문에 따라 식별 된 새 캐시 요소를 한 번에 하나의 요청 만 채울 수 있습니다 . 동일한 캐시 요소에 대한 다른 요청은 <a href="#uwsgi_cache_lock_timeout">uwsgi_cache_lock_timeout</a> 지시문이 설정 한 시간까지 캐시에 응답이 표시 되거나이 요소가 해제 될 때까지 캐시 잠금이 대기 합니다.

source: When internal error is detected, e.g. the leak of sockets on restart of working processes, enabling <code>debug_points</code> leads to a core file creation (<code>abort</code>) or to stopping of a process (<code>stop</code>) for further analysis using a system debugger.
es: Cuando se detecta un error interno, por ejemplo, la fuga de sockets al reiniciar los procesos de trabajo, la habilitaci&oacute;n de <code>debug_points</code> conduce a la creaci&oacute;n de un archivo central ( <code>abort</code> ar ) o a la detenci&oacute;n de un proceso ( <code>stop</code> ) para un an&aacute;lisis posterior utilizando un depurador del sistema.
ko: 내부 오류가 감지되면 (예 : 작업 프로세스 재시작시 소켓 누수) <code>debug_points</code> 를 활성화 하면 시스템 디버거를 사용하여 추가 분석 을 위해 코어 파일 작성 ( <code>abort</code> ) 또는 프로세스 <code>stop</code> ( 중지 )가 발생합니다.
