Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/nginx/nginx.*.004.xlf
Languages: es, ja, ko, ru, zh_cn

source: Since version 1.5.9 and prior to version 1.11.5, this parameter was available as part of our <a href="http://nginx.com/products/">commercial subscription</a>.
ja: バージョン1.5.9以降およびバージョン1.11.5より前のバージョンでは、このパラメーターは<a href="http://nginx.com/products/">商用サブスクリプションの</a>一部として利用可能でした。
ru: Начиная с версии 1.5.9 и до версии 1.11.5 этот параметр был доступен в рамках нашей <a href="http://nginx.com/products/">коммерческой подписки</a> .
zh_cn: 从1.5.9版开始，在1.11.5版之前，此参数已作为我们的<a href="http://nginx.com/products/">商业订阅的</a>一部分提供。

source: Sizes can be specified in bytes, kilobytes (suffixes <code>k</code> and <code>K</code>) or megabytes (suffixes <code>m</code> and <code>M</code>), for example, &ldquo;<code>1024</code>&rdquo;, &ldquo;<code>8k</code>&rdquo;, &ldquo;<code>1m</code>&rdquo;.
ja: サイズは、バイト、キロバイト（接尾辞 <code>k</code> および <code>K</code> ）またはメガバイト（接尾辞 <code>m</code> および <code>M</code> ）で指定できます（例：「 <code>1024</code> 」、「 <code>8k</code> 」、「 <code>1m</code> 」）。
ru: Размеры могут быть указаны в байтах, килобайтах (суффиксы <code>k</code> и <code>K</code> ) или мегабайтах (суффиксы <code>m</code> и <code>M</code> ), например, &laquo; <code>1024</code> &raquo;, &laquo; <code>8k</code> &raquo;, &laquo; <code>1m</code> &raquo;.
zh_cn: 大小可以字节，千字节（后缀 <code>k</code> 和 <code>K</code> ）或兆字节（后缀 <code>m</code> 和 <code>M</code> ）指定，例如&ldquo; <code>1024</code> &rdquo;，&ldquo; <code>8k</code> &rdquo;，&ldquo; <code>1m</code> &rdquo;。

source: Slab pool divides all shared zone into pages. Each page is used for allocating objects of the same size. The specified size must be a power of 2, and greater than the minimum size of 8 bytes. Nonconforming values are rounded up. A bitmask for each page tracks which blocks are in use and which are free for allocation. For sizes greater than a half page (which is usually 2048 bytes), allocation is done an entire page at a time
ja: スラブプールはすべての共有ゾーンをページに分割します。各ページは同じサイズのオブジェクトを割り当てるために使用されます。指定されたサイズは2の累乗で、最小サイズの8バイトより大きくなければなりません。不適合な値は切り上げられます。各ページのビットマスクは、どのブロックが使用されていて、どのブロックが割り当てのために自由になっているかを追跡します。ハーフページ(通常は2048バイト)を超えるサイズの場合は、一度にページ全体の割り当てが行われます。
ru: Пул перекрытий разделяет все общие зоны на страницы.Каждая страница используется для выделения объектов одинакового размера.Указанный размер должен быть мощностью 2 и больше,чем минимальный размер 8 байт.Несоответствующие значения округляются в большую сторону.Для каждой страницы используется битовая маска,какие блоки используются,а какие свободны для выделения.Для размеров,превышающих половину страницы (что обычно составляет 2048 байт),распределение производится по всей странице за раз.
zh_cn: Slab pool将所有共享区划分为多个页面。每个页面用于分配相同大小的对象。指定的大小必须是 2 的幂,并大于最小大小 8 字节。不符合要求的值会被四舍五入。每个页面的位掩码跟踪哪些块正在使用,哪些块可以自由分配。对于大于半页的大小(通常是2048字节),一次分配整个页面。

source: Solaris Dynamic Tracing Guide
ja: Solaris ダイナミックトレースガイド
ru: Динамическое руководство по трассировке Solaris
zh_cn: Solaris动态跟踪指南

source: Some browsers may complain about a certificate signed by a well-known certificate authority, while other browsers may accept the certificate without issues. This occurs because the issuing authority has signed the server certificate using an intermediate certificate that is not present in the certificate base of well-known trusted certificate authorities which is distributed with a particular browser. In this case the authority provides a bundle of chained certificates which should be concatenated to the signed server certificate. The server certificate must appear before the chained certificates in the combined file:
ja: ブラウザによっては、有名な証明書局が署名した証明書に文句を言う場合もありますが、他のブラウザでは問題なくその証明書を受け入れる場合もあります。これは、発行局が特定のブラウザで配布されている有名な信頼された証明書局の証明書ベースには存在しない中間証明書を使ってサーバ証明書に署名しているために起こります。この場合、発行局は署名されたサーバ証明書に連結すべき連結証明書の束を提供します。サーバ証明書は、結合されたファイルの中で連鎖した証明書の前に現れなければなりません。
ru: Некоторые браузеры могут жаловаться на сертификат,подписанный известным центром сертификации,в то время как другие браузеры могут принимать сертификат без проблем.Это происходит потому,что издающий центр подписал сертификат сервера с помощью промежуточного сертификата,которого нет в базе сертификатов известных доверенных центров сертификации,распространяемой с определенным браузером.В этом случае центр предоставляет связку цепочечных сертификатов,которые должны быть привязаны к подписанному сертификату сервера.Серверный сертификат должен появиться перед цепочечными сертификатами в объединенном файле:
zh_cn: 有些浏览器可能会抱怨由知名证书颁发机构签署的证书,而另一些浏览器可能会接受该证书而不会出现问题。出现这种情况的原因是,发证机构使用了一个中间证书来签署服务器证书,而这个中间证书并不存在于与特定浏览器一起分发的知名可信证书机构的证书库中。在这种情况下,权威机构提供了一个链式证书的捆绑,它应该被连接到已签署的服务器证书。在合并文件中,服务器证书必须出现在链式证书之前。

source: Some modules, such as SSI and Perl, need to deal with variables for which the name is not known at configuration time. An index therefore cannot be used to access them, but the <code>ngx_http_get_variable(r, name, key)</code> function is available. It searches for a variable with a given <code>name</code> and its hash <code>key</code> derived from the name.
ja: SSIやPerlなどの一部のモジュールは、構成時に名前がわからない変数を処理する必要があります。したがって、インデックスを使用してそれらにアクセスすることはできませんが、 <code>ngx_http_get_variable(r, name, key)</code> 関数を使用できます。与えられた <code>name</code> とその名前から導出されたハッシュ <code>key</code> を持つ変数を検索します。
ru: Некоторым модулям, таким как SSI и Perl, необходимо иметь дело с переменными, имя которых неизвестно во время настройки. Следовательно, для доступа к ним нельзя использовать индекс, но доступна функция <code>ngx_http_get_variable(r, name, key)</code> . Он ищет переменную с заданным <code>name</code> и ее хеш- <code>key</code> производный от имени.
zh_cn: 一些模块，例如SSI和Perl，需要处理在配置时名称未知的变量。因此，不能使用索引来访问它们，但是可以使用 <code>ngx_http_get_variable(r, name, key)</code> 函数。它搜索具有给定 <code>name</code> 的变量以及从该名称派生的哈希 <code>key</code> 。

source: Some of the time intervals can be specified only with a seconds resolution.
ja: 時間間隔は秒単位の分解能でしか指定できないものもあります。
ru: Некоторые из временных интервалов могут быть указаны только с разрешением в секундах.
zh_cn: 有些时间间隔只能用秒的分辨率来指定。

source: Some older distributions like SuSE 8.2 provide patches that add epoll support to 2.4 kernels.
ja: SuSE 8.2のような古いディストリビューションの中には、2.4カーネルにepollサポートを追加するパッチを提供しているものもあります。
ru: Некоторые старые дистрибутивы,такие как SuSE 8.2,предоставляют патчи,которые добавляют поддержку epoll к ядрам 2.4.
zh_cn: 一些旧的发行版,如SuSE 8.2,提供了为2.4内核添加epoll支持的补丁。

source: Sometimes, it is convenient to wrap an expression after a cast. In this case, the continuation line is indented:
ja: キャストの後に式をラップするのが便利な場合があります。この場合、継続行はインデントされます。
ru: Иногда удобно завернуть выражение после гипса.В этом случае линия продолжения имеет отступ:
zh_cn: 有时,在投递后包住一个表达式是很方便的。在这种情况下,延续线是缩进的。

source: Source values are specified as strings or regular expressions (0.9.6).
ja: ソース値は文字列または正規表現で指定されます (0.9.6)。
ru: Исходные значения указываются в виде строк или регулярных выражений (0.9.6).
zh_cn: 源值被指定为字符串或正则表达式(0.9.6)。

source: Source values are specified as strings or regular expressions.
ja: ソース値は文字列または正規表現で指定します。
ru: Исходные значения указываются в виде строк или регулярных выражений.
zh_cn: 源值被指定为字符串或正则表达式。

source: Specifies a <code><i>curve</i></code> for ECDHE ciphers.
ja: ECDHE暗号の <code><i>curve</i></code> を指定します。
ru: Задает <code><i>curve</i></code> для шифров ECDHE.
zh_cn: 指定ECDHE密码的 <code><i>curve</i></code> 。

source: Specifies a <code><i>file</i></code> in <a href="https://tools.ietf.org/html/rfc7517#section-5">JSON Web Key Set</a> format for validating JWT signature. Parameter value can contain variables.
ja: JWT署名を検証するための <code><i>file</i></code> を<a href="https://tools.ietf.org/html/rfc7517#section-5">JSON Web Key Set</a>形式で指定し<i>ます</i>。パラメータ値には変数を含めることができます。
ru: Задает <code><i>file</i></code> в формате <a href="https://tools.ietf.org/html/rfc7517#section-5">набора веб-ключей JSON</a> для проверки подписи JWT. Значение параметра может содержать переменные.
zh_cn: 指定一个 <code><i>file</i></code> 在<a href="https://tools.ietf.org/html/rfc7517#section-5">JSON网络密钥设置</a>格式验证JWT签名。参数值可以包含变量。

source: Specifies a <code><i>file</i></code> that keeps the state of the dynamically configurable group.
ja: 動的に構成可能なグループの状態を保持する <code><i>file</i></code> を指定し<i>ます</i>。
ru: Задает <code><i>file</i></code> котором хранится состояние динамически настраиваемой группы.
zh_cn: 指定一个 <code><i>file</i></code> ，该<i>文件</i>保留动态可配置组的状态。

source: Specifies a <code><i>file</i></code> with DH parameters for DHE ciphers.
ja: DHE暗号のDHパラメータを含む <code><i>file</i></code> を指定し<i>ます</i>。
ru: Задает <code><i>file</i></code> с параметрами DH для шифров DHE.
zh_cn: 为DHE密码指定带有DH参数的 <code><i>file</i></code> 。

source: Specifies a <code><i>file</i></code> with passphrases for <a href="#grpc_ssl_certificate_key">secret keys</a> where each passphrase is specified on a separate line. Passphrases are tried in turn when loading the key.
ja: <a href="#grpc_ssl_certificate_key">秘密鍵の</a>パスフレーズを含む <code><i>file</i></code> を指定し<i>ます</i>。各パスフレーズは別々の行で指定されます。キーをロードするときに、パスフレーズが順番に試されます。
ru: Задает <code><i>file</i></code> с паролями для <a href="#grpc_ssl_certificate_key">секретных ключей,</a> где каждая фраза указывается в отдельной строке. Парольные фразы проверяются по очереди при загрузке ключа.
zh_cn: 指定带有<a href="#grpc_ssl_certificate_key">密钥密钥</a>密码的 <code><i>file</i></code> ，其中每个密码密钥在单独的行上指定。加载密钥时依次尝试使用密码短语。

source: Specifies a <code><i>file</i></code> with passphrases for <a href="#proxy_ssl_certificate_key">secret keys</a> where each passphrase is specified on a separate line. Passphrases are tried in turn when loading the key.
ja: <a href="#proxy_ssl_certificate_key">秘密鍵の</a>パスフレーズを含む <code><i>file</i></code> を指定し<i>ます</i>。各パスフレーズは別々の行で指定されます。キーをロードするときに、パスフレーズが順番に試されます。
ru: Задает <code><i>file</i></code> с паролями для <a href="#proxy_ssl_certificate_key">секретных ключей,</a> где каждая фраза указывается в отдельной строке. Парольные фразы проверяются по очереди при загрузке ключа.
zh_cn: 指定带有<a href="#proxy_ssl_certificate_key">密钥密钥</a>密码的 <code><i>file</i></code> ，其中每个密码密钥在单独的行上指定。加载密钥时依次尝试使用密码短语。

source: Specifies a <code><i>file</i></code> with passphrases for <a href="#ssl_certificate_key">secret keys</a> where each passphrase is specified on a separate line. Passphrases are tried in turn when loading the key.
ja: <a href="#ssl_certificate_key">秘密鍵の</a>パスフレーズを含む <code><i>file</i></code> を指定し<i>ます</i>。各パスフレーズは別々の行で指定されます。キーをロードするときに、パスフレーズが順番に試されます。
ru: Задает <code><i>file</i></code> с паролями для <a href="#ssl_certificate_key">секретных ключей,</a> где каждая фраза указывается в отдельной строке. Парольные фразы проверяются по очереди при загрузке ключа.
zh_cn: 指定带有<a href="#ssl_certificate_key">密钥密钥</a>密码的 <code><i>file</i></code> ，其中每个密码密钥在单独的行上指定。加载密钥时依次尝试使用密码短语。

source: Specifies a <code><i>file</i></code> with passphrases for <a href="#uwsgi_ssl_certificate_key">secret keys</a> where each passphrase is specified on a separate line. Passphrases are tried in turn when loading the key.
ja: <a href="#uwsgi_ssl_certificate_key">秘密鍵の</a>パスフレーズを含む <code><i>file</i></code> を指定し<i>ます</i>。各パスフレーズは別々の行で指定されます。キーをロードするときに、パスフレーズが順番に試されます。
ru: Задает <code><i>file</i></code> с паролями для <a href="#uwsgi_ssl_certificate_key">секретных ключей,</a> где каждая фраза указывается в отдельной строке. Парольные фразы проверяются по очереди при загрузке ключа.
zh_cn: 指定带有<a href="#uwsgi_ssl_certificate_key">密钥密钥</a>密码的 <code><i>file</i></code> ，其中每个密码密钥在单独的行上指定。加载密钥时依次尝试使用密码短语。

source: Specifies a <code><i>file</i></code> with passphrases for <a href="#zone_sync_ssl_certificate_key">secret keys</a> where each passphrase is specified on a separate line. Passphrases are tried in turn when loading the key.
ja: <a href="#zone_sync_ssl_certificate_key">秘密鍵の</a>パスフレーズを含む <code><i>file</i></code> を指定し<i>ます</i>。各パスフレーズは別々の行で指定されます。キーをロードするときに、パスフレーズが順番に試されます。
ru: Задает <code><i>file</i></code> с паролями для <a href="#zone_sync_ssl_certificate_key">секретных ключей,</a> где каждая фраза указывается в отдельной строке. Парольные фразы проверяются по очереди при загрузке ключа.
zh_cn: 指定带有<a href="#zone_sync_ssl_certificate_key">密钥密钥</a>密码的 <code><i>file</i></code> ，其中每个密码密钥在单独的行上指定。加载密钥时依次尝试使用密码短语。

source: Specifies a <code><i>file</i></code> with revoked certificates (CRL) in the PEM format used to <a href="#grpc_ssl_verify">verify</a> the certificate of the gRPC SSL server.
ja: gRPC SSLサーバーの証明書の<a href="#grpc_ssl_verify">検証に</a>使用されるPEM形式の失効した証明書（CRL）を含む <code><i>file</i></code> を指定し<i>ます</i>。
ru: Задает <code><i>file</i></code> с отозванными сертификатами (CRL) в формате PEM, который используется для <a href="#grpc_ssl_verify">проверки</a> сертификата сервера gRPC SSL.
zh_cn: 以PEM格式指定具有已吊销证书（CRL）的 <code><i>file</i></code> ，该<i>文件</i>用于<a href="#grpc_ssl_verify">验证</a> gRPC SSL服务器的证书。

source: Specifies a <code><i>file</i></code> with revoked certificates (CRL) in the PEM format used to <a href="#proxy_ssl_verify">verify</a> the certificate of the proxied HTTPS server.
ja: プロキシされたHTTPSサーバーの証明書を<a href="#proxy_ssl_verify">検証するために</a>使用される、失効した証明書（CRL）をPEM形式で含む <code><i>file</i></code> を指定し<i>ます</i>。
ru: Задает <code><i>file</i></code> с отозванными сертификатами (CRL) в формате PEM, используемый для <a href="#proxy_ssl_verify">проверки</a> сертификата проксируемого HTTPS-сервера.
zh_cn: 指定一个具有PEM格式的吊销证书（CRL）的 <code><i>file</i></code> ，该<i>文件</i>用于<a href="#proxy_ssl_verify">验证</a>代理HTTPS服务器的证书。

source: Specifies a <code><i>file</i></code> with revoked certificates (CRL) in the PEM format used to <a href="#proxy_ssl_verify">verify</a> the certificate of the proxied server.
ja: プロキシされたサーバーの証明書を<a href="#proxy_ssl_verify">検証するために</a>使用されるPEM形式の失効した証明書（CRL）を含む <code><i>file</i></code> を指定し<i>ます</i>。
ru: Задает <code><i>file</i></code> с отозванными сертификатами (CRL) в формате PEM, используемый для <a href="#proxy_ssl_verify">проверки</a> сертификата прокси-сервера.
zh_cn: 指定一个具有PEM格式的吊销证书（CRL）的 <code><i>file</i></code> ，用于<a href="#proxy_ssl_verify">验证</a>代理服务器的证书。

source: Specifies a <code><i>file</i></code> with revoked certificates (CRL) in the PEM format used to <a href="#ssl_verify_client">verify</a> client certificates.
ja: クライアント証明書の<a href="#ssl_verify_client">検証に</a>使用されるPEM形式の失効した証明書（CRL）を含む <code><i>file</i></code> を指定し<i>ます</i>。
ru: Задает <code><i>file</i></code> с отозванными сертификатами (CRL) в формате PEM, используемый для <a href="#ssl_verify_client">проверки</a> клиентских сертификатов.
zh_cn: 指定具有用于<a href="#ssl_verify_client">验证</a>客户端证书的PEM格式的已撤销证书（CRL）的 <code><i>file</i></code> 。

source: Specifies a <code><i>file</i></code> with revoked certificates (CRL) in the PEM format used to <a href="#uwsgi_ssl_verify">verify</a> the certificate of the secured uwsgi server.
ja: 保護されたuwsgiサーバーの証明書を<a href="#uwsgi_ssl_verify">検証するために</a>使用される、失効した証明書（CRL）をPEM形式で含む <code><i>file</i></code> を指定し<i>ます</i>。
ru: Задает <code><i>file</i></code> с отозванными сертификатами (CRL) в формате PEM, используемый для <a href="#uwsgi_ssl_verify">проверки</a> сертификата защищенного сервера uwsgi.
zh_cn: 以PEM格式指定一个带有吊销证书（CRL）的 <code><i>file</i></code> ，用于<a href="#uwsgi_ssl_verify">验证</a>受保护的uwsgi服务器的证书。

source: Specifies a <code><i>file</i></code> with revoked certificates (CRL) in the PEM format used to <a href="#zone_sync_ssl_verify">verify</a> the certificate of another cluster server.
ja: 別のクラスターサーバーの証明書を<a href="#zone_sync_ssl_verify">検証するために</a>使用される、失効した証明書（CRL）をPEM形式で含む <code><i>file</i></code> を指定し<i>ます</i>。
ru: Задает <code><i>file</i></code> с отозванными сертификатами (CRL) в формате PEM, используемый для <a href="#zone_sync_ssl_verify">проверки</a> сертификата другого сервера кластера.
zh_cn: 指定一个具有PEM格式的吊销证书（CRL）的 <code><i>file</i></code> ，该<i>文件</i>用于<a href="#zone_sync_ssl_verify">验证</a>另一台群集服务器的证书。

source: Specifies a <code><i>file</i></code> with the certificate in the PEM format for the given server. If intermediate certificates should be specified in addition to a primary certificate, they should be specified in the same file in the following order: the primary certificate comes first, then the intermediate certificates. A secret key in the PEM format may be placed in the same file.
ja: 指定されたサーバーのPEM形式の証明書を含む <code><i>file</i></code> を指定し<i>ます</i>。プライマリ証明書に加えて中間証明書を指定する必要がある場合は、同じファイルで次の順序で指定する必要があります。最初にプライマリ証明書、次に中間証明書の順になります。PEM形式の秘密鍵は、同じファイルに配置できます。
ru: Задает <code><i>file</i></code> с сертификатом в формате PEM для данного сервера. Если промежуточные сертификаты должны быть указаны в дополнение к первичному сертификату, они должны быть указаны в том же файле в следующем порядке: сначала идет первичный сертификат, затем промежуточные сертификаты. Секретный ключ в формате PEM может быть помещен в тот же файл.
zh_cn: 为给定服务器指定带有PEM格式证书的 <code><i>file</i></code> 。如果除主要证书之外还应指定中间证书，则应按以下顺序在同一文件中指定它们：首先是主要证书，然后是中间证书。PEM格式的密钥可以放在同一文件中。

source: Specifies a <code><i>file</i></code> with the certificate in the PEM format for the given virtual server. If intermediate certificates should be specified in addition to a primary certificate, they should be specified in the same file in the following order: the primary certificate comes first, then the intermediate certificates. A secret key in the PEM format may be placed in the same file.
ja: 指定された仮想サーバーのPEM形式の証明書を含む <code><i>file</i></code> を指定し<i>ます</i>。プライマリ証明書に加えて中間証明書を指定する必要がある場合は、同じファイルで次の順序で指定する必要があります。プライマリ証明書が最初に、次に中間証明書が最初になります。 PEM形式の秘密鍵を同じファイルに配置できます。
ru: Задает <code><i>file</i></code> с сертификатом в формате PEM для данного виртуального сервера. Если промежуточные сертификаты должны быть указаны в дополнение к первичному сертификату, они должны быть указаны в том же файле в следующем порядке: сначала идет первичный сертификат, затем промежуточные сертификаты. Секретный ключ в формате PEM может быть помещен в тот же файл.
zh_cn: 为给定的虚拟服务器指定一个带有PEM格式的证书的 <code><i>file</i></code> 。如果除主要证书之外还应指定中间证书，则应按以下顺序在同一文件中指定它们：首先是主要证书，然后是中间证书。 PEM格式的密钥可以放置在同一文件中。

source: Specifies a <code><i>file</i></code> with the certificate in the PEM format used for authentication to a gRPC SSL server.
ja: gRPC SSLサーバーへの認証に使用されるPEM形式の証明書を含む <code><i>file</i></code> を指定し<i>ます</i>。
ru: Задает <code><i>file</i></code> с сертификатом в формате PEM, который используется для аутентификации на сервере SSL gRPC.
zh_cn: 指定带有PEM格式的证书的 <code><i>file</i></code> ，用于对gRPC SSL服务器进行身份验证。

source: Specifies a <code><i>file</i></code> with the certificate in the PEM format used for authentication to a proxied HTTPS server.
ja: プロキシされたHTTPSサーバーへの認証に使用されるPEM形式の証明書を含む <code><i>file</i></code> を指定し<i>ます</i>。
ru: Задает <code><i>file</i></code> с сертификатом в формате PEM, который используется для аутентификации на прокси-сервере HTTPS.
zh_cn: 指定带有PEM格式的证书的 <code><i>file</i></code> ，用于对代理HTTPS服务器进行身份验证。

source: Specifies a <code><i>file</i></code> with the certificate in the PEM format used for authentication to a proxied server.
ja: プロキシサーバーへの認証に使用されるPEM形式の証明書を含む <code><i>file</i></code> を指定し<i>ます</i>。
ru: Задает <code><i>file</i></code> с сертификатом в формате PEM, который используется для аутентификации на прокси-сервере.
zh_cn: 指定带有PEM格式的证书的 <code><i>file</i></code> ，用于对代理服务器进行身份验证。

source: Specifies a <code><i>file</i></code> with the certificate in the PEM format used for authentication to a secured uwsgi server.
ja: 保護されたuwsgiサーバーへの認証に使用されるPEM形式の証明書を含む <code><i>file</i></code> を指定し<i>ます</i>。
ru: Задает <code><i>file</i></code> с сертификатом в формате PEM, который используется для аутентификации на защищенном сервере uwsgi.
zh_cn: 指定带有PEM格式的证书的 <code><i>file</i></code> ，用于对受保护的uwsgi服务器进行身份验证。

source: Specifies a <code><i>file</i></code> with the certificate in the PEM format used for authentication to another cluster server.
ja: 別のクラスターサーバーへの認証に使用されるPEM形式の証明書を含む <code><i>file</i></code> を指定し<i>ます</i>。
ru: Задает <code><i>file</i></code> с сертификатом в формате PEM, используемый для аутентификации на другом сервере кластера.
zh_cn: 指定带有PEM格式的证书的 <code><i>file</i></code> ，用于对另一台群集服务器进行身份验证。

source: Specifies a <code><i>file</i></code> with the secret key in the PEM format for the given server.
ja: 特定のサーバーのPEM形式の秘密鍵を含む <code><i>file</i></code> を指定し<i>ます</i>。
ru: Задает <code><i>file</i></code> с секретным ключом в формате PEM для данного сервера.
zh_cn: 指定具有给定服务器的PEM格式的密钥的 <code><i>file</i></code> 。

source: Specifies a <code><i>file</i></code> with the secret key in the PEM format for the given virtual server.
ja: 特定の仮想サーバーのPEM形式の秘密鍵を含む <code><i>file</i></code> を指定し<i>ます</i>。
ru: Задает <code><i>file</i></code> с секретным ключом в формате PEM для данного виртуального сервера.
zh_cn: 为给定的虚拟服务器指定一个具有PEM格式的密钥的 <code><i>file</i></code> 。

source: Specifies a <code><i>file</i></code> with the secret key in the PEM format used for authentication to a gRPC SSL server.
ja: gRPC SSLサーバーへの認証に使用されるPEM形式の秘密鍵を含む <code><i>file</i></code> を指定し<i>ます</i>。
ru: Задает <code><i>file</i></code> с секретным ключом в формате PEM, используемый для аутентификации на сервере gRPC SSL.
zh_cn: 指定带有PEM格式的私钥的 <code><i>file</i></code> ，用于对gRPC SSL服务器进行身份验证。

source: Specifies a <code><i>file</i></code> with the secret key in the PEM format used for authentication to a proxied HTTPS server.
ja: プロキシされたHTTPSサーバーへの認証に使用されるPEM形式の秘密鍵を含む <code><i>file</i></code> を指定し<i>ます</i>。
ru: Задает <code><i>file</i></code> с секретным ключом в формате PEM, используемый для аутентификации на прокси-сервере HTTPS.
zh_cn: 指定带有PEM格式的密钥的 <code><i>file</i></code> ，用于对代理HTTPS服务器进行身份验证。

source: Specifies a <code><i>file</i></code> with the secret key in the PEM format used for authentication to a proxied server.
ja: プロキシサーバーへの認証に使用されるPEM形式の秘密鍵を含む <code><i>file</i></code> を指定し<i>ます</i>。
ru: Задает <code><i>file</i></code> с секретным ключом в формате PEM, используемый для аутентификации на прокси-сервере.
zh_cn: 指定带有PEM格式的私钥的 <code><i>file</i></code> ，用于对代理服务器进行身份验证。

source: Specifies a <code><i>file</i></code> with the secret key in the PEM format used for authentication to a secured uwsgi server.
ja: 保護されたuwsgiサーバーへの認証に使用されるPEM形式の秘密鍵を含む <code><i>file</i></code> を指定し<i>ます</i>。
ru: Задает <code><i>file</i></code> с секретным ключом в формате PEM, используемый для аутентификации на защищенном сервере uwsgi.
zh_cn: 用PEM格式指定带有密钥的 <code><i>file</i></code> ，用于对安全的uwsgi服务器进行身份验证。

source: Specifies a <code><i>file</i></code> with the secret key in the PEM format used for authentication to another cluster server.
ja: 別のクラスターサーバーへの認証に使用されるPEM形式の秘密キーを含む <code><i>file</i></code> を指定し<i>ます</i>。
ru: Задает <code><i>file</i></code> с секретным ключом в формате PEM, используемый для аутентификации на другом сервере кластера.
zh_cn: 指定带有PEM格式的密钥的 <code><i>file</i></code> ，用于对另一台群集服务器进行身份验证。

source: Specifies a <code><i>file</i></code> with trusted CA certificates in the PEM format used to <a href="#grpc_ssl_verify">verify</a> the certificate of the gRPC SSL server.
ja: gRPC SSLサーバーの証明書を<a href="#grpc_ssl_verify">検証するために</a>使用されるPEM形式の信頼できるCA証明書を含む <code><i>file</i></code> を指定し<i>ます</i>。
ru: Задает <code><i>file</i></code> с доверенными сертификатами CA в формате PEM, который используется для <a href="#grpc_ssl_verify">проверки</a> сертификата сервера gRPC SSL.
zh_cn: 指定一个带有PEM格式的受信任CA证书的 <code><i>file</i></code> ，该证书用于<a href="#grpc_ssl_verify">验证</a> gRPC SSL服务器的证书。

source: Specifies a <code><i>file</i></code> with trusted CA certificates in the PEM format used to <a href="#proxy_ssl_verify">verify</a> the certificate of the proxied HTTPS server.
ja: プロキシされたHTTPSサーバーの証明書を<a href="#proxy_ssl_verify">検証するために</a>使用されるPEM形式の信頼できるCA証明書を含む <code><i>file</i></code> を指定し<i>ます</i>。
ru: Задает <code><i>file</i></code> с доверенными сертификатами CA в формате PEM, который используется для <a href="#proxy_ssl_verify">проверки</a> сертификата прокси-сервера HTTPS.
zh_cn: 指定带有PEM格式的受信任CA证书的 <code><i>file</i></code> ，该证书用于<a href="#proxy_ssl_verify">验证</a>代理HTTPS服务器的证书。
