Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/nginx/nginx.*.004.xlf
Languages: es, ja, ko, ru, zh_cn

source: When issuing or altering a stream of buffers, it's often desirable to reuse the allocated buffers. A standard and widely adopted approach in nginx code is to keep two buffer chains for this purpose: <code>free</code> and <code>busy</code>. The <code>free</code> chain keeps all free buffers, which can be reused. The <code>busy</code> chain keeps all buffers sent by the current module that are still in use by some other filter handler. A buffer is considered in use if its size is greater than zero. Normally, when a buffer is consumed by a filter, its <code>pos</code> (or <code>file_pos</code> for a file buffer) is moved towards <code>last</code> (<code>file_last</code> for a file buffer). Once a buffer is completely consumed, it's ready to be reused. To add newly freed buffers to the <code>free</code> chain it's enough to iterate over the <code>busy</code> chain and move the zero size buffers at the head of it to <code>free</code>. This operation is so common that there is a special function for it, <code>ngx_chain_update_chains(free, busy, out, tag)</code>. The function appends the output chain <code>out</code> to <code>busy</code> and moves free buffers from the top of <code>busy</code> to <code>free</code>. Only the buffers with the specified <code>tag</code> are reused. This lets a module reuse only the buffers that it allocated itself.
es: Al emitir o alterar un flujo de b&uacute;feres, a menudo es deseable reutilizar los b&uacute;feres asignados. Un enfoque est&aacute;ndar y ampliamente adoptado en el c&oacute;digo nginx es mantener dos cadenas de b&uacute;fer para este prop&oacute;sito: <code>free</code> y <code>busy</code> . La cadena <code>free</code> mantiene todos los b&uacute;feres libres, que se pueden reutilizar. La cadena <code>busy</code> mantiene todos los b&uacute;feres enviados por el m&oacute;dulo actual que todav&iacute;a est&aacute;n en uso por alg&uacute;n otro controlador de filtro. Un b&uacute;fer se considera en uso si su tama&ntilde;o es mayor que cero. Normalmente, cuando un filtro consume un b&uacute;fer, su <code>pos</code> (o <code>file_pos</code> para un b&uacute;fer de archivo) se mueve hacia el <code>last</code> ( <code>file_last</code> para un b&uacute;fer de archivo). Una vez que un b&uacute;fer se consume por completo, est&aacute; listo para ser reutilizado. Para agregar b&uacute;feres reci&eacute;n liberados a la cadena <code>free</code> , es suficiente iterar sobre la cadena <code>busy</code> y mover los b&uacute;feres de tama&ntilde;o cero en la parte superior para <code>free</code> . Esta operaci&oacute;n es tan com&uacute;n que hay una funci&oacute;n especial para ella, <code>ngx_chain_update_chains(free, busy, out, tag)</code> . La funci&oacute;n agrega la cadena de <code>out</code> a <code>busy</code> y mueve b&uacute;feres libres desde la parte superior de <code>busy</code> a <code>free</code> . Solo se reutilizan los b&uacute;feres con la <code>tag</code> especificada . Esto permite que un m&oacute;dulo reutilice solo los b&uacute;feres que se asign&oacute;.
ko: 버퍼 스트림을 발행하거나 변경할 때 할당 된 버퍼를 재사용하는 것이 바람직합니다. nginx 코드에서 널리 채택 된 표준 접근법은이 목적을 위해 두 개의 버퍼 체인을 유지하는 것입니다 : <code>free</code> 및 <code>busy</code> . 사용 <code>free</code> 체인은 재사용 가능한 모든 사용 가능한 버퍼를 유지합니다. <code>busy</code> 체인 다른 필터 핸들러가 여전히 사용되고 현재 모듈에 의해 전송 된 모든 버퍼를 유지한다. 버퍼 크기가 0보다 큰 경우 사용중인 것으로 간주됩니다. 일반적으로, 버퍼가 필터에 의해 사용될 때 , 그 <code>pos</code> (또는 파일 버퍼에 대한 <code>file_pos</code> )는 <code>last</code> ( <code>file_last</code> )으로 이동합니다파일 버퍼). 버퍼가 완전히 소모되면 재사용 할 수 있습니다. 새로 사용 가능한 버퍼를 사용 <code>free</code> 체인에 추가하려면 사용 <code>busy</code> 체인 을 반복 하고 헤드 크기가 0 인 버퍼를 <code>free</code> 로 이동하면 충분합니다 . 이 작업은 너무 일반적이기 때문에 특별한 기능인 <code>ngx_chain_update_chains(free, busy, out, tag)</code> 있습니다. 함수는 출력 체인 추가 <code>out</code> 에 <code>busy</code> 의 상부로부터 이동 가능한 버퍼가 <code>busy</code> 할 <code>free</code> . 지정된 <code>tag</code> 가진 버퍼 만 재사용됩니다. 이를 통해 모듈은 자신이 할당 한 버퍼 만 재사용 할 수 있습니다.

source: When location is specified using a regular expression, and also inside named locations.
es: Cuando la ubicación se especifica usando una expresión regular,y también dentro de las ubicaciones nombradas.
ko: 위치가 정규식을 사용하여 지정되고 이름이 지정된 위치 내부에도 지정됩니다.

source: When location matches the last part of the directive&rsquo;s value:
es: Cuando la ubicaci&oacute;n coincide con la &uacute;ltima parte del valor de la directiva:
ko: 위치가 지시문 값의 마지막 부분과 일치하는 경우 :

source: When nginx has to pass a request to another host for processing, it uses the configured load-balancing method to obtain an address to connect to. The method is obtained from the <code>ngx_http_upstream_t.peer</code> object of type <code>ngx_peer_connection_t</code>:
es: Cuando nginx tiene que pasar una solicitud a otro host para su procesamiento, utiliza el m&eacute;todo de equilibrio de carga configurado para obtener una direcci&oacute;n a la que conectarse. El m&eacute;todo se obtiene del objeto <code>ngx_http_upstream_t.peer</code> de tipo <code>ngx_peer_connection_t</code> :
ko: nginx는 처리를 위해 요청을 다른 호스트로 전달해야 할 경우 구성된로드 밸런싱 방법을 사용하여 연결할 주소를 얻습니다. 이 메소드는 <code>ngx_http_upstream_t.peer</code> 유형 의 ngx_http_upstream_t.peer 객체에서 <code>ngx_peer_connection_t</code> .

source: When nginx selects a <code>location</code> block to serve a request it first checks <a href="http/ngx_http_core_module#location">location</a> directives that specify prefixes, remembering <code>location</code> with the longest prefix, and then checks regular expressions. If there is a match with a regular expression, nginx picks this <code>location</code> or, otherwise, it picks the one remembered earlier.
es: Cuando nginx selecciona un bloque de <code>location</code> para atender una solicitud, primero verifica las directivas de <a href="http/ngx_http_core_module#location">ubicaci&oacute;n</a> que especifican prefijos, recuerda la <code>location</code> con el prefijo m&aacute;s largo y luego verifica las expresiones regulares. Si hay una coincidencia con una expresi&oacute;n regular, nginx elige esta <code>location</code> o, de lo contrario, elige la recordada anteriormente.
ko: nginx는 요청을 처리하기 위해 <code>location</code> 블록을 선택할 때 먼저 접두사를 지정하는 <a href="http/ngx_http_core_module#location">위치</a> 지시문을 확인 하고 가장 긴 접두사를 가진 <code>location</code> 를 기억 한 다음 정규식을 확인합니다. 정규식과 일치하는 경우 nginx는이 <code>location</code> 선택 하거나 그렇지 않으면 이전에 기억 된 위치를 선택합니다.

source: When searching for a virtual server by name, if name matches more than one of the specified variants, e.g. both wildcard name and regular expression match, the first matching variant will be chosen, in the following order of precedence:
es: Al buscar un servidor virtual por nombre,si el nombre coincide con más de una de las variantes especificadas,por ejemplo,tanto el nombre del comodín como la expresión regular coinciden,se elegirá la primera variante coincidente,en el siguiente orden de precedencia:
ko: 이름으로 가상 서버를 검색 할 때 이름이 지정된 변형 중 하나 이상 (예 : 와일드 카드 이름 및 정규식 일치)과 일치하는 경우 첫 번째 일치 변형이 다음 우선 순위에 따라 선택됩니다.

source: When set to a non-zero value, limits the amount of data that can be transferred in a single <code>sendfile()</code> call. Without the limit, one fast connection may seize the worker process entirely.
es: Cuando se establece en un valor distinto de cero, limita la cantidad de datos que se pueden transferir en una sola llamada a <code>sendfile()</code> . Sin el l&iacute;mite, una conexi&oacute;n r&aacute;pida puede apoderarse del proceso de trabajo por completo.
ko: 0이 아닌 값으로 설정하면 단일 <code>sendfile()</code> 호출 에서 전송할 수있는 데이터의 양이 제한 됩니다. 제한이 없으면 하나의 빠른 연결로 작업자 프로세스가 완전히 중단 될 수 있습니다.

source: When set to the value <code>on</code>, temporary files are not removed after request processing.
es: Cuando se establece en el valor <code>on</code> los archivos temporales no se quitan despu&eacute;s de procesamiento de solicitudes.
ko: <code>on</code> 값 으로 설정하면 요청 처리 후에 임시 파일이 제거되지 않습니다.

source: When set, the stapled OCSP response will be taken from the specified <code><i>file</i></code> instead of querying the OCSP responder specified in the server certificate.
es: Cuando se establece, la respuesta OCSP grapada se tomar&aacute; del <code><i>file</i></code> especificado en lugar de consultar al respondedor OCSP especificado en el certificado del servidor.
ko: 설정되면 스테이플 된 OCSP 응답은 서버 인증서에 지정된 OCSP 응답자를 조회하는 대신 지정된 <code><i>file</i></code> 에서 가져옵니다 .

source: When setting up load balancing for FastCGI, uwsgi, SCGI, memcached, or gRPC, use <a href="ngx_http_fastcgi_module#fastcgi_pass">fastcgi_pass</a>, <a href="ngx_http_uwsgi_module#uwsgi_pass">uwsgi_pass</a>, <a href="ngx_http_scgi_module#scgi_pass">scgi_pass</a>, <a href="ngx_http_memcached_module#memcached_pass">memcached_pass</a>, and <a href="ngx_http_grpc_module#grpc_pass">grpc_pass</a> directives respectively.
es: Al configurar el equilibrio de carga para FastCGI, uwsgi, SCGI, memcached o gRPC, use las <a href="ngx_http_fastcgi_module#fastcgi_pass">directivas fastcgi_pass</a> , <a href="ngx_http_uwsgi_module#uwsgi_pass">uwsgi_pass</a> , <a href="ngx_http_scgi_module#scgi_pass">scgi_pass</a> , <a href="ngx_http_memcached_module#memcached_pass">memcached_pass</a> y <a href="ngx_http_grpc_module#grpc_pass">grpc_pass</a> respectivamente.
ko: FastCGI, uwsgi, SCGI, memcached 또는 gRPC에 대한로드 밸런싱을 설정할 때는 각각 <a href="ngx_http_fastcgi_module#fastcgi_pass">fastcgi_pass</a> , <a href="ngx_http_uwsgi_module#uwsgi_pass">uwsgi_pass</a> , <a href="ngx_http_scgi_module#scgi_pass">scgi_pass</a> , <a href="ngx_http_memcached_module#memcached_pass">memcached_pass</a> 및 <a href="ngx_http_grpc_module#grpc_pass">grpc_pass</a> 지시문을 사용하십시오.

source: When several <code>limit_conn</code> directives are specified, any configured limit will apply.
es: Cuando se especifican varias directivas <code>limit_conn</code> , se aplicar&aacute; cualquier l&iacute;mite configurado.
ko: 여러 <code>limit_conn</code> 지시문이 지정되면 구성된 제한이 적용됩니다.

source: When testing configurations with <a href="#sni">SNI</a>, it is important to specify the <code>-servername</code> option as <code>openssl</code> does not use SNI by default.
es: Al probar configuraciones con <a href="#sni">SNI</a> , es importante especificar la opci&oacute;n <code>-servername</code> ya que <code>openssl</code> no usa SNI por defecto.
ko: <a href="#sni">SNI</a> 를 사용하여 구성을 테스트 할 때는 <code>openssl</code> 이 기본적으로 SNI를 사용하지 않으므로 <code>-servername</code> 옵션 을 지정해야합니다 .

source: When the <a href="ngx_http_upstream_module#server">weight</a> parameter is specified for a server, the weight is accounted as part of the load balancing decision.
es: Cuando se especifica el par&aacute;metro de <a href="ngx_http_upstream_module#server">peso</a> para un servidor, el peso se contabiliza como parte de la decisi&oacute;n de equilibrio de carga.
ko: 때 <a href="ngx_http_upstream_module#server">가중치</a> 파라미터 서버에 지정되어, 중량은 부하 분산 결정의 일부를 차지한다.

source: When the <code>cookie</code> method is used, information about the designated server is passed in an HTTP cookie generated by nginx:
es: Cuando se utiliza el m&eacute;todo de <code>cookie</code> s , la informaci&oacute;n sobre el servidor designado se pasa en una cookie HTTP generada por nginx:
ko: 때 <code>cookie</code> 방법을 사용, 지정된 서버에 대한 정보의 nginx에 의해 생성 된 HTTP 쿠키에 전달됩니다 :

source: When the <code>learn</code> method (1.7.1) is used, nginx analyzes upstream server responses and learns server-initiated sessions usually passed in an HTTP cookie.
es: Cuando se usa el m&eacute;todo de <code>learn</code> (1.7.1), nginx analiza las respuestas del servidor ascendente y aprende las sesiones iniciadas por el servidor que generalmente se pasan en una cookie HTTP.
ko: (가) 때 <code>learn</code> 방법 (1.7.1)을 사용, nginx를 분석 업스트림 서버 응답 및 배운다 일반적으로 HTTP 쿠키 전달 서버 시작 세션을.

source: When the <code>route</code> method is used, proxied server assigns client a route on receipt of the first request. All subsequent requests from this client will carry routing information in a cookie or URI. This information is compared with the &ldquo;<code>route</code>&rdquo; parameter of the <a href="#server">server</a> directive to identify the server to which the request should be proxied. If the &ldquo;<code>route</code>&rdquo; parameter is not specified, the route name will be a hexadecimal representation of the MD5 hash of the IP address and port, or of the UNIX-domain socket path. If the designated server cannot process a request, the new server is selected by the configured balancing method as if there is no routing information in the request.
es: Cuando se utiliza el m&eacute;todo de <code>route</code> , el servidor proxy asigna al cliente una ruta al recibir la primera solicitud. Todas las solicitudes posteriores de este cliente llevar&aacute;n informaci&oacute;n de enrutamiento en una cookie o URI. Esta informaci&oacute;n se compara con el par&aacute;metro " <code>route</code> " de la directiva del <a href="#server">servidor</a> para identificar el servidor al que se debe enviar la solicitud. Si no se especifica el par&aacute;metro " <code>route</code> ", el nombre de la ruta ser&aacute; una representaci&oacute;n hexadecimal del hash MD5 de la direcci&oacute;n IP y el puerto, o de la ruta del socket del dominio UNIX. Si el servidor designado no puede procesar una solicitud, el nuevo servidor se selecciona mediante el m&eacute;todo de equilibrio configurado como si no hubiera informaci&oacute;n de enrutamiento en la solicitud.
ko: 때 <code>route</code> 방법을 사용, 서버 양수인 클라이언트에게 첫 번째 요청의 수신에 경로를 프록시. 이 클라이언트의 모든 후속 요청은 쿠키 또는 URI로 라우팅 정보를 전달합니다. 이 정보는 <a href="#server">서버</a> 지정 문의 " <code>route</code> "매개 변수 와 비교 하여 요청을 프록시해야하는 서버를 식별합니다. " <code>route</code> "매개 변수를 지정하지 않으면 경로 이름은 IP 주소 및 포트의 MD5 해시 또는 UNIX 도메인 소켓 경로의 16 진 표현입니다. 지정된 서버가 요청을 처리 할 수없는 경우 요청에 라우팅 정보가없는 것처럼 구성된 밸런싱 방법으로 새 ​​서버가 선택됩니다.

source: When the APOP or CRAM-MD5 are used, request-response will look as follows:
es: Cuando se usan el APOP o el CRAM-MD5,la solicitud-respuesta se verá de la siguiente manera:
ko: APOP 또는 CRAM-MD5를 사용하는 경우 요청-응답은 다음과 같습니다.

source: When the JSONP format is used, the name of a callback function is set with the <code>callback</code> request argument. If the argument is missing or has an empty value, then the JSON format is used.
es: Cuando se usa el formato JSONP, el nombre de una funci&oacute;n de devoluci&oacute;n de llamada se establece con el argumento de solicitud de <code>callback</code> . Si falta el argumento o tiene un valor vac&iacute;o, se utiliza el formato JSON.
ko: JSONP 형식을 사용하는 경우 콜백 함수의 이름은 <code>callback</code> 요청 인수로 설정됩니다 . 인수가 누락되었거나 값이 비어 있으면 JSON 형식이 사용됩니다.

source: When the URI is changed inside a proxied location using the <a href="ngx_http_rewrite_module#rewrite">rewrite</a> directive, and this same configuration will be used to process a request (<code>break</code>):
es: Cuando se cambia el URI dentro de una ubicaci&oacute;n proxy usando la directiva de <a href="ngx_http_rewrite_module#rewrite">reescritura</a> , y esta misma configuraci&oacute;n se usar&aacute; para procesar una solicitud ( <code>break</code> ):
ko: <a href="ngx_http_rewrite_module#rewrite">rewrite</a> 지시문을 사용하여 프록시 위치 내에서 URI가 변경되면 동일한 구성이 요청을 처리하는 데 사용됩니다 ( <code>break</code> ).

source: When the client certificate was present, its details are passed in the following request headers: &ldquo;Auth-SSL-Subject&rdquo;, &ldquo;Auth-SSL-Issuer&rdquo;, &ldquo;Auth-SSL-Serial&rdquo;, and &ldquo;Auth-SSL-Fingerprint&rdquo;. If <a href="#auth_http_pass_client_cert">auth_http_pass_client_cert</a> is enabled, the certificate itself is passed in the &ldquo;Auth-SSL-Cert&rdquo; header. The request will look as follows:
es: Cuando el certificado de cliente estaba presente, sus detalles se pasan en los siguientes encabezados de solicitud: &ldquo;Auth-SSL-Subject&rdquo;, &ldquo;Auth-SSL-Issuer&rdquo;, &ldquo;Auth-SSL-Serial&rdquo; y &ldquo;Auth-SSL-Fingerprint&rdquo;. Si <a href="#auth_http_pass_client_cert">auth_http_pass_client_cert</a> est&aacute; habilitado, el certificado en s&iacute; se pasa en el encabezado "Auth-SSL-Cert". La solicitud tendr&aacute; el siguiente aspecto:
ko: 클라이언트 인증서가 있으면 세부 정보는 "Auth-SSL-Subject", "Auth-SSL-Issuer", "Auth-SSL-Serial"및 "Auth-SSL-Fingerprint"요청 헤더에 전달됩니다. 경우 <a href="#auth_http_pass_client_cert">auth_http_pass_client_cert가</a> 활성화되어, 인증서 자체는 "인증-SSL-CERT는"헤더에 전달됩니다. 요청은 다음과 같습니다.

source: When the hash is built, use the <code>ngx_hash_find(hash, key, name, len)</code> function to look up elements:
es: Cuando se <code>ngx_hash_find(hash, key, name, len)</code> el hash, use la funci&oacute;n ngx_hash_find (hash, key, name, len) para buscar elementos:
ko: 해시가 빌드되면 <code>ngx_hash_find(hash, key, name, len)</code> 함수를 사용하여 요소를 찾아보십시오.

source: When using <a href="http/ngx_http_core_module#aio">aio</a> with the <a href="events#epoll">epoll</a> connection processing method, sets the maximum <code><i>number</i></code> of outstanding asynchronous I/O operations for a single worker process.
es: Cuando se utiliza <a href="http/ngx_http_core_module#aio">aio</a> con el m&eacute;todo de procesamiento de conexi&oacute;n <a href="events#epoll">epoll</a> , establece el <code><i>number</i></code> m&aacute;ximo de operaciones de E / S as&iacute;ncronas pendientes para un solo proceso de trabajo.
ko: <a href="events#epoll">epoll</a> 연결 처리 방법으로 <a href="http/ngx_http_core_module#aio">aio</a> 를 사용 하는 경우 단일 작업자 프로세스에 대해 최대 비동기 처리 I / O 작업 <code><i>number</i></code> 를 설정하십시오 .<i></i>

source: When using OpenSSL 1.0.2 or higher, it is possible to specify multiple curves (1.11.0), for example:
es: Cuando se utiliza OpenSSL 1.0.2 o superior,es posible especificar múltiples curvas (1.11.0),por ejemplo:
ko: OpenSSL 1.0.2 이상을 사용하는 경우 다음과 같이 여러 곡선 (1.11.0)을 지정할 수 있습니다.

source: When using load balancer methods other than the default round-robin method, it is necessary to activate them before the <code>keepalive</code> directive.
es: Cuando se utilizan m&eacute;todos de equilibrador de carga distintos del m&eacute;todo de operaci&oacute;n por turnos predeterminado, es necesario activarlos antes de la directiva <code>keepalive</code> .
ko: 기본 라운드 로빈 방법 이외의로드 밸런서 방법을 사용하는 경우 <code>keepalive</code> 지시문 전에 활성화해야 합니다.

source: When using load balancer methods other than the default round-robin method, it is necessary to activate them before the <code>ntlm</code> directive.
es: Cuando se utilizan m&eacute;todos de equilibrador de carga distintos del m&eacute;todo round robin predeterminado, es necesario activarlos antes de la directiva <code>ntlm</code> .
ko: 기본 라운드 로빈 방법 이외의로드 밸런서 방법을 사용하는 경우 <code>ntlm</code> 지시문 전에 활성화해야 합니다.

source: When using load balancer methods other than the default round-robin method, it is necessary to activate them before the <code>queue</code> directive.
es: Cuando se utilizan m&eacute;todos de equilibrador de carga distintos del m&eacute;todo de operaci&oacute;n por turnos predeterminado, es necesario activarlos antes de la directiva de <code>queue</code> .
ko: 기본 라운드 로빈 방법 이외의로드 밸런서 방법을 사용하는 경우 <code>queue</code> 지시문 전에 활성화해야 합니다.

source: When using the <a href="#fastcgi_split_path_info">fastcgi_split_path_info</a> directive, the <code>$fastcgi_script_name</code> variable equals the value of the first capture set by the directive.
es: Cuando se usa la directiva <a href="#fastcgi_split_path_info">fastcgi_split_path_info</a> , la variable <code>$fastcgi_script_name</code> es igual al valor de la primera captura establecida por la directiva.
ko: <a href="#fastcgi_split_path_info">fastcgi_split_path_info</a> 지시문을 사용할 때 <code>$fastcgi_script_name</code> 변수는 지시문이 설정 한 첫 번째 캡처 값과 같습니다.

source: When using the SSL/TLS protocol, compressed responses may be subject to <a href="https://en.wikipedia.org/wiki/BREACH">BREACH</a> attacks.
es: Cuando se utiliza el protocolo SSL / TLS, las respuestas comprimidas pueden estar sujetas a ataques <a href="https://en.wikipedia.org/wiki/BREACH">BREACH</a> .
ko: SSL / TLS 프로토콜을 사용할 때 압축 된 응답은 <a href="https://en.wikipedia.org/wiki/BREACH">BREACH</a> 공격을 받을 수 있습니다 .

source: When using the databases with IPv6 support (1.3.12, 1.2.7), IPv4 addresses are looked up as IPv4-mapped IPv6 addresses.
es: Cuando se utilizan las bases de datos con soporte IPv6 (1.3.12,1.2.7),las direcciones IPv4 son buscadas como direcciones IPv6 mapeadas en IPv4.
ko: IPv6을 지원하는 데이터베이스 (1.3.12, 1.2.7)를 사용하는 경우 IPv4 주소는 IPv4 매핑 된 IPv6 주소로 조회됩니다.

source: When using the databases with IPv6 support, IPv4 addresses are looked up as IPv4-mapped IPv6 addresses.
es: Cuando se usan las bases de datos con soporte IPv6,las direcciones IPv4 se buscan como direcciones IPv6 mapeadas.
ko: IPv6을 지원하는 데이터베이스를 사용하는 경우 IPv4 주소는 IPv4 매핑 된 IPv6 주소로 조회됩니다.

source: When variables are used in <code>proxy_pass</code>:
es: Cuando se utilizan variables en <code>proxy_pass</code> :
ko: <code>proxy_pass</code> 에서 변수를 사용하는 경우 :

source: Rate limit can also be set in the &ldquo;X-Accel-Limit-Rate&rdquo; header field of a proxied server response. This capability can be disabled using the <a href="ngx_http_proxy_module#proxy_ignore_headers">proxy_ignore_headers</a>, <a href="ngx_http_fastcgi_module#fastcgi_ignore_headers">fastcgi_ignore_headers</a>, <a href="ngx_http_uwsgi_module#uwsgi_ignore_headers">uwsgi_ignore_headers</a>, and <a href="ngx_http_scgi_module#scgi_ignore_headers">scgi_ignore_headers</a> directives.
ja: レート制限は、プロキシされたサーバー応答の「X-Accel-Limit-Rate」ヘッダーフィールドでも設定できます。この機能は、<a href="ngx_http_proxy_module#proxy_ignore_headers">proxy_ignore_headers</a>、<a href="ngx_http_fastcgi_module#fastcgi_ignore_headers">fastcgi_ignore_headers</a>、<a href="ngx_http_uwsgi_module#uwsgi_ignore_headers">uwsgi_ignore_headers</a>、および<a href="ngx_http_scgi_module#scgi_ignore_headers">scgi_ignore_headers</a>ディレクティブを使用して無効にできます。
zh_cn: 速率限制也可以在代理服务器响应的&ldquo; X-Accel-Limit-Rate&rdquo;标头字段中设置。可以使用<a href="ngx_http_proxy_module#proxy_ignore_headers">proxy_ignore_headers</a>，<a href="ngx_http_fastcgi_module#fastcgi_ignore_headers">fastcgi_ignore_headers</a>，<a href="ngx_http_uwsgi_module#uwsgi_ignore_headers">uwsgi_ignore_headers</a>和<a href="ngx_http_scgi_module#scgi_ignore_headers">scgi_ignore_headers</a>指令禁用此功能。

source: Rate limit can also be set in the <a href="#var_limit_rate"><code>$limit_rate</code></a> variable, however, since version 1.17.0, this method is not recommended:
ja: レート制限は<a href="#var_limit_rate"> <code>$limit_rate</code> </a>変数で設定することもできますが、バージョン1.17.0以降、このメソッドはお勧めできません。
zh_cn: 也可以在<a href="#var_limit_rate"> <code>$limit_rate</code> </a>变量中设置速率限制，但是，从版本1.17.0开始，不建议使用此方法：

source: Read and send file operations are offloaded to threads of the specified <a href="../ngx_core_module#thread_pool">pool</a>. If the pool name is omitted, the pool with the name &ldquo;<code>default</code>&rdquo; is used. The pool name can also be set with variables:
ja: ファイルの読み取りおよび送信操作は、指定された<a href="../ngx_core_module#thread_pool">プールの</a>スレッドにオフロードされます。プール名を省略すると、「 <code>default</code> 」という名前のプールが使用されます。プール名は変数で設定することもできます：
zh_cn: 读取和发送文件操作被卸载到指定<a href="../ngx_core_module#thread_pool">池的</a>线程中。如果省略池名称，则使用名称为&ldquo; <code>default</code> &rdquo; 的池。池名称也可以使用变量设置：

source: Reading initial bytes of data into the <a href="ngx_stream_core_module#preread_buffer_size">preread buffer</a> to allow modules such as <a href="ngx_stream_ssl_preread_module">ngx_stream_ssl_preread_module</a> analyze the data before its processing.
ja: <a href="ngx_stream_ssl_preread_module">ngx_stream_ssl_preread_module</a>などのモジュールがデータを処理前に分析できるように、データの最初のバイトを<a href="ngx_stream_core_module#preread_buffer_size">先読みバッファー</a>に読み取ります。
zh_cn: 将数据的初始字节读取到<a href="ngx_stream_core_module#preread_buffer_size">预读缓冲区中，</a>以允许诸如<a href="ngx_stream_ssl_preread_module">ngx_stream_ssl_preread_module之类的</a>模块在处理数据之前对其进行分析。
