Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/nginx/nginx.*.004.xlf
Languages: es, ja, ko, ru, zh_cn

source: Sets the URL of the HTTP authentication server. The protocol is described <a href="#protocol">below</a>.
ja: HTTP認証サーバーのURLを設定します。プロトコルは<a href="#protocol">以下に</a>説明されています。
ru: Устанавливает URL-адрес сервера аутентификации HTTP. Протокол описан <a href="#protocol">ниже</a> .
zh_cn: 设置HTTP认证服务器的URL。协议描述<a href="#protocol">如下</a>。

source: Sets the address of a FastCGI server. The address can be specified as a domain name or IP address, and a port:
ja: FastCGI サーバーのアドレスを設定します。アドレスは、ドメイン名または IP アドレス、ポートを指定できます。
ru: Устанавливает адрес сервера FastCGI.Адрес может быть указан в качестве доменного имени или IP-адреса,а также порта:
zh_cn: 设置FastCGI服务器的地址。该地址可以指定为域名或IP地址以及端口。

source: Sets the address of a proxied server. The address can be specified as a domain name or IP address, and a port:
ja: プロキシされたサーバーのアドレスを設定します。アドレスは、ドメイン名またはIPアドレス、ポートを指定できます。
ru: Устанавливает адрес прокси-сервера.Адрес может быть указан в виде доменного имени или IP-адреса,а также порта:
zh_cn: 设置代理服务器的地址。该地址可以指定为域名或 IP 地址以及端口。

source: Sets the address of an SCGI server. The address can be specified as a domain name or IP address, and a port:
ja: SCGI サーバのアドレスを設定します。アドレスはドメイン名または IP アドレス、ポートを指定します。
ru: Устанавливает адрес сервера SCGI.Адрес может быть указан в качестве доменного имени или IP-адреса,а также порта:
zh_cn: 设置SCGI服务器的地址。该地址可以指定为域名或IP地址以及端口。

source: Sets the alignment for <a href="#directio">directio</a>. In most cases, a 512-byte alignment is enough. However, when using XFS under Linux, it needs to be increased to 4K.
ja: <a href="#directio">directio</a>の配置を設定します。ほとんどの場合、512バイトのアライメントで十分です。ただし、LinuxでXFSを使用する場合は、4Kに増やす必要があります。
ru: Устанавливает выравнивание для <a href="#directio">directio</a> . В большинстве случаев достаточно выравнивания по 512 байт. Однако при использовании XFS под Linux его необходимо увеличить до 4K.
zh_cn: 设置<a href="#directio">directio</a>的对齐方式。在大多数情况下，一个512字节的对齐就足够了。但是，在Linux下使用XFS时，需要将其增加到4K。

source: Sets the amount of pre-reading for the kernel when working with file.
ja: ファイルを扱う際のカーネルの事前読み込み量を設定します。
ru: Устанавливает количество предварительных чтений для ядра при работе с файлом.
zh_cn: 设置内核在处理文件时的预读量。

source: Sets the bucket <code><i>size</i></code> for hash tables used by the <a href="#proxy_hide_header">proxy_hide_header</a> and <a href="#proxy_set_header">proxy_set_header</a> directives. The details of setting up hash tables are provided in a separate <a href="../hash">document</a>.
ja: <a href="#proxy_hide_header">proxy_hide_header</a>および<a href="#proxy_set_header">proxy_set_header</a>ディレクティブで使用されるハッシュテーブルのバケット <code><i>size</i></code> を設定します。ハッシュテーブルの設定の詳細は、別の<a href="../hash">ドキュメントに記載</a>されています。
ru: Устанавливает ковшовый <code><i>size</i></code> для хэш - таблиц , используемых <a href="#proxy_hide_header">proxy_hide_header</a> и <a href="#proxy_set_header">proxy_set_header</a> директив. Подробности настройки хэш-таблиц представлены в отдельном <a href="../hash">документе</a> .
zh_cn: 设置<a href="#proxy_hide_header">proxy_hide_header</a>和<a href="#proxy_set_header">proxy_set_header</a>指令使用的哈希表的存储桶 <code><i>size</i></code> 。设置哈希表的详细信息在单独的<a href="../hash">文档</a>中提供。

source: Sets the bucket size for the <a href="#map">map</a> variables hash tables. Default value depends on the processor&rsquo;s cache line size. The details of setting up hash tables are provided in a separate <a href="../hash">document</a>.
ja: <a href="#map">マップ</a>変数のハッシュテーブルのバケットサイズを設定します。デフォルト値は、プロセッサのキャッシュラインサイズによって異なります。ハッシュテーブルの設定の詳細は、別の<a href="../hash">ドキュメントに記載</a>されています。
ru: Устанавливает размер сегмента для хеш-таблиц переменных <a href="#map">карты</a> . Значение по умолчанию зависит от размера строки кэша процессора. Подробности настройки хэш-таблиц представлены в отдельном <a href="../hash">документе</a> .
zh_cn: 设置<a href="#map">地图</a>变量哈希表的存储桶大小。默认值取决于处理器的缓存行大小。设置哈希表的详细信息在单独的<a href="../hash">文档</a>中提供。

source: Sets the bucket size for the server names hash tables. The default value depends on the size of the processor&rsquo;s cache line. The details of setting up hash tables are provided in a separate <a href="../hash">document</a>.
ja: サーバー名ハッシュテーブルのバケットサイズを設定します。デフォルト値は、プロセッサのキャッシュラインのサイズによって異なります。ハッシュテーブルの設定の詳細は、別の<a href="../hash">ドキュメントに記載</a>されています。
ru: Устанавливает размер корзины для хэш-таблиц имен серверов. Значение по умолчанию зависит от размера строки кэша процессора. Подробности настройки хэш-таблиц представлены в отдельном <a href="../hash">документе</a> .
zh_cn: 设置服务器名称哈希表的存储桶大小。默认值取决于处理器的缓存行的大小。设置哈希表的详细信息在单独的<a href="../hash">文档</a>中提供。

source: Sets the bucket size for the types hash tables. The details of setting up hash tables are provided in a separate <a href="../hash">document</a>.
ja: タイプハッシュテーブルのバケットサイズを設定します。ハッシュテーブルの設定の詳細は、別の<a href="../hash">ドキュメントに記載</a>されています。
ru: Устанавливает размер сегмента для хеш-таблиц типов. Подробности настройки хэш-таблиц представлены в отдельном <a href="../hash">документе</a> .
zh_cn: 设置类型哈希表的存储桶大小。设置哈希表的详细信息在单独的<a href="../hash">文档</a>中提供。

source: Sets the bucket size for the valid referers hash tables. The details of setting up hash tables are provided in a separate <a href="../hash">document</a>.
ja: 有効なリファラーハッシュテーブルのバケットサイズを設定します。ハッシュテーブルの設定の詳細は、別の<a href="../hash">ドキュメントに記載</a>されています。
ru: Устанавливает размер корзины для допустимых хэш-таблиц referers. Подробности настройки хэш-таблиц представлены в отдельном <a href="../hash">документе</a> .
zh_cn: 设置有效引荐来源哈希表的存储桶大小。设置哈希表的详细信息在单独的<a href="../hash">文档</a>中提供。

source: Sets the bucket size for the variables hash table. The details of setting up hash tables are provided in a separate <a href="../hash">document</a>.
ja: 変数ハッシュテーブルのバケットサイズを設定します。ハッシュテーブルの設定の詳細は、別の<a href="../hash">ドキュメントに記載</a>されています。
ru: Устанавливает размер корзины для хеш-таблицы переменных. Подробности настройки хэш-таблиц представлены в отдельном <a href="../hash">документе</a> .
zh_cn: 设置变量哈希表的存储桶大小。设置哈希表的详细信息在单独的<a href="../hash">文档</a>中提供。

source: Sets the configuration for a server.
ja: サーバーの構成を設定します。
ru: Устанавливает конфигурацию для сервера.
zh_cn: 设置服务器的配置。

source: Sets the cookie name.
ja: クッキー名を設定します。
ru: Устанавливает имя печенья.
zh_cn: 设置cookie的名称。

source: Sets the desired <code><i>quality</i></code> of the transformed JPEG images. Acceptable values are in the range from 1 to 100. Lesser values usually imply both lower image quality and less data to transfer. The maximum recommended value is 95. Parameter value can contain variables.
ja: 変換後のJPEG画像の望ましい <code><i>quality</i></code> を設定します。許容値の範囲は1〜100です。通常、値が小さいほど、画質が低下し、転送するデータが少なくなります。最大推奨値は95です。パラメーター値には変数を含めることができます。
ru: Устанавливает желаемое <code><i>quality</i></code> преобразованных изображений JPEG. Допустимые значения находятся в диапазоне от 1 до 100. Меньшие значения обычно означают как более низкое качество изображения, так и меньший объем данных для передачи. Максимальное рекомендуемое значение - 95. Значение параметра может содержать переменные.
zh_cn: 设置转换后的JPEG图像的所需 <code><i>quality</i></code> 。可接受的值范围是1到100。较小的值通常意味着较低的图像质量和较少的要传输的数据。推荐的最大值为95。参数值可以包含变量。

source: Sets the desired <code><i>quality</i></code> of the transformed WebP images. Acceptable values are in the range from 1 to 100. Lesser values usually imply both lower image quality and less data to transfer. Parameter value can contain variables.
ja: 変換されたWebP画像の望ましい <code><i>quality</i></code> を設定します。許容値の範囲は1〜100です。通常、値が小さいほど、画質が低下し、転送するデータが少なくなります。パラメータ値には変数を含めることができます。
ru: Устанавливает желаемое <code><i>quality</i></code> преобразованных изображений WebP. Допустимые значения находятся в диапазоне от 1 до 100. Меньшие значения обычно означают как более низкое качество изображения, так и меньший объем данных для передачи. Значение параметра может содержать переменные.
zh_cn: 设置转换后的WebP图像的所需 <code><i>quality</i></code> 。可接受的值范围是1到100。较小的值通常意味着较低的图像质量和较少的要传输的数据。参数值可以包含变量。

source: Sets the desired logging level for cases when the server limits the number of connections.
ja: サーバーが接続数を制限している場合のロギングレベルを設定します。
ru: Устанавливает желаемый уровень протоколирования для случаев,когда сервер ограничивает количество соединений.
zh_cn: 设置服务器限制连接数时的日志级别。

source: Sets the desired logging level for cases when the server refuses to process requests due to rate exceeding, or delays request processing. Logging level for delays is one point less than for refusals; for example, if &ldquo;<code>limit_req_log_level notice</code>&rdquo; is specified, delays are logged with the <code>info</code> level.
ja: レート超過が原因でサーバーが要求の処理を拒否した場合、または要求の処理を遅延させた場合に必要なログレベルを設定します。遅延のログレベルは、拒否のログレベルより1ポイント低くなります。たとえば、「 <code>limit_req_log_level notice</code> 」が指定されている場合、遅延は <code>info</code> レベルで記録されます。
ru: Устанавливает желаемый уровень ведения журнала для случаев, когда сервер отказывается обрабатывать запросы из-за превышения скорости или задерживает обработку запроса. Уровень регистрации задержек на один балл меньше, чем отказов; например, если <code>limit_req_log_level notice</code> &laquo; limit_req_log_level notice &raquo;, задержки регистрируются с <code>info</code> уровнем.
zh_cn: 在服务器由于速率超出而拒绝处理请求或延迟请求处理的情况下，设置所需的日志记录级别。延迟记录比拒绝记录少1分；例如，如果指定了&ldquo; <code>limit_req_log_level notice</code> &rdquo; ，则将延迟与 <code>info</code> 级别一起记录。

source: Sets the duration of one iteration (1.7.12). By default, <code>purger_threshold</code> is set to 50 milliseconds.
ja: 1回の反復の期間を設定します（1.7.12）。デフォルトでは、 <code>purger_threshold</code> は50ミリ秒に設定されています。
ru: Устанавливает продолжительность одной итерации (1.7.12). По умолчанию для <code>purger_threshold</code> установлено значение 50 миллисекунд.
zh_cn: 设置一次迭代的持续时间（1.7.12）。默认情况下， <code>purger_threshold</code> 设置为50毫秒。

source: Sets the format of a directory listing.
ja: ディレクトリ一覧のフォーマットを設定します。
ru: Устанавливает формат списка каталогов.
zh_cn: 设置目录列表的格式。

source: Sets the gRPC server address. The address can be specified as a domain name or IP address, and a port:
ja: gRPC サーバのアドレスを設定します。アドレスは、ドメイン名またはIPアドレス、ポートを指定できます。
ru: Устанавливает адрес сервера gRPC.Адрес может быть указан в виде доменного имени или IP-адреса,а также порта:
zh_cn: 设置 gRPC 服务器地址。该地址可以指定为域名或 IP 地址以及端口。

source: Sets the header compression <code><i>level</i></code> of a response in a range from 1 (fastest, less compression) to 9 (slowest, best compression). The special value 0 turns off the header compression.
ja: 応答のヘッダー圧縮 <code><i>level</i></code> を1（最も速く、より少ない圧縮）から9（最も遅く、最も良い圧縮）の範囲で設定します。特別な値0は、ヘッダー圧縮をオフにします。
ru: Устанавливает <code><i>level</i></code> сжатия заголовка ответа в диапазоне от 1 (самое быстрое, меньшее сжатие) до 9 (самое медленное, наилучшее сжатие). Специальное значение 0 отключает сжатие заголовка.
zh_cn: 将响应的标头压缩 <code><i>level</i></code> 设置为1（最快，压缩更少）到9（最慢，最佳压缩）。特殊值0将关闭标头压缩。

source: Sets the initial <code><i>size</i></code> of the buffer used for processing MP4 and MOV files.
ja: MP4およびMOVファイルの処理に使用されるバッファーの初期 <code><i>size</i></code> を設定します。
ru: Устанавливает начальный <code><i>size</i></code> буфера, используемого для обработки файлов MP4 и MOV.
zh_cn: 设置用于处理MP4和MOV文件的缓冲区的初始 <code><i>size</i></code> 。

source: Sets the initial <code><i>size</i></code> of the buffer used for processing MP4 files.
ja: MP4ファイルの処理に使用されるバッファーの初期 <code><i>size</i></code> を設定します。
ru: Устанавливает начальный <code><i>size</i></code> буфера, используемого для обработки файлов MP4.
zh_cn: 设置用于处理MP4文件的缓冲区的初始 <code><i>size</i></code> 。

source: Sets the initial amount after which the further transmission of a response to a client will be rate limited. Parameter value can contain variables (1.17.0).
ja: クライアントへの応答のさらなる送信がレート制限される最初の量を設定します。パラメータ値には変数を含めることができます(1.17.0)。
ru: Устанавливает начальную сумму,после которой дальнейшая передача ответа клиенту будет ограничена.Значение параметра может содержать переменные (1.17.0).
zh_cn: 设置初始数量,之后向客户端进一步传输响应将受到速率限制。参数值可以包含变量(1.17.0)。

source: Sets the initial amount of media data (measured in playback time) after which the further transmission of the response to a client will be rate limited.
ja: 最初のメディアデータ量(再生時間で測定)を設定し、その後、クライアントへの応答の送信がレート制限されるようにします。
ru: Устанавливает начальный объем медиаданных (измеренный во время воспроизведения),после чего дальнейшая передача ответа клиенту будет ограничена.
zh_cn: 设置媒体数据的初始数量(以播放时间为单位),之后向客户端进一步传输响应将受到速率限制。

source: Sets the maximum <code><i>number</i></code> and <code><i>size</i></code> of buffers that are used for reading and writing data frames.
ja: データフレームの読み取りと書き込みに使用されるバッファの最大 <code><i>number</i></code> と <code><i>size</i></code> を設定します。
ru: Устанавливает максимальное <code><i>number</i></code> и <code><i>size</i></code> буферов, которые используются для чтения и записи кадров данных.
zh_cn: 设置用于读取和写入数据帧的缓冲区的最大 <code><i>number</i></code> 和 <code><i>size</i></code> 。

source: Sets the maximum <code><i>number</i></code> and <code><i>size</i></code> of buffers used for reading large client request header. A request line cannot exceed the size of one buffer, or the 414 (Request-URI Too Large) error is returned to the client. A request header field cannot exceed the size of one buffer as well, or the 400 (Bad Request) error is returned to the client. Buffers are allocated only on demand. By default, the buffer size is equal to 8K bytes. If after the end of request processing a connection is transitioned into the keep-alive state, these buffers are released.
ja: 大きなクライアント要求ヘッダーの読み取りに使用されるバッファーの最大 <code><i>number</i></code> と <code><i>size</i></code> を設定します。要求行は1つのバッファーのサイズを超えることはできません。そうでない場合、414（Request-URI Too Large）エラーがクライアントに返されます。要求ヘッダーフィールドも1つのバッファーのサイズを超えることはできません。そうでない場合、400（Bad Request）エラーがクライアントに返されます。バッファはオンデマンドでのみ割り当てられます。デフォルトでは、バッファサイズは8Kバイトです。要求処理の終了後、接続がキープアライブ状態に移行すると、これらのバッファは解放されます。
ru: Устанавливает максимальное <code><i>number</i></code> и <code><i>size</i></code> буферов, используемых для чтения большого заголовка запроса клиента. Строка запроса не может превышать размер одного буфера, или клиенту возвращается ошибка 414 (Request-URI Too Large). Поле заголовка запроса также не может превышать размер одного буфера, в противном случае клиенту будет возвращена ошибка 400 (неверный запрос). Буферы выделяются только по запросу. По умолчанию размер буфера равен 8 Кбайт. Если после завершения обработки запроса соединение переходит в состояние поддержания активности, эти буферы освобождаются.
zh_cn: 设置用于读取大型客户端请求标头的缓冲区的最大 <code><i>number</i></code> 和 <code><i>size</i></code> 。请求行不能超过一个缓冲区的大小，否则会向客户端返回414（请求URI太大）错误。请求标头字段也不能超过一个缓冲区的大小，否则将400（错误请求）错误返回给客户端。缓冲区仅按需分配。默认情况下，缓冲区大小等于8K字节。如果在请求处理结束之后，连接转换为保持活动状态，则会释放这些缓冲区。

source: Sets the maximum <code><i>size</i></code> of hash tables used by the <a href="#proxy_hide_header">proxy_hide_header</a> and <a href="#proxy_set_header">proxy_set_header</a> directives. The details of setting up hash tables are provided in a separate <a href="../hash">document</a>.
ja: <a href="#proxy_hide_header">proxy_hide_header</a>および<a href="#proxy_set_header">proxy_set_header</a>ディレクティブによって使用されるハッシュテーブルの最大 <code><i>size</i></code> を設定します。ハッシュテーブルの設定の詳細は、別の<a href="../hash">ドキュメントに記載</a>されています。
ru: Устанавливает максимальный <code><i>size</i></code> хэш - таблиц , используемых <a href="#proxy_hide_header">proxy_hide_header</a> и <a href="#proxy_set_header">proxy_set_header</a> директив. Подробности настройки хэш-таблиц представлены в отдельном <a href="../hash">документе</a> .
zh_cn: 设置<a href="#proxy_hide_header">proxy_hide_header</a>和<a href="#proxy_set_header">proxy_set_header</a>指令使用的哈希表的最大 <code><i>size</i></code> 。设置哈希表的详细信息在单独的<a href="../hash">文档</a>中提供。

source: Sets the maximum <code><i>size</i></code> of the <a href="#map">map</a> variables hash tables. The details of setting up hash tables are provided in a separate <a href="../hash">document</a>.
ja: <a href="#map">マップ</a>変数のハッシュテーブルの最大 <code><i>size</i></code> を設定します。ハッシュテーブルの設定の詳細は、別の<a href="../hash">ドキュメントに記載</a>されています。
ru: Устанавливает максимальный <code><i>size</i></code> из <a href="#map">карты</a> переменных хэш - таблиц. Подробности настройки хэш-таблиц представлены в отдельном <a href="../hash">документе</a> .
zh_cn: 设置最大 <code><i>size</i></code> 的的<a href="#map">地图</a>变量哈希表。设置哈希表的详细信息在单独的<a href="../hash">文档</a>中提供。

source: Sets the maximum <code><i>size</i></code> of the server names hash tables. The details of setting up hash tables are provided in a separate <a href="../hash">document</a>.
ja: サーバー名ハッシュテーブルの最大 <code><i>size</i></code> を設定します。ハッシュテーブルの設定の詳細は、別の<a href="../hash">ドキュメントに記載</a>されています。
ru: Устанавливает максимальный <code><i>size</i></code> хэш-таблиц имен серверов. Подробности настройки хэш-таблиц представлены в отдельном <a href="../hash">документе</a> .
zh_cn: 设置服务器名称哈希表的最大 <code><i>size</i></code> 。设置哈希表的详细信息在单独的<a href="../hash">文档</a>中提供。

source: Sets the maximum <code><i>size</i></code> of the types hash tables. The details of setting up hash tables are provided in a separate <a href="../hash">document</a>.
ja: タイプハッシュテーブルの最大 <code><i>size</i></code> を設定します。ハッシュテーブルの設定の詳細は、別の<a href="../hash">ドキュメントに記載</a>されています。
ru: Устанавливает максимальный <code><i>size</i></code> хэш-таблиц типов. Подробности настройки хэш-таблиц представлены в отдельном <a href="../hash">документе</a> .
zh_cn: 设置类型哈希表的最大 <code><i>size</i></code> 。设置哈希表的详细信息在单独的<a href="../hash">文档</a>中提供。

source: Sets the maximum <code><i>size</i></code> of the valid referers hash tables. The details of setting up hash tables are provided in a separate <a href="../hash">document</a>.
ja: 有効なリファラーハッシュテーブルの最大 <code><i>size</i></code> を設定します。ハッシュテーブルの設定の詳細は、別の<a href="../hash">ドキュメントに記載</a>されています。
ru: Устанавливает максимальный <code><i>size</i></code> допустимых хэш-таблиц рефереров. Подробности настройки хэш-таблиц представлены в отдельном <a href="../hash">документе</a> .
zh_cn: 设置有效引荐来源哈希表的最大 <code><i>size</i></code> 。设置哈希表的详细信息在单独的<a href="../hash">文档</a>中提供。

source: Sets the maximum <code><i>size</i></code> of the variables hash table. The details of setting up hash tables are provided in a separate <a href="../hash">document</a>.
ja: 変数ハッシュテーブルの最大 <code><i>size</i></code> を設定します。ハッシュテーブルの設定の詳細は、別の<a href="../hash">ドキュメントに記載</a>されています。
ru: Устанавливает максимальный <code><i>size</i></code> хеш-таблицы переменных. Подробности настройки хэш-таблиц представлены в отдельном <a href="../hash">документе</a> .
zh_cn: 设置变量哈希表的最大 <code><i>size</i></code> 。设置哈希表的详细信息在单独的<a href="../hash">文档</a>中提供。

source: Sets the maximum allowable leeway to compensate clock skew when verifying the <a href="https://tools.ietf.org/html/rfc7519#section-4.1.4">exp</a> and <a href="https://tools.ietf.org/html/rfc7519#section-4.1.5">nbf</a> JWT claims.
ja: <a href="https://tools.ietf.org/html/rfc7519#section-4.1.4">exp</a>および<a href="https://tools.ietf.org/html/rfc7519#section-4.1.5">nbf</a> JWTクレームを検証するときに、クロックスキューを補正するための最大許容余裕を設定します。
ru: Устанавливает максимально допустимый запас хода для компенсации <a href="https://tools.ietf.org/html/rfc7519#section-4.1.5">расхождения</a> часов при проверке заявлений JWT <a href="https://tools.ietf.org/html/rfc7519#section-4.1.4">exp</a> и nbf .
zh_cn: 设置最大允许<a href="https://tools.ietf.org/html/rfc7519#section-4.1.5">余量</a>以补偿在验证<a href="https://tools.ietf.org/html/rfc7519#section-4.1.4">exp</a>和nbf JWT声明时的时钟偏斜。

source: Sets the maximum allowed size of the client request body, specified in the &ldquo;Content-Length&rdquo; request header field. If the size in a request exceeds the configured value, the 413 (Request Entity Too Large) error is returned to the client. Please be aware that browsers cannot correctly display this error. Setting <code><i>size</i></code> to 0 disables checking of client request body size.
ja: 「Content-Length」リクエストヘッダーフィールドで指定された、クライアントリクエストボディの最大許容サイズを設定します。リクエストのサイズが構成された値を超えると、413（リクエストエンティティが大きすぎます）エラーがクライアントに返されます。ブラウザがこのエラーを正しく表示できないことに注意してください。 <code><i>size</i></code> を0に設定すると、クライアントリクエストの本文サイズのチェックが無効になります。
ru: Устанавливает максимально допустимый размер тела клиентского запроса, указанный в поле заголовка запроса Content-Length. Если размер в запросе превышает настроенное значение, клиенту возвращается ошибка 413 (Request Entity Too Large). Имейте в виду, что браузеры не могут правильно отображать эту ошибку. Установка <code><i>size</i></code> на 0 отключает проверку размера тела клиентского запроса.
zh_cn: 设置客户端请求正文的最大允许大小，在&ldquo; Content-Length&rdquo;请求标头字段中指定。如果请求中的大小超过配置的值，则会向客户端返回413（请求实体太大）错误。请注意，浏览器无法正确显示此错误。将 <code><i>size</i></code> 设置为0将禁用对客户端请求主体大小的检查。

source: Sets the maximum length of parameter values in SSI commands.
ja: SSI コマンドのパラメータ値の最大長を設定します。
ru: Устанавливает максимальную длину значений параметров в SSI-командах.
zh_cn: 设置 SSI 命令中参数值的最大长度。

source: Sets the maximum number of concurrent HTTP/2 streams in a connection.
ja: 接続での同時接続 HTTP/2 ストリームの最大数を設定します。
ru: Устанавливает максимальное количество одновременных HTTP/2 потоков в соединении.
zh_cn: 设置一个连接中并发的HTTP/2流的最大数量。

source: Sets the maximum number of requests (including <a href="#http2_push">push</a> requests) that can be served through one HTTP/2 connection, after which the next client request will lead to connection closing and the need of establishing a new connection.
ja: 1つのHTTP / 2接続を介して処理できる要求（<a href="#http2_push">プッシュ</a>要求を含む）の最大数を設定します。その後、次のクライアント要求が接続を閉じ、新しい接続を確立する必要があります。
ru: Устанавливает максимальное количество запросов (включая <a href="#http2_push">push-</a> запросы), которые могут быть обслужены через одно соединение HTTP / 2, после чего следующий клиентский запрос приведет к закрытию соединения и необходимости установления нового соединения.
zh_cn: 设置可以通过一个HTTP / 2连接提供服务的最大请求数（包括<a href="#http2_push">推送</a>请求），此后下一个客户端请求将导致连接关闭以及需要建立新连接。

source: Sets the maximum number of requests that can be served through one keep-alive connection. After the maximum number of requests are made, the connection is closed.
ja: 1 つのキープアライブ接続で提供できるリクエストの最大数を設定します。最大数のリクエストが行われた後、接続は閉じられます。
ru: Устанавливает максимальное количество запросов,которое может быть обработано через одно соединение keep-alive.После того,как максимальное количество запросов достигнуто,соединение закрывается.
zh_cn: 设置一个保持状态的连接可以服务的最大请求数。在达到最大请求数后,连接将被关闭。

source: Sets the maximum number of requests that can be served through one keepalive connection. After the maximum number of requests is made, the connection is closed.
ja: 1 つの keepalive 接続で提供できるリクエストの最大数を設定します。最大数のリクエストが行われた後、接続は閉じられます。
ru: Устанавливает максимальное количество запросов,которое может быть обработано через одно соединение keepalive.После максимального количества запросов соединение закрывается.
zh_cn: 设置一个keepalive连接的最大请求数。在达到最大请求数后,连接将被关闭。

source: Sets the maximum number of simultaneous connections that can be opened by a worker process.
ja: ワーカープロセスが開くことができる同時接続の最大数を設定します。
ru: Устанавливает максимальное количество одновременных соединений,которое может быть открыто рабочим процессом.
zh_cn: 设置一个工作进程可以同时打开的最大连接数。
