Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/nginx/nginx.*.004.xlf
Languages: es, ja, ko, ru, zh_cn

source: To use a regular expression for string matching, it first needs to be compiled, which is usually done at the configuration phase. Note that since PCRE support is optional, all code using the interface must be protected by the surrounding <code>NGX_PCRE</code> macro:
es: Para usar una expresi&oacute;n regular para la coincidencia de cadenas, primero debe compilarse, lo que generalmente se hace en la fase de configuraci&oacute;n. Tenga en cuenta que, dado que la compatibilidad con PCRE es opcional, todo el c&oacute;digo que utilice la interfaz debe estar protegido por la macro <code>NGX_PCRE</code> circundante :
ko: 문자열 일치에 정규식을 사용하려면 먼저 구성 단계에서 수행되는 컴파일해야합니다. PCRE 지원은 선택 사항이므로 인터페이스를 사용하는 모든 코드는 주변 <code>NGX_PCRE</code> 매크로 로 보호해야합니다 .

source: To use gRPC over SSL, the &ldquo;<code>grpcs://</code>&rdquo; scheme should be used:
es: Para usar gRPC sobre SSL, se debe usar el esquema " <code>grpcs://</code> ":
ko: SSL을 통해 gRPC를 사용하려면 " <code>grpcs://</code> "체계를 사용해야합니다.

source: To use njs in nginx:
es: Para usar a NJS en Nginx:
ko: nginx에서 nj를 사용하려면 :

source: To verify that nginx is configured to support debugging, run the <code>nginx -V</code> command:
es: Para verificar que nginx est&eacute; configurado para admitir la depuraci&oacute;n, ejecute el comando <code>nginx -V</code> :
ko: nginx가 디버깅을 지원하도록 구성되었는지 확인하려면 <code>nginx -V</code> 명령을 실행하십시오 .

source: To view the configuration of a specific server, also specify its ID:
es: Para ver la configuración de un servidor específico,especifique también su ID:
ko: 특정 서버의 구성을 보려면 해당 ID도 지정하십시오.

source: Total time the server was in the &ldquo;<code>unavail</code>&rdquo;, &ldquo;<code>checking</code>&rdquo;, and &ldquo;<code>unhealthy</code>&rdquo; states.
es: Tiempo total que el servidor estuvo en los <code>unavail</code> "no disponible ", " <code>checking</code> " y " <code>unhealthy</code> ".
ko: 서버가 "사용 <code>unavail</code> ", " <code>checking</code> "및 " <code>unhealthy</code> "상태 인 총 시간

source: Trusted IPv6 addresses are supported starting from versions 1.3.0 and 1.2.1.
es: Las direcciones IPv6 de confianza se admiten a partir de las versiones 1.3.0 y 1.2.1.
ko: 신뢰할 수있는 IPv6 주소는 버전 1.3.0 및 1.2.1부터 지원됩니다.

source: Turning the compression <code>off</code> can become necessary if a URI contains base64-encoded names, since base64 uses the &ldquo;<code>/</code>&rdquo; character internally. However, for security considerations, it is better to avoid turning the compression off.
es: <code>off</code> la compresi&oacute;n puede ser necesario si un URI contiene nombres codificados en base64, ya que base64 usa el car&aacute;cter " <code>/</code> " internamente. Sin embargo, por razones de seguridad, es mejor evitar desactivar la compresi&oacute;n.
ko: base64가 내부적으로 " <code>/</code> "문자를 사용하므로 URI에 base64로 인코딩 된 이름이 포함 된 경우 압축을 <code>off</code> 해야합니다 . 그러나 보안상의 이유로 압축을 해제하지 않는 것이 좋습니다.

source: Turns on HLS streaming in the surrounding location.
es: Enciende el flujo de HLS en el lugar circundante.
ko: 주변 위치에서 HLS 스트리밍을 켭니다.

source: Turns on module processing in a surrounding location.
es: Enciende el procesamiento del módulo en un lugar cercano.
ko: 주변 위치에서 모듈 처리를 켭니다.

source: Turns on module processing in the surrounding location.
es: Enciende el procesamiento de los módulos en el lugar circundante.
ko: 주변 위치에서 모듈 처리를 켭니다.

source: Turns on the HTTP interface of upstream configuration in the surrounding location. Access to this location should be <a href="ngx_http_core_module#satisfy">limited</a>.
es: Activa la interfaz HTTP de la configuraci&oacute;n ascendente en la ubicaci&oacute;n circundante. El acceso a esta ubicaci&oacute;n debe ser <a href="ngx_http_core_module#satisfy">limitado</a> .
ko: 주변 위치에서 업스트림 구성의 HTTP 인터페이스를 켭니다. 이 위치에 대한 액세스는 <a href="ngx_http_core_module#satisfy">제한</a> 되어야합니다 .

source: Turns on the REST API interface in the surrounding location. Access to this location should be <a href="ngx_http_core_module#satisfy">limited</a>.
es: Activa la interfaz de la API REST en la ubicaci&oacute;n circundante. El acceso a esta ubicaci&oacute;n debe ser <a href="ngx_http_core_module#satisfy">limitado</a> .
ko: 주변 위치에서 REST API 인터페이스를 켭니다. 이 위치에 대한 액세스는 <a href="ngx_http_core_module#satisfy">제한</a> 되어야합니다 .

source: Type casts are separated by one space from casted expressions. An asterisk inside type cast is separated with space from type name:
es: Los calcos de los tipos están separados por un espacio de las expresiones de los calcos.Un asterisco dentro del molde de tipo se separa con un espacio del nombre del tipo:
ko: 유형 캐스트는 캐스트 된 표현식에서 한 칸씩 분리됩니다. 유형 캐스트 ​​내부의 별표는 유형 이름과 공백으로 구분됩니다.

source: Type names end with the &ldquo;<code>_t</code>&rdquo; suffix. A defined type name is separated by at least two spaces:
es: Los nombres de los tipos terminan con el sufijo " <code>_t</code> ". Un nombre de tipo definido est&aacute; separado por al menos dos espacios:
ko: 유형 이름은&ldquo; <code>_t</code> &rdquo;접미사로 끝납니다 . 정의 된 유형 이름은 최소한 두 개의 공백으로 구분됩니다.

source: Typical Mongrel rules:
es: Típicas reglas mestizas:
ko: 일반적인 잡종 규칙 :

source: UNIX-domain sockets (0.8.21) are specified with the &ldquo;<code>unix:</code>&rdquo; prefix:
es: Los sockets de dominio UNIX (0.8.21) se especifican con el prefijo " <code>unix:</code> ":
ko: UNIX 도메인 소켓 (0.8.21)은 " <code>unix:</code> "접두어 로 지정됩니다 .

source: UNIX-domain sockets (1.3.5) are specified with the &ldquo;<code>unix:</code>&rdquo; prefix:
es: Los sockets de dominio UNIX (1.3.5) se especifican con el prefijo " <code>unix:</code> ":
ko: UNIX 도메인 소켓 (1.3.5)은 " <code>unix:</code> "접두어 로 지정됩니다 .

source: UNIX-domain sockets are specified with the &ldquo;<code>unix:</code>&rdquo; prefix:
es: Los sockets de dominio UNIX se especifican con el prefijo " <code>unix:</code> ":
ko: UNIX 도메인 소켓은 " <code>unix:</code> "접두어 로 지정됩니다 .

source: URL Decoding
es: Decodificación de URL
ko: URL 디코딩

source: URL Encoding
es: Codificación de URL
ko: URL 인코딩

source: Unnecessary protocols can be disabled using the <a href="../configure">configuration</a> parameters <code>--without-mail_imap_module</code>, <code>--without-mail_pop3_module</code>, and <code>--without-mail_smtp_module</code>.
es: Los protocolos innecesarios se pueden deshabilitar utilizando los par&aacute;metros de <a href="../configure">configuraci&oacute;n </a> <code>--without-mail_imap_module</code> , <code>--without-mail_pop3_module</code> y <code>--without-mail_smtp_module</code> .
ko: <a href="../configure">구성</a> 매개 변수 <code>--without-mail_imap_module</code> , <code>--without-mail_pop3_module</code> 및 <code>--without-mail_smtp_module</code> 을 사용하여 불필요한 프로토콜을 비활성화 할 수 있습니다 .

source: Until version 0.7.28, four 4K or 8K buffers were used by default.
es: Hasta la versión 0.7.28,se usaban cuatro buffers de 4K u 8K por defecto.
ko: 버전 0.7.28까지는 기본적으로 4 개의 4K 또는 8K 버퍼가 사용되었습니다.

source: Until version 1.5.4, &ldquo;<code>application/x-javascript</code>&rdquo; was used as the default MIME type instead of &ldquo;<code>application/javascript</code>&rdquo;.
es: Hasta la versi&oacute;n 1.5.4, " <code>application/x-javascript</code> " se utilizaba como tipo MIME predeterminado en lugar de " <code>application/javascript</code> ".
ko: 버전 1.5.4까지는 " <code>application/javascript</code> " 대신 " <code>application/x-javascript</code> "가 기본 MIME 유형으로 사용되었습니다 .

source: Until versions 1.3.1 and 1.2.2, it was not possible to specify a weight for servers using the <code>ip_hash</code> load balancing method.
es: Hasta las versiones 1.3.1 y 1.2.2, no era posible especificar un peso para los servidores usando el m&eacute;todo de balanceo de carga <code>ip_hash</code> .
ko: 버전 1.3.1 및 1.2.2까지는 <code>ip_hash</code> 로드 밸런싱 방법을 사용하여 서버의 가중치를 지정할 수 없었습니다 .

source: Updates the HMAC content with the given <code><i>data</i></code>.
es: Actualiza el contenido de HMAC con los <code><i>data</i></code> proporcionados .
ko: 주어진 <code><i>data</i></code> HMAC 컨텐츠를 업데이트합니다 .

source: Updates the hash content with the given <code><i>data</i></code>.
es: Actualiza el contenido hash con los <code><i>data</i></code> proporcionados .
ko: 주어진 <code><i>data</i></code> 해시 내용을 업데이트합니다 .

source: Upgrading Executable on the Fly
es: La actualización de la ejecutiva sobre la marcha
ko: 플라이에서 실행 파일 업그레이드

source: Upon successful compilation, <code>cv.lengths</code> contains information about the presence of variables in the expression. The NULL value means that the expression contained static text only, and so can be stored in a simple string rather than as a complex value.
es: Tras una compilaci&oacute;n exitosa, <code>cv.lengths</code> contiene informaci&oacute;n sobre la presencia de variables en la expresi&oacute;n. El valor NULL significa que la expresi&oacute;n solo conten&iacute;a texto est&aacute;tico, por lo que se puede almacenar en una cadena simple en lugar de como un valor complejo.
ko: 컴파일이 성공하면 <code>cv.lengths</code> 에는 표현식에 변수가 있는지에 대한 정보가 포함됩니다. NULL 값은 표현식에 정적 텍스트 만 포함되어 있으므로 복잡한 값이 아닌 단순한 문자열에 저장 될 수 있음을 의미합니다.

source: Usage example:
es: Ejemplo de uso:
ko: 사용 예 :

source: Use cases
es: Casos de uso
ko: 사용 사례

source: Use the <code>ngx_array_create(pool, n, size)</code> call to create an array in a pool, and the <code>ngx_array_init(array, pool, n, size)</code> call to initialize an array object that has already been allocated.
es: Utilice la <code>ngx_array_create(pool, n, size)</code> para crear una matriz en una agrupaci&oacute;n, y la <code>ngx_array_init(array, pool, n, size)</code> para inicializar un objeto de matriz que ya ha sido asignado.
ko: 사용 <code>ngx_array_create(pool, n, size)</code> 풀의 배열을 생성하기 위해 호출하고 <code>ngx_array_init(array, pool, n, size)</code> 호출이 이미 할당 된 어레이 객체를 초기화.

source: Use the following functions to add elements to an array:
es: Utilice las siguientes funciones para añadir elementos a un conjunto:
ko: 다음 함수를 사용하여 배열에 요소를 추가하십시오.

source: Using a stale cached response can also be enabled directly in the response header for a specified number of seconds after the response became stale (1.11.10). This has lower priority than using the directive parameters.
es: El uso de una respuesta almacenada en caché rancia también puede activarse directamente en el encabezamiento de la respuesta durante un número determinado de segundos después de que la respuesta se haya vuelto rancia (1.11.10).Esto tiene menor prioridad que el uso de los parámetros de la directiva.
ko: 오래된 캐시 응답을 사용하면 응답이 오래 된 후 (1.11.10) 지정된 시간 (초) 동안 응답 헤더에서 직접 활성화 할 수 있습니다. 지시문 매개 변수를 사용하는 것보다 우선 순위가 낮습니다.

source: Using multiple worker threads inside a single worker process.
es: Usando múltiples hilos de trabajo dentro de un solo proceso de trabajo.
ko: 단일 작업자 프로세스 내에서 여러 작업자 스레드 사용

source: Using nginx as HTTP load balancer
es: Usando nginx como equilibrador de carga HTTP
ko: HTTP로드 밸런서로 nginx 사용

source: Using similar techniques the reader should be able to trace other nginx function calls.
es: Usando técnicas similares el lector debería ser capaz de rastrear otras llamadas de la función nginx.
ko: 유사한 기술을 사용하여 독자는 다른 nginx 함수 호출을 추적 할 수 있어야합니다.

source: Using the I/O completion ports as a connection processing method.
es: Usando los puertos de finalización de E/S como método de procesamiento de la conexión.
ko: 연결 처리 방법으로 I / O 완료 포트 사용

source: Using this directive, it is also possible to add host names to relative redirects issued by a proxied server:
es: Usando esta directiva,también es posible añadir nombres de host a redirecciones relativas emitidas por un servidor proxy:
ko: 이 지정 문을 사용하여 프록시 서버가 발행 한 상대 경로 재 지정에 호스트 이름을 추가 할 수도 있습니다.

source: Usual pre-processing with Adobe&rsquo;s f4fpackager is required, see relevant documentation for details.
es: Se requiere el preprocesamiento habitual con f4fpackager de Adobe; consulte la documentaci&oacute;n pertinente para obtener m&aacute;s detalles.
ko: Adobe f4fpackager를 사용한 일반적인 전처리가 필요합니다. 자세한 내용은 관련 설명서를 참조하십시오.

source: Usually, a null-terminated static array of <code>ngx_http_variable_t</code> structures is created by a module and processed at the preconfiguration stage to add variables into the configuration, for example:
es: Por lo general, un m&oacute;dulo crea una matriz est&aacute;tica terminada en nulo de estructuras <code>ngx_http_variable_t</code> y la procesa en la etapa de preconfiguraci&oacute;n para agregar variables a la configuraci&oacute;n, por ejemplo:
ko: 일반적으로 <code>ngx_http_variable_t</code> 구조 의 null로 끝나는 정적 배열은 모듈에 의해 생성되고 사전 구성 단계에서 처리되어 변수를 구성에 추가합니다. 예를 들면 다음과 같습니다.

source: Usually, if the authentication in nginx is a success, the backend cannot return an error. If it nevertheless returns an error, it means some internal error has occurred. In such case the backend message can contain information that should not be shown to the client. However, responding with an error for the correct password is a normal behavior for some POP3 servers. For example, CommuniGatePro informs a user about <a href="http://www.stalker.com/CommuniGatePro/Alerts.html#Quota">mailbox overflow</a> or other events by periodically outputting the <a href="http://www.stalker.com/CommuniGatePro/POP.html#Alerts">authentication error</a>. The directive should be enabled in this case.
es: Por lo general, si la autenticaci&oacute;n en nginx es exitosa, el backend no puede devolver un error. Si, no obstante, devuelve un error, significa que se ha producido alg&uacute;n error interno. En tal caso, el mensaje de backend puede contener informaci&oacute;n que no deber&iacute;a mostrarse al cliente. Sin embargo, responder con un error para la contrase&ntilde;a correcta es un comportamiento normal para algunos servidores POP3. Por ejemplo, CommuniGatePro informa a un usuario sobre el <a href="http://www.stalker.com/CommuniGatePro/Alerts.html#Quota">desbordamiento del buz&oacute;n</a> u otros eventos emitiendo peri&oacute;dicamente el <a href="http://www.stalker.com/CommuniGatePro/POP.html#Alerts">error de autenticaci&oacute;n</a> . La directiva deber&iacute;a estar habilitada en este caso.
ko: 일반적으로 nginx의 인증이 성공하면 백엔드는 오류를 반환 할 수 없습니다. 그럼에도 불구하고 오류를 반환하면 내부 오류가 발생한 것입니다. 이러한 경우 백엔드 메시지에는 클라이언트에 표시해서는 안되는 정보가 포함될 수 있습니다. 그러나 일부 POP3 서버에서는 올바른 비밀번호에 대한 오류로 응답하는 것이 정상적인 동작입니다. 예를 들어 CommuniGatePro는 정기적으로 <a href="http://www.stalker.com/CommuniGatePro/POP.html#Alerts">인증 오류를</a> 출력하여 <a href="http://www.stalker.com/CommuniGatePro/Alerts.html#Quota">사서함 오버플로</a> 또는 기타 이벤트에 대해 사용자에게 알립니다 . 이 경우 지시문을 활성화해야합니다.

source: Variables are declared sorted by length of a base type, then alphabetically. Type names and variable names are aligned. The type and name &ldquo;columns&rdquo; are separated with two spaces. Large arrays are put at the end of a declaration block:
es: Las variables se declaran ordenadas por longitud de un tipo base y luego alfab&eacute;ticamente. Los nombres de los tipos y los nombres de las variables est&aacute;n alineados. Las &ldquo;columnas&rdquo; de tipo y nombre se separan con dos espacios. Las matrices grandes se colocan al final de un bloque de declaraci&oacute;n:
ko: 변수는 기본 유형의 길이를 기준으로 정렬 한 다음 알파벳순으로 선언됩니다. 유형 이름과 변수 이름이 정렬됩니다. 유형과 이름 "열"은 두 개의 공백으로 구분됩니다. 선언 배열의 끝에 큰 배열이 배치됩니다.

source: Variables can be referenced by index (this is the most common method) or name (see <a href="#http_creating_variables">below</a>). The index is created at configuration stage, when a variable is added to the configuration. To obtain the variable index, use <code>ngx_http_get_variable_index()</code>:
es: Se puede hacer referencia a las variables por &iacute;ndice (este es el m&eacute;todo m&aacute;s com&uacute;n) o por nombre (ver m&aacute;s <a href="#http_creating_variables">abajo</a> ). El &iacute;ndice se crea en la etapa de configuraci&oacute;n, cuando se agrega una variable a la configuraci&oacute;n. Para obtener el &iacute;ndice de la variable, use <code>ngx_http_get_variable_index()</code> :
ko: 변수는 index (가장 일반적인 방법) 또는 name ( <a href="#http_creating_variables">아래</a> 참조)으로 참조 할 수 있습니다 . 변수는 구성에 추가 될 때 구성 단계에서 색인이 작성됩니다. 변수 인덱스를 얻으려면 <code>ngx_http_get_variable_index()</code> 사용 하십시오 .

source: Variables used in an <code><i>expression</i></code> are usually associated with a request; see <a href="#secure_link_md5">example</a> below.
es: Las variables utilizadas en una <code><i>expression</i></code> suelen estar asociadas con una solicitud; vea el <a href="#secure_link_md5">ejemplo a</a> continuaci&oacute;n.
ko: <code><i>expression</i></code> 사용 된 변수 는 일반적으로 요청과 연관됩니다. 아래 <a href="#secure_link_md5">예를</a> 참조하십시오 .

source: Version 0.7.64, 0.8.18 and earlier: the default SSL ciphers are
es: Versión 0.7.64,0.8.18 y anteriores:los cifrados SSL por defecto son
ko: 버전 0.7.64, 0.8.18 및 이전 버전 : 기본 SSL 암호는 다음과 같습니다.

source: Version 0.7.64, 0.8.18 and earlier: the default SSL protocols are SSLv2, SSLv3, and TLSv1.
es: Versión 0.7.64,0.8.18 y anteriores:los protocolos SSL por defecto son SSLv2,SSLv3 y TLSv1.
ko: 버전 0.7.64, 0.8.18 이하 : 기본 SSL 프로토콜은 SSLv2, SSLv3 및 TLSv1입니다.

source: Version 0.7.65, 0.8.19 and later: the default SSL protocols are SSLv3, TLSv1, TLSv1.1, and TLSv1.2 (if supported by the OpenSSL library).
es: Versión 0.7.65,0.8.19 y posteriores:los protocolos SSL por defecto son SSLv3,TLSv1,TLSv1.1,y TLSv1.2 (si están soportados por la biblioteca OpenSSL).
ko: 버전 0.7.65, 0.8.19 이상 : 기본 SSL 프로토콜은 SSLv3, TLSv1, TLSv1.1 및 TLSv1.2 (OpenSSL 라이브러리에서 지원되는 경우)입니다.

source: Version 0.7.65, 0.8.20 and later: the default SSL ciphers are &ldquo;<code>HIGH:!ADH:!MD5</code>&rdquo;.
es: Versi&oacute;n 0.7.65, 0.8.20 y posteriores: los cifrados SSL predeterminados son " <code>HIGH:!ADH:!MD5</code> :! ADH:! MD5 ".
ko: 버전 0.7.65, 0.8.20 이상 : 기본 SSL 암호는 " <code>HIGH:!ADH:!MD5</code> "입니다.

source: Version 0.8.19: the default SSL ciphers are &ldquo;<code>ALL:!ADH:RC4+RSA:+HIGH:+MEDIUM</code>&rdquo;.
es: Versi&oacute;n 0.8.19: los cifrados SSL predeterminados son &ldquo; <code>ALL:!ADH:RC4+RSA:+HIGH:+MEDIUM</code> :! ADH: RC4 + RSA: + HIGH: + MEDIUM &rdquo;.
ko: 버전 0.8.19 : 기본 SSL 암호는 " <code>ALL:!ADH:RC4+RSA:+HIGH:+MEDIUM</code> "입니다.

source: Version 1.0.5 and later: the default SSL ciphers are &ldquo;<code>HIGH:!aNULL:!MD5</code>&rdquo;.
es: Versi&oacute;n 1.0.5 y posteriores: los cifrados SSL predeterminados son " <code>HIGH:!aNULL:!MD5</code> ".
ko: 버전 1.0.5 이상 : 기본 SSL 암호는 " <code>HIGH:!aNULL:!MD5</code> "입니다.

source: Version 1.9.1 and later: the default SSL protocols are TLSv1, TLSv1.1, and TLSv1.2 (if supported by the OpenSSL library).
es: Versión 1.9.1 y posterior:los protocolos SSL por defecto son TLSv1,TLSv1.1 y TLSv1.2 (si están soportados por la biblioteca OpenSSL).
ko: 버전 1.9.1 이상 : 기본 SSL 프로토콜은 TLSv1, TLSv1.1 및 TLSv1.2입니다 (OpenSSL 라이브러리에서 지원되는 경우).

source: Version of nginx for Windows uses the native Win32 API (not the Cygwin emulation layer). Only the <code>select()</code> and <code>poll()</code> (1.15.9) connection processing methods are currently used, so high performance and scalability should not be expected. Due to this and some other known issues version of nginx for Windows is considered to be a
es: La versi&oacute;n de nginx para Windows utiliza la API nativa de Win32 (no la capa de emulaci&oacute;n Cygwin). S&oacute;lo la <code>select()</code> y <code>poll()</code> se utiliza actualmente, no se debe esperar por lo alto rendimiento y escalabilidad (1.15.9) M&eacute;todos de procesamiento de la conexi&oacute;n. Debido a esto y a algunos otros problemas conocidos, la versi&oacute;n de nginx para Windows se considera una
ko: Windows 용 nginx 버전은 기본 Win32 API (Cygwin 에뮬레이션 레이어가 아님)를 사용합니다. 만 <code>select()</code> 와 <code>poll()</code> (1.15.9) 연결 처리 방법은 현재 사용 때문에 높은 성능과 확장 성이 예상되어서는 안된다. 이것과 다른 알려진 문제로 인해 Windows 용 nginx의 버전은

source: Version of nginx.
es: Versión de nginx.
ko: nginx의 버전.

source: Version of the provided data set. The current version is 8.
es: Versión del conjunto de datos proporcionados.La versión actual es la 8.
ko: 제공된 데이터 세트의 버전입니다. 현재 버전은 8입니다.

source: Versions can be specified in the following formats: X, X.X, X.X.X, or X.X.X.X. The maximum values for each of the format are 4000, 4000.99, 4000.99.99, and 4000.99.99.99, respectively.
es: Las versiones pueden especificarse en los siguientes formatos:X,X.X,X.X.X,o X.X.X.X.Los valores máximos para cada uno de los formatos son 4000,4000.99,4000.99.99,y 4000.99.99.99,respectivamente.
ko: 버전은 X, XX, XXX 또는 XXXX 형식으로 지정할 수 있습니다. 각 형식의 최대 값은 각각 4000, 4000.99, 4000.99.99 및 4000.99.99.99입니다.

source: We will configure a basic proxy server, which serves requests of images with files from the local directory and sends all other requests to a proxied server. In this example, both servers will be defined on a single nginx instance.
es: Configuraremos un servidor proxy básico,que sirve las solicitudes de imágenes con archivos del directorio local y envía todas las demás solicitudes a un servidor proxy.En este ejemplo,ambos servidores se definirán en una única instancia nginx.
ko: 로컬 디렉토리에서 파일로 이미지 요청을 제공하고 다른 모든 요청을 프록시 서버로 보내는 기본 프록시 서버를 구성합니다. 이 예제에서 두 서버 모두 단일 nginx 인스턴스에 정의됩니다.

source: We will modify the second <code>location</code> block, which currently maps requests with the <code>/images/</code> prefix to the files under the <code>/data/images</code> directory, to make it match the requests of images with typical file extensions. The modified <code>location</code> block looks like this:
es: Modificaremos el segundo bloque de <code>location</code> , que actualmente asigna solicitudes con el prefijo <code>/images/</code> a los archivos del directorio <code>/data/images</code> , para que coincida con las solicitudes de im&aacute;genes con extensiones de archivo t&iacute;picas. El bloque de <code>location</code> modificado se ve as&iacute;:
ko: 현재 <code>/images/</code> 접두사를 가진 요청을 <code>/data/images</code> 디렉토리 아래의 파일에 매핑 하는 두 번째 <code>location</code> 블록 을 수정하여 일반적인 파일 확장자를 가진 이미지의 요청과 일치시킵니다. 수정 된 <code>location</code> 블록은 다음과 같습니다.

source: WebDAV clients that require additional WebDAV methods to operate will not work with this module.
es: Los clientes de WebDAV que requieren métodos adicionales de WebDAV para operar no funcionarán con este módulo.
ko: 작동하기 위해 추가 WebDAV 방법이 필요한 WebDAV 클라이언트는이 모듈에서 작동하지 않습니다.

source: WebSocket proxying
es: Proxy de WebSocket
ko: WebSocket 프록 싱

source: Weighted load balancing
es: Equilibrio de la carga ponderada
ko: 가중 로드 밸런싱

source: What is currently supported
es: Lo que actualmente se apoya
ko: 현재 지원되는 것
