Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/nginx/nginx.*.004.xlf
Languages: es, ja, ko, ru, zh_cn

source: The last parameter can also point to a named location, as shown in examples below. Starting from version 0.7.51, the last parameter can also be a <code><i>code</i></code>:
es: El &uacute;ltimo par&aacute;metro tambi&eacute;n puede apuntar a una ubicaci&oacute;n con nombre, como se muestra en los ejemplos siguientes. A partir de la versi&oacute;n 0.7.51, el &uacute;ltimo par&aacute;metro tambi&eacute;n puede ser un <code><i>code</i></code> :
ko: 아래 예제와 같이 마지막 매개 변수는 명명 된 위치를 가리킬 수도 있습니다. 버전 0.7.51부터 마지막 ​​매개 변수는 <code><i>code</i></code> 수도 있습니다 .

source: The last parameter value can contain variables (1.7.9):
es: El último valor del parámetro puede contener variables (1.7.9):
ko: 마지막 매개 변수 값은 변수 (1.7.9)를 포함 할 수 있습니다.

source: The lifetime of a link passed in a request; intended to be used only in the <a href="#secure_link_md5">secure_link_md5</a> directive.
es: La duraci&oacute;n de un enlace pasado en una solicitud; destinado a ser utilizado solo en la directiva <a href="#secure_link_md5">secure_link_md5</a> .
ko: 링크가 요청에 전달되었습니다. <a href="#secure_link_md5">secure_link_md5</a> 지시문 에서만 사용하도록 의도되었습니다 .

source: The limit on the maximum size of the cache specified in the configuration.
es: El límite del tamaño máximo de la caché especificado en la configuración.
ko: 구성에 지정된 캐시의 최대 크기 제한.

source: The list of certificates will be sent to clients. If this is not desired, the <a href="#ssl_trusted_certificate">ssl_trusted_certificate</a> directive can be used.
es: La lista de certificados se enviar&aacute; a los clientes. Si no se desea, se puede utilizar la directiva <a href="#ssl_trusted_certificate">ssl_trusted_certificate</a> .
ko: 인증서 목록이 클라이언트로 전송됩니다. 이것이 바람직하지 않은 경우 <a href="#ssl_trusted_certificate">ssl_trusted_certificate</a> 지시문을 사용할 수 있습니다.

source: The list of servers in <a href="#upstreams">upstreams</a> was moved into <a href="#peers">peers</a> in <a href="#version">version</a> 6.
es: La lista de servidores en <a href="#upstreams">upstream</a> se traslad&oacute; a <a href="#peers">pares</a> en la <a href="#version">versi&oacute;n</a> 6.
ko: <a href="#upstreams">업스트림</a> 서버 목록이 <a href="#version">버전</a> 6 에서 <a href="#peers">피어</a> 로 이동되었습니다 .

source: The log format can contain common variables, and variables that exist only at the time of a log write:
es: El formato de registro puede contener variables comunes y variables que sólo existen en el momento de una escritura de registro:
ko: 로그 형식에는 공통 변수 및 로그 쓰기시에만 존재하는 변수가 포함될 수 있습니다.

source: The lookup in a combined hash is handled by the <code>ngx_hash_find_combined(chash, key, name, len)</code>:
es: La b&uacute;squeda en un hash combinado es manejada por <code>ngx_hash_find_combined(chash, key, name, len)</code> :
ko: 결합 된 해시에서의 조회는 <code>ngx_hash_find_combined(chash, key, name, len)</code> 의해 처리됩니다 .

source: The master process calls the <code>exit_master</code> handler before exiting.
es: El proceso maestro llama al controlador <code>exit_master</code> antes de salir.
ko: 마스터 프로세스는 종료하기 전에 <code>exit_master</code> 핸들러를 호출합니다 .

source: The master process creates one or more worker processes and the <code>init_process</code> handler is called in each of them.
es: El proceso maestro crea uno o m&aacute;s procesos de trabajo y en cada uno de ellos se llama al controlador <code>init_process</code> .
ko: 마스터 프로세스는 하나 이상의 작업자 프로세스를 작성 하고 각 프로세스에서 <code>init_process</code> 핸들러가 호출됩니다.

source: The matching is performed against a normalized URI, after decoding the text encoded in the &ldquo;<code>%XX</code>&rdquo; form, resolving references to relative path components &ldquo;<code>.</code>&rdquo; and &ldquo;<code>..</code>&rdquo;, and possible <a href="#merge_slashes">compression</a> of two or more adjacent slashes into a single slash.
es: La coincidencia se realiza contra un URI normalizado, despu&eacute;s de decodificar el texto codificado en la forma " <code>%XX</code> ", resolviendo las referencias a los componentes de la ruta relativa " <code>.</code> &rdquo;Y&ldquo; <code>..</code> &rdquo;, y la posible <a href="#merge_slashes">compresi&oacute;n</a> de dos o m&aacute;s barras adyacentes en una sola barra.
ko: " <code>%XX</code> "형식으로 인코딩 된 텍스트를 디코딩 한 후 상대 경로 구성 요소에 대한 참조를 확인 하여 정규화 된 URI에 대해 일치가 수행 <code>.</code> &rdquo;및&ldquo; <code>..</code> &rdquo;및 두 개 이상의 인접한 슬래시를 단일 슬래시로 <a href="#merge_slashes">압축</a> 할 수 있습니다 .

source: The maximum number of requests that can be in the queue at the same time.
es: El máximo número de solicitudes que pueden estar en la cola al mismo tiempo.
ko: 큐에 동시에있을 수있는 최대 요청 수입니다.

source: The maximum size of the response is set by the <a href="ngx_http_core_module#subrequest_output_buffer_size">subrequest_output_buffer_size</a> directive (1.13.10):
es: El tama&ntilde;o m&aacute;ximo de la respuesta se establece por el <a href="ngx_http_core_module#subrequest_output_buffer_size">subrequest_output_buffer_size</a> Directiva (01/13/10):
ko: 응답의 최대 크기는 <a href="ngx_http_core_module#subrequest_output_buffer_size">subrequest_output_buffer_size</a> 지시문 (1.13.10)에 의해 설정됩니다 .

source: The method can be called multiple times per callback invocation.
es: El método puede ser llamado varias veces por invocación de devolución de llamada.
ko: 콜백 호출마다 메소드를 여러 번 호출 할 수 있습니다.

source: The modification time of files is set according to the received &ldquo;Last-Modified&rdquo; response header field. The response is first written to a temporary file, and then the file is renamed. Starting from version 0.8.9, temporary files and the persistent store can be put on different file systems. However, be aware that in this case a file is copied across two file systems instead of the cheap renaming operation. It is thus recommended that for any given location both saved files and a directory holding temporary files, set by the <a href="#fastcgi_temp_path">fastcgi_temp_path</a> directive, are put on the same file system.
es: El tiempo de modificaci&oacute;n de los archivos se establece de acuerdo con el campo de encabezado de respuesta "&Uacute;ltima modificaci&oacute;n" recibido. La respuesta se escribe primero en un archivo temporal y luego se cambia el nombre del archivo. A partir de la versi&oacute;n 0.8.9, los archivos temporales y el almac&eacute;n persistente se pueden colocar en diferentes sistemas de archivos. Sin embargo, tenga en cuenta que, en este caso, un archivo se copia en dos sistemas de archivos en lugar de la operaci&oacute;n barata de cambio de nombre. Por lo tanto, se recomienda que para cualquier ubicaci&oacute;n dada, tanto los archivos guardados como un directorio que <a href="#fastcgi_temp_path">contenga</a> archivos temporales, establecidos por la directiva fastcgi_temp_path , se coloquen en el mismo sistema de archivos.
ko: 파일의 수정 시간은 수신 된 "Last-Modified"응답 헤더 필드에 따라 설정됩니다. 응답은 먼저 임시 파일에 기록 된 다음 파일 이름이 바뀝니다. 버전 0.8.9부터 임시 파일과 영구 저장소를 다른 파일 시스템에 둘 수 있습니다. 그러나이 경우 저렴한 이름 바꾸기 작업 대신 두 파일 시스템에 파일이 복사됩니다. 따라서 임의의 지정된 위치에 대해, 저장된 파일과 <a href="#fastcgi_temp_path">fastcgi_temp_path</a> 지시문에 의해 설정된 임시 파일을 보유하는 디렉토리 모두 동일한 파일 시스템에 놓는 것이 좋습니다 .

source: The modification time of files is set according to the received &ldquo;Last-Modified&rdquo; response header field. The response is first written to a temporary file, and then the file is renamed. Starting from version 0.8.9, temporary files and the persistent store can be put on different file systems. However, be aware that in this case a file is copied across two file systems instead of the cheap renaming operation. It is thus recommended that for any given location both saved files and a directory holding temporary files, set by the <a href="#proxy_temp_path">proxy_temp_path</a> directive, are put on the same file system.
es: El tiempo de modificaci&oacute;n de los archivos se establece de acuerdo con el campo de encabezado de respuesta "&Uacute;ltima modificaci&oacute;n" recibido. La respuesta se escribe primero en un archivo temporal y luego se cambia el nombre del archivo. A partir de la versi&oacute;n 0.8.9, los archivos temporales y el almac&eacute;n persistente se pueden colocar en diferentes sistemas de archivos. Sin embargo, tenga en cuenta que, en este caso, un archivo se copia en dos sistemas de archivos en lugar de la operaci&oacute;n barata de cambio de nombre. Por lo tanto, se recomienda que para cualquier ubicaci&oacute;n dada, tanto los archivos guardados como un directorio que contiene archivos temporales, establecidos por la directiva <a href="#proxy_temp_path">proxy_temp_path</a> , se coloquen en el mismo sistema de archivos.
ko: 파일의 수정 시간은 수신 된 "Last-Modified"응답 헤더 필드에 따라 설정됩니다. 응답은 먼저 임시 파일에 기록 된 다음 파일 이름이 바뀝니다. 버전 0.8.9부터 임시 파일과 영구 저장소를 다른 파일 시스템에 둘 수 있습니다. 그러나이 경우 저렴한 이름 바꾸기 작업 대신 두 파일 시스템에 파일이 복사됩니다. 따라서 지정된 위치에 대해 저장된 파일과 <a href="#proxy_temp_path">proxy_temp_path</a> 지시문으로 설정 한 임시 파일을 보유한 디렉토리를 모두 동일한 파일 시스템에 두는 것이 좋습니다 .

source: The modification time of files is set according to the received &ldquo;Last-Modified&rdquo; response header field. The response is first written to a temporary file, and then the file is renamed. Starting from version 0.8.9, temporary files and the persistent store can be put on different file systems. However, be aware that in this case a file is copied across two file systems instead of the cheap renaming operation. It is thus recommended that for any given location both saved files and a directory holding temporary files, set by the <a href="#scgi_temp_path">scgi_temp_path</a> directive, are put on the same file system.
es: El tiempo de modificaci&oacute;n de los archivos se establece de acuerdo con el campo de encabezado de respuesta "&Uacute;ltima modificaci&oacute;n" recibido. La respuesta se escribe primero en un archivo temporal y luego se cambia el nombre del archivo. A partir de la versi&oacute;n 0.8.9, los archivos temporales y el almac&eacute;n persistente se pueden colocar en diferentes sistemas de archivos. Sin embargo, tenga en cuenta que, en este caso, un archivo se copia en dos sistemas de archivos en lugar de la operaci&oacute;n barata de cambio de nombre. Por lo tanto, se recomienda que para cualquier ubicaci&oacute;n, tanto los archivos guardados como un directorio que contiene archivos temporales, establecidos por la directiva <a href="#scgi_temp_path">scgi_temp_path</a> , se coloquen en el mismo sistema de archivos.
ko: 파일의 수정 시간은 수신 된 "Last-Modified"응답 헤더 필드에 따라 설정됩니다. 응답은 먼저 임시 파일에 기록 된 다음 파일 이름이 바뀝니다. 버전 0.8.9부터 임시 파일과 영구 저장소를 다른 파일 시스템에 둘 수 있습니다. 그러나이 경우 저렴한 이름 바꾸기 작업 대신 두 파일 시스템에 파일이 복사됩니다. 따라서 지정된 위치에 대해 저장된 파일과 <a href="#scgi_temp_path">scgi_temp_path</a> 지시문으로 설정 한 임시 파일을 보유한 디렉토리를 동일한 파일 시스템에 두는 것이 좋습니다 .

source: The modification time of files is set according to the received &ldquo;Last-Modified&rdquo; response header field. The response is first written to a temporary file, and then the file is renamed. Starting from version 0.8.9, temporary files and the persistent store can be put on different file systems. However, be aware that in this case a file is copied across two file systems instead of the cheap renaming operation. It is thus recommended that for any given location both saved files and a directory holding temporary files, set by the <a href="#uwsgi_temp_path">uwsgi_temp_path</a> directive, are put on the same file system.
es: El tiempo de modificaci&oacute;n de los archivos se establece de acuerdo con el campo de encabezado de respuesta "&Uacute;ltima modificaci&oacute;n" recibido. La respuesta se escribe primero en un archivo temporal y luego se cambia el nombre del archivo. A partir de la versi&oacute;n 0.8.9, los archivos temporales y el almac&eacute;n persistente se pueden colocar en diferentes sistemas de archivos. Sin embargo, tenga en cuenta que, en este caso, un archivo se copia en dos sistemas de archivos en lugar de la operaci&oacute;n barata de cambio de nombre. Por lo tanto, se recomienda que para cualquier ubicaci&oacute;n dada, tanto los archivos guardados como un directorio que contiene archivos temporales, establecidos por la directiva <a href="#uwsgi_temp_path">uwsgi_temp_path</a> , se coloquen en el mismo sistema de archivos.
ko: 파일의 수정 시간은 수신 된 "Last-Modified"응답 헤더 필드에 따라 설정됩니다. 응답은 먼저 임시 파일에 기록 된 다음 파일 이름이 바뀝니다. 버전 0.8.9부터 임시 파일과 영구 저장소를 다른 파일 시스템에 둘 수 있습니다. 그러나이 경우 저렴한 이름 바꾸기 작업 대신 두 파일 시스템에 파일이 복사됩니다. 따라서 지정된 위치에 대해 저장된 파일과 <a href="#uwsgi_temp_path">uwsgi_temp_path</a> 지시문으로 설정 한 임시 파일을 보유한 디렉토리를 동일한 파일 시스템에 두는 것이 좋습니다 .

source: The module <code>type</code> defines exactly what is stored in the <code>ctx</code> field. Its value is one of the following types:
es: El <code>type</code> m&oacute;dulo define exactamente lo que se almacena en el campo <code>ctx</code> . Su valor es uno de los siguientes tipos:
ko: 모듈 <code>type</code> 은 <code>ctx</code> 필드에 저장된 내용을 정확하게 정의 합니다. 그 값은 다음 유형 중 하나입니다.

source: The module also supports the <code>end</code> argument of an HTTP request (1.5.13) which sets the end point of playback. The <code>end</code> argument can be specified with the <code>start</code> argument or separately:
es: El m&oacute;dulo tambi&eacute;n admite el argumento <code>end</code> de una solicitud HTTP (1.5.13) que establece el punto final de la reproducci&oacute;n. El argumento <code>end</code> se puede especificar con el argumento <code>start</code> o por separado:
ko: 이 모듈은 또한 재생의 끝점을 설정하는 HTTP 요청 (1.5.13) 의 <code>end</code> 인수를 지원 합니다. <code>end</code> 인수는 지정할 수 있습니다 <code>start</code> 별도로 인수 나 :

source: The module is experimental, caveat emptor applies.
es: El módulo es experimental,se aplica la advertencia de Emptor.
ko: 모듈은 실험적이며주의해야 할 emptor가 적용됩니다.

source: The module may be combined with other access modules, such as <a href="ngx_http_access_module">ngx_http_access_module</a>, <a href="ngx_http_auth_basic_module">ngx_http_auth_basic_module</a>, and <a href="ngx_http_auth_jwt_module">ngx_http_auth_jwt_module</a>, via the <a href="ngx_http_core_module#satisfy">satisfy</a> directive.
es: El m&oacute;dulo se puede combinar con otros m&oacute;dulos de acceso, como <a href="ngx_http_access_module">ngx_http_access_module</a> , <a href="ngx_http_auth_basic_module">ngx_http_auth_basic_module</a> , y <a href="ngx_http_auth_jwt_module">ngx_http_auth_jwt_module</a> , a trav&eacute;s de la <a href="ngx_http_core_module#satisfy">satisfacer</a> Directiva.
ko: 모듈은 <a href="ngx_http_core_module#satisfy">충족</a> 지시문을 통해 <a href="ngx_http_access_module">ngx_http_access_module</a> , <a href="ngx_http_auth_basic_module">ngx_http_auth_basic_module</a> 및 <a href="ngx_http_auth_jwt_module">ngx_http_auth_jwt_module</a> 과 같은 다른 액세스 모듈과 결합 될 수 있습니다 .

source: The module may be combined with other access modules, such as <a href="ngx_http_access_module">ngx_http_access_module</a>, <a href="ngx_http_auth_basic_module">ngx_http_auth_basic_module</a>, and <a href="ngx_http_auth_request_module">ngx_http_auth_request_module</a>, via the <a href="ngx_http_core_module#satisfy">satisfy</a> directive.
es: El m&oacute;dulo se puede combinar con otros m&oacute;dulos de acceso, como <a href="ngx_http_access_module">ngx_http_access_module</a> , <a href="ngx_http_auth_basic_module">ngx_http_auth_basic_module</a> , y <a href="ngx_http_auth_request_module">ngx_http_auth_request_module</a> , a trav&eacute;s de la <a href="ngx_http_core_module#satisfy">satisfacer</a> Directiva.
ko: 모듈은 <a href="ngx_http_core_module#satisfy">충족</a> 지시문을 통해 <a href="ngx_http_access_module">ngx_http_access_module</a> , <a href="ngx_http_auth_basic_module">ngx_http_auth_basic_module</a> 및 <a href="ngx_http_auth_request_module">ngx_http_auth_request_module</a> 과 같은 다른 액세스 모듈과 결합 될 수 있습니다 .

source: The module provides two alternative operation modes. The first mode is enabled by the <a href="#secure_link_secret">secure_link_secret</a> directive and is used to check authenticity of requested links as well as protect resources from unauthorized access. The second mode (0.8.50) is enabled by the <a href="#secure_link">secure_link</a> and <a href="#secure_link_md5">secure_link_md5</a> directives and is also used to limit lifetime of links.
es: El m&oacute;dulo proporciona dos modos de funcionamiento alternativos. El primer modo est&aacute; habilitado por la directiva <a href="#secure_link_secret">secure_link_secret</a> y se usa para verificar la autenticidad de los enlaces solicitados, as&iacute; como para proteger los recursos del acceso no autorizado. El segundo modo (0.8.50) est&aacute; habilitado por las directivas <a href="#secure_link">secure_link</a> y <a href="#secure_link_md5">secure_link_md5</a> y tambi&eacute;n se utiliza para limitar la vida &uacute;til de los enlaces.
ko: 이 모듈은 두 가지 대체 작동 모드를 제공합니다. 첫 번째 모드는 <a href="#secure_link_secret">secure_link_secret</a> 지시문에 의해 활성화되며 요청 된 링크의 신뢰성을 확인하고 무단 액세스로부터 리소스를 보호하는 데 사용됩니다. 두 번째 모드 (0.8.50)는 <a href="#secure_link">secure_link</a> 및 <a href="#secure_link_md5">secure_link_md5</a> 지시문에 의해 활성화되며 링크 수명을 제한하는 데에도 사용됩니다.

source: The module supersedes the <a href="ngx_http_status_module">ngx_http_status_module</a> and <a href="ngx_http_upstream_conf_module">ngx_http_upstream_conf_module</a> modules.
es: El m&oacute;dulo reemplaza a los m&oacute;dulos <a href="ngx_http_status_module">ngx_http_status_module</a> y <a href="ngx_http_upstream_conf_module">ngx_http_upstream_conf_module</a> .
ko: 이 모듈은 <a href="ngx_http_status_module">ngx_http_status_module</a> 및 <a href="ngx_http_upstream_conf_module">ngx_http_upstream_conf_module</a> 모듈을 대체합니다 .

source: The module supports the following cryptographic <a href="https://www.iana.org/assignments/jose/jose.xhtml#web-signature-encryption-algorithms">algorithms</a>:
es: El m&oacute;dulo admite los siguientes <a href="https://www.iana.org/assignments/jose/jose.xhtml#web-signature-encryption-algorithms">algoritmos</a> criptogr&aacute;ficos :
ko: 이 모듈은 다음과 같은 암호화 <a href="https://www.iana.org/assignments/jose/jose.xhtml#web-signature-encryption-algorithms">알고리즘을</a> 지원합니다 .

source: The modules can also be built as <a href="../ngx_core_module#load_module">dynamic</a>:
es: Los m&oacute;dulos tambi&eacute;n se pueden construir como <a href="../ngx_core_module#load_module">din&aacute;micos</a> :
ko: 모듈은 <a href="../ngx_core_module#load_module">동적</a> 으로 구축 할 수도 있습니다 .

source: The most basic nginx configuration to work with a FastCGI server includes using the <a href="http/ngx_http_fastcgi_module#fastcgi_pass">fastcgi_pass</a> directive instead of the <code>proxy_pass</code> directive, and <a href="http/ngx_http_fastcgi_module#fastcgi_param">fastcgi_param</a> directives to set parameters passed to a FastCGI server. Suppose the FastCGI server is accessible on <code>localhost:9000</code>. Taking the proxy configuration from the previous section as a basis, replace the <code>proxy_pass</code> directive with the <code>fastcgi_pass</code> directive and change the parameter to <code>localhost:9000</code>. In PHP, the <code>SCRIPT_FILENAME</code> parameter is used for determining the script name, and the <code>QUERY_STRING</code> parameter is used to pass request parameters. The resulting configuration would be:
es: La configuraci&oacute;n de nginx m&aacute;s b&aacute;sica para trabajar con un servidor FastCGI incluye el uso de la directiva <a href="http/ngx_http_fastcgi_module#fastcgi_pass">fastcgi_pass en</a> lugar de la directiva <code>proxy_pass</code> y <a href="http/ngx_http_fastcgi_module#fastcgi_param">las</a> directivas fastcgi_param para establecer los par&aacute;metros pasados ​​a un servidor FastCGI. Suponga que se puede acceder al servidor FastCGI en <code>localhost:9000</code> . Tomando la configuraci&oacute;n del proxy de la secci&oacute;n anterior como base, reemplace la directiva <code>proxy_pass</code> con la directiva <code>fastcgi_pass</code> y cambie el par&aacute;metro a <code>localhost:9000</code> . En PHP, el par&aacute;metro <code>SCRIPT_FILENAME</code> se usa para determinar el nombre del script y <code>QUERY_STRING</code> El par&aacute;metro se utiliza para pasar par&aacute;metros de solicitud. La configuraci&oacute;n resultante ser&iacute;a:
ko: FastCGI를 서버와 작업에 대한 가장 기본적인의 nginx 구성은 사용 포함 <a href="http/ngx_http_fastcgi_module#fastcgi_pass">fastcgi_pass의</a> 지침 대신 <code>proxy_pass</code> 의 지침 및 <a href="http/ngx_http_fastcgi_module#fastcgi_param">fastcgi_param의</a> FastCGI를 서버에 전달 설정 매개 변수 지시를. <code>localhost:9000</code> 에서 FastCGI 서버에 액세스 할 수 있다고 가정하십시오 . 이전 섹션에서 프록시 구성을 기초로하여 <code>proxy_pass</code> 지시문을 <code>fastcgi_pass</code> 지시문으로 바꾸고 매개 변수를 <code>localhost:9000</code> 으로 변경하십시오 . PHP에서 <code>SCRIPT_FILENAME</code> 매개 변수는 스크립트 이름과 <code>QUERY_STRING</code> 을 결정하는 데 사용됩니다.매개 변수는 요청 매개 변수를 전달하는 데 사용됩니다. 결과 구성은 다음과 같습니다.

source: The most common pitfall is an attempt to write a full-fledged C module when it can be avoided. In most cases your task can be accomplished by creating a proper configuration. If writing a module is inevitable, try to make it as small and simple as possible. For example, a module can only export some <a href="#http_variables">variables</a>.
es: El error m&aacute;s com&uacute;n es un intento de escribir un m&oacute;dulo C completo cuando se puede evitar. En la mayor&iacute;a de los casos, su tarea se puede realizar creando una configuraci&oacute;n adecuada. Si escribir un m&oacute;dulo es inevitable, intente hacerlo lo m&aacute;s peque&ntilde;o y simple posible. Por ejemplo, un m&oacute;dulo solo puede exportar algunas <a href="#http_variables">variables</a> .
ko: 가장 일반적인 함정은 피할 수있을 때 본격적인 C 모듈을 작성하려는 시도입니다. 대부분의 경우 적절한 구성을 작성하여 작업을 수행 할 수 있습니다. 모듈 작성이 불가피한 경우 가능한 작고 단순하게 만드십시오. 예를 들어, 모듈은 일부 <a href="#http_variables">변수</a> 만 내보낼 수 있습니다 .

source: The most used string type in nginx, <a href="#string_overview">ngx_str_t</a> is not a C-Style zero-terminated string. You cannot pass the data to standard C library functions such as <code>strlen()</code> or <code>strstr()</code>. Instead, nginx <a href="#string_overview">counterparts</a> that accept either <code>ngx_str_t</code> should be used or pointer to data and a length. However, there is a case when <code>ngx_str_t</code> holds a pointer to a zero-terminated string: strings that come as a result of configuration file parsing are zero-terminated.
es: El tipo de cadena m&aacute;s utilizado en nginx, <a href="#string_overview">ngx_str_t</a> no es una cadena de estilo C terminada en cero. No puede pasar los datos a funciones de biblioteca est&aacute;ndar de C como <code>strlen()</code> o <code>strstr()</code> . En su lugar, se deben usar las <a href="#string_overview">contrapartes de</a> nginx que aceptan <code>ngx_str_t</code> o un puntero a datos y una longitud. Sin embargo, hay un caso en el que <code>ngx_str_t</code> tiene un puntero a una cadena terminada en cero: las cadenas que vienen como resultado del an&aacute;lisis del archivo de configuraci&oacute;n tienen terminaci&oacute;n cero.
ko: nginx에서 가장 많이 사용되는 문자열 유형 인 <a href="#string_overview">ngx_str_t</a> 는 C 스타일의 0으로 끝나는 문자열이 아닙니다. <code>strlen()</code> 또는 <code>strstr()</code> 과 같은 표준 C 라이브러리 함수에는 데이터를 전달할 수 없습니다 . 대신, <code>ngx_str_t</code> 를 허용하는 nginx <a href="#string_overview">대응 물</a> 을 사용하거나 데이터 및 길이에 대한 포인터를 사용해야합니다. 그러나 <code>ngx_str_t</code> 가 0으로 끝나는 문자열에 대한 포인터를 보유 하는 경우 가 있습니다. 구성 파일 구문 분석의 결과로 나오는 문자열은 0으로 종료됩니다.

source: The name of a stream keyval shared memory zone.
es: El nombre de una zona de memoria compartida keyval de flujo.
ko: 스트림 키 발트 공유 메모리 존의 이름.

source: The name of a stream server zone.
es: El nombre de una zona de servidores de streaming.
ko: 스트림 서버 영역의 이름입니다.

source: The name of a stream upstream server group.
es: El nombre de un grupo de servidores de flujo ascendente.
ko: 스트림 업스트림 서버 그룹의 이름

source: The name of an HTTP keyval shared memory zone.
es: El nombre de una zona de memoria compartida de HTTP keyval.
ko: HTTP keyval 공유 메모리 영역의 이름입니다.

source: The name of an HTTP server zone.
es: El nombre de una zona de servidores HTTP.
ko: HTTP 서버 영역의 이름입니다.
