Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/nginx/nginx.*.004.xlf
Languages: es, ja, ko, ru, zh_cn

source: The <code>least_time</code> method passes a connection to a server with the least average time and least number of active connections. If <code>least_time=connect</code> parameter is specified, time to <a href="#var_upstream_connect_time">connect</a> to the upstream server is used. If <code>least_time=first_byte</code> parameter is specified, time to receive the <a href="#var_upstream_first_byte_time">first byte</a> of data is used. If <code>least_time=last_byte</code> is specified, time to receive the <a href="#var_upstream_session_time">last byte</a> of data is used.
es: El m&eacute;todo <code>least_time</code> pasa una conexi&oacute;n a un servidor con el menor tiempo promedio y el menor n&uacute;mero de conexiones activas. Si se especifica el par&aacute;metro <code>least_time=connect</code> , se utiliza el tiempo para <a href="#var_upstream_connect_time">conectarse</a> al servidor ascendente. Si se especifica el par&aacute;metro <code>least_time=first_byte</code> , se utiliza el tiempo para recibir el <a href="#var_upstream_first_byte_time">primer byte</a> de datos. Si se especifica <code>least_time=last_byte</code> se usa el tiempo para recibir el <a href="#var_upstream_session_time">&uacute;ltimo byte</a> de datos.
ja: <code>least_time</code> の方法は、少なくとも平均時間とアクティブな接続数が最も少ないサーバへの接続を渡します。 <code>least_time=connect</code> パラメータが指定されている場合、上流サーバーに<a href="#var_upstream_connect_time">接続する</a>ための時間が使用されます。 <code>least_time=first_byte</code> パラメータが指定されている場合、データの<a href="#var_upstream_first_byte_time">最初のバイト</a>を受信する時間が使用されます。 <code>least_time=last_byte</code> が指定されている場合、データの<a href="#var_upstream_session_time">最後のバイト</a>を受け取るまでの時間が使用されます。
ko: <code>least_time</code> 메소드는 평균 시간 이 가장 적고 활성 연결 수가 가장 적은 서버로 연결을 전달합니다. 경우 <code>least_time=connect</code> 매개 변수가 지정된 시간은하기 <a href="#var_upstream_connect_time">연결</a> 사용되는 업스트림 서버. 경우 <code>least_time=first_byte</code> 파라미터가 지정 시간은 수신 <a href="#var_upstream_first_byte_time">첫 번째 바이트</a> 의 데이터가 사용된다. 경우 <code>least_time=last_byte</code> 이 지정되는 시간은 수신 <a href="#var_upstream_session_time">마지막 바이트</a> 의 데이터가 사용된다.
ru: Метод <code>least_time</code> передает соединение с сервером с наименьшим средним временем и наименьшим количеством активных соединений. Если <code>least_time=connect</code> параметр minimum_time = connect , используется время для <a href="#var_upstream_connect_time">подключения</a> к вышестоящему серверу. Если <code>least_time=first_byte</code> параметр minimum_time = first_byte , используется время для получения <a href="#var_upstream_first_byte_time">первого байта</a> данных. Если <code>least_time=last_byte</code> , используется время для получения <a href="#var_upstream_session_time">последнего байта</a> данных.
zh_cn: 该 <code>least_time</code> 方法通过用最少的平均时间和活动连接的至少数到服务器的连接。如果指定了 <code>least_time=connect</code> 参数，则使用<a href="#var_upstream_connect_time">连接</a>到上游服务器的时间。如果指定了 <code>least_time=first_byte</code> 参数，则使用接收数据的<a href="#var_upstream_first_byte_time">第一个字节</a>的时间。如果指定了 <code>least_time=last_byte</code> 则使用接收数据<a href="#var_upstream_session_time">最后一个字节</a>的时间。

source: The <code>least_time</code> method passes a request to a server with the least average response time and least number of active connections. If <code>least_time=header</code> is specified, the time to receive the <a href="#var_upstream_header_time">response header</a> is used. If <code>least_time=last_byte</code> is specified, the time to receive the <a href="#var_upstream_response_time">full response</a> is used.
es: El m&eacute;todo <code>least_time</code> pasa una solicitud a un servidor con el menor tiempo de respuesta promedio y el menor n&uacute;mero de conexiones activas. Si se especifica <code>least_time=header</code> , se usa el tiempo para recibir el <a href="#var_upstream_header_time">encabezado de respuesta</a> . Si se especifica <code>least_time=last_byte</code> se usa el tiempo para recibir la <a href="#var_upstream_response_time">respuesta completa</a> .
ja: <code>least_time</code> の方法は、最小平均応答時間とアクティブな接続数が最も少ないサーバに要求を渡します。 <code>least_time=header</code> が指定されている場合、<a href="#var_upstream_header_time">応答ヘッダー</a>を受信する時間が使用されます。 <code>least_time=last_byte</code> が指定されている場合、<a href="#var_upstream_response_time">完全な応答</a>を受け取るまでの時間が使用されます。
ko: 그만큼 <code>least_time</code> 메소드는 평균 응답 시간 적고 활성 연결 수가 가장 적은 서버로 요청을 전달합니다. 경우 <code>least_time=header</code> 지정되면, 수신 시간 <a href="#var_upstream_header_time">응답 헤더를</a> 사용한다. 경우 <code>least_time=last_byte</code> 가 지정되어, 수신하는 시간이 <a href="#var_upstream_response_time">전체 응답은</a> 사용됩니다.
ru: Метод <code>least_time</code> передает запрос серверу с наименьшим средним временем ответа и наименьшим количеством активных соединений. Если <code>least_time=header</code> , используется время получения <a href="#var_upstream_header_time">заголовка ответа</a> . Если <code>least_time=last_byte</code> , используется время получения <a href="#var_upstream_response_time">полного ответа</a> .
zh_cn: 该 <code>least_time</code> 方法传递到服务器的请求与所述至少平均响应时间和活动连接的数量最少。如果指定了 <code>least_time=header</code> ，则使用接收<a href="#var_upstream_header_time">响应头</a>的时间。如果指定了 <code>least_time=last_byte</code> ，则使用接收<a href="#var_upstream_response_time">完整响应</a>的时间。

source: The <code>len</code> field holds the string length and <code>data</code> holds the string data. The string, held in <code>ngx_str_t</code>, may or may not be null-terminated after the <code>len</code> bytes. In most cases it&rsquo;s not. However, in certain parts of the code (for example, when parsing configuration), <code>ngx_str_t</code> objects are known to be null-terminated, which simplifies string comparison and makes it easier to pass the strings to syscalls.
es: El campo <code>len</code> contiene la longitud de la cadena y los <code>data</code> contienen los datos de la cadena. La cadena, contenida en <code>ngx_str_t</code> , puede o no tener terminaci&oacute;n nula despu&eacute;s de los bytes <code>len</code> . En la mayor&iacute;a de los casos no lo es. Sin embargo, en ciertas partes del c&oacute;digo (por ejemplo, al analizar la configuraci&oacute;n), se <code>ngx_str_t</code> objetos ngx_str_t terminan en nulo, lo que simplifica la comparaci&oacute;n de cadenas y facilita el paso de las cadenas a las llamadas al sistema.
ja: <code>len</code> フィールドは、文字列の長さを保持し、 <code>data</code> 文字列データを保持しています。 <code>ngx_str_t</code> に保持されている文字列は、 <code>len</code> バイトの後にnullで終了する場合としない場合があります。ほとんどの場合、そうではありません。ただし、コードの特定の部分（構成の解析時など）では、 <code>ngx_str_t</code> オブジェクトはnullで終了することがわかっているため、文字列の比較が簡単になり、文字列をsyscallsに渡しやすくなります。
ko: <code>len</code> 필드는 문자열 길이를 보유하고 <code>data</code> 문자열 데이터를 보유하고 있습니다. <code>ngx_str_t</code> 에 보관 된 문자열 은 <code>len</code> 바이트 이후에 null로 끝나거나 끝나지 않을 수 있습니다 . 대부분의 경우 그렇지 않습니다. 그러나 코드의 특정 부분 (예 : 구문 분석 구성)에서 <code>ngx_str_t</code> 객체는 null로 끝나는 것으로 알려져있어 문자열 비교를 단순화하고 문자열을 syscall에 쉽게 전달할 수 있습니다.
ru: Поле <code>len</code> содержит длину строки, а <code>data</code> содержат строковые данные. Строка, содержащаяся в <code>ngx_str_t</code> , может заканчиваться нулем после <code>len</code> байтов , а может и нет . В большинстве случаев это не так. Однако в некоторых частях кода (например, при синтаксическом анализе конфигурации) объекты <code>ngx_str_t</code> , как известно, заканчиваются нулем, что упрощает сравнение строк и упрощает передачу строк системным вызовам.
zh_cn: 的 <code>len</code> 字段保存字符串的长度和 <code>data</code> 保持的字符串数据。保留在 <code>ngx_str_t</code> 中的字符串在 <code>len</code> 个字节之后可以为null终止，也可以不为null终止。在大多数情况下不是。但是，在代码的某些部分（例如，在分析配置时），已知 <code>ngx_str_t</code> 对象是以空值结尾的，这简化了字符串比较，并使将字符串传递给syscall更容易。

source: The <code>listen</code> directive can have several additional parameters specific to socket-related system calls.
es: La directiva <code>listen</code> puede tener varios par&aacute;metros adicionales espec&iacute;ficos para las llamadas al sistema relacionadas con sockets.
ja: <code>listen</code> ディレクティブは、ソケット関連のシステムコールには、いくつかの追加パラメータの特定を持つことができます。
ko: 는 <code>listen</code> 지시 소켓 관련 시스템 호출에 대한 몇 가지 추가 매개 변수의 특정을 할 수 있습니다.
ru: <code>listen</code> директива может иметь несколько дополнительных параметров , специфичных для сокетов связанных с системными вызовами.
zh_cn: 该 <code>listen</code> 指令可以有一些额外的参数，具体到套接字相关的系统调用。

source: The <code>listen</code> directive can have several additional parameters specific to socket-related system calls. These parameters can be specified in any <code>listen</code> directive, but only once for a given <code><i>address</i></code>:<code><i>port</i></code> pair.
es: La directiva <code>listen</code> puede tener varios par&aacute;metros adicionales espec&iacute;ficos para las llamadas al sistema relacionadas con sockets. Estos par&aacute;metros se pueden especificar en cualquier directiva de <code>listen</code> , pero solo una vez para una <code><i>address</i></code> determinada : par de <code><i>port</i></code> .
ja: <code>listen</code> ディレクティブは、ソケット関連のシステムコールには、いくつかの追加パラメータの特定を持つことができます。これらのパラメーターは、任意の <code>listen</code> ディレクティブで指定できますが、特定の <code><i>address</i></code> ： <code><i>port</i></code> ペアに対して1回だけ指定できます。
ko: 는 <code>listen</code> 지시 소켓 관련 시스템 호출에 대한 몇 가지 추가 매개 변수의 특정을 할 수 있습니다. 이 파라미터는 모든 <code>listen</code> 에서 지정할 수 있습니다 지시문 <code><i>address</i></code> : <code><i>port</i></code> 쌍에 대해 한 번만 .
ru: <code>listen</code> директива может иметь несколько дополнительных параметров , специфичных для сокетов связанных с системными вызовами. Эти параметры могут быть указаны в любой директиве <code>listen</code> , но только один раз для данной пары <code><i>address</i></code> : <code><i>port</i></code> .
zh_cn: 该 <code>listen</code> 指令可以有一些额外的参数，具体到套接字相关的系统调用。可以在任何 <code>listen</code> 指令中指定这些参数，但对于给定的 <code><i>address</i></code> ： <code><i>port</i></code> 对，只能指定一次。

source: The <code>max</code> parameter sets &ldquo;Expires&rdquo; to the value &ldquo;<code>Thu, 31 Dec 2037 23:55:55 GMT</code>&rdquo;, and &ldquo;Cache-Control&rdquo; to 10 years.
es: El par&aacute;metro <code>max</code> establece "Expires" en el valor " <code>Thu, 31 Dec 2037 23:55:55 GMT</code> " y "Cache-Control" en 10 a&ntilde;os.
ja: <code>max</code> パラメータセットの値に「有効期限」「 <code>Thu, 31 Dec 2037 23:55:55 GMT</code> 」、および「のCache-Control」10年。
ko: <code>max</code> 파라미터 세트의 값은 "을"만료 " <code>Thu, 31 Dec 2037 23:55:55 GMT</code> ", 10 년 "캐시 제어".
ru: Параметр <code>max</code> устанавливает &laquo;Expires&raquo; на значение &laquo; <code>Thu, 31 Dec 2037 23:55:55 GMT</code> &raquo;, а &laquo;Cache-Control&raquo; - на 10 лет.
zh_cn: 该 <code>max</code> 参数设置&ldquo;过期&rdquo;值&ldquo; <code>Thu, 31 Dec 2037 23:55:55 GMT</code> &rdquo;，和&ldquo;缓存控制&rdquo;到10年。

source: The <code>ngx_buf_t</code> structure has the following fields:
es: La estructura <code>ngx_buf_t</code> tiene los siguientes campos:
ja: <code>ngx_buf_t</code> 構造は、次のフィールドがあります。
ko: <code>ngx_buf_t</code> 구조는 다음과 같은 필드가 있습니다 :
ru: Структура <code>ngx_buf_t</code> имеет следующие поля:
zh_cn: 该 <code>ngx_buf_t</code> 结构具有以下字段：

source: The <code>ngx_command_t</code> type defines a single configuration directive. Each module that supports configuration provides an array of such structures that describe how to process arguments and what handlers to call:
es: El tipo <code>ngx_command_t</code> define una &uacute;nica directiva de configuraci&oacute;n. Cada m&oacute;dulo que admite la configuraci&oacute;n proporciona una serie de estructuras que describen c&oacute;mo procesar argumentos y qu&eacute; controladores llamar:
ja: <code>ngx_command_t</code> タイプは、単一の構成ディレクティブを規定します。構成をサポートする各モジュールは、引数の処理方法と呼び出すハンドラーを記述する、このような構造の配列を提供します。
ko: <code>ngx_command_t</code> 유형은 단일 구성 지시어를 정의합니다. 구성을 지원하는 각 모듈은 인수를 처리하는 방법과 호출 할 핸들러를 설명하는 이러한 구조의 배열을 제공합니다.
ru: Тип <code>ngx_command_t</code> определяет единственную директиву конфигурации. Каждый модуль, поддерживающий конфигурацию, предоставляет массив таких структур, которые описывают, как обрабатывать аргументы и какие обработчики вызывать:
zh_cn: 所述 <code>ngx_command_t</code> 类型定义一个单一的配置指令。每个支持配置的模块都提供了一系列这样的结构，这些结构描述了如何处理参数以及调用哪些处理程序：

source: The <code>ngx_config.h</code> and <code>ngx_core.h</code> files are always included first, followed by one of <code>ngx_http.h</code>, <code>ngx_stream.h</code>, or <code>ngx_mail.h</code>. Then follow optional external header files:
es: Los <code>ngx_config.h</code> y <code>ngx_core.h</code> archivos se incluyen siempre en primer lugar, seguido de uno de <code>ngx_http.h</code> , <code>ngx_stream.h</code> o <code>ngx_mail.h</code> . Luego siga los archivos de encabezado externos opcionales:
ja: <code>ngx_config.h</code> と <code>ngx_core.h</code> ファイルは常にの1に続いて、最初に含まれている <code>ngx_http.h</code> 、 <code>ngx_stream.h</code> 、または <code>ngx_mail.h</code> 。次に、オプションの外部ヘッダーファイルに従います。
ko: <code>ngx_config.h</code> 및 <code>ngx_core.h</code> 파일은 항상 한 다음, 처음으로 포함되어 <code>ngx_http.h</code> , <code>ngx_stream.h</code> , 또는 <code>ngx_mail.h</code> . 그런 다음 선택적 외부 헤더 파일을 따르십시오.
ru: В <code>ngx_config.h</code> и <code>ngx_core.h</code> файлы всегда включены первым, а затем один из <code>ngx_http.h</code> , <code>ngx_stream.h</code> или <code>ngx_mail.h</code> . Затем следуйте дополнительным файлам внешних заголовков:
zh_cn: 该 <code>ngx_config.h</code> 和 <code>ngx_core.h</code> 文件总是首先包括，其次是一个 <code>ngx_http.h</code> ， <code>ngx_stream.h</code> ，或 <code>ngx_mail.h</code> 。然后遵循可选的外部头文件：

source: The <code>ngx_errno</code> macro returns the last system error code. It's mapped to <code>errno</code> on POSIX platforms and to <code>GetLastError()</code> call in Windows. The <code>ngx_socket_errno</code> macro returns the last socket error number. Like the <code>ngx_errno</code> macro, it's mapped to <code>errno</code> on POSIX platforms. It's mapped to the <code>WSAGetLastError()</code> call on Windows. Accessing the values of <code>ngx_errno</code> or <code>ngx_socket_errno</code> more than once in a row can cause performance issues. If the error value might be used multiple times, store it in a local variable of type <code>ngx_err_t</code>. To set errors, use the <code>ngx_set_errno(errno)</code> and <code>ngx_set_socket_errno(errno)</code> macros.
es: La macro <code>ngx_errno</code> devuelve el &uacute;ltimo c&oacute;digo de error del sistema. Est&aacute; asignado a <code>errno</code> en plataformas POSIX y a la llamada <code>GetLastError()</code> en Windows. La macro <code>ngx_socket_errno</code> devuelve el &uacute;ltimo n&uacute;mero de error de socket. Al igual que la macro <code>ngx_errno</code> , est&aacute; asignada a <code>errno</code> en plataformas POSIX. Est&aacute; asignado a la llamada <code>WSAGetLastError()</code> en Windows. Acceder a los valores de <code>ngx_errno</code> o <code>ngx_socket_errno</code> m&aacute;s de una vez en una fila puede causar problemas de rendimiento. Si el valor de error se puede utilizar varias veces, gu&aacute;rdelo en una variable local de tipo <code>ngx_err_t</code> . Para configurar errores, use <code>ngx_set_errno(errno)</code> y <code>ngx_set_socket_errno(errno)</code> .
ja: <code>ngx_errno</code> マクロ戻り最後のシステム・エラー・コード。POSIXプラットフォームでは <code>errno</code> に、Windowsでは <code>GetLastError()</code> 呼び出しにマップされます。 <code>ngx_socket_errno</code> マクロを返す、最後のソケットエラー番号。 <code>ngx_errno</code> マクロと同様に、POSIXプラットフォームでは <code>errno</code> にマップされます。これは、Windowsでは <code>WSAGetLastError()</code> 呼び出しにマップされます。 <code>ngx_errno</code> または <code>ngx_socket_errno</code> の値に連続して複数回アクセスすると、パフォーマンスの問題が発生する可能性があります。エラー値が複数回使用される可能性がある場合は、それを <code>ngx_err_t</code> 型のローカル変数に保存します。エラーを設定するには、 <code>ngx_set_errno(errno)</code> を使用しますおよび <code>ngx_set_socket_errno(errno)</code> マクロ。
ko: <code>ngx_errno</code> 매크로 반환 마지막 시스템 오류 코드. POSIX 플랫폼에서는 <code>errno</code> 와 Windows에서는 <code>GetLastError()</code> 호출에 매핑됩니다 . <code>ngx_socket_errno</code> 매크로 반환 마지막 소켓 오류 번호. <code>ngx_errno</code> 매크로 와 마찬가지로 POSIX 플랫폼 에서 <code>errno</code> 에 매핑됩니다 . Windows 의 <code>WSAGetLastError()</code> 호출에 맵핑됩니다 . <code>ngx_errno</code> 또는 <code>ngx_socket_errno</code> 값에 연속으로 두 번 이상 액세스 하면 성능 문제가 발생할 수 있습니다. 오류 값을 여러 번 사용할 수 있으면 <code>ngx_err_t</code> 유형의 로컬 변수에 저장하십시오 . 오류를 설정하려면 <code>ngx_set_errno(errno)</code> 사용하십시오및 <code>ngx_set_socket_errno(errno)</code> 매크로.
ru: В <code>ngx_errno</code> макрокоманда возвращает последний код ошибки системы. Он отображается на <code>errno</code> на платформах POSIX и на вызов <code>GetLastError()</code> в Windows. В <code>ngx_socket_errno</code> макрокоманда возвращает последний номер сокета ошибки. Как и макрос <code>ngx_errno</code> , он отображается на <code>errno</code> на платформах POSIX. Он сопоставлен с <code>WSAGetLastError()</code> в Windows. Доступ к значениям <code>ngx_errno</code> или <code>ngx_socket_errno</code> более одного раза подряд может вызвать проблемы с производительностью. Если значение ошибки может использоваться несколько раз, сохраните его в локальной переменной типа <code>ngx_err_t</code> . Чтобы установить ошибки, используйте <code>ngx_set_errno(errno)</code> и <code>ngx_set_socket_errno(errno)</code> .
zh_cn: 该 <code>ngx_errno</code> 宏返回最后一个系统错误代码。它已映射到POSIX平台上的 <code>errno</code> 和Windows中的 <code>GetLastError()</code> 调用。该 <code>ngx_socket_errno</code> 宏返回最后一个套接字错误号。像 <code>ngx_errno</code> 宏一样，它在POSIX平台上映射到 <code>errno</code> 。它映射到Windows上的 <code>WSAGetLastError()</code> 调用。 <code>ngx_errno</code> 访问ngx_errno或 <code>ngx_socket_errno</code> 的值可能会导致性能问题。如果错误值可能被多次使用，请将其存储在 <code>ngx_err_t</code> 类型的本地变量中。要设置错误，请使用 <code>ngx_set_errno(errno)</code> 和 <code>ngx_set_socket_errno(errno)</code> 宏。

source: The <code>ngx_google_perftools_module</code> module (0.6.29) enables profiling of nginx worker processes using <a href="https://github.com/gperftools/gperftools">Google Performance Tools</a>. The module is intended for nginx developers.
es: El m&oacute;dulo <code>ngx_google_perftools_module</code> (0.6.29) permite la creaci&oacute;n de perfiles de procesos de trabajo nginx mediante <a href="https://github.com/gperftools/gperftools">Google Performance Tools</a> . El m&oacute;dulo est&aacute; destinado a desarrolladores de nginx.
ja: <code>ngx_google_perftools_module</code> モジュール（0.6.29）が使用してnginxのワーカープロセスのプロファイリングが可能<a href="https://github.com/gperftools/gperftools">Googleのパフォーマンスツールを</a>。このモジュールはnginx開発者を対象としています。
ko: <code>ngx_google_perftools_module</code> 의 모듈 (0.6.29)은 사용의 nginx 작업자 프로세스의 프로파일 링 할 수 있습니다 <a href="https://github.com/gperftools/gperftools">구글 성능 도구를</a> . 이 모듈은 nginx 개발자를위한 것입니다.
ru: Модуль <code>ngx_google_perftools_module</code> (0.6.29) позволяет профилировать рабочие процессы nginx с помощью <a href="https://github.com/gperftools/gperftools">Google Performance Tools</a> . Модуль предназначен для разработчиков nginx.
zh_cn: 该 <code>ngx_google_perftools_module</code> 模块（0.6.29），可使用nginx的工作进程的剖析<a href="https://github.com/gperftools/gperftools">谷歌性能工具</a>。该模块适用于Nginx开发人员。

source: The <code>ngx_http_access_module</code> module allows limiting access to certain client addresses.
es: El m&oacute;dulo <code>ngx_http_access_module</code> permite limitar el acceso a determinadas direcciones de clientes.
ja: <code>ngx_http_access_module</code> モジュールは、特定のクライアントのアドレスへのアクセスを制限することができます。
ko: <code>ngx_http_access_module</code> 모듈은 특정 클라이언트 주소에 대한 액세스를 제한 할 수 있습니다.
ru: Модуль <code>ngx_http_access_module</code> позволяет ограничить доступ к определенным адресам клиентов.
zh_cn: 该 <code>ngx_http_access_module</code> 模块允许限制访问某些客户端地址。

source: The <code>ngx_http_addition_module</code> module is a filter that adds text before and after a response. This module is not built by default, it should be enabled with the <code>--with-http_addition_module</code> configuration parameter.
es: El m&oacute;dulo <code>ngx_http_addition_module</code> es un filtro que agrega texto antes y despu&eacute;s de una respuesta. Este m&oacute;dulo no est&aacute; construido de manera predeterminada, debe habilitarse con el <code>--with-http_addition_module</code> configuraci&oacute;n --with-http_addition_module .
ja: <code>ngx_http_addition_module</code> モジュールが応答する前と後にテキストを追加するフィルタです。このモジュールはデフォルトではビルドされません <code>--with-http_addition_module</code> 設定パラメーターで有効にする必要があります。
ko: <code>ngx_http_addition_module</code> 모듈 전과 반응 후에 텍스트를 추가하는 필터이다. 이 모듈은 기본적으로 빌드되지 않으며 <code>--with-http_addition_module</code> 구성 매개 변수를 사용하여 활성화해야합니다 .
ru: Модуль <code>ngx_http_addition_module</code> - это фильтр, который добавляет текст до и после ответа. Этот модуль не <code>--with-http_addition_module</code> по умолчанию, его следует включить с помощью параметра конфигурации --with-http_addition_module .
zh_cn: 该 <code>ngx_http_addition_module</code> 模块是一个过滤器，前后响应后添加文本。默认情况下未构建此模块，应使用 <code>--with-http_addition_module</code> 配置参数启用它。

source: The <code>ngx_http_api_module</code> module (1.13.3) provides REST API for accessing various status information, configuring upstream server groups on-the-fly, and managing <a href="ngx_http_keyval_module">key-value pairs</a> without the need of reconfiguring nginx.
es: El m&oacute;dulo <code>ngx_http_api_module</code> (1.13.3) proporciona una API REST para acceder a informaci&oacute;n de estado variada, configurar grupos de servidores ascendentes sobre la marcha y administrar <a href="ngx_http_keyval_module">pares clave-valor</a> sin la necesidad de reconfigurar nginx.
ja: <code>ngx_http_api_module</code> のモジュール（1.13.3）は、さまざまなステータス情報にアクセスオンザフライ上流のサーバグループを設定し、管理するためのREST APIを提供し<a href="ngx_http_keyval_module">、キーと値のペアを</a> nginxのを再構成する必要なし。
ko: <code>ngx_http_api_module</code> 의 모듈 (1.13.3)은 각종 상태 정보에 액세스 즉석에서 업스트림 서버 그룹을 구성 및 관리 REST API를 제공 <a href="ngx_http_keyval_module">키 - 값 쌍을</a> nginx를 재구성 할 필요없이.
ru: Модуль <code>ngx_http_api_module</code> (1.13.3) предоставляет REST API для доступа к различной информации о статусе, настройки групп вышестоящих серверов на лету и управления <a href="ngx_http_keyval_module">парами ключ-значение</a> без необходимости перенастраивать nginx.
zh_cn: 所述 <code>ngx_http_api_module</code> 模块（1.13.3）提供REST API访问的各种状态信息，关于即时配置上游服务器组，并管理<a href="ngx_http_keyval_module">键-值对</a>，而无需重新配置Nginx的。

source: The <code>ngx_http_auth_basic_module</code> module allows limiting access to resources by validating the user name and password using the &ldquo;HTTP Basic Authentication&rdquo; protocol.
es: El m&oacute;dulo <code>ngx_http_auth_basic_module</code> permite limitar el acceso a los recursos mediante la validaci&oacute;n del nombre de usuario y la contrase&ntilde;a mediante el protocolo &ldquo;Autenticaci&oacute;n b&aacute;sica HTTP&rdquo;.
ja: <code>ngx_http_auth_basic_module</code> モジュールは、「HTTP基本認証」プロトコルを使用して、ユーザー名とパスワードを検証することにより、リソースへのアクセスを制限することができます。
ko: <code>ngx_http_auth_basic_module</code> 모듈은 사용자 이름의 유효성을 검사하고 암호 "HTTP 기본 인증"프로토콜을 사용하여 리소스에 대한 액세스를 제한 할 수 있습니다.
ru: Модуль <code>ngx_http_auth_basic_module</code> позволяет ограничить доступ к ресурсам путем проверки имени пользователя и пароля с использованием протокола &laquo;HTTP Basic Authentication&raquo;.
zh_cn: 所述 <code>ngx_http_auth_basic_module</code> 模块允许通过验证的用户名和使用&ldquo;HTTP基本认证&rdquo;协议密码限制对资源的访问。
