Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/nginx/nginx.*.004.xlf
Languages: es, ja, ko, ru, zh_cn

source: The <code>ngx_http_rewrite_module</code> module is used to change request URI using PCRE regular expressions, return redirects, and conditionally select configurations.
es: El m&oacute;dulo <code>ngx_http_rewrite_module</code> se usa para cambiar el URI de solicitud usando expresiones regulares PCRE, devolver redireccionamientos y seleccionar configuraciones condicionalmente.
ja: <code>ngx_http_rewrite_module</code> モジュールはPCRE正規表現、リターンリダイレクト、および条件付きで選択した構成を使用して変更要求URIに使用されています。
ko: <code>ngx_http_rewrite_module</code> 모듈은 PCRE 정규 표현식, 반환 리디렉션, 조건부 선택 구성을 사용하여 변경 요청 URI에 사용됩니다.
ru: Модуль <code>ngx_http_rewrite_module</code> используется для изменения URI запроса с использованием регулярных выражений PCRE, возврата перенаправлений и условного выбора конфигураций.
zh_cn: 所述 <code>ngx_http_rewrite_module</code> 模块使用PCRE正则表达式，返回重定向，并有条件地选择配置用于改变请求URI。

source: The <code>ngx_http_scgi_module</code> module allows passing requests to an SCGI server.
es: El m&oacute;dulo <code>ngx_http_scgi_module</code> permite pasar solicitudes a un servidor SCGI.
ja: <code>ngx_http_scgi_module</code> モジュールはSCGIサーバに要求を渡すことができます。
ko: <code>ngx_http_scgi_module</code> 모듈은 SCGI 서버로 요청을 전달 할 수 있습니다.
ru: Модуль <code>ngx_http_scgi_module</code> позволяет передавать запросы на сервер SCGI.
zh_cn: 该 <code>ngx_http_scgi_module</code> 模块允许请求传递到SCGI服务器。

source: The <code>ngx_http_secure_link_module</code> module (0.7.18) is used to check authenticity of requested links, protect resources from unauthorized access, and limit link lifetime.
es: El m&oacute;dulo <code>ngx_http_secure_link_module</code> (0.7.18) se usa para verificar la autenticidad de los enlaces solicitados, proteger los recursos del acceso no autorizado y limitar la vida &uacute;til del enlace.
ja: <code>ngx_http_secure_link_module</code> モジュール（0.7.18）が要求されたリンク、不正なアクセスから保護リソース、およびリミットリンク寿命の信頼性を確認するために使用されます。
ko: <code>ngx_http_secure_link_module</code> 의 모듈 (0.7.18) 요청 링크, 무단 액세스로부터 보호 자원 및 한계 링크 수명의 인증을 확인하는 데 사용됩니다.
ru: Модуль <code>ngx_http_secure_link_module</code> (0.7.18) используется для проверки подлинности запрошенных ссылок, защиты ресурсов от несанкционированного доступа и ограничения времени жизни ссылок.
zh_cn: 该 <code>ngx_http_secure_link_module</code> 模块（0.7.18）用于检查请求的链接，未经授权的访问保护资源，并限制链接一生的真实性。

source: The <code>ngx_http_send_header(r)</code> function invokes the header filter chain by calling the first header filter handler stored in the <code>ngx_http_top_header_filter</code> variable. It's assumed that every header handler calls the next handler in the chain until the final handler <code>ngx_http_header_filter(r)</code> is called. The final header handler constructs the HTTP response based on <code>r-&gt;headers_out</code> and passes it to the <code>ngx_http_writer_filter</code> for output.
es: La funci&oacute;n <code>ngx_http_send_header(r)</code> invoca la cadena de filtro de encabezado llamando al primer controlador de filtro de encabezado almacenado en la variable <code>ngx_http_top_header_filter</code> . Se supone que cada controlador de encabezado llama al siguiente controlador de la cadena hasta que se llama al controlador final <code>ngx_http_header_filter(r)</code> . El controlador de encabezado final construye la respuesta HTTP basada en <code>r-&gt;headers_out</code> y la pasa al <code>ngx_http_writer_filter</code> para su salida.
ja: <code>ngx_http_send_header(r)</code> 関数は、に格納された第1のヘッダ・フィルタ・ハンドラを呼び出すことによって、ヘッダ・フィルタ・チェーンを呼び出す <code>ngx_http_top_header_filter</code> の変数。最後のハンドラー <code>ngx_http_header_filter(r)</code> が呼び出されるまで、すべてのヘッダーハンドラーがチェーン内の次のハンドラーを呼び出すと想定されています。最後のヘッダーハンドラーは、 <code>r-&gt;headers_out</code> に基づいてHTTP応答を作成し、それを <code>ngx_http_writer_filter</code> に渡して出力します。
ko: <code>ngx_http_send_header(r)</code> 함수에 저장된 1 헤더 필터 핸들러 호출 헤더 필터 체인을 호출 <code>ngx_http_top_header_filter</code> 의 변수. 최종 핸들러 <code>ngx_http_header_filter(r)</code> 가 호출 될 때까지 모든 헤더 핸들러가 체인의 다음 핸들러를 호출한다고 가정합니다 . 최종 헤더 핸들러는 <code>r-&gt;headers_out</code> 을 기반으로 HTTP 응답을 구성하고 출력 을 위해 <code>ngx_http_writer_filter</code> 로 전달합니다 .
ru: Функция <code>ngx_http_send_header(r)</code> вызывает цепочку фильтров заголовков, вызывая первый обработчик фильтра заголовков, хранящийся в переменной <code>ngx_http_top_header_filter</code> . Предполагается, что каждый обработчик заголовка вызывает следующий обработчик в цепочке до тех пор, пока не будет вызван последний обработчик <code>ngx_http_header_filter(r)</code> . Последний обработчик заголовка создает HTTP-ответ на основе <code>r-&gt;headers_out</code> и передает его <code>ngx_http_writer_filter</code> для вывода.
zh_cn: 所述 <code>ngx_http_send_header(r)</code> 的函数通过调用存储在所述第一集管过滤器处理程序调用头过滤器链 <code>ngx_http_top_header_filter</code> 变量。假定每个标头处理程序都调用链中的下一个处理程序，直到调用最终处理程序 <code>ngx_http_header_filter(r)</code> 为止。最终的标头处理程序基于 <code>r-&gt;headers_out</code> 构造HTTP响应，并将其传递给 <code>ngx_http_writer_filter</code> 进行输出。

source: The <code>ngx_http_send_header(r)</code> function sends the output header. Do not call this function until <code>r-&gt;headers_out</code> contains all of the data required to produce the HTTP response header. The <code>status</code> field in <code>r-&gt;headers_out</code> must always be set. If the response status indicates that a response body follows the header, <code>content_length_n</code> can be set as well. The default value for this field is <code>-1</code>, which means that the body size is unknown. In this case, chunked transfer encoding is used. To output an arbitrary header, append the <code>headers</code> list.
es: La funci&oacute;n <code>ngx_http_send_header(r)</code> env&iacute;a el encabezado de salida. No llame a esta funci&oacute;n hasta que <code>r-&gt;headers_out</code> contenga todos los datos necesarios para producir el encabezado de respuesta HTTP. El campo de <code>status</code> en <code>r-&gt;headers_out</code> siempre debe estar configurado. Si el estado de la respuesta indica que un cuerpo de respuesta sigue al encabezado, tambi&eacute;n se puede establecer <code>content_length_n</code> . El valor predeterminado para este campo es <code>-1</code> , lo que significa que se desconoce el tama&ntilde;o del cuerpo. En este caso, se utiliza la codificaci&oacute;n de transferencia fragmentada. Para generar un encabezado arbitrario, agregue la lista de <code>headers</code> .
ja: <code>ngx_http_send_header(r)</code> 関数は、出力ヘッダを送信します。 <code>r-&gt;headers_out</code> にHTTP応答ヘッダーの生成に必要なすべてのデータが含まれるまで、この関数を呼び出さないでください。 <code>r-&gt;headers_out</code> の <code>status</code> フィールドは常に設定する必要があります。応答ステータスが、応答本文がヘッダーに続くことを示している場合、 <code>content_length_n</code> も設定できます。このフィールドのデフォルト値は <code>-1</code> です。これは、本体のサイズが不明であることを意味します。この場合、チャンク転送エンコーディングが使用されます。任意のヘッダーを出力するには、 <code>headers</code> リストを追加します。
ko: <code>ngx_http_send_header(r)</code> 함수는 출력 헤더를 전송한다. <code>r-&gt;headers_out</code> 에 HTTP 응답 헤더를 생성하는 데 필요한 모든 데이터가 포함될 때까지이 함수를 호출하지 마십시오 . <code>r-&gt;headers_out</code> 의 <code>status</code> 필드 는 항상 설정해야합니다. 응답 상태가 응답 본문이 헤더를 따르는 것으로 표시하면 <code>content_length_n</code> 도 설정할 수 있습니다. 이 필드의 기본값은 <code>-1</code> 이며 본문 크기를 알 수 없음을 의미합니다. 이 경우 청크 전송 인코딩이 사용됩니다. 임의의 헤더를 출력하려면 <code>headers</code> 목록을 추가하십시오 .
ru: Функция <code>ngx_http_send_header(r)</code> отправляет выходной заголовок. Не вызывайте эту функцию, пока <code>r-&gt;headers_out</code> не содержит все данные, необходимые для создания заголовка ответа HTTP. Поле <code>status</code> в <code>r-&gt;headers_out</code> должно быть установлено всегда. Если статус ответа указывает, что тело ответа следует за заголовком, также можно установить <code>content_length_n</code> . Значение по умолчанию для этого поля - <code>-1</code> , что означает, что размер тела неизвестен. В этом случае используется кодирование передачи по частям. Чтобы вывести произвольный заголовок, добавьте список <code>headers</code> .
zh_cn: 所述 <code>ngx_http_send_header(r)</code> 的函数发送输出头。在 <code>r-&gt;headers_out</code> 包含生成HTTP响应标头所需的所有数据之前，请勿调用此函数。必须始终设置 <code>r-&gt;headers_out</code> 中的 <code>status</code> 字段。如果响应状态指示响应正文紧跟标题，则也可以设置 <code>content_length_n</code> 。该字段的默认值为 <code>-1</code> ，这意味着主体大小未知。在这种情况下，使用分块传输编码。要输出任意标题，请附加 <code>headers</code> 列表。

source: The <code>ngx_http_session_log_module</code> module enables logging sessions (that is, aggregates of multiple HTTP requests) instead of individual HTTP requests.
es: El m&oacute;dulo <code>ngx_http_session_log_module</code> habilita sesiones de registro (es decir, agregados de m&uacute;ltiples solicitudes HTTP) en lugar de solicitudes HTTP individuales.
ja: <code>ngx_http_session_log_module</code> モジュールではなく、個々のHTTPリクエストの（、複数のHTTPリクエストの集合体である）ロギングセッションを可能にします。
ko: <code>ngx_http_session_log_module</code> 모듈은 세션을 기록 할 수 있습니다 (즉, 여러 HTTP 요청 집계) 대신 개별 HTTP 요청.
ru: Модуль <code>ngx_http_session_log_module</code> позволяет регистрировать сеансы (то есть агрегаты нескольких HTTP-запросов) вместо отдельных HTTP-запросов.
zh_cn: 所述 <code>ngx_http_session_log_module</code> 模块使记录会话（即，多个HTTP请求的聚集体），而不是个别的HTTP请求。

source: The <code>ngx_http_session_log_module</code> module supports two embedded variables:
es: El m&oacute;dulo <code>ngx_http_session_log_module</code> admite dos variables integradas:
ja: <code>ngx_http_session_log_module</code> モジュールには2つの組み込み変数をサポートしています。
ko: <code>ngx_http_session_log_module</code> 모듈은 두 변수를 포함 지원
ru: Модуль <code>ngx_http_session_log_module</code> поддерживает две встроенные переменные:
zh_cn: 该 <code>ngx_http_session_log_module</code> 模块支持两个嵌入式变量：

source: The <code>ngx_http_set_complex_value_slot()</code> is a convenient function used to initialize a complex value completely in the directive declaration itself.
es: El <code>ngx_http_set_complex_value_slot()</code> es una funci&oacute;n pr&aacute;ctica utilizada para inicializar un valor complejo por completo en la propia declaraci&oacute;n directiva.
ja: <code>ngx_http_set_complex_value_slot()</code> ディレクティブ宣言自体に完全に複素数値を初期化するために使用される便利な機能です。
ko: <code>ngx_http_set_complex_value_slot()</code> 지향성 선언 자체 완전히 복소 값을 초기화하는 데 편리한 기능이다.
ru: <code>ngx_http_set_complex_value_slot()</code> является удобная функция используется , чтобы полностью инициализировать комплексное значение в самой директиве декларации.
zh_cn: 所述 <code>ngx_http_set_complex_value_slot()</code> 是用于在该指令声明本身完全初始化的复数值一个方便的功能。

source: The <code>ngx_http_slice_module</code> module (1.9.8) is a filter that splits a request into subrequests, each returning a certain range of response. The filter provides more effective caching of big responses.
es: El m&oacute;dulo <code>ngx_http_slice_module</code> (1.9.8) es un filtro que divide una solicitud en subpeticiones, cada una de las cuales devuelve un cierto rango de respuesta. El filtro proporciona un almacenamiento en cach&eacute; m&aacute;s eficaz de grandes respuestas.
ja: <code>ngx_http_slice_module</code> モジュール（1.9.8）は、各応答の特定の範囲を返し、サブリクエストに要求を分割するフィルタです。フィルターは、大きな応答のより効果的なキャッシュを提供します。
ko: <code>ngx_http_slice_module</code> 모듈 (1.9.8)의 하위 요청에 대한 요구를 각각의 응답의 특정 범위를 반환을 분할하는 필터이다. 이 필터는 큰 응답을보다 효과적으로 캐싱합니다.
ru: Модуль <code>ngx_http_slice_module</code> (1.9.8) - это фильтр, который разбивает запрос на подзапросы, каждый из которых возвращает определенный диапазон ответов. Фильтр обеспечивает более эффективное кеширование больших ответов.
zh_cn: 所述 <code>ngx_http_slice_module</code> 模块（1.9.8）是一个分割请求转换成子请求，每个返回一定范围内响应的滤波器。筛选器可为大响应提供更有效的缓存。

source: The <code>ngx_http_slice_module</code> module supports the following embedded variables:
es: El m&oacute;dulo <code>ngx_http_slice_module</code> admite las siguientes variables integradas:
ja: <code>ngx_http_slice_module</code> モジュールは以下の埋め込み変数をサポートしています。
ko: <code>ngx_http_slice_module</code> 모듈은 다음과 같은 포함 된 변수를 지원합니다 :
ru: Модуль <code>ngx_http_slice_module</code> поддерживает следующие встроенные переменные:
zh_cn: 该 <code>ngx_http_slice_module</code> 模块支持以下内置变量：

source: The <code>ngx_http_spdy_module</code> module provides experimental support for <a href="http://www.chromium.org/spdy/spdy-protocol">SPDY</a>. Currently, <a href="http://www.chromium.org/spdy/spdy-protocol/spdy-protocol-draft3-1">draft 3.1</a> of SPDY protocol is implemented.
es: El m&oacute;dulo <code>ngx_http_spdy_module</code> proporciona soporte experimental para <a href="http://www.chromium.org/spdy/spdy-protocol">SPDY</a> . Actualmente, se implementa el <a href="http://www.chromium.org/spdy/spdy-protocol/spdy-protocol-draft3-1">borrador 3.1</a> del protocolo SPDY.
ja: <code>ngx_http_spdy_module</code> モジュールはのための実験的なサポートを提供<a href="http://www.chromium.org/spdy/spdy-protocol">SPDYを</a>。現在、SPDYプロトコルの<a href="http://www.chromium.org/spdy/spdy-protocol/spdy-protocol-draft3-1">ドラフト3.1</a>が実装されています。
ko: <code>ngx_http_spdy_module</code> 모듈에 대한 실험적인 지원을 제공 <a href="http://www.chromium.org/spdy/spdy-protocol">SPDY를</a> . 현재 SPDY 프로토콜의 <a href="http://www.chromium.org/spdy/spdy-protocol/spdy-protocol-draft3-1">초안 3.1</a> 이 구현되었습니다.
ru: Модуль <code>ngx_http_spdy_module</code> обеспечивает экспериментальную поддержку <a href="http://www.chromium.org/spdy/spdy-protocol">SPDY</a> . В настоящее время реализован <a href="http://www.chromium.org/spdy/spdy-protocol/spdy-protocol-draft3-1">проект 3.1</a> протокола SPDY.
zh_cn: 该 <code>ngx_http_spdy_module</code> 模块提供实验支持<a href="http://www.chromium.org/spdy/spdy-protocol">SPDY</a>。目前，SPDY协议<a href="http://www.chromium.org/spdy/spdy-protocol/spdy-protocol-draft3-1">草案3.1</a>已实施。

source: The <code>ngx_http_spdy_module</code> module supports the following embedded variables:
es: El m&oacute;dulo <code>ngx_http_spdy_module</code> admite las siguientes variables integradas:
ja: <code>ngx_http_spdy_module</code> モジュールは以下の埋め込み変数をサポートしています。
ko: <code>ngx_http_spdy_module</code> 모듈은 다음과 같은 포함 된 변수를 지원합니다 :
ru: Модуль <code>ngx_http_spdy_module</code> поддерживает следующие встроенные переменные:
zh_cn: 该 <code>ngx_http_spdy_module</code> 模块支持以下内置变量：

source: The <code>ngx_http_split_clients_module</code> module creates variables suitable for A/B testing, also known as split testing.
es: El m&oacute;dulo <code>ngx_http_split_clients_module</code> crea variables adecuadas para las pruebas A / B, tambi&eacute;n conocidas como pruebas divididas.
ja: <code>ngx_http_split_clients_module</code> モジュールは、分割テストとして知られているA / Bテストに適した変数を作成します。
ko: <code>ngx_http_split_clients_module</code> 모듈은 분할 테스트 알려진 A / B 테스팅에 적합한 변수를 생성한다.
ru: Модуль <code>ngx_http_split_clients_module</code> создает переменные, подходящие для A / B-тестирования, также известного как сплит-тестирование.
zh_cn: 所述 <code>ngx_http_split_clients_module</code> 模块创建适合于A / B测试，也称为分割测试变量。

source: The <code>ngx_http_ssi_module</code> module is a filter that processes SSI (Server Side Includes) commands in responses passing through it. Currently, the list of supported SSI commands is incomplete.
es: El m&oacute;dulo <code>ngx_http_ssi_module</code> es un filtro que procesa los comandos SSI (Server Side Include) en las respuestas que lo atraviesan. Actualmente, la lista de comandos SSI admitidos est&aacute; incompleta.
ja: <code>ngx_http_ssi_module</code> モジュールは、それを通過する応答でSSI（サーバーサイドインクルード）コマンドを処理フィルタです。現在、サポートされているSSIコマンドのリストは不完全です。
ko: <code>ngx_http_ssi_module</code> 모듈은 통과 응답에서 SSI (서버 사이드 포함) 명령을 처리하는 필터입니다. 현재 지원되는 SSI 명령 목록이 불완전합니다.
ru: Модуль <code>ngx_http_ssi_module</code> - это фильтр, который обрабатывает команды SSI (Server Side Includes) в ответах, проходящих через него. В настоящее время список поддерживаемых команд SSI неполон.
zh_cn: 所述 <code>ngx_http_ssi_module</code> 模块是，在通过它的应答处理SSI（服务器端包含）的命令的过滤器。当前，受支持的SSI命令列表不完整。

source: The <code>ngx_http_ssi_module</code> module supports two embedded variables:
es: El m&oacute;dulo <code>ngx_http_ssi_module</code> admite dos variables integradas:
ja: <code>ngx_http_ssi_module</code> モジュールには2つの組み込み変数をサポートしています。
ko: <code>ngx_http_ssi_module</code> 모듈은 두 변수를 포함 지원
ru: Модуль <code>ngx_http_ssi_module</code> поддерживает две встроенные переменные:
zh_cn: 该 <code>ngx_http_ssi_module</code> 模块支持两个嵌入式变量：

source: The <code>ngx_http_ssl_module</code> module provides the necessary support for HTTPS.
es: El m&oacute;dulo <code>ngx_http_ssl_module</code> proporciona el soporte necesario para HTTPS.
ja: <code>ngx_http_ssl_module</code> モジュールはHTTPSのために必要なサポートを提供します。
ko: <code>ngx_http_ssl_module</code> 모듈은 HTTPS에 필요한 지원을 제공합니다.
ru: Модуль <code>ngx_http_ssl_module</code> обеспечивает необходимую поддержку HTTPS.
zh_cn: 该 <code>ngx_http_ssl_module</code> 模块提供HTTPS必要的支持。

source: The <code>ngx_http_ssl_module</code> module supports embedded variables:
es: El m&oacute;dulo <code>ngx_http_ssl_module</code> admite variables integradas:
ja: <code>ngx_http_ssl_module</code> モジュールは、組み込み変数をサポートしています。
ko: <code>ngx_http_ssl_module</code> 모듈 내장 변수를 지원한다 :
ru: Модуль <code>ngx_http_ssl_module</code> поддерживает встроенные переменные:
zh_cn: 该 <code>ngx_http_ssl_module</code> 模块支持嵌入变量：

source: The <code>ngx_http_ssl_module</code> module supports several non-standard error codes that can be used for redirects using the <a href="ngx_http_core_module#error_page">error_page</a> directive:
es: El m&oacute;dulo <code>ngx_http_ssl_module</code> admite varios c&oacute;digos de error no est&aacute;ndar que se pueden utilizar para redireccionamientos mediante la directiva <a href="ngx_http_core_module#error_page">error_page</a> :
ja: <code>ngx_http_ssl_module</code> モジュールが使用してリダイレクトするために使用できるいくつかの非標準的なエラーコードサポート<a href="ngx_http_core_module#error_page">error_pageの</a>ディレクティブを：
ko: <code>ngx_http_ssl_module</code> 모듈은 사용 리디렉션을 위해 사용할 수있는 몇 가지 표준이 아닌 에러 코드 지원 <a href="ngx_http_core_module#error_page">error_page의</a> 지시를 :
ru: Модуль <code>ngx_http_ssl_module</code> поддерживает несколько нестандартных кодов ошибок, которые можно использовать для перенаправления с <a href="ngx_http_core_module#error_page">помощью</a> директивы error_page :
zh_cn: 所述 <code>ngx_http_ssl_module</code> 模块支持可用于使用重定向几个非标准错误码<a href="ngx_http_core_module#error_page">error_page</a>指令：

source: The <code>ngx_http_status_module</code> module provides access to various status information.
es: El m&oacute;dulo <code>ngx_http_status_module</code> proporciona acceso a diversa informaci&oacute;n de estado.
ja: <code>ngx_http_status_module</code> モジュールは、さまざまなステータス情報へのアクセスを提供します。
ko: <code>ngx_http_status_module</code> 모듈은 다양한 상태 정보에 대한 액세스를 제공합니다.
ru: Модуль <code>ngx_http_status_module</code> предоставляет доступ к различной информации о состоянии.
zh_cn: 该 <code>ngx_http_status_module</code> 模块提供各种状态信息。

source: The <code>ngx_http_stub_status_module</code> module provides access to basic status information.
es: El m&oacute;dulo <code>ngx_http_stub_status_module</code> proporciona acceso a informaci&oacute;n de estado b&aacute;sica.
ja: <code>ngx_http_stub_status_module</code> モジュールは、基本的なステータス情報へのアクセスを提供します。
ko: <code>ngx_http_stub_status_module</code> 모듈은 기본 상태 정보에 대한 액세스를 제공합니다.
ru: Модуль <code>ngx_http_stub_status_module</code> обеспечивает доступ к базовой информации о состоянии.
zh_cn: 该 <code>ngx_http_stub_status_module</code> 模块提供的基本状态信息。

source: The <code>ngx_http_stub_status_module</code> module supports the following embedded variables (1.3.14):
es: El m&oacute;dulo <code>ngx_http_stub_status_module</code> admite las siguientes variables integradas (1.3.14):
ja: <code>ngx_http_stub_status_module</code> モジュールは、以下の組み込み変数（1.3.14）をサポートしています。
ko: <code>ngx_http_stub_status_module</code> 모듈 지지부 다음 매립 변수 (1.3.14)
ru: Модуль <code>ngx_http_stub_status_module</code> поддерживает следующие встроенные переменные (1.3.14):
zh_cn: 所述 <code>ngx_http_stub_status_module</code> 模块支持以下嵌入变量（1.3.14）：

source: The <code>ngx_http_sub_module</code> module is a filter that modifies a response by replacing one specified string by another.
es: El m&oacute;dulo <code>ngx_http_sub_module</code> es un filtro que modifica una respuesta reemplazando una cadena especificada por otra.
ja: <code>ngx_http_sub_module</code> モジュールは、別ずつ指定された文字列を置換することによって修正応答ことフィルタです。
ko: <code>ngx_http_sub_module</code> 모듈은 필터 인 수정하게 다른 하나 지정된 문자열로 대체함으로써 응답.
ru: Модуль <code>ngx_http_sub_module</code> - это фильтр, который изменяет ответ, заменяя одну указанную строку другой.
zh_cn: 所述 <code>ngx_http_sub_module</code> 模块是一个过滤器，通过修改由另一替换一个指定的字符串的响应。

source: The <code>ngx_http_time(buf, time)</code> function returns a string representation suitable for use in HTTP headers (for example, <code>"Mon, 28 Sep 1970 06:00:00 GMT"</code>). The <code>ngx_http_cookie_time(buf, time)</code> returns a string representation function returns a string representation suitable for HTTP cookies (<code>"Thu, 31-Dec-37 23:55:55 GMT"</code>).
es: La funci&oacute;n <code>ngx_http_time(buf, time)</code> devuelve una representaci&oacute;n de cadena adecuada para su uso en encabezados HTTP (por ejemplo, <code>"Mon, 28 Sep 1970 06:00:00 GMT"</code> ). El <code>ngx_http_cookie_time(buf, time)</code> devuelve una funci&oacute;n de representaci&oacute;n de cadena devuelve una representaci&oacute;n de cadena adecuado para las cookies HTTP ( <code>"Thu, 31-Dec-37 23:55:55 GMT"</code> ).
ja: <code>ngx_http_time(buf, time)</code> HTTPヘッダーに使用するための文字列表現の適切な関数が返す（例えば、 <code>"Mon, 28 Sep 1970 06:00:00 GMT"</code> ）。 <code>ngx_http_cookie_time(buf, time)</code> 文字列表現関数はHTTPクッキーに適した文字列表現を返す（返し <code>"Thu, 31-Dec-37 23:55:55 GMT"</code> ）。
ko: <code>ngx_http_time(buf, time)</code> HTTP 헤더에 사용되는 문자열 표현에 적합한 함수가 반환 (예를 들어, <code>"Mon, 28 Sep 1970 06:00:00 GMT"</code> ). <code>ngx_http_cookie_time(buf, time)</code> 문자열 표현의 기능은 HTTP 쿠키에 적합한 문자열 표현을 반환 (반환 <code>"Thu, 31-Dec-37 23:55:55 GMT"</code> ).
ru: Функция <code>ngx_http_time(buf, time)</code> возвращает строковое представление, подходящее для использования в заголовках HTTP (например, <code>"Mon, 28 Sep 1970 06:00:00 GMT"</code> ). <code>ngx_http_cookie_time(buf, time)</code> возвращает функция строкового представления возвращает строковое представление подходящего для HTTP печенье ( <code>"Thu, 31-Dec-37 23:55:55 GMT"</code> ).
zh_cn: 所述 <code>ngx_http_time(buf, time)</code> 函数返回字符串表示适合于在HTTP头中使用（例如， <code>"Mon, 28 Sep 1970 06:00:00 GMT"</code> ）。所述 <code>ngx_http_cookie_time(buf, time)</code> 返回一个字符串表示函数返回适合的HTTP cookies的字符串表示（ <code>"Thu, 31-Dec-37 23:55:55 GMT"</code> ）。
