Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/nginx/nginx.*.004.xlf
Languages: es, ja, ko, ru, zh_cn

source: The checksum value extracted from the string is compared with the MD5 hash value of the expression defined by the <a href="#secure_link_md5">secure_link_md5</a> directive. If the checksums are different, the <code>$secure_link</code> variable is set to an empty string. If the checksums are the same, the link lifetime is checked. If the link has a limited lifetime and the time has expired, the <code>$secure_link</code> variable is set to &ldquo;<code>0</code>&rdquo;. Otherwise, it is set to &ldquo;<code>1</code>&rdquo;. The MD5 hash value passed in a request is encoded in <a href="https://tools.ietf.org/html/rfc4648#section-5">base64url</a>.
es: El valor de suma de comprobaci&oacute;n extra&iacute;do de la cadena se compara con el valor hash MD5 de la expresi&oacute;n definida por la directiva <a href="#secure_link_md5">secure_link_md5</a> . Si las sumas de verificaci&oacute;n son diferentes, la variable <code>$secure_link</code> se establece en una cadena vac&iacute;a. Si las sumas de comprobaci&oacute;n son las mismas, se comprueba la vida &uacute;til del enlace. Si el enlace tiene una vida &uacute;til limitada y el tiempo ha expirado, la variable <code>$secure_link</code> se establece en " <code>0</code> ". De lo contrario, se establece en " <code>1</code> ". El valor hash MD5 pasado en una solicitud se codifica en <a href="https://tools.ietf.org/html/rfc4648#section-5">base64url</a> .
ja: 文字列から抽出されたチェックサム値は、<a href="#secure_link_md5">secure_link_md5</a>ディレクティブで定義された式のMD5ハッシュ値と比較されます。チェックサムが異なる場合、 <code>$secure_link</code> 変数は空の文字列に設定されます。チェックサムが同じ場合は、リンクの有効期間がチェックされます。リンクのライフタイムが制限されており、時間が経過した場合、 <code>$secure_link</code> 変数は「 <code>0</code> 」に設定されます。それ以外の場合は、「 <code>1</code> 」に設定されます。リクエストで渡されたMD5ハッシュ値は<a href="https://tools.ietf.org/html/rfc4648#section-5">base64url</a>でエンコードされます。
ko: 문자열에서 추출 된 체크섬 값은 <a href="#secure_link_md5">secure_link_md5</a> 지시문에 의해 정의 된 표현식의 MD5 해시 값과 비교됩니다 . 체크섬이 다른 경우 <code>$secure_link</code> 변수는 빈 문자열로 설정됩니다. 체크섬이 동일하면 링크 수명이 확인됩니다. 링크 수명이 제한되어 있고 시간이 만료 된 경우 <code>$secure_link</code> 변수는 " <code>0</code> "으로 설정됩니다 . 그렇지 않으면 " <code>1</code> "로 설정됩니다 . 요청에 전달 된 MD5 해시 값은 <a href="https://tools.ietf.org/html/rfc4648#section-5">base64url</a> 로 인코딩됩니다 .
ru: Значение контрольной суммы, извлеченное из строки, сравнивается с хеш-значением MD5 выражения, определенного директивой <a href="#secure_link_md5">secure_link_md5</a> . Если контрольные суммы разные, переменная <code>$secure_link</code> устанавливается в пустую строку. Если контрольные суммы совпадают, проверяется время жизни ссылки. Если срок действия ссылки ограничен и время истекло, переменная <code>$secure_link</code> устанавливается в &laquo; <code>0</code> &raquo;. В противном случае устанавливается значение &laquo; <code>1</code> &raquo;. Хеш-значение MD5, переданное в запросе, кодируется в <a href="https://tools.ietf.org/html/rfc4648#section-5">base64url</a> .

source: The code 307 was not treated as a redirect until versions 1.1.16 and 1.0.13.
es: El código 307 no fue tratado como una redirección hasta las versiones 1.1.16 y 1.0.13.
ja: コード307はバージョン1.1.16と1.0.13までリダイレクトとして扱われていませんでした。
ko: 코드 307은 버전 1.1.16 및 1.0.13까지 리디렉션으로 처리되지 않았습니다.
ru: Код 307 не рассматривался как перенаправление до версий 1.1.16 и 1.0.13.

source: The code 308 was not treated as a redirect until version 1.13.0.
es: El código 308 no fue tratado como una redirección hasta la versión 1.13.0.
ja: コード308はバージョン1.13.0まではリダイレクトとして扱われませんでした。
ko: 코드 308은 버전 1.13.0까지 리디렉션으로 처리되지 않았습니다.
ru: Код 308 не рассматривался как перенаправление до версии 1.13.0.

source: The compiled regular expression can then be used for matching against strings:
es: La expresión regular compilada puede entonces ser usada para la comparación con las cuerdas:
ja: コンパイルされた正規表現は、文字列とのマッチングに使用することができます。
ko: 그런 다음 컴파일 된 정규식을 사용하여 문자열과 일치시킬 수 있습니다.
ru: Затем скомпилированное регулярное выражение может быть использовано для сравнения со строками:

source: The completion <code>callback</code> receives a subrequest response object with methods and properties identical to the parent request object.
es: La <code>callback</code> finalizaci&oacute;n recibe un objeto de respuesta de sub-solicitud con m&eacute;todos y propiedades id&eacute;nticos al objeto de solicitud principal.
ja: 完了 <code>callback</code> は、親リクエストオブジェクトと同じメソッドとプロパティを持つサブリクエストレスポンスオブジェクトを受け取ります。
ko: 완료 <code>callback</code> 은 상위 요청 오브젝트와 동일한 메소드 및 특성을 가진 서브 요청 응답 오브젝트를 수신합니다.
ru: <code>callback</code> завершения получает объект ответа на подзапрос с методами и свойствами, идентичными родительскому объекту запроса.

source: The completion callback has the following prototype: <code>callback(data, flags)</code>, where <code>data</code> is string, <code>flags</code> is an object with the following properties:
es: La devoluci&oacute;n de llamada de finalizaci&oacute;n tiene el siguiente prototipo: <code>callback(data, flags)</code> , donde los <code>data</code> son una cadena, las <code>flags</code> son un objeto con las siguientes propiedades:
ja: 完了コールバックには次のプロトタイプがあります： <code>callback(data, flags)</code> 、ここで <code>data</code> は文字列、 <code>flags</code> は次のプロパティを持つオブジェクトです：
ko: 완료 콜백에는 다음 프로토 타입이 있습니다. <code>callback(data, flags)</code> , 여기서 <code>data</code> 는 string이고 <code>flags</code> 는 다음 속성을 가진 객체입니다.
ru: Обратный вызов завершения имеет следующий прототип: <code>callback(data, flags)</code> , где <code>data</code> - строка, <code>flags</code> - это объект со следующими свойствами:

source: The complex value description in <code>ngx_http_compile_complex_value</code> is compiled at the configuration stage into <code>ngx_http_complex_value_t</code> which is used at runtime to obtain results of expression evaluation.
es: La descripci&oacute;n del valor complejo en <code>ngx_http_compile_complex_value</code> se compila en la etapa de configuraci&oacute;n en <code>ngx_http_complex_value_t</code> que se usa en tiempo de ejecuci&oacute;n para obtener resultados de evaluaci&oacute;n de expresi&oacute;n.
ja: 複素数値説明 <code>ngx_http_compile_complex_value</code> はに設定段階でコンパイルさ <code>ngx_http_complex_value_t</code> 式の評価の結果を得るために実行時に使用されます。
ko: 복소 값의 설명 <code>ngx_http_compile_complex_value</code> 은 으로 구성 단계에서 컴파일 <code>ngx_http_complex_value_t</code> 식 평가의 결과를 얻기 위하여 실행시 사용된다.
ru: Описание комплексного значения в <code>ngx_http_compile_complex_value</code> компилируется на этапе конфигурации в <code>ngx_http_complex_value_t</code> , который используется во время выполнения для получения результатов оценки выражения.

source: The configuration always includes the predefined &ldquo;<code>combined</code>&rdquo; format:
es: La configuraci&oacute;n siempre incluye el formato " <code>combined</code> " predefinido :
ja: 構成には、事前定義された「 <code>combined</code> 」形式が常に含まれています。
ko: 구성에는 항상 사전 정의 된 " <code>combined</code> "형식이 포함 됩니다.
ru: Конфигурация всегда включает предопределенный &laquo; <code>combined</code> &raquo; формат:

source: The configuration parser uses these flags to throw an error in case of a misplaced directive and calls directive handlers supplied with a proper configuration pointer, so that the same directives in different locations can store their values in distinct places.
es: El analizador de configuración utiliza estas banderas para arrojar un error en caso de que una directiva se extravíe y llama a los manejadores de directivas que se suministran con un puntero de configuración adecuado,para que las mismas directivas en diferentes lugares puedan almacenar sus valores en lugares distintos.
ja: 設定パーサはこれらのフラグを使用して、 ディレクティブの位置を間違えた場合にエラーをスローし、 適切な設定ポインタが与えられたディレクティブハンドラを呼び出すことで、 異なる場所にある同じディレクティブの値を異なる場所に保存できるようにします。
ko: 구성 구문 분석기는이 플래그를 사용하여 잘못 배치 된 지시문의 경우 오류를 발생시키고 적절한 구성 포인터와 함께 제공된 지시문 핸들러를 호출하여 다른 위치의 동일한 지시문이 값을 개별 위치에 저장할 수 있습니다.
ru: Конфигурационный анализатор использует эти флаги для того,чтобы бросить ошибку в случае неуместной директивы,и вызывает обработчики директив,поставляемые с правильным указателем на конфигурацию,чтобы одни и те же директивы в разных местах могли хранить свои значения в разных местах.

source: The connection type <code>ngx_connection_t</code> is a wrapper around a socket descriptor. It includes the following fields:
es: El tipo de conexi&oacute;n <code>ngx_connection_t</code> es un envoltorio alrededor de un descriptor de socket. Incluye los siguientes campos:
ja: 接続タイプ <code>ngx_connection_t</code> は、ソケット記述子のラッパーです。次のフィールドがあります。
ko: 연결 유형 <code>ngx_connection_t</code> 는 소켓 설명자에 대한 랩퍼입니다. 다음과 같은 필드가 포함됩니다.
ru: Тип соединения <code>ngx_connection_t</code> - это оболочка вокруг дескриптора сокета. Он включает в себя следующие поля:

source: The contents of the &ldquo;Cache-Control&rdquo; field depends on the sign of the specified time:
es: El contenido del campo "Cache-Control" depende del signo de la hora especificada:
ja: 「Cache-Control」フィールドの内容は、指定された時刻の符号によって異なります。
ko: "Cache-Control"필드의 내용은 지정된 시간의 부호에 따라 다릅니다.
ru: Содержимое поля &laquo;Cache-Control&raquo; зависит от знака указанного времени:

source: The cookie name and received client identifier.
es: El nombre de la cookie y el identificador de cliente recibido.
ja: クッキー名と受信したクライアント識別子。
ko: 쿠키 이름 및 수신 된 클라이언트 식별자
ru: Имя куки и полученный идентификатор клиента.

source: The cookie name and sent client identifier.
es: El nombre de la cookie y el identificador del cliente enviado.
ja: クッキー名と送信されたクライアント識別子。
ko: 쿠키 이름 및 전송 된 클라이언트 식별자
ru: Имя куки и отправленный идентификатор клиента.

source: The corresponding instructions will then look like this:
es: Las instrucciones correspondientes se verán entonces así:
ja: すると、対応する指示は次のようになります。
ko: 해당 지침은 다음과 같습니다.
ru: Соответствующие инструкции будут выглядеть следующим образом:

source: The current list of standardized extensions is published at <a href="http://www.iana.org/assignments/imap4-capabilities">www.iana.org</a>.
es: La lista actual de extensiones estandarizadas se publica en <a href="http://www.iana.org/assignments/imap4-capabilities">www.iana.org</a> .
ja: 標準化された拡張機能の現在のリストは、<a href="http://www.iana.org/assignments/imap4-capabilities">www.iana.org</a>で公開されています。
ko: 현재 표준화 된 확장 목록은 <a href="http://www.iana.org/assignments/imap4-capabilities">www.iana.org에</a> 게시되어 있습니다.
ru: Текущий список стандартизированных расширений опубликован на сайте <a href="http://www.iana.org/assignments/imap4-capabilities">www.iana.org</a> .

source: The current list of standardized extensions is published at <a href="http://www.iana.org/assignments/mail-parameters">www.iana.org</a>.
es: La lista actual de extensiones estandarizadas se publica en <a href="http://www.iana.org/assignments/mail-parameters">www.iana.org</a> .
ko: 현재 표준화 된 확장 목록은 <a href="http://www.iana.org/assignments/mail-parameters">www.iana.org에</a> 게시되어 있습니다.
ru: Текущий список стандартизированных расширений опубликован на сайте <a href="http://www.iana.org/assignments/mail-parameters">www.iana.org</a> .

source: The current list of standardized extensions is published at <a href="http://www.iana.org/assignments/pop3-extension-mechanism">www.iana.org</a>.
es: La lista actual de extensiones estandarizadas se publica en <a href="http://www.iana.org/assignments/pop3-extension-mechanism">www.iana.org</a> .
ko: 현재 표준화 된 확장 목록은 <a href="http://www.iana.org/assignments/pop3-extension-mechanism">www.iana.org에</a> 게시되어 있습니다.
ru: Текущий список стандартизированных расширений опубликован на сайте <a href="http://www.iana.org/assignments/pop3-extension-mechanism">www.iana.org</a> .

source: The current number of active client connections including <code>Waiting</code> connections.
es: El n&uacute;mero actual de conexiones de cliente activas, incluidas las conexiones en <code>Waiting</code> .
ko: <code>Waiting</code> 연결을 포함한 현재 활성 클라이언트 연결 수입니다 .
ru: Текущее количество активных клиентских подключений, включая <code>Waiting</code> подключения.

source: The current number of active client connections.
es: El número actual de conexiones de clientes activos.
ko: 현재 활성 클라이언트 연결 수입니다.
ru: Текущее количество активных клиентских подключений.

source: The current number of active connections.
es: El número actual de conexiones activas.
ko: 현재 활성 연결 수입니다.
ru: Текущее количество активных соединений.

source: The current number of client requests.
es: El número actual de solicitudes de clientes.
ko: 현재 클라이언트 요청 수
ru: Текущее количество запросов клиентов.

source: The current number of connections where nginx is reading the request header.
es: El número actual de conexiones donde nginx está leyendo el encabezado de la solicitud.
ko: nginx가 요청 헤더를 읽는 현재 연결 수입니다.
ru: Текущее количество соединений,где nginx читает заголовок запроса.

source: The current number of connections where nginx is writing the response back to the client.
es: El número actual de conexiones donde nginx está escribiendo la respuesta al cliente.
ko: nginx가 응답을 클라이언트에 다시 쓰는 현재 연결 수입니다.
ru: Текущее количество соединений,где nginx записывает ответ обратно клиенту.

source: The current number of connections.
es: El número actual de conexiones.
ko: 현재 연결 수
ru: Текущее количество соединений.

source: The current number of free memory pages.
es: El número actual de páginas de memoria libre.
ko: 사용 가능한 메모리 페이지의 현재 수
ru: Текущее количество свободных страниц памяти.

source: The current number of free memory slots.
es: El número actual de ranuras de memoria libres.
ko: 사용 가능한 메모리 슬롯의 현재 수
ru: Текущее количество свободных слотов памяти.

source: The current number of idle <a href="ngx_http_upstream_module#keepalive">keepalive</a> connections.
es: El n&uacute;mero actual de conexiones <a href="ngx_http_upstream_module#keepalive">keepalive</a> inactivas .
ko: 아이들의 현재 수 <a href="ngx_http_upstream_module#keepalive">킵 얼라이브</a> 연결.
ru: Текущее количество <a href="ngx_http_upstream_module#keepalive">незанятых</a> соединений keepalive .

source: The current number of idle client connections waiting for a request.
es: El número actual de conexiones de clientes inactivos esperando una solicitud.
ko: 요청을 기다리는 현재 유휴 클라이언트 연결 수입니다.
ru: Текущее количество незанятых клиентских соединений,ожидающих запроса.

source: The current number of idle client connections.
es: El número actual de conexiones de clientes inactivos.
ko: 유휴 클라이언트 연결의 현재 수
ru: Текущее количество незадействованных клиентских соединений.

source: The current number of requests in the queue.
es: El número actual de solicitudes en la cola.
ko: 큐의 현재 요청 수
ru: Текущее количество запросов в очереди.

source: The current number of servers removed from the group but still processing active client connections.
es: El número actual de servidores eliminados del grupo pero que aún procesan conexiones de clientes activos.
ko: 그룹에서 제거되었지만 활성 클라이언트 연결을 처리하는 현재 서버 수
ru: Текущее количество серверов,удаленных из группы,но все еще обрабатывающих активные клиентские соединения.

source: The current number of servers removed from the group but still processing active client requests.
es: El número actual de servidores eliminados del grupo pero que siguen procesando las solicitudes de los clientes activos.
ko: 그룹에서 제거되었지만 활성 클라이언트 요청을 계속 처리하는 현재 서버 수입니다.
ru: Текущее количество серверов,удаленных из группы,но все еще обрабатывающих активные запросы клиентов.

source: The current number of used memory pages.
es: El número actual de páginas de memoria usadas.
ko: 사용 된 메모리 페이지의 현재 수
ru: Текущее количество используемых страниц памяти.

source: The current number of used memory slots.
es: El número actual de ranuras de memoria utilizadas.
ko: 사용 된 메모리 슬롯의 현재 수
ru: Текущее количество используемых слотов памяти.

source: The current size of the cache.
es: El tamaño actual de la caché.
ko: 캐시의 현재 크기
ru: Текущий размер кэша.

source: The debugging log can be written to a cyclic memory buffer:
es: El registro de depuración puede escribirse en un búfer de memoria cíclica:
ko: 디버깅 로그는 순환 메모리 버퍼에 쓸 수 있습니다.
ru: Отладочный журнал можно записать в циклический буфер памяти:

source: The default replacement specified by the <code>default</code> parameter uses the parameters of the <a href="ngx_http_core_module#location">location</a> and <a href="#proxy_pass">proxy_pass</a> directives. Hence, the two configurations below are equivalent:
es: El reemplazo predeterminado especificado por el par&aacute;metro <code>default</code> utiliza los par&aacute;metros de las directivas <a href="ngx_http_core_module#location">location</a> y <a href="#proxy_pass">proxy_pass</a> . Por lo tanto, las dos configuraciones siguientes son equivalentes:
ko: <code>default</code> 매개 변수로 지정된 기본 대체 는 <a href="ngx_http_core_module#location">location</a> 및 <a href="#proxy_pass">proxy_pass</a> 지시문 의 매개 변수를 사용합니다 . 따라서 아래 두 구성은 동일합니다.
ru: Замена по умолчанию, указанная параметром по <code>default</code> использует параметры директив <a href="ngx_http_core_module#location">location</a> и <a href="#proxy_pass">proxy_pass</a> . Следовательно, две приведенные ниже конфигурации эквивалентны:

source: The default value &ldquo;<code>on</code>&rdquo; instructs nginx to <a href="#lingering_timeout">wait for</a> and <a href="#lingering_time">process</a> additional data from a client before fully closing a connection, but only if heuristics suggests that a client may be sending more data.
es: El valor por defecto &ldquo; <code>on</code> &rdquo; instruye Nginx a <a href="#lingering_timeout">esperar</a> y <a href="#lingering_time">procesar</a> datos adicionales de un cliente antes de cerrarse completamente una conexi&oacute;n, pero s&oacute;lo si la heur&iacute;stica sugiere que un cliente puede enviar m&aacute;s datos.
ko: "기본값 <code>on</code> 지시합니다"는하기 nginx에 <a href="#lingering_timeout">대기</a> 하고 <a href="#lingering_time">처리</a> 하지만 휴리스틱은 클라이언트가 더 많은 데이터를 전송 할 수 있음을 시사하는 경우에만 완전히 연결을 닫기 전에 클라이언트에서 추가 데이터를.
ru: Значение по умолчанию &laquo; <code>on</code> &raquo; указывает nginx <a href="#lingering_timeout">ждать</a> и <a href="#lingering_time">обрабатывать</a> дополнительные данные от клиента, прежде чем полностью закрыть соединение, но только если эвристика предполагает, что клиент может отправлять больше данных.

source: The default value of the <code>timeout</code> parameter is 60 seconds.
es: El valor predeterminado del par&aacute;metro de <code>timeout</code> de espera es 60 segundos.
ko: <code>timeout</code> 매개 변수 의 기본값 은 60 초입니다.
ru: Значение параметра <code>timeout</code> умолчанию - 60 секунд.

source: The deprecated properties will be removed in <a href="#njs0.2.8">next</a> releases.
es: Las propiedades obsoletas se eliminar&aacute;n en las <a href="#njs0.2.8">pr&oacute;ximas</a> versiones.
ko: 더 이상 사용되지 않는 속성은 <a href="#njs0.2.8">다음</a> 릴리스 에서 제거 됩니다.
ru: Устаревшие свойства будут удалены в <a href="#njs0.2.8">следующих</a> выпусках.

source: The difference between functions is that the <code>ngx_http_get_indexed_variable()</code> returns a cached value and <code>ngx_http_get_flushed_variable()</code> flushes the cache for non-cacheable variables.
es: La diferencia entre las funciones es que <code>ngx_http_get_indexed_variable()</code> devuelve un valor almacenado en cach&eacute; y <code>ngx_http_get_flushed_variable()</code> la cach&eacute; de las variables que no se pueden almacenar en cach&eacute;.
ko: 함수의 차이점은 <code>ngx_http_get_indexed_variable()</code> 은 캐시 된 값을 반환하고 <code>ngx_http_get_flushed_variable()</code> 은 캐시 할 수없는 변수에 대한 캐시를 플러시한다는 것입니다.
ru: Разница между функциями заключается в том, что <code>ngx_http_get_indexed_variable()</code> возвращает кешированное значение, а <code>ngx_http_get_flushed_variable()</code> очищает кеш для некэшируемых переменных.

source: The directive
es: La directiva
ko: 지시어
ru: Директива

source: The directive also defines what is considered an <a href="ngx_http_upstream_module#max_fails">unsuccessful attempt</a> of communication with a server. The cases of <code>error</code>, <code>timeout</code> and <code>invalid_header</code> are always considered unsuccessful attempts, even if they are not specified in the directive. The cases of <code>http_500</code>, <code>http_502</code>, <code>http_503</code>, <code>http_504</code>, and <code>http_429</code> are considered unsuccessful attempts only if they are specified in the directive. The cases of <code>http_403</code> and <code>http_404</code> are never considered unsuccessful attempts.
es: La directiva tambi&eacute;n define lo que se considera un <a href="ngx_http_upstream_module#max_fails">intento fallido</a> de comunicaci&oacute;n con un servidor. Los casos de <code>error</code> , <code>timeout</code> y <code>invalid_header</code> siempre se consideran intentos fallidos, incluso si no est&aacute;n especificados en la directiva. Los casos de <code>http_500</code> , <code>http_502</code> , <code>http_503</code> , <code>http_504</code> y <code>http_429</code> se consideran intentos fallidos solo si se especifican en la directiva. Los casos de <code>http_403</code> y <code>http_404</code> nunca se consideran intentos fallidos.
ko: 이 지시문은 또한 서버와의 통신에 <a href="ngx_http_upstream_module#max_fails">실패한</a> 것으로 간주되는 사항을 정의 합니다. 의 경우 <code>error</code> , <code>timeout</code> 및 <code>invalid_header</code> 는 항상이 지침에 규정되지 않은 경우에도 실패한 시도로 간주됩니다. 의 경우 <code>http_500</code> , <code>http_502</code> , <code>http_503</code> , <code>http_504</code> 및 <code>http_429</code> 는 그들이 지시에 지정된 경우에만 성공하지 못한 시도로 간주됩니다. <code>http_403</code> 및 <code>http_404</code> 의 경우는 실패한 시도로 간주되지 않습니다.
ru: Директива также определяет, что считается <a href="ngx_http_upstream_module#max_fails">неудачной попыткой</a> связи с сервером. Случаи <code>error</code> , <code>timeout</code> и <code>invalid_header</code> всегда считаются неудачными попытками, даже если они не указаны в директиве. Случаи <code>http_500</code> , <code>http_502</code> , <code>http_503</code> , <code>http_504</code> и <code>http_429</code> считаются неудачными попытками, только если они указаны в директиве. Случаи <code>http_403</code> и <code>http_404</code> никогда не считаются неудачными попытками.
