Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/nginx/nginx.*.004.xlf
Languages: es, ja, ko, ru, zh_cn

source: The <code>ngx_http_hls_module</code> module provides HTTP Live Streaming (HLS) server-side support for MP4 and MOV media files. Such files typically have the <code>.mp4</code>, <code>.m4v</code>, <code>.m4a</code>, <code>.mov</code>, or <code>.qt</code> filename extensions. The module supports H.264 video codec, AAC and MP3 audio codecs.
es: El m&oacute;dulo <code>ngx_http_hls_module</code> proporciona compatibilidad con HTTP Live Streaming (HLS) en el lado del servidor para archivos multimedia MP4 y MOV. Estos archivos suelen tener las extensiones de nombre de archivo <code>.mp4</code> , <code>.m4v</code> , <code>.m4a</code> , <code>.mov</code> o <code>.qt</code> . El m&oacute;dulo admite c&oacute;dec de video H.264, c&oacute;decs de audio AAC y MP3.
ja: <code>ngx_http_hls_module</code> モジュールは、HTTPライブストリーミング（HLS）MP4とMOVメディアファイルのサーバー側のサポートを提供します。このようなファイルには、通常、ファイル名拡張子が <code>.mp4</code> 、 <code>.m4v</code> 、 <code>.m4a</code> 、 <code>.mov</code> 、または <code>.qt</code> です。このモジュールは、H.264ビデオコーデック、AACおよびMP3オーディオコーデックをサポートしています。
ko: <code>ngx_http_hls_module</code> 모듈은 HTTP 라이브 스트리밍 (HLS) MP4 및 MOV 미디어 파일에 대한 서버 측 지원을 제공합니다. 이러한 파일은 일반적으로 <code>.mp4</code> , <code>.m4v</code> , <code>.m4a</code> , <code>.mov</code> 또는 <code>.qt</code> 파일 이름 확장자를 갖습니다 . 이 모듈은 H.264 비디오 코덱, AAC 및 MP3 오디오 코덱을 지원합니다.
ru: Модуль <code>ngx_http_hls_module</code> обеспечивает поддержку HTTP Live Streaming (HLS) на стороне сервера для медиафайлов MP4 и MOV. Такие файлы обычно имеют расширение имени файла <code>.mp4</code> , <code>.m4v</code> , <code>.m4a</code> , <code>.mov</code> или <code>.qt</code> . Модуль поддерживает видеокодек H.264, аудиокодеки AAC и MP3.
zh_cn: 该 <code>ngx_http_hls_module</code> 模块提供HTTP实时流（HLS）的MP4和MOV媒体文件服务器端支持。这样的文件通常具有 <code>.mp4</code> ， <code>.m4v</code> ， <code>.m4a</code> ， <code>.mov</code> 或 <code>.qt</code> 文件扩展名。该模块支持H.264视频编解码器，AAC和MP3音频编解码器。

source: The <code>ngx_http_image_filter_module</code> module (0.7.54+) is a filter that transforms images in JPEG, GIF, PNG, and WebP formats.
es: El m&oacute;dulo <code>ngx_http_image_filter_module</code> (0.7.54+) es un filtro que transforma im&aacute;genes en formatos JPEG, GIF, PNG y WebP.
ja: <code>ngx_http_image_filter_module</code> モジュール（0.7.54+）はJPEG、GIF、PNG、およびWEBPフォーマットに変換像そのフィルタです。
ko: <code>ngx_http_image_filter_module</code> 모듈 (0.7.54+)는 필터 인 것을 JPEG, GIF, PNG, 및 WebP 형식 포맷으로 변환 이미지.
ru: Модуль <code>ngx_http_image_filter_module</code> (0.7.54+) - это фильтр, преобразующий изображения в форматах JPEG, GIF, PNG и WebP.
zh_cn: 所述 <code>ngx_http_image_filter_module</code> 模块（0.7.54+）是一种过滤器，在JPEG，GIF，PNG，和WebP的格式变换的图像。

source: The <code>ngx_http_index_module</code> module processes requests ending with the slash character (&lsquo;<code>/</code>&rsquo;). Such requests can also be processed by the <a href="ngx_http_autoindex_module">ngx_http_autoindex_module</a> and <a href="ngx_http_random_index_module">ngx_http_random_index_module</a> modules.
es: El m&oacute;dulo <code>ngx_http_index_module</code> procesa las solicitudes que terminan con el car&aacute;cter de barra (' <code>/</code> '). Estas solicitudes tambi&eacute;n pueden ser procesadas por los m&oacute;dulos <a href="ngx_http_autoindex_module">ngx_http_autoindex_module</a> y <a href="ngx_http_random_index_module">ngx_http_random_index_module</a> .
ja: <code>ngx_http_index_module</code> スラッシュ文字で終わるモジュールのプロセス要求（「 <code>/</code> 」）。このようなリクエストは、<a href="ngx_http_autoindex_module">ngx_http_autoindex_module</a>および<a href="ngx_http_random_index_module">ngx_http_random_index_module</a>モジュールでも処理できます。
ko: <code>ngx_http_index_module</code> 슬래시 문자로 끝나는 모듈 프로세스 요청 ( ' <code>/</code> '). 이러한 요청은 <a href="ngx_http_autoindex_module">ngx_http_autoindex_module</a> 및 <a href="ngx_http_random_index_module">ngx_http_random_index_module</a> 모듈 에서 처리 할 수도 있습니다 .
ru: Модуль <code>ngx_http_index_module</code> обрабатывает запросы, заканчивающиеся символом косой черты (' <code>/</code> '). Такие запросы также могут обрабатываться модулями <a href="ngx_http_autoindex_module">ngx_http_autoindex_module</a> и <a href="ngx_http_random_index_module">ngx_http_random_index_module</a> .
zh_cn: 所述 <code>ngx_http_index_module</code> 与斜杠字符结束模块进程的请求（&ldquo; <code>/</code> &rdquo;）。此类请求也可以由<a href="ngx_http_autoindex_module">ngx_http_autoindex_module</a>和<a href="ngx_http_random_index_module">ngx_http_random_index_module</a>模块处理。

source: The <code>ngx_http_internal_redirect(r, uri, args)</code> function changes the request URI and returns the request to the <code>NGX_HTTP_SERVER_REWRITE_PHASE</code> phase. The request proceeds with a server default location. Later at <code>NGX_HTTP_FIND_CONFIG_PHASE</code> a new location is chosen based on the new request URI.
es: La funci&oacute;n <code>ngx_http_internal_redirect(r, uri, args)</code> cambia el URI de la solicitud y devuelve la solicitud a la fase <code>NGX_HTTP_SERVER_REWRITE_PHASE</code> . La solicitud procede con una ubicaci&oacute;n predeterminada del servidor. M&aacute;s tarde, en <code>NGX_HTTP_FIND_CONFIG_PHASE</code> ,se elige una nueva ubicaci&oacute;n en funci&oacute;n del nuevo URI de solicitud.
ja: <code>ngx_http_internal_redirect(r, uri, args)</code> この関数は、要求URIを変更し、への要求を返す <code>NGX_HTTP_SERVER_REWRITE_PHASE</code> の相。リクエストはサーバーのデフォルトの場所で続行されます。後で <code>NGX_HTTP_FIND_CONFIG_PHASE</code> で、新しい要求URIに基づいて新しい場所が選択されます。
ko: <code>ngx_http_internal_redirect(r, uri, args)</code> 함수는 요청 URI 변경되고 요청에 반환 <code>NGX_HTTP_SERVER_REWRITE_PHASE</code> 의 상. 요청은 서버 기본 위치로 진행됩니다. 나중에 <code>NGX_HTTP_FIND_CONFIG_PHASE</code> 에서 새 요청 URI를 기반으로 새 위치가 선택됩니다.
ru: Функция <code>ngx_http_internal_redirect(r, uri, args)</code> изменяет URI запроса и возвращает запрос на фазу <code>NGX_HTTP_SERVER_REWRITE_PHASE</code> . Запрос продолжается с местоположением сервера по умолчанию. Позже в <code>NGX_HTTP_FIND_CONFIG_PHASE</code> новое местоположение выбирается на основе нового URI запроса.
zh_cn: 所述 <code>ngx_http_internal_redirect(r, uri, args)</code> 函数改变请求的URI，并返回该请求到 <code>NGX_HTTP_SERVER_REWRITE_PHASE</code> 相。该请求将继续使用服务器的默认位置。稍后在 <code>NGX_HTTP_FIND_CONFIG_PHASE</code> 处,将基于新的请求URI选择一个新位置。

source: The <code>ngx_http_js_module</code> module is used to implement location and variable handlers in <a href="../njs/index">njs</a> &mdash; a subset of the JavaScript language.
es: El m&oacute;dulo <code>ngx_http_js_module</code> se usa para implementar controladores de ubicaci&oacute;n y variables en <a href="../njs/index">njs</a> , un subconjunto del lenguaje JavaScript.
ja: <code>ngx_http_js_module</code> モジュールに位置し、可変のハンドラを実装するために使用される<a href="../njs/index">NJS</a> JavaScript言語のサブセットを- 。
ko: <code>ngx_http_js_module</code> 모듈의 위치와 변수 핸들러 구현하는 데 사용됩니다 <a href="../njs/index">NJS</a> 자바 스크립트 언어의 부분 집합을 -.
ru: Модуль <code>ngx_http_js_module</code> используется для реализации обработчиков местоположения и переменных в <a href="../njs/index">njs</a> - подмножестве языка JavaScript.
zh_cn: 该 <code>ngx_http_js_module</code> 模块用于实现位置和可变处理<a href="../njs/index">NJS</a> - JavaScript语言的一个子集。

source: The <code>ngx_http_keyval_module</code> module (1.13.3) creates variables with values taken from key-value pairs managed by the <a href="ngx_http_api_module#http_keyvals_">API</a>.
es: El m&oacute;dulo <code>ngx_http_keyval_module</code> (1.13.3) crea variables con valores tomados de pares clave-valor administrados por la <a href="ngx_http_api_module#http_keyvals_">API</a> .
ja: <code>ngx_http_keyval_module</code> モジュール（1.13.3）は、によって管理されるキーと値のペアから取られた値を持つ変数を作成<a href="ngx_http_api_module#http_keyvals_">APIを</a>。
ko: <code>ngx_http_keyval_module</code> 의 모듈 (1.13.3)를 관리하여 키 - 값 쌍에서 촬영 변수 값 생성 <a href="ngx_http_api_module#http_keyvals_">API를</a> .
ru: Модуль <code>ngx_http_keyval_module</code> (1.13.3) создает переменные со значениями, взятыми из пар ключ-значение, управляемых <a href="ngx_http_api_module#http_keyvals_">API</a> .
zh_cn: 所述 <code>ngx_http_keyval_module</code> 模块（1.13.3）使用从被管理的键-值对获得的值的变量<a href="ngx_http_api_module#http_keyvals_">的API</a>。

source: The <code>ngx_http_limit_conn_module</code> module is used to limit the number of connections per the defined key, in particular, the number of connections from a single IP address.
es: El m&oacute;dulo <code>ngx_http_limit_conn_module</code> se utiliza para limitar el n&uacute;mero de conexiones por clave definida, en particular, el n&uacute;mero de conexiones desde una &uacute;nica direcci&oacute;n IP.
ja: <code>ngx_http_limit_conn_module</code> モジュールは、特に、単一のIPアドレスからの接続の数を定義されたキーごとの接続の数を制限するために使用されます。
ko: <code>ngx_http_limit_conn_module</code> 모듈은 특히 정의 키당 연결의 수를 제한하는 데 사용되며, 하나의 IP 어드레스로부터의 접속의 수.
ru: Модуль <code>ngx_http_limit_conn_module</code> используется для ограничения количества подключений на определенный ключ, в частности, количества подключений с одного IP-адреса.
zh_cn: 所述 <code>ngx_http_limit_conn_module</code> 模块用于限制每个定义的键连接的数量，尤其是，从一个单一的IP地址的连接的数量。

source: The <code>ngx_http_limit_req_module</code> module (0.7.21) is used to limit the request processing rate per a defined key, in particular, the processing rate of requests coming from a single IP address. The limitation is done using the &ldquo;leaky bucket&rdquo; method.
es: El m&oacute;dulo <code>ngx_http_limit_req_module</code> (0.7.21) se usa para limitar la tasa de procesamiento de solicitudes por una clave definida, en particular, la tasa de procesamiento de solicitudes provenientes de una &uacute;nica direcci&oacute;n IP. La limitaci&oacute;n se realiza mediante el m&eacute;todo de "balde con fugas".
ja: <code>ngx_http_limit_req_module</code> モジュール（0.7.21）は、特に定義されたキーごと要求処理速度を制限するために使用され、単一のIPアドレスからの要求の処理速度。制限は、「漏出バケット」方式を使用して行われます。
ko: <code>ngx_http_limit_req_module</code> 모듈 (0.7.21)는 특히 한정된 키당 요청 처리 속도를 제한하는 데 사용되는 하나의 IP 주소로부터 들어오는 요청의 처리 속도. 제한은 "누설 버킷"방법을 사용하여 수행됩니다.
ru: Модуль <code>ngx_http_limit_req_module</code> (0.7.21) используется для ограничения скорости обработки запросов по определенному ключу, в частности, скорости обработки запросов, поступающих с одного IP-адреса. Ограничение осуществляется методом &laquo;дырявого ведра&raquo;.
zh_cn: 所述 <code>ngx_http_limit_req_module</code> 模块（0.7.21）用于限制每一个定义的密钥的请求的处理速率，特别是从一个单一的IP地址的请求的处理速率。使用&ldquo;漏斗&rdquo;方法完成限制。

source: The <code>ngx_http_log_module</code> module writes request logs in the specified format.
es: El m&oacute;dulo <code>ngx_http_log_module</code> escribe registros de solicitudes en el formato especificado.
ja: <code>ngx_http_log_module</code> モジュールは、指定された形式での要求のログを書き込みます。
ko: <code>ngx_http_log_module</code> 모듈 쓰기는 지정된 형식으로 로그를 요청합니다.
ru: Модуль <code>ngx_http_log_module</code> записывает журналы запросов в указанном формате.
zh_cn: 所述 <code>ngx_http_log_module</code> 模块写入请求日志中指定的格式。

source: The <code>ngx_http_map_module</code> module creates variables whose values depend on values of other variables.
es: El m&oacute;dulo <code>ngx_http_map_module</code> crea variables cuyos valores dependen de los valores de otras variables.
ja: <code>ngx_http_map_module</code> モジュールは、その値が他の変数の値に依存変数を作成します。
ko: <code>ngx_http_map_module</code> 모듈은 그 값이 다른 변수의 값에 의존하는 변수를 생성한다.
ru: Модуль <code>ngx_http_map_module</code> создает переменные, значения которых зависят от значений других переменных.
zh_cn: 该 <code>ngx_http_map_module</code> 模块创建变量，其值依赖于其它变量的值。

source: The <code>ngx_http_memcached_module</code> module is used to obtain responses from a memcached server. The key is set in the <code>$memcached_key</code> variable. A response should be put in memcached in advance by means external to nginx.
es: El m&oacute;dulo <code>ngx_http_memcached_module</code> se utiliza para obtener respuestas de un servidor memcached. La clave se establece en la variable <code>$memcached_key</code> . Se debe poner una respuesta en memcached de antemano por medios externos a nginx.
ja: <code>ngx_http_memcached_module</code> モジュールは、memcachedサーバからの応答を取得するために使用されます。キーは <code>$memcached_key</code> 変数で設定されます。応答は、nginxの外部の手段によって事前にmemcachedに配置する必要があります。
ko: <code>ngx_http_memcached_module</code> 모듈은 memcached를 서버로부터 응답을 얻기 위해 사용된다. 키는 <code>$memcached_key</code> 변수에 설정되어 있습니다. 응답은 nginx 외부에서 미리 memcached에 넣어야합니다.
ru: Модуль <code>ngx_http_memcached_module</code> используется для получения ответов от сервера memcached. Ключ устанавливается в переменной <code>$memcached_key</code> . Ответ должен быть заранее помещен в memcached внешними по отношению к nginx средствами.
zh_cn: 所述 <code>ngx_http_memcached_module</code> 模块被用来获得从分布式缓存服务器的响应。密钥在 <code>$memcached_key</code> 变量中设置。应该通过nginx外部的方式预先将响应放入memcached中。

source: The <code>ngx_http_mirror_module</code> module (1.13.4) implements mirroring of an original request by creating background mirror subrequests. Responses to mirror subrequests are ignored.
es: El m&oacute;dulo <code>ngx_http_mirror_module</code> (1.13.4) implementa la duplicaci&oacute;n de una solicitud original mediante la creaci&oacute;n de sub solicitudes de duplicaci&oacute;n en segundo plano. Se ignoran las respuestas a las subpeticiones espejo.
ja: <code>ngx_http_mirror_module</code> モジュール背景ミラーサブリクエストを作成することにより、元の要求のミラーリング（1.13.4）を実装します。ミラーサブリクエストへの応答は無視されます。
ko: <code>ngx_http_mirror_module</code> 의 모듈 (1.13.4) 배경 미러 하위 요청을 생성하여 원래 요청 미러링 구현한다. 하위 요청 미러링에 대한 응답은 무시됩니다.
ru: Модуль <code>ngx_http_mirror_module</code> (1.13.4) реализует зеркалирование исходного запроса путем создания фоновых подзапросов зеркального отображения. Ответы на зеркальные подзапросы игнорируются.
zh_cn: 所述 <code>ngx_http_mirror_module</code> 模块（1.13.4）实现通过创建背景镜子请求镜像的原始请求的。对镜像子请求的响应将被忽略。

source: The <code>ngx_http_mp4_module</code> module provides pseudo-streaming server-side support for MP4 files. Such files typically have the <code>.mp4</code>, <code>.m4v</code>, or <code>.m4a</code> filename extensions.
es: El m&oacute;dulo <code>ngx_http_mp4_module</code> proporciona soporte de pseudo-streaming del lado del servidor para archivos MP4. Estos archivos suelen tener las extensiones de nombre de archivo <code>.mp4</code> , <code>.m4v</code> o <code>.m4a</code> .
ja: <code>ngx_http_mp4_module</code> モジュールは、MP4ファイル用の疑似ストリーミングサーバー側のサポートを提供します。このようなファイルには、通常、ファイル名拡張子が <code>.mp4</code> 、 <code>.m4v</code> 、または <code>.m4a</code> です。
ko: <code>ngx_http_mp4_module</code> 모듈은 MP4 파일에 대한 의사 스트리밍 서버 측 지원을 제공합니다. 이러한 파일의 파일 이름 확장자 는 일반적으로 <code>.mp4</code> , <code>.m4v</code> 또는 <code>.m4a</code> 입니다.
ru: Модуль <code>ngx_http_mp4_module</code> обеспечивает поддержку псевдопотоковой передачи файлов MP4 на стороне сервера. Такие файлы обычно имеют расширение имени файла <code>.mp4</code> , <code>.m4v</code> или <code>.m4a</code> .
zh_cn: 该 <code>ngx_http_mp4_module</code> 模块提供了MP4文件的伪流传服务器端支持。此类文件通常具有 <code>.mp4</code> ， <code>.m4v</code> 或 <code>.m4a</code> 文件扩展名。

source: The <code>ngx_http_perl_module</code> module is used to implement location and variable handlers in Perl and insert Perl calls into SSI.
es: El m&oacute;dulo <code>ngx_http_perl_module</code> se utiliza para implementar controladores de ubicaci&oacute;n y variables en Perl e insertar llamadas de Perl en SSI.
ja: <code>ngx_http_perl_module</code> モジュールは、Perlで位置可変ハンドラを実装し、Perlを挿入するために使用されるSSIを呼び出します。
ko: <code>ngx_http_perl_module</code> 모듈은 펄과 SSI에 펄 통화 삽입 위치와 변수 핸들러를 구현하는 데 사용됩니다.
ru: Модуль <code>ngx_http_perl_module</code> используется для реализации обработчиков местоположения и переменных в Perl и вставки вызовов Perl в SSI.
zh_cn: 该 <code>ngx_http_perl_module</code> 模块用于实现Perl和Perl的插入到呼叫SSI位置和可变处理。

source: The <code>ngx_http_postpone_filter</code> activates the next request in the active request's subrequest list, once all data prior to that request are sent.
es: El <code>ngx_http_postpone_filter</code> activa la siguiente solicitud en la lista de subpeticiones de la solicitud activa, una vez que se env&iacute;an todos los datos anteriores a esa solicitud.
ja: <code>ngx_http_postpone_filter</code> は、その前のリクエストにすべてのデータが送信された後、アクティブな要求のサブリクエストリスト内の次の要求をアクティブにします。
ko: <code>ngx_http_postpone_filter</code> 는 그 이전 요청에 대한 모든 데이터가 전송되면, 활성 요청의 subrequest 목록에서 다음 요청을 활성화합니다.
ru: <code>ngx_http_postpone_filter</code> активирует следующий запрос в подзапросе списка активного запроса, когда - то все данные до этого запроса направляется.
zh_cn: 该 <code>ngx_http_postpone_filter</code> 激活主动请求的子请求列表中的下一个请求，一旦请求之前的所有数据被发送。

source: The <code>ngx_http_proxy_module</code> module allows passing requests to another server.
es: El m&oacute;dulo <code>ngx_http_proxy_module</code> permite pasar solicitudes a otro servidor.
ja: <code>ngx_http_proxy_module</code> モジュールは、別のサーバーにリクエストを渡すことができます。
ko: <code>ngx_http_proxy_module</code> 모듈은 다른 서버로 요청을 전달 할 수 있습니다.
ru: Модуль <code>ngx_http_proxy_module</code> позволяет передавать запросы на другой сервер.
zh_cn: 该 <code>ngx_http_proxy_module</code> 模块允许请求传递到另一台服务器。

source: The <code>ngx_http_proxy_module</code> module supports embedded variables that can be used to compose headers using the <a href="#proxy_set_header">proxy_set_header</a> directive:
es: El m&oacute;dulo <code>ngx_http_proxy_module</code> admite variables incrustadas que se pueden usar para componer encabezados usando la directiva <a href="#proxy_set_header">proxy_set_header</a> :
ja: <code>ngx_http_proxy_module</code> モジュールをサポート使用してコンヘッダに使用できる変数組み込み<a href="#proxy_set_header">proxy_set_headerの</a>ディレクティブを：
ko: <code>ngx_http_proxy_module</code> 모듈을 지원하여 작성 헤더로 사용할 수있다 매립 변수 <a href="#proxy_set_header">proxy_set_header의</a> 지시자 :
ru: Модуль <code>ngx_http_proxy_module</code> поддерживает встроенные переменные, которые можно использовать для составления заголовков с помощью директивы <a href="#proxy_set_header">proxy_set_header</a> :
zh_cn: 所述 <code>ngx_http_proxy_module</code> 模块支撑件嵌入变量可用于使用撰写头<a href="#proxy_set_header">proxy_set_header</a>指令：

source: The <code>ngx_http_random_index_module</code> module processes requests ending with the slash character (&lsquo;<code>/</code>&rsquo;) and picks a random file in a directory to serve as an index file. The module is processed before the <a href="ngx_http_index_module">ngx_http_index_module</a> module.
es: El m&oacute;dulo <code>ngx_http_random_index_module</code> procesa las solicitudes que terminan con el car&aacute;cter de barra (' <code>/</code> ') y elige un archivo aleatorio en un directorio para que sirva como archivo de &iacute;ndice. El m&oacute;dulo se procesa antes que el m&oacute;dulo <a href="ngx_http_index_module">ngx_http_index_module</a> .
ja: <code>ngx_http_random_index_module</code> モジュールプロセスのスラッシュ文字で終わるリクエスト（「 <code>/</code> ディレクトリにある」）とピックランダムなファイルは、インデックスファイルとして機能します。モジュールは<a href="ngx_http_index_module">ngx_http_index_module</a>モジュールの前に処理されます。
ko: <code>ngx_http_random_index_module</code> 모듈을 처리 슬래시 문자로 끝나는 요청 ( ' <code>/</code> 디렉토리에서')와 픽 임의의 파일을 인덱스 파일로 제공합니다. 모듈은 <a href="ngx_http_index_module">ngx_http_index_module</a> 모듈 보다 먼저 처리됩니다 .
ru: Модуль <code>ngx_http_random_index_module</code> обрабатывает запросы, заканчивающиеся символом косой черты (' <code>/</code> '), и выбирает случайный файл в каталоге, который будет служить индексным файлом. Модуль обрабатывается перед модулем <a href="ngx_http_index_module">ngx_http_index_module</a> .
zh_cn: 所述 <code>ngx_http_random_index_module</code> 与斜杠字符结束模块进程的请求（&ldquo; <code>/</code> &rdquo;）和纬纱的随机文件的目录中，作为一个索引文件中。该模块在<a href="ngx_http_index_module">ngx_http_index_module</a>模块之前进行处理。

source: The <code>ngx_http_realip_module</code> module is used to change the client address and optional port to those sent in the specified header field.
es: El m&oacute;dulo <code>ngx_http_realip_module</code> se usa para cambiar la direcci&oacute;n del cliente y el puerto opcional a los enviados en el campo de encabezado especificado.
ja: <code>ngx_http_realip_module</code> モジュールは、指定されたヘッダフィールドにそれらて送信するクライアントアドレスとオプションのポートを変更するために使用されます。
ko: <code>ngx_http_realip_module</code> 모듈은 지정된 헤더 필드에있는 사람들하여 전송에 클라이언트의 주소와 옵션 포트를 변경하는 데 사용됩니다.
ru: Модуль <code>ngx_http_realip_module</code> используется для изменения адреса клиента и дополнительного порта на те, которые отправлены в указанном поле заголовка.
zh_cn: 所述 <code>ngx_http_realip_module</code> 模块用于在客户端地址和可选的端口改变为在指定的报头字段的那些发送。

source: The <code>ngx_http_referer_module</code> module is used to block access to a site for requests with invalid values in the &ldquo;Referer&rdquo; header field. It should be kept in mind that fabricating a request with an appropriate &ldquo;Referer&rdquo; field value is quite easy, and so the intended purpose of this module is not to block such requests thoroughly but to block the mass flow of requests sent by regular browsers. It should also be taken into consideration that regular browsers may not send the &ldquo;Referer&rdquo; field even for valid requests.
es: El m&oacute;dulo <code>ngx_http_referer_module</code> se utiliza para bloquear el acceso a un sitio para solicitudes con valores no v&aacute;lidos en el campo de encabezado "Referer". Debe tenerse en cuenta que fabricar una solicitud con un valor de campo "Referer" apropiado es bastante f&aacute;cil, por lo que el prop&oacute;sito de este m&oacute;dulo no es bloquear tales solicitudes completamente sino bloquear el flujo masivo de solicitudes enviadas por los navegadores habituales. Tambi&eacute;n debe tenerse en cuenta que los navegadores habituales pueden no enviar el campo "Referer" incluso para solicitudes v&aacute;lidas.
ja: <code>ngx_http_referer_module</code> モジュールは、「リファラー」ヘッダフィールドに無効値を要求するためのサイトへのアクセスをブロックするために使用されます。適切な「Referer」フィールド値を使用してリクエストを作成することは非常に簡単であるため、このモジュールの目的は、そのようなリクエストを完全にブロックすることではなく、通常のブラウザから送信されるリクエストの大量のフローをブロックすることです。また、通常のブラウザは、有効なリクエストであっても「Referer」フィールドを送信しない場合があることも考慮に入れる必要があります。
ko: <code>ngx_http_referer_module</code> 모듈은 "리퍼러"헤더 필드에 잘못된 값이 요청에 대한 사이트에 대한 액세스를 차단하는 데 사용됩니다. 적절한 "Referer"필드 값으로 요청을 제작하는 것은 매우 쉬우므로이 모듈의 의도 된 목적은 그러한 요청을 철저하게 차단하는 것이 아니라 일반 브라우저가 보낸 요청의 대량 흐름을 차단하는 것입니다. 일반 브라우저는 유효한 요청에도 "참조 자"필드를 보내지 않을 수도 있다는 점도 고려해야합니다.
ru: Модуль <code>ngx_http_referer_module</code> используется для блокировки доступа к сайту для запросов с недопустимыми значениями в поле заголовка &laquo;Referer&raquo;. Следует иметь в виду, что создать запрос с соответствующим значением поля &laquo;Referer&raquo; довольно просто, и поэтому предполагаемая цель этого модуля - не полностью блокировать такие запросы, а блокировать массовый поток запросов, отправляемых обычными браузерами. Также следует учитывать, что обычные браузеры могут не отправлять поле &laquo;Referer&raquo; даже для действительных запросов.
zh_cn: 所述 <code>ngx_http_referer_module</code> 模块用于阻止访问在&ldquo;Referer的&rdquo;报头字段包含无效的值的请求的站点。应当记住，使用适当的&ldquo; Referer&rdquo;字段值来构造请求非常容易，因此该模块的预期目的不是彻底阻止此类请求，而是阻止常规浏览器发送的大量请求。还应考虑到常规浏览器甚至对于有效请求也可能不会发送&ldquo; Referer&rdquo;字段。

source: The <code>ngx_http_rewrite_module</code> module directives are compiled at the configuration stage into internal instructions that are interpreted during request processing. An interpreter is a simple virtual stack machine.
es: Las directivas del m&oacute;dulo <code>ngx_http_rewrite_module</code> se compilan en la etapa de configuraci&oacute;n en instrucciones internas que se interpretan durante el procesamiento de la solicitud. Un int&eacute;rprete es una m&aacute;quina de pila virtual simple.
ja: <code>ngx_http_rewrite_module</code> モジュールディレクティブは、要求の処理中に解釈される内部命令に設定段階でコンパイルされます。インタープリターは、単純な仮想スタックマシンです。
ko: <code>ngx_http_rewrite_module</code> 모듈 지시자는 요구 처리 중 해석 내부 명령으로 구성 단계에서 컴파일된다. 인터프리터는 간단한 가상 스택 머신입니다.
ru: В <code>ngx_http_rewrite_module</code> директивы модуля компилируются на стадии конфигурации во внутренние инструкции, которые интерпретируются во время обработки запроса. Интерпретатор - это простая виртуальная стековая машина.
zh_cn: 所述 <code>ngx_http_rewrite_module</code> 模块指令是在配置阶段编译成被请求处理过程中解释内部指示。解释器是一个简单的虚拟堆栈机。
