Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/nginx/nginx.*.004.xlf
Languages: es, ja, ko, ru, zh_cn

source: The resulting value can contain text, variable (0.9.0), and their combination (1.11.0).
es: El valor resultante puede contener el texto,la variable (0.9.0)y su combinación (1.11.0).
ko: 결과 값은 텍스트, 변수 (0.9.0) 및 그 조합 (1.11.0)을 포함 할 수 있습니다.

source: The resulting value can contain text, variable, and their combination.
es: El valor resultante puede contener texto,variables y su combinación.
ko: 결과 값은 텍스트, 변수 및 그 조합을 포함 할 수 있습니다.

source: The rules are checked in sequence until the first match is found. In this example, access is allowed only for IPv4 networks <code>10.1.1.0/16</code> and <code>192.168.1.0/24</code> excluding the address <code>192.168.1.1</code>, and for IPv6 network <code>2001:0db8::/32</code>.
es: Las reglas se verifican en secuencia hasta que se encuentra la primera coincidencia. En este ejemplo, el acceso est&aacute; permitido solo para las redes IPv4 <code>10.1.1.0/16</code> y <code>192.168.1.0/24</code> , excluyendo la direcci&oacute;n <code>192.168.1.1</code> , y para la red IPv6 <code>2001:0db8::/32</code> .
ko: 첫 번째 일치 항목을 찾을 때까지 규칙을 순서대로 확인합니다. 이 예에서는 주소 <code>192.168.1.1</code> 을 제외한 IPv4 네트워크 <code>10.1.1.0/16</code> 및 <code>192.168.1.0/24</code> 및 IPv6 네트워크 <code>2001:0db8::/32</code> 에만 액세스가 허용됩니다 .

source: The rules are checked in sequence until the first match is found. In this example, access is allowed only for IPv4 networks <code>10.1.1.0/16</code> and <code>192.168.1.0/24</code> excluding the address <code>192.168.1.1</code>, and for IPv6 network <code>2001:0db8::/32</code>. In case of a lot of rules, the use of the <a href="ngx_http_geo_module">ngx_http_geo_module</a> module variables is preferable.
es: Las reglas se verifican en secuencia hasta que se encuentra la primera coincidencia. En este ejemplo, el acceso est&aacute; permitido solo para las redes IPv4 <code>10.1.1.0/16</code> y <code>192.168.1.0/24</code> , excluyendo la direcci&oacute;n <code>192.168.1.1</code> , y para la red IPv6 <code>2001:0db8::/32</code> . En el caso de muchas reglas, es preferible el uso de las variables del m&oacute;dulo <a href="ngx_http_geo_module">ngx_http_geo_module</a> .
ko: 첫 번째 일치 항목을 찾을 때까지 규칙을 순서대로 확인합니다. 이 예에서는 주소 <code>192.168.1.1</code> 을 제외한 IPv4 네트워크 <code>10.1.1.0/16</code> 및 <code>192.168.1.0/24</code> 및 IPv6 네트워크 <code>2001:0db8::/32</code> 에만 액세스가 허용됩니다 . 규칙이 많은 경우 <a href="ngx_http_geo_module">ngx_http_geo_module</a> 모듈 변수를 사용하는 것이 좋습니다.

source: The second parameter determines the <code><i>level</i></code> of logging, and can be one of the following: <code>debug</code>, <code>info</code>, <code>notice</code>, <code>warn</code>, <code>error</code>, <code>crit</code>, <code>alert</code>, or <code>emerg</code>. Log levels above are listed in the order of increasing severity. Setting a certain log level will cause all messages of the specified and more severe log levels to be logged. For example, the default level <code>error</code> will cause <code>error</code>, <code>crit</code>, <code>alert</code>, and <code>emerg</code> messages to be logged. If this parameter is omitted then <code>error</code> is used.
es: El segundo par&aacute;metro determina el <code><i>level</i></code> de registro y puede ser uno de los siguientes: <code>debug</code> , <code>info</code> rmaci&oacute;n , <code>notice</code> , <code>warn</code> , <code>error</code> , <code>crit</code> , <code>alert</code> a o <code>emerg</code> encia . Los niveles de registro anteriores se enumeran en orden de gravedad creciente. Establecer un cierto nivel de registro har&aacute; que se registren todos los mensajes de los niveles de registro especificados y m&aacute;s severos. Por ejemplo, el <code>error</code> de nivel predeterminado provocar&aacute; que <code>error</code> <code>emerg</code> mensajes de error , <code>crit</code> , <code>alert</code> a y emergencia . Si se omite este par&aacute;metro, entonces <code>error</code> se utiliza.
ko: 두 번째 매개 변수 는 로깅 <code><i>level</i></code> 을 결정하며 <code>debug</code> , <code>info</code> , <code>notice</code> , <code>warn</code> , <code>error</code> , <code>crit</code> , <code>alert</code> 또는 <code>emerg</code> 중 하나 일 수 있습니다 . 위의 로그 수준은 심각도 증가 순서대로 나열됩니다. 특정 로그 수준을 설정하면 지정된보다 심각한 로그 수준의 모든 메시지가 기록됩니다. 예를 들어, 기본 수준 <code>error</code> 는 <code>error</code> , <code>crit</code> , <code>alert</code> 및 <code>emerg</code> 메시지를 기록합니다. 이 매개 변수를 생략하면 <code>error</code> 사용.

source: The server certificate is a public entity. It is sent to every client that connects to the server. The private key is a secure entity and should be stored in a file with restricted access, however, it must be readable by nginx&rsquo;s master process. The private key may alternately be stored in the same file as the certificate:
es: El certificado del servidor es una entidad p&uacute;blica. Se env&iacute;a a cada cliente que se conecta al servidor. La clave privada es una entidad segura y debe almacenarse en un archivo con acceso restringido, sin embargo, debe ser legible por el proceso maestro de nginx. La clave privada puede almacenarse alternativamente en el mismo archivo que el certificado:
ko: 서버 인증서는 공개 엔터티입니다. 서버에 연결된 모든 클라이언트에 전송됩니다. 개인 키는 보안 개체이며 액세스가 제한된 파일에 저장해야하지만 nginx의 마스터 프로세스에서 읽을 수 있어야합니다. 개인 키는 인증서와 동일한 파일에 교대로 저장 될 수 있습니다.

source: The set of core modules includes <code>ngx_core_module</code>, <code>ngx_errlog_module</code>, <code>ngx_regex_module</code>, <code>ngx_thread_pool_module</code> and <code>ngx_openssl_module</code> modules. The HTTP module, the stream module, the mail module and event modules are core modules too. The context of a core module is defined as:
es: El conjunto de m&oacute;dulos principales incluye los m&oacute;dulos <code>ngx_core_module</code> , <code>ngx_errlog_module</code> , <code>ngx_regex_module</code> , <code>ngx_thread_pool_module</code> y <code>ngx_openssl_module</code> . El m&oacute;dulo HTTP, el m&oacute;dulo de flujo, el m&oacute;dulo de correo y los m&oacute;dulos de eventos tambi&eacute;n son m&oacute;dulos centrales. El contexto de un m&oacute;dulo principal se define como:
ko: 핵심 모듈 세트에는 <code>ngx_core_module</code> , <code>ngx_errlog_module</code> , <code>ngx_regex_module</code> , <code>ngx_thread_pool_module</code> 및 <code>ngx_openssl_module</code> 모듈이 포함됩니다. HTTP 모듈, 스트림 모듈, 메일 모듈 및 이벤트 모듈도 핵심 모듈입니다. 핵심 모듈의 컨텍스트는 다음과 같이 정의됩니다.

source: The shared SSL session cache has been supported since 0.5.6.
es: La caché de sesión SSL compartida es compatible desde la versión 0.5.6.
ko: 공유 SSL 세션 캐시는 0.5.6부터 지원되었습니다.

source: The shared memory entry structure <code>ngx_shm_zone_t</code> has the following fields:
es: La estructura de entrada de memoria compartida <code>ngx_shm_zone_t</code> tiene los siguientes campos:
ko: 공유 메모리 입력 구조 <code>ngx_shm_zone_t</code> 에는 다음 필드가 있습니다.

source: The simple monitoring page is shipped with this distribution, accessible as &ldquo;<code>/status.html</code>&rdquo; in the default configuration. It requires the locations &ldquo;<code>/status</code>&rdquo; and &ldquo;<code>/status.html</code>&rdquo; to be configured as shown above.
es: La p&aacute;gina de monitoreo simple se env&iacute;a con esta distribuci&oacute;n, accesible como " <code>/status.html</code> " en la configuraci&oacute;n predeterminada. Requiere que las ubicaciones &ldquo; <code>/status</code> &rdquo; y &ldquo; <code>/status.html</code> &rdquo; se configuren como se muestra arriba.
ko: 단순 모니터링 페이지는이 배포와 함께 제공되며 기본 구성에서 " <code>/status.html</code> " 로 액세스 할 수 있습니다. 위와 같이 " <code>/status</code> "및 " <code>/status.html</code> "위치를 구성해야합니다.

source: The simplest configuration for load balancing with nginx may look like the following:
es: La configuración más simple para el balanceo de carga con nginx puede parecerse a la siguiente:
ko: nginx로로드 밸런싱을위한 가장 간단한 구성은 다음과 같습니다.

source: The special &ldquo;cache manager&rdquo; process monitors the maximum cache size set by the <code>max_size</code> parameter. When this size is exceeded, it removes the least recently used data. The data is removed in iterations configured by <code>manager_files</code>, <code>manager_threshold</code>, and <code>manager_sleep</code> parameters (1.11.5). During one iteration no more than <code>manager_files</code> items are deleted (by default, 100). The duration of one iteration is limited by the <code>manager_threshold</code> parameter (by default, 200 milliseconds). Between iterations, a pause configured by the <code>manager_sleep</code> parameter (by default, 50 milliseconds) is made.
es: El proceso especial de "administrador de cach&eacute;" monitorea el tama&ntilde;o m&aacute;ximo de cach&eacute; establecido por el par&aacute;metro <code>max_size</code> . Cuando se excede este tama&ntilde;o, elimina los datos utilizados menos recientemente. Los datos se eliminan en iteraciones configuradas por los <code>manager_files</code> , <code>manager_threshold</code> y <code>manager_sleep</code> (1.11.5). Durante una iteraci&oacute;n, no se eliminan m&aacute;s de los elementos <code>manager_files</code> (por defecto, 100). La duraci&oacute;n de una iteraci&oacute;n est&aacute; limitada por el par&aacute;metro <code>manager_threshold</code> (por defecto, 200 milisegundos). Entre iteraciones, se realiza una pausa configurada por el par&aacute;metro <code>manager_sleep</code> (por defecto, 50 milisegundos).
ko: 특수한 "캐시 관리자"프로세스는 <code>max_size</code> 매개 변수로 설정된 최대 캐시 크기를 모니터합니다 . 이 크기를 초과하면 가장 최근에 사용한 데이터가 제거됩니다. <code>manager_files</code> , <code>manager_threshold</code> 및 <code>manager_sleep</code> 매개 변수 (1.11.5)로 구성된 반복에서 데이터가 제거됩니다 . 한 번의 반복 동안 <code>manager_files</code> 항목 만 삭제됩니다 (기본적으로 100). 한 번의 반복 기간은 <code>manager_threshold</code> 매개 변수 (기본적으로 200 밀리 초)에 의해 제한됩니다 . 반복 사이에 <code>manager_sleep</code> 매개 변수 (기본적으로 50 밀리 초)로 구성된 일시 정지 가 작성됩니다.

source: The special form <code>.example.org</code> has been supported since 0.3.18.
es: La forma especial <code>.example.org</code> se admite desde 0.3.18.
ko: 특수 형식 <code>.example.org</code> 는 0.3.18부터 지원되었습니다.

source: The special mask &ldquo;<code>msie6</code>&rdquo; (0.7.12) corresponds to the regular expression &ldquo;<code>MSIE [4-6]\.</code>&rdquo;, but works faster. Starting from version 0.8.11, &ldquo;<code>MSIE 6.0; ... SV1</code>&rdquo; is excluded from this mask.
es: La m&aacute;scara especial &ldquo; <code>msie6</code> &rdquo; (0.7.12) corresponde a la expresi&oacute;n regular &ldquo; <code>MSIE [4-6]\.</code> &rdquo;, Pero funciona m&aacute;s r&aacute;pido. A partir de la versi&oacute;n 0.8.11, &ldquo; <code>MSIE 6.0; ... SV1</code> &rdquo;est&aacute; excluido de esta m&aacute;scara.
ko: 특수 마스크 " <code>msie6</code> "(0.7.12)은 정규식 " <code>MSIE [4-6]\.</code> &rdquo;이지만 더 빠르게 작동합니다. 버전 0.8.11부터&ldquo; <code>MSIE 6.0; ... SV1</code> 이 마스크에서 SV1 &rdquo;이 제외되었습니다.

source: The special server name &ldquo;<code>$hostname</code>&rdquo; has been supported since 0.9.4.
es: El nombre de servidor especial &ldquo; <code>$hostname</code> &rdquo; se admite desde 0.9.4.
ko: 특수 서버 이름 " <code>$hostname</code> "은 0.9.4부터 지원되었습니다.

source: The special value <code>auto</code> (1.11.0) instructs nginx to use a list built into the OpenSSL library when using OpenSSL 1.0.2 or higher, or <code>prime256v1</code> with older versions.
es: El valor especial <code>auto</code> (1.11.0) indica a nginx que use una lista integrada en la biblioteca OpenSSL cuando se usa OpenSSL 1.0.2 o superior, o <code>prime256v1</code> con versiones anteriores.
ko: 특수 값 <code>auto</code> (1.11.0)는 OpenSSL 1.0.2 이상 또는 이전 버전의 <code>prime256v1</code> 을 사용할 때 nginx에 OpenSSL 라이브러리에 내장 된 목록을 사용하도록 지시 합니다.

source: The special value <code>auto</code> (1.9.10) allows binding worker processes automatically to available CPUs:
es: El valor especial <code>auto</code> (1.9.10) permite vincular procesos de trabajo autom&aacute;ticamente a las CPU disponibles:
ko: 특수 값 <code>auto</code> (1.9.10)를 사용하면 작업자 프로세스를 사용 가능한 CPU에 자동으로 바인딩 할 수 있습니다.

source: The special value <code>off</code> cancels the effect of the <code>auth_jwt</code> directive inherited from the previous configuration level.
es: El valor especial <code>off</code> cancela el efecto de la directiva <code>auth_jwt</code> heredada del nivel de configuraci&oacute;n anterior.
ko: 특수 값 <code>off</code> 는 이전 구성 수준에서 상속 된 <code>auth_jwt</code> 지시문 의 효과를 취소합니다 .

source: The special value <code>off</code> disables resolving.
es: El valor especial <code>off</code> desactiva la resoluci&oacute;n.
ko: 특수 값 <code>off</code> 는 분석 을 비활성화합니다.

source: The special value <code>unlisted</code> specifies to consider a browser as modern if it was not listed by the <code>modern_browser</code> and <a href="#ancient_browser">ancient_browser</a> directives. Otherwise such a browser is considered ancient. If a request does not provide the &ldquo;User-Agent&rdquo; field in the header, the browser is treated as not being listed.
es: El valor especial <code>unlisted</code> especifica considerar un navegador como moderno si no fue listado por las directivas <code>modern_browser</code> y <a href="#ancient_browser">ancient_browser</a> . De lo contrario, dicho navegador se considera antiguo. Si una solicitud no proporciona el campo "Agente de usuario" en el encabezado, el navegador se trata como si no estuviera en la lista.
ko: <code>unlisted</code> 특수 값 은 <code>modern_browser</code> 및 <a href="#ancient_browser">ancient_browser</a> 지시문 에 의해 브라우저가 나열되지 않은 경우 브라우저를 최신으로 간주하도록 지정합니다. 그렇지 않으면 그러한 브라우저는 고대로 간주됩니다. 요청이 헤더에 "User-Agent"필드를 제공하지 않으면 브라우저가 나열되지 않은 것으로 처리됩니다.

source: The specified <code><i>condition</i></code> is evaluated. If true, this module directives specified inside the braces are executed, and the request is assigned the configuration inside the <code>if</code> directive. Configurations inside the <code>if</code> directives are inherited from the previous configuration level.
es: Se eval&uacute;a la <code><i>condition</i></code> especificada . Si es verdadero, las directivas de este m&oacute;dulo especificadas dentro de las llaves se ejecutan y a la solicitud se le asigna la configuraci&oacute;n dentro de la directiva <code>if</code> . Las configuraciones dentro de las directivas <code>if</code> se heredan del nivel de configuraci&oacute;n anterior.
ko: 지정된 <code><i>condition</i></code> 이 평가됩니다. true이면 중괄호 안에 지정된이 모듈 지시문이 실행되고 요청에 <code>if</code> 지시문 내의 구성이 할당됩니다 . <code>if</code> 지시문 내의 구성 은 이전 구성 수준에서 상속됩니다.

source: The state is currently limited to the list of servers with their parameters. The file is read when parsing the configuration and is updated each time the upstream configuration is <a href="../http/ngx_http_api_module#stream_upstreams_stream_upstream_name_servers_">changed</a>. Changing the file content directly should be avoided. The directive cannot be used along with the <a href="#server">server</a> directive.
es: El estado est&aacute; actualmente limitado a la lista de servidores con sus par&aacute;metros. El archivo se lee al analizar la configuraci&oacute;n y se actualiza cada vez que se <a href="../http/ngx_http_api_module#stream_upstreams_stream_upstream_name_servers_">cambia la</a> configuraci&oacute;n ascendente . Se debe evitar cambiar el contenido del archivo directamente. La directiva no se puede utilizar junto con la directiva de <a href="#server">servidor</a> .
ko: 상태는 현재 매개 변수가있는 서버 목록으로 제한됩니다. 구성을 구문 분석 할 때 파일을 읽고 업스트림 구성이 <a href="../http/ngx_http_api_module#stream_upstreams_stream_upstream_name_servers_">변경</a> 될 때마다 업데이트됩니다 . 파일 내용을 직접 변경하지 마십시오. 지시문은 <a href="#server">서버</a> 지시문 과 함께 사용할 수 없습니다 .

source: The state is currently limited to the list of servers with their parameters. The file is read when parsing the configuration and is updated each time the upstream configuration is <a href="ngx_http_api_module#http_upstreams_http_upstream_name_servers_">changed</a>. Changing the file content directly should be avoided. The directive cannot be used along with the <a href="#server">server</a> directive.
es: El estado est&aacute; actualmente limitado a la lista de servidores con sus par&aacute;metros. El archivo se lee al analizar la configuraci&oacute;n y se actualiza cada vez que se <a href="ngx_http_api_module#http_upstreams_http_upstream_name_servers_">cambia la</a> configuraci&oacute;n ascendente . Se debe evitar cambiar el contenido del archivo directamente. La directiva no se puede utilizar junto con la directiva de <a href="#server">servidor</a> .
ko: 상태는 현재 매개 변수가있는 서버 목록으로 제한됩니다. 구성을 구문 분석 할 때 파일을 읽고 업스트림 구성이 <a href="ngx_http_api_module#http_upstreams_http_upstream_name_servers_">변경</a> 될 때마다 업데이트됩니다 . 파일 내용을 직접 변경하지 마십시오. 지시문은 <a href="#server">서버</a> 지시문 과 함께 사용할 수 없습니다 .

source: The status information will be accessible from the surrounding location. Access to this location should be <a href="ngx_http_core_module#satisfy">limited</a>.
es: Se podr&aacute; acceder a la informaci&oacute;n de estado desde la ubicaci&oacute;n circundante. El acceso a esta ubicaci&oacute;n debe ser <a href="ngx_http_core_module#satisfy">limitado</a> .
ko: 상태 정보는 주변 위치에서 액세스 할 수 있습니다. 이 위치에 대한 액세스는 <a href="ngx_http_core_module#satisfy">제한</a> 되어야합니다 .

source: The status of a link check. The specific value depends on the selected operation mode.
es: El estado de la comprobación de un enlace.El valor específico depende del modo de funcionamiento seleccionado.
ko: 링크 확인 상태입니다. 특정 값은 선택한 작동 모드에 따라 다릅니다.

source: The stream session object is available only in the <a href="../stream/ngx_stream_js_module">ngx_stream_js_module</a> module. All string properties of the object are <a href="#string">byte strings</a>.
es: El objeto de la sesi&oacute;n de transmisi&oacute;n solo est&aacute; disponible en el m&oacute;dulo <a href="../stream/ngx_stream_js_module">ngx_stream_js_module</a> . Todas las propiedades de cadena del objeto son <a href="#string">cadenas de bytes</a> .
ko: 스트림 세션 객체는 <a href="../stream/ngx_stream_js_module">ngx_stream_js_module</a> 모듈 에서만 사용할 수 있습니다 . 객체의 모든 문자열 속성은 <a href="#string">바이트 문자열</a> 입니다.

source: The string operations in nginx are declared in <code>src/core/ngx_string.h</code> Some of them are wrappers around standard C functions:
es: Las operaciones de cadena en nginx se declaran en <code>src/core/ngx_string.h</code> Algunas de ellas son envolturas de funciones est&aacute;ndar de C:
ko: nginx의 문자열 연산은 <code>src/core/ngx_string.h</code> 에 선언되어 있습니다. 그중 일부는 표준 C 함수를 감싸는 래퍼입니다.

source: The structure has the following fields:
es: La estructura tiene los siguientes campos:
ko: 구조에는 다음과 같은 필드가 있습니다.

source: The synchronization status of a node is available via the <a href="../http/ngx_http_api_module#stream_zone_sync_">/stream/zone_sync/</a> endpoint of the API which returns the <a href="../http/ngx_http_api_module#def_nginx_stream_zone_sync">following</a> metrics.
es: El estado de sincronizaci&oacute;n de un nodo est&aacute; disponible a trav&eacute;s de <a href="../http/ngx_http_api_module#stream_zone_sync_">/ stream / zone_sync /</a> endpoint de la API, que devuelve las <a href="../http/ngx_http_api_module#def_nginx_stream_zone_sync">siguientes</a> m&eacute;tricas.
ko: 노드의 동기화 상태 는 API 의 <a href="../http/ngx_http_api_module#stream_zone_sync_">/ stream / zone_sync /</a> 엔드 포인트를 통해 사용 가능 하며 <a href="../http/ngx_http_api_module#def_nginx_stream_zone_sync">다음</a> 메트릭 을 리턴합니다 .

source: The time (in milliseconds since Epoch) when the server became &ldquo;<code>unavail</code>&rdquo;, &ldquo;<code>checking</code>&rdquo;, or &ldquo;<code>unhealthy</code>&rdquo;.
es: El tiempo (en milisegundos desde Epoch) cuando el servidor se convirti&oacute; en "no <code>unavail</code> ", " <code>checking</code> " o "en <code>unhealthy</code> ".
ko: 서버가 "이되었다 (신기원 이후 밀리 초) 시간 <code>unavail</code> ", " <code>checking</code> "또는 " <code>unhealthy</code> ".

source: The time (in milliseconds since Epoch) when the server was last selected to process a connection.
es: El tiempo (en milisegundos desde la época)en que el servidor fue seleccionado por última vez para procesar una conexión.
ko: 연결을 처리하기 위해 서버를 마지막으로 선택한 시간 (Epoch 이후 밀리 초)

source: The time (in milliseconds since Epoch) when the server was last selected to process a request (1.7.5).
es: El tiempo (en milisegundos desde la época)en que el servidor fue seleccionado por última vez para procesar una solicitud (1.7.5).
ko: 서버가 요청을 처리하기 위해 마지막으로 선택된 시간 (1.7.5) (1.7.5)

source: The time in the &ldquo;Expires&rdquo; field is computed as a sum of the current time and <code><i>time</i></code> specified in the directive. If the <code>modified</code> parameter is used (0.7.0, 0.6.32) then the time is computed as a sum of the file&rsquo;s modification time and the <code><i>time</i></code> specified in the directive.
es: El tiempo en el campo "Caduca" se calcula como una suma del tiempo actual y el <code><i>time</i></code> especificado en la directiva. Si se utiliza el par&aacute;metro <code>modified</code> (0.7.0, 0.6.32), el tiempo se calcula como la suma del tiempo de modificaci&oacute;n del archivo y el <code><i>time</i></code> especificado en la directiva.
ko: "만료"필드의 <code><i>time</i></code> 은 지시문에 지정된 현재 시간과 <i>시간</i> 의 합계로 계산됩니다 . 경우] <code>modified</code> 파라미터 (0.7.0, 0.6.32) 사용되는 다음 시간은 파일의 수정 시간의 합과 같이 계산되는 <code><i>time</i></code> 지시자에 지정된.

source: The time when the server became &ldquo;<code>unavail</code>&rdquo;, &ldquo;<code>checking</code>&rdquo;, or &ldquo;<code>unhealthy</code>&rdquo;, in the ISO 8601 format with millisecond resolution.
es: El momento en que el servidor se volvi&oacute; " <code>unavail</code> ", " <code>checking</code> " o " <code>unhealthy</code> ", en el formato ISO 8601 con una resoluci&oacute;n de milisegundos.
ko: 밀리 초 해상도의 ISO 8601 형식에서 서버가 "사용 <code>unavail</code> ", " <code>checking</code> "또는 " <code>unhealthy</code> "상태가 된 시간입니다.

source: The time when the server was last selected to process a connection, in the ISO 8601 format with millisecond resolution.
es: El momento en que el servidor fue seleccionado por última vez para procesar una conexión,en el formato ISO 8601 con resolución de milisegundos.
ko: 연결을 처리하기 위해 서버가 마지막으로 선택된 시간 (밀리 초 해상도의 ISO 8601 형식).

source: The time when the server was last selected to process a request, in the ISO 8601 format with millisecond resolution.
es: El momento en que el servidor fue seleccionado por última vez para procesar una solicitud,en el formato ISO 8601 con resolución de milisegundos.
ko: 요청을 처리하기 위해 서버가 마지막으로 선택된 시간 (밀리 초 해상도의 ISO 8601 형식).

source: The total number of <a href="../stream/ngx_stream_upstream_hc_module#health_check">health check</a> requests made.
es: El n&uacute;mero total de solicitudes de <a href="../stream/ngx_stream_upstream_hc_module#health_check">verificaci&oacute;n</a> de estado realizadas.
ko: 작성된 총 <a href="../stream/ngx_stream_upstream_hc_module#health_check">상태 점검</a> 요청 수입니다 .

source: The total number of <a href="ngx_http_proxy_module#proxy_cache_valid">valid</a> responses read from the cache.
es: El n&uacute;mero total de respuestas <a href="ngx_http_proxy_module#proxy_cache_valid">v&aacute;lidas</a> le&iacute;das de la cach&eacute;.
ko: 캐시에서 읽은 총 <a href="ngx_http_proxy_module#proxy_cache_valid">유효</a> 응답 수입니다 .

source: The total number of <a href="ngx_http_upstream_hc_module#health_check">health check</a> requests made.
es: El n&uacute;mero total de solicitudes de <a href="ngx_http_upstream_hc_module#health_check">verificaci&oacute;n</a> de estado realizadas.
ko: 작성된 총 <a href="ngx_http_upstream_hc_module#health_check">상태 점검</a> 요청 수입니다 .

source: The total number of abnormally terminated and respawned child processes.
es: El número total de procesos infantiles anormalmente terminados y reproducidos.
ko: 비정상적으로 종료되고 다시 생성 된 하위 프로세스의 총 수

source: The total number of accepted client connections.
es: El número total de conexiones de clientes aceptadas.
ko: 허용 된 총 클라이언트 연결 수입니다.
