Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/nginx/nginx.*.004.xlf
Languages: es, ja, ko, ru, zh_cn

source: The <a href="#slabs">slabs</a> status data were added in <a href="#version">version</a> 8.
es: Los datos de estado de las <a href="#slabs">losas</a> se agregaron en la <a href="#version">versi&oacute;n</a> 8.
ja: <a href="#slabs">スラブの</a>ステータスデータは、で追加された<a href="#version">バージョン</a> 8。
ko: <a href="#slabs">석판</a> 상태 데이터에 추가 된 <a href="#version">버전</a> 8.
ru: Данные о статусе <a href="#slabs">плит</a> были добавлены в <a href="#version">версии</a> 8.
zh_cn: 该<a href="#slabs">砖</a>在加状态数据<a href="#version">版本</a> 8。

source: The <a href="#ssl">ssl</a> status data were added in <a href="#version">version</a> 6.
es: Los datos de estado de <a href="#ssl">SSL</a> se agregaron en la <a href="#version">versi&oacute;n</a> 6.
ja: <a href="#ssl">SSLの</a>状態データを添加した<a href="#version">バージョン</a> 6。
ko: <a href="#ssl">SSL의</a> 상태 데이터에 첨가 <a href="#version">버전</a> 6.
ru: Данные статуса <a href="#ssl">ssl</a> были добавлены в <a href="#version">версии</a> 6.
zh_cn: 在<a href="#ssl">SSL</a>中添加状态数据<a href="#version">版本</a> 6。

source: The <a href="#state">checking</a> state was added in <a href="#version">version</a> 8.
es: El estado de <a href="#state">verificaci&oacute;n</a> se agreg&oacute; en la <a href="#version">versi&oacute;n</a> 8.
ja: <a href="#state">チェック</a>状態で追加された<a href="#version">バージョン</a> 8。
ko: <a href="#state">검사</a> 상태에 첨가 <a href="#version">버전</a> 8.
ru: Состояние <a href="#state">проверки</a> было добавлено в <a href="#version">версии</a> 8.
zh_cn: 在<a href="#state">检查</a>中添加状态<a href="#version">版本</a> 8。

source: The <a href="#state">draining</a> state in <a href="#upstreams">upstreams</a> was added in <a href="#version">version</a> 4.
es: El estado de <a href="#state">drenaje</a> en <a href="#upstreams">aguas arriba</a> se agreg&oacute; en la <a href="#version">versi&oacute;n</a> 4.
ja: <a href="#upstreams">アップストリーム</a>の<a href="#state">ドレイン</a>状態は、<a href="#version">バージョン</a> 4で追加されました。
ko: <a href="#upstreams">업스트림</a> 의 <a href="#state">배수</a> 상태 가 <a href="#version">버전</a> 에 추가되었습니다 4 .
ru: Состояние <a href="#state">слива</a> в <a href="#upstreams">апстриме</a> было добавлено в <a href="#version">версии</a> 4.
zh_cn: <a href="#version">版本</a> 4 中增加了<a href="#upstreams">上游</a>的<a href="#state">排水</a>状态。

source: The <a href="#stream">stream</a> status data were added in <a href="#version">version</a> 5.
es: Los <a href="#stream">corriente</a> se a&ntilde;adieron datos de estado en <a href="#version">la versi&oacute;n</a> 5.
ja: <a href="#stream">ストリーム</a>ステータスデータは、で追加された<a href="#version">バージョン</a> 5。
ko: <a href="#stream">스트림</a> 상태 데이터에 첨가 <a href="#version">버전</a> 5.
ru: Данные о статусе <a href="#stream">потока</a> были добавлены в <a href="#version">версии</a> 5.
zh_cn: 在<a href="#stream">流</a>中添加状态数据<a href="#version">版本</a> 5。

source: The <a href="#stream_keyvals_">/stream/keyvals/</a> data were added in <a href="#api_version">version</a> 2.
es: El <a href="#stream_keyvals_">/ stream / keyvals /</a> data se agregaron en la <a href="#api_version">versi&oacute;n</a> 2.
ja: <a href="#stream_keyvals_">/ストリーム/ keyvals /</a>データは、添加した<a href="#api_version">バージョン</a> 2。
ko: <a href="#stream_keyvals_">/ 스트림 / keyvals /</a> 데이터에 첨가 <a href="#api_version">버전</a> 2.
ru: В <a href="#stream_keyvals_">/ Поток / keyvals /</a> данные были добавлены в <a href="#api_version">версии</a> 2.
zh_cn: 的<a href="#stream_keyvals_">/流/ keyvals /</a>中加入数据<a href="#api_version">版本</a> 2。

source: The <a href="#stream_zone_sync_">/stream/zone_sync/</a> data were added in <a href="#api_version">version</a> 3.
es: El <a href="#stream_zone_sync_">/ corriente / zone_sync /</a> se a&ntilde;adieron datos en <a href="#api_version">la versi&oacute;n</a> 3.
ja: <a href="#stream_zone_sync_">/ストリーム/ zone_sync /</a>データを添加した<a href="#api_version">バージョン</a> 3。
ko: <a href="#stream_zone_sync_">/ 스트림 / zone_sync /</a> 데이터에 첨가 <a href="#api_version">버전</a> 3.
ru: <a href="#stream_zone_sync_">/ Поток / zone_sync /</a> данные были добавлены в <a href="#api_version">версии</a> 3.
zh_cn: 的<a href="#stream_zone_sync_">/流/ zone_sync /</a>数据中加入<a href="#api_version">版本</a> 3。

source: The <a href="#string_tobytes">toBytes()</a> method serializes a Unicode string with code points up to 255 into a byte string, otherwise, <code>null</code> is returned:
es: El m&eacute;todo <a href="#string_tobytes">toBytes ()</a> serializa una cadena Unicode con puntos de c&oacute;digo de hasta 255 en una cadena de bytes; de lo contrario, se devuelve un <code>null</code> :
ja: <a href="#string_tobytes">toBytesは（）</a>メソッドは、バイト文字列に255までのコードポイントを持つUnicode文字列をシリアル化し、そうでない場合は、 <code>null</code> が返されます。
ko: <a href="#string_tobytes">toBytes는 ()</a> 메소드가 바이트의 문자열로 최대 255 코드 포인트로 유니 코드 문자열 직렬화 달리, <code>null</code> 가 반환된다 :
ru: Метод <a href="#string_tobytes">toBytes ()</a> сериализует строку Unicode с кодовыми точками до 255 в байтовую строку, в противном случае возвращается <code>null</code> :
zh_cn: 所述<a href="#string_tobytes">toBytes（）</a>方法串行化一个Unicode字符串与代码点高达255到字节串，否则， <code>null</code> 返回：

source: The <a href="#zombies">zombies</a> field was moved from nginx <a href="../debugging_log">debug</a> version in <a href="#version">version</a> 6.
es: El campo <a href="#zombies">zombies</a> se movi&oacute; de la versi&oacute;n de <a href="../debugging_log">depuraci&oacute;n de</a> nginx en la <a href="#version">versi&oacute;n</a> 6.
ja: <a href="#zombies">ゾンビの</a>フィールドは、nginxのから移動された<a href="../debugging_log">デバッグ</a>にバージョン<a href="#version">バージョン</a> 6。
ko: <a href="#zombies">좀비</a> 필드의 nginx에서 이동 된 <a href="../debugging_log">디버그</a> 에서 버전 <a href="#version">버전</a> 6.
ru: Поле <a href="#zombies">зомби</a> было перемещено из <a href="../debugging_log">отладочной</a> версии nginx в <a href="#version">версии</a> 6.
zh_cn: 该<a href="#zombies">僵尸</a>场从nginx的移动<a href="../debugging_log">调试</a>版本，<a href="#version">版本</a> 6。

source: The <a href="#zone">zone</a> field in <a href="#upstreams">http</a> and <a href="#stream_upstreams">stream</a> upstreams was added in <a href="#version">version</a> 8.
es: El campo de <a href="#zone">zona</a> en <a href="#upstreams">http</a> y <a href="#stream_upstreams">stream</a> upstreams se agreg&oacute; en la <a href="#version">versi&oacute;n</a> 8.
ja: <a href="#upstreams">http</a>および<a href="#stream_upstreams">ストリーム</a>アップストリームの<a href="#zone">ゾーン</a>フィールドは、<a href="#version">バージョン</a> 8で追加されました。
ko: <a href="#upstreams">http</a> 및 <a href="#stream_upstreams">스트림</a> 업스트림 의 <a href="#zone">영역</a> 필드 가 <a href="#version">버전</a> 8 에 추가되었습니다 .
ru: Поле <a href="#zone">зоны</a> в <a href="#upstreams">http</a> и <a href="#stream_upstreams">stream</a> upstreams было добавлено в <a href="#version">версии</a> 8.
zh_cn: 在<a href="#version">版本</a> 8 中添加了<a href="#upstreams">http</a>和上游<a href="#stream_upstreams">流中</a>的<a href="#zone">zone</a>字段。

source: The <a href="../http/ngx_http_upstream_module">ngx_http_upstream_module</a> can be configured explicitly by placing the corresponding <a href="../http/ngx_http_upstream_module#upstream">upstream</a> block into the configuration file, or implicitly by using directives such as <a href="../http/ngx_http_proxy_module#proxy_pass">proxy_pass</a> that accept a URL that gets evaluated at some point into a list of servers. The alternative load-balancing methods are available only with an explicit upstream configuration. The upstream module configuration has its own directive context <code>NGX_HTTP_UPS_CONF</code>. The structure is defined as follows:
es: El <a href="../http/ngx_http_upstream_module">ngx_http_upstream_module</a> se puede configurar expl&iacute;citamente colocando el bloque <a href="../http/ngx_http_upstream_module#upstream">ascendente</a> correspondiente en el archivo de configuraci&oacute;n, o impl&iacute;citamente mediante el uso de directivas como <a href="../http/ngx_http_proxy_module#proxy_pass">proxy_pass</a> que aceptan una URL que se eval&uacute;a en alg&uacute;n momento en una lista de servidores. Los m&eacute;todos alternativos de equilibrio de carga est&aacute;n disponibles solo con una configuraci&oacute;n ascendente expl&iacute;cita. La configuraci&oacute;n del m&oacute;dulo ascendente tiene su propio contexto de directiva <code>NGX_HTTP_UPS_CONF</code> . La estructura se define de la siguiente manera:
ja: <a href="../http/ngx_http_upstream_module">ngx_http_upstream_moduleは</a>、対応する配置することによって、明示的に設定することができ<a href="../http/ngx_http_upstream_module#upstream">、上流</a>、または暗黙のようなディレクティブ使用してコンフィギュレーションファイルにブロックを<a href="../http/ngx_http_proxy_module#proxy_pass">proxy_pass</a>サーバのリストの中にいくつかの点で評価されますURLを受け入れます。代替の負荷分散方法は、明示的なアップストリーム構成でのみ使用できます。アップストリームモジュールの構成には、独自のディレクティブコンテキスト <code>NGX_HTTP_UPS_CONF</code> があります。構造は次のように定義されます。
ko: <a href="../http/ngx_http_upstream_module">ngx_http_upstream_module는</a> 해당 배치하여 명시 적으로 구성 할 수 있습니다 <a href="../http/ngx_http_upstream_module#upstream">업스트림</a> 또는 암시 적으로 다음과 같은 지침을 사용하여 구성 파일에 블록을 <a href="../http/ngx_http_proxy_module#proxy_pass">proxy_pass</a> 서버 목록에 어떤 시점에서 평가됩니다 URL을 받아들입니다. 대체로드 밸런싱 방법은 명시적인 업스트림 구성에서만 사용할 수 있습니다. 업스트림 모듈 구성에는 자체 지시문 컨텍스트 <code>NGX_HTTP_UPS_CONF</code> 가 있습니다. 구조는 다음과 같이 정의됩니다.
ru: Модуль <a href="../http/ngx_http_upstream_module">ngx_http_upstream_module</a> можно настроить явно, поместив соответствующий блок <a href="../http/ngx_http_upstream_module#upstream">восходящего потока</a> в файл конфигурации, или неявно, используя такие директивы, как <a href="../http/ngx_http_proxy_module#proxy_pass">proxy_pass,</a> которые принимают URL-адрес, который в какой-то момент оценивается в списке серверов. Альтернативные методы балансировки нагрузки доступны только при явной конфигурации восходящего потока. Конфигурация восходящего модуля имеет свой собственный контекст директивы <code>NGX_HTTP_UPS_CONF</code> . Структура определяется следующим образом:
zh_cn: 所述<a href="../http/ngx_http_upstream_module">ngx_http_upstream_module</a>可以明确地通过将相应的被配置<a href="../http/ngx_http_upstream_module#upstream">上游</a>块到配置文件，或隐式地通过使用指令，如<a href="../http/ngx_http_proxy_module#proxy_pass">proxy_pass</a>接受该被在某个点评价，分为服务器的列表的URL。替代的负载平衡方法仅在显式上游配置中可用。上游模块配置具有其自己的指令上下文 <code>NGX_HTTP_UPS_CONF</code> 。结构定义如下：

source: The <a href="../http/ngx_http_upstream_module">ngx_http_upstream_module</a> provides the basic functionality needed to pass requests to remote servers. Modules that implement specific protocols, such as HTTP or FastCGI, use this functionality. The module also provides an interface for creating custom load-balancing modules and implements a default round-robin method.
es: El <a href="../http/ngx_http_upstream_module">ngx_http_upstream_module</a> proporciona la funcionalidad b&aacute;sica necesaria para aprobar solicitudes a los servidores remotos. Los m&oacute;dulos que implementan protocolos espec&iacute;ficos, como HTTP o FastCGI, utilizan esta funcionalidad. El m&oacute;dulo tambi&eacute;n proporciona una interfaz para crear m&oacute;dulos personalizados de equilibrio de carga e implementa un m&eacute;todo de operaci&oacute;n por turnos predeterminado.
ja: <a href="../http/ngx_http_upstream_module">ngx_http_upstream_moduleは、</a>リモートサーバに要求を渡すために必要な基本的な機能を提供します。HTTPやFastCGIなどの特定のプロトコルを実装するモジュールは、この機能を使用します。このモジュールは、カスタムの負荷分散モジュールを作成するためのインターフェースも提供し、デフォルトのラウンドロビン方式を実装します。
ko: <a href="../http/ngx_http_upstream_module">ngx_http_upstream_module는</a> 원격 서버로 요청을 전달하는 데 필요한 기본 기능을 제공합니다. HTTP 또는 FastCGI와 같은 특정 프로토콜을 구현하는 모듈은이 기능을 사용합니다. 이 모듈은 또한 맞춤형로드 밸런싱 모듈을 생성하기위한 인터페이스를 제공하며 기본 라운드 로빈 방법을 구현합니다.
ru: Модуль <a href="../http/ngx_http_upstream_module">ngx_http_upstream_module</a> предоставляет базовые функции, необходимые для передачи запросов на удаленные серверы. Модули, реализующие определенные протоколы, такие как HTTP или FastCGI, используют эту функцию. Модуль также предоставляет интерфейс для создания настраиваемых модулей балансировки нагрузки и реализует метод циклического перебора по умолчанию.
zh_cn: 所述<a href="../http/ngx_http_upstream_module">ngx_http_upstream_module</a>提供到请求传递给远程服务器所需的基本功能。实现特定协议（例如HTTP或FastCGI）的模块使用此功能。该模块还提供用于创建自定义负载平衡模块的接口，并实现默认的轮询方法。

source: The <a href="../http/ngx_http_upstream_module#least_conn">least_conn</a> and <a href="../http/ngx_http_upstream_module#hash">hash</a> modules implement alternative load-balancing methods, but are actually implemented as extensions of the upstream round-robin module and share a lot of code with it, such as the representation of a server group. The <a href="../http/ngx_http_upstream_module#keepalive">keepalive</a> module is an independent module that extends upstream functionality.
es: Los m&oacute;dulos <a href="../http/ngx_http_upstream_module#least_conn">less_conn</a> y <a href="../http/ngx_http_upstream_module#hash">hash</a> implementan m&eacute;todos alternativos de equilibrio de carga, pero en realidad se implementan como extensiones del m&oacute;dulo de operaci&oacute;n por turnos ascendente y comparten una gran cantidad de c&oacute;digo con &eacute;l, como la representaci&oacute;n de un grupo de servidores. El m&oacute;dulo <a href="../http/ngx_http_upstream_module#keepalive">keepalive</a> es un m&oacute;dulo independiente que ampl&iacute;a la funcionalidad ascendente.
ja: <a href="../http/ngx_http_upstream_module#least_conn">least_conn</a>と<a href="../http/ngx_http_upstream_module#hash">ハッシュ</a>モジュールは、代替的なロードバランシング方法を実装するが、実際にそのようなサーバ群の表現として、上流のラウンドロビン・モジュールの拡張機能として実装され、それに多くのコードを共有しています。<a href="../http/ngx_http_upstream_module#keepalive">キープアライブ</a>モジュールは、上流の機能を拡張独立モジュールです。
ko: <a href="../http/ngx_http_upstream_module#least_conn">least_conn</a> 및 <a href="../http/ngx_http_upstream_module#hash">해시</a> 모듈은 다른로드 밸런싱 방법을 구현하지만, 실제로 이러한 서버 그룹의 표현으로, 상류 라운드 로빈 모듈의 확장으로 구현하고 그것으로 많은 코드를 공유하고 있습니다. <a href="../http/ngx_http_upstream_module#keepalive">킵 얼라이브</a> 모듈 상류 기능을 확장 독립적 인 모듈이다.
ru: В <a href="../http/ngx_http_upstream_module#least_conn">least_conn</a> и <a href="../http/ngx_http_upstream_module#hash">хэш</a> - модулях применять альтернативные методы балансировки нагрузки, но на самом деле реализованы в виде расширений входного модуля циклического и имеют много кода с ним, например, представлением группы серверов. Модуль <a href="../http/ngx_http_upstream_module#keepalive">keepalive</a> - это независимый модуль, который расширяет функциональность восходящего потока.
zh_cn: 的<a href="../http/ngx_http_upstream_module#least_conn">least_conn</a>和<a href="../http/ngx_http_upstream_module#hash">散列</a>模块执行替代的负载平衡的方法，但实际上作为上游循环模块的扩展来实现，并与它共享大量的代码，诸如服务器群的表示。所述<a href="../http/ngx_http_upstream_module#keepalive">保活</a>模块是向上游延伸的功能的独立模块。

source: The <a href="../stream/ngx_stream_upstream_module#max_conns">max_conns</a> limit for the server.
es: El l&iacute;mite de <a href="../stream/ngx_stream_upstream_module#max_conns">max_conns</a> para el servidor.
ja: サーバーの<a href="../stream/ngx_stream_upstream_module#max_conns">max_conns</a>制限。
ko: 서버 의 <a href="../stream/ngx_stream_upstream_module#max_conns">max_conns</a> 제한입니다.
ru: В <a href="../stream/ngx_stream_upstream_module#max_conns">max_conns</a> ограничения для сервера.
zh_cn: 服务器的<a href="../stream/ngx_stream_upstream_module#max_conns">max_conns</a>限制。

source: The <a href="../stream/ngx_stream_upstream_module#service">service</a> parameter value of the <a href="../stream/ngx_stream_upstream_module#server">server</a> directive.
es: El valor del par&aacute;metro de <a href="../stream/ngx_stream_upstream_module#service">servicio</a> de la directiva del <a href="../stream/ngx_stream_upstream_module#server">servidor</a> .
ja: <a href="../stream/ngx_stream_upstream_module#server">サーバー</a>ディレクティブの<a href="../stream/ngx_stream_upstream_module#service">サービス</a>パラメータ値。
ko: <a href="../stream/ngx_stream_upstream_module#server">서버</a> 지시문 의 <a href="../stream/ngx_stream_upstream_module#service">서비스</a> 매개 변수 값입니다 .
ru: Значение <a href="../stream/ngx_stream_upstream_module#service">служебного</a> параметра директивы <a href="../stream/ngx_stream_upstream_module#server">сервера</a> .
zh_cn: <a href="../stream/ngx_stream_upstream_module#server">服务器</a>指令的<a href="../stream/ngx_stream_upstream_module#service">服务</a>参数值。

source: The <a href="http://hg.nginx.org/nginx-dev-examples">nginx-dev-examples</a> repository provides nginx module examples.
es: El repositorio <a href="http://hg.nginx.org/nginx-dev-examples">nginx-dev-examples</a> proporciona ejemplos de m&oacute;dulos nginx.
ja: <a href="http://hg.nginx.org/nginx-dev-examples">nginxの-DEV-例</a>リポジトリはnginxのモジュールの例を提供します。
ko: <a href="http://hg.nginx.org/nginx-dev-examples">의 nginx-DEV-예제</a> 저장소 Nginx의 모듈 예를 제공한다.
ru: <a href="http://hg.nginx.org/nginx-dev-examples">Nginx-DEV-примеры</a> хранилище обеспечивает Nginx примеры модулей.
zh_cn: 的<a href="http://hg.nginx.org/nginx-dev-examples">nginx的-DEV-实例</a>存储库提供nginx的模块的例子。

source: The <a href="http://hg.nginx.org/njs">repository</a> with njs sources can be cloned with the following command: (requires <a href="https://www.mercurial-scm.org">Mercurial</a> client):
es: El <a href="http://hg.nginx.org/njs">repositorio</a> con fuentes njs se puede clonar con el siguiente comando: (requiere cliente <a href="https://www.mercurial-scm.org">Mercurial</a> ):
ja: <a href="http://hg.nginx.org/njs">リポジトリ</a> NJSソースとは、次のコマンドを使用してクローニングすることができる：（必要と<a href="https://www.mercurial-scm.org">Mercurialの</a>クライアント）：
ko: <a href="http://hg.nginx.org/njs">저장소</a> NJS 소스로는 다음과 같은 명령을 복제 할 수 있습니다 (필요 <a href="https://www.mercurial-scm.org">의욕</a> 클라이언트) :
ru: <a href="http://hg.nginx.org/njs">Хранилище</a> с источниками NJS могут быть клонированы с помощью команды следующего: (требует <a href="https://www.mercurial-scm.org">Mercurial</a> клиента):
zh_cn: 可以使用以下命令克隆具有njs源的<a href="http://hg.nginx.org/njs">存储库</a>：（需要<a href="https://www.mercurial-scm.org">Mercurial</a>客户端）：

source: The <a href="ngx_core_module#error_log">error_log</a> and <a href="http/ngx_http_log_module#access_log">access_log</a> directives support logging to syslog. The following parameters configure logging to syslog:
es: Las directivas <a href="ngx_core_module#error_log">error_log</a> y <a href="http/ngx_http_log_module#access_log">access_log</a> admiten el registro en syslog. Los siguientes par&aacute;metros configuran el registro en syslog:
ja: <a href="ngx_core_module#error_log">error_log</a>と<a href="http/ngx_http_log_module#access_log">access_logの</a>ディレクティブは、syslogへのロギングをサポートしています。以下のパラメーターは、syslogへのロギングを構成します。
ko: <a href="ngx_core_module#error_log">의 error_log</a> 및 <a href="http/ngx_http_log_module#access_log">ACCESS_LOG</a> 지침은 syslog에 로그인을 지원합니다. 다음 매개 변수는 syslog에 대한 로깅을 구성합니다.
ru: <a href="ngx_core_module#error_log">Error_log</a> и <a href="http/ngx_http_log_module#access_log">access_log</a> директивы поддерживают протоколирование в системный журнал. Следующие параметры настраивают ведение журнала в системный журнал:
zh_cn: 在<a href="ngx_core_module#error_log">error_log中</a>和<a href="http/ngx_http_log_module#access_log">访问日志</a>指令支持记录到系统日志。以下参数将日志记录配置为syslog：

source: The <a href="ngx_http_autoindex_module">ngx_http_autoindex_module</a>, <a href="ngx_http_random_index_module">ngx_http_random_index_module</a>, and <a href="ngx_http_dav_module">ngx_http_dav_module</a> modules currently ignore this directive.
es: Los <a href="ngx_http_autoindex_module">m&oacute;dulos ngx_http_autoindex_module</a> , <a href="ngx_http_random_index_module">ngx_http_random_index_module</a> y <a href="ngx_http_dav_module">ngx_http_dav_module</a> actualmente ignoran esta directiva.
ja: <a href="ngx_http_autoindex_module">ngx_http_autoindex_module</a>、<a href="ngx_http_random_index_module">ngx_http_random_index_module</a>、および<a href="ngx_http_dav_module">ngx_http_dav_module</a>モジュールは、現在、このディレクティブを無視します。
ko: <a href="ngx_http_autoindex_module">ngx_http_autoindex_module</a> , <a href="ngx_http_random_index_module">ngx_http_random_index_module</a> 및 <a href="ngx_http_dav_module">ngx_http_dav_module</a> 모듈은 현재이 지침을 무시합니다.
ru: <a href="ngx_http_autoindex_module">Ngx_http_autoindex_module</a> , <a href="ngx_http_random_index_module">ngx_http_random_index_module</a> , и <a href="ngx_http_dav_module">ngx_http_dav_module</a> модули в настоящее время игнорируют эту директиву.
zh_cn: 该<a href="ngx_http_autoindex_module">ngx_http_autoindex_module</a>，<a href="ngx_http_random_index_module">ngx_http_random_index_module</a>和<a href="ngx_http_dav_module">ngx_http_dav_module</a>模块目前忽略此指令。

source: The <a href="ngx_http_upstream_module#max_conns">max_conns</a> limit for the server.
es: El l&iacute;mite de <a href="ngx_http_upstream_module#max_conns">max_conns</a> para el servidor.
ja: サーバーの<a href="ngx_http_upstream_module#max_conns">max_conns</a>制限。
ko: 서버 의 <a href="ngx_http_upstream_module#max_conns">max_conns</a> 제한입니다.
ru: В <a href="ngx_http_upstream_module#max_conns">max_conns</a> ограничения для сервера.
zh_cn: 服务器的<a href="ngx_http_upstream_module#max_conns">max_conns</a>限制。
