Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/nginx/nginx.*.004.xlf
Languages: es, ja, ko, ru, zh_cn

source: Same as the <a href="ngx_http_upstream_module#fail_timeout">fail_timeout</a> parameter of the HTTP upstream server.
ja: HTTPアップストリームサーバーの<a href="ngx_http_upstream_module#fail_timeout">fail_timeout</a>パラメータと同じです。
ru: То же, что и параметр <a href="ngx_http_upstream_module#fail_timeout">fail_timeout восходящего</a> HTTP-сервера.
zh_cn: 与HTTP上游服务器的<a href="ngx_http_upstream_module#fail_timeout">fail_timeout</a>参数相同。

source: Same as the <a href="ngx_http_upstream_module#max_conns">max_conns</a> parameter of the HTTP upstream server.
ja: HTTPアップストリームサーバーの<a href="ngx_http_upstream_module#max_conns">max_conns</a>パラメータと同じです。
ru: То же, что параметр <a href="ngx_http_upstream_module#max_conns">max_conns</a> восходящего HTTP-сервера.
zh_cn: 与HTTP上游服务器的<a href="ngx_http_upstream_module#max_conns">max_conns</a>参数相同。

source: Same as the <a href="ngx_http_upstream_module#max_fails">max_fails</a> parameter of the HTTP upstream server.
ja: HTTPアップストリームサーバーの<a href="ngx_http_upstream_module#max_fails">max_fails</a>パラメータと同じです。
ru: То же, что и параметр <a href="ngx_http_upstream_module#max_fails">max_fails восходящего</a> HTTP-сервера.
zh_cn: 与HTTP上游服务器的<a href="ngx_http_upstream_module#max_fails">max_fails</a>参数相同。

source: Same as the <a href="ngx_http_upstream_module#route">route</a> parameter of the HTTP upstream server.
ja: HTTPアップストリームサーバーの<a href="ngx_http_upstream_module#route">ルート</a>パラメータと同じです。
ru: То же, что параметр <a href="ngx_http_upstream_module#route">маршрута</a> восходящего HTTP-сервера.
zh_cn: 与HTTP上游服务器的<a href="ngx_http_upstream_module#route">route</a>参数相同。

source: Same as the <a href="ngx_http_upstream_module#service">service</a> parameter of the HTTP upstream server. This parameter cannot be changed.
ja: HTTPアップストリームサーバーの<a href="ngx_http_upstream_module#service">サービス</a>パラメータと同じです。このパラメーターは変更できません。
ru: То же, что и <a href="ngx_http_upstream_module#service">служебный</a> параметр восходящего HTTP-сервера. Этот параметр нельзя изменить.
zh_cn: 与HTTP上游服务器的<a href="ngx_http_upstream_module#service">服务</a>参数相同。此参数无法更改。

source: Same as the <a href="ngx_http_upstream_module#slow_start">slow_start</a> parameter of the HTTP upstream server.
ja: HTTPアップストリームサーバーの<a href="ngx_http_upstream_module#slow_start">slow_start</a>パラメータと同じです。
ru: То же, что и параметр <a href="ngx_http_upstream_module#slow_start">slow_start восходящего</a> HTTP-сервера.
zh_cn: 与HTTP上游服务器的<a href="ngx_http_upstream_module#slow_start">slow_start</a>参数相同。

source: Same as the <a href="ngx_http_upstream_module#weight">weight</a> parameter of the HTTP upstream server.
ja: HTTPアップストリームサーバーの<a href="ngx_http_upstream_module#weight">重み</a>パラメータと同じです。
ru: То же, что и параметр <a href="ngx_http_upstream_module#weight">веса</a> восходящего HTTP-сервера.
zh_cn: 与HTTP上游服务器的<a href="ngx_http_upstream_module#weight">weight</a>参数相同。

source: Scripting with njs
ja: njs を使ったスクリプト
ru: Скриптинг с помощью njs
zh_cn: 用njs编写脚本

source: Searches for a string using a <code>regexp</code>
ja: <code>regexp</code> を使用して文字列を検索します
ru: Ищет строку с помощью <code>regexp</code>
zh_cn: 使用正则 <code>regexp</code> 搜索字符串

source: Searching wildcard names hash table is slower than searching exact names hash table because names are searched by domain parts. Note that the special wildcard form &ldquo;<code>.example.org</code>&rdquo; is stored in a wildcard names hash table and not in an exact names hash table.
ja: ワイルドカード名ハッシュテーブルの検索は、名前がドメイン部分で検索されるため、完全名ハッシュテーブルの検索よりも遅くなります。特別なワイルドカード形式「 <code>.example.org</code> 」はワイルドカード名ハッシュテーブルに格納され、正確な名前ハッシュテーブルには格納されないことに注意してください。
ru: Поиск в хэш-таблице имен с подстановочными знаками выполняется медленнее, чем поиск в хеш-таблице точных имен, поскольку поиск имен выполняется по частям домена. Обратите внимание, что специальная форма с подстановочными знаками &laquo; <code>.example.org</code> &raquo; хранится в хэш-таблице имен с подстановочными знаками, а не в хеш-таблице точных имен.
zh_cn: 搜索通配符名称哈希表比搜索精确名称哈希表要慢，因为名称是按域部分搜索的。请注意，特殊的通配符格式&ldquo; <code>.example.org</code> &rdquo;存储在通配符名称哈希表中，而不存储在确切的名称哈希表中。

source: Secured uwsgi protocol is supported since version 1.5.8.
ja: 安全な uwsgi プロトコルはバージョン 1.5.8 からサポートされています。
ru: Защищенный протокол uwsgi поддерживается с версии 1.5.8.
zh_cn: 从1.5.8版本开始支持安全的Uwsgi协议。

source: See <a href="examples">examples</a> and <a href="https://www.nginx.com/blog/tag/nginx-javascript-module/">blog posts</a> for more njs use cases.
ja: その他のnjsの使用<a href="examples">例</a>については、例と<a href="https://www.nginx.com/blog/tag/nginx-javascript-module/">ブログ投稿</a>をご覧ください。
ru: Смотрите <a href="examples">примеры</a> и <a href="https://www.nginx.com/blog/tag/nginx-javascript-module/">сообщения в блогах,</a> чтобы узнать больше о случаях использования njs.
zh_cn: 有关更多njs用例，请参见<a href="examples">示例</a>和<a href="https://www.nginx.com/blog/tag/nginx-javascript-module/">博客文章</a>。

source: See also
ja: 参照:
ru: См.также
zh_cn: 另见

source: See also <a href="#server_name_in_redirect">server_name_in_redirect</a> and <a href="#port_in_redirect">port_in_redirect</a> directives.
ja: <a href="#server_name_in_redirect">server_name_in_redirect</a>および<a href="#port_in_redirect">port_in_redirect</a>ディレクティブも参照してください。
ru: Смотрите также <a href="#server_name_in_redirect">server_name_in_redirect</a> и <a href="#port_in_redirect">port_in_redirect</a> директивы.
zh_cn: 另请参阅<a href="#server_name_in_redirect">server_name_in_redirect</a>和<a href="#port_in_redirect">port_in_redirect</a>指令。

source: See also the <a href="#proxy_set_header">proxy_set_header</a> and <a href="#proxy_pass_request_body">proxy_pass_request_body</a> directives.
ja: <a href="#proxy_set_header">proxy_set_header</a>および<a href="#proxy_pass_request_body">proxy_pass_request_body</a>ディレクティブも参照してください。
ru: Смотрите также <a href="#proxy_set_header">proxy_set_header</a> и <a href="#proxy_pass_request_body">proxy_pass_request_body</a> директивы.
zh_cn: 另请参见<a href="#proxy_set_header">proxy_set_header</a>和<a href="#proxy_pass_request_body">proxy_pass_request_body</a>指令。

source: See also the <a href="#proxy_set_header">proxy_set_header</a> and <a href="#proxy_pass_request_headers">proxy_pass_request_headers</a> directives.
ja: <a href="#proxy_set_header">proxy_set_header</a>および<a href="#proxy_pass_request_headers">proxy_pass_request_headers</a>ディレクティブも参照してください。
ru: Смотрите также <a href="#proxy_set_header">proxy_set_header</a> и <a href="#proxy_pass_request_headers">proxy_pass_request_headers</a> директивы.
zh_cn: 另请参见<a href="#proxy_set_header">proxy_set_header</a>和<a href="#proxy_pass_request_headers">proxy_pass_request_headers</a>指令。

source: See also the <a href="#sendfile">sendfile</a> directive.
ja: <a href="#sendfile">sendfile</a>ディレクティブも参照してください。
ru: См. Также директиву <a href="#sendfile">sendfile</a> .
zh_cn: 另请参见<a href="#sendfile">sendfile</a>指令。

source: See also the <a href="ngx_http_core_module#error_page">error_page</a> directive.
ja: <a href="ngx_http_core_module#error_page">error_page</a>ディレクティブも参照してください。
ru: См. Также директиву <a href="ngx_http_core_module#error_page">error_page</a> .
zh_cn: 另请参见<a href="ngx_http_core_module#error_page">error_page</a>指令。

source: See also the <code>use_temp_path</code> parameter of the <a href="#fastcgi_cache_path">fastcgi_cache_path</a> directive.
ja: <a href="#fastcgi_cache_path">fastcgi_cache_path</a>ディレクティブの <code>use_temp_path</code> パラメータも参照してください。
ru: Смотрите также <code>use_temp_path</code> параметр <a href="#fastcgi_cache_path">fastcgi_cache_path</a> директивы.
zh_cn: 另请参见<a href="#fastcgi_cache_path">fastcgi_cache_path</a>指令的 <code>use_temp_path</code> 参数。

source: See also the <code>use_temp_path</code> parameter of the <a href="#proxy_cache_path">proxy_cache_path</a> directive.
ja: <a href="#proxy_cache_path">proxy_cache_path</a>ディレクティブの <code>use_temp_path</code> パラメータも参照してください。
ru: Смотрите также <code>use_temp_path</code> параметр <a href="#proxy_cache_path">proxy_cache_path</a> директивы.
zh_cn: 另请参见<a href="#proxy_cache_path">proxy_cache_path</a>指令的 <code>use_temp_path</code> 参数。

source: See also the <code>use_temp_path</code> parameter of the <a href="#scgi_cache_path">scgi_cache_path</a> directive.
ja: <a href="#scgi_cache_path">scgi_cache_path</a>ディレクティブの <code>use_temp_path</code> パラメータも参照してください。
ru: Смотрите также <code>use_temp_path</code> параметр <a href="#scgi_cache_path">scgi_cache_path</a> директивы.
zh_cn: 另请参见<a href="#scgi_cache_path">scgi_cache_path</a>指令的 <code>use_temp_path</code> 参数。

source: See also the <code>use_temp_path</code> parameter of the <a href="#uwsgi_cache_path">uwsgi_cache_path</a> directive.
ja: <a href="#uwsgi_cache_path">uwsgi_cache_path</a>ディレクティブの <code>use_temp_path</code> パラメータも参照してください。
ru: Смотрите также <code>use_temp_path</code> параметр <a href="#uwsgi_cache_path">uwsgi_cache_path</a> директивы.
zh_cn: 另请参见<a href="#uwsgi_cache_path">uwsgi_cache_path</a>指令的 <code>use_temp_path</code> 参数。

source: Selecting an upstream based on SSL protocol version:
ja: SSLプロトコルのバージョンに基づいてアップストリームを選択します。
ru: Выбор восходящего потока на основе версии протокола SSL:
zh_cn: 根据SSL协议版本选择上游。

source: Selecting an upstream based on protocol:
ja: プロトコルに基づいてアップストリームを選択します。
ru: Выбор восходящего потока на основе протокола:
zh_cn: 根据协议选择上游。

source: Selecting an upstream based on server name:
ja: サーバー名に基づいてアップストリームを選択します。
ru: Выбор восходящего потока на основе имени сервера:
zh_cn: 根据服务器名称选择上游。

source: Selects a <a href="../stream/ngx_stream_upstream_module">stream</a> upstream server group. Without this parameter, selects an <a href="ngx_http_upstream_module">http</a> upstream server group.
ja: <a href="../stream/ngx_stream_upstream_module">ストリーム</a>アップストリームサーバーグループを選択します。このパラメーターがない場合、<a href="ngx_http_upstream_module">http</a>アップストリームサーバーグループを選択します。
ru: Выбирает группу восходящих <a href="../stream/ngx_stream_upstream_module">потоковых</a> серверов. Без этого параметра выбирает группу вышестоящих серверов <a href="ngx_http_upstream_module">http</a> .
zh_cn: 选择<a href="../stream/ngx_stream_upstream_module">流</a>上游服务器组。如果没有此参数，则选择一个<a href="ngx_http_upstream_module">http</a>上游服务器组。

source: Selects a group to work with. This parameter is mandatory.
ja: 一緒に作業するグループを選択します。このパラメータは必須です。
ru: Выбирает группу для работы.Этот параметр является обязательным.
zh_cn: 选择要工作的组。这个参数是必须的。

source: Selects a server for viewing, modifying, or removing.
ja: 閲覧、修正、削除するサーバーを選択します。
ru: Выбирает сервер для просмотра,изменения или удаления.
zh_cn: 选择要查看、修改或删除的服务器。

source: Send the HUP signal to the old master process. The old master process will start new worker processes without re-reading the configuration. After that, all new processes can be shut down gracefully, by sending the QUIT signal to the new master process.
ja: 古いマスタープロセスにHUP信号を送信します。古いマスタープロセスは、設定を再読み込みすることなく、新しいワーカープロセスを開始します。その後、新しいマスタープロセスにQUITシグナルを送ることで、すべての新しいプロセスを潔くシャットダウンすることができます。
ru: Отправьте сигнал HUP старому ведущему процессу.Старый процесс запускает новые рабочие процессы без повторного считывания конфигурации.После этого все новые процессы можно элегантно завершить,отправив сигнал QUIT новому ведущему процессу.
zh_cn: 向旧主进程发送HUP信号。旧主进程将启动新的工作进程,而无需重新读取配置。之后,通过向新的主进程发送QUIT信号,所有新进程都可以从容关闭。

source: Send the TERM signal to the new master process. It will then send a message to its worker processes requesting them to exit immediately, and they will all exit almost immediately. (If new processes do not exit for some reason, the KILL signal should be sent to them to force them to exit.) When the new master process exits, the old master process will start new worker processes automatically.
ja: 新しいマスタープロセスに TERM シグナルを送ります。その後、そのワーカープロセスに直ちに終了するように要求するメッセージを送信し、それらはすべてほぼ直ちに終了します。(新しいプロセスが何らかの理由で終了しない場合は、強制的に終了させるために KILL シグナルを送るべきです)。新しいマスタープロセスが終了すると、古いマスタープロセスは自動的に新しいワーカープロセスを開始します。
ru: Отправьте сигнал TERM на новый ведущий процесс.Затем он отправит сообщение своим рабочим процессам с просьбой немедленно выйти,и все они выйдут почти немедленно.(Если новые процессы по какой-то причине не выходят,им должен быть отправлен сигнал KILL,чтобы заставить их выйти).При выходе нового ведущего процесса старый ведущий процесс автоматически запускает новые рабочие процессы.
zh_cn: 向新的主进程发送TERM信号。它就会向它的工作进程发送消息,要求它们立即退出,它们几乎都会立即退出。如果新进程由于某种原因没有退出,则应向它们发送KILL信号,迫使它们退出)。当新的主进程退出后,旧的主进程会自动启动新的工作进程。

source: Serializes a Unicode string to a byte string using UTF8 encoding.
ja: Unicode 文字列を UTF8 エンコーディングを使用してバイト文字列にシリアライズします。
zh_cn: 使用UTF8编码将一个Unicode字符串序列化为一个字节字符串。

source: Serializes a Unicode string to a byte string. Returns <code>null</code> if a character larger than 255 is found in the string.
ja: Unicode文字列をバイト文字列にシリアル化します。文字列に255より大きい文字が見つかった場合は <code>null</code> を返します。
zh_cn: 将Unicode字符串序列化为字节字符串。如果在字符串中找到一个大于255的字符，则返回 <code>null</code> 。

source: Serializes an object and returns a URL query string.
ja: オブジェクトをシリアライズし、URL クエリ文字列を返します。
zh_cn: 序列化一个对象并返回一个URL查询字符串。

source: Server Name Indication
ja: サーバー名表示
ru: Указание имени сервера
zh_cn: 服务器名称指示

source: Server configuration &mdash; Applies to a single <code>server</code> block. Functions as server-specific settings for a module.
ja: サーバー構成&mdash;単一の <code>server</code> ブロックに適用されます。モジュールのサーバー固有の設定として機能します。
ru: Конфигурация сервера - применяется к одному блоку <code>server</code> . Функционирует как специфичные для сервера настройки для модуля.
zh_cn: 服务器配置-适用于单个 <code>server</code> 块。用作模块的服务器特定设置。

source: Server names
ja: サーバー名
ru: Имена серверов
zh_cn: 服务器名称

source: Server names are defined using the <a href="ngx_http_core_module#server_name">server_name</a> directive and determine which <a href="ngx_http_core_module#server">server</a> block is used for a given request. See also &ldquo;<a href="request_processing">How nginx processes a request</a>&rdquo;. They may be defined using exact names, wildcard names, or regular expressions:
ja: サーバー名は<a href="ngx_http_core_module#server_name">server_name</a>ディレクティブを使用して定義され、特定の要求に使用される<a href="ngx_http_core_module#server">サーバー</a>ブロックを決定します。「<a href="request_processing">nginxがリクエストを処理する方法</a>」も参照してください。これらは、正確な名前、ワイルドカード名、または正規表現を使用して定義できます。
ru: Имена серверов определяются с помощью директивы <a href="ngx_http_core_module#server_name">server_name</a> и определяют, какой блок <a href="ngx_http_core_module#server">сервера</a> используется для данного запроса. См. Также &laquo; <a href="request_processing">Как nginx обрабатывает запрос</a> &raquo;. Они могут быть определены с использованием точных имен, имен подстановочных знаков или регулярных выражений:
zh_cn: 服务器名称是使用<a href="ngx_http_core_module#server_name">server_name</a>指令定义的，并确定用于给定请求的<a href="ngx_http_core_module#server">服务器</a>块。另请参阅&ldquo; <a href="request_processing">nginx如何处理请求</a> &rdquo;。可以使用确切名称，通配符名称或正则表达式来定义它们：

source: Server names can include an asterisk (&ldquo;<code>*</code>&rdquo;) replacing the first or last part of a name:
ja: サーバー名には、名前の最初または最後の部分を置き換えるアスタリスク（「 <code>*</code> 」）を含めることができます。
ru: Имена серверов могут включать звездочку (&laquo; <code>*</code> &raquo;), заменяющую первую или последнюю часть имени:
zh_cn: 服务器名称可以包含星号（&ldquo; <code>*</code> &rdquo;）来代替名称的第一部分或最后一部分：

source: Server parameters, specified in the JSON format. The &ldquo;<code>ID</code>&rdquo;, &ldquo;<code>backup</code>&rdquo;, and &ldquo;<code>service</code>&rdquo; parameters cannot be changed.
ja: JSON形式で指定されたサーバーパラメータ。「 <code>ID</code> 」、「 <code>backup</code> 」、および「 <code>service</code> 」パラメーターは変更できません。
ru: Параметры сервера, указанные в формате JSON. Параметры &laquo; <code>ID</code> &raquo;, &laquo; <code>backup</code> &raquo; и &laquo; <code>service</code> &raquo; изменить нельзя.
zh_cn: 服务器参数，以JSON格式指定。不能更改&ldquo; <code>ID</code> &rdquo;，&ldquo; <code>backup</code> &rdquo;和&ldquo; <code>service</code> &rdquo;参数。

source: Serving Static Content
ja: 静的なコンテンツの提供
ru: Обслуживание статического содержания
zh_cn: 服务静态内容

source: Session Object Properties
ja: セッションオブジェクトのプロパティ
ru: Свойства объекта сеанса
zh_cn: 会话对象属性

source: Session persistence
ja: セッションの持続性
ru: Продолжительность сессии
zh_cn: 会话持久性

source: Sessions are stored in a shared memory zone, whose <code><i>name</i></code> and <code><i>size</i></code> are configured by the <code>zone</code> parameter. One megabyte zone can store about 4000 sessions on the 64-bit platform. The sessions that are not accessed during the time specified by the <code>timeout</code> parameter get removed from the zone. By default, <code>timeout</code> is set to 10 minutes.
ja: セッションは共有メモリゾーンに保存され、その <code><i>name</i></code> と <code><i>size</i></code> は <code>zone</code> パラメータによって設定されます。1メガバイトのゾーンは、64ビットプラットフォームで約4000セッションを格納できます。 <code>timeout</code> パラメータで指定された時間中にアクセスされなかったセッションは、ゾーンから削除されます。デフォルトでは、 <code>timeout</code> は10分に設定されています。
ru: Сессии сохраняются в зоне общей памяти, <code><i>name</i></code> и <code><i>size</i></code> которой настраиваются параметром <code>zone</code> . Одна мегабайтная зона может хранить около 4000 сессий на 64-битной платформе. Сеансы, к которым нет доступа в течение времени, указанного параметром <code>timeout</code> удаляются из зоны. По умолчанию время <code>timeout</code> составляет 10 минут.
zh_cn: 会话存储在共享内存区域中，其 <code><i>name</i></code> 和 <code><i>size</i></code> 由 <code>zone</code> 参数配置。一个1 MB的区域可以在64位平台上存储大约4000个会话。在 <code>timeout</code> 参数指定的时间内未访问的会话将从区域中删除。默认情况下， <code>timeout</code> 设置为10分钟。

source: Sets <code><i>size</i></code> of a per-connection receive buffer used to parse incoming stream of synchronization messages. The buffer size must be equal or greater than one of the <a href="#zone_sync_buffers">zone_sync_buffers</a>. By default, the buffer size is equal to <a href="#zone_sync_buffers">zone_sync_buffers</a><code><i>size</i></code> multiplied by <code><i>number</i></code>.
ja: 同期メッセージの着信ストリームを解析するために使用される接続ごとの受信バッファーの <code><i>size</i></code> を設定します。バッファサイズは、いずれかの<a href="#zone_sync_buffers">zone_sync_buffers</a>以上である必要があります。デフォルトでは、バッファーサイズは、<a href="#zone_sync_buffers">zone_sync_buffers </a> <code><i>size</i></code> に <code><i>number</i></code> を掛けた値に等しく<i>なり</i>ます。
ru: Устанавливает <code><i>size</i></code> буфера приема для каждого соединения, используемого для анализа входящего потока сообщений синхронизации. Размер буфера должен быть равен или больше одного из <a href="#zone_sync_buffers">zone_sync_buffers</a> . По умолчанию размер буфера равен <code><i>size</i></code> <a href="#zone_sync_buffers"> zone_sync_buffers,</a> умноженному на <code><i>number</i></code> .<i></i><i></i>
zh_cn: 设置每个连接的接收缓冲区的 <code><i>size</i></code> ，该缓冲区用于解析同步消息的传入流。缓冲区大小必须等于或大于<a href="#zone_sync_buffers">zone_sync_buffers之一</a>。缺省情况下，缓冲器大小等于<a href="#zone_sync_buffers">zone_sync_buffers </a> <code><i>size</i></code> 乘以 <code><i>number</i></code> 。

source: Sets <code>name</code> and <code>size</code> of the cache that stores client certificates status for OCSP validation. The cache is shared between all worker processes. A cache with the same name can be used in several virtual servers.
ja: OCSP検証用のクライアント証明書ステータスを格納するキャッシュの <code>name</code> と <code>size</code> を設定します。キャッシュはすべてのワーカープロセス間で共有されます。同じ名前のキャッシュを複数の仮想サーバーで使用できます。
zh_cn: 设置用于存储客户端证书状态以进行OCSP验证的缓存的 <code>name</code> 和 <code>size</code> 。缓存在所有工作进程之间共享。具有相同名称的缓存可以在多个虚拟服务器中使用。

source: Sets a <code><i>file</i></code> with the secret key used to encrypt and decrypt TLS session tickets. The directive is necessary if the same key has to be shared between multiple servers. By default, a randomly generated key is used.
ja: TLSセッションチケットの暗号化と復号化に使用される秘密鍵を <code><i>file</i></code> 設定し<i>ます</i>。同じキーを複数のサーバー間で共有する必要がある場合は、ディレクティブが必要です。デフォルトでは、ランダムに生成されたキーが使用されます。
ru: Устанавливает <code><i>file</i></code> с секретным ключом, который используется для шифрования и дешифрования билетов сеанса TLS. Директива необходима, если один и тот же ключ должен использоваться несколькими серверами. По умолчанию используется случайно сгенерированный ключ.
zh_cn: 设置带有用于加密和解密TLS会话票证的密钥的 <code><i>file</i></code> 。如果必须在多个服务器之间共享同一密钥，则该指令是必需的。默认情况下，使用随机生成的密钥。

source: Sets a <code><i>parameter</i></code> that should be passed to the FastCGI server. The <code><i>value</i></code> can contain text, variables, and their combination. These directives are inherited from the previous configuration level if and only if there are no <code>fastcgi_param</code> directives defined on the current level.
ja: FastCGIサーバーに渡す必要のある <code><i>parameter</i></code> を設定します。 <code><i>value</i></code> 、テキスト、変数、およびその組み合わせを含むことができます。これらのディレクティブは、現在のレベルで <code>fastcgi_param</code> ディレクティブが定義されていない場合にのみ、前の構成レベルから継承されます。
zh_cn: 设置一个 <code><i>parameter</i></code> 应传递到FastCGI服务器。该 <code><i>value</i></code> 可以包含文本，变量及其组合。当且仅当当前级别上没有定义 <code>fastcgi_param</code> 指令时，这些指令才从先前的配置级别继承。

source: Sets a <code><i>parameter</i></code> that should be passed to the FastCGI server. The <code><i>value</i></code> can contain text, variables, and their combination. These directives are inherited from the previous level if and only if there are no <code>fastcgi_param</code> directives defined on the current level.
ja: FastCGIサーバーに渡す必要がある <code><i>parameter</i></code> を設定します。 <code><i>value</i></code> 、テキスト、変数、およびその組み合わせを含むことができます。現在のレベルで <code>fastcgi_param</code> ディレクティブが定義されていない場合にのみ、これらのディレクティブは前のレベルから継承されます。
ru: Устанавливает <code><i>parameter</i></code> который должен быть передан серверу FastCGI. <code><i>value</i></code> может содержать текст, переменные и их комбинации. Эти директивы наследуются от предыдущего уровня тогда и только тогда, <code>fastcgi_param</code> на текущем уровне не определены директивы fastcgi_param .
zh_cn: 设置一个 <code><i>parameter</i></code> 应传递到FastCGI服务器。该 <code><i>value</i></code> 可以包含文本，变量及其组合。当且仅当当前级别上没有定义 <code>fastcgi_param</code> 指令时，这些指令才从上一级继承。

source: Sets a <code><i>parameter</i></code> that should be passed to the SCGI server. The <code><i>value</i></code> can contain text, variables, and their combination. These directives are inherited from the previous configuration level if and only if there are no <code>scgi_param</code> directives defined on the current level.
ja: SCGIサーバーに渡す必要のある <code><i>parameter</i></code> を設定します。 <code><i>value</i></code> 、テキスト、変数、およびその組み合わせを含むことができます。これらのディレクティブは、現在のレベルで <code>scgi_param</code> ディレクティブが定義されていない場合にのみ、前の構成レベルから継承されます。
zh_cn: 设置一个 <code><i>parameter</i></code> 应传递到SCGI服务器。该 <code><i>value</i></code> 可以包含文本，变量及其组合。当且仅当当前级别上未定义 <code>scgi_param</code> 指令时，这些指令才从先前的配置级别继承。

source: Sets a <code><i>parameter</i></code> that should be passed to the SCGI server. The <code><i>value</i></code> can contain text, variables, and their combination. These directives are inherited from the previous level if and only if there are no <code>scgi_param</code> directives defined on the current level.
ja: SCGIサーバーに渡す必要がある <code><i>parameter</i></code> を設定します。 <code><i>value</i></code> 、テキスト、変数、およびその組み合わせを含むことができます。これらのディレクティブは、現在のレベルで <code>scgi_param</code> ディレクティブが定義されていない場合にのみ、前のレベルから継承されます。
ru: Устанавливает <code><i>parameter</i></code> который должен быть передан на сервер SCGI. <code><i>value</i></code> может содержать текст, переменные и их комбинации. Эти директивы наследуются от предыдущего уровня тогда и только тогда, <code>scgi_param</code> на текущем уровне не определены директивы scgi_param .
zh_cn: 设置一个 <code><i>parameter</i></code> 应传递到SCGI服务器。该 <code><i>value</i></code> 可以包含文本，变量及其组合。当且仅当当前级别上未定义 <code>scgi_param</code> 指令时，这些指令才从上一级继承。
