Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/qt/qt.*.123.xlf
Languages: es, ko, zh_cn

source: Enums, namespaces, and macros have a <a href="qdoc-guide-writing#writing-topic-commands">topic command</a> for their documentation:
es: Las enumeraciones, los espacios de nombres y las macros tienen un <a href="qdoc-guide-writing#writing-topic-commands">comando de tema</a> para su documentaci&oacute;n:
ko: 열거 형, 네임 스페이스 및 매크로에는 설명서에 대한 <a href="qdoc-guide-writing#writing-topic-commands">주제 명령</a> 이 있습니다.

source: Environment Variable
es: Variable del entorno
ko: 환경 변수

source: Environment Variables
es: Variables del entorno
ko: 환경 변수

source: Environment Variables Recognized by Qt
es: Variables del entorno reconocidas por Qt
ko: Qt에 의해 인식되는 환경 변수

source: Environment Variables and Command-line Arguments
es: Variables del entorno y argumentos de la línea de mando
ko: 환경 변수 및 명령 줄 인수

source: Environment for evaluating JavaScript code
es: Entorno para evaluar el código JavaScript
ko: JavaScript 코드 평가 환경

source: Environment for the QAspectEngine and a method for instantiating QML components
es: Ambiente para el QAspectEngine y un método para instanciar los componentes QML
ko: QAspectEngine 환경 및 QML 컴포넌트 인스턴스화 방법

source: Environment variable
es: Variable del entorno
ko: 환경 변수

source: Environment variables:
es: Variables del entorno:
ko: 환경 변수:

source: EnvironmentLight (QML type)
es: EnvironmentLight (tipo QML)
ko: EnvironmentLight (QML 유형)

source: EnvironmentLight QML Type
es: EnvironmentLight Tipo QML
ko: EnvironmentLight QML 유형

source: EnvironmentLight uses cubemaps to implement image-based lighting (IBL), a technique often used in conjunction with physically-based rendering (PBR). The cubemaps are typically expected be based on high dynamic range (HDR) images, with a suitable OpenGL format (such as RGBA16F) that can handle the increased range of values.
ko: EnvironmentLight는 큐브 맵을 사용하여 PBR (물리 기반 렌더링)과 함께 자주 사용되는 기술인 이미지 기반 조명 (IBL)을 구현합니다. 큐브 맵은 일반적으로 증가 된 값 범위를 처리 할 수있는 적절한 OpenGL 형식 (예 : RGBA16F)을 사용하는 HDR (High Dynamic Range) 이미지를 기반으로합니다.

source: Environmental sensor UUID (service). The service exposes data from an environmental sensor for sports and fitness applications.
es: Sensor ambiental UUID (servicio).El servicio expone los datos de un sensor ambiental para aplicaciones deportivas y de fitness.
ko: 환경 센서 UUID (서비스). 이 서비스는 스포츠 및 피트니스 애플리케이션을위한 환경 센서의 데이터를 노출합니다.

source: Equality operator. Returns <code>true</code> if
es: Operador de igualdad. Devuelve <code>true</code> si
ko: 평등 연산자. 다음과 같은 경우 <code>true</code> 를 반환 합니다

source: Equality operator. Returns <code>true</code> if the guarded pointers
es: Operador de igualdad. Devuelve <code>true</code> si los punteros guardados
ko: 평등 연산자. 보호 된 포인터 <code>true</code> 반환 합니다.

source: Equals BigEndian or LittleEndian, depending on the platform's byte order.
es: Es igual a BigEndian o LittleEndian,dependiendo del orden de bytes de la plataforma.
ko: 플랫폼의 바이트 순서에 따라 BigEndian 또는 LittleEndian과 같습니다.

source: Equals maximum number of arguments available for execution of the method via <a href="qmetamethod#invoke">QMetaMethod::invoke</a>()
es: Es igual al n&uacute;mero m&aacute;ximo de argumentos disponibles para la ejecuci&oacute;n del m&eacute;todo a trav&eacute;s de <a href="qmetamethod#invoke">QMetaMethod :: invoke</a> ()
ko: <a href="qmetamethod#invoke">QMetaMethod :: invoke</a> () 를 통해 메소드 실행에 사용할 수있는 최대 인수 수와 같습니다.

source: Equivalent MIME type
es: Tipo equivalente de MIME
ko: 동등한 MIME 유형

source: Equivalent method to <a href="qstring#asprintf">asprintf</a>(), but takes a va_list
es: M&eacute;todo equivalente a <a href="qstring#asprintf">asprintf</a> (), pero toma un va_list
ko: <a href="qstring#asprintf">asprintf</a> () 와 동등한 방법 이지만 va_list를 사용합니다.

source: Equivalent of calling <a href="qmainwindow#addToolBar">addToolBar</a>(<a href="qt#ToolBarArea-enum">Qt::TopToolBarArea</a>,
es: Equivalente a llamar a <a href="qmainwindow#addToolBar">addToolBar</a> ( <a href="qt#ToolBarArea-enum">Qt :: TopToolBarArea</a> ,
ko: <a href="qmainwindow#addToolBar">addToolBar</a> 호출 ( <a href="qt#ToolBarArea-enum">Qt :: TopToolBarArea</a> ,

source: Equivalent of calling addToolBar(<a href="qt#ToolBarArea-enum">Qt::TopToolBarArea</a>,
ko: addToolBar ( <a href="qt#ToolBarArea-enum">Qt :: TopToolBarArea</a> ,

source: Equivalent to
es: Equivalente a
ko: 에 해당

source: Equivalent to <a href="qdir#entryList">entryList</a>().count().
es: Equivalente a <a href="qdir#entryList">entryList</a> () .count ().
ko: <a href="qdir#entryList">entryList</a> () .count () 와 같습니다 .

source: Equivalent to <a href="qlocalsocket#connectToServer">connectToServer</a>(<a href="qiodevice#OpenModeFlag-enum">OpenMode</a> mode). The socket is opened in the given
es: Equivalente a <a href="qlocalsocket#connectToServer">connectToServer</a> ( modo <a href="qiodevice#OpenModeFlag-enum">OpenMode</a> ). El enchufe se abre en el dado
ko: <a href="qlocalsocket#connectToServer">connectToServer</a> 와 동일합니다 ( <a href="qiodevice#OpenModeFlag-enum">OpenMode</a> 모드). 주어진 소켓이 열린다

source: Equivalent to <a href="qradialgradient#centerRadius">centerRadius</a>()
es: Equivalente a <a href="qradialgradient#centerRadius">centerRadius</a> ()
ko: 동등 <a href="qradialgradient#centerRadius">centerRadius</a> ) (

source: Equivalent to <a href="qradialgradient#setCenterRadius">setCenterRadius</a>()
es: Equivalente a <a href="qradialgradient#setCenterRadius">setCenterRadius</a> ()
ko: <a href="qradialgradient#setCenterRadius">setCenterRadius</a> () 와 동일

source: Equivalent to <a href="qrect#setLeft">setLeft</a>().
es: Equivalente a <a href="qrect#setLeft">setLeft</a> ().
ko: <a href="qrect#setLeft">setLeft</a> () 와 같습니다 .

source: Equivalent to <a href="qrect#setTop">setTop</a>().
es: Equivalente a <a href="qrect#setTop">setTop</a> ().
ko: <a href="qrect#setTop">setTop</a> () 와 같습니다 .

source: Equivalent to <a href="qrect#setX">setX</a>().
es: Equivalente a <a href="qrect#setX">setX</a> ().
ko: <a href="qrect#setX">setX</a> () 와 같습니다 .

source: Equivalent to <a href="qrect#setY">setY</a>().
es: Equivalente a <a href="qrect#setY">setY</a> ().
ko: <a href="qrect#setY">setY</a> () 와 같습니다 .

source: Equivalent to <a href="qrectf#setLeft">setLeft</a>().
es: Equivalente a <a href="qrectf#setLeft">setLeft</a> ().
ko: <a href="qrectf#setLeft">setLeft</a> () 와 같습니다 .

source: Equivalent to <a href="qrectf#setTop">setTop</a>().
es: Equivalente a <a href="qrectf#setTop">setTop</a> ().
ko: <a href="qrectf#setTop">setTop</a> () 와 같습니다 .

source: Equivalent to <a href="qrectf#setX">setX</a>().
es: Equivalente a <a href="qrectf#setX">setX</a> ().
ko: <a href="qrectf#setX">setX</a> () 와 같습니다 .

source: Equivalent to <a href="qrectf#setY">setY</a>().
es: Equivalente a <a href="qrectf#setY">setY</a> ().
ko: <a href="qrectf#setY">setY</a> () 와 같습니다 .

source: Equivalent to <a href="qtextstream#setFieldWidth">QTextStream::setFieldWidth</a>(
es: Equivalente a <a href="qtextstream#setFieldWidth">QTextStream :: setFieldWidth</a> (
ko: <a href="qtextstream#setFieldWidth">QTextStream :: setFieldWidth</a> 와 같습니다 (

source: Equivalent to <a href="qtextstream#setPadChar">QTextStream::setPadChar</a>(
es: Equivalente a <a href="qtextstream#setPadChar">QTextStream :: setPadChar</a> (
ko: 상당 <a href="qtextstream#setPadChar">QTextStream :: setPadChar</a> (

source: Equivalent to <a href="qtextstream#setRealNumberPrecision">QTextStream::setRealNumberPrecision</a>(
es: Equivalente a <a href="qtextstream#setRealNumberPrecision">QTextStream :: setRealNumberPrecision</a> (
ko: 상당 <a href="qtextstream#setRealNumberPrecision">QTextStream :: setRealNumberPrecision</a> (

source: Equivalent to <a href="qwebenginepage#title-prop">QWebEnginePage::title</a>().
es: Equivalente a <a href="qwebenginepage#title-prop">QWebEnginePage :: title</a> ().
ko: 상당 <a href="qwebenginepage#title-prop">QWebEnginePage : 제목</a> ().

source: Equivalent to <code>QPoint(0,0) - point</code>.
es: Equivalente a <code>QPoint(0,0) - point</code> .
ko: <code>QPoint(0,0) - point</code> 와 같습니다 .

source: Equivalent to <code>QPointF(0,0) - point</code>.
es: Equivalente a <code>QPointF(0,0) - point</code> .
ko: <code>QPointF(0,0) - point</code> 와 같습니다 .

source: Equivalent to <code>QQuaternion(0,0,0,0) - quaternion</code>.
es: Equivalente a <code>QQuaternion(0,0,0,0) - quaternion</code> .
ko: <code>QQuaternion(0,0,0,0) - quaternion</code> 같습니다 .

source: Equivalent to <code>QVector2D(0,0) - vector</code>.
es: Equivalente a <code>QVector2D(0,0) - vector</code> .
ko: <code>QVector2D(0,0) - vector</code> 와 같습니다 .

source: Equivalent to <code>QVector3D(0,0,0) - vector</code>.
es: Equivalente a <code>QVector3D(0,0,0) - vector</code> .
ko: <code>QVector3D(0,0,0) - vector</code> 와 같습니다 .

source: Equivalent to <code>QVector4D(0,0,0,0) - vector</code>.
es: Equivalente a <code>QVector4D(0,0,0,0) - vector</code> .
ko: <code>QVector4D(0,0,0,0) - vector</code> 와 같습니다 .

source: Equivalent to <code>Q_DECLARE_METATYPE(TYPE *)</code> and <code>Q_DECLARE_METATYPE(QQmlListProperty&lt;TYPE&gt;)</code>
es: Equivalente a <code>Q_DECLARE_METATYPE(TYPE *)</code> y <code>Q_DECLARE_METATYPE(QQmlListProperty&lt;TYPE&gt;)</code>
ko: 상당 <code>Q_DECLARE_METATYPE(TYPE *)</code> 및 <code>Q_DECLARE_METATYPE(QQmlListProperty&lt;TYPE&gt;)</code>

source: Equivalent to <code>X_Pos|X_Neg</code>. Returned by devices that cannot detect the direction of a tap.
es: Equivalente a <code>X_Pos|X_Neg</code> . Devuelto por dispositivos que no pueden detectar la direcci&oacute;n de un toque.
ko: <code>X_Pos|X_Neg</code> 와 같습니다 . 탭 방향을 감지 할 수없는 장치에서 반환합니다.

source: Equivalent to <code>Y_Pos|Y_Neg</code>. Returned by devices that cannot detect the direction of a tap.
es: Equivalente a <code>Y_Pos|Y_Neg</code> . Devuelto por dispositivos que no pueden detectar la direcci&oacute;n de un toque.
ko: <code>Y_Pos|Y_Neg</code> 와 같습니다 . 탭 방향을 감지 할 수없는 장치에서 반환합니다.

source: Equivalent to <code>Z_Pos|Z_Neg</code>. Returned by devices that cannot detect the direction of a tap.
es: Equivalente a <code>Z_Pos|Z_Neg</code> . Devuelto por dispositivos que no pueden detectar la direcci&oacute;n de un toque.
ko: <code>Z_Pos|Z_Neg</code> 와 같습니다 . 탭 방향을 감지 할 수없는 장치에서 반환합니다.

source: Equivalent to <code>at(position)</code>.
es: Equivalente a <code>at(position)</code> .
ko: 당량 <code>at(position)</code> .

source: Equivalent to <code>compare(*this, other, cs)</code>.
es: Equivalente a <code>compare(*this, other, cs)</code> .
ko: 동등 <code>compare(*this, other, cs)</code> .

source: Equivalent to <code>count() == 0</code> with filters <code>QDir::AllEntries | QDir::NoDotAndDotDot</code>, but faster as it just checks whether the directory contains at least one entry.
es: Equivalente a <code>count() == 0</code> con filtros <code>QDir::AllEntries | QDir::NoDotAndDotDot</code> , pero m&aacute;s r&aacute;pido ya que solo verifica si el directorio contiene al menos una entrada.
ko: 필터 <code>QDir::AllEntries | QDir::NoDotAndDotDot</code> 를 사용 하여 <code>count() == 0</code> 과 같습니다. | QDir :: NoDotAndDotDot 이지만 디렉토리에 하나 이상의 항목이 있는지 여부를 확인하기 때문에 더 빠릅니다.

source: Equivalent to <code>s1 != 0 &amp;&amp; compare(s1, s2) == 0</code>.
es: Equivalente a <code>s1 != 0 &amp;&amp; compare(s1, s2) == 0</code> .
ko: 동등 <code>s1 != 0 &amp;&amp; compare(s1, s2) == 0</code> .

source: Equivalent to GL_ALPHA (OpenGL ES 2 only)
es: Equivalente a GL_ALPHA (OpenGL ES 2 solamente)
ko: GL_ALPHA와 동일 (OpenGL ES 2 만 해당)

source: Equivalent to GL_ALWAYS.
es: Equivalente a GL_ALWAYS.
ko: GL_ALWAYS와 동일합니다.

source: Equivalent to GL_BGR
es: Equivalente a GL_BGR
ko: GL_BGR에 해당

source: Equivalent to GL_BGRA
es: Equivalente a GL_BGRA
ko: GL_BGRA와 동일

source: Equivalent to GL_BGRA_INTEGER
es: Equivalente a GL_BGRA_INTEGER
ko: GL_BGRA_INTEGER와 동일

source: Equivalent to GL_BGR_INTEGER
es: Equivalente a GL_BGR_INTEGER
ko: GL_BGR_INTEGER와 동일

source: Equivalent to GL_BYTE
es: Equivalente a GL_BYTE
ko: GL_BYTE와 동일

source: Equivalent to GL_COMPARE_REF_TO_TEXTURE.
es: Equivalente a GL_COMPARE_REF_TO_TEXTURE.
ko: GL_COMPARE_REF_TO_TEXTURE와 같습니다.

source: Equivalent to GL_COMPRESSED_R11_EAC
es: Equivalente a GL_COMPRESSED_R11_EAC
ko: GL_COMPRESSED_R11_EAC와 동일

source: Equivalent to GL_COMPRESSED_RED_RGTC1
es: Equivalente a GL_COMPRESSED_RED_RGTC1
ko: GL_COMPRESSED_RED_RGTC1에 해당

source: Equivalent to GL_COMPRESSED_RG11_EAC
es: Equivalente a GL_COMPRESSED_RG11_EAC
ko: GL_COMPRESSED_RG11_EAC와 동일

source: Equivalent to GL_COMPRESSED_RGB8_ETC2
es: Equivalente a GL_COMPRESSED_RGB8_ETC2
ko: GL_COMPRESSED_RGB8_ETC2와 동일

source: Equivalent to GL_COMPRESSED_RGB8_PUNCHTHROUGH_ALPHA1_ETC2
es: Equivalente a GL_COMPRESSED_RGB8_PUNCHTHROUGH_ALPHA1_ETC2
ko: GL_COMPRESSED_RGB8_PUNCHTHROUGH_ALPHA1_ETC2와 동일

source: Equivalent to GL_COMPRESSED_RGBA8_ETC2_EAC
es: Equivalente a GL_COMPRESSED_RGBA8_ETC2_EAC
ko: GL_COMPRESSED_RGBA8_ETC2_EAC와 동일

source: Equivalent to GL_COMPRESSED_RGBA_ASTC_10x10_KHR
es: Equivalente a GL_COMPRESSED_RGBA_ASTC_10x10_KHR
ko: GL_COMPRESSED_RGBA_ASTC_10x10_KHR와 동일

source: Equivalent to GL_COMPRESSED_RGBA_ASTC_10x5_KHR
es: Equivalente a GL_COMPRESSED_RGBA_ASTC_10x5_KHR
ko: GL_COMPRESSED_RGBA_ASTC_10x5_KHR와 동일

source: Equivalent to GL_COMPRESSED_RGBA_ASTC_10x6_KHR
es: Equivalente a GL_COMPRESSED_RGBA_ASTC_10x6_KHR
ko: GL_COMPRESSED_RGBA_ASTC_10x6_KHR와 동일

source: Equivalent to GL_COMPRESSED_RGBA_ASTC_10x8_KHR
es: Equivalente a GL_COMPRESSED_RGBA_ASTC_10x8_KHR
ko: GL_COMPRESSED_RGBA_ASTC_10x8_KHR와 동일

source: Equivalent to GL_COMPRESSED_RGBA_ASTC_12x10_KHR
es: Equivalente a GL_COMPRESSED_RGBA_ASTC_12x10_KHR
ko: GL_COMPRESSED_RGBA_ASTC_12x10_KHR와 동일

source: Equivalent to GL_COMPRESSED_RGBA_ASTC_12x12_KHR
es: Equivalente a GL_COMPRESSED_RGBA_ASTC_12x12_KHR
ko: GL_COMPRESSED_RGBA_ASTC_12x12_KHR와 동일

source: Equivalent to GL_COMPRESSED_RGBA_ASTC_4x4_KHR
es: Equivalente a GL_COMPRESSED_RGBA_ASTC_4x4_KHR
ko: GL_COMPRESSED_RGBA_ASTC_4x4_KHR와 동일

source: Equivalent to GL_COMPRESSED_RGBA_ASTC_5x4_KHR
es: Equivalente a GL_COMPRESSED_RGBA_ASTC_5x4_KHR
ko: GL_COMPRESSED_RGBA_ASTC_5x4_KHR와 동일

source: Equivalent to GL_COMPRESSED_RGBA_ASTC_5x5_KHR
es: Equivalente a GL_COMPRESSED_RGBA_ASTC_5x5_KHR
ko: GL_COMPRESSED_RGBA_ASTC_5x5_KHR와 동일

source: Equivalent to GL_COMPRESSED_RGBA_ASTC_6x5_KHR
es: Equivalente a GL_COMPRESSED_RGBA_ASTC_6x5_KHR
ko: GL_COMPRESSED_RGBA_ASTC_6x5_KHR와 동일

source: Equivalent to GL_COMPRESSED_RGBA_ASTC_6x6_KHR
es: Equivalente a GL_COMPRESSED_RGBA_ASTC_6x6_KHR
ko: GL_COMPRESSED_RGBA_ASTC_6x6_KHR와 동일

source: Equivalent to GL_COMPRESSED_RGBA_ASTC_8x5_KHR
es: Equivalente a GL_COMPRESSED_RGBA_ASTC_8x5_KHR
ko: GL_COMPRESSED_RGBA_ASTC_8x5_KHR와 동일

source: Equivalent to GL_COMPRESSED_RGBA_ASTC_8x6_KHR
es: Equivalente a GL_COMPRESSED_RGBA_ASTC_8x6_KHR
ko: GL_COMPRESSED_RGBA_ASTC_8x6_KHR와 동일

source: Equivalent to GL_COMPRESSED_RGBA_ASTC_8x8_KHR
es: Equivalente a GL_COMPRESSED_RGBA_ASTC_8x8_KHR
ko: GL_COMPRESSED_RGBA_ASTC_8x8_KHR와 동일

source: Equivalent to GL_COMPRESSED_RGBA_BPTC_UNORM_ARB
es: Equivalente a GL_COMPRESSED_RGBA_BPTC_UNORM_ARB
ko: GL_COMPRESSED_RGBA_BPTC_UNORM_ARB와 동일

source: Equivalent to GL_COMPRESSED_RGBA_S3TC_DXT1_EXT
es: Equivalente a GL_COMPRESSED_RGBA_S3TC_DXT1_EXT
ko: GL_COMPRESSED_RGBA_S3TC_DXT1_EXT와 동일

source: Equivalent to GL_COMPRESSED_RGBA_S3TC_DXT3_EXT
es: Equivalente a GL_COMPRESSED_RGBA_S3TC_DXT3_EXT
ko: GL_COMPRESSED_RGBA_S3TC_DXT3_EXT와 동일

source: Equivalent to GL_COMPRESSED_RGBA_S3TC_DXT5_EXT
es: Equivalente a GL_COMPRESSED_RGBA_S3TC_DXT5_EXT
ko: GL_COMPRESSED_RGBA_S3TC_DXT5_EXT와 동일

source: Equivalent to GL_COMPRESSED_RGB_BPTC_SIGNED_FLOAT_ARB
es: Equivalente a GL_COMPRESSED_RGB_BPTC_SIGNED_FLOAT_ARB
ko: GL_COMPRESSED_RGB_BPTC_SIGNED_FLOAT_ARB와 동일

source: Equivalent to GL_COMPRESSED_RGB_BPTC_UNSIGNED_FLOAT_ARB
es: Equivalente a GL_COMPRESSED_RGB_BPTC_UNSIGNED_FLOAT_ARB
ko: GL_COMPRESSED_RGB_BPTC_UNSIGNED_FLOAT_ARB와 동일

source: Equivalent to GL_COMPRESSED_RGB_S3TC_DXT1_EXT
es: Equivalente a GL_COMPRESSED_RGB_S3TC_DXT1_EXT
ko: GL_COMPRESSED_RGB_S3TC_DXT1_EXT와 동일

source: Equivalent to GL_COMPRESSED_RG_RGTC2
es: Equivalente a GL_COMPRESSED_RG_RGTC2
ko: GL_COMPRESSED_RG_RGTC2와 동일

source: Equivalent to GL_COMPRESSED_SIGNED_R11_EAC
es: Equivalente a GL_COMPRESSED_SIGNED_R11_EAC
ko: GL_COMPRESSED_SIGNED_R11_EAC와 동일

source: Equivalent to GL_COMPRESSED_SIGNED_RED_RGTC1
es: Equivalente a GL_COMPRESSED_SIGNED_RED_RGTC1
ko: GL_COMPRESSED_SIGNED_RED_RGTC1에 해당

source: Equivalent to GL_COMPRESSED_SIGNED_RG11_EAC
es: Equivalente a GL_COMPRESSED_SIGNED_RG11_EAC
ko: GL_COMPRESSED_SIGNED_RG11_EAC와 동일

source: Equivalent to GL_COMPRESSED_SIGNED_RG_RGTC2
es: Equivalente a GL_COMPRESSED_SIGNED_RG_RGTC2
ko: GL_COMPRESSED_SIGNED_RG_RGTC2와 동일

source: Equivalent to GL_COMPRESSED_SRGB8_ALPHA8_ASTC_10x10_KHR
es: Equivalente a GL_COMPRESSED_SRGB8_ALPHA8_ASTC_10x10_KHR
ko: GL_COMPRESSED_SRGB8_ALPHA8_ASTC_10x10_KHR와 동일

source: Equivalent to GL_COMPRESSED_SRGB8_ALPHA8_ASTC_10x5_KHR
es: Equivalente a GL_COMPRESSED_SRGB8_ALPHA8_ASTC_10x5_KHR
ko: GL_COMPRESSED_SRGB8_ALPHA8_ASTC_10x5_KHR와 동일

source: Equivalent to GL_COMPRESSED_SRGB8_ALPHA8_ASTC_10x6_KHR
es: Equivalente a GL_COMPRESSED_SRGB8_ALPHA8_ASTC_10x6_KHR
ko: GL_COMPRESSED_SRGB8_ALPHA8_ASTC_10x6_KHR와 동일

source: Equivalent to GL_COMPRESSED_SRGB8_ALPHA8_ASTC_10x8_KHR
es: Equivalente a GL_COMPRESSED_SRGB8_ALPHA8_ASTC_10x8_KHR
ko: GL_COMPRESSED_SRGB8_ALPHA8_ASTC_10x8_KHR와 동일

source: Equivalent to GL_COMPRESSED_SRGB8_ALPHA8_ASTC_12x10_KHR
es: Equivalente a GL_COMPRESSED_SRGB8_ALPHA8_ASTC_12x10_KHR
ko: GL_COMPRESSED_SRGB8_ALPHA8_ASTC_12x10_KHR와 동일

source: Equivalent to GL_COMPRESSED_SRGB8_ALPHA8_ASTC_12x12_KHR
es: Equivalente a GL_COMPRESSED_SRGB8_ALPHA8_ASTC_12x12_KHR
ko: GL_COMPRESSED_SRGB8_ALPHA8_ASTC_12x12_KHR에 해당

source: Equivalent to GL_COMPRESSED_SRGB8_ALPHA8_ASTC_4x4_KHR
es: Equivalente a GL_COMPRESSED_SRGB8_ALPHA8_ASTC_4x4_KHR
ko: GL_COMPRESSED_SRGB8_ALPHA8_ASTC_4x4_KHR와 동일

source: Equivalent to GL_COMPRESSED_SRGB8_ALPHA8_ASTC_5x4_KHR
es: Equivalente a GL_COMPRESSED_SRGB8_ALPHA8_ASTC_5x4_KHR
ko: GL_COMPRESSED_SRGB8_ALPHA8_ASTC_5x4_KHR와 동일

source: Equivalent to GL_COMPRESSED_SRGB8_ALPHA8_ASTC_5x5_KHR
es: Equivalente a GL_COMPRESSED_SRGB8_ALPHA8_ASTC_5x5_KHR
ko: GL_COMPRESSED_SRGB8_ALPHA8_ASTC_5x5_KHR와 동일

source: Equivalent to GL_COMPRESSED_SRGB8_ALPHA8_ASTC_6x5_KHR
es: Equivalente a GL_COMPRESSED_SRGB8_ALPHA8_ASTC_6x5_KHR
ko: GL_COMPRESSED_SRGB8_ALPHA8_ASTC_6x5_KHR와 동일

source: Equivalent to GL_COMPRESSED_SRGB8_ALPHA8_ASTC_6x6_KHR
es: Equivalente a GL_COMPRESSED_SRGB8_ALPHA8_ASTC_6x6_KHR
ko: GL_COMPRESSED_SRGB8_ALPHA8_ASTC_6x6_KHR와 동일

source: Equivalent to GL_COMPRESSED_SRGB8_ALPHA8_ASTC_8x5_KHR
es: Equivalente a GL_COMPRESSED_SRGB8_ALPHA8_ASTC_8x5_KHR
ko: GL_COMPRESSED_SRGB8_ALPHA8_ASTC_8x5_KHR와 동일

source: Equivalent to GL_COMPRESSED_SRGB8_ALPHA8_ASTC_8x6_KHR
es: Equivalente a GL_COMPRESSED_SRGB8_ALPHA8_ASTC_8x6_KHR
ko: GL_COMPRESSED_SRGB8_ALPHA8_ASTC_8x6_KHR와 동일

source: Equivalent to GL_COMPRESSED_SRGB8_ALPHA8_ASTC_8x8_KHR
es: Equivalente a GL_COMPRESSED_SRGB8_ALPHA8_ASTC_8x8_KHR
ko: GL_COMPRESSED_SRGB8_ALPHA8_ASTC_8x8_KHR와 동일

source: Equivalent to GL_COMPRESSED_SRGB8_ALPHA8_ETC2_EAC
es: Equivalente a GL_COMPRESSED_SRGB8_ALPHA8_ETC2_EAC
ko: GL_COMPRESSED_SRGB8_ALPHA8_ETC2_EAC와 동일

source: Equivalent to GL_COMPRESSED_SRGB8_ETC2
es: Equivalente a GL_COMPRESSED_SRGB8_ETC2
ko: GL_COMPRESSED_SRGB8_ETC2와 동일

source: Equivalent to GL_COMPRESSED_SRGB8_PUNCHTHROUGH_ALPHA1_ETC2
es: Equivalente a GL_COMPRESSED_SRGB8_PUNCHTHROUGH_ALPHA1_ETC2
ko: GL_COMPRESSED_SRGB8_PUNCHTHROUGH_ALPHA1_ETC2와 동일

source: Equivalent to GL_COMPRESSED_SRGB_ALPHA_BPTC_UNORM_ARB
es: Equivalente a GL_COMPRESSED_SRGB_ALPHA_BPTC_UNORM_ARB
ko: GL_COMPRESSED_SRGB_ALPHA_BPTC_UNORM_ARB와 동일

source: Equivalent to GL_COMPRESSED_SRGB_ALPHA_S3TC_DXT1_EXT
es: Equivalente a GL_COMPRESSED_SRGB_ALPHA_S3TC_DXT1_EXT
ko: GL_COMPRESSED_SRGB_ALPHA_S3TC_DXT1_EXT와 동일

source: Equivalent to GL_COMPRESSED_SRGB_ALPHA_S3TC_DXT3_EXT
es: Equivalente a GL_COMPRESSED_SRGB_ALPHA_S3TC_DXT3_EXT
ko: GL_COMPRESSED_SRGB_ALPHA_S3TC_DXT3_EXT와 동일

source: Equivalent to GL_COMPRESSED_SRGB_ALPHA_S3TC_DXT5_EXT
es: Equivalente a GL_COMPRESSED_SRGB_ALPHA_S3TC_DXT5_EXT
ko: GL_COMPRESSED_SRGB_ALPHA_S3TC_DXT5_EXT와 동일

source: Equivalent to GL_COMPRESSED_SRGB_S3TC_DXT1_EXT
es: Equivalente a GL_COMPRESSED_SRGB_S3TC_DXT1_EXT
ko: GL_COMPRESSED_SRGB_S3TC_DXT1_EXT와 동일

source: Equivalent to GL_DEPTH24_STENCIL8
es: Equivalente a GL_DEPTH24_STENCIL8
ko: GL_DEPTH24_STENCIL8와 동일

source: Equivalent to GL_DEPTH32F_STENCIL8
es: Equivalente a GL_DEPTH32F_STENCIL8
ko: GL_DEPTH32F_STENCIL8와 동일

source: Equivalent to GL_DEPTH_COMPONENT
es: Equivalente a GL_DEPTH_COMPONENT
ko: GL_DEPTH_COMPONENT와 동일

source: Equivalent to GL_DEPTH_COMPONENT (only OpenGL ES 3 or ES 2 with OES_depth_texture)
es: Equivalente a GL_DEPTH_COMPONENT (sólo OpenGL ES 3 o ES 2 con OES_depth_texture)
ko: GL_DEPTH_COMPONENT와 동일

source: Equivalent to GL_DEPTH_COMPONENT.
es: Equivalente a GL_DEPTH_COMPONENT.
ko: GL_DEPTH_COMPONENT와 동일합니다.

source: Equivalent to GL_DEPTH_COMPONENT16
es: Equivalente a GL_DEPTH_COMPONENT16
ko: GL_DEPTH_COMPONENT16와 동일

source: Equivalent to GL_DEPTH_COMPONENT24
es: Equivalente a GL_DEPTH_COMPONENT24
ko: GL_DEPTH_COMPONENT24와 동일

source: Equivalent to GL_DEPTH_COMPONENT32
es: Equivalente a GL_DEPTH_COMPONENT32
ko: GL_DEPTH_COMPONENT32와 동일

source: Equivalent to GL_DEPTH_COMPONENT32F
es: Equivalente a GL_DEPTH_COMPONENT32F
ko: GL_DEPTH_COMPONENT32F와 동일

source: Equivalent to GL_DEPTH_STENCIL
es: Equivalente a GL_DEPTH_STENCIL
ko: GL_DEPTH_STENCIL에 해당

source: Equivalent to GL_EQUAL.
es: Equivalente a GL_EQUAL.
ko: GL_EQUAL과 동일합니다.

source: Equivalent to GL_ETC1_RGB8_OES
es: Equivalente a GL_ETC1_RGB8_OES
ko: GL_ETC1_RGB8_OES와 동일

source: Equivalent to GL_FLOAT
es: Equivalente a GL_FLOAT
ko: GL_FLOAT와 동일

source: Equivalent to GL_FLOAT_32_UNSIGNED_INT_24_8_REV. Introduced in Qt 5.4
es: Equivalente a GL_FLOAT_32_UNSIGNED_INT_24_8_REV.Introducido en el Qt 5.4
ko: GL_FLOAT_32_UNSIGNED_INT_24_8_REV와 동일합니다. Qt 5.4에 도입

source: Equivalent to GL_GEQUAL.
es: Equivalente a GL_GEQUAL.
ko: GL_GEQUAL과 동일합니다.

source: Equivalent to GL_GREATER.
es: Equivalente a GL_GREATER.
ko: GL_GREATER와 동일합니다.

source: Equivalent to GL_HALF_FLOAT
es: Equivalente a GL_HALF_FLOAT
ko: GL_HALF_FLOAT와 동일

source: Equivalent to GL_HALF_FLOAT_OES
es: Equivalente a GL_HALF_FLOAT_OES
ko: GL_HALF_FLOAT_OES와 동일

source: Equivalent to GL_INT
es: Equivalente a GL_INT
ko: GL_INT와 동일

source: Equivalent to GL_LEQUAL.
es: Equivalente a GL_LEQUAL.
ko: GL_LEQUAL과 동일합니다.

source: Equivalent to GL_LESS.
es: Equivalente a GL_Menos.
ko: GL_LESS와 동일합니다.

source: Equivalent to GL_LINEAR
es: Equivalente a GL_LINEAR
ko: GL_LINEAR와 동일

source: Equivalent to GL_LINEAR_MIPMAP_LINEAR
es: Equivalente a GL_LINEAR_MIPMAP_LINEAR
ko: GL_LINEAR_MIPMAP_LINEAR와 동일

source: Equivalent to GL_LINEAR_MIPMAP_NEAREST
es: Equivalente a GL_LINEAR_MIPMAP_NEAREST
ko: GL_LINEAR_MIPMAP_NEAREST에 해당

source: Equivalent to GL_LUMINANCE (OpenGL ES 2 only)
es: Equivalente a GL_LUMINANCIA (OpenGL ES 2 solamente)
ko: GL_LUMINANCE와 동일 (OpenGL ES 2 만 해당)

source: Equivalent to GL_LUMINANCE_ALPHA (OpenGL ES 2 only)
es: Equivalente a GL_LUMINANCE_ALPHA (OpenGL ES 2 solamente)
ko: GL_LUMINANCE_ALPHA와 동일 (OpenGL ES 2 만 해당)

source: Equivalent to GL_NEAREST
es: Equivalente a GL_NEAREST
ko: GL_NEAREST와 동일

source: Equivalent to GL_NEAREST_MIPMAP_LINEAR
es: Equivalente a GL_NEAREST_MIPMAP_LINEAR
ko: GL_NEAREST_MIPMAP_LINEAR와 동일

source: Equivalent to GL_NEAREST_MIPMAP_NEAREST
es: Equivalente a GL_NEAREST_MIPMAP_NEAREST
ko: GL_NEAREST_MIPMAP_NEAREST에 해당

source: Equivalent to GL_NEVER.
es: Equivalente a GL_NEVER.
ko: GL_NEVER와 동일합니다.

source: Equivalent to GL_NONE
es: Equivalente a GL_NONE
ko: GL_NONE에 해당

source: Equivalent to GL_NONE.
es: Equivalente a GL_NONE.
ko: GL_NONE과 같습니다.

source: Equivalent to GL_NOTEQUAL.
es: Equivalente a GL_NOTEQUAL.
ko: GL_NOTEQUAL과 동일합니다.
