Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/qt/qt.*.123.xlf
Languages: es, ko, zh_cn

source: By using file selectors, style-specific tweaks can be applied without creating a hard dependency to a style. From the available file variants, only the selected QML file is loaded by the QML engine. Each file variant can assume the context, that is, a specific style. This typically leads to some code duplication, but on the other hand, cuts the aforementioned hard dependency to the style, and leads to simpler and more efficient QML code.
zh_cn: 通过使用文件选择器,风格特定的调整可以被应用,而不需要创建一个硬的依赖风格。在可用的文件变体中,QML引擎只加载所选的QML文件。每个文件变体都可以承担上下文,也就是特定的样式。这通常会导致一些代码重复,但另一方面,削减了上述对样式的硬依赖,并导致更简单和更有效的QML代码。

source: By using file selectors, style-specific tweaks can be applied without creating a hard dependency to a style. From the available file variants, only the selected QML file is loaded by the QML engine. Each file variant can assume the context, that is, a specific style. This typically leads to some code duplication, but on the other hand, cuts the aforementioned hard dependency to the style, and leads to simpler and more efficient QML code. The same technique is used to implement the <a href="qtquickcontrols2-styles">Qt Quick Controls styles</a>.
zh_cn: 通过使用文件选择器，可以应用特定于样式的调整，而无需创建对样式的硬依赖性。从可用的文件变体中，QML引擎仅加载选定的QML文件。每个文件变体都可以采用上下文，即特定的样式。通常，这会导致某些代码重复，但另一方面，会减少上述对样式的硬依赖性，并导致更简单，更有效的QML代码。使用相同的技术来实现<a href="qtquickcontrols2-styles">Qt Quick Controls样式</a>。

source: By using file selectors, style-specific tweaks can be applied without creating a hard dependency to a style. From the available file variants, only the selected QML file is loaded by the QML engine. Each file variant can assume the context, that is, a specific style. This typically leads to some code duplication, but on the other hand, cuts the aforementioned hard dependency to the style, and leads to simpler and more efficient QML code. The same technique is used to implement the <a href="qtquickcontrols2-styles#">Qt Quick Controls 2 styles</a>.
zh_cn: 通过使用文件选择器，可以应用特定于样式的调整，而无需创建对样式的硬依赖性。从可用的文件变体中，QML引擎仅加载选定的QML文件。每个文件变体都可以采用上下文，即特定的样式。通常，这会导致某些代码重复，但另一方面，会减少上述对样式的硬依赖性，并导致更简单，更有效的QML代码。使用相同的技术来实现<a href="qtquickcontrols2-styles#">Qt Quick Controls 2样式</a>。

source: By using this macro in impossible conditions, code coverage may be improved as dead code paths may be eliminated.
zh_cn: 通过在不可能的条件下使用这个宏,可以提高代码覆盖率,因为可以消除死代码路径。

source: Bypass the window manager completely. This results in a borderless window that is not managed at all (i.e., no keyboard input unless you call <a href="qwidget#activateWindow">QWidget::activateWindow</a>() manually).
zh_cn: 完全绕开窗口管理器。这将导致根本无法管理的无边界窗口（即，除非您手动调用<a href="qwidget#activateWindow">QWidget :: activateWindow</a>（），否则没有键盘输入）。

source: Bypasses data validation. Only use if you received the data from a trusted place and know it's valid, as using of invalid data can crash the application.
zh_cn: 绕过数据验证。只有当你从受信任的地方收到数据并且知道它是有效的时才使用,因为使用无效的数据会使应用程序崩溃。

source: Byte Array
zh_cn: 字节数组

source: Byte array
zh_cn: 字节数组

source: Byte arrays, Text strings
zh_cn: 字节数组,文本字符串

source: Byte order
zh_cn: 字节顺序

source: Byte ordering of sample (typically little endian, big endian)
zh_cn: 样本的字节排序(通常是小恩迪安、大恩迪安)。

source: Byte strings
zh_cn: 字节串

source: Bytes per second
zh_cn: 字节/秒

source: C Strings
zh_cn: C弦

source: C locale and ASCII functions
zh_cn: C语言区和ASCII函数

source: C++ API Documentation
zh_cn: C++API文档

source: C++ API Reference
zh_cn: C++API参考

source: C++ API Reference by domain
zh_cn: 按领域划分的C++API参考

source: C++ Classes
zh_cn: C++类

source: C++ Classes and Namespaces
zh_cn: C++类和命名空间

source: C++ Data Models
zh_cn: C++数据模型

source: C++ Documentation Style
zh_cn: C++文档风格

source: C++ Extension Points
zh_cn: C++扩展点

source: C++ Extension Points Provided By Qt Quick
zh_cn: Qt Quick提供的C++扩展点

source: C++ Implementation:
zh_cn: C++实现。

source: C++ Inheritance and Coercion
zh_cn: C++继承和强制

source: C++ Libraries
zh_cn: C++库

source: C++ Models
zh_cn: C++模型

source: C++ Module Imports
zh_cn: C++模块导入

source: C++ Overview
zh_cn: C++概述

source: C++ Specific Configuration Variables
zh_cn: C++特定配置变量

source: C++ and Java exceptions are a valid analogy for D-Bus errors: instead of returning normally with a return value, remote applications and the bus may decide to throw an error condition. However, the Qt D-Bus implementation does not use the C++ exception-throwing mechanism, so you will receive QDBusErrors in the return reply (see <a href="qdbusreply#error">QDBusReply::error</a>()).
zh_cn: C ++和Java异常是D-Bus错误的有效类比：远程应用程序和总线可能决定抛出错误条件，而不是正常返回返回值。但是，Qt D-Bus实现不使用C ++异常抛出机制，因此您将在返回答复中收到QDBusErrors（请参阅<a href="qdbusreply#error">QDBusReply :: error</a>（））。

source: C++ and QML
zh_cn: C++和QML

source: C++ classes are often reentrant, simply because they only access their own member data. Any thread can call a member function on an instance of a reentrant class, as long as no other thread can call a member function on the
zh_cn: C++类通常是重入的,只是因为它们只访问自己的成员数据。任何线程都可以在一个重入类的实例上调用成员函数,只要没有其他线程可以在该类的

source: C++ data model, as described in the <a href="qscxmlcppdatamodel">QScxmlCppDataModel</a> documentation
zh_cn: C ++数据模型，如<a href="qscxmlcppdatamodel">QScxmlCppDataModel</a>文档中所述

source: C++ is a standarized, powerful and elaborate general-purpose language. It's the only language that is exploited on such a wide range of software projects, spanning every kind of application from entire operating systems, database servers and high end graphics applications to common desktop applications. One of the keys to C++'s success is its scalable language design that focuses on maximum performance and minimal memory consumption whilst still maintaining ANSI C compatibility.
zh_cn: C++是一种标准化的、功能强大的、复杂的通用语言。它是唯一一门被广泛用于软件项目的语言,涵盖了从整个操作系统、数据库服务器、高端图形应用到普通桌面应用的各种应用。C++成功的关键之一是其可扩展的语言设计,它注重最大的性能和最小的内存消耗,同时仍然保持ANSI C的兼容性。

source: C++ modules or members of the module with a specified name.
zh_cn: C++模块或指定名称的模块成员。

source: C++ plugin writers and application developers may register types defined in C++ through API provided by the Qt QML module. There are various registration functions which each allow different use-cases to be fulfilled. For more information about those registration functions, and the specifics of exposing custom C++ types to QML, see the documentation regarding <a href="qtqml-cppintegration-definetypes">Defining QML Types from C++</a>.
zh_cn: C ++插件编写者和应用程序开发人员可以通过Qt QML模块提供的API注册用C ++定义的类型。有各种注册功能，每个功能都可以满足不同的用例。有关这些注册功能以及将自定义C ++类型暴露于QML的细节的更多信息，请参见有关<a href="qtqml-cppintegration-definetypes">从C ++定义QML类型</a>的文档。

source: C++ plugin writers and application developers may register types defined in C++ through API provided by the Qt QML module. There are various registration functions which each allow different use-cases to be fulfilled. For more information about those registration functions, and the specifics of exposing custom C++ types to QML, see the documentation regarding <a href="qtqml-cppintegration-definetypes#">Defining QML Types from C++</a>.
zh_cn: C ++插件编写者和应用程序开发人员可以通过Qt QML模块提供的API注册用C ++定义的类型。有多种注册功能，每种注册功能都可以满足不同的用例。有关这些注册功能的详细信息，以及将自定义C ++类型公开给QML的细节，请参阅有关<a href="qtqml-cppintegration-definetypes#">从C ++定义QML类型</a>的文档。

source: C++ signals and methods with enumeration-type parameters can be used from QML provided that the enumeration and the signal or method are both declared within the same class, or that the enumeration value is one of those declared in the <a href="qml-qtqml-qt">Qt Namespace</a>.
zh_cn: 如果枚举与信号或方法都在同一类中声明，或者枚举值是在<a href="qml-qtqml-qt">Qt命名空间中</a>声明的值之一，则可以从QML中使用带有枚举类型参数的C ++信号和方法。

source: C++ with the <code>moc</code> essentially gives us the flexibility of Objective-C or of a Java Runtime Environment, while maintaining C++'s unique performance and scalability advantages. It is what makes Qt the flexible and comfortable tool we have today.
zh_cn: 具有 <code>moc</code> C ++ 本质上为我们提供了Objective-C或Java运行时环境的灵活性，同时保持了C ++独特的性能和可伸缩性优势。这就是使Qt成为我们今天拥有的灵活舒适的工具的原因。

source: C++11 support
zh_cn: 支持C++11

source: C++11 support is enabled. This option has no effect if the compiler does not support C++11, or can't select the C++ standard. By default, support is enabled.
zh_cn: 启用了对C++11的支持。如果编译器不支持C++11,或者不能选择C++标准,这个选项没有效果。默认情况下,支持是启用的。

source: C++14 support is enabled. This option has no effect if the compiler does not support C++14, or can't select the C++ standard. By default, the compiler default is used.
zh_cn: 启用了对C++14的支持。如果编译器不支持C++14,或者不能选择C++标准,这个选项没有效果。默认情况下,使用编译器的默认值。

source: C++17 support is enabled. This option has no effect if the compiler does not support C++17, or can't select the C++ standard. By default, support is disabled.
zh_cn: 启用了对C++17的支持。如果编译器不支持C++17,或者不能选择C++标准,这个选项没有效果。默认情况下,支持被禁用。

source: C++20, char8_t, and QUtf8StringView
zh_cn: C++20,char8_t,和QUtf8StringView。

source: C++2a support is enabled. This option has no effect if the compiler does not support C++2a, or can't select the C++ standard. By default, support is disabled.
zh_cn: C++2a支持被启用。如果编译器不支持C++2a,或者不能选择C++标准,这个选项没有效果。默认情况下,支持被禁用。

source: C11 support is enabled. This option has no effect if the compiler does not support C11, or can't select the C standard. By default, the compiler default is used.
zh_cn: 启用了C11支持。如果编译器不支持C11,或者不能选择C标准,这个选项没有效果。默认情况下,使用编译器的默认值。

source: C99 support is enabled. This option has no effect if the compiler does not support C99, or can't select the C standard. By default, the compiler default is used.
zh_cn: 启用了C99支持。如果编译器不支持C99,或者不能选择C标准,这个选项没有效果。默认情况下,使用编译器的默认值。

source: C:\Program Files
zh_cn: C:\\程序文件

source: CA certificates used by the SSL sockets during the SSL handshake you must update the default configuration, as in the snippet below:
zh_cn: 在SSL握手过程中SSL套接字使用的CA证书,你必须更新默认配置,如下面的片段。

source: CAMERA_DIRECTION -&gt; vec3, the camera direction vector
zh_cn: CAMERA_DIRECTION-&gt; vec3，相机方向向量

source: CAMERA_POSITION -&gt; vec3, the camera position in world space
zh_cn: CAMERA_POSITION-&gt; vec3，摄像机在世界空间中的位置

source: CAMERA_PROPERTIES -&gt; vec2, the near and far clip values for the camera
zh_cn: CAMERA_PROPERTIES-&gt; vec2，摄像机的近端和远端剪辑值

source: CAN Bus Example
zh_cn: CAN总线示例

source: CAN Bus Plugins
zh_cn: CAN总线插件

source: CAN bus backend using the SYS TEC CAN adapters.
zh_cn: CAN总线后端使用SYS TEC CAN适配器。

source: CAN bus implementations must use this function to update the device's error state.
zh_cn: CAN总线的实现必须使用这个函数来更新设备的错误状态。

source: CAN bus plugin using Linux sockets and open source drivers.
zh_cn: 使用Linux插座和开源驱动程序的CAN总线插件。

source: CAN bus plugin using a virtual TCP/IP connection.
zh_cn: 使用虚拟TCP/IP连接的CAN总线插件。

source: CAN bus plugin using the MHS CAN adapters.
zh_cn: 使用MHS CAN适配器的CAN总线插件。

source: CAN bus plugin using the PEAK CAN adapters.
zh_cn: 使用PEAK CAN适配器的CAN总线插件。

source: CAN bus plugin using the SAE J2534 Pass-Thru interface.
zh_cn: 使用SAE J2534 Pass-Thru接口的CAN总线插件。

source: CAN bus plugin using the Vector CAN adapters.
zh_cn: 使用Vector CAN适配器的CAN总线插件。

source: CAN extended frame format
zh_cn: CAN扩展帧格式

source: CAN over Linux sockets
zh_cn: 通过Linux插座的CAN

source: CAN via SAE J2534 Pass-Thru
zh_cn: CAN通过SAE J2534直通车。

source: CBOR Type
zh_cn: CBOR类型

source: CBOR diagnostic notation is specified by <a href="https://tools.ietf.org/html/rfc7049#section-6">section 6</a> of RFC 7049. It is a text representation of the CBOR stream and it is very similar to JSON, but it supports the CBOR types not found in JSON. The extended format enabled by the <a href="qcborvalue#DiagnosticNotationOption-enum">ExtendedFormat</a> flag is currently in some IETF drafts and its format is subject to change.
zh_cn: CBOR诊断符号由RFC 7049 的<a href="https://tools.ietf.org/html/rfc7049#section-6">第6节</a>指定。它是CBOR流的文本表示形式，与JSON非常相似，但是它支持JSON中找不到的CBOR类型。当前，某些IETF草案中已通过<a href="qcborvalue#DiagnosticNotationOption-enum">ExtendedFormat</a>标志启用的扩展格式，其格式可能会发生更改。

source: CBOR floating point values are distinct from integer values. Therefore, <a href="qcborvalue">QCborValue</a> objects with integers will compare differently to <a href="qcborvalue">QCborValue</a> objects containing floating-point, even if the values contained in the objects are equivalent.
zh_cn: CBOR浮点值不同于整数值。因此，具有整数的<a href="qcborvalue">QCborValue</a>对象将与包含浮点的<a href="qcborvalue">QCborValue</a>对象进行比较，即使这些对象中包含的值相等。

source: CBOR floating point values are distinct from integer values. Therefore, QCborValue objects with integers will compare differently to QCborValue objects containing floating-point, even if the values contained in the objects are equivalent.
zh_cn: CBOR浮点值与整数值不同。因此,包含整数的QCborValue对象与包含浮点的QCborValue对象的比较会有所不同,即使对象中包含的值是相等的。

source: CBOR has three groups of built-in types:
zh_cn: CBOR有三组内置类型。

source: CBOR integer values are distinct from floating point values. Therefore, <a href="qcborvalue">QCborValue</a> objects with integers will compare differently to <a href="qcborvalue">QCborValue</a> objects containing floating-point, even if the values contained in the objects are equivalent.
zh_cn: CBOR整数值与浮点值不同。因此，具有整数的<a href="qcborvalue">QCborValue</a>对象将与包含浮点的<a href="qcborvalue">QCborValue</a>对象进行比较，即使这些对象中包含的值相等。

source: CBOR integer values are distinct from floating point values. Therefore, QCborValue objects with integers will compare differently to QCborValue objects containing floating-point, even if the values contained in the objects are equivalent.
zh_cn: CBOR整数值与浮点值是不同的。因此,含有整数的QCborValue对象将与含有浮点的QCborValue对象进行不同的比较,即使对象中包含的值是相等的。

source: CBOR null values are used to indicate optional values that were not provided. They are distinct from undefined values, in that null values are usually not the result of an earlier error or problem.
zh_cn: CBOR空值用于表示未提供的可选值。它们不同于未定义的值,因为空值通常不是早期错误或问题的结果。

source: CBOR recommends using integer keys, since they occupy less space and are simpler to encode and decode.
zh_cn: CBOR建议使用整数钥匙,因为它们占用的空间较小,编码和解码也比较简单。

source: CBOR represents extended types by associating a number (the tag) with a stored representation. This function returns that number. To retrieve the representation, use <a href="qcborvalue#taggedValue">taggedValue</a>().
zh_cn: CBOR通过将数字（标签）与存储的表示形式相关联来表示扩展类型。此函数返回该数字。要检索表示形式，请使用<a href="qcborvalue#taggedValue">aggedValue</a>（）。

source: CBOR represents extended types by associating a number (the tag) with a stored representation. This function returns that representation. To retrieve the tag, use <a href="qcborvalue#tag">tag</a>().
zh_cn: CBOR通过将数字（标签）与存储的表示形式相关联来表示扩展类型。此函数返回该表示形式。要检索标签，请使用<a href="qcborvalue#tag">标签</a>（）。

source: CBOR simple types are types that do not carry extra value. There are 255 possibilities, but there are currently only four values that have defined meaning. Code is not expected to cope with unknown simple types and may simply discard the stream as invalid if it finds an unknown one.
zh_cn: CBOR简单类型是不携带额外值的类型。有255种可能性,但目前只有4种值具有定义的意义。代码不应该应对未知的简单类型,如果发现未知的类型,可能会简单地将流作为无效类型丢弃。

source: CBOR simple types are types that do not have any associated value, like C++'s <code>std::nullptr_t</code> type, whose only possible value is <code>nullptr</code>.
zh_cn: CBOR简单类型是没有任何关联值的类型，例如C ++的 <code>std::nullptr_t</code> 类型，其唯一可能的值为 <code>nullptr</code> 。

source: CBOR string, map or array is too big and cannot be parsed by Qt (internal limitation, but the error is not recoverable).
zh_cn: CBOR 字符串、映射或数组太大,Qt无法解析(内部限制,但错误无法恢复)。

source: CBOR support
zh_cn: CBOR支持

source: CBOR supports additional simple types that, like Null and Undefined, carry no other value. They are called interchangeably "Simple Types" and "Simple Values". CBOR encodes booleans as two distinct types (one for <code>true</code> and one for <code>false</code>), but <a href="qcborvalue">QCborValue</a> has a convenience API for them.
zh_cn: CBOR支持其他简单类型，例如Null和Undefined，不包含其他值。它们可互换地称为&ldquo;简单类型&rdquo;和&ldquo;简单值&rdquo;。CBOR将布尔值编码为两种不同的类型（一种表示 <code>true</code> ，一种表示 <code>false</code> ），但是<a href="qcborvalue">QCborValue</a>具有一个便捷的API。

source: CBOR supports additional simple types that, like Null and Undefined, carry no other value. They are called interchangeably "Simple Types" and "Simple Values". CBOR encodes booleans as two distinct types (one for <code>true</code> and one for <code>false</code>), but QCborValue has a convenience API for them.
zh_cn: CBOR支持其他简单类型，例如Null和Undefined，不包含其他值。它们可互换地称为&ldquo;简单类型&rdquo;和&ldquo;简单值&rdquo;。CBOR将布尔值编码为两种不同的类型（一种表示 <code>true</code> ，一种表示 <code>false</code> ），但是QCborValue为它们提供了一种便捷的API。

source: CBOR tags are 64-bit numbers that are attached to generic CBOR types to provide further semantic meaning. QCborTag may be constructed from an enumeration found in <a href="qtcborcommon#QCborKnownTags-enum">QCborKnownTags</a> or directly by providing the numeric representation.
zh_cn: CBOR标记是附加到通用CBOR类型以提供进一步语义的64位数字。QCborTag可以从<a href="qtcborcommon#QCborKnownTags-enum">QCborKnownTags中</a>找到的枚举构造，也可以直接通过提供数字表示来构造。

source: CBOR type
zh_cn: CBOR型

source: CBOR undefined values are used to indicate missing information, usually as a result of a previous operation that did not complete as expected. They are also used by the <a href="qcborarray">QCborArray</a> and <a href="qcbormap">QCborMap</a> API to indicate the searched item was not found.
zh_cn: CBOR未定义值通常用于指示缺少的信息，通常是由于先前的操作未按预期完成。<a href="qcborarray">QCborArray</a>和<a href="qcbormap">QCborMap</a> API 也使用它们来指示未找到搜索到的项目。

source: CDATA sections are used to escape blocks of text containing characters that would otherwise be regarded as markup. The only delimiter that is recognized in a CDATA section is the "]]&amp;gt;" string that terminates the CDATA section. CDATA sections cannot be nested. Their primary purpose is for including material such as XML fragments, without needing to escape all the delimiters.
zh_cn: CDATA节用于转义包含可能被视为标记的字符的文本块。CDATA节中唯一可识别的定界符是&ldquo;]]＆gt;&rdquo; 终止CDATA节的字符串。CDATA节不能嵌套。它们的主要目的是包含诸如XML片段之类的资料，而无需转义所有定界符。

source: CFBundleVersion property of the information property list
zh_cn: 信息属性列表的 CFBundleVersion 属性。

source: CFTimeZoneRef QTimeZone::toCFTimeZone() const
zh_cn: CFTTimeZoneRef QTimeZone::toCFTTimeZone()const

source: CFUUIDRef QUuid::toCFUUID() const
zh_cn: CFUIDRef QUuid::toCFUUID()const

source: CGImageRef QtMac::toCGImageRef(const <a href="qpixmap">QPixmap</a> &amp;
zh_cn: CGImageRef QtMac :: toCGImageRef（const <a href="qpixmap">QPixmap</a>＆

source: CI Overview in Qt Wiki
zh_cn: Qt Wiki中的CI概述

source: CID-keyed Type1
zh_cn: CID键的Type1

source: CMYK has four components, all in the range 0-255: cyan (C), magenta (M), yellow (Y) and black (K). Cyan, magenta and yellow are called subtractive colors; the CMYK color model creates color by starting with a white surface and then subtracting color by applying the appropriate components. While combining cyan, magenta and yellow gives the color black, subtracting one or more will yield any other color. When combined in various percentages, these three colors can create the entire spectrum of colors.
zh_cn: CMYK有四种成分,都在0-255的范围内:青色(C)、品红(M)、黄色(Y)和黑色(K)。青色、品红和黄色被称为减色,CMYK色彩模型通过从白色表面开始,然后通过应用适当的组件减去颜色来创建色彩。虽然将青色、品红和黄色结合起来可以得到黑色,但减去一种或多种会得到任何其他颜色。当以不同的百分比组合时,这三种颜色可以创建整个光谱的颜色。

source: CMake (available in the Qt online installer)
zh_cn: CMake (在Qt在线安装程序中可用)

source: CMake Command Reference
zh_cn: CMake命令参考

source: CMake Generators
zh_cn: CMake发电机

source: CMake Variable Reference
zh_cn: CMake变量参考

source: CMake integration for the <code>qsb</code> tool
zh_cn: <code>qsb</code> 工具的CMake集成

source: COLOR -&gt; vec4, the vertex color in the vertex shader. When the mesh for the associated model does not provide per-vertex colors, the value is vec4(1.0).
zh_cn: 颜色-&gt; vec4，顶点着色器中的顶点颜色。当关联模型的网格不提供每个顶点的颜色时，该值为vec4（1.0）。

source: COM App Example (ActiveQt)
zh_cn: COM应用程序示例(ActiveQt)

source: COM enabled applications usually have an object model publishing certain elements of the application as dispatch interfaces. Use this method to navigate the hierarchy of the object model, e.g.
zh_cn: 支持COM的应用程序通常有一个对象模型,将应用程序的某些元素作为调度接口发布。使用该方法来导航对象模型的层次结构,如

source: COM objects can have multiple sub-objects that can represent a sub element of the COM object. A COM object representing a multi-document spread sheet application can for example provide one sub-object for each spread sheet.
zh_cn: COM对象可以有多个子对象,这些子对象可以代表COM对象的一个子元素。例如,表示多文档电子表格应用的COM对象可以为每个电子表格提供一个子对象。

source: COM parameter
zh_cn: COM参数

source: COM property
zh_cn: COM属性

source: COM type
zh_cn: COM型

source: CPU Architecture
zh_cn: CPU结构

source: CPU cycles
zh_cn: CPU周期

source: CPU time
zh_cn: CPU时间

source: CSS Color Parser
zh_cn: CSS颜色解析器

source: CSS Properties
zh_cn: CSS属性

source: Cache File
zh_cn: 缓存文件

source: Cache accesses of any type
zh_cn: 任何类型的缓存访问

source: Cache information
zh_cn: 缓存信息

source: Cache keys are mostly useful in conjunction with caching.
zh_cn: 缓存键主要是配合缓存使用。

source: Cache misses of any type
zh_cn: 任何类型的缓存遗漏

source: Cache prefetch misses
zh_cn: 缓存预取失败

source: Cache prefetches
zh_cn: 缓存预取

source: Cache read / load misses
zh_cn: 缓存读取/加载失败

source: Cache reads / loads
zh_cn: 缓存读取/加载

source: Cache size for map resources in bytes. The default size of this cache is 50 MiB. Make sure to comply with Mapbox Terms of Service before increasing this value.
zh_cn: 地图资源的缓存大小,单位为字节。该缓存的默认大小为 50 MiB。在增加该值之前,请确保遵守 Mapbox 的服务条款。

source: Cache write / store misses
zh_cn: 缓存写入/存储丢失

source: Cache writes / stores
zh_cn: 缓存写入/存储

source: Caching FTP
zh_cn: 缓存FTP

source: Caching Program Binaries
zh_cn: 缓存程序二进制文件

source: Caching and Performance
zh_cn: 缓存和性能

source: Caching can speed up rendering if your item spends a significant time redrawing itself. In some cases the cache can also slow down rendering, in particular when the item spends less time redrawing than <a href="qgraphicsitem">QGraphicsItem</a> spends redrawing from the cache.
zh_cn: 如果您的项目花费大量时间重新绘制自身，则缓存可以加快渲染速度。在某些情况下，缓存还会降低渲染速度，特别是当项目花费的重绘时间少于<a href="qgraphicsitem">QGraphicsItem</a>从缓存中重绘的时间时。

source: Caching frames can be useful when the underlying animation format handler that <a href="qmovie">QMovie</a> relies on to decode the animation data does not support jumping to particular frames in the animation, or even "rewinding" the animation to the beginning (for looping). Furthermore, if the image data comes from a sequential device, it is not possible for the underlying animation handler to seek back to frames whose data has already been read (making looping altogether impossible).
zh_cn: 当<a href="qmovie">QMovie</a>用来解码动画数据的基础动画格式处理程序不支持跳转到动画中的特定帧，甚至不支持将动画&ldquo;倒回&rdquo;到开始（用于循环）时，缓存帧可能会很有用。此外，如果图像数据来自顺序设备，则底层的动画处理程序将无法返回到其数据已被读取的帧（完全使循环成为不可能）。

source: Caching is enabled at the paint device level, in device coordinates. This mode is for items that can move, but are not rotated, scaled or sheared. If the item is transformed directly or indirectly, the cache will be regenerated automatically. Unlike ItemCoordinateCacheMode, DeviceCoordinateCache always renders at maximum quality.
zh_cn: 缓存是在设备坐标的绘图设备级别启用的。该模式适用于可以移动,但不旋转、不缩放或不剪切的项目。如果项目被直接或间接变换,缓存将被自动重新生成。与ItemCoordinateCacheMode不同,DeviceCoordinateCache总是以最大质量渲染。

source: Caching is enabled by default.
zh_cn: 缓存是默认启用的。
