Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/qt/qt.*.123.xlf
Languages: es, ko, zh_cn

source: Calling this function on <a href="qmultihash#end">QMultiHash::end</a>() leads to undefined results.
zh_cn: 在<a href="qmultihash#end">QMultiHash :: end</a>（）上调用此函数将导致未定义的结果。

source: Calling this function on <a href="qmultihash#keyEnd">QMultiHash::keyEnd</a>() leads to undefined results.
zh_cn: 在<a href="qmultihash#keyEnd">QMultiHash :: keyEnd</a>（）上调用此函数将导致未定义的结果。

source: Calling this function on <a href="qmultimap#begin">QMultiMap::begin</a>() leads to undefined results.
zh_cn: 在<a href="qmultimap#begin">QMultiMap :: begin</a>（）上调用此函数将导致未定义的结果。

source: Calling this function on <a href="qmultimap#end">QMultiMap::end</a>() leads to undefined results.
zh_cn: 在<a href="qmultimap#end">QMultiMap :: end</a>（）上调用此函数将导致未定义的结果。

source: Calling this function on <a href="qmultimap#keyBegin">QMultiMap::keyBegin</a>() leads to undefined results.
zh_cn: 在<a href="qmultimap#keyBegin">QMultiMap :: keyBegin</a>（）上调用此函数将导致未定义的结果。

source: Calling this function on <a href="qmultimap#keyEnd">QMultiMap::keyEnd</a>() leads to undefined results.
zh_cn: 在<a href="qmultimap#keyEnd">QMultiMap :: keyEnd</a>（）上调用此函数将导致未定义的结果。

source: Calling this function on <a href="qsequentialiterable#begin">QSequentialIterable::begin</a>() leads to undefined results.
zh_cn: 在<a href="qsequentialiterable#begin">QSequentialIterable :: begin</a>（）上调用此函数将导致未定义的结果。

source: Calling this function on <a href="qsequentialiterable#end">QSequentialIterable::end</a>() leads to undefined results.
zh_cn: 在<a href="qsequentialiterable#end">QSequentialIterable :: end</a>（）上调用此函数将导致未定义的结果。

source: Calling this function on <a href="qset">QSet</a>&lt;T&gt;::constEnd() leads to undefined results.
zh_cn: 在<a href="qset">QSet</a> &lt;T&gt; :: constEnd（）上调用此函数将导致未定义的结果。

source: Calling this function on <a href="qset#begin">QSet::begin</a>() leads to undefined results.
zh_cn: 在<a href="qset#begin">QSet :: begin</a>（）上调用此函数将导致未定义的结果。

source: Calling this function on <a href="qtcore-changes-qt6#qfuture">QFuture</a>&lt;T&gt;::constBegin() leads to undefined results.
zh_cn: 在<a href="qtcore-changes-qt6#qfuture">QFuture</a> &lt;T&gt; :: constBegin（）上调用此函数将导致未定义的结果。

source: Calling this function on <a href="qtcore-changes-qt6#qfuture">QFuture</a>&lt;T&gt;::constEnd() leads to undefined results.
zh_cn: 在<a href="qtcore-changes-qt6#qfuture">QFuture</a> &lt;T&gt; :: constEnd（）上调用此函数将导致未定义的结果。

source: Calling this function on QLinkedList&lt;T&gt;::constEnd() leads to undefined results.
zh_cn: 在QLinkedList &lt;T&gt; :: constEnd（）上调用此函数将导致未定义的结果。

source: Calling this function on QSequentialIterable::begin() leads to undefined results.
zh_cn: 在QSequentialIterable::begin()上调用这个函数会导致未定义的结果。

source: Calling this function on QSequentialIterable::end() leads to undefined results.
zh_cn: 在QSequentialIterable::end()上调用这个函数会导致未定义的结果。

source: Calling this function on a <a href="qelapsedtimer">QElapsedTimer</a> that is invalid results in undefined behavior.
zh_cn: 在无效的<a href="qelapsedtimer">QElapsedTimer</a>上调用此函数将导致未定义的行为。

source: Calling this function on a null node(created, for example, with the default constructor) does nothing and returns a <a href="qdomnode#isNull">null node</a>.
zh_cn: 在空节点（例如，使用默认构造函数创建）上调用此函数不会执行任何操作，并返回一个<a href="qdomnode#isNull">空节点</a>。

source: Calling this function on an iterator located at the back of the container leads to undefined results.
zh_cn: 在位于容器后面的迭代器上调用这个函数会导致未定义的结果。

source: Calling this function on an iterator located at the back of the result list leads to undefined results.
zh_cn: 在位于结果列表后面的迭代器上调用这个函数会导致未定义的结果。

source: Calling this function on an iterator located at the front of the container leads to undefined results.
zh_cn: 在位于容器前面的迭代器上调用这个函数会导致未定义的结果。

source: Calling this function on an iterator located at the front of the result list leads to undefined results.
zh_cn: 在位于结果列表前面的迭代器上调用这个函数会导致未定义的结果。

source: Calling this function on or with a <a href="qelapsedtimer">QElapsedTimer</a> that is invalid results in undefined behavior.
zh_cn: 在无效的<a href="qelapsedtimer">QElapsedTimer</a>上或其上调用此函数将导致未定义的行为。

source: Calling this function only affects <a href="qwidget#isWindow">windows</a>.
zh_cn: 调用此函数仅影响<a href="qwidget#isWindow">Windows</a>。

source: Calling this function processes events only for the calling thread, and returns after all available events have been processed. Available events are events queued before the function call. This means that events that are posted while the function runs will be queued until a later round of event processing.
zh_cn: 调用该函数只处理调用线程的事件,并在处理完所有可用事件后返回。可用事件是指在函数调用前排队的事件。这意味着在函数运行时发布的事件将被排队到后一轮事件处理中。

source: Calling this function processes events only for the calling thread.
zh_cn: 调用该函数只处理调用线程的事件。

source: Calling this function re-evaluates the size and position of each visible row and column. This is needed if the functions assigned to <a href="qml-qtquick-tableview#rowHeightProvider-prop">rowHeightProvider</a> or <a href="qml-qtquick-tableview#columnWidthProvider-prop">columnWidthProvider</a> return different values than what is already assigned.
zh_cn: 调用此函数将重新评估每个可见行和列的大小和位置。如果分配给<a href="qml-qtquick-tableview#rowHeightProvider-prop">rowHeightProvider</a>或<a href="qml-qtquick-tableview#columnWidthProvider-prop">columnWidthProvider</a>的函数返回的值与已分配的值不同，则需要这样做。

source: Calling this function requests the scene graph to release cached graphics resources, such as graphics pipeline objects or shader programs.
zh_cn: 调用该函数请求场景图释放缓存的图形资源,如图形管道对象或着色器程序。

source: Calling this function when the current container is not a map is also an error, though <a href="qcborstreamwriter">QCborStreamWriter</a> cannot currently detect this condition.
zh_cn: 尽管<a href="qcborstreamwriter">QCborStreamWriter</a>当前无法检测到这种情况，但在当前容器不是地图时调用此函数也是一个错误。

source: Calling this function when the current container is not an array is also an error, though <a href="qcborstreamwriter">QCborStreamWriter</a> cannot currently detect this condition.
zh_cn: 尽管<a href="qcborstreamwriter">QCborStreamWriter</a>当前无法检测到这种情况，但在当前容器不是数组时调用此函数也是一个错误。

source: Calling this function when there is no data available in the input source indicates to the reader that the end of the XML file has been reached. If the input supplied up to this point was not well-formed then a parsing error occurs, and false is returned. If the input supplied was well-formed, true is returned. It is important to end the input in this way because it allows you to reuse the reader to parse other XML files.
zh_cn: 当输入源中没有可用的数据时,调用这个函数,向读取者表明已经到达XML文件的终点。如果到此为止提供的输入没有很好地形成,那么就会发生一个解析错误,并返回false。如果提供的输入是格式良好的,则返回true。以这种方式结束输入是很重要的,因为它允许你重用阅读器来解析其他XML文件。

source: Calling this function where
zh_cn: 调用此函数,其中

source: Calling this function will asynchronously yield either a <a href="qinappstore#productRegistered">productRegistered</a>() or a <a href="qinappstore#productUnknown">productUnknown</a>() signal. It may also yield a <a href="qinappstore#transactionReady">transactionReady</a>() signal if there is a pending transaction for the product which has not yet been finalized.
zh_cn: 调用此函数将异步产生<a href="qinappstore#productRegistered">productRegistered</a>（）或<a href="qinappstore#productUnknown">productUnknown</a>（）信号。如果该产品存在尚未完成的待处理事务，它也可能会产生<a href="qinappstore#transactionReady">transactionReady</a>（）信号。

source: Calling this function will hide the widget. You must call <a href="qwidget#show">show</a>() to make the widget visible again.
zh_cn: 调用此函数将隐藏小部件。您必须调用<a href="qwidget#show">show</a>（）才能使小部件再次可见。

source: Calling this function will override the url of the containing component used by default.
zh_cn: 调用此函数将覆盖默认使用的包含组件的url。

source: Calling this function with
zh_cn: 在调用这个函数时,用

source: Calling this function with <a href="qt#CoordinateSystem-enum">Qt::DeviceCoordinates</a> outside of <a href="qgraphicseffect#draw">QGraphicsEffect::draw</a>() will give undefined results, as there is no device context available.
zh_cn: 使用<a href="qgraphicseffect#draw">QGraphicsEffect :: draw</a>（）之外的<a href="qt#CoordinateSystem-enum">Qt :: DeviceCoordinates</a>调用此函数将产生未定义的结果，因为没有可用的设备上下文。

source: Calling this has no effect when a graphics API other than OpenGL is used, but is highly beneficial when the API is OpenGL as it will lead to creating an OpenGL context that is best suited for Qt Quick 3D's needs.
zh_cn: 当使用OpenGL以外的图形API时,调用此功能没有任何效果,但当API是OpenGL时,调用此功能是非常有利的,因为它将导致创建一个最适合Qt Quick 3D需求的OpenGL上下文。

source: Calling this is not recommended when protecting a short-lived operation: <a href="qlockfile">QLockFile</a> already takes care of removing lock files after they are older than <a href="qlockfile#staleLockTime">staleLockTime</a>().
zh_cn: 保护短命操作时，不建议调用此方法：<a href="qlockfile">QLockFile</a>已经负责删除比<a href="qlockfile#staleLockTime">staleLockTime</a>（）更旧的锁定文件。

source: Calling this method can be rather expensive if rotations or shearing are used.
zh_cn: 如果使用旋转或剪切,调用这种方法会相当昂贵。

source: Calling this method forces the backend to trigger a routes recalculation.
zh_cn: 调用该方法会强制后台触发路由重新计算。

source: Calling this method multiple times with the same URL will result in the QML component being reinstantiated.
zh_cn: 用相同的URL多次调用该方法将导致QML组件被重新建立。

source: Calling this method multiple times with the same url will result in the QML component being reinstantiated.
zh_cn: 用相同的url多次调用该方法将导致QML组件被重新实例化。

source: Calling this method will cause onPurchaseRestored handlers to be called asynchronously on previously purchased unlockable products. This can be used to restore purchases for unlockable products when the application is run by the same user on multiple devices, or for example if the application has been uninstalled and reinstalled on the device so that the purchase data has been lost.
zh_cn: 调用该方法将导致对先前购买的可解锁产品异步调用onPurchaseRestored处理程序。当应用程序由同一用户在多个设备上运行时,或例如当应用程序被卸载后又重新安装到设备上导致购买数据丢失时,可以使用该方法来恢复可解锁产品的购买。

source: Calling this method will update the corresponding moving and flicking properties and signals, just like a real flick.
zh_cn: 调用此方法将更新相应的移动和闪动属性和信号,就像真正的闪动一样。

source: Calling this while the camera is active may result in the camera being stopped and reloaded. If video recording is in progress, this call may be ignored.
zh_cn: 在摄像机处于活动状态时调用此功能可能会导致摄像机停止并重新加载。如果正在进行视频录制,则可能会忽略此呼叫。

source: Calling this will start an interactive move operation on the window by platforms that support it. The actual behavior may vary depending on the platform. Usually, it will make the window follow the mouse cursor until a mouse button is released.
zh_cn: 调用该功能,将由支持该功能的平台开始对窗口进行交互式移动操作。实际行为可能因平台不同而不同。通常情况下,它会使窗口跟随鼠标光标移动,直到释放鼠标按钮。

source: Calling this will start an interactive resize operation on the window by platforms that support it. The actual behavior may vary depending on the platform. Usually, it will make the window resize so that its edge follows the mouse cursor.
zh_cn: 调用此功能将启动支持该功能的平台对窗口进行交互式调整大小的操作。实际行为可能会因平台不同而不同。通常,它将使窗口调整大小,使其边缘跟随鼠标光标。

source: Calling unlock() without locking the file first, does nothing.
zh_cn: 在没有先锁定文件的情况下调用unlock(),没有任何作用。

source: Calling update() several times normally results in just one <a href="qwidget#paintEvent">paintEvent</a>() call.
zh_cn: 多次调用update（）通常只会导致一次<a href="qwidget#paintEvent">paintEvent</a>（）调用。

source: Calls <a href="qaxbase#initialize">QAxBase::initialize</a>(
zh_cn: 调用<a href="qaxbase#initialize">QAxBase :: initialize</a>（

source: Calls <a href="qdatawidgetmapper#currentIndex-prop">setCurrentIndex</a>() internally.
zh_cn: 内部调用<a href="qdatawidgetmapper#currentIndex-prop">setCurrentIndex</a>（）。

source: Calls <a href="qdatawidgetmapper#currentIndex-prop">setCurrentIndex</a>() internally. Does nothing if there is no next row in the model.
zh_cn: 内部调用<a href="qdatawidgetmapper#currentIndex-prop">setCurrentIndex</a>（）。如果模型中没有下一行，则不执行任何操作。

source: Calls <a href="qdatawidgetmapper#currentIndex-prop">setCurrentIndex</a>() internally. Does nothing if there is no previous row in the model.
zh_cn: 内部调用<a href="qdatawidgetmapper#currentIndex-prop">setCurrentIndex</a>（）。如果模型中没有上一行，则不执行任何操作。

source: Calls <a href="qdatawidgetmapper#currentIndex-prop">setCurrentIndex</a>() internally. This convenience slot can be connected to the signal <a href="qitemselectionmodel#currentRowChanged">currentRowChanged()</a> or <a href="qitemselectionmodel#currentColumnChanged">currentColumnChanged()</a> of another view's <a href="qitemselectionmodel">selection model</a>.
zh_cn: 内部调用<a href="qdatawidgetmapper#currentIndex-prop">setCurrentIndex</a>（）。该便捷插槽可以连接到另一个视图的<a href="qitemselectionmodel">选择模型</a>的信号<a href="qitemselectionmodel#currentRowChanged">currentRowChanged（）</a>或<a href="qitemselectionmodel#currentColumnChanged">currentColumnChanged（）</a>。

source: Calls <a href="qevent#accept">QDropEvent::accept</a>().
zh_cn: 调用<a href="qevent#accept">QDropEvent :: accept</a>（）。

source: Calls <a href="qevent#ignore">QDropEvent::ignore</a>().
zh_cn: 调用<a href="qevent#ignore">QDropEvent :: ignore</a>（）。

source: Calls <a href="qfiledevice#flush">QFileDevice::flush</a>() and closes the file. Errors from flush are ignored.
zh_cn: 调用<a href="qfiledevice#flush">QFileDevice :: flush</a>（）并关闭文件。刷新产生的错误将被忽略。

source: Calls <a href="qfuturesynchronizer#waitForFinished">waitForFinished</a>() function to ensure that all futures have finished before destroying this <a href="qfuturesynchronizer">QFutureSynchronizer</a>.
zh_cn: 调用<a href="qfuturesynchronizer#waitForFinished">waitForFinished</a>（）函数以确保在销毁此<a href="qfuturesynchronizer">QFutureSynchronizer</a>之前所有期货均已完成。

source: Calls <a href="qlcdnumber#mode-prop">setMode</a>(Bin). Provided for convenience (e.g. for connecting buttons to it).
zh_cn: 调用<a href="qlcdnumber#mode-prop">setMode</a>（Bin）。为方便起见（例如用于将按钮连接到它）。

source: Calls <a href="qlcdnumber#mode-prop">setMode</a>(Dec). Provided for convenience (e.g. for connecting buttons to it).
zh_cn: 调用<a href="qlcdnumber#mode-prop">setMode</a>（Dec）。为方便起见（例如用于将按钮连接到它）。

source: Calls <a href="qlcdnumber#mode-prop">setMode</a>(Hex). Provided for convenience (e.g. for connecting buttons to it).
zh_cn: 调用<a href="qlcdnumber#mode-prop">setMode</a>（Hex）。为方便起见（例如用于将按钮连接到它）。

source: Calls <a href="qlcdnumber#mode-prop">setMode</a>(Oct). Provided for convenience (e.g. for connecting buttons to it).
zh_cn: 调用<a href="qlcdnumber#mode-prop">setMode</a>（Oct）。为方便起见（例如用于将按钮连接到它）。

source: Calls <a href="qsensorgesturerecognizer#create">QSensorGestureRecognizer::create</a>() if the recognizer is valid.
zh_cn: 如果识别器有效，则调用<a href="qsensorgesturerecognizer#create">QSensorGestureRecognizer :: create</a>（）。

source: Calls <a href="qsensorgesturerecognizer#start">QSensorGestureRecognizer::start</a>() if the recognizer isn't already initialized. This is called by the <a href="qsensorgesture">QSensorGesture</a> object, so please use that instead.
zh_cn: 如果识别器尚未初始化，则调用<a href="qsensorgesturerecognizer#start">QSensorGestureRecognizer :: start</a>（）。这由<a href="qsensorgesture">QSensorGesture</a>对象调用，因此请改用它。

source: Calls <a href="qsensorgesturerecognizer#stop">QSensorGestureRecognizer::stop</a>() if no other clients are using it. This is called by the <a href="qsensorgesture">QSensorGesture</a> object, so please use that instead.
zh_cn: 如果没有其他客户<a href="qsensorgesturerecognizer#stop">端正</a>在使用QSensorGestureRecognizer :: stop（），则调用它。这由<a href="qsensorgesture">QSensorGesture</a>对象调用，因此请改用它。

source: Calls <a href="qtextstream#flush">QTextStream::flush</a>() on
zh_cn: 调用<a href="qtextstream#flush">QTextStream :: flush</a>（）

source: Calls <a href="qtextstream#reset">QTextStream::reset</a>() on
zh_cn: 调用<a href="qtextstream#reset">QTextStream :: reset</a>（）

source: Calls <a href="qtextstream#setFieldAlignment">QTextStream::setFieldAlignment</a>(<a href="qtextstream#FieldAlignment-enum">QTextStream::AlignCenter</a>) on
zh_cn: 在以下位置调用<a href="qtextstream#setFieldAlignment">QTextStream :: setFieldAlignment</a>（<a href="qtextstream#FieldAlignment-enum">QTextStream :: AlignCenter</a>）

source: Calls <a href="qtextstream#setFieldAlignment">QTextStream::setFieldAlignment</a>(<a href="qtextstream#FieldAlignment-enum">QTextStream::AlignLeft</a>) on
zh_cn: 调用<a href="qtextstream#setFieldAlignment">QTextStream :: setFieldAlignment</a>（<a href="qtextstream#FieldAlignment-enum">QTextStream :: AlignLeft</a>）

source: Calls <a href="qtextstream#setFieldAlignment">QTextStream::setFieldAlignment</a>(<a href="qtextstream#FieldAlignment-enum">QTextStream::AlignRight</a>) on
zh_cn: 调用<a href="qtextstream#setFieldAlignment">QTextStream :: setFieldAlignment</a>（<a href="qtextstream#FieldAlignment-enum">QTextStream :: AlignRight</a>）

source: Calls <a href="qtextstream#setIntegerBase">QTextStream::setIntegerBase</a>(10) on
zh_cn: 调用<a href="qtextstream#setIntegerBase">QTextStream :: setIntegerBase</a>（10）

source: Calls <a href="qtextstream#setIntegerBase">QTextStream::setIntegerBase</a>(16) on
zh_cn: 调用<a href="qtextstream#setIntegerBase">QTextStream :: setIntegerBase</a>（16）

source: Calls <a href="qtextstream#setIntegerBase">QTextStream::setIntegerBase</a>(2) on
zh_cn: 调用<a href="qtextstream#setIntegerBase">QTextStream :: setIntegerBase</a>（2）

source: Calls <a href="qtextstream#setIntegerBase">QTextStream::setIntegerBase</a>(8) on
zh_cn: 调用<a href="qtextstream#setIntegerBase">QTextStream :: setIntegerBase</a>（8）

source: Calls <a href="qtextstream#setNumberFlags">QTextStream::setNumberFlags</a>(<a href="qtextstream#numberFlags">QTextStream::numberFlags</a>() &amp; ~<a href="qtextstream#NumberFlag-enum">QTextStream::ForcePoint</a>) on
zh_cn: 调用<a href="qtextstream#setNumberFlags">QTextStream :: setNumberFlags</a>（<a href="qtextstream#numberFlags">QTextStream :: numberFlags</a>（）＆<a href="qtextstream#NumberFlag-enum">〜QTextStream :: ForcePoint</a>）

source: Calls <a href="qtextstream#setNumberFlags">QTextStream::setNumberFlags</a>(<a href="qtextstream#numberFlags">QTextStream::numberFlags</a>() &amp; ~<a href="qtextstream#NumberFlag-enum">QTextStream::ForceSign</a>) on
zh_cn: 调用<a href="qtextstream#setNumberFlags">QTextStream :: setNumberFlags</a>（<a href="qtextstream#numberFlags">QTextStream :: numberFlags</a>（）＆<a href="qtextstream#NumberFlag-enum">〜QTextStream :: ForceSign</a>）

source: Calls <a href="qtextstream#setNumberFlags">QTextStream::setNumberFlags</a>(<a href="qtextstream#numberFlags">QTextStream::numberFlags</a>() &amp; ~<a href="qtextstream#NumberFlag-enum">QTextStream::ShowBase</a>) on
zh_cn: 调用<a href="qtextstream#setNumberFlags">QTextStream :: setNumberFlags</a>（<a href="qtextstream#numberFlags">QTextStream :: numberFlags</a>（）＆<a href="qtextstream#NumberFlag-enum">〜QTextStream :: ShowBase</a>）

source: Calls <a href="qtextstream#setNumberFlags">QTextStream::setNumberFlags</a>(<a href="qtextstream#numberFlags">QTextStream::numberFlags</a>() &amp; ~<a href="qtextstream#NumberFlag-enum">QTextStream::UppercaseBase</a>) on
zh_cn: 调用<a href="qtextstream#setNumberFlags">QTextStream :: setNumberFlags</a>（<a href="qtextstream#numberFlags">QTextStream :: numberFlags</a>（）＆〜QTextStream <a href="qtextstream#NumberFlag-enum">:: UppercaseBase</a>）

source: Calls <a href="qtextstream#setNumberFlags">QTextStream::setNumberFlags</a>(<a href="qtextstream#numberFlags">QTextStream::numberFlags</a>() &amp; ~<a href="qtextstream#NumberFlag-enum">QTextStream::UppercaseDigits</a>) on
zh_cn: 调用<a href="qtextstream#setNumberFlags">QTextStream :: setNumberFlags</a>（<a href="qtextstream#numberFlags">QTextStream :: numberFlags</a>（）＆〜QTextStream <a href="qtextstream#NumberFlag-enum">:: UppercaseDigits</a>）

source: Calls <a href="qtextstream#setNumberFlags">QTextStream::setNumberFlags</a>(<a href="qtextstream#numberFlags">QTextStream::numberFlags</a>() | <a href="qtextstream#NumberFlag-enum">QTextStream::ForcePoint</a>) on
zh_cn: 调用<a href="qtextstream#setNumberFlags">QTextStream :: setNumberFlags</a>（<a href="qtextstream#numberFlags">QTextStream :: numberFlags</a>（）| <a href="qtextstream#NumberFlag-enum">QTextStream :: ForcePoint</a>）

source: Calls <a href="qtextstream#setNumberFlags">QTextStream::setNumberFlags</a>(<a href="qtextstream#numberFlags">QTextStream::numberFlags</a>() | <a href="qtextstream#NumberFlag-enum">QTextStream::ForceSign</a>) on
zh_cn: 调用<a href="qtextstream#setNumberFlags">QTextStream :: setNumberFlags</a>（<a href="qtextstream#numberFlags">QTextStream :: numberFlags</a>（）| <a href="qtextstream#NumberFlag-enum">QTextStream :: ForceSign</a>）

source: Calls <a href="qtextstream#setNumberFlags">QTextStream::setNumberFlags</a>(<a href="qtextstream#numberFlags">QTextStream::numberFlags</a>() | <a href="qtextstream#NumberFlag-enum">QTextStream::ShowBase</a>) on
zh_cn: 调用<a href="qtextstream#setNumberFlags">QTextStream :: setNumberFlags</a>（<a href="qtextstream#numberFlags">QTextStream :: numberFlags</a>（）| <a href="qtextstream#NumberFlag-enum">QTextStream :: ShowBase</a>）

source: Calls <a href="qtextstream#setNumberFlags">QTextStream::setNumberFlags</a>(<a href="qtextstream#numberFlags">QTextStream::numberFlags</a>() | <a href="qtextstream#NumberFlag-enum">QTextStream::UppercaseBase</a>) on
zh_cn: 调用<a href="qtextstream#setNumberFlags">QTextStream :: setNumberFlags</a>（<a href="qtextstream#numberFlags">QTextStream :: numberFlags</a>（）| <a href="qtextstream#NumberFlag-enum">QTextStream :: UppercaseBase</a>）

source: Calls <a href="qtextstream#setNumberFlags">QTextStream::setNumberFlags</a>(<a href="qtextstream#numberFlags">QTextStream::numberFlags</a>() | <a href="qtextstream#NumberFlag-enum">QTextStream::UppercaseDigits</a>) on
zh_cn: 调用<a href="qtextstream#setNumberFlags">QTextStream :: setNumberFlags</a>（<a href="qtextstream#numberFlags">QTextStream :: numberFlags</a>（）| <a href="qtextstream#NumberFlag-enum">QTextStream :: UppercaseDigits</a>）

source: Calls <a href="qtextstream#setRealNumberNotation">QTextStream::setRealNumberNotation</a>(<a href="qtextstream#RealNumberNotation-enum">QTextStream::FixedNotation</a>) on
zh_cn: 调用<a href="qtextstream#setRealNumberNotation">QTextStream :: setRealNumberNotation</a>（<a href="qtextstream#RealNumberNotation-enum">QTextStream :: FixedNotation</a>）

source: Calls <a href="qtextstream#setRealNumberNotation">QTextStream::setRealNumberNotation</a>(<a href="qtextstream#RealNumberNotation-enum">QTextStream::ScientificNotation</a>) on
zh_cn: 调用<a href="qtextstream#setRealNumberNotation">QTextStream :: setRealNumberNotation</a>（<a href="qtextstream#RealNumberNotation-enum">QTextStream :: ScientificNotation</a>）

source: Calls <a href="qtextstream#skipWhiteSpace">skipWhiteSpace()</a> on
zh_cn: 调用<a href="qtextstream#skipWhiteSpace">skipWhiteSpace（）</a>上

source: Calls <a href="qundostack#redo">QUndoStack::redo</a>() on the active stack.
zh_cn: 在活动堆栈上调用<a href="qundostack#redo">QUndoStack :: redo</a>（）。

source: Calls <a href="qundostack#undo">QUndoStack::undo</a>() on the active stack.
zh_cn: 在活动堆栈上调用<a href="qundostack#undo">QUndoStack :: undo</a>（）。

source: Calls QTextStream::flush() on
zh_cn: 调用QTextStream::flush(),在出现以下情况时,调用QTextStream::flush()。

source: Calls QTextStream::reset() on
zh_cn: 调用QTextStream::reset()对

source: Calls are usually placed by using the <a href="qdbusabstractinterface#call">call</a>() function, which constructs the message, sends it over the bus, waits for the reply and decodes the reply. Signals are connected to by using the normal <a href="qobject#connect">QObject::connect</a>() function. Finally, properties are accessed using the <a href="qobject#property">QObject::property</a>() and <a href="qobject#setProperty">QObject::setProperty</a>() functions.
zh_cn: 通常通过使用<a href="qdbusabstractinterface#call">call</a>（）函数来放置呼叫，该函数构造消息，通过总线发送消息，等待答复并解码答复。通过使用常规的<a href="qobject#connect">QObject :: connect</a>（）函数将信号连接到。最后，使用<a href="qobject#property">QObject :: property</a>（）和<a href="qobject#setProperty">QObject :: setProperty</a>（）函数访问属性。
