Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/qt/qt.*.123.xlf
Languages: es, ko, zh_cn

source: Caching is enabled for the item's logical (local) coordinate system. <a href="qgraphicsitem">QGraphicsItem</a> creates an off-screen pixel buffer with a configurable size / resolution that you can pass to <a href="qgraphicsitem#setCacheMode">QGraphicsItem::setCacheMode</a>(). Rendering quality will typically degrade, depending on the resolution of the cache and the item transformation. The first time the item is redrawn, it will render itself into the cache, and the cache is then reused for every subsequent expose. The cache is also reused as the item is transformed. To adjust the resolution of the cache, you can call <a href="qgraphicsitem#setCacheMode">setCacheMode</a>() again.
zh_cn: 为项目的逻辑（本地）坐标系启用了缓存。<a href="qgraphicsitem">QGraphicsItem</a>创建一个具有可配置大小/分辨率的屏幕外像素缓冲区，您可以将其传递给<a href="qgraphicsitem#setCacheMode">QGraphicsItem :: setCacheMode</a>（）。呈现质量通常会下降，具体取决于缓存的分辨率和项目转换。第一次重画该项目时，它将自身呈现到高速缓存中，然后对于以后的每个暴露都重新使用高速缓存。随着项目的转换，缓存也被重用。要调整缓存的分辨率，可以再次调用<a href="qgraphicsitem#setCacheMode">setCacheMode</a>（）。

source: Caching is strongly recommended; without it layout will take exponential time.
zh_cn: 强烈建议使用缓存,如果不使用缓存,布局将花费指数级的时间。

source: Caching-only HTTP
zh_cn: 纯缓存的HTTP

source: Calculates a 3x3 matrix suitable as the input to <a href="qopengltextureblitter#blit">blit</a>(). This is used when only a part of the texture is to be used in the blit.
zh_cn: 计算适合作为<a href="qopengltextureblitter#blit">blit</a>（）输入的3x3矩阵。当在blit中仅使用纹理的一部分时，将使用此选项。

source: Calculates a target transform suitable for <a href="qopengltextureblitter#blit">blit</a>().
zh_cn: 计算适用于<a href="qopengltextureblitter#blit">blit</a>（）的目标转换。

source: Calculates and returns the bounding rect of all items on the scene. This function works by iterating over all items, and because of this, it can be slow for large scenes.
zh_cn: 计算并返回场景中所有项目的边界矩形。这个函数的工作方式是遍历所有项目,因此,对于大场景来说,它可能会很慢。

source: Calculates diffuse sample for the light probe. The return value is 4-component rgba vector.
zh_cn: 计算光探针的漫射样本。返回值为4分量rgba向量。

source: Calculates roll, pitch, and yaw Euler angles (in degrees) that corresponds to this quaternion.
zh_cn: 计算与该四元数对应的滚动、俯仰和偏航欧拉角(度数)。

source: Calculates specular sample for the light probe. The return value is 4-component rgba vector.
zh_cn: 计算光探针的镜面样品。返回值为4分量rgba向量。

source: Calculates the expected data size for
zh_cn: 计算以下数据的预期大小

source: Calculates the tangents and bitangents for the imported meshes.
zh_cn: 计算导入网格的切线和位切线。

source: Calculating a value per vertex (for example, assuming a single triangle, for the 3 corners of the triangle), and then passing it on to the fragment stage, where for each fragment (for example, every fragment covered by the rasterized triangle) an interpolated value is made accessible. In custom material shader snippets this is made possible by the <code>VARYING</code> keyword. This provides a syntax similar to GLSL 120 and GLSL ES 100, but will work regardless of the graphics API used at run time. The engine will take care of rewriting the varying declaration as appropriate.
zh_cn: 计算每个顶点的值（例如，假设单个三角形，三角形的三个角），然后将其传递到片段阶段，其中对于每个片段（例如，栅格化三角形覆盖的每个片段），插值可访问。在自定义材质着色器片段中，这可以通过 <code>VARYING</code> 关键字来实现。这提供了类似于GLSL 120和GLSL ES 100的语法，但是不管运行时使用的图形API是什么，都可以使用。引擎将负责适当地重写变化的声明。

source: Calculating gradients can be computationally expensive compared to the use of solid color fills or images. Consider using gradients for static items in a user interface.
zh_cn: 与使用纯色填充或图像相比,计算渐变的成本很高。考虑对用户界面中的静态项目使用渐变。

source: Calculating text layouts can be a slow operation. Consider using the <code>PlainText</code> format instead of <code>StyledText</code> wherever possible, as this reduces the amount of work required of the layout engine. If you cannot use <code>PlainText</code> (as you need to embed images, or use tags to specify ranges of characters to have certain formatting (bold, italic, etc) as opposed to the entire text) then you should use <code>StyledText</code>.
zh_cn: 计算文本布局可能是一个缓慢的操作。考虑尽可能使用 <code>PlainText</code> 格式而不是 <code>StyledText</code> ，因为这会减少布局引擎所需的工作量。如果您不能使用 <code>PlainText</code> （因为您需要嵌入图像，或使用标签来指定字符范围以具有与整个文本相对的某些格式（粗体，斜体等）），则应使用 <code>StyledText</code> 。

source: Calculator Example
zh_cn: 计算器示例

source: Calendar (QML type)
zh_cn: 日历(QML类型)

source: Calendar Example
zh_cn: 日历示例

source: Calendar Organization
zh_cn: 日历组织

source: Calendar QML Type
zh_cn: 日历QML类型

source: Calendar Widget Example
zh_cn: 日历小工具示例

source: Calendar Widget example on <a href="internationalization#macos">macOS</a>
zh_cn: <a href="internationalization#macos">macOS</a>上的Calendar Widget示例

source: Calendar Widget example on Windows 10
zh_cn: Windows 10上的日历小工具示例

source: Calendar Widget example on macOS
zh_cn: MacOS上的日历小工具示例

source: Calendar allows selection of dates from a grid of days, similar to <a href="qcalendarwidget">QCalendarWidget</a>.
zh_cn: 日历允许从几天的网格中选择日期，类似于<a href="qcalendarwidget">QCalendarWidget</a>。

source: CalendarModel (QML type)
zh_cn: 日历模型(QML类型)

source: CalendarModel QML Type
zh_cn: CalendarModel QML类型

source: CalendarModel provides a way of creating a range of <a href="qml-qt-labs-calendar-monthgrid">MonthGrid</a> instances. It is typically used as a model for a <a href="qml-qtquick-listview">ListView</a> that uses <a href="qml-qt-labs-calendar-monthgrid">MonthGrid</a> as a delegate.
zh_cn: CalendarModel提供了一种创建一系列<a href="qml-qt-labs-calendar-monthgrid">MonthGrid</a>实例的方法。它通常用作使用<a href="qml-qt-labs-calendar-monthgrid">MonthGrid</a>作为委托的<a href="qml-qtquick-listview">ListView</a>的模型。

source: CalendarStyle (QML type)
zh_cn: 日历样式(QML类型

source: CalendarStyle QML Type
zh_cn: 日历样式 QML类型

source: Calendars based on the ancient Roman calendar share the names of months, whose lengths depend in a common way on whether the year is a leap year. They differ in how they determine which years are leap years.
zh_cn: 以古罗马历为基础的历法都有相同的月份名称,其长度共同取决于该年是否为闰年。它们的不同之处在于如何确定哪些年份是闰年。

source: Calibrate the tilt sensor.
zh_cn: 校准倾斜传感器。

source: Calibrates the tilt sensor. Uses the current tilt angles as 0.
zh_cn: 校准倾斜传感器。使用当前的倾斜角度为0。

source: Call <a href="qabstractitemmodel#changePersistentIndex">changePersistentIndex</a>()
zh_cn: 呼叫<a href="qabstractitemmodel#changePersistentIndex">changePersistentIndex</a>（）

source: Call <a href="qabstracttextdocumentlayout#registerHandler">QAbstractTextDocumentLayout::registerHandler</a>() with an instance of your <a href="qtextobjectinterface">QTextObjectInterface</a> subclass to register your object type.
zh_cn: 使用您的<a href="qtextobjectinterface">QTextObjectInterface</a>子类的实例调用<a href="qabstracttextdocumentlayout#registerHandler">QAbstractTextDocumentLayout :: registerHandler</a>（）以注册您的对象类型。

source: Call <a href="qabstracttextdocumentlayout#registerHandler">QAbstractTextDocumentLayout::registerHandler</a>() with an instance of your QTextObjectInterface subclass to register your object type.
zh_cn: 使用您的QTextObjectInterface子类的实例调用<a href="qabstracttextdocumentlayout#registerHandler">QAbstractTextDocumentLayout :: registerHandler</a>（）以注册您的对象类型。

source: Call <a href="qbuffer#open">open</a>() to open the buffer. Then call <a href="qiodevice#write">write</a>() or <a href="qiodevice#putChar">putChar</a>() to write to the buffer, and <a href="qiodevice#read">read</a>(), <a href="qiodevice#readLine">readLine</a>(), <a href="qiodevice#readAll">readAll</a>(), or <a href="qiodevice#getChar">getChar</a>() to read from it. <a href="qbuffer#size">size</a>() returns the current size of the buffer, and you can seek to arbitrary positions in the buffer by calling <a href="qbuffer#seek">seek</a>(). When you are done with accessing the buffer, call <a href="qbuffer#close">close</a>().
zh_cn: 调用<a href="qbuffer#open">open</a>（）打开缓冲区。然后调用<a href="qiodevice#write">write</a>（）或<a href="qiodevice#putChar">putChar</a>（）写入缓冲区，并<a href="qiodevice#read">读取</a>（），<a href="qiodevice#readLine">readLine</a>（），<a href="qiodevice#readAll">readAll</a>（）或<a href="qiodevice#getChar">getChar</a>（）来读取缓冲区。<a href="qbuffer#size">size</a>（）返回缓冲区的当前大小，您可以通过调用<a href="qbuffer#seek">seek</a>（）在缓冲区中查找任意位置。完成访问缓冲区后，请调用<a href="qbuffer#close">close</a>（）。

source: Call <a href="qcborstreamreader#addData">addData</a>() to add more data to be parsed.
zh_cn: 调用<a href="qcborstreamreader#addData">addData</a>（）添加更多要解析的数据。

source: Call <a href="qcommandlineparser#value">QCommandLineParser::value</a>() if you expect the option to be present only once, and <a href="qcommandlineparser#values">QCommandLineParser::values</a>() if you expect that option to be present multiple times.
zh_cn: 如果您希望该选项仅出现一次，则调用<a href="qcommandlineparser#value">QCommandLineParser :: value</a>（）；如果您希望该选项多次出现，则<a href="qcommandlineparser#values">调用QCommandLineParser :: values</a>（）。

source: Call <a href="qdialog#exec">QPrintPreviewDialog::exec</a>() to show the preview dialog.
zh_cn: 调用<a href="qdialog#exec">QPrintPreviewDialog :: exec</a>（）以显示预览对话框。

source: Call <a href="qdialog#exec">exec</a>().
zh_cn: 调用<a href="qdialog#exec">exec</a>（）。

source: Call <a href="qfilesystemwatcher#addPath">addPath</a>() to watch a particular file or directory. Multiple paths can be added using the <a href="qfilesystemwatcher#addPaths">addPaths</a>() function. Existing paths can be removed by using the <a href="qfilesystemwatcher#removePath">removePath</a>() and <a href="qfilesystemwatcher#removePaths">removePaths</a>() functions.
zh_cn: 调用<a href="qfilesystemwatcher#addPath">addPath</a>（）来监视特定的文件或目录。可以使用<a href="qfilesystemwatcher#addPaths">addPaths</a>（）函数添加多个路径。可以使用<a href="qfilesystemwatcher#removePath">removePath</a>（）和<a href="qfilesystemwatcher#removePaths">removePaths</a>（）函数删除现有路径。

source: Call <a href="qfontcombobox#writingSystem-prop">setWritingSystem</a>() to tell <a href="qfontcombobox">QFontComboBox</a> to show only fonts that support a given writing system, and <a href="qfontcombobox#fontFilters-prop">setFontFilters</a>() to filter out certain types of fonts as e.g. non scalable fonts or monospaced fonts.
zh_cn: 调用<a href="qfontcombobox#writingSystem-prop">setWritingSystem</a>（）告诉<a href="qfontcombobox">QFontComboBox</a>仅显示支持给定书写系统的字体，并<a href="qfontcombobox#fontFilters-prop">调用setFontFilters</a>（）过滤掉某些类型的字体，例如不可缩放的字体或等宽字体。

source: Call <a href="qfontcombobox#writingSystem-prop">setWritingSystem</a>() to tell QFontComboBox to show only fonts that support a given writing system, and <a href="qfontcombobox#fontFilters-prop">setFontFilters</a>() to filter out certain types of fonts as e.g. non scalable fonts or monospaced fonts.
zh_cn: 调用<a href="qfontcombobox#writingSystem-prop">setWritingSystem</a>（）告诉QFontComboBox仅显示支持给定书写系统的字体，并<a href="qfontcombobox#fontFilters-prop">调用setFontFilters</a>（）过滤掉某些类型的字体，例如不可缩放的字体或等宽字体。

source: Call <a href="qgeosatelliteinfosource#startUpdates">startUpdates</a>() and <a href="qgeosatelliteinfosource#stopUpdates">stopUpdates</a>() to start and stop regular updates, or <a href="qgeosatelliteinfosource#requestUpdate">requestUpdate</a>() to request a single update. When an update is available, <a href="qgeosatelliteinfosource#satellitesInViewUpdated">satellitesInViewUpdated</a>() and/or <a href="qgeosatelliteinfosource#satellitesInUseUpdated">satellitesInUseUpdated</a>() will be emitted.
zh_cn: 调用<a href="qgeosatelliteinfosource#startUpdates">startUpdates</a>（）和<a href="qgeosatelliteinfosource#stopUpdates">stopUpdates</a>（）以启动和停止常规更新，或调用<a href="qgeosatelliteinfosource#requestUpdate">requestUpdate</a>（）以请求单个更新。当有可用更新时，将发出<a href="qgeosatelliteinfosource#satellitesInViewUpdated">satellitesInViewUpdated</a>（）和/或<a href="qgeosatelliteinfosource#satellitesInUseUpdated">satellitesInUseUpdated</a>（）。

source: Call <a href="qhashiterator#key">key</a>() on the return value to obtain the item's key, and <a href="qhashiterator#value">value</a>() to obtain the value.
zh_cn: 调用返回值上的<a href="qhashiterator#key">key</a>（）获取项目的键，并调用<a href="qhashiterator#value">value</a>（）获得该值。

source: Call <a href="qimageiohandler#setDevice">setDevice</a>() to assign a device to the handler, and <a href="qimageiohandler#setFormat">setFormat</a>() to assign a format to it. One <a href="qimageiohandler">QImageIOHandler</a> may support more than one image format. <a href="qimageiohandler#canRead">canRead</a>() returns <code>true</code> if an image can be read from the device, and <a href="qimageiohandler#read">read</a>() and <a href="qimageiohandler#write">write</a>() return true if reading or writing an image was completed successfully.
zh_cn: 调用<a href="qimageiohandler#setDevice">setDevice</a>（）将设备分配给处理程序，并调用<a href="qimageiohandler#setFormat">setFormat</a>（）为其分配格式。一个<a href="qimageiohandler">QImageIOHandler</a>可能支持不止一种图像格式。如果可以从设备读取图像，则<a href="qimageiohandler#canRead">canRead</a>（）返回 <code>true</code> ;如果读取或写入图像成功完成，则<a href="qimageiohandler#read">read</a>（）和<a href="qimageiohandler#write">write</a>（）返回true。

source: Call <a href="qimageiohandler#setDevice">setDevice</a>() to assign a device to the handler, and <a href="qimageiohandler#setFormat">setFormat</a>() to assign a format to it. One QImageIOHandler may support more than one image format. <a href="qimageiohandler#canRead">canRead</a>() returns <code>true</code> if an image can be read from the device, and <a href="qimageiohandler#read">read</a>() and <a href="qimageiohandler#write">write</a>() return true if reading or writing an image was completed successfully.
zh_cn: 调用<a href="qimageiohandler#setDevice">setDevice</a>（）将设备分配给处理程序，并调用<a href="qimageiohandler#setFormat">setFormat</a>（）为其分配格式。一个QImageIOHandler可能支持不止一种图像格式。如果可以从设备读取图像，则<a href="qimageiohandler#canRead">canRead</a>（）返回 <code>true</code> ;如果读取或写入图像成功完成，则<a href="qimageiohandler#read">read</a>（）和<a href="qimageiohandler#write">write</a>（）返回true。

source: Call <a href="qimagereader#supportedImageFormats">supportedImageFormats</a>() for a list of formats that <a href="qimagereader">QImageReader</a> can read. <a href="qimagereader">QImageReader</a> supports all built-in image formats, in addition to any image format plugins that support reading. Call <a href="qimagereader#supportedMimeTypes">supportedMimeTypes</a>() to obtain a list of supported MIME types, which for example can be passed to <a href="qfiledialog#setMimeTypeFilters">QFileDialog::setMimeTypeFilters</a>().
zh_cn: 调用<a href="qimagereader#supportedImageFormats">supportedImageFormats</a>（）获取<a href="qimagereader">QImageReader</a>可以读取的格式列表。除了支持阅读的任何图像格式插件外，<a href="qimagereader">QImageReader还</a>支持所有内置图像格式。调用<a href="qimagereader#supportedMimeTypes">supportedMimeTypes</a>（）以获取受支持的MIME类型的列表，例如，可以将其传递给<a href="qfiledialog#setMimeTypeFilters">QFileDialog :: setMimeTypeFilters</a>（）。

source: Call <a href="qimagereader#supportedImageFormats">supportedImageFormats</a>() for a list of formats that QImageReader can read. QImageReader supports all built-in image formats, in addition to any image format plugins that support reading. Call <a href="qimagereader#supportedMimeTypes">supportedMimeTypes</a>() to obtain a list of supported MIME types, which for example can be passed to <a href="qfiledialog#setMimeTypeFilters">QFileDialog::setMimeTypeFilters</a>().
zh_cn: 调用<a href="qimagereader#supportedImageFormats">supportedImageFormats</a>（）获取QImageReader可以读取的格式列表。除了支持阅读的任何图像格式插件外，QImageReader还支持所有内置图像格式。调用<a href="qimagereader#supportedMimeTypes">supportedMimeTypes</a>（）以获取受支持的MIME类型的列表，例如，可以将其传递给<a href="qfiledialog#setMimeTypeFilters">QFileDialog :: setMimeTypeFilters</a>（）。

source: Call <a href="qimagewriter#supportedImageFormats">supportedImageFormats</a>() for a list of formats that <a href="qimagewriter">QImageWriter</a> can write. <a href="qimagewriter">QImageWriter</a> supports all built-in image formats, in addition to any image format plugins that support writing.
zh_cn: 调用<a href="qimagewriter#supportedImageFormats">supportedImageFormats</a>（）获取<a href="qimagewriter">QImageWriter</a>可以写入的格式列表。除了支持书写的任何图像格式插件外，<a href="qimagewriter">QImageWriter还</a>支持所有内置图像格式。

source: Call <a href="qimagewriter#supportedImageFormats">supportedImageFormats</a>() for a list of formats that QImageWriter can write. QImageWriter supports all built-in image formats, in addition to any image format plugins that support writing.
zh_cn: 调用<a href="qimagewriter#supportedImageFormats">supportedImageFormats</a>（）获取QImageWriter可以写入的格式列表。除了支持书写的任何图像格式插件外，QImageWriter还支持所有内置图像格式。

source: Call <a href="qlocalserver#listen">listen</a>() to have the server start listening for incoming connections on a specified key. The <a href="qlocalserver#newConnection">newConnection</a>() signal is then emitted each time a client connects to the server.
zh_cn: 调用<a href="qlocalserver#listen">listen</a>（）以使服务器开始侦听指定键上的传入连接。所述<a href="qlocalserver#newConnection">newConnection</a>（）信号然后每个客户端连接到服务器时发射。

source: Call <a href="qlocalserver#nextPendingConnection">nextPendingConnection</a>() to accept the pending connection as a connected <a href="qlocalsocket">QLocalSocket</a>. The function returns a pointer to a <a href="qlocalsocket">QLocalSocket</a> that can be used for communicating with the client.
zh_cn: 调用<a href="qlocalserver#nextPendingConnection">nextPendingConnection</a>（）以接受挂起的连接作为已连接的<a href="qlocalsocket">QLocalSocket</a>。该函数返回一个指向<a href="qlocalsocket">QLocalSocket</a>的指针，该指针可用于与客户端进行通信。

source: Call <a href="qmapiterator#key">key</a>() on the return value to obtain the item's key, and <a href="qmapiterator#value">value</a>() to obtain the value.
zh_cn: 调用返回值上的<a href="qmapiterator#key">key</a>（）获取项目的键，并调用<a href="qmapiterator#value">value</a>（）获得该值。

source: Call <a href="qmessagebox#setEscapeButton">setEscapeButton</a>() instead.
zh_cn: 调用<a href="qmessagebox#setEscapeButton">setEscapeButton</a>（）代替。

source: Call <a href="qmetatype#qRegisterMetaType-1">qRegisterMetaType</a>() to register the data type before you establish the connection.
zh_cn: 建立连接之前，请调用<a href="qmetatype#qRegisterMetaType-1">qRegisterMetaType</a>（）以注册数据类型。

source: Call <a href="qml-qtqml-component#createObject-method">Component.createObject()</a> on the returned component to create an object instance of the component.
zh_cn: 在返回的组件上调用<a href="qml-qtqml-component#createObject-method">Component.createObject（）</a>以创建该组件的对象实例。

source: Call <a href="qmovie#supportedFormats">supportedFormats</a>() for a list of formats that <a href="qmovie">QMovie</a> supports.
zh_cn: 呼叫<a href="qmovie#supportedFormats">supportedFormats</a>（）为格式列表<a href="qmovie">QMovie</a>支持。

source: Call <a href="qmovie#supportedFormats">supportedFormats</a>() for a list of formats that QMovie supports.
zh_cn: 呼叫<a href="qmovie#supportedFormats">supportedFormats</a>（）为格式QMovie支持列表。

source: Call <a href="qmultimapiterator#key">key</a>() on the return value to obtain the item's key, and <a href="qmultimapiterator#value">value</a>() to obtain the value.
zh_cn: 调用返回值上的<a href="qmultimapiterator#key">key</a>（）获取项的键，并调用<a href="qmultimapiterator#value">value</a>（）获得该值。

source: Call <a href="qmutablehashiterator#key">key</a>() on the return value to obtain the item's key, and <a href="qmutablehashiterator#value">value</a>() to obtain the value.
zh_cn: 调用返回值上的<a href="qmutablehashiterator#key">key</a>（）获取项目的键，并调用<a href="qmutablehashiterator#value">value</a>（）获得该值。

source: Call <a href="qmutablemapiterator#key">key</a>() on the return value to obtain the item's key, and <a href="qmutablemapiterator#value">value</a>() to obtain the value.
zh_cn: 调用返回值上的<a href="qmutablemapiterator#key">key</a>（）获取项目的键，并调用<a href="qmutablemapiterator#value">value</a>（）获得该值。

source: Call <a href="qmutablemultimapiterator#key">key</a>() on the return value to obtain the item's key, and <a href="qmutablemultimapiterator#value">value</a>() to obtain the value.
zh_cn: 调用返回值上的<a href="qmutablemultimapiterator#key">key</a>（）获取项的键，并调用<a href="qmutablemultimapiterator#value">value</a>（）获得该值。

source: Call <a href="qoffscreensurface#destroy">destroy</a>() to free the platform resources if necessary.
zh_cn: 如有必要，调用<a href="qoffscreensurface#destroy">destroy</a>（）释放平台资源。

source: Call <a href="qsettings#endGroup">endGroup</a>() to reset the current group to what it was before the corresponding beginGroup() call. Groups can be nested.
zh_cn: 调用<a href="qsettings#endGroup">endGroup</a>（）以将当前组重置为相应的beginGroup（）调用之前的状态。组可以嵌套。

source: Call <a href="qsqldatabase#lastError">lastError</a>() to get information about errors.
zh_cn: 调用<a href="qsqldatabase#lastError">lastError</a>（）以获取有关错误的信息。

source: Call <a href="qstandarditemmodel#clear">clear</a>() to remove all items from the model.
zh_cn: 调用<a href="qstandarditemmodel#clear">clear</a>（）从模型中删除所有项目。

source: Call <a href="qstringmatcher#indexIn">indexIn</a>() to perform a search.
zh_cn: 调用<a href="qstringmatcher#indexIn">indexIn</a>（）进行搜索。

source: Call <a href="qtabwidget#addTab">addTab</a>() or <a href="qtabwidget#insertTab">insertTab</a>() to put the page widgets into the tab widget, giving each tab a suitable label with an optional keyboard shortcut.
zh_cn: 调用<a href="qtabwidget#addTab">addTab</a>（）或<a href="qtabwidget#insertTab">insertTab</a>（）将页面小部件放入选项卡小部件中，为每个选项卡提供合适的标签以及可选的键盘快捷键。

source: Call <a href="qtcpserver#listen">listen</a>() to have the server listen for incoming connections. The <a href="qtcpserver#newConnection">newConnection</a>() signal is then emitted each time a client connects to the server.
zh_cn: 调用<a href="qtcpserver#listen">listen</a>（）以使服务器侦听传入的连接。所述<a href="qtcpserver#newConnection">newConnection</a>（）信号然后每个客户端连接到服务器时发射。

source: Call <a href="qtcpserver#nextPendingConnection">nextPendingConnection</a>() to accept the pending connection as a connected <a href="qtcpsocket">QTcpSocket</a>. The function returns a pointer to a <a href="qtcpsocket">QTcpSocket</a> in <a href="qabstractsocket#SocketState-enum">QAbstractSocket::ConnectedState</a> that you can use for communicating with the client.
zh_cn: 调用<a href="qtcpserver#nextPendingConnection">nextPendingConnection</a>（）以将挂起的连接接受为已连接的<a href="qtcpsocket">QTcpSocket</a>。该函数返回一个指向<a href="qtcpsocket">与QTcpSocket</a>在<a href="qabstractsocket#SocketState-enum">QAbstractSocket :: ConnectedState</a>，您可以使用与客户机进行通信。

source: Call <a href="qtextdocumentwriter#supportedDocumentFormats">supportedDocumentFormats</a>() for a list of formats that <a href="qtextdocumentwriter">QTextDocumentWriter</a> can write.
zh_cn: 调用<a href="qtextdocumentwriter#supportedDocumentFormats">supportedDocumentFormats</a>（）获取<a href="qtextdocumentwriter">QTextDocumentWriter</a>可以写入的格式列表。

source: Call <a href="qtextdocumentwriter#supportedDocumentFormats">supportedDocumentFormats</a>() for a list of formats that QTextDocumentWriter can write.
zh_cn: 调用<a href="qtextdocumentwriter#supportedDocumentFormats">supportedDocumentFormats</a>（）获取QTextDocumentWriter可以写入的格式列表。

source: Call <a href="qtextdocumentwriter#write">write</a>() to write the document to the device. If the document is successfully written, this function returns <code>true</code>. However, if an error occurs when writing the document, it will return false.
zh_cn: 调用<a href="qtextdocumentwriter#write">write</a>（）将文档写入设备。如果文档已成功写入，则此函数返回 <code>true</code> 。但是，如果在写文档时发生错误，它将返回false。
