Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/qt/qt.*.123.xlf
Languages: es, ko, zh_cn

source: Ensure that the URL provided is full and correct, in particular, use <a href="qurl#fromLocalFile">QUrl::fromLocalFile</a>() when loading a file from the local filesystem.
es: Aseg&uacute;rese de que la URL proporcionada est&eacute; completa y sea correcta, en particular, use <a href="qurl#fromLocalFile">QUrl :: fromLocalFile</a> () cuando cargue un archivo desde el sistema de archivos local.
ko: 제공된 URL이 완전하고 올바른지 확인하십시오. 특히 로컬 파일 시스템에서 파일을로드 할 때 <a href="qurl#fromLocalFile">QUrl :: fromLocalFile</a> ()을 사용하십시오.

source: Ensure that the class implementation is located in a <code>.cpp</code> file:
es: Aseg&uacute;rese de que la implementaci&oacute;n de la clase est&eacute; ubicada en un archivo <code>.cpp</code> :
ko: 클래스 구현이 <code>.cpp</code> 파일 에 있는지 확인하십시오 .

source: Ensure that the client libraries of the DBMS are available on the system. On Unix, run the command <code>ldd</code> and pass the name of the plugin as parameter, for example <code>ldd libqsqlmysql.so</code>. You will get a warning if any of the client libraries could not be found. On Windows, you can use Visual Studio's dependency walker. With Qt Creator, you can update the <code>PATH</code> environment variable in the <b>Run</b> section of the <b>Project</b> panel to include the path to the folder containing the client libraries.
es: Aseg&uacute;rese de que las bibliotecas cliente del DBMS est&eacute;n disponibles en el sistema. En Unix, ejecute el comando <code>ldd</code> y pase el nombre del complemento como par&aacute;metro, por ejemplo <code>ldd libqsqlmysql.so</code> . Recibir&aacute; una advertencia si no se puede encontrar alguna de las bibliotecas cliente. En Windows, puede usar el analizador de dependencias de Visual Studio. Con Qt Creator, puede actualizar la <code>PATH</code> entorno PATH en la secci&oacute;n <b>Ejecutar</b> del panel <b>Proyecto</b> para incluir la ruta a la carpeta que contiene las bibliotecas cliente.
ko: 시스템에서 DBMS의 클라이언트 라이브러리가 사용 가능한지 확인하십시오. Unix에서 <code>ldd</code> 명령을 실행하고 플러그인 이름을 매개 변수로 전달하십시오 (예 : <code>ldd libqsqlmysql.so</code> ) . 클라이언트 라이브러리를 찾을 수 없으면 경고가 표시됩니다. Windows에서는 Visual Studio의 종속성 워커를 사용할 수 있습니다. Qt Creator를 사용하면 <b>프로젝트</b> 패널 의 <b>실행</b> 섹션 에서 <code>PATH</code> 환경 변수를 업데이트 하여 클라이언트 라이브러리가 포함 된 폴더의 경로를 포함 할 수 있습니다.<b></b><b></b>

source: Ensure that the plugin is in the correct directory. You can use QApplication::libraryPaths() to determine where Qt looks for plugins.
es: Asegúrate de que el plugin está en el directorio correcto.Puedes usar QApplication::libraryPaths()para determinar dónde busca Qt los plugins.
ko: 플러그인이 올바른 디렉토리에 있는지 확인하십시오. QApplication :: libraryPaths ()를 사용하여 Qt가 플러그인을 찾는 위치를 결정할 수 있습니다.

source: Ensure that this function is called before the view settings are modified. This is required since view's properties may require that a model has been set on the view (for example, hiding columns in the view requires a model to be set on the view).
es: Asegúrese de que se llame a esta función antes de modificar los ajustes de la vista.Esto es necesario ya que las propiedades de la vista pueden requerir que se haya establecido un modelo en la vista (por ejemplo,ocultar las columnas en la vista requiere que se establezca un modelo en la vista).
ko: 보기 설정을 수정하기 전에이 기능이 호출되는지 확인하십시오. 뷰의 속성에 따라 뷰에서 모델을 설정해야 할 수 있기 때문에이 작업이 필요합니다 (예 : 뷰에서 열을 숨기려면 뷰에서 모델을 설정해야 함).

source: Ensure that you call <a href="qpainter#end">QPainter::end</a>() for the
es: Aseg&uacute;rese de llamar a <a href="qpainter#end">QPainter :: end</a> () para
ko: <a href="qpainter#end">QPainter :: end</a> ()를 호출 해야합니다.

source: Ensures no graphics resources are released when the window becomes unexposed. The default behavior is to release everything, and reinitialize later when becoming visible again.
es: Asegura que no se libere ningún recurso gráfico cuando la ventana no esté expuesta.El comportamiento por defecto es liberar todo,y reiniciar más tarde cuando vuelva a ser visible.
ko: 창이 노출되지 않을 때 그래픽 리소스가 해제되지 않도록합니다. 기본 동작은 모든 것을 해제하고 다시 표시되면 나중에 다시 초기화하는 것입니다.

source: Ensures that
es: Asegura que
ko: 보장

source: Ensures that image requests to the provider are run in a separate thread, which allows the provider to spend as much time as needed on producing the image without blocking the main thread.
es: Asegura que las solicitudes de imagen al proveedor se ejecuten en un hilo separado,lo que permite al proveedor dedicar tanto tiempo como sea necesario a la producción de la imagen sin bloquear el hilo principal.
ko: 제공자에 대한 이미지 요청이 별도의 스레드에서 실행되도록하여 제공자가 기본 스레드를 차단하지 않고 이미지를 생성하는 데 필요한 시간을 많이 소비 할 수 있습니다.

source: Ensures that siblings of native widgets stay non-native unless specifically set by the <a href="qt#WidgetAttribute-enum">Qt::WA_NativeWindow</a> attribute.
es: Asegura que los hermanos de los widgets nativos permanezcan no nativos a menos que el atributo <a href="qt#WidgetAttribute-enum">Qt :: WA_NativeWindow lo</a> establezca espec&iacute;ficamente .
ko: <a href="qt#WidgetAttribute-enum">Qt :: WA_NativeWindow</a> 속성에 의해 특별히 설정되지 않는 한 기본 위젯의 형제가 기본이 아닌 상태로 유지 되도록 합니다.

source: Ensures that text lines are justified.
es: Asegura que las líneas de texto estén justificadas.
ko: 텍스트 줄이 정렬되도록합니다.

source: Ensures that the
es: Asegura que el
ko: 보장

source: Ensures that the <a href="qhash#qhash">QHash</a>'s internal hash table consists of at least
es: Asegura que la tabla hash interna de <a href="qhash#qhash">QHash</a> conste al menos
ko: 보장하는 것을 <a href="qhash#qhash">QHash</a> 의 내부 해시 테이블은 적어도 구성

source: Ensures that the background decoration stays in place
es: Asegura que la decoración de fondo se mantenga en su lugar
ko: 배경 장식이 그대로 유지되도록합니다.

source: Ensures that the cursor is visible by scrolling the text edit if necessary.
es: Asegura que el cursor sea visible desplazando la edición de texto si es necesario.
ko: 필요한 경우 텍스트 편집을 스크롤하여 커서가 보이도록합니다.

source: Ensures that the list of libraries stored in the <code>LIBS</code> variable is not reduced to a list of unique values before it is used.
es: Garantiza que la lista de bibliotecas almacenadas en la variable <code>LIBS</code> no se reduzca a una lista de valores &uacute;nicos antes de su uso.
ko: <code>LIBS</code> 변수에 저장된 라이브러리 목록이 사용되기 전에 고유 값 목록으로 축소되지 않도록합니다.

source: Ensures that the right widgets are visible.
es: Asegura que los widgets correctos sean visibles.
ko: 올바른 위젯이 표시되도록합니다.

source: Ensures that the set's internal hash table consists of at least
es: Asegura que la tabla de hachís interna del juego consiste en al menos
ko: 세트의 내부 해시 테이블이 최소한 다음으로 구성되어 있는지 확인

source: Ensures that the text between
es: Asegura que el texto entre
ko: 텍스트 사이에

source: Ensures that the widget and its children have been polished by <a href="qstyle">QStyle</a> (i.e., have a proper font and palette).
es: Asegura que el widget y sus elementos <a href="qstyle">secundarios</a> hayan sido pulidos por QStyle (es decir, que tengan una fuente y una paleta adecuadas).
ko: 위젯과 해당 하위 요소가 <a href="qstyle">QStyle에</a> 의해 연마 되었는지 확인합니다 (즉, 적절한 글꼴과 팔레트가 있어야 함).

source: Ensures that widgets have native windows.
es: Asegura que los widgets tengan ventanas nativas.
ko: 위젯에 기본 창이 있는지 확인하십시오.

source: Ensures the content is within legal bounds.
es: Asegura que el contenido esté dentro de los límites legales.
ko: 내용이 법적 범위 내에 있는지 확인하십시오.

source: Enter events occur when the mouse cursor enters a window or a widget.
es: Los eventos de entrada ocurren cuando el cursor del ratón entra en una ventana o un widget.
ko: Enter 이벤트는 마우스 커서가 창이나 위젯에 들어갈 때 발생합니다.

source: Enter key for keyboard layouts. <a href="#details">More...</a>
es: Introduzca la tecla para dise&ntilde;os de teclado. <a href="#details">M&aacute;s...</a>
ko: 키보드 레이아웃을위한 키를 입력하십시오. <a href="#details">더...</a>

source: EnterKey (QML type)
es: EnterKey (tipo QML)
ko: EnterKey (QML 유형)

source: EnterKey QML Type
es: IntroducirTipo QML
ko: EnterKey QML 유형

source: EnterKey.type : <a href="qml-enumeration">enumeration</a>
es: EnterKey.type: <a href="qml-enumeration">enumeraci&oacute;n</a>
ko: EnterKey.type : <a href="qml-enumeration">열거</a>

source: EnterKeyAction (QML type)
es: EnterKeyAction (tipo QML)
ko: EnterKeyAction (QML 유형)

source: EnterKeyAction QML Type
ko: EnterKeyAction QML 유형

source: EnterKeyAction.label : <a href="qml-string">string</a>
es: EnterKeyAction.label: <a href="qml-string">cadena</a>
ko: EnterKeyAction.label : <a href="qml-string">문자열</a>

source: Entering an URL on the address bar.
es: Introducir una URL en la barra de direcciones.
ko: 주소 표시 줄에 URL을 입력하십시오.

source: Entering user credentials for HTTP and proxy authentication
es: Introducir las credenciales de usuario para la autenticación HTTP y proxy
ko: HTTP 및 프록시 인증을위한 사용자 신임 정보 입력

source: Enters the array or map that is the current item and prepares for iterating the elements contained in the container. Returns true if entering the container succeeded, false otherwise (usually, a parsing error). Each call to enterContainer() must be paired with a call to <a href="qcborstreamreader#leaveContainer">leaveContainer</a>().
es: Ingresa la matriz o mapa que es el elemento actual y se prepara para iterar los elementos contenidos en el contenedor. Devuelve verdadero si se ingres&oacute; correctamente al contenedor, falso en caso contrario (generalmente, un error de an&aacute;lisis). Cada llamada a enterContainer () debe estar emparejada con una llamada a <a href="qcborstreamreader#leaveContainer">leaveContainer</a> ().
ko: 현재 항목 인 배열 또는 맵을 입력하고 컨테이너에 포함 된 요소를 반복 할 준비를합니다. 컨테이너 입력에 성공하면 true를, 그렇지 않으면 false를 반환합니다 (일반적으로 구문 분석 오류). enterContainer ()에 대한 각 호출은 leaveContainer ()에 대한 호출과 쌍을 <a href="qcborstreamreader#leaveContainer">이루어야</a> 합니다.

source: Enters the event loop and waits until <a href="qthread#exit">exit</a>() is called, returning the value that was passed to <a href="qthread#exit">exit</a>(). The value returned is 0 if <a href="qthread#exit">exit</a>() is called via <a href="qthread#quit">quit</a>().
es: Entra en el ciclo de eventos y espera hasta que se llame a <a href="qthread#exit">exit</a> (), devolviendo el valor que se pas&oacute; a <a href="qthread#exit">exit</a> (). El valor devuelto es 0 si se llama a <a href="qthread#exit">exit</a> () mediante <a href="qthread#quit">quit</a> ().
ko: 까지 이벤트 루프 대기 들어갑니다 <a href="qthread#exit">종료</a> 에 전달 된 값 반환, 호출을 () <a href="qthread#exit">종료</a> (). <a href="qthread#exit">종료</a> ()가 <a href="qthread#quit">quit</a> () 를 통해 호출 되면 리턴 된 값은 0 입니다.

source: Enters the main event loop and waits until <a href="qcoreapplication#exit">exit</a>() is called, and then returns the value that was set to <a href="qcoreapplication#exit">exit</a>() (which is 0 if <a href="qcoreapplication#exit">exit</a>() is called via <a href="qcoreapplication#quit">quit</a>()).
es: Entra en el ciclo de eventos principal y espera hasta que se llame a <a href="qcoreapplication#exit">exit</a> (), y luego devuelve el valor que se estableci&oacute; en <a href="qcoreapplication#exit">exit</a> () (que es 0 si se llama a <a href="qcoreapplication#exit">exit</a> () a trav&eacute;s de <a href="qcoreapplication#quit">quit</a> ()).
ko: 까지 메인 이벤트 루프 대기 들어갑니다 <a href="qcoreapplication#exit">종료</a> 라고합니다 ()를 한 다음에 설정 한 값 반환 <a href="qcoreapplication#exit">종료</a> () (경우 0 <a href="qcoreapplication#exit">출구</a> 를 통해 호출은 () <a href="qcoreapplication#quit">종료를</a> ()).

source: Enters the main event loop and waits until <a href="qcoreapplication#exit">exit</a>() is called, then returns the value that was set to <a href="qcoreapplication#exit">exit</a>() (which is 0 if <a href="qcoreapplication#exit">exit</a>() is called via <a href="qcoreapplication#quit">quit</a>()).
es: Entra en el ciclo de eventos principal y espera hasta que se llame a <a href="qcoreapplication#exit">exit</a> (), luego devuelve el valor que se estableci&oacute; en <a href="qcoreapplication#exit">exit</a> () (que es 0 si se llama a <a href="qcoreapplication#exit">exit</a> () a trav&eacute;s de <a href="qcoreapplication#quit">quit</a> ()).
ko: 까지 메인 이벤트 루프 대기 들어갑니다 <a href="qcoreapplication#exit">종료</a> 다음에 설정 한 값 반환, 호출을 () <a href="qcoreapplication#exit">종료</a> () (경우 0 <a href="qcoreapplication#exit">출구</a> 를 통해 호출은 () <a href="qcoreapplication#quit">종료를</a> ()).

source: Enters the main event loop and waits until <a href="qcoreapplication#exit">exit</a>() is called. Returns the value that was passed to <a href="qcoreapplication#exit">exit</a>() (which is 0 if <a href="qcoreapplication#exit">exit</a>() is called via <a href="qcoreapplication#quit">quit</a>()).
es: Ingresa al bucle de eventos principal y espera hasta que se llame a <a href="qcoreapplication#exit">exit</a> (). Devuelve el valor que se pas&oacute; a <a href="qcoreapplication#exit">exit</a> () (que es 0 si se llama a <a href="qcoreapplication#exit">exit</a> () mediante <a href="qcoreapplication#quit">quit</a> ()).
ko: 기본 이벤트 루프를 시작하고 <a href="qcoreapplication#exit">종료</a> ()가 호출 될 때까지 기다립니다 . <a href="qcoreapplication#exit">종료</a> () 에 전달 된 값을 리턴합니다 ( <a href="qcoreapplication#exit">종료</a> ()가 <a href="qcoreapplication#quit">종료</a> () 를 통해 호출 된 경우 0 임).

source: Enters the main event loop and waits until <a href="qeventloop#exit">exit</a>() is called. Returns the value that was passed to <a href="qeventloop#exit">exit</a>().
es: Ingresa al bucle de eventos principal y espera hasta que se llame a <a href="qeventloop#exit">exit</a> (). Devuelve el valor que se pas&oacute; a <a href="qeventloop#exit">exit</a> ().
ko: 기본 이벤트 루프를 시작하고 <a href="qeventloop#exit">종료</a> ()가 호출 될 때까지 기다립니다 . <a href="qeventloop#exit">종료</a> () 에 전달 된 값을 반환합니다 .

source: Entity (QML type)
es: Entidad (tipo QML)
ko: 엔티티 (QML 유형)

source: Entity <b><b><a href="qml-qt3d-render-sceneloader#component-method">component</a></b></b>(
es: <b><b><a href="qml-qt3d-render-sceneloader#component-method">Componente de</a></b></b> entidad (
ko: 엔터티 <b><b><a href="qml-qt3d-render-sceneloader#component-method">구성 요소</a></b></b> (

source: Entity <b><b><a href="qml-qt3d-render-sceneloader#component-method">component</a></b></b>(string
ko: 엔티티 <b><b><a href="qml-qt3d-render-sceneloader#component-method">구성 요소</a></b></b> (문자열

source: Entity <b><b><a href="qml-qt3d-render-sceneloader#entity-method">entity</a></b></b>(
es: Entidad <b><b><a href="qml-qt3d-render-sceneloader#entity-method">entidad</a></b></b> (
ko: 엔터티 <b><b><a href="qml-qt3d-render-sceneloader#entity-method">엔터티</a></b></b> (

source: Entity <b><b><a href="qml-qt3d-render-sceneloader#entity-method">entity</a></b></b>(string
ko: 엔티티 <b><b><a href="qml-qt3d-render-sceneloader#entity-method">엔티티</a></b></b> (문자열

source: Entity QML Type
es: Entidad Tipo QML
ko: 엔터티 QML 유형

source: Entity is a <a href="qml-qt3d-core-node">Node</a> subclass that can aggregate several <a href="qml-qt3d-core-component3d">Component3D</a> instances that will specify its behavior. <a href="#details">More...</a>
es: Entity es una subclase de <a href="qml-qt3d-core-node">Node</a> que puede agregar varias instancias de <a href="qml-qt3d-core-component3d">Component3D</a> que especificar&aacute;n su comportamiento. <a href="#details">M&aacute;s...</a>
ko: 엔터티는 동작을 지정하는 여러 <a href="qml-qt3d-core-component3d">Component3D</a> 인스턴스를 집계 할 수 있는 <a href="qml-qt3d-core-node">노드</a> 하위 클래스입니다 . <a href="#details">더...</a>

source: Entity nodes can be imported, but at the moment there is no way to use them since the document type is read-only in DOM level 2.
es: Los nodos de entidad pueden ser importados,pero de momento no hay forma de utilizarlos ya que el tipo de documento es de sólo lectura en el nivel 2 de DOM.
ko: 엔티티 노드는 가져올 수 있지만 현재 DOM 레벨 2에서 문서 유형이 읽기 전용이므로 사용할 수있는 방법이 없습니다.

source: Entity references are handled as follows:
es: Las referencias de las entidades se manejan de la siguiente manera:
ko: 엔티티 참조는 다음과 같이 처리됩니다.

source: Entity resolver for a QXmlStreamReader
es: Resolver la entidad para un QXmlStreamReader
ko: QXmlStreamReader에 대한 엔티티 리졸버

source: EntityLoader (QML type)
es: EntityLoader (tipo QML)
ko: EntityLoader (QML 유형)

source: EntityLoader QML Type
ko: EntityLoader QML 유형

source: Entries in fallback locations are not removed.
es: Las entradas en los lugares de reserva no se eliminan.
ko: 대체 위치의 항목은 제거되지 않습니다.

source: Entries in the list can represent discrete rates or a continuous range of rates. A discrete rate is noted by having both values the same.
es: Las entradas en la lista pueden representar tasas discretas o un rango continuo de tasas.Una tasa discreta se observa teniendo ambos valores iguales.
ko: 목록의 항목은 불연속 요금 또는 연속 요금 범위를 나타낼 수 있습니다. 이산 율은 두 값을 모두 동일하게 나타냅니다.

source: Enum classes are registered in QML as scoped and unscoped properties. The <code>Ready</code> value will be registered at <code>Message.Status.Ready</code> and <code>Message.Ready</code> .
es: Las clases de enumeraci&oacute;n se registran en QML como propiedades con y sin &aacute;mbito. El valor <code>Ready</code> se registrar&aacute; en <code>Message.Status.Ready</code> y <code>Message.Ready</code> .
ko: 열거 클래스는 QML에 범위 및 범위가 지정되지 않은 속성으로 등록됩니다. <code>Ready</code> 값에 등록됩니다 <code>Message.Status.Ready</code> 및 <code>Message.Ready</code> .

source: Enum names have the same scope as the type name.
es: Los nombres enuméricos tienen el mismo alcance que el nombre del tipo.
ko: 열거 형 이름은 형식 이름과 동일한 범위를 갖습니다.

source: Enumerates Service status errors.
es: Enumera los errores de estado de servicio.
ko: 서비스 상태 오류를 열거합니다.

source: Enumerates encoding modes.
es: Enumera los modos de codificación.
ko: 인코딩 모드를 열거합니다.

source: Enumerates how a video buffer's data is mapped to system memory.
es: Enumera cómo los datos de un búfer de vídeo se asignan a la memoria del sistema.
ko: 비디오 버퍼의 데이터가 시스템 메모리에 매핑되는 방법을 열거합니다.

source: Enumerates how the radio tuner should search for stations.
es: Enumera cómo el sintonizador de radio debe buscar las emisoras.
ko: 라디오 튜너가 방송국을 검색하는 방법을 열거합니다.

source: Enumerates quality encoding levels.
es: Enumera los niveles de codificación de calidad.
ko: 품질 인코딩 수준을 열거합니다.

source: Enumerates radio data error conditions.
es: Enumera las condiciones de error de los datos de radio.
ko: 라디오 데이터 오류 조건을 열거합니다.

source: Enumerates radio frequency bands.
es: Enumera las bandas de radiofrecuencia.
ko: 무선 주파수 대역을 열거합니다.

source: Enumerates radio tuner error conditions.
es: Enumera las condiciones de error del sintonizador de radio.
ko: 라디오 튜너 오류 조건을 열거합니다.

source: Enumerates radio tuner policy for receiving stereo signals.
es: Enumera la política de sintonizadores de radio para la recepción de señales estéreo.
ko: 스테레오 신호를 수신하기위한 라디오 튜너 정책을 열거합니다.

source: Enumerates radio tuner states.
es: Enumera los estados del sintonizador de radio.
ko: 라디오 튜너 상태를 열거합니다.

source: Enumerates the Y'CbCr color space of video frames.
es: Enumera el espacio de color Y'CbCr de los cuadros de video.
ko: 비디오 프레임의 Y'CbCr 색 공간을 열거합니다.

source: Enumerates the layout direction of video scan lines.
es: Enumera la dirección de la disposición de las líneas de escaneo de video.
ko: 비디오 스캔 라인의 레이아웃 방향을 열거합니다.

source: Enumerates the levels of support a media service provider may have for a feature.
es: Enumera los niveles de apoyo que un proveedor de servicios de medios puede tener para una característica.
ko: 미디어 서비스 공급자가 기능에 대해 가질 수있는 지원 수준을 열거합니다.

source: Enumerates video data types.
es: Enumera los tipos de datos de vídeo.
ko: 비디오 데이터 형식을 열거합니다.

source: Enumeration Attributes
es: Atributos de la Enumeración
ko: 열거 속성

source: Enumeration Types
es: Tipos de Enumeración
ko: 열거 형

source: Enumeration Types as Signal and Method Parameters
es: Tipos de Enumeración como Parámetros de Señales y Métodos
ko: 신호 및 메소드 매개 변수로서 열거 유형

source: Enumeration for face mode values
ko: 얼굴 모드 값에 대한 열거

source: Enumeration for raster mode values
ko: 래스터 모드 값에 대한 열거

source: Enumeration for the alpha function values
es: Enumeración de los valores de la función alfa
ko: 알파 함수 값의 열거

source: Enumeration for the depth function values
es: Enumeración de los valores de la función de profundidad
ko: 깊이 함수 값에 대한 열거

source: Enumeration for the stencil function values
es: Enumeración de los valores de la función de la plantilla
ko: 스텐실 함수 값의 열거

source: Enumeration of Value Set
es: Enumeración del conjunto de valores
ko: 값 집합의 열거

source: Enumerations (which use a combination of C++ enum and Qt's <a href="qobject#Q_ENUM">Q_ENUM</a> in QtRO) are described using the ENUM keyword.
es: Las enumeraciones (que usan una combinaci&oacute;n de enumeraci&oacute;n de C ++ y <a href="qobject#Q_ENUM">Q_ENUM</a> de Qt en QtRO) se describen usando la palabra clave ENUM.
ko: 열거 형 ( <a href="qobject#Q_ENUM">QtRO</a> 에서 C ++ 열거 형과 Qt의 Q_ENUM 조합 사용 )은 ENUM 키워드를 사용하여 설명됩니다.

source: Enumerations can be serialized through QDataStream without the need of manually defining streaming operators. Enum classes are serialized using the declared size.
ko: 열거는 스트리밍 연산자를 수동으로 정의 할 필요없이 QDataStream을 통해 직렬화 할 수 있습니다. Enum 클래스는 선언 된 크기를 사용하여 직렬화됩니다.

source: Enumerations provide a fixed set of named choices. They can be declared in QML using the <code>enum</code> keyword:
es: Las enumeraciones proporcionan un conjunto fijo de opciones con nombre. Se pueden declarar en QML usando la palabra clave <code>enum</code> :
ko: 열거 형은 고정 된 명명 된 선택 세트를 제공합니다. <code>enum</code> 키워드를 사용하여 QML에서 선언 할 수 있습니다 .

source: Enumerations registered with <a href="qobject#Q_ENUM">Q_ENUM</a> or <a href="qobject#Q_FLAG">Q_FLAG</a>
es: Enumeraciones registradas con <a href="qobject#Q_ENUM">Q_ENUM</a> o <a href="qobject#Q_FLAG">Q_FLAG</a>
ko: <a href="qobject#Q_ENUM">Q_ENUM</a> 또는 <a href="qobject#Q_FLAG">Q_FLAG에</a> 등록 된 열거

source: Enumerations that are declared with Q_ENUM have their <a href="qmetaenum">QMetaEnum</a> registered in the enclosing <a href="qmetaobject">QMetaObject</a>. You can also use <a href="qmetaenum#fromType">QMetaEnum::fromType</a>() to get the <a href="qmetaenum">QMetaEnum</a>.
es: Las enumeraciones que se declaran con Q_ENUM tienen su <a href="qmetaenum">QMetaEnum</a> registrado en el <a href="qmetaobject">QMetaObject adjunto</a> . Tambi&eacute;n puede utilizar <a href="qmetaenum#fromType">QMetaEnum :: fromType</a> () para obtener <a href="qmetaenum">QMetaEnum</a> .
ko: Q_ENUM로 선언 열거 형은이 <a href="qmetaenum">QMetaEnum이</a> 둘러싸에 등록 <a href="qmetaobject">QMetaObject</a> . <a href="qmetaenum#fromType">QMetaEnum :: fromType</a> ()을 사용하여 QMetaEnum 을 가져올 <a href="qmetaenum">수도</a> 있습니다.

source: Enumerations that are declared with Q_ENUM_NS have their <a href="qmetaenum">QMetaEnum</a> registered in the enclosing <a href="qmetaobject">QMetaObject</a>. You can also use <a href="qmetaenum#fromType">QMetaEnum::fromType</a>() to get the <a href="qmetaenum">QMetaEnum</a>.
es: Las enumeraciones que se declaran con Q_ENUM_NS tienen su <a href="qmetaenum">QMetaEnum</a> registrado en el <a href="qmetaobject">QMetaObject adjunto</a> . Tambi&eacute;n puede utilizar <a href="qmetaenum#fromType">QMetaEnum :: fromType</a> () para obtener <a href="qmetaenum">QMetaEnum</a> .
ko: Q_ENUM_NS로 선언 열거 형은이 <a href="qmetaenum">QMetaEnum이</a> 둘러싸에 등록 <a href="qmetaobject">QMetaObject</a> . <a href="qmetaenum#fromType">QMetaEnum :: fromType</a> ()을 사용하여 QMetaEnum 을 가져올 <a href="qmetaenum">수도</a> 있습니다.

source: Enums and Typedefs Must Be Fully Qualified for Signal and Slot Parameters
es: Los enums y tipedefs deben estar completamente calificados para los parámetros de señal y ranura
ko: 열거 형 및 Typedef는 신호 및 슬롯 매개 변수에 대해 정규화되어야합니다.

source: Enums declared with <a href="qobject#Q_ENUM">Q_ENUM</a>() or Q_ENUMS()
es: Enums declarados con <a href="qobject#Q_ENUM">Q_ENUM</a> () o Q_ENUMS ()
ko: <a href="qobject#Q_ENUM">Q_ENUM</a> () 또는 Q_ENUMS ()로 선언 된 열거 형

source: Enums, Namespaces, and Other Types
es: Enums,espacios de nombres y otros tipos
ko: 열거 형, 네임 스페이스 및 기타 유형
