Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/qt/qt.*.123.xlf
Languages: es, ko, zh_cn

source: Calls are usually placed by using the <a href="qdbusabstractinterface#call-1">call</a>() function, which constructs the message, sends it over the bus, waits for the reply and decodes the reply. Signals are connected to by using the normal <a href="qobject#connect">QObject::connect</a>() function. Finally, properties are accessed using the <a href="qobject#property">QObject::property</a>() and <a href="qobject#setProperty">QObject::setProperty</a>() functions.
zh_cn: 通常通过使用<a href="qdbusabstractinterface#call-1">call</a>（）函数来放置呼叫，该函数构造消息，通过总线发送消息，等待答复并解码答复。通过使用普通的<a href="qobject#connect">QObject :: connect</a>（）函数将信号连接到。最后，使用<a href="qobject#property">QObject :: property</a>（）和<a href="qobject#setProperty">QObject :: setProperty</a>（）函数访问属性。

source: Calls moc on an input file
zh_cn: 在输入文件上调用moc

source: Calls the COM object's method
zh_cn: 调用COM对象的方法

source: Calls the Java object's method
zh_cn: 调用Java对象的方法

source: Calls the Java objects method
zh_cn: 调用Java对象方法

source: Calls the message handler with the critical message
zh_cn: 调用带有关键信息的消息处理程序

source: Calls the message handler with the debug message
zh_cn: 调用带有调试信息的消息处理程序。

source: Calls the message handler with the fatal message
zh_cn: 调用带有致命信息的消息处理程序。

source: Calls the message handler with the informational message
zh_cn: 调用带有信息信息的消息处理程序。

source: Calls the message handler with the warning message
zh_cn: 调用带有警告信息的消息处理程序

source: Calls the method
zh_cn: 调用方法

source: Calls the static method
zh_cn: 调用静态方法

source: Calls the static method with
zh_cn: 调用静态方法的

source: Calls this <a href="qjsvalue">QJSValue</a> as a function, passing
zh_cn: 调用此<a href="qjsvalue">QJSValue</a>作为函数，并传递

source: Calls this <a href="qjsvalue">QJSValue</a> as a function, using
zh_cn: 调用此<a href="qjsvalue">QJSValue</a>作为函数，使用

source: Calls to beginMacro() and <a href="qundostack#endMacro">endMacro</a>() may be nested, but every call to beginMacro() must have a matching call to <a href="qundostack#endMacro">endMacro</a>().
zh_cn: 调用beginMacro（）和<a href="qundostack#endMacro">endMacro</a>（）可以被嵌套，但beginMacro每次调用（）必须有匹配的调用<a href="qundostack#endMacro">endMacro</a>（）。

source: Camera (QML type)
zh_cn: 摄像机(QML型)

source: Camera Example
zh_cn: 摄像机实例

source: Camera ISO sensitivity, specified as integer value.
zh_cn: 摄像机ISO感光度,指定为整数值。

source: Camera Overview
zh_cn: 摄像机概述

source: Camera QML Type
zh_cn: 摄像机QML类型

source: Camera exposure mode.
zh_cn: 相机曝光模式。

source: Camera field of view is horizontal, i.e. aspect ratio is adjusted horizontally.
zh_cn: 摄像机的视场是水平的,即水平调整长宽比。

source: Camera field of view is vertical, i.e. aspect ratio is adjusted vertically. This is the default orientation.
zh_cn: 摄像机的视场是垂直的,即纵横比是垂直调整的。这是默认的方向。

source: Camera is configured for still frames capture.
zh_cn: 摄像机配置为静止帧捕捉。

source: Camera is configured for video capture.
zh_cn: 摄像机配置为视频采集。

source: Camera is only configured to display viewfinder.
zh_cn: 相机仅配置为显示取景器。

source: Camera metering mode.
zh_cn: 相机测光模式。

source: Camera saves all the capture parameters like exposure settings or image processing parameters, so changes to camera parameters after capture() is called do not affect previous capture requests.
zh_cn: 相机会保存所有的捕捉参数,如曝光设置或图像处理参数,因此在调用capture()后对相机参数的更改不会影响之前的捕捉请求。

source: Camera service may choose the parameters of image processing pipeline depending on sensor properties camera settings and capture parameters.
zh_cn: 摄像机服务可以根据传感器属性摄像机设置和采集参数来选择图像处理流水线的参数。

source: Camera specified in the exposed camera property
zh_cn: 在暴露的摄像机属性中指定的摄像机

source: Camera's shutter speed in seconds.
zh_cn: 相机的快门速度(秒)。

source: Camera3D (QML type)
zh_cn: Camera3D(QML型

source: Camera3D QML Type
zh_cn: Camera3D QML类型

source: Camera3D represents a basic orbit around centerpoint 3D camera that is used when rendering the data visualization. The type offers simple methods for rotating the camera around the origin and setting zoom level.
zh_cn: Camera3D表示一个基本的围绕中心点的3D摄像机,在渲染数据可视化时使用。该类型提供了简单的方法,用于围绕原点旋转相机和设置缩放级别。

source: CameraCapabilities (QML type)
zh_cn: CameraCapabilities (QML类型)

source: CameraCapabilities QML Type
zh_cn: CameraCapabilities QML类型

source: CameraCapture (QML type)
zh_cn: CameraCapture(QML类型)

source: CameraCapture QML Type
zh_cn: CameraCapture QML类型

source: CameraCapture is a child of a <a href="qml-multimedia#camera">Camera</a> (as the <code>imageCapture</code> property) and cannot be created directly.
zh_cn: CameraCapture是<a href="qml-multimedia#camera">Camera</a>的子级（作为 <code>imageCapture</code> 属性），不能直接创建。

source: CameraCapture::captureToLocation returns the capture requestId parameter, used with imageExposed(), <a href="qml-qtmultimedia-cameracapture#imageCaptured-signal">imageCaptured()</a>, <a href="qml-qtmultimedia-cameracapture#imageMetadataAvailable-signal">imageMetadataAvailable()</a> and <a href="qml-qtmultimedia-cameracapture#imageSaved-signal">imageSaved()</a> signals.
zh_cn: CameraCapture :: captureToLocation返回捕获requestId参数，与<a href="qml-qtmultimedia-cameracapture#imageMetadataAvailable-signal">imageExposed（）</a>，<a href="qml-qtmultimedia-cameracapture#imageCaptured-signal">imageCaptured（）</a>，imageMetadataAvailable（）和<a href="qml-qtmultimedia-cameracapture#imageSaved-signal">imageSaved（）</a>信号一起使用。

source: CameraExposure (QML type)
zh_cn: CameraExposure (QML类型)

source: CameraExposure QML Type
zh_cn: CameraExposure QML类型

source: CameraExposure allows you to adjust exposure related settings like aperture and shutter speed, metering and ISO speed.
zh_cn: CameraExposure可以让你调整与曝光相关的设置,如光圈和快门速度,测光和ISO速度。

source: CameraFlash (QML type)
zh_cn: CameraFlash (QML类型)

source: CameraFlash QML Type
zh_cn: CameraFlash QML类型
