Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/qt/qt.*.123.xlf
Languages: es, ko, zh_cn

source: By default, this property is true. This property must be set to the desired value before opening the dialog. Setting this property to false implies that the dialog is for naming a file to which to save something, or naming a folder to be created; therefore <a href="qml-qtquick-dialogs-filedialog#selectMultiple-prop">selectMultiple</a> must be false.
zh_cn: 默认情况下，此属性为true。打开对话框之前，必须将此属性设置为所需的值。将此属性设置为false意味着该对话框用于命名要向其中保存内容的文件，或者命名要创建的文件夹。因此<a href="qml-qtquick-dialogs-filedialog#selectMultiple-prop">selectMultiple</a>必须为false。

source: By default, this property is true. This property must be set to the desired value before opening the dialog. Usually the alpha channel is represented by an additional slider control.
zh_cn: 默认情况下,此属性为 "true"。在打开对话框之前,必须将此属性设置为所需的值。通常,alpha通道由一个附加的滑块控件来表示。

source: By default, this property is undefined.
zh_cn: 默认情况下,此属性未定义。

source: By default, this property reflects the uppercase status of the keyboard.
zh_cn: 默认情况下,该属性反映了键盘的大写状态。

source: By default, this property returns an empty string unless the user specifies the <code>-stylesheet</code> option on the command line when running the application.
zh_cn: 默认情况下，除非用户在运行应用程序时在命令行上指定 <code>-stylesheet</code> 选项，否则此属性返回空字符串。

source: By default, this property's value is derived from the highest signed integer available (typically 2147483647).
zh_cn: 默认情况下,此属性的值由可用的最高符号整数(通常为2147483647)得出。

source: By default, this property's value is derived from the lowest signed integer available (typically -2147483647).
zh_cn: 默认情况下,此属性的值是由可用的最小带符号整数(通常为-2147483647)得出的。

source: By default, this value is 1000 (i.e., 1 second), but you can change this by either passing a duration to <a href="qtimeline">QTimeLine</a>'s constructor, or by calling setDuration(). The duration must be larger than 0.
zh_cn: 默认情况下，此值为1000（即1秒），但是您可以通过将持续时间传递给<a href="qtimeline">QTimeLine</a>的构造函数或调用setDuration（）来更改此值。持续时间必须大于0。

source: By default, this value is false.
zh_cn: 默认情况下,该值为false。

source: By default, this value is not set.
zh_cn: 默认情况下,该值未被设置。

source: By default, this value is not set. When you set the status bar item, it will be anchored automatically into the application window.
zh_cn: 默认情况下,该值没有被设置。当您设置状态栏项目时,它将自动锚定到应用程序窗口中。

source: By default, this value is not set. When you set the toolbar item, it will be anchored automatically into the application window.
zh_cn: 默认情况下,这个值是不设置的。当您设置工具栏项目时,它将自动锚定到应用程序窗口中。

source: By default, this variable contains the same value as the <a href="#target">TARGET</a> variable.
zh_cn: 默认情况下，此变量包含与<a href="#target">TARGET</a>变量相同的值。

source: By default, this variable contains the same value as the <a href="#version">VERSION</a> variable.
zh_cn: 默认情况下，此变量包含与<a href="#version">VERSION</a>变量相同的值。

source: By default, this variable contains the same value as the <a href="qmake-variable-reference#target">TARGET</a> variable.
zh_cn: 默认情况下，此变量包含与<a href="qmake-variable-reference#target">TARGET</a>变量相同的值。

source: By default, this variable contains the same value as the <a href="qmake-variable-reference#version">VERSION</a> variable.
zh_cn: 默认情况下，此变量包含与<a href="qmake-variable-reference#version">VERSION</a>变量相同的值。

source: By default, today's date is selected, and the user can select a date using both mouse and keyboard. The currently selected date can be retrieved using the <a href="qcalendarwidget#selectedDate-prop">selectedDate</a>() function. It is possible to constrain the user selection to a given date range by setting the <a href="qcalendarwidget#minimumDate-prop">minimumDate</a> and <a href="qcalendarwidget#maximumDate-prop">maximumDate</a> properties. Alternatively, both properties can be set in one go using the <a href="qcalendarwidget#setDateRange">setDateRange</a>() convenience slot. Set the <a href="qcalendarwidget#selectionMode-prop">selectionMode</a> property to <a href="qcalendarwidget#SelectionMode-enum">NoSelection</a> to prohibit the user from selecting at all. Note that a date also can be selected programmatically using the <a href="qcalendarwidget#selectedDate-prop">setSelectedDate</a>() slot.
zh_cn: 默认情况下，将选择今天的日期，并且用户可以使用鼠标和键盘选择日期。可以使用<a href="qcalendarwidget#selectedDate-prop">selectedDate</a>（）函数检索当前选择的日期。通过设置<a href="qcalendarwidget#minimumDate-prop">minimumDate</a>和<a href="qcalendarwidget#maximumDate-prop">maximumDate</a>属性，可以将用户选择限制在给定的日期范围内。另外，也可以使用<a href="qcalendarwidget#setDateRange">setDateRange</a>（）便捷插槽一次性设置两个属性。将<a href="qcalendarwidget#selectionMode-prop">selectionMode</a>属性设置为<a href="qcalendarwidget#SelectionMode-enum">NoSelection</a>以完全禁止用户选择。请注意，还可以使用<a href="qcalendarwidget#selectedDate-prop">setSelectedDate</a>（）插槽以编程方式选择日期。

source: By default, transitions run in parallel and are applied to all state changes if the <a href="qml-qtquick-transition#from-prop">from</a> and <a href="qml-qtquick-transition#to-prop">to</a> states have not been set. In this situation, the transition is automatically applied when a state change is reversed, and it is not necessary to set this property to reverse the transition.
zh_cn: 默认情况下，如果未设置<a href="qml-qtquick-transition#from-prop">from</a>和<a href="qml-qtquick-transition#to-prop">to</a>状态，则转换并行运行，并应用于所有状态更改。在这种情况下，当状态更改被撤消时，过渡将自动应用，并且无需设置此属性来撤消过渡。

source: By default, when reading numbers from a stream of text, <a href="qtextstream">QTextStream</a> will automatically detect the number's base representation. For example, if the number starts with "0x", it is assumed to be in hexadecimal form. If it starts with the digits 1-9, it is assumed to be in decimal form, and so on. You can set the integer base, thereby disabling the automatic detection, by calling <a href="qtextstream#setIntegerBase">setIntegerBase</a>(). Example:
zh_cn: 默认情况下，当从文本流中读取数字时，<a href="qtextstream">QTextStream</a>将自动检测数字的基本表示形式。例如，如果数字以&ldquo; 0x&rdquo;开头，则假定为十六进制形式。如果以数字1-9开头，则假定为十进制形式，依此类推。您可以通过调用<a href="qtextstream#setIntegerBase">setIntegerBase</a>（）来设置整数基数，从而禁用自动检测。例：

source: By default, when reading numbers from a stream of text, QTextStream will automatically detect the number's base representation. For example, if the number starts with "0x", it is assumed to be in hexadecimal form. If it starts with the digits 1-9, it is assumed to be in decimal form, and so on. You can set the integer base, thereby disabling the automatic detection, by calling <a href="qtextstream#setIntegerBase">setIntegerBase</a>(). Example:
zh_cn: 默认情况下，从文本流中读取数字时，QTextStream将自动检测数字的基本表示形式。例如，如果数字以&ldquo; 0x&rdquo;开头，则假定为十六进制形式。如果以数字1-9开头，则假定为十进制形式，依此类推。您可以通过调用<a href="qtextstream#setIntegerBase">setIntegerBase</a>（）来设置整数基数，从而禁用自动检测。例子：

source: By default, word wrap is disabled.
zh_cn: 默认情况下,单词包装被禁用。

source: By definition,
zh_cn: 根据定义:

source: By definition, the <a href="qvirtualkeyboardtrace">QVirtualKeyboardTrace</a> object remains valid until the <a href="qvirtualkeyboardinputengine#traceEnd">traceEnd</a>() method is called.
zh_cn: 根据定义，<a href="qvirtualkeyboardtrace">QVirtualKeyboardTrace</a>对象将保持有效，直到<a href="qvirtualkeyboardinputengine#traceEnd">调用traceEnd</a>（）方法为止。

source: By definition, the Trace object remains valid until the <a href="qml-qtquick-virtualkeyboard-inputengine#traceEnd-method">traceEnd()</a> method is called.
zh_cn: 根据定义，Trace对象将保持有效，直到<a href="qml-qtquick-virtualkeyboard-inputengine#traceEnd-method">调用traceEnd（）</a>方法为止。

source: By definition, the trace object can be destroyed at earliest in the <a href="qml-qtquick-virtualkeyboard-inputmethod#traceEnd-method">InputMethod.traceEnd()</a> (QML) method.
zh_cn: 根据定义，可以最早在<a href="qml-qtquick-virtualkeyboard-inputmethod#traceEnd-method">InputMethod.traceEnd（）</a>（QML）方法中销毁跟踪对象。

source: By design, QPromise is a move-only object. This behavior helps to ensure that whenever the promise is destroyed, the associated future object is notified and will not wait forever for the results to become available. However, this is inconvenient if one wants to use the same promise to report results from different threads. There is no specific way to do that at the moment, but known mechanisms exist, such as the use of smart pointers or raw pointers/references. <a href="qsharedpointer">QSharedPointer</a> is a good default choice if you want to copy your promise and use it in multiple places simultaneously. Raw pointers or references are, in a sense, easier, and probably perform better (since there is no need to do a resource management) but may lead to dangling.
zh_cn: 根据设计，QPromise是仅移动对象。此行为有助于确保每当销毁诺言时，都会通知相关的将来对象，并且不会永远等待结果变为可用。但是，如果要使用相同的诺言来报告来自不同线程的结果，这将很不方便。目前尚无特定方法可以执行此操作，但是存在已知的机制，例如使用智能指针或原始指针/引用。如果您要复制承诺并同时在多个地方使用它，则<a href="qsharedpointer">QSharedPointer</a>是一个很好的默认选择。从某种意义上说，原始指针或引用更容易，并且可能会表现更好（因为不需要进行资源管理），但可能导致悬空。

source: By disabling clearing of the color buffer, it is possible to render OpengGL content under the scene graph.
zh_cn: 通过禁止清除颜色缓冲区,可以在场景图下渲染OpengGL内容。

source: By disabling image format autodetection, <a href="qimagereader">QImageReader</a> will only query the plugins and built-in handlers based on the format string (i.e., no file name extensions are tested).
zh_cn: 通过禁用图像格式自动检测，<a href="qimagereader">QImageReader</a>将仅基于格式字符串查询插件和内置处理程序（即，未测试任何文件扩展名）。

source: By explicitly calling <a href="qwizardpage#setFinalPage">setFinalPage</a>(true), you can let the user perform an "early finish".
zh_cn: 通过显式调用<a href="qwizardpage#setFinalPage">setFinalPage</a>（true），可以让用户执行&ldquo;尽早完成&rdquo;。

source: By extension, a class is said to be
zh_cn: 推而广之,一个类可以说是

source: By handling this signal and setting the <code>action.accepted</code> field to <code>false</code>, it's possible to implement some validation on the dialog contents before accepting it, for example.
zh_cn: 例如，通过处理此信号并将 <code>action.accepted</code> 字段设置为 <code>false</code> ，可以在接受对话框之前对对话框内容进行一些验证。

source: By implementing these methods, the input method can receive and process data from a variety of input sources (e.g. keyboard layout or full screen).
zh_cn: 通过实现这些方法,输入法可以从各种输入源(如键盘布局或全屏)接收和处理数据。

source: By including the user interface in the example's resources (<code>myForm.qrc</code>), we ensure that it will be present when the example is run:
zh_cn: 通过将用户界面包含在示例的资源（ <code>myForm.qrc</code> ）中，我们确保在示例运行时将显示该用户界面：

source: By including the user interface in the form's resources (<code>myform.qrc</code>), we ensure that it will be present at run-time:
zh_cn: 通过将用户界面包含在表单的资源（ <code>myform.qrc</code> ）中，我们确保它会在运行时出现：

source: By instantiating subclasses of <a href="qwinmime">QWinMime</a> that provide conversions between Windows Clipboard and MIME formats, you can convert proprietary clipboard formats to MIME formats.
zh_cn: 通过实例化在Windows剪贴板和MIME格式之间提供转换的<a href="qwinmime">QWinMime</a>子类，可以将专有剪贴板格式转换为MIME格式。

source: By instantiating subclasses of QWinMime that provide conversions between Windows Clipboard and MIME formats, you can convert proprietary clipboard formats to MIME formats.
zh_cn: 通过实例化QWinMime的子类,提供Windows剪贴板和MIME格式之间的转换,你可以将专有的剪贴板格式转换为MIME格式。

source: By itself a <a href="qt3dcore-qentity">Qt3DCore::QEntity</a> is an empty shell. The behavior of a <a href="qt3dcore-qentity">Qt3DCore::QEntity</a> object is defined by the <a href="qt3dcore-qcomponent">Qt3DCore::QComponent</a> objects it references. Each Qt3D backend aspect will be able to interpret and process an Entity by recognizing which components it is made up of. One aspect may decide to only process entities composed of a single <a href="qt3dcore-qtransform">Qt3DCore::QTransform</a> component whilst another may focus on <a href="qt3dinput-qmousehandler">Qt3DInput::QMouseHandler</a>.
zh_cn: <a href="qt3dcore-qentity">Qt3DCore :: QEntity</a>本身就是一个空壳。一的行为<a href="qt3dcore-qentity">Qt3DCore :: QEntity</a>对象由定义<a href="qt3dcore-qcomponent">Qt3DCore :: QComponent</a>对象引用它。每个Qt3D后端方面都将能够通过识别实体由哪些组件来解释和处理该实体。一个方面可以决定仅处理由单个<a href="qt3dcore-qtransform">Qt3DCore :: QTransform</a>组件组成的实体，而另一个方面可以专注于<a href="qt3dinput-qmousehandler">Qt3DInput :: QMouseHandler</a>。

source: By itself a Entity is an empty shell. The behavior of a Entity object is defined by the <a href="qml-qt3d-core-component3d">Component3D</a> objects it references. Each Qt3D backend aspect will be able to interpret and process an Entity by recognizing which components it is made up of. One aspect may decide to only process entities composed of a single <a href="qml-qt3d-core-transform">Transform</a> component whilst another may focus on <a href="qml-qt3d-input-mousehandler">MouseHandler</a>.
zh_cn: 实体本身就是一个空壳。实体对象的行为由其引用的<a href="qml-qt3d-core-component3d">Component3D</a>对象定义。每个Qt3D后端方面都将能够通过识别实体由哪些组件来解释和处理该实体。一个方面可能决定仅处理由单个<a href="qml-qt3d-core-transform">Transform</a>组件组成的实体，而另一个方面可能会专注于<a href="qml-qt3d-input-mousehandler">MouseHandler</a>。

source: By leveraging the new view classes, one can achieve a lot of performance boost in many use cases. However, it is important to know that there might be some caveats. Therefore it is important to remember:
zh_cn: 通过利用新的视图类,可以在许多用例中实现大量的性能提升。然而,重要的是要知道,可能有一些注意事项。因此,重要的是要记住。

source: By making an item a child of another, you can achieve the most essential feature of item grouping: the items will move together, and all transformations are propagated from parent to child.
zh_cn: 通过使一个项目成为另一个项目的子项目,你可以实现项目分组最基本的功能:项目会一起移动,所有的转换都会从父项目传播到子项目。

source: By nature, a <a href="qml-qtquick3d-view3d">View3D</a> object, representing a 3D viewport in the 2D scene, can be easily combined with Qt Quick items, such as, Rectangle, Image, Text, around, below, or above the <a href="qml-qtquick3d-view3d">View3D</a> item, which itself is a Qt Quick <a href="qml-qtquick-item">Item</a>.
zh_cn: 从本质<a href="qml-qtquick3d-view3d">上讲</a>，代表2D场景中3D视口的View3D对象可以很容易地与Qt Quick项目结合在一起，例如Rectangle，Image，Text，位于<a href="qml-qtquick3d-view3d">View3D</a>项目周围，​​下方或上方的本身就是Qt Quick<a href="qml-qtquick-item">项目</a>。

source: By partitioning an application into simple, modular components, each contained in a single QML file, you can achieve faster application startup time and better control over memory usage, and reduce the number of active-but-invisible elements in your application.
zh_cn: 通过将应用程序分割成简单的、模块化的组件,每个组件都包含在一个QML文件中,你可以实现更快的应用程序启动时间,更好地控制内存使用,并减少应用程序中活动但不可见的元素的数量。

source: By pre-multiplying the projection matrix with this matrix, applications can continue to assume that Y is pointing upwards, and can set minDepth and maxDepth in the viewport to 0 and 1, respectively, without having to do any further corrections to the vertex Z positions. Geometry from OpenGL applications can then be used as-is, assuming a rasterization state matching the OpenGL culling and front face settings.
zh_cn: 通过用该矩阵对投影矩阵进行预乘,应用程序可以继续假设Y指向上方,并可以将视口中的minDepth和maxDepth分别设置为0和1,而无需对顶点Z位置进行任何进一步的修正。然后,来自OpenGL应用的几何体可以按原样使用,假设栅格化状态与OpenGL裁剪和前脸设置相匹配。

source: By reimplementing <a href="qabstractanimation#updateState">updateState</a>(), you can track the animation's state changes, which is particularly useful for animations that are not driven by time.
zh_cn: 通过重新实现<a href="qabstractanimation#updateState">updateState</a>（），您可以跟踪动画的状态变化，这对于不受时间驱动的动画特别有用。

source: By reimplementing this function, you can ensure that the page's fields are properly initialized based on fields from previous pages.
zh_cn: 通过重新实现这个函数,你可以确保页面的字段是基于以前页面的字段正确初始化的。

source: By reimplementing this function, you can ensure that the page's fields are properly initialized based on fields from previous pages. For example:
zh_cn: 通过重新实现这个函数,你可以确保页面的字段是基于以前页面的字段正确初始化的。例如

source: By reimplementing this function, you can specify a dynamic page order.
zh_cn: 通过重新实现这个函数,你可以指定一个动态的页面顺序。

source: By reimplementing this function, you can specify a dynamic page order. For example:
zh_cn: 通过重新实现这个函数,你可以指定一个动态的页面顺序。例如

source: By selecting the right parent object, this can often be made to clean up the module's data at the right moment.
zh_cn: 通过选择合适的父对象,往往可以在合适的时刻对模块的数据进行清理。

source: By setting the "window" or viewport rectangle, you perform a linear transformation of the coordinates. Note that each corner of the "window" maps to the corresponding corner of the viewport, and vice versa. For that reason it normally is a good idea to let the viewport and "window" maintain the same aspect ratio to prevent deformation:
zh_cn: 通过设置 "窗口 "或视口矩形,您可以执行坐标的线性变换。请注意,"窗口 "的每个角都会映射到视口的对应角,反之亦然。因此,通常最好让视口和 "窗口 "保持相同的纵横比,以防止变形。

source: By setting the canvasSize, tileSize and canvasWindow, the Canvas item can act as a large virtual canvas with many separately rendered tile rectangles. Only those tiles within the current canvas window are painted by the Canvas render engine.
zh_cn: 通过设置canvasSize、tileSize和canvasWindow,Canvas项可以作为一个大的虚拟画布,上面有许多单独渲染的瓷砖矩形。只有当前画布窗口内的瓷砖才会被Canvas渲染引擎绘制。

source: By setting the size policy on an anchor you can configure how the anchor can resize itself from its preferred spacing. For instance, if the anchor has the size policy <a href="qsizepolicy#Policy-enum">QSizePolicy::Minimum</a>, the spacing is the minimum size of the anchor. However, its size can grow up to the anchors maximum size. If the default size policy is <a href="qsizepolicy#Policy-enum">QSizePolicy::Fixed</a>, the anchor can neither grow or shrink, which means that the only size the anchor can have is the spacing. <a href="qsizepolicy#Policy-enum">QSizePolicy::Fixed</a> is the default size policy. <a href="qgraphicsanchor">QGraphicsAnchor</a> always has a minimum spacing of 0 and a very large maximum spacing.
zh_cn: 通过在锚点上设置大小策略，您可以配置锚点如何根据其首选间距调整自身大小。例如，如果锚点具有大小策略<a href="qsizepolicy#Policy-enum">QSizePolicy :: Minimum</a>，则间距是锚点的最小大小。但是，其大小可以增长到锚点的最大大小。如果默认大小策略是<a href="qsizepolicy#Policy-enum">QSizePolicy :: Fixed</a>，则锚点既不能增长也不能缩小，这意味着锚点只能具有间距。<a href="qsizepolicy#Policy-enum">QSizePolicy :: Fixed</a>是默认大小策略。<a href="qgraphicsanchor">QGraphicsAnchor</a>的最小间距始终为0，最大间距非常大。

source: By setting the value to 2, 4, etc. multisampled rendering can be requested for a part of the scene without enabling multisampling for the entire scene. This way multisampling is applied only to a given subtree, which can lead to significant performance gains since multisampling is not applied to other parts of the scene.
zh_cn: 通过将该值设置为2、4等,可以要求对场景的一部分进行多采样渲染,而不对整个场景启用多采样。这样多采样只应用于一个给定的子树,由于多采样不应用于场景的其他部分,因此可以显著提高性能。

source: By specifying a base name and an extension, <a href="qt3dextras-qskyboxentity">Qt3DExtras::QSkyboxEntity</a> will take care of building a <a href="qml-qt3d-render-texturecubemap">TextureCubeMap</a> to be rendered at runtime. The images in the source directory should match the pattern: <b>base</b> name + * "_posx|_posy|_posz|_negx|_negy|_negz" + extension
zh_cn: 通过指定基本名称和扩展名，<a href="qt3dextras-qskyboxentity">Qt3DExtras :: QSkyboxEntity</a>将负责构建<a href="qml-qt3d-render-texturecubemap">TextureCubeMap</a>以在运行时呈现。源目录中的图像应与以下模式匹配：<b>基本</b>名称+ *&ldquo; _posx | _posy | _posz | _negx | _negy | _negz&rdquo; +扩展名

source: By specifying a base name and an extension, <a href="qt3dextras-qskyboxentity">Qt3DExtras::QSkyboxEntity</a> will take care of building a TextureCubeMap to be rendered at runtime. The images in the source directory should match the pattern: <b>base</b> name + * "_posx|_posy|_posz|_negx|_negy|_negz" + extension
zh_cn: 通过指定基本名称和扩展名，<a href="qt3dextras-qskyboxentity">Qt3DExtras :: QSkyboxEntity</a>将负责构建TextureCubeMap以在运行时呈现。源目录中的图像应与以下模式匹配：<b>基本</b>名称+ *&ldquo; _posx | _posy | _posz | _negx | _negy | _negz&rdquo; +扩展名

source: By specifying a base name and an extension, SkyboxEntity will take care of building a <a href="qml-qt3d-render-texturecubemap">TextureCubeMap</a> to be rendered at runtime. The images in the source directory should match the pattern: <b>base</b> name + * "_posx|_posy|_posz|_negx|_negy|_negz" + extension
zh_cn: 通过指定基本名称和扩展名，SkyboxEntity将负责构建<a href="qml-qt3d-render-texturecubemap">TextureCubeMap</a>以在运行时呈现。源目录中的图像应与以下模式匹配：<b>基本</b>名称+ *&ldquo; _posx | _posy | _posz | _negx | _negy | _negz&rdquo; +扩展名

source: By specifying multiple horizontal or vertical anchors you can control the size of an item. Below,
zh_cn: 通过指定多个水平或垂直锚,您可以控制项目的大小。下面是

source: By specifying the logical layout once, you get the following benefits:
zh_cn: 通过指定一次逻辑布局,你可以得到以下好处。

source: By subclassing <a href="qiodevice">QIODevice</a>, you can provide the same interface to your own I/O devices. Subclasses of <a href="qiodevice">QIODevice</a> are only required to implement the protected <a href="qiodevice#readData">readData</a>() and <a href="qiodevice#writeData">writeData</a>() functions. <a href="qiodevice">QIODevice</a> uses these functions to implement all its convenience functions, such as <a href="qiodevice#getChar">getChar</a>(), <a href="qiodevice#readLine">readLine</a>() and <a href="qiodevice#write">write</a>(). <a href="qiodevice">QIODevice</a> also handles access control for you, so you can safely assume that the device is opened in write mode if <a href="qiodevice#writeData">writeData</a>() is called.
zh_cn: 通过子类化<a href="qiodevice">QIODevice</a>，您可以为自己的I / O设备提供相同的接口。<a href="qiodevice">QIODevice的</a>子类仅需要实现受保护的<a href="qiodevice#readData">readData</a>（）和<a href="qiodevice#writeData">writeData</a>（）函数。<a href="qiodevice">QIODevice</a>使用这些功能来实现其所有便利功能，例如<a href="qiodevice#getChar">getChar</a>（），<a href="qiodevice#readLine">readLine</a>（）和<a href="qiodevice#write">write</a>（）。<a href="qiodevice">QIODevice</a>还会为您处理访问控制，因此，如果<a href="qiodevice#writeData">调用writeData</a>（），则可以安全地假定设备以写模式打开。

source: By subclassing QIODevice, you can provide the same interface to your own I/O devices. Subclasses of QIODevice are only required to implement the protected <a href="qiodevice#readData">readData</a>() and <a href="qiodevice#writeData">writeData</a>() functions. QIODevice uses these functions to implement all its convenience functions, such as <a href="qiodevice#getChar">getChar</a>(), <a href="qiodevice#readLine">readLine</a>() and <a href="qiodevice#write">write</a>(). QIODevice also handles access control for you, so you can safely assume that the device is opened in write mode if <a href="qiodevice#writeData">writeData</a>() is called.
zh_cn: 通过子类化QIODevice，可以为您自己的I / O设备提供相同的接口。QIODevice的子类仅需要实现受保护的<a href="qiodevice#readData">readData</a>（）和<a href="qiodevice#writeData">writeData</a>（）函数。QIODevice使用这些功能来实现其所有便利功能，例如<a href="qiodevice#getChar">getChar</a>（），<a href="qiodevice#readLine">readLine</a>（）和<a href="qiodevice#write">write</a>（）。QIODevice还会为您处理访问控制，因此，如果<a href="qiodevice#writeData">调用writeData</a>（），则可以安全地假定设备以写模式打开。

source: By unifying this with the rest of the QML world, styles become more familiar to developers and hopefully easier to understand for beginners. As a consequence, the following API had to be removed:
zh_cn: 通过将其与QML世界的其他部分统一起来,样式变得更加为开发者所熟悉,希望对初学者来说更容易理解。因此,以下的API不得不被删除。

source: By using <a href="qhelpfilterdata#setComponents">setComponents</a>() you may constrain the search results to documents that belong only to components specified on the given list. By using <a href="qhelpfilterdata#setVersions">setVersions</a>() you may constrain the search results to documents that belong only to versions specified on the given list.
zh_cn: 通过使用<a href="qhelpfilterdata#setComponents">setComponents</a>（），您可以将搜索结果限制为仅属于给定列表中指定的组件的文档。通过使用<a href="qhelpfilterdata#setVersions">setVersions</a>（），您可以将搜索结果限制为仅属于给定列表中指定版本的文档。

source: By using <code>LITERAL_HASH</code> in this way, the <code>#</code> character can be used to construct a URL for the <code>message()</code> function to print to the console.
zh_cn: 通过以这种方式使用 <code>LITERAL_HASH</code> ， <code>#</code> 字符可用于构造URL，以供 <code>message()</code> 函数打印到控制台。
