Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/qt/qt.*.123.xlf
Languages: es, ko, zh_cn

source: Enabling this feature requires to use the <a href="qnearfieldtarget#disconnect">disconnect</a>() function too, to close the connection manually and enable communication with the target from a different instance. Disabling this feature will also close an open connection.
es: Habilitar esta funci&oacute;n requiere usar la funci&oacute;n <a href="qnearfieldtarget#disconnect">desconectar</a> () tambi&eacute;n, para cerrar la conexi&oacute;n manualmente y habilitar la comunicaci&oacute;n con el objetivo desde una instancia diferente. La desactivaci&oacute;n de esta funci&oacute;n tambi&eacute;n cerrar&aacute; una conexi&oacute;n abierta.
ko: 이 기능을 활성화하려면 <a href="qnearfieldtarget#disconnect">disconnect</a> () 기능도 사용해야합니다 . 연결을 수동으로 닫고 다른 인스턴스에서 대상과의 통신을 가능하게합니다. 이 기능을 비활성화하면 열린 연결도 닫힙니다.

source: Encapsulate a <a href="qt3drender-qabstractlight">QAbstractLight</a> object in a Qt 3D scene. <a href="#details">More...</a>
es: Encapsule un objeto <a href="qt3drender-qabstractlight">QAbstractLight</a> en una escena Qt 3D. <a href="#details">M&aacute;s...</a>
ko: Qt 3D 장면에서 <a href="qt3drender-qabstractlight">QAbstractLight</a> 객체를 캡슐화합니다 . <a href="#details">더...</a>

source: Encapsulate a <a href="qt3drender-qabstractlight">QAbstractLight</a> object in a Qt 3D scene. <a href="qt3drender-qabstractlight#details">More...</a>
es: Encapsule un objeto <a href="qt3drender-qabstractlight">QAbstractLight</a> en una escena Qt 3D. <a href="qt3drender-qabstractlight#details">M&aacute;s...</a>
ko: Qt 3D 장면에서 <a href="qt3drender-qabstractlight">QAbstractLight</a> 객체를 캡슐화합니다 . <a href="qt3drender-qabstractlight#details">더...</a>

source: Encapsulate a Directional Light object in a Qt 3D scene
es: Encapsular un objeto de luz direccional en una escena Qt 3D
ko: Qt 3D 장면에서 Directional Light 오브젝트 캡슐화

source: Encapsulate a Directional Light object in a Qt 3D scene. <a href="#details">More...</a>
es: Encapsule un objeto de luz direccional en una escena Qt 3D. <a href="#details">M&aacute;s...</a>
ko: Qt 3D 장면에서 Directional Light 오브젝트를 캡슐화합니다. <a href="#details">더...</a>

source: Encapsulate a Directional Light object in a Qt 3D scene. <a href="qt3drender-qdirectionallight#details">More...</a>
es: Encapsule un objeto de luz direccional en una escena Qt 3D. <a href="qt3drender-qdirectionallight#details">M&aacute;s...</a>
ko: Qt 3D 장면에서 Directional Light 오브젝트를 캡슐화합니다. <a href="qt3drender-qdirectionallight#details">더...</a>

source: Encapsulate a Point Light object in a Qt 3D scene
es: Encapsular un objeto de luz puntual en una escena Qt 3D
ko: Qt 3D 장면에서 포인트 라이트 오브젝트 캡슐화

source: Encapsulate a Point Light object in a Qt 3D scene. <a href="#details">More...</a>
es: Encapsule un objeto Point Light en una escena Qt 3D. <a href="#details">M&aacute;s...</a>
ko: Qt 3D 장면에서 Point Light 객체를 캡슐화합니다. <a href="#details">더...</a>

source: Encapsulate a Point Light object in a Qt 3D scene. <a href="qt3drender-qpointlight#details">More...</a>
es: Encapsule un objeto Point Light en una escena Qt 3D. <a href="qt3drender-qpointlight#details">M&aacute;s...</a>
ko: Qt 3D 장면에서 Point Light 객체를 캡슐화합니다. <a href="qt3drender-qpointlight#details">더...</a>

source: Encapsulate a QAbstractLight object in a Qt 3D scene
es: Encapsular un objeto QAbstractLight en una escena Qt 3D
ko: Qt 3D 장면에서 QAbstractLight 객체 캡슐화

source: Encapsulate a QAbstractLight object in a Qt 3D scene. <a href="#details">More...</a>
es: Encapsule un objeto QAbstractLight en una escena Qt 3D. <a href="#details">M&aacute;s...</a>
ko: Qt 3D 장면에서 QAbstractLight 객체를 캡슐화합니다. <a href="#details">더...</a>

source: Encapsulate a QAbstractLight object in a Qt 3D scene. <a href="qt3drender-qabstractlight#details">More...</a>
ko: Qt 3D 장면에서 QAbstractLight 개체를 캡슐화합니다. <a href="qt3drender-qabstractlight#details">더...</a>

source: Encapsulate a Spot Light object in a Qt 3D scene
es: Encapsular un objeto de Spot Light en una escena Qt 3D
ko: Qt 3D 장면에서 스팟 라이트 오브젝트 캡슐화

source: Encapsulate a Spot Light object in a Qt 3D scene. <a href="#details">More...</a>
es: Encapsule un objeto Spot Light en una escena Qt 3D. <a href="#details">M&aacute;s...</a>
ko: Qt 3D 장면에서 스포트라이트 오브젝트를 캡슐화합니다. <a href="#details">더...</a>

source: Encapsulate a Spot Light object in a Qt 3D scene. <a href="qt3drender-qspotlight#details">More...</a>
es: Encapsule un objeto Spot Light en una escena Qt 3D. <a href="qt3drender-qspotlight#details">M&aacute;s...</a>
ko: Qt 3D 장면에서 스포트라이트 오브젝트를 캡슐화합니다. <a href="qt3drender-qspotlight#details">더...</a>

source: Encapsulate an environment light object in a Qt 3D scene
es: Encapsular un objeto de luz ambiental en una escena Qt 3D
ko: Qt 3D 장면에서 환경 조명 개체 캡슐화

source: Encapsulate an environment light object in a Qt 3D scene. <a href="#details">More...</a>
es: Encapsule un objeto de luz ambiental en una escena Qt 3D. <a href="#details">M&aacute;s...</a>
ko: Qt 3D 장면에서 환경 조명 개체를 캡슐화합니다. <a href="#details">더...</a>

source: Encapsulate an environment light object in a Qt 3D scene. <a href="qt3drender-qenvironmentlight#details">More...</a>
es: Encapsule un objeto de luz ambiental en una escena Qt 3D. <a href="qt3drender-qenvironmentlight#details">M&aacute;s...</a>
ko: Qt 3D 장면에서 환경 조명 개체를 캡슐화합니다. <a href="qt3drender-qenvironmentlight#details">더...</a>

source: Encapsulates a JSON array
es: Encapsula una matriz JSON
ko: JSON 배열을 캡슐화

source: Encapsulates a JSON object
es: Encapsula un objeto JSON
ko: JSON 객체를 캡슐화

source: Encapsulates a QML component definition. <a href="#details">More...</a>
es: Encapsula una definici&oacute;n de componente QML. <a href="#details">M&aacute;s...</a>
ko: QML 구성 요소 정의를 캡슐화합니다. <a href="#details">더...</a>

source: Encapsulates a Render Pass
es: Encapsula un pase de Render
ko: 렌더 패스 캡슐화

source: Encapsulates a Render Pass. <a href="#details">More...</a>
es: Encapsula un Render Pass. <a href="#details">M&aacute;s...</a>
ko: 렌더 패스를 캡슐화합니다. <a href="#details">더...</a>

source: Encapsulates a Render Pass. <a href="qt3drender-qrenderpass#details">More...</a>
es: Encapsula un Render Pass. <a href="qt3drender-qrenderpass#details">M&aacute;s...</a>
ko: 렌더 패스를 캡슐화합니다. <a href="qt3drender-qrenderpass#details">더...</a>

source: Encapsulates a Shader Program
es: Encapsula un programa de sombreado
ko: 셰이더 프로그램 캡슐화

source: Encapsulates a Shader Program. <a href="#details">More...</a>
es: Encapsula un programa de sombreado. <a href="#details">M&aacute;s...</a>
ko: 셰이더 프로그램을 캡슐화합니다. <a href="#details">더...</a>

source: Encapsulates a Shader Program. <a href="qt3drender-qshaderprogram#details">More...</a>
es: Encapsula un programa de sombreado. <a href="qt3drender-qshaderprogram#details">M&aacute;s...</a>
ko: 셰이더 프로그램을 캡슐화합니다. <a href="qt3drender-qshaderprogram#details">더...</a>

source: Encapsulates a Technique
es: Encapsula una técnica
ko: 기술 캡슐화

source: Encapsulates a Technique. <a href="#details">More...</a>
es: Encapsula una t&eacute;cnica. <a href="#details">M&aacute;s...</a>
ko: 기술을 캡슐화합니다. <a href="#details">더...</a>

source: Encapsulates a Technique. <a href="qt3drender-qtechnique#details">More...</a>
es: Encapsula una t&eacute;cnica. <a href="qt3drender-qtechnique#details">M&aacute;s...</a>
ko: 기술을 캡슐화합니다. <a href="qt3drender-qtechnique#details">더...</a>

source: Encapsulates a database record
es: Encapsula un registro de la base de datos
ko: 데이터베이스 레코드를 캡슐화

source: Encapsulates a delegate and when to use it. <a href="#details">More...</a>
es: Encapsula un delegado y cu&aacute;ndo usarlo. <a href="#details">M&aacute;s...</a>
ko: 델리게이트를 캡슐화하고 사용시기. <a href="#details">더...</a>

source: Encapsulates a filtered set of visual data items. <a href="#details">More...</a>
es: Encapsula un conjunto filtrado de elementos de datos visuales. <a href="#details">M&aacute;s...</a>
ko: 필터링 된 시각적 데이터 항목 세트를 캡슐화합니다. <a href="#details">더...</a>

source: Encapsulates a key sequence as used by shortcuts
es: Encapsula una secuencia clave como la utilizada por los atajos
ko: 바로 가기에서 사용되는 키 시퀀스를 캡슐화합니다.

source: Encapsulates a model and delegate. <a href="#details">More...</a>
es: Encapsula un modelo y delega. <a href="#details">M&aacute;s...</a>
ko: 모델과 델리게이트를 캡슐화합니다. <a href="#details">더...</a>

source: Encapsulates a simple table model. <a href="#details">More...</a>
ko: 간단한 테이블 모델을 캡슐화합니다. <a href="#details">더...</a>

source: Encapsulates a target (usually a frame buffer object) which the renderer can render into
es: Encapsula un objetivo (normalmente un objeto de memoria intermedia)que el renderizador puede convertir en
ko: 렌더러가 렌더링 할 수있는 대상 (일반적으로 프레임 버퍼 객체)을 캡슐화합니다.

source: Encapsulates a value in JSON
es: Encapsula un valor en JSON
ko: JSON에서 값을 캡슐화

source: Encapsulates an OpenGL framebuffer object
es: Encapsula un objeto framebuffer OpenGL
ko: OpenGL 프레임 버퍼 객체를 캡슐화

source: Encapsulates blending information: specifies how the incoming values (what's going to be drawn) are going to affect the existing values (what is already drawn)
es: Encapsula la información de mezcla:especifica cómo los valores entrantes (lo que se va a dibujar)van a afectar a los valores existentes (lo que ya está dibujado)
ko: 혼합 정보 캡슐화 : 들어오는 값 (그릴 것)이 기존 값 (이미 그려진 것)에 어떤 영향을 미치는지 지정

source: Encapsulates blending information: specifies how the incoming values (what's going to be drawn) are going to affect the existing values (what is already drawn). <a href="#details">More...</a>
es: Encapsula la informaci&oacute;n de combinaci&oacute;n: especifica c&oacute;mo los valores entrantes (lo que se dibujar&aacute;) afectar&aacute;n a los valores existentes (lo que ya est&aacute; dibujado). <a href="#details">M&aacute;s...</a>
ko: 혼합 정보 캡슐화 : 들어오는 값 (그릴 것)이 기존 값 (이미 그려진 것)에 영향을주는 방식을 지정합니다. <a href="#details">더...</a>

source: Encapsulates blending information: specifies how the incoming values (what's going to be drawn) are going to affect the existing values (what is already drawn). <a href="qt3drender-qblendequationarguments#details">More...</a>
es: Encapsula la informaci&oacute;n de combinaci&oacute;n: especifica c&oacute;mo los valores entrantes (lo que se dibujar&aacute;) afectar&aacute;n a los valores existentes (lo que ya est&aacute; dibujado). <a href="qt3drender-qblendequationarguments#details">M&aacute;s...</a>
ko: 혼합 정보 캡슐화 : 들어오는 값 (그릴 것)이 기존 값 (이미 그려진 것)에 영향을주는 방식을 지정합니다. <a href="qt3drender-qblendequationarguments#details">더...</a>

source: Encapsulates geometry
es: Encapsula la geometría
ko: 지오메트리 캡슐화

source: Encapsulates geometry rendering
es: Encapsula la representación de la geometría
ko: 지오메트리 렌더링 캡슐화

source: Encapsulates geometry rendering. <a href="#details">More...</a>
es: Encapsula el renderizado de geometr&iacute;a. <a href="#details">M&aacute;s...</a>
ko: 지오메트리 렌더링을 캡슐화합니다. <a href="#details">더...</a>

source: Encapsulates geometry rendering. <a href="qt3drender-qgeometryrenderer#details">More...</a>
es: Encapsula el renderizado de geometr&iacute;a. <a href="qt3drender-qgeometryrenderer#details">M&aacute;s...</a>
ko: 지오메트리 렌더링을 캡슐화합니다. <a href="qt3drender-qgeometryrenderer#details">더...</a>

source: Encapsulates geometry. <a href="#details">More...</a>
es: Encapsula la geometr&iacute;a. <a href="#details">M&aacute;s...</a>
ko: 지오메트리를 캡슐화합니다. <a href="#details">더...</a>

source: Encapsulates geometry. <a href="qt3drender-qgeometry#details">More...</a>
es: Encapsula la geometr&iacute;a. <a href="qt3drender-qgeometry#details">M&aacute;s...</a>
ko: 지오메트리를 캡슐화합니다. <a href="qt3drender-qgeometry#details">더...</a>

source: Encapsulates rendering state for a shader program
es: Encapsula el estado de representación para un programa de sombreado
ko: 셰이더 프로그램의 렌더링 상태를 캡슐화합니다.

source: Encapsulates the common Look and Feel of a GUI
es: Encapsula el aspecto común de una interfaz gráfica de usuario
ko: GUI의 일반적인 모양과 느낌을 캡슐화

source: Encapsulates the current rendering state during a call to <a href="qsgmaterialrhishader#updateUniformData">QSGMaterialRhiShader::updateUniformData</a>() and the other <code>update</code> type of functions. <a href="#details">More...</a>
ko: <a href="qsgmaterialrhishader#updateUniformData">QSGMaterialRhiShader :: updateUniformData</a> () 및 기타 <code>update</code> 유형의 함수를 호출하는 동안 현재 렌더링 상태를 캡슐화합니다 . <a href="#details">더...</a>

source: Encapsulates the data of an HTML5 web notification. <a href="#details">More...</a>
ko: HTML5 웹 알림의 데이터를 캡슐화합니다. <a href="#details">더...</a>

source: Encapsulates the different types of length used in a QTextDocument
es: Encapsula los diferentes tipos de longitud utilizados en un documento de texto.
ko: QTextDocument에 사용 된 다른 유형의 길이를 캡슐화합니다.

source: Encapsulates the necessary information to create an OpenGL texture image
es: Encapsula la información necesaria para crear una imagen de textura OpenGL
ko: OpenGL 텍스처 이미지를 만들기 위해 필요한 정보를 캡슐화합니다

source: Encapsulates the necessary information to create an OpenGL texture image from an image source
es: Encapsula la información necesaria para crear una imagen de textura OpenGL a partir de una fuente de imagen
ko: 이미지 소스에서 OpenGL 텍스처 이미지를 생성하는 데 필요한 정보를 캡슐화

source: Encapsulates the necessary information to create an OpenGL texture image from an image source. <a href="#details">More...</a>
es: Encapsula la informaci&oacute;n necesaria para crear una imagen de textura OpenGL a partir de una fuente de imagen. <a href="#details">M&aacute;s...</a>
ko: 이미지 소스에서 OpenGL 텍스처 이미지를 작성하는 데 필요한 정보를 캡슐화합니다. <a href="#details">더...</a>

source: Encapsulates the necessary information to create an OpenGL texture image from an image source. <a href="qt3drender-qtextureimage#details">More...</a>
es: Encapsula la informaci&oacute;n necesaria para crear una imagen de textura OpenGL a partir de una fuente de imagen. <a href="qt3drender-qtextureimage#details">M&aacute;s...</a>
ko: 이미지 소스에서 OpenGL 텍스처 이미지를 작성하는 데 필요한 정보를 캡슐화합니다. <a href="qt3drender-qtextureimage#details">더...</a>

source: Encapsulates the necessary information to create an OpenGL texture image. <a href="#details">More...</a>
es: Encapsula la informaci&oacute;n necesaria para crear una imagen de textura OpenGL. <a href="#details">M&aacute;s...</a>
ko: OpenGL 텍스처 이미지를 작성하는 데 필요한 정보를 캡슐화합니다. <a href="#details">더...</a>

source: Encapsulates the necessary information to create an OpenGL texture image. <a href="qt3drender-qabstracttextureimage#details">More...</a>
es: Encapsula la informaci&oacute;n necesaria para crear una imagen de textura OpenGL. <a href="qt3drender-qabstracttextureimage#details">M&aacute;s...</a>
ko: OpenGL 텍스처 이미지를 작성하는 데 필요한 정보를 캡슐화합니다. <a href="qt3drender-qabstracttextureimage#details">더...</a>

source: Encapsulates the result of an asynchronous method call. <a href="#details">More...</a>
ko: 비동기 메서드 호출의 결과를 캡슐화합니다. <a href="#details">더...</a>

source: Encapsulates the return value, represented by
ko: 다음으로 표시되는 반환 값을 캡슐화합니다.

source: Encodes the byte array as Base64
es: Codifica la matriz de bytes como Base64
ko: 바이트 배열을 Base64로 인코딩

source: Encodes the byte array as Base64url
es: Codifica la matriz de bytes como Base64url
ko: 바이트 배열을 Base64url로 인코딩

source: Encodes the byte array as hex
es: Codifica la matriz de bytes como un hexágono
ko: 바이트 배열을 16 진수로 인코딩합니다

source: Encodes this <a href="qcborvalue">QCborValue</a> object to its CBOR representation, using the options specified in
es: Codifica este objeto <a href="qcborvalue">QCborValue</a> en su representaci&oacute;n CBOR, utilizando las opciones especificadas en
ko: 에 지정된 옵션을 사용 하여이 <a href="qcborvalue">QCborValue</a> 오브젝트를 CBOR 표시로 인코딩 합니다.

source: Encoding exported data
es: Codificación de los datos exportados
ko: 내 보낸 데이터 인코딩

source: Encoding will aim to have a constant quality, adjusting bitrate to fit.
es: La codificación tendrá como objetivo tener una calidad constante,ajustando el bitrate para que encaje.
ko: 인코딩은 비트 레이트를 맞추기 위해 일정한 품질을 유지하는 것을 목표로합니다.

source: Encoding will aim to have a constant quality, adjusting bitrate to fit. This is the default. The bitrate setting will be ignored.
es: La codificación tendrá como objetivo tener una calidad constante,ajustando la tasa de bits para que encaje.Este es el valor por defecto.El ajuste de la tasa de bits será ignorado.
ko: 인코딩은 비트 레이트를 맞추기 위해 일정한 품질을 유지하는 것을 목표로합니다. 이것이 기본값입니다. 비트 전송률 설정이 무시됩니다.

source: Encoding will try to keep an average bitrate setting, but will use more or less as needed.
es: La codificación intentará mantener un ajuste de velocidad de bits promedio,pero utilizará más o menos según sea necesario.
ko: 인코딩은 평균 비트 전송률 설정을 유지하려고하지만 필요에 따라 다소 사용합니다.

source: Encoding will use a constant bit rate, adjust quality to fit.
es: La codificación usará una tasa de bits constante,ajustando la calidad para que encaje.
ko: 인코딩은 일정한 비트 전송률을 사용하여 품질을 조정합니다.

source: Encoding will use a constant bit rate, adjust quality to fit. This is appropriate if you are trying to optimize for space.
es: La codificación usará una tasa de bits constante,ajustando la calidad para que encaje.Esto es apropiado si está tratando de optimizar el espacio.
ko: 인코딩은 일정한 비트 전송률을 사용하여 품질을 조정합니다. 공간을 최적화하려는 경우에 적합합니다.

source: End moves to the end (maximum).
es: El final se mueve hacia el final (máximo).
ko: 끝은 끝으로 이동합니다 (최대).

source: End of touch-event sequence (<a href="qtouchevent">QTouchEvent</a>).
es: Fin de la secuencia de eventos <a href="qtouchevent">t&aacute;ctiles</a> ( QTouchEvent ).
ko: 터치 이벤트 시퀀스의 끝 ( <a href="qtouchevent">QTouchEvent</a> ).

source: End users can interact with the rendered graph by using either the mouse or touch to rotate, zoom, or select data. Graphs can be rotated freely by holding down the right mouse button and moving the mouse. Zooming is done by rolling the mouse wheel. Selecting, if enabled, is done by pressing the left mouse button. The scene can be reset to the default camera view by clicking the mouse wheel. In touch devices, rotation is done by tap-and-move, selection by tap-and-hold, and zoom by pinch.
es: Los usuarios finales pueden interactuar con el gráfico renderizado usando el ratón o el tacto para rotar,hacer zoom o seleccionar datos.Los gráficos pueden rotarse libremente manteniendo pulsado el botón derecho del ratón y moviendo el ratón.El zoom se hace rodando la rueda del ratón.La selección,si está activada,se hace presionando el botón izquierdo del ratón.La escena se puede restablecer a la vista de cámara predeterminada haciendo clic en la rueda del ratón.En los dispositivos táctiles,la rotación se realiza mediante "tocar y mover",la selección mediante "tocar y mantener" y el zoom mediante "pellizcar".
ko: 최종 사용자는 마우스 또는 터치를 사용하여 데이터를 회전, 확대 / 축소 또는 선택하여 렌더링 된 그래프와 상호 작용할 수 있습니다. 마우스 오른쪽 버튼을 누른 상태에서 마우스를 움직여 그래프를 자유롭게 회전 할 수 있습니다. 마우스 휠을 굴리면 확대 / 축소됩니다. 활성화 된 경우 마우스 왼쪽 버튼을 눌러 선택합니다. 마우스 휠을 클릭하면 장면을 기본 카메라보기로 재설정 할 수 있습니다. 터치 장치에서 탭 앤 이동, 탭 앤 홀드로 선택 및 핀치로 확대 / 축소로 회전이 수행됩니다.

source: End, Ctrl+E
es: Fin,Ctrl+E
ko: 종료, Ctrl + E

source: EndOfMedia - the media has played to the end.
es: EndOfMedia-los medios de comunicación han jugado hasta el final.
ko: EndOfMedia-미디어가 끝까지 재생되었습니다.

source: Ending a service name with the character '*' will match all service names within the specified namespace.
es: Terminar un nombre de servicio con el carácter '*' coincidirá con todos los nombres de servicio dentro del espacio de nombres especificado.
ko: 문자 '*'로 서비스 이름을 끝내면 지정된 네임 스페이스 내의 모든 서비스 이름과 일치합니다.

source: Ends a column insertion operation.
es: Termina la operación de inserción de la columna.
ko: 열 삽입 작업을 종료합니다.

source: Ends a column move operation.
es: Termina una operación de movimiento de columna.
ko: 열 이동 작업을 종료합니다.

source: Ends a column removal operation.
es: Termina una operación de retirada de la columna.
ko: 열 제거 작업을 종료합니다.

source: Ends a drag sequence by sending a drop event to the target item.
es: Termina una secuencia de arrastre enviando un evento de arrastre al elemento objetivo.
ko: 드롭 이벤트를 대상 항목으로 보내서 드래그 시퀀스를 종료합니다.

source: Ends a drag sequence.
es: Termina una secuencia de arrastre.
ko: 드래그 시퀀스를 종료합니다.

source: Ends a row insertion operation.
es: Termina una operación de inserción de filas.
ko: 행 삽입 작업을 종료합니다.

source: Ends a row move operation.
es: Termina una operación de movimiento de fila.
ko: 행 이동 작업을 종료합니다.

source: Ends a row removal operation.
es: Termina una operación de remoción de hileras.
ko: 행 제거 작업을 종료합니다.

source: Ends composition of a macro command.
es: Termina la composición de un macro comando.
ko: 매크로 명령의 구성을 종료합니다.

source: Ends painting.
es: Termina de pintar.
ko: 페인팅을 종료합니다.

source: Ends painting. Any resources used while painting are released. You don't normally need to call this since it is called by the destructor.
es: Termina de pintar.Cualquier recurso utilizado mientras se pinta es liberado.Normalmente no es necesario llamar a esto ya que es llamado por el destructor.
ko: 페인팅을 종료합니다. 페인팅하는 동안 사용 된 모든 리소스가 해제됩니다. 소멸자가 호출하기 때문에 일반적으로 이것을 호출 할 필요는 없습니다.

source: Ends the layout process.
es: Termina el proceso de diseño.
ko: 레이아웃 프로세스를 종료합니다.

source: Ends the trace interaction with the input engine.
es: Termina la interacción de la traza con el motor de entrada.
ko: 입력 엔진과의 추적 상호 작용을 종료합니다.

source: Engine Configuration
es: Configuración del motor
ko: 엔진 구성

source: Engine-specific accessors, like <a href="qsgrendererinterface#getResource">getResource</a>(), are however available only after the scenegraph is initialized. Additionally, there may be backend-specific limitations on when such functions can be called. The only way that is guaranteed to succeed is calling them when the rendering of a node (i.e. the preparation of the command list for the next frame) is active. In practice this typically means <a href="qsgrendernode#render">QSGRenderNode::render</a>().
es: Sin embargo , los descriptores de acceso espec&iacute;ficos del motor, como <a href="qsgrendererinterface#getResource">getResource</a> (), est&aacute;n disponibles solo despu&eacute;s de inicializar el gr&aacute;fico de escenas . Adem&aacute;s, puede haber limitaciones espec&iacute;ficas de backend sobre cu&aacute;ndo se pueden llamar tales funciones. La &uacute;nica forma de que se garantice el &eacute;xito es llamarlos cuando la representaci&oacute;n de un nodo (es decir, la preparaci&oacute;n de la lista de comandos para el siguiente marco) est&aacute; activa. En la pr&aacute;ctica, esto normalmente significa <a href="qsgrendernode#render">QSGRenderNode :: render</a> ().
ko: 그러나 <a href="qsgrendererinterface#getResource">getResource</a> () 와 같은 엔진 별 접근 자는 장면 그래프가 초기화 된 후에 만 ​​사용할 수 있습니다. 또한 이러한 함수를 호출 할 수있는시기에 대한 백엔드 별 제한이있을 수 있습니다. 성공을 보장하는 유일한 방법은 노드의 렌더링 (즉, 다음 프레임에 대한 명령 목록 준비)이 활성화 된 경우이를 호출하는 것입니다. 실제로 이것은 일반적으로 <a href="qsgrendernode#render">QSGRenderNode :: render</a> ()를 의미 합니다.

source: English (American)
es: Inglés (americano)
ko: 영어 (미국식)

source: English (American) Layout
es: Diseño inglés (americano)
ko: 영어 (미국) 레이아웃

source: English (British)
es: Inglés (británico)
ko: 영어 (영국식)

source: English (British) Layout
es: Diseño inglés (británico)
ko: 영어 (영국식) 레이아웃

source: English - Canada
es: Inglés-Canadá
ko: 영어-캐나다

source: English - Philippines
es: Inglés-Filipinas
ko: 영어-필리핀

source: English - United Kingdom
es: Inglés-Reino Unido
ko: 영어-영국

source: English - United States
es: Inglés-Estados Unidos
ko: 영어-미국

source: Enhance or reduce the overall contrast of the tonemap. Range is <code>[-1...2]</code>. <code>0</code> by default.
ko: 톤맵의 전체적인 대비를 높이거나 줄입니다. 범위는 <code>[-1...2]</code> 입니다. 기본적으로 <code>0</code> 입니다.

source: Ensure that <b>Triangulation</b> is checked on, unless you already have triangulated all meshes.
ko: 모든 메시를 이미 삼각 측량하지 않은 경우 <b>삼각 측량</b> 이 켜져 있는지 확인합니다 .

source: Ensure that a sensible default option is checked.
es: Asegúrese de que esté marcada una opción predeterminada razonable.
ko: 적절한 기본 옵션이 선택되어 있는지 확인하십시오.
