Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/qt/qt.*.123.xlf
Languages: es, ko, zh_cn

source: Equivalent to GL_R11F_G11F_B10F
es: Equivalente a GL_R11F_G11F_B10F
ko: GL_R11F_G11F_B10F와 동일

source: Equivalent to GL_R16
es: Equivalente a GL_R16
ko: GL_R16에 해당

source: Equivalent to GL_R16F
es: Equivalente a GL_R16F
ko: GL_R16F와 동일

source: Equivalent to GL_R16I
es: Equivalente a GL_R16I
ko: GL_R16I와 동일

source: Equivalent to GL_R16UI
es: Equivalente a GL_R16UI
ko: GL_R16UI와 동일

source: Equivalent to GL_R16_SNORM
es: Equivalente a GL_R16_SNORM
ko: GL_R16_SNORM와 동일

source: Equivalent to GL_R32F
es: Equivalente a GL_R32F
ko: GL_R32F와 동일

source: Equivalent to GL_R32I
es: Equivalente a GL_R32I
ko: GL_R32I와 동일

source: Equivalent to GL_R32UI
es: Equivalente a GL_R32UI
ko: GL_R32UI와 동일

source: Equivalent to GL_R3_G3_B2
es: Equivalente a GL_R3_G3_B2
ko: GL_R3_G3_B2와 동일

source: Equivalent to GL_R8
es: Equivalente a GL_R8
ko: GL_R8와 동일

source: Equivalent to GL_R8I
es: Equivalente a GL_R8I
ko: GL_R8I와 동일

source: Equivalent to GL_R8UI
es: Equivalente a GL_R8UI
ko: GL_R8UI와 동일

source: Equivalent to GL_R8_SNORM
es: Equivalente a GL_R8_SNORM
ko: GL_R8_SNORM와 동일

source: Equivalent to GL_RED
es: Equivalente a GL_RED
ko: GL_RED와 동일

source: Equivalent to GL_RED_INTEGER
es: Equivalente a GL_RED_INTEGER
ko: GL_RED_INTEGER와 동일

source: Equivalent to GL_RG
es: Equivalente a GL_RG
ko: GL_RG와 동일

source: Equivalent to GL_RG16
es: Equivalente a GL_RG16
ko: GL_RG16와 동일

source: Equivalent to GL_RG16F
es: Equivalente a GL_RG16F
ko: GL_RG16F와 동일

source: Equivalent to GL_RG16I
es: Equivalente a GL_RG16I
ko: GL_RG16I와 동일

source: Equivalent to GL_RG16UI
es: Equivalente a GL_RG16UI
ko: GL_RG16UI와 동일

source: Equivalent to GL_RG16_SNORM
es: Equivalente a GL_RG16_SNORM
ko: GL_RG16_SNORM와 동일

source: Equivalent to GL_RG32F
es: Equivalente a GL_RG32F
ko: GL_RG32F와 동일

source: Equivalent to GL_RG32I
es: Equivalente a GL_RG32I
ko: GL_RG32I와 동일

source: Equivalent to GL_RG32UI
es: Equivalente a GL_RG32UI
ko: GL_RG32UI와 동일

source: Equivalent to GL_RG8
es: Equivalente a GL_RG8
ko: GL_RG8와 동일

source: Equivalent to GL_RG8I
es: Equivalente a GL_RG8I
ko: GL_RG8I와 동일

source: Equivalent to GL_RG8UI
es: Equivalente a GL_RG8UI
ko: GL_RG8UI와 동일

source: Equivalent to GL_RG8_SNORM
es: Equivalente a GL_RG8_SNORM
ko: GL_RG8_SNORM와 동일

source: Equivalent to GL_RGB
es: Equivalente a GL_RGB
ko: GL_RGB와 동일

source: Equivalent to GL_RGB (OpenGL ES 2 only)
es: Equivalente a GL_RGB (OpenGL ES 2 solamente)
ko: GL_RGB와 동일 (OpenGL ES 2 만 해당)

source: Equivalent to GL_RGB10_A2UI
es: Equivalente a GL_RGB10_A2UI
ko: GL_RGB10_A2UI와 동일

source: Equivalent to GL_RGB16
es: Equivalente a GL_RGB16
ko: GL_RGB16에 해당

source: Equivalent to GL_RGB16F
es: Equivalente a GL_RGB16F
ko: GL_RGB16F와 동일

source: Equivalent to GL_RGB16I
es: Equivalente a GL_RGB16I
ko: GL_RGB16I와 동일

source: Equivalent to GL_RGB16UI
es: Equivalente a GL_RGB16UI
ko: GL_RGB16UI와 동일

source: Equivalent to GL_RGB16_SNORM
es: Equivalente a GL_RGB16_SNORM
ko: GL_RGB16_SNORM와 동일

source: Equivalent to GL_RGB32I
es: Equivalente a GL_RGB32I
ko: GL_RGB32I와 동일

source: Equivalent to GL_RGB32UI
es: Equivalente a GL_RGB32UI
ko: GL_RGB32UI와 동일

source: Equivalent to GL_RGB565
es: Equivalente a GL_RGB565
ko: GL_RGB565와 동일

source: Equivalent to GL_RGB5_A1
es: Equivalente a GL_RGB5_A1
ko: GL_RGB5_A1에 해당

source: Equivalent to GL_RGB8
es: Equivalente a GL_RGB8
ko: GL_RGB8와 동일

source: Equivalent to GL_RGB8I
es: Equivalente a GL_RGB8I
ko: GL_RGB8I와 동일

source: Equivalent to GL_RGB8UI
es: Equivalente a GL_RGB8UI
ko: GL_RGB8UI와 동일

source: Equivalent to GL_RGB8_SNORM
es: Equivalente a GL_RGB8_SNORM
ko: GL_RGB8_SNORM와 동일

source: Equivalent to GL_RGB9_E5
es: Equivalente a GL_RGB9_E5
ko: GL_RGB9_E5와 동일

source: Equivalent to GL_RGBA
es: Equivalente a GL_RGBA
ko: GL_RGBA와 동일

source: Equivalent to GL_RGBA (OpenGL ES 2 only)
es: Equivalente a GL_RGBA (OpenGL ES 2 solamente)
ko: GL_RGBA와 동일 (OpenGL ES 2 만 해당)

source: Equivalent to GL_RGBA16
es: Equivalente a GL_RGBA16
ko: GL_RGBA16와 동일

source: Equivalent to GL_RGBA16F
es: Equivalente a GL_RGBA16F
ko: GL_RGBA16F와 동일

source: Equivalent to GL_RGBA16I
es: Equivalente a GL_RGBA16I
ko: GL_RGBA16I와 동일

source: Equivalent to GL_RGBA16UI
es: Equivalente a GL_RGBA16UI
ko: GL_RGBA16UI와 동일

source: Equivalent to GL_RGBA16_SNORM
es: Equivalente a GL_RGBA16_SNORM
ko: GL_RGBA16_SNORM와 동일

source: Equivalent to GL_RGBA32F
es: Equivalente a GL_RGBA32F
ko: GL_RGBA32F와 동일

source: Equivalent to GL_RGBA32I
es: Equivalente a GL_RGBA32I
ko: GL_RGBA32I와 동일

source: Equivalent to GL_RGBA32UI
es: Equivalente a GL_RGBA32UI
ko: GL_RGBA32UI와 동일

source: Equivalent to GL_RGBA4
es: Equivalente a GL_RGBA4
ko: GL_RGBA4와 동일

source: Equivalent to GL_RGBA8
es: Equivalente a GL_RGBA8
ko: GL_RGBA8와 동일

source: Equivalent to GL_RGBA8I
es: Equivalente a GL_RGBA8I
ko: GL_RGBA8I와 동일

source: Equivalent to GL_RGBA8UI
es: Equivalente a GL_RGBA8UI
ko: GL_RGBA8UI와 동일

source: Equivalent to GL_RGBA8_SNORM
es: Equivalente a GL_RGBA8_SNORM
ko: GL_RGBA8_SNORM와 동일

source: Equivalent to GL_RGBA_INTEGER
es: Equivalente a GL_RGBA_INTEGER
ko: GL_RGBA_INTEGER와 동일

source: Equivalent to GL_RGB_INTEGER
es: Equivalente a GL_RGB_INTEGER
ko: GL_RGB_INTEGER와 동일

source: Equivalent to GL_RG_INTEGER
es: Equivalente a GL_RG_INTEGER
ko: GL_RG_INTEGER와 동일

source: Equivalent to GL_SHORT
es: Equivalente a GL_SHORT
ko: GL_SHORT와 동일

source: Equivalent to GL_SRGB8
es: Equivalente a GL_SRGB8
ko: GL_SRGB8와 동일

source: Equivalent to GL_SRGB8_ALPHA8
es: Equivalente a GL_SRGB8_ALPHA8
ko: GL_SRGB8_ALPHA8와 동일

source: Equivalent to GL_STENCIL_INDEX.
es: Equivalente a GL_STENCIL_INDEX.
ko: GL_STENCIL_INDEX와 동일합니다.

source: Equivalent to GL_STENCIL_INDEX. Introduced in Qt 5.4
es: Equivalente a GL_STENCIL_INDEX.Introducido en el Qt 5.4
ko: GL_STENCIL_INDEX와 동일합니다. Qt 5.4에 도입

source: Equivalent to GL_STENCIL_INDEX8. Introduced in Qt 5.4
es: Equivalente a GL_STENCIL_INDEX8.Introducido en el Qt 5.4
ko: GL_STENCIL_INDEX8과 동일합니다. Qt 5.4에 도입

source: Equivalent to GL_TEXTURE_BINDING_1D
es: Equivalente a GL_TEXTURE_BINDING_1D
ko: GL_TEXTURE_BINDING_1D와 동일

source: Equivalent to GL_TEXTURE_BINDING_1D_ARRAY
es: Equivalente a GL_TEXTURE_BINDING_1D_ARRAY
ko: GL_TEXTURE_BINDING_1D_ARRAY와 동일

source: Equivalent to GL_TEXTURE_BINDING_2D
es: Equivalente a GL_TEXTURE_BINDING_2D
ko: GL_TEXTURE_BINDING_2D와 동일

source: Equivalent to GL_TEXTURE_BINDING_2D_ARRAY
es: Equivalente a GL_TEXTURE_BINDING_2D_ARRAY
ko: GL_TEXTURE_BINDING_2D_ARRAY와 동일

source: Equivalent to GL_TEXTURE_BINDING_2D_MULTISAMPLE
es: Equivalente a GL_TEXTURE_BINDING_2D_MULTISAMPLE
ko: GL_TEXTURE_BINDING_2D_MULTISAMPLE에 해당

source: Equivalent to GL_TEXTURE_BINDING_2D_MULTISAMPLE_ARRAY
es: Equivalente a GL_TEXTURE_BINDING_2D_MULTISAMPLE_ARRAY
ko: GL_TEXTURE_BINDING_2D_MULTISAMPLE_ARRAY와 동일

source: Equivalent to GL_TEXTURE_BINDING_3D
es: Equivalente a GL_TEXTURE_BINDING_3D
ko: GL_TEXTURE_BINDING_3D와 동일

source: Equivalent to GL_TEXTURE_BINDING_BUFFER
es: Equivalente a GL_TEXTURE_BINDING_BUFFER
ko: GL_TEXTURE_BINDING_BUFFER와 동일

source: Equivalent to GL_TEXTURE_BINDING_CUBE_MAP
es: Equivalente a GL_TEXTURE_BINDING_CUBE_MAPE
ko: GL_TEXTURE_BINDING_CUBE_MAP와 동일

source: Equivalent to GL_TEXTURE_BINDING_CUBE_MAP_ARRAY
es: Equivalente a GL_TEXTURE_BINDING_CUBE_MAPE_ARRAY
ko: GL_TEXTURE_BINDING_CUBE_MAP_ARRAY와 동일

source: Equivalent to GL_TEXTURE_BINDING_RECTANGLE
es: Equivalente a GL_TEXTURE_BINDING_RECTANGLE
ko: GL_TEXTURE_BINDING_RECTANGLE와 동일

source: Equivalent to GL_TEXTURE_CUBE_MAP_NEGATIVE_X
es: Equivalente a GL_TEXTURE_CUBE_MAPE_NEGATIVE_X
ko: GL_TEXTURE_CUBE_MAP_NEGATIVE_X와 동일

source: Equivalent to GL_TEXTURE_CUBE_MAP_NEGATIVE_Y
es: Equivalente a GL_TEXTURE_CUBE_MAPE_NEGATIVE_Y
ko: GL_TEXTURE_CUBE_MAP_NEGATIVE_Y와 동일

source: Equivalent to GL_TEXTURE_CUBE_MAP_NEGATIVE_Z
es: Equivalente a GL_TEXTURE_CUBE_MAPE_NEGATIVE_Z
ko: GL_TEXTURE_CUBE_MAP_NEGATIVE_Z와 동일

source: Equivalent to GL_TEXTURE_CUBE_MAP_POSITIVE_X
es: Equivalente a GL_TEXTURE_CUBE_MAPE_POSITIVE_X
ko: GL_TEXTURE_CUBE_MAP_POSITIVE_X와 동일

source: Equivalent to GL_TEXTURE_CUBE_MAP_POSITIVE_Y
es: Equivalente a GL_TEXTURE_CUBE_MAPE_POSITIVE_Y
ko: GL_TEXTURE_CUBE_MAP_POSITIVE_Y와 동일

source: Equivalent to GL_TEXTURE_CUBE_MAP_POSITIVE_Z
es: Equivalente a GL_TEXTURE_CUBE_MAPE_POSITIVE_Z
ko: GL_TEXTURE_CUBE_MAP_POSITIVE_Z와 동일

source: Equivalent to GL_UNSIGNED_BYTE
es: Equivalente a GL_UNSIGNED_BYTE
ko: GL_UNSIGNED_BYTE와 동일

source: Equivalent to GL_UNSIGNED_BYTE_2_3_3_REV
es: Equivalente a GL_UNSIGNED_BYTE_2_3_3_REV
ko: GL_UNSIGNED_BYTE_2_3_3_REV와 동일

source: Equivalent to GL_UNSIGNED_BYTE_3_3_2
es: Equivalente a GL_UNSIGNED_BYTE_3_3_2
ko: GL_UNSIGNED_BYTE_3_3_2와 동일

source: Equivalent to GL_UNSIGNED_INT
es: Equivalente a GL_UNSIGNED_INT
ko: GL_UNSIGNED_INT와 동일

source: Equivalent to GL_UNSIGNED_INT_10F_11F_11F_REV
es: Equivalente a GL_UNSIGNED_INT_10F_11F_11F_REV
ko: GL_UNSIGNED_INT_10F_11F_11F_REV와 동일

source: Equivalent to GL_UNSIGNED_INT_10_10_10_2
es: Equivalente a GL_UNSIGNED_INT_10_10_10_2
ko: GL_UNSIGNED_INT_10_10_10_2와 동일

source: Equivalent to GL_UNSIGNED_INT_24_8. Introduced in Qt 5.4
es: Equivalente a GL_UNSIGNED_INT_24_8.Introducido en el Qt 5.4
ko: GL_UNSIGNED_INT_24_8과 동일합니다. Qt 5.4에 도입

source: Equivalent to GL_UNSIGNED_INT_2_10_10_10_REV
es: Equivalente a GL_UNSIGNED_INT_2_10_10_REV
ko: GL_UNSIGNED_INT_2_10_10_10_REV와 동일

source: Equivalent to GL_UNSIGNED_INT_5_9_9_9_REV
es: Equivalente a GL_UNSIGNED_INT_5_9_9_9_REV
ko: GL_UNSIGNED_INT_5_9_9_9_REV와 동일

source: Equivalent to GL_UNSIGNED_INT_8_8_8_8
es: Equivalente a GL_UNSIGNED_INT_8_8_8
ko: GL_UNSIGNED_INT_8_8_8_8와 동일

source: Equivalent to GL_UNSIGNED_INT_8_8_8_8_REV
es: Equivalente a GL_UNSIGNED_INT_8_8_8_REV
ko: GL_UNSIGNED_INT_8_8_8_8_REV와 동일

source: Equivalent to GL_UNSIGNED_SHORT
es: Equivalente a GL_UNSIGNED_SHORT
ko: GL_UNSIGNED_SHORT와 동일

source: Equivalent to GL_UNSIGNED_SHORT_1_5_5_5_REV
es: Equivalente a GL_UNSIGNED_SHORT_1_5_5_5_REV
ko: GL_UNSIGNED_SHORT_1_5_5_5_REV와 동일

source: Equivalent to GL_UNSIGNED_SHORT_4_4_4_4
es: Equivalente a GL_UNSIGNED_SHORT_4_4_4
ko: GL_UNSIGNED_SHORT_4_4_4_4와 동일

source: Equivalent to GL_UNSIGNED_SHORT_4_4_4_4_REV
es: Equivalente a GL_UNSIGNED_SHORT_4_4_4_4_REV
ko: GL_UNSIGNED_SHORT_4_4_4_4_REV와 동일

source: Equivalent to GL_UNSIGNED_SHORT_5_5_5_1
es: Equivalente a GL_UNSIGNED_SHORT_5_5_5_1
ko: GL_UNSIGNED_SHORT_5_5_5_1에 해당

source: Equivalent to GL_UNSIGNED_SHORT_5_6_5
es: Equivalente a GL_UNSIGNED_SHORT_5_6_5
ko: GL_UNSIGNED_SHORT_5_6_5와 동일

source: Equivalent to GL_UNSIGNED_SHORT_5_6_5_REV
es: Equivalente a GL_UNSIGNED_SHORT_5_6_5_REV
ko: GL_UNSIGNED_SHORT_5_6_5_REV와 동일

source: Equivalent to SP_ArrowLeft when the current layout direction is <a href="qt#LayoutDirection-enum">Qt::LeftToRight</a>, otherwise SP_ArrowRight.
es: Equivalente a SP_ArrowLeft cuando la direcci&oacute;n de dise&ntilde;o actual es <a href="qt#LayoutDirection-enum">Qt :: LeftToRight</a> , de lo contrario SP_ArrowRight.
ko: 현재 레이아웃 방향이 <a href="qt#LayoutDirection-enum">Qt :: LeftToRight</a> 이면 SP_ArrowLeft와 같고, 그렇지 않으면 SP_ArrowRight입니다.

source: Equivalent to SP_ArrowRight when the current layout direction is <a href="qt#LayoutDirection-enum">Qt::LeftToRight</a>, otherwise SP_ArrowLeft.
es: Equivalente a SP_ArrowRight cuando la direcci&oacute;n de dise&ntilde;o actual es <a href="qt#LayoutDirection-enum">Qt :: LeftToRight</a> , de lo contrario SP_ArrowLeft.
ko: 현재 레이아웃 방향이 <a href="qt#LayoutDirection-enum">Qt :: LeftToRight</a> 인 경우 SP_ArrowRight와 같으며, 그렇지 않으면 SP_ArrowLeft입니다.

source: Equivalent to calling <a href="qjsondocument#array">array</a>().at(i).
es: Equivalente a llamar a <a href="qjsondocument#array">array</a> () .at (i).
ko: <a href="qjsondocument#array">배열</a> () .at (i) 를 호출하는 것과 같습니다 .

source: Equivalent to calling <a href="qjsondocument#object">object</a>().value(key).
es: Equivalente a llamar a <a href="qjsondocument#object">object</a> () .value (key).
ko: 호출 <a href="qjsondocument#object">객체</a> () .value (key)와 같습니다.

source: Equivalent to calling <a href="qjsonvalue#toArray-1">toArray</a>().at(i).
es: Equivalente a llamar a <a href="qjsonvalue#toArray-1">toArray</a> () .at (i).
ko: <a href="qjsonvalue#toArray-1">toArray</a> () .at (i) 를 호출하는 것과 같습니다 .

source: Equivalent to calling <a href="qjsonvalue#toObject-1">toObject</a>().value(key).
es: Equivalente a llamar a <a href="qjsonvalue#toObject-1">toObject</a> () .value (key).
ko: <a href="qjsonvalue#toObject-1">toObject</a> () .value (key) 를 호출하는 것과 같습니다 .

source: Equivalent to calling <a href="qmediatimerange#addInterval">addInterval</a>() for each interval in
es: Equivalente a llamar a <a href="qmediatimerange#addInterval">addInterval</a> () para cada intervalo en
ko: 각 간격에 대해 <a href="qmediatimerange#addInterval">addInterval</a> () 을 호출하는 것과 같습니다 .

source: Equivalent to calling <a href="qmediatimerange#removeInterval">removeInterval</a>() for each interval in
es: Equivalente a llamar a <a href="qmediatimerange#removeInterval">removeInterval</a> () para cada intervalo en
ko: 각 간격에 대해 <a href="qmediatimerange#removeInterval">removeInterval</a> () 을 호출하는 것과 같습니다 .

source: Equivalent to calling <a href="qwindow#setWindowStates">setWindowStates</a>(<a href="qt#WindowState-enum">Qt::WindowFullScreen</a>) and then <a href="qwindow#visible-prop">setVisible</a>(true).
es: Equivalente a llamar <a href="qwindow#setWindowStates">setWindowStates</a> ( <a href="qt#WindowState-enum">Qt :: WindowFullScreen</a> ) y luego <a href="qwindow#visible-prop">setVisible</a> (verdadero).
ko: <a href="qwindow#setWindowStates">setWindowStates</a> ( <a href="qt#WindowState-enum">Qt :: WindowFullScreen</a> ) 를 호출 한 다음 <a href="qwindow#visible-prop">setVisible</a> (true) 을 호출하는 것과 같습니다 .

source: Equivalent to calling <a href="qwindow#setWindowStates">setWindowStates</a>(<a href="qt#WindowState-enum">Qt::WindowMaximized</a>) and then <a href="qwindow#visible-prop">setVisible</a>(true).
es: Equivalente a llamar <a href="qwindow#setWindowStates">setWindowStates</a> ( <a href="qt#WindowState-enum">Qt :: WindowMaximized</a> ) y luego <a href="qwindow#visible-prop">setVisible</a> (verdadero).
ko: <a href="qwindow#setWindowStates">setWindowStates</a> ( <a href="qt#WindowState-enum">Qt :: WindowMaximized</a> ) 를 호출 한 다음 <a href="qwindow#visible-prop">setVisible</a> (true) 을 호출하는 것과 같습니다 .

source: Equivalent to calling <a href="qwindow#setWindowStates">setWindowStates</a>(<a href="qt#WindowState-enum">Qt::WindowMinimized</a>) and then <a href="qwindow#visible-prop">setVisible</a>(true).
es: Equivalente a llamar <a href="qwindow#setWindowStates">setWindowStates</a> ( <a href="qt#WindowState-enum">Qt :: WindowMinimized</a> ) y luego <a href="qwindow#visible-prop">setVisible</a> (verdadero).
ko: <a href="qwindow#setWindowStates">setWindowStates</a> ( <a href="qt#WindowState-enum">Qt :: WindowMinimized</a> ) 를 호출 한 다음 <a href="qwindow#visible-prop">setVisible</a> (true) 을 호출하는 것과 같습니다 .

source: Equivalent to calling <a href="qwindow#setWindowStates">setWindowStates</a>(<a href="qt#WindowState-enum">Qt::WindowNoState</a>) and then <a href="qwindow#visible-prop">setVisible</a>(true).
es: Equivalente a llamar a <a href="qwindow#setWindowStates">setWindowStates</a> ( <a href="qt#WindowState-enum">Qt :: WindowNoState</a> ) y luego <a href="qwindow#visible-prop">setVisible</a> (verdadero).
ko: <a href="qwindow#setWindowStates">setWindowStates</a> ( <a href="qt#WindowState-enum">Qt :: WindowNoState</a> ) 를 호출 한 다음 <a href="qwindow#visible-prop">setVisible</a> (true) 을 호출하는 것과 같습니다 .

source: Equivalent to calling <a href="qwindow#visible-prop">setVisible</a>(false).
es: Equivalente a llamar a <a href="qwindow#visible-prop">setVisible</a> (falso).
ko: <a href="qwindow#visible-prop">setVisible</a> 을 호출하는 것과 같습니다 (false).

source: Equivalent to connect(
es: Equivalente a conectar(
ko: 연결과 동일

source: Equivalent to passing calling <code>insertItem(menuItems.length, text)</code>.
es: Equivalente a pasar llamar a <code>insertItem(menuItems.length, text)</code> .
ko: <code>insertItem(menuItems.length, text)</code> 호출을 전달하는 것과 같습니다 .

source: Equivalent to setting <a href="qml-qtquick-window-window#visibility-attached-prop">visibility</a> to <a href="qwindow#Visibility-enum">FullScreen</a>.
es: Equivalente a configurar la <a href="qml-qtquick-window-window#visibility-attached-prop">visibilidad</a> en <a href="qwindow#Visibility-enum">FullScreen</a> .
ko: <a href="qml-qtquick-window-window#visibility-attached-prop">가시성</a> 을 <a href="qwindow#Visibility-enum">FullScreen</a> 으로 설정하는 것과 같습니다 .

source: Equivalent to setting <a href="qml-qtquick-window-window#visibility-attached-prop">visibility</a> to <a href="qwindow#Visibility-enum">Maximized</a>.
es: Equivalente a configurar la <a href="qml-qtquick-window-window#visibility-attached-prop">visibilidad</a> en <a href="qwindow#Visibility-enum">Maximizado</a> .
ko: <a href="qml-qtquick-window-window#visibility-attached-prop">가시성</a> 을 <a href="qwindow#Visibility-enum">최대화</a> 로 설정하는 것과 같습니다 .

source: Equivalent to setting <a href="qml-qtquick-window-window#visibility-attached-prop">visibility</a> to <a href="qwindow#Visibility-enum">Minimized</a>.
es: Equivalente a configurar la <a href="qml-qtquick-window-window#visibility-attached-prop">visibilidad</a> en <a href="qwindow#Visibility-enum">Minimizado</a> .
ko: <a href="qml-qtquick-window-window#visibility-attached-prop">가시성</a> 을 <a href="qwindow#Visibility-enum">최소화</a> 로 설정하는 것과 같습니다 .

source: Equivalent to setting <a href="qml-qtquick-window-window#visibility-attached-prop">visibility</a> to <a href="qwindow#Visibility-enum">Windowed</a>.
es: Equivalente a configurar la <a href="qml-qtquick-window-window#visibility-attached-prop">visibilidad</a> en <a href="qwindow#Visibility-enum">Ventana</a> .
ko: <a href="qml-qtquick-window-window#visibility-attached-prop">가시성</a> 을 <a href="qwindow#Visibility-enum">Windowed</a> 로 설정하는 것과 같습니다 .

source: Equivalent to setting <a href="qml-qtquick-window-window#visible-prop">visible</a> to <code>false</code> or <a href="qml-qtquick-window-window#visibility-attached-prop">visibility</a> to <a href="qwindow#Visibility-enum">Hidden</a>.
es: Equivalente a configurar <a href="qml-qtquick-window-window#visible-prop">visible</a> en <code>false</code> o <a href="qml-qtquick-window-window#visibility-attached-prop">visibilidad</a> en <a href="qwindow#Visibility-enum">Oculto</a> .
ko: 설정하는 것과 <a href="qml-qtquick-window-window#visible-prop">표시</a> 하는 <code>false</code> 또는 <a href="qml-qtquick-window-window#visibility-attached-prop">시야</a> 에 <a href="qwindow#Visibility-enum">숨겨진</a> .

source: Equivalent to the value of QMAKE_APPLICATION_BUNDLE_NAME, QMAKE_PLUGIN_BUNDLE_NAME, or <a href="#qmake-framework-bundle-name">QMAKE_FRAMEWORK_BUNDLE_NAME</a> (depending on the type of target being created), or TARGET if none of the previous values are set.
es: Equivalente al valor de QMAKE_APPLICATION_BUNDLE_NAME, QMAKE_PLUGIN_BUNDLE_NAME o <a href="#qmake-framework-bundle-name">QMAKE_FRAMEWORK_BUNDLE_NAME</a> (seg&uacute;n el tipo de destino que se est&aacute; creando), o TARGET si no se establece ninguno de los valores anteriores.
ko: 작성중인 대상 유형에 따라 QMAKE_APPLICATION_BUNDLE_NAME, QMAKE_PLUGIN_BUNDLE_NAME 또는 <a href="#qmake-framework-bundle-name">QMAKE_FRAMEWORK_BUNDLE_NAME</a> 값 또는 이전 값이 설정되지 않은 경우 TARGET 값과 같습니다.

source: Equivalent to the value of QMAKE_APPLICATION_BUNDLE_NAME, QMAKE_PLUGIN_BUNDLE_NAME, or <a href="qmake-variable-reference#qmake-framework-bundle-name">QMAKE_FRAMEWORK_BUNDLE_NAME</a> (depending on the type of target being created), or TARGET if none of the previous values are set.
ko: QMAKE_APPLICATION_BUNDLE_NAME, QMAKE_PLUGIN_BUNDLE_NAME 또는 <a href="qmake-variable-reference#qmake-framework-bundle-name">QMAKE_FRAMEWORK_BUNDLE_NAME</a> 의 값 (작성중인 대상 유형에 따라 다름) 또는 이전 값이 설정되지 않은 경우 TARGET 값과 같습니다.

source: Equivalents of those variables will be available for all packages found with a <code>find_package</code> call. Note that the variables are case-sensitive.
es: Los equivalentes de esas variables estar&aacute;n disponibles para todos los paquetes encontrados con una llamada <code>find_package</code> . Tenga en cuenta que las variables distinguen entre may&uacute;sculas y min&uacute;sculas.
ko: <code>find_package</code> 호출로 찾은 모든 패키지에 해당 변수를 사용할 수 있습니다 . 변수는 대소 문자를 구분합니다.

source: Eraser end of a stylus-like device (the broad end of the pen).
es: El extremo de borrado de un dispositivo parecido a un lápiz (el extremo ancho del bolígrafo).
ko: 스타일러스와 같은 장치의 지우개 끝 (펜의 넓은 끝).

source: Erases all values that have been saved by the property tracking.
es: Borra todos los valores que han sido guardados por el seguimiento de la propiedad.
ko: 속성 추적으로 저장된 모든 값을 지 웁니다.

source: Erases the area inside the given
es: Borra el área dentro de la
ko: 지정된 내부 영역을 지 웁니다.

source: Erases the area inside the rectangle beginning at (
es: Borra el área dentro del rectángulo comenzando en (
ko: (에서 시작하는 사각형 내부 영역을 지 웁니다.

source: Error Handling
es: Manejo de errores
ko: 오류 처리

source: Error Objects
es: Objetos de error
ko: 오류 객체

source: Error Prototype Object
es: Objeto prototipo de error
ko: 오류 프로토 타입 객체

source: Error SENR0001 in file:///...file.xq, at line 1, column 1: Attribute xml:id can't be serialized because it appears at the top level.
es: Error SENR0001 en file:///...file.xq,en la línea 1,columna 1:Atributo xml:id no puede ser serializado porque aparece en el nivel superior.
ko: 1 행 1 열의 file : ///...file.xq에서 오류 SENR0001 : 속성 xml : id는 최상위 레벨에 표시되므로 직렬화 할 수 없습니다.

source: Error State Indicator
es: Indicador de estado de error
ko: 오류 상태 표시기

source: Error calling IDispatch member: Non-optional parameter missing
es: Error al llamar al miembro de IDispatch:Falta el parámetro no opcional
ko: IDispatch 멤버를 호출하는 중에 오류가 발생했습니다. 선택적 매개 변수가 없습니다.

source: Error calling IDispatch member: Type mismatch in parameter n
es: Error al llamar al miembro de IDispatch:Escriba la falta de coincidencia en el parámetro n
ko: IDispatch 멤버 호출 오류 : 매개 변수 n의 유형이 일치하지 않습니다.

source: Error checking
es: Comprobación de errores
ko: 오류 확인

source: Error codes
es: Códigos de error
ko: 에러 코드

source: Error in pairing
es: Error en el emparejamiento
ko: 페어링 오류

source: Error information can be retrieved with <a href="qsqlquerymodel#lastError">lastError</a>().
es: La informaci&oacute;n de error se puede recuperar con <a href="qsqlquerymodel#lastError">lastError</a> ().
ko: <a href="qsqlquerymodel#lastError">lastError</a> ()를 사용 하여 오류 정보를 검색 할 수 있습니다 .

source: Error is related to the DNS connection.
es: El error está relacionado con la conexión DNS.
ko: 오류는 DNS 연결과 관련이 있습니다.

source: Error is related to the FTP connection.
es: El error está relacionado con la conexión FTP.
ko: 오류는 FTP 연결과 관련이 있습니다.

source: Error is related to the HTTP connection.
es: El error está relacionado con la conexión HTTP.
ko: 오류는 HTTP 연결과 관련이 있습니다.

source: Error is related to the SSL/TLS certificate.
es: El error está relacionado con el certificado SSL/TLS.
ko: 오류는 SSL / TLS 인증서와 관련이 있습니다.

source: Error related to the DNS connection.
es: Error relacionado con la conexión DNS.
ko: DNS 연결과 관련된 오류입니다.

source: Error related to the FTP connection.
es: Error relacionado con la conexión FTP.
ko: FTP 연결과 관련된 오류입니다.

source: Error related to the HTTP connection.
es: Error relacionado con la conexión HTTP.
ko: HTTP 연결과 관련된 오류입니다.

source: Error related to the SSL/TLS certificate.
es: Error relacionado con el certificado SSL/TLS.
ko: SSL / TLS 인증서와 관련된 오류입니다.

source: Error results from a faulty network connection.
es: El error se debe a una conexión de red defectuosa.
ko: 네트워크 연결에 오류가 발생했습니다.

source: Error results from faulty network connection.
es: El error se debe a una conexión de red defectuosa.
ko: 네트워크 연결에 오류가 발생했습니다.

source: Error type is not known.
es: No se conoce el tipo de error.
ko: 오류 유형을 알 수 없습니다.
