Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/qt/qt.*.123.xlf
Languages: es, ko, zh_cn

source: Expands the specified wildcard pattern and returns a list of filenames. If <code>recursive</code> is true, this function descends into subdirectories.
es: Expande el patr&oacute;n de comod&iacute;n especificado y devuelve una lista de nombres de archivo. Si <code>recursive</code> es verdadero, esta funci&oacute;n desciende a subdirectorios.
ko: 지정된 와일드 카드 패턴을 확장하고 파일 이름 목록을 반환합니다. 경우 <code>recursive</code> 사실,이 함수는 하위 디렉토리로 내려.

source: Expands to a string that describe the function the macro resides in. How this string looks more specifically is compiler dependent. With GNU GCC it is typically the function signature, while with other compilers it might be the line and column number.
es: Se expande a una cadena que describe la función en la que reside el macro.El aspecto de esta cadena más específicamente depende del compilador.Con GNU GCC es típicamente la firma de la función,mientras que con otros compiladores podría ser el número de línea y columna.
ko: 매크로가 상주하는 함수를 설명하는 문자열로 확장합니다.이 문자열이보다 구체적으로 보이는 방식은 컴파일러에 따라 다릅니다. GNU GCC에서는 일반적으로 함수 시그니처이며 다른 컴파일러에서는 줄과 열 번호 일 수 있습니다.

source: Expands to paths defined by LC_RPATH mach-o commands in the current process executable or the referring libraries.
es: Se expande a las rutas definidas por los comandos de mach-o LC_RPATH en el ejecutable del proceso actual o en las bibliotecas de referencia.
ko: 현재 프로세스 실행 파일 또는 참조 라이브러리에서 LC_RPATH mach-o 명령으로 정의 된 경로로 확장됩니다.

source: Expands to the current process executable location.
es: Se expande a la ubicación actual del proceso ejecutable.
ko: 현재 프로세스 실행 파일 위치로 확장됩니다.

source: Expands to the referring executable or library location.
es: Se expande al ejecutable de referencia o a la ubicación de la biblioteca.
ko: 참조 실행 파일 또는 라이브러리 위치로 확장됩니다.

source: Expands to the size of a pointer in bytes (4 or 8). This is equivalent to <code>sizeof(void *)</code> but can be used in a preprocessor directive.
es: Se expande al tama&ntilde;o de un puntero en bytes (4 u 8). Esto es equivalente a <code>sizeof(void *)</code> pero se puede usar en una directiva de preprocesador.
ko: 바이트 단위의 포인터 크기 (4 또는 8)로 확장됩니다. 이것은 <code>sizeof(void *)</code> 와 동일 하지만 전 처리기 지시문에서 사용할 수 있습니다.

source: Expands to the target bundle's bundle identifier string, for example: <code>com.example.myapp</code>. Determined by concatenating the values of QMAKE_TARGET_BUNDLE_PREFIX and QMAKE_BUNDLE, separated by a full stop (<code>.</code>).
es: Se expande a la cadena de identificaci&oacute;n del paquete de destino, por ejemplo: <code>com.example.myapp</code> . Se determina concatenando los valores de QMAKE_TARGET_BUNDLE_PREFIX y QMAKE_BUNDLE, separados por un punto ( <code>.</code> ).
ko: 대상 번들의 번들 식별자 문자열로 확장됩니다 (예 : <code>com.example.myapp</code> ) . QMAKE_TARGET_BUNDLE_PREFIX 및 QMAKE_BUNDLE의 값을 전체 정지 ( <code>.</code> )로 분리하여 연결하여 결정됩니다 .

source: Expands to the value of <a href="#qmake-macosx-deployment-target">QMAKE_MACOSX_DEPLOYMENT_TARGET</a>.
es: Se expande al valor de <a href="#qmake-macosx-deployment-target">QMAKE_MACOSX_DEPLOYMENT_TARGET</a> .
ko: <a href="#qmake-macosx-deployment-target">QMAKE_MACOSX_DEPLOYMENT_TARGET</a> 값으로 확장됩니다 .

source: Expands to the value of <a href="#qmake-tvos-deployment-target">QMAKE_TVOS_DEPLOYMENT_TARGET</a>.
es: Se expande al valor de <a href="#qmake-tvos-deployment-target">QMAKE_TVOS_DEPLOYMENT_TARGET</a> .
ko: <a href="#qmake-tvos-deployment-target">QMAKE_TVOS_DEPLOYMENT_TARGET</a> 값으로 확장됩니다 .

source: Expands to the value of <a href="#qmake-watchos-deployment-target">QMAKE_WATCHOS_DEPLOYMENT_TARGET</a>.
es: Se expande al valor de <a href="#qmake-watchos-deployment-target">QMAKE_WATCHOS_DEPLOYMENT_TARGET</a> .
ko: <a href="#qmake-watchos-deployment-target">QMAKE_WATCHOS_DEPLOYMENT_TARGET</a> 값으로 확장됩니다 .

source: Expands to the value of <a href="qmake-variable-reference#qmake-macosx-deployment-target">QMAKE_MACOSX_DEPLOYMENT_TARGET</a>.
ko: <a href="qmake-variable-reference#qmake-macosx-deployment-target">QMAKE_MACOSX_DEPLOYMENT_TARGET</a> 값으로 확장됩니다 .

source: Expands to the value of <a href="qmake-variable-reference#qmake-tvos-deployment-target">QMAKE_TVOS_DEPLOYMENT_TARGET</a>.
ko: <a href="qmake-variable-reference#qmake-tvos-deployment-target">QMAKE_TVOS_DEPLOYMENT_TARGET</a> 값으로 확장됩니다 .

source: Expands to the value of <a href="qmake-variable-reference#qmake-watchos-deployment-target">QMAKE_WATCHOS_DEPLOYMENT_TARGET</a>.
ko: <a href="qmake-variable-reference#qmake-watchos-deployment-target">QMAKE_WATCHOS_DEPLOYMENT_TARGET</a> 값으로 확장됩니다 .

source: Expands to the value of ICON.
es: Se expande al valor de ICON.
ko: ICON의 가치로 확장합니다.

source: Expands to the value of QMAKE_IPHONEOS_DEPLOYMENT_TARGET.
es: Se expande al valor de QMAKE_IPHONEOS_DEPLOYMENT_TARGET.
ko: QMAKE_IPHONEOS_DEPLOYMENT_TARGET 값으로 확장됩니다.

source: Expands to the value of QMAKE_PKGINFO_TYPEINFO.
es: Se expande al valor de QMAKE_PKGINFO_TYPEINFO.
ko: QMAKE_PKGINFO_TYPEINFO 값으로 확장됩니다.

source: Expands to the value of VERSION expressed with three version components.
es: Se expande al valor de la VERSIÓN expresada con tres componentes de la versión.
ko: 세 가지 버전 구성 요소로 표현 된 VERSION의 값으로 확장됩니다.

source: Expands to the value of VERSION expressed with two version components.
es: Se expande al valor de la VERSIÓN expresada con dos componentes de la versión.
ko: 두 가지 버전 구성 요소로 표현 된 VERSION의 값으로 확장됩니다.

source: Expected footprint (download size): Wasm modules as produced by the compiler can be large, but compress well.
es: Huella esperada (tamaño de la descarga):Los módulos de Wasm,tal como los produce el compilador,pueden ser grandes,pero se comprimen bien.
ko: 예상되는 설치 공간 (다운로드 크기) : 컴파일러에서 생성 된 Wasm 모듈은 크지 만 압축률은 높습니다.

source: Expected use would look like:
ko: 예상되는 사용은 다음과 같습니다.

source: Explicit Source Size
es: Tamaño de la fuente explícita
ko: 명시 적 소스 크기

source: Explicitly Ignore Expected Warnings
ko: 예상되는 경고를 명시 적으로 무시

source: Explicitly constructs a <a href="qcborvalue">QCborValue</a> object that represents this map. This function is usually not necessary since <a href="qcborvalue">QCborValue</a> has a constructor for <a href="qcbormap">QCborMap</a>, so the conversion is implicit.
es: Construye expl&iacute;citamente un objeto <a href="qcborvalue">QCborValue</a> que representa este mapa. Esta funci&oacute;n generalmente no es necesaria ya que <a href="qcborvalue">QCborValue</a> tiene un constructor para <a href="qcbormap">QCborMap</a> , por lo que la conversi&oacute;n es impl&iacute;cita.
ko: 이 맵을 나타내는 <a href="qcborvalue">QCborValue</a> 객체를 명시 적으로 구축합니다 . <a href="qcborvalue">QCborValue에 QCborMap</a> 의 생성자가 <a href="qcbormap">있으므로이</a> 함수는 일반적으로 필요하지 않으므로 변환이 암시 적입니다.

source: Explicitly construcuts a <a href="qcborvalue">QCborValue</a> object that represents this array. This function is usually not necessary since <a href="qcborvalue">QCborValue</a> has a constructor for <a href="qcborarray">QCborArray</a>, so the conversion is implicit.
es: Construye expl&iacute;citamente un objeto <a href="qcborvalue">QCborValue</a> que representa esta matriz. Esta funci&oacute;n generalmente no es necesaria ya que <a href="qcborvalue">QCborValue</a> tiene un constructor para <a href="qcborarray">QCborArray</a> , por lo que la conversi&oacute;n es impl&iacute;cita.
ko: 이 배열을 나타내는 <a href="qcborvalue">QCborValue</a> 객체를 명시 적으로 해석 합니다. <a href="qcborvalue">QCborValue에 QCborArray</a> 의 생성자가 <a href="qcborarray">있으므로이</a> 함수는 일반적으로 필요하지 않으므로 변환이 암시 적입니다.

source: Explicitly creates a focus scope. <a href="#details">More...</a>
es: Crea expl&iacute;citamente un &aacute;mbito de enfoque. <a href="#details">M&aacute;s...</a>
ko: 초점 범위를 명시 적으로 만듭니다. <a href="#details">더...</a>

source: Explicitly sets the url <a href="qqmlcontext#resolvedUrl">resolvedUrl</a>() will use for relative references to
es: Establece expl&iacute;citamente la url <a href="qqmlcontext#resolvedUrl">resolveUrl</a> () que usar&aacute; para referencias relativas a
ko: URL <a href="qqmlcontext#resolvedUrl">resolvedUrl</a> ()이 상대 참조에 사용할 URL을 명시 적으로 설정합니다.

source: Explicitly sets this page to be final if
es: Explícitamente establece que esta página es definitiva si
ko: 이 페이지를 명시 적으로 최종 페이지로 설정

source: Explore Qt
es: Explorar Qt
ko: Qt 살펴보기

source: Export the plugin using the <a href="#Q_PLUGIN_METADATA">Q_PLUGIN_METADATA</a>() macro.
es: Exporte el complemento usando la macro <a href="#Q_PLUGIN_METADATA">Q_PLUGIN_METADATA</a> ().
ko: <a href="#Q_PLUGIN_METADATA">Q_PLUGIN_METADATA</a> () 매크로를 사용하여 플러그인을 내보내십시오 .

source: Export the plugin using the <a href="qtplugin#Q_PLUGIN_METADATA">Q_PLUGIN_METADATA</a>() macro.
ko: <a href="qtplugin#Q_PLUGIN_METADATA">Q_PLUGIN_METADATA</a> () 매크로를 사용하여 플러그인을 내 보냅니다 .

source: Exporting 9-Patch Images
es: Exportación de imágenes de 9 parches
ko: 9 패치 이미지 내보내기

source: Exporting C++ Classes
es: Exportación de clases C++
ko: C ++ 클래스 내보내기

source: Exporting C++ Properties
es: Exportación de las propiedades de C++
ko: C ++ 속성 내보내기

source: Exporting COLLADA from Blender
ko: 블렌더에서 COLLADA 내보내기

source: Exporting COLLADA from Modo
ko: Modo에서 COLLADA 내보내기

source: Exporting Cameras
ko: 카메라 내보내기

source: Exporting Designs from Graphics Software
es: Exportación de diseños desde el software de gráficos
ko: 그래픽 소프트웨어에서 디자인 내보내기

source: Exporting FBX from Blender
ko: 블렌더에서 FBX 내보내기

source: Exporting FBX from Modo
ko: Modo에서 FBX 내보내기

source: Exporting GeoJSON
ko: GeoJSON 내보내기

source: Exporting Lights
ko: 조명 내보내기

source: Exporting Models
ko: 모델 내보내기

source: Exporting OpenCOLLADA from 3D Studio Max
ko: 3D Studio Max에서 OpenCOLLADA 내보내기

source: Exporting OpenCOLLADA from Maya
ko: Maya에서 OpenCOLLADA 내보내기

source: Exporting from 3D Studio Max
ko: 3D Studio Max에서 내보내기

source: Exporting from Blender
ko: 블렌더에서 내보내기

source: Exporting from Different Tools
ko: 다른 도구에서 내보내기

source: Exporting from Maya
ko: Maya에서 내보내기

source: Exporting from Modo
ko: Modo에서 내보내기

source: Exporting your custom widget plugin to
es: Exportar tu plugin de widget personalizado a
ko: 사용자 정의 위젯 플러그인을

source: Exports the current value of <code>variablename</code> from the local context of a function to the global context.
es: Exporta el valor actual de <code>variablename</code> del contexto local de una funci&oacute;n al contexto global.
ko: <code>variablename</code> 의 현재 값을 함수의 로컬 컨텍스트에서 글로벌 컨텍스트로 내 보냅니다.

source: Exports unresolved and external symbols in the library so that they can be resolved in other dynamically-loaded libraries loaded later.
es: Exporta los símbolos no resueltos y externos en la biblioteca para que puedan ser resueltos en otras bibliotecas cargadas dinámicamente que se carguen posteriormente.
ko: 라이브러리에서 해석되지 않은 외부 심볼을 ​​내보내 나중에로드 된 다른 동적으로로드 된 라이브러리에서 해석 할 수 있도록합니다.

source: Expose events are sent to windows when an area of the window is invalidated, for example when window exposure in the windowing system changes.
es: Los eventos de exposición se envían a las ventanas cuando se invalida un área de la ventana,por ejemplo cuando cambia la exposición de la ventana en el sistema de ventanas.
ko: 창 영역에서 창 노출이 변경 될 때와 같이 창의 영역이 무효화되면 창에 노출 이벤트가 전송됩니다.

source: Exposes QObjects to remote HTML clients. <a href="#details">More...</a>
es: Expone QObjects a clientes HTML remotos. <a href="#details">M&aacute;s...</a>
ko: QObject를 원격 HTML 클라이언트에 노출합니다. <a href="#details">더...</a>

source: Exposing Attributes of C++ Types to QML
es: Exponer los atributos de los tipos C++al QML
ko: C ++ 유형의 속성을 QML에 노출

source: Exposing C++ Data Models to QML
es: Exponer los modelos de datos C++a QML
ko: C ++ 데이터 모델을 QML에 노출

source: Exposing Methods (Including Qt Slots)
es: Métodos de exposición (incluyendo ranuras Qt)
ko: 노출 방법 (Qt 슬롯 포함)

source: Exposing Properties
es: Exponer las propiedades
ko: 노출 속성

source: Exposing Signals
es: Exponer las señales
ko: 신호 노출

source: Exposing an Extension to Qt Designer
es: Exponer una extensión al diseñador de Qt
ko: Qt Designer에 확장 노출

source: Exposure and Visibility
es: Exposición y visibilidad
ko: 노출 및 가시성

source: Exposure compensation in EV units.
es: Compensación de la exposición en unidades EV.
ko: EV 단위의 노출 보정.

source: Exposure compensation property allows to adjust the automatically calculated exposure.
es: La propiedad de compensación de exposición permite ajustar la exposición calculada automáticamente.
ko: 노출 보정 속성을 사용하면 자동으로 계산 된 노출을 조정할 수 있습니다.

source: Exposure compensation, specified as qreal EV value.
es: Compensación de la exposición,especificada como valor EV qreal.
ko: 노출 보정으로, qreal EV 값으로 지정됩니다.

source: Exposure time, given in seconds.
es: Tiempo de exposición,dado en segundos.
ko: 초 단위의 노출 시간.

source: Expressing Supported iOS Versions
es: Expresando las versiones de iOS soportadas
ko: 지원되는 iOS 버전 표현

source: Expressions are not supported
es: No se admiten expresiones
ko: 식은 지원되지 않습니다

source: Extend any <a href="qwizard#WizardPixmap-enum">WatermarkPixmap</a> all the way down to the window's edge.
es: Extienda cualquier <a href="qwizard#WizardPixmap-enum">WatermarkPixmap</a> hasta el borde de la ventana.
ko: <a href="qwizard#WizardPixmap-enum">WatermarkPixmap을</a> 창 가장자리까지 확장하십시오 .

source: Extend selection to end of document.
es: Ampliar la selección hasta el final del documento.
ko: 선택을 문서 끝으로 확장합니다.

source: Extend selection to end of line.
es: Extender la selección hasta el final de la línea.
ko: 선택을 줄 끝으로 확장합니다.

source: Extend selection to next character.
es: Extender la selección al siguiente personaje.
ko: 선택을 다음 문자로 확장하십시오.

source: Extend selection to next line.
es: Extienda la selección a la siguiente línea.
ko: 선택을 다음 줄로 확장하십시오.

source: Extend selection to next page.
es: Amplíe la selección a la siguiente página.
ko: 다음 페이지로 선택을 확장하십시오.

source: Extend selection to next word.
es: Extender la selección a la siguiente palabra.
ko: 선택을 다음 단어로 확장하십시오.

source: Extend selection to previous character.
es: Ampliar la selección al personaje anterior.
ko: 선택을 이전 문자로 확장합니다.

source: Extend selection to previous line.
es: Ampliar la selección a la línea anterior.
ko: 선택을 이전 줄로 확장합니다.

source: Extend selection to previous page.
es: Ampliar la selección a la página anterior.
ko: 선택을 이전 페이지로 확장합니다.

source: Extend selection to previous word.
es: Ampliar la selección a la palabra anterior.
ko: 선택을 이전 단어로 확장합니다.

source: Extend selection to start of document.
es: Ampliar la selección al inicio del documento.
ko: 선택을 확장하여 문서를 시작합니다.

source: Extend selection to start of line.
es: Extender la selección al inicio de la línea.
ko: 선택을 확장하여 라인 시작.

source: Extend selection to the end of a text block. This shortcut is only used on <a href="internationalization#macos">macOS</a>.
es: Extiende la selecci&oacute;n hasta el final de un bloque de texto. Este acceso directo solo se usa en <a href="internationalization#macos">macOS</a> .
ko: 텍스트 블록 끝까지 선택을 확장합니다. 이 단축키는 <a href="internationalization#macos">macOS</a> 에서만 사용 됩니다 .

source: Extend selection to the end of a text block. This shortcut is only used on macOS.
ko: 선택 영역을 텍스트 블록 끝까지 확장합니다. 이 바로 가기는 macOS에서만 사용됩니다.

source: Extend selection to the start of a text block. This shortcut is only used on <a href="internationalization#macos">macOS</a>.
es: Extiende la selecci&oacute;n al inicio de un bloque de texto. Este acceso directo solo se usa en <a href="internationalization#macos">macOS</a> .
ko: 텍스트 블록의 시작 부분으로 선택을 확장합니다. 이 단축키는 <a href="internationalization#macos">macOS</a> 에서만 사용 됩니다 .

source: Extend selection to the start of a text block. This shortcut is only used on macOS.
ko: 선택 영역을 텍스트 블록의 시작 부분으로 확장합니다. 이 바로 가기는 macOS에서만 사용됩니다.

source: Extended Attributes
es: Atributos extendidos
ko: 확장 된 속성

source: Extended Device Identification. All of these data are device dependent and optional.
es: Identificación de dispositivos extendida.Todos estos datos dependen del dispositivo y son opcionales.
ko: 확장 장치 식별. 이러한 모든 데이터는 장치에 따라 다르며 선택 사항입니다.

source: Extended Service Discovery Profile UUID
es: Perfil de descubrimiento de servicio extendido UUID
ko: 확장 된 서비스 발견 프로파일 UUID

source: Extended identification (stream access and individual access).
es: Identificación ampliada (acceso a la corriente y acceso individual).
ko: 확장 된 식별 (스트림 액세스 및 개별 액세스).

source: Extended identification (stream access).
es: Identificación ampliada (acceso a la corriente).
ko: 확장 된 식별 (스트림 액세스).

source: Extended radial gradients, where a separate focal circle is specified, are also supported.
es: También se admiten los gradientes radiales extendidos,en los que se especifica un círculo focal separado.
ko: 별도의 초점 원이 지정된 확장 방사형 그래디언트도 지원됩니다.

source: Extended set of text codecs (see <a href="qtextcodec">QTextCodec</a>).
ko: 확장 된 텍스트 코덱 세트 ( <a href="qtextcodec">QTextCodec</a> 참조 ).

source: Extended types
es: Tipos extendidos
ko: 확장 유형

source: Extended types and tagged values
es: Tipos extendidos y valores etiquetados
ko: 확장 유형 및 태그 값

source: ExtendedAttributes (QML type)
es: Atributos extendidos (tipo QML)
ko: ExtendedAttributes (QML 유형)

source: ExtendedAttributes QML Type
es: Atributos extendidos Tipo QML
ko: ExtendedAttributes QML 유형

source: Extending QML
es: Extensión del QML
ko: QML 확장

source: Extending QML - Adding Types Example
es: Extensión del QML-Ejemplo de adición de tipos
ko: QML 확장-유형 추가 예

source: Extending QML - Attached Properties Example
es: Extensión de QML-Ejemplo de propiedades adjuntas
ko: QML 확장-첨부 된 특성 예제

source: Extending QML - Binding Example
es: Extensión del QML-Ejemplo de unión
ko: QML 확장-바인딩 예

source: Extending QML - Default Property Example
es: Extensión de QML-Ejemplo de propiedad predeterminada
ko: QML 확장-기본 속성 예

source: Extending QML - Extension Objects Example
es: Extensión de QML-Ejemplo de Objetos de Extensión
ko: QML 확장-확장 오브젝트 예제

source: Extending QML - Grouped Properties Example
es: Extensión de QML-Ejemplo de propiedades agrupadas
ko: QML 확장-그룹화 된 특성 예제

source: Extending QML - Inheritance and Coercion Example
es: Ampliación de la QML-Ejemplo de herencia y coacción
ko: QML 확장-상속 및 강제 예제

source: Extending QML - Methods Example
es: Extensión del QML-Ejemplo de métodos
ko: QML 확장-메소드 예제

source: Extending QML - Object and List Property Types Example
es: Extensión de QML-Ejemplo de tipos de propiedades de objetos y listas
ko: QML 확장-오브젝트 및 목록 특성 유형 예제

source: Extending QML - Property Value Source Example
es: Extensión de QML-Ejemplo de fuente de valor de propiedad
ko: QML 확장-특성 값 소스 예제

source: Extending QML - Signal Support Example
es: Extensión de QML-Ejemplo de soporte de señales
ko: QML 확장-신호 지원 예

source: Extending the Type System
es: Extendiendo el sistema de tipos
ko: 타입 시스템 확장

source: Extends QAction by an interface for inserting custom widgets into action based containers, such as toolbars
es: Amplía QAction con una interfaz para insertar widgets personalizados en contenedores basados en la acción,como barras de herramientas
ko: 툴바와 같은 액션 기반 컨테이너에 커스텀 위젯을 삽입하기위한 인터페이스로 QAction 확장

source: Extends the geo circle to also cover the coordinate
es: Extiende el geocirculo para cubrir también la coordenada
ko: 좌표를 포함하도록 지리원을 확장합니다.

source: Extends the geo rectangle to also cover the coordinate
es: Extiende el geo-rectángulo para cubrir también la coordenada
ko: 좌표를 덮도록 지오 사각형을 확장합니다.

source: Extends this <a href="qdeadlinetimer">QDeadlineTimer</a> object by
es: Extiende este objeto <a href="qdeadlinetimer">QDeadlineTimer</a> por
ko: 이 <a href="qdeadlinetimer">QDeadlineTimer</a> 객체를 다음과 같이 확장 합니다.

source: Extensibility is the ability to show the dialog in two ways: a partial dialog that shows the most commonly used options, and a full dialog that shows all the options. Typically an extensible dialog will initially appear as a partial dialog, but with a <b>More</b> toggle button. If the user presses the <b>More</b> button down, the dialog is expanded. The <a href="https://doc.qt.io/qt-5.13/qtwidgets-dialogs-extension-example.html#">Extension Example</a> shows how to achieve extensible dialogs using Qt.
es: La extensibilidad es la capacidad de mostrar el di&aacute;logo de dos formas: un di&aacute;logo parcial que muestra las opciones m&aacute;s utilizadas y un di&aacute;logo completo que muestra todas las opciones. Normalmente, un cuadro de di&aacute;logo extensible aparecer&aacute; inicialmente como un cuadro de di&aacute;logo parcial, pero con un bot&oacute;n de alternancia <b>M&aacute;s</b> . Si el usuario presiona el bot&oacute;n <b>M&aacute;s</b> , el cuadro de di&aacute;logo se expande. El <a href="https://doc.qt.io/qt-5.13/qtwidgets-dialogs-extension-example.html#">ejemplo de extensi&oacute;n</a> muestra c&oacute;mo lograr di&aacute;logos extensibles usando Qt.
ko: 확장 성은 가장 일반적으로 사용되는 옵션을 표시하는 부분 대화 상자와 모든 옵션을 표시하는 전체 대화 상자라는 두 가지 방법으로 대화 상자를 표시하는 기능입니다. 일반적으로 확장 가능한 대화 상자는 처음에는 부분 대화 상자로 나타나지만 <b>추가</b> 토글 단추가 있습니다. 사용자가 <b>더보기</b> 버튼을 누르면 대화 상자가 확장됩니다. <a href="https://doc.qt.io/qt-5.13/qtwidgets-dialogs-extension-example.html#">확장 예</a> Qt는을 사용하여 확장 가능한 대화 상자를 달성하는 방법을 보여줍니다.

source: Extensibility is the ability to show the dialog in two ways: a partial dialog that shows the most commonly used options, and a full dialog that shows all the options. Typically an extensible dialog will initially appear as a partial dialog, but with a <b>More</b> toggle button. If the user presses the <b>More</b> button down, the dialog is expanded. The <a href="https://doc.qt.io/qt-5.15/qtwidgets-dialogs-extension-example.html">Extension Example</a> shows how to achieve extensible dialogs using Qt.
ko: 확장 성은 가장 일반적으로 사용되는 옵션을 표시하는 부분 대화 상자와 모든 옵션을 표시하는 전체 대화 상자의 두 가지 방법으로 대화 상자를 표시하는 기능입니다. 일반적으로 확장 가능한 대화 상자는 처음에는 부분 대화 상자로 표시되지만 <b>추가</b> 토글 단추가 있습니다. 사용자가 <b>자세히</b> 버튼을 누르면 대화 상자가 확장됩니다. <a href="https://doc.qt.io/qt-5.15/qtwidgets-dialogs-extension-example.html">확장 예</a> Qt는을 사용하여 확장 가능한 대화 상자를 달성하는 방법을 보여줍니다.

source: Extension Objects
es: Objetos de extensión
ko: 확장 객체

source: Extension Types
es: Tipos de extensión
ko: 확장 타입

source: Extension button for horizontal toolbars.
es: Botón de extensión para barras de herramientas horizontales.
ko: 수평 툴바의 확장 버튼.

source: Extension button for vertical toolbars.
es: Botón de extensión para barras de herramientas verticales.
ko: 수직 도구 모음을위한 확장 버튼.

source: Extension objects
es: Objetos de extensión
ko: 확장 객체

source: Extension plugin allows customizing and extending the Qt Virtual Keyboard functionality. Extension plugin can provide additional keyboard layouts and input methods.
es: El plugin de extensión permite personalizar y ampliar la funcionalidad del Teclado Virtual Qt.El plugin de extensión puede proporcionar diseños de teclado y métodos de entrada adicionales.
ko: 확장 플러그인을 통해 Qt 가상 키보드 기능을 사용자 정의하고 확장 할 수 있습니다. 확장 플러그인은 추가 키보드 레이아웃 및 입력 방법을 제공 할 수 있습니다.

source: Extension plugin for the Qt Virtual Keyboard. <a href="#details">More...</a>
es: Complemento de extensi&oacute;n para el teclado virtual Qt. <a href="#details">M&aacute;s...</a>
ko: Qt 가상 키보드 용 확장 플러그인. <a href="#details">더...</a>

source: Extensions that are supported by the compositor should be instantiated and added to the extensions property.
es: Las extensiones que son apoyadas por el compositor deben ser instanciadas y añadidas a la propiedad de las extensiones.
ko: 컴포 지터가 지원하는 확장은 인스턴스화되어 확장 특성에 추가되어야합니다.

source: External Binary Resources
es: Recursos binarios externos
ko: 외부 이진 리소스

source: External Drag and Drop
es: Arrastre y colocación externa
ko: 외부 드래그 앤 드롭

source: External QIODevices
es: Dispositivos QIOD externos
ko: 외부 QIO 장치

source: External Schemas
es: Esquemas externos
ko: 외부 스키마

source: External objects referenced in the content are located relative to
es: Los objetos externos a los que se hace referencia en el contenido se localizan en relación con
ko: 컨텐츠에서 참조되는 외부 객체는
