Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/qt/qt.*.123.xlf
Languages: es, ko, zh_cn

source: ErrorDomain : <a href="qml-enumeration">enumeration</a>
es: ErrorDomain: <a href="qml-enumeration">enumeraci&oacute;n</a>
ko: ErrorDomain : <a href="qml-enumeration">열거</a>

source: Errors are silently ignored.
es: Los errores son silenciosamente ignorados.
ko: 오류는 자동으로 무시됩니다.

source: Errors can be reported using <a href="qxmlerrorhandler#warning">warning</a>(), <a href="qxmlerrorhandler#error">error</a>() and <a href="qxmlerrorhandler#fatalError">fatalError</a>(), with the error text being reported with <a href="qxmlerrorhandler#errorString">errorString</a>().
es: Los errores se pueden informar utilizando <a href="qxmlerrorhandler#warning">warning</a> (), <a href="qxmlerrorhandler#error">error</a> () y <a href="qxmlerrorhandler#fatalError">fatalError</a> (), y el texto del error se informa con <a href="qxmlerrorhandler#errorString">errorString</a> ().
ko: 오류를 사용하여보고 할 수 있습니다 <a href="qxmlerrorhandler#warning">경고</a> (), <a href="qxmlerrorhandler#error">오류</a> ()와 <a href="qxmlerrorhandler#fatalError">인 FatalError를</a> 오류 텍스트로보고되는으로, () <a href="qxmlerrorhandler#errorString">Errorstring이</a> ().

source: Errors can occur during query evaluation. Examples include type errors and file loading errors. When an error occurs:
es: Pueden producirse errores durante la evaluación de la consulta.Algunos ejemplos son los errores de tipo y los errores de carga de archivos.Cuando se produce un error:
ko: 쿼리 평가 중에 오류가 발생할 수 있습니다. 예를 들어 유형 오류 및 파일로드 오류가 있습니다. 오류가 발생하면 :

source: Escape Key
es: Llave de escape
ko: 이스케이프 키

source: Escape, Ctrl+.
ko: 탈출, Ctrl +.

source: Escapes all characters of
es: Escapa de todos los personajes de
ko: 의 모든 캐릭터를 탈출

source: Escapes the values of <code>variablename</code> in a way that enables parsing them as qmake code.
es: Escapa de los valores de <code>variablename</code> de una manera que permite analizarlos como c&oacute;digo qmake.
ko: qname 코드로 구문 분석 할 수있는 방식 으로 <code>variablename</code> 값을 이스케이프합니다 .

source: Esri Plugin
ko: Esri 플러그인

source: Essentially the same as <a href="qdatawidgetmapper#addMapping">addMapping</a>(), but adds the possibility to specify the property to use specifying
es: Esencialmente lo mismo que <a href="qdatawidgetmapper#addMapping">addMapping</a> (), pero agrega la posibilidad de especificar la propiedad a usar especificando
ko: 기본적으로 <a href="qdatawidgetmapper#addMapping">addMapping</a> () 과 동일 하지만, 지정할 속성을 지정할 가능성을 추가합니다.

source: Essentially the same as addMapping(), but adds the possibility to specify the property to use specifying
ko: 기본적으로 addMapping ()과 동일하지만 사용할 속성을 지정할 수있는 가능성을 추가합니다.

source: Essentially, for QDoc to create a page, there must be some essential ingredients present.
es: Esencialmente,para que QDoc cree una página,debe haber algunos ingredientes esenciales presentes.
ko: 본질적으로 QDoc이 페이지를 만들려면 몇 가지 필수 구성 요소가 있어야합니다.

source: Essentially, if you need to render multiple scenes each in a separate view, you should use a single <a href="qml-qtquick-scene3d-scene3d">Scene3D</a> instance and as many Scene3DView items as you have scenes to render.
ko: 기본적으로 별도의 뷰에서 여러 장면을 각각 렌더링해야하는 경우에는 단일 <a href="qml-qtquick-scene3d-scene3d">Scene3D</a> 인스턴스와 렌더링 할 장면 수만큼 Scene3DView 항목을 사용해야합니다.

source: Essentially, there needs to be a file called
es: Esencialmente,tiene que haber un archivo llamado
ko: 기본적으로라는 파일이 있어야합니다.

source: Estonian Layout
es: Diseño de Estonia
ko: 에스토니아어 레이아웃

source: Euler angles (in degrees) that corresponds to this quaternion.
es: ángulos de Euler (en grados)que corresponden a este cuaternario.
ko: 이 쿼터니언에 해당하는 오일러 각도 (도)입니다.

source: Evaluates <code>condition</code>. If the condition is false, qmake skips this project (and its <a href="qmake-variable-reference#subdirs">SUBDIRS</a>) when building.
es: Eval&uacute;a la <code>condition</code> . Si la condici&oacute;n es falsa, qmake omite este proyecto (y sus <a href="qmake-variable-reference#subdirs">SUBDIRS</a> ) al construir.
ko: <code>condition</code> 평가 합니다 . 조건이 false이면 qmake는 <a href="qmake-variable-reference#subdirs">빌드</a> 할 때이 프로젝트 (및 해당 SUBDIRS )를 건너 뜁니다 .

source: Evaluates <code>condition</code>. It is used to group boolean expressions.
es: Eval&uacute;a la <code>condition</code> . Se utiliza para agrupar expresiones booleanas.
ko: <code>condition</code> 평가 합니다 . 부울 표현식을 그룹화하는 데 사용됩니다.

source: Evaluates <code>filename</code> as a qmake project file and returns the value assigned to <code>variablename</code>.
es: Eval&uacute;a <code>filename</code> como un archivo de proyecto qmake y devuelve el valor asignado a <code>variablename</code> .
ko: <code>filename</code> 을 qmake 프로젝트 파일로 평가 하고 <code>variablename</code> 에 지정된 값을 리턴합니다 .

source: Evaluates the assignment pointed to by
es: Evalúa la asignación señalada por
ko: 가 지적한 과제를 평가합니다.

source: Evaluates the contents of the string using qmake syntax rules and returns true. Definitions and assignments can be used in the string to modify the values of existing variables or create new definitions.
es: Evalúa el contenido de la cadena usando reglas de sintaxis qmake y devuelve true.Las definiciones y asignaciones pueden utilizarse en la cadena para modificar los valores de las variables existentes o crear nuevas definiciones.
ko: qmake 구문 규칙을 사용하여 문자열의 내용을 평가하고 true를 리턴합니다. 문자열에서 정의 및 대입을 사용하여 기존 변수의 값을 수정하거나 새 정의를 작성할 수 있습니다.

source: Evaluates the executable content pointed to by
es: Evalúa el contenido ejecutable señalado por
ko: 에서 지적한 실행 가능한 내용을 평가합니다.

source: Evaluates the foreach loop pointed to by
es: Evalúa el bucle de proa señalado por
ko: 다음에 의해 지정된 foreach 루프를 평가합니다.

source: Evaluates the initialization pointed to by
es: Evalúa la inicialización señalada por
ko: 로 지정된 초기화를 평가합니다

source: Evaluates the query or stylesheet, and writes the output to
es: Evalúa la consulta o la hoja de estilo,y escribe el resultado en
ko: 쿼리 또는 스타일 시트를 평가하고 출력을

source: Evaluates the query, and serializes the output as XML to
es: Evalúa la consulta,y serializa la salida como XML a
ko: 쿼리를 평가하고 출력을 XML로 직렬화

source: Evaluates this query and sends the result as a sequence of callbacks to the <a href="qabstractxmlreceiver">receiver</a>
es: Eval&uacute;a esta consulta y env&iacute;a el resultado como una secuencia de devoluciones de llamada al <a href="qabstractxmlreceiver">receptor.</a>
ko: 이 쿼리를 평가하고 결과를 <a href="qabstractxmlreceiver">수신자</a> 에게 콜백 시퀀스로 보냅니다.

source: Evaluating Scripts
es: Evaluando los guiones
ko: 스크립트 평가

source: Evaluation of
es: Evaluación de
ko: 평가

source: EvaluatorInfo Struct
es: Estructura de información del evaluador
ko: 평가자 정보 구조

source: Evaulates the expression, returning the result of the evaluation, or an invalid <a href="qvariant">QVariant</a> if the expression is invalid or has an error.
es: Evaula la expresi&oacute;n, devolviendo el resultado de la evaluaci&oacute;n o un <a href="qvariant">QVariant</a> no v&aacute;lido si la expresi&oacute;n no es v&aacute;lida o tiene un error.
ko: 표현식을 평가하여 평가 결과를 리턴하거나 표현식이 유효하지 않거나 오류가있는 경우 유효하지 않은 <a href="qvariant">QVariant를 리턴</a> 합니다.

source: Evdev support (compatibility mode)
es: Soporte Evdev (modo de compatibilidad)
ko: Evdev 지원 (호환 모드)

source: Even QML types themselves can be on the network - if the <a href="qtquick-qmlscene">Prototyping with qmlscene</a> is used to load <code>http://example.com/mystuff/Hello.qml</code> and that content refers to a type "World", the engine will load <code>http://example.com/mystuff/qmldir</code> and resolve the type just as it would for a local file. For example if the qmldir file contains the line "World World.qml", it will load <code>http://example.com/mystuff/World.qml</code> Any other resources that <code>Hello.qml</code> referred to, usually by a relative URL, would similarly be loaded from the network.
es: Incluso los tipos QML mismos pueden estar en la red - si se usa la <a href="qtquick-qmlscene">creaci&oacute;n de prototipos con qmlscene</a> para cargar <code>http://example.com/mystuff/Hello.qml</code> y ese contenido se refiere a un tipo "World", el motor cargar&aacute; <code>http://example.com/mystuff/qmldir</code> y resuelva el tipo como lo har&iacute;a con un archivo local. Por ejemplo, si el archivo qmldir contiene la l&iacute;nea "World World.qml", cargar&aacute; <code>http://example.com/mystuff/World.qml</code> Cualquier otro recurso al que se <code>Hello.qml</code> , normalmente mediante una URL relativa, tambi&eacute;n cargarse desde la red.
ko: QML 유형 자체도 네트워크에있을 수 있습니다. <a href="qtquick-qmlscene">qmlscene</a> 을 사용한 프로토 타입을 사용하여 <code>http://example.com/mystuff/Hello.qml</code> 을로드 하고 해당 컨텐츠가 "World"유형을 참조하면 엔진은 <code>http://example.com/mystuff/qmldir</code> 로드합니다 . /example.com/mystuff/qmldir 을 입력하고 로컬 파일에서와 같이 유형을 확인하십시오. 예를 들어 qmldir 파일에 "World World.qml"줄이 포함되어 있으면 <code>http://example.com/mystuff/World.qml</code> 을로드 합니다. <code>Hello.qml</code> 이 참조하는 다른 리소스 ( 일반적으로 상대 URL)는 유사하게 네트워크에서로드됩니다.

source: Even if scheduleDelayedItemsLayout() is called multiple times before events are processed, the view will only do the layout once.
es: Incluso si scheduleDelayedItemsLayout()se llama varias veces antes de que se procesen los eventos,la vista sólo hará el diseño una vez.
ko: 이벤트가 처리되기 전에 scheduleDelayedItemsLayout ()이 여러 번 호출 되더라도 뷰는 한 번만 레이아웃을 수행합니다.

source: Even if the feature is not available, <a href="qdbusunixfiledescriptor">QDBusUnixFileDescriptor</a> will continue to operate, so code need not have compile-time checks for the availability of this feature.
es: Incluso si la funci&oacute;n no est&aacute; disponible, <a href="qdbusunixfiledescriptor">QDBusUnixFileDescriptor</a> seguir&aacute; funcionando, por lo que no es necesario que el c&oacute;digo tenga comprobaciones en tiempo de compilaci&oacute;n para comprobar la disponibilidad de esta funci&oacute;n.
ko: 기능을 사용할 수 <a href="qdbusunixfiledescriptor">없더라도 QDBusUnixFileDescriptor</a> 는 계속 작동하므로 코드에서이 기능의 사용 가능 여부를 컴파일 타임 검사 할 필요가 없습니다.

source: Even if the feature is not available, QDBusUnixFileDescriptor will continue to operate, so code need not have compile-time checks for the availability of this feature.
ko: 기능을 사용할 수없는 경우에도 QDBusUnixFileDescriptor는 계속 작동하므로 코드에서이 기능의 가용성을 확인하기 위해 컴파일 시간을 확인할 필요가 없습니다.

source: Even if you implement <a href="qwidget#heightForWidth">QWidget::heightForWidth</a>(), it is still a good idea to provide a reasonable sizeHint().
es: Incluso si implementa <a href="qwidget#heightForWidth">QWidget :: heightForWidth</a> (), sigue siendo una buena idea proporcionar un sizeHint () razonable.
ko: <a href="qwidget#heightForWidth">QWidget :: heightForWidth</a> () 를 구현하더라도 합리적인 sizeHint ()를 제공하는 것이 좋습니다.

source: Even though <a href="qml-qtquick-controls2-groupbox">GroupBox</a> has no built-in check box, it is straightforward to create a checkable <a href="qml-qtquick-controls2-groupbox">GroupBox</a> by pairing it with a <a href="qml-qtquick-controls2-checkbox">CheckBox</a>.
es: Aunque <a href="qml-qtquick-controls2-groupbox">GroupBox</a> no tiene una casilla de verificaci&oacute;n incorporada, es sencillo crear un <a href="qml-qtquick-controls2-groupbox">GroupBox</a> que se pueda marcar emparej&aacute;ndolo con un <a href="qml-qtquick-controls2-checkbox">CheckBox</a> .
ko: 비록 <a href="qml-qtquick-controls2-groupbox">그룹 상자가</a> 더 내장 된 체크 박스, 체크 할 만드는 간단하지 않습니다 <a href="qml-qtquick-controls2-groupbox">그룹 상자를</a> 와 페어링하여 <a href="qml-qtquick-controls2-checkbox">CheckBox의</a> .

source: Even though <a href="qml-qtquick-controls2-spinbox">SpinBox</a> works on integer values, it can be customized to accept arbitrary input values. The following snippet demonstrates how <a href="qml-qtquick-controls2-spinbox#validator-prop">validator</a>, <a href="qml-qtquick-controls2-spinbox#textFromValue-prop">textFromValue</a> and <a href="qml-qtquick-controls2-spinbox#valueFromText-prop">valueFromText</a> can be used to customize the default behavior.
es: Aunque <a href="qml-qtquick-controls2-spinbox">SpinBox</a> funciona con valores enteros, se puede personalizar para aceptar valores de entrada arbitrarios. El siguiente fragmento demuestra c&oacute;mo <a href="qml-qtquick-controls2-spinbox#validator-prop">validador</a> , <a href="qml-qtquick-controls2-spinbox#textFromValue-prop">textFromValue</a> y <a href="qml-qtquick-controls2-spinbox#valueFromText-prop">valueFromText</a> se pueden usar para personalizar el comportamiento predeterminado.
ko: <a href="qml-qtquick-controls2-spinbox">SpinBox</a> 는 정수 값에서 작동 하지만 임의의 입력 값을 받도록 사용자 지정할 수 있습니다. 다음 스 니펫은 <a href="qml-qtquick-controls2-spinbox#validator-prop">validator</a> , <a href="qml-qtquick-controls2-spinbox#textFromValue-prop">textFromValue</a> 및 <a href="qml-qtquick-controls2-spinbox#valueFromText-prop">valueFromText</a> 를 사용하여 기본 동작을 사용자 정의하는 방법을 보여줍니다 .

source: Even though <a href="qnetworkreply">QNetworkReply</a> is a <a href="qiodevice">QIODevice</a> connected to the contents of the reply, it also emits the <a href="qnetworkreply#uploadProgress">uploadProgress</a>() signal, which indicates the progress of the upload for operations that have such content.
es: Aunque <a href="qnetworkreply">QNetworkReply</a> es un <a href="qiodevice">QIODevice</a> conectado al contenido de la respuesta, tambi&eacute;n emite la se&ntilde;al <a href="qnetworkreply#uploadProgress">uploadProgress</a> (), que indica el progreso de la carga para las operaciones que tienen dicho contenido.
ko: <a href="qnetworkreply">QNetworkReply</a> 는 회신 내용에 연결된 <a href="qiodevice">QIODevice</a> 이지만 해당 내용이있는 작업의 업로드 진행률을 나타내는 <a href="qnetworkreply#uploadProgress">uploadProgress</a> () 신호 도 내 보냅니다 .

source: Even though GroupBox has no built-in check box, it is straightforward to create a checkable GroupBox by pairing it with a <a href="qml-qtquick-controls2-checkbox">CheckBox</a>.
ko: GroupBox에 기본 제공 확인란이 없더라도 <a href="qml-qtquick-controls2-checkbox">CheckBox</a> 와 쌍을 이루어 확인 가능한 GroupBox를 만드는 것은 간단합니다 .

source: Even though QNetworkReply is a <a href="qiodevice">QIODevice</a> connected to the contents of the reply, it also emits the <a href="qnetworkreply#uploadProgress">uploadProgress</a>() signal, which indicates the progress of the upload for operations that have such content.
ko: QNetworkReply는 응답 내용에 연결된 <a href="qiodevice">QIODevice</a> 이지만 해당 내용이있는 작업의 업로드 진행률을 나타내는 <a href="qnetworkreply#uploadProgress">uploadProgress</a> () 신호 도 내 보냅니다 .

source: Even though SpinBox works on integer values, it can be customized to accept arbitrary input values. The following snippet demonstrates how <a href="qml-qtquick-controls2-spinbox#validator-prop">validator</a>, <a href="qml-qtquick-controls2-spinbox#textFromValue-prop">textFromValue</a> and <a href="qml-qtquick-controls2-spinbox#valueFromText-prop">valueFromText</a> can be used to customize the default behavior.
ko: SpinBox는 정수 값에서 작동하지만 임의의 입력 값을 허용하도록 사용자 지정할 수 있습니다. 다음 스 니펫은 <a href="qml-qtquick-controls2-spinbox#validator-prop">validator</a> , <a href="qml-qtquick-controls2-spinbox#textFromValue-prop">textFromValue</a> 및 <a href="qml-qtquick-controls2-spinbox#valueFromText-prop">valueFromText</a> 를 사용하여 기본 동작을 사용자 정의하는 방법을 보여줍니다 .

source: Even though both nodes are empty elements carrying the same name, <code>element3 == element4</code> will return false because they refer to two different nodes in the underlying data structure.
es: Aunque ambos nodos son elementos vac&iacute;os que llevan el mismo nombre, <code>element3 == element4</code> devolver&aacute; falso porque se refieren a dos nodos diferentes en la estructura de datos subyacente.
ko: 두 노드 모두 같은 이름을 가진 빈 요소이지만 <code>element3 == element4</code> 는 기본 데이터 구조에서 서로 다른 두 개의 노드를 참조하므로 false를 반환합니다.

source: Even though primary and accent can be any <a href="qml-color#colorbasictypedocs">color</a>, it is recommended to use one of the pre-defined colors that have been designed to work well with the rest of the Material style palette:
es: Aunque el primario y el acento pueden ser de cualquier <a href="qml-color#colorbasictypedocs">color</a> , se recomienda utilizar uno de los colores predefinidos que han sido dise&ntilde;ados para funcionar bien con el resto de la paleta de estilos de materiales:
ko: 기본 및 악센트는 모든 <a href="qml-color#colorbasictypedocs">색상</a> 이 될 수 있지만 머티리얼 스타일 팔레트의 나머지 부분과 잘 작동하도록 사전 정의 된 색상 중 하나를 사용하는 것이 좋습니다.

source: Even though spaces are allowed in event specifications in SCXML documents, they are not allowed in this list. However, the list can contain multiple specifiers, to the same effect.
es: Aunque se permiten espacios en las especificaciones de los eventos en los documentos SCXML,no se permiten en esta lista.Sin embargo,la lista puede contener múltiples especificadores,con el mismo efecto.
ko: SCXML 문서의 이벤트 스펙에는 공백이 허용되지만이 목록에서는 공백이 허용되지 않습니다. 그러나 목록에는 동일한 지정으로 여러 지정자가 포함될 수 있습니다.

source: Even though the <a href="qml-qtquick-taphandler">TapHandler</a> documentation does not document a signal handler named <code>onPressedChanged</code>, the signal is implicitly provided by the fact that the <code>pressed</code> property exists.
es: Aunque la documentaci&oacute;n de <a href="qml-qtquick-taphandler">TapHandler</a> no documenta un manejador de se&ntilde;ales llamado <code>onPressedChanged</code> , la se&ntilde;al es proporcionada impl&iacute;citamente por el hecho de que existe la propiedad <code>pressed</code> .
ko: <a href="qml-qtquick-taphandler">TapHandler</a> 설명서 에 onPressedChanged 라는 신호 처리기가 문서화되어 있지 <code>onPressedChanged</code> , <code>pressed</code> 속성이 존재 한다는 사실에 의해 신호가 암시 적으로 제공됩니다 .

source: Even though the node tree is mostly built internally by the existing Qt Quick QML types, it is possible for users to also add complete subtrees with their own content, including subtrees that represent 3D models.
es: Aunque el árbol de nodos está construido en su mayor parte internamente por los tipos Qt Quick QML existentes,es posible que los usuarios también añadan subárboles completos con su propio contenido,incluyendo subárboles que representen modelos 3D.
ko: 노드 트리는 대부분 기존 Qt Quick QML 유형에 의해 내부적으로 구축되지만 사용자는 3D 모델을 나타내는 하위 트리를 포함하여 자체 컨텐츠로 완전한 하위 트리를 추가 할 수도 있습니다.

source: Even though the surface is typically renderable, the surface's pixels are not accessible. <a href="qoffscreensurface">QOffscreenSurface</a> should only be used to create OpenGL resources such as textures or framebuffer objects.
es: Aunque la superficie normalmente se puede renderizar, los p&iacute;xeles de la superficie no son accesibles. <a href="qoffscreensurface">QOffscreenSurface</a> solo debe usarse para crear recursos OpenGL como texturas u objetos framebuffer.
ko: 표면이 일반적으로 렌더링 가능하지만 표면의 픽셀에 액세스 할 수 없습니다. <a href="qoffscreensurface">QOffscreenSurface</a> 는 텍스처 또는 프레임 버퍼 객체와 같은 OpenGL 리소스를 만드는 데만 사용해야합니다.

source: Even though the surface is typically renderable, the surface's pixels are not accessible. QOffscreenSurface should only be used to create OpenGL resources such as textures or framebuffer objects.
ko: 표면은 일반적으로 렌더링 가능하지만 표면의 픽셀에는 액세스 할 수 없습니다. QOffscreenSurface는 텍스처 또는 프레임 버퍼 개체와 같은 OpenGL 리소스를 만드는 데만 사용해야합니다.

source: Even though the templates aim to be as style-agnostic as possible, in some cases they have to make certain assumptions about the visual structure of a control. For example, a spinbox has buttons that increment and decrement the value of the spinbox. In order to implement the behavior of a spinbox, the spinbox template needs to know if the user is interacting with the up or down button. A visual implementation of the spinbox template merely needs to position the up and down buttons and visualize them in normal, pressed, and disabled states. Any input event handling and state processing is taken care of by the underlying template.
es: Aunque las plantillas pretenden ser lo más agnósticas posible en cuanto al estilo,en algunos casos tienen que hacer ciertas suposiciones sobre la estructura visual de un control.Por ejemplo,un spinbox tiene botones que incrementan y disminuyen el valor del spinbox.Para implementar el comportamiento de una spinbox,la plantilla de la misma necesita saber si el usuario está interactuando con el botón de arriba o abajo.Una implementación visual de la plantilla de la spinbox sólo necesita posicionar los botones de arriba y abajo y visualizarlos en los estados normal,pulsado y desactivado.La plantilla subyacente se encarga de cualquier manejo de eventos de entrada y procesamiento de estados.
ko: 템플릿이 가능한 한 스타일에 구애받지 않더라도 컨트롤의 시각적 구조에 대한 특정 가정을 만들어야하는 경우도 있습니다. 예를 들어, 스핀 박스에는 스핀 박스의 값을 증가 및 감소시키는 버튼이 있습니다. 스핀 박스의 동작을 구현하려면 스핀 박스 템플릿이 사용자가 위로 또는 아래로 버튼과 상호 작용하는지 알아야합니다. 스핀 박스 템플릿을 시각적으로 구현하려면 위쪽 및 아래쪽 버튼을 배치하고 일반, 눌림 및 비활성화 상태로 시각화하면됩니다. 입력 이벤트 처리 및 상태 처리는 기본 템플릿에 의해 처리됩니다.

source: Even though this kinetic scroller has a large number of settings available via <a href="qscrollerproperties">QScrollerProperties</a>, we recommend that you leave them all at their default, platform optimized values. Before changing them you can experiment with the <code>plot</code> example in the <code>scroller</code> examples directory.
es: Aunque este scroller cin&eacute;tico tiene una gran cantidad de configuraciones disponibles a trav&eacute;s de <a href="qscrollerproperties">QScrollerProperties</a> , le recomendamos que las deje todas en sus valores predeterminados optimizados para la plataforma. Antes de cambiarlos, puede experimentar con el ejemplo de <code>plot</code> en el directorio de ejemplos de <code>scroller</code> .
ko: 이 키네틱 스크롤러에는 <a href="qscrollerproperties">QScrollerProperties</a> 를 통해 많은 설정을 사용할 수 있지만 모두 플랫폼에 최적화 된 기본 값으로 두는 것이 좋습니다. 그것들을 변경하기 전에 <code>scroller</code> 예제 디렉토리 에서 <code>plot</code> 예제를 실험 해 볼 수 있습니다 .

source: Even when using the non-threaded render loop, you should write your code as if you are using the threaded renderer, as failing to do so will make the code non-portable.
es: Incluso cuando se utiliza el bucle de renderizado sin hilos,se debe escribir el código como si se utilizara el renderizador con hilos,ya que de lo contrario el código no será portable.
ko: 스레드되지 않은 렌더 루프를 사용하는 경우에도 스레드 렌더러를 사용하는 것처럼 코드를 작성해야합니다. 그렇지 않으면 코드를 이식 할 수 없게됩니다.

source: Event Classes
es: Clases de eventos
ko: 이벤트 클래스

source: Event Delivery and Propagation
es: Entrega y propagación de eventos
ko: 이벤트 전달 및 전파

source: Event Filters
es: Filtros de eventos
ko: 이벤트 필터

source: Event Handlers
es: Manipuladores de eventos
ko: 이벤트 핸들러

source: Event Handling
es: Manejo de eventos
ko: 이벤트 처리

source: Event Handling and Propagation
es: Manejo y propagación de eventos
ko: 이벤트 처리 및 전파

source: Event Type
es: Tipo de evento
ko: 이벤트 타입

source: Event Type Identifier
es: Identificador de tipo de evento
ko: 이벤트 유형 식별자

source: Event Types
es: Tipos de eventos
ko: 이벤트 유형

source: Event count
es: Conteo de eventos
ko: 이벤트 수

source: Event data (<code>_event.data</code>) is implemented as a <a href="qvariant">QVariant</a>. If parameters are passed to <code>&lt;send&gt;</code>, the <a href="qvariant">QVariant</a> holds a <a href="qvariant#QVariantMap-typedef">QVariantMap</a>, so multiple parameters with the same name are not supported.
es: Los datos de eventos ( <code>_event.data</code> ) se implementan como <a href="qvariant">QVariant</a> . Si los par&aacute;metros se pasan a <code>&lt;send&gt;</code> , <a href="qvariant">QVariant</a> contiene un <a href="qvariant#QVariantMap-typedef">QVariantMap</a> , por lo que no se admiten varios par&aacute;metros con el mismo nombre.
ko: 이벤트 데이터 ( <code>_event.data</code> 은 )는로 구현됩니다 <a href="qvariant">QVariant</a> . 매개 변수에 전달되는 경우 <code>&lt;send&gt;</code> 의 <a href="qvariant">QVariant은</a> 보유 <a href="qvariant#QVariantMap-typedef">QVariantMap를</a> 같은 이름을 가진 여러 매개 변수가 지원되지 않도록.

source: Event driven objects may only be used in a single thread.
es: Los objetos impulsados por eventos sólo pueden ser utilizados en un único hilo.
ko: 이벤트 중심 객체는 단일 스레드에서만 사용할 수 있습니다.
