Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/qt/qt.*.123.xlf
Languages: es, ko, zh_cn

source: Example of how to record a picture:
es: Ejemplo de cómo grabar una imagen:
ko: 사진을 촬영하는 방법의 예 :

source: Example of how to replay a picture:
es: Ejemplo de cómo reproducir una imagen:
ko: 사진을 재생하는 방법의 예 :

source: Example of topic commands:
es: Ejemplo de comandos del tema:
ko: 주제 명령의 예 :

source: Example of use:
es: Ejemplo de uso:
ko: 사용 예 :

source: Example of using complex regions:
es: Ejemplo de utilización de regiones complejas:
ko: 복잡한 영역을 사용하는 예 :

source: Example source
es: Ejemplo de fuente
ko: 소스 예

source: Example stored procedure:
es: Ejemplo de procedimiento almacenado:
ko: 저장 프로 시저 예 :

source: Example usage
es: Ejemplo de uso
ko: 사용법 예

source: Example usage is as follows:
es: El ejemplo de uso es el siguiente:
ko: 사용 예는 다음과 같습니다.

source: Example usage:
es: Ejemplo de uso:
ko: 사용법 예 :

source: Example using <a href="qstyle">QStyle</a> directly:
es: Ejemplo usando <a href="qstyle">QStyle</a> directamente:
ko: <a href="qstyle">QStyle을</a> 직접 사용하는 예 :

source: Example using <a href="qstylepainter">QStylePainter</a>:
es: Ejemplo usando <a href="qstylepainter">QStylePainter</a> :
ko: <a href="qstylepainter">QStylePainter를</a> 사용하는 예 :

source: Example using QStylePainter:
ko: QStylePainter를 사용한 예 :

source: Example: Basic Qt Modules
ko: 예 : 기본 Qt 모듈

source: Example: Create a system semaphore
es: Ejemplo:Crear un sistema de semáforo
ko: 예 : 시스템 세마포어 작성

source: Example: Create a system semaphore having five resources; acquire them all and then release them all.
es: Ejemplo:Crear un sistema de semáforo con cinco recursos;adquirirlos todos y luego liberarlos todos.
ko: 예 : 자원이 5 개인 시스템 세마포어를 작성하십시오. 그들 모두를 획득 한 다음 모두 풀어주십시오.

source: Example: Starting a computation and getting a slot callback when it's finished:
es: Ejemplo:Empezar un cálculo y recibir una llamada de la ranura cuando termine:
ko: 예 : 계산 시작 및 완료시 슬롯 콜백 얻기

source: Example: Suppose we want to create a custom widget that contains a group of buttons (like a tool palette). One approach is to connect each button's <code>clicked()</code> signal to its own custom slot; but in this example we want to connect all the buttons to a single slot and parameterize the slot by the button that was clicked.
es: Ejemplo: supongamos que queremos crear un widget personalizado que contenga un grupo de botones (como una paleta de herramientas). Un enfoque es conectar la se&ntilde;al de cada bot&oacute;n en el que se <code>clicked()</code> a su propia ranura personalizada; pero en este ejemplo queremos conectar todos los botones a una &uacute;nica ranura y parametrizar la ranura mediante el bot&oacute;n en el que se hizo clic.
ko: 예 : 도구 팔레트와 같은 버튼 그룹을 포함하는 사용자 정의 위젯을 작성한다고 가정하십시오. 한 가지 방법은 각 버튼의 <code>clicked()</code> 신호를 자체 사용자 정의 슬롯에 연결하는 것입니다. 그러나이 예에서는 모든 버튼을 단일 슬롯에 연결하고 클릭 한 버튼으로 슬롯을 매개 변수화하려고합니다.

source: Examples &amp; Tutorials
ko: 예제 및 튜토리얼

source: Examples and Tutorials
es: Ejemplos y Tutoriales
ko: 예제와 튜토리얼

source: Examples are an effective way to demonstrate practical usage of a given technology or concept. When it comes to middleware this is usually in the form of an application using simple code and clear explanations of what the code is doing. Any module, API, project, pattern etc. should have at least one good example.
es: Los ejemplos son una forma eficaz de demostrar el uso práctico de una tecnología o concepto determinado.Cuando se trata de middleware,esto suele ser en forma de una aplicación que utiliza un código simple y explicaciones claras de lo que hace el código.Cualquier módulo,API,proyecto,patrón,etc.debería tener al menos un buen ejemplo.
ko: 예는 주어진 기술이나 개념의 실제 사용법을 보여주는 효과적인 방법입니다. 미들웨어와 관련하여 이것은 보통 간단한 코드를 사용하는 애플리케이션의 형태이며 코드가 수행하는 작업에 대한 명확한 설명입니다. 모든 모듈, API, 프로젝트, 패턴 등은 하나 이상의 좋은 예를 가져야합니다.

source: Examples are small applications which show how to implement various Qt Quick features. The examples run on various platforms and are opened from within Qt Creator.
es: Los ejemplos son pequeñas aplicaciones que muestran cómo implementar varias características de Qt Quick.Los ejemplos se ejecutan en varias plataformas y se abren desde el interior de Qt Creator.
ko: 다양한 Qt Quick 기능을 구현하는 방법을 보여주는 작은 응용 프로그램이 그 예입니다. 예제는 다양한 플랫폼에서 실행되며 Qt Creator 내에서 열립니다.

source: Examples demonstrating the use of the Qt Sensors APIs
es: Ejemplos que demuestran el uso de los APIs de los Sensores Qt
ko: Qt 센서 API 사용을 보여주는 예

source: Examples demonstrating use of the Qt Location APIs
es: Ejemplos que demuestran el uso de las API de localización de Qt
ko: Qt 위치 API 사용을 보여주는 예

source: Examples for iOS
es: Ejemplos de iOS
ko: iOS의 예

source: Examples of absolute paths:
es: Ejemplos de trayectorias absolutas:
ko: 절대 경로의 예 :

source: Examples of contentX and contentY
es: Ejemplos de contenidoX y contenidoY
ko: contentX 및 contentY의 예

source: Examples of other places where <a href="xmlprocessing">XQuery</a> could be used in Qt XML Patterns to query non-XML data:
ko: 비 XML 데이터를 쿼리하기 위해 Qt XML 패턴에서 <a href="xmlprocessing">XQuery를</a> 사용할 수있는 다른 위치의 예 :

source: Examples of other places where XQuery could be used in Qt XML Patterns to query non-XML data:
es: Ejemplos de otros lugares en los que se podría utilizar XQuery en Qt XML Patterns para consultar datos no XML:
ko: Qt XML 패턴에서 XQuery를 사용하여 비 XML 데이터를 쿼리 할 수있는 다른 장소의 예 :

source: Examples of relative paths:
es: Ejemplos de trayectorias relativas:
ko: 상대 경로의 예 :

source: Examples of such classes include <a href="qlistwidget">QListWidget</a>, <a href="qtreewidget">QTreeWidget</a>, and <a href="qtablewidget">QTableWidget</a>.
es: Ejemplos de tales clases incluyen <a href="qlistwidget">QListWidget</a> , <a href="qtreewidget">QTreeWidget</a> y <a href="qtablewidget">QTableWidget</a> .
ko: 이러한 클래스의 예로는 <a href="qlistwidget">QListWidget</a> , <a href="qtreewidget">QTreeWidget</a> 및 <a href="qtablewidget">QTableWidget이</a> 있습니다.

source: Examples of typical problems include online update notification dialogs on macOS, false alarms from virus scanners, scheduled tasks such as virus signature updates, software updates pushed out to workstations, and chat programs popping up windows on top of the stack.
ko: 일반적인 문제의 예로는 macOS의 온라인 업데이트 알림 대화 상자, 바이러스 스캐너의 잘못된 경보, 바이러스 서명 업데이트와 같은 예약 된 작업, 워크 스테이션으로 푸시 된 소프트웨어 업데이트, 스택 상단에 팝업되는 채팅 프로그램 등이 있습니다.

source: Examples of what can be currently controlled using <a href="qml-qtlocation-mapparameter">MapParameter</a> are:
es: Ejemplos de lo que se puede controlar actualmente con <a href="qml-qtlocation-mapparameter">MapParameter</a> son:
ko: <a href="qml-qtlocation-mapparameter">MapParameter</a> 를 사용하여 현재 제어 할 수있는 것의 예 는 다음과 같습니다.

source: Examples: <code>0</code>, <code>18</code>, <code>+127</code>, <code>-255</code>, <code>12.34</code>, <code>-.5</code>, <code>0009</code>.
es: Ejemplos: <code>0</code> , <code>18</code> , <code>+127</code> , <code>-255</code> , <code>12.34</code> , <code>-.5</code> , <code>0009</code> .
ko: 예 : <code>0</code> , <code>18</code> , <code>+127</code> , <code>-255</code> , <code>12.34</code> , <code>-.5</code> , <code>0009</code> .

source: Except as contained in this notice, the name of the X Consortium shall not be used in advertising or otherwise to promote the sale, use or other dealings in this Software without prior written authorization from the X Consortium.
es: Salvo en los casos que se indican en el presente aviso,el nombre del X Consorcio no se utilizará en la publicidad o de otro modo para promover la venta,el uso u otras transacciones del presente Programa informático sin la autorización previa por escrito del X Consorcio.
ko: 이 고지에 포함 된 경우를 제외하고 X 컨소시엄의 이름은 X 컨소시엄의 사전 서면 승인없이 본 소프트웨어의 광고, 판매, 사용 또는 기타 거래를 홍보하는 데 사용되지 않습니다.

source: Except for one big difference, <a href="qexplicitlyshareddatapointer">QExplicitlySharedDataPointer</a> is just like <a href="qshareddatapointer">QSharedDataPointer</a>. The big difference is that member functions of <a href="qexplicitlyshareddatapointer">QExplicitlySharedDataPointer</a>
es: Excepto por una gran diferencia, <a href="qexplicitlyshareddatapointer">QExplicitlySharedDataPointer</a> es como <a href="qshareddatapointer">QSharedDataPointer</a> . La gran diferencia es que las funciones miembro de <a href="qexplicitlyshareddatapointer">QExplicitlySharedDataPointer</a>
ko: 하나의 큰 차이점을 제외하고 <a href="qexplicitlyshareddatapointer">QExplicitlySharedDataPointer</a> 는 <a href="qshareddatapointer">QSharedDataPointer</a> 와 같습니다 . 가장 큰 차이점은 <a href="qexplicitlyshareddatapointer">QExplicitlySharedDataPointer의</a> 멤버 함수입니다 .

source: Except for one big difference, QExplicitlySharedDataPointer is just like <a href="qshareddatapointer">QSharedDataPointer</a>. The big difference is that member functions of QExplicitlySharedDataPointer
ko: 한 가지 큰 차이점을 제외하고 QExplicitlySharedDataPointer는 <a href="qshareddatapointer">QSharedDataPointer</a> 와 같습니다 . 가장 큰 차이점은 QExplicitlySharedDataPointer의 멤버 함수입니다.

source: Except for the <a href="qml-qtlocation-mappinchevent#accepted-prop">accepted</a> property, all properties are read-only.
es: A excepci&oacute;n de la propiedad <a href="qml-qtlocation-mappinchevent#accepted-prop">aceptada</a> , todas las propiedades son de solo lectura.
ko: 을 제외하고 <a href="qml-qtlocation-mappinchevent#accepted-prop">허용</a> 프로퍼티, 모든 속성은 읽기 전용입니다.

source: Except for the Adobe Flash Player plugin, the plugins must be loaded manually using the Chromium command line syntax with the <code>--register-pepper-plugins</code> argument. The argument value is a list of entries, separated by commas, that contain the file path and one or several MIME types, separated by semicolons:
es: A excepci&oacute;n del complemento Adobe Flash Player, los complementos deben cargarse manualmente utilizando la sintaxis de la l&iacute;nea de comandos de Chromium con el <code>--register-pepper-plugins</code> . El valor del argumento es una lista de entradas, separadas por comas, que contienen la ruta del archivo y uno o varios tipos MIME, separados por punto y coma:
ko: Adobe Flash Player 플러그인을 제외하고 플러그인은 <code>--register-pepper-plugins</code> 인수 와 함께 Chromium 명령 줄 구문을 사용하여 수동으로로드해야합니다 . 인수 값은 파일 경로와 세미콜론으로 구분 된 하나 이상의 MIME 유형을 포함하는 항목 목록 (쉼표로 구분)입니다.

source: Exception support is disabled.
es: El apoyo de la excepción está desactivado.
ko: 예외 지원이 비활성화되었습니다.

source: Exception support is enabled. Set by default.
es: El soporte de excepciones está activado.Está establecido por defecto.
ko: 예외 지원이 활성화되었습니다. 기본적으로 설정되어 있습니다.

source: Exception-safe deferral of a QSemaphore::release() call
es: Aplazamiento seguro de una llamada de QSemaphore::release()
ko: QSemaphore :: release () 호출의 예외 안전 지연

source: Exception-safe wrapper around <a href="qobject#blockSignals">QObject::blockSignals</a>(). <a href="#details">More...</a>
es: Envoltorio seguro para excepciones alrededor de <a href="qobject#blockSignals">QObject :: blockSignals</a> (). <a href="#details">M&aacute;s...</a>
ko: 예외적으로 안전한 래퍼 <a href="qobject#blockSignals">QObject :: blockSignals</a> () . <a href="#details">더...</a>

source: Exception-safe wrapper around QObject::blockSignals()
es: Envoltura de excepción alrededor del Objeto Q::blockSignals()
ko: QObject :: blockSignals () 주위의 예외 안전 래퍼

source: Exceptions are reported in a defined packet format. A function code is returned to the requesting client equal to the original function code, except with its most significant bit set. This is equivalent to adding 0x80 to the value of the original function code.
es: Las excepciones se notifican en un formato de paquete definido.Se devuelve al cliente solicitante un código de función igual al código de función original,excepto con su conjunto de bits más significativo.Esto equivale a añadir 0x80 al valor del código de función original.
ko: 예외는 정의 된 패킷 형식으로보고됩니다. 가장 중요한 비트 세트를 제외하고 함수 코드는 원래 함수 코드와 동일한 요청 클라이언트로 리턴됩니다. 이것은 원래 기능 코드의 값에 0x80을 추가하는 것과 같습니다.

source: Exchange the item at index position
es: Intercambiar el artículo en la posición del índice
ko: 색인 위치에서 품목 교환

source: Exchanges buffer data between GPU and CPU
es: Intercambia datos del buffer entre la GPU y la CPU
ko: GPU와 CPU간에 버퍼 데이터 교환

source: Exchanges buffer data between GPU and CPU. <a href="#details">More...</a>
es: Intercambia datos de b&uacute;fer entre GPU y CPU. <a href="#details">M&aacute;s...</a>
ko: GPU와 CPU간에 버퍼 데이터를 교환합니다. <a href="#details">더...</a>

source: Exchanges buffer data between GPU and CPU. <a href="qt3drender-qbuffercapture#details">More...</a>
es: Intercambia datos de b&uacute;fer entre GPU y CPU. <a href="qt3drender-qbuffercapture#details">M&aacute;s...</a>
ko: GPU와 CPU간에 버퍼 데이터를 교환합니다. <a href="qt3drender-qbuffercapture#details">더...</a>

source: Exchanges the responsibilites of <code>*this</code> and
es: Intercambia las responsabilidades de <code>*this</code> y
ko: 의 교류 맞는 책임 <code>*this</code> 과

source: Excluded areas can be set as part of the <a href="qml-qtlocation-routequery">RouteQuery</a> type declaration or dynamically with the functions provided.
es: Las &aacute;reas excluidas se pueden configurar como parte de la declaraci&oacute;n de tipo de <a href="qml-qtlocation-routequery">RouteQuery</a> o din&aacute;micamente con las funciones proporcionadas.
ko: 제외 된 영역은 <a href="qml-qtlocation-routequery">RouteQuery</a> 유형 선언의 일부로 또는 제공된 함수를 사용하여 동적으로 설정할 수 있습니다 .

source: Excluding Qt Modules
es: Excluyendo los módulos Qt
ko: Qt 모듈 제외

source: Exclusive item delegate with a radio indicator that can be toggled on or off
es: Delegado de tema exclusivo con un indicador de radio que se puede activar o desactivar
ko: 켜거나 끌 수있는 라디오 표시기가있는 독점 품목 대리자

source: Exclusive item delegate with a radio indicator that can be toggled on or off. <a href="#details">More...</a>
es: Delegado de art&iacute;culo exclusivo con un indicador de radio que se puede activar o desactivar. <a href="#details">M&aacute;s...</a>
ko: 켜거나 끌 수있는 라디오 표시기가있는 독점 품목 대리자입니다. <a href="#details">더...</a>

source: Exclusive on/off indicator, for example, a <a href="qradiobutton">QRadioButton</a>.
es: Indicador de encendido / apagado exclusivo, por ejemplo, un <a href="qradiobutton">QRadioButton</a> .
ko: 독점 켜기 / 끄기 표시기 (예 : <a href="qradiobutton">QRadioButton)</a> .

source: Exclusive radio button that can be toggled on or off
es: Exclusivo botón de radio que puede ser activado o desactivado
ko: 켜거나 끌 수있는 독점 라디오 버튼

source: Exclusive radio button that can be toggled on or off. <a href="#details">More...</a>
es: Bot&oacute;n de radio exclusivo que se puede activar o desactivar. <a href="#details">M&aacute;s...</a>
ko: 켜거나 끌 수있는 독점 라디오 버튼. <a href="#details">더...</a>

source: ExclusiveGroup (QML type)
es: ExclusiveGroup (tipo QML)
ko: 독점 그룹 (QML 유형)

source: ExclusiveGroup QML Type
es: Grupo exclusivo Tipo QML
ko: 독점 그룹 QML 유형

source: ExclusiveGroup can contain several <a href="qml-qtquick-controls-action">Action</a> items, and those will automatically get their <a href="qml-qtquick-controls-action#exclusiveGroup-prop">Action::exclusiveGroup</a> property assigned.
ko: ExclusiveGroup은 여러 <a href="qml-qtquick-controls-action">작업</a> 항목을 포함 할 수 있으며 이러한 항목 에는 <a href="qml-qtquick-controls-action#exclusiveGroup-prop">Action :: exclusiveGroup</a> 속성 이 자동으로 할당됩니다.

source: ExclusiveGroup provides a way to declare several checkable controls as mutually exclusive. <a href="#details">More...</a>
ko: ExclusiveGroup은 여러 체크 가능한 컨트롤을 상호 배타적으로 선언하는 방법을 제공합니다. <a href="#details">더...</a>

source: Executables on Windows potentially link against <a href="qtmain">The qtmain Library</a>. This library is available under commercial licenses and also under the <a href="https://spdx.org/licenses/BSD-3-Clause.html">BSD 3-clause "New" or "Revised" License</a>.
es: Los ejecutables en Windows se enlazan potencialmente con <a href="qtmain">la biblioteca qtmain</a> . Esta biblioteca est&aacute; disponible bajo licencias comerciales y tambi&eacute;n bajo <a href="https://spdx.org/licenses/BSD-3-Clause.html">licencia BSD de 3 cl&aacute;usulas "Nueva" o "Revisada"</a> .
ko: Windows의 실행 파일 <a href="qtmain">은 qtmain 라이브러리</a> 와 잠재적으로 연결 됩니다. 이 라이브러리는 상업용 라이센스 및 <a href="https://spdx.org/licenses/BSD-3-Clause.html">BSD 3 절 "신규"또는 "개정 된"라이센스로 사용할 수</a> 있습니다.

source: Execute some script required in the new state
es: Ejecutar algún guión requerido en el nuevo estado
ko: 새로운 상태에서 필요한 일부 스크립트를 실행

source: Executes a SQL statement on the database and returns a <a href="qsqlquery">QSqlQuery</a> object. Use <a href="qsqldatabase#lastError">lastError</a>() to retrieve error information. If
es: Ejecuta una instrucci&oacute;n SQL en la base de datos y devuelve un objeto <a href="qsqlquery">QSqlQuery</a> . Utilice <a href="qsqldatabase#lastError">lastError</a> () para recuperar la informaci&oacute;n del error. Si
ko: 데이터베이스에서 SQL 문을 실행하고 <a href="qsqlquery">QSqlQuery</a> 오브젝트를 리턴 합니다. <a href="qsqldatabase#lastError">lastError</a> ()를 사용 하여 오류 정보를 검색하십시오. 만약

source: Executes a menu synchronously.
es: Ejecuta un menú de forma sincronizada.
ko: 메뉴를 동기식으로 실행합니다.

source: Executes a modal font dialog and returns a font.
es: Ejecuta un diálogo de fuente modal y devuelve una fuente.
ko: 모달 글꼴 대화 상자를 실행하고 글꼴을 반환합니다.

source: Executes a previously prepared SQL query in a batch. All the bound parameters have to be lists of variants. If the database doesn't support batch executions, the driver will simulate it using conventional <a href="qsqlquery#exec-1">exec</a>() calls.
es: Ejecuta una consulta SQL previamente preparada en un lote. Todos los par&aacute;metros vinculados deben ser listas de variantes. Si la base de datos no admite ejecuciones por lotes, el controlador la simular&aacute; utilizando llamadas <a href="qsqlquery#exec-1">exec</a> () convencionales .
ko: 이전에 준비된 SQL 쿼리를 일괄 처리로 실행합니다. 모든 바운드 매개 변수는 변형 목록이어야합니다. 데이터베이스가 배치 실행을 지원하지 않으면 드라이버는 일반적인 <a href="qsqlquery#exec-1">exec</a> () 호출을 사용하여이를 시뮬레이트 합니다.

source: Executes a previously prepared SQL query. Returns <code>true</code> if the query executed successfully; otherwise returns <code>false</code>.
es: Ejecuta una consulta SQL previamente preparada. Devuelve <code>true</code> si la consulta se ejecut&oacute; correctamente; de lo contrario, devuelve <code>false</code> .
ko: 이전에 준비된 SQL 쿼리를 실행합니다. 쿼리가 성공적으로 실행되면 <code>true</code> 를 반환 합니다 . 그렇지 않으면 <code>false</code> 를 반환합니다 .

source: Executes tests declared in
es: Ejecuta las pruebas declaradas en
ko: 에 선언 된 테스트를 실행합니다

source: Executes the SQL in
es: Ejecuta el SQL en
ko: 에서 SQL을 실행

source: Executes the given
es: Ejecuta el dado
ko: 주어진 실행

source: Executes the given <code>command</code> in a secondary shell. Succeeds if the command returns with a zero exit status; otherwise fails. You can check the return value of this function using a scope.
es: Ejecuta el <code>command</code> dado en un shell secundario. Tiene &eacute;xito si el comando regresa con un estado de salida cero; de lo contrario falla. Puede verificar el valor de retorno de esta funci&oacute;n usando un alcance.
ko: 보조 쉘에서 지정된 <code>command</code> 을 실행합니다 . 명령이 종료 상태 0으로 리턴되면 성공합니다. 그렇지 않으면 실패합니다. 범위를 사용하여이 함수의 반환 값을 확인할 수 있습니다.

source: Executes the job.
es: Ejecuta el trabajo.
ko: 작업을 실행합니다.

source: Executes the query
es: Ejecuta la consulta
ko: 쿼리를 실행합니다

source: Executes the query, returning true if successful; otherwise returns false.
es: Ejecuta la consulta,devolviendo verdadero si tiene éxito;de lo contrario,devuelve falso.
ko: 쿼리를 실행하고 성공하면 true를 반환합니다. 그렇지 않으면 false를 반환합니다.

source: Executes the scheduled layouts without waiting for the event processing to begin.
es: Ejecuta los diseños programados sin esperar a que comience el procesamiento del evento.
ko: 이벤트 처리가 시작되기를 기다리지 않고 예약 된 레이아웃을 실행합니다.

source: Executes the script on sub frames in addition to the main frame if
es: Ejecuta el guión en subcuadros además del cuadro principal si
ko: 다음과 같은 경우 메인 프레임 외에 서브 프레임에서 스크립트를 실행합니다

source: Executes this menu synchronously.
es: Ejecuta este menú de forma sincronizada.
ko: 이 메뉴를 동기식으로 실행합니다.

source: Executing C++ Before QML Tests
es: Ejecutando C++antes de las pruebas de QML
ko: QML 테스트 전에 C ++ 실행

source: Executing SQL Statements
es: Ejecución de declaraciones SQL
ko: SQL 문 실행

source: Executing a Query
es: Ejecutar una consulta
ko: 쿼리 실행

source: Exif tag, indicates information on the picture-taking conditions of a particular camera model.
es: Exif tag,indica información sobre las condiciones de toma de imágenes de un modelo de cámara en particular.
ko: Exif 태그는 특정 카메라 모델의 사진 촬영 조건에 대한 정보를 나타냅니다.

source: Existing anchors in the layout can be accessed with the <a href="qgraphicsanchorlayout#anchor">anchor</a>() function. Items that are anchored are automatically added to the layout, and if items are removed, all their anchors will be automatically removed.
es: Se puede acceder a los anclajes existentes en el dise&ntilde;o con la funci&oacute;n <a href="qgraphicsanchorlayout#anchor">ancla</a> (). Los elementos que est&aacute;n anclados se agregan autom&aacute;ticamente al dise&ntilde;o y, si se eliminan, todos sus anclajes se eliminar&aacute;n autom&aacute;ticamente.
ko: <a href="qgraphicsanchorlayout#anchor">anchor</a> () 함수 를 사용하여 레이아웃의 기존 앵커에 액세스 할 수 있습니다 . 고정 된 항목은 레이아웃에 자동으로 추가되며, 항목을 제거하면 모든 앵커가 자동으로 제거됩니다.

source: Existing fragments of text can be inserted with <a href="qtextcursor#insertFragment">insertFragment</a>() but, if you want to insert pieces of text in various formats, it is usually still easier to use <a href="qtextcursor#insertText">insertText</a>() and supply a character format.
es: Los fragmentos de texto existentes se pueden insertar con <a href="qtextcursor#insertFragment">insertFragment</a> () pero, si desea insertar fragmentos de texto en varios formatos, generalmente es a&uacute;n m&aacute;s f&aacute;cil usar <a href="qtextcursor#insertText">insertText</a> () y proporcionar un formato de car&aacute;cter.
ko: <a href="qtextcursor#insertFragment">insertFragment</a> ()를 사용 하여 기존 텍스트 조각을 삽입 할 수 있지만 다양한 형식으로 텍스트 조각을 삽입하려는 경우 대개 <a href="qtextcursor#insertText">insertText</a> () 를 사용 하고 문자 형식을 제공하는 것이 더 쉽습니다 .

source: Existing menus can be removed by opening a context menu over the label in the menu bar, and selecting <b>Remove Menu 'menu_name'</b>.
es: Los men&uacute;s existentes se pueden eliminar abriendo un men&uacute; contextual sobre la etiqueta en la barra de men&uacute;s y seleccionando <b>Eliminar men&uacute; 'nombre_men&uacute;'</b> .
ko: 메뉴 표시 줄의 레이블에서 컨텍스트 메뉴를 열고 메뉴 <b>제거 'menu_name'을</b> 선택하여 기존 메뉴를 제거 할 수 있습니다 .

source: Exit the fullscreen mode. (Added in Qt 5.6)
es: Salga del modo de pantalla completa.(Añadido en Qt 5.6)
ko: 전체 화면 모드를 종료하십시오. (Qt 5.6에서 추가됨)

source: Exiting a Composite State
es: Salir de un estado compuesto
ko: 복합 상태 종료

source: Expands all expandable items to the given
es: Expande todos los artículos expandibles a la
ko: 모든 확장 가능한 항목을 주어진 항목으로 확장

source: Expands all expandable items.
es: Expande todos los artículos expandibles.
ko: 모든 확장 가능한 항목을 확장합니다.

source: Expands the
es: Expande el
ko: 확장

source: Expands the current item and all its children (if present).
es: Expande el artículo actual y todos sus hijos (si están presentes).
ko: 현재 항목과 모든 하위 항목 (있는 경우)을 확장합니다.

source: Expands the item at the given
es: Expande el artículo en el momento dado
ko: 주어진 항목을 확장

source: Expands the item if
es: Expande el artículo si
ko: 다음과 같은 경우 항목을 확장합니다

source: Expands the model item specified by the
es: Expande el elemento modelo especificado por el
ko: 에 의해 지정된 모델 항목을 확장합니다

source: Expands the model item specified by the index.
es: Amplía el elemento modelo especificado por el índice.
ko: 색인으로 지정된 모델 항목을 확장합니다.

source: Expands the search query widget so that the extended search fields are shown.
es: Amplía el widget de consulta de búsqueda para que se muestren los campos de búsqueda extendidos.
ko: 확장 된 검색 필드가 표시되도록 검색 쿼리 위젯을 확장합니다.
