Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/qt/qt.*.123.xlf
Languages: es, ko, zh_cn

source: Event filters are supported in all threads, with the restriction that the monitoring object must live in the same thread as the monitored object. Similarly, <a href="qcoreapplication#sendEvent">QCoreApplication::sendEvent</a>() (unlike <a href="qcoreapplication#postEvent">postEvent()</a>) can only be used to dispatch events to objects living in the thread from which the function is called.
es: Los filtros de eventos se admiten en todos los subprocesos, con la restricci&oacute;n de que el objeto de supervisi&oacute;n debe vivir en el mismo subproceso que el objeto supervisado. De manera similar, <a href="qcoreapplication#sendEvent">QCoreApplication :: sendEvent</a> () (a diferencia de <a href="qcoreapplication#postEvent">postEvent ()</a> ) solo se puede usar para enviar eventos a objetos que viven en el hilo desde el que se llama a la funci&oacute;n.
ko: 이벤트 필터는 모든 스레드에서 지원되며 모니터링 오브젝트는 모니터링되는 오브젝트와 동일한 스레드에 있어야합니다. 마찬가지로 <a href="qcoreapplication#sendEvent">QCoreApplication :: sendEvent</a> () ( <a href="qcoreapplication#postEvent">postEvent ()</a> 와 달리 ) 는 함수가 호출되는 스레드에있는 객체에 이벤트를 전달하는 데만 사용할 수 있습니다.

source: Event handlers
es: Los manejadores de eventos
ko: 이벤트 핸들러

source: Event handling
es: Manejo de eventos
ko: 이벤트 처리

source: Event that can be used to handle hyperlinks in a "What's This?" text
es: Evento que puede ser usado para manejar hipervínculos en un texto de "¿Qué es esto?"
ko: "무엇입니까?"에서 하이퍼 링크를 처리하는 데 사용할 수있는 이벤트 본문

source: Event that is generated when a QAction is added, removed, or changed
es: Evento que se genera cuando se añade,elimina o cambia una Acción Q.
ko: QAction이 추가, 제거 또는 변경 될 때 생성되는 이벤트

source: Event that is sent to a widget when a drag and drop action leaves it
es: Evento que se envía a un widget cuando una acción de arrastrar y soltar lo deja
ko: 끌어서 놓기 조치가 위젯을 떠날 때 위젯으로 전송되는 이벤트

source: Event that is sent when a widget is shown
es: Evento que se envía cuando se muestra un widget
ko: 위젯이 표시 될 때 전송되는 이벤트

source: Event that is used to request helpful information about a particular point in a widget
es: Evento que se utiliza para solicitar información útil sobre un punto concreto de un widget
ko: 위젯의 특정 지점에 대한 유용한 정보를 요청하는 데 사용되는 이벤트

source: Event that is used to show messages in a status bar
es: Evento que se utiliza para mostrar mensajes en una barra de estado
ko: 상태 표시 줄에 메시지를 표시하는 데 사용되는 이벤트

source: Event that will be sent when there is a request to open a file or a URL
es: Evento que se enviará cuando haya una solicitud para abrir un archivo o una URL
ko: 파일 또는 URL 열기 요청이있을 때 전송되는 이벤트

source: Event type send by KeyBoardHandler
es: Tipo de evento enviado por KeyBoardHandler
ko: KeyBoardHandler가 보내는 이벤트 유형

source: Event which is generated when the user presses a key combination
es: Evento que se genera cuando el usuario pulsa una combinación de teclas
ko: 사용자가 키 조합을 누를 때 생성되는 이벤트

source: Event which is sent after a widget is hidden
es: Evento que se envía después de que se oculta un widget
ko: 위젯이 숨겨진 후 전송되는 이벤트

source: Event which is sent to a widget when a drag and drop action enters it
es: Evento que se envía a un widget cuando una acción de arrastrar y soltar entra en él
ko: 드래그 앤 드롭 동작으로 위젯에 전송되는 이벤트

source: Event which is sent when a drag and drop action is completed
es: Evento que se envía cuando se completa una acción de arrastrar y soltar
ko: 드래그 앤 드롭 동작이 완료되면 전송되는 이벤트

source: Event which is sent while a drag and drop action is in progress
es: Evento que se envía mientras se realiza una acción de arrastrar y soltar
ko: 드래그 앤 드롭 동작이 진행되는 동안 전송되는 이벤트

source: EventConnection (QML type)
es: EventConnection (tipo QML)
ko: EventConnection (QML 유형)

source: EventConnection QML Type
es: EventConnection Tipo QML
ko: EventConnection QML 유형

source: EventPoint (QML type)
es: EventPoint (tipo QML)
ko: EventPoint (QML 유형)

source: EventPoint QML Type
es: Tipo QML de EventPoint
ko: EventPoint QML 유형

source: EventTouchPoint (QML type)
es: EventTouchPoint (tipo QML)
ko: EventTouchPoint (QML 유형)

source: EventTouchPoint QML Type
ko: EventTouchPoint QML 유형

source: Events and the mechanism used to deliver them are covered in <a href="eventsandfilters">The Event System</a>.
es: Los eventos y el mecanismo utilizado para entregarlos se tratan en <a href="eventsandfilters">The Event System</a> .
ko: 이벤트 및 이벤트를 전달하는 데 사용되는 메커니즘 <a href="eventsandfilters">은 이벤트 시스템</a> 에서 다룹니다 .

source: Events are delivered to the window which contains the item specified in touchEvent.
es: Los eventos se entregan en la ventana que contiene el elemento especificado en touchEvent.
ko: touchEvent에 지정된 항목이 포함 된 창으로 이벤트가 전달됩니다.

source: Events are sorted in descending
es: Los eventos se ordenan en forma descendente
ko: 이벤트는 내림차순으로 정렬됩니다

source: Events for drag and drop in the graphics view framework
es: Eventos para arrastrar y soltar en el marco de la vista de gráficos
ko: 그래픽 뷰 프레임 워크에서 끌어서 놓기 이벤트

source: Events for widget moving in the graphics view framework
es: Eventos para el widget que se mueven en el marco de la vista de gráficos
ko: 그래픽 뷰 프레임 워크에서 위젯 이동 이벤트

source: Events for widget resizing in the graphics view framework
es: Eventos para redimensionar el widget en el marco de la vista de gráficos
ko: 그래픽 뷰 프레임 워크에서 위젯 크기 조정 이벤트

source: Events from the window system are
es: Los eventos del sistema de ventanas son
ko: 윈도우 시스템의 이벤트는

source: Events of high priority are processed before events of normal priority.
es: Los eventos de alta prioridad se procesan antes que los eventos de prioridad normal.
ko: 우선 순위가 높은 이벤트는 우선 순위가 높은 이벤트보다 먼저 처리됩니다.

source: Events when a tooltip is requested
es: Acontecimientos en los que se solicita una información de herramienta
ko: 툴팁이 요청 될 때의 이벤트

source: Events with this priority are sent after events with HighEventPriority or NormalEventPriority.
es: Los eventos con esta prioridad se envían después de los eventos con Prioridad de Evento Alta o Prioridad de Evento Normal.
ko: 이 우선 순위를 가진 이벤트는 HighEventPriority 또는 NormalEventPriority가있는 이벤트 후에 전송됩니다.

source: Events with this priority are sent after events with HighEventPriority, but before events with LowEventPriority.
es: Los eventos con esta prioridad se envían después de los eventos con Alta Prioridad de Evento,pero antes de los eventos con Baja Prioridad de Evento.
ko: 이 우선 순위가있는 이벤트는 HighEventPriority가있는 이벤트 후에 보내지 만 LowEventPriority가있는 이벤트 전에 보내집니다.

source: Events with this priority are sent before events with NormalEventPriority or LowEventPriority.
es: Los eventos con esta prioridad se envían antes que los eventos con prioridad normal o baja.
ko: 이 우선 순위가있는 이벤트는 NormalEventPriority 또는 LowEventPriority가있는 이벤트보다 먼저 전송됩니다.

source: Events, Transitions and Guards
es: Eventos,transiciones y guardias
ko: 이벤트, 전환 및 경비

source: Every <a href="qfont">QFont</a> has a <a href="qfont#key">key</a>() which you can use, for example, as the key in a cache or dictionary. If you want to store a user's font preferences you could use <a href="qsettings">QSettings</a>, writing the font information with <a href="qfont#toString">toString</a>() and reading it back with <a href="qfont#fromString">fromString</a>(). The operator&lt;&lt;() and operator&gt;&gt;() functions are also available, but they work on a data stream.
es: Cada <a href="qfont">QFont</a> tiene una <a href="qfont#key">clave</a> () que puede usar, por ejemplo, como clave en un cach&eacute; o diccionario. Si desea almacenar las preferencias de fuente de un usuario, puede usar <a href="qsettings">QSettings</a> , escribiendo la informaci&oacute;n de la fuente con <a href="qfont#toString">toString</a> () y ley&eacute;ndola con <a href="qfont#fromString">fromString</a> (). Las funciones de operador &lt;&lt; () y operador &gt;&gt; () tambi&eacute;n est&aacute;n disponibles, pero funcionan en un flujo de datos.
ko: 모든 <a href="qfont">QFont</a> 에는 예를 들어 캐시 또는 사전의 키로 사용할 수 있는 <a href="qfont#key">키</a> ()가 있습니다. 사용자의 글꼴 환경 설정을 저장하려면 <a href="qsettings">QSettings를</a> 사용 하여 글꼴 정보를 <a href="qfont#toString">toString</a> ()으로 <a href="qfont#fromString">쓰고 fromString</a> ()으로 다시 읽을 수 있습니다. operator &lt;&lt; () 및 operator &gt;&gt; () 함수도 사용할 수 있지만 데이터 스트림에서 작동합니다.

source: Every <a href="qloggingcategory">QLoggingCategory</a> object created is passed to the filter, and the filter is free to change the respective category configuration with <a href="qloggingcategory#setEnabled">setEnabled</a>().
es: Cada objeto <a href="qloggingcategory">QLoggingCategory</a> creado se pasa al filtro, y el filtro es libre de cambiar la configuraci&oacute;n de la categor&iacute;a respectiva con <a href="qloggingcategory#setEnabled">setEnabled</a> ().
ko: 생성 된 모든 <a href="qloggingcategory">QLoggingCategory</a> 객체는 필터로 전달되며 필터는 <a href="qloggingcategory#setEnabled">setEnabled</a> () 를 사용하여 각 범주 구성을 자유롭게 변경할 수 있습니다 .

source: Every <a href="qml-qtquick-item">Item</a> based component has a <code>state</code> property and a
es: Cada <a href="qml-qtquick-item">art&iacute;culo</a> basado en componentes tiene un <code>state</code> propiedad y una
ko: 모든 <a href="qml-qtquick-item">아이템</a> 기반 컴포넌트는 <code>state</code> 속성과

source: Every JavaScript expression, function or file in QML has its own unique variable object. Local variables declared in one will never conflict with local variables declared in another.
es: Cada expresión,función o archivo de JavaScript en QML tiene su propio y único objeto variable.Las variables locales declaradas en una nunca entrarán en conflicto con las variables locales declaradas en otra.
ko: QML의 모든 JavaScript 표현식, 함수 또는 파일에는 고유 한 변수 객체가 있습니다. 하나에서 선언 된 지역 변수는 다른 변수에서 선언 된 지역 변수와 충돌하지 않습니다.

source: Every QFont has a <a href="qfont#key">key</a>() which you can use, for example, as the key in a cache or dictionary. If you want to store a user's font preferences you could use <a href="qsettings">QSettings</a>, writing the font information with <a href="qfont#toString">toString</a>() and reading it back with <a href="qfont#fromString">fromString</a>(). The operator&lt;&lt;() and operator&gt;&gt;() functions are also available, but they work on a data stream.
ko: 모든 QFont에는 예를 들어 캐시 또는 사전의 키로 사용할 수 있는 <a href="qfont#key">키</a> ()가 있습니다. 사용자의 글꼴 기본 설정을 저장하려면 <a href="qsettings">QSettings를</a> 사용 하여 <a href="qfont#toString">toString</a> ()으로 글꼴 정보를 쓰고 <a href="qfont#fromString">fromString</a> ()으로 다시 읽을 수 있습니다. operator &lt;&lt; () 및 operator &gt;&gt; () 함수도 사용할 수 있지만 데이터 스트림에서 작동합니다.

source: Every QML object type has a defined set of attributes. Each instance of an object type is created with the set of attributes that have been defined for that object type. There are several different kinds of attributes which can be specified, which are described below.
es: Cada tipo de objeto QML tiene un conjunto definido de atributos.Cada instancia de un tipo de objeto se crea con el conjunto de atributos que se han definido para ese tipo de objeto.Hay varios tipos diferentes de atributos que pueden especificarse,que se describen a continuación.
ko: 모든 QML 오브젝트 유형에는 정의 된 속성 세트가 있습니다. 오브젝트 유형의 각 인스턴스는 해당 오브젝트 유형에 대해 정의 된 속성 세트로 작성됩니다. 지정할 수있는 여러 가지 종류의 속성이 있으며 아래에 설명되어 있습니다.

source: Every QML object type has exactly one
es: Cada tipo de objeto QML tiene exactamente un
ko: 모든 QML 객체 유형에는 정확히 하나가 있습니다

source: Every Vulkan-based <a href="qwindow">QWindow</a> must be associated with a <a href="qvulkaninstance">QVulkanInstance</a> by calling <a href="qwindow#setVulkanInstance">QWindow::setVulkanInstance</a>(). Thus a typical application pattern is the following:
es: Cada <a href="qwindow">QWindow</a> basada en Vulkan debe asociarse con una <a href="qvulkaninstance">QVulkanInstance</a> llamando a <a href="qwindow#setVulkanInstance">QWindow :: setVulkanInstance</a> (). Por tanto, un patr&oacute;n de aplicaci&oacute;n t&iacute;pico es el siguiente:
ko: 모든 Vulkan 기반 <a href="qwindow">QWindow</a> 는 <a href="qwindow#setVulkanInstance">QWindow :: setVulkanInstance</a> ()를 호출 하여 <a href="qvulkaninstance">QVulkanInstance</a> 와 연결되어야합니다 . 따라서 일반적인 응용 프로그램 패턴은 다음과 같습니다.

source: Every Vulkan-based <a href="qwindow">QWindow</a> must be associated with a QVulkanInstance by calling <a href="qwindow#setVulkanInstance">QWindow::setVulkanInstance</a>(). Thus a typical application pattern is the following:
ko: 모든 Vulkan 기반 <a href="qwindow">QWindow</a> 는 <a href="qwindow#setVulkanInstance">QWindow :: setVulkanInstance</a> ()를 호출하여 QVulkanInstance와 연결되어야합니다 . 따라서 일반적인 애플리케이션 패턴은 다음과 같습니다.

source: Every attempt is made to read or write the value of a descriptor or characteristic on the hardware. This means that meta information such as <a href="qlowenergycharacteristic#properties">QLowEnergyCharacteristic::properties</a>() is generally ignored when reading and writing. As an example, it is possible to call <a href="qlowenergyservice#writeCharacteristic">writeCharacteristic</a>() despite the characteristic being read-only based on its meta data description. The resulting write request is forwarded to the connected device and it is up to the device to respond to the potentially invalid request. In this case the result is the emission of the <a href="qlowenergyservice#ServiceError-enum">CharacteristicWriteError</a> in response to the returned device error. This behavior simplifies interaction with devices which report wrong meta information. If it was not possible to forward the request to the remote device the <a href="qlowenergyservice#ServiceError-enum">OperationError</a> is set. A potential reason could be that the to-be-written characteristic object does not even belong the current service. In summary, the two types of errors permit a quick distinction of local and remote error cases.
es: Se hace todo lo posible por leer o escribir el valor de un descriptor o caracter&iacute;stica en el hardware. Esto significa que la metainformaci&oacute;n como <a href="qlowenergycharacteristic#properties">QLowEnergyCharacteristic :: properties</a> () generalmente se ignora al leer y escribir. Como ejemplo, es posible llamar a <a href="qlowenergyservice#writeCharacteristic">writeCharacteristic</a> () a pesar de que la caracter&iacute;stica sea de solo lectura basada en su descripci&oacute;n de metadatos. La solicitud de escritura resultante se reenv&iacute;a al dispositivo conectado y depende del dispositivo responder a la solicitud potencialmente no v&aacute;lida. En este caso, el resultado es la emisi&oacute;n del <a href="qlowenergyservice#ServiceError-enum">CharacteristicWriteError</a>en respuesta al error del dispositivo devuelto. Este comportamiento simplifica la interacci&oacute;n con los dispositivos que reportan metainformaci&oacute;n incorrecta. Si no fue posible reenviar la solicitud al dispositivo remoto, se establece <a href="qlowenergyservice#ServiceError-enum">OperationError</a> . Una posible raz&oacute;n podr&iacute;a ser que el objeto caracter&iacute;stico por escribir ni siquiera pertenece al servicio actual. En resumen, los dos tipos de errores permiten una r&aacute;pida distinci&oacute;n de los casos de error local y remoto.
ko: 하드웨어에서 디스크립터 또는 특성의 값을 읽거나 쓰려고 시도합니다. 이는 <a href="qlowenergycharacteristic#properties">QLowEnergyCharacteristic :: properties</a> () 와 같은 메타 정보 는 일반적으로 읽고 쓸 때 무시됩니다. 예를 들어 메타 데이터 설명에 따라 특성이 읽기 전용 임에도 불구하고 <a href="qlowenergyservice#writeCharacteristic">writeCharacteristic</a> () 을 호출 할 수 있습니다 . 결과 쓰기 요청은 연결된 장치로 전달되며 잠재적으로 유효하지 않은 요청에 응답하는 것은 장치의 책임입니다. 이 경우 결과는 <a href="qlowenergyservice#ServiceError-enum">특징적 쓰기 오류</a> 의 방출입니다.반환 된 장치 오류에 대한 응답으로 이 동작은 잘못된 메타 정보를보고하는 장치와의 상호 작용을 단순화합니다. 요청을 원격 장치로 전달할 수없는 경우 <a href="qlowenergyservice#ServiceError-enum">OperationError</a> 가 설정됩니다. 잠재적 인 이유는 기록 될 특성 객체가 현재 서비스에 속하지 않기 때문일 수있다. 요약하면 두 가지 유형의 오류는 로컬 및 원격 오류 사례를 빠르게 구분할 수 있습니다.

source: Every call from CLR bytecode to native code implies a small performance hit, and necessary type conversions introduce an additional delay with every layer that exists between the two frameworks. Consequently every approach to mix .NET and native code should try to minimize the communication necessary between the different worlds.
es: Cada llamada del código de bytes CLR al código nativo implica un pequeño golpe de rendimiento,y las conversiones de tipo necesarias introducen un retraso adicional con cada capa que existe entre los dos marcos.En consecuencia,cada enfoque para mezclar el código .NET y el código nativo debe tratar de minimizar la comunicación necesaria entre los diferentes mundos.
ko: CLR 바이트 코드에서 네이티브 코드로의 모든 호출은 약간의 성능 저하를 의미하며 필요한 유형 변환은 두 프레임 워크 사이에 존재하는 모든 계층마다 추가 지연을 발생시킵니다. 결과적으로 .NET과 네이티브 코드를 혼합하는 모든 접근 방식은 서로 다른 세계간에 필요한 통신을 최소화해야합니다.

source: Every child of this node that has the flag <a href="qsgnode#Flag-enum">QSGNode::OwnedByParent</a> set, will also be deleted.
es: Todos los hijos de este nodo que tengan el indicador <a href="qsgnode#Flag-enum">QSGNode :: OwnByParent</a> establecido, tambi&eacute;n ser&aacute;n eliminados.
ko: <a href="qsgnode#Flag-enum">QSGNode :: OwnedByParent</a> 플래그가 설정된 이 노드의 모든 하위 도 삭제됩니다.

source: Every connection you make emits a signal, so duplicate connections emit two signals. You can break a connection using <a href="qobject#disconnect">disconnect</a>().
es: Cada conexi&oacute;n que realiza emite una se&ntilde;al, por lo que las conexiones duplicadas emiten dos se&ntilde;ales. Puede romper una conexi&oacute;n usando <a href="qobject#disconnect">desconectar</a> ().
ko: 모든 연결은 신호를 생성하므로 중복 연결은 두 개의 신호를 방출합니다. <a href="qobject#disconnect">disconnect</a> ()를 사용하여 연결을 끊을 수 있습니다 .

source: Every dependency that is a result of .depend_command is checked for existence. Non-existing dependencies are ignored. This value was introduced in Qt 5.13.2.
ko: .depend_command의 결과 인 모든 종속성이 존재하는지 확인합니다. 존재하지 않는 종속성은 무시됩니다. 이 값은 Qt 5.13.2에서 도입되었습니다.

source: Every element that the user needs to interact with or react to is an accessible object, and should provide this information. These are mainly visual objects, such as widgets and widget elements, but can also be content, such as sounds.
es: Cada elemento con el que el usuario necesita interactuar o reaccionar es un objeto accesible,y debe proporcionar esta información.Se trata principalmente de objetos visuales,como los widgets y los elementos de los widgets,pero también pueden ser contenidos,como los sonidos.
ko: 사용자가 상호 작용하거나 반응해야하는 모든 요소는 액세스 가능한 개체이므로이 정보를 제공해야합니다. 이들은 주로 위젯 및 위젯 요소와 같은 시각적 객체이지만 사운드와 같은 컨텐츠 일 수도 있습니다.

source: Every event contains an accept flag that indicates whether the receiver wants the event. You should call <a href="qevent#accept">QTabletEvent::accept</a>() if you handle the tablet event; otherwise it will be sent to the parent widget. The exception are <a href="qevent#Type-enum">TabletEnterProximity</a> and <a href="qevent#Type-enum">TabletLeaveProximity</a> events: these are only sent to <a href="qapplication">QApplication</a> and do not check whether or not they are accepted.
es: Cada evento contiene una bandera de aceptaci&oacute;n que indica si el receptor desea el evento. Debe llamar a <a href="qevent#accept">QTabletEvent :: accept</a> () si maneja el evento de la tableta; de lo contrario, se enviar&aacute; al widget principal. La excepci&oacute;n son los eventos <a href="qevent#Type-enum">TabletEnterProximity</a> y <a href="qevent#Type-enum">TabletLeaveProximity</a> : estos solo se env&iacute;an a <a href="qapplication">QApplication</a> y no verifican si son aceptados o no.
ko: 모든 이벤트에는 수신자가 이벤트를 원하는지 여부를 나타내는 accept 플래그가 있습니다. 타블렛 이벤트를 처리하는 경우 <a href="qevent#accept">QTabletEvent :: accept</a> ()를 호출해야합니다 . 그렇지 않으면 상위 위젯으로 전송됩니다. <a href="qevent#Type-enum">TabletEnterProximity</a> 및 <a href="qevent#Type-enum">TabletLeaveProximity</a> 이벤트 는 예외입니다 . 이러한 이벤트는 <a href="qapplication">QApplication</a> 으로 만 전송 되며 수락 여부를 확인하지 않습니다.

source: Every filter section should have filter attributes assigned to it, to enable documentation filtering. If no filter attribute is defined, the documentation will only be shown if no filtering occurs, meaning the current custom filter in the <a href="qhelpengine">QHelpEngine</a> does not contain any filter attributes.
es: Cada secci&oacute;n de filtro debe tener atributos de filtro asignados para permitir el filtrado de la documentaci&oacute;n. Si no se define ning&uacute;n atributo de filtro, la documentaci&oacute;n solo se mostrar&aacute; si no se produce ning&uacute;n filtrado, lo que significa que el filtro personalizado actual en <a href="qhelpengine">QHelpEngine</a> no contiene ning&uacute;n atributo de filtro.
ko: 문서 필터링을 사용하려면 모든 필터 섹션에 필터 속성이 할당되어 있어야합니다. 필터 속성이 정의되지 않은 경우, 필터링이 발생하지 않은 경우에만 문서가 표시됩니다. 이는 <a href="qhelpengine">QHelpEngine</a> 의 현재 사용자 정의 필터에 필터 속성이 포함되어 있지 않음을 의미 합니다.

source: Every instance of the <a href="qaxscript">QAxScript</a> class represents a piece of scripting code in a particular scripting language. The code is loaded into the script engine using <a href="qaxscript#load">load</a>(). Functions declared in the code can be called using <a href="qaxscript#call">call</a>().
es: Cada instancia de la clase <a href="qaxscript">QAxScript</a> representa un fragmento de c&oacute;digo de secuencias de comandos en un lenguaje de secuencias de comandos en particular. El c&oacute;digo se carga en el motor de secuencia de comandos mediante <a href="qaxscript#load">load</a> (). Las funciones declaradas en el c&oacute;digo se pueden llamar usando <a href="qaxscript#call">call</a> ().
ko: <a href="qaxscript">QAxScript</a> 클래스 의 모든 인스턴스 는 특정 스크립팅 언어의 스크립팅 코드를 나타냅니다. 코드는 <a href="qaxscript#load">load</a> ()를 사용하여 스크립트 엔진에로드됩니다 . 코드에서 선언 된 함수는 <a href="qaxscript#call">call</a> ()을 사용하여 호출 할 수 있습니다 .

source: Every instance of the <a href="qaxscriptengine">QAxScriptEngine</a> class represents an interpreter for script code in a particular scripting language. The class is usually not used directly. The <a href="qaxscript">QAxScript</a> and <a href="qaxscriptmanager">QAxScriptManager</a> classes provide convenient functions to handle and call script code.
es: Cada instancia de la clase <a href="qaxscriptengine">QAxScriptEngine</a> representa un int&eacute;rprete de c&oacute;digo de secuencia de comandos en un lenguaje de secuencia de comandos en particular. La clase generalmente no se usa directamente. Las clases <a href="qaxscript">QAxScript</a> y <a href="qaxscriptmanager">QAxScriptManager</a> proporcionan funciones convenientes para manejar y llamar c&oacute;digo de secuencia de comandos.
ko: <a href="qaxscriptengine">QAxScriptEngine</a> 클래스 의 모든 인스턴스 는 특정 스크립트 언어의 스크립트 코드에 대한 인터프리터를 나타냅니다. 수업은 일반적으로 직접 사용되지 않습니다. <a href="qaxscript">QAxScript</a> 및 <a href="qaxscriptmanager">QAxScriptManager</a> 클래스는 손잡이와 전화 스크립트 코드에 편리한 기능을 제공합니다.

source: Every instance of the QAxScript class represents a piece of scripting code in a particular scripting language. The code is loaded into the script engine using <a href="qaxscript#load">load</a>(). Functions declared in the code can be called using <a href="qaxscript#call">call</a>().
ko: QAxScript 클래스의 모든 인스턴스는 특정 스크립팅 언어로 된 스크립팅 코드 조각을 나타냅니다. 코드는 <a href="qaxscript#load">load</a> ()를 사용하여 스크립트 엔진에로드됩니다 . 코드에 선언 된 함수는 <a href="qaxscript#call">call</a> ()을 사용하여 호출 할 수 있습니다 .

source: Every instance of the QAxScriptEngine class represents an interpreter for script code in a particular scripting language. The class is usually not used directly. The <a href="qaxscript">QAxScript</a> and <a href="qaxscriptmanager">QAxScriptManager</a> classes provide convenient functions to handle and call script code.
ko: QAxScriptEngine 클래스의 모든 인스턴스는 특정 스크립팅 언어의 스크립트 코드에 대한 인터프리터를 나타냅니다. 클래스는 일반적으로 직접 사용되지 않습니다. <a href="qaxscript">QAxScript</a> 및 <a href="qaxscriptmanager">QAxScriptManager</a> 클래스는 손잡이와 전화 스크립트 코드에 편리한 기능을 제공합니다.
