Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/qt/qt.*.123.xlf
Languages: es, ko, zh_cn

source: Call <a href="qthreadpool#maxThreadCount-prop">maxThreadCount</a>() to query the maximum number of threads to be used. If needed, you can change the limit with <a href="qthreadpool#maxThreadCount-prop">setMaxThreadCount</a>(). The default <a href="qthreadpool#maxThreadCount-prop">maxThreadCount</a>() is <a href="qthread#idealThreadCount">QThread::idealThreadCount</a>(). The <a href="qthreadpool#activeThreadCount-prop">activeThreadCount</a>() function returns the number of threads currently doing work.
zh_cn: 调用<a href="qthreadpool#maxThreadCount-prop">maxThreadCount</a>（）查询要使用的最大线程数。如果需要，可以使用<a href="qthreadpool#maxThreadCount-prop">setMaxThreadCount</a>（）更改限制。默认的<a href="qthreadpool#maxThreadCount-prop">maxThreadCount</a>（）是<a href="qthread#idealThreadCount">QThread :: idealThreadCount</a>（）。该<a href="qthreadpool#activeThreadCount-prop">activeThreadCount</a>（）函数返回线程的数量目前正在做的工作。

source: Call <a href="qurl#isValid">isValid</a>() to check if the URL is valid. This can be done at any point during the constructing of a URL. If <a href="qurl#isValid">isValid</a>() returns <code>false</code>, you should <a href="qurl#clear">clear</a>() the URL before proceeding, or start over by parsing a new URL with <a href="qurl#setUrl">setUrl</a>().
zh_cn: 调用<a href="qurl#isValid">isValid</a>（）来检查URL是否有效。可以在构建URL期间的任何时候完成此操作。如果<a href="qurl#isValid">isValid</a>（）返回 <code>false</code> ，则应在继续之前<a href="qurl#clear">清除</a>（）URL，或通过使用<a href="qurl#setUrl">setUrl</a>（）解析新的URL重新开始。

source: Call <a href="qwidget#show">show</a>() to make the rubber band visible; also when the rubber band is not a top-level. Hiding or destroying the widget will make the rubber band disappear. The rubber band can be a <a href="qrubberband#Shape-enum">Rectangle</a> or a <a href="qrubberband#Shape-enum">Line</a> (vertical or horizontal), depending on the <a href="qrubberband#shape">shape</a>() it was given when constructed.
zh_cn: 调用<a href="qwidget#show">show</a>（）以使橡皮筋可见；当橡皮筋不是顶级的时候 隐藏或破坏小部件将使橡皮筋消失。橡皮筋可以是<a href="qrubberband#Shape-enum">矩形</a>或<a href="qrubberband#Shape-enum">直线</a>（垂直或水平），具体取决于构造时给出的<a href="qrubberband#shape">形状</a>（）。

source: Call <a href="qwidget#sizePolicy-prop">QWidget::setSizePolicy</a>() to specify the space requirements of the widget.
zh_cn: 调用<a href="qwidget#sizePolicy-prop">QWidget :: setSizePolicy</a>（）来指定小部件的空间要求。

source: Call <a href="qwidget#updateGeometry">QWidget::updateGeometry</a>() whenever the size hint, minimum size hint or size policy changes. This will cause a layout recalculation. Multiple consecutive calls to <a href="qwidget#updateGeometry">QWidget::updateGeometry</a>() will only cause one layout recalculation.
zh_cn: 每当大小提示，最小大小提示或大小策略更改时，调用<a href="qwidget#updateGeometry">QWidget :: updateGeometry</a>（）。这将导致布局重新计算。连续调用<a href="qwidget#updateGeometry">QWidget :: updateGeometry</a>（）只会导致一次布局重新计算。

source: Call <a href="qwidget#winId">QWidget::winId</a> to enforce a native window (this implies 3).
zh_cn: 调用<a href="qwidget#winId">QWidget :: winId</a>强制执行本机窗口（这意味着3）。

source: Call <a href="qwindow#destroy">destroy</a>() to free the platform resources if necessary.
zh_cn: 如有必要，调用<a href="qwindow#destroy">destroy</a>（）释放平台资源。

source: Call <code>QueryInterface()</code> on the returned interface to get the interface you want to call.
zh_cn: 在返回的接口上调用 <code>QueryInterface()</code> 以获取要调用的接口。

source: Call <code>dumpdoc</code> with the following command line parameters:
zh_cn: 使用以下命令行参数调用 <code>dumpdoc</code> ：

source: Call QtConcurrent::filteredReduced() like this:
zh_cn: 像这样调用QtConcurrent::filteredReduced()。

source: Call QtConcurrent::mappedReduced() like this:
zh_cn: 像这样调用QtConcurrent::mappedReduced()。

source: Call a glDraw*() function
zh_cn: 调用glDraw*()函数

source: Call one of the <a href="qxmlquery">QXmlQuery</a> evaluation functions to run the query.
zh_cn: 调用<a href="qxmlquery">QXmlQuery</a>评估函数之一来运行查询。

source: Call the <a href="activeqt-idc">idc</a> tool to generate an IDL file for the COM server
zh_cn: 调用<a href="activeqt-idc">idc</a>工具为COM服务器生成IDL文件

source: Call the <a href="qinappstore#restorePurchases">restorePurchases</a>() function to begin this process. Granted that the remote store supports it, you will then at some point get <a href="qinappstore#transactionReady">transactionReady</a>() for each unlockable item which has previously been purchased by the current user.
zh_cn: 调用<a href="qinappstore#restorePurchases">restorePurchases</a>（）函数开始此过程。如果远程存储支持它，那么您将在某个时候为当前用户先前已购买的每个可解锁物品获取<a href="qinappstore#transactionReady">transactionReady</a>（）。

source: Call the <a href="qml-qtquick-context2d#beginPath-method">beginPath()</a> method to set a new path.
zh_cn: 调用<a href="qml-qtquick-context2d#beginPath-method">beginPath（）</a>方法来设置新路径。

source: Call the <a href="qml-qtquick-context2d#moveTo-method">moveTo</a>(<code>x</code>, <code>y</code>) method to set your starting position on the canvas at the point (<code>x</code>, <code>y</code>).
zh_cn: 调用<a href="qml-qtquick-context2d#moveTo-method">moveTo</a>（ <code>x</code> ， <code>y</code> ）方法以在画布上的点（ <code>x</code> ， <code>y</code> ）处设置起始位置。

source: Call the <a href="qsensor#connectToBackend">connectToBackend</a>() method to force the sensor to connect to a backend immediately. This is automatically called if you call <a href="qsensor#start">start</a>() so you only need to do this if you need access to sensor properties (ie. to poll the sensor's meta-data before you use it).
zh_cn: 调用<a href="qsensor#connectToBackend">connectToBackend</a>（）方法以强制传感器立即连接到后端。如果您调用<a href="qsensor#start">start</a>（），则会自动调用此方法，因此仅在需要访问传感器属性（即在使用传感器之前先轮询传感器的元数据）时才需要执行此操作。

source: Call the <code>context.beginPath()</code> method to set the clipping path.
zh_cn: 调用 <code>context.beginPath()</code> 方法来设置剪切路径。

source: Call the <code>context.clip()</code> method.
zh_cn: 调用 <code>context.clip()</code> 方法。

source: Call the node's <a href="qremoteobjecthostbase#enableRemoting">enableRemoting()</a> function to share the source object.
zh_cn: 调用节点的<a href="qremoteobjecthostbase#enableRemoting">enableRemoting（）</a>函数以共享源对象。

source: Call the node's <a href="qremoteobjectnode#acquire">acquire()</a> function to create a pointer to a replica.
zh_cn: 调用节点的<a href="qremoteobjectnode#acquire">acquire（）</a>函数来创建一个指向副本的指针。

source: Call this function after you have installed a new translator with <a href="qcoreapplication#installTranslator">QCoreApplication::installTranslator</a>, to ensure that your user-interface shows up-to-date translations.
zh_cn: 使用<a href="qcoreapplication#installTranslator">QCoreApplication :: installTranslator</a>安装新的转换器后，请调用此函数，以确保您的用户界面显示最新的转换器。

source: Call this function during <a href="qquickframebufferobject-renderer#synchronize">synchronize</a>() to invalidate the current FBO. This will result in a new FBO being created with <a href="qquickframebufferobject-renderer#createFramebufferObject">createFramebufferObject</a>().
zh_cn: 在<a href="qquickframebufferobject-renderer#synchronize">syncize</a>（）期间调用此函数以使当前FBO无效。这将导致使用<a href="qquickframebufferobject-renderer#createFramebufferObject">createFramebufferObject</a>（）创建一个新的FBO 。

source: Call this function for sending the buffered data immediately to the serial port. The number of bytes successfully written depends on the operating system. In most cases, this function does not need to be called, because the <a href="qserialport">QSerialPort</a> class will start sending data automatically once control is returned to the event loop. In the absence of an event loop, call <a href="qserialport#waitForBytesWritten">waitForBytesWritten</a>() instead.
zh_cn: 调用此函数可将缓冲的数据立即发送到串行端口。成功写入的字节数取决于操作系统。在大多数情况下，不需要调用此函数，因为一旦控制权返回事件循环，<a href="qserialport">QSerialPort</a>类将自动开始发送数据。在没有事件循环的情况下，请改为调用<a href="qserialport#waitForBytesWritten">waitForBytesWritten</a>（）。

source: Call this function if the <a href="qwidget#sizeHint-prop">sizeHint</a>() or <a href="qwidget#sizePolicy-prop">sizePolicy</a>() have changed.
zh_cn: 如果<a href="qwidget#sizeHint-prop">sizeHint</a>（）或<a href="qwidget#sizePolicy-prop">sizePolicy</a>（）已更改，则调用此函数。

source: Call this function if the widget's <a href="qgraphicswidget#sizeHint">sizeHint</a>() has changed.
zh_cn: 如果小部件的<a href="qgraphicswidget#sizeHint">sizeHint</a>（）已更改，则调用此函数。

source: Call this function if you need <a href="qabstractsocket">QAbstractSocket</a> to start sending buffered data immediately. The number of bytes successfully written depends on the operating system. In most cases, you do not need to call this function, because <a href="qabstractsocket">QAbstractSocket</a> will start sending data automatically once control goes back to the event loop. In the absence of an event loop, call <a href="qabstractsocket#waitForBytesWritten">waitForBytesWritten</a>() instead.
zh_cn: 如果需要<a href="qabstractsocket">QAbstractSocket</a>立即开始发送缓冲的数据，请调用此函数。成功写入的字节数取决于操作系统。在大多数情况下，您不需要调用此函数，因为一旦控制权返回事件循环，<a href="qabstractsocket">QAbstractSocket</a>将自动开始发送数据。在没有事件循环的情况下，请改为调用<a href="qabstractsocket#waitForBytesWritten">waitForBytesWritten</a>（）。

source: Call this function if you need <a href="qlocalsocket">QLocalSocket</a> to start sending buffered data immediately. The number of bytes successfully written depends on the operating system. In most cases, you do not need to call this function, because <a href="qlocalsocket">QLocalSocket</a> will start sending data automatically once control goes back to the event loop. In the absence of an event loop, call <a href="qlocalsocket#waitForBytesWritten">waitForBytesWritten</a>() instead.
zh_cn: 如果需要<a href="qlocalsocket">QLocalSocket</a>立即开始发送缓冲的数据，请调用此函数。成功写入的字节数取决于操作系统。在大多数情况下，您不需要调用此函数，因为一旦控制权返回事件循环，<a href="qlocalsocket">QLocalSocket</a>将自动开始发送数据。在没有事件循环的情况下，请改为调用<a href="qlocalsocket#waitForBytesWritten">waitForBytesWritten</a>（）。

source: Call this function if you need <a href="qsslsocket">QSslSocket</a> to start sending buffered data immediately. The number of bytes successfully written depends on the operating system. In most cases, you do not need to call this function, because <a href="qabstractsocket">QAbstractSocket</a> will start sending data automatically once control goes back to the event loop. In the absence of an event loop, call <a href="qsslsocket#waitForBytesWritten">waitForBytesWritten</a>() instead.
zh_cn: 如果需要<a href="qsslsocket">QSslSocket</a>立即开始发送缓冲的数据，请调用此函数。成功写入的字节数取决于操作系统。在大多数情况下，您不需要调用此函数，因为一旦控制权返回事件循环，<a href="qabstractsocket">QAbstractSocket</a>将自动开始发送数据。在没有事件循环的情况下，请改为调用<a href="qsslsocket#waitForBytesWritten">waitForBytesWritten</a>（）。

source: Call this function only if <a href="qfuture#isValid">isValid</a>() returns <code>true</code>, otherwise the behavior is undefined. This function takes (moves) the first result from the <a href="qtcore-changes-qt6#qfuture">QFuture</a> object, when only one result is expected. If there are any other results, they are discarded after taking the first one. If the result is not immediately available, this function will block and wait for the result to become available. The <a href="qtcore-changes-qt6#qfuture">QFuture</a> will try to use move semantics if possible, and will fall back to copy construction if the type is not movable. After the result was taken, <a href="qfuture#isValid">isValid</a>() will evaluate as <code>false</code>.
zh_cn: 仅当<a href="qfuture#isValid">isValid</a>（）返回 <code>true</code> 时，才调用此函数，否则该行为是不确定的。当仅期望一个结果时，此函数从<a href="qtcore-changes-qt6#qfuture">QFuture</a>对象获取（移动）第一个结果。如果还有其他结果，则取第一个结果后将其丢弃。如果结果不是立即可用，则此功能将阻止并等待结果变为可用。该<a href="qtcore-changes-qt6#qfuture">QFuture</a>如果可能，将尝试使用移动语义，并且将回退到拷贝构造，如果该类型是不可移动的。取得结果后，<a href="qfuture#isValid">isValid</a>（）的评估结果为 <code>false</code> 。

source: Call this function to bind this texture to the current texture target.
zh_cn: 调用此函数将此纹理绑定到当前纹理目标上。

source: Call this function to close the widget.
zh_cn: 调用此函数来关闭小组件。

source: Call this function to enqueue image upload operations to
zh_cn: 调用此函数,将图片上传操作报送至。

source: Call this function to ensure that manually created interfaces are properly memory managed.
zh_cn: 调用此函数,以确保手动创建的接口得到正确的内存管理。

source: Call this function to explicitly update the dynamic texture.
zh_cn: 调用此函数来显式更新动态纹理。

source: Call this function to explicitly update the dynamic texture. Calling <a href="qsgtexture#bind">bind</a>() will bind the content that was previously updated.
zh_cn: 调用此函数以显式更新动态纹理。调用<a href="qsgtexture#bind">bind</a>（）将绑定先前更新的内容。

source: Call this function to notify the client that is hosting this ActiveX control that the property
zh_cn: 调用此函数来通知托管此ActiveX控件的客户机,该属性是

source: Call this function to refresh the token. Access tokens are not permanent. After a time specified along with the access token when it was obtained, the access token will become invalid.
zh_cn: 调用此函数来刷新令牌。访问令牌不是永久性的。当获得访问令牌时,超过指定的时间后,访问令牌就会失效。

source: Call this function to register the type <code>T</code>. <code>T</code> must be declared with <a href="qmetatype#Q_DECLARE_METATYPE">Q_DECLARE_METATYPE</a>(). Returns the meta type Id.
zh_cn: 调用此函数注册类型 <code>T</code> 。 <code>T</code> 必须用<a href="qmetatype#Q_DECLARE_METATYPE">Q_DECLARE_METATYPE</a>（）声明。返回元类型ID。

source: Call this function to request permission to change the property
zh_cn: 调用此函数,请求允许更改属性。

source: Call this function to reset the OpenGL context its default state.
zh_cn: 调用此函数重置OpenGL上下文的默认状态。

source: Call this function to reset the current OpenGL context its default state.
zh_cn: 调用此函数重置当前OpenGL上下文的默认状态。

source: Call this function to save memory, if you are not interested in the output of the process.
zh_cn: 如果你对进程的输出不感兴趣,可以调用这个函数来保存内存。

source: Call this function when examining the queues of a given Vulkan device, in order to decide which queue can be used for performing presentation.
zh_cn: 当检查给定Vulkan设备的队列时,调用该函数,以决定哪个队列可以用于执行演示。

source: Call this function when the FBO should be rendered again.
zh_cn: 当需要再次渲染FBO时,调用此函数。

source: Call this function when there is a need to request a context for a given OpenGL version or profile. The sizes for depth, stencil and alpha buffers are taken care of automatically and there is no need to request those explicitly.
zh_cn: 当需要为给定的OpenGL版本或配置文件请求上下文时,调用此函数。深度、模板和alpha缓冲区的大小会自动处理,无需明确请求。

source: Call this function whenever the state of your accessible object or one of its sub-elements has been changed either programmatically (e.g. by calling <a href="qlabel#text-prop">QLabel::setText</a>()) or by user interaction.
zh_cn: 只要可访问对象或其子元素之一的状态已通过编程方式更改（例如，通过调用<a href="qlabel#text-prop">QLabel :: setText</a>（））或通过用户交互，便调用此函数。

source: Call this method only when <a href="qsctpserver">QSctpServer</a> is in UnconnectedState.
zh_cn: 仅当<a href="qsctpserver">QSctpServer</a>处于UnconnectedState时才调用此方法。

source: Call this method only when <a href="qsctpsocket">QSctpSocket</a> is in <a href="qabstractsocket#SocketState-enum">UnconnectedState</a>.
zh_cn: 调用此方法仅适用<a href="qsctpsocket">QSctpSocket</a>是<a href="qabstractsocket#SocketState-enum">UnconnectedState</a>。

source: Call this method to accept the fullscreen request. It sets the <a href="qml-qtwebengine-webengineview#isFullScreen-prop">WebEngineView::isFullScreen</a> property to be equal to <a href="qml-qtwebengine-fullscreenrequest#toggleOn-prop">toggleOn</a>.
zh_cn: 调用此方法以接受全屏请求。它将<a href="qml-qtwebengine-webengineview#isFullScreen-prop">WebEngineView :: isFullScreen</a>属性设置为等于<a href="qml-qtwebengine-fullscreenrequest#toggleOn-prop">toggleOn</a>。

source: Call this to finish a frame of OpenGL rendering, and make sure to call <a href="qopenglcontext#makeCurrent">makeCurrent</a>() again before issuing any further OpenGL commands, for example as part of a new frame.
zh_cn: 调用它完成一个OpenGL渲染框架，并确保在发出任何其他OpenGL命令（例如，作为新框架的一部分）之前再次调用<a href="qopenglcontext#makeCurrent">makeCurrent</a>（）。

source: Call this to get the default framebuffer object for the current surface.
zh_cn: 调用此函数获取当前曲面的默认framebuffer对象。

source: Call this when the application has finished performing all necessary reactions to the purchase. If the purchase succeeded, the application should store the information about the transaction in a safe way before finalizing it. All transactions should be finalized.
zh_cn: 当应用程序完成了对购买的所有必要反应时,调用该函数。如果购买成功,应用程序应该在最终完成交易之前,以安全的方式存储有关交易的信息。所有的交易都应该被最终完成。

source: Call this when the application has finished performing all necessary reactions to the purchase. If the status is <a href="qinapptransaction#TransactionStatus-enum">PurchaseApproved</a>, the application should store the information about the transaction in a safe way before finalizing it. All transactions should be finalized.
zh_cn: 当应用程序完成对购买的所有必要反应后，调用此函数。如果状态为<a href="qinapptransaction#TransactionStatus-enum">PurchaseApproved</a>，则应用程序应在完成交易之前以安全的方式存储有关交易的信息。所有交易都应完成。

source: Callback function is called on the owning (GUI or main) thread.
zh_cn: 回调函数在自己(GUI或主)线程上被调用。

source: Callback function is called on the thread pool's worker thread.
zh_cn: 在线程池的工作线程上调用回调函数。

source: Callback function that is triggered for changes in the animated
zh_cn: 触发的回调函数。

source: Called after the
zh_cn: 后调用

source: Called by <a href="qicon#addFile">QIcon::addFile</a>(). Adds a specialized pixmap from the file with the given
zh_cn: 由<a href="qicon#addFile">QIcon :: addFile</a>（）调用。使用给定的文件从文件中添加专门的像素图

source: Called by <a href="qicon#addPixmap">QIcon::addPixmap</a>(). Adds a specialized
zh_cn: 由<a href="qicon#addPixmap">QIcon :: addPixmap</a>（）调用。添加一个专门的

source: Called by <a href="qsensorgesture">QSensorGesture</a> object constructor to create the recognizers backend.
zh_cn: 由<a href="qsensorgesture">QSensorGesture</a>对象构造函数调用以创建识别器后端。

source: Called by <a href="qsensorgesture#startDetection">QSensorGesture::startDetection</a>() to start this recognizer. Implementors should start the sensors. Returns true if the operation is successful.
zh_cn: 由<a href="qsensorgesture#startDetection">QSensorGesture :: startDetection</a>（）调用以启动此识别器。实施者应启动传感器。如果操作成功，则返回true。

source: Called by <a href="qsensorgesture#stopDetection">QSensorGesture::stopDetection</a>() to stop this recognizer. Returns true if the call succeeds, otherwise false.
zh_cn: 由<a href="qsensorgesture#stopDetection">QSensorGesture :: stopDetection</a>（）调用以停止此识别器。如果调用成功，则返回true，否则返回false。

source: Called by the InputAspect object after the integration has been created with
zh_cn: 在集成被创建后,由InputAspect对象调用。

source: Called by the input item to inform the platform input methods when there has been state changes in editor's input method query attributes. When calling the function
zh_cn: 由输入项调用,当编辑器的输入法查询属性发生状态变化时,通知平台输入法。当调用该函数时

source: Called by the input item when the word currently being composed is tapped by the user, as indicated by the action
zh_cn: 当用户点击当前正在组成的单词时,由输入项调用,如动作所示。

source: Called by the keyboard layer to indicate that
zh_cn: 被键盘层调用,表示

source: Called by the manager to create the recognizers. Plugins should initialize and register their recognizers using <a href="qsensorgesturemanager#registerSensorGestureRecognizer">QSensorGestureManager::registerSensorGestureRecognizer</a>() here.
zh_cn: 由经理调用以创建识别器。插件应在此处使用<a href="qsensorgesturemanager#registerSensorGestureRecognizer">QSensorGestureManager :: registerSensorGestureRecognizer</a>（）初始化并注册其识别器。

source: Called during state machine initialization to set up a state machine using the initial values for data model variables specified by their keys,
zh_cn: 在状态机初始化过程中调用,使用其键指定的数据模型变量的初始值设置状态机。

source: Called from the derived plugin to register a function
zh_cn: 从派生插件中调用以注册一个函数。

source: Called from the frame preparation phase. There is a call to this function before each invocation of <a href="qsgrendernode#render">render</a>().
zh_cn: 从框架准备阶段调用。每次调用<a href="qsgrendernode#render">render</a>（）之前，都会对此函数进行调用。

source: Called in the main thread when all the jobs have completed. This is a good point to push changes back to the frontend.
zh_cn: 当所有工作完成后,在主线程中调用。这是一个很好的点,可以将变更推回前台。

source: Called on the render thread when it is time to sync the state of the item with the scene graph.
zh_cn: 当需要将项目的状态与场景图同步时,在渲染线程上调用。

source: Called right after the QApplication object was instantiated. Use this function to perform setup that does not require a <a href="qqmlengine">QQmlEngine</a> instance.
zh_cn: 在实例化QApplication对象之后立即调用。使用此功能可以执行不需要<a href="qqmlengine">QQmlEngine</a>实例的设置。

source: Called right after the test execution has finished. Use this function to clean up before everything will start to be destructed.
zh_cn: 在测试执行结束后立即调用。在所有东西开始被销毁之前,使用这个函数进行清理。

source: Called when
zh_cn: 调用时

source: Called when a connection to the Service has been lost. The
zh_cn: 当与服务的连接丢失时调用。该

source: Called when one or more backend aspects sends a notification
zh_cn: 当一个或多个后端方面发送通知时调用。

source: Called when playback is paused.
zh_cn: 暂停播放时调用。

source: Called when playback is started, or when resumed from paused state.
zh_cn: 在开始播放或从暂停状态恢复时调用。

source: Called when playback is stopped.
zh_cn: 停止播放时调用。

source: Called when the
zh_cn: 呼叫时

source: Called when the <a href="qabstractspinbox">QAbstractSpinBox</a> is destroyed.
zh_cn: 在<a href="qabstractspinbox">QAbstractSpinBox</a>被销毁时调用。

source: Called when the QML engine is available. Any <a href="qqmlengine#addImportPath">import paths</a>, <a href="qqmlengine#addPluginPath">plugin paths</a>, and <a href="qqmlfileselector#setExtraSelectors">extra file selectors</a> will have been set on the engine by this point.
zh_cn: 当QML引擎可用时调用。至此，将在引擎上设置所有<a href="qqmlengine#addImportPath">导入路径</a>，<a href="qqmlengine#addPluginPath">插件路径</a>和其他<a href="qqmlfileselector#setExtraSelectors">文件选择器</a>。

source: Called when the number of incubating objects changes.
zh_cn: 当孵化对象的数量发生变化时调用。

source: Called when the shader is being initialized to get the fragment shader source code.
zh_cn: 在着色器被初始化时调用,以获取片段着色器源代码。

source: Called when the shader is being initialized to get the vertex shader source code.
zh_cn: 在着色器初始化时调用,以获取顶点着色器源代码。

source: Called when the specified error occurs.
zh_cn: 当指定的错误发生时调用。

source: Called when the status of the incubator changes.
zh_cn: 当孵化器的状态发生变化时调用。

source: Called when the user clicks on pre-edit text at
zh_cn: 当用户点击预编辑文本时,会被调用。

source: Called whenever the state of this shader should be updated from
zh_cn: 每当该着色器的状态应该从

source: Callers of this function take ownership of the pointer.
zh_cn: 该函数的调用者拥有该指针的所有权。

source: Calling <a href="qcameraimagecapture#capture">capture</a>() while
zh_cn: 在同时调用<a href="qcameraimagecapture#capture">capture</a>（）

source: Calling <a href="qevent#ignore">QEvent::ignore</a>() or <a href="qevent#accept">QEvent::accept</a>() on
zh_cn: 调用<a href="qevent#ignore">QEvent :: ignore</a>（）或<a href="qevent#accept">QEvent :: accept</a>（）

source: Calling <a href="qjsengine#setObjectOwnership">setObjectOwnership</a>() overrides the default ownership.
zh_cn: 调用<a href="qjsengine#setObjectOwnership">setObjectOwnership</a>（）会覆盖默认所有权。

source: Calling <a href="qjsvalue#call">call</a>() can cause an exception to occur in the script engine; in that case, <a href="qjsvalue#call">call</a>() returns the value that was thrown (typically an <code>Error</code> object). You can call <a href="qjsvalue#isError">isError</a>() on the return value to determine whether an exception occurred.
zh_cn: 调用<a href="qjsvalue#call">call</a>（）会导致脚本引擎中发生异常；在这种情况下，<a href="qjsvalue#call">call</a>（）返回所抛出的值（通常是一个 <code>Error</code> 对象）。您可以在返回值上调用<a href="qjsvalue#isError">isError</a>（）以确定是否发生异常。

source: Calling <a href="qlayoutitem#sizeHint">QLayoutItem::sizeHint</a>(), etc. may be expensive. So, you should store the value in a local variable if you need it again later within in the same function.
zh_cn: 调用<a href="qlayoutitem#sizeHint">QLayoutItem :: sizeHint</a>（）等可能会很昂贵。因此，如果稍后需要在同一函数中再次使用该值，则应将其存储在局部变量中。

source: Calling <a href="qlineedit#text-prop">setText</a>() resets the modified flag to false.
zh_cn: 调用<a href="qlineedit#text-prop">setText</a>（）会将修改后的标志重置为false。
