Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/qt/qt.*.123.xlf
Languages: es, ko, zh_cn

source: External objects such as stylesheets or images referenced in the HTML document should be located relative to
es: Los objetos externos como las hojas de estilo o las imágenes a las que se hace referencia en el documento HTML deben ubicarse en relación con
ko: HTML 문서에서 참조되는 스타일 시트 또는 이미지와 같은 외부 객체는

source: External objects, such as stylesheets or images referenced in the HTML document, are located relative to
es: Los objetos externos,como las hojas de estilo o las imágenes a las que se hace referencia en el documento HTML,se localizan en relación con
ko: HTML 시트에서 참조되는 스타일 시트 또는 이미지와 같은 외부 객체는

source: External objects, such as stylesheets or images referenced in the HTML document, should be located relative to
es: Los objetos externos,como las hojas de estilo o las imágenes a las que se hace referencia en el documento HTML,deben ubicarse en relación con
ko: HTML 문서에서 참조되는 스타일 시트 또는 이미지와 같은 외부 객체는

source: External resources
ko: 외부 자원

source: Extra Files
es: Archivos extra
ko: 추가 파일

source: Extra care has to be taken to avoid using the framebuffer when the GUI/main thread is performing compositing. The signals <a href="qopenglwidget#aboutToCompose">aboutToCompose</a>() and <a href="qopenglwidget#frameSwapped">frameSwapped</a>() will be emitted when the composition is starting and ending. They are emitted on the GUI/main thread. This means that by using a direct connection <a href="qopenglwidget#aboutToCompose">aboutToCompose</a>() can block the GUI/main thread until the worker thread has finished its rendering. After that, the worker thread must perform no further rendering until the <a href="qopenglwidget#frameSwapped">frameSwapped</a>() signal is emitted. If this is not acceptable, the worker thread has to implement a double buffering mechanism. This involves drawing using an alternative render target, that is fully controlled by the thread, e.g. an additional framebuffer object, and blitting to the <a href="qopenglwidget">QOpenGLWidget</a>'s framebuffer at a suitable time.
es: Se debe tener especial cuidado para evitar el uso del framebuffer cuando la GUI / subproceso principal est&aacute; realizando la composici&oacute;n. Las se&ntilde;ales <a href="qopenglwidget#aboutToCompose">aboutToCompose</a> () y <a href="qopenglwidget#frameSwapped">frameSwapped</a> () se emitir&aacute;n cuando la composici&oacute;n comience y termine. Se emiten en la GUI / hilo principal. Esto significa que al usar una conexi&oacute;n directa <a href="qopenglwidget#aboutToCompose">aboutToCompose</a> () puede bloquear la GUI / hilo principal hasta que el hilo de trabajo haya terminado su renderizado. Despu&eacute;s de eso, el hilo de trabajo no debe realizar m&aacute;s renderizado hasta que el <a href="qopenglwidget#frameSwapped">frameSwapped</a>() se emite la se&ntilde;al. Si esto no es aceptable, el hilo de trabajo tiene que implementar un mecanismo de almacenamiento en b&uacute;fer doble. Esto implica dibujar usando un destino de renderizado alternativo, que est&aacute; completamente controlado por el hilo, por ejemplo, un objeto framebuffer adicional, y blitting al <a href="qopenglwidget">framebuffer</a> del QOpenGLWidget en un momento adecuado.
ko: GUI / 메인 스레드가 합성을 수행 할 때 프레임 버퍼를 사용하지 않도록 각별히주의해야합니다. 컴포지션이 시작되고 종료 될 때 <a href="qopenglwidget#aboutToCompose">ToCompose</a> () 및 <a href="qopenglwidget#frameSwapped">frameSwapped</a> ()에 대한 신호 가 방출됩니다. GUI / 메인 스레드에서 생성됩니다. 이는 작업자 스레드가 렌더링을 완료 할 때까지 <a href="qopenglwidget#aboutToCompose">aboutToCompose</a> ()에 대한 직접 연결을 사용 하여 GUI / 메인 스레드를 차단할 수 있음을 의미합니다 . 그런 다음 작업자 스레드는 <a href="qopenglwidget#frameSwapped">frameSwapped</a> 까지 더 이상 렌더링을 수행하지 않아야합니다.() 신호가 방출됩니다. 이것이 허용되지 않으면 작업자 스레드는 이중 버퍼링 메커니즘을 구현해야합니다. 여기에는 스레드에 의해 완전히 제어되는 대체 렌더 타겟을 사용하여 그리기 (예 : 추가 프레임 버퍼 객체) 및 적절한 시간에 <a href="qopenglwidget">QOpenGLWidget</a> 의 프레임 버퍼에 블리 팅이 포함됩니다 .

source: Extra care has to be taken to avoid using the framebuffer when the GUI/main thread is performing compositing. The signals <a href="qopenglwidget#aboutToCompose">aboutToCompose</a>() and <a href="qopenglwidget#frameSwapped">frameSwapped</a>() will be emitted when the composition is starting and ending. They are emitted on the GUI/main thread. This means that by using a direct connection <a href="qopenglwidget#aboutToCompose">aboutToCompose</a>() can block the GUI/main thread until the worker thread has finished its rendering. After that, the worker thread must perform no further rendering until the <a href="qopenglwidget#frameSwapped">frameSwapped</a>() signal is emitted. If this is not acceptable, the worker thread has to implement a double buffering mechanism. This involves drawing using an alternative render target, that is fully controlled by the thread, e.g. an additional framebuffer object, and blitting to the QOpenGLWidget's framebuffer at a suitable time.
ko: GUI / 메인 스레드가 합성을 수행 할 때 프레임 버퍼를 사용하지 않도록 각별히주의해야합니다. 컴포지션이 시작되고 종료 될 때 <a href="qopenglwidget#aboutToCompose">aboutToCompose</a> () 및 <a href="qopenglwidget#frameSwapped">frameSwapped</a> ()에 대한 신호 가 방출됩니다. GUI / 메인 스레드에서 내 보냅니다. 이는 <a href="qopenglwidget#aboutToCompose">aboutToCompose</a> ()에 대한 직접 연결을 사용 하여 작업자 스레드가 렌더링을 완료 할 때까지 GUI / 주 스레드를 차단할 수 있음을 의미합니다 . 그 후 작업자 스레드는 <a href="qopenglwidget#frameSwapped">frameSwapped가</a> 될 때까지 더 이상 렌더링을 수행하지 않아야합니다.() 신호가 방출됩니다. 이것이 허용되지 않는 경우 작업자 스레드는 이중 버퍼링 메커니즘을 구현해야합니다. 여기에는 스레드에 의해 완전히 제어되는 대체 렌더 대상 (예 : 추가 프레임 버퍼 개체)을 사용하여 그리기와 적절한 시간에 QOpenGLWidget의 프레임 버퍼에 대한 블리 팅이 포함됩니다.

source: Extra routing attributes
es: Atributos extra de enrutamiento
ko: 추가 라우팅 속성

source: Extra space added to the tab height.
es: Espacio extra añadido a la altura de la pestaña.
ko: 탭 높이에 추가 공간이 추가되었습니다.

source: Extra space added to the tab width.
es: Espacio extra añadido al ancho de la pestaña.
ko: 탭 너비에 추가 공간이 추가되었습니다.

source: Extra values in the
es: Los valores extra en el
ko: 의 추가 값

source: ExtraSelection Struct
es: Estructura de extra-selección
ko: ExtraSelection 구조

source: Equivalent to GL_RGB32F
es: Equivalente a GL_RGB32F

source: By default, this property contains a rectangle at the origin with zero width and height.
zh_cn: 默认情况下,该属性在原点处包含一个宽度和高度为零的矩形。

source: By default, this property contains a regular expression with an empty pattern (which therefore matches any string).
zh_cn: 默认情况下,此属性包含一个空模式的正则表达式(因此它匹配任何字符串)。

source: By default, this property contains a regular expression with the pattern .* that matches any string.
zh_cn: 默认情况下,此属性包含一个正则表达式,其模式为.*,可匹配任何字符串。

source: By default, this property contains a regular expression with the pattern <code>.*</code> that matches any string.
zh_cn: 默认情况下，此属性包含带有 <code>.*</code> 模式的正则表达式，该模式与任何字符串匹配。

source: By default, this property contains a size in which both width and height have values of 16777215.
zh_cn: 默认情况下,该属性包含一个尺寸,其中宽度和高度的值均为16777215。

source: By default, this property contains a size with zero width and height.
zh_cn: 默认情况下,该属性包含一个宽度和高度为零的大小。

source: By default, this property contains a time of 00:00:00 and 0 milliseconds.
zh_cn: 默认情况下,此属性包含时间为00:00:00和0毫秒。

source: By default, this property contains a time of 23:59:59 and 999 milliseconds.
zh_cn: 默认情况下,此属性包含23:59:59和999毫秒的时间。

source: By default, this property contains a value of -1 because the stack is initially empty.
zh_cn: 默认情况下,这个属性包含一个-1的值,因为堆栈最初是空的。

source: By default, this property contains a value of -1 because there are initially no tabs in the widget.
zh_cn: 默认情况下,此属性包含的值为-1,因为小组件中最初没有标签。

source: By default, this property contains a value of -infinity.
zh_cn: 默认情况下,该属性的值为-infinity。

source: By default, this property contains a value of 0.
zh_cn: 默认情况下,此属性包含的值为0。

source: By default, this property contains a value of 1.
zh_cn: 默认情况下,此属性包含的值为1。

source: By default, this property contains a value of 1000.
zh_cn: 默认情况下,该属性包含的值为1000。

source: By default, this property contains a value of 16777215.
zh_cn: 默认情况下,该属性包含的值为16777215。

source: By default, this property contains a value of 32767.
zh_cn: 默认情况下,该属性包含的值为32767。

source: By default, this property contains a value of 5.
zh_cn: 默认情况下,该属性包含的值为5。

source: By default, this property contains a value of 80 pixels.
zh_cn: 默认情况下,该属性包含一个80像素的值。

source: By default, this property contains a value of 80.
zh_cn: 默认情况下,该属性包含一个80的值。

source: By default, this property contains a value of infinity.
zh_cn: 默认情况下,该属性包含的值为无穷大。

source: By default, this property contains a value that depends on the user's platform and <a href="qscreen#geometry-prop">screen geometry</a>.
zh_cn: 默认情况下，此属性包含一个值，该值取决于用户的平台和<a href="qscreen#geometry-prop">屏幕的几何形状</a>。

source: By default, this property contains a value that depends on the user's platform and screen geometry.
zh_cn: 默认情况下,该属性包含一个取决于用户平台和屏幕几何形状的值。

source: By default, this property contains a value that depends on the user's platform and style preferences.
zh_cn: 默认情况下,该属性包含一个取决于用户的平台和风格偏好的值。

source: By default, this property contains an empty URL.
zh_cn: 默认情况下,此属性包含一个空的URL。

source: By default, this property contains an empty key sequence.
zh_cn: 默认情况下,此属性包含一个空键序列。

source: By default, this property contains an empty list.
zh_cn: 默认情况下,此属性包含一个空列表。

source: By default, this property contains an empty rectangle.
zh_cn: 默认情况下,该属性包含一个空的矩形。

source: By default, this property contains an empty string and Qt falls back to using the tool tip to provide this information.
zh_cn: 默认情况下,这个属性包含一个空的字符串,Qt会回到使用工具提示来提供这个信息。

source: By default, this property contains an empty string list.
zh_cn: 默认情况下,此属性包含一个空字符串列表。

source: By default, this property contains an empty string.
zh_cn: 默认情况下,此属性包含一个空字符串。

source: By default, this property contains an empty, invalid URL.
zh_cn: 默认情况下,此属性包含一个空的、无效的URL。

source: By default, this property contains no standard buttons.
zh_cn: 默认情况下,此属性不包含标准按钮。

source: By default, this property contains no window flags.
zh_cn: 默认情况下,此属性不包含窗口标志。

source: By default, this property contains the action's text.
zh_cn: 默认情况下,此属性包含动作的文本。

source: By default, this property contains the application's default font.
zh_cn: 默认情况下,该属性包含应用程序的默认字体。

source: By default, this property contains the application's default palette.
zh_cn: 默认情况下,此属性包含应用程序的默认调色板。

source: By default, this property has a value of -1, indicating that no page is currently shown.
zh_cn: 默认情况下,该属性的值为-1,表示当前没有显示页面。

source: By default, this property has a value of -1, meaning that auto-expansion is disabled.
zh_cn: 默认情况下,该属性的值为-1,意味着自动扩展被禁用。

source: By default, this property has a value of 0.
zh_cn: 默认情况下,该属性的值为0。

source: By default, this property has a value of 1.
zh_cn: 默认情况下,该属性的值为1。

source: By default, this property has a value of 10.
zh_cn: 默认情况下,该属性的值为10。

source: By default, this property has a value of 3.
zh_cn: 默认情况下,该属性的值为3。

source: By default, this property has a value of 7.
zh_cn: 默认情况下,该属性的值为7。

source: By default, this property is <a href="qt#WindowModality-enum">Qt::NonModal</a>
zh_cn: 默认情况下，此属性为<a href="qt#WindowModality-enum">Qt :: NonModal</a>

source: By default, this property is <a href="qt#WindowModality-enum">Qt::NonModal</a>.
zh_cn: 默认情况下，此属性为<a href="qt#WindowModality-enum">Qt :: NonModal</a>。

source: By default, this property is <code>RenderMode::SingleThreaded</code>.
zh_cn: 默认情况下，此属性为 <code>RenderMode::SingleThreaded</code> 。

source: By default, this property is <code>false</code> (duplicates are not allowed).
zh_cn: 默认情况下，此属性为 <code>false</code> （不允许重复）。

source: By default, this property is <code>false</code> (new text does not overwrite existing text).
zh_cn: 默认情况下，此属性为 <code>false</code> （新文本不会覆盖现有文本）。

source: By default, this property is <code>false</code> and <a href="qwidget#show">show</a>() pops up the dialog as modeless. Setting this property to true is equivalent to setting <a href="qwidget#windowModality-prop">QWidget::windowModality</a> to <a href="qt#WindowModality-enum">Qt::ApplicationModal</a>.
zh_cn: 默认情况下，此属性为 <code>false</code> ,并且<a href="qwidget#show">show</a>（）弹出对话框为无模式。将此属性设置为true等效于将<a href="qwidget#windowModality-prop">QWidget :: windowModality</a>设置为<a href="qt#WindowModality-enum">Qt :: ApplicationModal</a>。

source: By default, this property is <code>false</code> except for items where the role is one of <code>CheckBox</code>, <code>RadioButton</code>, <code>Button</code>, <code>MenuItem</code>, <code>PageTab</code>, <code>EditableText</code>, <code>SpinBox</code>, <code>ComboBox</code>, <code>Terminal</code> or <code>ScrollBar</code>.
zh_cn: 默认情况下，此属性为 <code>false</code> ,但角色为 <code>CheckBox</code> ， <code>RadioButton</code> ， <code>Button</code> ， <code>MenuItem</code> ， <code>PageTab</code> ， <code>EditableText</code> ， <code>SpinBox</code> ， <code>ComboBox</code> ， <code>Terminal</code> 或 <code>ScrollBar</code> 之一的项目除外。

source: By default, this property is <code>false</code>, but it will return <code>true</code> for items that have <a href="qquickitem#activeFocus-prop">QQuickItem::hasActiveFocus()</a> returning <code>true</code>.
zh_cn: 默认情况下，这个属性是 <code>false</code> ，但它会返回 <code>true</code> 为有项目<a href="qquickitem#activeFocus-prop">QQuickItem :: hasActiveFocus（）</a>返回 <code>true</code> 。

source: By default, this property is <code>false</code>.
zh_cn: 默认情况下，此属性为 <code>false</code> 。

source: By default, this property is <code>false</code>. The effect of editing depends on the insert policy.
zh_cn: 默认情况下，此属性为 <code>false</code> 。编辑的效果取决于插入策略。

source: By default, this property is <code>false</code>. This behavior is appopriate for most types of dialogs. A notable exception is message boxes on most platforms (e.g. Windows), where the button box is centered horizontally.
zh_cn: 默认情况下，此属性为 <code>false</code> 。对于大多数类型的对话框，此行为是适当的。一个值得注意的例外是在大多数平台（例如Windows）上的消息框，其中的按钮框水平居中。

source: By default, this property is <code>false</code>;
zh_cn: 默认情况下，此属性为 <code>false</code> ；

source: By default, this property is <code>nullptr</code>.
zh_cn: 默认情况下，此属性为 <code>nullptr</code> 。

source: By default, this property is <code>true</code> (actions are enabled).
zh_cn: 默认情况下，此属性为 <code>true</code> （启用操作）。

source: By default, this property is <code>true</code> (actions are visible).
zh_cn: 默认情况下，此属性为 <code>true</code> （动作可见）。

source: By default, this property is <code>true</code>.
zh_cn: 默认情况下，此属性为 <code>true</code> 。

source: By default, this property is disabled, i.e., group boxes are not flat unless explicitly specified.
zh_cn: 默认情况下,该属性是禁用的,即除非明确指定,否则组框不是平的。

source: By default, this property is disabled, so group boxes are not flat unless explicitly specified.
zh_cn: 默认情况下,此属性是禁用的,因此除非明确指定,否则组框不会是平的。

source: By default, this property is disabled.
zh_cn: 默认情况下,此属性为禁用。

source: By default, this property is enabled.
zh_cn: 默认情况下,此属性为启用。

source: By default, this property is false.
zh_cn: 默认情况下,该属性为false。

source: By default, this property is false. Set it to true when you want to pause the animation.
zh_cn: 默认情况下,该属性为false。当你想暂停动画时,将其设置为 "true"。

source: By default, this property is false. This property must be set to the desired value before opening the dialog. Setting this property to true implies that <a href="qml-qtquick-dialogs-filedialog#selectExisting-prop">selectExisting</a> must be true.
zh_cn: 默认情况下，此属性为false。打开对话框之前，必须将此属性设置为所需的值。将此属性设置为true意味着<a href="qml-qtquick-dialogs-filedialog#selectExisting-prop">selectExisting</a>必须为true。

source: By default, this property is false. This property must be set to the desired value before opening the dialog. Setting this property to true implies that <a href="qml-qtquick-dialogs-filedialog#selectMultiple-prop">selectMultiple</a> must be false and <a href="qml-qtquick-dialogs-filedialog#selectExisting-prop">selectExisting</a> must be true.
zh_cn: 默认情况下，此属性为false。打开对话框之前，必须将此属性设置为所需的值。将此属性设置为true意味着<a href="qml-qtquick-dialogs-filedialog#selectMultiple-prop">selectMultiple</a>必须为false，<a href="qml-qtquick-dialogs-filedialog#selectExisting-prop">selectExisting</a>必须为true。

source: By default, this property is not set, and therefore <a href="qml-qtquick-item#implicitHeight-prop">implicitHeight</a> will be used instead. To reset this property to its default value, set it to <code>undefined</code>.
zh_cn: 默认情况下，未设置此属性，因此将使用<a href="qml-qtquick-item#implicitHeight-prop">implicitHeight</a>。要将此属性重置为其默认值，请将其设置为 <code>undefined</code> 。

source: By default, this property is not set, and therefore <a href="qml-qtquick-item#implicitWidth-prop">implicitWidth</a> will be used instead. To reset this property to its default value, set it to <code>undefined</code>.
zh_cn: 默认情况下，未设置此属性，因此将使用<a href="qml-qtquick-item#implicitWidth-prop">implicitWidth</a>。要将此属性重置为其默认值，请将其设置为 <code>undefined</code> 。

source: By default, this property is set to <a href="qabstractanimation#Direction-enum">Forward</a>.
zh_cn: 默认情况下，此属性设置为<a href="qabstractanimation#Direction-enum">Forward</a>。

source: By default, this property is set to <a href="qbluetoothdevicediscoveryagent#InquiryType-enum">GeneralUnlimitedInquiry</a>.
zh_cn: 默认情况下，此属性设置为<a href="qbluetoothdevicediscoveryagent#InquiryType-enum">GeneralUnlimitedInquiry</a>。

source: By default, this property is set to <a href="qdoublevalidator#Notation-enum">ScientificNotation</a>.
zh_cn: 默认情况下，此属性设置为<a href="qdoublevalidator#Notation-enum">ScientificNotation</a>。

source: By default, this property is set to <a href="qfiledialog#AcceptMode-enum">AcceptOpen</a>.
zh_cn: 默认情况下，此属性设置为<a href="qfiledialog#AcceptMode-enum">AcceptOpen</a>。

source: By default, this property is set to <a href="qfiledialog#FileMode-enum">AnyFile</a>.
zh_cn: 默认情况下，此属性设置为<a href="qfiledialog#FileMode-enum">AnyFile</a>。

source: By default, this property is set to <a href="qinputdevice#DeviceType-enum">PointerDevice.AllDevices</a>. If you set it to an OR combination of device types, it will ignore events from non-matching devices.
zh_cn: 默认情况下，此属性设置为<a href="qinputdevice#DeviceType-enum">PointerDevice.AllDevices</a>。如果将其设置为设备类型的OR组合，它将忽略来自不匹配设备的事件。

source: By default, this property is set to <a href="qlineedit#EchoMode-enum">Normal</a>.
zh_cn: 默认情况下，此属性设置为<a href="qlineedit#EchoMode-enum">Normal</a>。

source: By default, this property is set to <a href="qlistview#Flow-enum">TopToBottom</a>.
zh_cn: 默认情况下，此属性设置为<a href="qlistview#Flow-enum">TopToBottom</a>。

source: By default, this property is set to <a href="qlistview#Movement-enum">Static</a>.
zh_cn: 默认情况下，此属性设置为<a href="qlistview#Movement-enum">Static</a>。

source: By default, this property is set to <a href="qlistview#ResizeMode-enum">Fixed</a>.
zh_cn: 默认情况下，此属性设置为<a href="qlistview#ResizeMode-enum">Fixed</a>。

source: By default, this property is set to <a href="qml-qtquick-mouseevent#button-prop">Qt.LeftButton</a>. It can be set to an OR combination of mouse buttons, and will ignore events from other buttons.
zh_cn: 默认情况下，此属性设置为<a href="qml-qtquick-mouseevent#button-prop">Qt.LeftButton</a>。可以将其设置为鼠标按钮的OR组合，并且将忽略其他按钮的事件。

source: By default, this property is set to <a href="qml-qtquick-pointerdevice#pointerType-prop">PointerDevice.AllPointerTypes</a>. If you set it to an OR combination of device types, it will ignore events from non-matching events.
zh_cn: 默认情况下，此属性设置为<a href="qml-qtquick-pointerdevice#pointerType-prop">PointerDevice.AllPointerTypes</a>。如果将其设置为设备类型的OR组合，它将忽略不匹配事件中的事件。

source: By default, this property is set to <a href="qml-qtquick-pointerdevice#type-prop">PointerDevice.AllDevices</a>. If you set it to an OR combination of device types, it will ignore events from non-matching devices.
zh_cn: 默认情况下，此属性设置为<a href="qml-qtquick-pointerdevice#type-prop">PointerDevice.AllDevices</a>。如果将其设置为设备类型的OR组合，它将忽略来自不匹配设备的事件。

source: By default, this property is set to <a href="qmovie#CacheMode-enum">CacheNone</a>.
zh_cn: 默认情况下，此属性设置为<a href="qmovie#CacheMode-enum">CacheNone</a>。

source: By default, this property is set to <a href="qpointingdevice#PointerType-enum">PointerDevice.AllPointerTypes</a>. If you set it to an OR combination of device types, it will ignore events from non-matching events.
zh_cn: 默认情况下，此属性设置为<a href="qpointingdevice#PointerType-enum">PointerDevice.AllPointerTypes</a>。如果将其设置为设备类型的OR组合，它将忽略不匹配事件中的事件。

source: By default, this property is set to <a href="qt#ArrowType-enum">Qt::NoArrow</a>.
zh_cn: 默认情况下，此属性设置为<a href="qt#ArrowType-enum">Qt :: NoArrow</a>。

source: By default, this property is set to <a href="qt#LayoutDirection-enum">Qt::LeftToRight</a>.
zh_cn: 默认情况下，此属性设置为<a href="qt#LayoutDirection-enum">Qt :: LeftToRight</a>。

source: By default, this property is set to <a href="qt#ShortcutContext-enum">Qt::WindowShortcut</a>.
zh_cn: 默认情况下，此属性设置为<a href="qt#ShortcutContext-enum">Qt :: WindowShortcut</a>。

source: By default, this property is set to <a href="qtabwidget#TabPosition-enum">North</a>.
zh_cn: 默认情况下，此属性设置为<a href="qtabwidget#TabPosition-enum">North</a>。

source: By default, this property is set to <a href="qtextoption#WrapMode-enum">QTextOption::WrapAtWordBoundaryOrAnywhere</a>.
zh_cn: 默认情况下，此属性设置为<a href="qtextoption#WrapMode-enum">QTextOption :: WrapAtWordBoundaryOrAnywhere</a>。

source: By default, this property is set to <a href="qtimeline#CurveShape-enum">EaseInOutCurve</a>.
zh_cn: 默认情况下，此属性设置为<a href="qtimeline#CurveShape-enum">EaseInOutCurve</a>。

source: By default, this property is set to <a href="qtimeline#Direction-enum">Forward</a>.
zh_cn: 默认情况下，此属性设置为<a href="qtimeline#Direction-enum">Forward</a>。

source: By default, this property is set to <a href="qtoolbutton#ToolButtonPopupMode-enum">DelayedPopup</a>.
zh_cn: 默认情况下，此属性设置为<a href="qtoolbutton#ToolButtonPopupMode-enum">DelayedPopup</a>。

source: By default, this property is set to <code>Texture.Repeat</code>.
zh_cn: 默认情况下，此属性设置为 <code>Texture.Repeat</code> 。

source: By default, this property is set to <code>false</code>.
zh_cn: 默认情况下，此属性设置为 <code>false</code> 。

source: By default, this property is set to <code>true</code>.
zh_cn: 默认情况下，此属性设置为 <code>true</code> 。

source: By default, this property is set to a combination of <a href="qdockwidget#DockWidgetFeature-enum">DockWidgetClosable</a>, <a href="qdockwidget#DockWidgetFeature-enum">DockWidgetMovable</a> and <a href="qdockwidget#DockWidgetFeature-enum">DockWidgetFloatable</a>.
zh_cn: 默认情况下，此属性设置为<a href="qdockwidget#DockWidgetFeature-enum">DockWidgetClosable</a>，<a href="qdockwidget#DockWidgetFeature-enum">DockWidgetMovable</a>和<a href="qdockwidget#DockWidgetFeature-enum">DockWidgetFloatable</a>的组合。

source: By default, this property is set to false.
zh_cn: 默认情况下,该属性被设置为false。

source: By default, this property is set to the earliest minimum date (1 January, 1 AD).
zh_cn: 默认情况下,该属性设置为最早的最小日期(公元1月1日)。

source: By default, this property is set to the latest maximum date (25 October, 275759 AD).
zh_cn: 默认情况下,该属性被设置为最新的最大日期(公元275759年10月25日)。

source: By default, this property is set to the start of 2000 CE. It can only be set to a valid <a href="qdatetime">QDateTime</a> value. If any operation causes this property to have an invalid date-time as value, it is reset to the value of the <a href="qdatetimeedit#minimumDateTime-prop">minimumDateTime</a> property.
zh_cn: 默认情况下，此属性设置为2000 CE的开始。只能将其设置为有效的<a href="qdatetime">QDateTime</a>值。如果任何操作导致此属性的日期时间无效，则将其重置为<a href="qdatetimeedit#minimumDateTime-prop">minimumDateTime</a>属性的值。

source: By default, this property is set to true.
zh_cn: 默认情况下,该属性被设置为 "true"。

source: By default, this property is set. It may be cleared if the main window contains widgets which are slow at resizing or repainting themselves.
zh_cn: 默认情况下,此属性已被设置。如果主窗口包含的小部件调整大小或重新绘制速度较慢,则可清除该属性。

source: By default, this property is true, meaning that the animation will start playing immediately.
zh_cn: 默认情况下,该属性为true,意味着动画将立即开始播放。

source: By default, this property is true.
zh_cn: 默认情况下,该属性为true。
