Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/qt/qt.*.123.xlf
Languages: es, ko, zh_cn

source: Every item of data that can be accessed via a model has an associated model index. You can obtain this model index using the <a href="qabstractitemmodel#index">index</a>() function. Each index may have a <a href="qabstractitemmodel#sibling">sibling</a>() index; child items have a <a href="qabstractitemmodel#parent">parent</a>() index.
es: Cada elemento de datos al que se puede acceder a trav&eacute;s de un modelo tiene un &iacute;ndice de modelo asociado. Puede obtener este &iacute;ndice de modelo utilizando la funci&oacute;n <a href="qabstractitemmodel#index">index</a> (). Cada &iacute;ndice puede tener un &iacute;ndice <a href="qabstractitemmodel#sibling">hermano</a> (); los elementos secundarios tienen un &iacute;ndice <a href="qabstractitemmodel#parent">parent</a> ().
ko: 모델을 통해 액세스 할 수있는 모든 데이터 항목에는 연관된 모델 색인이 있습니다. <a href="qabstractitemmodel#index">index</a> () 함수를 사용하여이 모델 인덱스를 얻을 수 있습니다 . 각 색인에는 <a href="qabstractitemmodel#sibling">형제</a> () 색인 이있을 수 있습니다 . 하위 항목에는 <a href="qabstractitemmodel#parent">상위</a> () 색인이 있습니다.

source: Every logical particle is a member of a particle group, and each group is identified by a name. If no other group has been specified, a logical particle belongs to the group with the name "" (the empty string), which acts the same as any other group. Groups are used for two purposes, for controlling particles and because they can have stochastic state transitions.
es: Cada partícula lógica es un miembro de un grupo de partículas,y cada grupo se identifica con un nombre.Si no se ha especificado ningún otro grupo,una partícula lógica pertenece al grupo con el nombre "" (la cadena vacía),que actúa igual que cualquier otro grupo.Los grupos se utilizan con dos fines,para controlar las partículas y porque pueden tener transiciones de estado estocásticas.
ko: 모든 논리 입자는 입자 그룹의 구성원이며 각 그룹은 이름으로 식별됩니다. 다른 그룹이 지정되지 않은 경우 논리 입자는 이름이 ""(빈 문자열) 인 그룹에 속하며 다른 그룹과 동일하게 작동합니다. 그룹은 입자를 제어하고 확률 적 상태 전이를 가질 수 있기 때문에 두 가지 목적으로 사용됩니다.

source: Every object has an <a href="qobject#objectName-prop">objectName</a>() and its class name can be found via the corresponding <a href="qobject#metaObject">metaObject</a>() (see <a href="qmetaobject#className">QMetaObject::className</a>()). You can determine whether the object's class inherits another class in the <a href="qobject">QObject</a> inheritance hierarchy by using the <a href="qobject#inherits">inherits</a>() function.
es: Cada objeto tiene un <a href="qobject#objectName-prop">objectName</a> () y su nombre de clase se puede encontrar a trav&eacute;s del <a href="qobject#metaObject">metaObject</a> () correspondiente (ver <a href="qmetaobject#className">QMetaObject :: className</a> ()). Puede determinar si la clase del objeto hereda otra clase en la jerarqu&iacute;a de herencia de <a href="qobject">QObject</a> utilizando la funci&oacute;n <a href="qobject#inherits">hereits</a> ().
ko: 모든 객체에는 <a href="qobject#objectName-prop">objectName</a> ()이 있고 해당 클래스 이름은 해당 <a href="qobject#metaObject">metaObject</a> () 를 통해 찾을 수 있습니다 ( <a href="qmetaobject#className">QMetaObject :: className</a> () 참조). 당신은 객체의 클래스가 다른 클래스를 상속 여부를 결정할 수 <a href="qobject">있는 QObject의</a> 사용하여 상속 계층 구조를 <a href="qobject#inherits">상속</a> () 함수를.

source: Every object has an <a href="qobject#objectName-prop">objectName</a>() and its class name can be found via the corresponding <a href="qobject#metaObject">metaObject</a>() (see <a href="qmetaobject#className">QMetaObject::className</a>()). You can determine whether the object's class inherits another class in the QObject inheritance hierarchy by using the <a href="qobject#inherits">inherits</a>() function.
ko: 모든 객체에는 <a href="qobject#objectName-prop">objectName</a> ()이 있으며 해당하는 <a href="qobject#metaObject">metaObject</a> () 를 통해 클래스 이름을 찾을 수 있습니다 ( <a href="qmetaobject#className">QMetaObject :: className</a> () 참조). 당신은 객체의 클래스가 사용하여 QObject를 상속 계층 구조의 다른 클래스를 상속 여부를 결정할 수 있습니다 <a href="qobject#inherits">상속</a> () 함수를.

source: Every registered scheme configuration applies globally to all profiles.
es: Cada configuración de esquema registrada se aplica globalmente a todos los perfiles.
ko: 등록 된 모든 체계 구성은 모든 프로파일에 전체적으로 적용됩니다.

source: Every second, <a href="qtimer">QTimer</a> will call the <a href="qwidget#update">QWidget::update</a>() slot to refresh the clock's display.
es: Cada segundo, <a href="qtimer">QTimer</a> llamar&aacute; a la <a href="qwidget#update">ranura QWidget :: update</a> () para actualizar la pantalla del reloj.
ko: <a href="qtimer">QTimer</a> 는 1 초마다 <a href="qwidget#update">QWidget :: update</a> () 슬롯을 호출 하여 시계 표시를 새로 고 칩니다 .

source: Every setOverrideCursor() must eventually be followed by a corresponding <a href="qguiapplication#restoreOverrideCursor">restoreOverrideCursor</a>(), otherwise the stack will never be emptied.
es: Cada setOverrideCursor () debe ir seguido finalmente por un <a href="qguiapplication#restoreOverrideCursor">restoreOverrideCursor</a> () correspondiente , de lo contrario, la pila nunca se vaciar&aacute;.
ko: 모든 setOverrideCursor () 뒤에는 해당 <a href="qguiapplication#restoreOverrideCursor">restoreOverrideCursor</a> () 가 와야합니다. 그렇지 않으면 스택이 비워지지 않습니다.

source: Every tickmark that should be drawn must be defined within this component, so it is common to use a <a href="qml-qtquick-repeater">Repeater</a>, for example.
es: Cada marca de verificaci&oacute;n que se debe dibujar debe estar definida dentro de este componente, por lo que es com&uacute;n usar un <a href="qml-qtquick-repeater">repetidor</a> , por ejemplo.
ko: 그려야 할 모든 눈금은이 컴포넌트 내에 정의되어야하므로 예를 들어 <a href="qml-qtquick-repeater">Repeater</a> 를 사용하는 것이 일반적 입니다.

source: Every time the current index changes, each widget is updated with data from the model via the property specified when its mapping was made. If the user edits the contents of a widget, the changes are read using the same property and written back to the model. By default, each widget's <a href="qobject#Q_PROPERTY">user property</a> is used to transfer data between the model and the widget. Since Qt 4.3, an additional <a href="qdatawidgetmapper#addMapping">addMapping</a>() function enables a named property to be used instead of the default user property.
es: Cada vez que cambia el &iacute;ndice actual, cada widget se actualiza con datos del modelo a trav&eacute;s de la propiedad especificada cuando se realiz&oacute; su mapeo. Si el usuario edita el contenido de un widget, los cambios se leen utilizando la misma propiedad y se vuelven a escribir en el modelo. De forma predeterminada, la <a href="qobject#Q_PROPERTY">propiedad de usuario de</a> cada widget se utiliza para transferir datos entre el modelo y el widget. Desde Qt 4.3, una funci&oacute;n adicional <a href="qdatawidgetmapper#addMapping">addMapping</a> () permite utilizar una propiedad con nombre en lugar de la propiedad de usuario predeterminada.
ko: 현재 색인이 변경 될 때마다 각 위젯은 맵핑시 지정된 특성을 통해 모델의 데이터로 업데이트됩니다. 사용자가 위젯의 컨텐츠를 편집하면 동일한 특성을 사용하여 변경 사항을 읽고 모델에 다시 씁니다. 기본적으로 각 위젯의 <a href="qobject#Q_PROPERTY">사용자 속성</a> 은 모델과 위젯간에 데이터를 전송하는 데 사용됩니다. Qt 4.3부터 추가 <a href="qdatawidgetmapper#addMapping">addMapping</a> () 함수를 사용하면 기본 사용자 속성 대신 명명 된 속성을 사용할 수 있습니다.

source: Every time the source or effect properties are changed, the pixels in the cache must be updated. Memory consumption is increased, because an extra buffer of memory is required for storing the effect output.
es: Cada vez que se cambian las propiedades de la fuente o del efecto,los píxeles de la caché deben ser actualizados.El consumo de memoria se incrementa,porque se requiere un buffer extra de memoria para almacenar la salida del efecto.
ko: 소스 또는 효과 속성이 변경 될 때마다 캐시의 픽셀을 업데이트해야합니다. 이펙트 출력을 저장하기 위해 여분의 메모리 버퍼가 필요하기 때문에 메모리 소비가 증가합니다.

source: Every time the value changes <a href="qdoublespinbox">QDoubleSpinBox</a> emits two <a href="qdoublespinbox#valueChanged">valueChanged</a>() signals, one taking providing a double and the other a <a href="qstring">QString</a>. The <a href="qstring">QString</a> overload provides the value with both <a href="qdoublespinbox#prefix-prop">prefix</a>() and <a href="qdoublespinbox#suffix-prop">suffix</a>(). The current value can be fetched with <a href="qdoublespinbox#value-prop">value</a>() and set with <a href="qdoublespinbox#value-prop">setValue</a>().
es: Cada vez que el valor cambia, <a href="qdoublespinbox">QDoubleSpinBox</a> emite dos se&ntilde;ales <a href="qdoublespinbox#valueChanged">valueChanged</a> (), una que proporciona un doble y la otra un <a href="qstring">QString</a> . La sobrecarga de <a href="qstring">QString</a> proporciona el valor con <a href="qdoublespinbox#prefix-prop">prefijo</a> () y <a href="qdoublespinbox#suffix-prop">sufijo</a> (). El valor actual se puede obtener con <a href="qdoublespinbox#value-prop">value</a> () y establecer con <a href="qdoublespinbox#value-prop">setValue</a> ().
ko: 값이 변경 <a href="qdoublespinbox">될</a> 때마다 QDoubleSpinBox는 두 개의 <a href="qdoublespinbox#valueChanged">valueChanged</a> () 신호를 방출 합니다. 하나는 double을 제공하고 다른 하나는 <a href="qstring">QString</a> 을 제공합니다 . <a href="qstring">QString에</a> 과부하가 모두 값을 제공 <a href="qdoublespinbox#prefix-prop">프리픽스</a> () 및 <a href="qdoublespinbox#suffix-prop">서 픽스</a> (). 현재 값은 <a href="qdoublespinbox#value-prop">값</a> () 으로 가져오고 <a href="qdoublespinbox#value-prop">setValue</a> ()로 설정할 수 있습니다 .

source: Every time the value changes <a href="qspinbox">QSpinBox</a> emits two <a href="qspinbox#valueChanged">valueChanged</a>() signals, one providing an int and the other a <a href="qstring">QString</a>. The <a href="qstring">QString</a> overload provides the value with both <a href="qspinbox#prefix-prop">prefix</a>() and <a href="qspinbox#suffix-prop">suffix</a>(). The current value can be fetched with <a href="qspinbox#value-prop">value</a>() and set with <a href="qspinbox#value-prop">setValue</a>().
es: Cada vez que el valor cambia, <a href="qspinbox">QSpinBox</a> emite dos se&ntilde;ales <a href="qspinbox#valueChanged">valueChanged</a> (), una que proporciona un int y la otra un <a href="qstring">QString</a> . La sobrecarga de <a href="qstring">QString</a> proporciona el valor con <a href="qspinbox#prefix-prop">prefijo</a> () y <a href="qspinbox#suffix-prop">sufijo</a> (). El valor actual se puede obtener con <a href="qspinbox#value-prop">value</a> () y establecer con <a href="qspinbox#value-prop">setValue</a> ().
ko: 값이 변경 될 때마다 <a href="qspinbox">QSpinBox는</a> 두 개의 <a href="qspinbox#valueChanged">valueChanged</a> () 신호를 방출 합니다. 하나는 int를 제공하고 다른 하나는 <a href="qstring">QString을 제공</a> 합니다. <a href="qstring">QString에</a> 과부하가 모두 값을 제공 <a href="qspinbox#prefix-prop">프리픽스</a> () 및 <a href="qspinbox#suffix-prop">서 픽스</a> (). 현재 값은 <a href="qspinbox#value-prop">값</a> () 으로 가져오고 <a href="qspinbox#value-prop">setValue</a> ()로 설정할 수 있습니다 .

source: Every time the value changes QDoubleSpinBox emits <a href="qdoublespinbox#valueChanged">valueChanged</a>() and <a href="qdoublespinbox#textChanged">textChanged</a>() signals, the former providing a double and the latter a <a href="qstring">QString</a>. The <a href="qdoublespinbox#textChanged">textChanged</a>() signal provides the value with both <a href="qdoublespinbox#prefix-prop">prefix</a>() and <a href="qdoublespinbox#suffix-prop">suffix</a>(). The current value can be fetched with <a href="qdoublespinbox#value-prop">value</a>() and set with <a href="qdoublespinbox#value-prop">setValue</a>().
ko: 값이 변경 될 때마다 QDoubleSpinBox는 <a href="qdoublespinbox#valueChanged">valueChanged</a> () 및 <a href="qdoublespinbox#textChanged">textChanged</a> () 신호를 내 보냅니다. 전자는 double을 제공하고 후자는 <a href="qstring">QString을 제공</a> 합니다. <a href="qdoublespinbox#textChanged">의 TextChanged</a> () 신호가 모두 값을 제공 <a href="qdoublespinbox#prefix-prop">프리픽스</a> () 및 <a href="qdoublespinbox#suffix-prop">서 픽스</a> (). 현재 값은 <a href="qdoublespinbox#value-prop">값</a> () 으로 가져오고 <a href="qdoublespinbox#value-prop">setValue</a> ()로 설정할 수 있습니다 .

source: Every time the value changes QSpinBox emits <a href="qspinbox#valueChanged">valueChanged</a>() and <a href="qspinbox#textChanged">textChanged</a>() signals, the former providing a int and the latter a <a href="qstring">QString</a>. The <a href="qspinbox#textChanged">textChanged</a>() signal provides the value with both <a href="qspinbox#prefix-prop">prefix</a>() and <a href="qspinbox#suffix-prop">suffix</a>(). The current value can be fetched with <a href="qspinbox#value-prop">value</a>() and set with <a href="qspinbox#value-prop">setValue</a>().
ko: 값이 변경 될 때마다 QSpinBox는 <a href="qspinbox#valueChanged">valueChanged</a> () 및 <a href="qspinbox#textChanged">textChanged</a> () 신호를 내 보냅니다. 전자는 int를 제공하고 후자는 <a href="qstring">QString을 제공</a> 합니다. <a href="qspinbox#textChanged">의 TextChanged</a> () 신호가 모두 값을 제공 <a href="qspinbox#prefix-prop">프리픽스</a> () 및 <a href="qspinbox#suffix-prop">서 픽스</a> (). 현재 값은 <a href="qspinbox#value-prop">값</a> () 으로 가져오고 <a href="qspinbox#value-prop">setValue</a> ()로 설정할 수 있습니다 .

source: Every time you run the application using Qt Creator, an Android Application Package (APK) is created and deployed onto the target (device or emulator) you choose. With some minor changes to how the
es: Cada vez que ejecutas la aplicación con Qt Creator,se crea un paquete de aplicaciones Android (APK)y se despliega en el objetivo (dispositivo o emulador)que elijas.Con algunos pequeños cambios en la forma en que el
ko: Qt Creator를 사용하여 응용 프로그램을 실행할 때마다 Android 응용 프로그램 패키지 (APK)가 생성되어 선택한 대상 (장치 또는 에뮬레이터)에 배포됩니다. 방법에 약간의 변경으로

source: Every time you run the application using Qt Creator, an Android Application Package (APK) is created and deployed onto the target of your choice (device or emulator). With few minor changes to packaging settings, you can publish your application on Google Play. The following instructions guide you to create an <code>.apk</code> that can go live on Google Play:
ko: Qt Creator를 사용하여 애플리케이션을 실행할 때마다 Android 애플리케이션 패키지 (APK)가 생성되어 원하는 대상 (장치 또는 에뮬레이터)에 배포됩니다. 패키징 설정을 약간만 변경하면 Google Play에 애플리케이션을 게시 할 수 있습니다. 다음 지침 은 Google Play에 게시 할 수 있는 <code>.apk</code> 를 만드는 방법을 안내합니다 .

source: Every widget's constructor accepts one or two standard arguments:
es: El constructor de cada widget acepta uno o dos argumentos estándar:
ko: 모든 위젯의 생성자는 하나 또는 두 개의 표준 인수를 허용합니다.

source: Everything outside of this rectangle does not need to be painted.
es: Todo lo que está fuera de este rectángulo no necesita ser pintado.
ko: 이 사각형 외부의 모든 것을 칠할 필요는 없습니다.

source: Exact matching indicates whether the regular expression matches the entire subject string. For example, the classes yield on the subject string <code>"abc123"</code>:
es: La coincidencia exacta indica si la expresi&oacute;n regular coincide con toda la cadena de asunto. Por ejemplo, las clases dan como resultado la cadena de asunto <code>"abc123"</code> :
ko: 완전 일치는 정규식이 전체 주제 문자열과 일치하는지 여부를 나타냅니다. 예를 들어, 클래스는 제목 문자열 <code>"abc123"</code> 을 생성합니다 .

source: Exact matching is not reflected in <a href="qregularexpression">QRegularExpression</a>. If you want to be sure that the subject string matches the regular expression exactly, you can wrap the pattern between a couple of anchoring expressions. Simply putting the pattern between the <code>^</code> and the <code>$</code> anchors is enough in most cases:
es: La coincidencia exacta no se refleja en <a href="qregularexpression">QRegularExpression</a> . Si desea asegurarse de que la cadena de asunto coincida exactamente con la expresi&oacute;n regular, puede envolver el patr&oacute;n entre un par de expresiones de anclaje. En la mayor&iacute;a de los casos, basta con poner el patr&oacute;n entre los anclajes <code>^</code> y <code>$</code> :
ko: 정확한 일치는 <a href="qregularexpression">QRegularExpression에</a> 반영되지 않습니다 . 제목 문자열이 정규식과 정확하게 일치하는지 확인하려면 몇 가지 앵커링 표현식 사이에서 패턴을 랩핑 할 수 있습니다. <code>^</code> 와 <code>$</code> 앵커 사이에 패턴을 두는 것만으로 도 충분합니다.

source: Exact matching is not reflected in QRegularExpression. If you want to be sure that the subject string matches the regular expression exactly, you can wrap the pattern using the <a href="qregularexpression#anchoredPattern">anchoredPattern</a>() function:
ko: 정확한 일치는 QRegularExpression에 반영되지 않습니다. 제목 문자열이 정규 표현식과 정확히 일치하는지 확인하려면 <a href="qregularexpression#anchoredPattern">anchoredPattern</a> () 함수를 사용하여 패턴을 래핑 할 수 있습니다 .

source: Exactly as for FramebufferObject above, except once the painting is done, prior to rendering the painted image is flipped about the x-axis so that the top-most pixels are now at the bottom. Since this is done with the OpenGL texture coordinates it is a much faster way to achieve this effect than using a painter transform.
es: Exactamente igual que para el Objeto Framebuffer de arriba,excepto que una vez que la pintura está hecha,antes de renderizar la imagen pintada se voltea sobre el eje x para que los píxeles de arriba estén ahora en la parte inferior.Como esto se hace con las coordenadas de textura de OpenGL es una forma mucho más rápida de lograr este efecto que usando una transformación de pintor.
ko: 페인팅이 완료된 것을 제외하고는 위의 FramebufferObject와 정확히 동일하게, 페인팅 된 이미지를 렌더링하기 전에 x 축을 중심으로 뒤집어 최상위 픽셀이 이제 아래쪽에 오게합니다. 이 작업은 OpenGL 텍스처 좌표로 수행되므로 painter 변환을 사용하는 것보다이 효과를 얻는 것이 훨씬 빠릅니다.

source: Exactly one action can be checked at any one time. This is the default policy.
ko: 한 번에 정확히 하나의 작업을 확인할 수 있습니다. 이것이 기본 정책입니다.

source: Example (from the <a href="https://doc.qt.io/qt-5.13/qtwidgets-mainwindows-menus-example.html#">Menus</a> example):
es: Ejemplo (del ejemplo de <a href="https://doc.qt.io/qt-5.13/qtwidgets-mainwindows-menus-example.html#">Menus</a> ):
ko: 예 ( <a href="https://doc.qt.io/qt-5.13/qtwidgets-mainwindows-menus-example.html#">메뉴</a> 예) :

source: Example (from the <a href="https://doc.qt.io/qt-5.15/qtwidgets-mainwindows-menus-example.html">Menus</a> example):
ko: 예 ( <a href="https://doc.qt.io/qt-5.15/qtwidgets-mainwindows-menus-example.html">메뉴</a> 예에서) :

source: Example (read binary data from a stream):
es: Ejemplo (leer los datos binarios de una corriente):
ko: 예 (스트림에서 이진 데이터 읽기) :

source: Example (where <code>parentItem</code> is the id of an existing QML item):
es: Ejemplo (donde <code>parentItem</code> es la identificaci&oacute;n de un elemento QML existente):
ko: 예 (여기서 <code>parentItem</code> 은 기존 QML 항목의 ID 임) :

source: Example (write binary data to a stream):
es: Ejemplo (escribir datos binarios en una corriente):
ko: 예 (이진 데이터를 스트림에 쓰기) :

source: Example - Shaped Text Layout
es: Ejemplo-Diseño de texto con forma
ko: 예-모양의 텍스트 레이아웃

source: Example 1:
es: Ejemplo 1:
ko: 예 1 :

source: Example 1: Direct Connection Using a Static Source
es: Ejemplo 1:Conexión directa usando una fuente estática
ko: 예 1 : 정적 소스를 사용한 직접 연결

source: Example 1: Direct Connection using a Static Source
ko: 예 1 : 정적 소스를 사용한 직접 연결

source: Example 2:
es: Ejemplo 2:
ko: 예 2 :

source: Example 2: Direct Connection with a Dynamic Replica
es: Ejemplo 2:Conexión directa con una réplica dinámica
ko: 예 2 : 동적 복제본을 사용한 직접 연결

source: Example 3: Connections to Remote Nodes using a Registry
ko: 예 3 : 레지스트리를 사용하여 원격 노드에 연결

source: Example 3: Remote Nodes using a Registry
es: Ejemplo 3:Nodos remotos usando un registro
ko: 예 3 : 레지스트리를 사용하는 원격 노드

source: Example <a href="qml-qtgraphicaleffects-blend#foregroundSource-prop">foregroundSource</a>
es: Ejemplo <a href="qml-qtgraphicaleffects-blend#foregroundSource-prop">foregroundSource</a>
ko: <a href="qml-qtgraphicaleffects-blend#foregroundSource-prop">포 그라운드 소스</a> 예제

source: Example Apps
es: Aplicaciones de ejemplo
ko: 앱 예

source: Example Code
es: Ejemplo de código
ko: 예제 코드

source: Example Manifest Files
es: Ejemplos de archivos de manifiestos
ko: 매니페스트 파일 예

source: Example Project
es: Proyecto de ejemplo
ko: 프로젝트 예

source: Example Usage
es: Ejemplo de uso
ko: 사용법 예

source: Example Use Cases
es: Ejemplos de casos de uso
ko: 사용 사례 예

source: Example classes
es: Ejemplo de clases
ko: 예제 클래스

source: Example code on how to use <a href="qcategoryaxis">QCategoryAxis</a>:
es: C&oacute;digo de ejemplo sobre c&oacute;mo usar <a href="qcategoryaxis">QCategoryAxis</a> :
ko: <a href="qcategoryaxis">QCategoryAxis</a> 사용 방법에 대한 예제 코드 :

source: Example code on how to use QCategoryAxis:
ko: QCategoryAxis 사용 방법에 대한 예제 코드 :

source: Example for a one second (1000 millisecond) timer (from the <a href="https://doc.qt.io/qt-5.13/qtwidgets-widgets-analogclock-example.html">Analog Clock</a> example):
es: Ejemplo de un temporizador de un segundo (1000 milisegundos) (del ejemplo del <a href="https://doc.qt.io/qt-5.13/qtwidgets-widgets-analogclock-example.html">reloj anal&oacute;gico</a> ):
ko: 1 초 (1000 밀리 초) 타이머 예 ( <a href="https://doc.qt.io/qt-5.13/qtwidgets-widgets-analogclock-example.html">아날로그 시계</a> 예에서) :

source: Example for a one second (1000 millisecond) timer (from the <a href="https://doc.qt.io/qt-5.15/qtwidgets-widgets-analogclock-example.html">Analog Clock</a> example):
ko: 1 초 (1000 밀리 초) 타이머의 예 ( <a href="https://doc.qt.io/qt-5.15/qtwidgets-widgets-analogclock-example.html">아날로그 시계</a> 예에서) :

source: Example for specializing (Qt &le; 5.4):
es: Ejemplo de especializaci&oacute;n (Qt &le; 5,4):
ko: 전문화 예 (Qt &le; 5.4) :

source: Example format strings (assumed that the <a href="qdatetime">QDateTime</a> is 21 May 2001 14:13:09.120):
es: Cadenas de formato de ejemplo (se supone que <a href="qdatetime">QDateTime</a> es el 21 de mayo de 2001 14: 13: 09.120):
ko: 형식 문자열 예 ( <a href="qdatetime">QDateTime</a> 이 2001 년 5 월 21 일 14 : 13 : 09.120이라고 가정) :

source: Example format strings (assuming that the <a href="qdate">QDate</a> is the 20 July 1969):
es: Cadenas de formato de ejemplo (asumiendo que <a href="qdate">QDate</a> es el 20 de julio de 1969):
ko: 형식 문자열의 예 ( <a href="qdate">QDate</a> 가 1969 년 7 월 20 일 이라고 가정 ) :

source: Example format strings (assuming that the <a href="qtime">QTime</a> is 14:13:09.042 and the system locale is <code>en_US</code>)
es: Cadenas de formato de ejemplo (asumiendo que <a href="qtime">QTime</a> es 14: 13: 09.042 y la configuraci&oacute;n regional del sistema es <code>en_US</code> )
ko: 형식 문자열 예 ( <a href="qtime">QTime</a> 이 14 : 13 : 09.042이고 시스템 로케일이 <code>en_US</code> 라고 가정 )

source: Example format strings (assuming that the <a href="qtime">QTime</a> is 14:13:09.042)
es: Cadenas de formato de ejemplo (asumiendo que <a href="qtime">QTime</a> es 14: 13: 09.042)
ko: 형식 문자열 예 ( <a href="qtime">QTime</a> 이 14 : 13 : 09.042 라고 가정 )

source: Example format strings (assuming that the Date is the 20 July 1969):
es: Ejemplo de cadenas de formato (suponiendo que la fecha es el 20 de julio de 1969):
ko: 형식 문자열의 예 (날짜가 1969 년 7 월 20 일이라고 가정) :

source: Example format strings (assuming that the date is 2nd of July 1969):
es: Ejemplo de cadenas de formato (suponiendo que la fecha es el 2 de julio de 1969):
ko: 형식 문자열 예 (날짜가 1969 년 7 월 2 일이라고 가정) :

source: Example implementation of a simple button:
es: Ejemplo de aplicación de un simple botón:
ko: 간단한 버튼의 구현 예 :

source: Example implementation:
ko: 구현 예 :

source: Example model:
es: Modelo de ejemplo:
ko: 모델 예 :

source: Example of <a href="#QT_TRANSLATE_NOOP">QT_TRANSLATE_NOOP</a>():
es: Ejemplo de <a href="#QT_TRANSLATE_NOOP">QT_TRANSLATE_NOOP</a> ():
ko: <a href="#QT_TRANSLATE_NOOP">QT_TRANSLATE_NOOP</a> ()의 예 :

source: Example of <a href="#QT_TR_NOOP">QT_TR_NOOP</a>():
es: Ejemplo de <a href="#QT_TR_NOOP">QT_TR_NOOP</a> ():
ko: <a href="#QT_TR_NOOP">QT_TR_NOOP</a> ()의 예 :

source: Example of <a href="qtglobal#QT_TRANSLATE_NOOP">QT_TRANSLATE_NOOP</a>():
ko: <a href="qtglobal#QT_TRANSLATE_NOOP">QT_TRANSLATE_NOOP</a> ()의 예 :

source: Example of <a href="qtglobal#QT_TR_NOOP">QT_TR_NOOP</a>():
ko: <a href="qtglobal#QT_TR_NOOP">QT_TR_NOOP</a> ()의 예 :

source: Example of a "primitive" type:
es: Ejemplo de un tipo "primitivo":
ko: "원시"유형의 예 :

source: Example of a movable type:
es: Ejemplo de un tipo móvil:
ko: 움직일 수있는 유형의 예 :
