Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/qt/qt.*.123.xlf
Languages: es, ko, zh_cn

source: Calling <a href="qlocalserver#close">close</a>() makes <a href="qlocalserver">QLocalServer</a> stop listening for incoming connections.
zh_cn: 调用<a href="qlocalserver#close">close</a>（）使<a href="qlocalserver">QLocalServer</a>停止侦听传入的连接。

source: Calling <a href="qlocalserver#close">close</a>() makes QLocalServer stop listening for incoming connections.
zh_cn: 调用<a href="qlocalserver#close">close</a>（）使QLocalServer停止侦听传入的连接。

source: Calling <a href="qml-qtmultimedia-cameracapture#capture-method">capture()</a> while
zh_cn: 在同时调用<a href="qml-qtmultimedia-cameracapture#capture-method">capture（）</a>

source: Calling <a href="qml-qtquick-controls-stackview#push-method">push()</a> returns the item that was pushed onto the stack. Calling <a href="qml-qtquick-controls-stackview#pop-method">pop()</a> returns the item that was popped off the stack. When <a href="qml-qtquick-controls-stackview#pop-method">pop()</a> is called in an unwind operation, the top-most item (the first item that was popped, which will also be the one transitioning out) is returned.
zh_cn: 调用<a href="qml-qtquick-controls-stackview#push-method">push（）</a>返回被压入堆栈的项目。调用<a href="qml-qtquick-controls-stackview#pop-method">pop（）</a>返回从堆栈中弹出的项目。当<a href="qml-qtquick-controls-stackview#pop-method">pop（）方法</a>被调用开卷操作，最顶部的项目（这是弹出的第一个项目，这也将是一个转出）返回。

source: Calling <a href="qqmlengine#setObjectOwnership">setObjectOwnership</a>() overrides the default ownership heuristic used by QML.
zh_cn: 调用<a href="qqmlengine#setObjectOwnership">setObjectOwnership</a>（）会覆盖QML使用的默认所有权启发式方法。

source: Calling <a href="qtcpserver#close">close</a>() makes <a href="qtcpserver">QTcpServer</a> stop listening for incoming connections.
zh_cn: 调用<a href="qtcpserver#close">close</a>（）使<a href="qtcpserver">QTcpServer</a>停止侦听传入的连接。

source: Calling <a href="qtcpserver#close">close</a>() makes QTcpServer stop listening for incoming connections.
zh_cn: 调用<a href="qtcpserver#close">close</a>（）使QTcpServer停止侦听传入的连接。

source: Calling <a href="qtextstream#readLine">readLine()</a> is better if you do not know how much data is available.
zh_cn: 如果您不知道有多少数据可用，则调用<a href="qtextstream#readLine">readLine（）</a>更好。

source: Calling <a href="qurl#isRelative">isRelative</a>() will return whether or not the URL is relative. A relative URL has no <a href="qurl#scheme">scheme</a>. For example:
zh_cn: 调用<a href="qurl#isRelative">isRelative</a>（）将返回URL是否相对。相对URL没有<a href="qurl#scheme">方案</a>。例如：

source: Calling <a href="qwebsocketserver#close">close</a>() makes <a href="qwebsocketserver">QWebSocketServer</a> stop listening for incoming connections.
zh_cn: 调用<a href="qwebsocketserver#close">close</a>（）使<a href="qwebsocketserver">QWebSocketServer</a>停止侦听传入的连接。

source: Calling <a href="qwebsocketserver#close">close</a>() makes QWebSocketServer stop listening for incoming connections.
zh_cn: 调用<a href="qwebsocketserver#close">close</a>（）使QWebSocketServer停止侦听传入的连接。

source: Calling <a href="qwidget#update">QWidget::update</a>() will lead to sending a paint event
zh_cn: 调用<a href="qwidget#update">QWidget :: update</a>（）将导致发送绘制事件

source: Calling <code>a.setValue(12)</code> makes <code>a</code> emit a <code>valueChanged(12)</code> signal, which <code>b</code> will receive in its <code>setValue()</code> slot, i.e. <code>b.setValue(12)</code> is called. Then <code>b</code> emits the same <code>valueChanged()</code> signal, but since no slot has been connected to <code>b</code>'s <code>valueChanged()</code> signal, the signal is ignored.
zh_cn: 调用 <code>a.setValue(12)</code> ，使 <code>a</code> 发射 <code>valueChanged(12)</code> 信号，该信号 <code>b</code> 将获得其 <code>setValue()</code> 时隙，即 <code>b.setValue(12)</code> 被调用。然后 <code>b</code> 发出相同的 <code>valueChanged()</code> 信号，但是由于没有插槽连接到 <code>b</code> 的 <code>valueChanged()</code> 信号，因此该信号被忽略。

source: Calling <code>delete</code> on a <a href="qobject">QObject</a> from a thread other than the one that
zh_cn: 从一个不属于该线程的线程上调用<a href="qobject">QObject的</a> <code>delete</code>

source: Calling Function Through a Script Engine
zh_cn: 通过脚本引擎调用函数

source: Calling Performance is Not Everything
zh_cn: 呼叫性能不是万能的

source: Calling QQuickWindow::update() differs from <a href="qquickitem#update">QQuickItem::update</a>() in that it always triggers a repaint, regardless of changes in the underlying scene graph or not.
zh_cn: 调用QQuickWindow :: update（）方法不同于<a href="qquickitem#update">QQuickItem ::更新</a>（），它总是触发重绘，无论在基本场景图或没有变化。

source: Calling QVariant::toString() on an unsupported variant returns an empty string.
zh_cn: 在一个不支持的变量上调用QVariant::toString()返回一个空字符串。

source: Calling a Function Using the Native COM Interfaces
zh_cn: 使用本地COM接口调用函数

source: Calling a function modifies an object passed by reference is done like this:
zh_cn: 调用函数修改引用传递的对象是这样做的。

source: Calling a lambda function is done like this:
zh_cn: 调用lambda函数的方法是这样的。

source: Calling a non-const member function is done like this:
zh_cn: 调用一个非const成员函数的方法是这样的。

source: Calling call() can cause an exception to occur in the script engine; in that case, call() returns the value that was thrown (typically an <code>Error</code> object). You can call <a href="qjsvalue#isError">isError</a>() on the return value to determine whether an exception occurred.
zh_cn: 调用call（）可能导致脚本引擎中发生异常。在这种情况下，call（）返回所抛出的值（通常是一个 <code>Error</code> 对象）。您可以在返回值上调用<a href="qjsvalue#isError">isError</a>（）以确定是否发生异常。

source: Calling cd("..") is equivalent to calling <a href="qdir#cdUp">cdUp</a>().
zh_cn: 调用cd（&ldquo; ..&rdquo;）等效于调用<a href="qdir#cdUp">cdUp</a>（）。

source: Calling drawTiledPixmap() is similar to calling <a href="qpainter#drawPixmap">drawPixmap</a>() several times to fill (tile) an area with a pixmap, but is potentially much more efficient depending on the underlying window system.
zh_cn: 调用drawTiledPixmap（）类似于多次调用<a href="qpainter#drawPixmap">drawPixmap</a>（）以用像素图填充（平铺）区域，但根据基础窗口系统，其效率可能更高。

source: Calling newPage() on an inactive <a href="qprinter">QPrinter</a> object will always fail.
zh_cn: 在不活动的<a href="qprinter">QPrinter</a>对象上调用newPage（）总是会失败。

source: Calling normalize() on an element converts all its children into a standard form. This means that adjacent <a href="qdomtext">QDomText</a> objects will be merged into a single text object (<a href="qdomcdatasection">QDomCDATASection</a> nodes are not merged).
zh_cn: 在元素上调用normalize（）会将其所有子元素转换为标准形式。这意味着相邻的<a href="qdomtext">QDomText</a>对象将合并为单个文本对象（<a href="qdomcdatasection">QDomCDATASection</a>节点未合并）。

source: Calling parse() instead of <a href="qcommandlineparser#process">process</a>() can also be useful in order to ignore unknown options temporarily, because more option definitions will be provided later on (depending on one of the arguments), before calling <a href="qcommandlineparser#process">process</a>().
zh_cn: 为了暂时忽略未知选项，调用parse（）而不是<a href="qcommandlineparser#process">process</a>（）也很有用，因为稍后将在调用<a href="qcommandlineparser#process">process</a>（）之前（取决于参数之一）提供更多选项定义。

source: Calling qputenv with an empty value removes the environment variable on Windows, and makes it set (but empty) on Unix. Prefer using <a href="qtglobal#qunsetenv">qunsetenv</a>() for fully portable behavior.
zh_cn: 用空值调用qputenv会删除Windows上的环境变量，并使其在Unix上设置（但为空）。最好使用<a href="qtglobal#qunsetenv">qunsetenv</a>（）来实现完全可移植的行为。

source: Calling resize() resizes the widget to a
zh_cn: 调用resize()可将小组件的大小调整为一个

source: Calling resolved() with ".." returns a <a href="qurl">QUrl</a> whose directory is one level higher than the original. Similarly, calling resolved() with "../.." removes two levels from the path. If
zh_cn: 用&ldquo; ..&rdquo;调用<a href="qurl">resolve</a>（）返回一个QUrl，其目录比原始目录高一级。同样，用&ldquo; ../ ..&rdquo;调用resolve（）会从路径中删除两个级别。如果

source: Calling setError() does not emit the <a href="qnetworkreply#errorOccurred">errorOccurred</a>(<a href="qnetworkreply#NetworkError-enum">QNetworkReply::NetworkError</a>) signal.
zh_cn: 调用setError（）不会发出<a href="qnetworkreply#errorOccurred">errorOccurred</a>（<a href="qnetworkreply#NetworkError-enum">QNetworkReply :: </a>NetworkError）信号。

source: Calling setError() does not emit the error(<a href="qnetworkreply#NetworkError-enum">QNetworkReply::NetworkError</a>) signal.
zh_cn: 调用setError（）不会发出错误（<a href="qnetworkreply#NetworkError-enum">QNetworkReply :: NetworkError</a>）信号。

source: Calling setMimeTypeFilters overrides any previously set name filters, and changes the return value of <a href="qfiledialog#nameFilters">nameFilters</a>().
zh_cn: 调用setMimeTypeFilters会覆盖以前设置的所有名称过滤器，并更改<a href="qfiledialog#nameFilters">nameFilters</a>（）的返回值。

source: Calling setStandardInputFile() after the process has started has no effect.
zh_cn: 在进程启动后调用setStandardInputFile()没有效果。

source: Calling setStandardOutputFile() after the process has started has no effect.
zh_cn: 在进程启动后调用setStandardOutputFile()没有效果。

source: Calling setVisible(false) or <a href="qwidget#hide">hide</a>() hides a widget explicitly. An explicitly hidden widget will never become visible, even if all its ancestors become visible, unless you show it.
zh_cn: 调用setVisible（false）或<a href="qwidget#hide">hide</a>（）会显式隐藏小部件。除非您显示它，否则即使它的所有祖先都可见，显式隐藏的窗口小部件也将永远不可见。

source: Calling setVisible(true) or <a href="qwidget#show">show</a>() sets the widget to visible status if all its parent widgets up to the window are visible. If an ancestor is not visible, the widget won't become visible until all its ancestors are shown. If its size or position has changed, Qt guarantees that a widget gets move and resize events just before it is shown. If the widget has not been resized yet, Qt will adjust the widget's size to a useful default using <a href="qwidget#adjustSize">adjustSize</a>().
zh_cn: 如果窗口的所有父窗口小部件都可见，则调用setVisible（true）或<a href="qwidget#show">show</a>（）会将窗口小部件设置为可见状态。如果祖先不可见，则在显示其所有祖先之前，该窗口小部件将不可见。如果其大小或位置已更改，则Qt保证窗口小部件在显示之前就获得移动和调整大小的事件。如果尚未调整窗口小部件的大小，Qt将使用<a href="qwidget#adjustSize">adjustSize</a>（）将窗口小部件的大小调整为有用的默认值。

source: Calling the <a href="qfontinfo">QFontInfo</a> constructor with a <a href="qfont">QFont</a> creates a font info object for a screen-compatible font, i.e. the font cannot be a printer font. If the font is changed later, the font info object is
zh_cn: 用<a href="qfont">QFont</a>调用<a href="qfontinfo">QFontInfo</a>构造函数会创建与屏幕兼容的字体的字体信息对象，即该字体不能是打印机字体。如果以后更改字体，则字体信息对象为

source: Calling the <a href="qfontmetrics">QFontMetrics</a> constructor with a <a href="qfont">QFont</a> creates a font metrics object for a screen-compatible font, i.e. the font cannot be a printer font. If the font is changed later, the font metrics object is
zh_cn: 用<a href="qfont">QFont</a>调用<a href="qfontmetrics">QFontMetrics</a>构造函数会为屏幕兼容字体创建字体度量对象，即该字体不能为打印机字体。如果以后更改字体，则字体指标对象为

source: Calling the QFontInfo constructor with a <a href="gui-changes-qt6#qfont">QFont</a> creates a font info object for a screen-compatible font, i.e. the font cannot be a printer font. If the font is changed later, the font info object is
zh_cn: 用<a href="gui-changes-qt6#qfont">QFont</a>调用QFontInfo构造函数会创建与屏幕兼容的字体的字体信息对象，即该字体不能为打印机字体。如果以后更改字体，则字体信息对象为

source: Calling the QFontInfo constructor with a <a href="qfont">QFont</a> creates a font info object for a screen-compatible font, i.e. the font cannot be a printer font. If the font is changed later, the font info object is
zh_cn: 用<a href="qfont">QFont</a>调用QFontInfo构造函数会创建与屏幕兼容的字体的字体信息对象，即该字体不能为打印机字体。如果以后更改字体，则字体信息对象为

source: Calling the QFontMetrics constructor with a <a href="gui-changes-qt6#qfont">QFont</a> creates a font metrics object for a screen-compatible font, i.e. the font cannot be a printer font. If the font is changed later, the font metrics object is
zh_cn: 用<a href="gui-changes-qt6#qfont">QFont</a>调用QFontMetrics构造函数会为与屏幕兼容的字体创建字体度量对象，即该字体不能为打印机字体。如果以后更改字体，则字体指标对象为

source: Calling the QFontMetrics constructor with a <a href="qfont">QFont</a> creates a font metrics object for a screen-compatible font, i.e. the font cannot be a printer font. If the font is changed later, the font metrics object is
zh_cn: 用<a href="qfont">QFont</a>调用QFontMetrics构造函数会为与屏幕兼容的字体创建字体度量对象，即该字体不能为打印机字体。如果以后更改字体，则字体指标对象为

source: Calling these functions from the main thread (the thread that calls <a href="qapplication#exec">QApplication::exec</a>()) may cause your user interface to freeze.
zh_cn: 从主线程（调用<a href="qapplication#exec">QApplication :: exec</a>（）的线程）调用这些函数可能会导致用户界面冻结。

source: Calling these functions from the main, GUI thread, may cause your user interface to freeze. Example:
zh_cn: 从主线程、GUI线程调用这些函数,可能会导致用户界面冻结。例子:

source: Calling this function after the end of file has been reached, but without available data will cause false to be returned whether the previous input was well-formed or not.
zh_cn: 在达到文件结束后,但没有可用数据的情况下调用此函数,无论之前的输入是否成形,都会导致返回false。

source: Calling this function again before the button is released resets the release timer.
zh_cn: 在按钮被释放前再次调用此功能会重置释放计时器。

source: Calling this function and <a href="qquickwindow#beginExternalCommands">beginExternalCommands</a>() is not necessary within the <a href="qsgrendernode#render">render()</a> implementation of a <a href="qsgrendernode">QSGRenderNode</a> because the scene graph performs the necessary steps implicitly for render nodes.
zh_cn: 调用此函数和<a href="qquickwindow#beginExternalCommands">beginExternalCommands</a>（）是没有必要的范围内<a href="qsgrendernode#render">渲染（）</a>实施的<a href="qsgrendernode">QSGRenderNode</a>因为场景图执行必要的步骤隐含的渲染节点。

source: Calling this function and <a href="qquickwindow#endExternalCommands">endExternalCommands</a>() is not necessary within the <a href="qsgrendernode#render">render()</a> implementation of a <a href="qsgrendernode">QSGRenderNode</a> because the scene graph performs the necessary steps implicitly for render nodes.
zh_cn: 调用此函数和<a href="qquickwindow#endExternalCommands">endExternalCommands</a>（）是没有必要的范围内<a href="qsgrendernode#render">渲染（）</a>实施的<a href="qsgrendernode">QSGRenderNode</a>因为场景图执行必要的步骤隐含的渲染节点。

source: Calling this function can cause an exception to occur in the script engine; in that case, the value that was thrown (typically an <code>Error</code> object) is returned. You can call <a href="qjsvalue#isError">isError</a>() on the return value to determine whether an exception occurred.
zh_cn: 调用此函数可能会导致脚本引擎中发生异常。在这种情况下，将返回抛出的值（通常是一个 <code>Error</code> 对象）。您可以在返回值上调用<a href="qjsvalue#isError">isError</a>（）以确定是否发生异常。

source: Calling this function causes the item to take the focus of the input
zh_cn: 调用该函数会使项目成为输入的焦点。

source: Calling this function if the server is already running (or for an in-process server) does nothing and returns true.
zh_cn: 如果服务器已经在运行(或者对于一个进程中的服务器),调用这个函数不做任何事情,并返回true。

source: Calling this function if the server is not running (or for an in-process server) does nothing and returns true.
zh_cn: 如果服务器没有运行(或者对于一个进程中的服务器),调用这个函数什么也不做,并返回true。

source: Calling this function in order to scroll programmatically is an error, use the scroll bars instead (e.g. by calling <a href="qabstractslider#value-prop">QScrollBar::setValue</a>() directly).
zh_cn: 调用此函数以便以编程方式滚动是一个错误，请改用滚动条（例如，直接调用<a href="qabstractslider#value-prop">QScrollBar :: setValue</a>（））。

source: Calling this function is equivalent to calling <code>inherits("QWidget")</code>, except that it is much faster.
zh_cn: 调用此函数等效于调用 <code>inherits("QWidget")</code> ，除了它要快得多。

source: Calling this function is equivalent to calling <code>inherits("QWindow")</code>, except that it is much faster.
zh_cn: 调用此函数等效于调用 <code>inherits("QWindow")</code> ，除了它要快得多。

source: Calling this function is slow - you should store the result in a variable when parsing the command line.
zh_cn: 调用这个函数的速度很慢--你应该在解析命令行时将结果存储在一个变量中。

source: Calling this function is typically the initial step when processing <a href="qmodelindex">QModelIndex</a>-based signals from a view, such as <a href="qabstractitemview#activated">QAbstractItemView::activated</a>(). In your slot, you call itemFromIndex(), with the <a href="qmodelindex">QModelIndex</a> carried by the signal as argument, to obtain a pointer to the corresponding <a href="qstandarditem">QStandardItem</a>.
zh_cn: 通常，从视图处理基于<a href="qmodelindex">QModelIndex</a>的信号（例如<a href="qabstractitemview#activated">QAbstractItemView :: activated</a>（））时，调用此函数是第一步。在您的插槽中，以信号携带的<a href="qmodelindex">QModelIndex</a>作为参数调用itemFromIndex（），以获得指向相应<a href="qstandarditem">QStandardItem</a>的指针。

source: Calling this function makes the subwindow enter the shaded mode. When the subwindow is shaded, only the title bar is visible.
zh_cn: 调用此函数,可使子窗口进入阴影模式。当子窗口处于阴影模式时,只有标题栏是可见的。

source: Calling this function might result in the scene graph and the OpenGL context used for rendering being released to release graphics memory. If this happens, the <a href="qquickwindow#sceneGraphInvalidated">sceneGraphInvalidated</a>() signal will be called, allowing users to clean up their own graphics resources. The <a href="qquickwindow#setPersistentOpenGLContext">setPersistentOpenGLContext</a>() and <a href="qquickwindow#setPersistentSceneGraph">setPersistentSceneGraph</a>() functions can be used to prevent this from happening, if handling the cleanup is not feasible in the application, at the cost of higher memory usage.
zh_cn: 调用此函数可能会导致场景图和用于渲染的OpenGL上下文被释放以释放图形内存。如果发生这种情况，将<a href="qquickwindow#sceneGraphInvalidated">调用sceneGraphInvalidated</a>（）信号，使用户可以清理自己的图形资源。所述<a href="qquickwindow#setPersistentOpenGLContext">setPersistentOpenGLContext</a>（）和<a href="qquickwindow#setPersistentSceneGraph">setPersistentSceneGraph</a>（）函数可以用来防止这种情况的发生，如果处理的清理是不可行的在应用程序中，在较高的内存使用情况的成本。

source: Calling this function multiple times on the same lock from the same thread without unlocking first is not allowed, this function will
zh_cn: 在没有先解锁的情况下,从同一线程多次调用该函数对同一锁进行解锁是不允许的,该函数将导致

source: Calling this function multiple times on the same lock from the same thread without unlocking first is not allowed. This function will
zh_cn: 不允许在没有先解锁的情况下,从同一线程多次调用此函数。该函数将

source: Calling this function multiple times on the same mutex from the same thread is allowed if this mutex is a <a href="qmutex#RecursionMode-enum">recursive mutex</a>. If this mutex is a <a href="qmutex#RecursionMode-enum">non-recursive mutex</a>, this function will
zh_cn: 如果此互斥锁是<a href="qmutex#RecursionMode-enum">递归互斥锁，</a>则允许从同一线程在同一互斥锁上多次调用此函数。如果此互斥锁<a href="qmutex#RecursionMode-enum">是非递归互斥锁</a>，则此功能将

source: Calling this function multiple times on the same mutex from the same thread is allowed if this mutex is a <a href="qrecursivemutex">recursive mutex</a>. If this mutex is a <a href="qmutex">non-recursive mutex</a>, this function will
zh_cn: 如果此互斥锁是<a href="qrecursivemutex">递归互斥锁，</a>则允许从同一线程在同一互斥锁上多次调用此函数。如果此互斥锁<a href="qmutex">是非递归互斥锁</a>，则此功能将

source: Calling this function multiple times on the same mutex from the same thread is allowed.
zh_cn: 允许从同一线程多次调用同一互斥函数。

source: Calling this function multiple times on the same mutex from the same thread will cause a
zh_cn: 从同一个线程多次调用这个函数,会导致一个叫

source: Calling this function on <a href="qassociativeiterable#begin">QAssociativeIterable::begin</a>() leads to undefined results.
zh_cn: 在<a href="qassociativeiterable#begin">QAssociativeIterable :: begin</a>（）上调用此函数将导致未定义的结果。

source: Calling this function on <a href="qassociativeiterable#end">QAssociativeIterable::end</a>() leads to undefined results.
zh_cn: 在<a href="qassociativeiterable#end">QAssociativeIterable :: end</a>（）上调用此函数将导致未定义的结果。

source: Calling this function on <a href="qcborarray#begin">QCborArray::begin</a>() leads to undefined results.
zh_cn: 在<a href="qcborarray#begin">QCborArray :: begin</a>（）上调用此函数将导致未定义的结果。

source: Calling this function on <a href="qcborarray#end">QCborArray::end</a>() leads to undefined results.
zh_cn: 在<a href="qcborarray#end">QCborArray :: end</a>（）上调用此函数将导致未定义的结果。

source: Calling this function on <a href="qcbormap#begin">QCborMap::begin</a>() leads to undefined results.
zh_cn: 在<a href="qcbormap#begin">QCborMap :: begin</a>（）上调用此函数将导致未定义的结果。

source: Calling this function on <a href="qcbormap#end">QCborMap::end</a>() leads to undefined results.
zh_cn: 在<a href="qcbormap#end">QCborMap :: end</a>（）上调用此函数将导致未定义的结果。

source: Calling this function on <a href="qfuture">QFuture</a>&lt;T&gt;::constBegin() leads to undefined results.
zh_cn: 在<a href="qfuture">QFuture</a> &lt;T&gt; :: constBegin（）上调用此函数将导致未定义的结果。

source: Calling this function on <a href="qfuture">QFuture</a>&lt;T&gt;::constEnd() leads to undefined results.
zh_cn: 在<a href="qfuture">QFuture</a> &lt;T&gt; :: constEnd（）上调用此函数将导致未定义的结果。

source: Calling this function on <a href="qhash#begin">QHash::begin</a>() leads to undefined results.
zh_cn: 在<a href="qhash#begin">QHash :: begin</a>（）上调用此函数将导致未定义的结果。

source: Calling this function on <a href="qhash#end">QHash::end</a>() leads to undefined results.
zh_cn: 在<a href="qhash#end">QHash :: end</a>（）上调用此函数将导致未定义的结果。

source: Calling this function on <a href="qhash#keyBegin">QHash::keyBegin</a>() leads to undefined results.
zh_cn: 在<a href="qhash#keyBegin">QHash :: keyBegin</a>（）上调用此函数将导致未定义的结果。

source: Calling this function on <a href="qhash#keyEnd">QHash::keyEnd</a>() leads to undefined results.
zh_cn: 在<a href="qhash#keyEnd">QHash :: keyEnd</a>（）上调用此函数将导致未定义的结果。

source: Calling this function on <a href="qiterable">QIterable</a>&lt;Container&gt;::begin() leads to undefined results.
zh_cn: 在<a href="qiterable">QIterable</a> &lt;Container&gt; :: begin（）上调用此函数将导致不确定的结果。

source: Calling this function on <a href="qiterable">QIterable</a>&lt;Container&gt;::end() leads to undefined results.
zh_cn: 在<a href="qiterable">QIterable</a> &lt;Container&gt; :: end（）上调用此函数将导致未定义的结果。

source: Calling this function on <a href="qjsonarray#begin">QJsonArray::begin</a>() leads to undefined results.
zh_cn: 在<a href="qjsonarray#begin">QJsonArray :: begin</a>（）上调用此函数将导致未定义的结果。

source: Calling this function on <a href="qjsonarray#end">QJsonArray::end</a>() leads to undefined results.
zh_cn: 在<a href="qjsonarray#end">QJsonArray :: end</a>（）上调用此函数将导致未定义的结果。

source: Calling this function on <a href="qjsonobject#begin">QJsonObject::begin</a>() leads to undefined results.
zh_cn: 在<a href="qjsonobject#begin">QJsonObject :: begin</a>（）上调用此函数将导致未定义的结果。

source: Calling this function on <a href="qjsonobject#end">QJsonObject::end</a>() leads to undefined results.
zh_cn: 在<a href="qjsonobject#end">QJsonObject :: end</a>（）上调用此函数将导致未定义的结果。

source: Calling this function on <a href="qlinkedlist">QLinkedList</a>&lt;T&gt;::constEnd() leads to undefined results.
zh_cn: 在<a href="qlinkedlist">QLinkedList</a> &lt;T&gt; :: constEnd（）上调用此函数将导致未定义的结果。

source: Calling this function on <a href="qlinkedlist#begin">QLinkedList::begin</a>() leads to undefined results.
zh_cn: 在<a href="qlinkedlist#begin">QLinkedList :: begin</a>（）上调用此函数将导致未定义的结果。

source: Calling this function on <a href="qlinkedlist#end">QLinkedList::end</a>() leads to undefined results.
zh_cn: 在<a href="qlinkedlist#end">QLinkedList :: end</a>（）上调用此函数将导致未定义的结果。

source: Calling this function on <a href="qlist#begin">QList::begin</a>() leads to undefined results.
zh_cn: 在<a href="qlist#begin">QList :: begin</a>（）上调用此函数将导致未定义的结果。

source: Calling this function on <a href="qlist#end">QList::end</a>() leads to undefined results.
zh_cn: 在<a href="qlist#end">QList :: end</a>（）上调用此函数将导致未定义的结果。

source: Calling this function on <a href="qmap#begin">QMap::begin</a>() leads to undefined results.
zh_cn: 在<a href="qmap#begin">QMap :: begin</a>（）上调用此函数将导致未定义的结果。

source: Calling this function on <a href="qmap#end">QMap::end</a>() leads to undefined results.
zh_cn: 在<a href="qmap#end">QMap :: end</a>（）上调用此函数将导致未定义的结果。

source: Calling this function on <a href="qmap#keyBegin">QMap::keyBegin</a>() leads to undefined results.
zh_cn: 在<a href="qmap#keyBegin">QMap :: keyBegin</a>（）上调用此函数将导致未定义的结果。

source: Calling this function on <a href="qmap#keyEnd">QMap::keyEnd</a>() leads to undefined results.
zh_cn: 在<a href="qmap#keyEnd">QMap :: keyEnd</a>（）上调用此函数将导致未定义的结果。
