Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/typescript/typescript.*.003.xlf
Languages: es, ko, ru, zh_cn

source: The above workaround will work as long as you have a common property between <code>squareOptions</code> and <code>SquareConfig</code>. In this example, it was the property <code>width</code>. It will however, fail if the variable does not have any common object property. For example:
ru: Вышеупомянутый обходной путь будет работать, если у вас есть общее свойство между <code>squareOptions</code> и <code>SquareConfig</code> . В этом примере это <code>width</code> свойства . Однако он завершится ошибкой, если переменная не имеет общего свойства объекта. Например:
zh_cn: 只要您在 <code>squareOptions</code> 和 <code>SquareConfig</code> 之间具有一个公共属性，上述变通办法就会起作用。在此示例中，它是属性 <code>width</code> 。但是，如果变量没有任何公共对象属性，它将失败。例如：

source: The act of introducing a new name in a more nested scope is called <em>shadowing</em>. It is a bit of a double-edged sword in that it can introduce certain bugs on its own in the event of accidental shadowing, while also preventing certain bugs. For instance, imagine we had written our earlier <code>sumMatrix</code> function using <code>let</code> variables.
ru: Акт введения нового имени в более вложенную область действия называется <em>затенением</em> . Это своего рода палка о двух концах, поскольку он может сам по себе вносить определенные ошибки в случае случайного затенения, а также предотвращать определенные ошибки. Например, представьте, что мы написали нашу предыдущую функцию <code>sumMatrix</code> , используя переменные <code>let</code> .
zh_cn: 在更嵌套的范围内引入新名称的行为称为<em>阴影</em>。它有点像一把双刃剑，因为它可以在意外阴影的情况下自行引入某些错误，同时还可以防止某些错误。例如，假设我们已经使用 <code>let</code> 变量编写了更早的 <code>sumMatrix</code> 函数。

source: The advantage of optional properties is that you can describe these possibly available properties while still also preventing use of properties that are not part of the interface. For example, had we mistyped the name of the <code>color</code> property in <code>createSquare</code>, we would get an error message letting us know:
ru: Преимущество необязательных свойств заключается в том, что вы можете описывать эти возможно доступные свойства, в то же время предотвращая использование свойств, которые не являются частью интерфейса. Например, если бы мы неправильно набрали имя свойства <code>color</code> в <code>createSquare</code> , мы получили бы сообщение об ошибке, сообщающее нам:
zh_cn: 可选属性的优点在于，您可以描述这些可能可用的属性，同时仍然可以防止使用不属于接口的属性。例如，如果我们在 <code>createSquare</code> 中错误输入了 <code>color</code> 属性的名称，则会收到一条错误消息，通知我们：

source: The alternative was to instead rewrite the code so that the language could analyze it, but this isn&rsquo;t convenient.
ru: Альтернативой было переписать код, чтобы язык мог его анализировать, но это неудобно.
zh_cn: 替代方法是改写代码，以便语言可以对其进行分析，但这并不方便。

source: The answer is to supply multiple function types for the same function as a list of overloads. This list is what the compiler will use to resolve function calls. Let&rsquo;s create a list of overloads that describe what our <code>pickCard</code> accepts and what it returns.
ru: Ответ заключается в том, чтобы предоставить несколько типов функций для одной и той же функции в виде списка перегрузок. Этот список будет использоваться компилятором для разрешения вызовов функций. Давайте создадим список перегрузок, которые описывают, что принимает наша <code>pickCard</code> и что она возвращает.
zh_cn: 答案是为同一功能提供多种功能类型，作为重载列表。该列表是编译器将用来解析函数调用的列表。让我们创建一个重载列表，以描述 <code>pickCard</code> 接受和返回的内容。

source: The argument can be a file path to a valid JSON configuration file, or a directory path to a directory containing a <code>tsconfig.json</code> file.
ru: Аргументом может быть путь к допустимому файлу конфигурации JSON или путь к каталогу, содержащему файл <code>tsconfig.json</code> .
zh_cn: 该参数可以是有效JSON配置文件的文件路径，也可以是包含 <code>tsconfig.json</code> 文件的目录的目录路径。

source: The as operator
ru: Как оператор
zh_cn: as运算符

source: The basic rule for TypeScript&rsquo;s structural type system is that <code>x</code> is compatible with <code>y</code> if <code>y</code> has at least the same members as <code>x</code>. For example:
ru: Основное правило для системы структурных типов TypeScript состоит в том, что <code>x</code> совместим с <code>y</code> , если <code>y</code> имеет по крайней мере те же члены, что и <code>x</code> . Например:
zh_cn: 为打字稿的结构类型系统的基本规则是， <code>x</code> 是兼容 <code>y</code> 如果 <code>y</code> 至少具有相同的成员 <code>x</code> 。例如：

source: The caveat is that string-initialized enums can&rsquo;t be reverse-mapped to get the original enum member name. In other words, you can&rsquo;t write <code>Colors["RED"]</code> to get the string <code>"Red"</code>.
ru: Предостережение заключается в том, что перечисления, инициализированные строкой, не могут быть обратным отображением, чтобы получить исходное имя члена перечисления. Другими словами, вы не можете написать <code>Colors["RED"]</code> чтобы получить строку <code>"Red"</code> .
zh_cn: 需要注意的是，不能对通过字符串初始化的枚举进行反向映射以获取原始枚举成员名称。换句话说，您不能编写 <code>Colors["RED"]</code> 来获取字符串 <code>"Red"</code> 。

source: The character set of the input files.
ru: Набор символов входных файлов.
zh_cn: 输入文件的字符集。

source: The classification can be further customized by changing the font and color settings for the <code>VB XML</code> color and font settings through <code>Tools</code>-&gt;<code>Options</code>-&gt;<code>Environment</code>-&gt;<code>Fonts and Colors</code> page.
ru: Классификацию можно дополнительно настроить, изменив настройки шрифта и цвета для цвета и настроек шрифта <code>VB XML</code> через <code>Tools</code> -&gt; <code>Options</code> -&gt; <code>Environment</code> -&gt; <code>Fonts and Colors</code> .
zh_cn: 通过在&ldquo; <code>Tools</code> -&gt;&ldquo; <code>Options</code> -&gt;&ldquo; <code>Environment</code> -&gt;&ldquo; <code>Fonts and Colors</code> 页面上更改 <code>VB XML</code> 颜色和字体设置的字体和颜色设置，可以进一步自定义分类。

source: The code sample starts with the two classes that will act as our mixins. You can see each one is focused on a particular activity or capability. We&rsquo;ll later mix these together to form a new class from both capabilities.
ru: Пример кода начинается с двух классов, которые будут действовать как наши миксины. Вы можете видеть, что каждый из них ориентирован на определенную деятельность или способность. Позже мы смешаем их вместе, чтобы сформировать новый класс из обеих возможностей.
zh_cn: 该代码示例从将用作我们的mixins的两个类开始。您可以看到每个人都专注于特定的活动或能力。稍后，我们将它们混合在一起以使用这两种功能形成一个新的类。

source: The comment pragma version may be used like so (in TypeScript 2.8):
ru: Версия комментария pragma может быть использована подобным образом (в TypeScript 2.8):
zh_cn: 注释pragma版本可以这样使用(在TypeScript 2.8中)。

source: The compiler can usually figure out the type of <code>this</code> when it has some context to work with. When it doesn&rsquo;t, you can explicitly specify the type of <code>this</code> with <code>@this</code>:
ru: Компилятор обычно может определить тип <code>this</code> когда у него есть некоторый контекст для работы. Если это не так, вы можете явно указать тип <code>this</code> с помощью <code>@this</code> :
zh_cn: 编译器通常可以断定类型 <code>this</code> 时候它有一些方面与工作。当它不，你可以明确指定的类型 <code>this</code> 与 <code>@this</code> ：

source: The compiler checks that <code>manufacturer</code> and <code>model</code> are actually properties on <code>Car</code>. The example introduces a couple of new type operators. First is <code>keyof T</code>, the <strong>index type query operator</strong>. For any type <code>T</code>, <code>keyof T</code> is the union of known, public property names of <code>T</code>. For example:
ru: Компилятор проверяет, что <code>manufacturer</code> и <code>model</code> действительно являются свойствами <code>Car</code> . В примере вводится пара новых операторов типа. Во-первых, это <code>keyof T</code> , <strong>оператор запроса индексного типа</strong> . Для любого типа <code>T</code> , <code>keyof T</code> является объединением имен известно, общественной собственности <code>T</code> . Например:
zh_cn: 编译器检查 <code>manufacturer</code> 和 <code>model</code> 是否实际上是 <code>Car</code> 的属性。该示例引入了几个新型运算符。首先是 <code>keyof T</code> ，<strong>索引类型查询运算符</strong>。对于任何类型的 <code>T</code> ， <code>keyof T</code> 是已知的，公共的属性名的工会 <code>T</code> 。例如：

source: The compiler checks that variables are definitely assigned by performing <em>control flow based type analysis</em>. See later for further details on this topic.
ru: Компилятор проверяет, что переменные явно присвоены, путем <em>анализа типов на основе потока управления</em> . См. Ниже для получения дополнительной информации по этой теме.
zh_cn: 编译器通过执行<em>基于控制流的类型分析来</em>检查是否确实分配了变量。有关此主题的更多详细信息，请参见稍后。

source: The compiler detects whether each module is used in the emitted JavaScript. If a module identifier is only ever used as part of a type annotations and never as an expression, then no <code>require</code> call is emitted for that module. This elision of unused references is a good performance optimization, and also allows for optional loading of those modules.
ru: Компилятор определяет, используется ли каждый модуль в выпущенном JavaScript. Если идентификатор модуля не только когда - либо использовали как части типа аннотаций и никогда как выражение, то не <code>require</code> вызова испускается для этого модуля. Это исключение неиспользуемых ссылок является хорошей оптимизацией производительности, а также допускает дополнительную загрузку этих модулей.
zh_cn: 编译器检测所发出的JavaScript中是否使用了每个模块。如果模块标识符仅用作类型注释的一部分，而从未用作表达式，则不会对该模块发出 <code>require</code> 调用。省略未使用的引用是一项很好的性能优化，并且还允许可选地加载这些模块。

source: The compiler infers constructor functions based on this-property assignments, but you can make checking stricter and suggestions better if you add a <code>@constructor</code> tag:
ru: Компилятор определяет функции конструктора на основе назначений этого свойства, но вы можете сделать проверку более строгой и предложения лучше, если добавите тег <code>@constructor</code> :
zh_cn: 编译器根据此属性分配推断构造函数，但如果添加 <code>@constructor</code> 标记，则可以使检查更严格，建议更完善：

source: The compiler performs a preprocessing pass on input files to resolve all triple-slash reference directives. During this process, additional files are added to the compilation.
ru: Компилятор выполняет препроцессирование входных файлов для разрешения всех директив ссылки тройной косой черты.В процессе компиляции добавляются дополнительные файлы.
zh_cn: 编译器对输入文件进行预处理,以解析所有三斜杠引用指令。在这一过程中,会有额外的文件加入到编译中。

source: The compiler will automatically order the output file based on the reference tags present in the files. You can also specify each file individually:
ru: Компилятор будет автоматически заказывать выходной файл на основе ссылочных тегов,присутствующих в файлах.Также можно указать каждый файл по отдельности:
zh_cn: 编译器会根据文件中存在的参考标签自动对输出文件进行排序。你也可以单独指定每个文件。

source: The compiler will generate a simple <code>for</code> loop for a <code>for..of</code> loop, for instance:
ru: Компилятор сгенерирует простой цикл for <code>for</code> цикла <code>for..of</code> , например:
zh_cn: 编译器将生成一个简单 <code>for</code> 循环的 <code>for..of</code> 循环，例如：

source: The compiler will now resolve <code>import messages from './#{locale}/messages'</code> to <code>import messages from './zh/messages'</code> for tooling purposes, allowing development in a locale agnostic manner without compromising design time support.
ru: Теперь компилятор будет разрешать <code>import messages from './#{locale}/messages'</code> чтобы <code>import messages from './zh/messages'</code> для инструментальных целей, позволяя разработку независимо от языкового стандарта без ущерба для поддержки времени разработки.
zh_cn: 编译器现在将解析 <code>import messages from './#{locale}/messages'</code> 的 <code>import messages from './zh/messages'</code> 以从'./zh/messages' 导入消息以用于工具目的，从而允许以与语言环境无关的方式进行开发，而不会影响设计时间支持。

source: The compiler will try to find a <code>.ts</code>, <code>.tsx</code>, and then a <code>.d.ts</code> with the appropriate path. If a specific file could not be found, then the compiler will look for an <em>ambient module declaration</em>. Recall that these need to be declared in a <code>.d.ts</code> file.
ru: Компилятор попытается найти <code>.ts</code> , <code>.tsx</code> , а затем <code>.d.ts</code> с соответствующим путем. Если конкретный файл найти не удалось, компилятор будет искать объявление <em>внешнего модуля</em> . Напомним, что их нужно объявить в файле <code>.d.ts</code> .
zh_cn: 编译器将尝试查找 <code>.ts</code> ， <code>.tsx</code> ，然后 <code>.d.ts</code> 具有适当路径的.d.ts。如果找不到特定文件，则编译器将查找<em>环境模块声明</em>。回想一下，这些需要在 <code>.d.ts</code> 文件中声明。

source: The configuration from the base file are loaded first, then overridden by those in the inheriting config file.
ru: Сначала загружается конфигурация из базового файла,а затем переопределяется теми,кто находится в наследуемом файле конфигурации.
zh_cn: 首先加载基础文件中的配置,然后被继承配置文件中的配置覆盖。

source: The configuration from the base file are loaded first, then overridden by those in the inheriting config file. If a circularity is encountered, we report an error.
ru: Сначала загружается конфигурация из базового файла,а затем переопределяется теми,кто находится в наследуемом файле конфигурации.При возникновении цикличности мы сообщаем об ошибке.
zh_cn: 首先加载基础文件中的配置,然后被继承配置文件中的配置覆盖。如果遇到循环,我们会报告一个错误。

source: The constructor of a mixin class (if any) must have a single rest parameter of type <code>any[]</code> and must use the spread operator to pass those parameters as arguments in a <code>super(...args)</code> call.
ru: Конструктор класса миксина (если есть) должен иметь единственный параметр rest типа <code>any[]</code> и должен использовать оператор распространения для передачи этих параметров в качестве аргументов в вызове <code>super(...args)</code> .
zh_cn: mixin类的构造函数（如果有）必须具有类型为 <code>any[]</code> 的单个rest参数，并且必须使用spread运算符将这些参数作为参数传递给 <code>super(...args)</code> 调用。

source: The core idea of the pattern is that the <code>import id = require("...")</code> statement gives us access to the types exposed by the module. The module loader is invoked (through <code>require</code>) dynamically, as shown in the <code>if</code> blocks below. This leverages the reference-elision optimization so that the module is only loaded when needed. For this pattern to work, it&rsquo;s important that the symbol defined via an <code>import</code> is only used in type positions (i.e. never in a position that would be emitted into the JavaScript).
ru: Основная идея шаблона состоит в том, что оператор <code>import id = require("...")</code> дает нам доступ к типам, предоставляемым модулем. Загрузчик модуля вызывается (через <code>require</code> ) динамически, как показано в блоках <code>if</code> ниже. Это усиливает оптимизацию исключения ссылок, так что модуль загружается только при необходимости. Для того, чтобы этот шаблон работал, важно, чтобы символ, определенный посредством <code>import</code> использовался только в позициях типа (т.е. никогда в позиции, которая будет передана в JavaScript).
zh_cn: 模式的核心思想是 <code>import id = require("...")</code> 语句使我们可以访问模块公开的类型。模块加载器是动态调用的（通过 <code>require</code> ），如下面的 <code>if</code> 块所示。这利用了参考删除优化，因此仅在需要时才加载模块。为了使这种模式有效，重要的是，通过 <code>import</code> 定义的符号仅在类型位置中使用（即，永远不要在将要发射到JavaScript中的位置中使用）。

source: The corresponding <code>tsconfig.json</code> would look like:
ru: Соответствующий <code>tsconfig.json</code> будет выглядеть так:
zh_cn: 相应的 <code>tsconfig.json</code> 如下所示：

source: The declaration merge of <code>Animals</code> in this example:
ru: Объявление слияния <code>Animals</code> в этом примере:
zh_cn: 在此示例中， <code>Animals</code> 的声明合并：

source: The default behavior for the TypeScript compiler is to still emit .js files if there were type errors (for example, an attempt to assign a <code>string</code> to a <code>number</code>). This can be undesirable on build servers or other scenarios where only output from a &ldquo;clean&rdquo; build is desired. The new flag <code>noEmitOnError</code> prevents the compiler from emitting .js code if there were any errors.
ru: Поведение по умолчанию для машинописи компилятора является еще испускает .js файлы , если возникают ошибки типа (например, попытка присвоить <code>string</code> к <code>number</code> ). Это может быть нежелательно на серверах сборки или в других сценариях, где желателен только вывод из &laquo;чистой&raquo; сборки. Новый флаг <code>noEmitOnError</code> предотвращает выдачу компилятором кода .js в случае каких-либо ошибок.
zh_cn: 为打字稿编译器的默认行为是依旧排出.js文件，如果文件中有错误类型（例如，尝试给一个 <code>string</code> 的 <code>number</code> ）。在构建服务器或仅需要&ldquo;干净&rdquo;构建的输出的其他情况下，这可能是不希望的。新标志 <code>noEmitOnError</code> 防止编译器在出现任何错误时发出.js代码。

source: The default-ed properties are inferred from the <code>defaultProps</code> property type. If an explicit type annotation is added, e.g. <code>static defaultProps: Partial&lt;Props&gt;;</code> the compiler will not be able to identify which properties have defaults (since the type of <code>defaultProps</code> include all properties of <code>Props</code>).
ru: Свойства по умолчанию выводятся из типа свойства <code>defaultProps</code> . Если добавляется явная аннотация типа, например <code>static defaultProps: Partial&lt;Props&gt;;</code> компилятор не сможет определить, какие свойства имеют значения по умолчанию (поскольку тип <code>defaultProps</code> включает все свойства <code>Props</code> ).
zh_cn: 从 <code>defaultProps</code> 属性类型推断出default-ed属性。如果添加了显式类型注释，例如 <code>static defaultProps: Partial&lt;Props&gt;;</code> 编译器将无法识别哪些属性具有默认值（因为 <code>defaultProps</code> 的类型包括 <code>Props</code> 的所有属性）。

source: The definite assignment assertion is a feature that allows a <code>!</code> to be placed after instance property and variable declarations to relay to TypeScript that a variable is indeed assigned for all intents and purposes, even if TypeScript&rsquo;s analyses cannot detect so.
ru: Утверждение определенного присваивания - это функция, которая позволяет <code>!</code> должны быть размещены после объявлений свойств и переменных экземпляра, чтобы передать TypeScript, что переменная действительно назначена для всех намерений и целей, даже если анализ TypeScript не может этого обнаружить.
zh_cn: 确定分配断言是允许 <code>!</code> 的功能。放置在实例属性和变量声明之后，以中继到TypeScript，即使TypeScript的分析无法检测到该变量的确是出于所有意图和目的而分配的。

source: The distributive property of conditional types can conveniently be used to <em>filter</em> union types:
ru: Дистрибутивное свойство условных типов удобно использовать для <em>фильтрации</em> типов объединения:
zh_cn: 条件类型的分布属性可以方便地用于<em>过滤</em>联合类型：

source: The dual of this is <em>indexed access types</em>, also called <em>lookup types</em>. Syntactically, they look exactly like an element access, but are written as types:
ru: Двойной эффект - это <em>индексированные типы доступа</em> , также называемые <em>типами поиска</em> . Синтаксически они выглядят точно так же, как доступ к элементу, но записываются как типы:
zh_cn: 双重<em>访问</em>是<em>索引访问类型</em>，也称为<em>查找类型</em>。从句法上讲，它们看起来完全像元素访问，但是被写为类型：

source: The easiest way to remember whether to use <code>readonly</code> or <code>const</code> is to ask whether you&rsquo;re using it on a variable or a property. Variables use <code>const</code> whereas properties use <code>readonly</code>.
ru: Самый простой способ запомнить, использовать ли только <code>readonly</code> или <code>const</code> , - это спросить, используете ли вы его для переменной или свойства. Переменные используют <code>const</code> , тогда как свойства используют только <code>readonly</code> .
zh_cn: 记住是使用 <code>readonly</code> 还是 <code>const</code> 的最简单方法是询问是否在变量或属性上使用它。变量使用 <code>const</code> ,而属性使用 <code>readonly</code> 。

source: The easiest way to see how interfaces work is to start with a simple example:
ru: Самый простой способ увидеть,как работают интерфейсы-начать с простого примера:
zh_cn: 要了解接口的工作原理,最简单的方法是从一个简单的例子开始。

source: The element attribute type is used to type check the attributes in the JSX. Optional and required properties are supported.
ru: Тип атрибута элемента используется для проверки атрибутов в JSX.Поддерживаются необязательные и требуемые свойства.
zh_cn: 元素属性类型用于类型检查JSX中的属性。支持可选和必填属性。

source: The element instance type is interesting because it must be assignable to <code>JSX.ElementClass</code> or it will result in an error. By default <code>JSX.ElementClass</code> is <code>{}</code>, but it can be augmented to limit the use of JSX to only those types that conform to the proper interface.
ru: Тип экземпляра элемента интересен тем, что он должен быть назначен <code>JSX.ElementClass</code> , иначе это приведет к ошибке. По умолчанию <code>JSX.ElementClass</code> равен <code>{}</code> , но его можно расширить , чтобы ограничить использование JSX только теми типами, которые соответствуют правильному интерфейсу.
zh_cn: 元素实例类型很有趣，因为它必须可分配给 <code>JSX.ElementClass</code> ，否则将导致错误。默认情况下， <code>JSX.ElementClass</code> 为 <code>{}</code> ，但是可以对其进行扩展以将JSX的使用限制为仅符合正确接口的那些类型。

source: The ellipsis is also used in the type of the function with rest parameters:
ru: Эллипсис также используется в типе функции с параметрами покоя:
zh_cn: 省略号也用于带休息参数的函数类型中。

source: The enum member is initialized with a constant enum expression. A constant enum expression is a subset of TypeScript expressions that can be fully evaluated at compile time. An expression is a constant enum expression if it is:
ru: Член переписи инициализируется постоянным выражением.Константное выражение перечисления-это подмножество выражений TypeScript,которые могут быть полностью обработаны во время компиляции.Выражение является константным выражением перечисления,если оно есть:
zh_cn: 枚举成员用一个常量枚举表达式初始化。常量枚举表达式是TypeScript表达式的一个子集,它可以在编译时被完全评估。如果一个表达式是常量枚举表达式,那么它就是一个常量枚举表达式。

source: The exact factory function used by the <code>jsx: react</code> compiler option is configurable. It may be set using either the <code>jsxFactory</code> command line option, or an inline <code>@jsx</code> comment pragma to set it on a per-file basis. For example, if you set <code>jsxFactory</code> to <code>createElement</code>, <code>&lt;div /&gt;</code> will emit as <code>createElement("div")</code> instead of <code>React.createElement("div")</code>.
ru: Точная фабричная функция, используемая <code>jsx: react</code> компилятора jsx: react, настраивается. Его можно установить с помощью <code>jsxFactory</code> командной строки jsxFactory или встроенного <code>@jsx</code> комментариев @jsx, чтобы установить его для каждого файла. Например, если вы установите <code>jsxFactory</code> на <code>createElement</code> , <code>&lt;div /&gt;</code> будет генерировать как <code>createElement("div")</code> вместо <code>React.createElement("div")</code> .
zh_cn: <code>jsx: react</code> 编译器选项使用的确切工厂功能是可配置的。可以使用 <code>jsxFactory</code> 命令行选项或内联 <code>@jsx</code> 注释实用程序进行设置，以基于每个文件进行设置。例如，如果将 <code>jsxFactory</code> 设置为 <code>createElement</code> ，则 <code>&lt;div /&gt;</code> 将作为 <code>createElement("div")</code> 而不是 <code>React.createElement("div")</code> 发出。
