Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/typescript/typescript.*.003.xlf
Languages: es, ko, ru, zh_cn

source: The example also shows how to override methods in the base class with methods that are specialized for the subclass. Here both <code>Snake</code> and <code>Horse</code> create a <code>move</code> method that overrides the <code>move</code> from <code>Animal</code>, giving it functionality specific to each class. Note that even though <code>tom</code> is declared as an <code>Animal</code>, since its value is a <code>Horse</code>, calling <code>tom.move(34)</code> will call the overriding method in <code>Horse</code>:
ru: В этом примере также показано, как переопределить методы в базовом классе методами, специализированными для этого подкласса. Здесь и <code>Snake</code> , и <code>Horse</code> создают метод <code>move</code> который отменяет <code>move</code> от <code>Animal</code> , придавая ему функциональность, специфичную для каждого класса. Обратите внимание, что даже если <code>tom</code> объявлен как <code>Animal</code> , поскольку его значение - <code>Horse</code> , вызов <code>tom.move(34)</code> вызовет метод переопределения в <code>Horse</code> :
zh_cn: 该示例还显示了如何使用专门用于子类的方法覆盖基类中的方法。这里既有 <code>Snake</code> 和 <code>Horse</code> 创建一个 <code>move</code> ，它覆盖的方法 <code>move</code> 从 <code>Animal</code> ，给它的功能具体到每个班级。请注意，即使 <code>tom</code> 被声明为 <code>Animal</code> ，由于其值是 <code>Horse</code> ，调用 <code>tom.move(34)</code> 也会在 <code>Horse</code> 中调用重写方法：

source: The example uses a nested function here because the compiler can&rsquo;t eliminate nulls inside a nested function (except immediately-invoked function expressions). That&rsquo;s because it can&rsquo;t track all calls to the nested function, especially if you return it from the outer function. Without knowing where the function is called, it can&rsquo;t know what the type of <code>name</code> will be at the time the body executes.
ru: В этом примере используется вложенная функция, поскольку компилятор не может исключить значения NULL внутри вложенной функции (за исключением выражений функций, вызываемых немедленно). Это потому, что он не может отслеживать все вызовы вложенной функции, особенно если вы возвращаете ее из внешней функции. Не зная, где вызывается функция, он не может знать, какой тип <code>name</code> будет во время выполнения тела.
zh_cn: 该示例在此处使用嵌套函数，因为编译器无法消除嵌套函数内部的空值（立即调用的函数表达式除外）。这是因为它无法跟踪对嵌套函数的所有调用，尤其是从外部函数返回它时。不知道该函数在何处调用，就无法知道主体执行时 <code>name</code> 的类型。

source: The expression for the accessor decorator will be called as a function at runtime, with the following three arguments:
ru: Выражение для декоратора аксессуара будет вызвано в качестве функции во время выполнения,с тремя следующими аргументами:
zh_cn: 访问器装饰器的表达式将在运行时以函数的形式被调用,其参数如下三个。

source: The expression for the class decorator will be called as a function at runtime, with the constructor of the decorated class as its only argument.
ru: Выражение для декоратора класса будет вызвано в качестве функции во время выполнения,при этом конструктор декорированного класса будет являться его единственным аргументом.
zh_cn: 类装饰器的表达式将在运行时以函数的形式被调用,被装饰类的构造函数作为其唯一的参数。

source: The expression for the method decorator will be called as a function at runtime, with the following three arguments:
ru: Выражение для декоратора метода будет вызвано в качестве функции во время выполнения,с тремя следующими аргументами:
zh_cn: 方法装饰器的表达式将在运行时以函数的形式被调用,其参数如下三个。

source: The expression for the parameter decorator will be called as a function at runtime, with the following three arguments:
ru: Выражение для декоратора параметра будет вызвано в качестве функции во время выполнения,с тремя следующими аргументами:
zh_cn: 参数装饰器的表达式将在运行时以函数的形式被调用,其参数如下三个。

source: The expression for the property decorator will be called as a function at runtime, with the following two arguments:
ru: Выражение для декоратора свойства будет вызвано как функция во время выполнения,с двумя следующими аргументами:
zh_cn: 属性装饰器的表达式将在运行时以函数的形式被调用,参数如下两个。

source: The expressions for each decorator are evaluated top-to-bottom.
ru: Выражения для каждого декоратора оцениваются сверху вниз.
zh_cn: 每个装饰者的表达式都是由上至下评估的。

source: The factory chosen will also affect where the <code>JSX</code> namespace is looked up (for type checking information) before falling back to the global one. If the factory is defined as <code>React.createElement</code> (the default), the compiler will check for <code>React.JSX</code> before checking for a global <code>JSX</code>. If the factory is defined as <code>h</code>, it will check for <code>h.JSX</code> before a global <code>JSX</code>.
ru: Выбранная фабрика также повлияет на то, где <code>JSX</code> пространство имен JSX (для информации о проверке типов), прежде чем вернуться к глобальному. Если фабрика определена как <code>React.createElement</code> (по умолчанию), компилятор проверяет наличие <code>React.JSX</code> перед проверкой глобального <code>JSX</code> . Если фабрика определена как <code>h</code> , она будет проверять наличие <code>h.JSX</code> перед глобальным <code>JSX</code> .
zh_cn: 选择的工厂还将影响在退回到全局名称空间之前在 <code>JSX</code> 名称空间中查找的位置（用于类型检查信息）。如果工厂定义为 <code>React.createElement</code> （默认值），则编译器将在检查全局 <code>JSX</code> 之前检查 <code>React.JSX</code> 。如果工厂定义为 <code>h</code> ，它将在全局 <code>JSX</code> 之前检查 <code>h.JSX</code> 。

source: The first assignment is now an error. Effectively, <code>T</code> is contravariant in <code>Comparer&lt;T&gt;</code> because it is used only in function type parameter positions.
ru: Первое присвоение теперь является ошибкой. Фактически, <code>T</code> контравариантен в <code>Comparer&lt;T&gt;</code> потому что он используется только в позициях параметра типа функции.
zh_cn: 现在，第一次分配是一个错误。实际上， <code>T</code> 在 <code>Comparer&lt;T&gt;</code> 是互变的，因为它仅在函数类型的参数位置中使用。

source: The first assignment is permitted in default type checking mode, but flagged as an error in strict function types mode. Intuitively, the default mode permits the assignment because it is <em>possibly</em> sound, whereas strict function types mode makes it an error because it isn&rsquo;t <em>provably</em> sound. In either mode the third assignment is an error because it is <em>never</em> sound.
ru: Первое присвоение разрешено в режиме проверки типов по умолчанию, но помечено как ошибка в режиме строгих типов функций. Интуитивно понятно, что режим по умолчанию разрешает назначение, потому что он, <em>возможно,</em> является правильным, тогда как режим строгих типов функций делает его ошибкой, потому что он не является <em>доказуемым</em> . В любом режиме третье назначение является ошибкой, потому что оно <em>никогда не</em> звучит.
zh_cn: 在默认类型检查模式下，第一次分配是允许的，但在严格功能类型模式下，则将其标记为错误。直观上，默认模式允许转让，因为它<em>可能</em>声音，而严格的功能类型的模式使得它的错误，因为它没有<em>可证明的</em>声音。在任何一种模式下，第三项分配都是错误的，因为它<em>永远不会</em>发出声音。

source: The first is that enum members also become types as well! For example, we can say that certain members can <em>only</em> have the value of an enum member:
ru: Во-первых, члены перечисления также становятся типами! Например, мы можем сказать, что определенные члены могут иметь <em>только</em> значение члена перечисления:
zh_cn: 首先是枚举成员也将成为类型！例如，我们可以说某些成员<em>只能</em>具有枚举成员的值：

source: The first line tells Visual Studio to run the task &lsquo;default&rsquo; after the build finishes. It will also run the &lsquo;clean&rsquo; task when you ask Visual Studio to clean the build.
ru: Первая строка указывает Visual Studio запустить задачу по умолчанию после завершения сборки. Он также запустит &laquo;чистую&raquo; задачу, когда вы попросите Visual Studio очистить сборку.
zh_cn: 第一行告诉Visual Studio在完成构建后运行任务&ldquo;默认&rdquo;。当您要求Visual Studio清理内部版本时，它还将运行&ldquo;清理&rdquo;任务。

source: The first step to type checking attributes is to determine the <em>element attributes type</em>. This is slightly different between intrinsic and value-based elements.
ru: Первым шагом к проверке типа атрибутов является определение <em>типа атрибутов элемента</em> . Это немного отличается между внутренними элементами и элементами, основанными на значениях.
zh_cn: 类型检查属性的第一步是确定<em>元素属性的类型</em>。内在元素和基于价值的元素之间略有不同。

source: The first thing you may notice in the above is that instead of trying to extend <code>Disposable</code> and <code>Activatable</code> in <code>SmartObject</code> class, we extend them in <code>SmartObject</code> interface. <code>SmartObject</code> interface will be mixed into the <code>SmartObject</code> class due to the <a href="declaration-merging">declaration merging</a>.
ru: Первое, что вы можете заметить в приведенном выше, - это то, что вместо того, чтобы пытаться расширить <code>Disposable</code> и <code>Activatable</code> в классе <code>SmartObject</code> , мы расширяем их в интерфейсе <code>SmartObject</code> . Интерфейс <code>SmartObject</code> будет смешан с классом <code>SmartObject</code> из-за <a href="declaration-merging">слияния деклараций</a> .
zh_cn: 在上面您可能会注意到的第一件事是，我们没有尝试在 <code>SmartObject</code> 类中扩展 <code>Disposable</code> 和 <code>Activatable</code> ，而是在 <code>SmartObject</code> 接口中对其进行了扩展。由于<a href="declaration-merging">声明合并，</a> <code>SmartObject</code> 接口将混合到 <code>SmartObject</code> 类中。

source: The first type of assertion signature models the way that Node&rsquo;s <code>assert</code> function works. It ensures that whatever condition is being checked must be true for the remainder of the containing scope.
ru: Первый тип подписи утверждения моделирует способ работы функции <code>assert</code> Node . Это гарантирует, что любое проверяемое условие должно быть истинным для оставшейся части содержащей области.
zh_cn: 第一种断言签名对Node的 <code>assert</code> 函数的工作方式进行建模。它确保在包含范围的其余部分中，无论检查什么条件都必须为真。

source: The flexibility of <code>rootDirs</code> is not limited to specifying a list of physical source directories that are logically merged. The supplied array may include any number of ad hoc, arbitrary directory names, regardless of whether they exist or not. This allows the compiler to capture sophisticated bundling and runtime features such as conditional inclusion and project specific loader plugins in a type safe way.
ru: Гибкость <code>rootDirs</code> не ограничивается указанием списка физических исходных каталогов, которые логически объединены. Предоставляемый массив может включать в себя любое количество произвольных произвольных имен каталогов, независимо от того, существуют они или нет. Это позволяет компилятору захватывать сложные функции связывания и выполнения, такие как условное включение и специальные плагины загрузчика проекта, безопасным для типов способом.
zh_cn: <code>rootDirs</code> 的灵活性不仅限于指定逻辑上合并的物理源目录的列表。提供的数组可以包括任意数量的临时目录名，无论它们是否存在。这允许编译器以类型安全的方式捕获复杂的捆绑和运行时功能，例如条件包含和项目特定的加载器插件。

source: The following example demonstrates how multiple candidates for the same type variable in co-variant positions causes a union type to be inferred:
ru: Следующий пример демонстрирует,как несколько кандидатов на одну и ту же переменную типа в ковариантных позициях приводят к выводу о типе союза:
zh_cn: 下面的例子演示了在共变量位置上的同一类型变量的多个候选者如何导致联合类型被推断。

source: The following is an example of a class decorator (<code>@sealed</code>) applied to the <code>Greeter</code> class:
ru: Ниже приведен пример декоратора класса ( <code>@sealed</code> ), примененного к классу <code>Greeter</code> :
zh_cn: 以下是应用于 <code>Greeter</code> 类的类装饰器（ <code>@sealed</code> ）的示例：

source: The following is an example of a method decorator (<code>@enumerable</code>) applied to a method on the <code>Greeter</code> class:
ru: Ниже приведен пример декоратора метода ( <code>@enumerable</code> ), применяемого к методу класса <code>Greeter</code> :
zh_cn: 以下是应用于 <code>Greeter</code> 类上的方法的方法装饰器（ <code>@enumerable</code> ）的示例：

source: The following is an example of a parameter decorator (<code>@required</code>) applied to parameter of a member of the <code>Greeter</code> class:
ru: Ниже приведен пример декоратора параметров ( <code>@required</code> ), применяемого к параметру члена класса <code>Greeter</code> :
zh_cn: 以下是应用于 <code>Greeter</code> 类成员的参数的参数修饰符（ <code>@required</code> ）的示例：

source: The following is an example of an accessor decorator (<code>@configurable</code>) applied to a member of the <code>Point</code> class:
ru: Ниже приведен пример декоратора доступа ( <code>@configurable</code> ), применяемого к члену класса <code>Point</code> :
zh_cn: 以下是应用于 <code>Point</code> 类的成员的访问器装饰器（ <code>@configurable</code> ）的示例：

source: The global variable <code>foo</code> contains the number of widgets present.
ru: Глобальная переменная <code>foo</code> содержит количество присутствующих виджетов.
zh_cn: 全局变量 <code>foo</code> 包含存在的小部件的数量。

source: The global variable <code>myLib</code> has a function <code>makeGreeting</code> for creating greetings, and a property <code>numberOfGreetings</code> indicating the number of greetings made so far.
ru: Глобальная переменная <code>myLib</code> имеет функцию <code>makeGreeting</code> для создания приветствий и свойство <code>numberOfGreetings</code> , указывающее количество сделанных приветствий.
zh_cn: 全局变量 <code>myLib</code> 具有的功能 <code>makeGreeting</code> 创建问候和财产 <code>numberOfGreetings</code> 表示问候的数量迄今所取得。

source: The guide is broken down into the following sections.
ru: Руководство разбито на следующие разделы.
zh_cn: 本指南分为以下几个部分。

source: The inference process is fairly straightforward here because <code>getDisplayName</code> and <code>getLength</code> use types that can easily be referenced. However, in TypeScript 3.3 and earlier, generic functions like <code>compose</code> didn&rsquo;t work so well when passed other generic functions.
ru: Здесь процесс вывода довольно прост, потому что <code>getDisplayName</code> и <code>getLength</code> используют типы, на которые легко ссылаться. Однако в TypeScript 3.3 и ранее универсальные функции, такие как <code>compose</code> , не работали так хорошо при передаче других универсальных функций.
zh_cn: 此处的推理过程非常简单，因为 <code>getDisplayName</code> 和 <code>getLength</code> 使用易于引用的类型。但是，在TypeScript 3.3和更早版本中，诸如 <code>compose</code> 之类的通用函数在传递其他通用函数时并不能很好地工作。

source: The inferred return type of a function may be a type declared locally within the function. It is not possible for callers of the function to reference such a local type, but it can of course be matched structurally. For example:
ru: Предполагаемый тип возврата функции может быть типом,объявленным локально внутри функции.Вызовы функции не могут ссылаться на такой локальный тип,но,конечно,могут быть структурно подобраны.Например:
zh_cn: 一个函数的推断返回类型可能是函数中本地声明的类型。函数的调用者不可能引用这样的本地类型,但当然可以在结构上进行匹配。例如

source: The instance side of an ambient class declaration can be extended using an interface declaration The class constructor object is unmodified. For example:
ru: Сторона экземпляра декларации класса окружающей среды может быть расширена с помощью декларации интерфейса Объект конструктора класса немодифицирован.Например:
zh_cn: 环境类声明的实例端可以使用接口声明进行扩展 类的构造函数对象不做修改。比如说

source: The intent of any function that returns <code>never</code> is that it never returns. It indicates that an exception was thrown, a halting error condition occurred, or that the program exited. For example, <a href="https://github.com/DefinitelyTyped/DefinitelyTyped/blob/5299d372a220584e75a031c13b3d555607af13f8/types/node/globals.d.ts#l874"><code>process.exit(...)</code> in <code>@types/node</code></a> is specified to return <code>never</code>.
ru: Цель любой функции, которая <code>never</code> возвращает, состоит в том, чтобы она никогда не возвращалась. Он указывает на то, что возникло исключение, возникла ошибка остановки или что программа завершилась. Например, <a href="https://github.com/DefinitelyTyped/DefinitelyTyped/blob/5299d372a220584e75a031c13b3d555607af13f8/types/node/globals.d.ts#l874"> <code>process.exit(...)</code> в <code>@types/node</code> </a> указано, чтобы <code>never</code> возвращать .
zh_cn: 这样做的目的的任何功能即恢复 <code>never</code> 是，它永远不会返回。它表明引发了异常，发生了暂停错误条件或程序已退出。例如，<a href="https://github.com/DefinitelyTyped/DefinitelyTyped/blob/5299d372a220584e75a031c13b3d555607af13f8/types/node/globals.d.ts#l874"> <code>process.exit(...)</code> 在 <code>@types/node</code> </a>被指定为返回 <code>never</code> 。

source: The interface <code>LabeledValue</code> is a name we can now use to describe the requirement in the previous example. It still represents having a single property called <code>label</code> that is of type <code>string</code>. Notice we didn&rsquo;t have to explicitly say that the object we pass to <code>printLabel</code> implements this interface like we might have to in other languages. Here, it&rsquo;s only the shape that matters. If the object we pass to the function meets the requirements listed, then it&rsquo;s allowed.
ru: Интерфейс <code>LabeledValue</code> - это имя, которое мы теперь можем использовать для описания требования в предыдущем примере. Он по-прежнему представляет собой одно свойство, называемое <code>label</code> которое имеет тип <code>string</code> . Обратите внимание, что нам не нужно было явно <code>printLabel</code> что объект, который мы передаем printLabel, реализует этот интерфейс, как это могло бы потребоваться в других языках. Здесь имеет значение только форма. Если объект, который мы передаем функции, соответствует перечисленным требованиям, то это разрешено.
zh_cn: 接口 <code>LabeledValue</code> 是一个名称，我们现在可以在前面的示例中使用它来描述需求。它仍然代表具有单一属性调用 <code>label</code> 就是类型的 <code>string</code> 。请注意，我们不必明确地说传递给 <code>printLabel</code> 的对象可以像使用其他语言一样实现此接口。在这里，只有形状很重要。如果我们传递给该函数的对象满足列出的要求，则允许它。

source: The key difference is not in the syntax, but in the semantics, which we&rsquo;ll now dive into.
ru: Ключевое различие не в синтаксисе, а в семантике, в которую мы сейчас углубимся.
zh_cn: 关键的区别不在于语法，而在于语义，我们现在将深入探讨语义。

source: The last element of a tuple type can be a rest element of the form <code>...X</code>, where <code>X</code> is an array type. A rest element indicates that the tuple type is open-ended and may have zero or more additional elements of the array element type. For example, <code>[number, ...string[]]</code> means tuples with a <code>number</code> element followed by any number of <code>string</code> elements.
ru: Последний элемент кортежного типа может быть остальным элементом формы <code>...X</code> , где <code>X</code> - это тип массива. Элемент rest указывает, что тип кортежа является открытым и может иметь ноль или более дополнительных элементов типа элемента массива. Например, <code>[number, ...string[]]</code> средства кортежи с <code>number</code> элемента с последующим любым количеством <code>string</code> элементов.
zh_cn: 元组类型的最后一个元素可以是 <code>...X</code> 形式的rest元素，其中 <code>X</code> 是数组类型。rest元素表示元组类型是开放式的，并且可能具有零个或多个数组元素类型的其他元素。例如， <code>[number, ...string[]]</code> 表示元组，其 <code>number</code> 元素后跟任意数量的 <code>string</code> 元素。

source: The layout of your declaration files should mirror the layout of the library.
ru: Макет файлов деклараций должен отражать макет библиотеки.
zh_cn: 你的声明文件的布局应该反映库的布局。

source: The library can then be used as an import within modules:
ru: Библиотека затем может быть использована как импорт внутри модулей:
zh_cn: 然后,该库可以作为模块内的导入使用。

source: The list below outlines which constructs are currently supported when using JSDoc annotations to provide type information in JavaScript files.
ru: В приведенном ниже списке описано,какие конструкции в настоящее время поддерживаются при использовании аннотаций JSDoc для предоставления информации о типах в JavaScript-файлах.
zh_cn: 下面的列表概述了当使用JSDoc注释在JavaScript文件中提供类型信息时,目前支持哪些构造。

source: The locale to use to show error messages, e.g. en-us.
ru: Локаль,используемая для отображения сообщений об ошибках,например,en-us.
zh_cn: 显示错误信息所使用的语言,例如:en-us。

source: The majority of this handbook uses <code>let</code> declarations.
ru: В большинстве случаев в этом справочнике используются объявления <code>let</code> .
zh_cn: 本手册大部分使用 <code>let</code> 声明。

source: The maximum dependency depth to search under node_modules and load JavaScript files. Only applicable with <code>--allowJs</code>.
ru: Максимальная глубина зависимости для поиска в node_modules и загрузки файлов JavaScript. Применимо только с <code>--allowJs</code> .
zh_cn: 在node_modules下搜索并加载JavaScript文件的最大依赖深度。仅适用于 <code>--allowJs</code> 。

source: The meaning is usually the same, or a superset, of the meaning of the tag given at usejsdoc.org. The code below describes the differences and gives some example usage of each tag.
ru: Обычно значение тэга,заданного в usejsdoc.org,одно и то же,или суперсет,что и значение тэга.Нижеприведенный код описывает различия и приводит некоторые примеры использования каждого тега.
zh_cn: 其含义通常与 usejsdoc.org 给出的标签的含义相同或超集。下面的代码描述了每个标签的不同之处,并给出了一些使用示例。

source: The module name is resolved the same way as module specifiers in <code>import</code>/<code>export</code>. See <a href="modules">Modules</a> for more information. Then the declarations in an augmentation are merged as if they were declared in the same file as the original.
ru: Имя модуля разрешается так же, как спецификаторы модуля при <code>import</code> / <code>export</code> . См. <a href="modules">Модули</a> для получения дополнительной информации. Затем объявления в дополнении объединяются, как если бы они были объявлены в том же файле, что и оригинал.
zh_cn: 模块名称的解析与 <code>import</code> / <code>export</code> 模块说明符相同。有关更多信息，请参见<a href="modules">模块</a>。然后，将扩充中的声明合并，就好像它们是在与原始声明相同的文件中声明的一样。

source: The module support in Javascript is much more syntactically forgiving than Typescript&rsquo;s module support. Most combinations of assignments and declarations are supported.
ru: Поддержка модулей в Javascript гораздо более проста с синтаксической точки зрения, чем поддержка модулей в Typescript. Поддерживается большинство комбинаций присваиваний и объявлений.
zh_cn: 与Typescript的模块支持相比，Javascript中的模块支持在语法上更宽容。支持分配和声明的大多数组合。

source: The most basic datatype is the simple true/false value, which JavaScript and TypeScript call a <code>boolean</code> value.
ru: Самый простой тип данных - это простое значение true / false, которое JavaScript и TypeScript называют <code>boolean</code> значением.
zh_cn: 最基本的数据类型是简单的true / false值，JavaScript和TypeScript将该值称为 <code>boolean</code> 值。

source: The most impactful outcome of this feature might a bit subtle: with TypeScript 3.7, users can write libraries in JSDoc annotated JavaScript and support TypeScript users.
ru: Наиболее впечатляющий результат этой возможности может быть несколько неуловимым:с помощью TypeScript 3.7,пользователи могут писать библиотеки на JavaScript с аннотациями JSDoc и поддерживать пользователей TypeScript.
zh_cn: 这个功能的最有影响的结果可能有点微妙:通过TypeScript 3.7,用户可以用JSDoc注释的JavaScript编写库,并支持TypeScript用户。

source: The motivating example is the common pattern of a function that takes a callback and invokes it with some predictable (to the programmer) but unknown (to the type system) number of arguments:
ru: Мотивирующим примером является общий шаблон функции,которая принимает обратный вызов и вызывает его с каким-то предсказуемым (для программиста),но неизвестным (для системы типов)количеством аргументов:
zh_cn: 这个激励性的例子是一个函数的常见模式,它接受一个回调并调用它的一些可预测(对程序员来说)但未知(对类型系统来说)的参数数。

source: The name of a module augmentation is resolved using the same set of rules as module specifiers in <code>import</code> and <code>export</code> declarations. The declarations in a module augmentation are merged with any existing declarations the same way they would if they were declared in the same file.
ru: Имя расширения модуля определяется с использованием того же набора правил, что и спецификаторы модуля в объявлениях <code>import</code> и <code>export</code> . Объявления в дополнении модуля объединяются с любыми существующими объявлениями так же, как если бы они были объявлены в одном файле.
zh_cn: 使用与 <code>import</code> 和 <code>export</code> 声明中的模块说明符相同的规则集来解析模块扩充的名称。模块扩充中的声明将与任何现有声明合并，就像它们在同一文件中声明一样。

source: The name of the member.
ru: Имя члена.
zh_cn: 委员的姓名;
