Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/typescript/typescript.*.003.xlf
Languages: es, ko, ru, zh_cn

source: Non-function members of the interfaces should be unique. If they are not unique, they must be of the same type. The compiler will issue an error if the interfaces both declare a non-function member of the same name, but of different types.
es: Los miembros no funcionales de las interfaces deben ser únicos.Si no son únicos,deben ser del mismo tipo.El compilador emitirá un error si ambas interfaces declaran un miembro no funcional del mismo nombre,pero de tipos diferentes.
ko: 인터페이스의 비 기능 구성원은 고유해야합니다. 고유하지 않은 경우 동일한 유형이어야합니다. 인터페이스가 모두 같은 이름이지만 기능이 다른 유형의 함수가 아닌 멤버를 선언하면 컴파일러에서 오류가 발생합니다.

source: Non-generic spread expressions continue to be processed as before: Call and construct signatures are stripped, only non-method properties are preserved, and for properties with the same name, the type of the rightmost property is used. This contrasts with intersection types which concatenate call and construct signatures, preserve all properties, and intersect the types of properties with the same name. Thus, spreads of the same types may produce different results when they are created through instantiation of generic types:
es: Las expresiones de difusión no genéricas siguen procesándose como antes:Las firmas de llamada y construcción son despojadas,sólo se conservan las propiedades no genéricas,y para las propiedades con el mismo nombre,se utiliza el tipo de la propiedad más derecha.Esto contrasta con los tipos de intersección que concatenan las firmas de llamada y construcción,preservan todas las propiedades,e intersecan los tipos de propiedades con el mismo nombre.Por lo tanto,las dispersiones de los mismos tipos pueden producir resultados diferentes cuando se crean a través de la instanciación de tipos genéricos:
ko: 제네릭이 아닌 스프레드 식은 이전과 같이 계속 처리됩니다. 호출 및 구문 서명이 제거되고 메서드가 아닌 속성 만 보존되며 이름이 같은 속성의 경우 가장 오른쪽 속성 유형이 사용됩니다. 이는 호출을 연결하고 서명을 구성하고 모든 속성을 유지하며 동일한 이름의 속성 유형을 교차시키는 교차 유형과 대조됩니다. 따라서 동일한 유형의 스프레드는 일반 유형의 인스턴스화를 통해 생성 될 때 다른 결과를 생성 할 수 있습니다.

source: Non-homomorphic types are essentially creating new properties, so they can&rsquo;t copy property modifiers from anywhere.
es: Los tipos no homom&oacute;rficos est&aacute;n creando esencialmente nuevas propiedades, por lo que no pueden copiar modificadores de propiedades desde cualquier lugar.
ko: 동형이 아닌 유형은 본질적으로 새로운 속성을 생성하므로 어디서나 속성 수정자를 복사 할 수 없습니다.

source: Non-null and non-undefined type guards
es: Guardias de tipo no nulo y no definido
ko: 널이 아닌 및 정의되지 않은 유형 가드

source: Non-null and non-undefined type guards may use the <code>==</code>, <code>!=</code>, <code>===</code>, or <code>!==</code> operator to compare to <code>null</code> or <code>undefined</code>, as in <code>x != null</code> or <code>x === undefined</code>. The effects on subject variable types accurately reflect JavaScript semantics (e.g. double-equals operators check for both values no matter which one is specified whereas triple-equals only checks for the specified value).
es: No nulo y los guardias de tipo no indefinidos pueden utilizar el <code>==</code> , <code>!=</code> , <code>===</code> , o <code>!==</code> operador para comparar con <code>null</code> o <code>undefined</code> , como en <code>x != null</code> o <code>x === undefined</code> . Los efectos sobre los tipos de variables de sujeto reflejan con precisi&oacute;n la sem&aacute;ntica de JavaScript (por ejemplo, los operadores de doble igual verifican ambos valores sin importar cu&aacute;l se especifique, mientras que triple-igual solo verifica el valor especificado).
ko: 비 - 널 및 사용할 수있는 비 미정 형 가드 <code>==</code> , <code>!=</code> , <code>===</code> 또는 <code>!==</code> 연산자 비교할 <code>null</code> 또는 <code>undefined</code> 같이 <code>x != null</code> 또는 <code>x === undefined</code> . 주제 변수 유형에 미치는 영향은 JavaScript 의미를 정확하게 반영합니다 (예 : 이중 같음 연산자는 지정된 값에 상관없이 두 값을 모두 확인하지만 삼중 같음은 지정된 값만 확인).

source: Non-null assertion operator
es: Operador de afirmación no nula
ko: 널이 아닌 어설 션 연산자

source: Non-nullable types have no meaning and are treated just as their original type:
es: Los tipos no anulables no tienen ningún significado y son tratados como su tipo original:
ko: 널 입력 불가능 유형은 의미가 없으며 원래 유형으로 취급됩니다.

source: Non-unit types as union discriminants
es: Los tipos no unitarios como discriminantes sindicales
ko: 노동 조합 차별 자로서의 비 단위 유형

source: Normally the compiler will attempt to resolve all module imports before it starts the compilation process. Every time it successfully resolves an <code>import</code> to a file, the file is added to the set of files the compiler will process later on.
es: Normalmente, el compilador intentar&aacute; resolver todas las importaciones de m&oacute;dulos antes de iniciar el proceso de compilaci&oacute;n. Cada vez que resuelve con &eacute;xito una <code>import</code> aci&oacute;n a un archivo, el archivo se agrega al conjunto de archivos que el compilador procesar&aacute; m&aacute;s adelante.
ko: 일반적으로 컴파일러는 컴파일 프로세스를 시작하기 전에 모든 모듈 가져 오기를 해결하려고 시도합니다. 파일 로 <code>import</code> 가 성공적으로 해결 될 때마다 파일은 컴파일러가 나중에 처리 할 파일 세트에 추가됩니다.

source: Normally, <code>tsc</code> will produce outputs (<code>.js</code> and <code>.d.ts</code>) in the presence of syntax or type errors, unless <code>noEmitOnError</code> is on. Doing this in an incremental build system would be very bad - if one of your out-of-date dependencies had a new error, you&rsquo;d only see it <em>once</em> because a subsequent build would skip building the now up-to-date project. For this reason, <code>tsc -b</code> effectively acts as if <code>noEmitOnError</code> is enabled for all projects.
es: Normalmente, <code>tsc</code> producir&aacute; salidas ( <code>.js</code> y <code>.d.ts</code> ) en presencia de errores de sintaxis o tipo, a menos que <code>noEmitOnError</code> est&eacute; activado . Hacer esto en un sistema de compilaci&oacute;n incremental ser&iacute;a muy malo: si una de sus dependencias desactualizadas tuviera un nuevo error, solo lo ver&iacute;a <em>una vez</em> porque una compilaci&oacute;n posterior omitir&iacute;a la compilaci&oacute;n del proyecto ahora actualizado. Por esta raz&oacute;n, <code>tsc -b</code> act&uacute;a efectivamente como si <code>noEmitOnError</code> estuviera habilitado para todos los proyectos.
ko: 일반적으로, <code>tsc</code> (출력을 생산할 예정 <code>.js</code> 및 <code>.d.ts</code> 을 하지 않는 구 타입 또는 에러의 존재 하에서) <code>noEmitOnError</code> 가 에있다. 증분 빌드 시스템에서이 작업을 수행하는 것은 매우 나쁩니다. 오래된 종속성 중 하나에 새로운 오류가 발생 하면 후속 빌드에서 최신 프로젝트 빌드를 건너 뛰기 때문에 <em>한 번만</em> 보게됩니다 . 이러한 이유로 <code>tsc -b</code> 는 모든 프로젝트에 대해 <code>noEmitOnError</code> 가 활성화 된 것처럼 효과적으로 작동 합니다.

source: Normally, TypeScript would return silently on success.
ko: 일반적으로 TypeScript는 성공하면 조용히 반환됩니다.

source: Not all merges are allowed in TypeScript. Currently, classes can not merge with other classes or with variables. For information on mimicking class merging, see the <a href="mixins">Mixins in TypeScript</a> section.
es: No todas las combinaciones est&aacute;n permitidas en TypeScript. Actualmente, las clases no se pueden fusionar con otras clases o con variables. Para obtener informaci&oacute;n sobre c&oacute;mo imitar la combinaci&oacute;n de clases, consulte la secci&oacute;n <a href="mixins">Mixins en TypeScript</a> .
ko: TypeScript에서 모든 병합이 허용되는 것은 아닙니다. 현재 클래스는 다른 클래스 또는 변수와 병합 할 수 없습니다. 클래스 병합 모방에 대한 정보 <a href="mixins">는 TypeScript의 믹스 인</a> 섹션을 참조하십시오 .

source: Not all properties of an interface may be required. Some exist under certain conditions or may not be there at all. These optional properties are popular when creating patterns like &ldquo;option bags&rdquo; where you pass an object to a function that only has a couple of properties filled in.
es: Es posible que no se requieran todas las propiedades de una interfaz. Algunos existen bajo ciertas condiciones o pueden no estar all&iacute; en absoluto. Estas propiedades opcionales son populares cuando se crean patrones como "bolsas de opciones" donde se pasa un objeto a una funci&oacute;n que solo tiene un par de propiedades completadas.
ko: 인터페이스의 모든 속성이 필요한 것은 아닙니다. 일부는 특정 조건 하에서 존재하거나 전혀 존재하지 않을 수 있습니다. 이러한 선택적 속성은&ldquo;옵션 백&rdquo;과 같은 패턴을 만들 때 자주 사용되며, 속성이 몇 개만 채워진 함수에 객체를 전달합니다.

source: Note any tags which are not explicitly listed below (such as <code>@async</code>) are not yet supported.
es: Tenga en cuenta que las etiquetas que no se enumeran expl&iacute;citamente a continuaci&oacute;n (como <code>@async</code> ) a&uacute;n no son compatibles.
ko: 아래에 명시 적으로 나열되지 않은 태그 (예 : <code>@async</code> )는 아직 지원되지 않습니다.

source: Note that <code>@enum</code> is quite different from, and much simpler than, TypeScript&rsquo;s <code>enum</code>. However, unlike TypeScript&rsquo;s enums, <code>@enum</code> can have any type:
ko: 참고 <code>@enum</code> 는 상당히 다른, 그리고, 타이프 라이터의 것보다 훨씬 간단 <code>enum</code> . 그러나, 타이프 라이터의 열거는 달리, <code>@enum</code> 는 모든 유형을 가질 수 있습니다 :

source: Note that <code>@enum</code> is quite different from, and much simpler than, Typescript&rsquo;s <code>enum</code>. However, unlike Typescript&rsquo;s enums, <code>@enum</code> can have any type:
es: Tenga en cuenta que <code>@enum</code> es bastante diferente y mucho m&aacute;s simple que la <code>enum</code> eraci&oacute;n de Typecript . Sin embargo, a diferencia de las enumeraciones de Typecript, <code>@enum</code> puede tener cualquier tipo:
ko: 참고 <code>@enum</code> 는 상당히 다른, 그리고, 타이프 라이터의 것보다 훨씬 간단 <code>enum</code> . 그러나 Typescript의 열거 형과 달리 <code>@enum</code> 은 모든 유형을 가질 수 있습니다.

source: Note that <code>@extends</code> only works with classes. Currently, there is no way for a constructor function extend a class.
es: Tenga en cuenta que <code>@extends</code> solo funciona con clases. Actualmente, no hay forma de que una funci&oacute;n constructora extienda una clase.
ko: 참고 <code>@extends</code> 는 클래스 만 작동합니다. 현재 생성자 함수가 클래스를 확장 할 수있는 방법이 없습니다.

source: Note that <code>Readonly&lt;T&gt;</code> and <code>Partial&lt;T&gt;</code> are so useful, they are included in TypeScript&rsquo;s standard library along with <code>Pick</code> and <code>Record</code>:
es: Tenga en cuenta que <code>Readonly&lt;T&gt;</code> y <code>Partial&lt;T&gt;</code> son tan &uacute;tiles que se incluyen en la biblioteca est&aacute;ndar de TypeScript junto con <code>Pick</code> and <code>Record</code> :
ko: 참고 <code>Readonly&lt;T&gt;</code> 와 <code>Partial&lt;T&gt;</code> , 그들과 함께 타이프의 표준 라이브러리에 매우 유용하게 포함되어 있습니다 <code>Pick</code> 및 <code>Record</code> :

source: Note that <code>keyof any</code> represents the type of any value that can be used as an index to an object. In otherwords, <code>keyof any</code> is currently equal to <code>string | number | symbol</code>.
ko: 참고 <code>keyof any</code> 물체에 대한 인덱스로서 이용 될 수있는 값의 종류를 나타낸다. 즉, <code>keyof any</code> 는 현재 <code>string | number | symbol</code> .

source: Note that <code>y</code> has an extra <code>location</code> property, but this does not create an error. Only members of the target type (<code>Named</code> in this case) are considered when checking for compatibility.
es: Tenga en cuenta que <code>y</code> tiene una propiedad de <code>location</code> adicional , pero esto no crea un error. Solo los miembros del tipo de destino ( <code>Named</code> en este caso) se consideran al verificar la compatibilidad.
ko: 참고 것을 <code>y</code> 추가가 <code>location</code> 속성을하지만,이 오류를 생성하지 않습니다. 호환성을 확인할 때는 대상 유형 ( 이 경우 <code>Named</code> 의 멤버 만 고려됩니다.

source: Note that TypeScript treats <code>null</code> and <code>undefined</code> differently in order to match JavaScript semantics. <code>string | null</code> is a different type than <code>string | undefined</code> and <code>string | undefined | null</code>.
es: Tenga en cuenta que TypeScript trata los valores <code>null</code> y <code>undefined</code> diferente para que coincida con la sem&aacute;ntica de JavaScript. <code>string | null</code> es un tipo diferente a <code>string | undefined</code> y <code>string | undefined | null</code> .
ko: TypeScript는 JavaScript 의미와 일치시키기 위해 <code>null</code> 과 <code>undefined</code> 를 다르게 처리합니다 . <code>string | null</code> 은 <code>string | undefined</code> 과 다른 유형입니다. | 정의 및 <code>string | undefined | null</code> .

source: Note that TypeScript will never write an output file to a directory outside of <code>outDir</code>, and will never skip emitting a file. For this reason, <code>rootDir</code> also enforces that all files which need to be emitted are underneath the <code>rootDir</code> path.
ko: 타이프 라이터가의 디렉토리 외부로 출력 파일 쓰기하지 않습니다 <code>outDir</code> 하고 파일을 발광 건너하지 않습니다. 이러한 이유로 <code>rootDir</code> 는 내 보내야 하는 모든 파일이 <code>rootDir</code> 경로 아래에 있도록 강제합니다 .

source: Note that as with <code>tsconfig.json</code> / <code>-p</code>, existing TypeScript project properties will not be respected - all settings should be managed using your tsconfig file.
es: Tenga en cuenta que, al igual que con <code>tsconfig.json</code> / <code>-p</code> , no se respetar&aacute;n las propiedades del proyecto TypeScript existente; todas las configuraciones deben administrarse utilizando su archivo tsconfig.
ko: <code>tsconfig.json</code> / <code>-p</code> 와 마찬가지로 기존 TypeScript 프로젝트 속성은 고려되지 않으며 모든 설정은 tsconfig 파일을 사용하여 관리해야합니다.

source: Note that calling a method on a numeric literal requires it to be in parentheses to aid the parser.
ko: 숫자 리터럴에서 메서드를 호출하려면 구문 분석기를 지원하기 위해 괄호 안에 있어야합니다.

source: Note that functions and arrays are objects at runtime, but have their own predicates.
ko: 함수와 배열은 런타임에 객체이지만 자체 조건자가 있습니다.

source: Note that global variables declared with <code>let</code> and <code>const</code> don&rsquo;t show up on <code>globalThis</code>.
es: Tenga en cuenta que las variables globales declaradas con <code>let</code> y <code>const</code> no aparecen en <code>globalThis</code> .
ko: <code>let</code> 과 <code>const</code> 로 선언 된 전역 변수는 <code>globalThis</code> 에 표시되지 않습니다 .

source: Note that if <code>bar</code> is <code>null</code> or <code>undefined</code>, our code will still hit an error accessing <code>baz</code>. Likewise, if <code>baz</code> is <code>null</code> or <code>undefined</code>, we&rsquo;ll hit an error at the call site. <code>?.</code> only checks for whether the value on the <em>left</em> of it is <code>null</code> or <code>undefined</code> - not any of the subsequent properties.
es: Tenga en cuenta que si <code>bar</code> es <code>null</code> o <code>undefined</code> , nuestro c&oacute;digo seguir&aacute; mostrando un error al acceder a <code>baz</code> . Del mismo modo, si <code>baz</code> es <code>null</code> o <code>undefined</code> , encontraremos un error en el sitio de la llamada. <code>?.</code> solo comprueba si el valor a la <em>izquierda</em> es <code>null</code> o <code>undefined</code> , no ninguna de las propiedades posteriores.
ko: 참고 경우 것이 <code>bar</code> 있다 <code>null</code> 또는 <code>undefined</code> , 우리의 코드는 여전히 액세스 할 경우에 에러 칠 것이다 <code>baz</code> . 마찬가지로 <code>baz</code> 가 <code>null</code> 또는 <code>undefined</code> 인 경우 호출 사이트에서 오류가 발생합니다. <code>?.</code> <em>왼쪽</em> 의 값 이 <code>null</code> 인지 <code>undefined</code> 않은지 여부 만 확인 하며 후속 속성은 없습니다.

source: Note that in <code>--strictNullChecks</code> mode, when a homomorphic mapped type removes a <code>?</code> modifier from a property in the underlying type it also removes <code>undefined</code> from the type of that property:
es: Tenga en cuenta que en el modo <code>--strictNullChecks</code> , cuando un tipo mapeado homom&oacute;rfico elimina un <code>?</code> modificador de una propiedad en el tipo subyacente, tambi&eacute;n elimina <code>undefined</code> del tipo de esa propiedad:
ko: 에 있습니다 <code>--strictNullChecks</code> 모드, 호모 모르 픽 매핑 유형이 제거 <code>?</code> 기본 유형의 속성에서 수정 자 또한 해당 속성의 유형에서 <code>undefined</code> 을 제거 합니다.

source: Note that in TypeScript 1.4, when accessing an element outside the set of known indices, a union type is used instead:
es: Obsérvese que en TypeScript 1.4,cuando se accede a un elemento fuera del conjunto de índices conocidos,se utiliza en su lugar un tipo de unión:
ko: TypeScript 1.4에서는 알려진 인덱스 집합 외부의 요소에 액세스 할 때 공용체 유형이 대신 사용됩니다.

source: Note that in this example, we added a value to the <em>static</em> side of <code>C</code> (its constructor function). This is because we added a <em>value</em>, and the container for all values is another value (types are contained by namespaces, and namespaces are contained by other namespaces).
es: Tenga en cuenta que en este ejemplo, agregamos un valor al lado <em>est&aacute;tico</em> de <code>C</code> (su funci&oacute;n constructora). Esto se debe a que agregamos un <em>valor</em> , y el contenedor para todos los valores es otro valor (los tipos est&aacute;n contenidos por espacios de nombres y los espacios de nombres est&aacute;n contenidos por otros espacios de nombres).
ko: 이 예제에서는 <code>C</code> 의 <em>정적</em> 측 (생성자 함수)에 값을 추가했습니다 . 이는 <em>value를</em> 추가하고 모든 값의 컨테이너가 다른 값 이기 때문입니다 (유형은 네임 스페이스에 포함되고 네임 스페이스는 다른 네임 스페이스에 포함됨).<em></em>

source: Note that inference will work in any order, but intellisense will only work left-to-right, so TypeScript prefers to declare <code>map</code> with the array first:
ko: 추론은 어떤 순서로든 작동하지만 intellisense는 왼쪽에서 오른쪽으로 만 작동하므로 TypeScript는 먼저 배열로 <code>map</code> 을 선언하는 것을 선호합니다 .

source: Note that it&rsquo;s possible to define many types in the global scope when writing a global declaration file. We strongly discourage this as it leads to possible unresolvable name conflicts when many declaration files are in a project.
es: Tenga en cuenta que es posible definir muchos tipos en el &aacute;mbito global al escribir un archivo de declaraci&oacute;n global. Desaconsejamos encarecidamente esto, ya que conduce a posibles conflictos de nombres irresolubles cuando hay muchos archivos de declaraci&oacute;n en un proyecto.
ko: 전역 선언 파일을 작성할 때 전역 범위에서 많은 유형을 정의 할 수 있습니다. 많은 선언 파일이 프로젝트에있을 때 해결할 수없는 이름 충돌이 발생할 수 있으므로이 방법을 사용하지 않는 것이 좋습니다.

source: Note that parentheses are optional for union types.
es: Nótese que los paréntesis son opcionales para los tipos de unión.
ko: 괄호는 공용체 유형의 경우 선택 사항입니다.

source: Note that partial overlap is still permitted as long as the property types are valid.
es: Tenga en cuenta que la superposición parcial sigue estando permitida siempre y cuando los tipos de propiedad sean válidos.
ko: 속성 유형이 유효한 한 부분 오버랩이 여전히 허용됩니다.

source: Note that relative module imports are not impacted by setting the baseUrl, as they are always resolved relative to their importing files.
es: Tenga en cuenta que las importaciones de módulos relativos no se ven afectadas por la configuración de la baseUrl,ya que siempre se resuelven en relación con sus archivos de importación.
ko: 상대 모듈 가져 오기는 baseUrl을 설정해도 영향을받지 않습니다. 이는 항상 가져 오기 파일을 기준으로 해결되기 때문입니다.

source: Note that the <code>"typings"</code> field is synonymous with <code>"types"</code>, and could be used as well.
es: Tenga en cuenta que el campo <code>"typings"</code> es sin&oacute;nimo de <code>"types"</code> y tambi&eacute;n podr&iacute;a utilizarse.
ko: 있습니다 <code>"typings"</code> 필드의 대명사 <code>"types"</code> ,뿐만 아니라 사용될 수있다.

source: Note that the <code>function pickCard(x): any</code> piece is not part of the overload list, so it only has two overloads: one that takes an object and one that takes a number. Calling <code>pickCard</code> with any other parameter types would cause an error.
es: Tenga en cuenta que la <code>function pickCard(x): any</code> pieza no forma parte de la lista de sobrecargas, por lo que solo tiene dos sobrecargas: una que toma un objeto y otra que toma un n&uacute;mero. Llamar a <code>pickCard</code> con cualquier otro tipo de par&aacute;metro provocar&iacute;a un error.
ko: 그 주 <code>function pickCard(x): any</code> 목적을 얻어 하나의 숫자를 취 하나가 두 과부하를 갖도록 조각 과부하리스트의 일부가 아니다. 다른 매개 변수 유형으로 <code>pickCard</code> 를 호출 하면 오류가 발생합니다.

source: Note that the return type of <code>area</code> is inferred to be <code>number</code> because TypeScript knows the function is total. If some variant is not covered, the return type of <code>area</code> will be <code>number | undefined</code> instead.
ko: TypeScript는 함수가 총계임을 알고 있기 때문에 <code>area</code> 의 반환 유형은 <code>number</code> 로 추론됩니다 . 약간의 변형이 적용되지 않은 경우의 반환 형식 <code>area</code> 될 것입니다 <code>number | undefined</code> 대신 정의되지 않았습니다 .

source: Note that this collapsing should only occur when all overloads have the same return type.
es: Tenga en cuenta que este colapso sólo debe ocurrir cuando todas las sobrecargas tienen el mismo tipo de retorno.
ko: 이 붕괴는 모든 과부하가 동일한 반환 유형을 갖는 경우에만 발생합니다.

source: Note that this does not imply tuples represent immutable arrays, but it is an implied convention.
es: Tenga en cuenta que esto no implica que las tuplas representen matrices inmutables,sino que es una convención implícita.
ko: 이것은 튜플이 불변 배열을 나타내는 것은 아닙니다만, 이것은 암묵적인 규칙입니다.

source: Note that this is a breaking change for some code. If you need to resort to the original behavior in which tuples only enforce a minimum length, you can use a similar declaration that does not explicitly define a <code>length</code> property, falling back to <code>number</code>.
es: Tenga en cuenta que este es un cambio importante para algunos c&oacute;digos. Si necesita recurrir al comportamiento original en el que las tuplas solo imponen una longitud m&iacute;nima, puede usar una declaraci&oacute;n similar que no defina expl&iacute;citamente una propiedad de <code>length</code> , volviendo al <code>number</code> .
ko: 이것은 일부 코드의 주요 변경 사항입니다. 튜플이 최소 길이 만 적용하는 원래 동작에 의존해야하는 경우 <code>length</code> 속성을 명시 적으로 정의하지 않고 <code>number</code> 로 돌아가는 유사한 선언을 사용할 수 있습니다.

source: Note that this syntax describes a type rather than a member. If you want to add members, you can use an intersection type:
es: Nótese que esta sintaxis describe un tipo más que un miembro.Si quieres añadir miembros,puedes usar un tipo de intersección:
ko: 이 구문은 멤버가 아닌 유형을 설명합니다. 멤버를 추가하려는 경우 교차 유형을 사용할 수 있습니다.

source: Note that this unwrapping inference only works on homomorphic mapped types. If the mapped type is not homomorphic you&rsquo;ll have to give an explicit type parameter to your unwrapping function.
es: Tenga en cuenta que esta inferencia de desenvolvimiento solo funciona en tipos mapeados homom&oacute;rficos. Si el tipo mapeado no es homom&oacute;rfico, tendr&aacute; que dar un par&aacute;metro de tipo expl&iacute;cito a su funci&oacute;n de desenvolver.
ko: 이 언 래핑 추론은 동형 매핑 된 유형에서만 작동합니다. 매핑 된 형식이 동형이 아닌 경우 언 래핑 함수에 명시 적 형식 매개 변수를 제공해야합니다.

source: Note that using <code>export default</code> in your .d.ts files requires <a href="https://www.typescriptlang.org/tsconfig#esModuleInterop"><code>esModuleInterop: true</code></a> to work. If you can&rsquo;t have <code>esModuleInterop: true</code> in your project, such as when you&rsquo;re submitting a PR to Definitely Typed, you&rsquo;ll have to use the <code>export=</code> syntax instead. This older syntax is harder to use but works everywhere. Here&rsquo;s how the above example would have to be written using <code>export=</code>:
ko: .d.ts 파일에서 <code>export default</code> 을 사용 하려면 <a href="https://www.typescriptlang.org/tsconfig#esModuleInterop"> <code>esModuleInterop: true</code> </a> 가 작동해야합니다. 프로젝트에서 <code>esModuleInterop: true</code> 를 사용할 수없는 경우 ( 예 : Definitely Typed에 PR을 제출하는 경우) 대신 <code>export=</code> 구문 을 사용해야합니다 . 이 오래된 구문은 사용하기가 더 어렵지만 모든 곳에서 작동합니다. 다음은 <code>export=</code> 사용하여 위의 예를 작성하는 방법입니다 .

source: Note that we cannot add to type aliases (<code>type s = string;</code>) using an interface.
es: Tenga en cuenta que no podemos agregar alias de <code>type s = string;</code> ( tipo s = cadena; ) usando una interfaz.
ko: 인터페이스를 사용하여 유형 별칭 ( <code>type s = string;</code> )에 추가 할 수 없습니다 .
