Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/typescript/typescript.*.003.xlf
Languages: es, ko, ru, zh_cn

source: The new <code>--showConfig</code> flag
ru: Новый флаг <code>--showConfig</code>
zh_cn: 新的 <code>--showConfig</code> 标志

source: The new <code>--strict</code> compiler option represents the recommended setting of a number of type checking options. Specifically, specifying <code>--strict</code> corresponds to specifying all of the following options (and may in the future include more options):
ru: Новая <code>--strict</code> компилятора --strict представляет собой рекомендуемую настройку ряда опций проверки типов. В частности, указание <code>--strict</code> соответствует указанию всех следующих параметров (и в будущем может включать дополнительные параметры):
zh_cn: 新的 <code>--strict</code> 编译器选项代表建议的许多类型检查选项设置。具体来说，指定 <code>--strict</code> 对应于指定以下所有选项（将来可能会包括更多选项）：

source: The new <code>amd-dependency name</code> property allows passing an optional name for an amd-dependency:
ru: Новое свойство <code>amd-dependency name</code> позволяет передавать необязательное имя для amd-зависимости:
zh_cn: 新的 <code>amd-dependency name</code> 属性允许为amd依赖项传递可选名称：

source: The new <code>amd-module name</code> tag allows passing an optional module name to the compiler:
ru: Новый тег <code>amd-module name</code> позволяет передавать компилятору необязательное имя модуля:
zh_cn: 新的 <code>amd-module name</code> 标记允许将可选的模块名称传递给编译器：

source: The new <code>protected</code> modifier in classes works like it does in familiar languages like C++, C#, and Java. A <code>protected</code> member of a class is visible only inside subclasses of the class in which it is declared:
ru: Новый модификатор <code>protected</code> в классах работает так же, как и в знакомых языках, таких как C ++, C # и Java. <code>protected</code> член класса виден только внутри подклассов класса , в котором он заявил:
zh_cn: 类中新的 <code>protected</code> 修饰符的工作方式与在C ++，C＃和Java等熟悉的语言中一样。类的 <code>protected</code> 成员仅在声明它的类的子类内部可见：

source: The new ES6 keyword <code>let</code>, now supported in TypeScript, declares a variable with more intuitive &ldquo;block&rdquo; semantics. A <code>let</code> variable can only be referred to after its declaration, and is scoped to the syntactic block where it is defined:
ru: Новое ключевое слово ES6 <code>let</code> , теперь поддерживаемое в TypeScript, объявляет переменную с более интуитивной &laquo;блочной&raquo; семантикой. На переменную <code>let</code> можно ссылаться только после ее объявления, она ограничена синтаксическим блоком, в котором она определена:
zh_cn: 现在，TypeScript支持新的ES6关键字 <code>let</code> ，以更直观的&ldquo;块&rdquo;语义声明变量。甲 <code>let</code> 变量只能其声明之后称为，并且可以被限制在那里它被定义句法块：

source: The new factory name will be used to call <code>createElement</code> and <code>__spread</code> functions.
ru: Новое имя фабрики будет использоваться для вызова функций <code>createElement</code> и <code>__spread</code> .
zh_cn: 新的工厂名称将用于调用 <code>createElement</code> 和 <code>__spread</code> 函数。

source: The new features are designed such that they can be used in both strict null checking mode and regular type checking mode. In particular, the <code>null</code> and <code>undefined</code> types are automatically erased from union types in regular type checking mode (because they are subtypes of all other types), and the <code>!</code> non-null assertion expression operator is permitted but has no effect in regular type checking mode. Thus, declaration files that are updated to use null- and undefined-aware types can still be used in regular type checking mode for backwards compatibility.
ru: Новые функции разработаны таким образом, что их можно использовать как в режиме строгой проверки нуля, так и в режиме обычной проверки типа. В частности, <code>null</code> и <code>undefined</code> типы автоматически удаляются из типов объединения в обычном режиме проверки типов (поскольку они являются подтипами всех других типов), а символ <code>!</code> Ненулевой оператор выражения утверждения разрешен, но не действует в режиме проверки обычного типа. Таким образом, файлы объявлений, которые обновлены для использования типов, поддерживающих значения null и undefined, могут по-прежнему использоваться в обычном режиме проверки типов для обеспечения обратной совместимости.
zh_cn: 新功能的设计使其可以在严格的null检查模式和常规类型检查模式下使用。特别是，在常规类型检查模式下，会从联合类型中自动删除 <code>null</code> 和 <code>undefined</code> 类型的类型（因为它们是所有其他类型的子类型），而 <code>!</code> 则是！允许使用非null断言表达式运算符，但在常规类型检查模式下无效。因此，为了向后兼容，仍可以在常规类型检查模式下使用更新为使用可识别null和undefined的类型的声明文件。

source: The new implementation also brings performance enhancements to watching in tsserver. The watcher logic has been completely rewritten to respond faster to change events.
ru: Новое внедрение также приносит повышение производительности для просмотра в tsserver.Логика наблюдателя была полностью переписана,чтобы быстрее реагировать на изменяющиеся события.
zh_cn: 新的实现也为tsserver中的监视带来了性能提升。观察者逻辑已被完全重写,以更快地响应变化事件。

source: The new module <code>ProgrammerCalculator</code> exports an API shape similar to that of the original <code>Calculator</code> module, but does not augment any objects in the original module. Here is a test for our ProgrammerCalculator class:
ru: Новый модуль <code>ProgrammerCalculator</code> экспортирует форму API, аналогичную форме исходного модуля <code>Calculator</code> , но не увеличивает какие-либо объекты в исходном модуле. Вот тест для нашего класса ProgrammerCalculator:
zh_cn: 新模块 <code>ProgrammerCalculator</code> 导出的API形状类似于原始 <code>Calculator</code> 模块的API形状，但不扩展原始模块中的任何对象。这是我们的ProgrammerCalculator类的测试：

source: The new playground now supports many new options including:
ru: Новая игровая площадка теперь поддерживает много новых опций,в том числе:
zh_cn: 新的游乐场现在支持很多新的选择,包括。

source: The nightlies are available on <a href="https://www.myget.org/gallery/typescript-preview">www.myget.org</a>.
ru: <a href="https://www.myget.org/gallery/typescript-preview">Ночные клубы</a> доступны на www.myget.org .
zh_cn: 夜间活动可在<a href="https://www.myget.org/gallery/typescript-preview">www.myget.org</a>上获得。

source: The nightly build currently does not include the full plugin setup, but we are working on publishing an installer on a nightly basis as well.
ru: Ночная сборка в настоящее время не включает в себя полную настройку плагина,но мы также работаем над публикацией программы установки на ночной основе.
zh_cn: 夜间构建目前不包括完整的插件设置,但我们正在努力在夜间的基础上发布一个安装程序。

source: The old behavior still remains the same if given a directory - the compiler will try to find a file in the directory named <code>tsconfig.json</code>.
ru: Старое поведение остается прежним, если задан каталог - компилятор попытается найти файл в каталоге с именем <code>tsconfig.json</code> .
zh_cn: 如果给定目录，旧行为仍然保持不变-编译器将尝试在名为 <code>tsconfig.json</code> 的目录中查找文件。

source: The order of specifying spread operations determines what properties end up in the resulting object; properties in later spreads &ldquo;win out&rdquo; over previously created properties.
ru: Порядок указания операций распространения определяет, какие свойства в конечном итоге будут в результирующем объекте; свойства в более поздних спредах &laquo;побеждают&raquo; ранее созданные свойства.
zh_cn: 指定散布操作的顺序决定了最终对象中将包含哪些属性。稍后的属性将&ldquo;赢得&rdquo;以前创建的属性。

source: The ordinal index of the parameter in the function&rsquo;s parameter list.
ru: Порядковый индекс параметра в списке параметров функции.
zh_cn: 函数的参数列表中参数的序号索引。

source: The other change is that enum types themselves effectively become a <em>union</em> of each enum member. While we haven&rsquo;t discussed <a href="advanced-types#union-types">union types</a> yet, all that you need to know is that with union enums, the type system is able to leverage the fact that it knows the exact set of values that exist in the enum itself. Because of that, TypeScript can catch silly bugs where we might be comparing values incorrectly. For example:
ru: Другое изменение заключается в том, что сами типы перечисления фактически становятся <em>объединением</em> каждого члена перечисления. Хотя мы еще не обсуждали <a href="advanced-types#union-types">типы объединений</a> , все, что вам нужно знать, это то, что с перечислениями объединений система типов может использовать тот факт, что она знает точный набор значений, которые существуют в самом перечислении. Из-за этого TypeScript может отлавливать глупые ошибки, когда мы можем неправильно сравнивать значения. Например:
zh_cn: 另一个变化是，枚举类型本身有效地成为<em>联合</em>各枚举成员。尽管我们还没有讨论<a href="advanced-types#union-types">联合类型，</a>但是您只需要知道联合枚举，类型系统就可以利用这一事实，即它知道枚举本身中存在的确切值集。因此，TypeScript可以捕获愚蠢的错误，在这些错误中我们可能会错误地比较值。例如：

source: The other new ES6 declaration type supported in TypeScript is <code>const</code>. A <code>const</code> variable may not be assigned to, and must be initialized where it is declared. This is useful for declarations where you don&rsquo;t want to change the value after its initialization:
ru: Другой новый тип объявления ES6, поддерживаемый в TypeScript, - это <code>const</code> . <code>const</code> переменная не может быть назначен, и должен быть инициализирован , где она объявлена. Это полезно для объявлений, в которых вы не хотите изменять значение после его инициализации:
zh_cn: TypeScript支持的另一种新的ES6声明类型是 <code>const</code> 。甲 <code>const</code> 变量可以不被分配给，并且在声明必须初始化。这对于在初始化后不想更改值的声明很有用：

source: The other type of assertion signature doesn&rsquo;t check for a condition, but instead tells TypeScript that a specific variable or property has a different type.
ru: Другой тип подписи утверждения не проверяет условие, а вместо этого сообщает TypeScript, что конкретная переменная или свойство имеет другой тип.
zh_cn: 断言签名的另一种类型不检查条件，而是告诉TypeScript特定的变量或属性具有不同的类型。

source: The popular library D3 defines its functionality in a global object called <code>d3</code>. Because this library is loaded through a <code>&lt;script&gt;</code> tag (instead of a module loader), its declaration uses namespaces to define its shape. For the TypeScript compiler to see this shape, we use an ambient namespace declaration. For example, we could begin writing it as follows:
ru: Популярная библиотека D3 определяет свои функции в глобальном объекте <code>d3</code> . Поскольку эта библиотека загружается через <code>&lt;script&gt;</code> (вместо загрузчика модуля), ее объявление использует пространства имен для определения ее формы. Чтобы компилятор TypeScript увидел эту фигуру, мы используем объявление внешнего пространства имен. Например, мы могли бы начать писать так:
zh_cn: 流行的库D3在名为 <code>d3</code> 的全局对象中定义其功能。由于此库是通过 <code>&lt;script&gt;</code> 标记（而不是模块加载器）加载的，因此其声明使用名称空间定义其形状。为了让TypeScript编译器看到这种形状，我们使用环境名称空间声明。例如，我们可以开始如下编写：

source: The preceding two types are equivalent to the Typescript types <code>{ [x: string]: number }</code> and <code>{ [x: number]: any }</code>. The compiler understands both syntaxes.
ru: Предыдущие два типа эквивалентны типам Typescript <code>{ [x: string]: number }</code> и <code>{ [x: number]: any }</code> . Компилятор понимает оба синтаксиса.
zh_cn: 前面两种类型等同于Typescript类型 <code>{ [x: string]: number }</code> 和 <code>{ [x: number]: any }</code> 。编译器理解两种语法。

source: The presence of a <code>tsconfig.json</code> file in a directory indicates that the directory is the root of a TypeScript project. The <code>tsconfig.json</code> file specifies the root files and the compiler options required to compile the project. A project is compiled in one of the following ways:
ru: Наличие файла <code>tsconfig.json</code> в каталоге указывает на то, что каталог является корнем проекта TypeScript. В файле <code>tsconfig.json</code> указаны корневые файлы и параметры компилятора, необходимые для компиляции проекта. Проект компилируется одним из следующих способов:
zh_cn: 目录中存在 <code>tsconfig.json</code> 文件，表明该目录是TypeScript项目的根目录。该 <code>tsconfig.json</code> 文件指定根目录的文件，并编制项目所需的编译器选项。通过以下方式之一编译项目：

source: The problem with <code>padLeft</code> is that its <code>padding</code> parameter is typed as <code>any</code>. That means that we can call it with an argument that&rsquo;s neither a <code>number</code> nor a <code>string</code>, but TypeScript will be okay with it.
ru: Проблема с <code>padLeft</code> заключается в том, что его параметр <code>padding</code> набирается как <code>any</code> . Это означает, что мы можем вызвать его с аргументом, который не является ни <code>number</code> ни <code>string</code> , но TypeScript с этим согласится.
zh_cn: <code>padLeft</code> 的问题在于其 <code>padding</code> 参数的类型为 <code>any</code> 。这意味着我们可以使用既不是 <code>number</code> 也不是 <code>string</code> 的参数来调用它，但是TypeScript可以使用它。

source: The process of resolving these package names is similar to the process of resolving module names in an <code>import</code> statement. An easy way to think of triple-slash-reference-types directives are as an <code>import</code> for declaration packages.
ru: Процесс разрешения этих имен пакетов аналогичен процессу разрешения имен модулей в операторе <code>import</code> . Директивы типов с тройной косой чертой и ссылочными типами проще всего рассматривать как <code>import</code> для пакетов объявлений.
zh_cn: 这些程序包名称的解析过程与 <code>import</code> 语句中的模块名称解析过程相似。考虑三重斜杠引用类型指令的一种简单方法是将其 <code>import</code> 声明包。

source: The process starts with a set of <em>root files</em>; these are the file names specified on the command-line or in the <code>"files"</code> list in the <code>tsconfig.json</code> file. These root files are preprocessed in the same order they are specified. Before a file is added to the list, all triple-slash references in it are processed, and their targets included. Triple-slash references are resolved in a depth first manner, in the order they have been seen in the file.
ru: Процесс начинается с набора <em>корневых файлов</em> ; это имена файлов, указанные в командной строке или в списке <code>"files"</code> в файле <code>tsconfig.json</code> . Эти корневые файлы предварительно обрабатываются в том же порядке, в котором они указаны. Прежде чем файл будет добавлен в список, все ссылки с тройной косой чертой в нем обрабатываются, и их цели включаются. Ссылки с тройной косой чертой разрешаются сначала в глубину, в том порядке, в котором они были показаны в файле.
zh_cn: 该过程从一组<em>根文件开始</em>；这些是在命令行或 <code>tsconfig.json</code> 文件的 <code>"files"</code> 列表中指定的文件名。这些根文件将按照指定的顺序进行预处理。在将文件添加到列表之前，必须先处理其中的所有三斜杠引用及其目标。以深度优先的方式解析三斜杠引用，其顺序是在文件中出现的顺序。

source: The program should print &ldquo;Hello from TypeScript!&rdquo;.
ru: Программа должна напечатать &laquo;Hello from TypeScript!&raquo;.
zh_cn: 该程序应打印&ldquo;来自TypeScript的Hello！&rdquo;。

source: The purpose of this guide is to teach you how to write a high-quality definition file. This guide is structured by showing documentation for some API, along with sample usage of that API, and explaining how to write the corresponding declaration.
ru: Цель данного руководства-научить вас писать качественный файл определений.Это руководство структурировано таким образом,что в нем показана документация по некоторым API,а также примеры использования этого API и объяснено,как написать соответствующее объявление.
zh_cn: 本指南的目的是教你如何编写一个高质量的定义文件。本指南的结构是展示一些API的文档,以及该API的使用示例,并解释如何编写相应的声明。

source: The reference tag here allows us to locate the declaration file that contains the declaration for the ambient module. This is how the <code>node.d.ts</code> file that several of the TypeScript samples use is consumed.
ru: Тег ссылки здесь позволяет нам найти файл объявления, который содержит объявление для внешнего модуля. Таким образом <code>node.d.ts</code> файл node.d.ts, который используется в нескольких примерах TypeScript.
zh_cn: 此处的引用标记使我们能够找到包含环境模块声明的声明文件。这就是几个TypeScript示例使用的 <code>node.d.ts</code> 文件的使用方式。

source: The rest of this section assumes <code>typescript@next</code> is already installed.
ru: В оставшейся части этого раздела предполагается, что <code>typescript@next</code> уже установлен.
zh_cn: 本节的其余部分假定已经安装了 <code>typescript@next</code> 。

source: The result will be a file <code>greeter.js</code> which contains the same JavaScript that you fed in. We&rsquo;re up and running using TypeScript in our JavaScript app!
ru: В результате получится файл <code>greeter.js</code> , содержащий тот же код JavaScript, который вы ввели . Мы начали использовать TypeScript в нашем приложении JavaScript!
zh_cn: 结果将是文件 <code>greeter.js</code> ，其中包含您输入的相同JavaScript。我们在JavaScript应用中使用TypeScript启动并运行它！

source: The resulting merged declaration of <code>Document</code> will be the following:
ru: Результирующая объединенная декларация <code>Document</code> будет следующей:
zh_cn: 合并后的 <code>Document</code> 声明如下：

source: The resulting type of the property.
ru: Результирующий тип недвижимости.
zh_cn: 财产的结果类型。

source: The results are then called as functions from bottom-to-top.
ru: Затем результаты вызываются как функции снизу вверх.
zh_cn: 然后将结果作为函数从下到上调用。

source: The return value of the parameter decorator is ignored.
ru: Возвращаемое значение параметра декоратора игнорируется.
zh_cn: 参数装饰器的返回值被忽略。

source: The right side of the <code>instanceof</code> needs to be a constructor function, and TypeScript will narrow down to:
ru: Правая часть <code>instanceof</code> должна быть функцией-конструктором, а TypeScript сузится до:
zh_cn: <code>instanceof</code> 的右侧需要是一个构造函数，并且TypeScript将缩小为：

source: The same <a href="#the-impact-of-es6-on-module-plugins">footnote</a> applies to these modules.
ru: Та же <a href="#the-impact-of-es6-on-module-plugins">сноска</a> применима к этим модулям.
zh_cn: 相同的<a href="#the-impact-of-es6-on-module-plugins">脚注</a>适用于这些模块。

source: The same goes for <a href="https://github.com/TypeStrong/ts-loader">ts-loader</a>, another TypeScript loader for Webpack. You can read more about the differences between the two <a href="https://github.com/s-panferov/awesome-typescript-loader#differences-between-ts-loader">here</a>.
ru: То же самое и с <a href="https://github.com/TypeStrong/ts-loader">ts-loader</a> , еще одним загрузчиком TypeScript для Webpack. Вы можете прочитать больше о различиях между ними <a href="https://github.com/s-panferov/awesome-typescript-loader#differences-between-ts-loader">здесь</a> .
zh_cn: 这同样适用于<a href="https://github.com/TypeStrong/ts-loader">TS-装载机</a>，另一个打字稿装载机的WebPack。您可以在<a href="https://github.com/s-panferov/awesome-typescript-loader#differences-between-ts-loader">此处</a>详细了解两者之间的区别。

source: The same is true for optional properties:
ru: То же самое относится и к дополнительным свойствам:
zh_cn: 可选属性也是如此。

source: The same rule for assignment is used when checking function call arguments:
ru: Такое же правило присваивания используется при проверке аргументов вызова функции:
zh_cn: 在检查函数调用参数时,也使用同样的赋值规则。

source: The same sort of tracking is now also done for empty arrays.
ru: Такой же способ отслеживания теперь применяется и для пустых массивов.
zh_cn: 现在对空数组也进行同样的跟踪。

source: The same way that ordinary tuples are types that extend from <code>Array</code> - a tuple with elements of type <code>T<sub>1</sub></code>, <code>T<sub>2</sub></code>, &hellip; <code>T<sub>n</sub></code> extends from <code>Array&lt; T<sub>1</sub> \| T<sub>2</sub> \| ... T<sub>n</sub> &gt;</code> - <code>readonly</code> tuples are types that extend from <code>ReadonlyArray</code>. So a <code>readonly</code> tuple with elements <code>T<sub>1</sub></code>, <code>T<sub>2</sub></code>, &hellip; <code>T<sub>n</sub></code> extends from <code>ReadonlyArray&lt; T<sub>1</sub> \| T<sub>2</sub> | ... T<sub>n</sub> &gt;</code>.
ru: Точно так же, как обычные кортежи являются типами, которые расширяются от <code>Array</code> - кортеж с элементами типа <code>T<sub>1</sub></code> , <code>T<sub>2</sub></code> ,&hellip; <code>T<sub>n</sub></code> расширяется от <code>Array&lt; T<sub>1</sub> \| T<sub>2</sub> \| ... T<sub>n</sub> &gt;</code> - <code>readonly</code> кортежей типов , которые простираются от <code>ReadonlyArray</code> . Таким образом, кортеж только для <code>readonly</code> с элементами <code>T<sub>1</sub></code> , <code>T<sub>2</sub></code> ,&hellip; <code>T<sub>n</sub></code> расширяется от <code>ReadonlyArray&lt; T<sub>1</sub> \| T<sub>2</sub> | ... T<sub>n</sub> &gt;</code> .
zh_cn: 普通元组是从 <code>Array</code> 扩展的类型的相同方法-元素类型为 <code>T<sub>1</sub></code> ， <code>T<sub>2</sub></code> ，&hellip; <code>T<sub>n</sub></code> 的元组从 <code>Array&lt; T<sub>1</sub> \| T<sub>2</sub> \| ... T<sub>n</sub> &gt;</code> 扩展 T <sub>2</sub> \ | ... T <sub>n</sub> &gt; - <code>readonly</code> 元组是从 <code>ReadonlyArray</code> 扩展的类型。因此，具有元素 <code>T<sub>1</sub></code> <sub>1</sub>， <code>T<sub>2</sub></code> <sub>2</sub>，... <code>T<sub>n</sub></code> <sub>n</sub>的 <code>readonly</code> 元组从 <code>ReadonlyArray&lt; T<sub>1</sub> \| T<sub>2</sub> | ... T<sub>n</sub> &gt;</code> <sub>1</sub> \ |扩展。T <sub>2</sub> | ... T <sub>n</sub> &gt;<sub></sub><sub></sub><sub></sub><sub></sub><sub></sub><sub></sub>。

source: The second assignment is an error, because <code>y</code> has a required second parameter that <code>x</code> does not have, so the assignment is disallowed.
ru: Второе присвоение является ошибкой, потому что <code>y</code> имеет обязательный второй параметр, которого нет у <code>x</code> , поэтому присвоение запрещено.
zh_cn: 第二个赋值是一个错误，因为 <code>y</code> 具有 <code>x</code> 所没有的必需的第二个参数，因此不允许该赋值。

source: The second block creates the following name meanings:
ru: Второй блок создает следующие значения имени:
zh_cn: 第二块创建以下名称含义。

source: The second method uses the <code>never</code> type that the compiler uses to check for exhaustiveness:
ru: Второй метод использует тип <code>never</code> , который компилятор использует для проверки полноты:
zh_cn: 第二种方法使用编译器用来检查穷举性的 <code>never</code> 类型：

source: The second operator is <code>T[K]</code>, the <strong>indexed access operator</strong>. Here, the type syntax reflects the expression syntax. That means that <code>person['name']</code> has the type <code>Person['name']</code> &mdash; which in our example is just <code>string</code>. However, just like index type queries, you can use <code>T[K]</code> in a generic context, which is where its real power comes to life. You just have to make sure that the type variable <code>K extends keyof T</code>. Here&rsquo;s another example with a function named <code>getProperty</code>.
ru: Второй оператор - <code>T[K]</code> , <strong>индексированный оператор доступа</strong> . Здесь синтаксис типа отражает синтаксис выражения. Это означает, что <code>person['name']</code> имеет тип <code>Person['name']</code> который в нашем примере является просто <code>string</code> . Однако, как и запросы индексного типа, вы можете использовать <code>T[K]</code> в общем контексте, и именно здесь его реальная сила проявляется. Вы просто должны убедиться , что тип переменной <code>K extends keyof T</code> . Вот еще один пример с функцией с именем <code>getProperty</code> .
zh_cn: 第二个运算符是 <code>T[K]</code> ，即<strong>索引访问运算符</strong>。在此，类型语法反映了表达式语法。这意味着 <code>person['name']</code> 的类型为 <code>Person['name']</code> -在我们的示例中只是 <code>string</code> 。但是，就像索引类型查询一样，您可以在通用上下文中使用 <code>T[K]</code> ，这才是其真正的生命所在。您只需要确保类型变量 <code>K extends keyof T</code> 。这是另一个名为 <code>getProperty</code> 的函数的示例。
