Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/typescript/typescript.*.003.xlf
Languages: es, ko, ru, zh_cn

source: To detect the issue around accessors, TypeScript 3.7 will now emit <code>get</code>/<code>set</code> accessors in <code>.d.ts</code> files so that in TypeScript can check for overridden accessors.
ru: Чтобы обнаружить проблему, связанную с аксессорами, TypeScript 3.7 теперь будет <code>.d.ts</code> <code>get</code> / <code>set</code> в файлах .d.ts, чтобы в TypeScript можно было проверять наличие переопределенных аксессоров.
zh_cn: 为了检测访问器周围的问题，TypeScript 3.7现在将在 <code>.d.ts</code> 文件中发出 <code>get</code> / <code>set</code> 访问器，以便在TypeScript中可以检查重写的访问器。

source: To do so, we&rsquo;ll create an interface that describes our constraint. Here, we&rsquo;ll create an interface that has a single <code>.length</code> property and then we&rsquo;ll use this interface and the <code>extends</code> keyword to denote our constraint:
ru: Для этого мы создадим интерфейс, описывающий наше ограничение. Здесь мы создадим интерфейс с единственным свойством <code>.length</code> , а затем воспользуемся этим интерфейсом и ключевым словом <code>extends</code> для обозначения нашего ограничения:
zh_cn: 为此，我们将创建一个描述约束的接口。在这里，我们将创建一个具有单个 <code>.length</code> 属性的接口，然后使用该接口和 <code>extends</code> 关键字来表示我们的约束：

source: To do this, you&rsquo;ll need to create a <code>tsconfig.json</code> which contains a list of your input files as well as all your compilation settings. Simply create a new file in your project root named <code>tsconfig.json</code> and fill it with the following contents:
ru: Для этого вам нужно создать <code>tsconfig.json</code> , который содержит список ваших входных файлов, а также все ваши настройки компиляции. Просто создайте новый файл в корне вашего проекта с именем <code>tsconfig.json</code> и заполните его следующим содержимым:
zh_cn: 为此，您需要创建一个 <code>tsconfig.json</code> ，其中包含输入文件列表以及所有编译设置。只需在项目根目录下创建一个名为 <code>tsconfig.json</code> 的新文件，并将其填充以下内容：

source: To enable experimental support for decorators, you must enable the <code>experimentalDecorators</code> compiler option either on the command line or in your <code>tsconfig.json</code>:
ru: Чтобы включить экспериментальную поддержку декораторов, необходимо включить <code>experimentalDecorators</code> компилятора опцию либо в командной строке или в вашем <code>tsconfig.json</code> :
zh_cn: 要为装饰器启用实验性支持，必须在命令行或 <code>tsconfig.json</code> 中启用 <code>experimentalDecorators</code> 编译器选项：

source: To enable the recursive type alias patterns described above, the <code>typeArguments</code> property has been removed from the <code>TypeReference</code> interface. Users should instead use the <code>getTypeArguments</code> function on <code>TypeChecker</code> instances.
ru: Чтобы включить описанные выше шаблоны псевдонимов рекурсивного типа, свойство <code>typeArguments</code> было удалено из интерфейса <code>TypeReference</code> . Пользователи должны вместо этого использовать <code>getTypeArguments</code> функцию <code>TypeChecker</code> экземпляров.
zh_cn: 为了启用上述递归类型别名模式，已经从 <code>TypeReference</code> 接口中删除了 <code>typeArguments</code> 属性。用户应该在 <code>TypeChecker</code> 实例上使用 <code>getTypeArguments</code> 函数。

source: To enable treating symbols as unique literals a new type <code>unique symbol</code> is available. <code>unique symbol</code> is a subtype of <code>symbol</code>, and are produced only from calling <code>Symbol()</code> or <code>Symbol.for()</code>, or from explicit type annotations. The new type is only allowed on <code>const</code> declarations and <code>readonly static</code> properties, and in order to reference a specific unique symbol, you&rsquo;ll have to use the <code>typeof</code> operator. Each reference to a <code>unique symbol</code> implies a completely unique identity that&rsquo;s tied to a given declaration.
ru: Чтобы можно было рассматривать символы как уникальные литералы, доступен <code>unique symbol</code> нового типа . <code>unique symbol</code> - это подтип <code>symbol</code> , который создается только <code>Symbol.for()</code> вызова <code>Symbol()</code> или Symbol.for () или явных аннотаций типов. Новый тип разрешен только в объявлениях <code>const</code> и <code>readonly static</code> свойствах только для чтения , и для ссылки на конкретный уникальный символ вам придется использовать оператор <code>typeof</code> . Каждая ссылка на <code>unique symbol</code> подразумевает полностью уникальную идентичность, привязанную к данному объявлению.
zh_cn: 为了能够将符号视为唯一文字，可以使用一种新型的 <code>unique symbol</code> 。 <code>unique symbol</code> 是的子类型 <code>symbol</code> ，并只从调用产生 <code>Symbol()</code> 或 <code>Symbol.for()</code> ,或者从显式的类型的注释。仅在 <code>const</code> 声明和 <code>readonly static</code> 属性上才允许使用新类型，并且为了引用特定的唯一符号，您必须使用 <code>typeof</code> 运算符。每个对 <code>unique symbol</code> 引用都意味着与给定声明相关联的完全唯一的标识。

source: To get more specific, let&rsquo;s build up some motivation and consider the following <code>compose</code> function:
ru: Чтобы быть более конкретным, давайте создадим некоторую мотивацию и рассмотрим следующую функцию <code>compose</code> :
zh_cn: 为了更具体，让我们建立一些动机并考虑以下 <code>compose</code> 功能：

source: To get the same code working, we&rsquo;ll need to use a type assertion:
ru: Чтобы тот же код работал, нам нужно использовать утверждение типа:
zh_cn: 为了使相同的代码正常工作，我们需要使用类型断言：

source: To help mitigate the second issue, you can either add an explicit initializer or add a <code>declare</code> modifier to indicate that a property should have no emit.
ru: Чтобы помочь смягчить вторую проблему, вы можете добавить явный инициализатор или добавить модификатор <code>declare</code> , чтобы указать, что свойство не должно иметь излучения.
zh_cn: 为了帮助缓解第二个问题，您可以添加一个显式的初始化程序或添加一个 <code>declare</code> 修饰符，以指示一个属性应该没有发出。

source: To infer the type of <code>x</code> in the example above, we must consider the type of each array element. Here we are given two choices for the type of the array: <code>number</code> and <code>null</code>. The best common type algorithm considers each candidate type, and picks the type that is compatible with all the other candidates.
ru: Чтобы определить тип <code>x</code> в приведенном выше примере, мы должны рассмотреть тип каждого элемента массива. Здесь у нас есть два варианта выбора типа массива: <code>number</code> и <code>null</code> . Лучший алгоритм общего типа рассматривает каждый тип кандидата и выбирает тип, совместимый со всеми другими кандидатами.
zh_cn: 要在上面的示例中推断 <code>x</code> 的类型，我们必须考虑每个数组元素的类型。在这里，我们为数组的类型提供了两种选择： <code>number</code> 和 <code>null</code> 。最佳通用类型算法考虑每种候选类型，并选择与所有其他候选类型兼容的类型。

source: To learn more, <a href="https://github.com/microsoft/TypeScript/pull/31116">check out the original pull request on GitHub</a>.
ru: Чтобы узнать больше, <a href="https://github.com/microsoft/TypeScript/pull/31116">ознакомьтесь с исходным запросом на перенос на GitHub</a> .
zh_cn: 要了解更多信息，<a href="https://github.com/microsoft/TypeScript/pull/31116">请在GitHub上查看原始的pull请求</a>。

source: To maintain type safety, we can use the <code>typeof</code> keyword. The <code>typeof</code> keyword, when used in a type position, produces the type of a value, in this case the type of the module.
ru: Для обеспечения безопасности типов мы можем использовать ключевое слово <code>typeof</code> . <code>typeof</code> ключевое слово, при использовании в положении типа, производит тип значения, в данном случае тип модуля.
zh_cn: 为了保持类型安全，我们可以使用 <code>typeof</code> 关键字。所述 <code>typeof</code> 关键字，在一个类型的位置使用时，产生一个值的类型，在这种情况下，模块的类型。

source: To merge the namespace value, at each declaration site, if a namespace already exists with the given name, it is further extended by taking the existing namespace and adding the exported members of the second namespace to the first.
ru: Для объединения значения пространства имён,в каждом сайте декларации,если пространство имён уже существует с заданным именем,оно расширяется путём взятия существующего пространства имён и добавления экспортируемых членов второго пространства имён к первому.
zh_cn: 为了合并命名空间的值,在每个声明点,如果已经存在一个带有给定名称的命名空间,则将现有的命名空间进一步扩展,并将第二个命名空间的导出成员添加到第一个命名空间中。

source: To merge the namespaces, type definitions from exported interfaces declared in each namespace are themselves merged, forming a single namespace with merged interface definitions inside.
ru: Для объединения пространств имен,определения типов экспортируемых интерфейсов,объявленные в каждом пространстве имен,сами объединяются,образуя единое пространство имен с объединенными определениями интерфейсов внутри.
zh_cn: 为了合并命名空间,每个命名空间中声明的导出接口的类型定义本身也会被合并,形成一个单一的命名空间,里面有合并的接口定义。

source: To preserve existing functionality, we also add a simple getter that retrieves <code>fullName</code> unmodified.
ru: Чтобы сохранить существующую функциональность, мы также добавляем простой метод получения, который извлекает <code>fullName</code> без изменений.
zh_cn: 为了保留现有功能，我们还添加了一个简单的getter来检索未修改的 <code>fullName</code> 。

source: To prove to ourselves that our accessor is now checking the length of values, we can attempt to assign a name longer than 10 characters and verify that we get an error.
ru: Чтобы доказать себе,что наш аксессуар теперь проверяет длину значений,мы можем попытаться присвоить имя длиннее 10 символов и проверить,что мы получили ошибку.
zh_cn: 为了向自己证明我们的访问器现在正在检查值的长度,我们可以尝试分配一个超过10个字符的名称,并验证我们是否得到一个错误。

source: To quickly recap what these two approaches look like in JavaScript:
ru: Чтобы быстро вспомнить,как эти два подхода выглядят в JavaScript:
zh_cn: 快速总结一下这两种方法在JavaScript中是什么样子的。

source: To read up more about assertion signatures, <a href="https://github.com/microsoft/TypeScript/pull/32695">check out the original pull request</a>.
ru: Чтобы узнать больше о подписях утверждений, <a href="https://github.com/microsoft/TypeScript/pull/32695">ознакомьтесь с исходным запросом на перенос</a> .
zh_cn: 要阅读有关断言签名的更多信息，<a href="https://github.com/microsoft/TypeScript/pull/32695">请查看原始的pull request</a>。

source: To reiterate why you shouldn&rsquo;t try to namespace your module contents, the general idea of namespacing is to provide logical grouping of constructs and to prevent name collisions. Because the module file itself is already a logical grouping, and its top-level name is defined by the code that imports it, it&rsquo;s unnecessary to use an additional module layer for exported objects.
ru: Чтобы повторить, почему вы не должны пытаться создать пространство имен для содержимого вашего модуля, общая идея пространства имен состоит в том, чтобы обеспечить логическое группирование конструкций и предотвратить конфликты имен. Поскольку сам файл модуля уже представляет собой логическую группу, а его имя верхнего уровня определяется кодом, который его импортирует, нет необходимости использовать дополнительный уровень модуля для экспортируемых объектов.
zh_cn: 为了重申为什么不应该为模块内容命名空间，命名空间的一般思想是提供结构的逻辑分组并防止名称冲突。由于模块文件本身已经是一个逻辑分组，并且其顶层名称由导入该文件的代码定义，因此无需为导出的对象使用附加的模块层。

source: To specify this relationship to the compiler, use<code>"rootDirs"</code>. <code>"rootDirs"</code> specify a list of <em>roots</em> whose contents are expected to merge at run-time. So following our example, the <code>tsconfig.json</code> file should look like:
ru: Чтобы указать это отношение к компилятору, используйте <code>"rootDirs"</code> . <code>"rootDirs"</code> определяет список <em>корней</em> , содержимое которых, как ожидается, будет объединено во время выполнения. Итак, следуя нашему примеру, файл <code>tsconfig.json</code> должен выглядеть так:
zh_cn: 要指定与编译器的这种关系，请使用 <code>"rootDirs"</code> 。 <code>"rootDirs"</code> 指定了<em>根</em>目录，这些目录的内容有望在运行时合并。因此，按照我们的示例， <code>tsconfig.json</code> 文件应如下所示：

source: To start off, let&rsquo;s do the &ldquo;hello world&rdquo; of generics: the identity function. The identity function is a function that will return back whatever is passed in. You can think of this in a similar way to the <code>echo</code> command.
ru: Для начала займемся &laquo;привет миром&raquo; дженериков: функцией идентификации. Функция идентификации - это функция, которая возвращает обратно все, что было передано. Вы можете думать об этом аналогично команде <code>echo</code> .
zh_cn: 首先，让我们做一下泛型的&ldquo; hello world&rdquo;：身份函数。身份函数是一个将返回传入内容的函数。您可以通过与 <code>echo</code> 命令类似的方式来考虑它。

source: To start, we&rsquo;re going to structure our project in the following way:
ru: Для начала мы собираемся структурировать наш проект следующим образом:
zh_cn: 首先，我们将通过以下方式构建项目：

source: To understand the full impact, read <a href="#the-usedefineforclassfields-flag-and-the-declare-property-modifier">the section above on the <code>useDefineForClassFields</code> flag</a>.
ru: Чтобы понять все последствия, прочтите <a href="#the-usedefineforclassfields-flag-and-the-declare-property-modifier">раздел выше о флаге <code>useDefineForClassFields</code> </a> .
zh_cn: 要了解全部影响，请阅读<a href="#the-usedefineforclassfields-flag-and-the-declare-property-modifier">上面有关 <code>useDefineForClassFields</code> 标志的部分</a>。

source: To understand what steps the TS compiler will follow, it is important to shed some light on Node.js modules. Traditionally, imports in Node.js are performed by calling a function named <code>require</code>. The behavior Node.js takes will differ depending on if <code>require</code> is given a relative path or a non-relative path.
ru: Чтобы понять, какие шаги будет выполнять компилятор TS, важно пролить свет на модули Node.js. Традиционно импорт в Node.js выполняется путем вызова функции с именем <code>require</code> . Поведение Node.js будет отличаться в зависимости от того, указан ли <code>require</code> относительный или не относительный путь.
zh_cn: 要了解TS编译器将遵循的步骤，重要的是要弄清Node.js模块。传统上，Node.js中的导入是通过调用名为 <code>require</code> 的函数来执行的。Node.js采取的行为将有所不同，具体取决于是否为 <code>require</code> 提供了相对路径或非相对路径。

source: To use JSX with React you should use the <a href="https://github.com/DefinitelyTyped/DefinitelyTyped/tree/master/types/react">React typings</a>. These typings define the <code>JSX</code> namespace appropriately for use with React.
ru: Чтобы использовать JSX с React, вы должны использовать <a href="https://github.com/DefinitelyTyped/DefinitelyTyped/tree/master/types/react">типизацию React</a> . Эти типы определяют пространство имен <code>JSX</code> , подходящее для использования с React.
zh_cn: 要将JSX与React一起使用，应使用<a href="https://github.com/DefinitelyTyped/DefinitelyTyped/tree/master/types/react">React类型</a>。这些类型定义了与React一起使用的 <code>JSX</code> 名称空间。

source: To use JSX-support with React you should use the <a href="https://github.com/borisyankov/DefinitelyTyped/tree/master/react">React typings</a>. These typings define the <code>JSX</code> namespace so that TypeScript can correctly check JSX expressions for React. For example:
ru: Чтобы использовать JSX-поддержку с React, вы должны использовать <a href="https://github.com/borisyankov/DefinitelyTyped/tree/master/react">типизацию React</a> . Эти типы определяют пространство имен <code>JSX</code> , чтобы TypeScript мог правильно проверять выражения JSX на React. Например:
zh_cn: 要将JSX支持与React一起使用，您应该使用<a href="https://github.com/borisyankov/DefinitelyTyped/tree/master/react">React类型</a>。这些类型定义了 <code>JSX</code> 命名空间，以便TypeScript可以正确地检查JSX表达式中的React。例如：

source: Today, most popular globally-accessible libraries are actually written as UMD libraries (see below). UMD library documentation is hard to distinguish from global library documentation. Before writing a global declaration file, make sure the library isn&rsquo;t actually UMD.
ru: Сегодня самые популярные глобально доступные библиотеки фактически написаны как библиотеки UMD (см. Ниже). Документацию библиотеки UMD трудно отличить от документации глобальной библиотеки. Перед написанием файла глобальной декларации убедитесь, что библиотека на самом деле не UMD.
zh_cn: 如今，最流行的可全局访问的库实际上是作为UMD库编写的（请参见下文）。UMD库文档很难与全局库文档区分开。在编写全局声明文件之前，请确保该库实际上不是UMD。

source: Together (1) and (2) mean that we have to move our call to <code>browserify</code> out of the <code>default</code> task. And we have to give the function for <code>default</code> a name since both Watchify and Gulp need to call it. Adding logging with (3) is optional but very useful for debugging your setup.
ru: Вместе (1) и (2) означают , что мы должны двигаться наш призыв к <code>browserify</code> из <code>default</code> задачи. И мы должны дать функции по <code>default</code> имя, поскольку и Watchify, и Gulp должны ее вызывать. Добавление регистрации с помощью (3) необязательно, но очень полезно для отладки вашей установки.
zh_cn: 在一起（1）和（2）意味着我们必须将我们的呼叫 <code>browserify</code> 的出 <code>default</code> 任务。而且我们必须给 <code>default</code> 函数命名，因为Watchify和Gulp都需要调用它。使用（3）添加日志记录是可选的，但对于调试设置非常有用。

source: Together with intersection types, we can make some pretty mind-bending types:
ru: Вместе с типами пересечений,мы можем сделать несколько довольно умопомрачительных типов:
zh_cn: 与交集类型一起,我们可以做出一些非常令人匪夷所思的类型。

source: Too many/too few arguments
ru: Слишком много/несколько аргументов
zh_cn: 争论太多/太少

source: Top-level <code>var</code> statements or <code>function</code> declarations
ru: Операторы <code>var</code> или объявления <code>function</code> верхнего уровня
zh_cn: 顶级 <code>var</code> 语句或 <code>function</code> 声明

source: Tracing module resolution
ru: Разрешение модуля трассировки
zh_cn: 追查模块决议

source: Trade-offs of Modules
ru: Компромиссы модулей
zh_cn: 模块的权衡

source: Traditional JavaScript uses functions and prototype-based inheritance to build up reusable components, but this may feel a bit awkward to programmers more comfortable with an object-oriented approach, where classes inherit functionality and objects are built from these classes. Starting with ECMAScript 2015, also known as ECMAScript 6, JavaScript programmers will be able to build their applications using this object-oriented class-based approach. In TypeScript, we allow developers to use these techniques now, and compile them down to JavaScript that works across all major browsers and platforms, without having to wait for the next version of JavaScript.
ru: Традиционный JavaScript использует функции и наследование по прототипу для построения компонентов многократного использования,но это может показаться немного неудобным для программистов,которым более удобен объектно-ориентированный подход,при котором классы наследуют функциональность,а объекты строятся из этих классов.Начиная с ECMAScript 2015,также известного как ECMAScript 6,JavaScript-программисты смогут строить свои приложения,используя этот объектно-ориентированный подход на основе классов.В TypeScript мы позволяем разработчикам использовать эти методы сейчас,и компилировать их вплоть до JavaScript,который работает во всех основных браузерах и платформах,не дожидаясь следующей версии JavaScript.
zh_cn: 传统的JavaScript使用函数和基于原型的继承来构建可重用的组件,但对于更习惯于使用面向对象方法的程序员来说,这可能会感觉有些笨拙,因为在这种方法中,类继承功能,对象从这些类中构建。从ECMAScript 2015(也就是ECMAScript 6)开始,JavaScript程序员将能够使用这种面向对象的基于类的方法来构建他们的应用程序。在TypeScript中,我们允许开发人员现在就使用这些技术,并将其编译成可以在所有主要浏览器和平台上工作的JavaScript,而无需等待下一个JavaScript版本。

source: Trailing comma in function parameter and argument lists are now allowed. This is an implementation for a <a href="https://jeffmo.github.io/es-trailing-function-commas/">Stage-3 ECMAScript proposal</a> that emits down to valid ES3/ES5/ES6.
ru: Завершающая запятая в списках параметров функции и аргументов теперь разрешена. Это реализация для <a href="https://jeffmo.github.io/es-trailing-function-commas/">ECMAScript-предложения Stage-3,</a> которая передается до действительных ES3 / ES5 / ES6.
zh_cn: 现在允许在函数参数和参数列表中使用逗号结尾。这是<a href="https://jeffmo.github.io/es-trailing-function-commas/">第3阶段ECMAScript提案</a>的实现，该提案可发出有效的ES3 / ES5 / ES6。

source: Trailing commas in function parameter and argument lists
ru: Трейлинг запятых в списках параметров и аргументов функции
zh_cn: 在函数参数和参数列表中使用逗号。

source: Translate newer JavaScript constructs down to an older version like ECMAScript 5 (using <code>target</code>).
ru: Преобразуйте новые конструкции JavaScript в более старую версию, такую ​​как ECMAScript 5 (используя <code>target</code> ).
zh_cn: 将较新的JavaScript结构转换为ECMAScript 5之类的较旧版本（使用 <code>target</code> ）。

source: Triple-Slash Directives
ru: Директивы с тройной косой чертой
zh_cn: 三斜杠指令

source: Triple-slash directives are <strong>only</strong> valid at the top of their containing file. A triple-slash directive can only be preceded by single or multi-line comments, including other triple-slash directives. If they are encountered following a statement or a declaration they are treated as regular single-line comments, and hold no special meaning.
ru: Директивы с тройной косой чертой действительны <strong>только</strong> в верхней части содержащего их файла. Директиве с тройной косой чертой могут предшествовать только однострочные или многострочные комментарии, включая другие директивы с тройной косой чертой. Если они встречаются после оператора или объявления, они рассматриваются как обычные однострочные комментарии и не имеют особого значения.
zh_cn: 三斜杠指令<strong>仅</strong>在其包含文件的顶部有效。三斜杠指令只能在单行或多行注释之前，包括其他三斜杠指令。如果在声明或声明之后遇到它们，则将它们视为常规的单行注释，并且没有特殊含义。

source: Triple-slash directives are single-line comments containing a single XML tag. The contents of the comment are used as compiler directives.
ru: Директивы Triple-slash-это однострочные комментарии,содержащие один XML-тег.Содержимое комментария используется в качестве директив компилятора.
zh_cn: 三斜杠指令是包含一个XML标签的单行注释。注释的内容被用作编译器指令。

source: Triple-slash references instruct the compiler to include additional files in the compilation process.
ru: Ссылки Triple-slash инструктируют компилятор включать дополнительные файлы в процесс компиляции.
zh_cn: 三斜杠引用指示编译器在编译过程中包含额外的文件。

source: Tuple destructuring
ru: разрушение кортежа
zh_cn: 元组重构

source: Tuple types
ru: типы кортежей
zh_cn: 元组类型

source: Tuple types allow you to express an array with a fixed number of elements whose types are known, but need not be the same. For example, you may want to represent a value as a pair of a <code>string</code> and a <code>number</code>:
ru: Типы кортежей позволяют выразить массив с фиксированным числом элементов, типы которых известны, но не обязательно должны быть одинаковыми. Например, вы можете представить значение как пару <code>string</code> и <code>number</code> :
zh_cn: 元组类型允许您用固定数量的元素表示数组，这些元素的类型是已知的，但不必相同。例如，您可能希望将值表示为一对 <code>string</code> 和一个 <code>number</code> ：

source: Tuple types express an array where the type of certain elements is known, but need not be the same. For example, you may want to represent an array with a <code>string</code> at position 0 and a <code>number</code> at position 1:
ru: Типы кортежей выражают массив, в котором тип определенных элементов известен, но не обязательно должен быть одинаковым. Например, вы можете представить массив со <code>string</code> в позиции 0 и <code>number</code> в позиции 1:
zh_cn: 元组类型表示一个数组，其中某些元素的类型是已知的，但不必相同。例如，您可能要表示一个数组，该数组在位置0处有一个 <code>string</code> ，在位置1处有一个 <code>number</code> ：

source: Tuple types now permit a <code>?</code> postfix on element types to indicate that the element is optional:
ru: Типы кортежей теперь разрешают <code>?</code> постфикс для типов элементов, чтобы указать, что элемент является необязательным:
zh_cn: 元组类型现在允许 <code>?</code> 元素类型的后缀，以指示该元素是可选的：

source: Tuples in rest parameters and spread expressions
ru: Кортежи в параметрах покоя и выражениях спреда
zh_cn: 静止参数和传播表达式中的图元

source: Tuples may be destructured like arrays; the destructuring variables get the types of the corresponding tuple elements:
ru: Кортежи могут быть разрушены как массивы,а деструктирующие переменные получают типы соответствующих элементов кортежа:
zh_cn: 图元组可以像数组一样被重构,重构变量可以得到相应图元组元素的类型。

source: Type Alias
ru: Тип псевдонима
zh_cn: 类型别名

source: Type Aliases
ru: псевдонимы типа
zh_cn: 类型别名

source: Type Checking
ru: Проверка типа
zh_cn: 检查类型

source: Type Checking JavaScript Files
ru: Введите Проверка файлов JavaScript
zh_cn: 类型检查JavaScript文件
