Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/typescript/typescript.*.003.xlf
Languages: es, ko, ru, zh_cn

source: NOTE TypeScript disallows decorating both the <code>get</code> and <code>set</code> accessor for a single member. Instead, all decorators for the member must be applied to the first accessor specified in document order. This is because decorators apply to a <em>Property Descriptor</em>, which combines both the <code>get</code> and <code>set</code> accessor, not each declaration separately.
es: NOTA TypeScript no permite decorar tanto el <code>get</code> acceso get como <code>set</code> para un solo miembro. En cambio, todos los decoradores del miembro deben aplicarse al primer descriptor de acceso especificado en el orden del documento. Esto se debe a que los decoradores se aplican a un <em>descriptor de propiedad</em> , que combina el <em>descriptor de</em> acceso <code>get</code> y <code>set</code> , no cada declaraci&oacute;n por separado.
ko: 참고 TypeScript 에서는 단일 멤버에 대한 <code>get</code> 및 <code>set</code> 접근자를 모두 장식 할 수 없습니다 . 대신 멤버의 모든 데코레이터를 문서 순서대로 지정된 첫 번째 접근 자에 적용해야합니다. 데코레이터는 <em>속성 설명자에</em> 적용되기 때문에 각 선언이 아닌 <code>get</code> 및 <code>set</code> 접근 자를 결합합니다 .

source: NOTE You can see a more detailed example of a decorator factory in <a href="#method-decorators">Method Decorators</a>, below.
es: NOTA Puede ver un ejemplo m&aacute;s detallado de una f&aacute;brica de decoradores en <a href="#method-decorators">Decoradores de m&eacute;todos</a> , a continuaci&oacute;n.
ko: 참고 아래의 <a href="#method-decorators">메소드 데코레이터</a> 에서 데코레이터 팩토리에 대한 자세한 예를 볼 수 있습니다 .

source: NOTE You can see a more detailed example of a decorator in <a href="#class-decorators">Class Decorators</a>, below.
es: NOTA Puede ver un ejemplo m&aacute;s detallado de un decorador en <a href="#class-decorators">Decoradores de clase</a> , a continuaci&oacute;n.
ko: 참고 아래의 <a href="#class-decorators">클래스 데코레이터</a> 에서 데코레이터에 대한 자세한 예를 볼 수 있습니다 .

source: Name and location of the import
es: Nombre y ubicación de la importación
ko: 수입품의 이름과 위치

source: Name your files with a <code>.tsx</code> extension
es: Nombra tus archivos con una extensi&oacute;n <code>.tsx</code>
ko: <code>.tsx</code> 확장자로 파일 이름을 지정하십시오.

source: Name your project and solution. After select the <em>Create</em> button
es: Nombra tu proyecto y soluci&oacute;n. Despu&eacute;s de seleccionar el bot&oacute;n <em>Crear</em>
ko: 프로젝트와 솔루션의 이름을 지정하십시오. <em>생성</em> 버튼을 선택한 후

source: Named types just give a name to a type; for assignability purposes there&rsquo;s no difference between the type alias <code>One</code> and the interface type <code>Two</code> below. They both have a property <code>p: string</code>. (Type aliases behave differently from interfaces with respect to recursive definitions and type parameters, however.)
ko: 명명 된 유형은 유형에 이름을 부여합니다. 할당 가능성을 위해 아래의 유형 별칭 <code>One</code> 과 인터페이스 유형 <code>Two</code> 사이에는 차이가 없습니다 . 둘 다 <code>p: string</code> 속성이 있습니다 . (그러나 유형 별명은 재귀 적 정의 및 유형 매개 변수와 관련하여 인터페이스와 다르게 작동합니다.)

source: Namespaced Validators
es: Validadores del ritmo de los nombres
ko: 네임 스페이스 유효성 검사기

source: Namespaces &amp; Modules
es: M&oacute;dulos y espacios de nombres
ko: 네임 스페이스 및 모듈

source: Namespaces and Modules
es: Espacios de nombres y módulos
ko: 네임 스페이스 및 모듈

source: Namespaces are a TypeScript-specific way to organize code.
ko: 네임 스페이스는 코드를 구성하는 TypeScript 고유의 방법입니다.

source: Namespaces are flexible enough to also merge with other types of declarations. To do so, the namespace declaration must follow the declaration it will merge with. The resulting declaration has properties of both declaration types. TypeScript uses this capability to model some of the patterns in JavaScript as well as other programming languages.
es: Los espacios de nombres son lo suficientemente flexibles como para fusionarse también con otros tipos de declaraciones.Para ello,la declaración del espacio de nombres debe seguir a la declaración con la que se fusionará.La declaración resultante tiene propiedades de ambos tipos de declaración.TypeScript utiliza esta capacidad para modelar algunos de los patrones en JavaScript así como en otros lenguajes de programación.
ko: 네임 스페이스는 다른 유형의 선언과 병합 할 수있을만큼 유연합니다. 그렇게하려면 네임 스페이스 선언이 병합 할 선언을 따라야합니다. 결과 선언에는 두 선언 유형 모두의 속성이 있습니다. TypeScript는이 기능을 사용하여 JavaScript 및 기타 프로그래밍 언어의 일부 패턴을 모델링합니다.

source: Namespaces are important to avoid naming collisions in the global scope. For example, you might have <code>My.Application.Customer.AddForm</code> and <code>My.Application.Order.AddForm</code> &mdash; two types with the same name, but a different namespace. This, however, is not an issue with modules. Within a module, there&rsquo;s no plausible reason to have two objects with the same name. From the consumption side, the consumer of any given module gets to pick the name that they will use to refer to the module, so accidental naming conflicts are impossible.
ko: 네임 스페이스는 전역 범위에서 이름 충돌을 방지하는 데 중요합니다. 예를 들어 <code>My.Application.Customer.AddForm</code> 및 <code>My.Application.Order.AddForm</code> 이있을 수 있습니다. 이름은 같지만 네임 스페이스가 다른 두 가지 유형입니다. 그러나 이것은 모듈의 문제가 아닙니다. 모듈 내에서 동일한 이름을 가진 두 개의 개체를 가질 그럴듯한 이유가 없습니다. 소비 측면에서 특정 모듈의 소비자는 모듈을 참조하는 데 사용할 이름을 선택하게되므로 우발적 인 이름 충돌은 불가능합니다.

source: Namespaces are important to avoid naming collisions in the global scope. For example, you might have <code>My.Application.Customer.AddForm</code> and <code>My.Application.Order.AddForm</code> &ndash; two types with the same name, but a different namespace. This, however, is not an issue with modules. Within a module, there&rsquo;s no plausible reason to have two objects with the same name. From the consumption side, the consumer of any given module gets to pick the name that they will use to refer to the module, so accidental naming conflicts are impossible.
es: Los espacios de nombres son importantes para evitar colisiones de nombres en el &aacute;mbito global. Por ejemplo, puede tener <code>My.Application.Customer.AddForm</code> y <code>My.Application.Order.AddForm</code> , dos tipos con el mismo nombre, pero con un espacio de nombres diferente. Sin embargo, esto no es un problema con los m&oacute;dulos. Dentro de un m&oacute;dulo, no hay ninguna raz&oacute;n plausible para tener dos objetos con el mismo nombre. Desde el lado del consumo, el consumidor de cualquier m&oacute;dulo puede elegir el nombre que usar&aacute; para referirse al m&oacute;dulo, por lo que los conflictos de nombres accidentales son imposibles.
ko: 네임 스페이스는 전역 범위에서 이름 충돌을 피하기 위해 중요합니다. 예를 들어, 이름은 같지만 네임 스페이스는 다른 두 가지 유형 인 <code>My.Application.Customer.AddForm</code> 및 <code>My.Application.Order.AddForm</code> 이있을 수 있습니다 . 그러나 이것은 모듈의 문제가 아닙니다. 모듈 내에서 동일한 이름을 가진 두 개의 객체를 가질만한 이유는 없습니다. 소비 측면에서 특정 모듈의 소비자는 모듈을 참조하는 데 사용할 이름을 선택하므로 우연한 이름 충돌이 불가능합니다.

source: Namespaces are simply named JavaScript objects in the global namespace. This makes namespaces a very simple construct to use. They can span multiple files, and can be concatenated using <code>--outFile</code>. Namespaces can be a good way to structure your code in a Web Application, with all dependencies included as <code>&lt;script&gt;</code> tags in your HTML page.
es: Los espacios de nombres se denominan simplemente objetos JavaScript en el espacio de nombres global. Esto hace que los espacios de nombres sean una construcci&oacute;n muy simple de usar. Pueden abarcar varios archivos y se pueden concatenar usando <code>--outFile</code> . Los espacios de nombres pueden ser una buena forma de estructurar su c&oacute;digo en una aplicaci&oacute;n web, con todas las dependencias incluidas como etiquetas <code>&lt;script&gt;</code> en su p&aacute;gina HTML.
ko: 네임 스페이스는 단순히 글로벌 네임 스페이스에서 JavaScript 객체로 명명됩니다. 이것은 네임 스페이스를 사용하기 매우 간단한 구조로 만듭니다. 여러 파일에 걸쳐있을 수 있으며 <code>--outFile</code> 을 사용하여 연결할 수 있습니다 . 네임 스페이스는 웹 응용 프로그램에서 코드를 구성하는 좋은 방법이 될 수 있으며 HTML 페이지에 모든 종속성이 <code>&lt;script&gt;</code> 태그로 포함되어 있습니다.

source: Namespaces are simply named JavaScript objects in the global namespace. This makes namespaces a very simple construct to use. Unlike modules, they can span multiple files, and can be concatenated using <code>--outFile</code>. Namespaces can be a good way to structure your code in a Web Application, with all dependencies included as <code>&lt;script&gt;</code> tags in your HTML page.
ko: 네임 스페이스는 단순히 전역 네임 스페이스에서 이름이 지정된 JavaScript 개체입니다. 이것은 네임 스페이스를 사용하기 매우 간단한 구조로 만듭니다. 모듈과 달리 여러 파일에 걸쳐있을 수 있으며 <code>--outFile</code> 을 사용하여 연결할 수 있습니다 . 네임 스페이스는 웹 애플리케이션에서 코드를 구조화하는 좋은 방법이 될 수 있으며 모든 종속성은 HTML 페이지에 <code>&lt;script&gt;</code> 태그 로 포함됩니다 .

source: Namespaces in Module Code
ko: 모듈 코드의 네임 스페이스

source: Native ECMAScript 2015 modules SimpleModule.js
es: Módulos nativos de ECMAScript 2015 SimpleModule.js
ko: 기본 ECMAScript 2015 모듈 SimpleModule.js

source: Needless Namespacing
es: Espacios de nombres innecesarios
ko: 불필요한 네임 스페이스

source: Neither module augmentations nor global augmentations can add new items to the top level scope - they can only &ldquo;patch&rdquo; existing declarations.
es: Ni los aumentos de m&oacute;dulo ni los aumentos globales pueden agregar nuevos elementos al alcance de nivel superior; solo pueden "parchear" declaraciones existentes.
ko: 모듈 기능 보강이나 전역 기능 보강은 최상위 항목에 새 항목을 추가 할 수 없으며 기존 선언 만 "패치"할 수 있습니다.

source: Nested and merged declarations
es: Declaraciones anidadas y fusionadas
ko: 중첩 및 병합 된 선언

source: Nesting works to any level now, and merges correctly across files. Previously neither was the case.
es: El anidamiento funciona a cualquier nivel ahora,y se fusiona correctamente a través de los archivos.Antes no era así.
ko: 중첩은 이제 모든 수준에서 작동하며 파일간에 올바르게 병합됩니다. 이전에는 그렇지 않았습니다.

source: New <code>--alwaysStrict</code>
es: Nuevo - siempre <code>--alwaysStrict</code>
ko: 새롭고 <code>--alwaysStrict</code>

source: New <code>--declarationDir</code>
es: Nuevo <code>--declarationDir</code>
ko: 새로운 <code>--declarationDir</code>

source: New <code>--declarationMap</code>
es: Nuevo <code>--declarationMap</code>
ko: 새로운 <code>--declarationMap</code>

source: New <code>--downlevelIteration</code>
es: Nuevo <code>--downlevelIteration</code>
ko: 새로운 <code>--downlevelIteration</code>

source: New <code>--emitDeclarationOnly</code>
es: Nuevo <code>--emitDeclarationOnly</code>
ko: 새로운 <code>--emitDeclarationOnly</code>

source: New <code>--resolveJsonModule</code>
es: Nuevo <code>--resolveJsonModule</code>
ko: 새로운 <code>--resolveJsonModule</code>

source: New <code>--skipLibCheck</code>
es: Nuevo <code>--skipLibCheck</code>
ko: 새로운 <code>--skipLibCheck</code>

source: New <code>--strict</code> master option
es: Nueva opci&oacute;n de maestro <code>--strict</code>
ko: 새로운- <code>--strict</code> 마스터 옵션

source: New <code>.tsx</code> file extension and <code>as</code> operator
es: Nueva extensi&oacute;n de archivo <code>.tsx</code> y <code>as</code> operador
ko: 새로운 <code>.tsx</code> 의 파일 확장자와 <code>as</code> 연산자

source: New <code>jsx: react-native</code>
es: Nuevo <code>jsx: react-native</code>
ko: 새로운 <code>jsx: react-native</code>

source: New <code>unknown</code> top type
es: Nuevo tipo superior <code>unknown</code>
ko: <code>unknown</code> 새로운 유형

source: New Line - <code>newLine</code>
ko: 뉴 라인 <code>newLine</code>

source: New TypeScript Playground
es: Nueva zona de juegos de TypeScript
ko: 새로운 TypeScript 놀이터

source: New checks added to TypeScript are often off by default to avoid breaking existing projects. While avoiding breakage is a good thing, this strategy has the drawback of making it increasingly complex to choose the highest level of type safety, and doing so requires explicit opt-in action on every TypeScript release. With the <code>--strict</code> option it becomes possible to choose maximum type safety with the understanding that additional errors might be reported by newer versions of the compiler as improved type checking features are added.
es: Las nuevas comprobaciones agregadas a TypeScript a menudo est&aacute;n desactivadas de forma predeterminada para evitar romper los proyectos existentes. Si bien evitar la rotura es algo bueno, esta estrategia tiene el inconveniente de hacer que sea cada vez m&aacute;s complejo elegir el nivel m&aacute;s alto de seguridad de tipos, y hacerlo requiere una acci&oacute;n expl&iacute;cita de aceptaci&oacute;n en cada versi&oacute;n de TypeScript. Con la opci&oacute;n <code>--strict</code> es posible elegir la m&aacute;xima seguridad de tipos con el entendimiento de que las versiones m&aacute;s recientes del compilador pueden informar errores adicionales a medida que se agregan caracter&iacute;sticas mejoradas de verificaci&oacute;n de tipos.
ko: 기존 프로젝트가 중단되는 것을 막기 위해 TypeScript에 추가 된 새로운 검사는 종종 기본적으로 해제되어 있습니다. 파손을 피하는 것이 좋지만이 전략은 최고 수준의 유형 안전을 선택하는 것이 점점 더 복잡 해지는 단점이 있으며, 그렇게하려면 모든 TypeScript 릴리스에서 명시적인 옵트 인 작업이 필요합니다. <code>--strict</code> 옵션을 사용하면 향상된 유형 검사 기능이 추가됨에 따라 최신 버전의 컴파일러에서 추가 오류가보고 될 수 있다는 점을 이해하여 최대 유형 안전을 선택할 수 있습니다.

source: Next Steps
ko: 다음 단계

source: Next we have an example of how to override the constructor.
es: A continuación tenemos un ejemplo de cómo anular el constructor.
ko: 다음으로 생성자를 재정의하는 방법에 대한 예제가 있습니다.

source: Next we will add a new folder and call it <code>scripts</code>.
es: A continuaci&oacute;n, agregaremos una nueva carpeta y la llamaremos <code>scripts</code> .
ko: 다음으로 새 폴더를 추가하고이를 <code>scripts</code> 라고합니다 .

source: Next, for each type variable introduced by an <code>infer</code> (more later) declaration within <code>U</code> collect a set of candidate types by inferring from <code>T</code> to <code>U</code> (using the same inference algorithm as type inference for generic functions). For a given <code>infer</code> type variable <code>V</code>, if any candidates were inferred from co-variant positions, the type inferred for <code>V</code> is a union of those candidates. Otherwise, if any candidates were inferred from contra-variant positions, the type inferred for <code>V</code> is an intersection of those candidates. Otherwise, the type inferred for <code>V</code> is <code>never</code>.
es: A continuaci&oacute;n, para cada variable de tipo introducida por una declaraci&oacute;n <code>infer</code> ir (m&aacute;s tarde) dentro de <code>U</code> , recopile un conjunto de tipos candidatos infiriendo de <code>T</code> a <code>U</code> (utilizando el mismo algoritmo de inferencia que la inferencia de tipos para funciones gen&eacute;ricas). Para una variable de tipo de <code>infer</code> ir dada <code>V</code> , si alg&uacute;n candidato fue inferido de posiciones covariantes, el tipo inferido para <code>V</code> es una uni&oacute;n de esos candidatos. De lo contrario, si alg&uacute;n candidato se infiere de posiciones contrarias, el tipo inferido para <code>V</code> es una intersecci&oacute;n de esos candidatos. De lo contrario, el tipo inferido para <code>V</code> <code>never</code> es .
ko: 다음으로, <code>U</code> 내에서 <code>infer</code> (보다 나중에) 선언에 의해 도입 된 각 유형 변수에 대해 <code>T</code> 에서 <code>U</code> 로 추론하여 (일반 함수의 유형 추론과 동일한 추론 알고리즘 사용) 후보 유형 세트를 수집합니다 . 주어진 <code>infer</code> 유형 변수 <code>V</code> 의 경우, 후보가 공변량 위치에서 추론 된 경우 <code>V</code> 에 대해 추론되는 유형 은 해당 후보의 합집합입니다. 그렇지 않은 경우, 후보가 반 변형 위치에서 추론 된 경우 <code>V</code> 에 대해 유추 된 유형 은 해당 후보의 교집합입니다. 그렇지 않으면 <code>V</code> 에 대해 유추 된 유형 은 <code>never</code> 입니다.

source: Next, if your version of Visual Studio does not already have the latest TypeScript, you can <a href="https://www.typescriptlang.org/index.html#download-links">install it</a>.
es: A continuaci&oacute;n, si su versi&oacute;n de Visual Studio a&uacute;n no tiene la &uacute;ltima versi&oacute;n de TypeScript, puede <a href="https://www.typescriptlang.org/index.html#download-links">instalarla</a> .
ko: 다음으로 Visual Studio 버전에 최신 TypeScript가없는 경우 <a href="https://www.typescriptlang.org/index.html#download-links">설치할 수</a> 있습니다.

source: Next, let&rsquo;s create an <code>index.tsx</code> in <code>src</code> with the following source:
es: A continuaci&oacute;n, <code>index.tsx</code> un index.tsx en <code>src</code> con la siguiente fuente:
ko: 다음 소스를 사용하여 <code>src</code> 에 <code>index.tsx</code> 를 만듭니다 .

source: Next, we then use the class directly. Here we create a new variable called <code>greeterMaker</code>. This variable will hold the class itself, or said another way its constructor function. Here we use <code>typeof Greeter</code>, that is &ldquo;give me the type of the <code>Greeter</code> class itself&rdquo; rather than the instance type. Or, more precisely, &ldquo;give me the type of the symbol called <code>Greeter</code>,&rdquo; which is the type of the constructor function. This type will contain all of the static members of Greeter along with the constructor that creates instances of the <code>Greeter</code> class. We show this by using <code>new</code> on <code>greeterMaker</code>, creating new instances of <code>Greeter</code> and invoking them as before.
es: A continuaci&oacute;n, usamos la clase directamente. Aqu&iacute; creamos una nueva variable llamada <code>greeterMaker</code> . Esta variable contendr&aacute; la clase en s&iacute;, o dicho de otra manera su funci&oacute;n constructora. Aqu&iacute; usamos <code>typeof Greeter</code> , que es "dame el tipo de la clase <code>Greeter</code> en s&iacute;" en lugar del tipo de instancia. O, m&aacute;s precisamente, "dame el tipo de s&iacute;mbolo llamado <code>Greeter</code> ", que es el tipo de funci&oacute;n constructora. Este tipo contendr&aacute; todos los miembros est&aacute;ticos de Greeter junto con el constructor que crea instancias de la clase <code>Greeter</code> . Mostramos esto usando <code>new</code> en <code>greeterMaker</code> , creando nuevas instancias de <code>Greeter</code> e invoc&aacute;ndolos como antes.
ko: 다음으로 클래스를 직접 사용합니다. 여기 <code>greeterMaker</code> 라는 새 변수를 만듭니다 . 이 변수는 클래스 자체를 보유하거나 생성자 함수를 다르게 설명합니다. 여기서는 <code>typeof Greeter</code> 를 사용 합니다. 즉, 인스턴스 유형이 아닌&ldquo; <code>Greeter</code> 클래스 자체 의 유형을 제공 합니다.&rdquo; 또는 더 정확하게 는 생성자 함수의 유형 인&ldquo; <code>Greeter</code> 라는 심볼의 유형을 알려주십시오. &rdquo;입니다. 이 유형에는 <code>Greeter</code> 클래스의 인스턴스를 생성하는 생성자와 함께 Greeter의 모든 정적 멤버가 포함됩니다 . <code>greeterMaker</code> 에서 <code>new</code> 를 사용하여 <code>Greeter</code> 의 새 인스턴스를 만들어 이를 보여줍니다. 이전과 같이 호출합니다.

source: Next, we then use the class directly. Here we create a new variable called <code>greeterMaker</code>. This variable will hold the class itself, or said another way its constructor function. Here we use <code>typeof Greeter</code>, that is &ldquo;give me the type of the <code>Greeter</code> class itself&rdquo; rather than the instance type. Or, more precisely, &ldquo;give me the type of the symbol called <code>Greeter</code>,&rdquo; which is the type of the constructor function. This type will contain all of the static members of Greeter along with the constructor that creates instances of the <code>Greeter</code> class. We show this by using <code>new</code> on <code>greeterMaker</code>, creating new instances of <code>Greeter</code> and invoking them as before. It is also good to mention that changing static property is frowned upon, here <code>greeter3</code> has <code>"Hey there!"</code> instead of <code>"Hello, there"</code> on <code>standardGreeting</code>.
ko: 다음으로 클래스를 직접 사용합니다. 여기에서 <code>greeterMaker</code> 라는 새 변수를 만듭니다 . 이 변수는 클래스 자체를 보유하거나 다른 방식으로 생성자 기능을 보유합니다. 여기서는 인스턴스 유형이 아닌 " <code>Greeter</code> 클래스 자체 의 유형을 제공" 하는 <code>typeof Greeter</code> 를 사용 합니다. 또는 더 정확하게 는 생성자 함수의 유형 인 " <code>Greeter</code> 라는 기호 유형을 알려주십시오 ." 이 형식에는 <code>Greeter</code> 클래스의 인스턴스를 만드는 생성자와 함께 Greeter의 모든 정적 멤버가 포함됩니다 . <code>greeterMaker</code> 에서 <code>new</code> 를 사용하여 <code>Greeter</code> 의 새 인스턴스를 생성 하여이를 보여줍니다.이전과 같이 호출합니다. 정적 속성을 변경하는 것이 눈살을 찌푸리는 것도 언급하는 것이 좋습니다. 여기서 <code>greeter3</code> 에는 <code>"Hey there!"</code> 가 있습니다.대신 <code>"Hello, there"</code> 에 <code>standardGreeting</code> .

source: Next, we&rsquo;ll add development-time dependencies on the <a href="https://www.npmjs.com/package/ts-loader">ts-loader</a> and <a href="https://www.npmjs.com/package/source-map-loader">source-map-loader</a>.
es: A continuaci&oacute;n, agregaremos dependencias de tiempo de desarrollo en <a href="https://www.npmjs.com/package/ts-loader">ts-loader</a> y <a href="https://www.npmjs.com/package/source-map-loader">source-map-loader</a> .
ko: 다음으로 <a href="https://www.npmjs.com/package/ts-loader">ts-loader</a> 및 <a href="https://www.npmjs.com/package/source-map-loader">source-map-loader</a> 에 개발 시간 종속성을 추가 합니다.

source: Next, we&rsquo;ll create the class that will handle the combination of the two mixins. Let&rsquo;s look at this in more detail to see how it does this:
es: A continuaci&oacute;n, crearemos la clase que manejar&aacute; la combinaci&oacute;n de los dos mixins. Veamos esto con m&aacute;s detalle para ver c&oacute;mo lo hace:
ko: 다음으로 두 믹스 인의 조합을 처리 할 클래스를 만듭니다. 이것이 어떻게 작동하는지 더 자세히 살펴 보겠습니다.

source: Next, we&rsquo;ve also added the <code>@readonly</code> modifier to ensure that a property is only ever written to during initialization.
ko: 다음으로, 초기화 중에 만 속성이 기록되도록 <code>@readonly</code> 한정자를 추가했습니다 .

source: Nightly Builds
ko: 야간 빌드

source: Nightly Builds: Using NuGet with MSBuild
es: Nightly Builds:Usando NuGet con MSBuild
ko: 야간 빌드 : MSBuild와 함께 NuGet 사용

source: Nightly Builds: Using npm
es: Nightly Builds:Usando npm
ko: 야간 빌드 : npm 사용

source: Nightly builds
es: La noche se construye
ko: 야간 빌드

source: No &ldquo;main&rdquo; field
ko: "메인"필드 없음

source: No &ldquo;types&rdquo; field
ko: "유형"필드 없음

source: No Emit - <code>noEmit</code>
ko: 아니 방출 - <code>noEmit</code>

source: No Emit Helpers - <code>noEmitHelpers</code>
ko: 방출 도우미 없음 <code>noEmitHelpers</code>

source: No Emit On Error - <code>noEmitOnError</code>
ko: 오류 <code>noEmitOnError</code> 방출 없음 -noEmitOnError

source: No Error Truncation - <code>noErrorTruncation</code>
ko: 오류 잘림 없음 <code>noErrorTruncation</code>

source: No Fallthrough Cases In Switch - <code>noFallthroughCasesInSwitch</code>
ko: 스위치에 폴 스루 케이스 없음 <code>noFallthroughCasesInSwitch</code>

source: No Implicit <code>any</code>
es: No impl&iacute;cito <code>any</code>
ko: 내재 된 <code>any</code>

source: No Implicit <code>any</code> for <code>this</code>
es: No impl&iacute;cito <code>any</code> para <code>this</code>
ko: 어떤 암시 적없는 <code>any</code> 을위한 <code>this</code>

source: No Implicit Any - <code>noImplicitAny</code>
ko: 암시 적 없음 <code>noImplicitAny</code>

source: No Implicit Returns - <code>noImplicitReturns</code>
ko: 암시 적 반환 없음 <code>noImplicitReturns</code>

source: No Implicit This - <code>noImplicitThis</code>
ko: 암시 적 없음 <code>noImplicitThis</code>

source: No Implicit Use Strict - <code>noImplicitUseStrict</code>
ko: 암시 적 사용 제한 없음 <code>noImplicitUseStrict</code>

source: No Lib - <code>noLib</code>
ko: Lib 없음 <code>noLib</code>

source: No Strict Generic Checks - <code>noStrictGenericChecks</code>
ko: 엄격한 일반 검사 없음 <code>noStrictGenericChecks</code>

source: No Unused Locals - <code>noUnusedLocals</code>
ko: 사용하지 않은 로컬 없음 <code>noUnusedLocals</code>

source: No Unused Parameters - <code>noUnusedParameters</code>
ko: 사용하지 않는 매개 변수 없음 <code>noUnusedParameters</code>

source: No type is a subtype of or assignable to <code>never</code> (except <code>never</code> itself).
es: Ning&uacute;n tipo es un subtipo de o asignable a <code>never</code> (excepto <code>never</code> s&iacute; mismo).
ko: 어떤 유형에의 하위 유형 또는 양도 할 수 없습니다 <code>never</code> (제외 <code>never</code> 그 자체).

source: Node 10
ko: 노드 10

source: Node 12
ko: 노드 12

source: Nominal Reified Type Systems
ko: 공칭 Reified 유형 시스템

source: Non-Module Files
ko: 비 모듈 파일
