Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/typescript/typescript.*.003.xlf
Languages: es, ko, ru, zh_cn

source: The second part is the return type. We make it clear which is the return type by using a fat arrow (<code>=&gt;</code>) between the parameters and the return type. As mentioned before, this is a required part of the function type, so if the function doesn&rsquo;t return a value, you would use <code>void</code> instead of leaving it off.
ru: Вторая часть - это возвращаемый тип. Мы проясняем, какой тип возвращаемого значения используется толстой стрелкой ( <code>=&gt;</code> ) между параметрами и типом возвращаемого значения. Как упоминалось ранее, это обязательная часть типа функции, поэтому, если функция не возвращает значение, вы должны использовать <code>void</code> вместо того, чтобы оставлять его отключенным.
zh_cn: 第二部分是返回类型。我们通过在参数和返回类型之间使用粗箭头（ <code>=&gt;</code> ）来弄清楚哪种是返回类型。如前所述，这是函数类型的必需部分，因此，如果函数不返回值，则可以使用 <code>void</code> 而不是将其保留。

source: The second reason is when a consumer uses the &ldquo;strict null checking&rdquo; feature of TypeScript. Because unspecified parameters appear as <code>undefined</code> in JavaScript, it&rsquo;s usually fine to pass an explicit <code>undefined</code> to a function with optional arguments. This code, for example, should be OK under strict nulls:
ru: Вторая причина - это когда потребитель использует функцию TypeScript &laquo;строгая проверка нуля&raquo;. Поскольку неуказанные параметры отображаются в JavaScript как <code>undefined</code> , обычно нормально передать явное <code>undefined</code> значение функции с необязательными аргументами. Этот код, например, должен работать со строгими нулевыми значениями:
zh_cn: 第二个原因是使用者使用TypeScript的&ldquo;严格空值检查&rdquo;功能。由于未指定的参数在JavaScript中显示为 <code>undefined</code> ，因此通常最好将显式的 <code>undefined</code> 传递给带有可选参数的函数。例如，此代码在严格的空值下应该可以：

source: The second way is also perhaps the most common. Here we use <em>type argument inference</em> &ndash; that is, we want the compiler to set the value of <code>T</code> for us automatically based on the type of the argument we pass in:
ru: Второй способ тоже, пожалуй, самый распространенный. Здесь мы используем <em>вывод аргумента типа</em> - то есть мы хотим, чтобы компилятор автоматически устанавливал значение <code>T</code> для нас в зависимости от типа аргумента, который мы передаем:
zh_cn: 第二种方法也许也是最常见的。在这里，我们使用<em>类型参数推论</em> -也就是说，我们希望编译器根据传入的参数类型为我们自动设置 <code>T</code> 的值：

source: The second way uses a generic array type, <code>Array&lt;elemType&gt;</code>:
ru: Второй способ использует общий тип <code>Array&lt;elemType&gt;</code> :
zh_cn: 第二种方法使用通用数组类型 <code>Array&lt;elemType&gt;</code> ：

source: The simplest form of destructuring is array destructuring assignment:
ru: Самой простой формой деструкции является назначение деструкции массива:
zh_cn: 最简单的解构形式是数组解构赋值。

source: The simplest, and perhaps most common, type of declaration merging is interface merging. At the most basic level, the merge mechanically joins the members of both declarations into a single interface with the same name.
ru: Самым простым и,пожалуй,наиболее распространенным типом объединения деклараций является слияние интерфейсов.На самом базовом уровне,слияние механически объединяет членов обеих деклараций в один интерфейс с одинаковым именем.
zh_cn: 最简单,也可能是最常见的声明合并类型是接口合并。在最基本的层面上,合并将两个声明的成员机械地合并成一个同名的接口。

source: The snippet above is an example of type inference, explained later in the handbook.
ru: Приведенный выше отрывок является примером типового вывода,который будет объяснен позже в руководстве.
zh_cn: 上面的片段是类型推理的一个例子,在后面的手册中解释。

source: The spread operator also works:
ru: Также работает оператор разбрасывания:
zh_cn: 传播运营商也可以。

source: The spread operator is the opposite of destructuring. It allows you to spread an array into another array, or an object into another object. For example:
ru: Оператор спреда является противоположностью деструкции.Он позволяет распространять массив в другой массив,или объект в другой объект.Например:
zh_cn: 展开操作符与破坏结构相反。它允许你将一个数组扩展到另一个数组中,或者将一个对象扩展到另一个对象中。例如

source: The strategy the compiler is following
ru: Стратегия,которой придерживается компилятор
zh_cn: 编译器遵循的策略

source: The stricter checking applies to all function types, <em>except</em> those originating in method or constructor declarations. Methods are excluded specifically to ensure generic classes and interfaces (such as <code>Array&lt;T&gt;</code>) continue to mostly relate covariantly.
ru: Более строгая проверка применяется ко всем типам функций, <em>кроме</em> тех , которые возникают в объявлениях методов или конструкторов. Методы исключены специально, чтобы гарантировать, что общие классы и интерфейсы (такие как <code>Array&lt;T&gt;</code> ) в основном связаны ковариантно.
zh_cn: 严格的检查适用于所有函数类型，<em>但</em>源于方法或构造函数声明的函数类型<em>除外</em>。专门排除了方法，以确保通用类和接口（例如 <code>Array&lt;T&gt;</code> ）继续主要是协变关系。

source: The string literal union <code>Keys</code>, which contains the names of properties to iterate over.
ru: Строковый литерал union <code>Keys</code> , который содержит имена свойств для перебора.
zh_cn: 字符串文字union <code>Keys</code> ，其中包含要迭代的属性的名称。

source: The supported glob wildcards are:
ru: Поддерживаемые глобусные wildcards:
zh_cn: 支持的 glob 通配符是:

source: The syntax resembles the syntax for index signatures with a <code>for .. in</code> inside. There are three parts:
ru: Синтаксис похож на синтаксис индексных подписей с символом <code>for .. in</code> внутри. Состоит из трех частей:
zh_cn: 语法类似于索引签名的语法 <code>for .. in</code> 内部带有for..。分为三个部分：

source: The syntax should look familiar if you&rsquo;ve used C# or Java before. We declare a new class <code>Greeter</code>. This class has three members: a property called <code>greeting</code>, a constructor, and a method <code>greet</code>.
ru: Синтаксис должен выглядеть знакомым, если вы раньше использовали C # или Java. Мы объявляем новый класс <code>Greeter</code> . Этот класс состоит из трех членов: свойства, называемого <code>greeting</code> , конструктора и метода <code>greet</code> .
zh_cn: 如果您以前使用过C＃或Java，则语法看起来应该很熟悉。我们宣布一个新的类别 <code>Greeter</code> 。该类具有三个成员：一个名为 <code>greeting</code> 的属性，一个构造函数和一个 <code>greet</code> 方法。

source: The template file <a href="templates/global-d-ts"><code>global.d.ts</code></a> defines an example library <code>myLib</code>. Be sure to read the <a href="#preventing-name-conflicts">&ldquo;Preventing Name Conflicts&rdquo; footnote</a>.
ru: Файл шаблона <a href="templates/global-d-ts"> <code>global.d.ts</code> </a> определяет пример библиотеки <code>myLib</code> . Обязательно прочтите <a href="#preventing-name-conflicts">сноску &laquo;Предотвращение конфликтов имен&raquo;</a> .
zh_cn: 模板文件<a href="templates/global-d-ts"> <code>global.d.ts</code> </a>定义了一个示例库 <code>myLib</code> 。请务必阅读<a href="#preventing-name-conflicts">&ldquo;防止名称冲突&rdquo;脚注</a>。

source: The test files import the implementation files and do some testing:
ru: Тестовые файлы импортируют файлы реализации и делают некоторые проверки:
zh_cn: 测试文件导入实施文件,并做一些测试。

source: The three interfaces will merge to create a single declaration as so:
ru: Три интерфейса будут объединены для создания единой декларации:
zh_cn: 这三个接口将合并成一个声明,如是。

source: The top-level module here <code>Shapes</code> wraps up <code>Triangle</code> and <code>Square</code> for no reason. This is confusing and annoying for consumers of your module:
ru: Модуль верхнего уровня здесь <code>Shapes</code> без всякой причины объединяет <code>Triangle</code> и <code>Square</code> . Это сбивает с толку и раздражает потребителей вашего модуля:
zh_cn: <code>Shapes</code> 的顶级模块无缘无故地包裹了 <code>Triangle</code> 和 <code>Square</code> 。这会使您的模块的使用者感到困惑和烦恼：

source: The two biggest changes are the following:
ru: Двумя самыми большими изменениями являются следующие:
zh_cn: 最大的变化有以下两点。

source: The two options left more to be desired; bundling the helpers in every file was a pain point for customers trying to keep their package size small. And not including helpers, meant customers had to maintain their own helpers library.
ru: Два варианта оставили больше для того чтобы быть желанным;связывание помощников в каждом файле было болезненной точкой для клиентов пытающихся держать их размер пакета малым.И не включая помощников,означало,что клиенты должны были поддерживать свою собственную библиотеку помощников.
zh_cn: 这两个选项有很多需要改进的地方;在每一个文件中捆绑助记符对于试图保持包的大小的客户来说是一个痛苦的问题;而不包括助记符意味着客户必须维护自己的助记符库。而不包含助记符,意味着客户必须维护自己的助记符库。

source: The two samples are equivalent. Using one over the other is mostly a choice of preference; however, when using TypeScript with JSX, only <code>as</code>-style assertions are allowed.
ru: Эти два образца эквивалентны. Использование одного над другим - это в основном выбор предпочтений; однако при использовании TypeScript с JSX разрешены только утверждения <code>as</code> -style.
zh_cn: 这两个样本是等效的。优先使用一种是另一种选择。然而，使用与打字原稿时JSX，仅 <code>as</code> 样式的断言是允许的。

source: The type above means when <code>T</code> is assignable to <code>U</code> the type is <code>X</code>, otherwise the type is <code>Y</code>.
ru: Типа выше средств , когда <code>T</code> отнесен к <code>U</code> типа является <code>X</code> , в противном случае типа <code>Y</code> .
zh_cn: 上述装置的类型时 <code>T</code> 是分配给 <code>U</code> 类型是 <code>X</code> ，否则类型是 <code>Y</code> 。

source: The type checker checks the call to <code>printLabel</code>. The <code>printLabel</code> function has a single parameter that requires that the object passed in has a property called <code>label</code> of type <code>string</code>. Notice that our object actually has more properties than this, but the compiler only checks that <em>at least</em> the ones required are present and match the types required. There are some cases where TypeScript isn&rsquo;t as lenient, which we&rsquo;ll cover in a bit.
ru: Средство проверки типов проверяет вызов <code>printLabel</code> . Функция <code>printLabel</code> имеет единственный параметр, который требует, чтобы переданный объект имел свойство, называемое <code>label</code> <code>string</code> типа . Обратите внимание, что у нашего объекта на самом деле больше свойств, чем это, но компилятор проверяет только наличие <em>хотя бы</em> необходимых свойств и соответствие требуемым типам. Бывают случаи, когда TypeScript не такой снисходительный, о чем мы немного поговорим.
zh_cn: 类型检查器检查对 <code>printLabel</code> 的调用。该 <code>printLabel</code> 功能有一个要求，在传递的对象有一个名为属性单一参数 <code>label</code> 类型的 <code>string</code> 。请注意，我们的对象实际上具有比此更多的属性，但是编译器仅检查是否<em>至少</em>存在所需的属性并与所需的类型匹配。在某些情况下，TypeScript不太宽松，我们将在稍后讨论。

source: The type checker previously considered <code>null</code> and <code>undefined</code> assignable to anything. Effectively, <code>null</code> and <code>undefined</code> were valid values of <em>every</em> type and it wasn&rsquo;t possible to specifically exclude them (and therefore not possible to detect erroneous use of them).
ru: Средство проверки типов ранее считало, что <code>null</code> и <code>undefined</code> присваиваются чему-либо. Фактически, <code>null</code> и <code>undefined</code> были допустимыми значениями <em>каждого</em> типа, и их нельзя было специально исключить (и, следовательно, невозможно было обнаружить их ошибочное использование).
zh_cn: 类型检查器以前认为是 <code>null</code> ,并且 <code>undefined</code> 可分配给任何对象。实际上， <code>null</code> 和 <code>undefined</code> 是<em>每种</em>类型的有效值，并且不可能专门排除它们（因此不可能检测到它们的错误使用）。

source: The type inferred for a <code>const</code> variable or <code>readonly</code> property without a type annotation is the type of the literal initializer. The type inferred for a <code>let</code> variable, <code>var</code> variable, parameter, or non-<code>readonly</code> property with an initializer and no type annotation is the widened literal type of the initializer. Where the widened type for a string literal type is <code>string</code>, <code>number</code> for numeric literal types, <code>boolean</code> for <code>true</code> or <code>false</code> and the containing enum for enum literal types.
ru: Тип, выведенный для <code>const</code> переменной или свойства только для <code>readonly</code> без аннотации типа, является типом литерального инициализатора. Тип, выведенный для переменной <code>let</code> , переменной <code>var</code> , параметра или свойства , не предназначенного только для <code>readonly</code> с инициализатором и без аннотации типа, является расширенным литеральным типом инициализатора. Если расширенный тип для строкового литерала - это <code>string</code> , <code>number</code> для числовых литеральных типов, <code>boolean</code> для <code>true</code> или <code>false</code> и содержащее перечисление для литеральных типов перечисления.
zh_cn: 不带类型批注的 <code>const</code> 变量或 <code>readonly</code> 属性的推断类型是文字初始值设定项的类型。对于具有初始化程序的 <code>let</code> 变量， <code>var</code> 变量，参数或非 <code>readonly</code> 属性推断的类型，没有类型注释的是初始化程序的扩展文字类型。其中，字符串文字类型的加宽类型是 <code>string</code> ，数字文字类型的数字是 <code>number</code> ， <code>boolean</code> 是 <code>true</code> 或 <code>false</code> ，而包含枚举则是枚举文本类型。

source: The type information provided works together with the tools to work with JavaScript at application scale. For more examples of what&rsquo;s possible in TypeScript, see the Samples section of the website.
ru: Предоставленная информация о типе работает вместе с инструментами для работы с JavaScript в масштабе приложения. Дополнительные примеры возможностей TypeScript см. В разделе &laquo;Примеры&raquo; на веб-сайте.
zh_cn: 所提供的类型信息与在应用程序级使用JavaScript的工具一起使用。有关TypeScript功能的更多示例，请参见网站的&ldquo;样本&rdquo;部分。

source: The type of <code>import.meta</code> is the global <code>ImportMeta</code> type which is defined in <code>lib.es5.d.ts</code>. This interface is extremely limited. Adding well-known properties for Node or browsers requires interface merging and possibly a global augmentation depending on the context.
ru: Тип <code>import.meta</code> является глобальным <code>ImportMeta</code> типа , который определен в <code>lib.es5.d.ts</code> . Этот интерфейс чрезвычайно ограничен. Добавление хорошо известных свойств для узла или браузеров требует объединения интерфейсов и, возможно, глобального расширения в зависимости от контекста.
zh_cn: 的类型的 <code>import.meta</code> 是全球 <code>ImportMeta</code> 其在定义的类型 <code>lib.es5.d.ts</code> 。此接口非常有限。为Node或浏览器添加众所周知的属性需要界面合并，并可能取决于上下文进行全局扩充。

source: The type of a variable declared in a <code>for..in</code> statement is implicitly <code>string</code>.
ru: Тип переменной, объявленной в операторе <code>for..in</code> , неявно является <code>string</code> .
zh_cn: 在 <code>for..in</code> 语句中声明的变量类型隐式为 <code>string</code> 。

source: The type of generic functions is just like those of non-generic functions, with the type parameters listed first, similarly to function declarations:
ru: Тип генерических функций аналогичен типу не генерических функций,при этом параметры типа перечислены первыми,аналогично декларациям функций:
zh_cn: 通用函数的类型与非通用函数的类型一样,先列出类型参数,与函数声明类似。

source: The type of the <code>length</code> property of a tuple type with a rest element is <code>number</code>.
ru: Типом свойства <code>length</code> кортежа с остаточным элементом является <code>number</code> .
zh_cn: 具有rest元素的元组类型的 <code>length</code> 属性的类型为 <code>number</code> 。

source: The type of the <code>x</code> variable is inferred to be <code>number</code>. This kind of inference takes place when initializing variables and members, setting parameter default values, and determining function return types.
ru: Предполагается, что тип переменной <code>x</code> будет <code>number</code> . Этот вид вывода имеет место при инициализации переменных и членов, установке значений параметров по умолчанию и определении типов возвращаемых функций.
zh_cn: <code>x</code> 变量的类型推断为 <code>number</code> 。在初始化变量和成员，设置参数默认值以及确定函数返回类型时会发生这种推断。

source: The type parameter type of the <code>extends</code> expression must be constrained to a mixin constructor type.
ru: Тип параметра типа выражения <code>extends</code> должен быть ограничен типом конструктора микширования.
zh_cn: <code>extends</code> 表达式的类型参数类型必须限制为mixin构造函数类型。

source: The type system enforces that the source function&rsquo;s return type be a subtype of the target type&rsquo;s return type.
ru: Система типов требует, чтобы тип возвращаемого значения исходной функции был подтипом типа возвращаемого значения целевого типа.
zh_cn: 类型系统强制源函数的返回类型是目标类型的返回类型的子类型。

source: The type variable <code>K</code>, which gets bound to each property in turn.
ru: Переменная типа <code>K</code> , которая по очереди привязывается к каждому свойству.
zh_cn: 类型变量 <code>K</code> ，它依次绑定到每个属性。

source: The types of the attributes being passed in the JSX element should be looked up differently. Intrinsic element attributes should be known <em>intrinsically</em> whereas components will likely want to specify their own set of attributes.
ru: Типы атрибутов, передаваемых в элементе JSX, следует искать по-другому. Внутренние атрибуты элемента должны быть известны <em>внутренне,</em> тогда как компоненты, вероятно, захотят указать свой собственный набор атрибутов.
zh_cn: 在JSX元素中传递的属性的类型应以不同的方式查找。内部元素属性应该是<em>内部</em>已知的，而组件可能希望指定其自己的属性集。

source: The value of <code>&lt;TypeScriptToolsVersion&gt;1.7&lt;/TypeScriptToolsVersion&gt;</code> property in the project file identifies the compiler version to use to build (1.7 in this example). This allows a project to build against the same versions of the compiler on different machines.
ru: Значение свойства <code>&lt;TypeScriptToolsVersion&gt;1.7&lt;/TypeScriptToolsVersion&gt;</code> в файле проекта определяет версию компилятора, которая будет использоваться для сборки (1.7 в этом примере). Это позволяет проекту использовать одни и те же версии компилятора на разных машинах.
zh_cn: 项目文件中的 <code>&lt;TypeScriptToolsVersion&gt;1.7&lt;/TypeScriptToolsVersion&gt;</code> 属性的值标识要用于生成的编译器版本（在本示例中为1.7）。这允许项目在不同机器上针对相同版本的编译器进行构建。

source: The value of <code>extends</code> must be a string containing a path to another configuration file to inherit from.
ru: Значение <code>extends</code> должно быть строкой, содержащей путь к другому файлу конфигурации для наследования.
zh_cn: <code>extends</code> 的值必须是一个字符串，其中包含要从其继承的另一个配置文件的路径。

source: The variables don&rsquo;t necessarily need to both be block-scoped for TypeScript to tell us that there&rsquo;s a problem.
ru: Переменные не обязательно должны иметь блочную область видимости, чтобы TypeScript сообщал нам о проблеме.
zh_cn: 不必一定都对TypeScript的变量进行块作用域分析，以告诉我们存在问题。

source: The visibility rules for merged members is the same as described in the &lsquo;Merging Namespaces&rsquo; section, so we must export the <code>AlbumLabel</code> class for the merged class to see it. The end result is a class managed inside of another class. You can also use namespaces to add more static members to an existing class.
ru: Правила видимости для объединенных членов такие же, как описано в разделе &laquo;Объединение пространств имен&raquo;, поэтому мы должны экспортировать класс <code>AlbumLabel</code> , чтобы объединенный класс его увидел. Конечным результатом является класс, управляемый внутри другого класса. Вы также можете использовать пространства имен для добавления статических членов в существующий класс.
zh_cn: 合并成员的可见性规则与&ldquo;合并命名空间&rdquo;部分中描述的规则相同，因此我们必须导出 <code>AlbumLabel</code> 类以供合并的类查看。最终结果是在另一个类内部管理一个类。您还可以使用名称空间将更多静态成员添加到现有类。

source: The watching of directory on platforms that don&rsquo;t support recursive directory watching natively in node, is supported through recursively creating directory watcher for the child directories using different options selected by <code>TSC_WATCHDIRECTORY</code>. Note that on platforms that support native recursive directory watching (e.g windows) the value of this environment variable is ignored.
ru: Наблюдение за каталогом на платформах, которые не поддерживают рекурсивное наблюдение за каталогами изначально в узле, поддерживается посредством рекурсивного создания наблюдателя за каталогами для дочерних каталогов с использованием различных параметров, выбранных <code>TSC_WATCHDIRECTORY</code> . Обратите внимание, что на платформах, которые поддерживают собственный рекурсивный просмотр каталогов (например, окна), значение этой переменной среды игнорируется.
zh_cn: 通过使用 <code>TSC_WATCHDIRECTORY</code> 选择的不同选项为子目录递归创建目录监视程序，从而支持不支持在节点本机中进行递归目录监视的平台上的目录监视。请注意，在支持本机递归目录监视的平台（例如Windows）上，将忽略此环境变量的值。

source: The way that TypeScript decides on whether a version of the compiler &amp; language matches is by using Node&rsquo;s <a href="https://github.com/npm/node-semver#ranges">semver ranges</a>.
ru: Способ, которым TypeScript определяет, соответствует ли версия компилятора и языка, - это использование <a href="https://github.com/npm/node-semver#ranges">диапазонов семвера</a> узла .
zh_cn: TypeScript决定编译器和语言版本是否匹配的方法是使用Node的<a href="https://github.com/npm/node-semver#ranges">semver range</a>。

source: The way that this works is that when using <code>allowJs</code>, TypeScript has some best-effort analyses to understand common JavaScript patterns; however, the way that some patterns are expressed in JavaScript don&rsquo;t necessarily look like their equivalents in TypeScript. When <code>declaration</code> emit is turned on, TypeScript figures out the best way to transform JSDoc comments and CommonJS exports into valid type declarations and the like in the output <code>.d.ts</code> files.
ru: Это работает следующим образом: при использовании <code>allowJs</code> TypeScript выполняет некоторый анализ с максимальными усилиями для понимания общих шаблонов JavaScript; однако способ, которым некоторые шаблоны выражаются в JavaScript, не обязательно похож на их эквиваленты в TypeScript. Когда <code>.d.ts</code> <code>declaration</code> , TypeScript находит лучший способ преобразовать комментарии JSDoc и экспорт CommonJS в допустимые объявления типов и тому подобное в выходных файлах .d.ts .
zh_cn: 它的工作方式是，在使用 <code>allowJs</code> 时，TypeScript会进行一些尽力而为的分析以了解常见的JavaScript模式。但是，用JavaScript表示某些模式的方式不一定看起来像它们在TypeScript中的等效形式。当 <code>declaration</code> EMIT开启时，打字稿数字是最好的出路改造JSDoc意见和CommonJS的出口为有效的类型声明等的输出 <code>.d.ts</code> 文件。

source: Then consumed it:
ru: Потом съел его:
zh_cn: 然后把它吃了。

source: Then install <code>typescript</code>, <code>gulp</code> and <code>gulp-typescript</code> in your project&rsquo;s dev dependencies. <a href="https://www.npmjs.com/package/gulp-typescript">Gulp-typescript</a> is a gulp plugin for Typescript.
ru: Затем установите <code>typescript</code> , <code>gulp</code> и <code>gulp-typescript</code> в зависимости от разработчика вашего проекта. <a href="https://www.npmjs.com/package/gulp-typescript">Gulp-typescript</a> - это плагин gulp для Typescript.
zh_cn: 然后在项目的开发依赖项中安装 <code>typescript</code> ， <code>gulp</code> 和 <code>gulp-typescript</code> 。<a href="https://www.npmjs.com/package/gulp-typescript">Gulp-</a> typescript是Typescript的gulp插件。

source: Then the <code>food</code> property in <code>defaults</code> overwrites <code>food: "rich"</code>, which is not what we want in this case.
ru: Затем свойство <code>food</code> по <code>defaults</code> перезаписывает <code>food: "rich"</code> , чего мы не хотим в данном случае.
zh_cn: 然后， <code>defaults</code> ， <code>food</code> 属性将覆盖 <code>food: "rich"</code> ，在这种情况下，这不是我们想要的。
