Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/typescript/typescript.*.003.xlf
Languages: es, ko, ru, zh_cn

source: Sometimes you&rsquo;ll entirely overwrite the exports object. This is a common pattern people use to make their modules immediately callable like in this snippet:
ru: Иногда вы полностью перезаписываете объект экспорта. Это обычный шаблон, который люди используют для немедленного вызова своих модулей, как в этом фрагменте:
zh_cn: 有时您会完全覆盖导出对象。这是人们用来使其模块可立即调用的常见模式，如以下代码段所示：

source: Specifies the location where debugger should locate TypeScript files instead of source locations. Use this flag if the sources will be located at run-time in a different location than that at design-time. The location specified will be embedded in the sourceMap to direct the debugger where the source files will be located.
ru: Указывает место,где отладчик должен найти файлы TypeScript вместо исходных.Используйте этот флаг,если исходные тексты будут находиться во время исполнения в другом месте,нежели во время проектирования.Указанное место будет встроено в sourceMap,чтобы направить отладчик туда,где будут находиться исходные файлы.
zh_cn: 指定调试器应该定位TypeScript文件的位置,而不是源文件的位置。如果源文件在运行时的位置与设计时的位置不同,则使用该标志。指定的位置将被嵌入到sourceMap中,以指导调试器将源文件定位在哪里。

source: Specifies the location where debugger should locate map files instead of generated locations. Use this flag if the .map files will be located at run-time in a different location than the .js files. The location specified will be embedded in the sourceMap to direct the debugger where the map files will be located. This flag will not create the specified path and generate the map files in that location. Instead, create a post build step that moves the files to the specified path.
ru: Указывает место,где отладчик должен располагать картографические файлы вместо сгенерированных местоположений.Используйте этот флаг,если файлы .map будут расположены во время выполнения в другом месте,нежели .js файлы.Указанное место будет встроено в sourceMap,чтобы указать отладчику,где будут находиться картографические файлы.Этот флаг не будет создавать указанный путь и генерировать файлы карты в этом месте.Вместо этого создайте шаг пост-строки,который перемещает файлы по указанному пути.
zh_cn: 指定调试器应该定位地图文件的位置,而不是生成的位置。如果.map文件将在运行时位于与.js文件不同的位置,请使用该标志。指定的位置将被嵌入到sourceMap中,以指导调试器将地图文件定位在哪里。这个标志不会创建指定的路径并在该位置生成地图文件。取而代之的是,创建一个后期构建步骤,将文件移动到指定的路径。

source: Specifies the object invoked for <code>createElement</code> and <code>__spread</code> when targeting <code>"react"</code> JSX emit.
ru: Определяет объект, вызываемый для <code>createElement</code> и <code>__spread</code> при нацеливании на <code>"react"</code> отправку JSX.
zh_cn: 指定针对 <code>"react"</code> JSX发射时为 <code>createElement</code> 和 <code>__spread</code> 调用的对象。

source: Specifies the root directory of input files. Only use to control the output directory structure with <code>--outDir</code>.
ru: Задает корневой каталог входных файлов. Используйте только для управления структурой выходного каталога с помощью <code>--outDir</code> .
zh_cn: 指定输入文件的根目录。仅用于 <code>--outDir</code> 来控制输出目录结构。

source: Specify <code>"types": []</code> to disable automatic inclusion of <code>@types</code> packages.
ru: Укажите <code>"types": []</code> чтобы отключить автоматическое включение пакетов <code>@types</code> .
zh_cn: 指定 <code>"types": []</code> 以禁用自动包含 <code>@types</code> 软件包。

source: Specify ECMAScript target version:
ru: Укажите целевую версию ECMAScript:
zh_cn: 指定ECMAScript的目标版本。

source: Specify module code generation: <code>"None"</code>, <code>"CommonJS"</code>, <code>"AMD"</code>, <code>"System"</code>, <code>"UMD"</code>, <code>"ES6"</code>, <code>"ES2015"</code> or <code>"ESNext"</code>.
ru: Укажите генерацию кода модуля: <code>"None"</code> , <code>"CommonJS"</code> , <code>"AMD"</code> , <code>"System"</code> , <code>"UMD"</code> , <code>"ES6"</code> , <code>"ES2015"</code> или <code>"ESNext"</code> .
zh_cn: 指定模块代码生成： <code>"None"</code> ， <code>"CommonJS"</code> ， <code>"AMD"</code> ， <code>"System"</code> ， <code>"UMD"</code> ， <code>"ES6"</code> ， <code>"ES2015"</code> 或 <code>"ESNext"</code> 。

source: Specify the JSX factory function to use when targeting react JSX emit, e.g. <code>React.createElement</code> or <code>h</code>.
ru: Укажите фабричную функцию JSX для использования при нацеливании на испускание <code>React.createElement</code> JSX, например React.createElement или <code>h</code> .
zh_cn: 指定在定向 <code>React.createElement</code> JSX发出时要使用的JSX工厂函数，例如React.createElement或 <code>h</code> 。

source: Specify what file to store incremental build information in.
ru: Укажите,в каком файле хранить информацию об инкрементной сборке.
zh_cn: 指定存储增量构建信息的文件。

source: Specifying <code>--outFile</code> in conjunction with <code>--module amd</code> or <code>--module system</code> will concatenate all modules in the compilation into a single output file containing multiple module closures.
ru: Указание <code>--outFile</code> в сочетании с <code>--module amd</code> или <code>--module system</code> объединит все модули в компиляции в один выходной файл, содержащий несколько закрытий модулей.
zh_cn: 与 <code>--module amd</code> 或 <code>--module system</code> 一起指定 <code>--outFile</code> 会将编译中的所有模块连接到一个包含多个模块闭包的单个输出文件中。

source: Specifying the type of <code>this</code> for functions
ru: Указание типа <code>this</code> для функций
zh_cn: 指定的类型， <code>this</code> 对于功能

source: Speed improvements
ru: Улучшение скорости
zh_cn: 提高速度

source: Splitting Across Files
ru: Разделение файлов по разделам
zh_cn: 跨文件分割

source: Spread expressions with tuple types
ru: Распространение выражений с типами кортежей
zh_cn: 用元组类型展开表达式

source: Stable packages are available here:
ru: Стабильные пакеты доступны здесь:
zh_cn: 这里有稳定的套餐。

source: Starting TypeScript 2.9 errors are displayed under <code>--pretty</code> by default if the output device is applicable for colorful text. TypeScript will check if the output steam has <a href="https://nodejs.org/api/tty.html"><code>isTty</code></a> property set.
ru: Ошибки <code>--pretty</code> TypeScript 2.9 по умолчанию отображаются в разделе --pretty , если устройство вывода применимо для цветного текста. TypeScript проверит, установлено <a href="https://nodejs.org/api/tty.html"> <code>isTty</code> </a> свойство isTty для выходного пара .
zh_cn: 如果输出设备适用于彩色文本，则默认情况下在 <code>--pretty</code> 下显示启动TypeScript 2.9错误。TypeScript将检查输出流是否已设置<a href="https://nodejs.org/api/tty.html"> <code>isTty</code> </a>属性。

source: Starting from release 1.6 TypeScript compiler will use different set of rules to resolve module names when targeting &lsquo;commonjs&rsquo;. These <a href="https://github.com/Microsoft/TypeScript/issues/2338">rules</a> attempted to model module lookup procedure used by Node. This effectively mean that node modules can include information about its typings and TypeScript compiler will be able to find it. User however can override module resolution rules picked by the compiler by using <code>--moduleResolution</code> command line option. Possible values are:
ru: Начиная с версии 1.6 компилятор TypeScript будет использовать другой набор правил для разрешения имен модулей при нацеливании на commonjs. Эти <a href="https://github.com/Microsoft/TypeScript/issues/2338">правила</a> пытались смоделировать процедуру поиска модуля, используемую Node. Это фактически означает, что модули узлов могут включать информацию о своих типах, и компилятор TypeScript сможет ее найти. Однако пользователь может переопределить правила разрешения модулей, выбранные компилятором, используя параметр командной строки <code>--moduleResolution</code> . Возможные значения:
zh_cn: 从1.6版开始，TypeScript编译器在定位&ldquo; commonjs&rdquo;时将使用不同的规则集来解析模块名称。这些<a href="https://github.com/Microsoft/TypeScript/issues/2338">规则</a>试图为Node使用的模块查找过程建模。这实际上意味着节点模块可以包含有关其类型的信息，并且TypeScript编译器将能够找到它。但是，用户可以使用 <code>--moduleResolution</code> 命令行选项来覆盖编译器选择的模块解析规则。可能的值为：

source: Starting out
ru: Начало работы
zh_cn: 起步

source: Starting with ECMAScript 2015, <code>symbol</code> is a primitive data type, just like <code>number</code> and <code>string</code>.
ru: Начиная с ECMAScript 2015, <code>symbol</code> является примитивным типом данных, как <code>number</code> и <code>string</code> .
zh_cn: 从ECMAScript 2015开始， <code>symbol</code> 是一种原始数据类型，就像 <code>number</code> 和 <code>string</code> 一样。

source: Starting with ECMAScript 2015, JavaScript has a concept of modules. TypeScript shares this concept.
ru: Начиная с ECMAScript 2015,JavaScript имеет концепцию модулей.TypeScript разделяет это понятие.
zh_cn: 从ECMAScript 2015开始,JavaScript有了模块的概念。TypeScript也有这个概念。

source: Starting with ECMAScript 2015, modules are native part of the language, and should be supported by all compliant engine implementations. Thus, for new projects modules would be the recommended code organization mechanism.
ru: Начиная с ECMAScript 2015,модули являются родной частью языка и должны поддерживаться всеми совместимыми реализациями движков.Таким образом,для новых проектов модулями будет рекомендован механизм организации кода.
zh_cn: 从ECMAScript 2015开始,模块是语言的原生部分,应该被所有兼容的引擎实现所支持。因此,对于新项目,模块将是推荐的代码组织机制。

source: Starting with TypeScript 1.8, official NuGet packages are available for the Typescript Compiler (<code>tsc.exe</code>) as well as the MSBuild integration (<code>Microsoft.TypeScript.targets</code> and <code>Microsoft.TypeScript.Tasks.dll</code>).
ru: Начиная с TypeScript 1.8, официальные пакеты NuGet доступны для компилятора <code>tsc.exe</code> ( tsc.exe ), а также для интеграции с MSBuild ( <code>Microsoft.TypeScript.targets</code> и <code>Microsoft.TypeScript.Tasks.dll</code> ).
zh_cn: 从TypeScript 1.8开始，正式的NuGet软件包可用于Typescript编译器（ <code>tsc.exe</code> ）以及MSBuild集成（ <code>Microsoft.TypeScript.targets</code> 和 <code>Microsoft.TypeScript.Tasks.dll</code> ）。

source: Starting with TypeScript 1.8:
ru: Начиная с TypeScript 1.8:
zh_cn: 从TypeScript 1.8开始。

source: Starting with TypeScript 2.3, the default <code>tsconfig.json</code> generated by <code>tsc --init</code> includes a <code>"strict": true</code> setting in the <code>"compilerOptions"</code> section. Thus, new projects started with <code>tsc --init</code> will by default have the highest level of type safety enabled.
ru: Начиная с TypeScript 2.3, по умолчанию <code>tsconfig.json</code> , сгенерированный <code>tsc --init</code> , включает параметр <code>"strict": true</code> в разделе <code>"compilerOptions"</code> . Таким образом, в новых проектах, запущенных с <code>tsc --init</code> , по умолчанию будет включен самый высокий уровень безопасности типов.
zh_cn: 从TypeScript 2.3开始，由 <code>tsc --init</code> <code>tsconfig.json</code> 生成的默认tsconfig.json在 <code>"compilerOptions"</code> 部分包含 <code>"strict": true</code> 设置。因此，默认情况下，以 <code>tsc --init</code> 开头的新项目将启用最高级别的类型安全性。

source: Statements guaranteed to not be executed at run time are now correctly flagged as unreachable code errors. For instance, statements following unconditional <code>return</code>, <code>throw</code>, <code>break</code> or <code>continue</code> statements are considered unreachable. Use <code>--allowUnreachableCode</code> to disable unreachable code detection and reporting.
ru: Операторы, которые гарантированно не будут выполнены во время выполнения, теперь правильно помечаются как недостижимые ошибки кода. Например, операторы, следующие за операторами безусловного <code>return</code> , <code>throw</code> , <code>break</code> или <code>continue</code> , считаются недостижимыми. Используйте <code>--allowUnreachableCode</code> , чтобы отключить обнаружение недоступного кода и создание отчетов.
zh_cn: 现在，已保证在运行时不执行的语句已正确标记为不可访问的代码错误。例如，无条件 <code>return</code> ， <code>throw</code> ， <code>break</code> 或 <code>continue</code> 语句之后的语句被认为是不可访问的。使用 <code>--allowUnreachableCode</code> 禁用不可达代码检测和报告。

source: Static Properties
ru: Статические свойства
zh_cn: 静态属性

source: Static methods on an exported class have a similar problem - the class itself adds a layer of nesting. Unless it increases expressivity or intent in a clearly useful way, consider simply exporting a helper function.
ru: Статические методы на экспортируемом классе имеют аналогичную проблему-сам класс добавляет слой вложенности.Если только это не увеличивает экспрессивность или намерение явно полезным способом,рассмотрим вариант простого экспорта вспомогательной функции.
zh_cn: 导出类上的静态方法也有类似的问题--类本身增加了一层嵌套。除非它以明显有用的方式增加了表现力或意图,否则可以考虑简单地导出一个辅助函数。

source: Strict <code>null</code> &amp; <code>undefined</code> Checks
ru: Строгие <code>null</code> и <code>undefined</code> проверки
zh_cn: 严格的 <code>null</code> 和 <code>undefined</code> 检查

source: Strict Class Initialization
ru: Строгая классовая инициализация
zh_cn: 严格的类初始化

source: Strict contravariance for callback parameters
ru: Строгое противоречие для параметров обратного вызова
zh_cn: 回调参数的严格反差。

source: Strict function types
ru: Типы строгих функций
zh_cn: 严格的函数类型

source: Stricter Generators
ru: Более строгие генераторы
zh_cn: 更严格的发电机

source: Stricter Generics
ru: Более строгие общие черты
zh_cn: 更严格的通用名词

source: Stricter checking for generic functions
ru: Более строгая проверка общих функций
zh_cn: 对通用函数进行更严格的检查

source: Stricter object literal assignment checks
ru: Более строгие проверки буквального назначения объектов
zh_cn: 更严格的对象文字赋值检查

source: String Enums
ru: Строковые перечню
zh_cn: 字符串枚举

source: String Literal Types
ru: Буквальные типы строк
zh_cn: 字符串类型

source: String enums
ru: Струнные перечисления
zh_cn: 字符串枚举

source: String enums are a similar concept, but have some subtle <a href="#enums-at-runtime">runtime differences</a> as documented below. In a string enum, each member has to be constant-initialized with a string literal, or with another string enum member.
ru: Перечисления строк представляют собой аналогичную концепцию, но имеют некоторые тонкие <a href="#enums-at-runtime">различия во время выполнения,</a> как описано ниже. В строковом перечислении каждый член должен быть инициализирован константой строковым литералом или другим строковым членом перечисления.
zh_cn: 字符串枚举是一个相似的概念，但是在<a href="#enums-at-runtime">运行时方面</a>有一些细微的差别，如下所述。在字符串枚举中，每个成员都必须使用字符串文字或另一个字符串枚举成员进行常量初始化。

source: String literal types
ru: Типы струнных букв
zh_cn: 字符串类型

source: String literal types allow you to specify the exact value a string must have. In practice string literal types combine nicely with union types, type guards, and type aliases. You can use these features together to get enum-like behavior with strings.
ru: Типы строковых литералов позволяют указать точное значение,которое должна иметь строка.На практике строковые типы литералов прекрасно сочетаются с союзными типами,защитниками типов и псевдонимами типов.Вы можете использовать эти возможности вместе,чтобы получить enum-подобное поведение со строками.
zh_cn: 字符串类型允许你指定一个字符串必须具有的精确值。在实践中,字符串文字类型与联合类型、类型守卫和类型别名结合得很好。你可以一起使用这些特性来获得类似枚举的字符串行为。

source: String literal types can be used in the same way to distinguish overloads:
ru: Типы строковых литералов могут быть использованы таким же образом,чтобы различать перегрузки:
zh_cn: 字符串文字类型可以用同样的方式来区分重载。

source: String, numeric and boolean literal types (e.g. <code>"abc"</code>, <code>1</code>, and <code>true</code>) were previously inferred only in the presence of an explicit type annotation. Starting with TypeScript 2.1, literal types are <em>always</em> inferred for <code>const</code> variables and <code>readonly</code> properties.
ru: Строковые, числовые и логические типы литералов (например, <code>"abc"</code> , <code>1</code> и <code>true</code> ) ранее выводились только при наличии явной аннотации типа. Начиная с TypeScript 2.1, буквенные типы <em>всегда</em> выводятся для <code>const</code> переменных и свойств только для <code>readonly</code> .
zh_cn: 字符串，数字和布尔文字类型（例如 <code>"abc"</code> ， <code>1</code> 和 <code>true</code> ）以前仅在存在显式类型注释的情况下才推断出来。从TypeScript 2.1开始，<em>始终</em>为 <code>const</code> 变量和 <code>readonly</code> 属性推断文字类型。

source: String-like properties of an object type are those declared using an identifier, a string literal, or a computed property name of a string literal type.
ru: Свойствами,подобными строковому типу объекта,являются свойства,объявленные с помощью идентификатора,строкового литерала или вычисленного имени свойства типа строкового литерала.
zh_cn: 对象类型的字符串类属性是指那些使用标识符、字符串文字或字符串文字类型的计算属性名声明的属性。

source: Structurally identical, but distinct, class types are now preserved in union types (instead of eliminating all but one).
ru: Структурно идентичные,но отличные,классовые типы теперь сохраняются в союзных типах (вместо того,чтобы ликвидировать все,кроме одного).
zh_cn: 结构上相同但不同的类类型现在被保留在联合类型中(而不是除一个类型外全部取消)。

source: Structuring for outFiles
ru: Структурирование для outFiles
zh_cn: OutFiles的结构

source: Structuring for relative modules
ru: Структурирование для относительных модулей
zh_cn: 相对模块的结构

source: Structuring modules to give the exact API shape you want can be tricky. For example, we might want a module that can be invoked with or without <code>new</code> to produce different types, has a variety of named types exposed in a hierarchy, and has some properties on the module object as well.
ru: Структурирование модулей для получения точной формы API, которую вы хотите, может быть сложной задачей. Например, нам может потребоваться модуль, который может быть вызван с <code>new</code> или без него для создания различных типов, имеет множество именованных типов, представленных в иерархии, а также имеет некоторые свойства объекта модуля.
zh_cn: 构建模块以提供所需的确切API形状可能很棘手。例如，我们可能希望一个模块，无论有没有 <code>new</code> 的模块都可以调用它以产生不同的类型，在层次结构中公开各种命名类型，并且在模块对象上也具有一些属性。

source: Stylize errors and messages using color and context.
ru: Стилизируйте ошибки и сообщения,используя цвет и контекст.
zh_cn: 使用颜色和上下文对错误和信息进行样式化。

source: Sublime Text
ru: Великолепный Текст
zh_cn: 崇高的文本

source: Subtype vs Assignment
ru: Подтип против Присвоения
zh_cn: 子类型与分配

source: Support &lsquo;target : es5&rsquo; with &lsquo;module: es6&rsquo;
ru: Поддержка 'target: es5' с 'module: es6'
zh_cn: 通过'module：es6'支持'target：es5'

source: Support <code>number</code> and <code>symbol</code> named properties with <code>keyof</code> and mapped types
ru: Поддержка свойств с <code>keyof</code> <code>number</code> и <code>symbol</code> с типами keyof и mapped
zh_cn: 支持带有 <code>keyof</code> 和映射类型的 <code>number</code> 和 <code>symbol</code> 命名属性

source: Support JSX in <code>.tsx</code> files: <code>"react"</code>, <code>"preserve"</code>, <code>"react-native"</code>. See <a href="jsx">JSX</a>.
ru: Поддержка JSX в файлах <code>.tsx</code> : <code>"react"</code> , <code>"preserve"</code> , <code>"react-native"</code> нативно &raquo; . См. <a href="jsx">JSX</a> .
zh_cn: 在 <code>.tsx</code> 文件中支持JSX ： <code>"react"</code> ， <code>"preserve"</code> 和 <code>"react-native"</code> 。参见<a href="jsx">JSX</a>。

source: Support for <code>--target ES2016</code>, <code>--target ES2017</code> and <code>--target ESNext</code>
ru: Поддержка <code>--target ES2016</code> , <code>--target ES2017</code> и <code>--target ESNext</code>
zh_cn: 支持 <code>--target ES2016</code> ，-- <code>--target ES2017</code> 和 <code>--target ESNext</code>

source: Support for <code>--target ES6</code> with <code>--module</code>
ru: Поддержка <code>--target ES6</code> с <code>--module</code>
zh_cn: 通过 <code>--module</code> 支持 <code>--target ES6</code>

source: Support for <code>UMD</code> and <code>System</code> module output
ru: Поддержка вывода <code>UMD</code> и <code>System</code> модуля
zh_cn: 支持 <code>UMD</code> 和 <code>System</code> 模块输出

source: Support for <code>default</code> import interop with SystemJS
ru: Поддержка взаимодействия импорта по <code>default</code> с SystemJS
zh_cn: 支持使用SystemJS的 <code>default</code> 导入互操作

source: Support for <code>defaultProps</code> in JSX
ru: Поддержка <code>defaultProps</code> в JSX
zh_cn: 支持JSX中的 <code>defaultProps</code>

source: Support for <code>import d from "cjs"</code> from CommonJS modules with <code>--esModuleInterop</code>
ru: Поддержка <code>import d from "cjs"</code> из модулей CommonJS с <code>--esModuleInterop</code>
zh_cn: 使用 <code>--esModuleInterop</code> 支持从CommonJS模块的 <code>import d from "cjs"</code>

source: Support for <code>import.meta</code>
ru: Поддержка <code>import.meta</code>
zh_cn: 支持 <code>import.meta</code>

source: Support for <code>new.target</code>
ru: Поддержка <code>new.target</code>
zh_cn: 支持 <code>new.target</code>

source: Support for Mix-in classes
ru: Поддержка классов Mix-in
zh_cn: 支持混合班

source: Support for UMD module definitions
ru: Поддержка определений модулей UMD
zh_cn: 支持UMD模块定义

source: Support for decorators when targeting ES3
ru: Поддержка декораторов при нацеливании на ES3
zh_cn: 支持以ES3为目标的装饰器

source: Support for external helpers library (<code>tslib</code>)
ru: Поддержка библиотеки внешних помощников ( <code>tslib</code> )
zh_cn: 支持外部帮助程序库（ <code>tslib</code> ）

source: Support for plain JavaScript files (using <code>allowJS</code> and optionally <code>checkJs</code>)
ru: Поддержка простых файлов JavaScript (с использованием <code>allowJS</code> и, возможно, <code>checkJs</code> )
zh_cn: 支持纯JavaScript文件（使用 <code>allowJS</code> 和可选的 <code>checkJs</code> ）

source: Support for spread operator on JSX element children
ru: Поддержка оператора спреда на детях JSX-элементов
zh_cn: 支持JSX元素子代上的传播操作符

source: Support output to IPC-driven files
ru: Поддержка вывода в IPC-управляемых файлов
zh_cn: 支持输出到IPC驱动的文件

source: Supported JSDoc
ru: Поддерживаемый JSDoc
zh_cn: 支持的JSDoc

source: Suppress <code>--noImplicitAny</code> errors for indexing objects lacking index signatures. See <a href="https://github.com/Microsoft/TypeScript/issues/1232#issuecomment-64510362">issue #1232</a> for more details.
ru: Подавить <code>--noImplicitAny</code> ошибки при индексировании объектов без подписи индекса. Подробнее см. В <a href="https://github.com/Microsoft/TypeScript/issues/1232#issuecomment-64510362">выпуске № 1232</a> .
zh_cn: 抑制 <code>--noImplicitAny</code> 索引缺少索引签名的对象的任何错误。有关更多详细信息，请参见<a href="https://github.com/Microsoft/TypeScript/issues/1232#issuecomment-64510362">问题＃1232</a>。

source: Suppress errors in .ts files using &lsquo;// @ts-ignore&rsquo; comments
ru: Подавление ошибок в файлах .ts с помощью комментариев '// @ ts-ignore'
zh_cn: 使用'// @ ts-ignore'注释抑制.ts文件中的错误

source: Suppress excess property checks for object literals.
ru: Подавить проверку избыточного имущества для буквенных обозначений объектов.
zh_cn: 抑制对对象字面的多余属性检查。

source: Symbol-like properties of an object type are those declared using a computed property name of a unique symbol type.
ru: Символоподобными свойствами типа объекта являются свойства,объявленные с помощью вычисленного имени свойства уникального символьного типа.
zh_cn: 对象类型的符号类属性是指使用唯一符号类型的计算属性名声明的属性。

source: Symbols are immutable, and unique.
ru: Символы неизменны и уникальны.
zh_cn: 符号是不可改变的,也是独一无二的。

source: Symbols can also be combined with computed property declarations to declare object properties and class members.
ru: Символы также могут быть объединены с вычисленными объявлениями свойств для объявления свойств объекта и членов класса.
zh_cn: 符号也可以结合计算属性声明来声明对象属性和类成员。

source: Symbols: match
ru: Символы:совпадение
zh_cn: 符号:匹配

source: Symbols: split
ru: Символы:раскол
zh_cn: 符号:分裂

source: System SimpleModule.js
ru: Система SimpleModule.js
zh_cn: 系统SimpleModule.js

source: System modules have this flag on by default.
ru: По умолчанию системные модули имеют этот флаг.
zh_cn: 系统模块默认开启该标志。

source: Table of Contents
ru: Содержание
zh_cn: 目录

source: Table of contents
ru: Оглавление
zh_cn: 目录

source: Tagged template strings in ES3/ES5
ru: Помеченные строки шаблонов в ES3/ES5
zh_cn: 标签:ES3/ES5中的模板字符串
