Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/typescript/typescript.*.003.xlf
Languages: es, ko, ru, zh_cn

source: Keep in mind that automatic inclusion is only important if you&rsquo;re using files with global declarations (as opposed to files declared as modules). If you use an <code>import "foo"</code> statement, for instance, TypeScript may still look through <code>node_modules</code> &amp; <code>node_modules/@types</code> folders to find the <code>foo</code> package.
es: Tenga en cuenta que la inclusi&oacute;n autom&aacute;tica solo es importante si utiliza archivos con declaraciones globales (a diferencia de los archivos declarados como m&oacute;dulos). Si usa una declaraci&oacute;n de <code>import "foo"</code> , por ejemplo, TypeScript a&uacute;n puede buscar en las carpetas <code>node_modules</code> y <code>node_modules/@types</code> para encontrar el paquete <code>foo</code> .
ko: 자동 선언은 전역 선언이있는 파일 (모듈로 선언 된 파일이 아닌)을 사용하는 경우에만 중요합니다. 예를 들어 <code>import "foo"</code> 문 을 사용하는 경우 TypeScript는 여전히 <code>node_modules</code> &amp; <code>node_modules/@types</code> 폴더를 통해 <code>foo</code> 패키지 를 찾을 수 있습니다.

source: Keep in mind that for simple code like above, you probably shouldn&rsquo;t be trying to &ldquo;get around&rdquo; these checks. For more complex object literals that have methods and hold state, you might need to keep these techniques in mind, but a majority of excess property errors are actually bugs. That means if you&rsquo;re running into excess property checking problems for something like option bags, you might need to revise some of your type declarations. In this instance, if it&rsquo;s okay to pass an object with both a <code>color</code> or <code>colour</code> property to <code>createSquare</code>, you should fix up the definition of <code>SquareConfig</code> to reflect that.
es: Tenga en cuenta que para un c&oacute;digo simple como el anterior, probablemente no deber&iacute;a intentar "sortear" estas comprobaciones. Para literales de objetos m&aacute;s complejos que tienen m&eacute;todos y estado de retenci&oacute;n, es posible que deba tener en cuenta estas t&eacute;cnicas, pero la mayor&iacute;a de los errores de propiedad en exceso son en realidad errores. Eso significa que si tiene problemas de verificaci&oacute;n de exceso de propiedad para algo como bolsas de opciones, es posible que deba revisar algunas de sus declaraciones de tipo. En este caso, si est&aacute; bien pasar un objeto con una propiedad de <code>color</code> o de <code>colour</code> a <code>createSquare</code> , debe corregir la definici&oacute;n de <code>SquareConfig</code> para reflejar eso.
ko: 위와 같은 간단한 코드의 경우 이러한 검사를 "해결"하려고 시도해서는 안됩니다. 메서드가 있고 상태를 유지하는 더 복잡한 개체 리터럴의 경우 이러한 기술을 염두에 두어야하지만 과도한 속성 오류의 대부분은 실제로 버그입니다. 즉, 옵션 백과 같은 속성에 대한 초과 속성 검사 문제가 발생하면 일부 유형 선언을 수정해야 할 수도 있습니다. 이 경우, <code>createSquare</code> 에 <code>color</code> 또는 <code>colour</code> 속성이 있는 객체 를 전달해도 괜찮다면 SquareConfig 정의를 <code>SquareConfig</code> 하여 반영해야합니다.

source: Keep in mind that our support for async iterators relies on support for <code>Symbol.asyncIterator</code> to exist at runtime. You may need to polyfill <code>Symbol.asyncIterator</code>, which for simple purposes can be as simple as: <code>(Symbol as any).asyncIterator = Symbol.asyncIterator || Symbol.for("Symbol.asyncIterator");</code>
es: Tenga en cuenta que nuestro soporte para iteradores as&iacute;ncronos depende del soporte para que <code>Symbol.asyncIterator</code> exista en tiempo de ejecuci&oacute;n. Es posible que necesite <code>Symbol.asyncIterator</code> , que para prop&oacute;sitos simples puede ser tan simple como: <code>(Symbol as any).asyncIterator = Symbol.asyncIterator || Symbol.for("Symbol.asyncIterator");</code>
ko: 비동기 반복자에 대한 지원 은 런타임에 존재 하는 <code>Symbol.asyncIterator</code> 에 대한 지원에 의존 합니다. 간단한 목적을 위해 다음과 같이 간단 할 수있는 <code>Symbol.asyncIterator</code> 를 polyfill해야 할 수도 있습니다. <code>(Symbol as any).asyncIterator = Symbol.asyncIterator || Symbol.for("Symbol.asyncIterator");</code>

source: Keep in mind that string enum members <em>do not</em> get a reverse mapping generated at all.
es: Tenga en cuenta que los miembros de la enumeraci&oacute;n de cadenas <em>no</em> obtienen una asignaci&oacute;n inversa generada en absoluto.
ko: 문자열 열거 형 멤버 <em>는</em> 리버스 매핑을 전혀 생성 <em>하지 않습니다</em> .

source: Keep outdated console output in watch mode instead of clearing the screen
es: Mantener la salida de la consola desactualizada en el modo de reloj en lugar de borrar la pantalla
ko: 화면을 지우지 않고 오래된 콘솔 출력을 시계 모드로 유지

source: Keeping the same runtime behavior as JavaScript is a foundational promise of TypeScript because it means you can easily transition between the two languages without worrying about subtle differences that might make your program stop working.
ko: JavaScript와 동일한 런타임 동작을 유지하는 것은 TypeScript의 기본 약속입니다. 이는 프로그램 작동을 중지시킬 수있는 미묘한 차이에 대해 걱정하지 않고 두 언어간에 쉽게 전환 할 수 있음을 의미하기 때문입니다.

source: Key Concepts
es: Conceptos clave
ko: 주요 컨셉

source: Labels are very rare in JavaScript and typically indicate an attempt to write an object literal:
ko: 레이블은 JavaScript에서 매우 드물며 일반적으로 객체 리터럴을 작성하려는 시도를 나타냅니다.

source: Language service plugins are a way to provide additional information to a user based on existing TypeScript files. They can enhance existing messages between TypeScript and an editor, or to provide their own error messages.
ko: 언어 서비스 플러그인은 기존 TypeScript 파일을 기반으로 사용자에게 추가 정보를 제공하는 방법입니다. TypeScript와 편집기 간의 기존 메시지를 향상 시키거나 자체 오류 메시지를 제공 할 수 있습니다.

source: Lastly, we create a helper function that will do the mixing for us. This will run through the properties of each of the mixins and copy them over to the target of the mixins, filling out the stand-in properties with their implementations.
es: Por último,creamos una función de ayuda que hará la mezcla por nosotros.Esto recorrerá las propiedades de cada una de las mezclas y las copiará en el objetivo de las mismas,llenando las propiedades de los suplentes con sus implementaciones.
ko: 마지막으로, 우리를 위해 믹싱을 수행 할 도우미 함수를 만듭니다. 그러면 각 믹스 인의 속성이 실행되고 믹스 인의 대상으로 복사되어 독립형 속성이 해당 구현으로 채워집니다.

source: Lay out the project
es: Diseñe el proyecto...
ko: 프로젝트 배치

source: Layout for compilations using <code>outFile</code> is more flexible because relative paths don&rsquo;t matter as much. One thing to keep in mind is that you&rsquo;ll generally want to not use <code>prepend</code> until the &ldquo;last&rdquo; project - this will improve build times and reduce the amount of I/O needed in any given build. The TypeScript repo itself is a good reference here - we have some &ldquo;library&rdquo; projects and some &ldquo;endpoint&rdquo; projects; &ldquo;endpoint&rdquo; projects are kept as small as possible and pull in only the libraries they need.
es: El dise&ntilde;o de las compilaciones que usan <code>outFile</code> es m&aacute;s flexible porque las rutas relativas no importan tanto. Una cosa a tener en cuenta es que generalmente no querr&aacute; usar <code>prepend</code> hasta el &ldquo;&uacute;ltimo&rdquo; proyecto; esto mejorar&aacute; los tiempos de compilaci&oacute;n y reducir&aacute; la cantidad de E / S necesaria en cualquier compilaci&oacute;n. El repositorio de TypeScript en s&iacute; mismo es una buena referencia aqu&iacute;: tenemos algunos proyectos de "biblioteca" y algunos proyectos de "punto final"; Los proyectos de "punto final" se mantienen lo m&aacute;s peque&ntilde;os posible y solo incorporan las bibliotecas que necesitan.
ko: 상대 경로는 중요하지 않기 때문에 <code>outFile</code> 을 사용한 컴파일 레이아웃 이 더 유연합니다. 명심해야 할 한 가지는 일반적으로 "마지막"프로젝트까지 <code>prepend</code> 사용하지 않을 것입니다. 이렇게하면 빌드 시간이 향상되고 특정 빌드에 필요한 I / O 양이 줄어 듭니다. TypeScript 리포지토리 자체는 여기서 좋은 참고 자료입니다. 우리는 "라이브러리"프로젝트와 "엔드 포인트"프로젝트가 있습니다. "종료점"프로젝트는 가능한 작게 유지하고 필요한 라이브러리 만 가져옵니다.

source: Learn how to use a <a href="tsconfig-json"><code>tsconfig.json</code></a> files.
ko: <a href="tsconfig-json"> <code>tsconfig.json</code> </a> 파일 사용 방법을 알아 봅니다 .

source: Learn how to work in an <a href="compiler-options-in-msbuild">MSBuild project</a>.
ko: <a href="compiler-options-in-msbuild">MSBuild 프로젝트</a> 에서 작업하는 방법을 알아 봅니다 .

source: Learning JavaScript and TypeScript
ko: JavaScript 및 TypeScript 학습

source: Learning how to use <code>this</code> in JavaScript is something of a rite of passage. Since TypeScript is a superset of JavaScript, TypeScript developers also need to learn how to use <code>this</code> and how to spot when it&rsquo;s not being used correctly. Fortunately, TypeScript lets you catch incorrect uses of <code>this</code> with a couple of techniques. If you need to learn how <code>this</code> works in JavaScript, though, first read Yehuda Katz&rsquo;s <a href="http://yehudakatz.com/2011/08/11/understanding-javascript-function-invocation-and-this/">Understanding JavaScript Function Invocation and &ldquo;this&rdquo;</a>. Yehuda&rsquo;s article explains the inner workings of <code>this</code> very well, so we&rsquo;ll just cover the basics here.
es: Aprender a usar <code>this</code> en JavaScript es una especie de rito de iniciaci&oacute;n. Desde mecanografiado es un superconjunto de JavaScript, los desarrolladores de transcripci&oacute;n tambi&eacute;n necesitan aprender c&oacute;mo utilizar <code>this</code> y c&oacute;mo detectar cuando no est&aacute; siendo utilizado correctamente. Afortunadamente, TypeScript le permite detectar usos incorrectos de <code>this</code> con un par de t&eacute;cnicas. Sin embargo, si necesita aprender c&oacute;mo funciona <code>this</code> en JavaScript, primero lea <a href="http://yehudakatz.com/2011/08/11/understanding-javascript-function-invocation-and-this/">Comprendiendo la invocaci&oacute;n de funciones de JavaScript de</a> Yehuda Katz y "esto" . El art&iacute;culo de Yehuda explica muy bien el funcionamiento interno de <code>this</code> , por lo que solo cubriremos lo b&aacute;sico aqu&iacute;.
ko: JavaScript에서 <code>this</code> 사용하는 방법을 배우는 것은 통과 의례입니다. TypeScript는 JavaScript의 상위 집합이므로 TypeScript 개발자는 <code>this</code> 를 사용 하는 방법과 올바르게 사용되지 않을 때 확인하는 방법을 배워야 합니다. 다행히, 타이프 라이터는 잘못 사용 잡을 수 있도록 <code>this</code> 기술의 부부와 함께. JavaScript에서 <code>this</code> 어떻게 작동 하는지 배우 려면 먼저 Yehuda Katz의 <a href="http://yehudakatz.com/2011/08/11/understanding-javascript-function-invocation-and-this/">JavaScript 함수 호출 이해 및&ldquo;this&rdquo;를</a> 읽으십시오 . 예후의 문서의 내부 동작 설명 <code>this</code> 우리가 여기에 기초를 다룰 것이다, 그래서 아주 잘.

source: Let&rsquo;s add a couple of interfaces to our example above, <code>Card</code> and <code>Deck</code>, to make the types clearer and easier to reuse:
es: Agreguemos un par de interfaces a nuestro ejemplo anterior, <code>Card</code> y <code>Deck</code> , para que los tipos sean m&aacute;s claros y f&aacute;ciles de reutilizar:
ko: 위의 예에 <code>Card</code> 와 <code>Deck</code> 인터페이스를 추가 하여 유형을보다 명확하고 재사용하기 쉽게하자.

source: Let&rsquo;s add types to our simple examples from earlier:
es: Agreguemos tipos a nuestros ejemplos simples de antes:
ko: 이전의 간단한 예제에 유형을 추가해 보겠습니다.

source: Let&rsquo;s convert a simple class to use <code>get</code> and <code>set</code>. First, let&rsquo;s start with an example without getters and setters.
es: Convirtamos una clase simple para usar <code>get</code> y <code>set</code> . Primero, comencemos con un ejemplo sin getters ni setters.
ko: <code>get</code> 과 <code>set</code> 을 사용하도록 간단한 클래스를 변환 해 봅시다 . 먼저, 게터와 세터가없는 예제부터 시작하겠습니다.

source: Let&rsquo;s develop our sample further. Here we use an interface that describes objects that have a firstName and lastName field. In TypeScript, two types are compatible if their internal structure is compatible. This allows us to implement an interface just by having the shape the interface requires, without an explicit <code>implements</code> clause.
es: Desarrollemos m&aacute;s nuestra muestra. Aqu&iacute; usamos una interfaz que describe objetos que tienen un campo de nombre y apellido. En TypeScript, dos tipos son compatibles si su estructura interna es compatible. Esto nos permite implementar una interfaz simplemente teniendo la forma que la interfaz requiere, sin una cl&aacute;usula de <code>implements</code> expl&iacute;cita .
ko: 샘플을 더 개발해 봅시다. 여기서 firstName 및 lastName 필드가있는 객체를 설명하는 인터페이스를 사용합니다. TypeScript에서 내부 구조가 호환되는 경우 두 가지 유형이 호환됩니다. 이를 통해 명시적인 <code>implements</code> 조항 없이 인터페이스에 필요한 형태를 갖도록 인터페이스를 구현할 수 있습니다.

source: Let&rsquo;s get started by building a simple web application with TypeScript.
es: Comencemos construyendo una aplicaci&oacute;n web simple con TypeScript.
ko: TypeScript를 사용하여 간단한 웹 응용 프로그램을 작성하여 시작해 봅시다.

source: Let&rsquo;s go back and write the code for a version of <code>padLeft</code> which uses union types. We could write it with type predicates as follows:
ko: 돌아가서 공용체 유형을 사용 하는 <code>padLeft</code> 버전에 대한 코드를 작성해 보겠습니다 . 다음과 같이 유형 술어로 작성할 수 있습니다.

source: Let&rsquo;s go back and write the code for the version of <code>padLeft</code> that uses union types. We could write it with type predicates as follows:
es: Regresemos y escribamos el c&oacute;digo para la versi&oacute;n de <code>padLeft</code> que usa tipos de uni&oacute;n. Podr&iacute;amos escribirlo con predicados de tipo de la siguiente manera:
ko: 돌아가서 결합 유형을 사용 하는 <code>padLeft</code> 버전의 코드를 작성해 봅시다 . 다음과 같이 유형 술어로 작성할 수 있습니다.

source: Let&rsquo;s look at a fairly normal program and see how project references can help us better organize it. Imagine you have a project with two modules, <code>converter</code> and <code>units</code>, and a corresponding test file for each:
es: Veamos un programa bastante normal y veamos c&oacute;mo las referencias de proyectos pueden ayudarnos a organizarlo mejor. Imagine que tiene un proyecto con dos m&oacute;dulos, <code>converter</code> y <code>units</code> , y un archivo de prueba correspondiente para cada uno:
ko: 상당히 정상적인 프로그램을 살펴보고 프로젝트 참조가 프로그램을 더 잘 구성하는 데 어떻게 도움이 될 수 있는지 봅시다. 두 개의 모듈 ( <code>converter</code> 및 <code>units</code> )과 각각에 해당하는 테스트 파일 이있는 프로젝트가 있다고 가정하십시오 .

source: Let&rsquo;s look at an example to better see how this plays out in practice:
es: Veamos un ejemplo para ver mejor c&oacute;mo se desarrolla esto en la pr&aacute;ctica:
ko: 이것이 실제로 어떻게 작동하는지 더 잘 알기위한 예를 보자.

source: Let&rsquo;s look at an example:
es: Veamos un ejemplo:
ko: 예를 보자.

source: Let&rsquo;s modify the example a bit to show this difference:
es: Modifiquemos un poco el ejemplo para mostrar esta diferencia:
ko: 이 차이점을 보여주기 위해 예제를 약간 수정 해 봅시다.

source: Let&rsquo;s now add React and React-DOM, along with their declaration files, as dependencies to your <code>package.json</code> file:
es: Ahora agreguemos React y React-DOM, junto con sus archivos de declaraci&oacute;n, como dependencias a su archivo <code>package.json</code> :
ko: <code>package.json</code> 파일에 대한 의존성으로 선언 파일과 함께 React 및 React-DOM을 추가해 보겠습니다 .

source: Let&rsquo;s now look at a more complex example.
es: Veamos ahora un ejemplo m&aacute;s complejo.
ko: 이제 더 복잡한 예를 살펴 보겠습니다.

source: Let&rsquo;s say that we&rsquo;ve actually intended this function to work on arrays of <code>T</code> rather than <code>T</code> directly. Since we&rsquo;re working with arrays, the <code>.length</code> member should be available. We can describe this just like we would create arrays of other types:
es: Digamos que hemos tenido la intenci&oacute;n de que esta funci&oacute;n funcione en matrices de <code>T</code> en lugar de <code>T</code> directamente. Como estamos trabajando con matrices, el miembro <code>.length</code> deber&iacute;a estar disponible. Podemos describir esto como crear&iacute;amos matrices de otros tipos:
ko: 실제로이 함수가 <code>T</code> 가 아닌 <code>T</code> 의 배열에서 직접 작동하도록 의도했다고 가정 해 봅시다 . 우리는 배열을 사용하고 있기 때문에 <code>.length</code> 멤버를 사용할 수 있어야합니다. 다른 유형의 배열을 만드는 것처럼 이것을 설명 할 수 있습니다.

source: Let&rsquo;s say we have a sample application that uses the <code>typescript</code> module. <code>app.ts</code> has an import like <code>import * as ts from "typescript"</code>.
es: Digamos que tenemos una aplicaci&oacute;n de muestra que usa el m&oacute;dulo <code>typescript</code> . <code>app.ts</code> tiene una importaci&oacute;n como <code>import * as ts from "typescript"</code> .
ko: <code>typescript</code> 모듈 을 사용하는 샘플 응용 프로그램이 있다고 가정 해 봅시다 . <code>app.ts</code> 는 <code>import * as ts from "typescript"</code> 같은 가져 오기를 갖습니다 .

source: Let&rsquo;s say we wrote a module file <code>foo.d.ts</code>:
es: Digamos que escribimos un archivo de m&oacute;dulo <code>foo.d.ts</code> :
ko: 모듈 파일 <code>foo.d.ts</code> 를 작성했다고 가정 해 봅시다 .

source: Let&rsquo;s scaffold this out:
es: Vamos a andamiar esto:
ko: 이것을 비계로 만들어 봅시다 :

source: Let&rsquo;s see how this can be used.
es: Veamos c&oacute;mo se puede usar esto.
ko: 이것이 어떻게 사용될 수 있는지 봅시다.

source: Let&rsquo;s start out with a new directory. We&rsquo;ll name it <code>proj</code> for now, but you can change it to whatever you want.
es: Comencemos con un nuevo directorio. Lo <code>proj</code> por ahora, pero puede cambiarlo a lo que quiera.
ko: 새로운 디렉토리로 시작하자. 우리는 지금 이름을 <code>proj</code> 로 지정 하지만 원하는대로 변경할 수 있습니다.

source: Let&rsquo;s start with the program we&rsquo;ll be using as our example throughout this page. We&rsquo;ve written a small set of simplistic string validators, as you might write to check a user&rsquo;s input on a form in a webpage or check the format of an externally-provided data file.
es: Comencemos con el programa que usaremos como ejemplo en esta p&aacute;gina. Hemos escrito un peque&ntilde;o conjunto de validadores de cadenas simplistas, como podr&iacute;a escribir para verificar la entrada de un usuario en un formulario en una p&aacute;gina web o verificar el formato de un archivo de datos proporcionado externamente.
ko: 이 페이지 전체에서 예제로 사용할 프로그램으로 시작하겠습니다. 우리는 웹 페이지의 폼에서 사용자 입력을 확인하거나 외부 제공 데이터 파일의 형식을 확인하기 위해 작성할 수있는 간단한 문자열 유효성 검사기 세트를 작성했습니다.

source: Let&rsquo;s take a look at a simple class-based example:
es: Echemos un vistazo a un ejemplo simple basado en clases:
ko: 간단한 클래스 기반 예제를 살펴 보겠습니다.

source: Let&rsquo;s take a look at an example:
es: Echemos un vistazo a un ejemplo:
ko: 예를 살펴 보겠습니다.

source: Let&rsquo;s take a look at the simplest mapped type and its parts:
es: Echemos un vistazo al tipo mapeado m&aacute;s simple y sus partes:
ko: 가장 간단한 매핑 유형과 그 부분을 살펴 보겠습니다.

source: Let&rsquo;s take a minute to consider what that means. <code>setTimeout</code> will run a function after some number of milliseconds, <em>but only</em> after the <code>for</code> loop has stopped executing; By the time the <code>for</code> loop has stopped executing, the value of <code>i</code> is <code>10</code>. So each time the given function gets called, it will print out <code>10</code>!
es: Tomemos un minuto para considerar lo que eso significa. <code>setTimeout</code> ejecutar&aacute; una funci&oacute;n despu&eacute;s de algunos milisegundos, <em>pero solo</em> despu&eacute;s de que el bucle <code>for</code> haya dejado de ejecutarse; Cuando el bucle <code>for</code> deja de ejecutarse, el valor de <code>i</code> es <code>10</code> . As&iacute; que cada vez que se llame a la funci&oacute;n dada, imprimir&aacute; <code>10</code> !
ko: 그것이 무엇을 의미하는지 잠시 생각해 봅시다. <code>setTimeout</code> 은 몇 밀리 초 후에 함수를 실행 <em>하지만 </em> <code>for</code> 루프가 실행을 중지 한 후에 <em>만</em> 실행됩니다. <code>for</code> 루프가 실행을 중지 할 때까지 <code>i</code> 값 은 <code>10</code> 입니다. 주어진 함수가 호출 될 때마다 <code>10</code> 을 출력합니다 !

source: Let&rsquo;s take our <code>identity</code> function from earlier:
es: Tomemos nuestra funci&oacute;n de <code>identity</code> de antes:
ko: <code>identity</code> 기능을 이전부터 살펴 보자 .

source: Let&rsquo;s write a Hello World program. In <code>src</code>, create the file <code>main.ts</code>:
es: Escribamos un programa de Hello World. En <code>src</code> , cree el archivo <code>main.ts</code> :
ko: Hello World 프로그램을 작성해 봅시다. 에서 <code>src</code> , 파일 생성 <code>main.ts</code> 를 :

source: Let&rsquo;s write our first TypeScript file using React. First, create a file named <code>Hello.tsx</code> in <code>src/components</code> and write the following:
es: Escribamos nuestro primer archivo TypeScript usando React. Primero, cree un archivo llamado <code>Hello.tsx</code> en <code>src/components</code> y escriba lo siguiente:
ko: React를 사용하여 첫 번째 TypeScript 파일을 작성해 봅시다. 먼저,라는 이름의 파일 생성 <code>Hello.tsx</code> 에 <code>src/components</code> 및 다음 쓰기 :

source: Lets explore a TypeScript script that adds a <code>&lt;p&gt;Hello, World&lt;/p&gt;</code> element to the <code>#app</code> element.
ko: <code>#app</code> 요소에 <code>&lt;p&gt;Hello, World&lt;/p&gt;</code> 요소를 추가하는 TypeScript 스크립트를 살펴 보겠습니다 .

source: Lets you set a base directory to resolve non-absolute module names.
ko: 절대적이지 않은 모듈 이름을 확인하기 위해 기본 디렉토리를 설정할 수 있습니다.

source: Libraries can also use <code>this</code> parameters to declare how callbacks will be invoked.
es: Las bibliotecas tambi&eacute;n pueden usar <code>this</code> par&aacute;metros para declarar c&oacute;mo se invocar&aacute;n las devoluciones de llamada.
ko: 라이브러리는 <code>this</code> 매개 변수를 사용 하여 콜백이 호출되는 방법을 선언 할 수도 있습니다 .

source: Library Structures
es: Estructuras de la biblioteca
ko: 도서관 구조

source: Library Structures: Consuming Dependencies
es: Estructuras de la biblioteca:Consumir Dependencias
ko: 라이브러리 구조 : 소비 종속성

source: Library Structures: Dependencies on Global Libraries
es: Estructuras de la biblioteca:Dependencias de las bibliotecas mundiales
ko: 라이브러리 구조 : 글로벌 라이브러리에 대한 종속성

source: Library Structures: Dependencies on Modules
es: Estructuras de la biblioteca:Dependencias de los módulos
ko: 라이브러리 구조 : 모듈에 대한 종속성

source: Library Structures: Dependencies on UMD libraries
es: Estructuras de la biblioteca:Dependencias de las bibliotecas de UMD
ko: 라이브러리 구조 : UMD 라이브러리에 대한 종속성

source: Library Structures: Global Libraries
es: Estructuras de la biblioteca:Bibliotecas mundiales
ko: 라이브러리 구조 : 글로벌 라이브러리

source: Library Structures: Global Plugin
es: Estructuras de la biblioteca:Plugin Global
ko: 라이브러리 구조 : 글로벌 플러그인

source: Library Structures: Global-modifying Modules
es: Estructuras de la biblioteca:Módulos modificadores globales
ko: 라이브러리 구조 : 전역 수정 모듈

source: Library Structures: Identifying Kinds of Libraries
es: Estructuras de la biblioteca:Identificación de tipos de bibliotecas
ko: 라이브러리 구조 : 라이브러리 종류 식별

source: Library Structures: Library file layout
es: Estructuras de la biblioteca:Estructura de archivos de la biblioteca
ko: 라이브러리 구조 : 라이브러리 파일 레이아웃

source: Library Structures: Modular Libraries
es: Estructuras de la biblioteca:Bibliotecas modulares
ko: 라이브러리 구조 : 모듈 식 라이브러리

source: Library Structures: Module Plugin or UMD Plugin
es: Estructuras de la biblioteca:Plugin de módulo o plugin UMD
ko: 라이브러리 구조 : 모듈 플러그인 또는 UMD 플러그인

source: Library Structures: Preventing Name Conflicts
es: Estructuras de la biblioteca:Prevención de conflictos de nombres
ko: 라이브러리 구조 : 이름 충돌 방지

source: Library Structures: The Impact of ES6 on Module Plugins
es: Estructuras de la biblioteca:El impacto del ES6 en los enchufes de los módulos
ko: 라이브러리 구조 : 모듈 플러그인에 대한 ES6의 영향

source: Library Structures: UMD
es: Estructuras de la biblioteca:UMD
ko: 라이브러리 구조 : UMD

source: Library file layout
es: La disposición de los archivos de la biblioteca
ko: 라이브러리 파일 레이아웃

source: Licensed under the Apache License, Version 2.0.
es: Licenciado bajo la licencia de Apache,versión 2.0.
ko: Apache 라이센스, 버전 2.0에 따라 라이센스가 부여되었습니다.

source: Like array destructuring, you can have assignment without declaration:
es: Al igual que la desestructuración de la matriz,puedes tener una asignación sin declaración:
ko: 배열 파괴와 마찬가지로 선언없이 할당 할 수 있습니다.
