Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/typescript/typescript.*.003.xlf
Languages: es, ko, ru, zh_cn

source: Since declarations in one file can affect type checking in other files, some errors may not be detected when <code>--skipLibCheck</code> is specified. For example, if a non-declaration file augments a type declared in a declaration file, errors may result that are only reported when the declaration file is checked. However, in practice such situations are rare.
ru: Поскольку объявления в одном файле могут повлиять на проверку типов в других файлах, некоторые ошибки могут не обнаруживаться при <code>--skipLibCheck</code> . Например, если файл без объявления дополняет тип, объявленный в файле объявления, могут возникнуть ошибки, о которых сообщается только при проверке файла объявления. Однако на практике такие ситуации редки.
zh_cn: 由于一个文件中的声明会影响其他文件中的类型检查，因此，当指定 <code>--skipLibCheck</code> 时，可能不会检测到某些错误。例如，如果非声明文件扩展了声明文件中声明的类型，则可能会导致错误，仅在检查声明文件时才报告错误。但是，实际上这种情况很少见。

source: Since nullable types are implemented with a union, you need to use a type guard to get rid of the <code>null</code>. Fortunately, this is the same code you&rsquo;d write in JavaScript:
ru: Поскольку типы, допускающие значение NULL, реализованы с помощью объединения, вам нужно использовать защиту типа, чтобы избавиться от <code>null</code> . К счастью, это тот же код, который вы написали бы на JavaScript:
zh_cn: 由于可空类型是通过联合实现的，因此您需要使用类型保护来摆脱 <code>null</code> 。幸运的是，这与您在JavaScript中编写的代码相同：

source: Since ranges have the potential to overlap, determining which redirect applies is order-specific. That means in the above example, even though both the <code>&gt;=3.2</code> and the <code>&gt;=3.1</code> matchers support TypeScript 3.2 and above, reversing the order could have different behavior, so the above sample would not be equivalent to the following.
ru: Поскольку диапазоны могут перекрываться, определение того, какое перенаправление применяется, зависит от заказа. Это означает, что в приведенном выше примере, хотя сопоставители <code>&gt;=3.2</code> и <code>&gt;=3.1</code> поддерживают TypeScript 3.2 и выше, изменение порядка может иметь другое поведение, поэтому приведенный выше образец не будет эквивалентен следующему.
zh_cn: 由于范围可能会重叠，因此确定应用哪个重定向是特定于订单的。这意味着在上面的示例中，即使 <code>&gt;=3.2</code> 和 <code>&gt;=3.1</code> 匹配器都支持TypeScript 3.2和更高版本，颠倒顺序也可能具有不同的行为，因此上述示例将不等同于以下示例。

source: Since the above syntax cannot be used in <code>.tsx</code> files, an alternate type assertion operator should be used: <code>as</code>. The example can easily be rewritten with the <code>as</code> operator.
ru: Поскольку приведенный выше синтаксис не может использоваться в файлах <code>.tsx</code> , следует использовать оператор утверждения альтернативного типа: <code>as</code> . Пример можно легко переписать с помощью оператора <code>as</code> .
zh_cn: 由于上述语法不能在 <code>.tsx</code> 文件中使用，因此应使用替代类型的断言运算符： <code>as</code> 。该示例可以很容易地用 <code>as</code> 运算符重写。

source: Since the class uses <code>this</code> types, you can extend it and the new class can use the old methods with no changes.
ru: Поскольку класс использует <code>this</code> типы, вы можете расширить его, и новый класс может использовать старые методы без изменений.
zh_cn: 由于该类使用 <code>this</code> 类型，因此可以对其进行扩展，而新类可以使用旧方法而无需进行任何更改。

source: Since the stricter checks may uncover previously unreported errors, this is a breaking change in <code>--strict</code> mode.
ru: Поскольку более строгие проверки могут выявить ранее незарегистрированные ошибки, это <code>--strict</code> изменение в режиме --strict .
zh_cn: 由于更严格的检查可能会发现以前未报告的错误，因此这是 <code>--strict</code> 模式中的一项重大更改。

source: Since there is no natural syntax for specifying generic type parameters in Javascript, an unspecified type parameter defaults to <code>any</code>.
ru: Поскольку в Javascript нет естественного синтаксиса для указания параметров универсального типа, для параметра неопределенного типа по умолчанию используется значение <code>any</code> .
zh_cn: 由于在Javascript中没有用于指定通用类型参数的自然语法，因此未指定的类型参数默认为 <code>any</code> 。

source: Since there is no way to specify optionality on parameters in pre-ES2015 Javascript, all function parameters in <code>.js</code> file are considered optional. Calls with fewer arguments than the declared number of parameters are allowed.
ru: Поскольку в Javascript до ES2015 невозможно указать необязательность для параметров, все параметры функции в файле <code>.js</code> считаются необязательными. Разрешены вызовы с меньшим количеством аргументов, чем заявленное количество параметров.
zh_cn: 由于无法在ES2015之前的Javascript中为参数指定可选性，因此 <code>.js</code> 文件中的所有函数参数均被视为可选。允许调用的参数少于声明的参数数量。

source: Since this is a breaking change, you may need to know about the workarounds which are the same as those for strict object literal checks:
ru: Так как это изменение является прерывистым,вам,возможно,понадобится знать обходные пути,которые аналогичны тем,что используются для строгой буквальной проверки объектов:
zh_cn: 由于这是一个突破性的变化,你可能需要了解与严格的对象文字检查相同的变通方法。

source: Skip type checking of <a href="triple-slash-directives#-reference-no-default-libtrue">default library declaration files</a>.
ru: Пропустить проверку типов <a href="triple-slash-directives#-reference-no-default-libtrue">файлов объявлений библиотеки</a> по умолчанию .
zh_cn: 跳过<a href="triple-slash-directives#-reference-no-default-libtrue">默认库声明文件的</a>类型检查。

source: Skip type checking of all declaration files (<code>*.d.ts</code>).
ru: Пропустить проверку типа всех файлов объявлений ( <code>*.d.ts</code> ).
zh_cn: 跳过所有声明文件（ <code>*.d.ts</code> ）的类型检查。

source: Smarter Auto-Import Syntax
ru: Умный синтаксис авто-импорта
zh_cn: 更智能的自动导入语法

source: Smarter union type checking
ru: Умная проверка типа союза
zh_cn: 更智能的联盟型检查

source: So far, we&rsquo;ve used &ldquo;compatible&rdquo;, which is not a term defined in the language spec. In TypeScript, there are two kinds of compatibility: subtype and assignment. These differ only in that assignment extends subtype compatibility with rules to allow assignment to and from <code>any</code>, and to and from <code>enum</code> with corresponding numeric values.
ru: До сих пор мы использовали термин &laquo;совместимый&raquo;, который не определен в спецификации языка. В TypeScript есть два типа совместимости: подтип и присваивание. Они отличаются только тем, что присваивание расширяет совместимость подтипов с помощью правил, позволяющих присваивать <code>any</code> и от любого , а также к <code>enum</code> и от него с соответствующими числовыми значениями.
zh_cn: 到目前为止，我们使用了&ldquo;兼容&rdquo;，这不是语言规范中定义的术语。在TypeScript中，有两种兼容性：子类型和赋值。它们之间的区别仅在于，赋值扩展了子类型与规则的兼容性，以允许与 <code>any</code> 值进行分配，以及与具有相应数值的 <code>enum</code> 分配。

source: So given the following input, the resulting <code>.js</code> file will include an import to <code>tslib</code> and use the <code>__assign</code> helper from it instead of inlining it.
ru: Поэтому , учитывая следующий входной, полученный <code>.js</code> файл будет включать в себя импорт в <code>tslib</code> и использовать <code>__assign</code> помощник из него вместо встраивания его.
zh_cn: 因此，在给出以下输入的情况下，生成的 <code>.js</code> 文件将包括对 <code>tslib</code> 的导入，并使用其中的 <code>__assign</code> helper而不是对其进行内联。

source: So in the above example, if we&rsquo;re importing from <code>"package-name"</code>, we&rsquo;ll try to resolve from <code>[...]/node_modules/package-name/ts3.1/index.d.ts</code> (and other relevant paths) when running in TypeScript 3.1. If we import from <code>package-name/foo</code>, we&rsquo;ll try to look for <code>[...]/node_modules/package-name/ts3.1/foo.d.ts</code> and <code>[...]/node_modules/package-name/ts3.1/foo/index.d.ts</code>.
ru: Итак, в приведенном выше примере, если мы импортируем из <code>"package-name"</code> , мы попытаемся разрешить из <code>[...]/node_modules/package-name/ts3.1/index.d.ts</code> (и других соответствующих paths) при работе в TypeScript 3.1. Если мы импортируем из <code>package-name/foo</code> , мы попытаемся найти <code>[...]/node_modules/package-name/ts3.1/foo.d.ts</code> и <code>[...]/node_modules/package-name/ts3.1/foo/index.d.ts</code> .
zh_cn: 因此，在上面的示例中，如果要从 <code>"package-name"</code> 导入，我们将尝试从 <code>[...]/node_modules/package-name/ts3.1/index.d.ts</code> （和其他相关在TypeScript 3.1中运行时）。如果我们从 <code>package-name/foo</code> 导入，我们将尝试寻找 <code>[...]/node_modules/package-name/ts3.1/foo.d.ts</code> 和 <code>[...]/node_modules/package-name/ts3.1/foo/index.d.ts</code> 。

source: So to exclude a file from the compilation, you need to exclude it and <strong>all</strong> files that have an <code>import</code> or <code>/// &lt;reference path="..." /&gt;</code> directive to it.
ru: Таким образом, чтобы исключить файл из компиляции, вам нужно исключить его и <strong>все</strong> файлы, для которых есть директива <code>import</code> или <code>/// &lt;reference path="..." /&gt;</code> .
zh_cn: 因此，要从编译中排除文件，您需要将其以及<strong>所有</strong>具有 <code>import</code> 或 <code>/// &lt;reference path="..." /&gt;</code> 指令的文件排除在外。

source: Some examples of functions returning <code>never</code>:
ru: Некоторые примеры функций, которые <code>never</code> возвращаются :
zh_cn: 函数 <code>never</code> 返回的一些示例：

source: Some examples of use of functions returning <code>never</code>:
ru: Некоторые примеры использования функций, <code>never</code> возвращающих :
zh_cn: 使用 <code>never</code> 返回的函数的一些示例：

source: Some examples use the <code>reflect-metadata</code> library which adds a polyfill for an <a href="https://github.com/rbuckton/ReflectDecorators">experimental metadata API</a>. This library is not yet part of the ECMAScript (JavaScript) standard. However, once decorators are officially adopted as part of the ECMAScript standard these extensions will be proposed for adoption.
ru: В некоторых примерах используется библиотека <code>reflect-metadata</code> которая добавляет полифил для <a href="https://github.com/rbuckton/ReflectDecorators">экспериментального API метаданных</a> . Эта библиотека еще не является частью стандарта ECMAScript (JavaScript). Однако, как только декораторы будут официально приняты как часть стандарта ECMAScript, эти расширения будут предложены для принятия.
zh_cn: 一些示例使用了 <code>reflect-metadata</code> 数据库，该库为<a href="https://github.com/rbuckton/ReflectDecorators">实验性元数据API</a>添加了polyfill 。该库尚未成为ECMAScript（JavaScript）标准的一部分。但是，一旦装饰器被正式采纳为ECMAScript标准的一部分，这些扩展将被提议采用。

source: Some examples:
ru: Несколько примеров:
zh_cn: 一些例子:

source: Some kinds of declarations can be combined across multiple declarations. For example, <code>class C { }</code> and <code>interface C { }</code> can co-exist and both contribute properties to the <code>C</code> types.
ru: Некоторые виды объявлений можно объединить в несколько объявлений. Например, <code>class C { }</code> и <code>interface C { }</code> могут сосуществовать, и оба вносят свой вклад в свойства типов <code>C</code> .
zh_cn: 某些声明可以跨多个声明进行组合。例如， <code>class C { }</code> 和 <code>interface C { }</code> 可以共存，并且都为 <code>C</code> 类型提供属性。

source: Some libraries are designed to be used in many module loaders, or with no module loading (global variables). These are known as <a href="https://github.com/umdjs/umd">UMD</a> modules. These libraries can be accessed through either an import or a global variable. For example:
ru: Некоторые библиотеки предназначены для использования во многих загрузчиках модулей или без загрузки модуля (глобальные переменные). Они известны как модули <a href="https://github.com/umdjs/umd">UMD</a> . Доступ к этим библиотекам можно получить либо с помощью импорта, либо с помощью глобальной переменной. Например:
zh_cn: 一些库被设计用于许多模块加载器中，或者不用于模块加载（全局变量）。这些被称为<a href="https://github.com/umdjs/umd">UMD</a>模块。可以通过导入或全局变量访问这些库。例如：

source: Some libraries are designed to be used in many module loaders, or with no module loading (global variables). These are known as <a href="https://github.com/umdjs/umd">UMD</a> or <a href="http://isomorphic.net">Isomorphic</a> modules. These libraries can be accessed through either an import or a global variable.
ru: Некоторые библиотеки предназначены для использования во многих загрузчиках модулей или без загрузки модуля (глобальные переменные). Они известны как <a href="https://github.com/umdjs/umd">UMD</a> или <a href="http://isomorphic.net">изоморфные</a> модули. Доступ к этим библиотекам можно получить либо с помощью импорта, либо с помощью глобальной переменной.
zh_cn: 一些库被设计用于许多模块加载器中，或者不用于模块加载（全局变量）。这些被称为<a href="https://github.com/umdjs/umd">UMD</a>或<a href="http://isomorphic.net">同构</a>模块。可以通过导入或全局变量访问这些库。

source: Some libraries only work in a module loader environment. For example, <code>express</code> only works in Node.js and must be loaded using the CommonJS <code>require</code> function.
ru: Некоторые библиотеки работают только в среде загрузчика модулей. Например, <code>express</code> работает только в Node.js и должен быть загружен с помощью функции CommonJS <code>require</code> .
zh_cn: 一些库仅在模块加载器环境中工作。例如， <code>express</code> 仅在Node.js中有效，并且必须使用CommonJS <code>require</code> 函数加载。

source: Some module loaders such as <a href="https://github.com/systemjs/systemjs/blob/master/docs/overview.html#plugin-syntax">SystemJS</a> and <a href="https://github.com/amdjs/amdjs-api/blob/master/loaderplugins.html">AMD</a> allow non-JavaScript content to be imported. These typically use a prefix or suffix to indicate the special loading semantics. Wildcard module declarations can be used to cover these cases.
ru: Некоторые загрузчики модулей, такие как <a href="https://github.com/systemjs/systemjs/blob/master/docs/overview.html#plugin-syntax">SystemJS</a> и <a href="https://github.com/amdjs/amdjs-api/blob/master/loaderplugins.html">AMD,</a> позволяют импортировать содержимое, отличное от JavaScript. Обычно они используют префикс или суффикс для обозначения специальной семантики загрузки. Для таких случаев можно использовать объявления модуля с подстановочными знаками.
zh_cn: 一些模块加载器（例如<a href="https://github.com/systemjs/systemjs/blob/master/docs/overview.html#plugin-syntax">SystemJS</a>和<a href="https://github.com/amdjs/amdjs-api/blob/master/loaderplugins.html">AMD）</a>允许导入非JavaScript内容。这些通常使用前缀或后缀来指示特殊的加载语义。通配符模块声明可用于涵盖这些情况。

source: Some of the unique concepts in TypeScript describe the shape of JavaScript objects at the type level. One example that is especially unique to TypeScript is the concept of &lsquo;declaration merging&rsquo;. Understanding this concept will give you an advantage when working with existing JavaScript. It also opens the door to more advanced abstraction concepts.
ru: Некоторые уникальные концепции TypeScript описывают форму объектов JavaScript на уровне типа. Одним из примеров, который особенно уникален для TypeScript, является концепция &laquo;слияния деклараций&raquo;. Понимание этой концепции даст вам преимущество при работе с существующим JavaScript. Это также открывает путь к более продвинутым концепциям абстракции.
zh_cn: TypeScript中的一些独特概念在类型级别上描述了JavaScript对象的形状。TypeScript特别独特的一个示例是&ldquo;声明合并&rdquo;的概念。理解此概念将使您在使用现有JavaScript时具有优势。它还为更高级的抽象概念打开了大门。

source: Some people find it more aesthetically pleasing to create an object and add properties immediately after like so:
ru: Некоторые люди находят более эстетичным создание объекта и добавление свойств сразу после этого:
zh_cn: 有些人觉得像这样创建一个对象后马上添加属性更美观。

source: Some plugins add or modify top-level exports on existing modules. While this is legal in CommonJS and other loaders, ES6 modules are considered immutable and this pattern will not be possible. Because TypeScript is loader-agnostic, there is no compile-time enforcement of this policy, but developers intending to transition to an ES6 module loader should be aware of this.
ru: Некоторые плагины добавляют или изменяют экспорт верхнего уровня на существующих модулях.В то время как в CommonJS и других загрузчиках это разрешено,модули ES6 считаются неизменяемыми,и этот шаблон будет невозможен.Так как TypeScript является загрузчиком-диагностикой,то не существует принудительного исполнения этой политики во время компиляции,но разработчики,намеревающиеся перейти на загрузчик модулей ES6,должны знать об этом.
zh_cn: 一些插件在现有模块上添加或修改顶层导出。虽然这在CommonJS和其他加载器中是合法的,但ES6模块被认为是不可改变的,这种模式是不可能的。因为TypeScript是与加载器无关的,所以没有在编译时执行这一政策,但是打算过渡到ES6模块加载器的开发者应该意识到这一点。

source: Some properties should only be modifiable when an object is first created. You can specify this by putting <code>readonly</code> before the name of the property:
ru: Некоторые свойства следует изменять только при первом создании объекта. Вы можете указать это, поставив <code>readonly</code> перед именем свойства:
zh_cn: 某些属性仅在首次创建对象时才可以修改。您可以通过在属性名称前放置 <code>readonly</code> 来指定此名称：

source: Some readers might do a double-take at this example. The variable <code>x</code> was declared <em>within the <code>if</code> block</em>, and yet we were able to access it from outside that block. That&rsquo;s because <code>var</code> declarations are accessible anywhere within their containing function, module, namespace, or global scope - all which we&rsquo;ll go over later on - regardless of the containing block. Some people call this <em><code>var</code>-scoping</em> or <em>function-scoping</em>. Parameters are also function scoped.
ru: Некоторые читатели могут усомниться в этом примере. Переменная <code>x</code> была объявлена <em>в блоке <code>if</code> </em> , но мы смогли получить к ней доступ извне. Это потому, что объявления <code>var</code> доступны где угодно в пределах их содержащей функции, модуля, пространства имен или глобальной области видимости - все это мы рассмотрим позже - независимо от содержащего блока. Некоторые люди называют это <em> <code>var</code> -scoping</em> или <em>function-scoping</em> . Параметры также зависят от функции.
zh_cn: 在此示例中，某些读者可能会双重接受。变量 <code>x</code> <em>在 <code>if</code> 块内</em>声明，但是我们仍然可以从该块外部访问它。这是因为 <code>var</code> 声明可在其包含函数，模块，名称空间或全局范围内的任何位置访问-稍后我们将讨论所有这些内容-无论包含什么块。有些人把这个<em> <code>var</code> -scoping</em>或<em>功能的作用域</em>。参数也在功能范围内。

source: Some teams have set up msbuild-based workflows wherein tsconfig files have the same <em>implicit</em> graph ordering as the managed projects they are paired with. If your solution is like this, you can continue to use <code>msbuild</code> with <code>tsc -p</code> along with project references; these are fully interoperable.
ru: Некоторые группы настроили рабочие процессы на основе msbuild, в которых файлы tsconfig имеют тот же <em>неявный</em> порядок графов, что и управляемые проекты, с которыми они связаны. Если ваше решение похоже на это, вы можете продолжать использовать <code>msbuild</code> с <code>tsc -p</code> вместе со ссылками на проекты; они полностью совместимы.
zh_cn: 一些团队已经建立了基于msbuild的工作流，其中tsconfig文件具有与其配对的托管项目相同的<em>隐式</em>图顺序。如果您的解决方案是这样的，则可以继续将 <code>msbuild</code> 与 <code>tsc -p</code> 一起使用以及项目引用。这些是完全可互操作的。

source: Something to note is that you can still <em>capture</em> a block-scoped variable before it&rsquo;s declared. The only catch is that it&rsquo;s illegal to call that function before the declaration. If targeting ES2015, a modern runtime will throw an error; however, right now TypeScript is permissive and won&rsquo;t report this as an error.
ru: Следует отметить, что вы все еще можете <em>захватить</em> переменную с блочной областью видимости до ее объявления. Единственная загвоздка в том, что вызывать эту функцию перед объявлением запрещено. Если ориентироваться на ES2015, современная среда выполнения выдаст ошибку; однако сейчас TypeScript разрешает и не сообщает об этом как об ошибке.
zh_cn: 需要注意的是，您仍然可以在声明它之前<em>捕获</em>其作用域范围的变量。唯一的问题是在声明之前调用该函数是非法的。如果定位到ES2015，则现代运行时将引发错误；但是，现在TypeScript是允许的，不会将其报告为错误。

source: Sometimes modules are not directly located under <em>baseUrl</em>. For instance, an import to a module <code>"jquery"</code> would be translated at runtime to <code>"node_modules/jquery/dist/jquery.slim.min.js"</code>. Loaders use a mapping configuration to map module names to files at run-time, see <a href="http://requirejs.org/docs/api.html#config-paths">RequireJs documentation</a> and <a href="https://github.com/systemjs/systemjs/blob/master/docs/config-api.html#paths">SystemJS documentation</a>.
ru: Иногда модули не находятся непосредственно под <em>baseUrl</em> . Например, импорт в модуль <code>"jquery"</code> будет преобразован во время выполнения в <code>"node_modules/jquery/dist/jquery.slim.min.js"</code> . Погрузчики использовать конфигурацию отображения для отображения имен модулей к файлам во время выполнения, см <a href="http://requirejs.org/docs/api.html#config-paths">RequireJs документации</a> и <a href="https://github.com/systemjs/systemjs/blob/master/docs/config-api.html#paths">SystemJS документации</a> .
zh_cn: 有时模块未直接位于<em>baseUrl</em>下。例如，导入到模块 <code>"jquery"</code> 将在运行时转换为 <code>"node_modules/jquery/dist/jquery.slim.min.js"</code> 。加载程序使用映射配置在运行时将模块名称映射到文件，请参阅<a href="http://requirejs.org/docs/api.html#config-paths">RequireJs文档</a>和<a href="https://github.com/systemjs/systemjs/blob/master/docs/config-api.html#paths">SystemJS文档</a>。

source: Sometimes modules are not directly located under <em>baseUrl</em>. Loaders use a mapping configuration to map module names to files at run-time, see <a href="http://requirejs.org/docs/api.html#config-paths">RequireJs documentation</a> and <a href="https://github.com/systemjs/systemjs/blob/master/docs/overview.html#map-config">SystemJS documentation</a>.
ru: Иногда модули не находятся непосредственно под <em>baseUrl</em> . Погрузчики использовать конфигурацию отображения для отображения имен модулей к файлам во время выполнения, см <a href="http://requirejs.org/docs/api.html#config-paths">RequireJs документации</a> и <a href="https://github.com/systemjs/systemjs/blob/master/docs/overview.html#map-config">SystemJS документации</a> .
zh_cn: 有时模块未直接位于<em>baseUrl</em>下。加载程序使用映射配置在运行时将模块名称映射到文件，请参阅<a href="http://requirejs.org/docs/api.html#config-paths">RequireJs文档</a>和<a href="https://github.com/systemjs/systemjs/blob/master/docs/overview.html#map-config">SystemJS文档</a>。

source: Sometimes the project sources from multiple directories at compile time are all combined to generate a single output directory. This can be viewed as a set of source directories create a &ldquo;virtual&rdquo; directory.
ru: Иногда исходники проекта из нескольких каталогов во время компиляции объединяются для создания единого выходного каталога. Это можно рассматривать как набор исходных каталогов, создающих &laquo;виртуальный&raquo; каталог.
zh_cn: 有时，在编译时来自多个目录的项目源会全部合并以生成单个输出目录。这可以看作是一组源目录创建的&ldquo;虚拟&rdquo;目录。

source: Sometimes this is not desirable, for instance inputs <code>FolderA\FolderB\1.ts</code> and <code>FolderA\FolderB\2.ts</code> would result in output structure mirroring <code>FolderA\FolderB\</code>. Now if a new file <code>FolderA\3.ts</code> is added to the input, the output structure will pop out to mirror <code>FolderA\</code>.
ru: Иногда это нежелательно, например, входы <code>FolderA\FolderB\1.ts</code> и <code>FolderA\FolderB\2.ts</code> приведут к зеркалированию структуры вывода <code>FolderA\FolderB\</code> . Теперь, если новый файл <code>FolderA\3.ts</code> добавлен во входные данные, структура вывода будет <code>FolderA\</code> зеркало FolderA \ .
zh_cn: 有时这是不希望的，例如输入 <code>FolderA\FolderB\1.ts</code> 和 <code>FolderA\FolderB\2.ts</code> 将导致输出结构镜像 <code>FolderA\FolderB\</code> 。现在，如果将新文件 <code>FolderA\3.ts</code> 添加到输入中，则输出结构将弹出以镜像 <code>FolderA\</code> 。

source: Sometimes you&rsquo;ll end up in a situation where you&rsquo;ll know more about a value than TypeScript does. Usually this will happen when you know the type of some entity could be more specific than its current type.
ru: Иногда вы попадете в ситуацию, когда вы будете знать о значении больше, чем TypeScript. Обычно это происходит, когда вы знаете, что тип некоторой сущности может быть более конкретным, чем ее текущий тип.
zh_cn: 有时，您会遇到比TypeScript更了解值的情况。通常，当您知道某个实体的类型可能比其当前类型更具体时，就会发生这种情况。
