Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/typescript/typescript.*.003.xlf
Languages: es, ko, ru, zh_cn

source: Like classes, interfaces can extend each other. This allows you to copy the members of one interface into another, which gives you more flexibility in how you separate your interfaces into reusable components.
es: Al igual que las clases,las interfaces pueden extenderse entre sí.Esto permite copiar los miembros de una interfaz en otra,lo que le da más flexibilidad en la forma de separar las interfaces en componentes reutilizables.
ko: 클래스와 마찬가지로 인터페이스도 서로 확장 될 수 있습니다. 이를 통해 한 인터페이스의 멤버를 다른 인터페이스로 복사 할 수 있으므로 인터페이스를 재사용 가능한 구성 요소로 분리하는 방법에있어 유연성이 향상됩니다.

source: Like most C-descended languages, TypeScript requires declaration of type parameters:
ko: 대부분의 C 종속 언어와 마찬가지로 TypeScript에는 유형 매개 변수의 선언이 필요합니다.

source: Like other special JS checking behaviors, this behavior can be changed by specifying a JSDoc type for the variable. For example:
es: Como otros comportamientos especiales de comprobación de JS,este comportamiento puede ser cambiado especificando un tipo de JSDoc para la variable.Por ejemplo:
ko: 다른 특수 JS 검사 동작과 마찬가지로이 동작은 변수에 JSDoc 유형을 지정하여 변경할 수 있습니다. 예를 들면 다음과 같습니다.

source: Like we mentioned, it&rsquo;s not unexpected to get error messages after conversion. The important thing is to actually go one by one through these and decide how to deal with the errors. Often these will be legitimate bugs, but sometimes you&rsquo;ll have to explain what you&rsquo;re trying to do a little better to TypeScript.
es: Como mencionamos, no es inesperado recibir mensajes de error despu&eacute;s de la conversi&oacute;n. Lo importante es revisarlos uno por uno y decidir c&oacute;mo lidiar con los errores. A menudo, estos ser&aacute;n errores leg&iacute;timos, pero a veces tendr&aacute;s que explicar un poco mejor lo que intentas hacer con TypeScript.
ko: 앞에서 언급했듯이 변환 후 오류 메시지가 나타나는 것은 예기치 않은 일이 아닙니다. 중요한 것은 실제로 이들을 통해 하나씩 차례로 가서 오류를 처리하는 방법을 결정하는 것입니다. 종종 이것들은 합법적 인 버그 일 것입니다. 그러나 때때로 TypeScript에 대해 조금 더 잘하려고하는 것을 설명해야합니다.

source: Likewise, for the return type of a function:
es: De la misma manera,para el tipo de retorno de una función:
ko: 마찬가지로 함수의 반환 유형에 대해서도 :

source: Likewise, multiple candidates for the same type variable in contra-variant positions causes an intersection type to be inferred:
es: Del mismo modo,el hecho de que haya varios candidatos para el mismo tipo de variable en posiciones contravariantes hace que se infiera un tipo de intersección:
ko: 마찬가지로, 반 변형 위치에서 동일한 유형 변수에 대한 여러 후보는 교집합 유형을 유추합니다.

source: Linter Checks
ko: 린터 체크

source: List Emitted Files - <code>listEmittedFiles</code>
ko: 내 보낸 파일 나열 <code>listEmittedFiles</code>

source: List Files - <code>listFiles</code>
ko: 파일 나열 <code>listFiles</code>

source: List of
es: Lista de
ko: 의 목록

source: List of folders to include type definitions from. See <a href="https://www.typescriptlang.org/tsconfig#types">@types, &mdash;typeRoots and &mdash;types</a> for more details.
ko: 유형 정의를 포함 할 폴더 목록입니다. 자세한 내용은 <a href="https://www.typescriptlang.org/tsconfig#types">@types, &mdash;typeRoots 및 &mdash;types</a> 를 참조하십시오.

source: List of folders to include type definitions from. See <a href="tsconfig-json#types-typeroots-and-types">@types, &ndash;typeRoots and &ndash;types</a> for more details.
es: Lista de carpetas para incluir definiciones de tipos. Consulte <a href="tsconfig-json#types-typeroots-and-types">@types, &ndash;typeRoots y &ndash;types</a> para obtener m&aacute;s detalles.
ko: 유형 정의를 포함 할 폴더 목록. 자세한 내용은 <a href="tsconfig-json#types-typeroots-and-types">@types, &ndash;typeRoots 및 &ndash;types</a> 를 참조하십시오.

source: List of language service plugins to run inside the editor.
ko: 편집기 내에서 실행할 언어 서비스 플러그인 목록입니다.

source: List of library files to be included in the compilation.
es: Lista de archivos de la biblioteca que se incluirán en la compilación.
ko: 컴파일에 포함 할 라이브러리 파일 목록.

source: List of names of type definitions to include. See <a href="https://www.typescriptlang.org/tsconfig#types">@types, &mdash;typeRoots and &mdash;types</a> for more details.
ko: 포함 할 유형 정의의 이름 목록입니다. 자세한 내용은 <a href="https://www.typescriptlang.org/tsconfig#types">@types, &mdash;typeRoots 및 &mdash;types</a> 를 참조하십시오.

source: List of names of type definitions to include. See <a href="tsconfig-json#types-typeroots-and-types">@types, &ndash;typeRoots and &ndash;types</a> for more details.
es: Lista de nombres de definiciones de tipo para incluir. Consulte <a href="tsconfig-json#types-typeroots-and-types">@types, &ndash;typeRoots y &ndash;types</a> para obtener m&aacute;s detalles.
ko: 포함 할 유형 정의의 이름 목록입니다. 자세한 내용은 <a href="tsconfig-json#types-typeroots-and-types">@types, &ndash;typeRoots 및 &ndash;types</a> 를 참조하십시오.

source: List of path mapping entries for module names to locations relative to the <code>baseUrl</code>. See <a href="module-resolution#path-mapping">Module Resolution documentation</a> for more details.
es: Lista de entradas de asignaci&oacute;n de ruta de nombres de los m&oacute;dulos a ubicaciones relativas a la <code>baseUrl</code> . Consulte la <a href="module-resolution#path-mapping">documentaci&oacute;n de Resoluci&oacute;n del m&oacute;dulo</a> para obtener m&aacute;s detalles.
ko: 받는 사람의 상대 위치에 모듈 이름에 대한 경로 매핑 항목의 목록 <code>baseUrl</code> . 자세한 내용은 <a href="module-resolution#path-mapping">모듈 확인 설명서</a> 를 참조하십시오.

source: Literal Narrowing
ko: 리터럴 좁히기

source: Literal Types
ko: 리터럴 타입

source: Literal type widening can be controlled through explicit type annotations. Specifically, when an expression of a literal type is inferred for a const location without a type annotation, that <code>const</code> variable gets a widening literal type inferred. But when a <code>const</code> location has an explicit literal type annotation, the <code>const</code> variable gets a non-widening literal type.
es: El ensanchamiento de tipo literal se puede controlar mediante anotaciones de tipo expl&iacute;citas. Espec&iacute;ficamente, cuando se infiere una expresi&oacute;n de un tipo literal para una ubicaci&oacute;n const sin una anotaci&oacute;n de tipo, esa variable <code>const</code> obtiene un tipo de literal ampliado inferido. Pero cuando una ubicaci&oacute;n <code>const</code> tiene una anotaci&oacute;n de tipo literal expl&iacute;cita, la variable <code>const</code> obtiene un tipo literal que no se ensancha.
ko: 명시 적 유형 주석을 통해 리터럴 유형 확장을 제어 할 수 있습니다. 구체적으로, 리터럴 타입의 표현식이 타입 어노테이션이없는 const 위치에 대해 유추 될 때, 그 <code>const</code> 변수는 확장 된 리터럴 타입을 유추합니다. 그러나 <code>const</code> 위치에 명시적인 리터럴 형식 주석이 있으면 <code>const</code> 변수는 확장되지 않은 리터럴 형식을 가져 옵니다 .

source: Loading of types from npm packages
es: Carga de tipos de paquetes de npm
ko: npm 패키지에서 유형로드

source: Local and Imported Type Declarations Now Conflict
es: Las declaraciones de tipo local e importado ahora entran en conflicto
ko: 로컬 및 가져온 형식 선언이 충돌합니다.

source: Local class, interface, enum, and type alias declarations can now appear inside function declarations. Local types are block scoped, similar to variables declared with <code>let</code> and <code>const</code>. For example:
es: Las declaraciones de clase local, interfaz, enumeraci&oacute;n y alias de tipo ahora pueden aparecer dentro de las declaraciones de funci&oacute;n. Los tipos locales tienen un &aacute;mbito de bloque, similar a las variables declaradas con <code>let</code> y <code>const</code> . Por ejemplo:
ko: 이제 로컬 클래스, 인터페이스, 열거 형 및 유형 별칭 선언이 함수 선언 내에 나타날 수 있습니다. 지역 유형은 <code>let</code> 및 <code>const</code> 로 선언 된 변수와 유사한 블록 범위 입니다. 예를 들면 다음과 같습니다.

source: Local type declarations
es: Declaraciones de tipo local
ko: 지역 유형 선언

source: Local types may reference enclosing type parameters and local class and interfaces may themselves be generic. For example:
es: Los tipos locales pueden hacer referencia a parámetros de tipos de cierre y las clases e interfaces locales pueden ser en sí mismas genéricas.Por ejemplo:
ko: 로컬 형식은 둘러싸는 형식 매개 변수를 참조 할 수 있으며 로컬 클래스와 인터페이스 자체는 일반적 일 수 있습니다. 예를 들면 다음과 같습니다.

source: Localized diagnostics on the command line
es: Diagnósticos localizados en la línea de mando
ko: 명령 줄에서 현지화 된 진단

source: Locally scoped JSX namespaces
es: Los espacios de nombres JSX con alcance local
ko: 로컬 범위의 JSX 네임 스페이스

source: Location of default .d.ts
ko: 기본 .d.ts의 위치

source: Look in the first localhost folder, then scripts/app.ts
es: Busca en la primera carpeta de localhost,luego scripts/app.ts
ko: 첫 번째 localhost 폴더를 찾은 다음 scripts / app.ts를 찾으십시오.

source: Look in your <code>C:\Program Files (x86)\MSBuild\Microsoft\VisualStudio\v$(VisualStudioVersion)\TypeScript\Microsoft.TypeScript.targets</code> file. The authoritative mappings between MSBuild XML tags and <code>tsc</code> compiler options live in there.
es: Busque en su <code>C:\Program Files (x86)\MSBuild\Microsoft\VisualStudio\v$(VisualStudioVersion)\TypeScript\Microsoft.TypeScript.targets</code> . Las asignaciones autorizadas entre las etiquetas XML de MSBuild y las opciones del compilador <code>tsc</code> residen all&iacute;.
ko: 당신의 봐 <code>C:\Program Files (x86)\MSBuild\Microsoft\VisualStudio\v$(VisualStudioVersion)\TypeScript\Microsoft.TypeScript.targets</code> 파일. MSBuild XML 태그와 <code>tsc</code> 컴파일러 옵션 사이의 권위있는 매핑 이 여기에 있습니다.

source: MSBuild Property Name
es: MSBuild Nombre de la propiedad
ko: MSBuild 속성 이름

source: Make sure that the modules work by running <code>gulp</code> and then testing in Node:
es: Aseg&uacute;rese de que los m&oacute;dulos funcionen ejecutando <code>gulp</code> y luego probando en Node:
ko: <code>gulp</code> 를 실행 한 다음 노드에서 테스트 하여 모듈이 작동하는지 확인하십시오 .

source: Make sure to revisit the <a href="library-structures#consuming-dependencies">Consuming dependencies</a> section for more information.
es: Aseg&uacute;rese de volver a visitar la secci&oacute;n <a href="library-structures#consuming-dependencies">Consumir dependencias</a> para obtener m&aacute;s informaci&oacute;n.
ko: 자세한 정보 는 <a href="library-structures#consuming-dependencies">소비 종속성</a> 섹션 을 다시 방문 하십시오.

source: Many JavaScript developers are intimately familiar with this behavior, but if you&rsquo;re surprised, you&rsquo;re certainly not alone. Most people expect the output to be
es: Muchos desarrolladores de JavaScript est&aacute;n &iacute;ntimamente familiarizados con este comportamiento, pero si te sorprende, ciertamente no est&aacute;s solo. La mayor&iacute;a de la gente espera que la salida sea
ko: 많은 JavaScript 개발자는이 동작에 대해 친숙하지만 친숙한 사용자는 아닙니다. 대부분의 사람들은 출력이

source: Many bundlers have support for automatically splitting output bundles based on these <code>import</code> expressions, so consider using this new feature with the <code>esnext</code> module target.
es: Muchos paquetes admiten la divisi&oacute;n autom&aacute;tica de paquetes de salida en funci&oacute;n de estas expresiones de <code>import</code> aci&oacute;n , as&iacute; que considere usar esta nueva funci&oacute;n con el <code>esnext</code> m&oacute;dulo esnext .
ko: 많은 번 <code>esnext</code> 는 이러한 <code>import</code> 표현식을 기반으로 출력 번들 자동 분할을 지원 하므로 esnext 모듈 대상 과 함께이 새로운 기능을 사용하는 것이 좋습니다 .

source: Many common mistakes in declaration files can be easily avoided. The <a href="do-s-and-don-ts">Do&rsquo;s and Don&rsquo;ts</a> section identifies common errors, describes how to detect them, and how to fix them. Everyone should read this section to help themselves avoid common mistakes.
es: Muchos errores comunes en los archivos de declaraci&oacute;n se pueden evitar f&aacute;cilmente. La secci&oacute;n <a href="do-s-and-don-ts">Qu&eacute; hacer y qu&eacute; no hacer</a> identifica errores comunes, describe c&oacute;mo detectarlos y c&oacute;mo solucionarlos. Todos deben leer esta secci&oacute;n para evitar errores comunes.
ko: 선언 파일의 많은 일반적인 실수는 쉽게 피할 수 있습니다. <a href="do-s-and-don-ts">하는 것과하지 않는</a> 섹션을 식별 일반적인 오류는이를 감지하는 방법 및이를 해결하는 방법을 설명합니다. 일반적인 실수를 피하기 위해이 섹션을 읽어야합니다.

source: Many popular Node.js libraries are in the module family, such as <a href="http://expressjs.com/"><code>express</code></a>, <a href="http://gulpjs.com/"><code>gulp</code></a>, and <a href="https://github.com/request/request"><code>request</code></a>.
es: Muchas bibliotecas populares de Node.js est&aacute;n en la familia de m&oacute;dulos, como <a href="http://expressjs.com/"> <code>express</code> </a> , <a href="http://gulpjs.com/"> <code>gulp</code> </a> y <a href="https://github.com/request/request"> <code>request</code> </a> .
ko: <a href="http://expressjs.com/"> <code>express</code> </a> , <a href="http://gulpjs.com/"> <code>gulp</code> </a> 및 <a href="https://github.com/request/request"> <code>request</code> </a> 와 같이 널리 사용되는 많은 Node.js 라이브러리가 모듈 제품군에 있습니다.

source: Many popular libraries, such as Express, expose themselves as a callable function when imported. For example, the typical Express usage looks like this:
es: Muchas bibliotecas populares,como la Express,se exponen como una función llamable cuando se importan.Por ejemplo,el uso típico de Express se ve así:
ko: Express와 같은 널리 사용되는 많은 라이브러리는 가져올 때 호출 가능한 함수로 자신을 노출시킵니다. 예를 들어, 일반적인 Express 사용법은 다음과 같습니다.

source: Many times, we are faced with writing a declaration file when we only have examples of the underlying library to guide us. The <a href="by-example">By Example</a> section shows many common API patterns and how to write declarations for each of them. This guide is aimed at the TypeScript novice who may not yet be familiar with every language construct in TypeScript.
es: Muchas veces, nos enfrentamos a escribir un archivo de declaraci&oacute;n cuando solo tenemos ejemplos de la biblioteca subyacente para guiarnos. La secci&oacute;n <a href="by-example">Por ejemplo</a> muestra muchos patrones de API comunes y c&oacute;mo escribir declaraciones para cada uno de ellos. Esta gu&iacute;a est&aacute; dirigida a los principiantes de TypeScript que a&uacute;n no est&eacute;n familiarizados con todas las construcciones de lenguaje en TypeScript.
ko: 우리는 기본 라이브러리의 예제 만 가지고있을 때 선언 파일을 작성해야하는 경우가 많습니다. <a href="by-example">으로 예</a> 섹션 쇼 많은 일반적인 API 패턴과 방법을 그들 각각에 대한 선언을 작성하는 방법. 이 안내서는 TypeScript의 모든 언어 구성에 아직 익숙하지 않은 TypeScript 초보자를 대상으로합니다.

source: Map Root - <code>mapRoot</code>
ko: 맵 루트 <code>mapRoot</code>

source: Mapped Types
es: Tipos mapeados
ko: 매핑 된 유형

source: Mapped types
es: Tipos mapeados
ko: 매핑 된 유형

source: Mapped types are produced by taking a union of literal types, and computing a set of properties for a new object type. They&rsquo;re like <a href="https://docs.python.org/2/tutorial/datastructures.html#nested-list-comprehensions">list comprehensions in Python</a>, but instead of producing new elements in a list, they produce new properties in a type.
es: Los tipos asignados se generan tomando una uni&oacute;n de tipos literales y calculando un conjunto de propiedades para un nuevo tipo de objeto. Son como <a href="https://docs.python.org/2/tutorial/datastructures.html#nested-list-comprehensions">listas por comprensi&oacute;n en Python</a> , pero en lugar de producir nuevos elementos en una lista, producen nuevas propiedades en un tipo.
ko: 매핑 된 형식은 리터럴 형식을 통합하고 새 개체 형식에 대한 속성 집합을 계산하여 생성됩니다. 그들은 <a href="https://docs.python.org/2/tutorial/datastructures.html#nested-list-comprehensions">파이썬에서 목록 이해</a> 와 같지만 목록에서 새로운 요소를 생성하는 대신 유형으로 새로운 속성을 생성합니다.

source: Mapped types on tuples and arrays
es: Tipos mapeados en tuplas y matrices
ko: 튜플 및 배열의 ​​매핑 된 유형

source: Mapped types support adding a <code>readonly</code> or <code>?</code> modifier to a mapped property, but they did not provide support the ability to <em>remove</em> modifiers. This matters in <a href="https://github.com/Microsoft/TypeScript/pull/12563"><em>homomorphic mapped types</em></a> which by default preserve the modifiers of the underlying type.
es: Los tipos asignados admiten la adici&oacute;n de un <code>readonly</code> o <code>?</code> modificador a una propiedad asignada, pero no proporcionaban soporte para la capacidad de <em>eliminar</em> modificadores. Esto es importante en los <a href="https://github.com/Microsoft/TypeScript/pull/12563"><em>tipos mapeados homom&oacute;rficos</em></a> que, por defecto, conservan los modificadores del tipo subyacente.
ko: 매핑 된 유형은 <code>readonly</code> 또는 <code>?</code> 수정자를 맵핑 된 특성에 대한 수정 자이지만 수정자를 <em>제거</em> 하는 기능을 지원하지 않았습니다 . 기본적으로 기본 형식의 수정자를 유지하는 <a href="https://github.com/Microsoft/TypeScript/pull/12563"><em>동형 매핑 형식</em></a> 이 중요 합니다.

source: Matching behavior
es: Comportamiento de la pareja
ko: 어울리는 행동

source: Max Node Module JS Depth - <code>maxNodeModuleJsDepth</code>
ko: 최대 노드 모듈 JS 깊이 <code>maxNodeModuleJsDepth</code>

source: Maybe it was easy to spot out for some experienced JavaScript developers, but the inner <code>for</code>-loop will accidentally overwrite the variable <code>i</code> because <code>i</code> refers to the same function-scoped variable. As experienced developers know by now, similar sorts of bugs slip through code reviews and can be an endless source of frustration.
ko: 경험이 많은 자바 스크립트 개발자에게는 쉽게 알아 차릴 수 있었지만, 내부 <code>for</code> 루프는 <code>i</code> 가 동일한 함수 범위 변수를 참조하기 때문에 실수로 변수 <code>i</code> 를 덮어 쓰게됩니다 . 숙련 된 개발자가 지금까지 알고 있듯이 유사한 종류의 버그가 코드 검토를 통해 빠져 나가며 끝없는 좌절의 원인이 될 수 있습니다.

source: Maybe it was easy to spot out for some, but the inner <code>for</code>-loop will accidentally overwrite the variable <code>i</code> because <code>i</code> refers to the same function-scoped variable. As experienced developers know by now, similar sorts of bugs slip through code reviews and can be an endless source of frustration.
es: Tal vez fue f&aacute;cil de detectar para algunos, pero el bucle <code>for</code> interno sobrescribir&aacute; accidentalmente la variable <code>i</code> porque <code>i</code> se refiere a la misma variable de &aacute;mbito de funci&oacute;n. Como ya saben los desarrolladores experimentados, tipos similares de errores se escabullen en las revisiones de c&oacute;digo y pueden ser una fuente inagotable de frustraci&oacute;n.
ko: 어쩌면 일부를 알아내는 것이 쉽지만 내부 <code>for</code> -loop는 실수로 변수 <code>i</code> 를 덮어 씁니다. 왜냐하면 <code>i</code> 는 동일한 함수 범위 변수를 참조하기 때문 입니다. 지금까지 숙련 된 개발자가 알고 있듯이 유사한 종류의 버그는 코드 검토 과정을 거칠며 끝없는 좌절의 원인이 될 수 있습니다.

source: Merging Interfaces
es: Interfaces de fusión
ko: 인터페이스 병합

source: Merging Namespaces
es: Fusión de espacios de nombres
ko: 네임 스페이스 병합

source: Merging Namespaces with Classes
es: Fusión de espacios de nombres con clases
ko: 클래스와 네임 스페이스 병합

source: Merging Namespaces with Classes, Functions, and Enums
es: Fusionar los espacios de nombres con clases,funciones y sumas
ko: 클래스, 함수 및 열거와 네임 스페이스 병합

source: Merging ambient class and interface declaration
es: Fusión de la clase de ambiente y la declaración de la interfaz
ko: 앰비언트 클래스 및 인터페이스 선언 병합

source: Method Decorators
es: Método Decoradores
ko: 메소드 데코레이터

source: Methods within an abstract class that are marked as abstract do not contain an implementation and must be implemented in derived classes. Abstract methods share a similar syntax to interface methods. Both define the signature of a method without including a method body. However, abstract methods must include the <code>abstract</code> keyword and may optionally include access modifiers.
es: Los m&eacute;todos dentro de una clase abstracta que est&aacute;n marcados como abstractos no contienen una implementaci&oacute;n y deben implementarse en clases derivadas. Los m&eacute;todos abstractos comparten una sintaxis similar a los m&eacute;todos de interfaz. Ambos definen la firma de un m&eacute;todo sin incluir un cuerpo de m&eacute;todo. Sin embargo, los m&eacute;todos abstractos deben incluir la palabra clave <code>abstract</code> a y, opcionalmente, pueden incluir modificadores de acceso.
ko: 추상으로 표시된 추상 클래스 내의 메소드는 구현을 포함하지 않으며 파생 클래스에서 구현되어야합니다. 추상 메소드는 인터페이스 메소드와 유사한 구문을 공유합니다. 둘 다 메소드 본문을 포함하지 않고 메소드의 서명을 정의합니다. 그러나 추상 메소드는 <code>abstract</code> 키워드를 포함해야하며 선택적으로 액세스 수정자를 포함 할 수 있습니다.

source: Migrating from JavaScript
es: Migrando desde JavaScript
ko: JavaScript에서 마이그레이션

source: Migrating from JavaScript: Early Benefits
es: Migrando desde JavaScript:Beneficios tempranos
ko: JavaScript에서 마이그레이션 : 초기 이점

source: Migrating from JavaScript: Getting Stricter Checks
es: Migrando desde JavaScript:Obteniendo controles más estrictos
ko: JavaScript에서 마이그레이션 :보다 엄격한 검사

source: Migrating from JavaScript: Gulp
es: Migrando desde JavaScript:Gulp
ko: JavaScript에서 마이그레이션 : Gulp

source: Migrating from JavaScript: Integrating with Build Tools
es: Migrando desde JavaScript:Integración con herramientas de construcción
ko: JavaScript에서 마이그레이션 : 빌드 도구와 통합

source: Migrating from JavaScript: Moving to TypeScript Files
es: Migrando desde JavaScript:Migrando a los archivos de TypeScript
ko: JavaScript에서 마이그레이션 : TypeScript 파일로 이동

source: Migrating from JavaScript: Setting up your Directories
es: Migrando desde JavaScript:Establecimiento de sus directorios
ko: JavaScript에서 마이그레이션 : 디렉토리 설정

source: Migrating from JavaScript: Webpack
es: Migrando desde JavaScript:Webpack
ko: JavaScript에서 마이그레이션 : Webpack

source: Migrating from JavaScript: Weeding out Errors
es: Migrando desde JavaScript:Eliminando los errores
ko: JavaScript에서 마이그레이션 : 오류 제거

source: Migrating from JavaScript: Writing a Configuration File
es: Migrando desde JavaScript:Escribiendo un archivo de configuración
ko: JavaScript에서 마이그레이션 : 구성 파일 작성

source: Minimal project
es: Proyecto mínimo
ko: 최소 프로젝트

source: Mixin classes can constrain the types of classes they can mix into by specifying a construct signature return type in the constraint for the type parameter. For example, the following <code>WithLocation</code> function implements a subclass factory that adds a <code>getLocation</code> method to any class that satisfies the <code>Point</code> interface (i.e. that has <code>x</code> and <code>y</code> properties of type <code>number</code>).
es: Las clases de mezcla pueden restringir los tipos de clases en las que pueden mezclarse especificando un tipo de retorno de firma de construcci&oacute;n en la restricci&oacute;n para el par&aacute;metro de tipo. Por ejemplo, las siguientes <code>WithLocation</code> funci&oacute;n implementa una f&aacute;brica de subclase que a&ntilde;ade un <code>getLocation</code> m&eacute;todo para cualquier clase que satisface el <code>Point</code> de interfaz (es decir, que tiene <code>x</code> y <code>y</code> propiedades de tipo <code>number</code> ).
ko: Mixin 클래스는 type 매개 변수의 제약 조건에서 구문 서명 반환 형식을 지정하여 혼합 할 수있는 클래스 유형을 제한 할 수 있습니다. 예를 들어, 다음 <code>WithLocation</code> 의 기능을 구현하는 추가 서브 클래스 공장 <code>getLocation</code> 어떤 클래스 방법을 만족하는 <code>Point</code> (즉 갖는 인터페이스 <code>x</code> 및 <code>y</code> 형의 특성 <code>number</code> ).

source: Mixin sample
es: Muestra de la mezcla
ko: 믹스 인 샘플

source: Modern browsers support all ES6 features, so <code>ES6</code> is a good choice. You might choose to set a lower target if your code is deployed to older environments, or a higher target if your code is guaranteed to run in newer environments.
ko: 최신 브라우저는 모든 ES6 기능을 지원하므로 <code>ES6</code> 가 좋은 선택입니다. 코드가 이전 환경에 배포 된 경우 더 낮은 대상을 설정하거나 코드가 최신 환경에서 실행되도록 보장되는 경우 더 높은 대상을 설정하도록 선택할 수 있습니다.

source: Modify the html by removing one of the <code>p</code> tags, but keep the text.
ko: <code>p</code> 태그 중 하나를 제거하여 html을 수정 하되 텍스트는 유지하십시오.

source: Modular Libraries
es: Bibliotecas modulares
ko: 모듈 식 라이브러리

source: Modular libraries will typically have at least some of the following:
es: Las bibliotecas modulares suelen tener al menos algunos de los siguientes elementos:
ko: 모듈 식 라이브러리는 일반적으로 다음 중 일부를 갖습니다.

source: Module - <code>module</code>
ko: 모듈- <code>module</code>

source: Module Augmentation
es: Módulo de aumento
ko: 모듈 확대

source: Module Resolution
es: Resolución del módulo
ko: 모듈 확인

source: Module Resolution - <code>moduleResolution</code>
ko: 모듈 확인 <code>moduleResolution</code>

source: Module Resolution Strategies
es: Módulo Estrategias de resolución
ko: 모듈 확인 전략
