Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/typescript/typescript.*.003.xlf
Languages: es, ko, ru, zh_cn

source: Or we might want a readonly version:
es: O podríamos querer una versión de sólo lectura:
ko: 또는 읽기 전용 버전을 원할 수도 있습니다.
ru: Или нам может понадобиться версия только для чтения:
zh_cn: 或者我们可能需要一个只读版本。

source: Or you can just use the unspecified <code>Function</code> type:
es: O simplemente puede usar el tipo de <code>Function</code> no especificado :
ko: 또는 지정되지 않은 것을 사용할 수 있습니다. <code>Function</code> 유형을 .
ru: Или вы можете просто использовать неуказанный тип <code>Function</code> :
zh_cn: 或者，您可以只使用未指定的 <code>Function</code> 类型：

source: Or, even manually set all the values in the enum:
es: O,incluso,ajustar manualmente todos los valores en el enum:
ko: 또는 열거 형의 모든 값을 수동으로 설정하십시오.
ru: Или даже вручную установить все значения в перечислении:
zh_cn: 或者,甚至手动设置enum中的所有值。

source: Or, we could describe the identity function using the <code>any</code> type:
es: O, podr&iacute;amos describir la funci&oacute;n de identidad usando <code>any</code> tipo:
ko: 또는, 우리는 사용하여 식별 기능을 설명 할 수 <code>any</code> 유형을 .
ru: Или мы могли бы описать функцию идентификации, используя <code>any</code> тип:
zh_cn: 或者，我们可以使用 <code>any</code> 类型来描述身份函数：

source: Organizing Types
es: Tipos de organización
ko: 조직 유형
ru: Типы организации
zh_cn: 组织类型

source: Other types from Closure also work:
es: Otros tipos de Closure también funcionan:
ko: Closure의 다른 유형도 작동합니다.
ru: Другие типы от Closure также работают:
zh_cn: Closure的其他类型也可以。

source: Other variants are allowed as well:
es: También se permiten otras variantes:
ko: 다른 변형도 허용됩니다.
ru: Допускаются и другие варианты:
zh_cn: 其他变体也是可以的。

source: Otherwise use <code>--keyofStringsOnly</code> compiler option to disable the new behavior.
es: De lo contrario, use la opci&oacute;n del compilador <code>--keyofStringsOnly</code> para deshabilitar el nuevo comportamiento.
ko: 그렇지 않으면 <code>--keyofStringsOnly</code> 를 사용 하십시오. 컴파일러 옵션을 사용하여 새 동작을 비활성화하십시오.
ru: В противном случае используйте <code>--keyofStringsOnly</code> компилятора --keyofStringsOnly, чтобы отключить новое поведение.
zh_cn: 否则，请使用 <code>--keyofStringsOnly</code> 编译器选项来禁用新行为。

source: Otherwise, the condition depends on one or more type variables and the conditional type is deferred.
es: De lo contrario,la condición depende de una o más variables de tipo y el tipo condicional se aplaza.
ko: 그렇지 않으면 조건이 하나 이상의 유형 변수에 의존하고 조건 유형이 연기됩니다.
ru: В противном случае условие зависит от одной или нескольких переменных типа,а условие является отложенным.
zh_cn: 否则,条件取决于一个或多个类型变量,条件类型将被推迟。

source: Otherwise, we assume that you&rsquo;re already using <a href="https://nodejs.org/">Node.js</a> with <a href="https://www.npmjs.com/">npm</a>.
es: De lo contrario, asumimos que ya est&aacute; usando <a href="https://nodejs.org/">Node.js</a> con <a href="https://www.npmjs.com/">npm</a> .
ko: 그렇지 않으면, 우리는 이미 <a href="https://www.npmjs.com/">npm</a> 과 함께 <a href="https://nodejs.org/">Node.js</a> 를 사용하고 있다고 가정합니다. .
ru: В противном случае мы предполагаем, что вы уже используете <a href="https://nodejs.org/">Node.js</a> с <a href="https://www.npmjs.com/">npm</a> .
zh_cn: 否则，我们假设您已经在使用<a href="https://nodejs.org/">Node.js</a>和<a href="https://www.npmjs.com/">npm</a>。

source: Our First Interface
es: Nuestra primera interfaz
ko: 첫 인터페이스
ru: Наш первый интерфейс
zh_cn: 我们的第一个界面

source: Our package exposes declarations from each of those, so any user of our <code>browserify-typescript-extension</code> package needs to have these dependencies as well. For that reason, we used <code>"dependencies"</code> and not <code>"devDependencies"</code>, because otherwise our consumers would have needed to manually install those packages. If we had just written a command line application and not expected our package to be used as a library, we might have used <code>devDependencies</code>.
es: Nuestro paquete expone declaraciones de cada uno de ellos, por lo que cualquier usuario de nuestro <code>browserify-typescript-extension</code> necesita tener estas dependencias tambi&eacute;n. Por esa raz&oacute;n, usamos <code>"dependencies"</code> y no <code>"devDependencies"</code> , porque de lo contrario nuestros consumidores habr&iacute;an necesitado instalar manualmente esos paquetes. Si acab&aacute;bamos de escribir una aplicaci&oacute;n de l&iacute;nea de comandos y no esper&aacute;bamos que nuestro paquete se usara como biblioteca, podr&iacute;amos haber usado <code>devDependencies</code> .
ko: 우리 패키지는 각각의 선언을 공개하므로 <code>browserify-typescript-extension</code> 패키지 의 모든 사용자 는 이러한 의존성을 가져야합니다. 따라서 <code>"devDependencies"</code> 가 아닌 <code>"dependencies"</code> 를 사용했습니다. 그렇지 않으면 소비자가 해당 패키지를 수동으로 설치해야했기 때문입니다. 명령 행 애플리케이션을 방금 작성했지만 패키지가 라이브러리로 사용될 것으로 예상하지 않은 경우 <code>devDependencies</code> 를 사용 했을 수 있습니다. .
ru: В нашем пакете есть объявления каждого из них, поэтому любой пользователь нашего пакета <code>browserify-typescript-extension</code> также должен иметь эти зависимости. По этой причине мы использовали <code>"dependencies"</code> а не <code>"devDependencies"</code> , потому что в противном случае нашим потребителям пришлось бы вручную устанавливать эти пакеты. Если бы мы только что написали приложение командной строки и не ожидали, что наш пакет будет использоваться в качестве библиотеки, мы могли бы использовать <code>devDependencies</code> .
zh_cn: 我们的程序包公开了每个声明的声明，因此 <code>browserify-typescript-extension</code> 程序包的任何用户也需要具有这些依赖关系。因此，我们使用 <code>"dependencies"</code> 而不是 <code>"devDependencies"</code> ，因为否则我们的使用者将需要手动安装那些软件包。如果我们只是编写了命令行应用程序，并且不希望我们的程序包被用作库，则可能使用了 <code>devDependencies</code> 。

source: Output File Extension
es: Extensión del archivo de salida
ko: 출력 파일 확장자
ru: Расширение выходного файла
zh_cn: 输出文件扩展名

source: Output directory for generated declaration files.
es: Directorio de salida para los archivos de declaración generados.
ko: 생성 된 선언 파일의 출력 디렉토리.
ru: Выходной каталог для сгенерированных файлов декларации.
zh_cn: 生成的声明文件的输出目录。

source: Output generation
es: Generación de salida
ko: 출력 생성
ru: Генерация выхода
zh_cn: 产出生成

source: Outside of <code>.tsx</code> files, the angle bracket assertion syntax can also be used.
es: Fuera de los archivos <code>.tsx</code> , tambi&eacute;n se puede utilizar la sintaxis de aserci&oacute;n de corchetes angulares.
ko: <code>.tsx</code> 외부 파일 에서 꺾쇠 괄호 어설 션 구문도 사용할 수 있습니다.
ru: Вне <code>.tsx</code> файлов, синтаксис утверждения скобки также может быть использован.
zh_cn: 在 <code>.tsx</code> 文件之外，也可以使用尖括号声明语法。

source: Overall Structure
es: Estructura general
ko: 전반적인 구조
ru: Общая структура
zh_cn: 整体结构

source: Overloaded Function
es: Función sobrecargada
ko: 과부하 기능
ru: Перегруженная функция
zh_cn: 过载功能

source: Overloaded Functions
es: Funciones sobrecargadas
ko: 과부하 된 기능
ru: Перегруженные функции
zh_cn: 过载函数

source: Overloads and Callbacks
es: Sobrecargas y retrollamadas
ko: 과부하 및 콜백
ru: Перегрузки и обратные вызовы
zh_cn: 过载和回调

source: Packages under the <a href="https://www.npmjs.com/~types">@types</a> organization are published automatically from <a href="https://github.com/DefinitelyTyped/DefinitelyTyped">DefinitelyTyped</a> using the <a href="https://github.com/Microsoft/types-publisher">types-publisher tool</a>. To get your declarations published as an @types package, please submit a pull request to <a href="https://github.com/DefinitelyTyped/DefinitelyTyped">https://github.com/DefinitelyTyped/DefinitelyTyped</a>. You can find more details in the <a href="http://definitelytyped.org/guides/contributing.html">contribution guidelines page</a>.
es: Los paquetes de la organizaci&oacute;n <a href="https://www.npmjs.com/~types">@types</a> se publican autom&aacute;ticamente desde <a href="https://github.com/DefinitelyTyped/DefinitelyTyped">DefinitelyTyped</a> utilizando la <a href="https://github.com/Microsoft/types-publisher">herramienta de editor de tipos</a> . Para que sus declaraciones se publiquen como un paquete @types, env&iacute;e una solicitud de extracci&oacute;n a <a href="https://github.com/DefinitelyTyped/DefinitelyTyped">https://github.com/DefinitelyTyped/DefinitelyTyped</a> . Puede encontrar m&aacute;s detalles en la <a href="http://definitelytyped.org/guides/contributing.html">p&aacute;gina de pautas de contribuci&oacute;n</a> .
ko: <a href="https://www.npmjs.com/~types">@types</a> 조직의 패키지 는 <a href="https://github.com/Microsoft/types-publisher">types-publisher 도구를</a> 사용하여 <a href="https://github.com/DefinitelyTyped/DefinitelyTyped">DefinitelyTyped</a> 에서 자동으로 게시됩니다 . 선언을 @types 패키지로 게시하려면 <a href="https://github.com/DefinitelyTyped/DefinitelyTyped">https://github.com/DefinitelyTyped/DefinitelyTyped에</a> 풀 요청을 제출 하십시오 . <a href="http://definitelytyped.org/guides/contributing.html">기여 지침 페이지</a> 에서 자세한 내용을 확인할 수 있습니다 . .
ru: Пакеты в <a href="https://www.npmjs.com/~types">рамках</a> организации @types публикуются автоматически из <a href="https://github.com/DefinitelyTyped/DefinitelyTyped">Определенного </a>Типа с помощью <a href="https://github.com/Microsoft/types-publisher">инструмента публикации типов</a> . Чтобы опубликовать свои объявления в виде пакета @types, отправьте запрос на перенос по <a href="https://github.com/DefinitelyTyped/DefinitelyTyped">адресу https://github.com/DefinitiTyped/DefinitiTyped</a> . Вы можете найти более подробную информацию на <a href="http://definitelytyped.org/guides/contributing.html">странице с рекомендациями</a> по взносам .
zh_cn: <a href="https://www.npmjs.com/~types">@types</a>组织下的软件包是使用<a href="https://github.com/Microsoft/types-publisher">types-publisher工具</a>从<a href="https://github.com/DefinitelyTyped/DefinitelyTyped">DefinitelyTyped</a>自动发布的。要使您的声明以@types包形式发布，请向<a href="https://github.com/DefinitelyTyped/DefinitelyTyped">https://github.com/DefinitelyTyped/DefinitelyTyped</a>提交拉取请求。您可以在<a href="http://definitelytyped.org/guides/contributing.html">贡献准则页面中</a>找到更多详细信息。

source: Packaging dependent declarations
es: Declaraciones dependientes de los embalajes
ko: 패키징 종속 선언
ru: Упаковочные декларации
zh_cn: 包装依赖性声明

source: Parameter Decorators
es: Decoradores de parámetros
ko: 파라미터 데코레이터
ru: Параметры Декораторы
zh_cn: 参数装饰器

source: Parameter properties
es: Propiedades de los parámetros
ko: 파라미터 속성
ru: Свойства параметров
zh_cn: 参数属性

source: Parameter properties are declared by prefixing a constructor parameter with an accessibility modifier or <code>readonly</code>, or both. Using <code>private</code> for a parameter property declares and initializes a private member; likewise, the same is done for <code>public</code>, <code>protected</code>, and <code>readonly</code>.
es: Las propiedades de los par&aacute;metros se declaran prefijando un par&aacute;metro de constructor con un modificador de accesibilidad o <code>readonly</code> , o ambos. El uso de <code>private</code> para una propiedad de par&aacute;metro declara e inicializa un miembro privado; Asimismo, se hace lo mismo para <code>public</code> , <code>protected</code> y de <code>readonly</code> .
ko: 매개 변수 속성은 생성자 매개 변수 앞에 접근성 수정 자 또는 <code>readonly</code> 또는 둘 다를 붙여서 선언 합니다. 매개 변수 속성에 <code>private</code> 을 사용하면 개인 구성원을 선언하고 초기화합니다. 마찬가지로 <code>public</code> , <code>protected</code> 및 <code>readonly</code> 에 대해서도 마찬가지 입니다.
ru: Свойства параметра объявляются с помощью префикса параметра конструктора с помощью модификатора доступности или только для <code>readonly</code> , или того и другого. Использование <code>private</code> для свойства параметра объявляет и инициализирует частный член; аналогично то же самое сделано для <code>public</code> , <code>protected</code> и только для <code>readonly</code> .
zh_cn: 通过使用可访问性修饰符或 <code>readonly</code> 或两者都为构造函数参数加上前缀来声明参数属性。对参数属性使用 <code>private</code> 可以声明和初始化private成员；同样，对 <code>public</code> ， <code>protected</code> 和 <code>readonly</code> 也是如此。

source: Parameters declaration with names starting with <code>_</code> are exempt from the unused parameter checking. e.g.:
es: La declaraci&oacute;n de par&aacute;metros con nombres que comienzan con <code>_</code> est&aacute;n exentas de la verificaci&oacute;n de par&aacute;metros no utilizados. p.ej:
ko: 이름이 <code>_</code> 로 시작하는 매개 변수 선언 은 사용되지 않은 매개 변수 검사에서 제외됩니다. 예 :
ru: Объявление параметров с именами, начинающимися с <code>_</code> , не подлежит проверке неиспользуемых параметров. например:
zh_cn: 名称以 <code>_</code> 开头的参数声明可免除未使用的参数检查。例如：

source: Parse in strict mode and emit <code>"use strict"</code> for each source file
es: Analiza en modo estricto y emite <code>"use strict"</code> para cada archivo fuente
ko: 엄격 모드에서 구문 분석하고 각 소스 파일에 대해 <code>"use strict"</code> 을 내 보냅니다.
ru: Выполните синтаксический анализ в строгом режиме и выдайте <code>"use strict"</code> для каждого исходного файла
zh_cn: 以严格模式解析并为每个源文件发出 <code>"use strict"</code>

source: Parses all the code in strict mode.
es: Analiza todo el código en modo estricto.
ko: 엄격 모드에서 모든 코드를 구문 분석합니다.
ru: Разбирает весь код в строгом режиме.
zh_cn: 以严格模式解析所有代码。

source: Part of the intent with composite projects (<code>tsconfig.json</code>s with <code>composite</code> set to <code>true</code>) is that references between different projects can be built incrementally. As such, composite projects will <strong>always</strong> produce <code>.tsbuildinfo</code> files.
es: Parte de la intenci&oacute;n con los proyectos compuestos ( <code>tsconfig.json</code> s con <code>composite</code> establecido en <code>true</code> ) es que las referencias entre diferentes proyectos se pueden construir de forma incremental. Como tal, los proyectos compuestos <strong>siempre</strong> producir&aacute;n archivos <code>.tsbuildinfo</code> .
ko: 컴포지트 프로젝트 ( <code>composite</code> 가 <code>true</code> 로 설정된 <code>tsconfig.json</code> ) 의 의도 중 하나는 다른 프로젝트 간의 참조를 증분 적으로 빌드 할 수 있다는 것입니다. 따라서 복합 프로젝트는 <strong>항상 </strong> <code>.tsbuildinfo</code> 파일을 생성 합니다.<strong></strong>
ru: Частично намерение составных проектов ( <code>tsconfig.json</code> s с <code>composite</code> значением <code>true</code> ) состоит в том, что ссылки между различными проектами могут создаваться постепенно. Таким образом, составные проекты <strong>всегда</strong> будут создавать файлы <code>.tsbuildinfo</code> .
zh_cn: 组合项目（ <code>tsconfig.json</code> ， <code>composite</code> 设置为 <code>true</code> ）的部分意图是，可以增量构建不同项目之间的引用。因此，复合项目将<strong>始终</strong>生成 <code>.tsbuildinfo</code> 文件。

source: Passing <code>--reactNamespace &lt;JSX factory Name&gt;</code> along with <code>--jsx react</code> allows for using a different JSX factory from the default <code>React</code>.
es: Pasar <code>--reactNamespace &lt;JSX factory Name&gt;</code> junto con <code>--jsx react</code> permite usar una f&aacute;brica JSX diferente de la predeterminada <code>React</code> .
ko: <code>--jsx react</code> 와 함께 <code>--reactNamespace &lt;JSX factory Name&gt;</code> 을 전달 하면 기본 <code>React</code> 와 다른 JSX 팩토리를 사용할 수 있습니다 .
ru: Передача <code>--reactNamespace &lt;JSX factory Name&gt;</code> вместе с <code>--jsx react</code> позволяет использовать другую фабрику JSX из <code>React</code> по умолчанию .
zh_cn: 与 <code>--jsx react</code> 一起传递 <code>--reactNamespace &lt;JSX factory Name&gt;</code> 允许使用与默认 <code>React</code> 不同的JSX工厂。

source: Path mapping
es: Mapeo de senderos
ko: 경로 매핑
ru: Картирование маршрутов
zh_cn: 路径映射

source: Patterns that are known NOT to be supported
es: Los patrones que se sabe que NO se apoyan
ko: 지원되지 않는 것으로 알려진 패턴
ru: Шаблоны,которые,как известно,НЕ поддерживаются.
zh_cn: 已知不支持的模式

source: Per-file JSX factories
es: Las fábricas JSX por archivo
ko: 파일 별 JSX 팩토리
ru: Заказные заводы JSX
zh_cn: 每个文件的JSX工厂

source: Perform additional checks to ensure that separate compilation (such as with <a href="https://github.com/Microsoft/TypeScript/wiki/Using-the-Compiler-API#a-simple-transform-function"><code>transpileModule</code></a> or <a href="https://babeljs.io/docs/en/babel-plugin-transform-typescript">@babel/plugin-transform-typescript</a>) would be safe.
es: Realice verificaciones adicionales para asegurarse de que la compilaci&oacute;n separada (como con <a href="https://github.com/Microsoft/TypeScript/wiki/Using-the-Compiler-API#a-simple-transform-function"> <code>transpileModule</code> </a> o <a href="https://babeljs.io/docs/en/babel-plugin-transform-typescript">@ babel / plugin-transform-typescript</a> ) sea segura.
ko: 별도의 컴파일 ( <a href="https://github.com/Microsoft/TypeScript/wiki/Using-the-Compiler-API#a-simple-transform-function"> <code>transpileModule</code> </a> 또는 <a href="https://babeljs.io/docs/en/babel-plugin-transform-typescript">@ babel / plugin-transform-typescript 등</a> )이 안전한지 확인하기 위해 추가 검사를 수행하십시오 .
ru: Выполните дополнительные проверки, чтобы убедиться, что отдельная компиляция (например, с <a href="https://github.com/Microsoft/TypeScript/wiki/Using-the-Compiler-API#a-simple-transform-function"> <code>transpileModule</code> </a> или <a href="https://babeljs.io/docs/en/babel-plugin-transform-typescript">@ babel / plugin-transform-typescript</a> ) будет безопасной.
zh_cn: 执行其他检查，以确保单独的编译（例如，使用<a href="https://github.com/Microsoft/TypeScript/wiki/Using-the-Compiler-API#a-simple-transform-function"> <code>transpileModule</code> </a>或<a href="https://babeljs.io/docs/en/babel-plugin-transform-typescript">@ babel / plugin-transform-typescript</a>）是安全的。

source: Performance Improvements
es: Mejoras en el rendimiento
ko: 성능 개선
ru: Повышение эффективности
zh_cn: 绩效改进

source: Pitfalls of Namespaces and Modules
es: Los peligros de los espacios de nombres y los módulos
ko: 네임 스페이스 및 모듈의 함정
ru: Питфоллы пространств имен и модулей
zh_cn: 命名空间和模块的陷阱

source: Please note that the compiler does not include files that can be possible outputs; e.g. if the input includes <code>index.ts</code>, then <code>index.d.ts</code> and <code>index.js</code> are excluded. In general, having files that differ only in extension next to each other is not recommended.
es: Tenga en cuenta que el compilador no incluye archivos que puedan ser posibles salidas; por ejemplo, si la entrada incluye <code>index.ts</code> , entonces se <code>index.d.ts</code> e <code>index.js</code> . En general, no se recomienda tener archivos que solo difieran en extensi&oacute;n uno al lado del otro.
ko: 컴파일러에는 출력이 가능한 파일이 포함되어 있지 않습니다. 상기 입력을 포함하는 경우 등 <code>index.ts</code> 을 다음 <code>index.d.ts</code> 및 <code>index.js</code> 제외된다. 일반적으로 확장자 만 다른 파일은 서로 옆에 두지 않는 것이 좋습니다.
ru: Обратите внимание, что компилятор не включает файлы, которые могут быть возможными выходами; например, если входные данные включают <code>index.ts</code> , то <code>index.d.ts</code> и <code>index.js</code> исключаются. Как правило, не рекомендуется размещать рядом друг с другом файлы, различающиеся только расширением.
zh_cn: 请注意，编译器不包含可能成为输出文件的文件。例如，如果输入包含 <code>index.ts</code> ，则排除 <code>index.d.ts</code> 和 <code>index.js</code> 。通常，不建议让文件的扩展名彼此相邻。

source: Please note that this comment only suppresses the error reporting, and we recommend you use this comments <em>very sparingly</em>.
es: Tenga en cuenta que este comentario solo suprime el informe de errores y le recomendamos que utilice estos comentarios <em>con moderaci&oacute;n</em> .
ko: 이 설명은 오류보고 만 억제 <em>하므로이</em> 설명은 <em>매우 드물게</em> 사용하는 것이 좋습니다 .
ru: Обратите внимание, что этот комментарий только подавляет сообщения об ошибках, и мы рекомендуем вам использовать его <em>очень осторожно</em> .
zh_cn: 请注意，此注释仅禁止显示错误报告，我们建议您<em>非常谨慎地</em>使用此注释。

source: Please note that this requires a native <code>Symbol.iterator</code> or <code>Symbol.iterator</code> shim at runtime for any non-array values.
es: Tenga en cuenta que esto requiere una <code>Symbol.iterator</code> nativa de Symbol.iterator o <code>Symbol.iterator</code> en tiempo de ejecuci&oacute;n para cualquier valor que no sea de matriz.
ko: 이것은 배열이 아닌 값에 대해 런타임에 기본 <code>Symbol.iterator</code> 또는 <code>Symbol.iterator</code> shim을 필요로 합니다.
ru: Обратите внимание, что для этого требуется встроенная <code>Symbol.iterator</code> или <code>Symbol.iterator</code> во время выполнения для любых значений, не являющихся массивами.
zh_cn: 请注意，对于任何非数组值，这需要在运行时提供本机 <code>Symbol.iterator</code> 或 <code>Symbol.iterator</code> 填充程序。

source: Please note that ts-loader is not the only loader for typescript.
es: Tengan en cuenta que el ts-loader no es el único cargador para la escritura.
ko: 타입 스크립트를위한 유일한 로더는 ts-loader가 아닙니다.
ru: Обратите внимание,что ts-loader не единственный загрузчик для typcript.
zh_cn: 请注意,ts-loader并不是typecript的唯一加载器。

source: Please notice that <code>"paths"</code> are resolved relative to <code>"baseUrl"</code>. When setting <code>"baseUrl"</code> to another value than <code>"."</code>, i.e. the directory of <code>tsconfig.json</code>, the mappings must be changed accordingly. Say, you set <code>"baseUrl": "./src"</code> in the above example, then jquery should be mapped to <code>"../node_modules/jquery/dist/jquery"</code>.
es: Tenga en cuenta que las <code>"paths"</code> se resuelven en relaci&oacute;n con <code>"baseUrl"</code> . Cuando se establece <code>"baseUrl"</code> en un valor diferente a <code>"."</code> , es decir, el directorio de <code>tsconfig.json</code> , las asignaciones deben cambiarse en consecuencia. Digamos que establece <code>"baseUrl": "./src"</code> en el ejemplo anterior, luego jquery debe asignarse a <code>"../node_modules/jquery/dist/jquery"</code> .
ko: 것을 통지하십시오 <code>"paths"</code> 를 기준으로 해결된다 <code>"baseUrl"</code> . 설정하는 경우 <code>"baseUrl"</code> 아닌 다른 값으로 <code>"."</code> 즉, <code>tsconfig.json</code> 디렉토리와 같이 매핑을 적절히 변경해야합니다. 말, 당신은 설정 <code>"baseUrl": "./src"</code> , 다음 JQuery와 매핑해야 위의 예에서 <code>"../node_modules/jquery/dist/jquery"</code> .
ru: Обратите внимание, что <code>"paths"</code> разрешаются относительно <code>"baseUrl"</code> . При установке для <code>"baseUrl"</code> значения, отличного от <code>"."</code> , т.е. каталог <code>tsconfig.json</code> , сопоставления должны быть соответственно изменены. Скажем, вы установили <code>"baseUrl": "./src"</code> в приведенном выше примере, тогда jquery должен быть сопоставлен с <code>"../node_modules/jquery/dist/jquery"</code> .
zh_cn: 请注意， <code>"paths"</code> 相对于 <code>"baseUrl"</code> 已解析。将 <code>"baseUrl"</code> 设置为 <code>"."</code> 以外的值时。，即 <code>tsconfig.json</code> 的目录，必须相应地更改映射。假设您在上面的示例中设置了 <code>"baseUrl": "./src"</code> ，那么jquery应该映射到 <code>"../node_modules/jquery/dist/jquery"</code> 。

source: Polymorphic <code>this</code> types
es: Polim&oacute;rfico <code>this</code> tipo
ko: <code>this</code> 유형의 다형성
ru: Полиморфные <code>this</code> типы
zh_cn: 多态 <code>this</code> 类型

source: Polymorphic this types
es: Los polimórficos de este tipo
ko: 이 유형의 다형성
ru: Полиморфный этот тип
zh_cn: 多态这种类型

source: Possible values are:
es: Los posibles valores son:
ko: 가능한 값은 다음과 같습니다.
ru: Возможные значения:
zh_cn: 可能的数值是:

source: Postfix equals on a property type in an object literal type doesn&rsquo;t specify an optional property:
es: El sufijo es igual a un tipo de propiedad en un tipo de objeto literal no especifica una propiedad opcional:
ko: Postfix는 객체 리터럴 유형의 속성 유형과 같으며 선택적 속성을 지정하지 않습니다.
ru: Postfix equals для типа свойства в типе литерала объекта не указывает необязательное свойство:
zh_cn: Postfix等于对象文字类型中的属性类型，但未指定可选属性：

source: Predefined conditional types
es: Tipos condicionales predefinidos
ko: 미리 정의 된 조건 유형
ru: Предопределенные условные типы
zh_cn: 预定义的条件类型
