Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/typescript/typescript.*.003.xlf
Languages: es, ko, ru, zh_cn

source: Tagged templates are a form of invocation introduced in ECMAScript 2015. Like call expressions, generic functions may be used in a tagged template and TypeScript will infer the type arguments utilized.
ru: Шаблоны с метками-это форма вызова,введенная в ECMAScript 2015.Как и выражения вызова,общие функции могут быть использованы в шаблоне с тегами,а TypeScript будет выводить аргументы типа.
zh_cn: 标签模板是ECMAScript 2015中引入的一种调用形式。像调用表达式一样,通用函数可以在标记模板中使用,TypeScript将推断出利用的类型参数。

source: Tagged union types
ru: Отмеченные типы соединений
zh_cn: 标签:工会类型

source: Take a quick second to guess what the output of the following snippet is:
ru: Угадайте на секунду,что получится из следующего фрагмента:
zh_cn: 花点时间猜猜下面这个片段的输出是什么。

source: Targeting ECMAScript 2015 and higher
ru: Целевое задание ECMAScript 2015 и выше
zh_cn: 针对ECMAScript 2015及以上版本

source: Targeting ES5 and ES3
ru: Нацеливание на ES5 и ES3
zh_cn: 针对ES5和ES3

source: Technically enums can be mixed with string and numeric members, but it&rsquo;s not clear why you would ever want to do so:
ru: Технически перечисления можно смешивать со строковыми и числовыми членами, но непонятно, зачем вам это нужно:
zh_cn: 从技术上讲，枚举可以与字符串和数字成员混合，但是尚不清楚为什么要这样做：

source: Template strings
ru: Строки шаблона
zh_cn: 模板字符串

source: Test the page by running gulp and then opening <code>dist/index.html</code> in a browser. You should see &ldquo;Hello from TypeScript&rdquo; on the page.
ru: Проверьте страницу, запустив gulp, а затем открыв <code>dist/index.html</code> в браузере. Вы должны увидеть &laquo;Привет от TypeScript&raquo; на странице.
zh_cn: 通过运行gulp，然后在浏览器中打开 <code>dist/index.html</code> 来测试页面。您应该在页面上看到&ldquo;来自TypeScript的Hello&rdquo;。

source: Test the resulting app
ru: Протестируйте полученное приложение
zh_cn: 测试所产生的应用程序

source: Thanks to work done by <a href="https://github.com/tinganho">@tinganho</a>, TypeScript 2.5 implements a new ECMAScript feature that allows users to omit the variable in <code>catch</code> clauses. For example, when using <code>JSON.parse</code> you may need to wrap calls to the function with a <code>try</code>/<code>catch</code>, but you may not end up using the <code>SyntaxError</code> that gets thrown when input is erroneous.
ru: Благодаря работе, проделанной <a href="https://github.com/tinganho">@tinganho</a> , TypeScript 2.5 реализует новую функцию ECMAScript, которая позволяет пользователям опускать переменную в предложениях <code>catch</code> . Например, при использовании <code>JSON.parse</code> вам может потребоваться обернуть вызовы функции с помощью <code>try</code> / <code>catch</code> , но вы не можете в конечном итоге использовать <code>SyntaxError</code> , который генерируется при ошибочном вводе.
zh_cn: 由于<a href="https://github.com/tinganho">@tinganho</a>所做的工作，TypeScript 2.5实现了新的ECMAScript功能，该功能允许用户在 <code>catch</code> 子句中省略变量。例如，当使用 <code>JSON.parse</code> 时,您可能需要使用 <code>try</code> / <code>catch</code> 来包装对该函数的调用，但是您可能最终不会使用输入错误时抛出的 <code>SyntaxError</code> 。

source: That <code>@types/</code> prefix means that we also want to get the declaration files for React and React-DOM. Usually when you import a path like <code>"react"</code>, it will look inside of the <code>react</code> package itself; however, not all packages include declaration files, so TypeScript also looks in the <code>@types/react</code> package as well. You&rsquo;ll see that we won&rsquo;t even have to think about this later on.
ru: Этот префикс <code>@types/</code> означает, что мы также хотим получить файлы объявлений для React и React-DOM. Обычно, когда вы импортируете такой путь, как <code>"react"</code> , он будет заглядывать внутрь самого <code>react</code> пакета; однако не все пакеты включают файлы объявлений, поэтому TypeScript также просматривает пакет <code>@types/react</code> . Вы увидите, что позже нам даже не придется об этом думать.
zh_cn: 这 <code>@types/</code> 前缀手段，我们也希望得到反应，并作出反应-DOM的声明文件。通常，当您导入 <code>"react"</code> 类的路径时，它会在 <code>react</code> 包本身内部查找；但是，并非所有软件包都包含声明文件，因此TypeScript也会在 <code>@types/react</code> 软件包中查找。您会看到我们以后甚至不必考虑这一点。

source: That is, in the example:
ru: То есть,в примере:
zh_cn: 就是说,在例子中。

source: That last example isn&rsquo;t actually type-safe.
ru: Последний пример на самом деле небезопасен по типу.
zh_cn: 最后一个示例实际上不是类型安全的。

source: That might result in dividing <code>undefined</code>, which is why in <code>strictNullChecks</code>, the following is an error.
ru: Это может привести к разделению <code>undefined</code> , поэтому в <code>strictNullChecks</code> следующая ошибка.
zh_cn: 这可能会导致对 <code>undefined</code> 进行划分，这就是为什么在 <code>strictNullChecks</code> 中，以下是错误。

source: That was <code>tsconfig.json</code> automatic inclusion. That does not embed module resolution as discussed above. If the compiler identified a file as a target of a module import, it will be included in the compilation regardless if it was excluded in the previous steps.
ru: Это было автоматическое включение <code>tsconfig.json</code> . Это не включает в себя разрешение модуля, как обсуждалось выше. Если компилятор определил файл как цель импорта модуля, он будет включен в компиляцию независимо от того, был ли он исключен на предыдущих шагах.
zh_cn: 那是 <code>tsconfig.json</code> 自动包含。如上所述，这没有嵌入模块分辨率。如果编译器将文件标识为模块导入的目标，则该文件将包括在编译中，无论先前步骤中是否将其排除在外。

source: That&rsquo;s because <code>S</code> isn&rsquo;t assignable to <code>{ done: false, value: number }</code> nor <code>{ done: true, value: number }</code>. Why? Because the <code>done</code> property in <code>S</code> isn&rsquo;t specific enough - it&rsquo;s <code>boolean</code> whereas each constituent of <code>T</code> has a <code>done</code> property that&rsquo;s specifically <code>true</code> or <code>false</code>. That&rsquo;s what we meant by each constituent type being checked in isolation: TypeScript doesn&rsquo;t just union each property together and see if <code>S</code> is assignable to that. If it did, some bad code could get through like the following:
ru: Это потому, что <code>S</code> нельзя присвоить ни <code>{ done: false, value: number }</code> ни <code>{ done: true, value: number }</code> . Зачем? Поскольку свойство <code>done</code> в <code>S</code> недостаточно специфично - оно является <code>boolean</code> тогда как каждая составляющая <code>T</code> имеет свойство <code>done</code> , которое определенно <code>true</code> или <code>false</code> . Это то, что мы имели в виду, говоря, что каждый компонентный тип проверяется изолированно: TypeScript не просто объединяет каждое свойство вместе и проверяет, можно ли ему присвоить <code>S</code> . Если бы это было так, некоторый плохой код мог бы пройти, как показано ниже:
zh_cn: 这是因为 <code>S</code> 不可分配给 <code>{ done: false, value: number }</code> 或 <code>{ done: true, value: number }</code> 。为什么？因为 <code>S</code> 中的 <code>done</code> 属性不够具体-它是 <code>boolean</code> 而 <code>T</code> 的每个组成部分都有一个 <code>done</code> 属性，即 <code>true</code> 或 <code>false</code> 。这就是孤立检查每个组成类型的含义：TypeScript不仅将每个属性都结合在一起，并查看 <code>S</code> 是否可分配给该属性。如果确实如此，则可能会遇到一些错误代码，如下所示：

source: That&rsquo;s exactly what TypeScript 3.7 introduces. At the &ldquo;top level&rdquo; of a type alias, TypeScript will defer resolving type arguments to permit these patterns.
ru: Это именно то, что представляет собой TypeScript 3.7. На &laquo;верхнем уровне&raquo; псевдонима типа TypeScript откладывает разрешение аргументов типа, чтобы разрешить эти шаблоны.
zh_cn: 这正是TypeScript 3.7引入的。在类型别名的&ldquo;顶层&rdquo;，TypeScript将推迟解析类型参数以允许使用这些模式。

source: That&rsquo;s not to say that block-scoped variable can never be declared with a function-scoped variable. The block-scoped variable just needs to be declared within a distinctly different block.
ru: Это не означает, что переменная с областью видимости блока никогда не может быть объявлена ​​с переменной с областью действия функции. Переменная с блочной областью видимости просто должна быть объявлена ​​в совершенно другом блоке.
zh_cn: 这并不是说块作用域变量永远不能用函数作用域变量声明。只需在明显不同的块中声明块范围的变量。

source: The &ldquo;short-circuiting&rdquo; behavior that optional chains have is limited property accesses, calls, element accesses - it doesn&rsquo;t expand any further out from these expressions. In other words,
ru: Поведение опциональных цепочек &laquo;короткого замыкания&raquo; - это ограниченный доступ к свойствам, вызовы, доступ к элементам - он не расширяется дальше от этих выражений. Другими словами,
zh_cn: 可选链具有的&ldquo;短路&rdquo;行为是有限的属性访问，调用，元素访问-它不会从这些表达式进一步扩展。换一种说法，

source: The 1.1 compiler is typically around 4x faster than any previous release. See <a href="http://blogs.msdn.com/b/typescript/archive/2014/10/06/announcing-typescript-1-1-ctp.aspx">this blog post for some impressive charts.</a>
ru: Компилятор 1.1 обычно примерно в 4 раза быстрее, чем любой предыдущий выпуск. См. <a href="http://blogs.msdn.com/b/typescript/archive/2014/10/06/announcing-typescript-1-1-ctp.aspx">Этот пост в блоге, чтобы</a> увидеть впечатляющие графики.
zh_cn: 1.1编译器通常比任何以前的版本快4倍左右。有关<a href="http://blogs.msdn.com/b/typescript/archive/2014/10/06/announcing-typescript-1-1-ctp.aspx">一些令人印象深刻的图表，</a>请参见此博客文章。

source: The <a href="https://github.com/tc39/proposal-async-iteration">Async Iteration proposal</a> introduces &ldquo;Async Generators&rdquo;, which are async functions that also can be used to yield partial computation results. Async Generators can also delegate calls via <code>yield*</code> to either an iterable or async iterable:
ru: Предложение <a href="https://github.com/tc39/proposal-async-iteration">Async Iteration</a> представляет &laquo;Асинхронные генераторы&raquo;, которые представляют собой асинхронные функции, которые также можно использовать для получения частичных результатов вычислений. Асинхронные генераторы также могут делегировать вызовы через <code>yield*</code> на итерацию или асинхронную итерацию:
zh_cn: 的<a href="https://github.com/tc39/proposal-async-iteration">异步迭代建议</a>引入了&ldquo;异步发电机&rdquo;，其是也可以使用，以产生局部计算结果异步函数。异步生成器还可以通过 <code>yield*</code> 将调用委派给可迭代或异步可迭代：

source: The <a href="library-structures">Library Structures</a> guide helps you understand common library formats and how to write a correct declaration file for each format. If you&rsquo;re editing an existing file, you probably don&rsquo;t need to read this section. Authors of new declaration files must read this section to properly understand how the format of the library influences the writing of the declaration file.
ru: Руководство по <a href="library-structures">библиотечным структурам</a> поможет вам понять распространенные форматы библиотек и понять, как написать правильный файл декларации для каждого формата. Если вы редактируете существующий файл, вам, вероятно, не нужно читать этот раздел. Авторы новых файлов деклараций должны прочитать этот раздел, чтобы правильно понять, как формат библиотеки влияет на запись файла декларации.
zh_cn: 该<a href="library-structures">图书馆结构</a>指南帮助您了解公共库的格式以及如何编写每种格式正确的声明文件。如果要编辑现有文件，则可能不需要阅读本节。新声明文件的作者必须阅读本节，以正确理解库的格式如何影响声明文件的编写。

source: The <a href="publishing">Publishing</a> section explains how to publish your declaration files to an npm package, and shows how to manage your dependent packages.
ru: В разделе &laquo; <a href="publishing">Публикация</a> &raquo; объясняется, как публиковать файлы объявлений в пакет npm, и показано, как управлять зависимыми пакетами.
zh_cn: &ldquo; <a href="publishing">发布&rdquo;</a>部分说明了如何将声明文件发布到npm包中，并显示了如何管理依赖包。

source: The <code>"compilerOptions"</code> property can be omitted, in which case the compiler&rsquo;s defaults are used. See our full list of supported <a href="compiler-options">Compiler Options</a>.
ru: Свойство <code>"compilerOptions"</code> можно не указывать, и в этом случае используются значения по умолчанию компилятора. См. Полный список поддерживаемых <a href="compiler-options">параметров компилятора</a> .
zh_cn: 所述 <code>"compilerOptions"</code> 属性可以省略，在这种情况下，使用编译器的默认值。请参阅我们支持的<a href="compiler-options">编译器选项的</a>完整列表。

source: The <code>"files"</code> property takes a list of relative or absolute file paths. The <code>"include"</code> and <code>"exclude"</code> properties take a list of glob-like file patterns. The supported glob wildcards are:
ru: Свойство <code>"files"</code> принимает список относительных или абсолютных путей к файлам. В <code>"include"</code> и <code>"exclude"</code> свойства взять список Glob-подобных шаблонов файлов. Поддерживаемые подстановочные знаки глобуса:
zh_cn: 在 <code>"files"</code> 属性接受相对或绝对文件路径的列表。该 <code>"include"</code> 和 <code>"exclude"</code> 的场所供水珠般的文件模式的列表。支持的全局通配符为：

source: The <code>&amp;&amp;</code> operator adds <code>null</code> and/or <code>undefined</code> to the type of the right operand depending on which are present in the type of the left operand, and the <code>||</code> operator removes both <code>null</code> and <code>undefined</code> from the type of the left operand in the resulting union type.
ru: Оператор <code>&amp;&amp;</code> добавляет к типу правого операнда значение <code>null</code> и / или <code>undefined</code> в зависимости от того, какие из них присутствуют в типе левого операнда, и <code>||</code> Оператор удаляет как <code>null</code> ,так и <code>undefined</code> из типа левого операнда в результирующем типе объединения.
zh_cn: 的 <code>&amp;&amp;</code> 操作者增加了 <code>null</code> 和/或 <code>undefined</code> ，以在其上存在于左操作数的类型，和右操作数取决于类型 <code>||</code> 运算符从结果联合类型的左侧操作数的类型中删除 <code>null</code> 和 <code>undefined</code> 。

source: The <code>--allowUmdGlobalAccess</code> flag
ru: <code>--allowUmdGlobalAccess</code> флаг
zh_cn: 该 <code>--allowUmdGlobalAccess</code> 标志

source: The <code>--declaration</code> flag in TypeScript allows us to generate <code>.d.ts</code> files (declaration files) from TypeScript source files (i.e. <code>.ts</code> and <code>.tsx</code> files). These <code>.d.ts</code> files are important for a couple of reasons.
ru: <code>--declaration</code> флаг в машинописном позволяет генерировать <code>.d.ts</code> файлы (декларирование файлов) из исходных файлов машинопись (т.е. <code>.ts</code> и <code>.tsx</code> файлы). Эти файлы <code>.d.ts</code> важны по нескольким причинам.
zh_cn: TypeScript中的 <code>--declaration</code> 标志允许我们从TypeScript源文件（即 <code>.ts</code> 和 <code>.tsx</code> 文件）生成 <code>.d.ts</code> 文件（声明文件）。这些 <code>.d.ts</code> 文件很重要，原因有两个。

source: The <code>--noResolve</code> compiler options instructs the compiler not to &ldquo;add&rdquo; any files to the compilation that were not passed on the command line. It will still try to resolve the module to files, but if the file is not specified, it will not be included.
ru: В <code>--noResolve</code> опции компилятора инструктирует компилятор не &laquo;добавить&raquo; файлы к компиляции , которые не были переданы в командной строке. Он по-прежнему будет пытаться преобразовать модуль в файлы, но если файл не указан, он не будет включен.
zh_cn: 该 <code>--noResolve</code> 编译器选项指示编译器没有任何文件&ldquo;添加&rdquo;到没有在命令行上通过了编译。它将仍然尝试将模块解析为文件，但是如果未指定文件，则不会包含该文件。

source: The <code>--preserveSymlinks</code> compiler flag
ru: В <code>--preserveSymlinks</code> флаг компилятора
zh_cn: 该 <code>--preserveSymlinks</code> 编译器标志

source: The <code>--project</code> (<code>-p</code>) flag can now take any file path
ru: <code>--project</code> ( <code>-p</code> сейчас) флаг может взять любой путь к файлу
zh_cn: 该 <code>--project</code> （ <code>-p</code> ）标志现在可以采取任何文件路径

source: The <code>--project</code> command line option originally could only take paths to a folder containing a <code>tsconfig.json</code>. Given the different scenarios for build configurations, it made sense to allow <code>--project</code> to point to any other compatible JSON file. For instance, a user might want to target ES2015 with CommonJS modules for Node 5, but ES5 with AMD modules for the browser. With this new work, users can easily manage two separate build targets using <code>tsc</code> alone without having to perform hacky workarounds like placing <code>tsconfig.json</code> files in separate directories.
ru: <code>--project</code> параметр командной строки изначально может принимать только путь к папке , содержащей <code>tsconfig.json</code> . Учитывая различные сценарии конфигураций сборки, имеет смысл разрешить <code>--project</code> указывать на любой другой совместимый файл JSON. Например, пользователь может захотеть настроить таргетинг на ES2015 с модулями CommonJS для Node 5, а на ES5 с модулями AMD для браузера. Благодаря этой новой работе пользователи могут легко управлять двумя отдельными целями сборки, используя только <code>tsc</code> , без необходимости выполнять хитрые обходные пути, такие как размещение файлов <code>tsconfig.json</code> в отдельных каталогах.
zh_cn: 的 <code>--project</code> 命令行选项原本只能采取路径包含的文件夹 <code>tsconfig.json</code> 。给定构建配置的不同方案，允许 <code>--project</code> 指向任何其他兼容的JSON文件是有意义的。例如，用户可能希望将ES2015的目标与Node5的CommonJS模块一起使用，而将ES5的目标与针对浏览器的AMD模块一起使用。通过这项新工作，用户可以单独使用 <code>tsc</code> 轻松管理两个单独的构建目标，而不必执行一些 <code>tsconfig.json</code> 变通办法，例如将tsconfig.json文件放置在单独的目录中。

source: The <code>--strictNullChecks</code> flag fixes this: when you declare a variable, it doesn&rsquo;t automatically include <code>null</code> or <code>undefined</code>. You can include them explicitly using a union type:
ru: В <code>--strictNullChecks</code> флаг фиксирует это: когда вы объявляете переменную, она автоматически не включают в себя <code>null</code> или <code>undefined</code> . Вы можете включить их явно, используя тип объединения:
zh_cn: 该 <code>--strictNullChecks</code> 标志修复这样的：当你声明一个变量，它不会自动包括 <code>null</code> 或 <code>undefined</code> 。您可以使用并集类型显式包括它们：

source: The <code>/// &lt;reference path="..." /&gt;</code> directive is the most common of this group. It serves as a declaration of <em>dependency</em> between files.
ru: <code>/// &lt;reference path="..." /&gt;</code> директива является наиболее распространенной из этой группы. Он служит декларацией <em>зависимости</em> между файлами.
zh_cn: 所述 <code>/// &lt;reference path="..." /&gt;</code> 指令是该组中最常见的。它用作文件之间<em>依赖</em>关系的声明。

source: The <code>??</code> operator can replace uses of <code>||</code> when trying to use a default value. For example, the following code snippet tries to fetch the volume that was last saved in <a href="https://developer.mozilla.org/en-US/docs/Web/API/Window/localStorage"><code>localStorage</code></a> (if it ever was); however, it has a bug because it uses <code>||</code>.
ru: <code>??</code> оператор может заменить использование <code>||</code> при попытке использовать значение по умолчанию. Например, следующий фрагмент кода пытается получить том, который последний раз был сохранен в <a href="https://developer.mozilla.org/en-US/docs/Web/API/Window/localStorage"> <code>localStorage</code> </a> (если он когда-либо был); однако в нем есть ошибка, потому что он использует <code>||</code> .
zh_cn: 该 <code>??</code> 运算符可以代替 <code>||</code> 的使用 尝试使用默认值时。例如，以下代码段尝试获取上次保存在<a href="https://developer.mozilla.org/en-US/docs/Web/API/Window/localStorage"> <code>localStorage</code> 中的卷</a>（如果曾经）；但是，它有一个错误，因为它使用 <code>||</code> 。。

source: The <code>@enum</code> tag allows you to create an object literal whose members are all of a specified type. Unlike most object literals in Javascript, it does not allow other members.
ru: <code>@enum</code> тег позволяет создать литерал объекта, членами которого являются все указанного типа. В отличие от большинства объектных литералов в Javascript, он не допускает других членов.
zh_cn: 该 <code>@enum</code> 标签允许你创建一个对象文字，其成员都是指定类型的。与Javascript中的大多数对象文字不同，它不允许其他成员。

source: The <code>@enumerable(false)</code> decorator here is a <a href="#decorator-factories">decorator factory</a>. When the <code>@enumerable(false)</code> decorator is called, it modifies the <code>enumerable</code> property of the property descriptor.
ru: <code>@enumerable(false)</code> декоратор здесь является <a href="#decorator-factories">декоратор завод</a> . Когда <code>@enumerable(false)</code> декоратор называется, он изменяет <code>enumerable</code> свойство дескриптора свойств.
zh_cn: 该 <code>@enumerable(false)</code> 这里的装饰是一种<a href="#decorator-factories">装饰厂</a>。当 <code>@enumerable(false)</code> 装饰被调用时，它修改 <code>enumerable</code> 的属性描述符的属性。

source: The <code>@format("Hello, %s")</code> decorator here is a <a href="#decorator-factories">decorator factory</a>. When <code>@format("Hello, %s")</code> is called, it adds a metadata entry for the property using the <code>Reflect.metadata</code> function from the <code>reflect-metadata</code> library. When <code>getFormat</code> is called, it reads the metadata value for the format.
ru: <code>@format("Hello, %s")</code> декоратор вот <a href="#decorator-factories">декоратор завод</a> . Когда <code>@format("Hello, %s")</code> , он добавляет запись метаданных для свойства с <code>Reflect.metadata</code> функции Reflect.metadata из библиотеки <code>reflect-metadata</code> . Когда <code>getFormat</code> , он считывает значение метаданных для формата.
zh_cn: 该 <code>@format("Hello, %s")</code> 装饰这里是一个<a href="#decorator-factories">装饰厂</a>。当 <code>@format("Hello, %s")</code> 被调用时，它增加了使用性质的元数据条目 <code>Reflect.metadata</code> 从功能上 <code>reflect-metadata</code> 的库。当 <code>getFormat</code> 被调用时，它读取的格式中的元数据值。

source: The <code>@required</code> decorator adds a metadata entry that marks the parameter as required. The <code>@validate</code> decorator then wraps the existing <code>greet</code> method in a function that validates the arguments before invoking the original method.
ru: <code>@required</code> декоратор добавляет метаданные запись, помечает параметр , как требуется. <code>@validate</code> декоратор затем оборачивает существующее <code>greet</code> метод в функции , которая проверяет аргументы перед вызовом оригинального метода.
zh_cn: 该 <code>@required</code> 装饰公司补充说，需要标记该参数的元数据条目。然后 <code>@validate</code> 装饰器将现有的 <code>greet</code> 方法包装在一个函数中，该函数在调用原始方法之前先验证参数。

source: The <code>ConstructorParameters&lt;T&gt;</code> type lets us extract all parameter types of a constructor function type. It produces a tuple type with all the parameter types (or the type <code>never</code> if <code>T</code> is not a function).
ru: Тип <code>ConstructorParameters&lt;T&gt;</code> позволяет нам извлекать все типы параметров из типа функции конструктора. Он создает кортеж со всеми типами параметров (или тип <code>never</code> , если <code>T</code> не является функцией).
zh_cn: 通过 <code>ConstructorParameters&lt;T&gt;</code> 类型，我们可以提取构造函数类型的所有参数类型。它会生成具有所有参数类型的元组类型（如果 <code>T</code> 不是函数，则 <code>never</code> 类型）。

source: The <code>Iterator</code> type now allows users to specify the yielded type, the returned type, and the type that <code>next</code> can accept.
ru: Тип <code>Iterator</code> теперь позволяет пользователям указывать полученный тип, возвращаемый тип и тип, который <code>next</code> может принять.
zh_cn: 现在， <code>Iterator</code> 类型允许用户指定产生的类型，返回的类型以及 <code>next</code> 可以接受的类型。

source: The <code>Omit</code> helper type
ru: Тип помощника <code>Omit</code>
zh_cn: 该 <code>Omit</code> 的辅助类型

source: The <code>ReadonlyArray</code> type describes <code>Array</code>s that can only be read from. Any variable with a reference to a <code>ReadonlyArray</code> can&rsquo;t add, remove, or replace any elements of the array.
ru: <code>ReadonlyArray</code> типа описывает <code>Array</code> S , которые могут быть прочитаны только. Любая переменная со ссылкой на <code>ReadonlyArray</code> не может добавлять, удалять или заменять какие-либо элементы массива.
zh_cn: 该 <code>ReadonlyArray</code> 类型描述 <code>Array</code> 只能被读取秒。引用 <code>ReadonlyArray</code> 的任何变量都不能添加，删除或替换数组的任何元素。
