Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/typescript/typescript.*.003.xlf
Languages: es, ko, ru, zh_cn

source: Then, given a type <code>T''</code> that is an instantiation of <code>T</code> where all <code>infer</code> type variables are replaced with the types inferred in the previous step, if <code>T''</code> is <em>definitely assignable</em> to <code>U</code>, the conditional type is resolved to <code>X</code>. The definitely assignable relation is the same as the regular assignable relation, except that type variable constraints are not considered. Intuitively, when a type is definitely assignable to another type, we know that it will be assignable for <em>all instantiations</em> of those types.
ru: Тогда, учитывая тип <code>T''</code> , который является конкретизацией <code>T</code> , где все <code>infer</code> переменных типа заменяются типами , выведенных в предыдущем шаге, если <code>T''</code> является <em>определенно назначаемым</em> для <code>U</code> , условный тип разрешен к <code>X</code> . Однозначно назначаемое отношение такое же, как и обычное присваиваемое отношение, за исключением того, что ограничения переменных типа не рассматриваются. Интуитивно понятно, что когда тип определенно может быть назначен другому типу, мы знаем, что он будет назначен для <em>всех экземпляров</em> этих типов.
zh_cn: 然后，给出一种类型， <code>T''</code> 是的一个实例 <code>T</code> 其中所有 <code>infer</code> 型变量与在先前步骤中推导出的类型的置换，如果 <code>T''</code> 是<em>绝对分配</em>到 <code>U</code> ，条件类型被解析为 <code>X</code> 。绝对可分配关系与常规可分配关系相同，只是不考虑类型变量约束。凭直觉，当一个类型肯定可分配给另一个类型时，我们知道它将为那些类型的<em>所有实例化</em>分配。

source: Then, you need to remember to give a default for optional properties on the destructured property instead of the main initializer. Remember that <code>C</code> was defined with <code>b</code> optional:
ru: Затем вам нужно не забыть указать значение по умолчанию для необязательных свойств для деструктурированного свойства вместо основного инициализатора. Помните, что <code>C</code> был определен с необязательным <code>b</code> :
zh_cn: 然后，您需要记住为非结构化属性（而不是主初始化程序）的可选属性提供默认值。请记住， <code>C</code> 是使用 <code>b</code> 可选定义的：

source: There are also some flags specific to <code>tsc -b</code>:
ru: Также есть несколько специфичных для <code>tsc -b</code> флагов :
zh_cn: 还有一些特定于 <code>tsc -b</code> 的标志：

source: There are basically three changes here, but they require you to refactor your code a bit.
ru: Здесь,по сути,есть три изменения,но они требуют немного рефакторить ваш код.
zh_cn: 这里基本上有三个变化,但它们需要你重构一下你的代码。

source: There are certain cases where TypeScript can&rsquo;t figure out what certain types should be. To be as lenient as possible, it will decide to use the type <code>any</code> in its place. While this is great for migration, using <code>any</code> means that you&rsquo;re not getting any type safety, and you won&rsquo;t get the same tooling support you&rsquo;d get elsewhere. You can tell TypeScript to flag these locations down and give an error with the <code>noImplicitAny</code> option.
ru: В некоторых случаях TypeScript не может определить, какими должны быть определенные типы. Чтобы быть максимально снисходительным, он решит использовать вместо него <code>any</code> шрифт . Хотя это отлично подходит для миграции, используя <code>any</code> средства, вы не получите никакой безопасности типов и не получите той же инструментальной поддержки, которую получили бы где-либо еще. Вы можете указать TypeScript <code>noImplicitAny</code> эти местоположения и выдать ошибку с помощью параметра noImplicitAny .
zh_cn: 在某些情况下，TypeScript无法确定应该使用哪种类型。为了尽可能宽松，它将决定使用 <code>any</code> 类型的位置。尽管这对迁移非常有用，但是使用 <code>any</code> 方式都意味着您不会获得任何类型安全性，也不会获得与其他地方相同的工具支持。您可以告诉TypeScript标记这些位置并使用 <code>noImplicitAny</code> 选项给出错误。

source: There are certain scenarios where properties can be initialized indirectly (perhaps by a helper method or dependency injection library), in which case you can use the new <em>definite assignment assertion modifiers</em> for your properties (discussed below).
ru: Существуют определенные сценарии, в которых свойства могут быть инициализированы косвенно (возможно, с помощью вспомогательного метода или библиотеки внедрения зависимостей), и в этом случае вы можете использовать новые <em>модификаторы утверждения определенного присваивания</em> для своих свойств (обсуждаемые ниже).
zh_cn: 在某些情况下，可以间接初始化属性（可能通过辅助方法或依赖项注入库），在这种情况下，可以为属性使用新的<em>确定分配断言修饰符</em>（在下面讨论）。

source: There are several kinds of dependencies your library might have. This section shows how to import them into the declaration file.
ru: Есть несколько видов зависимостей,которые может иметь ваша библиотека.В этом разделе показано,как их импортировать в файл декларации.
zh_cn: 您的库可能有几种依赖关系。本节将介绍如何将它们导入到声明文件中。

source: There are three templates available for modules, <a href="templates/module-d-ts"><code>module.d.ts</code></a>, <a href="templates/module-class-d-ts"><code>module-class.d.ts</code></a> and <a href="templates/module-function-d-ts"><code>module-function.d.ts</code></a>.
ru: Для модулей доступны три шаблона: <a href="templates/module-d-ts"> <code>module.d.ts</code> </a> , <a href="templates/module-class-d-ts"> <code>module-class.d.ts</code> </a> и <a href="templates/module-function-d-ts"> <code>module-function.d.ts</code> </a> .
zh_cn: 有三个模块可用模板：<a href="templates/module-d-ts"> <code>module.d.ts</code> </a>，<a href="templates/module-class-d-ts"> <code>module-class.d.ts</code> </a>和<a href="templates/module-function-d-ts"> <code>module-function.d.ts</code> </a>。

source: There are two main ways to get the TypeScript tools:
ru: Есть два основных способа получить инструменты TypeScript:
zh_cn: 获得TypeScript工具主要有两种方式。

source: There are two packages:
ru: Есть две упаковки:
zh_cn: 有两个套餐。

source: There are two possible module resolution strategies: <a href="#node">Node</a> and <a href="#classic">Classic</a>. You can use the <code>--moduleResolution</code> flag to specify the module resolution strategy. If not specified, the default is <a href="#classic">Classic</a> for <code>--module AMD | System | ES2015</code> or <a href="#node">Node</a> otherwise.
ru: Есть две возможные стратегии разрешения модулей: <a href="#node">узловая</a> и <a href="#classic">классическая</a> . Вы можете использовать флаг <code>--moduleResolution</code> , чтобы указать стратегию разрешения модуля. Если не указано, то по умолчанию <a href="#classic">классический</a> для <code>--module AMD | System | ES2015</code> или <a href="#node">Node в</a> противном случае.
zh_cn: 有两种可能的模块解析策略：<a href="#node">Node</a>和<a href="#classic">Classic</a>。您可以使用 <code>--moduleResolution</code> 标志来指定模块解析策略。如果未指定，则默认为 <code>--module AMD | System | ES2015</code> <a href="#classic">Classic</a>。系统| ES2015或其他<a href="#node">节点</a>。

source: There are two types of supported index signatures: string and number. It is possible to support both types of indexers, but the type returned from a numeric indexer must be a subtype of the type returned from the string indexer. This is because when indexing with a <code>number</code>, JavaScript will actually convert that to a <code>string</code> before indexing into an object. That means that indexing with <code>100</code> (a <code>number</code>) is the same thing as indexing with <code>"100"</code> (a <code>string</code>), so the two need to be consistent.
ru: Есть два типа поддерживаемых индексных подписей: строка и число. Можно поддерживать оба типа индексаторов, но тип, возвращаемый числовым индексатором, должен быть подтипом типа, возвращаемого индексатором строк. Это связано с тем, что при индексировании с помощью <code>number</code> JavaScript фактически преобразует его в <code>string</code> перед индексированием в объект. Это означает, что индексирование с помощью <code>100</code> ( <code>number</code> ) - то же самое, что индексирование с помощью <code>"100"</code> ( <code>string</code> ), поэтому они должны быть согласованными.
zh_cn: 支持两种类型的索引签名：字符串和数字。可以同时支持两种类型的索引器，但是从数字索引器返回的类型必须是从字符串索引器返回的类型的子类型。这是因为使用 <code>number</code> 编制索引时，JavaScript实际上会在将其编制为对象之前将其转换为 <code>string</code> 。这意味着使用 <code>100</code> （一个 <code>number</code> ）进行索引与使用 <code>"100"</code> （一个 <code>string</code> ）进行索引是同一回事，因此两者必须保持一致。

source: There are two ways to define a value-based element:
ru: Существует два способа определения элемента,основанного на значении:
zh_cn: 有两种方式来定义基于价值的元素。

source: There are two ways to do this. The first is to turn on <code>--strictNullChecks</code> and specify a return type:
ru: Есть два способа сделать это. Первый - включить <code>--strictNullChecks</code> и указать тип возвращаемого значения:
zh_cn: 有两种方法可以做到这一点。第一种是打开 <code>--strictNullChecks</code> 并指定返回类型：

source: There is a special subset of constant enum members that aren&rsquo;t calculated: literal enum members. A literal enum member is a constant enum member with no initialized value, or with values that are initialized to
ru: Существует специальное подмножество постоянных членов перечисления, которые не вычисляются: литеральные члены перечисления. Литеральный член перечисления - это постоянный член перечисления без инициализированного значения или со значениями, которые инициализированы как
zh_cn: 有一个未计算的常量枚举成员的特殊子集：文字枚举成员。文字枚举成员是没有初始化值或具有初始化为的值的常量枚举成员

source: There is a well defined order to how decorators applied to various declarations inside of a class are applied:
ru: Существует четко определенный порядок применения декораторами различных деклараций внутри класса:
zh_cn: 如何应用到类里面的各种声明的装饰符,有一个明确的顺序。

source: There is no template for <code>tsconfig.json</code> in most project types.
ru: В большинстве типов проектов нет шаблона для <code>tsconfig.json</code> .
zh_cn: 在大多数项目类型中， <code>tsconfig.json</code> 没有模板。

source: There&rsquo;s a specific set of functions that <code>throw</code> an error if something unexpected happened. They&rsquo;re called &ldquo;assertion&rdquo; functions. As an example, Node.js has a dedicated function for this called <code>assert</code>.
ru: Есть специальный набор функций, которые <code>throw</code> ошибку, если происходит что-то непредвиденное. Они называются функциями утверждения. Например, в Node.js для этого есть специальная функция, называемая <code>assert</code> .
zh_cn: 如果发生意外情况，有一组特定的函数会 <code>throw</code> 错误。它们被称为&ldquo;断言&rdquo;功能。例如，Node.js为此有一个专用函数，称为 <code>assert</code> 。

source: There&rsquo;s also <em>optional call</em>, which allows us to conditionally call expressions if they&rsquo;re not <code>null</code> or <code>undefined</code>.
ru: Также есть <em>необязательный вызов</em> , который позволяет нам вызывать выражения по условию, если они не <code>null</code> или <code>undefined</code> .
zh_cn: 还有一个<em>可选的调用</em>，它允许我们有条件地调用表达式，如果它们不是 <code>null</code> 或 <code>undefined</code> 。

source: There&rsquo;s no built-in up-to-date checking, so you end up always running <code>tsc</code> twice
ru: Нет встроенной проверки актуальности, поэтому вы всегда запускаете <code>tsc</code> дважды
zh_cn: 没有内置的最新检查，因此您总是总是运行两次 <code>tsc</code>

source: These <code>.tsbuildinfo</code> files can be safely deleted and don&rsquo;t have any impact on our code at runtime - they&rsquo;re purely used to make compilations faster. We can also name them anything that we want, and place them anywhere we want using the <code>--tsBuildInfoFile</code> flag.
ru: Эти файлы <code>.tsbuildinfo</code> можно безопасно удалить, и они не влияют на наш код во время выполнения - они используются исключительно для ускорения компиляции. Мы также можем назвать их как угодно и разместить их где угодно, используя флаг <code>--tsBuildInfoFile</code> .
zh_cn: 这些 <code>.tsbuildinfo</code> 文件可以安全删除，并且在运行时不会对我们的代码产生任何影响-它们纯粹是用来加快编译速度。我们还可以为它们命名所需的任何名称，并使用 <code>--tsBuildInfoFile</code> 标志将它们放置在所需的任何位置。

source: These <em><code>typeof</code> type guards</em> are recognized in two different forms: <code>typeof v === "typename"</code> and <code>typeof v !== "typename"</code>, where <code>"typename"</code> must be <code>"number"</code>, <code>"string"</code>, <code>"boolean"</code>, or <code>"symbol"</code>. While TypeScript won&rsquo;t stop you from comparing to other strings, the language won&rsquo;t recognize those expressions as type guards.
ru: Эти <em>охранники типа </em><em> <code>typeof</code> </em> распознаются в двух разных формах: <code>typeof v === "typename"</code> и <code>typeof v !== "typename"</code> , где <code>"typename"</code> должно быть <code>"number"</code> , <code>"string"</code> , <code>"boolean"</code> или <code>"symbol"</code> ." . Хотя TypeScript не остановит вас от сравнения с другими строками, язык не распознает эти выражения как охранники типа.
zh_cn: 这些<em> <code>typeof</code> 类型防护</em>有两种不同的形式： <code>typeof v === "typename"</code> 和 <code>typeof v !== "typename"</code> ，其中 <code>"typename"</code> 必须为 <code>"number"</code> ， <code>"string"</code> ， <code>"boolean"</code> 或 <code>"symbol"</code> 。虽然TypeScript不会阻止您与其他字符串进行比较，但该语言不会将这些表达式识别为类型保护。

source: These are seldom written explicitly, but they can be useful when narrowing issues and can catch bugs:
ru: Они редко пишутся явно,но могут быть полезны при сужении проблем и могут ловить ошибки:
zh_cn: 这些很少明文规定,但在缩小问题范围时很有用,可以抓住bug。

source: These assertion signatures are very similar to writing type predicate signatures:
ru: Эти сигнатуры утверждения очень похожи на сигнатуры предикатов типа письма:
zh_cn: 这些断言签名与写类型谓词签名非常相似。

source: These could be imported as
ru: Они могут быть импортированы как
zh_cn: 这些可以作为

source: These examples are ordered in approximately increasing order of complexity.
ru: Эти примеры упорядочены примерно в порядке возрастания сложности.
zh_cn: 这些例子是按复杂程度大约递增的顺序排列的。

source: These options also persist when sharing links to playground samples, allowing users to more reliably share examples without having to tell the recipient &ldquo;oh, don&rsquo;t forget to turn on the <code>noImplicitAny</code> option!&rdquo;.
ru: Эти параметры также сохраняются при обмене ссылками на образцы игровых площадок, позволяя пользователям более надежно обмениваться примерами, не <code>noImplicitAny</code> получателю: &laquo;О, не забудьте включить параметр noImplicitAny !&raquo;.
zh_cn: 在共享操场样本的链接时，这些选项也会保留，从而使用户可以更可靠地共享示例，而不必告诉接收者&ldquo;哦，别忘了打开 <code>noImplicitAny</code> 选项！&rdquo;。

source: These scoping rules can cause several types of mistakes. One problem they exacerbate is the fact that it is not an error to declare the same variable multiple times:
ru: Эти правила поиска могут привести к нескольким типам ошибок.Одна из проблем,которую они усугубляют,заключается в том,что многократное объявление одной и той же переменной не является ошибкой:
zh_cn: 这些作用域规则可能会导致几种类型的错误。它们加剧的一个问题是,多次声明同一个变量并不是一个错误。

source: They also serve as a method to order the output when using <code>--out</code> or <code>--outFile</code>. Files are emitted to the output file location in the same order as the input after preprocessing pass.
ru: Они также служат методом упорядочивания вывода при использовании <code>--out</code> или <code>--outFile</code> . Файлы отправляются в расположение выходного файла в том же порядке, что и входные, после этапа предварительной обработки.
zh_cn: 当使用 <code>--out</code> 或 <code>--outFile</code> 时，它们还用作排序输出的方法。预处理通过后，文件以与输入相同的顺序发射到输出文件位置。

source: They also support replacing the <code>exports</code> object with a custom single object. Default exports are meant to act as a replacement for this behavior; however, the two are incompatible. TypeScript supports <code>export =</code> to model the traditional CommonJS and AMD workflow.
ru: Они также поддерживают замену объекта <code>exports</code> отдельным настраиваемым объектом. Экспорт по умолчанию призван заменить это поведение; однако они несовместимы. TypeScript поддерживает <code>export =</code> для моделирования традиционного рабочего процесса CommonJS и AMD.
zh_cn: 它们还支持用自定义单个对象替换 <code>exports</code> 对象。默认导出旨在替代此行为；但是，两者是不兼容的。TypeScript支持 <code>export =</code> 来建模传统的CommonJS和AMD工作流程。

source: They are like <code>let</code> declarations but, as their name implies, their value cannot be changed once they are bound. In other words, they have the same scoping rules as <code>let</code>, but you can&rsquo;t re-assign to them.
ru: Они похожи на объявления <code>let</code> , но, как следует из их названия, их значение не может быть изменено после связывания. Другими словами, у них те же правила области действия, что и у <code>let</code> , но вы не можете переназначить их.
zh_cn: 它们就像 <code>let</code> 声明，但是，顾名思义，绑定后就无法更改其值。换句话说，它们具有与 <code>let</code> 相同的作用域规则，但是您不能将它们重新分配。

source: They will rarely have:
ru: У них это будет редко:
zh_cn: 他们很少会有。

source: Things to look out for
ru: Вещи,на которые стоит обратить внимание
zh_cn: 需要注意的事项

source: This <code>package.json</code> tells TypeScript to check whether the current version of TypeScript is running. If it&rsquo;s 3.1 or later, it figures out the path you&rsquo;ve imported relative to the package, and reads from the package&rsquo;s <code>ts3.1</code> folder. That&rsquo;s what that <code>{ "*": ["ts3.1/*"] }</code> means - if you&rsquo;re familiar with path mapping today, it works exactly like that.
ru: Этот <code>package.json</code> сообщает TypeScript, что нужно проверить, запущена ли текущая версия TypeScript. Если это 3.1 или новее, он определяет путь, который вы импортировали относительно пакета, и считывает его из папки <code>ts3.1</code> пакета . Вот что означает <code>{ "*": ["ts3.1/*"] }</code> - если вы сегодня знакомы с отображением путей, оно работает именно так.
zh_cn: 这个 <code>package.json</code> 告诉TypeScript检查当前版本的TypeScript是否正在运行。如果是3.1或更高版本，它将找出您相对于软件包导入的路径，并从软件包的 <code>ts3.1</code> 文件夹中读取。这就是 <code>{ "*": ["ts3.1/*"] }</code> 含义-如果您今天熟悉路径映射，它的工作原理完全一样。

source: This <code>tsconfig.json</code> file will <em>only</em> include <code>./node_modules/@types/node</code>, <code>./node_modules/@types/lodash</code> and <code>./node_modules/@types/express</code>. Other packages under <code>node_modules/@types/*</code> will not be included.
ru: Этот файл <code>tsconfig.json</code> будет включать <em>только </em> <code>./node_modules/@types/node</code> , <code>./node_modules/@types/lodash</code> и <code>./node_modules/@types/express</code> . Другие пакеты в <code>node_modules/@types/*</code> не будут включены.
zh_cn: 这 <code>tsconfig.json</code> 文件将<em>只</em>包括 <code>./node_modules/@types/node</code> ， <code>./node_modules/@types/lodash</code> 和 <code>./node_modules/@types/express</code> 。 <code>node_modules/@types/*</code> 下的其他软件包将不包括在内。

source: This adds the <code>copy-html</code> task and adds it as a dependency of <code>default</code>. That means any time <code>default</code> is run, <code>copy-html</code> has to run first. We&rsquo;ve also changed <code>default</code> to call Browserify with the tsify plugin instead of gulp-typescript. Conveniently, they both allow us to pass the same options object to the TypeScript compiler.
ru: Это добавляет задачу <code>copy-html</code> и добавляет ее как зависимость по <code>default</code> . Это означает, что при каждом запуске по <code>default</code> сначала должен запускаться <code>copy-html</code> . Мы также изменили <code>default</code> по умолчанию для вызова Browserify с помощью плагина tsify вместо gulp-typescript. Удобно, что они оба позволяют нам передавать один и тот же объект параметров компилятору TypeScript.
zh_cn: 这将添加 <code>copy-html</code> 任务，并将其添加为 <code>default</code> 的依赖项。这意味着在运行 <code>default</code> 任何时间，必须先运行 <code>copy-html</code> 。我们还更改了 <code>default</code> 以使用tsify插件而不是gulp-typescript调用Browserify。方便地，它们都允许我们将相同的options对象传递给TypeScript编译器。

source: This also applies to numeric and string literals.
ru: Это также относится к числовым и строковым литералам.
zh_cn: 这也适用于数字和字符串文字。

source: This also works in JSDoc comments to refer to types from other modules in <code>.js</code>:
ru: Это также работает в комментариях JSDoc для ссылки на типы из других модулей в <code>.js</code> :
zh_cn: 这也可以在JSDoc注释中使用，以引用 <code>.js</code> 中其他模块的类型：

source: This also works with classes:
ru: Это также работает с классами:
zh_cn: 这也适用于班级。

source: This asserts the variable <code>bar</code> to have the type <code>foo</code>. Since TypeScript also uses angle brackets for type assertions, combining it with JSX&rsquo;s syntax would introduce certain parsing difficulties. As a result, TypeScript disallows angle bracket type assertions in <code>.tsx</code> files.
ru: Это утверждает, что переменная <code>bar</code> имеет тип <code>foo</code> . Поскольку TypeScript также использует угловые скобки для утверждений типа, объединение их с синтаксисом JSX вызовет определенные трудности при синтаксическом анализе. В результате TypeScript запрещает утверждения типа угловых скобок в файлах <code>.tsx</code> .
zh_cn: 这断言变量 <code>bar</code> 的类型为 <code>foo</code> 。由于TypeScript还对类型声明使用尖括号，因此将其与JSX的语法结合使用会带来一定的解析困难。结果，TypeScript禁止在 <code>.tsx</code> 文件中使用尖括号类型声明。

source: This can be used to pipe output between commands as well.
ru: Это также может быть использовано для вывода труб между командами.
zh_cn: 这也可以用于命令之间的管道输出。

source: This can cause quite a bit of fallout for existing code that use inheritance. First of all, <code>set</code> accessors from base classes won&rsquo;t get triggered - they&rsquo;ll be completely overwritten.
ru: Это может вызвать серьезные неудобства для существующего кода, использующего наследование. Во-первых, не будут срабатывать аксессоры <code>set</code> из базовых классов - они будут полностью перезаписаны.
zh_cn: 对于使用继承的现有代码，这可能会导致很多后果。首先，基类的 <code>set</code> 访问器不会被触发-它们将被完全覆盖。

source: This can even be used to enable <code>enum</code>-like patterns in plain JavaScript code if you choose not to use TypeScript&rsquo;s <code>enum</code> construct.
ru: Это можно даже использовать для включения шаблонов, подобных <code>enum</code> в простом коде JavaScript, если вы решите не использовать конструкцию <code>enum</code> TypeScript .
zh_cn: 如果您选择不使用TypeScript的 <code>enum</code> 构造，它甚至可以用于在纯JavaScript代码中启用 <code>enum</code> 的模式。

source: This can go beyond basic functions with <code>@param</code> tags too, where the following example:
ru: Это может выходить за рамки базовых функций с тегами <code>@param</code> , где следующий пример:
zh_cn: 这也可以超越使用 <code>@param</code> 标记的基本功能，例如以下示例：

source: This change entails a break in the behavior of extending built-in classes like <code>Error</code>, <code>Array</code>, <code>Map</code>, etc.. Please see the <a href="https://github.com/Microsoft/TypeScript-wiki/blob/master/Breaking-changes.html#extending-built-ins-like-error-array-and-map-may-no-longer-work">extending built-ins breaking change documentation</a> for more details.
ru: Это изменение влечет за собой нарушение поведения при расширении встроенных классов, таких как <code>Error</code> , <code>Array</code> , <code>Map</code> и т. Д. Для получения более подробной информации см. <a href="https://github.com/Microsoft/TypeScript-wiki/blob/master/Breaking-changes.html#extending-built-ins-like-error-array-and-map-may-no-longer-work">Документацию</a> по расширенным встроенным изменениям .
zh_cn: 此更改需要中断扩展内置类（如 <code>Error</code> ， <code>Array</code> ， <code>Map</code> 等）的行为。有关更多详细信息，请参见<a href="https://github.com/Microsoft/TypeScript-wiki/blob/master/Breaking-changes.html#extending-built-ins-like-error-array-and-map-may-no-longer-work">扩展内置突破性更改文档</a>。
