Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/typescript/typescript.*.003.xlf
Languages: es, ko, ru, zh_cn

source: This means that code like the following that was trying to represent JSON&hellip;
ru: Это означает, что такой код, как следующий, пытался представить JSON&hellip;
zh_cn: 这意味着类似以下代码的代码试图表示JSON&hellip;

source: This means that union types and <code>instanceof</code> properly distinguish between structurally identical classes.
ru: Это означает, что типы union и <code>instanceof</code> правильно различают структурно идентичные классы.
zh_cn: 这意味着并集类型和 <code>instanceof</code> 可以正确区分结构相同的类。

source: This means that you can conditionally and lazily import other modules and libraries. For example, here&rsquo;s an <code>async</code> function that only imports a utility library when it&rsquo;s needed:
ru: Это означает, что вы можете условно и лениво импортировать другие модули и библиотеки. Например, вот <code>async</code> функция, которая импортирует служебную библиотеку только тогда, когда это необходимо:
zh_cn: 这意味着您可以有条件并懒惰地导入其他模块和库。例如，这是一个 <code>async</code> 函数，仅在需要时才导入实用程序库：

source: This mode adds flexibility for mixing and matching the way 3rd party libraries, where globals that libraries declare can always be consumed, even from within modules.
ru: Этот режим добавляет гибкость для смешивания и соответствия способу сторонних библиотек,где глобулы,которые объявляются библиотеками,всегда могут быть потреблены,даже изнутри модулей.
zh_cn: 这种模式为第三方库的混搭方式增加了灵活性,库声明的globals可以一直被消耗,甚至从模块内消耗。

source: This model of namespace merging is a helpful starting place, but we also need to understand what happens with non-exported members. Non-exported members are only visible in the original (un-merged) namespace. This means that after merging, merged members that came from other declarations cannot see non-exported members.
ru: Эта модель слияния пространств имен является полезным отправным пунктом,но нам также необходимо понять,что происходит с неэкспортируемыми участниками.Неэкспортируемые члены видны только в оригинальном (неуправляемом)пространстве имён.Это означает,что после слияния объединенные члены,которые пришли из других деклараций,не могут видеть неэкспортированных членов.
zh_cn: 这种命名空间合并的模式是一个有益的起点,但我们还需要了解非导出成员的情况。非导出成员只有在原始(未合并的)命名空间中才可见。这意味着合并后,来自其他声明的合并成员不能看到非导出成员。

source: This new behavior only kicks in when at most one type in the union has multiple overloads, and at most one type in the union has a generic signature. That means methods on <code>number[] | string[]</code> like <code>map</code> (which is generic) still won&rsquo;t be callable.
ru: Это новое поведение срабатывает только тогда, когда не более одного типа в объединении имеет несколько перегрузок и не более одного типа в объединении имеет общую сигнатуру. Это означает методы по <code>number[] | string[]</code> как <code>map</code> (который является универсальным) по-прежнему не может быть вызван.
zh_cn: 仅当联合体中最多一种类型具有多个重载并且联合体中最多一种类型具有通用签名时，才会启动此新行为。这意味着对 <code>number[] | string[]</code> 方法[] | 像 <code>map</code> 一样的string []（通用）仍然无法调用。

source: This new relaxation also lets us recursively reference type aliases in tuples as well. The following code which used to error is now valid TypeScript code.
ru: Эта новая релаксация также позволяет рекурсивно ссылаться на псевдонимы типа в кортежах.Следующий код,который раньше был ошибочным,теперь является действительным кодом TypeScript.
zh_cn: 这个新的放松也让我们在tuple中递归引用类型别名。下面的代码以前会出错,现在是有效的TypeScript代码。

source: This odd-looking pattern is actually pretty common. The <code>i</code> in the parameter list actually shadows the <code>i</code> declared in the <code>for</code> loop, but since we named them the same, we didn&rsquo;t have to modify the loop body too much.
ru: Этот странный узор на самом деле довольно распространен. <code>i</code> в списке параметров фактически тенями <code>i</code> объявил в <code>for</code> цикла, но так как мы назвали их так же, мы не должны изменить тело цикла слишком много.
zh_cn: 这种看起来很奇怪的模式实际上很常见。在 <code>i</code> 在参数列表实际上阴影的 <code>i</code> 在宣布 <code>for</code> 循环，但是因为我们将它们命名为相同的，我们没有太多修改循环体。

source: This often opens up very elegant ways of writing code; however, there was a problem for classes that wanted to extend from <code>BasicCalculator</code>. Imagine a user wanted to start writing a <code>ScientificCalculator</code>:
ru: Это часто открывает очень элегантные способы написания кода; однако возникла проблема с классами, которые хотели <code>BasicCalculator</code> от BasicCalculator . Представьте, что пользователь хочет написать <code>ScientificCalculator</code> :
zh_cn: 这通常会开辟非常优雅的代码编写方式。但是，要从 <code>BasicCalculator</code> 扩展的类存在问题。想象一个用户想要开始编写 <code>ScientificCalculator</code> ：

source: This only apply to types with an <em>explicit</em> string index signature. It is still an error to access unknown properties on a type using <code>.</code> notation.
ru: Это применимо только к типам с <em>явной</em> подписью индекса строки. По-прежнему возникает ошибка доступа к неизвестным свойствам типа с использованием <code>.</code> обозначение.
zh_cn: 这仅适用于具有<em>显式</em>字符串索引签名的类型。使用来访问类型的未知属性仍然是一个错误 <code>.</code> 符号。

source: This option is similar to <code>UseFsEvents</code> except on failing to create watch using <code>fs.watch</code>, the fallback watching happens through dynamic polling queues (as explained in <code>DynamicPriorityPolling</code>)
ru: Этот параметр аналогичен <code>UseFsEvents</code> , за исключением того, что при <code>fs.watch</code> создания часов с помощью fs.watch отслеживание отката происходит через динамические очереди опроса (как описано в <code>DynamicPriorityPolling</code> )
zh_cn: 此选项与 <code>UseFsEvents</code> 相似，除了在无法使用 <code>fs.watch</code> 创建监视时，后备监视通过动态轮询队列进行（如 <code>DynamicPriorityPolling</code> 中所述）。

source: This option watches parent directory of the file with <code>fs.watch</code> (using file system events) thus being low on CPU but can compromise accuracy.
ru: Эта опция наблюдает за родительским каталогом файла с помощью <code>fs.watch</code> (используя события файловой системы), что снижает нагрузку на ЦП, но может снизить точность.
zh_cn: 此选项使用 <code>fs.watch</code> （使用文件系统事件）监视文件的父目录，因此CPU占用率较低，但会影响准确性。

source: This post outlines the various ways to organize your code using namespaces (previously &ldquo;internal modules&rdquo;) in TypeScript. As we alluded in our note about terminology, &ldquo;internal modules&rdquo; are now referred to as &ldquo;namespaces&rdquo;. Additionally, anywhere the <code>module</code> keyword was used when declaring an internal module, the <code>namespace</code> keyword can and should be used instead. This avoids confusing new users by overloading them with similarly named terms.
ru: В этом посте описаны различные способы организации кода с использованием пространств имен (ранее &laquo;внутренних модулей&raquo;) в TypeScript. Как мы упоминали в нашем примечании о терминологии, &laquo;внутренние модули&raquo; теперь называются &laquo;пространствами имен&raquo;. Кроме того, в любом месте , где <code>module</code> ключевого слова используется при объявлении внутреннего модуля, то <code>namespace</code> ключевых слова могут и должны быть использованы вместо. Это позволяет избежать запутывания новых пользователей, перегружая их терминами с похожими названиями.
zh_cn: 这篇文章概述了使用TypeScript中的名称空间（以前称为&ldquo;内部模块&rdquo;）组织代码的各种方法。正如我们在有关术语的注释中提到的那样，&ldquo;内部模块&rdquo;现在称为&ldquo;命名空间&rdquo;。此外，在声明内部模块时，在使用 <code>module</code> 关键字的任何地方，可以而且应该改用 <code>namespace</code> 关键字。这样可以避免给新用户添加名称相似的术语，从而使他们感到困惑。

source: This post outlines the various ways to organize your code using namespaces and modules in TypeScript. We&rsquo;ll also go over some advanced topics of how to use namespaces and modules, and address some common pitfalls when using them in TypeScript.
ru: В этом посте описаны различные способы организации кода с использованием пространств имен и модулей в TypeScript. Мы также рассмотрим некоторые дополнительные темы о том, как использовать пространства имен и модули, и рассмотрим некоторые распространенные ошибки при их использовании в TypeScript.
zh_cn: 这篇文章概述了使用TypeScript中的名称空间和模块来组织代码的各种方法。我们还将介绍一些有关如何使用名称空间和模块的高级主题，并解决在TypeScript中使用它们时的一些常见陷阱。

source: This presents a simple entry point; e.g. in the TypeScript repo we simply run <code>tsc -b src</code> to build all endpoints because we list all the subprojects in <code>src/tsconfig.json</code>
ru: Это простая точка входа; например, в <code>tsc -b src</code> TypeScript мы просто запускаем tsc -b src для создания всех конечных точек, потому что мы перечисляем все подпроекты в <code>src/tsconfig.json</code>
zh_cn: 这提供了一个简单的入口点。例如，在TypeScript存储库中，我们只需运行 <code>tsc -b src</code> 即可构建所有端点，因为我们在 <code>src/tsconfig.json</code> 中列出了所有子项目

source: This presents a very good opportunity for destructuring in the consuming code:
ru: Это дает очень хорошую возможность для разрушения в потребляющем коде:
zh_cn: 这就为消费代码中的解构提供了一个非常好的机会。

source: This quick start guide will teach you how to build TypeScript with <a href="http://gulpjs.com">gulp</a> and then add <a href="http://browserify.org">Browserify</a>, <a href="http://lisperator.net/uglifyjs/">uglify</a>, or <a href="https://github.com/substack/watchify">Watchify</a> to the gulp pipeline. This guide also shows how to add <a href="https://babeljs.io/">Babel</a> functionality using <a href="https://github.com/babel/babelify">Babelify</a>.
ru: Это краткое руководство научит вас , как построить машинопись с <a href="http://gulpjs.com">глотком</a> , а затем добавить <a href="http://browserify.org">Browserify</a> , <a href="http://lisperator.net/uglifyjs/">уродовать</a> , или <a href="https://github.com/substack/watchify">Watchify</a> к трубопроводу глотка. В этом руководстве также показано, как добавить функциональность <a href="https://babeljs.io/">Babel</a> с помощью <a href="https://github.com/babel/babelify">Babelify</a> .
zh_cn: 本快速入门指南将教你如何打造打字稿<a href="http://gulpjs.com">一饮而尽</a>，然后添加<a href="http://browserify.org">Browserify</a>，<a href="http://lisperator.net/uglifyjs/">丑化</a>或<a href="https://github.com/substack/watchify">Watchify</a>到吞气管道。本指南还显示了如何使用<a href="https://github.com/babel/babelify">Babelify</a>添加<a href="https://babeljs.io/">Babel</a>功能。

source: This resolution strategy attempts to mimic the <a href="https://nodejs.org/">Node.js</a> module resolution mechanism at runtime. The full Node.js resolution algorithm is outlined in <a href="https://nodejs.org/api/modules.html#modules_all_together">Node.js module documentation</a>.
ru: Эта стратегия разрешения пытается имитировать механизм разрешения модуля <a href="https://nodejs.org/">Node.js</a> во время выполнения. Полный алгоритм разрешения Node.js описан в <a href="https://nodejs.org/api/modules.html#modules_all_together">документации модуля Node.js</a> .
zh_cn: 此解决方案策略尝试在运行时模仿<a href="https://nodejs.org/">Node.js</a>模块的解决方案机制。<a href="https://nodejs.org/api/modules.html#modules_all_together">Node.js模块文档中</a>概述了完整的Node.js解析算法。

source: This results in the generated JS
ru: Это приводит к тому,что генерируется JS
zh_cn: 这导致生成的JS

source: This section assumes some basic knowledge about modules. Please see the <a href="modules">Modules</a> documentation for more information.
ru: Этот раздел предполагает некоторые базовые знания о модулях. Дополнительную информацию см. В документации по <a href="modules">модулям</a> .
zh_cn: 本节假定您具有有关模块的一些基本知识。请参阅<a href="modules">模块</a>文档以获取更多信息。

source: This should not be confused with the idea that the values they refer to are <em>immutable</em>.
ru: Это не следует путать с идеей, что значения, к которым они относятся, <em>неизменны</em> .
zh_cn: 这不应与它们所引用的值是<em>不可变</em>的想法混淆。

source: This simple example shows how the names used during importing and exporting get translated into the module loading code.
ru: Этот простой пример показывает,как имена,используемые при импорте и экспорте,транслируются в код загрузки модуля.
zh_cn: 这个简单的例子展示了在导入和导出过程中使用的名称如何被翻译成模块加载代码。

source: This tells the compiler for any module import that matches the pattern <code>"*"</code> (i.e. all values), to look in two locations:
ru: Это сообщает компилятору для любого импорта модуля, который соответствует шаблону <code>"*"</code> (т.е. всем значениям), искать в двух местах:
zh_cn: 这告诉编译器任何与模式 <code>"*"</code> （即所有值）匹配的模块导入都在两个位置查找：

source: This treats the classes as interfaces, and only mixes the types behind Disposable and Activatable into the SmartObject type rather than the implementation. This means that we&rsquo;ll have to provide the implementation in class. Except, that&rsquo;s exactly what we want to avoid by using mixins.
ru: При этом классы рассматриваются как интерфейсы и смешиваются только типы Disposable и Activatable с типом SmartObject, а не с реализацией. Это означает, что нам придется предоставить реализацию в классе. Только вот этого мы и хотим избежать, используя миксины.
zh_cn: 这将类视为接口，并且仅将Disposable和Activatable后面的类型混合到SmartObject类型中，而不是实现中。这意味着我们必须在类中提供实现。除此之外，这正是我们希望通过使用mixins避免的。

source: This used to be TypeScript&rsquo;s default resolution strategy. Nowadays, this strategy is mainly present for backward compatibility.
ru: Раньше это была стратегия разрешения TypeScript по умолчанию. В настоящее время эта стратегия используется в основном для обеспечения обратной совместимости.
zh_cn: 这曾经是TypeScript的默认解析策略。如今，这种策略主要用于向后兼容。

source: This utility does not return a transformed type. Instead, it serves as a marker for a contextual <code>this</code> type. Note that the <code>--noImplicitThis</code> flag must be enabled to use this utility.
ru: Эта утилита не возвращает преобразованный тип. Вместо этого он служит маркером для контекстного типа <code>this</code> . Обратите внимание, что для использования этой утилиты необходимо включить флаг <code>--noImplicitThis</code> .
zh_cn: 该实用程序不返回转换后的类型。相反，它用作上下文 <code>this</code> 类型的标记。请注意，必须启用 <code>--noImplicitThis</code> 标志才能使用此实用程序。

source: This utility is useful for representing assignment expressions that will fail at runtime (i.e. when attempting to reassign properties of a <a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Object/freeze">frozen object</a>).
ru: Эта утилита полезна для представления выражений присваивания, которые не работают во время выполнения (т. Е. При попытке переназначить свойства <a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Object/freeze">замороженного объекта</a> ).
zh_cn: 该实用程序对于表示在运行时将失败的赋值表达式很有用（即，当尝试重新分配<a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Object/freeze">冻结对象的</a>属性时）。

source: This version of the loop will actually perform the summation correctly because the inner loop&rsquo;s <code>i</code> shadows <code>i</code> from the outer loop.
ru: Эта версия цикла фактически выполнит суммирование правильно, потому что <code>i</code> внутреннего цикла затеняет <code>i</code> от внешнего цикла.
zh_cn: 这种循环的版本实际上将正确执行的总和，因为内循环是 <code>i</code> 倩影 <code>i</code> 从外循环。

source: This works because arrow functions use the outer <code>this</code>, so you can always pass them to something that expects <code>this: void</code>. The downside is that one arrow function is created per object of type Handler. Methods, on the other hand, are only created once and attached to Handler&rsquo;s prototype. They are shared between all objects of type Handler.
ru: Это работает, потому что стрелочные функции используют внешнее <code>this</code> , поэтому вы всегда можете передать их тому, что ожидает <code>this: void</code> . Обратной стороной является то, что для каждого объекта типа Handler создается одна стрелочная функция. С другой стороны, методы создаются только один раз и прикрепляются к прототипу Handler. Они общие для всех объектов типа Handler.
zh_cn: 之所以可行，是因为箭头函数使用外部 <code>this</code> ，因此您始终可以将它们传递给期望 <code>this: void</code> 。缺点是为Handler类型的每个对象创建一个箭头功能。另一方面，方法仅创建一次并附加到Handler的原型。它们在Handler类型的所有对象之间共享。

source: This works fine in TypeScript too, but the compiler doesn&rsquo;t know about <code>Observable.prototype.map</code>. You can use module augmentation to tell the compiler about it:
ru: Это отлично работает и в TypeScript, но компилятор не знает о <code>Observable.prototype.map</code> . Вы можете использовать расширение модуля, чтобы сообщить об этом компилятору:
zh_cn: 这在TypeScript中也可以正常工作，但是编译器不了解 <code>Observable.prototype.map</code> 。您可以使用模块扩充来告知编译器：

source: This works well enough, but we might imagine that <code>SomeType</code> and <code>SomeVar</code> were very closely related such that you&rsquo;d like them to have the same name. We can use combining to present these two different objects (the value and the type) under the same name <code>Bar</code>:
ru: Это работает достаточно хорошо, но мы можем представить, что <code>SomeType</code> и <code>SomeVar</code> очень тесно связаны, так что вы хотите, чтобы у них было одно и то же имя. Мы можем использовать комбинирование, чтобы представить эти два разных объекта (значение и тип) под одним и тем же именем <code>Bar</code> :
zh_cn: 这足够好，但是我们可以想象 <code>SomeType</code> 和 <code>SomeVar</code> 紧密相关，因此您希望它们具有相同的名称。我们可以使用合并以相同的名称 <code>Bar</code> 呈现这两个不同的对象（值和类型）：

source: Though not recommended practice, some modules set up some global state that can be used by other modules. These modules may not have any exports, or the consumer is not interested in any of their exports. To import these modules, use:
ru: Хотя это и не рекомендуется,некоторые модули устанавливают некоторое глобальное состояние,которое может быть использовано другими модулями.Эти модули могут не иметь никакого экспорта,или потребитель не заинтересован в любом из их экспорта.Для импорта этих модулей,используйте:
zh_cn: 虽然不建议采用这种做法,但有些模块设置了一些全局状态,可以被其他模块使用。这些模块可能没有任何出口,或者消费者对它们的任何出口都不感兴趣。要导入这些模块,请使用。

source: Thus, the following calls are equivalent:
ru: Таким образом,следующие вызовы эквивалентны:
zh_cn: 因此,以下调用是等价的。

source: To allow differentiation between returned values and yielded values, TypeScript 3.6 converts the <code>IteratorResult</code> type to a discriminated union type:
ru: Чтобы обеспечить различие между возвращаемыми значениями и полученными значениями, TypeScript 3.6 преобразует тип <code>IteratorResult</code> в тип размеченного объединения:
zh_cn: 为了区分返回的值和产生的值，TypeScript 3.6将 <code>IteratorResult</code> 类型转换为可区分的联合类型：

source: To begin, just as in JavaScript, TypeScript functions can be created both as a named function or as an anonymous function. This allows you to choose the most appropriate approach for your application, whether you&rsquo;re building a list of functions in an API or a one-off function to hand off to another function.
ru: Для начала, как и в JavaScript, функции TypeScript могут быть созданы как как именованная функция, так и как анонимная функция. Это позволяет вам выбрать наиболее подходящий подход для вашего приложения, независимо от того, создаете ли вы список функций в API или одноразовую функцию для передачи другой функции.
zh_cn: 首先，就像在JavaScript中一样，可以将TypeScript函数创建为命名函数或匿名函数。无论您要在API中构建函数列表还是将一次性函数移交给另一个函数，这都可以为您的应用程序选择最合适的方法。

source: To check if <code>x</code> is assignable to <code>y</code>, we first look at the parameter list. Each parameter in <code>x</code> must have a corresponding parameter in <code>y</code> with a compatible type. Note that the names of the parameters are not considered, only their types. In this case, every parameter of <code>x</code> has a corresponding compatible parameter in <code>y</code>, so the assignment is allowed.
ru: Чтобы проверить, можно ли присвоить <code>x</code> переменной <code>y</code> , мы сначала смотрим на список параметров. Каждый параметр в <code>x</code> должен иметь соответствующий параметр в <code>y</code> совместимого типа. Обратите внимание, что не рассматриваются имена параметров, только их типы. В этом случае каждый параметр <code>x</code> имеет соответствующий совместимый параметр в <code>y</code> , поэтому присвоение разрешено.
zh_cn: 为了检查 <code>x</code> 是否可分配给 <code>y</code> ，我们首先查看参数列表。 <code>x</code> 中的每个参数必须在 <code>y</code> 中具有一个兼容类型的对应参数。请注意，不考虑参数名称，仅考虑其类型。在这种情况下， <code>x</code> 的每个参数在 <code>y</code> 中都有一个对应的兼容参数，因此允许分配。

source: To check whether <code>y</code> can be assigned to <code>x</code>, the compiler checks each property of <code>x</code> to find a corresponding compatible property in <code>y</code>. In this case, <code>y</code> must have a member called <code>name</code> that is a string. It does, so the assignment is allowed.
ru: Чтобы проверить, может ли <code>y</code> быть присвоено <code>x</code> , компилятор проверяет каждое свойство <code>x</code> , чтобы найти соответствующее совместимое свойство в <code>y</code> . В этом случае <code>y</code> должен иметь член с именем <code>name</code> , который является строкой. Это так, поэтому задание разрешено.
zh_cn: 为了检查是否可以将 <code>y</code> 分配给 <code>x</code> ，编译器检查 <code>x</code> 的每个属性以在 <code>y</code> 中找到对应的兼容属性。在这种情况下， <code>y</code> 必须具有一个名为 <code>name</code> 的成员，该成员是一个字符串。确实如此，因此允许分配。

source: To compile, we must specify a module target on the command line. For Node.js, use <code>--module commonjs</code>; for require.js, use <code>--module amd</code>. For example:
ru: Для компиляции мы должны указать целевой модуль в командной строке. Для Node.js используйте <code>--module commonjs</code> ; для require.js используйте <code>--module amd</code> . Например:
zh_cn: 要进行编译，我们必须在命令行上指定模块目标。对于Node.js，请使用 <code>--module commonjs</code> ; 对于require.js，请使用 <code>--module amd</code> 。例如：

source: To correctly represent the types that can be passed in to a generator from calls to <code>next()</code>, TypeScript 3.6 also infers certain uses of <code>yield</code> within the body of a generator function.
ru: Чтобы правильно представить типы, которые могут быть переданы генератору из вызовов <code>next()</code> , TypeScript 3.6 также предполагает определенные варианты использования <code>yield</code> в теле функции генератора.
zh_cn: 为了正确表示可以通过调用 <code>next()</code> 传递给生成器的类型，TypeScript 3.6还可以推断生成器函数体内对 <code>yield</code> 的某些使用。

source: To define a type guard, we simply need to define a function whose return type is a <em>type predicate</em>:
ru: Чтобы определить защиту типа, нам просто нужно определить функцию, возвращаемый тип которой является <em>предикатом типа</em> :
zh_cn: 要定义类型保护，我们只需要定义一个返回类型为<em>类型谓词</em>的函数：

source: To describe a function type with an interface, we give the interface a call signature. This is like a function declaration with only the parameter list and return type given. Each parameter in the parameter list requires both name and type.
ru: Для описания типа функции с интерфейсом мы присваиваем интерфейсу сигнатуру вызова.Это похоже на объявление функции с указанием только списка параметров и типа возврата.Каждый параметр в списке параметров требует и названия,и типа.
zh_cn: 为了用一个接口来描述一个函数类型,我们给这个接口一个调用签名。这就像一个函数声明,只给出参数列表和返回类型。参数列表中的每个参数都需要同时给出名称和类型。

source: To describe the shape of libraries not written in TypeScript, we need to declare the API that the library exposes.
ru: Для описания формы библиотек,не написанных в TypeScript,нам необходимо объявить API,которое библиотека раскрывает.
zh_cn: 为了描述不是用TypeScript编写的库的形状,我们需要声明库所暴露的API。

source: To describe the shape of libraries not written in TypeScript, we need to declare the API that the library exposes. Because most JavaScript libraries expose only a few top-level objects, namespaces are a good way to represent them.
ru: Для описания формы библиотек,не написанных в TypeScript,нам необходимо объявить API,которое библиотека раскрывает.Поскольку большинство библиотек JavaScript выставляют только несколько объектов верхнего уровня,пространства имен являются хорошим способом их представления.
zh_cn: 为了描述不是用TypeScript编写的库的形态,我们需要声明库所暴露的API。因为大多数JavaScript库只暴露了一些顶层对象,所以命名空间是一种很好的表示方式。
