Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/typescript/typescript.*.003.xlf
Languages: es, ko, ru, zh_cn

source: Note that we currently only support discriminant properties of string literal types. We intend to later add support for boolean and numeric literal types.
es: Tenga en cuenta que actualmente sólo apoyamos las propiedades discriminantes de los tipos literales de cuerda.Tenemos la intención de añadir más adelante el soporte de tipos literales booleanos y numéricos.
ko: 현재 문자열 리터럴 유형의 판별 특성 만 지원합니다. 나중에 부울 및 숫자 리터럴 유형에 대한 지원을 추가하려고합니다.

source: Note that we didn&rsquo;t make <code>b</code> optional here because the return types of the signatures differ.
es: Tenga en cuenta que no hicimos <code>b</code> opcional aqu&iacute; porque los tipos de devoluci&oacute;n de las firmas son diferentes.
ko: 서명의 반환 유형이 다르기 때문에 여기서 <code>b</code> 를 선택적으로 만들지 않았습니다 .

source: Note that when a tuple type is inferred from a sequence of parameters and later expanded into a parameter list, as is the case for <code>U</code>, the original parameter names are used in the expansion (however, the names have no semantic meaning and are not otherwise observable).
es: Tenga en cuenta que cuando un tipo de tupla se infiere de una secuencia de par&aacute;metros y luego se expande en una lista de par&aacute;metros, como es el caso de <code>U</code> , los nombres de los par&aacute;metros originales se usan en la expansi&oacute;n (sin embargo, los nombres no tienen significado sem&aacute;ntico y no son de otra manera observable).
ko: 튜플 유형이 일련의 매개 변수에서 유추되고 나중에 <code>U</code> 의 경우와 같이 매개 변수 목록으로 확장 되면 원래 매개 변수 이름이 확장에 사용됩니다 (단, 의미는 의미가 없으며 다른 의미는 아닙니다) 주목할 만한).

source: Note that when using these flags together, TypeScript doesn&rsquo;t necessarily have to downlevel <code>.js</code> files. If you simply want TypeScript to create <code>.d.ts</code> files, you can use the <code>--emitDeclarationOnly</code> compiler option.
es: Tenga en cuenta que cuando se usan estos indicadores juntos, TypeScript no necesariamente tiene que bajar el nivel de los archivos <code>.js</code> . Si simplemente desea que TypeScript cree archivos <code>.d.ts</code> , puede usar la opci&oacute;n del compilador <code>--emitDeclarationOnly</code> .
ko: 이러한 플래그를 함께 사용하는 경우 TypeScript가 반드시 <code>.js</code> 파일 을 다운 레벨 할 필요는 없습니다 . TypeScript가 <code>.d.ts</code> 파일 을 만들려면 <code>--emitDeclarationOnly</code> 컴파일러 옵션을 사용할 수 있습니다 .

source: Note that while this example uses <a href="https://reactjs.org/docs/components-and-props.html#functional-and-class-components">function components</a>, we could also make our example a little <em>classier</em> as well.
es: Tenga en cuenta que si bien este ejemplo utiliza <a href="https://reactjs.org/docs/components-and-props.html#functional-and-class-components">componentes de funci&oacute;n</a> , tambi&eacute;n podr&iacute;amos hacer que nuestro ejemplo sea un poco <em>m&aacute;s elegante</em> .
ko: 이 예제가 사용하는 동안주의 <a href="https://reactjs.org/docs/components-and-props.html#functional-and-class-components">구성 요소를 작동</a> , 우리는 또한 우리의 예를 조금 할 수 <em>classier</em> 뿐만 아니라.

source: Note: <code>"ESNext"</code> targets latest supported
es: Nota: <code>"ESNext"</code> apunta a la &uacute;ltima compatibilidad
ko: 참고 : <code>"ESNext"</code> 는 최신 지원 대상

source: Note: <code>"ESNext"</code> targets latest supported <a href="https://github.com/tc39/proposals">ES proposed features</a>.
es: Nota: <code>"ESNext"</code> apunta a las &uacute;ltimas <a href="https://github.com/tc39/proposals">funciones propuestas de ES</a> compatibles .
ko: 참고 : <code>"ESNext"</code> 는 지원되는 최신 <a href="https://github.com/tc39/proposals">ES 제안 기능을</a> 대상으로 합니다 .

source: Note: <code>node</code> module resolution is the most-commonly used in the TypeScript community and is recommended for most projects. If you are having resolution problems with <code>import</code>s and <code>export</code>s in TypeScript, try setting <code>moduleResolution: "node"</code> to see if it fixes the issue.
ko: 참고 : <code>node</code> 모듈 확인은 TypeScript 커뮤니티에서 가장 일반적으로 사용되며 대부분의 프로젝트에 권장됩니다. TypeScript의 <code>import</code> 및 <code>export</code> 에 해결 문제가있는 경우 <code>moduleResolution: "node"</code> 를 설정 하여 문제가 해결되는지 확인하십시오.

source: Note: <code>outFile</code> cannot be used unless <code>module</code> is <code>None</code>, <code>System</code>, or <code>AMD</code>. This option <em>cannot</em> be used to bundle CommonJS or ES6 modules.
ko: 참고 : <code>module</code> 이 <code>None</code> , <code>System</code> 또는 <code>AMD</code> 가 아니면 <code>outFile</code> 을 사용할 수 없습니다 . 이 옵션 <em>은</em> CommonJS 또는 ES6 모듈을 번들하는 데 사용할 <em>수 없습니다</em> .<em></em>

source: Note: Avoid using <code>Object</code> in favor of the non-primitive <code>object</code> type as described in our <a href="declaration-files/do-s-and-don-ts#general-types">Do&rsquo;s and Don&rsquo;ts</a> section.
es: Nota: Evite usar <code>Object</code> en favor del tipo de <code>object</code> no primitivo, como se describe en nuestra secci&oacute;n <a href="declaration-files/do-s-and-don-ts#general-types">Qu&eacute; hacer y qu&eacute; no hacer</a> .
ko: 참고 : 해야 <a href="declaration-files/do-s-and-don-ts#general-types">할 일과하지 말아야</a> 할 일에 설명 된 것처럼 기본이 아닌 <code>object</code> 유형 에 유리하게 <code>Object</code> 를 사용 하지 마십시오 .

source: Note: Error messages only show up in JS codebases with <a href="tsconfig-json">a JSConfig</a> and <a href="https://www.typescriptlang.org/tsconfig#checkJs"><code>checkJs</code></a> enabled.
ko: 참고 : 오류 메시지 <a href="tsconfig-json">는 JSConfig</a> 및 <a href="https://www.typescriptlang.org/tsconfig#checkJs"> <code>checkJs</code> </a> 활성화 된 JS 코드베이스에만 표시됩니다 .

source: Note: Function Components were formerly known as Stateless Function Components (SFC). As Function Components can no longer be considered stateless in recent versions of react, the type <code>SFC</code> and its alias <code>StatelessComponent</code> were deprecated.
es: Nota: Los componentes de funci&oacute;n se conoc&iacute;an anteriormente como componentes de funci&oacute;n sin estado (SFC). Como los componentes de funci&oacute;n ya no pueden considerarse sin estado en las versiones recientes de react, el tipo <code>SFC</code> y su alias <code>StatelessComponent</code> quedaron obsoletos.
ko: 참고 : 기능 구성 요소는 이전에는 상태 비 저장 기능 구성 요소 (SFC)로 알려져 있습니다. 최신 버전의 반응에서는 함수 구성 요소를 더 이상 상태 비 저장으로 간주 할 수 없으므로 <code>SFC</code> 유형 및 별명 <code>StatelessComponent</code> 는 더 이상 사용되지 않습니다.

source: Note: If <code>--lib</code> is not specified a default list of libraries are injected. The default libraries injected are:
es: Nota: Si no se especifica <code>--lib</code> , se inyecta una lista predeterminada de bibliotecas. Las bibliotecas predeterminadas inyectadas son:
ko: 참고 : <code>--lib</code> 를 지정하지 않으면 기본 라이브러리 목록이 삽입됩니다. 주입 된 기본 라이브러리는 다음과 같습니다.

source: Note: If an attribute name is not a valid JS identifier (like a <code>data-*</code> attribute), it is not considered to be an error if it is not found in the element attributes type.
es: Nota: Si un nombre de atributo no es un identificador JS v&aacute;lido (como un atributo <code>data-*</code> ), no se considera un error si no se encuentra en el tipo de atributos del elemento.
ko: 참고 : 속성 이름이 유효한 JS 식별자 (예 : <code>data-*</code> 속성)가 아닌 경우 요소 속성 유형에서 찾을 수없는 경우 오류로 간주되지 않습니다.

source: Note: In <em>very</em> old versions of TypeScript namespaces were called &lsquo;Internal Modules&rsquo;, these pre-date JavaScript module systems.
ko: 참고 : <em>아주</em> 오래된 버전의 TypeScript 네임 스페이스에서 '내부 모듈'이라고 불 렸습니다. 이러한 이전 자바 스크립트 모듈 시스템입니다.

source: Note: Most changes do not require you to install a new version of the VS TypeScript plugin.
es: Nota:La mayoría de los cambios no requieren que instale una nueva versión del plugin VS TypeScript.
ko: 참고 : 대부분의 변경으로 인해 새 버전의 VS TypeScript 플러그인을 설치할 필요가 없습니다.

source: Note: Previous syntax defining internal modules are still supported.
es: Nota:La sintaxis anterior que define los módulos internos sigue siendo compatible.
ko: 참고 : 내부 모듈을 정의하는 이전 구문은 계속 지원됩니다.

source: Note: The <code>Exclude</code> type is a proper implementation of the <code>Diff</code> type suggested <a href="https://github.com/Microsoft/TypeScript/issues/12215#issuecomment-307871458">here</a>. We&rsquo;ve used the name <code>Exclude</code> to avoid breaking existing code that defines a <code>Diff</code>, plus we feel that name better conveys the semantics of the type.
es: Nota: El tipo <code>Exclude</code> es una implementaci&oacute;n adecuada del tipo <code>Diff</code> sugerido <a href="https://github.com/Microsoft/TypeScript/issues/12215#issuecomment-307871458">aqu&iacute;</a> . Hemos utilizado el nombre <code>Exclude</code> para evitar romper el c&oacute;digo existente que define un <code>Diff</code> , adem&aacute;s creemos que el nombre transmite mejor la sem&aacute;ntica del tipo.
ko: 참고 : <code>Exclude</code> 유형은 <a href="https://github.com/Microsoft/TypeScript/issues/12215#issuecomment-307871458">여기에</a> 제안 된 <code>Diff</code> 유형 의 올바른 구현입니다 . <code>Exclude</code> 라는 이름을 사용하여 <code>Diff</code> 를 정의하는 기존 코드가 깨지지 않도록 하고 해당 이름이 형식의 의미를보다 잘 전달한다고 생각합니다.

source: Note: The <code>Exclude</code> type is a proper implementation of the <code>Diff</code> type suggested <a href="https://github.com/Microsoft/TypeScript/issues/12215#issuecomment-307871458">here</a>. We&rsquo;ve used the name <code>Exclude</code> to avoid breaking existing code that defines a <code>Diff</code>, plus we feel that name better conveys the semantics of the type. We did not include the <code>Omit&lt;T, K&gt;</code> type because it is trivially written as <code>Pick&lt;T, Exclude&lt;keyof T, K&gt;&gt;</code>.
es: Nota: El tipo <code>Exclude</code> es una implementaci&oacute;n adecuada del tipo <code>Diff</code> sugerido <a href="https://github.com/Microsoft/TypeScript/issues/12215#issuecomment-307871458">aqu&iacute;</a> . Hemos utilizado el nombre <code>Exclude</code> para evitar romper el c&oacute;digo existente que define un <code>Diff</code> , adem&aacute;s creemos que el nombre transmite mejor la sem&aacute;ntica del tipo. No incluimos el tipo <code>Omit&lt;T, K&gt;</code> porque est&aacute; escrito trivialmente como <code>Pick&lt;T, Exclude&lt;keyof T, K&gt;&gt;</code> .
ko: 참고 : <code>Exclude</code> 유형은 <a href="https://github.com/Microsoft/TypeScript/issues/12215#issuecomment-307871458">여기에</a> 제안 된 <code>Diff</code> 유형 의 올바른 구현입니다. . <code>Exclude</code> 라는 이름을 사용하여 <code>Diff</code> 를 정의하는 기존 코드가 깨지지 않도록 하고 해당 이름이 형식의 의미를보다 잘 전달한다고 생각합니다. <code>Omit&lt;T, K&gt;</code> 유형은 <code>Pick&lt;T, Exclude&lt;keyof T, K&gt;&gt;</code> 포함하지 않았습니다 .

source: Note: The new behavior is added under a flag to avoid unwarranted breaks to existing code bases. <strong>We highly recommend applying it both to new and existing projects.</strong> For existing projects, namespace imports (<code>import * as express from "express"; express();</code>) will need to be converted to default imports (<code>import express from "express"; express();</code>).
es: Nota: El nuevo comportamiento se agrega bajo una bandera para evitar interrupciones injustificadas en las bases de c&oacute;digo existentes. <strong>Recomendamos encarecidamente aplicarlo tanto a proyectos nuevos como existentes. </strong>Para los proyectos existentes, las importaciones de espacio de nombres ( <code>import * as express from "express"; express();</code> ) deber&aacute;n convertirse en importaciones predeterminadas ( <code>import express from "express"; express();</code> ).
ko: 참고 : 기존 코드베이스에 대한 불필요한 중단을 피하기 위해 플래그 아래에 새로운 동작이 추가되었습니다. <strong>새로운 프로젝트와 기존 프로젝트 모두에 적용하는 것이 좋습니다. </strong>기존 프로젝트의 경우 네임 스페이스 가져 오기 ( <code>import * as express from "express"; express();</code> )를 기본 가져 <code>import express from "express"; express();</code> 로 변환해야합니다 ( import express from "express"; express (); ).

source: Note: This change brings a new emit helper, <code>__makeTemplateObject</code>; if you are using <code>--importHelpers</code> with <a href="https://github.com/Microsoft/tslib"><code>tslib</code></a>, an updated to version 1.8 or later.
es: Nota: Este cambio trae un nuevo asistente de <code>__makeTemplateObject</code> , __makeTemplateObject ; si est&aacute; utilizando <code>--importHelpers</code> con <a href="https://github.com/Microsoft/tslib"> <code>tslib</code> </a> , una actualizaci&oacute;n a la versi&oacute;n 1.8 o posterior.
ko: 참고 :이 변경으로 인해 새로운 방출 도우미 <code>__makeTemplateObject</code> 가 제공됩니다. . <a href="https://github.com/Microsoft/tslib"> <code>tslib</code> </a> 와 함께 <code>--importHelpers</code> 를 사용하는 경우 버전 1.8 이상으로 업데이트되었습니다.

source: Note: This type only works correctly if <code>--strictFunctionTypes</code> is enabled. See <a href="https://github.com/microsoft/TypeScript/issues/32964">#32964</a>.
es: Nota: Este tipo solo funciona correctamente si <code>--strictFunctionTypes</code> est&aacute; habilitado. Ver <a href="https://github.com/microsoft/TypeScript/issues/32964"># 32964</a> .
ko: 참고 :이 유형 은 <code>--strictFunctionTypes</code> 가 활성화 된 경우에만 올바르게 작동합니다 . <a href="https://github.com/microsoft/TypeScript/issues/32964"># 32964를</a> 참조하십시오 .

source: Note: You can also specify a catch-all string indexer on <code>JSX.IntrinsicElements</code> as follows:
es: Nota: Tambi&eacute;n puede especificar un indexador de cadenas catch-all en <code>JSX.IntrinsicElements</code> de la siguiente manera:
ko: 참고 : <code>JSX.IntrinsicElements</code> 에서 다음과 같이 범용 문자열 인덱서를 지정할 수도 있습니다.

source: Note: You&rsquo;ll need to configure your project to use the NuGet packages. Please see <a href="https://github.com/Microsoft/TypeScript/wiki/Configuring-MSBuild-projects-to-use-NuGet">Configuring MSBuild projects to use NuGet</a> for more information.
es: Nota: Deber&aacute; configurar su proyecto para usar los paquetes NuGet. Consulte <a href="https://github.com/Microsoft/TypeScript/wiki/Configuring-MSBuild-projects-to-use-NuGet">Configuraci&oacute;n de proyectos de MSBuild para usar NuGet</a> para obtener m&aacute;s informaci&oacute;n.
ko: 참고 : NuGet 패키지를 사용하도록 프로젝트를 구성해야합니다. 참조하십시오<a href="https://github.com/Microsoft/TypeScript/wiki/Configuring-MSBuild-projects-to-use-NuGet"> 구성은 MSBuild 프로젝트 NuGet을 사용하는</a> 자세한 내용은.

source: Note: first, we need to make sure our run-time has an ECMAScript-compliant <code>Promise</code> available globally. That might involve grabbing <a href="https://github.com/stefanpenner/es6-promise">a polyfill</a> for <code>Promise</code>, or relying on one that you might have in the run-time that you&rsquo;re targeting. We also need to make sure that TypeScript knows <code>Promise</code> exists by setting your <code>lib</code> flag to something like <code>"dom", "es2015"</code> or <code>"dom", "es2015.promise", "es5"</code>
es: Nota: primero, debemos asegurarnos de que nuestro tiempo de ejecuci&oacute;n tenga una <code>Promise</code> compatible con ECMAScript disponible a nivel mundial. Eso podr&iacute;a implicar tomar <a href="https://github.com/stefanpenner/es6-promise">un polyfill</a> para <code>Promise</code> o confiar en uno que pueda tener en el tiempo de ejecuci&oacute;n al que se dirige. Tambi&eacute;n debemos asegurarnos de que TypeScript sepa que <code>Promise</code> existe estableciendo su bandera <code>lib</code> en algo como <code>"dom", "es2015"</code> o <code>"dom", "es2015.promise", "es5"</code>
ko: 참고 : 먼저 런타임에 ECMAScript 호환 <code>Promise</code> 가 전 세계적으로 제공 되는지 확인해야합니다 . <code>Promise</code> 용 <a href="https://github.com/stefanpenner/es6-promise">폴리 필</a> 을 가져 오거나 대상으로 하는 런타임 에 있을 수 있는 폴리 필 에 의존 할 수 있습니다. 또한 <code>lib</code> 플래그를 <code>"dom", "es2015"</code> 와 같은 형식 으로 설정하여 TypeScript에 <code>Promise</code> 가 있음을 알도록해야합니다. 또는 <code>"dom", "es2015.promise", "es5"</code>

source: Note: if the declaration file you are searching for is not present, you can always contribute one back and help out the next developer looking for it. Please see the DefinitelyTyped <a href="http://definitelytyped.org/guides/contributing.html">contribution guidelines page</a> for details.
es: Nota: si el archivo de declaraci&oacute;n que est&aacute; buscando no est&aacute; presente, siempre puede contribuir con uno y ayudar al pr&oacute;ximo desarrollador que lo busque. Consulte la <a href="http://definitelytyped.org/guides/contributing.html">p&aacute;gina de pautas de contribuci&oacute;n</a> DefinitelyTyped para obtener m&aacute;s detalles.
ko: 참고 : 검색중인 선언 파일이 없으면 언제든지 다시 기여하고 다음 개발자가 도움을 줄 수 있습니다. 자세한 내용은 DefinitelyTyped <a href="http://definitelytyped.org/guides/contributing.html">기여 가이드 라인 페이지</a> 를 참조하십시오.

source: Notice how we dropped <code>theName</code> altogether and just use the shortened <code>readonly name: string</code> parameter on the constructor to create and initialize the <code>name</code> member. We&rsquo;ve consolidated the declarations and assignment into one location.
es: Observe c&oacute;mo eliminamos el <code>theName</code> completo y simplemente usamos el par&aacute;metro de <code>readonly name: string</code> abreviado de solo lectura en el constructor para crear e inicializar el miembro de <code>name</code> . Hemos consolidado las declaraciones y la asignaci&oacute;n en un solo lugar.
ko: 우리가 떨어 방법 공지 사항 <code>theName</code> 를 모두 그냥 단축 사용 <code>readonly name: string</code> 생성 및 초기화하는 생성자에 매개 변수를 <code>name</code> 멤버. 선언과 과제를 한 곳에 통합했습니다.

source: Notice that <code>T</code> has been propagated from <code>makeArray</code> into the resulting type&rsquo;s type parameter list. This means that genericity from <code>compose</code>&rsquo;s arguments has been preserved and our <code>makeBoxedArray</code> sample will just work!
es: Observe que <code>T</code> se ha propagado desde <code>makeArray</code> a la lista de par&aacute;metros de tipo del tipo resultante. Esto significa que genericity de <code>compose</code> argumentos &lsquo;s se ha conservado y nuestra <code>makeBoxedArray</code> muestra se acaba el trabajo!
ko: 것을 알 수 <code>T</code> 가 에서 전파 된 <code>makeArray</code> 결과 형식의 형식 매개 변수 목록에. 즉, <code>compose</code> 인수의 <code>makeBoxedArray</code> 이 유지되고 makeBoxedArray 샘플이 작동합니다!

source: Notice that <code>T</code> has the additional constraint <code>any[]</code> within the true branch of <code>Boxed&lt;T&gt;</code> and it is therefore possible to refer to the element type of the array as <code>T[number]</code>. Also, notice how the conditional type is distributed over the union type in the last example.
es: Observe que <code>T</code> tiene la restricci&oacute;n adicional <code>any[]</code> dentro de la rama verdadera de <code>Boxed&lt;T&gt;</code> y, por lo tanto, es posible referirse al tipo de elemento de la matriz como <code>T[number]</code> . Adem&aacute;s, observe c&oacute;mo se distribuye el tipo condicional sobre el tipo de uni&oacute;n en el &uacute;ltimo ejemplo.
ko: 공지 것이 <code>T</code> 는 추가적인 제약 조건이 <code>any[]</code> 의 실제 분기 내의 <code>Boxed&lt;T&gt;</code> 과 그 배열의 요소 유형 등을 참조하는 것이 가능하다 <code>T[number]</code> . 또한 마지막 예에서 조건 유형이 공용체 유형에 어떻게 분산되어 있는지 확인하십시오.

source: Notice that <code>createCardPicker</code> is a function that itself returns a function. If we tried to run the example, we would get an error instead of the expected alert box. This is because the <code>this</code> being used in the function created by <code>createCardPicker</code> will be set to <code>window</code> instead of our <code>deck</code> object. That&rsquo;s because we call <code>cardPicker()</code> on its own. A top-level non-method syntax call like this will use <code>window</code> for <code>this</code>. (Note: under strict mode, <code>this</code> will be <code>undefined</code> rather than <code>window</code>).
es: Tenga en cuenta que <code>createCardPicker</code> es una funci&oacute;n que en s&iacute; misma devuelve una funci&oacute;n. Si intent&aacute;ramos ejecutar el ejemplo, obtendr&iacute;amos un error en lugar del cuadro de alerta esperado. Esto se debe a que el <code>this</code> que se usa en la funci&oacute;n creada por <code>createCardPicker</code> se establecer&aacute; en <code>window</code> lugar de en nuestro objeto de <code>deck</code> . Eso es porque llamamos <code>cardPicker()</code> por s&iacute; solo. Una llamada de sintaxis sin m&eacute;todo de nivel superior como esta usar&aacute; <code>window</code> para <code>this</code> . (Nota: en el modo estricto, <code>this</code> ser&aacute; <code>undefined</code> en lugar de <code>window</code> ).
ko: 것을 알 수 <code>createCardPicker</code> 은 그 자체가 함수를 반환하는 함수입니다. 예제를 실행하려고하면 예상 된 경고 상자 대신 오류가 발생합니다. 때문이다 <code>this</code> 만든 함수에서 사용되는 <code>createCardPicker</code> 가 설정됩니다 <code>window</code> 대신에 우리의 <code>deck</code> 객체입니다. 자체적으로 <code>cardPicker()</code> 를 호출하기 때문 입니다. 이와 같은 최상위 비 메소드 구문 호출은 this에 <code>window</code> 를 사용 <code>this</code> . (참고 : 엄격 모드에서, <code>this</code> 됩니다 <code>undefined</code> 보다는 <code>window</code> ).

source: Notice that <code>uglify</code> itself has just one call &mdash; the calls to <code>buffer</code> and <code>sourcemaps</code> exist to make sure sourcemaps keep working. These calls give us a separate sourcemap file instead of using inline sourcemaps like before. Now you can run Gulp and check that <code>bundle.js</code> does get minified into an unreadable mess:
es: Tenga en cuenta que <code>uglify</code> en s&iacute; tiene una sola llamada: las llamadas al <code>buffer</code> y los <code>sourcemaps</code> existen para asegurarse de que los mapas de origen sigan funcionando. Estas llamadas nos dan un archivo de mapa de origen separado en lugar de usar mapas de origen en l&iacute;nea como antes. Ahora puede ejecutar Gulp y comprobar que <code>bundle.js</code> se reduce a un l&iacute;o ilegible:
ko: 공지 사항 <code>uglify</code> 자체가 하나의 호출이 - 호출하는 <code>buffer</code> 하고 <code>sourcemaps</code> 는 확인 sourcemaps이 작업을 계속하기 위해 존재한다. 이러한 호출은 이전과 같이 인라인 소스 맵을 사용하는 대신 별도의 소스 맵 파일을 제공합니다. 이제 Gulp를 실행하고 <code>bundle.js</code> 가 읽을 수없는 혼란으로 축소 되었는지 확인할 수 있습니다 .

source: Notice that Node.js jumped up a directory in steps (4) and (7).
es: Fíjense que Node.js saltó a un directorio en los pasos (4)y (7).
ko: Node.js는 단계 (4)와 (7)에서 디렉토리를 뛰어 넘었습니다.

source: Notice that TypeScript not only knows that <code>pet</code> is a <code>Fish</code> in the <code>if</code> branch; it also knows that in the <code>else</code> branch, you <em>don&rsquo;t</em> have a <code>Fish</code>, so you must have a <code>Bird</code>.
es: Tenga en cuenta que TypeScript no solo sabe que la <code>pet</code> es un <code>Fish</code> en la rama <code>if</code> ; tambi&eacute;n sabe que en la rama <code>else</code> , <em>no</em> tienes un <code>Fish</code> , por lo que debes tener un <code>Bird</code> .
ko: 타이프 라이터가 알고뿐만 아니라 통지 <code>pet</code> A는 <code>Fish</code> 의 <code>if</code> 지점; 그것은 또한에서 것을 알고 <code>else</code> 지점, 당신이 <em>하지 않는</em> 이 <code>Fish</code> 당신이 있어야합니다, 그래서 <code>Bird</code> .

source: Notice that although there were errors, the <code>greeter.js</code> file is still created. You can use TypeScript even if there are errors in your code. But in this case, TypeScript is warning that your code will likely not run as expected.
es: Tenga en cuenta que, aunque hubo errores, el archivo <code>greeter.js</code> a&uacute;n se crea. Puede usar TypeScript incluso si hay errores en su c&oacute;digo. Pero en este caso, TypeScript advierte que su c&oacute;digo probablemente no se ejecutar&aacute; como se esperaba.
ko: 오류가 있었지만 <code>greeter.js</code> 는 파일이 계속 생성됩니다. 코드에 오류가 있어도 TypeScript를 사용할 수 있습니다. 그러나이 경우 TypeScript는 코드가 예상대로 실행되지 않을 것이라고 경고합니다.
