Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/typescript/typescript.*.003.xlf
Languages: es, ko, ru, zh_cn

source: Module identifiers allow for <code>.js</code> extension
es: Los identificadores de m&oacute;dulo permiten la extensi&oacute;n <code>.js</code>
ko: <code>.js</code> 확장자를 허용하는 모듈 식별자

source: Module imports are resolved differently based on whether the module reference is relative or non-relative.
es: Las importaciones de módulos se resuelven de forma diferente en función de si la referencia del módulo es relativa o no.
ko: 모듈 가져 오기는 모듈 참조가 상대적인지 아닌지에 따라 다르게 해결됩니다.

source: Module loaders like SystemJS wrap CommonJS modules and expose then as a <code>default</code> ES6 import. This makes it impossible to share the definition files between the SystemJS and CommonJS implementation of the module as the module shape looks different based on the loader.
es: Los cargadores de m&oacute;dulos como SystemJS envuelven los m&oacute;dulos CommonJS y los exponen como una importaci&oacute;n ES6 <code>default</code> . Esto hace que sea imposible compartir los archivos de definici&oacute;n entre la implementaci&oacute;n de SystemJS y CommonJS del m&oacute;dulo, ya que la forma del m&oacute;dulo se ve diferente seg&uacute;n el cargador.
ko: SystemJS와 같은 모듈 로더는 CommonJS 모듈을 랩핑 한 다음 <code>default</code> ES6 가져 오기 로 노출 합니다. 이는 로더에 따라 모듈 모양이 다르기 때문에 모듈의 SystemJS와 CommonJS 구현간에 정의 파일을 공유 할 수 없습니다.

source: Module resolution enhancements: BaseUrl, Path mapping, rootDirs and tracing
es: Mejoras en la resolución del módulo:BaseUrl,Path mapping,rootDirs y tracing
ko: 모듈 해상도 향상 : BaseUrl, 경로 매핑, rootDirs 및 추적

source: Module resolution kind is not specified, using <strong>&lsquo;NodeJs&rsquo;</strong>.
es: El tipo de resoluci&oacute;n del m&oacute;dulo no est&aacute; especificado, usando <strong>'NodeJs'</strong> .
ko: <strong>'NodeJs'를</strong> 사용하여 모듈 분석 종류를 지정하지 않았습니다 .

source: Module system
ko: 모듈 시스템

source: Module: Class
ko: 모듈 : 클래스

source: Module: Function
ko: 모듈 : 기능

source: Module: Plugin
ko: 모듈 : 플러그인

source: Modules .d.ts
ko: 모듈 .d.ts

source: Modules also have a dependency on a module loader (such as CommonJs/Require.js) or a runtime which supports ES Modules. Modules provide for better code reuse, stronger isolation and better tooling support for bundling.
ko: 모듈은 또한 모듈 로더 (예 : CommonJs / Require.js) 또는 ES 모듈을 지원하는 런타임에 대한 종속성을 갖습니다. 모듈은 더 나은 코드 재사용, 더 강력한 격리 및 번들링을위한 더 나은 도구 지원을 제공합니다.

source: Modules also have a dependency on a module loader (such as CommonJs/Require.js). For a small JS application this might not be optimal, but for larger applications, the cost comes with long term modularity and maintainability benefits. Modules provide for better code reuse, stronger isolation and better tooling support for bundling.
es: Los módulos también dependen de un cargador de módulos (como CommonJs/Require.js).Para una pequeña aplicación JS esto podría no ser óptimo,pero para aplicaciones más grandes,el costo viene con beneficios de modularidad y mantenimiento a largo plazo.Los módulos permiten una mejor reutilización del código,un aislamiento más fuerte y un mejor soporte de herramientas para la agrupación.
ko: 모듈은 또한 모듈 로더 (예 : CommonJs / Require.js)에 종속됩니다. 소규모 JS 애플리케이션의 경우 이것이 최적이 아닐 수 있지만 대규모 애플리케이션의 경우 비용은 장기적인 모듈성 및 유지 보수성 이점과 함께 제공됩니다. 모듈은 더 나은 코드 재사용, 강력한 격리 및 번들링을위한 더 나은 툴링 지원을 제공합니다.

source: Modules are declarative; the relationships between modules are specified in terms of imports and exports at the file level.
es: Los módulos son declarativos;las relaciones entre los módulos se especifican en términos de importaciones y exportaciones a nivel de archivo.
ko: 모듈은 선언적입니다. 모듈 간의 관계는 파일 레벨에서 가져 오기 및 내보내기 측면에서 지정됩니다.

source: Modules are executed within their own scope, not in the global scope; this means that variables, functions, classes, etc. declared in a module are not visible outside the module unless they are explicitly exported using one of the <a href="#export"><code>export</code> forms</a>. Conversely, to consume a variable, function, class, interface, etc. exported from a different module, it has to be imported using one of the <a href="#import"><code>import</code> forms</a>.
es: Los m&oacute;dulos se ejecutan dentro de su propio &aacute;mbito, no en el &aacute;mbito global; esto significa que las variables, funciones, clases, etc. declaradas en un m&oacute;dulo no son visibles fuera del m&oacute;dulo a menos que se exporten expl&iacute;citamente utilizando uno de los <a href="#export">formularios de </a> <code>export</code> aci&oacute;n . Por el contrario, para consumir una variable, funci&oacute;n, clase, interfaz, etc. exportada desde un m&oacute;dulo diferente, debe importarse utilizando uno de los <a href="#import">formularios de </a> <code>import</code> aci&oacute;n .
ko: 모듈은 전역 범위가 아닌 자체 범위 내에서 실행됩니다. 이는 모듈에 선언 된 변수, 함수, 클래스 등이 <a href="#export"> <code>export</code> 양식</a> 중 하나를 사용하여 명시 적으로 내 보내지 않는 한 모듈 외부에서 볼 수 없음을 의미 합니다 . 반대로, 다른 모듈에서 내 보낸 변수, 함수, 클래스, 인터페이스 등을 사용하려면 <a href="#import"> <code>import</code> 양식</a> 중 하나를 사용하여 가져와야 합니다 .

source: Modules are now emitted with a <code>"use strict";</code> prologue
es: Los m&oacute;dulos ahora se emiten con un <code>"use strict";</code> pr&oacute;logo
ko: 모듈은 이제 <code>"use strict";</code> 방출됩니다 . 프롤로그

source: Modules are parsed automatically in strict mode. The new flag is recommended for non-module code.
es: Los módulos se analizan automáticamente en modo estricto.La nueva bandera se recomienda para el código de no-módulos.
ko: 엄격 모드에서는 모듈이 자동으로 구문 분석됩니다. 비 플래그 코드에는 새로운 플래그가 권장됩니다.

source: Modules can contain both code and declarations.
ko: 모듈은 코드와 선언을 모두 포함 할 수 있습니다.

source: Modules can import types declared in other modules. But non-module global scripts cannot access types declared in modules. Enter <code>import</code> types.
es: Los m&oacute;dulos pueden importar tipos declarados en otros m&oacute;dulos. Pero los scripts globales que no son m&oacute;dulos no pueden acceder a tipos declarados en m&oacute;dulos. Ingrese <code>import</code> tipos de importaci&oacute;n .
ko: 모듈은 다른 모듈에서 선언 된 유형을 가져올 수 있습니다. 그러나 비 모듈 전역 스크립트는 모듈에 선언 된 유형에 액세스 할 수 없습니다. <code>import</code> 유형을 입력하십시오 .

source: Modules import one another using a module loader. At runtime the module loader is responsible for locating and executing all dependencies of a module before executing it. Well-known module loaders used in JavaScript are Node.js&rsquo;s loader for <a href="https://en.wikipedia.org/wiki/CommonJS">CommonJS</a> modules and the <a href="http://requirejs.org/">RequireJS</a> loader for <a href="https://github.com/amdjs/amdjs-api/blob/master/amd.html">AMD</a> modules in Web applications.
es: Los m&oacute;dulos se importan entre s&iacute; mediante un cargador de m&oacute;dulos. En tiempo de ejecuci&oacute;n, el cargador de m&oacute;dulos es responsable de localizar y ejecutar todas las dependencias de un m&oacute;dulo antes de ejecutarlo. Los cargadores de m&oacute;dulos m&aacute;s conocidos que se utilizan en JavaScript son el cargador de Node.js para m&oacute;dulos <a href="https://en.wikipedia.org/wiki/CommonJS">CommonJS</a> y el cargador <a href="http://requirejs.org/">RequireJS</a> para m&oacute;dulos <a href="https://github.com/amdjs/amdjs-api/blob/master/amd.html">AMD</a> en aplicaciones web.
ko: 모듈은 모듈 로더를 사용하여 서로 가져옵니다. 런타임시 모듈 로더는 모듈을 실행하기 전에 모듈의 모든 종속성을 찾아 실행해야합니다. JavaScript에 사용되는 잘 알려진 모듈 로더는 <a href="https://en.wikipedia.org/wiki/CommonJS">CommonJS</a> 모듈 용 Node.js의 로더 이며 웹 응용 프로그램의 <a href="https://github.com/amdjs/amdjs-api/blob/master/amd.html">AMD</a> 모듈 용 <a href="http://requirejs.org/">RequireJS</a> 로더입니다 .

source: Modules import one another using a module loader. At runtime the module loader is responsible for locating and executing all dependencies of a module before executing it. Well-known module loaders used in JavaScript are Node.js&rsquo;s loader for <a href="https://wikipedia.org/wiki/CommonJS">CommonJS</a> modules and the <a href="http://requirejs.org/">RequireJS</a> loader for <a href="https://github.com/amdjs/amdjs-api/blob/master/AMD.md">AMD</a> modules in Web applications.
ko: 모듈은 모듈 로더를 사용하여 서로를 가져옵니다. 런타임시 모듈 로더는 모듈을 실행하기 전에 모듈의 모든 종속성을 찾아서 실행합니다. JavaScript에서 사용되는 잘 알려진 모듈 로더는 <a href="https://wikipedia.org/wiki/CommonJS">CommonJS</a> 모듈 용 Node.js 로더 와 웹 애플리케이션의 <a href="https://github.com/amdjs/amdjs-api/blob/master/AMD.md">AMD</a> 모듈 용 <a href="http://requirejs.org/">RequireJS</a> 로더입니다 .

source: Modules were always parsed in strict mode as per ES6, but for non-ES6 targets this was not respected in the generated code. Starting with TypeScript 1.8, emitted modules are always in strict mode. This shouldn&rsquo;t have any visible changes in most code as TS considers most strict mode errors as errors at compile time, but it means that some things which used to silently fail at runtime in your TS code, like assigning to <code>NaN</code>, will now loudly fail. You can reference the <a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Strict_mode">MDN Article</a> on strict mode for a detailed list of the differences between strict mode and non-strict mode.
es: Los m&oacute;dulos siempre se analizaron en modo estricto seg&uacute;n ES6, pero para los destinos que no son ES6, esto no se respet&oacute; en el c&oacute;digo generado. A partir de TypeScript 1.8, los m&oacute;dulos emitidos siempre est&aacute;n en modo estricto. Esto no deber&iacute;a tener ning&uacute;n cambio visible en la mayor&iacute;a del c&oacute;digo, ya que TS considera los errores de modo m&aacute;s estrictos como errores en tiempo de compilaci&oacute;n, pero significa que algunas cosas que sol&iacute;an fallar silenciosamente en tiempo de ejecuci&oacute;n en su c&oacute;digo TS, como asignar a <code>NaN</code> , ahora lo har&aacute;n en voz alta. fallar. Puede consultar el <a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Strict_mode">art&iacute;culo de MDN</a> sobre el modo estricto para obtener una lista detallada de las diferencias entre el modo estricto y el modo no estricto.
ko: 모듈은 항상 ES6에 따라 엄격 모드로 구문 분석되었지만 ES6 이외의 대상의 경우 생성 된 코드에서이를 고려하지 않았습니다. TypeScript 1.8부터는 방출 모듈이 항상 엄격 모드입니다. TS는 컴파일 타임에 가장 엄격한 모드 오류를 오류로 간주하므로 대부분의 코드에서 눈에 띄는 변화가 없어야하지만 TS 코드에서 런타임에 자동으로 실패하는 <code>NaN</code> 할당과 같은 일부 는 이제 크게 들립니다. 불합격. 엄격 모드와 엄격하지 않은 모드의 차이점에 대한 자세한 목록은 엄격 모드 에서 <a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Strict_mode">MDN 아티클</a> 을 참조 할 수 있습니다 .

source: More Accurate Array Spread
es: Una propagación de la matriz más precisa
ko: 보다 정확한 어레이 확산

source: More details about defining MSBuild compiler options: <a href="compiler-options-in-msbuild">Setting Compiler Options in MSBuild projects</a>
es: M&aacute;s detalles sobre c&oacute;mo definir las opciones del compilador de MSBuild: <a href="compiler-options-in-msbuild">Configuraci&oacute;n de las opciones del compilador en proyectos de MSBuild</a>
ko: MSBuild 컴파일러 옵션 정의에 대한 자세한 내용 : <a href="compiler-options-in-msbuild">MSBuild 프로젝트에서 컴파일러 옵션 설정</a>

source: More details can be found at <a href="http://docs.nuget.org/Consume/Package-Manager-Dialog">Package Manager Dialog</a> and <a href="https://github.com/Microsoft/TypeScript/wiki/Nightly-drops#using-nuget-with-msbuild">using nightly builds with NuGet</a>
es: Se pueden encontrar m&aacute;s detalles en el <a href="https://github.com/Microsoft/TypeScript/wiki/Nightly-drops#using-nuget-with-msbuild">cuadro de </a><a href="http://docs.nuget.org/Consume/Package-Manager-Dialog">di&aacute;logo Administrador de paquetes</a> y el uso de compilaciones nocturnas con NuGet
ko: 자세한 내용은에서 찾을 수 있습니다 <a href="http://docs.nuget.org/Consume/Package-Manager-Dialog">패키지 관리자 대화 상자</a> 및 <a href="https://github.com/Microsoft/TypeScript/wiki/Nightly-drops#using-nuget-with-msbuild">사용하여 야간 NuGet으로 구축</a>

source: More details: <a href="https://github.com/Microsoft/TypeScriptSamples/tree/master/jspm">TypeScriptSamples/jspm</a>
es: M&aacute;s detalles: <a href="https://github.com/Microsoft/TypeScriptSamples/tree/master/jspm">TypeScriptSamples / jspm</a>
ko: 자세한 내용 : <a href="https://github.com/Microsoft/TypeScriptSamples/tree/master/jspm">TypeScriptSamples / jspm</a>

source: More details: <a href="https://github.com/TypeStrong/grunt-ts">TypeStrong/grunt-ts</a>
es: M&aacute;s detalles: <a href="https://github.com/TypeStrong/grunt-ts">TypeStrong / grunt-ts</a>
ko: 자세한 내용 : <a href="https://github.com/TypeStrong/grunt-ts">TypeStrong / grunt-ts</a>

source: More details: <a href="https://github.com/frankwallis/duo-typescript">frankwallis/duo-typescript</a>
es: M&aacute;s detalles: <a href="https://github.com/frankwallis/duo-typescript">frankwallis / duo-typescript</a>
ko: 자세한 내용 : <a href="https://github.com/frankwallis/duo-typescript">frankwallis / duo-typescript</a>

source: More details: <a href="https://github.com/ivogabe/gulp-typescript">ivogabe/gulp-typescript</a>
es: M&aacute;s detalles: <a href="https://github.com/ivogabe/gulp-typescript">ivogabe / gulp-typescript</a>
ko: 자세한 내용 : <a href="https://github.com/ivogabe/gulp-typescript">ivogabe / gulp-typescript</a>

source: More details: <a href="https://github.com/smrq/tsify">smrq/tsify</a>
es: M&aacute;s detalles: <a href="https://github.com/smrq/tsify">smrq / tsify</a>
ko: 자세한 내용 : <a href="https://github.com/smrq/tsify">smrq / tsify</a>

source: More examples
es: Más ejemplos
ko: 더 많은 예

source: More information is available at <a href="https://code.visualstudio.com/Docs/languages/typescript#_using-newer-typescript-versions">VSCode documentation</a>.
es: M&aacute;s informaci&oacute;n est&aacute; disponible en la <a href="https://code.visualstudio.com/Docs/languages/typescript#_using-newer-typescript-versions">documentaci&oacute;n de VSCode</a> .
ko: 자세한 내용은 <a href="https://code.visualstudio.com/Docs/languages/typescript#_using-newer-typescript-versions">VSCode 설명서를 참조하십시오</a> .

source: More information is available at the <a href="https://github.com/Microsoft/TypeScript-Sublime-Plugin#installation">TypeScript Plugin for Sublime Text installation documentation</a>.
es: Hay m&aacute;s informaci&oacute;n disponible en la <a href="https://github.com/Microsoft/TypeScript-Sublime-Plugin#installation">documentaci&oacute;n de instalaci&oacute;n del complemento TypeScript para Sublime Text</a> .
ko: 자세한 내용은 <a href="https://github.com/Microsoft/TypeScript-Sublime-Plugin#installation">Sublime Text 용 TypeScript 플러그인 설치 설명서를 참조하십시오</a> .

source: More more details, you can <a href="https://github.com/tc39/proposal-optional-chaining/">read up on the proposal</a> and <a href="https://github.com/microsoft/TypeScript/pull/33294">view the original pull request</a>.
es: M&aacute;s detalles, puede <a href="https://github.com/tc39/proposal-optional-chaining/">leer sobre la propuesta</a> y <a href="https://github.com/microsoft/TypeScript/pull/33294">ver la solicitud de extracci&oacute;n original</a> .
ko: 더 자세한 내용은, 당신은 할 수 있습니다 <a href="https://github.com/tc39/proposal-optional-chaining/">제안에 읽어</a> 하고 <a href="https://github.com/microsoft/TypeScript/pull/33294">원래의 풀 요청을 볼</a> .

source: More of a gotcha than a constraint. The class expression pattern creates singletons, so they can&rsquo;t be mapped at the type system to support different variable types.
ko: 제약보다 더 많은 문제가 있습니다. 클래스 표현식 패턴은 싱글 톤을 생성하므로 다른 변수 유형을 지원하기 위해 유형 시스템에서 매핑 할 수 없습니다.

source: More plainly, that code snippet is the same as writing the following.
es: Más claramente,ese fragmento de código es lo mismo que escribir lo siguiente.
ko: 보다 명확하게 해당 코드 스 니펫은 다음을 작성하는 것과 동일합니다.

source: More than this, JS has become popular enough to be used outside the context of browsers, such as implementing JS servers using node.js. The &ldquo;run anywhere&rdquo; nature of JS makes it an attractive choice for cross-platform development. There are many developers these days that use <em>only</em> JavaScript to program their entire stack!
ko: 이보다 JS는 node.js를 사용하여 JS 서버를 구현하는 것과 같이 브라우저의 컨텍스트 외부에서 사용될만큼 충분히 대중화되었습니다. JS의 "어디서나 실행"특성은 크로스 플랫폼 개발을위한 매력적인 선택입니다. 요즘에는 자바 스크립트 <em>만</em> 사용 하여 전체 스택을 프로그래밍 하는 개발자가 많이 있습니다 !

source: Most popular libraries are now available as UMD packages. Examples include <a href="https://jquery.com/">jQuery</a>, <a href="http://momentjs.com/">Moment.js</a>, <a href="https://lodash.com/">lodash</a>, and many more.
es: Las bibliotecas m&aacute;s populares ahora est&aacute;n disponibles como paquetes UMD. Los ejemplos incluyen <a href="https://jquery.com/">jQuery</a> , <a href="http://momentjs.com/">Moment.js</a> , <a href="https://lodash.com/">lodash</a> y muchos m&aacute;s.
ko: 가장 인기있는 라이브러리는 이제 UMD 패키지로 제공됩니다. 예를 들어 <a href="https://jquery.com/">jQuery</a> , <a href="http://momentjs.com/">Moment.js</a> , <a href="https://lodash.com/">lodash</a> 등이 있습니다.

source: Most programming languages would throw an error when these sorts of errors occur, some would do so during compilation &mdash; before any code is running. When writing small programs, such quirks are annoying but manageable; when writing applications with hundreds or thousands of lines of code, these constant surprises are a serious problem.
ko: 대부분의 프로그래밍 언어는 이러한 종류의 오류가 발생할 때 오류를 발생시키고 일부는 컴파일 중에 코드가 실행되기 전에 발생합니다. 작은 프로그램을 작성할 때 이러한 단점은 성가 시지만 관리하기 쉽습니다. 수백 또는 수천 줄의 코드로 응용 프로그램을 작성할 때 이러한 끊임없는 놀라움은 심각한 문제입니다.

source: Moving to TypeScript Files
es: Moverse a los archivos de escritura
ko: TypeScript 파일로 이동

source: Much of the time when we talk about &ldquo;singleton types&rdquo;, we&rsquo;re referring to both enum member types as well as numeric/string literal types, though many users will use &ldquo;singleton types&rdquo; and &ldquo;literal types&rdquo; interchangeably.
es: La mayor parte del tiempo cuando hablamos de "tipos singleton", nos referimos tanto a tipos de miembros enum como a tipos literales num&eacute;ricos / de cadena, aunque muchos usuarios usar&aacute;n "tipos singleton" y "tipos literales" indistintamente.
ko: 많은 사람들이&ldquo;단일 유형&rdquo;과&ldquo;문자 유형&rdquo;을 상호 교환 적으로 사용하지만&ldquo;단일 유형&rdquo;에 대해 이야기 할 때 많은 경우에, 우리는 열거 형 멤버 유형과 숫자 / 문자열 리터럴 유형을 모두 언급하고 있습니다.

source: Multi-file namespaces
es: Espacios de nombres de archivos múltiples
ko: 다중 파일 네임 스페이스

source: Multiple decorators can be applied to a declaration, as in the following examples:
es: Se pueden aplicar varios decoradores a una declaración,como en los siguientes ejemplos:
ko: 다음 예제와 같이 선언에 여러 데코레이터를 적용 할 수 있습니다.

source: Multiple fields
es: Múltiples campos
ko: 여러 필드

source: Multiple files that have the same <code>export namespace Foo {</code> at top-level (don&rsquo;t think that these are going to combine into one <code>Foo</code>!)
es: Varios archivos que tienen el mismo <code>export namespace Foo {</code> en el nivel superior (&iexcl;no crea que se van a combinar en un solo <code>Foo</code> !)
ko: 최상위에 동일한 <code>export namespace Foo {</code> 를 가진 여러 파일 (이 파일들이 하나의 <code>Foo</code> 로 결합 될 것이라고 생각하지 마십시오 !)

source: Multiple object literal type inferences for the same type parameter are similarly collapsed into a single normalized union type:
es: Múltiples inferencias de tipo literal de objeto para el mismo parámetro de tipo se colapsan de forma similar en un único tipo de unión normalizada:
ko: 동일한 형식 매개 변수에 대한 여러 개체 리터럴 형식 유추는 마찬가지로 표준화 된 단일 공용체 형식으로 축소됩니다.

source: Mutually exclusive with <a href="#sourceMap"><code>sourceMap</code></a>.
ko: <a href="#sourceMap"> <code>sourceMap</code> </a> 과 상호 배타적입니다 .

source: MyTestPage.html (excerpt)
es: MyTestPage.html (extracto)
ko: MyTestPage.html (발췌)

source: NOTE A <em>Property Descriptor</em> is not provided as an argument to a property decorator due to how property decorators are initialized in TypeScript. This is because there is currently no mechanism to describe an instance property when defining members of a prototype, and no way to observe or modify the initializer for a property. The return value is ignored too. As such, a property decorator can only be used to observe that a property of a specific name has been declared for a class.
es: NOTA Un <em>descriptor de propiedad</em> no se proporciona como argumento para un decorador de propiedad debido a c&oacute;mo se inicializan los decoradores de propiedad en TypeScript. Esto se debe a que actualmente no existe ning&uacute;n mecanismo para describir una propiedad de instancia al definir miembros de un prototipo, y no hay forma de observar o modificar el inicializador de una propiedad. El valor de retorno tambi&eacute;n se ignora. Como tal, un decorador de propiedades solo se puede usar para observar que se ha declarado una propiedad con un nombre espec&iacute;fico para una clase.
ko: 주의점 <em>재산권 기술자</em> 에 의한 재산 장식은 타이프 라이터로 초기화하는 방법에 속성 데코레이터에 대한 인수로 제공되지 않습니다. 현재 프로토 타입의 멤버를 정의 할 때 인스턴스 속성을 설명하는 메커니즘이없고 속성의 이니셜 라이저를 관찰하거나 수정할 수있는 방법이 없기 때문입니다. 반환 값도 무시됩니다. 따라서 속성 데코레이터는 특정 이름의 속성이 클래스에 선언되었음을 관찰하는 데만 사용할 수 있습니다.

source: NOTE A parameter decorator can only be used to observe that a parameter has been declared on a method.
es: NOTA Un decorador de parámetros sólo puede ser usado para observar que un parámetro ha sido declarado en un método.
ko: 참고 매개 변수 데코레이터는 매개 변수가 메소드에서 선언되었음을 관찰하는 데만 사용할 수 있습니다.

source: NOTE Decorator metadata is an experimental feature and may introduce breaking changes in future releases.
es: NOTA Los metadatos del decorador son una característica experimental y pueden introducir cambios de última hora en futuras versiones.
ko: 주 데코레이터 메타 데이터는 실험적인 기능으로 향후 릴리스에서 주요 변경 사항이 발생할 수 있습니다.

source: NOTE Decorators are an experimental feature that may change in future releases.
es: NOTA Los decoradores son una característica experimental que puede cambiar en futuras versiones.
ko: 주 데코레이터는 향후 릴리스에서 변경 될 수있는 실험적인 기능입니다.

source: NOTE Should you choose to return a new constructor function, you must take care to maintain the original prototype. The logic that applies decorators at runtime will <strong>not</strong> do this for you.
es: NOTA Si elige devolver una nueva funci&oacute;n de constructor, debe tener cuidado de mantener el prototipo original. La l&oacute;gica que aplica decoradores en tiempo de ejecuci&oacute;n <strong>no</strong> har&aacute; esto por usted.
ko: 참고 새 생성자 함수를 반환하도록 선택한 경우 원래 프로토 타입을 유지 관리해야합니다. 런타임시 데코레이터를 적용하는 논리 는이를 수행하지 <strong>않습니다</strong> .

source: NOTE The <em>Property Descriptor</em> will be <code>undefined</code> if your script target is less than <code>ES5</code>.
es: NOTA El <em>descriptor de propiedades</em> no estar&aacute; <code>undefined</code> si el destino de su script es menor que <code>ES5</code> .
ko: 참고 <em>재산권 기술자가</em> 될 것입니다 <code>undefined</code> 스크립트 목표보다 작은 경우 <code>ES5</code> .

source: NOTE The return value is ignored if your script target is less than <code>ES5</code>.
es: NOTA El valor de retorno se ignora si el destino de su secuencia de comandos es menor que <code>ES5</code> .
ko: 참고 스크립트 대상이 <code>ES5</code> 미만인 경우 반환 값이 무시됩니다 .

source: NOTE This example requires the <code>reflect-metadata</code> library. See <a href="#metadata">Metadata</a> for more information about the <code>reflect-metadata</code> library.
es: NOTA Este ejemplo requiere la biblioteca <code>reflect-metadata</code> . Consulte <a href="#metadata">Metadatos</a> para obtener m&aacute;s informaci&oacute;n sobre la biblioteca <code>reflect-metadata</code> .
ko: 참고이 예에는 <code>reflect-metadata</code> 라이브러리 가 필요합니다 . <code>reflect-metadata</code> 라이브러리 에 대한 자세한 내용은 <a href="#metadata">메타 데이터</a> 를 참조하십시오 .
