Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/typescript/typescript.*.003.xlf
Languages: es, ko, ru, zh_cn

source: Type Checking JavaScript Files: @enum
ru: Введите Проверка файлов JavaScript:@enum
zh_cn: 类型检查JavaScript文件。@enum

source: Type Checking JavaScript Files: @this
ru: Введите Проверка файлов JavaScript:@это
zh_cn: 类型检查JavaScript文件。@这个

source: Type Checking JavaScript Files: @type
ru: Введите Проверка файлов JavaScript:@тип
zh_cn: 检查JavaScript文件的类型。@type

source: Type Compatibility
ru: Совместимость с типом
zh_cn: 类型兼容性

source: Type Compatibility: Enums
ru: Совместимость с типом:Перечисления
zh_cn: 类型兼容性。枚举

source: Type Guards
ru: Типовые гвардейцы
zh_cn: 型防护罩

source: Type Guards and Differentiating Types
ru: Тип охранников и дифференцирующие типы
zh_cn: 类型保护装置和区别类型

source: Type Inference
ru: Типовой вывод
zh_cn: 类型推断

source: Type aliases are exactly the same as their original types; they are simply alternative names.
ru: Псевдонимы типов в точности совпадают с их оригинальными типами;это просто альтернативные имена.
zh_cn: 类型别名与它们的原始类型完全相同;它们只是替代名称。

source: Type aliases create a new name for a type. Type aliases are sometimes similar to interfaces, but can name primitives, unions, tuples, and any other types that you&rsquo;d otherwise have to write by hand.
ru: Псевдонимы типа создают новое имя для типа. Псевдонимы типов иногда похожи на интерфейсы, но могут называть примитивы, объединения, кортежи и любые другие типы, которые в противном случае вам пришлось бы писать вручную.
zh_cn: 类型别名为类型创建新名称。类型别名有时与接口相似，但是可以命名原语，并集，元组和其他必须手工编写的其他类型。

source: Type aliases have always had a limitation in how they could be &ldquo;recursively&rdquo; referenced. The reason is that any use of a type alias needs to be able to substitute itself with whatever it aliases. In some cases, that&rsquo;s not possible, so the compiler rejects certain recursive aliases like the following:
ru: Псевдонимы типов всегда имели ограничение в том, как на них можно ссылаться &laquo;рекурсивно&raquo;. Причина в том, что любое использование псевдонима типа должно иметь возможность заменять себя любым псевдонимом. В некоторых случаях это невозможно, поэтому компилятор отклоняет определенные рекурсивные псевдонимы, например следующие:
zh_cn: 类型别名在&ldquo;递归&rdquo;引用它们的方式方面一直受到限制。原因是对类型别名的任何使用都必须能够用其别名来代替自身。在某些情况下，这是不可能的，因此编译器会拒绝某些递归别名，如下所示：

source: Type annotations
ru: Введите аннотации
zh_cn: 类型注释

source: Type annotations in TypeScript are lightweight ways to record the intended contract of the function or variable. In this case, we intend the greeter function to be called with a single string parameter. We can try changing the call greeter to pass an array instead:
ru: Аннотации типа в TypeScript-это легкий способ записи предполагаемого договора функции или переменной.В этом случае мы предполагаем,что функция greeter будет вызываться с одним строковым параметром.Вместо этого можно попробовать изменить вызов greeter на передачу массива:
zh_cn: TypeScript中的类型注解是记录函数或变量预定合同的轻量级方法。在本例中,我们打算用一个字符串参数来调用greeter函数。我们可以尝试将调用greeter改为传递一个数组。

source: Type assertion/cast syntax in <code>checkJs</code>/<code>@ts-check</code> mode
ru: Тип утверждение / приведение синтаксиса в <code>checkJs</code> / <code>@ts-check</code> режима
zh_cn: 在 <code>checkJs</code> / <code>@ts-check</code> 模式下键入断言/ 广播语法

source: Type assertions
ru: Типовые заявления
zh_cn: 类型断言

source: Type assertions have two forms. One is the &ldquo;angle-bracket&rdquo; syntax:
ru: Утверждения типа имеют две формы. Один из них - это синтаксис &laquo;угловой скобки&raquo;:
zh_cn: 类型断言有两种形式。一种是&ldquo;尖括号&rdquo;语法：

source: Type checking of the <code>instanceof</code> operator is now based on whether the type of the left operand <em>derives from</em> the type indicated by the right operand (as opposed to a structural subtype check).
ru: Проверка типа оператора <code>instanceof</code> теперь основана на том, является ли тип левого операнда <em>производным от</em> типа, указанного правым операндом (в отличие от проверки структурного подтипа).
zh_cn: 现在， <code>instanceof</code> 运算符的类型检查基于左操作数的类型是否<em>源自</em>右操作数指示的类型（与结构子类型检查相反）。

source: Type compatibility in TypeScript is based on structural subtyping. Structural typing is a way of relating types based solely on their members. This is in contrast with nominal typing. Consider the following code:
ru: Совместимость типов в TypeScript основана на структурном подтипе.Структурное типирование-это способ соотношения типов,основанный исключительно на их членах.Это контрастирует с номинальным набором.Рассмотрим следующий код:
zh_cn: TypeScript中的类型兼容性是基于结构子类型化的。结构分型是一种仅仅基于成员的类型关系的方式。这与名义类型化相反。考虑以下代码。

source: Type guards and type assertions
ru: Типовые ограждения и типовые утверждения
zh_cn: 类型保护和类型断言

source: Type guards for dotted names also work with user defined type guard functions and the <code>typeof</code> and <code>instanceof</code> operators and do not depend on the <code>--strictNullChecks</code> compiler option.
ru: Защиты типов для имен, разделенных точками, также работают с пользовательскими функциями защиты типов и операторами <code>typeof</code> и <code>instanceof</code> и не зависят от <code>--strictNullChecks</code> компилятора --strictNullChecks .
zh_cn: 虚线名称的类型保护也可以与用户定义的类型保护功能以及 <code>typeof</code> 和 <code>instanceof</code> 运算符一起使用，并且不依赖于 <code>--strictNullChecks</code> 编译器选项。

source: Type guards inferred from <code>in</code> operator
ru: Тип охранники выведены из <code>in</code> операторах
zh_cn: 类型警卫从推断出 <code>in</code> 运营商

source: Type guards on the common property.
ru: Тип охранников на общей территории.
zh_cn: 共同财产的类型警卫。

source: Type guards previously only supported checking local variables and parameters. Type guards now support checking &ldquo;dotted names&rdquo; consisting of a variable or parameter name followed one or more property accesses.
ru: Защитники типов ранее поддерживали только проверку локальных переменных и параметров. Защита типов теперь поддерживает проверку &laquo;разделенных точками имен&raquo;, состоящих из имени переменной или параметра, за которым следуют обращения к одному или нескольким свойствам.
zh_cn: 类型防护以前只支持检查局部变量和参数。类型防护现在支持检查&ldquo;点名&rdquo;，该&ldquo;点名&rdquo;由变量或参数名组成，后面是一个或多个属性访问。

source: Type in the boxes and confirm that the breakpoint hits in TypeScript code and that inspection works correctly.
ru: Введите поля и убедитесь,что точка останова попадает в код TypeScript и что проверка работает корректно.
zh_cn: 在方框中键入并确认在TypeScript代码中打出断点,检查工作正常。

source: Type inference also works in &ldquo;the other direction&rdquo; in some cases in TypeScript. This is known as &ldquo;contextual typing&rdquo;. Contextual typing occurs when the type of an expression is implied by its location. For example:
ru: В TypeScript в некоторых случаях вывод типов также работает &laquo;в обратном направлении&raquo;. Это известно как &laquo;контекстная типизация&raquo;. Контекстная типизация происходит, когда тип выражения подразумевается его местоположением. Например:
zh_cn: 在TypeScript中，类型推断在某些情况下也可以在&ldquo;另一个方向&rdquo;上工作。这称为&ldquo;上下文键入&rdquo;。当表达式的类型由其位置隐含时，便发生上下文类型化。例如：

source: Type inference in conditional types
ru: Типовой вывод в условных типах
zh_cn: 条件类型中的类型推理

source: Type parameter inference from contextual types
ru: Введите параметр умозаключения из контекстных типов
zh_cn: 从上下文类型推断类型参数

source: Type parameters as constraints
ru: Типовые параметры как ограничения
zh_cn: 类型参数作为约束条件

source: Type widening
ru: Расширение типа
zh_cn: 类型拓宽

source: Type-checking for <code>globalThis</code>
ru: Проверка типов для <code>globalThis</code>
zh_cn: 类型检查 <code>globalThis</code>

source: Type-checking speed-ups
ru: Ускорение проверки типа
zh_cn: 类型检查加速

source: TypeScript 1.5 adds support to ES6 destructuring declarations and assignments.
ru: TypeScript 1.5 добавляет поддержку деклараций и назначений деструкции ES6.
zh_cn: TypeScript 1.5 增加了对 ES6 解构声明和赋值的支持。

source: TypeScript 1.5 adds support to ES6 for..of loops on arrays for ES3/ES5 as well as full support for Iterator interfaces when targeting ES6.
ru: В TypeScript 1.5 добавлена поддержка ES6 для...циклов на массивах для ES3/ES5,а также полная поддержка интерфейсов Iterator при таргетировании ES6.
zh_cn: TypeScript 1.5为ES3/ES5的数组上的循环增加了对ES6的支持,当目标为ES6时,还增加了对Iterator接口的完全支持。

source: TypeScript 1.5 supports ECMAScript 6 (ES6) modules. ES6 modules are effectively TypeScript external modules with a new syntax: ES6 modules are separately loaded source files that possibly import other modules and provide a number of externally accessible exports. ES6 modules feature several new export and import declarations. It is recommended that TypeScript libraries and applications be updated to use the new syntax, but this is not a requirement. The new ES6 module syntax coexists with TypeScript&rsquo;s original internal and external module constructs and the constructs can be mixed and matched at will.
ru: TypeScript 1.5 поддерживает модули ECMAScript 6 (ES6). Модули ES6 по сути являются внешними модулями TypeScript с новым синтаксисом: модули ES6 - это отдельно загружаемые исходные файлы, которые, возможно, импортируют другие модули и предоставляют ряд доступных извне экспортов. В модулях ES6 есть несколько новых деклараций экспорта и импорта. Рекомендуется обновить библиотеки и приложения TypeScript для использования нового синтаксиса, но это не является обязательным требованием. Новый синтаксис модуля ES6 сосуществует с исходными внутренними и внешними конструкциями модулей TypeScript, и конструкции могут быть смешаны и сопоставлены по желанию.
zh_cn: TypeScript 1.5支持ECMAScript 6（ES6）模块。 ES6模块实际上是具有新语法的TypeScript外部模块：ES6模块是单独加载的源文件，可能会导入其他模块并提供许多外部可访问的导出。 ES6模块具有几个新的导出和导入声明。建议更新TypeScript库和应用程序以使用新语法，但这不是必需的。新的ES6模块语法与TypeScript的原始内部和外部模块构造共存，并且可以随意混合和匹配这些构造。

source: TypeScript 1.6 adds a new way to narrow a variable type inside an <code>if</code> block, in addition to <code>typeof</code> and <code>instanceof</code>. A user-defined type guard functions is one with a return type annotation of the form <code>x is T</code>, where <code>x</code> is a declared parameter in the signature, and <code>T</code> is any type. When a user-defined type guard function is invoked on a variable in an <code>if</code> block, the type of the variable will be narrowed to <code>T</code>.
ru: TypeScript 1.6 добавляет новый способ сузить тип переменной внутри блока <code>if</code> в дополнение к <code>typeof</code> и <code>instanceof</code> . Функции защиты определяемого пользователем типа - это функция с аннотацией возвращаемого типа в форме <code>x is T</code> , где <code>x</code> - объявленный параметр в подписи, а <code>T</code> - любой тип. При определенной пользователем функции охранник типа вызывается переменной в , <code>if</code> блок, тип переменной будет сужен до <code>T</code> .
zh_cn: 除了 <code>typeof</code> 和 <code>instanceof</code> 之外，TypeScript 1.6还添加了一种新的方法来缩小 <code>if</code> 块内的变量类型。用户定义的类型保护函数是一个带有类型为 <code>x is T</code> 的返回类型注释的函数，其中 <code>x</code> 是T，其中x是签名中声明的参数， <code>T</code> 是任何类型。当用户定义的类型的保护功能是在对一个变量调用 <code>if</code> 块中，变量的类型将被缩小到 <code>T</code> 。

source: TypeScript 1.6 adds support for <code>abstract</code> keyword for classes and their methods. An abstract class is allowed to have methods with no implementation, and cannot be constructed.
ru: TypeScript 1.6 добавляет поддержку ключевого слова <code>abstract</code> для классов и их методов. Абстрактный класс может иметь методы без реализации и не может быть построен.
zh_cn: TypeScript 1.6增加了对类及其方法的 <code>abstract</code> 关键字的支持。抽象类被允许具有没有实现的方法，并且不能被构造。

source: TypeScript 1.6 adds support for ES6 class expressions. In a class expression, the class name is optional and, if specified, is only in scope in the class expression itself. This is similar to the optional name of a function expression. It is not possible to refer to the class instance type of a class expression outside the class expression, but the type can of course be matched structurally. For example:
ru: В TypeScript 1.6 добавлена поддержка выражений класса ES6.В выражении класса имя класса является необязательным и,если оно указано,находится только в области видимости в самом выражении класса.Это похоже на необязательное имя выражения функции.Невозможно ссылаться на тип экземпляра выражения класса вне выражения класса,но тип,конечно,может быть структурно подобран.Например:
zh_cn: TypeScript 1.6增加了对ES6类表达式的支持。在类表达式中,类名是可选的,如果指定了,则只在类表达式本身的范围内。这类似于函数表达式的可选名称。在类表达式之外,不可能引用类表达式的类实例类型,当然可以在结构上匹配类型。比如说

source: TypeScript 1.6 adds support for classes extending arbitrary expression that computes a constructor function. This means that built-in types can now be extended in class declarations.
ru: В TypeScript 1.6 добавлена поддержка классов,расширяющих произвольное выражение,которое вычисляет функцию конструктора.Это означает,что встроенные типы теперь могут быть расширены в объявлениях классов.
zh_cn: TypeScript 1.6增加了对扩展任意表达式的类的支持,这些表达式计算一个构造函数。这意味着内置类型现在可以在类声明中进行扩展。

source: TypeScript 1.6 adds support for generators when targeting ES6.
ru: В TypeScript 1.6 добавлена поддержка генераторов при нацеливании на ES6.
zh_cn: TypeScript 1.6在针对ES6时增加了对生成器的支持。

source: TypeScript 1.6 enforces stricter object literal assignment checks for the purpose of catching excess or misspelled properties. Specifically, when a fresh object literal is assigned to a variable or passed as an argument for a non-empty target type, it is an error for the object literal to specify properties that don&rsquo;t exist in the target type.
ru: TypeScript 1.6 применяет более строгие проверки назначения литералов объекта с целью выявления лишних или неправильно написанных свойств. В частности, когда новый литерал объекта присваивается переменной или передается в качестве аргумента для непустого целевого типа, для литерала объекта возникает ошибка указывать свойства, которые не существуют в целевом типе.
zh_cn: TypeScript 1.6强制执行更严格的对象文字分配检查，以捕获多余或拼写错误的属性。具体来说，当将新的对象常量分配给变量或作为非空目标类型的参数传递时，对象常量指定目标类型中不存在的属性是错误的。

source: TypeScript 1.6 introduces a new <code>.tsx</code> file extension. This extension does two things: it enables JSX inside of TypeScript files, and it makes the new <code>as</code> operator the default way to cast (removing any ambiguity between JSX expressions and the TypeScript prefix cast operator). For example:
ru: TypeScript 1.6 представляет новое <code>.tsx</code> файла .tsx . Это расширение выполняет две функции: оно включает JSX внутри файлов TypeScript и делает оператор new <code>as</code> способом преобразования по умолчанию (устраняя любую двусмысленность между выражениями JSX и оператором преобразования префикса TypeScript). Например:
zh_cn: TypeScript 1.6引入了新的 <code>.tsx</code> 文件扩展名。此扩展有两件事：在TypeScript文件中启用JSX，并使新的 <code>as</code> 运算符成为默认的转换方式（消除JSX表达式与TypeScript前缀转换运算符之间的任何歧义）。例如：

source: TypeScript 1.6 introduces experimental support of <code>async</code> functions when targeting ES6. Async functions are expected to invoke an asynchronous operation and await its result without blocking normal execution of the program. This accomplished through the use of an ES6-compatible <code>Promise</code> implementation, and transposition of the function body into a compatible form to resume execution when the awaited asynchronous operation completes.
ru: TypeScript 1.6 представляет экспериментальную поддержку <code>async</code> функций при ориентации на ES6. Ожидается, что асинхронные функции будут вызывать асинхронную операцию и ожидать ее результата, не блокируя нормальное выполнение программы. Это достигается за счет использования ES6-совместимой реализации <code>Promise</code> и преобразования тела функции в совместимую форму для возобновления выполнения после завершения ожидаемой асинхронной операции.
zh_cn: 在面向ES6时，TypeScript 1.6引入了对 <code>async</code> 功能的实验性支持。异步函数应调用异步操作并等待其结果，而不会阻止程序的正常执行。这是通过使用与ES6兼容的 <code>Promise</code> 实现以及将功能主体转换为兼容形式以在等待的异步操作完成时恢复执行来实现的。

source: TypeScript 1.6 introduces intersection types, the logical complement of union types. A union type <code>A | B</code> represents an entity that is either of type <code>A</code> or type <code>B</code>, whereas an intersection type <code>A &amp; B</code> represents an entity that is both of type <code>A</code><em>and</em> type <code>B</code>.
ru: TypeScript 1.6 представляет типы пересечений, логическое дополнение типов объединения. Тип объединения <code>A | B</code> представляет собой объект , который является либо типа <code>A</code> или типа <code>B</code> , в то время как тип пересечения <code>A &amp; B</code> представляет собой объект , который является оба типа <code>A</code> <em>и</em> типа <code>B</code> .
zh_cn: TypeScript 1.6引入了交集类型，这是并集类型的逻辑补充。联合类型 <code>A | B</code> 表示是任一类型的实体 <code>A</code> 或类型 <code>B</code> ，而交叉路口型 <code>A &amp; B</code> 表示的类型的两个实体 <code>A</code> <em>和</em>类型 <code>B</code> 。

source: TypeScript 1.7 adds <code>ES6</code> to the list of options available for the <code>--module</code> flag and allows you to specify the module output when targeting <code>ES6</code>. This provides more flexibility to target exactly the features you want in specific runtimes.
ru: TypeScript 1.7 добавляет <code>ES6</code> в список опций, доступных для флага <code>--module</code> , и позволяет вам указать вывод модуля при ориентации на <code>ES6</code> . Это обеспечивает большую гибкость для нацеливания именно на те функции, которые вам нужны в определенных средах выполнения.
zh_cn: TypeScript 1.7将 <code>ES6</code> 添加到 <code>--module</code> 标志可用的选项列表中，并允许您在定位 <code>ES6</code> 时指定模块输出。这提供了更大的灵活性，可以准确地定位特定运行时中所需的功能。

source: TypeScript 1.7 makes checking of destructuring patterns with an object literal or array literal initializers less rigid and more intuitive.
ru: TypeScript 1.7 делает проверку шаблонов разрушения с помощью буквенных инициализаторов объектов или массивов менее жесткой и более интуитивной.
zh_cn: TypeScript 1.7 使得使用对象 literal 或数组 literal 初始化器的解构模式检查不再那么死板,而是更加直观。

source: TypeScript 1.7 supports upcoming <a href="https://github.com/rwaldron/exponentiation-operator">ES7/ES2016 exponentiation operators</a>: <code>**</code> and <code>**=</code>. The operators will be transformed in the output to ES3/ES5 using <code>Math.pow</code>.
ru: TypeScript 1.7 поддерживает следующие <a href="https://github.com/rwaldron/exponentiation-operator">операторы возведения в степень ES7 / ES2016</a> : <code>**</code> и <code>**=</code> . Операторы будут преобразованы в выводе в ES3 / ES5 с помощью <code>Math.pow</code> .
zh_cn: TypeScript 1.7支持即将推出的<a href="https://github.com/rwaldron/exponentiation-operator">ES7 / ES2016幂运算符</a>： <code>**</code> 和 <code>**=</code> 。运算符将使用 <code>Math.pow</code> 在输出中转换为ES3 / ES5 。

source: TypeScript 1.8 allows <code>tsconfig.json</code> files in all project types. This includes ASP.NET v4 projects, <em>Console Application</em>, and the <em>Html Application with TypeScript</em> project types. Further, you are no longer limited to a single <code>tsconfig.json</code> file but can add multiple, and each will be built as part of the project. This allows you to separate the configuration for different parts of your application without having to use multiple different projects.
ru: TypeScript 1.8 позволяет <code>tsconfig.json</code> файлы tsconfig.json во всех типах проектов. Сюда входят проекты ASP.NET v4, <em>консольное приложение</em> и <em>приложение Html с</em> типами проектов <em>TypeScript</em> . Кроме того, вы больше не ограничены одним файлом <code>tsconfig.json</code> , но можете добавить несколько, и каждый из них будет создан как часть проекта. Это позволяет вам разделять конфигурацию для разных частей вашего приложения без необходимости использовать несколько разных проектов.
zh_cn: TypeScript 1.8允许所有项目类型中的 <code>tsconfig.json</code> 文件。这包括ASP.NET v4项目，<em>控制台应用程序</em>和<em>具有TypeScript</em>项目类型的<em>Html应用程序</em>。此外，您不再局限于单个 <code>tsconfig.json</code> 文件，而是可以添加多个文件，并且每个文件都将作为项目的一部分进行构建。这使您可以为应用程序的不同部分分离配置，而不必使用多个不同的项目。

source: TypeScript 1.8 allows users to use the <code>--outFile</code> argument with special file system entities like named pipes, devices, etc.
ru: TypeScript 1.8 позволяет пользователям использовать аргумент <code>--outFile</code> со специальными объектами файловой системы, такими как именованные каналы, устройства и т. Д.
zh_cn: TypeScript 1.8允许用户将 <code>--outFile</code> 参数与特殊文件系统实体（如命名管道，设备等）一起使用。

source: TypeScript 1.8 extends <a href="typescript-1.6#user-defined-type-guard-functions">user-defined type guard functions</a> to class and interface methods.
ru: TypeScript 1.8 расширяет <a href="typescript-1.6#user-defined-type-guard-functions">определяемые пользователем функции защиты типов</a> до методов класса и интерфейса.
zh_cn: TypeScript 1.8将<a href="typescript-1.6#user-defined-type-guard-functions">用户定义的类型保护功能</a>扩展到类和接口方法。

source: TypeScript 1.8 improves type inference involving source and target sides that are both union or intersection types. For example, when inferring from <code>string | string[]</code> to <code>string | T</code>, we reduce the types to <code>string[]</code> and <code>T</code>, thus inferring <code>string[]</code> for <code>T</code>.
ru: TypeScript 1.8 улучшает вывод типов, включая исходную и целевую стороны, которые являются типами объединения или пересечения. Например, при выводе из <code>string | string[]</code> в <code>string | T</code> , мы уменьшаем типы для <code>string[]</code> и <code>T</code> , тем самым выводя <code>string[]</code> для <code>T</code> .
zh_cn: TypeScript 1.8改进了涉及联合和相交类型的源边和目标边的类型推断。例如，从 <code>string | string[]</code> 为 <code>string | T</code> ，我们将类型简化为 <code>string[]</code> 和 <code>T</code> ，从而为 <code>T</code> 推断 <code>string[]</code> 。

source: TypeScript 1.8 introduces control flow analysis to help catch common errors that users tend to run into. Read on to get more details, and check out these errors in action:
ru: TypeScript 1.8 представляет анализ потока управления,чтобы помочь отловить распространенные ошибки,с которыми обычно сталкиваются пользователи.Читайте дальше,чтобы получить более подробную информацию,и проверьте эти ошибки в действии:
zh_cn: TypeScript 1.8引入了控制流分析,以帮助捕捉用户容易遇到的常见错误。请继续阅读以获得更多细节,并检查这些错误的实际情况。

source: TypeScript 2.0 adds a new <code>--skipLibCheck</code> compiler option that causes type checking of declaration files (files with extension <code>.d.ts</code>) to be skipped. When a program includes large declaration files, the compiler spends a lot of time type checking declarations that are already known to not contain errors, and compile times may be significantly shortened by skipping declaration file type checks.
ru: TypeScript 2.0 добавляет новый <code>--skipLibCheck</code> компилятора <code>.d.ts</code> позволяет пропускать проверку типов файлов объявлений (файлов с расширением .d.ts ). Когда программа включает большие файлы объявлений, компилятор тратит много времени на проверку типов объявлений, которые уже заведомо не содержат ошибок, и время компиляции может быть значительно сокращено за счет пропуска проверок типов файлов объявлений.
zh_cn: TypeScript 2.0添加了一个新的 <code>--skipLibCheck</code> 编译器选项，该选项导致跳过声明文件（扩展名为 <code>.d.ts</code> 的文件）的类型检查。当程序包含大的声明文件时，编译器将花费大量时间进行类型检查，这些声明已经众所周知不包含错误，并且跳过声明文件类型检查可以显着缩短编译时间。
