Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/typescript/typescript.*.003.xlf
Languages: es, ko, ru, zh_cn

source: Prepending a project will include the project&rsquo;s output above the output of the current project. This works for both <code>.js</code> files and <code>.d.ts</code> files, and source map files will also be emitted correctly.
es: Anteponer un proyecto incluir&aacute; el resultado del proyecto por encima del resultado del proyecto actual. Esto funciona tanto para archivos <code>.js</code> como para archivos <code>.d.ts</code> , y los archivos de mapas de origen tambi&eacute;n se emitir&aacute;n correctamente.
ko: 프로젝트를 추가하면 현재 프로젝트 출력 위에 프로젝트 출력이 포함됩니다. 이것은 <code>.js</code> 파일과 <code>.d.ts</code> 파일 모두에서 작동 하며 소스 맵 파일도 올바르게 생성됩니다.
ru: Подготовка проекта будет включать выходные данные проекта выше выходных данных текущего проекта. Это работает как для файлов <code>.js</code> ,так и <code>.d.ts</code> файлов .d.ts , и файлы исходных карт также будут отправлены правильно.
zh_cn: 在一个项目之前，将把该项目的输出包括在当前项目的输出之上。这对于 <code>.js</code> 文件和 <code>.d.ts</code> 文件均适用，并且源映射文件也将正确发出。

source: Preprocessing input files
es: Preprocesamiento de los archivos de entrada
ko: 전처리 입력 파일
ru: Препроцессирование входных файлов
zh_cn: 输入文件的预处理

source: Prettier <code>--pretty</code> output
es: M&aacute;s bonita <code>--pretty</code> de salida
ko: 더 예쁘다- <code>--pretty</code> 출력
ru: Хорошеет <code>--pretty</code> выход
zh_cn: 漂亮 <code>--pretty</code> 输出

source: Prettier error messages from <code>tsc</code>
es: Mensajes de error m&aacute;s bonitos de <code>tsc</code>
ko: <code>tsc</code> 의 더 예쁜 오류 메시지
ru: <code>tsc</code> сообщения об ошибках от tsc
zh_cn: 来自 <code>tsc</code> 的更漂亮的错误消息

source: Preventing Name Conflicts
es: Prevención de conflictos de nombres
ko: 이름 충돌 방지
ru: Предотвращение именных конфликтов
zh_cn: 防止名称冲突

source: Previously CommonJS/AMD/UMD modules were treated in the same way as ES6 modules, resulting in a couple of problems. Namely:
es: Anteriormente,los módulos JS/AMD/UMD se trataban de la misma manera que los módulos ES6,lo que provocaba un par de problemas.A saber:
ko: 이전에는 CommonJS / AMD / UMD 모듈이 ES6 모듈과 동일한 방식으로 처리되어 몇 가지 문제가 발생했습니다. 즉:
ru: Ранее модули CommonJS/AMD/UMD обрабатывались так же,как и модули ES6,что привело к паре проблем.А именно:
zh_cn: 以前CommonJS/AMD/UMD模块和ES6模块一样对待,导致了几个问题。也就是说。

source: Previously an error, now supported in TypeScript 1.8. <code>let</code>/<code>const</code> declarations within loops and captured in functions are now emitted to correctly match <code>let</code>/<code>const</code> freshness semantics.
es: Anteriormente un error, ahora compatible con TypeScript 1.8. <code>let</code> declaraciones let / <code>const</code> dentro de bucles y capturadas en funciones ahora se emiten para coincidir correctamente con la sem&aacute;ntica de frescura <code>let</code> / <code>const</code> .
ko: 이전에는 TypeScript 1.8에서 지원되는 오류가 발생했습니다. 루프 내에서 <code>let</code> / <code>const</code> 선언은 함수에서 캡처되어 <code>let</code> / <code>const</code> 신선도 의미 와 정확하게 일치 하도록 생성 됩니다.
ru: Ранее ошибка, теперь поддерживается в TypeScript 1.8. Объявления <code>let</code> / <code>const</code> внутри циклов и захваченные в функциях теперь генерируются для правильного соответствия семантике свежести <code>let</code> / <code>const</code> .
zh_cn: 以前是错误，现在TypeScript 1.8支持。现在发出在循环内并在函数中捕获的 <code>let</code> / <code>const</code> 声明，以正确匹配 <code>let</code> / <code>const</code> 的新鲜度语义。

source: Previously flagged as an invalid flag combination, <code>target: es5</code> and &lsquo;module: es6&rsquo; is now supported. This should facilitate using ES2015-based tree shakers like <a href="https://github.com/rollup/rollup">rollup</a>.
es: Anteriormente marcado como una combinaci&oacute;n de indicadores no v&aacute;lida, <code>target: es5</code> y 'module: es6' ahora son compatibles. Esto deber&iacute;a facilitar el uso de vibradores de &aacute;rboles basados ​​en ES2015 como <a href="https://github.com/rollup/rollup">rollup</a> .
ko: 이전에는 유효하지 않은 플래그 조합으로 플래그가 지정된 <code>target: es5</code> 및 'module : es6'이 지원됩니다. 이를 통해 <a href="https://github.com/rollup/rollup">rollup</a> 과 같은 ES2015 기반 트리 셰이커를 쉽게 사용할 수 있습니다.
ru: Ранее помеченная как недопустимая комбинация флагов, теперь поддерживается <code>target: es5</code> и 'module: es6'. Это должно облегчить использование встряхивателей деревьев на основе ES2015, таких как <a href="https://github.com/rollup/rollup">свертка</a> .
zh_cn: 以前被标记为无效标志组合，现在支持 <code>target: es5</code> 和'module：es6'。这将有助于使用基于ES2015树摇床样<a href="https://github.com/rollup/rollup">卷</a>。

source: Previously generators were only supported if the target is ES6/ES2015 or later. Moreover, constructs that operate on the Iterator protocol, e.g. <code>for..of</code> were only supported if they operate on arrays for targets below ES6/ES2015.
es: Anteriormente, los generadores solo eran compatibles si el objetivo era ES6 / ES2015 o posterior. Adem&aacute;s, las construcciones que operan en el protocolo <code>for..of</code> , por ejemplo, for..of , solo se admiten si operan en matrices para objetivos por debajo de ES6 / ES2015.
ko: 이전에는 생성기가 대상이 ES6 / ES2015 이상인 경우에만 지원되었습니다. 또한, 반복자 프로토콜, 예에서 작동 구조 <code>for..of</code> 는 그들이 ES6 / ES2015 아래 대상에 대해 배열에서 작동하는 경우에만 지원했다.
ru: Ранее генераторы поддерживались только в том случае, если целью является ES6 / ES2015 или новее. Более того, конструкции, работающие по протоколу Iterator, например <code>for..of</code> , поддерживались только в том случае, если они работают с массивами для целей ниже ES6 / ES2015.
zh_cn: 以前，仅当目标是ES6 / ES2015或更高版本时才支持生成器。此外，仅在针对ES6 / ES2015以下目标的阵列上运行时，才支持基于Iterator协议（例如 <code>for..of</code> )的构造。

source: Previously the type of a <code>for..in</code> variable is inferred to <code>any</code>; that allowed the compiler to ignore invalid uses within the <code>for..in</code> body.
es: Anteriormente, el tipo de una variable <code>for..in</code> se infiere a <code>any</code> ; eso permiti&oacute; al compilador ignorar usos inv&aacute;lidos dentro del cuerpo de <code>for..in</code> .
ko: 이전에는 <code>for..in</code> 변수 의 유형은 <code>any</code> ; 컴파일러가 <code>for..in</code> 본문 내에서 유효하지 않은 사용을 무시하도록 허용했습니다 .
ru: Ранее тип переменной <code>for..in</code> определялся как <code>any</code> ; это позволило компилятору игнорировать недопустимые использования в теле <code>for..in</code> .
zh_cn: 以前， <code>for..in</code> 变量的类型可以推论为 <code>any</code> ; 允许编译器忽略 <code>for..in</code> 主体中的无效使用。

source: Previously there were two options:
es: Antes había dos opciones:
ko: 이전에는 두 가지 옵션이있었습니다.
ru: Раньше было два варианта:
zh_cn: 以前有两个选择。

source: Previously type <code>{}</code> was inferred for <code>obj</code> and the second line subsequently caused an error because <code>obj</code> would appear to have no properties. That obviously wasn&rsquo;t ideal.
es: Anteriormente, el tipo <code>{}</code> se infiri&oacute; para <code>obj</code> y la segunda l&iacute;nea posteriormente caus&oacute; un error porque <code>obj</code> parecer&iacute;a no tener propiedades. Eso obviamente no fue ideal.
ko: 이전 유형 <code>{}</code> 이 (가) 에 대한 추정 된 <code>obj</code> 하기 때문에 두 번째 줄 이후 오류가 발생 <code>obj</code> 가 어떤 특성이없는 것으로 나타납니다. 그것은 이상적이지 않았습니다.
ru: Раньше для <code>obj</code> предполагался тип <code>{}</code> , и вторая строка впоследствии вызвала ошибку, поскольку казалось, что <code>obj</code> не имеет свойств. Это явно было не идеально.
zh_cn: 先前为 <code>obj</code> 推断类型为 <code>{}</code> ，第二行随后导致错误，因为 <code>obj</code> 似乎没有属性。那显然不是理想的。

source: Previously, a non-disciminated union wouldn&rsquo;t have <em>any</em> excess property checking done on its members, and as a result, the incorrectly typed <code>name</code> property slipped by.
es: Anteriormente, a un sindicato no discriminado no se le realizar&iacute;a <em>ninguna</em> verificaci&oacute;n de exceso de propiedad en sus miembros y, como resultado, la propiedad del <code>name</code> escrito incorrectamente se desliz&oacute;.
ko: 이전에는 비차별 노조가 구성원에 <em>대해</em> 초과 재산 점검을 수행 하지 않았으므로 결과적으로 잘못 입력 된 <code>name</code> 재산이 미끄러졌습니다.
ru: Раньше для неискаженного объединения не было <em>бы</em> лишних проверок свойств для его членов, и в результате неправильно набранное свойство <code>name</code> пропускалось.
zh_cn: 以前，不区分大小写的联合不会对其成员执行<em>任何</em>多余的属性检查，结果，键入不正确的 <code>name</code> 属性就会漏掉。

source: Previously, if TypeScript couldn&rsquo;t figure out the type of a variable, it would choose the <code>any</code> type.
es: Anteriormente, si TypeScript no pod&iacute;a averiguar el tipo de variable, eleg&iacute;a <code>any</code> tipo.
ko: 이전에는 TypeScript가 변수 유형을 알아낼 수없는 경우 <code>any</code> 유형을 선택했습니다 .
ru: Раньше, если TypeScript не мог определить тип переменной, он выбирал <code>any</code> тип.
zh_cn: 以前，如果TypeScript无法确定变量的类型，它将选择 <code>any</code> 类型。

source: Previously, this structure was rather awkward to work with if you used a single tsconfig file:
es: Anteriormente,esta estructura era bastante incómoda de trabajar si se utilizaba un solo archivo tsconfig:
ko: 이전에는 단일 tsconfig 파일을 사용한 경우이 구조를 사용하는 것이 다소 어색했습니다.
ru: Раньше с такой структурой было довольно неудобно работать,если вы использовали один tsconfig файл:
zh_cn: 以前,如果使用单个的tsconfig文件,这种结构的工作是相当尴尬的。

source: Print help message.
es: Imprime el mensaje de ayuda.
ko: 도움말 메시지를 인쇄하십시오.
ru: Распечатайте справочное сообщение.
zh_cn: 打印帮助信息。

source: Print names of files part of the compilation.
es: Imprime los nombres de los archivos que forman parte de la compilación.
ko: 편집의 일부 파일 이름을 인쇄하십시오.
ru: Печать имен файлов,входящих в состав компиляции.
zh_cn: 打印编译后的文件名。

source: Print names of generated files part of the compilation.
es: Imprimir los nombres de los archivos generados es parte de la compilación.
ko: 컴파일 과정에서 생성 된 파일의 이름을 인쇄하십시오.
ru: Печатайте имена сгенерированных файлов,входящих в состав компиляции.
zh_cn: 打印编译过程中生成的文件名。

source: Print the compiler&rsquo;s version.
es: Imprime la versi&oacute;n del compilador.
ko: 컴파일러 버전을 인쇄하십시오.
ru: Вывести версию компилятора.
zh_cn: 打印编译器的版本。

source: Prior to 3.3, building composite projects using <code>--build --watch</code> actually didn&rsquo;t use this incremental file watching infrastructure. An update in one project under <code>--build --watch</code> mode would force a full build of that project, rather than determining which files within that project were affected.
es: Antes de 3.3, la construcci&oacute;n de proyectos compuestos usando <code>--build --watch</code> en realidad no usaba esta infraestructura de observaci&oacute;n de archivos incremental. Una actualizaci&oacute;n en un proyecto en el modo <code>--build --watch</code> forzar&iacute;a una compilaci&oacute;n completa de ese proyecto, en lugar de determinar qu&eacute; archivos dentro de ese proyecto se vieron afectados.
ko: 3.3 이전에는 <code>--build --watch</code> 를 사용하여 복합 프로젝트를 빌드 할 때 실제로이 증분 파일 감시 인프라를 사용하지 않았습니다. <code>--build --watch</code> 모드 에서 한 프로젝트의 업데이트 는 해당 프로젝트 내의 파일이 영향을받는 것을 결정하지 않고 해당 프로젝트를 완전히 빌드합니다.
ru: До версии 3.3 при сборке составных проектов с использованием <code>--build --watch</code> эта инфраструктура инкрементного отслеживания файлов фактически не использовалась. Обновление в одном проекте в режиме <code>--build --watch</code> вызовет полную сборку этого проекта, а не определяет, какие файлы в этом проекте были затронуты.
zh_cn: 在3.3之前的版本中，使用 <code>--build --watch</code> 构建复合项目实际上并未使用此增量文件监视基础结构。在 <code>--build --watch</code> 模式下在一个项目中进行更新将强制该项目的完整构建，而不是确定该项目中的哪些文件受到了影响。

source: Prior to TypeScript 2.4, in the following example
es: Antes de TypeScript 2.4,en el siguiente ejemplo
ko: 다음 예제에서 TypeScript 2.4 이전
ru: До TypeScript 2.4,в следующем примере
zh_cn: 在TypeScript 2.4之前,在下面的例子中。

source: Prior to TypeScript 2.4, this example would succeed. When relating the types of <code>map</code>, TypeScript would bidirectionally relate their parameters (i.e. the type of <code>f</code>). When relating each <code>f</code>, TypeScript would also bidirectionally relate the type of <em>those</em> parameters.
es: Antes de TypeScript 2.4, este ejemplo tendr&iacute;a &eacute;xito. Al relacionar los tipos de <code>map</code> a , TypeScript relacionar&iacute;a bidireccionalmente sus par&aacute;metros (es decir, el tipo de <code>f</code> ). Al relacionar cada <code>f</code> , TypeScript tambi&eacute;n relacionar&iacute;a bidireccionalmente el tipo de <em>esos</em> par&aacute;metros.
ko: TypeScript 2.4 이전에는이 ​​예제가 성공했습니다. <code>map</code> 유형과 관련하여 TypeScript는 매개 변수 (예 : <code>f</code> 유형)를 양방향으로 관련시킵니다 . 각 <code>f</code> 와 관련하여 TypeScript는 <em>해당</em> 매개 변수 의 유형을 양방향으로 관련시킵니다 .
ru: До TypeScript 2.4 этот пример был успешным. При связывании типов <code>map</code> TypeScript будет двунаправленно связывать их параметры (то есть тип <code>f</code> ). При связывании каждого <code>f</code> TypeScript также будет двунаправленно связывать тип <em>этих</em> параметров.
zh_cn: 在TypeScript 2.4之前，此示例将成功。当关联 <code>map</code> 的类型时，TypeScript将双向关联其参数（即 <code>f</code> 的类型）。当关联每个 <code>f</code> 时，TypeScript还将双向关联<em>那些</em>参数的类型。

source: Private and Protected Constructors
es: Constructores privados y protegidos
ko: 개인 및 보호 생성자
ru: Частные и охраняемые строители
zh_cn: 私人建筑商和受保护建筑商

source: Private and protected members in a class affect their compatibility. When an instance of a class is checked for compatibility, if the target type contains a private member, then the source type must also contain a private member that originated from the same class. Likewise, the same applies for an instance with a protected member. This allows a class to be assignment compatible with its super class, but <em>not</em> with classes from a different inheritance hierarchy which otherwise have the same shape.
es: Los miembros privados y protegidos de una clase afectan su compatibilidad. Cuando se comprueba la compatibilidad de una instancia de una clase, si el tipo de destino contiene un miembro privado, entonces el tipo de origen tambi&eacute;n debe contener un miembro privado que se origin&oacute; en la misma clase. Asimismo, se aplica lo mismo para una instancia con un miembro protegido. Esto permite que una clase sea compatible con la asignaci&oacute;n de su superclase, pero <em>no</em> con clases de una jerarqu&iacute;a de herencia diferente que de otra manera tienen la misma forma.
ko: 클래스의 개인 및 보호 멤버는 호환성에 영향을줍니다. 클래스의 인스턴스가 호환성을 검사 할 때 대상 유형에 개인 구성원이 포함 된 경우 소스 유형에도 동일한 클래스에서 시작된 개인 구성원이 포함되어야합니다. 마찬가지로 보호 멤버가있는 인스턴스에도 동일하게 적용됩니다. 이를 통해 클래스는 수퍼 클래스와 호환 가능하지만 다른 상속 계층 구조의 클래스와는 호환 <em>되지 않는</em> 할당이 가능합니다 .
ru: Частные и защищенные члены в классе влияют на их совместимость. Когда экземпляр класса проверяется на совместимость, если целевой тип содержит закрытый член, тогда исходный тип также должен содержать закрытый член, происходящий из того же класса. Точно так же то же самое применимо к экземпляру с защищенным членом. Это позволяет классу быть совместимым по назначению со своим суперклассом, но <em>не</em> с классами из другой иерархии наследования, которые в остальном имеют ту же форму.
zh_cn: 类中的私有成员和受保护成员会影响其兼容性。在检查类的实例的兼容性时，如果目标类型包含私有成员，那么源类型也必须包含源自同一类的私有成员。同样，对于具有受保护成员的实例也是如此。这样一来，一个类就可以与其父类兼容，但<em>不能</em>与其他继承层次结构相同的类的继承兼容。

source: Private and protected members in classes
es: Los miembros privados y protegidos de las clases
ko: 수업 중 개인 및 보호 회원
ru: Частные и защищенные члены в классах
zh_cn: 班级中的私人成员和受保护成员

source: Project Configuration
es: Configuración del proyecto
ko: 프로젝트 구성
ru: Конфигурация проекта
zh_cn: 项目配置

source: Project References
es: Referencias del proyecto
ko: 프로젝트 참조
ru: Ссылки на проект
zh_cn: 项目参考

source: Project References: Build Mode for TypeScript
es: Referencias del proyecto:Modo de construcción para TypeScript
ko: 프로젝트 참조 : TypeScript의 빌드 모드
ru: Ссылки на проект:Режим построения для TypeScript
zh_cn: 项目参考。TypeScript的构建模式

source: Project References: Caveats
es: Referencias del proyecto:Caveats
ko: 프로젝트 참조 :주의 사항
ru: Ссылки на проект:Caveats
zh_cn: 项目参考。注意事项

source: Project References: Caveats for Project References
es: Referencias del proyecto:Advertencias para las referencias del proyecto
ko: 프로젝트 참조 : 프로젝트 참조를위한주의 사항
ru: Ссылки на проект:Справочные материалы по проектам
zh_cn: 项目参考资料。项目参考资料的注意事项

source: Project References: MSBuild
es: Referencias del proyecto:MSBuild
ko: 프로젝트 참조 : MSBuild
ru: Ссылки на проект:MSBuild
zh_cn: 项目参考。MSBuild

source: Project References: Overall Structure
es: Referencias del proyecto:Estructura general
ko: 프로젝트 참조 : 전체 구조
ru: Ссылки на проект:Общая структура
zh_cn: 项目参考。整体结构

source: Project References: Structuring for outFiles
es: Referencias del proyecto:Estructuración de archivos externos
ko: 프로젝트 참조 서 : outFiles 구조화
ru: Ссылки на проект:Структурирование для outFiles
zh_cn: 项目参考。outFiles的结构

source: Project References: Structuring for relative modules
es: Referencias del proyecto:Estructuración de los módulos relativos
ko: 프로젝트 참조 : 관련 모듈 구조화
ru: Ссылки на проект:Структурирование для относительных модулей
zh_cn: 项目参考。相对模块的结构

source: Project References: What is a Project Reference?
es: Referencias del proyecto:¿Qué es una referencia de proyecto?
ko: 프로젝트 참조 : 프로젝트 참조 란 무엇입니까?
ru: Ссылки на проект:Что такое ссылка на проект?
zh_cn: 项目参考文献。什么是项目参考资料?

source: Project References: composite
es: Referencias del proyecto:composite
ko: 프로젝트 참조 : 합성
ru: Ссылки на проект:композитный
zh_cn: 项目参考:复合材料

source: Project References: declarationMaps
es: Referencias del proyecto:declarationMaps
ko: 프로젝트 참조 : declarationMaps
ru: Ссылки на проект:декларацияКарты
zh_cn: 项目参考资料:declarationMaps

source: Project References: prepend with outFile
es: Referencias del proyecto:prepárese con outFile
ko: 프로젝트 참조 : outFile 앞에 추가
ru: Ссылки на проект:предоплата с помощью outFile
zh_cn: 项目参考资料:在前面加上outFile

source: Project References: tsc -b Commandline
es: Referencias del proyecto:tsc -b Línea de mando
ko: 프로젝트 참조 : tsc -b 명령 줄
ru: Ссылки на проект:tsc -b Командная строка
zh_cn: 项目参考:tsc -b命令行

source: Project references are a new feature in TypeScript 3.0 that allow you to structure your TypeScript programs into smaller pieces.
es: Las referencias de proyectos son una nueva característica de TypeScript 3.0 que permite estructurar los programas de TypeScript en piezas más pequeñas.
ko: 프로젝트 참조는 TypeScript 3.0의 새로운 기능으로 TypeScript 프로그램을 더 작은 조각으로 구성 할 수 있습니다.
ru: Ссылки на проекты-это новая возможность в TypeScript 3.0,которая позволяет структурировать ваши программы TypeScript на более мелкие части.
zh_cn: 项目引用是TypeScript 3.0中的一个新特性,它允许你把你的TypeScript程序结构成更小的片段。

source: Project references can solve all of these problems and more.
es: Las referencias de los proyectos pueden resolver todos estos problemas y más.
ko: 프로젝트 참조는 이러한 모든 문제 등을 해결할 수 있습니다.
ru: Ссылки на проекты могут решить все эти проблемы и многое другое.
zh_cn: 项目参考资料可以解决所有这些问题,甚至更多。

source: Project references have a few trade-offs you should be aware of.
es: Las referencias de los proyectos tienen algunas compensaciones que debes tener en cuenta.
ko: 프로젝트 참조에는 알아야 할 몇 가지 상충 관계가 있습니다.
ru: Ссылки на проекты имеют несколько компромиссов,о которых вам следует знать.
zh_cn: 项目参考书有一些取舍,你应该注意。

source: Project support through <code>tsconfig.json</code>
es: Soporte de proyectos a trav&eacute;s de <code>tsconfig.json</code>
ko: <code>tsconfig.json</code> 을 통한 프로젝트 지원
ru: Поддержка проекта через <code>tsconfig.json</code>
zh_cn: 通过 <code>tsconfig.json</code> 提供项目支持

source: Properties are inferred from assignments in class bodies
es: Las propiedades se infieren de las asignaciones en los cuerpos de clase
ko: 클래스 본문의 할당에서 속성이 유추됩니다
ru: Свойства выводятся из назначений в телах классов
zh_cn: 属性是由类体中的赋值推断出来的。

source: Properties declarations on functions
es: Declaraciones de propiedades en las funciones
ko: 함수에 대한 속성 선언
ru: Декларации о свойствах функций
zh_cn: 函数的属性声明

source: Properties in the object binding pattern that have no match in the object literal are required to have a default value in the object binding pattern and are automatically added to the object literal type.
es: Las propiedades en el patrón de unión de objetos que no tienen coincidencia en el literal del objeto deben tener un valor por defecto en el patrón de unión de objetos y se añaden automáticamente al tipo de literal del objeto.
ko: 객체 리터럴과 일치하지 않는 객체 바인딩 패턴의 속성은 객체 바인딩 패턴에 기본값이 있어야하며 객체 리터럴 유형에 자동으로 추가됩니다.
ru: Свойства в шаблоне объектной привязки,не имеющие совпадения в литерале объекта,должны иметь значение по умолчанию в шаблоне объектной привязки и автоматически добавляются к типу объект-литерал.
zh_cn: 在对象绑定模式中没有匹配的属性,在对象绑定模式中需要有一个默认值,并自动添加到对象文字类型中。

source: Properties in the object literal that have no match in the object binding pattern are an error.
es: Las propiedades en el literal del objeto que no coinciden con el patrón de unión del objeto son un error.
ko: 객체 바인딩 패턴과 일치하지 않는 객체 리터럴의 속성은 오류입니다.
ru: Свойства в буквальном объекте,не имеющие совпадения в шаблоне привязки объекта,являются ошибкой.
zh_cn: 对象文字中的属性如果在对象绑定模式中没有匹配,则是一个错误。

source: Properties with default values in the object binding pattern become optional in the object literal.
es: Las propiedades con valores por defecto en el patrón de unión de objetos se convierten en opcionales en el literal de objetos.
ko: 객체 바인딩 패턴에 기본값이있는 속성은 객체 리터럴에서 선택 사항이됩니다.
ru: Свойства со значениями по умолчанию в шаблоне привязки объектов становятся необязательными в буквальном значении объекта.
zh_cn: 在对象绑定模式中具有默认值的属性在对象文字中成为可选的。

source: Property Decorators
es: Decoradores de propiedades
ko: 부동산 데코레이터
ru: Декораторы недвижимости
zh_cn: 房产装饰公司

source: Property assignments and non-generic spread expressions are merged to the greatest extent possible on either side of a generic spread expression. For example:
es: Las cesiones de propiedad y las expresiones de difusión no genéricas se fusionan en la mayor medida posible a ambos lados de una expresión de difusión genérica.Por ejemplo:
ko: 속성 할당과 제네릭이 아닌 스프레드 식은 일반 스프레드 식의 양쪽에서 최대한 병합됩니다. 예를 들면 다음과 같습니다.
ru: Присвоения свойств и не генерические выражения спреда максимально объединяются по обеим сторонам общего выражения спреда.Например:
zh_cn: 属性赋值和非通用展转表达式在通用展转表达式的两边最大程度地合并。例如:

source: Property renaming
es: El renombramiento de la propiedad
ko: 속성 이름 바꾸기
ru: Переименование недвижимости
zh_cn: 财产重命名

source: Prototype assignment
es: Asignación del prototipo
ko: 프로토 타입 할당
ru: Назначение прототипов
zh_cn: 原型任务

source: Provide full support for iterables in <code>for..of</code>, spread and destructuring when targeting ES5 or ES3.
es: Brindar soporte completo para iterables en <code>for..of</code> , spread y desestructuraci&oacute;n cuando se dirigen a ES5 o ES3.
ko: ES5 또는 ES3을 대상으로 할 때 반복 , 파괴 및 <code>for..of</code> 에서 이터 러블 을 완벽하게 지원합니다 .
ru: Обеспечьте полную поддержку итераций в <code>for..of</code> , распространении и деструктуризации при ориентации на ES5 или ES3.
zh_cn: 以ES5或ES3为目标时，针对 <code>for..of</code> ，传播和解构中的可迭代项提供全面支持。

source: Public by default
es: Público por defecto
ko: 기본적으로 공개
ru: Публично по умолчанию
zh_cn: 默认为公开

source: Public, private, and protected modifiers
es: Modificadores públicos,privados y protegidos
ko: 공개, 개인 및 보호 수정 자
ru: Государственные,частные и защищенные модификаторы
zh_cn: 公共、私人和受保护的修饰词

source: Publish to <a href="https://www.npmjs.com/~types">@types</a>
es: Publicar en <a href="https://www.npmjs.com/~types">@types</a>
ko: <a href="https://www.npmjs.com/~types">@types에</a> 게시
ru: Опубликовать в <a href="https://www.npmjs.com/~types">@types</a>
zh_cn: 发布到<a href="https://www.npmjs.com/~types">@types</a>

source: Publish to npm
es: Publicar a npm
ko: npm에 게시
ru: Публикация в воскресенье
zh_cn: 发布到npm

source: Publishing: Dependencies
es: Publicación:Dependencias
ko: 게시 : 종속성
ru: Публикации:Зависимости
zh_cn: 出版:依赖性

source: Publishing: Publish to @types
es: Publicación:Publicar a @tipos
ko: 게시 : @types에 게시
ru: Публикация:Публикация в @типах
zh_cn: 发布:发布到@类型

source: Publishing: Red flags
es: Publicación:Banderas rojas
ko: 출판 : 적기
ru: Публикации:Красные флаги
zh_cn: 出版:红旗
