Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/typescript/typescript.*.003.xlf
Languages: es, ko, ru, zh_cn

source: Instead of a relatively useless type like <code>(x: {}) =&gt; Box&lt;{}[]&gt;</code>, which older versions of the language would infer, TypeScript 3.4&rsquo;s inference allows <code>newFn</code> to be generic. Its new type is <code>&lt;T&gt;(x: T) =&gt; Box&lt;T[]&gt;</code>.
es: En lugar de un tipo relativamente in&uacute;til como <code>(x: {}) =&gt; Box&lt;{}[]&gt;</code> , que inferir&iacute;an versiones anteriores del lenguaje, la inferencia de TypeScript 3.4 permite que <code>newFn</code> sea ​​gen&eacute;rico. Su nuevo tipo es <code>&lt;T&gt;(x: T) =&gt; Box&lt;T[]&gt;</code> .
ko: 이전 버전의 언어에서 추론 할 수있는 <code>(x: {}) =&gt; Box&lt;{}[]&gt;</code> 와 같이 비교적 쓸모없는 유형 대신 TypeScript 3.4의 추론을 통해 <code>newFn</code> 을 일반화 할 수 있습니다. 새로운 유형은 <code>&lt;T&gt;(x: T) =&gt; Box&lt;T[]&gt;</code> 입니다.

source: Instead of importing helpers with <a href="#importHelpers"><code>importHelpers</code></a>, you can provide implementations in the global scope for the helpers you use and completely turn off emitting of helper functions.
ko: <a href="#importHelpers"> <code>importHelpers</code> </a> 를 사용하여 도우미를 가져 오는 대신 사용하는 도우미에 대한 전역 범위의 구현을 제공하고 도우미 함수의 방출을 완전히 끌 수 있습니다.

source: Instead of working with any and all types, we&rsquo;d like to constrain this function to work with any and all types that also have the <code>.length</code> property. As long as the type has this member, we&rsquo;ll allow it, but it&rsquo;s required to have at least this member. To do so, we must list our requirement as a constraint on what T can be.
es: En lugar de trabajar con todos y cada uno de los tipos, nos gustar&iacute;a restringir esta funci&oacute;n para que funcione con todos los tipos que tambi&eacute;n tengan la propiedad <code>.length</code> . Siempre que el tipo tenga este miembro, lo permitiremos, pero se requiere tener al menos este miembro. Para hacerlo, debemos enumerar nuestro requisito como una restricci&oacute;n sobre lo que puede ser T.
ko: 모든 유형의 작업을 수행하는 대신이 함수가 <code>.length</code> 속성 이있는 모든 유형에서 작동하도록 제한 하려고 합니다. 유형에이 멤버가있는 한 허용하지만 최소한이 멤버가 있어야합니다. 그렇게하려면 T가 무엇인지에 대한 제약 조건으로 요구 사항을 나열해야합니다.

source: Instead, use the types <code>number</code>, <code>string</code>, <code>boolean</code>, <code>object</code> and <code>symbol</code>.
ko: 대신 <code>number</code> , <code>string</code> , <code>boolean</code> , <code>object</code> 및 <code>symbol</code> 유형을 사용하십시오 .

source: Instead, we need a way of capturing the type of the argument in such a way that we can also use it to denote what is being returned. Here, we will use a <em>type variable</em>, a special kind of variable that works on types rather than values.
es: En cambio, necesitamos una forma de capturar el tipo de argumento de tal manera que tambi&eacute;n podamos usarlo para denotar lo que se est&aacute; devolviendo. Aqu&iacute;, usaremos una <em>variable de tipo</em> , un tipo especial de variable que trabaja con tipos en lugar de valores.
ko: 대신에, 우리는 또한 반환되는 것을 나타 내기 위해 그것을 사용할 수있는 방식으로 인수의 유형을 캡처하는 방법이 필요합니다. 여기서는 값이 아닌 유형에서 작동하는 특수한 <em>유형의 변수</em> 인 <em>type variable</em> 을 사용 합니다.

source: Instead, we need to pass in values whose type has all the required properties:
es: En cambio,necesitamos pasar valores cuyo tipo tenga todas las propiedades requeridas:
ko: 대신 유형에 필요한 모든 속성이있는 값을 전달해야합니다.

source: Instead, you would need to work with the static side of the class directly. In this example, we define two interfaces, <code>ClockConstructor</code> for the constructor and <code>ClockInterface</code> for the instance methods. Then, for convenience, we define a constructor function <code>createClock</code> that creates instances of the type that is passed to it:
es: En cambio, necesitar&iacute;a trabajar directamente con el lado est&aacute;tico de la clase. En este ejemplo, definimos dos interfaces, <code>ClockConstructor</code> para el constructor y <code>ClockInterface</code> para los m&eacute;todos de instancia. Luego, por conveniencia, definimos una funci&oacute;n constructora <code>createClock</code> que crea instancias del tipo que se le pasa:
ko: 대신 클래스의 정적 측면을 직접 사용해야합니다. 이 예제에서는 생성자를 위한 <code>ClockInterface</code> 와 인스턴스 메소드를위한 <code>ClockConstructor</code> 두 가지 인터페이스를 정의 합니다. 그런 다음 편의상 전달 된 형식의 인스턴스를 만드는 생성자 함수 <code>createClock</code> 을 정의 합니다.

source: Integrating with Build Tools
es: Integración con las herramientas de construcción
ko: 빌드 도구와 통합

source: Integrating with Build Tools: Babel
es: Integrándose con las herramientas de construcción:Babel
ko: 빌드 도구와 통합 : Babel

source: Integrating with Build Tools: Browserify
es: Integrándose con las herramientas de construcción:Navegue por
ko: 빌드 도구와 통합 : Browserify

source: Integrating with Build Tools: Duo
es: Integrándose con las herramientas de construcción:Dúo
ko: 빌드 도구와 통합 : Duo

source: Integrating with Build Tools: Grunt
es: Integrándose con las herramientas de construcción:Grunt
ko: 빌드 툴과 통합 : Grunt

source: Integrating with Build Tools: Gulp
es: Integrándose con las herramientas de construcción:Gulp
ko: 빌드 도구와 통합 : Gulp

source: Integrating with Build Tools: Jspm
es: Integrándose con las herramientas de construcción:Jspm
ko: 빌드 도구와 통합 : Jspm

source: Integrating with Build Tools: MSBuild
es: Integrándose con las herramientas de construcción:MSBuild
ko: 빌드 도구와 통합 : MSBuild

source: Integrating with Build Tools: NuGet
es: Integrándose con las herramientas de construcción:NuGet
ko: 빌드 도구와 통합 : NuGet

source: Integrating with Build Tools: Webpack
es: Integrándose con las herramientas de construcción:Webpack
ko: 빌드 도구와 통합 : Webpack

source: Interested in learning more?
ko: 자세한 내용을 알고 싶으십니까?

source: Interfaces Extending Classes
es: Interfaces que amplían las clases
ko: 클래스 확장 인터페이스

source: Interfaces are capable of describing the wide range of shapes that JavaScript objects can take. In addition to describing an object with properties, interfaces are also capable of describing function types.
es: Las interfaces son capaces de describir el amplio rango de formas que los objetos de JavaScript pueden tomar.Además de describir un objeto con propiedades,las interfaces también son capaces de describir tipos de funciones.
ko: 인터페이스는 JavaScript 객체가 취할 수있는 광범위한 모양을 설명 할 수 있습니다. 속성이있는 객체를 설명하는 것 외에도 인터페이스는 함수 유형을 설명 할 수 있습니다.

source: Interfaces describe the public side of the class, rather than both the public and private side. This prohibits you from using them to check that a class also has particular types for the private side of the class instance.
es: Las interfaces describen el lado público de la clase,más que el lado público y el privado.Esto te prohíbe usarlas para comprobar que una clase también tiene tipos particulares para la parte privada de la instancia de la clase.
ko: 인터페이스는 공개 및 비공개 측면이 아니라 클래스의 공개 측면을 설명합니다. 이렇게하면 클래스를 사용하여 클래스에 클래스 인스턴스의 전용 측면에 대한 특정 유형이 있는지 확인할 수 없습니다.

source: Interfaces vs. Type Aliases
es: Interfaces vs.Alias de tipo
ko: 인터페이스 대 유형 별명

source: Interfaces with optional properties are written similar to other interfaces, with each optional property denoted by a <code>?</code> at the end of the property name in the declaration.
es: Las interfaces con propiedades opcionales se escriben de manera similar a otras interfaces, con cada propiedad opcional indicada por un <code>?</code> al final del nombre de la propiedad en la declaraci&oacute;n.
ko: 선택적 속성이있는 인터페이스는 다른 인터페이스와 유사하게 작성되며 각 선택적 속성은 <code>?</code> 선언에서 속성 이름 끝에

source: Intersection Types
es: Tipos de intersección
ko: 교차로 유형

source: Intersection and Union types are one of the ways in which you can compose types.
ko: 교차 및 공용체 유형은 유형을 구성 할 수있는 방법 중 하나입니다.

source: Intersection types
es: Tipos de intersección
ko: 교차로 유형

source: Intersection types are closely related to union types, but they are used very differently. An intersection type combines multiple types into one. This allows you to add together existing types to get a single type that has all the features you need. For example, <code>Person &amp; Serializable &amp; Loggable</code> is a type which is all of <code>Person</code><em>and</em><code>Serializable</code><em>and</em><code>Loggable</code>. That means an object of this type will have all members of all three types.
ko: 교차 유형은 공용체 유형과 밀접한 관련이 있지만 매우 다르게 사용됩니다. 교차 유형은 여러 유형을 하나로 결합합니다. 이를 통해 기존 유형을 함께 추가하여 필요한 모든 기능을 갖춘 단일 유형을 얻을 수 있습니다. 예를 들어, <code>Person &amp; Serializable &amp; Loggable</code> 은 모두 <code>Person</code> <em>및 </em> <code>Serializable</code> <em>및 </em> <code>Loggable</code> 인 유형입니다 . 즉,이 유형의 개체는 세 가지 유형의 모든 구성원을 갖습니다.

source: Intrinsic String Manipulation Types
ko: 내장 문자열 조작 유형

source: Intrinsic elements
es: Elementos intrínsecos
ko: 본질적인 요소

source: Intrinsic elements are looked up on the special interface <code>JSX.IntrinsicElements</code>. By default, if this interface is not specified, then anything goes and intrinsic elements will not be type checked. However, if this interface <em>is</em> present, then the name of the intrinsic element is looked up as a property on the <code>JSX.IntrinsicElements</code> interface. For example:
es: Los elementos intr&iacute;nsecos se <code>JSX.IntrinsicElements</code> en la interfaz especial JSX.IntrinsicElements . De forma predeterminada, si no se especifica esta interfaz, todo vale y los elementos intr&iacute;nsecos no se comprobar&aacute;n el tipo. Sin embargo, si esta interfaz <em>est&aacute;</em> presente, el nombre del elemento intr&iacute;nseco se busca como una propiedad en la interfaz <code>JSX.IntrinsicElements</code> . Por ejemplo:
ko: 내장 요소는 특수 인터페이스 <code>JSX.IntrinsicElements</code> 에서 조회 됩니다. 기본적으로이 인터페이스를 지정하지 않으면 모든 것이 진행되고 내장 요소는 유형 검사되지 않습니다. 그러나이 인터페이스 <em>가</em> 있으면 내장 요소의 이름이 <code>JSX.IntrinsicElements</code> 인터페이스 의 특성으로 검색 됩니다. 예를 들면 다음과 같습니다.

source: Intro to the TSConfig Reference
ko: TSConfig 참조 소개

source: Introduction to the DOM
ko: DOM 소개

source: Introduction: Deep Dive
es: Introducción:Inmersión profunda
ko: 소개 : 딥 다이브

source: Introduction: Find and Install Declaration Files
es: Introducción:Buscar e instalar archivos de declaración
ko: 소개 : 선언 파일 찾기 및 설치

source: Introduction: Library Structures
es: Introducción:Estructuras de la biblioteca
ko: 소개 : 라이브러리 구조

source: Introduction: Publish to npm
es: Introducción:Publicar a npm
ko: 소개 : npm에 게시

source: Introduction: Sections
es: Introducción:Secciones
ko: 소개 : 섹션

source: Introduction: Templates
es: Introducción:Plantillas
ko: 소개 : 템플릿

source: Introduction: “Do”s and “Don’t”s
es: Introducción:"Lo que se debe y lo que no se debe hacer
ko: 소개 :&ldquo;할 일&rdquo;및&ldquo;하지 말 것&rdquo;

source: Invoking <code>tsc</code> twice incurs more startup time overhead
es: Invocar <code>tsc</code> dos veces supone una mayor sobrecarga de tiempo de inicio
ko: <code>tsc</code> 를 두 번 호출하면 더 많은 시작 시간 오버 헤드가 발생합니다

source: Invoking the compiler with <code>--alwaysStrict</code> causes:
es: Invocar el compilador con <code>--alwaysStrict</code> causas:
ko: <code>--alwaysStrict</code> 를 사용 하여 컴파일러를 호출하면 다음이 발생합니다.

source: Invoking the compiler with <code>--traceResolution</code>
es: Invocar el compilador con <code>--traceResolution</code>
ko: <code>--traceResolution</code> 을 사용 하여 컴파일러 호출

source: Is your build output mostly the same as your source input files? Use <code>tsc</code>
ko: 빌드 출력이 소스 입력 파일과 거의 동일합니까? <code>tsc</code> 사용

source: Isolated Modules - <code>isolatedModules</code>
ko: 절연 모듈- <code>isolatedModules</code> 모듈

source: It also ships with a mapped type <code>Readonly&lt;T&gt;</code> that makes all properties <code>readonly</code>:
ko: 또한 모든 속성을 <code>readonly</code> 만드는 매핑 된 유형 <code>Readonly&lt;T&gt;</code> 와 함께 제공됩니다 .

source: It can also be used as a global variable, but only inside of a script. (A script is a file with no imports or exports.)
es: También se puede usar como una variable global,pero sólo dentro de un guión.(Un script es un archivo sin importaciones ni exportaciones).
ko: 전역 변수로도 사용할 수 있지만 스크립트 내에서만 사용할 수 있습니다. (스크립트는 가져 오기 또는 내보내기가없는 파일입니다.)

source: It can also be used to create simple namespaces:
es: También se puede usar para crear espacios de nombres simples:
ko: 간단한 네임 스페이스를 만드는 데 사용할 수도 있습니다.

source: It can be tempting to think that the types <code>Number</code>, <code>String</code>, <code>Boolean</code>, <code>Symbol</code>, or <code>Object</code> are the same as the lowercase versions recommended above. These types do not refer to the language primitives however, and almost never should be used as a type.
ko: <code>Number</code> , <code>String</code> , <code>Boolean</code> , <code>Symbol</code> 또는 <code>Object</code> 유형 이 위에서 권장 한 소문자 버전과 동일 하다고 생각하고 싶을 수 있습니다 . 그러나 이러한 유형은 언어 프리미티브를 참조하지 않으며 거의 ​​유형으로 사용되어서는 안됩니다.

source: It does not change the behavior of your code, or otherwise change the behavior of TypeScript&rsquo;s checking and emitting process.
ko: 코드의 동작을 변경하거나 TypeScript의 검사 및 방출 프로세스의 동작을 변경하지 않습니다.

source: It does not have an initializer and the preceding enum member was a <em>numeric</em> constant. In this case the value of the current enum member will be the value of the preceding enum member plus one.
es: No tiene un inicializador y el miembro de enumeraci&oacute;n anterior era una constante <em>num&eacute;rica</em> . En este caso, el valor del miembro de enumeraci&oacute;n actual ser&aacute; el valor del miembro de enumeraci&oacute;n anterior m&aacute;s uno.
ko: 이니셜 라이저가 없으며 앞의 열거 형 멤버가 <em>숫자</em> 상수였습니다. 이 경우 현재 열거 형 멤버의 값은 선행 열거 형 멤버의 값에 1을 더한 값이됩니다.

source: It is a common pattern to return the current object (i.e. <code>this</code>) from a method to create <a href="https://en.wikipedia.org/wiki/Fluent_interface">fluent-style APIs</a>. For instance, consider the following <code>BasicCalculator</code> module:
es: Es un patr&oacute;n com&uacute;n devolver el objeto actual (es decir, <code>this</code> ) de un m&eacute;todo para crear <a href="https://en.wikipedia.org/wiki/Fluent_interface">API de estilo fluido</a> . Por ejemplo, considere el siguiente m&oacute;dulo <code>BasicCalculator</code> :
ko: <a href="https://en.wikipedia.org/wiki/Fluent_interface">유창한 스타일의 API</a> 를 생성하는 메소드에서 현재 객체 (예 : <code>this</code> ) 를 반환하는 일반적인 패턴 입니다. 예를 들어 다음 <code>BasicCalculator</code> 모듈을 고려하십시오 .

source: It is a compile time error for constant enum expressions to be evaluated to <code>NaN</code> or <code>Infinity</code>.
es: Es un error de tiempo de compilaci&oacute;n para que las expresiones de enumeraci&oacute;n constante se eval&uacute;en en <code>NaN</code> o <code>Infinity</code> .
ko: 상수 열거 형 표현식이 <code>NaN</code> 또는 <code>Infinity</code> 로 평가되는 것은 컴파일 시간 오류입니다 .

source: It is also worth noting that, for Node.js applications, modules are the default and <strong>we recommended modules over namespaces in modern code</strong>.
ko: Node.js 애플리케이션의 경우 모듈이 기본값이며 <strong>현대 코드에서 네임 스페이스보다 모듈을 권장</strong> 한다는 점도 주목할 가치가 <strong>있습니다</strong> .

source: It is also worth noting that, for Node.js applications, modules are the default and the recommended approach to structure your code.
es: También cabe señalar que,para las aplicaciones de Node.js,los módulos son el enfoque predeterminado y recomendado para estructurar su código.
ko: Node.js 응용 프로그램의 경우 모듈이 기본이며 코드를 구성하는 데 권장되는 방법이라는 점도 주목할 가치가 있습니다.

source: It is an error to reference a file that does not exist. It is an error for a file to have a triple-slash reference to itself.
es: Es un error hacer referencia a un archivo que no existe.Es un error que un archivo tenga una referencia de triple barra a sí mismo.
ko: 존재하지 않는 파일을 참조하는 것은 오류입니다. 파일 자체에 트리플 슬래시 참조가있는 것은 오류입니다.

source: It is important to note that it is an error to call a function with too many arguments.
es: Es importante señalar que es un error llamar a una función con demasiados argumentos.
ko: 너무 많은 인수를 가진 함수를 호출하는 것은 오류라는 점에 유의해야합니다.

source: It is important to note that the compiler will <em>not</em> perform any of these transformations; it just uses these pieces of information to guide the process of resolving a module import to its definition file.
es: Es importante notar que el compilador <em>no</em> realizar&aacute; ninguna de estas transformaciones; simplemente usa estos datos para guiar el proceso de resoluci&oacute;n de la importaci&oacute;n de un m&oacute;dulo a su archivo de definici&oacute;n.
ko: 컴파일러는 이러한 변환을 수행하지 <em>않습니다</em> . 단지 이러한 정보를 사용하여 모듈 가져 오기를 정의 파일로 해결하는 프로세스를 안내합니다.

source: It is not a mechanism that <strong>prevents</strong> a file from being included in the codebase - it simply changes what the <code>include</code> setting finds.
ko: 파일이 코드베이스에 포함되는 <strong>것을 방지</strong> 하는 메커니즘이 아닙니다. 단순히 <code>include</code> 설정이 찾은 내용을 변경합니다 .

source: It is not possible to use <code>infer</code> declarations in constraint clauses for regular type parameters:
es: No es posible utilizar declaraciones <code>infer</code> idas en cl&aacute;usulas de restricci&oacute;n para par&aacute;metros de tipo regular:
ko: 일반 유형 매개 변수에 대한 제한 조건 절에서 <code>infer</code> 선언 을 사용할 수 없습니다 .

source: It is possible to define the type of a class component. However, to do so it is best to understand two new terms: the <em>element class type</em> and the <em>element instance type</em>.
es: Es posible definir el tipo de componente de una clase. Sin embargo, para hacerlo, es mejor comprender dos t&eacute;rminos nuevos: el <em>tipo de clase de elemento</em> y el <em>tipo de instancia de elemento</em> .
ko: 클래스 구성 요소의 유형을 정의 할 수 있습니다. 그러나 그렇게하려면 <em>요소 클래스 유형</em> 과 <em>요소 인스턴스 유형의</em> 두 가지 새로운 용어를 이해하는 것이 가장 좋습니다 .

source: It is the first member in the enum and it has no initializer, in which case it&rsquo;s assigned the value <code>0</code>:
es: Es el primer miembro de la enumeraci&oacute;n y no tiene inicializador, en cuyo caso se le asigna el valor <code>0</code> :
ko: 열거 형의 첫 번째 멤버이며 초기화 프로그램이 없으므로 <code>0</code> 값이 할당됩니다 .

source: It is worth noting that if the npm package already includes its declaration file as described in <a href="publishing">Publishing</a>, downloading the corresponding <code>@types</code> package is not needed.
es: Vale la pena se&ntilde;alar que si el paquete npm ya incluye su archivo de declaraci&oacute;n como se describe en <a href="publishing">Publicaci&oacute;n</a> , no es necesario descargar el paquete <code>@types</code> correspondiente .
ko: npm 패키지에 <a href="publishing">Publishing에</a> 설명 된대로 선언 파일이 이미 포함되어 있으면 해당 <code>@types</code> 패키지를 다운로드 할 필요가 없습니다.

source: It just so happens that TypeScript has something called a <em>type guard</em>. A type guard is some expression that performs a runtime check that guarantees the type in some scope.
es: Da la casualidad de que TypeScript tiene algo llamado <em>tipo protector</em> . Una protecci&oacute;n de tipo es una expresi&oacute;n que realiza una verificaci&oacute;n en tiempo de ejecuci&oacute;n que garantiza el tipo en alg&uacute;n &aacute;mbito.
ko: TypeScript에는 <em>type guard</em> 라는 것이 있습니다. 타입 가드는 타입을 보장하는 런타임 검사를 수행하는 표현식입니다.

source: It was possible for the implementation files to import the test files
es: Fue posible para los archivos de implementación importar los archivos de prueba
ko: 구현 파일이 테스트 파일을 가져올 수있었습니다.

source: It wasn&rsquo;t possible to build <code>test</code> and <code>src</code> at the same time without having <code>src</code> appear in the output folder name, which you probably don&rsquo;t want
es: No fue posible compilar <code>test</code> y <code>src</code> al mismo tiempo sin que <code>src</code> apareciera en el nombre de la carpeta de salida, lo que probablemente no quieras
ko: 출력 폴더 이름에 <code>src</code> 가 나타나지 않으면 <code>test</code> 와 <code>src</code> 를 동시에 빌드 할 수 없었습니다.

source: It would be an error to specify <code>rootDir</code> as <code>core</code><em>and</em><code>include</code> as <code>*</code> because it creates a file (<code>helpers.ts</code>) that would need to be emitted <em>outside</em> the <code>outDir</code> (i.e. <code>../helpers.js</code>).
ko: 지정하면 오류가 발생 될 <code>rootDir</code> 같이 <code>core</code> <em>및 </em> <code>include</code> 으로 <code>*</code> 이 파일 (생성하기 때문에 <code>helpers.ts</code> 방출 될 필요가있을 것이다) <em>외부 </em> <code>outDir</code> (즉 <code>../helpers.js</code> 을 ).

source: It would be much better if once we performed the check, we could know the type of <code>pet</code> within each branch.
ko: 한 번 확인을하면 각 지점 내 에서 <code>pet</code> 의 종류를 알 수 있다면 훨씬 더 좋을 것 입니다.

source: It&rsquo;s also common to try to access a method before <code>await</code>-ing or <code>.then()</code>-ing a <code>Promise</code>. This is another example, among many others, where we&rsquo;re able to do better.
es: Tambi&eacute;n es com&uacute;n intentar acceder a un m&eacute;todo antes de <code>await</code> <code>.then()</code> o .luego () -ing una <code>Promise</code> . Este es otro ejemplo, entre muchos otros, en los que podemos hacerlo mejor.
ko: 그것은 이전하는 방법에 액세스하려고하는 것이 일반적입니다 <code>await</code> 를 -ing 나 <code>.then()</code> -ing <code>Promise</code> . 이것은 우리가 더 잘할 수있는 다른 많은 사례 중 하나입니다.

source: It&rsquo;s also important to note that TypeScript doesn&rsquo;t transform references to <code>globalThis</code> when compiling to older versions of ECMAScript. As such, unless you&rsquo;re targeting evergreen browsers (which already support <code>globalThis</code>), you may want to <a href="https://github.com/ljharb/globalThis">use an appropriate polyfill</a> instead.
es: Tambi&eacute;n es importante tener en cuenta que TypeScript no transforma las referencias a <code>globalThis</code> al compilar versiones anteriores de ECMAScript. Como tal, a menos que est&eacute; apuntando a navegadores de hoja perenne (que ya son compatibles con <code>globalThis</code> ), es posible que desee <a href="https://github.com/ljharb/globalThis">utilizar un polyfill apropiado en su</a> lugar.
ko: 또한 TypeScript는 이전 버전의 ECMAScript로 컴파일 할 때 <code>globalThis</code> 에 대한 참조를 변환하지 않습니다 . 따라서 이미 <code>globalThis</code> 를 지원하는 상록 브라우저를 대상으로하지 않는 <a href="https://github.com/ljharb/globalThis">한 적절한 polyfill을</a> 대신 사용할 수 있습니다 .

source: It&rsquo;s always nice to be able to document your configuration! <code>tsconfig.json</code> now accepts single and multi-line comments.
es: &iexcl;Siempre es bueno poder documentar su configuraci&oacute;n! <code>tsconfig.json</code> ahora acepta comentarios de una o varias l&iacute;neas.
ko: 구성을 문서화 할 수있는 것이 좋습니다. <code>tsconfig.json</code> 은 이제 한 줄 및 여러 줄 주석을 허용합니다.

source: It&rsquo;s an error to destructure a tuple beyond the range of its elements:
es: Es un error desestructurar una tupla m&aacute;s all&aacute; del rango de sus elementos:
ko: 요소의 범위를 넘어 튜플을 구조화하는 것은 오류입니다.

source: It&rsquo;s important in this situation to not prepend at each reference, because you&rsquo;ll end up with two copies of <code>A</code> in the output of <code>D</code> - this can lead to unexpected results.
es: En esta situaci&oacute;n, es importante no anteponer cada referencia, porque terminar&aacute; con dos copias de <code>A</code> en la salida de <code>D</code> ; esto puede llevar a resultados inesperados.
ko: 이 상황에서 각 참조 앞에 붙지 않는 것이 중요합니다. <code>D</code> 의 출력에서 <code>A</code> 의 사본 두 개로 끝나기 때문에 예기치 않은 결과가 발생할 수 있습니다.

source: It&rsquo;s important to note that awesome-typescript-loader will need to run before any other loader that deals with <code>.js</code> files.
es: Es importante tener en cuenta que awesome-typescript-loader deber&aacute; ejecutarse antes que cualquier otro cargador que se <code>.js</code> archivos .js .
ko: <code>.js</code> 파일 을 처리하는 다른 로더보다 먼저 awesome-typescript-loader를 실행해야 합니다.

source: It&rsquo;s important to note that ts-loader will need to run before any other loader that deals with <code>.js</code> files.
ko: <code>.js</code> 파일 을 처리하는 다른 로더보다 먼저 ts-loader를 실행해야 합니다.
