Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/typescript/typescript.*.003.xlf
Languages: es, ko, ru, zh_cn

source: This check is a breaking change, but for that reason the checks are very conservative. This error is only issued in <code>if</code> conditions, and it is not issued on optional properties, if <code>strictNullChecks</code> is off, or if the function is later called within the body of the <code>if</code>:
ru: Эта проверка является критическим изменением, но по этой причине проверки очень консервативны. Эта ошибка выдается только в условиях <code>if</code> и не выдается для необязательных свойств, если <code>strictNullChecks</code> отключен, или если функция позже вызывается в теле <code>if</code> :
zh_cn: 此检查是一项重大更改，但是由于这个原因，检查非常保守。仅在 <code>if</code> 条件下才发出此错误，并且在 <code>strictNullChecks</code> 关闭时或者以后在 <code>if</code> 的正文中调用该函数时，不会在可选属性上发出此错误：

source: This comparison process proceeds recursively, exploring the type of each member and sub-member.
ru: Этот процесс сравнения проходит рекурсивно,исследуя тип каждого члена и суб-членов.
zh_cn: 这个比较过程循环进行,探索每个成员和子成员的类型。

source: This config file will include <em>all</em> packages under <code>./typings</code>, and no packages from <code>./node_modules/@types</code>.
ru: Этот файл конфигурации будет включать <em>все</em> пакеты из <code>./typings</code> и не будет включать пакеты из <code>./node_modules/@types</code> .
zh_cn: 这个配置文件将包括<em>所有的</em>下包 <code>./typings</code> 的，并没有包 <code>./node_modules/@types</code> 。

source: This creates a <code>package.json</code> file with default values.
ru: Это создает файл <code>package.json</code> со значениями по умолчанию.
zh_cn: 这将创建一个具有默认值的 <code>package.json</code> 文件。

source: This creates new variables <code>a</code> and <code>b</code> from <code>o.a</code> and <code>o.b</code>. Notice that you can skip <code>c</code> if you don&rsquo;t need it.
ru: Это создает новые переменные <code>a</code> и <code>b</code> из <code>o.a</code> и <code>o.b</code> . Обратите внимание, что вы можете пропустить <code>c</code> , если он вам не нужен.
zh_cn: 这 <code>a</code> 根据 <code>o.a</code> 和 <code>o.b</code> 创建新的变量a和 <code>b</code> 。请注意，如果不需要，可以跳过 <code>c</code> 。

source: This creates two new variables named <code>first</code> and <code>second</code>. This is equivalent to using indexing, but is much more convenient:
ru: Это создает две новые переменные с именами <code>first</code> и <code>second</code> . Это эквивалентно использованию индексации, но намного удобнее:
zh_cn: 这将创建两个名为 <code>first</code> 和 <code>second</code> 的新变量。这等效于使用索引，但是更加方便：

source: This directive allows a file to explicitly include an existing built-in <em>lib</em> file.
ru: Эта директива позволяет файлу явно включать существующий встроенный файл <em>lib</em> .
zh_cn: 该伪指令允许文件显式包含现有的内置<em>lib</em>文件。

source: This directive instructs the compiler to <em>not</em> include the default library (i.e. <code>lib.d.ts</code>) in the compilation. The impact here is similar to passing <code>--noLib</code> on the command line.
ru: Эта директива указывает компилятору <em>не</em> включать библиотеку по умолчанию (например, <code>lib.d.ts</code> ) в компиляцию. Воздействие здесь аналогично передаче <code>--noLib</code> в командной строке.
zh_cn: 该指令指示编译器在编译中<em>不</em>包括默认库（即 <code>lib.d.ts</code> ）。这里的影响类似于在命令行上传递 <code>--noLib</code> 。

source: This directive marks a file as a <em>default library</em>. You will see this comment at the top of <code>lib.d.ts</code> and its different variants.
ru: Эта директива отмечает файл как <em>библиотеку по умолчанию</em> . Вы увидите этот комментарий вверху <code>lib.d.ts</code> и его различных вариантов.
zh_cn: 此伪指令将文件标记为<em>默认库</em>。您将在 <code>lib.d.ts</code> 及其不同的变体顶部看到此注释。

source: This distinction is subtle and important &ndash; here, <code>A.B</code> is not necessarily a type or a value.
ru: Это тонкое и важное различие - здесь <code>A.B</code> не обязательно является типом или значением.
zh_cn: 这种区别是微妙而重要的&ndash;在这里， <code>A.B</code> 不一定是类型或值。

source: This example covers a few other features we didn&rsquo;t previously mention. Again, we see the <code>extends</code> keywords used to create two new subclasses of <code>Animal</code>: <code>Horse</code> and <code>Snake</code>.
ru: Этот пример охватывает несколько других функций, о которых мы ранее не упоминали. Снова мы видим ключевые слова <code>extends</code> , используемые для создания двух новых подклассов <code>Animal</code> : <code>Horse</code> и <code>Snake</code> .
zh_cn: 此示例涵盖了我们之前未提到的其他一些功能。再次，我们看到 <code>extends</code> 关键字用于创建 <code>Animal</code> 的两个新子类： <code>Horse</code> 和 <code>Snake</code> 。

source: This example shows the most basic inheritance feature: classes inherit properties and methods from base classes. Here, <code>Dog</code> is a <em>derived</em> class that derives from the <code>Animal</code><em>base</em> class using the <code>extends</code> keyword. Derived classes are often called <em>subclasses</em>, and base classes are often called <em>superclasses</em>.
ru: В этом примере показана самая основная функция наследования: классы наследуют свойства и методы от базовых классов. Здесь <code>Dog</code> - это <em>производный</em> класс, производный от <em>базового</em> класса <code>Animal</code> с использованием ключевого слова <code>extends</code> . Производные классы часто называют <em>подклассами</em> , а базовые классы часто называют <em>суперклассами</em> .<em></em><em></em><em></em>
zh_cn: 此示例显示了最基本的继承功能：类从基类继承属性和方法。在这里， <code>Dog</code> 是<em>派生</em>类，它是使用 <code>extends</code> 关键字从 <code>Animal</code> <em>基</em>类派生的。派生类通常称为<em>子类</em>，而基类通常称为<em>超类</em>。<em></em><em></em>

source: This feature can be extremely useful for bigger organizations, or projects with lots of distributed dependencies.
ru: Эта функция может быть чрезвычайно полезна для больших организаций или проектов с большим количеством распределенных зависимостей.
zh_cn: 这个功能对于较大的组织,或者有大量分布式依赖的项目来说是非常有用的。

source: This feature is currently supported in Visual Studio 2015 with TypeScript 1.8.4 and above, and <a href="https://github.com/TypeStrong/atom-typescript#compile-on-save">atom-typescript</a> plugin.
ru: Эта функция в настоящее время поддерживается в Visual Studio 2015 с TypeScript 1.8.4 и выше и подключаемым <a href="https://github.com/TypeStrong/atom-typescript#compile-on-save">модулем atom-typescript</a> .
zh_cn: 当前具有TypeScript 1.8.4及更高版本的Visual Studio 2015和<a href="https://github.com/TypeStrong/atom-typescript#compile-on-save">atom-typescript</a>插件均支持此功能。

source: This feature means that types that would otherwise be used just to hint immutability to the compiler can often be omitted.
ru: Эта особенность означает,что типы,которые в противном случае использовались бы просто для намека на неизменяемость компилятора,часто могут быть опущены.
zh_cn: 这个特性意味着,原本只是为了暗示编译器不可变而使用的类型通常可以被省略。

source: This feature was supported before TypeScript 2.1, but only when targeting ES6/ES2015. TypeScript 2.1 brings the capability to ES3 and ES5 run-times, meaning you&rsquo;ll be free to take advantage of it no matter what environment you&rsquo;re using.
ru: Эта функция поддерживалась до TypeScript 2.1, но только при ориентации на ES6 / ES2015. TypeScript 2.1 предоставляет возможности среды выполнения ES3 и ES5, а это означает, что вы можете свободно использовать его независимо от того, какую среду вы используете.
zh_cn: TypeScript 2.1之前支持此功能，但仅在以ES6 / ES2015为目标时才受支持。TypeScript 2.1为ES3和ES5运行时带来了该功能，这意味着无论您使用什么环境，都可以自由地利用它。

source: This gives bothPlus the value <code>[0, 1, 2, 3, 4, 5]</code>. Spreading creates a shallow copy of <code>first</code> and <code>second</code>. They are not changed by the spread.
ru: Это дает bothPlus значение <code>[0, 1, 2, 3, 4, 5]</code> . Распространение создает неглубокую копию <code>first</code> и <code>second</code> . Их не меняет спред.
zh_cn: 这使bothPlus的值 <code>[0, 1, 2, 3, 4, 5]</code> 。传播创建 <code>first</code> 和 <code>second</code> 的浅表副本。它们不会因传播而改变。

source: This gives the user a way of describing inner classes.
ru: Это дает пользователю возможность описания внутренних классов.
zh_cn: 这给用户提供了一种描述内部类的方法。

source: This guidance also ensures that the library can be transitioned to UMD without breaking declaration file users.
ru: Это руководство также гарантирует,что библиотека может быть перенесена в UMD без взлома пользователей файла декларации.
zh_cn: 这一指导也确保了库可以过渡到UMD,而不会破坏声明文件用户。

source: This guide is designed to teach you how to write a high-quality TypeScript Declaration File.
ru: Это руководство предназначено для того,чтобы научить вас,как написать высококачественный файл декларации TypeScript.
zh_cn: 本指南旨在教你如何编写一个高质量的TypeScript声明文件。

source: This guide will teach you how to wire up TypeScript with <a href="https://reactjs.org/">React</a> and <a href="https://webpack.js.org/">webpack</a>.
ru: Это руководство научит вас <a href="https://webpack.js.org/">подключать</a> TypeScript к <a href="https://reactjs.org/">React</a> и webpack .
zh_cn: 本指南将教您如何使用<a href="https://reactjs.org/">React</a>和<a href="https://webpack.js.org/">webpack</a>连接TypeScript 。

source: This happens often enough in JavaScript that TypeScript provides a way to create new types based on old types &mdash; <strong>mapped types</strong>. In a mapped type, the new type transforms each property in the old type in the same way. For example, you can make all properties of a type <code>readonly</code> or optional. Here are a couple of examples:
ru: В JavaScript это происходит достаточно часто, поэтому TypeScript предоставляет способ создания новых типов на основе старых типов - <strong>сопоставленных типов</strong> . В сопоставленном типе новый тип аналогичным образом преобразует каждое свойство старого типа. Например, вы можете сделать все свойства типа <code>readonly</code> или необязательными. Вот пара примеров:
zh_cn: 这在JavaScript中经常发生，TypeScript提供了一种基于旧类型（<strong>映射类型）</strong>创建新类型的方法。在映射类型中，新类型以相同的方式转换旧类型中的每个属性。例如，您可以将类型的所有属性设置为 <code>readonly</code> 或可选。以下是几个示例：

source: This has a very specific meaning: the <code>done</code> callback might be invoked with 1 argument or might be invoked with 2 arguments. The author probably intended to say that the callback might not care about the <code>elapsedTime</code> parameter, but there&rsquo;s no need to make the parameter optional to accomplish this &ndash; it&rsquo;s always legal to provide a callback that accepts fewer arguments.
ru: Это имеет очень конкретное значение: обратный вызов <code>done</code> может быть вызван с 1 аргументом или может быть вызван с 2 аргументами. Автор, вероятно, намеревался сказать, что обратный вызов может не заботиться о параметре <code>elapsedTime</code> , но для этого нет необходимости делать параметр необязательным - всегда законно предоставлять обратный вызов, который принимает меньше аргументов.
zh_cn: 这有一个非常具体的含义： <code>done</code> 回调可能使用1个参数调用，也可能使用2个参数调用。作者可能打算说回调可能并不关心 <code>elapsedTime</code> 参数，但是无需使参数成为可选参数即可完成此操作&ndash;提供接受较少参数的回调始终是合法的。

source: This has been one common source of duplicate definition errors. Multiple declaration files defining the same members on interfaces.
ru: Это был один из распространенных источников дублирующих ошибок определения.Многочисленные файлы деклараций,определяющие одни и те же члены на интерфейсах.
zh_cn: 这一直是重复定义错误的一个常见来源。多个声明文件在接口上定义了相同的成员。

source: This has the same problems we mentioned above - we could easily have misspelled <code>getDistance</code> and not gotten an error. For this reason, TypeScript has the <code>noImplicitThis</code> option. When that option is set, TypeScript will issue an error when <code>this</code> is used without an explicit (or inferred) type. The fix is to use a <code>this</code>-parameter to give an explicit type in the interface or in the function itself:
ru: Это имеет те же проблемы, о которых мы упоминали выше - мы могли легко ошибиться в написании <code>getDistance</code> и не получить ошибку. По этой причине TypeScript имеет параметр <code>noImplicitThis</code> . Когда эта опция установлена, машинопись выдаст ошибку , когда <code>this</code> используется без явного типа (или выведенного). Исправление состоит в том, чтобы использовать параметр <code>this</code> , чтобы указать явный тип в интерфейсе или в самой функции:
zh_cn: 这具有我们上面提到的相同问题-我们很容易将 <code>getDistance</code> 拼写错误而没有得到错误。因此，TypeScript具有 <code>noImplicitThis</code> 选项。当该选项设置，打字稿时会发出一个错误 <code>this</code> 是不明确的（或推断）型使用。解决方法是使用 <code>this</code> -parameter在接口或函数本身中提供显式类型：

source: This is a breaking change; previously, the <code>keyof</code> operator and mapped types only supported <code>string</code> named properties. Code that assumed values typed with <code>keyof T</code> were always <code>string</code>s, will now be flagged as error.
ru: Это критическое изменение; ранее оператор <code>keyof</code> и сопоставленные типы поддерживали только <code>string</code> именованные свойства. Код, в котором значения, набранные с помощью <code>keyof T</code> , всегда были <code>string</code> s, теперь будет помечен как ошибка.
zh_cn: 这是一个重大变化。以前， <code>keyof</code> 运算符和映射类型仅支持名为属性的 <code>string</code> 。假定使用 <code>keyof T</code> 输入的值始终是 <code>string</code> s的代码，现在将被标记为错误。

source: This is a pretty literal use of the <code>GenericNumber</code> class, but you may have noticed that nothing is restricting it to only use the <code>number</code> type. We could have instead used <code>string</code> or even more complex objects.
ru: Это довольно буквальное использование класса <code>GenericNumber</code> , но вы могли заметить, что ничто не ограничивает его использованием только <code>number</code> типа. Вместо этого мы могли бы использовать <code>string</code> или даже более сложные объекты.
zh_cn: 这是 <code>GenericNumber</code> 类的一种字面意义，但您可能已经注意到，没有什么限制它只能使用 <code>number</code> 类型。我们本来可以使用 <code>string</code> 或什至更复杂的对象。

source: This is a reasonable restriction because any use of <code>Foo</code> would need to be replaced with <code>Foo</code> which would need to be replaced with <code>Foo</code> which would need to be replaced with <code>Foo</code> which&hellip; well, hopefully you get the idea! In the end, there isn&rsquo;t a type that makes sense in place of <code>Foo</code>.
ru: Это разумное ограничение, потому что любое использование <code>Foo</code> нужно будет заменить на <code>Foo</code> , которое нужно будет заменить на <code>Foo</code> , которое нужно будет заменить на <code>Foo</code> , что ... ну, надеюсь, вы поняли! В конце концов, нет типа, который имел бы смысл вместо <code>Foo</code> .
zh_cn: 这是一个合理的限制，因为任何对 <code>Foo</code> 的使用都需要用 <code>Foo</code> 代替，而Foo则需要用 <code>Foo</code> 代替，而Foo则需要用 <code>Foo</code> 代替&hellip;&hellip;好吧，希望您能理解！最后，没有什么类型可以代替 <code>Foo</code> 。

source: This is achieved by introducing two new types, <code>CallableFunction</code> and <code>NewableFunction</code>, in <code>lib.d.ts</code>. These types contain specialized generic method declarations for <code>bind</code>, <code>call</code>, and <code>apply</code> for regular functions and constructor functions, respectively. The declarations use generic rest parameters (see #24897) to capture and reflect parameter lists in a strongly typed manner. In <code>--strictBindCallApply</code> mode these declarations are used in place of the (very permissive) declarations provided by type <code>Function</code>.
ru: Это достигается за счет введения двух новых типов, <code>CallableFunction</code> и <code>NewableFunction</code> , в <code>lib.d.ts</code> . Эти типы содержат объявления специализированных универсальных методов для <code>bind</code> , <code>call</code> и <code>apply</code> для обычных функций и функций-конструкторов соответственно. В объявлениях используются общие параметры отдыха (см. # 24897) для захвата и отражения списков параметров строго типизированным способом. В режиме <code>--strictBindCallApply</code> эти объявления используются вместо (очень разрешительных) объявлений, предоставляемых типом <code>Function</code> .
zh_cn: 这是通过在 <code>lib.d.ts</code> 中引入两个新类型 <code>CallableFunction</code> 和 <code>NewableFunction</code> 来实现的。这些类型包含专门针对泛型方法声明 <code>bind</code> ， <code>call</code> ，并 <code>apply</code> 分别为定期的功能和构造函数。声明使用通用的rest参数（请参阅＃24897）以强类型方式捕获和反映参数列表。在 <code>--strictBindCallApply</code> 模式下，使用这些声明代替 <code>Function</code> 类型提供的（非常宽松的）声明。

source: This is because when a class implements an interface, only the instance side of the class is checked. Since the constructor sits in the static side, it is not included in this check.
ru: Это происходит потому,что когда класс реализует интерфейс,проверяется только сторона экземпляра класса.Так как конструктор сидит на статической стороне,то он не включается в данную проверку.
zh_cn: 这是因为当一个类实现一个接口时,只检查该类的实例侧。由于构造函数位于静态侧,所以它不包括在这个检查中。

source: This is called &ldquo;contextual typing&rdquo;, a form of type inference. This helps cut down on the amount of effort to keep your program typed.
ru: Это называется &laquo;контекстной типизацией&raquo;, формой вывода типа. Это помогает сократить количество усилий по поддержанию вашей программы типизированной.
zh_cn: 这称为&ldquo;上下文类型化&rdquo;，一种类型推断。这有助于减少保持程序键入的工作量。

source: This is equivalent to declaring <code>sentence</code> like so:
ru: Это эквивалентно объявлению такого <code>sentence</code> :
zh_cn: 这等效于像这样声明 <code>sentence</code> ：

source: This is fairly <a href="https://en.wikipedia.org/w/index.php?title=Recursive_data_type&amp;oldid=913091335#in_type_synonyms">consistent with how other languages treat type aliases</a>, but it does give rise to some slightly surprising scenarios for how users leverage the feature. For example, in TypeScript 3.6 and prior, the following causes an error.
ru: Это довольно <a href="https://en.wikipedia.org/w/index.php?title=Recursive_data_type&amp;oldid=913091335#in_type_synonyms">согласуется с тем, как другие языки обрабатывают псевдонимы типов</a> , но порождает несколько неожиданных сценариев того, как пользователи используют эту функцию. Например, в TypeScript 3.6 и ранее следующая ошибка вызывает ошибку.
zh_cn: 这<a href="https://en.wikipedia.org/w/index.php?title=Recursive_data_type&amp;oldid=913091335#in_type_synonyms">与其他语言对待类型别名的方式完全一致</a>，但是确实为用户利用功能带来了一些令人惊讶的方案。例如，在TypeScript 3.6和更低版本中，以下导致错误。

source: This is legal as long as it does not create a conflict. A general rule of thumb is that values always conflict with other values of the same name unless they are declared as <code>namespace</code>s, types will conflict if they are declared with a type alias declaration (<code>type s = string</code>), and namespaces never conflict.
ru: Это законно до тех пор, пока не возникает конфликта. Общее практическое правило состоит в том, что значения всегда конфликтуют с другими значениями с тем же именем, если они не объявлены как <code>namespace</code> s, типы будут конфликтовать, если они объявлены с помощью объявления псевдонима <code>type s = string</code> ( type s = string ), а пространства имен никогда не конфликтуют.
zh_cn: 只要不造成冲突，这是合法的。一般的经验法则是，除非将值声明为 <code>namespace</code> ，否则值始终与其他同名值发生冲突；如果使用类型别名声明（ <code>type s = string</code> ）声明类型，则类型将发生冲突，并且命名空间绝不会发生冲突。

source: This is no longer the case - TypeScript now infers <code>this</code> to have a special type called <code>this</code> whenever inside an instance method of a class. The <code>this</code> type is written as so, and basically means &ldquo;the type of the left side of the dot in a method call&rdquo;.
ru: Это уже не так - TypeScript теперь предполагает, что <code>this</code> должен иметь специальный тип, называемый <code>this</code> всякий раз, когда внутри метода экземпляра класса. <code>this</code> тип записывается так, и в основном означает &laquo;тип слева от точки в вызове метода&raquo;.
zh_cn: 这已不再是如此-现在打字稿推断 <code>this</code> 有一种特殊的类型，称为 <code>this</code> 每当一个类的实例方法中。在 <code>this</code> 类型写成这样，基本上是指&ldquo;点的左侧的一个方法调用的类型&rdquo;。

source: This is now the default for MSBuild projects; this allows MSBuild incremental build to work as expected, as outputs are only generated on clean builds.
ru: Теперь это стандартное решение для проектов MSBuild;это позволяет инкрементальной сборке MSBuild работать,как и ожидалось,так как выходные данные генерируются только на чистых сборках.
zh_cn: 这现在是MSBuild项目的默认值;这使得MSBuild增量构建能够像预期的那样工作,因为输出只在干净的构建中生成。

source: This is only enabled if <code>--noImplicitAny</code> is set.
ru: Это <code>--noImplicitAny</code> только если установлено --noImplicitAny .
zh_cn: 仅在设置 <code>--noImplicitAny</code> 时启用。

source: This is optimal for consumers. They can name your type whatever they want (<code>t</code> in this case) and don&rsquo;t have to do any excessive dotting to find your objects.
ru: Это оптимально для потребителей. Они могут называть ваш тип как угодно ( в данном случае <code>t</code> ), и им не нужно чрезмерно расставлять точки, чтобы найти ваши объекты.
zh_cn: 这对于消费者而言是最佳的。他们可以随心所欲地为您的类型命名（在这种情况下为 <code>t</code> ），而不必为了找到对象而进行过多的操作。

source: This is still strictly more capable in TypeScript 3.3, and adding an explicit type annotation will work.
ru: Строго говоря,в TypeScript 3.3 это все еще более доступно,и добавление явной типовой аннотации будет работать.
zh_cn: 严格来说,这在TypeScript 3.3中的能力还是比较强的,增加一个显式类型注释就可以了。

source: This is strange because there is technically nothing wrong with any use users could always write what was effectively the same code by introducing an interface.
ru: Это странно,потому что технически нет ничего плохого в том,что пользователи всегда могли бы написать то,что было фактически одним и тем же кодом,введя интерфейс.
zh_cn: 这很奇怪,因为在技术上没有任何问题,任何使用用户总是可以通过引入一个接口来编写实际上是相同的代码。

source: This is unsound from a type system perspective, but from a runtime point of view the idea of an optional parameter is generally not well-enforced since passing <code>undefined</code> in that position is equivalent for most functions.
ru: Это необоснованно с точки зрения системы типов, но с точки зрения времени выполнения идея необязательного параметра обычно не применяется, поскольку передача <code>undefined</code> в этой позиции эквивалентна для большинства функций.
zh_cn: 从类型系统的角度来看，这是不合理的，但是从运行时的角度来看，通常不会很好地执行可选参数的想法，因为在大多数情况下，在该位置传递 <code>undefined</code> 是等效的。

source: This is useful when you have a large inheritance hierarchy, but want to specify that your code works with only subclasses that have certain properties. The subclasses don&rsquo;t have to be related besides inheriting from the base class. For example:
ru: Это полезно, когда у вас есть большая иерархия наследования, но вы хотите указать, что ваш код работает только с подклассами, имеющими определенные свойства. Подклассы не должны быть связаны, кроме наследования от базового класса. Например:
zh_cn: 当您具有较大的继承层次结构，但要指定您的代码仅适用于具有某些属性的子类时，这很有用。子类除了从基类继承外不必关联。例如：

source: This kind of iterator is useful for iterating over synchronously available values, such as the elements of an Array or the keys of a Map. An object that supports iteration is said to be &ldquo;iterable&rdquo; if it has a <code>Symbol.iterator</code> method that returns an <code>Iterator</code> object.
ru: Этот вид итератора полезен для перебора синхронно доступных значений, таких как элементы массива или ключи карты. Объект, поддерживающий итерацию, называется &laquo;итератором&raquo;, если у него есть метод <code>Symbol.iterator</code> , который возвращает объект <code>Iterator</code> .
zh_cn: 这种迭代器对于迭代同步可用的值（例如Array的元素或Map的键）很有用。如果支持迭代的对象具有返回 <code>Iterator</code> 对象的 <code>Symbol.iterator</code> 方法，则该对象被称为&ldquo;可迭代&rdquo; 。

source: This may seem confusing, but it&rsquo;s actually very convenient as long as we don&rsquo;t excessively overload things. Let&rsquo;s look at some useful aspects of this combining behavior.
ru: Это может показаться запутанным, но на самом деле это очень удобно, если мы не перегружаем вещи чрезмерно. Давайте посмотрим на некоторые полезные аспекты этого комбинированного поведения.
zh_cn: 这看起来可能令人困惑，但是实际上只要不过多地加载东西，它就非常方便。让我们看一下这种组合行为的一些有用方面。
