Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/typescript/typescript.*.003.xlf
Languages: es, ko, ru, zh_cn

source: TypeScript 2.0 has two new flags to help you maintain a clean code base. <code>--noUnusedParameters</code> flags any unused function or method parameters errors. <code>--noUnusedLocals</code> flags any unused local (un-exported) declaration like variables, functions, classes, imports, etc&hellip; Also, unused private members of a class would be flagged as errors under <code>--noUnusedLocals</code>.
ru: В TypeScript 2.0 есть два новых флага, которые помогут вам поддерживать чистую базу кода. <code>--noUnusedParameters</code> отмечает любые неиспользуемые ошибки параметров функции или метода. <code>--noUnusedLocals</code> помечает любые неиспользуемые локальные ( неэкспортированные ) объявления, такие как переменные, функции, классы, импорт и т. д. Кроме того, неиспользуемые частные члены класса будут помечены как ошибки в <code>--noUnusedLocals</code> .
zh_cn: TypeScript 2.0具有两个新标志，可帮助您维护干净的代码库。 <code>--noUnusedParameters</code> 标记任何未使用的函数或方法参数错误。 <code>--noUnusedLocals</code> 标记任何未使用的本地（未导出）声明，例如变量，函数，类，导入等。此外，在 <code>--noUnusedLocals</code> 下，类的未使用私有成员将被标记为错误。

source: TypeScript 2.0 implements a control flow-based type analysis for local variables and parameters. Previously, the type analysis performed for type guards was limited to <code>if</code> statements and <code>?:</code> conditional expressions and didn&rsquo;t include effects of assignments and control flow constructs such as <code>return</code> and <code>break</code> statements. With TypeScript 2.0, the type checker analyses all possible flows of control in statements and expressions to produce the most specific type possible (the <em>narrowed type</em>) at any given location for a local variable or parameter that is declared to have a union type.
ru: TypeScript 2.0 реализует анализ типов на основе потока управления для локальных переменных и параметров. Раньше анализ типов, выполняемый для защиты типов, ограничивался операторами <code>if</code> и <code>?:</code> Условными выражениями и не включал эффекты присваиваний и конструкций потока управления, такие как операторы <code>return</code> и <code>break</code> . В TypeScript 2.0 средство проверки типов анализирует все возможные потоки управления в операторах и выражениях, чтобы создать наиболее конкретный возможный тип ( <em>суженный тип</em> ) в любом заданном месте для локальной переменной или параметра, который объявлен как имеющий тип объединения.
zh_cn: TypeScript 2.0对局部变量和参数实施基于控制流的类型分析。以前，对类型保护执行的类型分析仅限于 <code>if</code> 语句和 <code>?:</code> 条件表达式，并且不包括赋值和控制流构造（如 <code>return</code> 和 <code>break</code> 语句）的影响。使用TypeScript 2.0，类型检查器会分析语句和表达式中所有可能的控制流，以在声明给定位置具有联合类型的局部变量或参数的任何给定位置生成最具体的类型（<em>缩小的类型</em>）。

source: TypeScript 2.0 implements support for tagged (or discriminated) union types. Specifically, the TS compiler now support type guards that narrow union types based on tests of a discriminant property and furthermore extend that capability to <code>switch</code> statements.
ru: TypeScript 2.0 реализует поддержку помеченных (или размеченных) типов объединения. В частности, компилятор TS теперь поддерживает средства защиты типов, которые сужают типы объединения на основе тестов дискриминантного свойства и, кроме того, расширяют эту возможность для операторов <code>switch</code> .
zh_cn: TypeScript 2.0实现对标记（或区分）联合类型的支持。具体来说，TS编译器现在支持类型保护，该类型保护可根据区分属性的测试来缩小联合类型，并进一步扩展了 <code>switch</code> 语句的能力。

source: TypeScript 2.0 introduces a new primitive type <code>never</code>. The <code>never</code> type represents the type of values that never occur. Specifically, <code>never</code> is the return type for functions that never return and <code>never</code> is the type of variables under type guards that are never true.
ru: TypeScript 2.0 <code>never</code> вводит новый примитивный тип . Тип <code>never</code> представляет собой тип значений, которые никогда не встречаются. В частности, <code>never</code> является возвращаемым типом для функций, которые никогда не возвращаются, и <code>never</code> является типом переменных в рамках защиты типов, которые никогда не являются истинными.
zh_cn: TypeScript 2.0引入了一个 <code>never</code> 的新原始类型。该 <code>never</code> 类型表示值是不会发生的类型。具体而言， <code>never</code> 是函数从不返回返回类型和 <code>never</code> 是下型后卫是从来没有真正的变量类型。

source: TypeScript 2.0 provides a set of additional module resolution knops to <em>inform</em> the compiler where to find declarations for a given module.
ru: TypeScript 2.0 предоставляет набор дополнительных кнопок разрешения модуля, чтобы <em>сообщить</em> компилятору, где найти объявления для данного модуля.
zh_cn: TypeScript 2.0提供了一组附加的模块解析结节，以<em>告知</em>编译器在何处查找给定模块的声明。

source: In strict null checking mode, the <code>null</code> and <code>undefined</code> values are <em>not</em> in the domain of every type and are only assignable to themselves and <code>any</code> (the one exception being that <code>undefined</code> is also assignable to <code>void</code>). So, whereas <code>T</code> and <code>T | undefined</code> are considered synonymous in regular type checking mode (because <code>undefined</code> is considered a subtype of any <code>T</code>), they are different types in strict type checking mode, and only <code>T | undefined</code> permits <code>undefined</code> values. The same is true for the relationship of <code>T</code> to <code>T | null</code>.
es: En el modo de comprobaci&oacute;n nulo estricto, los valores <code>null</code> e <code>undefined</code> <em>no</em> est&aacute;n en el dominio de todos los tipos y solo se pueden asignar a ellos mismos y a <code>any</code> (la &uacute;nica excepci&oacute;n es que <code>undefined</code> tambi&eacute;n se puede asignar a <code>void</code> ). Entonces, mientras que <code>T</code> y <code>T | undefined</code> se consideran sin&oacute;nimos en el modo de verificaci&oacute;n de tipo regular (porque <code>undefined</code> se considera un subtipo de cualquier <code>T</code> ), son tipos diferentes en el modo de verificaci&oacute;n de tipo estricto y solo <code>T | undefined</code> permite valores <code>undefined</code> . Lo mismo es cierto para la relaci&oacute;n de <code>T</code> con <code>T | null</code> .
ko: 엄격한 널 검사 모드에서 <code>null</code> 및 <code>undefined</code> 값은 모든 유형의 도메인에 <em>있지 않으며</em> 자신 및 <code>any</code> 에게만 지정할 수 있습니다 ( <code>undefined</code> 예외는 <code>void</code> 에 지정할 수도 있습니다 ). 그래서, 반면 <code>T</code> 및 <code>T | undefined</code> 는 일반 유형 검사 모드에서 동의어로 간주되며 ( <code>undefined</code> 는 <code>T</code> 의 하위 유형으로 간주 되므로 ) 엄격한 유형 검사 모드에서는 서로 다른 유형이며 <code>T | undefined</code> 는 <code>undefined</code> 값을 허용 합니다. 동일의 관계를 사실 <code>T</code> 에 <code>T | null</code> .

source: In strict null checking mode, the <code>null</code> and <code>undefined</code> values are not in the domain of every type and are only assignable to themselves and <code>any</code> (the one exception being that <code>undefined</code> is also assignable to <code>void</code>).
es: En el modo de verificaci&oacute;n nulo estricto, los valores <code>null</code> e <code>undefined</code> no est&aacute;n en el dominio de todos los tipos y solo se pueden asignar a s&iacute; mismos y a <code>any</code> (la &uacute;nica excepci&oacute;n es que <code>undefined</code> tambi&eacute;n se puede asignar a <code>void</code> ).
ko: 엄격한 널 검사 모드에서 <code>null</code> 및 <code>undefined</code> 값은 모든 유형의 도메인에 있지 않으며 자신 및 <code>any</code> 에게만 지정할 수 있습니다 ( <code>undefined</code> 예외는 <code>void</code> 에 지정할 수도 있습니다 ).

source: In that example, we first checked whether <code>x</code> was <em>not</em><code>E.Foo</code>. If that check succeeds, then our <code>||</code> will short-circuit, and the body of the &lsquo;if&rsquo; will run. However, if the check didn&rsquo;t succeed, then <code>x</code> can <em>only</em> be <code>E.Foo</code>, so it doesn&rsquo;t make sense to see whether it&rsquo;s equal to <code>E.Bar</code>.
es: En ese ejemplo, primero verificamos si <code>x</code> <em>no</em> era <code>E.Foo</code> . Si esa comprobaci&oacute;n tiene &eacute;xito, entonces nuestro <code>||</code> har&aacute; un cortocircuito, y el cuerpo del 'if' funcionar&aacute;. Sin embargo, si la comprobaci&oacute;n no tuvo &eacute;xito, entonces <code>x</code> <em>solo</em> puede ser <code>E.Foo</code> , por lo que no tiene sentido ver si es igual a <code>E.Bar</code> .
ko: 여부를 그 예제에서, 우리는 먼저 확인 <code>x</code> 가 있었다 <em>하지 </em> <code>E.Foo</code> . 확인이 성공하면 <code>||</code> 단락되고 'if'의 본문이 실행됩니다. 그러나 검사가 성공하지 못하면 <code>x</code> 는 <code>E.Foo</code> <em>만</em> 될 수 있으므로 E.Bar 와 같은지 여부는 알 수 <code>E.Bar</code> .

source: In the 20+ years since its standardization, JavaScript has come a very long way. While in 2020, JavaScript can be used on servers, in data science, and even on IoT devices, it is important to remember its most popular use case: web browsers.
ko: 표준화 이후 20 년 이상 동안 JavaScript는 매우 먼 길을 걸어 왔습니다. 2020 년에는 JavaScript를 서버, 데이터 과학, 심지어 IoT 장치에서 사용할 수 있지만 가장 많이 사용되는 사용 사례 인 웹 브라우저를 기억하는 것이 중요합니다.

source: In the Template section you&rsquo;ll find a number of declaration files that serve as a useful starting point when writing a new file. If you already know what your structure is, see the d.ts Template section in the sidebar.
ko: 템플릿 섹션에는 새 파일을 작성할 때 유용한 시작점 역할을하는 여러 선언 파일이 있습니다. 구조가 무엇인지 이미 알고 있다면 사이드 바의 d.ts 템플릿 섹션을 참조하십시오.

source: In the above case:
ko: 위의 경우 :

source: In the above example, <code>&lt;foo /&gt;</code> will work fine but <code>&lt;bar /&gt;</code> will result in an error since it has not been specified on <code>JSX.IntrinsicElements</code>.
es: En el ejemplo anterior, <code>&lt;foo /&gt;</code> funcionar&aacute; bien, pero <code>&lt;bar /&gt;</code> dar&aacute; como resultado un error ya que no se ha especificado en <code>JSX.IntrinsicElements</code> .
ko: 위의 예에서 <code>&lt;foo /&gt;</code> 는 제대로 작동하지만 <code>&lt;bar /&gt;</code> 는 <code>JSX.IntrinsicElements</code> 에 지정되지 않았으므로 오류가 발생합니다 .

source: In the above example, <code>SelectableControl</code> contains all of the members of <code>Control</code>, including the private <code>state</code> property. Since <code>state</code> is a private member it is only possible for descendants of <code>Control</code> to implement <code>SelectableControl</code>. This is because only descendants of <code>Control</code> will have a <code>state</code> private member that originates in the same declaration, which is a requirement for private members to be compatible.
es: En el ejemplo anterior, <code>SelectableControl</code> contiene todos los miembros de <code>Control</code> , incluida la propiedad <code>state</code> privada . Dado que el <code>state</code> es un miembro privado, solo los descendientes de <code>Control</code> pueden implementar <code>SelectableControl</code> . Esto se debe a que solo los descendientes de <code>Control</code> tendr&aacute;n un miembro privado <code>state</code> que se origine en la misma declaraci&oacute;n, lo cual es un requisito para que los miembros privados sean compatibles.
ko: 위의 예제에서 <code>SelectableControl</code> 은 private <code>state</code> 속성을 포함하여 <code>Control</code> 의 모든 멤버를 포함합니다 . 이후 <code>state</code> 개인 구성원 인의 후손을 위해에만 가능 <code>Control</code> 구현하는 <code>SelectableControl</code> 을 . 이것은의 후손 때문이다 <code>Control</code> 해야합니다 <code>state</code> 개인 회원이 개인 회원 호환하기위한 요구 사항입니다 같은 선언에서 유래.

source: In the above example, all declarations of <code>x</code> actually refer to the <em>same</em><code>x</code>, and this is perfectly valid. This often ends up being a source of bugs. Thankfully, <code>let</code> declarations are not as forgiving.
es: En el ejemplo anterior, todas las declaraciones de <code>x</code> en realidad se refieren a la <em>misma </em> <code>x</code> , y esto es perfectamente v&aacute;lido. Esto a menudo termina siendo una fuente de errores. Afortunadamente, <code>let</code> declaraciones no son tan tolerantes.
ko: 위의 예에서 <code>x</code> 의 모든 선언은 실제로 <em>동일한 </em> <code>x</code> 를 참조 하며 이는 완벽하게 유효합니다. 이것은 종종 버그의 원인이됩니다. 다행히, <code>let</code> 선언 용서로하지 않습니다.

source: In the above example, if we&rsquo;re importing from <code>"package-name"</code>, TypeScript will try to resolve from <code>[...]/node_modules/package-name/ts3.1/index.d.ts</code> (and other relevant paths) when running in TypeScript 3.1. If we import from <code>package-name/foo</code>, we&rsquo;ll try to look for <code>[...]/node_modules/package-name/ts3.1/foo.d.ts</code> and <code>[...]/node_modules/package-name/ts3.1/foo/index.d.ts</code>.
ko: 위의 예에서 <code>"package-name"</code> 에서 가져 오는 경우 TypeScript는 <code>[...]/node_modules/package-name/ts3.1/index.d.ts</code> (및 기타 관련 경로) 에서 확인을 시도합니다. TypeScript 3.1에서 실행할 때. 우리가 가져올 경우 <code>package-name/foo</code> , 우리가 찾기 위해 노력할 것이다 <code>[...]/node_modules/package-name/ts3.1/foo.d.ts</code> 및 <code>[...]/node_modules/package-name/ts3.1/foo/index.d.ts</code> .

source: In the above form, the mixin&rsquo;s have no underlying knowledge of the class which can make it hard to create the design you want.
ko: 위의 형식에서 mixin은 클래스에 대한 기본 지식이 없으므로 원하는 디자인을 만들기가 어려울 수 있습니다.

source: In the above, <code>x</code> and <code>y</code> are compatible because their structures do not use the type argument in a differentiating way. Changing this example by adding a member to <code>Empty&lt;T&gt;</code> shows how this works:
es: En lo anterior, <code>x</code> e <code>y</code> son compatibles debido a que sus estructuras no utilizan el argumento de tipo de una manera diferenciadora. Cambiar este ejemplo agregando un miembro a <code>Empty&lt;T&gt;</code> muestra c&oacute;mo funciona esto:
ko: 위에서 <code>x</code> 와 <code>y</code> 는 구조가 다른 방식으로 type 인수를 사용하지 않기 때문에 호환됩니다. 멤버를 <code>Empty&lt;T&gt;</code> 에 추가하여이 예제를 변경하면 작동 방식을 보여줍니다.

source: In the above, if we truly meant for <code>baz</code> to potentially be <code>undefined</code>, we should have declared it with the type <code>boolean | undefined</code>.
es: En lo anterior, si realmente quisi&eacute;ramos que <code>baz</code> fuera potencialmente <code>undefined</code> , deber&iacute;amos haberlo declarado con el tipo <code>boolean | undefined</code> .
ko: 위에서 <code>baz</code> 가 잠재적으로 <code>undefined</code> 가되도록하려면 <code>boolean | undefined</code> .

source: In the above, the variable <code>a</code> has a conditional type that hasn&rsquo;t yet chosen a branch. When another piece of code ends up calling <code>foo</code>, it will substitute in <code>U</code> with some other type, and TypeScript will re-evaluate the conditional type, deciding whether it can actually pick a branch.
es: En lo anterior, la variable <code>a</code> tiene un tipo condicional que a&uacute;n no ha elegido una rama. Cuando otro fragmento de c&oacute;digo termina llamando a <code>foo</code> , lo sustituir&aacute; en <code>U</code> con alg&uacute;n otro tipo, y TypeScript volver&aacute; a evaluar el tipo condicional, decidiendo si realmente puede elegir una rama.
ko: 위의 변수 <code>a</code> 에는 아직 분기를 선택하지 않은 조건부 유형이 있습니다. 다른 코드 조각이 <code>foo</code> 를 호출 하면 <code>U</code> 에서 다른 유형으로 대체 되고 TypeScript는 조건부 유형을 다시 평가하여 실제로 분기를 선택할 수 있는지 여부를 결정합니다.

source: In the code below, we show how you can model mixins in TypeScript. After the code, we&rsquo;ll break down how it works.
es: En el c&oacute;digo siguiente, mostramos c&oacute;mo puede modelar mixins en TypeScript. Despu&eacute;s del c&oacute;digo, analizaremos c&oacute;mo funciona.
ko: 아래 코드에서는 TypeScript에서 믹스 인을 모델링하는 방법을 보여줍니다. 코드가 끝나면 작동 방식을 세분화합니다.

source: In the declaration of <code>f2</code> above, type inference infers types <code>number</code>, <code>[string, boolean]</code> and <code>void</code> for <code>T</code>, <code>U</code> and <code>V</code> respectively.
es: En la declaraci&oacute;n de <code>f2</code> anterior, la inferencia de tipos infiere los tipos <code>number</code> , <code>[string, boolean]</code> y <code>void</code> para <code>T</code> , <code>U</code> y <code>V</code> respectivamente.
ko: 위 의 <code>f2</code> 선언 에서 형식 유추는 유형 <code>number</code> , <code>[string, boolean]</code> 및 <code>void</code> 을 각각 <code>T</code> , <code>U</code> 및 <code>V</code> 에 대해 유추합니다 .

source: In the example above, the <code>methods</code> object in the argument to <code>makeObject</code> has a contextual type that includes <code>ThisType&lt;D &amp; M&gt;</code> and therefore the type of <a href="functions#this">this</a> in methods within the <code>methods</code> object is <code>{ x: number, y: number } &amp; { moveBy(dx: number, dy: number): number }</code>. Notice how the type of the <code>methods</code> property simultaneously is an inference target and a source for the <code>this</code> type in methods.
ko: 위의 예 에서 <code>makeObject</code> 에 대한 인수 의 <code>methods</code> 개체 에는 <code>ThisType&lt;D &amp; M&gt;</code> 이 포함 된 컨텍스트 유형이 있으므로 <code>methods</code> 개체 내의 메서드 <a href="functions#this">에서이</a> 유형 은 <code>{ x: number, y: number } &amp; { moveBy(dx: number, dy: number): number }</code> . <code>methods</code> 속성 의 유형이 동시에 메서드 <code>this</code> 유형에 대한 추론 대상 및 소스 임을 확인하십시오 .

source: In the example above, the <code>methods</code> object in the argument to <code>makeObject</code> has a contextual type that includes <code>ThisType&lt;D &amp; M&gt;</code> and therefore the type of <code>this</code> in methods within the <code>methods</code> object is <code>{ x: number, y: number } &amp; { moveBy(dx: number, dy: number): number }</code>. Notice how the type of the <code>methods</code> property simultaneously is an inference target and a source for the <code>this</code> type in methods.
es: En el ejemplo anterior, el objeto de <code>methods</code> en el argumento de <code>makeObject</code> tiene un tipo contextual que incluye <code>ThisType&lt;D &amp; M&gt;</code> y, por lo tanto, el tipo de <code>this</code> en los m&eacute;todos dentro del objeto de <code>methods</code> es <code>{ x: number, y: number } &amp; { moveBy(dx: number, dy: number): number }</code> . Observe c&oacute;mo el tipo de propiedad de los <code>methods</code> es simult&aacute;neamente un objetivo de inferencia y una fuente para <code>this</code> tipo de m&eacute;todos.
ko: 위의 예 에서 <code>makeObject</code> 인수 의 <code>methods</code> 오브젝트 에는 <code>ThisType&lt;D &amp; M&gt;</code> 을 포함하는 컨텍스트 유형이 있으므로 <code>methods</code> 오브젝트 내의 메소드 <code>this</code> 유형 은 <code>{ x: number, y: number } &amp; { moveBy(dx: number, dy: number): number }</code> . <code>methods</code> 속성 의 유형이 동시에 추론 대상 <code>this</code> 되고 메소드 에서이 유형 의 소스가되는 방법에 주목하십시오 .

source: In the example above, the parameters <code>fruit</code> and <code>color</code> are intersected together to a new parameter of type <code>Fruit &amp; Color</code>. <code>Fruit &amp; Color</code> is really the same as <code>("apple" | "orange") &amp; ("red" | "orange")</code> which is equivalent to <code>("apple" &amp; "red") | ("apple" &amp; "orange") | ("orange" &amp; "red") | ("orange" &amp; "orange")</code>. Each of those impossible intersections reduces to <code>never</code>, and we&rsquo;re left with <code>"orange" &amp; "orange"</code> which is just <code>"orange"</code>.
es: En el ejemplo anterior, los par&aacute;metros <code>fruit</code> y <code>color</code> se cruzan juntos en un nuevo par&aacute;metro de tipo <code>Fruit &amp; Color</code> . <code>Fruit &amp; Color</code> es realmente lo mismo que <code>("apple" | "orange") &amp; ("red" | "orange")</code> que es equivalente a <code>("apple" &amp; "red") | ("apple" &amp; "orange") | ("orange" &amp; "red") | ("orange" &amp; "orange")</code> . Cada una de esas intersecciones imposibles se reduce a <code>never</code> , y nos quedamos con <code>"orange" &amp; "orange"</code> que es simplemente <code>"orange"</code> .
ko: 위의 예에서 <code>fruit</code> 및 <code>color</code> 매개 변수는 <code>Fruit &amp; Color</code> 유형의 새로운 매개 변수와 함께 교차됩니다 . <code>Fruit &amp; Color</code> 정말 동일하다 <code>("apple" | "orange") &amp; ("red" | "orange")</code> 에 해당하는 <code>("apple" &amp; "red") | ("apple" &amp; "orange") | ("orange" &amp; "red") | ("orange" &amp; "orange")</code> . 그 불가능한 교차점들 각각은 <code>never</code> 줄어들지 않으며 , 우리 는 단지 <code>"orange"</code> <code>"orange" &amp; "orange"</code> 남겨진다 .

source: In the first <code>length</code>, T is not necessary; notice that it&rsquo;s only referenced once, so it&rsquo;s not being used to constrain the type of the return value or other parameters.
ko: 첫 번째 <code>length</code> 에서 T는 필요하지 않습니다. 한 번만 참조되므로 반환 값 또는 기타 매개 변수의 유형을 제한하는 데 사용되지 않습니다.

source: In the following example, each input element will be printed out one at a time with a 400ms delay:
es: En el siguiente ejemplo,cada elemento de entrada se imprimirá de uno en uno con un retardo de 400ms:
ko: 다음 예에서 각 입력 요소는 400ms 지연으로 한 번에 하나씩 인쇄됩니다.

source: In the interests of clarity and brevity, the main content of the Handbook will not explore every edge case or minutiae of the features being covered. You can find more details on particular concepts in the reference articles.
ko: 명확성과 간결성을 위해 핸드북의 주요 내용은 다루는 기능의 모든 가장자리 사례 또는 세부 사항을 탐색하지 않을 것입니다. 참조 문서에서 특정 개념에 대한 자세한 내용을 찾을 수 있습니다.

source: In the last line we construct an instance of the <code>Greeter</code> class using <code>new</code>. This calls into the constructor we defined earlier, creating a new object with the <code>Greeter</code> shape, and running the constructor to initialize it.
es: En la &uacute;ltima l&iacute;nea construimos una instancia de la clase <code>Greeter</code> usando <code>new</code> . Esto llama al constructor que definimos anteriormente, creando un nuevo objeto con la forma <code>Greeter</code> y ejecutando el constructor para inicializarlo.
ko: 마지막 줄에서 <code>new</code> 를 사용하여 <code>Greeter</code> 클래스 의 인스턴스를 만듭니다. 앞에서 정의한 생성자를 호출하여 <code>Greeter</code> 모양 의 새 객체를 생성 하고 생성자를 실행하여 초기화합니다.

source: In the last window, select the <strong>Empty</strong> template and press the <em>Create</em> button
es: En la &uacute;ltima ventana, seleccione la plantilla <strong>vac&iacute;a</strong> y presione el bot&oacute;n <em>Crear</em>
ko: 마지막 창에서 <strong>빈</strong> 템플릿을 선택 하고 <em>만들기</em> 버튼을 누릅니다

source: In the meantime, we can assign a conditional type to any other target type as long as each branch of the conditional is assignable to that target. So in our example above we were able to assign <code>U extends Foo ? string : number</code> to <code>string | number</code> since no matter what the conditional evaluates to, it&rsquo;s known to be either <code>string</code> or <code>number</code>.
es: Mientras tanto, podemos asignar un tipo condicional a cualquier otro tipo de objetivo siempre que cada rama del condicional sea asignable a ese objetivo. Entonces, en nuestro ejemplo anterior, pudimos asignar <code>U extends Foo ? string : number</code> a <code>string | number</code> ya que no importa a qu&eacute; se eval&uacute;e el condicional, se sabe que es una <code>string</code> o un <code>number</code> .
ko: 그 동안 조건부 각 분기를 해당 대상에 할당 할 수있는 한 다른 대상 유형에 조건부 유형을 할당 할 수 있습니다. 위의 예에서 <code>U extends Foo ? string : number</code> 를 <code>string | number</code> 조건부 평가하여, 그것은 알려진하는 상관없이 보낸 사람이 될 수 있습니다 <code>string</code> 이나 <code>number</code> .

source: In the near future, we&rsquo;re going to be refreshing the playground samples, adding JSX support, and polishing automatic type acquisition, meaning that you&rsquo;ll be able to see the same experience on the playground as you&rsquo;d get in your personal editor.
es: En un futuro cercano, actualizaremos las muestras del &aacute;rea de juegos, agregaremos soporte JSX y mejoraremos la adquisici&oacute;n autom&aacute;tica de tipos, lo que significa que podr&aacute; ver la misma experiencia en el &aacute;rea de juegos que la que obtendr&iacute;a en su editor personal. .
ko: 가까운 장래에 놀이터 샘플을 새로 고치고 JSX 지원을 추가하고 자동 유형 획득을 연마 할 것입니다. 즉, 개인 편집기에서 얻을 때와 동일한 놀이터에서 동일한 경험을 볼 수 있습니다 .
