Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/typescript/typescript.*.003.xlf
Languages: es, ko, ru, zh_cn

source: Right click on <code>scripts</code> and click <strong>New Item</strong>. Then choose <strong>TypeScript File</strong> and name the file <code>app.ts</code>
es: Haga clic derecho en los <code>scripts</code> y haga clic en <strong>Nuevo elemento</strong> . Luego elija <strong>Archivo TypeScript</strong> y nombre el archivo <code>app.ts</code>
ko: <code>scripts</code> 마우스 오른쪽 단추로 클릭하고 <strong>새 항목을</strong> 클릭하십시오 . 그런 다음 <strong>TypeScript File을</strong> 선택 <strong>하고 파일</strong> 이름을 <code>app.ts</code> 로 지정하십시오.
ru: Щелкните <code>scripts</code> правой кнопкой мыши и выберите &laquo; <strong>Новый элемент&raquo;</strong> . Затем выберите <strong>TypeScript File</strong> и назовите файл <code>app.ts</code>
zh_cn: 右键单击 <code>scripts</code> ，然后单击&ldquo; <strong>新建项目&rdquo;</strong>。然后选择<strong>TypeScript File</strong>并将<strong>文件</strong>命名为 <code>app.ts</code>

source: Right click on the <code>wwwroot</code> folder (if you don&rsquo;t see the folder try building the project) and add a New Item named <code>index.html</code> inside. Use the following code for <code>index.html </code>
es: Haga clic con el bot&oacute;n derecho en la carpeta <code>wwwroot</code> (si no ve la carpeta, intente crear el proyecto) y agregue un elemento nuevo llamado <code>index.html</code> dentro. Utilice el siguiente c&oacute;digo para <code>index.html </code>
ko: <code>wwwroot</code> 폴더를 마우스 오른쪽 단추로 클릭하고 (폴더가 프로젝트 빌드를 시도하지 않는 경우) <code>index.html</code> 이라는 새 항목을 안에 추가하십시오 . <code>index.html </code> 에 다음 코드를 사용하십시오.
ru: Щелкните правой кнопкой <code>wwwroot</code> папку wwwroot (если вы не видите папку, попробуйте создать проект) и добавьте внутрь новый элемент с именем <code>index.html</code> . Используйте следующий код для <code>index.html </code>
zh_cn: 右键单击 <code>wwwroot</code> 文件夹（如果看不到该文件夹​​，请尝试构建项目），然后在其中添加一个名为 <code>index.html</code> 的新项。对 <code>index.html </code> 使用以下代码

source: Right click on the project and click <strong>New Item</strong>. Then choose <strong>JavaScript File</strong> and use the name of <code>gulpfile.js</code>
es: Haga clic derecho en el proyecto y haga clic en <strong>Nuevo elemento</strong> . Luego elija <strong>Archivo JavaScript</strong> y use el nombre de <code>gulpfile.js</code>
ko: 프로젝트를 마우스 오른쪽 단추로 클릭하고 <strong>새 항목을</strong> 클릭하십시오 . 그런 다음 <strong>JavaScript 파일을</strong> 선택 하고 <code>gulpfile.js</code> 이름을 사용하십시오.
ru: Щелкните проект правой кнопкой мыши и выберите &laquo; <strong>Новый элемент&raquo;</strong> . Затем выберите <strong>файл JavaScript</strong> и используйте имя <code>gulpfile.js</code> .
zh_cn: 右键单击该项目，然后单击&ldquo; <strong>新建项目&rdquo;</strong>。然后选择<strong>JavaScript File</strong>并使用 <code>gulpfile.js</code> 的名称

source: Right-Click -&gt; Manage NuGet Packages
es: Haga clic con el bot&oacute;n derecho -&gt; Administrar paquetes NuGet
ko: 마우스 오른쪽 버튼 클릭-&gt; NuGet 패키지 관리
ru: Щелкните правой кнопкой мыши -&gt; Управление пакетами NuGet
zh_cn: 右键单击-&gt;管理NuGet软件包

source: Run <code>tsc --init</code> in a directory to create an initial <code>tsconfig.json</code> in this directory with preset defaults. Optionally pass command line arguments along with <code>--init</code> to be stored in your initial tsconfig.json on creation.
es: Ejecute <code>tsc --init</code> en un directorio para crear un <code>tsconfig.json</code> inicial en este directorio con los valores predeterminados. Opcionalmente, pase los argumentos de la l&iacute;nea de comando junto con <code>--init</code> para que se almacenen en su tsconfig.json inicial en la creaci&oacute;n.
ko: 디렉토리에서 <code>tsc --init</code> 를 실행 하여이 디렉토리에 사전 설정 기본값으로 초기 <code>tsconfig.json</code> 을 작성 하십시오. 선택적으로 <code>--init</code> 와 함께 명령 행 인수를 전달 하여 작성시 초기 tsconfig.json에 저장하십시오.
ru: Запустите <code>tsc --init</code> в каталоге, чтобы создать в этом каталоге начальный <code>tsconfig.json</code> с предустановленными значениями по умолчанию. При необходимости передайте аргументы командной строки вместе с <code>--init</code> , которые будут сохранены в исходном файле tsconfig.json при создании.
zh_cn: 在目录中运行 <code>tsc --init</code> 以使用默认默认值在此目录中创建初始 <code>tsconfig.json</code> 。（可选）在创建时将命令行参数以及 <code>--init</code> 一起存储在您的初始tsconfig.json中。

source: Run the application and make sure that it works.
es: Ejecute la aplicación y asegúrese de que funciona.
ko: 응용 프로그램을 실행하고 작동하는지 확인하십시오.
ru: Запустите приложение и убедитесь,что оно работает.
zh_cn: 运行应用程序,并确保它的工作。

source: Run the compiler in watch mode. Watch input files and trigger recompilation on changes. The implementation of watching files and directories can be configured using environment variable. See <a href="configuring-watch">configuring watch</a> for more details.
ru: Запустите компилятор в режиме наблюдения. Следите за входными файлами и запускайте перекомпиляцию при изменениях. Реализацию просмотра файлов и каталогов можно настроить с помощью переменной окружения. См. Дополнительные сведения о <a href="configuring-watch">настройке часов</a> .
zh_cn: 在监视模式下运行编译器。监视输入文件并触发对更改的重新编译。监视文件和目录的实现可以使用环境变量进行配置。有关更多详细信息，请参见<a href="configuring-watch">配置手表</a>。

source: Run the project
ru: Запустить проект
zh_cn: 运行项目

source: Running <code>tsc --build</code> (<code>tsc -b</code> for short) will do the following:
ru: Запуск <code>tsc --build</code> ( <code>tsc -b</code> ) сделает следующее:
zh_cn: 运行 <code>tsc --build</code> （简称 <code>tsc -b</code> ）将执行以下操作：

source: Running your TypeScript web app
ru: Запуск вашего веб-приложения TypeScript
zh_cn: 运行你的TypeScript网络应用

source: Sample: Dynamic Module Loading in System.js
ru: Образец:Загрузка динамического модуля в System.js
zh_cn: 示例。System.js中的动态模块加载

source: Sample: Dynamic Module Loading in require.js
ru: Образец:Динамический модуль Загрузка в require.js
zh_cn: 示例。在require.js中加载动态模块

source: Schema can be found at: <a href="http://json.schemastore.org/tsconfig">http://json.schemastore.org/tsconfig</a>
ru: Схему можно найти по адресу: <a href="http://json.schemastore.org/tsconfig">http://json.schemastore.org/tsconfig</a>
zh_cn: 模式可以在以下位置找到：<a href="http://json.schemastore.org/tsconfig">http</a> : //json.schemastore.org/tsconfig

source: Scoping rules
ru: Основные положения
zh_cn: 范围界定规则

source: Search for <code>Microsoft.TypeScript.MSBuild</code>
ru: Найдите <code>Microsoft.TypeScript.MSBuild</code> .
zh_cn: 搜索 <code>Microsoft.TypeScript.MSBuild</code>

source: Search for <strong>.NET Core</strong> in the project search bar
ru: Найдите <strong>.NET Core</strong> в строке поиска проекта
zh_cn: 在项目搜索栏中搜索<strong>.NET Core</strong>

source: Second, compile your files using <code>--importHelpers</code>:
ru: Во-вторых, скомпилируйте файлы с помощью <code>--importHelpers</code> :
zh_cn: 其次，使用 <code>--importHelpers</code> 编译文件：

source: Second, the Typescript compiler doesn&rsquo;t allow spreads of type parameters from generic functions. That feature is expected in future versions of the language.
ru: Во-вторых, компилятор Typescript не допускает распространения параметров типа из общих функций. Эта функция ожидается в будущих версиях языка.
zh_cn: 其次，Typescript编译器不允许泛型函数传播类型参数。该功能在该语言的未来版本中有望实现。

source: Secondly, using class fields to specialize properties from base classes also won&rsquo;t work.
ru: Во-вторых, использование полей класса для специализации свойств базовых классов также не сработает.
zh_cn: 其次，使用类字段来专门化基类的属性也将不起作用。

source: See <a href="../project-references">Project References handbook page</a> for more documentation.
ru: См. Дополнительную документацию на <a href="../project-references">странице справочника</a> по проектам .
zh_cn: 有关更多文档，请参见<a href="../project-references">项目参考手册页面</a>。

source: See <a href="http://www.typescriptlang.org/docs/handbook/module-resolution.html">Module Resolution</a> documentation for more details.
ru: См. Документацию <a href="http://www.typescriptlang.org/docs/handbook/module-resolution.html">Module Resolution</a> для более подробной информации.
zh_cn: 有关更多详细信息，请参见<a href="http://www.typescriptlang.org/docs/handbook/module-resolution.html">模块分辨率</a>文档。

source: See <a href="https://github.com/Microsoft/TypeScript/issues/1256">issue #1256</a> for more information.
ru: См. <a href="https://github.com/Microsoft/TypeScript/issues/1256">Проблему № 1256</a> для получения дополнительной информации.
zh_cn: 有关更多信息，请参见<a href="https://github.com/Microsoft/TypeScript/issues/1256">问题＃1256</a>。

source: See <a href="https://github.com/Microsoft/TypeScript/wiki/Type-Checking-JavaScript-Files">Type checking JavaScript Files documentation</a> for more details.
ru: Дополнительные сведения см. В <a href="https://github.com/Microsoft/TypeScript/wiki/Type-Checking-JavaScript-Files">документации</a> к файлам JavaScript проверки типов .
zh_cn: 有关更多详细信息，请参见<a href="https://github.com/Microsoft/TypeScript/wiki/Type-Checking-JavaScript-Files">类型检查JavaScript文件文档</a>。

source: See <a href="https://www.npmjs.com/package/ts-loader">more details on ts-loader here</a>.
ru: Смотрите <a href="https://www.npmjs.com/package/ts-loader">более подробную информацию о TS-погрузчик здесь</a> .
zh_cn: <a href="https://www.npmjs.com/package/ts-loader">在此处</a>查看有关ts-loader的更多详细信息。

source: See <a href="tsconfig-json">tsconfig.json</a> documentation for more details.
ru: Подробнее <a href="tsconfig-json">см.</a> Документацию tsconfig.json .
zh_cn: 有关更多详细信息，请参见<a href="tsconfig-json">tsconfig.json</a>文档。

source: See the <a href="https://github.com/Microsoft/TypeScript/wiki/tsconfig.json">tsconfig.json wiki page</a> for more details.
ru: См. <a href="https://github.com/Microsoft/TypeScript/wiki/tsconfig.json">Вики-страницу tsconfig.json</a> для получения более подробной информации.
zh_cn: 有关更多详细信息，请参见<a href="https://github.com/Microsoft/TypeScript/wiki/tsconfig.json">tsconfig.json Wiki页面</a>。

source: See the <a href="modules">Modules</a> documentation for more information about modules. See the <a href="namespaces">Namespaces</a> documentation for more information about namespaces.
ru: См. Документацию по <a href="modules">модулям</a> для получения дополнительной информации о модулях. См. Документацию по <a href="namespaces">пространствам имен</a> для получения дополнительной информации о пространствах имен.
zh_cn: 有关<a href="modules">模块</a>的更多信息，请参见模块文档。有关<a href="namespaces">名称空间</a>的更多信息，请参见名称空间文档。

source: See the [[JSX]] wiki page for more information on using JSX in TypeScript.
ru: Дополнительную информацию об использовании JSX в TypeScript см.на вики-странице [[JSX]].
zh_cn: 参见[[JSX]]维基页面了解更多关于在TypeScript中使用JSX的信息。

source: Select <strong>ASP.NET Core Web Application</strong> and press the <em>Next</em> button
ru: Выберите <strong>веб-приложение ASP.NET Core</strong> и нажмите кнопку <em>Далее.</em>
zh_cn: 选择<strong>ASP.NET Core Web应用程序</strong>，然后按&ldquo; <em>下一步&rdquo;</em>按钮

source: Semicolon Formatter Option
ru: Вариант с запятой
zh_cn: 分号格式化选项

source: Semicolon-Aware Code Edits
ru: Редактирование кода Semicolon-Aware
zh_cn: 分号意识代码编辑

source: Sequentially Added Properties
ru: Последовательно добавленные свойства
zh_cn: 顺序添加的属性

source: Set up the build
ru: Установить сборку
zh_cn: 设置构建

source: Set up the server
ru: Установить сервер
zh_cn: 设置服务器

source: Setting <code>baseUrl</code> informs the compiler where to find modules. All module imports with non-relative names are assumed to be relative to the <code>baseUrl</code>.
ru: Установка <code>baseUrl</code> сообщает компилятору, где искать модули. Предполагается, что весь импорт модулей с не относительными именами относится к <code>baseUrl</code> .
zh_cn: 设置 <code>baseUrl</code> 会通知编译器在哪里可以找到模块。假定所有具有非相对名称的模块导入都相对于 <code>baseUrl</code> 。

source: Setting a top-level property <code>compileOnSave</code> signals to the IDE to generate all files for a given tsconfig.json upon saving.
ru: Установка свойства верхнего уровня <code>compileOnSave</code> сигнализирует IDE для создания всех файлов для данного tsconfig.json при сохранении.
zh_cn: 将顶级属性 <code>compileOnSave</code> 设置为向IDE发送信号，以在保存时为给定tsconfig.json生成所有文件。

source: Setting compiler options in <a href="compiler-options-in-msbuild">MSBuild projects</a>.
ru: Настройка параметров компилятора в <a href="compiler-options-in-msbuild">проектах MSBuild</a> .
zh_cn: 在<a href="compiler-options-in-msbuild">MSBuild项目中</a>设置编译器选项。

source: Setting compiler options in <a href="tsconfig-json"><code>tsconfig.json</code></a> files.
ru: Установка параметров компилятора в файлах <a href="tsconfig-json"> <code>tsconfig.json</code> </a> .
zh_cn: 在<a href="tsconfig-json"> <code>tsconfig.json</code> </a>文件中设置编译器选项。

source: Setting the new compiler flag <code>--allowSyntheticDefaultImports</code> indicates that the module loader performs some kind of synthetic default import member creation not indicated in the imported .ts or .d.ts. The compiler will infer the existence of a <code>default</code> export that has the shape of the entire module itself.
ru: Установка нового флага компилятора <code>--allowSyntheticDefaultImports</code> указывает, что загрузчик модуля выполняет какое-то синтетическое создание элемента импорта по умолчанию, не указанное в импортированных .ts или .d.ts. Компилятор сделает вывод о существовании экспорта по <code>default</code> который имеет форму всего модуля.
zh_cn: 设置新的编译器标志 <code>--allowSyntheticDefaultImports</code> 表示模块加载器执行某种合成的默认导入成员创建，但未在导入的.ts或.d.ts中指示。编译器将推断出 <code>default</code> 导出的存在，该默认导出具有整个模块本身的形状。

source: Setting up your Directories
ru: Настройте свои директории
zh_cn: 设置您的目录

source: Shadowing should <em>usually</em> be avoided in the interest of writing clearer code. While there are some scenarios where it may be fitting to take advantage of it, you should use your best judgement.
ru: <em>Обычно</em> следует избегать затенения в интересах написания более четкого кода. Хотя есть некоторые сценарии, в которых это может быть уместно, вам следует руководствоваться здравым смыслом.
zh_cn: 为了编写更清晰的代码，<em>通常</em>应该避免阴影。尽管在某些情况下可以利用它，但您应该使用最佳判断。

source: Shorthand ambient module declarations
ru: Короткое объявление модуля окружающей среды
zh_cn: 速记环境模块声明

source: Shorthand ambient modules
ru: Короткие окружающие модули
zh_cn: 速记环境模块

source: Show diagnostic information.
ru: Показывать диагностическую информацию.
zh_cn: 显示诊断信息。

source: Show verbose diagnostic information
ru: Показать многословную диагностическую информацию
zh_cn: 显示详细的诊断信息

source: Similar to a <code>/// &lt;reference path="..." /&gt;</code> directive, which serves as a declaration of <em>dependency</em>, a <code>/// &lt;reference types="..." /&gt;</code> directive declares a dependency on a package.
ru: Подобно директиве <code>/// &lt;reference path="..." /&gt;</code> , которая служит объявлением <em>зависимости</em> , директива <code>/// &lt;reference types="..." /&gt;</code> объявляет зависимость от пакета.
zh_cn: 与 <code>/// &lt;reference path="..." /&gt;</code> 指令类似，它用作<em>依赖项</em>的声明， <code>/// &lt;reference types="..." /&gt;</code> 指令声明对程序包的依赖性。

source: Similar to array spread, spreading an object can be handy to get a shallow copy:
ru: Как и при распространении по массиву,распространение объекта может быть удобно для получения неглубокой копии:
zh_cn: 类似于数组铺展,铺展一个对象可以方便地得到一个浅层的副本。

source: Similar to union and intersection types, conditional types are not permitted to reference themselves recursively. For example the following is an error.
ru: По аналогии с типами соединений и пересечений,условные типы не допускают рекурсивной ссылки на себя.Например,следующая ошибка.
zh_cn: 与联合类型和交叉类型类似,条件类型不允许递归引用自己。例如下面是一个错误。

source: Similarly a default import (i.e. <code>import d from "foo"</code>) for a CommonJS/AMD/UMD module as equivalent to <code>const d = require("foo").default</code>.Most of the CommonJS/AMD/UMD modules available today do not have a <code>default</code> export, making this import pattern practically unusable to import non-ES modules (i.e. CommonJS/AMD/UMD). For instance <code>import fs from "fs"</code> or <code>import express from "express"</code> are not allowed.
ru: Аналогично импорт по умолчанию (т.е. <code>import d from "foo"</code> ) для модуля CommonJS / AMD / UMD как эквивалент <code>const d = require("foo").default</code> Default . Большинство доступных сегодня модулей CommonJS / AMD / UMD не имеют по <code>default</code> экспорт, что делает эту модель импорта практически непригодным для импорта не-ES модулей (т.е. CommonJS / AMD / UMD). Например, <code>import fs from "fs"</code> или <code>import express from "express"</code> не разрешены.
zh_cn: 同样，CommonJS / AMD / UMD模块的默认导入（即 <code>import d from "foo"</code> ）等效于 <code>const d = require("foo").default</code> 当今大多数可用的CommonJS / AMD / UMD模块没有一个 <code>default</code> 出口，使得这个进口图案实际上不可用的导入非ES模块（即CommonJS的/ AMD / UMD）。例如，不允许 <code>import fs from "fs"</code> <code>import express from "express"</code> fs或从&ldquo; express&rdquo;导入Express。

source: Similarly to how we can use interfaces to describe function types, we can also describe types that we can &ldquo;index into&rdquo; like <code>a[10]</code>, or <code>ageMap["daniel"]</code>. Indexable types have an <em>index signature</em> that describes the types we can use to index into the object, along with the corresponding return types when indexing. Let&rsquo;s take an example:
ru: Подобно тому, как мы можем использовать интерфейсы для описания типов функций, мы также можем описывать типы, которые мы можем &laquo;индексировать&raquo;, например, <code>a[10]</code> или <code>ageMap["daniel"]</code> . Индексируемые типы имеют <em>подпись индекса,</em> которая описывает типы, которые мы можем использовать для индексации объекта, а также соответствующие типы возвращаемых данных при индексировании. Возьмем пример:
zh_cn: 与我们可以使用接口来描述函数类型的方法类似，我们还可以描述我们可以&ldquo;索引到&rdquo;的类型，例如 <code>a[10]</code> 或 <code>ageMap["daniel"]</code> 。可索引类型具有<em>索引签名</em>，该<em>签名</em>描述了可用于索引对象的类型以及建立索引时对应的返回类型。让我们举个例子：

source: Similarly to interfaces, namespaces of the same name will also merge their members. Since namespaces create both a namespace and a value, we need to understand how both merge.
ru: Подобно интерфейсам,одноименные пространства имен также объединяют своих членов.Поскольку пространства имен создают как пространство имен,так и значение,нам нужно понять,как оба они объединяются.
zh_cn: 与接口类似,同名的命名空间也会合并其成员。由于命名空间同时创建了一个命名空间和一个值,我们需要了解两者是如何合并的。

source: Similarly, <code>--target ES2017</code> will instruct the compiler not to transform ES2017-specific features like <code>async</code>/<code>await</code>.
ru: Точно так же <code>--target ES2017</code> проинструктирует компилятор не преобразовывать специфичные для ES2017 функции, такие как <code>async</code> / <code>await</code> .
zh_cn: 同样，-- <code>--target ES2017</code> 将指示编译器不要转换ES2017特定的功能，例如 <code>async</code> / <code>await</code> 。

source: Similarly, a non-relative import will follow the Node.js resolution logic, first looking up a file, then looking up an applicable folder. So <code>import { b } from "moduleB"</code> in source file <code>/root/src/moduleA.ts</code> would result in the following lookups:
ru: Точно так же не относительный импорт будет следовать логике разрешения Node.js, сначала ища файл, а затем ища подходящую папку. Таким образом, <code>import { b } from "moduleB"</code> в исходном файле <code>/root/src/moduleA.ts</code> приведет к следующим поискам:
zh_cn: 同样，非相对导入将遵循Node.js解析逻辑，首先查找文件，然后查找适用的文件夹。因此， <code>import { b } from "moduleB"</code> 源文件 <code>/root/src/moduleA.ts</code> 中的&ldquo; moduleB&rdquo;导入{b}将导致以下查找：

source: Similarly, destructuring can be used in function parameter declarations:
ru: Аналогичным образом,деструкцию можно использовать в объявлениях параметров функции:
zh_cn: 同样,在函数参数声明中也可以使用重构。

source: Similarly, namespaces can be used to extend enums with static members:
ru: Аналогичным образом,пространства имен могут быть использованы для расширения перечислений со статическими членами:
zh_cn: 同样,命名空间也可以用来扩展具有静态成员的枚举。

source: Similarly, the global scope can be augmented from modules using a <code>declare global</code> declarations:
ru: Точно так же глобальная область видимости может быть расширена за счет модулей с помощью <code>declare global</code> :
zh_cn: 同样，可以使用 <code>declare global</code> 声明从模块扩展全局范围：

source: Similarly, try removing all the arguments to the greeter call. TypeScript will let you know that you have called this function with an unexpected number of parameters. In both cases, TypeScript can offer static analysis based on both the structure of your code, and the type annotations you provide.
ru: Точно так же попробуйте убрать все аргументы в пользу приветственного вызова.TypeScript сообщит вам,что вы вызвали эту функцию с неожиданным количеством параметров.В обоих случаях TypeScript может предложить статический анализ,основанный как на структуре вашего кода,так и на предоставленных вами аннотациях типов.
zh_cn: 同样,尝试删除所有参数到greeter调用。TypeScript会让你知道,你调用这个函数的参数数量出乎意料。在这两种情况下,TypeScript可以根据你的代码结构和你提供的类型注释提供静态分析。

source: Similarly, you can merge several different objects. In the following example, <code>merged</code> will have properties from <code>foo</code>, <code>bar</code>, and <code>baz</code>.
ru: Точно так же вы можете объединить несколько разных объектов. В следующем примере <code>merged</code> будет иметь свойства из <code>foo</code> , <code>bar</code> и <code>baz</code> .
zh_cn: 同样，您可以合并几个不同的对象。在以下示例中， <code>merged</code> 将具有 <code>foo</code> ， <code>bar</code> 和 <code>baz</code> 的属性。

source: Similarly, you could write a utility type like <code>Writable</code> mapped type that strips away <code>readonly</code>-ness, and that would convert <code>readonly</code> array containers back to their mutable equivalents.
ru: Точно так же вы могли бы написать служебный тип, такой как <code>Writable</code> mapped type, который удаляет <code>readonly</code> чтения и конвертирует контейнеры массивов только для <code>readonly</code> обратно в их изменяемые эквиваленты.
zh_cn: 类似地，您可以编写一种实用程序类型，例如 <code>Writable</code> 映射类型，该实用程序类型将剥夺 <code>readonly</code> -ness，并将其转换为 <code>readonly</code> 数组容器，使其变为可变的等效项。

source: Simple Combinations: One name, multiple meanings
ru: Простые комбинации:Одно имя,несколько значений
zh_cn: 简单的组合。一个名字,多种含义

source: Simple Example
ru: Простой пример
zh_cn: 简单的例子

source: Simplified <code>props</code> type management in React
ru: Упрощенная <code>props</code> управления типа в React
zh_cn: React中简化的 <code>props</code> 类型管理

source: Since <code>keyof</code> now reflects the presence of a numeric index signature by including type <code>number</code> in the key type, mapped types such as <code>Partial&lt;T&gt;</code> and <code>Readonly&lt;T&gt;</code> work correctly when applied to object types with numeric index signatures:
ru: Поскольку теперь <code>keyof</code> отражает наличие подписи числового индекса, включая <code>number</code> типа в тип ключа, сопоставленные типы, такие как <code>Partial&lt;T&gt;</code> и <code>Readonly&lt;T&gt;</code> работают правильно при применении к типам объектов с подписями числовых индексов:
zh_cn: 由于 <code>keyof</code> 现在通过在密钥类型中包含类型 <code>number</code> 来反映数字索引签名的存在，因此，当映射类型（例如 <code>Partial&lt;T&gt;</code> 和 <code>Readonly&lt;T&gt;</code> 应用于具有数字索引签名的对象类型时，它们可以正常工作：

source: Since JavaScript automatically terminates the <code>return</code> statement at the end of the line, the object literal becomes a block.
ru: Поскольку JavaScript автоматически завершает оператор <code>return</code> в конце строки, литерал объекта становится блоком.
zh_cn: 由于JavaScript 在行的结尾处自动终止 <code>return</code> 语句，因此对象文字成为一个块。
