Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/typescript/typescript.*.003.xlf
Languages: es, ko, ru, zh_cn

source: One difference from the prior example is that each derived class that contains a constructor function <em>must</em> call <code>super()</code> which will execute the constructor of the base class. What&rsquo;s more, before we <em>ever</em> access a property on <code>this</code> in a constructor body, we <em>have</em> to call <code>super()</code>. This is an important rule that TypeScript will enforce.
es: Una diferencia con el ejemplo anterior es que cada clase derivada que contiene una funci&oacute;n constructora <em>debe</em> llamar a <code>super()</code> que ejecutar&aacute; el constructor de la clase base. Lo que es m&aacute;s, antes de que <em>alguna vez</em> acceder a una propiedad de <code>this</code> en un cuerpo del constructor, que <em>tenemos</em> que llamar a <code>super()</code> . Esta es una regla importante que TypeScript aplicar&aacute;.
ko: 이전 예제와의 한 가지 차이점은 생성자 함수를 포함하는 각 파생 클래스 는 기본 클래스의 생성자를 실행하는 <code>super()</code> 를 호출 <em>해야한다는</em> 것입니다. 우리가 전에, 무엇보다 <em>지금까지</em> 의 속성에 접근 <code>this</code> 생성자 본문에, 우리는 <em>이</em> 호출 <code>super()</code> . 이것은 TypeScript가 적용 할 중요한 규칙입니다.<em></em><em></em>
ru: Одно отличие от предыдущего примера состоит в том, что каждый производный класс, содержащий функцию конструктора, <em>должен</em> вызывать <code>super()</code> который будет выполнять конструктор базового класса. Более того, прежде чем мы <em>когда-либо</em> получим доступ к свойству <code>this</code> в теле конструктора, мы <em>должны</em> вызвать <code>super()</code> . Это важное правило, которое TypeScript будет соблюдать.
zh_cn: 与先前示例的不同之处在于，每个包含构造函数的派生类都<em>必须</em>调用 <code>super()</code> ，它将执行基类的构造函数。更重要的是，我们之前<em>曾</em>访问属性 <code>this</code> 在构造函数体，我们<em>必须</em>调用 <code>super()</code> 。这是TypeScript将强制执行的重要规则。

source: One difference is that interfaces create a new name that is used everywhere. Type aliases don&rsquo;t create a new name &mdash; for instance, error messages won&rsquo;t use the alias name. In the code below, hovering over <code>interfaced</code> in an editor will show that it returns an <code>Interface</code>, but will show that <code>aliased</code> returns object literal type.
es: Una diferencia es que las interfaces crean un nuevo nombre que se usa en todas partes. Los alias de tipo no crean un nombre nuevo; por ejemplo, los mensajes de error no usar&aacute;n el nombre de alias. En el c&oacute;digo siguiente, al pasar el cursor sobre la <code>interfaced</code> en un editor, se mostrar&aacute; que devuelve una <code>Interface</code> , pero mostrar&aacute; que con <code>aliased</code> devuelve el tipo de objeto literal.
ko: 한 가지 차이점은 인터페이스가 모든 곳에서 사용되는 새로운 이름을 생성한다는 것입니다. 유형 별칭은 새 이름을 만들지 않습니다. 예를 들어 오류 메시지는 별칭 이름을 사용하지 않습니다. 아래의 코드에서 유혹 <code>interfaced</code> 그것이 반환 표시됩니다 편집기에서 <code>Interface</code> ,하지만 표시됩니다 <code>aliased</code> 반환 문자 오브젝트 유형.
ru: Одно отличие состоит в том, что интерфейсы создают новое имя, которое используется везде. Псевдонимы типа не создают новое имя - например, в сообщениях об ошибках не будет использоваться псевдоним. В приведенном ниже коде наведение курсора на <code>interfaced</code> в редакторе покажет, что он возвращает <code>Interface</code> , но покажет, что <code>aliased</code> возвращает тип литерала объекта.
zh_cn: 不同之处在于，接口创建了一个新名称，该名称随处可见。类型别名不会创建新名称-例如，错误消息不会使用别名。在下面的代码中，将鼠标悬停在编辑器中的 <code>interfaced</code> 上将显示它返回一个 <code>Interface</code> ，但是将显示 <code>aliased</code> 返回了对象文字类型。

source: One exception to this rule is specialized signatures. If a signature has a parameter whose type is a <em>single</em> string literal type (e.g. not a union of string literals), then it will be bubbled toward the top of its merged overload list.
es: Una excepci&oacute;n a esta regla son las firmas especializadas. Si una firma tiene un par&aacute;metro cuyo tipo es un tipo literal de cadena <em>&uacute;nica</em> (por ejemplo, no una uni&oacute;n de literales de cadena), entonces aparecer&aacute; en la parte superior de su lista de sobrecarga combinada.
ko: 이 규칙의 한 가지 예외는 특수 서명입니다. 서명에 유형이 <em>단일</em> 문자열 리터럴 유형 (예 : 문자열 리터럴의 결합이 아님) 인 매개 변수가있는 경우 병합 된 과부하 목록의 상단으로 버블 링됩니다.
ru: Единственным исключением из этого правила являются специализированные подписи. Если в сигнатуре есть параметр, тип которого является <em>одним</em> строковым литералом (например, не объединением строковых литералов), то он будет перемещаться в верхнюю часть своего объединенного списка перегрузки.
zh_cn: 该规则的一个例外是专用签名。如果签名的参数类型是<em>单个</em>字符串文字类型（例如，不是字符串文字的并集），则它将被冒泡到其合并的重载列表的顶部。

source: One final way to get around these checks, which might be a bit surprising, is to assign the object to another variable: Since <code>squareOptions</code> won&rsquo;t undergo excess property checks, the compiler won&rsquo;t give you an error.
es: Una &uacute;ltima forma de evitar estas comprobaciones, que puede resultar un poco sorprendente, es asignar el objeto a otra variable: dado que <code>squareOptions</code> no se someter&aacute; a comprobaciones de propiedad excesivas, el compilador no le dar&aacute; ning&uacute;n error.
ko: 놀랍게도 이러한 검사를 해결하는 마지막 방법 중 하나는 객체를 다른 변수에 할당하는 것입니다 . <code>squareOptions</code> 는 과도한 속성 검사를받지 않으므로 컴파일러에서 오류를 발생시키지 않습니다.
ru: Последний способ обойти эти проверки, который может быть немного удивительным, - это присвоить объект другой переменной: поскольку <code>squareOptions</code> не будет подвергаться избыточным проверкам свойств, компилятор не выдаст вам ошибку.
zh_cn: 解决这些检查的最后一种方法（可能有点令人惊讶）是将对象分配给另一个变量：由于 <code>squareOptions</code> 不会进行过多的属性检查，因此编译器不会给您错误。

source: One great benefit of this is that you&rsquo;ll see <em>way fewer</em> implicit <code>any</code> errors when running with <code>--noImplicitAny</code>. Implicit <code>any</code> errors are only reported when the compiler is unable to know the type of a variable without a type annotation.
es: Una gran ventaja de esto es que usted ver&aacute; <em>manera menos</em> impl&iacute;citos <code>any</code> errores cuando se ejecuta con <code>--noImplicitAny</code> . Impl&iacute;citos <code>any</code> errores que s&oacute;lo se notifique cuando el compilador no es capaz de conocer el tipo de una variable sin una anotaci&oacute;n de tipo.
ko: 이 하나의 큰 장점은 볼 수 있다는 것입니다 <em>방법을 적은</em> 암시 <code>any</code> 실행시 오류를 <code>--noImplicitAny</code> . 컴파일러가 유형 주석없이 변수의 유형을 알 수없는 경우에만 내재 <code>any</code> 오류가보고됩니다.
ru: Одно большое преимущество в том , что вы будете видеть <em>путь меньше</em> неявные <code>any</code> ошибки при работе с <code>--noImplicitAny</code> . Неявно <code>any</code> ошибки сообщаются только в том случае, если компилятор не может узнать тип переменной без аннотации типа.
zh_cn: 这样做的一大好处是，使用 <code>--noImplicitAny</code> 运行时，您将看到<em>更少的</em>隐式 <code>any</code> 错误。仅当编译器在没有类型注释的情况下不知道变量的类型时，才隐式报告 <code>any</code> 错误。

source: One important difference between ambient and non-ambient enums is that, in regular enums, members that don&rsquo;t have an initializer will be considered constant if its preceding enum member is considered constant. In contrast, an ambient (and non-const) enum member that does not have initializer is <em>always</em> considered computed.
es: Una diferencia importante entre las enumeraciones ambientales y no ambientales es que, en las enumeraciones regulares, los miembros que no tienen un inicializador se considerar&aacute;n constantes si su miembro de enumeraci&oacute;n anterior se considera constante. Por el contrario, un miembro de enumeraci&oacute;n ambiental (y no constante) que no tiene inicializador <em>siempre se</em> considera calculado.
ko: 주변 열거 형과 주변이 아닌 열거 형의 중요한 차이점 중 하나는 일반 열거 형에서는 이니셜 라이저가없는 멤버는 이전 열거 형 멤버가 상수로 간주 될 경우 상수로 간주된다는 것입니다. 반대로 이니셜 라이저가없는 앰비언트 (및 비 const) 열거 형 멤버는 <em>항상</em> 계산 된 것으로 간주됩니다.
ru: Одно из важных различий между внешними и внешними перечислениями заключается в том, что в обычных перечислениях члены, не имеющие инициализатора, будут считаться постоянными, если их предыдущий член перечисления считается постоянным. Напротив, внешний (и неконстантный) член перечисления, у которого нет инициализатора, <em>всегда</em> считается вычисленным.
zh_cn: 环境枚举和非环境枚举之间的一个重要区别是，在常规枚举中，如果没有其初始值设定项的成员被视为常量，则该成员将被视为常量。相反，<em>始终</em>将没有初始化程序的环境（和非const）枚举成员视为已计算。

source: One of TypeScript&rsquo;s core principles is that type checking focuses on the <em>shape</em> that values have. This is sometimes called &ldquo;duck typing&rdquo; or &ldquo;structural subtyping&rdquo;. In TypeScript, interfaces fill the role of naming these types, and are a powerful way of defining contracts within your code as well as contracts with code outside of your project.
es: Uno de los principios b&aacute;sicos de TypeScript es que la verificaci&oacute;n de tipos se centra en la <em>forma</em> que tienen los valores. Esto a veces se denomina "tipificaci&oacute;n de pato" o "subtipo estructural". En TypeScript, las interfaces cumplen la funci&oacute;n de nombrar estos tipos y son una forma poderosa de definir contratos dentro de su c&oacute;digo, as&iacute; como contratos con c&oacute;digo fuera de su proyecto.
ko: TypeScript의 핵심 원칙 중 하나는 유형 검사 가 값 의 <em>모양에</em> 중점을 둔다 는 것입니다. 이것을 "덕 타이핑"또는 "구조적 서브 타이핑"이라고도합니다. TypeScript에서 인터페이스는 이러한 유형의 이름을 지정하는 역할을하며 프로젝트 외부의 코드와 계약뿐만 아니라 코드 내에서 계약을 정의하는 강력한 방법입니다.
ru: Один из основных принципов TypeScript заключается в том, что проверка типов фокусируется на <em>форме,</em> которую имеют значения. Иногда это называют &laquo;утиным типированием&raquo; или &laquo;структурным подтипом&raquo;. В TypeScript интерфейсы выполняют роль именования этих типов и являются мощным способом определения контрактов в вашем коде, а также контрактов с кодом вне вашего проекта.
zh_cn: TypeScript的核心原则之一是类型检查重点在于值的<em>形状</em>。有时称为&ldquo;鸭式打字&rdquo;或&ldquo;结构子类型化&rdquo;。在TypeScript中，接口充当命名这些类型的角色，并且是定义代码内契约以及项目外代码契约的有效方法。

source: One of the most common uses of interfaces in languages like C# and Java, that of explicitly enforcing that a class meets a particular contract, is also possible in TypeScript.
es: Uno de los usos más comunes de las interfaces en lenguajes como C#y Java,el de hacer cumplir explícitamente que una clase cumple un contrato determinado,también es posible en TypeScript.
ko: 클래스가 특정 계약을 충족하도록 명시 적으로 적용하는 C # 및 Java와 같은 언어에서 인터페이스의 가장 일반적인 용도 중 하나는 TypeScript에서도 가능합니다.
ru: Одно из наиболее распространённых использований интерфейсов в таких языках,как C#и Java,то есть явное принуждение класса к выполнению определённого контракта,также возможно и в TypeScript.
zh_cn: 在像C#和Java这样的语言中,接口最常见的用法之一,即显式强制一个类满足特定的合同,在TypeScript中也是可能的。

source: One or more assignments to <code>window.someName</code>
es: Una o m&aacute;s asignaciones a <code>window.someName</code>
ko: <code>window.someName</code> 에 대한 하나 이상의 할당
ru: Одно или несколько назначений <code>window.someName</code>
zh_cn: 一个或多个分配给 <code>window.someName</code>

source: One such example is an object that acts as both a function and an object, with additional properties:
es: Un ejemplo de ello es un objeto que actúa tanto como función como objeto,con propiedades adicionales:
ko: 그러한 예 중 하나는 추가 속성을 가진 함수와 객체의 역할을하는 객체입니다.
ru: Одним из таких примеров является объект,который действует и как функция,и как объект,с дополнительными свойствами:
zh_cn: 一个这样的例子是一个既是函数又是对象的对象,还带有附加属性。

source: One thing to note is that <code>const</code> assertions can only be applied immediately on simple literal expressions.
es: Una cosa a tener en cuenta es que las aserciones <code>const</code> antes solo se pueden aplicar inmediatamente en expresiones literales simples.
ko: 한 가지 주목할 점은 <code>const</code> 어설 션은 간단한 리터럴 표현식에만 즉시 적용될 수 있다는 것 입니다.
ru: Следует отметить, что <code>const</code> утверждения можно сразу применить только к простым литеральным выражениям.
zh_cn: 需要注意的一件事是， <code>const</code> 断言只能立即应用于简单的文字表达式。

source: Only emit &lsquo;.d.ts&rsquo; declaration files.
es: Emite solo archivos de declaraci&oacute;n '.d.ts'.
ko: '.d.ts'선언 파일 만 내 보냅니다.
ru: Выдавать только файлы объявлений '.d.ts'.
zh_cn: 仅发出&ldquo; .d.ts&rdquo;声明文件。

source: Open <code>greeter.html</code> in the browser to run your first simple TypeScript web application!
es: Abra <code>greeter.html</code> en el navegador para ejecutar su primera aplicaci&oacute;n web simple de TypeScript.
ko: 브라우저에서 <code>greeter.html</code> 을 열어 첫 번째 간단한 TypeScript 웹 응용 프로그램을 실행하십시오!
ru: Откройте <code>greeter.html</code> в браузере, чтобы запустить ваше первое простое веб-приложение TypeScript!
zh_cn: 在浏览器中打开 <code>greeter.html</code> 以运行您的第一个简单的TypeScript Web应用程序！

source: Open <strong>Dependencies &gt; Manage NuGet Packages &gt; Browse.</strong> Search and install <code>Microsoft.AspNetCore.StaticFiles</code> and <code>Microsoft.TypeScript.MSBuild</code>:
es: Abra <strong>Dependencias&gt; Administrar paquetes NuGet&gt; Examinar. </strong>Busque e instale <code>Microsoft.AspNetCore.StaticFiles</code> y <code>Microsoft.TypeScript.MSBuild</code> :
ko: 열기 <strong>종속성&gt;&gt; 찾아보기를 NuGet 패키지를 관리 할 수 있습니다. </strong> <code>Microsoft.AspNetCore.StaticFiles</code> 및 <code>Microsoft.TypeScript.MSBuild</code> 를 검색하여 설치 하십시오 .
ru: Откройте <strong>зависимости&gt; Управление пакетами NuGet&gt; Обзор. </strong>Найдите и установите <code>Microsoft.AspNetCore.StaticFiles</code> и <code>Microsoft.TypeScript.MSBuild</code> :
zh_cn: 打开<strong>依赖关系&gt;管理NuGet软件包&gt;浏览。</strong>搜索并安装 <code>Microsoft.AspNetCore.StaticFiles</code> 和 <code>Microsoft.TypeScript.MSBuild</code> ：

source: Open up your <code>Startup.cs</code> file and edit your <code>Configure</code> function to look like this:
es: Abra su archivo <code>Startup.cs</code> y edite su funci&oacute;n <code>Configure</code> para que se vea as&iacute;:
ko: <code>Startup.cs</code> 파일을 열고 다음과 같이 <code>Configure</code> 기능을 편집하십시오 .
ru: Откройте файл <code>Startup.cs</code> и отредактируйте функцию <code>Configure</code> , чтобы она выглядела следующим образом:
zh_cn: 打开您的 <code>Startup.cs</code> 文件并编辑您的 <code>Configure</code> 函数，如下所示：

source: Option <code>--outDir</code> duplicates the input hierarchy in the output. The compiler computes the root of the input files as the longest common path of all input files; and then uses that to replicate all its substructure in the output.
es: Option <code>--outDir</code> duplica la jerarqu&iacute;a de entrada en la salida. El compilador calcula la ra&iacute;z de los archivos de entrada como la ruta com&uacute;n m&aacute;s larga de todos los archivos de entrada; y luego lo usa para replicar toda su subestructura en la salida.
ko: <code>--outDir</code> 옵션 은 출력에서 ​​입력 계층을 복제합니다. 컴파일러는 입력 파일의 루트를 모든 입력 파일의 가장 긴 공통 경로로 계산합니다. 그런 다음이를 사용하여 모든 하위 구조를 출력에 복제합니다.
ru: Опция <code>--outDir</code> дублирует входную иерархию в выходной. Компилятор вычисляет корень входных файлов как самый длинный общий путь для всех входных файлов; а затем использует это для репликации всей своей подструктуры в выходных данных.
zh_cn: 选项 <code>--outDir</code> 在输出中复制输入层次结构。编译器将输入文件的根计算为所有输入文件的最长公共路径。然后使用它在输出中复制其所有子结构。

source: Optional <code>catch</code> clause variables
es: Variables de cl&aacute;usula <code>catch</code> opcionales
ko: 선택적 <code>catch</code> 절 변수
ru: Необязательные переменные предложения <code>catch</code>
zh_cn: 可选的 <code>catch</code> 子句变量

source: Optional Chaining
es: Encadenamiento opcional
ko: 옵션 체인
ru: Дополнительная цепочка
zh_cn: 可选链式

source: Optional Module Loading and Other Advanced Loading Scenarios
es: Carga del módulo opcional y otros escenarios de carga avanzada
ko: 선택적 모듈 로딩 및 기타 고급 로딩 시나리오
ru: Дополнительные сценарии загрузки модулей и другие сценарии загрузки дополнительных модулей
zh_cn: 可选模块加载和其他高级加载方案

source: Optional Parameters and Rest Parameters
es: Parámetros opcionales y parámetros de descanso
ko: 선택적 매개 변수 및 나머지 매개 변수
ru: Дополнительные параметры и параметры отдохновения
zh_cn: 可选参数和其余参数

source: Optional Parameters in Callbacks
es: Parámetros opcionales en las llamadas de retorno
ko: 콜백의 선택적 매개 변수
ru: Дополнительные параметры в обратных вызовах
zh_cn: 回调中的可选参数

source: Optional Properties
es: Propiedades opcionales
ko: 선택적 속성
ru: Дополнительные свойства
zh_cn: 可选属性

source: Optional and Default Parameters
es: Parámetros opcionales y predeterminados
ko: 선택적 및 기본 매개 변수
ru: Дополнительные параметры и параметры по умолчанию
zh_cn: 可选参数和默认参数

source: Optional chaining also includes two other operations. First there&rsquo;s the <em>optional element access</em> which acts similarly to optional property accesses, but allows us to access non-identifier properties (e.g. arbitrary strings, numbers, and symbols):
es: El encadenamiento opcional tambi&eacute;n incluye otras dos operaciones. Primero est&aacute; el <em>acceso al elemento opcional</em> que act&uacute;a de manera similar a los accesos a propiedades opcionales, pero nos permite acceder a propiedades que no son identificadores (por ejemplo, cadenas arbitrarias, n&uacute;meros y s&iacute;mbolos):
ko: 선택적 체인에는 두 가지 다른 작업도 포함됩니다. 먼저 선택적 속성 액세스와 유사하게 작동하지만 식별자가 아닌 속성 (예 : 임의의 문자열, 숫자 및 기호)에 액세스 할 수 있는 <em>선택적 요소 액세스</em> 가 있습니다.
ru: Необязательная цепочка также включает две другие операции. Во-первых, есть <em>необязательный доступ к элементу,</em> который действует аналогично <em>доступу</em> к необязательному свойству, но позволяет нам получать доступ к свойствам, не являющимся идентификаторами (например, произвольным строкам, числам и символам):
zh_cn: 可选链接还包括其他两个操作。首先是<em>可选元素访问</em>，其行为与可选属性访问类似，但是允许我们访问非标识符属性（例如，任意字符串，数字和符号）：

source: Optional chaining is <a href="https://github.com/microsoft/TypeScript/issues/16">issue #16</a> on our issue tracker. For context, there have been over 23,000 issues on the TypeScript issue tracker since then.
es: El encadenamiento opcional es el <a href="https://github.com/microsoft/TypeScript/issues/16">n&uacute;mero 16</a> de nuestro rastreador de problemas. Para el contexto, ha habido m&aacute;s de 23,000 problemas en el rastreador de problemas de TypeScript desde entonces.
ko: 선택적 체이닝은 이슈 트래커의 이슈 <a href="https://github.com/microsoft/TypeScript/issues/16"># 16</a> 입니다. 문맥 상, 그 이후로 TypeScript 이슈 트래커에 23,000 개가 넘는 이슈가있었습니다.
ru: Необязательная цепочка - это <a href="https://github.com/microsoft/TypeScript/issues/16">проблема №16</a> в нашем трекере проблем. Для контекста, с тех пор в системе отслеживания проблем TypeScript было зарегистрировано более 23 000 проблем.
zh_cn: 可选链接是问题跟踪器上的问题<a href="https://github.com/microsoft/TypeScript/issues/16">16</a>。从上下文来看，自那时以来，TypeScript问题跟踪器上已有23,000多个问题。

source: Optional class properties
es: Propiedades de clase opcionales
ko: 선택적 클래스 속성
ru: Дополнительные свойства класса
zh_cn: 可选类属性

source: Optional elements in tuple types
es: Elementos opcionales en los tipos de tupla
ko: 튜플 유형의 선택적 요소
ru: Дополнительные элементы в типах кортежей
zh_cn: 元组类型中的可选元素

source: Optional elements in tuple types.
es: Elementos opcionales en los tipos de tupla.
ko: 튜플 유형의 선택적 요소
ru: Дополнительные элементы в типах кортежей.
zh_cn: 元组类型中的可选元素。

source: Optional parameters and properties
es: Parámetros y propiedades opcionales
ko: 선택적 매개 변수 및 특성
ru: Дополнительные параметры и свойства
zh_cn: 可选参数和属性

source: Optional parameters and properties automatically have <code>undefined</code> added to their types, even when their type annotations don&rsquo;t specifically include <code>undefined</code>. For example, the following two types are identical:
es: Los par&aacute;metros y propiedades opcionales se agregan autom&aacute;ticamente <code>undefined</code> a sus tipos, incluso cuando sus anotaciones de tipo no incluyen espec&iacute;ficamente <code>undefined</code> . Por ejemplo, los dos tipos siguientes son id&eacute;nticos:
ko: 선택적 매개 변수와 속성에는 형식 주석에 <code>undefined</code> 가 포함되어 있지 않은 경우에도 형식에 자동으로 <code>undefined</code> 가 추가됩니다 . 예를 들어 다음 두 가지 유형이 동일합니다.
ru: Дополнительные параметры и свойства автоматически были <code>undefined</code> добавлены к типам, даже если их аннотации типов конкретно не включают <code>undefined</code> . Например, следующие два типа идентичны:
zh_cn: 可选参数和属性会自动在其类型中添加 <code>undefined</code> ，即使它们的类型注释中没有明确包含 <code>undefined</code> 。例如，以下两种类型是相同的：

source: Optional properties and methods can now be declared in classes, similar to what is already permitted in interfaces.
es: Las propiedades y métodos opcionales pueden ahora ser declarados en clases,de manera similar a lo que ya se permite en las interfaces.
ko: 인터페이스에서 이미 허용 된 것과 유사한 클래스에서 선택적 속성 및 메서드를 선언 할 수 있습니다.
ru: Дополнительные свойства и методы теперь могут быть объявлены в классах,аналогично тому,что уже разрешено в интерфейсах.
zh_cn: 现在可以在类中声明可选属性和方法,类似于接口中已经允许的内容。

source: Optional: Open <code>greeter.ts</code> in Visual Studio, or copy the code into the TypeScript playground. You can hover over identifiers to see their types. Notice that in some cases these types are inferred automatically for you. Re-type the last line, and see completion lists and parameter help based on the types of the DOM elements. Put your cursor on the reference to the greeter function, and hit F12 to go to its definition. Notice, too, that you can right-click on a symbol and use refactoring to rename it.
es: Opcional: abra <code>greeter.ts</code> en Visual Studio o copie el c&oacute;digo en el &aacute;rea de juegos de TypeScript. Puede colocar el cursor sobre los identificadores para ver sus tipos. Tenga en cuenta que, en algunos casos, estos tipos se infieren autom&aacute;ticamente. Vuelva a escribir la &uacute;ltima l&iacute;nea y vea las listas de finalizaci&oacute;n y la ayuda de los par&aacute;metros seg&uacute;n los tipos de elementos DOM. Coloque el cursor en la referencia a la funci&oacute;n de bienvenida y presione F12 para ir a su definici&oacute;n. Tenga en cuenta tambi&eacute;n que puede hacer clic con el bot&oacute;n derecho en un s&iacute;mbolo y usar la refactorizaci&oacute;n para cambiarle el nombre.
ko: 선택 사항 : Visual Studio에서 <code>greeter.ts</code> 를 열거 나 코드를 TypeScript 놀이터로 복사하십시오. 식별자 위에 마우스를 올려 놓으면 해당 유형을 볼 수 있습니다. 경우에 따라 이러한 유형이 자동으로 유추됩니다. 마지막 행을 다시 입력하고 DOM 요소 유형에 따라 완료 목록 및 매개 변수 도움말을 참조하십시오. greeter 함수에 대한 참조에 커서를 놓고 F12를 눌러 정의로 이동하십시오. 또한 심볼을 마우스 오른쪽 버튼으로 클릭하고 리팩토링을 사용하여 이름을 바꿀 수 있습니다.
ru: Необязательно: откройте <code>greeter.ts</code> в Visual Studio или скопируйте код на площадку TypeScript. Вы можете навести указатель мыши на идентификаторы, чтобы увидеть их типы. Обратите внимание, что в некоторых случаях эти типы выводятся автоматически. Повторно введите последнюю строку и посмотрите списки завершения и справку по параметрам, основанные на типах элементов DOM. Наведите курсор на ссылку на функцию приветствия и нажмите F12, чтобы перейти к ее определению. Также обратите внимание, что вы можете щелкнуть правой кнопкой мыши по символу и использовать рефакторинг, чтобы переименовать его.
zh_cn: 可选：在Visual Studio中打开 <code>greeter.ts</code> ，或将代码复制到TypeScript游乐场。您可以将鼠标悬停在标识符上以查看其类型。请注意，在某些情况下，会自动为您推断这些类型。重新输入最后一行，然后根据DOM元素的类型查看完成列表和参数帮助。将光标放在对greeter函数的引用上，然后按F12键转到其定义。还要注意，您可以右键单击符号，然后使用重构将其重命名。

source: Optionally, a module can wrap one or more modules and combine all their exports using <code>export * from "module"</code> syntax.
es: Opcionalmente, un m&oacute;dulo puede envolver uno o m&aacute;s m&oacute;dulos y combinar todas sus exportaciones usando la sintaxis <code>export * from "module"</code> .
ko: 선택적으로 모듈은 하나 이상의 모듈을 랩핑하고 <code>export * from "module"</code> 구문을 사용하여 모든 내보내기를 결합 할 수 있습니다 .
ru: При желании, модуль может обернуть один или несколько модулей и объединить все их экспорты с помощью синтаксиса <code>export * from "module"</code> .
zh_cn: 可选地，一个模块可以包装一个或多个模块，并使用 <code>export * from "module"</code> 语法的export *组合其所有导出。

source: Or ignore trailing elements, or other elements:
es: O ignorar los elementos que van a la zaga,u otros elementos:
ko: 또는 후행 요소 나 다른 요소는 무시하십시오.
ru: Или проигнорируйте элементы "следа",или другие элементы:
zh_cn: 或忽略尾部元素,或其他元素。

source: Or other elements:
es: O de otros elementos:
ko: 또는 다른 요소들 :
ru: Или другие элементы:
zh_cn: 或其他要素。
