Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/typescript/typescript.*.003.xlf
Languages: es, ko, ru, zh_cn

source: Notice that even though we used ES2015 module syntax, TypeScript emitted CommonJS modules that Node uses. We&rsquo;ll stick with CommonJS for this tutorial, but you could set <code>module</code> in the options object to change this.
es: Tenga en cuenta que aunque usamos la sintaxis del m&oacute;dulo ES2015, TypeScript emiti&oacute; m&oacute;dulos CommonJS que usa Node. Nos quedaremos con CommonJS para este tutorial, pero puede configurar el <code>module</code> en el objeto de opciones para cambiar esto.
ko: ES2015 모듈 구문을 사용했지만 TypeScript는 Node가 사용하는 CommonJS 모듈을 생성했습니다. 이 튜토리얼에서는 CommonJS를 사용하지만 옵션 객체에서 <code>module</code> 을 설정 하여이를 변경할 수 있습니다.

source: Notice that our example has changed to be something slightly different. Instead of describing a generic function, we now have a non-generic function signature that is a part of a generic type. When we use <code>GenericIdentityFn</code>, we now will also need to specify the corresponding type argument (here: <code>number</code>), effectively locking in what the underlying call signature will use. Understanding when to put the type parameter directly on the call signature and when to put it on the interface itself will be helpful in describing what aspects of a type are generic.
es: Observe que nuestro ejemplo ha cambiado para ser algo ligeramente diferente. En lugar de describir una funci&oacute;n gen&eacute;rica, ahora tenemos una firma de funci&oacute;n no gen&eacute;rica que es parte de un tipo gen&eacute;rico. Cuando usamos <code>GenericIdentityFn</code> , ahora tambi&eacute;n necesitaremos especificar el argumento de tipo correspondiente (aqu&iacute;: <code>number</code> ), bloqueando efectivamente lo que usar&aacute; la firma de llamada subyacente. Comprender cu&aacute;ndo colocar el par&aacute;metro de tipo directamente en la firma de la llamada y cu&aacute;ndo colocarlo en la propia interfaz ser&aacute; &uacute;til para describir qu&eacute; aspectos de un tipo son gen&eacute;ricos.
ko: 이 예는 약간 다른 것으로 변경되었습니다. 제네릭 함수를 설명하는 대신 이제 제네릭 형식의 일부인 제네릭이 아닌 함수 서명이 있습니다. <code>GenericIdentityFn</code> 을 사용할 때 해당 유형 인수를 지정해야합니다 (여기 : <code>number</code> ) 하여 기본 호출 서명이 사용할 항목을 효과적으로 잠급니다. 유형 매개 변수를 호출 시그니처에 직접 배치 할시기와 인터페이스 자체에 배치하는시기를 이해하면 유형의 일반적인 측면을 설명하는 데 도움이됩니다.

source: Notice that the elements of each group maintains the same order, but the groups themselves are merged with later overload sets ordered first.
es: Fíjese que los elementos de cada grupo mantienen el mismo orden,pero los grupos mismos se fusionan con conjuntos de sobrecarga posteriores ordenados primero.
ko: 각 그룹의 요소는 동일한 순서를 유지하지만 그룹 자체는 나중에 주문 된 이후의 과부하 세트와 병합됩니다.

source: Notice that we didn&rsquo;t have to explicitly pass the type in the angle brackets (<code>&lt;&gt;</code>); the compiler just looked at the value <code>"myString"</code>, and set <code>T</code> to its type. While type argument inference can be a helpful tool to keep code shorter and more readable, you may need to explicitly pass in the type arguments as we did in the previous example when the compiler fails to infer the type, as may happen in more complex examples.
es: Observe que no tuvimos que pasar expl&iacute;citamente el tipo entre corchetes angulares ( <code>&lt;&gt;</code> ); el compilador s&oacute;lo mir&oacute; el valor <code>"myString"</code> y estableci&oacute; <code>T</code> en su tipo. Si bien la inferencia de argumentos de tipo puede ser una herramienta &uacute;til para mantener el c&oacute;digo m&aacute;s corto y legible, es posible que deba pasar expl&iacute;citamente los argumentos de tipo como hicimos en el ejemplo anterior cuando el compilador no puede inferir el tipo, como puede suceder en ejemplos m&aacute;s complejos .
ko: 꺾쇠 괄호 ( <code>&lt;&gt;</code> )로 유형을 명시 적으로 전달할 필요는 없습니다 . 컴파일러는 방금 <code>"myString"</code> 값을보고 <code>T</code> 를 해당 유형으로 설정 했습니다. 형식 인수 유추는 코드를 더 짧고 읽기 쉽게 유지하는 데 유용한 도구 일 수 있지만 컴파일러가 형식을 유추하지 못하는 경우 이전 예제에서와 같이 형식 인수를 명시 적으로 전달해야합니다 (더 복잡한 예제에서 발생할 수 있음) .

source: Notice that we don&rsquo;t use the <code>require</code> keyword; instead we assign directly from the qualified name of the symbol we&rsquo;re importing. This is similar to using <code>var</code>, but also works on the type and namespace meanings of the imported symbol. Importantly, for values, <code>import</code> is a distinct reference from the original symbol, so changes to an aliased <code>var</code> will not be reflected in the original variable.
es: Tenga en cuenta que no usamos la palabra clave <code>require</code> ; en su lugar, asignamos directamente desde el nombre calificado del s&iacute;mbolo que estamos importando. Esto es similar a usar <code>var</code> , pero tambi&eacute;n funciona con el tipo y los significados del espacio de nombres del s&iacute;mbolo importado. Es importante destacar que, para los valores, la <code>import</code> aci&oacute;n es una referencia distinta del s&iacute;mbolo original, por lo que los cambios en una <code>var</code> con alias no se reflejar&aacute;n en la variable original.
ko: <code>require</code> 키워드는 사용하지 않습니다 . 대신 가져 오는 심볼의 정규화 된 이름에서 직접 할당합니다. 이것은 <code>var</code> 사용과 유사 하지만 가져온 심볼의 유형 및 네임 스페이스 의미에서도 작동합니다. 중요하게, 값의 경우 <code>import</code> 는 원래 기호와 별개의 참조이므로 별칭 <code>var</code> 에 대한 변경 사항 은 원래 변수에 반영되지 않습니다.

source: Notice that we had to surround this statement with parentheses. JavaScript normally parses a <code>{</code> as the start of block.
es: Note que tuvimos que rodear esta declaraci&oacute;n entre par&eacute;ntesis. JavaScript normalmente analiza un <code>{</code> como el inicio del bloque.
ko: 이 문장을 괄호로 묶어야합니다. JavaScript는 일반적으로 <code>{</code> 를 블록의 시작 으로 구문 분석합니다 .

source: Notice that we had to use type assertions several times. It would be much better if once we performed the check, we could know the type of <code>pet</code> within each branch.
es: Observe que tuvimos que usar afirmaciones de tipo varias veces. Ser&iacute;a mucho mejor si una vez realizado el chequeo pudi&eacute;ramos conocer el tipo de <code>pet</code> dentro de cada rama.
ko: 형식 어설 션을 여러 번 사용해야했습니다. 점검을 한 후에 각 지점 에서 <code>pet</code> 의 종류를 알 수 있다면 훨씬 좋습니다 .

source: Notice that we installed TypeScript as a development dependency. We could also have linked TypeScript to a global copy with <code>npm link typescript</code>, but this is a less common scenario.
es: Observe que instalamos TypeScript como una dependencia de desarrollo. Tambi&eacute;n podr&iacute;amos haber vinculado TypeScript a una copia global con el <code>npm link typescript</code> , pero este es un escenario menos com&uacute;n.
ko: 개발 의존성으로 TypeScript를 설치했습니다. <code>npm link typescript</code> 를 사용하여 TypeScript를 전역 복사본에 연결할 수도 있지만 이는 덜 일반적인 시나리오입니다.

source: Notice that we specified <code>debug: true</code> to Browserify. This causes tsify to emit source maps inside the bundled JavaScript file. Source maps let you debug your original TypeScript code in the browser instead of the bundled JavaScript. You can test that source maps are working by opening the debugger for your browser and putting a breakpoint inside <code>main.ts</code>. When you refresh the page the breakpoint should pause the page and let you debug <code>greet.ts</code>.
es: Observe que especificamos <code>debug: true</code> para Browserify. Esto hace que tsify emita mapas de origen dentro del archivo JavaScript incluido. Los mapas de origen le permiten depurar su c&oacute;digo TypeScript original en el navegador en lugar del JavaScript incluido. Se puede probar que los mapas de c&oacute;digo est&aacute;n trabajando abriendo el depurador de su navegador y poner un punto de interrupci&oacute;n en el interior <code>main.ts</code> . Cuando actualiza la p&aacute;gina, el punto de interrupci&oacute;n debe pausar la p&aacute;gina y permitirle depurar <code>greet.ts</code> .
ko: Browserify에 <code>debug: true</code> 를 지정 했습니다. 이로 인해 tsify는 번들 JavaScript 파일 내에서 소스 맵을 생성합니다. 소스 맵을 사용하면 번들 JavaScript 대신 브라우저에서 원본 TypeScript 코드를 디버깅 할 수 있습니다. 브라우저의 디버거를 열고 <code>main.ts</code> 안에 중단 점을 두어 소스 맵이 작동하는지 테스트 할 수 있습니다 . 페이지를 새로 고치면 중단 점이 페이지를 일시 중지하고 <code>greet.ts</code> 를 디버깅 할 수 있도록해야합니다 .

source: Notice that we&rsquo;re including files from within <code>node_modules</code>. React and React-DOM&rsquo;s npm packages include standalone <code>.js</code> files that you can include in a web page, and we&rsquo;re referencing them directly to get things moving faster. Feel free to copy these files to another directory, or alternatively, host them on a content delivery network (CDN). Facebook makes CDN-hosted versions of React available, and you can <a href="http://facebook.github.io/react/downloads.html#development-vs.-production-builds">read more about that here</a>.
es: Tenga en cuenta que estamos incluyendo archivos desde dentro de <code>node_modules</code> . Los paquetes npm de React y React-DOM incluyen archivos <code>.js</code> independientes que puede incluir en una p&aacute;gina web, y los estamos haciendo referencia directamente para que las cosas se muevan m&aacute;s r&aacute;pido. Si&eacute;ntase libre de copiar estos archivos a otro directorio o, alternativamente, alojarlos en una red de entrega de contenido (CDN). Facebook pone a disposici&oacute;n versiones de React alojadas en CDN, y puedes <a href="http://facebook.github.io/react/downloads.html#development-vs.-production-builds">leer m&aacute;s sobre eso aqu&iacute;</a> .
ko: <code>node_modules</code> 내에 파일이 포함되어 있습니다 . React 및 React-DOM의 npm 패키지에는 웹 페이지에 포함 할 수있는 독립형 <code>.js</code> 파일이 포함되어 있으며, 더 빠르게 이동하기 위해 직접 참조합니다. 이러한 파일을 다른 디렉토리로 복사하거나 CDN (Content Delivery Network)에서 호스팅하십시오. Facebook은 CDN 호스트 버전의 React를 제공 <a href="http://facebook.github.io/react/downloads.html#development-vs.-production-builds">하며 여기에서 자세한 내용을 읽을</a> 수 있습니다 .

source: Notice that while we can&rsquo;t use <code>name</code> from outside of <code>Person</code>, we can still use it from within an instance method of <code>Employee</code> because <code>Employee</code> derives from <code>Person</code>.
es: Tenga en cuenta que, si bien no podemos usar el <code>name</code> desde fuera de <code>Person</code> , podemos usarlo desde dentro de un m&eacute;todo de instancia de <code>Employee</code> porque <code>Employee</code> se deriva de <code>Person</code> .
ko: 우리가 사용하는 수는 없지만 것을주의 <code>name</code> 외부에서 <code>Person</code> , 우리는 여전히의 인스턴스 메서드 내에서 사용할 수 있습니다 <code>Employee</code> 때문에 <code>Employee</code> 에서 유래 <code>Person</code> .

source: Notice the above needed no type annotations. The <code>const</code> assertion allowed TypeScript to take the most specific type of the expression.
es: Tenga en cuenta que lo anterior no necesita anotaciones de tipo. La aserci&oacute;n <code>const</code> permiti&oacute; a TypeScript tomar el tipo m&aacute;s espec&iacute;fico de expresi&oacute;n.
ko: 위의 유형 주석은 필요하지 않습니다. <code>const</code> 주장은 타이프는 식의 가장 구체적인 유형을 할 수 있었다.

source: Notice the given argument to <code>createSquare</code> is spelled <em><code>colour</code></em> instead of <code>color</code>. In plain JavaScript, this sort of thing fails silently.
es: Observe que el argumento dado para <code>createSquare</code> se escribe <em> <code>colour</code> </em> lugar de <code>color</code> . En JavaScript simple, este tipo de cosas falla silenciosamente.
ko: 에 주어진 인수에 주목 <code>createSquare</code> 가 철자 <em> <code>colour</code> </em> 대신 <code>color</code> . 일반 JavaScript에서는 이런 종류의 일이 자동으로 실패합니다.

source: Now <code>search</code> is <code>{ food: "rich", price: "$$", ambiance: "noisy" }</code>. Object spreading is more complex than array spreading. Like array spreading, it proceeds from left-to-right, but the result is still an object. This means that properties that come later in the spread object overwrite properties that come earlier. So if we modify the previous example to spread at the end:
es: Ahora la <code>search</code> es <code>{ food: "rich", price: "$$", ambiance: "noisy" }</code> . La distribuci&oacute;n de objetos es m&aacute;s compleja que la distribuci&oacute;n de matrices. Al igual que la distribuci&oacute;n de matrices, procede de izquierda a derecha, pero el resultado sigue siendo un objeto. Esto significa que las propiedades que vienen m&aacute;s adelante en el objeto de distribuci&oacute;n sobrescriben las propiedades que vienen antes. Entonces, si modificamos el ejemplo anterior para difundir al final:
ko: 이제 <code>search</code> 은 <code>{ food: "rich", price: "$$", ambiance: "noisy" }</code> 입니다. 객체 확산은 배열 확산보다 복잡합니다. 배열 확산과 같이 왼쪽에서 오른쪽으로 진행되지만 결과는 여전히 개체입니다. 이는 스프레드 객체에서 나중에 나오는 속성이 앞서 나오는 속성을 덮어 씁니다. 따라서 이전 예제를 수정하여 마지막에 확산되도록하십시오.

source: Now TypeScript knows that <code>createCardPicker</code> expects to be called on a <code>Deck</code> object. That means that <code>this</code> is of type <code>Deck</code> now, not <code>any</code>, so <code>--noImplicitThis</code> will not cause any errors.
es: Ahora TypeScript sabe que <code>createCardPicker</code> espera ser llamado en un objeto <code>Deck</code> . Eso significa que <code>this</code> es de tipo <code>Deck</code> ahora, no <code>any</code> , por lo que <code>--noImplicitThis</code> no causar&aacute; ning&uacute;n error.
ko: TypeScript는 <code>createCardPicker</code> 가 <code>Deck</code> 객체 에서 호출 될 것으로 예상 한다는 것을 알고 있습니다 . 것을 그 수단 <code>this</code> 타입이다 <code>Deck</code> 하지, 지금 <code>any</code> 때문에, <code>--noImplicitThis</code> 는 오류가 발생하지 않습니다.

source: Now change <code>main.ts</code> to update the page:
es: Ahora cambie <code>main.ts</code> para actualizar la p&aacute;gina:
ko: 이제 <code>main.ts</code> 를 변경 하여 페이지를 업데이트하십시오.

source: Now change the code in <code>src/main.ts</code> to import <code>sayHello</code> from <code>greet.ts</code>:
es: Ahora cambie el c&oacute;digo en <code>src/main.ts</code> para importar <code>sayHello</code> desde <code>greet.ts</code> :
ko: 지금의 코드 변경 <code>src/main.ts</code> 가져올 <code>sayHello</code> 에서 <code>greet.ts</code> :

source: Now change your gulpfile to the following:
es: Ahora cambie su archivo de gulp a lo siguiente:
ko: 이제 gulpfile을 다음과 같이 변경하십시오.

source: Now if you annotate calling code with <code>this</code>:
es: Ahora, si anota el c&oacute;digo de llamada con <code>this</code> :
ko: 이제 <code>this</code> 호출 코드에 주석을 달면 :

source: Now imports to <code>"moduleA"</code> would be looked up in <code>./modules/moduleA</code>
es: Ahora las importaciones a <code>"moduleA"</code> se <code>./modules/moduleA</code> en ./modules/moduleA
ko: 이제 <code>"moduleA"</code> 로의 가져 오기 는 <code>./modules/moduleA</code> 에서 조회됩니다.

source: Now let&rsquo;s look at how return types are treated, using two functions that differ only by their return type:
es: Ahora veamos c&oacute;mo se tratan los tipos de devoluci&oacute;n, usando dos funciones que se diferencian solo por su tipo de devoluci&oacute;n:
ko: 이제 리턴 유형 만 다른 두 가지 함수를 사용하여 리턴 유형을 처리하는 방법을 살펴 보겠습니다.

source: Now let&rsquo;s move this project from Node to the browser. To do this, we&rsquo;d like to bundle all our modules into one JavaScript file. Fortunately, that&rsquo;s exactly what Browserify does. Even better, it lets us use the CommonJS module system used by Node, which is the default TypeScript emit. That means our TypeScript and Node setup will transfer to the browser basically unchanged.
es: Ahora muevamos este proyecto de Node al navegador. Para hacer esto, nos gustar&iacute;a agrupar todos nuestros m&oacute;dulos en un archivo JavaScript. Afortunadamente, eso es exactamente lo que hace Browserify. A&uacute;n mejor, nos permite usar el sistema de m&oacute;dulos CommonJS utilizado por Node, que es la emisi&oacute;n predeterminada de TypeScript. Eso significa que nuestra configuraci&oacute;n de TypeScript y Node se transferir&aacute; al navegador b&aacute;sicamente sin cambios.
ko: 이제이 프로젝트를 노드에서 브라우저로 옮깁니다. 이를 위해 모든 모듈을 하나의 JavaScript 파일로 묶고 싶습니다. 다행히도 이것이 바로 Browserify가하는 일입니다. 또한 기본 TypeScript 이미 터 인 Node에서 사용하는 CommonJS 모듈 시스템을 사용할 수 있습니다. 즉, TypeScript 및 Node 설정은 기본적으로 변경되지 않은 브라우저로 전송됩니다.

source: Now let&rsquo;s use the discriminated union:
es: Ahora usemos la uni&oacute;n discriminada:
ko: 이제 차별적 노동 조합을 사용합시다 :

source: Now open up <code>index.html</code> in your favorite browser and everything should be ready to use! You should see a page that says &ldquo;Hello from TypeScript and React!&rdquo;
es: &iexcl;Ahora abra <code>index.html</code> en su navegador favorito y todo deber&iacute;a estar listo para usar! Deber&iacute;a ver una p&aacute;gina que dice "&iexcl;Hola desde TypeScript y React!"
ko: 이제 선호하는 브라우저에서 <code>index.html</code> 을 열고 모든 것을 사용할 준비가되었습니다! &ldquo;Hello from TypeScript and React!&rdquo;라는 페이지가 나타납니다.

source: Now right-click on <code>gulpfile.js</code> and click Task Runner Explorer.
es: Ahora haga clic derecho en <code>gulpfile.js</code> y haga clic en Task Runner Explorer.
ko: <code>gulpfile.js</code> 를 마우스 오른쪽 버튼으로 클릭 하고 Task Runner Explorer를 클릭하십시오.

source: Now that we are bundling our code with Browserify and tsify, we can add various features to our build with browserify plugins.
es: Ahora que estamos agrupando nuestro código con Browserify y tsify,podemos añadir varias características a nuestra construcción con los plugins de Browserify.
ko: 이제 코드를 Browserify 및 tsify와 번들로 제공하므로 browserify 플러그인을 사용하여 빌드에 다양한 기능을 추가 할 수 있습니다.

source: Now that we&rsquo;ve typed the function, let&rsquo;s write the full type of the function out by looking at each piece of the function type.
es: Ahora que hemos escrito la funci&oacute;n, escribamos el tipo completo de la funci&oacute;n mirando cada parte del tipo de funci&oacute;n.
ko: 함수를 입력 했으므로 함수 유형의 각 부분을보고 함수의 전체 유형을 작성해 봅시다.

source: Now that you have authored a declaration file following the steps of this guide, it is time to publish it to npm. There are two main ways you can publish your declaration files to npm:
es: Ahora que ha creado un archivo de declaración siguiendo los pasos de esta guía,es hora de publicarlo a npm.Hay dos maneras principales de publicar sus archivos de declaración a npm:
ko: 이 안내서의 단계에 따라 선언 파일을 작성 했으므로 이제 npm에 게시 할 차례입니다. 선언 파일을 npm에 게시 할 수있는 두 가지 주요 방법이 있습니다.

source: Now that you know how to wrap the properties of a type, the next thing you&rsquo;ll want to do is unwrap them. Fortunately, that&rsquo;s pretty easy:
es: Ahora que sabe c&oacute;mo ajustar las propiedades de un tipo, lo siguiente que querr&aacute; hacer es desenvolverlas. Afortunadamente, eso es bastante f&aacute;cil:
ko: 타입의 속성을 래핑하는 방법을 알았으니, 다음으로해야 할 것은 래핑 해제입니다. 다행히도 매우 쉽습니다.

source: Now the type of the array propagates into the <code>ArrayMetadata</code> type.
ko: 이제 배열 유형 이 <code>ArrayMetadata</code> 유형 으로 전파됩니다 .

source: Now to extend this to add support for input with numbers in bases other than 10, let&rsquo;s create <code>ProgrammerCalculator.ts</code>
es: Ahora, para ampliar esto y agregar soporte para la entrada con n&uacute;meros en bases distintas de 10, creemos <code>ProgrammerCalculator.ts</code>
ko: 10이 아닌 다른 숫자로 입력을 지원하기 위해 이것을 확장하기 위해 <code>ProgrammerCalculator.ts</code> 를 만들어 봅시다.

source: Now type the following in <code>greeter.html</code>:
es: Ahora escriba lo siguiente en <code>greeter.html</code> :
ko: 이제 <code>greeter.html</code> 에 다음을 입력하십시오 .

source: Now we can <code>/// &lt;reference&gt;</code><code>node.d.ts</code> and then load the modules using <code>import url = require("url");</code> or <code>import * as URL from "url"</code>.
es: Ahora podemos <code>/// &lt;reference&gt;</code> <code>node.d.ts</code> y luego cargar los m&oacute;dulos usando <code>import url = require("url");</code> o <code>import * as URL from "url"</code> .
ko: 이제 <code>/// &lt;reference&gt;</code> <code>node.d.ts</code> 를 수행 한 다음 <code>import url = require("url");</code> 또는 <code>import * as URL from "url"</code> .

source: Now we can start taking advantage of some of the new tools TypeScript offers. Add a <code>: string</code> type annotation to the &lsquo;person&rsquo; function argument as shown here:
es: Ahora podemos empezar a aprovechar algunas de las nuevas herramientas que ofrece TypeScript. Agregue una anotaci&oacute;n de tipo <code>: string</code> al argumento de la funci&oacute;n 'persona' como se muestra aqu&iacute;:
ko: 이제 TypeScript가 제공하는 몇 가지 새로운 도구를 활용할 수 있습니다. 다음 과 같이 'person'함수 인수에 <code>: string</code> 유형 주석을 추가 하십시오.

source: Now we can use <code>npm install</code> to install packages. First install <code>gulp-cli</code> globally (if you use a Unix system, you may need to prefix the <code>npm install</code> commands in this guide with <code>sudo</code>).
es: Ahora podemos usar <code>npm install</code> para instalar paquetes. Primero instale <code>gulp-cli</code> globalmente (si usa un sistema Unix, es posible que deba prefijar los comandos de <code>npm install</code> en esta gu&iacute;a con <code>sudo</code> ).
ko: 이제 <code>npm install</code> 을 사용하여 패키지를 설치할 수 있습니다 . 먼저 <code>gulp-cli</code> 를 전체적으로 설치하십시오 (Unix 시스템을 사용하는 경우이 안내서에서 <code>npm install</code> 명령 앞에 <code>sudo</code> 를 추가 해야 할 수도 있습니다 ).

source: Now we&rsquo;ll turn this folder into an npm package.
es: Ahora convertiremos esta carpeta en un paquete npm.
ko: 이제이 폴더를 npm 패키지로 바꿉니다.

source: Now when these <code>never</code>-returning functions are called, TypeScript recognizes that they affect the control flow graph and accounts for them.
es: Ahora, cuando se llaman estas funciones que <code>never</code> regresan, TypeScript reconoce que afectan el gr&aacute;fico de flujo de control y las tiene en cuenta.
ko: 이제 이러한 <code>never</code> 반환 기능이 호출되면 TypeScript는 해당 기능이 제어 흐름 그래프에 영향을 미치고이를 설명합니다.

source: Now when you run Gulp, it should start and stay running. Try changing the code for <code>showHello</code> in <code>main.ts</code> and saving it. You should see output that looks like this:
es: Ahora, cuando ejecute Gulp, deber&iacute;a comenzar y seguir funcionando. Intente cambiar el c&oacute;digo de <code>showHello</code> en <code>main.ts</code> y gu&aacute;rdelo . Deber&iacute;a ver una salida que se ve as&iacute;:
ko: 이제 Gulp를 실행하면 시작되어 계속 실행됩니다. <code>showHello</code> 에서 <code>main.ts</code> 의 코드를 변경 하고 저장해보십시오. 다음과 같은 출력이 표시되어야합니다.

source: Now you can import things that match <code>"*!text"</code> or <code>"json!*"</code>.
es: Ahora puede importar cosas que coincidan con <code>"*!text"</code> o <code>"json!*"</code> .
ko: 이제 <code>"*!text"</code> 또는 <code>"json!*"</code> 와 일치하는 항목을 가져올 수 있습니다 .
