Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/typescript/typescript.*.003.xlf
Languages: es, ko, ru, zh_cn

source: In the project root, <code>proj</code>, create the file <code>tsconfig.json</code>:
es: En la ra&iacute;z del proyecto, <code>proj</code> , cree el archivo <code>tsconfig.json</code> :
ko: 프로젝트 루트 <code>proj</code> 에서 <code>tsconfig.json</code> 파일을 작성하십시오 .

source: In the project root, create the file <code>gulpfile.js</code>:
es: En la ra&iacute;z del proyecto, cree el archivo <code>gulpfile.js</code> :
ko: 프로젝트 루트에서 <code>gulpfile.js</code> 파일을 작성하십시오 .

source: In the type of a module object, exported <code>const</code> variables are considered read-only properties.
es: En el tipo de objeto de m&oacute;dulo, las variables <code>const</code> exportadas se consideran propiedades de solo lectura.
ko: 모듈 객체의 유형에서 내 보낸 <code>const</code> 변수는 읽기 전용 속성으로 간주됩니다.

source: In the type of an enum object, enum members are considered read-only properties.
es: En el tipo de un objeto enum,los miembros enum se consideran propiedades de sólo lectura.
ko: 열거 형 객체의 유형에서 열거 형 멤버는 읽기 전용 속성으로 간주됩니다.

source: In these examples, the properties list is <code>keyof T</code> and the resulting type is some variant of <code>T[P]</code>. This is a good template for any general use of mapped types. That&rsquo;s because this kind of transformation is <a href="https://en.wikipedia.org/wiki/Homomorphism">homomorphic</a>, which means that the mapping applies only to properties of <code>T</code> and no others. The compiler knows that it can copy all the existing property modifiers before adding any new ones. For example, if <code>Person.name</code> was readonly, <code>Partial&lt;Person&gt;.name</code> would be readonly and optional.
es: En estos ejemplos, la lista de propiedades es <code>keyof T</code> y el tipo resultante es alguna variante de <code>T[P]</code> . Esta es una buena plantilla para cualquier uso general de tipos mapeados. Eso es porque este tipo de transformaci&oacute;n es <a href="https://en.wikipedia.org/wiki/Homomorphism">homom&oacute;rfica</a> , lo que significa que el mapeo se aplica solo a las propiedades de <code>T</code> y no a otras. El compilador sabe que puede copiar todos los modificadores de propiedad existentes antes de agregar nuevos. Por ejemplo, si <code>Person.name</code> fuera de solo lectura, <code>Partial&lt;Person&gt;.name</code> ser&iacute;a de solo lectura y opcional.
ko: 이 예제에서 특성 목록은 <code>keyof T</code> 이고 결과 유형은 <code>T[P]</code> 의 일부 변형입니다 . 매핑 된 형식을 일반적으로 사용하기에 적합한 템플릿입니다. 이런 종류의 변환은 <a href="https://en.wikipedia.org/wiki/Homomorphism">동형</a> 이기 때문에 매핑은 <code>T</code> 의 속성에만 적용 되고 다른 속성에는 적용 되지 않습니다. 컴파일러는 새로운 속성 수정자를 추가하기 전에 기존의 모든 속성 수정자를 복사 할 수 있다는 것을 알고 있습니다. 예를 들어 <code>Person.name</code> 이 읽기 전용 인 경우 <code>Partial&lt;Person&gt;.name</code> 은 읽기 전용이며 선택 사항입니다.

source: In these examples, the properties list is <code>keyof T</code> and the resulting type is some variant of <code>T[P]</code>. This is a good template for any general use of mapped types. That&rsquo;s because this kind of transformation is <a href="https://wikipedia.org/wiki/Homomorphism">homomorphic</a>, which means that the mapping applies only to properties of <code>T</code> and no others. The compiler knows that it can copy all the existing property modifiers before adding any new ones. For example, if <code>Person.name</code> was readonly, <code>Partial&lt;Person&gt;.name</code> would be readonly and optional.
ko: 이 예에서 속성 목록은 <code>keyof T</code> 이고 결과 유형은 <code>T[P]</code> 의 일부 변형입니다 . 이것은 매핑 된 유형의 일반적인 사용을위한 좋은 템플릿입니다. 이는 이러한 종류의 변환이 <a href="https://wikipedia.org/wiki/Homomorphism">동형</a> 이기 때문입니다. 즉 , 매핑이 <code>T</code> 의 속성에만 적용 되고 다른 속성에는 적용 되지 않습니다. 컴파일러는 새 속성 수정자를 추가하기 전에 기존 속성 수정자를 모두 복사 할 수 있음을 알고 있습니다. 예를 들어 <code>Person.name</code> 이 읽기 전용이면 <code>Partial&lt;Person&gt;.name</code> 은 읽기 전용이며 선택 사항입니다.

source: In this above example, <code>g</code> captured the variable <code>a</code> declared in <code>f</code>. At any point that <code>g</code> gets called, the value of <code>a</code> will be tied to the value of <code>a</code> in <code>f</code>. Even if <code>g</code> is called once <code>f</code> is done running, it will be able to access and modify <code>a</code>.
es: En este ejemplo anterior, <code>g</code> captur&oacute; la variable <code>a</code> declarada en <code>f</code> . En cualquier punto en el que se llame a <code>g</code> , el valor de <code>a</code> estar&aacute; vinculado al valor de <code>a</code> en <code>f</code> . Incluso si se llama a <code>g</code> una vez que <code>f</code> termine de ejecutarse, podr&aacute; acceder y modificar <code>a</code> .
ko: 이 예제에서 <code>g</code> 는 <code>f</code> 에 선언 된 변수 <code>a</code> 를 캡처했습니다 . 것을 어느 시점에서 <code>g</code> 가 호출되는, 값 <code>a</code> 값에 연결됩니다 에서 <code>f</code> . <code>f</code> 가 실행 되면 <code>g</code> 가 호출 되더라도 <code>a</code> 에 액세스하고 수정할 수 있습니다 . <code>a</code>

source: In this case, we need to use TypeScript to tell any of our callers about the ways <code>myCoolFunction</code> can be called using function overloads.
es: En este caso, necesitamos usar TypeScript para informar a cualquiera de nuestras personas que llaman sobre las formas en que <code>myCoolFunction</code> se puede llamar usando sobrecargas de funciones.
ko: 이 경우 호출자에게 함수 오버로드를 사용하여 <code>myCoolFunction</code> 을 호출 할 수있는 방법에 대해 알리려면 TypeScript를 사용해야 합니다.

source: In this case, you can tell the TypeScript file resolver to support a number of custom prefixes to find code. This pattern can be used to avoid long relative paths within your codebase.
ko: 이 경우 TypeScript 파일 해석기에 코드를 찾기 위해 여러 사용자 지정 접두사를 지원하도록 지시 할 수 있습니다. 이 패턴은 코드베이스 내에서 긴 상대 경로를 방지하는 데 사용할 수 있습니다.

source: In this case, you can use a <code>switch</code> statement to narrow down which type is represented at runtime:
ko: 이 경우 <code>switch</code> 문을 사용하여 런타임에 표시되는 유형의 범위를 좁힐 수 있습니다 .

source: In this example if <code>someValue</code> isn&rsquo;t equal to <code>42</code>, then <code>assert</code> will throw an <code>AssertionError</code>.
es: En este ejemplo, si <code>someValue</code> no es igual a <code>42</code> , <code>assert</code> arrojar&aacute; un <code>AssertionError</code> .
ko: 만약이 예에서 <code>someValue</code> 와는 동일하지 않은 <code>42</code> 다음 <code>assert</code> 던 것이다 <code>AssertionError</code> 를이 .

source: In this example the <code>b?</code> indicates that <code>b</code> is optional, so it may be <code>undefined</code>. <code>keepWholeObject</code> now has a variable for <code>wholeObject</code> as well as the properties <code>a</code> and <code>b</code>, even if <code>b</code> is undefined.
es: En este ejemplo, la <code>b?</code> indica que <code>b</code> es opcional, por lo que puede <code>undefined</code> estar definido . <code>keepWholeObject</code> tiene ahora una variable para <code>wholeObject</code> as&iacute; como las propiedades <code>a</code> y <code>b</code> , incluso si <code>b</code> no est&aacute; definido.
ko: 이 예에서 <code>b?</code> 것을 나타내고 <code>b</code> 이 될 수 있으므로, 선택적 <code>undefined</code> . <code>keepWholeObject</code> 에는 이제 <code>b</code> 가 정의되지 않은 경우에도 속성 <code>a</code> 및 <code>b</code> 뿐만 아니라 <code>wholeObject</code> 에 대한 변수 가 있습니다.

source: In this example, <code>greeter1</code> works similarly to before. We instantiate the <code>Greeter</code> class, and use this object. This we have seen before.
es: En este ejemplo, <code>greeter1</code> funciona de manera similar a antes. Instalamos la clase <code>Greeter</code> y usamos este objeto. Esto lo hemos visto antes.
ko: 이 예에서 <code>greeter1</code> 은 이전과 유사하게 작동합니다. <code>Greeter</code> 클래스를 인스턴스화 하고이 객체를 사용합니다. 우리는 전에 본 적이 있습니다.

source: In this example, best common type has a set of four candidates: <code>Animal</code>, <code>Rhino</code>, <code>Elephant</code>, and <code>Snake</code>. Of these, <code>Animal</code> can be chosen by the best common type algorithm.
es: En este ejemplo, el mejor tipo com&uacute;n tiene un conjunto de cuatro candidatos: <code>Animal</code> , <code>Rhino</code> , <code>Elephant</code> y <code>Snake</code> . De estos, <code>Animal</code> puede elegirse mediante el mejor algoritmo de tipo com&uacute;n.
ko: 이 예에서 가장 일반적인 유형에는 <code>Animal</code> , <code>Rhino</code> , <code>Elephant</code> 및 <code>Snake</code> 의 네 가지 후보 세트가 있습니다. 이 중 가장 일반적인 유형 알고리즘으로 <code>Animal</code> 을 선택할 수 있습니다.

source: In this example, the first block creates the following name meanings:
es: En este ejemplo,el primer bloque crea los siguientes significados de los nombres:
ko: 이 예에서 첫 번째 블록은 다음과 같은 이름 의미를 만듭니다.

source: In this example, there wasn&rsquo;t a namespace <code>C</code> until we wrote the <code>namespace</code> declaration for it. The meaning <code>C</code> as a namespace doesn&rsquo;t conflict with the value or type meanings of <code>C</code> created by the class.
es: En este ejemplo, no hab&iacute;a un espacio de nombres <code>C</code> hasta que escribimos la declaraci&oacute;n del <code>namespace</code> para &eacute;l. El significado de <code>C</code> como espacio de nombres no entra en conflicto con el valor o los significados de tipo de <code>C</code> creado por la clase.
ko: 이 예에서는 <code>namespace</code> 선언을 작성할 때까지 네임 스페이스 <code>C</code> 가 없었 습니다. 네임 스페이스로서의 <code>C</code> 의 의미 는 클래스에 의해 생성 된 <code>C</code> 의 값 또는 유형의 의미와 충돌하지 않습니다 .

source: In this example, we have an <code>Animal</code> and a <code>Rhino</code>, with <code>Rhino</code> being a subclass of <code>Animal</code>. We also have a new class <code>Employee</code> that looks identical to <code>Animal</code> in terms of shape. We create some instances of these classes and then try to assign them to each other to see what will happen. Because <code>Animal</code> and <code>Rhino</code> share the <code>private</code> side of their shape from the same declaration of <code>private name: string</code> in <code>Animal</code>, they are compatible. However, this is not the case for <code>Employee</code>. When we try to assign from an <code>Employee</code> to <code>Animal</code> we get an error that these types are not compatible. Even though <code>Employee</code> also has a <code>private</code> member called <code>name</code>, it&rsquo;s not the one we declared in <code>Animal</code>.
es: En este ejemplo, tenemos un <code>Animal</code> y un <code>Rhino</code> , siendo <code>Rhino</code> una subclase de <code>Animal</code> . Tambi&eacute;n tenemos una nueva clase de <code>Employee</code> que se ve id&eacute;ntica a <code>Animal</code> en t&eacute;rminos de forma. Creamos algunas instancias de estas clases y luego intentamos asignarlas entre s&iacute; para ver qu&eacute; pasa. Debido a que <code>Animal</code> y <code>Rhino</code> comparten el lado <code>private</code> de su forma de la misma declaraci&oacute;n de <code>private name: string</code> en <code>Animal</code> , son compatibles. Sin embargo, este no es el caso de <code>Employee</code> . Cuando intentamos asignar de un <code>Employee</code> a <code>Animal</code> obtenemos un error de que estos tipos no son compatibles. Aunque <code>Employee</code> tambi&eacute;n tiene un miembro <code>private</code> llamado <code>name</code> , no es el que declaramos en <code>Animal</code> .
ko: 이 예제에는 <code>Animal</code> 과 <code>Rhino</code> 가 있으며 <code>Rhino</code> 는 <code>Animal</code> 의 하위 클래스입니다 . 또한 모양면에서 <code>Animal</code> 과 동일하게 보이는 새로운 클래스 <code>Employee</code> 이 있습니다. 이러한 클래스의 일부 인스턴스를 만든 다음 서로에게 할당하여 어떤 일이 발생하는지 확인합니다. 때문에 <code>Animal</code> 과 <code>Rhino</code> 에서 공유 <code>private</code> 같은 선언에서 그 형태의면 <code>private name: string</code> 의 <code>Animal</code> , 그들은 호환됩니다. 그러나 <code>Employee</code> 의 경우에는 해당되지 않습니다 . 우리 을 할당하려고 할 때 <code>Employee</code> 에 <code>Animal</code> 우리는 이러한 유형의 호환되지 않는 오류가 발생합니다. <code>Employee</code> 에도 <code>name</code> 이라는 <code>private</code> 구성원 이 있지만 <code>Animal</code> 에서 선언 한 구성원 이 아닙니다 .

source: In this example, we&rsquo;ll move all validator-related entities into a namespace called <code>Validation</code>. Because we want the interfaces and classes here to be visible outside the namespace, we preface them with <code>export</code>. Conversely, the variables <code>lettersRegexp</code> and <code>numberRegexp</code> are implementation details, so they are left unexported and will not be visible to code outside the namespace. In the test code at the bottom of the file, we now need to qualify the names of the types when used outside the namespace, e.g. <code>Validation.LettersOnlyValidator</code>.
es: En este ejemplo, trasladaremos todas las entidades relacionadas con el validador a un espacio de nombres llamado <code>Validation</code> . Como queremos que las interfaces y clases aqu&iacute; sean visibles fuera del espacio de nombres, las introducimos con <code>export</code> . Por el contrario, las variables <code>lettersRegexp</code> y <code>numberRegexp</code> son detalles de implementaci&oacute;n, por lo que no se exportan y no ser&aacute;n visibles para el c&oacute;digo fuera del espacio de nombres. En el c&oacute;digo de prueba al final del archivo, ahora necesitamos calificar los nombres de los tipos cuando se usan fuera del espacio de nombres, por ejemplo, <code>Validation.LettersOnlyValidator</code> .
ko: 이 예에서는 모든 유효성 검사기 관련 엔터티를 <code>Validation</code> 이라는 네임 스페이스로 이동합니다 . 여기서 인터페이스와 클래스가 네임 스페이스 외부에 표시되기를 원하므로 <code>export</code> 로 시작 합니다. 반대로, 변수 <code>lettersRegexp</code> 및 <code>numberRegexp</code> 는 구현 세부 사항이므로 내 보내지 않고 네임 스페이스 외부의 코드에는 표시되지 않습니다. 파일 맨 아래의 테스트 코드에서 네임 스페이스 외부에서 사용될 때 유형의 이름 (예 : <code>Validation.LettersOnlyValidator</code> )을 규정해야 합니다.

source: In this generated code, an enum is compiled into an object that stores both forward (<code>name</code> -&gt; <code>value</code>) and reverse (<code>value</code> -&gt; <code>name</code>) mappings. References to other enum members are always emitted as property accesses and never inlined.
es: En este c&oacute;digo generado, se compila una enumeraci&oacute;n en un objeto que almacena asignaciones directas ( <code>name</code> -&gt; <code>value</code> ) e inversas ( <code>value</code> -&gt; <code>name</code> ). Las referencias a otros miembros de enumeraci&oacute;n siempre se emiten como accesos de propiedad y nunca en l&iacute;nea.
ko: (이 생성 된 코드에서, ENUM은 저장 순방향 것을 목적으로 컴파일 <code>name</code> -&gt; <code>value</code> ) 및 (후진 <code>value</code> -&gt; <code>name</code> 매핑). 다른 열거 형 멤버에 대한 참조는 항상 속성 액세스로 생성되며 인라인되지 않습니다.

source: In this guide, we&rsquo;ll assume basic familiarity with the TypeScript language. If you haven&rsquo;t already, you should read the <a href="../basic-types">TypeScript Handbook</a> to familiarize yourself with basic concepts, especially types and namespaces.
es: En esta gu&iacute;a, asumiremos una familiaridad b&aacute;sica con el lenguaje TypeScript. Si a&uacute;n no lo ha hecho, deber&iacute;a leer el <a href="../basic-types">Manual de TypeScript</a> para familiarizarse con los conceptos b&aacute;sicos, especialmente los tipos y los espacios de nombres.
ko: 이 가이드에서는 TypeScript 언어에 대한 기본 지식이 있다고 가정합니다. 아직없는 경우 <a href="../basic-types">TypeScript 핸드북</a> 을 읽고 기본 개념, 특히 유형 및 네임 스페이스에 익숙해 져야합니다.

source: In this introduction, I assume you know the following:
ko: 이 소개에서는 다음 사항을 알고 있다고 가정합니다.

source: In this mode, references to modules and packages (e.g. <code>import</code>s and <code>/// &lt;reference type="..." /&gt;</code> directives) are all resolved relative to the location of the symbolic link file, rather than relative to the path that the symbolic link resolves to. For a more concrete example, we&rsquo;ll defer to <a href="https://nodejs.org/api/cli.html#cli_preserve_symlinks">the documentation on the Node.js website</a>.
es: En este modo, las referencias a m&oacute;dulos y paquetes (por ejemplo, las directivas <code>import</code> sy <code>/// &lt;reference type="..." /&gt;</code> ) se resuelven en relaci&oacute;n con la ubicaci&oacute;n del archivo de enlace simb&oacute;lico, en lugar de con respecto a la ruta que el enlace simb&oacute;lico resuelve. Para un ejemplo m&aacute;s concreto, vamos a aplazar a <a href="https://nodejs.org/api/cli.html#cli_preserve_symlinks">la documentaci&oacute;n en el sitio web de Node.js</a> .
ko: 이 모드에서 모듈 및 패키지에 대한 참조 (예 : <code>import</code> 및 <code>/// &lt;reference type="..." /&gt;</code> 지시문)는 모두 해당 경로가 아닌 심볼릭 링크 파일의 위치를 ​​기준으로 확인됩니다. 심볼릭 링크가 해결됩니다. 보다 구체적인 예를 보려면 <a href="https://nodejs.org/api/cli.html#cli_preserve_symlinks">Node.js 웹 사이트의 설명서를 참조하십시오</a> .

source: In this section we&rsquo;ll describe various common pitfalls in using namespaces and modules, and how to avoid them.
es: En esta secci&oacute;n describiremos varios errores comunes en el uso de espacios de nombres y m&oacute;dulos, y c&oacute;mo evitarlos.
ko: 이 섹션에서는 네임 스페이스와 모듈을 사용할 때 발생하는 다양한 일반적인 함정과이를 피하는 방법에 대해 설명합니다.

source: In this section, we will cover type inference in TypeScript. Namely, we&rsquo;ll discuss where and how types are inferred.
es: En esta secci&oacute;n, cubriremos la inferencia de tipos en TypeScript. Es decir, discutiremos d&oacute;nde y c&oacute;mo se infieren los tipos.
ko: 이 섹션에서는 TypeScript의 형식 유추에 대해 설명합니다. 즉, 유형을 유추하는 위치와 방법에 대해 설명합니다.

source: In this simple example, <code>Keys</code> is a hard-coded list of property names and the property type is always <code>boolean</code>, so this mapped type is equivalent to writing:
es: En este ejemplo simple, <code>Keys</code> es una lista codificada de nombres de propiedad y el tipo de propiedad siempre es <code>boolean</code> o , por lo que este tipo mapeado es equivalente a escribir:
ko: 이 간단한 예제에서 <code>Keys</code> 는 하드 코딩 된 속성 이름 목록이며 속성 유형은 항상 <code>boolean</code> 이므로이 매핑 된 유형은 다음과 같습니다.

source: In this way, a generic type that has its type arguments specified acts just like a non-generic type.
es: De esta manera,un tipo genérico que tiene sus argumentos de tipo especificados actúa como un tipo no genérico.
ko: 이런 식으로 형식 인수가 지정된 제네릭 형식은 제네릭이 아닌 형식처럼 작동합니다.

source: In traditional object-oriented code, we might abstract over the two types by creating a hierarchy of types. While this is much more explicit, it&rsquo;s also a little bit overkill. One of the nice things about the original version of <code>padLeft</code> was that we were able to just pass in primitives. That meant that usage was simple and concise. This new approach also wouldn&rsquo;t help if we were just trying to use a function that already exists elsewhere.
es: En el c&oacute;digo tradicional orientado a objetos, podr&iacute;amos abstraer los dos tipos creando una jerarqu&iacute;a de tipos. Si bien esto es mucho m&aacute;s expl&iacute;cito, tambi&eacute;n es un poco exagerado. Una de las cosas buenas de la versi&oacute;n original de <code>padLeft</code> fue que pudimos simplemente pasar primitivas. Eso significaba que el uso era simple y conciso. Este nuevo enfoque tampoco ayudar&iacute;a si solo intent&aacute;ramos usar una funci&oacute;n que ya existe en otros lugares.
ko: 전통적인 객체 지향 코드에서는 유형의 계층 구조를 만들어 두 유형을 추상화 할 수 있습니다. 이것은 훨씬 더 명시 적이지만 약간 과잉입니다. <code>padLeft</code> 의 원래 버전에 대한 좋은 점 중 하나는 프리미티브를 전달할 수 있다는 것입니다. 그것은 사용법이 간단하고 간결하다는 것을 의미했습니다. 이 새로운 접근법은 우리가 이미 다른 곳에 존재하는 함수를 사용하려고 시도해도 도움이되지 않습니다.

source: In your editor, type the following JavaScript code in <code>greeter.ts</code>:
es: En su editor, escriba el siguiente c&oacute;digo JavaScript en <code>greeter.ts</code> :
ko: 편집기에서 <code>greeter.ts</code> 에 다음 JavaScript 코드를 입력하십시오 .

source: Include - <code>include</code>
ko: 포함- <code>include</code>

source: Include modules imported with <code>.json</code> extension.
es: Incluya m&oacute;dulos importados con extensi&oacute;n <code>.json</code> .
ko: <code>.json</code> 확장자로 가져온 모듈을 포함하십시오 .

source: Including <code>.js</code> files with <code>--allowJs</code>
es: Incluyendo archivos <code>.js</code> con <code>--allowJs</code>
ko: <code>--allowJs</code> 와 함께 <code>.js</code> 파일 포함

source: Including built-in type declarations with <code>--lib</code>
es: Incluyendo declaraciones de tipo <code>--lib</code> con --lib
ko: <code>--lib</code> 와 함께 내장형 선언 포함

source: Including declarations in your npm package
es: Incluyendo declaraciones en su paquete npm
ko: npm 패키지에 선언 포함

source: Incremental - <code>incremental</code>
ko: 증분- <code>incremental</code>

source: Incremental file watching for composite projects in <code>--build --watch</code>
es: Observaci&oacute;n incremental de archivos para proyectos compuestos en <code>--build --watch</code>
ko: <code>--build --watch</code> 에서 복합 프로젝트에 대한 증분 파일 감시

source: Incremental typing in JavaScript <a href="jsdoc-supported-types">via JSDoc</a>
ko: <a href="jsdoc-supported-types">JSDoc을 통한</a> JavaScript의 증분 입력

source: Index types
es: Tipos de índice
ko: 색인 유형

source: Index types and index signatures
es: Tipos de índice y firmas de índice
ko: 색인 유형 및 색인 서명

source: Indexable Types
es: Tipos indexables
ko: 인덱서 블 타입

source: Individual library components
ko: 개별 라이브러리 구성 요소

source: Inference from mapped types
es: Inferencia de los tipos mapeados
ko: 매핑 된 형식에서 유추

source: Inferring the types
es: Infiriendo los tipos
ko: 유형 유추

source: Initialize the project
es: Iniciar el proyecto
ko: 프로젝트 초기화

source: Initializes a TypeScript project and creates a <code>tsconfig.json</code> file.
es: Inicializa un proyecto de TypeScript y crea un archivo <code>tsconfig.json</code> .
ko: TypeScript 프로젝트를 초기화하고 <code>tsconfig.json</code> 파일을 만듭니다 .

source: Initializing an object with dynamic properties can be a bit of a burden. Take the following example:
es: Inicializar un objeto con propiedades dinámicas puede ser un poco pesado.Tomemos el siguiente ejemplo:
ko: 동적 속성으로 객체를 초기화하는 것은 약간의 부담이 될 수 있습니다. 다음 예제를 보자.

source: Inline Source Map - <code>inlineSourceMap</code>
ko: 인라인 소스 맵 <code>inlineSourceMap</code>

source: Inline Sources - <code>inlineSources</code>
ko: 인라인 소스 <code>inlineSources</code>

source: Inside the <code>"devDependencies"</code> section of the <code>package.json</code> file, add <em>gulp</em> and <em>del</em>
es: Dentro de la secci&oacute;n <code>"devDependencies"</code> del archivo <code>package.json</code> , agregue <em>gulp</em> y <em>del</em>
ko: 내부 <code>"devDependencies"</code> 의 섹션 <code>package.json</code> 의 파일, 추가 <em>꿀꺽</em> 와 <em>델을</em>

source: Install ASP.NET Core and TypeScript
es: Instalar ASP.NET Core y TypeScript
ko: ASP.NET Core 및 TypeScript 설치

source: Install our dependencies
es: Instalar nuestras dependencias
ko: 의존성 설치

source: Installing TypeScript
es: Instalación de TypeScript
ko: TypeScript 설치

source: Instead of <code>Object</code>, use the non-primitive <code>object</code> type (<a href="../release-notes/typescript-2-2#object-type">added in TypeScript 2.2</a>).
es: En lugar de <code>Object</code> , use el tipo de <code>object</code> no primitivo ( <a href="../release-notes/typescript-2-2#object-type">agregado en TypeScript 2.2</a> ).
ko: <code>Object</code> 대신 기본이 아닌 <code>object</code> 유형 ( <a href="../release-notes/typescript-2-2#object-type">TypeScript 2.2에 추가</a> )을 사용하십시오.

source: Instead of <code>Object</code>, use the non-primitive <code>object</code> type (<a href="https://www.typescriptlang.org/docs/handbook/release-notes/typescript-2-2.html#object-type">added in TypeScript 2.2</a>).
ko: <code>Object</code> 대신 기본이 아닌 <code>object</code> 유형을 사용하십시오 ( <a href="https://www.typescriptlang.org/docs/handbook/release-notes/typescript-2-2.html#object-type">TypeScript 2.2에 추가됨</a> ).

source: Instead of <code>any</code>, we can use a <em>union type</em> for the <code>padding</code> parameter:
es: En lugar de <code>any</code> , podemos usar un <em>tipo de uni&oacute;n</em> para el par&aacute;metro de <code>padding</code> :
ko: <code>any</code> 대신에 <code>padding</code> 매개 변수에 <em>공용체 유형</em> 을 사용할 수 있습니다 .
