Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/typescript/typescript.*.003.xlf
Languages: es, ko, ru, zh_cn

source: Now, for the remainder of the <code>createElement</code> definition: <code>(tagName: K, options?: ElementCreationOptions): HTMLElementTagNameMap[K]</code>. The first argument <code>tagName</code> is defined as the generic parameter <code>K</code> . The TypeScript interpreter is smart enough to <em>infer</em> the generic parameter from this argument. This means that the developer does not actually have to specify the generic parameter when using the method; whatever value is passed to the <code>tagName</code> argument will be inferred as <code>K</code> and thus can be used throughout the remainder of the definition. Which is exactly what happens; the return value <code>HTMLElementTagNameMap[K]</code> takes the <code>tagName</code> argument and uses it to return the corresponding type. This definition is how the <code>p</code> variable from the code snippet gets a type of <code>HTMLParagraphElement</code>. And if the code was <code>document.createElement('a')</code>, then it would be an element of type <code>HTMLAnchorElement</code>.
ko: 이제 나머지 <code>createElement</code> 정의 : <code>(tagName: K, options?: ElementCreationOptions): HTMLElementTagNameMap[K]</code> . 첫 번째 인수 <code>tagName</code> 은 일반 매개 변수 <code>K</code> 로 정의됩니다 . TypeScript 인터프리터는 이 인수에서 일반 매개 변수 를 <em>추론 할 수</em> 있을만큼 똑똑 합니다. 이는 개발자가 메소드를 사용할 때 실제로 일반 매개 변수를 지정할 필요가 없음을 의미합니다. <code>tagName</code> 인수에 전달되는 값은 <code>K</code> 로 추론 되므로 나머지 정의에서 사용할 수 있습니다. 정확히 무슨 일이 일어나는지; 반환 값 <code>HTMLElementTagNameMap[K]</code> 는 <code>tagName</code> 을 사용합니다.인수를 사용하고 해당 유형을 반환하는 데 사용합니다. 이 정의는 코드 스 니펫 의 <code>p</code> 변수가 <code>HTMLParagraphElement</code> 유형을 가져 오는 방법입니다 . 코드가 <code>document.createElement('a')</code> 이면 <code>HTMLAnchorElement</code> 유형의 요소가됩니다 .

source: Null and Undefined
es: Nulo e indefinido
ko: 널 및 정의되지 않음

source: Null- and undefined-aware types
es: Tipos de conocimiento nulo e indefinido
ko: 널 및 정의되지 않은 인식 유형

source: Nullable types
es: Tipos anulables
ko: 널 입력 가능 유형

source: Nullable types only have meaning if <code>strictNullChecks</code> is on:
es: Los tipos que aceptan valores NULL solo tienen significado si <code>strictNullChecks</code> est&aacute; activado :
ko: Nullable 유형 은 <code>strictNullChecks</code> 가 설정된 경우에만 의미 가 있습니다.

source: Nullish Coalescing
es: Coalescencia nula
ko: 널리 한 병합

source: Number-like properties of an object type are those declared using a numeric literal or computed property name of a numeric literal type.
es: Las propiedades de tipo numérico de un tipo de objeto son las que se declaran utilizando un nombre de propiedad numérico literal o calculado de un tipo numérico literal.
ko: 객체 유형의 숫자 ​​형 속성은 숫자 리터럴 또는 숫자 리터럴 유형의 계산 된 속성 이름을 사용하여 선언 된 속성입니다.

source: Numeric Literal Types
es: Tipos literales numéricos
ko: 숫자 리터럴 유형

source: Numeric enums
es: Enumeraciones numéricas
ko: 숫자 열거 형

source: Numeric enums can be mixed in <a href="#computed-and-constant-members">computed and constant members (see below)</a>. The short story is, enums without initializers either need to be first, or have to come after numeric enums initialized with numeric constants or other constant enum members. In other words, the following isn&rsquo;t allowed:
es: Las enumeraciones num&eacute;ricas se pueden mezclar en <a href="#computed-and-constant-members">miembros calculados y constantes (ver m&aacute;s abajo)</a> . La historia corta es que las enumeraciones sin inicializadores deben ser las primeras o deben ir despu&eacute;s de las enumeraciones num&eacute;ricas inicializadas con constantes num&eacute;ricas u otros miembros de enumeraci&oacute;n constante. En otras palabras, no se permite lo siguiente:
ko: 숫자 열거 형은 <a href="#computed-and-constant-members">계산 멤버와 상수 멤버</a> 로 혼합 될 수 있습니다 (아래 참조) . 짧은 이야기는, 초기화자가없는 열거 형이 먼저 필요하거나 숫자 상수 또는 다른 상수 열거 형 멤버로 초기화 된 숫자 열거 형 뒤에 와야한다는 것입니다. 즉, 다음은 허용되지 않습니다.

source: OOP in TypeScript
ko: TypeScript의 OOP

source: OOP programmers are accustomed to being able to query the type of any value, even a generic one:
ko: OOP 프로그래머는 일반적인 값을 포함하여 모든 값의 유형을 쿼리 할 수있는 데 익숙합니다.

source: OOP programmers are often surprised by two particular aspects of structural typing.
ko: OOP 프로그래머는 종종 구조적 타이핑의 두 가지 특정 측면에 놀라곤합니다.

source: Object Types
ko: 객체 유형

source: Object literal type syntax closely mirrors object literal value syntax:
ko: 객체 리터럴 유형 구문은 객체 리터럴 값 구문과 거의 유사합니다.

source: Object spread also has a couple of other surprising limits. First, it only includes an objects&rsquo; <a href="https://developer.mozilla.org/docs/Web/JavaScript/Enumerability_and_ownership_of_properties">own, enumerable properties</a>. Basically, that means you lose methods when you spread instances of an object:
ko: 개체 확산에는 몇 가지 다른 놀라운 한계가 있습니다. 첫째, 개체 <a href="https://developer.mozilla.org/docs/Web/JavaScript/Enumerability_and_ownership_of_properties">고유의 열거 가능한 속성</a> 만 포함합니다 . 기본적으로 이는 객체의 인스턴스를 퍼뜨릴 때 메서드를 잃는다는 것을 의미합니다.

source: Occasionally, you&rsquo;ll run into a library that expects a parameter to be either a <code>number</code> or a <code>string</code>. For instance, take the following function:
ko: 경우에 따라 매개 변수가 <code>number</code> 또는 <code>string</code> 될 것으로 예상하는 라이브러리를 보게됩니다 . 예를 들어, 다음 기능을 사용하십시오.

source: Of course, any of these types can be declared using TypeScript syntax in a single-line <code>@typedef</code>:
ko: 물론, 이러한 유형의 단일 라인에서 타이프 라이터 구문을 사용하여 선언 할 수 <code>@typedef</code> :

source: Offers a way to configure the root directory for where declaration files are emitted.
ko: 선언 파일이 생성되는 루트 디렉토리를 구성하는 방법을 제공합니다.

source: On operating systems like Linux, TypeScript installs directory watchers (as opposed to file watchers) on <code>node_modules</code> and many of its subdirectories to detect changes in dependencies. This is because the number of available file watchers is often eclipsed by the of files in <code>node_modules</code>, whereas there are way fewer directories to track.
ko: Linux와 같은 운영 체제에서 TypeScript는 <code>node_modules</code> 및 많은 하위 디렉터리에 디렉터리 감시자 (파일 감시자와 반대)를 설치 하여 종속성의 변경 사항을 감지합니다. 사용 가능한 파일 감시자의 수는 종종 <code>node_modules</code> 의 파일 수에 의해 가려지는 반면 추적 할 디렉토리가 훨씬 적기 때문입니다.

source: Once you start thinking of types as sets, certain operations become very natural. For example, in C#, it&rsquo;s awkward to pass around a value that is <em>either</em> a <code>string</code> or <code>int</code>, because there isn&rsquo;t a single type that represents this sort of value.
ko: 유형을 세트로 생각하기 시작하면 특정 작업이 매우 자연스러워집니다. 예를 들어, C #으로, 그것은이다 값 주위를 통과 어색한 <em>중 하나 </em> <code>string</code> 또는 <code>int</code> 값의 종류를 나타내는 단일 유형이 없기 때문에.

source: Once you&rsquo;re feeling comfortable, you can come back to read <a href="typescript-in-5-minutes">TypeScript for JavaScript Programmers</a>, then start on <a href="intro">the handbook</a> or explore the <a href="https://www.typescriptlang.org/play#show-examples">Playground examples</a>.
ko: 편안 <a href="typescript-in-5-minutes">해지면 JavaScript 프로그래머 용 TypeScript를</a> 다시 읽은 다음 <a href="intro">핸드북에서</a> 시작 하거나 <a href="https://www.typescriptlang.org/play#show-examples">플레이 그라운드 예제를 살펴볼 수</a> 있습니다.

source: One is the <code>as</code>-syntax:
ko: 하나는 <code>as</code> 구문입니다.

source: One of TypeScript&rsquo;s core principles is that type checking focuses on the <em>shape</em> that values have. This is sometimes called &ldquo;duck typing&rdquo; or &ldquo;structural typing&rdquo;.
ko: TypeScript의 핵심 원칙 중 하나는 유형 검사 가 값 의 <em>모양에</em> 초점을 맞추는 것입니다. 이를 "덕 타이핑"또는 "구조 타이핑"이라고도합니다.

source: One style of exporting in CommonJS is to export a function. Because a function is also an object, then extra fields can be added are included in the export.
ko: CommonJS에서 내보내는 한 가지 스타일은 함수를 내보내는 것입니다. 함수도 객체이기 때문에 내보내기에 추가 필드를 포함 할 수 있습니다.

source: Only emit <code>.d.ts</code> declaration files.
ko: <code>.d.ts</code> 선언 파일 만 내 보냅니다 .

source: Optional Global Usage
ko: 선택적 글로벌 사용

source: Or a number:
ko: 또는 숫자 :

source: Or by marking each export individually:
ko: 또는 각 내보내기를 개별적으로 표시하여 :

source: Other important TypeScript types
ko: 기타 중요한 TypeScript 유형

source: Otherwise <code>Node</code>
ko: 그렇지 않으면 <code>Node</code>

source: Otherwise, these functions accept any arguments and will return <code>any</code>:
ko: 그렇지 않으면 이러한 함수는 모든 인수를 받아들이고 다음을 반환 <code>any</code> .

source: Otherwise, we recommend submitting the types to DefinitelyTyped, which will publish them to the <code>@types</code> organization on npm.
ko: 그렇지 않으면 유형을 DefinitelyTyped에 제출하여 npm 의 <code>@types</code> 조직에 게시하는 것이 좋습니다 .

source: Out - <code>out</code>
ko: 아웃- <code>out</code>

source: Out File - <code>outFile</code>
ko: 아웃 파일 <code>outFile</code>

source: Over 20 years after its introduction to the programming community, JavaScript is now one of the most widespread cross-platform languages ever created. Starting as a small scripting language for adding trivial interactivity to webpages, JavaScript has grown to be a language of choice for both frontend and backend applications of every size. While the size, scope, and complexity of programs written in JavaScript has grown exponentially, the ability of the JavaScript language to express the relationships between different units of code has not. Combined with JavaScript&rsquo;s rather peculiar runtime semantics, this mismatch between language and program complexity has made JavaScript development a difficult task to manage at scale.
ko: 프로그래밍 커뮤니티에 소개 된 지 20 년이 지난 지금 JavaScript는 지금까지 만들어진 가장 널리 퍼진 크로스 플랫폼 언어 중 하나입니다. 웹 페이지에 사소한 상호 작용을 추가하기위한 작은 스크립팅 언어로 시작하여 JavaScript는 모든 크기의 프런트 엔드 및 백엔드 응용 프로그램에서 선택하는 언어로 성장했습니다. JavaScript로 작성된 프로그램의 크기, 범위 및 복잡성은 기하 급수적으로 증가했지만 다른 코드 단위 간의 관계를 표현하는 JavaScript 언어의 능력은 그렇지 않습니다. JavaScript의 다소 특이한 런타임 의미 체계와 결합하여 언어와 프로그램 복잡성 간의 이러한 불일치는 JavaScript 개발을 대규모로 관리하기 어려운 작업으로 만들었습니다.

source: Packages under the <a href="https://www.npmjs.com/~types">@types</a> organization are published automatically from <a href="https://github.com/DefinitelyTyped/DefinitelyTyped">DefinitelyTyped</a> using the <a href="https://github.com/microsoft/DefinitelyTyped-tools/tree/master/packages/publisher">types-publisher tool</a>. To get your declarations published as an @types package, please submit a pull request to <a href="https://github.com/DefinitelyTyped/DefinitelyTyped">DefinitelyTyped</a>. You can find more details in the <a href="http://definitelytyped.org/guides/contributing.html">contribution guidelines page</a>.
ko: <a href="https://www.npmjs.com/~types">@types</a> 조직의 패키지 는 <a href="https://github.com/microsoft/DefinitelyTyped-tools/tree/master/packages/publisher">types-publisher 도구를</a> 사용하여 <a href="https://github.com/DefinitelyTyped/DefinitelyTyped">DefinitelyTyped</a> 에서 자동으로 게시됩니다 . 선언을 @types 패키지로 게시하려면 <a href="https://github.com/DefinitelyTyped/DefinitelyTyped">DefinitelyTyped에</a> pull 요청을 제출하십시오 . <a href="http://definitelytyped.org/guides/contributing.html">기여 지침 페이지</a> 에서 자세한 내용을 확인할 수 있습니다 .

source: Pass it an element id string and it will return either <code>HTMLElement</code> or <code>null</code> . This method introduces one of the most important types, <code>HTMLElement</code>. It serves as the base interface for every other element interface. For example, the <code>p</code> variable in the code example is of type <code>HTMLParagraphElement</code>. Also take note that this method can return <code>null</code>. This is because the method can&rsquo;t be certain pre-runtime if it will be able to actually find the specified element or not. In the last line of the code snippet, the new <em>optional chaining</em> operator is used in order to call <code>appendChild</code>.
ko: 요소 ID 문자열을 전달하면 <code>HTMLElement</code> 또는 <code>null</code> 을 반환합니다 . 이 메소드는 가장 중요한 유형 중 하나 인 <code>HTMLElement</code> 를 소개 합니다. 다른 모든 요소 인터페이스의 기본 인터페이스 역할을합니다. 예를 들어 코드 예제 의 <code>p</code> 변수는 <code>HTMLParagraphElement</code> 유형 입니다 . 또한이 메서드는 <code>null</code> 을 반환 할 수 있습니다 . 이는 메서드가 지정된 요소를 실제로 찾을 수 있는지 여부를 확인할 수있는 경우 특정 사전 런타임이 될 수 없기 때문입니다. 코드 조각의 마지막 줄 에서 <code>appendChild</code> 를 호출하기 위해 새로운 <em>선택적 연결</em> 연산자가 사용됩니다 .

source: Paths - <code>paths</code>
ko: 경로- <code>paths</code>

source: Platform specific
ko: 플랫폼 별

source: Plugins - <code>plugins</code>
ko: 플러그인- <code>plugins</code>

source: Point-free programming
ko: 포인트 프리 프로그래밍

source: Point-free programming &mdash; heavy use of currying and function composition &mdash; is possible in JavaScript, but can be verbose. In TypeScript, type inference often fails for point-free programs, so you&rsquo;ll end up specifying type parameters instead of value parameters. The result is so verbose that it&rsquo;s usually better to avoid point-free programming.
ko: 점없는 프로그래밍 (커링 및 함수 구성의 과도한 사용)은 JavaScript에서 가능하지만 장황 할 수 있습니다. TypeScript에서 유형 추론은 포인트없는 프로그램에 대해 종종 실패하므로 값 매개 변수 대신 유형 매개 변수를 지정하게됩니다. 결과는 너무 장황하여 일반적으로 포인트 프리 프로그래밍을 피하는 것이 좋습니다.

source: Preserve Const Enums - <code>preserveConstEnums</code>
ko: 헌장 열거 형을 유지 - <code>preserveConstEnums</code> 을

source: Preserve Symlinks - <code>preserveSymlinks</code>
ko: 심볼릭 링크를 유지 - <code>preserveSymlinks</code> 을

source: Preserve Watch Output - <code>preserveWatchOutput</code>
ko: 감시 출력 <code>preserveWatchOutput</code>

source: Preserve: <code>"preserve"</code>
ko: 보존 : <code>"preserve"</code>

source: Pretty - <code>pretty</code>
ko: 예쁘다- <code>pretty</code>

source: Previous versions of this document recommended a way to write mixins where you created both the runtime and type hierarchies separately, then merged them at the end:
ko: 이 문서의 이전 버전에서는 런타임과 유형 계층을 별도로 만든 다음 마지막에 병합하는 믹스 인을 작성하는 방법을 권장했습니다.

source: Previously, this document details the <code>HTMLElement</code> interface extends from <code>Element</code> which extends from <code>Node</code>. In the DOM API there is a concept of <em>children</em> elements. For example in the following HTML, the <code>p</code> tags are children of the <code>div</code> element
ko: 이전에이 문서 는 <code>Node</code> 에서 확장되는 <code>Element</code> 에서 확장 된 <code>HTMLElement</code> 인터페이스에 대해 자세히 설명합니다 . DOM API에는 <em>자식</em> 요소 의 개념이 <em>있습니다</em> . 예를 들어 다음 HTML에서 <code>p</code> 태그는 <code>div</code> 요소의 자식입니다.<em></em>

source: Print names of files part of the compilation. This is useful when you are not sure that TypeScript has included a file you expected.
ko: 컴파일의 일부 파일 이름을 인쇄합니다. 이것은 TypeScript에 예상 한 파일이 포함되어 있는지 확실하지 않을 때 유용합니다.

source: Print names of generated files part of the compilation to the terminal.
ko: 컴파일 과정에서 생성 된 파일의 이름을 터미널에 인쇄합니다.

source: Prior to TypeScript 3.8, you can import a type using <code>import</code>. With TypeScript 3.8, you can import a type using the <code>import</code> statement, or using <code>import type</code>.
ko: TypeScript 3.8 이전에는 import를 사용하여 유형을 <code>import</code> 있습니다. TypeScript 3.8에서는 <code>import</code> 문을 사용하거나 <code>import type</code> 을 사용하여 유형 을 가져올 수 있습니다.

source: Project Options
ko: 프로젝트 옵션

source: Project references are a way to structure your TypeScript programs into smaller pieces. Using Project References can greatly improve build and editor interaction times, enforce logical separation between components, and organize your code in new and improved ways.
ko: 프로젝트 참조는 TypeScript 프로그램을 더 작은 조각으로 구성하는 방법입니다. 프로젝트 참조를 사용하면 빌드 및 편집기 상호 작용 시간을 크게 개선하고 구성 요소 간의 논리적 분리를 적용하며 새롭고 향상된 방식으로 코드를 구성 할 수 있습니다.

source: Properties with relative paths found in the configuration file, which aren&rsquo;t excluded from inheritance, will be resolved relative to the configuration file they originated in.
ko: 상속에서 제외되지 않은 구성 파일에서 찾은 상대 경로가있는 속성은 원래 구성 파일을 기준으로 확인됩니다.

source: Providing Type Hints in JS via JSDoc
ko: JSDoc을 통해 JS에서 유형 힌트 제공

source: Publish to
ko: 게시

source: Question to ask yourself while looking at a library you are trying to type.
ko: 입력하려는 도서관을 보면서 스스로에게 물어보십시오.

source: Raise error on &lsquo;this&rsquo; expressions with an implied &lsquo;any&rsquo; type.
ko: 암시 된 'any'유형으로 'this'표현식에서 오류를 발생시킵니다.

source: React 17 dev transform: <code>"react-jsxdev"</code><sup><a href="https://reactjs.org/blog/2020/09/22/introducing-the-new-jsx-transform.html">[1]</a></sup>
ko: React 17 dev 변환 : <code>"react-jsxdev"</code> <sup><a href="https://reactjs.org/blog/2020/09/22/introducing-the-new-jsx-transform.html">[1]</a></sup>

source: React 17 transform: <code>"react-jsx"</code><sup><a href="https://reactjs.org/blog/2020/09/22/introducing-the-new-jsx-transform.html">[1]</a></sup>
ko: React 17 변환 : <code>"react-jsx"</code> <sup><a href="https://reactjs.org/blog/2020/09/22/introducing-the-new-jsx-transform.html">[1]</a></sup>

source: React Namespace - <code>reactNamespace</code>
ko: React 네임 스페이스 <code>reactNamespace</code>

source: React Native
ko: 네이티브 반응

source: Read and understand commonly-used TypeScript syntax and patterns
ko: 일반적으로 사용되는 TypeScript 구문 및 패턴을 읽고 이해합니다.

source: Read the full Handbook <a href="intro">from start to finish</a> (30m)
ko: <a href="intro">처음부터 끝까지</a> 전체 핸드북 읽기 (30 분)

source: Reference Example
ko: 참조 예

source: References - <code>references</code>
ko: 참조- <code>references</code>

source: References to <code>const enum</code> members
ko: <code>const enum</code> 멤버에 대한 참조

source: Remove Comments - <code>removeComments</code>
ko: 댓글 제거 <code>removeComments</code>

source: Removes the <a href="functions#this-parameters"><code>this</code></a> parameter from <code>Type</code>. If <code>Type</code> has no explicitly declared <code>this</code> parameter, the result is simply <code>Type</code>. Otherwise, a new function type with no <code>this</code> parameter is created from <code>Type</code>. Generics are erased and only the last overload signature is propagated into the new function type.
ko: <code>Type</code> <a href="functions#this-parameters"> <code>this</code> </a> 매개 변수를 제거합니다 . <code>Type</code> <code>this</code> 매개 변수를 명시 적으로 선언하지 않은 경우 결과는 단순히 <code>Type</code> 입니다. 그렇지 않으면 <code>this</code> 매개 변수가 없는 새 함수 유형 이 <code>Type</code> 에서 생성됩니다 . 제네릭은 지워지고 마지막 오버로드 서명 만 새 함수 유형으로 전파됩니다.

source: Report errors for fallthrough cases in switch statements. Ensures that any non-empty case inside a switch statement includes either <code>break</code> or <code>return</code>. This means you won&rsquo;t accidentally ship a case fallthrough bug.
ko: switch 문에서 폴 스루 사례에 대한 오류를보고합니다. switch 문 내에서 비어 있지 않은 모든 case에 <code>break</code> 또는 <code>return</code> 이 포함되는지 확인합니다 . 이는 실수로 케이스 폴 스루 버그를 발송하지 않음을 의미합니다.

source: Report errors on unused local variables.
ko: 사용하지 않는 지역 변수에 대한 오류를보고합니다.

source: Report errors on unused parameters in functions.
ko: 함수에서 사용하지 않는 매개 변수에 대한 오류를보고합니다.

source: Requires either <code>sourceMap</code> or <code>inlineSourceMap</code> to be set.
ko: 중 필요 <code>sourceMap</code> 또는 <code>inlineSourceMap</code> 가 설정 될 수 있습니다.

source: Resolve JSON Module - <code>resolveJsonModule</code>
ko: JSON 모듈 해결 <code>resolveJsonModule</code>

source: Rethinking Types
ko: 유형 재검토

source: Rethinking the Class
ko: 수업 재검토

source: Right click on the <code>wwwroot</code> folder (if you don&rsquo;t see the folder try building the project) and add a New Item named <code>index.html</code> inside. Use the following code for <code>index.html</code>
ko: <code>wwwroot</code> 폴더를 마우스 오른쪽 버튼으로 클릭하고 (폴더가 보이지 않으면 프로젝트를 빌드 해보십시오) <code>index.html</code> 이라는 새 항목을 내부에 추가하십시오 . <code>index.html</code> 에 다음 코드를 사용하십시오.

source: Root Dir - <code>rootDir</code>
ko: 루트 디렉터리 <code>rootDir</code>

source: Root Dirs - <code>rootDirs</code>
ko: 루트 Dirs- <code>rootDirs</code>

source: Root Fields
ko: 루트 필드

source: Roughly speaking, once TypeScript&rsquo;s compiler is done with checking your code, it <em>erases</em> the types to produce the resulting &ldquo;compiled&rdquo; code. This means that once your code is compiled, the resulting plain JS code has no type information.
ko: 대략적으로 말하면 TypeScript의 컴파일러가 코드 검사를 마치면 유형을 <em>지워</em> "컴파일 된"코드를 생성합니다. 즉, 코드가 컴파일되면 결과 일반 JS 코드에는 유형 정보가 없습니다.

source: Run the TypeScript compiler to generate the corresponding d.ts files for JS files
ko: TypeScript 컴파일러를 실행하여 JS 파일에 해당하는 d.ts 파일 생성

source: In this version, we add a setter that checks the length of the <code>newName</code> to make sure it&rsquo;s compatible with the max-length of our backing database field. If it isn&rsquo;t we throw an error notifying client code that something went wrong.
es: En esta versi&oacute;n, agregamos un setter que verifica la longitud de <code>newName</code> para asegurarse de que sea compatible con la longitud m&aacute;xima de nuestro campo de base de datos de respaldo. Si no es as&iacute;, arrojamos un error notificando al c&oacute;digo del cliente que algo sali&oacute; mal.
