Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/typescript/typescript.*.003.xlf
Languages: es, ko, ru, zh_cn

source: Numeric separators
es: Separadores numéricos
ko: 숫자 분리기
ru: числовые разделители
zh_cn: 数值分离器

source: Object Spread and Rest
es: Difusión y descanso del objeto
ko: 물체 퍼짐 및 휴식
ru: Распространение и отдых объектов
zh_cn: 对象扩散和休息

source: Object destructuring
es: Desestructuración de objetos
ko: 객체 파괴
ru: Разрушение объекта
zh_cn: 对象重构

source: Object literals are open-ended
es: Los literales de los objetos son abiertos
ko: 객체 리터럴은 개방형입니다.
ru: Буквы объекта открыты
zh_cn: 对象字元是开放式的

source: Object literals behave as if they have an index signature <code>[x:string]: any</code> that allows them to be treated as open maps instead of closed objects.
es: Los objetos literales se comportan como si tuvieran una firma de &iacute;ndice <code>[x:string]: any</code> que les permita ser tratados como mapas abiertos en lugar de objetos cerrados.
ko: 객체 리터럴은 인덱스 서명 <code>[x:string]: any</code> 이있는 것처럼 동작 합니다.이 객체는 닫힌 객체 대신 열린 맵으로 취급 될 수 있습니다.
ru: Литералы объектов ведут себя так, как если бы у них была индексная подпись <code>[x:string]: any</code> которая позволяет рассматривать их как открытые карты вместо закрытых объектов.
zh_cn: 对象文字的行为就好像它们具有索引签名 <code>[x:string]: any</code> 将其视为开放映射而不是封闭对象的索引。

source: Object rests are the dual of object spreads, in that they can extract any extra properties that don&rsquo;t get picked up when destructuring an element:
es: Los restos de objetos son el doble de las extensiones de objetos, ya que pueden extraer cualquier propiedad adicional que no se recoja al desestructurar un elemento:
ko: 오브젝트 레스트는 요소를 파괴 할 때 선택되지 않은 추가 속성을 추출 할 수 있다는 점에서 오브젝트 스프레드의 이중입니다.
ru: Остатки объектов - это двойные объекты разворотов, поскольку они могут извлекать любые дополнительные свойства, которые не используются при деструктуризации элемента:
zh_cn: 对象其余部分是对象散布的对偶，因为它们可以提取在分解元素时不会拾取的任何其他属性：

source: Object spread also has a couple of other surprising limits. First, it only includes an objects&rsquo; <a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Enumerability_and_ownership_of_properties">own, enumerable properties</a>. Basically, that means you lose methods when you spread instances of an object:
es: La distribuci&oacute;n de objetos tambi&eacute;n tiene un par de otros l&iacute;mites sorprendentes. Primero, solo incluye las <a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Enumerability_and_ownership_of_properties">propiedades enumerables propias de</a> un objeto . B&aacute;sicamente, eso significa que pierde m&eacute;todos cuando extiende instancias de un objeto:
ko: 개체 확산에는 몇 가지 놀라운 한계가 있습니다. 먼저, 객체 <a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Enumerability_and_ownership_of_properties">자체의 열거 가능한 속성</a> 만 포함합니다 . 기본적으로 객체의 인스턴스를 펼치면 메소드가 손실됩니다.
ru: У разброса объектов есть еще несколько удивительных ограничений. Во-первых, он включает только <a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Enumerability_and_ownership_of_properties">собственные перечислимые свойства объекта</a> . По сути, это означает, что вы теряете методы при распространении экземпляров объекта:
zh_cn: 对象传播还具有其他一些令人惊讶的限制。首先，它仅包含对象<a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Enumerability_and_ownership_of_properties">自己的可枚举属性</a>。基本上，这意味着您在传播对象实例时会丢失方法：

source: Objects with Properties
es: Objetos con propiedades
ko: 속성이있는 객체
ru: Объекты со свойствами
zh_cn: 有属性的对象

source: Of course, any of these types can be declared using Typescript syntax in a single-line <code>@typedef</code>:
es: Por supuesto, cualquiera de estos tipos se puede declarar usando la sintaxis de <code>@typedef</code> en una l&iacute;nea @typedef :
ko: 물론 이러한 유형은 단일 줄 <code>@typedef</code> 에서 Typescript 구문을 사용하여 선언 할 수 있습니다 .
ru: Конечно, любой из этих типов может быть объявлен с использованием синтаксиса <code>@typedef</code> однострочном @typedef :
zh_cn: 当然，任何这些类型的可以在单一行使用打字稿语法声明 <code>@typedef</code> ：

source: Of course, since this is JavaScript, you can just ignore trailing elements you don&rsquo;t care about:
es: Por supuesto, dado que esto es JavaScript, puede simplemente ignorar los elementos finales que no le interesan:
ko: 물론 이것은 JavaScript이기 때문에 신경 쓰지 않는 후행 요소를 무시할 수 있습니다.
ru: Конечно, поскольку это JavaScript, вы можете просто игнорировать конечные элементы, которые вам не нужны:
zh_cn: 当然，由于这是JavaScript，因此您可以忽略不关心的尾随元素：

source: Of course, that might not feel right. If you open that file in an editor with TypeScript support (or if you run <code>tsc --pretty</code>), you might see red squiggles on certain lines. You should think of these the same way you&rsquo;d think of red squiggles in an editor like Microsoft Word. TypeScript will still translate your code, just like Word will still let you print your documents.
es: Por supuesto, puede que eso no se sienta bien. Si abre ese archivo en un editor compatible con TypeScript (o si ejecuta <code>tsc --pretty</code> ), es posible que vea garabatos rojos en ciertas l&iacute;neas. Deber&iacute;a pensar en estos de la misma manera que pensar&iacute;a en garabatos rojos en un editor como Microsoft Word. TypeScript a&uacute;n traducir&aacute; su c&oacute;digo, al igual que Word le permitir&aacute; imprimir sus documentos.
ko: 물론, 그것은 기분이 좋지 않을 수 있습니다. TypeScript를 지원하는 편집기에서 해당 파일을 열거 나 (또는 <code>tsc --pretty</code> 를 실행하는 경우 ) 특정 행에 빨간색 표시가 나타날 수 있습니다. Microsoft Word와 같은 편집기에서 빨간색 구불 구불 한 생각과 동일한 방식으로 생각해야합니다. Word에서 문서를 인쇄 할 수있는 것처럼 TypeScript는 여전히 코드를 번역합니다.
ru: Конечно, это может показаться неправильным. Если вы откроете этот файл в редакторе с поддержкой TypeScript (или запустите <code>tsc --pretty</code> ), вы можете увидеть красные волнистые линии на определенных строках. Вы должны думать об этом так же, как о красных волнистых линиях в редакторе, таком как Microsoft Word. TypeScript по-прежнему будет переводить ваш код, так же как Word по-прежнему позволяет печатать ваши документы.
zh_cn: 当然，这可能感觉不对。如果您在具有TypeScript支持的编辑器中打开该文件（或者如果运行 <code>tsc --pretty</code> ），则可能会在某些行上看到红色的花键。您应该像对待Microsoft Word这样的编辑器中的红色花形一样来思考这些问题。TypeScript仍然可以翻译您的代码，就像Word仍可以让您打印文档一样。

source: Of note, only the parameters and the return type make up the function type. Captured variables are not reflected in the type. In effect, captured variables are part of the &ldquo;hidden state&rdquo; of any function and do not make up its API.
es: Es de destacar que solo los par&aacute;metros y el tipo de retorno constituyen el tipo de funci&oacute;n. Las variables capturadas no se reflejan en el tipo. En efecto, las variables capturadas son parte del "estado oculto" de cualquier funci&oacute;n y no forman parte de su API.
ko: 매개 변수와 리턴 유형 만 기능 유형을 구성합니다. 캡처 된 변수는 유형에 반영되지 않습니다. 실제로, 캡처 된 변수는 함수의 "숨겨진 상태"의 일부이며 API를 구성하지 않습니다.
ru: Следует отметить, что только параметры и возвращаемый тип составляют тип функции. Захваченные переменные не отражаются в типе. Фактически, захваченные переменные являются частью &laquo;скрытого состояния&raquo; любой функции и не составляют ее API.
zh_cn: 值得注意的是，只有参数和返回类型构成了函数类型。捕获的变量不会反映在类型中。实际上，捕获的变量是任何函数的&ldquo;隐藏状态&rdquo;的一部分，并且不构成其API。

source: Official TypeScript NuGet package
es: Paquete oficial de TypeScript NuGet
ko: 공식 TypeScript NuGet 패키지
ru: Официальный пакет TypeScript NuGet
zh_cn: 官方TypeScript NuGet包

source: Often a project has multiple output targets, e.g. <code>ES5</code> and <code>ES2015</code>, debug and production or <code>CommonJS</code> and <code>System</code>; Just a few configuration options change between these two targets, and maintaining multiple <code>tsconfig.json</code> files can be a hassle.
es: A menudo, un proyecto tiene m&uacute;ltiples objetivos de salida, por ejemplo, <code>ES5</code> y <code>ES2015</code> , depuraci&oacute;n y producci&oacute;n o <code>CommonJS</code> y <code>System</code> ; Solo algunas opciones de configuraci&oacute;n cambian entre estos dos destinos, y mantener varios archivos <code>tsconfig.json</code> puede ser una molestia.
ko: 종종 프로젝트에는 여러 개의 출력 대상 (예 : <code>ES5</code> 및 <code>ES2015</code> , 디버그 및 프로덕션 또는 <code>CommonJS</code> 및 <code>System</code> . 이 두 대상간에 몇 가지 구성 옵션 만 변경하면 여러 <code>tsconfig.json</code> 파일을 유지 관리하는 것이 번거로울 수 있습니다.
ru: Часто проект имеет несколько целей вывода, например, <code>ES5</code> и <code>ES2015</code> , отладка и производство или <code>CommonJS</code> и <code>System</code> ; Между этими двумя целями меняется всего несколько параметров конфигурации, и поддержка нескольких файлов <code>tsconfig.json</code> может стать проблемой .
zh_cn: 一个项目通常具有多个输出目标，例如 <code>ES5</code> 和 <code>ES2015</code> ，调试和生产或 <code>CommonJS</code> 和 <code>System</code> ；这两个目标之间只有几个配置选项会发生变化，并且维护多个 <code>tsconfig.json</code> 文件可能很麻烦。

source: Often in Node.js applications a <code>.json</code> is needed. With TypeScript 2.9, <code>--resolveJsonModule</code> allows for importing, extracting types from and generating <code>.json</code> files.
es: A menudo, en las aplicaciones de Node.js, se necesita un <code>.json</code> . Con TypeScript 2.9, <code>--resolveJsonModule</code> permite importar, extraer tipos y generar archivos <code>.json</code> .
ko: 종종 Node.js 애플리케이션에서 <code>.json</code> 이 필요합니다. TypeScript 2.9에서는 <code>--resolveJsonModule</code> 을 사용하여 <code>.json</code> 파일 에서 가져 오기, 유형 추출 및 생성이 가능 합니다.
ru: Часто в приложениях Node.js требуется <code>.json</code> . В TypeScript 2.9 <code>--resolveJsonModule</code> позволяет импортировать, извлекать типы и <code>.json</code> файлы .json .
zh_cn: 在Node.js应用程序中，通常需要一个 <code>.json</code> 。在TypeScript 2.9中，-- <code>--resolveJsonModule</code> 允许导入，提取类型并生成 <code>.json</code> 文件。

source: Often modules extend other modules, and partially expose some of their features. A re-export does not import it locally, or introduce a local variable.
es: A menudo los módulos amplían otros módulos y exponen parcialmente algunas de sus características.Una reexportación no la importa localmente,ni introduce una variable local.
ko: 종종 모듈은 다른 모듈을 확장하고 일부 기능을 부분적으로 노출합니다. 다시 내보내기는 로컬로 가져 오거나 로컬 변수를 도입하지 않습니다.
ru: Часто модули расширяют другие модули,и частично раскрывают некоторые их возможности.Реэкспорт не импортирует его локально или не вводит локальную переменную.
zh_cn: 通常模块会扩展其他模块,并部分暴露其部分功能。再导出并不在本地导入,也不引入本地变量。

source: Often there are external source files in your project that may not be authored in TypeScript. Alternatively, you might be in the middle of converting a JS code base into TS, but still want to bundle all your JS code into a single file with the output of your new TS code.
es: A menudo hay archivos de fuente externa en su proyecto que pueden no estar escritos en TypeScript.Alternativamente,puede estar en medio de la conversión de un código base JS en TS,pero aún así quiere agrupar todo su código JS en un solo archivo con la salida de su nuevo código TS.
ko: 종종 프로젝트에 TypeScript로 제작되지 않은 외부 소스 파일이 있습니다. 또는 JS 코드베이스를 TS로 변환하는 중이지만 새 TS 코드의 출력을 사용하여 모든 JS 코드를 단일 파일로 번들링하려는 경우가 있습니다.
ru: Часто в вашем проекте есть внешние исходные файлы,которые не могут быть написаны в TypeScript.Альтернативно,вы можете быть в середине преобразования базы JS-кода в TS,но все еще хотите связать весь ваш JS-код в один файл с выводом вашего нового TS-кода.
zh_cn: 通常,在你的项目中,有一些外部的源文件可能不是用TypeScript编写的。或者,你可能正在将JS代码库转换为TS,但仍然希望将所有JS代码与新的TS代码的输出捆绑到一个文件中。

source: Often you will need to extend functionality on a module. A common JS pattern is to augment the original object with <em>extensions</em>, similar to how JQuery extensions work. As we&rsquo;ve mentioned before, modules do not <em>merge</em> like global namespace objects would. The recommended solution is to <em>not</em> mutate the original object, but rather export a new entity that provides the new functionality.
es: A menudo, necesitar&aacute; ampliar la funcionalidad de un m&oacute;dulo. Un patr&oacute;n JS com&uacute;n es aumentar el objeto original con <em>extensiones</em> , similar a c&oacute;mo funcionan las extensiones de JQuery. Como hemos mencionado antes, los m&oacute;dulos no se <em>fusionan</em> como lo har&iacute;an los objetos de espacio de nombres globales. La soluci&oacute;n recomendada es <em>no</em> mutar el objeto original, sino exportar una nueva entidad que proporciona la nueva funcionalidad.
ko: 종종 모듈의 기능을 확장해야합니다. 일반적인 JS 패턴은 JQuery 확장이 작동하는 방식과 유사하게 원래 객체를 <em>확장 기능</em> 으로 보강하는 것입니다. 앞에서 언급했듯이 모듈은 전역 네임 스페이스 객체처럼 <em>병합</em> 되지 않습니다 . 권장되는 솔루션은 원래 객체를 변경 <em>하지</em> 않고 새로운 기능을 제공하는 새 엔티티를 내보내는 것입니다.
ru: Часто вам нужно расширить функциональность модуля. Распространенным шаблоном JS является расширение исходного объекта <em>расширениями</em> , аналогично тому, как работают расширения JQuery. Как мы упоминали ранее, модули не <em>объединяются,</em> как объекты глобального пространства имен. Рекомендуемое решение - <em>не</em> изменять исходный объект, а скорее экспортировать новую сущность, которая предоставляет новые функции.
zh_cn: 通常，您将需要扩展模块上的功能。常见的JS模式是使用<em>扩展</em>来扩展原始对象，类似于JQuery扩展的工作方式。如前所述，模块不会像全局名称空间对象那样<em>合并</em>。推荐的解决方案是<em>不要</em>变异原始对象，而是导出提供新功能的新实体。

source: On a single line:
es: En una sola línea:
ko: 한 줄로 :
ru: На одной линии:
zh_cn: 在一条线上。

source: On multiple lines:
es: En múltiples líneas:
ko: 여러 줄에서 :
ru: На нескольких линиях:
zh_cn: 在多行。

source: On the last line of the snippet you can see that even assigning the entire <code>ReadonlyArray</code> back to a normal array is illegal. You can still override it with a type assertion, though:
es: En la &uacute;ltima l&iacute;nea del fragmento, puede ver que incluso asignar el <code>ReadonlyArray</code> completo a una matriz normal es ilegal. Sin embargo, a&uacute;n puede anularlo con una aserci&oacute;n de tipo:
ko: 스 니펫의 마지막 줄에서 전체 <code>ReadonlyArray</code> 를 일반 배열에 다시 할당하는 것조차 불법임을 알 수 있습니다. 그래도 유형 어설 션으로 재정의 할 수 있습니다.
ru: В последней строке фрагмента вы можете видеть, что даже присвоение всего <code>ReadonlyArray</code> обычному массиву является незаконным. Однако вы все равно можете переопределить его с помощью утверждения типа:
zh_cn: 在代码片段的最后一行，您可以看到，即使将整个 <code>ReadonlyArray</code> 分配回普通数组也是非法的。但是，您仍然可以使用类型断言来覆盖它：

source: On the organization front, namespaces are handy for grouping together logically-related objects and types in the global scope. For example, in C#, you&rsquo;re going to find all the collection types in System.Collections. By organizing our types into hierarchical namespaces, we provide a good &ldquo;discovery&rdquo; experience for users of those types. Modules, on the other hand, are already present in a file system, necessarily. We have to resolve them by path and filename, so there&rsquo;s a logical organization scheme for us to use. We can have a /collections/generic/ folder with a list module in it.
es: En el frente de la organizaci&oacute;n, los espacios de nombres son &uacute;tiles para agrupar objetos y tipos relacionados l&oacute;gicamente en el &aacute;mbito global. Por ejemplo, en C #, encontrar&aacute; todos los tipos de colecci&oacute;n en System.Collections. Al organizar nuestros tipos en espacios de nombres jer&aacute;rquicos, proporcionamos una buena experiencia de "descubrimiento" para los usuarios de esos tipos. Los m&oacute;dulos, por otro lado, ya est&aacute;n presentes en un sistema de archivos, necesariamente. Tenemos que resolverlos por ruta y nombre de archivo, por lo que hay un esquema de organizaci&oacute;n l&oacute;gico que podemos usar. Podemos tener una carpeta / collections / generic / con un m&oacute;dulo de lista en ella.
ko: 조직 전면에서 네임 스페이스는 논리적으로 관련된 개체와 유형을 전역 적으로 그룹화하는 데 편리합니다. 예를 들어 C #에서는 System.Collections에서 모든 컬렉션 유형을 찾습니다. 유형을 계층 적 네임 스페이스로 구성하여 해당 유형의 사용자에게 좋은 "발견"경험을 제공합니다. 반면에 모듈은 반드시 파일 시스템에 이미 존재합니다. 경로와 파일 이름으로 해결해야하므로 사용할 수있는 논리적 구성 체계가 있습니다. 리스트 모듈이있는 / collections / generic / 폴더를 가질 수 있습니다.
ru: Что касается организации, пространства имен удобны для группировки логически связанных объектов и типов в глобальной области. Например, в C # вы найдете все типы коллекций в System.Collections. Организуя наши типы в иерархические пространства имен, мы обеспечиваем хорошее &laquo;обнаружение&raquo; для пользователей этих типов. С другой стороны, модули обязательно уже присутствуют в файловой системе. Мы должны разрешить их по пути и имени файла, поэтому есть логическая схема организации, которую мы можем использовать. У нас может быть папка / collections / generic / со списком в ней.
zh_cn: 在组织方面，名称空间非常适用于将全局范围内与逻辑相关的对象和类型组合在一起。例如，在C＃中，您将在System.Collections中找到所有集合类型。通过将我们的类型组织到分层名称空间中，我们为这些类型的用户提供了良好的&ldquo;发现&rdquo;体验。另一方面，模块必须已经存在于文件系统中。我们必须通过路径和文件名来解析它们，因此有一种逻辑上的组织方案可供我们使用。我们可以在其中包含一个列表模块的/ collections / generic /文件夹中。

source: On the other hand, if you can&rsquo;t express some shape with an interface and you need to use a union or tuple type, type aliases are usually the way to go.
es: Por otro lado, si no puede expresar alguna forma con una interfaz y necesita usar un tipo de uni&oacute;n o tupla, los alias de tipo suelen ser el camino a seguir.
ko: 반면에 인터페이스로 모양을 표현할 수없고 공용체 또는 튜플 형식을 사용해야하는 경우 일반적으로 형식 별칭이 사용됩니다.
ru: С другой стороны, если вы не можете выразить какую-либо форму с помощью интерфейса и вам нужно использовать тип объединения или кортежа, обычно можно использовать псевдонимы типов.
zh_cn: 另一方面，如果您无法使用接口表达某种形状，而需要使用并集或元组类型，则通常使用类型别名。

source: On the other hand, methods like <code>forEach</code> will now be callable, but under <code>noImplicitAny</code> there may be some issues.
es: Por otro lado, m&eacute;todos como <code>forEach</code> ahora ser&aacute;n invocables, pero bajo <code>noImplicitAny</code> puede haber algunos problemas.
ko: 반면, <code>forEach</code> 와 같은 메소드 는 이제 호출 가능하지만 <code>noImplicitAny</code> 에서는 몇 가지 문제가있을 수 있습니다.
ru: С другой стороны, теперь можно будет вызывать такие методы, как <code>forEach</code> , но в <code>noImplicitAny</code> могут возникнуть некоторые проблемы.
zh_cn: 另一方面，诸如 <code>forEach</code> 之类的方法现在可以调用，但是在 <code>noImplicitAny</code> 下可能存在一些问题。

source: Once defined, we can use this function type interface like we would other interfaces. Here, we show how you can create a variable of a function type and assign it a function value of the same type.
es: Una vez definido,podemos usar este tipo de función como lo haríamos con otras interfaces.Aquí mostramos cómo se puede crear una variable de un tipo de función y asignarle un valor de función del mismo tipo.
ko: 일단 정의되면 다른 인터페이스와 마찬가지로이 함수 유형 인터페이스를 사용할 수 있습니다. 여기에서는 함수 유형의 변수를 작성하고 동일한 유형의 함수 값을 지정하는 방법을 보여줍니다.
ru: После определения,мы можем использовать этот интерфейс типа функции,как и другие интерфейсы.Здесь мы показываем,как можно создать переменную типа функции и присвоить ей значение этого же типа.
zh_cn: 一旦定义好,我们就可以像使用其他接口一样使用这个函数类型接口。在这里,我们将展示如何创建一个函数类型的变量,并给它分配一个相同类型的函数值。

source: Once the class type is established, the instance type is determined by the union of the return types of the class type&rsquo;s construct or call signatures (whichever is present). So again, in the case of an ES6 class, the instance type would be the type of an instance of that class, and in the case of a factory function, it would be the type of the value returned from the function.
es: Una vez que se establece el tipo de clase, el tipo de instancia se determina mediante la uni&oacute;n de los tipos de retorno de la construcci&oacute;n del tipo de clase o firmas de llamada (lo que est&eacute; presente). Entonces, nuevamente, en el caso de una clase ES6, el tipo de instancia ser&iacute;a el tipo de una instancia de esa clase, y en el caso de una funci&oacute;n de f&aacute;brica, ser&iacute;a el tipo del valor devuelto por la funci&oacute;n.
ko: 클래스 유형이 설정되면 인스턴스 유형은 클래스 유형의 구성 또는 호출 서명 (둘 중 존재하는 것)의 리턴 유형을 결합하여 결정됩니다. 다시 ES6 클래스의 경우 인스턴스 유형은 해당 클래스의 인스턴스 유형이되고 팩토리 함수의 경우 함수에서 반환 된 값의 유형이됩니다.
ru: После того, как тип класса установлен, тип экземпляра определяется объединением возвращаемых типов конструкции типа класса или сигнатур вызовов (в зависимости от того, что присутствует). Итак, опять же, в случае класса ES6 тип экземпляра будет типом экземпляра этого класса, а в случае фабричной функции это будет тип значения, возвращаемого функцией.
zh_cn: 一旦建立了类类型，实例类型就由类类型的构造或调用签名（以存在者为准）的返回类型的并集来确定。同样，在ES6类的情况下，实例类型将是该类的实例的类型，在工厂功能的情况下，实例类型将是从函数返回的值的类型。

source: Once there are multiple files involved, we&rsquo;ll need to make sure all of the compiled code gets loaded. There are two ways of doing this.
es: Una vez que haya varios archivos involucrados, tendremos que asegurarnos de que se cargue todo el c&oacute;digo compilado. Hay dos formas de hacer esto.
ko: 파일이 여러 개 있으면 컴파일 된 코드가 모두로드되는지 확인해야합니다. 이를 수행하는 두 가지 방법이 있습니다.
ru: Когда задействовано несколько файлов, нам нужно убедиться, что весь скомпилированный код загружен. Это можно сделать двумя способами.
zh_cn: 一旦涉及到多个文件，我们将需要确保所有已编译的代码都已加载。有两种方法可以做到这一点。

source: Once we&rsquo;ve written the generic identity function, we can call it in one of two ways. The first way is to pass all of the arguments, including the type argument, to the function:
es: Una vez que hemos escrito la funci&oacute;n de identidad gen&eacute;rica, podemos llamarla de dos formas. La primera forma es pasar todos los argumentos, incluido el argumento de tipo, a la funci&oacute;n:
ko: 일반 아이덴티티 함수를 작성하면 두 가지 방법 중 하나로 호출 할 수 있습니다. 첫 번째 방법은 type 인수를 포함한 모든 인수를 함수에 전달하는 것입니다.
ru: После того, как мы написали универсальную функцию идентификации, мы можем вызвать ее одним из двух способов. Первый способ - передать функции все аргументы, включая аргумент типа:
zh_cn: 一旦编写了通用标识函数，就可以用以下两种方法之一来调用它。第一种方法是将所有参数（包括类型参数）传递给函数：

source: One advantage of this is that the callable constructor pattern can be easily expressed while also allowing namespaces to merge with these declarations (since <code>var</code> declarations can&rsquo;t merge with <code>namespace</code>s).
es: Una ventaja de esto es que el patr&oacute;n del constructor invocable se puede expresar f&aacute;cilmente al mismo tiempo que permite que los espacios de nombres se fusionen con estas declaraciones (ya que las declaraciones <code>var</code> no se pueden fusionar con los <code>namespace</code> ).
ko: 이것의 한 가지 장점은 호출 가능한 생성자 패턴을 쉽게 표현할 수 있고 네임 스페이스를 이러한 선언과 병합 할 수 있다는 것입니다 ( <code>var</code> 선언은 <code>namespace</code> 와 병합 할 수 없으므로 ).
ru: Одним из преимуществ этого является то, что шаблон вызываемого конструктора может быть легко выражен, а также позволяет пространствам имен объединяться с этими объявлениями (поскольку объявления <code>var</code> не могут объединяться с <code>namespace</code> s).
zh_cn: 这样做的一个优点是，可调用的构造函数模式很容易表达，同时还允许名称空间与这些声明合并（因为 <code>var</code> 声明不能与 <code>namespace</code> 合并）。

source: One common task is to take an existing type and make each of its properties entirely optional. Let&rsquo;s say we have a <code>Person</code>:
es: Una tarea com&uacute;n es tomar un tipo existente y hacer que cada una de sus propiedades sea completamente opcional. Digamos que tenemos una <code>Person</code> a :
ko: 한 가지 일반적인 작업은 기존 유형을 사용하여 각 속성을 완전히 선택적으로 만드는 것입니다. <code>Person</code> 이 있다고 가정 해 봅시다 .
ru: Одна из распространенных задач - взять существующий тип и сделать каждое из его свойств совершенно необязательным. Допустим, у нас есть <code>Person</code> :
zh_cn: 一项常见的任务是采用一个现有的类型并使它的每个属性完全可选。假设我们有一个 <code>Person</code> ：
