Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/typescript/typescript.*.003.xlf
Languages: es, ko, ru, zh_cn

source: The <code>ThisType&lt;T&gt;</code> marker interface is simply an empty interface declared in <code>lib.d.ts</code>. Beyond being recognized in the contextual type of an object literal, the interface acts like any empty interface.
ru: <code>ThisType&lt;T&gt;</code> интерфейс маркера есть просто пустой интерфейс объявлен в <code>lib.d.ts</code> . Интерфейс не только распознается в контекстном типе литерала объекта, но и действует как любой пустой интерфейс.
zh_cn: 所述 <code>ThisType&lt;T&gt;</code> 标记接口简单地声明在一个空的接口 <code>lib.d.ts</code> 。除了在对象文字的上下文类型中识别外，该接口的作用类似于任何空接口。

source: The <code>amd-dependency</code> directive can also have an optional <code>name</code> property; this allows passing an optional name for an amd-dependency:
ru: <code>amd-dependency</code> директива может также иметь дополнительное <code>name</code> свойства; это позволяет передать необязательное имя для amd-зависимости:
zh_cn: 在 <code>amd-dependency</code> 指令也可以有一个可选的 <code>name</code> 属性; 这允许为amd依赖项传递可选名称：

source: The <code>amd-module</code> directive allows passing an optional module name to the compiler:
ru: <code>amd-module</code> директива позволяет передавая имя дополнительного модуля для компилятора:
zh_cn: 在 <code>amd-module</code> 指令允许通过一个可选的模块名称编译器：

source: The <code>any</code> type is a powerful way to work with existing JavaScript, allowing you to gradually opt-in and opt-out of type checking during compilation. You might expect <code>Object</code> to play a similar role, as it does in other languages. However, variables of type <code>Object</code> only allow you to assign any value to them. You can&rsquo;t call arbitrary methods on them, even ones that actually exist:
ru: Тип <code>any</code> - это мощный способ работы с существующим JavaScript, позволяющий постепенно включать и отключать проверку типов во время компиляции. Вы можете ожидать, что <code>Object</code> будет играть ту же роль, что и на других языках. Однако переменные типа <code>Object</code> позволяют только присвоить им любое значение. Вы не можете вызывать для них произвольные методы, даже те, которые действительно существуют:
zh_cn: 在 <code>any</code> 类型是一个功能强大的方式与现有的JavaScript，让你的工作，逐步选择进入和编译过程中退出的类型检查。您可能希望 <code>Object</code> 像其他语言一样扮演相似的角色。但是， <code>Object</code> 类型的变量仅允许您为其分配任何值。您不能在它们上调用任意方法，即使是实际存在的方法也是如此：

source: The <code>any</code> type is also handy if you know some part of the type, but perhaps not all of it. For example, you may have an array but the array has a mix of different types:
ru: Тип <code>any</code> также удобен, если вы знаете какую-то часть типа, но, возможно, не всю его. Например, у вас может быть массив, но он имеет смесь разных типов:
zh_cn: 在 <code>any</code> 你知道类型的某些部分，但也许不是全部类型也是得心应手。例如，您可能有一个数组，但是该数组混合了不同的类型：

source: The <code>as</code> operator
ru: <code>as</code> оператор
zh_cn: 在 <code>as</code> 运营商

source: The <code>as</code> operator is available in both <code>.ts</code> and <code>.tsx</code> files, and is identical in behavior to the angle-bracket type assertion style.
ru: <code>as</code> оператор доступен в обоих <code>.ts</code> и <code>.tsx</code> файлов, и идентичен по поведению на угол скобки стиля утверждение типа.
zh_cn: 的 <code>as</code> 操作者在两个可用 <code>.ts</code> 和 <code>.tsx</code> 文件，并且是在行为的尖括号型断言样式相同。

source: The <code>exclude</code> list does not support wilcards. It must simply be a list of files and/or directories.
ru: Список <code>exclude</code> не поддерживает символы Wilcards. Это должен быть просто список файлов и / или каталогов.
zh_cn: 在 <code>exclude</code> 列表不wilcards支持。它必须只是文件和/或目录的列表。

source: The <code>export =</code> syntax specifies a single object that is exported from the module. This can be a class, interface, namespace, function, or enum.
ru: <code>export =</code> синтаксис определяет один объект , который экспортируется из модуля. Это может быть класс, интерфейс, пространство имен, функция или перечисление.
zh_cn: 所述 <code>export =</code> 语法指定从模块导出的单个对象。这可以是类，接口，名称空间，函数或枚举。

source: The <code>extends</code> clause of a class previously required a type reference to be specified. It now accepts an expression optionally followed by a type argument list. The type of the expression must be a constructor function type with at least one construct signature that has the same number of type parameters as the number of type arguments specified in the <code>extends</code> clause. The return type of the matching construct signature(s) is the base type from which the class instance type inherits. Effectively, this allows both real classes and &ldquo;class-like&rdquo; expressions to be specified in the <code>extends</code> clause.
ru: Предложение <code>extends</code> класса ранее требовало указания ссылки на тип. Теперь он принимает выражение, за которым может следовать список аргументов типа. Тип выражения должен быть типом функции конструктора с по крайней мере одной сигнатурой конструкции, которая имеет такое же количество параметров типа, что и количество аргументов типа, указанных в предложении <code>extends</code> . Тип возвращаемого значения соответствующей сигнатуры конструкции - это базовый тип, от которого наследуется тип экземпляра класса. По сути, это позволяет указывать как реальные классы, так и выражения, подобные классам, в предложении <code>extends</code> .
zh_cn: 类的 <code>extends</code> 子句以前需要指定类型引用。现在，它接受一个表达式，并可以选择后面跟一个类型参数列表。表达式的类型必须是具有至少一个构造签名的构造函数功能类型，该构造签名的类型参数数量应与 <code>extends</code> 子句中指定的类型参数数量相同。匹配构造签名的返回类型是类实例类型从其继承的基本类型。有效地，这允许在 <code>extends</code> 子句中同时指定实类和&ldquo;类类&rdquo;表达式。

source: The <code>extends</code> is a top-level property in <code>tsconfig.json</code> (alongside <code>compilerOptions</code>, <code>files</code>, <code>include</code>, and <code>exclude</code>). <code>extends</code>&rsquo; value is a string containing a path to another configuration file to inherit from. The path may use Node.js style resolution.
ru: <code>extends</code> является топ-уровня собственности в <code>tsconfig.json</code> (наряду с <code>compilerOptions</code> , <code>files</code> , <code>include</code> , и <code>exclude</code> ). <code>extends</code> 'value - это строка, содержащая путь к другому файлу конфигурации, от которого требуется наследовать. Путь может использовать разрешение стиля Node.js.
zh_cn: 该 <code>extends</code> 是一个顶级物业 <code>tsconfig.json</code> （旁边 <code>compilerOptions</code> ， <code>files</code> ， <code>include</code> 和 <code>exclude</code> ）。 <code>extends</code> 是一个字符串，其中包含要继承的另一个配置文件的路径。该路径可以使用Node.js样式解析。

source: The <code>for-await-of</code> Statement
ru: <code>for-await-of</code> Заявлении
zh_cn: 该 <code>for-await-of</code> 声明

source: The <code>for..await..of</code> statement is only legal within an Async Function or Async Generator.
ru: Оператор <code>for..await..of</code> разрешен только в рамках асинхронной функции или асинхронного генератора.
zh_cn: 该 <code>for..await..of</code> 声明仅仅是一个异步函数或异步发电机中是合法的。

source: The <code>getWidget</code> function accepts a number and returns a Widget, or accepts a string and returns a Widget array.
ru: Функция <code>getWidget</code> принимает число и возвращает виджет или принимает строку и возвращает массив виджетов.
zh_cn: 所述 <code>getWidget</code> 函数接受号码，并返回一个窗口小部件，或者接受一个字符串并返回一个Widget阵列。

source: The <code>greeter</code> object can log to a file or display an alert. You can provide LogOptions to <code>.log(...)</code> and alert options to <code>.alert(...)</code>
ru: Объект <code>greeter</code> может войти в файл или отобразить предупреждение. Вы можете предоставить LogOptions для <code>.log(...)</code> и параметры предупреждений для <code>.alert(...)</code>
zh_cn: 在 <code>greeter</code> 对象可以登录到一个文件或显示警告。您可以向 <code>.log(...)</code> 提供LogOptions，并向 <code>.alert(...)</code> 提供警报选项

source: The <code>in</code> operator now acts as a narrowing expression for types.
ru: Оператор <code>in</code> теперь действует как сужающее выражение для типов.
zh_cn: 的 <code>in</code> 操作者现在充当类型变窄表达。

source: The <code>length</code> property of a tuple type with optional elements is a union of numeric literal types representing the possible lengths. For example, the type of the <code>length</code> property in the tuple type <code>[number, string?, boolean?]</code> is <code>1 | 2 | 3</code>.
ru: Свойство <code>length</code> кортежа с необязательными элементами представляет собой объединение числовых литералов, представляющих возможные длины. Например, тип <code>length</code> собственности в типе кортежа <code>[number, string?, boolean?]</code> является <code>1 | 2 | 3</code> .
zh_cn: 具有可选元素的元组类型的 <code>length</code> 属性是表示可能长度的数字文字类型的并集。例如，元组类型 <code>[number, string?, boolean?]</code> 中的 <code>length</code> 属性的类型为 <code>1 | 2 | 3</code> 2 | 3。

source: The <code>never</code> type
ru: <code>never</code> типа
zh_cn: 在 <code>never</code> 型

source: The <code>never</code> type has the following characteristics:
ru: Тип <code>never</code> имеет следующие характеристики:
zh_cn: 该 <code>never</code> 类型有以下几个特点：

source: The <code>never</code> type is a subtype of, and assignable to, every type; however, <em>no</em> type is a subtype of, or assignable to, <code>never</code> (except <code>never</code> itself). Even <code>any</code> isn&rsquo;t assignable to <code>never</code>.
ru: Тип <code>never</code> является подтипом любого типа и может быть назначен ему; однако, <em>не</em> типа не является подтипом, или присваиваемый, <code>never</code> ( за исключением <code>never</code> себя). Даже <code>any</code> не может быть назначен <code>never</code> .
zh_cn: 在 <code>never</code> 类型是其子类型，分配给，每一种类型; 但是，<em>任何</em>类型都不是 <code>never</code> （ <code>never</code> 不会除外）的子类型或可分配给它的子类型。甚至 <code>any</code> 都不能分配给 <code>never</code> 。

source: The <code>never</code> type represents the type of values that never occur. For instance, <code>never</code> is the return type for a function expression or an arrow function expression that always throws an exception or one that never returns; Variables also acquire the type <code>never</code> when narrowed by any type guards that can never be true.
ru: Тип <code>never</code> представляет собой тип значений, которые никогда не встречаются. Например, <code>never</code> является типом возвращаемого значения для выражения функции или выражения функции стрелки, которое всегда вызывает исключение или которое никогда не возвращает; Переменные также приобретают тип <code>never</code> когда сужаются какими-либо защитниками типа, которые никогда не могут быть истинными.
zh_cn: 该 <code>never</code> 类型表示值是不会发生的类型。例如， <code>never</code> 抛出异常的函数表达式或箭头函数表达式的返回类型，或者永远不会返回异常的箭头函数表达式；变量也 <code>never</code> 被任何永远不可能为真的类型防护所缩小，从而获得类型。

source: The <code>new.target</code> meta-property is new syntax introduced in ES2015. When an instance of a constructor is created via <code>new</code>, the value of <code>new.target</code> is set to be a reference to the constructor function initially used to allocate the instance. If a function is called rather than constructed via <code>new</code>, <code>new.target</code> is set to <code>undefined</code>.
ru: <code>new.target</code> мета-свойство новый синтаксис введен в ES2015. Когда экземпляр конструктора создается с помощью <code>new</code> , значение <code>new.target</code> устанавливается как ссылка на функцию конструктора, изначально использовавшуюся для выделения экземпляра. Если функция вызывается, а не <code>new.target</code> через <code>new</code> , для new.target устанавливается значение <code>undefined</code> .
zh_cn: 该 <code>new.target</code> 元属性是ES2015引入了新的语法。通过 <code>new</code> 创建构造函数的实例时，将 <code>new.target</code> 的值设置为对最初用于分配实例的构造函数的引用。如果调用一个函数而不是通过 <code>new</code> 构造函数， <code>new.target</code> 设置为 <code>undefined</code> 。

source: The <code>null</code> and <code>undefined</code> types are <em>not</em> widened to <code>any</code> in strict null checking mode.
ru: В <code>null</code> и <code>undefined</code> типах <em>не</em> расширены до <code>any</code> в строгом режиме проверки нулевой.
zh_cn: 在严格的null检查模式下， <code>null</code> 和 <code>undefined</code> 类型<em>不会</em>扩展为 <code>any</code> 类型。

source: The <code>null</code> elimination is pretty obvious here, but you can use terser operators too:
ru: <code>null</code> ликвидация является довольно очевидно, но вы можете использовать terser операторы тоже:
zh_cn: 该 <code>null</code> 淘汰是很明显的在这里，但你可以用更简洁运营商太：

source: The <code>path</code> property of each reference can point to a directory containing a <code>tsconfig.json</code> file, or to the config file itself (which may have any name).
ru: Свойство <code>path</code> каждой ссылки может указывать на каталог, содержащий файл <code>tsconfig.json</code> , или на сам файл конфигурации (который может иметь любое имя).
zh_cn: 每个引用的 <code>path</code> 属性都可以指向包含 <code>tsconfig.json</code> 文件的目录，也可以指向配置文件本身（可以具有任何名称）。

source: The <code>preserve</code> mode will keep JSX expressions as part of the output to be further consumed by another transform step. <em>Additionally the output will have a <code>.jsx</code> file extension.</em>
ru: <code>preserve</code> режим будет держать выражения JSX как часть продукции будет дополнительно потребляться другим преобразование шага. <em>Кроме того, файл будет иметь расширение <code>.jsx</code> .</em>
zh_cn: 的 <code>preserve</code> 模式将使JSX表达式作为输出的一部分由另一变换步骤被进一步消耗。<em>此外，输出将具有 <code>.jsx</code> 文件扩展名。</em>

source: The <code>protected</code> modifier acts much like the <code>private</code> modifier with the exception that members declared <code>protected</code> can also be accessed within deriving classes. For example,
ru: <code>protected</code> модификатор действует так же, как <code>private</code> модификатор с тем исключением , что члены объявляются <code>protected</code> можно также получить в вытекающих классах. Например,
zh_cn: 该 <code>protected</code> 修饰符的作用很像 <code>private</code> 所不同的是议员申报修改 <code>protected</code> ，也可以派生类中访问。例如，

source: The <code>react</code> mode will emit <code>React.createElement</code>, does not need to go through a JSX transformation before use, and the output will have a <code>.js</code> file extension.
ru: В режиме <code>react</code> будет <code>React.createElement</code> , не нужно выполнять преобразование JSX перед использованием, а выходные данные будут иметь расширение файла <code>.js</code> .
zh_cn: 该 <code>react</code> 模式会发出 <code>React.createElement</code> ，并不需要在使用前要经过JSX变换，输出将有一个 <code>.js</code> 文件扩展名。

source: The <code>ref</code> and <code>key</code> properties will appear with correct types on all components
ru: В <code>ref</code> и <code>key</code> свойства будут отображаться с правильными типами по всем компонентам
zh_cn: 在 <code>ref</code> 和 <code>key</code> 性能会出现正确的类型上的所有组件

source: The <code>ref</code> property is correctly disallowed on instances of Stateless Function components
ru: Свойство <code>ref</code> правильно запрещено в экземплярах компонентов функции без сохранения состояния.
zh_cn: 无状态功能组件的实例正确禁止使用 <code>ref</code> 属性

source: The <code>rootDir</code> setting, if not explicitly set, defaults to the directory containing the <code>tsconfig</code> file
ru: Параметр <code>rootDir</code> , если не установлен явно, по умолчанию соответствует каталогу, содержащему файл <code>tsconfig</code> .
zh_cn: 该 <code>rootDir</code> 设置，如果没有明确设置，默认为包含的目录 <code>tsconfig</code> 文件

source: The <code>target</code> option (allowing users to switch out of <code>es5</code> to <code>es3</code>, <code>es2015</code>, <code>esnext</code>, etc.)
ru: <code>target</code> параметр (позволяя пользователям переключаться из <code>es5</code> к <code>es3</code> , <code>es2015</code> , <code>esnext</code> и т.д.)
zh_cn: 的 <code>target</code> 选项（允许用户的切换出来 <code>es5</code> 到 <code>es3</code> ， <code>es2015</code> ， <code>esnext</code> 等）

source: The <code>this</code> type is also useful with intersection types in describing libraries (e.g. Ember.js) that use mixin-style patterns to describe inheritance:
ru: <code>this</code> тип также полезно с типами пересечений в описании библиотек (например , ember.js) , что паттерны использования Mixin стиля для описания наследования:
zh_cn: 在 <code>this</code> 类型也与在描述库交叉点类型（例如Ember.js）的在使用混入风格模式来描述继承有用：

source: The <code>useDefineForClassFields</code> Flag and The <code>declare</code> Property Modifier
ru: <code>useDefineForClassFields</code> Флаг и <code>declare</code> Модификатор недвижимости
zh_cn: 该 <code>useDefineForClassFields</code> 标志和 <code>declare</code> 属性修改器

source: The <em>Property Descriptor</em> for the member.
ru: <em>Descriptor недвижимости</em> для члена.
zh_cn: 成员的<em>属性描述符</em>。

source: The <em>nullish coalescing operator</em> is another upcoming ECMAScript feature that goes hand-in-hand with optional chaining, and which our team has been involved with championing in TC39.
ru: Оператор <em>объединения с нулевым значением</em> - это еще одна предстоящая функция ECMAScript, которая идет рука об руку с необязательной цепочкой, и наша команда участвовала в продвижении в TC39.
zh_cn: 该<em>nullish合并运算符</em>是另一个即将到来的ECMAScript的功能，去手牵手与可选的链接，以及我们的团队已经参与与TC39倡导。

source: The Async Iteration introduces an <code>AsyncIterator</code>, which is similar to <code>Iterator</code>. The difference lies in the fact that the <code>next</code>, <code>return</code>, and <code>throw</code> methods of an <code>AsyncIterator</code> return a <code>Promise</code> for the iteration result, rather than the result itself. This allows the caller to enlist in an asynchronous notification for the time at which the <code>AsyncIterator</code> has advanced to the point of yielding a value. An <code>AsyncIterator</code> has the following shape:
ru: Async Iteration представляет <code>AsyncIterator</code> , который похож на <code>Iterator</code> . Разница заключается в том, что методы <code>next</code> , <code>return</code> и <code>throw</code> объекта <code>AsyncIterator</code> возвращают <code>Promise</code> для результата итерации, а не самого результата. Это позволяет вызывающему абоненту присоединиться к асинхронному уведомлению на время, когда <code>AsyncIterator</code> продвинулся до точки получения значения. <code>AsyncIterator</code> имеет следующую форму:
zh_cn: 异步迭代引入了 <code>AsyncIterator</code> ，它类似于 <code>Iterator</code> 。区别在于， <code>AsyncIterator</code> 的 <code>next</code> ， <code>return</code> 和 <code>throw</code> 方法返回迭代结果的 <code>Promise</code> ，而不是结果本身。这使调用者可以在 <code>AsyncIterator</code> 前进到产生值的时间登记异步通知。一个 <code>AsyncIterator</code> 具有以下形态：

source: The Examples
ru: Примеры
zh_cn: 例子

source: The Impact of ES6 on Module Call Signatures
ru: Воздействие ES6 на позывные сигнатуры модулей
zh_cn: ES6对模块调用签名的影响

source: The Impact of ES6 on Module Plugins
ru: Воздействие ES6 на модульные плагины
zh_cn: ES6对模块插件的影响

source: The Iterator protocol also defines the target of some of the ES2015 features like <code>for..of</code> and spread operator and the array rest in destructuring assignmnets.
ru: Протокол Iterator также определяет цель некоторых функций ES2015, таких как <code>for..of</code> и оператор распространения, а также остаток массива при деструктуризации assignmnets.
zh_cn: Iterator协议还定义了ES2015某些功能的目标，例如 <code>for..of</code> 和spread运算符，而数组则位于解构assignmnet中。

source: The JSX result type
ru: Тип результата JSX
zh_cn: JSX结果类型

source: The TypeScript compiler has a set of additional flags to <em>inform</em> the compiler of transformations that are expected to happen to the sources to generate the final output.
ru: Компилятор TypeScript имеет набор дополнительных флагов для <em>информирования</em> компилятора о преобразованиях, которые, как ожидается, произойдут с источниками для генерации окончательного вывода.
zh_cn: TypeScript编译器具有一组附加标志，用于将预期发生在源上的转换<em>通知</em>编译器以生成最终输出。

source: The TypeScript compiler supports the declaration of such mappings using <code>"paths"</code> property in <code>tsconfig.json</code> files.
ru: Компилятор TypeScript поддерживает объявление таких сопоставлений с помощью свойства <code>"paths"</code> в файлах <code>tsconfig.json</code> .
zh_cn: TypeScript编译器支持使用 <code>tsconfig.json</code> 文件中的 <code>"paths"</code> 属性声明此类映射。

source: The TypeScript compiler supports the declaration of such mappings using <code>"paths"</code> property in <code>tsconfig.json</code> files. Here is an example for how to specify the <code>"paths"</code> property for <code>jquery</code>.
ru: Компилятор TypeScript поддерживает объявление таких сопоставлений с помощью свойства <code>"paths"</code> в файлах <code>tsconfig.json</code> . Вот пример того, как указать свойство <code>"paths"</code> для <code>jquery</code> .
zh_cn: TypeScript编译器支持使用 <code>tsconfig.json</code> 文件中的 <code>"paths"</code> 属性声明此类映射。这是有关如何为 <code>jquery</code> 指定 <code>"paths"</code> 属性的示例。

source: The TypeScript compiler will inject design-time type information using the <code>@Reflect.metadata</code> decorator. You could consider it the equivalent of the following TypeScript:
ru: Компилятор TypeScript будет вводить информацию о типе во время разработки с <code>@Reflect.metadata</code> декоратора @ Reflect.metadata . Вы можете считать его эквивалентом следующего TypeScript:
zh_cn: TypeScript编译器将使用 <code>@Reflect.metadata</code> 装饰器注入设计时类型信息。您可以认为它等同于以下TypeScript：

source: The TypeScript compiler will transpile for..of arrays to idiomatic ES3/ES5 JavaScript when targeting those versions:
ru: Компилятор TypeScript будет передавать для...массивов идиоматический JavaScript ES3/ES5 при нацеливании на эти версии:
zh_cn: TypeScript编译器在针对ES3/ES5 JavaScript的版本时,会将...的数组移植到这些版本中。

source: The TypeScript playground has received a much-needed refresh with handy new functionality! The new playground is largely a fork of <a href="https://github.com/agentcooper">Artem Tyurin</a>&rsquo;s <a href="https://github.com/agentcooper/typescript-play">TypeScript playground</a> which community members have been using more and more. We owe Artem a big thanks for helping out here!
ru: Игровая площадка TypeScript получила столь необходимое обновление с новыми удобными функциями! Новая детская площадка в основном форк <a href="https://github.com/agentcooper">Артем Тюрин</a> &laquo;s <a href="https://github.com/agentcooper/typescript-play">машинопись площадка</a> членов сообщества которые уже используют все больше и больше. Огромное спасибо Артему за помощь!
zh_cn: TypeScript运动场已经获得了急需的更新，其中包括便捷的新功能！新的游乐场很大程度上是<a href="https://github.com/agentcooper">Artem Tyurin</a>的<a href="https://github.com/agentcooper/typescript-play">TypeScript游乐场</a>的分支，社区成员越来越多地使用它。非常感谢Artem在这里的帮助！

source: The TypeSript compiler emits a few helpers like <code>__extends</code> when needed. The helpers are emitted in every file they are referenced in. If you want to consolidate all helpers in one place, or override the default behavior, use <code>--noEmitHelpers</code> to instructs the compiler not to emit them.
ru: Компилятор <code>__extends</code> при необходимости генерирует несколько помощников, например __extends . Помощники генерируются в каждом файле, в котором они упоминаются. Если вы хотите объединить все помощники в одном месте или переопределить поведение по умолчанию, используйте <code>--noEmitHelpers</code> , чтобы указать компилятору не создавать их.
zh_cn: TypeSript编译器在需要时会发出一些辅助 <code>__extends</code> ，如__extends。这些辅助程序会在引用它们的每个文件中发出。如果要将所有辅助程序合并到一个位置，或者要覆盖默认行为，请使用 <code>--noEmitHelpers</code> 指示编译器不要发出它们。

source: The above code will result in an error since you cannot divide a string by a number. The output, when using the <code>preserve</code> option, looks like:
ru: Приведенный выше код приведет к ошибке, поскольку вы не можете разделить строку на число. Вывод при использовании параметра <code>preserve</code> выглядит так:
zh_cn: 上面的代码将导致错误，因为您无法将字符串除以数字。使用 <code>preserve</code> 选项时，输出如下所示：
