Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/typescript/typescript.*.003.xlf
Languages: es, ko, ru, zh_cn

source: Put a breakpoint on the line with return.
es: Ponga un punto de ruptura en la línea con retorno.
ko: 리턴 라인에 중단 점을 두십시오.
ru: Поставьте точку останова на линии с возвратом.
zh_cn: 把断点放在有回车的线路上。

source: Putting all of the above rules together in an example
es: Poniendo todas las reglas anteriores juntas en un ejemplo
ko: 위의 모든 규칙을 예제로 정리
ru: Сводя все вышеперечисленные правила в один пример.
zh_cn: 在一个例子中把上述所有规则整合在一起。

source: Putting it all together
es: Poniendo todo junto
ko: 함께 모아서
ru: Складывая все вместе
zh_cn: 把它整合在一起

source: Raise error on <code>this</code> expressions with an implied <code>any</code> type.
es: Genere un error en <code>this</code> expresiones con <code>any</code> tipo impl&iacute;cito .
ko: 내재 된 <code>any</code> 유형 <code>this</code> 표현식에서 오류를 발생시킵니다 .
ru: Поднимите ошибку в <code>this</code> выражении с подразумеваемым <code>any</code> типом.
zh_cn: 使用隐式 <code>any</code> 类型引发 <code>this</code> 表达式上的错误。

source: Raise error on expressions and declarations with an implied <code>any</code> type.
es: Genera error en expresiones y declaraciones con <code>any</code> tipo impl&iacute;cito .
ko: 암시적인 <code>any</code> 유형의 표현식 및 선언에서 오류가 발생 합니다.
ru: Вызывать ошибку в выражениях и объявлениях с подразумеваемым типом <code>any</code> .
zh_cn: 在隐式 <code>any</code> 类型的表达式和声明上引发错误。

source: Rather than actually execute a build with the other input options and config files, show the final implied config file in the output.
es: En lugar de ejecutar una construcción con las otras opciones de entrada y los archivos de configuración,mostrar el archivo de configuración final implícito en la salida.
ko: 실제로 다른 입력 옵션 및 구성 파일을 사용하여 빌드를 실행하는 대신 최종 암시 적 구성 파일을 출력에 표시하십시오.
ru: Вместо того,чтобы на самом деле выполнять сборку с другими входными опциями и конфигурационными файлами,покажите конечный подразумеваемый конфигурационный файл в выходных данных.
zh_cn: 与其实际执行一个带有其他输入选项和配置文件的构建,不如在输出中显示最终隐含的配置文件。

source: Re-compiling, you&rsquo;ll now see an error:
es: Al volver a compilar, ver&aacute; un error:
ko: 다시 컴파일하면 이제 오류가 표시됩니다.
ru: При повторной компиляции вы увидите ошибку:
zh_cn: 重新编译后，您将看到一个错误：

source: Re-declarations and Shadowing
es: Re-declaraciones y Sombra
ko: 재 선언 및 그림자
ru: Передекларация и Тень
zh_cn: 重新申报和影子

source: Re-export to extend
es: Reexportación para ampliar
ko: 연장하여 재수출
ru: Реэкспорт на продление
zh_cn: 再出口以延长

source: Re-run <code>tsc greeter.ts</code> and you&rsquo;ll see the generated JavaScript is the same as the earlier code. Classes in TypeScript are just a shorthand for the same prototype-based OO that is frequently used in JavaScript.
es: Vuelva a ejecutar <code>tsc greeter.ts</code> y ver&aacute; que el JavaScript generado es el mismo que el c&oacute;digo anterior. Las clases en TypeScript son solo una abreviatura del mismo OO basado en prototipos que se usa con frecuencia en JavaScript.
ko: <code>tsc greeter.ts</code> 를 다시 실행 하면 생성 된 JavaScript가 이전 코드와 동일 하다는 것을 알 수 있습니다. TypeScript의 클래스는 JavaScript에서 자주 사용되는 것과 동일한 프로토 타입 기반 OO의 약어입니다.
ru: Повторно запустите <code>tsc greeter.ts</code> , и вы увидите, что сгенерированный JavaScript такой же, как и предыдущий код. Классы в TypeScript - это просто сокращение для того же объектно-ориентированного объекта на основе прототипов, который часто используется в JavaScript.
zh_cn: 重新运行 <code>tsc greeter.ts</code> ，您将看到生成的JavaScript与先前的代码相同。TypeScript中的类只是JavaScript中经常使用的基于原型的OO的简写。

source: React &amp; Webpack
es: Reaccionar y Webpack
ko: 반응 및 웹팩
ru: Реагировать и Webpack
zh_cn: React＆Webpack

source: React &amp; Webpack: Add a TypeScript configuration file
es: React &amp; Webpack: agregue un archivo de configuraci&oacute;n de TypeScript
ko: 반응 및 웹팩 : TypeScript 구성 파일 추가
ru: React &amp; Webpack: добавить файл конфигурации TypeScript
zh_cn: React＆Webpack：添加一个TypeScript配置文件

source: React &amp; Webpack: Create a webpack configuration file
es: React &amp; Webpack: crea un archivo de configuraci&oacute;n de paquete web
ko: 반응 및 웹팩 : 웹팩 구성 파일 작성
ru: React &amp; Webpack: создайте файл конфигурации webpack
zh_cn: React＆Webpack：创建一个webpack配置文件

source: React &amp; Webpack: Initialize the project
es: React &amp; Webpack: inicializa el proyecto
ko: 반응 및 웹팩 : 프로젝트 초기화
ru: React &amp; Webpack: инициализировать проект
zh_cn: React＆Webpack：初始化项目

source: React &amp; Webpack: Install our dependencies
es: React &amp; Webpack: Instale nuestras dependencias
ko: React &amp; Webpack : 의존성 설치
ru: React &amp; Webpack: установите наши зависимости
zh_cn: React＆Webpack：安装我们的依赖

source: React &amp; Webpack: Lay out the project
es: React &amp; Webpack: dise&ntilde;e el proyecto
ko: 반응 및 웹팩 : 프로젝트 배치
ru: React &amp; Webpack: макет проекта
zh_cn: React＆Webpack：布置项目

source: React &amp; Webpack: Putting it all together
es: React &amp; Webpack: uniendo todo
ko: 리 액트 및 웹팩 : 모두 통합
ru: React и Webpack: объединяем все вместе
zh_cn: React＆Webpack：整合在一起

source: React &amp; Webpack: Write some code
es: React &amp; Webpack: escribe un c&oacute;digo
ko: 반응 및 웹팩 : 코드 작성
ru: React &amp; Webpack: напишите код
zh_cn: React＆Webpack：编写一些代码

source: React integration
es: Reaccionar la integración
ko: 반응 통합
ru: Реактивная интеграция
zh_cn: React集成

source: React-native build pipeline expects all files to have a <code>.js</code> extensions even if the file contains JSX syntax. The new <code>--jsx</code> value <code>react-native</code> will persevere the JSX syntax in the output file, but give it a <code>.js</code> extension.
es: La canalizaci&oacute;n de compilaci&oacute;n nativa de React espera que todos los archivos tengan una extensi&oacute;n <code>.js</code> incluso si el archivo contiene sintaxis JSX. El nuevo valor <code>--jsx</code> <code>react-native</code> mantendr&aacute; la sintaxis JSX en el archivo de salida, pero le dar&aacute; una extensi&oacute;n <code>.js</code> .
ko: 반응 네이티브 빌드 파이프 라인 은 파일에 JSX 구문이 포함되어 있어도 모든 파일에 <code>.js</code> 확장자 가있을 것으로 예상 합니다. 새로운 <code>--jsx</code> 값 <code>react-native</code> 는 출력 파일에서 JSX 구문을 유지하지만 확장자 는 <code>.js</code> 입니다.
ru: Конвейер сборки React-native ожидает, что все файлы будут иметь расширения <code>.js</code> , даже если файл содержит синтаксис JSX. Новое значение <code>--jsx</code> response <code>react-native</code> сохранит синтаксис JSX в выходном файле, но даст ему расширение <code>.js</code> .
zh_cn: React-native构建管道期望所有文件都具有 <code>.js</code> 扩展名，即使该文件包含JSX语法。新的 <code>--jsx</code> 值 <code>react-native</code> 会坚持使用输出文件中的JSX语法，但是给它一个 <code>.js</code> 扩展名。

source: Read in any files it understands in the <code>src</code> directory (with <code>include</code>).
es: Lea cualquier archivo que comprenda en el directorio <code>src</code> (con <code>include</code> ).
ko: <code>src</code> 디렉토리 에서 이해하는 모든 파일을 읽습니다 ( <code>include</code> 포함 ).
ru: Прочтите любые файлы, которые он понимает, в каталоге <code>src</code> (с <code>include</code> ).
zh_cn: 读入 <code>src</code> 目录中可以理解的任何文件（ <code>include</code> ）。

source: Read-only properties and index signatures
es: Propiedades de sólo lectura y firmas de índices
ko: 읽기 전용 속성 및 인덱스 서명
ru: Свойства и индексные подписи,доступные только для чтения
zh_cn: 只读属性和索引签名

source: Read-only properties may have initializers and may be assigned to in constructors within the same class declaration, but otherwise assignments to read-only properties are disallowed.
es: Las propiedades de sólo lectura pueden tener inicializadores y pueden asignarse en constructores dentro de la misma declaración de clase,pero por lo demás no se permiten las asignaciones a propiedades de sólo lectura.
ko: 읽기 전용 속성에는 이니셜 라이저가있을 수 있으며 동일한 클래스 선언 내의 생성자에 할당 될 수 있지만 그렇지 않으면 읽기 전용 속성에 대한 할당이 허용되지 않습니다.
ru: Свойства,доступные только для чтения,могут иметь инициализаторы и могут быть назначены в конструкторах в пределах одной декларации класса,но в противном случае назначение свойств,доступных только для чтения,запрещено.
zh_cn: 只读属性可以有初始化器,并且可以在同一个类声明中的构造函数中被赋值,但除此之外,不允许赋值给只读属性。

source: Readonly modifier
es: Modificador de sólo lectura
ko: 읽기 전용 수정 자
ru: Модификатор только для чтения
zh_cn: 只读修改器

source: Readonly properties
es: Propiedades de sólo lectura
ko: 읽기 전용 속성
ru: Свойства только для чтения
zh_cn: 只读属性

source: Ready? Take a look:
es: ¿Listo? Echa un vistazo:
ko: 준비된? 구경하다:
ru: Готовы? Взгляни:
zh_cn: 准备好了吗?看看吧

source: Real applications, however, look like <code>Readonly</code> or <code>Partial</code> above. They&rsquo;re based on some existing type, and they transform the properties in some way. That&rsquo;s where <code>keyof</code> and indexed access types come in:
es: Las aplicaciones reales, sin embargo, se ven como <code>Readonly</code> o <code>Partial</code> arriba. Se basan en alg&uacute;n tipo existente y transforman las propiedades de alguna manera. Ah&iacute; es donde <code>keyof</code> en juego los tipos de acceso keyof e indexado:
ko: 그러나 실제 응용 프로그램은 위의 <code>Readonly</code> 또는 <code>Partial</code> 처럼 보입니다 . 기존 유형을 기반으로하며 어떤 방식 으로든 속성을 변환합니다. 여기서 <code>keyof</code> 및 indexed 액세스 유형이 사용됩니다.
ru: Однако настоящие приложения выглядят как " <code>Readonly</code> или " <code>Partial</code> выше. Они основаны на каком-то существующем типе и каким-то образом преобразуют свойства. Вот <code>keyof</code> и пригодятся типы доступа keyof и indexed:
zh_cn: 但是，实际的应用程序看起来像上面的 <code>Readonly</code> 或 <code>Partial</code> 。它们基于某些现有类型，并且以某种方式转换属性。这就是 <code>keyof</code> 和索引访问类型出现的地方：

source: Recall how to write a type assertion:
es: Recuerda cómo escribir una afirmación tipográfica:
ko: 타입 주장을 작성하는 방법을 상기하십시오 :
ru: Вспомните,как написать типовое утверждение:
zh_cn: 回忆一下如何写类型断言。

source: Recall that Node.js looked for a file named <code>moduleB.js</code>, then an applicable <code>package.json</code>, and then for an <code>index.js</code>.
es: Recuerde que Node.js busc&oacute; un archivo llamado <code>moduleB.js</code> , luego un <code>package.json</code> aplicable y luego un <code>index.js</code> .
ko: Node.js는 <code>moduleB.js</code> 라는 파일을 찾은 다음 적용 가능한 <code>package.json</code> 을 찾은 다음 <code>index.js</code> 를찾았습니다 .
ru: Напомним, что Node.js искал файл с именем <code>moduleB.js</code> , затем подходящий <code>package.json</code> , а затем <code>index.js</code> .
zh_cn: 回想一下，Node.js寻找一个名为 <code>moduleB.js</code> 的文件，然后寻找一个适用的 <code>package.json</code> ，然后寻找一个 <code>index.js</code> 。

source: Recall that with our earlier <code>setTimeout</code> example, we ended up needing to use an IIFE to capture the state of a variable for every iteration of the <code>for</code> loop. In effect, what we were doing was creating a new variable environment for our captured variables. That was a bit of a pain, but luckily, you&rsquo;ll never have to do that again in TypeScript.
es: Recuerde que con nuestro ejemplo anterior de <code>setTimeout</code> , terminamos necesitando usar un IIFE para capturar el estado de una variable para cada iteraci&oacute;n del ciclo <code>for</code> . En efecto, lo que est&aacute;bamos haciendo era crear un nuevo entorno de variables para nuestras variables capturadas. Eso fue un poco molesto, pero afortunadamente, nunca tendr&aacute;s que volver a hacer eso en TypeScript.
ko: 이전의 <code>setTimeout</code> 예제에서는 <code>for</code> 루프가 반복 될 때마다 변수의 상태를 캡처하기 위해 IIFE를 사용해야했습니다 . 실제로 우리가하고 있던 일은 캡처 된 변수를위한 새로운 변수 환경을 만드는 것이 었습니다. 그것은 약간의 고통 이었지만 운 좋게도 TypeScript에서 다시는 그렇게 할 필요가 없습니다.
ru: Напомним, что в нашем предыдущем примере с <code>setTimeout</code> нам пришлось использовать IIFE для захвата состояния переменной для каждой итерации цикла <code>for</code> . Фактически, мы создавали новую переменную среду для наших захваченных переменных. Это было немного больно, но, к счастью, вам больше никогда не придется делать это в TypeScript.
zh_cn: 回想一下我们先前的 <code>setTimeout</code> 示例，最终需要使用IIFE来为 <code>for</code> 循环的每次迭代捕获变量的状态。实际上，我们正在做的是为捕获的变量创建一个新的变量环境。这有点痛苦，但是幸运的是，您不必再在TypeScript中再次这样做。

source: Red Flags
es: Banderas rojas
ko: 붉은 깃발
ru: Красные флаги
zh_cn: 红旗

source: Red flags
es: Banderas rojas
ko: 붉은 깃발
ru: Красные флаги
zh_cn: 红旗

source: Redirect output structure to the directory.
es: Redirige la estructura de salida al directorio.
ko: 출력 구조를 디렉토리로 경로 재 지정하십시오.
ru: Перенаправление выходной структуры в каталог.
zh_cn: 将输出结构重定向到该目录。

source: Referenced projects must have the new <code>composite</code> setting enabled. This setting is needed to ensure TypeScript can quickly determine where to find the outputs of the referenced project. Enabling the <code>composite</code> flag changes a few things:
es: Los proyectos referenciados deben tener habilitada la nueva configuraci&oacute;n <code>composite</code> . Esta configuraci&oacute;n es necesaria para garantizar que TypeScript pueda determinar r&aacute;pidamente d&oacute;nde encontrar los resultados del proyecto referenciado. Habilitar la bandera <code>composite</code> cambia algunas cosas:
ko: 참조 된 프로젝트에는 새로운 <code>composite</code> 설정이 활성화되어 있어야합니다 . 이 설정은 TypeScript가 참조 된 프로젝트의 출력을 찾을 위치를 빠르게 결정할 수 있도록하기 위해 필요합니다. <code>composite</code> 플래그를 활성화하면 몇 가지 사항이 변경됩니다.
ru: В ссылочных проектах должен быть включен новый <code>composite</code> параметр. Этот параметр необходим для того, чтобы TypeScript мог быстро определить, где найти выходные данные проекта, на который имеется ссылка. Включение <code>composite</code> флага меняет несколько вещей:
zh_cn: 引用的项目必须启用新的 <code>composite</code> 设置。需要使用此设置，以确保TypeScript可以快速确定在哪里可以找到引用项目的输出。启用 <code>composite</code> 标志会更改一些内容：

source: Referring to objects in the value space as types doesn&rsquo;t work unless the object also creates a type, like a constructor function.
es: Hacer referencia a objetos en el espacio de valores como tipos no funciona a menos que el objeto tambi&eacute;n cree un tipo, como una funci&oacute;n de constructor.
ko: 개체가 생성자 함수와 같은 형식을 만들지 않으면 값 공간의 개체를 형식으로 참조하면 작동하지 않습니다.
ru: Обращение к объектам в пространстве значений как к типам не работает, если объект также не создает тип, например функцию конструктора.
zh_cn: 除非对象也创建类型（如构造函数），否则将值空间中的对象称为类型是行不通的。

source: Relative paths are fairly straightforward. As an example, let&rsquo;s consider a file located at <code>/root/src/moduleA.js</code>, which contains the import <code>var x = require("./moduleB");</code> Node.js resolves that import in the following order:
es: Los caminos relativos son bastante sencillos. Como ejemplo, consideremos un archivo ubicado en <code>/root/src/moduleA.js</code> , que contiene la importaci&oacute;n <code>var x = require("./moduleB");</code> Node.js resuelve esa importaci&oacute;n en el siguiente orden:
ko: 상대 경로는 매우 간단합니다. 예를 들어, <code>/root/src/moduleA.js</code> 에 있는 파일을 고려해 봅시다 . 여기에는 import <code>var x = require("./moduleB");</code> Node.js는 다음 순서로 가져 오기를 해결합니다.
ru: Относительные пути довольно просты. В качестве примера рассмотрим файл, расположенный в <code>/root/src/moduleA.js</code> , который содержит import <code>var x = require("./moduleB");</code> Node.js разрешает этот импорт в следующем порядке:
zh_cn: 相对路径相当简单。例如，让我们考虑一个位于 <code>/root/src/moduleA.js</code> 的文件，其中包含导入 <code>var x = require("./moduleB");</code> Node.js按以下顺序解析该导入：

source: Relative vs. Non-relative module imports
es: Importaciones de módulos relativos vs.no relativos
ko: 상대 대 비 상대 모듈 가져 오기
ru: Относительный и нереляционный импорт модулей
zh_cn: 相对模块与非相对模块的导入比较

source: Relaxing declaration emit visiblity rules
es: Las declaraciones relajadas emiten reglas de visibilidad
ko: 편안한 선언은 가시성 규칙을 방출
ru: Расслабляющие правила декларирования излучают видимость
zh_cn: 放宽声明排放可视性规则。

source: Remember what we mentioned earlier about variable capturing? Every function expression we pass to <code>setTimeout</code> actually refers to the same <code>i</code> from the same scope.
es: &iquest;Recuerda lo que mencionamos anteriormente sobre la captura de variables? Cada expresi&oacute;n de funci&oacute;n que pasamos a <code>setTimeout</code> en realidad se refiere a la misma <code>i</code> del mismo &aacute;mbito.
ko: 변수 캡처에 대해 앞에서 언급 한 것을 기억하십니까? <code>setTimeout</code> 에 전달하는 모든 함수 표현식 은 실제로 동일한 범위에서 동일한 <code>i</code> 를 나타냅니다 .
ru: Помните, что мы упоминали ранее о захвате переменных? Каждое выражение функции, которое мы передаем в <code>setTimeout</code> , фактически относится к одному <code>i</code> тому же i из той же области.
zh_cn: 还记得我们前面提到的有关变量捕获的内容吗？我们传递给 <code>setTimeout</code> 的每个函数表达式实际上都来自同一作用域中的相同 <code>i</code> 。

source: Remove all comments except copy-right header comments beginning with <code>/*!</code>
es: &iexcl;Elimine todos los comentarios, excepto los comentarios de encabezado de copy-right que comienzan con <code>/*!</code>
ko: <code>/*!</code> 시작하는 복사 권한 헤더 주석을 제외한 모든 주석을 제거하십시오 !
ru: Удалите все комментарии, кроме комментариев заголовка с авторским правом, начинающихся с <code>/*!</code>
zh_cn: 删除所有以 <code>/*!</code> 开头的版权标题标题注释以外的注释！

source: Removes the &lsquo;this&rsquo; parameter from a function type.
es: Elimina el par&aacute;metro 'this' de un tipo de funci&oacute;n.
ko: 함수 유형에서 'this'매개 변수를 제거합니다.
ru: Удаляет параметр this из типа функции.
zh_cn: 从函数类型中删除&ldquo; this&rdquo;参数。

source: Replace the contents of the <code>tsconfig.json</code> file with:
es: Reemplace el contenido del archivo <code>tsconfig.json</code> con:
ko: <code>tsconfig.json</code> 파일 의 내용을 다음으로 바꾸십시오 .
ru: Замените содержимое файла <code>tsconfig.json</code> на:
zh_cn: 将 <code>tsconfig.json</code> 文件的内容替换为：

source: Report an error when not all code paths in function return a value.
es: Informar de un error cuando no todas las rutas de código en la función devuelven un valor.
ko: 함수의 모든 코드 경로가 값을 반환하지 않는 경우 오류를보고하십시오.
ru: Сообщить об ошибке,если не все кодовые пути в функции возвращают значение.
zh_cn: 当函数中并非所有代码路径都返回一个值时,报告错误。

source: Report errors for fallthrough cases in switch statement.
es: Informe de errores para los casos de fallos en la declaración del interruptor.
ko: switch 문에 오류 사례에 대한 오류를보고하십시오.
ru: Сообщайте об ошибках для случаев падения в ведомости переключения.
zh_cn: 报告切换语句中的跌穿情况的错误。

source: Report errors in <code>.js</code> files. Use in conjunction with <code>--allowJs</code>.
es: Informar errores en archivos <code>.js</code> . &Uacute;selo junto con <code>--allowJs</code> .
ko: <code>.js</code> 파일의 오류를보고 하십시오. <code>--allowJs</code> 와 함께 사용하십시오 .
ru: Сообщайте об ошибках в файлах <code>.js</code> . Используйте вместе с <code>--allowJs</code> .
zh_cn: 报告 <code>.js</code> 文件中的错误。与 <code>--allowJs</code> 结合使用。

source: Report errors on unused locals.
es: Informar de los errores en los locales no utilizados.
ko: 사용하지 않은 지역의 오류를보고하십시오.
ru: Сообщайте об ошибках на неиспользуемых местных жителях.
zh_cn: 对未使用的本地人报错。

source: Report errors on unused parameters.
es: Informar de los errores en los parámetros no utilizados.
ko: 사용하지 않은 매개 변수에 대한 오류를보고하십시오.
ru: Сообщайте об ошибках по неиспользуемым параметрам.
zh_cn: 报告未使用参数的错误。

source: Report module resolution log messages.
es: Informe de los mensajes de registro de la resolución del módulo.
ko: 모듈 확인 로그 메시지를보고합니다.
ru: Сообщения журнала разрешения модуля отчетов.
zh_cn: 报告模块解析日志信息。

source: Required type parameters must not follow optional type parameters.
es: Los parámetros de tipo requeridos no deben seguir a los parámetros de tipo opcionales.
ko: 필수 유형 매개 변수는 선택적 유형 매개 변수를 따라야합니다.
ru: Требуемые параметры типа не должны соответствовать дополнительным параметрам типа.
zh_cn: 必需的类型参数不能跟在可选的类型参数后面。

source: Required, optional, and default parameters all have one thing in common: they talk about one parameter at a time. Sometimes, you want to work with multiple parameters as a group, or you may not know how many parameters a function will ultimately take. In JavaScript, you can work with the arguments directly using the <code>arguments</code> variable that is visible inside every function body.
es: Los par&aacute;metros obligatorios, opcionales y predeterminados tienen una cosa en com&uacute;n: hablan de un par&aacute;metro a la vez. A veces, desea trabajar con varios par&aacute;metros como un grupo, o puede que no sepa cu&aacute;ntos par&aacute;metros tomar&aacute; finalmente una funci&oacute;n. En JavaScript, puede trabajar con los argumentos directamente usando la variable de <code>arguments</code> que est&aacute; visible dentro de cada cuerpo de funci&oacute;n.
ko: 필수, 선택적 및 기본 매개 변수는 모두 한 가지 공통점이 있습니다. 한 번에 하나의 매개 변수에 대해 말합니다. 때로는 여러 매개 변수를 그룹으로 사용하거나 함수가 궁극적으로 사용할 매개 변수 수를 모를 수도 있습니다. JavaScript에서는 모든 함수 본문 내에 표시 되는 <code>arguments</code> 변수를 사용하여 직접 인수로 작업 할 수 있습니다 .
ru: Обязательные, необязательные и стандартные параметры имеют одну общую черту: они говорят об одном параметре за раз. Иногда вам нужно работать с несколькими параметрами как группой или вы можете не знать, сколько параметров в конечном итоге примет функция. В JavaScript вы можете работать с аргументами напрямую, используя переменную <code>arguments</code> , которая видна внутри каждого тела функции.
zh_cn: 必需参数，可选参数和默认参数都有一个共同点：它们一次只讨论一个参数。有时，您想将多个参数作为一个组来使用，或者您可能不知道一个函数最终将使用多少个参数。在JavaScript中，您可以直接使用每个函数体内可见的 <code>arguments</code> 变量来处理参数。

source: Resolve <code>keyof</code> to string valued property names only (no numbers or symbols).
es: Resuelva la <code>keyof</code> de solo nombres de propiedades con valores de cadena (sin n&uacute;meros ni s&iacute;mbolos).
ko: <code>keyof</code> 를 문자열 값 속성 이름 (숫자 또는 기호 없음)으로 만 해결 하십시오 .
ru: Разрешить <code>keyof</code> только для имен свойств со строковыми значениями (без цифр или символов).
zh_cn: <code>keyof</code> 将keyof解析为字符串值的属性名称（不包含数字或符号）。

source: Rest Parameters
es: Parámetros de descanso
ko: 나머지 매개 변수
ru: Параметры отдыха
zh_cn: 休息参数

source: Rest elements in tuple types
es: Elementos de descanso en tipos de tupla
ko: 튜플 유형의 나머지 요소
ru: Элементы для отдыха в кортежах
zh_cn: 元组类型中的其余元素

source: Rest elements in tuple types.
es: Elementos de descanso en tipos de tupla.
ko: 튜플 유형의 나머지 요소.
ru: Элементы для отдыха в кортежах.
zh_cn: 在元组类型中休息元素。

source: Rest parameters with tuple types
es: Parámetros de descanso con tipos de tupla
ko: 튜플 유형의 나머지 매개 변수
ru: Параметры покоя с типами кортежей
zh_cn: 带有元组类型的其余参数

source: Results in an output such as:
es: Resulta en una salida como:
ko: 다음과 같은 결과가 나타납니다.
ru: В результате получается такой результат:
zh_cn: 结果是这样的输出:

source: Results in the following generated code:
es: Resulta en el siguiente código generado:
ko: 다음과 같은 코드가 생성됩니다.
ru: В результате получается следующий сгенерированный код:
zh_cn: 结果生成以下代码。

source: Results in:
es: Resultados:
ko: 결과 :
ru: Результаты:
zh_cn: 结果在:

source: Return Types of Callbacks
es: Tipos de devolución de llamadas
ko: 콜백의 반환 유형
ru: Типы обратного вызова
zh_cn: 回调的返回类型

source: Return types as inference targets
es: Los tipos de retorno como objetivos de inferencia
ko: 추론 대상으로 반환 유형
ru: Типы возврата в качестве целей умозаключений
zh_cn: 作为推理目标的返回类型

source: Reusable Types (Interfaces)
es: Tipos reutilizables (Interfaces)
ko: 재사용 가능한 유형 (인터페이스)
ru: Типы многоразового использования (интерфейсы)
zh_cn: 可重复使用类型(接口)

source: Reusable Types (Type Aliases)
es: Tipos reutilizables (alias de tipos)
ko: 재사용 가능한 유형 (유형 별명)
ru: Многоразовые типы (псевдонимы)
zh_cn: 可重复使用类型(类型别名

source: Reverse mappings
es: Mapeo inverso
ko: 역 매핑
ru: Обратные отображения
zh_cn: 反向映射
