Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/typescript/typescript.*.003.xlf
Languages: es, ko, ru, zh_cn

source: It&rsquo;s important to remember that TypeScript uses the same <em>runtime</em> as JavaScript, so any resources about how to accomplish specific runtime behavior (converting a string to a number, displaying an alert, writing a file to disk, etc.) will always apply equally well to TypeScript programs. Don&rsquo;t limit yourself to TypeScript-specific resources!
ko: TypeScript는 JavaScript 와 동일한 <em>런타임</em> 을 사용 하므로 특정 런타임 동작 (문자열을 숫자로 변환, 경고 표시, 디스크에 파일 쓰기 등)을 수행하는 방법에 대한 모든 리소스는 항상 똑같이 잘 적용됩니다. TypeScript 프로그램. TypeScript 관련 리소스에 국한하지 마십시오!

source: It&rsquo;s not uncommon for an API to expect a specific set of strings for certain values. For instance, consider a UI library that can move elements across the screen while controlling the <a href="https://en.wikipedia.org/wiki/Inbetweening">&ldquo;easing&rdquo; of the animation.</a>
es: No es raro que una API espere un conjunto espec&iacute;fico de cadenas para ciertos valores. Por ejemplo, considere una biblioteca de UI que puede mover elementos a trav&eacute;s de la pantalla mientras controla la <a href="https://en.wikipedia.org/wiki/Inbetweening">"suavizaci&oacute;n" de la animaci&oacute;n.</a>
ko: API가 특정 값에 대해 특정 문자열 세트를 기대하는 것은 드문 일이 아닙니다. 예를 들어, <a href="https://en.wikipedia.org/wiki/Inbetweening">애니메이션</a> 의 "여유" 를 제어하면서 화면을 가로 질러 요소를 이동할 수있는 UI 라이브러리를 고려하십시오 .

source: It&rsquo;s possible you really <em>did</em> intend to divide a number by an array, perhaps just to see what happens, but most of the time, though, this is a programming mistake. TypeScript&rsquo;s type checker is designed to allow correct programs through while still catching as many common errors as possible. (Later, we&rsquo;ll learn about settings you can use to configure how strictly TypeScript checks your code.)
ko: 그것은 당신이 정말 가능 <em>않았다</em> 아마 단지 어떻게되는지, 배열에 의해 숫자를 분할하고자하지만, 대부분의 시간,하지만이 프로그래밍 실수입니다. TypeScript의 유형 검사기는 가능한 한 많은 일반적인 오류를 포착하면서 올바른 프로그램을 허용하도록 설계되었습니다. (나중에 TypeScript가 코드를 얼마나 엄격하게 검사하는지 구성하는 데 사용할 수있는 설정에 대해 알아 봅니다.)

source: It&rsquo;s worth noting that <code>files</code>, <code>include</code> and <code>exclude</code> from the inheriting config file <em>overwrite</em> those from the base config file, and that circularity between configuration files is not allowed.
ko: 상속 구성 파일에서 <code>files</code> , <code>include</code> 및 <code>exclude</code> 가 기본 구성 파일의 파일을 <em>덮어</em> 쓰며 구성 파일 간의 순환이 허용되지 않는다는 점에 주목할 가치가 있습니다 .

source: It&rsquo;s worth pointing out that the type checker does not require that these properties come in any sort of order, only that the properties the interface requires are present and have the required type.
es: Vale la pena se&ntilde;alar que el verificador de tipos no requiere que estas propiedades vengan en ning&uacute;n tipo de orden, solo que las propiedades que requiere la interfaz est&eacute;n presentes y tengan el tipo requerido.
ko: 타입 체커는 이러한 속성들이 어떤 종류의 순서로 오도록 요구할 필요는 없으며 인터페이스에 필요한 속성들이 존재하고 필요한 타입을 가질뿐임을 지적 할 가치가있다.

source: Iterators &amp; Generators
es: Iteradores y generadores
ko: 반복자 및 생성기

source: Iterators and Generators
es: Iteradores y generadores
ko: 반복자와 생성기

source: JS Class extensions
ko: JS 클래스 확장

source: JSDoc Property Modifiers
ko: JSDoc 속성 수정 자

source: JSDoc annotated functions are excluded from this rule. Use JSDoc optional parameter syntax (<code>[</code><code>]</code>) to express optionality. e.g.:
ko: JSDoc 주석이 달린 함수는이 규칙에서 제외됩니다. 선택성 을 표현 하려면 JSDoc 선택적 매개 변수 구문 ( <code>[</code> <code>]</code> )을 사용하십시오 . 예 :

source: JSDoc annotated functions are excluded from this rule. Use JSDoc optional parameter syntax to express optionality. e.g.:
es: Las funciones anotadas de JSDoc están excluidas de esta regla.Use la sintaxis de parámetros opcionales de JSDoc para expresar la opcionalidad.Por ejemplo:
ko: JSDoc 어노테이션이있는 기능은이 규칙에서 제외됩니다. JSDoc 선택적 매개 변수 구문을 사용하여 선택 적성을 표현하십시오. 예 :

source: JSDoc annotations adorning a declaration will be used to set the type of that declaration. For example:
es: Las anotaciones del JSDoc que adornan una declaración se usarán para establecer el tipo de esa declaración.Por ejemplo:
ko: 선언을 장식하는 JSDoc 주석은 해당 선언의 유형을 설정하는 데 사용됩니다. 예를 들면 다음과 같습니다.

source: JSDoc annotations come before a declaration will be used to set the type of that declaration. For example:
ko: JSDoc 주석은 선언이 해당 선언의 유형을 설정하는 데 사용되기 전에옵니다. 예를 들면 다음과 같습니다.

source: JSDoc types are used for type information
es: Los tipos JSDoc se usan para la información de tipos
ko: JSDoc 유형은 유형 정보에 사용됩니다.

source: JSX Factory - <code>jsxFactory</code>
ko: JSX 팩토리 <code>jsxFactory</code>

source: JSX allows you to embed expressions between tags by surrounding the expressions with curly braces (<code>{ }</code>).
es: JSX le permite incrustar expresiones entre etiquetas rodeando las expresiones con llaves ( <code>{ }</code> ).
ko: JSX를 사용하면 표현식을 중괄호 ( <code>{ }</code> )로 묶어 태그 사이에 표현식을 포함 할 수 있습니다 .

source: JSX element names and properties are validated against the <code>JSX</code> namespace. Please see the [[JSX]] wiki page for defining the <code>JSX</code> namespace for your framework.
es: Los nombres y propiedades de los elementos JSX se validan con el espacio de nombres <code>JSX</code> . Consulte la p&aacute;gina wiki [[JSX]] para definir el espacio de nombres <code>JSX</code> para su marco.
ko: JSX 요소 이름 및 특성은 <code>JSX</code> 네임 스페이스 에 대해 유효성 검증 됩니다. 프레임 워크에 대한 <code>JSX</code> 네임 스페이스를 정의하려면 [[JSX]] 위키 페이지를 참조하십시오 .

source: JSX elements now allow passing type arguments to generic components.
es: Los elementos JSX permiten ahora pasar argumentos de tipo a los componentes genéricos.
ko: JSX 요소는 이제 형식 인수를 일반 구성 요소에 전달할 수 있습니다.

source: JSX is an embeddable XML-like syntax. It is meant to be transformed into valid JavaScript, but the semantics of that transformation are implementation-specific. JSX came to popularity with the React library but has since seen other applications. TypeScript 1.6 supports embedding, type checking, and optionally compiling JSX directly into JavaScript.
es: JSX es una sintaxis incrustada similar a XML.Está pensada para ser transformada en un JavaScript válido,pero la semántica de esa transformación es específica de la implementación.JSX se hizo popular con la librería React,pero desde entonces ha visto otras aplicaciones.TypeScript 1.6 soporta la incrustación,la verificación de tipos,y opcionalmente la compilación de JSX directamente en JavaScript.
ko: JSX는 임베드 가능한 XML 유사 구문입니다. 유효한 JavaScript로 변환되어야하지만 해당 변환의 의미는 구현에 따라 다릅니다. JSX는 React 라이브러리에서 인기를 얻었지만 이후 다른 응용 프로그램을 보았습니다. TypeScript 1.6은 포함, 유형 검사 및 선택적으로 JSX를 JavaScript로 직접 컴파일 할 수 있습니다.

source: JSX support
es: Soporte JSX
ko: JSX 지원

source: JSX type checking is driven by definitions in a JSX namespace, for instance <code>JSX.Element</code> for the type of a JSX element, and <code>JSX.IntrinsicElements</code> for built-in elements. Before TypeScript 2.8 the <code>JSX</code> namespace was expected to be in the global namespace, and thus only allowing one to be defined in a project. Starting with TypeScript 2.8 the <code>JSX</code> namespace will be looked under the <code>jsxNamespace</code> (e.g. <code>React</code>) allowing for multiple jsx factories in one compilation. For backward compatibility the global <code>JSX</code> namespace is used as a fallback if none was defined on the factory function. Combined with the per-file <code>@jsx</code> pragma, each file can have a different JSX factory.
es: La verificaci&oacute;n de tipo JSX est&aacute; impulsada por definiciones en un espacio de nombres JSX, por ejemplo, <code>JSX.Element</code> para el tipo de un elemento JSX y <code>JSX.IntrinsicElements</code> para elementos integrados. Antes de TypeScript 2.8, se esperaba que el espacio de nombres <code>JSX</code> estuviera en el espacio de nombres global y, por lo tanto, solo permitiera definir uno en un proyecto. A partir de TypeScript 2.8, el espacio de nombres <code>JSX</code> se buscar&aacute; bajo <code>jsxNamespace</code> (por ejemplo, <code>React</code> ), lo que permite m&uacute;ltiples f&aacute;bricas jsx en una compilaci&oacute;n. Para compatibilidad con versiones anteriores, el espacio de nombres <code>JSX</code> global se utiliza como reserva si no se defini&oacute; ninguno en la funci&oacute;n de f&aacute;brica. Combinado con el archivo <code>@jsx</code> pragma, cada archivo puede tener una f&aacute;brica JSX diferente.
ko: JSX 타입 체크는 예를 들면, JSX 정의 네임 스페이스에 의해 구동된다 <code>JSX.Element</code> JSX 요소의 유형 및 <code>JSX.IntrinsicElements</code> 요소 내장한다. TypeScript 2.8 이전에는 <code>JSX</code> 네임 스페이스가 전역 네임 스페이스에 있어야하므로 프로젝트에서 하나만 정의 할 수있었습니다. TypeScript 2.8부터 <code>JSX</code> 네임 스페이스는 <code>jsxNamespace</code> (예 : <code>React</code> ) 아래 에서 한 번의 컴파일로 여러 jsx 팩토리를 허용합니다. 이전 버전과의 호환성을 위해 전역 <code>JSX</code> 네임 스페이스는 팩토리 함수에 정의되지 않은 경우 대체로 사용됩니다. 파일 당 <code>@jsx</code> 와 결합 pragma, 각 파일은 다른 JSX 팩토리를 가질 수 있습니다.

source: JavaScript (also known as ECMAScript) started its life as a simple scripting language for browsers. At the time it was invented, it was expected to be used for short snippets of code embedded in a web page &mdash; writing more than a few dozen lines of code would have been somewhat unusual. Due to this, early web browsers executed such code pretty slowly. Over time, though, JS became more and more popular, and web developers started using it to create interactive experiences.
ko: JavaScript (ECMAScript라고도 함)는 브라우저를위한 간단한 스크립팅 언어로 시작되었습니다. 그것이 발명되었을 때, 웹 페이지에 포함 된 짧은 코드 스 니펫에 사용될 것으로 예상되었습니다. 수십 줄 이상의 코드를 작성하는 것은 다소 이례적이었을 것입니다. 이로 인해 초기 웹 브라우저는 이러한 코드를 매우 느리게 실행했습니다. 하지만 시간이 지남에 따라 JS는 점점 더 인기를 얻었고 웹 개발자는이를 사용하여 대화 형 경험을 만들기 시작했습니다.

source: JavaScript also allows accessing properties which aren&rsquo;t present:
ko: JavaScript는 또한 존재하지 않는 속성에 대한 액세스를 허용합니다.

source: JavaScript defines 8 built-in types:
ko: JavaScript는 8 가지 내장 유형을 정의합니다.

source: JavaScript does have some limited primitives like <code>typeof</code> and <code>instanceof</code>, but remember that these operators are still working on the values as they exist in the type-erased output code. For example, <code>typeof (new Car())</code> will be <code>"object"</code>, not <code>Car</code> or <code>"Car"</code>.
ko: JavaScript에는 <code>typeof</code> 및 <code>instanceof</code> 와 같은 제한된 기본 요소가 있지만 이러한 연산자는 유형이 지워진 출력 코드에 존재하는 값에 대해 여전히 작업하고 있음을 기억하십시오. 예를 들어 <code>typeof (new Car())</code> 는 <code>Car</code> 또는 <code>"Car"</code> 가 아니라 <code>"object"</code> " 입니다.

source: JavaScript has a lot of different module syntaxes or conventions: the one in the ECMAScript standard, the one Node already supports (CommonJS), AMD, System.js, and more! For the most part, TypeScript would default to auto-importing using ECMAScript module syntax, which was often inappropriate in certain TypeScript projects with different compiler settings, or in Node projects with plain JavaScript and <code>require</code> calls.
es: JavaScript tiene muchas sintaxis o convenciones de m&oacute;dulos diferentes: la del est&aacute;ndar ECMAScript, la que Node ya admite (CommonJS), AMD, System.js, &iexcl;y m&aacute;s! En su mayor parte, TypeScript se importar&iacute;a autom&aacute;ticamente de forma predeterminada utilizando la sintaxis del m&oacute;dulo ECMAScript, que a menudo era inapropiado en ciertos proyectos de TypeScript con diferentes configuraciones de compilador, o en proyectos de nodo con JavaScript simple y <code>require</code> llamadas.
ko: JavaScript에는 ECMAScript 표준의 하나, Node가 이미 (CommonJS), AMD, System.js 등을 지원하는 다양한 모듈 구문 또는 규칙이 있습니다! 대부분의 경우 TypeScript는 기본적으로 ECMAScript 모듈 구문을 사용하여 자동 가져 오기로 기본 설정되며, 이는 컴파일러 설정이 다른 특정 TypeScript 프로젝트 또는 일반 JavaScript가있는 노드 프로젝트에서 부적절 <code>require</code> 호출이 필요 합니다.

source: JavaScript has boxed equivalents of primitive types that contain the methods that programmers associate with those types. TypeScript reflects this with, for example, the difference between the primitive type <code>number</code> and the boxed type <code>Number</code>. The boxed types are rarely needed, since their methods return primitives.
ko: JavaScript에는 프로그래머가 해당 유형과 연관시키는 메소드를 포함하는 기본 유형의 박스형 등가물이 있습니다. TypeScript는이를 기본 유형 <code>number</code> 와 박스 유형 <code>Number</code> 간의 차이로 반영합니다 . boxed 형식은 메서드가 기본 형식을 반환하기 때문에 거의 필요하지 않습니다.

source: JavaScript is inherently a very dynamic language. It&rsquo;s not uncommon for a single JavaScript function to return different types of objects based on the shape of the arguments passed in.
es: JavaScript es inherentemente un lenguaje muy din&aacute;mico. No es raro que una sola funci&oacute;n de JavaScript devuelva diferentes tipos de objetos seg&uacute;n la forma de los argumentos pasados.
ko: JavaScript는 본질적으로 매우 역동적 인 언어입니다. 단일 JavaScript 함수가 전달 된 인수의 모양에 따라 다른 유형의 객체를 반환하는 것은 드문 일이 아닙니다.

source: JavaScript projects can use a <code>jsconfig.json</code> file instead, which acts almost the same but has some JavaScript-related compiler flags enabled by default.
ko: JavaScript 프로젝트는 <code>jsconfig.json</code> 파일을 대신 사용할 수 있습니다. jsconfig.json 파일은 거의 동일하게 작동하지만 기본적으로 활성화 된 일부 JavaScript 관련 컴파일러 플래그가 있습니다.

source: JavaScript&rsquo;s equality operator (<code>==</code>) <em>coerces</em> its arguments, leading to unexpected behavior:
ko: 자바 스크립트의 같음 연산자 ( <code>==</code> ) <em>는</em> 인수를 <em>강제</em> 하여 예기치 않은 동작을 유발합니다.

source: JavaScript&rsquo;s modern module syntax is a bit like Haskell&rsquo;s, except that any file with <code>import</code> or <code>export</code> is implicitly a module:
ko: JavaScript의 최신 모듈 구문은 <code>import</code> 또는 <code>export</code> 가 있는 모든 파일 이 암시 적으로 모듈 이라는 점을 제외하면 Haskell과 약간 비슷 합니다.

source: Just as &ldquo;exporting near the top-level&rdquo; reduces friction on your module&rsquo;s consumers, so does introducing a default export. If a module&rsquo;s primary purpose is to house one specific export, then you should consider exporting it as a default export. This makes both importing and actually using the import a little easier. For example:
es: As&iacute; como "exportar cerca del nivel superior" reduce la fricci&oacute;n en los consumidores de su m&oacute;dulo, tambi&eacute;n lo hace la introducci&oacute;n de una exportaci&oacute;n predeterminada. Si el prop&oacute;sito principal de un m&oacute;dulo es albergar una exportaci&oacute;n espec&iacute;fica, entonces deber&iacute;a considerar exportarlo como una exportaci&oacute;n predeterminada. Esto hace que tanto la importaci&oacute;n como el uso real de la importaci&oacute;n sean un poco m&aacute;s f&aacute;ciles. Por ejemplo:
ko: "최상위 수준에 가까운 내보내기"가 모듈 소비자의 마찰을 줄이는 것처럼 기본 내보내기도 도입됩니다. 모듈의 주요 목적이 하나의 특정 내보내기를 저장하는 것이라면 기본 내보내기로 내보내는 것을 고려해야합니다. 이를 통해 가져 오기와 실제로 가져 오기를 조금 더 쉽게 수행 할 수 있습니다. 예를 들면 다음과 같습니다.

source: Just as in JavaScript, functions can refer to variables outside of the function body. When they do so, they&rsquo;re said to <em>capture</em> these variables. While understanding how this works (and the trade-offs when using this technique) is outside of the scope of this article, having a firm understanding how this mechanic works is an important piece of working with JavaScript and TypeScript.
es: Al igual que en JavaScript, las funciones pueden hacer referencia a variables fuera del cuerpo de la funci&oacute;n. Cuando lo hacen, se dice que <em>capturan</em> estas variables. Si bien comprender c&oacute;mo funciona esto (y las compensaciones al usar esta t&eacute;cnica) est&aacute; fuera del alcance de este art&iacute;culo, tener una comprensi&oacute;n firme de c&oacute;mo funciona esta mec&aacute;nica es una parte importante del trabajo con JavaScript y TypeScript.
ko: JavaScript에서와 마찬가지로 함수는 함수 본문 외부의 변수를 참조 할 수 있습니다. 그들이 그렇게 할 때, 그들은 이 변수 들을 <em>포착</em> 한다고 합니다. 이것이 어떻게 작동하는지 (그리고이 기술을 사용할 때의 장단점)을 이해하는 것은이 기사의 범위를 벗어나는 것이지만,이 메커니즘이 어떻게 작동하는지 이해하는 것이 JavaScript 및 TypeScript를 사용하는 중요한 부분입니다.

source: Just as there is a one-to-one correspondence between JS files and modules, TypeScript has a one-to-one correspondence between module source files and their emitted JS files. One effect of this is that it&rsquo;s not possible to concatenate multiple module source files depending on the module system you target. For instance, you can&rsquo;t use the <code>outFile</code> option while targeting <code>commonjs</code> or <code>umd</code>, but with TypeScript 1.8 and later, <a href="https://www.typescriptlang.org/docs/handbook/release-notes/typescript-1-8.html#concatenate-amd-and-system-modules-with---outfile">it&rsquo;s possible</a> to use <code>outFile</code> when targeting <code>amd</code> or <code>system</code>.
ko: JS 파일과 모듈 사이에 일대일 대응이있는 것처럼 TypeScript는 모듈 소스 파일과 생성 된 JS 파일 사이에 일대일 대응이 있습니다. 이로 인한 한 가지 효과는 대상 모듈 시스템에 따라 여러 모듈 소스 파일을 연결할 수 없다는 것입니다. 예를 들어 <code>commonjs</code> 또는 <code>umd</code> 를 대상으로하는 동안 <code>outFile</code> 옵션을 사용할 수 없지만 TypeScript 1.8 이상에서는 <code>amd</code> 또는 <code>system</code> 을 대상으로 할 때 <code>outFile</code> 을 사용할 <a href="https://www.typescriptlang.org/docs/handbook/release-notes/typescript-1-8.html#concatenate-amd-and-system-modules-with---outfile">수 </a>있습니다 .

source: Just as there is a one-to-one correspondence between JS files and modules, TypeScript has a one-to-one correspondence between module source files and their emitted JS files. One effect of this is that it&rsquo;s not possible to concatenate multiple module source files depending on the module system you target. For instance, you can&rsquo;t use the <code>outFile</code> option while targeting <code>commonjs</code> or <code>umd</code>, but with TypeScript 1.8 and later, <a href="release-notes/typescript-1-8#concatenate-amd-and-system-modules-with---outfile">it&rsquo;s possible</a> to use <code>outFile</code> when targeting <code>amd</code> or <code>system</code>.
es: As&iacute; como existe una correspondencia uno a uno entre los archivos JS y los m&oacute;dulos, TypeScript tiene una correspondencia uno a uno entre los archivos fuente del m&oacute;dulo y sus archivos JS emitidos. Un efecto de esto es que no es posible concatenar m&uacute;ltiples archivos fuente de m&oacute;dulo dependiendo del sistema de m&oacute;dulo al que se dirige. Por ejemplo, no puede usar la opci&oacute;n <code>outFile</code> mientras apunta a <code>commonjs</code> o <code>umd</code> , pero con TypeScript 1.8 y <code>outFile</code> posteriores, <a href="release-notes/typescript-1-8#concatenate-amd-and-system-modules-with---outfile">es posible</a> usar outFile cuando apunta a <code>amd</code> o <code>system</code> .
ko: JS 파일과 모듈간에 일대일 대응이있는 것처럼 TypeScript는 모듈 소스 파일과 생성 된 JS 파일간에 일대일 대응이 있습니다. 이것의 한 가지 효과는 대상 모듈 시스템에 따라 여러 개의 모듈 소스 파일을 연결할 수 없다는 것입니다. 예를 들어 <code>commonjs</code> 또는 <code>umd</code> 를 대상으로하는 동안 <code>outFile</code> 옵션을 사용할 수 없지만 TypeScript 1.8 이상에서는 <code>amd</code> 또는 <code>system</code> 을 대상으로 하는 경우 <code>outFile</code> 을 사용할 <a href="release-notes/typescript-1-8#concatenate-amd-and-system-modules-with---outfile">수 </a>있습니다 .

source: Just as with <code>for / of</code>, <code>downlevelIteration</code> will use <code>Symbol.iterator</code> (if present) to more accurately emulate ES 6 behavior.
ko: 단지와 같이 <code>for / of</code> , <code>downlevelIteration</code> 는 사용 <code>Symbol.iterator</code> 더 정확하게 에뮬레이션 ES (6) 행동 (있는 경우)를.

source: Just as with interface, putting the type parameter on the class itself lets us make sure all of the properties of the class are working with the same type.
es: Al igual que con la interfaz,poner el parámetro de tipo en la propia clase nos permite asegurarnos de que todas las propiedades de la clase funcionan con el mismo tipo.
ko: 인터페이스와 마찬가지로 클래스 자체에 type 매개 변수를 지정하면 클래스의 모든 속성이 동일한 유형으로 작동하는지 확인할 수 있습니다.

source: Just like all global namespace pollution, it can be hard to identify component dependencies, especially in a large application.
es: Al igual que toda la contaminación mundial del espacio de nombres,puede ser difícil identificar las dependencias de los componentes,especialmente en una gran aplicación.
ko: 모든 글로벌 네임 스페이스 오염과 마찬가지로, 특히 대규모 응용 프로그램에서 구성 요소 종속성을 식별하기가 어려울 수 있습니다.

source: Just like interfaces, type aliases can also be generic - we can just add type parameters and use them on the right side of the alias declaration:
es: Al igual que las interfaces,los alias de tipo también pueden ser genéricos-podemos simplemente añadir parámetros de tipo y usarlos en el lado derecho de la declaración de alias:
ko: 인터페이스와 마찬가지로 타입 별칭도 일반적 일 수 있습니다. 타입 파라미터를 추가하고 별칭 선언의 오른쪽에서 사용할 수 있습니다 :

source: Just like namespaces, modules can contain both code and declarations. The main difference is that modules <em>declare</em> their dependencies.
es: Al igual que los espacios de nombres, los m&oacute;dulos pueden contener tanto c&oacute;digo como declaraciones. La principal diferencia es que los m&oacute;dulos <em>declaran</em> sus dependencias.
ko: 네임 스페이스와 마찬가지로 모듈에는 코드와 선언이 모두 포함될 수 있습니다. 가장 큰 차이점은 모듈 이 종속성을 <em>선언</em> 한다는 것 입니다.

source: Just like strings, symbols can be used as keys for object properties.
es: Al igual que las cuerdas,los símbolos pueden ser usados como claves para las propiedades de los objetos.
ko: 문자열과 마찬가지로 심볼을 객체 속성의 키로 사용할 수 있습니다.

source: Just run:
es: Sólo corre:
ko: 그냥 실행 :

source: Keep in mind that <code>--strictPropertyInitialization</code> will be turned on along with other <code>--strict</code> mode flags, which can impact your project. You can set the <code>strictPropertyInitialization</code> setting to <code>false</code> in your <code>tsconfig.json</code>&rsquo;s <code>compilerOptions</code>, or <code>--strictPropertyInitialization false</code> on the command line to turn off this checking.
es: Tenga en cuenta que <code>--strictPropertyInitialization</code> se activar&aacute; junto con otros <code>--strict</code> mode, que pueden afectar su proyecto. Puede establecer la configuraci&oacute;n <code>strictPropertyInitialization</code> en <code>false</code> en su <code>tsconfig.json</code> 's <code>compilerOptions</code> , o <code>--strictPropertyInitialization false</code> en la l&iacute;nea de comando para desactivar esta verificaci&oacute;n.
ko: 있다는 사실을 숙지 <code>--strictPropertyInitialization</code> 가 다른과 함께 켜집니다 <code>--strict</code> 의 프로젝트에 영향을 줄 수있는 모드 플래그. 당신은 설정할 수 있습니다 <code>strictPropertyInitialization</code> 의 설정을 <code>false</code> 당신에 <code>tsconfig.json</code> 의 <code>compilerOptions</code> 를 , 또는 <code>--strictPropertyInitialization false</code> 명령 행에서이 검사를 해제합니다.

source: Keep in mind that <code>?.</code> acts differently than those <code>&amp;&amp;</code> operations since <code>&amp;&amp;</code> will act specially on &ldquo;falsy&rdquo; values (e.g. the empty string, <code>0</code>, <code>NaN</code>, and, well, <code>false</code>), but this is an intentional feature of the construct. It doesn&rsquo;t short-circuit on valid data like <code>0</code> or empty strings.
es: &iquest;Ten en cuenta eso <code>?.</code> act&uacute;a de manera diferente a las operaciones <code>&amp;&amp;</code> ya que <code>&amp;&amp;</code> actuar&aacute; especialmente en valores "falsos" (por ejemplo, la cadena vac&iacute;a, <code>0</code> , <code>NaN</code> y, bueno, <code>false</code> ), pero esta es una caracter&iacute;stica intencional de la construcci&oacute;n. No cortocircuita datos v&aacute;lidos como <code>0</code> o cadenas vac&iacute;as.
ko: 명심하십시오 <code>?.</code> <code>&amp;&amp;</code> 는 "falsy"값 (예 : 빈 문자열, <code>0</code> , <code>NaN</code> 및 <code>false</code> ) 에 대해 특수하게 작동하므로 <code>&amp;&amp;</code> 연산 과 다르게 작동 하지만 이는 구성의 의도적 인 기능입니다. <code>0</code> 또는 빈 문자열 과 같은 유효한 데이터를 단락시키지 않습니다 .
