Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/symfony/symfony.*.028.xlf
Languages: ko, ru, zh_cn

source: This interface is meant to facilitate the loading of a User from Doctrine source using a custom method. If you want to implement your own logic of retrieving the user from Doctrine your repository should implement this interface.
zh_cn: 这个接口是为了方便使用自定义方法从Doctrine源加载用户。如果你想实现自己从Doctrine中检索用户的逻辑,你的版本库应该实现这个接口。

source: This interface is the concatenation of UrlMatcherInterface and UrlGeneratorInterface.
zh_cn: 这个接口是UrlMatcherInterface和UrlGeneratorInterface的组合。

source: This interface is useful because the authentication layer can deal with the object through its lifecycle, using the object to get the encoded password (for checking against a submitted password), assigning roles and so on.
zh_cn: 这个接口很有用,因为认证层可以通过对象的生命周期来处理这个对象,使用这个对象来获取编码密码(用于与提交的密码进行核对),分配角色等等。

source: This interface must be implemented by firewall maps.
zh_cn: 这个接口必须由防火墙地图来实现。

source: This interface must be implemented by nodes which can be used as prototypes.
zh_cn: 这个接口必须由可以作为原型的节点实现。

source: This is a directed graph of your services.
zh_cn: 这是你的服务的定向图。

source: This is a general purpose authentication event.
zh_cn: 这是一个通用的认证事件。

source: This is a lazy-loading firewall map implementation.
zh_cn: 这是一个懒加载的防火墙地图实现。

source: This is a proxy method.
zh_cn: 这是一种代理方法。

source: This is a wrapper around the actual firewall configuration which allows us to lazy load the context for one specific firewall only when we need it.
zh_cn: 这是一个围绕实际防火墙配置的包装器,它允许我们只在需要的时候才懒得加载特定防火墙的上下文。

source: This is always the case when used internally.
zh_cn: 在内部使用时总是如此。

source: This is an internal class that must not be used directly.
zh_cn: 这是一个内部类,不能直接使用。

source: This is called after a user has been logged in successfully, and has requested remember-me capabilities. The implementation usually sets a cookie and possibly stores a persistent record of it.
zh_cn: 这是在用户成功登录并请求记住我的功能后调用的。实现时通常会设置一个cookie,并可能存储一个持久的记录。

source: This is called when an anonymous request accesses a resource that requires authentication. The job of this method is to return some response that "helps" the user start into the authentication process.
zh_cn: 当一个匿名请求访问一个需要认证的资源时,就会调用这个方法。这个方法的工作是返回一些响应,"帮助 "用户开始进入认证过程。

source: This is called when an interactive authentication attempt fails. This is called by authentication listeners inheriting from AbstractAuthenticationListener.
zh_cn: 当交互式认证尝试失败时,会调用该函数。该函数被继承自AbstractAuthenticationListener的认证监听器所调用。

source: This is called when an interactive authentication attempt succeeds. This is called by authentication listeners inheriting from AbstractAuthenticationListener.
zh_cn: 当交互式认证尝试成功时,会调用该函数。该函数被继承自AbstractAuthenticationListener的认证监听器所调用。

source: This is equivalent to:
zh_cn: 这相当于:

source: This is identical to run() except that an exception is thrown if the process exits with a non-zero exit code.
zh_cn: 这与run()相同,只是如果进程退出时的退出代码为非零,则会抛出一个异常。

source: This is important if, at any given point, sensitive information like the plain-text password is stored on this object.
zh_cn: 如果在任何一个特定的点上,像纯文本密码这样的敏感信息都存储在这个对象上,这一点就很重要。

source: This is mainly used by the <code>SendMessageMiddleware</code> middleware to identify a message should not be sent if it was just received.
zh_cn: <code>SendMessageMiddleware</code> 中间件主要使用它来标识如果刚刚收到的消息就不应该发送。

source: This is mainly useful for testing purpose.
zh_cn: 这主要用于测试目的。

source: This is mainly useful for the help command.
zh_cn: 这主要是对帮助命令有用。

source: This is mainly useful when a lot of commands extends one main command where some things need to be initialized based on the input arguments and options.
zh_cn: 这主要是在很多命令扩展一个主命令的时候,有些东西需要根据输入参数和选项进行初始化。

source: This is mainly useful when you need to override the Request class to keep BC with an existing system. It should not be used for any other purpose.
zh_cn: 这主要是在你需要覆盖Request类来保持BC与现有系统的关系时有用。它不应该被用于任何其他目的。

source: This is meant to be only an authenticated token, where credentials have already been used and are thus cleared.
zh_cn: 这只意味着是一个经过认证的令牌,凭证已经被使用,因此被清除。

source: This is mostly useful if the configuration of the {@link Options} object is spread across different locations of your code, such as base and sub-classes.
zh_cn: 如果{@link Options}对象的配置分布在你的代码的不同位置,比如基类和子类,那么这个功能就非常有用。

source: This is only to be used for debugging purposes.
zh_cn: 这只用于调试目的。

source: This is similar to getBasePath(), except that it also includes the script filename (e.g. index.php) if one exists.
zh_cn: 这类似于getBasePath(),除了它还包括脚本文件名(例如index.php),如果有的话。

source: This is the case when a user is anonymous and the resource to be displayed has an access role.
zh_cn: 当用户是匿名的,而要显示的资源具有访问角色时,就会出现这种情况。

source: This is the entry class for building a config tree.
zh_cn: 这是构建配置树的入口类。

source: This is the last part in a dot separated string.
zh_cn: 这是一个点分隔字符串的最后一部分。

source: This is the last time the actual contents of the file were last modified.
zh_cn: 这是最后一次修改文件的实际内容的时间。

source: This is the time spent until the beginning of the request handling.
zh_cn: 这是处理请求开始前的时间。

source: This is the time that the file was last accessed, read or written to.
zh_cn: 这是该文件最后一次被访问、读取或写入的时间。

source: This is the time that the inode information was last modified (permissions, owner, group or other metadata).
zh_cn: 这是最后一次修改inode信息的时间(权限、所有者、组或其他元数据)。

source: This is tricky on Windows, because Cygwin, Msys2 etc emulate pseudo terminals via named pipes, so we can only check the environment.
zh_cn: 这在Windows上很棘手,因为Cygwin、Msys2等都是通过命名管道来模拟伪终端的,所以我们只能检查环境。

source: This is used by the ExceptionListener to translate an AccessDeniedException to a Response object.
zh_cn: 这被ExceptionListener用来将AccessDeniedException翻译成Response对象。

source: This is used to provide default translations when they do not exist for the current locale.
zh_cn: 当当前的locale不存在默认翻译时,就用这个来提供默认翻译。

source: This is useful if you wish to write some output while a progress bar is running. Call display() to show the progress bar again.
zh_cn: 如果你想在进度条运行时写一些输出,这很有用。调用display()再次显示进度条。

source: This is useful when you have an indexed array that should be an associative array. You can select an item from within the array to be the key of the particular item. For example, if "id" is the "key", then:
zh_cn: 当你有一个应该是关联数组的索引数组时,这个方法很有用。你可以从数组中选择一个项目作为特定项目的键。例如,如果 "id "是 "key",那么。

source: This item must be serializable for transport.
zh_cn: 本项目必须是可序列化运输的。

source: This list is most restrictive to least restrictive checking.
zh_cn: 这个列表是最限制到最不限制的检查。

source: This loader acts as an array of LoaderInterface objects - each having a chance to load a given resource (handled by the resolver)
zh_cn: 该加载器作为LoaderInterface对象的数组--每个对象都有机会加载给定资源(由解析器处理)。

source: This loader supports the loading of constraints from Symfony's default namespace (see {@link DEFAULT_NAMESPACE}) using the short class names of those constraints. Constraints can also be loaded using their fully qualified class names. At last, namespace aliases can be defined to load constraints with the syntax "alias:ShortName".
zh_cn: 这个加载器支持使用这些约束的短类名从Symfony的默认命名空间(参见{@link DEFAULT_NAMESPACE})加载约束。约束也可以使用它们完全限定的类名来加载。最后,可以定义命名空间别名来加载约束,语法为 "alias:ShortName"。

source: This logic is reused multiple times throughout the processing of a form and needs to be consistent. PHP's keyword <code>empty</code> cannot be used as it also considers 0 and "0" to be empty.
zh_cn: 在整个表单处理过程中，此逻辑会重复使用多次，并且需要保持一致。PHP的关键字 <code>empty</code> 不能使用，因为它也认为0和&ldquo; 0&rdquo;为空。

source: This mapping can be customized with the $verbosityLevelMap constructor parameter.
zh_cn: 这个映射可以通过$verbosityLevelMap构造函数参数来定制。

source: This mapping is used when reading entries and merging them with their fallback locales. If an entry is read for a locale alias (e.g. "mo") that points to a locale with a fallback locale ("ro_MD"), the reader can continue at the correct fallback locale ("ro").
zh_cn: 这个映射在读取条目和合并它们的后备语系时使用。如果一个条目被读到的locale别名(例如 "mo")指向一个有后备locale的locale("ro_MD"),读者可以继续读到正确的后备locale("ro")。

source: This may be only a subset of the defined options.
zh_cn: 这可能只是定义选项的一个子集。

source: This method adjusts the Cache-Control/max-age directive.
zh_cn: 本方法调整Cache-Control/max-age指令。

source: This method adjusts the Cache-Control/s-maxage directive.
zh_cn: 本方法调整Cache-Control/s-maxage指令。

source: This method allows structured namespacing of session attributes.
zh_cn: 该方法允许会话属性的结构化命名。

source: This method also allow you to override an existing format.
zh_cn: 此方法也允许你覆盖现有的格式。

source: This method also allow you to override an existing placeholder.
zh_cn: 此方法也允许你覆盖一个现有的占位符。

source: This method also allows to denormalize data into an existing object if it is present in the context with the object_to_populate. This object is removed from the context before being returned to avoid side effects when recursively normalizing an object graph.
zh_cn: 这个方法也允许将数据去归一化到一个现有的对象中,如果这个对象存在于上下文中的object_to_populate。在返回之前,这个对象会被从上下文中删除,以避免递归归一对象图时产生副作用。

source: This method also re-initializes all properties.
zh_cn: 这个方法也会重新初始化所有属性。

source: This method assumes that the object has a single-column ID.
zh_cn: 本方法假设对象有一个单列ID。

source: This method blocks until all STDIN data is sent to the process then it returns while the process runs in the background.
zh_cn: 这个方法会阻塞,直到所有STDIN数据被发送到进程,然后在进程在后台运行时返回。

source: This method can be overridden to add functionality that is executed for each listener.
zh_cn: 该方法可以被重写,以添加为每个监听器执行的功能。

source: This method can be overwritten in subclasses to clean up the nested constraints passed to the constructor.
zh_cn: 这个方法可以在子类中被重写,以清理传递给构造函数的嵌套约束。

source: This method can read the client IP address from the "X-Forwarded-For" header when trusted proxies were set via "setTrustedProxies()". The "X-Forwarded-For" header value is a comma+space separated list of IP addresses, the left-most being the original client, and each successive proxy that passed the request adding the IP address where it received the request from.
zh_cn: 当通过 "setTrustedProxies()"设置了可信代理时,本方法可以从 "X-Forwarded-For "头中读取客户端的IP地址。"X-Forwarded-For "头值是一个逗号+空格分隔的IP地址列表,最左边的是原始客户端,每一个传递请求的连续代理都会添加收到请求的IP地址。

source: This method can read the client host name from the "X-Forwarded-Host" header when trusted proxies were set via "setTrustedProxies()".
zh_cn: 当通过 "setTrustedProxies()"设置受信任的代理时,该方法可以从 "X-Forwarded-Host "头中读取客户端主机名。

source: This method can read the client port from the "X-Forwarded-Port" header when trusted proxies were set via "setTrustedProxies()".
zh_cn: 当通过 "setTrustedProxies()"设置受信任的代理时,该方法可以从 "X-Forwarded-Port "头读取客户端端口。

source: This method can read the client protocol from the "X-Forwarded-Proto" header when trusted proxies were set via "setTrustedProxies()".
zh_cn: 当通过 "setTrustedProxies()"设置受信任的代理时,该方法可以从 "X-Forwarded-Proto "头读取客户端协议。

source: This method can set both the namespace and the name if you separate them by a colon (:)
zh_cn: 如果用冒号(:)隔开,本方法可以同时设置命名空间和名称。

source: This method can't be used to check if the user included the option when executing the command (use getOption() instead).
zh_cn: 这个方法不能用来检查用户在执行命令时是否包含了选项(用getOption()代替)。

source: This method converts fields with the array notation (like foo[bar] to arrays) like PHP does.
zh_cn: 这个方法像 PHP 一样,将带有数组符号的字段(如 foo[bar]转换为数组)转换为数组。

source: This method converts fields with the array notation (like foo[bar] to arrays) like PHP does. The returned array is consistent with the array for field values (see getPhpValues), rather than uploaded files found in $_FILES. For a compound file field foo[bar] it will create foo[bar][name], instead of foo[name][bar] which would be found in $_FILES.
zh_cn: 这个方法像PHP一样,将字段用数组符号转换(比如foo[bar]转换为数组)。返回的数组与字段值的数组一致(参见 getPhpValues),而不是在 $_FILES 中找到的上传文件。对于复合文件字段foo[bar],它将创建foo[bar][name],而不是在$_FILES中找到的foo[name][bar]。

source: This method created test instances of UploadedFile so that the move() method can be called on those instances.
zh_cn: 这个方法创建了UploadedFile的测试实例,这样就可以在这些实例上调用move()方法。

source: This method detects if errors have been added to the form since the construction of the iterator.
zh_cn: 本方法检测自迭代器构建以来是否有错误被添加到表单中。

source: This method does not give any information about the state of the session object, like whether the session is started or not. It is just a way to check if this Request is associated with a Session instance.
zh_cn: 这个方法不提供任何关于会话对象状态的信息,比如会话是否已经启动。它只是检查这个Request是否与一个Session实例相关联。

source: This method does not mean the quorum <em>would</em> be met for sure, but can be useful to stop a process early when you known there is no chance to meet the quorum.
zh_cn: 此方法并不意味着一定<em>会</em>满足法定人数，但是对于您知道没有机会满足法定人数的情况，可以在尽早停止进程时很有用。

source: This method does two things:
zh_cn: 这个方法有两个作用。

source: This method first tries to find a public getter for each property in the path. The name of the getter must be the camel-cased property name prefixed with "get", "is", or "has".
zh_cn: 这个方法首先尝试为路径中的每个属性找到一个公共getter。getter的名称必须是以 "get"、"is "或 "has "为前缀的驼色属性名称。

source: This method first tries to find a public setter for each property in the path. The name of the setter must be the camel-cased property name prefixed with "set".
zh_cn: 这个方法首先尝试为路径中的每个属性找到一个公共的setter。设置器的名称必须是以 "set "为前缀的驼峰形属性名称。

source: This method fixes the array to look like the "normal" $_FILES array.
zh_cn: 本方法将数组固定为 "正常 "的$_FILES数组。

source: This method gets called for each type in the hierarchy starting from the top most type. Type extensions can further modify the view.
zh_cn: 从最上面的类型开始,层次结构中的每个类型都会调用这个方法。类型扩展可以进一步修改视图。

source: This method implements a constant-time algorithm to compare passwords to avoid (remote) timing attacks.
zh_cn: 该方法实现了一个恒定时间的算法来比较密码,以避免(远程)定时攻击。

source: This method implements a fluent interface.
zh_cn: 这个方法实现了一个流畅的接口。
