Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/symfony/symfony.*.028.xlf
Languages: ko, ru, zh_cn

source: The main URI
ko: 기본 URI
ru: главный УРИ

source: The main compiler passes roughly do four things:
ko: 메인 컴파일러는 대략 네 가지를 수행합니다.
ru: Основной компилятор передает примерно четыре вещи:

source: The main resource to load
ko: 로드 할 주요 리소스
ru: Основной ресурс для загрузки

source: The manager called $autoMappedManager will map all bundles that are not mapped by other managers.
ko: $ autoMappedManager라는 관리자는 다른 관리자가 매핑하지 않은 모든 번들을 매핑합니다.
ru: Менеджер,называемый $autoMappedManager,нанесет на карту все пакеты,которые не нанесены на карту другими менеджерами.

source: The map also supports multiple parallel iterators. That means that you can nest foreach loops without affecting each other's iteration:
ko: 맵은 또한 여러 병렬 반복기를 지원합니다. 즉, 서로의 반복에 영향을주지 않고 foreach 루프를 중첩 할 수 있습니다.
ru: Карта также поддерживает несколько параллельных итераторов.Это означает,что вы можете гнездить петли фораха,не затрагивая итераций друг друга:

source: The map supports concurrent modification during iteration. That means that you can insert and remove elements from within a foreach loop and the iterator will reflect those changes accordingly.
ko: 맵은 반복 중에 동시 수정을 지원합니다. 즉, foreach 루프 내에서 요소를 삽입하고 제거 할 수 있으며 반복자는 해당 변경 사항을 적절하게 반영합니다.
ru: Карта поддерживает одновременную модификацию во время итерации.Это означает,что вы можете вставлять и удалять элементы из форач-цикла,и итератор будет отражать эти изменения соответствующим образом.

source: The mapped form or null
ko: 매핑 된 폼 또는 null
ru: Картированная форма или ноль

source: The mapping file to load
ko: 로드 할 매핑 파일
ru: Загружаемый картографический файл

source: The marking
ko: 마킹
ru: Маркировка

source: The matched value
ko: 일치하는 값
ru: Соответствующее значение

source: The max depth
ko: 최대 깊이
ru: Максимальная глубина

source: The max dumped depth level
ko: 최대 덤프 깊이 수준
ru: Максимальная глубина сброса

source: The max number of items dumped per depth level
ko: 깊이 수준 당 덤프 된 최대 항목 수
ru: Максимальное количество выбрасываемых предметов на уровень глубины

source: The maximum number of parts of the namespace
ko: 네임 스페이스의 최대 부분 수
ru: Максимальное количество частей пространства имён

source: The maximum number of tokens to return
ko: 반환 할 최대 토큰 수
ru: Максимальное количество жетонов для возврата

source: The maximum post size in bytes
ko: 바이트 단위의 최대 게시물 크기
ru: Максимальный размер записи в байтах

source: The maximum size of an uploaded file in bytes
ko: 업로드 된 파일의 최대 크기 (바이트)
ru: Максимальный размер загруженного файла в байтах

source: The memory
ko: 기억
ru: Память

source: The memory limit
ko: 메모리 한계
ru: Предел памяти

source: The memory usage (in bytes)
ko: 메모리 사용량 (바이트)
ru: Использование памяти (в байтах)

source: The merged and validated options
ko: 병합 및 검증 된 옵션
ru: Объединенные и проверенные варианты

source: The merged password and salt string
ko: 병합 된 비밀번호 및 솔트 문자열
ru: Объединенный пароль и соляная строка

source: The merged value
ko: 합병 된 가치
ru: Совокупная стоимость

source: The message
ko: 메시지
ru: Послание

source: The message (may also be an object that can be cast to string)
ko: 메시지 (문자열로 캐스트 할 수있는 객체 일 수도 있음)
ru: Сообщение (также может быть объектом,который может быть преобразован в строку).

source: The message as an iterable of strings or a single string
ko: 반복 가능한 문자열 또는 단일 문자열로서의 메시지
ru: Сообщение как итерабельное из строк или одной строки.

source: The message being translated
ko: 번역중인 메시지
ru: Переводимое сообщение

source: The message catalogue
ko: 메시지 카탈로그
ru: Каталог сообщений

source: The message catalogue to write
ko: 작성할 메시지 카탈로그
ru: Каталог сообщений для написания

source: The message id
ko: 메시지 ID
ru: идентификатор сообщения

source: The message id (may also be an object that can be cast to string)
ko: 메시지 ID (문자열로 캐스트 할 수있는 객체 일 수도 있음)
ru: Идентификатор сообщения (также может быть объектом,который можно преобразовать в строку).

source: The message locale
ko: 메시지 로케일
ru: Место сообщения

source: The message or message key
ko: 메시지 또는 메시지 키
ru: Клавиша сообщения или сообщения

source: The message or the message pre-wrapped in an envelope
ko: 메시지 또는 봉투에 미리 싸여진 메시지
ru: Сообщение или сообщение,завернутое в конверт.

source: The message selector for pluralization
ko: 복수화를위한 메시지 선택기
ru: Селектор сообщений для множественного числа

source: The message supports two different types of pluralization rules:
ko: 이 메시지는 두 가지 유형의 복수형 규칙을 지원합니다.
ru: Сообщение поддерживает два различных типа правил плюрализации:

source: The message to dispatch
ko: 발송할 메시지
ru: Сообщение для отправки

source: The message to display
ko: 표시 할 메시지
ru: Сообщение для отображения

source: The message to style
ko: 스타일 메시지
ru: Послание к стилю

source: The message to write in the block
ko: 블록에 쓸 메시지
ru: Сообщение для записи в блоке

source: The message translation
ko: 메시지 번역
ru: Перевод сообщения

source: The messages translation
ko: 메시지 번역
ru: Перевод сообщений

source: The metadata for the value
ko: 값의 메타 데이터
ru: Метаданные для значения

source: The metadata loaders
ko: 메타 데이터 로더
ru: Погрузчики метаданных

source: The metadata loaders to use
ko: 사용할 메타 데이터 로더
ru: Погрузчики метаданных для использования

source: The method
ko: 방법
ru: Метод

source: The method "unaliases" recursively to return a Definition instance.
ko: 정의 인스턴스를 반환하기 위해 "unaliases"메소드가 재귀 적으로 발생합니다.
ru: Метод "unaliases" рекурсивно возвращает экземпляр Definition.

source: The method arguments
ko: 메소드 인수
ru: Аргументы метода

source: The method for the form
ko: 양식의 방법
ru: Метод для формы

source: The method for the link (get by default)
ko: 링크 방법 (기본적으로 가져 오기)
ru: Метод для ссылки (получить по умолчанию)

source: The method is always an uppercased string.
ko: 메소드는 항상 대문자 문자열입니다.
ru: Метод всегда является строкой с прописными буквами.

source: The method name
ko: 메소드 명
ru: Название метода

source: The method name that raised the exception
ko: 예외를 일으킨 메소드 이름
ru: Название метода,которое вызвало исключение

source: The method name to call
ko: 호출 할 메소드 이름
ru: Имя метода для вызова

source: The method name to call (priority defaults to 0)
ko: 호출 할 메소드 이름 (우선 순위 기본값은 0)
ru: Имя метода для вызова (приоритет по умолчанию 0)

source: The method name to remove
ko: 제거 할 메소드 이름
ru: Название метода удаления

source: The method name to search for
ko: 검색 할 메소드 이름
ru: Название метода для поиска

source: The method of accessing the property's value must be specified by subclasses by implementing the {@link newReflectionMember()} method.
ko: 속성 값에 액세스하는 방법은 {@link newReflectionMember ()} 메서드를 구현하여 서브 클래스에 의해 지정되어야합니다.
ru: Метод доступа к значению свойства должен быть указан подклассами путем реализации метода {@link newReflectionMember()}.

source: The method or an array of methods
ko: 메소드 또는 메소드의 배열
ru: Метод или массив методов

source: The method returns false if the token does not exist in the storage.
ko: 저장소에 토큰이 없으면이 메서드는 false를 반환합니다.
ru: Метод возвращает false,если токен не существует в хранилище.

source: The method that is called to retrieve the value being validated (null for auto-detection)
ko: 검증중인 값을 검색하기 위해 호출되는 메소드 (자동 감지의 경우 널)
ru: Метод,вызываемый для получения проверяемого значения (ноль для автоматического определения)

source: The method to use for the link (GET by default)
ko: 링크에 사용하는 방법 (기본적으로 GET)
ru: Метод использования для ссылки (GET по умолчанию)

source: The methods
ko: 방법
ru: Методы

source: The methods dealing with URL accept / return a raw path (% encoded): * getBasePath * getBaseUrl * getPathInfo * getRequestUri * getUri * getUriForPath
ko: URL을 처리하는 메소드는 원시 경로를 수락 / 반환합니다 (% 인코딩) : * getBasePath * getBaseUrl * getPathInfo * getRequestUri * getUri * getUriForPath
ru: Методы,работающие с URL,принимают/возвращают необработанный путь (в % кодировке):*getBasePath*getBaseUrl*getPathInfo*getRequestUri*getUri*getUriForPath

source: The methods on this interface are called throughout the guard authentication process to give you the power to control most parts of the process from one location.
ko: 이 인터페이스의 메소드는 보호 인증 프로세스 전체에서 호출되어 한 위치에서 프로세스의 대부분을 제어 할 수 있습니다.
ru: Методы на этом интерфейсе вызываются на протяжении всего процесса аутентификации охранника,чтобы дать вам возможность контролировать большинство частей процесса из одного места.

source: The methods should accept any name. If the name is not an instance of TemplateReferenceInterface, a TemplateNameParserInterface should be used to convert the name to a TemplateReferenceInterface instance.
ko: 메소드는 모든 이름을 허용해야합니다. 이름이 TemplateReferenceInterface의 인스턴스가 아닌 경우 TemplateNameParserInterface를 사용하여 이름을 TemplateReferenceInterface 인스턴스로 변환해야합니다.
ru: Методы должны принимать любое имя.Если имя не является экземпляром TemplateReferenceInterface,то для преобразования имени в TemplateReferenceInterface необходимо использовать TemplateNameParserInterface.

source: The methods {@link loadChoicesForValues()} and {@link loadValuesForChoices()} can be used to load the list only partially in cases where a fully-loaded list is not necessary.
ko: {@link loadChoicesForValues ​​()} 및 {@link loadValuesForChoices ()} 메소드는 완전히로드 된 목록이 필요하지 않은 경우에만 목록을로드하는 데 사용할 수 있습니다.
ru: Методы {@link loadChoicesForValues()}и {@link loadValuesForChoices()}могут использоваться для загрузки списка только частично в тех случаях,когда полностью загруженный список не нужен.

source: The mime type
ko: 마임 유형
ru: Тип пантомимы

source: The mime type is guessed using a MimeTypeGuesser instance, which uses finfo(), mime_content_type() and the system binary "file" (in this order), depending on which of those are available.
ko: MIME 유형은 사용 가능한 유형에 따라 finfo (), mime_content_type () 및 시스템 바이너리 "파일"(순서대로)을 사용하는 MimeTypeGuesser 인스턴스를 사용하여 추측됩니다.
ru: Тип пантомимы угадывается с помощью экземпляра MimeTypeGuesser,который использует функции finfo(),mime_content_type()и системный двоичный "файл" (в этом порядке),в зависимости от того,какой из них доступен.

source: The mime type is passed to each registered mime type guesser in reverse order of their registration (last registered is queried first). Once a guesser returns a value that is not NULL, this method terminates and returns the value.
ko: MIME 유형은 등록 된 역순으로 각 등록 된 MIME 유형 추측 자에게 전달됩니다 (마지막 등록은 먼저 조회됩니다). 추측자가 NULL이 아닌 값을 리턴하면이 메소드는 종료되고 값을 리턴합니다.
ru: Тип пантомимы передается каждому зарегистрированному угадателю пантомимы в обратном порядке их регистрации (последний зарегистрированный опрашивается первым).Как только угадатель возвращает значение,не являющееся NULL,этот метод завершает работу и возвращает значение.

source: The mime type or NULL, if none could be guessed
ko: MIME 유형 또는 추측 할 수없는 경우 NULL
ru: Тип пантомимы или NULL,если никто не мог догадаться.

source: The min depth
ko: 최소 깊이
ru: Минимальная глубина

source: The minimum logging level at which this handler will be triggered depends on the verbosity setting of the console output. The default mapping is: - OutputInterface::VERBOSITY_NORMAL will show all WARNING and higher logs - OutputInterface::VERBOSITY_VERBOSE (-v) will show all NOTICE and higher logs - OutputInterface::VERBOSITY_VERY_VERBOSE (-vv) will show all INFO and higher logs - OutputInterface::VERBOSITY_DEBUG (-vvv) will show all DEBUG and higher logs, i.e. all logs
ko: 이 핸들러가 트리거되는 최소 로깅 레벨은 콘솔 출력의 상세 설정에 따라 다릅니다. 기본 맵핑은 다음과 같습니다.-OutputInterface :: VERBOSITY_NORMAL은 모든 WARNING 및 상위 로그를 표시합니다.-OutputInterface :: VERBOSITY_VERBOSE (-v)는 모든 NOTICE 및 상위 로그를 표시합니다.-OutputInterface :: VERBOSITY_VERY_VERBOSE (-vv)는 모든 INFO 및 상위 로그를 표시합니다. OutputInterface :: VERBOSITY_DEBUG (-vvv)는 모든 DEBUG 이상 로그, 즉 모든 로그를 표시합니다
ru: Минимальный уровень протоколирования,при котором будет срабатывать этот обработчик,зависит от настройки глаголов на выходе консоли.По умолчанию выводится:-OutputInterface::VERBOSITY_NORMAL выводит все журналы предупреждений и выше-OutputInterface::VERBOSITY_VERBOSE (-v)выводит все журналы ЗАМЕЧАНИЙ и выше-OutputInterface::VERBOSITY_VERBOSE (-vv)выводит все журналы INFO и выше-OutputInterface::VERBOSITY_DEBUG (-vvv)выводит все журналы DEBUG и выше,т.е.все журналы

source: The minute
ko: 분
ru: Минута

source: The mode (self::ONLY_FILES or self::ONLY_DIRECTORIES)
ko: 모드 (self :: ONLY_FILES 또는 self :: ONLY_DIRECTORIES)
ru: Режим (self::ONLY_FILES или self::ONLY_DIRECTORIES)

source: The mode mask (octal)
ko: 모드 마스크 (8 진수)
ru: Маска режима (восьмеричный)

source: The modified version of $managerConfigs
ko: $ managerConfigs의 수정 된 버전
ru: Модифицированная версия $managerConfigs

source: The month
ko: 달
ru: Месяц

source: The most common keys are: - <code>body</code> (string) - the message body - <code>headers</code> (string
ko: 가장 일반적인 키는 다음과 같습니다.- <code>body</code> (문자열)-메시지 본문- <code>headers</code> (문자열)
ru: Наиболее распространенные ключи: - <code>body</code> (строка) - тело сообщения - <code>headers</code> (строка

source: The most common keys of the encoded array are: - <code>body</code> (string) - the message body - <code>headers</code> (string
ko: 인코딩 된 배열의 가장 일반적인 키는 다음과 같습니다.- <code>body</code> (문자열)-메시지 본문- <code>headers</code> (문자열)
ru: Наиболее распространенные ключи закодированного массива: - <code>body</code> (строка) - тело сообщения - <code>headers</code> (строка

source: The name
ko: 이름
ru: Название

source: The name for the builder
ko: 빌더의 이름
ru: Имя строителя

source: The name of each file with the extension ".txt" is considered, if it "looks" like a locale:
ko: 로케일과 같이 "확장자"인 경우 확장자가 ".txt"인 각 파일의 이름이 고려됩니다.
ru: Имя каждого файла с расширением ".txt" учитывается,если он "выглядит" как локаль:

source: The name of method call that validates the input
ko: 입력을 검증하는 메소드 호출의 이름
ru: Имя вызова метода,который проверяет входные данные.

source: The name of the ID field
ko: ID 필드의 이름
ru: Имя поля ID

source: The name of the appended index
ko: 추가 된 색인의 이름
ru: Название прилагаемого индекса

source: The name of the appended property
ko: 추가 된 속성의 이름
ru: Название прилагаемого имущества

source: The name of the application
ko: 응용 프로그램의 이름
ru: Название приложения

source: The name of the application using the web profiler
ko: 웹 프로파일 러를 사용하는 애플리케이션의 이름
ru: Название приложения с помощью веб-профилировщика

source: The name of the asset package to use
ko: 사용할 자산 패키지의 이름
ru: Название пакета активов для использования

source: The name of the attribute
ko: 속성의 이름
ru: Имя атрибута

source: The name of the attribute which value is to be used as a key
ko: 값이 키로 사용될 속성의 이름
ru: Имя атрибута,значение которого будет использоваться в качестве ключа.

source: The name of the backing class
ko: 후원 클래스의 이름
ru: Название класса поддержки

source: The name of the block
ko: 블록의 이름
ru: Название блока

source: The name of the block to load
ko: 로드 할 블록의 이름
ru: Название блока для загрузки

source: The name of the block to load a resource for
ko: 리소스를로드 할 블록의 이름
ru: Имя блока для загрузки ресурса для

source: The name of the block to render
ko: 렌더링 할 블록의 이름
ru: Имя блока для визуализации

source: The name of the builder
ko: 빌더의 이름
ru: Имя строителя
zh_cn: 建筑商的名称

source: The name of the chain driver service
ko: 체인 드라이버 서비스의 이름
ru: Название службы цепного водителя
zh_cn: 链条司机服务的名称

source: The name of the child
ko: 아이의 이름
ru: Имя ребенка
zh_cn: 孩子的名字

source: The name of the child to remove
ko: 제거 할 자녀의 이름
ru: Имя ребенка для удаления
zh_cn: 要删除的孩子的名字

source: The name of the class
ko: 수업 명
ru: Название класса
zh_cn: 类的名称

source: The name of the class this member is defined on
ko: 이 멤버가 정의 된 클래스의 이름
ru: Имя класса,на котором этот член определен на
zh_cn: 这个成员被定义的类的名称。

source: The name of the class to generate
ko: 생성 할 클래스 이름
ru: Имя класса для генерации
zh_cn: 要生成的类的名称

source: The name of the command; passing null means it must be set in configure()
ko: 명령의 이름입니다. null 전달은 configure ()에서 설정되어야 함을 의미합니다.
ru: Имя команды;передача нуля означает,что она должна быть установлена в configure()
zh_cn: 命令的名称;传递null表示必须在configure()中设置。

source: The name of the container's base class
ko: 컨테이너의 기본 클래스 이름
ru: Название базового класса контейнера
zh_cn: 容器的基类的名称

source: The name of the cookie
ko: 쿠키의 이름
ru: Название куки-файла
zh_cn: Cookie的名称

source: The name of the country or NULL if not found
ko: 국가 이름 또는 찾지 못한 경우 NULL
ru: Название страны или NULL,если не найдено.
zh_cn: 国家名称,如果没有找到,则为 "NULL"。

source: The name of the currency or NULL if not found
ko: 통화 이름 또는 찾지 못한 경우 NULL
ru: Название валюты или NULL если не найдено
zh_cn: 货币的名称,如果没有找到,则为NULL。

source: The name of the default group
ko: 기본 그룹의 이름
ru: Имя группы по умолчанию
zh_cn: 默认组的名称

source: The name of the environment variable
ko: 환경 변수의 이름
ru: Имя переменной окружения
zh_cn: 环境变量的名称

source: The name of the error code
ko: 오류 코드의 이름
ru: Название кода ошибки
zh_cn: 错误代码的名称

source: The name of the event
ko: 행사 명
ru: Название мероприятия
zh_cn: 活动名称

source: The name of the event to dispatch
ko: 발송할 이벤트의 이름
ru: Название мероприятия для отправки
zh_cn: 要发送的事件名称

source: The name of the event to dispatch. The name of the event is the name of the method that is invoked on listeners.
ko: 전달할 이벤트의 이름입니다. 이벤트의 이름은 리스너에서 호출되는 메소드의 이름입니다.
ru: Название мероприятия для отправки.Имя события-это имя метода,который вызывается у слушателей.
zh_cn: 要调度的事件名称。事件的名称是对监听者调用的方法的名称。

source: The name of the event to listen to
ko: 들을 이벤트의 이름
ru: Название мероприятия для прослушивания
zh_cn: 要监听的事件名称

source: The name of the extension
ko: 확장명
ru: Название расширения
zh_cn: 分机的名称

source: The name of the field
ko: 필드의 이름
ru: Название поля
zh_cn: 该领域的名称

source: The name of the form
ko: 양식의 이름
ru: Название формы
zh_cn: 表格的名称

source: The name of the form or the name of the property
ko: 양식 이름 또는 속성 이름
ru: Название формы или наименование собственности
zh_cn: 表格的名称或财产的名称。

source: The name of the getter is assumed to be the name of the property with an uppercased first letter and either the prefix "get" or "is".
ko: 게터의 이름은 대문자로 된 첫 글자와 접두사가 "get"또는 "is"인 속성 이름으로 간주됩니다.
ru: Имя получателя предполагается как имя свойства с заглавной первой буквой и либо префиксом "get",либо "is".
zh_cn: getter的名称假定为属性的名称,首字母为大写,前缀为 "get "或 "is"。

source: The name of the getter method
ko: getter 메소드의 이름
ru: Название метода геттера
zh_cn: getter方法的名称

source: The name of the input timezone
ko: 입력 시간대의 이름
ru: Название входного часового пояса
zh_cn: 输入时区的名称

source: The name of the key
ko: 열쇠의 이름
ru: Имя ключа
zh_cn: 钥匙的名称

source: The name of the language or NULL if not found
ko: 언어 이름 또는 찾지 못한 경우 NULL
ru: Название языка или NULL,если не найдено.
zh_cn: 语言的名称,如果没有找到,则为NULL。

source: The name of the loader (see addLoader())
ko: 로더 이름 (addLoader () 참조)
ru: Имя загрузчика (см.addLoader())
zh_cn: 加载器的名称(见addLoader())。

source: The name of the loader (see addResource())
ko: 로더 이름 (addResource () 참조)
ru: Имя загрузчика (см.addResource())
zh_cn: 加载器的名称(见addResource())。

source: The name of the locale or NULL if not found
ko: 로캘의 이름 또는 찾지 못한 경우 NULL
ru: Имя локали или NULL,если не найдено.
zh_cn: 区域名称,如果没有找到,则为NULL。

source: The name of the member
ko: 회원의 이름
ru: Имя члена
zh_cn: 委员姓名

source: The name of the method
ko: 방법의 이름
ru: Название метода
zh_cn: 方法的名称

source: The name of the node
ko: 노드의 이름
ru: Имя узла
zh_cn: 节点的名称

source: The name of the option
ko: 옵션의 이름
ru: Название опции
zh_cn: 选项的名称

source: The name of the output timezone
ko: 출력 시간대의 이름
ru: Название часового пояса выхода
zh_cn: 输出时区的名称

source: The name of the package or null for the default package
ko: 패키지 이름 또는 기본 패키지의 경우 null
ru: Имя пакета или ноль для пакета по умолчанию
zh_cn: 软件包的名称或默认软件包的名称为空。

source: The name of the parameter
ko: 매개 변수의 이름
ru: Имя параметра
zh_cn: 参数名称

source: The name of the parent type if any, null otherwise
ko: 부모 유형의 이름 (있는 경우), 그렇지 않은 경우 null
ru: Имя родительского типа,если есть,ноль в противном случае.
zh_cn: 父类型的名称(如有),否则为空。

source: The name of the placeholder
ko: 자리 표시 자의 이름
ru: Имя владельца
zh_cn: 占位符的名称

source: The name of the property
ko: 재산의 이름
ru: Название собственности
zh_cn: 财产名称

source: The name of the property to guess for
ko: 추측 할 속성의 이름
ru: Название собственности,чтобы угадать
zh_cn: 要猜测的楼盘名称

source: The name of the root node
ko: 루트 노드의 이름
ru: Имя корневого узла
zh_cn: 根节点的名称

source: The name of the route
ko: 경로의 이름
ru: Название маршрута
zh_cn: 途径名称

source: The name of the script or NULL if not found
ko: 스크립트 이름 또는 찾지 못한 경우 NULL
ru: Имя скрипта или NULL если не найдено
zh_cn: 脚本的名称,如果没有找到,则为NULL。

source: The name of the static method to call
ko: 호출 할 정적 메소드의 이름
ru: Имя статического метода для вызова
zh_cn: 要调用的静态方法的名称

source: The name of the type
ko: 유형의 이름
ru: Название типа
zh_cn: 类型名称

source: The name of the type being extended
ko: 확장되는 타입의 이름
ru: Имя расширяемого типа
zh_cn: 被扩展的类型名称

source: The name of the validated property
ko: 검증 된 속성의 이름
ru: Название сертифицированной собственности
zh_cn: 审定的财产名称

source: The name of the variable within the namespace
ko: 네임 스페이스 내의 변수 이름
ru: Имя переменной в пространстве имен
zh_cn: 命名空间内的变量名称

source: The name parameter might also be a TemplateReferenceInterface.
ko: name 매개 변수는 TemplateReferenceInterface 일 수도 있습니다.
ru: Параметр name также может быть TemplateReferenceInterface.
zh_cn: 名称参数也可能是一个TemplateReferenceInterface。

source: The name to give this route
ko: 이 경로를 제공하는 이름
ru: Название,чтобы дать этому маршруту
zh_cn: 本路线的名称

source: The names of the defined options
ko: 정의 된 옵션의 이름
ru: Названия определенных опций
zh_cn: 定义的选项名称

source: The names of the methods
ko: 방법의 이름
ru: Названия методов
zh_cn: 方法的名称

source: The names of the missing options
ko: 누락 된 옵션의 이름
ru: Имена недостающих вариантов
zh_cn: 缺少的选项名称

source: The names of the required options
ko: 필요한 옵션의 이름
ru: Названия необходимых опций
zh_cn: 所需选项的名称

source: The namespace alias can be used to reference constraints from specific namespaces in {@link newConstraint()}:
ko: 네임 스페이스 별칭은 {@link newConstraint ()}의 특정 네임 스페이스에서 제약 조건을 참조하는 데 사용할 수 있습니다.
ru: Псевдоним пространства имен может быть использован для ссылки на ограничения из определенных пространств имен в {@link newConstraint()}:
zh_cn: 命名空间别名可以用来引用{@link newConstraint()}中特定命名空间的约束。

source: The namespace of the command
ko: 명령의 네임 스페이스
ru: Пространство имён команды
zh_cn: 命令的命名空间

source: The namespace of the variable
ko: 변수의 네임 스페이스
ru: Пространство имен переменной
zh_cn: 变量的命名空间

source: The namespace prefix of classes in the scanned directory
ko: 스캔 된 디렉토리에있는 클래스의 네임 스페이스 접 두부
ru: Префикс пространства имен классов в сканируемом каталоге
zh_cn: 扫描目录中的类的命名空间前缀。

source: The namespace under which the token is stored in the session
ko: 세션에서 토큰이 저장되는 네임 스페이스
ru: Пространство имен,под которым токен хранится в сессии.
zh_cn: 会话中存储令牌的命名空间。

source: The nested-tags are converted to keys (
ko: 중첩 태그는 키로 변환됩니다 (
ru: Вложенные теги преобразуются в ключи (
zh_cn: 嵌套的标签被转换为键(

source: The new Marking
ko: 새로운 마킹
ru: Новая маркировка
zh_cn: 新的标记

source: The new builder
ko: 새로운 빌더
ru: Новый строитель
zh_cn: 新建筑商

source: The new builder instance
ko: 새로운 빌더 인스턴스
ru: Новый строительный экземпляр
zh_cn: 新的建设者实例

source: The new decorated service id
ko: 새로 꾸며진 서비스 ID
ru: Новый украшенный сервисный идентификатор
zh_cn: 新装修的服务ID

source: The new environment variables
ko: 새로운 환경 변수
ru: Новые переменные окружения
zh_cn: 新的环境变量

source: The new execution context
ko: 새로운 실행 컨텍스트
ru: Новый контекст исполнения
zh_cn: 新的执行背景

source: The new file name
ko: 새로운 파일 이름
ru: Новое имя файла
zh_cn: 新文件名

source: The new filename or directory
ko: 새로운 파일 이름 또는 디렉토리
ru: Новое имя файла или каталог
zh_cn: 新的文件名或目录

source: The new mode (octal)
ko: 새로운 모드 (8 진수)
ru: Новый режим (восьмеричный)
zh_cn: 新模式(八进制)

source: The new name of the element. Optional
ko: 요소의 새로운 이름. 선택 과목
ru: Новое название элемента.Дополнительно .
zh_cn: 元素的新名称。可选

source: The new owner user name
ko: 새로운 소유자 사용자 이름
ru: Новое имя пользователя владельца
zh_cn: 新主人的用户名

source: The new position
ko: 새로운 위치
ru: Новое положение
zh_cn: 新职位
