Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/symfony/symfony.*.028.xlf
Languages: ko, ru, zh_cn

source: The function name is used as block name. For example, if the function name is "foo", the block "foo" will be rendered.
ko: 기능 명은 블록 명으로 사용됩니다. 예를 들어 함수 이름이 "foo"이면 "foo"블록이 렌더링됩니다.
ru: Имя функции используется как имя блока.Например,если имя функции "foo",то будет отображен блок "foo".

source: The generated CSRF token
ko: 생성 된 CSRF 토큰
ru: Сгенерированный CSRF-токен

source: The generated URL
ko: 생성 된 URL
ru: Сгенерированный URL-адрес

source: The generated URL reference
ko: 생성 된 URL 참조
ru: Сгенерированная ссылка URL-адреса

source: The getCacheDir() method of a rebootable kernel should not be called while building the container. Use the %kernel.cache_dir% parameter instead.
ko: 컨테이너를 빌드하는 동안 재부팅 가능한 커널의 getCacheDir () 메소드를 호출하면 안됩니다. 대신 % kernel.cache_dir % 매개 변수를 사용하십시오.
ru: Метод getCacheDir()перезагружаемого ядра не должен вызываться при сборке контейнера.Вместо этого используйте параметр %kernel.cache_dir%.

source: The getSubscribedServices method returns an array of service types required by such instances, optionally keyed by the service names used internally. Service types that start with an interrogation mark "?" are optional, while the other ones are mandatory service dependencies.
ko: getSubscribedServices 메소드는 해당 인스턴스에 필요한 서비스 유형의 배열을 리턴하며 선택적으로 내부적으로 사용되는 서비스 이름으로 키가 지정됩니다. 심문 마크 "?"로 시작하는 서비스 유형 다른 것은 필수 서비스 종속성입니다.
ru: Метод getSubscribeServices возвращает массив типов услуг,требуемых такими инстанциями,по желанию,по именам служб,используемых внутри организации.Типы сервисов,которые начинаются со знака "?",являются необязательными,в то время как другие являются обязательными зависимостями сервисов.

source: The getter will be invoked by reflection, so the access of private and protected getters is supported.
ko: getter는 리플렉션에 의해 호출되므로 개인 및 보호 된 getter의 액세스가 지원됩니다.
ru: Геттер будет вызываться по отражению,поэтому доступ частных и защищенных геттеров поддерживается.

source: The given URI is signed by adding the query string parameter which value depends on the URI and the secret.
ko: 주어진 URI는 URI와 비밀에 따라 값이 달라지는 쿼리 문자열 매개 변수를 추가하여 서명됩니다.
ru: Данный URI подписывается путем добавления параметра строки запроса,значение которого зависит от URI и секрета.

source: The given choice array must have the same array keys as the value array.
ko: 주어진 선택 배열은 값 배열과 동일한 배열 키를 가져야합니다.
ru: Массив выбора должен иметь те же ключи массива,что и массив значений.

source: The glob pattern
ko: 글로브 패턴
ru: Шаровой узор

source: The global default content (it can be a template name or the content)
ko: 글로벌 기본 컨텐츠 (템플릿 이름 또는 컨텐츠 일 수 있음)
ru: Глобальное содержимое по умолчанию (это может быть имя шаблона или содержимое).

source: The group in which cascaded objects are validated when validating this sequence.
ko: 이 시퀀스의 유효성을 검사 할 때 계단식 개체의 유효성이 검사되는 그룹입니다.
ru: Группа,в которой каскадные объекты проверяются при проверке этой последовательности.

source: The group name
ko: 그룹 이름
ru: Название группы

source: The group sequence or null
ko: 그룹 순서 또는 null
ru: Групповая последовательность или ноль

source: The group's name or hash, if it is group sequence
ko: 그룹 이름 또는 해시 (그룹 시퀀스 인 경우)
ru: Имя группы или хэш,если это групповая последовательность.

source: The groups in the sequence
ko: 시퀀스의 그룹
ru: Группы в последовательности

source: The groups in the sequence.
ko: 시퀀스의 그룹.
ru: Группы в последовательности.

source: The groups that the constraint belongs to
ko: 구속 조건이 속하는 그룹
ru: Группы,к которым относится ограничение

source: The groups to normalize
ko: 정규화 할 그룹
ru: Группы для нормализации

source: The guess for the maximum length
ko: 최대 길이에 대한 추측
ru: Догадка для максимальной длины

source: The guess for the pattern
ko: 패턴에 대한 추측
ru: Догадка для шаблона

source: The guess whether the field is required
ko: 필드가 필요한지 추측
ru: Угадайте,требуется ли поле

source: The guessed extension or NULL, if none could be guessed
ko: 추측 된 확장자 또는 추측 할 수없는 경우 NULL
ru: Угаданное расширение или NULL,если ни один из них не мог быть угадан.

source: The guessed extension or null if it cannot be guessed
ko: 추측 된 확장자 또는 추측 할 수없는 경우 null
ru: Угаданное расширение или ноль,если его невозможно угадать.

source: The guessed field class and options
ko: 추측되는 필드 클래스 및 옵션
ru: Угаданный класс поля и опции

source: The guessed field type
ko: 추측 된 필드 유형
ru: Угаданный тип поля

source: The guessed mime type (e.g. "application/pdf")
ko: 추측 된 MIME 유형 (예 : "application / pdf")
ru: Угаданный тип пантомимы (например,"приложение/pdf").

source: The guessed value
ko: 추측 된 가치
ru: Угаданная величина

source: The guessed value with the highest confidence
ko: 자신감이 가장 높은 추측 값
ru: Угаданная ценность с наибольшей уверенностью

source: The guesser that the extension should support
ko: 확장 프로그램이 지원해야하는 추측
ru: Догадка,что расширение должно поддерживать

source: The handler to register
ko: 등록 할 핸들러
ru: Обработчик для регистрации

source: The handler will have, as argument, the received {@link \Symfony\Component\Messenger\Envelope} containing the message. Note that this envelope can be <code>null</code> if the timeout to receive something has expired.
ko: 핸들러는 메시지를 포함하는 수신 된 {@link \ Symfony \ Component \ Messenger \ Envelope}를 인수로 갖습니다. 수신 시간이 초과 된 경우이 봉투는 <code>null</code> 일 수 있습니다 .
ru: Обработчик будет иметь в качестве аргумента полученный {@link \ Symfony \ Component \ Messenger \ Envelope}, содержащий сообщение. Обратите внимание, что этот конверт может быть <code>null</code> если истекло время ожидания для получения чего-либо.

source: The hash of the constraint
ko: 제약의 해시
ru: Хэш ограничения

source: The hash of the object
ko: 객체의 해시
ru: Хэш объекта

source: The header name
ko: 헤더 이름
ru: Имя заголовка

source: The header value
ko: 헤더 값
ru: Значение заголовка

source: The headers
ko: 헤더
ru: Заголовки

source: The headers array is a set of key/value pairs. If a header is present multiple times then the value is an array of all the values.
ko: 헤더 배열은 키 / 값 쌍의 집합입니다. 헤더가 여러 번 존재하면 값은 모든 값의 배열입니다.
ru: Массив заголовков представляет собой набор пар ключ/значение.Если заголовок присутствует несколько раз,то значение представляет собой массив из всех значений.

source: The help for the command
ko: 명령에 대한 도움말
ru: Помощь для команды

source: The helper instance
ko: 헬퍼 인스턴스
ru: вспомогательная инстанция

source: The helper name
ko: 도우미 이름
ru: Имя помощника

source: The helper value
ko: 도우미 가치
ru: Вспомогательная ценность

source: The hierarchy level or false, if no resource was found
ko: 계층 구조 레벨 또는 자원을 찾을 수없는 경우 false
ru: Уровень иерархии или ложь,если не найден ресурс.

source: The higher this value, the earlier an event listener will be triggered in the chain (defaults to 0)
ko: 이 값이 높을수록 이벤트 리스너가 더 일찍 체인에서 트리거됩니다 (기본값은 0).
ru: Чем выше это значение,тем раньше в цепочке сработает слушатель событий (по умолчанию-0).

source: The host is always lowercased because it must be treated case-insensitive.
ko: 호스트는 대소 문자를 구분하지 않으므로 처리해야합니다.
ru: Хозяин всегда в нижнем регистре,потому что он должен быть обработан без учета регистра.

source: The host pattern
ko: 호스트 패턴
ru: Хост-комплекс

source: The host pattern to match
ko: 일치하는 호스트 패턴
ru: Хост шаблон в соответствии с

source: The host regex or null
ko: 호스트 정규식 또는 null
ru: Регекс хоста или ноль

source: The hour
ko: 시간
ru: Час

source: The hour value
ko: 시간 값
ru: Значение часа

source: The humanized text
ko: 인간화 된 텍스트
ru: Гуманизированный текст

source: The id of Definition instance to decorate
ko: 장식 할 정의 인스턴스의 ID
ru: Идентификационный номер экземпляра "Определения" для украшения

source: The id of the formatting session
ko: 형식화 세션의 ID
ru: Идентификатор сеанса форматирования

source: The id of the session to re-open, null to create a new one
ko: 다시 열 세션의 ID, 새 세션을 만들려면 null
ru: Идентификатор сессии для повторного открытия,ноль для создания нового.

source: The id of the user provider
ko: 사용자 제공자의 ID
ru: Идентификатор провайдера пользователя

source: The id parameter is used to retrieve the events from this section.
ko: id 매개 변수는이 섹션에서 이벤트를 검색하는 데 사용됩니다.
ru: Параметр id используется для извлечения событий из данного раздела.

source: The id used when generating the token
ko: 토큰을 생성 할 때 사용 된 ID
ru: Идентификатор,используемый при генерации токена

source: The identifier field of the object. This method is not applicable for fields with multiple identifiers.
ko: 객체의 식별자 필드 이 방법은 식별자가 여러 개인 필드에는 적용 할 수 없습니다.
ru: Поле идентификатора объекта.Данный метод не применим для полей с несколькими идентификаторами.

source: The identifier for which to check existence
ko: 존재를 확인할 식별자
ru: Идентификатор,по которому можно проверить существование

source: The identifier of the section
ko: 섹션의 식별자
ru: Идентификатор раздела

source: The identifier token value
ko: 식별자 토큰 값
ru: Значение токена идентификатора

source: The identifier token value or null if star found
ko: 식별자 토큰 값 또는 별표가 발견되면 null
ru: Значение токена идентификатора или ноль,если найдена звезда

source: The identifiers that failed to be cached or a boolean stating if caching succeeded or not
ko: 캐싱에 실패한 식별자 또는 캐싱 성공 여부를 나타내는 부울
ru: Идентификаторы,которые не удалось кэшировать,или булевы идентификаторы,указывающие,удалось ли кэширование или нет.

source: The image alt
ko: 이미지 대체
ru: Изменение изображения

source: The implementation should output the content directly to the client.
ko: 구현시 컨텐츠를 클라이언트에 직접 출력해야합니다.
ru: Реализация должна выводить содержимое непосредственно клиенту.

source: The in ServiceReferenceGraphEdge array
ko: in ServiceReferenceGraphEdge 배열
ru: Массив in ServiceReferenceGraphEdge

source: The index filename
ko: 색인 파일 이름
ru: Имя файла индекса

source: The index in the property path
ko: 속성 경로의 인덱스
ru: Индекс в пути свойств

source: The index key
ko: 인덱스 키
ru: Ключ индекса

source: The indexed solution can also contain labels (e.g. one: There is one apple). This is purely for making the translations more clear - it does not affect the functionality.
ko: 인덱싱 된 솔루션에는 레이블도 포함될 수 있습니다 (예 : 하나는 사과가 있습니다). 이것은 번역을보다 명확하게하기위한 것입니다. 기능에는 영향을 미치지 않습니다.
ru: Индексированное решение может также содержать ярлыки (например,одно:есть одно яблоко).Это делается исключительно для того,чтобы сделать переводы более понятными-это не влияет на функциональность.

source: The indices to read from the bundle
ko: 번들에서 읽을 인덱스
ru: Индексы для чтения из пакета

source: The info text
ko: 정보 텍스트
ru: Информационный текст

source: The information contained in the URI always take precedence over the other information (server and parameters).
ko: URI에 포함 된 정보는 항상 다른 정보 (서버 및 매개 변수)보다 우선합니다.
ru: Информация,содержащаяся в URI,всегда имеет приоритет над другой информацией (сервер и параметры).

source: The inherited roles
ko: 상속 된 역할
ru: Унаследованные роли

source: The initial data
ko: 초기 데이터
ru: Исходные данные

source: The initial form data
ko: 초기 양식 데이터
ru: Данные исходной формы

source: The injected service locators SHOULD NOT allow access to any other services not specified by the method.
ko: 삽입 된 서비스 로케이터는 메소드에 의해 지정되지 않은 다른 서비스에 대한 액세스를 허용해서는 안됩니다 (SHOULD NOT).
ru: Инъекционные локаторы служб НЕ ДОЛЖНЫ позволять доступ к любым другим службам,не указанным в методе.

source: The inline strategy to use when the surrogate is not supported
ko: 대리가 지원되지 않을 때 사용할 인라인 전략
ru: Внутренняя стратегия,которую следует использовать,когда суррогатная материя не поддерживается.

source: The input as stream resource, scalar or \Traversable, or null for no input
ko: 스트림 자원으로서의 입력, 스칼라 또는 \ Traversable. 입력이없는 경우는 null
ru: Вход в качестве потокового ресурса,скаляра или \Traversable,или ноль для отсутствия входа

source: The input stream
ko: 입력 스트림
ru: Входной поток

source: The input to append as scalar, stream resource or \Traversable
ko: 스칼라, 스트림 리소스 또는 \ Traversable로 추가 할 입력
ru: Входные данные для добавления в качестве скаляра,потокового ресурса или \Traversable.

source: The input to validate
ko: 검증 할 입력
ru: Вход для проверки

source: The interface for all "guard" authenticators.
ko: 모든 "guard"인증자를위한 인터페이스입니다.
ru: Интерфейс для всех "сторожевых" аутентификаторов.

source: The invalid value
ko: 유효하지 않은 값
ru: Недействительное значение

source: The invalid value that caused this violation
ko: 이 위반을 일으킨 잘못된 값
ru: Недействительное значение,которое вызвало это нарушение

source: The iterated error messages
ko: 반복 된 오류 메시지
ru: Итерационные сообщения об ошибках

source: The iterator
ko: 반복자
ru: Итератор

source: The json response data
ko: JSON 응답 데이터
ru: Данные json-ответа

source: The kernel in which this event was thrown
ko: 이 이벤트가 발생한 커널
ru: Ядро,в котором было брошено это событие...

source: The kernel name
ko: 커널 이름
ru: Имя ядра

source: The key
ko: 열쇠
ru: Ключ

source: The key and value of each entry are joined with "=", and all entries are joined with the specified separator and an additional space (for readability). Values are quoted if necessary.
ko: 각 항목의 키와 값은 "="로 결합되고 모든 항목은 지정된 구분 기호 및 추가 공간 (가독성을 위해)과 결합됩니다. 필요한 경우 값이 인용됩니다.
ru: Ключ и значение каждой записи соединяются знаком "=",а все записи соединяются указанным разделителем и дополнительным пробелом (для удобочитаемости).При необходимости значения приводятся в кавычках.

source: The key to normalize
ko: 정상화의 열쇠
ru: Ключ к нормализации

source: The key to remap
ko: 다시 매핑하는 열쇠
ru: Ключ к оставлению под стражей

source: The key to seek to
ko: 추구하는 열쇠
ru: Ключ к тому,чтобы стремиться

source: The key to validate
ko: 검증의 열쇠
ru: Ключ к проверке

source: The key under which the response is stored
ko: 응답이 저장되는 키
ru: Ключ,под которым хранится ответ

source: The key used to store attributes in the session
ko: 세션에서 속성을 저장하는 데 사용되는 키
ru: Ключ,используемый для хранения атрибутов в сеансе

source: The key used to store bag in the session
ko: 세션에서 가방을 저장하는 데 사용되는 키
ru: Ключ,который использовался для хранения сумки в сеансе

source: The key used to store flashes in the session
ko: 세션에서 플래시를 저장하는 데 사용되는 키
ru: Ключ,используемый для хранения вспышек во время сеанса.

source: The keys of the map in the order in which they should be iterated
ko: 반복되는 순서대로 맵의 키
ru: Ключи карты в том порядке,в котором они должны быть итерированы.

source: The label
ko: 라벨
ru: Этикетка

source: The label displayed to humans
ko: 인간에게 표시되는 라벨
ru: Ярлык,отображаемый людям

source: The label of the group
ko: 그룹의 라벨
ru: Метка группы

source: The language range to check against
ko: 확인할 언어 범위
ru: Языковой диапазон для проверки

source: The language resource bundle
ko: 언어 자원 번들
ru: Пакет языковых ресурсов

source: The language tag to check
ko: 확인할 언어 태그
ru: Языковой тег для проверки

source: The last modification time of the cached template (timestamp)
ko: 캐시 된 템플릿의 마지막 수정 시간 (타임 스탬프)
ru: Последнее время модификации кэшируемого шаблона (метка времени)

source: The last registered guesser is preferred over previously registered ones.
ko: 마지막으로 등록한 추측자가 이전에 등록한 추측보다 선호됩니다.
ru: Последний зарегистрированный угадатель предпочтительнее ранее зарегистрированных.

source: The last time the resource was loaded
ko: 리소스가 마지막으로로드 된 시간
ru: Последний раз при загрузке ресурса

source: The left delimiter can be [ (inclusive) or ] (exclusive). The right delimiter can be [ (exclusive) or ] (inclusive). Beside numbers, you can use -Inf and +Inf for the infinite.
ko: 왼쪽 구분 기호는 [(포함) 또는] (제외) 일 수 있습니다. 오른쪽 구분 기호는 [(제외) 또는] (포함) 일 수 있습니다. 숫자 외에도 무한대에 -Inf 및 + Inf를 사용할 수 있습니다.
ru: Левый разделитель может быть[(включительно)или](исключая).Правый разделитель может быть[(исключительный)или](включительно).Кроме чисел можно использовать -Inf и +Inf для бесконечности.

source: The length of the Transformer pattern string
ko: Transformer 패턴 문자열의 길이
ru: Длина строки шаблона трансформатора

source: The length of the appended piece If 0, the full path is appended
ko: 추가 된 조각의 길이 0이면 전체 경로가 추가됩니다
ru: Длина добавленной части Если 0,то полный путь добавлен

source: The length of the inserted piece If 0, the full path is inserted
ko: 삽입 된 조각의 길이 0이면 전체 경로가 삽입됩니다
ru: Длина вставленной части Если 0,то вставляется полный контур

source: The length of the piece to replace
ko: 교체 할 부품의 길이
ru: Длина детали для замены

source: The length of the removed piece
ko: 제거 된 조각의 길이
ru: Длина удаленной части

source: The length of the string
ko: 끈의 길이
ru: Длина строки

source: The length of the value to be reverse matched
ko: 역 일치시킬 값의 길이
ru: Длина значения,которое должно быть обратно подобрано.

source: The length to pad
ko: 패드 길이
ru: Длина на подушку

source: The level in the hierarchy at which to start looking. Level 0 indicates the root block, i.e. the first element of $blockNameHierarchy.
ko: 찾고 시작할 계층 구조의 수준입니다. 레벨 0은 루트 블록, 즉 $ blockNameHierarchy의 첫 번째 요소를 나타냅니다.
ru: Уровень в иерархии,на котором можно начать искать.Уровень 0 указывает на корневой блок,т.е.первый элемент $blockNameHierarchy.

source: The level of error reporting you want
ko: 원하는 오류보고 수준
ru: Уровень сообщений об ошибках,который вы хотите

source: The level of indentation (used internally)
ko: 들여 쓰기 수준 (내부적으로 사용)
ru: Уровень вмятин (используется внутри)

source: The level of verbosity (one of the VERBOSITY constants)
ko: 상세 레벨 (VERBOSITY 상수 중 하나)
ru: Уровень глаголов (одна из констант VERBOSITY)

source: The level where you switch to inline YAML
ko: 인라인 YAML로 전환하는 수준
ru: Уровень,на котором вы переключаетесь на встроенный ЯМЛ.

source: The libxml errors are disabled when the content is parsed.
ko: 내용을 구문 분석 할 때 libxml 오류가 비활성화됩니다.
ru: Ошибки libxml отключаются при разборе содержимого.

source: The lifetime of items propagated from lower caches to upper ones
ko: 하위 캐시에서 상위 캐시로 전파 된 항목의 수명
ru: Срок годности предметов,перенесенных из нижних кэшей в верхние.

source: The lifetime of the cached values, 0 for persisting until manual cleaning
ko: 캐시 된 값의 수명, 수동 청소까지 지속되는 경우 0
ru: Срок службы значений в кэше,0 для сохранения до ручной очистки.

source: The line indent pad
ko: 줄 들여 쓰기 패드
ru: Площадка для отступов линии

source: The line number
ko: 줄 번호
ru: Номер строки

source: The line to write
ko: 쓸 줄
ru: Строка для написания

source: The line where the error occurred
ko: 오류가 발생한 줄
ru: Строка,где произошла ошибка

source: The link text
ko: 링크 텍스트
ru: Текст ссылки

source: The list of attributes to rename or null for all attributes
ko: 이름을 바꿀 속성 목록 또는 모든 속성에 대해 null
ru: Список атрибутов для переименования или нулевой для всех атрибутов

source: The list of available choices
ko: 사용 가능한 선택 목록
ru: Список доступных вариантов

source: The list of fields as array((string) Fully qualified name =&gt; (mixed) value)
ko: 배열의 필드 목록 ((문자열) 완전한 이름 =&gt; (혼합 된 값)
ru: Список полей в виде массива ((строка) Полное имя =&gt; (смешанное) значение)

source: The list of synchronized stores
ko: 동기화 된 상점 목록
ru: Список синхронизированных хранилищ

source: The listener
ko: 그 듣는 사람
ru: Слушатель

source: The listener context
ko: 리스너 컨텍스트
ru: Контекст слушателя

source: The listener object
ko: 리스너 객체
ru: Объект-приемник

source: The listener to execute
ko: 실행할 리스너
ru: Слушатель на выполнение

source: The listener to remove
ko: 제거 할 리스너
ru: Слушатель,которого нужно удалить

source: The loaded choice list
ko: 로드 된 선택 목록
ru: Загруженный список выбора

source: The loaded file path
ko: 로드 된 파일 경로
ru: Путь к загруженному файлу

source: The loaded metadata, indexed by class name.
ko: 로드 된 메타 데이터 (클래스 이름별로 색인화 됨)
ru: Загруженные метаданные,проиндексированные по имени класса.

source: The loader
ko: 로더
ru: Погрузчик

source: The loader for configuring new metadata
ko: 새로운 메타 데이터 구성을위한 로더
ru: Загрузчик для настройки новых метаданных

source: The loader or false if none is able to load the resource
ko: 로더 또는 리소스를로드 할 수없는 경우 false
ru: Загрузчик или ложь,если ни один из них не в состоянии загрузить ресурс

source: The locale
ko: 로케일
ru: Местность

source: The locale code
ko: 로캘 코드
ru: Код локали

source: The locale code to extract the keywords from
ko: 키워드를 추출하는 로캘 코드
ru: Код локали для извлечения ключевых слов из

source: The locale code to extract the language code from
ko: 언어 코드를 추출하는 로캘 코드
ru: Код локали для извлечения кода языка из

source: The locale code to extract the region code from
ko: 지역 코드를 추출하는 로캘 코드
ru: Код локали для извлечения кода региона из

source: The locale code to extract the script code from
ko: 스크립트 코드를 추출 할 로캘 코드
ru: Локальный код для извлечения кода скрипта из

source: The locale code to extract the subtag array from
ko: 하위 태그 배열을 추출하는 로캘 코드
ru: Код локали для извлечения массива подтегов из

source: The locale code to return the display language from
ko: 표시 언어를 반환하는 로캘 코드
ru: Код локали для возврата языка отображения с

source: The locale code to return the display locale name from
ko: 표시 로캘 이름을 반환하는 로캘 코드
ru: Код локали для возврата названия отображаемой локали от

source: The locale code to return the display region from
ko: 표시 영역을 반환하는 로캘 코드
ru: Код локали для возврата области отображения из

source: The locale code to return the display script from
ko: 표시 스크립트를 반환하는 로캘 코드
ru: Локальный код для возврата скрипта отображения от

source: The locale code to return the display variant from
ko: 표시 변형을 반환하는 로캘 코드
ru: Локальный код для возврата варианта дисплея с

source: The locale code. The only currently supported locale is "en" (or null using the default locale, i.e. "en")
ko: 로캘 코드 현재 지원되는 유일한 로케일은 "en"입니다 (또는 기본 로케일을 사용하는 경우 널 (예 : "en")).
ru: Местный код.Единственная поддерживаемая на данный момент локаль-это "en" (или ноль,используя локаль по умолчанию,т.е."en").

source: The locale code. The only supported locale is "en" (or null using the default locale, i.e. "en")
ko: 로캘 코드 유일하게 지원되는 로케일은 "en"입니다 (또는 기본 로케일을 사용하는 경우 널 (예 : "en")).
ru: Местный код.Единственная поддерживаемая локаль-это "en" (или ноль,используя локаль по умолчанию,т.е."en").

source: The locale or null to use the default
ko: 기본값을 사용하는 로캘 또는 null
ru: Локаль или ноль для использования по умолчанию

source: The locale resource bundle
ko: 로케일 자원 번들
ru: Локальный ресурсный пакет

source: The locale to (over-)write
ko: 쓰려는 로케일
ru: Местность,чтобы (пере-)написать

source: The locale to extract the variants from
ko: 에서 변형을 추출하는 로캘
ru: Локаль для извлечения вариантов из

source: The locale to read
ko: 읽을 로케일
ru: Местность для чтения

source: The locale to return the name of (e.g. "de_AT")
ko: 이름을 반환하는 로캘 (예 : "de_AT")
ru: Локаль,возвращающая имя (например,"de_AT").

source: The locale to use as the language range when matching
ko: 일치 할 때 언어 범위로 사용할 로캘
ru: Локаль для использования в качестве языкового диапазона при совпадении

source: The locale to use for choosing
ko: 선택에 사용할 로케일
ru: Местность,которую следует использовать для выбора

source: The locale to use if no match is found
ko: 일치하는 항목이없는 경우 사용할 로캘
ru: Локаль,которую нужно использовать,если совпадений нет.

source: The locale used to create the collator. Currently always returns "en".
ko: 조합기를 만드는 데 사용 된 로캘입니다. 현재는 항상 "en"을 반환합니다.
ru: Локаль,используемая для создания коллектора.В настоящее время всегда возвращает "en".

source: The locale used to create the formatter. Currently always returns "en".
ko: 포맷터를 만드는 데 사용 된 로캘입니다. 현재는 항상 "en"을 반환합니다.
ru: Локаль,используемая для создания формата.В настоящее время всегда возвращается "en".

source: The locale variants
ko: 로케일 변형
ru: Локальные варианты

source: The localized language display name
ko: 현지화 된 언어 표시 이름
ru: Локализованное отображаемое имя языка

source: The localized locale display name
ko: 현지화 된 로캘 표시 이름
ru: Локализованное отображаемое имя локали

source: The localized region display name
ko: 현지화 된 지역 표시 이름
ru: Локализованный регион отображает имя

source: The localized script display name
ko: 현지화 된 스크립트 표시 이름
ru: Локализованный скрипт отображает имя

source: The localized variant display name
ko: 현지화 된 변형 표시 이름
ru: Локализованный вариант отображения имени

source: The log directory
ko: 로그 디렉토리
ru: Каталог журнала

source: The logger
ko: 로거
ru: Логгер

source: The logout URL
ko: 로그 아웃 URL
ru: URL выхода из системы

source: The logout path
ko: 로그 아웃 경로
ru: Путь выхода из системы

source: The long application version
ko: 긴 응용 프로그램 버전
ru: Удлиненная версия приложения
