Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/symfony/symfony.*.028.xlf
Languages: ko, ru, zh_cn

source: The validator for the new context
ko: 새로운 문맥의 검증 자
ru: Валидатор для нового контекста
zh_cn: 新上下文的验证器

source: The validator must be defined as a service with this name.
ko: 유효성 검증기는이 이름의 서비스로 정의되어야합니다.
ru: Валидатор должен быть определен как служба с таким именем.
zh_cn: 验证器必须被定义为具有这个名称的服务。

source: The validator, when given an object, traverses the properties and related objects and their properties. The root of the validation is the object from which the traversal started.
ko: 개체가 주어지면 유효성 검사기는 속성과 관련 개체 및 속성을 순회합니다. 유효성 검사의 근본은 순회가 시작된 개체입니다.
ru: Валидатор,при присвоении объекта,обходит свойства и связанные с ними объекты,а также их свойства.Корнем валидации является объект,с которого начался обход.
zh_cn: 验证器在得到一个对象后,会遍历属性和相关对象及其属性。验证的根是开始遍历的对象。

source: The value
ko: 가치
ru: Значение
zh_cn: 价值

source: The value at the end of the property path
ko: 특성 경로 끝에있는 값
ru: Значение в конце пути собственности
zh_cn: 属性路径末端的值

source: The value being styled
ko: 스타일링되는 가치
ru: Значение стилизируемого
zh_cn: 样式的值

source: The value emitted upon transform if the input is true
ko: 입력이 참인 경우 변환시 생성되는 값
ru: Значение,высвечиваемое при преобразовании,если на входе верно.
zh_cn: 输入为真时,变换时发出的值。

source: The value for error message pluralization
zh_cn: 错误信息复数的值

source: The value for the symbol
zh_cn: 符号的值

source: The value in the original representation
zh_cn: 原始表示中的数值

source: The value in the transformed representation
zh_cn: 变换后的表示方法中的数值

source: The value of the Cache-Control HTTP header
zh_cn: Cache-Control HTTP头的值。

source: The value of the attribute
zh_cn: 属性值

source: The value of the cookie
zh_cn: 饼干的价值

source: The value of the field
zh_cn: 该领域的价值

source: The value of the first argument or null otherwise
zh_cn: 第一个参数的值,否则为空

source: The value of the option
zh_cn: 期权的价值

source: The value of the property
zh_cn: 财产的价值

source: The value of the property is obtained by directly accessing the property. The property will be accessed by reflection, so the access of private and protected properties is supported.
zh_cn: 通过直接访问属性获得属性的价值。通过反思来获取属性,所以支持私有属性和保护属性的获取。

source: The value or an array of values
zh_cn: 价值或价值数组

source: The value or reference to bind
zh_cn: 要绑定的值或引用

source: The value originally passed to the validator
zh_cn: 最初传递给验证器的值

source: The value returned if the attribute does not exist
zh_cn: 如果属性不存在,返回的值。

source: The value returned if the option does not exist
zh_cn: 如果选项不存在,返回的值

source: The value that should be validated
zh_cn: 应该验证的值

source: The value that was passed originally to the validator when the validation was started. Because the validator traverses the object graph, the value at which the violation occurs is not necessarily the value that was originally validated.
zh_cn: 验证开始时最初传递给验证器的值。因为验证器遍历对象图,所以发生违规的值不一定是最初验证的值。

source: The value that was set or an array with the domains/keys or null
zh_cn: 设置的值或包含域/键的数组或空值。

source: The value to be inserted in the parameter's place
zh_cn: 要插入参数位置的值。

source: The value to convert
zh_cn: 要转换的值

source: The value to finalize
zh_cn: 最后确定的数值

source: The value to format
zh_cn: 要格式化的值

source: The value to format as string
zh_cn: 要格式化为字符串的值

source: The value to hash
zh_cn: 要散列的值

source: The value to normalize
zh_cn: 归一化值

source: The value to parse
zh_cn: 要解析的值

source: The value to resolve
zh_cn: 要解析的值

source: The value to return the type of
zh_cn: 要返回的值是

source: The value to set
zh_cn: 要设置的值

source: The value to set at the end of the property path
zh_cn: 在属性路径末端设置的值。

source: The value to use for the provided environment variable name
zh_cn: 所提供的环境变量名称的值。

source: The value to validate
zh_cn: 要验证的值

source: The value to validate against the property's constraints
zh_cn: 要根据属性的约束条件进行验证的值。

source: The value with env parameters resolved if a string or an array is passed
zh_cn: 如果传递的是字符串或数组,则包含env参数解析的值。

source: The value with style decoration
zh_cn: 风格装修的价值

source: The value(s) to look for in the raw parameters (can be an array)
zh_cn: 在原始参数中寻找的值(可以是一个数组)。

source: The values
zh_cn: 价值

source: The values are merged with the allowed values defined previously.
zh_cn: 这些值与之前定义的允许值合并。

source: The values are returned with the same keys and in the same order as the corresponding choices in the given array.
zh_cn: 返回的值与给定数组中对应的选择有相同的键和顺序。

source: The values are strings that do not contain duplicates.
zh_cn: 值是不包含重复的字符串。

source: The values indexed by the original keys
zh_cn: 以原始键为索引的值

source: The values indexed by the original keys.
zh_cn: 以原始键为索引的值。

source: The values of the identifiers
zh_cn: 标识符的数值

source: The values to cache, indexed by their cache identifier
zh_cn: 要缓存的值,以缓存标识符为索引。

source: The values to look for in the raw parameters (can be an array)
zh_cn: 在原始参数中寻找的值(可以是一个数组)。

source: The variable to pass to the template
zh_cn: 要传递给模板的变量

source: The variables
zh_cn: 变量

source: The variables assigned to this view.
zh_cn: 分配给该视图的变量。

source: The variables to pass to the template
zh_cn: 要传递给模板的变量

source: The verbosity level (one of the VERBOSITY constants in OutputInterface)
zh_cn: verbosity level(输出接口中的VERBOSITY常数之一)。

source: The version of the application
zh_cn: 应用程序的版本

source: The version of the application using the web profiler
zh_cn: 使用网络剖析器的应用程序版本。

source: The version of the installed ICU data
zh_cn: 安装的ICU数据版本

source: The version string
zh_cn: 版本字符串

source: The versionized path
zh_cn: 版本化路径

source: The view
zh_cn: 观点

source: The view for determining the used themes
zh_cn: 确定所用主题的观点

source: The view for determining the used themes. First the themes attached directly to the view with {@link setTheme()} are considered, then the ones of its parent etc.
zh_cn: 用于确定使用的主题的视图。首先考虑用{@link setTheme()}直接连接到视图的主题,然后考虑其父级的主题等。

source: The view for which to render the block
zh_cn: 渲染该块的视图

source: The view for which to render the end tag
zh_cn: 渲染结束标签的视图

source: The view for which to render the form
zh_cn: 渲染表单的视图

source: The view for which to render the label
zh_cn: 渲染标签的视图

source: The view for which to render the row
zh_cn: 要渲染行的视图

source: The view for which to render the start tag
zh_cn: 渲染起始标签的视图

source: The view for which to render the widget
zh_cn: 渲染小组件的视图

source: The view name
zh_cn: 视图名称

source: The view representation of the choice
zh_cn: 选择的观点表示

source: The view to assign the theme(s) to
zh_cn: 分配主题的视图。

source: The view to render
zh_cn: 要呈现的视图

source: The violation
zh_cn: 违规行为

source: The violation as string
zh_cn: 违规行为为字符串

source: The violation builder
zh_cn: 违章建筑商

source: The violation code
zh_cn: 违规代码

source: The violation message
zh_cn: 违规信息

source: The violation offset
zh_cn: 违约金

source: The violation to map
zh_cn: 违规绘制地图

source: The vote strategy
zh_cn: 投票战略

source: The working directory or null to use the working dir of the current PHP process
zh_cn: 工作目录,或者使用当前PHP进程的工作目录为空。

source: The wrapped class loader
zh_cn: 封装的类加载器

source: The wrapped form type
zh_cn: 包装后的表格类型

source: The writer instance
zh_cn: 作者实例

source: The year
zh_cn: 这一年

source: Then the value can be read by calling:
zh_cn: 然后可以通过调用来读取该值。

source: There are five levels of verbosity:
zh_cn: 啰嗦有五个层次。

source: There is no common option.
zh_cn: 没有共同的选择。

source: There may only exist one metadata for each attribute according to its name.
zh_cn: 每个属性根据其名称只能存在一个元数据。

source: These callables will receive the node as first argument and the translator as second argument.
zh_cn: 这些可调用项将接收节点作为第一个参数,翻译器作为第二个参数。

source: They in which to look for the object to populate. Keeps backwards compatibility with <code>AbstractNormalizer</code>.
zh_cn: 他们在其中寻找要填充的对象。与 <code>AbstractNormalizer</code> 保持向后兼容性。

source: This Normalizer implements RFC7807 {@link https://tools.ietf.org/html/rfc7807}.
zh_cn: 这个Normalizer实现了RFC7807 {@link https://tools.ietf.org/html/rfc7807}。

source: This Router creates the Loader only when the cache is empty.
zh_cn: 该Router只有在缓存为空时才会创建Loader。

source: This abstract classes groups common code that Doctrine Object Manager extensions (ORM, MongoDB, CouchDB) need.
zh_cn: 这个抽象类将Doctrine Object Manager扩展(ORM、MongoDB、CouchDB)需要的常用代码进行了分组。

source: This abstract session handler provides a generic implementation of the PHP 7.0 SessionUpdateTimestampHandlerInterface, enabling strict and lazy session handling.
zh_cn: 这个抽象的会话处理程序提供了PHP 7.0 SessionUpdateTimestampHandlerInterface的通用实现,实现了严格和懒惰的会话处理。

source: This adapter takes advantage of how PHP stores arrays in its latest versions.
zh_cn: 这个适配器利用了PHP在其最新版本中存储数组的方式。

source: This adds information about stderr and section output stream.
zh_cn: 这增加了关于stderr和部分输出流的信息。

source: This alias is also the mandatory prefix to use when using YAML.
zh_cn: 这个别名也是使用YAML时必须使用的前缀。

source: This array can be displayed in the template using the VarDumper component.
zh_cn: 这个数组可以使用VarDumper组件在模板中显示。

source: This array defines the characters (besides alphanumeric ones) that will not be percent-encoded in the path segment of the generated URL.
zh_cn: 这个数组定义了在生成的URL的路径段中不会被百分编码的字符(除了字母数字字符)。

source: This array stores 'all', 'new' and 'obsolete' messages for all valid domains.
zh_cn: 这个数组存储了所有有效域的 "所有"、"新 "和 "过时 "消息。

source: This authentication provider will not perform any checks on authentication requests, as they should already be pre-authenticated. However, the UserProviderInterface implementation may still throw a UsernameNotFoundException, for example.
zh_cn: 这个身份验证提供者不会对身份验证请求进行任何检查,因为它们应该已经被预先认证了。然而,UserProviderInterface的实现仍然可以抛出一个UsernameNotFoundException,例如。

source: This avoids us needing to check for "false" every time PCRE is used in the YAML engine
zh_cn: 这就避免了我们每次在YAML引擎中使用PCRE时都需要检查 "false"。

source: This blocker code is chiefly for preserving backwards compatibility.
zh_cn: 这段封堵代码主要是为了保留向后的兼容性。

source: This cache only caches on disk to allow PHP accelerators to cache the opcodes. All other mechanism would imply the use of <code>eval()</code>.
zh_cn: 此缓存仅缓存在磁盘上，以允许PHP加速器缓存操作码。所有其他机制都将暗示使用 <code>eval()</code> 。

source: This cache warmer is not optional, without proxies fatal error occurs!
zh_cn: 这个缓存加热器不是可有可无的,没有代理就会出现致命的错误!

source: This can be overridden by explicitly passing the input values in the constructor:
zh_cn: 这可以通过在构造函数中显式传递输入值来重写。

source: This can be overridden in a sub-class to specify the alias manually.
zh_cn: 这可以在子类中被覆盖,手动指定别名。

source: This can be slow as all the matching files and directories must be retrieved for comparison.
zh_cn: 这可能很慢,因为必须检索所有匹配的文件和目录进行比较。

source: This can be useful to determine whether or not to trust the contents of a proxy-specific header.
zh_cn: 这对于确定是否信任特定代理头的内容很有用。

source: This can return null if the password was not encoded using a salt.
zh_cn: 如果密码没有使用盐来编码,那么这个值会返回null。

source: This check should take the metadata passed to the write() method into consideration.
zh_cn: 这个检查应该考虑到传递给write()方法的元数据。

source: This class accepts multiple instances of LoaderInterface to be passed to the constructor. When {@link loadClassMetadata()} is called, the same method is called in <em>all</em> of these loaders, regardless of whether any of them was successful or not.
zh_cn: 此类接受LoaderInterface的多个实例，这些实例将传递给构造函数。调用{@link loadClassMetadata（）}时，<em>所有</em>这些加载器中<em>都</em>将调用相同的方法，而不管它们中的任何一个是否成功。

source: This class adds helper method to describe objects in various formats.
zh_cn: 该类增加了辅助方法来描述各种格式的对象。

source: This class builds an if expression.
zh_cn: 这个类构建了一个if表达式。

source: This class builds merge conditions.
zh_cn: 该类建立合并条件。

source: This class builds normalization conditions.
zh_cn: 该类建立规范化条件。

source: This class builds validation conditions.
zh_cn: 该类建立验证条件。

source: This class contains no event data. It is used by events that do not pass state information to an event handler when an event is raised.
zh_cn: 该类不包含事件数据。它被那些在事件发生时不将状态信息传递给事件处理程序的事件使用。

source: This class contains static methods only and is not meant to be instantiated.
zh_cn: 这个类只包含静态方法,并不打算被实例化。

source: This class contains the configuration information for the bundle.
zh_cn: 该类包含捆绑包的配置信息。

source: This class handles the rendering of resource fragments that are included into a main resource. The handling of the rendering is managed by specialized renderers.
zh_cn: 该类处理包含在主资源中的资源片段的渲染。渲染的处理由专门的渲染器管理。

source: This class has a default configuration embedded.
zh_cn: 这个类嵌入了一个默认的配置。

source: This class implements a fluent interface.
zh_cn: 这个类实现了一个流畅的接口。

source: This class is a convenient wrapper around <code>StreamOutput</code> for both STDOUT and STDERR.
zh_cn: 此类是STDOUT和STDERR的 <code>StreamOutput</code> 便利包装。

source: This class is optimized for a standard CLI environment.
zh_cn: 该类针对标准CLI环境进行了优化。

source: This class is the entry point for config normalization/merging/finalization.
zh_cn: 该类是配置规范化/合并/最终确定的切入点。

source: This class is used for testing purposes, and is not really suited for production.
zh_cn: 该类用于测试目的,并不真正适合生产。

source: This class is used to remove circular dependencies between individual passes.
zh_cn: 该类用于删除各个通道之间的循环依赖关系。

source: This class provides a fluent interface for building a node.
zh_cn: 该类为构建节点提供了一个流畅的接口。

source: This class provides a fluent interface for defining a float node.
zh_cn: 该类为定义浮点节点提供了一个流畅的接口。

source: This class provides a fluent interface for defining a node.
zh_cn: 该类为定义节点提供了一个流畅的接口。

source: This class provides a fluent interface for defining an array node.
zh_cn: 该类为定义一个数组节点提供了一个流畅的接口。

source: This class provides a fluent interface for defining an integer node.
zh_cn: 该类为定义一个整数节点提供了一个流畅的接口。

source: This class provides storage for the tokens that is set in "remember me" cookies. This way no password secrets will be stored in the cookies on the client machine, and thus the security is improved.
zh_cn: 该类为 "记住我 "cookie中设置的令牌提供存储。这样一来,客户端机器上的Cookie中就不会存储密码秘密,从而提高了安全性。

source: This class provides structured storage of session attributes using a name spacing character in the key.
zh_cn: 该类使用键中的名字间隔字符提供会话属性的结构化存储。

source: This class relates to session attribute storage.
zh_cn: 该类与会话属性存储有关。

source: This class supports serialization and cloning.
zh_cn: 该类支持序列化和克隆。

source: This class will populate the ServiceReferenceGraph with information. You can retrieve the graph in other passes from the compiler.
zh_cn: 这个类将用信息填充ServiceReferenceGraph。你可以在编译器的其他通道中检索该图。

source: This component is a port of the Python cssselect library, which is copyright Ian Bicking, see https://github.com/SimonSapin/cssselect.
zh_cn: 该组件是Python cssselect库的移植,版权归Ian Bicking所有,见https://github.com/SimonSapin/cssselect。

source: This considers several other headers and calculates or modifies the cache-control header to a sensible, conservative value.
zh_cn: 它考虑了其他几个头,并计算或修改缓存控制头,使之成为一个合理的、保守的值。

source: This content will be passed to the underlying process standard input.
zh_cn: 这些内容将被传递给底层流程标准输入。

source: This convention is to remove the "Extension" postfix from the class name and then lowercase and underscore the result. So:
zh_cn: 这个惯例是将类名中的 "扩展 "后缀去掉,然后将结果小写并下划线。所以。

source: This default implementation checks if the class has the enabledParameter configured and if so if that parameter is present in the container.
zh_cn: 这个默认的实现会检查该类是否配置了enabledParameter,如果配置了,那么容器中是否存在该参数。

source: This definition extends another definition.
zh_cn: 这个定义扩展了另一个定义。

source: This depends on the DependencyInjection component.
zh_cn: 这取决于DependencyInjection组件。

source: This depends only on doctrine in order to get a database connection and to do the conversion of the datetime column.
zh_cn: 这只取决于学说,以便获得数据库连接并进行datetime列的转换。

source: This doesn't need to be particularly cryptographically secure since this is just a mock.
zh_cn: 这不需要特别的密码学安全,因为这只是一个模拟。

source: This enforces the convention that the validatedBy() method on any Constraint will return the class name of the ConstraintValidator that should validate the Constraint.
zh_cn: 这强制执行了这样的约定:任何Constraint上的validatedBy()方法将返回应该验证该Constraint的ConstraintValidator的类名。

source: This engine knows how to render Symfony templates.
zh_cn: 这个引擎知道如何渲染Symfony模板。

source: This engine knows how to render Twig templates.
zh_cn: 这个引擎知道如何渲染Twig模板。

source: This engine renders Twig templates.
zh_cn: 这个引擎可以渲染Twig模板。

source: This entry point is not intended to work with HTTP post requests.
zh_cn: 这个入口点不打算与HTTP帖子请求一起工作。

source: This event allows you to change the arguments that will be passed to the controller.
zh_cn: 该事件允许你改变将传递给控制器的参数。

source: This event allows you to change the controller that will handle the request.
zh_cn: 该事件允许你改变将处理请求的控制器。

source: This event allows you to create a response for a request before any other code in the framework is executed.
zh_cn: 该事件允许你在框架中的任何其他代码被执行之前为请求创建一个响应。

source: This event allows you to create a response for a thrown exception or to modify the thrown exception.
zh_cn: 这个事件允许你为一个抛出的异常创建响应,或者修改抛出的异常。

source: This event allows you to create a response for the return value of the controller.
zh_cn: 该事件允许你为控制器的返回值创建一个响应。

source: This event allows you to deal with the exception/error or to modify the thrown exception.
zh_cn: 该事件允许你处理异常/错误或修改抛出的异常。

source: This event allows you to modify or replace the response that will be replied.
zh_cn: 该事件允许您修改或替换将被回复的响应。

source: This event allows you to reset the global and environmental state of the application, when it was changed during the request.
zh_cn: 当应用程序的全局和环境状态在请求过程中发生改变时,该事件允许你重置应用程序的全局和环境状态。

source: This event allows you to run expensive post-response jobs.
zh_cn: 该事件允许您运行昂贵的后响应作业。

source: This event dispatcher delegates the dispatching to another one.
zh_cn: 该事件调度器将调度工作委托给另一个。

source: This event is dispatched on authentication failure.
zh_cn: 该事件在认证失败时发出。

source: This event is mostly here for reading data after having pre-populated the form.
zh_cn: 这个事件主要是为了在预先填写好表格后读取数据。

source: This exception is thrown if an invalid type is encountered.
zh_cn: 如果遇到无效的类型,就会抛出这个异常。

source: This exception is thrown when a circular reference in a parameter is detected.
zh_cn: 当检测到参数中的循环引用时,就会抛出这个异常。

source: This exception is thrown when a circular reference is detected.
zh_cn: 当检测到循环引用时,会抛出这个异常。

source: This exception is thrown when a configuration path is overwritten from a subsequent configuration file, but the entry node specifically forbids this.
zh_cn: 当配置路径从后续配置文件中被覆盖时,就会抛出这个异常,但条目节点特别禁止这样做。

source: This exception is thrown when a non-existent parameter is used.
zh_cn: 当使用一个不存在的参数时,会抛出这个异常。

source: This exception is thrown when a non-existent service is requested.
zh_cn: 当请求一个不存在的服务时,会抛出这个异常。

source: This exception is thrown when an account is reloaded from a provider which doesn't support the passed implementation of UserInterface.
zh_cn: 当账户从不支持UserInterface传递的实现的提供者那里重新加载时,会抛出这个异常。

source: This exception is thrown when an environment variable is not found.
zh_cn: 当找不到环境变量时,就会抛出这个异常。

source: This exception is thrown when no session is available.
zh_cn: 当没有会话可用时,就会抛出这个异常。

source: This exception is thrown when the RememberMeServices implementation detects that a presented cookie has already been used by someone else.
zh_cn: 当RememberMeServices实现检测到一个呈现的cookie已经被别人使用时,就会抛出这个异常。

source: This exception is thrown when the csrf token is invalid.
zh_cn: 当csrf token无效时,会抛出这个异常。

source: This exception is thrown whenever the key of an array is not unique. This can only be the case if the configuration is coming from an XML file.
zh_cn: 只要数组的键不是唯一的,就会抛出这个异常。只有当配置来自XML文件时才会出现这种情况。

source: This exception is usually not encountered by the end-user, but only used internally to signal the parent scope to unset a key.
zh_cn: 这种异常通常不会被终端用户遇到,而只是在内部用于向父作用域发出信号,以取消设置一个键。

source: This exception should trigger an HTTP 404 response in your application code.
zh_cn: 这个异常应该在你的应用程序代码中触发一个HTTP 404响应。

source: This exception should trigger an HTTP 405 response in your application code.
zh_cn: 这个异常应该在你的应用程序代码中触发一个HTTP 405响应。

source: This exception will be thrown if no response is set in the event.
zh_cn: 如果事件中没有设置响应,则会抛出这个异常。

source: This exception wraps exceptions whose messages contain a reference to an env parameter.
zh_cn: 这个异常包装了那些消息中包含对env参数的引用的异常。

source: This extension protects forms by using a CSRF token.
zh_cn: 该扩展通过使用CSRF令牌来保护表单。

source: This extension sub-class provides first-class integration with the Config/Definition Component.
zh_cn: 该扩展子类提供了与配置/定义组件的一流集成。

source: This factory and/or cache <em>do not</em> support cache validation by means of ResourceChecker instances (that is, service-based).
zh_cn: 该工厂和/或缓存<em>不</em>支持通过ResourceChecker实例（即基于服务）进行缓存验证。

source: This feature should be used only when creating a long process command, like a daemon.
zh_cn: 此功能只应在创建长进程命令(如守护进程)时使用。

source: This function automatically skips the empty lines and do not include the line return in result value.
zh_cn: 该函数自动跳过空行,并且在结果值中不包含回行。

source: This function takes an array by reference and will modify it
zh_cn: 此函数通过引用接收一个数组,并修改它。

source: This handler clears the passed cookies when a user logs out.
zh_cn: 当用户注销时,该处理程序会清除通过的cookies。

source: This has no influence on writing non-existing indices with PropertyAccessorInterface::setValue() which are always created on-the-fly.
zh_cn: 这对用PropertyAccessorInterface::setValue()写不存在的索引没有影响,因为这些索引总是即时创建的。

source: This implementation always returns true when debug is off and the cache file exists.
zh_cn: 当调试关闭且缓存文件存在时,该实现总是返回true。

source: This implementation changes the master response TTL to the smallest TTL received or force validation if one of the surrogates has validation cache strategy.
zh_cn: 本实施例将主响应TTL改变为接收到的最小TTL,或者如果其中一个代理有验证缓存策略,则强制验证。

source: This implementation eagerly loads all blocks of the themes assigned to the given view and all of its ancestors views. This is necessary, because Twig receives the list of blocks later. At that point, all blocks must already be loaded, for the case that the function "block()" is used in the Twig template.
zh_cn: 这个实现急切地加载了分配给给定视图及其所有祖先视图的主题的所有块。这是必要的,因为Twig稍后会收到块的列表。这时,所有的块必须已经被加载,因为在Twig模板中使用了 "block()"函数。

source: This implementation is useful if you want to validate values against constraints only and you don't need to add constraints to classes and properties.
zh_cn: 如果你只想根据约束条件来验证值,而不需要将约束条件添加到类和属性中,这个实现就很有用。

source: This implementation resolves the _controller attribute from the short notation to the fully-qualified form (from a:b:c to class::method).
zh_cn: 这个实现将_controller属性从简写符号解析为完全限定形式(从a:b:c到class::method)。

source: This implementation takes everything as the template name and the extension for the engine.
zh_cn: 本实施例将一切作为模板名称和引擎的扩展。

source: This implementation tries to load as few blocks as possible, since each block is represented by a template on the file system.
zh_cn: 这个实现试图尽可能少地加载块,因为每个块都是由文件系统中的模板来表示的。

source: This implementation uses the '_controller' request attribute to determine the controller to execute.
zh_cn: 这个实现使用'_controller'请求属性来确定要执行的控制器。

source: This implementation will make a decision solely based on the ResourceCheckers passed in the constructor.
zh_cn: 本实施例将仅根据构造函数中传递的ResourceCheckers做出决定。

source: This information can be used by your compiler passes instead of collecting it themselves which improves performance quite a lot.
zh_cn: 这些信息可以被你的编译器通证使用,而不是自己收集,这样可以提高不少性能。

source: This information is solely responsible for how the different configuration sections are normalized, and merged.
zh_cn: 这些信息只负责不同配置部分的归一化、合并。

source: This interface allows you to use your custom ResolvedFormTypeInterface implementation, within which you can customize the concrete FormBuilderInterface implementations or FormView subclasses that are used by the framework.
zh_cn: 这个接口允许你使用你自定义的ResolvedFormTypeInterface实现,在这个接口中,你可以自定义具体的FormBuilderInterface实现或框架使用的FormView子类。

source: This interface can be implemented in place of UserInterface if you'd like the authentication system to consider different account status flags during authentication. If any of the methods in this interface return false, authentication will fail.
zh_cn: 如果你想让认证系统在认证过程中考虑不同的账户状态标志,可以用这个接口代替UserInterface来实现。如果这个接口中的任何一个方法返回false,认证就会失败。
