Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/symfony/symfony.*.028.xlf
Languages: ko, ru, zh_cn

source: The string to produce the key from
ko: 키를 생성하는 문자열
ru: Строка для получения ключа из
zh_cn: 要产生密钥的字符串

source: The string to replace the quotes
ko: 따옴표를 바꿀 문자열
ru: Строка для замены кавычек
zh_cn: 替换引号的字符串

source: The string to resolve
ko: 해결할 문자열
ru: Строка для решения
zh_cn: 要解析的字符串

source: The string to underscore
ko: 밑줄을 긋는 문자열
ru: Строка для подчёркивания
zh_cn: 下划线的字符串

source: The style background color name
ko: 스타일 배경색 이름
ru: Название цвета фона стиля
zh_cn: 风格背景色名称

source: The style foreground color name
ko: 스타일 전경색 이름
ru: Название цвета стиля на переднем плане
zh_cn: 风格前景色名称

source: The style instance
ko: 스타일 인스턴스
ru: Стильный пример
zh_cn: 样式实例

source: The style name
ko: 스타일 이름
ru: Название стиля
zh_cn: 样式名称

source: The style name or a TableStyle instance
ko: 스타일 이름 또는 TableStyle 인스턴스
ru: Название стиля или экземпляр TableStyle
zh_cn: 样式名称或一个TableStyle实例

source: The style options
ko: 스타일 옵션
ru: Опции стиля
zh_cn: 风格选择

source: The style to apply to the section
ko: 섹션에 적용 할 스타일
ru: Стиль применения к разделу
zh_cn: 适用于该部分的样式

source: The style to apply to the whole block
ko: 전체 블록에 적용 할 스타일
ru: Стиль,применимый ко всему блоку
zh_cn: 适用于整个块的样式

source: The styled message
ko: 스타일이 지정된 메시지
ru: Стильное послание
zh_cn: 风格信息

source: The stylesheet as a string
ko: 문자열로 스타일 시트
ru: Таблица стилей в виде строки
zh_cn: 样式表作为一个字符串

source: The subject of the event, usually an object or a callable
ko: 이벤트의 주제, 일반적으로 객체 또는 호출 가능
ru: Тема события,как правило,объект или вызываемая
zh_cn: 事件的主体,通常是一个对象或一个可调用的对象。

source: The subject to secure
ko: 확보 할 주제
ru: Объект,подлежащий защите
zh_cn: 要确保的主题

source: The subject to secure, e.g. an object the user wants to access or any other PHP type
ko: 보안 대상 (예 : 사용자가 액세스하려는 객체 또는 다른 PHP 유형)
ru: Объект безопасности,например,объект,к которому хочет получить доступ пользователь или любой другой тип PHP.
zh_cn: 要保护的对象,例如用户要访问的对象或任何其他PHP类型。

source: The submitted data
ko: 제출 된 데이터
ru: Представленные данные
zh_cn: 提交的数据

source: The submitted data which do not belong to a child
ko: 아동이 아닌 제출 된 데이터
ru: Представленные данные,которые не принадлежат ребенку.
zh_cn: 提交的不属于儿童的资料

source: The subscriber is asked for all the events he is interested in and added as a listener for these events.
ko: 가입자는 관심있는 모든 이벤트를 요청 받고 이러한 이벤트의 리스너로 추가됩니다.
ru: У абонента запрашиваются все интересующие его события,и он добавляется в качестве слушателя этих событий.
zh_cn: 订阅者被要求提供他感兴趣的所有事件,并被添加为这些事件的听众。

source: The suffix of the block name
ko: 블록 이름의 접미사
ru: Суффикс имени блока
zh_cn: 区块名称的后缀

source: The symbol value or false on error
ko: 심볼 값 또는 오류시 false
ru: Значение символа или ложь при ошибке
zh_cn: 符号值或错误时为false

source: The symbolic link name
ko: 심볼릭 링크 이름
ru: Имя символической ссылки
zh_cn: 符号链接名称

source: The synopsis
ko: 시놉시스
ru: Синопсис
zh_cn: 概要

source: The syntax error message
ko: 구문 오류 메시지
ru: Сообщение об ошибке синтаксиса
zh_cn: 语法错误信息

source: The tag name
ko: 태그 이름
ru: Имя метки
zh_cn: 标签名称

source: The target URL
ko: 대상 URL
ru: Целевой URL-адрес
zh_cn: 目标URL

source: The target URL of the form
ko: 양식의 대상 URL
ru: Целевой URL-адрес формы
zh_cn: 形式的目标URL

source: The target directory
ko: 대상 디렉토리
ru: Целевая директория
zh_cn: 目标目录

source: The target file(s)
ko: 대상 파일
ru: Целевой(ые)файл(ы)
zh_cn: 目标文件

source: The target filename
ko: 대상 파일 이름
ru: Имя файла-объекта
zh_cn: 目标文件名

source: The target path
ko: 대상 경로
ru: Целевой путь
zh_cn: 目标路径

source: The target route
ko: 대상 노선
ru: Целевой маршрут
zh_cn: 目标路线

source: The target value
ko: 목표 값
ru: Целевое значение
zh_cn: 目标值

source: The target value may use magnitudes of kilobytes (k, ki), megabytes (m, mi), or gigabytes (g, gi). Those suffixed with an i use the appropriate 2**n version in accordance with the IEC standard: http://physics.nist.gov/cuu/Units/binary.html
ko: 목표 값은 킬로바이트 (k, ki), 메가 바이트 (m, mi) 또는 기가 바이트 (g, gi)의 크기를 사용할 수 있습니다. i 접미사가있는 경우 IEC 표준에 따라 적절한 2 ** n 버전을 사용합니다. http://physics.nist.gov/cuu/Units/binary.html
ru: В качестве целевого значения могут использоваться величины в килобайтах (k,ki),мегабайтах (m,mi)или гигабайтах (g,gi).Те,которые дополнены буквой "i",используют соответствующую версию 2**n в соответствии со стандартом МЭК:http://physics.nist.gov/cuu/Units/binary.html.
zh_cn: 目标值可使用千字节(k,ki)、兆字节(m,mi)或千兆字节(g,gi)的量级。后缀为i的,按照IEC标准使用相应的2**n版本:http://physics.nist.gov/cuu/Units/binary.html。

source: The template
ko: 템플릿
ru: Шаблон
zh_cn: 模板

source: The template content
ko: 템플릿 내용
ru: Содержание шаблона
zh_cn: 模板内容

source: The template for the error message
ko: 오류 메시지의 템플릿
ru: Шаблон сообщения об ошибке
zh_cn: 错误信息的模板

source: The template name
ko: 템플릿 이름
ru: Имя шаблона
zh_cn: 模板名称

source: The template name acts as a unique identifier for the template.
ko: 템플릿 이름은 템플릿의 고유 식별자 역할을합니다.
ru: Имя шаблона выступает в качестве уникального идентификатора шаблона.
zh_cn: 模板名称作为模板的唯一标识符。

source: The template to render
ko: 렌더링 할 템플릿
ru: Шаблон для визуализации
zh_cn: 要渲染的模板

source: The termination of the process can be awaited with wait().
ko: 프로세스 종료는 wait ()로 대기 할 수 있습니다.
ru: Завершение процесса можно ожидать с помощью функции wait().
zh_cn: 可以用wait()来等待进程的终止。

source: The tested form name
ko: 테스트 된 양식 이름
ru: Имя проверенной формы
zh_cn: 测试的表格名称

source: The text is displayed when the progress bar is rendered but only when the corresponding placeholder is part of the custom format line (by wrapping the name with %).
ko: 진행률 표시 줄이 렌더링 될 때 텍스트가 표시되지만 해당 자리 표시자가 사용자 지정 형식 행의 일부인 경우에만 (이름을 %로 줄임) 표시합니다.
ru: Текст отображается при отображении индикатора прогресса,но только в том случае,если соответствующий плацдарм является частью строки пользовательского формата (путем обертывания имени в %).
zh_cn: 渲染进度条时,会显示文本,但只有当相应的占位符是自定义格式行的一部分时,才会显示文本(通过用%包装名称)。

source: The text to associate with the placeholder
ko: 자리 표시 자와 연결할 텍스트
ru: Текст,ассоциируемый с владельцем
zh_cn: 要与占位符关联的文本

source: The text to humanize
ko: 인간화 할 텍스트
ru: Текст для гуманизации
zh_cn: 文字要人性化

source: The text to style
ko: 스타일을 지정할 텍스트
ru: Текст в стиле
zh_cn: 需要样式的文本

source: The theme format is "
ko: 테마 형식은 "
ru: Тематический формат-"
zh_cn: 主题格式为"

source: The theme to load the block from
ko: 블록을로드 할 테마
ru: Тема для загрузки блока из
zh_cn: 加载块的主题

source: The theme to load the block from. This parameter is passed by reference, because it might be necessary to initialize the theme first. Any changes made to this variable will be kept and be available upon further calls to this method using the same theme.
ko: 블록을로드 할 테마입니다. 테마를 먼저 초기화해야 할 수도 있으므로이 매개 변수는 참조로 전달됩니다. 이 변수에 대한 모든 변경 사항은 동일한 테마를 사용하여이 메서드를 추가로 호출 할 때 유지되며 사용할 수 있습니다.
ru: Тема для загрузки блока.Этот параметр передается по ссылке,так как сначала может потребоваться инициализировать тему.Любые изменения,внесенные в эту переменную,будут сохранены и доступны при последующих обращениях к этому методу с использованием той же самой темы.
zh_cn: 要加载块的主题。这个参数是通过引用传递的,因为可能需要先初始化主题。对这个变量所做的任何更改都将被保留,并在使用同一主题进一步调用本方法时可用。

source: The theme(s). The type of these themes is open to the implementation.
ko: 테마. 이러한 테마의 유형은 구현에 공개됩니다.
ru: Тема(ы).Тип этих тем открыт для реализации.
zh_cn: 主题。这些主题的类型由执行方决定。

source: The threshold for verbosity
ko: 자세한 정보의 임계 값
ru: Порог для многословия
zh_cn: 啰嗦的门槛

source: The thrown exception
ko: 던진 예외
ru: Брошенное исключение
zh_cn: 抛出的异常

source: The time
ko: 시간
ru: Время
zh_cn: 时间

source: The time (in milliseconds)
ko: 시간 (밀리 초)
ru: Время (в миллисекундах)
zh_cn: 时间(毫秒)

source: The time format
ko: 시간 형식
ru: Формат времени
zh_cn: 时间格式

source: The time the cookie expires
ko: 쿠키가 만료되는 시간
ru: Время истечения срока действия куки-файла
zh_cn: Cookie过期的时间

source: The time to wait between two UPDATED updates
ko: 두 개의 업데이트 된 업데이트 사이에 대기하는 시간
ru: Время ожидания между двумя UPDATED-обновлениями.
zh_cn: 两次更新之间的等待时间。

source: The time type used by the formatter
ko: 포맷터가 사용하는 시간 유형
ru: Тип времени,используемый форматировщиком
zh_cn: 格式化器使用的时间类型

source: The time zone ID string of the time zone to use. If NULL or the empty string, the default time zone for the runtime is used.
ko: 사용할 시간대의 시간대 ID 문자열입니다. NULL 또는 빈 문자열 인 경우 런타임의 기본 시간대가 사용됩니다.
ru: Строка идентификатора часового пояса.Если NULL или пустая строка,то используется часовой пояс по умолчанию.
zh_cn: 要使用的时区的ID字符串,如果是NULL或为空,则使用运行时的默认时区。如果为NULL或空,则使用运行时的默认时区。

source: The timeout in seconds
ko: 시간 초과
ru: Тайм-аут в секундах
zh_cn: 超时时间(秒)

source: The timeout in seconds or null if it's disabled
ko: 시간 초과 (초) 또는 비활성화 된 경우 null
ru: Таймаут в секундах или ноль,если он отключен.
zh_cn: 超时时间,以秒为单位,如果禁用则为空。

source: The timeout in seconds or null to disable
ko: 시간 초과 (초) 또는 비활성화하는 경우 null
ru: Таймаут в секундах или ноль для отключения
zh_cn: 要禁用的超时时间,以秒为单位或为空。

source: The timestamp at which the cache associated with this resource was created
ko: 이 자원과 연관된 캐시가 작성된 시간 소인
ru: Временная метка,на которой был создан кэш,связанный с этим ресурсом.
zh_cn: 创建与该资源相关的缓存的时间戳。

source: The timestamp to format
ko: 포맷 할 타임 스탬프
ru: Временная метка для форматирования
zh_cn: 要格式化的时间戳

source: The timezone identifier used by the formatter
ko: 포맷터가 사용하는 시간대 식별자
ru: Идентификатор часового пояса,используемый форматировщиком.
zh_cn: 格式化器使用的时区标识符。

source: The timezone to perform the date/time calculations
ko: 날짜 / 시간 계산을 수행하는 시간대
ru: Часовой пояс для выполнения расчетов даты/времени.
zh_cn: 执行日期/时间计算的时区。

source: The timezone used by the formatter
ko: 포맷터가 사용하는 시간대
ru: Часовой пояс,используемый форматировщиком
zh_cn: 格式化器使用的时区

source: The token
ko: 토큰
ru: Символ
zh_cn: 纪念品

source: The token ID
ko: 토큰 ID
ru: Идентификатор токена
zh_cn: 令牌ID

source: The token ID. You may choose an arbitrary value for the ID
ko: 토큰 ID ID에 임의의 값을 선택할 수 있습니다
ru: Жетонное удостоверение личности.Вы можете выбрать произвольное значение для ID
zh_cn: 令牌ID。您可以为ID选择一个任意的值。

source: The token attributes
ko: 토큰 속성
ru: Жетонные атрибуты
zh_cn: 代币属性

source: The token used by the guard auth system before authentication.
ko: 인증 전에 가드 인증 시스템에서 사용하는 토큰입니다.
ru: Токен,используемый системой автосекретаря перед аутентификацией.
zh_cn: 守卫认证系统在认证前使用的令牌。

source: The token value
ko: 토큰 가치
ru: Символическая стоимость
zh_cn: 代币价值

source: The tokens
ko: 토큰
ru: Жетоны
zh_cn: 代币

source: The touch time as a Unix timestamp
ko: 유닉스 타임 스탬프로서의 터치 시간
ru: Время прикосновения в качестве временной метки Unix.
zh_cn: 触摸时间为Unix时间戳。

source: The transform method of the transformer is used to convert data from the model to the normalized format. The reverseTransform method of the transformer is used to convert from the normalized to the model format.
ko: 변환기의 변환 방법은 데이터를 모델에서 정규화 된 형식으로 변환하는 데 사용됩니다. 변환기의 reverseTransform 메소드는 정규화 된 형식에서 모델 형식으로 변환하는 데 사용됩니다.
ru: Метод преобразования трансформатора используется для преобразования данных из модели в нормализованный формат.Метод обратного преобразования трансформатора используется для преобразования данных из нормализованного в модельный формат.
zh_cn: 变换器的变换方法用于将数据从模型转换为归一化格式。变换器的reverseTransform方法用于将数据从归一化格式转换为模型格式。

source: The transform method of the transformer is used to convert data from the normalized to the view format. The reverseTransform method of the transformer is used to convert from the view to the normalized format.
ko: 변환기의 변환 방법은 데이터를 정규화에서보기 형식으로 변환하는 데 사용됩니다. 변환기의 reverseTransform 메소드는보기에서 정규화 된 형식으로 변환하는 데 사용됩니다.
ru: Метод преобразования трансформатора используется для преобразования данных из нормализованного в формат представления.Метод обратного преобразования трансформатора используется для преобразования данных из представления в нормализованный формат.
zh_cn: 变换器的transform方法用于将数据从归一化格式转换为视图格式。变换器的reverseTransform方法用于将视图格式转换为归一化格式。

source: The transformation failure
ko: 변형 실패
ru: Провал трансформации
zh_cn: 转型失败

source: The transformers receive the value in the reverse order as they were passed to the constructor. Each transformer receives the result of the previous transformer as input. The output of the last transformer is returned by this method.
ko: 변환기는 생성자에게 전달 될 때 역순으로 값을받습니다. 각 변압기는 이전 변압기의 결과를 입력으로받습니다. 마지막 트랜스포머의 출력은이 방법으로 반환됩니다.
ru: Трансформаторы получают значение в обратном порядке по мере их передачи конструктору.Каждый трансформатор получает на вход результат предыдущего.Выход последнего трансформатора возвращается этим методом.
zh_cn: 变换器按照传递给构造函数的相反顺序接收值。每个变换器都接收前一个变换器的结果作为输入。最后一个变换器的输出由该方法返回。

source: The transformers receive the value in the same order as they were passed to the constructor. Each transformer receives the result of the previous transformer as input. The output of the last transformer is returned by this method.
ko: 변환기는 생성자에게 전달 된 순서와 동일한 순서로 값을받습니다. 각 변압기는 이전 변압기의 결과를 입력으로받습니다. 마지막 트랜스포머의 출력은이 방법으로 반환됩니다.
ru: Трансформаторы получают значение в том же порядке,в котором оно было передано конструктору.Каждый трансформатор получает на вход результат предыдущего.Выход последнего трансформатора возвращается этим методом.
zh_cn: 变换器接收值的顺序与传递给构造函数的顺序相同。每个变换器都接收前一个变换器的结果作为输入。最后一个变换器的输出由该方法返回。

source: The translated error message
ko: 번역 된 오류 메시지
ru: Переведенное сообщение об ошибке
zh_cn: 翻译后的错误信息

source: The translated string
ko: 번역 된 문자열
ru: Переведённая строка
zh_cn: 翻译后的字符串

source: The translation domain
ko: 번역 도메인
ru: Область перевода
zh_cn: 翻译领域

source: The translation domain for translating
ko: 번역을위한 번역 도메인
ru: Область перевода для перевода
zh_cn: 翻译领域的翻译

source: The translation domain of the violation messages
ko: 위반 메시지의 번역 도메인
ru: Домен перевода сообщений о нарушении
zh_cn: 违规信息的翻译域

source: The translation domain to use for translating violation messages
ko: 위반 메시지를 번역하는 데 사용할 번역 도메인
ru: Домен перевода,используемый для перевода сообщений о нарушениях.
zh_cn: 用于翻译违规信息的翻译域。

source: The translator
ko: 번역가
ru: Переводчик
zh_cn: 译者

source: The translator for translating error messages
ko: 오류 메시지 번역을위한 번역기
ru: Переводчик для перевода сообщений об ошибках
zh_cn: 翻译错误信息的翻译器

source: The translator must implement TranslatorBagInterface
ko: 번역기는 TranslatorBagInterface를 구현해야합니다.
ru: Переводчик должен реализовать интерфейс TranslatorBagInterface.
zh_cn: 译者必须实现 TranslatorBagInterface

source: The traversal strategy
ko: 순회 전략
ru: Стратегия обхода
zh_cn: 遍历策略

source: The traversal strategy is ignored for arrays. Arrays are always iterated.
ko: 순회 전략은 배열에 대해 무시됩니다. 배열은 항상 반복됩니다.
ru: Стратегия обхода игнорируется для массивов.Массивы всегда итерируются.
zh_cn: 对数组来说,遍历策略是被忽略的。数组总是迭代的。

source: The tree builder
ko: 트리 빌더
ru: Деревостроитель
zh_cn: 建树者

source: The two catalogues must have the same locale.
ko: 두 카탈로그는 동일한 로케일을 가져야합니다.
ru: Оба каталога должны иметь одну и ту же локаль.
zh_cn: 两个目录必须有相同的地域。

source: The two methods can also be mixed: {0} There are no apples|one: There is one apple|more: There are %count% apples
ko: 두 가지 방법을 혼합 할 수도 있습니다 : {0} 사과 없음 | 하나 : 사과가 하나 있습니다 | 더보기 : 사과 % count %가 있습니다
ru: Эти два метода также можно смешать:{0}Нет apples|one:Есть один apple|more:Есть%-ные яблоки
zh_cn: 这两种方法也可以混合使用:{0}没有苹果|一个。有一个苹果|更多。有%count%的苹果

source: The type
ko: 유형
ru: Тип
zh_cn: 类型

source: The type extensions that the extension should support
ko: 확장이 지원해야하는 형식 확장
ru: Расширения типа,которые должно поддерживать расширение
zh_cn: 该扩展应支持的类型扩展

source: The type guesser
ko: 타입 추측
ru: Типографский угадайщик
zh_cn: 类型猜测器

source: The type guessers
ko: 타입 추측
ru: Типографские шрифты
zh_cn: 类型猜测器

source: The type is the PHP class in 5.5+ and additionally the basic type in PHP 7.0+.
ko: 이 유형은 5.5 이상의 PHP 클래스이며 PHP 7.0 이상의 기본 유형입니다.
ru: Типом является класс PHP в версии 5.5+и дополнительно базовый тип в PHP 7.0+.
zh_cn: 该类型是5.5+中的PHP类,另外也是PHP7.0+中的基本类型。

source: The type of Content-Disposition to set automatically with the filename
ko: 파일 이름으로 자동 설정할 Content-Disposition 유형
ru: Тип Content-Disposition,который должен автоматически устанавливаться с именем файла
zh_cn: 用文件名自动设置的内容-位置类型

source: The type of compiler pass
ko: 컴파일러 패스의 유형
ru: Тип передачи компилятора
zh_cn: 编译器通行证的类型

source: The type of node
ko: 노드의 유형
ru: Тип узла
zh_cn: 节点类型

source: The type of reference to be generated (one of the constants)
ko: 생성 될 참조 유형 (상수 중 하나)
ru: Тип генерируемой ссылки (одна из констант)
zh_cn: 要生成的引用类型(常量之一)。

source: The type of resource
ko: 자원의 종류
ru: Вид ресурса
zh_cn: 资源类型

source: The type of style being applied
ko: 적용되는 스타일의 유형
ru: Тип применяемого стиля
zh_cn: 所应用的风格类型

source: The type of the file as provided by PHP; null defaults to application/octet-stream
ko: PHP가 제공 한 파일의 유형. null의 기본값은 application / octet-stream입니다.
ru: Тип файла,предоставляемый PHP;нулевые значения по умолчанию для приложения/октет-потока
zh_cn: PHP提供的文件类型,空值默认为application/octet-stream。

source: The type of the form
ko: 양식의 유형
ru: Тип формы
zh_cn: 表格的类型

source: The type of the form or null if name is a property
ko: 폼의 타입. name이 프로퍼티 인 경우는 null
ru: Тип формы или ноль,если имя является собственностью
zh_cn: 表格的类型,如果name是一个属性,则为空。

source: The type of the node
ko: 노드의 유형
ru: Тип узла
zh_cn: 节点的类型

source: The type of the pass
ko: 패스의 종류
ru: Тип пропуска
zh_cn: 通行证的类型

source: The type of the request (one of HttpKernelInterface::MASTER_REQUEST or HttpKernelInterface::SUB_REQUEST)
ko: 요청 유형 (HttpKernelInterface :: MASTER_REQUEST 또는 HttpKernelInterface :: SUB_REQUEST 중 하나)
ru: Тип запроса (один из HttpKernelInterface::MASTER_REQUEST или HttpKernelInterface::SUB_REQUEST)
zh_cn: 请求的类型(HttpKernelInterface::MASTER_REQUEST或HttpKernelInterface::SUB_REQUEST中的一种)

source: The type of the resource is decided by the implementation. The resource is later passed to {@link renderBlock()} by the rendering algorithm.
ko: 자원의 유형은 구현에 의해 결정됩니다. 리소스는 나중에 렌더링 알고리즘에 의해 {@link renderBlock ()}으로 전달됩니다.
ru: Вид ресурса определяется реализацией.В дальнейшем ресурс передается в {@link renderBlock()}по алгоритму рендеринга.
zh_cn: 资源的类型由实现决定。该资源随后被渲染算法传递给{@link renderBlock()}。

source: The type of the root node
ko: 루트 노드의 유형
ru: Тип корневого узла
zh_cn: 根节点的类型

source: The type of the token (self::*_TYPE)
ko: 토큰의 유형 (self :: * _ TYPE)
ru: Тип токена (self::*_TYPE)
zh_cn: 标记的类型 (self::*_TYPE)

source: The type of the value
ko: 값의 유형
ru: Тип значения
zh_cn: 值的类型

source: The type to test
ko: 테스트 할 유형
ru: Тип для проверки
zh_cn: 要测试的类型

source: The types are merged with the allowed types defined previously.
ko: 유형은 이전에 정의 된 허용 유형과 병합됩니다.
ru: Типы объединяются с разрешенными типами,определенными ранее.
zh_cn: 这些类型与之前定义的允许类型合并。

source: The types that the extension should support
ko: 확장이 지원해야하는 유형
ru: Типы,которые должны поддерживаться расширением
zh_cn: 扩展应该支持的类型

source: The underscored string
ko: 밑줄이 그어진 문자열
ru: Подчёркнутая струна
zh_cn: 下划线的字符串

source: The unescaped string
ko: 이스케이프 처리되지 않은 문자열
ru: Неоформленная строка
zh_cn: 未封装的字符串

source: The unexpected value found while traversing property path
ko: 특성 경로를 순회하는 중에 발견 된 예기치 않은 값
ru: Неожиданное значение,найденное во время путешествия по имущественному пути
zh_cn: 遍历属性路径时发现的意外值。

source: The unique id of the firewall
ko: 방화벽의 고유 ID
ru: Уникальный идентификатор брандмауэра
zh_cn: 防火墙的唯一ID

source: The upload error
ko: 업로드 오류
ru: Ошибка загрузки
zh_cn: 上传错误

source: The url to redirect to
ko: 리디렉션 할 URL
ru: Урл перенаправить на
zh_cn: 重定向到的网址

source: The usage, it'll be prefixed with the command name
ko: 사용법은 명령 이름이 앞에 붙습니다.
ru: Использование,оно будет префиксом с именем команды.
zh_cn: 使用方法,会在命令名称前加上

source: The user
ko: 사용자
ru: Пользователь
zh_cn: 用户

source: The user answer
ko: 사용자 답변
ru: Ответ пользователя
zh_cn: 用户回答

source: The user array is a hash where the keys are usernames and the values are an array of attributes: 'password', 'enabled', and 'roles'.
ko: 사용자 배열은 키가 사용자 이름이고 값이 속성의 배열 인 'password', 'enabled'및 'roles'인 해시입니다.
ru: Массив пользователей-это хэш,где ключами являются имена пользователей,а значения-массив атрибутов:"пароль","включено" и "роли".
zh_cn: 用户数组是一个哈希,其中键是用户名,值是属性数组。'password','enabled',and 'roits'.

source: The user can be a UserInterface instance, or an object implementing a __toString method or the username as a regular string
ko: 사용자는 UserInterface 인스턴스이거나 __toString 메서드 또는 사용자 이름을 일반 문자열로 구현하는 객체 일 수 있습니다.
ru: Пользователь может быть экземпляром UserInterface,или объектом,реализующим метод __toString,или именем пользователя в виде обычной строки
zh_cn: 用户可以是一个UserInterface实例,或者是一个实现了__toString方法的对象,或者是一个常规字符串的用户名。

source: The user can be a UserInterface instance, or an object implementing a __toString method or the username as a regular string.
ko: 사용자는 UserInterface 인스턴스이거나 __toString 메서드 또는 사용자 이름을 일반 문자열로 구현하는 객체 일 수 있습니다.
ru: Пользователь может быть экземпляром UserInterface,или объектом,реализующим метод __toString,или именем пользователя в виде обычной строки.
zh_cn: 用户可以是一个UserInterface实例,或者是一个实现了__toString方法的对象,或者是一个常规字符串的用户名。

source: The user credentials
ko: 사용자 자격 증명
ru: Реквизиты пользователя
zh_cn: 用户证书

source: The user defined PHP callback
ko: 사용자 정의 PHP 콜백
ru: Определенный пользователем обратный вызов PHP
zh_cn: 用户定义的PHP回调

source: The user of this class is responsible for assigning string values to the choices. Both the choices and their values are passed to the constructor. Each choice must have a corresponding value (with the same array key) in the value array.
ko: 이 클래스의 사용자는 선택 사항에 문자열 값을 지정해야합니다. 선택 사항과 해당 값이 생성자에 전달됩니다. 각 선택 항목은 값 배열에 해당 값 (같은 배열 키 사용)이 있어야합니다.
ru: Пользователь этого класса отвечает за присвоение строковых значений вариантам выбора.Как варианты,так и их значения передаются конструктору.Каждый выбор должен иметь соответствующее значение (с одним и тем же ключом массива)в массиве значений.
zh_cn: 该类的用户负责为选择分配字符串值。选择和它们的值都会传递给构造函数。每个选择必须在值数组中有一个对应的值(具有相同的数组键)。

source: The user provider
ko: 사용자 제공자
ru: Поставщик услуг
zh_cn: 用户提供者

source: The user roles
ko: 사용자 역할
ru: Пользовательские роли
zh_cn: 用户角色

source: The user session from which the session ID is returned
ko: 세션 ID가 리턴되는 사용자 세션
ru: Сессия пользователя,с которой возвращается идентификатор сессии.
zh_cn: 返回会话ID的用户会话。

source: The user!
ko: 사용자!
ru: Пользователь!
zh_cn: 用户!

source: The user's DN
ko: 사용자의 DN
ru: DN пользователя
zh_cn: 用户的DN

source: The username
ko: 사용자 이름
ru: Имя пользователя
zh_cn: 用户名

source: The username (like a nickname, email address, etc.), or a UserInterface instance or an object implementing a __toString method
ko: 사용자 이름 (닉네임, 이메일 주소 등) 또는 UserInterface 인스턴스 또는 __toString 메소드를 구현하는 객체
ru: Имя пользователя (например,ник,адрес электронной почты и т.д.),или экземпляр UserInterface,или объект,реализующий метод __toString.
zh_cn: 用户名(如昵称、电子邮件地址等),或一个UserInterface实例或一个实现__toString方法的对象。

source: The username to retrieve
ko: 검색 할 사용자 이름
ru: Имя пользователя для получения
zh_cn: 要检索的用户名

source: The valid names is an array where the values are the names that the user can use in an expression.
ko: 유효한 이름은 값이 사용자가 표현식에서 사용할 수있는 이름 인 배열입니다.
ru: Валидные имена-это массив,где значения-это имена,которые пользователь может использовать в выражении.
zh_cn: 有效名称是一个数组,其中的值是用户可以在表达式中使用的名称。

source: The validated constraint
ko: 검증 된 제약
ru: Утвержденное ограничение
zh_cn: 审定的约束条件

source: The validated group
ko: 검증 된 그룹
ru: Утвержденная группа
zh_cn: 审定组

source: The validated input
ko: 검증 된 입력
ru: Утвержденный вход
zh_cn: 经过验证的输入

source: The validated value
ko: 검증 된 가치
ru: Утвержденное значение
zh_cn: 审定值

source: The validation group
ko: 검증 그룹
ru: Группа проверки
zh_cn: 审定组

source: The validation groups to validate. If none is given, "Default" is assumed
ko: 검증 할 검증 그룹. 아무 것도 지정하지 않으면 "기본값"으로 가정
ru: Группы проверки для проверки.Если ни одна из них не указана,то предполагается,что "по умолчанию".
zh_cn: 要验证的验证组。如果没有给出任何验证组,则假定为 "默认"。

source: The validation metadata
ko: 유효성 검사 메타 데이터
ru: Метаданные валидации
zh_cn: 验证元数据

source: The validator
ko: 유효성 검사기
ru: Валидатор
zh_cn: 验证器

source: The validator for that context
ko: 해당 컨텍스트에 대한 유효성 검증기
ru: Валидатор для этого контекста
zh_cn: 该上下文的验证器
