Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/symfony/symfony.*.028.xlf
Languages: ko, ru, zh_cn

source: The path info to be parsed (raw format, i.e. not urldecoded)
ko: 파싱 ​​할 경로 정보 (예 : URL 디코딩되지 않은 형식)
ru: Информация о пути,который необходимо разобрать (необработанный формат,т.е.не urldecoded)
zh_cn: 要解析的路径信息(原始格式,即非urldecoded)

source: The path info to redirect to
ko: 리디렉션 할 경로 정보
ru: Информация о пути для перенаправления на
zh_cn: 要重定向到的路径信息

source: The path length
ko: 경로 길이
ru: Длина пути
zh_cn: 路径长度

source: The path of the XML file
ko: XML 파일의 경로
ru: Путь к файлу XML
zh_cn: XML文件的路径

source: The path of the asset
ko: 자산의 경로
ru: Путь актива
zh_cn: 资产的路径

source: The path on the server in which the cookie will be available on
ko: 쿠키를 사용할 수있는 서버의 경로
ru: Путь на сервере,на котором будет доступен cookie-файл.
zh_cn: 在服务器上的路径,其中cookie将可在

source: The path pattern
ko: 경로 패턴
ru: Шаблон пути
zh_cn: 路径模式

source: The path pattern to match
ko: 일치하는 경로 패턴
ru: Шаблон пути для соответствия
zh_cn: 要匹配的路径模式

source: The path should always be returned as a Unix path (with /).
ko: 경로는 항상 /로 유닉스 경로로 반환되어야합니다.
ru: Путь всегда должен возвращаться в виде Unix-пути (с /).
zh_cn: 路径应该总是以Unix路径的形式返回(用/)。

source: The path that starts the logout process
ko: 로그 아웃 프로세스를 시작하는 경로
ru: Путь,который запускает процесс выхода из системы
zh_cn: 启动注销流程的路径

source: The path that triggers this listener
ko: 이 리스너를 트리거하는 경로
ru: Путь,который запускает этот слушатель
zh_cn: 触发该监听器的路径

source: The path the global resource directory
ko: 글로벌 자원 디렉토리의 경로
ru: Путь к глобальному каталогу ресурсов
zh_cn: 全局资源目录的路径

source: The path to append
ko: 추가 할 경로
ru: Путь к приложению
zh_cn: 附加的路径

source: The path to initially store in the builder. Optional.
ko: 빌더에 처음 저장할 경로입니다. 선택 과목.
ru: Путь к первоначальному хранению в застройщике.Необязательно.
zh_cn: 初始存储在构建器中的路径。可选。

source: The path to insert
ko: 삽입 할 경로
ru: Путь для вставки
zh_cn: 插入的路径

source: The path to the YAML file to be parsed
ko: 파싱 ​​할 YAML 파일의 경로
ru: Путь к YAML-файлу для разбора
zh_cn: 要解析的YAML文件的路径。

source: The path to the accessed file
ko: 액세스 한 파일의 경로
ru: Путь к открытому файлу
zh_cn: 访问文件的路径

source: The path to the directory containing the .res files
ko: .res 파일을 포함하는 디렉토리의 경로
ru: Путь к директории,содержащей файлы .res
zh_cn: 包含.res文件的目录路径。

source: The path to the file
ko: 파일의 경로
ru: Путь к файлу
zh_cn: 文件的路径

source: The path to the file that was not found
ko: 찾을 수없는 파일의 경로
ru: Путь к файлу,который не был найден
zh_cn: 未找到的文件的路径

source: The path to the login form
ko: 로그인 양식의 경로
ru: Путь к форме входа
zh_cn: 登录表格的路径

source: The path to the mapping file
ko: 매핑 파일의 경로
ru: Путь к картографическому файлу
zh_cn: 映射文件的路径

source: The path to the resource bundle
ko: 자원 번들의 경로
ru: Путь к ресурсному пакету
zh_cn: 资源包的路径

source: The path to the template file
ko: 템플릿 파일의 경로
ru: Путь к файлу шаблона
zh_cn: 模板文件的路径

source: The paths to the mapping files
ko: 매핑 파일의 경로
ru: Пути к картографическим файлам
zh_cn: 映射文件的路径

source: The pattern
ko: 패턴
ru: Образец
zh_cn: 模式

source: The pattern contains the placeholder "{{ widget }}" where the HTML tag should be inserted
ko: 패턴에 HTML 태그를 삽입해야하는 자리 표시 자 "{{widget}}"이 (가) 있습니다.
ru: В шаблоне содержится закладка "{{виджет }}",в которую необходимо вставить HTML-тег
zh_cn: 该模式包含占位符"{{widget }}",HTML标签应插入其中。

source: The pattern string used by the formatter
ko: 포맷터가 사용하는 패턴 문자열
ru: Строка шаблона,используемая форматировщиком
zh_cn: 格式化器使用的模式字符串

source: The pattern string used by the formatter or false on error
ko: 포맷터에서 사용하는 패턴 문자열 또는 오류시 false
ru: Строка шаблона,используемая форматировщиком или ложь при ошибке
zh_cn: 格式化器使用的模式字符串或错误时为false。

source: The pattern to be used to format and/or parse values
ko: 값을 형식화 및 / 또는 구문 분석하는 데 사용되는 패턴
ru: Шаблон,который будет использоваться для форматирования и/или разбора значений
zh_cn: 用于格式化和/或解析值的模式。

source: The pattern to create the reverse matching regular expression
ko: 역 일치 정규식을 작성하는 패턴
ru: Шаблон для создания обратного совпадения регулярного выражения
zh_cn: 创建反向匹配正则表达式的模式

source: The period duration (in milliseconds)
ko: 기간 (밀리 초)
ru: Продолжительность периода (в миллисекундах)
zh_cn: 期间持续时间(毫秒)

source: The placeholder name (including the delimiter char like %)
ko: 자리 표시 자 이름 (%와 같은 구분 문자 포함)
ru: Имя владельца (включая разделительную символику типа %)
zh_cn: 占位符名称(包括定界符如%)。

source: The plural form of the key if it is irregular
ko: 불규칙한 경우 복수 형태의 키
ru: Множественная форма ключа,если она нерегулярна.
zh_cn: 钥匙的复数形式,如果它是不规则的。

source: The plural of the key for irregular plurals
ko: 불규칙 복수형의 열쇠 복수
ru: Множественное число клавиши для неправильного множественного числа
zh_cn: 不规则复数的钥匙的复数。

source: The plural of the key in case of irregular plural
ko: 불규칙 복수의 경우 키의 복수
ru: Множественное число ключа в случае неправильного множественного числа
zh_cn: 在不规则复数的情况下,钥匙的复数。

source: The plural position
ko: 복수 위치
ru: Множественное число
zh_cn: 复数位置

source: The pool where runtime-discovered metadata are cached
ko: 런타임 감지 메타 데이터가 캐시되는 풀
ru: Бассейн,в котором кэшируются метаданные,обнаруженные во время выполнения программы.
zh_cn: 缓存运行时发现的元数据的池。

source: The port name will be appended to the host if it's non-standard.
ko: 포트 이름이 표준이 아닌 경우 호스트에 추가됩니다.
ru: Имя порта будет добавлено к хосту,если он нестандартный.
zh_cn: 如果端口名是非标准的,则会附加到主机上。

source: The position
ko: 위치
ru: Положение
zh_cn: 职务

source: The possible configurations and use-cases: - setStrictRequirements(true): Throw an exception for mismatching requirements. This is mostly useful in development environment. - setStrictRequirements(false): Don't throw an exception but return null as URL for mismatching requirements and log the problem. Useful when you cannot control all params because they come from third party libs but don't want to have a 404 in production environment. It should log the mismatch so one can review it. - setStrictRequirements(null): Return the URL with the given parameters without checking the requirements at all. When generating a URL you should either trust your params or you validated them beforehand because otherwise it would break your link anyway. So in production environment you should know that params always pass the requirements. Thus this option allows to disable the check on URL generation for performance reasons (saving a preg_match for each requirement every time a URL is generated).
ko: 가능한 구성 및 사용 사례 :-setStrictRequirements (true) : 불일치 요구 사항에 대한 예외를 발생시킵니다. 이것은 대부분 개발 환경에서 유용합니다. -setStrictRequirements (false) : 예외를 발생시키지 않고 일치하지 않는 요구 사항에 대한 URL로 널을 리턴하고 문제점을 로그하십시오. 모든 라이브러리를 써드 파티 라이브러리에서 가져 오지만 프로덕션 환경에서 404를 원하지 않기 때문에 모든 매개 변수를 제어 할 수 없을 때 유용합니다. 불일치를 기록하여 검토 할 수 있도록해야합니다. -setStrictRequirements (null) : 요구 사항을 전혀 확인하지 않고 주어진 매개 변수가있는 URL을 반환합니다. URL을 생성 할 때 매개 변수를 신뢰하거나 미리 확인해야합니다. 그렇지 않으면 링크가 손상 될 수 있습니다. 따라서 프로덕션 환경에서는 매개 변수가 항상 요구 사항을 통과한다는 것을 알아야합니다.따라서이 옵션을 사용하면 성능상의 이유로 URL 생성 확인을 비활성화 할 수 있습니다 (URL이 생성 될 때마다 각 요구 사항에 대해 preg_match 저장).
ru: Возможные конфигурации и примеры использования:-setStrictRequirements(true):Бросьте исключение для несоответствия требований.В основном это полезно в среде разработки.-setStrictRequirements(false):Не бросайте исключение,а возвращайте ноль в качестве URL для несоответствия требованиям и запишите проблему в журнал.Полезно,когда вы не можете контролировать все параметры,потому что они исходят из libs сторонних производителей,но не хотите иметь 404 в производственном окружении.Он должен записывать несоответствие в журнал,чтобы можно было его просмотреть.-setStrictRequirements(null):Возвращает URL с заданными параметрами без проверки требований.При генерации URL вы должны либо доверять вашим параметрам,либо проверять их заранее,потому что в противном случае это все равно разорвет вашу ссылку.Поэтому в производственном окружении вы должны знать,что параметры всегда передают требования.Таким образом,эта опция позволяет отключить проверку генерации URL по причинам производительности (сохранение preg_match для каждого требования каждый раз,когда генерируется URL).
zh_cn: 可能的配置和用例:-setStrictRequirements(true)。对不匹配的需求抛出一个异常。这在开发环境中很有用。-setStrictRequirements(false):不抛出异常,但返回空值。不抛出异常,但对不匹配的需求返回null作为URL并记录问题。当你不能控制所有的参数时很有用,因为它们来自第三方库,但又不想在生产环境中出现404。它应该记录不匹配的情况,以便人们可以检查它。-setStrictRequirements(null):返回带有给定参数的URL,完全不检查需求。当生成一个URL时,你应该相信你的参数,或者你事先验证了它们,因为否则它会破坏你的链接。所以在生产环境中,你应该知道参数总是通过需求。因此,这个选项允许为了性能原因而禁用URL生成的检查(每次生成URL时都要为每个需求保存一个preg_match)。

source: The preferred choices
ko: 선호하는 선택
ru: Предпочтительные варианты
zh_cn: 优先选择

source: The preferred choices can also be passed as array. Each choice that is contained in that array will be marked as preferred.
ko: 선호하는 선택은 배열로 전달 될 수도 있습니다. 해당 배열에 포함 된 각 선택 항목이 기본 설정으로 표시됩니다.
ru: Предпочтительные варианты также могут передаваться в виде массива.Каждый выбор,содержащийся в этом массиве,будет помечен как предпочтительный.
zh_cn: 优先选择也可以以数组形式传递。该数组中包含的每个选择都将被标记为首选。

source: The preferred locale
ko: 선호하는 로케일
ru: Предпочитаемое место
zh_cn: 首选地点

source: The prefix
ko: 접두사
ru: Приставка
zh_cn: 前缀

source: The prefix for error output
ko: 오류 출력의 접두사
ru: Префикс для вывода ошибок
zh_cn: 错误输出的前缀

source: The prefix for output
ko: 출력 접두사
ru: Префикс для вывода
zh_cn: 输出的前缀

source: The prefix for the block
ko: 블록의 접두사
ru: Префикс для блока
zh_cn: 块的前缀

source: The prefix for the end output
ko: 최종 출력의 접두사
ru: Префикс для конечного выхода
zh_cn: 终端输出的前缀

source: The prefix of the generated temporary filename Note: Windows uses only the first three characters of prefix
ko: 생성 된 임시 파일 이름의 접두사 참고 : Windows는 접두사의 처음 세 문자 만 사용합니다.
ru: Префикс генерируемого временного имени файла Примечание:Windows использует только первые три символа префикса
zh_cn: 生成的临时文件名的前缀 注意:Windows只使用前缀的前三个字符。

source: The prefix of the template block name
ko: 템플릿 블록 이름의 접두사
ru: Префикс имени блока шаблона
zh_cn: 模板块名称的前缀

source: The prefix to use
ko: 사용할 접두사
ru: Префикс для использования
zh_cn: 要使用的前缀

source: The prefix used for all identifiers managed by this pool
ko: 이 풀에서 관리하는 모든 식별자에 사용되는 접두사
ru: Префикс,используемый для всех идентификаторов,управляемых этим пулом
zh_cn: 用于该池管理的所有标识符的前缀。

source: The prepended HTML string
ko: 앞에 붙인 HTML 문자열
ru: Предписываемая HTML-строка
zh_cn: 前面的HTML字符串

source: The presence of parameter in container
ko: 컨테이너에 매개 변수가 있음
ru: Наличие параметра в контейнере
zh_cn: 容器中存在参数

source: The previous charset
ko: 이전 문자셋
ru: Предыдущая таблица
zh_cn: 以前的字符集

source: The previous exception
ko: 이전 예외
ru: Предыдущее исключение
zh_cn: 以前的例外

source: The previous exception handler
ko: 이전 예외 처리기
ru: Предыдущий обработчик исключений
zh_cn: 以前的异常处理程序

source: The previous exception handler if any
ko: 이전 예외 핸들러 (있는 경우)
ru: Предыдущий обработчик исключений,если таковой имел место
zh_cn: 之前的异常处理程序(如果有的话)。

source: The previous file link format
ko: 이전 파일 링크 형식
ru: Предыдущий формат ссылки на файл
zh_cn: 以前的文件链接格式

source: The previous indent pad
ko: 이전 들여 쓰기 패드
ru: Предыдущий отпечаток
zh_cn: 以前的缩进垫

source: The previous map
ko: 이전지도
ru: Предыдущая карта
zh_cn: 上一张地图

source: The previous output destination
ko: 이전 출력 대상
ru: Предыдущее место назначения выхода
zh_cn: 前一个输出目的地

source: The previous value
ko: 이전 값
ru: Предыдущее значение
zh_cn: 前值

source: The priority of decoration
ko: 장식의 우선 순위
ru: Приоритет декорирования
zh_cn: 装修的优先权

source: The priority of the listener. Listeners with a higher priority are called before listeners with a lower priority.
ko: 리스너의 우선 순위. 우선 순위가 높은 리스너가 우선 순위가 낮은 리스너보다 먼저 호출됩니다.
ru: Приоритет слушателя.Слушатели с более высоким приоритетом вызываются перед слушателями с более низким приоритетом.
zh_cn: 监听者的优先级。优先级较高的监听者在优先级较低的监听者之前被调用。

source: The process error output
ko: 프로세스 오류 출력
ru: Вывод ошибки процесса
zh_cn: 过程错误输出

source: The process error output since the last call
ko: 마지막 호출 이후 프로세스 오류 출력
ru: Вывод ошибки процесса с момента последнего вызова
zh_cn: 自上次调用后的过程错误输出

source: The process id if running, null otherwise
ko: 실행중인 경우 프로세스 ID, 그렇지 않은 경우 null
ru: Идентификатор процесса,если он запущен,ноль в противном случае
zh_cn: 正在运行的进程ID,否则为空

source: The process output
ko: 프로세스 출력
ru: Выход процесса
zh_cn: 过程输出

source: The process output since the last call
ko: 마지막 호출 이후 프로세스 출력
ru: Вывод процесса с момента последнего вызова
zh_cn: 自上次调用后的进程输出

source: The process that ran
ko: 실행 된 프로세스
ru: Процесс,который прошел
zh_cn: 运行的进程

source: The process title
ko: 프로세스 제목
ru: Название процесса
zh_cn: 流程标题

source: The processed configuration
ko: 처리 된 구성
ru: Обработанная конфигурация
zh_cn: 处理后的配置

source: The processed help for the command
ko: 명령에 대한 처리 된 도움말
ru: Обработанная помощь для команды
zh_cn: 命令的处理帮助

source: The processed value
ko: 가공 가치
ru: Обработанное значение
zh_cn: 处理值

source: The profile associated with token
ko: 토큰과 관련된 프로필
ru: Профиль,связанный с токеном
zh_cn: 与代币相关的资料

source: The profile filename
ko: 프로필 파일 이름
ru: Фамилия профиля
zh_cn: 档案文件名

source: The profiler token
ko: 프로파일 러 토큰
ru: Жетон профайлера
zh_cn: 剖析师令牌

source: The project root dir
ko: 프로젝트 루트 디렉토리
ru: Корневой грязь проекта
zh_cn: 项目根目录

source: The project root directory
ko: 프로젝트 루트 디렉토리
ru: Корневая директория проекта
zh_cn: 项目根目录

source: The properties to serialize
ko: 직렬화 할 속성
ru: Свойства для сериализации
zh_cn: 要序列化的属性

source: The property for which to find constraints
ko: 제약 조건을 찾을 속성
ru: Имущество,для которого можно найти ограничения
zh_cn: 寻找约束条件的属性

source: The property name
ko: 속성 이름
ru: Имя собственности
zh_cn: 物业名称

source: The property name or null, if no property name could be found
ko: 프로퍼티 명. 프로퍼티 명이없는 경우는 null
ru: Имя собственности или ноль,если имя собственности не может быть найдено.
zh_cn: 属性名称,如果找不到属性名称,则为空。

source: The property path
ko: 속성 경로
ru: Путь к собственности
zh_cn: 属性路径

source: The property path as string
ko: 문자열로 속성 경로
ru: Путь к свойствам как строка
zh_cn: 属性路径为字符串

source: The property path as string or instance
ko: 문자열 또는 인스턴스로서의 속성 경로
ru: Путь к свойствам как строка или экземпляр
zh_cn: 属性路径为字符串或实例

source: The property path from the root value to the invalid value
ko: 루트 값에서 유효하지 않은 값으로의 특성 경로
ru: Путь к свойству от корневого значения до недействительного значения
zh_cn: 从根值到无效值的属性路径。

source: The property path index when the unexpected value was found
ko: 예상치 못한 값이 발견 될 때 특성 경로 색인
ru: Индекс пути свойств при обнаружении неожиданного значения
zh_cn: 发现意外值时的属性路径索引。

source: The property path indicates how the validator reached the invalid value from the root element. If the root element is a
ko: 특성 경로는 유효성 검증 기가 루트 요소에서 유효하지 않은 값에 도달 한 방법을 나타냅니다. 루트 요소가
ru: Путь к свойству указывает,как валидатор достиг недействительного значения из корневого элемента.Если корневой элемент имеет значение a
zh_cn: 属性路径表示验证器如何从根元素中得出无效值。如果根元素是一个

source: The property path of a {@link \Symfony\Component\Validator\ConstraintViolation} object
ko: {@link \ Symfony \ Component \ Validator \ ConstraintViolation} 객체의 속성 경로
ru: Путь к свойствам объекта {@link \Symfony\Component\Validator\ConstraintViolation}
zh_cn: {@link {Symfony/Component/Validator/ConstraintViolation}对象的属性路径。

source: The property path or null if the path should be set automatically based on the form's name
ko: 속성 경로 또는 양식 이름을 기준으로 경로를 자동으로 설정해야하는 경우 null
ru: Путь к свойству или нулевой,если путь должен быть установлен автоматически на основе имени формы
zh_cn: 属性路径,如果根据表单名称自动设置路径,则为空。

source: The property path to check
ko: 확인할 속성 경로
ru: Путь к собственности для проверки
zh_cn: 要检查的属性路径

source: The property path to match against the rule
ko: 규칙과 일치하는 속성 경로
ru: Имущественный путь в соответствии с правилом
zh_cn: 匹配规则的属性路径

source: The property path to modify
ko: 수정할 속성 경로
ru: Свойство пути для изменения
zh_cn: 要修改的属性路径

source: The property path to read
ko: 읽을 속성 경로
ru: Путь к чтению
zh_cn: 读取的属性路径

source: The property path to the current value
ko: 현재 값의 속성 경로
ru: Путь к текущему значению
zh_cn: 当前值的属性路径

source: The property path to traverse
ko: 트래버스 할 속성 경로
ru: Имущественный путь к пересечению
zh_cn: 要穿越的属性路径

source: The property the member belongs to
ko: 회원이 속한 속성
ru: Имущество,к которому принадлежит
zh_cn: 成员所属的财产

source: The prototype
ko: 프로토 타입
ru: Прототип
zh_cn: 原型

source: The provider (firewall) key
ko: 공급자 (방화벽) 키
ru: Ключ провайдера (брандмауэра)
zh_cn: 提供者(防火墙)密钥

source: The provider (i.e. firewall) key
ko: 공급자 (예 : 방화벽) 키
ru: Ключ провайдера (т.е.брандмауэра)
zh_cn: 提供者(即防火墙)的密钥。

source: The provider key
ko: 프로 바이더 키
ru: Ключ провайдера
zh_cn: 提供者钥匙

source: The provider secret
ko: 제공자 비밀
ru: Секрет провайдера
zh_cn: 提供者的秘密

source: The proxy generator cache warmer generates all entity proxies.
ko: 프록시 생성기 캐시 워머는 모든 엔티티 프록시를 생성합니다.
ru: Подогреватель кэша генератора прокси генерирует все прокси-сущности.
zh_cn: 代理生成器缓存暖机生成所有实体代理。

source: The public path
ko: 공개 경로
ru: Общественный путь
zh_cn: 公共道路

source: The public path of the asset
ko: 자산의 공개 경로
ru: Общественный путь актива
zh_cn: 资产的公共路径

source: The query (GET) or request (POST) parameters
ko: 쿼리 (GET) 또는 요청 (POST) 매개 변수
ru: Параметры запроса (GET)или запроса (POST)
zh_cn: 查询(GET)或请求(POST)参数。

source: The query builder for creating the query builder
ko: 쿼리 빌더를 생성하기위한 쿼리 빌더
ru: Конструктор запросов для создания конструктора запросов
zh_cn: 创建查询生成器的查询生成器。

source: The query string (after "?")
ko: 쿼리 문자열 ( "?"뒤)
ru: Строка запроса (после "?")
zh_cn: 查询字符串("? "后)

source: The query string without the "?"
ko: "?"가없는 쿼리 문자열
ru: Строка запроса без "?"
zh_cn: 不含"?"的查询字符串

source: The question to ask to the user
ko: 사용자에게 물어볼 질문
ru: Вопрос к пользователю
zh_cn: 向用户提出的问题

source: The quoted, escaped string
ko: 인용되고 이스케이프 된 문자열
ru: Цитируемая,ускользающая строка
zh_cn: 引述的、转义的字符串

source: The raw URI (i.e. not URI decoded)
ko: 원시 URI (즉, URI 디코딩되지 않음)
ru: Необработанный УРИ (т.е.не расшифрованный УРИ)
zh_cn: 原始URI(即未进行URI解码)

source: The raw URL (i.e. not urldecoded)
ko: 원시 URL (예 : URL 디코딩되지 않음)
ru: Сырой URL-адрес (т.е.не urldecoded)
zh_cn: 原始URL(即未进行urldecoded)

source: The raw body data
ko: 원시 데이터
ru: Необработанные данные по телу
zh_cn: 原始机构数据

source: The raw path (i.e. not urldecoded)
ko: 원시 경로 (예 : URL 디코딩되지 않음)
ru: Сырой путь (т.е.не urldecoded)
zh_cn: 原始路径(即未进行urldecoded)

source: The raw violation message
ko: 원시 위반 메시지
ru: Сообщение о грубом нарушении
zh_cn: 原始违规信息

source: The raw violation message contains placeholders for the parameters returned by {@link getParameters}. Typically you'll pass the message template and parameters to a translation engine.
ko: 원시 위반 메시지에는 {@link getParameters}에서 반환 한 매개 변수에 대한 자리 표시자가 포함되어 있습니다. 일반적으로 메시지 템플릿과 매개 변수를 번역 엔진에 전달합니다.
ru: В необработанном сообщении о нарушении содержатся места для параметров,возвращаемых по {@link getParameters}.Как правило,шаблон сообщения и параметры передаются транслятору.
zh_cn: 原始违规消息包含{@link getParameters}返回的参数的占位符。通常情况下,你会将消息模板和参数传递给翻译引擎。

source: The reader for reading the .res files
ko: .res 파일을 읽는 독자
ru: Читатель для чтения файлов .res
zh_cn: 读取.res文件的阅读器

source: The reader for reading the resource bundle
ko: 자원 묶음을 읽는 독자
ru: Читатель для чтения ресурсного пакета
zh_cn: 阅读资源包的读者

source: The reader for the object IDs
ko: 객체 ID 리더
ru: Считыватель идентификаторов объектов
zh_cn: 对象ID的读取器

source: The reader to buffer
ko: 버퍼링 할 독자
ru: Считыватель для буферизации
zh_cn: 读者缓冲

source: The recursive depth in the dumped structure
ko: 덤프 된 구조의 재귀 깊이
ru: Глубина рекурсивной активности в сбрасываемой структуре
zh_cn: 转储结构中的递归深度。

source: The recursive depth in the dumped structure for the line being dumped, or -1 to signal the end-of-dump to the line dumper callable
ko: 덤프중인 라인에 대한 덤프 된 구조의 재귀 깊이 또는 덤프 끝을 호출 가능한 라인 덤프로 알리기 위해 -1
ru: Глубина рекурсивного сигнала в структуре сбрасываемой линии,или -1 для сигнала о конце сбрасываемой линии,вызываемой самосвалом.
zh_cn: 被转储的行在转储结构中的递归深度,或者-1表示转储结束到行转储器的信号。

source: The redis client
ko: Redis 클라이언트
ru: Редис-клиент
zh_cn: Redis客户端

source: The reflection instance
ko: 반사 인스턴스
ru: Случай отражения
zh_cn: 反射实例

source: The regex
ko: 정규식
ru: Регекс
zh_cn: 字符串

source: The regex or null when not given
ko: 주어진 정규 표현식 또는 null
ru: Регекс или ноль,если не указано
zh_cn: 当没有给定的情况下,为regex或null

source: The region resource bundle
ko: 리전 리소스 번들
ru: Ресурсный пакет региона
zh_cn: 区域资源包

source: The registered command if enabled or null
ko: 활성화 된 경우 등록 된 명령 또는 null
ru: Зарегистрированная команда,если она включена или нулевая
zh_cn: 如果启用或无效,则注册的命令。

source: The registered error handler
ko: 등록 된 오류 처리기
ru: Зарегистрированный обработчик ошибок
zh_cn: 注册的错误处理程序

source: The regular expression to use to match this route
ko: 이 경로와 일치시키는 데 사용할 정규식
ru: Регулярное выражение для соответствия этому маршруту
zh_cn: 匹配该途径的正则表达式

source: The relation URI
ko: 관계 URI
ru: УРИ связи
zh_cn: 关系URI

source: The relation type (e.g. "preload", "prefetch", "prerender" or "dns-prefetch")
ko: 관계 유형 (예 : "preload", "prefetch", "prerender"또는 "dns-prefetch")
ru: Тип связи (например,"предварительная загрузка","предварительная загрузка","предварительная загрузка" или "dns-prefetch")
zh_cn: 关系类型(如 "预加载"、"预获取"、"预处理 "或 "dns-预获取")。

source: The relative logout URL
ko: 상대 로그 아웃 URL
ru: Относительный URL выхода из системы
zh_cn: 相对的登出网址

source: The relative path
ko: 상대 경로
ru: Относительный путь
zh_cn: 相对路径

source: The relative path name
ko: 상대 경로 이름
ru: Имя относительного пути
zh_cn: 相对路径名称

source: The relative target path
ko: 상대 대상 경로
ru: Относительный целевой путь
zh_cn: 相对目标路径

source: The relative time of the end of the period (in milliseconds)
ko: 기간 종료의 상대 시간 (밀리 초)
ru: Относительное время окончания периода (в миллисекундах)
zh_cn: 期间结束的相对时间(毫秒)

source: The relative time of the start of the period (in milliseconds)
ko: 기간 시작의 상대 시간 (밀리 초)
ru: Относительное время начала периода (в миллисекундах)
zh_cn: 期间开始的相对时间(毫秒)

source: The remapped values
ko: 재 맵핑 된 값
ru: Перераспределенные значения
zh_cn: 重新设定的数值

source: The removed value or null when it does not exist
ko: 제거 된 값 또는 존재하지 않는 경우 null
ru: Удаленное значение или ноль,когда его нет.
zh_cn: 删除的值或不存在时为空。

source: The renderer engine
ko: 렌더러 엔진
ru: Двигатель рендера
zh_cn: 渲染器引擎

source: The renderer name
ko: 렌더러 이름
ru: Имя исполнителя
zh_cn: 渲染器名称

source: The renderer resource
ko: 렌더러 리소스
ru: Ресурс рендера
zh_cn: 渲染器资源

source: The renderer resource or false, if none was found
ko: 렌더러 리소스 또는 찾지 못한 경우 false
ru: Ресурс рендера или фальшивый,если он не был найден.
zh_cn: 渲染器资源,如果没有找到,则为false。

source: The reporting mode, defaults to not allowing any deprecations
ko: 보고 모드는 기본적으로 더 이상 사용되지 않습니다.
ru: Режим отчетности,по умолчанию не допускающий депрессий.
zh_cn: 报告模式,默认为不允许任何弃用。

source: The representation of the service container
ko: 서비스 컨테이너의 표현
ru: Представительство сервисного контейнера
zh_cn: 服务容器的表示方法

source: The representation of the workflow
ko: 워크 플로우 표현
ru: Представление рабочего процесса
zh_cn: 工作流程的表示方法

source: The request
ko: 요청
ru: Просьба
zh_cn: 请求

source: The request HTTP method
ko: 요청 HTTP 메소드
ru: HTTP-метод запроса
zh_cn: 请求的HTTP方法

source: The request URI
ko: 요청 URI
ru: Запрос УРИ
zh_cn: 请求URI

source: The request attribute name
ko: 요청 속성 이름
ru: Имя атрибута запроса
zh_cn: 请求属性名

source: The request attributes (parameters parsed from the PATH_INFO, ...)
ko: 요청 속성 (PATH_INFO에서 구문 분석 된 매개 변수, ...)
ru: Атрибуты запроса (параметры разобраны из PATH_INFO,...).
zh_cn: 请求属性(从PATH_INFO,...中解析出的参数)

source: The request body content or a resource to read the body stream
ko: 본문 스트림을 읽을 요청 본문 컨텐츠 또는 자원
ru: Содержание тела запроса или ресурс для чтения телесного потока
zh_cn: 请求主体内容或读取主体流的资源。

source: The request content length
ko: 요청 내용 길이
ru: Длина контента запроса
zh_cn: 请求内容长度

source: The request cookies
ko: 요청 쿠키
ru: Файлы cookie-запросов
zh_cn: 要求的cookies

source: The request cookies ($_COOKIE)
ko: 요청 쿠키 ($ _COOKIE)
ru: Куки-файлы запроса ($_COOKIE)
zh_cn: 要求的cookies ($_COOKIE)

source: The request events
ko: 요청 이벤트
ru: Мероприятия по запросам
zh_cn: 请求事件

source: The request files
ko: 요청 파일
ru: Файлы запросов
zh_cn: 请求文件
