Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/symfony/symfony.*.028.xlf
Languages: ko, ru, zh_cn

source: The request files ($_FILES)
ko: 요청 파일 ($ _FILES)
ru: Файлы запросов ($_FILES)
zh_cn: 请求文件 ($_FILES)

source: The request format
ko: 요청 형식
ru: Формат запроса
zh_cn: 请求格式

source: The request handler
ko: 요청 처리기
ru: Обработчик запросов
zh_cn: 请求处理程序

source: The request instance
ko: 요청 인스턴스
ru: Случай запроса
zh_cn: 请求实例

source: The request matcher service id or null if neither the request matcher, pattern or host options were provided
ko: 요청 매처 서비스 ID 또는 요청 매처, 패턴 또는 호스트 옵션이 제공되지 않은 경우 널
ru: Идентификатор услуги сопоставления запросов или нулевой,если не были предоставлены ни один из вариантов сопоставления запросов,шаблон или хост-системы
zh_cn: 请求匹配器服务ID,如果没有提供请求匹配器、模式或主机选项,则为空。

source: The request method
ko: 요청 방법
ru: Способ запроса
zh_cn: 请求方法

source: The request parameters
ko: 요청 매개 변수
ru: Параметры запроса
zh_cn: 请求参数

source: The request raw body data
ko: 요청 원시 데이터
ru: Запрос необработанных данных тела
zh_cn: 要求的生体数据

source: The request server parameters
ko: 요청 서버 매개 변수
ru: Параметры сервера запросов
zh_cn: 请求服务器参数

source: The request start timestamp
ko: 요청 시작 타임 스탬프
ru: Штемпель времени начала запроса
zh_cn: 请求开始时间戳

source: The request status code
ko: 요청 상태 코드
ru: Код статуса запроса
zh_cn: 请求状态代码

source: The request that resulted in an AuthenticationException
ko: AuthenticationException을 초래 한 요청
ru: Запрос,который привел к аутентификацииЭксцепция
zh_cn: 导致AuthenticationException的请求。

source: The request the kernel is currently processing
ko: 커널이 현재 처리중인 요청
ru: Запрос,который ядро в настоящее время обрабатывает
zh_cn: 内核当前正在处理的请求

source: The request to handle
ko: 처리 요청
ru: Запрос на обработку
zh_cn: 请求处理

source: The request type the kernel is currently processing; one of HttpKernelInterface::MASTER_REQUEST or HttpKernelInterface::SUB_REQUEST
ko: 커널이 현재 처리중인 요청 유형 HttpKernelInterface :: MASTER_REQUEST 또는 HttpKernelInterface :: SUB_REQUEST 중 하나
ru: Тип запроса,обрабатываемого в данный момент ядром;один из HttpKernelInterface::MASTER_REQUEST или HttpKernelInterface::SUB_REQUEST.
zh_cn: 内核当前正在处理的请求类型;HttpKernelInterface::MASTER_REQUEST或HttpKernelInterface::SUB_REQUEST中的一个。

source: The requested parameter key
ko: 요청 된 매개 변수 키
ru: Запрошенный ключ параметра
zh_cn: 要求的参数键

source: The required service types, optionally keyed by service names
ko: 서비스 이름으로 선택적으로 입력되는 필수 서비스 유형
ru: Необходимые типы услуг,по желанию,с указанием их названий.
zh_cn: 所需的服务类型,可选择以服务名称为键。

source: The requirements
ko: 요구 사항
ru: Требования
zh_cn: 所需经费

source: The resolved option value is set to the return value of the closure.
ko: 해결 된 옵션 값은 클로저의 반환 값으로 설정됩니다.
ru: Значение разрешенной опции устанавливается на возвратное значение закрытия.
zh_cn: 已解决的选项值被设置为关闭的返回值。

source: The resolved string
ko: 해결 된 문자열
ru: Разрешённая строка
zh_cn: 解析的字符串

source: The resolver for the options
ko: 옵션에 대한 리졸버
ru: Резольвер для опций
zh_cn: 选项的解析器

source: The resolver must only throw an exception when it should be able to load controller but cannot because of some errors made by the developer.
ko: 리졸버는 컨트롤러를로드 할 수 있어야하지만 개발자가 만든 일부 오류로 인해 예외를 처리해야합니다.
ru: Резольвер должен бросать исключение только тогда,когда он должен быть способен загрузить контроллер,но не может из-за некоторых ошибок,допущенных разработчиком.
zh_cn: 只有当应该能够加载控制器,但由于开发人员的错误而无法加载时,解析器才必须抛出异常。

source: The resource
ko: 자원
ru: Ресурс
zh_cn: 资源

source: The resource can be a file or a directory.
ko: 자원은 파일 또는 디렉토리 일 수 있습니다.
ru: Ресурсом может быть файл или каталог.
zh_cn: 资源可以是一个文件或一个目录。

source: The resource can be obtained by calling {@link getResourceForBlock()} or {@link getResourceForBlockHierarchy()}. The type of the resource is decided by the implementation.
ko: {@link getResourceForBlock ()} 또는 {@link getResourceForBlockHierarchy ()}를 호출하여 자원을 확보 할 수 있습니다. 자원의 유형은 구현에 의해 결정됩니다.
ru: Ресурс можно получить,вызвав {@link getResourceForBlock()}или {@link getResourceForBlockHierarchy()}.Тип ресурса определяется реализацией.
zh_cn: 资源可以通过调用{@link getResourceForBlock()}或{@link getResourceForBlockHierarchy()}获得。资源的类型由实现决定。

source: The resource casted as array
ko: 배열로 캐스팅 된 리소스
ru: Ресурс,выполненный в виде массива
zh_cn: 资源以数组形式投递

source: The resource is first searched in the themes attached to $view, then in the themes of its parent view and so on, until a resource was found.
ko: 자원은 자원이 발견 될 때까지 $ view에 첨부 된 주제에서 검색된 다음 상위보기의 주제 등에서 먼저 검색됩니다.
ru: Поиск ресурса сначала осуществляется в темах,привязанных к $view,затем в темах его родительского представления и т.д.,пока ресурс не будет найден.
zh_cn: 首先在$view的主题中搜索资源,然后在其父视图的主题中搜索,以此类推,直到找到资源。

source: The resource must be a fully-qualified class name.
ko: 리소스는 정규화 된 클래스 이름이어야합니다.
ru: Ресурс должен быть полным именем класса.
zh_cn: 该资源必须是一个完全限定的类名。

source: The resource name
ko: 리소스 이름
ru: Имя ресурса
zh_cn: 资源名称

source: The resource name must follow the following pattern:
ko: 자원 이름은 다음 패턴을 따라야합니다.
ru: Имя ресурса должно соответствовать следующему шаблону:
zh_cn: 资源名称必须遵循以下模式:

source: The resource that could not be imported
ko: 가져올 수없는 리소스
ru: Ресурс,который не может быть импортирован
zh_cn: 无法导入的资源

source: The resource to be checked for freshness
ko: 신선도를 확인할 자원
ru: Ресурс,который нужно проверить на свежесть
zh_cn: 要检查的资源是否新鲜

source: The resource to be validated
ko: 검증 할 자원
ru: Ресурс,подлежащий проверке
zh_cn: 要验证的资源

source: The resource to lock
ko: 잠글 자원
ru: Ресурс на блокировку
zh_cn: 要锁定的资源

source: The resource type or null if unknown
ko: 자원 형. 알 수없는 경우는 null
ru: Тип ресурса или ноль,если неизвестно
zh_cn: 资源类型,如果未知,则为空

source: The resource was found but the request method is not allowed.
ko: 리소스를 찾았지만 요청 방법이 허용되지 않습니다.
ru: Ресурс найден,но метод запроса не разрешен.
zh_cn: 找到了资源,但请求方法不允许。

source: The resource was not found.
ko: 자원을 찾을 수 없습니다.
ru: Ресурс не найден.
zh_cn: 没有找到资源。

source: The response content
ko: 응답 내용
ru: Содержание ответа
zh_cn: 回复内容

source: The response content, see setContent()
ko: 응답 내용은 setContent ()를 참조하십시오.
ru: Содержание ответа,см.setContent()
zh_cn: 响应内容,见setContent()

source: The response data
ko: 응답 데이터
ru: Данные ответа
zh_cn: 响应数据

source: The response headers
ko: 응답 헤더
ru: Заголовки ответа
zh_cn: 响应标题

source: The response status code
ko: 응답 상태 코드
ru: Код статуса ответа
zh_cn: 响应状态代码

source: The response status code is 302 if the permanent parameter is false (default), and 301 if the redirection is permanent.
ko: 영구 매개 변수가 false (기본값)이면 응답 상태 코드는 302이고, 경로 재 지정이 영구적이면 301입니다.
ru: Код статуса ответа 302,если постоянный параметр является ложным (по умолчанию),и 301,если перенаправление является постоянным.
zh_cn: 如果永久参数为假(默认),则响应状态码为302,如果重定向为永久,则响应状态码为301。

source: The response to return, never null
ko: 리턴 할 응답, 절대 null
ru: Ответ на возврат,никогда не бывает нулевым.
zh_cn: 返回的响应,绝不为空

source: The response with headers and content
ko: 헤더와 내용이있는 응답
ru: Ответ с заголовками и содержанием
zh_cn: 带标题和内容的回复

source: The result can be queried using {@link getData()}.
ko: {@link getData ()}를 사용하여 결과를 쿼리 할 수 ​​있습니다.
ru: Результат можно запросить с помощью {@link getData()}.
zh_cn: 可以使用{@link getData()}查询结果。

source: The result of the evaluation of the expression
ko: 식의 평가 결과
ru: Результат оценки выражения
zh_cn: 表达式的评价结果

source: The resulting files can be converted to binary .res files using a {@link \Symfony\Component\Intl\ResourceBundle\Compiler\BundleCompilerInterface} implementation.
ko: 결과 파일은 {@link \ Symfony \ Component \ Intl \ ResourceBundle \ Compiler \ BundleCompilerInterface} 구현을 사용하여 이진 .res 파일로 변환 될 수 있습니다.
ru: Полученные файлы можно преобразовать в двоичные .res-файлы с помощью реализации {@link \Symfony\Component\Intl\ResourceBundle\Compiler\BundleCompilerInterface}.
zh_cn: 由此产生的文件可以使用{@link \Symfony\Component\Intl\ResourceBundle\Compiler/BundleCompilerInterface}实现转换为二进制.res文件。

source: The returned URI is not the same as the form "action" attribute. This method merges the value if the method is GET to mimics browser behavior.
ko: 리턴 된 URI는 "action"속성과 동일하지 않습니다. 이 메소드는 브라우저 동작을 모방하기 위해 GET 인 경우 값을 병합합니다.
ru: Возвращаемый URI не совпадает с атрибутом формы "действие".Этот метод объединяет значение,если это метод GET,чтобы имитировать поведение браузера.
zh_cn: 返回的URI与表单的 "action "属性不同。如果方法是GET,本方法会合并值,以模仿浏览器行为。

source: The returned array does not include file fields (see getFiles).
ko: 반환 된 배열은 파일 필드를 포함하지 않습니다 (getFiles 참조).
ru: Возвращаемый массив не включает в себя файловые поля (см.getFiles).
zh_cn: 返回的数组不包括文件字段(参见getFiles)。

source: The returned validator adds all generated violations to the given context.
ko: 반환 된 유효성 검사기는 생성 된 모든 위반을 지정된 컨텍스트에 추가합니다.
ru: Возвращаемый валидатор добавляет все сгенерированные нарушения в данный контекст.
zh_cn: 返回的验证器将所有生成的违规行为添加到给定的上下文中。

source: The returned validator collects all violations generated within its context. You can access these violations with the {@link ContextualValidatorInterface::getViolations()} method.
ko: 반환 된 유효성 검사기는 해당 컨텍스트 내에서 생성 된 모든 위반을 수집합니다. {@link ContextualValidatorInterface :: getViolations ()} 메소드를 사용하여 이러한 위반에 액세스 할 수 있습니다.
ru: Возвращаемый валидатор собирает все нарушения,генерируемые в его контексте.Доступ к этим нарушениям можно получить с помощью метода {@link ContextualValidatorInterface::getViolations()}.
zh_cn: 返回的验证器收集了在其上下文中产生的所有违规行为。你可以使用{@link ContextualValidatorInterface::getViolations()}方法访问这些违规行为。

source: The reverse matching regular expression
ko: 역 일치 정규식
ru: Обратное соответствие регулярному выражению
zh_cn: 正则表达式的反向匹配

source: The reverse matching regular expression with named captures being formed by the transformer index in the $transformer array
ko: $ transformer 배열의 변환기 인덱스에 의해 이름이 지정된 캡처가있는 역방향 일치 정규식
ru: Обратное совпадение регулярного выражения с именованными захватами,формируемыми индексом трансформатора в массиве $трансформатора
zh_cn: 由$transformer数组中的transformer索引形成的命名捕捉的反向匹配正则表达式。

source: The reverse transform callback
ko: 역변환 콜백
ru: Обратный обратный вызов преобразования
zh_cn: 反向变换回调

source: The roles
ko: 역할
ru: Роли
zh_cn: 角色

source: The root form of the tree to map it to
ko: 트리를 매핑 할 루트 형식
ru: Корневая форма дерева,чтобы сопоставить ее с
zh_cn: 要将其映射到的树的根形式

source: The root node (as an ArrayNodeDefinition when the type is 'array')
ko: 루트 노드 (유형이 '배열'인 경우 ArrayNodeDefinition으로)
ru: Корневой узел (как ArrayNodeDefinition,когда тип 'массив')
zh_cn: 根节点(当类型为 "数组 "时,作为ArrayNodeDefinition)。

source: The root of the tree
ko: 나무의 뿌리
ru: Корень дерева
zh_cn: 树的根

source: The root value of the validated object graph
ko: 검증 된 객체 그래프의 루트 값
ru: Корневое значение валидированного объектного графика
zh_cn: 验证对象图的根值

source: The root value of the validation
ko: 검증의 근본 가치
ru: Корневое значение валидации
zh_cn: 验证的根值

source: The rounding increment indicates to which number a currency is rounded. For example, 1230 rounded to the nearest 50 is 1250. 1.234 rounded to the nearest 0.65 is 1.3.
ko: 반올림 증분은 통화가 반올림되는 숫자를 나타냅니다. 예를 들어, 가장 가까운 50으로 반올림 된 1230은 1250입니다. 가장 가까운 0.65로 올림 한 1.234는 1.3입니다.
ru: Приращение округления указывает на то,к какому числу округляется валюта.Например,1230 округлено до ближайших 50-это 1250.1.234 округлено с точностью до 0.65-1.3.
zh_cn: 四舍五入增量表示货币被四舍五入到哪个数字。例如,1230四舍五入到最接近的50就是1250。1.234四舍五入到最接近的0.65就是1.3。

source: The rounding increment or NULL if not found
ko: 반올림 증분 또는 찾지 못한 경우 NULL
ru: Приращение округления или NULL,если не найдено.
zh_cn: 四舍五入的增量,如果没有找到,则为NULL。

source: The route
ko: 경로
ru: Маршрут
zh_cn: 航线

source: The route name
ko: 경로 이름
ru: Название маршрута
zh_cn: 途径名称

source: The route name or an array of route names
ko: 경로 이름 또는 경로 이름 배열
ru: Имя маршрута или массив названий маршрутов
zh_cn: 途径名称或途径名称数组

source: The route name that matched
ko: 일치하는 경로 이름
ru: Название маршрута,совпадающее
zh_cn: 匹配的途径名称

source: The route path
ko: 경로 경로
ru: Путь маршрута
zh_cn: 途径路径

source: The route we are matching against
ko: 우리가 일치하는 경로
ru: Маршрут,по которому мы идем
zh_cn: 我们要匹配的路线是

source: The route's controller
ko: 루트 컨트롤러
ru: Контроллер маршрута
zh_cn: 途径的控制器

source: The router
ko: 라우터
ru: Маршрутизатор
zh_cn: 路由器

source: The rule for compiling the currency bundle.
ko: 통화 번들을 컴파일하기위한 규칙.
ru: Правило составления валютного пакета.
zh_cn: 编制货币捆绑的规则。

source: The rule for compiling the language bundle.
ko: 언어 번들을 컴파일하기위한 규칙.
ru: Правило составления языкового пакета.
zh_cn: 编译语言包的规则。

source: The rule for compiling the locale bundle.
ko: 로케일 번들 컴파일 규칙.
ru: Правило составления локального пакета.
zh_cn: 编译locale bundle的规则。

source: The rule for compiling the region bundle.
ko: 리젼 번들을 컴파일하기위한 규칙.
ru: Правило составления регионального пакета.
zh_cn: 编制区域束的规则。

source: The rule for compiling the script bundle.
ko: 스크립트 번들을 컴파일하기위한 규칙
ru: Правило для компиляции пакета скриптов.
zh_cn: 编译脚本捆绑的规则。

source: The salt
ko: 소금
ru: Соль

source: The salt to be used
ko: 사용되는 소금
ru: Используемая соль
zh_cn: 拟使用的盐

source: The same message can have different translations in different domains. Pass the domain that is used for violation messages by default to this method.
ko: 동일한 메시지가 다른 도메인에서 다른 번역을 가질 수 있습니다. 위반 메시지에 사용되는 도메인을 기본적으로이 방법으로 전달하십시오.
ru: Одно и то же сообщение может иметь разные переводы в разных доменах.Передайте домен,который по умолчанию используется для сообщений о нарушении,этому методу.
zh_cn: 同一条消息在不同的域中可以有不同的翻译。将默认用于违规消息的域传递给本方法。

source: The same value with all service references replaced by the real service instances and all expressions evaluated
ko: 모든 서비스 참조가 실제 서비스 인스턴스로 대체되고 평가 된 모든 표현식과 동일한 값
ru: Одно и то же значение со всеми ссылками на сервисы,замененными реальными экземплярами сервисов и всеми выражениями,которые были оценены
zh_cn: 相同的值,但所有的服务引用都被真实的服务实例所取代,所有的表达式都被评估。

source: The scalar value being dumped
ko: 덤프되는 스칼라 값
ru: Скалярное значение выбрасывается
zh_cn: 被转储的标量值

source: The scale
ko: 규모
ru: Весы
zh_cn: 比例尺

source: The scheme and HTTP host
ko: 체계 및 HTTP 호스트
ru: Схема и HTTP-хост
zh_cn: 方案和HTTP主机

source: The scheme or an array of schemes
ko: 체계 또는 체계의 배열
ru: Схема или массив схем
zh_cn: 办法或一系列办法

source: The scheme used is: key { key2 { key3 { "value" } } } Becomes: 'key.key2.key3' =&gt; 'value'
ko: 사용 된 체계는 다음과 같습니다. key {key2 {key3 { "value"}}} 다음이됩니다 : 'key.key2.key3'=&gt; 'value'
ru: Используемая схема: ключ {ключ2 {ключ3 {"значение"}}} Преобразуется в: 'key.key2.key3' =&gt; 'значение'
zh_cn: 使用的方案是：key {key2 {key3 {&ldquo; value&rdquo;}}}成为：'key.key2.key3'=&gt;'value'

source: The schemes
ko: 계획
ru: Эти схемы
zh_cn: 这些计划

source: The second
ko: 두번째
ru: Второй
zh_cn: 第二种

source: The second parameter $hierarchyLevel determines the level of the hierarchy that should be rendered.
ko: 두 번째 매개 변수 $ hierarchyLevel은 렌더링해야 할 계층의 수준을 결정합니다.
ru: Второй параметр $hierarchyLevel определяет уровень иерархии,который должен быть отображен.
zh_cn: 第二个参数$hierarchyLevel决定应该渲染的层次结构的级别。

source: The second parameter $hierarchyLevel determines the level of the hierarchy that should be rendered. For example, if $hierarchyLevel is 2 for the above hierarchy, the engine will first look for the block "url_widget", then, if that does not exist, for the block "text_widget" etc.
ko: 두 번째 매개 변수 $ hierarchyLevel은 렌더링해야 할 계층의 수준을 결정합니다. 예를 들어 위 계층 구조에서 $ hierarchyLevel이 2 인 경우 엔진은 먼저 "url_widget"블록을 찾은 다음 존재하지 않는 경우 "text_widget"블록 등을 찾습니다.
ru: Второй параметр $hierarchyLevel определяет уровень иерархии,который должен быть отображен.Например,если $hierarchyLevel равен 2 для вышестоящей иерархии,то движок сначала будет искать блок "url_widget",затем,если его нет,блок "text_widget" и т.д.
zh_cn: 第二个参数$hierarchyLevel决定应该渲染的层次结构的级别。例如,如果$hierarchyLevel为2,则引擎将首先查找 "url_widget "块,如果不存在,则查找 "text_widget "块等。

source: The second parameter passed to the closure is the value of the option.
ko: 클로저에 전달 된 두 번째 매개 변수는 옵션 값입니다.
ru: Вторым параметром,передаваемым при закрытии,является значение опции.
zh_cn: 传递给封闭的第二个参数是选项的值。

source: The second password
ko: 두 번째 비밀번호
ru: Второй пароль
zh_cn: 第二个密码

source: The second string to compare
ko: 비교할 두 번째 문자열
ru: Вторая строка для сравнения
zh_cn: 第二个要比较的字符串

source: The second value to compare
ko: 비교할 두 번째 값
ru: Второе значение для сравнения
zh_cn: 第二个比较值

source: The secret shared with the AnonymousToken
ko: 익명 토큰과 공유 된 비밀
ru: Секрет,которым мы поделились с Анонимным Токеном.
zh_cn: 与AnonymousToken共享的秘密

source: The section name
ko: 섹션 이름
ru: Название раздела
zh_cn: 节名

source: The selectable choices
ko: 선택 가능한 선택
ru: Выбираемые варианты
zh_cn: 可选择的选项

source: The selectable choices indexed by the corresponding values
ko: 해당 값으로 색인을 생성 할 수있는 선택 가능
ru: Выбираемые варианты,проиндексированные соответствующими значениями.
zh_cn: 可选择的选项以相应的值为索引。

source: The selected line number
ko: 선택된 줄 번호
ru: Номер выбранной строки
zh_cn: 所选行号

source: The sequence that captures translation messages.
ko: 번역 메시지를 캡처하는 순서입니다.
ru: Последовательность,которая захватывает сообщения о переводе.
zh_cn: 捕捉翻译信息的序列。

source: The serialized error
ko: 직렬화 된 오류
ru: Сериализованная ошибка
zh_cn: 序列化的错误

source: The serializer metadata loaders
ko: 시리얼 라이저 메타 데이터 로더
ru: Погрузчики метаданных сериализатора
zh_cn: 序列器元数据加载器

source: The server host
ko: 서버 호스트
ru: Хост сервера
zh_cn: 服务器主机

source: The server parameters ($_SERVER)
ko: 서버 매개 변수 ($ _SERVER)
ru: Параметры сервера ($_SERVER)
zh_cn: 服务器参数($_SERVER)

source: The server parameters (HTTP headers are referenced with a HTTP_ prefix as PHP does)
ko: 서버 매개 변수 (PHP와 마찬가지로 HTTP 헤더는 HTTP_ 접두어로 참조됩니다)
ru: Параметры сервера (на заголовки HTTP ссылаются с префиксом HTTP_,как это делает PHP)
zh_cn: 服务器参数(HTTP头文件和PHP一样用HTTP_前缀引用)

source: The server parameters (equivalent of $_SERVER)
ko: 서버 매개 변수 ($ _SERVER와 동일)
ru: Параметры сервера (эквивалент $_SERVER)
zh_cn: 服务器参数(相当于$_SERVER)

source: The service
ko: 서비스
ru: Служба
zh_cn: 服务

source: The service class
ko: 서비스 클래스
ru: Класс обслуживания
zh_cn: 服务类

source: The service container
ko: 서비스 컨테이너
ru: Сервисный контейнер
zh_cn: 服务容器

source: The service created by the file
ko: 파일에 의해 생성 된 서비스
ru: Служба,созданная файлом
zh_cn: 文件创建的服务

source: The service id of the user provider
ko: 사용자 제공자의 서비스 ID
ru: Идентификатор услуги провайдера пользователя
zh_cn: 用户提供者的服务ID

source: The service id that references the non-existent parameter
ko: 존재하지 않는 매개 변수를 참조하는 서비스 ID
ru: Идентификатор функции,который ссылается на несуществующий параметр
zh_cn: 引用不存在的参数的服务ID。

source: The service id, or null to create an anonymous service
ko: 서비스 ID. 익명의 서비스를 작성하는 경우는 null
ru: Идентификатор сервиса,или ноль для создания анонимного сервиса.
zh_cn: 服务ID,如果要创建一个匿名服务,则为空。

source: The service identifier
ko: 서비스 식별자
ru: Идентификатор услуги
zh_cn: 服务标识符

source: The service identifier or alias
ko: 서비스 식별자 또는 별명
ru: Идентификатор услуги или псевдоним
zh_cn: 服务标识符或别名

source: The service instance
ko: 서비스 인스턴스
ru: Служебный экземпляр
zh_cn: 服务实例

source: The service to alias
ko: 별칭 서비스
ru: Служба под псевдонимом
zh_cn: 对别名的服务

source: The session
ko: 세션
ru: Заседание
zh_cn: 本届会议

source: The session ID
ko: 세션 ID
ru: ID сессии
zh_cn: 会议ID

source: The session ID or empty
ko: 세션 ID 또는 비어 있음
ru: Идентификатор сессии или пустой
zh_cn: 会话ID或为空

source: The session identifier
ko: 세션 식별자
ru: Идентификатор сессии
zh_cn: 会议标识符

source: The session name
ko: 세션 이름
ru: Название сессии
zh_cn: 会议名称

source: The set can be another Finder, an Iterator, an IteratorAggregate, or even a plain array.
ko: 집합은 다른 Finder, Iterator, IteratorAggregate 또는 일반 배열 일 수 있습니다.
ru: Набор может быть другим Finder,Iterator,IteratorAggregate или даже простым массивом.
zh_cn: 这个集合可以是另一个Finder,一个Iterator,一个IteratorAggregate,甚至是一个普通的数组。

source: The set of routes
ko: 노선 세트
ru: Набор маршрутов
zh_cn: 路线集

source: The shortcut
ko: 바로 가기
ru: Короткий путь
zh_cn: 捷径

source: The shortcuts, can be null, a string of shortcuts delimited by | or an array of shortcuts
ko: 바로 가기는 널 (null) 일 수 있습니다. 바로 가기 문자열은 | 또는 바로 가기 배열
ru: Ярлыки могут быть нулевыми,строкой ярлыков,ограниченной |,или массивом ярлыков.
zh_cn: 快捷键,可以是空的,也可以是一串以"|"分隔的快捷键,或者是一个快捷键数组。

source: The signed URI
ko: 서명 된 URI
ru: Подписанный УРИ
zh_cn: 签名的URI

source: The singular form or an array of possible singular forms
ko: 단수형 또는 가능한 단수형 배열
ru: Единственная форма или массив возможных единственных форм.
zh_cn: 单数形式或一系列可能的单数形式。

source: The slot content
ko: 슬롯 내용
ru: Содержание слота
zh_cn: 槽的内容

source: The slot name
ko: 슬롯 이름
ru: Имя слота
zh_cn: 槽名

source: The snippet of code
ko: 코드 스 니펫
ru: Отрывок кода
zh_cn: 这段代码

source: The snippet of code near the problem
ko: 문제 근처의 코드 스 니펫
ru: Отрывок кода рядом с проблемой...
zh_cn: 问题附近的代码片段

source: The sort type (SORT_BY_NAME, SORT_BY_TYPE, or a PHP callback)
ko: 정렬 유형 (SORT_BY_NAME, SORT_BY_TYPE 또는 PHP 콜백)
ru: Тип сортировки (SORT_BY_NAME,SORT_BY_TYPE или обратный вызов PHP)
zh_cn: 排序类型(SORT_BY_NAME,SORT_BY_TYPE,或一个PHP回调)

source: The source values
ko: 소스 값
ru: Исходные значения
zh_cn: 源值

source: The special parameter _fragment will be used as the document fragment suffixed to the final URL.
ko: 특수 매개 변수 _fragment는 최종 URL의 접미사로 사용되는 문서 조각으로 사용됩니다.
ru: Специальный параметр _fragment будет использоваться в качестве фрагмента документа,суффиксом к окончательному URL.
zh_cn: 特殊参数_fragment将被用作最终URL后缀的文档片段。

source: The start date to search from
ko: 검색 시작일
ru: Дата начала поиска с
zh_cn: 检索的起始日期

source: The static prefix
ko: 정적 접두사
ru: Статический префикс
zh_cn: 静态前缀

source: The static prefix of the compiled route
ko: 컴파일 된 경로의 정적 접두사
ru: Статический префикс скомпилированного маршрута
zh_cn: 编译途径的静态前缀

source: The status code
ko: 상태 코드
ru: Код статуса
zh_cn: 状态码

source: The status is one of: ready, started, terminated.
ko: 상태는 준비 됨, 시작됨, 종료 됨 중 하나입니다.
ru: Статус один из:готов,запущен,прекращен.
zh_cn: 状态为:准备、开始、终止中的一种。

source: The stored token
ko: 저장된 토큰
ru: Сохраненный токен
zh_cn: 存储令牌

source: The strategy for cascading objects.
ko: 계단식 객체 전략.
ru: Стратегия каскадирования объектов.
zh_cn: 级联对象的策略。

source: The strategy for traversing traversable objects.
ko: 통과 가능한 개체를 통과하기위한 전략.
ru: Стратегия обхода обходных объектов.
zh_cn: 遍历可遍历对象的策略。

source: The strategy name
ko: 전략 이름
ru: Название стратегии
zh_cn: 战略名称

source: The string
ko: 끈
ru: Струна
zh_cn: 字符串

source: The string being dumped
ko: 덤프되는 문자열
ru: Сбрасываемая строка
zh_cn: 被转储的字符串

source: The string containing the "Accept-Language" header value
ko: "Accept-Language"헤더 값을 포함하는 문자열
ru: Строка,содержащая значение заголовка "Accept-Language".
zh_cn: 包含 "Accept-Language "头值的字符串。

source: The string converted to UTF-8
ko: UTF-8로 변환 된 문자열
ru: Строка,преобразованная в UTF-8
zh_cn: 转换为UTF-8的字符串

source: The string representation of the Response is the same as the one that will be sent to the client only if the prepare() method has been called before.
ko: Response의 문자열 표현은 prepre () 메소드가 이전에 호출 된 경우에만 클라이언트에 전송되는 것과 동일합니다.
ru: Строковое представление ответа такое же,как и представление,которое будет отправлено клиенту только в том случае,если ранее был вызван метод prepare().
zh_cn: Response的字符串表示方式与之前调用了prepare()方法才会发送给客户端的字符串表示方式是一样的。

source: The string representation of the object
ko: 객체의 문자열 표현
ru: Строковое представление объекта
zh_cn: 对象的字符串表示

source: The string representation of the passed value
ko: 전달 된 값의 문자열 표현
ru: Строковое представление передаваемого значения
zh_cn: 传递值的字符串表示

source: The string representation of the value list
ko: 값 목록의 문자열 표현
ru: Строковое представление списка значений
zh_cn: 值列表的字符串表示

source: The string subset
ko: 문자열 부분 집합
ru: Подмножество строк
zh_cn: 字符串子集

source: The string to be matched against filters
ko: 필터와 일치시킬 문자열
ru: Строка,которая должна быть сопоставлена с фильтрами
zh_cn: 要与过滤器匹配的字符串

source: The string to be padded
ko: 채워질 문자열
ru: Струна,которую нужно подбивать
zh_cn: 要填充的字符串

source: The string to check
ko: 확인할 문자열
ru: Строка для проверки
zh_cn: 要检查的字符串

source: The string to check its length
ko: 길이를 확인할 문자열
ru: Строка для проверки ее длины
zh_cn: 要检查其长度的字符串
