Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/symfony/symfony.*.028.xlf
Languages: ko, ru, zh_cn

source: The new temporary filename (with path), or throw an exception on failure
ko: 새로운 임시 파일 이름 (경로 포함) 또는 실패시 예외 발생
ru: Новое временное имя файла (с указанием пути),или бросить исключение на неудачу.
zh_cn: 新的临时文件名(带路径),或者在失败时抛出一个异常。

source: The new validator
ko: 새로운 유효성 검사기
ru: Новый валидатор
zh_cn: 新的验证器

source: The new working directory
ko: 새로운 작업 디렉토리
ru: Новый рабочий каталог
zh_cn: 新的工作目录

source: The newly created command
ko: 새로 작성된 명령
ru: Вновь созданная команда
zh_cn: 新创建的命令

source: The next example shows how to include the "
ko: 다음 예는 "
ru: Следующий пример показывает,как включить "
zh_cn: 下一个例子显示了如何将"

source: The node
ko: 노드
ru: Узел
zh_cn: 节点

source: The node associated with this field
ko: 이 필드와 연관된 노드
ru: Узел,связанный с этим полем
zh_cn: 与此字段相关的节点

source: The node builder
ko: 노드 빌더
ru: Создатель узлов
zh_cn: 节点生成器

source: The node definition class name
ko: 노드 정의 클래스 이름
ru: Имя класса определения узла
zh_cn: 节点定义类名称

source: The node html
ko: 노드 html
ru: Узел html
zh_cn: 节点html

source: The node identifier
ko: 노드 식별자
ru: Идентификатор узла
zh_cn: 节点标识符

source: The node name
ko: 노드 이름
ru: Имя узла
zh_cn: 节点名称

source: The node path
ko: 노드 경로
ru: Путь узла
zh_cn: 节点路径

source: The node tree describing the configuration
ko: 구성을 설명하는 노드 트리
ru: Узловое дерево,описывающее конфигурацию
zh_cn: 描述配置的节点树

source: The node type
ko: 노드 유형
ru: Тип узла
zh_cn: 节点类型

source: The node value
ko: 노드 값
ru: Значение узла
zh_cn: 节点值

source: The non-UTF-8 string to convert
ko: 변환 할 비 UTF-8 문자열
ru: Строка неUTF-8 для преобразования
zh_cn: 要转换的非UTF-8字符串

source: The normalization process looks at all public methods and calls the ones which have a name starting with get and take no parameters. The result is a map from property names (method name stripped of the get prefix and converted to lower case) to property values. Property values are normalized through the serializer.
ko: 정규화 프로세스는 모든 공용 메소드를보고 get 및 take no take 매개 변수로 이름이있는 메소드를 호출합니다. 결과는 속성 이름 (get 접두사를 제거하고 소문자로 변환 된 메서드 이름)에서 속성 값으로 매핑됩니다. 속성 값은 시리얼 라이저를 통해 정규화됩니다.
ru: Процесс нормализации рассматривает все публичные методы и вызывает те,у которых имя начинается с get и не принимает параметров.В результате получается карта из имён свойств (имя метода,лишённое префикса get и преобразованное в нижний регистр)в значения свойств.Значения свойств нормализуются через сериализатор.
zh_cn: 归一化过程会查看所有的公共方法,并调用那些名称以 get 开头且不接受参数的方法,结果是从属性名(方法名去掉 get 前缀并转换为小写)到属性值的映射。结果是一个从属性名(方法名去掉get前缀并转换为小写)到属性值的映射。属性值通过序列化器进行归一化处理。

source: The normalization process looks for all the object's properties (public and private). The result is a map from property names to property values. Property values are normalized through the serializer.
ko: 정규화 프로세스는 모든 객체의 속성 (공개 및 개인)을 찾습니다. 결과는 속성 이름에서 속성 값으로의 맵입니다. 속성 값은 시리얼 라이저를 통해 정규화됩니다.
ru: Процесс нормализации ищет все свойства объекта (публичные и частные).В результате получается карта от имен свойств до значений свойств.Значения свойств нормализуются через сериализатор.
zh_cn: 归一化过程寻找对象的所有属性(公共和私有)。其结果是一个从属性名到属性值的映射。属性值通过序列化器进行归一化。

source: The normalized URI for the path
ko: 경로의 정규화 된 URI
ru: Нормализованный УРТ для пути
zh_cn: 路径的标准化URI

source: The normalized array value
ko: 정규화 된 배열 값
ru: Нормализованное значение массива
zh_cn: 归一化数组值

source: The normalized hour value
ko: 정규화 된 시간 값
ru: Нормализованное часовое значение
zh_cn: 归一化小时值

source: The normalized value
ko: 정규화 된 값
ru: Нормализованное значение
zh_cn: 归一化值

source: The normalizer
ko: 노멀 라이저
ru: Нормализатор
zh_cn: 归一化

source: The normalizer can ba a callable (a string), a closure or a class implementing __invoke.
ko: 노멀 라이저는 호출 가능 (문자열), 클로저 또는 __invoke를 구현하는 클래스를 저장할 수 있습니다.
ru: Нормализатор может работать с вызываемым (a string),с закрытием или с классом,реализующим __invoke.
zh_cn: 正则化器可以是一个可调用的(字符串)、一个闭包或一个实现__invoke的类。

source: The normalizer can be a callable (a string), a closure or a class implementing __invoke.
ko: 노멀 라이저는 호출 가능 (문자열), 클로저 또는 __invoke를 구현하는 클래스 일 수 있습니다.
ru: Нормализатор может быть вызываемым (строка),закрываемым или реализующим __invoke классом.
zh_cn: 正则化器可以是一个可调用的(字符串)、一个闭包或一个实现__invoke的类。

source: The normalizer is given so that you can use it to normalize objects contained within this object
ko: 이 객체에 포함 된 객체를 정규화하는 데 사용할 수 있도록 노멀 라이저가 제공됩니다.
ru: Нормализатор дается для того,чтобы вы могли использовать его для нормализации объектов,содержащихся в этом объекте.
zh_cn: 给出了归一化器,这样你就可以用它来归一化这个对象中包含的对象。

source: The normalizer should be a closure with the following signature:
ko: 노멀 라이저는 다음 서명이있는 클로저 여야합니다.
ru: Нормализатор должен быть закрыт следующей подписью:
zh_cn: 归一化器应该是一个具有以下签名的闭合器:

source: The number
ko: 수
ru: Номер
zh_cn: 数量

source: The number for determining the plural form
ko: 복수 형태를 결정하기위한 수
ru: Число для определения множественного числа
zh_cn: 确定复数形式的数字

source: The number for determining the plural form when translating the message
ko: 메시지를 번역 할 때 복수 형태를 결정하기위한 수
ru: Номер для определения множественного числа при переводе сообщения
zh_cn: 在翻译信息时确定复数形式的数字。

source: The number of InputArguments
ko: InputArguments의 수
ru: Количество входных документов
zh_cn: 输入参数的数量

source: The number of attributes
ko: 속성의 수
ru: Количество атрибутов
zh_cn: 属性的数量

source: The number of characters $str has been cut by
ko: 문자 수 $ str은 (는)
ru: Количество символов $str сокращено на
zh_cn: $str被剪切的字符数为

source: The number of children views
ko: 어린이 조회수
ru: Количество просмотров детьми
zh_cn: 儿童意见的数量

source: The number of children|The child name|The children names to be added
ko: 어린이 수 | 어린이 이름 | 추가 할 어린이 이름
ru: Номер ребенка children|The name|The имена детей,которые будут добавлены.
zh_cn: 孩子的数量|孩子的名字|要添加的孩子名字

source: The number of components to compare. Pass NULL to compare the versions unchanged.
ko: 비교할 구성 요소의 수입니다. 변경되지 않은 버전을 비교하려면 NULL을 전달하십시오.
ru: Количество компонентов для сравнения.Передайте NULL для сравнения версий без изменений.
zh_cn: 要比较的组件数量。传递NULL表示比较的版本没有变化。

source: The number of components to include. Pass NULL to return the version unchanged.
ko: 포함 할 구성 요소의 수입니다. 변경되지 않은 버전을 반환하려면 NULL을 전달하십시오.
ru: Количество включаемых компонентов.Передайте NULL,чтобы вернуть версию без изменений.
zh_cn: 要包含的组件数量。传递NULL,返回未改变的版本。

source: The number of digits after the comma or NULL if not found
ko: 쉼표 뒤의 자릿수 또는 찾지 못한 경우 NULL
ru: Количество цифр после запятой или NULL,если не найдено
zh_cn: 逗号后的数字,如果没有找到,则为NULL。

source: The number of displayed lines around or -1 for the whole file
ko: 전체 파일에 대해 표시된 줄 수 또는 -1
ru: Количество отображаемых строк вокруг или -1 для всего файла
zh_cn: 周围显示的行数,如果是整个文件,则为-1。

source: The number of embedded form children
ko: 임베드 된 양식 어린이 수
ru: Количество встроенных детей формы
zh_cn: 嵌入表格的孩子数量

source: The number of entries to store in the buffer
ko: 버퍼에 저장할 항목 수
ru: Количество записей для хранения в буфере
zh_cn: 缓冲区中要存储的条目数。

source: The number of errors
ko: 에러 수
ru: Количество ошибок
zh_cn: 错误数量

source: The number of headers
ko: 헤더 수
ru: Количество заголовков
zh_cn: 页眉的数量

source: The number of items represented for the message
ko: 메시지에 표시된 항목 수
ru: Количество элементов,представленных для сообщения
zh_cn: 信息所代表的项目数

source: The number of items the hash has been cut by
ko: 해시가 잘라낸 항목 수
ru: Количество пунктов,на которых был урезан хэш.
zh_cn: 哈希值被削减的项数。

source: The number of iterated elements
ko: 반복되는 요소의 수
ru: Количество итерационных элементов
zh_cn: 迭代元素的数量

source: The number of iterations to use to stretch the password hash
ko: 비밀번호 해시를 늘리는 데 사용할 반복 횟수
ru: Количество итераций для растягивания хэша пароля
zh_cn: 用于拉伸密码散列的迭代次数。

source: The number of newlines
ko: 줄 바꿈 수
ru: Количество новых линий
zh_cn: 新行数

source: The number of parameters
ko: 매개 변수 수
ru: Количество параметров
zh_cn: 参数数量

source: The number of required InputArguments
ko: 필요한 InputArguments 수
ru: Количество требуемых входных документов
zh_cn: 所需的InputArguments的数量

source: The number of routes
ko: 노선 수
ru: Количество маршрутов
zh_cn: 航线数量

source: The number of seconds or HTTP-date after which the request may be retried
ko: 요청을 재 시도 할 수있는 시간 (초) 또는 HTTP 날짜
ru: Количество секунд или HTTP-дата,после которой запрос может быть перепроверен.
zh_cn: 重试请求的秒数或HTTP日期。

source: The number of time each env vars has been resolved
ko: 각 환경 변수가 해결 된 횟수
ru: Количество раз,когда каждая из войн зависти была решена.
zh_cn: 每个envars被解析的次数。

source: The number to use to find the indice of the message
ko: 메시지의 표시를 찾는 데 사용하는 번호
ru: Номер,с помощью которого можно найти отпечаток сообщения.
zh_cn: 用来查找信息索引的数字。

source: The number to use to pluralize of the message
ko: 메시지를 복수하기 위해 사용하는 숫자
ru: Номер,который следует использовать для множественного числа сообщений.
zh_cn: 用于信息复数化的数字。

source: The numeric currency value
ko: 숫자 통화 값
ru: Числовое значение валюты
zh_cn: 数字货币价值

source: The object
ko: 목적
ru: Объект
zh_cn: 对象

source: The object casted as array
ko: 배열로 캐스트 된 객체
ru: Объект выполнен в виде массива
zh_cn: 对象以数组形式投递

source: The object class, resource type or array count
ko: 객체 클래스, 리소스 유형 또는 배열 수
ru: Объектный класс,тип ресурса или количество массивов
zh_cn: 对象类别、资源类型或数组计数

source: The object initializers
ko: 객체 이니셜 라이저
ru: Инициализаторы объекта
zh_cn: 对象初始化器

source: The object manager
ko: 객체 관리자
ru: Объектный менеджер
zh_cn: 对象管理器

source: The object manager name
ko: 객체 관리자 이름
ru: Имя менеджера объекта
zh_cn: 对象管理器名称

source: The object or array to check
ko: 확인할 객체 또는 배열
ru: Объект или массив для проверки
zh_cn: 要检查的对象或数组

source: The object or array to modify
ko: 수정할 객체 또는 배열
ru: Объект или массив для изменения
zh_cn: 要修改的对象或数组

source: The object or array to traverse
ko: 순회 할 객체 또는 배열
ru: Объект или массив для пересечения
zh_cn: 要遍历的对象或数组

source: The object or its class name
ko: 객체 또는 클래스 이름
ru: Имя объекта или его класса
zh_cn: 对象或其类名

source: The object or the class name
ko: 객체 또는 클래스 이름
ru: Объект или имя класса
zh_cn: 对象或类名

source: The object to cast
ko: 던질 대상
ru: Объект для литья
zh_cn: 要投掷的对象

source: The object to secure
ko: 확보 할 대상
ru: Объект,который нужно обезопасить
zh_cn: 要保护的对象

source: The object to validate
ko: 검증 할 객체
ru: Объект проверки
zh_cn: 要验证的对象

source: The objects loader
ko: 객체 로더
ru: Объектный погрузчик
zh_cn: 对象加载器

source: The offset at which to remove
ko: 제거 할 오프셋
ru: Смещение,при котором необходимо удалить
zh_cn: 移除的偏移量

source: The offset at which to replace
ko: 교체 할 오프셋
ru: Смещение,при котором замена
zh_cn: 替换的偏移量

source: The offset of the violation
ko: 위반의 상쇄
ru: Компенсация нарушения
zh_cn: 违规行为的偏移

source: The offset to remove
ko: 제거 할 오프셋
ru: Смещение для удаления
zh_cn: 移除的偏移量

source: The offset where the appended piece starts in $path
ko: 추가 된 부분이 $ path에서 시작되는 오프셋
ru: Смещение,при котором прилагаемая часть начинается в $path.
zh_cn: 在$path中,被添加的部分开始的偏移量。

source: The offset where the inserted piece starts in $path
ko: 삽입 된 조각이 $ path에서 시작되는 오프셋
ru: Смещение,при котором вставленная деталь начинается в $path.
zh_cn: 在$path中插入的片段开始的偏移量。

source: The onKernelResponse method must be connected to the kernel.response event.
ko: onKernelResponse 메소드는 kernel.response 이벤트에 연결되어야합니다.
ru: Метод onKernelResponse должен быть подключен к событию kernel.response.
zh_cn: onKernelResponse方法必须连接到kernel.response事件。

source: The only methods currently supported in this class are:
ko: 이 클래스에서 현재 지원되는 유일한 메소드는 다음과 같습니다.
ru: На данный момент в этом классе поддерживаются только методы:
zh_cn: 该类目前仅支持的方法有:。

source: The only methods supported in this class are <code>getDefault</code> and <code>canonicalize</code>. All other methods will throw an exception when used.
ko: 이 클래스에서 지원되는 유일한 메소드는 <code>getDefault</code> 및 <code>canonicalize</code> 입니다. 다른 모든 메소드는 사용될 때 예외를 발생시킵니다.
ru: В этом классе поддерживаются только методы <code>getDefault</code> и <code>canonicalize</code> . Все остальные методы при использовании вызывают исключение.
zh_cn: 此类中仅支持的方法是 <code>getDefault</code> 和 <code>canonicalize</code> 。所有其他方法在使用时都会引发异常。

source: The only way to check user credentials is to try to connect the user with its credentials to the ldap.
ko: 사용자 자격 증명을 확인하는 유일한 방법은 자격 증명이있는 사용자를 ldap에 연결하는 것입니다.
ru: Единственный способ проверить учетные данные пользователя-попытаться подключить пользователя с его учетными данными к ldap.
zh_cn: 检查用户凭证的唯一方法是尝试用用户的凭证连接到ldap。

source: The operator
ko: 운영자
ru: Оператор
zh_cn: 运营商

source: The option mode: One of the VALUE_* constants
ko: 옵션 모드 : VALUE_ * 상수 중 하나
ru: Режим опции:Одна из констант VALUE_*
zh_cn: 选项模式。VALUE_*常数之一

source: The option name
ko: 옵션 이름
ru: Название опции
zh_cn: 选项名称

source: The option name can either be in snake or camel case.
ko: 옵션 이름은 뱀 또는 낙타 경우 일 수 있습니다.
ru: Имя опции может быть как в змеином,так и в верблюжьем футляре.
zh_cn: 选项名称可以是蛇形或驼形。

source: The option name,
ko: 옵션 이름
ru: Название опции,
zh_cn: 选项名称:

source: The option value
ko: 옵션 값
ru: Значение опции
zh_cn: 期权价值

source: The option value or null when not given
ko: 옵션 값 또는 제공되지 않은 경우 null
ru: Значение опциона или ноль,если не указано
zh_cn: 选项值或未给定时为空

source: The options
ko: 옵션
ru: Опции
zh_cn: 选项

source: The options (as associative array) or the value for the default option (any other type)
ko: 옵션 (연관 배열로) 또는 기본 옵션의 값 (다른 유형)
ru: Опции (как ассоциативный массив)или значение для опции по умолчанию (любой другой тип)
zh_cn: 选项(关联数组)或默认选项的值(任何其他类型)。

source: The options array for the listener
ko: 리스너의 옵션 배열
ru: Массив опций для слушателя
zh_cn: 监听器的选项阵列

source: The options array for this listener
ko: 이 청취자의 옵션 배열
ru: Массив опций для этого слушателя
zh_cn: 该监听器的选项阵列

source: The options for creating instances of the guessed class
ko: 추측 된 클래스의 인스턴스를 작성하기위한 옵션
ru: Опции создания экземпляров угаданного класса
zh_cn: 创建猜测的类的实例的选项

source: The options for the builder
ko: 빌더 옵션
ru: Опции для застройщика
zh_cn: 建设者的选择

source: The options resolver
ko: 옵션 리졸버
ru: Опциональный резольвер
zh_cn: 选项解析器

source: The options used for the configuration
ko: 구성에 사용되는 옵션
ru: Опции,используемые для конфигурации
zh_cn: 用于配置的选项

source: The ordered list of adapters used to fetch cached items
ko: 캐시 된 항목을 가져 오는 데 사용되는 정렬 된 어댑터 목록
ru: Упорядоченный список адаптеров,используемых для получения кэшированных элементов
zh_cn: 用于获取缓存项目的适配器的有序列表。

source: The ordered list of caches used to fetch cached items
ko: 캐시 된 항목을 가져 오는 데 사용되는 정렬 된 캐시 목록
ru: Упорядоченный список кэшей,используемых для получения кэшированных элементов
zh_cn: 用于获取缓存项目的有序缓存列表。

source: The origin directory
ko: 오리진 디렉토리
ru: Каталог происхождения
zh_cn: 原产地目录

source: The origin directory path
ko: 오리진 디렉토리 경로
ru: Путь к исходному каталогу
zh_cn: 源目录路径

source: The origin filename or directory
ko: 원본 파일 이름 또는 디렉토리
ru: Имя файла или каталог происхождения
zh_cn: 源文件名或目录

source: The origin in milliseconds
ko: 밀리 초 단위
ru: Происхождение в миллисекундах
zh_cn: 以毫秒为单位的原点

source: The origin request is the request instance that is sent to the code that handles requests.
ko: 오리진 요청은 요청을 처리하는 코드로 전송되는 요청 인스턴스입니다.
ru: Исходный запрос-это экземпляр запроса,который посылается в код,обрабатывающий запросы.
zh_cn: 原点请求是发送给处理请求的代码的请求实例。

source: The origin response is the response instance that is returned by the code that handles requests.
ko: 오리진 응답은 요청을 처리하는 코드에 의해 리턴되는 응답 인스턴스입니다.
ru: Оригинальный ответ-это экземпляр ответа,который возвращается кодом,обрабатывающим запросы.
zh_cn: 原点响应是由处理请求的代码返回的响应实例。

source: The origin response to filter
ko: 필터에 대한 원점 응답
ru: Реакция источника на фильтр
zh_cn: 滤波器的原点响应

source: The origin time in milliseconds
ko: 밀리 초 단위의 원산지 시간
ru: Время возникновения в миллисекундах
zh_cn: 原点时间(毫秒)

source: The original TokenInterface instance
ko: 원래의 TokenInterface 인스턴스
ru: Оригинальный экземпляр TokenInterface
zh_cn: 原始的TokenInterface实例

source: The original choice
ko: 원래 선택
ru: Первоначальный выбор
zh_cn: 最初的选择

source: The original choice keys indexed by the corresponding choice values
ko: 해당 선택 값으로 색인이 생성 된 원래 선택 키
ru: Клавиши исходного выбора,проиндексированные соответствующими значениями выбора
zh_cn: 原始选择键以相应的选择值为索引。

source: The original file
ko: 원본 파일
ru: Исходный файл
zh_cn: 原始文件

source: The original file name of the uploaded file
ko: 업로드 된 파일의 원래 파일 이름
ru: Имя оригинального файла загруженного файла
zh_cn: 上传文件的原始文件名

source: The original file name where data where stored (used for more meaningful error messages)
ko: 데이터가 저장된 원래 파일 이름 (보다 의미있는 오류 메시지에 사용됨)
ru: Исходное имя файла,в котором хранятся данные (используется для более значимых сообщений об ошибках).
zh_cn: 存储数据的原始文件名(用于更有意义的错误信息)

source: The original filename
ko: 원래 파일 이름
ru: Оригинальное имя
zh_cn: 原文件名

source: The original keys are the keys of the choice array that was passed in the "choice" option of the choice type. Note that this array may contain duplicates if the "choice" option contained choice groups:
ko: 원래 키는 선택 유형의 "선택"옵션에 전달 된 선택 배열의 ​​키입니다. "choice"옵션에 선택 그룹이 포함 된 경우이 배열에 중복이 포함될 수 있습니다.
ru: Оригинальные ключи-это ключи массива выбора,который был передан в опции "выбор" типа выбора.Обратите внимание,что этот массив может содержать дубликаты,если опция "choice" содержала группы выбора:
zh_cn: 原始键是选择类型的 "选择 "选项中传递的选择数组的键。请注意,如果 "选择 "选项中包含选择组,则该数组可能包含重复的内容。

source: The original keys indexed by the corresponding values
ko: 해당 값으로 인덱싱 된 원래 키
ru: Оригинальные ключи,проиндексированные соответствующими значениями
zh_cn: 原始键按相应的值进行索引

source: The original keys of the choices array.
ko: 선택 배열의 ​​원래 키
ru: Оригинальные ключи массива выбора.
zh_cn: 选择数组的原始键。

source: The original message contained in the envelope
ko: 봉투에 포함 된 원본 메시지
ru: Оригинальное сообщение,содержащееся в конверте
zh_cn: 信封中的原始信息

source: The original name
ko: 원래 이름
ru: Оригинальное имя
zh_cn: 原名

source: The original request
ko: 원래 요청
ru: Оригинальный запрос
zh_cn: 最初的请求

source: The original request is used as a template for a conditional GET request with the backend.
ko: 원래 요청은 백엔드와 함께 조건부 GET 요청의 템플리트로 사용됩니다.
ru: Оригинальный запрос используется в качестве шаблона для условного GET-запроса с бекендом.
zh_cn: 原始请求作为模板,用于与后端进行有条件的GET请求。

source: The original resource importing the new resource
ko: 새 자원을 가져 오는 원래 자원
ru: Импорт нового ресурса
zh_cn: 原资源导入新资源

source: The original token
ko: 원래 토큰
ru: Оригинальный жетон
zh_cn: 最初的令牌

source: The out ServiceReferenceGraphEdge array
ko: out ServiceReferenceGraphEdge 배열
ru: Массив ServiceReferenceGraphEdge аут.
zh_cn: 输出服务参考图边缘数组。

source: The output
ko: 출력
ru: Выход
zh_cn: 输出

source: The output directory
ko: 출력 디렉토리
ru: Выходной каталог
zh_cn: 输出目录

source: The package
ko: 패키지
ru: Пакет
zh_cn: 包裹

source: The package allows to use more than one base URLs in which case it randomly chooses one for each asset; it also guarantees that any given path will always use the same base URL to be nice with HTTP caching mechanisms.
ko: 패키지는 둘 이상의 기본 URL을 사용할 수 있도록하며,이 경우 각 자산에 대해 하나를 임의로 선택합니다. 또한 주어진 경로가 항상 동일한 기본 URL을 사용하여 HTTP 캐싱 메커니즘에 적합하도록 보장합니다.
ru: Пакет позволяет использовать более одного базового URL,в этом случае он случайным образом выбирает один для каждого актива;он также гарантирует,что любой заданный путь всегда будет использовать один и тот же базовый URL,чтобы быть хорошим с механизмами HTTP-кэширования.
zh_cn: 该包允许使用多个基础URL,在这种情况下,它为每个资产随机选择一个;它还保证任何给定的路径将始终使用相同的基础URL,以配合HTTP缓存机制。

source: The package name
ko: 패키지 이름
ru: Название пакета
zh_cn: 包装名称

source: The padded string
ko: 패딩 문자열
ru: Мягкая струна
zh_cn: 填充的字符串

source: The parameter $type is currently ignored.
ko: $ type 매개 변수는 현재 무시됩니다.
ru: Параметр $type в настоящее время игнорируется.
zh_cn: 参数$type目前被忽略。

source: The parameter bag
ko: 파라미터 백
ru: Пакет параметров
zh_cn: 参数袋

source: The parameter bag is frozen.
ko: 매개 변수 백이 동결되었습니다.
ru: Мешок с параметрами заморожен.
zh_cn: 参数袋被冻结。

source: The parameter bag is frozen;
ko: 매개 변수 백이 동결되었습니다.
ru: Мешок с параметрами заморожен;
zh_cn: 参数袋被冻结。

source: The parameter key
ko: 파라미터 키
ru: Ключ параметра
zh_cn: 参数键

source: The parameter key that references the non-existent parameter
ko: 존재하지 않는 매개 변수를 참조하는 매개 변수 키
ru: Ключ параметра,который ссылается на несуществующий параметр
zh_cn: 引用不存在的参数的参数键。

source: The parameter name
ko: 매개 변수 이름
ru: Имя параметра
zh_cn: 参数名称

source: The parameter value
ko: 매개 변수 값
ru: Значение параметра
zh_cn: 参数值

source: The parameter value or null if nonexistent
ko: 매개 변수 값 또는 존재하지 않는 경우 null
ru: Значение параметра или ноль в случае его отсутствия
zh_cn: 参数值,如果不存在则为空

source: The parameters
ko: 매개 변수
ru: Параметры
zh_cn: 参数

source: The parameters substituted in the error message
ko: 오류 메시지에서 대체 된 매개 변수
ru: Параметры,подставленные в сообщение об ошибке
zh_cn: 错误信息中替换的参数

source: The parameters that should be substituted in the message template
ko: 메시지 템플리트에서 대체되어야하는 매개 변수
ru: Параметры,которые должны быть подставлены в шаблон сообщения
zh_cn: 信息模板中应替换的参数。

source: The parameters to substitute in the raw violation message
ko: 원시 위반 메시지에서 대체 할 매개 변수
ru: Параметры для подстановки в необработанном сообщении о нарушении
zh_cn: 在原始违规信息中要替换的参数

source: The parent form or null if there is none
ko: 부모 폼. 존재하지 않는 경우는 null
ru: Родительская форма или нулевая,если нет
zh_cn: 父表格,如果没有,则为空。

source: The parent node
ko: 부모 노드
ru: Родительский узел
zh_cn: 父节点

source: The parent path or null
ko: 부모 경로 또는 null
ru: Родительский путь или нулевой
zh_cn: 父路径或空

source: The parent property path is the one that contains the same items as this one except for the last one.
ko: 부모 속성 경로는 마지막 경로를 제외하고이 항목과 동일한 항목을 포함하는 경로입니다.
ru: Путь к родительскому свойству-тот,который содержит те же элементы,что и этот,за исключением последнего.
zh_cn: 父属性路径是指除了最后一个项目外,其他项目都与这个项目相同。

source: The parent token
ko: 부모 토큰
ru: Родительский жетон
zh_cn: 父代币

source: The parent type or null
ko: 부모 유형 또는 null
ru: Родительский тип или ноль
zh_cn: 父类型或空

source: The parent view
ko: 부모보기
ru: Родительский взгляд
zh_cn: 父级视图

source: The parent view or null
ko: 부모 뷰 또는 null
ru: Родительский взгляд или нулевой
zh_cn: 父视图或空

source: The parent view, if available
ko: 사용 가능한 경우 상위보기
ru: Родительский вид,если доступен
zh_cn: 父视图,如果有的话

source: The parent view.
ko: 부모보기.
ru: Родительский взгляд.
zh_cn: 父母的观点。

source: The parsed DateTime or the default value if the header does not exist
ko: 구문 분석 된 DateTime 또는 헤더가없는 경우 기본값
ru: Обработанное значение DateTime или значение по умолчанию,если заголовок не существует
zh_cn: 解析的DateTime,如果头不存在,则为默认值。

source: The parsed numeric value of false on error
ko: 구문 분석 된 숫자 값이 false 인 경우 false
ru: Разобранное числовое значение false по ошибке
zh_cn: 错误时解析的数值为false。

source: The parsed string
ko: 파싱 ​​된 문자열
ru: Разобранная строка
zh_cn: 解析后的字符串

source: The parsed value of false on error
ko: 오류시 구문 분석 된 값 false
ru: Разобранное значение false on error
zh_cn: 错误时解析值为false

source: The pass type
ko: 패스 타입
ru: Тип пропуска
zh_cn: 通行证类型

source: The passed options
ko: 전달 된 옵션
ru: Переданные опции
zh_cn: 已通过的选项

source: The passed path will be appended to the current property path of the execution context.
ko: 전달 된 경로는 실행 컨텍스트의 현재 속성 경로에 추가됩니다.
ru: Переданный путь будет добавлен к текущему пути свойства контекста исполнения.
zh_cn: 传递的路径将被附加到执行上下文的当前属性路径中。

source: The password
ko: 비밀번호
ru: Пароль
zh_cn: 密码

source: The password to be used
ko: 사용할 비밀번호
ru: Используемый пароль
zh_cn: 要使用的密码

source: The password to check
ko: 확인할 비밀번호
ru: Пароль для проверки
zh_cn: 检查密码

source: The password to encode
ko: 인코딩 할 비밀번호
ru: Пароль для кодирования
zh_cn: 编码密码

source: The path
ko: 경로
ru: Путь
zh_cn: 途径

source: The path as string
ko: 문자열로 경로
ru: Путь как строка
zh_cn: 路径为字符串

source: The path info
ko: 경로 정보
ru: Информация о пути
zh_cn: 路径信息

source: The path info always starts with a /.
ko: 경로 정보는 항상 /로 시작합니다.
ru: Информация о пути всегда начинается с символа /.
zh_cn: 路径信息总是以/开头。

source: The path info to be parsed
ko: 파싱 ​​할 경로 정보
ru: Информация о пути,который нужно разобрать
zh_cn: 要解析的路径信息
