Repository: Yuniorcr/runebook
Catalog: xlf/packages/*/python/aruudy.001.xlf
Languages: es, ja, ko, ru

source: if found, it is a json object with all the bahr's description
es: si se encuentra,es un objeto json con toda la descripción de bahr
ja: 見つかった場合は、ボーラーのすべての説明を含む json オブジェクトです。
ko: 발견되면 모든 bahr 설명이 포함 된 json 객체입니다.
ru: если он найден,то это объект Джсона со всем описанием Бара.

source: if not found, it is a string "None"
es: si no se encuentra,es una cadena "Ninguno"
ja: 見つからなかった場合は、文字列 "None" です。
ko: 찾을 수없는 경우 "None"문자열입니다.
ru: если не найдено,то это строка "Нет".

source: key: a verse which describs the bahr
es: clave:un verso que describe el bahr
ja: キー
ko: 키 : bahr를 설명하는 구절
ru: ключ:стих,который описывает бахр

source: mnemonic: foot's mnemonic
es: mnemotecnia:mnemotecnia de los pies
ja: 足のニーモニック
ko: 니모닉 : 발의 니모닉
ru: мнемонический:мнемонический стопы

source: mnemonic: the feet of the hemistich
es: mnemotécnica:los pies del hemisferio
ja: ヘミスティックの足
ko: 니모닉 : hemistich의 발
ru: мнемонический:ноги полушария

source: name: an object containing the different names of the meter
es: nombre:un objeto que contiene los diferentes nombres del medidor
ja: name:メーターの異なる名前を含むオブジェクト
ko: 이름 : 미터의 다른 이름을 포함하는 개체
ru: название:объект,содержащий различные названия счетчика.

source: norm: the text normalized: no tatweel, fix some diacretics
es: norma:el texto normalizado:no tatweel,arreglar algunos diacríticos
ja: norm:正規化されたテキスト:no tatweel,fix some diacretics
ko: 표준 : 텍스트 정규화 : tatweel 없음, 일부 분음 기호 수정
ru: норма:текст нормализован:нет татвиля,исправить диакретику.

source: part: part of the text that fits the foot
es: parte:parte del texto que se ajusta al pie
ja: 部分:足にフィットするテキストの部分
ko: part : 발에 맞는 텍스트 부분
ru: часть:часть текста,которая подходит к стопе.

source: parts: the text divided into parts accoding to the feet (as a list). each element is an object with the following information:
es: partes:el texto dividido en partes según los pies (como una lista).cada elemento es un objeto con la siguiente información:
ja: 各要素は以下の情報を持つオブジェクトです。
ko: 부분 : 발에 따라 부분으로 분할 된 텍스트 (목록). 각 요소는 다음 정보를 포함하는 객체입니다.
ru: части:текст,разделенный на части,обозначающие ноги (в виде списка).каждый элемент является объектом со следующей информацией:

source: poetry
es: poesía
ko: 시
ru: стихи

source: prosody: prosody writing (الكتابة العروضية) of the text
es: prosodia:escritura prosódica (الكتابة العروضية)del texto
ja: プロソディ:文章のプロソディ書き(الكتابة العروضية)
ko: 운율 : 텍스트의 운율 쓰기 (الكتابة العروضية)
ru: прозодия:написание прозодии (الكتابة العروضية)текста

source: std_scansion and used_scansion: the standard scansion of the bahr, and the used one. The two of them have the following elements:
es: std_scansion y used_scansion:la escansión estándar de la bahr,y la usada.Los dos tienen los siguientes elementos:
ja: std_scansionとused_scansion:ボーアの標準的な拡張子と、中古の拡張子。この2つは次のような要素を持っています。
ko: std_scansion 및 used_scansion : bahr의 표준 스캔 및 사용 된 스캔. 두 가지 요소는 다음과 같습니다.
ru: std_scansion и use_scansion:стандартное сканирование бара и используемого.Оба они имеют следующие элементы:

source: trans: transliterated names
es: trans:nombres transliterados
ja: トランス
ko: trans : 음역 된 이름
ru: транскрипт:транслитерированные имена

source: type: the type of each foot
es: tipo:el tipo de cada pie
ja: type:各足のタイプ
ko: 유형 : 각 발의 유형
ru: тип:тип каждой стопы

source: type: the type of the foot
es: tipo:el tipo del pie
ja: type:足のタイプ
ko: 유형 : 발의 유형
ru: тип:тип стопы

source: web
ja: ウェブ
ko: 편물
ru: веб-сайт

source: web API: kariminf.pythonanywhere.com/
es: API web:kariminf.pythonanywhere.com/
ko: 웹 API : kariminf.pythonanywhere.com/
ru: веб API:kariminf.pythonanywhere.com/

source: Aruudy
ja: アルユーディー
