Repository: Yuniorcr/runebook
Catalog: xlf/packages/*/python/aruudy.001.xlf
Languages: es, ja, ko, ru

source: "-": long syllable
es: "-": s&iacute;laba larga
ja: "-"：長い音節
ko: "-": 긴 음절
ru: "-": длинный слог

source: "s": sabad [cord] (سبب); it represents an unvowelled letter
es: "s": sabad [cord&oacute;n] (سبب); representa una carta sin votos
ja: "s"：sabad [コード]（سبب）; それは無音の手紙を表す
ko: "s": sabad [코드] (سبب); 그것은 unvowelled 편지를 나타냅니다
ru: "s": sabad [шнур] (سبب); он представляет собой непросказанную букву

source: "u": short syllable;
es: "u": s&iacute;laba corta;
ja: "u"：短い音節。
ko: "u": 짧은 음절;
ru: &laquo;u&raquo;: короткий слог;

source: "w": watad [peg] (وتد); it represents a vowelled letter
es: "w": watad [clavija] (وتد); representa una letra vocal
ja: "w"：watad [peg]（وتد）; 母音を表す
ko: "w": watad [peg] (وتد); 그것은 vowelled 편지를 나타냅니다
ru: &laquo;ш&raquo;: ватад [привязка] (وتد); он представляет собой гласную букву

source: $host/info/[name]
es: $ host / info / [nombre]
ko: $ host / info / [이름]
ru: $ host / info / [имя]

source: $host/shatr/[text]
es: $ host / shatr / [texto]
ja: $ host / shatr / [テキスト]
ko: $ host / shatr / [텍스트]
ru: $ host / shatr / [текст]

source: $host/shatr/[text]/[opt]
es: $ host / shatr / [texto] / [opt]
ko: $ host / shatr / [텍스트] / [옵션]
ru: $ host / shatr / [текст] / [опция]

source: <strong>Foot [Tafiila]</strong>: (تفعيلة) the rhythmic parts which compose the scansion
es: <strong>Pie [Tafiila]</strong> : (تفعيلة) las partes r&iacute;tmicas que componen la escansi&oacute;n
ja: <strong>Foot [Tafiila]</strong>：（تفعيلة）スキャンを構成するリズミカルなパート
ko: <strong>Foot [Tafiila]</strong> : (تفعيلة) 스캔을 구성하는 리드미컬 한 부분
ru: <strong>Foot [Tafiila]</strong> : (تفعيلة) ритмические части, из которых состоит сканирование.

source: <strong>Hemistich [Shatr]</strong>: (شطر) a part of a verse
es: <strong>Hemistich [Shatr]</strong> : (شطر) una parte de un verso
ja: <strong>Hemistich [Shatr]</strong>：（شطر）詩の一部
ko: <strong>Hemistich [Shatr]</strong> : (شطر) 구절의 일부
ru: <strong>Hemistich [Shatr]</strong> : (شطر) часть стиха

source: <strong>Meter [Bahr]</strong>: (بحر) The rhythme
es: <strong>Metro [Bahr]</strong> : (بحر) El ritmo
ja: <strong>メーター[バール]</strong>：（بحر）リズム
ko: <strong>Meter [Bahr]</strong> : (بحر) 리듬
ru: <strong>Метр [Bahr]</strong> : (بحر) Ритм

source: <strong>Scansion [Wazn]</strong>: (وزن) the weight of syllables, or the rhythmic structure
es: <strong>Escansi&oacute;n [Wazn]</strong> : (وزن) el peso de las s&iacute;labas o la estructura r&iacute;tmica
ja: <strong>Scansion [Wazn]</strong>：（وزن）音節の重み、またはリズム構造
ko: <strong>Scansion [Wazn]</strong> : (وزن) 음절의 무게 또는 리듬 구조
ru: <strong>Сканирование [Wazn]</strong> : (وزن) вес слогов или ритмическая структура

source: <strong>Verse [Bayt]</strong>: (بيت) a line of poetry which is composed of two parts.
es: <strong>Verso [Bayt]</strong> : (بيت) una l&iacute;nea de poes&iacute;a que se compone de dos partes.
ja: <strong>詩[ベイト]</strong>：（بيت）2つの部分で構成される詩の行。
ko: <strong>Verse [Bayt]</strong> : (بيت) 두 부분으로 구성된시의 한 줄입니다.
ru: <strong>Стих [Bayt]</strong> : (بيت) стихотворная строка, состоящая из двух частей.

source: <strong>meter.get_ameter(text)</strong>: returns a string of arabic meter with "v" as haraka "c" as sukuun
es: <strong>meter.get_ameter (texto)</strong> : devuelve una cadena de <strong>m&eacute;trica</strong> &aacute;rabe con "v" como haraka "c" como sukuun
ja: <strong>meter.get_ameter（text）</strong>： "v"をハラカ、 "c"をsukuunとするアラビアメーターの文字列を返します
ko: <strong>meter.get_ameter (text)</strong> : "v"가 haraka "c"인 아랍어 미터 문자열을 sukuun으로 반환합니다.
ru: <strong>meter.get_ameter (текст)</strong> : возвращает строку с арабскими метрами с "v" как харака, "c" как сукуун

source: <strong>prosody.normalize(text)</strong>: returns a normalized text; deletes tatweel and fix some diacretics problems
es: <strong>prosody.normalize (text)</strong> : devuelve un texto normalizado; elimina tatweel y soluciona algunos problemas diacr&eacute;ticos
ja: <strong>prosody.normalize（text）</strong>：正規化されたテキストを返します。tatweelを削除し、いくつかのダイアクレティックスの問題を修正します
ko: <strong>prosody.normalize (text)</strong> : 정규화 된 텍스트를 반환합니다. tatweel을 삭제하고 일부 분뇨 문제를 수정합니다.
ru: <strong>prosody.normalize (текст)</strong> : возвращает нормализованный текст; удаляет татвил и исправляет некоторые диакретические проблемы

source: <strong>prosody.prosody_form(text)</strong>: returns the prosody writing (الكتابة العروضية) of the text
es: <strong>prosody.prosody_form (texto)</strong> : devuelve la escritura prosodia (الكتابة العروضية) del texto
ja: <strong>prosody.prosody_form（text）</strong>：<strong>テキスト</strong>の韻律の記述（الكتابةالعروضية）を返します
ko: <strong>prosody.prosody_form (text)</strong> : <strong>텍스트</strong> 의 운율 쓰기 (الكتابة العروضية)를 반환합니다.
ru: <strong>prosody.prosody_form (текст)</strong> : возвращает написание просодии (الكتابة العروضية) текста

source: API with flask
es: API con frasco
ja: フラスコを使ったAPI
ko: 플라스크가있는 API
ru: API с колбой

source: Affording feet types and the parts according to these feet
es: Ofreciendo los tipos de pies y las partes de acuerdo a estos pies...
ja: 足の種類とそれに応じた部品を提供しています。
ko: 발의 종류와이 발에 따른 부품 부담
ru: Указание типов ног и деталей в соответствии с этими ногами

source: Arabic if the option is "a"
es: En árabe si la opción es "a"
ja: オプションが "a "の場合はアラビア語
ko: 옵션이 "a"인 경우 아랍어
ru: Арабский язык,если вариант "а"

source: Arabic poetry meter detection
es: Detección del medidor de poesía árabe
ja: アラビア語の詩のメートル検出
ko: 아랍시 미터 감지
ru: определение счётчика арабской поэзии

source: Arabic poetry package
es: Paquete de poesía árabe
ja: アラビア語の詩のパッケージ
ko: 아랍시 패키지
ru: пакет арабских стихотворений

source: Aruudy is a light library for Arabic prosody (Aruud) or "Science of Poetry".
es: Aruudy es una biblioteca ligera para la prosodia árabe (Aruud)o "Ciencia de la Poesía".
ja: Aruudyは、アラビア語のプロソディ(アルード)、あるいは「詩の科学」のためのライトライブラリーです。
ko: Aruudy는 아랍어 운율 (Aruud) 또는 "Science of Poetry"를위한 라이트 라이브러리입니다.
ru: Арууди-это легкая библиотека арабской проздии (Арууда)или "Науки поэзии".

source: CGI (Common Gateway Interface) program
es: El programa CGI (Common Gateway Interface)
ja: CGI(Common Gateway Interface)プログラム
ko: CGI (Common Gateway Interface) 프로그램
ru: Программа CGI (Общий шлюзовой интерфейс)

source: Command line
es: Línea de mando
ja: コマンドライン
ko: 커맨드 라인
ru: Командная строка

source: Copyright (C) 2014-2019 Abdelkrime Aries
ja: Copyright (C)2014-2019 アブデルクライム・アリーズ
ko: 저작권 (C) 2014-2019 Abdelkrime Aries
ru: Авторское право (C)2014-2019 Abdelkrime Aries

source: Detecting Arabic poetry meter
es: Detección del medidor de poesía árabe
ja: アラビア語の詩のメーターを検出する
ko: 아랍시 측정기 감지
ru: Обнаружение счетчика арабской поэзии

source: English if the option is "e"
es: Inglés si la opción es "e"
ja: オプションが "e "の場合は英語
ko: 옵션이 "e"인 경우 영어
ru: Английский язык,если выбрана опция "e"

source: Example:
es: Ejemplo:
ja: 例。
ko: 예:
ru: Пример:

source: Features
es: Características
ja: 特徴
ko: 풍모
ru: Особенности

source: Finding the arabic prosodic units "watad" and "sabab" based on haraka (vowel)
es: Encontrando las unidades prosódicas arábigas "watad" y "sabab" basadas en el haraka (vocal)
ja: ハラカ(母音)に基づくアラビア語の韻律単位「ワタド」と「サバーブ」の探索
ko: 하라 카 (모음)를 기반으로 아랍어 운율 단위 "watad"및 "sabab"찾기
ru: Поиск арабских прозодических единиц "ватад" и "сабаб" на основе хараки (гласный звук)

source: Finding the english prosodic units based on syllables
es: Encontrar las unidades prosódicas inglesas basadas en sílabas
ja: シラブルに基づいて英語のプロソディックユニットを見つける
ko: 음절을 기반으로 영어 운율 단위 찾기
ru: Поиск английских прозодических единиц на основе слогов

source: For example:
es: Por ejemplo:
ja: 例えば
ko: 예를 들면 다음과 같습니다.
ru: Например:

source: Get information about a meter
es: Obtener información sobre un medidor
ja: メーターの情報を得る
ko: 미터에 대한 정보 얻기
ru: Получить информацию о счетчике

source: Get the meter of a Shatr (part of verse)
es: Consigue el metro de un Shatr (parte del verso)
ja: シャトルのメーターを取得します。
ko: Shatr의 미터를 얻으십시오 (구절의 일부)
ru: Возьмите счетчик Шатра (часть стиха).

source: Get the meters information by either its arabic or english names
es: Obtener la información de los medidores por sus nombres en árabe o en inglés
ja: アラビア語か英語の名前によってメートル情報を得て下さい
ko: 아랍어 또는 영어 이름으로 미터 정보를 가져옵니다.
ru: Получить информацию о счетчиках либо по их арабским,либо по английским названиям.

source: If the text is not vocalized at all, you must vocalize it manually or automatically. A project you can use is <a href="https://github.com/linuxscout/mishkal">Mishkal</a>. When you use it with Aruudy, you have to keep in mind that Aruudy is Apache-2 licensed while <a href="https://github.com/linuxscout/mishkal">Mishkal</a> is GPL-3 licensed.
es: Si el texto no se vocaliza en absoluto, debe vocalizarlo manual o autom&aacute;ticamente. Un proyecto que puede utilizar es <a href="https://github.com/linuxscout/mishkal">Mishkal</a> . Cuando lo usa con Aruudy, debe tener en cuenta que Aruudy tiene licencia Apache-2 mientras que <a href="https://github.com/linuxscout/mishkal">Mishkal</a> tiene licencia GPL-3.
ja: テキストがまったく発声されない場合は、手動または自動で発声する必要があります。使用できるプロジェクトは<a href="https://github.com/linuxscout/mishkal">Mishkal</a>です。 Aruudyで使用する場合、ArishyはApache-2ライセンス、<a href="https://github.com/linuxscout/mishkal">Mishkal</a>はGPL-3ライセンスであることを覚えておく必要があります。
ko: 텍스트가 전혀 발성되지 않으면 수동 또는 자동으로 발성해야합니다. 사용할 수있는 프로젝트는 <a href="https://github.com/linuxscout/mishkal">Mishkal</a> 입니다. Aruudy와 함께 사용할 때 Aruudy는 Apache-2 라이선스이고 <a href="https://github.com/linuxscout/mishkal">Mishkal</a> 은 GPL-3 라이선스 임을 기억해야합니다 .
ru: Если текст вообще не озвучивается, вы должны озвучивать его вручную или автоматически. Вы можете использовать проект &laquo; <a href="https://github.com/linuxscout/mishkal">Мишкал&raquo;</a> . Когда вы используете его с Aruudy, вы должны помнить, что Aruudy имеет лицензию Apache-2, а <a href="https://github.com/linuxscout/mishkal">Mishkal</a> - лицензию GPL-3.

source: If you put "none", you will receive just the names of the meter.
es: Si pones "ninguno",recibirás sólo los nombres del medidor.
ja: none」を入れると、メーターの名前だけが表示されます。
ko: "없음"을 입력하면 미터 이름 만 받게됩니다.
ru: Если вы поставите "нет",то получите только названия счетчиков.

source: If you want to include all elements and ommit some, you can put a minus in front of your options list. Example:
es: Si quieres incluir todos los elementos y omitir algunos,puedes poner un menos delante de tu lista de opciones.Ejemplo:
ja: すべての要素を含めて一部を省略したい場合は、オプションリストの前にマイナスを付けることができます。例
ko: 모든 요소를 ​​포함하고 일부는 생략하려면 옵션 목록 앞에 마이너스를 넣을 수 있습니다. 예:
ru: Если вы хотите включить все элементы и оставить некоторые,вы можете поставить минус перед списком опций.Пример:

source: In Arabic scansion, we use two letters:
es: En la escaneada árabe,usamos dos letras:
ja: アラビア語の拡張子では、2文字を使います。
ko: 아랍어 스캔에서는 두 글자를 사용합니다.
ru: В арабском сканере мы используем две буквы:

source: In english scansion, we use two characters:
es: En la escansión inglesa,usamos dos caracteres:
ja: 英語の拡張子では、2つの文字を使用します。
ko: 영어 스캔에서는 두 문자를 사용합니다.
ru: В английском сканере мы используем два символа:

source: Information about Arabic poetery meters
es: Información sobre los medidores de poesía árabe
ja: アラビア語のポエトリーメーターに関する情報
ko: 아랍시 미터에 대한 정보
ru: Информация об арабских поэтических счетчиках

source: Install
es: Instalar
ja: インストール
ko: 설치
ru: Установить

source: License
es: Licencia
ja: ライセンス
ko: 특허
ru: Лицензия

source: Licensed under the Apache License, Version 2.0 (the "License"); you may not use this file except in compliance with the License. You may obtain a copy of the License at
es: Licenciado bajo la Licencia de Apache,Versión 2.0 (la "Licencia");no puede utilizar este archivo excepto en cumplimiento de la Licencia.Puede obtener una copia de la Licencia en
ja: このファイルは Apache License,Version 2.0 (以下「ライセンス」といいます)の下でライセンスされています。ライセンスのコピーは以下の場所で入手することができます。
ko: Apache 라이센스, 버전 2.0 (이하 "라이센스")에 따라 라이센스가 부여됩니다. 라이센스를 준수하지 않는 한이 파일을 사용할 수 없습니다. 라이센스 사본은 다음에서 구할 수 있습니다.
ru: Лицензия Apache версии 2.0 ("Лицензия");вы не можете использовать этот файл,кроме как в соответствии с Лицензией.Вы можете получить копию Лицензии по адресу

source: List all available meters
es: Enumere todos los medidores disponibles
ja: 使用可能なメーターをすべてリストアップ
ko: 사용 가능한 모든 미터 나열
ru: Перечислить все имеющиеся счетчики

source: Normalizing part (shatr) of a verse: delete tatweel, add forgotten diacretics
es: Normalizar la parte (shatr)de un verso:eliminar el tatweel,añadir los diacríticos olvidados
ja: 詩の一部(シャトル)を正規化する:tatweelを削除し、忘れられていた発音を追加する。
ko: 구절의 일부 (shatr) 정규화 : tatweel 삭제, 잊혀진 분음 기호 추가
ru: Нормализующая часть (штэр)стиха:удалить татвиль,добавить забытые диакретики

source: Notions
es: Nociones
ja: 概念
ko: 개념
ru: Понятия

source: Programming
es: Programación
ja: プログラミング
ko: 프로그램 작성
ru: Программирование

source: Recommendations
es: Recomendaciones
ja: お勧め
ko: 권장 사항
ru: Рекомендации

source: Recover all meters (arabic name, english name, transliterated name)
es: Recuperar todos los metros (nombre árabe,nombre inglés,nombre transliterado)
ja: すべてのメーターを回復する (アラビア語名、英語名、翻訳された名前)
ko: 모든 미터 복구 (아랍어 이름, 영어 이름, 음역 이름)
ru: Восстановить все счетчики (арабское название,английское название,транслитерированное название)

source: Retrieve information about a meter by its name (arabic or english). It returns a json object describing the meter (bahr).
es: Recuperar información sobre un metro por su nombre (árabe o inglés).Devuelve un objeto json que describe el metro (bahr).
ja: メーターに関する情報を名前 (アラビア語または英語)で取得します。メーター (bahr)を記述した json オブジェクトを返します。
ko: 이름 (아랍어 또는 영어)으로 미터에 대한 정보를 검색합니다. 미터 (bahr)를 설명하는 json 객체를 반환합니다.
ru: Получить информацию о счетчике по его названию (на арабском или английском языке).Возвращает объект json,описывающий счетчик (бахр).

source: Returns a json list with names of available Arabic poetry meters (16 meters). The names are:
es: Devuelve una lista json con los nombres de los medidores de poesía árabe disponibles (16 metros).Los nombres son:
ja: 利用可能なアラビア語の詩のメートル (16 メートル)の名前を json リストで返します。名前は以下の通りです。
ko: 사용 가능한 아랍어시 미터 (16 미터)의 이름이있는 json 목록을 반환합니다. 이름은 다음과 같습니다.
ru: Возвращает список json с названиями имеющихся счетчиков арабской поэзии (16 метров).Названия:

source: Same as <strong>$host/shatr/[text]</strong>, but you can choose which elements to include in the response by separating their names with a comma (","). If you ommit "bahr", it will return just the names of the meter and not all its information. Example:
es: Igual que <strong>$ host / shatr / [text]</strong> , pero puede elegir qu&eacute; elementos incluir en la respuesta separando sus nombres con una coma (","). Si omite "bahr", devolver&aacute; solo los nombres del medidor y no toda su informaci&oacute;n. Ejemplo:
ja: <strong>$ host / shatr / [text]</strong>と同じですが、名前をコンマ（ "、"）で区切ることにより、応答に含める要素を選択できます。「bahr」を省略した場合、メーターの名前だけが返され、すべての情報は返されません。例：
ko: <strong>$ host / shatr / [text]</strong> 와 동일 하지만 쉼표 ( ",")로 이름을 구분하여 응답에 포함 할 요소를 선택할 수 있습니다. "bahr"을 생략하면 모든 정보가 아닌 미터의 이름 만 반환됩니다. 예:
ru: То же, что и <strong>$ host / shatr / [text]</strong> , но вы можете выбрать, какие элементы включать в ответ, разделив их имена запятой (","). Если вы опустите &laquo;bahr&raquo;, он вернет только названия счетчика, а не всю информацию о нем. Пример:

source: Test here
es: Prueba aquí
ja: ここでテスト
ko: 여기서 테스트
ru: Тест здесь

source: The api has these request types:
es: La API tiene estos tipos de solicitudes:
ja: api には以下のようなリクエストタイプがあります。
ko: API에는 다음과 같은 요청 유형이 있습니다.
ru: У АПИ есть такие типы запросов:

source: The api uses <strong>flask</strong> which must be installed. To test the api on your machine (locally), type:
es: La api usa un <strong>matraz</strong> que debe estar instalado. Para probar la API en su m&aacute;quina (localmente), escriba:
ja: APIは、インストールする必要がある<strong>フラスコ</strong>を使用します。マシンで（ローカルに）APIをテストするには、次のように入力します。
ko: API는 반드시 설치해야하는 <strong>플라스크</strong> 를 사용 합니다. 머신에서 (로컬로) api를 테스트하려면 다음을 입력하십시오.
ru: В api используется <strong>фляга,</strong> которую необходимо установить. Чтобы протестировать api на вашем компьютере (локально), введите:

source: The name can be in Arabic or in English.
es: El nombre puede estar en árabe o en inglés.
ja: 名前はアラビア語でも英語でも構いません。
ko: 이름은 아랍어 또는 영어 일 수 있습니다.
ru: Название может быть на арабском или английском языке.

source: This will create a server on <strong><a href="http://127.0.0.1:5000">http://127.0.0.1:5000</a></strong>.
es: Esto crear&aacute; un servidor en <strong><a href="http://127.0.0.1:5000">http://127.0.0.1:5000</a></strong> .
ja: これにより、<strong><a href="http://127.0.0.1:5000">http://127.0.0.1:5000に</a></strong>サーバーが作成され<strong>ます</strong>。
ko: <strong><a href="http://127.0.0.1:5000">http://127.0.0.1:5000에</a></strong> 서버가 생성됩니다 .
ru: Это создаст сервер на <strong><a href="http://127.0.0.1:5000">http://127.0.0.1:5000</a></strong> .

source: This will return the names of the meter with the texts arabic scansion.
es: Esto devolverá los nombres del medidor con los textos de la escaneada árabe.
ja: これは、テキストのアラビア語の拡張子を持つメーターの名前を返します。
ko: 이것은 아랍어 스캔 텍스트와 함께 미터의 이름을 반환합니다.
ru: Это вернет названия счетчиков с арабским сканированием текстов.

source: To detect the meter, the verse's part must be fully vocalized (has diacritics). This program can detect and infer some common unvolization patterns, such as the first letter of a word if it is not an alif (must be vocalized). In this case, it marks a letter as vocalized without giving the right vocalization: if it is damma, kasra or fatha.
es: Para detectar el medidor,la parte del verso debe estar totalmente vocalizada (tiene diacríticos).Este programa puede detectar e inferir algunos patrones comunes de desvolización,como la primera letra de una palabra si no es un alif (debe ser vocalizada).En este caso,marca una letra como vocalizada sin dar la vocalización correcta:si es damma,kasra o fatha.
ja: メーターを検出するには、詩の部分が完全に発声されていなければなりません(diacriticsを持っています)。このプログラムは、単語の最初の文字がalifでない場合(発声されていなければならない)のような、一般的な発声されていないパターンを検出し、推論することができます。この場合、正しい発声を与えずに発声された文字としてマークします。
ko: 미터를 감지하려면 구절의 부분이 완전히 발성되어야합니다 (분음 부호 포함). 이 프로그램은 단어의 첫 글자가 알 리프가 아닌 경우 (반드시 발성해야 함) 단어의 첫 글자와 같은 몇 가지 일반적인 무관심 패턴을 감지하고 추론 할 수 있습니다. 이 경우 올바른 발성을 제공하지 않고 문자를 발성 된 것으로 표시합니다 (damma, kasra 또는 fatha 인 경우).
ru: Чтобы обнаружить счетчик,часть стиха должна быть полностью вокализована (имеет диакритические свойства).Эта программа может обнаружить и сделать вывод о некоторых распространённых шаблонах неволизации,таких как первая буква слова,если это не алиф (должен быть вокализованный).В этом случае она отмечает букву как вокализованную,не давая при этом правильной вокализации:если это дамма,кастра или фатха.

source: To read the API documentation (chack Aruudy on readthedocs)[https://aruudy.readthedocs.io/en/latest/]
es: Para leer la documentación del API (chack Aruudy en readthedocs)[https://aruudy.readthedocs.io/en/latest/]
ja: APIドキュメントを読むには(readthedocs上のchack Aruudy)[https://aruudy.readthedocs.io/en/latest/]
ko: API 문서를 읽으려면 (readthedocs에서 Aruudy를 해킹) [https://aruudy.readthedocs.io/en/latest/]
ru: Ознакомиться с документацией по API (chack Aruudy on readthedocs)[https://aruudy.readthedocs.io/en/latest/].

source: Transliteration if the option is "t"
es: La transliteración si la opción es "t"
ja: オプションが "t "の場合の音訳
ko: 옵션이 "t"인 경우 음역
ru: Транслитерация,если опция "t".

source: Unless required by applicable law or agreed to in writing, software distributed under the License is distributed on an "AS IS" BASIS, WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied. See the License for the specific language governing permissions and limitations under the License.
es: A menos que lo exija la legislación aplicable o se acuerde por escrito,el software distribuido bajo la Licencia se distribuye "TAL CUAL",SIN GARANTÍAS NI CONDICIONES DE NINGÚN TIPO,ya sean expresas o implícitas.Consulte la Licencia para conocer el lenguaje específico que rige los permisos y limitaciones de la Licencia.
ja: 宛先不明の場合は、「宛先不明の場合は、宛先不明の場合は、宛先不明の場合は、宛先不明の場合は、宛先不明の場合は、宛先不明の場合は、宛先不明の場合は、宛先不明の場合は、宛先不明の場合は、宛先不明の場合は、宛先不明の場合は、宛先不明の場合は、宛先不明の場合は、宛先不明の場合は、宛先不明の場合は、宛先不明の場合は、宛先不明の場合は、宛先不明の場合は、宛先不明の場合は、宛先不明の場合は、宛先不明の場合は、宛先不明の場合は、宛先不明の場合は、宛先不明の場合は、宛先不明の場合は、宛先不明の場合は、宛先不明の場合は、宛先不明の場合は、宛先不明の場合は、宛先不明の場合は、宛先不明の場合は、宛先不明の場合は、宛先不明の場合は、宛先不明の場合は、宛先不明の場合は、宛先未定です。宛先を入力してください。
ko: 해당 법률에서 요구하거나 서면으로 동의하지 않는 한, 라이센스에 따라 배포 된 소프트웨어는 명시 적이든 묵시적이든 어떠한 종류의 보증이나 조건없이 "있는 그대로"배포됩니다. 라이센스에 따른 특정 언어 관리 권한 및 제한 사항에 대해서는 라이센스를 참조하십시오.
ru: За исключением случаев,когда это требуется применимым законодательством или согласовано в письменной форме,программное обеспечение,распространяемое по Лицензии,распространяется на БЕЗ ГАРАНТИЙ ИЛИ УСЛОВИЙ ЛЮБОГО РОДА,как явных,так и подразумеваемых,"КАК ЕСТЬ" БЕЗ ГАРАНТИЙ ИЛИ УСЛОВИЙ ЛЮБОГО РОДА.См.Лицензию для конкретного языка,регламентирующего разрешения и ограничения в рамках Лицензии.

source: Use
es: Utilice
ja: 使用方法
ko: 사용하다
ru: Использовать

source: Used to find the meter of the given text (a shatr: part of the verse). It returns a json object with these information:
es: Se utiliza para encontrar el metro del texto dado (un shatr:parte del verso).Devuelve un objeto json con esta información:
ja: 与えられたテキスト (shatr:verse の一部)のメートルを見つけるために使用されます。これらの情報を含む json オブジェクトを返します。
ko: 주어진 텍스트의 미터를 찾는 데 사용됩니다 (shatr : 구절의 일부). 다음 정보와 함께 json 객체를 반환합니다.
ru: Используется для поиска метра данного текста (шт.:часть стиха).Он возвращает объект json с этой информацией:

source: Web Api
ja: ウェブアピ
ko: 웹 API
ru: Веб-Апи

source: Will print the 16 meters names in
es: Imprimirá los nombres de los 16 metros en
ja: で16メートルの名前を印刷します。
ko: 16 미터 이름을
ru: Напечатает 16-метровые имена в

source: Writing the part into prosody form
es: Escribir la parte en forma de prosodia
ja: パートをプロソディ形式に書き出す
ko: 운율 형식으로 파트 작성
ru: Запись части в виде стихотворения

source: You can process a text with sub-functions (without using <strong>meter.process_shatr</strong> which uses them all):
es: Puede procesar un texto con subfunciones (sin usar <strong>meter.process_shatr</strong> que las usa todas):
ja: サブ関数を使用してテキストを処理できます（すべてを使用する<strong>meter.process_shatr</strong>を使用せずに）：
ko: 하위 기능이있는 텍스트를 처리 할 수 ​​있습니다 ( 모두 사용하는 <strong>meter.process_shatr</strong> 을 사용 하지 않고 ).
ru: Вы можете обрабатывать текст с помощью <strong>подфункций</strong> (без использования <strong>meter.process_shatr,</strong> который использует их все):

source: ameter: meter used by Arabs as defined by Al-Khalil
es: ametro:medidor utilizado por los árabes según la definición de Al-Khalil
ja: アメメーター:アルカリルが定義したアラブ人が使うメーター
ko: ameter : Al-Khalil이 정의한 아랍인이 사용하는 미터
ru: амперметр:метр,используемый арабами по определению Аль-Халиля.

source: ameter: the arabic meter of the text
es: ameter:el metro arábigo del texto
ja: ameter:アラビア語のテキストのメーター
ko: ameter : 텍스트의 아랍어 미터
ru: аметр:арабский метр текста

source: arabic: Arabic names of the 16 meters
es: árabe:Los nombres árabes de los 16 metros
ja: アラビア語 16メートルのアラビア語名
ko: 아랍어 : 16 미터의 아랍어 이름
ru: арабский:арабские названия 16 метров

source: bahr
ja: バール
ko: 바흐

source: bahr: the name of the bahr
es: bahr:el nombre del bahr
ja: バール:バールの名前
ko: bahr : bahr의 이름
ru: имя бара

source: emeter: foot's english meter
es: emeter:medidor de pie inglés
ja: emeter:フィートの英語のメートル
ko: emeter : 발의 영국 미터
ru: эметр:английский метр стопы

source: emeter: the english/european meter of the text
es: emeter:el medidor inglés/europeo del texto
ja: emeter:テキストの英語/ヨーロッパのメーター
ko: emeter : 텍스트의 영어 / 유럽 미터
ru: эметр:английский/европейский счетчик текста

source: emeter: the meter by syllables (European method)
es: emeter:el medidor por sílabas (método europeo)
ja: エメーター:五十音別メーター(ヨーロッパ式
ko: emeter : 음절 단위 (유럽식)
ru: эметр:счетчик по слоговому методу (европейский метод)

source: english: English equivalent names
es: Inglés:Nombres equivalentes en inglés
ja: 英語です。英語と同等の名前
ko: 영어 : 영어에 상응하는 이름
ru: Английский:английские эквивалентные имена
