Repository: Yuniorcr/runebook
Catalog: xlf/packages/*/python/astrobase.001.xlf
Languages: es, ja, ko, zh_cn

source: PNG images: Alternatively, if you want to simply glance through lots of checkplots (e.g. for an initial look at a collection of light curves), there's a <code>checkplot-viewer</code> webapp available that operates on checkplot PNG images. The <a href="https://nbviewer.jupyter.org/github/waqasbhatti/astrobase-notebooks/blob/master/lightcurve-work.ipynb">lightcurve-work</a> Jupyter notebook goes through an example of generating these checkplot PNGs for light curves. See the <a href="https://github.com/waqasbhatti/astrobase/blob/master/astrobase/cpserver/checkplot-viewer.js">checkplot-viewer.js</a> file for more instructions and <a href="https://raw.githubusercontent.com/waqasbhatti/astrobase/master/astrobase/data/checkplot-viewer.png">checkplot-viewer.png</a> for a screenshot.
es: Im&aacute;genes PNG: Alternativamente, si desea simplemente echar un vistazo a trav&eacute;s de muchas gr&aacute;ficas de verificaci&oacute;n (por ejemplo, para un vistazo inicial a una colecci&oacute;n de curvas de luz), hay una <code>checkplot-viewer</code> web de visor de gr&aacute;ficas de verificaci&oacute;n disponible que opera en im&aacute;genes PNG de gr&aacute;ficas de verificaci&oacute;n. El cuaderno Jupyter <a href="https://nbviewer.jupyter.org/github/waqasbhatti/astrobase-notebooks/blob/master/lightcurve-work.ipynb">lightcurve-work</a> pasa por un ejemplo de generaci&oacute;n de estos PNG de gr&aacute;ficos de verificaci&oacute;n para curvas de luz. Consulte el archivo <a href="https://github.com/waqasbhatti/astrobase/blob/master/astrobase/cpserver/checkplot-viewer.js">checkplot-viewer.js</a> para obtener m&aacute;s instrucciones y <a href="https://raw.githubusercontent.com/waqasbhatti/astrobase/master/astrobase/data/checkplot-viewer.png">checkplot-viewer.png</a> para ver una captura de pantalla.
ja: PNG画像：あるいは、単純に多数のチェックプロットを一目見たい場合（たとえば、光度曲線のコレクションを最初に確認する場合）、チェックプロットPNG画像を操作する <code>checkplot-viewer</code> webappを利用できます。 <a href="https://nbviewer.jupyter.org/github/waqasbhatti/astrobase-notebooks/blob/master/lightcurve-work.ipynb">lightcurve作業</a> Jupyterノートは光曲線についてこれらcheckplotのPNG画像を生成する例を通過します。参照してください <a href="https://github.com/waqasbhatti/astrobase/blob/master/astrobase/cpserver/checkplot-viewer.js">checkplot-viewer.js</a>より多くの命令とするファイル<a href="https://raw.githubusercontent.com/waqasbhatti/astrobase/master/astrobase/data/checkplot-viewer.png">checkplot-viewer.png</a> スクリーンショットのために。
ko: PNG 이미지 : 또는 단순히 많은 체크 플롯을 훑어보고 싶다면 (예 : 라이트 커브 모음의 초기보기), 체크 플롯 PNG 이미지에서 작동하는 체크 플롯 <code>checkplot-viewer</code> 웹앱이 있습니다. <a href="https://nbviewer.jupyter.org/github/waqasbhatti/astrobase-notebooks/blob/master/lightcurve-work.ipynb">lightcurve 워크</a> Jupyter 노트북 광 곡선이 checkplot PNG 파일의 생성의 예를 통해 진행한다. 참고 항목 <a href="https://github.com/waqasbhatti/astrobase/blob/master/astrobase/cpserver/checkplot-viewer.js">checkplot-viewer.js의</a> 더 많은 명령과의 파일 <a href="https://raw.githubusercontent.com/waqasbhatti/astrobase/master/astrobase/data/checkplot-viewer.png">checkplot-viewer.png</a> 스크린 샷에 대한합니다.
zh_cn: PNG图像：或者，如果您只想浏览许多检查图（例如，初步查看光曲线的集合），则可以使用可用于检查图PNG图像的 <code>checkplot-viewer</code> webapp。 Jupyter笔记本电脑的 <a href="https://nbviewer.jupyter.org/github/waqasbhatti/astrobase-notebooks/blob/master/lightcurve-work.ipynb">光曲线工作</a>演示了为光曲线生成这些检查图PNG的示例。见 <a href="https://github.com/waqasbhatti/astrobase/blob/master/astrobase/cpserver/checkplot-viewer.js">checkplot-viewer.js</a>更多的指示和文件<a href="https://raw.githubusercontent.com/waqasbhatti/astrobase/master/astrobase/data/checkplot-viewer.png">checkplot-viewer.png</a> 的屏幕截图。

source: Pillow
es: Almohada
ja: ピロー
ko: 베개
zh_cn: 枕头

source: Please see <a href="https://github.com/waqasbhatti/astrobase/blob/master/CHANGELOG.md">https://github.com/waqasbhatti/astrobase/blob/master/CHANGELOG.md</a> for a list of changes applicable to tagged release versions.
es: Consulte <a href="https://github.com/waqasbhatti/astrobase/blob/master/CHANGELOG.md">https://github.com/waqasbhatti/astrobase/blob/master/CHANGELOG.md</a> para obtener una lista de los cambios aplicables a las versiones de lanzamiento etiquetadas.
ja: タグ付きリリースバージョンに適用可能な変更のリストについては、<a href="https://github.com/waqasbhatti/astrobase/blob/master/CHANGELOG.md">https：//github.com/waqasbhatti/astrobase/blob/master/CHANGELOG.md</a>を参照してください。
ko: 태그 된 릴리스 버전에 적용되는 변경 사항 목록 은 <a href="https://github.com/waqasbhatti/astrobase/blob/master/CHANGELOG.md">https://github.com/waqasbhatti/astrobase/blob/master/CHANGELOG.md</a> 를 참조 하십시오 .
zh_cn: 请参阅<a href="https://github.com/waqasbhatti/astrobase/blob/master/CHANGELOG.md">https://github.com/waqasbhatti/astrobase/blob/master/CHANGELOG.md</a>，以获取适用于标记发行版的更改列表。

source: Python modules and scripts useful for variable star work in astronomy.
es: Módulos de pitón y guiones útiles para el trabajo de estrellas variables en astronomía.
ja: 天文学での変幻自在な星の作業に便利なPythonのモジュールとスクリプト。
ko: 천문학에서 변수 별 작업에 유용한 Python 모듈 및 스크립트.
zh_cn: Python模块和脚本对天文学中的变星工作非常有用。

source: Python pickles: If you want to interactively browse through large numbers of checkplots (e.g., as part of a large variable star classification project), you can use the <code>checkplotserver</code> webapp that works on checkplot pickle files. This interface allows you to review all phased light curves from all period-finder methods applied, set and save variability tags, object type tags, best periods and epochs, and comments for each object using a browser-based UI (see below). The information entered can then be exported as CSV or JSON for the next stage of a variable star classification pipeline.
es: Python pickles: si desea navegar interactivamente a trav&eacute;s de una gran cantidad de checkplots (por ejemplo, como parte de un gran proyecto de clasificaci&oacute;n de estrellas variables), puede usar la <code>checkplotserver</code> web checkplotserver que funciona en archivos de checkplot pickle. Esta interfaz le permite revisar todas las curvas de luz por fases de todos los m&eacute;todos de b&uacute;squeda de per&iacute;odos aplicados, establecer y guardar etiquetas de variabilidad, etiquetas de tipo de objeto, mejores per&iacute;odos y &eacute;pocas, y comentarios para cada objeto utilizando una interfaz de usuario basada en navegador (ver m&aacute;s abajo). La informaci&oacute;n ingresada se puede exportar como CSV o JSON para la siguiente etapa de una canalizaci&oacute;n de clasificaci&oacute;n de estrellas variable.
ja: Pythonピクル：多数のチェックプロットをインタラクティブに閲覧する場合（たとえば、大規模な変光星分類プロジェクトの一部として）、チェックプロットピクルファイルで機能する <code>checkplotserver</code> webappを使用できます。このインターフェイスを使用すると、ブラウザーベースのUIを使用して、適用されたすべてのピリオドファインダーメソッドからのすべてのフェーズドライトカーブを確認し、可変性タグ、オブジェクトタイプタグ、最良の期間とエポック、および各オブジェクトのコメントを設定して保存できます（以下を参照）。入力された情報は、次に、可変星分類パイプラインの次のステージのためにCSVまたはJSONとしてエクスポートできます。
ko: Python 피클 : 많은 수의 체크 플롯을 대화식으로 탐색하려는 경우 (예 : 큰 가변 별 분류 프로젝트의 일부로) 체크 플롯 피클 파일에서 작동하는 checkplotserver <code>checkplotserver</code> 사용할 수 있습니다 . 이 인터페이스를 사용하면 적용된 모든 기간 측정기 방법의 모든 단계적 광 곡선을 검토하고, 브라우저 기반 UI를 사용하여 가변성 태그, 객체 유형 태그, 최적 기간 및 에포크, 각 객체에 대한 주석을 설정 및 저장할 수 있습니다 (아래 참조). 입력 된 정보는 가변 별 분류 파이프 라인의 다음 단계를 위해 CSV 또는 JSON으로 내보낼 수 있습니다.
zh_cn: Python泡菜：如果要交互式浏览大量检查图（例如，作为大型可变星级分类项目的一部分），则可以使用可用于检查图泡菜文件的 <code>checkplotserver</code> Web应用程序。该界面允许您使用所有基于周期查找器的方法查看所有相光曲线，设置和保存可变性标签，对象类型标签，最佳周期和纪元，以及使用基于浏览器的UI（参见下文）针对每个对象的注释。输入的信息然后可以导出为CSV或JSON，用于下一阶段的可变星级分类管道。

source: Read the docs: <a href="https://astrobase.readthedocs.io/en/latest/">https://astrobase.readthedocs.io/en/latest/</a>
es: Lea los documentos: <a href="https://astrobase.readthedocs.io/en/latest/">https://astrobase.readthedocs.io/en/latest/</a>
ja: ドキュメントを読む：<a href="https://astrobase.readthedocs.io/en/latest/">https</a> : //astrobase.readthedocs.io/en/latest/
ko: 문서 읽기 : <a href="https://astrobase.readthedocs.io/en/latest/">https://astrobase.readthedocs.io/en/latest/</a>
zh_cn: 阅读文档：<a href="https://astrobase.readthedocs.io/en/latest/">https</a> : //astrobase.readthedocs.io/en/latest/

source: Requirements
es: Requisitos
ja: 必要条件
ko: 요구 사항
zh_cn: 所需经费

source: See the <a href="#installation">installation instructions</a> below for details. This package requires Python &gt;= 3.5 as of version 0.5.0. Use <code>pip install astrobase&lt;0.5.0</code> for older Python versions.
es: Consulte las <a href="#installation">instrucciones de instalaci&oacute;n a</a> continuaci&oacute;n para obtener m&aacute;s detalles. Este paquete requiere Python&gt; = 3.5 a partir de la versi&oacute;n 0.5.0. Use <code>pip install astrobase&lt;0.5.0</code> para versiones anteriores de Python.
ja: 詳細については、以下の<a href="#installation">インストール手順を</a>参照してください。このパッケージには、バージョン0.5.0以降、Python&gt; = 3.5が必要です。古いバージョンのPythonには、 <code>pip install astrobase&lt;0.5.0</code> を使用します。
ko: 자세한 내용은 아래 의 <a href="#installation">설치 지침을</a> 참조하십시오. 이 패키지에는 버전 0.5.0부터 Python&gt; = 3.5가 필요합니다. 이전 Python 버전 에는 <code>pip install astrobase&lt;0.5.0</code> 을 사용하십시오 .
zh_cn: 有关详细信息，请参见下面的<a href="#installation">安装说明</a>。从0.5.0版开始，此软件包需要Python&gt; = 3.5。对于较旧的Python版本，请使用 <code>pip install astrobase&lt;0.5.0</code> 。

source: The <a href="https://nbviewer.jupyter.org/github/waqasbhatti/astrobase-notebooks/blob/master/lightcurves-and-checkplots.ipynb">lightcurves-and-checkplots</a> Jupyter notebook outlines how to do this. A more detailed example using light curves of an arbitrary format is available in the <a href="https://nbviewer.jupyter.org/github/waqasbhatti/astrobase-notebooks/blob/master/lc-collection-work.ipynb">lc-collection-work</a> notebook, which shows how to add in support for a custom LC format, add neighbor, cross-match, and color-mag diagram info to checkplots, and visualize these with the checkplotserver.
es: El cuaderno Jupyter de <a href="https://nbviewer.jupyter.org/github/waqasbhatti/astrobase-notebooks/blob/master/lightcurves-and-checkplots.ipynb">lightcurves-and-checkplots</a> describe c&oacute;mo hacer esto. Un ejemplo m&aacute;s detallado que utiliza curvas de luz de un formato arbitrario est&aacute; disponible en el cuaderno <a href="https://nbviewer.jupyter.org/github/waqasbhatti/astrobase-notebooks/blob/master/lc-collection-work.ipynb">lc-collection-work</a> , que muestra c&oacute;mo agregar soporte para un formato LC personalizado, agregar informaci&oacute;n de diagrama vecino, de coincidencia cruzada y de color-mag a las gr&aacute;ficas de verificaci&oacute;n , y visual&iacute;celos con el checkplotserver.
ja: <a href="https://nbviewer.jupyter.org/github/waqasbhatti/astrobase-notebooks/blob/master/lightcurves-and-checkplots.ipynb">lightcurves-と-checkplots</a> Jupyterノートアウトラインはどのようにこれを行うには。任意の形式の光度曲線を使用したより詳細な例は、<a href="https://nbviewer.jupyter.org/github/waqasbhatti/astrobase-notebooks/blob/master/lc-collection-work.ipynb">lc-collection-work</a> ノートブックで入手できます 。これは、カスタムLC形式のサポートを追加し、ネイバー、クロスマッチ、およびカラーマグ図情報をチェックプロットに追加する方法を示しています、checkplotserverでこれらを視覚化します。
ko: <a href="https://nbviewer.jupyter.org/github/waqasbhatti/astrobase-notebooks/blob/master/lightcurves-and-checkplots.ipynb">lightcurves 앤 checkplots</a> Jupyter 노트북 윤곽 방법이 작업을 수행합니다. 임의 형식의 광 곡선을 사용하는보다 자세한 예제는 <a href="https://nbviewer.jupyter.org/github/waqasbhatti/astrobase-notebooks/blob/master/lc-collection-work.ipynb">lc-collection-work</a> 노트북 에서 사용할 수 있으며, 사용자 지정 LC 형식에 대한 지원 추가, 인접 항목 추가, 교차 일치 및 체크 플롯에 색-자기 다이어그램 정보 추가 방법을 보여줍니다. , checkplotserver로 시각화하십시오.
zh_cn: 该 <a href="https://nbviewer.jupyter.org/github/waqasbhatti/astrobase-notebooks/blob/master/lightcurves-and-checkplots.ipynb">lightcurves-和checkplots</a> Jupyter笔记本概述了如何做到这一点。<a href="https://nbviewer.jupyter.org/github/waqasbhatti/astrobase-notebooks/blob/master/lc-collection-work.ipynb">lc-collection-work</a> 笔记本中提供了使用任意格式的光曲线的更详细的示例，该示例 显示了如何添加对自定义LC格式的支持，如何将邻居，交叉匹配和彩色磁图信息添加到检查图，并使用checkplotserver对其进行可视化。

source: This package requires the following other packages:
es: Este paquete requiere los siguientes otros paquetes:
ja: このパッケージには、他に以下のパッケージが必要です。
ko: 이 패키지에는 다음과 같은 다른 패키지가 필요합니다.
zh_cn: 这个软件包需要以下其他软件包。

source: You can simply install astrobase with:
es: Puedes simplemente instalar la astrobase con:
ja: アストロベースをインストールするだけでOKです。
ko: 다음을 사용하여 간단히 astrobase를 설치할 수 있습니다.
zh_cn: 你可以简单地安装星基与。

source: astropy
es: Astropía
ja: アストロピー
ko: 천체
zh_cn: 天体

source: for <code>astrobase.lcdb</code> to work, you'll need <code>psycopg2-binary</code>.
es: para que funcione <code>astrobase.lcdb</code> , necesitar&aacute; <code>psycopg2-binary</code> .
ja: 以下のため <code>astrobase.lcdb</code> 仕事に、あなたが必要です <code>psycopg2-binary</code> 。
ko: 대한 <code>astrobase.lcdb</code> 하려면 다음이 필요합니다 <code>psycopg2-binary</code> .
zh_cn: 为了使 <code>astrobase.lcdb</code> 正常工作，您需要 <code>psycopg2-binary</code> 。

source: for <code>lcfit.transits.mandelagol_fit_magseries</code>, you'll need <code>batman-package</code>, <code>emcee</code>, <code>corner</code>, and <code>h5py</code>.
es: para <code>lcfit.transits.mandelagol_fit_magseries</code> , necesitar&aacute; <code>batman-package</code> , <code>emcee</code> , <code>corner</code> y <code>h5py</code> .
ja: 以下のため <code>lcfit.transits.mandelagol_fit_magseries</code> 、あなたが必要です <code>batman-package</code> 、 <code>emcee</code> 、 <code>corner</code> 、および <code>h5py</code> を。
ko: 대한 <code>lcfit.transits.mandelagol_fit_magseries</code> , 당신은해야합니다 <code>batman-package</code> , <code>emcee</code> , <code>corner</code> 및 <code>h5py</code> 을 .
zh_cn: 对于 <code>lcfit.transits.mandelagol_fit_magseries</code> ，您将需要 <code>batman-package</code> ， <code>emcee</code> ， <code>corner</code> 和 <code>h5py</code> 。

source: for <code>lcproc.awsrun</code>, you'll need <code>paramiko</code>, <code>boto3</code>, and <code>awscli</code>.
es: para <code>lcproc.awsrun</code> , necesitar&aacute; <code>paramiko</code> , <code>boto3</code> y <code>awscli</code> .
ja: 以下のため <code>lcproc.awsrun</code> 、あなたが必要です <code>paramiko</code> 、 <code>boto3</code> 、および <code>awscli</code> を。
ko: 대한 <code>lcproc.awsrun</code> , 다음이 필요합니다 <code>paramiko</code> , <code>boto3</code> 및 <code>awscli</code> 을 .
zh_cn: 对于 <code>lcproc.awsrun</code> ，您将需要 <code>paramiko</code> ， <code>boto3</code> 和 <code>awscli</code> 。

source: for <code>periodbase.tls</code>, you'll need <code>transitleastsquares</code>
es: para <code>periodbase.tls</code> , necesitar&aacute; <code>transitleastsquares</code>
ja: <code>periodbase.tls</code> の場合、transitleastsquaresが必要に <code>transitleastsquares</code> ます
ko: 대한 <code>periodbase.tls</code> , 다음이 필요합니다 <code>transitleastsquares</code> 을
zh_cn: 对于 <code>periodbase.tls</code> ，您需要 <code>transitleastsquares</code>

source: jplephem
ja: 婉曲表現

source: matplotlib
ja: マットプロットリブ

source: numpy
ja: 塊状

source: pyeebls
ja: 瞳孔

source: requests
es: solicitudes
ja: 願い事
ko: 요청
zh_cn: 请求

source: scikit-learn
ja: スキット学習

source: scipy
ja: 虫けら
zh_cn: 虾米

source: tornado
ja: 竜巻
ko: 폭풍
zh_cn: 龙卷风

source: tqdm
ja: テックジム

source: Python 3.6: Python 3.7: Python 3.8:
es: Pitón 3.6:Pitón 3.7:Pitón 3.8:
