Repository: Yuniorcr/runebook
Catalog: xlf/packages/*/python/astrobase.001.xlf
Languages: es, ja, ko, zh_cn

source: <strong><a href="https://astrobase.readthedocs.io/en/latest/astrobase.periodbase.html">periodbase</a></strong>: parallelized functions (using <code>multiprocessing.map</code>) to run fast period searches on light curves, including: the generalized Lomb-Scargle algorithm from Zechmeister &amp; Kurster (<a href="http://adsabs.harvard.edu/abs/2009A%26A...496..577Z">2008</a>; <strong><a href="https://astrobase.readthedocs.io/en/latest/astrobase.periodbase.zgls.html">periodbase.zgls</a></strong>), the phase dispersion minimization algorithm from Stellingwerf (<a href="http://adsabs.harvard.edu/abs/1978ApJ...224..953S">1978</a>, <a href="http://adsabs.harvard.edu/abs/2011rrls.conf...47S">2011</a>; <strong><a href="https://astrobase.readthedocs.io/en/latest/astrobase.periodbase.spdm.html">periodbase.spdm</a></strong>), the AoV and AoV-multiharmonic algorithms from Schwarzenberg-Czerny (<a href="http://adsabs.harvard.edu/abs/1989MNRAS.241..153S">1989</a>, <a href="http://adsabs.harvard.edu/abs/1996ApJ...460L.107S">1996</a>; <strong><a href="https://astrobase.readthedocs.io/en/latest/astrobase.periodbase.saov.html">periodbase.saov</a></strong>, <strong><a href="https://astrobase.readthedocs.io/en/latest/astrobase.periodbase.smav.html">periodbase.smav</a></strong>), the BLS algorithm from Kovacs et al. (<a href="http://adsabs.harvard.edu/abs/2002A%26A...391..369K">2002</a>; <strong><a href="https://astrobase.readthedocs.io/en/latest/astrobase.periodbase.kbls.html">periodbase.kbls</a></strong> and <strong><a href="https://astrobase.readthedocs.io/en/latest/astrobase.periodbase.abls.html">periodbase.abls</a></strong>), the similar TLS algorithm from Hippke &amp; Heller (<a href="https://ui.adsabs.harvard.edu/abs/2019A%26A...623A..39H/abstract">2019</a>; <strong><a href="https://astrobase.readthedocs.io/en/latest/astrobase.periodbase.htls.html">periodbase.htls</a></strong>), and the ACF period-finding algorithm from McQuillan et al. (<a href="http://adsabs.harvard.edu/abs/2013MNRAS.432.1203M">2013a</a>, <a href="http://adsabs.harvard.edu/abs/2014ApJS..211...24M">2014</a>; <strong><a href="https://astrobase.readthedocs.io/en/latest/astrobase.periodbase.macf.html">periodbase.macf</a></strong>).
es: <strong><a href="https://astrobase.readthedocs.io/en/latest/astrobase.periodbase.html">periodbase</a></strong> : funciones paralelizadas (usando <code>multiprocessing.map</code> ) para ejecutar b&uacute;squedas de per&iacute;odos r&aacute;pidos en curvas de luz, que incluyen: el algoritmo generalizado Lomb-Scargle de Zechmeister &amp; Kurster (<a href="http://adsabs.harvard.edu/abs/2009A%26A...496..577Z"> 2008</a> ; <strong><a href="https://astrobase.readthedocs.io/en/latest/astrobase.periodbase.zgls.html"> periodbase.zgls</a></strong> ), el algoritmo de minimizaci&oacute;n de dispersi&oacute;n de fase de Stellingwerf (<a href="http://adsabs.harvard.edu/abs/1978ApJ...224..953S"> 1978</a> , <a href="http://adsabs.harvard.edu/abs/2011rrls.conf...47S"> 2011)</a> ; <strong><a href="https://astrobase.readthedocs.io/en/latest/astrobase.periodbase.spdm.html"> periodbase.spdm</a></strong> ), los algoritmos multiarm&oacute;nicos AoV y AoV de Schwarzenberg-Czerny (<a href="http://adsabs.harvard.edu/abs/1989MNRAS.241..153S"> 1989</a> , <a href="http://adsabs.harvard.edu/abs/1996ApJ...460L.107S"> 1996</a> ; <strong><a href="https://astrobase.readthedocs.io/en/latest/astrobase.periodbase.saov.html"> periodbase.saov</a></strong> , <strong><a href="https://astrobase.readthedocs.io/en/latest/astrobase.periodbase.smav.html"> periodbase.smav</a></strong> ), el algoritmo BLS de Kovacs et al. (<a href="http://adsabs.harvard.edu/abs/2002A%26A...391..369K"> 2002</a> ; <strong><a href="https://astrobase.readthedocs.io/en/latest/astrobase.periodbase.kbls.html"> periodbase.kbls</a></strong> y<strong><a href="https://astrobase.readthedocs.io/en/latest/astrobase.periodbase.abls.html"> periodbase.abls</a></strong>), el algoritmo TLS similar de Hippke &amp; Heller ( <a href="https://ui.adsabs.harvard.edu/abs/2019A%26A...623A..39H/abstract">2019</a> ; <strong><a href="https://astrobase.readthedocs.io/en/latest/astrobase.periodbase.htls.html">periodbase.htls</a></strong> ), y el algoritmo de b&uacute;squeda de per&iacute;odos ACF de McQuillan et al. ( <a href="http://adsabs.harvard.edu/abs/2013MNRAS.432.1203M">2013a</a> , <a href="http://adsabs.harvard.edu/abs/2014ApJS..211...24M">2014</a> ; <strong><a href="https://astrobase.readthedocs.io/en/latest/astrobase.periodbase.macf.html">periodbase.macf</a></strong> ).
ja: <strong><a href="https://astrobase.readthedocs.io/en/latest/astrobase.periodbase.html">periodbase</a></strong>：並列化された（使用した機能 <code>multiprocessing.map</code> を含む光曲線上の高速な期間検索を実行する）：Zechmeister＆Kursterから一般ロム-Scargleアルゴリズム（<a href="http://adsabs.harvard.edu/abs/2009A%26A...496..577Z"> 2008</a> ; <strong><a href="https://astrobase.readthedocs.io/en/latest/astrobase.periodbase.zgls.html"> periodbase.zgls</a></strong>）、Stellingwerf（から相分散最小化アルゴリズム<a href="http://adsabs.harvard.edu/abs/1978ApJ...224..953S"> 1978</a>、 <a href="http://adsabs.harvard.edu/abs/2011rrls.conf...47S"> 2011</a> ; <strong><a href="https://astrobase.readthedocs.io/en/latest/astrobase.periodbase.spdm.html"> periodbase.spdm</a></strong>）、Schwarzenberg-Czerny（<a href="http://adsabs.harvard.edu/abs/1989MNRAS.241..153S"> 1989年</a>、 <a href="http://adsabs.harvard.edu/abs/1996ApJ...460L.107S"> 1996年</a> ; <strong><a href="https://astrobase.readthedocs.io/en/latest/astrobase.periodbase.saov.html"> periodbase.saov</a></strong>、 <strong><a href="https://astrobase.readthedocs.io/en/latest/astrobase.periodbase.smav.html"> periodbase.smav</a></strong>）のAoVおよびAoV-multiharmonicアルゴリズム、KovacsらのBLSアルゴリズム（<a href="http://adsabs.harvard.edu/abs/2002A%26A...391..369K"> 2002</a> ; <strong><a href="https://astrobase.readthedocs.io/en/latest/astrobase.periodbase.kbls.html"> periodbase.kbls</a></strong> および<strong><a href="https://astrobase.readthedocs.io/en/latest/astrobase.periodbase.abls.html"> periodbase.abls</a></strong>）、Hipke＆Heller（<a href="https://ui.adsabs.harvard.edu/abs/2019A%26A...623A..39H/abstract">2019</a> ; <strong><a href="https://astrobase.readthedocs.io/en/latest/astrobase.periodbase.htls.html">periodbase.htls</a></strong>）からの同様のTLSアルゴリズム、およびMcQuillanらによるACF期間検索アルゴリズム。（<a href="http://adsabs.harvard.edu/abs/2013MNRAS.432.1203M">2013a</a>、 <a href="http://adsabs.harvard.edu/abs/2014ApJS..211...24M">2014</a> ; <strong><a href="https://astrobase.readthedocs.io/en/latest/astrobase.periodbase.macf.html">periodbase.macf</a></strong>）。
ko: <strong><a href="https://astrobase.readthedocs.io/en/latest/astrobase.periodbase.html">periodbase</a></strong> :Zechmeister &amp; Kurster (<a href="http://adsabs.harvard.edu/abs/2009A%26A...496..577Z"> 2008</a> ; <strong><a href="https://astrobase.readthedocs.io/en/latest/astrobase.periodbase.zgls.html"> periodbase.zgls</a></strong> )의 일반화 된 Lomb-Scargle 알고리즘, Stellingwerf (<a href="http://adsabs.harvard.edu/abs/1978ApJ...224..953S"> 1978</a> , <a href="http://adsabs.harvard.edu/abs/2011rrls.conf...47S"> 2011</a> )의 위상 분산 최소화 알고리즘을포함하여 광 곡선에서 빠른 기간 검색을 실행하기위한병렬 함수 ( <code>multiprocessing.map</code> 사용 ); <strong><a href="https://astrobase.readthedocs.io/en/latest/astrobase.periodbase.spdm.html"> periodbase.spdm</a></strong> ), Schwarzenberg-Czerny (<a href="http://adsabs.harvard.edu/abs/1989MNRAS.241..153S"> 1989</a> , <a href="http://adsabs.harvard.edu/abs/1996ApJ...460L.107S"> 1996</a> ; <strong><a href="https://astrobase.readthedocs.io/en/latest/astrobase.periodbase.saov.html"> periodbase.saov</a></strong> ,<strong><a href="https://astrobase.readthedocs.io/en/latest/astrobase.periodbase.smav.html"> periodbase.smav</a></strong> )의 AoV 및 AoV- 다 조파 알고리즘, Kovacs 등의 BLS 알고리즘. (<a href="http://adsabs.harvard.edu/abs/2002A%26A...391..369K"> 2002</a> ; <strong><a href="https://astrobase.readthedocs.io/en/latest/astrobase.periodbase.kbls.html"> periodbase.kbls</a></strong> 및<strong><a href="https://astrobase.readthedocs.io/en/latest/astrobase.periodbase.abls.html"> periodbase.abls</a></strong><strong></strong><strong></strong><strong></strong><strong></strong><strong></strong><strong></strong>), Hippke &amp; Heller ( <a href="https://ui.adsabs.harvard.edu/abs/2019A%26A...623A..39H/abstract">2019</a> ; <strong><a href="https://astrobase.readthedocs.io/en/latest/astrobase.periodbase.htls.html">periodbase.htls</a></strong> ) 의 유사한 TLS 알고리즘 , McQuillan 등의 ACF 기간 찾기 알고리즘. ( <a href="http://adsabs.harvard.edu/abs/2013MNRAS.432.1203M">2013a</a> , <a href="http://adsabs.harvard.edu/abs/2014ApJS..211...24M">2014</a> ; <strong><a href="https://astrobase.readthedocs.io/en/latest/astrobase.periodbase.macf.html">periodbase.macf</a></strong> ).
zh_cn: <strong><a href="https://astrobase.readthedocs.io/en/latest/astrobase.periodbase.html">periodbase</a></strong>：并行化功能（使用 <code>multiprocessing.map</code> ）上运行光曲线快的周期的搜索，其中包括：从Zechmeister＆Kurster广义博士伦-Scargle算法（<a href="http://adsabs.harvard.edu/abs/2009A%26A...496..577Z"> 2008</a> ; <strong><a href="https://astrobase.readthedocs.io/en/latest/astrobase.periodbase.zgls.html"> periodbase.zgls</a></strong>），从Stellingwerf（相位分散最小化算法<a href="http://adsabs.harvard.edu/abs/1978ApJ...224..953S"> 1978</a>， <a href="http://adsabs.harvard.edu/abs/2011rrls.conf...47S"> 2011</a> ; <strong><a href="https://astrobase.readthedocs.io/en/latest/astrobase.periodbase.spdm.html"> periodbase.spdm</a></strong>），距离Schwarzenberg-的Czerny（AOV的AOV和-算法多调和<a href="http://adsabs.harvard.edu/abs/1989MNRAS.241..153S"> 1989</a>， <a href="http://adsabs.harvard.edu/abs/1996ApJ...460L.107S"> 1996年</a> ; <strong><a href="https://astrobase.readthedocs.io/en/latest/astrobase.periodbase.saov.html"> periodbase.saov</a></strong>， <strong><a href="https://astrobase.readthedocs.io/en/latest/astrobase.periodbase.smav.html"> periodbase.smav</a></strong>）时，从BLS科瓦奇等人的算法。 （<a href="http://adsabs.harvard.edu/abs/2002A%26A...391..369K"> 2002年</a> ; <strong><a href="https://astrobase.readthedocs.io/en/latest/astrobase.periodbase.kbls.html"> periodbase.kbls</a></strong> 和<strong><a href="https://astrobase.readthedocs.io/en/latest/astrobase.periodbase.abls.html"> periodbase.abls</a></strong>），Hippke＆Heller（<a href="https://ui.adsabs.harvard.edu/abs/2019A%26A...623A..39H/abstract">2019</a> ; <strong><a href="https://astrobase.readthedocs.io/en/latest/astrobase.periodbase.htls.html">periodbase.htls</a></strong>）的类似TLS算法以及McQuillan 等人的ACF周期发现算法。（<a href="http://adsabs.harvard.edu/abs/2013MNRAS.432.1203M">2013a</a>， <a href="http://adsabs.harvard.edu/abs/2014ApJS..211...24M">2014</a> ; <strong><a href="https://astrobase.readthedocs.io/en/latest/astrobase.periodbase.macf.html">periodbase.macf</a></strong>）。

source: <strong><a href="https://astrobase.readthedocs.io/en/latest/astrobase.plotbase.html">plotbase</a></strong>: functions to plot light curves, phased light curves, periodograms, and download Digitized Sky Survey cutouts from the NASA SkyView service.
es: <strong><a href="https://astrobase.readthedocs.io/en/latest/astrobase.plotbase.html">plotbase</a></strong> : funciones para trazar curvas de luz, curvas de luz por fases, periodogramas y descargar recortes de Digital Sky Survey del servicio NASA SkyView.
ja: <strong><a href="https://astrobase.readthedocs.io/en/latest/astrobase.plotbase.html">plotbase</a></strong>：ライトカーブ、フェーズドライトカーブ、ピリオドグラムをプロットし、NASA SkyViewサービスからDigitized Sky Surveyカットアウトをダウンロードする関数。
ko: <strong><a href="https://astrobase.readthedocs.io/en/latest/astrobase.plotbase.html">plotbase</a></strong> : NASA SkyView 서비스에서 광 곡선, 위상 광 곡선, 주기도를 플롯하고 Digitized Sky Survey 컷 아웃을 다운로드하는 기능입니다.
zh_cn: <strong><a href="https://astrobase.readthedocs.io/en/latest/astrobase.plotbase.html">plotbase</a></strong>：用于绘制光曲线，相位光曲线，周期图以及从NASA SkyView服务下载数字化天空勘测图的功能。

source: <strong><a href="https://astrobase.readthedocs.io/en/latest/astrobase.services.html">services</a></strong>: modules and functions to query various astronomical catalogs and data services, including GAIA, SIMBAD, TRILEGAL, NASA SkyView, and 2MASS DUST.
es: <strong><a href="https://astrobase.readthedocs.io/en/latest/astrobase.services.html">servicios</a></strong> : m&oacute;dulos y funciones para consultar diversos cat&aacute;logos astron&oacute;micos y servicios de datos, incluidos GAIA, SIMBAD, TRILEGAL, NASA SkyView y 2MASS DUST.
ja: <strong><a href="https://astrobase.readthedocs.io/en/latest/astrobase.services.html">services</a></strong>：GAIA、SIMBAD、TRILEGAL、NASA SkyView、2MASS DUSTなど、さまざまな天文カタログやデータサービスを照会するためのモジュールと機能。
ko: <strong><a href="https://astrobase.readthedocs.io/en/latest/astrobase.services.html">서비스</a></strong> : GAIA, SIMBAD, TRILEGAL, NASA SkyView, 2MASS DUST 등 다양한 천문 카탈로그 및 데이터 서비스를 쿼리하는 모듈 및 기능.
zh_cn: <strong><a href="https://astrobase.readthedocs.io/en/latest/astrobase.services.html">服务</a></strong>：用于查询各种天文目录和数据服务的模块和功能，包括GAIA，SIMBAD，TRILEGAL，NASA SkyView和2MASS DUST。

source: <strong><a href="https://astrobase.readthedocs.io/en/latest/astrobase.timeutils.html">timeutils</a></strong>: functions for converting from Julian dates to Baryocentric Julian dates, and precessing coordinates between equinoxes and due to proper motion; this will automatically download and save the JPL ephemerides <strong>de430.bsp</strong> from JPL upon first import.
es: <strong><a href="https://astrobase.readthedocs.io/en/latest/astrobase.timeutils.html">timeutils</a></strong> : funciones para convertir de fechas julianas a fechas julianas barioc&eacute;ntricas y precesi&oacute;n de coordenadas entre equinoccios y debido al movimiento propio; esto descargar&aacute; y guardar&aacute; autom&aacute;ticamente las efem&eacute;rides<strong> de430.bsp</strong> de JPL en la primera importaci&oacute;n.
ja: <strong><a href="https://astrobase.readthedocs.io/en/latest/astrobase.timeutils.html">timeutils</a></strong>：ユリウス暦の日付から重心ユリウス暦の日付に変換する関数、および春分の間の歳差座標と適切な動きによる関数。これにより、最初のインポート時にJPLからJPLephemerides<strong> de430.bsp</strong>が自動的にダウンロードおよび保存されます。
ko: <strong><a href="https://astrobase.readthedocs.io/en/latest/astrobase.timeutils.html">timeutils</a></strong> : 율리우스 력 날짜에서 Baryocentric 율리우스 력 날짜로 변환하고, 춘분과 적절한 동작으로 인해 좌표를 세차 화하는 기능; 이렇게하면처음 가져올 때 JPL에서 JPLephemerides<strong> de430.bsp</strong> 를자동으로 다운로드하여 저장합니다.
zh_cn: <strong><a href="https://astrobase.readthedocs.io/en/latest/astrobase.timeutils.html">timeutils</a></strong>：用于从儒略日期转换为重心儒略日期的功能，并在春分点之间以及由于适当运动而进动坐标；首次导入时，它将自动从JPL下载并保存JPL星历表<strong> de430.bsp</strong>。

source: <strong><a href="https://astrobase.readthedocs.io/en/latest/astrobase.varbase.html">varbase</a></strong>: functions for calculating auto-correlation features, masking and pre-whitening periodic signals in light curves, and planet transit specific tools.
es: <strong><a href="https://astrobase.readthedocs.io/en/latest/astrobase.varbase.html">varbase</a></strong> : funciones para calcular caracter&iacute;sticas de autocorrelaci&oacute;n, enmascaramiento y<strong> preblanqueamiento de</strong> se&ntilde;ales peri&oacute;dicas en curvas de luz y herramientas espec&iacute;ficas de tr&aacute;nsito planetario.
ja: <strong><a href="https://astrobase.readthedocs.io/en/latest/astrobase.varbase.html">varbase</a></strong>：自己相関機能を計算するための関数、光度曲線の周期的信号のマスキングとプレホワイトニング、および惑星通過固有のツール。
ko: <strong><a href="https://astrobase.readthedocs.io/en/latest/astrobase.varbase.html">varbase</a></strong> : 자동 상관 기능 계산, 광 곡선의 주기적 신호 마스킹 및 사전 화이트닝, 행성 이동 특정 도구를위한 함수.
zh_cn: <strong><a href="https://astrobase.readthedocs.io/en/latest/astrobase.varbase.html">varbase</a></strong>：用于计算自相关特征，掩蔽和预先变白光曲线中的周期性信号以及行星运输专用工具的功能。

source: <strong><a href="https://astrobase.readthedocs.io/en/latest/astrobase.varclass.html">varclass</a></strong>: functions for calculating various variability, stellar color and motion, and neighbor proximity features, along with a Random Forest based classifier.
es: <strong><a href="https://astrobase.readthedocs.io/en/latest/astrobase.varclass.html">varclass</a></strong> : funciones para calcular variabilidad, color y movimiento estelar y caracter&iacute;sticas de proximidad de vecinos, junto con un clasificador basado en Random Forest.
ja: <strong><a href="https://astrobase.readthedocs.io/en/latest/astrobase.varclass.html">varclass</a></strong>：ランダムフォレストベースの分類子とともに、さまざまな変動性、恒星の色と動き、および近隣近接機能を計算するための関数。
ko: <strong><a href="https://astrobase.readthedocs.io/en/latest/astrobase.varclass.html">varclass</a></strong> : Random Forest 기반 분류기와 함께 다양한 가변성, 항성 색상 및 모션, 인접 근접 기능을 계산하는 함수입니다.
zh_cn: <strong><a href="https://astrobase.readthedocs.io/en/latest/astrobase.varclass.html">varclass</a></strong>：用于计算各种可变性，恒星颜色和运动以及邻居邻近度特征的函数，以及基于随机森林的分类器。

source: A <a href="#contents">overview</a> of the modules and subpackages is provided below.
es: A continuaci&oacute;n se proporciona una <a href="#contents">descripci&oacute;n general</a> de los m&oacute;dulos y subpaquetes.
ja: <a href="#contents">概要</a>モジュール及びサブパッケージのは、以下に提供されます。
ko: <a href="#contents">관련</a> 모듈 및 서브 패키지 아래에 제공된다.
zh_cn: 甲<a href="#contents">概述</a>的模块和子包的提供如下。

source: Astrobase is a Python package for analyzing light curves and finding variable stars. It includes implementations of several period-finding algorithms, batch work drivers for working on large collections of light curves, and a small web-app useful for reviewing and classifying light curves by stellar variability type.
es: Astrobase es un paquete Python para analizar las curvas de luz y encontrar estrellas variables.Incluye implementaciones de varios algoritmos de búsqueda de períodos,controladores de trabajo por lotes para trabajar en grandes colecciones de curvas de luz,y una pequeña aplicación web útil para revisar y clasificar las curvas de luz por tipo de variabilidad estelar.
ja: Astrobase は、ライトカーブを分析したり、変動星を見つけたりするための Python パッケージです。いくつかの周期探索アルゴリズムの実装、大規模なライトカーブのコレクションを扱うためのバッチ作業用ドライバ、そして恒星変動タイプによるライトカーブのレビューや分類に便利な小さなウェブアプリが含まれています。
ko: Astrobase는 빛의 곡선을 분석하고 변광성을 찾기위한 Python 패키지입니다. 여기에는 여러 기간 찾기 알고리즘의 구현, 대규모 광 곡선 컬렉션 작업을위한 배치 작업 드라이버, 별 변동성 유형별로 광 곡선을 검토하고 분류하는 데 유용한 작은 웹 앱이 포함됩니다.
zh_cn: Astrobase是一个Python软件包,用于分析光曲线和查找变星。它包括几个周期查找算法的实现,用于处理大量光曲线集合的批处理驱动,以及一个小型的网络应用,用于按恒星变异性类型审查和分类光曲线。

source: Changelog
ja: 変更履歴
ko: 변경 로그
zh_cn: 变更日志

source: Contents
es: Contenido
ja: 内容
ko: 내용
zh_cn: 内容

source: For optional functionality, some additional packages are required:
es: Para la funcionalidad opcional,se requieren algunos paquetes adicionales:
ja: オプション機能の場合は、いくつかの追加パッケージが必要です。
ko: 선택적 기능의 경우 몇 가지 추가 패키지가 필요합니다.
zh_cn: 对于可选功能,需要一些额外的包。

source: If you're using:
es: Si te estás drogando:
ja: 使っているのであれば
ko: 사용중인 경우 :
zh_cn: 如果你在用。

source: Install <strong><a href="https://pypi.org/project/astrobase/">astrobase</a></strong> from the Python Package Index (PyPI):
es: Instale <strong><a href="https://pypi.org/project/astrobase/">astrobase</a></strong> desde el &iacute;ndice de paquetes de Python (PyPI):
ja: Pythonパッケージインデックス（PyPI）から<strong><a href="https://pypi.org/project/astrobase/">astrobase</a></strong>をインストールします。
ko: Python Package Index (PyPI)에서 <strong><a href="https://pypi.org/project/astrobase/">astrobase</a></strong> 를 설치합니다 .
zh_cn: 从Python软件包索引（PyPI）安装<strong><a href="https://pypi.org/project/astrobase/">astrobase</a></strong>：

source: Install all the optional dependencies as well:
es: Instale también todas las dependencias opcionales:
ja: オプションの依存関係もすべてインストールします。
ko: 모든 선택적 종속성도 설치하십시오.
zh_cn: 同时安装所有可选的依赖项。

source: Install the latest version (may be unstable at times):
es: Instale la última versión (puede ser inestable a veces):
ja: 最新版をインストールしてください(不安定な場合があります)。
ko: 최신 버전 설치 (때때로 불안정 할 수 있음) :
zh_cn: 安装最新版本(有时可能不稳定)。

source: Installation
es: Instalación
ja: インストール
ko: 설치
zh_cn: 安装

source: Installing with pip
es: Instalar con pip
ja: パイプを使った設置
ko: pip로 설치
zh_cn: 用管道安装

source: Jupyter notebooks that demonstrate some of the functionality are available in the <a href="https://github.com/waqasbhatti/astrobase-notebooks">astrobase-notebooks</a> repository.
es: Los cuadernos de Jupyter que demuestran algunas de las funciones est&aacute;n disponibles en el <a href="https://github.com/waqasbhatti/astrobase-notebooks">repositorio de cuadernos de astrobase</a> .
ja: 一部の機能を示すJupyterノートブックは、<a href="https://github.com/waqasbhatti/astrobase-notebooks">astrobase-notebooks</a> リポジトリで入手できます。
ko: 일부 기능을 보여주는 Jupyter 노트북은 <a href="https://github.com/waqasbhatti/astrobase-notebooks">astrobase-notebooks</a> 저장소 에서 사용할 수 있습니다 .
zh_cn: astrobase <a href="https://github.com/waqasbhatti/astrobase-notebooks">-notebooks</a> 存储库中提供了演示某些功能的Jupyter笔记本。

source: License
es: Licencia
ja: ライセンス
ko: 특허
zh_cn: 许可证

source: Most functions in this package that deal with light curves usually require three Numpy ndarrays as input: <code>times</code>, <code>mags</code>, and <code>errs</code>, so they should work with any time-series data that can be represented in this form. If you have flux time series measurements, most functions also take a <code>magsarefluxes</code> keyword argument that makes them handle flux light curves correctly.
es: La mayor&iacute;a de las funciones de este paquete que se ocupan de las curvas de luz normalmente requieren tres ndarrays Numpy como entrada: <code>times</code> , <code>mags</code> y <code>errs</code> , por lo que deber&iacute;an funcionar con cualquier dato de serie temporal que pueda representarse de esta forma. Si tiene mediciones de series de tiempo de flujo, la mayor&iacute;a de las funciones tambi&eacute;n toman un argumento de palabra clave <code>magsarefluxes</code> que las hace manejar correctamente las curvas de luz de flujo.
ja: 光曲線との契約は、通常3 numpyの入力としてndarrays必要とすることに、このパッケージのほとんどの機能： <code>times</code> 、 <code>mags</code> 、および <code>errs</code> ので、彼らはこの形式で表現することができる任意の時系列データを扱う必要があります。光束の時系列測定がある場合、ほとんどの関数は <code>magsarefluxes</code> キーワード引数も取り、光束の光度曲線を正しく処理します。
ko: 라이트 커브를 처리하는이 패키지의 대부분의 함수는 일반적으로 세 개의 Numpy ndarray를 입력으로 필요로합니다 : <code>times</code> , <code>mags</code> , <code>errs</code> , 따라서이 형식으로 표현할 수있는 모든 시계열 데이터와 함께 작동해야합니다. 플럭스 시계열 측정이있는 경우 대부분의 함수는 플럭스 광 곡선을 올바르게 처리 하도록하는 <code>magsarefluxes</code> 키워드 인수 도받습니다 .
zh_cn: 此程序包中处理光曲线的大多数函数通常需要三个Numpy ndarray作为输入： <code>times</code> ， <code>mags</code> 和 <code>errs</code> ，因此它们应使用可以以这种形式表示的任何时间序列数据。如果您具有通量时间序列测量值，则大多数函数还会采用 <code>magsarefluxes</code> 关键字参数，使它们正确处理通量光曲线。

source: Once that's done, install astrobase.
es: Una vez hecho esto,instale la astrobase.
ja: それが終わったら、 astrobaseをインストールします。
ko: 완료되면 astrobase를 설치하십시오.
zh_cn: 完成后,安装 astrobase。

source: Other installation methods
es: Otros métodos de instalación
ja: その他の設置方法
ko: 기타 설치 방법
zh_cn: 其他安装方法

source: Otherwise, you'll need to make sure that a Fortran compiler and numpy are installed beforehand to compile the pyeebls package that astrobase depends on:
es: De lo contrario,tendrás que asegurarte de que un compilador de Fortran y numpy estén instalados de antemano para compilar el paquete pyeebls del que depende la astrobase:
ja: そうでなければ、 astrobase が依存する pyeebls パッケージをコンパイルするために Fortran コンパイラと numpy があらかじめインストールされていることを確認する必要があります。
ko: 그렇지 않으면 astrobase가 의존하는 pyeebls 패키지를 컴파일하기 위해 Fortran 컴파일러와 numpy가 미리 설치되어 있는지 확인해야합니다.
zh_cn: 否则,你需要确保事先安装了 Fortran 编译器和 numpy 来编译 astrobase 所依赖的 pyeebls 包。
