Repository: Yuniorcr/runebook
Catalog: xlf/packages/*/python/astrobase.001.xlf
Languages: es, ja, ko, zh_cn

source: 64-bit Linux and Python 2.7, 3.4, 3.5, 3.6, 3.7
es: Linux y Python de 64 bits 2.7,3.4,3.5,3.6,3.7
ja: 64ビットLinuxとPython 2.7,3.4,3.5,3.6,3.7
ko: 64 비트 Linux 및 Python 2.7, 3.4, 3.5, 3.6, 3.7
zh_cn: 64位Linux和Python 2.7、3.4、3.5、3.6、3.7。

source: 64-bit Mac OSX 10.12+ with Python 2.7 or 3.6
es: Mac OSX 10.12+de 64 bits con Python 2.7 o 3.6
ja: 64ビットMac OSX 10.12+とPython 2.7または3.6を搭載
ko: 64 비트 Mac OSX 10.12+ (Python 2.7 또는 3.6 포함)
zh_cn: 64位Mac OSX 10.12+,Python 2.7或3.6。

source: 64-bit Windows with Python 2.7 and 3.6
es: Windows de 64 bits con Python 2.7 y 3.6
ja: 64ビットWindowsにPython 2.7と3.6を搭載
ko: Python 2.7 및 3.6이 설치된 64 비트 Windows
zh_cn: 64位Windows与Python 2.7和3.6。

source: <code>astrobase</code> is provided under the MIT License. See the LICENSE file for the full text.
es: <code>astrobase</code> se proporciona bajo la licencia MIT. Consulte el archivo de LICENCIA para obtener el texto completo.
ja: <code>astrobase</code> はMITライセンスの下で提供されます。全文については、LICENSEファイルを参照してください。
ko: <code>astrobase</code> 는 MIT 라이선스에 따라 제공됩니다. 전체 텍스트는 LICENSE 파일을 참조하십시오.
zh_cn: <code>astrobase</code> 是根据MIT许可证提供的。有关全文，请参见LICENSE文件。

source: <strong><a href="https://astrobase.readthedocs.io/en/latest/astrobase.astrokep.html">astrokep</a></strong>: contains functions for dealing with Kepler and K2 Mission light curves from STScI MAST (reading the FITS files, consolidating light curves for objects over quarters), and some basic operations (converting fluxes to mags, decorrelation of light curves, filtering light curves, and fitting object centroids for eclipse analysis, etc.)
es: <strong><a href="https://astrobase.readthedocs.io/en/latest/astrobase.astrokep.html">astrokep</a></strong> : contiene funciones para lidiar con las curvas de luz de Kepler y K2 Mission de STScI MAST (leer los archivos FITS, consolidar las curvas de luz para objetos sobre cuartos) y algunas operaciones b&aacute;sicas (convertir flujos en revistas, descorrelaci&oacute;n de curvas de luz, filtrar curvas de luz, y ajuste de centroides de objetos para an&aacute;lisis de eclipses, etc.)
ja: <strong><a href="https://astrobase.readthedocs.io/en/latest/astrobase.astrokep.html">astrokep</a></strong>：STScI MASTからのケプラーおよびK2ミッションライトカーブ（FITSファイルの読み取り、オブジェクトのライトカーブの4分の1への統合）、およびいくつかの基本操作（フラックスからマグへの変換、ライトカーブの非相関、ライトカーブのフィルタリング、および日食分析などのためのオブジェクトの重心のフィッティング）
ko: <strong><a href="https://astrobase.readthedocs.io/en/latest/astrobase.astrokep.html">astrokep</a></strong> : STScI MAST의 Kepler 및 K2 Mission 조명 곡선 (FITS 파일 읽기, 분기에 걸쳐 개체에 대한 조명 곡선 통합) 및 일부 기본 작업 (플럭스를 매그로 변환, 조명 곡선의 역 상관, 조명 곡선 필터링, 일식 분석을위한 물체 중심 맞추기 등)
zh_cn: <strong><a href="https://astrobase.readthedocs.io/en/latest/astrobase.astrokep.html">astrokep</a></strong>：包含用于处理来自STScI MAST的开普勒和K2任务光曲线的功能（读取FITS文件，合并超过四分之一<strong>秒的</strong>物体的光曲线），以及一些基本操作（将磁通量转换为磁，光曲线的去相关，过滤光曲线，并拟合对象质心以进行日食分析等）

source: <strong><a href="https://astrobase.readthedocs.io/en/latest/astrobase.astrotess.html">astrotess</a></strong>: contains functions for dealing with TESS 2-minute cadence light curves from STScI MAST (reading the FITS files, consolidating light curves for objects over sectors), and some basic operations (converting fluxes to mags, filtering light curves, etc.)
es: <strong><a href="https://astrobase.readthedocs.io/en/latest/astrobase.astrotess.html">astrotess</a></strong> : contiene funciones para tratar con TESS curvas de luz de cadencia de 2 minutos de STScI MAST (leer los archivos FITS, consolidar curvas de luz para objetos sobre sectores) y algunas operaciones b&aacute;sicas (convertir flujos en revistas, filtrar curvas de luz, etc.)
ja: <strong><a href="https://astrobase.readthedocs.io/en/latest/astrobase.astrotess.html">astrotess</a></strong>：STScI MASTからのTESS 2分のケイデンスライトカーブ（FITSファイルの読み取り、セクター上のオブジェクトのライトカーブの統合）、およびいくつかの基本操作（フラックスのマグへの変換、ライトカーブのフィルタリングなど）を処理するための関数が含まれます。
ko: <strong><a href="https://astrobase.readthedocs.io/en/latest/astrobase.astrotess.html">astrotess</a></strong> : STScI MAST의 TESS 2 분 케이던스 광 곡선 (FITS 파일 읽기, 섹터에 대한 객체의 광 곡선 통합) 및 일부 기본 작업 (플럭스를 매그로 변환, 광 곡선 필터링 등)을 처리하는 기능이 포함되어 있습니다.
zh_cn: <strong><a href="https://astrobase.readthedocs.io/en/latest/astrobase.astrotess.html">astrotess</a></strong>：包含用于处理来自STScI MAST的TESS 2分钟脚踏圈速光曲线的功能（读取FITS文件，合并扇区上物体的光曲线），以及一些基本操作（将通量转换为mags，过滤光曲线等）。

source: <strong><a href="https://astrobase.readthedocs.io/en/latest/astrobase.checkplot.html">checkplot</a></strong>: contains functions to make checkplots: a grid of plots used to quickly decide if a period search for a possibly variable object was successful. Checkplots come in two forms:
es: <strong><a href="https://astrobase.readthedocs.io/en/latest/astrobase.checkplot.html">checkplot</a></strong> : contiene funciones para hacer checkplots: una cuadr&iacute;cula de gr&aacute;ficos que se usa para decidir r&aacute;pidamente si una b&uacute;squeda de per&iacute;odo para un objeto posiblemente variable fue exitosa. Los diagramas de verificaci&oacute;n vienen en dos formas:
ja: <strong><a href="https://astrobase.readthedocs.io/en/latest/astrobase.checkplot.html">checkplot</a></strong>：チェックプロットを作成するための関数が含まれています。変数の可能性のあるオブジェクトの周期検索が成功したかどうかをすばやく判断するために使用されるプロットのグリッド。チェックプロットには2つの形式があります。
ko: <strong><a href="https://astrobase.readthedocs.io/en/latest/astrobase.checkplot.html">checkplot</a></strong> : 체크 플롯을 만드는 함수를 포함합니다 : 가능한 가변 객체에 대한 기간 검색이 성공했는지 신속하게 결정하는 데 사용되는 플롯 그리드. 체크 플롯은 두 가지 형태로 제공됩니다.
zh_cn: <strong><a href="https://astrobase.readthedocs.io/en/latest/astrobase.checkplot.html">checkplot</a></strong>：包含用于进行检查的功能：用于快速确定可能的可变对象的期间搜索是否成功的图表网格。支票有两种形式：

source: <strong><a href="https://astrobase.readthedocs.io/en/latest/astrobase.coordutils.html">coordutils</a></strong>: functions for dealing with coordinates (conversions, distances, proper motion)
es: <strong><a href="https://astrobase.readthedocs.io/en/latest/astrobase.coordutils.html">coordutils</a></strong> : funciones para tratar con coordenadas (conversiones, distancias, movimiento propio)
ja: <strong><a href="https://astrobase.readthedocs.io/en/latest/astrobase.coordutils.html">coordutils</a></strong>：座標（変換、距離、適切な動き）を処理するための関数
ko: <strong><a href="https://astrobase.readthedocs.io/en/latest/astrobase.coordutils.html">coordutils</a></strong> : 좌표 (변환, 거리, 적절한 동작)를 처리하는 기능
zh_cn: <strong><a href="https://astrobase.readthedocs.io/en/latest/astrobase.coordutils.html">coordutils</a></strong>：用于处理坐标（转换，距离，适当运动）的函数

source: <strong><a href="https://astrobase.readthedocs.io/en/latest/astrobase.fakelcs.html">fakelcs</a></strong>: modules and functions to conduct an end-to-end variable star recovery simulation.
es: <strong><a href="https://astrobase.readthedocs.io/en/latest/astrobase.fakelcs.html">fakelcs</a></strong> : m&oacute;dulos y funciones para realizar una simulaci&oacute;n de recuperaci&oacute;n de estrellas variables de extremo a extremo.
ja: <strong><a href="https://astrobase.readthedocs.io/en/latest/astrobase.fakelcs.html">fakelcs</a></strong>：エンドツーエンドの変光星回復シミュレーションを実行するためのモジュールと関数。
ko: <strong><a href="https://astrobase.readthedocs.io/en/latest/astrobase.fakelcs.html">fakelcs</a></strong> : 종단 간 가변 별 복구 시뮬레이션을 수행하는 모듈 및 기능.
zh_cn: <strong><a href="https://astrobase.readthedocs.io/en/latest/astrobase.fakelcs.html">fakelcs</a></strong>：进行端到端可变恒星恢复模拟的模块和功能。

source: <strong><a href="https://astrobase.readthedocs.io/en/latest/astrobase.hatsurveys.html">hatsurveys</a></strong>: modules to read, filter, and normalize light curves from various HAT surveys.
es: <strong><a href="https://astrobase.readthedocs.io/en/latest/astrobase.hatsurveys.html">hatsurveys</a></strong> : m&oacute;dulos para leer, filtrar y normalizar las curvas de luz de varias encuestas HAT.
ja: <strong><a href="https://astrobase.readthedocs.io/en/latest/astrobase.hatsurveys.html">hatsurveys</a></strong>：さまざまなHAT調査からの光度曲線を読み取り、フィルターにかけ、正規化するモジュール。
ko: <strong><a href="https://astrobase.readthedocs.io/en/latest/astrobase.hatsurveys.html">hatsurveys</a></strong> : 다양한 HAT 설문 조사에서 빛 곡선을 읽고, 필터링하고, 정규화하는 모듈입니다.
zh_cn: <strong><a href="https://astrobase.readthedocs.io/en/latest/astrobase.hatsurveys.html">hatsurveys</a></strong>：用于读取，过滤和归一化来自各种HAT测量的光曲线的模块。

source: <strong><a href="https://astrobase.readthedocs.io/en/latest/astrobase.lcfit.html">lcfit</a></strong>: functions for fitting light curve models to observations, including sinusoidal, trapezoidal and full Mandel-Agol planet transits, eclipses, and splines.
es: <strong><a href="https://astrobase.readthedocs.io/en/latest/astrobase.lcfit.html">lcfit</a></strong> : funciones para ajustar modelos de curvas de luz a observaciones, incluidos tr&aacute;nsitos, eclipses y splines sinusoidales, trapezoidales y planetarios completos Mandel-Agol.
ja: <strong><a href="https://astrobase.readthedocs.io/en/latest/astrobase.lcfit.html">lcfit</a></strong>：正弦曲線、台形、および完全なマンデル-アゴル惑星の通過、日食、スプラインなどの観測に光度曲線モデルを適合させるための関数。
ko: <strong><a href="https://astrobase.readthedocs.io/en/latest/astrobase.lcfit.html">lcfit</a></strong> : 정현파, 사다리꼴 및 전체 Mandel-Agol 행성 통과, 일식 및 스플라인을 포함하여 광 곡선 모델을 관측에 맞추기위한 함수입니다.
zh_cn: <strong><a href="https://astrobase.readthedocs.io/en/latest/astrobase.lcfit.html">lcfit</a></strong>：用于将光曲线模型拟合到观测值的功能，包括正弦，梯形和完整的Mandel-Agol行星过境，日食和样条曲线。

source: <strong><a href="https://astrobase.readthedocs.io/en/latest/astrobase.lcmath.html">lcmath</a></strong>: functions for light curve operations such as phasing, normalization, binning (in time and phase), sigma-clipping, external parameter decorrelation (EPD), etc.
es: <strong><a href="https://astrobase.readthedocs.io/en/latest/astrobase.lcmath.html">lcmath</a></strong> : funciones para operaciones de curva de luz como phasing, normalization, binning (en tiempo y fase), sigma-clipping, decorrelaci&oacute;n de par&aacute;metros externos (EPD), etc.
ja: <strong><a href="https://astrobase.readthedocs.io/en/latest/astrobase.lcmath.html">lcmath</a></strong>：フェーズ、正規化、ビニング（時間と位相）、シグマクリッピング、外部パラメーター非相関（EPD）などのライトカーブ操作用の関数
ko: <strong><a href="https://astrobase.readthedocs.io/en/latest/astrobase.lcmath.html">lcmath</a></strong> : 위상, 정규화, 비닝 (시간 및 위상), 시그마 클리핑, 외부 매개 변수 역 상관 (EPD) 등과 같은 라이트 커브 작업을위한 함수
zh_cn: <strong><a href="https://astrobase.readthedocs.io/en/latest/astrobase.lcmath.html">lcmath</a></strong>：用于光曲线操作的功能，例如定相，归一化，合并（在时间和相位上），sigma-clipping，外部参数去相关（EPD）等。

source: <strong><a href="https://astrobase.readthedocs.io/en/latest/astrobase.lcmodels.html">lcmodels</a></strong>: first order models for fast fitting (for the purposes of variable classification) to various periodic variable types, including sinusoidal variables, eclipsing binaries, transiting planets, and flares.
es: <strong><a href="https://astrobase.readthedocs.io/en/latest/astrobase.lcmodels.html">lcmodels</a></strong> : modelos de primer orden para un ajuste r&aacute;pido (a efectos de clasificaci&oacute;n de variables) a varios tipos de variables peri&oacute;dicas, incluidas variables sinusoidales, binarias eclipsantes, planetas en tr&aacute;nsito y destellos.
ja: <strong><a href="https://astrobase.readthedocs.io/en/latest/astrobase.lcmodels.html">lcmodels</a></strong>：正弦波変数、食の連星、通過する惑星、フレアなどのさまざまな周期的変数タイプに（変数分類の目的で）高速フィットするための1次モデル。
ko: <strong><a href="https://astrobase.readthedocs.io/en/latest/astrobase.lcmodels.html">lcmodels</a></strong> : 정현파 변수,이<strong> 클립 싱</strong> 바이너리, 천이 행성 및 플레어를 포함한 다양한 주기적 변수 유형에 대한 빠른 피팅 (변수 분류 목적)을위한 1 차 모델.
zh_cn: <strong><a href="https://astrobase.readthedocs.io/en/latest/astrobase.lcmodels.html">lcmodels</a></strong>：一阶模型，用于快速拟合（出于变量分类的目的）各种周期性变量类型，包括正弦变量，日食双星，过渡行星和耀斑。

source: <strong><a href="https://astrobase.readthedocs.io/en/latest/astrobase.lcproc.html">lcproc</a></strong>: driver functions for running an end-to-end pipeline including: (i) object selection from a collection of light curves by position, cross-matching to external catalogs, or light curve objectinfo keys, (ii) running variability feature calculation and detection, (iii) running period-finding, and (iv) object review using the checkplotserver webapp for variability classification.
es: <strong><a href="https://astrobase.readthedocs.io/en/latest/astrobase.lcproc.html">lcproc</a></strong> : funciones de controlador para ejecutar una tuber&iacute;a de extremo a extremo que incluye: (i) selecci&oacute;n de objetos de una colecci&oacute;n de curvas de luz por posici&oacute;n, comparaci&oacute;n cruzada con cat&aacute;logos externos o claves de informaci&oacute;n de objeto de curva de luz, (ii) c&aacute;lculo de caracter&iacute;sticas de variabilidad en ejecuci&oacute;n y detecci&oacute;n, (iii) b&uacute;squeda de per&iacute;odos de ejecuci&oacute;n y (iv) revisi&oacute;n de objetos mediante la aplicaci&oacute;n web checkplotserver para la clasificaci&oacute;n de variabilidad.
ja: <strong><a href="https://astrobase.readthedocs.io/en/latest/astrobase.lcproc.html">lcproc</a></strong>：エンドツーエンドのパイプラインを実行するためのドライバー関数：（i）位置による光度曲線のコレクションからのオブジェクト選択、外部カタログへのクロスマッチング、または光度曲線オブジェクト情報キー、（ii）変動性機能計算の実行、および検出、（iii）期間調査の実行、および（iv）変動性分類のためのcheckplotserver Webアプリケーションを使用したオブジェクトの確認。
ko: <strong><a href="https://astrobase.readthedocs.io/en/latest/astrobase.lcproc.html">lcproc</a></strong> : (i) 위치 별 광원 곡선 모음에서 개체 선택, 외부 카탈로그에 대한 교차 일치 또는 광원 곡선 개체 정보 키, (ii) 가변성 기능 계산 실행 및 탐지, (iii) 실행 기간 찾기, (iv) 가변성 분류를 위해 checkplotserver 웹 앱을 사용한 객체 검토.
zh_cn: <strong><a href="https://astrobase.readthedocs.io/en/latest/astrobase.lcproc.html">lcproc</a></strong>：用于运行端到端管道的驱动程序功能，包括：（i）通过位置从光曲线集合中选择对象，与外部目录交叉匹配或光曲线objectinfo键，（ii）运行可变性特征计算和检测，（iii）运行期查找和（iv）使用checkplotserver webapp进行变量分类的对象检查。
