Repository: Yuniorcr/runebook
Catalog: xlf/packages/*/python/beautifulsoup4.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: Beautiful Soup is a library that makes it easy to scrape information from web pages. It sits atop an HTML or XML parser, providing Pythonic idioms for iterating, searching, and modifying the parse tree.
es: Beautiful Soup es una biblioteca que facilita el raspado de información de las páginas web.Se sitúa encima de un analizador HTML o XML,proporcionando expresiones pythonicas para iterar,buscar y modificar el árbol de análisis.
ja: Beautiful Soup は、Web ページから情報を簡単にスクレイプできるようにするライブラリです。HTML や XML パーサーの上に置かれ、反復、検索、解析ツリーの修正のための Pythonic イディオムを提供します。
ko: 뷰티플 수프는 웹 페이지에서 정보를 쉽게 긁어 낼 수있는 라이브러리입니다. HTML 또는 XML 파서 위에 위치하여 구문 분석 트리를 반복, 검색 및 수정하기위한 Python 관용구를 제공합니다.
ru: Beautiful Soup-это библиотека,которая позволяет легко отскабливать информацию с веб-страниц.Она находится на вершине парсера HTML или XML,предоставляя питоновские идиомы для итерации,поиска и модификации дерева разбора.
zh_cn: Beautiful Soup是一个可以轻松地从网页中搜刮信息的库,它位于HTML或XML解析器之上,提供Pythonic成语,用于迭代、搜索和修改解析树。它位于HTML或XML解析器之上,为迭代、搜索和修改解析树提供Pythonic习语。

source: Beautiful Soup supports unit test discovery from the project root directory:
es: Beautiful Soup soporta el descubrimiento de pruebas unitarias desde el directorio raíz del proyecto:
ja: Beautiful Soupは、プロジェクトのルートディレクトリからのユニットテストの発見をサポートしています。
ko: 뷰티플 수프는 프로젝트 루트 디렉터리에서 단위 테스트 검색을 지원합니다.
ru: Beautiful Soup поддерживает обнаружение модульных тестов из корневого каталога проекта:
zh_cn: 美丽汤支持从项目根目录中发现单元测试。

source: Bug tracker
es: Rastreador de bichos
ja: バグトラッカー
ko: 버그 추적기
ru: охотник за ошибками
zh_cn: 错误跟踪器

source: Building the documentation
es: Construir la documentación
ja: ドキュメントの構築
ko: 문서 작성
ru: Строительство документации
zh_cn: 建立文件

source: Complete changelog
es: Registro de cambios completo
ja: 完全な変更履歴
ko: 완전한 변경 로그
ru: Полный журнал изменений
zh_cn: 完整的变更日志

source: Development
es: Desarrollo
ja: 開発の様子
ko: 개발
ru: Разработка
zh_cn: 发展

source: Discussion group
es: Grupo de discusión
ja: ディスカッショングループ
ko: 토론 그룹
ru: Дискуссионная группа
zh_cn: 讨论组

source: Documentation
es: Documentación
ja: ドキュメント
ko: 선적 서류 비치
ru: Документация
zh_cn: 文件资料

source: For this reason, I plan to discontinue Beautiful Soup's Python 2 support at some point after December 31, 2020: one year after the sunset date for Python 2 itself. Beyond that point, new Beautiful Soup development will exclusively target Python 3. Of course, older releases of Beautiful Soup, which support both versions, will continue to be available.
es: Por esta razón,planeo descontinuar el soporte de Python 2 de Beautiful Soup en algún momento después del 31 de diciembre de 2020:un año después de la fecha de puesta de sol para Python 2 en sí.Más allá de ese punto,el nuevo desarrollo de Beautiful Soup se centrará exclusivamente en Python 3.Por supuesto,las versiones más antiguas de Beautiful Soup,que soportan ambas versiones,seguirán estando disponibles.
ja: このため、2020年12月31日のPython 2のサンセット日から1年後の2020年12月31日以降に、Beautiful SoupのPython 2のサポートを終了する予定です。それ以降、Beautiful Soupの新規開発はPython 3のみをターゲットにします。もちろん、両方のバージョンをサポートしているBeautiful Soupの古いリリースは引き続き利用可能です。
ko: 따라서 저는 2020 년 12 월 31 일 (파이썬 2 자체의 종료일로부터 1 년 후) 이후에 뷰티플 수프의 파이썬 2 지원을 중단 할 계획입니다. 그 이후로 새로운 Beautiful Soup 개발은 독점적으로 Python 3을 대상으로 할 것입니다. 물론 두 버전을 모두 지원하는 Beautiful Soup의 이전 릴리스는 계속 사용할 수 있습니다.
ru: По этой причине я планирую в какой-то момент после 31 декабря 2020 года прекратить поддержку Python 2 Красивого Супа:через год после даты захода солнца для самого Python 2.По истечении этого срока новая разработка Beautiful Soup будет нацелена исключительно на Python 3.Конечно,более старые выпуски Beautiful Soup,которые поддерживают обе версии,будут по-прежнему доступны.
zh_cn: 为此,我计划在 2020 年 12 月 31 日之后的某个时间点停止 Beautiful Soup 对 Python 2 的支持:Python 2 本身的日落日期后一年。在那之后,新的Beautiful Soup开发将专门针对Python 3。当然,支持这两个版本的老版本Beautiful Soup将继续提供。

source: Homepage
es: Página web
ja: ホームページ
ko: 홈페이지
ru: Домашняя страница
zh_cn: 首页

source: If you checked out the source tree, you should see a script in the home directory called test-all-versions. This script will run the unit tests under Python 2, then create a temporary Python 3 conversion of the source and run the unit tests again under Python 3.
es: Si revisaste el árbol fuente,deberías ver un guión en el directorio principal llamado "test-all-versions".Este script ejecutará las pruebas de unidad en Python 2,luego creará una conversión temporal a Python 3 de la fuente y ejecutará las pruebas de unidad nuevamente en Python 3.
ja: ソースツリーをチェックアウトすると、ホームディレクトリに test-all-versions というスクリプトがあるはずです。このスクリプトは、Python 2 でユニットテストを実行し、ソースの一時的な Python 3 変換を作成して、Python 3 でユニットテストを再度実行します。
ko: 소스 트리를 체크 아웃 한 경우 홈 디렉토리에 test-all-versions라는 스크립트가 표시되어야합니다. 이 스크립트는 Python 2에서 단위 테스트를 실행 한 다음 소스의 임시 Python 3 변환을 만들고 Python 3에서 다시 단위 테스트를 실행합니다.
ru: Если вы извлекли дерево исходных текстов,то в домашнем каталоге вы должны увидеть скрипт,называемый testt-all-versions.Этот скрипт выполнит юнит-тесты на Python 2,затем создаст временное преобразование исходного кода на Python 3 и запустит юнит-тесты снова на Python 3.
zh_cn: 如果你检查了源代码树,你应该在主目录下看到一个名为test-all-versions的脚本。这个脚本将在Python 2下运行单元测试,然后创建一个临时的Python 3转换的源代码,并在Python 3下再次运行单元测试。

source: If you use Beautiful Soup as part of your professional work, please consider a <a href="https://tidelift.com/subscription/pkg/pypi-beautifulsoup4?utm_source=pypi-beautifulsoup4&amp;utm_medium=referral&amp;utm_campaign=readme">Tidelift subscription</a>. This will support many of the free software projects your organization depends on, not just Beautiful Soup.
es: Si usa Beautiful Soup como parte de su trabajo profesional, considere una <a href="https://tidelift.com/subscription/pkg/pypi-beautifulsoup4?utm_source=pypi-beautifulsoup4&amp;utm_medium=referral&amp;utm_campaign=readme">suscripci&oacute;n a Tidelift</a> . Esto apoyar&aacute; muchos de los proyectos de software libre de los que depende su organizaci&oacute;n, no solo Beautiful Soup.
ja: プロの仕事の一環としてBeautiful Soupを使用する場合は、<a href="https://tidelift.com/subscription/pkg/pypi-beautifulsoup4?utm_source=pypi-beautifulsoup4&amp;utm_medium=referral&amp;utm_campaign=readme">Tideliftサブスクリプション</a>を検討してください 。これは、Beautiful Soupだけでなく、組織が依存する多くのフリーソフトウェアプロジェクトをサポートします。
ko: Beautiful Soup을 전문적인 작업의 일부로 사용하는 경우 <a href="https://tidelift.com/subscription/pkg/pypi-beautifulsoup4?utm_source=pypi-beautifulsoup4&amp;utm_medium=referral&amp;utm_campaign=readme">Tidelift 구독을</a> 고려하십시오 . 이것은 Beautiful Soup뿐만 아니라 조직이 의존하는 많은 무료 소프트웨어 프로젝트를 지원합니다.
ru: Если вы используете Beautiful Soup в рамках своей профессиональной деятельности, рассмотрите <a href="https://tidelift.com/subscription/pkg/pypi-beautifulsoup4?utm_source=pypi-beautifulsoup4&amp;utm_medium=referral&amp;utm_campaign=readme">возможность подписки</a> на Tidelift . Это поддержит многие проекты бесплатного программного обеспечения, от которых зависит ваша организация, а не только Beautiful Soup.
zh_cn: 如果您将Beautiful Soup用作专业工作的一部分，请考虑 <a href="https://tidelift.com/subscription/pkg/pypi-beautifulsoup4?utm_source=pypi-beautifulsoup4&amp;utm_medium=referral&amp;utm_campaign=readme">订阅Tidelift</a>。这将支持您组织依赖的许多免费软件项目，而不仅仅是Beautiful Soup。

source: If you use Beautiful Soup for personal projects, the best way to say thank you is to read <a href="https://www.crummy.com/software/BeautifulSoup/zine/">Tool Safety</a>, a zine I wrote about what Beautiful Soup has taught me about software development.
es: Si usa Beautiful Soup para proyectos personales, la mejor manera de agradecerle es leer <a href="https://www.crummy.com/software/BeautifulSoup/zine/">Tool Safety</a> , un zine que escrib&iacute; sobre lo que Beautiful Soup me ha ense&ntilde;ado sobre el desarrollo de software.
ja: Beautiful Soupを個人的なプロジェクトに使用する場合、お礼を言うには、Beautiful Soupがソフトウェア開発について教えたことについて書いた<a href="https://www.crummy.com/software/BeautifulSoup/zine/">ツールの安全性</a>を読むことをお勧めします 。
ko: 뷰티플 수프를 개인 프로젝트에 사용한다면 감사의 말을하는 가장 좋은 방법은 내가 뷰티플 수프가 소프트웨어 개발에 대해 가르쳐 준 내용에 대해 쓴 기사 인 <a href="https://www.crummy.com/software/BeautifulSoup/zine/">도구 안전</a> 을 읽는 것입니다.
ru: Если вы используете Beautiful Soup для личных проектов, лучший способ сказать спасибо - прочитать <a href="https://www.crummy.com/software/BeautifulSoup/zine/">Tool Safety</a> , журнал, который я написал о том, что Beautiful Soup научил меня разработке программного обеспечения.
zh_cn: 如果您将Beautiful Soup用于个人项目，则表示感谢的最好方法是阅读 <a href="https://www.crummy.com/software/BeautifulSoup/zine/">Tool Safety</a>，这是我写的一本有关Beautiful Soup教给我的软件开发知识的杂志。

source: Links
es: Enlaces
ja: リンク
ko: 연결
ru: Ссылки
zh_cn: 友情链接

source: Note on Python 2 sunsetting
es: Nota sobre la puesta de sol de Python 2
ja: Python 2のサンセット化についての注意点
ko: Python 2 종료에 대한 참고 사항
ru: Примечание на заходе солнца на питоне 2
zh_cn: 关于Python 2日落的说明

source: Quick start
es: Un comienzo rápido...
ja: クイックスタート
ko: 빠른 시작
ru: Быстрый старт
zh_cn: 快速启动

source: Running the unit tests
es: Ejecutando las pruebas de la unidad
ja: ユニットテストの実行
ko: 단위 테스트 실행
ru: Запуск модульных тестов
zh_cn: 运行单元测试

source: Screen-scraping library
es: Biblioteca de raspado de pantallas
ja: スクリーン・スクレイピング・ライブラリ
ko: 화면 스크래핑 라이브러리
ru: Экранная библиотека
zh_cn: 截屏库

source: Since 2012, Beautiful Soup has been developed as a Python 2 library which is automatically converted to Python 3 code as necessary. This makes it impossible to take advantage of some features of Python 3.
es: Desde 2012,Beautiful Soup se ha desarrollado como una biblioteca de Python 2 que se convierte automáticamente en código de Python 3 según sea necesario.Esto hace imposible aprovechar algunas características de Python 3.
ja: 2012年以降、Beautiful Soupは必要に応じて自動的にPython 3のコードに変換されるPython 2のライブラリとして開発されてきました。そのため、Python 3の一部の機能を利用することができません。
ko: 2012 년부터 뷰티플 수프는 필요에 따라 자동으로 파이썬 3 코드로 변환되는 파이썬 2 라이브러리로 개발되었습니다. 이로 인해 Python 3의 일부 기능을 활용할 수 없습니다.
ru: С 2012 года Beautiful Soup разрабатывается как библиотека на Python 2,которая при необходимости автоматически конвертируется в код на Python 3.Это делает невозможным использование некоторых возможностей Python 3.
zh_cn: 自2012年以来,Beautiful Soup一直作为Python 2库开发,必要时自动转换为Python 3代码。这使得它无法利用Python 3的一些特性。

source: Supporting the project
es: Apoyar el proyecto
ja: プロジェクトのサポート
ko: 프로젝트 지원
ru: Поддержка проекта
zh_cn: 支持项目

source: The bs4/doc/ directory contains full documentation in Sphinx format. Run <code>make html</code> in that directory to create HTML documentation.
es: El directorio bs4 / doc / contiene documentaci&oacute;n completa en formato Sphinx. Ejecute <code>make html</code> en ese directorio para crear documentaci&oacute;n HTML.
ja: bs4 / doc /ディレクトリには、Sphinx形式の完全なドキュメントが含まれています。そのディレクトリで <code>make html</code> を実行して、HTMLドキュメントを作成します。
ko: bs4 / doc / 디렉토리에는 Sphinx 형식의 전체 문서가 포함되어 있습니다. 해당 디렉토리에서 <code>make html</code> 을 실행 하여 HTML 문서를 만듭니다.
ru: Каталог bs4 / doc / содержит полную документацию в формате Sphinx. Запустите <code>make html</code> в этом каталоге, чтобы создать HTML-документацию.
zh_cn: bs4 / doc /目录包含Sphinx格式的完整文档。在该目录中运行 <code>make html</code> 以创建HTML文档。

source: To go beyond the basics, <a href="http://www.crummy.com/software/BeautifulSoup/bs4/doc/">comprehensive documentation is available</a>.
es: Para ir m&aacute;s all&aacute; de lo b&aacute;sico, se <a href="http://www.crummy.com/software/BeautifulSoup/bs4/doc/">encuentra disponible documentaci&oacute;n completa</a> .
ja: 基本を超えて、<a href="http://www.crummy.com/software/BeautifulSoup/bs4/doc/">包括的なドキュメントが利用可能です</a>。
ko: 기본 사항을 넘어 서기 위해 <a href="http://www.crummy.com/software/BeautifulSoup/bs4/doc/">포괄적 인 설명서를 사용할 수 있습니다</a> .
ru: Чтобы выйти за рамки основ, <a href="http://www.crummy.com/software/BeautifulSoup/bs4/doc/">доступна исчерпывающая документация</a> .
zh_cn: 除了基础知识之外，<a href="http://www.crummy.com/software/BeautifulSoup/bs4/doc/">还提供了全面的文档</a>。
