Repository: Yuniorcr/runebook
Catalog: xlf/packages/*/python/chatrelater.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: ) and save it to a PNG image (
es: ) y gu&aacute;rdelo en una imagen PNG (
ja: ）、PNG画像（
ko: )하고 PNG 이미지 (
ru: ) и сохраните его в формате PNG (
zh_cn: ）并将其保存到PNG图像中（

source: ) will be created in the process.
es: ) se crear&aacute; en el proceso.
ja: ）はその過程で作成されます。
ko: )이 생성됩니다.
ru: ) будут созданы в процессе.
zh_cn: ）将在此过程中创建。

source: 09-Aug-2015
es: 09-Agosto-2015
ja: 2015年8月9日
ko: 2015 년 8 월 9 일
ru: 09-август-2015

source: 2007-2015 <a href="http://homework.nwsnet.de/">Jochen Kupperschmidt</a>
ru: 2007-2015 <a href="http://homework.nwsnet.de/">Йохен Куппершмидт</a>
zh_cn: 2007-2015年<a href="http://homework.nwsnet.de/">Jochen Kupperschmidt</a>

source: <a href="http://www.python.org/">Python</a> 2.7+ or 3.3+ is required.
es: <a href="http://www.python.org/">Se</a> requiere Python 2.7+ o 3.3+.
ja: <a href="http://www.python.org/">Python</a> 2.7以降または3.3以降が必要です。
ko: <a href="http://www.python.org/">Python</a> 2.7+ 또는 3.3+가 필요합니다.
ru: <a href="http://www.python.org/"></a>Требуется Python 2.7+ или 3.3+.
zh_cn: <a href="http://www.python.org/">需要python</a> 2.7+或3.3+。

source: <strong>Chat Relater</strong> is a tool consisting of two command-line scripts:
es: <strong>Chat Relater</strong> es una herramienta que consta de dos scripts de l&iacute;nea de comandos:
ja: <strong>Chat Relater</strong>は、次の2つのコマンドラインスクリプトで構成されるツールです。
ko: <strong>Chat Relater</strong> 는 두 개의 명령 줄 스크립트로 구성된 도구입니다.
ru: <strong>Chat Relater</strong> - это инструмент, состоящий из двух скриптов командной строки:
zh_cn: <strong>聊天相关</strong>工具是由两个命令行脚本组成的工具：

source: Analyze and visualize relations between chat users.
es: Analizar y visualizar las relaciones entre los usuarios del chat.
ja: チャットユーザー間の関係を分析し、可視化します。
ko: 채팅 사용자 간의 관계를 분석하고 시각화합니다.
ru: Анализировать и визуализировать отношения между пользователями чата.
zh_cn: 分析和可视化聊天用户之间的关系。

source: And intermediate file containing the &lsquo;dot&rsquo; description (
es: Y un archivo intermedio que contiene la descripci&oacute;n del 'punto' (
ja: そして、「ドット」の説明を含む中間ファイル（
ko: 그리고 '점'설명이 포함 된 중간 파일 (
ru: И промежуточный файл, содержащий описание точки (
zh_cn: 以及包含&ldquo;点&rdquo;说明的中间文件（

source: Copyright:
es: Derechos de autor:
ja: 著作権。
ko: 저작권:
ru: Авторское право:
zh_cn: 版权所有。

source: Create a nice graph (using the &lsquo;twopi&rsquo; program) from the results (
es: Cree un gr&aacute;fico agradable (usando el programa 'twopi') a partir de los resultados (
ja: 結果から（「twopi」プログラムを使用して）素敵なグラフを作成します（
ko: 결과 ( 'twopi'프로그램 사용)에서 멋진 그래프를 만듭니다 (
ru: Создайте красивый график (используя программу twopi) по результатам (
zh_cn: 根据结果​​创建一个漂亮的图形（使用&ldquo; twopi&rdquo;程序）（

source: Date:
es: Cita:
ja: 日付。
ko: 데이트:
ru: Свидание:
zh_cn: 日期:

source: It is actually a conceptual clone of the <a href="http://www.jibble.org/piespy/">PieSpy</a> Social Network Bot. However, Chat Relater does not act as an IRC bot (although this could be easily accomplished by making use of the <a href="https://bitbucket.org/jaraco/irc">irc</a> package), but therefore allows to be run on any logfiles that produce similar output to those created by <a href="http://www.xchat.org/">XChat</a>. Of course, this includes logs from Jabber, SILC or any other communication (but it might require some minor changes to the log reader).
es: En realidad, es un clon conceptual del <a href="http://www.jibble.org/piespy/">PieSpy</a> Social Network Bot. Sin embargo, Chat Relater no act&uacute;a como un bot de IRC (aunque esto podr&iacute;a lograrse f&aacute;cilmente haciendo uso del paquete <a href="https://bitbucket.org/jaraco/irc">irc</a> ), pero por lo tanto permite que se ejecute en cualquier archivo de registro que produzca una salida similar a la creada por <a href="http://www.xchat.org/">XChat</a> . Por supuesto, esto incluye registros de Jabber, SILC o cualquier otra comunicaci&oacute;n (pero puede requerir algunos cambios menores en el lector de registros).
ja: 実際には、<a href="http://www.jibble.org/piespy/">PieSpy</a>ソーシャルネットワークボットの概念的なクローンです。ただし、Chat RelaterはIRCボットとしては機能しません（ただし、これは<a href="https://bitbucket.org/jaraco/irc">irc</a>パッケージを使用することで簡単に実行できます）。したがって、<a href="http://www.xchat.org/">XChat</a>によって作成されたものと同様の出力を生成する任意のログファイルで実行できます。もちろん、これにはJabber、SILC、またはその他の通信からのログが含まれます（ただし、ログリーダーに若干の変更が必要になる場合があります）。
ko: 실제로는 <a href="http://www.jibble.org/piespy/">PieSpy</a> 소셜 네트워크 봇 의 개념적 복제품입니다 . 그러나 Chat Relater는 IRC 봇 역할을하지 않지만 ( <a href="https://bitbucket.org/jaraco/irc">irc</a> 패키지 를 사용하여 쉽게 수행 할 수 있지만 ) <a href="http://www.xchat.org/">XChat에서</a> 생성 한 것과 유사한 출력을 생성하는 모든 로그 파일에서 실행할 수 있습니다 . 물론 여기에는 Jabber, SILC 또는 기타 통신의 로그가 포함됩니다 (하지만 로그 판독기에 약간의 변경이 필요할 수 있음).
ru: На самом деле это концептуальный клон <a href="http://www.jibble.org/piespy/">бота</a> социальной сети PieSpy . Однако Chat Relater не действует как IRC-бот (хотя это можно легко сделать, используя пакет <a href="https://bitbucket.org/jaraco/irc">irc</a> ), но, следовательно, позволяет запускать любые файлы журналов, которые производят выходные данные, аналогичные тем, которые создаются <a href="http://www.xchat.org/">XChat</a> . Конечно, это включает журналы из Jabber, SILC или любой другой связи (но для этого могут потребоваться небольшие изменения в программе чтения журналов).
zh_cn: 它实际上是<a href="http://www.jibble.org/piespy/">PieSpy</a>社交网络Bot 的概念克隆。但是，Chat Relater不能充当IRC机器人（尽管可以通过使用<a href="https://bitbucket.org/jaraco/irc">irc</a>包轻松完成此操作），但是可以在任何与<a href="http://www.xchat.org/">XChat</a>创建的输出类似的日志文件上运行。当然，这包括来自Jabber，SILC或任何其他通讯的日志（但可能需要对日志读取器进行一些细微更改）。

source: License:
es: Licencia:
ja: ライセンス。
ko: 특허:
ru: Лицензия:
zh_cn: 许可证:

source: MIT, see LICENSE for details.
es: MIT,ver LICENCIA para más detalles.
ja: MIT、詳細はLICENSEをご覧ください。
ko: MIT, 자세한 내용은 LICENSE를 참조하십시오.
ru: Массачусетский технологический институт,подробности см.в ЛИЦЕНЗИИ.
zh_cn: 麻省理工学院,详见LICENSE。

source: Requirements
es: Requisitos
ja: 必要条件
ko: 요구 사항
ru: Требования
zh_cn: 所需经费

source: Run the analyzer on one or more log files, saving the intermediate results to another file (
es: Ejecute el analizador en uno o más archivos de registro,guardando los resultados intermedios en otro archivo (
ja: 1つ以上のログファイルで解析を実行し、中間結果を別のファイルに保存します(
ko: 하나 이상의 로그 파일에서 분석기를 실행하여 중간 결과를 다른 파일 (
ru: Запустить анализатор на одном или нескольких лог-файлах,сохранив промежуточные результаты в другом файле (
zh_cn: 在一个或多个日志文件上运行分析器,将中间结果保存到另一个文件中(

source: Tests
es: Pruebas
ja: テスト
ko: 테스트
ru: Тесты
zh_cn: 测试

source: The <a href="http://www.graphviz.org/">GraphViz</a> usage is pretty basic and output may be improved somehow, but so far, the graphs created by <a href="http://www.jibble.org/piespy/">PieSpy</a> look <strong>much</strong> nicer.
es: El uso de <a href="http://www.graphviz.org/">GraphViz</a> es bastante b&aacute;sico y la salida puede mejorarse de alguna manera, pero hasta ahora, los gr&aacute;ficos creados por <a href="http://www.jibble.org/piespy/">PieSpy se</a> ven <strong>mucho</strong> mejor.
ja: <a href="http://www.graphviz.org/">GraphVizをの</a>使用量はかなり基本的で、出力は何とか改善することができるが、これまでのところ、によって作成されたグラフ<a href="http://www.jibble.org/piespy/">PieSpyが</a>見える<strong>くらい</strong>に良くします。
ko: <a href="http://www.graphviz.org/">graphviz를의</a> 사용은 아주 기본적인이며, 출력은 어떻게 든 개선 될 수 있지만, 지금까지 만든 그래프 <a href="http://www.jibble.org/piespy/">PieSpy가</a> 보면 <strong>훨씬</strong> 더 좋은합니다.
ru: Использование <a href="http://www.graphviz.org/">GraphViz</a> довольно простое, и вывод можно как-то улучшить, но пока графики, созданные <a href="http://www.jibble.org/piespy/">PieSpy,</a> выглядят <strong>намного</strong> лучше.
zh_cn: 该<a href="http://www.graphviz.org/">GraphViz的</a>使用是非常基本的和输出，可以在某种程度上改善，但到目前为止，通过创建图表<a href="http://www.jibble.org/piespy/">PieSpy</a>看<strong>多</strong>漂亮。

source: The analyzer extracts user relations from chat logs. The gained data is serialized as JSON.
es: El analizador extrae las relaciones de usuario de los registros de chat.Los datos obtenidos se serializan como JSON.
ja: アナライザーは、チャットログからユーザ関係を抽出します。得られたデータはJSONとしてシリアライズされます。
ko: 분석기는 채팅 로그에서 사용자 관계를 추출합니다. 얻은 데이터는 JSON으로 직렬화됩니다.
ru: Анализатор извлекает отношения пользователей из логов чата.Полученные данные сериализуются как JSON.
zh_cn: 分析器从聊天记录中提取用户关系。获得的数据被序列化为JSON格式。

source: The required Python packages can be installed via pip:
es: Los paquetes de Python requeridos pueden ser instalados vía pip:
ja: 必要なPythonパッケージはpip経由でインストールできます。
ko: 필요한 Python 패키지는 pip를 통해 설치할 수 있습니다.
ru: Необходимые пакеты Python могут быть установлены по трубопроводу:
zh_cn: 所需的Python包可以通过pip安装。

source: The visualizer takes that data, generates a <a href="http://www.graphviz.org/doc/info/lang.html">DOT</a> file, and calls the <a href="http://www.graphviz.org/">GraphViz</a> application to render the graph in the requested output format (e. g. PDF, PNG, SVG).
es: El visualizador toma esos datos, genera un archivo <a href="http://www.graphviz.org/doc/info/lang.html">DOT</a> y llama a la aplicaci&oacute;n <a href="http://www.graphviz.org/">GraphViz</a> para representar el gr&aacute;fico en el formato de salida solicitado (por ejemplo, PDF, PNG, SVG).
ja: ビジュアライザーはそのデータを受け取り、<a href="http://www.graphviz.org/doc/info/lang.html">DOT</a>ファイルを生成し、<a href="http://www.graphviz.org/">GraphViz</a>アプリケーションを呼び出して 、要求された出力形式（PDF、PNG、SVGなど）でグラフをレンダリングします。
ko: 시각화 도우미는 해당 데이터를 가져와 <a href="http://www.graphviz.org/doc/info/lang.html">DOT</a> 파일을 생성 하고 <a href="http://www.graphviz.org/">GraphViz</a> 응용 프로그램을 호출 하여 요청 된 출력 형식 (예 : PDF, PNG, SVG)으로 그래프를 렌더링합니다.
ru: Визуализатор берет эти данные, генерирует файл <a href="http://www.graphviz.org/doc/info/lang.html">DOT</a> и вызывает приложение <a href="http://www.graphviz.org/">GraphViz</a> для визуализации графика в запрошенном формате вывода (например, PDF, PNG, SVG).
zh_cn: 可视化工具获取该数据，生成一个<a href="http://www.graphviz.org/doc/info/lang.html">DOT</a>文件，然后调用 <a href="http://www.graphviz.org/">GraphViz</a>应用程序以请求的输出格式（例如PDF，PNG，SVG）呈现图形。

source: To run tests, install the dependencies once, then run tests with tox:
es: Para hacer pruebas,instalar las dependencias una vez,y luego hacer pruebas con tóxicos:
ja: テストを実行するには、依存関係を一度インストールしてから tox でテストを実行します。
ko: 테스트를 실행하려면 종속성을 한 번 설치 한 다음 tox로 테스트를 실행하세요.
ru: Чтобы запустить тесты,установите зависимости один раз,затем запустите тесты с токсинами:
zh_cn: 要运行测试,先安装一次依赖项,然后用 tox 运行测试。

source: Usage
es: Uso
ja: 使用方法
ko: 용법
ru: Использование
zh_cn: 使用方法

source: Version:
es: Versión:
ja: バージョンは?
ko: 버전:
ru: Версия:
zh_cn: 版本:

source: chat.json
ru: чат.джсон
zh_cn: 聊天.json

source: graph
es: gráfico
ja: グラフ
ko: 그래프
ru: диаграмма
zh_cn: 图形

source: graph.png
ja: グラフ・png
ru: график.пнг
zh_cn: 图形.png
