Repository: Yuniorcr/runebook
Catalog: xlf/packages/*/python/commonenvironment-formatter.001.xlf
Languages: es, ja, zh_cn

source: Aligns assignments within a block
es: Alinea las asignaciones dentro de un bloque
ja: ブロック内でのアサインメントの調整
zh_cn: 在一个区块内对齐作业

source: Aligns trailing comments within a block
es: Alinea los comentarios de seguimiento dentro de un bloque
ja: ブロック内の末尾のコメントを整列させる
zh_cn: 排列块内的尾部注释

source: Ensures that all line-delimited parameters and arguments include a trailing comma
es: Asegura que todos los parámetros y argumentos delimitados por líneas incluyan una coma final
ja: すべての行で区切られたパラメータと引数に最後のカンマが含まれていることを保証します。
zh_cn: 确保所有的限行参数和参数都包含一个尾部的逗号。

source: Ensures that all logical clauses are line-delimited in any are
es: Asegura que todas las cláusulas lógicas están delimitadas por líneas en cualquier
ja: すべての論理的な節が行で区切られていることを保証します。
zh_cn: 确保在任何are中,所有逻辑子句都是以行为界的。

source: Fine-grained control over line splitting for:
es: Control fino sobre la división de líneas para:
ja: 線の分割をきめ細かく制御します。
zh_cn: 细致地控制分线,以便:

source: Fixes inconsistencies with textwrap.dedent and multiline strings
es: Arregla las inconsistencias con textwrap.dedent y cadenas multilínea
ja: textwrap.dedentと複数行文字列の不整合を修正
zh_cn: 修正了 textwrap.dedent 和多行字符串的不一致之处。

source: Formats Python code using Black (<a href="https://github.com/ambv/black">https://github.com/ambv/black</a>) plus enhancements:
es: Formatea el c&oacute;digo Python usando Black ( <a href="https://github.com/ambv/black">https://github.com/ambv/black</a> ) m&aacute;s mejoras:
ja: Black（<a href="https://github.com/ambv/black">https://github.com/ambv/black</a>）と拡張機能を使用してPythonコードをフォーマットします。
zh_cn: 使用Black（<a href="https://github.com/ambv/black">https://github.com/ambv/black</a>）加上增强功能来格式化Python代码：

source: Formats Python code using Black (https://github.com/ambv/black) plus enhancements.
es: Formatea el código Python usando Black (https://github.com/ambv/black)más las mejoras.
ja: Black (https://github.com/ambv/black)を使って Python のコードをフォーマットし、機能強化を行います。
zh_cn: 使用Black (https://github.com/ambv/black)加上增强功能对Python代码进行格式化。

source: Reverts splits for empty parens
es: Invierte las divisiones por parentescos vacíos...
ja: 空のパレンの分割を反転します。
zh_cn: 将空的parens的分割还原

source: arguments
es: argumentos
ja: 議論

source: dict items
es: Dictados...
ja: じょじゅつこうもく
zh_cn: 口述项目

source: list items
es: lista de elementos
ja: リスト項目
zh_cn: 列表项

source: parameters
es: parámetros
ja: パラメーター
zh_cn: 参数

source: tuple items
es: artículos de la tupla
ja: タプル項目
zh_cn: 元组项目
