Repository: Yuniorcr/runebook
Catalog: xlf/packages/*/python/comuneimola-compensi.001.xlf
Languages: es, ja, ru, zh_cn

source: &ldquo;Manager&rdquo; and &ldquo;Site Administrator&rdquo; can do everything, but still they should be used just in cases when only a superuser can solve a specific situation. Only these two roles can perform actions to delete, rename, cut and paste &ldquo;fees&rdquo;.
es: &ldquo;Manager&rdquo; y &ldquo;Site Administrator&rdquo; pueden hacer todo, pero aun as&iacute; deben usarse solo en los casos en que solo un superusuario puede resolver una situaci&oacute;n espec&iacute;fica. Solo estos dos roles pueden realizar acciones para eliminar, renombrar, cortar y pegar "tarifas".
ja: 「マネージャー」と「サイト管理者」はすべてを行うことができますが、スーパーユーザーだけが特定の状況を解決できる場合にのみ使用する必要があります。「料金」を削除、名前変更、切り取り、貼り付けするアクションを実行できるのは、これら2つの役割のみです。
ru: &laquo;Менеджер&raquo; и &laquo;Администратор сайта&raquo; могут все, но все же их следует использовать только в тех случаях, когда только суперпользователь может решить конкретную ситуацию. Только эти две роли могут выполнять действия по удалению, переименованию, вырезанию и вставке &laquo;сборов&raquo;.
zh_cn: &ldquo;管理员&rdquo;和&ldquo;站点管理员&rdquo;可以做所有事情，但是仍然只有在超级用户可以解决特定情况的情况下才应使用它们。只有这两个角色才能执行删除，重命名，剪切和粘贴&ldquo;费用&rdquo;的操作。

source: A Reviewer:
es: Un revisor:
ja: レビュアーです。
ru: Рецензент:
zh_cn: 一位评审员。

source: A button allows you to download the contents of the table / folder in csv format.
es: Un botón permite descargar el contenido de la tabla/carpeta en formato csv.
ja: ボタンをクリックすると、テーブル/フォルダの内容をcsv形式でダウンロードすることができます。
ru: Кнопка позволяет загрузить содержимое таблицы/папки в формате csv.
zh_cn: 一个按钮可以让你以csv格式下载表格/文件夹的内容。

source: A manager must create the area. We suggest to add collection portlets to the area, to find private fees and the fees to be reviewed, for the convenience of authenticated users.
es: Un gerente debe crear el área.Sugerimos añadir a la zona portletas de colección,para encontrar las tarifas privadas y las tarifas a revisar,para la conveniencia de los usuarios autentificados.
ja: 管理者がエリアを作成する必要があります。認証されたユーザーの利便性を考慮して、エリアにコレクションポートレットを追加して、プライベートな料金や審査対象となる料金を探すことを提案します。
ru: Менеджер должен создать зону.Для удобства аутентифицированных пользователей мы предлагаем добавить в зону портлеты коллекции,найти частные сборы и сборы,подлежащие пересмотру.
zh_cn: 必须有管理员创建该区域。建议在专区中增加收款端口,查找私费和待审核的费用,方便认证用户。

source: Add AT Area Compenso (&ldquo;Fees area&rdquo;) and his view [lucabel]
es: Agregue AT Area Compenso ("&Aacute;rea de tarifas") y su vista [lucabel]
ja: AT Area Compenso（「料金エリア」）と彼の見解を追加[lucabel]
ru: Добавьте AT Area Compenso (&laquo;Зона сборов&raquo;) и его мнение [lucabel]
zh_cn: 添加AT Area Compenso（&ldquo;费用区域&rdquo;）及其观点[lucabel]

source: Add AT Compenso (&ldquo;Fee&rdquo; type ) and his view [mirco]
es: Agregue AT Compenso (tipo "Tarifa") y su vista [mirco]
ja: ATコンペンソ（「料金」タイプ）と彼の見解を追加[mirco]
ru: Добавьте AT Compenso (тип &laquo;Fee&raquo;) и его мнение [mirco]
zh_cn: 添加AT Compenso（&ldquo;费用&rdquo;类型）和他的观点[mirco]

source: Add Custom Workflow for ATCompenso (&ldquo;Fee type&rdquo;) [lucabel&amp;mirco]
es: Agregar flujo de trabajo personalizado para ATCompenso ("Tipo de tarifa") [lucabel &amp; mirco]
ja: ATCompensoのカスタムワークフローを追加（「料金タイプ」）[lucabel＆mirco]
ru: Добавить собственный рабочий процесс для ATCompenso (&laquo;Тип комиссии&raquo;) [lucabel &amp; mirco]
zh_cn: 为ATCompenso添加自定义工作流（&ldquo;费用类型&rdquo;）[lucabel＆mirco]

source: Add backward compatibility with Plone 3.3.5 [lucabel]
es: Añade compatibilidad con Plone 3.3.5 [lucabel]
ja: Plone 3.3.3.5との下位互換性の追加 [lucabel]
ru: Добавьте обратную совместимость с Plone 3.3.5 [lucabel].
zh_cn: 增加与Plone 3.3.5的后向兼容性[lucabel]

source: Add csv export [lucabel]
es: Añadir csv export [lucabel]
ja: csvエクスポート[lucabel]を追加
ru: Добавить экспорт csv [lucabel]
zh_cn: 添加csv导出[lucabel]。

source: Add fields &lsquo;amount_type&rsquo; [lucabel]
es: Agregar campos 'amount_type' [lucabel]
ja: フィールド「amount_type」を追加する[lucabel]
ru: Добавьте поля "amount_type" [lucabel]
zh_cn: 添加字段&ldquo; amount_type&rdquo; [lucabel]

source: Add italian translation [mirco&amp;lucabel]
es: Agregar traducci&oacute;n al italiano [mirco &amp; lucabel]
ja: イタリア語の翻訳を追加する[mirco＆lucabel]
ru: Добавить итальянский перевод [mirco &amp; lucabel]
zh_cn: 添加意大利语翻译[mirco＆lucabel]

source: Add new fields to the csv export [lucabel]
es: Añadir nuevos campos a la exportación de csv [lucabel]
ja: csvエクスポート[lucabel]に新しいフィールドを追加します。
ru: Добавьте новые поля в csv экспорт [lucabel].
zh_cn: 为csv导出添加新字段[lucabel]。

source: Add validator for the fields norm/other_norm [lucabel]
es: Añadir validador para los campos norma/otra_norma [lucabel]
ja: norm/other_norm [lucabel]フィールドのバリデータを追加する
ru: Добавить валидатор для полей norm/other_norm [lucabel].
zh_cn: 为字段norm/other_norm[lucabel]添加验证器。

source: Add validator to amount field [lucabel]
es: Añadir validador al campo de cantidad [lucabel]
ja: 金額フィールド[lucabel]にバリデータを追加します。
ru: Добавьте валидатор к числовому полю [lucabel].
zh_cn: 在金额字段添加验证器[lucabel]

source: Allow to &ldquo;Fee&rdquo; owner to publish his &ldquo;Fees&rdquo; [lucabel]
es: Permitir que el propietario de la "tarifa" publique sus "tarifas" [lucabel]
ja: 「料金」の所有者が自分の「料金」を公開することを許可する[lucabel]
ru: Разрешить владельцу &laquo;Гонорара&raquo; опубликовать его &laquo;Сборы&raquo; [lucabel]
zh_cn: 允许&ldquo;费用&rdquo;所有者发布其&ldquo;费用&rdquo; [lucabel]

source: As for the workflow of &ldquo;Fee&rdquo; objects, for now we decided to stay as close as possible to the simple publication wf of Plone.
es: En cuanto al flujo de trabajo de los objetos &ldquo;Fee&rdquo;, por ahora decidimos mantenernos lo m&aacute;s cerca posible de la simple publicaci&oacute;n wf de Plone.
ja: 「Fee」オブジェクトのワークフローについては、今のところ、Ploneのシンプルなパブリケーションwfにできるだけ近づけることに決めました。
ru: Что касается работы с объектами &laquo;Fee&raquo;, то пока мы решили максимально приблизиться к простой публикации wf Plone.
zh_cn: 至于&ldquo; Fee&rdquo;对象的工作流程，目前，我们决定尽可能靠近Plone的简单出版物wf。

source: Authors
es: Autores
ja: 著者
ru: Авторы
zh_cn: 作者

source: Bugfix into the MoneyFormat class to permit of insert zero value into the amount field (issue#3) [mircoangelini]
es: Corrección de errores en la clase MoneyFormat para permitir la inserción de un valor cero en el campo de cantidad (issue#3)[mircoangelini]
ja: MoneyFormatクラスで金額フィールドにゼロ値を挿入できるように修正 (issue#3)[mircoangelini]
ru: Исправлена ошибка в классе MoneyFormat,позволяющая вставить нулевое значение в поле суммы (эмиссия#3)[mircoangelini].
zh_cn: 修正MoneyFormat类的错误,允许在金额字段中插入零值(issue#3)[mircoangelini]。

source: Change the manifest to include README.rst in the released egg [lucabel]
es: Cambiar el manifiesto para incluir README.rst en el huevo liberado [lucabel]
ja: マニフェストを変更して、リリースされたegg [lucabel]にREADME.rstを含めるようにしました。
ru: Измените манифест,чтобы включить README.rst в освобожденное яйцо [lucabel].
zh_cn: 修改清单,在发布的彩蛋中加入README.rest[lucabel]。

source: Changelog
ja: 変更履歴
ru: Блог изменений
zh_cn: 变更日志

source: Compatibility
es: Compatibilidad
ja: 互換性
ru: Совместимость
zh_cn: 兼容性

source: Credits
es: Créditos
ja: クレジット
ru: Кредиты
zh_cn: 学分

source: Description field visible again [micmord]
es: Campo de descripción visible de nuevo [micmord]
ja: 説明フィールドが再び表示される [micmord]
ru: Поле описания снова видно [micmord].
zh_cn: 说明栏再次可见[micmord]

source: Developed by the <a href="http://www.comune.imola.bo.it/">City of Imola</a>
es: Desarrollado por la <a href="http://www.comune.imola.bo.it/">Ciudad de Imola</a>
ja: <a href="http://www.comune.imola.bo.it/">イモラ市</a>によって開発されました
ru: Разработано в <a href="http://www.comune.imola.bo.it/">городе Имола</a>
zh_cn: 由<a href="http://www.comune.imola.bo.it/">伊莫拉市</a>开发

source: Fees management for the town of Imola - Under Italian Law, the institutional websites of the cities shall contain a detailed list of the amounts of all the contracts (herein we will use the term "fees") drawn up with external professionals. This product implements Plone with two new custom archetypes, "Fees Area" and "Fee".
es: Gestión de los honorarios para la ciudad de Imola-Según la ley italiana,los sitios web institucionales de las ciudades contendrán una lista detallada de los importes de todos los contratos (en este caso utilizaremos el término "honorarios")elaborados con profesionales externos.Este producto implementa Plone con dos nuevos arquetipos personalizados,"Área de Honorarios" y "Honorarios".
ja: イモラ市の料金管理-イタリアの法律では、市の機関のウェブサイトには、外部の専門家との契約(ここでは「料金」という用語を使用します)の金額の詳細なリストを掲載しなければなりません。この製品はPloneを実装したもので、「料金エリア」と「料金」という2つの新しいカスタムタイプを持っています。
ru: Управление гонорарами для города Имола-В соответствии с итальянским законодательством,институциональные сайты городов должны содержать подробный список сумм всех контрактов (здесь мы будем использовать термин "гонорары"),составленный с внешними профессионалами.Этот продукт реализует Plone с двумя новыми индивидуальными архетипами,"Fees Area" и "Fee".
zh_cn: 伊莫拉镇的费用管理--根据意大利法律,各城市的机构网站应包含与外部专业人员签订的所有合同(这里我们将使用 "费用 "一词)的详细金额清单。本产品实现了Plone的两个新的自定义原型,"费用区域 "和 "费用"。

source: Fiscal data: required, searchable and visible [micmord]
es: Datos fiscales:requeridos,buscables y visibles [micmord].
ja: 財政データ:必須・検索可能・見える化 [micmord]
ru: Фискальные данные:обязательные,с возможностью поиска и видимые [micmord].
zh_cn: 财政数据:必要的、可查询的和可见的[micmord]

source: Fix wrong label in atcompenso [lucabel]
es: Arreglar la etiqueta equivocada en atcompenso [lucabel]
ja: atcompenso [lucabel]の間違ったラベルを修正
ru: Исправьте неправильную этикетку в atcompenso [lucabel].
zh_cn: 修正atcompenso [lucabel]中的错误标签。

source: Hide &ldquo;Fee&rdquo; in the NavTree [micmord]
es: Ocultar "Tarifa" en el &aacute;rbol de navegaci&oacute;n [micmord]
ja: NavTreeで「料金」を非表示にする[micmord]
ru: Скрыть &laquo;Плату&raquo; в NavTree [micmord]
zh_cn: 在NavTree中隐藏&ldquo;费用&rdquo; [micmord]

source: Hide effectiveDate and expirationDate in the edit form [lucabel]
es: Ocultar effectiveDate y expirationDate en el formulario de edición [lucabel]
ja: 編集フォーム[lucabel]で有効期限と有効期限を非表示にする
ru: Скрыть effectiveDate и expirationDate в форме редактирования [lucabel].
zh_cn: 在编辑表格中隐藏effectiveDate和experationDate[lucabel]。

source: If you are installing the product for use with versions prior to plone 4, the version of collective.js.datatables in the buildout must be set to 1.9.
es: Si está instalando el producto para su uso con versiones anteriores al plone 4,la versión de las tablas de datos collective.js.datatables en el buildout debe establecerse en 1.9.
ja: plone 4以前のバージョンで使用するためにインストールする場合は、ビルドアウトのcollective.js.datatablesのバージョンを1.9に設定する必要があります。
ru: Если вы устанавливаете продукт для использования с версиями до plone 4,версия collective.js.datatables в сборке должна быть установлена на 1.9.
zh_cn: 如果你是为了使用plone 4之前的版本而安装产品,那么buildout中collective.js.datatables的版本必须设置为1.9。

source: Initial release
es: Lanzamiento inicial
ja: 初回リリース
ru: Первичный выпуск
zh_cn: 初次发布

source: Installation Notes
es: Notas de instalación
ja: インストールの注意事項
ru: Примечания по установке
zh_cn: 安装说明

source: Note field length by 400 character useful for Art.190/2012 [micmord]
es: Note la longitud del campo por 400 caracteres útil para el Art.190/2012 [micmord]
ja: Art.190/2012[micmord]で便利な400文字単位のフィールド長の注記
ru: Обратите внимание на длину поля 400 символов,полезного для ст.190/2012 [micmord].
zh_cn: 注:字段长度为400字,对Art.190/2012[micmord]有用。

source: Once the product is installed you can add &ldquo;Fees Area&rdquo; objects. Inside these objects, you can add &ldquo;Fees&rdquo; objects.
es: Una vez que el producto est&aacute; instalado, puede agregar objetos de "&Aacute;rea de tarifas". Dentro de estos objetos, puede agregar objetos "Tarifas".
ja: 製品がインストールされたら、「料金エリア」オブジェクトを追加できます。これらのオブジェクト内に、「料金」オブジェクトを追加できます。
ru: После установки продукта вы можете добавить объекты &laquo;Зона сборов&raquo;. Внутри этих объектов вы можете добавлять объекты &laquo;Сборы&raquo;.
zh_cn: 安装产品后，您可以添加&ldquo;费用区域&rdquo;对象。在这些对象内，您可以添加&ldquo;费用&rdquo;对象。

source: Operation
es: Operación
ja: 操作
ru: Операция
zh_cn: 运作

source: Plone 3.3.5
ru: Игровой автомат 3.3.5

source: Plone 4.2.1
ru: Игровой автомат 4.2.1

source: README.rst translation.
es: Léeme.Primera traducción.
ja: README.rstの翻訳です。
ru: README.rst перевод.
zh_cn: README.rst翻译。

source: Some modification to the &ldquo;Fee view&rdquo; [lucabel]
es: Alguna modificaci&oacute;n en la "Vista de tarifas" [lucabel]
ja: 「料金ビュー」のいくつかの変更[lucabel]
ru: Некоторая модификация &laquo;Плата за просмотр&raquo; [lucabel]
zh_cn: 对&ldquo;费用视图&rdquo;的一些修改[lucabel]

source: Tests have been made with:
es: Se han hecho pruebas con:
ja: テストは行われています。
ru: Тесты были сделаны с:
zh_cn: 已对以下方面进行了测试:

source: The City of Imola supports the <a href="http://www.plonegov.it/">PloneGov initiative</a>.
es: La ciudad de Imola apoya la <a href="http://www.plonegov.it/">iniciativa PloneGov</a> .
ja: イモラ市は<a href="http://www.plonegov.it/">PloneGovイニシアチブを</a>サポートしています。
ru: Город Имола поддерживает <a href="http://www.plonegov.it/">инициативу PloneGov</a> .
zh_cn: 伊莫拉市支持<a href="http://www.plonegov.it/">PloneGov倡议</a>。

source: The Editor role given by sharing, takes the form of a proxy to work on the &ldquo;fee&rdquo; object.
es: El rol de editor otorgado por compartir, toma la forma de un proxy para trabajar en el objeto de "tarifa".
ja: 共有によって与えられる編集者の役割は、「手数料」オブジェクトを処理するプロキシの形式をとります。
ru: Роль редактора, предоставляемая путем совместного использования, принимает форму прокси для работы с объектом &laquo;плата&raquo;.
zh_cn: 共享赋予的编辑者角色采用代理的形式来处理&ldquo;费用&rdquo;对象。

source: The display area is set to use a view based on collective.js.datatables.
es: La zona de visualización está configurada para utilizar una vista basada en las tablas de datos collective.js.
ja: 表示領域はcollective.js.datatablesをベースにしたビューを使用するように設定されています。
ru: Область отображения настроена на использование представления на основе данных collective.js.datatables.
zh_cn: 显示区域设置为使用基于collective.js.datatables的视图。

source: The product was developed by
es: El producto fue desarrollado por
ja: によって開発されました。
ru: Продукт разработан
zh_cn: 该产品是由

source: The publisher of the document (Contributor role)
es: El editor del documento (Función de colaborador)
ja: ドキュメントの発行者(投稿者の役割
ru: Издатель документа (Роль Соавтора)
zh_cn: 文件的出版者(贡献者角色)

source: The translation feature of the table, missing in collective.js.datatables 1.9 has been put in the package and under the condition Plone &lt; 4.
es: La funci&oacute;n de traducci&oacute;n de la tabla, que falta en Collective.js.datatables 1.9, se ha incluido en el paquete y bajo la condici&oacute;n Plone &lt;4.
ja: collective.js.datatables 1.9にはないテーブルの変換機能がパッケージに入れられ、Plone &lt;4の条件で使用されました。
ru: Функция перевода таблицы, отсутствующая в Collective.js.datatables 1.9, была помещена в пакет и при условии Plone &lt;4.
zh_cn: 该表的转换功能（在Collective.js.datatables 1.9中缺少）已放入包中，并且条件为Plone &lt;4。

source: To apply workflow actions (such as sending in revision and publication, back, etc..) to &ldquo;fee&rdquo; objects and its &ldquo;Link&rdquo; attachments (the &ldquo;File&rdquo; does not have any workflow, are public but follow the workflow of their container), you must use the &ldquo;Advanced &hellip;&rdquo; function from the &ldquo;state&rdquo; menu.
es: Para aplicar acciones de flujo de trabajo (como enviar revisi&oacute;n y publicaci&oacute;n, retroceso, etc.) a objetos de "tarifa" y sus archivos adjuntos de "Enlace" (el "Archivo" no tiene ning&uacute;n flujo de trabajo, son p&uacute;blicos pero siguen el flujo de trabajo de su contenedor ), debe utilizar la funci&oacute;n "Avanzado ..." del men&uacute; "Estado".
ja: ワークフローアクション（リビジョンやパブリケーションの送信、戻るなど）を「fee」オブジェクトとその「Link」添付ファイルに適用するには（「File」にはワークフローがなく、パブリックですが、コンテナーのワークフローに従います）、「状態」メニューから「詳細&hellip;」機能を使用する必要があります。
ru: Для применения действий рабочего процесса (таких как отправка в редакцию и публикацию, возврат и т. Д.) К объектам &laquo;плата&raquo; и его вложениям &laquo;Ссылка&raquo; (&laquo;Файл&raquo; не имеет рабочего процесса, является общедоступным, но следует рабочему процессу своего контейнера ), вы должны использовать функцию &laquo;Дополнительно&hellip;&raquo; из меню &laquo;Состояние&raquo;.
zh_cn: 要将工作流程操作（例如，发送修订和发布，后退等）应用于&ldquo;费用&rdquo;对象及其&ldquo;链接&rdquo;附件（&ldquo;文件&rdquo;没有任何工作流程，是公开的，但遵循其容器的工作流程），则必须使用&ldquo;状态&rdquo;菜单中的&ldquo;高级&hellip;&rdquo;功能。

source: Workflow
es: Flujo de trabajo
ja: ワークフロー
ru: Рабочий процесс
zh_cn: 工作流程

source: can add an entry
es: puede añadir una entrada
ja: エントリを追加することができます。
ru: может добавить запись
zh_cn: 可以添加条目

source: can add one or more links / attachments
es: puede añadir uno o más enlaces/adjuntos
ja: 1つ以上のリンク/添付ファイルを追加することができます。
ru: может добавлять одну или несколько ссылок/вложений
zh_cn: 可以添加一个或多个链接/附件

source: can no longer revoke the publication
es: ya no puede revocar la publicación
ja: 出版を取り消すことはできません。
ru: больше не может отменять публикацию
zh_cn: 不能再刊登

source: can not add / remove links / attachments.
es: no puede añadir/eliminar enlaces/adjuntos.
ja: リンク/添付ファイルの追加/削除ができません。
ru: не может добавлять/удалять ссылки/вложения.
zh_cn: 不能添加/删除链接/附件。

source: can not change private items belonging to other publishers
es: no puede cambiar los artículos privados que pertenecen a otros editores
ja: 他のパブリッシャーのプライベートアイテムを変更することはできません。
ru: не может изменять личные вещи,принадлежащие другим издателям.
zh_cn: 不能更改属于其他出版商的私人物品。

source: can publish directly
es: puede publicar directamente
ja: 直接発行することができます
ru: может публиковаться непосредственно
zh_cn: 可以直接发布

source: change on &ldquo;fee&rdquo; details;
es: cambio en los detalles de la "tarifa";
ja: 「料金」の詳細の変更。
ru: изменение реквизитов &laquo;комиссии&raquo;;
zh_cn: 更改&ldquo;费用&rdquo;详细信息；

source: change on &ldquo;fees area&rdquo;;
es: cambio en &ldquo;&aacute;rea de tarifas&rdquo;;
ja: 「料金エリア」の変更。
ru: изменение &laquo;зоны комиссий&raquo;;
zh_cn: 改变&ldquo;收费区&rdquo;；

source: change the javascript to sort with new visualization;
es: cambiar el javascript para ordenar con la nueva visualización;
ja: 新しい可視化でソートするjavascriptを変更しました。
ru: изменить javascript для сортировки с новой визуализацией;
zh_cn: 修改javascript,用新的可视化方式进行排序。

source: change view for the amount of the fee: [lucabel]
es: cambiar la vista por el importe de la tasa:[Lucabel]
ja: 料金の金額に応じてビューを変更します。ルーカベル]で
ru: изменить представление о размере платы:[люкейбл]
zh_cn: 变更视图的费用金额。[lucabel]

source: comuneimola.compensi
es: comuneimola.remuneraciones
ja: comuneimola.remunerations
ru: вознаграждения comuneimola.comuneimola.pays
zh_cn: Comuneimola.薪酬

source: may require the publication to any reviewer
es: puede exigir la publicación a cualquier revisor
ja: は、任意の査読者への公開を要求することができる。
ru: может потребовать публикацию для любого рецензента
zh_cn: 可要求向任何审查人公布

source: may withdraw an item published to correct the data entered, or modify them limited to those data not affecting the effectiveness of the contract.
es: podrá retirar un artículo publicado para corregir los datos introducidos,o modificarlos limitándose a los datos que no afecten a la eficacia del contrato.
ja: 契約の有効性に影響を与えないデータに限定して、入力されたデータを修正するために掲載された項目を撤回し、または修正することができるものとします。
ru: может отозвать пункт,опубликованный с целью исправления введенных данных,или изменить их,ограничившись теми данными,которые не влияют на действительность договора.
zh_cn: 可撤回已发布的项目,以更正输入的数据,或对其进行修改,但仅限于不影响合同效力的数据。

source: once published:
es: una vez publicado:
ja: 一度公表された
ru: после публикации:
zh_cn: 一经公布,。
