Repository: Yuniorcr/runebook
Catalog: xlf/packages/*/python/dammy.001.xlf
Languages: es, ja, ru, zh_cn

source: Ability to perform operations added
es: Se añade la capacidad de realizar operaciones
ja: 追加された操作を実行する能力
ru: Добавлена возможность выполнять операции
zh_cn: 能够进行附加的操作

source: Added UNIQUE constraint support
es: Añadido el soporte de restricciones ÚNICAS
ja: UNIQUE制約のサポートを追加
ru: Добавлена поддержка ограничений UNIQUE
zh_cn: 增加了UNIQUE约束支持

source: All binary operations made possible between BaseGenerator objects
es: Todas las operaciones binarias hechas posibles entre los objetos del BaseGenerador
ja: BaseGenerator オブジェクト間で可能なすべてのバイナリ操作
ru: Все двоичные операции между объектами BaseGenerator стали возможны.
zh_cn: 在BaseGenerator对象之间可以进行所有的二进制操作。

source: And the data can be exported to SQL
es: Y los datos pueden ser exportados a SQL
ja: そして、データはSQLにエクスポートすることができます
ru: И данные могут быть экспортированы на SQL
zh_cn: 而且数据可以导出到SQL

source: BaseDammy renamed to BaseGenerator
es: BaseDammy renombrada como BaseGenerador
ja: BaseDammyがBaseGeneratorにリネームされました。
ru: BaseDammy переименована в BaseGenerator
zh_cn: BaseDammy改名为BaseGenerator。

source: Can call methods on entities
es: Puede llamar a los métodos de las entidades
ja: エンティティのメソッドを呼び出すことができる
ru: Могут вызывать методы на сущностях
zh_cn: 可以调用实体的方法

source: Can get attributes of entities
es: Puede obtener atributos de las entidades
ja: エンティティの属性を取得できる
ru: Может получать атрибуты сущностей
zh_cn: 可以获得实体的属性

source: Code improved
es: Código mejorado
ja: コードの改良
ru: Улучшен код
zh_cn: 代码改进

source: Code refactored
es: Código refactorizado
ja: コードのリファクタリング
ru: Переработанный код
zh_cn: 代码重构

source: Completely intuitive, you will learn to use it in less than 10 minutes
es: Completamente intuitivo,aprenderás a usarlo en menos de 10 minutos
ja: 完全に直感的に、10分以内に使いこなせるようになります。
ru: Полностью интуитивно понятный,вы научитесь пользоваться им менее чем за 10 минут.
zh_cn: 完全直观,您将在10分钟内学会使用它。

source: Compose more complex data easily (Full profiles, complete databases, )
es: Componer datos más complejos fácilmente (Perfiles completos,bases de datos completas,)
ja: より複雑なデータを簡単に作成することができます(完全なプロファイル、完全なデータベース、)。
ru: Легко составить более сложные данные (Полные профили,полные базы данных,)
zh_cn: 轻松组成更复杂的数据(完整的配置文件,完整的数据库,)。

source: DammyEntity renamed to EntityGenerator
es: DammyEntity renombrada como EntityGenerator
ja: DammyEntityがEntityGeneratorにリネームされました。
ru: DammyEntity переименована в EntityGenerator
zh_cn: DammyEntity更名为EntityGenerator。

source: DatasetGenerator moved from main to db
es: DatasetGenerator pasó de principal a db
ja: DatasetGeneratorをメインからdbに移動しました。
ru: DatasetGenerator перешел с основного на db
zh_cn: 将DatasetGenerator从main转移到db中。

source: Datasets can now be exported to JSON
es: Los conjuntos de datos pueden ahora ser exportados a JSON
ja: データセットをJSONにエクスポートできるようになりました。
ru: Теперь данные могут быть экспортированы в JSON.
zh_cn: 数据集现在可以导出为JSON格式

source: Docstrings added
es: Docstrings añadió
ja: ドクストリングスを追加しました。
ru: Добавлены строки
zh_cn: 增加的文件字符串

source: Documentation fixed
es: Documentación fija
ja: ドキュメントの修正
ru: Исправлена документация
zh_cn: 修正文件

source: Documentation improved
es: La documentación mejorada
ja: ドキュメンテーションの改善
ru: Улучшение документации
zh_cn: 改进文件编制工作

source: Entities can now be exported to JSON and CSV
es: Las entidades pueden ahora ser exportadas a JSON y CSV
ja: エンティティをJSONとCSVにエクスポートできるようになりました。
ru: Предприятия теперь могут экспортироваться в JSON и CSV.
zh_cn: 实体现在可以导出为JSON和CSV。

source: EntityGenerator renamed to OperationResult
es: EntidadGenerador renombrado a OperaciónResultado
ja: EntityGeneratorがOperationResultに名称変更されました。
ru: СтруктураГенератор переименована в ФГУП "ЭксплуатацияРезульт".
zh_cn: EntityGenerator更名为OperationResult。

source: Everything inherits from BaseGenerator
es: Todo se hereda del BaseGenerador
ja: すべてが BaseGenerator を継承しています。
ru: Всё унаследовано от BaseGenerator
zh_cn: 所有的东西都继承自BaseGenerator

source: Example
es: Ejemplo
ja: Exemple
ru: Пример
zh_cn: 例子

source: Export the generated data to SQL
es: Exportar los datos generados a SQL
ja: 生成されたデータをSQLにエクスポート
ru: Экспорт сгенерированных данных в SQL
zh_cn: 将生成的数据导出为SQL

source: Features
es: Características
ja: 特徴
ru: Особенности
zh_cn: 特点

source: First release
es: Primer lanzamiento
ja: 初めてのリリース
ru: Первый релиз
zh_cn: 首次发布

source: Fixed import bug in stdlib
es: Corregido el error de importación en stdlib
ja: stdlibのインポートのバグを修正
ru: Исправлена ошибка импорта в stdlib
zh_cn: 修正了stdlib中的导入错误

source: Generate anything within the set of prebuilt objects (Person names, country names, car manufacturers and models, random dates...)
es: Generar cualquier cosa dentro del conjunto de objetos preconstruidos (Nombres de personas,nombres de países,fabricantes y modelos de coches,fechas aleatorias...)
ja: 事前に構築されたオブジェクトのセット内の任意のものを生成します(人名、国名、自動車メーカーやモデル、ランダムな日付など)。
ru: Генерируйте все,что угодно в пределах набора готовых объектов (имена персонажей,названия стран,производителей и моделей автомобилей,случайные даты...).
zh_cn: 生成任何预制对象集内的东西(人名、国家名、汽车制造商和车型、随机日期......)。

source: Generate fake data for any purpose
es: Generar datos falsos para cualquier propósito
ru: Генерировать поддельные данные для любых целей
zh_cn: 为任何目的生成虚假数据

source: Generate fake/dummy data for any purpose
es: Generar datos falsos o ficticios para cualquier propósito
ja: あらゆる目的のための偽物/ダミーデータの生成
ru: Генерировать фальшивые/неправильные данные для любых целей.
zh_cn: 生成用于任何目的的虚假/虚拟数据

source: If you wanted to generate 1000 random people, just define what a person looks like and dammy will handle the rest
es: Si quisieras generar 1000 personas al azar,sólo tienes que definir cómo es una persona y la madre se encargará del resto.
ja: 1000人のランダムな人を生成したい場合は、その人がどのように見えるかを定義するだけで、残りの部分はダミーが処理してくれます。
ru: Если вы хотите сгенерировать 1000 случайных людей,просто определите,как человек выглядит,а Дамми справится с остальным.
zh_cn: 如果你想生成1000个随机的人,只需定义一个人的长相,Dammy就会处理剩下的部分。

source: Installation
es: Instalación
ja: インストール
ru: Установка
zh_cn: 安装

source: Introduction
es: Introducción
ja: 序章
ru: Введение
zh_cn: 介紹

source: It also supports relationships between tables, so you can generate data to populate databases
es: También apoya las relaciones entre las tablas,de modo que puede generar datos para poblar las bases de datos
ja: また、テーブル間のリレーションもサポートしているので、データベースにデータを入力するためのデータを生成することができます。
ru: Он также поддерживает связи между таблицами,так что вы можете генерировать данные для заполнения баз данных.
zh_cn: 它还支持表之间的关系,所以你可以生成数据来填充数据库。

source: Iterators added
es: Iteradores añadidos
ja: イテレータを追加
ru: Добавлены итераторы
zh_cn: 新增迭代器

source: Minor bugs fixed
es: Se han corregido pequeños errores...
ja: マイナーバグの修正
ru: Исправлены незначительные ошибки
zh_cn: 小错误已修复

source: Minor code changes (duplicated code removed...)
es: Cambios menores en el código (código duplicado eliminado...)
ja: マイナーコードの変更(重複していたコードを削除しました。
ru: Незначительные изменения кода (дублированный код удален...)
zh_cn: 小的代码变化(删除重复的代码......)。

source: Release history
es: Historia de la liberación
ja: リリース履歴
ru: История релизов
zh_cn: 发行历史

source: Removed DatabaseConstraint
es: Eliminación de la limitación de la base de datos
ja: DatabaseConstraintを削除
ru: Удаленная база данныхОграничение
zh_cn: 删除了数据库约束

source: Semantic versioning used from now on
es: El versionado semántico utilizado a partir de ahora
ja: 今後使用されるセマンティックバージョニング
ru: Семантическое версионирование,используемое отныне
zh_cn: 从现在开始使用语义版本

source: Table of contents
es: Tabla de contenido
ja: 目次
ru: Оглавление
zh_cn: 目录

source: The possibility to expand the previous set with little to no code
es: La posibilidad de ampliar el conjunto anterior con poco o ningún código
ja: 前のセットをほとんどコードなしで拡張できる可能性
ru: Возможность расширить предыдущий набор с малым количеством кода до нуля.
zh_cn: 可以在几乎没有任何代码的情况下扩展以前的集合。

source: To install the latest stable release of dammy using pip
es: Para instalar la última versión estable de Dammy usando Pip
ja: pip を使って最新の安定版リリースの dammy をインストールするには
ru: Для установки последнего стабильного выпуска дамбы с помощью трубопровода
zh_cn: 使用pip安装最新稳定版的dammy。

source: Which will output:
es: Que saldrá:
ja: どちらが出力されるか。
ru: Который приведет к результату:
zh_cn: 这将输出。

source: You can also install the latest development release by cloning the repository and installing it with pip
es: También puedes instalar la última versión de desarrollo clonando el repositorio e instalándolo con pip
ja: また、リポジトリをクローンしてpipでインストールすることで、最新の開発リリースをインストールすることもできます。
ru: Вы также можете установить последнюю версию разработки,клонируя репозиторий и устанавливая его с помощью pip
zh_cn: 你也可以通过克隆版本库并使用pip安装最新的开发版本

source: dammy
es: damisela
ja: ダミー
ru: дамма
zh_cn: 坝坝子

source: dammy.stdlib expanded with new built-in generators
es: dammy.stdlib ampliado con nuevos generadores incorporados
ja: dammy.stdlib に新しい組み込みジェネレータを追加しました。
ru: dammy.stdlib расширена новыми встроенными генераторами
zh_cn: dammy.stdlib扩展了新的内置生成器。
