Repository: Yuniorcr/runebook
Catalog: xlf/packages/*/python/django-ya-model-publisher.001.xlf
Languages: ko, ru

source: <em>dev</em><a href="https://github.com/wearehoods/django-ya-model-publisher/compare/v0.7.0...master">compare v0.7.0&hellip;master</a>
ko: <em>개발 </em><a href="https://github.com/wearehoods/django-ya-model-publisher/compare/v0.7.0...master">비교 v0.7.0&hellip; 마스터</a>
ru: <em>dev </em><a href="https://github.com/wearehoods/django-ya-model-publisher/compare/v0.7.0...master">сравнить v0.7.0&hellip; master</a>

source: <strong>&lsquo;editor&rsquo;</strong>:
ko: <strong>'편집기'</strong> :
ru: <strong>'редактор'</strong> :

source: <strong>&lsquo;reporter&rsquo;</strong>:
ko: <strong>'리포터'</strong> :
ru: <strong>'репортер'</strong> :

source: <strong>Important</strong>: To prevent a privilege escalation, both users must <strong>not</strong> have access to these models:
ko: <strong>중요</strong> : 권한 상승을 방지하기 위해, 두 사용자가 있어야 <strong>하지</strong> 이러한 모델에 액세스 할 수 있습니다
ru: <strong>Важно</strong> : чтобы предотвратить повышение привилегий, оба пользователя <strong>не</strong> должны иметь доступа к этим моделям:

source: A django <strong>&lsquo;superuser&rsquo;</strong>
ko: 장고 <strong>'슈퍼 유저'</strong>
ru: <strong>Суперпользователь</strong> django<strong></strong>

source: A user with more rights (We call it <strong>&lsquo;editor&rsquo;</strong>)
ko: 더 많은 권한을 가진 사용자 ( <strong>'편집자'라고 함</strong> )
ru: Пользователь с дополнительными правами (мы называем его <strong>редактором</strong> )

source: A user with only a few rights (we call it <strong>&lsquo;reporter&rsquo;</strong>)
ko: 소수의 권한 만 가진 사용자 ( <strong>'리포터'라고 함</strong> )
ru: Пользователь с ограниченными правами (мы называем его <strong>репортером</strong> )

source: Add &ldquo;request/reject/accept publishing&rdquo; buttons to Django CMS toolbar for cms pages.
ko: cms 페이지 용 Django CMS 툴바에 "게시 요청 / 거부 / 승인"버튼을 추가합니다.
ru: Добавьте кнопки &laquo;запросить / отклонить / принять публикацию&raquo; на панель инструментов Django CMS для страниц cms.

source: Add reply/history Links in Django CMS Toolbar (specially for page with pending requests)
ko: Django CMS 툴바에 응답 / 기록 링크 추가 (특히 요청이 보류중인 페이지의 경우)
ru: Добавить ссылки на ответ/история в панели инструментов Django CMS (специально для страницы с отложенными запросами)

source: Add request/reject buttons in Django CMS toolbar.
ko: Django CMS 툴바에 요청 / 거부 버튼을 추가합니다.
ru: Добавить кнопки запроса/отказа в панель инструментов Django CMS.

source: Add username list on test pages
ko: 테스트 페이지에 사용자 이름 목록 추가
ru: Добавить список имен пользователей на тестовых страницах

source: AttributeError: 'PublisherPageToolbar' object has no attribute 'current_request'
ko: AttributeError : 'PublisherPageToolbar'개체에 'current_request'속성이 없습니다.
ru: АтрибутОшибка:объект 'PublisherPageToolbar' не имеет атрибута 'current_request'.

source: Backwards-incompatible changes
ko: 이전 버전과 호환되지 않는 변경
ru: Назад-несовместимые изменения

source: Backwards-incompatible changes (see above)
ko: 이전 버전과 호환되지 않는 변경 사항 (위 참조)
ru: Назад-несовместимые изменения (см.выше)

source: Bugfix
ko: 버그 픽스
ru: Исправление ошибки

source: Bugfix: Missing &ldquo;Request publishing&rdquo; toobar link on new created pages
ko: 버그 픽스 : 새로 생성 된 페이지에&ldquo;요청 게시&rdquo;링크가 없음
ru: Исправление: отсутствовала ссылка на панель &laquo;Запрос на публикацию&raquo; на новых созданных страницах.

source: Bugfix: deny editing pending request objects
ko: 버그 픽스 : 보류중인 요청 객체 편집 거부
ru: Исправление:в редактировании объектов отложенного запроса отказано.

source: Bugfix: redirect after &ldquo;Request publishing&rdquo; can result in a 404, see: <a href="https://github.com/wearehoods/django-ya-model-publisher/issues/9">issues #9</a>
ko: 버그 픽스 : "요청 게시"후 리디렉션으로 인해 404가 발생할 수 있습니다. 참조 : <a href="https://github.com/wearehoods/django-ya-model-publisher/issues/9">문제 # 9</a>
ru: Исправление: перенаправление после &laquo;публикации запроса&raquo; могло приводить к ошибке 404, см. <a href="https://github.com/wearehoods/django-ya-model-publisher/issues/9">Проблемы №9.</a>

source: Change
ko: 변화
ru: Изменить

source: Create django users if not exists:
ko: 존재하지 않는 경우 django 사용자를 만듭니다.
ru: Создавайте пользователей джанго,если они не существуют:

source: Create messages after (un-)/publish request created.
ko: 생성 된 (un-) / 게시 요청 후에 메시지를 생성합니다.
ru: Создавать сообщения после создания (un-)/публикации запроса.

source: Currently Django CMS v3.5 is not supported, yet. It&rsquo;s on the TODO, see: <a href="https://github.com/wearehoods/django-ya-model-publisher/issues/10">issues #10</a>
ko: 현재 Django CMS v3.5는 아직 지원되지 않습니다. TODO에 있습니다. 참조 : <a href="https://github.com/wearehoods/django-ya-model-publisher/issues/10">문제 # 10</a>
ru: В настоящее время Django CMS v3.5 еще не поддерживается. Это в TODO, см .: <a href="https://github.com/wearehoods/django-ya-model-publisher/issues/10">выпуски №10</a>

source: Disable &lsquo;add&rsquo; PublisherStateModel admin view for all users
ko: 모든 사용자에 대해 PublisherStateModel 관리자보기 '추가'비활성화
ru: Отключить "добавить" административное представление PublisherStateModel для всех пользователей

source: Django CMS page support.
ko: Django CMS 페이지 지원.
ru: Страница поддержки Django CMS.

source: Django CMS placeholders support.
ko: Django CMS 자리 표시 자 지원.
ru: Поддержка плейсхолдеров Django CMS.

source: Django compatibility
ko: 장고 호환성
ru: совместимость с Django

source: Expand tests with
ko: 테스트 확장
ru: Расширить тесты с

source: Features
ko: 풍모
ru: Особенности

source: Fix <a href="https://github.com/wearehoods/django-ya-model-publisher/issues/9">#9 Redirect after &ldquo;request publishing&rdquo;</a>
ko: <a href="https://github.com/wearehoods/django-ya-model-publisher/issues/9">"게시 요청"후 # 9 리디렉션</a> 수정
ru: Исправление <a href="https://github.com/wearehoods/django-ya-model-publisher/issues/9">№9 Перенаправление после &laquo;публикации запроса&raquo;</a>

source: Flattr This!
ko: Flattr 이것!
ru: Квартира!

source: For a complete fresh database, just remove the sqlite file, e.g.:
ko: 완전히 새로운 데이터베이스의 경우 sqlite 파일을 제거하십시오. 예 :
ru: Для полной свежей базы данных просто удалите sqlite-файл,например:

source: GenericForeignKey
ru: ДженерикФорейнКей

source: Handle publishes states with deletes instance: Add a admin view to close the request.
ko: 인스턴스 삭제로 게시 상태 처리 : 관리자보기를 추가하여 요청을 닫습니다.
ru: Handle публикует состояния с удаленным экземпляром:Добавить вид администратора,чтобы закрыть запрос.

source: Hide &lsquo;change&rsquo; PublisherStateModel admin view for all non-superusers
ko: 수퍼 유저가 아닌 모든 사용자에 대한 '변경'PublisherStateModel 관리자보기 숨기기
ru: Скрыть вид администратора PublisherStateModel для всех не суперпользователей

source: Hide PublisherStateModel admin actions for all non-superusers
ko: 수퍼 유저가 아닌 모든 사용자에 대한 PublisherStateModel 관리자 작업 숨기기
ru: Скрыть PublisherStateМодель действий администратора для всех не-суперпользователей

source: Homepage
ko: 홈페이지
ru: Домашняя страница

source: Hvad/Parler support.
ko: Hvad / Parler 지원.
ru: Хвад/Парлеровская поддержка.

source: Implement &ldquo;request/reject/accept publishing&rdquo; workflow with a shot messages and logging
ko: 샷 메시지 및 로깅을 사용하여 "게시 요청 / 거부 / 수락"워크 플로 구현
ru: Внедрить рабочий процесс &laquo;запрос / отклонение / принятие публикации&raquo; с отправкой сообщений и журналов.

source: Just create the fork and apply all pull requests from <a href="https://github.com/andersinno/django-model-publisher-ai/pull/14">andersinno/django-model-publisher-ai/pull/14</a>
ko: 포크를 생성하고 <a href="https://github.com/andersinno/django-model-publisher-ai/pull/14">andersinno / django-model-publisher-ai / pull / 14의</a> 모든 풀 요청을 적용하십시오.
ru: Просто создайте вилку и примените все запросы на вытягивание из <a href="https://github.com/andersinno/django-model-publisher-ai/pull/14">andersinno / django-model-publisher-ai / pull / 14</a>

source: NEW:
ko: 새로운:
ru: НОВИНКА:

source: NEW: &lsquo;History&rsquo; view in admin (e.g.: see status/history of closed request and status for users that can only create requests)
ko: 새로운 기능 : 관리자의 '기록'보기 (예 : 요청을 생성 만 할 수있는 사용자의 상태 / 종료 된 요청의 상태 및 상태보기)
ru: НОВИНКА: просмотр истории в админке (например: просмотр статуса / истории закрытого запроса и статуса для пользователей, которые могут только создавать запросы)

source: NEW: Add publish links to Django CMS toolbar in
ko: 신규 : Django CMS 툴바에 게시 링크 추가
ru: НОВОЕ:Добавить ссылки на публикацию на панели инструментов Django CMS в

source: No 404 when &ldquo;reply&rdquo; closed requests or deleted instance.
ko: "응답"할 때 요청을 닫거나 인스턴스를 삭제하면 404가 없습니다.
ru: Нет 404 при &laquo;ответе&raquo; на закрытые запросы или удаленный экземпляр.

source: Note: See travis/tox config files for current test matrix
ko: 참고 : 현재 테스트 매트릭스는 travis / tox 구성 파일을 참조하십시오.
ru: Примечание:См.конфигурационные файлы travis/tox для текущей тестовой матрицы.

source: Permissions for <strong>&lsquo;editor&rsquo;</strong> who can <em>accept/reject (un-)publish requests</em>:
ko: <em>게시 요청을 수락 / 거부 (취소) 할</em> 수있는 <strong>'편집자'의</strong> 권한 :<em></em>
ru: Разрешения для <strong>&laquo;редактора&raquo;,</strong> который может <em>принимать / отклонять (отменять) запросы на публикацию</em> :

source: Permissions for <strong>&lsquo;reporter&rsquo;</strong> who can only create <em>(un-)publish requests</em>:
ko: <em>게시 취소 요청</em> 만 생성 할 수있는 <strong>'보고자'의</strong> 권한 :<em></em>
ru: Разрешения для <strong>"репортера",</strong> который может только создавать <em>(отменять) запросы на публикацию</em> :

source: Please read the information above.
ko: 위의 정보를 읽으십시오.
ru: Пожалуйста,ознакомьтесь с информацией выше.

source: Primary key type compatibility
ko: 기본 키 유형 호환성
ru: Совместимость с типом первичного ключа

source: Publisher workflow for django models and Django CMS pages.
ko: Django 모델 및 Django CMS 페이지에 대한 게시자 워크 플로입니다.
ru: Рабочий процесс издателя для моделей и страниц Django CMS.

source: PyPi (legacy)
ko: PyPi (레거시)
ru: ПиПи (наследие)

source: Refactor test run setup
ko: 리팩터링 테스트 실행 설정
ru: Рефракторная испытательная установка

source: Remove support for Django 1.8
ko: Django 1.8 지원 제거
ru: Удалить поддержку для Django 1.8

source: Restrict user access to publish functions with user permissions.
ko: 사용자 권한으로 기능을 게시하기 위해 사용자 액세스를 제한합니다.
ru: Ограничение доступа пользователей к функциям публикации с разрешениями пользователей.

source: Security Fix: User without &lsquo;can_publish&rsquo; permission can accept/reject requests.
ko: 보안 수정 : 'can_publish'권한이없는 사용자는 요청을 수락 / 거부 할 수 있습니다.
ru: Исправление безопасности: пользователь без разрешения can_publish может принимать / отклонять запросы.

source: See user permission tests in:
ko: 다음에서 사용자 권한 테스트를 참조하십시오.
ru: См.тесты разрешений пользователей:

source: Send <a href="http://www.bitcoin.org/">Bitcoins</a> to <a href="https://blockexplorer.com/address/1823RZ5Md1Q2X5aSXRC5LRPcYdveCiVX6F">1823RZ5Md1Q2X5aSXRC5LRPcYdveCiVX6F</a>
ko: <a href="http://www.bitcoin.org/">비트 </a><a href="https://blockexplorer.com/address/1823RZ5Md1Q2X5aSXRC5LRPcYdveCiVX6F">코인</a> 을 1823RZ5Md1Q2X5aSXRC5LRPcYdveCiVX6F로 보내기
ru: Отправить <a href="http://www.bitcoin.org/">Bitcoins</a> для <a href="https://blockexplorer.com/address/1823RZ5Md1Q2X5aSXRC5LRPcYdveCiVX6F">1823RZ5Md1Q2X5aSXRC5LRPcYdveCiVX6F</a>

source: Skip official support for python v2.7 and v3.4 (remove from text matrix)
ko: Python v2.7 및 v3.4에 대한 공식 지원 건너 뛰기 (텍스트 매트릭스에서 제거)
ru: Пропустить официальную поддержку python v2.7 и v3.4 (удалить из текстовой матрицы)

source: Test users:
ko: 테스트 사용자 :
ru: Тестовые пользователи:

source: The following steps will be executed:
ko: 다음 단계가 실행됩니다.
ru: Будут выполнены следующие шаги:

source: The permission names changed! Please update your django user permissions, too.
ko: 권한 이름이 변경되었습니다! 장고 사용자 권한도 업데이트하십시오.
ru: Имена разрешений изменились! Пожалуйста,обновите также и права доступа к вашему пользователю django.

source: The superuser with all rights
ko: 모든 권한을 가진 수퍼 유저
ru: Суперпользователь со всеми правами

source: The user <strong>editor</strong>: He can accept/reject un-/publish requests
ko: 사용자 <strong>편집자</strong> : 그는 취소 / 게시 요청을 수락 / 거부 할 수 있습니다.
ru: Пользовательский <strong>редактор</strong> : он может принимать / отклонять запросы на отмену / публикацию

source: The user <strong>reporter</strong>: He can create un-/publish requests
ko: 사용자 <strong>리포터</strong> : 게시 / 취소 요청 생성 가능
ru: Пользователь- <strong>репортер</strong> : он может создавать запросы на отмену / публикацию

source: The user case is following:
ko: 사용자 사례는 다음과 같습니다.
ru: Ниже приведен случай пользователя:

source: These permissions are removed:
ko: 다음 권한이 제거됩니다.
ru: Эти разрешения удалены:

source: This is a fork of <a href="https://github.com/andersinno/django-model-publisher-ai">andersinno/django-model-publisher-ai</a> which is a fork of the origin <a href="https://github.com/jp74/django-model-publisher">jp74/django-model-publisher</a>.
ko: 이의 포크입니다 <a href="https://github.com/andersinno/django-model-publisher-ai">andersinno / 장고 모델 - 게시자가-AI</a> 기원 포크 인 <a href="https://github.com/jp74/django-model-publisher">jp74 / 장고 모델 발행인</a> .
ru: Это форк <a href="https://github.com/andersinno/django-model-publisher-ai">andersinno / django-model-publisher-ai,</a> который является форком <a href="https://github.com/jp74/django-model-publisher">исходного jp74 / django-model-publisher</a> .

source: To &lsquo;reset&rsquo; the test fixtures, run this:
ko: 테스트 픽스처를 '재설정'하려면 다음을 실행하십시오.
ru: Чтобы &laquo;сбросить&raquo; тестовые приборы, запустите следующее:

source: We have these three user types:
ko: 다음과 같은 세 가지 사용자 유형이 있습니다.
ru: У нас есть эти три типа пользователей:

source: You can pass arguments to the helper script, e.g.:
ko: 도우미 스크립트에 인수를 전달할 수 있습니다. 예 :
ru: Вы можете передавать аргументы в вспомогательный скрипт,например:

source: You can run the test environment by:
ko: 다음과 같은 방법으로 테스트 환경을 실행할 수 있습니다.
ru: Вы можете запустить тестовую среду:

source: ask_publisher_request
ru: запрос издателя

source: base info
ko: 기본 정보
ru: базовая информация

source: bugfix django v1.11 compatibility
ko: django v1.11 호환성 버그 수정
ru: исправление ошибки совместимости django v1.11

source: bugfix project name
ko: 버그 수정 프로젝트 이름
ru: имя проекта для исправления ошибок

source: can change drafts and public content, but only if there is no pending request.
ko: 초안 및 공개 콘텐츠를 변경할 수 있지만 보류중인 요청이없는 경우에만 가능합니다.
ru: может изменять черновики и публичный контент,но только в случае отсутствия отложенного запроса.

source: can delete publisher model entries or CMS pages.
ko: 게시자 모델 항목 또는 CMS 페이지를 삭제할 수 있습니다.
ru: может удалять записи модели издателя или страницы CMS.

source: can only change draft content
ko: 초안 내용 만 변경할 수 있습니다.
ru: может изменить только содержание проекта

source: can response open publishing request from &lsquo;reporter&rsquo;.
ko: '리포터'의 공개 게시 요청에 응답 할 수 있습니다.
ru: может ответить на открытый запрос публикации от &laquo;репортера&raquo;.

source: can send a <em>(un-)publish request</em> to the &lsquo;editor&rsquo; with a text node.
ko: <em>(un-) publish 요청</em> 을 텍스트 노드로 'editor' 에게 보낼 수 있습니다 .
ru: может отправить <em>запрос</em> на <em>публикацию (отмену) публикации</em> в &laquo;редактор&raquo; с помощью текстового узла.

source: can&rsquo;t change public content
ko: 공개 콘텐츠를 변경할 수 없습니다
ru: не может изменить общедоступный контент

source: can&rsquo;t delete publisher model entries or CMS pages.
ko: 게시자 모델 항목 또는 CMS 페이지를 삭제할 수 없습니다.
ru: не может удалить записи модели издателя или страницы CMS.

source: can&rsquo;t delete/manipulate publisher state model entries.
ko: 게시자 상태 모델 항목을 삭제 / 조작 할 수 없습니다.
ru: не может удалять / изменять записи модели состояния издателя.

source: change travis/tox/pytest configuration
ko: travis / tox / pytest 구성 변경
ru: изменить travis/токси/питестовую конфигурацию

source: cms.models.PagePermission
ru: cms.модели.Страница Разрешение

source: codecov.io/gh/wearehoods/django-ya-model-publisher
ru: codecov.io/gh/wearehoods/django-ya-model-издатель

source: collect static files
ko: 정적 파일 수집
ru: собирать статические файлы

source: coveralls.io/r/wearehoods/django-ya-model-publisher
ru: комбинезон.io/r/wearehoods/jango-ya-model-издатель

source: direct_publisher
ru: прямой издатель

source: django cms
ko: 장고 cms
ru: cms-джанго

source: django version
ko: 장고 버전
ru: версия для японцев

source: django-ya-model-publisher
ru: джанго-я-модель-издатель

source: donation
ko: 기부
ru: пожертвование

source: fix python package (add missing parts)
ko: 파이썬 패키지 수정 (누락 된 부분 추가)
ru: исправить питоновый пакет (добавить недостающие части)

source: for the
ko: 를 위해
ru: за

source: history
ko: 역사
ru: история

source: if superuser edit a cms page
ko: 수퍼 유저가 cms 페이지를 편집하는 경우
ru: если суперпользователь редактирует страницу cms

source: insert test fixtures (Create Django CMS pages)
ko: 테스트 픽스처 삽입 (Django CMS 페이지 생성)
ru: вставить пробные исправления (Создать страницы Django CMS)

source: link text and add &ldquo;page&rdquo; to them (to differentiate them better from
ko: 링크 텍스트를 추가하고 "페이지"를 추가합니다.
ru: текст ссылки и добавьте к ним &laquo;страницу&raquo; (чтобы лучше отличать их от

source: links
ko: 연결
ru: ссылки

source: links)
ko: 연결)
ru: звенья)

source: minor code update
ko: 사소한 코드 업데이트
ru: небольшое обновление кода

source: moved from:
ko: 다음에서 이동 :
ru: переехал:

source: note: Both users will used the same password as the &lsquo;superuser&rsquo; !
ko: 참고 : 두 사용자 모두 '수퍼 유저'와 동일한 암호를 사용합니다!
ru: Примечание. Оба пользователя будут использовать тот же пароль, что и &laquo;суперпользователь&raquo;!

source: or:
ko: 또는:
ru: или..:

source: permissions
ko: 권한
ru: разрешения

source: publisher.models.PublisherStateModel
ru: издатель.модели.издательСтатМодель

source: publisher.views
ru: мнения издателя

source: publisher.views.PublisherCmsViewMixin
ru: издатель.views.PublisherCmsViewMixin

source: publisher_cms.views
ru: мнения издателя

source: python
ko: 파이썬
ru: питон

source: refactor permissions and publisher workflow
ko: 리팩터링 권한 및 게시자 워크 플로
ru: разрешения рефактора и рабочий процесс издателя

source: remove out dated manage command &ldquo;update_permissions&rdquo; (can be found in <a href="https://github.com/jedie/django-tools">django-tools</a>)
ko: 오래된 관리 명령 "update_permissions"를 제거합니다 ( <a href="https://github.com/jedie/django-tools">django-tools</a> 에서 찾을 수 있음 ).
ru: удалить устаревшую команду управления &laquo;update_permissions&raquo; (можно найти в <a href="https://github.com/jedie/django-tools">django-tools</a> )

source: remove own &ldquo;unique_together&rdquo;: Add
ko: 자신의 "unique_together"제거 : 추가
ru: удалить собственное &laquo;unique_toght&raquo;: добавить

source: reply_publisher_request
ru: ответ_издание_запрос

source: run migration
ko: 마이그레이션 실행
ru: осуществить миграцию

source: run test project
ko: 테스트 프로젝트 실행
ru: тестовый проект

source: run test via <em>tox</em> e.g.:
ko: <em>독극물을</em> 통한 테스트 실행 예 :
ru: запустить тест через <em>tox,</em> например:

source: run tests
ko: 테스트 실행
ru: запусковые испытания

source: run tests via <em>py.test</em> with current python/environment:
ko: 현재 python / environment로 <em>py.test</em> 를 통해 테스트를 실행 합니다.
ru: запустить тесты через <em>py.test</em> с текущим python / средой:

source: run the django development server on localhost
ko: localhost에서 django 개발 서버 실행
ru: запустить сервер разработки django на localhost

source: so it can only be used for models with a integer primary keys! See also: <a href="https://docs.djangoproject.com/en/1.11/ref/contrib/contenttypes/#django.contrib.contenttypes.fields.GenericForeignKey">https://docs.djangoproject.com/en/1.11/ref/contrib/contenttypes/#django.contrib.contenttypes.fields.GenericForeignKey</a>
ko: 따라서 정수 기본 키가있는 모델에만 사용할 수 있습니다! 참조 : <a href="https://docs.djangoproject.com/en/1.11/ref/contrib/contenttypes/#django.contrib.contenttypes.fields.GenericForeignKey">https://docs.djangoproject.com/en/1.11/ref/contrib/contenttypes/#django.contrib.contenttypes.fields.GenericForeignKey</a>
ru: поэтому его можно использовать только для моделей с целочисленными первичными ключами! См. Также: <a href="https://docs.djangoproject.com/en/1.11/ref/contrib/contenttypes/#django.contrib.contenttypes.fields.GenericForeignKey">https://docs.djangoproject.com/en/1.11/ref/contrib/contenttypes/#django.contrib.contenttypes.fields.GenericForeignKey</a>

source: to your own &ldquo;unique_together&rdquo; tuple
ko: 자신의 "unique_together"튜플에
ru: в ваш собственный кортеж unique_toght

source: to:
ko: 에:
ru: к:

source: travis-ci.org/wearehoods/django-ya-model-publisher
ru: travis-ci.org/wearehoods/django-ya-model-издатель

source: used a
ko: 사용
ru: использованный

source: v0.4.0.dev1 - 14.11.2017 - <a href="https://github.com/wearehoods/django-ya-model-publisher/compare/v0.3.1...v0.4.0.dev1">compare v0.3.1&hellip;v0.4.0.dev1</a>
ko: v0.4.0.dev1-14.11.2017- <a href="https://github.com/wearehoods/django-ya-model-publisher/compare/v0.3.1...v0.4.0.dev1">비교 v0.3.1&hellip; v0.4.0.dev1</a>
ru: v0.4.0.dev1 - 14.11.2017 - <a href="https://github.com/wearehoods/django-ya-model-publisher/compare/v0.3.1...v0.4.0.dev1">сравните v0.3.1&hellip; v0.4.0.dev1</a>

source: v0.4.1 - 14.11.2017 - <a href="https://github.com/wearehoods/django-ya-model-publisher/compare/v0.4.0.dev1...v0.4.1">compare v0.4.0.dev1&hellip;v0.4.1</a>
ko: v0.4.1-14.11.2017- <a href="https://github.com/wearehoods/django-ya-model-publisher/compare/v0.4.0.dev1...v0.4.1">비교 v0.4.0.dev1&hellip; v0.4.1</a>
ru: v0.4.1 - 14.11.2017 - <a href="https://github.com/wearehoods/django-ya-model-publisher/compare/v0.4.0.dev1...v0.4.1">сравните v0.4.0.dev1&hellip; v0.4.1</a>

source: v0.5.0 - 19.12.2017 - <a href="https://github.com/wearehoods/django-ya-model-publisher/compare/v0.4.1...v0.5.0">compare v0.4.1&hellip;v0.5.0</a>
ko: v0.5.0-19.12.2017- <a href="https://github.com/wearehoods/django-ya-model-publisher/compare/v0.4.1...v0.5.0">비교 v0.4.1&hellip; v0.5.0</a>
ru: v0.5.0 - 19.12.2017 - <a href="https://github.com/wearehoods/django-ya-model-publisher/compare/v0.4.1...v0.5.0">сравнить v0.4.1&hellip; v0.5.0</a>

source: v0.5.1 - 20.12.2017 - <a href="https://github.com/wearehoods/django-ya-model-publisher/compare/v0.5.0...v0.5.1">compare v0.5.0&hellip;v0.5.1</a>
ko: v0.5.1-20.12.2017- <a href="https://github.com/wearehoods/django-ya-model-publisher/compare/v0.5.0...v0.5.1">비교 v0.5.0&hellip; v0.5.1</a>
ru: v0.5.1 - 20.12.2017 - <a href="https://github.com/wearehoods/django-ya-model-publisher/compare/v0.5.0...v0.5.1">сравнить v0.5.0&hellip; v0.5.1</a>

source: v0.6.0 - 27.12.2017 - <a href="https://github.com/wearehoods/django-ya-model-publisher/compare/v0.5.1...v0.6.0">compare v0.5.1&hellip;v0.6.0</a>
ko: v0.6.0-27.12.2017- <a href="https://github.com/wearehoods/django-ya-model-publisher/compare/v0.5.1...v0.6.0">비교 v0.5.1&hellip; v0.6.0</a>
ru: v0.6.0 - 27.12.2017 - <a href="https://github.com/wearehoods/django-ya-model-publisher/compare/v0.5.1...v0.6.0">сравнить v0.5.1&hellip; v0.6.0</a>

source: v0.6.1 - 28.12.2017 - <a href="https://github.com/wearehoods/django-ya-model-publisher/compare/v0.6.0...v0.6.1">compare v0.6.0&hellip;v0.6.1</a>
ko: v0.6.1-28.12.2017- <a href="https://github.com/wearehoods/django-ya-model-publisher/compare/v0.6.0...v0.6.1">v0.6.0&hellip; v0.6.1 비교</a>
ru: v0.6.1 - 28.12.2017 - <a href="https://github.com/wearehoods/django-ya-model-publisher/compare/v0.6.0...v0.6.1">сравнить v0.6.0&hellip; v0.6.1</a>

source: v0.6.2 - 02.01.2018 - <a href="https://github.com/wearehoods/django-ya-model-publisher/compare/v0.6.1...v0.6.2">compare v0.6.1&hellip;v0.6.2</a>
ko: v0.6.2 - 2018년 2월 1일 - <a href="https://github.com/wearehoods/django-ya-model-publisher/compare/v0.6.1...v0.6.2">비교 v0.6.1 ... v0.6.2</a>
ru: v0.6.2 - 02.01.2018 - <a href="https://github.com/wearehoods/django-ya-model-publisher/compare/v0.6.1...v0.6.2">сравнить v0.6.1&hellip; v0.6.2</a>
