Repository: Yuniorcr/runebook
Catalog: xlf/packages/*/python/django-tagulous.001.xlf
Languages: ja, ko, ru, zh_cn

source: , add
ja: 、 追加
ko: , 추가
ru: , добавлять
zh_cn: ，添加

source: , then start adding tag fields to your model:
ja: 、次にモデルへのタグフィールドの追加を開始します。
ko: 을 클릭 한 다음 모델에 태그 필드 추가를 시작합니다.
ru: , затем начните добавлять поля тегов в вашу модель:
zh_cn: ，然后开始向模型添加标签字段：

source: <a href="http://radiac.net/projects/django-tagulous/documentation/contributing/">Contributing</a> - for how to contribute to Tagulous, and the planned <a href="http://radiac.net/projects/django-tagulous/documentation/contributing/#roadmap">roadmap</a>.
ja: <a href="http://radiac.net/projects/django-tagulous/documentation/contributing/">貢献</a> -Tagulousに貢献する方法と計画された <a href="http://radiac.net/projects/django-tagulous/documentation/contributing/#roadmap">ロードマップについて</a>。
ko: <a href="http://radiac.net/projects/django-tagulous/documentation/contributing/">기여</a> -Tagulous에 기여하는 방법 및 계획된 <a href="http://radiac.net/projects/django-tagulous/documentation/contributing/#roadmap">로드맵</a> .
ru: <a href="http://radiac.net/projects/django-tagulous/documentation/contributing/">Содействие</a> - о том, как внести свой вклад в Tagulous, и о запланированной <a href="http://radiac.net/projects/django-tagulous/documentation/contributing/#roadmap">дорожной карте</a> .
zh_cn: <a href="http://radiac.net/projects/django-tagulous/documentation/contributing/">贡献</a> -有关如何为Tagulous做出贡献以及计划的 <a href="http://radiac.net/projects/django-tagulous/documentation/contributing/#roadmap">路线图</a>。

source: <a href="http://radiac.net/projects/django-tagulous/documentation/installation/">Installation</a> - how to install Tagulous
ja: <a href="http://radiac.net/projects/django-tagulous/documentation/installation/">インストール</a> -Tagulousをインストールする方法
ko: <a href="http://radiac.net/projects/django-tagulous/documentation/installation/">설치</a> -Tagulous 설치 방법
ru: <a href="http://radiac.net/projects/django-tagulous/documentation/installation/">Установка</a> - как установить Tagulous
zh_cn: <a href="http://radiac.net/projects/django-tagulous/documentation/installation/">安装</a> -如何安装Tagulous

source: <a href="http://radiac.net/projects/django-tagulous/documentation/upgrading/">Upgrading</a> - how to upgrade Tagulous, and see what has changed in the <a href="http://radiac.net/projects/django-tagulous/documentation/upgrading/#changelog">changelog</a>.
ja: <a href="http://radiac.net/projects/django-tagulous/documentation/upgrading/">アップグレード</a> -Tagulousをアップグレードする方法、および変更<a href="http://radiac.net/projects/django-tagulous/documentation/upgrading/#changelog">ログ</a>で何が変更されたかを確認します 。
ko: <a href="http://radiac.net/projects/django-tagulous/documentation/upgrading/">업그레이드</a> - Tagulous를 업그레이드하고,에 변경된 내용을 참조하는 방법을 <a href="http://radiac.net/projects/django-tagulous/documentation/upgrading/#changelog">변경 로그</a> .
ru: <a href="http://radiac.net/projects/django-tagulous/documentation/upgrading/">Обновление</a> - как обновить Tagulous и посмотреть, что изменилось, в журнале <a href="http://radiac.net/projects/django-tagulous/documentation/upgrading/#changelog">изменений</a> .
zh_cn: <a href="http://radiac.net/projects/django-tagulous/documentation/upgrading/">升级</a> -如何升级Tagulous，并在<a href="http://radiac.net/projects/django-tagulous/documentation/upgrading/#changelog">changelog中</a>查看已更改的内容 。

source: <a href="http://radiac.net/projects/django-tagulous/documentation/usage/">Example Usage</a> - see examples of Tagulous in use
ja: <a href="http://radiac.net/projects/django-tagulous/documentation/usage/">使用例</a> -使用中のTagulousの例を参照してください
ko: <a href="http://radiac.net/projects/django-tagulous/documentation/usage/">사용 예</a> -사용중인 Tagulous의 예보기
ru: <a href="http://radiac.net/projects/django-tagulous/documentation/usage/">Пример использования</a> - см. Примеры использования Tagulous
zh_cn: <a href="http://radiac.net/projects/django-tagulous/documentation/usage/">用法</a> 示例-查看使用中的Tagulous的示例

source: A tagging library for Django built on ForeignKey and ManyToManyField, giving you all their normal power with a sprinkling of tagging syntactic sugar.
ja: ForeignKey と ManyToManyField をベースに構築された Django 用のタグ付けライブラリ。
ko: ForeignKey 및 ManyToManyField를 기반으로 구축 된 Django 용 태깅 라이브러리로, 태깅 구문 설탕을 뿌려 모든 정상적인 기능을 제공합니다.
ru: Библиотека тегов для Django,построенная на ForeignKey и ManyToManyField,дающая вам всю их обычную мощь с посыпанием синтаксического сахара тегов.
zh_cn: 一个基于ForeignKey和ManyToManyField的Django标签库,为你提供了所有正常的功能,并添加了标签语法糖。

source: Admin support for managing tags and tagged models
ja: タグとタグ付きモデルを管理するための管理者サポート
ko: 태그 및 태그 된 모델 관리를위한 관리자 지원
ru: Административная поддержка для управления тегами и моделями с метками
zh_cn: 管理员支持管理标签和标签模型

source: As well as this you also get autocompletion in public and admin forms, automatic slug generation, unicode support, you can build tag clouds easily, and can nest tags for more complex categorisation.
ja: これだけでなく、公開フォームや管理フォームでの自動補完、自動スラッグ生成、ユニコードのサポート、タグクラウドを簡単に構築することができ、より複雑なカテゴリ化のためにタグを入れ子にすることができます。
ko: 뿐만 아니라 공개 및 관리 양식의 자동 완성, 자동 슬러그 생성, 유니 코드 지원을받을 수 있으며 태그 클라우드를 쉽게 구축 할 수 있으며 더 복잡한 분류를 위해 태그를 중첩 할 수 있습니다.
ru: Кроме того,вы также получаете автозавершение в публичных и администраторских формах,автоматическую генерацию слигов,поддержку юникода,вы можете легко построить облака тегов,а также можете вложить теги для более сложной категоризации.
zh_cn: 除此之外,您还可以在公共和管理表单中自动完成,自动生成slug,支持unicode,您可以很容易地建立标签云,并可以嵌套标签进行更复杂的分类。

source: Autocomplete support built in, if you want it
ja: 必要に応じてオートコンプリートのサポートが組み込まれています。
ko: 원하는 경우 내장 된 자동 완성 지원
ru: Встроенная поддержка автозаполнения,если хотите.
zh_cn: 内置自动完成功能,如果你想要的话。

source: Based on ForeignKey and ManyToManyField, so it&rsquo;s easy to query
ja: ForeignKeyとManyToManyFieldに基づいているため、クエリが簡単です
ko: ForeignKey 및 ManyToManyField를 기반으로하므로 쿼리하기 쉽습니다.
ru: На основе ForeignKey и ManyToManyField, поэтому запросить легко
zh_cn: 基于ForeignKey和ManyToManyField，因此查询起来很容易

source: Behind the scenes your tags are stored in separate models (by default), so because the fields are based on
ja: 裏では、タグは別のモデルに保存されています(デフォルトでは)。
ko: 이면에서 태그는 별도의 모델 (기본적으로)에 저장되므로 필드는
ru: За сценами ваши теги хранятся в отдельных моделях (по умолчанию),так как поля основаны на
zh_cn: 在幕后,您的标签存储在单独的模型中(默认情况下),因此,由于字段是基于

source: Can be used as a user-customisable CharField with choices
ja: ユーザーがカスタマイズ可能な CharField として使用することができます。
ko: 사용자 정의 가능한 CharField로 사용 가능
ru: Может использоваться в качестве настраиваемого пользователем CharField с возможностью выбора.
zh_cn: 可以作为一个用户自定义的CharField使用,可以选择

source: Easy to install - simple requirements, simple syntax, lots of options
ja: インストールが簡単-要件がシンプル、構文がシンプル、オプションが豊富
ko: 간편한 설치-간단한 요구 사항, 간단한 구문, 다양한 옵션
ru: Простота установки-простые требования,простой синтаксис,множество опций
zh_cn: 易于安装--要求简单,语法简单,选项多。

source: Fabulous Tagging for Django
ja: Django のための素晴らしいタグ付け
ko: Django를위한 멋진 태깅
zh_cn: 为Django设计的精美标签

source: Features
ja: 特徴
ko: 풍모
ru: Особенности
zh_cn: 特点

source: ForeignKey
ja: フォーリンキー
ru: Иностранный ключ
zh_cn: 外来键

source: INSTALLED_APPS
ja: インストールされているアプリケーション
ru: УСТАНАВЛИЛИРОВАННЫЙ_APPS
zh_cn: 已安装的应用程序

source: Install with
ja: とインストールします。
ko: 함께 설치
ru: Установить с
zh_cn: 安装方式

source: ManyToManyField
ja: マニートゥマニフィールド

source: Project site: <a href="http://radiac.net/projects/django-tagulous/">http://radiac.net/projects/django-tagulous/</a>
ja: プロジェクトサイト：<a href="http://radiac.net/projects/django-tagulous/">http</a>：//radiac.net/projects/django-tagulous/
ko: 프로젝트 사이트 : <a href="http://radiac.net/projects/django-tagulous/">http://radiac.net/projects/django-tagulous/</a>
ru: Сайт проекта: <a href="http://radiac.net/projects/django-tagulous/">http://radiac.net/projects/django-tagulous/</a>
zh_cn: 项目站点：<a href="http://radiac.net/projects/django-tagulous/">http</a> : //radiac.net/projects/django-tagulous/

source: Quickstart
ja: クイックスタート
ko: 빠른 시작
ru: Квикстарт
zh_cn: 快速启动

source: See the <a href="http://radiac.net/projects/django-tagulous/documentation/">Documentation</a> for details of how Tagulous works; in particular:
ja: Tagulousの動作の詳細については、<a href="http://radiac.net/projects/django-tagulous/documentation/">ドキュメント</a>を参照してください。特に：
ko: Tagulous의 작동 방식에 대한 자세한 내용은 <a href="http://radiac.net/projects/django-tagulous/documentation/">문서</a> 를 참조하십시오 . 특히:
ru: См. <a href="http://radiac.net/projects/django-tagulous/documentation/">Документацию</a> для получения подробной информации о том, как работает Tagulous; в частности:
zh_cn: 有关 Tagulous如何工作的详细信息，请参见<a href="http://radiac.net/projects/django-tagulous/documentation/">文档</a>。特别是：

source: Source code: <a href="https://github.com/radiac/django-tagulous">https://github.com/radiac/django-tagulous</a>
ja: ソースコード：<a href="https://github.com/radiac/django-tagulous">https</a>：//github.com/radiac/django-tagulous
ko: 소스 코드 : <a href="https://github.com/radiac/django-tagulous">https://github.com/radiac/django-tagulous</a>
ru: Исходный код: <a href="https://github.com/radiac/django-tagulous">https://github.com/radiac/django-tagulous</a>
zh_cn: 源代码：<a href="https://github.com/radiac/django-tagulous">https</a> : //github.com/radiac/django-tagulous

source: Supports multiple independent tag fields on a single model
ja: 1つのモデルで複数の独立したタグフィールドをサポート
ko: 단일 모델에서 여러 독립 태그 필드 지원
ru: Поддерживает несколько независимых полей тегов на одной модели
zh_cn: 在一个模型上支持多个独立的标签字段

source: Supports trees of nested tags, for detailed categorisation
ja: 詳細な分類のためのネストされたタグのツリーをサポート
ko: 세부 분류를 위해 중첩 된 태그 트리 지원
ru: Поддерживает деревья вложенных тегов,для подробного распределения по категориям
zh_cn: 支持嵌套的标签树,用于详细的分类。

source: Version 0.14.1; supports Django 1.4.2 to 2.2, on Python 2.7 and 3.2 to 3.7.
ja: バージョン 0.14.1;Django 1.4.2~2.2、Python 2.7、3.2~3.7 をサポート。
ko: 버전 0.14.1; Django 1.4.2 ~ 2.2, Python 2.7 및 3.2 ~ 3.7을 지원합니다.
ru: Версия 0.14.1;поддерживает Django 1.4.2-2.2,на Python 2.7 и 3.2-3.7.
zh_cn: 0.14.1版本;支持Django 1.4.2到2.2,支持Python 2.7和3.2到3.7。

source: You can now set and get them using strings, lists or querysets:
ja: 文字列、リスト、またはクエリセットを使って設定したり取得したりできるようになりました。
ko: 이제 문자열, 목록 또는 쿼리 세트를 사용하여 설정하고 가져올 수 있습니다.
ru: Теперь вы можете устанавливать и получать их,используя строки,списки или наборы запросов:
zh_cn: 现在你可以使用字符串、列表或查询集来设置和获取它们。

source: and
ja: そして
ko: 과
zh_cn: そして

source: more complex queries are simple:
ja: より複雑なクエリはシンプルです。
ko: 더 복잡한 쿼리는 간단합니다.
ru: более сложные запросы просты:
zh_cn: 比较复杂的查询很简单。

source: tagulous
ja: 札付き
ru: тегличный
zh_cn: 粘稠

source: to Django&rsquo;s
ja: Djangoの
ko: 장고에
ru: к Джанго
zh_cn: 到Django的

source: pip install django-tagulous
ru: установка джанго-тагулянта
