Repository: Yuniorcr/runebook
Catalog: xlf/packages/*/python/django-structlog.001.xlf
Languages: es, ko, ru, zh_cn

source: (or other DRF authentications)
es: (u otras autenticaciones DRF)
ko: (또는 기타 DRF 인증)
ru: (или другие аутентификации DRF)
zh_cn: （或其他DRF身份验证）

source: <a href="https://github.com/hynek/structlog/issues/175">This issue</a> helped the author to figure out how to integrate
es: <a href="https://github.com/hynek/structlog/issues/175">Este problema</a> ayud&oacute; al autor a descubrir c&oacute;mo integrar
ko: <a href="https://github.com/hynek/structlog/issues/175">이 문제</a> 는 저자가 통합하는 방법을 알아내는 데 도움 이되었습니다.
ru: <a href="https://github.com/hynek/structlog/issues/175">Эта проблема</a> помогла автору понять, как интегрировать
zh_cn: <a href="https://github.com/hynek/structlog/issues/175">这个问题</a>帮助作者弄清楚如何整合

source: <a href="https://stackoverflow.com/questions/43855507/configuring-and-using-structlog-with-django">This stack overflow question</a> was also helpful.
es: <a href="https://stackoverflow.com/questions/43855507/configuring-and-using-structlog-with-django">Esta pregunta de desbordamiento de pila</a> tambi&eacute;n fue &uacute;til.
ko: <a href="https://stackoverflow.com/questions/43855507/configuring-and-using-structlog-with-django">이 스택 오버플로 질문</a> 도 도움이되었습니다.
ru: <a href="https://stackoverflow.com/questions/43855507/configuring-and-using-structlog-with-django">Этот вопрос о переполнении стека</a> также был полезен.
zh_cn: <a href="https://stackoverflow.com/questions/43855507/configuring-and-using-structlog-with-django">这个堆栈溢出问题</a>也很有帮助。

source: <strong>Jules Robichaud-Gagnon</strong> - <em>Initial work</em> - <a href="https://github.com/jrobichaud">jrobichaud</a>
es: <strong>Jules Robichaud-Gagnon</strong> - <em>Trabajo inicial</em> - <a href="https://github.com/jrobichaud">jrobichaud</a>
ko: <strong>쥘 Robichaud-의 Gagnon</strong> - <em>초기 일</em> - <a href="https://github.com/jrobichaud">jrobichaud</a>
ru: <strong>Жюль Робишо-Ганьон</strong> - <em>Начальная работа</em> - <a href="https://github.com/jrobichaud">jrobichaud</a>
zh_cn: <strong>朱罗比肖-加格农</strong>-<em>最初的工作</em>- <a href="https://github.com/jrobichaud">jrobichaud</a>

source: Acknowledgments
es: Agradecimientos
ko: 감사의 말
ru: Благодарности
zh_cn: 鸣谢

source: Add appropriate structlog configuration to your
es: Añada la configuración apropiada de Structurelog a su
ko: 적절한 structlog 구성을
ru: Добавьте соответствующую конфигурацию структурного журнала к вашему
zh_cn: 添加适当的 structlog 配置到你的

source: Add middleware
es: Añadir el middleware
ko: 미들웨어 추가
ru: Добавить промежуточное программное обеспечение
zh_cn: 增加中间件

source: Additional Popular Integrations
es: Integraciones populares adicionales
ko: 추가 인기 통합
ru: Дополнительные популярные интеграции
zh_cn: 其他流行的集成

source: Authors
es: Autores
ko: 저자
ru: Авторы
zh_cn: 作者

source: Big thanks to <a href="https://github.com/ferd">@ferd</a> for his <a href="https://ferd.ca/erlang-otp-21-s-new-logger.html">bad opinions</a> that inspired the author enough to spend time on this library.
es: <a href="https://github.com/ferd">Muchas</a> gracias a @ferd por sus <a href="https://ferd.ca/erlang-otp-21-s-new-logger.html">malas opiniones</a> que inspiraron al autor lo suficiente como para dedicar tiempo a esta biblioteca.
ko: 이 라이브러리에서 시간을 보낼만큼 저자에게 영감을 준 그의 <a href="https://ferd.ca/erlang-otp-21-s-new-logger.html">나쁜 의견에</a> 대해 <a href="https://github.com/ferd">@ferd</a> 에게 큰 감사를 표 합니다 .
ru: Большое спасибо <a href="https://github.com/ferd">@ferd</a> за его <a href="https://ferd.ca/erlang-otp-21-s-new-logger.html">плохие мнения,</a> которые вдохновили автора посвятить время этой библиотеке.
zh_cn: 非常感谢<a href="https://github.com/ferd">@ferd</a>的<a href="https://ferd.ca/erlang-otp-21-s-new-logger.html">不良见解</a>，激发了作者以足够的时间在此库上花费时间。

source: By default only a
es: Por defecto sólo un
ko: 기본적으로
ru: По умолчанию только
zh_cn: 默认情况下,只有一个

source: Celery
es: Apio
ko: 셀러리
ru: Сельдерей
zh_cn: 芹菜

source: Celery&rsquo;s task logging requires additional configurations, see <a href="https://django-structlog.readthedocs.io/en/latest/celery.html">documentation</a> for details.
es: El registro de tareas de Apio requiere configuraciones adicionales; consulte la <a href="https://django-structlog.readthedocs.io/en/latest/celery.html">documentaci&oacute;n</a> para obtener m&aacute;s detalles.
ko: Celery의 작업 로깅에는 추가 구성이 필요합니다 . 자세한 내용 은 <a href="https://django-structlog.readthedocs.io/en/latest/celery.html">설명서</a> 를 참조하십시오.
ru: Для ведения журнала задач Celery требуются дополнительные настройки, подробности см. В <a href="https://django-structlog.readthedocs.io/en/latest/celery.html">документации</a> .
zh_cn: Celery的任务日志记录需要其他配置，有关详细信息，请参阅<a href="https://django-structlog.readthedocs.io/en/latest/celery.html">文档</a>。

source: Demo app
es: Aplicación de demostración
ko: 데모 앱
ru: Демонстрационное приложение
zh_cn: 演示应用

source: Django REST framework
es: Marco REST de Django
ko: Django REST 프레임 워크
ru: Django REST фреймворк
zh_cn: Django REST框架

source: Example outputs
es: Ejemplos de resultados
ko: 예제 출력
ru: Примеры выводов
zh_cn: 产出示例

source: Extending Request Log Metadata
es: Ampliación de los metadatos del registro de solicitudes
ko: 요청 로그 메타 데이터 확장
ru: Расширение метаданных журнала запросов
zh_cn: 扩展请求日志元数据

source: Flat lines file (
es: Archivo de líneas planas (
ko: 플랫 라인 파일 (
ru: Файл с плоскими строками (
zh_cn: 平行文件 (

source: Getting Started
es: Empezando
ko: 시작하기
ru: Начало работы
zh_cn: 入门

source: If you need to add more metadata from the request you can implement a convenient signal receiver to bind them. You can also override existing bound metadata the same way.
es: Si necesita añadir más metadatos de la solicitud puede implementar un receptor de señal conveniente para unirlos.También puede anular los metadatos vinculados existentes de la misma manera.
ko: 요청에서 더 많은 메타 데이터를 추가해야하는 경우 편리한 신호 수신기를 구현하여 바인딩 할 수 있습니다. 동일한 방식으로 기존 바인딩 된 메타 데이터를 재정의 할 수도 있습니다.
ru: Если вам нужно добавить больше метаданных из запроса,вы можете реализовать удобный приемник сигнала для их привязки.Аналогичным образом вы можете переопределить существующие связанные метаданные.
zh_cn: 如果你需要从请求中添加更多的元数据,你可以实现一个方便的信号接收器来绑定它们。你也可以用同样的方式覆盖现有的绑定元数据。

source: In another shell
es: En otra concha
ko: 다른 껍질에서
ru: В другой оболочке
zh_cn: 在另一个外壳中

source: Install the library
es: Instalar la biblioteca
ko: 라이브러리 설치
ru: Установить библиотеку
zh_cn: 安装库

source: Installation
es: Instalación
ko: 설치
ru: Установка
zh_cn: 安装

source: Json file (
es: El archivo Json (
ko: Json 파일 (
ru: Файл Джсона (
zh_cn: Json文件(

source: License
es: Licencia
ko: 특허
ru: Лицензия
zh_cn: 许可证

source: Logging comparison
es: Comparación de registro
ko: 로깅 비교
ru: Сравнение журналов
zh_cn: 记录比较

source: Logging will then produce additional cohesive metadata on each logs that makes it easier to track events or incidents.
es: El registro producirá entonces metadatos cohesivos adicionales en cada registro que faciliten el seguimiento de los eventos o incidentes.
ko: 그런 다음 로깅은 각 로그에 추가로 일관된 메타 데이터를 생성하여 이벤트 또는 인시던트를 더 쉽게 추적 할 수 있습니다.
ru: Затем в каждом журнале будут создаваться дополнительные связные метаданные,что облегчает отслеживание событий или инцидентов.
zh_cn: 然后,日志将在每个日志上产生额外的凝聚性元数据,使其更容易跟踪事件或事件。

source: Navigate while looking into the log files and shell&rsquo;s output.
es: Navegue mientras mira los archivos de registro y la salida del shell.
ko: 로그 파일과 셸의 출력을 살펴보면서 탐색합니다.
ru: Перемещайтесь, просматривая файлы журнала и вывод оболочки.
zh_cn: 浏览日志文件和shell的输出。

source: Note: For the moment redis is needed to run the tests. The easiest way start docker&rsquo;s demo.
es: Nota: Por el momento, se necesita redis para ejecutar las pruebas. La forma m&aacute;s f&aacute;cil de iniciar la demostraci&oacute;n de Docker.
ko: 참고 : 현재 테스트를 실행하려면 redis가 필요합니다. docker의 데모를 시작하는 가장 쉬운 방법입니다.
ru: Примечание. На данный момент для запуска тестов необходим redis. Самый простой способ запустить docker's demo.
zh_cn: 注意：目前需要redis来运行测试。启动Docker演示的最简单方法。

source: Open
es: Abrir
ko: 열다
ru: Открыть
zh_cn: 开放式

source: Running the tests
es: Realizando las pruebas
ko: 테스트 실행
ru: Запуск тестов
zh_cn: 运行测试

source: See <a href="https://github.com/jrobichaud/django-structlog/issues/37">#37</a> for details.
es: Consulte el n. <a href="https://github.com/jrobichaud/django-structlog/issues/37">&deg; 37</a> para obtener m&aacute;s detalles.
ko: 자세한 내용은 <a href="https://github.com/jrobichaud/django-structlog/issues/37"># 37</a> 을 참조하십시오.
ru: См. <a href="https://github.com/jrobichaud/django-structlog/issues/37"># 37</a> для деталей.
zh_cn: 有关详情，请参见<a href="https://github.com/jrobichaud/django-structlog/issues/37">＃37</a>。

source: See also the list of <a href="https://github.com/jrobichaud/django-structlog/contributors">contributors</a> who participated in this project.
es: Consulte tambi&eacute;n la lista de <a href="https://github.com/jrobichaud/django-structlog/contributors">colaboradores</a> que participaron en este proyecto.
ko: 이 프로젝트에 참여한 <a href="https://github.com/jrobichaud/django-structlog/contributors">기여자</a> 목록도 참조하십시오 .
ru: См. Также список <a href="https://github.com/jrobichaud/django-structlog/contributors">участников</a> , участвовавших в этом проекте.
zh_cn: 另请参阅参与此项目的<a href="https://github.com/jrobichaud/django-structlog/contributors">贡献者</a>列表。

source: Standard logging:
es: Registro estándar:
ko: 표준 로깅 :
ru: Стандартная запись:
zh_cn: 标准记录。

source: Start logging with
es: Empieza a registrarte con
ko: 다음으로 로깅 시작
ru: Начните лесозаготовку с
zh_cn: 开始记录

source: Structured Logging for Django
es: Registro estructurado de Django
ko: Django를위한 구조화 된 로깅
ru: Структурированное ведение журнала для Django
zh_cn: Django的结构化日志

source: Then you can search with commands like:
es: Entonces puedes buscar con comandos como:
ko: 그런 다음 다음과 같은 명령으로 검색 할 수 있습니다.
ru: Тогда вы можете искать с помощью команд типа:
zh_cn: 然后你可以用这样的命令进行搜索。

source: These steps will show how to integrate the middleware to your awesome application.
es: Estos pasos mostrarán cómo integrar el middleware a tu impresionante aplicación.
ko: 이 단계는 미들웨어를 멋진 애플리케이션에 통합하는 방법을 보여줍니다.
ru: Эти шаги покажут,как интегрировать промежуточное программное обеспечение в ваше удивительное приложение.
zh_cn: 这些步骤将展示如何将中间件集成到你的真棒应用程序。

source: This project is licensed under the MIT License - see the <a href="https://github.com/jrobichaud/django-structlog/blob/master/LICENSE.rst">LICENSE</a> file for details
es: Este proyecto tiene la licencia del MIT; consulte el archivo <a href="https://github.com/jrobichaud/django-structlog/blob/master/LICENSE.rst">LICENCIA</a> para obtener m&aacute;s detalles
ko: 이 프로젝트는 MIT 라이선스에 따라 사용이 허가되었습니다. 자세한 내용 은 <a href="https://github.com/jrobichaud/django-structlog/blob/master/LICENSE.rst">LICENSE</a> 파일을 참조하세요.
ru: Этот проект под лицензией MIT License - см <a href="https://github.com/jrobichaud/django-structlog/blob/master/LICENSE.rst">ЛИЦЕНЗИИ</a> файл для деталей
zh_cn: 此项目已获得MIT许可证的许可-有关详细信息，请参阅<a href="https://github.com/jrobichaud/django-structlog/blob/master/LICENSE.rst">LICENSE</a>文件

source: Well&hellip; ok
es: Bien ok
ko: 글쎄&hellip; ​​그래
ru: Ладно
zh_cn: 好吧...好

source: With django-structlog and flat_line:
es: Con django-structlog y flat_line:
ko: django-structlog 및 flat_line 사용 :
ru: С django-structlog и flat_line:
zh_cn: 用django-structlog和flat_line。

source: With django-structlog and json
es: Con django-structlog y json
ko: django-structlog 및 json 사용
ru: С джанго-структурным журналом и Джоном.
zh_cn: 使用django-structlog和json。

source: are bound from the request but pertinent log metadata may vary from a project to another.
es: están vinculados a la solicitud,pero los metadatos de registro pertinentes pueden variar de un proyecto a otro.
ko: 요청에서 바인딩되지만 관련 로그 메타 데이터는 프로젝트마다 다를 수 있습니다.
ru: привязаны к запросу,но соответствующие метаданные журнала могут варьироваться от проекта к проекту.
zh_cn: 从请求中绑定,但相关的日志元数据可能因项目而异。

source: django-structlog
ko: 장고 구조체
ru: джанго-структурный журнал

source: django-structlog is a structured logging integration for <a href="https://www.djangoproject.com/">Django</a> project using <a href="https://www.structlog.org/">structlog</a>
es: django-structlog es una integraci&oacute;n de registro estructurado para el proyecto <a href="https://www.djangoproject.com/">Django</a> usando <a href="https://www.structlog.org/">structlog</a>
ko: 장고 - structlog에 대한 구조화 된 로깅 통합되어 <a href="https://www.djangoproject.com/">장고</a> 프로젝트가 사용 <a href="https://www.structlog.org/">structlog을</a>
ru: django-structlog - это интеграция структурированного журнала для проекта <a href="https://www.djangoproject.com/">Django</a> с использованием <a href="https://www.structlog.org/">structlog</a>
zh_cn: django-structlog是使用<a href="https://www.structlog.org/">structlog的</a><a href="https://www.djangoproject.com/">Django</a>项目的结构化日志记录集成

source: in Django.
es: en Django.
ko: 장고에서.
ru: в Джанго.
zh_cn: 在Django中。

source: in your browser.
es: en tu navegador.
ko: 브라우저에서.
ru: в вашем браузере.
zh_cn: 在您的浏览器中。

source: instead of
es: en lugar de
ko: 대신에
ru: вместо
zh_cn: 而不是

source: instead of each logs.
es: en lugar de cada tronco.
ko: 각 로그 대신.
ru: вместо каждого бревна.
zh_cn: 而不是每个日志。

source: is supported by default. But when using it with
es: está soportado por defecto.Pero cuando se usa con
ko: 기본적으로 지원됩니다. 하지만 함께 사용할 때
ru: поддерживается по умолчанию.Но при использовании с
zh_cn: 是默认支持的。但当它与

source: logging
es: registro
ko: 벌채 반출
ru: регистрация
zh_cn: 伐木

source: logs/flat_lines.log
ru: журналы/flat_lines.log

source: logs/json.log
ru: журналы/жжон.журнал

source: request_failed
ru: выполненный запрос
zh_cn: 请求失败

source: request_finished
ru: заявка выполнена
zh_cn: 请求完成

source: request_id
ru: запрос_ид
zh_cn: 请求ID

source: settings.py
ru: настройки.пи
zh_cn: 设置.py

source: structlog
ko: 구조체 로그
ru: структурный журнал
zh_cn: 结构日志

source: user_id
es: ID_de_usuario
ru: идентификатор пользователя
zh_cn: 用户ID

source: will be only be in
es: será sólo estar en
ko: 있을 것입니다
ru: будет только
zh_cn: 只会在

source: and
es: en
ko: 과
zh_cn: そして

source: and the
es: y el
ko: 그리고
