Repository: Yuniorcr/runebook
Catalog: xlf/packages/*/python/django-ya-model-publisher.001.xlf
Languages: ko, ru

source: v0.6.3 - 26.01.2018 - <a href="https://github.com/wearehoods/django-ya-model-publisher/compare/v0.6.2...v0.6.3">compare v0.6.2&hellip;v0.6.3</a>
ko: v0.6.3-26.01.2018- <a href="https://github.com/wearehoods/django-ya-model-publisher/compare/v0.6.2...v0.6.3">비교 v0.6.2&hellip; v0.6.3</a>
ru: v0.6.3 - 26.01.2018 - <a href="https://github.com/wearehoods/django-ya-model-publisher/compare/v0.6.2...v0.6.3">сравнить v0.6.2&hellip; v0.6.3</a>

source: v0.6.4 - 29.01.2018 - <a href="https://github.com/wearehoods/django-ya-model-publisher/compare/v0.6.3...v0.6.4">compare v0.6.3&hellip;v0.6.4</a>
ko: v0.6.4-29.01.2018- <a href="https://github.com/wearehoods/django-ya-model-publisher/compare/v0.6.3...v0.6.4">비교 v0.6.3&hellip; v0.6.4</a>
ru: v0.6.4 - 29.01.2018 - <a href="https://github.com/wearehoods/django-ya-model-publisher/compare/v0.6.3...v0.6.4">сравнить v0.6.3&hellip; v0.6.4</a>

source: v0.6.5 - 30.01.2018 - <a href="https://github.com/wearehoods/django-ya-model-publisher/compare/v0.6.4...v0.6.5">compare v0.6.4&hellip;v0.6.5</a>
ko: v0.6.5-30.01.2018- <a href="https://github.com/wearehoods/django-ya-model-publisher/compare/v0.6.4...v0.6.5">비교 v0.6.4&hellip; v0.6.5</a>
ru: v0.6.5 - 30.01.2018 - <a href="https://github.com/wearehoods/django-ya-model-publisher/compare/v0.6.4...v0.6.5">сравнить v0.6.4&hellip; v0.6.5</a>

source: v0.6.6 - 30.01.2018 - <a href="https://github.com/wearehoods/django-ya-model-publisher/compare/v0.6.5...v0.6.6">compare v0.6.5&hellip;v0.6.6</a>
ko: v0.6.6-30.01.2018- <a href="https://github.com/wearehoods/django-ya-model-publisher/compare/v0.6.5...v0.6.6">비교 v0.6.5&hellip; v0.6.6</a>
ru: v0.6.6 - 30.01.2018 - <a href="https://github.com/wearehoods/django-ya-model-publisher/compare/v0.6.5...v0.6.6">сравнить v0.6.5&hellip; v0.6.6</a>

source: v0.6.7 - 31.01.2018 - <a href="https://github.com/wearehoods/django-ya-model-publisher/compare/v0.6.6...v0.6.7">compare v0.6.6&hellip;v0.6.7</a>
ko: v0.6.7-31.01.2018- <a href="https://github.com/wearehoods/django-ya-model-publisher/compare/v0.6.6...v0.6.7">비교 v0.6.6&hellip; v0.6.7</a>
ru: v0.6.7 - 31.01.2018 - <a href="https://github.com/wearehoods/django-ya-model-publisher/compare/v0.6.6...v0.6.7">сравнить v0.6.6&hellip; v0.6.7</a>

source: v0.6.8 - 01.02.2018 - <a href="https://github.com/wearehoods/django-ya-model-publisher/compare/v0.6.7...v0.6.8">compare v0.6.7&hellip;v0.6.8</a>
ko: v0.6.8-01.02.2018- <a href="https://github.com/wearehoods/django-ya-model-publisher/compare/v0.6.7...v0.6.8">비교 v0.6.7&hellip; v0.6.8</a>
ru: v0.6.8 - 01.02.2018 - <a href="https://github.com/wearehoods/django-ya-model-publisher/compare/v0.6.7...v0.6.8">сравнить v0.6.7&hellip; v0.6.8</a>

source: v0.6.9 - 01.02.2018 - <a href="https://github.com/wearehoods/django-ya-model-publisher/compare/v0.6.8...v0.6.9">compare v0.6.8&hellip;v0.6.9</a>
ko: v0.6.9-01.02.2018- <a href="https://github.com/wearehoods/django-ya-model-publisher/compare/v0.6.8...v0.6.9">비교 v0.6.8&hellip; v0.6.9</a>
ru: v0.6.9 - 01.02.2018 - <a href="https://github.com/wearehoods/django-ya-model-publisher/compare/v0.6.8...v0.6.9">сравнить v0.6.8&hellip; v0.6.9</a>

source: v0.7.0 - 22.02.2018 - <a href="https://github.com/wearehoods/django-ya-model-publisher/compare/v0.6.9...v0.7.0">compare v0.6.9&hellip;v0.7.0</a>
ko: v0.7.0-22.02.2018- <a href="https://github.com/wearehoods/django-ya-model-publisher/compare/v0.6.9...v0.7.0">비교 v0.6.9&hellip; v0.7.0</a>
ru: v0.7.0 - 22.02.2018 - <a href="https://github.com/wearehoods/django-ya-model-publisher/compare/v0.6.9...v0.7.0">сравнить v0.6.9&hellip; v0.7.0</a>

source: The
ko: 그만큼
