Repository: Yuniorcr/runebook
Catalog: xlf/packages/*/python/fbpygif.001.xlf
Languages: es, ja, ko, ru

source: ## Description
es: ## Descripci&oacute;n
ja: ##説明
ko: ## 설명
ru: ## Описание

source: ### How to install
es: ### C&oacute;mo instalar
ja: ＃＃＃ インストールする方法
ko: ### 설치하는 방법
ru: ### Как установить

source: ### How to use
es: ### C&oacute;mo utilizar
ja: ＃＃＃ 使い方
ko: ### 사용하는 방법
ru: ### Как пользоваться

source: ### Tested on
es: ### Probado en
ja: ###テスト済み
ko: ### 테스트
ru: ### Проверено на

source: ### To-do
es: ### Que hacer
ja: ###やること
ko: ### 할 것
ru: ### Сделать

source: #### Features
es: #### Caracteristicas
ja: ＃＃＃＃ 特徴
ko: #### 기능
ru: #### Особенности

source: #### Note
es: #### Nota
ja: ＃＃＃＃ 注意
ko: #### 노트
ru: #### Запись

source: #### Problem domain
es: #### Dominio del problema
ja: ####問題のドメイン
ko: #### 문제 도메인
ru: #### Проблемный домен

source: - Archlinux (No, not with the ARM version on RPi, but the one on a vagrant VM)
es: - Archlinux (No, no con la versi&oacute;n ARM en RPi, sino con la de una VM errante)
ja: --Archlinux（いいえ、RPiのARMバージョンではなく、vagrant VMのバージョン）
ko: -Archlinux (아니요, RPi의 ARM 버전이 아니라 방랑 VM의 버전)
ru: - Archlinux (нет, не с версией ARM на RPi, а с той, что находится на бродячей виртуальной машине)

source: - Latest Raspbian on Raspberry pi 2 B+
es: - &Uacute;ltimo Raspbian en Raspberry pi 2 B +
ja: -Raspberry pi 2 B +の最新のRaspbian
ko: -Raspberry pi 2 B +의 최신 Raspbian
ru: - Последний Raspbian на Raspberry pi 2 B +

source: - Library and script is written for Python &gt;= 3.
es: - La biblioteca y el script est&aacute;n escritos para Python&gt; = 3.
ja: -ライブラリとスクリプトはPython&gt; = 3用に作成されています。
ko: -라이브러리 및 스크립트는 Python&gt; = 3 용으로 작성되었습니다.
ru: - Библиотека и скрипт написаны для Python&gt; = 3.

source: - Ubuntu Mate Xenial on Odroid C2
es: - Ubuntu Mate Xenial en Odroid C2
ja: -OdroidC2上のUbuntuMate Xenial
ko: -Odroid C2의 Ubuntu Mate Xenial
ru: - Ubuntu Mate Xenial на Odroid C2

source: - Utility
es: - utilidad
ja: -ユーティリティ
ko: -유틸리티
ru: - Полезность

source: - Writing directly to frame buffer driver needs superuser priviledge.
es: - Escribir directamente en el controlador del b&uacute;fer de tramas necesita privilegios de superusuario.
ja: -フレームバッファードライバーに直接書き込むには、スーパーユーザー権限が必要です。
ko: -프레임 버퍼 드라이버에 직접 쓰기를하려면 수퍼 유저 권한이 필요합니다.
ru: - Запись непосредственно в драйвер буфера кадра требует прав суперпользователя.

source: - [ ] Add more options to program
es: - [] Agregar m&aacute;s opciones al programa
ja: -[]プログラムにオプションを追加する
ko: -[] 프로그램에 더 많은 옵션 추가
ru: - [] Добавить дополнительные параметры в программу

source: - [ ] Background loading of next animation file to reduce loading delay between them
es: - [] Carga en segundo plano del siguiente archivo de animaci&oacute;n para reducir el retraso de carga entre ellos
ja: -[]次のアニメーションファイルのバックグラウンドロードにより、それらの間のロード遅延を削減します
ko: -[] 다음 애니메이션 파일의 백그라운드 로딩을 ​​통한 로딩 지연 감소
ru: - [] Фоновая загрузка следующего файла анимации для уменьшения задержки загрузки между ними

source: - [ ] Bugfix with wrong ioctl command. `dmesg` shows `bcm2708_fb soc:fb: Unknown ioctl 0x5401`
es: - [] Correcci&oacute;n de error con comando ioctl incorrecto. `dmesg` muestra` bcm2708_fb soc: fb: Unknown ioctl 0x5401`
ja: -[]間違ったioctlコマンドのバグ修正。`dmesg`は` bcm2708_fb soc：fb：Unknown ioctl0x5401`を示しています
ko: -[] 잘못된 ioctl 명령으로 버그 수정. `dmesg`는`bcm2708_fb soc : fb : Unknown ioctl 0x5401`을 표시합니다.
ru: - [] Исправление с неправильной командой ioctl. `dmesg` показывает` bcm2708_fb soc: fb: Unknown ioctl 0x5401`

source: - [ ] Layer support
es: - [] Soporte de capa
ja: -[]レイヤーのサポート
ko: -[] 레이어 지원
ru: - [] Поддержка слоев

source: - [ ] Optimize with setting screen to RGB mode by sending mailbox message (RGB_to_BGR function will be unused)
es: - [] Optimizar con la configuraci&oacute;n de la pantalla en modo RGB enviando un mensaje de buz&oacute;n (la funci&oacute;n RGB_to_BGR no se utilizar&aacute;)
ja: -[]メールボックスメッセージを送信して画面をRGBモードに設定して最適化します（RGB_to_BGR関数は使用されません）
ko: -[] 메일 박스 메시지 전송으로 화면 설정을 RGB 모드로 최적화 (RGB_to_BGR 기능은 사용하지 않음)
ru: - [] Оптимизация экрана настройки в режим RGB путем отправки сообщения почтового ящика (функция RGB_to_BGR не будет использоваться)

source: - [ ] Picture frame
es: - [ ] Marco
ja: - [ ] 額縁
ko: - [ ] 사진 프레임
ru: - [ ] Фоторамка

source: - [ ] Wiki documentation about ioctl and mmap with pure Python.
es: - [] Documentaci&oacute;n wiki sobre ioctl y mmap con Python puro.
ja: -[]純粋なPythonを使用したioctlとmmapに関するWikiドキュメント。
ko: -[] 순수 Python을 사용하는 ioctl 및 mmap에 대한 위키 문서.
ru: - [] Wiki-документация по ioctl и mmap с чистым Python.

source: - [x] Checking Python version
es: - [x] Comprobando la versi&oacute;n de Python
ja: -[x] Pythonバージョンの確認
ko: -[x] Python 버전 확인
ru: - [x] Проверка версии Python

source: - [x] Custom clearing
es: - [x] Compensaci&oacute;n personalizada
ja: -[x]カスタムクリアリング
ko: -[x] 커스텀 클리어링
ru: - [x] Пользовательская очистка

source: - [x] Make installation script
es: - [x] Crear script de instalaci&oacute;n
ja: -[x]インストールスクリプトを作成します
ko: -[x] 설치 스크립트 만들기
ru: - [x] Сделать установочный скрипт

source: - [x] Proper animtation time delay on every frames
es: - [x] Retraso de tiempo de animaci&oacute;n adecuado en cada fotograma
ja: -[x]すべてのフレームでの適切なアニメーション時間遅延
ko: -[x] 모든 프레임에서 적절한 애니메이션 시간 지연
ru: - [x] Правильная задержка времени анимации на каждом кадре

source: - [x] Shuffling
es: - [x] Barajar
ja: -[x]シャッフル
ko: -[x] 셔플
ru: - [x] Перемешивание

source: - [x] Standard argument style launcher
es: - [x] Lanzador de estilo de argumento est&aacute;ndar
ja: -[x]標準の引数スタイルランチャー
ko: -[x] 표준 인수 스타일 실행기
ru: - [x] Средство запуска стандартного стиля аргумента

source: - [x] Upload on PyPi to let it be installable with `pip install`.
es: - [x] Sube a PyPi para que sea instalable con `pip install`.
ja: -[x] PyPiにアップロードして、 `pipinstall`でインストールできるようにします。
ko: -[x] PyPi에 업로드하여`pip install`로 설치할 수 있도록합니다.
ru: - [x] Загрузить в PyPi, чтобы его можно было установить с помощью `pip install`.

source: - `FBpyGIF --help` to see all commands.
es: - `FBpyGIF --help` para ver todos los comandos.
ja: --`FBpyGIF--help`ですべてのコマンドを表示します。
ko: -모든 명령을 보려면`FBpyGIF --help`.
ru: - `FBpyGIF --help`, чтобы увидеть все команды.

source: - `FBpyGIF -ct` will put you into color test mode. (Aware of hypnotising screen ;) )
es: - `FBpyGIF -ct` te pondr&aacute; en modo de prueba de color. (Consciente de la pantalla hipnotizante;))
ja: --`FBpyGIF -ct`は、カラーテストモードになります。（催眠術の画面を認識しています;））
ko: -`FBpyGIF -ct`는 색상 테스트 모드로 들어갑니다. (최면 화면 인식;))
ru: - `FBpyGIF -ct` переведет вас в режим цветового тестирования. (Знает о гипнотизирующем экране;))

source: - `python3 -m FBpyGIF.util size_cat ~/pictures` will categorize pictures based on its sizes and move into folders horizontal, vertical, square under the directory you run it.
es: - `python3 -m FBpyGIF.util size_cat ~ / pictures` categorizar&aacute; las im&aacute;genes en funci&oacute;n de sus tama&ntilde;os y las mover&aacute; a carpetas horizontales, verticales, cuadradas bajo el directorio donde las ejecuta.
ja: --`python3 -m FBpyGIF.util size_cat〜 / pictures`は、サイズに基づいて画像を分類し、実行するディレクトリの下の水平、垂直、正方形のフォルダに移動します。
ko: -`python3 -m FBpyGIF.util size_cat ~ / pictures`는 크기에 따라 사진을 분류하고 실행 한 디렉토리 아래의 수평, 수직, 정사각형 폴더로 이동합니다.
ru: - `python3 -m FBpyGIF.util size_cat ~ / pictures` распределяет изображения по категориям в зависимости от их размеров и перемещает их в папки по горизонтали, вертикали и квадрату под каталогом, в котором он запущен.

source: - option1: use pip
es: - opci&oacute;n 1: usa pip
ja: -オプション1：pipを使用する
ko: -option1 : pip 사용
ru: - option1: использовать pip

source: - option2: use git and setup.py
es: - opci&oacute;n 2: usa git y setup.py
ja: -オプション2：gitとsetup.pyを使用します
ko: -option2 : git 및 setup.py 사용
ru: - option2: используйте git и setup.py

source: - prerequisite for pillow (for fresh raspbian)
es: - requisito previo para la almohada (para raspbian fresco)
ja: -枕の前提条件（新鮮なラズビアン用）
ko: -베개 전제 조건 (신선한 라즈 비안 용)
ru: - предпосылка для подушки (для свежего распбиана)

source: Frame Buffer drawing libray with GIF support for Python3
es: La biblioteca de dibujos de Frame Buffer con soporte GIF para Python3
ja: Python3 で GIF をサポートした Frame Buffer 描画用の libray
ko: Python3에 대한 GIF 지원이 포함 된 프레임 버퍼 그리기 libray
ru: Фрейм-буфер для рисования libray с поддержкой GIF для Python3

source: Pure Python implemented Memory-mapped Frame Buffer mainly for GIF animation on Raspberry pi
es: Pure Python implementó Memory-mapped Frame Buffer principalmente para la animación GIF en Raspberry pi
ja: Pure Pythonは主にRaspberry pi上のGIFアニメーションのためにMemory-maped Frame Bufferを実装しました。
ko: Pure Python은 주로 Raspberry Pi의 GIF 애니메이션을 위해 메모리 매핑 된 프레임 버퍼를 구현했습니다.
ru: В Pure Python реализован буфер кадров с отображением на карте памяти в основном для GIF анимации на малиновых пи

source: Recent Raspberry pi and similar single-board computers which needs efficient way to show image usually uses [fbi](https://www.kraxel.org/blog/linux/fbida/).
es: La reciente Raspberry pi y otras computadoras similares de una sola placa que necesita una forma eficiente de mostrar la imagen suele utilizar [fbi](https://www.kraxel.org/blog/linux/fbida/).
ja: 画像を表示するための効率的な方法を必要とする最近のRaspberry piと同様のシングルボードコンピュータは、通常、[fbi](https://www.kraxel.org/blog/linux/fbida/)を使用しています。
ko: 이미지를 효율적으로 표시해야하는 최근 Raspberry pi 및 유사한 단일 보드 컴퓨터는 일반적으로 [fbi] (https://www.kraxel.org/blog/linux/fbida/)를 사용합니다.
ru: Недавние малиновые пи и аналогичные одноплатные компьютеры,которые нуждаются в эффективном способе отображения изображения обычно используют [fbi](https://www.kraxel.org/blog/linux/fbida/).

source: So I decided to make almost pure Python implemented library that is utilizing frame buffer and memory mapping.
es: Así que decidí hacer una librería implementada en Python casi pura que utiliza un frame buffer y mapeo de memoria.
ja: そこで、フレームバッファとメモリマッピングを活用したほぼ純粋なPython実装のライブラリを作ることにしました。
ko: 그래서 저는 프레임 버퍼와 메모리 매핑을 활용하는 거의 순수한 파이썬 구현 라이브러리를 만들기로 결정했습니다.
ru: Поэтому я решил сделать практически чистую реализованную на Python библиотеку,использующую буфер фреймов и отображение памяти.

source: The only a thing about 'pure' with this library is that it uses PIL library that is default installed python libarary on official Raspbian to convert image formats into raw BGR(A) and is also providing ways to use imagemagick as decompressor.
es: Lo único "puro" de esta librería es que utiliza la librería PIL,que es la librería de pitón instalada por defecto en el Raspbian oficial,para convertir los formatos de imagen en BGR(A)en bruto y también proporciona formas de utilizar imagemagick como descompresor.
ja: このライブラリで「ピュア」なのは、公式RaspbianにデフォルトでインストールされているPython libararyというライブラリを使って画像フォーマットを生のBGR(A)に変換していることと、デコンプレッサーとしてimagemagickを使う方法を提供していることです。
ko: 이 라이브러리의 '순수'에 대한 유일한 점은 공식 Raspbian에 기본 설치된 Python 라이브러리 인 PIL 라이브러리를 사용하여 이미지 형식을 원시 BGR (A)로 변환하고 imagemagick을 압축 해제기로 사용하는 방법을 제공한다는 것입니다.
ru: Единственное,что делает эту библиотеку "чистой"-это то,что она использует библиотеку PIL,которая по умолчанию установлена на официальном Raspbian для преобразования форматов изображений в необработанный BGR(A),а также предоставляет способы использования imagemagick в качестве декомпрессора.

source: There are many documents online how to mmap frame buffer with C, but none of similar are with Python, which also has mmap library by default. Actually there aren't so many examples about Python mmap library either. Hope this code helps you to understand how to ioctl and mmap not only frame buffers but also general Linux drivers with pure Python.
es: Hay muchos documentos en línea sobre cómo hacer mmap frame buffer con C,pero ninguno de ellos es similar con Python,que también tiene la librería mmap por defecto.En realidad tampoco hay tantos ejemplos sobre la biblioteca de mapas de Python.Espero que este código os ayude a entender cómo ioctl y mmap no sólo los frame buffers sino también los controladores generales de Linux con Python puro.
ja: C言語でフレームバッファをmmapする方法はオンライン上にたくさんのドキュメントがありますが、Pythonもデフォルトでmmapライブラリを持っていますので、似たようなものはありません。実際、Python の mmap ライブラリに関する例もあまり多くはありません。このコードがフレームバッファだけでなく、純粋なPythonでioctlとmmapを行う方法を理解するのに役立つことを願っています。
ko: C로 프레임 버퍼를 mmap하는 방법에 대한 온라인 문서가 많이 있지만 Python에는 기본적으로 mmap 라이브러리도있는 유사한 문서가 없습니다. 실제로 Python mmap 라이브러리에 대한 예제도 많지 않습니다. 이 코드가 프레임 버퍼뿐만 아니라 순수한 Python을 사용하는 일반 Linux 드라이버를 ioctl 및 mmap하는 방법을 이해하는 데 도움이되기를 바랍니다.
ru: В сети существует много документов,как использовать буфер фреймов mmap на C,но ни один из них не похож на Python,который также имеет библиотеку mmap по умолчанию.На самом деле не так уж и много примеров использования mmap-библиотеки на Python.Надеюсь,этот код поможет разобраться не только в ioctl и mmap буферах фреймов,но и в общих Linux драйверах с чистым Python.

source: These three are identical.
es: Estos tres son idénticos.
ja: この3つは同じです。
ko: 이 세 가지는 동일합니다.
ru: Эти три идентичны.

source: This pack of C libraries and programs are able to show GIF image properly thorugh direct frame buffer, but in lack of function to play GIF animation files.
es: Este paquete de bibliotecas y programas C son capaces de mostrar la imagen GIF correctamente a través de la memoria de fotogramas directa,pero sin la función de reproducir archivos de animación GIF.
ja: このC言語のライブラリとプログラムのパックは、ダイレクトフレームバッファを通してGIF画像を適切に表示することができますが、GIFアニメーションファイルを再生する機能がありません。
ko: 이 C 라이브러리 및 프로그램 팩은 직접 프레임 버퍼를 통해 GIF 이미지를 제대로 표시 할 수 있지만 GIF ​​애니메이션 파일을 재생하는 기능이 부족합니다.
ru: Этот пакет библиотек и программ на C способен правильно отображать GIF-изображение через буфер прямого кадра,но при этом не имеет функции воспроизведения GIF-анимационных файлов.

source: git clone https://github.com/chidea/FBpyGIF
es: git clon https://github.com/chidea/FBpyGIF
ru: клон гита https://github.com/chidea/FBpyGIF

source: sudo FBpyGIF [directory or file list...]
es: sudo FBpyGIF [directorio o lista de archivos...]
ja: sudo FBpyGIF [ディレクトリまたはファイルリスト...]
ko: sudo FBpyGIF [디렉토리 또는 파일 목록 ...]
ru: sudo FBpyGIF [каталог или список файлов...]

source: sudo apt install git
ru: sudo apt установочный гит

source: sudo apt install libjpeg8-dev libfreetype6-dev libwebp-dev -y
ru: sudo apt установите libjpeg8-dev libfreetype6-dev libwebp-dev -y

source: sudo pip3 install fbpygif
es: sudo pip3 instalar fbpygif
ko: sudo pip3 설치 fbpygif
ru: sudo pipe3 установить fbpygif

source: sudo python3 setup.py install
ko: sudo python3 setup.py 설치
ru: установка sudo python3 setup.py

source: sudo apt install python3-pip
es: sudo apt instalar python3-pip
