Repository: Yuniorcr/runebook
Catalog: xlf/packages/*/python/fontmake.001.xlf
Languages: es, ja, ko, ru

source: --upgrade
es: --potenciar
ja: -アップグレード
ko: --업그레이드
ru: --Обновить

source: After installation, you can use the
es: Después de la instalación,puedes usar el
ja: インストール後は
ko: 설치 후
ru: После установки вы можете использовать

source: Alternatively, you can download the git repository and install from source:
es: Alternativamente,puedes descargar el repositorio de git e instalarlo desde la fuente:
ja: あるいは、git リポジトリをダウンロードしてソースからインストールすることもできます。
ko: 또는 git 저장소를 다운로드하고 소스에서 설치할 수 있습니다.
ru: Кроме того,вы можете загрузить git-репозиторий и установить его из исходников:

source: Compile fonts from sources (UFO, Glyphs) to binary (OpenType, TrueType).
es: Compilar fuentes de fuentes (OVNI,glifos)a binario (OpenType,TrueType).
ja: フォントをソース(UFO、Glyphs)からバイナリ(OpenType、TrueType)にコンパイル。
ko: 소스 (UFO, Glyph)에서 바이너리 (OpenType, TrueType)로 글꼴을 컴파일합니다.
ru: Скомпилируйте шрифты из исходников (UFO,Glyphs)в двоичные (OpenType,TrueType).

source: Developers who want to quickly test changes to the source code without re-installing, can use the &ldquo;&ndash;editable&rdquo; option when installing from a local source checkout:
es: Los desarrolladores que quieran probar r&aacute;pidamente los cambios en el c&oacute;digo fuente sin volver a instalarlos, pueden usar la opci&oacute;n "&ndash;editable" cuando instalen desde una verificaci&oacute;n de origen local:
ja: 再インストールせずにソースコードへの変更をすばやくテストしたい開発者は、ローカルソースチェックアウトからインストールするときに「-編集可能」オプションを使用できます。
ko: 다시 설치하지 않고 소스 코드의 변경 사항을 빠르게 테스트하려는 개발자는 로컬 소스 체크 아웃에서 설치할 때 "&ndash;editable"옵션을 사용할 수 있습니다.
ru: Разработчики, которые хотят быстро протестировать изменения в исходном коде без повторной установки, могут использовать параметр &laquo;&ndash;editable&raquo; при установке из локального источника:

source: Fontmake requires Python 3.6 or later.
es: Fontmake requiere Python 3.6 o posterior.
ja: FontmakeはPython 3.6以降が必要です。
ko: Fontmake는 Python 3.6 이상이 필요합니다.
ru: Фонтмейк требует Python 3.6 или более поздней версии.

source: Installation
es: Instalación
ja: インストール
ko: 설치
ru: Установка

source: It is recommended to install fontmake inside a &ldquo;virtual environment&rdquo; to prevent conflicts between its dependencies and other modules installed globally.
es: Se recomienda instalar fontmake dentro de un "entorno virtual" para evitar conflictos entre sus dependencias y otros m&oacute;dulos instalados globalmente.
ja: fontmakeを「仮想環境」内にインストールして、依存関係とグローバルにインストールされている他のモジュールとの競合を防ぐことをお勧めします。
ko: 종속성과 전역으로 설치된 다른 모듈 간의 충돌을 방지하기 위해 "가상 환경"내에 fontmake를 설치하는 것이 좋습니다.
ru: Рекомендуется установить fontmake внутри &laquo;виртуальной среды&raquo;, чтобы предотвратить конфликты между его зависимостями и другими модулями, установленными глобально.

source: Releases are available on <a href="https://pypi.org/project/fontmake">PyPI</a> and can be installed with <a href="https://pip.pypa.io">pip</a>.
es: Las versiones est&aacute;n disponibles en <a href="https://pypi.org/project/fontmake">PyPI</a> y se pueden instalar con <a href="https://pip.pypa.io">pip</a> .
ja: リリースは、上で使用可能な<a href="https://pypi.org/project/fontmake">は、PyPI</a>と一緒にインストールすることができ<a href="https://pip.pypa.io">ピップ</a>。
ko: 릴리스는 <a href="https://pypi.org/project/fontmake">PyPI</a> 에서 사용할 수 있으며 <a href="https://pip.pypa.io">pip</a> 로 설치할 수 있습니다 .
ru: Релизы доступны на <a href="https://pypi.org/project/fontmake">PyPI</a> и могут быть установлены с помощью <a href="https://pip.pypa.io">pip</a> .

source: This library provides a wrapper for several other Python libraries which together compile fonts from various sources (.glyphs, .ufo) into binaries (.otf, .ttf).
es: Esta biblioteca proporciona un envoltorio para varias otras bibliotecas de Python que juntas compilan fuentes de varias fuentes (.glyphs,.ufo)en binarios (.otf,.ttf).
ja: このライブラリは、様々なソース(.glyphs,.ufo)からのフォントをまとめてバイナリ(.otf,.ttf)にコンパイルする他のいくつかの Python ライブラリのラッパーを提供します。
ko: 이 라이브러리는 다양한 소스 (.glyphs, .ufo)의 글꼴을 바이너리 (.otf, .ttf)로 컴파일하는 여러 다른 Python 라이브러리 용 래퍼를 제공합니다.
ru: Эта библиотека предоставляет обёртку для нескольких других библиотек Python,которые вместе компилируют шрифты из различных исходников (.glyphs,.ufo)в двоичные (.otf,.ttf).

source: Usage
es: Uso
ja: 使用方法
ko: 용법
ru: Использование

source: Use
es: Utilice
ja: 使用方法
ko: 사용하다
ru: Использовать

source: Use the
es: Use el
ja: を使用しています。
ko: 사용
ru: Использовать

source: You can also use fontmake as a module to run intermediate steps in the build process, via methods of the
es: También se puede utilizar fontmake como un módulo para ejecutar pasos intermedios en el proceso de construcción,a través de métodos de la
ja: のメソッドを使って、ビルドプロセスの中間ステップを実行するモジュールとして fontmake を使用することもできます。
ko: 또한 fontmake를 모듈로 사용하여 빌드 프로세스의 중간 단계를 실행할 수 있습니다.
ru: Вы также можете использовать fontmake в качестве модуля для выполнения промежуточных шагов в процессе сборки,с помощью методов

source: You could also use the <a href="https://github.com/pipxproject/pipx">pipx</a> tool to automate the installation/upgrade of python apps like fontmake in isolated environments.
es: Tambi&eacute;n puede utilizar la herramienta <a href="https://github.com/pipxproject/pipx">pipx</a> para automatizar la instalaci&oacute;n / actualizaci&oacute;n de aplicaciones de Python como fontmake en entornos aislados.
ja: <a href="https://github.com/pipxproject/pipx">pipx</a>ツールを使用して、分離された環境でのfontmakeなどのPythonアプリのインストール/アップグレードを自動化することもできます。
ko: <a href="https://github.com/pipxproject/pipx">pipx</a> 도구를 사용하여 격리 된 환경에서 fontmake와 같은 Python 앱의 설치 / 업그레이드를 자동화 할 수도 있습니다 .
ru: Вы также можете использовать инструмент <a href="https://github.com/pipxproject/pipx">pipx</a> для автоматизации установки / обновления приложений Python, таких как fontmake, в изолированных средах.

source: class.
es: clase.
ja: クラスを使用しています。
ko: 수업.
ru: Класс.

source: console script. For example:
es: guión de la consola.Por ejemplo:
ja: コンソールスクリプトを使用します。例えば
ko: 콘솔 스크립트. 예를 들면 :
ru: консольный скрипт.Например:

source: fontmake
ja: フォントメイク
ru: шрифт

source: fontmake -h
ja: フォントメイク -h
ru: фонтмейк

source: option to update fontmake and its dependencies to the newest available release:
es: para actualizar fontmake y sus dependencias a la última versión disponible:
ja: オプションを使用して、fontmakeとその依存関係を最新の利用可能なリリースに更新することができます。
ko: fontmake 및 해당 종속성을 사용 가능한 최신 릴리스로 업데이트하는 옵션 :
ru: возможность обновления fontmake и его зависимостей до новейшего доступного релиза:

source: to see options for specifying different types of input and output.
es: para ver las opciones para especificar los diferentes tipos de entrada y salida.
ja: をクリックすると、異なるタイプの入力と出力を指定するためのオプションが表示されます。
ko: 다양한 유형의 입력 및 출력을 지정하는 옵션을 확인합니다.
ru: чтобы увидеть опции для указания различных типов входа и выхода.

source: -U
ko: -유
