Repository: Yuniorcr/runebook
Catalog: xlf/packages/*/python/futoin-cid.001.xlf
Languages: es, ja, ru

source: <code>./bin/cid check</code> - for static analysis
es: <code>./bin/cid check</code> - para an&aacute;lisis est&aacute;tico
ja: <code>./bin/cid check</code> -静的分析用
ru: <code>./bin/cid check</code> - для статического анализа

source: <code>./bin/cid run autopep8</code> - for code auto-formatting
es: <code>./bin/cid run autopep8</code> - para el formato autom&aacute;tico del c&oacute;digo
ja: <code>./bin/cid run autopep8</code> コードの自動フォーマット用
ru: <code>./bin/cid run autopep8</code> - для автоформатирования кода

source: <code>./tests/run_vagrant_all.sh [optional filters]</code> - to make sure nothing is broken
es: <code>./tests/run_vagrant_all.sh [optional filters]</code> - para asegurarse de que no haya nada roto
ja: <code>./tests/run_vagrant_all.sh [optional filters]</code> -何も壊れていないことを確認します
ru: <code>./tests/run_vagrant_all.sh [optional filters]</code> - чтобы убедиться, что ничего не сломано

source: <em>Note: only occasionally tested due to lack of suitable license</em>
es: <em>Nota: solo probado ocasionalmente debido a la falta de una licencia adecuada</em>
ja: <em>注：適切なライセンスがないため、たまにしかテストされません</em>
ru: <em>Примечание: только время от времени тестируется из-за отсутствия подходящей лицензии</em>

source: <em>Note: please use</em><strong>cid tool list</strong><em>and</em><strong>cid tool describe $tool</strong><em>for details.</em>
es: <em>Nota: utilice la </em><strong>lista de </strong><strong>herramientas cid </strong><em>y la </em><strong>herramienta cid describe $ tool </strong><em>para obtener m&aacute;s detalles.</em>
ja: <em>注：詳細については、</em><strong>cidツールリスト</strong><em>と</em><strong>cidツールdescribe $ tool</strong><em>を</em><strong>使用</strong><em>してください。</em>
ru: <em>Примечание: пожалуйста , используйте </em><strong>чид список инструментов </strong><em>и </em><strong>чид инструмента описание $ инструмента </strong><em>для деталей.</em>

source: <strong>14.04 LTS - Trusty</strong>
es: <strong>14.04 LTS - Confianza</strong>
ja: <strong>14.04LTS-信頼できる</strong>
ru: <strong>14.04 LTS - Надежный</strong>

source: <strong>16.04 LTS - Xenial</strong>
ja: <strong>16.04LTS-ゼニアル</strong>
ru: <strong>16.04 LTS - Ксениал</strong>

source: <strong>17.04 - Zesty</strong>
ja: <strong>17.04-ゼスティ</strong>
ru: <strong>17.04 - Пикантность</strong>

source: <strong>42.2 Leap</strong>
es: <strong>42.2 Salto</strong>
ja: <strong>42.2飛躍</strong>
ru: <strong>42.2 Прыжок</strong>

source: <strong>8 - Jessie</strong>
ja: <strong>8-ジェシー</strong>
ru: <strong>8 - Джесси</strong>

source: <strong>9 - Stretch</strong>
es: <strong>9 - Estirar</strong>
ja: <strong>9-ストレッチ</strong>
ru: <strong>9 - Растяжка</strong>

source: <strong>Other Linux</strong>
es: <strong>Otro Linux</strong>
ja: <strong>その他のLinux</strong>
ru: <strong>Другой Linux</strong>

source: <strong>Please use official documentation at https://futoin.org/docs/cid/</strong>
es: <strong>Utilice la documentaci&oacute;n oficial en https://futoin.org/docs/cid/</strong>
ja: <strong>https://futoin.org/docs/cid/の公式ドキュメントを使用してください</strong>
ru: <strong>Используйте официальную документацию по адресу https://futoin.org/docs/cid/</strong>

source: <strong>Sierra</strong>
ja: <strong>シエラ</strong>
ru: <strong>Сьерра</strong>

source: <strong>ant</strong>
es: <strong>hormiga</strong>
ja: <strong>蟻</strong>
ru: <strong>муравей</strong>

source: <strong>archiva</strong> - supporting non-Maven layout through WebDAV.
es: <strong>archiva</strong> : admite el dise&ntilde;o no Maven a trav&eacute;s de WebDAV.
ja: <strong>archiva</strong> -WebDAVを介して非Mavenレイアウトをサポートします。
ru: <strong>archiva</strong> - поддержка макета, отличного от Maven, через WebDAV.

source: <strong>artifactory</strong> - only Pro version as OSS is very limited for automation.
es: <strong>artefactorio</strong> : solo la versi&oacute;n Pro ya que OSS es muy limitada para la automatizaci&oacute;n.
ja: <strong>アーティファクト</strong>-OSSは自動化に非常に制限されているため、Proバージョンのみ。
ru: <strong>artifactory</strong> - только версия Pro, так как OSS очень ограничен для автоматизации.

source: <strong>aws</strong> - S3 for RMS, and the AWS CLI tool in general
es: <strong>aws</strong> : S3 para RMS y la herramienta AWS CLI en general
ja: <strong>aws</strong> -RMSのS3、および一般的なAWSCLIツール
ru: <strong>aws</strong> - S3 для RMS и инструмент AWS CLI в целом

source: <strong>bower</strong>
es: <strong>cenador</strong>
ja: <strong>バウアー</strong>
ru: <strong>беседка</strong>

source: <strong>bundler</strong>
es: <strong>empaquetadora</strong>
ja: <strong>バンドラー</strong>
ru: <strong>упаковщик</strong>

source: <strong>cargo</strong>
es: <strong>carga</strong>
ja: <strong>貨物</strong>
ru: <strong>груз</strong>

source: <strong>cid</strong> is written in commonly available Python language supporting both Python versions 2.7 and 3+.
es: <strong>cid</strong> est&aacute; escrito en lenguaje Python com&uacute;nmente disponible y es compatible con las versiones 2.7 y 3+ de Python.
ja: <strong>cid</strong>は、Pythonバージョン2.7と3以降の両方をサポートする一般的に利用可能なPython言語で記述されています。
ru: <strong>cid</strong> написан на общедоступном языке Python, поддерживающем версии Python 2.7 и 3+.

source: <strong>composer</strong>
es: <strong>compositor</strong>
ja: <strong>作曲</strong>
ru: <strong>композитор</strong>

source: <strong>docker-compose</strong>
ru: <strong>докер-сочинять</strong>

source: <strong>docker</strong>
es: <strong>estibador</strong>
ru: <strong>докер</strong>

source: <strong>elixir</strong>
ja: <strong>エリクサー</strong>
ru: <strong>эликсир</strong>

source: <strong>erlang</strong>
ru: <strong>эрланг</strong>

source: <strong>flyway</strong>
es: <strong>ruta migratoria</strong>
ja: <strong>フライウェイ</strong>
ru: <strong>пролетный путь</strong>

source: <strong>gem</strong>
es: <strong>joya</strong>
ja: <strong>宝石</strong>
ru: <strong>самоцвет</strong>

source: <strong>go</strong>
es: <strong>Vamos</strong>
ja: <strong>行く</strong>
ru: <strong>идти</strong>

source: <strong>grunt</strong>
es: <strong>gru&ntilde;ido</strong>
ja: <strong>うなり声</strong>
ru: <strong>ворчать</strong>

source: <strong>gulp</strong>
es: <strong>trago</strong>
ru: <strong>глоток</strong>

source: <strong>java</strong> for runtime (uses Zulu JDK unless overridden)
es: <strong>java</strong> para tiempo de ejecuci&oacute;n (usa Zulu JDK a menos que se anule)
ja: <strong></strong>ランタイム用の<strong>Java</strong>（オーバーライドされない限りZulu JDKを使用）
ru: <strong>java</strong> для среды выполнения (использует Zulu JDK, если не переопределено)

source: <strong>jdk</strong> for development (uses Zulu JDK unless overridden)
es: <strong>jdk</strong> para desarrollo (usa Zulu JDK a menos que se anule)
ja: <strong></strong>開発用の<strong>jdk</strong>（オーバーライドされない限りZulu JDKを使用）
ru: <strong>jdk</strong> для разработки (использует Zulu JDK, если не переопределено)

source: <strong>jfrog</strong> - JFrog CLI
es: <strong>jfrog</strong> - CLI de JFrog
ru: <strong>jfrog</strong> - интерфейс командной строки JFrog

source: <strong>liquibase</strong>
ru: <strong>ликвибаза</strong>

source: <strong>make</strong>
es: <strong>hacer</strong>
ja: <strong>作る</strong>
ru: <strong>сделать</strong>

source: <strong>mix</strong>
es: <strong>mezcla</strong>
ja: <strong>ミックス</strong>
ru: <strong>смешивание</strong>

source: <strong>nexus</strong> - only v2 as v3 lacks complete REST API yet.
es: <strong>nexus</strong> : solo v2 ya que v3 a&uacute;n carece de API REST completa.
ja: <strong>nexus</strong> -v3にはまだ完全なRESTAPIがないため、v2のみ。
ru: <strong>nexus</strong> - только v2, так как v3 еще не имеет полного REST API.

source: <strong>nginx</strong> - true web server for development, testing &amp; production
es: <strong>nginx</strong> : verdadero servidor web para desarrollo, pruebas y producci&oacute;n
ja: <strong>nginx-</strong>開発、テスト、本番用の真のWebサーバー
ru: <strong>nginx</strong> - настоящий веб-сервер для разработки, тестирования и производства

source: <strong>node</strong>
es: <strong>nodo</strong>
ja: <strong>ノード</strong>
ru: <strong>узел</strong>

source: <strong>nvm</strong> (implicit)
es: <strong>nvm</strong> (impl&iacute;cito)
ja: <strong>nvm</strong>（暗黙的）
ru: <strong>nvm</strong> (неявный)

source: <strong>phoenix</strong>
es: <strong>f&eacute;nix</strong>
ja: <strong>フェニックス</strong>
ru: <strong>Феникс</strong>

source: <strong>php-build</strong> (implicit)
es: <strong>php-build</strong> (impl&iacute;cito)
ja: <strong>php-build</strong>（暗黙的）
ru: <strong>php-build</strong> (неявный)

source: <strong>php</strong> - system, php-build supported and binary builds (Sury, SCL)
es: <strong>php</strong> : compilaciones binarias y compatibles con php-build (Sury, SCL)
ja: <strong>php-</strong>システム、php-buildがサポートされ、バイナリビルド（Sury、SCL）
ru: <strong>php</strong> - система, поддерживаемые сборки php и бинарные сборки (Sury, SCL)

source: <strong>pip</strong>
es: <strong>pepita</strong>
ja: <strong>ピップ</strong>
ru: <strong>пип</strong>

source: <strong>puma</strong> - to run application behind nginx (or other web server)
es: <strong>puma</strong> : para ejecutar la aplicaci&oacute;n detr&aacute;s de nginx (u otro servidor web)
ja: <strong>puma</strong> -nginx（または他のWebサーバー）の背後でアプリケーションを実行する
ru: <strong>puma</strong> - для запуска приложения за nginx (или другим веб-сервером)

source: <strong>python</strong> - system 2 &amp; 3
es: <strong>python</strong> - sistema 2 y 3
ja: <strong>python-</strong>システム2＆3
ru: <strong>python</strong> - система 2 и 3

source: <strong>ruby</strong> - system, rvm supported and binary builds (Brightbox, SCL)
es: <strong>ruby</strong> - sistema, rvm soportado y compilaciones binarias (Brightbox, SCL)
ja: <strong>ルビー</strong>-システム、RVMは、サポートされているとバイナリ（Brightbox、SCL）を構築します
ru: <strong>ruby</strong> - системные, поддерживаемые rvm и бинарные сборки (Brightbox, SCL)

source: <strong>rust</strong>
es: <strong>oxido</strong>
ja: <strong>さび</strong>
ru: <strong>ржавчина</strong>

source: <strong>rustup</strong>
es: <strong>oxidaci&oacute;n</strong>
ja: <strong>錆びた</strong>
ru: <strong>ржавчина</strong>

source: <strong>rvm</strong> (implicit)
es: <strong>rvm</strong> (impl&iacute;cito)
ja: <strong>rvm</strong>（暗黙的）
ru: <strong>rvm</strong> (неявный)

source: <strong>sbt</strong> - Simple Build Tools for Scala
es: <strong>sbt</strong> - Herramientas de construcci&oacute;n simples para Scala
ja: <strong>sbt</strong> -Scala用のシンプルなビルドツール
ru: <strong>sbt</strong> - Простые инструменты сборки для Scala

source: <strong>scp</strong> - SSH-based secure copy.
es: <strong>scp</strong> : copia segura basada en SSH.
ja: <strong>scp</strong> -SSHベースのセキュアコピー。
ru: <strong>scp</strong> - защищенная копия на основе SSH.

source: <strong>sdkman</strong> for SDK management (besides JRE &amp; JDK)
es: <strong>sdkman</strong> para la gesti&oacute;n de SDK (adem&aacute;s de JRE y JDK)
ja: <strong></strong>SDK管理用の<strong>sdkman</strong>（JREおよびJDK以外）
ru: <strong>sdkman</strong> для управления SDK (помимо JRE и JDK)

source: <strong>svn</strong> - Subversion is quite suitable for Production release builds, but please <strong>avoid using it for snapshots</strong>.
es: <strong>svn</strong> - Subversion es bastante adecuado para versiones de producci&oacute;n, pero <strong>evite usarlo para instant&aacute;neas</strong> .
ja: <strong>svn</strong> -Subversionは本番リリースのビルドに非常に適し<strong>ていますが、スナップショットには使用しないで</strong>ください。
ru: <strong>svn</strong> - Subversion вполне подходит для производственных сборок, но, пожалуйста, <strong>не используйте ее для создания снимков</strong> .

source: <strong>twine</strong> - Upload only to Python Package Index.
es: <strong>twine</strong> : carga solo en el &iacute;ndice de paquetes de Python.
ja: <strong>ひも-PythonPackageIndexに</strong>のみアップロードします。
ru: <strong>шпагат</strong> - загружать только в указатель пакетов Python.

source: <strong>twine</strong> - as limited RMS tool
es: <strong>cordel</strong> - como herramienta RMS limitada
ja: <strong>ひも</strong>-限定されたRMSツールとして
ru: <strong>шпагат</strong> - как инструмент с ограниченным RMS

source: <strong>uwsgi</strong> - to run application behind nginx (or other web server)
es: <strong>uwsgi</strong> : para ejecutar la aplicaci&oacute;n detr&aacute;s de nginx (u otro servidor web)
ja: <strong>uwsgi</strong> -nginx（または他のWebサーバー）の背後でアプリケーションを実行します
ru: <strong>uwsgi</strong> - для запуска приложения за nginx (или другим веб-сервером)

source: <strong>virtualenv</strong>, venv is ignored due to issues with <em>ensurepip</em> package
es: <strong>virtualenv</strong> , venv se ignora debido a problemas con el paquete <em>asegurarpip</em>
ja: <strong>virtualenv</strong>、venvは<em>ensurepip</em>パッケージの問題のため無視されます
ru: <strong>virtualenv</strong> , venv игнорируется из-за проблем с пакетом <em>surepip</em>

source: <strong>yarn</strong> - uses npm for own install, but disables one for processing
es: <strong>yarn</strong> : usa npm para su propia instalaci&oacute;n, pero deshabilita uno para el procesamiento
ja: <strong>ヤーン</strong>-独自のインストールにnpmを使用しますが、処理にはnpmを無効にします
ru: <strong>yarn</strong> - использует npm для собственной установки, но отключает одну для обработки

source: A convenient OS-agnostic way is to do it this way:
es: Una forma conveniente de OS-agnóstico es hacerlo de esta manera:
ja: OSにとらわれない便利な方法は、このようにすることです。
ru: Удобный способ диагностики ОС-это сделать это таким образом:

source: A reference secure integration into provisioning system can be found here: <a href="https://github.com/codingfuture/puppet-cfweb">https://github.com/codingfuture/puppet-cfweb</a>
es: Puede encontrar una integraci&oacute;n segura de referencia en el sistema de aprovisionamiento aqu&iacute;: <a href="https://github.com/codingfuture/puppet-cfweb">https://github.com/codingfuture/puppet-cfweb</a>
ja: プロビジョニングシステムへの安全な統合のリファレンスは、<a href="https://github.com/codingfuture/puppet-cfweb">https</a>：//github.com/codingfuture/puppet-cfwebにあります。
ru: Эталонную безопасную интеграцию в систему подготовки можно найти здесь: <a href="https://github.com/codingfuture/puppet-cfweb">https://github.com/codingfuture/puppet-cfweb</a>

source: Always tested in standard cycle.
es: Siempre probado en el ciclo estándar.
ja: 常に標準サイクルでテストされています。
ru: Всегда проверено в стандартном цикле.

source: Another production approach is create a special user account e.g. &ldquo;futoin&rdquo; which has sudo capabilities and allow all other users to sudo-run a special callback file configured through <code>.env.externalSetup</code> option in global /etc/futoin/futoin.json. Callback example: <a href="https://github.com/codingfuture/puppet-cfweb/blob/master/files/cf_cid_callback.sh">https://github.com/codingfuture/puppet-cfweb/blob/master/files/cf_cid_callback.sh</a>
es: Otro enfoque de producci&oacute;n es crear una cuenta de usuario especial, por ejemplo, "futoin", que tiene capacidades sudo y permite a todos los dem&aacute;s usuarios ejecutar sudo-ejecutar un archivo de devoluci&oacute;n de llamada especial configurado a trav&eacute;s de la opci&oacute;n <code>.env.externalSetup</code> en /etc/futoin/futoin.json global. Ejemplo de devoluci&oacute;n de llamada: <a href="https://github.com/codingfuture/puppet-cfweb/blob/master/files/cf_cid_callback.sh">https://github.com/codingfuture/puppet-cfweb/blob/master/files/cf_cid_callback.sh</a>
ja: 別の本番環境のアプローチは、sudo機能を持つ「futoin」などの特別なユーザーアカウントを作成し、他のすべてのユーザーがグローバル/etc/futoin/futoin.jsonの <code>.env.externalSetup</code> オプションで構成された特別なコールバックファイルをsudoで実行できるようにすることです。コールバックの例：<a href="https://github.com/codingfuture/puppet-cfweb/blob/master/files/cf_cid_callback.sh">https</a>：//github.com/codingfuture/puppet-cfweb/blob/master/files/cf_cid_callback.sh
ru: Другой производственный подход - создать специальную учетную запись пользователя, например, &laquo;futoin&raquo;, которая имеет возможности sudo и позволяет всем другим пользователям запускать с помощью sudo специальный файл обратного вызова, настроенный с помощью параметра <code>.env.externalSetup</code> в глобальном /etc/futoin/futoin.json. Пример обратного вызова: <a href="https://github.com/codingfuture/puppet-cfweb/blob/master/files/cf_cid_callback.sh">https://github.com/codingfuture/puppet-cfweb/blob/master/files/cf_cid_callback.sh</a>

source: As alternative, you can set <code>export CID_INTERACTIVE_SUDO=1</code> environment variable to run <code>sudo</code> in interactive mode. It is disabled by default to avoid hanging in unattended use.
es: Como alternativa, puede configurar la variable de entorno <code>export CID_INTERACTIVE_SUDO=1</code> para ejecutar <code>sudo</code> en modo interactivo. Est&aacute; deshabilitado de forma predeterminada para evitar que se cuelgue en un uso desatendido.
ja: 別の方法として、 <code>export CID_INTERACTIVE_SUDO=1</code> 環境変数を設定して、 <code>sudo</code> をインタラクティブモードで実行することもできます。無人使用でハングアップしないように、デフォルトでは無効になっています。
ru: В качестве альтернативы вы можете установить переменную среды <code>export CID_INTERACTIVE_SUDO=1</code> для запуска <code>sudo</code> в интерактивном режиме. По умолчанию он отключен, чтобы избежать зависания при использовании без присмотра.

source: Automatic detection &amp; setup of all tool dependencies
es: Detecci&oacute;n y configuraci&oacute;n autom&aacute;tica de todas las dependencias de herramientas
ja: すべてのツールの依存関係の自動検出とセットアップ
ru: Автоматическое определение и настройка всех зависимостей инструментов

source: Container-friendly
es: Contenedor de fácil manejo
ja: コンテナにやさしい
ru: Контейнеры

source: Development
es: Desarrollo
ja: 開発の様子
ru: Разработка

source: Easily extendable &amp; portable
es: F&aacute;cilmente extensible y port&aacute;til
ja: 簡単に拡張可能でポータブル
ru: Легко расширяемый и портативный

source: Easy integration with provisioning systems with centralized tool setup
es: Fácil integración con los sistemas de aprovisionamiento con configuración centralizada de herramientas
ja: ツール設定を一元化したプロビジョニングシステムとの統合が容易
ru: Простая интеграция с системами резервирования с централизованной настройкой инструментов

source: Features
es: Características
ja: 特徴
ru: Особенности

source: Fine tune of all aspects
es: Ajuste fino de todos los aspectos
ja: あらゆる面の微調整
ru: Тонкая настройка всех аспектов

source: For best user experience, it&rsquo;s suggested to allow system package installation (only) through sudo without password. It should minimize impact on security.
es: Para una mejor experiencia de usuario, se sugiere permitir la instalaci&oacute;n del paquete del sistema (solo) a trav&eacute;s de sudo sin contrase&ntilde;a. Deber&iacute;a minimizar el impacto en la seguridad.
ja: 最高のユーザーエクスペリエンスを得るには、パスワードなしでsudoを介してシステムパッケージのインストール（のみ）を許可することをお勧めします。セキュリティへの影響を最小限に抑える必要があります。
ru: Для удобства пользователей рекомендуется разрешить установку системных пакетов (только) через sudo без пароля. Это должно минимизировать влияние на безопасность.

source: FutoIn Continuous Integration & Delivery Tool
es: Herramienta de entrega e integraci&oacute;n continua FutoIn
ja: FutoIn継続的インテグレーションおよびデリバリーツール
ru: Инструмент непрерывной интеграции и доставки FutoIn

source: If pip is not available then it&rsquo;s strongly suggested to install one first:
es: Si pip no est&aacute; disponible, se recomienda encarecidamente instalar uno primero:
ja: pipが利用できない場合は、最初にpipをインストールすることを強くお勧めします。
ru: Если pip недоступен, настоятельно рекомендуется сначала установить его:

source: Intelligent automation of human-like behavior
es: Automatización inteligente del comportamiento humano
ja: 人間らしい行動の知的自動化
ru: Интеллектуальная автоматизация человекоподобного поведения

source: Intro
ja: イントロ
ru: Введение

source: Multiple entry points per project
es: Múltiples puntos de entrada por proyecto
ja: プロジェクトごとに複数のエントリーポイント
ru: Несколько точек входа в проект

source: NOT tested in standard test cycle as JFrog did not provide license for development.
es: NO se ha probado en el ciclo de pruebas estándar ya que JFrog no proporcionó la licencia para el desarrollo.
ja: JFrogが開発ライセンスを提供していなかったため、標準テストサイクルではテストされていません。
ru: НЕ тестировалась в стандартном цикле тестирования,так как JFrog не предоставляла лицензию на разработку.

source: Nexus v3 - after sane REST API is implemented.
es: Nexus v3-después de que se implemente el REST API.
ja: Nexus v3-正気のREST APIが実装された後。
ru: Nexus v3-после реализации здравого REST API.

source: Not implemented, but planned:
es: No se ha implementado,sino que se ha planeado:
ja: 実施はしていないが、計画的に実施している。
ru: Не выполнено,но запланировано:

source: Notes for contributing:
es: Notas para contribuir:
ja: 投稿時の注意事項。
ru: Примечания за вклад:

source: One obvious drawback is management of package trusted signing keys. It can be disabled. Then please run the following command instead:
es: Una desventaja obvia es el manejo de las claves de firma del paquete de confianza.Puede ser desactivado.Entonces,por favor,ejecuta el siguiente comando en su lugar:
ja: 明らかな欠点は、パッケージの信頼された署名鍵の管理です。これは無効にすることができます。その場合は、以下のコマンドを実行してください。
ru: Одним из очевидных недостатков является управление ключами доверительного подписания пакетов.Его можно отключить.Тогда,пожалуйста,выполните следующую команду:

source: Promotion between repos is not supported.
es: No se apoya la promoción entre los repositorios.
ja: レポ間のプロモーションはサポートされていません。
ru: Промотирование между репозиториями не поддерживается.

source: Resource limit auto-detection &amp; distribution
es: Autodetecci&oacute;n y distribuci&oacute;n de l&iacute;mites de recursos
ja: リソース制限の自動検出と配布
ru: Автоматическое определение и распределение лимита ресурсов

source: Rolling deployments with zero downtime
es: Despliegues de rodaje con cero tiempo de inactividad
ja: ダウンタイムゼロのローリング展開
ru: Прокатное развертывание с нулевым временем простоя

source: Run the following:
es: Haz lo siguiente:
ja: 以下を実行してください。
ru: Запустите следующее:

source: Setup
es: Configuración
ja: セットアップ
ru: Настройка

source: Single tool for development, testing and production
es: Un solo instrumento para el desarrollo,el ensayo y la producción
ja: 開発、テスト、生産のための単一ツール
ru: Единый инструмент для разработки,тестирования и производства

source: Supported Release Management Systems (RMS):
es: Sistemas de Gestión de Liberación Soportados (RMS):
ja: サポートされているリリース管理システム(RMS)。
ru: Поддерживаемые системы управления выпуском (RMS):

source: Supported Version Control Systems(VCS):
es: Sistemas de control de versiones soportados (VCS):
ja: バージョン管理システム(VCS)に対応しています。
ru: Поддерживаемые системы контроля версий (VCS):

source: Supported technologies &amp; tools (so far):
es: Tecnolog&iacute;as y herramientas compatibles (hasta ahora):
ja: サポートされているテクノロジーとツール（これまでのところ）：
ru: Поддерживаемые технологии и инструменты (пока):

source: Technology-neutral
es: Tecnológicamente neutro
ja: 技術的に中立
ru: Технологически нейтральный

source: Tested on the following OSes:
es: Probado en los siguientes sistemas operativos:
ja: 以下のOSでテストしました。
ru: Протестировано на следующих операционных системах:

source: The tool has reached its major milestone for Continuous Delivery case and use at all stages: local development env, staging and production.
es: El instrumento ha alcanzado su principal hito en lo que respecta al caso de la entrega continua y su utilización en todas las etapas:entorno de desarrollo local,puesta en escena y producción.
ja: このツールは、Continuous Deliveryのケースと使用のための主要なマイルストーンに達しています:ローカル開発環境、ステージング、生産のすべての段階で。
ru: Инструмент достиг своего важного рубежа в деле непрерывной поставки и использования на всех этапах:местное развитие,постановка и производство.

source: There are known incompatibilities with glibc-based binaries.
es: Se sabe que hay incompatibilidades con los binarios basados en glibc.
ja: glibc ベースのバイナリには非互換性があることが知られています。
ru: Существуют известные несовместимости с двоичными файлами на основе glibc.

source: There are known issues with some tools due to lack of community support.
es: Hay problemas conocidos con algunas herramientas debido a la falta de apoyo de la comunidad.
ja: コミュニティのサポートが不足しているため、一部のツールには既知の問題があります。
ru: Известны проблемы с некоторыми инструментами из-за отсутствия поддержки со стороны общин.
