Repository: Yuniorcr/runebook
Catalog: xlf/packages/*/python/futoin-cid.001.xlf
Languages: es, ja, ru

source: There are many continuous integration &amp; delivery tools, but they are primarily targeted at own infrastructure. The demand for a new meta-tool is to merge many operations of different technologies like npm, composer, bundler, nvm, rvm, php-build and others under a single tool for runtime setup, project development, build, deployment and running.
es: Hay muchas herramientas de integraci&oacute;n y entrega continuas, pero est&aacute;n dirigidas principalmente a la propia infraestructura. La demanda de una nueva metaherramienta es fusionar muchas operaciones de diferentes tecnolog&iacute;as como npm, composer, bundler, nvm, rvm, php-build y otras en una sola herramienta para la configuraci&oacute;n del tiempo de ejecuci&oacute;n, desarrollo de proyectos, compilaci&oacute;n, implementaci&oacute;n y ejecuci&oacute;n.
ja: 多くの継続的インテグレーションおよびデリバリーツールがありますが、それらは主に独自のインフラストラクチャを対象としています。新しいメタツールの需要は、ランタイムセットアップ、プロジェクト開発、ビルド、デプロイ、実行のための単一のツールの下で、npm、composer、bundle、nvm、rvm、php-buildなどのさまざまなテクノロジーの多くの操作をマージすることです。
ru: Существует множество инструментов непрерывной интеграции и доставки, но они в первую очередь ориентированы на собственную инфраструктуру. Спрос на новый метаинструмент состоит в том, чтобы объединить множество операций с различными технологиями, такими как npm, composer, bundler, nvm, rvm, php-build и другие, в одном инструменте для настройки среды выполнения, разработки проекта, сборки, развертывания и запуска.

source: There is a strong concept and several evolutions passed across years. Therere still major milestones planned. The tool can be extended with additional technology support either through custom plugins or directly in main source tree.
es: Hay un concepto fuerte y varias evoluciones que han pasado a través de los años.Todavía hay grandes hitos planeados.La herramienta puede ser ampliada con soporte tecnológico adicional,ya sea a través de plugins personalizados o directamente en el árbol de fuentes principales.
ja: 強力なコンセプトがあり、何年にもわたっていくつかの進化を遂げてきました。まだ主要なマイルストーンが計画されています。このツールは、カスタムプラグインを介して、またはメインのソースツリーに直接、追加の技術サポートで拡張することができます。
ru: Существует сильная концепция и несколько эволюций,прошедших через несколько лет.Все еще запланированы важные вехи.Инструмент может быть расширен за счет дополнительной технологической поддержки либо через пользовательские плагины,либо непосредственно в главном дереве исходных текстов.

source: Well&hellip; CID does support emerge, but you are on your own here ;) Not included in standard test cycle.
es: Bueno ... CID admite emerge, pero aqu&iacute; est&aacute; usted solo;) No incluido en el ciclo de prueba est&aacute;ndar.
ja: ええと&hellip;CIDはemergeをサポートしますが、ここではあなた自身です;）標準のテストサイクルには含まれていません。
ru: Что ж&hellip; Поддержка CID действительно появляется, но вы здесь сами по себе;) Не входит в стандартный цикл тестирования.

source: it should work without issues, if system packages are installed manually.
es: debería funcionar sin problemas,si los paquetes del sistema se instalan manualmente.
ja: システムパッケージが手動でインストールされていれば問題なく動作するはずです。
ru: он должен работать без проблем,если системные пакеты устанавливаются вручную.

source: latest
es: último
ja: さいしん
ru: последний сайт

source: <strong>Git</strong>
ja: <strong>ギット</strong>

source: <strong>macOS</strong>
ja: <strong>マックOS</strong>

source: <strong>Subversion</strong>
es: <strong>Subversi&oacute;n</strong>

source: <strong>cmake</strong>
es: <strong>hacer</strong>

source: <strong>webpack</strong>
es: <strong>paquete web</strong>
