Repository: Yuniorcr/runebook
Catalog: xlf/packages/*/python/hypothesmith.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: <a href="https://bugs.python.org/issue38953">BPO-38953</a><code>tokenize</code> -&gt; <code>untokenize</code> roundtrip bugs.
es: <a href="https://bugs.python.org/issue38953">BPO-38953 </a> <code>tokenize</code> -&gt; <code>untokenize</code> errores de ida y vuelta.
ja: <a href="https://bugs.python.org/issue38953">BPO-38953</a> <code>tokenize</code> -&gt; <code>untokenize</code> トリップバグのトークン化を解除します。
ko: <a href="https://bugs.python.org/issue38953">BPO-38953 </a> <code>tokenize</code> -&gt; <code>untokenize</code> 왕복 버그.
ru: <a href="https://bugs.python.org/issue38953">BPO-38953 </a> <code>tokenize</code> -&gt; <code>untokenize</code> ошибки туда и обратно.
zh_cn: <a href="https://bugs.python.org/issue38953">BPO-38953</a> <code>tokenize</code> - &gt; <code>untokenize</code> 往返错误。

source: <a href="https://bugs.python.org/issue40661">BPO-40661, a segfault in the new parser</a>, was given maximum priority and blocked the planned release of CPython 3.9 beta1.
es: <a href="https://bugs.python.org/issue40661">BPO-40661, un error de segmento en el nuevo analizador</a> , recibi&oacute; la m&aacute;xima prioridad y bloque&oacute; el lanzamiento planificado de CPython 3.9 beta1.
ja: <a href="https://bugs.python.org/issue40661">新しいパーサーのセグメンテーション違反であるBPO-40661に</a>最大の優先順位が与えられ、CPython 3.9beta1の計画されたリリースがブロックされました。
ko: <a href="https://bugs.python.org/issue40661">새로운 파서의 segfault 인 BPO-40661</a> 은 최대 우선 순위를 부여 받았으며 계획된 CPython 3.9 beta1 릴리스를 차단했습니다.
ru: <a href="https://bugs.python.org/issue40661">BPO-40661, segfault в новом синтаксическом анализаторе</a> , получил максимальный приоритет и заблокировал запланированный выпуск CPython 3.9 beta1.
zh_cn: <a href="https://bugs.python.org/issue40661">BPO-40661是新解析器中的段错误</a>，具有最高优先级，并阻止了计划中的CPython 3.9 beta1版本的发布。

source: <a href="https://github.com/Instagram/LibCST#acknowledgements">At least three round-trip bugs in LibCST</a> (search commits for "hypothesis")
es: <a href="https://github.com/Instagram/LibCST#acknowledgements">Al menos tres errores de ida y vuelta en LibCST</a> (la b&uacute;squeda se confirma para "hip&oacute;tesis")
ja: <a href="https://github.com/Instagram/LibCST#acknowledgements">LibCSTの少なくとも3つのラウンドトリップバグ</a> （「仮説」の検索コミット）
ko: <a href="https://github.com/Instagram/LibCST#acknowledgements">LibCST에서 최소 3 개의 왕복 버그</a> ( "가설"에 대한 검색 커밋)
ru: <a href="https://github.com/Instagram/LibCST#acknowledgements">По крайней мере, три ошибки в LibCST</a> (поиск совершает "гипотезу")
zh_cn: <a href="https://github.com/Instagram/LibCST#acknowledgements">LibCST中至少有三个往返错误</a> （搜索提交&ldquo;假设&rdquo;）

source: <code>lib2to3</code> errors on \r in comment
es: <code>lib2to3</code> errores lib2to3 en \ r en el comentario
ja: <code>lib2to3</code> コメントの\ rでのlib2to3エラー
ko: <code>lib2to3</code> 주석의 \ r에 대한 lib2to3 오류
ru: <code>lib2to3</code> Ошибки lib2to3 на \ r в комментарии
zh_cn: <code>lib2to3</code> \ r中的lib2to3错误

source: Black fails on files ending in a backslash
es: El negro falla en los archivos que terminan en una barra invertida
ja: バックスラッシュで終わるファイルでは黒に失敗する
ko: 백 슬래시로 끝나는 파일에서 검정 실패
ru: Черный цвет не работает в файлах,заканчивающихся на обратном слеше.
zh_cn: 在以反斜杠结尾的文件上出现黑色故障。

source: Changelog
ja: 変更履歴
ko: 변경 로그
ru: Блог изменений
zh_cn: 变更日志

source: DO NOT EXECUTE CODE GENERATED BY THESE STRATEGIES.
es: NO EJECUTAN EL CÓDIGO GENERADO POR ESTAS ESTRATEGIAS.
ja: これらの戦略によって生成されたコードを実行しないでください。
ko: 이러한 전략에 의해 생성 된 코드를 실행하지 마십시오.
ru: НЕ ВЫПОЛНЯЙТЕ КОД,СГЕНЕРИРОВАННЫЙ ЭТИМИ СТРАТЕГИЯМИ.
zh_cn: 不要执行这些策略产生的代码。

source: Generates syntactically-valid Python source code based on the grammar.
es: Genera un código fuente Python sintácticamente válido basado en la gramática.
ja: 文法に基づいて構文的に妥当なPythonソースコードを生成します。
ko: 문법을 기반으로 구문 상 유효한 Python 소스 코드를 생성합니다.
ru: Генерирует синтаксически достоверный исходный код Python,основанный на грамматике.
zh_cn: 基于语法生成语法有效的Python源代码。

source: Generates syntactically-valid Python source code based on the node types defined by the <a href="https://libcst.readthedocs.io/en/latest/"><code>LibCST</code></a> project.
es: Genera c&oacute;digo fuente de Python sint&aacute;cticamente v&aacute;lido basado en los tipos de nodo definidos por el proyecto <a href="https://libcst.readthedocs.io/en/latest/"> <code>LibCST</code> </a> .
ja: <a href="https://libcst.readthedocs.io/en/latest/"> <code>LibCST</code> </a>プロジェクトで定義されたノードタイプに基づいて、構文的に有効なPythonソースコードを生成します。
ko: <a href="https://libcst.readthedocs.io/en/latest/"> <code>LibCST</code> </a> 프로젝트에서 정의한 노드 유형을 기반으로 구문 상 유효한 Python 소스 코드를 생성합니다 .
ru: Создает синтаксически допустимый исходный код Python на основе типов узлов, определенных проектом <a href="https://libcst.readthedocs.io/en/latest/"> <code>LibCST</code> </a> .
zh_cn: 根据<a href="https://libcst.readthedocs.io/en/latest/"> <code>LibCST</code> </a>项目定义的节点类型，生成语法上有效的Python源代码。

source: Get it today with <a href="https://pypi.org/project/hypothesmith/"><code>pip install hypothesmith</code></a>, or by cloning <a href="https://github.com/Zac-HD/hypothesmith">the GitHub repo</a>.
es: Cons&iacute;guelo hoy con <a href="https://pypi.org/project/hypothesmith/"> <code>pip install hypothesmith</code> </a> o clonando <a href="https://github.com/Zac-HD/hypothesmith">el repositorio de GitHub</a> .
ja: <a href="https://pypi.org/project/hypothesmith/"> <code>pip install hypothesmith</code> </a>を使用するか<a href="https://github.com/Zac-HD/hypothesmith">、GitHubリポジトリの</a>クローンを作成して、今すぐ入手してください。
ko: <a href="https://pypi.org/project/hypothesmith/"> <code>pip install hypothesmith</code> </a> 를 사용하거나 <a href="https://github.com/Zac-HD/hypothesmith">GitHub 저장소</a> 를 복제 하여 지금 얻으십시오 .
ru: Получите это сегодня с помощью <a href="https://pypi.org/project/hypothesmith/"> <code>pip install hypothesmith</code> </a> или клонировав <a href="https://github.com/Zac-HD/hypothesmith">репозиторий GitHub</a> .
zh_cn: 立即通过<a href="https://pypi.org/project/hypothesmith/"> <code>pip install hypothesmith</code> </a>或通过克隆<a href="https://github.com/Zac-HD/hypothesmith">GitHub存储库</a>获取它。

source: Hypothesis strategies for generating Python programs, something like CSmith
es: Estrategias de hipótesis para generar programas de Python,algo como CSmith
ja: CSmith のような Python プログラムを生成するための仮説戦略
ko: CSmith와 같은 Python 프로그램 생성을위한 가설 전략
ru: Гипотетические стратегии для генерации программ на питоне,что-то вроде CSmith.
zh_cn: 生成Python程序的假设策略,类似CSmith的东西

source: Hypothesis strategies for generating Python programs, something like CSmith.
es: Estrategias de hipótesis para generar programas Python,algo como CSmith.
ja: Pythonのプログラムを生成するための仮説戦略、CSmithのようなもの。
ko: CSmith와 같은 Python 프로그램을 생성하기위한 가설 전략.
ru: Гипотетические стратегии генерации программ на Пайтоне,что-то вроде CSmith.
zh_cn: 生成Python程序的假设策略,类似CSmith的东西。

source: If <code>auto_target</code> is <code>True</code>, this strategy uses <code>hypothesis.target()</code> internally to drive towards larger and more complex examples. We recommend leaving this enabled, as the grammar is quite complex and only simple examples tend to be generated otherwise.
es: Si <code>auto_target</code> es <code>True</code> , esta estrategia usa <code>hypothesis.target()</code> internamente para conducir hacia ejemplos m&aacute;s grandes y complejos. Recomendamos dejar esto habilitado, ya que la gram&aacute;tica es bastante compleja y, de lo contrario, solo se suelen generar ejemplos simples.
ja: <code>auto_target</code> が <code>True</code> の場合、この戦略は 内部で <code>hypothesis.target()</code> を使用して、より大きくより複雑な例に向かって進みます。文法は非常に複雑で、単純な例のみが生成される傾向があるため、これを有効のままにしておくことをお勧めします。
ko: 경우 <code>auto_target</code> 가 있다 <code>True</code> ,이 전략이 사용 <code>hypothesis.target()</code> 내부적으로 더 크고 더 복잡한 예제으로 구동한다. 문법이 매우 복잡하고 단순한 예제 만 생성되는 경향이 있으므로이 옵션을 활성화 된 상태로 두는 것이 좋습니다.
ru: Если <code>auto_target</code> имеет значение <code>True</code> , эта стратегия внутренне использует <code>hypothesis.target()</code> для перехода к более крупным и сложным примерам. Мы рекомендуем оставить этот параметр включенным, поскольку грамматика довольно сложна, и в противном случае, как правило, создаются только простые примеры.
zh_cn: 如果 <code>auto_target</code> 为 <code>True</code> ，则此策略在 内部使用 <code>hypothesis.target()</code> 来驱动更大，更复杂的示例。我们建议将此功能保持启用状态，因为语法非常复杂，否则只会生成简单的示例。

source: Invalid code generated by LibCST
es: Código inválido generado por el LibCST
ja: LibCST で生成された無効なコード
ko: LibCST에서 생성 된 잘못된 코드
ru: Недействительный код,сгенерированный LibCST
zh_cn: LibCST产生的无效代码

source: It could do literally anything that running Python code is able to do, including changing, deleting, or uploading important data. Arbitrary code can be useful, but "arbitrary code execution" can be very, very bad.
es: Podría hacer literalmente cualquier cosa que el código Python sea capaz de hacer,incluyendo cambiar,borrar o subir datos importantes.El código arbitrario puede ser útil,pero la "ejecución de código arbitrario" puede ser muy,muy mala.
ja: Pythonのコードを実行することで、重要なデータの変更、削除、アップロードなど、文字通り何でもできるようになります。任意のコードは便利ですが、「任意のコードの実行」は非常に、非常に悪いものになります。
ko: 중요한 데이터를 변경, 삭제 또는 업로드하는 것을 포함하여 Python 코드를 실행하여 할 수있는 모든 작업을 말 그대로 수행 할 수 있습니다. 임의 코드가 유용 할 수 있지만 "임의 코드 실행"은 매우 나쁠 수 있습니다.
ru: Он может делать буквально все,что способен сделать работающий на Python код,включая изменение,удаление или выгрузку важных данных.Произвольный код может быть полезен,но "произвольное выполнение кода" может быть очень,очень плохим.
zh_cn: 它可以做任何运行Python代码能够做的事情,包括更改、删除或上传重要数据。任意代码可能是有用的,但 "任意执行代码 "可能是非常非常糟糕的。

source: Notable bugs found with Hypothesmith
es: Notablemente se han encontrado bichos con Hypothesmith
ja: Hypothesmithで見つかった注目すべきバグ
ko: Hypothesmith에서 발견 된 주목할만한 버그
ru: Заметные ошибки,найденные у Ипотезиста
zh_cn: 在Hypothesmith中发现的显著错误。

source: Patch notes <a href="https://github.com/Zac-HD/hypothesmith/blob/master/CHANGELOG.md">can be found in <code>CHANGELOG.md</code></a>.
es: Las notas del parche <a href="https://github.com/Zac-HD/hypothesmith/blob/master/CHANGELOG.md">se pueden encontrar en <code>CHANGELOG.md</code> </a> .
ja: パッチノート<a href="https://github.com/Zac-HD/hypothesmith/blob/master/CHANGELOG.md">は <code>CHANGELOG.md</code> にあり</a>ます。
ko: 패치 노트 <a href="https://github.com/Zac-HD/hypothesmith/blob/master/CHANGELOG.md">는 <code>CHANGELOG.md</code> </a> 에서 찾을 수 있습니다 .
ru: Примечания <a href="https://github.com/Zac-HD/hypothesmith/blob/master/CHANGELOG.md">к <code>CHANGELOG.md</code> </a> можно найти на CHANGELOG.md .
zh_cn: 补丁说明<a href="https://github.com/Zac-HD/hypothesmith/blob/master/CHANGELOG.md">可以在 <code>CHANGELOG.md</code> 中</a>找到。

source: The generated code will always be syntatically valid, and is useful for testing parsers, linters, auto-formatters, and other tools that operate on source code.
es: El código generado siempre será sintácticamente válido,y es útil para probar analizadores,linters,autoformatos y otras herramientas que operan en el código fuente.
ja: 生成されたコードは常に構文的に有効であり、パーサ、リンタ、オートフォーマッタ、およびソースコード上で動作する他のツールをテストするのに便利です。
ko: 생성 된 코드는 항상 구문 적으로 유효하며 파서, 린터, 자동 포맷터 및 소스 코드에서 작동하는 기타 도구를 테스트하는 데 유용합니다.
ru: Сгенерированный код всегда будет синтаксически корректен и полезен для тестирования парсеров,линтеров,автоформатеров и других инструментов,работающих с исходным кодом.
zh_cn: 生成的代码将始终是语法上有效的,对于测试解析器、层叠器、自动格式化器和其他操作源代码的工具非常有用。

source: This is definitely pre-alpha, but if you want to play with it feel free! You can even keep the shiny pieces when - not if - it breaks.
es: Esto es definitivamente pre-alfa,pero si quieres jugar con él,¡siéntete libre! Incluso puedes conservar los pedazos brillantes cuando-no si-se rompe.
ja: これは間違いなくプレアルファですが、あなたがそれで遊びたい場合は、自由に感じています。あなたも、それが壊れたときに-ではなく-キラキラした作品を維持することができます。
ko: 이것은 확실히 사전 알파이지만, 그것을 가지고 놀고 싶다면 자유롭게! 부서지는 경우가 아니라도 반짝이는 조각을 유지할 수 있습니다.
ru: Это определенно пре-альфа,но если вы хотите поиграть с ним,не стесняйтесь! Вы даже можете сохранить блестящие кусочки,когда-не если-он ломается.
zh_cn: 这绝对是前阿尔法,但如果你想玩它,请随意!你甚至可以保留闪闪发光的碎片,当--如果不是--它打破了。你甚至可以保留闪亮的碎片,当--而不是如果--它打破。

source: This package provides two Hypothesis strategies for generating Python source code.
es: Este paquete proporciona dos estrategias de hipótesis para generar el código fuente de Python.
ja: 本パッケージは、Pythonのソースコードを生成するための2つのHypothesis戦略を提供します。
ko: 이 패키지는 Python 소스 코드를 생성하기위한 두 가지 가설 전략을 제공합니다.
ru: В данном пакете представлены две стратегии Гипотезы для генерации исходных текстов на языке Python.
zh_cn: 这个包提供了两种生成Python源代码的Hypothesis策略。

source: Usage
es: Uso
ja: 使用方法
ko: 용법
ru: Использование
zh_cn: 使用方法

source: Valid values for <code>start</code> are <code>"single_input"</code>, <code>"file_input"</code>, or <code>"eval_input"</code>; respectively a single interactive statement, a module or sequence of commands read from a file, and input for the eval() function.
es: Los valores v&aacute;lidos para <code>start</code> son <code>"single_input"</code> , <code>"file_input"</code> o <code>"eval_input"</code> ; respectivamente, una &uacute;nica declaraci&oacute;n interactiva, un m&oacute;dulo o secuencia de comandos le&iacute;dos de un archivo y una entrada para la funci&oacute;n eval ().
ja: <code>start</code> の有効な値は、 <code>"single_input"</code> 、 <code>"file_input"</code> 、または <code>"eval_input"</code> です。それぞれ、単一の対話型ステートメント、ファイルから読み取られたモジュールまたはコマンドのシーケンス、およびeval（）関数への入力。
ko: <code>start</code> 유효한 값 은 <code>"single_input"</code> , <code>"file_input"</code> 또는 <code>"eval_input"</code> 입니다 . 각각 단일 대화식 문, 파일에서 읽은 모듈 또는 명령 시퀀스, eval () 함수에 대한 입력.
ru: Допустимые значения для <code>start</code> : <code>"single_input"</code> , <code>"file_input"</code> или <code>"eval_input"</code> ; соответственно, один интерактивный оператор, модуль или последовательность команд, считываемых из файла, и входных данных для функции eval ().
zh_cn: 为有效值 <code>start</code> 是 <code>"single_input"</code> ， <code>"file_input"</code> ，或 <code>"eval_input"</code> ; 从文件中读取的单个交互式语句，模块或命令序列，以及eval（）函数的输入。

source: You can pass any subtype of <code>libcst.CSTNode</code>. Alternatively, you can use Hypothesis' built-in <code>from_type(node_type).map(lambda n: libcst.Module([n]).code</code>, after Hypothesmith has registered the required strategies. However, this does not include automatic targeting and limitations of LibCST may lead to invalid code being generated.
es: Puede pasar cualquier subtipo de <code>libcst.CSTNode</code> . Alternativamente, puede usar el <code>from_type(node_type).map(lambda n: libcst.Module([n]).code</code> de from_type (node_type) .map (lambda n: libcst.Module ([n]). Code integrado de Hypothesis, despu&eacute;s de que Hypothesmith haya registrado las estrategias requeridas. Sin embargo, esto no incluye la orientaci&oacute;n autom&aacute;tica y las limitaciones de LibCST puede generar un c&oacute;digo no v&aacute;lido.
ja: <code>libcst.CSTNode</code> 任意のサブタイプを渡すことができます。または、Hypothesmithが必要な戦略を登録した後、Hypothesisの組み込み <code>from_type(node_type).map(lambda n: libcst.Module([n]).code</code> を使用できます。ただし、これには自動ターゲティングとの制限は含まれません。 LibCSTにより、無効なコードが生成される可能性があります。
ko: <code>libcst.CSTNode</code> 의 모든 하위 유형을 전달할 수 있습니다 . 또는 Hypothesmith가 필수 전략을 등록한 후 Hypothesis의 내장 <code>from_type(node_type).map(lambda n: libcst.Module([n]).code</code> 있습니다. 그러나 여기에는 자동 타겟팅 및 제한이 포함되지 않습니다. LibCST로 인해 잘못된 코드가 생성 될 수 있습니다.
ru: Вы можете передать любой подтип <code>libcst.CSTNode</code> . В качестве альтернативы вы можете использовать встроенный <code>from_type(node_type).map(lambda n: libcst.Module([n]).code</code> Hypothesis после того, как Hypothesmith зарегистрирует необходимые стратегии. Однако это не включает автоматический таргетинг и ограничения LibCST может привести к созданию недопустимого кода.
zh_cn: 您可以传递 <code>libcst.CSTNode</code> 任何子类型。另外，您也可以在Hypothesmith注册所需策略后使用Hypothesis内置的 <code>from_type(node_type).map(lambda n: libcst.Module([n]).code</code> 。）但是，这不包括自动定位和LibCST可能导致生成无效代码。

source: You can run the tests, such as they are, with <code>tox</code> on Python 3.6 or later. Use <code>tox -va</code> to see what environments are available.
es: Puede ejecutar las pruebas, tal como est&aacute;n, con <code>tox</code> en Python 3.6 o posterior. Utilice <code>tox -va</code> para ver qu&eacute; entornos est&aacute;n disponibles.
ja: Python 3.6以降では、 <code>tox</code> を使用してテストを実行できます。 <code>tox -va</code> を使用して、使用可能な環境を確認します。
ko: Python 3.6 이상에서 <code>tox</code> 로 테스트를 그대로 실행할 수 있습니다 . <code>tox -va</code> 를 사용 하여 사용 가능한 환경을 확인하십시오.
ru: Вы можете запускать тесты, такие как они, с <code>tox</code> на Python 3.6 или новее. Используйте <code>tox -va</code> , чтобы узнать, какие среды доступны.
zh_cn: 您可以在Python 3.6或更高版本上使用 <code>tox</code> 运行测试，例如测试。使用 <code>tox -va</code> 查看可用的环境。

source: hypothesmith
es: hipótesis
ja: 仮説屋
ko: 가설 제작자
ru: гипотетик
zh_cn: 假说家
