Repository: Yuniorcr/runebook
Catalog: xlf/packages/*/python/hypothesis.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: A library for property-based testing
es: Una biblioteca para pruebas basadas en la propiedad
ja: プロパティベースのテスト用ライブラリ
ko: 속성 기반 테스트를위한 라이브러리
ru: Библиотека для тестирования недвижимости
zh_cn: 一个基于属性的测试库

source: Extensive documentation and examples of usage are <a href="https://hypothesis.readthedocs.io/en/latest/">available at readthedocs</a>.
es: Hay una amplia documentaci&oacute;n y ejemplos de uso <a href="https://hypothesis.readthedocs.io/en/latest/">disponibles en readthedocs</a> .
ja: 広範なドキュメントと使用例は<a href="https://hypothesis.readthedocs.io/en/latest/">、readthedocsで入手できます</a>。
ko: 광범위한 문서와 사용 예는 <a href="https://hypothesis.readthedocs.io/en/latest/">readthedocs에서 볼 수 있습니다</a> .
ru: Подробная документация и примеры использования <a href="https://hypothesis.readthedocs.io/en/latest/">доступны в readthedocs</a> .
zh_cn: 大量的文档和用法示例<a href="https://hypothesis.readthedocs.io/en/latest/">可在readthedocs上找到</a>。

source: Hypothesis is an advanced testing library for Python. It lets you write tests which are parametrized by a source of examples, and then generates simple and comprehensible examples that make your tests fail. This lets you find more bugs in your code with less work.
es: Hipótesis es una biblioteca de pruebas avanzadas para Python.Le permite escribir pruebas que son parametrizadas por una fuente de ejemplos,y luego genera ejemplos simples y comprensibles que hacen que sus pruebas fallen.Esto te permite encontrar más errores en tu código con menos trabajo.
ja: HypothesisはPythonのための高度なテストライブラリです。例題のソースによってパラメトリック化されたテストを書くことができ、テストが失敗するようなシンプルで分かりやすい例題を生成してくれます。これにより、より少ない作業でより多くのバグを発見することができます。
ko: 가설은 Python 용 고급 테스트 라이브러리입니다. 예제 소스에 의해 매개 변수화 된 테스트를 작성한 다음 테스트를 실패하게 만드는 간단하고 이해하기 쉬운 예제를 생성 할 수 있습니다. 이렇게하면 적은 작업으로 코드에서 더 많은 버그를 찾을 수 있습니다.
ru: Гипотеза-это продвинутая библиотека тестирования для Python.Она позволяет писать тесты,которые параметризируются источником примеров,а затем генерирует простые и понятные примеры,которые делают ваши тесты неудачными.Это позволяет найти в коде больше ошибок с меньшими затратами.
zh_cn: Hypothesis是一个Python的高级测试库。它可以让你编写测试,这些测试由一个例子源进行参数化,然后生成简单易懂的例子,使你的测试失败。这可以让你用更少的工作量找到代码中更多的bug。

source: Hypothesis is extremely practical and advances the state of the art of unit testing by some way. It&rsquo;s easy to use, stable, and powerful. If you&rsquo;re not using Hypothesis to test your project then you&rsquo;re missing out.
es: La hip&oacute;tesis es extremadamente pr&aacute;ctica y de alguna manera avanza el estado del arte de las pruebas unitarias. Es f&aacute;cil de usar, estable y potente. Si no est&aacute; utilizando Hypothesis para probar su proyecto, se lo est&aacute; perdiendo.
ja: 仮説は非常に実用的であり、ユニットテストの最先端を何らかの方法で進歩させます。使いやすく、安定していて、強力です。プロジェクトのテストに仮説を使用していない場合は、見逃していることになります。
ko: 가설은 매우 실용적이며 어떤 식 으로든 단위 테스트의 최첨단 기술을 발전시킵니다. 사용하기 쉽고 안정적이며 강력합니다. 프로젝트를 테스트하기 위해 가설을 사용하지 않는다면 놓치고있는 것입니다.
ru: Гипотеза чрезвычайно практична и в некоторой степени продвигает современный уровень модульного тестирования. Он прост в использовании, стабилен и мощный. Если вы не используете гипотезу для тестирования своего проекта, вы упускаете возможность.
zh_cn: 假设非常实用，并且以某种方式推动了单元测试的发展。它易于使用，稳定且强大。如果您没有使用假设来测试您的项目，那么您就错过了。

source: If you just want to get started:
es: Si sólo quieres empezar:
ja: 始めるだけなら
ko: 시작하려는 경우 :
ru: Если ты просто хочешь начать:
zh_cn: 如果你只是想开始。

source: If you want to contribute to Hypothesis, <a href="https://github.com/HypothesisWorks/hypothesis-python/blob/master/CONTRIBUTING.rst">instructions are here</a>.
es: Si desea contribuir a la hip&oacute;tesis, las <a href="https://github.com/HypothesisWorks/hypothesis-python/blob/master/CONTRIBUTING.rst">instrucciones est&aacute;n aqu&iacute;</a> .
ja: 仮説に貢献したい場合は、<a href="https://github.com/HypothesisWorks/hypothesis-python/blob/master/CONTRIBUTING.rst">手順はこちら</a>です。
ko: 가설에 기여하고 싶다면 <a href="https://github.com/HypothesisWorks/hypothesis-python/blob/master/CONTRIBUTING.rst">여기에 지침이 있습니다</a> .
ru: Если вы хотите внести свой вклад в Гипотезу, <a href="https://github.com/HypothesisWorks/hypothesis-python/blob/master/CONTRIBUTING.rst">инструкции здесь</a> .
zh_cn: 如果您想为假设做贡献，请<a href="https://github.com/HypothesisWorks/hypothesis-python/blob/master/CONTRIBUTING.rst">点击此处</a>。

source: If you want to create a downstream package of Hypothesis, please read <a href="https://hypothesis.readthedocs.io/en/latest/packaging.html">these guidelines for packagers</a>.
es: Si desea crear un paquete posterior de hip&oacute;tesis, lea <a href="https://hypothesis.readthedocs.io/en/latest/packaging.html">estas pautas para los empaquetadores</a> .
ja: Hypothesisのダウンストリームパッケージを作成する場合は、パッケー<a href="https://hypothesis.readthedocs.io/en/latest/packaging.html">ジャー向けのこれらのガイドライン</a>をお読みください。
ko: 가설의 다운 스트림 패키지를 생성하려면 <a href="https://hypothesis.readthedocs.io/en/latest/packaging.html">패키저를위한이 가이드 라인을</a> 읽어보세요 .
ru: Если вы хотите создать последующий пакет Hypothesis, прочтите <a href="https://hypothesis.readthedocs.io/en/latest/packaging.html">эти рекомендации для упаковщиков</a> .
zh_cn: 如果要创建假设的下游包装，请阅读<a href="https://hypothesis.readthedocs.io/en/latest/packaging.html">包装人员指南</a>。

source: If you want to hear from people who are already using Hypothesis, some of them <a href="https://hypothesis.readthedocs.io/en/latest/endorsements.html">have written about it</a>.
es: Si desea escuchar a personas que ya est&aacute;n usando Hypothesis, algunos de ellos <a href="https://hypothesis.readthedocs.io/en/latest/endorsements.html">han escrito al respecto</a> .
ja: すでに仮説を使用している人々から聞きたいのであれば、彼らの何人かはそれ<a href="https://hypothesis.readthedocs.io/en/latest/endorsements.html">について書いてい</a>ます。
ko: 이미 가설을 사용하고있는 사람들의 의견을 듣고 싶다면 그들 중 일부 <a href="https://hypothesis.readthedocs.io/en/latest/endorsements.html">가 이에 대해 썼습니다</a> .
ru: Если вы хотите услышать мнение людей, которые уже используют гипотезу, некоторые из них <a href="https://hypothesis.readthedocs.io/en/latest/endorsements.html">уже писали об этом</a> .
zh_cn: 如果您想听取已经使用假设的人们的意见，其中有些人<a href="https://hypothesis.readthedocs.io/en/latest/endorsements.html">已经写过关于它的文章</a>。

source: If you want to receive occasional updates about Hypothesis, including useful tips and tricks, there&rsquo;s a <a href="https://tinyletter.com/DRMacIver/">TinyLetter mailing list to sign up for them</a>.
es: Si desea recibir actualizaciones ocasionales sobre Hypothesis, incluidos consejos y trucos &uacute;tiles, hay una <a href="https://tinyletter.com/DRMacIver/">lista de correo de TinyLetter para suscribirse</a> .
ja: 役立つヒントやコツなど、仮説に関する最新情報をときどき受け取りたい場合は、 <a href="https://tinyletter.com/DRMacIver/">TinyLetterメーリングリストに登録してください</a>。
ko: 유용한 팁과 요령을 포함하여 가설에 대한 비정기적인 업데이트를 받으려면 <a href="https://tinyletter.com/DRMacIver/">가입 할 수</a> 있는 TinyLetter 메일 링리스트가 있습니다 .
ru: Если вы хотите получать периодические обновления о Hypothesis, включая полезные советы и рекомендации, есть <a href="https://tinyletter.com/DRMacIver/">список рассылки TinyLetter, чтобы подписаться на них</a> .
zh_cn: 如果您希望偶尔收到有关假说的更新，包括有用的提示和技巧，则可以通过 <a href="https://tinyletter.com/DRMacIver/">TinyLetter邮件列表进行注册</a>。

source: If you want to talk to people about using Hypothesis, <a href="https://hypothesis.readthedocs.io/en/latest/community.html">we have both an IRC channel and a mailing list</a>.
es: Si desea hablar con la gente sobre el uso de Hypothesis, <a href="https://hypothesis.readthedocs.io/en/latest/community.html">tenemos un canal de IRC y una lista de correo</a> .
ja: Hypothesisの使用について人々と話したい場合<a href="https://hypothesis.readthedocs.io/en/latest/community.html">は、IRCチャネルとメーリングリストの両方があります</a>。
ko: 가설 사용에 대해 사람들과 이야기하고 싶다면 <a href="https://hypothesis.readthedocs.io/en/latest/community.html">IRC 채널과 메일 링리스트가 모두</a> 있습니다.
ru: Если вы хотите поговорить с людьми об использовании Hypothesis, <a href="https://hypothesis.readthedocs.io/en/latest/community.html">у нас есть как канал IRC, так и список рассылки</a> .
zh_cn: 如果您想与人们讨论使用假设，<a href="https://hypothesis.readthedocs.io/en/latest/community.html">我们既有一个IRC频道，又有一个邮件列表</a>。

source: Links of interest
es: Enlaces de interés
ja: 興味のあるリンク
ko: 관심 링크
ru: Связи,представляющие интерес
zh_cn: 感兴趣的链接

source: Quick Start/Installation
es: Inicio rápido/instalación
ja: クイックスタート/インストール
ko: 빠른 시작 / 설치
ru: Быстрый запуск/установка
zh_cn: 快速启动/安装

source: The main Hypothesis site is at <a href="https://hypothesis.works/">hypothesis.works</a>, and contains a lot of good introductory and explanatory material.
es: El sitio principal de Hypothesis est&aacute; en <a href="https://hypothesis.works/">hypothesis.works</a> , y contiene una gran cantidad de buen material introductorio y explicativo.
ja: 主要な仮説サイトは<a href="https://hypothesis.works/">hypothesis.works</a>にあり、多くの優れた入門および説明資料が含まれています。
ko: 주요 가설 사이트는 <a href="https://hypothesis.works/">hypothesis.works</a> 에 있으며 좋은 소개 및 설명 자료를 많이 포함하고 있습니다.
ru: Основной сайт гипотез находится на <a href="https://hypothesis.works/">hypothesis.works</a> и содержит много хороших вводных и пояснительных материалов.
zh_cn: 假设的主要站点位于<a href="https://hypothesis.works/">hypothesis.works</a>，并包含许多良好的介绍性和解释性材料。

source: e.g.
es: por ejemplo.
ja: 例え
ko: 예 :
ru: в частности
zh_cn: 例如
