Repository: Yuniorcr/runebook
Catalog: xlf/packages/*/python/hypothesis-sqlalchemy.001.xlf
Languages: es, ru

source: <code>Bash</code> script (e.g. can be used in <code>Git</code> hooks):
es: <code>Bash</code> Script Bash (por ejemplo, se puede usar en ganchos de <code>Git</code> ):
ru: <code>Bash</code> Сценарий Bash (например, может использоваться в <code>Git</code> ):

source: <code>PowerShell</code> script (e.g. can be used in <code>Git</code> hooks):
es: <code>PowerShell</code> Script de PowerShell (por ejemplo, se puede utilizar en ganchos de <code>Git</code> ):
ru: <code>PowerShell</code> Сценарий PowerShell (например, может использоваться в <code>Git</code> ):

source: <code>hypothesis</code> strategies for <code>SQLAlchemy</code>
es: <code>hypothesis</code> estrategias de hip&oacute;tesis para <code>SQLAlchemy</code>
ru: <code>hypothesis</code> стратегии гипотез для <code>SQLAlchemy</code>

source: <code>pypy</code> is an alias for <code>pypy3.5</code> or any later version (<code>pypy3.6</code> and so on).
es: <code>pypy</code> es un alias para <code>pypy3.5</code> o cualquier versi&oacute;n posterior ( <code>pypy3.6</code> y as&iacute; sucesivamente).
ru: <code>pypy</code> - это псевдоним для <code>pypy3.5</code> или любой более поздней версии ( <code>pypy3.6</code> и т. д.).

source: <code>python</code> is an alias for <code>python3.5</code> or any later version (<code>python3.6</code> and so on),
es: <code>python</code> es un alias para <code>python3.5</code> o cualquier versi&oacute;n posterior ( <code>python3.6</code> y as&iacute; sucesivamente),
ru: <code>python</code> - это псевдоним для <code>python3.5</code> или любой более поздней версии ( <code>python3.6</code> и т. д.),

source: Bump version
es: Versión bump
ru: Ударная версия

source: Bumping version
es: La versión Bumping
ru: ударная версия

source: Choose which version number category to bump following <a href="http://semver.org/">semver specification</a>.
es: Elija qu&eacute; categor&iacute;a de n&uacute;mero de versi&oacute;n se va a <a href="http://semver.org/">incluir</a> siguiendo la especificaci&oacute;n de semver .
ru: Выберите категорию номера версии, которую нужно поднять в соответствии <a href="http://semver.org/">со спецификацией semver</a> .

source: Developer
es: Desarrollador
ru: Разработчик

source: Development
es: Desarrollo
ru: Разработка

source: Download and install the latest stable version from <code>PyPI</code> repository:
es: Descargue e instale la &uacute;ltima versi&oacute;n estable del repositorio de <code>PyPI</code> :
ru: Загрузите и установите последнюю стабильную версию из репозитория <code>PyPI</code> :

source: Download the latest version from <code>GitHub</code> repository
es: Descargue la &uacute;ltima versi&oacute;n del repositorio de <code>GitHub</code>
ru: Загрузите последнюю версию из репозитория <code>GitHub</code>

source: In what follows
es: En lo que sigue
ru: Далее следует

source: Inside <code>Docker</code> container:
es: Dentro del contenedor <code>Docker</code> :
ru: Внутри контейнера <code>Docker</code> :

source: Install <a href="https://github.com/c4urself/bump2version#installation">bump2version</a>.
es: Instale <a href="https://github.com/c4urself/bump2version#installation">bump2version</a> .
ru: Установите <a href="https://github.com/c4urself/bump2version#installation">bump2version</a> .

source: Install dependencies:
es: Instalar dependencias:
ru: Установите зависимости:

source: Install the latest <code>pip</code> &amp; <code>setuptools</code> packages versions:
es: Instale las &uacute;ltimas versiones de los paquetes <code>pip</code> &amp; <code>setuptools</code> :
ru: Установите последние версии пакетов <code>pip</code> и <code>setuptools</code> :

source: Install:
es: Instalar:
ru: Установить:

source: Installation
es: Instalación
ru: Установка

source: Let's take a look at what can be generated and how.
es: Echemos un vistazo a lo que se puede generar y cómo.
ru: Давайте посмотрим,что можно сгенерировать и как.

source: Plain
es: Llanura
ru: Простой

source: Pre-release
es: Pre-lanzamiento
ru: Предварительный релиз

source: Preparation
es: Preparación
ru: Подготовка

source: Records
es: Registros
ru: Записи

source: Release
es: Liberación
ru: Релиз

source: Running tests
es: Realizando pruebas
ru: Испытания

source: Suppose we have a table
es: Supongamos que tenemos una mesa
ru: Предположим,у нас есть стол

source: Tables
es: Tablas
ru: Таблицы

source: Test bumping version
es: Versión de prueba
ru: Тестовая версия

source: This will set version to <code>major.minor.patch-alpha</code>.
es: Esto establecer&aacute; la versi&oacute;n en <code>major.minor.patch-alpha</code> .
ru: Это установит версию на <code>major.minor.patch-alpha</code> .

source: This will set version to <code>major.minor.patch</code>.
es: Esto establecer&aacute; la versi&oacute;n en <code>major.minor.patch</code> .
ru: Это установит версию на <code>major.minor.patch</code> .

source: Usage
es: Uso
ru: Использование

source: User
es: Usuario
ru: Пользователь

source: We can write a strategy that produces tables
es: Podemos escribir una estrategia que produzca tablas
ru: Мы можем написать стратегию,которая производит таблицы

source: ``hypothesis`` strategies for generating ``SQLAlchemy`` objects.
es: Estrategias de `` hip&oacute;tesis '' para generar objetos `` SQLAlchemy ''.
ru: Стратегии гипотез для создания объектов SQLAlchemy.

source: and we can write strategy that
es: y podemos escribir una estrategia que
ru: и мы можем написать стратегию,которая

source: or
es: lub
ru: или

source: produces records <code>list</code>s (with configurable <code>list</code> size bounds)
es: produce <code>list</code> as de registros (con l&iacute;mites de tama&ntilde;o de <code>list</code> a configurables )
ru: создает <code>list</code> записей (с настраиваемыми границами размера <code>list</code> )

source: produces single records (as <code>tuple</code>s)
es: produce registros &uacute;nicos (como <code>tuple</code> )
ru: производит отдельные записи (как <code>tuple</code> )

source: where <code>$CATEGORY</code> is the target version number category name, possible values are <code>patch</code>/<code>minor</code>/<code>major</code>.
es: donde <code>$CATEGORY</code> es el nombre de la categor&iacute;a del n&uacute;mero de versi&oacute;n de destino, los valores posibles son <code>patch</code> / <code>minor</code> / <code>major</code> .
ru: где <code>$CATEGORY</code> - имя категории номера целевой версии, возможные значения: <code>patch</code> / <code>minor</code> / <code>major</code> .

source: with <code>CPython</code>
es: con <code>CPython</code>
ru: с <code>CPython</code>

source: with <code>PyPy</code>
es: con <code>PyPy</code>
ru: с <code>PyPy</code>
