Repository: Yuniorcr/runebook
Catalog: xlf/packages/*/python/lacbd.001.xlf
Languages: es, ja, ko, ru, zh_cn

source: 10&times; faster than an equivalent regex
es: 10 veces m&aacute;s r&aacute;pido que una expresi&oacute;n regular equivalente
ja: 同等の正規表現よりも10倍高速
ko: 동등한 정규식보다 10 배 빠름
ru: В 10 раз быстрее, чем эквивалентное регулярное выражение
zh_cn: 比同等的正则表达式快10倍

source: Case insensitive
es: Insensible a las mayúsculas y minúsculas
ja: ケースインセンシティブ
ko: 대소 문자를 구분하지 않음
ru: Дело нечувствительное
zh_cn: 不区分大小写

source: Copyright &copy; 2019 Ben Simms and Ben Mintz
es: Copyright &copy; 2019 Ben Simms y Ben Mintz
ko: 저작권 &copy; 2019 Ben Simms 및 Ben Mintz
ru: Авторские права &copy; 2019 Бен Симмс и Бен Минц
zh_cn: 版权所有&copy;2019 Ben Simms和Ben Mintz

source: Fast subsentence searching
es: Búsqueda rápida de subsentencia
ja: 高速サブセンテンス検索
ko: 빠른 문장 검색
ru: Быстрый поиск подчинения
zh_cn: 快速分句搜索

source: Features
es: Características
ja: 特徴
ko: 풍모
ru: Особенности
zh_cn: 特点

source: License
es: Licencia
ja: ライセンス
ko: 특허
ru: Лицензия
zh_cn: 许可证

source: None of the existing python libraries fit my needs.
es: Ninguna de las bibliotecas de pitón existentes se ajusta a mis necesidades.
ja: 既存のpythonライブラリの中に私のニーズに合うものはありませんでした。
ko: 기존 파이썬 라이브러리 중 어느 것도 내 요구에 맞지 않습니다.
ru: Ни одна из существующих питоновских библиотек не соответствует моим потребностям.
zh_cn: 现有的python库都不符合我的需求。

source: Operates on Unicode word bounds, rather than na&iuml;ve substring matching
es: Opera en l&iacute;mites de palabras Unicode, en lugar de una coincidencia ingenua de subcadenas
ja: ナイーブな部分文字列マッチングではなく、Unicodeの単語境界で動作します
ko: 순진한 하위 문자열 일치가 아닌 유니 코드 단어 범위에서 작동합니다.
ru: Работает на границах слов в Юникоде, а не на простом сопоставлении подстрок
zh_cn: 在Unicode字边界上操作，而不是单纯的子字符串匹配

source: Supports arbitrary values associated with each keyword
es: Soporta valores arbitrarios asociados a cada palabra clave
ja: 各キーワードに関連付けられた任意の値をサポート
ko: 각 키워드와 관련된 임의의 값 지원
ru: Поддерживает произвольные значения,связанные с каждым ключевым словом
zh_cn: 支持与每个关键字相关联的任意值

source: This library is AGPLv3+ licensed. That may seem like an odd choice for a library. However, doing so ensures that users of this code must make their application open source, even if run as a service (such as in a Discord bot). If you want to use this to make proprietary software, look somewhere else.
es: Esta biblioteca tiene licencia AGPLv3+.Puede parecer una elección extraña para una biblioteca.Sin embargo,al hacerlo se asegura que los usuarios de este código deben hacer su aplicación de código abierto,incluso si se ejecuta como un servicio (como en un bot de Discordia).Si quiere usar esto para hacer software propietario,busque en otro lugar.
ja: このライブラリはAGPLv3+でライセンスされています。これはライブラリとしては奇妙な選択のように思えるかもしれません。しかし、そうすることで、(Discord botのような)サービスとして実行されたとしても、このコードのユーザがアプリケーションをオープンソースにしなければならないことを保証します。これを使ってプロプライエタリなソフトウェアを作りたいのであれば、どこか他を探してください。
ko: 이 라이브러리는 AGPLv3 + 라이센스입니다. 그것은 도서관에 대한 이상한 선택처럼 보일 수 있습니다. 그러나 이렇게하면이 코드의 사용자가 서비스로 실행 되더라도 (예 : Discord 봇에서) 애플리케이션을 오픈 소스로 만들어야합니다. 이것을 사용하여 독점 소프트웨어를 만들고 싶다면 다른 곳을 찾아보십시오.
ru: Эта библиотека лицензирована на AGPLv3+.Это может показаться странным выбором для библиотеки.Тем не менее,это гарантирует,что пользователи этого кода должны сделать свое приложение открытым,даже если оно запущено как сервис (например,в боте Discord).Если вы хотите воспользоваться этим,чтобы сделать несвободные программы,посмотрите где-нибудь в другом месте.
zh_cn: 这个库是AGPLv3+授权的。对于一个库来说,这似乎是一个奇怪的选择。然而,这样做可以确保该代码的用户必须将他们的应用程序开源,即使是作为服务运行(例如在Discord机器人中)。如果你想用它来制作专有软件,请找其他地方。

source: This program is distributed in the hope that it will be useful, but WITHOUT ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the GNU Affero General Public License for more details.
es: Este programa se distribuye con la esperanza de que sea útil,pero SIN NINGUNA GARANTÍA;ni siquiera la garantía implícita de COMERCIABILIDAD o APTITUD PARA UN PROPÓSITO PARTICULAR.Vea la Licencia Pública General Affero de GNU para más detalles.
ja: このプログラムは有用であることを期待して配布されていますが、商品性や特定目的への適合性についての暗黙の保証もなく、何の保証もありません。詳細はGNUアフェロ一般公衆利用許諾書を参照してください。
ko: 이 프로그램은 유용 할 것이라는 희망으로 배포되지만 어떠한 보증도 없습니다. 상품성 또는 특정 목적에의 적합성에 대한 묵시적 보증도 없습니다. 자세한 내용은 GNU Affero General Public License를 참조하십시오.
ru: Эта программа распространяется в надежде,что она будет полезной,но БЕЗ КАКИХ-ЛИБО ГАРАНТИЙ;даже без подразумеваемой гарантии ТОВАРНОЙ ПРИГОДНОСТИ или ПРИГОДНОСТИ ДЛЯ КОНКРЕТНЫХ ЦЕЛЕЙ.Подробнее см.в GNU Affero General Public License.
zh_cn: 本程序发布的目的是希望它是有用的,但没有任何保证,甚至没有默示的适销性或适合特定用途的保证。更多细节请参见GNU Affero通用公共许可证。

source: This program is free software: you can redistribute it and/or modify it under the terms of the GNU Affero General Public License as published by the Free Software Foundation, either version 3 of the License, or (at your option) any later version.
es: Este programa es software libre:puede redistribuirlo y/o modificarlo bajo los términos de la Licencia Pública General Affero de GNU publicada por la Fundación para el Software Libre,ya sea la versión 3 de la Licencia,o (a su elección)cualquier versión posterior.
ja: このプログラムはフリーソフトウェアです:フリーソフトウェアファウンデーションによって発行されたGNUアフェロ一般公衆利用許諾書のバージョン3、あるいはそれ以降のバージョン(あなたの選択で)のいずれかの条件で、再配布および/または変更することができます。
ko: 이 프로그램은 무료 소프트웨어입니다. Free Software Foundation에서 게시 한 GNU Affero General Public License, 라이선스 버전 3 또는 이후 버전 (귀하의 선택에 따라)에 따라 재배포 및 / 또는 수정할 수 있습니다.
ru: Эта программа свободна:вы можете распространять ее и/или модифицировать на условиях Стандартной общественной лицензии GNU Affero,опубликованной Фондом свободного программного обеспечения,либо версии 3 Лицензии,либо (по вашему выбору)любой более поздней версии.
zh_cn: 本程序是自由软件:你可以在自由软件基金会发布的GNU Affero通用公共许可证的条款下重新发布它和/或修改它,或者是许可证的第3版,或者(由你选择)任何更新的版本。

source: You can find the actual Rust library as <a href="https://github.com/nitros12/like-aho-corasick-but-different">nitros12/like-aho-corasick-but-different</a>.
es: Puede encontrar la biblioteca de Rust real como <a href="https://github.com/nitros12/like-aho-corasick-but-different">nitros12 / like-aho-corasick-but-different</a> .
ja: 実際のRustライブラリは、<a href="https://github.com/nitros12/like-aho-corasick-but-different">nitros12 / like-aho-corasick-but-different</a>として見つけることができます。
ko: 실제 Rust 라이브러리는 <a href="https://github.com/nitros12/like-aho-corasick-but-different">nitros12 / like-aho-corasick-but-different</a> 로 찾을 수 있습니다 .
ru: Вы можете найти настоящую библиотеку Rust как <a href="https://github.com/nitros12/like-aho-corasick-but-different">nitros12 / like-aho-corasick-but-different</a> .
zh_cn: 您可以找到实际的Rust库为<a href="https://github.com/nitros12/like-aho-corasick-but-different">nitros12 / like-aho-corasick-but-different</a>。

source: You should have received a copy of the GNU Affero General Public License along with this program. If not, see <a href="https://www.gnu.org/licenses/">https://www.gnu.org/licenses/</a>.
es: Deber&iacute;a haber recibido una copia de la licencia p&uacute;blica general GNU Affero junto con este programa. De lo contrario, consulte <a href="https://www.gnu.org/licenses/">https://www.gnu.org/licenses/</a> .
ja: このプログラムと一緒にGNUAffero General PublicLicenseのコピーを受け取っているはずです。そうでない場合は、<a href="https://www.gnu.org/licenses/">https：//www.gnu.org/licenses/を</a>参照してください。
ko: 이 프로그램과 함께 GNU Affero General Public License의 사본을 받았을 것입니다. 그렇지 않은 경우 <a href="https://www.gnu.org/licenses/">https://www.gnu.org/licenses/를</a> 참조 하십시오 .
ru: Вы должны были получить копию Стандартной общественной лицензии GNU Affero вместе с этой программой. Если нет, см. <a href="https://www.gnu.org/licenses/">Https://www.gnu.org/licenses/</a> .
zh_cn: 您应该已经与该程序一起收到了GNU Affero通用公共许可证的副本。如果没有，请参阅<a href="https://www.gnu.org/licenses/">https://www.gnu.org/licenses/</a>。

source: lacbd
ja: 裂け目
ru: лакбд

source: lacbd is a Python library written in Rust that implements the Aho Corasick algorithm for fast subsentence matching of many keywords against one string.
es: lacbd es una biblioteca de Python escrita en Rust que implementa el algoritmo Aho Corasick para una rápida coincidencia de subsistencia de muchas palabras clave contra una cadena.
ja: lacbdはRustで書かれたPythonライブラリで、1つの文字列に対して多くのキーワードを高速にマッチさせるAho Corasickアルゴリズムを実装しています。
ko: lacbd는 Rust로 작성된 Python 라이브러리로, 하나의 문자열에 대해 많은 키워드를 빠르게 일치시키는 Aho Corasick 알고리즘을 구현합니다.
ru: lacbd-это библиотека на питонском языке,написанная на языке Rust и реализующая алгоритм Aho Corasick для быстрого совмещения многих ключевых слов с одной строкой.
zh_cn: lacbd是一个用Rust编写的Python库,它实现了Aho Corasick算法,用于许多关键字与一个字符串的快速子句匹配。
