Repository: Yuniorcr/runebook
Catalog: xlf/packages/*/python/loose-server.001.xlf
Languages: es, ko, zh_cn

source: (required for the http clients).
es: (requerido para los clientes http).
ko: (http 클라이언트에 필요).
zh_cn: （http客户端必需）。

source: (required for the server) and
es: (requerido para el servidor) y
ko: (서버에 필요) 및
zh_cn: （服务器必需）和

source: . The response can be obtained by the following request
es: . La respuesta se puede obtener mediante la siguiente solicitud
ko: . 다음 요청으로 응답을 얻을 수 있습니다.
zh_cn: 。可以通过以下请求获得响应

source: /_configuration/
es: /_configuraci&oacute;n/
zh_cn: /_组态/

source: /routes/
es: / rutas /
zh_cn: /路线/

source: A server can be started by the command
es: Un servidor puede ser iniciado por el comando
ko: 명령으로 서버를 시작할 수 있습니다.
zh_cn: 可以通过以下命令启动服务器

source: API endpoints are nested to the base configuration url. By default it is
es: Los puntos finales de la API están anidados a la url de la configuración base.Por defecto es
ko: API 엔드 포인트는 기본 구성 URL에 중첩됩니다. 기본적으로
zh_cn: API端点被嵌套到基础配置url。默认情况下,它是

source: Additional packages will be installed:
es: Se instalarán paquetes adicionales:
ko: 추가 패키지가 설치됩니다.
zh_cn: 将安装额外的包。

source: All configured endpoints have a common prefix. By default it is
es: Todos los puntos finales configurados tienen un prefijo común.Por defecto es
ko: 구성된 모든 끝점에는 공통 접두사가 있습니다. 기본적으로
zh_cn: 所有配置的端点都有一个共同的前缀。默认情况下,它是

source: Configurable mock
es: Simulacro configurable
ko: 구성 가능한 모의
zh_cn: 可配置的模拟

source: Documentation
es: Documentación
ko: 선적 서류 비치
zh_cn: 文件资料

source: Documentation for the package can be found on the <a href="https://github.com/KillAChicken/loose-server/wiki">Wiki</a>.
es: La documentaci&oacute;n del paquete se puede encontrar en <a href="https://github.com/KillAChicken/loose-server/wiki">Wiki</a> .
ko: 패키지에 대한 문서는 <a href="https://github.com/KillAChicken/loose-server/wiki">Wiki</a> 에서 찾을 수 있습니다 .
zh_cn: 该软件包的文档可在<a href="https://github.com/KillAChicken/loose-server/wiki">Wiki</a>上找到。

source: Dynamically configurable server
es: Servidor configurable dinámicamente
ko: 동적으로 구성 가능한 서버
zh_cn: 可动态配置的服务器

source: Flask
es: Frasco
ko: 플라스크
zh_cn: 烧瓶

source: Flask application that can be used as a configurable mock in unit-tests.
es: Una aplicación en forma de frasco que puede ser usada como un simulacro configurable en pruebas de unidades.
ko: 단위 테스트에서 구성 가능한 모의로 사용할 수있는 Flask 애플리케이션입니다.
zh_cn: Flask应用程序,可以在单元测试中作为一个可配置的mock使用。

source: Installation
es: Instalación
ko: 설치
zh_cn: 安装

source: Loose server can be used as a mock server in the following way
es: El servidor suelto puede ser usado como un servidor falso de la siguiente manera
ko: 느슨한 서버는 다음과 같은 방법으로 모의 서버로 사용할 수 있습니다.
zh_cn: 松散服务器可以通过以下方式作为模拟服务器使用

source: Loose server has 2 variations:
es: El servidor suelto tiene 2 variaciones:
ko: 느슨한 서버에는 두 가지 변형이 있습니다.
zh_cn: 松散的服务器有2种变化。

source: Loose server is a simple configurable server. It can be used to create temporary servers, dynamically add or remove endpoints and set responses for them from an application.
es: El servidor suelto es un servidor simple y configurable.Se puede utilizar para crear servidores temporales,añadir o eliminar dinámicamente puntos finales y establecer respuestas para ellos desde una aplicación.
ko: 느슨한 서버는 구성 가능한 간단한 서버입니다. 임시 서버를 만들고, 엔드 포인트를 동적으로 추가 또는 제거하고, 애플리케이션에서 이에 대한 응답을 설정하는 데 사용할 수 있습니다.
zh_cn: Loose server是一个简单的可配置服务器。它可以用来创建临时服务器,动态添加或删除端点,并从应用程序中为它们设置响应。

source: Quickstart
es: Inicio rápido
ko: 빠른 시작
zh_cn: 快速启动

source: Standalone server
es: Servidor independiente
ko: 독립형 서버
zh_cn: 独立服务器

source: Standalone server with API to manage rules via HTTP.
es: Servidor independiente con API para gestionar las reglas a través de HTTP.
ko: HTTP를 통해 규칙을 관리하는 API가있는 독립형 서버.
zh_cn: 具有API的独立服务器,可通过HTTP管理规则。

source: flask-restful
ko: 플라스크에서 편안하게
zh_cn: 枕戈待旦

source: loose-server
es: servidor suelto
ko: 느슨한 서버
zh_cn: 松散型服务器

source: requests
es: solicitudes
ko: 요청
zh_cn: 请求
