Repository: Yuniorcr/runebook
Catalog: xlf/packages/*/python/polyglot.001.xlf
Languages: ru, zh_cn

source: Bug Fix: - Improve sentence serialization (PR #34) - Fix rare unicode encode error (PR #35) - Fix transliteration from languages other than English (PR 46) - Add link to Github in README (PR #49) - Make handling of paths more coherent (RP #55) - Fix normalizing embedding in place for NER corrupts the features of POS (issue #60, PR #62)
ru: Исправление ошибки:-Улучшена сериализация предложений (PR #34)-Исправлена редкая ошибка кодирования юникода (PR #35)-Исправлена транслитерация с языков,отличных от английского (PR 46)-Добавлена ссылка на Github в README (PR #49)-Сделана обработка путей более когерентной (RP #55)-Исправлена нормализация встраивания в NER для повреждения возможностей POS (выпуск #60,PR #62)
zh_cn: 错误修复:-改进句子序列化(PR #34)-修复罕见的unicode编码错误(PR #35)-修复英语以外的语言翻译(PR #46)-在README中添加Github链接(PR #49)-使路径的处理更加连贯(RP #55)-修复NER的归一化嵌入会破坏POS的特性(问题#60,PR #62)

source: Change the polyglot models mirror to Stony Brook University DSL lab instead of Google cloud storage.
ru: Измените зеркало полиглотных моделей на DSL-лабораторию Университета Стони Брук вместо облачного хранилища Google.
zh_cn: 将聚划算模型镜像改为石溪大学DSL实验室,而不是谷歌云存储。

source: Developer
ru: Разработчик
zh_cn: 开发商

source: Embeddings
ru: Эмбеддинг
zh_cn: 嵌入

source: Features
ru: Особенности
zh_cn: 特点

source: First release on PyPI.
ru: Первый релиз на PyPI.
zh_cn: 首次在PyPI上发布。

source: Free software: GPLv3 license
ru: Свободные программы:лицензия GPLv3
zh_cn: 免费软件:GPLv3许可证

source: History
ru: История
zh_cn: 历程

source: Language Detection
ru: Обнаружение языка
zh_cn: 语言检测

source: Language detection (196 Languages)
ru: Определение языка (196 Языки)
zh_cn: 语言检测(196种语言)

source: Morphological analysis (135 Languages)
ru: Морфологический анализ (135 Языков)
zh_cn: 形态分析(135种语言)

source: Morphology
ru: Морфология
zh_cn: 形态学

source: Named Entity Recognition
ru: Признание наименования организации
zh_cn: 命名实体识别

source: Named Entity Recognition (40 Languages)
ru: Признание организации (40 языков)
zh_cn: 命名实体识别(40种语言

source: New Features: - Support Transfer POS Tagging. - Support supplying
ru: Новые возможности:-Поддержка передачи POS тегирования.-Поддержка поставки
zh_cn: 新功能。-支持转移POS标签。-支持供应

source: Part of Speech Tagging
ru: Часть маркировки речи
zh_cn: 语音标签的一部分

source: Part of Speech Tagging (16 Languages)
ru: Часть речевой маркировки (16 языков)
zh_cn: 语音标签的一部分(16种语言

source: Polarity
ru: Полярность
zh_cn: 极性

source: Polyglot is a natural language pipeline that supports massive multilingual applications.
ru: Полиглот-это естественный языковой конвейер,поддерживающий массивные многоязычные приложения.
zh_cn: Polyglot是一个支持大规模多语言应用的自然语言管道。

source: Polyglot is feature complete.
ru: Функция Полиглот завершена.
zh_cn: Polyglot是功能齐全的。

source: Quick Tutorial
ru: Краткое руководство
zh_cn: 快速教程

source: Rami Al-Rfou @
ru: Рами Ар-Рфу @

source: Sentiment Analysis (136 Languages)
ru: Анализ настроений (136 Языков)
zh_cn: 情感分析(136种语言)

source: Text
ru: Текст
zh_cn: Tekst

source: Tokenization
ru: Токенизация
zh_cn: 标记化

source: Tokenization (165 Languages)
ru: Токенизация (165 Языков)
zh_cn: 记号化(165种语言)

source: Transliteration
ru: Транслитерация
zh_cn: 翻译

source: Transliteration (69 Languages)
ru: Транслитерация (69 Языков)
zh_cn: 翻译(69种语言)

source: Word Embeddings (137 Languages)
ru: Словесные вставки (137 языков)
zh_cn: 词语嵌入(137种语言

source: for
ru: для
zh_cn: 对于

source: hint_language_code
ru: код_подсказки
