Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/dom/dom.*.011.xlf
Languages: ja, ko, ru, zh_cn

source: Adds <a href="mediakeys"><code>MediaKeys</code></a>, <a href="https://developer.mozilla.org/en-US/docs/Web/API/MediaEncryptedEvent"><code>MediaEncryptedEvent</code></a>, <a href="https://developer.mozilla.org/en-US/docs/Web/API/SetMediaKeys"><code>setMediaKeys</code></a>, <a href="https://developer.mozilla.org/en-US/docs/Web/API/Onencrypted"><code>onencrypted</code></a>, and <a href="https://developer.mozilla.org/en-US/docs/Web/API/Onwaitingforkey"><code>onwaitingforkey</code></a>.
ja: 追加<a href="mediakeys"> <code>MediaKeys</code> </a>、<a href="https://developer.mozilla.org/en-US/docs/Web/API/MediaEncryptedEvent"> <code>MediaEncryptedEvent</code> </a>、<a href="https://developer.mozilla.org/en-US/docs/Web/API/SetMediaKeys"> <code>setMediaKeys</code> </a>、<a href="https://developer.mozilla.org/en-US/docs/Web/API/Onencrypted"> <code>onencrypted</code> </a>、および<a href="https://developer.mozilla.org/en-US/docs/Web/API/Onwaitingforkey"> <code>onwaitingforkey</code> </a>。
ko: 을 추가의 <a href="mediakeys"> <code>MediaKeys</code> 는</a> , <a href="https://developer.mozilla.org/en-US/docs/Web/API/MediaEncryptedEvent"> <code>MediaEncryptedEvent</code> 는</a> , <a href="https://developer.mozilla.org/en-US/docs/Web/API/SetMediaKeys"> <code>setMediaKeys</code> 는</a> , <a href="https://developer.mozilla.org/en-US/docs/Web/API/Onencrypted"> <code>onencrypted</code> </a> 및 <a href="https://developer.mozilla.org/en-US/docs/Web/API/Onwaitingforkey"> <code>onwaitingforkey</code> </a> .
ru: Добавляет <a href="mediakeys"> <code>MediaKeys</code> </a> , <a href="https://developer.mozilla.org/en-US/docs/Web/API/MediaEncryptedEvent"> <code>MediaEncryptedEvent</code> </a> , <a href="https://developer.mozilla.org/en-US/docs/Web/API/SetMediaKeys"> <code>setMediaKeys</code> </a> , <a href="https://developer.mozilla.org/en-US/docs/Web/API/Onencrypted"> <code>onencrypted</code> </a> и <a href="https://developer.mozilla.org/en-US/docs/Web/API/Onwaitingforkey"> <code>onwaitingforkey</code> </a> .
zh_cn: 添加<a href="mediakeys"> <code>MediaKeys</code> </a>，<a href="https://developer.mozilla.org/en-US/docs/Web/API/MediaEncryptedEvent"> <code>MediaEncryptedEvent</code> </a>，<a href="https://developer.mozilla.org/en-US/docs/Web/API/SetMediaKeys"> <code>setMediaKeys</code> </a>，<a href="https://developer.mozilla.org/en-US/docs/Web/API/Onencrypted"> <code>onencrypted</code> </a>和<a href="https://developer.mozilla.org/en-US/docs/Web/API/Onwaitingforkey"> <code>onwaitingforkey</code> </a>。

source: Adds <code>GLuint64EXT</code>
ja: <code>GLuint64EXT</code> を追加します
ko: <code>GLuint64EXT</code> 추가
ru: Добавляет <code>GLuint64EXT</code>
zh_cn: 添加 <code>GLuint64EXT</code>

source: Adds <code>PerformanceFrameTiming</code> interface.
ja: <code>PerformanceFrameTiming</code> インターフェイスを追加します。
ko: <code>PerformanceFrameTiming</code> 인터페이스를 추가합니다 .
ru: Добавляет интерфейс <code>PerformanceFrameTiming</code> .
zh_cn: 添加 <code>PerformanceFrameTiming</code> 接口。

source: Adds <code>PerformanceNavigationTiming</code>
ja: <code>PerformanceNavigationTiming</code> を追加します
ko: <code>PerformanceNavigationTiming</code> 추가
ru: Добавляет <code>PerformanceNavigationTiming</code>
zh_cn: 添加 <code>PerformanceNavigationTiming</code>

source: Adds <code>allowPaymentRequest</code> property.
ja: <code>allowPaymentRequest</code> プロパティを追加します。
ko: <code>allowPaymentRequest</code> 속성을 추가합니다 .
ru: Добавляет свойство <code>allowPaymentRequest</code> .
zh_cn: 添加 <code>allowPaymentRequest</code> 属性。

source: Adds <code>getSelection()</code>, <code>onselectstart</code> and <code>onselectionchange</code>.
ja: 追加 <code>getSelection()</code> 、 <code>onselectstart</code> と <code>onselectionchange</code> 。
ko: <code>getSelection()</code> , <code>onselectstart</code> 및 <code>onselectionchange</code> 를 추가합니다 .
ru: Добавляет <code>getSelection()</code> , <code>onselectstart</code> и <code>onselectionchange</code> .
zh_cn: 添加 <code>getSelection()</code> ， <code>onselectstart</code> 和 <code>onselectionchange</code> 。

source: Adds <code>includes()</code>.
ja: contains <code>includes()</code> 追加します。
ko: contains <code>includes()</code> 추가합니다 .
ru: Добавляет <code>includes()</code> .
zh_cn: 添加 <code>includes()</code> 。

source: Adds <code>lock()</code> and <code>unlock()</code>.
ja: <code>lock()</code> および <code>unlock()</code> を追加します。
ko: <code>lock()</code> 및 <code>unlock()</code> 추가합니다 .
ru: Добавляет <code>lock()</code> и <code>unlock()</code> .
zh_cn: 添加 <code>lock()</code> 和 <code>unlock()</code> 。

source: Adds <code>mark()</code>, <code>clearMarks()</code>, <code>measure()</code> and <code>clearMeasures()</code> methods to the <code>Performance</code> interface. Adds the <code>PerformanceMark</code> and <code>PeformanceMeasure</code> interfaces.
ja: <code>mark()</code> 、 <code>clearMarks()</code> 、 <code>measure()</code> 、および <code>clearMeasures()</code> メソッドを <code>Performance</code> インターフェイスに追加します。 <code>PerformanceMark</code> および <code>PeformanceMeasure</code> インターフェイスを追加します。
ko: 하여 ADDS <code>mark()</code> , <code>clearMarks()</code> , <code>measure()</code> 와 <code>clearMeasures()</code> 받는 방법 <code>Performance</code> 인터페이스. <code>PerformanceMark</code> 및 <code>PeformanceMeasure</code> 인터페이스를 추가합니다 .
ru: Добавляет <code>clearMarks()</code> <code>mark()</code> , clearMarks () , <code>measure()</code> и <code>clearMeasures()</code> в интерфейс <code>Performance</code> . Добавляет интерфейсы <code>PerformanceMark</code> и <code>PeformanceMeasure</code> .
zh_cn: 将 <code>mark()</code> ， <code>clearMarks()</code> ， <code>measure()</code> 和 <code>clearMeasures()</code> 方法添加到 <code>Performance</code> 接口。添加 <code>PerformanceMark</code> 和 <code>PeformanceMeasure</code> 接口。

source: Adds <code>onpointerlockchange</code> and <code>onpointerlockerror</code> on <a href="document"><code>Document</code></a>. It is experimentally implemented on <code>GlobalEventHandlers</code>.
ja: <a href="document"> <code>Document</code> に</a> <code>onpointerlockchange</code> と <code>onpointerlockerror</code> を追加します。 <code>GlobalEventHandlers</code> に実験的に実装されています。
ko: <a href="document"> <code>Document</code> </a> 에 <code>onpointerlockchange</code> 및 <code>onpointerlockerror</code> 를 추가합니다 . <code>GlobalEventHandlers</code> 에서 실험적으로 구현됩니다 .
ru: Добавляет <code>onpointerlockchange</code> и <code>onpointerlockerror</code> в <a href="document"> <code>Document</code> </a> . Экспериментально реализовано на <code>GlobalEventHandlers</code> .
zh_cn: 在<a href="document"> <code>Document</code> </a>上添加 <code>onpointerlockchange</code> 和 <code>onpointerlockerror</code> 。它在 <code>GlobalEventHandlers</code> 上通过实验实现。

source: Adds <code>onselectionchange.</code>
ja: <code>onselectionchange.</code> 追加します。
ko: 선택 변경을 추가합니다 <code>onselectionchange.</code>
ru: Добавляет <code>onselectionchange.</code>
zh_cn: 添加 <code>onselectionchange.</code>

source: Adds <code>performance</code> attribute on <code>Window</code> and <code>WorkerGlobalScope</code>.
ja: <code>Window</code> および <code>WorkerGlobalScope</code> に <code>performance</code> 属性を追加します。
ko: <code>Window</code> 및 <code>WorkerGlobalScope</code> 에 <code>performance</code> 속성을 추가합니다 .
ru: Добавляет атрибут <code>performance</code> в <code>Window</code> и <code>WorkerGlobalScope</code> .
zh_cn: 在 <code>Window</code> 和 <code>WorkerGlobalScope</code> 上添加 <code>performance</code> 属性。

source: Adds <code>sinkId</code> and <code>setSinkId()</code>, and <code>captureStream()</code>.
ja: <code>sinkId</code> と <code>setSinkId()</code> 、および <code>captureStream()</code> を追加します。
ko: <code>sinkId</code> 및 <code>setSinkId()</code> 및 <code>captureStream()</code> 추가합니다 .
ru: Добавляет <code>sinkId</code> и <code>setSinkId()</code> и <code>captureStream()</code> .
zh_cn: 添加 <code>sinkId</code> 和 <code>setSinkId()</code> 以及 <code>captureStream()</code> 。

source: Adds a <a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/big"><code>&lt;big&gt;</code></a> tag around the selection or at the insertion point. (Not supported by Internet Explorer.)
ja: 選択範囲の周囲または挿入ポイントに<a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/big"> <code>&lt;big&gt;</code> </a>タグを追加します。（Internet Explorerではサポートされていません。）
ko: 선택 영역 주위 또는 삽입 점에 <a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/big"> <code>&lt;big&gt;</code> </a> 태그를 추가합니다 . (Internet Explorer에서는 지원되지 않습니다.)
ru: Добавляет <a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/big"> <code>&lt;big&gt;</code> </a> вокруг выделения или в точке вставки. (Не поддерживается Internet Explorer.)
zh_cn: 在选区周围或插入点添加<a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/big"> <code>&lt;big&gt;</code> </a>标记。（Internet Explorer不支持。）

source: Adds a <a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/small"><code>&lt;small&gt;</code></a> tag around the selection or at the insertion point. (Not supported by Internet Explorer.)
ja: 選択範囲の周囲または挿入ポイントに<a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/small"> <code>&lt;small&gt;</code> </a>タグを追加します。（Internet Explorerではサポートされていません。）
ko: 선택 영역 주위 또는 삽입 지점에 <a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/small"> <code>&lt;small&gt;</code> </a> 태그를 추가합니다 . (Internet Explorer에서는 지원되지 않습니다.)
ru: Добавляет <a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/small"> <code>&lt;small&gt;</code> </a> вокруг выделения или в точке вставки. (Не поддерживается Internet Explorer.)
zh_cn: 在选区周围或插入点添加<a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/small"> <code>&lt;small&gt;</code> </a>标记。（Internet Explorer不支持。）

source: Adds a circular arc to the path with the given control points and radius, connected to the previous point by a straight line.
ja: 与えられた制御点と半径を持つパスに円弧を追加し、前の点に直線で接続します。
ko: 주어진 제어점과 반지름으로 경로에 원호를 추가하고 직선으로 이전 점에 연결합니다.
ru: Добавляет круговую дугу к траектории с заданными контрольными точками и радиусом,соединенную с предыдущей точкой прямой.
zh_cn: 在给定控制点和半径的路径上添加一个圆弧,通过直线与前一点连接。

source: Adds a cubic B&eacute;zier curve to the path. It requires three points. The first two points are control points and the third one is the end point. The starting point is the last point in the current path, which can be changed using <code>moveTo()</code> before creating the B&eacute;zier curve.
ja: パスに3次ベジェ曲線を追加します。3点必要です。最初の2つのポイントはコントロールポイントで、3番目のポイントはエンドポイントです。開始点は現在のパスの最後の点であり、ベジェ曲線を作成する前に <code>moveTo()</code> を使用して変更できます。
ko: 3 차 베 지어 곡선을 경로에 추가합니다. 세 점이 필요합니다. 처음 두 점은 제어 점이고 세 ​​번째 점은 끝점입니다. 시작점은 현재 경로의 마지막 점이며 베 지어 곡선을 만들기 전에 <code>moveTo()</code> 를 사용하여 변경할 수 있습니다 .
ru: Добавляет кубическую кривую Безье к пути. Требуется три очка. Первые две точки являются контрольными точками, а третья является конечной точкой. Начальной точкой является последняя точка в текущем пути, которую можно изменить с помощью <code>moveTo()</code> перед созданием кривой Безье.
zh_cn: 将三次贝塞尔曲线添加到路径。它需要三点。前两个点是控制点，第三个点是终点。起点是当前路径中的最后一点，可以在创建贝塞尔曲线之前使用 <code>moveTo()</code> 对其进行更改。

source: Adds a cue (specified as a <a href="texttrackcue"><code>TextTrackCue</code></a> object to the track's list of cues.
ja: キュー（<a href="texttrackcue"> <code>TextTrackCue</code> </a>オブジェクトとして指定）をトラックのキューのリストに追加します。
ko: 큐 ( <a href="texttrackcue"> <code>TextTrackCue</code> </a> 객체로 지정)를 트랙의 큐 목록에 추가합니다 .
ru: Добавляет сигнал (указанный как объект <a href="texttrackcue"> <code>TextTrackCue</code> </a> в список сигналов дорожки.
zh_cn: 将提示（指定为<a href="texttrackcue"> <code>TextTrackCue</code> </a>对象）添加到轨道的提示列表中。

source: Adds a font to the font set.
ja: フォントをフォントセットに追加します。
ko: 서체 세트에 서체를 추가합니다.
ru: Добавляет шрифт в набор шрифтов.
zh_cn: 将字体添加到字体集中。

source: Adds a heading element around a selection or insertion point line. Requires the tag-name string as a value argument (i.e. <code>"H1"</code>, <code>"H6"</code>). (Not supported by Internet Explorer and Safari.)
ja: 選択または挿入ポイント線の周りに見出し要素を追加します。値の引数としてタグ名文字列が必要です（つまり、 <code>"H1"</code> 、 <code>"H6"</code> ）。（Internet ExplorerおよびSafariではサポートされていません。）
ko: 선택 또는 삽입 점 선 주위에 제목 요소를 추가합니다. 태그 이름 문자열이 값 인수 (예 : <code>"H1"</code> , <code>"H6"</code> )로 필요합니다. (Internet Explorer 및 Safari에서는 지원되지 않습니다.)
ru: Добавляет элемент заголовка вокруг линии точки выделения или вставки. Требуется строка имени тега в качестве аргумента значения (т. <code>"H1"</code> , <code>"H6"</code> ). (Не поддерживается Internet Explorer и Safari.)
zh_cn: 在选择或插入点线周围添加标题元素。需要标记名称字符串作为值参数（即 <code>"H1"</code> ， <code>"H6"</code> ）。（Internet Explorer和Safari不支持。）

source: Adds a hit region to the canvas.
ja: キャンバスにヒット領域を追加します。
ko: 캔버스에 적중 영역을 추가합니다.
ru: Добавляет область попадания на холст.
zh_cn: 在画布上添加一个命中区域。

source: Adds a listener to the <code>MediaQueryListener</code> that will run a custom callback function in response to the media query status changing. This is basically an alias for <a href="eventtarget/addeventlistener"><code>EventTarget.addEventListener()</code></a>, for backwards compatibility purposes.
ja: メディアクエリのステータスの変化に応じてカスタムコールバック関数を実行するリスナーを <code>MediaQueryListener</code> に追加します。これは基本的に、下位互換性のために、<a href="eventtarget/addeventlistener"> <code>EventTarget.addEventListener()</code> の</a>エイリアスです。
ko: 미디어 쿼리 상태 변경에 대한 응답으로 사용자 정의 콜백 함수를 실행할 리스너를 <code>MediaQueryListener</code> 에 추가합니다 . 기본적으로 이전 버전과의 호환성을 위해 <a href="eventtarget/addeventlistener"> <code>EventTarget.addEventListener()</code> </a> 의 별칭입니다 .
ru: Добавляет прослушиватель в <code>MediaQueryListener</code> , который будет запускать пользовательскую функцию обратного вызова в ответ на изменение состояния медиазапроса. Это в основном псевдоним для <a href="eventtarget/addeventlistener"> <code>EventTarget.addEventListener()</code> </a> , для целей обратной совместимости.
zh_cn: 向 <code>MediaQueryListener</code> 添加一个侦听器，该侦听器将运行自定义回调函数以响应媒体查询状态的更改。从<a href="eventtarget/addeventlistener"> <code>EventTarget.addEventListener()</code> </a>，这是EventTarget.addEventListener（）的别名，用于向后兼容。

source: Adds a marker to the browser's <a href="https://developer.chrome.com/devtools/docs/timeline">Timeline</a> or <a href="https://developer.mozilla.org/en-US/docs/Tools/Performance/Waterfall">Waterfall</a> tool.
ja: ブラウザの<a href="https://developer.chrome.com/devtools/docs/timeline">タイムライン</a>または<a href="https://developer.mozilla.org/en-US/docs/Tools/Performance/Waterfall">ウォーターフォール</a>ツールにマーカーを追加します。
ko: 브라우저의 <a href="https://developer.chrome.com/devtools/docs/timeline">타임 라인</a> 또는 <a href="https://developer.mozilla.org/en-US/docs/Tools/Performance/Waterfall">워터 폴</a> 도구에 마커를 추가합니다 .
ru: Добавляет маркер на <a href="https://developer.chrome.com/devtools/docs/timeline">шкалу времени</a> или инструмент &laquo; <a href="https://developer.mozilla.org/en-US/docs/Tools/Performance/Waterfall">Водопад&raquo;</a> .
zh_cn: 将标记添加到浏览器的<a href="https://developer.chrome.com/devtools/docs/timeline">时间轴</a>或<a href="https://developer.mozilla.org/en-US/docs/Tools/Performance/Waterfall">瀑布</a>工具。

source: Adds a new <code>pname</code> value:
ja: 新しい <code>pname</code> 値を追加します。
ko: 새로운 <code>pname</code> 값을 추가합니다 :
ru: Добавляет новое значение <code>pname</code> :
zh_cn: 添加一个新的 <code>pname</code> 值：

source: Adds a new CSS declaration to the <code>StylePropertyMap</code> with the given property and value.
ja: 指定されたプロパティと値を <code>StylePropertyMap</code> して、新しいCSS宣言をStylePropertyMapに追加します。
ko: 주어진 속성과 값 을 사용하여 <code>StylePropertyMap</code> 에 새 CSS 선언을 추가합니다 .
ru: Добавляет новое объявление CSS в <code>StylePropertyMap</code> с заданным свойством и значением.
zh_cn: 使用给定的属性和值将新的CSS声明添加到 <code>StylePropertyMap</code> 中。

source: Adds a new stop, defined by an <code>offset</code> and a <code>color</code>, to the gradient. If the offset is not between <code>0</code> and <code>1</code>, inclusive, an <code>INDEX_SIZE_ERR</code> is raised; if the color can't be parsed as a CSS <a href="https://developer.mozilla.org/en-US/docs/Web/CSS/color_value"><code>&lt;color&gt;</code></a>, a <code>SYNTAX_ERR</code> is raised.
ja: <code>offset</code> と <code>color</code> で定義された新しいストップをグラデーションに追加します。オフセットの間にない場合は <code>0</code> と <code>1</code> 、包括的には、 <code>INDEX_SIZE_ERR</code> を上昇させます。色はCSSとして解析できない場合は<a href="https://developer.mozilla.org/en-US/docs/Web/CSS/color_value"> <code>&lt;color&gt;</code> </a>、 <code>SYNTAX_ERR</code> が発生します。
ko: <code>offset</code> 과 <code>color</code> 정의 된 새 정지 점 을 그라디언트에 추가합니다. 오프셋이 <code>0</code> 과 <code>1</code> 사이가 아닌 경우 <code>INDEX_SIZE_ERR</code> 이 발생합니다. 색상은 CSS로 구문 분석 할 수없는 경우 <a href="https://developer.mozilla.org/en-US/docs/Web/CSS/color_value"> <code>&lt;color&gt;</code> </a> 하는 <code>SYNTAX_ERR</code> 가 발생합니다.
ru: Добавляет новый градиент , определенный <code>offset</code> и <code>color</code> . Если смещение не находится между <code>0</code> и <code>1</code> включительно, <code>INDEX_SIZE_ERR</code> ; если цвет не может быть проанализирован как CSS <a href="https://developer.mozilla.org/en-US/docs/Web/CSS/color_value"> <code>&lt;color&gt;</code> </a> , <code>SYNTAX_ERR</code> .
zh_cn: 向渐变添加由 <code>offset</code> 和 <code>color</code> 定义的新色标。如果偏移量不在 <code>0</code> 和 <code>1</code> 之间（包括0和1），则引发 <code>INDEX_SIZE_ERR</code> ；否则，将引发INDEX_SIZE_ERR。如果不能将颜色解析为CSS <a href="https://developer.mozilla.org/en-US/docs/Web/CSS/color_value"> <code>&lt;color&gt;</code> </a>，则会引发 <code>SYNTAX_ERR</code> 。

source: Adds a path to the current path with an optional transformation matrix.
ja: 現在のパスに,オプションの変換行列を指定してパスを追加します.
ko: 선택적 변환 행렬을 사용하여 현재 경로에 경로를 추가합니다.
ru: Добавляет путь к текущему пути с помощью необязательной матрицы преобразования.
zh_cn: 在当前路径上添加一个带有转换矩阵的路径。

source: Adds a path to the current path.
ja: 現在のパスにパスを追加します。
ko: 현재 경로에 경로를 추가합니다.
ru: Добавляет путь к текущему пути.
zh_cn: 在当前路径上添加一个路径。

source: Adds a quadratic B&eacute;zier curve to the current path.
ja: 2次ベジェ曲線を現在のパスに追加します。
ko: 2 차 베 지어 곡선을 현재 경로에 추가합니다.
ru: Добавляет квадратичную кривую Безье к текущему пути.
zh_cn: 将二次贝塞尔曲线添加到当前路径。

source: Adds a rotation to the transformation matrix. The angle argument represents a clockwise rotation angle and is expressed in radians.
ja: 変換行列に回転を追加します。angle 引数は時計回りの回転角度を表し、ラジアン単位で表されます。
ko: 변환 행렬에 회전을 추가합니다. 각도 인수는 시계 방향 회전 각도를 나타내며 라디안으로 표시됩니다.
ru: Добавляет вращение к матрице преобразования.Аргумент угла представляет собой угол поворота по часовой стрелке и выражается в радиусах.
zh_cn: 在变换矩阵中添加一个旋转角度。角度参数代表顺时针旋转角度,以弧度表示。

source: Adds a scaling transformation to the canvas units by x horizontally and by y vertically.
ja: キャンバスの単位に、水平方向に x、垂直方向に y のスケーリング変換を追加します。
ko: x를 수평으로, y를 수직으로 캔버스 단위에 크기 조절 변형을 추가합니다.
ru: Добавляет масштабирующее преобразование к единицам холста по x по горизонтали и по y по вертикали.
zh_cn: 为画布单位添加水平方向x和垂直方向y的缩放变换。

source: Adds a single marker to the browser's <a href="https://developers.google.com/web/tools/chrome-devtools/evaluate-performance/reference">Performance</a> or <a href="https://developer.mozilla.org/en-US/docs/Tools/Performance/Waterfall">Waterfall</a> tool. This lets you correlate a point in your code with the other events recorded in the timeline, such as layout and paint events.
ja: ブラウザの<a href="https://developers.google.com/web/tools/chrome-devtools/evaluate-performance/reference">パフォーマンス</a>ツールまたは<a href="https://developer.mozilla.org/en-US/docs/Tools/Performance/Waterfall">ウォーターフォール</a>ツールに単一のマーカーを追加します。これにより、コード内のポイントを、レイアウトイベントやペイントイベントなど、タイムラインに記録された他のイベントと関連付けることができます。
ko: 브라우저의 <a href="https://developers.google.com/web/tools/chrome-devtools/evaluate-performance/reference">성능</a> 또는 <a href="https://developer.mozilla.org/en-US/docs/Tools/Performance/Waterfall">워터 폴</a> 도구에 단일 마커를 추가합니다 . 이를 통해 코드의 포인트를 타임 라인에 기록 된 다른 이벤트 (예 : 레이아웃 및 페인트 이벤트)와 상관시킬 수 있습니다.
ru: Добавляет один маркер в инструмент <a href="https://developers.google.com/web/tools/chrome-devtools/evaluate-performance/reference">производительности</a> браузера или <a href="https://developer.mozilla.org/en-US/docs/Tools/Performance/Waterfall">водопада</a> . Это позволяет вам сопоставить точку в вашем коде с другими событиями, записанными на временной шкале, такими как события макета и рисования.
zh_cn: 在浏览器的&ldquo; <a href="https://developers.google.com/web/tools/chrome-devtools/evaluate-performance/reference">性能&rdquo;</a>或&ldquo; <a href="https://developer.mozilla.org/en-US/docs/Tools/Performance/Waterfall">瀑布&rdquo;</a>工具中添加一个标记。这使您可以将代码中的一个点与时间轴中记录的其他事件（例如布局和绘画事件）相关联。

source: Adds a straight line to the path, going to the start of the current sub-path.
ja: 現在のサブパスの開始点に向かう直線をパスに追加します。
ko: 경로에 직선을 추가하여 현재 하위 경로의 시작으로 이동합니다.
ru: Добавляет прямую линию к пути,переходя к началу текущего подпути.
zh_cn: 在路径上添加一条直线,指向当前子路径的起点。

source: Adds a text track (such as a track for subtitles) to a media element.
ja: テキストトラック(字幕用トラックなど)をメディア要素に追加します。
ko: 미디어 요소에 텍스트 트랙 (예 : 자막 트랙)을 추가합니다.
ru: Добавляет текстовую дорожку (например,дорожку для субтитров)к медиа-элементу.
zh_cn: 为一个媒体元素添加一个文本轨道(如字幕的轨道)。

source: Adds a translation transformation by moving the canvas and its origin x horzontally and y vertically on the grid.
ja: キャンバスとその原点をグリッド上で水平方向に x、垂直方向に y 移動させることで、並進変換を追加します。
ko: 캔버스에서 원점을 x 가로 및 세로로 y 격자에서 이동하여 변환 변환을 추가합니다.
ru: Добавляет преобразование перевода,перемещая холст и его начало x по горизонтали и y по вертикали на сетке.
zh_cn: 通过在网格上移动画布及其原点的水平方向x和垂直方向y来添加平移变换。

source: Adds additional parameter names.
ja: パラメータ名を追加します。
ko: 추가 매개 변수 이름을 추가합니다.
ru: Добавляет имена дополнительных параметров.
zh_cn: 添加附加参数名称。

source: Adds all the children of the specified node to the selection.
ja: 指定したノードのすべての子を選択範囲に追加します。
ko: 지정된 노드의 모든 하위를 선택에 추가합니다.
ru: Добавляет всех детей указанного узла в выборку.
zh_cn: 将指定节点的所有子节点添加到选择中。

source: Adds an <a href="speechsynthesisutterance"><code>utterance</code></a> to the utterance queue; it will be spoken when any other utterances queued before it have been spoken.
ja: <a href="speechsynthesisutterance"> <code>utterance</code> </a>を発話キューに追加します。それが話される前に、他の発言がキューに入れられたときに話されます。
ko: 발언 대기열에 <a href="speechsynthesisutterance"> <code>utterance</code> </a> 을 추가합니다 . 다른 발언이 발언되기 전에 발언 될 때 발언됩니다.
ru: Добавляет <a href="speechsynthesisutterance"> <code>utterance</code> </a> в очередь высказываний; он будет произнесен, когда любые другие высказывания поставлены в очередь, прежде чем они произнесены.
zh_cn: 增加了一个<a href="speechsynthesisutterance"> <code>utterance</code> </a>的发声队列; 在说完其他话语之后，就会说出它。
