Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/dom/dom.*.007.xlf
Languages: es, ko, ru, zh_cn

source: <em>No specific methods; inherits methods from its parent, <a href="htmlelement"><code>HTMLElement</code></a> and from <a href="windoweventhandlers"><code>WindowEventHandlers</code></a></em><em>.</em>
es: <em>No hay m&eacute;todos espec&iacute;ficos; hereda m&eacute;todos de su padre, <a href="htmlelement"> <code>HTMLElement</code> </a> y de <a href="windoweventhandlers"> <code>WindowEventHandlers</code> </a></em><em> .</em>
ko: <em>구체적인 방법은 없습니다. 부모, <a href="htmlelement"> <code>HTMLElement</code> </a> 및 <a href="windoweventhandlers"> <code>WindowEventHandlers</code> </a></em><em> 에서 메소드를 상속합니다 </em><em>.</em>
ru: <em>Нет конкретных методов; наследует методы от своего родителя, <a href="htmlelement"> <code>HTMLElement</code> </a> и от <a href="windoweventhandlers"> <code>WindowEventHandlers</code> </a></em><em> .</em>
zh_cn: <em>没有具体方法；从其父<a href="htmlelement"> <code>HTMLElement</code> </a>和<a href="windoweventhandlers"> <code>WindowEventHandlers</code> </a></em><em>继承方法</em><em>。</em>

source: <em>No specific methods; inherits methods from its parent, <a href="htmlelement"><code>HTMLElement</code></a>.</em>
es: <em>No hay m&eacute;todos espec&iacute;ficos; hereda m&eacute;todos de su padre, <a href="htmlelement"> <code>HTMLElement</code> </a> .</em>
ko: <em>구체적인 방법은 없습니다. 부모 <a href="htmlelement"> <code>HTMLElement</code> </a> 에서 메소드를 상속합니다 .</em>
ru: <em>Нет конкретных методов; наследует методы от своего родителя, <a href="htmlelement"> <code>HTMLElement</code> </a> .</em>
zh_cn: <em>没有具体方法；从其父<a href="htmlelement"> <code>HTMLElement</code> </a>继承方法。</em>

source: <em>No specific properties; inherits methods from its ancestors <a href="orientationsensor"><code>OrientationSensor</code></a> and <a href="sensor"><code>Sensor</code></a>.</em>
es: <em>Sin propiedades espec&iacute;ficas; hereda m&eacute;todos de sus antepasados <a href="orientationsensor"> <code>OrientationSensor</code> </a> y <a href="sensor"> <code>Sensor</code> </a> .</em>
ko: <em>특정 속성이 없습니다. 조상 <a href="orientationsensor"> <code>OrientationSensor</code> </a> 및 <a href="sensor"> <code>Sensor</code> </a> 에서 메소드를 상속합니다 .</em>
ru: <em>Нет конкретных свойств; наследует методы от своих предков <a href="orientationsensor"> <code>OrientationSensor</code> </a> и <a href="sensor"> <code>Sensor</code> </a> .</em>
zh_cn: <em>无具体特性；从其祖先<a href="orientationsensor"> <code>OrientationSensor</code> </a>和<a href="sensor"> <code>Sensor</code> </a>继承方法。</em>

source: <em>No specific property, but inherits properties from its parent, <a href="htmlelement"><code>HTMLElement</code></a>.</em>
es: <em>Ninguna propiedad espec&iacute;fica, pero hereda propiedades de su elemento primario, <a href="htmlelement"> <code>HTMLElement</code> </a> .</em>
ko: <em>특정 속성은 없지만 부모 <a href="htmlelement"> <code>HTMLElement</code> 의</a> 속성을 상속합니다 .</em>
ru: <em>Нет конкретного свойства, но наследует свойства от своего родителя, <a href="htmlelement"> <code>HTMLElement</code> </a> .</em>
zh_cn: <em>没有特定的属性，但是从其父<a href="htmlelement"> <code>HTMLElement</code> </a>继承属性。</em>

source: <em>No specific property; inherits properties from its parent, </em><em><a href="audionode"><code>AudioNode</code></a></em>.
es: <em>Ninguna propiedad espec&iacute;fica; hereda propiedades de su padre, </em><em><a href="audionode"> <code>AudioNode</code> </a></em> .
ko: <em>특정 속성이 없습니다. 부모 인 </em><em><a href="audionode"> <code>AudioNode</code> </a></em><em> 에서 속성을 상속합니다</em> .
ru: <em>Нет конкретной собственности; наследует свойства от своего родителя, </em><em><a href="audionode"> <code>AudioNode</code> </a></em> .
zh_cn: <em>没有特定的属性；从其父</em><em><a href="audionode"> <code>AudioNode</code> </a></em><em>继承属性</em>。

source: <em>No specific property; inherits properties from its parent, <a href="htmlelement"><code>HTMLElement</code></a>.</em>
es: <em>Ninguna propiedad espec&iacute;fica; hereda propiedades de su padre, <a href="htmlelement"> <code>HTMLElement</code> </a> .</em>
ko: <em>특정 속성이 없습니다. 부모 <a href="htmlelement"> <code>HTMLElement</code> </a> 에서 속성을 상속합니다 .</em>
ru: <em>Нет конкретной собственности; наследует свойства от своего родителя, <a href="htmlelement"> <code>HTMLElement</code> </a> .</em>
zh_cn: <em>没有特定的属性；从其父<a href="htmlelement"> <code>HTMLElement</code> </a>继承属性。</em>

source: <em>No specific property; inherits properties from its parent, <a href="htmlmediaelement"><code>HTMLMediaElement</code></a>, and from <a href="htmlelement"><code>HTMLElement</code></a>.</em>
es: <em>Ninguna propiedad espec&iacute;fica; hereda propiedades de su padre, <a href="htmlmediaelement"> <code>HTMLMediaElement</code> </a> y de <a href="htmlelement"> <code>HTMLElement</code> </a> .</em>
ko: <em>특정 속성이 없습니다. 부모, <a href="htmlmediaelement"> <code>HTMLMediaElement</code> </a> 및 <a href="htmlelement"> <code>HTMLElement</code> </a> 에서 속성을 상속합니다 .</em>
ru: <em>Нет конкретной собственности; наследует свойства от своего родителя, <a href="htmlmediaelement"> <code>HTMLMediaElement</code> </a> и от <a href="htmlelement"> <code>HTMLElement</code> </a> .</em>
zh_cn: <em>没有特定的属性；从其父<a href="htmlmediaelement"> <code>HTMLMediaElement</code> </a>和<a href="htmlelement"> <code>HTMLElement</code> </a>继承属性。</em>

source: <em>None; also, <code>PeriodicWave</code> doesn't inherit any properties.</em>
es: <em>Ninguna; Adem&aacute;s, <code>PeriodicWave</code> no hereda ninguna propiedad.</em>
ko: <em>없음 또한 <code>PeriodicWave</code> 는 속성을 상속하지 않습니다.</em>
ru: <em>Никто; Кроме того, <code>PeriodicWave</code> не наследует никаких свойств.</em>
zh_cn: <em>没有; 同样， <code>PeriodicWave</code> 不继承任何属性。</em>

source: <em>Not supported</em>
es: <em>No soportado</em>
ko: <em>미지원</em>
ru: <em>Не поддерживается</em>
zh_cn: <em>不支持</em>

source: <em>Not used</em>
es: <em>No utilizado</em>
ko: <em>미사용</em>
ru: <em>Не используется</em>
zh_cn: <em>不曾用过</em>

source: <em>Note that the TreeWalker only considers visible DOM nodes.</em>
es: <em>Tenga en cuenta que TreeWalker solo considera los nodos DOM visibles.</em>
ko: <em>TreeWalker는 가시적 인 DOM 노드 만 고려합니다.</em>
ru: <em>Обратите внимание, что TreeWalker рассматривает только видимые узлы DOM.</em>
zh_cn: <em>请注意，TreeWalker仅考虑可见的DOM节点。</em>

source: <em>Note: An Audio element constructed with <code>new Audio()</code> won't be garbage collected as long as playback is in progress. It will continue playing and be audible until <code>pause()</code> is called or playback finishes.</em>
es: <em>Nota: Un elemento de audio construido con <code>new Audio()</code> no se recolectar&aacute; basura mientras la reproducci&oacute;n est&eacute; en progreso. Continuar&aacute; reproduci&eacute;ndose y ser&aacute; audible hasta que se llame <code>pause()</code> o finalice la reproducci&oacute;n.</em>
ko: <em>참고 : <code>new Audio()</code> 구성된 Audio 요소 는 재생이 진행되는 동안 가비지 수집되지 않습니다. <code>pause()</code> 가 호출되거나 재생이 완료 될 때까지 계속 재생되고들을 수 있습니다 .</em>
ru: <em>Примечание. Элемент Audio, созданный с помощью <code>new Audio()</code> , не будет собирать мусор, пока идет воспроизведение. Воспроизведение будет продолжаться до тех пор, пока не будет вызвана <code>pause()</code> или воспроизведение не закончится.</em>
zh_cn: <em>注意：只要播放正在进行，使用 <code>new Audio()</code> 构造的Audio元素就不会被垃圾回收。它会继续播放并且可以听见，直到调用 <code>pause()</code> 或播放结束为止。</em>

source: <em>Optional</em>. The types of access that can be performed in the transaction. Transactions are opened in one of three modes: <code>readonly</code>, <code>readwrite</code> and <code>readwriteflush</code> (non-standard, Firefox-only.) <code>versionchange</code> mode can't be specified here. If you don't provide the parameter, the default access mode is <code>readonly</code>. To avoid slowing things down, don't open a <code>readwrite</code> transaction unless you actually need to write into the database.
es: <em>Opcional</em> . Los tipos de acceso que se pueden realizar en la transacci&oacute;n. Las transacciones se abren en uno de tres modos: <code>readonly</code> , <code>readwrite</code> y <code>readwriteflush</code> (no est&aacute;ndar, Firefox-solamente.) <code>versionchange</code> modo no se puede especificar aqu&iacute;. Si no proporciona el par&aacute;metro, el modo de acceso predeterminado es de <code>readonly</code> . Para evitar ralentizar las cosas, no abra una transacci&oacute;n de <code>readwrite</code> y escritura a menos que realmente necesite escribir en la base de datos.
ko: <em>선택 사항</em> . 트랜잭션에서 수행 할 수있는 액세스 유형입니다. 거래는 세 가지 모드 중 하나에서 열립니다 : <code>readonly</code> , <code>readwrite</code> 및 <code>readwriteflush</code> 은 (표준이 아닌, 파이어 폭스 전용입니다.) <code>versionchange</code> 모드 여기에 지정 될 수 없습니다. 매개 변수를 제공하지 않으면 기본 액세스 모드는 <code>readonly</code> 입니다. 속도 저하를 피하려면 실제로 데이터베이스에 쓰지 않는 한 <code>readwrite</code> 트랜잭션을 열지 마십시오 .
ru: <em>Необязательно</em> . Типы доступа, которые могут быть выполнены в транзакции. Транзакции открываются в одном из трех режимов: режим <code>readonly</code> , <code>readwrite</code> и <code>readwriteflush</code> (нестандартный, только для Firefox.). <code>versionchange</code> нельзя указывать режим смены версий . Если вы не предоставите параметр, режим доступа по умолчанию <code>readonly</code> . Чтобы избежать замедления, не открывайте транзакцию <code>readwrite</code> , если вам не нужно записывать в базу данных.
zh_cn: <em>可选的</em>。可以在事务中执行的访问类型。事务以以下三种模式之一打开： <code>readonly</code> ， <code>readwrite</code> 和 <code>readwriteflush</code> （非标准，仅Firefox。） <code>versionchange</code> 无法指定版本更改模式。如果不提供该参数，则默认访问模式为 <code>readonly</code> 。为避免速度变慢，除非您确实需要写入数据库，否则不要打开 <code>readwrite</code> 事务。

source: <em>Pointer capture</em> allows events for a particular <em>pointer event</em> (<a href="../pointerevent"><code>PointerEvent</code></a>) to be re-targeted to a particular element instead of the normal target (or <em>hit test</em>) at a pointer's location. This can be used to ensure that an element continues to receive pointer events even if the pointer device's contact moves off the element (for example by scrolling).
es: <em>La captura de puntero</em> permite que los eventos para un <em>evento de puntero</em> particular ( <a href="../pointerevent"> <code>PointerEvent</code> </a> ) se vuelvan a dirigir a un elemento particular en lugar del objetivo normal (o <em>prueba de impacto</em> ) en la ubicaci&oacute;n de un puntero. Esto se puede usar para garantizar que un elemento contin&uacute;e recibiendo eventos de puntero, incluso si el contacto del dispositivo puntero se mueve fuera del elemento (por ejemplo, desplaz&aacute;ndose).
ko: <em>포인터 캡처를</em> 사용하면 특정 <em>포인터 이벤트</em> ( <a href="../pointerevent"> <code>PointerEvent</code> </a> )에 대한 이벤트를 <em>포인터 위치</em> 의 일반 대상 (또는 <em>적중 테스트</em> ) 대신 특정 요소로 다시 대상 지정할 수 있습니다. 포인터 장치의 접촉이 요소 밖으로 이동하더라도 요소가 계속 포인터 이벤트를 수신하도록하는 데 사용할 수 있습니다 (예 : 스크롤).
ru: <em>Захват указателя</em> позволяет <a href="../pointerevent"> <code>PointerEvent</code> </a> события для конкретного <em>события указателя</em> ( PointerEvent ) на определенный элемент вместо обычной цели (или <em>теста попадания</em> ) в месте расположения указателя. Это может быть использовано для обеспечения того, чтобы элемент продолжал получать события указателя, даже если контакт устройства указателя перемещается с элемента (например, путем прокрутки).
zh_cn: <em>指针捕获</em>允许将特定<em>指针事件</em>（<a href="../pointerevent"> <code>PointerEvent</code> </a>）的<em>事件</em>重新定位到特定元素，而不是指针位置处的常规目标（或<em>命中测试</em>）。这可以用于确保即使指针设备的触点移离元素（例如，通过滚动），元素也继续接收指针事件。

source: <em>Rather than throw a traditional exception, the <code>requestFullscreen()</code> procedure announces error conditions by rejecting the <code>Promise</code> it has returned. The rejection handler receives one of the following exception values:</em>
es: <em>En lugar de lanzar una excepci&oacute;n tradicional, el procedimiento <code>requestFullscreen()</code> anuncia condiciones de error al rechazar la <code>Promise</code> que ha devuelto. El controlador de rechazo recibe uno de los siguientes valores de excepci&oacute;n:</em>
ko: <em> <code>requestFullscreen()</code> 프로시 저는 일반적인 예외를 발생 시키지 않고 반환 된 <code>Promise</code> 를 거부하여 오류 조건을 알려 줍니다. 거부 핸들러는 다음 예외 값 중 하나를 수신합니다.</em>
ru: <em>Вместо того, чтобы <code>requestFullscreen()</code> традиционное исключение, процедура requestFullscreen () объявляет условия ошибки, отклоняя <code>Promise</code> она возвратила. Обработчик отклонения получает одно из следующих значений исключений:</em>
zh_cn: <em>除了抛出传统异常外， <code>requestFullscreen()</code> 过程通过拒绝已返回的 <code>Promise</code> 来宣布错误情况。拒绝处理程序接收以下异常值之一：</em>

source: <em>Reserved for future use</em>
es: <em>reservado para uso futuro</em>
ko: <em>나중에 사용하기 위해 예약 됨</em>
ru: <em>Зарезервировано для будущего использования</em>
zh_cn: <em>保留以备将来使用</em>

source: <em>Selectors</em> can also be really powerful, as demonstrated in the following example. Here, the first <a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/input"><code>&lt;input&gt;</code></a> element with the name "login" (<code>&lt;input name="login"/&gt;</code>) located inside a <a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/div"><code>&lt;div&gt;</code></a> whose class is "user-panel main" (<code>&lt;div class="user-panel main"&gt;</code>) in the document is returned:
es: <em>Los selectores</em> tambi&eacute;n pueden ser realmente poderosos, como se demuestra en el siguiente ejemplo. Aqu&iacute;, el primer elemento <a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/input"> <code>&lt;input&gt;</code> </a> con el nombre "login" ( <code>&lt;input name="login"/&gt;</code> ) ubicado dentro de un <a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/div"> <code>&lt;div&gt;</code> </a> cuya clase es "user-panel main" ( <code>&lt;div class="user-panel main"&gt;</code> ) en el documento se devuelve:
ko: <em></em>다음 예제에서 설명 된 것처럼 <em>선택기</em> 는 실제로 강력 할 수도 있습니다. 여기에서 클래스가 "user-panel main"( <code>&lt;div class="user-panel main"&gt;</code> 인 <a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/div"> <code>&lt;div&gt;</code> </a> 내부에 이름이"login "( <code>&lt;input name="login"/&gt;</code> ) 인 첫 번째 <a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/input"> <code>&lt;input&gt;</code> </a> 요소 문서의 "&gt; )가 리턴됩니다.
ru: <em>Селекторы</em> также могут быть действительно мощными, как показано в следующем примере. Здесь первый элемент <a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/input"> <code>&lt;input&gt;</code> </a> с именем "login" ( <code>&lt;input name="login"/&gt;</code> ) находится внутри элемента <a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/div"> <code>&lt;div&gt;</code> </a> , класс которого является "user-panel main" ( <code>&lt;div class="user-panel main"&gt;</code> ) в документе возвращается:
zh_cn: <em>选择器</em>也可能非常强大，如以下示例所示。在这里，第一个<a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/input"> <code>&lt;input&gt;</code> </a>元素名为&ldquo; login&rdquo;（ <code>&lt;input name="login"/&gt;</code> ）位于<a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/div"> <code>&lt;div&gt;</code> 内,</a>其类别为&ldquo; user-panel main&rdquo;（ <code>&lt;div class="user-panel main"&gt;</code> ）在文档中返回：

source: <em>Since <code>RTCTrackEvent</code> is based on <a href="event"><code>Event</code></a>, its properties are also available.</em>
es: <em>Dado que <code>RTCTrackEvent</code> se basa en <a href="event"> <code>Event</code> </a> , sus propiedades tambi&eacute;n est&aacute;n disponibles.</em>
ko: <em> <code>RTCTrackEvent</code> 는 <a href="event"> <code>Event</code> 를</a> 기반으로 하므로 해당 속성도 사용할 수 있습니다.</em>
ru: <em>Поскольку <code>RTCTrackEvent</code> основан на <a href="event"> <code>Event</code> </a> , его свойства также доступны.</em>
zh_cn: <em>由于 <code>RTCTrackEvent</code> 基于<a href="event"> <code>Event</code> </a>，所以它的属性也可用。</em>

source: <em>Supports the methods defined in <a href="event"><code>Event</code></a>. There are no additional methods.</em>
es: <em>Admite los m&eacute;todos definidos en <a href="event"> <code>Event</code> o</a> . No hay m&eacute;todos adicionales.</em>
ko: <em><a href="event"> <code>Event</code> 에</a> 정의 된 메소드를 지원합니다 . 추가 방법이 없습니다.</em>
ru: <em>Поддерживает методы, определенные в <a href="event"> <code>Event</code> </a> . Там нет никаких дополнительных методов.</em>
zh_cn: <em>支持<a href="event"> <code>Event</code> 中</a>定义的方法。没有其他方法。</em>

source: <em>The </em><em><code>NavigatorGeolocation</code></em><em> interface neither implements, nor inherit any method.</em>
es: <em>La </em><em>interfaz </em><em> <code>NavigatorGeolocation</code> </em><em> no implementa ni hereda ning&uacute;n m&eacute;todo.</em>
ko: <em></em><em> <code>NavigatorGeolocation</code> 의</em><em> 인터페이스도 구현 없으며, 어떤 방법을 상속합니다.</em>
ru: <em>Интерфейс </em><em> <code>NavigatorGeolocation</code> </em><em> не реализует и не наследует какой-либо метод.</em>
zh_cn: <em>所述</em><em> <code>NavigatorGeolocation</code> </em><em>界面既不器具，也不继承的任何方法。</em>

source: <em>The </em><em><code>NavigatorID</code></em><em> interface doesn't inherit any methods.</em>
es: <em>La </em><em>interfaz </em><em> <code>NavigatorID</code> </em><em> no hereda ning&uacute;n m&eacute;todo.</em>
ko: <em></em><em> <code>NavigatorID</code> 의</em><em> 인터페이스는 어떤 방법을 상속하지 않습니다.</em>
ru: <em>Интерфейс </em><em> <code>NavigatorID</code> </em><em> не наследует никаких методов.</em>
zh_cn: <em>该</em><em> <code>NavigatorID</code> </em><em>接口不继承任何方法。</em>

source: <em>The </em><em><code>NavigatorLanguage</code></em><em> interface neither implements, nor inherit any method.</em>
es: <em>La </em><em>interfaz </em><em> <code>NavigatorLanguage</code> </em><em> no implementa ni hereda ning&uacute;n m&eacute;todo.</em>
ko: <em></em><em> <code>NavigatorLanguage</code> 의</em><em> 인터페이스도 구현 없으며, 어떤 방법을 상속합니다.</em>
ru: <em>Интерфейс </em><em> <code>NavigatorLanguage</code> </em><em> не реализует и не наследует какой-либо метод.</em>
zh_cn: <em>所述</em><em> <code>NavigatorLanguage</code> </em><em>界面既不器具，也不继承的任何方法。</em>

source: <em>The </em><em><code>NavigatorOnLine</code></em><em> interface neither implements, nor inherit any method.</em>
es: <em>La </em><em>interfaz </em><em> <code>NavigatorOnLine</code> </em><em> no implementa ni hereda ning&uacute;n m&eacute;todo.</em>
ko: <em></em><em> <code>NavigatorOnLine</code> 의</em><em> 인터페이스도 구현 없으며, 어떤 방법을 상속합니다.</em>
ru: <em>Интерфейс </em><em> <code>NavigatorOnLine</code> </em><em> не реализует и не наследует какой-либо метод.</em>
zh_cn: <em>所述</em><em> <code>NavigatorOnLine</code> </em><em>界面既不器具，也不继承的任何方法。</em>

source: <em>The </em><em><code>Transferable</code></em><em> interface does not implement or inherit specific properties.</em>
es: <em>La </em><em>interfaz </em><em> <code>Transferable</code> </em><em> no implementa ni hereda propiedades espec&iacute;ficas.</em>
ko: <em></em><em> <code>Transferable</code> </em><em> 인터페이스를 구현하거나 상속 특정 속성을하지 않습니다.</em>
ru: <em></em><em> <code>Transferable</code> </em><em> интерфейс не реализует или наследуют определенные свойства.</em>
zh_cn: <em>该</em><em> <code>Transferable</code> </em><em>接口没有实现或继承的特定属性。</em>

source: <em>The <a href="document"><code>Document</code></a> interface provides properties that can be used to determine if full-screen mode is supported and available, and if full-screen mode is currently active, which element is using the screen.</em>
es: <em>La interfaz de <a href="document"> <code>Document</code> </a> proporciona propiedades que se pueden usar para determinar si el modo de pantalla completa es compatible y est&aacute; disponible, y si el modo de pantalla completa est&aacute; actualmente activo, qu&eacute; elemento est&aacute; usando la pantalla.</em>
ko: <em><a href="document"> <code>Document</code> </a> 인터페이스는 풀 스크린 모드가 지원 가능한하고 있는지를 결정하는데 사용되는 특성을 제공하고, 전체 화면 모드가 현재 활성 인 경우, 어떤 요소 것은 스크린을 사용한다.</em>
ru: <em>Интерфейс <a href="document"> <code>Document</code> </a> предоставляет свойства, которые можно использовать для определения того, поддерживается ли полноэкранный режим и доступен ли он, и активен ли в настоящее время полноэкранный режим, какой элемент использует экран.</em>
zh_cn: <em>&ldquo; <a href="document"> <code>Document</code> </a>界面提供的属性可用于确定是否支持和可用全屏模式，以及当前是否处于全屏模式，以及哪个元素正在使用屏幕。</em>

source: <em>The <a href="speechsynthesisevent"><code>SpeechSynthesisEvent</code></a> interface also inherits methods from its parent interface, <a href="event"><code>Event</code></a>.</em>
es: <em>La interfaz <a href="speechsynthesisevent"> <code>SpeechSynthesisEvent</code> </a> tambi&eacute;n hereda m&eacute;todos de su interfaz principal, <a href="event"> <code>Event</code> </a> .</em>
ko: <em><a href="speechsynthesisevent"> <code>SpeechSynthesisEvent</code> 의</a> 인터페이스는 상위 인터페이스의 메서드 상속 <a href="event"> <code>Event</code> </a> .</em>
ru: <em>Интерфейс <a href="speechsynthesisevent"> <code>SpeechSynthesisEvent</code> </a> также наследует методы от своего родительского интерфейса <a href="event"> <code>Event</code> </a> .</em>
zh_cn: <em>该<a href="speechsynthesisevent"> <code>SpeechSynthesisEvent</code> </a>接口也继承其父接口，方法<a href="event"> <code>Event</code> </a>。</em>

source: <em>The <a href="speechsynthesisevent"><code>SpeechSynthesisEvent</code></a> interface also inherits properties from its parent interface, <a href="event"><code>Event</code></a>.</em>
es: <em>La interfaz <a href="speechsynthesisevent"> <code>SpeechSynthesisEvent</code> </a> tambi&eacute;n hereda propiedades de su interfaz principal, <a href="event"> <code>Event</code> </a> .</em>
ko: <em><a href="speechsynthesisevent"> <code>SpeechSynthesisEvent</code> 의</a> 인터페이스는 부모 인터페이스에서 속성 상속 <a href="event"> <code>Event</code> </a> .</em>
ru: <em>Интерфейс <a href="speechsynthesisevent"> <code>SpeechSynthesisEvent</code> </a> также наследует свойства от своего родительского интерфейса <a href="event"> <code>Event</code> </a> .</em>
zh_cn: <em>该<a href="speechsynthesisevent"> <code>SpeechSynthesisEvent</code> </a>接口也继承其父接口，性能<a href="event"> <code>Event</code> </a>。</em>

source: <em>The <code>AbstractWorker</code></em><em> interface doesn't implement or inherit any methods.</em>
es: <em>La <code>AbstractWorker</code> </em><em>interfaz </em><em>AbstractWorker</em><em> no implementa ni hereda ning&uacute;n m&eacute;todo.</em>
ko: <em> <code>AbstractWorker</code> 의</em><em> 인터페이스를 구현하거나 어떤 방법을 상속하지 않습니다.</em>
ru: <em>Интерфейс <code>AbstractWorker</code> </em><em> не реализует и не наследует какие-либо методы.</em>
zh_cn: <em>该 <code>AbstractWorker</code> </em><em>接口不执行或继承任何方法。</em>

source: <em>The <code>AbstractWorker</code></em><em> interface doesn't inherit any properties.</em>
es: <em>La <code>AbstractWorker</code> </em><em>interfaz </em><em>AbstractWorker</em><em> no hereda ninguna propiedad.</em>
ko: <em> <code>AbstractWorker</code> 의</em><em> 인터페이스는 어떤 속성을 상속하지 않습니다.</em>
ru: <em>Интерфейс <code>AbstractWorker</code> </em><em> не наследует никаких свойств.</em>
zh_cn: <em>该 <code>AbstractWorker</code> </em><em>接口不继承任何属性。</em>

source: <em>The <code>AnimationEvent()</code> constructor also inherits arguments from <a href="../event/event"><code>Event()</code></a>.</em>
es: <em>El constructor <code>AnimationEvent()</code> tambi&eacute;n hereda argumentos de <a href="../event/event"> <code>Event()</code> </a> .</em>
ko: <em> <code>AnimationEvent()</code> 생성자도에서 인수를 상속 <a href="../event/event"> <code>Event()</code> </a> .</em>
ru: <em>Конструктор <code>AnimationEvent()</code> также наследует аргументы от <a href="../event/event"> <code>Event()</code> </a> .</em>
zh_cn: <em>该 <code>AnimationEvent()</code> 构造函数也继承参数从<a href="../event/event"> <code>Event()</code> </a>。</em>
