Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/dom/dom.*.007.xlf
Languages: es, ko, ru, zh_cn

source: <em>This interface doesn't implement any specific methods, but inherits methods from its parent interface, <a href="svggraphicselement"><code>SVGGraphicsElement</code></a>.</em>
es: <em>Esta interfaz no implementa ning&uacute;n m&eacute;todo espec&iacute;fico, pero hereda m&eacute;todos de su interfaz principal, <a href="svggraphicselement"> <code>SVGGraphicsElement</code> </a> .</em>
ko: <em>이 인터페이스는 특정 메소드를 구현하지 않지만 상위 인터페이스 <a href="svggraphicselement"> <code>SVGGraphicsElement</code> </a> 에서 메소드를 상속합니다 .</em>
ru: <em>Этот интерфейс не реализует никаких конкретных методов, но наследует методы от своего родительского интерфейса <a href="svggraphicselement"> <code>SVGGraphicsElement</code> </a> .</em>
zh_cn: <em>该接口未实现任何特定的方法，但会从其父接口<a href="svggraphicselement"> <code>SVGGraphicsElement</code> </a>继承方法。</em>

source: <em>This interface doesn't implement any specific methods, but inherits methods from its parent interface, <a href="svgtextpositioningelement"><code>SVGTextPositioningElement</code></a>.</em>
es: <em>Esta interfaz no implementa ning&uacute;n m&eacute;todo espec&iacute;fico, pero hereda m&eacute;todos de su interfaz principal, <a href="svgtextpositioningelement"> <code>SVGTextPositioningElement</code> </a> .</em>
ko: <em>이 인터페이스는 특정 메소드를 구현하지 않지만 상위 인터페이스 <a href="svgtextpositioningelement"> <code>SVGTextPositioningElement</code> </a> 에서 메소드를 상속합니다 .</em>
ru: <em>Этот интерфейс не реализует никаких конкретных методов, но наследует методы от своего родительского интерфейса, <a href="svgtextpositioningelement"> <code>SVGTextPositioningElement</code> </a> .</em>
zh_cn: <em>该接口没有实现任何特定的方法，但是从其父接口<a href="svgtextpositioningelement"> <code>SVGTextPositioningElement</code> </a>继承方法。</em>

source: <em>This interface doesn't implement any specific methods, but inherits methods from its parent, </em><em><a href="svggeometryelement"><code>SVGGeometryElement</code></a>.</em>
es: <em>Esta interfaz no implementa ning&uacute;n m&eacute;todo espec&iacute;fico, pero hereda m&eacute;todos de su padre, </em><em><a href="svggeometryelement"> <code>SVGGeometryElement</code> </a> .</em>
ko: <em>이 인터페이스는 특정 메소드를 구현하지 않지만 상위 </em><em><a href="svggeometryelement"> <code>SVGGeometryElement</code> </a></em><em> 에서 메소드를 상속합니다 </em><em>.</em><em></em>
ru: <em>Этот интерфейс не реализует никаких конкретных методов, но наследует методы от своего родителя, </em><em><a href="svggeometryelement"> <code>SVGGeometryElement</code> </a> .</em>
zh_cn: <em>该接口未实现任何特定的方法，但会从其父级</em><em><a href="svggeometryelement"> <code>SVGGeometryElement</code> </a></em><em>继承方法</em><em>。</em><em></em>

source: <em>This interface doesn't implement any specific methods, but inherits methods from its parent, <a href="svgelement"><code>SVGElement</code></a>.</em>
es: <em>Esta interfaz no implementa ning&uacute;n m&eacute;todo espec&iacute;fico, pero hereda m&eacute;todos de su padre, <a href="svgelement"> <code>SVGElement</code> </a> .</em>
ko: <em>이 인터페이스는 특정 메소드를 구현하지 않지만 상위 <a href="svgelement"> <code>SVGElement</code> 의</a> 메소드를 상속합니다 .</em>
ru: <em>Этот интерфейс не реализует никаких конкретных методов, но наследует методы от своего родителя <a href="svgelement"> <code>SVGElement</code> </a> .</em>
zh_cn: <em>该接口未实现任何特定的方法，但从其父级<a href="svgelement"> <code>SVGElement</code> </a>继承了方法。</em>

source: <em>This interface doesn't implement any specific methods, but inherits properties from its parent, <a href="svggraphicselement"><code>SVGGraphicsElement</code></a>.</em>
es: <em>Esta interfaz no implementa ning&uacute;n m&eacute;todo espec&iacute;fico, pero hereda las propiedades de su padre, <a href="svggraphicselement"> <code>SVGGraphicsElement</code> </a> .</em>
ko: <em>이 인터페이스는 특정 메소드를 구현하지 않지만 상위 <a href="svggraphicselement"> <code>SVGGraphicsElement</code> </a> 에서 특성을 상속합니다 .</em>
ru: <em>Этот интерфейс не реализует какие-либо конкретные методы, но наследует свойства от своего родителя, <a href="svggraphicselement"> <code>SVGGraphicsElement</code> </a> .</em>
zh_cn: <em>该接口没有实现任何特定的方法，但是从其父级<a href="svggraphicselement"> <code>SVGGraphicsElement</code> </a>继承属性。</em>

source: <em>This interface doesn't implement any specific methods.</em>
es: <em>Esta interfaz no implementa ning&uacute;n m&eacute;todo espec&iacute;fico.</em>
ko: <em>이 인터페이스는 특정 메소드를 구현하지 않습니다.</em>
ru: <em>Этот интерфейс не реализует никаких конкретных методов.</em>
zh_cn: <em>此接口未实现任何特定方法。</em>

source: <em>This interface doesn't implement any specific properties, but inherits properties from its parent interface, <a href="svganimationelement"><code>SVGAnimationElement</code></a>.</em>
es: <em>Esta interfaz no implementa ninguna propiedad espec&iacute;fica, pero hereda propiedades de su interfaz principal, <a href="svganimationelement"> <code>SVGAnimationElement</code> </a> .</em>
ko: <em>이 인터페이스는 특정 속성을 구현하지 않지만 상위 인터페이스 <a href="svganimationelement"> <code>SVGAnimationElement</code> </a> 에서 속성을 상속합니다 .</em>
ru: <em>Этот интерфейс не реализует никаких конкретных свойств, но наследует свойства от своего родительского интерфейса, <a href="svganimationelement"> <code>SVGAnimationElement</code> </a> .</em>
zh_cn: <em>该接口没有实现任何特定的属性，但是从其父接口<a href="svganimationelement"> <code>SVGAnimationElement</code> </a>继承属性。</em>

source: <em>This interface doesn't implement any specific properties, but inherits properties from its parent interface, <a href="svgelement"><code>SVGElement</code></a>, and implements properties from <a href="svgfilterprimitivestandardattributes"><code>SVGFilterPrimitiveStandardAttributes</code></a>.</em>
es: <em>Esta interfaz no implementa ninguna propiedad espec&iacute;fica, pero hereda propiedades de su interfaz principal, <a href="svgelement"> <code>SVGElement</code> </a> , e implementa propiedades de <a href="svgfilterprimitivestandardattributes"> <code>SVGFilterPrimitiveStandardAttributes</code> </a> .</em>
ko: <em>이 인터페이스는 특정 속성,하지만 부모 인터페이스로부터 상속 속성을 구현하지 않습니다 <a href="svgelement"> <code>SVGElement</code> </a> 에서, 및 구현 속성 <a href="svgfilterprimitivestandardattributes"> <code>SVGFilterPrimitiveStandardAttributes</code> 을</a> .</em>
ru: <em>Этот интерфейс не реализует никаких конкретных свойств, но наследует свойства от своего родительского интерфейса <a href="svgelement"> <code>SVGElement</code> </a> и реализует свойства из <a href="svgfilterprimitivestandardattributes"> <code>SVGFilterPrimitiveStandardAttributes</code> </a> .</em>
zh_cn: <em>该接口没有实现任何特定的属性，但是从其父接口<a href="svgelement"> <code>SVGElement</code> </a>继承属性，并从<a href="svgfilterprimitivestandardattributes"> <code>SVGFilterPrimitiveStandardAttributes</code> </a>实现属性。</em>

source: <em>This interface doesn't implement any specific properties, but inherits properties from its parent interface, <a href="svgelement"><code>SVGElement</code></a>.</em>
es: <em>Esta interfaz no implementa ninguna propiedad espec&iacute;fica, pero hereda propiedades de su interfaz principal, <a href="svgelement"> <code>SVGElement</code> </a> .</em>
ko: <em>이 인터페이스는 특정 속성을 구현하지 않지만 상위 인터페이스 <a href="svgelement"> <code>SVGElement</code> </a> 에서 속성을 상속합니다 .</em>
ru: <em>Этот интерфейс не реализует никаких конкретных свойств, но наследует свойства от своего родительского интерфейса, <a href="svgelement"> <code>SVGElement</code> </a> .</em>
zh_cn: <em>该接口没有实现任何特定的属性，但是从其父接口<a href="svgelement"> <code>SVGElement</code> </a>继承属性。</em>

source: <em>This interface doesn't implement any specific properties, but inherits properties from its parent interface, <a href="svggeometryelement"><code>SVGGeometryElement</code></a>, and implements the properties of <a href="svgurireference"><code>SVGURIReference</code></a>.</em>
es: <em>Esta interfaz no implementa propiedades espec&iacute;ficas, pero hereda propiedades de su interfaz principal, <a href="svggeometryelement"> <code>SVGGeometryElement</code> </a> , e implementa las propiedades de <a href="svgurireference"> <code>SVGURIReference</code> </a> .</em>
ko: <em>이 인터페이스는 부모 인터페이스에서 특정 속성 만 상속 속성을 구현하지 않습니다 <a href="svggeometryelement"> <code>SVGGeometryElement</code> </a> 및 구현의 특성 <a href="svgurireference"> <code>SVGURIReference</code> 을</a> .</em>
ru: <em>Этот интерфейс не реализует никаких конкретных свойств, но наследует свойства от своего родительского интерфейса <a href="svggeometryelement"> <code>SVGGeometryElement</code> </a> и реализует свойства <a href="svgurireference"> <code>SVGURIReference</code> </a> .</em>
zh_cn: <em>该接口不实现任何特定的属性，但是从其父接口<a href="svggeometryelement"> <code>SVGGeometryElement</code> </a>继承属性，并实现<a href="svgurireference"> <code>SVGURIReference</code> </a>的属性。</em>

source: <em>This interface doesn't implement any specific properties, but inherits properties from its parent interface, <a href="svggraphicselement"><code>SVGGraphicsElement</code></a>, and implements properties from <a href="https://developer.mozilla.org/en-US/docs/Web/API/SVGFitToViewBox"><code>SVGFitToViewBox</code></a>.</em>
es: <em>Esta interfaz no implementa ninguna propiedad espec&iacute;fica, pero hereda propiedades de su interfaz principal, <a href="svggraphicselement"> <code>SVGGraphicsElement</code> </a> , e implementa propiedades de <a href="https://developer.mozilla.org/en-US/docs/Web/API/SVGFitToViewBox"> <code>SVGFitToViewBox</code> </a> .</em>
ko: <em>이 인터페이스는 특정 속성,하지만 부모 인터페이스로부터 상속 속성을 구현하지 않습니다 <a href="svggraphicselement"> <code>SVGGraphicsElement</code> </a> 에서, 및 구현 속성 <a href="https://developer.mozilla.org/en-US/docs/Web/API/SVGFitToViewBox"> <code>SVGFitToViewBox</code> 을</a> .</em>
ru: <em>Этот интерфейс не реализует никаких конкретных свойств, но наследует свойства от своего родительского интерфейса <a href="svggraphicselement"> <code>SVGGraphicsElement</code> </a> и реализует свойства из <a href="https://developer.mozilla.org/en-US/docs/Web/API/SVGFitToViewBox"> <code>SVGFitToViewBox</code> </a> .</em>
zh_cn: <em>该接口没有实现任何特定的属性，但是从其父接口<a href="svggraphicselement"> <code>SVGGraphicsElement</code> </a>继承属性，并从<a href="https://developer.mozilla.org/en-US/docs/Web/API/SVGFitToViewBox"> <code>SVGFitToViewBox</code> </a>实现属性。</em>

source: <em>This interface doesn't implement any specific properties, but inherits properties from its parent interface, <a href="svggraphicselement"><code>SVGGraphicsElement</code></a>.</em>
es: <em>Esta interfaz no implementa ninguna propiedad espec&iacute;fica, pero hereda propiedades de su interfaz principal, <a href="svggraphicselement"> <code>SVGGraphicsElement</code> </a> .</em>
ko: <em>이 인터페이스는 특정 속성을 구현하지 않지만 상위 인터페이스 <a href="svggraphicselement"> <code>SVGGraphicsElement</code> </a> 에서 속성을 상속합니다 .</em>
ru: <em>Этот интерфейс не реализует никаких конкретных свойств, но наследует свойства от своего родительского интерфейса, <a href="svggraphicselement"> <code>SVGGraphicsElement</code> </a> .</em>
zh_cn: <em>该接口没有实现任何特定的属性，但是从其父接口<a href="svggraphicselement"> <code>SVGGraphicsElement</code> </a>继承属性。</em>

source: <em>This interface doesn't implement any specific properties, but inherits properties from its parent interface, <a href="svgtextpositioningelement"><code>SVGTextPositioningElement</code></a>.</em>
es: <em>Esta interfaz no implementa ninguna propiedad espec&iacute;fica, pero hereda propiedades de su interfaz principal, <a href="svgtextpositioningelement"> <code>SVGTextPositioningElement</code> </a> .</em>
ko: <em>이 인터페이스는 특정 속성을 구현하지 않지만 상위 인터페이스 <a href="svgtextpositioningelement"> <code>SVGTextPositioningElement</code> </a> 에서 속성을 상속합니다 .</em>
ru: <em>Этот интерфейс не реализует никаких конкретных свойств, но наследует свойства от своего родительского интерфейса <a href="svgtextpositioningelement"> <code>SVGTextPositioningElement</code> </a> .</em>
zh_cn: <em>该接口没有实现任何特定的属性，但是从其父接口<a href="svgtextpositioningelement"> <code>SVGTextPositioningElement</code> </a>继承属性。</em>

source: <em>This interface doesn't implement any specific properties, but inherits properties from its parent, </em><em><a href="svggeometryelement"><code>SVGGeometryElement</code></a> and also implements properties from <a href="svganimatedpoints"><code>SVGAnimatedPoints</code></a>.</em>
es: <em>Esta interfaz no implementa propiedades espec&iacute;ficas, pero hereda propiedades de su padre, </em><em><a href="svggeometryelement"> <code>SVGGeometryElement</code> </a> y tambi&eacute;n implementa propiedades de <a href="svganimatedpoints"> <code>SVGAnimatedPoints</code> </a> .</em>
ko: <em>이 인터페이스는 특정 속성을 구현하지 않지만 상위 </em><em><a href="svggeometryelement"> <code>SVGGeometryElement</code> </a></em><em> 에서 속성을 상속 </em><em>하고</em><em><a href="svganimatedpoints"> <code>SVGAnimatedPoints</code> 의</a>.</em>
ru: <em>Этот интерфейс не реализует никаких конкретных свойств, но наследует свойства от своего родителя </em><em><a href="svggeometryelement"> <code>SVGGeometryElement</code> ,</a> а также реализует свойства из <a href="svganimatedpoints"> <code>SVGAnimatedPoints</code> </a> .</em>
zh_cn: <em>该接口不实现任何特定的属性，但是从其父级</em><em><a href="svggeometryelement"> <code>SVGGeometryElement</code> </a></em><em>继承属性，</em><em>并且还从</em><em><a href="svganimatedpoints"> <code>SVGAnimatedPoints</code> </a></em><em>实现属性</em><em>。</em><em></em>

source: <em>This interface doesn't implement any specific properties, but inherits properties from its parent, <a href="svggraphicselement"><code>SVGGraphicsElement</code></a>.</em>
es: <em>Esta interfaz no implementa ninguna propiedad espec&iacute;fica, pero hereda propiedades de su padre, <a href="svggraphicselement"> <code>SVGGraphicsElement</code> </a> .</em>
ko: <em>이 인터페이스는 특정 속성을 구현하지 않지만 상위 <a href="svggraphicselement"> <code>SVGGraphicsElement</code> </a> 에서 속성을 상속합니다. .</em>
ru: <em>Этот интерфейс не реализует никаких конкретных свойств, но наследует свойства от своего родителя, <a href="svggraphicselement"> <code>SVGGraphicsElement</code> </a> .</em>
zh_cn: <em>该接口没有实现任何特定的属性，但是从其父级<a href="svggraphicselement"> <code>SVGGraphicsElement</code> </a>继承属性。</em>

source: <em>This interface doesn't implement any specific properties.</em>
es: <em>Esta interfaz no implementa ninguna propiedad espec&iacute;fica.</em>
ko: <em>이 인터페이스는 특정 속성을 구현하지 않습니다.</em>
ru: <em>Этот интерфейс не реализует никаких конкретных свойств.</em>
zh_cn: <em>此接口未实现任何特定属性。</em>

source: <em>This interface doesn't implement or inherit any methods, and has none of its own.</em>
es: <em>Esta interfaz no implementa ni hereda ning&uacute;n m&eacute;todo, y no tiene ninguno propio.</em>
ko: <em>이 인터페이스는 메소드를 구현하거나 상속하지 않으며 자체 메소드가 없습니다.</em>
ru: <em>Этот интерфейс не реализует и не наследует никаких методов и не имеет своих собственных.</em>
zh_cn: <em>该接口不实现或继承任何方法，并且没有任何方法。</em>

source: <em>This interface doesn't include any properties except for the event handlers listed below.</em>
es: <em>Esta interfaz no incluye ninguna propiedad, excepto los controladores de eventos que se enumeran a continuaci&oacute;n.</em>
ko: <em>이 인터페이스에는 아래에 나열된 이벤트 핸들러를 제외한 속성이 포함되어 있지 않습니다.</em>
ru: <em>Этот интерфейс не содержит никаких свойств, кроме обработчиков событий, перечисленных ниже.</em>
zh_cn: <em>除下面列出的事件处理程序外，该接口不包含任何属性。</em>

source: <em>This interface doesn't inherit any method.</em>
es: <em>Esta interfaz no hereda ning&uacute;n m&eacute;todo.</em>
ko: <em>이 인터페이스는 메소드를 상속하지 않습니다.</em>
ru: <em>Этот интерфейс не наследует никакой метод.</em>
zh_cn: <em>该接口不继承任何方法。</em>

source: <em>This interface doesn't inherit any methods.</em>
es: <em>Esta interfaz no hereda ning&uacute;n m&eacute;todo.</em>
ko: <em>이 인터페이스는 메소드를 상속하지 않습니다.</em>
ru: <em>Этот интерфейс не наследует никаких методов.</em>
zh_cn: <em>该接口不继承任何方法。</em>

source: <em>This interface doesn't inherit any other property.</em>
es: <em>Esta interfaz no hereda ninguna otra propiedad.</em>
ko: <em>이 인터페이스는 다른 속성을 상속하지 않습니다.</em>
ru: <em>Этот интерфейс не наследует никаких других свойств.</em>
zh_cn: <em>该接口不继承任何其他属性。</em>

source: <em>This interface doesn't inherit any properties.</em>
es: <em>Esta interfaz no hereda ninguna propiedad.</em>
ko: <em>이 인터페이스는 속성을 상속하지 않습니다.</em>
ru: <em>Этот интерфейс не наследует никаких свойств.</em>
zh_cn: <em>此接口不继承任何属性。</em>

source: <em>This interface doesn't inherit any property.</em>
es: <em>Esta interfaz no hereda ninguna propiedad.</em>
ko: <em>이 인터페이스는 속성을 상속하지 않습니다.</em>
ru: <em>Этот интерфейс не наследует никаких свойств.</em>
zh_cn: <em>此接口不继承任何属性。</em>

source: <em>This interface doesn't provide any specific methods, but inherits methods from its parent, <a href="svgtextcontentelement"><code>SVGTextContentElement</code></a>.</em>
es: <em>Esta interfaz no proporciona ning&uacute;n m&eacute;todo espec&iacute;fico, pero hereda m&eacute;todos de su padre, <a href="svgtextcontentelement"> <code>SVGTextContentElement</code> </a> .</em>
ko: <em>이 인터페이스는 특정 메소드를 제공하지 않지만 상위 <a href="svgtextcontentelement"> <code>SVGTextContentElement</code> </a> 에서 메소드를 상속합니다 .</em>
ru: <em>Этот интерфейс не предоставляет никаких конкретных методов, но наследует методы от своего родителя, <a href="svgtextcontentelement"> <code>SVGTextContentElement</code> </a> .</em>
zh_cn: <em>该接口不提供任何特定的方法，但是从其父级<a href="svgtextcontentelement"> <code>SVGTextContentElement</code> </a>继承方法。</em>

source: <em>This interface doesn't provide any specific methods.</em>
es: <em>Esta interfaz no proporciona ning&uacute;n m&eacute;todo espec&iacute;fico.</em>
ko: <em>이 인터페이스는 특정 방법을 제공하지 않습니다.</em>
ru: <em>Этот интерфейс не предоставляет никаких конкретных методов.</em>
zh_cn: <em>该接口不提供任何特定方法。</em>

source: <em>This interface doesn't provide any specific properties, but inherits the properties from its parent, <a href="svgtextpositioningelement"><code>SVGTextPositioningElement</code></a>.</em>
es: <em>Esta interfaz no proporciona propiedades espec&iacute;ficas, pero hereda las propiedades de su padre, <a href="svgtextpositioningelement"> <code>SVGTextPositioningElement</code> </a> .</em>
ko: <em>이 인터페이스는 특정 속성을 제공하지 않지만 상위 <a href="svgtextpositioningelement"> <code>SVGTextPositioningElement</code> </a> 의 속성을 상속합니다 .</em>
ru: <em>Этот интерфейс не предоставляет никаких конкретных свойств, но наследует свойства от своего родителя, <a href="svgtextpositioningelement"> <code>SVGTextPositioningElement</code> </a> .</em>
zh_cn: <em>该接口不提供任何特定的属性，但是从其父级<a href="svgtextpositioningelement"> <code>SVGTextPositioningElement</code> </a>继承这些属性。</em>

source: <em>This interface has no method and no parent, and doesn't inherits or implements any method.</em>
es: <em>Esta interfaz no tiene m&eacute;todo ni padre, y no hereda ni implementa ning&uacute;n m&eacute;todo.</em>
ko: <em>이 인터페이스에는 메서드와 부모가 없으며 메서드를 상속하거나 구현하지 않습니다.</em>
ru: <em>Этот интерфейс не имеет метода и родителя и не наследует и не реализует какой-либо метод.</em>
zh_cn: <em>此接口没有方法，也没有父级，也没有继承或实现任何方法。</em>

source: <em>This interface has no methods but inherits methods from its parent, <a href="svganimationelement"><code>SVGAnimationElement</code></a>.</em>
es: <em>Esta interfaz no tiene m&eacute;todos, pero hereda m&eacute;todos de su padre, <a href="svganimationelement"> <code>SVGAnimationElement</code> </a> .</em>
ko: <em>이 인터페이스에는 메소드가 없지만 상위 <a href="svganimationelement"> <code>SVGAnimationElement</code> </a> 에서 메소드를 상속합니다 .</em>
ru: <em>Этот интерфейс не имеет методов, но наследует методы от своего родителя <a href="svganimationelement"> <code>SVGAnimationElement</code> </a> .</em>
zh_cn: <em>该接口没有方法，但是从其父类<a href="svganimationelement"> <code>SVGAnimationElement</code> </a>继承方法。</em>

source: <em>This interface has no methods but inherits methods from its parent, <a href="svggeometryelement"><code>SVGGeometryElement</code></a>.</em>
es: <em>Esta interfaz no tiene m&eacute;todos, pero hereda m&eacute;todos de su padre, <a href="svggeometryelement"> <code>SVGGeometryElement</code> </a> .</em>
ko: <em>이 인터페이스에는 메소드가 없지만 상위 <a href="svggeometryelement"> <code>SVGGeometryElement</code> </a> 에서 메소드를 상속합니다 .</em>
ru: <em>Этот интерфейс не имеет методов, но наследует методы от своего родителя, <a href="svggeometryelement"> <code>SVGGeometryElement</code> </a> .</em>
zh_cn: <em>该接口没有方法，但是从其父级<a href="svggeometryelement"> <code>SVGGeometryElement</code> </a>继承方法。</em>

source: <em>This interface has no methods but inherits methods from its parent, <a href="svggraphicselement"><code>SVGGraphicsElement</code></a> and implements methods from <a href="svgurireference"><code>SVGURIReference</code></a>.</em>
es: <em>Esta interfaz no tiene m&eacute;todos, pero hereda m&eacute;todos de su padre, <a href="svggraphicselement"> <code>SVGGraphicsElement</code> </a> e implementa m&eacute;todos de <a href="svgurireference"> <code>SVGURIReference</code> </a> .</em>
ko: <em>이 인터페이스는 부모로부터 어떤 방법하지만 상속 방법이 없습니다 <a href="svggraphicselement"> <code>SVGGraphicsElement</code> </a> 에서와 구현 방법 <a href="svgurireference"> <code>SVGURIReference</code> 을</a> .</em>
ru: <em>Этот интерфейс не имеет методов, но наследует методы от своего родителя <a href="svggraphicselement"> <code>SVGGraphicsElement</code> </a> и реализует методы из <a href="svgurireference"> <code>SVGURIReference</code> </a> .</em>
zh_cn: <em>该接口没有方法，但是从其父<a href="svggraphicselement"> <code>SVGGraphicsElement</code> </a>继承方法，并从<a href="svgurireference"> <code>SVGURIReference</code> </a>实现方法。</em>

source: <em>This interface has no methods but inherits methods from its parent, <a href="svggraphicselement"><code>SVGGraphicsElement</code></a>.</em>
es: <em>Esta interfaz no tiene m&eacute;todos, pero hereda m&eacute;todos de su padre, <a href="svggraphicselement"> <code>SVGGraphicsElement</code> </a> .</em>
ko: <em>이 인터페이스에는 메소드가 없지만 상위 <a href="svggraphicselement"> <code>SVGGraphicsElement</code> </a> 에서 메소드를 상속합니다 .</em>
ru: <em>Этот интерфейс не имеет методов, но наследует методы от своего родителя <a href="svggraphicselement"> <code>SVGGraphicsElement</code> </a> .</em>
zh_cn: <em>该接口没有方法，但是从其父级<a href="svggraphicselement"> <code>SVGGraphicsElement</code> </a>继承方法。</em>

source: <em>This interface has no methods, but inherits methods from: <a href="event"><code>Event</code></a></em>
es: <em>Esta interfaz no tiene m&eacute;todos, pero hereda m&eacute;todos de: <a href="event"> <code>Event</code> o</a></em>
ko: <em>이 인터페이스는 아무런 방법이 있지만, 상속 방법이 없습니다 : <a href="event"> <code>Event</code> </a></em>
ru: <em>Этот интерфейс не имеет методов, но наследует методы от: <a href="event"> <code>Event</code> </a></em>
zh_cn: <em>此接口没有方法，但是从以下方法继承方法：<a href="event"> <code>Event</code> </a></em>

source: <em>This interface has no methods.</em>
es: <em>Esta interfaz no tiene m&eacute;todos.</em>
ko: <em>이 인터페이스에는 메소드가 없습니다.</em>
ru: <em>Этот интерфейс не имеет методов.</em>
zh_cn: <em>该接口没有方法。</em>

source: <em>This interface has no parent, and doesn't inherits or implements any other property.</em>
es: <em>Esta interfaz no tiene padre y no hereda ni implementa ninguna otra propiedad.</em>
ko: <em>이 인터페이스에는 부모가 없으며 다른 속성을 상속하거나 구현하지 않습니다.</em>
ru: <em>Этот интерфейс не имеет родителя и не наследует и не реализует никаких других свойств.</em>
zh_cn: <em>此接口没有父级，并且不继承或实现任何其他属性。</em>

source: <em>This interface has no properties but inherits properties from its parent, <a href="svganimationelement"><code>SVGAnimationElement</code></a>.</em>
es: <em>Esta interfaz no tiene propiedades pero hereda propiedades de su padre, <a href="svganimationelement"> <code>SVGAnimationElement</code> </a> .</em>
ko: <em>이 인터페이스에는 속성이 없지만 부모 <a href="svganimationelement"> <code>SVGAnimationElement</code> 의</a> 속성을 상속합니다 .</em>
ru: <em>Этот интерфейс не имеет свойств, но наследует свойства от своего родителя <a href="svganimationelement"> <code>SVGAnimationElement</code> </a> .</em>
zh_cn: <em>该接口没有属性，但从其父类<a href="svganimationelement"> <code>SVGAnimationElement</code> </a>继承属性。</em>
