Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/dom/dom.*.011.xlf
Languages: ja, ko, ru, zh_cn

source: A viable candidate pair has been found and selected, and the <code>RTCIceTransport</code> has connected the two peers together using that pair. However, there are still candidates pairings to consider, and there may still be gathering underway on one or both of the two devices.
ja: 実行可能な候補ペアが見つかり、選択されました <code>RTCIceTransport</code> は、そのペアを使用して2つのピアを接続しました。ただし、考慮すべき候補のペアリングがまだあり、2つのデバイスの一方または両方でまだ収集が進行している可能性があります。
ko: 실행 가능한 후보 쌍을 찾아서 선택했으며 <code>RTCIceTransport</code> 가 해당 쌍을 사용하여 두 피어를 서로 연결했습니다. 그러나 고려해야 할 후보가 여전히 있으며 두 장치 중 하나 또는 둘 모두에서 계속 수집 될 수 있습니다.
ru: Была найдена и выбрана жизнеспособная пара кандидатов, и <code>RTCIceTransport</code> соединил двух пиров вместе, используя эту пару. Тем не менее, есть еще пары кандидатов, которые необходимо рассмотреть, и может продолжаться сбор данных на одном или обоих устройствах.
zh_cn: 找到并选择了可行的候选对， <code>RTCIceTransport</code> 使用该对将两个对等点连接在一起。但是，仍然需要考虑候选配对，并且在两个设备中的一个或两个上可能仍在进行聚集。

source: A video track containing a commentary. This might be used to contain the director's commentary track on a movie, for example.
ja: コメンタリーを含むビデオトラック。これは、例えば、映画の監督のコメンタリートラックを含むために使用されることがあります。
ko: 주석이 포함 된 비디오 트랙. 예를 들어 영화에 대한 감독의 논평 트랙을 포함하는 데 사용될 수 있습니다.
ru: Видеодорожка с комментарием.Это может быть использовано,например,для того,чтобы в фильме содержался комментарий режиссера.
zh_cn: 包含评论的视频轨道。例如,这可能用于包含一部电影的导演评论轨道。

source: A view, as mentioned below, refers to a typed array representing the destination region to which the associated <code>ReadableByteStreamController</code> controller can write generated data.
ja: 以下で説明するように、ビューは、関連する <code>ReadableByteStreamController</code> コントローラが生成されたデータを書き込むことができる宛先領域を表す型付き配列を指します。
ko: 아래에서 언급 한 것처럼 뷰는 관련 <code>ReadableByteStreamController</code> 컨트롤러가 생성 된 데이터를 쓸 수 있는 대상 영역을 나타내는 형식화 된 배열을 나타냅니다 .
ru: Представление, как упомянуто ниже, относится к типизированному массиву, представляющему область назначения, в которую связанный контроллер <code>ReadableByteStreamController</code> может записывать сгенерированные данные.
zh_cn: 如下所述，视图是一种类型化的数组，表示关联的 <code>ReadableByteStreamController</code> 控制器可以向其写入生成的数据的目标区域。

source: A way to convert a canvas to an ico (Mozilla only)
ja: キャンバスをicoに変換する方法(Mozillaのみ
ko: 캔버스를 ico로 변환하는 방법 (Mozilla 만 해당)
ru: Способ превратить холст в ико (только Mozilla).
zh_cn: 将画布转换为ico的方法(仅限Mozilla)

source: A worker is an object created using a constructor (e.g. <a href="../worker/worker"><code>Worker()</code></a>) that runs a named JavaScript file &mdash; this file contains the code that will run in the worker thread; workers run in another global context that is different from the current <a href="../window"><code>window</code></a>. Thus, using the <a href="../window"><code>window</code></a> shortcut to get the current global scope (instead of <a href="../window/self"><code>self</code></a>) within a <a href="../worker"><code>Worker</code></a> will return an error.
ja: ワーカーは、名前付きJavaScriptファイルを実行するコンストラクター（<a href="../worker/worker"> <code>Worker()</code> など</a>）を使用して作成されたオブジェクトです。このファイルには、ワーカースレッドで実行されるコードが含まれています。ワーカーは、現在の<a href="../window"> <code>window</code> </a>とは異なる別のグローバルコンテキストで実行されます。したがって、<a href="../window"> <code>window</code> </a>ショートカットを使用して<a href="../worker"> <code>Worker</code> </a>内で（<a href="../window/self"> <code>self</code> </a>ではなく）現在のグローバルスコープを取得すると、エラーが返されます。
ko: 워커는 이름이 지정된 JavaScript 파일을 실행 하는 생성자 (예 : <a href="../worker/worker"> <code>Worker()</code> </a> )를 사용하여 생성 된 객체입니다. 이 파일에는 워커 스레드에서 실행될 코드가 포함됩니다. 작업자는 현재 <a href="../window"> <code>window</code> </a> 다른 다른 전역 컨텍스트에서 실행됩니다 . 따라서 <a href="../worker"> <code>Worker</code> </a> 내 에서 현재 전역 범위 ( <a href="../window/self"> <code>self</code> </a> 대신)를 가져 오기 위해 <a href="../window"> <code>window</code> </a> 바로 가기를 사용 하면 오류가 반환됩니다.
ru: Работник - это объект, созданный с помощью конструктора (например, <a href="../worker/worker"> <code>Worker()</code> </a> ), который запускает именованный файл JavaScript - этот файл содержит код, который будет выполняться в рабочем потоке; рабочие работают в другом глобальном контексте, отличном от текущего <a href="../window"> <code>window</code> </a> . Таким образом, использование ярлыка <a href="../window"> <code>window</code> </a> для получения текущей глобальной области видимости (вместо <a href="../window/self"> <code>self</code> </a> ) в <a href="../worker"> <code>Worker</code> </a> вернет ошибку.
zh_cn: 工作程序是使用运行命名的JavaScript文件的构造函数（例如<a href="../worker/worker"> <code>Worker()</code> </a>）创建的对象-该文件包含将在工作程序线程中运行的代码；工作人员在与当前<a href="../window"> <code>window</code> </a>不同的另一个全局环境中运行。因此，使用<a href="../window"> <code>window</code> </a>快捷方式获取<a href="../worker"> <code>Worker</code> 中</a>的当前全局范围（而不是<a href="../window/self"> <code>self</code> </a>）将返回错误。

source: A worker is an object created using a constructor (e.g. <a href="worker/worker"><code>Worker()</code></a>) that runs a named JavaScript file &mdash; this file contains the code that will run in the worker thread; workers run in another global context that is different from the current <a href="window"><code>window</code></a>. This context is represented by either a <a href="dedicatedworkerglobalscope"><code>DedicatedWorkerGlobalScope</code></a> object (in the case of dedicated workers - workers that are utilized by a single script), or a <a href="sharedworkerglobalscope"><code>SharedWorkerGlobalScope</code></a> (in the case of shared workers - workers that are shared between multiple scripts).
ja: ワーカーは、名前付きJavaScriptファイルを実行するコンストラクター（<a href="worker/worker"> <code>Worker()</code> など</a>）を使用して作成されたオブジェクトです。このファイルには、ワーカースレッドで実行されるコードが含まれています。ワーカーは、現在の<a href="window"> <code>window</code> </a>とは異なる別のグローバルコンテキストで実行されます。このコンテキストは、<a href="dedicatedworkerglobalscope"> <code>DedicatedWorkerGlobalScope</code> </a>オブジェクト（専用ワーカーの場合-単一のスクリプトで使用されるワーカー）、または<a href="sharedworkerglobalscope"> <code>SharedWorkerGlobalScope</code> </a>（共有ワーカーの場合-複数のスクリプト間で共有されるワーカー）のいずれかで表されます。
ko: 워커는 이름이 지정된 JavaScript 파일을 실행 하는 생성자 (예 : <a href="worker/worker"> <code>Worker()</code> </a> )를 사용하여 생성 된 객체입니다. 이 파일에는 워커 스레드에서 실행될 코드가 포함됩니다. 작업자는 현재 <a href="window"> <code>window</code> </a> 다른 다른 전역 컨텍스트에서 실행됩니다 . 이 컨텍스트는 <a href="dedicatedworkerglobalscope"> <code>DedicatedWorkerGlobalScope</code> </a> 오브젝트 (전용 작업자의 경우-단일 스크립트로 사용되는 작업자) 또는 <a href="sharedworkerglobalscope"> <code>SharedWorkerGlobalScope</code> </a> (공유 작업자의 경우-여러 스크립트간에 공유되는 작업자)로 표시됩니다.
ru: Работник - это объект, созданный с помощью конструктора (например, <a href="worker/worker"> <code>Worker()</code> </a> ), который запускает именованный файл JavaScript - этот файл содержит код, который будет выполняться в рабочем потоке; рабочие работают в другом глобальном контексте, отличном от текущего <a href="window"> <code>window</code> </a> . Этот контекст представлен либо объектом <a href="dedicatedworkerglobalscope"> <code>DedicatedWorkerGlobalScope</code> </a> (в случае выделенных сотрудников - работников, которые используются одним сценарием), либо <a href="sharedworkerglobalscope"> <code>SharedWorkerGlobalScope</code> </a> (в случае общих работников - работников, которые совместно используются несколькими сценариями).
zh_cn: 工作程序是使用运行命名的JavaScript文件的构造函数（例如<a href="worker/worker"> <code>Worker()</code> </a>）创建的对象-该文件包含将在工作程序线程中运行的代码；工作人员在与当前<a href="window"> <code>window</code> </a>不同的另一个全局环境中运行。此上下文由<a href="dedicatedworkerglobalscope"> <code>DedicatedWorkerGlobalScope</code> </a>对象（对于专用工作人员-由单个脚本使用的工作人员）或<a href="sharedworkerglobalscope"> <code>SharedWorkerGlobalScope</code> </a>（对于共享工作人员-在多个脚本之间共享的工作人员）表示。

source: AF improves the quality of mipmapped texture access when viewing a textured primitive at an oblique angle. Using just mipmapping, these lookups have a tendency to average to grey.
ja: AFは、テクスチャ付きプリミティブを斜めから見たときのミップマップされたテクスチャアクセスの品質を向上させます。ミップマッピングだけを使用すると、これらのルックアップは平均的にグレーになる傾向があります。
ko: AF는 비스듬한 각도에서 텍스처 프리미티브를 볼 때 밉맵 텍스처 액세스의 품질을 향상시킵니다. 밉 매핑 만 사용하면 이러한 조회의 평균이 회색 인 경향이 있습니다.
ru: Автофокусировка улучшает качество доступа к текстурам с мип-картинкой при просмотре текстурированного примитива под наклонным углом.При использовании простого мип-каппинга эти просмотры имеют тенденцию к усреднению до серого цвета.
zh_cn: 当以斜角查看纹理基元时,AF提高了mipmapped纹理访问的质量。仅使用mipmapping,这些查找有平均为灰色的趋势。

source: ANDing the fragment's coverage with the temporary coverage value. See <a href="samplecoverage"><code>WebGLRenderingContext.sampleCoverage()</code></a>.
ja: フラグメントのカバレッジと一時的なカバレッジ値のANDをとります。<a href="samplecoverage"> <code>WebGLRenderingContext.sampleCoverage()</code> を</a>参照してください。
ko: 조각의 적용 범위를 임시 적용 범위 값으로 AND하기. <a href="samplecoverage"> <code>WebGLRenderingContext.sampleCoverage()</code> </a> 참조하십시오 .
ru: И покрытие покрытия фрагментом со значением временного покрытия. Смотрите <a href="samplecoverage"> <code>WebGLRenderingContext.sampleCoverage()</code> </a> .
zh_cn: 将片段的覆盖率与临时覆盖率值进行&ldquo;与&rdquo;运算。请参阅<a href="samplecoverage"> <code>WebGLRenderingContext.sampleCoverage()</code> </a>。

source: ANGLE instanced arrays
ja: ANGLE インスタンス配列
ko: ANGLE 인스턴스 형 배열
ru: искусственные решётки
zh_cn: ANGLE实例数组

source: ANGLE_: Extensions that are written by the <a href="https://en.wikipedia.org/wiki/ANGLE_%28software%29">ANGLE library</a> authors.
ja: ANGLE_：<a href="https://en.wikipedia.org/wiki/ANGLE_%28software%29">ANGLEライブラリの</a>作者が作成した拡張機能。
ko: ANGLE_ : <a href="https://en.wikipedia.org/wiki/ANGLE_%28software%29">ANGLE 라이브러리</a> 작성자 가 작성한 확장 .
ru: ANGLE_: расширения, написанные авторами <a href="https://en.wikipedia.org/wiki/ANGLE_%28software%29">библиотеки ANGLE</a> .
zh_cn: ANGLE_：由<a href="https://en.wikipedia.org/wiki/ANGLE_%28software%29">ANGLE库</a>作者编写的扩展。

source: ANGLE_instanced_arrays<br/><small>The definition of 'ANGLE_instanced_arrays' in that specification.</small>
ja: ANGLE_instanced_arrays <br/><small>その仕様における「ANGLE_instanced_arrays」の定義。</small>
ko: ANGLE_instanced_arrays <br/><small>해당 사양에서 'ANGLE_instanced_arrays'의 정의.</small>
ru: ANGLE_instanced_arrays <br/><small>Определение 'ANGLE_instanced_arrays' в этой спецификации.</small>
zh_cn: ANGLE_instanced_arrays <br/><small>该规范中&ldquo; ANGLE_instanced_arrays&rdquo;的定义。</small>

source: API (HTML or XML page) = DOM + JS (scripting language)
ja: API(HTMLまたはXMLページ)=DOM+JS(スクリプト言語)
ko: API (HTML 또는 XML 페이지) = DOM + JS (스크립트 언어)
ru: API (HTML или XML страница)=DOM+JS (скриптовый язык)
zh_cn: API(HTML或XML页面)=DOM+JS(脚本语言)。

source: API: A basic ray-caster
ja: APIです。基本的なレイキャスター
ko: API : 기본 레이 캐스터
ru: API:Базовый лучевой затвор
zh_cn: API。一个基本的射线铸造机

source: API: Adding 2D content to a WebGL context
ja: APIを使用しています。WebGL コンテキストに 2D コンテンツを追加する
ko: API : WebGL 컨텍스트에 2D 컨텐츠 추가
ru: API:Добавление 2D контента в контекст WebGL
zh_cn: API。在WebGL上下文中添加2D内容

source: API: Advanced animations
ja: API.高度なアニメーション
ko: API : 고급 애니메이션
ru: API:Расширенная анимация
zh_cn: API。高级动画

source: API: Animating objects with WebGL
ja: API.WebGLでオブジェクトをアニメーションさせる
ko: API : WebGL을 사용하여 객체 애니메이션
ru: API:Анимация объектов с помощью WebGL
zh_cn: API。使用WebGL动画对象

source: API: Animating textures in WebGL
ja: API.WebGL でテクスチャをアニメーションさせる
ko: API : WebGL에서 텍스처 애니메이션
ru: API:Анимация текстур в WebGL
zh_cn: API。在WebGL中制作纹理动画

source: API: Applying styles and colors
ja: APIを使用しています。スタイルと色の適用
ko: API : 스타일 및 색상 적용
ru: API:Применение стилей и цветов
zh_cn: API。应用样式和颜色

source: API: Basic 2D animation example
ja: APIを使用しています。基本的な2Dアニメーションの例
ko: API : 기본 2D 애니메이션 예
ru: API:Основной пример 2D анимации
zh_cn: API。基本二维动画示例

source: API: Basic Concepts Behind IndexedDB
ja: APIを使用しています。IndexedDBを支える基本的な概念
ko: API : IndexedDB의 기본 개념
ru: API:Основные понятия за indexedDB
zh_cn: API。IndexedDB背后的基本概念

source: API: Basic animations
ja: APIです。基本的なアニメーション
ko: API : 기본 애니메이션
ru: API:Основные анимации
zh_cn: API。基本动画

source: API: Basic concepts
ja: APIです。基本的な考え方
ko: API : 기본 개념
ru: API:Основные концепции
zh_cn: API。基本概念

source: API: Basic usage
ja: APIを使用しています。基本的な使い方
ko: API : 기본 사용법
ru: API:Базовое использование
zh_cn: API。基本用法

source: API: Best Practices
ja: APIを使用しています。ベストプラクティス
ko: API : 모범 사례
ru: API:Лучшие практики
zh_cn: API。最佳做法

source: API: Browser storage limits and eviction criteria
ja: APIを使用しています。ブラウザのストレージ制限と立ち退き基準
ko: API : 브라우저 스토리지 제한 및 제거 기준
ru: API:Пределы хранения браузера и критерии выселения
zh_cn: API。浏览器存储限制和驱逐标准

source: API: By example
ja: APIを使用しています。例
ko: API : 예를 들어
ru: API:На примере
zh_cn: API。举例说明

source: API: Compositing
ja: API.合成
ko: API : 합성
ru: API:Составляющий
zh_cn: API。合成

source: API: Compositing.Example
ja: APIを使用しています。合成.例
ko: API : 합성. 예
ru: API:Пример композиции

source: API: Compressed texture formats
ja: API.圧縮されたテクスチャフォーマット
ko: API : 압축 텍스처 형식
ru: API:Форматы сжатых текстур
zh_cn: API。压缩的纹理格式

source: API: Concepts
ja: APIを使用しています。概念
ko: API : 개념
ru: API:концепции
zh_cn: API。概念

source: API: Connectivity
ja: API.接続性
ko: API : 연결
ru: API:Связь
zh_cn: API。连接性

source: API: Constants
ja: APIを使用しています。定数
ko: API : 상수
ru: API:Константы
zh_cn: API。常量

source: API: Constraints
ja: APIを使用しています。制約
ko: API : 제약
ru: API:Ограничения
zh_cn: API。限制条件

source: API: Creating 3D objects using WebGL
ja: APIを使用して3Dオブジェクトを作成します。WebGLを使った3Dオブジェクトの作成
ko: API : WebGL을 사용하여 3D 객체 생성
ru: API:Создание 3D объектов с помощью WebGL
zh_cn: API。使用WebGL创建3D对象

source: API: Cross-global fetch usage
ja: APIを使用しています。クロスグローバルフェッチの使用法
ko: API : 크로스 글로벌 가져 오기 사용법
ru: API:использование кросс-глобальной выборки
zh_cn: API。跨全球检索使用

source: API: Data
ja: APIを使用しています。データ
ko: API : 데이터
ru: API:Данные
zh_cn: API。数据

source: API: Drawing shapes
ja: API.形状の描画
ko: API : 도형 그리기
ru: API:Чертежные формы
zh_cn: API。绘制形状

source: API: Drawing text
ja: APIを使用しています。テキストの描画
ko: API : 그림 텍스트
ru: API:Рисование текста
zh_cn: API。绘制文本

source: API: Finale
ja: APIを使用しています。フィナーレ
ko: API : 피날레
ru: API:Финал

source: API: Functions and classes available to workers
ja: APIを提供しています。ワーカーが利用できる関数とクラス
ko: API : 작업자가 사용할 수있는 기능 및 클래스
ru: API:Функции и классы,доступные для рабочих
zh_cn: API。工人可使用的函数和类

source: API: Getting started with WebGL
ja: API を使用しています。WebGLを使い始める
ko: API : WebGL 시작하기
ru: API:Начало работы с WebGL
zh_cn: API。开始使用WebGL

source: API: Guide
ja: APIを使用しています。ガイド
ko: API : 가이드
ru: API:Руководство
zh_cn: API。指南

source: API: Hit regions and accessibility
ja: API:ヒット地域とアクセシビリティ
ko: API : 적중 지역 및 접근성
ru: API:Хитовые регионы и доступность
zh_cn: API:命中区域和可访问性

source: API: Intro to RTP
ja: APIの紹介です。RTP入門
ko: API : RTP 소개
ru: API:Введение в RTP
zh_cn: API。RTP介绍

source: API: Lighting in WebGL
ja: API.WebGLでのライティング
ko: API : WebGL의 조명
ru: API:Освещение в WebGL
zh_cn: API。WebGL中的照明

source: API: Manipulating video using canvas
ja: APIです。canvasを使って動画を操作する
ko: API : 캔버스를 사용하여 비디오 조작
ru: API:Манипулирование видео с помощью холста
zh_cn: API。使用画布操纵视频

source: API: Matrix math for the web
ja: API.ウェブ用の行列計算
ko: API : 웹용 매트릭스 수학
ru: API:Матричная математика для паутины
zh_cn: API。矩阵数学在网络上的应用

source: API: Optimizing canvas
ja: APIを使用しています。キャンバスの最適化
ko: API : 캔버스 최적화
ru: API:Оптимизация холста
zh_cn: API。优化画布

source: API: Pixel manipulation with canvas
ja: APIです。キャンバスを使ったピクセル操作
ko: API : 캔버스를 사용한 픽셀 조작
ru: API:Манипуляция пикселями с холстом
zh_cn: API。使用画布进行像素操作

source: API: Protocols
ja: APIを使用しています。プロトコル
ko: API : 프로토콜
ru: API:Протоколы

source: API: Session lifetime
ja: APIを使用しています。セッションの有効期限
ko: API : 세션 수명
ru: API:Продолжительность сессии

source: API: Signaling and video calling
ja: API.シグナリングとビデオ通話
ko: API : 신호 및 화상 통화
ru: API:Сигнализация и видеозвонок
zh_cn: API。信号和视频通话

source: API: Simple RTCDataChannel sample
ja: APIです。シンプルなRTCDataChannelのサンプル
ko: API : 간단한 RTCDataChannel 샘플
ru: API:Простой образец RTCDataChannel
zh_cn: API。简单的RTCDataChannel样本

source: API: Structured clone algorithm
ja: APIを使用しています。構造化クローンアルゴリズム
ko: API : 구조화 된 클론 알고리즘
ru: API:Структурированный алгоритм клонирования
zh_cn: API。结构化克隆算法

source: API: Taking still photos
ja: APIを使用しています。静止画の撮影
ko: API : 스틸 사진 촬영
ru: API:Съемка фотографий
zh_cn: API。拍摄静态照片

source: API: Transformations
ja: API.変形
ko: API : 변환
ru: API:преобразования
zh_cn: API。转化

source: API: Tutorial
ja: APIを使用しています。チュートリアル
ko: API : 튜토리얼
ru: API:Учебники
zh_cn: API。教程

source: API: Types
ja: APIを使用しています。タイプ
ko: API : 유형
ru: API:Типы
zh_cn: API。类型

source: API: Using DTMF
ja: APIを使用しています。DTMFの使用
ko: API : DTMF 사용
ru: API:Использование DTMF
zh_cn: API。使用DTMF

source: API: Using Extensions
ja: APIを使用しています。拡張機能の使用
ko: API : 확장 사용
ru: API:Использование расширений
zh_cn: API。使用扩展程序

source: API: Using Fetch
ja: APIを使用しています。Fetch の使用
ko: API : 가져 오기 사용
ru: API:Использование Fetch
zh_cn: API。使用Fetch

source: API: Using IndexedDB
ja: APIを使用しています。IndexedDBの使用
ko: API : IndexedDB 사용
ru: API:Использование IndexedDB
zh_cn: API。使用 IndexedDB

source: API: Using IndexedDB in chrome
ja: APIを使用しています。クロームでIndexedDBを使用する
ko: API : 크롬에서 IndexedDB 사용
ru: API:Использование IndexedDB в хроме
zh_cn: API。在chrome中使用IndexedDB

source: API: Using VR controllers with WebVR
ja: APIを使用しています。WebVRでVRコントローラを使用する
ko: API : WebVR과 함께 VR 컨트롤러 사용
ru: API:Использование контроллеров VR с WebVR
zh_cn: API。使用WebVR的VR控制器

source: API: Using channel messaging
ja: APIを使用しています。チャンネルメッセージングの使用
ko: API : 채널 메시징 사용
ru: API:Использование канала обмена сообщениями
zh_cn: API。使用渠道信息传递

source: API: Using data channels
ja: APIを使用しています。データチャネルの使用
ko: API : 데이터 채널 사용
ru: API:Использование каналов данных
zh_cn: API。使用数据通道

source: API: Using images
ja: APIを使用しています。画像の使用
ko: API : 이미지 사용
ru: API:Использование изображений
zh_cn: API。使用图像

source: API: Using shaders to apply color in WebGL
ja: APIを使用しています。WebGLでカラーを適用するためのシェーダの使用
ko: API : WebGL에서 셰이더를 사용하여 색상 적용
ru: API:Использование шейдеров для нанесения цвета в WebGL
zh_cn: API。使用着色器在WebGL中应用颜色

source: API: Using textures in WebGL
ja: APIを使用しています。WebGL でのテクスチャの使用
ko: API : WebGL에서 텍스처 사용
ru: API:Использование текстур в WebGL
zh_cn: API。在WebGL中使用纹理

source: API: Using the Performance API
ja: APIを使用しています。パフォーマンス API の使用
ko: API : 성능 API 사용
ru: API:Использование API производительности
zh_cn: API。使用性能API

source: API: Using the WebVR API
ja: APIを使用しています。WebVR APIを使用する
ko: API : WebVR API 사용
ru: API:Использование API WebVR
zh_cn: API。使用WebVR API

source: API: Using web workers
ja: APIを使用しています。ウェブワーカーの使用
ko: API : 웹 워커 사용
ru: API:Использование веб-работников
zh_cn: API。使用网络工作者

source: API: WebGL best practices
ja: APIを使用しています。WebGL のベストプラクティス
ko: API : WebGL 모범 사례
ru: API:передовой опыт WebGL
zh_cn: API。WebGL最佳实践

source: API: WebGL model view projection
ja: APIを使用しています。WebGLモデルビュー投影
ko: API : WebGL 모델 뷰 투영
ru: API:Проекция просмотра модели WebGL
zh_cn: API。WebGL模型视图投影

source: APIs available in workers
ja: ワーカーで利用できるAPI
ko: 작업자에서 사용 가능한 API
ru: доступные API для рабочих
zh_cn: 工人中可用的API

source: ARIA rules
ja: アリア規則
ko: ARIA 규칙
ru: правила АРИА
zh_cn: ARIA规则

source: Abnormal Closure
ja: 異常閉鎖
ko: 비정상적인 폐쇄
ru: Аномальное замыкание
zh_cn: 异常闭合

source: Abort all remaining steps.
ja: 残りのステップをすべて中止します。
ko: 나머지 모든 단계를 중단하십시오.
ru: Прервать все оставшиеся шаги.
zh_cn: 终止所有剩余的步骤。

source: Abort all the remaining steps.
ja: 残りのステップをすべて中止します。
ko: 나머지 모든 단계를 중단하십시오.
ru: Отмените все оставшиеся шаги.
zh_cn: 中止其余所有步骤。

source: Abort due to bad requests, e.g. trying to add() the same key twice, or put() with the same index key with a uniqueness constraint. This causes an error on the request, which can bubble up to an error on the transaction, which aborts the transaction. Can be prevented by using preventDefault() on the error event on the request.
ja: 例えば、同じキーを二度も add()しようとしたり、 一意性制約のある同じインデックスキーで put()しようとしたりするような不正なリクエストが原因でアボートします。これはリクエストのエラーを引き起こし、それがトランザクションのエラーに発展して トランザクションを中断させる可能性があります。これは、リクエストのエラーイベントで preventDefault()を使用することで防ぐことができます。
ko: 요청이 잘못되어 중단 (예 : 동일한 키를 두 번 add ()하려고하거나 고유 인덱스로 동일한 인덱스 키를 사용하여 put () 시도) 이로 인해 요청에 오류가 발생하여 트랜잭션에 오류가 발생하여 트랜잭션이 중단 될 수 있습니다. 요청의 오류 이벤트에 preventDefault ()를 사용하여 방지 할 수 있습니다.
ru: Прерывать из-за плохих запросов,например,дважды пытаться добавить()один и тот же ключ,или put()с одним и тем же индексным ключом с ограничением по уникальности.Это приводит к ошибке в запросе,которая может привести к ошибке в транзакции,которая прерывает транзакцию.Может быть предотвращено с помощью функции preventDefault()по событию ошибки по запросу.
zh_cn: 由于坏的请求而中止,例如试图两次添加()相同的键,或者用相同的索引键与唯一性约束的put()。这将导致请求上的错误,可能会冒出事务上的错误,从而中止事务。可以通过在请求上的错误事件上使用 preventDefault()来防止。

source: Abort these steps.
ja: これらのステップを中止します。
ko: 이 단계를 중단하십시오.
ru: Отмените эти шаги.
zh_cn: 中止这些步骤。

source: Aborting a fetch
ja: フェッチの中止
ko: 가져 오기 중단
ru: Прерывание приёма
zh_cn: 中止取物

source: Aborts a DOM request before it has completed. This is able to abort <a href="windoworworkerglobalscope/fetch">fetch requests</a>, consumption of any response <a href="body"><code>Body</code></a>, and streams.
ja: 完了する前にDOM要求を中止します。これ<a href="windoworworkerglobalscope/fetch">により</a>、フェッチ要求、応答<a href="body"> <code>Body</code> </a>消費、およびストリームを中止できます。
ko: DOM 요청이 완료되기 전에 중단합니다. 이를 통해 <a href="windoworworkerglobalscope/fetch">페치 요청</a> , 응답 <a href="body"> <code>Body</code> </a> 소비 및 스트림 을 중단 할 수 있습니다.
ru: Прерывает запрос DOM до его завершения. Это может прервать <a href="windoworworkerglobalscope/fetch">запросы на выборку</a> , потребление любого <a href="body"> <code>Body</code> </a> ответа и потоков.
zh_cn: 在完成之前中止DOM请求。这能够中止<a href="windoworworkerglobalscope/fetch">获取请求</a>，使用任何响应<a href="body"> <code>Body</code> </a>和流。

source: Aborts the current segment and resets the segment parser.
ja: 現在のセグメントを中断し、セグメントパーサをリセットします。
ko: 현재 세그먼트를 중단하고 세그먼트 파서를 재설정합니다.
ru: Прерывает текущий сегмент и сбрасывает парсер сегментов.
zh_cn: 放弃当前段并重置段解析器。

source: Aborts the read operation. Upon return, the <code>readyState</code> will be <code>DONE</code>.
ja: 読み取り操作を中止します。戻ったとき、 <code>readyState</code> は <code>DONE</code> になります。
ko: 읽기 작업을 중단합니다. 돌아 왔을 때 <code>readyState</code> 는 <code>DONE</code> 입니다.
ru: Прерывает операцию чтения. По возвращению, <code>readyState</code> будет <code>DONE</code> .
zh_cn: 中止读取操作。返回时， <code>readyState</code> 将为 <code>DONE</code> 。

source: Aborts the request if it has already been sent.
ja: リクエストが既に送信されている場合は、そのリクエストを中止します。
ko: 요청이 이미 전송 된 경우 중단합니다.
ru: Отменяет запрос,если он уже отправлен.
zh_cn: 如果请求已经发出,则放弃该请求。

source: Aborts the stream, signaling that the producer can no longer successfully write to the stream and it is to be immediately moved to an error state, with any queued writes discarded.
ja: ストリームを中止します。これは、 プロデューサがストリームへの書き込みに成功できなくなったことを示します。
ko: 스트림을 중단하여 생산자가 더 이상 스트림에 쓸 수 없으며 대기중인 쓰기를 버리고 즉시 오류 상태로 이동해야한다는 신호를 보냅니다.
ru: Прерывает поток,сигнализируя о том,что продюсер больше не может успешно записывать в поток,и он должен быть немедленно переведен в состояние ошибки,при этом любая запись в очереди отбрасывается.
zh_cn: 终止流,标志着生产者不能再成功地写入流,要立即转入错误状态,任何排队的写入都将被丢弃。

source: About the session description parameter
ja: セッション記述パラメータについて
ko: 세션 설명 매개 변수
ru: О параметре описания сеанса
zh_cn: 关于会话描述参数

source: About this document
ja: この文書について
ko: 이 문서에 대하여
ru: Об этом документе
zh_cn: 关于本文件

source: About thread safety
ja: 糸の安全性について
ko: 나사산 안전 정보
ru: О безопасности резьбы
zh_cn: 关于螺纹安全

source: Abstracts properties and methods common to all kind of workers (i.e. <a href="worker"><code>Worker</code></a> or <a href="sharedworker"><code>SharedWorker</code></a>).
ja: すべての種類のワーカー（つまり、<a href="worker"> <code>Worker</code> </a>または<a href="sharedworker"> <code>SharedWorker</code> </a>）に共通のプロパティとメソッドを抽象化します。
ko: 모든 종류의 작업자 (예 : <a href="worker"> <code>Worker</code> </a> 또는 <a href="sharedworker"> <code>SharedWorker</code> </a> )에 공통적 인 속성 및 메서드를 추상화합니다 .
ru: Абстрагирует свойства и методы, общие для всех видов работников (т.е. <a href="worker"> <code>Worker</code> </a> или <a href="sharedworker"> <code>SharedWorker</code> </a> ).
zh_cn: 摘要所有类型的工作人员（即<a href="worker"> <code>Worker</code> </a>或<a href="sharedworker"> <code>SharedWorker</code> </a>）共有的属性和方法。
