Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/dom/dom.*.007.xlf
Languages: es, ko, ru, zh_cn

source: <strong>Note:</strong> If <code>port</code> is <code>null</code>, passing the candidate to <a href="../rtcpeerconnection/addicecandidate"><code>addIceCandidate()</code></a> will fail, throwing an <code>OperationError</code> exception. This applies only if the candidate implements <code>port</code>.
ru: <strong>Примечание.</strong> Если <code>port</code> имеет значение <code>null</code> , передача кандидата в <a href="../rtcpeerconnection/addicecandidate"> <code>addIceCandidate()</code> </a> завершится неудачей, и будет выдано исключение <code>OperationError</code> . Это применимо, только если кандидат реализует <code>port</code> .
zh_cn: <strong>注意：</strong>如果 <code>port</code> 为 <code>null</code> ，则将候选项传递给<a href="../rtcpeerconnection/addicecandidate"> <code>addIceCandidate()</code> </a>将会失败，并引发 <code>OperationError</code> 异常。仅在候选人实施 <code>port</code> 时适用。

source: <strong>Note:</strong> If <code>priority</code> is <code>null</code>, passing the candidate to <a href="../rtcpeerconnection/addicecandidate"><code>addIceCandidate()</code></a> will fail, throwing an <code>OperationError</code> exception. This applies only if the candidate implements the <code>priority</code> property.
ru: <strong>Примечание.</strong> Если <code>priority</code> равен <code>null</code> , передача кандидата в <a href="../rtcpeerconnection/addicecandidate"> <code>addIceCandidate()</code> </a> завершится неудачей, и будет выдано исключение <code>OperationError</code> . Это применимо, только если кандидат реализует свойство <code>priority</code> .
zh_cn: <strong>注意：</strong>如果 <code>priority</code> 为 <code>null</code> ，则将候选者传递给<a href="../rtcpeerconnection/addicecandidate"> <code>addIceCandidate()</code> </a>将会失败，并引发 <code>OperationError</code> 异常。这仅在候选人实现 <code>priority</code> 属性时适用。

source: <strong>Note:</strong> If <code>protocol</code> is <code>null</code> &mdash; and <code>protocol</code> is supported by the <a href="https://developer.mozilla.org/en-US/docs/Glossary/user_agent">user agent</a> &mdash; passing the candidate to <a href="../rtcpeerconnection/addicecandidate"><code>addIceCandidate()</code></a> will fail, throwing an <code>OperationError</code> exception.
ru: <strong>Примечание.</strong> Если <code>protocol</code> равен <code>null</code> а <code>protocol</code> поддерживается <a href="https://developer.mozilla.org/en-US/docs/Glossary/user_agent">пользовательским агентом,</a> передача кандидата в <a href="../rtcpeerconnection/addicecandidate"> <code>addIceCandidate()</code> </a> завершится неудачно, и возникнет исключение <code>OperationError</code> .
zh_cn: <strong>注意：</strong>如果 <code>protocol</code> 为 <code>null</code> （并且<a href="https://developer.mozilla.org/en-US/docs/Glossary/user_agent">用户代理</a>支持 <code>protocol</code> <a href="../rtcpeerconnection/addicecandidate"> <code>addIceCandidate()</code> </a>则将候选者传递给addIceCandidate（）将会失败，并引发 <code>OperationError</code> 异常。

source: <strong>Note:</strong> If SharedWorker can be accessed from several browsing contexts, all those browsing contexts must share the exact same origin (same protocol, host and port).
ru: <strong>Примечание.</strong> Если доступ к SharedWorker возможен из нескольких контекстов просмотра, все эти контексты просмотра должны иметь одинаковое происхождение (один и тот же протокол, хост и порт).
zh_cn: <strong>注意：</strong>如果可以从多个浏览上下文访问SharedWorker，则所有这些浏览上下文必须共享完全相同的来源（相同的协议，主机和端口）。

source: <strong>Note:</strong> If a <a href="https://www.w3.org/TR/presentation-api/#dfn-controlling-user-agent">controlling user agent</a> does not support initiation of a <a href="https://www.w3.org/TR/presentation-api/#dfn-presentation-connection">presentation connection</a> from the browser chrome, setting <code>defaultRequest</code> will have no effect.
ru: <strong>Примечание.</strong> Если <a href="https://www.w3.org/TR/presentation-api/#dfn-controlling-user-agent">управляющий пользовательский агент</a> не поддерживает инициирование <a href="https://www.w3.org/TR/presentation-api/#dfn-presentation-connection">подключения</a> к презентации из браузера Chrome, настройка <code>defaultRequest</code> не будет действовать.
zh_cn: <strong>注意：</strong>如果<a href="https://www.w3.org/TR/presentation-api/#dfn-controlling-user-agent">控制用户代理</a>不支持从浏览器镶边启动<a href="https://www.w3.org/TR/presentation-api/#dfn-presentation-connection">演示连接</a>，则设置 <code>defaultRequest</code> 将无效。

source: <strong>Note:</strong> If a line doesn't contain a colon, the entire line is treated as the field name with an empty value string.
ru: <strong>Примечание.</strong> Если строка не содержит двоеточия, вся строка рассматривается как имя поля с пустой строкой значения.
zh_cn: <strong>注意：</strong>如果某行不包含冒号，则将整行视为具有空值字符串的字段名称。

source: <strong>Note:</strong> If a scheduled stop time occurs before the node's scheduled start time, the node never starts to play.
ru: <strong>Примечание.</strong> Если запланированное время остановки наступает раньше запланированного времени запуска узла, узел никогда не начинает воспроизведение.
zh_cn: <strong>注意：</strong>如果计划的停止时间早于节点的计划的开始时间，则该节点永远不会开始播放。

source: <strong>Note:</strong> If the <a href="../response"><code>Response</code></a> has a <a href="../response/type"><code>Response.type</code></a> of <code>"opaque"</code>, the resulting <a href="../blob"><code>Blob</code></a> will have a <a href="../blob/size"><code>Blob.size</code></a> of <code>0</code> and a <a href="../blob/type"><code>Blob.type</code></a> of empty string <code>""</code>, which renders it <em>useless</em> for methods like <a href="../url/createobjecturl"><code>URL.createObjectURL</code></a>.
ru: <strong>Примечание:</strong> Если <a href="../response"> <code>Response</code> </a> имеет <a href="../response/type"> <code>Response.type</code> </a> из <code>"opaque"</code> , в результате <a href="../blob"> <code>Blob</code> </a> будет <a href="../blob/size"> <code>Blob.size</code> </a> от <code>0</code> и <a href="../blob/type"> <code>Blob.type</code> </a> в пустую строку <code>""</code> , которая делает его <em>бесполезным</em> для методов , таких как <a href="../url/createobjecturl"> <code>URL.createObjectURL</code> </a> .
zh_cn: <strong>注意：</strong>如果<a href="../response"> <code>Response</code> </a>的<a href="../response/type"> <code>Response.type</code> </a>为 <code>"opaque"</code> ，则生成的<a href="../blob"> <code>Blob</code> </a>的<a href="../blob/size"> <code>Blob.size</code> </a>为 <code>0</code> ,而<a href="../blob/type"> <code>Blob.type</code> </a>为空字符串 <code>""</code> ，这使其对<a href="../url/createobjecturl"> <code>URL.createObjectURL</code> 之类的</a>方法<em>无效</em>。

source: <strong>Note:</strong> If the hardware doesn't know how to remove gravity from the acceleration data, this value may not be present in the <a href="../devicemotionevent"><code>DeviceMotionEvent</code></a>. In this situation, you'll need to use <a href="accelerationincludinggravity"><code>DeviceMotionEvent.accelerationIncludingGravity</code></a> instead.
ru: <strong>Примечание.</strong> Если оборудование не знает, как удалить гравитацию из данных ускорения, это значение может отсутствовать в <a href="../devicemotionevent"> <code>DeviceMotionEvent</code> </a> . В этой ситуации вам нужно будет использовать <a href="accelerationincludinggravity"> <code>DeviceMotionEvent.accelerationIncludingGravity</code> </a> .
zh_cn: <strong>注意：</strong>如果硬件不知道如何从加速度数据中消除重力，则<a href="../devicemotionevent"> <code>DeviceMotionEvent</code> 中</a>可能不存在该值。在这种情况下，您需要改用<a href="accelerationincludinggravity"> <code>DeviceMotionEvent.accelerationIncludingGravity</code> </a>。

source: <strong>Note:</strong> If the key is used as a macro that inserts multiple characters, this attribute's value is the entire string, not just the first character.
ru: <strong>Примечание.</strong> Если ключ используется в качестве макроса, который вставляет несколько символов, значением этого атрибута является вся строка, а не только первый символ.
zh_cn: <strong>注意：</strong>如果键用作插入多个字符的宏，则此属性的值是整个字符串，而不仅仅是第一个字符。

source: <code>value</code> is a string containing the value of the current node, if any.
es: <code>value</code> es una cadena que contiene el valor del nodo actual, si lo hay.
ko: <code>value</code> 는 현재 노드의 값을 포함하는 문자열입니다 (있는 경우).

source: <code>value</code>: Vender-specific request parameters.
es: <code>value</code> : par&aacute;metros de solicitud espec&iacute;ficos del vendedor.
ko: <code>value</code> : 벤더별 요청 매개 변수.

source: <code>variant</code>: variant
es: <code>variant</code> e : variante
ko: <code>variant</code> : 변형

source: <code>vertical</code> omitted
es: <code>vertical</code> omitido
ko: <code>vertical</code> 생략

source: <code>vibrate</code>: A <a href="https://developer.mozilla.org/en-US/docs/Web/Guide/API/Vibration#Vibration_patterns">vibration pattern</a> for the device's vibration hardware to emit when the notification fires.
es: <code>vibrate</code> : un <a href="https://developer.mozilla.org/en-US/docs/Web/Guide/API/Vibration#Vibration_patterns">patr&oacute;n de vibraci&oacute;n</a> para que el hardware de vibraci&oacute;n del dispositivo emita cuando se activa la notificaci&oacute;n.
ko: <code>vibrate</code> : 알림 발생시 장치의 진동 하드웨어가 방출 하는 <a href="https://developer.mozilla.org/en-US/docs/Web/Guide/API/Vibration#Vibration_patterns">진동 패턴</a> 입니다.

source: <code>vibrate</code>: A vibration pattern to run with the display of the notification. A vibration pattern can be an array with as few as one member. The values are times in milliseconds where the even indices (0, 2, 4, etc.) indicate how long to vibrate and the odd indices indicate how long to pause. For example, <code>[300, 100, 400]</code> would vibrate 300ms, pause 100ms, then vibrate 400ms.
es: <code>vibrate</code> : un patr&oacute;n de vibraci&oacute;n que se ejecuta con la visualizaci&oacute;n de la notificaci&oacute;n. Un patr&oacute;n de vibraci&oacute;n puede ser una matriz con tan solo un miembro. Los valores son tiempos en milisegundos donde los &iacute;ndices pares (0, 2, 4, etc.) indican cu&aacute;nto tiempo vibrar y los &iacute;ndices impares indican cu&aacute;nto tiempo hacer una pausa. Por ejemplo, <code>[300, 100, 400]</code> vibrar&iacute;a 300 ms, pausar&iacute;a 100 ms y luego vibrar&iacute;a 400 ms.
ko: <code>vibrate</code> : 알림 표시와 함께 실행할 진동 패턴입니다. 진동 패턴은 하나의 멤버 만있는 배열 일 수 있습니다. 값은 밀리 초 단위이며 짝수 인덱스 (0, 2, 4 등)는 진동 시간을 나타내며 홀수 인덱스는 일시 정지 시간을 나타냅니다. 예를 들어 <code>[300, 100, 400]</code> 은 300ms를 진동시키고 100ms를 일시 정지시킨 다음 400ms를 진동시킵니다.

source: <code>videoBitsPerSecond</code>: The chosen bitrate for the video component of the media.
es: <code>videoBitsPerSecond</code> : la tasa de bits elegida para el componente de video de los medios.
ko: <code>videoBitsPerSecond</code> : 미디어의 비디오 구성 요소에 대해 선택된 비트 전송률입니다.

source: <code>view:</code> optional and defaulting to <code>null</code>, of type <a href="https://developer.mozilla.org/en-US/docs/Web/API/WindowProxy"><code>WindowProxy</code></a>, that is the <a href="../window"><code>Window</code></a> associated with the event .
es: <code>view:</code> opcional y predeterminado a <code>null</code> , de tipo <a href="https://developer.mozilla.org/en-US/docs/Web/API/WindowProxy"> <code>WindowProxy</code> </a> , que es la <a href="../window"> <code>Window</code> </a> asociada con el evento.
ko: <code>view:</code> 선택 사항이며 기본값은 <code>null</code> 이며, <a href="https://developer.mozilla.org/en-US/docs/Web/API/WindowProxy"> <code>WindowProxy</code> </a> 유형 , 즉 이벤트와 연관된 <a href="../window"> <code>Window</code> </a> 입니다.

source: <code>view</code> is a reference to an <code>AbstractView</code> object.
es: <code>view</code> es una referencia a un objeto <code>AbstractView</code> .
ko: <code>view</code> 는 <code>AbstractView</code> 객체에 대한 참조 입니다.

source: <code>violatedDirective</code>: The <a href="violateddirective"><code>violatedDirective</code></a> of the <code>SecurityPolicyViolationEvent</code> (<strong>required</strong>).
es: <code>violatedDirective</code> : El <a href="violateddirective"> <code>violatedDirective</code> </a> del <code>SecurityPolicyViolationEvent</code> ( <strong>obligatorio</strong> ).
ko: <code>violatedDirective</code> : <code>SecurityPolicyViolationEvent</code> 의 <a href="violateddirective"> <code>violatedDirective</code> </a> 입니다 ( <strong>필수</strong> ).<strong></strong>

source: <code>void <a href="#removeDataAttr()">removeDataAttr</a>(in DOMString prop);</code>Violates the XPCOM interface guidelines
es: <code>void <a href="#removeDataAttr()">removeDataAttr</a>(in DOMString prop);</code> Viola las pautas de la interfaz XPCOM
ko: <code>void <a href="#removeDataAttr()">removeDataAttr</a>(in DOMString prop);</code> XPCOM 인터페이스 지침을 위반합니다

source: <code>void <a href="#removeProp()">removeProp</a>(in nsIAtom attr);</code>Violates the XPCOM interface guidelines
es: <code>void <a href="#removeProp()">removeProp</a>(in nsIAtom attr);</code> Viola las pautas de la interfaz XPCOM
ko: <code>void <a href="#removeProp()">removeProp</a>(in nsIAtom attr);</code> XPCOM 인터페이스 지침을 위반합니다

source: <code>void <a href="#setDataAttr()">setDataAttr</a>(in DOMString prop, in DOMString value);</code>Native code only!
es: <code>void <a href="#setDataAttr()">setDataAttr</a>(in DOMString prop, in DOMString value);</code> C&oacute;digo nativo solamente!
ko: <code>void <a href="#setDataAttr()">setDataAttr</a>(in DOMString prop, in DOMString value);</code> 네이티브 코드 만!

source: <code>volumeControl</code> is the <a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/input"><code>&lt;input&gt;</code></a> element (of type <code>"range"</code>) used to control the master audio volume.
es: <code>volumeControl</code> es el elemento <a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/input"> <code>&lt;input&gt;</code> </a> (de tipo <code>"range"</code> ) utilizado para controlar el volumen de audio maestro.
ko: <code>volumeControl</code> 은 마스터 오디오 볼륨을 제어하는 ​​데 사용되는 <a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/input"> <code>&lt;input&gt;</code> </a> 요소 ( <code>"range"</code> 유형 )입니다.

source: <code>vrDisplay</code> starts uninitialized, but will later on hold a reference to our VR headset (<a href="../vrdisplay"><code>VRDisplay</code></a> &mdash; the central control object of the API).
es: <code>vrDisplay</code> comienza sin inicializar, pero m&aacute;s tarde mantendr&aacute; una referencia a nuestros auriculares VR ( <a href="../vrdisplay"> <code>VRDisplay</code> </a> , el objeto de control central de la API).
ko: <code>vrDisplay</code> 는 초기화되지 않았지만 나중에 VR 헤드셋 ( <a href="../vrdisplay"> <code>VRDisplay</code> </a> -API의 중앙 제어 객체)에 대한 참조를 보류합니다 .

source: <code>wavePicker</code> is the <a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/select"><code>&lt;select&gt;</code></a> element used to choose the waveform to use for the notes.
es: <code>wavePicker</code> es el elemento <a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/select"> <code>&lt;select&gt;</code> </a> utilizado para elegir la forma de onda que se utilizar&aacute; para las notas.
ko: <code>wavePicker</code> 는 음표에 사용할 파형을 선택하는 데 사용되는 <a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/select"> <code>&lt;select&gt;</code> </a> 요소입니다.

source: <code>webgl.enable-draft-extensions</code> in Firefox
es: <code>webgl.enable-draft-extensions</code> en Firefox
ko: <code>webgl.enable-draft-extensions</code> Firefox에서 webgl.enable-draft-extensions

source: <code>weight</code>: Weight
es: <code>weight</code> : peso
ko: <code>weight</code> : 무게

source: <code>whatToShow</code> and <code>filter</code> optional
es: <code>whatToShow</code> y <code>filter</code> opcional
ko: <code>whatToShow</code> 및 <code>filter</code> 옵션

source: <code>wholeText</code> is just a property of text nodes that returns the string of data making up all the adjacent (i.e. not separated by an element boundary) text nodes combined.
es: <code>wholeText</code> es solo una propiedad de los nodos de texto que devuelve la cadena de datos que forman todos los nodos de texto adyacentes (es decir, no separados por un l&iacute;mite de elemento) combinados.
ko: <code>wholeText</code> 는 텍스트 노드의 속성으로, 인접한 모든 (즉, 요소 ​​경계로 분리되지 않은) 텍스트 노드를 구성하는 데이터 문자열을 반환합니다.

source: <code>width</code> &mdash; optional and defaulting to <code>1</code>, of type <code>double</code>, that sets the value of the instance's <a href="width"><code>PointerEvent.width</code></a>.
es: <code>width</code> : opcional y predeterminado en <code>1</code> , de tipo <code>double</code> , que establece el valor del <a href="width"> <code>PointerEvent.width</code> </a> de la instancia .
ko: <code>width</code> - 선택과에 디폴트 <code>1</code> 형, <code>double</code> , 인스턴스의 값 설정이 <a href="width"> <code>PointerEvent.width</code> 을</a> .

source: <code>width</code>: The width of the rectangle.
es: <code>width</code> : el ancho del rect&aacute;ngulo.
ko: <code>width</code> : 사각형의 너비입니다.

source: <code>willValidate </code>Read only
es: <code>willValidate </code> Solo lectura
ko: <code>willValidate </code> 읽기 전용

source: <code>window.document</code> returns a reference to the document contained in the window.
es: <code>window.document</code> devuelve una referencia al documento contenido en la ventana.
ko: <code>window.document</code> 는 창에 포함 된 문서에 대한 참조를 반환합니다.

source: <code>window.name</code> will convert all values to their string representations by using the <code>toString</code> method.
es: <code>window.name</code> convertir&aacute; todos los valores a sus representaciones de cadena utilizando el m&eacute;todo <code>toString</code> .
ko: <code>window.name</code> 은 <code>toString</code> 메소드 를 사용하여 모든 값을 문자열 표현으로 변환합니다 .

source: <code>window.postMessage</code> is available to JavaScript running in chrome code (e.g., in extensions and privileged code), but the <code>source</code> property of the dispatched event is always <code>null</code> as a security restriction. (The other properties have their expected values.)
es: <code>window.postMessage</code> est&aacute; disponible para JavaScript que se ejecuta en el c&oacute;digo de cromo (por ejemplo, en las extensiones y el c&oacute;digo privilegiado), pero la <code>source</code> la propiedad de la distribuye el evento es siempre <code>null</code> como una restricci&oacute;n de seguridad. (Las otras propiedades tienen sus valores esperados).
ko: <code>window.postMessage</code> 는 크롬 코드 (예 : 확장 프로그램 및 권한있는 코드)에서 실행되는 JavaScript에 사용할 수 있지만 전달 된 이벤트 의 <code>source</code> 속성은 보안 제한 사항으로 항상 <code>null</code> 입니다. 다른 속성에는 예상 값이 있습니다.

source: <code>window[0]</code>,<code> window[1]</code>, etc.
ko: <code>window[0]</code> , <code> window[1]</code> 등

source: <code>withCredentials</code>, defaulting to <code>false</code>, indicating if CORS should be set to <code>include</code> credentials.
es: <code>withCredentials</code> , por defecto en <code>false</code> , indicando si CORS debe configurarse para <code>include</code> credenciales.
ko: <code>withCredentials</code> , 기본값은 <code>false</code> 이며 CORS가 자격 증명 을 <code>include</code> 하도록 설정되어야하는지 여부를 나타냅니다 .

source: <code>write(chunk,controller)</code> &mdash; A method that is called repeatedly every time a new chunk is ready to be written to the underlying sink (specified in the <code>chunk</code> parameter).
es: <code>write(chunk,controller)</code> : un m&eacute;todo que se llama repetidamente cada vez que un nuevo fragmento est&aacute; listo para escribirse en el sumidero subyacente (especificado en el par&aacute;metro del <code>chunk</code> ).
ko: <code>write(chunk,controller)</code> &mdash; 기본 청크에 새 청크를 쓸 준비가 될 때마다 ( <code>chunk</code> 매개 변수로 지정) 반복적으로 호출되는 메서드입니다 .

source: <code>x-coord</code> is the horizontal pixel value that you want to scroll by.
es: <code>x-coord</code> es el valor de p&iacute;xel horizontal por el que desea desplazarse.
ko: <code>x-coord</code> 는 스크롤하려는 가로 픽셀 값입니다.

source: <code>x-coord</code> is the pixel along the horizontal axis of the document that you want displayed in the upper left.
es: <code>x-coord</code> es el p&iacute;xel a lo largo del eje horizontal del documento que desea que se muestre en la esquina superior izquierda.
ko: <code>x-coord</code> 는 왼쪽 상단에 표시하려는 문서의 가로 축을 따라있는 픽셀입니다.

source: <code>x-coord</code> is the pixel along the horizontal axis of the element that you want displayed in the upper left.
es: <code>x-coord</code> es el p&iacute;xel a lo largo del eje horizontal del elemento que desea que se muestre en la esquina superior izquierda.
ko: <code>x-coord</code> 는 왼쪽 상단에 표시하려는 요소의 가로 축을 따라있는 픽셀입니다.

source: <code>x</code> is the horizontal coordinate to be moved to.
es: <code>x</code> es la coordenada horizontal a la que se mover&aacute;.
ko: <code>x</code> 는 이동할 수평 좌표입니다.

source: <code>x</code>: The coordinate of the left side of the rectangle.
es: <code>x</code> : La coordenada del lado izquierdo del rect&aacute;ngulo.
ko: <code>x</code> : 사각형의 왼쪽 좌표입니다.

source: <code>xDelta</code> is the number of pixels to grow the window horizontally.
es: <code>xDelta</code> es el n&uacute;mero de p&iacute;xeles para hacer crecer la ventana horizontalmente.
ko: <code>xDelta</code> 는 창을 가로로자를 픽셀 수입니다.

source: <code>xpathExpression</code> is a string representing the XPath to be evaluated.
es: <code>xpathExpression</code> es una cadena que representa la XPath a evaluar.
ko: <code>xpathExpression</code> 은 평가할 XPath를 나타내는 문자열입니다.

source: <code>y-coord</code> is the pixel along the vertical axis of the document that you want displayed in the upper left.
es: <code>y-coord</code> es el p&iacute;xel a lo largo del eje vertical del documento que desea que se muestre en la esquina superior izquierda.
ko: <code>y-coord</code> 는 왼쪽 상단에 표시하려는 문서의 세로 축을 따르는 픽셀입니다.

source: <code>y-coord</code> is the pixel along the vertical axis of the element that you want displayed in the upper left.
es: <code>y-coord</code> es el p&iacute;xel a lo largo del eje vertical del elemento que desea que se muestre en la esquina superior izquierda.
ko: <code>y-coord</code> 는 왼쪽 상단에 표시하려는 요소의 세로 축을 따르는 픽셀입니다.

source: <code>y-coord</code> is the vertical pixel value that you want to scroll by.
es: <code>y-coord</code> es el valor de p&iacute;xel vertical por el que desea desplazarse.
ko: <code>y-coord</code> 는 스크롤하려는 수직 픽셀 값입니다.

source: <code>y</code> is the vertical coordinate to be moved to.
es: <code>y</code> es la coordenada vertical a la que se mover&aacute;.
ko: <code>y</code> 는 이동할 수직 좌표입니다.

source: <code>y</code>: The coordinate of the right side of the rectangle.
es: <code>y</code> : La coordenada del lado derecho del rect&aacute;ngulo.
ko: <code>y</code> : 사각형의 오른쪽 좌표입니다.

source: <code>yDelta</code> is the number of pixels to grow the window vertically.
es: <code>yDelta</code> es el n&uacute;mero de p&iacute;xeles para hacer crecer la ventana verticalmente.
ko: <code>yDelta</code> 는 창을 세로로자를 픽셀 수입니다.
