Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/dom/dom.*.007.xlf
Languages: es, ko, ru, zh_cn

source: <strong>If you do not expect to receive messages from other sites, <em>do not</em> add any event listeners for <code>message</code> events.</strong> This is a completely foolproof way to avoid security problems.
es: <strong>Si no espera recibir mensajes de otros sitios, <em>no</em> agregue ning&uacute;n detector de eventos para eventos de <code>message</code> . </strong>Esta es una forma completamente infalible para evitar problemas de seguridad.
ko: <strong>다른 사이트에서 메시지를받을 것으로 예상 <em>되지 않으면 </em> <code>message</code> 이벤트에 대한 이벤트 리스너를 추가 <em>하지 마십시오</em> . </strong>이것은 보안 문제를 피할 수있는 완벽한 방법입니다.
ru: <strong>Если вы не ожидаете получать сообщения с других сайтов, <em>не</em> добавляйте прослушиватели событий для <code>message</code> . </strong>Это абсолютно надежный способ избежать проблем с безопасностью.
zh_cn: <strong>如果您不希望收到来自其他站点的消息，<em>请不要</em>为 <code>message</code> 事件添加任何事件侦听器。</strong>这是避免安全问题的完全简便的方法。

source: <strong>Important note:</strong> The number given in this string is always specified using the period (".") as the decimal point, rather than the comma (","), even if the user's locale normally uses the comma. You must convert the entered text to this form or it will not be valid.
es: <strong>Nota importante:</strong> El n&uacute;mero dado en esta cadena siempre se especifica utilizando el punto (".") Como punto decimal, en lugar de la coma (","), incluso si la configuraci&oacute;n regional del usuario normalmente usa la coma. Debe convertir el texto ingresado a este formulario o no ser&aacute; v&aacute;lido.
ko: <strong>중요 사항 :</strong> 이 문자열에 지정된 숫자는 사용자의 로케일이 일반적으로 쉼표를 사용하더라도 항상 쉼표 ( ",")가 아닌 마침표 ( ".")를 사용하여 지정됩니다. 입력 한 텍스트를이 양식으로 변환해야합니다. 그렇지 않으면 유효하지 않습니다.
ru: <strong>Важное примечание:</strong> число, указанное в этой строке, всегда указывается с использованием точки (".") В качестве десятичной точки, а не запятой (","), даже если языковой стандарт пользователя обычно использует запятую. Вы должны преобразовать введенный текст в эту форму, иначе он будет недействительным.
zh_cn: <strong>重要说明：</strong>即使用户的语言环境通常使用逗号，也始终使用句点（&ldquo;。&rdquo;）作为小数点来指定此字符串中给出的数字，而不是逗号（&ldquo;，&rdquo;）。您必须将输入的文本转换为此格式，否则将无效。

source: <strong>Important: This is the standard wheel event interface to use.</strong> Old versions of browsers implemented the non-standard and non-cross-browser-compatible <a href="https://developer.mozilla.org/en-US/docs/Web/API/MouseWheelEvent"><code>MouseWheelEvent</code></a> and <a href="https://developer.mozilla.org/en-US/docs/Web/API/MouseScrollEvent"><code>MouseScrollEvent</code></a> interfaces. Use this interface and avoid the non-standard ones.
es: <strong>Importante: Esta es la interfaz de evento de rueda est&aacute;ndar para usar. </strong>Las versiones anteriores de los navegadores implementaban las interfaces <a href="https://developer.mozilla.org/en-US/docs/Web/API/MouseWheelEvent"> <code>MouseWheelEvent</code> </a> y <a href="https://developer.mozilla.org/en-US/docs/Web/API/MouseScrollEvent"> <code>MouseScrollEvent</code> </a> no est&aacute;ndar y no compatibles con el navegador cruzado . Use esta interfaz y evite las no est&aacute;ndar.
ko: <strong>중요 사항 : 이것은 표준 휠 이벤트 인터페이스입니다. </strong>이전 버전의 브라우저는 비표준 및 비 브라우저 호환 <a href="https://developer.mozilla.org/en-US/docs/Web/API/MouseWheelEvent"> <code>MouseWheelEvent</code> </a> 및 <a href="https://developer.mozilla.org/en-US/docs/Web/API/MouseScrollEvent"> <code>MouseScrollEvent</code> </a> 인터페이스를 구현했습니다. 이 인터페이스를 사용하고 비표준 인터페이스를 피하십시오.
ru: <strong>Важно: это стандартный интерфейс событий колеса для использования. </strong>В старых версиях браузеров реализованы нестандартные и не совместимые с <a href="https://developer.mozilla.org/en-US/docs/Web/API/MouseScrollEvent"> <code>MouseScrollEvent</code> </a> интерфейсы <a href="https://developer.mozilla.org/en-US/docs/Web/API/MouseWheelEvent"> <code>MouseWheelEvent</code> </a> и MouseScrollEvent . Используйте этот интерфейс и избегайте нестандартных.
zh_cn: <strong>重要：这是要使用的标准车轮事件界面。</strong>旧版本的浏览器实现了非标准且非跨浏览器兼容的<a href="https://developer.mozilla.org/en-US/docs/Web/API/MouseWheelEvent"> <code>MouseWheelEvent</code> </a>和<a href="https://developer.mozilla.org/en-US/docs/Web/API/MouseScrollEvent"> <code>MouseScrollEvent</code> </a>接口。使用此接口，避免使用非标准接口。

source: <strong>Important:</strong> If you still have code that relies on <a href="createobjecturl"><code>createObjectURL()</code></a> to attach streams to media elements, you need to update your code to simply set <a href="../htmlmediaelement/srcobject"><code>srcObject</code></a> to the <code>MediaStream</code> directly.
es: <strong>Importante:</strong> Si todav&iacute;a tiene c&oacute;digo que se basa en <a href="createobjecturl"> <code>createObjectURL()</code> </a> para unir flujos de elementos multimedia, es necesario actualizar el c&oacute;digo simplemente establecer <a href="../htmlmediaelement/srcobject"> <code>srcObject</code> </a> a la <code>MediaStream</code> directamente.
ko: <strong>중요 사항 :</strong> 미디어 요소에 스트림을 첨부하기 위해 <a href="createobjecturl"> <code>createObjectURL()</code> </a> 에 의존하는 코드가 여전히 있으면 코드 를 업데이트하여 <a href="../htmlmediaelement/srcobject"> <code>srcObject</code> </a> 를 <code>MediaStream</code> 에 직접 설정하십시오.
ru: <strong>Важное </strong><a href="createobjecturl"> <code>createObjectURL()</code> </a><strong> :</strong> Если у вас все еще есть код, который использует метод createObjectURL () для присоединения потоков к элементам мультимедиа, необходимо обновить код, чтобы просто <a href="../htmlmediaelement/srcobject"> <code>srcObject</code> </a> установить srcObject для <code>MediaStream</code> .
zh_cn: <strong>重要说明：</strong>如果您仍然具有依靠<a href="createobjecturl"> <code>createObjectURL()</code> </a>将流附加到媒体元素的代码，则需要更新代码以将<a href="../htmlmediaelement/srcobject"> <code>srcObject</code> </a>直接设置为 <code>MediaStream</code> 。

source: <strong>Important</strong>: Application Cache is deprecated as of Firefox 44, and is no longer available in insecure contexts from Firefox 60 onwards (<a href="https://bugzilla.mozilla.org/show_bug.cgi?id=1354175">bug 1354175</a>, currently Nightly/Beta only). Don't use it to make offline websites &mdash; consider using <a href="../service_worker_api">service workers</a> instead.
es: <strong>Importante</strong> : Application Cache est&aacute; en desuso a partir de Firefox 44, y ya no est&aacute; disponible en contextos inseguros desde Firefox 60 en adelante ( <a href="https://bugzilla.mozilla.org/show_bug.cgi?id=1354175">error 1354175</a> , actualmente Nightly / Beta solamente). No lo use para crear sitios web fuera de l&iacute;nea: considere usar <a href="../service_worker_api">trabajadores de servicio</a> .
ko: <strong>중요</strong> : Application Cache는 Firefox 44부터 더 이상 사용되지 않으며 Firefox 60부터는 안전하지 않은 컨텍스트에서 더 이상 사용할 수 없습니다 ( <a href="https://bugzilla.mozilla.org/show_bug.cgi?id=1354175">버그 1354175</a> , 현재 야간 / 베타 전용). 오프라인 웹 사이트를 만드는 데 사용하지 마십시오 . 대신 <a href="../service_worker_api">서비스 작업자를</a> 사용하십시오.
ru: <strong>Важное замечание</strong> : Кэш приложений устарел начиная с Firefox 44 и больше не доступен в небезопасных контекстах начиная с Firefox 60 и более <a href="https://bugzilla.mozilla.org/show_bug.cgi?id=1354175">поздних версий</a> ( ошибка 1354175 , в настоящее время только Nightly / Beta). Не используйте его для создания офлайн-сайтов - рассмотрите возможность использования <a href="../service_worker_api">сервисных работников</a> .
zh_cn: <strong>重要说明</strong>：从Firefox 44开始，不推荐使用应用程序缓存，并且从Firefox 60开始，在不安全的上下文中不再可用（<a href="https://bugzilla.mozilla.org/show_bug.cgi?id=1354175">错误1354175</a>，仅适用于Nightly / Beta）。不要使用它来制作离线网站，而应考虑使用<a href="../service_worker_api">服务人员</a>。

source: <strong>Important</strong>: Application Cache is deprecated as of Firefox 44, and is no longer available in insecure contexts from Firefox 60 onwards (<a href="https://bugzilla.mozilla.org/show_bug.cgi?id=1354175">bug 1354175</a>, currently Nightly/Beta only). Don't use it to offline websites &mdash; consider using <a href="../service_worker_api">service workers</a> instead.
es: <strong>Importante</strong> : Application Cache est&aacute; en desuso a partir de Firefox 44, y ya no est&aacute; disponible en contextos inseguros desde Firefox 60 en adelante ( <a href="https://bugzilla.mozilla.org/show_bug.cgi?id=1354175">error 1354175</a> , actualmente Nightly / Beta solamente). No lo use para sitios web fuera de l&iacute;nea: considere usar <a href="../service_worker_api">trabajadores de servicio en su</a> lugar.
ko: <strong>중요</strong> : Application Cache는 Firefox 44부터 더 이상 사용되지 않으며 Firefox 60부터는 안전하지 않은 컨텍스트에서 더 이상 사용할 수 없습니다 ( <a href="https://bugzilla.mozilla.org/show_bug.cgi?id=1354175">버그 1354175</a> , 현재 야간 / 베타 전용). 오프라인 웹 사이트에는 사용하지 마십시오 . 대신 <a href="../service_worker_api">서비스 워커</a> 사용을 고려하십시오 .
ru: <strong>Важное замечание</strong> : Кэш приложений устарел начиная с Firefox 44 и больше не доступен в небезопасных контекстах начиная с Firefox 60 и более <a href="https://bugzilla.mozilla.org/show_bug.cgi?id=1354175">поздних версий</a> ( ошибка 1354175 , в настоящее время только Nightly / Beta). Не используйте его для офлайн-сайтов - рассмотрите возможность использования <a href="../service_worker_api">сервисных работников</a> .
zh_cn: <strong>重要说明</strong>：从Firefox 44开始，不推荐使用应用程序缓存，并且从Firefox 60开始，在不安全的上下文中不再可用（<a href="https://bugzilla.mozilla.org/show_bug.cgi?id=1354175">错误1354175</a>，仅适用于Nightly / Beta）。不要将其用于离线网站，而应考虑使用<a href="../service_worker_api">服务人员</a>。

source: <strong>Important</strong>: As of Firefox 52, the property defined in this mixin has been moved to the <a href="windoworworkerglobalscope"><code>WindowOrWorkerGlobalScope</code></a> mixin, and other browsers will follow suit. Look to that page for up-to-date details.
es: <strong>Importante</strong> : a partir de Firefox 52, la propiedad definida en esta combinaci&oacute;n se ha movido a la <a href="windoworworkerglobalscope"> <code>WindowOrWorkerGlobalScope</code> </a> , y otros navegadores har&aacute;n lo mismo. Mire esa p&aacute;gina para obtener detalles actualizados.
ko: <strong>중요 사항</strong> : Firefox 52 <a href="windoworworkerglobalscope"> <code>WindowOrWorkerGlobalScope</code> </a> 믹스 인에 정의 된 속성이 WindowOrWorkerGlobalScope 믹스 인 으로 이동 되었으며 다른 브라우저가 적합합니다. 최신 정보는 해당 페이지를 참조하십시오.
ru: <strong>Важное </strong><a href="windoworworkerglobalscope"> <code>WindowOrWorkerGlobalScope</code> </a> : Начиная с Firefox 52, свойство, определенное в этом миксине, было перемещено в микшин WindowOrWorkerGlobalScope , и другие браузеры последуют его примеру. Посмотрите на эту страницу для получения актуальной информации.
zh_cn: <strong>重要说明</strong>：从Firefox 52开始，此混入中定义的属性已移至<a href="windoworworkerglobalscope"> <code>WindowOrWorkerGlobalScope</code> </a>混入中，其他浏览器也将效仿。查看该页面以获取最新详细信息。

source: <strong>Important</strong>: Byte streams are not implemented anywhere as yet, and questions have been raised as to whether the spec details are in a finished enough state for them to be implemented. This may change over time.
es: <strong>Importante</strong> : las secuencias de bytes a&uacute;n no se han implementado en ninguna parte, y se han planteado preguntas sobre si los detalles de las especificaciones est&aacute;n en un estado lo suficientemente terminado para que puedan implementarse. Esto puede cambiar con el tiempo.
ko: <strong>중요</strong> : 바이트 스트림은 아직 어느 곳에서도 구현되지 않았으며 사양 세부 정보가 구현하기에 충분한 상태인지 여부에 대한 질문이 제기되었습니다. 시간이지나면서 변경 될 수 있습니다.
ru: <strong>Важный</strong> : потоки байта еще нигде не реализованы, и были подняты вопросы относительно того, находятся ли детали спецификации в достаточно законченном состоянии для их реализации. Это может измениться со временем.
zh_cn: <strong>重要说明</strong>：字节流尚未在任何地方实现，并且已经提出了有关规范详细信息是否处于完成状态以供实现的疑问。这可能会随着时间而改变。

source: <strong>Important</strong>: For compatibility reasons, this property has been replaced by the <a href="getrootnode"><code>Node.getRootNode()</code></a> method.
es: <strong>Importante</strong> : por razones de compatibilidad, esta propiedad ha sido reemplazada por el m&eacute;todo <a href="getrootnode"> <code>Node.getRootNode()</code> </a> .
ko: <strong>중요</strong> : 호환성을 위해이 특성은 <a href="getrootnode"> <code>Node.getRootNode()</code> </a> 메소드 로 대체되었습니다 .
ru: <strong>Важное </strong><a href="getrootnode"> <code>Node.getRootNode()</code> </a> : Из соображений совместимости это свойство было заменено методом Node.getRootNode () .
zh_cn: <strong>重要说明</strong>：出于兼容性原因，此属性已由<a href="getrootnode"> <code>Node.getRootNode()</code> </a>方法代替。

source: <strong>Important</strong>: In modern browsers, this interface has been deprecated. Service worker messages will now use the <a href="messageevent"><code>MessageEvent</code></a> interface, for consistency with other web messaging features.
es: <strong>Importante</strong> : en los navegadores modernos, esta interfaz ha quedado en desuso. Los mensajes de los trabajadores de servicio ahora usar&aacute;n la interfaz <a href="messageevent"> <code>MessageEvent</code> </a> , para mantener la coherencia con otras funciones de mensajer&iacute;a web.
ko: <strong>중요</strong> : 최신 브라우저에서는이 인터페이스가 더 이상 사용되지 않습니다. 서비스 워커 메시지는 이제 다른 웹 메시징 기능과 일관성을 유지 하기 위해 <a href="messageevent"> <code>MessageEvent</code> </a> 인터페이스를 사용합니다 .
ru: <strong>Важно</strong> : в современных браузерах этот интерфейс устарел. Служащие сообщения теперь будут использовать интерфейс <a href="messageevent"> <code>MessageEvent</code> </a> для согласованности с другими функциями веб-сообщений.
zh_cn: <strong>重要说明</strong>：在现代浏览器中，不建议使用此界面。服务工作者消息现在将使用<a href="messageevent"> <code>MessageEvent</code> </a>接口，以与其他Web消息传递功能保持一致。

source: <strong>Important</strong>: In modern browsers, this property has been deprecated. Service worker messages will now use the <a href="../messageevent"><code>MessageEvent</code></a> interface, for consistency with other web messaging features.
es: <strong>Importante</strong> : en los navegadores modernos, esta propiedad ha quedado en desuso. Los mensajes de los trabajadores de servicio ahora usar&aacute;n la interfaz <a href="../messageevent"> <code>MessageEvent</code> </a> , para mantener la coherencia con otras funciones de mensajer&iacute;a web.
ko: <strong>중요 사항</strong> : 최신 브라우저에서는이 특성이 더 이상 사용되지 않습니다. 서비스 워커 메시지는 이제 다른 웹 메시징 기능과 일관성을 유지 하기 위해 <a href="../messageevent"> <code>MessageEvent</code> </a> 인터페이스를 사용합니다 .
ru: <strong>Важно</strong> : в современных браузерах это свойство устарело. Служащие сообщения теперь будут использовать интерфейс <a href="../messageevent"> <code>MessageEvent</code> </a> для согласованности с другими функциями веб-сообщений.
zh_cn: <strong>重要说明</strong>：在现代浏览器中，不建议使用此属性。服务工作者消息现在将使用<a href="../messageevent"> <code>MessageEvent</code> </a>接口，以与其他Web消息传递功能保持一致。

source: <strong>Important</strong>: It is highly recommended that applications use this matrix when rendering.
es: <strong>Importante</strong> : se recomienda encarecidamente que las aplicaciones utilicen esta matriz al renderizar.
ko: <strong>중요</strong> : 응용 프로그램은 렌더링시이 매트릭스를 사용하는 것이 좋습니다.
ru: <strong>Важно</strong> : Настоятельно рекомендуется, чтобы приложения использовали эту матрицу при рендеринге.
zh_cn: <strong>重要提示</strong>：强烈建议应用程序在渲染时使用此矩阵。

source: <strong>Important</strong>: It is highly recommended that applications use this matrix without modification. Failure to use this projection matrix when rendering may cause the presented frame to be distorted or badly aligned, resulting in varying degrees of user discomfort.
es: <strong>Importante</strong> : se recomienda encarecidamente que las aplicaciones utilicen esta matriz sin modificaciones. Si no se utiliza esta matriz de proyecci&oacute;n al renderizar, el cuadro presentado puede distorsionarse o estar mal alineado, lo que resulta en diversos grados de incomodidad para el usuario.
ko: <strong>중요</strong> : 응용 프로그램은 수정없이이 매트릭스를 사용하는 것이 좋습니다. 렌더링 할 때이 투영 행렬을 사용하지 않으면 제시된 프레임이 왜곡되거나 잘못 정렬되어 다양한 정도의 사용자 불편 함이 발생할 수 있습니다.
ru: <strong>Важно</strong> : Настоятельно рекомендуется, чтобы приложения использовали эту матрицу без изменений. Отказ от использования этой проекционной матрицы при рендеринге может привести к искажению или неправильному выравниванию представленного кадра, что приведет к различной степени дискомфорта пользователя.
zh_cn: <strong>重要提示</strong>：强烈建议应用程序使用此矩阵而不进行修改。渲染时未使用此投影矩阵可能会导致所呈现的帧变形或对齐不正确，从而导致用户不同程度的不适。

source: <strong>Important</strong>: The synchronous version of the IndexedDB API was originally intended for use only with <a href="https://developer.mozilla.org/en-US/docs/Web/Guide/Performance/Using_web_workers">Web Workers</a>, and was eventually removed from the spec because its need was questionable. It may however be reintroduced in the future if there is enough demand from web developers.
es: <strong>Importante</strong> : La versi&oacute;n s&iacute;ncrona de la API IndexedDB originalmente estaba dise&ntilde;ada para usarse solo con <a href="https://developer.mozilla.org/en-US/docs/Web/Guide/Performance/Using_web_workers">Web Workers</a> , y finalmente se elimin&oacute; de la especificaci&oacute;n porque su necesidad era cuestionable. Sin embargo, puede reintroducirse en el futuro si hay suficiente demanda de los desarrolladores web.
ko: <strong>중요 사항</strong> : IndexedDB API의 동기 버전은 원래 <a href="https://developer.mozilla.org/en-US/docs/Web/Guide/Performance/Using_web_workers">웹 워커 (Web Workers)</a> 와만 사용하도록 설계되었으며 , 그 필요성에 의문이 있었기 때문에 스펙에서 제거되었습니다. 그러나 웹 개발자의 요구가 충분하면 나중에 다시 도입 될 수 있습니다.
ru: <strong>Важное</strong> замечание: Синхронная версия API IndexedDB изначально предназначалась для использования только с <a href="https://developer.mozilla.org/en-US/docs/Web/Guide/Performance/Using_web_workers">веб-работниками</a> и в конечном итоге была удалена из спецификации, поскольку ее необходимость была сомнительной. Однако он может быть вновь введен в будущем, если будет достаточно спроса со стороны веб-разработчиков.
zh_cn: <strong>重要说明</strong>：IndexedDB API的同步版本最初仅用于<a href="https://developer.mozilla.org/en-US/docs/Web/Guide/Performance/Using_web_workers">Web Workers</a>，由于存在疑问，最终从规范中删除。但是，如果Web开发人员有足够的需求，将来可能会重新引入它。

source: <strong>Important</strong>: The version number is an <code>unsigned long long</code> number, which means that it can be a very big integer. It also means that you can't use a float, otherwise it will be converted to the closest lower integer and the transaction may not start, nor the <code>upgradeneeded</code> event trigger. So for example, don't use 2.4 as a version number:
es: <strong>Importante</strong> : El n&uacute;mero de versi&oacute;n es un n&uacute;mero <code>unsigned long long</code> , lo que significa que puede ser un n&uacute;mero entero muy grande. Tambi&eacute;n significa que no puede usar un flotante, de lo contrario, se convertir&aacute; al entero inferior m&aacute;s cercano y es posible que la transacci&oacute;n no se inicie ni que se <code>upgradeneeded</code> evento de actualizaci&oacute;n necesario . Entonces, por ejemplo, no use 2.4 como n&uacute;mero de versi&oacute;n:
ko: <strong>중요</strong> : 버전 번호는 <code>unsigned long long</code> 숫자이므로 매우 큰 정수일 수 있습니다. 또한 부동 소수점을 사용할 수 없다는 것을 의미합니다. 그렇지 않으면 가장 가까운 낮은 정수로 변환되어 트랜잭션이 시작되지 않거나 <code>upgradeneeded</code> 이벤트 트리거가 발생할 수 있습니다. 예를 들어 2.4를 버전 번호로 사용하지 마십시오.
ru: <strong>Важное замечание</strong> : Номер версии представляет собой <code>unsigned long long</code> число без знака , что означает, что оно может быть очень большим целым числом. Это также означает, что вы не можете использовать число с плавающей запятой, в противном случае оно будет преобразовано в ближайшее <code>upgradeneeded</code> целое число, и транзакция может не запуститься, а также не будет инициирован запрос на обновление updateeeeded . Так, например, не используйте 2.4 в качестве номера версии:
zh_cn: <strong>重要提示</strong>：版本号是一个 <code>unsigned long long</code> 整数，这意味着它可以是一个非常大的整数。这也意味着您不能使用浮点数，否则它将被转换为最接近的较低整数，并且事务可能无法启动，也不需要 <code>upgradeneeded</code> 事件触发。因此，例如，不要使用2.4作为版本号：

source: <strong>Important</strong>: These matrix functions are written for clarity of explanation, not for speed or memory management. These functions create a lot of new arrays, which can be particularly expensive for real time operations due to garbage collection. In real production code it would be best to use optimized functions. <a href="http://glmatrix.net/">glMatrix</a> is an example of a library that has a large focus on speed and performance. The focus in the glMatrix library is to have target arrays that are allocated before the update loop.
es: <strong>Importante</strong> : Estas funciones matriciales est&aacute;n escritas para mayor claridad de explicaci&oacute;n, no para velocidad o administraci&oacute;n de memoria. Estas funciones crean muchas nuevas matrices, que pueden ser particularmente costosas para operaciones en tiempo real debido a la recolecci&oacute;n de basura. En el c&oacute;digo de producci&oacute;n real, ser&iacute;a mejor usar funciones optimizadas. <a href="http://glmatrix.net/">glMatrix</a> es un ejemplo de una biblioteca que tiene un gran enfoque en la velocidad y el rendimiento. El enfoque en la biblioteca glMatrix es tener matrices de destino que se asignan antes del ciclo de actualizaci&oacute;n.
ko: <strong>중요</strong> :이 매트릭스 기능은 속도 나 메모리 관리가 아니라 설명을 명확하게하기 위해 작성되었습니다. 이러한 함수는 새로운 배열을 많이 만들어 가비지 수집으로 인해 실시간 작업에 특히 비쌀 수 있습니다. 실제 프로덕션 코드에서는 최적화 된 기능을 사용하는 것이 가장 좋습니다. <a href="http://glmatrix.net/">glMatrix</a> 는 속도와 성능에 중점을 둔 라이브러리의 예입니다. glMatrix 라이브러리의 초점은 업데이트 루프 전에 할당 된 대상 배열을 갖는 것입니다.
ru: <strong>Важно</strong> : Эти матричные функции написаны для ясности объяснения, а не для управления скоростью или памятью. Эти функции создают много новых массивов, которые могут быть особенно дорогими для операций в реальном времени из-за сборки мусора. В реальном производственном коде лучше всего использовать оптимизированные функции. <a href="http://glmatrix.net/">glMatrix</a> является примером библиотеки, которая уделяет большое внимание скорости и производительности. В библиотеке glMatrix основное внимание уделяется целевым массивам, которые выделяются перед циклом обновления.
zh_cn: <strong>重要说明</strong>：编写这些矩阵函数是为了便于说明，而不是为了提高速度或内存管理。这些函数创建了许多新的数组，由于进行垃圾回收，这些数组对于实时操作可能特别昂贵。在实际的生产代码中，最好使用优化的功能。<a href="http://glmatrix.net/">glMatrix</a>是一个库的示例，该库非常注重速度和性能。glMatrix库中的焦点是在更新循环之前分配目标数组。

source: <strong>Important</strong>: This example does not yet work. Research is currently being done on this method, and more useful information will be available soon.
es: <strong>Importante</strong> : este ejemplo a&uacute;n no funciona. Actualmente se est&aacute;n realizando investigaciones sobre este m&eacute;todo, y pronto habr&aacute; m&aacute;s informaci&oacute;n &uacute;til disponible.
ko: <strong>중요</strong> :이 예제는 아직 작동하지 않습니다. 현재이 방법에 대한 연구가 진행 중이며 더 유용한 정보가 곧 제공 될 예정입니다.
ru: <strong>Важно</strong> : этот пример еще не работает. В настоящее время проводятся исследования этого метода, и в ближайшее время будет доступна более полезная информация.
zh_cn: <strong>重要提示</strong>：此示例尚不可用。目前正在对该方法进行研究，不久将提供更多有用的信息。
