Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/dom/dom.*.011.xlf
Languages: ja, ko, ru, zh_cn

source: Adds the <code>scrollRestoration</code> attribute.
ja: <code>scrollRestoration</code> 属性を追加します。
ko: <code>scrollRestoration</code> 속성을 추가합니다 .
ru: Добавляет атрибут <code>scrollRestoration</code> .
zh_cn: 添加 <code>scrollRestoration</code> 属性。

source: Adds the constructor for the <code>DOMException</code> class.
ja: <code>DOMException</code> クラスのコンストラクターを追加します。
ko: <code>DOMException</code> 클래스 의 생성자를 추가합니다 .
ru: Добавляет конструктор для класса <code>DOMException</code> .
zh_cn: 添加 <code>DOMException</code> 类的构造函数。

source: Adds the constructor for the <code>DOMException</code> class. Adds the <code>NotReadableError</code>, <code>UnknownError</code>, <code>ConstraintError</code>, <code>DataError</code>, <code>TransactionInactiveError</code>, <code>ReadOnlyError</code>, <code>VersionError</code>, <code>OperationError</code>, and <code>NotAllowedError</code> values.
ja: <code>DOMException</code> クラスのコンストラクターを追加します。追加 <code>NotReadableError</code> 、 <code>UnknownError</code> 、 <code>ConstraintError</code> 、 <code>DataError</code> 、 <code>TransactionInactiveError</code> 、 <code>ReadOnlyError</code> 、 <code>VersionError</code> 、 <code>OperationError</code> 、および <code>NotAllowedError</code> の値を。
ko: <code>DOMException</code> 클래스 의 생성자를 추가합니다 . 추가 <code>NotReadableError</code> , <code>UnknownError</code> , <code>ConstraintError</code> , <code>DataError</code> , <code>TransactionInactiveError</code> , <code>ReadOnlyError</code> , <code>VersionError</code> , <code>OperationError</code> 및 <code>NotAllowedError</code> 의 값.
ru: Добавляет конструктор для класса <code>DOMException</code> . Добавляет значения <code>NotReadableError</code> , <code>UnknownError</code> , <code>ConstraintError</code> , <code>DataError</code> , <code>TransactionInactiveError</code> , <code>ReadOnlyError</code> , <code>VersionError</code> , <code>OperationError</code> и <code>NotAllowedError</code> .
zh_cn: 添加 <code>DOMException</code> 类的构造函数。添加 <code>NotReadableError</code> ， <code>UnknownError</code> ， <code>ConstraintError</code> ， <code>DataError</code> ， <code>TransactionInactiveError</code> ， <code>ReadOnlyError</code> ， <code>VersionError</code> ， <code>OperationError</code> 和 <code>NotAllowedError</code> 值。

source: Adds the following properties: <code>crossOrigin</code>, <code>referrerPolicy</code>, and <code>as</code>.
ja: 次のプロパティを追加します。 <code>crossOrigin</code> 、 <code>referrerPolicy</code> 、および <code>as</code> 。
ko: <code>crossOrigin</code> , <code>referrerPolicy</code> 및 <code>as</code> 특성을 추가합니다 .
ru: Добавляет следующие свойства: <code>crossOrigin</code> , <code>referrerPolicy</code> и <code>as</code> .
zh_cn: 添加以下属性： <code>crossOrigin</code> ， <code>referrerPolicy</code> ，和 <code>as</code> 。

source: Adds the given <em>token</em> to the list.
ja: 指定された<em>トークン</em>をリストに追加し<em>ます</em>。
ko: 주어진 <em>토큰</em> 을 목록에 추가합니다 .
ru: Добавляет данный <em>токен</em> в список.
zh_cn: 将给定<em>令牌</em>添加到列表中。

source: Adds the method <code>captureStream()</code>.
ja: メソッド <code>captureStream()</code> を追加します。
ko: <code>captureStream()</code> 메소드를 추가합니다 .
ru: Добавляет метод <code>captureStream()</code> .
zh_cn: 添加方法 <code>captureStream()</code> 。

source: Adds the script module at the given URL to the current worklet.
ja: 指定された URL のスクリプト モジュールを現在のワークレットに追加します。
ko: 지정된 URL의 스크립트 모듈을 현재 워크 릿에 추가합니다.
ru: Добавляет скриптовый модуль по заданному URL к текущему рабочему элементу.
zh_cn: 将给定URL中的脚本模块添加到当前的工作单元中。

source: Adds the specified childNode argument as the last child to the current node.
ja: 指定した childNode 引数を、現在のノードの最後の子として追加します。
ko: 지정된 childNode 인수를 마지막 자식으로 현재 노드에 추가합니다.
ru: Добавляет указанный аргумент childNode в качестве последнего дочернего аргумента к текущему узлу.
zh_cn: 将指定的childNode参数作为当前节点的最后一个子节点。

source: Adds the specified class values. If these classes already exist in the element's <code>class</code> attribute they are ignored.
ja: 指定されたクラス値を追加します。これらのクラスが要素の <code>class</code> 属性にすでに存在する場合、それらは無視されます。
ko: 지정된 클래스 값을 추가합니다. 이러한 클래스가 요소의 <code>class</code> 속성 에 이미 존재하면 무시됩니다.
ru: Добавляет указанные значения класса. Если эти классы уже существуют в атрибуте <code>class</code> элемента, они игнорируются.
zh_cn: 添加指定的类值。如果这些类已经存在于元素的 <code>class</code> 属性中，则将其忽略。

source: Adds two obsolete properties, <code>name</code> and <code>align</code>, to help with compatibility with old Web sites.
ja: 古いWebサイトとの互換性を維持するために、2つの廃止されたプロパティ <code>name</code> と <code>align</code> を追加します。
ko: 오래된 웹 사이트와의 호환성을 위해 <code>name</code> 및 <code>align</code> 이라는 두 가지 더 이상 사용되지 않는 속성을 추가합니다 .
ru: Добавляет два устаревших свойства, <code>name</code> и <code>align</code> , чтобы помочь с совместимостью со старыми веб-сайтами.
zh_cn: 添加两个过时的属性 <code>name</code> 和 <code>align</code> ，以帮助与旧网站兼容。

source: Adds: <code>gl.DRAW_FRAMEBUFFER</code> and <code>gl.READ_FRAMEBUFFER</code>
ja: 追加： <code>gl.DRAW_FRAMEBUFFER</code> および <code>gl.READ_FRAMEBUFFER</code>
ko: 추가 : <code>gl.DRAW_FRAMEBUFFER</code> 및 <code>gl.READ_FRAMEBUFFER</code>
ru: Добавляет: <code>gl.DRAW_FRAMEBUFFER</code> и <code>gl.READ_FRAMEBUFFER</code>
zh_cn: 添加： <code>gl.DRAW_FRAMEBUFFER</code> 和 <code>gl.READ_FRAMEBUFFER</code>

source: Adds: <code>gl.TEXTURE_3D</code> and <code>gl.TEXTURE_2D_ARRAY</code>
ja: 追加： <code>gl.TEXTURE_3D</code> および <code>gl.TEXTURE_2D_ARRAY</code>
ko: 추가 : <code>gl.TEXTURE_3D</code> 및 <code>gl.TEXTURE_2D_ARRAY</code>
ru: Добавляет: <code>gl.TEXTURE_3D</code> и <code>gl.TEXTURE_2D_ARRAY</code>
zh_cn: 添加： <code>gl.TEXTURE_3D</code> 和 <code>gl.TEXTURE_2D_ARRAY</code>

source: Adjusting layout based on the orientation
ja: 向きに応じてレイアウトを調整する
ko: 방향에 따라 레이아웃 조정
ru: Настройка макета в зависимости от ориентации
zh_cn: 根据方向调整布局

source: Adjusts the clock for this SVG document fragment, establishing a new current time. If <code>setCurrentTime</code> is called before the document timeline has begun (for example, by script running in a <a href="https://developer.mozilla.org/en-US/docs/Web/SVG/Element/script"><code>&lt;script&gt;</code></a> element before the document's SVGLoad event is dispatched), then the value of seconds in the last invocation of the method gives the time that the document will seek to once the document timeline has begun.
ja: このSVGドキュメントフラグメントのクロックを調整して、新しい現在時刻を確立します。ドキュメントのタイムラインが始まる前に <code>setCurrentTime</code> が呼び出された場合（たとえば、ドキュメントのSVGLoadイベントが送出される前に<a href="https://developer.mozilla.org/en-US/docs/Web/SVG/Element/script"> <code>&lt;script&gt;</code> </a>要素で実行されているスクリプトによって）、メソッドの最後の呼び出しの秒の値は、ドキュメントの時間を示しますドキュメントのタイムラインが始まったら、
ko: 이 SVG 문서 조각에 대한 시계를 조정하여 새로운 현재 시간을 설정합니다. 문서 타임 라인이 시작되기 전에 <code>setCurrentTime</code> 이 호출 되면 (예 : 문서의 SVGLoad 이벤트가 전달되기 전에 <a href="https://developer.mozilla.org/en-US/docs/Web/SVG/Element/script"> <code>&lt;script&gt;</code> </a> 요소 에서 실행되는 스크립트에 의해 ), 메소드의 마지막 호출에서 초 값은 문서에 시간을 제공합니다. 문서 타임 라인이 시작되면 검색합니다.
ru: Настраивает часы для этого фрагмента документа SVG, устанавливая новое текущее время. Если <code>setCurrentTime</code> вызывается до начала временной шкалы документа (например, с помощью скрипта, выполняемого в элементе <a href="https://developer.mozilla.org/en-US/docs/Web/SVG/Element/script"> <code>&lt;script&gt;</code> </a> до отправки события SVGLoad документа), то значение секунд в последнем вызове метода дает время, в течение которого документ будет стремиться к тому, чтобы сроки документа начались.
zh_cn: 调整此SVG文档片段的时钟，建立新的当前时间。如果 <code>setCurrentTime</code> 在文档时间线开始之前被调用（例如，通过分派文档的SVGLoad事件之前在<a href="https://developer.mozilla.org/en-US/docs/Web/SVG/Element/script"> <code>&lt;script&gt;</code> </a>元素中运行的脚本），则最后一次调用该方法的秒数将给出文档的时间一旦文档时间表开始，它将寻求。

source: Adobe Illustrator to Canvas plug-in
ja: Adobe IllustratorからCanvasへのプラグイン
ko: Adobe Illustrator to Canvas 플러그인
ru: Adobe Illustrator к плагину холста
zh_cn: Adobe Illustrator to Canvas插件

source: Adopt node from an external document.
ja: 外部ドキュメントからノードを採用します。
ko: 외부 문서에서 노드를 채택하십시오.
ru: Принять узел из внешнего документа.
zh_cn: 从外部文档中采用节点。

source: Advanced API for rendering complex graphics, including 3D.
ja: 3Dを含む複雑なグラフィックスをレンダリングするための高度なAPI。
ko: 3D를 포함한 복잡한 그래픽 렌더링을위한 고급 API.
ru: Усовершенствованный API для рендеринга сложной графики,включая 3D.
zh_cn: 用于渲染复杂图形的高级API,包括3D。

source: Advanced animations
ja: 高度なアニメーション
ko: 고급 애니메이션
ru: Передовая анимация
zh_cn: 高级动画

source: Advanced concepts and examples
ja: 先進的な概念と例
ko: 고급 개념 및 예
ru: Передовые концепции и примеры
zh_cn: 高级概念和实例

source: Advanced constraints
ja: 高度な制約
ko: 고급 제약
ru: Расширенные ограничения
zh_cn: 高级制约因素

source: Advanced media stream recorder sample
ja: 先進的なメディアストリームレコーダーのサンプル
ko: 고급 미디어 스트림 레코더 샘플
ru: Расширенный образец потокового медиа-рекордера
zh_cn: 高级媒体流记录器样本

source: Advanced techniques: creating sound, sequencing, timing, scheduling
ja: 上級テクニック:音作り、シーケンス、タイミング、スケジューリング
ko: 고급 기술 : 사운드 생성, 시퀀싱, 타이밍, 스케줄링
ru: Передовые методы:создание звука,последовательность,сроки,планирование
zh_cn: 高级技术:创造声音、排序、计时、调度

source: Advanced text measurements
ja: 高度なテキスト測定
ko: 고급 텍스트 측정
ru: Расширенные текстовые измерения
zh_cn: 高级文本测量

source: Advanced text metrics properties
ja: 高度なテキスト・メトリクス・プロパティ
ko: 고급 텍스트 메트릭 속성
ru: Расширенные текстовые метрики свойства
zh_cn: 高级文本指标属性

source: Advanced tutorials
ja: 高度なチュートリアル
ko: 고급 튜토리얼
ru: Расширенные обучающие программы
zh_cn: 高级教程

source: Advances the cursor to the next position along its direction, to the item whose key matches the optional <code>key</code> parameter.
ja: カーソルをその方向に沿って次の位置、オプションの <code>key</code> パラメータと一致するキーを持つアイテムに進めます。
ko: 커서가 방향을 따라 다음 위치로 이동하고 키가 선택적 <code>key</code> 매개 변수 와 일치하는 항목으로 이동합니다 .
ru: Перемещает курсор на следующую позицию вдоль его направления, к элементу, клавиша которого соответствует необязательному параметру <code>key</code> .
zh_cn: 将光标沿其方向前进到下一个位置，键的项与可选的 <code>key</code> 参数匹配的项。

source: Advances the cursor to the next position along its direction, to the item whose key matches the optional <code>key</code> parameter. If no key is specified, advance to the immediate next position. Returns false if the cursor has reached the end of its range; otherwise returns true.
ja: カーソルをその方向に沿って次の位置、オプションの <code>key</code> パラメータと一致するキーを持つアイテムに進めます。キーが指定されていない場合は、すぐ次の位置に進みます。カーソルがその範囲の終わりに達した場合はfalseを返します。それ以外の場合はtrueを返します。
ko: 커서가 방향을 따라 다음 위치로 이동하고 키가 선택적 <code>key</code> 매개 변수 와 일치하는 항목으로 이동합니다 . 키를 지정하지 않으면 바로 다음 위치로 이동합니다. 커서가 범위의 끝에 도달하면 false를 리턴합니다. 그렇지 않으면 true를 반환합니다.
ru: Перемещает курсор на следующую позицию вдоль его направления, к элементу, клавиша которого соответствует необязательному параметру <code>key</code> . Если ключ не указан, перейдите к следующей позиции. Возвращает false, если курсор достиг конца своего диапазона; в противном случае возвращает истину.
zh_cn: 将光标沿其方向前进到下一个位置，键的项与可选的 <code>key</code> 参数匹配的项。如果未指定键，请前进到下一个位置。如果光标已到达其范围的末尾，则返回false；否则返回true。

source: Advantages of using the Payment Request API with "basic-card" (card-based payments):
ja: ベーシックカード」(カード決済)で決済リクエストAPIを利用するメリット
ko: "기본 카드"(카드 기반 결제)와 함께 결제 요청 API를 사용할 경우의 이점 :
ru: Преимущества использования API запроса на платеж с "базовой картой" (платежи по карте):
zh_cn: 使用 "基本卡"(基于卡的支付)的支付请求API的优势。

source: Affects how the index behaves when the result of evaluating the index's key path yields an array. If <code>true</code>, there is one record in the index for each item in an array of keys. If <code>false</code>, then there is one record for each key that is an array.
ja: インデックスのキーパスを評価した結果、配列が生成されるときのインデックスの動作に影響します。 <code>true</code> の場合、キーの配列の各項目のインデックスに1つのレコードがあります。 <code>false</code> の場合、配列であるキーごとに1つのレコードがあります。
ko: 인덱스의 키 경로를 평가 한 결과 배열이 생성 될 때 인덱스의 작동 방식에 영향을줍니다. 경우 <code>true</code> , 키의 배열의 각 항목에 대한 색인 한 기록이있다. <code>false</code> 인 경우 배열 인 각 키에 대해 하나의 레코드가 있습니다.
ru: Влияет на поведение индекса, когда в результате оценки пути ключа индекса получается массив. Если <code>true</code> , в индексе есть одна запись для каждого элемента в массиве ключей. Если <code>false</code> , то для каждого ключа, являющегося массивом, существует одна запись.
zh_cn: 当评估索引键路径的结果产生一个数组时，影响索引的行为。如果为 <code>true</code> ，则索引中的一个键数组中的每个项目都有一条记录。如果为 <code>false</code> ，则每个键都是一个数组的记录。

source: After a few failed attempts to get your attention, they send you an email, and your email app produces a push notification that successfully alerts you, even though your mail web app is not open.
ja: あなたの注意を引くためにいくつかの失敗した後、彼らはあなたにメールを送信し、あなたのメールアプリは、あなたのメールウェブアプリが開いていないにもかかわらず、成功してあなたに警告するプッシュ通知を生成します。
ko: 주의를 기울이지 않은 몇 번의 시도가 실패하면 이메일을 보내며, 메일 웹 앱이 열려 있지 않더라도 이메일 앱은 성공적으로 경고하는 푸시 알림을 생성합니다.
ru: После нескольких неудачных попыток привлечь ваше внимание,они отправляют вам письмо,и ваше почтовое приложение выдает push-уведомление,которое успешно предупреждает вас,даже если ваше почтовое веб-приложение не открыто.
zh_cn: 在几次尝试失败后,他们会给你发送一封邮件,你的电子邮件应用程序会产生一个推送通知,成功地提醒你,即使你的邮件Web应用程序没有打开。

source: After a successful handshake, client can send messages to the server, but now these are encoded.
ja: ハンドシェイクが成功すると、クライアントはサーバにメッセージを送信することができますが、現在はエンコードされています。
ko: 성공적인 핸드 셰이크 후 클라이언트는 서버로 메시지를 보낼 수 있지만 이제는 인코딩됩니다.
ru: После успешного рукопожатия клиент может отправлять сообщения на сервер,но теперь они закодированы.
zh_cn: 握手成功后,客户端可以向服务器发送消息,但现在这些消息是经过编码的。

source: After a successful handshake, the client will send encoded messages to the server.
ja: ハンドシェイクが成功すると、クライアントはエンコードされたメッセージをサーバに送信します。
ko: 성공적인 핸드 셰이크 후 클라이언트는 인코딩 된 메시지를 서버로 보냅니다.
ru: После успешного рукопожатия клиент отправит закодированные сообщения на сервер.
zh_cn: 握手成功后,客户端将向服务器发送编码信息。

source: After a successful installation, the service worker activates. This doesn&rsquo;t have much of a distinct use the first time your service worker is installed/activated, but it means more when the service worker is updated (see the <a href="#Updating_your_service_worker">Updating your service worker</a> section later on.)
ja: インストールが正常に完了すると、Service Workerがアクティブになります。これは、Service Workerを最初にインストール/アクティブ化するときに明確に使用することはあまりありませんが、Service Workerが更新されたときにさらに意味があり<a href="#Updating_your_service_worker">ます（Service Worker</a>の更新セクションを参照してください）。
ko: 설치가 완료되면 서비스 워커가 활성화됩니다. 처음에는 서비스 워커를 설치 / 활성화 할 때 별다른 용도가 없지만 서비스 워커가 업데이트 될 때 더 많은 것을 의미 <a href="#Updating_your_service_worker">합니다</a> (나중에 서비스 워커 업데이트 섹션 참조 ).
ru: После успешной установки сервисный работник активируется. Это не имеет особого смысла при первой установке / активации вашего сервисного работника, но это означает больше, когда обновляется сервисный работник (см. Раздел &laquo; <a href="#Updating_your_service_worker">Обновление вашего сервисного работника</a> &raquo; позже).
zh_cn: 成功安装后，服务人员将激活。第一次安装/激活Service Worker时，这并没有什么独特的用途，但是在<a href="#Updating_your_service_worker">更新Service Worker</a>时，它的作用就更大了（请参阅稍后的&ldquo; 更新Service Worker&rdquo;部分。）

source: After a user has registered with WebAuthn, they can subsequently authenticate (a.k.a. - login or sign-in) with the service. The authentication flow looks similar to the registration flow, and the illustration of actions in Figure 2 may be recognizable as being similar to the illustration of registration actions in Figure 1. The primary differences between registration and authentication are that: 1) authentication doesn't require user or relying party information; and 2) authentication creates an assertion using the previously generated key pair for the service rather than creating an attestation with the key pair that was burned into the authenticator during manufacturing. Again, the description of authentication below is a broad overview rather than getting into all the options and features of WebAuthn. The specific options for authenticating can be found in the <a href="publickeycredentialrequestoptions"><code>PublicKeyCredentialRequestOptions</code></a> dictionary, and the resulting data can be found in the <a href="publickeycredential"><code>PublicKeyCredential</code></a> interface (where <a href="https://developer.mozilla.org/en-US/docs/Web/API/PublicKeyCredential/response"><code>PublicKeyCredential.response</code></a> is the <a href="authenticatorassertionresponse"><code>AuthenticatorAssertionResponse</code></a> interface) .
ja: ユーザーはWebAuthnに登録した後、サービスで認証（別名：ログインまたはサインイン）できます。認証フローは登録フローに似ています。図2のアクションの図は、図1の登録アクションの図と同様に認識できる場合があります。登録と認証の主な違いは次のとおりです。1）認証はユーザーまたは証明書利用者の情報が必要です。 2）認証は、製造時に認証システムに焼き付けられたキーペアで証明書を作成するのではなく、サービスに対して以前に生成されたキーペアを使用してアサーションを作成します。繰り返しになりますが、以下の認証の説明は、WebAuthnのすべてのオプションと機能を理解するのではなく、大まかな概要です。認証のための特定のオプションは、<a href="publickeycredentialrequestoptions"> <code>PublicKeyCredentialRequestOptions</code> </a>ディクショナリ、および結果のデータは、<a href="publickeycredential"> <code>PublicKeyCredential</code> </a>インターフェース（<a href="https://developer.mozilla.org/en-US/docs/Web/API/PublicKeyCredential/response"> <code>PublicKeyCredential.response</code> </a>は<a href="authenticatorassertionresponse"> <code>AuthenticatorAssertionResponse</code> </a>インターフェースです）にあります。
ko: 사용자가 WebAuthn에 등록한 후 서비스로 인증 (일명 로그인 또는 로그인) 할 수 있습니다. 인증 흐름은 등록 흐름과 비슷해 보이며 그림 2의 작업 그림은 그림 1의 등록 작업 그림과 유사한 것으로 인식 될 수 있습니다. 등록과 인증의 주요 차이점은 다음과 같습니다. 1) 인증은 그렇지 않습니다. 사용자 또는 신뢰 당사자 정보가 필요합니다. 그리고 2) 인증은 제조 과정에서 인증 자에게 타 버린 키 페어에 대한 증명을 생성하지 않고 서비스에 대해 이전에 생성 된 키 페어를 사용하여 어설 션을 생성합니다. 아래의 인증에 대한 설명은 WebAuthn의 모든 옵션과 기능에 들어가기보다는 광범위한 개요입니다.인증을위한 특정 옵션은<a href="publickeycredentialrequestoptions"> <code>PublicKeyCredentialRequestOptions</code> </a> 사전 및 결과 데이터는<a href="publickeycredential"> <code>PublicKeyCredential</code> </a> 인터페이스 (<a href="https://developer.mozilla.org/en-US/docs/Web/API/PublicKeyCredential/response"> <code>PublicKeyCredential.response</code> </a> 는<a href="authenticatorassertionresponse"> <code>AuthenticatorAssertionResponse</code> </a> 인터페이스 임)에서 찾을 수 있습니다.
ru: После того, как пользователь зарегистрировался в WebAuthn, он может впоследствии аутентифицироваться (он же - логин или вход) с помощью сервиса. Поток аутентификации выглядит аналогично потоку регистрации, и иллюстрация действий на рисунке 2 может быть распознана как аналогичная иллюстрации действий регистрации на рисунке 1. Основные различия между регистрацией и аутентификацией заключаются в том, что: 1) аутентификация не запрашивать информацию о пользователе или доверяющей стороне; и 2) аутентификация создает утверждение, используя ранее сгенерированную пару ключей для службы, а не создает аттестацию с парой ключей, которая была записана в аутентификатор во время производства. Опять же, описание аутентификации, приведенное ниже, является широким обзором, а не углубляется во все параметры и функции WebAuthn.Конкретные параметры для аутентификации можно найти в<a href="publickeycredentialrequestoptions"> <code>PublicKeyCredentialRequestOptions</code> </a>Словарь PublicKeyCredentialRequestOptions , а полученные данные можно найти винтерфейсе<a href="publickeycredential"> <code>PublicKeyCredential</code> </a> (где<a href="https://developer.mozilla.org/en-US/docs/Web/API/PublicKeyCredential/response"> <code>PublicKeyCredential.response</code> </a> - этоинтерфейс<a href="authenticatorassertionresponse"> <code>AuthenticatorAssertionResponse</code> </a> ).
zh_cn: 用户在WebAuthn中注册后，他们随后可以使用该服务进行身份验证（又名-登录或登录）。身份验证流程看起来类似于注册流程，并且可以将图2中的动作说明识别为类似于图1中的注册动作的说明。注册和身份验证之间的主要区别在于：1）身份验证不要求用户或信赖方信息； 2）身份验证使用先前生成的服务密钥对创建一个断言，而不是使用在制造过程中被烧入身份验证器中的密钥对创建证明。同样，下面对身份验证的描述是一个广泛的概述，而不是进入WebAuthn的所有选项和功能。身份验证的特定选项可以在<a href="publickeycredentialrequestoptions"> <code>PublicKeyCredentialRequestOptions</code> </a>字典，并且可以在<a href="publickeycredential"> <code>PublicKeyCredential</code> </a>接口（其中<a href="https://developer.mozilla.org/en-US/docs/Web/API/PublicKeyCredential/response"> <code>PublicKeyCredential.response</code> </a>是<a href="authenticatorassertionresponse"> <code>AuthenticatorAssertionResponse</code> </a>接口）中找到结果数据。

source: API: adapter.js
ru: API:адаптер.js
