Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/dom/dom.*.007.xlf
Languages: es, ko, ru, zh_cn

source: <em><em>The <code>PositionError</code> interface <em>neither implements nor inherits any method.</em></em></em>
es: <em><em>La interfaz <code>PositionError</code> <em>no implementa ni hereda ning&uacute;n m&eacute;todo.</em></em></em>
ko: <em><em> <code>PositionError</code> 의 인터페이스 <em>를 구현하거나 상속 어떤 방법도.</em></em></em>
ru: <em><em> <code>PositionError</code> интерфейс <em>ни орудие , ни наследует любой метод.</em></em></em>
zh_cn: <em><em>所述 <code>PositionError</code> 界面<em>既不工具也不继承的任何方法。</em></em></em>

source: <em><em>The <code>TextDecoder</code> interface doesn't inherit any </em>method</em>.
es: <em><em>La interfaz <code>TextDecoder</code> no hereda ning&uacute;n</em> m&eacute;todo</em> .
ko: <em><em> <code>TextDecoder</code> 의 인터페이스는 상속하지 않는</em> 방법</em> .
ru: <em><em>Интерфейс <code>TextDecoder</code> не наследует никакой</em> метод</em> .
zh_cn: <em><em>该 <code>TextDecoder</code> 接口不继承任何</em>方法</em>。

source: <em><em>The <code>TextEncoder</code> interface doesn't inherit any </em>method</em>.
es: <em><em>La interfaz <code>TextEncoder</code> no hereda ning&uacute;n</em> m&eacute;todo</em> .
ko: <em><em> <code>TextEncoder</code> 의 인터페이스는 상속하지 않는</em> 방법</em> .
ru: <em><em>Интерфейс <code>TextEncoder</code> не наследует никакой</em> метод</em> .
zh_cn: <em><em>该 <code>TextEncoder</code> 接口不继承任何</em>方法</em>。

source: <em><strong>If you can see this, scrollTop = 0</strong></em>
es: <em><strong>Si puede ver esto, scrollTop = 0</strong></em>
ko: <em><strong>이것을 볼 수 있으면 scrollTop = 0</strong></em>
ru: <em><strong>Если вы видите это, scrollTop = 0</strong></em>
zh_cn: <em><strong>如果可以看到此内容，则scrollTop = 0</strong></em>

source: <em><strong>Note: </strong>This parameter is required in some browsers like Chrome and Edge.</em>
es: <em><strong>Nota:</strong> este par&aacute;metro es obligatorio en algunos navegadores como Chrome y Edge.</em>
ko: <em><strong>참고 :</strong> 이 매개 변수는 Chrome 및 Edge와 같은 일부 브라우저에서 필요합니다.</em>
ru: <em><strong>Примечание.</strong> Этот параметр требуется в некоторых браузерах, таких как Chrome и Edge.</em>
zh_cn: <em><strong>注意：</strong>在某些浏览器（例如Chrome和Edge）中，此参数是必需的。</em>

source: <em><strong>more details and links to relevant guides and tutorials needed</strong></em>
es: <em><strong>Se necesitan m&aacute;s detalles y enlaces a gu&iacute;as y tutoriales relevantes</strong></em>
ko: <em><strong>더 자세한 정보 및 필요한 관련 가이드 및 자습서에 대한 링크</strong></em>
ru: <em><strong>необходимо больше деталей и ссылок на соответствующие руководства и учебники</strong></em>
zh_cn: <em><strong>更多详细信息以及所需的相关指南和教程的链接</strong></em>

source: <em><var>currentWritingDirection</var></em> is a string variable representing the text writing direction of the current element.
es: <em> <var>currentWritingDirection</var> </em> es una variable de cadena que representa la direcci&oacute;n de escritura del texto del elemento actual.
ko: <em> <var>currentWritingDirection</var> </em> 은 현재 요소의 텍스트 쓰기 방향을 나타내는 문자열 변수입니다.
ru: <em> <var>currentWritingDirection</var> </em> - строковая переменная, представляющая направление записи текста текущего элемента.
zh_cn: <em> <var>currentWritingDirection</var> </em>是一个字符串变量，表示当前元素的文本写入方向。

source: <em><var>elementClasses</var></em> is a <a href="../domtokenlist"><code>DOMTokenList</code></a> representing the class attribute of <var>elementNodeReference</var>. If the class attribute was not set or is empty <em>elementClasses.length</em> returns <code>0</code>. <code>element.classList</code> itself is read-only, although you can modify it using the <code>add()</code> and <code>remove()</code> methods.
es: <em> <var>elementClasses</var> </em> es una<a href="../domtokenlist"> <code>DOMTokenList</code> que</a> representa el atributo de clase de <var>elementNodeReference</var> . Si el atributo de clase no se estableci&oacute; o est&aacute; vac&iacute;o<em> elementClasses.length</em> devuelve <code>0</code> . <code>element.classList</code> en s&iacute; mismo es de solo lectura, aunque puede modificarlo utilizando losm&eacute;todos <code>add()</code> y <code>remove()</code> .
ko: <em> <var>elementClasses</var> </em> 는 <var>elementNodeReference</var> 의 클래스 속성을 나타내는<a href="../domtokenlist"> <code>DOMTokenList</code> </a> 입니다. 클래스 속성이 설정되지 않았거나 비어있는 경우<em> elementClasses.length</em> 는 <code>0</code> 을 반환합니다. <code>add()</code> 및 <code>remove()</code> 메소드를사용하여 수정할 수 있지만 <code>element.classList</code> 자체는 읽기 전용입니다.<em></em>
ru: <em> <var>elementClasses</var> </em> - это<a href="../domtokenlist"> <code>DOMTokenList</code> ,</a> представляющий атрибут класса <var>elementNodeReference</var> . Если атрибут класса не был установлен или является пустым,<em> elementClasses.length</em> возвращает <code>0</code> . <code>element.classList</code> только для чтения, хотя вы можете изменить его, используяметоды <code>add()</code> и <code>remove()</code> .
zh_cn: <em> <var>elementClasses</var> </em>是一个<a href="../domtokenlist"> <code>DOMTokenList</code> ,</a>表示 <var>elementNodeReference</var> 的类属性。如果未设置class属性或为空，则<em> elementClasses.length</em>返回 <code>0</code> 。 <code>element.classList</code> 本身是只读的，尽管您可以使用 <code>add()</code> 和 <code>remove()</code> 方法对其进行修改。

source: <em><var>index</var></em> is an integer
es: <em> <var>index</var> </em> es un entero
ko: <em> <var>index</var> </em> 는 정수
ru: <em> <var>index</var> </em> является целым числом
zh_cn: <em> <var>index</var> </em>是整数

source: <em><var>newWritingDirection</var></em> is a string variable representing the text writing direction value.
es: <em> <var>newWritingDirection</var> </em> es una variable de cadena que representa el valor de la direcci&oacute;n de escritura del texto.
ko: <em> <var>newWritingDirection</var> </em> 은 텍스트 쓰기 방향 값을 나타내는 문자열 변수입니다.
ru: <em> <var>newWritingDirection</var> </em> - строковая переменная, представляющая значение направления записи текста.
zh_cn: <em> <var>newWritingDirection</var> </em>是一个字符串变量，表示文本书写方向值。

source: <em>A <a href="rtcidentityerrorevent"><code>RTCIdentityErrorEvent</code></a> being an <a href="event"><code>Event</code></a>, this event also implements these properties</em>.
es: <em>Un <a href="rtcidentityerrorevent"> <code>RTCIdentityErrorEvent</code> </a> es un <a href="event"> <code>Event</code> </a> , este evento tambi&eacute;n implementa estas propiedades</em> .
ko: <em><a href="rtcidentityerrorevent"> <code>RTCIdentityErrorEvent</code> </a> 되는 <a href="event"> <code>Event</code> </a> ,이 이벤트는 이러한 속성을 구현합니다</em> .
ru: <em>Если <a href="rtcidentityerrorevent"> <code>RTCIdentityErrorEvent</code> </a> является <a href="event"> <code>Event</code> </a> , это событие также реализует эти свойства</em> .
zh_cn: <em>一个<a href="rtcidentityerrorevent"> <code>RTCIdentityErrorEvent</code> </a>作为一个<a href="event"> <code>Event</code> </a>，这个事件也实现了这些特性</em>。

source: <em>A <a href="rtcidentityerrorevent"><code>RTCIdentityErrorEvent</code></a> being an <a href="event"><code>Event</code></a>, this event also implements these properties</em>. <em>There is no specific <em><a href="rtcidentityerrorevent"><code>RTCIdentityErrorEvent</code></a></em> method.</em>
es: <em>Un <a href="rtcidentityerrorevent"> <code>RTCIdentityErrorEvent</code> </a> es un <a href="event"> <code>Event</code> </a> , este evento tambi&eacute;n implementa estas propiedades</em> . <em>No hay un m&eacute;todo <em><a href="rtcidentityerrorevent"> <code>RTCIdentityErrorEvent</code> </a></em> espec&iacute;fico .</em>
ko: <em><a href="rtcidentityerrorevent"> <code>RTCIdentityErrorEvent</code> </a> 되는 <a href="event"> <code>Event</code> </a> ,이 이벤트는 이러한 속성을 구현합니다</em> . <em>특정 <em><a href="rtcidentityerrorevent"> <code>RTCIdentityErrorEvent</code> </a></em> 메소드 가 없습니다 .</em>
ru: <em>Если <a href="rtcidentityerrorevent"> <code>RTCIdentityErrorEvent</code> </a> является <a href="event"> <code>Event</code> </a> , это событие также реализует эти свойства</em> . <em><em><a href="rtcidentityerrorevent"> <code>RTCIdentityErrorEvent</code> </a></em></em><em> метода </em><em><em>RTCIdentityErrorEvent</em></em><em> не <em>существует</em> .</em>
zh_cn: <em>一个<a href="rtcidentityerrorevent"> <code>RTCIdentityErrorEvent</code> </a>作为一个<a href="event"> <code>Event</code> </a>，这个事件也实现了这些特性</em>。<em>没有特定的<em><a href="rtcidentityerrorevent"> <code>RTCIdentityErrorEvent</code> </a></em>方法。</em>

source: <em>A <a href="rtcidentityevent"><code>RTCIdentityEvent</code></a> being an <a href="event"><code>Event</code></a>, this event also implements these properties</em>.
es: <em>Un <a href="rtcidentityevent"> <code>RTCIdentityEvent</code> </a> es un <a href="event"> <code>Event</code> </a> , este evento tambi&eacute;n implementa estas propiedades</em> .
ko: <em><a href="rtcidentityevent"> <code>RTCIdentityEvent</code> </a> 되는 <a href="event"> <code>Event</code> </a> ,이 이벤트는 이러한 속성을 구현합니다</em> .
ru: <em>Если <a href="rtcidentityevent"> <code>RTCIdentityEvent</code> </a> является <a href="event"> <code>Event</code> </a> , это событие также реализует эти свойства</em> .
zh_cn: <em>一个<a href="rtcidentityevent"> <code>RTCIdentityEvent</code> </a>作为一个<a href="event"> <code>Event</code> </a>，这个事件也实现了这些特性</em>。

source: <em>A <a href="rtcidentityevent"><code>RTCIdentityEvent</code></a> being an <a href="event"><code>Event</code></a>, this event also implements these properties</em>. <em>There is no specific <em><a href="rtcidentityevent"><code>RTCIdentityEvent</code></a></em> method.</em>
es: <em>Un <a href="rtcidentityevent"> <code>RTCIdentityEvent</code> </a> es un <a href="event"> <code>Event</code> </a> , este evento tambi&eacute;n implementa estas propiedades</em> . <em>No hay un m&eacute;todo espec&iacute;fico <em><a href="rtcidentityevent"> <code>RTCIdentityEvent</code> </a></em> .</em>
ko: <em><a href="rtcidentityevent"> <code>RTCIdentityEvent</code> </a> 되는 <a href="event"> <code>Event</code> </a> ,이 이벤트는 이러한 속성을 구현합니다</em> . <em>특정 <em><a href="rtcidentityevent"> <code>RTCIdentityEvent</code> </a></em> 메소드 가 없습니다 .</em>
ru: <em>Если <a href="rtcidentityevent"> <code>RTCIdentityEvent</code> </a> является <a href="event"> <code>Event</code> </a> , это событие также реализует эти свойства</em> . <em><em><a href="rtcidentityevent"> <code>RTCIdentityEvent</code> </a></em></em><em> метода </em><em><em>RTCIdentityEvent</em></em><em> не <em>существует</em> .</em>
zh_cn: <em>一个<a href="rtcidentityevent"> <code>RTCIdentityEvent</code> </a>作为一个<a href="event"> <code>Event</code> </a>，这个事件也实现了这些特性</em>。<em>没有特定的<em><a href="rtcidentityevent"> <code>RTCIdentityEvent</code> </a></em>方法。</em>

source: <em>A <a href="rtcpeerconnectioniceevent"><code>RTCPeerConnectionIceEvent</code></a> being an <a href="event"><code>Event</code></a>, this event also implements these properties</em>.
es: <em>Un <a href="rtcpeerconnectioniceevent"> <code>RTCPeerConnectionIceEvent</code> </a> es un <a href="event"> <code>Event</code> </a> , este evento tambi&eacute;n implementa estas propiedades</em> .
ko: <em><a href="rtcpeerconnectioniceevent"> <code>RTCPeerConnectionIceEvent</code> </a> 되는 <a href="event"> <code>Event</code> </a> ,이 이벤트는 이러한 속성을 구현합니다</em> .
ru: <em><a href="rtcpeerconnectioniceevent"> <code>RTCPeerConnectionIceEvent</code> </a> будучи <a href="event"> <code>Event</code> </a> , это событие также реализует эти свойства</em> .
zh_cn: <em>一个<a href="rtcpeerconnectioniceevent"> <code>RTCPeerConnectionIceEvent</code> </a>作为一个<a href="event"> <code>Event</code> </a>，这个事件也实现了这些特性</em>。

source: <em>A <a href="rtcpeerconnectioniceevent"><code>RTCPeerConnectionIceEvent</code></a> being an <a href="event"><code>Event</code></a>, this event also implements these properties</em>. <em>There is no specific <em><a href="rtcdatachannelevent"><code>RTCDataChannelEvent</code></a></em> method.</em>
es: <em>Un <a href="rtcpeerconnectioniceevent"> <code>RTCPeerConnectionIceEvent</code> </a> es un <a href="event"> <code>Event</code> </a> , este evento tambi&eacute;n implementa estas propiedades</em> . <em>No existe un m&eacute;todo <em><a href="rtcdatachannelevent"> <code>RTCDataChannelEvent</code> </a></em> espec&iacute;fico .</em>
ko: <em><a href="rtcpeerconnectioniceevent"> <code>RTCPeerConnectionIceEvent</code> </a> 되는 <a href="event"> <code>Event</code> </a> ,이 이벤트는 이러한 속성을 구현합니다</em> . <em>특정 <em><a href="rtcdatachannelevent"> <code>RTCDataChannelEvent</code> </a></em> 메소드 가 없습니다 .</em>
ru: <em><a href="rtcpeerconnectioniceevent"> <code>RTCPeerConnectionIceEvent</code> </a> будучи <a href="event"> <code>Event</code> </a> , это событие также реализует эти свойства</em> . <em><em><a href="rtcdatachannelevent"> <code>RTCDataChannelEvent</code> </a></em></em><em> метода </em><em><em>RTCDataChannelEvent</em></em><em> не <em>существует</em> .</em>
zh_cn: <em>一个<a href="rtcpeerconnectioniceevent"> <code>RTCPeerConnectionIceEvent</code> </a>作为一个<a href="event"> <code>Event</code> </a>，这个事件也实现了这些特性</em>。<em>没有特定的<em><a href="rtcdatachannelevent"> <code>RTCDataChannelEvent</code> </a></em>方法。</em>

source: <em>A list of font names, that have to be present on the local system</em>
es: <em>Una lista de nombres de fuentes, que deben estar presentes en el sistema local.</em>
ko: <em>로컬 시스템에 존재해야하는 글꼴 이름 목록</em>
ru: <em>Список имен шрифтов, которые должны присутствовать в локальной системе</em>
zh_cn: <em>本地系统上必须存在的字体名称列表</em>

source: <em>Add information for developers using Microsoft Edge.</em>
es: <em>Agregue informaci&oacute;n para desarrolladores que usan Microsoft Edge.</em>
ko: <em>Microsoft Edge를 사용하는 개발자를위한 정보를 추가하십시오.</em>
ru: <em>Добавить информацию для разработчиков, использующих Microsoft Edge.</em>
zh_cn: <em>为使用Microsoft Edge的开发人员添加信息。</em>

source: <em>Add information for developers working in Safari.</em>
es: <em>Agregue informaci&oacute;n para desarrolladores que trabajan en Safari.</em>
ko: <em>Safari에서 작업하는 개발자를위한 정보를 추가하십시오.</em>
ru: <em>Добавить информацию для разработчиков, работающих в Safari.</em>
zh_cn: <em>为在Safari中工作的开发人员添加信息。</em>

source: <em>Also implements methods from its parent interface, </em><a href="eventtarget"><code>EventTarget</code></a>.
es: <em>Tambi&eacute;n implementa m&eacute;todos desde su interfaz principal, </em><a href="eventtarget"> <code>EventTarget</code> </a> .
ko: <em>또한 부모 인터페이스 인 </em><a href="eventtarget"> <code>EventTarget</code> </a><em> 에서 메소드를 구현합니다</em> .
ru: <em>Также реализует методы из родительского интерфейса </em><a href="eventtarget"> <code>EventTarget</code> </a> .
zh_cn: <em>还从其父接口</em><a href="eventtarget"> <code>EventTarget</code> </a><em>实现方法</em>。

source: <em>Also implements methods from the interface </em><a href="eventtarget"><code>EventTarget</code></a>.
es: <em>Tambi&eacute;n implementa m&eacute;todos desde la interfaz </em><a href="eventtarget"> <code>EventTarget</code> </a> .
ko: <em>또한 </em><a href="eventtarget"> <code>EventTarget</code> </a><em> 인터페이스에서 메소드를 구현합니다</em> .
ru: <em>Также реализует методы из интерфейса </em><a href="eventtarget"> <code>EventTarget</code> </a> .
zh_cn: <em>还从</em><a href="eventtarget"> <code>EventTarget</code> </a><em>接口实现方法</em>。

source: <em>Also implements properties from its parent interface, </em><a href="eventtarget"><code>EventTarget</code></a>.
es: <em>Tambi&eacute;n implementa propiedades desde su interfaz principal, </em><a href="eventtarget"> <code>EventTarget</code> </a> .
ko: <em>또한 부모 인터페이스 인 </em><a href="eventtarget"> <code>EventTarget</code> </a><em> 에서 속성을 구현합니다</em> .
ru: <em>Также реализует свойства из родительского интерфейса </em><a href="eventtarget"> <code>EventTarget</code> </a> .
zh_cn: <em>还从其父接口</em><a href="eventtarget"> <code>EventTarget</code> </a><em>实现属性</em>。

source: <em>Also implements the properties of <a href="rtcrtpcontributingsource"><code>RTCRtpContributingSource</code></a>.</em>
es: <em>Tambi&eacute;n implementa las propiedades de <a href="rtcrtpcontributingsource"> <code>RTCRtpContributingSource</code> </a> .</em>
ko: <em><a href="rtcrtpcontributingsource"> <code>RTCRtpContributingSource</code> </a> 의 속성도 구현합니다 .</em>
ru: <em>Также реализует свойства <a href="rtcrtpcontributingsource"> <code>RTCRtpContributingSource</code> </a> .</em>
zh_cn: <em>还实现<a href="rtcrtpcontributingsource"> <code>RTCRtpContributingSource</code> </a>的属性。</em>

source: <em>Also includes methods from <a href="eventtarget"><code>EventTarget</code></a>, the parent interface.</em>
es: <em>Tambi&eacute;n incluye m&eacute;todos de <a href="eventtarget"> <code>EventTarget</code> </a> , la interfaz principal.</em>
ko: <em>부모 인터페이스 인 <a href="eventtarget"> <code>EventTarget</code> 의</a> 메소드도 포함 됩니다.</em>
ru: <em>Также включает методы из <a href="eventtarget"> <code>EventTarget</code> </a> , родительского интерфейса.</em>
zh_cn: <em>还包括来自父接口<a href="eventtarget"> <code>EventTarget</code> 的</a>方法。</em>

source: <em>Also inherits event handlers from: <a href="eventtarget"><code>EventTarget</code></a></em>
es: <em>Tambi&eacute;n hereda controladores de eventos de: <a href="eventtarget"> <code>EventTarget</code> </a></em>
ko: <em><a href="eventtarget"> <code>EventTarget</code> </a> 에서 이벤트 핸들러를 상속합니다.</em>
ru: <em>Также наследует обработчики событий от: <a href="eventtarget"> <code>EventTarget</code> </a></em>
zh_cn: <em>还从以下事件继承事件处理程序：<a href="eventtarget"> <code>EventTarget</code> </a></em>

source: <em>Also inherits methods <em>from its parent <a href="event"><code>Event</code></a>.</em></em>
es: <em>Tambi&eacute;n hereda m&eacute;todos <em>de su <a href="event"> <code>Event</code> </a> principal .</em></em>
ko: <em>또한 <em>부모 </em><em><a href="event"> <code>Event</code> </a></em><em> 에서</em> 메서드 <em>를</em> 상속합니다 <em>.</em><em></em></em>
ru: <em>Также наследует методы <em>от своего родительского <a href="event"> <code>Event</code> </a> .</em></em>
zh_cn: <em>还<em>从其父</em><em><a href="event"> <code>Event</code> </a></em>继承方法<em>。</em><em></em></em>

source: <em>Also inherits methods from its parent <a href="event"><code>Event</code></a>.</em>
es: <em>Tambi&eacute;n hereda m&eacute;todos de su <a href="event"> <code>Event</code> </a> principal .</em>
ko: <em>또한 부모 <a href="event"> <code>Event</code> </a> 에서 메서드를 상속합니다 .</em>
ru: <em>Также наследует методы от своего родительского <a href="event"> <code>Event</code> </a> .</em>
zh_cn: <em>还从其父<a href="event"> <code>Event</code> </a>继承方法。</em>

source: <em>Also inherits methods from its parent <a href="event"><code>Event</code></a></em>.
es: <em>Tambi&eacute;n hereda m&eacute;todos de su <a href="event"> <code>Event</code> </a></em><em> principal </em>.
ko: <em>또한 부모 <a href="event"> <code>Event</code> </a></em><em> 에서 메서드를 상속합니다 </em>.
ru: <em>Также наследует методы от своего родительского <a href="event"> <code>Event</code> </a></em> .
zh_cn: <em>还从其父<a href="event"> <code>Event</code> </a></em><em>继承方法</em>。

source: <em>Also inherits methods from its parent interface, <a href="baseaudiocontext"><code>BaseAudioContext</code></a>.</em>
es: <em>Tambi&eacute;n hereda m&eacute;todos de su interfaz principal, <a href="baseaudiocontext"> <code>BaseAudioContext</code> </a> .</em>
ko: <em>또한 부모 인터페이스 인 <a href="baseaudiocontext"> <code>BaseAudioContext</code> </a> 에서 메소드를 상속합니다 .</em>
ru: <em>Также наследует методы от своего родительского интерфейса, <a href="baseaudiocontext"> <code>BaseAudioContext</code> </a> .</em>
zh_cn: <em>还从其父接口<a href="baseaudiocontext"> <code>BaseAudioContext</code> </a>继承方法。</em>

source: <em>Also inherits methods from its parents <a href="idbrequest"><code>IDBRequest</code></a> and <a href="eventtarget"><code>EventTarget</code></a></em>.
es: <em>Tambi&eacute;n hereda m&eacute;todos de sus padres <a href="idbrequest"> <code>IDBRequest</code> </a> y <a href="eventtarget"> <code>EventTarget</code> </a></em> .
ko: <em>부모 <a href="idbrequest"> <code>IDBRequest</code> </a> 및 <a href="eventtarget"> <code>EventTarget</code> </a></em><em> 에서 메소드를 상속합니다</em> .
ru: <em>Также наследует методы от своих родителей <a href="idbrequest"> <code>IDBRequest</code> </a> и <a href="eventtarget"> <code>EventTarget</code> </a></em> .
zh_cn: <em>还从其父级<a href="idbrequest"> <code>IDBRequest</code> </a>和<a href="eventtarget"> <code>EventTarget</code> </a></em><em>继承方法</em>。

source: <em>Also inherits methods from: <a href="eventtarget"><code>EventTarget</code></a></em>
es: <em>Tambi&eacute;n hereda m&eacute;todos de: <a href="eventtarget"> <code>EventTarget</code> </a></em>
ko: <em><a href="eventtarget"> <code>EventTarget</code> </a> 에서 메소드를 상속합니다.</em>
ru: <em>Также наследует методы от: <a href="eventtarget"> <code>EventTarget</code> </a></em>
zh_cn: <em>还从以下方法继承方法：<a href="eventtarget"> <code>EventTarget</code> </a></em>

source: <em>Also inherits properties from <a href="eventtarget"><code>EventTarget</code></a>.</em>
es: <em>Tambi&eacute;n hereda propiedades de <a href="eventtarget"> <code>EventTarget</code> </a> .</em>
ko: <em><a href="eventtarget"> <code>EventTarget</code> </a> 에서 속성을 상속합니다 .</em>
ru: <em>Также наследует свойства от <a href="eventtarget"> <code>EventTarget</code> </a> .</em>
zh_cn: <em>还从<a href="eventtarget"> <code>EventTarget</code> </a>继承属性。</em>

source: <em>Also inherits properties from its parent <a href="event"><code>Event</code></a></em>.
es: <em>Tambi&eacute;n hereda propiedades de su <a href="event"> <code>Event</code> </a></em><em> principal</em> .
ko: <em>또한 부모 <a href="event"> <code>Event</code> </a></em><em> 에서 속성을 상속합니다</em> .
ru: <em>Также наследует свойства от своего родительского <a href="event"> <code>Event</code> </a></em> .
zh_cn: <em>还从其父<a href="event"> <code>Event</code> </a></em><em>继承属性</em>。

source: <em>Also inherits properties from its parent interface, <a href="baseaudiocontext"><code>BaseAudioContext</code></a>.</em>
es: <em>Tambi&eacute;n hereda propiedades de su interfaz principal, <a href="baseaudiocontext"> <code>BaseAudioContext</code> </a> .</em>
ko: <em>또한 부모 인터페이스 인 <a href="baseaudiocontext"> <code>BaseAudioContext</code> </a> 에서 속성을 상속합니다 .</em>
ru: <em>Также наследует свойства от своего родительского интерфейса, <a href="baseaudiocontext"> <code>BaseAudioContext</code> </a> .</em>
zh_cn: <em>还从其父接口<a href="baseaudiocontext"> <code>BaseAudioContext</code> </a>继承属性。</em>

source: <em>Also inherits properties from its parent interface, <a href="event"><code>Event</code></a>.</em>
es: <em>Tambi&eacute;n hereda propiedades de su interfaz principal, <a href="event"> <code>Event</code> o</a> .</em>
ko: <em>또한 부모 인터페이스 인 <a href="event"> <code>Event</code> </a> 에서 속성을 상속합니다 .</em>
ru: <em>Также наследует свойства от своего родительского интерфейса, <a href="event"> <code>Event</code> </a> .</em>
zh_cn: <em>还从其父接口<a href="event"> <code>Event</code> </a>继承属性。</em>

source: <em>Also inherits properties from its parent, <a href="event"><code>Event</code></a></em>.
es: <em>Tambi&eacute;n hereda propiedades de su padre, <a href="event"> <code>Event</code> o</a></em> .
ko: <em>또한 부모 인 <a href="event"> <code>Event</code> </a></em><em> 에서 속성을 상속합니다</em> .
ru: <em>Также наследует свойства от своего родителя, <a href="event"> <code>Event</code> </a></em> .
zh_cn: <em>也从其父<a href="event"> <code>Event</code> </a></em><em>继承属性</em>。

source: <em>Also inherits properties from its parent, <a href="htmlelement"><code>HTMLElement</code></a>.</em>
es: <em>Tambi&eacute;n hereda propiedades de su padre, <a href="htmlelement"> <code>HTMLElement</code> </a> .</em>
ko: <em>부모 <a href="htmlelement"> <code>HTMLElement</code> </a> 에서 속성을 상속합니다 .</em>
ru: <em>Также наследует свойства от своего родителя, <a href="htmlelement"> <code>HTMLElement</code> </a> .</em>
zh_cn: <em>还从其父<a href="htmlelement"> <code>HTMLElement</code> </a>继承属性。</em>
