Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/dom/dom.*.007.xlf
Languages: es, ko, ru, zh_cn

source: <strong>Android Key Attestation</strong> - one of the features added in Android O was Android Key Attestation, which enables the Android operating system to attest to keys.
es: <strong>Android Key Attestation</strong> : una de las caracter&iacute;sticas agregadas en Android O fue Android Key Attestation, que permite que el sistema operativo Android atestig&uuml;e las teclas.
ko: <strong>Android Key Attestation</strong> -Android O에 추가 된 기능 중 하나는 Android Key Attestation으로, Android 운영 체제에서 키를 증명할 수 있습니다.
ru: <strong>Аттестация ключей Android.</strong> Одной из функций, добавленных в Android O, была аттестация ключей Android, которая позволяет операционной системе Android подтверждать наличие ключей.
zh_cn: <strong>Android密钥证明</strong> -Android O中添加的功能之一是Android密钥证明，它使Android操作系统能够证明密钥。

source: <strong>Android SafetyNet</strong> -prior to Android Key Attestation, the only option for Android devices was to create Android SafetyNet attestations
es: <strong>Android SafetyNet: antes de la</strong> certificaci&oacute;n de clave de Android, la &uacute;nica opci&oacute;n para dispositivos Android era crear certificaciones de Android SafetyNet
ko: <strong>Android SafetyNet</strong> -Android 키 증명 이전에 Android 장치에 대한 유일한 옵션은 Android SafetyNet 증명을 만드는 것입니다.
ru: <strong>Android SafetyNet - в</strong> отличие от ключевой аттестации Android, единственным вариантом для устройств Android было создание аттестаций Android SafetyNet.
zh_cn: <strong>Android SafetyNet-</strong>在Android密钥证明之前，Android设备的唯一选择是创建Android SafetyNet证明

source: <strong>Application Requests Authentication</strong> - The application makes the initial authentication request. The protocol and format of this request is outside of the scope of WebAuthn.
es: <strong>Autenticaci&oacute;n de solicitudes de aplicaci&oacute;n</strong> : la aplicaci&oacute;n realiza la solicitud de autenticaci&oacute;n inicial. El protocolo y el formato de esta solicitud est&aacute;n fuera del alcance de WebAuthn.
ko: <strong>응용 프로그램 요청 인증</strong> -응용 프로그램이 초기 인증 요청을합니다. 이 요청의 프로토콜 및 형식이 WebAuthn 범위를 벗어납니다.
ru: <strong>Проверка подлинности запросов приложений</strong> - приложение выполняет первоначальный запрос проверки подлинности. Протокол и формат этого запроса выходят за рамки WebAuthn.
zh_cn: <strong>应用程序请求身份验证</strong> -应用程序发出初始身份验证请求。此请求的协议和格式不在WebAuthn的范围内。

source: <strong>Application Requests Registration</strong> - The application makes the initial registration request. The protocol and format of this request is outside of the scope of WebAuthn.
es: <strong>Solicitud de registro de solicitudes</strong> : la aplicaci&oacute;n realiza la solicitud de registro inicial. El protocolo y el formato de esta solicitud est&aacute;n fuera del alcance de WebAuthn.
ko: <strong>응용 프로그램 요청 등록</strong> -응용 프로그램이 초기 등록 요청을합니다. 이 요청의 프로토콜 및 형식이 WebAuthn 범위를 벗어납니다.
ru: <strong>Заявка на регистрацию</strong> - Приложение подает первоначальный запрос на регистрацию. Протокол и формат этого запроса выходят за рамки WebAuthn.
zh_cn: <strong>申请请求注册</strong> -应用程序提出初始注册请求。此请求的协议和格式不在WebAuthn的范围内。

source: <strong>Attributes</strong> are GLSL variables which are only available to the vertex shader (as variables) and the JavaScript code. Attributes are typically used to store color information, texture coordinates, and any other data calculated or retrieved that needs to be shared between the JavaScript code and the vertex shader.
es: <strong>Los atributos</strong> son variables GLSL que solo est&aacute;n disponibles para el sombreador de v&eacute;rtices (como variables) y el c&oacute;digo JavaScript. Los atributos se usan generalmente para almacenar informaci&oacute;n de color, coordenadas de textura y cualquier otro dato calculado o recuperado que deba compartirse entre el c&oacute;digo JavaScript y el sombreador de v&eacute;rtices.
ko: <strong>속성</strong> 은 정점 셰이더 (변수로) 및 JavaScript 코드에서만 사용할 수있는 GLSL 변수입니다. 속성은 일반적으로 색상 정보, 텍스처 좌표 및 JavaScript 코드와 정점 셰이더간에 공유해야하는 계산 또는 검색된 기타 데이터를 저장하는 데 사용됩니다.
ru: <strong>Атрибутами</strong> являются переменные GLSL, которые доступны только для вершинного шейдера (как переменные) и кода JavaScript. Атрибуты обычно используются для хранения информации о цвете, координат текстуры и любых других рассчитанных или извлеченных данных, которые должны быть разделены между кодом JavaScript и вершинным шейдером.
zh_cn: <strong>属性</strong>是GLSL变量，仅可用于顶点着色器（作为变量）和JavaScript代码。属性通常用于存储颜色信息，纹理坐标以及所有需要在JavaScript代码和顶点着色器之间共享的计算或检索到的其他数据。

source: <strong>Authenticator Creates New Key Pair and Attestation</strong> - Before doing anything, the authenticator will typically ask for some form of user verification. This could be entering a PIN, using a fingerprint, doing an iris scan, etc. to prove that the user is present and consenting to the registration. After the user verification, the authenticator will create a new asymmetric key pair and safely store the private key for future reference. The public key will become part of the attestation, which the authenticator will sign over with a private key that was burned into the authenticator during its manufacturing process and that has a certificate chain that can be validated back to a root of trust.
es: <strong>El autenticador crea un nuevo par de claves y certificaci&oacute;n</strong> : antes de hacer nada, el autenticador normalmente solicitar&aacute; alg&uacute;n tipo de verificaci&oacute;n del usuario. Esto podr&iacute;a ser ingresar un PIN, usar una huella digital, hacer un escaneo del iris, etc. para probar que el usuario est&aacute; presente y consiente el registro. Despu&eacute;s de la verificaci&oacute;n del usuario, el autenticador crear&aacute; un nuevo par de claves asim&eacute;tricas y almacenar&aacute; de manera segura la clave privada para referencia futura. La clave p&uacute;blica se convertir&aacute; en parte de la certificaci&oacute;n, que el autenticador firmar&aacute; con una clave privada que se grab&oacute; en el autenticador durante su proceso de fabricaci&oacute;n y que tiene una cadena de certificados que puede validarse de nuevo a una ra&iacute;z de confianza.
ko: <strong>인증</strong> 자는 <strong>새로운 키 페어 및 증명을 생성합니다</strong> -인증자는 일반적으로 어떤 일을하기 전에 어떤 형태의 사용자 확인을 요구합니다. 이것은 PIN을 입력하거나, 지문을 사용하거나, 홍채 스캔을 수행하는 등의 방법으로 사용자가 있고 등록에 동의했음을 증명할 수 있습니다. 사용자 확인 후 인증자는 새로운 비대칭 키 쌍을 생성하고 나중에 참조 할 수 있도록 개인 키를 안전하게 저장합니다. 공개 키는 증명 과정의 일부가되며, 인증자는 제조 과정에서 인증 자에 기록 된 개인 키로 사인 인하고 신뢰 루트로 다시 확인할 수있는 인증서 체인을 보유하게됩니다.
ru: <strong>Аутентификатор создает новую пару ключей и аттестацию.</strong> Прежде чем что-либо делать, аутентификатор обычно запрашивает некоторую форму подтверждения пользователя. Это может быть ввод PIN-кода, использование отпечатка пальца, сканирование радужной оболочки глаза и т. Д., Чтобы доказать, что пользователь присутствует и дает согласие на регистрацию. После проверки пользователя аутентификатор создаст новую пару асимметричных ключей и безопасно сохранит закрытый ключ для дальнейшего использования. Открытый ключ станет частью аттестации, которую аутентификатор подпишет с закрытым ключом, который был записан в аутентификаторе в процессе его производства и который имеет цепочку сертификатов, которую можно проверить обратно в корень доверия.
zh_cn: <strong>身份验证器创建新的密钥对和证明</strong> -在进行任何操作之前，身份验证器通常会要求某种形式的用户验证。这可能是输入PIN，使用指纹，进行虹膜扫描等，以证明用户在场并同意注册。用户验证后，身份验证者将创建一个新的非对称密钥对，并安全地存储私钥以供将来参考。公钥将成为证明的一部分，身份验证者将使用在制造过程中烧入身份验证者的私钥进行签名，该私钥具有可以被验证回到信任根的证书链。

source: <strong>Authenticator Creates an Assertion</strong> - The authenticator finds a credential for this service that matches the Relying Party ID and prompts a user to consent to the authentication. Assuming both of those steps are successful, the authenticator will create a new assertion by signing over the clientDataHash and authenticatorData with the private key generated for this account during the registration call.
es: <strong>El autenticador crea una aserci&oacute;n</strong> : el autenticador encuentra una credencial para este servicio que coincide con la ID de la parte que conf&iacute;a y solicita a un usuario que d&eacute; su consentimiento para la autenticaci&oacute;n. Asumiendo que ambos pasos son exitosos, el autenticador crear&aacute; una nueva afirmaci&oacute;n al firmar el clientDataHash y authenticatorData con la clave privada generada para esta cuenta durante la llamada de registro.
ko: <strong>인증자가 어설 션을 만듭니다</strong> -인증자는이 서비스에 대한 신뢰 당사자 ID와 일치하는 자격 증명을 찾고 사용자에게 인증에 동의하라는 메시지를 표시합니다. 이 두 단계가 모두 성공하면 인증자는 등록 호출 중에이 계정에 대해 생성 된 개인 키로 clientDataHash 및 authenticatorData에 서명하여 새 어설 션을 작성합니다.
ru: <strong>Аутентификатор создает утверждение</strong> . Аутентификатор находит учетные данные для этой службы, которые соответствуют идентификатору проверяющей стороны, и предлагает пользователю дать согласие на аутентификацию. Предполагая, что оба эти шага выполнены успешно, аутентификатор создаст новое утверждение, подписав clientDataHash и authenticatorData с закрытым ключом, созданным для этой учетной записи во время вызова регистрации.
zh_cn: <strong>身份验证器创建一个断言</strong> -身份验证器找到与依赖方ID相匹配的此服务的凭据，并提示用户同意进行身份验证。假设这两个步骤均成功，那么身份验证器将使用在注册调用期间为此帐户生成的私钥对clientDataHash和authenticatorData进行签名，从而创建一个新的断言。

source: <strong>Authenticator Returns Data to Browser</strong> - The authenticator returns the authenticatorData and assertion signature back to the browser.
es: <strong>Authenticator devuelve datos al navegador</strong> : el autenticador devuelve los datos de autenticador y la firma de aserci&oacute;n al navegador.
ko: <strong>인증자가 브라우저로 데이터를 반환</strong> -인증자는 authenticatorData 및 어설 션 서명을 브라우저로 다시 반환합니다.
ru: <strong>Аутентификатор возвращает данные в браузер</strong> - Аутентификатор возвращает authenticatorData и подпись подтверждения обратно в браузер.
zh_cn: <strong>Authenticator将数据返回到浏览器</strong> -Authenticator将authenticatorData和断言签名返回给浏览器。

source: <strong>Authenticator Returns Data to Browser</strong> - The new public key, a globally unique credential id, and other attestation data are returned to the browser where they become the attestationObject.
es: <strong>Authenticator devuelve datos al navegador</strong> : la nueva clave p&uacute;blica, una identificaci&oacute;n de credencial &uacute;nica globalmente y otros datos de certificaci&oacute;n se devuelven al navegador donde se convierten en el objeto de certificaci&oacute;n.
ko: <strong>인증자가 브라우저로 데이터를 반환</strong> -새 공개 키, 전역 적으로 고유 한 자격 증명 ID 및 기타 증명 데이터가 브라우저에 반환되어 attestationObject가됩니다.
ru: <strong>Authenticator возвращает данные в браузер</strong> - новый открытый ключ, глобально уникальный идентификатор учетных данных и другие данные подтверждения возвращаются в браузер, где они становятся объектом attestationObject.
zh_cn: <strong>身份验证器</strong>将<strong>数据返回到浏览器</strong> -新的公钥，全局唯一的凭证ID和其他证明数据被返回到浏览器，在此它们成为证明对象。

source: <strong>Authenticator</strong> - the credentials are created and stored in a device called an authenticator. This is a new concept in authentication: when authenticating using passwords, the password is stored in a user's brain and no other device is needed; when authenticating using WebAuthn, the password is replaced with a key pair that is stored in an authenticator. The authenticator may be embedded into an operating system, such as Windows Hello, or may be a physical token, such as a USB or Bluetooth Security Key.
es: <strong>Autenticador</strong> : las credenciales se crean y almacenan en un dispositivo llamado autenticador. Este es un nuevo concepto en autenticaci&oacute;n: cuando se autentica usando contrase&ntilde;as, la contrase&ntilde;a se almacena en el cerebro del usuario y no se necesita ning&uacute;n otro dispositivo; cuando se autentica usando WebAuthn, la contrase&ntilde;a se reemplaza con un par de claves que se almacena en un autenticador. El autenticador puede estar integrado en un sistema operativo, como Windows Hello, o puede ser un token f&iacute;sico, como una llave de seguridad USB o Bluetooth.
ko: <strong>인증 자</strong> -자격 증명이 생성되어 인증 자라는 장치에 저장됩니다. 이것은 인증의 새로운 개념입니다. 암호를 사용하여 인증 할 때 암호는 사용자의 두뇌에 저장되며 다른 장치는 필요하지 않습니다. WebAuthn을 사용하여 인증 할 때 비밀번호는 인증 자에 저장된 키 쌍으로 대체됩니다. 인증자는 Windows Hello와 같은 운영 체제에 포함되거나 USB 또는 Bluetooth 보안 키와 같은 물리적 토큰 일 수 있습니다.
ru: <strong>Аутентификатор</strong> - учетные данные создаются и хранятся в устройстве, называемом аутентификатором. Это новая концепция аутентификации: при аутентификации с использованием паролей пароль сохраняется в мозгу пользователя, и никакое другое устройство не требуется; при аутентификации с использованием WebAuthn пароль заменяется парой ключей, которая хранится в аутентификаторе. Аутентификатор может быть встроен в операционную систему, такую ​​как Windows Hello, или может быть физическим токеном, таким как ключ безопасности USB или Bluetooth.
zh_cn: <strong>身份验证器</strong> -创建凭据并将其存储在称为身份验证器的设备中。这是身份验证中的一个新概念：使用密码进行身份验证时，密码存储在用户的大脑中，不需要其他设备。使用WebAuthn进行身份验证时，密码将替换为存储在身份验证器中的密钥对。身份验证器可以嵌入到操作系统（例如Windows Hello）中，也可以是物理令牌（例如USB或蓝牙安全密钥）。

source: <strong>Autonomous custom element</strong>: Standalone elements; they don't inherit from built-in HTML elements.
es: <strong>Elemento personalizado</strong> aut&oacute;nomo: elementos independientes; no heredan de elementos HTML integrados.
ko: <strong>자율 사용자 정의 요소</strong> : 독립형 요소; 내장 HTML 요소에서 상속되지 않습니다.
ru: <strong>Автономный пользовательский элемент</strong> : автономные элементы; они не наследуются от встроенных элементов HTML.
zh_cn: <strong>自主定制元素</strong>：独立元素；它们不继承自内置HTML元素。

source: <strong>Availability: </strong>ASTC compression is typically available on Mali ARM GPUs, Intel GPUs, and Nividia Tegra chips.
es: <strong>Disponibilidad: la</strong> compresi&oacute;n ASTC generalmente est&aacute; disponible en GPU Mali ARM, GPU Intel y chips Nividia Tegra.
ko: <strong>가용성 :</strong> ASTC 압축은 일반적으로 Mali ARM GPU, Intel GPU 및 Nividia Tegra 칩에서 사용할 수 있습니다.
ru: <strong>Доступность:</strong> сжатие ASTC обычно доступно на графических процессорах Mali ARM, Intel GPU и чипах Nividia Tegra.
zh_cn: <strong>可用性：</strong> ASTIC压缩通常在Mali ARM GPU，Intel GPU和Nividia Tegra芯片上可用。

source: <strong>Availability: </strong>ATC compression is typically available on mobile devices with <a href="https://en.wikipedia.org/wiki/Adreno">Adreno GPUs</a>, that are currently only built into <a href="https://en.wikipedia.org/wiki/Qualcomm_Snapdragon">Qualcomm Snapdragon</a> devices.
es: <strong>Disponibilidad: la</strong> compresi&oacute;n ATC generalmente est&aacute; disponible en dispositivos m&oacute;viles con <a href="https://en.wikipedia.org/wiki/Adreno">GPU Adreno</a> , que actualmente solo est&aacute;n integrados en dispositivos <a href="https://en.wikipedia.org/wiki/Qualcomm_Snapdragon">Qualcomm Snapdragon</a> .
ko: <strong>가용성 :</strong> ATC 압축은 일반적으로 현재 <a href="https://en.wikipedia.org/wiki/Qualcomm_Snapdragon">Qualcomm Snapdragon</a> 장치 에만 내장 된 <a href="https://en.wikipedia.org/wiki/Adreno">Adreno GPU가있는</a> 모바일 장치에서 사용할 수 있습니다.
ru: <strong>Доступность:</strong> сжатие ATC обычно доступно на мобильных устройствах с <a href="https://en.wikipedia.org/wiki/Adreno">графическими процессорами Adreno</a> , которые в настоящее время встроены только в устройства <a href="https://en.wikipedia.org/wiki/Qualcomm_Snapdragon">Qualcomm Snapdragon</a> .
zh_cn: <strong>可用性：</strong> ATC压缩通常可在带有<a href="https://en.wikipedia.org/wiki/Adreno">Adreno GPU的</a>移动设备上使用，目前仅内置在<a href="https://en.wikipedia.org/wiki/Qualcomm_Snapdragon">Qualcomm Snapdragon</a>设备中。

source: <strong>Availability: </strong>PVRTC is typically only available on mobile devices with PowerVR chipsets. It is used in all generations of the iPhone, iPod Touch and iPad and supported on certain Android devices that use a PowerVR GPU.
es: <strong>Disponibilidad:</strong> PVRTC generalmente solo est&aacute; disponible en dispositivos m&oacute;viles con conjuntos de chips PowerVR. Se utiliza en todas las generaciones de iPhone, iPod Touch y iPad y es compatible con ciertos dispositivos Android que usan una GPU PowerVR.
ko: <strong>가용성 :</strong> PVRTC는 일반적으로 PowerVR 칩셋이있는 모바일 장치에서만 사용할 수 있습니다. 모든 세대의 iPhone, iPod Touch 및 iPad에서 사용되며 PowerVR GPU를 사용하는 특정 Android 장치에서 지원됩니다.
ru: <strong>Доступность:</strong> PVRTC обычно доступен только на мобильных устройствах с чипсетами PowerVR. Он используется во всех поколениях iPhone, iPod Touch и iPad и поддерживается на некоторых устройствах Android, использующих графический процессор PowerVR.
zh_cn: <strong>可用性：</strong> PVRTC通常仅在具有PowerVR芯片组的移动设备上可用。它已在iPhone，iPod Touch和iPad的所有版本中使用，并且在某些使用PowerVR GPU的Android设备上受支持。

source: <strong>Availability:</strong> Depending on the privacy settings of the browser, this extension might only be available to privileged contexts or not work at all. In Firefox, if <code>privacy.resistFingerprinting</code> is set to <code>true</code>, this extensions is disabled.
es: <strong>Disponibilidad:</strong> Dependiendo de la configuraci&oacute;n de privacidad del navegador, esta extensi&oacute;n puede estar disponible solo en contextos privilegiados o no funcionar en absoluto. En Firefox, si <code>privacy.resistFingerprinting</code> est&aacute; establecido en <code>true</code> , esta extensi&oacute;n est&aacute; deshabilitada.
ko: <strong>가용성 :</strong> 브라우저의 개인 정보 설정에 따라이 확장은 권한있는 컨텍스트에서만 사용할 수 있거나 전혀 작동하지 않을 수 있습니다. Firefox에서 <code>privacy.resistFingerprinting</code> 이 <code>true</code> 로 설정 되면이 확장이 사용 불가능합니다.
ru: <strong>Доступность.</strong> В зависимости от настроек конфиденциальности браузера это расширение может быть доступно только в привилегированном контексте или не работать вообще. В Firefox, если для <code>privacy.resistFingerprinting</code> задано значение <code>true</code> , это расширение отключено.
zh_cn: <strong>可用性：</strong>根据浏览器的隐私设置，此扩展名可能仅对特权上下文可用或根本不起作用。在Firefox中，如果将 <code>privacy.resistFingerprinting</code> 设置为 <code>true</code> ，则将禁用此扩展名。

source: <strong>Availability:</strong> Depending on the privacy settings of the browser, this extension might only be available to privileged contexts.
es: <strong>Disponibilidad:</strong> Dependiendo de la configuraci&oacute;n de privacidad del navegador, esta extensi&oacute;n solo puede estar disponible para contextos privilegiados.
ko: <strong>가용성 :</strong> 브라우저의 개인 정보 설정에 따라이 확장은 권한있는 컨텍스트에서만 사용할 수 있습니다.
ru: <strong>Доступность.</strong> В зависимости от настроек конфиденциальности браузера это расширение может быть доступно только для привилегированных контекстов.
zh_cn: <strong>可用性：</strong>根据浏览器的隐私设置，此扩展可能仅对特权上下文可用。

source: <strong>Availability:</strong> This extension is available to <a href="webgl2renderingcontext">WebGL 2</a> contexts only.
es: <strong>Disponibilidad:</strong> esta extensi&oacute;n est&aacute; disponible solo para contextos <a href="webgl2renderingcontext">WebGL 2</a> .
ko: <strong>가용성 :</strong> 이 확장은 <a href="webgl2renderingcontext">WebGL 2</a> 컨텍스트에서만 사용 가능 합니다.
ru: <strong>Доступность:</strong> это расширение доступно только для контекстов <a href="webgl2renderingcontext">WebGL 2</a> .
zh_cn: <strong>可用性：</strong>此扩展仅适用于<a href="webgl2renderingcontext">WebGL 2</a>上下文。

source: <strong>Availability:</strong> This extension is available to <a href="webglrenderingcontext">WebGL 1</a> contexts only. For <a href="webgl2renderingcontext">WebGL 2</a>, use the <a href="ext_color_buffer_float"><code>EXT_color_buffer_float</code></a> extension.
es: <strong>Disponibilidad:</strong> esta extensi&oacute;n est&aacute; disponible solo para contextos <a href="webglrenderingcontext">WebGL 1</a> . Para <a href="webgl2renderingcontext">WebGL 2</a> , use la extensi&oacute;n <a href="ext_color_buffer_float"> <code>EXT_color_buffer_float</code> </a> .
ko: <strong>가용성 :</strong> 이 확장은 <a href="webglrenderingcontext">WebGL 1</a> 컨텍스트에서만 사용 가능 합니다. 들어 <a href="webgl2renderingcontext">WebGL을 2</a> , 사용 <a href="ext_color_buffer_float"> <code>EXT_color_buffer_float</code> 의</a> 확장.
ru: <strong>Доступность:</strong> Это расширение доступно только для контекстов <a href="webglrenderingcontext">WebGL 1</a> . Для <a href="webgl2renderingcontext">WebGL 2</a> используйте расширение <a href="ext_color_buffer_float"> <code>EXT_color_buffer_float</code> </a> .
zh_cn: <strong>可用性：</strong>此扩展仅适用于<a href="webglrenderingcontext">WebGL 1</a>上下文。对于<a href="webgl2renderingcontext">WebGL 2</a>，请使用<a href="ext_color_buffer_float"> <code>EXT_color_buffer_float</code> </a>扩展名。

source: <strong>Availability:</strong> This extension is available to both <a href="webglrenderingcontext">WebGL1</a> and <a href="webgl2renderingcontext">WebGL2</a> contexts.
es: <strong>Disponibilidad:</strong> esta extensi&oacute;n est&aacute; disponible para los contextos <a href="webglrenderingcontext">WebGL1</a> y <a href="webgl2renderingcontext">WebGL2</a> .
ko: <strong>가용성 :</strong> 이 확장은 <a href="webglrenderingcontext">WebGL1</a> 및 <a href="webgl2renderingcontext">WebGL2</a> 컨텍스트 모두에 사용 가능 합니다.
ru: <strong>Доступность:</strong> это расширение доступно для контекстов <a href="webglrenderingcontext">WebGL1</a> и <a href="webgl2renderingcontext">WebGL2</a> .
zh_cn: <strong>可用性：</strong>此扩展名可用于<a href="webglrenderingcontext">WebGL1</a>和<a href="webgl2renderingcontext">WebGL2</a>上下文。

source: <strong>Availability:</strong> This extension is available to both, <a href="webglrenderingcontext">WebGL1</a> and <a href="webgl2renderingcontext">WebGL2</a> contexts.
es: <strong>Disponibilidad:</strong> esta extensi&oacute;n est&aacute; disponible para los contextos <a href="webglrenderingcontext">WebGL1</a> y <a href="webgl2renderingcontext">WebGL2</a> .
ko: <strong>가용성 :</strong> 이 확장은 <a href="webglrenderingcontext">WebGL1</a> 및 <a href="webgl2renderingcontext">WebGL2</a> 컨텍스트 모두에 사용 가능 합니다.
ru: <strong>Доступность.</strong> Это расширение доступно для контекстов <a href="webglrenderingcontext">WebGL1</a> и <a href="webgl2renderingcontext">WebGL2</a> .
zh_cn: <strong>可用性：</strong>此扩展名可用于<a href="webglrenderingcontext">WebGL1</a>和<a href="webgl2renderingcontext">WebGL2</a>上下文。

source: <strong>Availability:</strong> This extension is only available to <a href="webglrenderingcontext">WebGL1</a> contexts. In <a href="webgl2renderingcontext">WebGL2</a>, the functionality of this extension is available on the WebGL2 context by default and the constants and methods are available without the "<code>ANGLE</code>" suffix.
es: <strong>Disponibilidad:</strong> esta extensi&oacute;n solo est&aacute; disponible para contextos <a href="webglrenderingcontext">WebGL1</a> . En <a href="webgl2renderingcontext">WebGL2</a> , la funcionalidad de esta extensi&oacute;n est&aacute; disponible en el contexto WebGL2 de forma predeterminada y las constantes y m&eacute;todos est&aacute;n disponibles sin el sufijo " <code>ANGLE</code> ".
ko: <strong>가용성 :</strong> 이 확장은 <a href="webglrenderingcontext">WebGL1</a> 컨텍스트 에서만 사용 가능 합니다. 에서 <a href="webgl2renderingcontext">WebGL2</a> ,이 확장 기능은 기본 및 상수 및 방법에 의해 WebGL2 컨텍스트에서 사용할 수는 "없이 사용할 수있는 <code>ANGLE</code> "접미사.
ru: <strong>Доступность:</strong> это расширение доступно только для контекстов <a href="webglrenderingcontext">WebGL1</a> . В <a href="webgl2renderingcontext">WebGL2</a> функциональность этого расширения доступна по умолчанию в контексте WebGL2, а константы и методы доступны без суффикса &laquo; <code>ANGLE</code> &raquo;.
zh_cn: <strong>可用性：</strong>此扩展仅适用于<a href="webglrenderingcontext">WebGL1</a>上下文。在<a href="webgl2renderingcontext">WebGL2中</a>，默认情况下，此扩展的功能在WebGL2上下文中可用，并且常量和方法在不带&ldquo; <code>ANGLE</code> &rdquo;后缀的情况下可用。
