Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/dom/dom.*.007.xlf
Languages: es, ko, ru, zh_cn

source: <em>This interface inherits properties from the <a href="eventtarget"><code>EventTarget</code></a> interface and <a href="windoworworkerglobalscope"><code>WindowOrWorkerGlobalScope</code></a> and <a href="windoweventhandlers"><code>WindowEventHandlers</code></a> mixins.</em>
es: <em>Propiedades Esta interfaz hereda de la <a href="eventtarget"> <code>EventTarget</code> </a> interfaz y <a href="windoworworkerglobalscope"> <code>WindowOrWorkerGlobalScope</code> </a> y <a href="windoweventhandlers"> <code>WindowEventHandlers</code> </a> mixins.</em>
ko: <em>이 인터페이스는 <a href="eventtarget"> <code>EventTarget</code> </a> 인터페이스와 <a href="windoworworkerglobalscope"> <code>WindowOrWorkerGlobalScope</code> </a> 및 <a href="windoweventhandlers"> <code>WindowEventHandlers</code> </a> 믹스 인 에서 속성을 상속합니다 .</em>
ru: <em>Этот интерфейс наследует свойства от <a href="eventtarget"> <code>EventTarget</code> </a> интерфейса и <a href="windoworworkerglobalscope"> <code>WindowOrWorkerGlobalScope</code> </a> и <a href="windoweventhandlers"> <code>WindowEventHandlers</code> </a> Mixins.</em>
zh_cn: <em>此接口从<a href="eventtarget"> <code>EventTarget</code> </a>接口以及<a href="windoworworkerglobalscope"> <code>WindowOrWorkerGlobalScope</code> </a>和<a href="windoweventhandlers"> <code>WindowEventHandlers</code> </a>混合实例继承属性。</em>

source: <em>This interface inherits properties from the <a href="eventtarget"><code>EventTarget</code></a> interface and implements properties from the <a href="windoworworkerglobalscope"><code>WindowOrWorkerGlobalScope</code></a> and <a href="windoweventhandlers"><code>WindowEventHandlers</code></a> mixins.</em>
es: <em>Esta interfaz hereda propiedades de la interfaz <a href="eventtarget"> <code>EventTarget</code> </a> e implementa propiedades de los mixins <a href="windoworworkerglobalscope"> <code>WindowOrWorkerGlobalScope</code> </a> y <a href="windoweventhandlers"> <code>WindowEventHandlers</code> </a> .</em>
ko: <em>이 인터페이스는 <a href="eventtarget"> <code>EventTarget</code> </a> 인터페이스 에서 속성을 상속 하고 <a href="windoworworkerglobalscope"> <code>WindowOrWorkerGlobalScope</code> </a> 및 <a href="windoweventhandlers"> <code>WindowEventHandlers</code> </a> 믹스 인 에서 속성을 구현합니다 .</em>
ru: <em>Этот интерфейс наследует свойства от интерфейса <a href="eventtarget"> <code>EventTarget</code> </a> и реализует свойства из <a href="windoworworkerglobalscope"> <code>WindowOrWorkerGlobalScope</code> </a> и <a href="windoweventhandlers"> <code>WindowEventHandlers</code> </a> .</em>
zh_cn: <em>该接口从<a href="eventtarget"> <code>EventTarget</code> </a>接口继承属性，并从<a href="windoworworkerglobalscope"> <code>WindowOrWorkerGlobalScope</code> </a>和<a href="windoweventhandlers"> <code>WindowEventHandlers</code> </a>混合实例实现属性。</em>

source: <em>This interface inherits properties from the <a href="workerglobalscope"><code>WorkerGlobalScope</code></a> interface, and its parent <a href="eventtarget"><code>EventTarget</code></a>, and therefore implements properties from <a href="windoworworkerglobalscope"><code>WindowTimers</code></a>, <a href="windoworworkerglobalscope"><code>WindowBase64</code></a>, and <a href="windoweventhandlers"><code>WindowEventHandlers</code></a>.</em>
es: <em>Esta interfaz hereda propiedades de la interfaz <a href="workerglobalscope"> <code>WorkerGlobalScope</code> </a> y su <a href="eventtarget"> <code>EventTarget</code> </a> principal y, por lo tanto, implementa propiedades de <a href="windoworworkerglobalscope"> <code>WindowTimers</code> </a> , <a href="windoworworkerglobalscope"> <code>WindowBase64</code> </a> y <a href="windoweventhandlers"> <code>WindowEventHandlers</code> </a> .</em>
ko: <em>이 인터페이스는 <a href="workerglobalscope"> <code>WorkerGlobalScope</code> </a> 인터페이스 및 해당 부모 <a href="eventtarget"> <code>EventTarget</code> </a> 에서 속성을 상속 하므로 <a href="windoworworkerglobalscope"> <code>WindowTimers</code> </a> , <a href="windoworworkerglobalscope"> <code>WindowBase64</code> </a> 및 <a href="windoweventhandlers"> <code>WindowEventHandlers</code> </a> 에서 속성을 구현합니다 .</em>
ru: <em>Этот интерфейс наследует свойства от интерфейса <a href="workerglobalscope"> <code>WorkerGlobalScope</code> </a> и его родительского <a href="eventtarget"> <code>EventTarget</code> </a> и поэтому реализует свойства из <a href="windoworworkerglobalscope"> <code>WindowTimers</code> </a> , <a href="windoworworkerglobalscope"> <code>WindowBase64</code> </a> и <a href="windoweventhandlers"> <code>WindowEventHandlers</code> </a> .</em>
zh_cn: <em>此接口从<a href="workerglobalscope"> <code>WorkerGlobalScope</code> </a>接口及其父<a href="eventtarget"> <code>EventTarget</code> </a>继承属性，因此从<a href="windoworworkerglobalscope"> <code>WindowTimers</code> </a>，<a href="windoworworkerglobalscope"> <code>WindowBase64</code> </a>和<a href="windoweventhandlers"> <code>WindowEventHandlers</code> </a>实现属性。</em>

source: <em>This interface inherits some of its methods from its parent, <a href="animationeffect"><code>AnimationEffect</code></a>.</em>
es: <em>Esta interfaz hereda algunos de sus m&eacute;todos de su padre, <a href="animationeffect"> <code>AnimationEffect</code> </a> .</em>
ko: <em>이 인터페이스는 부모 인 <a href="animationeffect"> <code>AnimationEffect</code> </a> 에서 일부 메소드를 상속 합니다.</em>
ru: <em>Этот интерфейс наследует некоторые из своих методов от своего родителя, <a href="animationeffect"> <code>AnimationEffect</code> </a> .</em>
zh_cn: <em>此接口从其父级<a href="animationeffect"> <code>AnimationEffect</code> </a>继承一些方法。</em>

source: <em>This interface inherits the methods of <a href="htmlelement"><code>HTMLElement</code></a>, and of <a href="element"><code>Element</code></a> and <a href="node"><code>Node</code></a>.</em>
es: <em>Esta interfaz hereda los m&eacute;todos de <a href="htmlelement"> <code>HTMLElement</code> </a> , y de <a href="element"> <code>Element</code> </a> y <a href="node"> <code>Node</code> </a> .</em>
ko: <em>이 인터페이스는 <a href="htmlelement"> <code>HTMLElement</code> </a> 와 <a href="element"> <code>Element</code> </a> 및 <a href="node"> <code>Node</code> </a> 의 메서드를 상속합니다 .</em>
ru: <em>Этот интерфейс наследует методы <a href="htmlelement"> <code>HTMLElement</code> </a> , а также <a href="element"> <code>Element</code> </a> и <a href="node"> <code>Node</code> </a> .</em>
zh_cn: <em>该接口继承了<a href="htmlelement"> <code>HTMLElement</code> </a>以及<a href="element"> <code>Element</code> </a>和<a href="node"> <code>Node</code> 的方法</a>。</em>

source: <em>This interface inherits the methods of <a href="htmlelement"><code>HTMLElement</code></a>.</em>
es: <em>Esta interfaz hereda los m&eacute;todos de <a href="htmlelement"> <code>HTMLElement</code> </a> .</em>
ko: <em>이 인터페이스는 <a href="htmlelement"> <code>HTMLElement</code> </a> 의 메소드를 상속합니다 .</em>
ru: <em>Этот интерфейс наследует методы <a href="htmlelement"> <code>HTMLElement</code> </a> .</em>
zh_cn: <em>此接口继承<a href="htmlelement"> <code>HTMLElement</code> </a>的方法。</em>

source: <em>This interface inherits the methods of its parent, <a href="htmlcollection"><code>HTMLCollection</code></a>.</em>
es: <em>Esta interfaz hereda los m&eacute;todos de su padre, <a href="htmlcollection"> <code>HTMLCollection</code> </a> .</em>
ko: <em>이 인터페이스는 부모 <a href="htmlcollection"> <code>HTMLCollection</code> </a> 의 메소드를 상속합니다 .</em>
ru: <em>Этот интерфейс наследует методы своего родителя, <a href="htmlcollection"> <code>HTMLCollection</code> </a> .</em>
zh_cn: <em>此接口继承其父<a href="htmlcollection"> <code>HTMLCollection</code> </a>的方法。</em>

source: <em>This interface inherits the methods of its parent, <a href="mediastreamtrack"><code>MediaStreamTrack</code></a>.</em>
es: <em>Esta interfaz hereda los m&eacute;todos de su padre, <a href="mediastreamtrack"> <code>MediaStreamTrack</code> </a> .</em>
ko: <em>이 인터페이스는 부모 <a href="mediastreamtrack"> <code>MediaStreamTrack</code> </a> 의 메소드를 상속합니다 .</em>
ru: <em>Этот интерфейс наследует методы его родителя, <a href="mediastreamtrack"> <code>MediaStreamTrack</code> </a> .</em>
zh_cn: <em>此接口继承其父<a href="mediastreamtrack"> <code>MediaStreamTrack</code> </a>的方法。</em>

source: <em>This interface inherits the methods of its parent, <a href="node"><code>Node</code></a><em>, and implements those of the <a href="parentnode"><code>ParentNode</code></a> interface</em></em><em>.</em>
es: <em>Esta interfaz hereda los m&eacute;todos de su padre, <a href="node"> <code>Node</code> </a><em> , e implementa los de la interfaz <a href="parentnode"> <code>ParentNode</code> </a></em></em><em> .</em>
ko: <em>이 인터페이스는 부모 인 <a href="node"> <code>Node</code> </a> 의 메소드를 상속 <em>하고 <a href="parentnode"> <code>ParentNode</code> </a> 인터페이스</em></em><em> 의 메소드를 </em><em><em>구현합니다</em></em><em> .</em>
ru: <em>Этот интерфейс наследует методы его родителя, <a href="node"> <code>Node</code> </a><em> , и реализует <a href="parentnode"> <code>ParentNode</code> </a> интерфейса ParentNode</em></em><em> .</em>
zh_cn: <em>此接口继承其父<a href="node"> <code>Node</code> </a>的方法<em>，并实现<a href="parentnode"> <code>ParentNode</code> </a>接口的方法</em></em><em>。</em>

source: <em>This interface inherits the properties of <a href="htmlelement"><code>HTMLElement</code></a>, and of <a href="element"><code>Element</code></a> and <a href="node"><code>Node</code></a>.</em>
es: <em>Esta interfaz hereda las propiedades de <a href="htmlelement"> <code>HTMLElement</code> </a> , y de <a href="element"> <code>Element</code> </a> y <a href="node"> <code>Node</code> </a> .</em>
ko: <em>이 인터페이스는 <a href="htmlelement"> <code>HTMLElement</code> </a> 와 <a href="element"> <code>Element</code> </a> 및 <a href="node"> <code>Node</code> </a> 의 속성을 상속합니다 .</em>
ru: <em>Этот интерфейс наследует свойства <a href="htmlelement"> <code>HTMLElement</code> </a> , а также <a href="element"> <code>Element</code> </a> и <a href="node"> <code>Node</code> </a> .</em>
zh_cn: <em>此接口继承<a href="htmlelement"> <code>HTMLElement</code> </a>以及<a href="element"> <code>Element</code> </a>和<a href="node"> <code>Node</code> </a>的属性。</em>

source: <em>This interface inherits the properties of <a href="htmlelement"><code>HTMLElement</code></a>.</em>
es: <em>Esta interfaz hereda las propiedades de <a href="htmlelement"> <code>HTMLElement</code> </a> .</em>
ko: <em>이 인터페이스는 <a href="htmlelement"> <code>HTMLElement</code> </a> 의 속성을 상속합니다 .</em>
ru: <em>Этот интерфейс наследует свойства <a href="htmlelement"> <code>HTMLElement</code> </a> .</em>
zh_cn: <em>此接口继承<a href="htmlelement"> <code>HTMLElement</code> </a>的属性。</em>

source: <em>This interface inherits the properties of its parent, <a href="htmlcollection"><code>HTMLCollection</code></a>.</em>
es: <em>Esta interfaz hereda las propiedades de su padre, <a href="htmlcollection"> <code>HTMLCollection</code> </a> .</em>
ko: <em>이 인터페이스는 부모 <a href="htmlcollection"> <code>HTMLCollection</code> </a> 의 속성을 상속합니다 .</em>
ru: <em>Этот интерфейс наследует свойства своего родителя, <a href="htmlcollection"> <code>HTMLCollection</code> </a> .</em>
zh_cn: <em>此接口继承其父<a href="htmlcollection"> <code>HTMLCollection</code> </a>的属性。</em>

source: <em>This interface inherits the properties of its parent, <a href="mediastreamtrack"><code>MediaStreamTrack</code></a>.</em>
es: <em>Esta interfaz hereda las propiedades de su padre, <a href="mediastreamtrack"> <code>MediaStreamTrack</code> </a> .</em>
ko: <em>이 인터페이스는 부모 <a href="mediastreamtrack"> <code>MediaStreamTrack</code> </a> 의 속성을 상속합니다 .</em>
ru: <em>Этот интерфейс наследует свойства своего родителя, <a href="mediastreamtrack"> <code>MediaStreamTrack</code> </a> .</em>
zh_cn: <em>此接口继承其父<a href="mediastreamtrack"> <code>MediaStreamTrack</code> </a>的属性。</em>

source: <em>This interface neither implements, nor inherits, any properties.</em>
es: <em>Esta interfaz no implementa ni hereda ninguna propiedad.</em>
ko: <em>이 인터페이스는 어떠한 속성도 구현하거나 상속하지 않습니다.</em>
ru: <em>Этот интерфейс не реализует и не наследует никаких свойств.</em>
zh_cn: <em>此接口既不实现也不继承任何属性。</em>

source: <em>This interface neither inherits, nor implements, any method.</em>
es: <em>Esta interfaz no hereda ni implementa ning&uacute;n m&eacute;todo.</em>
ko: <em>이 인터페이스는 어떤 메소드도 상속 받거나 구현하지 않습니다.</em>
ru: <em>Этот интерфейс не наследует и не реализует какой-либо метод.</em>
zh_cn: <em>该接口既不继承也不实现任何方法。</em>

source: <em>This interface neither inherits, nor implements, any property.</em>
es: <em>Esta interfaz no hereda ni implementa ninguna propiedad.</em>
ko: <em>이 인터페이스는 어떤 속성도 상속 받거나 구현하지 않습니다.</em>
ru: <em>Этот интерфейс не наследует и не реализует какое-либо свойство.</em>
zh_cn: <em>此接口既不继承也不实现任何属性。</em>

source: <em>This interface not provide any specific properties, but inherits properties from its parent interface, <a href="svgcomponenttransferfunctionelement"><code>SVGComponentTransferFunctionElement</code></a>.</em>
es: <em>Esta interfaz no proporciona propiedades espec&iacute;ficas, pero hereda propiedades de su interfaz principal, <a href="svgcomponenttransferfunctionelement"> <code>SVGComponentTransferFunctionElement</code> </a> .</em>
ko: <em>이 인터페이스는 특정 속성을 제공하지 않지만 상위 인터페이스 <a href="svgcomponenttransferfunctionelement"> <code>SVGComponentTransferFunctionElement</code> </a> 에서 속성을 상속합니다 .</em>
ru: <em>Этот интерфейс не предоставляет никаких конкретных свойств, но наследует свойства от своего родительского интерфейса, <a href="svgcomponenttransferfunctionelement"> <code>SVGComponentTransferFunctionElement</code> </a> .</em>
zh_cn: <em>该接口不提供任何特定的属性，但是从其父接口<a href="svgcomponenttransferfunctionelement"> <code>SVGComponentTransferFunctionElement</code> </a>继承属性。</em>

source: <em>This interface not provide any specific properties, but inherits properties from its parent interface, <a href="svgelement"><code>SVGElement</code></a>, and also implements properties of <a href="svgfilterprimitivestandardattributes"><code>SVGFilterPrimitiveStandardAttributes</code></a>.</em>
es: <em>Esta interfaz no proporciona propiedades espec&iacute;ficas, pero hereda propiedades de su interfaz principal, <a href="svgelement"> <code>SVGElement</code> </a> , y tambi&eacute;n implementa propiedades de <a href="svgfilterprimitivestandardattributes"> <code>SVGFilterPrimitiveStandardAttributes</code> </a> .</em>
ko: <em>이 인터페이스는 특정 속성 만 상속 속성을 부모 인터페이스에서 제공하지 <a href="svgelement"> <code>SVGElement</code> </a> 도, 그리고 구현 속성 <a href="svgfilterprimitivestandardattributes"> <code>SVGFilterPrimitiveStandardAttributes</code> 을</a> .</em>
ru: <em>Этот интерфейс не предоставляет никаких конкретных свойств, но наследует свойства от своего родительского интерфейса <a href="svgelement"> <code>SVGElement</code> </a> , а также реализует свойства <a href="svgfilterprimitivestandardattributes"> <code>SVGFilterPrimitiveStandardAttributes</code> </a> .</em>
zh_cn: <em>该接口不提供任何特定的属性，但是从其父接口<a href="svgelement"> <code>SVGElement</code> </a>继承属性，并且还实现<a href="svgfilterprimitivestandardattributes"> <code>SVGFilterPrimitiveStandardAttributes</code> 的</a>属性。</em>

source: <em>This method has no parameters, and returns nothing.</em>
es: <em>Este m&eacute;todo no tiene par&aacute;metros y no devuelve nada.</em>
ko: <em>이 메소드에는 매개 변수가 없으며 아무것도 리턴하지 않습니다.</em>
ru: <em>Этот метод не имеет параметров и ничего не возвращает.</em>
zh_cn: <em>此方法没有参数，并且不返回任何内容。</em>

source: <em>This method is non-standard and not part of any specification, though it was present in early drafts of <a href="https://drafts.csswg.org/css-animations/">CSS Animations</a>.</em>
es: <em>Este m&eacute;todo no es est&aacute;ndar y no forma parte de ninguna especificaci&oacute;n, aunque estuvo presente en los primeros borradores de <a href="https://drafts.csswg.org/css-animations/">animaciones CSS</a> .</em>
ko: <em>이 방법은 비표준이며 사양의 일부가 아니지만 <a href="https://drafts.csswg.org/css-animations/">CSS Animations</a> 초안에 존재했습니다 .</em>
ru: <em>Этот метод является нестандартным и не является частью какой-либо спецификации, хотя он присутствовал в ранних проектах <a href="https://drafts.csswg.org/css-animations/">CSS Animations</a> .</em>
zh_cn: <em>尽管此方法在<a href="https://drafts.csswg.org/css-animations/">CSS动画的</a>早期草稿中存在，但它不是标准的，也不是任何规范的一部分。</em>

source: <em>This page is currently incomplete and under active construction. Please be aware that it's not going to answer all of your questions just yet.</em>
es: <em>Esta p&aacute;gina est&aacute; actualmente incompleta y en construcci&oacute;n activa. Tenga en cuenta que todav&iacute;a no va a responder todas sus preguntas.</em>
ko: <em>이 페이지는 현재 불완전하며 현재 건설 중입니다. 아직 모든 질문에 답변하지는 않습니다.</em>
ru: <em>Эта страница в настоящее время неполная и находится в стадии активной разработки. Пожалуйста, имейте в виду, что он пока не ответит на все ваши вопросы.</em>
zh_cn: <em>该页面目前不完整，正在建设中。请注意，它还不能回答您所有的问题。</em>

source: <em>This property is not part of any specification. See <a href="../mouseevent/pagex"><code>MouseEvent.pageX</code></a> instead.</em>
es: <em>Esta propiedad no forma parte de ninguna especificaci&oacute;n. Ver <a href="../mouseevent/pagex"> <code>MouseEvent.pageX</code> en su</a> lugar.</em>
ko: <em>이 속성은 사양의 일부가 아닙니다. 대신 <a href="../mouseevent/pagex"> <code>MouseEvent.pageX</code> </a> 를 참조하십시오 .</em>
ru: <em>Это свойство не является частью какой-либо спецификации. Вместо этого смотрите <a href="../mouseevent/pagex"> <code>MouseEvent.pageX</code> </a> .</em>
zh_cn: <em>此属性不是任何规范的一部分。请参阅<a href="../mouseevent/pagex"> <code>MouseEvent.pageX</code> </a>。</em>

source: <em>This property is not part of any specification.</em>
es: <em>Esta propiedad no forma parte de ninguna especificaci&oacute;n.</em>
ko: <em>이 속성은 사양의 일부가 아닙니다.</em>
ru: <em>Это свойство не является частью какой-либо спецификации.</em>
zh_cn: <em>此属性不是任何规范的一部分。</em>

source: <em>This would be a nice place to have a diagram showing the relationships between these segments of the resource loading time.</em>
es: <em>Este ser&iacute;a un buen lugar para tener un diagrama que muestre las relaciones entre estos segmentos del tiempo de carga de recursos.</em>
ko: <em>이것은 리소스 로딩 시간의이 세그먼트들 사이의 관계를 보여주는 다이어그램을 갖는 좋은 장소입니다.</em>
ru: <em>Это было бы хорошим местом, чтобы иметь диаграмму, показывающую отношения между этими сегментами времени загрузки ресурса.</em>
zh_cn: <em>拥有一个显示资源加载时间的这些部分之间的关​​系的图表的好地方。</em>

source: <em>Up-mix discrete channels.</em>
es: <em>Mezclar canales discretos.</em>
ko: <em>개별 채널을 업 믹스합니다.</em>
ru: <em>Микширование дискретных каналов.</em>
zh_cn: <em>上混离散通道。</em>

source: <em>Up-mix from mono to 5.1.</em>
es: <em>Up-mix de mono a 5.1.</em>
ko: <em>모노에서 5.1로 업 믹스.</em>
ru: <em>Микширование с моно до 5.1.</em>
zh_cn: <em>从单声道上混到5.1。</em>

source: <em>Up-mix from mono to quad.</em>
es: <em>Mezcla ascendente de mono a cu&aacute;druple.</em>
ko: <em>모노에서 쿼드로 업 믹스.</em>
ru: <em>Повышенное микширование от моно до четырех.</em>
zh_cn: <em>从单声道到四声道上混。</em>

source: <em>Up-mix from mono to stereo</em>.
es: <em>Mezcla ascendente de mono a est&eacute;reo</em> .
ko: <em>모노에서 스테레오로 업 믹스</em> .
ru: <em>Микширование от моно до стерео</em> .
zh_cn: <em>从单声道到立体声上混</em>。

source: <em>Up-mix from quad to 5.1.</em>
es: <em>Up-mix de quad a 5.1.</em>
ko: <em>쿼드에서 5.1로 업 믹스.</em>
ru: <em>Повышенное микширование с четырёх до 5.1.</em>
zh_cn: <em>从四声道上混到5.1。</em>

source: <em>Up-mix from stereo to 5.1.</em>
es: <em>Mezcla ascendente desde est&eacute;reo a 5.1.</em>
ko: <em>스테레오에서 5.1로 업 믹스합니다.</em>
ru: <em>Микширование со стерео до 5.1.</em>
zh_cn: <em>从立体声上混到5.1。</em>

source: <em>Up-mix from stereo to quad.</em>
es: <em>Mezcla ascendente de est&eacute;reo a cu&aacute;druple.</em>
ko: <em>스테레오에서 쿼드로 업 믹스.</em>
ru: <em>Микширование от стерео до четырех.</em>
zh_cn: <em>从立体声上混到四声道。</em>

source: <em>WebGL by example</em> is a series of live samples with short explanations that showcase WebGL concepts and capabilities. The examples are sorted according to topic and level of difficulty, covering the WebGL rendering context, shader programming, textures, geometry, user interaction, and more.
es: <em>WebGL, por ejemplo,</em> es una serie de muestras en vivo con explicaciones breves que muestran conceptos y capacidades de WebGL. Los ejemplos se ordenan seg&uacute;n el tema y el nivel de dificultad, cubriendo el contexto de representaci&oacute;n de WebGL, la programaci&oacute;n del sombreador, las texturas, la geometr&iacute;a, la interacci&oacute;n del usuario y m&aacute;s.
ko: <em>예를 들어 WebGL</em> 은 WebGL 개념과 기능을 보여주는 간단한 설명과 함께 일련의 라이브 샘플입니다. WebGL 렌더링 컨텍스트, 쉐이더 프로그래밍, 텍스처, 지오메트리, 사용자 상호 작용 등을 다루는 주제 및 난이도에 따라 예제가 정렬됩니다.
ru: <em>WebGL в качестве примера</em> представляет собой серию живых примеров с краткими пояснениями, которые демонстрируют концепции и возможности WebGL. Примеры отсортированы по тематике и уровню сложности, включая контекст рендеринга WebGL, программирование шейдеров, текстуры, геометрию, взаимодействие с пользователем и многое другое.
zh_cn: <em>通过示例，WebGL</em>是一系列实时示例，其中简短说明了WebGL的概念和功能。根据主题和难易程度对示例进行了排序，涵盖了WebGL渲染上下文，着色器编程，纹理，几何图形，用户交互等。

source: <em>array</em> is an <a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Array"><code>Array</code></a> of <a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/ArrayBuffer"><code>ArrayBuffer</code></a>, <a href="../arraybufferview"><code>ArrayBufferView</code></a>, <a href="../blob"><code>Blob</code></a>, <a href="../domstring"><code>DOMString</code></a> objects, or a mix of any of such objects, that will be put inside the <a href="../blob"><code>Blob</code></a>. DOMStrings are encoded as UTF-8.
es: <em>La matriz</em> es una <a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Array"> <code>Array</code> </a> de <a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/ArrayBuffer"> <code>ArrayBuffer</code> </a> , <a href="../arraybufferview"> <code>ArrayBufferView</code> </a> , <a href="../blob"> <code>Blob</code> </a> , <a href="../domstring"> <code>DOMString</code> </a> , o una combinaci&oacute;n de cualquiera de dichos objetos, que se colocar&aacute; dentro del <a href="../blob"> <code>Blob</code> </a> . Las DOMStrings est&aacute;n codificadas como UTF-8.
ko: <em>어레이</em> 인 <a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Array"> <code>Array</code> </a> 의 <a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/ArrayBuffer"> <code>ArrayBuffer</code> </a> , <a href="../arraybufferview"> <code>ArrayBufferView</code> </a> , <a href="../blob"> <code>Blob</code> </a> , <a href="../domstring"> <code>DOMString</code> 에의</a> 공진 영역 넣어지게 오브젝트 또는 오브젝트의 임의의 조합, <a href="../blob"> <code>Blob</code> </a> . DOMString은 UTF-8로 인코딩됩니다.
ru: <em>массив</em> - это <a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Array"> <code>Array</code> </a> объектов <a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/ArrayBuffer"> <code>ArrayBuffer</code> </a> , <a href="../arraybufferview"> <code>ArrayBufferView</code> </a> , <a href="../blob"> <code>Blob</code> </a> , <a href="../domstring"> <code>DOMString</code> </a> или смесь любых таких объектов, которые будут помещены в <a href="../blob"> <code>Blob</code> </a> . DOMStrings кодируются как UTF-8.
zh_cn: <em>阵列</em>是一个<a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Array"> <code>Array</code> </a>的<a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/ArrayBuffer"> <code>ArrayBuffer</code> </a>，<a href="../arraybufferview"> <code>ArrayBufferView</code> </a>，<a href="../blob"> <code>Blob</code> </a>，<a href="../domstring"> <code>DOMString</code> </a>对象，或任何这样的物体的混合物，将在内部放<a href="../blob"> <code>Blob</code> </a>。DOMString编码为UTF-8。

source: <em>base </em>Optional
es: <em>base</em> opcional
ko: <em>기본</em> 옵션
ru: <em>база</em> опционально
zh_cn: <em>基本</em>可选
