Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/dom/dom.*.007.xlf
Languages: es, ko, ru, zh_cn

source: <em><code>propertyName</code></em> is a <a href="../domstring"><code>DOMString</code></a> that is the name of the CSS property at the specified index.
es: <em> <code>propertyName</code> </em> es un<a href="../domstring"> <code>DOMString</code> </a> que es el nombre de la propiedad CSS en el &iacute;ndice especificado.
ko: <em> <code>propertyName</code> </em> 은지정된 인덱스의 CSS 속성 이름 인<a href="../domstring"> <code>DOMString</code> </a> 입니다.
ru: <em> <code>propertyName</code> </em> - это<a href="../domstring"> <code>DOMString</code> ,</a> которая является именем свойства CSS по указанному индексу.
zh_cn: <em> <code>propertyName</code> </em>是一个<a href="../domstring"> <code>DOMString</code> </a>，它是指定索引处CSS属性的名称。

source: <em><code>referenceNode</code></em> is <strong>not</strong> an optional parameter -- you must explicitly pass a <code>Node</code> or <code>null</code>. Failing to provide it or passing invalid values may <a href="https://code.google.com/p/chromium/issues/detail?id=419780">behave</a><a href="https://bugzilla.mozilla.org/show_bug.cgi?id=119489">differently</a> in different browser versions.
es: <em> <code>referenceNode</code> </em><strong> no</strong> esun par&aacute;metro opcional: debe pasar expl&iacute;citamente un <code>Node</code> o un <code>null</code> . No proporcionarlo o pasar valores no v&aacute;lidos puede<a href="https://code.google.com/p/chromium/issues/detail?id=419780"> comportarse de manera </a><a href="https://bugzilla.mozilla.org/show_bug.cgi?id=119489">diferente</a> en diferentes versiones del navegador.
ko: <em> <code>referenceNode</code> </em> 는선택적 매개 변수가<strong> 아닙니다</strong> . 명시 적으로 <code>Node</code> 또는 <code>null</code> 을 전달해야합니다. 를 제공하기 위해 실패 또는 수 유효하지 않은 값을 전달<a href="https://code.google.com/p/chromium/issues/detail?id=419780"> 행동 </a><a href="https://bugzilla.mozilla.org/show_bug.cgi?id=119489">다르게</a> 다른 브라우저 버전에서.
ru: <em> <code>referenceNode</code> </em> это<strong> не</strong> необязательный параметр - вы должны явно передать <code>Node</code> или <code>null</code> . Неспособность предоставить его или передача неверных значений может<a href="https://code.google.com/p/chromium/issues/detail?id=419780"> вести себя по- </a><a href="https://bugzilla.mozilla.org/show_bug.cgi?id=119489">разному</a> в разных версиях браузера.
zh_cn: <em> <code>referenceNode</code> </em>是<strong>不是</strong>一个可选参数-你必须明确地传递一个 <code>Node</code> 或 <code>null</code> 。在不同的浏览器版本中，不提供它或传递无效值可能会<a href="https://code.google.com/p/chromium/issues/detail?id=419780">表现</a><a href="https://bugzilla.mozilla.org/show_bug.cgi?id=119489">不同</a>。

source: <em><code>str</code></em> is the string representation of selection.
es: <em> <code>str</code> </em> es la representaci&oacute;n de cadena de selecci&oacute;n.
ko: <em> <code>str</code> </em> 은 선택의 문자열 표현입니다.
ru: <em> <code>str</code> </em> - строковое представление выбора.
zh_cn: <em> <code>str</code> </em>是选择的字符串表示形式。

source: <em><code>string:</code></em><strong>Returns / Sets </strong>the directionality of the element.
es: <em> <code>string:</code> </em><strong> Devuelve / Establece</strong> la direccionalidad del elemento.
ko: <em> <code>string:</code> </em><strong> 반환 /</strong> 요소의 방향성을<strong> 설정</strong> 합니다.
ru: <em> <code>string:</code> </em><strong> возвращает / устанавливает</strong> направленность элемента.
zh_cn: <em> <code>string:</code> </em><strong>返回/设置</strong>元素的方向性。

source: <em><code>string:</code></em><strong>Returns / Sets</strong> the default value as originally specified in the HTML that created this object.
es: <em> <code>string:</code> </em><strong> Devuelve / Establece</strong> el valor predeterminado como se especific&oacute; originalmente en el HTML que cre&oacute; este objeto.
ko: <em> <code>string:</code> </em> 이 객체를 만든 HTML에 원래 지정된 기본값을<strong> 반환</strong> 합니다.
ru: <em> <code>string:</code> </em><strong> Возвращает / Устанавливает</strong> значение по умолчанию, как изначально указано в HTML, который создал этот объект.
zh_cn: <em> <code>string:</code> </em><strong>返回/设置</strong>默认值，该默认值最初是在创建此对象的HTML中指定的。

source: <em><code>string</code>: </em><strong>Returns / Sets </strong>the element's <code><a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/input#attr-placeholder">placeholder</a></code> attribute, containing a hint to the user of what can be entered in the control. The placeholder text must not contain carriage returns or line-feeds. This attribute applies when the value of the <code><a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/input#attr-type">type</a></code> attribute is <code>text</code>, <code>search</code>, <code>tel</code>, <code>url</code> or <code>email</code>; otherwise it is ignored.
es: <em> <code>string</code> : </em><strong>Devuelve / Establece</strong> elatributo de <code><a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/input#attr-placeholder">placeholder</a></code> de posici&oacute;n del elemento, que contiene una pista para el usuario de lo que se puede ingresar en el control. El texto del marcador de posici&oacute;n no debe contener retornos de carro o avances de l&iacute;nea. Este atributo se aplica cuando el valor delatributo <code><a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/input#attr-type">type</a></code> es <code>text</code> , <code>search</code> , <code>tel</code> , <code>url</code> o <code>email</code> ; de lo contrario se ignora.
ko: <em> <code>string</code> : </em><strong>Returns /</strong> 컨트롤에 입력 할 수있는 힌트를 포함하는요소의 <code><a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/input#attr-placeholder">placeholder</a></code> 속성을<strong> 설정</strong> 합니다. 자리 표시 자 텍스트에는 캐리지 리턴 또는 줄 바꿈이 포함되지 않아야합니다. 이 속성은 <code><a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/input#attr-type">type</a></code> 속성값이 <code>text</code> , <code>search</code> , <code>tel</code> , <code>url</code> 또는 <code>email</code> 일때 적용됩니다. 그렇지 않으면 무시됩니다.
ru: <em> <code>string</code> : </em><strong>Возвращает / Устанавливает</strong> атрибут <code><a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/input#attr-placeholder">placeholder</a></code> элемента, содержащий подсказку пользователю о том, что можно ввести в элемент управления. Текст заполнителя не должен содержать возврат каретки или перевод строки. Этот атрибут применяется, когда значениематрибута <code><a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/input#attr-type">type</a></code> является <code>text</code> , <code>search</code> , <code>tel</code> , <code>url</code> или <code>email</code> ; в противном случае это игнорируется.
zh_cn: <em> <code>string</code> ：</em><strong>返回/设置</strong>元素的 <code><a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/input#attr-placeholder">placeholder</a></code> 属性，其中包含向用户提示可以在控件中输入的内容。占位符文本不得包含回车符或换行符。当 <code><a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/input#attr-type">type</a></code> 属性的值为 <code>text</code> ， <code>search</code> ， <code>tel</code> ， <code>url</code> 或 <code>email</code> 时，此属性适用；否则将被忽略。

source: <em><code>string</code>: </em><strong>Returns / Sets</strong> the element's <code><a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/input#attr-accept">accept</a></code> attribute, containing comma-separated list of file types accepted by the server when <code><a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/input#attr-type">type</a></code> is <code>file</code>.
es: <em> <code>string</code> : </em><strong>Devuelve / Establece</strong> elatributo <code><a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/input#attr-accept">accept</a></code> del elemento, que contiene una lista separada por comas de tipos de archivos aceptados por el servidor cuando <code><a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/input#attr-type">type</a></code> es <code>file</code> .
ko: <em> <code>string</code> : </em><strong>반환 값 / </strong> <code><a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/input#attr-type">type</a></code> 이 <code>file</code> 일 때 서버에서 허용하는 쉼표로 구분 된 파일 형식 목록을 포함하는 요소의 <code><a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/input#attr-accept">accept</a></code> 속성을<strong> 설정 </strong>합니다 .
ru: <em> <code>string</code> : </em><strong>Возвращает / Устанавливает</strong> атрибут <code><a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/input#attr-accept">accept</a></code> элемента, содержащий разделенный запятыми список типов файлов, принимаемых сервером, когда <code><a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/input#attr-type">type</a></code> is <code>file</code> .
zh_cn: <em> <code>string</code> ：</em><strong>返回/设置</strong>元素的 <code><a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/input#attr-accept">accept</a></code> 属性，包含 <code><a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/input#attr-type">type</a></code> 为 <code>file</code> 时服务器接受的文件类型的逗号分隔列表。

source: <em><code>string</code>: </em><strong>Returns / Sets</strong> the element's <code><a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/input#attr-alt">alt</a></code> attribute, containing alternative text to use when <code><a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/input#attr-type">type</a></code> is <code>image.</code>
es: <em> <code>string</code> : </em><strong>Devuelve / Establece</strong> elatributo <code><a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/input#attr-alt">alt</a></code> del elemento, que contiene texto alternativo para usar cuando <code><a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/input#attr-type">type</a></code> es <code>image.</code>
ko: <em> <code>string</code> : </em><strong>Returns / </strong> <code><a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/input#attr-type">type</a></code> 이 <code>image.</code> 때 사용할 대체 텍스트를 포함하는 요소의 <code><a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/input#attr-alt">alt</a></code> 속성을<strong> 설정</strong> 합니다 .
ru: <em> <code>string</code> : </em><strong>Возвращает / Устанавливает</strong> атрибут <code><a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/input#attr-alt">alt</a></code> элемента, содержащий альтернативный текст, который используется, когда <code><a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/input#attr-type">type</a></code> является <code>image.</code>
zh_cn: <em> <code>string</code> ：</em><strong>返回/设置</strong>元素的 <code><a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/input#attr-alt">alt</a></code> 属性，其中包含当 <code><a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/input#attr-type">type</a></code> 为 <code>image.</code> 时要使用的替代文本。

source: <em><code>string</code>: </em><strong>Returns / Sets</strong> the element's <code><a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/input#attr-autocomplete">autocomplete</a></code> attribute, indicating whether the value of the control can be automatically completed by the browser. Ignored if the value of the <code><a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/input#attr-type">type</a></code> attribute is <code>hidden</code>, <code>checkbox</code>, <code>radio</code>, <code>file</code>, or a button type (<code>button</code>, <code>submit</code>, <code>reset</code>, <code>image</code>). Possible values are:
es: <em> <code>string</code> : </em><strong>Devuelve / Establece</strong> elatributo de <code><a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/input#attr-autocomplete">autocomplete</a></code> del elemento, indicando si el navegador puede completar autom&aacute;ticamente el valor del control. Se ignora si el valor delatributo <code><a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/input#attr-type">type</a></code> est&aacute; <code>hidden</code> , <code>checkbox</code> , <code>radio</code> , <code>file</code> o un tipo de <code>button</code> ( bot&oacute;n , <code>submit</code> , <code>reset</code> , <code>image</code> n ). Los valores posibles son:
ko: <em> <code>string</code> : </em><strong>반환 /</strong> 요소가 <code><a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/input#attr-autocomplete">autocomplete</a></code> 속성을<strong> 설정</strong> 하여 브라우저에서 제어 값을 자동으로 완료 할 수 있는지 여부를 나타냅니다. <code><a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/input#attr-type">type</a></code> 속성값이 <code>hidden</code> 있는지, <code>checkbox</code> , <code>radio</code> , <code>file</code> 또는 버튼 유형 ( <code>button</code> , <code>submit</code> , <code>reset</code> , <code>image</code> )은무시됩니다. 가능한 값은 다음과 같습니다.
ru: <em> <code>string</code> : </em><strong>Возвращает / Устанавливает</strong> атрибут <code><a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/input#attr-autocomplete">autocomplete</a></code> элемента, указывающий, может ли значение элемента управления автоматически заполняться браузером. Игнорируется, если значениеатрибута <code><a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/input#attr-type">type</a></code> <code>hidden</code> , <code>checkbox</code> , <code>radio</code> , <code>file</code> или тип <code>button</code> ( кнопка , <code>submit</code> , <code>reset</code> , <code>image</code> ). Возможные значения:
zh_cn: <em> <code>string</code> ：</em><strong>返回/设置</strong>元素的 <code><a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/input#attr-autocomplete">autocomplete</a></code> 属性，指示控件的值是否可以由浏览器自动完成。忽略 <code><a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/input#attr-type">type</a></code> 属性的值是 <code>hidden</code> ， <code>checkbox</code> ， <code>radio</code> ， <code>file</code> 或按钮类型（ <code>button</code> ， <code>submit</code> ， <code>reset</code> ， <code>image</code> ）。可能的值为：

source: <em><code>string</code>: </em><strong>Returns / Sets</strong> the element's <code><a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/input#attr-formaction">formaction</a></code> attribute, containing the URI of a program that processes information submitted by the element. This overrides the <code><a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/form#attr-action">action</a></code> attribute of the parent form.
es: <em> <code>string</code> : </em><strong>Devuelve / Establece</strong> elatributo de <code><a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/input#attr-formaction">formaction</a></code> del elemento, que contiene el URI de un programa que procesa la informaci&oacute;n enviada por el elemento. Esto anula elatributo de <code><a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/form#attr-action">action</a></code> del formulario principal.
ko: <em> <code>string</code> : </em><strong>반환 /</strong> 요소가제출 한 정보를 처리하는 프로그램의 URI를 포함하는 요소의 <code><a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/input#attr-formaction">formaction</a></code> 속성을<strong> 설정</strong> 합니다. 이것은부모 폼의 <code><a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/form#attr-action">action</a></code> 속성보다 우선합니다.
ru: <em> <code>string</code> : </em><strong>Возвращает / Устанавливает</strong> атрибут <code><a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/input#attr-formaction">formaction</a></code> элемента, содержащий URI программы, которая обрабатывает информацию, представленную элементом. Это отменяет <code><a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/form#attr-action">action</a></code> атрибута родительской формы.
zh_cn: <em> <code>string</code> ：</em><strong>返回/设置</strong>元素的 <code><a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/input#attr-formaction">formaction</a></code> 属性，其中包含处理该元素提交的信息的程序的URI。这将覆盖父表单的 <code><a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/form#attr-action">action</a></code> 属性。

source: <em><code>string</code>: </em><strong>Returns / Sets</strong> the element's <code><a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/input#attr-height">height</a></code> attribute, which defines the height of the image displayed for the button, if the value of <code><a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/input#attr-type">type</a></code> is <code>image</code>.
es: <em> <code>string</code> : </em><strong>Devuelve / Establece</strong> elatributo de <code><a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/input#attr-height">height</a></code> del elemento, que define la altura de la imagen que se muestra para el bot&oacute;n, si el valor de <code><a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/input#attr-type">type</a></code> es <code>image</code> n .
ko: <em> <code>string</code> : </em><strong>반환</strong> 값 / <code><a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/input#attr-type">type</a></code> 값이 <code>image</code> 인 경우 버튼에 표시되는 이미지의 높이를 정의하는 요소의 <code><a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/input#attr-height">height</a></code> 속성을<strong> 설정</strong> 합니다.
ru: <em> <code>string</code> : </em><strong>Возвращает / Устанавливает</strong> атрибут <code><a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/input#attr-height">height</a></code> элемента, который определяет высоту изображения, отображаемого для кнопки, если значением <code><a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/input#attr-type">type</a></code> является <code>image</code> .
zh_cn: <em> <code>string</code> ：</em><strong>返回/设置</strong>元素的 <code><a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/input#attr-height">height</a></code> 属性，如果 <code><a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/input#attr-type">type</a></code> 的值为 <code>image</code> ，则该属性定义为按钮显示的图像的高度。

source: <em><code>string</code>: </em><strong>Returns</strong> a string containing a single character that switches input focus to the control when pressed.
es: <em> <code>string</code> : </em><strong>Devuelve</strong> una cadena que contiene un solo car&aacute;cter que cambia el foco de entrada al control cuando se presiona.
ko: <em> <code>string</code> :</em> 누르면 입력 포커스를 컨트롤로 전환하는 단일 문자가 포함 된 문자열을<strong> 반환</strong> 합니다.
ru: <em> <code>string</code> : </em><strong>возвращает</strong> строку, содержащую один символ, который при нажатии переключает фокус ввода на элемент управления.
zh_cn: <em> <code>string</code> ：</em><strong>返回</strong>一个包含单个字符的字符串，当按下该字符时会将输入焦点切换到控件。

source: <em><code>string</code>:</em><strong>Returns / Sets</strong> the direction in which selection occurred. Possible values are:
es: <em> <code>string</code> : </em><strong>Devuelve / Establece</strong> la direcci&oacute;n en la que ocurri&oacute; la selecci&oacute;n. Los valores posibles son:
ko: <em> <code>string</code> : </em><strong>반환 /</strong> 선택이 발생한 방향을<strong> 설정</strong> 합니다. 가능한 값은 다음과 같습니다.
ru: <em> <code>string</code> : </em><strong>Возвращает / Устанавливает</strong> направление выбора. Возможные значения:
zh_cn: <em> <code>string</code> ：</em><strong>返回/设置</strong>选择发生的方向。可能的值为：

source: <em><code>string</code>:</em><strong>Returns / Sets</strong> the element's <code><a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/input#attr-formenctype">formenctype</a></code> attribute, containing the type of content that is used to submit the form to the server. This overrides the <code><a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/form#attr-enctype">enctype</a></code> attribute of the parent form.
es: <em> <code>string</code> : </em><strong>Devuelve / establece</strong> elatributo <code><a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/input#attr-formenctype">formenctype</a></code> del elemento, que contiene el tipo de contenido que se utiliza para enviar el formulario al servidor. Esto anula elatributo <code><a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/form#attr-enctype">enctype</a></code> del formulario principal.
ko: <em> <code>string</code> : </em><strong>반환 /</strong> 양식을 서버에 제출하는 데 사용되는 내용의 유형을 포함하는 요소의 <code><a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/input#attr-formenctype">formenctype</a></code> 속성을<strong> 설정</strong> 합니다. 이것은부모 폼의 <code><a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/form#attr-enctype">enctype</a></code> 속성보다 우선합니다.
ru: <em> <code>string</code> : </em><strong>Возвращает / Устанавливает</strong> атрибутэлемента <code><a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/input#attr-formenctype">formenctype</a></code> , содержащий тип содержимого, которое используется для отправки формы на сервер. Это переопределяетатрибут <code><a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/form#attr-enctype">enctype</a></code> родительской формы.
zh_cn: <em> <code>string</code> ：</em><strong>返回/设置</strong>元素的 <code><a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/input#attr-formenctype">formenctype</a></code> 属性，其中包含用于将表单提交给服务器的内容类型。这将覆盖父窗体的 <code><a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/form#attr-enctype">enctype</a></code> 属性。

source: <em><code>string</code>:</em><strong>Returns / Sets</strong> the element's <code><a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/input#attr-formmethod">formmethod</a></code> attribute, containing the HTTP method that the browser uses to submit the form. This overrides the <code><a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/form#attr-method">method</a></code> attribute of the parent form.
es: <em> <code>string</code> : </em><strong>Devuelve / Establece</strong> elatributo <code><a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/input#attr-formmethod">formmethod</a></code> del elemento, que contiene el m&eacute;todo HTTP que el navegador usa para enviar el formulario. Esto anula elatributo de <code><a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/form#attr-method">method</a></code> del formulario principal.
ko: <em> <code>string</code> : </em><strong>반환 /</strong> 브라우저가 양식을 제출하는 데 사용하는 HTTP 메소드를 포함하는 요소의 <code><a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/input#attr-formmethod">formmethod</a></code> 속성을<strong> 설정</strong> 합니다. 이것은부모 폼의 <code><a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/form#attr-method">method</a></code> 속성보다 우선합니다.
ru: <em> <code>string</code> : </em><strong>возвращает / устанавливает</strong> атрибут <code><a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/input#attr-formmethod">formmethod</a></code> элемента, содержащий метод HTTP, который браузер использует для отправки формы. Это переопределяетатрибут <code><a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/form#attr-method">method</a></code> родительской формы.
zh_cn: <em> <code>string</code> ：</em><strong>返回/设置</strong>元素的 <code><a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/input#attr-formmethod">formmethod</a></code> 属性，其中包含浏览器用来提交表单的HTTP方法。这将覆盖父表单的 <code><a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/form#attr-method">method</a></code> 属性。
