Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/dom/dom.*.011.xlf
Languages: ja, ko, ru, zh_cn

source: A list of <a href="rtcrtpcodecparameters"><code>RTCRtpCodecParameters</code></a> objects which override the default preferences used by the <a href="https://developer.mozilla.org/en-US/docs/Glossary/user_agent">user agent</a> for the transceiver's codecs.
ja: トランシーバーのコーデックの<a href="https://developer.mozilla.org/en-US/docs/Glossary/user_agent">ユーザーエージェント</a>によって使用されるデフォルトの設定をオーバーライドする<a href="rtcrtpcodecparameters"> <code>RTCRtpCodecParameters</code> </a>オブジェクトのリスト。
ko: 트랜시버의 코덱에 대해 <a href="https://developer.mozilla.org/en-US/docs/Glossary/user_agent">사용자 에이전트가</a> 사용하는 기본 환경 설정을 대체하는 <a href="rtcrtpcodecparameters"> <code>RTCRtpCodecParameters</code> </a> 오브젝트 목록 .
ru: Список объектов <a href="rtcrtpcodecparameters"> <code>RTCRtpCodecParameters</code> ,</a> которые переопределяют настройки по умолчанию, используемые <a href="https://developer.mozilla.org/en-US/docs/Glossary/user_agent">пользовательским агентом</a> для кодеков приемопередатчика.
zh_cn: <a href="rtcrtpcodecparameters"> <code>RTCRtpCodecParameters</code> </a>对象的列表，这些对象将覆盖<a href="https://developer.mozilla.org/en-US/docs/Glossary/user_agent">用户代理</a>对收发器编解码器使用的默认首选项。

source: A list of JavaScript objects to output. The string representations of each of these objects are appended together in the order listed and output.
ja: 出力するJavaScriptオブジェクトのリスト。これらのオブジェクトのそれぞれの文字列表現は、リストされた順に追加されて出力されます。
ko: 출력 할 JavaScript 객체의 목록입니다. 이러한 각 객체의 문자열 표현은 나열된 순서와 출력으로 함께 추가됩니다.
ru: Список объектов JavaScript для вывода.Строковые представления каждого из этих объектов добавляются вместе в порядке перечисления и вывода.
zh_cn: 要输出的JavaScript对象的列表。这些对象的字符串表示按照列出的顺序附加在一起并输出。

source: A list of JavaScript objects to output. The string representations of each of these objects are appended together in the order listed and output. Please be warned that if you log objects in the latest versions of Chrome and Firefox what you get logged on the console is a <em>reference to the object</em>, which is not necessarily the 'value' of the object at the moment in time you call console.log(), but it is the value of the object at the moment you click it open.
ja: 出力するJavaScriptオブジェクトのリスト。これらの各オブジェクトの文字列表現は、リストされた順序で一緒に追加され、出力されます。ChromeとFirefoxの最新バージョンでオブジェクトをログに記録する場合、コンソールに記録さ<em>れるのはオブジェクトへの参照</em>であり、コンソールを呼び出す時点のオブジェクトの「値」とは限りません。 log（）ですが、クリックして開いたときのオブジェクトの値です。
ko: 출력 할 JavaScript 객체의 목록입니다. 이러한 각 객체의 문자열 표현은 나열된 순서와 출력으로 함께 추가됩니다. 최신 버전의 Chrome 및 Firefox에서 객체를 기록하는 경우 콘솔에 기록 되는 것은 <em>객체에</em> 대한 <em>참조</em> 이며 콘솔을 호출하는 순간 객체의 '값'일 필요는 없습니다. log ()이지만 클릭 한 순간의 객체 값입니다.
ru: Список объектов JavaScript для вывода. Строковые представления каждого из этих объектов добавляются вместе в указанном порядке и выводятся. Имейте в виду, что если вы регистрируете объекты в последних версиях Chrome и Firefox, то, что вы регистрируете в консоли, является <em>ссылкой на объект</em> , который не обязательно является &laquo;значением&raquo; объекта в тот момент времени, когда вы вызываете console. log (), но это значение объекта на момент открытия.
zh_cn: 要输出的JavaScript对象的列表。这些对象的每个字符串表示形式都按列出的顺序附加在一起并输出。请注意，如果您在最新版本的Chrome和Firefox中记录<em>对象</em>，则在控制台上记录的内容是<em>对该对象</em>的<em>引用</em>，这不一定是您在调用控制台时该对象的&ldquo;值&rdquo;。 log（），但这是单击对象时打开该对象时的值。

source: A list of encodings to allow when sending RTP media from the <a href="../rtcrtpsender"><code>RTCRtpSender</code></a>. Each entry is of type <a href="../rtcrtpencodingparameters"><code>RTCRtpEncodingParameters</code></a>.
ja: <a href="../rtcrtpsender"> <code>RTCRtpSender</code> </a>からRTPメディアを送信するときに許可するエンコーディングのリスト。各エントリのタイプは<a href="../rtcrtpencodingparameters"> <code>RTCRtpEncodingParameters</code> </a>です。
ko: <a href="../rtcrtpsender"> <code>RTCRtpSender</code> </a> 에서 RTP 미디어를 보낼 때 허용되는 인코딩 목록입니다 . 각 항목은 <a href="../rtcrtpencodingparameters"> <code>RTCRtpEncodingParameters</code> </a> 유형 입니다 .
ru: Список кодировок, разрешенных при отправке RTP-медиа из <a href="../rtcrtpsender"> <code>RTCRtpSender</code> </a> . Каждая запись имеет тип <a href="../rtcrtpencodingparameters"> <code>RTCRtpEncodingParameters</code> </a> .
zh_cn: 从<a href="../rtcrtpsender"> <code>RTCRtpSender</code> </a>发送RTP媒体时允许使用的编码列表。每个条目的类型为<a href="../rtcrtpencodingparameters"> <code>RTCRtpEncodingParameters</code> </a>。

source: A list of encodings to allow when sending RTP media from the <a href="rtcrtpsender"><code>RTCRtpSender</code></a>. Each entry is of type <a href="rtcrtpencodingparameters"><code>RTCRtpEncodingParameters</code></a>.
ja: <a href="rtcrtpsender"> <code>RTCRtpSender</code> </a>からRTPメディアを送信するときに許可するエンコーディングのリスト。各エントリのタイプは<a href="rtcrtpencodingparameters"> <code>RTCRtpEncodingParameters</code> </a>です。
ko: <a href="rtcrtpsender"> <code>RTCRtpSender</code> </a> 에서 RTP 미디어를 보낼 때 허용되는 인코딩 목록입니다 . 각 항목은 <a href="rtcrtpencodingparameters"> <code>RTCRtpEncodingParameters</code> </a> 유형 입니다 .
ru: Список кодировок, разрешенных при отправке RTP-медиа из <a href="rtcrtpsender"> <code>RTCRtpSender</code> </a> . Каждая запись имеет тип <a href="rtcrtpencodingparameters"> <code>RTCRtpEncodingParameters</code> </a> .
zh_cn: 从<a href="rtcrtpsender"> <code>RTCRtpSender</code> </a>发送RTP媒体时允许使用的编码列表。每个条目的类型为<a href="rtcrtpencodingparameters"> <code>RTCRtpEncodingParameters</code> </a>。

source: A list of explicitly <em>observed</em><a href="../performanceentry"><code>PerformanceEntry</code></a> objects that have the specified <code>type</code>. The items will be in chronological order based on the entries' <a href="../performanceentry/starttime"><code>startTime</code></a>. If no objects have the specified <code>type</code>, or no argument is provided, an empty list is returned.
ja: 指定された <code>type</code> の明示的に監視<em>された</em><a href="../performanceentry"> <code>PerformanceEntry</code> </a>オブジェクトのリスト。項目は、エントリの<a href="../performanceentry/starttime"> <code>startTime</code> に</a>基づいて時系列に並べられます。指定された <code>type</code> オブジェクトがない場合、または引数が指定されていない場合は、空のリストが返されます。
ko: 지정된 <code>type</code> 을 갖는 명시 적으로 <em>관찰 된 </em><a href="../performanceentry"> <code>PerformanceEntry</code> </a> 객체 의 목록입니다 . 항목은 항목의 <a href="../performanceentry/starttime"> <code>startTime</code> </a> 에 따라 시간 순서대로 정렬 됩니다. 지정된 <code>type</code> 을 가진 객체가 없거나 인수가 제공되지 않으면 빈 목록이 반환됩니다.
ru: Список явно <em>наблюдаемых</em> объектов <a href="../performanceentry"> <code>PerformanceEntry</code> </a> , имеющих указанный <code>type</code> . Элементы будут в хронологическом порядке, основанном на элементах <a href="../performanceentry/starttime"> <code>startTime</code> </a> . Если ни один объект не имеет указанного <code>type</code> или аргумент не предоставлен, возвращается пустой список.
zh_cn: 具有指定 <code>type</code> 的明确<em>观察到的</em><a href="../performanceentry"> <code>PerformanceEntry</code> </a>对象的列表。这些项目将基于条目的<a href="../performanceentry/starttime"> <code>startTime</code> </a>按时间顺序排列。如果没有对象具有指定的 <code>type</code> ，或者不提供任何参数，则返回一个空列表。

source: A list of explicitly <em>observed</em><a href="../performanceentry"><code>PerformanceEntry</code></a> objects that meets the criteria of the filter. The items will be in chronological order based on the entries' <a href="../performanceentry/starttime"><code>startTime</code></a>. If no objects that meet the filter are found, an empty list is returned. If no argument is given, all entries are returned.
ja: フィルターの条件を満たす、明示的に監視<em>された</em><a href="../performanceentry"> <code>PerformanceEntry</code> </a>オブジェクトのリスト。項目は、エントリの<a href="../performanceentry/starttime"> <code>startTime</code> に</a>基づいて時系列に並べられます。フィルターを満たすオブジェクトが見つからない場合、空のリストが返されます。引数を指定しない場合、すべてのエントリが返されます。
ko: 필터 기준을 충족시키는 명시 적으로 <em>관찰 된 </em><a href="../performanceentry"> <code>PerformanceEntry</code> </a> 객체 의 목록입니다 . 항목은 항목의 <a href="../performanceentry/starttime"> <code>startTime</code> </a> 에 따라 시간 순서대로 정렬 됩니다. 필터를 충족하는 개체가 없으면 빈 목록이 반환됩니다. 인수가 제공되지 않으면 모든 항목이 리턴됩니다.
ru: Список явно <em>наблюдаемых</em> объектов <a href="../performanceentry"> <code>PerformanceEntry</code> ,</a> который соответствует критериям фильтра. Элементы будут в хронологическом порядке, основанном на элементах <a href="../performanceentry/starttime"> <code>startTime</code> </a> . Если не найдено объектов, соответствующих фильтру, возвращается пустой список. Если аргумент не указан, возвращаются все записи.
zh_cn: 符合过滤条件的明确<em>观察到的</em><a href="../performanceentry"> <code>PerformanceEntry</code> </a>对象的列表。这些项目将基于条目的<a href="../performanceentry/starttime"> <code>startTime</code> </a>按时间顺序排列。如果找不到符合过滤条件的对象，则返回一个空列表。如果未提供任何参数，则返回所有条目。

source: A list of explicitly <em>observed</em><a href="../performanceentry">performance entry</a> objects that have the specified <code>name</code> and <code>type</code>. If the <code>type</code> argument is not specified, only the <code>name</code> will be used to determine the entries to return. The items will be in chronological order based on the entries' <a href="../performanceentry/starttime"><code>startTime</code></a>. If no objects meet the specified criteria, an empty list is returned.
ja: 指定された <code>name</code> と <code>type</code> を持つ、明示的に監視<em>された</em><a href="../performanceentry">パフォーマンスエントリ</a>オブジェクトのリスト。 <code>type</code> 引数が指定されていない場合は、 <code>name</code> だけが返されるエントリを決定するために使用されます。項目は、エントリの<a href="../performanceentry/starttime"> <code>startTime</code> に</a>基づいて時系列に並べられます。指定した条件を満たすオブジェクトがない場合は、空のリストが返されます。
ko: 지정된 <code>name</code> 과 <code>type</code> 을 갖는 명시 적으로 <em>관찰 된 </em><a href="../performanceentry">성능 항목</a> 개체 의 목록입니다 . 는 IF <code>type</code> 인수를 지정하지 만 <code>name</code> 반환 할 항목을 결정하는 데 사용됩니다. 항목은 항목의 <a href="../performanceentry/starttime"> <code>startTime</code> </a> 에 따라 시간 순서대로 정렬 됩니다. 지정된 기준에 맞는 개체가 없으면 빈 목록이 반환됩니다.
ru: Список явно <em>наблюдаемых</em> объектов <a href="../performanceentry">ввода производительности,</a> которые имеют указанные <code>name</code> и <code>type</code> . Если аргумент <code>type</code> не указан, только <code>name</code> будет использоваться для определения возвращаемых записей. Элементы будут в хронологическом порядке, основанном на элементах <a href="../performanceentry/starttime"> <code>startTime</code> </a> . Если ни один объект не соответствует указанным критериям, возвращается пустой список.
zh_cn: 具有指定 <code>name</code> 和 <code>type</code> 的明确<em>观察到的</em><a href="../performanceentry">性能条目</a>对象的列表。如果未指定 <code>type</code> 参数，则仅使用 <code>name</code> 来确定要返回的条目。这些项目将基于条目的<a href="../performanceentry/starttime"> <code>startTime</code> </a>按时间顺序排列。如果没有对象符合指定的条件，则返回一个空列表。

source: A list of module names (e.g., Core, HTML, XML, etc) is available in the DOM Level 2 <a href="http://www.w3.org/TR/DOM-Level-2-Core/introduction.html#ID-Conformance-h2">Conformance Section</a>
ja: モジュール名のリスト（コア、HTML、XMLなど）は、DOMレベル2 <a href="http://www.w3.org/TR/DOM-Level-2-Core/introduction.html#ID-Conformance-h2">適合性セクションで</a>入手できます。
ko: 모듈 이름 (예 : Core, HTML, XML 등) 목록은 DOM Level 2 <a href="http://www.w3.org/TR/DOM-Level-2-Core/introduction.html#ID-Conformance-h2">Conformance 섹션</a> 에서 확인할 수 있습니다.
ru: Список имен модулей (например, Core, HTML, XML и т.д.) доступен в 2 DOM Level <a href="http://www.w3.org/TR/DOM-Level-2-Core/introduction.html#ID-Conformance-h2">Раздел Conformance</a>
zh_cn: 模块名称（例如，Core，HTML，XML等）列表在DOM Level 2 <a href="http://www.w3.org/TR/DOM-Level-2-Core/introduction.html#ID-Conformance-h2">一致性部分中提供</a>

source: A list of module names (e.g., Core, HTML, XML, etc) is available in the DOM Level 2 <a href="https://www.w3.org/TR/DOM-Level-2-Core/introduction.html#ID-Conformance-h2">Conformance Section</a>
ja: モジュール名（コア、HTML、XMLなど）のリストは、DOMレベル2<a href="https://www.w3.org/TR/DOM-Level-2-Core/introduction.html#ID-Conformance-h2">適合セクションで</a>入手できます。

source: A list of the audio tracks currently contained inside the <code>SourceBuffer</code>.
ja: <code>SourceBuffer</code> 内に現在含まれているオーディオトラックのリスト。
ko: 현재 <code>SourceBuffer</code> 내에 포함 된 오디오 트랙 목록입니다 .
ru: Список звуковых дорожек, которые в настоящее время содержатся внутри <code>SourceBuffer</code> .
zh_cn: 当前包含在 <code>SourceBuffer</code> 中的音轨列表。

source: A list of the names of <a href="https://developer.mozilla.org/en/IndexedDB#gloss_index">indexes</a> on objects in this object store.
ja: このオブジェクトストア内のオブジェクトの<a href="https://developer.mozilla.org/en/IndexedDB#gloss_index">インデックス</a>名のリスト。
ko: 이 객체 저장소에있는 객체 의 <a href="https://developer.mozilla.org/en/IndexedDB#gloss_index">색인</a> 이름 목록입니다 .
ru: Список имен <a href="https://developer.mozilla.org/en/IndexedDB#gloss_index">индексов</a> для объектов в этом хранилище объектов.
zh_cn: 此对象存储中对象<a href="https://developer.mozilla.org/en/IndexedDB#gloss_index">索引</a>的名称列表。

source: A list of the names of the <a href="https://developer.mozilla.org/en/IndexedDB#gloss_index">indexes</a> on this object store.
ja: このオブジェクトストアの<a href="https://developer.mozilla.org/en/IndexedDB#gloss_index">インデックス</a>の名前のリスト。
ko: 이 오브젝트 저장소 의 <a href="https://developer.mozilla.org/en/IndexedDB#gloss_index">인덱스</a> 이름 목록입니다 .
ru: Список имен <a href="https://developer.mozilla.org/en/IndexedDB#gloss_index">индексов</a> в этом хранилище объектов.
zh_cn: 此对象存储上<a href="https://developer.mozilla.org/en/IndexedDB#gloss_index">索引</a>名称的列表。

source: A list of the text tracks currently contained inside the <code>SourceBuffer</code>.
ja: <code>SourceBuffer</code> 内に現在含まれているテキストトラックのリスト。
ko: 현재 <code>SourceBuffer</code> 내에 포함 된 텍스트 트랙 목록입니다 .
ru: Список текстовых дорожек, в настоящее время содержащихся внутри <code>SourceBuffer</code> .
zh_cn: 当前在 <code>SourceBuffer</code> 中包含的文本轨道的列表。

source: A list of the video tracks currently contained inside the <code>SourceBuffer</code>.
ja: <code>SourceBuffer</code> 内に現在含まれているビデオトラックのリスト。
ko: <code>SourceBuffer</code> 내에 현재 포함 된 비디오 트랙 목록입니다 .
ru: Список видео дорожек, которые в настоящее время содержатся внутри <code>SourceBuffer</code> .
zh_cn: 当前包含在 <code>SourceBuffer</code> 中的视频轨道的列表。

source: A list of thresholds, sorted in increasing numeric order, where each threshold is a ratio of intersection area to bounding box area of an observed target. Notifications for a target are generated when any of the thresholds are crossed for that target. If no value was passed to the constructor, 0 is used.
ja: 各しきい値は、観測されたターゲットのバウンディングボックスの面積に対する交点の面積の比率です。ターゲットに対する通知は、ターゲットのしきい値のいずれかが交差したときに生成されます。コンストラクタに値が渡されなかった場合は 0 が使用されます。
ko: 각 임계 값은 관측 대상의 경계 상자 영역에 대한 교차 영역의 비율 인 숫자 순으로 정렬 된 임계 값 목록입니다. 대상에 대한 알림은 해당 대상에 대한 임계 값이 초과 될 때 생성됩니다. 생성자에 값이 전달되지 않은 경우 0이 사용됩니다.
ru: Список порогов,отсортированных в возрастающем числовом порядке,где каждый порог представляет собой отношение площади пересечения к площади ограничивающего окошка наблюдаемой цели.Уведомления о цели генерируются при пересечении любого из порогов для этой цели.Если в конструктор не было передано ни одного значения,то используется значение 0.
zh_cn: 阈值列表,按递增的数字顺序排列,其中每个阈值是观察到的目标的交点面积与边界框面积的比率。当目标的任何一个阈值被跨越时,就会产生该目标的通知。如果没有向构造函数传递值,则使用0。

source: A list of valid code values is found in the <a href="https://www.w3.org/TR/uievents-code/#key-alphanumeric-writing-system">UI Events KeyboardEvent code Values</a> spec.
ja: 有効なコード値のリストは、<a href="https://www.w3.org/TR/uievents-code/#key-alphanumeric-writing-system">UIイベントのKeyboardEventコード値の</a>仕様に記載されています。
ko: 유효한 코드 값 목록은 <a href="https://www.w3.org/TR/uievents-code/#key-alphanumeric-writing-system">UI Events KeyboardEvent code Values</a> spec에 있습니다.
ru: Список допустимых значений кода находится в спецификации <a href="https://www.w3.org/TR/uievents-code/#key-alphanumeric-writing-system">значений кода KeyboardEvent событий пользовательского интерфейса</a> .
zh_cn: 在<a href="https://www.w3.org/TR/uievents-code/#key-alphanumeric-writing-system">UI事件KeyboardEvent代码值</a>规范中可以找到有效代码值的列表。

source: A list. Note that the border box doesn't include the number, so neither do the client rects.
ja: リストです。ボーダーボックスには番号が含まれていないことに注意してください。
ko: 목록. 테두리 상자에는 숫자가 포함되어 있지 않으므로 클라이언트도 수정하지 않습니다.
ru: Список.Обратите внимание,что в поле "Граница" не указан номер,поэтому и клиент не перечисляет.
zh_cn: 一个列表。请注意,边框不包括数字,所以客户端的rects也不包括。

source: A listener for the <code><code><a href="https://developer.mozilla.org/en-US/docs/Web/Events/dragenter">dragenter</a></code></code> and <code><code><a href="https://developer.mozilla.org/en-US/docs/Web/Events/dragover">dragover</a></code></code> events are used to indicate valid drop targets, that is, places where dragged items may be dropped. Most areas of a web page or application are not valid places to drop data. Thus, the default handling of these events is not to allow a drop.
ja: リスナー <code><code><a href="https://developer.mozilla.org/en-US/docs/Web/Events/dragenter">dragenter</a></code></code> と <code><code><a href="https://developer.mozilla.org/en-US/docs/Web/Events/dragover">dragover</a></code></code> イベントが有効なドロップターゲットを示すために使用されている、あること、アイテムをドラッグした場所がドロップすることができます。Webページまたはアプリケーションのほとんどの領域は、データをドロップするための有効な場所ではありません。したがって、これらのイベントのデフォルトの処理では、ドロップが許可されていません。
ko: <code><code><a href="https://developer.mozilla.org/en-US/docs/Web/Events/dragenter">dragenter</a></code></code> 및 <code><code><a href="https://developer.mozilla.org/en-US/docs/Web/Events/dragover">dragover</a></code></code> 이벤트 의 리스너 는 유효한 놓기 대상, 즉 끌어온 항목을 놓을 수있는 위치를 나타내는 데 사용됩니다. 웹 페이지 나 응용 프로그램의 대부분의 영역은 데이터를 삭제하기에 적합한 장소가 아닙니다. 따라서 이러한 이벤트의 기본 처리는 삭제를 허용하지 않는 것입니다.
ru: Слушатель для <code><code><a href="https://developer.mozilla.org/en-US/docs/Web/Events/dragenter">dragenter</a></code></code> и <code><code><a href="https://developer.mozilla.org/en-US/docs/Web/Events/dragover">dragover</a></code></code> события используется для указания действительных целей падения, то есть места , где тянулись предметы могут быть отброшены. Большинство областей веб-страницы или приложения не являются допустимыми местами для сброса данных. Таким образом, обработка этих событий по умолчанию не допускает удаления.
zh_cn: <code><code><a href="https://developer.mozilla.org/en-US/docs/Web/Events/dragenter">dragenter</a></code></code> 和 <code><code><a href="https://developer.mozilla.org/en-US/docs/Web/Events/dragover">dragover</a></code></code> 事件的侦听器用于指示有效的放置目标，也就是放置放置拖动项的位置。网页或应用程序的大多数区域都不是放置数据的有效位置。因此，这些事件的默认处理是不允许丢弃。

source: A little vanilla framework
ja: ちょっとしたバニラフレームワーク
ko: 작은 바닐라 프레임 워크
ru: Немного ванильного каркаса
zh_cn: 一个小小的香草框架

source: A live version of this application is available on <a href="https://mdn.github.io/dom-examples/pointerevents/Using_Pointer_Events.html">GitHub</a>. The <a href="https://github.com/mdn/dom-examples/blob/master/pointerevents/Using_Pointer_Events.html">source code is available on Github</a> and pull requests and bug reports are welcome.
ja: このアプリケーションのライブバージョンは<a href="https://mdn.github.io/dom-examples/pointerevents/Using_Pointer_Events.html">GitHub</a>で入手できます。<a href="https://github.com/mdn/dom-examples/blob/master/pointerevents/Using_Pointer_Events.html">ソースコードはGitHubの上で利用可能である</a>とプル要求やバグレポートは歓迎されています。
ko: 이 애플리케이션의 라이브 버전은 <a href="https://mdn.github.io/dom-examples/pointerevents/Using_Pointer_Events.html">GitHub에서</a> 사용할 수 있습니다 . <a href="https://github.com/mdn/dom-examples/blob/master/pointerevents/Using_Pointer_Events.html">GitHub에서 소스 코드를 얻을 수있다</a> 및 풀 요청 및 버그 보고서를 환영합니다.
ru: Живая версия этого приложения доступна на <a href="https://mdn.github.io/dom-examples/pointerevents/Using_Pointer_Events.html">GitHub</a> . <a href="https://github.com/mdn/dom-examples/blob/master/pointerevents/Using_Pointer_Events.html">Исходный код доступен на Github</a> и тянуть запросы и сообщения об ошибках приветствуются.
zh_cn: 该应用程序的实时版本可在<a href="https://mdn.github.io/dom-examples/pointerevents/Using_Pointer_Events.html">GitHub上获得</a>。该<a href="https://github.com/mdn/dom-examples/blob/master/pointerevents/Using_Pointer_Events.html">源代码可在Github上</a>，并拉动需求和bug报告都欢迎。

source: A local file is dragged using the <code>application/x-moz-file</code> type with a data value that is an <a href="https://developer.mozilla.org/en/XPCOM_Interface_Reference/nsIFile">nsIFile</a> object. Non-privileged web pages are not able to retrieve or modify data of this type. Because a file is not a string, you must use the <a href="https://developer.mozilla.org/en-US/docs/Web/API/DataTransfer/mozSetDataAt"><code>mozSetDataAt()</code></a> method to assign the data. Similarly, when retrieving the data, you must use the <a href="https://developer.mozilla.org/en-US/docs/Web/API/DataTransfer/mozGetDataAt"><code>mozGetDataAt()</code></a> method.
ja: ローカルファイルは、<a href="https://developer.mozilla.org/en/XPCOM_Interface_Reference/nsIFile">nsIFile</a>オブジェクトであるデータ値とともに <code>application/x-moz-file</code> タイプを使用してドラッグされます。非特権Webページは、このタイプのデータを取得または変更できません。ファイルは文字列ではないため、データを割り当てるには<a href="https://developer.mozilla.org/en-US/docs/Web/API/DataTransfer/mozSetDataAt"> <code>mozSetDataAt()</code> </a>メソッドを使用する必要があります。同様に、データを取得するときは、<a href="https://developer.mozilla.org/en-US/docs/Web/API/DataTransfer/mozGetDataAt"> <code>mozGetDataAt()</code> </a>メソッドを使用する必要があります。
ko: <a href="https://developer.mozilla.org/en/XPCOM_Interface_Reference/nsIFile">nsIFile</a> 객체 인 data 값과 함께 <code>application/x-moz-file</code> 유형을 사용하여 로컬 파일을 드래그 합니다. 권한이없는 웹 페이지는이 유형의 데이터를 검색하거나 수정할 수 없습니다. 파일은 문자열이 아니므로 <a href="https://developer.mozilla.org/en-US/docs/Web/API/DataTransfer/mozSetDataAt"> <code>mozSetDataAt()</code> </a> 메소드를 사용하여 데이터를 지정해야합니다. 마찬가지로 데이터를 검색 할 때 <a href="https://developer.mozilla.org/en-US/docs/Web/API/DataTransfer/mozGetDataAt"> <code>mozGetDataAt()</code> </a> 메소드를 사용해야합니다 .
ru: Локальный файл перетаскивается с использованием типа <code>application/x-moz-file</code> со значением данных, которое является объектом <a href="https://developer.mozilla.org/en/XPCOM_Interface_Reference/nsIFile">nsIFile</a> . Непривилегированные веб-страницы не могут получать или изменять данные этого типа. Поскольку файл не является строкой, вы должны использовать метод <a href="https://developer.mozilla.org/en-US/docs/Web/API/DataTransfer/mozSetDataAt"> <code>mozSetDataAt()</code> </a> для назначения данных. Аналогично, при получении данных вы должны использовать метод <a href="https://developer.mozilla.org/en-US/docs/Web/API/DataTransfer/mozGetDataAt"> <code>mozGetDataAt()</code> </a> .
zh_cn: 使用 <code>application/x-moz-file</code> 类型将本地文件拖到<a href="https://developer.mozilla.org/en/XPCOM_Interface_Reference/nsIFile">nsIFile</a>对象作为数据值。非特权网页无法检索或修改此类型的数据。由于文件不是字符串，因此必须使用<a href="https://developer.mozilla.org/en-US/docs/Web/API/DataTransfer/mozSetDataAt"> <code>mozSetDataAt()</code> </a>方法分配数据。同样，检索数据时，必须使用<a href="https://developer.mozilla.org/en-US/docs/Web/API/DataTransfer/mozGetDataAt"> <code>mozGetDataAt()</code> </a>方法。

source: A long integer indicating the number of RTP packets sent...
ja: 送信された RTP パケットの数を示す長い整数。
ko: 전송 된 RTP 패킷 수를 나타내는 긴 정수 ...
ru: Длинное целое число,указывающее количество отправленных RTP-пакетов...
zh_cn: 一个长的整数,表示发送RTP数据包的数量......
