Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/dom/dom.*.011.xlf
Languages: ja, ko, ru, zh_cn

source: A new <a href="../mediastreamaudiodestinationnode"><code>MediaStreamAudioDestinationNode</code></a> object instance.
ja: 新しい<a href="../mediastreamaudiodestinationnode"> <code>MediaStreamAudioDestinationNode</code> </a>オブジェクトインスタンス。
ko: 새로운 <a href="../mediastreamaudiodestinationnode"> <code>MediaStreamAudioDestinationNode</code> </a> 객체 인스턴스.
ru: Новый <a href="../mediastreamaudiodestinationnode"> <code>MediaStreamAudioDestinationNode</code> </a> объекта MediaStreamAudioDestinationNode .
zh_cn: 一个新的<a href="../mediastreamaudiodestinationnode"> <code>MediaStreamAudioDestinationNode</code> </a>对象实例。

source: A new <a href="../mediastreamaudiosourcenode"><code>MediaStreamAudioSourceNode</code></a> object instance.
ja: 新しい<a href="../mediastreamaudiosourcenode"> <code>MediaStreamAudioSourceNode</code> </a>オブジェクトインスタンス。
ko: 새로운 <a href="../mediastreamaudiosourcenode"> <code>MediaStreamAudioSourceNode</code> </a> 객체 인스턴스.
ru: Новый <a href="../mediastreamaudiosourcenode"> <code>MediaStreamAudioSourceNode</code> </a> объекта MediaStreamAudioSourceNode .
zh_cn: 一个新的<a href="../mediastreamaudiosourcenode"> <code>MediaStreamAudioSourceNode</code> </a>对象实例。

source: A new <a href="../mediastreamtrack"><code>MediaStreamTrack</code></a> instance which is identical to the one on which <code>clone()</code> was called, except its ID is a new, unique, value.
ja: IDが新しい一意の値であることを除いて、 <code>clone()</code> が呼び出されたインスタンスと同じ新しい<a href="../mediastreamtrack"> <code>MediaStreamTrack</code> </a>インスタンス。
ko: ID가 새롭고 고유 한 값인 것을 제외하고 <code>clone()</code> 이 호출 된 인스턴스와 동일한 새 <a href="../mediastreamtrack"> <code>MediaStreamTrack</code> </a> 인스턴스 .
ru: Новый экземпляр <a href="../mediastreamtrack"> <code>MediaStreamTrack</code> ,</a> который идентичен тому, для которого вызывался <code>clone()</code> , за исключением того, что его идентификатор является новым уникальным значением.
zh_cn: 一个新的<a href="../mediastreamtrack"> <code>MediaStreamTrack</code> </a>实例，该实例与调用 <code>clone()</code> 的实例相同，但其ID是一个新的唯一值。

source: A new <a href="../mediastreamtrackevent"><code>MediaStreamTrackEvent</code></a>, initialized based on the provided options.
ja: 提供されたオプションに基づいて初期化された新しい<a href="../mediastreamtrackevent"> <code>MediaStreamTrackEvent</code> </a>。
ko: 제공된 옵션을 기반으로 초기화 된 새로운 <a href="../mediastreamtrackevent"> <code>MediaStreamTrackEvent</code> </a>
ru: Новый <a href="../mediastreamtrackevent"> <code>MediaStreamTrackEvent</code> </a> , инициализированный на основе предоставленных параметров.
zh_cn: 一个新的<a href="../mediastreamtrackevent"> <code>MediaStreamTrackEvent</code> </a>，基于提供的选项进行了初始化。

source: A new <a href="../mutationobserver"><code>MutationObserver</code></a> object configured to call the specified callback when DOM mutations occur.
ja: DOMの変更が発生したときに、指定されたコールバックを呼び出すように構成された新しい<a href="../mutationobserver"> <code>MutationObserver</code> </a>オブジェクト。
ko: DOM 돌연변이가 발생할 때 지정된 콜백을 호출하도록 구성된 새로운 <a href="../mutationobserver"> <code>MutationObserver</code> </a> 객체.
ru: Новый объект <a href="../mutationobserver"> <code>MutationObserver</code> ,</a> настроенный для вызова указанного обратного вызова при возникновении мутаций DOM.
zh_cn: 一个新的<a href="../mutationobserver"> <code>MutationObserver</code> </a>对象，配置为在发生DOM突变时调用指定的回调。

source: A new <a href="../offlineaudiocompletionevent"><code>OfflineAudioCompletionEvent</code></a> object instance.
ja: 新しい<a href="../offlineaudiocompletionevent"> <code>OfflineAudioCompletionEvent</code> </a>オブジェクトインスタンス。
ko: 새로운 <a href="../offlineaudiocompletionevent"> <code>OfflineAudioCompletionEvent</code> </a> 객체 인스턴스
ru: Новый <a href="../offlineaudiocompletionevent"> <code>OfflineAudioCompletionEvent</code> </a> объекта OfflineAudioCompletionEvent .
zh_cn: 一个新的<a href="../offlineaudiocompletionevent"> <code>OfflineAudioCompletionEvent</code> </a>对象实例。

source: A new <a href="../offlineaudiocontext"><code>OfflineAudioContext</code></a> object whose associated <code>AudioBuffer</code> is configured as requested.
ja: 関連付けられた <code>AudioBuffer</code> が要求どおりに構成された新しい<a href="../offlineaudiocontext"> <code>OfflineAudioContext</code> </a>オブジェクト。
ko: 연결된 <code>AudioBuffer</code> 가 요청한대로 구성된 새 <a href="../offlineaudiocontext"> <code>OfflineAudioContext</code> </a> 개체입니다 .
ru: Новый объект <a href="../offlineaudiocontext"> <code>OfflineAudioContext</code> ,</a> чей связанный <code>AudioBuffer</code> настроен в соответствии с запросом.
zh_cn: 一个新的<a href="../offlineaudiocontext"> <code>OfflineAudioContext</code> </a>对象，其关联的 <code>AudioBuffer</code> 根据请求进行配置。

source: A new <a href="../oscillatornode"><code>OscillatorNode</code></a> object instance.
ja: 新しい<a href="../oscillatornode"> <code>OscillatorNode</code> </a>オブジェクトのインスタンス。
ko: 새로운 <a href="../oscillatornode"> <code>OscillatorNode</code> </a> 객체 인스턴스.
ru: Новый экземпляр объекта <a href="../oscillatornode"> <code>OscillatorNode</code> </a> .
zh_cn: 一个新的<a href="../oscillatornode"> <code>OscillatorNode</code> </a>对象实例。

source: A new <a href="../pannernode"><code>PannerNode</code></a> object instance.
ja: 新しい<a href="../pannernode"> <code>PannerNode</code> </a>オブジェクトのインスタンス。
ko: 새로운 <a href="../pannernode"> <code>PannerNode</code> </a> 객체 인스턴스.
ru: Новый <a href="../pannernode"> <code>PannerNode</code> </a> объекта PannerNode .
zh_cn: 一个新的<a href="../pannernode"> <code>PannerNode</code> </a>对象实例。

source: A new <a href="../paymentrequest"><code>PaymentRequest</code></a> object, configured for use as configured by the input parameters.
ja: 入力パラメーターによって構成された<a href="../paymentrequest"> <code>PaymentRequest</code> </a>に使用するように構成された新しいPaymentRequestオブジェクト。
ko: 입력 매개 변수로 구성된대로 사용하도록 구성된 새 <a href="../paymentrequest"> <code>PaymentRequest</code> </a> 오브젝트.
ru: Новый объект <a href="../paymentrequest"> <code>PaymentRequest</code> </a> , настроенный для использования в соответствии с настройками входных параметров.
zh_cn: 新的<a href="../paymentrequest"> <code>PaymentRequest</code> </a>对象，配置为按输入参数配置使用。

source: A new <a href="../performanceobserver"><code>PerformanceObserver</code></a> object which will call the specified <code>callback</code> when observed performance events occur.
ja: <code>callback</code> されたパフォーマンスイベントが発生したときに指定されたコールバックを呼び出す新しい<a href="../performanceobserver"> <code>PerformanceObserver</code> </a>オブジェクト。
ko: 관찰 된 성능 이벤트가 발생할 때 지정된 <code>callback</code> 을 호출 하는 새로운 <a href="../performanceobserver"> <code>PerformanceObserver</code> </a> 객체입니다 .
ru: Новый объект <a href="../performanceobserver"> <code>PerformanceObserver</code> ,</a> который будет вызывать указанный <code>callback</code> при возникновении наблюдаемых событий производительности.
zh_cn: 一个新的<a href="../performanceobserver"> <code>PerformanceObserver</code> </a>对象，它将在观察到的性能事件发生时调用指定的 <code>callback</code> 。

source: A new <a href="../periodicwave"><code>PeriodicWave</code></a> object instance.
ja: 新しい<a href="../periodicwave"> <code>PeriodicWave</code> </a>オブジェクトのインスタンス。
ko: 새로운 <a href="../periodicwave"> <code>PeriodicWave</code> </a> 객체 인스턴스
ru: Новый экземпляр объекта <a href="../periodicwave"> <code>PeriodicWave</code> </a> .
zh_cn: 一个新的<a href="../periodicwave"> <code>PeriodicWave</code> </a>对象实例。

source: A new <a href="../range"><code>Range</code></a> object.
ja: 新しい<a href="../range"> <code>Range</code> </a>オブジェクト。
ko: 새로운 <a href="../range"> <code>Range</code> </a> 객체.
ru: Новый объект <a href="../range"> <code>Range</code> </a> .
zh_cn: 一个新的<a href="../range"> <code>Range</code> </a>对象。

source: A new <a href="../rtcdatachannel"><code>RTCDataChannel</code></a> object with the specified <code>label</code>, configured using the options specified by <code>options</code> if that parameter is included; otherwise, the defaults listed above are established.
ja: 指定された <code>label</code> を持つ新しい<a href="../rtcdatachannel"> <code>RTCDataChannel</code> </a>オブジェクト。パラメーターが含まれている場合は、optionsで指定された <code>options</code> を使用して構成されます。それ以外の場合は、上記のデフォルトが確立されます。
ko: 해당 <code>label</code> 이 포함 된 경우 <code>options</code> 에 의해 지정된 옵션을 사용하여 구성된 지정된 레이블을 가진 새로운 <a href="../rtcdatachannel"> <code>RTCDataChannel</code> </a> 객체 . 그렇지 않으면 위에 나열된 기본값이 설정됩니다.
ru: Новый объект <a href="../rtcdatachannel"> <code>RTCDataChannel</code> </a> с указанной <code>label</code> , настроенный с использованием опций, указанных <code>options</code> если этот параметр включен; в противном случае указанные выше значения по умолчанию устанавливаются.
zh_cn: 具有指定 <code>label</code> 新<a href="../rtcdatachannel"> <code>RTCDataChannel</code> </a>对象，如果包含该参数，则使用options指定的 <code>options</code> 配置；否则，将建立上面列出的默认值。

source: A new <a href="../rtcdatachannelevent"><code>RTCDataChannelEvent</code></a> configured as specified.
ja: 指定された<a href="../rtcdatachannelevent"> <code>RTCDataChannelEvent</code> </a>構成された新しいRTCDataChannelEvent。
ko: 지정된 <a href="../rtcdatachannelevent"> <code>RTCDataChannelEvent</code> </a> 구성된 새 RTCDataChannelEvent
ru: Новый <a href="../rtcdatachannelevent"> <code>RTCDataChannelEvent</code> </a> настроен как указано.
zh_cn: 按照指定配置的新<a href="../rtcdatachannelevent"> <code>RTCDataChannelEvent</code> </a>。

source: A new <a href="../rtcrtpreceiver"><code>RTCRtpReceiver</code></a> is created with a <em>new</em><a href="../mediastreamtrack"><code>MediaStreamTrack</code></a> as its <a href="../rtcrtpreceiver/track"><code>track</code></a> property (not the track specified as a parameter when calling <code>addTrack()</code>). This track's <a href="../mediastreamtrack/kind"><code>kind</code></a> is set to match the <code>kind</code> of the track provided as an input parameter.
ja: 新しい<a href="../rtcrtpreceiver"> <code>RTCRtpReceiver</code> </a>は、<em>新しい</em><a href="../mediastreamtrack"> <code>MediaStreamTrack</code> </a>をその<a href="../rtcrtpreceiver/track"> <code>track</code> </a>プロパティとして <code>addTrack()</code> 呼び出すときにパラメーターとして指定されたトラックではなく）作成されます。このトラックの<a href="../mediastreamtrack/kind"> <code>kind</code> </a>は、入力パラメーターとして提供されるトラックの種類と一致する <code>kind</code> に設定されます。
ko: 새로운 <a href="../rtcrtpreceiver"> <code>RTCRtpReceiver</code> </a> 는 <em>새로운 </em><a href="../mediastreamtrack"> <code>MediaStreamTrack</code> </a> 을 <a href="../rtcrtpreceiver/track"> <code>track</code> </a> 속성으로 추가합니다 ( <code>addTrack()</code> 호출 할 때 매개 변수로 지정된 트랙이 아님 ). 이 트랙의 <a href="../mediastreamtrack/kind"> <code>kind</code> </a> 경기로 설정되어 <code>kind</code> 입력 매개 변수로 제공되는 트랙을.
ru: Новый <a href="../rtcrtpreceiver"> <code>RTCRtpReceiver</code> </a> создается с <em>новым </em><a href="../mediastreamtrack"> <code>MediaStreamTrack</code> в</a> качестве его свойства <a href="../rtcrtpreceiver/track"> <code>track</code> </a> (а не дорожки, указанной в качестве параметра при вызове <code>addTrack()</code> ). <a href="../mediastreamtrack/kind"> <code>kind</code> </a> этой дорожки устанавливается в соответствии с <code>kind</code> дорожки, предоставленной в качестве входного параметра.
zh_cn: 新<a href="../rtcrtpreceiver"> <code>RTCRtpReceiver</code> </a>与创建<em>新</em><a href="../mediastreamtrack"> <code>MediaStreamTrack</code> </a>作为其<a href="../rtcrtpreceiver/track"> <code>track</code> </a>特性（不是调用时作为一个参数指定轨道 <code>addTrack()</code> ）。设置此轨道的<a href="../mediastreamtrack/kind"> <code>kind</code> </a>以匹配作为输入参数提供的轨道的 <code>kind</code> 。

source: A new <a href="../rtcrtptransceiver"><code>RTCRtpTransceiver</code></a> is created and associated with the new sender and receiver.
ja: 新しい<a href="../rtcrtptransceiver"> <code>RTCRtpTransceiver</code> </a>が作成され、新しい送信者と受信者に関連付けられます。
ko: 새로운 <a href="../rtcrtptransceiver"> <code>RTCRtpTransceiver</code> </a> 가 작성되어 새 발신자 및 수신자와 연관됩니다.
ru: Новый <a href="../rtcrtptransceiver"> <code>RTCRtpTransceiver</code> </a> создается и связывается с новым отправителем и получателем.
zh_cn: 创建一个新的<a href="../rtcrtptransceiver"> <code>RTCRtpTransceiver</code> </a>并将其与新的发送者和接收者关联。

source: A new <a href="../rtctrackevent"><code>RTCTrackEvent</code></a> describing a track which has been added to the <code>RTCPeerConnection</code>.
ja: 新しい<a href="../rtctrackevent"> <code>RTCTrackEvent</code> </a>に追加されたトラック記述する <code>RTCPeerConnection</code> を。
ko: 새로운 <a href="../rtctrackevent"> <code>RTCTrackEvent</code> </a> 받는 추가 된 트랙 설명 <code>RTCPeerConnection</code> 를 .
ru: Новый <a href="../rtctrackevent"> <code>RTCTrackEvent</code> ,</a> описывающий трек, который был добавлен в <code>RTCPeerConnection</code> .
zh_cn: 新<a href="../rtctrackevent"> <code>RTCTrackEvent</code> </a>描述已被添加到轨道 <code>RTCPeerConnection</code> 。

source: A new <a href="../stereopannernode"><code>StereoPannerNode</code></a> object instance.
ja: 新しい<a href="../stereopannernode"> <code>StereoPannerNode</code> </a>オブジェクトのインスタンス。
ko: 새로운 <a href="../stereopannernode"> <code>StereoPannerNode</code> </a> 객체 인스턴스
ru: Новый <a href="../stereopannernode"> <code>StereoPannerNode</code> </a> объекта StereoPannerNode .
zh_cn: 一个新的<a href="../stereopannernode"> <code>StereoPannerNode</code> </a>对象实例。

source: A new <a href="../waveshapernode"><code>WaveShaperNode</code></a> object instance.
ja: 新しい<a href="../waveshapernode"> <code>WaveShaperNode</code> </a>オブジェクトのインスタンス。
ko: 새로운 <a href="../waveshapernode"> <code>WaveShaperNode</code> </a> 객체 인스턴스
ru: Новый <a href="../waveshapernode"> <code>WaveShaperNode</code> </a> экземпляр объекта.
zh_cn: 一个新的<a href="../waveshapernode"> <code>WaveShaperNode</code> </a>对象实例。

source: A new <a href="../xmlhttprequest"><code>XMLHttpRequest</code></a> object. The object must be prepared by at least calling <a href="open"><code>open()</code></a> to initialize it before calling <a href="send"><code>send()</code></a> to send the request to the server.
ja: 新しい<a href="../xmlhttprequest"> <code>XMLHttpRequest</code> </a>オブジェクト。オブジェクトは、<a href="send"> <code>send()</code> </a>を呼び出してリクエストをサーバーに送信する前に、少なくとも<a href="open"> <code>open()</code> </a>を呼び出して初期化して準備する必要があります。
ko: 새로운 <a href="../xmlhttprequest"> <code>XMLHttpRequest</code> </a> 객체. <a href="send"> <code>send()</code> </a> 를 호출 하여 요청을 서버에 보내기 전에 최소한 <a href="open"> <code>open()</code> </a> 을 호출하여 객체 를 초기화 하여 객체를 준비해야 합니다.
ru: Новый объект <a href="../xmlhttprequest"> <code>XMLHttpRequest</code> </a> . Объект должен быть подготовлен, по крайней мере, вызовом <a href="open"> <code>open()</code> </a> для его инициализации перед вызовом <a href="send"> <code>send()</code> </a> для отправки запроса на сервер.
zh_cn: 一个新的<a href="../xmlhttprequest"> <code>XMLHttpRequest</code> </a>对象。在调用<a href="send"> <code>send()</code> </a>将请求发送到服务器之前，必须至少通过调用<a href="open"> <code>open()</code> 对其</a>进行初始化来准备该对象。

source: A new <a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Array"><code>Array</code></a>.
ja: 新しい<a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Array"> <code>Array</code> </a>。
ko: 새로운 <a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Array"> <code>Array</code> </a> .
ru: Новый <a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Array"> <code>Array</code> </a> .
zh_cn: 一个新的<a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Array"> <code>Array</code> </a>。

source: A new <code>CustomEvent</code> object of the specified type, with any other properties configured according to the <code>CustomEventInit</code> dictionary (if one was provided).
ja: 指定されたタイプの新しい <code>CustomEvent</code> オブジェクト <code>CustomEventInit</code> 辞書（提供されている場合）に従って他のプロパティが設定されています。
ko: 지정된 유형 의 새 <code>CustomEvent</code> 객체로, <code>CustomEventInit</code> 사전 (제공된 경우) 에 따라 다른 속성이 구성되어 있습니다.
ru: Новый объект <code>CustomEvent</code> указанного типа с любыми другими свойствами, настроенными в соответствии со <code>CustomEventInit</code> (если он был предоставлен).
zh_cn: 指定类型的新 <code>CustomEvent</code> 对象，具有根据 <code>CustomEventInit</code> 字典配置的任何其他属性（如果提供）。

source: A new <code>PaymentRequestUpdateEvent</code> object.<a href="https://w3c.github.io/payment-request/#paymentrequestupdateevent-interface">Payment Request API<br/><small>The definition of 'PaymentRequestUpdateEvent' in that specification.</small></a>
ja: 新しい <code>PaymentRequestUpdateEvent</code> オブジェクト。<a href="https://w3c.github.io/payment-request/#paymentrequestupdateevent-interface">Payment Request API <br/><small>その仕様における「PaymentRequestUpdateEvent」の定義。</small></a>
ko: 새로운 <code>PaymentRequestUpdateEvent</code> 객체 <a href="https://w3c.github.io/payment-request/#paymentrequestupdateevent-interface">지불 요청 API <br/><small>해당 스펙에서 'PaymentRequestUpdateEvent'의 정의.</small></a>
ru: Новый объект <code>PaymentRequestUpdateEvent</code> . <a href="https://w3c.github.io/payment-request/#paymentrequestupdateevent-interface">API запроса платежа <br/><small>Определение 'PaymentRequestUpdateEvent' в этой спецификации.</small></a>
zh_cn: 一个新的 <code>PaymentRequestUpdateEvent</code> 对象。<a href="https://w3c.github.io/payment-request/#paymentrequestupdateevent-interface">付款请求API <br/><small>该规范中&ldquo; PaymentRequestUpdateEvent&rdquo;的定义。</small></a>

source: A new <code>PromiseRejectionEvent</code> configured as specified by the parameters.
ja: パラメータで指定された <code>PromiseRejectionEvent</code> 構成された新しいPromiseRejectionEvent。
ko: 매개 변수에 지정된 <code>PromiseRejectionEvent</code> 구성된 새 PromiseRejectionEvent
ru: Новый <code>PromiseRejectionEvent</code> , настроенный в соответствии с параметрами.
zh_cn: 按照参数指定配置的新 <code>PromiseRejectionEvent</code> 。

source: A new iterator.
ja: 新しいイテレータです。
ko: 새로운 반복자.
ru: Новый итератор.
zh_cn: 一个新的迭代器。

source: A new object based on the <a href="../mediatracksupportedconstraints"><code>MediaTrackSupportedConstraints</code></a> dictionary listing the constraints supported by the user agent. Because only constraints supported by the user agent are included in the list, each of these Boolean properties has the value <code>true</code>.
ja: ユーザーエージェントがサポートする制約をリストする<a href="../mediatracksupportedconstraints"> <code>MediaTrackSupportedConstraints</code> </a>辞書に基づく新しいオブジェクト。ユーザーエージェントによってサポートされている制約のみがリストに含まれているため、これらのブール値の各プロパティの値は <code>true</code> です。
ko: 사용자 에이전트가 지원하는 제한 조건을 나열하는 <a href="../mediatracksupportedconstraints"> <code>MediaTrackSupportedConstraints</code> </a> 사전을 기반으로하는 새 오브젝트 입니다. 사용자 에이전트가 지원하는 제한 조건 만 목록에 포함되므로 이러한 각 부울 특성 값은 <code>true</code> 입니다.
ru: Новый объект на <a href="../mediatracksupportedconstraints"> <code>MediaTrackSupportedConstraints</code> </a> словаря MediaTrackSupportedConstraints, в котором перечислены ограничения, поддерживаемые пользовательским агентом. Поскольку в список включены только ограничения, поддерживаемые пользовательским агентом, каждое из этих логических свойств имеет значение <code>true</code> .
zh_cn: 基于<a href="../mediatracksupportedconstraints"> <code>MediaTrackSupportedConstraints</code> </a>词典的新对象，列出了用户代理支持的约束。因为列表中仅包括用户代理支持的约束，所以这些布尔属性的每个值都为 <code>true</code> 。

source: A new service worker is replacing the current service worker, or the current service worker is being discarded due to an install failure.
ja: 現在のサービスワーカーから新しいサービスワーカーが入れ替わっている場合や、設置障害により現在のサービスワーカーが廃棄されようとしている場合。
ko: 새 서비스 워커가 현재 서비스 워커를 교체 중이거나 설치 실패로 인해 현재 서비스 워커가 삭제되었습니다.
ru: Новый работник сервисной службы заменяет текущего работника сервисной службы,или текущий работник сервисной службы отбрасывается в связи с отказом в установке.
zh_cn: 新的服务人员正在替换当前的服务人员,或者当前的服务人员由于安装失败而被丢弃。

source: A new shader is created by calling <a href="../../webglrenderingcontext/createshader"><code>gl.createShader()</code></a>.
ja: 新しいシェーダーは<a href="../../webglrenderingcontext/createshader"> <code>gl.createShader()</code> を</a>呼び出すことによって作成されます。
ko: <a href="../../webglrenderingcontext/createshader"> <code>gl.createShader()</code> </a> 를 호출하여 새 셰이더를 만듭니다 .
ru: Новый шейдер создается путем вызова <a href="../../webglrenderingcontext/createshader"> <code>gl.createShader()</code> </a> .
zh_cn: 通过调用<a href="../../webglrenderingcontext/createshader"> <code>gl.createShader()</code> </a>创建一个新的着色器。

source: A new unordered list (<a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/ul"><code>&lt;ul&gt;</code></a>) element is created.
ja: 新しい順不同リスト（<a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/ul"> <code>&lt;ul&gt;</code> </a>）要素が作成されます。
ko: 정렬되지 않은 새 목록 ( <a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/ul"> <code>&lt;ul&gt;</code> </a> ) 요소가 작성됩니다.
ru: Новый элемент неупорядоченного списка ( <a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/ul"> <code>&lt;ul&gt;</code> </a> ) создан.
zh_cn: 创建一个新的无序列表（<a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/ul"> <code>&lt;ul&gt;</code> </a>）元素。

source: A new value to be used for the uniform variable. Possible types:
ja: 一様変数に使用される新しい値。使用可能な型。
ko: 균일 변수에 사용될 새로운 값. 가능한 유형 :
ru: Новое значение для равномерной переменной.Возможные типы:
zh_cn: 用于统一变量的新值。可能的类型。

source: A newly created <a href="../domexception"><code>DOMException</code></a> object.
ja: 新しく作成された<a href="../domexception"> <code>DOMException</code> </a>オブジェクト。
ko: 새로 작성된 <a href="../domexception"> <code>DOMException</code> </a> 객체.
ru: Недавно созданный объект <a href="../domexception"> <code>DOMException</code> </a> .
zh_cn: 新创建的<a href="../domexception"> <code>DOMException</code> </a>对象。

source: A newly created <a href="../messagechannel"><code>MessageChannel</code></a> object.
ja: 新しく作成された<a href="../messagechannel"> <code>MessageChannel</code> </a>オブジェクト。
ko: 새로 만든 <a href="../messagechannel"> <code>MessageChannel</code> </a> 객체
ru: Недавно созданный объект <a href="../messagechannel"> <code>MessageChannel</code> </a> .
zh_cn: 新创建的<a href="../messagechannel"> <code>MessageChannel</code> </a>对象。

source: A newly-created <a href="../mediastream"><code>MediaStream</code></a> object, either empty, or containing the tracks provided, if any.
ja: 新しく作成された<a href="../mediastream"> <code>MediaStream</code> </a>オブジェクト。空であるか、提供されたトラックがあればそれを含みます。
ko: 비어 있거나 제공된 트랙이있는 경우 새로 만든 <a href="../mediastream"> <code>MediaStream</code> </a> 객체입니다 (있는 경우).
ru: Вновь созданный объект <a href="../mediastream"> <code>MediaStream</code> </a> , либо пустой, либо содержащий предоставленные дорожки, если таковые имеются.
zh_cn: 新创建的<a href="../mediastream"> <code>MediaStream</code> </a>对象，该对象为空或包含提供的轨道（如果有）。

source: A newly-created <a href="../merchantvalidationevent"><code>MerchantValidationEvent</code></a> providing the information that needs to be delivered to the client-side code to present to the <a href="https://developer.mozilla.org/en-US/docs/Glossary/user_agent">user agent</a> by calling <a href="complete"><code>complete()</code></a>.
ja: 新しく作成された<a href="../merchantvalidationevent"> <code>MerchantValidationEvent</code> </a>は、<a href="complete"> <code>complete()</code> を</a>呼び出して<a href="https://developer.mozilla.org/en-US/docs/Glossary/user_agent">ユーザーエージェント</a>に提示するためにクライアント側コードに配信する必要がある情報を提供します。
ko: <a href="complete"> <code>complete()</code> </a> 를 호출 하여 <a href="https://developer.mozilla.org/en-US/docs/Glossary/user_agent">사용자 에이전트</a> 에 제공하기 위해 클라이언트 측 코드로 전달해야하는 정보를 제공 하는 새로 작성된 <a href="../merchantvalidationevent"> <code>MerchantValidationEvent</code> </a> .
ru: Недавно созданный <a href="../merchantvalidationevent"> <code>MerchantValidationEvent</code> ,</a> предоставляющий информацию, которую необходимо доставить клиентскому коду для представления <a href="https://developer.mozilla.org/en-US/docs/Glossary/user_agent">пользовательскому агенту с</a> помощью вызова <a href="complete"> <code>complete()</code> </a> .
zh_cn: 新创建的<a href="../merchantvalidationevent"> <code>MerchantValidationEvent</code> </a>提供了需要传递给客户端代码以通过调用<a href="complete"> <code>complete()</code> </a>呈现给<a href="https://developer.mozilla.org/en-US/docs/Glossary/user_agent">用户代理</a>的信息。
