Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/dom/dom.*.011.xlf
Languages: ja, ko, ru, zh_cn

source: A string describing the standard or specification as well as the currency system identifier within that system which was used to provide the <code>value</code>. This has been removed; instead of allowing sites to choose the standard to use, ISO 4217 is always used for the <code>currency</code> identifier now.
ja: 標準または仕様、および <code>value</code> を提供するために使用されたそのシステム内の通貨システム識別子を説明する文字列。これは削除されました。サイトが使用する標準を選択できるようにする代わりに、現在、ISO 4217が常に <code>currency</code> 識別子に使用されています。
ko: 표준 또는 사양 및 해당 시스템 내에서 통화 시스템 식별자를 설명하는 문자열로 <code>value</code> 을 제공하는 데 사용되었습니다 . 이것은 제거되었습니다. 사이트에서 사용할 표준을 선택할 수 있도록하는 대신, <code>currency</code> 식별자 에는 항상 ISO 4217이 사용됩니다 .
ru: Строка, описывающая стандарт или спецификацию, а также идентификатор валютной системы в этой системе, которая использовалась для предоставления <code>value</code> . Это было удалено; Вместо того, чтобы разрешать сайтам выбирать используемый стандарт, теперь для идентификатора <code>currency</code> всегда используется ISO 4217 .
zh_cn: 一个字符串，描述标准或规范以及该系统中用于提供 <code>value</code> 的货币系统标识符。这已被删除；现在，ISO 4217始终用作 <code>currency</code> 标识符，而不是允许站点选择要使用的标准。

source: A string from the <a href="../requestdestination"><code>RequestDestination</code></a> enumerated type which indicates the type of content the request is asking for. This type is much broader than the usual document type values (such as <code>"document"</code> or <code>"manifest"</code>), and may include contextual cues such as <code>"image"</code> or <code>"worker"</code> or <code>"audioworklet"</code>.
ja: リクエストが要求するコンテンツのタイプを示す<a href="../requestdestination"> <code>RequestDestination</code> </a>列挙型からの文字列。このタイプは、通常のドキュメントタイプの値（ <code>"document"</code> や <code>"manifest"</code> など）よりはるかに広く、 <code>"image"</code> や <code>"worker"</code> や <code>"audioworklet"</code> などのコンテキストキューを含めることができます。
ko: <a href="../requestdestination"> <code>RequestDestination</code> </a> 열거 형에서 요청한 내용의 유형을 나타내는 문자열 입니다. 이 유형은 일반적인 문서 유형 값 (예 : <code>"document"</code> 또는 <code>"manifest"</code> ) 보다 훨씬 광범위 하며 <code>"image"</code> 또는 <code>"worker"</code> 또는 <code>"audioworklet"</code> 과 같은 상황에 맞는 신호를 포함 할 수 있습니다 .
ru: Строка из перечислимого типа <a href="../requestdestination"> <code>RequestDestination</code> ,</a> которая указывает тип содержимого, запрашиваемого запросом. Этот тип намного шире, чем обычные значения типа документа (такие как <code>"document"</code> или <code>"manifest"</code> ), и может включать контекстные подсказки, такие как <code>"image"</code> или <code>"worker"</code> или <code>"audioworklet"</code> .
zh_cn: 来自<a href="../requestdestination"> <code>RequestDestination</code> </a>枚举类型的字符串，指示请求所请求的内容的类型。此类型比通常的文档类型值（例如 <code>"document"</code> 或 <code>"manifest"</code> ）宽得多，并且可能包括上下文提示，例如 <code>"image"</code> 或 <code>"worker"</code> 或 <code>"audioworklet"</code> 。

source: A string from the <a href="../rtcicegathererstate"><code>RTCIceGathererState</code></a> enumerated type whose value indicates the current state of the ICE agent's candidate gathering process:
ja: <a href="../rtcicegathererstate"> <code>RTCIceGathererState</code> </a>列挙型からの文字列で、その値はICEエージェントの候補収集プロセスの現在の状態を示します。
ko: ICE 에이전트 후보 수집 프로세스의 현재 상태를 나타내는 값 이 <a href="../rtcicegathererstate"> <code>RTCIceGathererState</code> </a> 열거 유형 의 문자열입니다 .
ru: Строка из перечислимого типа <a href="../rtcicegathererstate"> <code>RTCIceGathererState</code> </a> , значение которой указывает текущее состояние процесса сбора кандидатов агента ICE:
zh_cn: 来自<a href="../rtcicegathererstate"> <code>RTCIceGathererState</code> </a>枚举类型的字符串，其值指示ICE代理的候选收集过程的当前状态：

source: A string from the <a href="https://developer.mozilla.org/en-US/docs/Web/API/RTCPriorityType"><code>RTCPriorityType</code></a> enumerated type which indicates the encoding's priority. Default value is <code>"low"</code>.
ja: エンコードの優先度を示す<a href="https://developer.mozilla.org/en-US/docs/Web/API/RTCPriorityType"> <code>RTCPriorityType</code> </a>列挙型からの文字列。デフォルト値は <code>"low"</code> です。
ko: 인코딩 우선 순위를 나타내는 <a href="https://developer.mozilla.org/en-US/docs/Web/API/RTCPriorityType"> <code>RTCPriorityType</code> </a> 열거 형 의 문자열입니다 . 기본값은 <code>"low"</code> 입니다.
ru: Строка из перечислимого типа <a href="https://developer.mozilla.org/en-US/docs/Web/API/RTCPriorityType"> <code>RTCPriorityType</code> ,</a> которая указывает приоритет кодировки. Значением по умолчанию является <code>"low"</code> .
zh_cn: 来自<a href="https://developer.mozilla.org/en-US/docs/Web/API/RTCPriorityType"> <code>RTCPriorityType</code> </a>枚举类型的字符串，指示编码的优先级。默认值为 <code>"low"</code> 。

source: A string from the enum <a href="rtcrtptransceiverdirection"><code>RTCRtpTransceiverDirection</code></a> which indicates the transceiver's current directionality, or <code>null</code> if the transceiver is stopped or has never participated in an exchange of offers and answers.
ja: 列挙型<a href="rtcrtptransceiverdirection"> <code>RTCRtpTransceiverDirection</code> </a>からの文字列で、トランシーバーの現在の方向性を示し <code>null</code> 。トランシーバーが停止しているか、またはオファーと応答の交換に参加したことがない場合はnullです。
ko: 트랜시버의 현재 방향을 나타내는 열거 형 <a href="rtcrtptransceiverdirection"> <code>RTCRtpTransceiverDirection</code> </a> 의 문자열 이거나 , 트랜시버가 중지되었거나 오퍼 및 응답 교환에 참여한 적이 <code>null</code> 경우 null 입니다.
ru: Строка из перечисления <a href="rtcrtptransceiverdirection"> <code>RTCRtpTransceiverDirection</code> ,</a> которая указывает текущую направленность приемопередатчика, или <code>null</code> если приемопередатчик остановлен или никогда не участвовал в обмене предложениями и ответами.
zh_cn: 来自<a href="rtcrtptransceiverdirection"> <code>RTCRtpTransceiverDirection</code> </a>枚举的字符串，指示收发器的当前方向性；如果收发器已停止或从未参与过要约和答复的交换，则为 <code>null</code> 。

source: A string from the enum <a href="rtcrtptransceiverdirection"><code>RTCRtpTransceiverDirection</code></a> which is used to set the transceiver's desired direction.
ja: トランシーバーの目的の方向を設定するために使用される列挙型<a href="rtcrtptransceiverdirection"> <code>RTCRtpTransceiverDirection</code> </a>からの文字列。
ko: 송수신기의 원하는 방향을 설정하는 데 사용되는 열거 형 <a href="rtcrtptransceiverdirection"> <code>RTCRtpTransceiverDirection</code> </a> 의 문자열입니다 .
ru: Строка из перечисления <a href="rtcrtptransceiverdirection"> <code>RTCRtpTransceiverDirection</code> ,</a> которая используется для установки желаемого направления приемопередатчика.
zh_cn: 枚举<a href="rtcrtptransceiverdirection"> <code>RTCRtpTransceiverDirection</code> 中的</a>字符串，用于设置收发器的所需方向。

source: A string identifier assigned by the Web site or app when the data channel was created, as specified when <a href="../rtcpeerconnection/createdatachannel"><code>RTCPeerConnection.createDataChannel()</code></a> was called to create the channel.
ja: <a href="../rtcpeerconnection/createdatachannel"> <code>RTCPeerConnection.createDataChannel()</code> </a>を呼び出してチャネルを作成したときに指定された、データチャネルの作成時にWebサイトまたはアプリによって割り当てられた文字列識別子。
ko: <a href="../rtcpeerconnection/createdatachannel"> <code>RTCPeerConnection.createDataChannel()</code> </a> 을 호출하여 채널을 만들 때 지정된대로 데이터 채널을 만들 때 웹 사이트 나 앱에서 할당 한 문자열 식별자 입니다.
ru: Строковый идентификатор, назначаемый веб-сайтом или приложением при создании канала данных, как указано при <a href="../rtcpeerconnection/createdatachannel"> <code>RTCPeerConnection.createDataChannel()</code> </a> для создания канала.
zh_cn: 创建数据通道时由网站或应用程序分配的字符串标识符，如在<a href="../rtcpeerconnection/createdatachannel"> <code>RTCPeerConnection.createDataChannel()</code> </a>创建通道时所指定的。

source: A string identifying the app-defined subprotocol being used for exchanging data on the channel. If none has been established, this is an empty string ("").
ja: チャネル上でデータを交換するために使用されるアプリ定義のサブプロトコルを識別する文字列です。何も確立されていない場合、これは空の文字列("")です。
ko: 채널에서 데이터를 교환하는 데 사용되는 앱 정의 하위 프로토콜을 식별하는 문자열입니다. 설정된 것이 없으면 빈 문자열 ( "")입니다.
ru: Строка,идентифицирующая прикладной подпротокол,используемый для обмена данными по каналу.Если ни один из них не был установлен,то это пустая строка ("").
zh_cn: 标识应用程序定义的子协议的字符串,用于在通道上交换数据。如果没有建立子协议,则为空字符串("")。

source: A string identifying the type of event described. If this is specified, an event will be dispatched on the browser to the listener for the specified event name; the website source code should use <code>addEventListener()</code> to listen for named events. The <code>onmessage</code> handler is called if no event name is specified for a message.
ja: 説明されているイベントのタイプを識別する文字列。これを指定すると、指定したイベント名のリスナーにブラウザーでイベントが送出されます。Webサイトのソースコードは <code>addEventListener()</code> を使用して名前付きイベントをリッスンする必要があります。 <code>onmessage</code> いかなるイベント名がメッセージに指定されていない場合、ハンドラが呼び出されます。
ko: 설명 된 이벤트 유형을 식별하는 문자열입니다. 이것이 지정되면, 지정된 이벤트 이름에 대한 리스너로 이벤트가 브라우저에서 전달됩니다. 웹 사이트 소스 코드는 <code>addEventListener()</code> 를 사용 하여 명명 된 이벤트를 수신 대기 해야 합니다. <code>onmessage</code> , 이벤트의 이름이 메시지를 지정하지 않으면 처리기가 호출됩니다.
ru: Строка, идентифицирующая тип описанного события. Если это указано, событие будет отправлено в браузере слушателю для указанного имени события; исходный код сайта должен использовать <code>addEventListener()</code> для прослушивания именованных событий. <code>onmessage</code> обработчик вызывается , если имя события не указано для сообщения.
zh_cn: 标识所描述事件类型的字符串。如果指定了此名称，则将在浏览器上将事件调度为指定事件名称的侦听器；网站源代码应使用 <code>addEventListener()</code> 侦听命名事件。该 <code>onmessage</code> 如果消息没有指定事件名称处理程序被调用。

source: A string indicating the MIME type of the data contained in the <code>Blob</code>. If the type is unknown, this string is empty.
ja: <code>Blob</code> に含まれるデータのMIMEタイプを示す文字列。タイプが不明な場合、この文字列は空です。
ko: <code>Blob</code> 에 포함 된 데이터의 MIME 유형을 나타내는 문자열 입니다. 유형을 알 수없는 경우이 문자열은 비어 있습니다.
ru: Строка, указывающая MIME-тип данных, содержащихся в <code>Blob</code> . Если тип неизвестен, эта строка пуста.
zh_cn: 一个字符串，指示 <code>Blob</code> 中包含的数据的MIME类型。如果类型未知，则此字符串为空。

source: A string indicating the direction in which the selection is performed. This string can be "forward" or "backward", or "none" if the direction is unknown or irrelevant.
ja: 選択が行われる方向を示す文字列。この文字列は "forward" または "backward"、方向が不明な場合は "none" とすることができます。
ko: 선택이 수행되는 방향을 나타내는 문자열입니다. 방향을 알 수 없거나 관련이없는 경우이 문자열은 "앞으로"또는 "뒤로"또는 "없음"일 수 있습니다.
ru: Строка,указывающая направление,в котором осуществляется выбор.Эта строка может быть "вперед" или "назад",или "нет",если направление неизвестно или несущественно.
zh_cn: 表示选择方向的字符串。该字符串可以是 "向前 "或 "向后",如果方向不明或不相关,则为 "无"。

source: A string indicating the element's tag name. This string's capitalization depends on the document type:
ja: 要素のタグ名を示す文字列。この文字列の大文字小文字の区別はドキュメントタイプに依存します。
ko: 요소의 태그 이름을 나타내는 문자열입니다. 이 문자열의 대문자는 문서 유형에 따라 다릅니다.
ru: Строка,указывающая имя тега элемента.Заголовок этой строки зависит от типа документа:
zh_cn: 表示元素标签名称的字符串。该字符串的大写取决于文档类型。

source: A string indicating whether the candidate's protocol is <code>"tcp"</code> or <code>"udp"</code>. The string is one of those in the enumerated type <code>RTCIceProtocol</code>.
ja: 候補者のプロトコルが <code>"tcp"</code> か <code>"udp"</code> かを示す文字列。文字列は、列挙型 <code>RTCIceProtocol</code> の文字列の1つです。
ko: 후보의 프로토콜이 <code>"tcp"</code> 또는 <code>"udp"</code> 인지를 나타내는 문자열 . 문자열은 열거 된 유형 <code>RTCIceProtocol</code> 의 문자열 중 하나입니다 .
ru: Строка, указывающая, является ли протокол кандидата <code>"tcp"</code> или <code>"udp"</code> . Строка является одной из перечисленных в типе <code>RTCIceProtocol</code> .
zh_cn: 一个字符串，指示候选人的协议是 <code>"tcp"</code> 还是 <code>"udp"</code> 。该字符串是 <code>RTCIceProtocol</code> 枚举类型之一。

source: A string of text to display to the user. Can be omitted if there is nothing to show in the prompt window.
ja: ユーザーに表示するテキストの文字列。プロンプトウィンドウに表示するものがない場合は省略可能です。
ko: 사용자에게 표시 할 텍스트 문자열입니다. 프롬프트 창에 아무것도 표시되지 않으면 생략 할 수 있습니다.
ru: Строка текста для отображения пользователю.Может быть опущена,если в окне запроса нечего показывать.
zh_cn: 要显示给用户的文本字符串。如果在提示窗口中没有任何内容要显示,可以省略。

source: A string passed to <code>setTimeout</code> is evaluated in the global context, so local symbols in the context where <code>setTimeout()</code> was called will not be available when the string is evaluated as code.
ja: <code>setTimeout</code> に渡された文字列はグローバルコンテキストで評価されるため、文字列がコードとして評価されると、 <code>setTimeout()</code> が呼び出されたコンテキストのローカルシンボルは使用できなくなります。
ko: <code>setTimeout</code> 에 전달 된 문자열 은 전역 컨텍스트에서 평가되므로 문자열이 코드로 평가 될 때 <code>setTimeout()</code> 이 호출 된 컨텍스트의 로컬 기호를 사용할 수 없습니다.
ru: Строка, переданная в <code>setTimeout</code> , оценивается в глобальном контексте, поэтому локальные символы в контексте, где был вызван <code>setTimeout()</code> , не будут доступны, когда строка оценивается как код.
zh_cn: 传递给 <code>setTimeout</code> 的字符串是在全局上下文中评估的，因此，当将该字符串作为代码评估时，调用 <code>setTimeout()</code> 的上下文中的本地符号将不可用。

source: A string representing an action type to listen for. It will be one of <code>play</code>, <code>pause</code>, <code>seekbackward</code>, <code>seekforward</code>, <code>previoustrack</code>, or <code>nexttrack</code>.
ja: 待機するアクションタイプを表す文字列。これは、のいずれかになります <code>play</code> 、 <code>pause</code> 、 <code>seekbackward</code> 、 <code>seekforward</code> 、 <code>previoustrack</code> 、または <code>nexttrack</code> 。
ko: 수신 할 조치 유형을 나타내는 문자열입니다. <code>play</code> , <code>pause</code> , <code>seekbackward</code> , <code>seekforward</code> , <code>previoustrack</code> <code>nexttrack</code> 또는 다음 트랙 중 하나가됩니다 .
ru: Строка, представляющая тип действия для прослушивания. Это будет <code>play</code> , <code>pause</code> , <code>seekbackward</code> , <code>seekforward</code> , <code>previoustrack</code> <code>nexttrack</code> или следующий трек .
zh_cn: 一个字符串，代表要监听的操作类型。这将是 <code>play</code> ， <code>pause</code> ， <code>seekbackward</code> ， <code>seekforward</code> ， <code>previoustrack</code> <code>nexttrack</code> 或下一曲之一。

source: A string representing the build identifier of the application. The build ID is in the form <code>YYYYMMDDHHMMSS</code>.
ja: アプリケーションのビルド識別子を表す文字列。ビルドIDの形式は <code>YYYYMMDDHHMMSS</code> です。
ko: 애플리케이션의 빌드 식별자를 나타내는 문자열입니다. 빌드 ID는 <code>YYYYMMDDHHMMSS</code> 형식 입니다.
ru: Строка, представляющая идентификатор сборки приложения. Идентификатор сборки имеет вид <code>YYYYMMDDHHMMSS</code> .
zh_cn: 一个字符串，代表应用程序的构建标识符。内部版本ID的格式为 <code>YYYYMMDDHHMMSS</code> 。

source: A string representing the current permission to display notifications. Possible values are:
ja: 通知を表示するための現在の権限を表す文字列。可能な値は以下の通りです。
ko: 알림을 표시 할 수있는 현재 권한을 나타내는 문자열입니다. 가능한 값은 다음과 같습니다.
ru: Строка,представляющая текущее разрешение на отображение уведомлений.Возможные значения:
zh_cn: 表示当前显示通知的权限的字符串。可能的值是:

source: A string representing the name of the type of the <code>PromiseRejectionEvent</code>. This is case-sensitive and should be one of <code><a href="https://developer.mozilla.org/en-US/docs/Web/Events/rejectionhandled">"rejectionhandled"</a></code> or <code><a href="https://developer.mozilla.org/en-US/docs/Web/Events/unhandledrejection">"unhandledrejection"</a></code>, to match the event names of the possible (non-synthetic) <a href="../promiserejectionevent"><code>PromiseRejectionEvent</code></a> events that user agents can actually fire).
ja: <code>PromiseRejectionEvent</code> のタイプの名前を表す文字列。これは大文字と小文字が区別され、ユーザーエージェントが実際に発生させる可能性のある（非合成）<a href="../promiserejectionevent"> <code>PromiseRejectionEvent</code> </a>イベントのイベント名と一致させるには、 <code><a href="https://developer.mozilla.org/en-US/docs/Web/Events/rejectionhandled">"rejectionhandled"</a></code> または <code><a href="https://developer.mozilla.org/en-US/docs/Web/Events/unhandledrejection">"unhandledrejection"</a></code> unhandledrejection "のいずれかである必要があります。
ko: <code>PromiseRejectionEvent</code> 유형의 이름을 나타내는 문자열 입니다. 대소 문자를 구분하며 <code><a href="https://developer.mozilla.org/en-US/docs/Web/Events/rejectionhandled">"rejectionhandled"</a></code> 또는 <code><a href="https://developer.mozilla.org/en-US/docs/Web/Events/unhandledrejection">"unhandledrejection"</a></code> 중 하나 여야하며 , 사용자 에이전트가 실제로 실행할 수 있는 가능한 (합성되지 않은) <a href="../promiserejectionevent"> <code>PromiseRejectionEvent</code> </a> 이벤트 의 이벤트 이름과 일치해야합니다 .
ru: Строка, представляющая имя типа <code>PromiseRejectionEvent</code> . Это чувствительно к регистру и должно быть одним из <code><a href="https://developer.mozilla.org/en-US/docs/Web/Events/rejectionhandled">"rejectionhandled"</a></code> или <code><a href="https://developer.mozilla.org/en-US/docs/Web/Events/unhandledrejection">"unhandledrejection"</a></code> , чтобы соответствовать именам событий возможных (не синтетических) событий <a href="../promiserejectionevent"> <code>PromiseRejectionEvent</code> ,</a> которые пользовательские агенты могут фактически запускать ).
zh_cn: 一个字符串，代表 <code>PromiseRejectionEvent</code> 类型的名称。这是区分大小写的，并且应该是 <code><a href="https://developer.mozilla.org/en-US/docs/Web/Events/rejectionhandled">"rejectionhandled"</a></code> 或 <code><a href="https://developer.mozilla.org/en-US/docs/Web/Events/unhandledrejection">"unhandledrejection"</a></code> ，以匹配用户代理实际上可以触发的可能的（非综合）<a href="../promiserejectionevent"> <code>PromiseRejectionEvent</code> </a>事件的事件名称。

source: A string representing the reason why the event was fired. The available reasons are defined in the <code><a href="https://w3c.github.io/webvr/spec/1.1/#interface-vrdisplayeventreason">VRDisplayEventReason</a></code> enum, and are as follows:
ja: イベントが発生した理由を表す文字列。利用可能な理由は <code><a href="https://w3c.github.io/webvr/spec/1.1/#interface-vrdisplayeventreason">VRDisplayEventReason</a></code> 列挙型で定義されており、次のとおりです。
ko: 이벤트가 발생한 이유를 나타내는 문자열입니다. 사용 가능한 이유는 <code><a href="https://w3c.github.io/webvr/spec/1.1/#interface-vrdisplayeventreason">VRDisplayEventReason</a></code> 열거 형에 정의 되며 다음과 같습니다.
ru: Строка, представляющая причину возникновения события. Доступные причины определены в перечислении <code><a href="https://w3c.github.io/webvr/spec/1.1/#interface-vrdisplayeventreason">VRDisplayEventReason</a></code> и заключаются в следующем:
zh_cn: 一个字符串，表示事件被触发的原因。可用原因在 <code><a href="https://w3c.github.io/webvr/spec/1.1/#interface-vrdisplayeventreason">VRDisplayEventReason</a></code> 枚举中定义，如下所示：

source: A string representing the rendered text content of an element.
ja: 要素のレンダリングされたテキストの内容を表す文字列。
ko: 요소의 렌더링 된 텍스트 내용을 나타내는 문자열입니다.
ru: Строка,представляющая отображенное текстовое содержимое элемента.
zh_cn: 一个字符串,代表一个元素的渲染文本内容。

source: A string specifying the encoding to use for the returned data. By default, UTF-8 is assumed if this parameter is not specified.
ja: 返されるデータに使用するエンコーディングを指定する文字列。デフォルトでは、このパラメータが指定されていない場合はUTF-8が想定されます。
ko: 반환 된 데이터에 사용할 인코딩을 지정하는 문자열입니다. 이 매개 변수를 지정하지 않으면 기본적으로 UTF-8이 사용됩니다.
ru: Строка,указывающая кодировку для возвращаемых данных.По умолчанию предполагается UTF-8,если этот параметр не указан.
zh_cn: 指定返回数据使用的编码的字符串。默认情况下,如果没有指定此参数,则假定使用UTF-8编码。

source: A string specifying the pseudo-element to match. Must be omitted (or <code>null</code>) for regular elements.
ja: 一致する疑似要素を指定する文字列。通常の要素では省略（または <code>null</code> ）する必要があります。
ko: 일치 할 의사 요소를 지정하는 문자열입니다. 일반 요소의 경우 생략 (또는 <code>null</code> ) 해야합니다 .
ru: Строка, указывающая псевдоэлемент для сопоставления. Должен быть опущен (или <code>null</code> ) для обычных элементов.
zh_cn: 一个字符串，指定要匹配的伪元素。对于常规元素，必须省略（或为 <code>null</code> ）。

source: A string taken from the <a href="../xmlhttprequestresponsetype"><code>XMLHttpRequestResponseType</code></a> enum which specifies what type of data the response contains.
ja: <a href="../xmlhttprequestresponsetype"> <code>XMLHttpRequestResponseType</code> </a>列挙型から取得した文字列で、応答に含まれるデータのタイプを指定します。
ko: 응답에 포함 된 데이터 유형을 지정 하는 <a href="../xmlhttprequestresponsetype"> <code>XMLHttpRequestResponseType</code> </a> 열거 형 에서 가져온 문자열 입니다.
ru: Строка, взятая из перечисления <a href="../xmlhttprequestresponsetype"> <code>XMLHttpRequestResponseType</code> ,</a> которая указывает, какой тип данных содержит ответ.
zh_cn: 从<a href="../xmlhttprequestresponsetype"> <code>XMLHttpRequestResponseType</code> </a>枚举获取的字符串，它指定响应包含的数据类型。

source: A string that may be used by the web application to provide a hint as to what type of content the track contains to guide how it should be treated by API consumers.
ja: トラックに含まれるコンテンツの種類のヒントを提供するために、ウェブアプリケーションによって使用される可能性のある文字列で、API コンシューマによってどのように扱われるべきかをガイドします。
ko: API 소비자가 트랙을 처리하는 방법을 안내하기 위해 트랙에 포함 된 컨텐츠 유형에 대한 힌트를 제공하기 위해 웹 애플리케이션에서 사용할 수있는 문자열입니다.
ru: Строка,которая может быть использована веб-приложением,чтобы дать подсказку о том,какой тип содержимого содержит трек,чтобы определить,как с ним должны обращаться потребители API.
zh_cn: 网络应用程序可使用的字符串,以提供一个提示,说明轨道包含的内容类型,以指导API消费者如何处理它。

source: A string that specifies the type of element to be created. The <a href="../node/nodename"><code>nodeName</code></a> of the created element is initialized with the value of <var>tagName</var>. Don't use qualified names (like "html:a") with this method. When called on an HTML document, <code>createElement()</code> converts <var>tagName</var> to lower case before creating the element. In Firefox, Opera, and Chrome, <code>createElement(null)</code> works like <code>createElement("null")</code>.
ja: 作成する要素のタイプを指定する文字列。作成された要素の<a href="../node/nodename"> <code>nodeName</code> </a>は <var>tagName</var> の値で初期化されます。このメソッドでは修飾名（ "html：a"など）を使用しないでください。HTMLドキュメントで呼び出されると、 <code>createElement()</code> は要素を作成する前に <var>tagName</var> を小文字に変換します。Firefox、Opera、Chromeでは、 <code>createElement(null)</code> は <code>createElement("null")</code> のように機能します。
ko: 작성할 요소의 유형을 지정하는 문자열. 작성된 요소 의 <a href="../node/nodename"> <code>nodeName</code> </a> 은 <var>tagName</var> 값으로 초기화됩니다 . 이 방법에는 정규화 된 이름 (예 : "html : a")을 사용하지 마십시오. HTML 문서에서 호출되면 <code>createElement()</code> 는 요소를 만들기 전에 <var>tagName</var> 을 소문자 로 변환 합니다. Firefox, Opera 및 Chrome에서 <code>createElement(null)</code> 은 <code>createElement("null")</code> 과 같이 작동합니다 .
ru: Строка, определяющая тип создаваемого элемента. Имя <a href="../node/nodename"> <code>nodeName</code> </a> созданного элемента инициализируется значением <var>tagName</var> . Не используйте квалифицированные имена (например, &laquo;html: a&raquo;) с этим методом. При вызове в HTML-документе <code>createElement()</code> преобразует <var>tagName</var> в нижний регистр перед созданием элемента. В Firefox, Opera и Chrome <code>createElement(null)</code> работает как <code>createElement("null")</code> .
zh_cn: 一个字符串，指定要创建的元素的类型。用 <var>tagName</var> 的值初始化创建的元素的<a href="../node/nodename"> <code>nodeName</code> </a>。请勿在此方法中使用限定名称（例如&ldquo; html：a&rdquo;）。在HTML文档上调用时， <code>createElement()</code> 在创建元素之前将 <var>tagName</var> 转换为小写。在Firefox，Opera和Chrome中， <code>createElement(null)</code> 类似于 <code>createElement("null")</code> 。

source: A string was specified as <code>trackOrKind</code> which is not valid. The string must be either <code>"audio"</code> or <code>"video"</code>.
ja: 文字列が無効な <code>trackOrKind</code> として指定されました。文字列は <code>"audio"</code> または <code>"video"</code> でなければなりません。
ko: 문자열이 유효하지 않은 <code>trackOrKind</code> 로 지정되었습니다 . 문자열은 <code>"audio"</code> 또는 <code>"video"</code> 여야합니다 .
ru: Строка была указана как <code>trackOrKind</code> , что недопустимо. Строка должна быть либо <code>"audio"</code> либо <code>"video"</code> .
zh_cn: 指定的字符串为 <code>trackOrKind</code> ，无效。字符串必须是 <code>"audio"</code> 或 <code>"video"</code> 。

source: A string which is one of the values in the <a href="#RTCDataChannelState_enum">RTCDataChannelState</a> enum, indicating the current state of the underlying data transport.
ja: <a href="#RTCDataChannelState_enum">RTCDataChannelState</a>列挙の値の1つである文字列で、基礎となるデータ転送の現在の状態を示します。
ko: 기본 데이터 전송의 현재 상태를 나타내는 <a href="#RTCDataChannelState_enum">RTCDataChannelState</a> 열거 형 의 값 중 하나 인 문자열입니다 .
ru: Строка, являющаяся одним из значений в перечислении <a href="#RTCDataChannelState_enum">RTCDataChannelState</a> , указывающая текущее состояние базового транспорта данных.
zh_cn: 一个字符串，它是<a href="#RTCDataChannelState_enum">RTCDataChannelState</a>枚举中的值之一，指示基础数据传输的当前状态。
