Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/dom/dom.*.011.xlf
Languages: ja, ko, ru, zh_cn

source: A read-only <a href="../domstring"><code>DOMString</code></a> which uniquely identifies the payment handler which is requesting merchant validation. See <a href="../payment_request_api/concepts#Merchant_validation">Merchant validation</a> in <a href="../payment_request_api/concepts">Payment processing concepts</a> for more information on the process.
ja: 販売者の検証を要求している支払いハンドラを一意に識別する読み取り専用<a href="../domstring"> <code>DOMString</code> </a>。プロセスの詳細については、<a href="../payment_request_api/concepts">支払い処理の概念の</a><a href="../payment_request_api/concepts#Merchant_validation">マーチャント検証</a>を参照してください。
ko: 판매자 유효성 검증을 요청하는 지불 핸들러를 고유하게 식별 하는 읽기 전용 <a href="../domstring"> <code>DOMString</code> </a> 입니다. 프로세스에 대한 자세한 정보 는 <a href="../payment_request_api/concepts">지불 처리 개념</a> 에서 <a href="../payment_request_api/concepts#Merchant_validation">판매자 유효성 검증</a> 을 참조하십시오 .
ru: <a href="../domstring"> <code>DOMString</code> </a> только для чтения DOMString, которая однозначно идентифицирует обработчик платежа, который запрашивает проверку продавца. См. <a href="../payment_request_api/concepts#Merchant_validation">Проверка продавца</a> в <a href="../payment_request_api/concepts">Концепциях обработки платежей</a> для получения дополнительной информации о процессе.
zh_cn: 只读<a href="../domstring"> <code>DOMString</code> </a>，用于唯一标识请求商家验证的付款处理程序。见<a href="../payment_request_api/concepts#Merchant_validation">商家确认</a>在<a href="../payment_request_api/concepts">付款处理概念</a>对这一进程的详细信息。

source: A read-only <a href="../usvstring"><code>USVString</code></a> giving the URL from which to load payment handler specific data needed to complete the merchant verification process. Once this has been loaded, it should be passed into <a href="complete"><code>complete()</code></a>, either directly or using a promise.
ja: 販売者確認プロセスを完了するために必要な支払いハンドラ固有のデータをロードするためのURLを提供する読み取り専用<a href="../usvstring"> <code>USVString</code> </a>。これがロードされたら、直接またはpromiseを使用して<a href="complete"> <code>complete()</code> に</a>渡す必要があります。
ko: 판매자 확인 프로세스를 완료하는 데 필요한 지불 핸들러 특정 데이터를로드 할 URL을 제공 하는 읽기 전용 <a href="../usvstring"> <code>USVString</code> </a> 입니다. 이것이로드되면 , 직접 또는 약속을 사용하여 <a href="complete"> <code>complete()</code> </a> 로 전달되어야합니다 .
ru: <a href="../usvstring"> <code>USVString</code> </a> только для чтения строка USVString, содержащая URL-адрес, с которого необходимо загрузить специфические данные обработчика платежей, необходимые для завершения процесса проверки продавца. Как только это будет загружено, оно должно быть передано в <a href="complete"> <code>complete()</code> </a> , либо напрямую, либо с помощью обещания.
zh_cn: 只读的<a href="../usvstring"> <code>USVString</code> </a>给出URL，从该URL加载完成商家验证过程所需的付款处理程序特定数据。加载完成后，应直接或使用promise 将其传递到<a href="complete"> <code>complete()</code> 中</a>。

source: A read-only array of <a href="https://developer.mozilla.org/en-US/docs/Web/API/NotificationAction"><code>NotificationAction</code></a> objects, each describing a single action the user can choose within a notification.
ja: <a href="https://developer.mozilla.org/en-US/docs/Web/API/NotificationAction"> <code>NotificationAction</code> </a>オブジェクトの読み取り専用の配列。各オブジェクトは、通知内でユーザーが選択できる単一のアクションを記述します。
ko: <a href="https://developer.mozilla.org/en-US/docs/Web/API/NotificationAction"> <code>NotificationAction</code> </a> 객체 의 읽기 전용 배열로 , 사용자가 알림 내에서 선택할 수있는 단일 작업을 각각 설명합니다.
ru: Доступный только для чтения массив объектов <a href="https://developer.mozilla.org/en-US/docs/Web/API/NotificationAction"> <code>NotificationAction</code> </a> , каждый из которых описывает одно действие, которое пользователь может выбрать в уведомлении.
zh_cn: <a href="https://developer.mozilla.org/en-US/docs/Web/API/NotificationAction"> <code>NotificationAction</code> </a>对象的只读数组，每个对象描述用户可以在通知中选择的单个操作。

source: A read-only back-reference to the <a href="htmlcanvaselement"><code>HTMLCanvasElement</code></a>. Might be <a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/null"><code>null</code></a> if it is not associated with a <a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/canvas"><code>&lt;canvas&gt;</code></a> element.
ja: <a href="htmlcanvaselement"> <code>HTMLCanvasElement</code> </a>への読み取り専用の後方参照。<a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/canvas"> <code>&lt;canvas&gt;</code> </a>要素に関連付けられていない場合は<a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/null"> <code>null</code> に</a>なる可能性があります。
ko: <a href="htmlcanvaselement"> <code>HTMLCanvasElement</code> 에</a> 대한 읽기 전용 역 참조 입니다. <a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/canvas"> <code>&lt;canvas&gt;</code> </a> 요소 와 연결되지 않은 경우 <a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/null"> <code>null</code> </a> 일 수 있습니다 .
ru: Обратная ссылка только для <a href="htmlcanvaselement"> <code>HTMLCanvasElement</code> </a> к HTMLCanvasElement . Может быть <a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/null"> <code>null</code> </a> если он не связан с элементом <a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/canvas"> <code>&lt;canvas&gt;</code> </a> .
zh_cn: 对<a href="htmlcanvaselement"> <code>HTMLCanvasElement</code> 的</a>只读反向引用。如果它不与<a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/canvas"> <code>&lt;canvas&gt;</code> </a>元素关联，则可能为<a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/null"> <code>null</code> </a>。

source: A read-only property containing additional information about the event.
ja: イベントに関する追加情報を含む読み取り専用のプロパティ。
ko: 이벤트에 대한 추가 정보가 포함 된 읽기 전용 속성입니다.
ru: Свойство только для чтения,содержащее дополнительную информацию о событии.
zh_cn: 一个只读属性,包含有关该事件的附加信息。

source: A read-only value indicating the number of files in the list.
ja: リスト内のファイル数を示す読み取り専用の値。
ko: 목록의 파일 수를 나타내는 읽기 전용 값입니다.
ru: Значение только для чтения,указывающее количество файлов в списке.
zh_cn: 一个只读值,表示列表中的文件数量。

source: A readAs method was invoked. A <code><a href="../file">File</a></code> or <code><a href="../blob">Blob</a></code> is being read, and no error has occurred yet.
ja: readAsメソッドが呼び出されました。 <code><a href="../file">File</a></code> または <code><a href="../blob">Blob</a></code> 読み込まれている、とエラーがまだ発生していません。
ko: readAs 메소드가 호출되었습니다. <code><a href="../file">File</a></code> 또는 <code><a href="../blob">Blob</a></code> 읽고있는, 어떤 오류가 아직 발생하지 않았다.
ru: Метод readAs был вызван. <code><a href="../file">File</a></code> или <code><a href="../blob">Blob</a></code> считывается, и никакой ошибки не произошло еще.
zh_cn: 调用了readAs方法。一个 <code><a href="../file">File</a></code> 或 <code><a href="../blob">Blob</a></code> 被读取，并没有出现错误呢。

source: A readable stream is a data source represented in JavaScript by a <a href="../readablestream"><code>ReadableStream</code></a> object that flows from an <strong>underlying source</strong> &mdash; this is a resource somewhere on the network or elsewhere on your domain that you want to get data from.
ja: 読み取り可能なストリームは、<strong>基になるソース</strong>から流れる<a href="../readablestream"> <code>ReadableStream</code> </a>オブジェクトによってJavaScriptで表されるデータソースです。これは、ネットワーク上のどこか、またはデータを取得したいドメイン上のどこかにあるリソースです。<strong></strong>
ko: 읽을 수있는 스트림은 <strong>기본 소스</strong> 에서 흐르는 <a href="../readablestream"> <code>ReadableStream</code> </a> 객체 로 JavaScript로 표시되는 데이터 소스입니다. 이 <strong>소스</strong> 는 네트워크 또는 데이터를 가져 오려는 도메인의 다른 위치에있는 리소스입니다.
ru: Читаемый поток - это источник данных, представленный в JavaScript объектом <a href="../readablestream"> <code>ReadableStream</code> ,</a> который поступает из <strong>базового источника</strong> - это ресурс где-то в сети или в другом месте вашего домена, из которого вы хотите получать данные.
zh_cn: 可读流是JavaScript的数据源，它由来自<strong>底层源</strong>的<a href="../readablestream"> <code>ReadableStream</code> </a>对象表示-这是您要从中获取数据的网络上或域中其他位置的资源。<strong></strong>

source: A reader&rsquo;s lock cannot be released while it still has a pending read request, i.e., if a promise returned by the reader&rsquo;s <a href="../readablestreamdefaultreader/read"><code>ReadableStreamDefaultReader.read()</code></a> method has not finished. This will result in a <code>TypeError</code> being thrown.
ja: まだ読み取り要求が保留されている間、つまり、リーダーの<a href="../readablestreamdefaultreader/read"> <code>ReadableStreamDefaultReader.read()</code> </a>メソッドによって返されたpromise が完了していない場合、リーダーのロックは解放できません。これにより、 <code>TypeError</code> がスローされます。
ko: 리더의 잠금은 아직 읽기 보류 요청이있는 동안, 즉 리더의 <a href="../readablestreamdefaultreader/read"> <code>ReadableStreamDefaultReader.read()</code> </a> 메소드에 의해 리턴 된 약속 이 완료 되지 않은 경우 해제 할 수 없습니다 . 이로 인해 <code>TypeError</code> 가 발생합니다.
ru: Блокировка читателя не может быть снята, пока у него все еще есть ожидающий запрос на чтение, т. Е. Если обещание, возвращенное методом <a href="../readablestreamdefaultreader/read"> <code>ReadableStreamDefaultReader.read()</code> </a> , не выполнено. Это приведет к возникновению <code>TypeError</code> .
zh_cn: 当读取器的锁仍具有未决的读取请求时，即，如果读取器的<a href="../readablestreamdefaultreader/read"> <code>ReadableStreamDefaultReader.read()</code> </a>方法返回的承诺尚未完成，则无法释放读取器的锁。这将导致 <code>TypeError</code> 。

source: A reader&rsquo;s lock cannot be released while it still has a pending read request, i.e., if a promise returned by the reader&rsquo;s <a href="read"><code>ReadableStreamDefaultReader.read()</code></a> method has not finished. This will result in a <code>TypeError</code> being thrown.
ja: まだ読み取り要求が保留されている間、つまり、リーダーの<a href="read"> <code>ReadableStreamDefaultReader.read()</code> </a>メソッドによって返されたpromise が完了していない場合、リーダーのロックは解放できません。これにより、 <code>TypeError</code> がスローされます。
ko: 리더의 잠금은 아직 읽기 보류 요청이있는 동안, 즉 리더의 <a href="read"> <code>ReadableStreamDefaultReader.read()</code> </a> 메소드에 의해 리턴 된 약속 이 완료 되지 않은 경우 해제 할 수 없습니다 . 이로 인해 <code>TypeError</code> 가 발생합니다.
ru: Блокировка читателя не может быть снята, пока у него все еще есть ожидающий запрос на чтение, т. Е. Если обещание, возвращенное методом <a href="read"> <code>ReadableStreamDefaultReader.read()</code> </a> , не выполнено. Это приведет к возникновению <code>TypeError</code> .
zh_cn: 当读取器的锁仍具有未决的读取请求时，即，如果读取器的<a href="read"> <code>ReadableStreamDefaultReader.read()</code> </a>方法返回的承诺尚未完成，则无法释放读取器的锁。这将导致 <code>TypeError</code> 。

source: A really easy way to start using a matrix is to use the CSS3 <code>matrix3d</code><a href="https://developer.mozilla.org/en-US/docs/Web/CSS/transform">transform</a>. First we'll set up a simple <a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/div"><code>&lt;div&gt;</code></a> with some content. The style is not shown. But it is set to a fixed width and height and centered on the page. The <code>&lt;div&gt;</code> has a transition set for the transform so that matrix is animated in making it easy to see what is being done.
ja: マトリックスの使用を開始する本当に簡単な方法は、CSS3 <code>matrix3d</code> <a href="https://developer.mozilla.org/en-US/docs/Web/CSS/transform">変換</a>を使用することです。まず、コンテンツを含む単純な<a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/div"> <code>&lt;div&gt;</code> </a>を設定します。スタイルは表示されません。ただし、幅と高さが固定され、ページの中央に配置されます。 <code>&lt;div&gt;</code> の行列は、それが簡単に行われているかを確認することでアニメーションされるように変換するためのトランジションが設定されています。
ko: 행렬을 사용하는 가장 쉬운 방법은 CSS3 <code>matrix3d</code> <a href="https://developer.mozilla.org/en-US/docs/Web/CSS/transform">변환</a> 을 사용하는 것 입니다. 먼저 일부 내용 으로 간단한 <a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/div"> <code>&lt;div&gt;</code> </a> 를 설정합니다 . 스타일이 표시되지 않습니다. 그러나 너비와 높이가 고정되어 있고 페이지 중앙에 위치합니다. <code>&lt;div&gt;</code> 행렬가 쉽게 수행되고 있는지 확인할 제작 애니메이션되도록 변환하는 전이들을 가진다.
ru: Действительно простой способ начать использовать матрицу - это использовать CSS3 <code>matrix3d</code> <a href="https://developer.mozilla.org/en-US/docs/Web/CSS/transform">transform</a> . Сначала мы настроим простой <a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/div"> <code>&lt;div&gt;</code> </a> с некоторым содержанием. Стиль не показан. Но он установлен на фиксированную ширину и высоту и центрирован на странице. У <code>&lt;div&gt;</code> есть набор переходов для преобразования, так что матрица анимирована, чтобы было легко увидеть, что делается.
zh_cn: 开始使用矩阵的一种非常简单的方法是使用CSS3 <code>matrix3d</code> <a href="https://developer.mozilla.org/en-US/docs/Web/CSS/transform">转换</a>。首先，我们将设置一些简单的<a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/div"> <code>&lt;div&gt;</code> </a>内容。样式未显示。但是将其设置为固定的宽度和高度，并以页面为中心。该 <code>&lt;div&gt;</code> 有变换，使矩阵中使其容易看到正在做什么的动画过渡集。

source: A reference to a <a href="../mediakeys"><code>MediaKeys</code></a> object that the <a href="../htmlmediaelement"><code>HTMLMediaElement</code></a> can use for decryption of media data during playback.
ja: <a href="../htmlmediaelement"> <code>HTMLMediaElement</code> </a>が再生中のメディアデータの復号化に使用できる<a href="../mediakeys"> <code>MediaKeys</code> </a>オブジェクトへの参照。
ko: <a href="../htmlmediaelement"> <code>HTMLMediaElement</code> </a> 가 재생 중에 미디어 데이터의 암호 해독에 사용할 수 있는 <a href="../mediakeys"> <code>MediaKeys</code> </a> 객체에 대한 참조 입니다.
ru: Ссылка на объект <a href="../mediakeys"> <code>MediaKeys</code> ,</a> который <a href="../htmlmediaelement"> <code>HTMLMediaElement</code> </a> может использовать для дешифрования мультимедийных данных во время воспроизведения.
zh_cn: <a href="../htmlmediaelement"> <code>HTMLMediaElement</code> </a>可在播放过程中用于解密媒体数据的对<a href="../mediakeys"> <code>MediaKeys</code> </a>对象的引用。

source: A reference to a <a href="../mediastream"><code>MediaStream</code></a> object, which has a single <a href="../canvascapturemediastreamtrack"><code>CanvasCaptureMediaStreamTrack</code></a> in it.
ja: 単一の<a href="../canvascapturemediastreamtrack"> <code>CanvasCaptureMediaStreamTrack</code> が含ま</a>れている<a href="../mediastream"> <code>MediaStream</code> </a>オブジェクトへの参照。
ko: 단일 <a href="../canvascapturemediastreamtrack"> <code>CanvasCaptureMediaStreamTrack</code> </a> 이 있는 <a href="../mediastream"> <code>MediaStream</code> </a> 객체에 대한 참조 입니다.
ru: Ссылка на объект <a href="../mediastream"> <code>MediaStream</code> </a> , в котором есть единственный <a href="../canvascapturemediastreamtrack"> <code>CanvasCaptureMediaStreamTrack</code> </a> .
zh_cn: 对<a href="../mediastream"> <code>MediaStream</code> </a>对象的引用，该对象中具有单个<a href="../canvascapturemediastreamtrack"> <code>CanvasCaptureMediaStreamTrack</code> </a>。

source: A reference to a <a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/StorageInfo"><code>StorageInfo</code></a> object.
ja: <a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/StorageInfo"> <code>StorageInfo</code> </a>オブジェクトへの参照。
ko: <a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/StorageInfo"> <code>StorageInfo</code> </a> 객체에 대한 참조 입니다.
ru: Ссылка на объект <a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/StorageInfo"> <code>StorageInfo</code> </a> .
zh_cn: 对<a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/StorageInfo"> <code>StorageInfo</code> </a>对象的引用。

source: A reference to a function that should be called in the near future, when the event loop is idle. The callback function is passed a <a href="../idledeadline"><code>IdleDeadline</code></a> object describing the amount of time available and whether or not the callback has been run because the timeout period expired.
ja: イベントループがアイドル状態のときに、近いうちに呼び出す必要がある関数への参照。コールバック関数には、利用可能な時間と、タイムアウト期間が経過したためにコールバックが実行されたかどうかを示す<a href="../idledeadline"> <code>IdleDeadline</code> </a>オブジェクトが渡されます。
ko: 이벤트 루프가 유휴 상태 일 때 가까운 시일 내에 호출해야하는 함수에 대한 참조입니다. 콜백 함수는 사용 가능한 시간과 타임 아웃 기간이 만료되어 콜백이 실행되었는지 여부를 설명 하는 <a href="../idledeadline"> <code>IdleDeadline</code> </a> 객체에 전달 됩니다.
ru: Ссылка на функцию, которая должна быть вызвана в ближайшем будущем, когда цикл обработки событий не используется. В функцию обратного вызова передается объект <a href="../idledeadline"> <code>IdleDeadline</code> ,</a> описывающий количество доступного времени и был ли выполнен обратный вызов из-за истечения периода ожидания.
zh_cn: 对事件循环空闲时应在不久的将来调用的函数的引用。向回调函数传递了一个<a href="../idledeadline"> <code>IdleDeadline</code> </a>对象，该对象描述了可用的时间量以及是否由于超时时间已到期而已运行回调。

source: A reference to a function.
ja: 関数への参照。
ko: 함수에 대한 참조
ru: Ссылка на функцию.
zh_cn: 对函数的引用。

source: A reference to an <a href="../audiocontext"><code>AudioContext</code></a> or <a href="../offlineaudiocontext"><code>OfflineAudioContext</code></a>.
ja: <a href="../audiocontext"> <code>AudioContext</code> </a>または<a href="../offlineaudiocontext"> <code>OfflineAudioContext</code> </a>への参照。
ko: <a href="../audiocontext"> <code>AudioContext</code> </a> 또는 <a href="../offlineaudiocontext"> <code>OfflineAudioContext</code> 에</a> 대한 참조 입니다.
ru: Ссылка на <a href="../audiocontext"> <code>AudioContext</code> </a> или <a href="../offlineaudiocontext"> <code>OfflineAudioContext</code> </a> .
zh_cn: 对<a href="../audiocontext"> <code>AudioContext</code> </a>或<a href="../offlineaudiocontext"> <code>OfflineAudioContext</code> 的</a>引用。

source: A reference to an <a href="../audiocontext"><code>AudioContext</code></a>.
ja: <a href="../audiocontext"> <code>AudioContext</code> </a>への参照。
ko: <a href="../audiocontext"> <code>AudioContext</code> 에</a> 대한 참조 입니다.
ru: Ссылка на <a href="../audiocontext"> <code>AudioContext</code> </a> .
zh_cn: 对<a href="../audiocontext"> <code>AudioContext</code> </a>的引用。

source: A reference to an <a href="../audiocontext"><code>AudioContext</code></a>. This parameter was removed from the spec.
ja: <a href="../audiocontext"> <code>AudioContext</code> </a>への参照。このパラメーターは仕様から削除されました。
ko: <a href="../audiocontext"> <code>AudioContext</code> 에</a> 대한 참조 입니다. 이 매개 변수는 스펙에서 제거되었습니다.
ru: Ссылка на <a href="../audiocontext"> <code>AudioContext</code> </a> . Этот параметр был удален из спецификации.
zh_cn: 对<a href="../audiocontext"> <code>AudioContext</code> </a>的引用。该参数已从规格中删除。

source: A reference to an <a href="../rtccertificate"><code>RTCCertificate</code></a> object.
ja: <a href="../rtccertificate"> <code>RTCCertificate</code> </a>オブジェクトへの参照。
ko: <a href="../rtccertificate"> <code>RTCCertificate</code> </a> 객체에 대한 참조 입니다.
ru: Ссылка на объект <a href="../rtccertificate"> <code>RTCCertificate</code> </a> .
zh_cn: 对<a href="../rtccertificate"> <code>RTCCertificate</code> </a>对象的引用。

source: A reference to the <a href="../audioparam"><code>AudioParam</code></a> it was called on.
ja: 呼び出された<a href="../audioparam"> <code>AudioParam</code> </a>への参照。
ko: <a href="../audioparam"> <code>AudioParam</code> 에</a> 대한 참조 가 호출되었습니다.
ru: Ссылка на <a href="../audioparam"> <code>AudioParam</code> ,</a> на который он был вызван.
zh_cn: 对<a href="../audioparam"> <code>AudioParam</code> </a>它的AudioParam的引用。

source: A reference to the <a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/main"><code>&lt;main&gt;</code></a> element's <a href="../htmlelement"><code>HTMLElement</code></a> object in the DOM. This is where we'll insert the articles and ads.
ja: DOM内の<a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/main"> <code>&lt;main&gt;</code> </a>要素の<a href="../htmlelement"> <code>HTMLElement</code> </a>オブジェクトへの参照。ここに記事と広告を挿入します。
ko: 받는 참조 <a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/main"> <code>&lt;main&gt;</code> </a> 요소의 <a href="../htmlelement"> <code>HTMLElement</code> </a> DOM에있는 물체. 여기에 기사와 광고를 삽입 할 것입니다.
ru: Ссылка на объект <a href="../htmlelement"> <code>HTMLElement</code> </a> элемента <a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/main"> <code>&lt;main&gt;</code> </a> в DOM. Здесь мы будем вставлять статьи и рекламу.
zh_cn: 对DOM中<a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/main"> <code>&lt;main&gt;</code> </a>元素的<a href="../htmlelement"> <code>HTMLElement</code> </a>对象的引用。我们将在此处插入文章和广告。

source: A reference to the <code><a href="../window">window</a></code> object that sent the message; you can use this to establish two-way communication between two windows with different origins.
ja: メッセージを送信した <code><a href="../window">window</a></code> オブジェクトへの参照。これを使用して、発信元が異なる2つのウィンドウ間で双方向通信を確立できます。
ko: 메시지를 보낸 <code><a href="../window">window</a></code> 개체에 대한 참조입니다 . 이를 사용하여 원점이 다른 두 창간에 양방향 통신을 설정할 수 있습니다.
ru: Ссылка на объект <code><a href="../window">window</a></code> который отправил сообщение; Вы можете использовать это для установления двусторонней связи между двумя окнами с различным происхождением.
zh_cn: 对发送消息的 <code><a href="../window">window</a></code> 对象的引用；您可以使用它在两个起源不同的窗口之间建立双向通信。

source: A reference to the currently registered target for the event. This is the object to which the event is currently slated to be sent; it's possible this has been changed along the way through <em>retargeting</em>.
ja: イベントに現在登録されているターゲットへの参照。これは、現在イベントが送信される予定のオブジェクトです。これは、<em>リターゲティング</em>の途中で変更された可能性があります。
ko: 이벤트에 현재 등록 된 대상에 대한 참조입니다. 이벤트가 현재 전송 될 예정인 객체입니다. <em>리 타겟팅을</em> 통해 변경되었을 가능성이 있습니다 .
ru: Ссылка на текущую зарегистрированную цель для события. Это объект, которому в настоящее время планируется отправить событие; возможно, это было изменено в процессе <em>ретаргетинга</em> .
zh_cn: 对事件的当前注册目标的引用。这是事件当前要发送到的对象；很有可能通过<em>重新定位</em>改变了这一过程。

source: A reference to the object that dispatched the event. It is different from <a href="currenttarget"><code>event.currentTarget</code></a> when the event handler is called during the bubbling or capturing phase of the event.
ja: イベントを送出したオブジェクトへの参照。これは、イベントのバブリング段階またはキャプチャ段階でイベントハンドラーが呼び出されるときの<a href="currenttarget"> <code>event.currentTarget</code> </a>とは異なります。
ko: 이벤트를 전달한 객체에 대한 참조입니다. 이벤트의 버블 링 또는 캡처 단계에서 이벤트 핸들러가 호출되면 <a href="currenttarget"> <code>event.currentTarget</code> </a> 과 다릅니다 .
ru: Ссылка на объект, отправивший событие. Он отличается от <a href="currenttarget"> <code>event.currentTarget</code> ,</a> когда обработчик события вызывается во время фазы всплытия или захвата события.
zh_cn: 对调度事件的对象的引用。在事件的冒泡或捕获阶段调用事件处理程序时，它与<a href="currenttarget"> <code>event.currentTarget</code> </a>不同。

source: A reference to the parent of the current window or subframe.
ja: 現在のウィンドウまたはサブフレームの親への参照。
ko: 현재 윈도우 또는 서브 프레임의 부모에 대한 참조입니다.
ru: Ссылка на родителя текущего окна или подкадров.
zh_cn: 对当前窗口或子框架的父框架的引用。

source: A reference to the target to which the event was originally dispatched.
ja: イベントが最初にディスパッチされたターゲットへの参照。
ko: 이벤트가 원래 전달 된 대상에 대한 참조입니다.
ru: Ссылка на цель,на которую изначально было отправлено событие.
zh_cn: 对事件最初被发送的目标的引用。

source: A reference to the window that will receive the message. Methods for obtaining such a reference include:
ja: メッセージを受信するウィンドウへの参照。このような参照を取得するための方法には、以下のようなものがあります。
ko: 메시지를받을 창에 대한 참조입니다. 이러한 참조를 얻는 방법은 다음과 같습니다.
ru: Ссылка на окно,в котором будет получено сообщение.Методы получения такой ссылки включают в себя:
zh_cn: 对将接收该消息的窗口的引用。获得这种参考资料的方法包括:

source: A reference to this <code>AudioParam</code> object. In some browsers older implementations of this interface return void.
ja: この <code>AudioParam</code> オブジェクトへの参照。一部のブラウザでは、このインターフェースの古い実装はvoidを返します。
ko: 이 <code>AudioParam</code> 객체에 대한 참조 입니다. 일부 브라우저에서이 인터페이스의 이전 구현은 void를 반환합니다.
ru: Ссылка на этот объект <code>AudioParam</code> . В некоторых браузерах более старые реализации этого интерфейса возвращают void.
zh_cn: 对此 <code>AudioParam</code> 对象的引用。在某些浏览器中，此接口的较早实现会返回void。

source: A reference to this <code>AudioParam</code> object. In some older implementations this method returns void.
ja: この <code>AudioParam</code> オブジェクトへの参照。一部の古い実装では、このメソッドはvoidを返します。
ko: 이 <code>AudioParam</code> 객체에 대한 참조 입니다. 일부 이전 구현에서이 메소드는 void를 리턴합니다.
ru: Ссылка на этот объект <code>AudioParam</code> . В некоторых более старых реализациях этот метод возвращает void.
zh_cn: 对此 <code>AudioParam</code> 对象的引用。在某些较旧的实现中，此方法返回void。
