Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/dom/dom.*.011.xlf
Languages: ja, ko, ru, zh_cn

source: A reference to this <code>AudioParam</code> object. Some older browser implementations of this interface return <code>undefined</code>.
ja: この <code>AudioParam</code> オブジェクトへの参照。このインターフェイスの一部の古いブラウザ実装は、 <code>undefined</code> 返します。
ko: 이 <code>AudioParam</code> 객체에 대한 참조 입니다. 이 인터페이스의 일부 구형 브라우저 구현은 <code>undefined</code> 를 반환 합니다.
ru: Ссылка на этот объект <code>AudioParam</code> . Некоторые старые реализации браузера этого интерфейса возвращают <code>undefined</code> .
zh_cn: 对此 <code>AudioParam</code> 对象的引用。此接口的某些较旧的浏览器实现返回 <code>undefined</code> 。

source: A reference to this <code>AudioParam</code> object. Some older browser implementations of this interface return void.
ja: この <code>AudioParam</code> オブジェクトへの参照。このインターフェイスの一部の古いブラウザ実装はvoidを返します。
ko: 이 <code>AudioParam</code> 객체에 대한 참조 입니다. 이 인터페이스의 일부 구형 브라우저 구현은 void를 반환합니다.
ru: Ссылка на этот объект <code>AudioParam</code> . Некоторые старые реализации этого интерфейса в браузерах возвращают void.
zh_cn: 对此 <code>AudioParam</code> 对象的引用。此接口的某些较旧的浏览器实现返回void。

source: A relay candidate is generated just like a server reflexive candidate (<code>"srflx"</code>), but using <a href="https://developer.mozilla.org/en-US/docs/Glossary/TURN">TURN</a> instead of <a href="https://developer.mozilla.org/en-US/docs/Glossary/STUN">STUN</a>.
ja: リレー候補はサーバー再帰候補（ <code>"srflx"</code> ）と同じように生成されますが、<a href="https://developer.mozilla.org/en-US/docs/Glossary/STUN">STUN</a>ではなく<a href="https://developer.mozilla.org/en-US/docs/Glossary/TURN">TURN</a>を使用します。
ko: 릴레이 후보는 서버 재귀 후보 ( <code>"srflx"</code> ) 처럼 생성 되지만 <a href="https://developer.mozilla.org/en-US/docs/Glossary/STUN">STUN</a> 대신 <a href="https://developer.mozilla.org/en-US/docs/Glossary/TURN">TURN을</a> 사용 합니다.
ru: Кандидат на ретрансляцию генерируется так же, как и серверный рефлексивный кандидат ( <code>"srflx"</code> ), но с использованием <a href="https://developer.mozilla.org/en-US/docs/Glossary/TURN">TURN</a> вместо <a href="https://developer.mozilla.org/en-US/docs/Glossary/STUN">STUN</a> .
zh_cn: 就像服务器自反候选者（ <code>"srflx"</code> ）一样，生成中继候选者，但是使用<a href="https://developer.mozilla.org/en-US/docs/Glossary/TURN">TURN</a>而不是<a href="https://developer.mozilla.org/en-US/docs/Glossary/STUN">STUN</a>。

source: A repository of information, typically comprising one or more <a href="#gloss_object_store"><em>object stores</em></a>. Each database must have the following:
ja: 通常は1つ以上の<a href="#gloss_object_store"><em>オブジェクトストアで</em></a>構成される情報のリポジトリ。各データベースには次のものが必要です。
ko: 일반적으로 하나 이상의 <a href="#gloss_object_store"><em>객체 저장소를</em></a> 포함하는 정보 <em>저장소</em> . 각 데이터베이스에는 다음이 있어야합니다.
ru: Хранилище информации, обычно включающее одно или несколько <a href="#gloss_object_store"><em>хранилищ объектов</em></a> . Каждая база данных должна иметь следующее:
zh_cn: 信息库，通常包括一个或多个<a href="#gloss_object_store"><em>对象库</em></a>。每个数据库必须具有以下内容：

source: A request made via <code>XMLHttpRequest</code> can fetch the data in one of two ways, asynchronously or synchronously. The type of request is dictated by the optional <code>async</code> argument (the third argument) that is set on the <a href="open"><code>XMLHttpRequest.open()</code></a> method. If this argument is <code>true</code> or not specified, the <code>XMLHttpRequest</code> is processed asynchronously, otherwise the process is handled synchronously. A detailed discussion and demonstrations of these two types of requests can be found on the <a href="https://developer.mozilla.org/en-US/docs/DOM/XMLHttpRequest/Synchronous_and_Asynchronous_Requests">synchronous and asynchronous requests</a> page. Do not use synchronous requests outside Web Workers.
ja: <code>XMLHttpRequest</code> を介して行われたリクエストは、非同期または同期の2つの方法のいずれかでデータをフェッチできます。要求のタイプは、<a href="open"> <code>XMLHttpRequest.open()</code> </a>メソッドで設定されるオプションの <code>async</code> 引数（3番目の引数）によって決定されます。この引数が <code>true</code> または指定されていない場合、 <code>XMLHttpRequest</code> は非同期で処理されます。それ以外の場合、処理は同期で処理されます。これら2種類のリクエストの詳細な説明とデモンストレーションは、<a href="https://developer.mozilla.org/en-US/docs/DOM/XMLHttpRequest/Synchronous_and_Asynchronous_Requests">同期リクエスト</a>ページと非同期リクエストページにあります。 Webワーカーの外部で同期リクエストを使用しないでください。
ko: <code>XMLHttpRequest</code> 를 통한 요청은 비동기식 또는 동기식의 두 가지 방법 중 하나로 데이터를 가져올 수 있습니다. 요청 유형은 <a href="open"> <code>XMLHttpRequest.open()</code> </a> 메소드 에 설정된 선택적 <code>async</code> 인수 (세 번째 인수) 에 의해 결정됩니다 . 이 인수가 <code>true</code> 이거나 지정되지 않으면 <code>XMLHttpRequest</code> 가 비동기 적으로 처리되고, 그렇지 않으면 프로세스가 동 기적으로 처리됩니다. 이 두 가지 유형의 요청에 대한 자세한 논의 및 데모는 <a href="https://developer.mozilla.org/en-US/docs/DOM/XMLHttpRequest/Synchronous_and_Asynchronous_Requests">동기 및 비동기 요청</a> 페이지 에서 찾을 수 있습니다 . 웹 워커 외부에서 동기 요청을 사용하지 마십시오.
ru: Запрос, сделанный через <code>XMLHttpRequest</code> , может извлекать данные одним из двух способов, асинхронно или синхронно. Тип запроса определяется необязательным <code>async</code> аргументом (третий аргумент), который устанавливается в методе <a href="open"> <code>XMLHttpRequest.open()</code> </a> . Если этот аргумент имеет значение <code>true</code> или не указан, <code>XMLHttpRequest</code> обрабатывается асинхронно, в противном случае процесс обрабатывается синхронно. Подробное обсуждение и демонстрации этих двух типов запросов можно найти на странице <a href="https://developer.mozilla.org/en-US/docs/DOM/XMLHttpRequest/Synchronous_and_Asynchronous_Requests">синхронных и асинхронных запросов</a> . Не используйте синхронные запросы вне Web Workers.
zh_cn: 通过 <code>XMLHttpRequest</code> 发出的请求可以异步或同步两种方式之一获取数据。请求的类型由<a href="open"> <code>XMLHttpRequest.open()</code> </a>方法上设置的可选 <code>async</code> 参数（第三个参数）决定。如果此参数为 <code>true</code> 或未指定，则将异步处理 <code>XMLHttpRequest</code> ，否则将同步处理该过程。可以在<a href="https://developer.mozilla.org/en-US/docs/DOM/XMLHttpRequest/Synchronous_and_Asynchronous_Requests">同步和异步请求</a>页面上找到这两种类型的请求的详细讨论和演示。不要在Web Workers外部使用同步请求。

source: A request was placed against a transaction which is currently not active, or which is finished (No legacy code value and constant name).
ja: 現在アクティブでない、または終了したトランザクションに対してリクエストが置かれました(レガシーコードの値と定数名がありません)。
ko: 현재 활성화되지 않았거나 완료된 트랜잭션 (레거시 코드 값 및 상수 이름 없음)에 대한 요청이있었습니다.
ru: Запрос был направлен против транзакции,которая в настоящее время не активна,или которая завершена (Нет старого значения кода и постоянного имени).
zh_cn: 一个请求被放置在一个当前不活跃的事务上,或者是一个已经结束的事务上(没有遗留的代码值和常量名称)。

source: A required file or directory could not be found at the time an operation was processed. For example, a file did not exist but was being opened.
ja: 操作が処理されたときに、必要なファイルまたはディレクトリが見つかりませんでした。例えば、ファイルが存在しなかったが、開いていた場合などです。
ko: 작업을 처리 할 때 필요한 파일 또는 디렉토리를 찾을 수 없습니다. 예를 들어 파일이 존재하지 않았지만 열려있었습니다.
ru: Необходимый файл или каталог не мог быть найден в момент обработки операции.Например,файл не существовал,но был открыт.
zh_cn: 在处理操作时,找不到所需的文件或目录。例如,一个文件不存在,但正在被打开。

source: A result containing a single boolean value. This is useful for example, in an XPath expression using the <code>not()</code> function.
ja: 単一のブール値を含む結果。これは、たとえば、 <code>not()</code> 関数を使用するXPath式で役立ちます。
ko: 단일 부울 값을 포함하는 결과입니다. 예를 들어 <code>not()</code> 함수를 사용하는 XPath 표현식에서 유용 합니다.
ru: Результат, содержащий единственное логическое значение. Это полезно, например, в выражении XPath с использованием функции <code>not()</code> .
zh_cn: 包含单个布尔值的结果。例如，这在使用 <code>not()</code> 函数的XPath表达式中很有用。

source: A result containing a single number. This is useful for example, in an XPath expression using the <code>count()</code> function.
ja: 単一の数値を含む結果。これは、たとえば、 <code>count()</code> 関数を使用するXPath式で役立ちます。
ko: 단일 숫자를 포함하는 결과. 예를 들어 <code>count()</code> 함수를 사용하는 XPath 표현식에서 유용 합니다.
ru: Результат, содержащий одно число. Это полезно, например, в выражении XPath с использованием функции <code>count()</code> .
zh_cn: 包含单个数字的结果。例如，这在使用 <code>count()</code> 函数的XPath表达式中很有用。

source: A result containing a single string.
ja: 1つの文字列を含む結果。
ko: 단일 문자열을 포함하는 결과.
ru: Результат,содержащий одну строку.
zh_cn: 一个包含单个字符串的结果。

source: A result node-set containing all the nodes matching the expression. The nodes in the result set are in the same order that they appear in the document.
ja: 式にマッチするすべてのノードを含む結果ノードセット。結果セット内のノードは、ドキュメント内に表示される順番と同じです。
ko: 표현식과 일치하는 모든 노드를 포함하는 결과 노드 세트. 결과 집합의 노드는 문서에 나타나는 순서와 동일합니다.
ru: Полученный набор узлов,содержащий все узлы,соответствующие выражению.Узлы в результирующем наборе расположены в том же порядке,что и в документе.
zh_cn: 一个结果节点集,包含所有与表达式匹配的节点。结果集中的节点与它们在文档中出现的顺序相同。

source: A result node-set containing all the nodes matching the expression. The nodes may not necessarily be in the same order that they appear in the document.
ja: 式にマッチするすべてのノードを含む結果ノードセット。ノードは必ずしもドキュメント内で表示される順序と同じであるとは限りません。
ko: 표현식과 일치하는 모든 노드를 포함하는 결과 노드 세트. 노드가 반드시 문서에 나타나는 순서와 다를 수 있습니다.
ru: Полученный набор узлов,содержащий все узлы,соответствующие выражению.Узлы не обязательно должны быть в том же порядке,что и в документе.
zh_cn: 一个结果节点集,包含所有与表达式匹配的节点。节点的顺序不一定与文档中出现的顺序相同。

source: A result node-set containing any single node that matches the expression. The node is not necessarily the first node in the document that matches the expression.
ja: 式にマッチする任意の単一ノードを含む結果ノードセット。このノードは、必ずしも式にマッチするドキュメントの最初のノードであるとは限りません。
ko: 표현식과 일치하는 단일 노드를 포함하는 결과 노드 세트. 노드가 반드시 문서에서 표현식과 일치하는 첫 번째 노드는 아닙니다.
ru: Результирующий узел,содержащий любой одиночный узел,соответствующий выражению.Узел не обязательно является первым узлом в документе,который соответствует выражению.
zh_cn: 一个结果节点集,包含与表达式匹配的任何一个节点。该节点不一定是文档中第一个匹配表达式的节点。

source: A result node-set containing snapshots of all the nodes matching the expression. The nodes in the result set are in the same order that they appear in the document.
ja: 式に一致するすべてのノードのスナップショットを含む結果ノードセット。結果セットのノードは、ドキュメントに表示される順番と同じです。
ko: 표현식과 일치하는 모든 노드의 스냅 샷을 포함하는 결과 노드 세트. 결과 집합의 노드는 문서에 나타나는 순서와 동일합니다.
ru: Результат-набор узлов,содержащий снимки всех узлов,соответствующих выражению.Узлы в результирующем наборе расположены в том же порядке,в котором они появляются в документе.
zh_cn: 一个结果节点集,包含与表达式匹配的所有节点的快照。结果集中的节点与它们在文档中出现的顺序相同。

source: A result node-set containing snapshots of all the nodes matching the expression. The nodes may not necessarily be in the same order that they appear in the document.
ja: 式にマッチするすべてのノードのスナップショットを含む結果ノードセット。ノードは必ずしもドキュメント内で表示される順序と同じであるとは限りません。
ko: 표현식과 일치하는 모든 노드의 스냅 샷을 포함하는 결과 노드 세트. 노드가 반드시 문서에 나타나는 순서와 다를 수 있습니다.
ru: Результат-набор узлов,содержащий снимки всех узлов,соответствующих выражению.Узлы не обязательно должны быть в том же порядке,что и в документе.
zh_cn: 一个结果节点集,包含与表达式匹配的所有节点的快照。节点的顺序不一定与文档中的顺序相同。

source: A result node-set containing the first node in the document that matches the expression.
ja: 式にマッチするドキュメント内の最初のノードを含む結果ノードセット。
ko: 문서에서 표현식과 일치하는 첫 번째 노드를 포함하는 결과 노드 세트입니다.
ru: Результирующий узел,содержащий первый узел в документе,совпадающий с выражением.
zh_cn: 一个结果节点集,包含文档中与表达式匹配的第一个节点。

source: A result set containing a single boolean value. Useful, for example, an an XPath expression using the <code>not()</code> function.
ja: 単一のブール値を含む結果セット。たとえば、 <code>not()</code> 関数を使用したXPath式が便利です。
ko: 단일 부울 값을 포함하는 결과 세트. 예를 들어 <code>not()</code> 함수를 사용하는 XPath 표현식이 유용 합니다.
ru: Результирующий набор, содержащий единственное логическое значение. Полезно, например, выражение XPath с использованием функции <code>not()</code> .
zh_cn: 一个包含单个布尔值的结果集。有用，例如，使用 <code>not()</code> 函数的XPath表达式。

source: A result set containing a single number. Useful, for example, in an XPath expression using the <code>count()</code> function.
ja: 単一の数値を含む結果セット。たとえば、 <code>count()</code> 関数を使用するXPath式で役立ちます。
ko: 단일 숫자를 포함하는 결과 집합. 예를 들어 <code>count()</code> 함수를 사용하는 XPath 표현식에서 유용 합니다.
ru: Результирующий набор, содержащий одно число. Полезно, например, в выражении XPath с использованием функции <code>count()</code> .
zh_cn: 一个包含单个数字的结果集。有用，例如，在使用 <code>count()</code> 函数的XPath表达式中。

source: A result set containing a single string.
ja: 1つの文字列を含む結果セット。
ko: 단일 문자열을 포함하는 결과 집합.
ru: Набор результатов,содержащий одну строку.
zh_cn: 一个包含单个字符串的结果集。

source: A result set containing all the nodes matching the expression. The nodes in the result set are in the same order they appear in the document.
ja: 式にマッチするすべてのノードを含む結果セット。結果セット内のノードは、ドキュメント内で表示される順番と同じです。
ko: 표현식과 일치하는 모든 노드를 포함하는 결과 세트. 결과 집합의 노드는 문서에 나타나는 순서와 동일합니다.
ru: Набор результатов,содержащий все вершины,соответствующие выражению.Узлы результирующего множества расположены в том же порядке,что и в документе.
zh_cn: 一个包含所有与表达式匹配的节点的结果集。结果集中的节点与文档中的节点顺序相同。

source: A result set containing all the nodes matching the expression. The nodes in the result set are not necessarily in the same order they appear in the document.
ja: 式にマッチするすべてのノードを含む結果セット。結果セット内のノードは、必ずしもドキュメント内で表示される順番が同じであるとは限りません。
ko: 표현식과 일치하는 모든 노드를 포함하는 결과 세트. 결과 집합의 노드가 반드시 문서에 나타나는 순서와 반드시 같은 것은 아닙니다.
ru: Набор результатов,содержащий все вершины,соответствующие выражению.Узлы результирующего множества не обязательно располагаются в том же порядке,в каком они появляются в документе.
zh_cn: 一个包含所有与表达式匹配的节点的结果集。结果集中的节点在文档中出现的顺序不一定相同。

source: A result set containing any single node that matches the expression. The node is not necessarily the first node in the document that matches the expression.
ja: 式に一致する任意の単一ノードを含む結果セット。このノードは、必ずしも式にマッチするドキュメントの最初のノードであるとは限りません。
ko: 표현식과 일치하는 단일 노드를 포함하는 결과 세트. 노드가 반드시 문서에서 표현식과 일치하는 첫 번째 노드는 아닙니다.
ru: Результирующий набор,содержащий любой одиночный узел,соответствующий выражению.Узел не обязательно является первым узлом в документе,который соответствует выражению.
zh_cn: 一个结果集,包含与表达式匹配的任何一个节点。该节点不一定是文档中与表达式匹配的第一个节点。

source: A result set containing snapshots of all the nodes matching the expression. The nodes in the result set are in the same order they appear in the document.
ja: 式にマッチするすべてのノードのスナップショットを含む結果セット。結果セット内のノードは、ドキュメント内で表示される順番と同じです。
ko: 표현식과 일치하는 모든 노드의 스냅 샷을 포함하는 결과 세트. 결과 집합의 노드는 문서에 나타나는 순서와 동일합니다.
ru: Результирующий набор,содержащий снимки всех узлов,соответствующих выражению.Узлы результирующего множества расположены в том же порядке,что и в документе.
zh_cn: 一个结果集,包含与表达式匹配的所有节点的快照。结果集中的节点与文档中的节点顺序相同。

source: A result set containing snapshots of all the nodes matching the expression. The nodes in the result set are not necessarily in the same order they appear in the document.
ja: 式にマッチするすべてのノードのスナップショットを含む結果セット。結果セット内のノードは、ドキュメント内で表示される順番が必ずしも同じとは限りません。
ko: 표현식과 일치하는 모든 노드의 스냅 샷을 포함하는 결과 세트. 결과 집합의 노드가 반드시 문서에 나타나는 순서와 반드시 같은 것은 아닙니다.
ru: Результирующий набор,содержащий снимки всех узлов,соответствующих выражению.Узлы результирующего множества не обязательно располагаются в том же порядке,в каком они появляются в документе.
zh_cn: 一个结果集,包含与表达式匹配的所有节点的快照。结果集中的节点不一定与文档中的顺序相同。

source: A result set containing the first node in the document that matches the expression.
ja: 式にマッチするドキュメント内の最初のノードを含む結果セット。
ko: 문서에서 표현식과 일치하는 첫 번째 노드를 포함하는 결과 세트.
ru: Набор результатов,содержащий первый узел в документе,совпадающий с выражением.
zh_cn: 一个结果集,包含文档中与表达式匹配的第一个节点。

source: A result set containing whatever type naturally results from evaluation of the expression. Note that if the result is a node-set then <code>UNORDERED_NODE_ITERATOR_TYPE</code> is always the resulting type.
ja: 当然のことながら、式の評価から生じるすべてのタイプを含む結果セット。結果がノードセットである場合、 <code>UNORDERED_NODE_ITERATOR_TYPE</code> は常に結果のタイプであることに注意してください。
ko: 식 평가에서 자연스럽게 발생하는 모든 유형을 포함하는 결과 집합. 결과가 노드 세트 인 경우 <code>UNORDERED_NODE_ITERATOR_TYPE</code> 은 항상 결과 유형입니다.
ru: Результирующий набор, содержащий любой тип, естественно, является результатом оценки выражения. Обратите внимание, что если результатом является набор узлов, тогда <code>UNORDERED_NODE_ITERATOR_TYPE</code> всегда является результирующим типом.
zh_cn: 包含任何类型的结果集自然都来自表达式的评估。请注意，如果结果是节点集，则 <code>UNORDERED_NODE_ITERATOR_TYPE</code> 始终是结果类型。

source: A sample application: Web Dictaphone
ja: サンプルアプリです。ウェブディクタフォン
ko: 샘플 애플리케이션 : Web Dictaphone
ru: Образец заявления:Веб-диктофон
zh_cn: 一个应用样本。网络录音机

source: A sample is a single float32 value that represents the value of the audio stream at each specific point in time, in a specific channel (left or right, if in the case of stereo). A frame, or sample frame, is the set of all values for all channels that will play at a specific point in time: all the samples of all the channels that play at the same time (two for a stereo sound, six for 5.1, etc.)
ja: サンプルは、特定のチャンネル(ステレオの場合は左または右)の各特定の時点でのオーディオストリームの値を表す float32 の 1 つの値です。フレーム(サンプルフレーム)とは、特定の時点で再生されるすべてのチャンネルのすべての値の集合、つまり、同時に再生されるすべてのチャンネルのすべてのサンプル(ステレオサウンドの場合は2つ、5.1の場合は6つなど)のことです。
ko: 샘플은 특정 채널 (스테레오의 경우 왼쪽 또는 오른쪽)에서 각 특정 시점의 오디오 스트림 값을 나타내는 단일 float32 값입니다. 프레임 또는 샘플 프레임은 특정 시점에서 재생할 모든 채널의 모든 값 집합입니다. 동시에 재생되는 모든 채널의 모든 샘플 (스테레오 사운드의 경우 2 개, 5.1의 경우 6 개, 기타.)
ru: Сэмпл-это одно значение с плавающей запятой32,которое представляет собой значение аудио потока в каждый конкретный момент времени,в определенном канале (левый или правый,если в случае стерео).Кадр,или сэмпл-это набор всех значений для всех каналов,которые будут проигрываться в определенный момент времени:все сэмплы всех каналов,которые проигрываются одновременно (два для стереозвука,шесть для 5.1 и т.д.).
zh_cn: 一个样本是一个单一的float32值,它代表音频流在每个特定时间点、特定通道(如果是立体声,则为左或右)的值。一帧,或称采样帧,是所有通道在特定时间点播放的所有值的集合:所有通道同时播放的所有采样(对于立体声来说是两个,对于5.1来说是六个,等等)。

source: A scale matrix makes something larger or smaller in one of 3 dimension: width, height, and depth. In typical (cartesian) coordinates this would be stretching and shrinking in x, y, and z.
ja: スケールマトリクスは、幅、高さ、奥行きの3次元のうちの1つで何かを大きくしたり小さくしたりします。典型的な(直交)座標では、これは x,y,z の伸縮になります。
ko: 스케일 매트릭스는 폭, 높이 및 깊이의 3 차원 중 하나에서 더 크거나 작은 것을 만듭니다. 일반적인 (카테 시안) 좌표에서 이것은 x, y 및 z에서 늘어나거나 줄어 듭니다.
ru: Матрица шкал делает что-то большее или меньшее в одном из 3-х измерений:ширина,высота и глубина.В типичных (картезианских)координатах это будет растягивание и сжатие в x,y и z.
zh_cn: 缩放矩阵使某物在3个维度中的一个维度上变大或变小:宽度、高度和深度。在典型的(笛卡尔)坐标中,这将是在x、y和z上的拉伸和收缩。

source: A screencast by Chromium developer Rafael Weinstein
ja: Chromium開発者Rafael Weinstein氏によるスクリーンキャスト
ko: Chromium 개발자 Rafael Weinstein의 스크린 캐스트
ru: Скринкаст разработчика Chromium Рафаэля Вайнштейна.
zh_cn: Chromium开发者Rafael Weinstein的屏幕直播。

source: A selection object represents the <a href="range"><code>ranges</code></a> that the user has selected. Typically, it holds only one range, accessed as follows:
ja: 選択オブジェクトは、ユーザーが選択した<a href="range"> <code>ranges</code> </a>を表します。通常、次のようにアクセスされる1つの範囲のみを保持します。
ko: 선택 개체는 사용자가 선택한 <a href="range"> <code>ranges</code> </a> 를 나타냅니다 . 일반적으로 다음과 같이 액세스하는 범위가 하나만 있습니다.
ru: Объект выбора представляет <a href="range"> <code>ranges</code> </a> которые выбрал пользователь. Как правило, он содержит только один диапазон, доступ к которому осуществляется следующим образом:
zh_cn: 选择对象代表用户已选择的<a href="range"> <code>ranges</code> </a>。通常，它仅包含一个范围，可通过以下方式访问：

source: A sensing device with a surface that can detect contact. Most commonly, the sensing device is a touch enable screen that can sense input from an input device such as a pen, stylus, or finger.
ja: 接触を検出できる表面を有するセンシングデバイス。最も一般的には、センシングデバイスは、ペン、スタイラス、または指などの入力デバイスからの入力を感知することができるタッチイネーブルスクリーンである。
ko: 접촉을 감지 할 수있는 표면이있는 감지 장치. 가장 일반적으로, 감지 장치는 펜, 스타일러스 또는 손가락과 같은 입력 장치로부터의 입력을 감지 할 수있는 터치 인 에이블 스크린이다.
ru: Считывающее устройство с поверхностью,способной обнаруживать контакт.Чаще всего это сенсорное устройство представляет собой экран с сенсорным управлением,на котором можно почувствовать входной сигнал от устройства ввода,например,пера,стилуса или пальца.
zh_cn: 具有可检测接触的表面的传感装置。最常见的传感装置是一个触摸式屏幕,它能感应到来自笔、手写笔或手指等输入设备的输入。

source: A sequence (array) of <a href="../trackdefault"><code>TrackDefault</code></a> objects.
ja: <a href="../trackdefault"> <code>TrackDefault</code> </a>オブジェクトのシーケンス（配列）。
ko: <a href="../trackdefault"> <code>TrackDefault</code> </a> 객체 의 시퀀스 (배열)
ru: Последовательность (массив) объектов <a href="../trackdefault"> <code>TrackDefault</code> </a> .
zh_cn: <a href="../trackdefault"> <code>TrackDefault</code> </a>对象的序列（数组）。

source: A sequence of <a href="../pointerevent"><code>PointerEvent</code></a> instances.
ja: <a href="../pointerevent"> <code>PointerEvent</code> </a>インスタンスのシーケンス。
ko: 일련의 <a href="../pointerevent"> <code>PointerEvent</code> </a> 인스턴스
ru: Последовательность экземпляров <a href="../pointerevent"> <code>PointerEvent</code> </a> .
zh_cn: 一系列<a href="../pointerevent"> <code>PointerEvent</code> </a>实例。

source: A sequence of <a href="../taskattributiontiming"><code>TaskAttributionTiming</code></a> instances.
ja: <a href="../taskattributiontiming"> <code>TaskAttributionTiming</code> </a>インスタンスのシーケンス。
ko: 일련의 <a href="../taskattributiontiming"> <code>TaskAttributionTiming</code> </a> 인스턴스입니다.
ru: Последовательность экземпляров <a href="../taskattributiontiming"> <code>TaskAttributionTiming</code> </a> .
zh_cn: 一系列<a href="../taskattributiontiming"> <code>TaskAttributionTiming</code> </a>实例。

source: A sequence of floating point numbers (for example a <a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Float32Array"><code>Float32Array</code></a> or an <a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Array"><code>Array</code></a> of numbers) for floating point vector methods (methods with "fv").
ja: 浮動小数点ベクトルメソッド（ "fv"を使用するメソッド）の一連の浮動小数点数（<a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Float32Array"> <code>Float32Array</code> </a>または数値の<a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Array"> <code>Array</code> </a>など）。
ko: 부동 소수점 벡터 방법 ( "fv"가있는 방법)에 대한 부동 소수점 숫자 시퀀스 (예 : <a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Float32Array"> <code>Float32Array</code> </a> 또는 숫자 <a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Array"> <code>Array</code> </a> )입니다.
ru: Последовательность чисел с плавающей точкой (например, <a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Float32Array"> <code>Float32Array</code> </a> или <a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Array"> <code>Array</code> </a> чисел) для векторных методов с плавающей точкой (методы с "fv").
zh_cn: 浮点向量方法（带&ldquo; fv&rdquo;的方法）的浮点数序列（例如<a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Float32Array"> <code>Float32Array</code> </a>或数字<a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Array"> <code>Array</code> </a>）。

source: A sequence of objects to <a href="../transferable">transfer</a>. These objects must also be present in the message.
ja: <a href="../transferable">転送</a>するオブジェクトのシーケンス。これらのオブジェクトもメッセージに存在する必要があります。
ko: <a href="../transferable">전송할</a> 객체의 순서 . 이러한 개체는 메시지에도 있어야합니다.
ru: Последовательность объектов для <a href="../transferable">передачи</a> . Эти объекты также должны присутствовать в сообщении.
zh_cn: 一系列要<a href="../transferable">转移</a>的对象。这些对象也必须出现在消息中。

source: A serialization of HTML was requested but could not succeed due to the content not being well-formed.
ja: HTMLのシリアライズが要求されましたが、コンテンツの形が整っていないために成功しませんでした。
ko: HTML의 직렬화가 요청되었지만 컨텐츠가 제대로 구성되지 않아서 성공하지 못했습니다.
ru: Была высказана просьба о сериализации HTML,но она не увенчалась успехом из-за того,что контент не был хорошо сформирован.
zh_cn: 请求对HTML进行序列化,但由于内容不完善,无法成功。
