Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/dom/dom.*.011.xlf
Languages: ja, ko, ru, zh_cn

source: A number indicating the number of <a href="../speechgrammar"><code>SpeechGrammar</code></a> objects contained in the <a href="../speechgrammarlist"><code>SpeechGrammarList</code></a>.
ja: <a href="../speechgrammar"> <code>SpeechGrammar</code> Listに</a>含まれるSpeechGrammarオブジェクトの数を示す<a href="../speechgrammarlist"> <code>SpeechGrammarList</code> </a>。
ko: 의 수를 나타내는 숫자 <a href="../speechgrammar"> <code>SpeechGrammar</code> 는</a> 에 포함 된 객체 <a href="../speechgrammarlist"> <code>SpeechGrammarList</code> </a> .
ru: Число, указывающее количество объектов <a href="../speechgrammar"> <code>SpeechGrammar</code> ,</a> содержащихся в <a href="../speechgrammarlist"> <code>SpeechGrammarList</code> </a> .
zh_cn: 一个数字，指示<a href="../speechgrammar"> <code>SpeechGrammar</code> List中</a>包含的SpeechGrammar对象的<a href="../speechgrammarlist"> <code>SpeechGrammarList</code> </a>。

source: A number indicating the size of the file in bytes.
ja: ファイルのサイズをバイト単位で示す数値。
ko: 파일 크기를 바이트 단위로 나타내는 숫자입니다.
ru: Число,указывающее размер файла в байтах.
zh_cn: 表示文件大小的数字,以字节为单位。

source: A number indicating the state of the <code>FileReader</code>. This is one of the following:
ja: <code>FileReader</code> の状態を示す数値。これは次のいずれかです。
ko: <code>FileReader</code> 상태를 나타내는 숫자 입니다. 이것은 다음 중 하나입니다.
ru: Число, указывающее состояние <code>FileReader</code> . Это одно из следующего:
zh_cn: 一个数字，指示 <code>FileReader</code> 的状态。这是下列之一：

source: A number representing a given button:
ja: 指定されたボタンを表す数値。
ko: 주어진 버튼을 나타내는 숫자 :
ru: Номер,представляющий данную кнопку:
zh_cn: 一个数字代表一个给定的按钮。

source: A number representing one or more buttons. For more than one button pressed simultaneously, the values are combined (e.g. 3 is primary + secondary).
ja: 1 つ以上のボタンを表す数値。複数のボタンが同時に押された場合、値は結合されます(例:3はプライマリ+セカンダリ)。
ko: 하나 이상의 버튼을 나타내는 숫자입니다. 둘 이상의 버튼을 동시에 누르면 값이 결합됩니다 (예 : 3은 1 차 + 2 차입니다).
ru: Число,представляющее одну или несколько кнопок.При одновременном нажатии нескольких кнопок значения объединяются (например,3 является первичным+вторичным).
zh_cn: 一个数字代表一个或多个按钮。对于同时按下的一个以上的按钮,其值将被合并(如3是主键+副键)。

source: A number representing the HTTP status code of the document or worker in which the violation occurred.
ja: 違反が発生したドキュメントまたはワーカーの HTTP ステータスコードを表す数値。
ko: 위반이 발생한 문서 또는 작업자의 HTTP 상태 코드를 나타내는 숫자입니다.
ru: Номер,представляющий код статуса HTTP документа или работника,в котором произошло нарушение.
zh_cn: 代表发生违规行为的文档或工作者的HTTP状态码的数字。

source: A number representing the ID of the specific <code>VRDisplay</code>.
ja: 特定の <code>VRDisplay</code> の IDを表す数値。
ko: 특정 <code>VRDisplay</code> 의 ID를 나타내는 숫자 입니다.
ru: Число, представляющее идентификатор конкретного <code>VRDisplay</code> .
zh_cn: 一个数字，代表特定 <code>VRDisplay</code> 的ID 。

source: A number representing the column number where the violation occurred.
ja: 違反が発生した列番号を表す番号。
ko: 위반이 발생한 열 번호를 나타내는 숫자입니다.
ru: Номер,представляющий собой номер столбца,в котором произошло нарушение.
zh_cn: 代表发生违规行为的列号的数字。

source: A number representing the current time in milliseconds, or <code>null</code> to deactivate the animation.
ja: 現在の時間をミリ秒で表す数値、またはアニメーションを非アクティブにする場合は <code>null</code> 。
ko: 현재 시간을 밀리 초 단위로 나타내는 숫자이거나 애니메이션을 비활성화하려면 <code>null</code> 입니다.
ru: Число, представляющее текущее время в миллисекундах, или <code>null</code> чтобы отключить анимацию.
zh_cn: 代表当前时间的数字（以毫秒为单位），或者为 <code>null</code> 以停用动画。

source: A number representing the current time in milliseconds, or <code>null</code>.
ja: 現在の時刻をミリ秒で表す数値、または <code>null</code> 。
ko: 현재 시간을 밀리 초 단위로 나타내는 숫자 또는 <code>null</code> 입니다.
ru: Число, представляющее текущее время в миллисекундах или <code>null</code> .
zh_cn: 一个代表当前时间的数字（以毫秒为单位），或者为 <code>null</code> 。

source: A number representing the end delay, specified in milliseconds. The default value is 0.
ja: 終了遅延をミリ秒単位で指定します。デフォルト値は 0 です。
ko: 종료 지연을 나타내는 숫자로 밀리 초 단위로 지정됩니다. 기본값은 0입니다.
ru: Число,представляющее конечную задержку,указанное в миллисекундах.Значение по умолчанию равно 0.
zh_cn: 表示结束延迟的数字,以毫秒为单位。默认值为0。

source: A number representing the interval of time, in milliseconds, at which data is obtained from the device.
ja: デバイスからデータを取得する時間間隔をミリ秒単位で表す数値。
ko: 장치에서 데이터를 얻는 시간 간격 (밀리 초)을 나타내는 숫자입니다.
ru: Число,представляющее собой интервал времени в миллисекундах,при котором данные получаются от прибора.
zh_cn: 表示从设备获取数据的时间间隔的数字,以毫秒为单位。

source: A number representing the line number at which the violation occurred.
ja: 違反が発生したライン番号を表す番号。
ko: 위반이 발생한 행 번호를 나타내는 숫자입니다.
ru: Номер,представляющий собой номер строки,на которой произошло нарушение.
zh_cn: 代表发生违章的线路号的数字。

source: A number representing the maximum returned alternatives for each result.
ja: 各結果に対して返される最大の選択肢を表す数値。
ko: 각 결과에 대한 최대 반환 대안을 나타내는 숫자입니다.
ru: Число,представляющее собой максимальное количество возвращаемых альтернатив для каждого результата.
zh_cn: 代表每个结果的最大返回替代品的数字。

source: A number representing the motion of the device around the x axis, express in degrees with values ranging from -180 to 180. This represents a front to back motion of the device.
ja: x 軸を中心としたデバイスの動きを表す数値で、-180~180 の範囲の値を度数で表します。これはデバイスの前後の動きを表します。
ko: x 축 주위의 장치 동작을 나타내는 숫자로 -180에서 180 사이의 값으로도 단위로 표시됩니다. 이는 장치의 앞뒤 움직임을 나타냅니다.
ru: Число,представляющее движение прибора вокруг оси х,выражается в градусах со значениями от -180 до 180.Оно представляет собой движение прибора спереди и сзади.
zh_cn: 代表设备围绕X轴运动的数字,以度数表示,数值范围为-180到180。这表示设备的前后运动。

source: A number representing the motion of the device around the y axis, express in degrees with values ranging from -90 to 90. This represents a left to right motion of the device.
ja: y 軸を中心としたデバイスの動きを表す数値で、-90 から 90 までの値を度数で表します。これはデバイスの左から右への動きを表します。
ko: y 축을 중심으로 한 장치의 움직임을 나타내는 숫자로, -90에서 90 사이의 값으로도 단위로 표시됩니다. 이것은 장치의 좌우 움직임을 나타냅니다.
ru: Число,представляющее движение прибора вокруг оси y,выражается в градусах со значениями от -90 до 90.Представляет собой движение прибора слева направо.
zh_cn: 代表设备围绕y轴运动的数字,以度数表示,数值范围为-90到90。这表示设备从左到右的运动。

source: A number representing the motion of the device around the z axis, express in degrees with values ranging from 0 to 360.
ja: z軸を中心としたデバイスの動きを表す数値で、0から360までの値を度数で表します。
ko: z 축 주위의 장치 동작을 나타내는 숫자로, 0에서 360 사이의 값으로도 단위로 표시됩니다.
ru: Число,представляющее движение прибора вокруг оси z,выражается в градусах со значениями от 0 до 360.
zh_cn: 代表设备围绕z轴运动的数字,以度数表示,数值范围为0到360。

source: A number representing the number of redirects since the last non-redirect navigation under the current browsing context.
ja: 現在のブラウジングコンテキストで最後にリダイレクトしないナビゲーションを行ってからのリダイレクトの数を表す数値。
ko: 현재 브라우징 컨텍스트에서 마지막 비 리디렉션 이후의 리디렉션 수를 나타내는 숫자입니다.
ru: Число,представляющее количество переадресаций с момента последней ненаправленной навигации в текущем контексте просмотра.
zh_cn: 代表自当前浏览环境下最后一次非重定向导航以来的重定向次数。

source: A number representing the remaining time in seconds until the battery is completely discharged and the system will suspend.
ja: バッテリーが完全に放電してシステムが停止するまでの残り時間を秒単位で表した数字。
ko: 배터리가 완전히 방전되고 시스템이 일시 중단 될 때까지 남은 시간 (초)을 나타내는 숫자입니다.
ru: Число,обозначающее оставшееся время в секундах,пока батарея не разрядится полностью,и система не остановится.
zh_cn: 代表电池完全放电和系统暂停前剩余时间的数字,以秒为单位。

source: A number representing the remaining time in seconds until the battery is fully charged, or 0 if the battery is already fully charged.
ja: バッテリーが完全に充電されるまでの残り時間を秒単位で表す数値、またはバッテリーがすでに完全に充電されている場合は0。
ko: 배터리가 완전히 충전 될 때까지 남은 시간 (초)을 나타내는 숫자이거나 배터리가 이미 완전히 충전 된 경우 0입니다.
ru: Число,обозначающее оставшееся время в секундах до полной зарядки аккумулятора,или 0,если аккумулятор уже полностью заряжен.
zh_cn: 表示电池充满电前的剩余时间,以秒为单位,如果电池已经充满电,则为0。

source: A number representing the state of the connection. Possible values are <code>CONNECTING</code> (<code>0</code>), <code>OPEN</code> (<code>1</code>), or <code>CLOSED</code> (<code>2</code>).
ja: 接続の状態を表す数値。可能な値は、 <code>CONNECTING</code> （ <code>0</code> ）、 <code>OPEN</code> （ <code>1</code> ）、または <code>CLOSED</code> （ <code>2</code> ）です。
ko: 연결 상태를 나타내는 숫자입니다. 가능한 값은 <code>CONNECTING</code> ( <code>0</code> ), <code>OPEN</code> ( <code>1</code> ) 또는 <code>CLOSED</code> ( <code>2</code> )입니다.
ru: Число, представляющее состояние соединения. Возможные значения: <code>CONNECTING</code> ( <code>0</code> ), <code>OPEN</code> ( <code>1</code> ) или <code>CLOSED</code> ( <code>2</code> ).
zh_cn: 代表连接状态的数字。可能的值为 <code>CONNECTING</code> （ <code>0</code> ）， <code>OPEN</code> （ <code>1</code> ）或 <code>CLOSED</code> （ <code>2</code> ）。

source: A number representing the state of the connection. Possible values are:
ja: 接続の状態を表す数値。指定可能な値は以下の通りです。
ko: 연결 상태를 나타내는 숫자입니다. 가능한 값은 다음과 같습니다.
ru: Номер,представляющий состояние соединения.Возможные значения:
zh_cn: 代表连接状态的数字。可能的值是:

source: A number representing the status code of the document or worker in which the violation occurred.
ja: 違反が発生した文書またはワーカーのステータスコードを表す番号。
ko: 위반이 발생한 문서 또는 작업자의 상태 코드를 나타내는 숫자입니다.
ru: Номер,представляющий собой код статуса документа или работника,в котором произошло нарушение.
zh_cn: 代表发生违规行为的文件或工人状态代码的数字。

source: A number representing the system's battery charge level scaled to a value between 0.0 and 1.0.
ja: システムのバッテリー充電レベルを表す数値で、0.0~1.0の間の値にスケーリングされています。
ko: 시스템의 배터리 충전 수준을 나타내는 숫자는 0.0에서 1.0 사이의 값으로 조정되었습니다.
ru: Число,представляющее уровень заряда батареи системы,масштабированное до значения между 0.0 и 1.0.
zh_cn: 代表系统电池充电水平的数字,比例为0.0至1.0之间的数值。

source: A number representing the timeline's current time in milliseconds, or <code>null</code> if the timeline is inactive.
ja: タイムラインの現在時刻をミリ秒で表す数値。タイムラインが非アクティブの場合は <code>null</code> 。
ko: 타임 라인의 현재 시간을 밀리 초 단위로 나타내는 숫자이거나 타임 라인이 비활성 인 경우 <code>null</code> 입니다.
ru: Число, представляющее текущее время временной шкалы в миллисекундах, или <code>null</code> если временная шкала неактивна.
zh_cn: 一个数字，以毫秒为单位表示时间轴的当前时间；如果时间轴处于非活动状态，则为 <code>null</code> 。

source: A number represents the difference between the motion of the device around the z axis of the world system and the direction of the north, express in degrees with values ranging from 0 to 360.
ja: 世界システムのz軸周りのデバイスの動きと北の方向との差を表す数値で、0から360までの値を度数で表します。
ko: 숫자는 월드 시스템의 z 축을 중심으로 한 장치의 움직임과 북쪽 방향의 차이를 나타내며 0에서 360 사이의 값으로도 단위로 표시됩니다.
ru: Число представляет собой разность между движением прибора вокруг оси z мировой системы и направлением севера,выраженное в градусах со значениями от 0 до 360.
zh_cn: 一个数字表示设备绕世界系统z轴的运动与北方方向的差值,用度数表示,数值从0到360不等。

source: A number specifying the delay, in milliseconds, from the start of the animation's play cycle to the beginning of its <strong>active interval</strong> (the time index at which actual animation begins). Defaults to 0.
ja: アニメーションの再生サイクルの開始から<strong>アクティブな間隔</strong>（実際のアニメーションが開始する時間インデックス）の開始までの遅延をミリ秒単位で指定する数値。デフォルトは0です。
ko: 애니메이션의 재생주기 시작부터 <strong>활성 간격</strong> 의 시작 (실제 애니메이션이 시작되는 시간 인덱스)까지 의 지연 시간을 밀리 초 단위로 지정하는 숫자 입니다. 기본값은 0입니다.
ru: Число, определяющее задержку в миллисекундах от начала цикла воспроизведения анимации до начала ее <strong>активного интервала</strong> (временной индекс, с которого начинается фактическая анимация). По умолчанию 0.
zh_cn: 一个数字，指定从动画播放周期开始到其<strong>活动间隔</strong>（实际动画开始的时间索引）开始的延迟（以毫秒为单位）。预设为0。

source: A number specifying the line width in coordinate space units. Zero, negative, <a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Infinity"><code>Infinity</code></a>, and <a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/NaN"><code>NaN</code></a> values are ignored. This value is <code>1.0</code> by default.
ja: 座標空間単位で線幅を指定する数値。ゼロ、負、<a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Infinity"> <code>Infinity</code> </a>、および<a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/NaN"> <code>NaN</code> の</a>値は無視されます。この値はデフォルトで <code>1.0</code> です。
ko: 좌표 공간 단위로 선 너비를 지정하는 숫자입니다. 0, 음수, <a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Infinity"> <code>Infinity</code> </a> 및 <a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/NaN"> <code>NaN</code> </a> 값은 무시됩니다. 이 값은 기본적으로 <code>1.0</code> 입니다.
ru: Число, определяющее ширину линии в единицах координатного пространства. Нулевые, отрицательные значения, значения <a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Infinity"> <code>Infinity</code> </a> и <a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/NaN"> <code>NaN</code> </a> игнорируются. Это значение <code>1.0</code> по умолчанию.
zh_cn: 一个数字，以坐标空间单位指定线宽。零，负，<a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Infinity"> <code>Infinity</code> </a>和<a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/NaN"> <code>NaN</code> </a>值将被忽略。默认情况下，此值为 <code>1.0</code> 。

source: A number specifying the miter limit ratio in coordinate space units. Zero, negative, <a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Infinity"><code>Infinity</code></a>, and <a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/NaN"><code>NaN</code></a> values are ignored. The default value is <code>10.0</code>.
ja: 座標空間単位でマイターリミット比を指定する数値。ゼロ、負、<a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Infinity"> <code>Infinity</code> </a>、および<a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/NaN"> <code>NaN</code> の</a>値は無視されます。デフォルト値は <code>10.0</code> です。
ko: 좌표 공간 단위로 연귀 제한 비율을 지정하는 숫자입니다. 0, 음수, <a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Infinity"> <code>Infinity</code> </a> 및 <a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/NaN"> <code>NaN</code> </a> 값은 무시됩니다. 기본값은 <code>10.0</code> 입니다.
ru: Число, определяющее предельное отношение митры в единицах координатного пространства. Нулевые, отрицательные значения, значения <a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Infinity"> <code>Infinity</code> </a> и <a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/NaN"> <code>NaN</code> </a> игнорируются. Значение по умолчанию <code>10.0</code> .
zh_cn: 一个数字，以坐标空间单位指定斜接极限比率。零，负，<a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Infinity"> <code>Infinity</code> </a>和<a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/NaN"> <code>NaN</code> </a>值将被忽略。默认值为 <code>10.0</code> 。

source: A number that represents the number of milliseconds since the Unix epoch.
ja: Unix のエポックからのミリ秒数を表す数値。
ko: 유닉스 시대 이후의 밀리 초 수를 나타내는 숫자입니다.
ru: Число,которое представляет собой количество миллисекунд,начиная с эпохи Unix.
zh_cn: 表示Unix纪元以来的毫秒数的数字。

source: A number which is one of the three possible state constants define for the <a href="../filereader"><code>FileReader</code></a> API:
ja: <a href="../filereader"> <code>FileReader</code> </a> API に対して定義される3つの可能な状態定数の1つである数：
ko: <a href="../filereader"> <code>FileReader</code> </a> API에 대해 정의 가능한 세 가지 상태 상수 중 하나 인 숫자는 다음과 같습니다.
ru: Число, которое является одной из трех возможных констант состояния, определяемых для API <a href="../filereader"> <code>FileReader</code> </a> :
zh_cn: 一个数字，它是为<a href="../filereader"> <code>FileReader</code> </a> API 定义的三个可能的状态常量之一：

source: A number which represents the general type of error that occurred, as follows:
ja: 以下のように、発生したエラーの一般的な種類を表す数値。
ko: 다음과 같이 발생한 일반적인 오류 유형을 나타내는 숫자입니다.
ru: Число,которое представляет собой общий тип возникшей ошибки,следующим образом:
zh_cn: 代表发生的一般错误类型的数字,如下所示:

source: A number whose range depends on the <a href="distancemodel"><code>distanceModel</code></a> of the panner as follows (negative values are not allowed):
ja: 次のように、範囲がパンナーの<a href="distancemodel"> <code>distanceModel</code> </a>に依存する数値（負の値は許可されません）：
ko: 범위는 다음과 같이 패 너의 <a href="distancemodel"> <code>distanceModel</code> </a> 에 따라 다릅니다 (음수 값은 허용되지 않음).
ru: Число, диапазон которого зависит от <a href="distancemodel"> <code>distanceModel</code> </a> панели, как показано ниже (отрицательные значения не допускаются):
zh_cn: 一个数字，其范围取决于panner 的<a href="distancemodel"> <code>distanceModel</code> </a>，如下所示（不允许使用负值）：

source: A number, <code>-1</code>, <code>0</code>, or <code>1</code>, indicating whether the corresponding boundary-point of the <a href="../range"><code>Range</code></a> is respectively before, equal to, or after the corresponding boundary-point of <em>sourceRange</em>.
ja: 数、 <code>-1</code> 、 <code>0</code> 、または <code>1</code> の対応する境界点か否かを示す、<a href="../range"> <code>Range</code> </a>前のそれぞれでは、、又はの対応する境界点の後に等しい<em>sourceRange</em>。
ko: <a href="../range"> <code>Range</code> </a> 의 해당 경계 지점 이 각각 <em>sourceRange</em> 의 해당 경계 지점 이전인지, 동일한 지 또는 이후 인지를 나타내는 숫자 <code>-1</code> , <code>0</code> 또는 <code>1</code> 입니다.<em></em>
ru: Число, <code>-1</code> , <code>0</code> или <code>1</code> , указывающее, находится ли соответствующая граничная точка <a href="../range"> <code>Range</code> </a> соответственно перед, равна или после соответствующей граничной точки <em>sourceRange</em> .
zh_cn: 一个数字， <code>-1</code> ， <code>0</code> ，或 <code>1</code> ，表示的相应的边界点是否<a href="../range"> <code>Range</code> </a>是分别之前，等于，或之后的相应的边界点<em>sourceRange</em>。

source: A number, representing the height in pixels.
ja: ピクセル単位の高さを表す数値。
ko: 픽셀 단위의 높이를 나타내는 숫자입니다.
ru: Число,представляющее высоту в пикселях.
zh_cn: 一个数字,代表高度,单位为像素。

source: A number, representing the width in pixels.
ja: ピクセル単位の幅を表す数値。
ko: 폭을 픽셀 단위로 나타내는 숫자입니다.
ru: Число,представляющее ширину в пикселях.
zh_cn: 一个数字,代表宽度,单位为像素。

source: A number, which must be 1 if <a href="canpresent"><code>VRDisplayCapabilities.canPresent</code></a> is <code>true</code>, or 0 otherwise.
ja: 数値<a href="canpresent"> <code>VRDisplayCapabilities.canPresent</code> </a>が <code>true</code> の場合は1、それ以外の場合は0 でなければなりません。
ko: <a href="canpresent"> <code>VRDisplayCapabilities.canPresent</code> </a> 가 <code>true</code> 이면 1이어야하고 그렇지 않으면 0 이어야합니다 .
ru: Число, которое должно быть 1, если <a href="canpresent"> <code>VRDisplayCapabilities.canPresent</code> </a> имеет значение <code>true</code> , или 0 в противном случае.
zh_cn: 一个数字，如果<a href="canpresent"> <code>VRDisplayCapabilities.canPresent</code> </a>为 <code>true</code> ，则必须为1；否则为0。

source: A number.
ja: 数です。
ko: 숫자
ru: Номер.
zh_cn: 一个号码。

source: A numeric argument is out of range. The command is ignored and the error flag is set.
ja: 数値引数が範囲外です。コマンドは無視され、エラーフラグが設定されます。
ko: 숫자 인수가 범위를 벗어났습니다. 명령이 무시되고 오류 플래그가 설정됩니다.
ru: Числовой аргумент находится вне диапазона.Команда игнорируется,и устанавливается флаг ошибки.
zh_cn: 数字参数超出范围。忽略该命令,并设置错误标志。

source: A numeric value approximating the amount of storage space currently being used by the site or Web app, out of the available space as indicated by <code>quota</code>.
ja: <code>quota</code> で示される使用可能なスペースのうち、サイトまたはWebアプリによって現在使用されているストレージスペースの概算の数値。
ko: <code>quota</code> 로 표시되는 사용 가능한 공간에서 사이트 또는 웹 앱이 현재 사용중인 저장 공간의 크기와 비슷한 숫자 값 입니다.
ru: Числовое значение, приблизительно равное количеству дискового пространства, которое в данный момент используется сайтом или веб-приложением, из свободного пространства, указанного в <code>quota</code> .
zh_cn: 一个数字值，该值近似于网站或Web应用程序当前正在使用的存储空间量，超出 <code>quota</code> 所指示的可用空间。

source: A numeric value in the range of signed 32-bit integers, specifying the largest permissible value of the property it describes.
ja: 符号付き32ビット整数の範囲内の数値で、それが記述するプロパティの最大許容値を指定します。
ko: 부호있는 32 비트 정수 범위의 숫자 값으로, 설명하는 특성의 최대 허용 값을 지정합니다.
ru: Числовое значение в диапазоне подписанных 32-битных целых чисел,задающее наибольшее допустимое значение свойства,которое оно описывает.
zh_cn: 在有符号的32位整数范围内的一个数值,指定其描述的属性的最大允许值。

source: A numeric value in the range of signed 32-bit integers, specifying the smallest permissible value of the property it describes.
ja: 符号付き32ビット整数の範囲内の数値で、それが記述するプロパティの最小許容値を指定します。
ko: 부호있는 32 비트 정수 범위의 숫자 값으로, 설명하는 특성의 가장 작은 허용 가능한 값을 지정합니다.
ru: Числовое значение в диапазоне подписанных 32-битных целых чисел,определяющее наименьшее допустимое значение свойства,которое оно описывает.
zh_cn: 在有符号的32位整数范围内的数值,指定其描述的属性的最小允许值。

source: A numeric value indicating the general type of error which occurred. The possible values are described below, in <a href="#Media_error_code_constants">Media error code constants</a>.
ja: 発生したエラーの一般的なタイプを示す数値。可能な値については、<a href="#Media_error_code_constants">メディアエラーコードの定数</a>で説明します。
ko: 발생한 일반적인 오류 유형을 나타내는 숫자 값입니다. 가능한 값은 아래의 <a href="#Media_error_code_constants">매체 오류 코드 상수</a> 에 설명되어 있습니다 .
ru: Числовое значение, обозначающее общий тип возникшей ошибки. Возможные значения описаны ниже, в <a href="#Media_error_code_constants">константах кода ошибки носителя</a> .
zh_cn: 一个数字值，指示发生的错误的一般类型。可能的值在下面的&ldquo; <a href="#Media_error_code_constants">媒体错误代码常量&rdquo;</a>中描述。

source: A numeric value indicating the number of CSS pixels tall the screen's available space is. This can be no larger than the value of <a href="height"><code>window.screen.height</code></a>, and will be less if the device or user agent reserves any vertical space for itself.
ja: 画面の使用可能なスペースの高さであるCSSピクセルの数を示す数値。これは<a href="height"> <code>window.screen.height</code> </a>の値よりも大きくすることはできず、デバイスまたはユーザーエージェントが自身のために垂直方向のスペースを予約している場合は小さくなります。
ko: 화면의 사용 가능한 공간이 큰 CSS 픽셀 수를 나타내는 숫자 값입니다. 이것은 <a href="height"> <code>window.screen.height</code> </a> 값보다 클 수 없으며 장치 또는 사용자 에이전트가 수직 공간을 예약하는 경우 더 적습니다.
ru: Числовое значение, указывающее количество CSS-пикселей, высоту доступного пространства экрана. Это может быть не больше, чем значение <a href="height"> <code>window.screen.height</code> </a> , и будет меньше, если устройство или пользовательский агент резервирует для себя вертикальное пространство.
zh_cn: 一个数字值，指示屏幕可用空间高的CSS像素数。该值不能大于<a href="height"> <code>window.screen.height</code> </a>的值，并且如果设备或用户代理为其自身保留任何垂直空间，则该值将较小。

source: A numeric value indicating the status code explaining why the connection is being closed. If this parameter is not specified, a default value of 1005 is assumed. See the <a href="../closeevent#Status_codes">list of status codes</a> of <a href="../closeevent"><code>CloseEvent</code></a> for permitted values.
ja: 接続が閉じられている理由を説明するステータスコードを示す数値。このパラメーターを指定しない場合、デフォルト値の1005が想定されます。許可される値については、<a href="../closeevent"> <code>CloseEvent</code> </a><a href="../closeevent#Status_codes">のステータスコード</a>のリストを参照してください。
ko: 연결이 닫힌 이유를 설명하는 상태 코드를 나타내는 숫자 값입니다. 이 매개 변수를 지정하지 않으면 기본값 1005가 가정됩니다. 허용되는 값 은 <a href="../closeevent"> <code>CloseEvent</code> </a><a href="../closeevent#Status_codes"> 상태 코드 목록을</a> 참조하십시오 .
ru: Числовое значение, обозначающее код состояния, объясняющий, почему соединение закрывается. Если этот параметр не указан, предполагается значение по умолчанию 1005. См. <a href="../closeevent#Status_codes">Список кодов</a> состояния <a href="../closeevent"> <code>CloseEvent</code> </a> для допустимых значений.
zh_cn: 指示状态代码的数字值，用于解释为什么关闭连接。如果未指定此参数，则默认值为1005。看到<a href="../closeevent#Status_codes">的状态代码列表</a>中<a href="../closeevent"> <code>CloseEvent</code> </a>的允许值。

source: A numeric value specifying an approximation of the total amount of storage space available for use by the application.
ja: アプリケーションで使用可能なストレージスペースの総量の近似値を指定する数値。
ko: 애플리케이션이 사용할 수있는 총 스토리지 공간 크기의 근사값을 지정하는 숫자 값입니다.
ru: Числовое значение,указывающее аппроксимацию общего объема памяти,доступного для использования приложением.
zh_cn: 一个数值,指定可供应用程序使用的存储空间总量的近似值。
