Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/dom/dom.*.011.xlf
Languages: ja, ko, ru, zh_cn

source: A numeric value which provides a conservative approximation of the total storage the user's device or computer has available for the site origin or Web app. It's possible that there's more than this amount of space available though you can't rely on that being the case.
ja: ユーザーのデバイスまたはコンピュータがサイトオリジンまたはウェブアプリで利用可能な総ストレージの保守的な近似値を提供する数値。利用可能なスペースがこの量よりも多い可能性がありますが、そうであることに頼ることはできません。
ko: 사용자 장치 또는 컴퓨터가 사이트 원본 또는 웹 응용 프로그램에 사용할 수있는 총 저장소의 대략적인 근사값을 제공하는 숫자 값입니다. 당신이 그 경우에 의존 할 수는 없지만 사용 가능한 공간보다 더 많은 공간이있을 수 있습니다.
ru: Числовое значение,обеспечивающее консервативную аппроксимацию общего объема памяти,доступного устройству или компьютеру пользователя для происхождения сайта или веб-приложения.Возможно,что доступно больше,чем это количество места,хотя вы не можете полагаться на это.
zh_cn: 一个数值,它提供了一个保守的近似值,即用户的设备或计算机可用于网站原点或网络应用的总存储空间。有可能有比这个可用空间更多的空间,尽管你不能依赖这种情况。

source: A object contaning initialization options to use when creating the constructor. These are:
ja: コンストラクタを作成する際に使用する初期化オプションを指定するオブジェクト。これらは以下の通りです。
ko: 생성자를 만들 때 사용할 초기화 옵션이 포함 된 객체입니다. 이것들은:
ru: Опции инициализации контурного объекта для использования при создании конструктора.Это:
zh_cn: 一个定义初始化选项的对象,在创建构造函数时使用。这些选项是:

source: A page wants to detect when it is being prerendered so it can keep accurate count of page views
ja: ページは、ページビューの正確なカウントを維持するために、それがprerenderされているときに検出したいと思います。
ko: 페이지가 미리 렌더링되는 시점을 감지하여 정확한 페이지 조회수를 유지할 수 있습니다.
ru: Страница хочет определить,когда она находится в предварительном заказе,так что она может держать точный подсчет просмотров страницы.
zh_cn: 一个页面想要检测它何时被预渲染,以便它能准确地统计页面浏览量。

source: A paragraph with a span inside. Both the span and the paragraph have a border set. The client rects are in red. Note that the <code>p</code> has only one border box, while the <code>span</code> has multiple border boxes.
ja: 内部にスパンがある段落。スパンと段落の両方に境界線が設定されています。クライアントの四角形は赤で表示されます。 <code>span</code> は複数の境界ボックスがあるのに対し、 <code>p</code> には1つの境界ボックスしかないことに注意してください。
ko: 내부에 범위가있는 단락. 범위와 단락 모두 테두리가 설정되어 있습니다. 클라이언트 rect는 빨간색입니다. 점을 유의 <code>p</code> 는 그동안 단 하나 개의 경계 상자가 있습니다 <code>span</code> 여러 경계 상자가 있습니다.
ru: Абзац с пролетом внутри. И span, и абзац имеют набор границ. Клиентские туры в красном. Обратите внимание, что у <code>p</code> есть только один прямоугольник, в то время как <code>span</code> имеет несколько рамок.
zh_cn: 内部有跨度的段落。跨度和段落都有边框设置。客户端矩形为红色。请注意， <code>p</code> 只有一个边框，而 <code>span</code> 有多个边框。

source: A parking project using the Drag and Drop API: <a href="https://park.glitch.me/">https://park.glitch.me/</a> (You can edit <a href="https://glitch.com/edit/#!/park">here</a>)
ja: ドラッグアンドドロップAPIを使用したパーキングプロジェクト：<a href="https://park.glitch.me/">https</a> : //park.glitch.me/（<a href="https://glitch.com/edit/#!/park">ここで</a>編集できます）
ko: 드래그 앤 드롭 API를 사용하는 주차 프로젝트 : <a href="https://park.glitch.me/">https://park.glitch.me/</a> ( <a href="https://glitch.com/edit/#!/park">여기에서</a> 편집 가능 )
ru: Проект парковки с использованием Drag and Drop API: <a href="https://park.glitch.me/">https://park.glitch.me/</a> (Вы можете редактировать <a href="https://glitch.com/edit/#!/park">здесь</a> )
zh_cn: 使用拖放API的停车项目：<a href="https://park.glitch.me/">https</a>：//park.glitch.me/（您可以<a href="https://glitch.com/edit/#!/park">在此处</a>编辑）

source: A payment request always starts with the creation of a new <a href="../paymentrequest"><code>PaymentRequest</code></a> object &mdash; using the <a href="../paymentrequest/paymentrequest"><code>PaymentRequest()</code></a> constructor. This takes two mandatory parameters and one option parameter:
ja: 支払い要求は常に、<a href="../paymentrequest/paymentrequest"> <code>PaymentRequest()</code> </a>コンストラクターを使用した新しい<a href="../paymentrequest"> <code>PaymentRequest</code> </a>オブジェクトの作成から始まります。これは、2つの必須パラメータと1つのオプションパラメータを取ります。
ko: 지불 요청은 항상 <a href="../paymentrequest/paymentrequest"> <code>PaymentRequest()</code> </a> 생성자를 사용하여 새 <a href="../paymentrequest"> <code>PaymentRequest</code> </a> 오브젝트 작성으로 시작합니다 . 두 개의 필수 매개 변수와 하나의 옵션 매개 변수가 필요합니다.
ru: Запрос на оплату всегда начинается с создания нового объекта <a href="../paymentrequest"> <code>PaymentRequest</code> </a> - с помощью конструктора <a href="../paymentrequest/paymentrequest"> <code>PaymentRequest()</code> </a> . Это принимает два обязательных параметра и один параметр option:
zh_cn: 付款请求始终始于使用<a href="../paymentrequest/paymentrequest"> <code>PaymentRequest()</code> </a>构造函数创建新的<a href="../paymentrequest"> <code>PaymentRequest</code> </a>对象。这需要两个强制参数和一个选项参数：

source: A peer reflexive candidate is one whose IP address comes from a symmetric NAT between the two peers, usually as an additional candidate during trickle ICE (that is, additional candidate exchanges that occur after primary signaling but before the connection verification phase is finished).
ja: ピア反射候補とは、IPアドレスが2つのピア間の対称NATから来ているもので、通常はトリクルICE中に追加候補として行われる(つまり、プライマリシグナリングの後、接続検証フェーズが終了する前に行われる追加候補の交換)。
ko: 피어 리플 렉 티브 후보는 IP 주소가 두 피어 사이의 대칭 NAT에서 나온 것입니다. 일반적으로 세류 ICE 동안 추가 후보 (즉, 기본 시그널링 이후에 연결 확인 단계가 완료되기 전에 발생하는 추가 후보 교환)입니다.
ru: Пиринговый рефлексивный кандидат-это кандидат,чей IP-адрес поступает от симметричного NAT между двумя пирами,обычно в качестве дополнительного кандидата во время просачивания ICE (т.е.дополнительных обменов кандидатами,которые происходят после первичной сигнализации,но до завершения фазы проверки соединения).
zh_cn: 对等反射候选者是指其IP地址来自两个对等体之间的对称NAT的候选者,通常是作为涓流ICE期间的附加候选者(即在主信令之后但在连接验证阶段完成之前发生的附加候选者交换)。

source: A percentage value was specified.
ja: パーセント値を指定しました。
ko: 백분율 값이 지정되었습니다.
ru: Было указано процентное значение.
zh_cn: 指定了一个百分比值。

source: A performance <code><strong>mark</strong></code> is a <em>named</em><a href="performanceentry"><code>performance entry</code></a> that is created by the application. The mark is a <a href="domhighrestimestamp"><code>timestamp</code></a> in the browser's <em>performance timeline</em>.
ja: パフォーマンス <code><strong>mark</strong></code> は、アプリケーションによって作成される<em>名前付きの</em><a href="performanceentry"> <code>performance entry</code> </a>です。マークは、ブラウザの<em>パフォーマンスタイムライン</em>の<a href="domhighrestimestamp"> <code>timestamp</code> </a>です。<em></em>
ko: 성능 <code><strong>mark</strong></code> 는 응용 프로그램에서 생성 된 <em>명명 된 </em><a href="performanceentry"> <code>performance entry</code> </a> 입니다. 마크는 브라우저 <em>성능 타임 라인</em> 의 <a href="domhighrestimestamp"> <code>timestamp</code> </a> 입니다 .<em></em>
ru: <code><strong>mark</strong></code> производительности - это <em>именованная </em><a href="performanceentry"> <code>performance entry</code> </a> которая создается приложением. Эта отметка является <a href="domhighrestimestamp"> <code>timestamp</code> </a> на <em>временной шкале производительности</em> браузера .
zh_cn: 性能 <code><strong>mark</strong></code> 是由应用程序创建的<em>命名</em><a href="performanceentry"> <code>performance entry</code> </a>。标记是浏览器<em>性能时间表中</em>的<a href="domhighrestimestamp"> <code>timestamp</code> </a>。<em></em>

source: A ping or pong is just a regular frame, but it's a <strong>control frame</strong>. Pings have an opcode of <code>0x9</code>, and pongs have an opcode of <code>0xA</code>. When you get a ping, send back a pong with the exact same Payload Data as the ping (for pings and pongs, the max payload length is 125). You might also get a pong without ever sending a ping; ignore this if it happens.
ja: ピンポンは通常のフレームですが、<strong>コントロールフレーム</strong>です。 <code>0x9</code> オペコードは0x9で、ポンのオペコードは <code>0xA</code> です。 pingを受け取ったら、pingとまったく同じペイロードデータを含むポンを送り返します（pingとポンの場合、最大ペイロード長は125です）。また、pingを送信せずにポンを取得することもあります。発生した場合は無視してください。
ko: 핑 또는 탁구는 단지 일반 프레임이지만 <strong>제어 프레임</strong> 입니다. Ping의 opcode는 <code>0x9</code> 이고 pong은 opcode의 <code>0xA</code> 입니다. 핑을 받으면 핑과 정확히 동일한 페이로드 데이터가 포함 된 퐁을 다시 보냅니다 (핑 및 퐁의 경우 최대 페이로드 길이는 125 임). 핑을 보내지 않고 탁구를 얻을 수도 있습니다. 발생하면이를 무시하십시오.
ru: Пинг или понг - это обычный кадр, но это <strong>контрольный кадр</strong> . Пинг имеет код операции <code>0x9</code> , а понги - код операции <code>0xA</code> . Когда вы получаете пинг, отправьте обратно понг с теми же данными полезной нагрузки, что и пинг (для пингов и понгов максимальная длина полезной нагрузки составляет 125). Вы также можете получить понг, не отправляя пинг; игнорируйте это, если это произойдет.
zh_cn: ping或pong只是一个普通的帧，但它是一个<strong>控制帧</strong>。 Ping的操作码为 <code>0x9</code> ，而Pong的操作码为 <code>0xA</code> 。收到ping命令后，请使用与ping完全相同的有效载荷数据发送回pong（对于ping和pongs，最大有效载荷长度为125）。您可能还没有发送过ping命令就得到了pong；如果发生这种情况，请忽略它。

source: A point of contact with the surface. This may be a finger (or elbow, ear, nose, whatever, but typically a finger) or stylus.
ja: 表面との接触点。これは、指(または肘、耳、鼻、何でもいいが、一般的には指)またはスタイラスである可能性がある。
ko: 표면과의 접촉점. 손가락 (또는 팔꿈치, 귀, 코 등 일반적으로 손가락) 또는 스타일러스 일 수 있습니다.
ru: Точка контакта с поверхностью.Это может быть палец (или локоть,ухо,нос,что угодно,но обычно палец)или стилус.
zh_cn: 与表面的接触点。可以是手指(或肘部、耳部、鼻部等,但通常是手指)或手写笔。

source: A point of contact with the surface. This may be a finger (or elbow, ear, nose, whatever, but typically a finger), stylus, mouse, or any other method for specifying a single point on the surface.
ja: 表面との接触点。これは、指(または肘、耳、鼻、何でもいいが、典型的には指)、スタイラス、マウス、または表面上の一点を指定するための他の方法であってもよい。
ko: 표면과의 접촉점. 손가락 (또는 팔꿈치, 귀, 코 등 일반적으로 손가락), 스타일러스, 마우스 또는 표면에 단일 점을 지정하는 다른 방법 일 수 있습니다.
ru: Точка контакта с поверхностью.Это может быть палец (или локоть,ухо,нос,что угодно,но обычно палец),стилус,мышь или любой другой метод указания одной точки на поверхности.
zh_cn: 与表面的接触点。可以是手指(或肘部、耳朵、鼻子等,但通常是手指)、手写笔、鼠标或任何其他方法,用于指定表面上的一个点。

source: A pointer is considered primary if the pointer represents a mouse device. A pointer representing pen input is considered the primary pen input if its <code><a href="https://developer.mozilla.org/en-US/docs/Web/Events/pointerdown">pointerdown</a></code> event was dispatched when no other active pointers representing pen input existed. A pointer representing touch input is considered the primary touch input if its <code><a href="https://developer.mozilla.org/en-US/docs/Web/Events/pointerdown">pointerdown</a></code> event was dispatched when no other active pointers representing touch input existed.
ja: ポインターがマウスデバイスを表す場合、ポインターはプライマリと見なされます。ペン入力を表す他のアクティブなポインターが存在しないときにその <code><a href="https://developer.mozilla.org/en-US/docs/Web/Events/pointerdown">pointerdown</a></code> イベントが送出された場合、ペン入力を表すポインターはプライマリペン入力と見なされます。タッチ入力を表す他のアクティブなポインターが存在しないときにその <code><a href="https://developer.mozilla.org/en-US/docs/Web/Events/pointerdown">pointerdown</a></code> イベントが送出された場合、タッチ入力を表すポインターはプライマリタッチ入力と見なされます。
ko: 포인터가 마우스 장치를 나타내는 경우 포인터가 기본으로 간주됩니다. 펜 입력을 나타내는 포인터는 펜 입력을 나타내는 다른 활성 포인터가 없을 때 <code><a href="https://developer.mozilla.org/en-US/docs/Web/Events/pointerdown">pointerdown</a></code> 이벤트가 전달 된 경우 기본 펜 입력으로 간주됩니다 . 터치 입력을 나타내는 다른 활성 포인터가 존재하지 않을 때 <code><a href="https://developer.mozilla.org/en-US/docs/Web/Events/pointerdown">pointerdown</a></code> 이벤트가 전달되면 터치 입력을 나타내는 포인터가 기본 터치 입력으로 간주됩니다 .
ru: Указатель считается первичным, если указатель представляет устройство мыши. Указатель, представляющий перьевой ввод, считается основным перьевым вводом, если его событие указателя <code><a href="https://developer.mozilla.org/en-US/docs/Web/Events/pointerdown">pointerdown</a></code> было отправлено, когда не было других активных указателей, представляющих перьевой ввод. Указатель, представляющий сенсорный ввод, считается основным сенсорным вводом, если его событие <code><a href="https://developer.mozilla.org/en-US/docs/Web/Events/pointerdown">pointerdown</a></code> было отправлено, когда не было никаких других активных указателей, представляющих сенсорный ввод.
zh_cn: 如果指针代表鼠标设备，则该指针被视为主要指针。如果在不存在其他表示笔输入的活动指针的情况下调度了其 <code><a href="https://developer.mozilla.org/en-US/docs/Web/Events/pointerdown">pointerdown</a></code> 事件，则表示笔输入的指针将被视为主要笔输入。如果在不存在其他表示触摸输入的活动指针的情况下调度了其下 <code><a href="https://developer.mozilla.org/en-US/docs/Web/Events/pointerdown">pointerdown</a></code> 事件，则表示触摸输入的指针将被视为主要触摸输入。

source: A pointer's <em>hit test</em> is the process a browser uses to determine the target element for a pointer event. Typically, this is determined by considering the pointer's location and also the visual layout of elements in a document on screen media.
ja: ポインターの<em>ヒットテスト</em>は、ブラウザーがポインターイベントのターゲット要素を決定するために使用するプロセスです。通常、これは、ポインターの位置と、画面メディア上のドキュメント内の要素の視覚的なレイアウトを考慮して決定されます。
ko: 포인터의 <em>적중 테스트</em> 는 브라우저가 포인터 이벤트의 대상 요소를 판별하는 데 사용하는 프로세스입니다. 일반적으로 이것은 포인터의 위치와 화면 미디어의 문서에서 요소의 시각적 레이아웃을 고려하여 결정됩니다.
ru: Тест на <em>попадание</em> указателя - это процесс, который браузер использует для определения целевого элемента для события указателя. Как правило, это определяется с учетом расположения указателя, а также визуального расположения элементов в документе на экране носителя.
zh_cn: 指针的<em>命中测试</em>是浏览器用来确定指针事件的目标元素的过程。通常，这是通过考虑指针的位置以及屏幕媒体上文档中元素的视觉布局来确定的。

source: A polyfill for the CSS.escape
ja: CSS.escapeのポリフィル。
ko: CSS를위한 polyfill
ru: Полипропилен для CSS.escape.
zh_cn: CSS.escape的多角填充

source: A position along the web page's horizontal axis.
ja: ウェブページの横軸に沿った位置。
ko: 웹 페이지의 가로 축을 따른 위치입니다.
ru: Положение вдоль горизонтальной оси веб-страницы.
zh_cn: 沿着网页横轴的位置。

source: A position along the web page's vertical axix.
ja: ウェブページの縦軸に沿った位置。
ko: 웹 페이지의 세로 축을 따라 위치.
ru: Положение вдоль вертикальной оси веб-страницы.
zh_cn: 沿着网页垂直轴线的一个位置。

source: A positive integer less than or equal to <code><var>stylesheet</var>.cssRules.length</code>, representing the newly inserted rule's position in <code><a href="../cssstylesheet">CSSStyleSheet</a>.cssRules</code>. The default is <code>0</code>. (In older implementations, this was required. See <a href="#Browser_compatibility">Browser Compatibility</a> for details.)
ja: 正の整数未満か等しい <code><var>stylesheet</var>.cssRules.length</code> に新たに挿入されたルールの位置を表す、 <code><a href="../cssstylesheet">CSSStyleSheet</a>.cssRules</code> 。デフォルトは <code>0</code> です。（以前の実装では、これは必須でした。詳細については、<a href="#Browser_compatibility">ブラウザの互換性</a>を参照してください。）
ko: 양의 정수보다 작거나 같음 <code><var>stylesheet</var>.cssRules.length</code> 에 새로 삽입 된 규칙의 위치를 나타내는 <code><a href="../cssstylesheet">CSSStyleSheet</a>.cssRules</code> . 기본값은 <code>0</code> 입니다. (구형 구현에서는 이것이 필요했습니다. 자세한 내용은 <a href="#Browser_compatibility">브라우저 호환성</a> 을 참조하십시오.)
ru: Целое положительное число, меньшее или равное <code><var>stylesheet</var>.cssRules.length</code> , представляющее позицию вновь вставленного правила в <code><a href="../cssstylesheet">CSSStyleSheet</a>.cssRules</code> . По умолчанию <code>0</code> . (В более старых реализациях это требовалось. См. <a href="#Browser_compatibility">Совместимость браузера</a> для деталей.)
zh_cn: 小于或等于 <code><var>stylesheet</var>.cssRules.length</code> 的正整数，表示新插入的规则在 <code><a href="../cssstylesheet">CSSStyleSheet</a>.cssRules</code> 的位置。默认值为 <code>0</code> 。（在较早的实现中，这是必需的。有关详细信息，请参见<a href="#Browser_compatibility">浏览器兼容性</a>。）

source: A positive number indicating the maximum distance, in centimeters (cm), that the device's proximity sensor is able to detect and report.
ja: デバイスの近接センサが検出して報告できる最大距離をセンチメートル(cm)単位で示す正の数値。
ko: 장치의 근접 센서가 감지하고보고 할 수있는 최대 거리 (센티미터 (cm))를 나타내는 양수입니다.
ru: Положительное число,указывающее на максимальное расстояние в сантиметрах (см),которое датчик приближения устройства способен обнаружить и сообщить.
zh_cn: 一个正数,表示设备的接近传感器能够检测和报告的最大距离(厘米)。

source: A positive number indicating the minimum distance, in centimeters (cm), the device's proximity sensor can report.
ja: デバイスの近接センサーが報告できる最小距離をセンチメートル(cm)単位で示す正の数値。
ko: 장치의 근접 센서가보고 할 수있는 최소 거리 (센티미터 (cm))를 나타내는 양수입니다.
ru: Положительное число,указывающее на минимальное расстояние,в сантиметрах (см)может сообщить датчик приближения прибора.
zh_cn: 表示设备的接近传感器可以报告的最小距离(厘米)的正数。

source: A positive number representing a distance in centimeters (cm) between the device's proximity sensor and the detected object.
ja: デバイスの近接センサと検出された物体との間の距離をセンチメートル(cm)単位で表す正の数値。
ko: 장치의 근접 센서와 감지 된 물체 사이의 거리를 센티미터 (cm)로 나타내는 양수입니다.
ru: Положительное число,представляющее собой расстояние в сантиметрах (см)между датчиком приближения прибора и обнаруженным объектом.
zh_cn: 一个正数,表示设备的接近传感器与检测到的物体之间的距离,单位为厘米(cm)。

source: A positive number representing a light intensity expressed in <a href="http://en.wikipedia.org/wiki/Lux">lux</a>.
ja: <a href="http://en.wikipedia.org/wiki/Lux">ルクスで</a>表される光の強度を表す正の数。
ko: <a href="http://en.wikipedia.org/wiki/Lux">lux로</a> 표현 된 빛의 세기를 나타내는 양수 .
ru: Положительное число, представляющее интенсивность света, выраженное в <a href="http://en.wikipedia.org/wiki/Lux">люксах</a> .
zh_cn: 表示光强度的正数，以<a href="http://en.wikipedia.org/wiki/Lux">勒克斯</a>表示。

source: A positive number representing a light intensity expressed in <a href="https://en.wikipedia.org/wiki/Lux">lux</a>.
ja: <a href="https://en.wikipedia.org/wiki/Lux">ルクスで</a>表される光の強度を表す正の数。

source: A possible solution
ja: 可能な解決策
ko: 가능한 해결책
ru: Возможное решение
zh_cn: 一个可能的解决办法

source: A possible way to solve the "<code>this</code>" problem is to replace the two native <code>setTimeout()</code> or <code>setInterval()</code> global functions with two <em>non-native</em> ones that enable their invocation through the <a href="https://developer.mozilla.org/en-US/docs/JavaScript/Reference/Global_Objects/Function/call"><code>Function.prototype.call</code></a> method. The following example shows a possible replacement:
ja: 「 <code>this</code> 」問題を解決するための可能な方法は、2つのネイティブの <code>setTimeout()</code> または <code>setInterval()</code> グローバル関数を、<a href="https://developer.mozilla.org/en-US/docs/JavaScript/Reference/Global_Objects/Function/call"> <code>Function.prototype.call</code> </a>メソッドによる呼び出しを可能にする2つの<em>非</em>ネイティブ関数に置き換えることです。次の例は、可能な置換を示しています。
ko: " <code>this</code> "문제 를 해결하는 가능한 방법 은 두 개의 기본 <code>setTimeout()</code> 또는 <code>setInterval()</code> 전역 함수를 <a href="https://developer.mozilla.org/en-US/docs/JavaScript/Reference/Global_Objects/Function/call"> <code>Function.prototype.call</code> </a> 메소드를 통해 호출 할 수있는 <em>비원시</em> 함수 로 바꾸는 것입니다 . 다음 예는 가능한 교체 방법을 보여줍니다.
ru: Возможный способ решения <code>this</code> проблемы - заменить две собственные глобальные функции <code>setTimeout()</code> или <code>setInterval()</code> на две <em>не собственные функции</em> , которые позволяют вызывать их через метод <a href="https://developer.mozilla.org/en-US/docs/JavaScript/Reference/Global_Objects/Function/call"> <code>Function.prototype.call</code> </a> . В следующем примере показана возможная замена:
zh_cn: 解决&ldquo; <code>this</code> &rdquo;问题的一种可能方法是用两个<em>非本机</em>全局函数替换两个本机 <code>setTimeout()</code> 或 <code>setInterval()</code> 全局函数，这两个全局函数可以通过<a href="https://developer.mozilla.org/en-US/docs/JavaScript/Reference/Global_Objects/Function/call"> <code>Function.prototype.call</code> </a>方法进行调用。以下示例显示了可能的替换：<em></em>

source: A potential alternative to the main track, such as a different audio take or a version of the soundtrack with only the music and no dialogue.
ja: メイントラックとは別のオーディオテイクや、音楽のみでセリフなしのサウンドトラックのバージョンなど、メイントラックの代替となる可能性があります。
ko: 다른 오디오 테이크 나 음악 만 있고 대화가없는 사운드 트랙 버전과 같은 메인 트랙의 대안입니다.
ru: Потенциальная альтернатива основному треку,например,другой аудио дубль или версия саундтрека только с музыкой и без диалогов.
zh_cn: 主音轨的潜在替代方案,如不同的音频或只有音乐而没有对话的配乐版本。

source: A potential alternative to the main track, such as a different video take or a version of the soundtrack with only the music and no dialogue.
ja: メイントラックとは別のビデオテイクや、音楽のみでセリフなしのサウンドトラックのバージョンなど、メイントラックの代わりになる可能性があります。
ko: 다른 비디오 테이크 또는 음악 만 있고 대화가없는 사운드 트랙 버전과 같은 메인 트랙의 잠재적 대안입니다.
ru: Потенциальная альтернатива основному треку,например,другой видеоклип-драйв или версия саундтрека только с музыкой и без диалогов.
zh_cn: 主音轨的潜在替代方案,如不同的录像带或只有音乐而没有对话的配乐版本。

source: A powerful feature of the Web Audio API is that it does not have a strict "sound call limitation". For example, there is no ceiling of 32 or 64 sound calls at one time. Some processors may be capable of playing more than 1,000 simultaneous sounds without stuttering.
ja: Web Audio APIの強力な特徴は、厳密な「サウンドコールの制限」がないことです。例えば、一度に32回や64回のサウンドコールの上限はありません。プロセッサーによっては、1,000以上の同時再生が可能な場合もあります。
ko: Web Audio API의 강력한 기능은 엄격한 "사운드 호출 제한"이 없다는 것입니다. 예를 들어 한 번에 32 또는 64 개의 사운드 호출 한도는 없습니다. 일부 프로세서는 끊김없이 1,000 개가 넘는 동시 사운드를 재생할 수 있습니다.
ru: Мощной особенностью Web Audio API является то,что в нем нет строгого "ограничения звукового вызова".Например,нет потолка в 32 или 64 звуковых вызова одновременно.Некоторые процессоры могут воспроизводить более 1000 одновременных звуков без заикания.
zh_cn: 网络音频API的一个强大功能是它没有严格的 "声音调用限制"。例如,没有一次32或64次声音调用的上限。一些处理器可能能够同时播放超过1000个声音而不会出现结巴。

source: A powerful, flexible storage mechanism for multiple Firefox OS applications to use to store and share data between one another quickly, efficiently, and securely.
ja: 複数のFirefox OSアプリケーションが、お互いのデータを迅速、効率的、安全に保存・共有するために使用する、強力で柔軟なストレージメカニズム。
ko: 여러 Firefox OS 응용 프로그램이 서로간에 빠르고, 효율적이며 안전하게 데이터를 저장하고 공유하는 데 사용할 수있는 강력하고 유연한 저장 메커니즘입니다.
ru: Мощный,гибкий механизм хранения данных для нескольких приложений Firefox OS,позволяющий быстро,эффективно и безопасно хранить и обмениваться данными друг с другом.
zh_cn: 一个强大、灵活的存储机制,可供多个Firefox OS应用程序快速、高效、安全地相互存储和共享数据。

source: A precision type value. Either <code>gl.LOW_FLOAT</code>, <code>gl.MEDIUM_FLOAT</code>, <code>gl.HIGH_FLOAT</code>, <code>gl.LOW_INT</code>, <code>gl.MEDIUM_INT</code>, or <code>gl.HIGH_INT</code>.
ja: 精度タイプの値。 <code>gl.LOW_FLOAT</code> 、 <code>gl.MEDIUM_FLOAT</code> 、 <code>gl.HIGH_FLOAT</code> 、 <code>gl.LOW_INT</code> 、 <code>gl.MEDIUM_INT</code> 、または <code>gl.HIGH_INT</code> のいずれか。
ko: 정밀 타입 값. 어느 <code>gl.LOW_FLOAT</code> , <code>gl.MEDIUM_FLOAT</code> , <code>gl.HIGH_FLOAT</code> , <code>gl.LOW_INT</code> , <code>gl.MEDIUM_INT</code> , 또는 <code>gl.HIGH_INT</code> .
ru: Значение типа точности. Или <code>gl.LOW_FLOAT</code> , <code>gl.MEDIUM_FLOAT</code> , <code>gl.HIGH_FLOAT</code> , <code>gl.LOW_INT</code> , <code>gl.MEDIUM_INT</code> или <code>gl.HIGH_INT</code> .
zh_cn: 精度类型值。无论是 <code>gl.LOW_FLOAT</code> ， <code>gl.MEDIUM_FLOAT</code> ， <code>gl.HIGH_FLOAT</code> ， <code>gl.LOW_INT</code> ， <code>gl.MEDIUM_INT</code> ，或 <code>gl.HIGH_INT</code> 。

source: A promise that resolves once the presentation has begun. there are a number of rules surrounding the promise's fulfillment or rejection:
ja: プレゼンテーションが始まったら解決する約束。
ko: 프레젠테이션이 시작되면 해결되는 약속. 약속의 이행 또는 거부를 둘러싼 여러 규칙이 있습니다.
ru: Обещание,которое разрешается после начала презентации.существует ряд правил,касающихся выполнения или отклонения обещания:
zh_cn: 一个承诺,一旦开始展示就会解决.围绕承诺的实现或拒绝,有一些规则。

source: A promise that resolves once the presentation has ended.If the <code>VRDisplay</code> is not presenting when <code>exitPresent()</code> is called, the promise will reject.
ja: 約束はended.Ifプレゼンテーション一度解決さがあることを <code>VRDisplay</code> が時に提示されていない <code>exitPresent()</code> が呼び出されると、約束は拒否します。
ko: 약속은 ended.If 프레젠테이션 한 번 결의가 가지고있는 <code>VRDisplay</code> 이 때 제시되지 <code>exitPresent()</code> 호출되면 약속은 거부합니다.
ru: Обещание, которое разрешается после окончания презентации. Если <code>VRDisplay</code> не <code>exitPresent()</code> при вызове метода exitPresent () , обещание будет отклонено.
zh_cn: 一诺解析一旦呈现具有ended.If的 <code>VRDisplay</code> 没有呈现时 <code>exitPresent()</code> 被调用时，承诺会拒绝。

source: A promise that resolves to an array of <a href="../vrdisplay"><code>VRDisplay</code></a> objects.
ja: <a href="../vrdisplay"> <code>VRDisplay</code> </a>オブジェクトの配列に解決されるプロミス。
ko: <a href="../vrdisplay"> <code>VRDisplay</code> </a> 객체 의 배열로 해석되는 약속 .
ru: Обещание, которое разрешается в массив объектов <a href="../vrdisplay"> <code>VRDisplay</code> </a> .
zh_cn: 解析为<a href="../vrdisplay"> <code>VRDisplay</code> </a>对象数组的诺言。

source: A promise that resolves with a <a href="../blob"><code>Blob</code></a>.
ja: <a href="../blob"> <code>Blob</code> </a>で解決するプロミス。
ko: <a href="../blob"> <code>Blob</code> 으로</a> 해결되는 약속 .
ru: Обещание, которое разрешается с <a href="../blob"> <code>Blob</code> </a> .
zh_cn: 用<a href="../blob"> <code>Blob</code> </a>解决的承诺。
