Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/dom/dom.*.007.xlf
Languages: es, ko, ru, zh_cn

source: <em>Inherits methods from its parents <a href="node"><code>Node</code></a>, and its own parent, <a href="eventtarget"><code>EventTarget</code></a><em>, and implements those of <a href="parentnode"><code>ParentNode</code></a>, <a href="childnode"><code>ChildNode</code></a><em>, <a href="nondocumenttypechildnode"><code>NonDocumentTypeChildNode</code></a>, </em></em>and <a href="https://developer.mozilla.org/en-US/docs/Web/API/Animatable"><code>Animatable</code></a>.</em>
es: <em>M&eacute;todos hereda de sus padres <a href="node"> <code>Node</code> </a> , y su propio padre, <a href="eventtarget"> <code>EventTarget</code> </a><em> , e implementos de esos <a href="parentnode"> <code>ParentNode</code> </a> , <a href="childnode"> <code>ChildNode</code> </a><em> , <a href="nondocumenttypechildnode"> <code>NonDocumentTypeChildNode</code> </a> ,</em></em> y <a href="https://developer.mozilla.org/en-US/docs/Web/API/Animatable"> <code>Animatable</code> </a> .</em>
ko: <em>부모로부터 상속 방법 <a href="node"> <code>Node</code> </a> , 그리고 자신의 부모 <a href="eventtarget"> <code>EventTarget</code> </a><em> 및 구현의 사람들 <a href="parentnode"> <code>ParentNode</code> </a> , <a href="childnode"> <code>ChildNode</code> </a><em> , <a href="nondocumenttypechildnode"> <code>NonDocumentTypeChildNode</code> </a> ,</em></em> 그리고 <a href="https://developer.mozilla.org/en-US/docs/Web/API/Animatable"> <code>Animatable</code> </a> .</em>
ru: <em>Наследующие методы от своих родителей <a href="node"> <code>Node</code> </a> и своего собственного родителя, <a href="eventtarget"> <code>EventTarget</code> </a><em> и реализует те из <a href="parentnode"> <code>ParentNode</code> </a> , <a href="childnode"> <code>ChildNode</code> </a><em> , <a href="nondocumenttypechildnode"> <code>NonDocumentTypeChildNode</code> </a> ,</em></em> и <a href="https://developer.mozilla.org/en-US/docs/Web/API/Animatable"> <code>Animatable</code> </a> .</em>
zh_cn: <em>从父母继承方法<a href="node"> <code>Node</code> </a>，和它自己的父，<a href="eventtarget"> <code>EventTarget</code> </a><em>，并实现这些的<a href="parentnode"> <code>ParentNode</code> </a>，<a href="childnode"> <code>ChildNode</code> </a><em>，<a href="nondocumenttypechildnode"> <code>NonDocumentTypeChildNode</code> </a>，</em></em>并<a href="https://developer.mozilla.org/en-US/docs/Web/API/Animatable"> <code>Animatable</code> </a>。</em>

source: <em>Inherits parameters from the </em><em><a href="../audionodeoptions"><code>AudioNodeOptions</code></a> dictionary</em>.
es: <em>Hereda los par&aacute;metros del </em><em>diccionario </em><em><a href="../audionodeoptions"> <code>AudioNodeOptions</code> </a></em> .
ko: <em></em><em><a href="../audionodeoptions"> <code>AudioNodeOptions</code> </a> 사전 </em><em>에서 매개 변수를 상속 </em><em>합니다</em> .
ru: <em>Наследует параметры из </em><em>словаря </em><em><a href="../audionodeoptions"> <code>AudioNodeOptions</code> </a></em> .
zh_cn: <em>从</em><em><a href="../audionodeoptions"> <code>AudioNodeOptions</code> </a>字典</em><em>继承参数</em>。

source: <em>Inherits parameters from the <a href="../audionodeoptions"><code>AudioNodeOptions</code></a> dictionary.</em>
es: <em>Hereda los par&aacute;metros del diccionario <a href="../audionodeoptions"> <code>AudioNodeOptions</code> </a> .</em>
ko: <em><a href="../audionodeoptions"> <code>AudioNodeOptions</code> </a> 사전 에서 매개 변수를 상속 합니다.</em>
ru: <em>Наследует параметры из словаря <a href="../audionodeoptions"> <code>AudioNodeOptions</code> </a> .</em>
zh_cn: <em>从<a href="../audionodeoptions"> <code>AudioNodeOptions</code> </a>字典继承参数。</em>

source: <em>Inherits properties from its ancestor interfaces, </em><em><a href="htmlmediaelement"><code>HTMLMediaElement</code></a>, and </em><em><a href="htmlelement"><code>HTMLElement</code></a>.</em>
es: <em>Hereda las propiedades de sus interfaces ancestrales, </em><em><a href="htmlmediaelement"> <code>HTMLMediaElement</code> </a> y </em><em><a href="htmlelement"> <code>HTMLElement</code> </a> .</em>
ko: <em></em><em><a href="htmlmediaelement"> <code>HTMLMediaElement</code> </a></em><em> 인터페이스, </em><em>HTMLMediaElement</em><em> 및 </em><em><a href="htmlelement"> <code>HTMLElement</code> </a></em><em> 에서 속성을 상속합니다 </em><em>.</em><em></em>
ru: <em>Унаследует свойства от своих интерфейсов-предков, </em><em><a href="htmlmediaelement"> <code>HTMLMediaElement</code> </a> и </em><em><a href="htmlelement"> <code>HTMLElement</code> </a> .</em>
zh_cn: <em>从其祖先接口</em><em><a href="htmlmediaelement"> <code>HTMLMediaElement</code> </a>和</em><em><a href="htmlelement"> <code>HTMLElement</code> </a></em><em>继承属性</em><em>。</em><em></em>

source: <em>Inherits properties from its ancestor, <a href="credential"><code>Credential</code></a>.</em>
es: <em>Hereda propiedades de su antepasado, <a href="credential"> <code>Credential</code> </a> .</em>
ko: <em>조상 <a href="credential"> <code>Credential</code> </a> 에서 속성을 상속합니다 .</em>
ru: <em>Унаследует свойства от своего предка, <a href="credential"> <code>Credential</code> </a> .</em>
zh_cn: <em>从其祖先<a href="credential"> <code>Credential</code> </a>继承属性。</em>

source: <em>Inherits properties from its ancestor, <a href="event"><code>Event</code></a></em>.
es: <em>Hereda propiedades de su antepasado, <a href="event"> <code>Event</code> o</a></em> .
ko: <em>조상 <a href="event"> <code>Event</code> </a></em><em> 에서 속성을 상속합니다</em> .
ru: <em>Унаследует свойства от своего предка, <a href="event"> <code>Event</code> </a></em> .
zh_cn: <em>从其祖先<a href="event"> <code>Event</code> </a></em><em>继承属性</em>。

source: <em>Inherits properties from its parent <a href="event"><code>Event</code></a></em>.
es: <em>Hereda propiedades de su <a href="event"> <code>Event</code> </a></em><em> principal</em> .
ko: <em>부모 <a href="event"> <code>Event</code> </a></em><em> 에서 속성을 상속합니다</em> .
ru: <em>Унаследует свойства от родительского <a href="event"> <code>Event</code> </a></em> .
zh_cn: <em>从其父<a href="event"> <code>Event</code> </a></em><em>继承属性</em>。

source: <em>Inherits properties from its parent <a href="eventtarget"><code>EventTarget</code></a>.</em>
es: <em>Hereda propiedades de su <a href="eventtarget"> <code>EventTarget</code> </a> padre .</em>
ko: <em>부모 <a href="eventtarget"> <code>EventTarget</code> </a> 에서 속성을 상속합니다 .</em>
ru: <em>Унаследует свойства от своего родительского <a href="eventtarget"> <code>EventTarget</code> </a> .</em>
zh_cn: <em>从其父<a href="eventtarget"> <code>EventTarget</code> </a>继承属性。</em>

source: <em>Inherits properties from its parent <a href="uievent"><code>UIEvent</code></a>, and indirectly from <a href="event"><code>Event</code></a></em>.
es: <em>Hereda propiedades de su <a href="uievent"> <code>UIEvent</code> </a> principal e indirectamente de <a href="event"> <code>Event</code> </a></em> .
ko: <em>부모 <a href="uievent"> <code>UIEvent</code> </a> 및 간접적으로 <a href="event"> <code>Event</code> </a></em><em> 에서 속성을 상속합니다</em> .
ru: <em>Унаследует свойства от родительского <a href="uievent"> <code>UIEvent</code> </a> и косвенно от <a href="event"> <code>Event</code> </a></em> .
zh_cn: <em>从其父<a href="uievent"> <code>UIEvent</code> </a>继承属性，并从<a href="event"> <code>Event</code> </a></em><em>间接</em><em>继承</em>。

source: <em>Inherits properties from its parent interface, <a href="audionode"><code>AudioNode</code></a>, and adds the following properties:</em>
es: <em>Hereda las propiedades de su interfaz principal, <a href="audionode"> <code>AudioNode</code> </a> , y agrega las siguientes propiedades:</em>
ko: <em>부모 인터페이스 <a href="audionode"> <code>AudioNode</code> </a> 에서 속성을 상속 하고 다음 속성을 추가합니다.</em>
ru: <em>Унаследует свойства от родительского интерфейса <a href="audionode"> <code>AudioNode</code> </a> и добавляет следующие свойства:</em>
zh_cn: <em>从其父接口<a href="audionode"> <code>AudioNode</code> </a>继承属性，并添加以下属性：</em>

source: <em>Inherits properties from its parent interface, <a href="audioscheduledsourcenode"><code>AudioScheduledSourceNode</code></a>, and adds the following properties:</em>
es: <em>Hereda las propiedades de su interfaz principal, <a href="audioscheduledsourcenode"> <code>AudioScheduledSourceNode</code> </a> , y agrega las siguientes propiedades:</em>
ko: <em>부모 인터페이스 <a href="audioscheduledsourcenode"> <code>AudioScheduledSourceNode</code> </a> 에서 속성을 상속 하고 다음 속성을 추가합니다.</em>
ru: <em>Наследует свойства из своего родительского интерфейса <a href="audioscheduledsourcenode"> <code>AudioScheduledSourceNode</code> </a> и добавляет следующие свойства:</em>
zh_cn: <em>从其父接口<a href="audioscheduledsourcenode"> <code>AudioScheduledSourceNode</code> </a>继承属性，并添加以下属性：</em>

source: <em>Inherits properties from its parent interface, <a href="event"><code>Event</code></a></em>.
es: <em>Hereda propiedades de su interfaz principal, <a href="event"> <code>Event</code> o</a></em> .
ko: <em>부모 인터페이스 인 <a href="event"> <code>Event</code> </a></em><em> 에서 속성을 상속합니다</em> .
ru: <em>Унаследует свойства от родительского интерфейса <a href="event"> <code>Event</code> </a></em> .
zh_cn: <em>从其父接口<a href="event"> <code>Event</code> </a></em><em>继承属性</em>。

source: <em>Inherits properties from its parent interface, <a href="eventtarget"><code>EventTarget</code></a>.</em>
es: <em>Hereda las propiedades de su interfaz principal, <a href="eventtarget"> <code>EventTarget</code> </a> .</em>
ko: <em>부모 인터페이스 <a href="eventtarget"> <code>EventTarget</code> </a> 에서 속성을 상속합니다 .</em>
ru: <em>Унаследует свойства от своего родительского интерфейса <a href="eventtarget"> <code>EventTarget</code> </a> .</em>
zh_cn: <em>从其父接口<a href="eventtarget"> <code>EventTarget</code> </a>继承属性。</em>

source: <em>Inherits properties from its parent interface, <a href="node"><code>Node</code></a>, and by extension that interface's parent, <a href="eventtarget"><code>EventTarget</code></a>. It implements the properties of <a href="parentnode"><code>ParentNode</code></a>, <a href="childnode"><code>ChildNode</code></a>, <a href="nondocumenttypechildnode"><code>NonDocumentTypeChildNode</code></a>, </em>and <a href="https://developer.mozilla.org/en-US/docs/Web/API/Animatable"><code>Animatable</code></a>.
es: <em>Hereda las propiedades de su interfaz principal, <a href="node"> <code>Node</code> </a> , y, por extensi&oacute;n, la principal de esa interfaz, <a href="eventtarget"> <code>EventTarget</code> </a> . Implementa las propiedades de <a href="parentnode"> <code>ParentNode</code> </a> , <a href="childnode"> <code>ChildNode</code> </a> , <a href="nondocumenttypechildnode"> <code>NonDocumentTypeChildNode</code> </a> ,</em> y <a href="https://developer.mozilla.org/en-US/docs/Web/API/Animatable"> <code>Animatable</code> </a> .
ko: <em>부모 인터페이스 인 <a href="node"> <code>Node</code> </a> 에서 속성을 상속 하고 확장하여 해당 인터페이스의 부모 인 <a href="eventtarget"> <code>EventTarget</code> 을</a> 상속합니다 . 그것은의 속성 구현 <a href="parentnode"> <code>ParentNode</code> </a> , <a href="childnode"> <code>ChildNode</code> </a> , <a href="nondocumenttypechildnode"> <code>NonDocumentTypeChildNode</code> </a> ,</em> 그리고 <a href="https://developer.mozilla.org/en-US/docs/Web/API/Animatable"> <code>Animatable</code> </a> .
ru: <em>Унаследует свойства от своего родительского интерфейса, <a href="node"> <code>Node</code> </a> , и, по расширению, родителя этого интерфейса, <a href="eventtarget"> <code>EventTarget</code> </a> . Он реализует свойства <a href="parentnode"> <code>ParentNode</code> </a> , <a href="childnode"> <code>ChildNode</code> </a> , <a href="nondocumenttypechildnode"> <code>NonDocumentTypeChildNode</code> </a> ,</em> и <a href="https://developer.mozilla.org/en-US/docs/Web/API/Animatable"> <code>Animatable</code> </a> .
zh_cn: <em>从其父接口<a href="node"> <code>Node</code> </a>继承属性，并从该接口的父<a href="eventtarget"> <code>EventTarget</code> </a>继承继承属性。它实现的性能<a href="parentnode"> <code>ParentNode</code> </a>，<a href="childnode"> <code>ChildNode</code> </a>，<a href="nondocumenttypechildnode"> <code>NonDocumentTypeChildNode</code> </a>，</em>并<a href="https://developer.mozilla.org/en-US/docs/Web/API/Animatable"> <code>Animatable</code> </a>。

source: <em>Inherits properties from its parent, </em><a href="audionode"><code>AudioNode</code></a>.
es: <em>Hereda propiedades de su padre, </em><a href="audionode"> <code>AudioNode</code> </a> .
ko: <em>부모 인 </em><a href="audionode"> <code>AudioNode</code> </a><em> 에서 속성을 상속합니다</em> .
ru: <em>Унаследует свойства от своего родителя, </em><a href="audionode"> <code>AudioNode</code> </a> .
zh_cn: <em>从其父</em><a href="audionode"> <code>AudioNode</code> </a><em>继承属性</em>。

source: <em>Inherits properties from its parent, </em><em><a href="audionode"><code>AudioNode</code></a></em>.
es: <em>Hereda propiedades de su padre, </em><em><a href="audionode"> <code>AudioNode</code> </a></em> .
ko: <em>부모 인 </em><em><a href="audionode"> <code>AudioNode</code> </a></em><em> 에서 속성을 상속합니다</em> .
ru: <em>Унаследует свойства от своего родителя, </em><em><a href="audionode"> <code>AudioNode</code> </a></em> .
zh_cn: <em>从其父</em><em><a href="audionode"> <code>AudioNode</code> </a></em><em>继承属性</em>。

source: <em>Inherits properties from its parent, </em><em><a href="event"><code>Event</code></a></em>.
es: <em>Hereda propiedades de su padre, </em><em><a href="event"> <code>Event</code> o</a></em> .
ko: <em>부모 인 </em><em><a href="event"> <code>Event</code> </a></em><em> 에서 속성을 상속합니다</em> .
ru: <em>Унаследует свойства от своего родителя, </em><em><a href="event"> <code>Event</code> </a></em> .
zh_cn: <em>从其父</em><em><a href="event"> <code>Event</code> </a></em><em>继承属性</em>。

source: <em>Inherits properties from its parent, </em><em><a href="extendableevent"><code>ExtendableEvent</code></a></em>.
es: <em>Hereda propiedades de su padre, </em><em><a href="extendableevent"> <code>ExtendableEvent</code> </a></em> .
ko: <em>부모 </em><em><a href="extendableevent"> <code>ExtendableEvent</code> </a></em><em> 로부터 속성을 상속합니다</em> .
ru: <em>Унаследует свойства от своего родителя, </em><em><a href="extendableevent"> <code>ExtendableEvent</code> </a></em> .
zh_cn: <em>从其父级</em><em><a href="extendableevent"> <code>ExtendableEvent</code> </a></em><em>继承属性</em>。

source: <em>Inherits properties from its parent, </em><em><a href="htmlelement"><code>HTMLElement</code></a>.</em>
es: <em>Hereda propiedades de su elemento primario, </em><em><a href="htmlelement"> <code>HTMLElement</code> </a> .</em>
ko: <em>부모 </em><em><a href="htmlelement"> <code>HTMLElement</code> </a></em><em> 에서 속성을 상속합니다 </em><em>.</em><em></em>
ru: <em>Унаследует свойства от своего родителя, </em><em><a href="htmlelement"> <code>HTMLElement</code> </a> .</em>
zh_cn: <em>从其父</em><em><a href="htmlelement"> <code>HTMLElement</code> </a></em><em>继承属性</em><em>。</em><em></em>

source: <em>Inherits properties from its parent, <a href="audionode"><code>AudioNode</code></a>.</em>
es: <em>Hereda propiedades de su padre, <a href="audionode"> <code>AudioNode</code> </a> .</em>
ko: <em>부모 인 <a href="audionode"> <code>AudioNode</code> </a> 에서 속성을 상속합니다 .</em>
ru: <em>Унаследует свойства от своего родителя, <a href="audionode"> <code>AudioNode</code> </a> .</em>
zh_cn: <em>从其父<a href="audionode"> <code>AudioNode</code> </a>继承属性。</em>

source: <em>Inherits properties from its parent, <a href="audioscheduledsourcenode"><code>AudioScheduledSourceNode</code></a>, and adds the following properties:</em>
es: <em>Hereda las propiedades de su padre, <a href="audioscheduledsourcenode"> <code>AudioScheduledSourceNode</code> </a> , y agrega las siguientes propiedades:</em>
ko: <em>부모 <a href="audioscheduledsourcenode"> <code>AudioScheduledSourceNode</code> </a> 에서 속성을 상속 하고 다음 속성을 추가합니다.</em>
ru: <em>Наследует свойства своего родительского <a href="audioscheduledsourcenode"> <code>AudioScheduledSourceNode</code> </a> и добавляет следующие свойства:</em>
zh_cn: <em>从其父<a href="audioscheduledsourcenode"> <code>AudioScheduledSourceNode</code> </a>继承属性，并添加以下属性：</em>

source: <em>Inherits properties from its parent, <a href="cssvalue"><code>CSSValue</code></a></em>.
es: <em>Hereda propiedades de su padre, <a href="cssvalue"> <code>CSSValue</code> </a></em> .
ko: <em>부모 <a href="cssvalue"> <code>CSSValue</code> </a></em><em> 에서 속성을 상속합니다</em> .
ru: <em>Наследует свойства от своего родителя, <a href="cssvalue"> <code>CSSValue</code> </a></em> .
zh_cn: <em>从其父<a href="cssvalue"> <code>CSSValue</code> </a></em><em>继承属性</em>。

source: <em>Inherits properties from its parent, <a href="element"><code>Element</code></a>, and implements those from <a href="globaleventhandlers"><code>GlobalEventHandlers</code></a> and <a href="https://developer.mozilla.org/en-US/docs/Web/API/TouchEventHandlers"><code>TouchEventHandlers</code></a>.</em>
es: <em>Hereda las propiedades de su <a href="element"> <code>Element</code> </a> primario, Element , e implementa las de <a href="globaleventhandlers"> <code>GlobalEventHandlers</code> </a> y <a href="https://developer.mozilla.org/en-US/docs/Web/API/TouchEventHandlers"> <code>TouchEventHandlers</code> </a> .</em>
ko: <em>부모 <a href="element"> <code>Element</code> </a> 에서 속성을 상속 하고 <a href="globaleventhandlers"> <code>GlobalEventHandlers</code> </a> 및 <a href="https://developer.mozilla.org/en-US/docs/Web/API/TouchEventHandlers"> <code>TouchEventHandlers</code> </a> 에서 속성을 구현합니다 .</em>
ru: <em>Наследует свойства от своего родителя <a href="element"> <code>Element</code> </a> и реализует свойства из <a href="globaleventhandlers"> <code>GlobalEventHandlers</code> </a> и <a href="https://developer.mozilla.org/en-US/docs/Web/API/TouchEventHandlers"> <code>TouchEventHandlers</code> </a> .</em>
zh_cn: <em>从其父<a href="element"> <code>Element</code> </a>继承属性，并从<a href="globaleventhandlers"> <code>GlobalEventHandlers</code> </a>和<a href="https://developer.mozilla.org/en-US/docs/Web/API/TouchEventHandlers"> <code>TouchEventHandlers</code> </a>实现那些属性。</em>

source: <em>Inherits properties from its parent, <a href="eventtarget"><code>EventTarget</code></a>, and implements properties from <a href="abstractworker"><code>AbstractWorker</code></a>.</em>
es: <em>Hereda propiedades de su padre, <a href="eventtarget"> <code>EventTarget</code> </a> e implementa propiedades de <a href="abstractworker"> <code>AbstractWorker</code> </a> .</em>
ko: <em>부모 인 <a href="eventtarget"> <code>EventTarget</code> </a> 에서 속성을 상속 하고 <a href="abstractworker"> <code>AbstractWorker</code> </a> 에서 속성을 구현합니다 .</em>
ru: <em>Наследует свойства от своего родителя <a href="eventtarget"> <code>EventTarget</code> </a> и реализует свойства из <a href="abstractworker"> <code>AbstractWorker</code> </a> .</em>
zh_cn: <em>从其父<a href="eventtarget"> <code>EventTarget</code> </a>继承属性，并从<a href="abstractworker"> <code>AbstractWorker</code> </a>实现属性。</em>

source: <em>Inherits properties from its parent, <a href="eventtarget"><code>EventTarget</code></a></em>.<sup>[1]</sup>
es: <em>Hereda propiedades de su padre, <a href="eventtarget"> <code>EventTarget</code> </a></em> . <sup>[1]</sup>
ko: <em>부모 인 <a href="eventtarget"> <code>EventTarget</code> </a></em><em> 에서 속성을 상속합니다</em> . <sup>[1]</sup>
ru: <em>Унаследует свойства от своего родителя, <a href="eventtarget"> <code>EventTarget</code> </a></em> . <sup>[1]</sup>
zh_cn: <em>从其父<a href="eventtarget"> <code>EventTarget</code> </a></em><em>继承属性</em>。<sup>[1]</sup>

source: <em>Inherits properties from its parent, <a href="extendableevent"><code>ExtendableEvent</code></a>. Additional properties:</em>
es: <em>Hereda propiedades de su padre, <a href="extendableevent"> <code>ExtendableEvent</code> </a> . Propiedades adicionales:</em>
ko: <em>부모 <a href="extendableevent"> <code>ExtendableEvent</code> </a> 로부터 속성을 상속합니다 . 추가 속성 :</em>
ru: <em>Унаследует свойства от своего родителя, <a href="extendableevent"> <code>ExtendableEvent</code> </a> . Дополнительные свойства:</em>
zh_cn: <em>从其父级<a href="extendableevent"> <code>ExtendableEvent</code> </a>继承属性。其他属性：</em>

source: <em>Inherits properties from its parent, <a href="htmlelement"><code>HTMLElement</code></a> </em>
es: <em>Hereda propiedades de su padre, <a href="htmlelement"> <code>HTMLElement</code> </a> </em>
ko: <em>부모 <a href="htmlelement"> <code>HTMLElement</code> </a> 에서 속성을 상속합니다. </em>
ru: <em>Унаследует свойства от своего родителя, <a href="htmlelement"> <code>HTMLElement</code> </a> </em>
zh_cn: <em>从其父<a href="htmlelement"> <code>HTMLElement</code> </a>继承属性 </em>

source: <em>Inherits properties from its parent, <a href="htmlelement"><code>HTMLElement</code></a> and from <a href="windoweventhandlers"><code>WindowEventHandlers</code></a>.</em>
es: <em>Hereda propiedades de su padre, <a href="htmlelement"> <code>HTMLElement</code> </a> y de <a href="windoweventhandlers"> <code>WindowEventHandlers</code> </a> .</em>
ko: <em>부모, <a href="htmlelement"> <code>HTMLElement</code> </a> 및 <a href="windoweventhandlers"> <code>WindowEventHandlers</code> </a> 에서 속성을 상속합니다 .</em>
ru: <em>Унаследует свойства от своего родителя, <a href="htmlelement"> <code>HTMLElement</code> </a> и от <a href="windoweventhandlers"> <code>WindowEventHandlers</code> </a> .</em>
zh_cn: <em>从其父<a href="htmlelement"> <code>HTMLElement</code> </a>和<a href="windoweventhandlers"> <code>WindowEventHandlers</code> </a>继承属性。</em>

source: <em>Inherits properties from its parent, <a href="htmlelement"><code>HTMLElement</code></a>, and <a href="linkstyle"><code>LinkStyle</code></a>.</em>
es: <em>Hereda propiedades de su padre, <a href="htmlelement"> <code>HTMLElement</code> </a> y <a href="linkstyle"> <code>LinkStyle</code> </a> .</em>
ko: <em>부모, <a href="htmlelement"> <code>HTMLElement</code> </a> 및 <a href="linkstyle"> <code>LinkStyle</code> </a> 에서 속성을 상속합니다 .</em>
ru: <em>Унаследует свойства от своего родителя, <a href="htmlelement"> <code>HTMLElement</code> </a> и <a href="linkstyle"> <code>LinkStyle</code> </a> .</em>
zh_cn: <em>从其父<a href="linkstyle"> <code>LinkStyle</code> </a><a href="htmlelement"> <code>HTMLElement</code> </a>和LinkStyle继承属性。</em>

source: <em>Inherits properties from its parent, <a href="htmlelement"><code>HTMLElement</code></a>, and implements those from <a href="htmlhyperlinkelementutils"><code>HTMLHyperlinkElementUtils</code></a>.</em>
es: <em>Hereda las propiedades de su padre, <a href="htmlelement"> <code>HTMLElement</code> </a> , e implementa las de <a href="htmlhyperlinkelementutils"> <code>HTMLHyperlinkElementUtils</code> </a> .</em>
ko: <em>부모 <a href="htmlelement"> <code>HTMLElement</code> </a> 에서 속성을 상속 하고 <a href="htmlhyperlinkelementutils"> <code>HTMLHyperlinkElementUtils</code> </a> 에서 속성을 구현합니다 .</em>
ru: <em>Унаследует свойства от своего родительского <a href="htmlelement"> <code>HTMLElement</code> </a> и реализует свойства из <a href="htmlhyperlinkelementutils"> <code>HTMLHyperlinkElementUtils</code> </a> .</em>
zh_cn: <em>从其父<a href="htmlhyperlinkelementutils"> <code>HTMLHyperlinkElementUtils</code> </a><a href="htmlelement"> <code>HTMLElement</code> </a>继承属性，并从HTMLHyperlinkElementUtils实现那些属性。</em>

source: <em>Inherits properties from its parent, <a href="htmlelement"><code>HTMLElement</code></a>.</em>
es: <em>Hereda propiedades de su elemento primario, <a href="htmlelement"> <code>HTMLElement</code> </a> .</em>
ko: <em>부모 <a href="htmlelement"> <code>HTMLElement</code> </a> 에서 속성을 상속합니다 .</em>
ru: <em>Унаследует свойства от своего родителя, <a href="htmlelement"> <code>HTMLElement</code> </a> .</em>
zh_cn: <em>从其父<a href="htmlelement"> <code>HTMLElement</code> </a>继承属性。</em>

source: <em>Inherits properties from its parent, <a href="htmlelement"><code>HTMLElement</code></a></em>.
es: <em>Hereda propiedades de su elemento primario, <a href="htmlelement"> <code>HTMLElement</code> </a></em> .
ko: <em>부모 <a href="htmlelement"> <code>HTMLElement</code> </a></em><em> 에서 속성을 상속합니다 </em>.
ru: <em>Унаследует свойства от своего родителя, <a href="htmlelement"> <code>HTMLElement</code> </a></em> .
zh_cn: <em>从其父<a href="htmlelement"> <code>HTMLElement</code> </a></em><em>继承属性</em>。
