Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/dom/dom.*.007.xlf
Languages: es, ko, ru, zh_cn

source: <em>The <code>WorkerNavigator</code></em><em> interface implements methods from the <a href="navigatorid"><code>NavigatorID</code></a>, <a href="navigatorlanguage"><code>NavigatorLanguage</code></a> and <a href="navigatoronline"><code>NavigatorOnLine</code></a> interfaces.</em>
es: <em>La <code>WorkerNavigator</code> </em><em>interfaz </em><em>WorkerNavigator</em><em> implementa m&eacute;todos de las interfaces <a href="navigatorid"> <code>NavigatorID</code> </a> , <a href="navigatorlanguage"> <code>NavigatorLanguage</code> </a> y <a href="navigatoronline"> <code>NavigatorOnLine</code> </a> .</em>
ko: <em> <code>WorkerNavigator</code> 용</em><em> 로부터 인터페이스 구현 방법 <a href="navigatorid"> <code>NavigatorID</code> </a> , <a href="navigatorlanguage"> <code>NavigatorLanguage</code> </a> 및 <a href="navigatoronline"> <code>NavigatorOnLine</code> </a> 인터페이스.</em>
ru: <em>Интерфейс <code>WorkerNavigator</code> </em><em> реализует методы из интерфейсов <a href="navigatorid"> <code>NavigatorID</code> </a> , <a href="navigatorlanguage"> <code>NavigatorLanguage</code> </a> и <a href="navigatoronline"> <code>NavigatorOnLine</code> </a> .</em>
zh_cn: <em>该 <code>WorkerNavigator</code> </em><em>从接口实现方法<a href="navigatorid"> <code>NavigatorID</code> </a>，<a href="navigatorlanguage"> <code>NavigatorLanguage</code> </a>和<a href="navigatoronline"> <code>NavigatorOnLine</code> </a>接口。</em>

source: <em>The <code>WorkerNavigator</code></em><em> interface implements properties from the <a href="navigatorid"><code>NavigatorID</code></a>, <a href="navigatorlanguage"><code>NavigatorLanguage</code></a>, <a href="navigatoronline"><code>NavigatorOnLine</code></a>, <a href="https://developer.mozilla.org/en-US/docs/Web/API/navigatorDataStore"><code>NavigatorDataStore</code></a>, and <a href="navigatorconcurrenthardware"><code>NavigatorConcurrentHardware</code></a> interfaces. </em>
es: <em>La <code>WorkerNavigator</code> </em><em>interfaz </em><em>WorkerNavigator</em><em> implementa propiedades de las interfaces <a href="navigatorid"> <code>NavigatorID</code> </a> , <a href="navigatorlanguage"> <code>NavigatorLanguage</code> </a> , <a href="navigatoronline"> <code>NavigatorOnLine</code> </a> , <a href="https://developer.mozilla.org/en-US/docs/Web/API/navigatorDataStore"> <code>NavigatorDataStore</code> </a> y <a href="navigatorconcurrenthardware"> <code>NavigatorConcurrentHardware</code> </a> .</em>
ko: <em> <code>WorkerNavigator</code> 용</em><em> 로부터 인터페이스 구현 속성 <a href="navigatorid"> <code>NavigatorID</code> </a> , <a href="navigatorlanguage"> <code>NavigatorLanguage</code> </a> , <a href="navigatoronline"> <code>NavigatorOnLine</code> </a> , <a href="https://developer.mozilla.org/en-US/docs/Web/API/navigatorDataStore"> <code>NavigatorDataStore</code> </a> 및 <a href="navigatorconcurrenthardware"> <code>NavigatorConcurrentHardware</code> 의</a> 인터페이스.</em>
ru: <em>Интерфейс <code>WorkerNavigator</code> </em><em> реализует свойства из интерфейсов <a href="navigatorid"> <code>NavigatorID</code> </a> , <a href="navigatorlanguage"> <code>NavigatorLanguage</code> </a> , <a href="navigatoronline"> <code>NavigatorOnLine</code> </a> , <a href="https://developer.mozilla.org/en-US/docs/Web/API/navigatorDataStore"> <code>NavigatorDataStore</code> </a> и <a href="navigatorconcurrenthardware"> <code>NavigatorConcurrentHardware</code> </a> .</em>
zh_cn: <em>所述 <code>WorkerNavigator</code> </em><em>从接口器具特性<a href="navigatorid"> <code>NavigatorID</code> </a>，<a href="navigatorlanguage"> <code>NavigatorLanguage</code> </a>，<a href="navigatoronline"> <code>NavigatorOnLine</code> </a>，<a href="https://developer.mozilla.org/en-US/docs/Web/API/navigatorDataStore"> <code>NavigatorDataStore</code> </a>，和<a href="navigatorconcurrenthardware"> <code>NavigatorConcurrentHardware</code> </a>接口。</em>

source: <em>The AbortSignal interface also inherits properties from its parent interface, <a href="eventtarget"><code>EventTarget</code></a>.</em>
es: <em>La interfaz AbortSignal tambi&eacute;n hereda propiedades de su interfaz principal, <a href="eventtarget"> <code>EventTarget</code> </a> .</em>
ko: <em>AbortSignal 인터페이스는 부모 인터페이스 인 <a href="eventtarget"> <code>EventTarget</code> </a> 에서 속성을 상속합니다 .</em>
ru: <em>Интерфейс AbortSignal также наследует свойства от своего родительского интерфейса <a href="eventtarget"> <code>EventTarget</code> </a> .</em>
zh_cn: <em>AbortSignal接口还从其父接口<a href="eventtarget"> <code>EventTarget</code> </a>继承属性。</em>

source: <em>The AbortSignal interface inherits methods from its parent interface, <a href="eventtarget"><code>EventTarget</code></a>.</em>
es: <em>La interfaz AbortSignal hereda los m&eacute;todos de su interfaz principal, <a href="eventtarget"> <code>EventTarget</code> </a> .</em>
ko: <em>AbortSignal 인터페이스는 부모 인터페이스 인 <a href="eventtarget"> <code>EventTarget</code> </a> 에서 메소드를 상속합니다 .</em>
ru: <em>Интерфейс AbortSignal наследует методы от своего родительского интерфейса <a href="eventtarget"> <code>EventTarget</code> </a> .</em>
zh_cn: <em>AbortSignal接口从其父接口<a href="eventtarget"> <code>EventTarget</code> </a>继承方法。</em>

source: <em>The CSS interface is a utility interface and no object of this type can be created: only static methods are defined on it.</em>
es: <em>La interfaz CSS es una interfaz de utilidad y no se puede crear ning&uacute;n objeto de este tipo: solo se definen m&eacute;todos est&aacute;ticos en ella.</em>
ko: <em>CSS 인터페이스는 유틸리티 인터페이스이며이 유형의 개체는 만들 수 없습니다. 정적 메서드 만 정의되어 있습니다.</em>
ru: <em>Интерфейс CSS - это служебный интерфейс, и нельзя создать объект такого типа: для него определены только статические методы.</em>
zh_cn: <em>CSS接口是一个实用程序接口，不能创建此类型的对象：仅在其上定义静态方法。</em>

source: <em>The CSS interface is a utility interface and no object of this type can be created: only static properties are defined on it.</em>
es: <em>La interfaz CSS es una interfaz de utilidad y no se puede crear ning&uacute;n objeto de este tipo: solo se definen propiedades est&aacute;ticas en ella.</em>
ko: <em>CSS 인터페이스는 유틸리티 인터페이스이며이 유형의 개체는 만들 수 없습니다. 정적 속성 만 정의되어 있습니다.</em>
ru: <em>Интерфейс CSS - это служебный интерфейс, и нельзя создать объект такого типа: для него определены только статические свойства.</em>
zh_cn: <em>CSS接口是一个实用程序接口，不能创建此类型的对象：仅在其上定义静态属性。</em>

source: <em>The Fullscreen API defines two events which can be used to detect when full-screen mode is turned on and off, as well as when errors occur during the process of changing between full-screen and windowed modes. Event handlers for these events are available on the <a href="document"><code>Document</code></a> and <a href="element"><code>Element</code></a> interfaces.</em>
es: <em>La API de pantalla completa define dos eventos que se pueden usar para detectar cu&aacute;ndo se activa y desactiva el modo de pantalla completa, as&iacute; como cu&aacute;ndo ocurren errores durante el proceso de cambio entre los modos de pantalla completa y ventana. Los controladores de eventos para estos eventos est&aacute;n disponibles en las interfaces <a href="document"> <code>Document</code> o</a> y <a href="element"> <code>Element</code> o</a> .</em>
ko: <em>전체 화면 API는 전체 화면 모드가 켜지고 꺼질 때뿐만 아니라 전체 화면 모드와 창 모드 간을 전환하는 과정에서 오류가 발생하는 경우를 감지하는 데 사용할 수있는 두 가지 이벤트를 정의합니다. 이러한 이벤트에 대한 이벤트 핸들러는 <a href="document"> <code>Document</code> </a> 및 <a href="element"> <code>Element</code> </a> 인터페이스 에서 사용할 수 있습니다.</em>
ru: <em>Полноэкранный API-интерфейс определяет два события, которые можно использовать для определения, когда полноэкранный режим включается и выключается, а также когда возникают ошибки в процессе переключения между полноэкранным и оконным режимами. Обработчики событий для этих событий доступны в интерфейсах <a href="document"> <code>Document</code> </a> и <a href="element"> <code>Element</code> </a> .</em>
zh_cn: <em>全屏API定义了两个事件，可用于检测何时打开和关闭全屏模式，以及在全屏和窗口模式之间进行切换的过程中何时发生错误。这些事件的事件处理程序在<a href="document"> <code>Document</code> </a>和<a href="element"> <code>Element</code> </a>接口上可用。</em>

source: <em>The Fullscreen API defines two events which can be used to detect when full-screen mode is turned on and off, as well as when errors occur during the process of changing between full-screen and windowed modes.</em>
es: <em>La API de pantalla completa define dos eventos que se pueden usar para detectar cu&aacute;ndo se activa y desactiva el modo de pantalla completa, as&iacute; como cu&aacute;ndo ocurren errores durante el proceso de cambio entre los modos de pantalla completa y ventana.</em>
ko: <em>전체 화면 API는 전체 화면 모드가 켜지고 꺼질 때뿐만 아니라 전체 화면 모드와 창 모드 간을 전환하는 과정에서 오류가 발생하는 경우를 감지하는 데 사용할 수있는 두 가지 이벤트를 정의합니다.</em>
ru: <em>Полноэкранный API-интерфейс определяет два события, которые можно использовать для определения, когда полноэкранный режим включается и выключается, а также когда возникают ошибки в процессе переключения между полноэкранным и оконным режимами.</em>
zh_cn: <em>全屏API定义了两个事件，可用于检测何时打开和关闭全屏模式，以及在全屏和窗口模式之间进行切换的过程中何时发生错误。</em>

source: <em>The Fullscreen API has no interfaces of its own. Instead, it augments several other interfaces to add the methods, properties, and event handlers needed to provide full-screen functionality. These are listed in the following sections.</em>
es: <em>La API de pantalla completa no tiene interfaces propias. En cambio, aumenta varias otras interfaces para agregar los m&eacute;todos, propiedades y controladores de eventos necesarios para proporcionar la funcionalidad de pantalla completa. Estos se enumeran en las siguientes secciones.</em>
ko: <em>전체 화면 API에는 자체 인터페이스가 없습니다. 대신 전체 화면 기능을 제공하는 데 필요한 메소드, 특성 및 이벤트 핸들러를 추가하기 위해 다른 여러 인터페이스를 보강합니다. 이들은 다음 섹션에 나열되어 있습니다.</em>
ru: <em>Полноэкранный API не имеет собственных интерфейсов. Вместо этого он дополняет несколько других интерфейсов, добавляя методы, свойства и обработчики событий, необходимые для обеспечения полноэкранного режима. Они перечислены в следующих разделах.</em>
zh_cn: <em>全屏API没有自己的接口。相反，它增强了其他几个接口，以添加提供全屏功能所需的方法，属性和事件处理程序。这些在以下各节中列出。</em>

source: <em>The Touch<code>EventInit</code></em><em> dictionary also accepts fields from <a href="../uievent/uievent"><code>UIEventInit</code></a> and from <a href="../event/event"><code>EventInit</code></a> dictionaries.</em>
es: <em>El <code>EventInit</code> </em><em>diccionario </em><em>Touch </em><em>EventInit</em><em> tambi&eacute;n acepta campos de <a href="../uievent/uievent"> <code>UIEventInit</code> </a> y de los diccionarios <a href="../event/event"> <code>EventInit</code> </a> .</em>
ko: <em>Touch <code>EventInit</code> </em><em> 사전은 <a href="../uievent/uievent"> <code>UIEventInit</code> </a> 및 <a href="../event/event"> <code>EventInit</code> </a> 사전의 필드도 허용합니다 .</em>
ru: <em> <code>EventInit</code> </em><em> Touch </em><em>EventInit</em><em> также принимает поля из <a href="../uievent/uievent"> <code>UIEventInit</code> </a> и словарей <a href="../event/event"> <code>EventInit</code> </a> .</em>
zh_cn: <em>Touch <code>EventInit</code> </em><em>词典还接受<a href="../uievent/uievent"> <code>UIEventInit</code> </a>和<a href="../event/event"> <code>EventInit</code> </a>词典中的字段。</em>

source: <em>The Worklet interface does not define any properties.</em>
es: <em>La interfaz de Worklet no define ninguna propiedad.</em>
ko: <em>Worklet 인터페이스는 속성을 정의하지 않습니다.</em>
ru: <em>Интерфейс Worklet не определяет никаких свойств.</em>
zh_cn: <em>Worklet接口未定义任何属性。</em>

source: <em>The events properties, of the form <code>onXYZ</code>, are defined on the <a href="windoweventhandlers"><code>WindowEventHandlers</code></a>, and implemented by <a href="window"><code>Window</code></a>, and <a href="workerglobalscope"><code>WorkerGlobalScope</code></a> for Web Workers.</em>
es: <em>Las propiedades de eventos, del formulario <code>onXYZ</code> , est&aacute;n definidas en <a href="windoweventhandlers"> <code>WindowEventHandlers</code> </a> e implementadas por <a href="window"> <code>Window</code> </a> y <a href="workerglobalscope"> <code>WorkerGlobalScope</code> </a> para Web Workers.</em>
ko: <em> <code>onXYZ</code> 형식의 이벤트 속성 은 <a href="windoweventhandlers"> <code>WindowEventHandlers</code> 에</a> 정의 되고 <a href="window"> <code>Window</code> </a> 및 <a href="workerglobalscope"> <code>WorkerGlobalScope</code> </a> for Web Workers에 의해 구현됩니다 .</em>
ru: <em>Свойства событий в форме <code>onXYZ</code> определены в <a href="windoweventhandlers"> <code>WindowEventHandlers</code> </a> и реализованы в <a href="window"> <code>Window</code> </a> и <a href="workerglobalscope"> <code>WorkerGlobalScope</code> </a> для веб-работников.</em>
zh_cn: <em>事件属性的形式为 <code>onXYZ</code> ，在<a href="windoweventhandlers"> <code>WindowEventHandlers</code> </a>上定义，并由<a href="window"> <code>Window</code> </a>和<a href="workerglobalscope"> <code>WorkerGlobalScope</code> </a>实现。</em>

source: <em>The following dictionaries include <code>PaymentDetailsBase</code>.</em>
es: <em>Los siguientes diccionarios incluyen <code>PaymentDetailsBase</code> .</em>
ko: <em>다음 사전에는 <code>PaymentDetailsBase</code> 가 포함 됩니다 .</em>
ru: <em>Следующие словари включают в себя <code>PaymentDetailsBase</code> .</em>
zh_cn: <em>以下字典包括 <code>PaymentDetailsBase</code> 。</em>

source: <em>The new version of the <code>MediaQueryList</code> interface inherits methods from its parent interface, <a href="eventtarget"><code>EventTarget</code></a>.</em>
es: <em>La nueva versi&oacute;n de la interfaz <code>MediaQueryList</code> hereda los m&eacute;todos de su interfaz principal, <a href="eventtarget"> <code>EventTarget</code> </a> .</em>
ko: <em>새 버전의 <code>MediaQueryList</code> 인터페이스는 상위 인터페이스 인 <a href="eventtarget"> <code>EventTarget</code> </a> 에서 메소드를 상속합니다 .</em>
ru: <em>Новая версия <code>MediaQueryList</code> методов интерфейс наследуется от родительского интерфейса, <a href="eventtarget"> <code>EventTarget</code> </a> .</em>
zh_cn: <em> <code>MediaQueryList</code> 接口的新版本从其父接口<a href="eventtarget"> <code>EventTarget</code> </a>继承方法。</em>

source: <em>The new version of the <code>MediaQueryList</code> interface inherits properties from its parent interface, <a href="eventtarget"><code>EventTarget</code></a>.</em>
es: <em>La nueva versi&oacute;n de la interfaz <code>MediaQueryList</code> hereda las propiedades de su interfaz principal, <a href="eventtarget"> <code>EventTarget</code> </a> .</em>
ko: <em>새 버전의 <code>MediaQueryList</code> 인터페이스는 상위 인터페이스 인 <a href="eventtarget"> <code>EventTarget</code> </a> 에서 특성을 상속합니다 .</em>
ru: <em>Новая версия <code>MediaQueryList</code> интерфейс наследует свойства от родительского интерфейса, <a href="eventtarget"> <code>EventTarget</code> </a> .</em>
zh_cn: <em> <code>MediaQueryList</code> 接口的新版本从其父接口<a href="eventtarget"> <code>EventTarget</code> </a>继承属性。</em>

source: <em>The return value is an <a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Array"><code>Array</code></a> of <a href="../mediastream"><code>MediaStream</code></a> objects.</em>
es: <em>El valor de retorno es una <a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Array"> <code>Array</code> </a> de objetos <a href="../mediastream"> <code>MediaStream</code> </a> .</em>
ko: <em>반환 값은 <a href="../mediastream"> <code>MediaStream</code> </a> 객체 의 <a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Array"> <code>Array</code> </a> 입니다 .</em>
ru: <em>Возвращаемое значение представляет собой <a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Array"> <code>Array</code> </a> из <a href="../mediastream"> <code>MediaStream</code> </a> объектов.</em>
zh_cn: <em>返回值是一个<a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Array"> <code>Array</code> </a>的<a href="../mediastream"> <code>MediaStream</code> </a>对象。</em>

source: <em>There are neither inherited, nor specific properties.</em>
es: <em>No hay propiedades heredadas ni espec&iacute;ficas.</em>
ko: <em>상속되거나 특정 속성이 없습니다.</em>
ru: <em>Здесь нет ни наследственных, ни специфических свойств.</em>
zh_cn: <em>没有继承的属性，也没有特定的属性。</em>

source: <em>There are no inherited method.</em>
es: <em>No hay m&eacute;todo heredado.</em>
ko: <em>상속 된 메소드가 없습니다.</em>
ru: <em>Нет унаследованного метода.</em>
zh_cn: <em>没有继承的方法。</em>

source: <em>There are no inherited methods.</em>
es: <em>No hay m&eacute;todos heredados.</em>
ko: <em>상속 된 메소드가 없습니다.</em>
ru: <em>Нет унаследованных методов.</em>
zh_cn: <em>没有继承的方法。</em>

source: <em>There are no inherited properties.</em>
es: <em>No hay propiedades heredadas.</em>
ko: <em>상속 된 속성이 없습니다.</em>
ru: <em>Нет унаследованных свойств.</em>
zh_cn: <em>没有继承的属性。</em>

source: <em>There is neither inherited, nor specific method.</em>
es: <em>No existe un m&eacute;todo heredado ni espec&iacute;fico.</em>
ko: <em>상속 된 방법도없고 특정한 방법도 없습니다.</em>
ru: <em>Здесь нет ни наследственных, ни специфических методов.</em>
zh_cn: <em>既没有继承，也没有特定的方法。</em>

source: <em>There is neither parameter nor return value for this method.</em>
es: <em>No hay par&aacute;metro ni valor de retorno para este m&eacute;todo.</em>
ko: <em>이 메소드에는 매개 변수 나 리턴 값이 없습니다.</em>
ru: <em>Для этого метода нет ни параметра, ни возвращаемого значения.</em>
zh_cn: <em>此方法既没有参数，也没有返回值。</em>

source: <em>There is no inherited method.</em>
es: <em>No hay m&eacute;todo heredado.</em>
ko: <em>상속 된 메소드가 없습니다.</em>
ru: <em>Нет унаследованного метода.</em>
zh_cn: <em>没有继承的方法。</em>

source: <em>There is no inherited property.</em>
es: <em>No hay propiedad heredada.</em>
ko: <em>상속 재산이 없습니다.</em>
ru: <em>Унаследованного имущества нет.</em>
zh_cn: <em>没有继承的属性。</em>

source: <em>There is no return value for this method.</em>
es: <em>No hay valor de retorno para este m&eacute;todo.</em>
ko: <em>이 메소드에는 리턴 값이 없습니다.</em>
ru: <em>Для этого метода нет возвращаемого значения.</em>
zh_cn: <em>该方法没有返回值。</em>

source: <em>These properties have been removed from the specification and should no longer be used.</em>
es: <em>Estas propiedades se han eliminado de la especificaci&oacute;n y ya no se deben usar.</em>
ko: <em>이러한 특성은 사양에서 제거되었으며 더 이상 사용해서는 안됩니다.</em>
ru: <em>Эти свойства были удалены из спецификации и больше не должны использоваться.</em>
zh_cn: <em>这些属性已从规范中删除，不应再使用。</em>

source: <em>This <em>type</em> has no methods.</em>
es: <em>Este <em>tipo</em> no tiene m&eacute;todos.</em>
ko: <em>이 <em>유형</em> 에는 메소드가 없습니다.</em>
ru: <em>Этот <em>тип</em> не имеет методов.</em>
zh_cn: <em>此<em>类型</em>没有方法。</em>

source: <em>This <em>type</em> has no properties. It is a double-precision floating-point value.</em>
es: <em>Este <em>tipo</em> no tiene propiedades. Es un valor de coma flotante de doble precisi&oacute;n.</em>
ko: <em>이 <em>유형</em> 에는 속성이 없습니다. 배정 밀도 부동 소수점 값입니다.</em>
ru: <em>Этот <em>тип</em> не имеет свойств. Это значение с плавающей точкой двойной точности.</em>
zh_cn: <em>此<em>类型</em>没有属性。它是一个双精度浮点值。</em>

source: <em>This dictionary also inherits properties from the <a href="rtcofferansweroptions"><code>RTCOfferAnswerOptions</code></a> dictionary, on which it's based.</em>
es: <em>Este diccionario tambi&eacute;n hereda propiedades del diccionario <a href="rtcofferansweroptions"> <code>RTCOfferAnswerOptions</code> </a> , en el que se basa.</em>
ko: <em>이 사전은 또한 <a href="rtcofferansweroptions"> <code>RTCOfferAnswerOptions</code> </a> 사전의 기반이되는 속성을 상속합니다 .</em>
ru: <em>Этот словарь также наследует свойства из словаря <a href="rtcofferansweroptions"> <code>RTCOfferAnswerOptions</code> </a> , на котором он основан.</em>
zh_cn: <em>该词典还继承了<a href="rtcofferansweroptions"> <code>RTCOfferAnswerOptions</code> </a>词典的属性。</em>

source: <em>This dictionary currently always has both of the following properties defined.</em>
es: <em>Actualmente, este diccionario siempre tiene definidas las dos propiedades siguientes.</em>
ko: <em>이 사전에는 항상 다음 속성이 모두 정의되어 있습니다.</em>
ru: <em>Этот словарь в настоящее время всегда имеет оба следующих свойства.</em>
zh_cn: <em>当前，此字典始终都定义了以下两个属性。</em>

source: <em>This dictionary inherits properties from the <a href="rtcofferansweroptions"><code>RTCOfferAnswerOptions</code></a> dictionary, on which it's based.</em>
es: <em>Este diccionario hereda las propiedades del diccionario <a href="rtcofferansweroptions"> <code>RTCOfferAnswerOptions</code> </a> , en el que se basa.</em>
ko: <em>이 사전은 <a href="rtcofferansweroptions"> <code>RTCOfferAnswerOptions</code> </a> 사전의 기반이되는 속성을 상속합니다 .</em>
ru: <em>Этот словарь наследует свойства из словаря <a href="rtcofferansweroptions"> <code>RTCOfferAnswerOptions</code> </a> , на котором он основан.</em>
zh_cn: <em>该词典从<a href="rtcofferansweroptions"> <code>RTCOfferAnswerOptions</code> </a>词典继承属性，该词典基于该属性。</em>

source: <em>This interface <em>inherits methods from its parents, <a href="uievent"><code>UIEvent</code></a> and <a href="event"><code>Event</code></a>.</em></em>
es: <em>Esta interfaz <em>hereda los m&eacute;todos de sus padres, <a href="uievent"> <code>UIEvent</code> </a> y <a href="event"> <code>Event</code> </a> .</em></em>
ko: <em>이 인터페이스 <em>는 부모 인 <a href="uievent"> <code>UIEvent</code> </a> 및 <a href="event"> <code>Event</code> 의</a> 메소드를 상속합니다 .</em></em>
ru: <em>Этот интерфейс <em>наследует методы от своих родителей, <a href="uievent"> <code>UIEvent</code> </a> и <a href="event"> <code>Event</code> </a> .</em></em>
zh_cn: <em>此接口<em>从其父<a href="uievent"> <code>UIEvent</code> </a>和<a href="event"> <code>Event</code> </a>继承方法。</em></em>

source: <em>This interface <em>inherits properties and </em>methods from its parent int<em>erface, <a href="event"><code>Event</code></a>. </em></em>
es: <em>Esta interfaz <em>hereda propiedades y</em> m&eacute;todos de su <em>interfaz principal, <a href="event"> <code>Event</code> </a> .</em></em>
ko: <em>이 인터페이스 <em>는</em> 부모 인터페이스 <em>인 </em><em><a href="event"> <code>Event</code> </a></em> 에서 <em>속성과</em> 메서드를 <em>상속합니다 </em><em>.</em><em></em></em>
ru: <em>Этот интерфейс <em>наследует свойства и</em> методы от своего родительского <em>интерфейса <a href="event"> <code>Event</code> </a> .</em></em>
zh_cn: <em>此接口<em>继承属性，并</em>从其父INT方法<em>erface，<a href="event"> <code>Event</code> </a>。</em></em>

source: <em>This interface <em>inherits properties from its parent interface, <a href="event"><code>Event</code></a>.</em></em>
es: <em>Esta interfaz <em>hereda propiedades de su interfaz principal, <a href="event"> <code>Event</code> o</a> .</em></em>
ko: <em>이 인터페이스 <em>는 부모 인터페이스 인 <a href="event"> <code>Event</code> </a> 에서 속성을 상속합니다 .</em></em>
ru: <em>Этот интерфейс <em>наследует свойства своего родительского интерфейса <a href="event"> <code>Event</code> </a> .</em></em>
zh_cn: <em>此接口<em>从其父接口<a href="event"> <code>Event</code> </a>继承属性。</em></em>

source: <em>This interface <em>inherits properties from its parents, <a href="mouseevent"><code>MouseEvent</code></a>, <a href="uievent"><code>UIEvent</code></a> and <a href="event"><code>Event</code></a>.</em></em>
es: <em>Esta interfaz <em>hereda propiedades de sus padres, <a href="mouseevent"> <code>MouseEvent</code> </a> , <a href="uievent"> <code>UIEvent</code> </a> y <a href="event"> <code>Event</code> </a> .</em></em>
ko: <em>이 인터페이스 <em>는 부모, <a href="mouseevent"> <code>MouseEvent</code> </a> , <a href="uievent"> <code>UIEvent</code> </a> 및 <a href="event"> <code>Event</code> </a> 에서 속성을 상속합니다 .</em></em>
ru: <em>Этот интерфейс <em>наследует свойства от своих родителей, <a href="mouseevent"> <code>MouseEvent</code> </a> , <a href="uievent"> <code>UIEvent</code> </a> и <a href="event"> <code>Event</code> </a> .</em></em>
zh_cn: <em>此接口<em>从其父类<a href="mouseevent"> <code>MouseEvent</code> </a>，<a href="uievent"> <code>UIEvent</code> </a>和<a href="event"> <code>Event</code> </a>继承属性。</em></em>
