Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/dom/dom.*.007.xlf
Languages: es, ko, ru, zh_cn

source: <strong>Browser Calls authenticatorGetCredential() on Authenticator</strong> - Internally, the browser will validate the parameters and fill in any defaults, which become the <a href="authenticatorresponse/clientdatajson"><code>AuthenticatorResponse.clientDataJSON</code></a>. One of the most important parameters is the origin, which recorded as part of the clientData so that the origin can be verified by the server later. The parameters to the get() call are passed to the authenticator, along with a SHA-256 hash of the clientDataJSON (only a hash is sent because the link to the authenticator may be a low-bandwidth NFC or Bluetooth link and the authenticator is just going to sign over the hash to ensure that it isn't tampered with).
es: <strong>Browser Calls authenticatorGetCredential () en Authenticator</strong> : internamente, el navegador validar&aacute; los par&aacute;metros y completar&aacute; los valores predeterminados, que se convierten en <a href="authenticatorresponse/clientdatajson"> <code>AuthenticatorResponse.clientDataJSON</code> </a> . Uno de los par&aacute;metros m&aacute;s importantes es el origen, que se registra como parte de los datos del cliente para que el servidor pueda verificar el origen m&aacute;s adelante. Los par&aacute;metros para la llamada get () se pasan al autenticador, junto con un hash SHA-256 del clientDataJSON (solo se env&iacute;a un hash porque el enlace al autenticador puede ser un enlace NFC o Bluetooth de bajo ancho de banda y el autenticador es solo va a firmar el hash para asegurarse de que no sea alterado).
ko: <strong>브라우저 Authenticator에서 authenticatorGetCredential ()을 호출합니다.</strong> 내부적으로 브라우저는 매개 변수의 유효성을 검사하고 기본값을 채우며 <a href="authenticatorresponse/clientdatajson"> <code>AuthenticatorResponse.clientDataJSON</code> 이</a> 됩니다. 가장 중요한 매개 변수 중 하나는 origin이며, 서버에서 나중에 원본을 확인할 수 있도록 clientData의 일부로 기록됩니다. get () 호출에 대한 매개 변수는 clientDataJSON의 SHA-256 해시와 함께 인증 자에게 전달됩니다 (인증 자에 대한 링크는 저 대역폭 NFC 또는 Bluetooth 링크 일 수 있고 인증자는 변조되지 않도록 해시에 서명하면됩니다).
ru: <strong>Браузер вызывает authenticatorGetCredential () для Authenticator.</strong> Внутренне браузер проверяет параметры и вводит все значения по умолчанию, которые становятся <a href="authenticatorresponse/clientdatajson"> <code>AuthenticatorResponse.clientDataJSON</code> </a> . Одним из наиболее важных параметров является источник, который записан как часть clientData, так что источник может быть проверен сервером позже. Параметры для вызова get () передаются в аутентификатор вместе с хешем SHA-256 clientDataJSON (отправляется только хеш, поскольку ссылка на аутентификатор может быть ссылкой NFC или Bluetooth с низкой пропускной способностью, а аутентификатор является просто собираюсь подписать хеш, чтобы убедиться, что он не подделан).
zh_cn: <strong>浏览器在Authenticator上调用authenticatorGetCredential（）</strong> -内部，浏览器将验证参数并填写所有默认值，这些默认值将成为<a href="authenticatorresponse/clientdatajson"> <code>AuthenticatorResponse.clientDataJSON</code> </a>。最重要的参数之一是原点，它被记录为clientData的一部分，以便稍后可以由服务器验证原点。 get（）调用的参数与clientDataJSON的SHA-256哈希一起传递给身份验证器（仅发送哈希，因为到身份验证器的链接可能是低带宽NFC或蓝牙链接，并且身份验证器是只需在哈希上签名以确保它不会被篡改）。

source: <strong>Browser Calls authenticatorMakeCredential() on Authenticator</strong> - Internally, the browser will validate the parameters and fill in any defaults, which become the <a href="authenticatorresponse/clientdatajson"><code>AuthenticatorResponse.clientDataJSON</code></a>. One of the most important parameters is the origin, which is recorded as part of the clientData so that the origin can be verified by the server later. The parameters to the create() call are passed to the authenticator, along with a SHA-256 hash of the clientDataJSON (only a hash is sent because the link to the authenticator may be a low-bandwidth NFC or Bluetooth link and the authenticator is just going to sign over the hash to ensure that it isn't tampered with).
es: <strong>El navegador llama a authenticatorMakeCredential () en Authenticator</strong> : internamente, el navegador validar&aacute; los par&aacute;metros y completar&aacute; los valores predeterminados, que se convierten en <a href="authenticatorresponse/clientdatajson"> <code>AuthenticatorResponse.clientDataJSON</code> </a> . Uno de los par&aacute;metros m&aacute;s importantes es el origen, que se registra como parte de clientData para que el servidor pueda verificar el origen m&aacute;s adelante. Los par&aacute;metros para la llamada create () se pasan al autenticador, junto con un hash SHA-256 del clientDataJSON (solo se env&iacute;a un hash porque el enlace al autenticador puede ser un enlace NFC o Bluetooth de bajo ancho de banda y el autenticador es solo va a firmar el hash para asegurarse de que no sea alterado).
ko: <strong>브라우저 Authenticator에서 authenticatorMakeCredential ()을 호출합니다.</strong> 내부적으로 브라우저는 매개 변수의 유효성을 검사하고 기본값을 채우며 <a href="authenticatorresponse/clientdatajson"> <code>AuthenticatorResponse.clientDataJSON</code> 이</a> 됩니다. 가장 중요한 매개 변수 중 하나는 origin이며, 이는 서버에서 나중에 원본을 확인할 수 있도록 clientData의 일부로 기록됩니다. create () 호출에 대한 매개 변수는 clientDataJSON의 SHA-256 해시와 함께 인증 자에게 전달됩니다 (인증 자에 대한 링크는 저 대역폭 NFC 또는 Bluetooth 링크 일 수 있고 인증자는 변조되지 않도록 해시에 서명하면됩니다).
ru: <strong>Браузер вызывает authenticatorMakeCredential () для Authenticator.</strong> Внутренне браузер проверяет параметры и вводит все значения по умолчанию, которые становятся <a href="authenticatorresponse/clientdatajson"> <code>AuthenticatorResponse.clientDataJSON</code> </a> . Одним из наиболее важных параметров является источник, который записывается как часть clientData, так что источник может быть проверен сервером позже. Параметры для вызова create () передаются в аутентификатор вместе с хешем SHA-256 clientDataJSON (отправляется только хеш, потому что ссылка на аутентификатор может быть ссылкой NFC или Bluetooth с низкой пропускной способностью, а аутентификатор просто собираюсь подписать хеш, чтобы убедиться, что он не подделан).
zh_cn: <strong>浏览器在Authenticator上调用authenticatorMakeCredential（）</strong> -内部，浏览器将验证参数并填写所有默认值，这些默认值将成为<a href="authenticatorresponse/clientdatajson"> <code>AuthenticatorResponse.clientDataJSON</code> </a>。最重要的参数之一是原点，它被记录为clientData的一部分，以便稍后可以由服务器验证原点。 create（）调用的参数与clientDataJSON的SHA-256哈希一起传递给身份验证器（仅发送哈希，因为到身份验证器的链接可能是低带宽NFC或蓝牙链接，并且身份验证器是只需在哈希上签名以确保它不会被篡改）。

source: <strong>Browser Creates Final Data, Application sends response to Server</strong> - The browser resolves the <a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Promise">Promise</a> to a <a href="publickeycredential"><code>PublicKeyCredential</code></a> with a <a href="https://developer.mozilla.org/en-US/docs/Web/API/PublicKeyCredential/response"><code>PublicKeyCredential.response</code></a> that contains the <a href="authenticatorassertionresponse"><code>AuthenticatorAssertionResponse</code></a>. It is up to the JavaScript application to transmit this data back to the server using any protocol and format of its choice.
es: <strong>El navegador crea datos finales, la aplicaci&oacute;n env&iacute;a una respuesta al servidor</strong> : el navegador resuelve la <a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Promise">promesa</a> a <a href="publickeycredential"> <code>PublicKeyCredential</code> </a> con <a href="https://developer.mozilla.org/en-US/docs/Web/API/PublicKeyCredential/response"> <code>PublicKeyCredential.response</code> </a> que contiene <a href="authenticatorassertionresponse"> <code>AuthenticatorAssertionResponse</code> </a> . Depende de la aplicaci&oacute;n de JavaScript transmitir estos datos al servidor utilizando cualquier protocolo y formato de su elecci&oacute;n.
ko: <strong>브라우저는 최종 데이터를 생성하고 응용 프로그램은 서버에 응답을 보냅니다</strong> . 브라우저 는 <a href="authenticatorassertionresponse"> <code>AuthenticatorAssertionResponse</code> </a> 가 포함 된 <a href="https://developer.mozilla.org/en-US/docs/Web/API/PublicKeyCredential/response"> <code>PublicKeyCredential.response</code> </a> 를 사용 하여 <a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Promise">약속</a> 을 <a href="publickeycredential"> <code>PublicKeyCredential</code> </a> 로 확인합니다 . 선택한 프로토콜과 형식을 사용하여이 데이터를 서버로 다시 전송하는 것은 JavaScript 응용 프로그램에 달려 있습니다.
ru: <strong>Браузер создает окончательные данные, приложение отправляет ответ на сервер</strong> - браузер разрешает <a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Promise">Promise</a> для <a href="publickeycredential"> <code>PublicKeyCredential</code> </a> с помощью <a href="https://developer.mozilla.org/en-US/docs/Web/API/PublicKeyCredential/response"> <code>PublicKeyCredential.response</code> ,</a> который содержит <a href="authenticatorassertionresponse"> <code>AuthenticatorAssertionResponse</code> </a> . Приложение JavaScript должно передавать эти данные обратно на сервер, используя любой протокол и формат по своему выбору.
zh_cn: <strong>浏览器创建最终数据，应用程序将响应发送到服务器</strong> -浏览器使用包含<a href="authenticatorassertionresponse"> <code>AuthenticatorAssertionResponse</code> </a>的<a href="https://developer.mozilla.org/en-US/docs/Web/API/PublicKeyCredential/response"> <code>PublicKeyCredential.response</code> </a>将<a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Promise">Promise</a>解析为<a href="publickeycredential"> <code>PublicKeyCredential</code> </a>。 JavaScript应用程序可以使用其选择的任何协议和格式将数据传输回服务器。

source: <strong>Browser Creates Final Data, Application sends response to Server</strong> - The create() Promise resolves to an <a href="publickeycredential"><code>PublicKeyCredential</code></a>, which has a <a href="https://developer.mozilla.org/en-US/docs/Web/API/PublicKeyCredential/rawId"><code>PublicKeyCredential.rawId</code></a> that is the globally unique credential id along with a response that is the <a href="authenticatorattestationresponse"><code>AuthenticatorAttestationResponse</code></a> containing the <a href="authenticatorresponse/clientdatajson"><code>AuthenticatorResponse.clientDataJSON</code></a> and <a href="authenticatorattestationresponse/attestationobject"><code>AuthenticatorAttestationResponse.attestationObject</code></a>. The <a href="publickeycredential"><code>PublicKeyCredential</code></a> is sent back to the server using any desired formatting and protocol (note that the ArrayBuffer properties need to be be base64 encoded or similar).
es: <strong>El navegador crea datos finales, la aplicaci&oacute;n env&iacute;a una respuesta al servidor</strong> : la promesa create () se resuelve en una <a href="publickeycredential"> <code>PublicKeyCredential</code> </a> , que tiene una <a href="https://developer.mozilla.org/en-US/docs/Web/API/PublicKeyCredential/rawId"> <code>PublicKeyCredential.rawId</code> </a> que es la identificaci&oacute;n de credencial globalmente &uacute;nica junto con una respuesta que es <a href="authenticatorattestationresponse"> <code>AuthenticatorAttestationResponse</code> que</a> contiene <a href="authenticatorresponse/clientdatajson"> <code>AuthenticatorResponse.clientDataJSON</code> </a> y <a href="authenticatorattestationresponse/attestationobject"> <code>AuthenticatorAttestationResponse.attestationObject</code> </a> . El <a href="publickeycredential"> <code>PublicKeyCredential</code> </a> se env&iacute;a de vuelta al servidor usando cualquier formato y protocolo deseado (nota que las propiedades ArrayBuffer necesitan ser ser base64 codificados o similar).
ko: <strong>브라우저 응용 프로그램 서버에 응답을 전송, 최종 데이터를 작성합니다</strong> -가에 () 약속의 결의를 만들 <a href="publickeycredential"> <code>PublicKeyCredential</code> </a> 가, <a href="https://developer.mozilla.org/en-US/docs/Web/API/PublicKeyCredential/rawId"> <code>PublicKeyCredential.rawId</code> </a> 는 IS 응답과 함께 전 세계적으로 유일한 자격 증명 ID입니다 <a href="authenticatorattestationresponse"> <code>AuthenticatorAttestationResponse</code> </a> 포함하는 <a href="authenticatorresponse/clientdatajson"> <code>AuthenticatorResponse.clientDataJSON</code> </a> 및 <a href="authenticatorattestationresponse/attestationobject"> <code>AuthenticatorAttestationResponse.attestationObject</code> </a> . <a href="publickeycredential"> <code>PublicKeyCredential</code> 는</a> 합니다 (ArrayBuffer의 특성을 base64 인코딩 또는 유사해야 참고) 임의의 포맷 및 프로토콜을 사용하여 서버에 다시 전송된다.
ru: <strong>Браузер создает окончательные данные, приложение отправляет ответ на сервер</strong> - Обещание create () разрешается в <a href="publickeycredential"> <code>PublicKeyCredential</code> </a> , который имеет <a href="https://developer.mozilla.org/en-US/docs/Web/API/PublicKeyCredential/rawId"> <code>PublicKeyCredential.rawId</code> ,</a> который является глобально уникальным идентификатором учетных данных, наряду с ответом, который является <a href="authenticatorattestationresponse"> <code>AuthenticatorAttestationResponse</code> ,</a> содержащим <a href="authenticatorresponse/clientdatajson"> <code>AuthenticatorResponse.clientDataJSON</code> </a> и <a href="authenticatorattestationresponse/attestationobject"> <code>AuthenticatorAttestationResponse.attestationObject</code> </a> . <a href="publickeycredential"> <code>PublicKeyCredential</code> </a> отправляется обратно на сервер с использованием любого требуемого форматирования и протокола (обратите внимание , что свойства ArrayBuffer должны быть в кодировке base64 или аналогичный).
zh_cn: <strong>浏览器创建最终数据，应用程序将响应发送到服务器</strong><a href="publickeycredential"> <code>PublicKeyCredential</code> </a>（）承诺解析为PublicKeyCredential，该<a href="https://developer.mozilla.org/en-US/docs/Web/API/PublicKeyCredential/rawId"> <code>PublicKeyCredential.rawId</code> </a>具有PublicKeyCredential.rawId（这是全局唯一的凭据ID）以及响应，该响应是<a href="authenticatorattestationresponse"> <code>AuthenticatorAttestationResponse</code> ,</a>其中包含<a href="authenticatorresponse/clientdatajson"> <code>AuthenticatorResponse.clientDataJSON</code> </a>和<a href="authenticatorattestationresponse/attestationobject"> <code>AuthenticatorAttestationResponse.attestationObject</code> </a>。使用任何所需的格式和协议将<a href="publickeycredential"> <code>PublicKeyCredential</code> </a>发送回服务器（请注意，ArrayBuffer属性需要使用base64编码或类似的格式）。

source: <strong>Channel notation</strong>
es: <strong>Notaci&oacute;n de canal</strong>
ko: <strong>채널 표기</strong>
ru: <strong>Нотация канала</strong>
zh_cn: <strong>频道符号</strong>

source: <strong>Chrome Canary</strong>: Go to <code>chrome://flags</code> and turn on <code>experimental-web-platform-features</code>; restart browser (note that some features are now enabled by default in Chrome.)
es: <strong>Chrome Canary</strong> : Vaya a <code>chrome://flags</code> y active <code>experimental-web-platform-features</code> ; reiniciar el navegador (tenga en cuenta que algunas funciones ahora est&aacute;n habilitadas de forma predeterminada en Chrome).
ko: <strong>Chrome Canary</strong> : <code>chrome://flags</code> 로 이동하여 <code>experimental-web-platform-features</code> 켭니다 . 브라우저를 다시 시작합니다 (현재 Chrome에서 일부 기능이 기본적으로 사용 설정되어 있음).
ru: <strong>Chrome Canary</strong> : перейдите к <code>chrome://flags</code> и включите <code>experimental-web-platform-features</code> ; перезапустите браузер (обратите внимание, что некоторые функции теперь включены по умолчанию в Chrome.)
zh_cn: <strong>Chrome Canary</strong>：转到 <code>chrome://flags</code> ，然后打开 <code>experimental-web-platform-features</code> ；重新启动浏览器（请注意，Chrome默认已启用某些功能。）

source: <strong>Chrome:</strong> Main thread
es: <strong>Chrome:</strong> hilo principal
ko: <strong>크롬 :</strong> 메인 스레드
ru: <strong>Хром:</strong> Основная нить
zh_cn: <strong>铬：</strong>主螺纹

source: <strong>Class tag</strong> (<code>&lt;c&gt;&lt;/c&gt;</code>)
es: <strong>Etiqueta de clase</strong> ( <code>&lt;c&gt;&lt;/c&gt;</code> )
ko: <strong>클래스 태그</strong> ( <code>&lt;c&gt;&lt;/c&gt;</code> )
ru: <strong>Тег класса</strong> ( <code>&lt;c&gt;&lt;/c&gt;</code> )
zh_cn: <strong>类标记</strong>（ <code>&lt;c&gt;&lt;/c&gt;</code> ）

source: <strong>Clear the canvas</strong>
es: <strong>Limpiar el lienzo</strong>
ko: <strong>캔버스를 비 웁니다</strong>
ru: <strong>Очистить холст</strong>
zh_cn: <strong>清除画布</strong>

source: <strong>Color-renderable</strong> means:
es: <strong>Color representable</strong> significa:
ko: <strong>렌더링 가능한</strong> 수단 :
ru: <strong>Цветопередача</strong> означает:
zh_cn: <strong>显色</strong>方式：

source: <strong>Consistent error handling:</strong> The browser can check the validity of card numbers, and can tell the user if a card has expired (or is about to expire). The browser can automatically suggest which card to use based on past usage patterns or restrictions from the merchant (e.g, "we only accept Visa or Mastercard"), or allow the user to say which is their default/favorite card.
es: <strong>Manejo constante de errores:</strong> el navegador puede verificar la validez de los n&uacute;meros de tarjeta y puede decirle al usuario si una tarjeta ha caducado (o est&aacute; a punto de caducar). El navegador puede sugerir autom&aacute;ticamente qu&eacute; tarjeta usar seg&uacute;n los patrones de uso anteriores o las restricciones del comerciante (por ejemplo, "solo aceptamos Visa o Mastercard"), o permitir que el usuario indique cu&aacute;l es su tarjeta predeterminada / favorita.
ko: <strong>일관된 오류 처리 :</strong> 브라우저는 카드 번호의 유효성을 검사하고 카드가 만료되었는지 또는 만료되는지를 사용자에게 알릴 수 있습니다. 브라우저는 판매자의 과거 사용 패턴 또는 제한 사항 (예 : "비자 또는 마스터 카드 만 허용")에 따라 사용할 카드를 자동으로 제안하거나 사용자가 기본 / 좋아하는 카드를 말하도록 허용 할 수 있습니다.
ru: <strong>Последовательная обработка ошибок:</strong> браузер может проверить правильность номеров карт и сообщить пользователю, если срок действия карты истек (или скоро истечет). Браузер может автоматически предложить, какую карту использовать, основываясь на прошлых моделях использования или ограничениях от продавца (например, &laquo;мы принимаем только Visa или Mastercard&raquo;), или позволить пользователю сказать, какая карта является его / любимой по умолчанию.
zh_cn: <strong>一致的错误处理：</strong>浏览器可以检查卡号的有效性，并可以告知用户卡是否已过期（或即将过期）。浏览器可以根据过去的使用模式或商人的限制自动建议要使用哪个卡（例如，&ldquo;我们只接受Visa或Mastercard&rdquo;），或允许用户说出哪个是他们的默认/收藏卡。

source: <strong>Consistent experience on every site (that supports the API):</strong> As the payment sheet is controlled by the browser, it can tailor the experience to the user. This can include localizing the UI into the user's preferred language.
es: <strong>Experiencia consistente en cada sitio (que admite la API):</strong> como la hoja de pago es controlada por el navegador, puede adaptar la experiencia al usuario. Esto puede incluir localizar la IU en el idioma preferido del usuario.
ko: <strong>모든 사이트에서 일관된 경험 (API 지원) :</strong> 지불 시트는 브라우저에 의해 제어되므로 사용자에게 맞게 환경을 조정할 수 있습니다. 여기에는 UI를 사용자가 선호하는 언어로 지역화하는 것이 포함될 수 있습니다.
ru: <strong>Постоянный опыт работы на каждом сайте (который поддерживает API).</strong> Поскольку платежный лист контролируется браузером, он может адаптировать его для пользователя. Это может включать в себя локализацию пользовательского интерфейса на предпочтительный язык пользователя.
zh_cn: <strong>每个站点（支持API）上的一致体验：</strong>由于付款表是由浏览器控制的，因此它可以为用户定制体验。这可以包括将UI本地化为用户的首选语言。

source: <strong>Creating and resizing an external window with "resizable" feature</strong>
es: <strong>Crear y redimensionar una ventana externa con la funci&oacute;n "redimensionable"</strong>
ko: <strong>"크기 조정 가능"기능을 사용하여 외부 창 작성 및 크기 조정</strong>
ru: <strong>Создание и изменение размера внешнего окна с функцией &laquo;изменяемого размера&raquo;</strong>
zh_cn: <strong>使用&ldquo;可调整大小&rdquo;功能创建和调整外部窗口的大小</strong>

source: <strong>Credentials management</strong>: Users can manage their credit cards and shipping addresses directly in the browser. A browser can also sync these "credentials" across devices, making it easy for users to jump from desktop to mobile and back again when buying things.
es: <strong>Gesti&oacute;n de credenciales</strong> : los usuarios pueden gestionar sus tarjetas de cr&eacute;dito y direcciones de env&iacute;o directamente en el navegador. Un navegador tambi&eacute;n puede sincronizar estas "credenciales" en todos los dispositivos, lo que facilita a los usuarios saltar desde el escritorio al m&oacute;vil y viceversa cuando compran cosas.
ko: <strong>자격 증명 관리</strong> : 사용자는 브라우저에서 직접 신용 카드 및 배송 주소를 관리 할 수 ​​있습니다. 브라우저는 이러한 "자격 증명"을 장치간에 동기화 할 수 있으므로 사용자가 물건을 구입할 때 데스크탑에서 모바일로 쉽게 이동할 수 있습니다.
ru: <strong>Управление учетными данными</strong> : пользователи могут управлять своими кредитными картами и адресами доставки прямо в браузере. Браузер также может синхронизировать эти &laquo;учетные данные&raquo; на разных устройствах, что позволяет пользователям легко переходить с настольного компьютера на мобильный и обратно при покупке.
zh_cn: <strong>凭证管理</strong>：用户可以直接在浏览器中管理其信用卡和收货地址。浏览器还可以跨设备同步这些&ldquo;凭据&rdquo;，从而使用户在购买商品时可以轻松地从台式机跳到移动设备并再次返回。

source: <strong>Customized built-in element</strong>: These elements inherit from &mdash; and extend &mdash; built-in HTML elements.
es: <strong>Elemento integrado personalizado</strong> : estos elementos heredan de, y ampl&iacute;an, elementos HTML integrados.
ko: <strong>사용자 정의 기본 제공 요소</strong> :이 요소는 기본 제공 HTML 요소를 상속하여 확장합니다.
ru: <strong>Настраиваемый встроенный элемент</strong> : эти элементы наследуют и расширяют встроенные элементы HTML.
zh_cn: <strong>自定义的内置元素</strong>：这些元素继承自并扩展了内置HTML元素。

source: <strong>Directional light</strong> is light that is emitted from a specific direction. This is light that's coming from so far away that every photon is moving parallel to every other photon. Sunlight, for example, is considered directional light.
es: <strong>La luz direccional</strong> es la luz que se emite desde una direcci&oacute;n espec&iacute;fica. Esta es una luz que viene de tan lejos que cada fot&oacute;n se mueve en paralelo a cualquier otro fot&oacute;n. La luz solar, por ejemplo, se considera luz direccional.
ko: <strong>방향성 빛</strong> 은 특정 방향에서 방출되는 빛입니다. 이것은 모든 광자가 다른 모든 광자와 평행하게 움직 이도록 멀리서 오는 빛입니다. 예를 들어 햇빛은 방향성 빛으로 간주됩니다.
ru: <strong>Направленный свет</strong> - это свет, излучаемый в определенном направлении. Это свет, который исходит так далеко, что каждый фотон движется параллельно каждому другому фотону. Солнечный свет, например, считается направленным светом.
zh_cn: <strong>定向光是</strong>从特定方向发出的光。这是很远的光，每个光子都平行于其他光子移动。例如，阳光被认为是定向光。
