Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/dom/dom.*.007.xlf
Languages: es, ko, ru, zh_cn

source: <strong>Important</strong>: This method is obsolete, and has been renamed to <a href="https://developer.mozilla.org/en-US/docs/Web/API/AudioContext/createScriptProcessor"><code>AudioContext.createScriptProcessor()</code></a>. See also <a href="../scriptprocessornode"><code>ScriptProcessorNode</code></a>.
es: <strong>Importante</strong> : Este m&eacute;todo es obsoleto y ha cambiado su nombre a <a href="https://developer.mozilla.org/en-US/docs/Web/API/AudioContext/createScriptProcessor"> <code>AudioContext.createScriptProcessor()</code> </a> . Ver tambi&eacute;n <a href="../scriptprocessornode"> <code>ScriptProcessorNode</code> </a> .
ko: <strong>중요</strong> :이 메소드는 사용되지 않으며 <a href="https://developer.mozilla.org/en-US/docs/Web/API/AudioContext/createScriptProcessor"> <code>AudioContext.createScriptProcessor()</code> </a> 로 이름이 변경되었습니다 . <a href="../scriptprocessornode"> <code>ScriptProcessorNode</code> </a> 도 참조하십시오 .
ru: <strong>Важное замечание</strong> : Этот метод устарел и был переименован в <a href="https://developer.mozilla.org/en-US/docs/Web/API/AudioContext/createScriptProcessor"> <code>AudioContext.createScriptProcessor()</code> </a> . Смотрите также <a href="../scriptprocessornode"> <code>ScriptProcessorNode</code> </a> .
zh_cn: <strong>重要说明</strong>：此方法已过时，并且已重命名为<a href="https://developer.mozilla.org/en-US/docs/Web/API/AudioContext/createScriptProcessor"> <code>AudioContext.createScriptProcessor()</code> </a>。另请参见<a href="../scriptprocessornode"> <code>ScriptProcessorNode</code> </a>。

source: <strong>Important</strong>: This version of <code>timestamp</code> has been removed from the spec &mdash; instead, timestamps are returned when <a href="../vrdisplay/getframedata"><code>VRDisplay.getFrameData()</code></a> is called &mdash; see <a href="../vrframedata/timestamp"><code>VRFrameData.timestamp</code></a>.
es: <strong>Importante</strong> : Esta versi&oacute;n de <code>timestamp</code> de tiempo se ha eliminado de la especificaci&oacute;n; en cambio, las marcas de tiempo se devuelven cuando se llama a <a href="../vrdisplay/getframedata"> <code>VRDisplay.getFrameData()</code> </a> ; consulte <a href="../vrframedata/timestamp"> <code>VRFrameData.timestamp</code> </a> .
ko: <strong>중요</strong> :이 버전의 <code>timestamp</code> 사양에서 제거되었습니다 - 때 대신, 타임 스탬프가 반환됩니다 <a href="../vrdisplay/getframedata"> <code>VRDisplay.getFrameData()</code> </a> 참조 -라고 <a href="../vrframedata/timestamp"> <code>VRFrameData.timestamp</code> 을</a> .
ru: <strong>Важное </strong><a href="../vrdisplay/getframedata"> <code>VRDisplay.getFrameData()</code> </a> : эта версия <code>timestamp</code> была удалена из спецификации - вместо этого метки времени возвращаются при вызове VRDisplay.getFrameData () - см. <a href="../vrframedata/timestamp"> <code>VRFrameData.timestamp</code> </a> .
zh_cn: <strong>重要说明</strong>：此版本的 <code>timestamp</code> 已从规范中删除-而是在<a href="../vrdisplay/getframedata"> <code>VRDisplay.getFrameData()</code> </a>时返回时间戳-请参见<a href="../vrframedata/timestamp"> <code>VRFrameData.timestamp</code> </a>。

source: <strong>Important</strong>: Webkit currently (version 31) requires that a valid <code>bufferSize</code> be passed when calling this method.
es: <strong>Importante</strong> : Webkit actualmente (versi&oacute;n 31) requiere que se <code>bufferSize</code> un bufferSize v&aacute;lido al llamar a este m&eacute;todo.
ko: <strong>중요 사항</strong> : 현재 웹킷 (버전 31)에서는 이 메소드를 호출 할 때 유효한 <code>bufferSize</code> 가 전달되어야합니다.
ru: <strong>Важное</strong> замечание: Webkit в настоящее время (версия 31) требует, чтобы при вызове этого метода передавался допустимый <code>bufferSize</code> .
zh_cn: <strong>重要说明</strong>：Webkit当前（版本31）要求在调用此方法时传递有效的 <code>bufferSize</code> 。

source: <strong>Important</strong>: When fetching resources, it's very important to use <code>{mode: 'no-cors'}</code> if there is any chance that the resources are served off of a server that doesn't support <a href="http://en.wikipedia.org/wiki/Cross-origin_resource_sharing">CORS</a>. In this example, <a href="http://www.chromium.org">www.chromium.org</a> doesn't support CORS.
es: <strong>Importante</strong> : Al buscar recursos, es muy importante usar <code>{mode: 'no-cors'}</code> si existe la posibilidad de que los recursos se sirvan desde un servidor que no admite <a href="http://en.wikipedia.org/wiki/Cross-origin_resource_sharing">CORS</a> . En este ejemplo, <a href="http://www.chromium.org">www.chromium.org</a> no es compatible con CORS.
ko: <strong>중요 사항</strong> : 자원을 가져올 때 <a href="http://en.wikipedia.org/wiki/Cross-origin_resource_sharing">CORS를</a> 지원하지 않는 서버에서 자원이 제공 될 가능성이있는 경우 <code>{mode: 'no-cors'}</code> 를 사용하는 것이 매우 중요합니다 . 이 예에서 <a href="http://www.chromium.org">www.chromium.org</a> 는 CORS를 지원하지 않습니다.
ru: <strong>Важное</strong> замечание: При извлечении ресурсов очень важно использовать <code>{mode: 'no-cors'}</code> если есть вероятность того, что ресурсы будут обслуживаться с сервера, который не поддерживает <a href="http://en.wikipedia.org/wiki/Cross-origin_resource_sharing">CORS</a> . В этом примере <a href="http://www.chromium.org">www.chromium.org</a> не поддерживает CORS.
zh_cn: <strong>重要提示</strong>：在获取资源时，如果很有可能在不支持<a href="http://en.wikipedia.org/wiki/Cross-origin_resource_sharing">CORS</a>的服务器上提供资源，则使用 <code>{mode: 'no-cors'}</code> 非常重要。在此示例中，<a href="http://www.chromium.org">www.chromium.org</a>不支持CORS。

source: <strong>Important</strong>: these are not implemented anywhere as yet, and questions have been raised as to whether the spec details are in a finished enough state for them to be implemented. This may change over time.
es: <strong>Importante</strong> : todav&iacute;a no se han implementado en ninguna parte, y se han planteado preguntas sobre si los detalles de las especificaciones est&aacute;n en un estado lo suficientemente terminado para que puedan implementarse. Esto puede cambiar con el tiempo.
ko: <strong>중요</strong> : 이것들은 아직 어느 곳에서도 구현되지 않았으며 사양 세부 사항이 구현하기에 충분한 완성 상태인지에 대한 질문이 제기되었습니다. 시간이지나면서 변경 될 수 있습니다.
ru: <strong>Важно</strong> : они еще нигде не реализованы, и возникли вопросы о том, находятся ли детали спецификации в достаточно законченном состоянии для их реализации. Это может измениться со временем.
zh_cn: <strong>重要提示</strong>：尚未在任何地方实现这些功能，并且已经提出了有关规范详细信息是否处于完成状态以供实施的疑问。这可能会随着时间而改变。

source: <strong>In order to add an event-listener to an existing set of event-handlers use the function "addEventListener"</strong>
es: <strong>Para agregar un detector de eventos a un conjunto existente de controladores de eventos, use la funci&oacute;n "addEventListener"</strong>
ko: <strong>기존 이벤트 핸들러 세트에 이벤트 리스너를 추가하려면 "addEventListener"기능을 사용하십시오.</strong>
ru: <strong>Чтобы добавить прослушиватель событий к существующему набору обработчиков событий, используйте функцию &laquo;addEventListener&raquo;</strong>
zh_cn: <strong>为了将事件侦听器添加到现有的事件处理程序集中，请使用函数&ldquo; addEventListener&rdquo;</strong>

source: <strong>IndexedDB databases store key-value pairs.</strong> The values can be complex structured objects, and keys can be properties of those objects. You can create indexes that use any property of the objects for quick searching, as well as sorted enumeration. Keys can be binary objects.
es: <strong>Las bases de datos IndexedDB almacenan pares clave-valor. </strong>Los valores pueden ser objetos estructurados complejos y las claves pueden ser propiedades de esos objetos. Puede crear &iacute;ndices que utilicen cualquier propiedad de los objetos para la b&uacute;squeda r&aacute;pida, as&iacute; como la enumeraci&oacute;n ordenada. Las claves pueden ser objetos binarios.
ko: <strong>IndexedDB 데이터베이스는 키-값 쌍을 저장합니다. </strong>값은 복잡한 구조화 된 객체 일 수 있으며 키는 해당 객체의 속성 일 수 있습니다. 정렬 된 열거뿐만 아니라 빠른 검색을 위해 개체의 속성을 사용하는 인덱스를 만들 수 있습니다. 키는 이진 객체 일 수 있습니다.
ru: <strong>В базах данных IndexedDB хранятся пары ключ-значение. </strong>Значения могут быть сложными структурированными объектами, а ключи могут быть свойствами этих объектов. Вы можете создавать индексы, которые используют любое свойство объектов для быстрого поиска, а также отсортированного перечисления. Ключи могут быть двоичными объектами.
zh_cn: <strong>IndexedDB数据库存储键值对。</strong>这些值可以是复杂的结构化对象，而键可以是那些对象的属性。您可以创建使用对象的任何属性进行快速搜索以及排序枚举的索引。键可以是二进制对象。

source: <strong>IndexedDB does not use </strong><strong>Structured Query Language (<abbr>SQL</abbr>).</strong> It uses queries on an index that produces a cursor, which you use to iterate across the result set. If you are not familiar with NoSQL systems, read the <a href="https://en.wikipedia.org/wiki/NoSQL">Wikipedia article on NoSQL</a>.
es: <strong>IndexedDB no utiliza el </strong><strong>lenguaje de consulta estructurado ( <abbr>SQL</abbr> ). </strong>Utiliza consultas en un &iacute;ndice que produce un cursor, que se utiliza para iterar en el conjunto de resultados. Si no est&aacute; familiarizado con los sistemas NoSQL, lea el <a href="https://en.wikipedia.org/wiki/NoSQL">art&iacute;culo de Wikipedia sobre NoSQL</a> .
ko: <strong>IndexedDB는 </strong><strong><abbr>SQL</abbr></strong><strong> (Structured Query Language)을 <abbr></abbr></strong><strong>사용하지 않습니다 </strong><strong>. </strong>커서를 생성하는 인덱스에서 쿼리를 사용하여 결과 집합을 반복하는 데 사용합니다. NoSQL 시스템에 익숙하지 않은 경우 NoSQL에 대한 <a href="https://en.wikipedia.org/wiki/NoSQL">Wikipedia 기사를</a> 읽으십시오 .
ru: <strong>IndexedDB не использует язык </strong><strong>структурированных запросов ( <abbr>SQL</abbr> ). </strong>Он использует запросы к индексу, который создает курсор, который вы используете для итерации по набору результатов. Если вы не знакомы с системами NoSQL, прочтите <a href="https://en.wikipedia.org/wiki/NoSQL">статью</a> в Википедии о NoSQL .
zh_cn: <strong>IndexedDB不使用</strong><strong>结构化查询语言（<abbr>SQL</abbr>）。</strong>它使用对产生游标的索引的查询，您可以使用该游标在结果集中进行迭代。如果您不熟悉NoSQL系统，请阅读<a href="https://en.wikipedia.org/wiki/NoSQL">Wikipedia上有关NoSQL的文章</a>。

source: <strong>IndexedDB is built on a transactional database model</strong>. Everything you do in IndexedDB always happens in the context of a <a href="#gloss_transaction">transaction</a>. The IndexedDB API provides lots of objects that represent indexes, tables, cursors, and so on, but each of these is tied to a particular transaction. Thus, you cannot execute commands or open cursors outside of a transaction. Transactions have a well-defined lifetime, so attempting to use a transaction after it has completed throws exceptions. Also, transactions auto-commit and cannot be committed manually.
es: <strong>IndexedDB se basa en un modelo de base de datos transaccional</strong> . Todo lo que haces en IndexedDB siempre sucede en el contexto de una <a href="#gloss_transaction">transacci&oacute;n</a> . La API IndexedDB proporciona muchos objetos que representan &iacute;ndices, tablas, cursores, etc., pero cada uno de estos est&aacute; vinculado a una transacci&oacute;n en particular. Por lo tanto, no puede ejecutar comandos ni abrir cursores fuera de una transacci&oacute;n. Las transacciones tienen una vida &uacute;til bien definida, por lo que intentar usar una transacci&oacute;n despu&eacute;s de que haya completado arroja excepciones. Adem&aacute;s, las transacciones se confirman autom&aacute;ticamente y no se pueden confirmar manualmente.
ko: <strong>IndexedDB는 트랜잭션 데이터베이스 모델을 기반으로합니다</strong> . IndexedDB에서 수행하는 모든 작업은 항상 <a href="#gloss_transaction">트랜잭션</a> 컨텍스트에서 발생 합니다 . IndexedDB API는 인덱스, 테이블, 커서 등을 나타내는 많은 오브젝트를 제공하지만 이들 각각은 특정 트랜잭션과 연관되어 있습니다. 따라서 트랜잭션 외부에서 명령을 실행하거나 커서를 열 수 없습니다. 트랜잭션은 수명이 잘 정의되어 있으므로 완료된 후에 트랜잭션을 사용하려고하면 예외가 발생합니다. 또한 트랜잭션은 자동 커밋되며 수동으로 커밋 할 수 없습니다.
ru: <strong>IndexedDB построен на модели транзакционной базы данных</strong> . Все, что вы делаете в IndexedDB, всегда происходит в контексте <a href="#gloss_transaction">транзакции</a> . API IndexedDB предоставляет множество объектов, которые представляют индексы, таблицы, курсоры и т. Д., Но каждый из них привязан к конкретной транзакции. Таким образом, вы не можете выполнять команды или открывать курсоры вне транзакции. Транзакции имеют четко определенное время жизни, поэтому попытка использовать транзакцию после ее завершения выдает исключения. Кроме того, транзакции автоматически фиксируются и не могут быть зафиксированы вручную.
zh_cn: <strong>IndexedDB建立在事务数据库模型上</strong>。您在IndexedDB中所做的一切始终在<a href="#gloss_transaction">事务</a>上下文中发生。IndexedDB API提供了许多表示索引，表，游标等的对象，但每个对象都与特定的事务绑定。因此，您无法在事务外部执行命令或打开游标。事务具有明确定义的生存期，因此在事务完成后尝试使用它会引发异常。同样，事务会自动提交，无法手动提交。

source: <strong>IndexedDB is object-oriented.</strong> IndexedDB is not a relational database with tables representing collections of rows and columns. This important and fundamental difference affects the way you design and build your applications.
es: <strong>IndexedDB est&aacute; orientado a objetos. </strong>IndexedDB no es una base de datos relacional con tablas que representan colecciones de filas y columnas. Esta diferencia importante y fundamental afecta la forma en que dise&ntilde;a y crea sus aplicaciones.
ko: <strong>IndexedDB는 객체 지향적입니다. </strong>IndexedDB는 행 및 열 모음을 나타내는 테이블이있는 관계형 데이터베이스가 아닙니다. 이 중요하고 근본적인 차이점은 응용 프로그램을 디자인하고 구축하는 방법에 영향을줍니다.
ru: <strong>IndexedDB является объектно-ориентированным. </strong>IndexedDB не является реляционной базой данных с таблицами, представляющими коллекции строк и столбцов. Это важное и фундаментальное различие влияет на то, как вы проектируете и создаете свои приложения.
zh_cn: <strong>IndexedDB是面向对象的。</strong>IndexedDB不是具有表表示行和列的集合的关系数据库。这种重要和根本的差异会影响您设计和构建应用程序的方式。

source: <strong>IndexedDB uses DOM events to notify you when results are available.</strong> DOM events always have a <code>type</code> property (in IndexedDB, it is most commonly set to <code>"success"</code> or <code>"error"</code>). DOM events also have a <code>target</code> property that indicates where the event is headed. In most cases, the <code>target</code> of an event is the <code>IDBRequest</code> object that was generated as a result of doing some database operation. Success events don't bubble up and they can't be canceled. Error events, on the other hand, do bubble, and can be cancelled. This is quite important, as error events abort whatever transactions they're running in, unless they are cancelled.
es: <strong>IndexedDB utiliza eventos DOM para notificarle cuando los resultados est&aacute;n disponibles.</strong> Los eventos DOM siempre tienen una propiedad de <code>type</code> (en IndexedDB, generalmente se establece en <code>"success"</code> o <code>"error"</code> ). Los eventos DOM tambi&eacute;n tienen una propiedad de <code>target</code> que indica hacia d&oacute;nde se dirige el evento. En la mayor&iacute;a de los casos, el <code>target</code> de un evento es el objeto <code>IDBRequest</code> que se gener&oacute; como resultado de realizar alguna operaci&oacute;n de la base de datos. Los eventos de &eacute;xito no surgen y no se pueden cancelar. Los eventos de error, por otro lado, hacen burbujas y pueden cancelarse. Esto es bastante importante, ya que los eventos de error cancelan cualquier transacci&oacute;n en la que se est&eacute;n ejecutando, a menos que se cancelen.
ko: <strong>IndexedDB는 DOM 이벤트를 사용하여 결과가 제공 될 때 알려줍니다.</strong> DOM 이벤트에는 항상 <code>type</code> 속성이 있습니다 (IndexedDB에서 가장 일반적으로 <code>"success"</code> 또는 <code>"error"</code> 로 설정 됨 ). DOM 이벤트 에는 이벤트가 진행되는 위치를 나타내는 <code>target</code> 속성 도 있습니다 . 대부분의 경우 이벤트 <code>target</code> 은 일부 데이터베이스 작업을 수행 한 결과 생성 된 <code>IDBRequest</code> 객체입니다. 성공 이벤트는 버블 링되지 않으며 취소 할 수 없습니다. 반면에 오류 이벤트는 거품을 일으켜 취소 할 수 있습니다. 오류 이벤트는 취소되지 않는 한 실행중인 트랜잭션을 중단하므로 매우 중요합니다.
ru: <strong>IndexedDB использует события DOM, чтобы уведомлять вас, когда результаты доступны.</strong> События DOM всегда имеют свойство <code>type</code> (в IndexedDB чаще всего оно установлено как <code>"success"</code> или <code>"error"</code> ). События DOM также имеют <code>target</code> свойство, которое указывает, куда направляется событие. В большинстве случаев <code>target</code> события является объект <code>IDBRequest</code> , который был создан в результате выполнения какой-либо операции с базой данных. События успеха не всплывают и не могут быть отменены. События ошибок, с другой стороны, вызывают пузыри и могут быть отменены. Это очень важно, поскольку события ошибок отменяют любые транзакции, в которых они выполняются, если они не отменены.
zh_cn: <strong>IndexedDB使用DOM事件在结果可用时通知您。</strong> DOM事件始终具有 <code>type</code> 属性（在IndexedDB中，通常将其设置为 <code>"success"</code> 或 <code>"error"</code> ）。 DOM事件还具有 <code>target</code> 属性，该属性指示事件的去向。在大多数情况下，事件的 <code>target</code> 是 <code>IDBRequest</code> 对象，该对象是由于执行某些数据库操作而生成的。成功事件不会冒泡，也无法取消。另一方面，错误事件会冒泡，可以取消。这非常重要，因为错误事件将中止它们正在运行的任何事务，除非它们被取消。

source: <strong>IndexedDB uses a lot of requests. </strong>Requests are objects that receive the success or failure DOM events that were mentioned previously. They have <code>onsuccess</code> and <code>onerror</code> properties, and you can call <code>addEventListener()</code> and <code>removeEventListener()</code> on them. They also have <code>readyState</code>, <code>result</code>, and <code>errorCode</code> properties that tell you the status of the request. The <code>result</code> property is particularly magical, as it can be many different things, depending on how the request was generated (for example, an <code>IDBCursor</code> instance, or the key for a value that you just inserted into the database).
es: <strong>IndexedDB usa muchas solicitudes.</strong> Las solicitudes son objetos que reciben los eventos DOM exitosos o fallidos que se mencionaron anteriormente. Tienen propiedades de <code>onsuccess</code> y <code>onerror</code> , y puede llamar a <code>addEventListener()</code> y <code>removeEventListener()</code> en ellas. Tambi&eacute;n tienen <code>readyState</code> , <code>result</code> y <code>errorCode</code> que le indican el estado de la solicitud. La propiedad del <code>result</code> ado es particularmente m&aacute;gica, ya que puede ser muchas cosas diferentes, dependiendo de c&oacute;mo se gener&oacute; la solicitud (por ejemplo, una instancia de <code>IDBCursor</code> o la clave para un valor que acaba de insertar en la base de datos).
ko: <strong>IndexedDB는 많은 요청을 사용합니다.</strong> 요청은 앞에서 언급 한 성공 또는 실패 DOM 이벤트를 수신하는 오브젝트입니다. 그들은이 <code>onsuccess</code> 는 과 <code>onerror</code> 속성을, 당신은 호출 할 수 있습니다 <code>addEventListener()</code> 와 <code>removeEventListener()</code> 그들. 또한 요청 상태를 알려주 는 <code>readyState</code> , <code>result</code> 및 <code>errorCode</code> 속성이 있습니다. <code>result</code> 가 요청이 생성 된 방법에 따라 많은 다른 것들을 할 수있는 속성, 특히 마법이다 (예를 들어, <code>IDBCursor</code> 의 예를, 아니면 그냥 데이터베이스에 삽입하는 값의 키).
ru: <strong>IndexedDB использует много запросов.</strong> Запросы - это объекты, которые получают события DOM об успехе или сбое, которые были упомянуты ранее. У них есть свойства <code>onsuccess</code> и <code>onerror</code> , и вы можете вызывать <code>addEventListener()</code> и <code>removeEventListener()</code> для них. Они также имеют <code>readyState</code> , <code>result</code> и <code>errorCode</code> , которые сообщают вам о состоянии запроса. Свойство <code>result</code> особенно волшебно, так как это может быть много разных вещей, в зависимости от того, как был сгенерирован запрос (например, экземпляр <code>IDBCursor</code> или ключ для значения, которое вы только что вставили в базу данных).
zh_cn: <strong>IndexedDB使用大量请求。</strong>请求是接收前面提到的成功或失败DOM事件的对象。它们具有 <code>onsuccess</code> 和 <code>onerror</code> 属性，您可以在它们上调用 <code>addEventListener()</code> 和 <code>removeEventListener()</code> 。它们还具有 <code>readyState</code> ， <code>result</code> 和 <code>errorCode</code> 属性，它们可以告诉您请求的状态。的 <code>result</code> 特性尤其神奇，因为它可以是许多不同的事情，这取决于如何生成该请求（例如，一个 <code>IDBCursor</code> 实例或您刚刚插入到数据库中的值的键）。

source: <strong>IndexedDB</strong> is a way for you to persistently store data inside a user's browser. Because it lets you create web applications with rich query abilities regardless of network availability, these applications can work both online and offline. IndexedDB is useful for applications that store a large amount of data (for example, a catalog of DVDs in a lending library) and applications that don't need persistent internet connectivity to work (for example, mail clients, to-do lists, and notepads).
es: <strong>IndexedDB</strong> es una forma de almacenar datos de forma persistente dentro del navegador de un usuario. Debido a que le permite crear aplicaciones web con capacidades de consulta enriquecidas independientemente de la disponibilidad de la red, estas aplicaciones pueden funcionar tanto en l&iacute;nea como fuera de l&iacute;nea. IndexedDB es &uacute;til para aplicaciones que almacenan una gran cantidad de datos (por ejemplo, un cat&aacute;logo de DVD en una biblioteca de pr&eacute;stamos) y aplicaciones que no necesitan conectividad persistente a Internet para funcionar (por ejemplo, clientes de correo, listas de tareas pendientes y blocs de notas).
ko: <strong>IndexedDB</strong> 는 사용자의 브라우저에 데이터를 지속적으로 저장하는 방법입니다. 네트워크 가용성에 관계없이 풍부한 쿼리 기능을 갖춘 웹 응용 프로그램을 만들 수 있으므로 이러한 응용 프로그램은 온라인과 오프라인 모두에서 작동 할 수 있습니다. IndexedDB는 대량의 데이터를 저장하는 응용 프로그램 (예 : 대출 라이브러리의 DVD 카탈로그) 및 인터넷 연결이 필요하지 않은 응용 프로그램 (예 : 메일 클라이언트, 작업 목록 및 메모장).
ru: <strong>IndexedDB</strong> - это способ постоянного хранения данных в браузере пользователя. Поскольку он позволяет создавать веб-приложения с широкими возможностями запросов независимо от доступности сети, эти приложения могут работать как в сети, так и в автономном режиме. IndexedDB полезен для приложений, которые хранят большой объем данных (например, каталог DVD-дисков в кредитной библиотеке), и для приложений, которым не требуется постоянное подключение к Интернету для работы (например, почтовые клиенты, списки дел и блокноты).
zh_cn: <strong>IndexedDB</strong>是一种将数据持久存储在用户浏览器中的方法。因为它使您可以创建具有丰富查询功能的Web应用程序，而不管网络是否可用，所以这些应用程序可以联机和脱机运行。IndexedDB对于存储大量数据的应用程序（例如，借阅库中的DVD目录）和不需要持久的Internet连接即可工作的应用程序（例如，邮件客户端，任务列表和记事本）。

source: <strong>Internet Explorer - pre v9</strong>
ko: <strong>Internet Explorer-v9 이전</strong>
ru: <strong>Internet Explorer - до v9</strong>

source: <strong>Internet Explorer has been modified to not turn off the status bar for any windows. The status bar is always visible for all Internet Explorer windows.</strong> (...) Without this change, windows that are created using the window.open() method can be called by scripts and spoof a user interface or desktop or hide malicious information or activity by hiding important elements of the user interface from the user.
ru: <strong>Internet Explorer был изменен, чтобы не отключать строку состояния для каких-либо окон. Строка состояния всегда видна для всех окон Internet Explorer. </strong>(...) Без этого изменения окна, созданные с помощью метода window.open (), могут вызываться сценариями и подделывать пользовательский интерфейс или рабочий стол или скрывать вредоносную информацию или действия, скрывая важные элементы пользовательского интерфейса от пользователя. ,
zh_cn: <strong>Internet Explorer已修改为不关闭任何窗口的状态栏。状态栏对于所有Internet Explorer窗口始终可见。</strong>（...）如果不进行此更改，使用window.open（）方法创建的窗口可以被脚本调用并欺骗用户界面或桌面，或者通过向用户隐藏用户界面的重要元素来隐藏恶意信息或活动。 。

source: <strong>Italics tag</strong> (<code>&lt;i&gt;&lt;/i&gt;</code>)
ru: <strong>Тег курсива</strong> ( <code>&lt;i&gt;&lt;/i&gt;</code> )
zh_cn: <strong>斜体标签</strong>（ <code>&lt;i&gt;&lt;/i&gt;</code> ）
