Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/dom/dom.*.011.xlf
Languages: ja, ko, ru, zh_cn

source: Added the initial definition of its properties to the <code>ElementTraversal</code> pure interface and use it on <a href="element"><code>Element</code></a>.
ja: <code>ElementTraversal</code> ピュアインターフェースにそのプロパティの初期定義を追加し、それを<a href="element"> <code>Element</code> で</a>使用します。
ko: 속성의 초기 정의를 <code>ElementTraversal</code> 순수 인터페이스에 추가하고 <a href="element"> <code>Element</code> 에서</a> 사용하십시오 .
ru: Добавил первоначальное определение его свойств в чистый интерфейс <code>ElementTraversal</code> и использовал его в <a href="element"> <code>Element</code> </a> .
zh_cn: 将其属性的初始定义添加到 <code>ElementTraversal</code> 纯接口中，并在<a href="element"> <code>Element</code> </a>上使用它。

source: Added the initial definition of its properties to the <code>ElementTraversal</code> pure interface and used it on <a href="element"><code>Element</code></a>.
ja: <code>ElementTraversal</code> ピュアインターフェイスにそのプロパティの初期定義を追加し、<a href="element"> <code>Element</code> で</a>使用しました。
ko: 속성의 초기 정의를 <code>ElementTraversal</code> 순수 인터페이스에 추가하고 <a href="element"> <code>Element</code> 에서</a> 사용했습니다 .
ru: Добавил первоначальное определение его свойств в чистый интерфейс <code>ElementTraversal</code> и использовал его в <a href="element"> <code>Element</code> </a> .
zh_cn: 在 <code>ElementTraversal</code> 纯接口中添加了其属性的初始定义，并在<a href="element"> <code>Element</code> </a>上使用了它。

source: Added the method <code>createContextualFragment()</code>.
ja: メソッド <code>createContextualFragment()</code> が追加されました。
ko: <code>createContextualFragment()</code> 메소드를 추가했습니다 .
ru: Добавлен метод <code>createContextualFragment()</code> .
zh_cn: 添加了方法 <code>createContextualFragment()</code> 。

source: Added the methods <code>getClientRects()</code> and <code>getBoundingClientRect()</code>.
ja: メソッド <code>getClientRects()</code> および <code>getBoundingClientRect()</code> が追加されました。
ko: <code>getClientRects()</code> 및 <code>getBoundingClientRect()</code> 메소드를 추가했습니다 .
ru: Добавлены методы <code>getClientRects()</code> и <code>getBoundingClientRect()</code> .
zh_cn: 添加了方法 <code>getClientRects()</code> 和 <code>getBoundingClientRect()</code> 。

source: Added the methods <code>isPointInRange()</code>, <code>comparePoint()</code>, and <code>intersectsNode()</code>.
ja: メソッド <code>isPointInRange()</code> 、 <code>comparePoint()</code> 、および <code>intersectsNode()</code> が追加されました。
ko: <code>isPointInRange()</code> , <code>comparePoint()</code> 및 <code>intersectsNode()</code> 메소드가 추가되었습니다 .
ru: Добавлены методы <code>isPointInRange()</code> , <code>comparePoint()</code> и <code>intersectsNode()</code> .
zh_cn: 添加了方法 <code>isPointInRange()</code> ， <code>comparePoint()</code> 和 <code>intersectsNode()</code> 。

source: Added the static methods <code>URL.createObjectURL()</code> and <code>URL.revokeObjectURL</code><code>()</code>.
ja: 静的メソッド <code>URL.createObjectURL()</code> および <code>URL.revokeObjectURL</code> <code>()</code> が追加されました。
ko: 정적 메소드 추가 <code>URL.createObjectURL()</code> 및 <code>URL.revokeObjectURL</code> <code>()</code> 을 .
ru: Добавлены статические методы <code>URL.createObjectURL()</code> и <code>URL.revokeObjectURL</code> <code>()</code> .
zh_cn: 添加了静态方法 <code>URL.createObjectURL()</code> 和 <code>URL.revokeObjectURL</code> <code>()</code> 。

source: Added value <code>COUNTER_STYLE_RULE</code>.
ja: 値 <code>COUNTER_STYLE_RULE</code> を追加しました。
ko: <code>COUNTER_STYLE_RULE</code> 값을 추가했습니다 .
ru: Добавленная стоимость <code>COUNTER_STYLE_RULE</code> .
zh_cn: 增值 <code>COUNTER_STYLE_RULE</code> 。

source: Added value <code>FONT_FEATURE_VALUES_RULE</code>.
ja: 値 <code>FONT_FEATURE_VALUES_RULE</code> を追加しました。
ko: <code>FONT_FEATURE_VALUES_RULE</code> 값이 추가되었습니다 .
ru: Добавленное значение <code>FONT_FEATURE_VALUES_RULE</code> .
zh_cn: 附加值 <code>FONT_FEATURE_VALUES_RULE</code> 。

source: Added value <code>SUPPORTS_RULE</code>. (<code>DOCUMENT_RULE</code> has been pushed to CSS Conditional Rules Level 4)
ja: 値 <code>SUPPORTS_RULE</code> が追加されました。（ <code>DOCUMENT_RULE</code> がCSS条件付きルールレベル4にプッシュされました）
ko: <code>SUPPORTS_RULE</code> 값을 추가했습니다 . ( <code>DOCUMENT_RULE</code> 이 CSS 조건부 규칙 레벨 4로 푸시되었습니다.)
ru: Добавленная стоимость <code>SUPPORTS_RULE</code> . ( <code>DOCUMENT_RULE</code> переведен на условные правила CSS уровня 4)
zh_cn: 增值 <code>SUPPORTS_RULE</code> 。（ <code>DOCUMENT_RULE</code> 已被推送到CSS条件规则第4级）

source: Added values <code>KEYFRAMES_RULE</code> and <code>KEYFRAME_RULE</code>.
ja: 値 <code>KEYFRAMES_RULE</code> および <code>KEYFRAME_RULE</code> が追加されました。
ko: <code>KEYFRAMES_RULE</code> 및 <code>KEYFRAME_RULE</code> 값이 추가되었습니다 .
ru: Добавлены значения <code>KEYFRAMES_RULE</code> и <code>KEYFRAME_RULE</code> .
zh_cn: 添加了值 <code>KEYFRAMES_RULE</code> 和 <code>KEYFRAME_RULE</code> 。

source: Adding 2D content to a WebGL context
ja: WebGL コンテキストに 2D コンテンツを追加する
ko: WebGL 컨텍스트에 2D 컨텐츠 추가
ru: Добавление 2D контента в контекст WebGL
zh_cn: 在WebGL上下文中添加2D内容

source: Adding <em>gestures</em> to an application can significantly improve the user experience. There are many types of gestures, from the simple single-touch <em>swipe</em> gesture to the more complex multi-touch <em>twist</em> gesture, where the touch points (aka <em>pointers</em>) move in different directions.
ja: アプリケーションに<em>ジェスチャー</em>を追加すると、ユーザーエクスペリエンスが大幅に向上します。ジェスチャーには、シンプルなシングルタッチ<em>スワイプ</em>ジェスチャーから、タッチポイント（別名<em>ポインター</em>）がさまざまな方向に移動するより複雑なマルチタッチ<em>ツイスト</em>ジェスチャーまで、さまざまな種類があります。<em></em>
ko: 응용 프로그램에 <em>제스처</em> 를 추가 하면 사용자 경험이 크게 향상 될 수 있습니다. 간단한 단일 터치 <em>스 와이프</em> 제스처 에서 터치 포인트 (일명 <em>포인터</em> )가 다른 방향으로 움직이는 복잡한 멀티 터치 <em>트위스트</em> 제스처에 이르기까지 다양한 유형의 제스처가 있습니다 .<em></em>
ru: Добавление <em>жестов</em> в приложение может значительно улучшить взаимодействие с пользователем. Есть много типов жестов, от простого одного касания <em>салфетки</em> жеста к более сложному мульти-сенсорного <em>поворотное</em> движению, где точки соприкосновения (ака <em>указатели</em> ) двигаться в различных направлениях.
zh_cn: 向应用程序添加<em>手势</em>可以显着改善用户体验。手势的类型很多，从简单的单点触摸<em>滑动</em>手势到更复杂的多点触摸<em>扭曲</em>手势，触摸点（又称为<em>指针</em>）在不同方向上移动。

source: Adding a biquad filter to the mix
ja: バイクワッドフィルターを加えて
ko: 믹스에 바이 쿼드 필터 추가
ru: Добавление в смесь фильтра биаквадного типа
zh_cn: 在组合中添加一个双向过滤器。

source: Adding a listener during event dispatch
ja: イベントディスパッチ中にリスナーを追加する
ko: 이벤트 디스패치 중 리스너 추가
ru: Добавление слушателя во время отправки событий
zh_cn: 在事件派遣过程中添加一个监听器

source: Adding an offset to depth values of polygon's fragments. See <a href="polygonoffset"><code>WebGLRenderingContext.polygonOffset()</code></a>.
ja: ポリゴンのフラグメントの深度値にオフセットを追加します。<a href="polygonoffset"> <code>WebGLRenderingContext.polygonOffset()</code> を</a>参照してください。
ko: 다각형 조각의 깊이 값에 오프셋을 추가합니다. <a href="polygonoffset"> <code>WebGLRenderingContext.polygonOffset()</code> </a> 참조하십시오 .
ru: Добавление смещения к значениям глубины фрагментов полигона. Смотрите <a href="polygonoffset"> <code>WebGLRenderingContext.polygonOffset()</code> </a> .
zh_cn: 向多边形片段的深度值添加偏移量。请参见<a href="polygonoffset"> <code>WebGLRenderingContext.polygonOffset()</code> </a>。

source: Adding and modifying history entries
ja: 履歴エントリの追加と修正
ko: 히스토리 항목 추가 및 수정
ru: Добавление и изменение записей истории
zh_cn: 添加和修改历史条目

source: Adding candidates to the caller
ja: 発信者に候補を追加する
ko: 발신자에게 후보자 추가
ru: Добавление кандидатов к вызывающему абоненту
zh_cn: 将候选人添加到呼叫器中

source: Adding candidates to the receiver
ja: 受信機への候補の追加
ko: 수신자에 후보 추가
ru: Добавление кандидатов к получателю
zh_cn: 将候选人添加到接收方中

source: Adding data to the database
ja: データベースへのデータの追加
ko: 데이터베이스에 데이터 추가
ru: Добавление данных в базу данных
zh_cn: 将数据添加到数据库中

source: Adding media to the receiver
ja: 受信機にメディアを追加する
ko: 수신기에 미디어 추가
ru: Добавление носителя к ресиверу
zh_cn: 将媒体添加到接收器中

source: Adding mouse control
ja: マウスコントロールの追加
ko: 마우스 컨트롤 추가
ru: Добавление управления мышью
zh_cn: 增加鼠标控制

source: Adding stereo panning to our app
ja: アプリにステレオパンニングを追加
ko: 앱에 스테레오 패닝 추가
ru: Добавление стерео панорамирования в наше приложение
zh_cn: 在我们的应用程序中添加立体声平移

source: Adding text to the log
ja: ログにテキストを追加する
ko: 로그에 텍스트 추가
ru: Добавление текста в журнал
zh_cn: 在日志中添加文本

source: Adding the audio to the connection
ja: 接続に音声を追加する
ko: 연결에 오디오 추가
ru: Добавление звука к соединению
zh_cn: 将音频添加到连接中

source: Adding timestamps to the Waterfall
ja: ウォーターフォールにタイムスタンプを追加する
ko: 폭포에 타임 스탬프 추가
ru: Добавление временных меток к водопаду
zh_cn: 在瀑布中添加时间戳

source: Adding velocity
ja: 速度の追加
ko: 속도 추가
ru: Скорость добавления
zh_cn: 加速度

source: Adding, retrieving, and removing data
ja: データの追加、取得、削除
ko: 데이터 추가, 검색 및 제거
ru: Добавление,извлечение и удаление данных
zh_cn: 添加、检索和删除数据。

source: Additional constants defined WebGL 2
ja: WebGL 2で定義された追加の定数
ko: 추가 상수 정의 WebGL 2
ru: Дополнительные константы определены WebGL 2
zh_cn: 定义的其他常量 WebGL 2

source: Additional examples can be found at <a href="https://developer.mozilla.org/en-US/docs/Web/Guide/Events/Creating_and_triggering_events">Creating and triggering events</a>.
ja: その他の例については<a href="https://developer.mozilla.org/en-US/docs/Web/Guide/Events/Creating_and_triggering_events">、イベントの作成とトリガーをご覧ください</a>。
ko: 추가 예제는 <a href="https://developer.mozilla.org/en-US/docs/Web/Guide/Events/Creating_and_triggering_events">이벤트 작성 및 트리거</a> 에서 찾을 수 있습니다 .
ru: Дополнительные примеры можно найти в <a href="https://developer.mozilla.org/en-US/docs/Web/Guide/Events/Creating_and_triggering_events">разделе Создание и запуск событий</a> .
zh_cn: 在<a href="https://developer.mozilla.org/en-US/docs/Web/Guide/Events/Creating_and_triggering_events">创建和触发事件中</a>可以找到其他示例。

source: Additional methods for Mozilla chrome code
ja: Mozilla chrome コードのための追加メソッド
ko: Mozilla 크롬 코드의 추가 방법
ru: Дополнительные методы для хромированного кода Mozilla
zh_cn: Mozilla chrome代码的附加方法

source: Additional parameters which are passed through to the function specified by <em>func</em> once the timer expires.
ja: タイマーが切れると、<em>func</em>によって指定された関数に渡される追加のパラメーター。
ko: 타이머가 만료되면 <em>func에</em> 의해 지정된 함수로 전달되는 추가 매개 변수입니다 .
ru: Дополнительные параметры, которые передаются в функцию, указанную <em>func,</em> после истечения таймера.
zh_cn: 计时器到期后，将传递给<em>func</em>指定的<em>功能的</em>其他参数。

source: Additional parameters which are passed through to the function specified by <em>function </em>or<em> code</em> once the timer expires.
ja: タイマーが切れると、<em>関数</em>または<em>コードで</em>指定された関数に渡される追加のパラメーター。
ko: 타이머가 만료되면 <em>함수</em> 또는 <em>코드로</em> 지정된 함수로 전달되는 추가 매개 변수입니다 .
ru: Дополнительные параметры, которые передаются в функцию, указанную <em>функцией</em> или <em>кодом,</em> после истечения таймера.
zh_cn: 计时器到期后，将传递给<em>功能</em>或<em>代码</em>指定的<em>功能的</em>其他参数。

source: Additional pixel storage parameters that aren't specified in OpenGL.
ja: OpenGLで指定されていない追加のピクセルストレージパラメータ。
ko: OpenGL에 지정되지 않은 추가 픽셀 저장 매개 변수.
ru: Дополнительные параметры хранения пикселей,не указанные в OpenGL.
zh_cn: OpenGL中未指定的额外像素存储参数。

source: Additional properties for isolated track support
ja: 孤立したトラックサポートのための追加プロパティ
ko: 고립 된 트랙 지원을위한 추가 속성
ru: Дополнительные свойства для поддержки изолированных путей
zh_cn: 孤立轨道支持的附加属性

source: Additional tips
ja: その他のヒント
ko: 추가 팁
ru: Дополнительные рекомендации
zh_cn: 其他提示

source: Additionally available in WebGL 2
ja: WebGL 2でも利用可能
ko: WebGL 2에서 추가로 사용 가능
ru: Дополнительно доступно в WebGL 2
zh_cn: 另外在WebGL 2中也可使用

source: Additionally available when using a WebGL 2 context
ja: WebGL 2 コンテキストを使用している場合にも利用可能
ko: WebGL 2 컨텍스트를 사용할 때 추가로 사용 가능
ru: Дополнительно доступно при использовании контекста WebGL 2
zh_cn: 当使用WebGL 2上下文时还可使用

source: Additionally available when using the <a href="../ext_texture_filter_anisotropic"><code>EXT_texture_filter_anisotropic</code></a> extension
ja: さらに、<a href="../ext_texture_filter_anisotropic"> <code>EXT_texture_filter_anisotropic</code> </a>エクステンションを使用するときにも利用可能
ko: <a href="../ext_texture_filter_anisotropic"> <code>EXT_texture_filter_anisotropic</code> </a> 확장 사용시 추가로 사용 가능
ru: Дополнительно доступно при использовании расширения <a href="../ext_texture_filter_anisotropic"> <code>EXT_texture_filter_anisotropic</code> </a>
zh_cn: 使用<a href="../ext_texture_filter_anisotropic"> <code>EXT_texture_filter_anisotropic</code> </a>扩展名时附加可用

source: Additionally, (not shown) the position and scale matrices of the model have been changed to take it out of clip space and into the larger coordinate system.
ja: さらに(図示せず)、モデルの位置とスケールマトリックスが変更され、クリップ空間からより大きな座標系へと移動しました。
ko: 또한 (표시되지 않음) 모델의 위치 및 축척 행렬이 클립 공간에서 더 큰 좌표계로 가져 오도록 변경되었습니다.
ru: Кроме того,(не показаны)матрицы положения и масштаба модели были изменены,чтобы вывести ее из пространства клипов и перенести в большую систему координат.
zh_cn: 此外,(未显示)模型的位置和比例矩阵已被改变,使其脱离剪辑空间,进入更大的坐标系。

source: Additionally, ArrayBuffer send and receive support for binary data has been implemented.
ja: さらに、バイナリデータのためのArrayBuffer送受信サポートが実装されました。
ko: 또한 이진 데이터에 대한 ArrayBuffer 송수신 지원이 구현되었습니다.
ru: Кроме того,была реализована поддержка отправки и получения двоичных данных с помощью ArrayBuffer.
zh_cn: 此外,还实现了ArrayBuffer对二进制数据的发送和接收支持。

source: Additionally, for uniforms declared as arrays, the following names are also valid:
ja: さらに、配列として宣言された制服については、以下の名前も有効です。
ko: 또한 배열로 선언 된 유니폼의 경우 다음 이름도 유효합니다.
ru: Кроме того,для униформ,заявленных в качестве массивов,действительны также следующие имена:
zh_cn: 此外,对于以数组形式声明的制服,以下名称也有效。

source: Additionally, indexes have the ability to enforce simple constraints on the stored data. By setting the unique flag when creating the index, the index ensures that no two objects are stored with both having the same value for the index's key path. So, for example, if you have an object store which holds a set of people, and you want to ensure that no two people have the same email address, you can use an index with the unique flag set to enforce this.
ja: さらに、インデックスは、格納されたデータに単純な制約を強制する機能を持っています。インデックスを作成する際にユニークフラグを設定することで、インデックスのキーパスに同じ値を持つオブジェクトが2つとも保存されないようにします。ですから、例えば、人のセットを保持しているオブジェクトストアがあり、二人の人が同じメールアドレスを持っていないことを保証したい場合、ユニークフラグを設定したインデックスを使用してこれを強制することができます。
ko: 또한 인덱스는 저장된 데이터에 간단한 제약 조건을 적용 할 수 있습니다. 인덱스를 작성할 때 고유 플래그를 설정하면 인덱스의 키 경로에 대해 동일한 값을 갖는 두 개의 오브젝트가 저장되지 않습니다. 예를 들어 일련의 사람을 보유한 객체 저장소가 있고 두 사람이 동일한 전자 메일 주소를 가지지 않도록하려면 고유 플래그가 설정된 인덱스를 사용하여이를 시행 할 수 있습니다.
ru: Кроме того,индексы имеют возможность применять простые ограничения к хранимым данным.Устанавливая уникальный флаг при создании индекса,индекс гарантирует,что не будет храниться два объекта,оба из которых имеют одинаковое значение для пути к ключу индекса.Так,например,если у вас есть хранилище объектов,содержащее набор людей,и вы хотите быть уверенными,что никакие два человека не имеют одинаковых адресов электронной почты,вы можете использовать индекс с уникальным флагом,установленным для этого.
zh_cn: 此外,索引还能够对存储的数据实施简单的约束。通过在创建索引时设置唯一标志,索引可以确保没有两个对象在存储时都具有相同的索引键路径值。因此,举例来说,如果你有一个对象存储,其中存储了一组人,而你想确保没有两个人拥有相同的电子邮件地址,你可以使用设置了唯一标志的索引来强制执行。

source: Additionally, of course, the Feature Policy <code>"fullscreen"</code> permission must be granted.
ja: さらに、もちろん、機能ポリシーの <code>"fullscreen"</code> 権限が付与されている必要があります。
ko: 또한 기능 정책 <code>"fullscreen"</code> 권한이 부여되어야합니다.
ru: Кроме того, конечно, должно быть предоставлено разрешение для <code>"fullscreen"</code> политики .
zh_cn: 另外，当然，必须授予功能策略 <code>"fullscreen"</code> 权限。

source: Additionally, synchronous requests are not allowed from within a service worker &mdash; only asynchronous requests, like those initiated via the <a href="https://developer.mozilla.org/en-US/docs/Web/API/GlobalFetch/fetch"><code>fetch()</code></a> method, can be used.
ja: また、Service Worker内からの同期リクエストは許可されていません。使用できるのは、<a href="https://developer.mozilla.org/en-US/docs/Web/API/GlobalFetch/fetch"> <code>fetch()</code> </a>メソッドを介して開始されるような非同期リクエストのみです。
ko: 또한 동기 요청은 서비스 워커 내에서 허용되지 않습니다. <a href="https://developer.mozilla.org/en-US/docs/Web/API/GlobalFetch/fetch"> <code>fetch()</code> </a> 메소드 를 통해 시작된 것과 같은 비동기 요청 만 사용할 수 있습니다.
ru: Кроме того, синхронные запросы не разрешены изнутри работника службы - могут использоваться только асинхронные запросы, подобные тем, которые инициированы методом <a href="https://developer.mozilla.org/en-US/docs/Web/API/GlobalFetch/fetch"> <code>fetch()</code> </a> .
zh_cn: 另外，服务工作者内部不允许同步请求-只能使用异步请求，例如通过<a href="https://developer.mozilla.org/en-US/docs/Web/API/GlobalFetch/fetch"> <code>fetch()</code> </a>方法启动的异步请求。

source: Additionally, the <code><a href="https://developer.mozilla.org/en-US/docs/Web/SVG/Attribute/points">points</a></code> attribute on the original element accessed via the XML DOM (e.g., using the <code>getAttribute()</code> method call) will reflect any changes made to the <code>SVGAnimatedPoints.points</code> attribut.
ja: さらに、XML DOMを介して（たとえば、 <code>getAttribute()</code> メソッド呼び出しを使用して）アクセスされた元の要素の <code><a href="https://developer.mozilla.org/en-US/docs/Web/SVG/Attribute/points">points</a></code> 属性は、 <code>SVGAnimatedPoints.points</code> 属性に加えられた変更を反映します。
ko: 또한, <code><a href="https://developer.mozilla.org/en-US/docs/Web/SVG/Attribute/points">points</a></code> (하여, 예를 들면 XML에 DOM 통해 액세스 원래 요소 특성 <code>getAttribute()</code> 받는 변경 사항 반영 메소드 호출) <code>SVGAnimatedPoints.points</code> attribut한다.
ru: Кроме того, атрибут <code><a href="https://developer.mozilla.org/en-US/docs/Web/SVG/Attribute/points">points</a></code> исходного элемента, доступ к которому осуществляется через XML DOM (например, с помощью <code>getAttribute()</code> метода getAttribute () ), будет отражать любые изменения, внесенные в атрибут <code>SVGAnimatedPoints.points</code> .
zh_cn: 另外，通过XML DOM访问的原始元素上的 <code><a href="https://developer.mozilla.org/en-US/docs/Web/SVG/Attribute/points">points</a></code> 属性（例如，使用 <code>getAttribute()</code> 方法调用）将反映对 <code>SVGAnimatedPoints.points</code> 属性所做的任何更改。

source: Additionally, the <code>scrollPathIntoView()</code> method can be used to make an element visible on the screen if focused, for example.
ja: さらに、 <code>scrollPathIntoView()</code> メソッドを使用すると、フォーカスされている場合に要素を画面に表示できます。
ko: 또한 <code>scrollPathIntoView()</code> 메서드를 사용하면 예를 들어 초점이 맞춰진 경우 화면에 요소를 표시 할 수 있습니다.
ru: Кроме того, метод <code>scrollPathIntoView()</code> может использоваться, чтобы сделать элемент видимым на экране, если он сфокусирован, например.
zh_cn: 另外，例如，如果聚焦， <code>scrollPathIntoView()</code> 方法可用于使元素在屏幕上可见。

source: Additionally, the server can decide on extension/subprotocol requests here; see <a href="#Miscellaneous">Miscellaneous</a> for details. The <code>Sec-WebSocket-Accept</code> part is interesting. The server must derive it from the <code>Sec-WebSocket-Key</code> that the client sent. To get it, concatenate the client's <code>Sec-WebSocket-Key</code> and "<code>258EAFA5-E914-47DA-95CA-C5AB0DC85B11</code>" together (it's a "<a href="https://en.wikipedia.org/wiki/Magic_string">magic string</a>"), take the <a href="https://en.wikipedia.org/wiki/SHA-1">SHA-1 hash</a> of the result, and return the <a href="https://en.wikipedia.org/wiki/Base64">base64</a> encoding of the hash.
ja: さらに、サーバーは拡張/サブプロトコル要求をここで決定できます。詳細については、<a href="#Miscellaneous">その他</a>を参照してください。 <code>Sec-WebSocket-Accept</code> 部分が面白いです。サーバーは、クライアントが送信した <code>Sec-WebSocket-Key</code> からそれを派生させる必要があります。それを取得するには、クライアントの <code>Sec-WebSocket-Key</code> と「 <code>258EAFA5-E914-47DA-95CA-C5AB0DC85B11</code> 」を連結し（「<a href="https://en.wikipedia.org/wiki/Magic_string">マジックストリング</a>」です）、結果の<a href="https://en.wikipedia.org/wiki/SHA-1">SHA-1ハッシュ</a>を取得し、<a href="https://en.wikipedia.org/wiki/Base64">base64</a>エンコーディングを返しますハッシュ。
ko: 또한 서버는 여기서 확장 / 서브 프로토콜 요청을 결정할 수 있습니다. 자세한 내용은 <a href="#Miscellaneous">기타</a> 를 참조하십시오. <code>Sec-WebSocket-Accept</code> 부분은 흥미 롭다. 서버는 클라이언트가 보낸 <code>Sec-WebSocket-Key</code> 에서 서버를 가져와야합니다 . 이를 얻으려면 클라이언트의 <code>Sec-WebSocket-Key</code> 와 " <code>258EAFA5-E914-47DA-95CA-C5AB0DC85B11</code> "을 연결하고 ( " <a href="https://en.wikipedia.org/wiki/Magic_string">마법 문자열</a> ") 결과 의 <a href="https://en.wikipedia.org/wiki/SHA-1">SHA-1 해시</a> 를 가져 와서 <a href="https://en.wikipedia.org/wiki/Base64">base64</a> 인코딩을 반환하십시오. 해시.
ru: Кроме того, сервер может принять решение о расширении / подпротоколе запросов здесь; см. <a href="#Miscellaneous">Разное</a> для деталей. Часть <code>Sec-WebSocket-Accept</code> интересна. Сервер должен получить его из <code>Sec-WebSocket-Key</code> , который отправил клиент. Чтобы получить его, объедините клиентский <code>Sec-WebSocket-Key</code> и &laquo; <code>258EAFA5-E914-47DA-95CA-C5AB0DC85B11</code> &raquo; вместе (это &laquo; <a href="https://en.wikipedia.org/wiki/Magic_string">волшебная строка</a> &raquo;), возьмите результат <a href="https://en.wikipedia.org/wiki/SHA-1">хэша SHA-1</a> и верните кодировку <a href="https://en.wikipedia.org/wiki/Base64">base64</a> хеш
zh_cn: 另外，服务器可以在此处决定扩展/子协议请求。有关详细信息，请参见<a href="#Miscellaneous">其他</a>。该 <code>Sec-WebSocket-Accept</code> 部分是有趣的。服务器必须从客户端发送的 <code>Sec-WebSocket-Key</code> 派生它。要获得它，请将客户端的 <code>Sec-WebSocket-Key</code> 和&ldquo; <code>258EAFA5-E914-47DA-95CA-C5AB0DC85B11</code> &rdquo;连接在一起（这是一个&ldquo; <a href="https://en.wikipedia.org/wiki/Magic_string">魔术字符串</a> &rdquo;），获取结果的<a href="https://en.wikipedia.org/wiki/SHA-1">SHA-1哈希</a>，然后返回的<a href="https://en.wikipedia.org/wiki/Base64">base64</a>编码哈希。

source: Additionally, this property should update whenever a browser is no longer capable of connecting to the network. According to the specification:
ja: さらに、このプロパティは、ブラウザがネットワークに接続できなくなった場合はいつでも更新する必要があります。仕様によると
ko: 또한이 속성은 브라우저가 더 이상 네트워크에 연결할 수 없을 때마다 업데이트되어야합니다. 사양에 따르면 :
ru: Кроме того,это свойство должно обновляться всякий раз,когда браузер больше не может подключаться к сети.В соответствии со спецификацией:
zh_cn: 此外,每当浏览器不再能够连接到网络时,这个属性就应该更新。根据规范。

source: Additionally, when resetting :
ja: さらに、リセットするときには .
ko: 또한 재설정 할 때 :
ru: Кроме того,при сбросе :
zh_cn: 此外,当重置 。

source: Adds <a href="../federatedcredential"><code>FederatedCredential</code></a> or <a href="../passwordcredential"><code>PasswordCredential</code></a> instance as a possible value for <code>init.credentials</code>.
ja: <a href="../federatedcredential"> <code>FederatedCredential</code> </a>または<a href="../passwordcredential"> <code>PasswordCredential</code> </a>インスタンスを、 <code>init.credentials</code> の可能な値として追加します。
ko: <a href="../federatedcredential"> <code>FederatedCredential</code> </a> 또는 <a href="../passwordcredential"> <code>PasswordCredential</code> </a> 인스턴스를 <code>init.credentials</code> 의 가능한 값으로 추가합니다 .
ru: Добавляет экземпляр <a href="../federatedcredential"> <code>FederatedCredential</code> </a> или <a href="../passwordcredential"> <code>PasswordCredential</code> </a> в качестве возможного значения для <code>init.credentials</code> .
zh_cn: 将<a href="../federatedcredential"> <code>FederatedCredential</code> </a>或<a href="../passwordcredential"> <code>PasswordCredential</code> </a>实例添加为 <code>init.credentials</code> 的可能值。
