Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/dom/dom.*.011.xlf
Languages: ja, ko, ru, zh_cn

source: A promise that resolves with a <a href="../usvstring"><code>USVString</code></a>.
ja: <a href="../usvstring"> <code>USVString</code> </a>で解決されるプロミス。
ko: <a href="../usvstring"> <code>USVString</code> 으로</a> 해결되는 약속 .
ru: Обещание, которое разрешается с помощью <a href="../usvstring"> <code>USVString</code> </a> .
zh_cn: 用<a href="../usvstring"> <code>USVString</code> </a>解析的承诺。

source: A promise that resolves with an <a href="https://developer.mozilla.org/en-US/docs/Web/API/ArrayBuffer"><code>ArrayBuffer</code></a>.
ja: <a href="https://developer.mozilla.org/en-US/docs/Web/API/ArrayBuffer"> <code>ArrayBuffer</code> </a>で解決するpromise 。
ko: <a href="https://developer.mozilla.org/en-US/docs/Web/API/ArrayBuffer"> <code>ArrayBuffer</code> 로</a> 해결되는 약속 .
ru: Обещание, которое разрешается с <a href="https://developer.mozilla.org/en-US/docs/Web/API/ArrayBuffer"> <code>ArrayBuffer</code> </a> .
zh_cn: 用<a href="https://developer.mozilla.org/en-US/docs/Web/API/ArrayBuffer"> <code>ArrayBuffer</code> </a>解析的承诺。

source: A promise that resolves with the result of parsing the body text as JSON. This could be anything that can be represented by JSON &mdash; an object, an array, a string, a number...
ja: 本文をJSONとして解析した結果で解決されるプロミス。これは、JSONで表現できるものであれば何でもかまいません&mdash;オブジェクト、配列、文​​字列、数値...
ko: 본문 텍스트를 JSON으로 구문 분석 한 결과로 해결되는 약속. 이것은 JSON, 객체, 배열, 문자열, 숫자로 나타낼 수있는 모든 것이 될 수 있습니다.
ru: Обещание, которое разрешается в результате анализа основного текста как JSON. Это может быть что угодно, что может быть представлено JSON - объект, массив, строка, число ...
zh_cn: 通过将正文文本解析为JSON的结果来解决的承诺。这可以是可以用JSON表示的任何东西-对象，数组，字符串，数字...

source: A prompt dialog contains a single-line textbox, a Cancel button, and an OK button, and returns the (possibly empty) text the user entered into that textbox.
ja: プロンプトダイアログは、一行テキストボックス、キャンセルボタン、OKボタンを含み、ユーザがテキストボックスに入力した(空の可能性のある)テキストを返します。
ko: 프롬프트 대화 상자에는 한 줄짜리 텍스트 상자, 취소 단추 및 확인 단추가 있으며 사용자가 해당 텍스트 상자에 입력 한 텍스트를 반환합니다 (비어있을 수 있음).
ru: Диалоговое окно запроса содержит однострочное текстовое поле,кнопку Отмена и кнопку ОК,и возвращает (возможно,пустой)текст,введенный пользователем в это текстовое поле.
zh_cn: 一个提示对话框包含一个单行文本框、一个取消按钮和一个确定按钮,并返回用户在该文本框中输入的(可能是空的)文本。

source: A property available on all form elements, "type" returns the type of the calling form element. For SELECT, the two possible values are "<code>select-one</code>" or "<code>select-multiple</code>", depending on the type of selection list. The below code gives all SELECT elements in a particular form a CSS class of "<code>selectclass</code>":
ja: すべてのフォーム要素で使用可能なプロパティである「type」は、呼び出し元のフォーム要素のタイプを返します。SELECTの場合、2つの可能な値は、選択リストのタイプに応じて、「 <code>select-one</code> 」または「 <code>select-multiple</code> 」です。以下のコードは、特定の形式のすべてのSELECT要素に「 <code>selectclass</code> 」のCSSクラスを提供します。
ko: 모든 양식 요소에서 사용 가능한 속성 인 "type"은 호출 양식 요소의 유형을 반환합니다. SELECT 의 경우 선택 목록의 유형에 따라 두 가지 가능한 값은 " <code>select-one</code> "또는 " <code>select-multiple</code> "입니다. 아래 코드는 특정 형식의 모든 SELECT 요소에 " <code>selectclass</code> " 의 CSS 클래스를 제공합니다 .
ru: Свойство, доступное во всех элементах формы, &laquo;тип&raquo; возвращает тип вызывающего элемента формы. Для SELECT двумя возможными значениями являются &laquo; <code>select-one</code> &raquo; или &laquo; <code>select-multiple</code> &raquo;, в зависимости от типа списка выбора. Приведенный ниже код дает всем элементам SELECT в определенной форме CSS-класс &laquo; <code>selectclass</code> &raquo;:
zh_cn: 所有表单元素上都有一个属性，&ldquo;类型&rdquo;返回调用表单元素的类型。对于SELECT，取决于选择列表的类型，两个可能的值是&ldquo; <code>select-one</code> &rdquo;或&ldquo; <code>select-multiple</code> &rdquo;。以下代码以特定形式为CSS类&ldquo; <code>selectclass</code> &rdquo; 提供了所有SELECT元素：

source: A property containing a string representing the human-readable reason why the event is to be fired (see <a href="reason"><code>VRDisplayEvent.reason</code></a>).
ja: イベントが発生する人間が読める理由を表す文字列を含むプロパティ（<a href="reason"> <code>VRDisplayEvent.reason</code> を</a>参照）。
ko: 이벤트가 발생하는 사람이 읽을 수있는 이유를 나타내는 문자열이 포함 된 특성입니다 ( <a href="reason"> <code>VRDisplayEvent.reason</code> </a> 참조 ).
ru: Свойство, содержащее строку, представляющую <a href="reason"> <code>VRDisplayEvent.reason</code> </a> человеку причину возникновения события (см. VRDisplayEvent.reason ).
zh_cn: 一个属性，包含一个字符串，该字符串表示触发事件的人类可读原因（请参阅<a href="reason"> <code>VRDisplayEvent.reason</code> </a>）。

source: A property containing the <a href="../vrdisplay"><code>VRDisplay</code></a> the event is to be associated with.
ja: イベントが関連付けられる<a href="../vrdisplay"> <code>VRDisplay</code> </a>を含むプロパティ。
ko: 이벤트와 관련된 <a href="../vrdisplay"> <code>VRDisplay</code> 를</a> 포함하는 속성 입니다.
ru: Свойство, содержащее <a href="../vrdisplay"> <code>VRDisplay</code> ,</a> с которым должно быть связано событие.
zh_cn: 包含与事件关联的<a href="../vrdisplay"> <code>VRDisplay</code> </a>的属性。

source: A property unique to <code>animate()</code>: a <a href="../domstring"><code>DOMString</code></a> with which to reference the animation.
ja: <code>animate()</code> に固有のプロパティ：アニメーションを参照する<a href="../domstring"> <code>DOMString</code> </a>。
ko: <code>animate()</code> 고유의 속성 : 애니메이션을 참조 하는 <a href="../domstring"> <code>DOMString</code> </a>
ru: Уникальное свойство <a href="../domstring"> <code>DOMString</code> </a> <code>animate()</code> : строка DOMString, с которой можно ссылаться на анимацию.
zh_cn: <code>animate()</code> 独有的属性：用来引用动画的<a href="../domstring"> <code>DOMString</code> </a>。

source: A provisional answer has been received and successfully applied in response to an offer previously sent and established by calling <code>setLocalDescription()</code>.
ja: 以前に送信され、 <code>setLocalDescription()</code> を呼び出して確立されたオファーへの応答として、暫定的な応答が受信され、正常に適用されました。
ko: <code>setLocalDescription()</code> 을 호출하여 이전에 전송 및 설정 한 오퍼에 대한 임시 응답이 수신되어 성공적으로 적용되었습니다 .
ru: Предварительный ответ был получен и успешно применен в ответ на предложение, ранее отправленное и созданное путем вызова <code>setLocalDescription()</code> .
zh_cn: 响应于先前通过调用 <code>setLocalDescription()</code> 发送和建立的要约，已收到并成功应用了临时答案。

source: A radial <code>CanvasGradient</code> initialized with the two specified circles.
ja: 指定された2つの円で初期化された放射状の <code>CanvasGradient</code> 。
ko: 지정된 두 개의 원으로 초기화 된 방사형 <code>CanvasGradient</code> 입니다.
ru: Радиальный <code>CanvasGradient</code> инициализируется двумя указанными кругами.
zh_cn: 使用两个指定的圆初始化的径向 <code>CanvasGradient</code> 。

source: A random ad is selected by computing <code>Math.floor(Math.random() * ads.length)</code>; the result is a value between 0 and one less than the number of ads. The corresponding ad is now known as <code>adBox</code>.
ja: ランダム広告は、 <code>Math.floor(Math.random() * ads.length)</code> 計算することによって選択されます。結果は0から広告数より1少ない値の間になります。対応する広告は <code>adBox</code> と呼ばれるようになりました。
ko: 임의의 광고는 <code>Math.floor(Math.random() * ads.length)</code> ; 결과는 광고 수보다 0에서 1 사이의 값입니다. 해당 광고는 이제 <code>adBox</code> 로 알려져 있습니다 .
ru: Случайное объявление выбирается путем вычисления <code>Math.floor(Math.random() * ads.length)</code> ; Результатом является значение от 0 до одного меньше, чем количество объявлений. Соответствующее объявление теперь известно как <code>adBox</code> .
zh_cn: 通过计算 <code>Math.floor(Math.random() * ads.length)</code> 选择一个随机广告；结果是比广告数量少0到1之间的值。相应的广告现在称为 <code>adBox</code> 。

source: A range can be created using the <a href="document/createrange"><code>createRange()</code></a> method of the <a href="document"><code>Document</code></a> object. Range objects can also be retrieved by using the <a href="selection/getrangeat"><code>getRangeAt()</code></a> method of the <a href="selection"><code>Selection</code></a> object or the <a href="https://developer.mozilla.org/en-US/docs/Web/API/document/caretRangeFromPoint"><code>caretRangeFromPoint()</code></a> method of the <a href="document"><code>Document</code></a> object.
ja: 範囲は、<a href="document"> <code>Document</code> </a>オブジェクトの<a href="document/createrange"> <code>createRange()</code> </a>メソッドを使用して作成できます。Rangeオブジェクトは、<a href="selection"> <code>Selection</code> </a>オブジェクトの<a href="https://developer.mozilla.org/en-US/docs/Web/API/document/caretRangeFromPoint"> <code>caretRangeFromPoint()</code> </a>メソッドまたは<a href="document"> <code>Document</code> </a>オブジェクトの<a href="selection/getrangeat"> <code>getRangeAt()</code> </a>メソッドを使用して取得することもできます。
ko: <a href="document"> <code>Document</code> </a> 객체 의 <a href="document/createrange"> <code>createRange()</code> </a> 메서드를 사용하여 범위를 만들 수 있습니다 . <a href="selection"> <code>Selection</code> </a> 객체의 <a href="https://developer.mozilla.org/en-US/docs/Web/API/document/caretRangeFromPoint"> <code>caretRangeFromPoint()</code> </a> 메서드 또는 <a href="document"> <code>Document</code> </a> 객체 의 <a href="selection/getrangeat"> <code>getRangeAt()</code> </a> 메서드를 사용하여 범위 객체를 검색 할 수도 있습니다 .
ru: Диапазон может быть создан с помощью <a href="document/createrange"> <code>createRange()</code> </a> метод <a href="document"> <code>Document</code> </a> объекта. Объекты уровня также могут быть получены с помощью <a href="selection/getrangeat"> <code>getRangeAt()</code> </a> метода <a href="selection"> <code>Selection</code> </a> объекта или <a href="https://developer.mozilla.org/en-US/docs/Web/API/document/caretRangeFromPoint"> <code>caretRangeFromPoint()</code> </a> способа <a href="document"> <code>Document</code> </a> объекта.
zh_cn: 可以使用<a href="document"> <code>Document</code> </a>对象的<a href="document/createrange"> <code>createRange()</code> </a>方法创建范围。范围对象也可以通过使用所检索的<a href="selection/getrangeat"> <code>getRangeAt()</code> </a>的方法<a href="selection"> <code>Selection</code> </a>对象或<a href="https://developer.mozilla.org/en-US/docs/Web/API/document/caretRangeFromPoint"> <code>caretRangeFromPoint()</code> </a>的方法<a href="document"> <code>Document</code> </a>对象。

source: A range is a contiguous part of a document. A range can contain entire nodes as well as portions of nodes, such as a portion of a text node. A user will normally only select a single range at a time, but it's possible for a user to select multiple ranges (e.g. by using the Control key). A range can be retrieved from a selection as a <a href="range"><code>range</code></a> object. Range objects can also be created via the DOM and programmatically added or removed from a selection.
ja: 範囲は、ドキュメントの連続した部分です。範囲には、ノード全体だけでなく、テキストノードの一部などのノードの一部を含めることができます。通常、ユーザーは一度に1つの範囲のみを選択しますが、ユーザーが複数の範囲を選択することもできます（たとえば、Ctrlキーを使用して）。範囲は、選択範囲から取得できます。<a href="range"> <code>range</code> </a>オブジェクトます。 Rangeオブジェクトは、DOMを介して作成し、プログラムで選択に追加または削除することもできます。
ko: 범위는 문서의 연속 부분입니다. 범위에는 전체 노드와 텍스트 노드의 일부와 같은 노드의 일부가 포함될 수 있습니다. 사용자는 일반적으로 한 번에 하나의 범위 만 선택하지만 여러 범위를 선택할 수 있습니다 (예 : Control 키 사용). 선택에서 <a href="range"> <code>range</code> </a> 개체 로 범위를 검색 할 수 있습니다 . DOM을 통해 범위 객체를 생성하고 선택적으로 프로그래밍 방식으로 추가하거나 제거 할 수 있습니다.
ru: Диапазон - это непрерывная часть документа. Диапазон может содержать как целые узлы, так и части узлов, например часть текстового узла. Пользователь обычно выбирает только один диапазон за раз, но пользователь может выбрать несколько диапазонов (например, с помощью клавиши управления). Диапазон может быть получен из выбора как объект <a href="range"> <code>range</code> </a> . Объекты диапазона также могут быть созданы с помощью DOM и программно добавлены или удалены из выбора.
zh_cn: 范围是文档的连续部分。范围可以包含整个节点以及部分节点，例如文本节点的一部分。用户通常一次只能选择一个范围，但是用户可以选择多个范围（例如，使用Control键）。可以从选择中检索<a href="range"> <code>range</code> </a>作为范围对象。范围对象也可以通过DOM创建，并以编程方式添加到选择中或从选择中删除。

source: A range object that will be removed to the selection.
ja: 選択範囲に削除される範囲オブジェクト。
ko: 선택 영역에서 제거 될 범위 개체입니다.
ru: Объект диапазона,который будет удален в область выделения.
zh_cn: 一个将被删除的范围对象。

source: A read method has been called.
ja: 読み込みメソッドが呼び出されました。
ko: 읽기 메소드가 호출되었습니다.
ru: Называется метод чтения.
zh_cn: 读取方法已被调用。

source: A read only <a href="svgangle"><code>SVGAngle</code></a> representing the current animated value of the given attribute. If the given attribute is not currently being animated, then the <a href="svgangle"><code>SVGAngle</code></a> will have the same contents as <code>baseVal</code>. The object referenced by <code>animVal</code> will always be distinct from the one referenced by <code>baseVal</code>, even when the attribute is not animated.
ja: 指定された属性の現在のアニメーション値を表す読み取り専用の<a href="svgangle"> <code>SVGAngle</code> </a>。指定された属性が現在アニメーションされていない場合は、<a href="svgangle"> <code>SVGAngle</code> は</a>同じ内容になります <code>baseVal</code> 。 <code>animVal</code> によって参照されるオブジェクトは、常に参照されるオブジェクトとは異なります <code>baseVal</code> は、属性がアニメーション化されていない場合でも、baseValます。
ko: 주어진 속성의 현재 애니메이션 값을 나타내는 읽기 전용 <a href="svgangle"> <code>SVGAngle</code> </a> . 주어진 속성이 현재 애니메이션되지 않은 경우 <a href="svgangle"> <code>SVGAngle</code> </a> 은 baseVal 과 동일한 내용을 <code>baseVal</code> . 참조하는 객체 <code>animVal</code> 은 항상이 참조하는 것과 별개의 것입니다 <code>baseVal</code> 속성이 애니메이션되지 않은 경우에도.
ru: <a href="svgangle"> <code>SVGAngle</code> </a> только для чтения, представляющий текущее анимированное значение данного атрибута. Если данный атрибут в настоящее время не анимируется, то <a href="svgangle"> <code>SVGAngle</code> </a> будет иметь то же содержимое, что и <code>baseVal</code> . Объект, на который ссылается <code>animVal</code> , всегда будет отличаться от <code>baseVal</code> , на который ссылается baseVal , даже если атрибут не анимирован.
zh_cn: 表示给定属性的当前动画值的只读<a href="svgangle"> <code>SVGAngle</code> </a>。如果给定的属性当前未设置动画，则<a href="svgangle"> <code>SVGAngle</code> </a>的内容将与 <code>baseVal</code> 相同。由所引用的对象 <code>animVal</code> 永远是从一个由参考不同 <code>baseVal</code> ，即使当属性不显示动画。

source: A read only <a href="svglengthlist"><code>SVGLengthList</code></a> representing the current animated value of the given attribute. If the given attribute is not currently being animated, then the <a href="svglengthlist"><code>SVGLengthList</code></a> will have the same contents as <code>baseVal</code>. The object referenced by <code>animVal</code> will always be distinct from the one referenced by <code>baseVal</code>, even when the attribute is not animated.
ja: 指定された属性の現在のアニメーション値を表す読み取り専用の<a href="svglengthlist"> <code>SVGLengthList</code> </a>。指定された属性が現在アニメーションされていない場合は、<a href="svglengthlist"> <code>SVGLengthList</code> は</a>同じ内容になります <code>baseVal</code> 。 <code>animVal</code> によって参照されるオブジェクトは、常に参照されるオブジェクトとは異なります <code>baseVal</code> は、属性がアニメーション化されていない場合でも、baseValます。
ko: 주어진 속성의 현재 애니메이션 값을 나타내는 읽기 전용 <a href="svglengthlist"> <code>SVGLengthList</code> </a> . 주어진 속성이 현재 애니메이션되지 않은 경우 <a href="svglengthlist"> <code>SVGLengthList</code> </a> 는 baseVal 과 동일한 내용을 <code>baseVal</code> . 참조하는 객체 <code>animVal</code> 은 항상이 참조하는 것과 별개의 것입니다 <code>baseVal</code> 속성이 애니메이션되지 않은 경우에도.
ru: <a href="svglengthlist"> <code>SVGLengthList</code> </a> только для чтения SVGLengthList, представляющий текущее анимированное значение данного атрибута. Если данный атрибут в настоящее время не анимируется, тогда <a href="svglengthlist"> <code>SVGLengthList</code> </a> будет иметь то же содержимое, что и <code>baseVal</code> . Объект, на который ссылается <code>animVal</code> , всегда будет отличаться от <code>baseVal</code> , на который ссылается baseVal , даже если атрибут не анимирован.
zh_cn: 只读<a href="svglengthlist"> <code>SVGLengthList</code> ,</a>表示给定属性的当前动画值。如果给定属性当前未设置动画，则<a href="svglengthlist"> <code>SVGLengthList</code> </a>将具有与 <code>baseVal</code> 相同的内容。由所引用的对象 <code>animVal</code> 永远是从一个由参考不同 <code>baseVal</code> ，即使当属性不显示动画。

source: A read only <a href="svgnumberlist"><code>SVGNumberList</code></a> representing the current animated value of the given attribute. If the given attribute is not currently being animated, then the <a href="svgnumberlist"><code>SVGNumberList</code></a> will have the same contents as <code>baseVal</code>. The object referenced by <code>animVal</code> will always be distinct from the one referenced by <code>baseVal</code>, even when the attribute is not animated.
ja: 指定された属性の現在のアニメーション値を表す読み取り専用の<a href="svgnumberlist"> <code>SVGNumberList</code> </a>。指定された属性が現在アニメーションされていない場合は、<a href="svgnumberlist"> <code>SVGNumberList</code> は</a>同じ内容になります <code>baseVal</code> 。 <code>animVal</code> によって参照されるオブジェクトは、baseValによって参照されるオブジェクトとは常に <code>baseVal</code> は、属性がアニメーション化されていない場合でも、ます。
ko: 지정된 속성의 현재 애니메이션 값을 나타내는 읽기 전용 <a href="svgnumberlist"> <code>SVGNumberList</code> </a> 입니다. 지정된 속성이 현재 애니메이션되지 않은 경우 <a href="svgnumberlist"> <code>SVGNumberList</code> 의</a> 내용은 <code>baseVal</code> 과 동일합니다 . 참조하는 객체 <code>animVal</code> 은 항상이 참조하는 것과 별개의 것입니다 <code>baseVal</code> 속성이 애니메이션되지 않은 경우에도.
ru: <a href="svgnumberlist"> <code>SVGNumberList</code> </a> только для чтения SVGNumberList, представляющий текущее анимированное значение данного атрибута. Если данный атрибут в настоящее время не анимируется, тогда <a href="svgnumberlist"> <code>SVGNumberList</code> </a> будет иметь то же содержимое, что и <code>baseVal</code> . Объект, на который ссылается <code>animVal</code> , всегда будет отличаться от <code>baseVal</code> , на который ссылается baseVal , даже если атрибут не анимирован.
zh_cn: 只读<a href="svgnumberlist"> <code>SVGNumberList</code> ,</a>表示给定属性的当前动画值。如果给定属性当前未设置动画，则<a href="svgnumberlist"> <code>SVGNumberList</code> </a>将具有与 <code>baseVal</code> 相同的内容。由所引用的对象 <code>animVal</code> 永远是从一个由参考不同 <code>baseVal</code> ，即使当属性不显示动画。

source: A read only <a href="svgpreserveaspectratio"><code>SVGPreserveAspectRatio</code></a> representing the current animated value of the given attribute. If the given attribute is not currently being animated, then the <a href="svgpreserveaspectratio"><code>SVGPreserveAspectRatio</code></a> will have the same contents as <code>baseVal</code>. The object referenced by <code>animVal</code> is always distinct from the one referenced by <code>baseVal</code>, even when the attribute is not animated.
ja: 指定された属性の現在のアニメーション値を表す読み取り専用の<a href="svgpreserveaspectratio"> <code>SVGPreserveAspectRatio</code> </a>。指定された属性が現在アニメーションされていない場合は、<a href="svgpreserveaspectratio"> <code>SVGPreserveAspectRatio</code> は</a>同じ内容になります <code>baseVal</code> 。 <code>animVal</code> によって参照されるオブジェクトは、属性がアニメーション化されていない場合でも、 <code>baseVal</code> によって参照されるオブジェクトとは常に異なります。
ko: 지정된 속성의 현재 애니메이션 값을 나타내는 읽기 전용 <a href="svgpreserveaspectratio"> <code>SVGPreserveAspectRatio</code> </a> 주어진 속성이 현재 애니메이션되지 않은 경우 <a href="svgpreserveaspectratio"> <code>SVGPreserveAspectRatio</code> </a> 는 baseVal 과 동일한 내용을 <code>baseVal</code> . 참조하는 객체 <code>animVal</code> 은 항상이 참조하는 것과 구별된다 <code>baseVal</code> 속성이 애니메이션되지 않은 경우에도.
ru: <a href="svgpreserveaspectratio"> <code>SVGPreserveAspectRatio</code> </a> только для чтения SVGPreserveAspectRatio, представляющий текущее анимированное значение данного атрибута. Если данный атрибут в настоящее время не анимируется, тогда <a href="svgpreserveaspectratio"> <code>SVGPreserveAspectRatio</code> </a> будет иметь то же содержимое, что и <code>baseVal</code> . Объект, на который ссылается <code>animVal</code> , всегда отличается от объекта, на который ссылается <code>baseVal</code> , даже если атрибут не анимирован.
zh_cn: 只读<a href="svgpreserveaspectratio"> <code>SVGPreserveAspectRatio</code> ,</a>表示给定属性的当前动画值。如果给定属性当前未设置动画，则<a href="svgpreserveaspectratio"> <code>SVGPreserveAspectRatio</code> </a>的内容将与 <code>baseVal</code> 相同。 <code>animVal</code> 引用的对象始终不同于 <code>baseVal</code> 引用的对象，即使该属性未设置动画也是如此。

source: A read only <a href="svgrect"><code>SVGRect</code></a> representing the current animated value of the given attribute. If the given attribute is not currently being animated, then the <a href="svgrect"><code>SVGRect</code></a> will have the same contents as <code>baseVal</code>. The object referenced by <code>animVal</code> will always be distinct from the one referenced by <code>baseVal</code>, even when the attribute is not animated.
ja: 指定された属性の現在のアニメーション値を表す読み取り専用の<a href="svgrect"> <code>SVGRect</code> </a>。指定された属性が現在アニメーションされていない場合は、<a href="svgrect"> <code>SVGRect</code> は</a>同じ内容になります <code>baseVal</code> 。 <code>animVal</code> によって参照されるオブジェクトは、属性がアニメーション化されていない場合でも、 <code>baseVal</code> によって参照されるオブジェクトとは常に異なります。
ko: 지정된 속성의 현재 애니메이션 값을 나타내는 읽기 전용 <a href="svgrect"> <code>SVGRect</code> </a> 지정된 속성이 현재 애니메이션되지 않는 경우, <a href="svgrect"> <code>SVGRect</code> 이</a> 같은 내용이됩니다 <code>baseVal</code> 을 . 참조하는 객체 <code>animVal</code> 은 항상이 참조하는 것과 별개의 것입니다 <code>baseVal</code> 속성이 애니메이션되지 않은 경우에도.
ru: <a href="svgrect"> <code>SVGRect</code> </a> только для чтения, представляющий текущее анимированное значение данного атрибута. Если данный атрибут в настоящее время не анимируется, тогда <a href="svgrect"> <code>SVGRect</code> </a> будет иметь то же содержимое, что и <code>baseVal</code> . Объект, на который ссылается <code>animVal</code> , всегда будет отличаться от <code>baseVal</code> , на который ссылается baseVal , даже если атрибут не анимирован.
zh_cn: 表示给定属性的当前动画值的只读<a href="svgrect"> <code>SVGRect</code> </a>。如果给定的属性当前未设置动画，则<a href="svgrect"> <code>SVGRect</code> </a>的内容将与 <code>baseVal</code> 相同。由所引用的对象 <code>animVal</code> 永远是从一个由参考不同 <code>baseVal</code> ，即使当属性不显示动画。

source: A read only <a href="svgtransformlist"><code>SVGTransformList</code></a> representing the current animated value of the given attribute. If the given attribute is not currently being animated, then the <a href="svgtransformlist"><code>SVGTransformList</code></a> will have the same contents as <code>baseVal</code>. The object referenced by <code>animVal</code> will always be distinct from the one referenced by <code>baseVal</code>, even when the attribute is not animated.
ja: 指定された属性の現在のアニメーション値を表す読み取り専用の<a href="svgtransformlist"> <code>SVGTransformList</code> </a>。指定された属性が現在アニメーションされていない場合は、<a href="svgtransformlist"> <code>SVGTransformList</code> は</a>同じ内容になります <code>baseVal</code> 。 <code>animVal</code> によって参照されるオブジェクトは、属性がアニメーション化されていない場合でも、 <code>baseVal</code> によって参照されるオブジェクトとは常に異なります。
ko: 지정된 속성의 현재 애니메이션 값을 나타내는 읽기 전용 <a href="svgtransformlist"> <code>SVGTransformList</code> </a> 입니다. 주어진 속성이 현재 애니메이션되지 않은 경우 <a href="svgtransformlist"> <code>SVGTransformList</code> </a> 는 baseVal 과 동일한 내용을 <code>baseVal</code> . 참조하는 객체 <code>animVal</code> 은 항상이 참조하는 것과 별개의 것입니다 <code>baseVal</code> 속성이 애니메이션되지 않은 경우에도.
ru: <a href="svgtransformlist"> <code>SVGTransformList</code> </a> только для чтения SVGTransformList, представляющий текущее анимированное значение данного атрибута. Если данный атрибут в настоящее время не анимируется, тогда <a href="svgtransformlist"> <code>SVGTransformList</code> </a> будет иметь то же содержимое, что и <code>baseVal</code> . Объект, на который ссылается <code>animVal</code> , всегда будет отличаться от <code>baseVal</code> , на который ссылается baseVal , даже если атрибут не анимирован.
zh_cn: 只读<a href="svgtransformlist"> <code>SVGTransformList</code> ,</a>表示给定属性的当前动画值。如果给定属性当前未设置动画，则<a href="svgtransformlist"> <code>SVGTransformList</code> </a>将具有与 <code>baseVal</code> 相同的内容。由所引用的对象 <code>animVal</code> 永远是从一个由参考不同 <code>baseVal</code> ，即使当属性不显示动画。
