Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/dom/dom.*.007.xlf
Languages: es, ko, ru, zh_cn

source: <em>value</em> is the value for the new key range.
es: <em>valor</em> es el valor para el nuevo rango de claves.
ko: <em>value</em> 는 새 키 범위의 값입니다.
ru: <em>значение</em> - это значение для нового диапазона ключей.
zh_cn: <em>value</em>是新键范围的值。

source: <em>w</em><code>w </code><em>d</em><code>d </code><em>h</em><code>h </code><em>m</em><code>m </code><em>s</em><code>s</code>
ru: <em>ш </em> <code>w </code> <em>д </em> <code>d </code> <em>ч </em> <code>h </code> <em>м </em> <code>m </code> <em>ы </em> <code>s</code>

source: <em>whatToShow Optional</em>
es: <em>whatToShow Opcional</em>
ko: <em>whatToShow 선택 사항</em>
ru: <em>whatToShow Необязательно</em>
zh_cn: <em>whatToShow可选</em>

source: <em>when </em>Optional
es: <em>cuando</em> opcional
ko: <em>때</em> 옵션
ru: <em>когда</em> необязательно
zh_cn: <em>当</em>可选

source: <s><a href="rtcdatachannel/reliable"><code>reliable</code></a></s>Read only
es: <s><a href="rtcdatachannel/reliable"> <code>reliable</code> </a></s> Solo lectura
ko: <s><a href="rtcdatachannel/reliable"> <code>reliable</code> </a></s> 읽기 전용
ru: <s><a href="rtcdatachannel/reliable"> <code>reliable</code> </a></s> толькочтения
zh_cn: <s><a href="rtcdatachannel/reliable"> <code>reliable</code> </a></s>只读

source: <s><a href="rtcdatachannel/stream"><code>stream</code></a></s>Read only
es: <s><a href="rtcdatachannel/stream"> <code>stream</code> </a></s> solo lectura
ko: <s><a href="rtcdatachannel/stream"> <code>stream</code> </a></s> 읽기 전용
ru: <s><a href="rtcdatachannel/stream"> <code>stream</code> </a></s> толькочтения
zh_cn: <s><a href="rtcdatachannel/stream"> <code>stream</code> </a></s>只读

source: <s>See also <a href="https://github.com/gskinner/regexr/issues/242#issuecomment-359156034">Issue 242 on gskinner/regexr @github</a> about a bug in this function...</s>
es: <s>Consulte tambi&eacute;n el <a href="https://github.com/gskinner/regexr/issues/242#issuecomment-359156034">n&uacute;mero 242 en gskinner / regexr @github</a> sobre un error en esta funci&oacute;n ...</s>
ko: <s>이 함수의 버그에 대해서는 <a href="https://github.com/gskinner/regexr/issues/242#issuecomment-359156034">gskinner / regexr @github의 이슈 242를</a> 참조하십시오 ...</s>
ru: <s>Смотрите также <a href="https://github.com/gskinner/regexr/issues/242#issuecomment-359156034">выпуск 242 на gskinner / regexr @github</a> об ошибке в этой функции ...</s>
zh_cn: <s>另请参阅<a href="https://github.com/gskinner/regexr/issues/242#issuecomment-359156034">gskinner / regexr @github上的第242期</a>有关此功能中的错误...</s>

source: <small><a href="https://www.w3.org/TR/2018/CR-payment-request-20180320/#dom-paymentcurrencyamount-currencysystem">The definition of 'PaymentCurrencyAmount.currencySystem' in that specification.</a></small>
es: <small><a href="https://www.w3.org/TR/2018/CR-payment-request-20180320/#dom-paymentcurrencyamount-currencysystem">La definici&oacute;n de 'PaymentCurrencyAmount.currencySystem' en esa especificaci&oacute;n.</a></small>
ko: <small><a href="https://www.w3.org/TR/2018/CR-payment-request-20180320/#dom-paymentcurrencyamount-currencysystem">해당 사양에서 'PaymentCurrencyAmount.currencySystem'의 정의</a></small>
ru: <small><a href="https://www.w3.org/TR/2018/CR-payment-request-20180320/#dom-paymentcurrencyamount-currencysystem">Определение &laquo;PaymentCurrencyAmount.currencySystem&raquo; в этой спецификации.</a></small>
zh_cn: <small><a href="https://www.w3.org/TR/2018/CR-payment-request-20180320/#dom-paymentcurrencyamount-currencysystem">该规范中&ldquo; PaymentCurrencyAmount.currencySystem&rdquo;的定义。</a></small>

source: <small><code>data</code> URIs, defined by <a href="http://tools.ietf.org/html/rfc2397">RFC 2397</a>, allow content creators to embed small files inline in documents.</small>
es: <small> <code>data</code> URI de datos , definidos por <a href="http://tools.ietf.org/html/rfc2397">RFC 2397</a> , permiten a los creadores de contenido incrustar peque&ntilde;os archivos en l&iacute;nea en los documentos.</small>
ko: <small> <code>data</code> <a href="http://tools.ietf.org/html/rfc2397">RFC 2397에</a> 의해 정의 된 데이터 URI 는 컨텐츠 작성자가 작은 파일을 문서에 인라인으로 포함 할 수 있도록합니다.</small>
ru: <small> <code>data</code> URI данных , определенные в <a href="http://tools.ietf.org/html/rfc2397">RFC 2397</a> , позволяют создателям контента встраивать небольшие файлы в документы.</small>
zh_cn: <small> <code>data</code> <a href="http://tools.ietf.org/html/rfc2397">RFC 2397</a>定义的数据 URI 允许内容创建者将小文件内联地嵌入文档中。</small>

source: <small>Creates a base-64 encoded ASCII string from a "string" of binary data.</small>
es: <small>Crea una cadena ASCII codificada en base 64 a partir de una "cadena" de datos binarios.</small>
ko: <small>이진 데이터의 "문자열"에서 base-64로 인코딩 된 ASCII 문자열을 만듭니다.</small>
ru: <small>Создает строку ASCII в кодировке base-64 из &laquo;строки&raquo; двоичных данных.</small>
zh_cn: <small>根据二进制数据的&ldquo;字符串&rdquo;创建一个以base-64编码的ASCII字符串。</small>

source: <small>Decodes a string of data which has been encoded using base-64 encoding.</small>
es: <small>Decodifica una cadena de datos que ha sido codificada usando codificaci&oacute;n base-64.</small>
ko: <small>base-64 인코딩을 사용하여 인코딩 된 데이터 문자열을 디코딩합니다.</small>
ru: <small>Декодирует строку данных, которая была закодирована с использованием кодировки base-64.</small>
zh_cn: <small>解码已使用base-64编码编码的数据字符串。</small>

source: <small>In most browsers, calling <code>btoa()</code> on a Unicode string will cause a <code>Character Out Of Range</code> exception. This paragraph shows some solutions.</small>
es: <small>En la mayor&iacute;a de los navegadores, llamar a <code>btoa()</code> en una cadena Unicode provocar&aacute; una excepci&oacute;n de <code>Character Out Of Range</code> . Este p&aacute;rrafo muestra algunas soluciones.</small>
ko: <small>대부분의 브라우저에서 유니 코드 문자열에서 <code>btoa()</code> 를 호출 하면 <code>Character Out Of Range</code> 예외가 발생합니다. 이 단락은 몇 가지 해결책을 보여줍니다.</small>
ru: <small>В большинстве браузеров вызов <code>btoa()</code> для строки Unicode вызовет исключение <code>Character Out Of Range</code> . Этот параграф показывает некоторые решения.</small>
zh_cn: <small>在大多数浏览器中，对Unicode字符串调用 <code>btoa()</code> 会导致 <code>Character Out Of Range</code> 异常。本段显示了一些解决方案。</small>

source: <small>List of Mozilla supported URI schemes</small>
es: <small>Lista de esquemas de URI compatibles con Mozilla</small>
ko: <small>Mozilla 지원 URI 스킴 목록</small>
ru: <small>Список поддерживаемых Mozilla схем URI</small>
zh_cn: <small>Mozilla支持的URI方案列表</small>

source: <small>One of the most beloved features of Firefox <a href="https://bugzilla.mozilla.org/show_bug.cgi?id=345345">prevents session cookies from ever expiring </a>.<br/> The same <a href="https://code.google.com/p/chromium/issues/detail?id=128513">issue</a> is also occuring with google chrome (and probably with other browsers offering similar features)</small>
es: <small>Una de las caracter&iacute;sticas m&aacute;s queridas de Firefox <a href="https://bugzilla.mozilla.org/show_bug.cgi?id=345345">evita que las cookies de sesi&oacute;n caduquen</a> . <br/>El mismo <a href="https://code.google.com/p/chromium/issues/detail?id=128513">problema</a> tambi&eacute;n est&aacute; ocurriendo con Google Chrome (y probablemente con otros navegadores que ofrecen caracter&iacute;sticas similares)</small>
ko: <small>Firefox의 가장 사랑받는 기능 중 하나는 <a href="https://bugzilla.mozilla.org/show_bug.cgi?id=345345">세션 쿠키가 만료되는 것을 방지</a> 합니다. 구글 크롬에서도 <br/>같은 <a href="https://code.google.com/p/chromium/issues/detail?id=128513">문제</a> 가 발생합니다 (아마도 비슷한 기능을 제공하는 다른 브라우저에서도)</small>
ru: <small>Одна из самых любимых функций Firefox <a href="https://bugzilla.mozilla.org/show_bug.cgi?id=345345">предотвращает истечение срока действия файлов cookie сеанса</a> . <br/>Та же <a href="https://code.google.com/p/chromium/issues/detail?id=128513">проблема</a> возникает и с Google Chrome (и, вероятно, с другими браузерами, предлагающими аналогичные функции)</small>
zh_cn: <small>Firefox最受欢迎的功能之一是<a href="https://bugzilla.mozilla.org/show_bug.cgi?id=345345">防止会话cookie过期</a>。谷歌浏览器（可能还有其他提供类似功能的浏览器）也发生<br/>相同的<a href="https://code.google.com/p/chromium/issues/detail?id=128513">问题</a></small>

source: <small>The definition of 'RTCIceServer.urls' in that specification.</small>
es: <small>La definici&oacute;n de 'RTCIceServer.urls' en esa especificaci&oacute;n.</small>
ko: <small>해당 사양에서 'RTCIceServer.urls'의 정의</small>
ru: <small>Определение 'RTCIceServer.urls' в этой спецификации.</small>
zh_cn: <small>该规范中&ldquo; RTCIceServer.urls&rdquo;的定义。</small>

source: <small>The definition of 'disableRemotePlayback' in that specification.</small>
es: <small>La definici&oacute;n de 'disableRemotePlayback' en esa especificaci&oacute;n.</small>
ko: <small>해당 사양에서 'disableRemotePlayback'의 정의</small>
ru: <small>Определение 'disableRemotePlayback' в этой спецификации.</small>
zh_cn: <small>该规范中&ldquo; disableRemotePlayback&rdquo;的定义。</small>

source: <small>Wikipedia article about Base64 encoding.</small>
es: <small>Art&iacute;culo de Wikipedia sobre codificaci&oacute;n Base64.</small>
ko: <small>Base64 인코딩에 관한 Wikipedia 기사.</small>
ru: <small>Статья в Википедии о кодировке Base64.</small>
zh_cn: <small>维基百科有关Base64编码的文章。</small>

source: <span id="Original_Document_Information"><strong>Original Document Information</strong></span>
es: <span id="Original_Document_Information"><strong>Informaci&oacute;n del documento original</strong></span>
ko: <span id="Original_Document_Information"><strong>원본 문서 정보</strong></span>
ru: <span id="Original_Document_Information"><strong>Информация об оригинальном документе</strong></span>
zh_cn: <span id="Original_Document_Information"><strong>原始文件信息</strong></span>

source: <strong> Deprecated since <a href="https://developer.mozilla.org/en-US/docs/HTML">HTML4</a></strong>
es: <strong>En desuso desde <a href="https://developer.mozilla.org/en-US/docs/HTML">HTML4</a></strong>
ko: <strong><a href="https://developer.mozilla.org/en-US/docs/HTML">HTML4</a> 부터 사용되지 않음</strong>
ru: <strong>Устаревший с <a href="https://developer.mozilla.org/en-US/docs/HTML">HTML4</a></strong>
zh_cn: <strong>从<a href="https://developer.mozilla.org/en-US/docs/HTML">HTML4开始</a>不推荐使用</strong>

source: <strong> Deprecated since Gecko 13 (Firefox 13 / Thunderbird 13 / SeaMonkey 2.10)</strong>
es: <strong> En desuso desde Gecko 13 (Firefox 13 / Thunderbird 13 / SeaMonkey 2.10)</strong>
ko: <strong> Gecko 13부터 사용 중단됨 (Firefox 13 / Thunderbird 13 / SeaMonkey 2.10)</strong>
ru: <strong> Устаревший с Gecko 13 (Firefox 13 / Thunderbird 13 / SeaMonkey 2.10)</strong>
zh_cn: <strong> 自Gecko 13以来不推荐使用（Firefox 13 / Thunderbird 13 / SeaMonkey 2.10）</strong>

source: <strong> Obsolete since Gecko 10.0 (Firefox 10.0 / Thunderbird 10.0 / SeaMonkey 2.7)</strong>
es: <strong> Obsoleto desde Gecko 10.0 (Firefox 10.0 / Thunderbird 10.0 / SeaMonkey 2.7)</strong>
ko: <strong> Gecko 10.0부터 사용되지 않음 (Firefox 10.0 / Thunderbird 10.0 / SeaMonkey 2.7)</strong>
ru: <strong> Устаревший с Gecko 10.0 (Firefox 10.0 / Thunderbird 10.0 / SeaMonkey 2.7)</strong>
zh_cn: <strong> 自Gecko 10.0起已淘汰（Firefox 10.0 / Thunderbird 10.0 / SeaMonkey 2.7）</strong>

source: <strong> Obsolete since Gecko 2.0 (Firefox 4 / Thunderbird 3.3 / SeaMonkey 2.1)</strong>
es: <strong> Obsoleto desde Gecko 2.0 (Firefox 4 / Thunderbird 3.3 / SeaMonkey 2.1)</strong>
ko: <strong> Gecko 2.0 이후 사용되지 않음 (Firefox 4 / Thunderbird 3.3 / SeaMonkey 2.1)</strong>
ru: <strong> Устаревший с Gecko 2.0 (Firefox 4 / Thunderbird 3.3 / SeaMonkey 2.1)</strong>
zh_cn: <strong> 自Gecko 2.0起已淘汰（Firefox 4 / Thunderbird 3.3 / SeaMonkey 2.1）</strong>

source: <strong> Obsolete since Gecko 23 (Firefox 23 / Thunderbird 23 / SeaMonkey 2.20)</strong>
es: <strong> Obsoleto desde Gecko 23 (Firefox 23 / Thunderbird 23 / SeaMonkey 2.20)</strong>
ko: <strong> Gecko 23 (Firefox 23 / Thunderbird 23 / SeaMonkey 2.20) 이후 사용되지 않음</strong>
ru: <strong> Устаревший с Gecko 23 (Firefox 23 / Thunderbird 23 / SeaMonkey 2.20)</strong>
zh_cn: <strong> 自Gecko 23以来已过时（Firefox 23 / Thunderbird 23 / SeaMonkey 2.20）</strong>

source: <strong> Obsolete since Gecko 24 (Firefox 24 / Thunderbird 24 / SeaMonkey 2.21)</strong>
es: <strong> Obsoleto desde Gecko 24 (Firefox 24 / Thunderbird 24 / SeaMonkey 2.21)</strong>
ko: <strong> Gecko 24 (Firefox 24 / Thunderbird 24 / SeaMonkey 2.21) 이후 사용되지 않음</strong>
ru: <strong> Устаревший с Gecko 24 (Firefox 24 / Thunderbird 24 / SeaMonkey 2.21)</strong>
zh_cn: <strong> 自Gecko 24以来已过时（Firefox 24 / Thunderbird 24 / SeaMonkey 2.21）</strong>

source: <strong> Obsolete since Gecko 29 (Firefox 29 / Thunderbird 29 / SeaMonkey 2.26)</strong>
es: <strong> Obsoleto desde Gecko 29 (Firefox 29 / Thunderbird 29 / SeaMonkey 2.26)</strong>
ko: <strong> Gecko 29 (Firefox 29 / Thunderbird 29 / SeaMonkey 2.26)부터 사용되지 않음</strong>
ru: <strong> Устаревший с Gecko 29 (Firefox 29 / Thunderbird 29 / SeaMonkey 2.26)</strong>
zh_cn: <strong> 自Gecko 29以来已过时（Firefox 29 / Thunderbird 29 / SeaMonkey 2.26）</strong>

source: <strong> Obsolete since Gecko 30 (Firefox 30 / Thunderbird 30 / SeaMonkey 2.27 / Firefox OS 1.4)</strong>
es: <strong> Obsoleto desde Gecko 30 (Firefox 30 / Thunderbird 30 / SeaMonkey 2.27 / Firefox OS 1.4)</strong>
ko: <strong> Gecko 30부터 사용되지 않음 (Firefox 30 / Thunderbird 30 / SeaMonkey 2.27 / Firefox OS 1.4)</strong>
ru: <strong> Устаревшая версия с Gecko 30 (Firefox 30 / Thunderbird 30 / SeaMonkey 2.27 / Firefox OS 1.4)</strong>
zh_cn: <strong> 自Gecko 30以来已过时（Firefox 30 / Thunderbird 30 / SeaMonkey 2.27 / Firefox OS 1.4）</strong>

source: <strong> Obsolete since Gecko 50 (Firefox 50 / Thunderbird 50 / SeaMonkey 2.47)</strong>
es: <strong> Obsoleto desde Gecko 50 (Firefox 50 / Thunderbird 50 / SeaMonkey 2.47)</strong>
ko: <strong> Gecko 50부터 사용되지 않음 (Firefox 50 / Thunderbird 50 / SeaMonkey 2.47)</strong>
ru: <strong> Устаревший с Gecko 50 (Firefox 50 / Thunderbird 50 / SeaMonkey 2.47)</strong>
zh_cn: <strong> 自Gecko 50以来已过时（Firefox 50 / Thunderbird 50 / SeaMonkey 2.47）</strong>

source: <strong> Obsolete since Gecko 52 (Firefox 52 / Thunderbird 52 / SeaMonkey 2.49)</strong>
es: <strong> Obsoleto desde Gecko 52 (Firefox 52 / Thunderbird 52 / SeaMonkey 2.49)</strong>
ko: <strong> Gecko 52 (Firefox 52 / Thunderbird 52 / SeaMonkey 2.49) 이후 사용되지 않음</strong>
ru: <strong> Устаревший с Gecko 52 (Firefox 52 / Thunderbird 52 / SeaMonkey 2.49)</strong>
zh_cn: <strong> 自Gecko 52以来已过时（Firefox 52 / Thunderbird 52 / SeaMonkey 2.49）</strong>

source: <strong> Obsolete since Gecko 7.0 (Firefox 7.0 / Thunderbird 7.0 / SeaMonkey 2.4)</strong>
es: <strong> Obsoleto desde Gecko 7.0 (Firefox 7.0 / Thunderbird 7.0 / SeaMonkey 2.4)</strong>
ko: <strong> Gecko 7.0 (Firefox 7.0 / Thunderbird 7.0 / SeaMonkey 2.4)부터 사용되지 않음</strong>
ru: <strong> Устаревший с Gecko 7.0 (Firefox 7.0 / Thunderbird 7.0 / SeaMonkey 2.4)</strong>
zh_cn: <strong> 自Gecko 7.0起已淘汰（Firefox 7.0 / Thunderbird 7.0 / SeaMonkey 2.4）</strong>

source: <strong>&lt;&lt;&lt;discuss negotiation and connections, especially RTCDataChannel.negotiated and what happens when true vs false&gt;&gt;&gt;</strong>
es: <strong>&lt;&lt;&lt; discuta la negociaci&oacute;n y las conexiones, especialmente RTCDataChannel.negotiated y lo que sucede cuando es verdadero o falso &gt;&gt;&gt;</strong>
ko: <strong>&lt;&lt;&lt; 협상 및 연결, 특히 RTCDataChannel.negotiated 및 true와 false 일 때 발생하는 상황에 대해 논의 &gt;&gt;&gt;</strong>
ru: <strong>&lt;&lt;&lt; обсудить переговоры и соединения, особенно RTCDataChannel.negotiated и что произойдет, когда истина vs ложь &gt;&gt;&gt;</strong>
zh_cn: <strong>&lt;&lt;&lt;讨论协商和连接，尤其是RTCDataChannel.negotiated，以及当真与假时会发生什么&gt;&gt;&gt;</strong>

source: <strong>&lt;&lt;&lt;write more about using bufferedAmount, bufferedAmountLowThreshold, onbufferedamountlow, and bufferedamountlow here&gt;&gt;&gt;</strong>
es: <strong>&lt;&lt;&lt; escriba m&aacute;s sobre el uso de bufferedAmount, bufferedAmountLowThreshold, onbufferedamountlow y bufferedamountlow aqu&iacute; &gt;&gt;&gt;</strong>
ko: <strong>&lt;&lt;&lt; bufferedAmount, bufferedAmountLowThreshold, onbufferedamountlow 및 bufferedamountlow 사용에 대한 추가 정보 &gt;&gt;&gt;</strong>
ru: <strong>&lt;&lt;&lt; подробнее об использовании bufferedAmount, bufferedAmountLowThreshold, onbufferedamountlow и bufferedamountlow здесь &gt;&gt;&gt;</strong>
zh_cn: <strong>&lt;&lt;&lt;此处更多有关使用bufferedAmount，bufferedAmountLowThreshold，onbufferedamountlow和bufferedamountlow的信息&gt;&gt;&gt;</strong>

source: <strong><a href="http://mdn.github.io/canvas-raycaster/">Open in new window</a></strong>
es: <strong><a href="http://mdn.github.io/canvas-raycaster/">Abrir en Nueva ventana</a></strong>
ko: <strong><a href="http://mdn.github.io/canvas-raycaster/">새창에서 열기</a></strong>
ru: <strong><a href="http://mdn.github.io/canvas-raycaster/">Открыть в новом окне</a></strong>
zh_cn: <strong><a href="http://mdn.github.io/canvas-raycaster/">在新窗口中打开</a></strong>

source: <strong><a href="https://developer.mozilla.org/en-US/docs/Web/API/SVGCircleElement/cy"><code>SVGCircleElement.cy</code></a></strong>Read only
es: <strong><a href="https://developer.mozilla.org/en-US/docs/Web/API/SVGCircleElement/cy"> <code>SVGCircleElement.cy</code> </a></strong> Solo lectura
ko: <strong><a href="https://developer.mozilla.org/en-US/docs/Web/API/SVGCircleElement/cy"> <code>SVGCircleElement.cy</code> </a></strong> 읽기 전용
ru: <strong><a href="https://developer.mozilla.org/en-US/docs/Web/API/SVGCircleElement/cy"> <code>SVGCircleElement.cy</code> </a></strong> Только для чтения
zh_cn: <strong><a href="https://developer.mozilla.org/en-US/docs/Web/API/SVGCircleElement/cy"> <code>SVGCircleElement.cy</code> </a></strong>只读

source: <strong><a href="https://developer.mozilla.org/en-US/docs/Web/API/SVGCircleElement/r"><code>SVGCircleElement.r</code></a></strong>Read only
es: <strong><a href="https://developer.mozilla.org/en-US/docs/Web/API/SVGCircleElement/r"> <code>SVGCircleElement.r</code> </a></strong> Solo lectura
ko: <strong><a href="https://developer.mozilla.org/en-US/docs/Web/API/SVGCircleElement/r"> <code>SVGCircleElement.r</code> </a></strong> 읽기 전용
ru: <strong><a href="https://developer.mozilla.org/en-US/docs/Web/API/SVGCircleElement/r"> <code>SVGCircleElement.r</code> </a></strong> Только для чтения
zh_cn: <strong><a href="https://developer.mozilla.org/en-US/docs/Web/API/SVGCircleElement/r"> <code>SVGCircleElement.r</code> </a></strong>只读

source: <strong><a href="https://github.com/mdn/browser-compat-data">We're converting our compatibility data into a machine-readable JSON format</a></strong>. This compatibility table still uses the old format, because we haven't yet converted the data it contains. <strong><a href="https://developer.mozilla.org/en-US/docs/MDN/Contribute/Structures/Compatibility_tables">Find out how you can help!</a></strong>
es: <strong><a href="https://github.com/mdn/browser-compat-data">Estamos convirtiendo nuestros datos de compatibilidad a un formato JSON legible por m&aacute;quina</a></strong> . Esta tabla de compatibilidad todav&iacute;a usa el formato anterior, porque a&uacute;n no hemos convertido los datos que contiene. <strong><a href="https://developer.mozilla.org/en-US/docs/MDN/Contribute/Structures/Compatibility_tables">&iexcl;Descubre c&oacute;mo puedes ayudar!</a></strong>
ko: <strong><a href="https://github.com/mdn/browser-compat-data">호환성 데이터를 기계가 읽을 수있는 JSON 형식으로 변환하고</a></strong> 있습니다. 이 호환성 테이블은 아직 포함 된 데이터를 변환하지 않았기 때문에 여전히 이전 형식을 사용합니다. <strong><a href="https://developer.mozilla.org/en-US/docs/MDN/Contribute/Structures/Compatibility_tables">어떻게 도울 수 있는지 알아보십시오!</a></strong>
ru: <strong><a href="https://github.com/mdn/browser-compat-data">Мы конвертируем данные о совместимости в машиночитаемый формат JSON</a></strong> . Эта таблица совместимости все еще использует старый формат, потому что мы еще не преобразовали содержащиеся в ней данные. <strong><a href="https://developer.mozilla.org/en-US/docs/MDN/Contribute/Structures/Compatibility_tables">Узнайте, как вы можете помочь!</a></strong>
zh_cn: <strong><a href="https://github.com/mdn/browser-compat-data">我们正在将兼容性数据转换为机器可读的JSON格式</a></strong>。该兼容性表仍使用旧格式，因为我们尚未转换它包含的数据。<strong><a href="https://developer.mozilla.org/en-US/docs/MDN/Contribute/Structures/Compatibility_tables">了解如何提供帮助！</a></strong>

source: <strong><a href="touch/clientx"><code>Touch.clientX</code></a> </strong>Read only
es: <strong><a href="touch/clientx"> <code>Touch.clientX</code> </a> </strong> Solo lectura
ko: <strong><a href="touch/clientx"> <code>Touch.clientX</code> </a> </strong> 읽기 전용
ru: <strong><a href="touch/clientx"> <code>Touch.clientX</code> </a> </strong> только для чтения
zh_cn: <strong><a href="touch/clientx"> <code>Touch.clientX</code> </a> </strong>只读

source: <strong><a href="touch/clienty"><code>Touch.clientY</code></a> </strong>Read only
es: <strong><a href="touch/clienty"> <code>Touch.clientY</code> </a> </strong> Solo lectura
ko: <strong><a href="touch/clienty"> <code>Touch.clientY</code> </a> </strong> 읽기 전용
ru: <strong><a href="touch/clienty"> <code>Touch.clientY</code> </a> </strong> только для чтения
zh_cn: <strong><a href="touch/clienty"> <code>Touch.clientY</code> </a> </strong>只读

source: <strong><a href="touch/screenx"><code>Touch.screenX</code></a> </strong>Read only
es: <strong><a href="touch/screenx"> <code>Touch.screenX</code> </a> </strong> Solo lectura
ko: <strong><a href="touch/screenx"> <code>Touch.screenX</code> </a> </strong> 읽기 전용
ru: <strong><a href="touch/screenx"> <code>Touch.screenX</code> </a> </strong> Только для чтения
zh_cn: <strong><a href="touch/screenx"> <code>Touch.screenX</code> </a> </strong>只读

source: <strong><a href="touch/screeny"><code>Touch.screenY</code></a> </strong>Read only
es: <strong><a href="touch/screeny"> <code>Touch.screenY</code> </a> </strong> Solo lectura
ko: <strong><a href="touch/screeny"> <code>Touch.screenY</code> </a> </strong> 읽기 전용
ru: <strong><a href="touch/screeny"> <code>Touch.screenY</code> </a> </strong> только для чтения
zh_cn: <strong><a href="touch/screeny"> <code>Touch.screenY</code> </a> </strong>只读

source: <strong><code>maxPacketLifeTime</code> Optional</strong>
es: <strong> <code>maxPacketLifeTime</code> Opcional</strong>
ko: <strong> <code>maxPacketLifeTime</code> 옵션</strong>
ru: <strong> <code>maxPacketLifeTime</code> Необязательно</strong>
zh_cn: <strong> <code>maxPacketLifeTime</code> 可选</strong>
