Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/dom/dom.*.007.xlf
Languages: es, ko, ru, zh_cn

source: <strong><dfn><code>closed</code></dfn></strong>: The <a href="https://www.w3.org/TR/presentation-api/#dfn-presentation-connection">presentation connection</a> has been closed or could not be opened. The connection may be reopened by calling <code><a href="https://www.w3.org/TR/presentation-api/#dom-presentationrequest-reconnect"><code>reconnect</code></a>()</code>. No communication is possible in this state.
es: <strong><dfn> <code>closed</code> </dfn></strong> : la<a href="https://www.w3.org/TR/presentation-api/#dfn-presentation-connection">conexi&oacute;n de presentaci&oacute;n</a>se ha cerrado o no se pudo abrir. La conexi&oacute;n se puede volver a abrir llamando a <code><a href="https://www.w3.org/TR/presentation-api/#dom-presentationrequest-reconnect"><code>reconnect</code></a>()</code> . No es posible la comunicaci&oacute;n en este estado.
ko: <strong><dfn> <code>closed</code> </dfn></strong> :<a href="https://www.w3.org/TR/presentation-api/#dfn-presentation-connection">프레젠테이션 연결</a>이 닫혔거나 열 수 없습니다. <code><a href="https://www.w3.org/TR/presentation-api/#dom-presentationrequest-reconnect"><code>reconnect</code></a>()</code> 를 호출하여 연결을 다시 열 수 있습니다. 이 상태에서는 통신이 불가능합니다.
ru: <strong><dfn> <code>closed</code> </dfn></strong> :<a href="https://www.w3.org/TR/presentation-api/#dfn-presentation-connection">подключение к презентации</a>было закрыто или не может быть открыто. Соединение может быть <code><a href="https://www.w3.org/TR/presentation-api/#dom-presentationrequest-reconnect"><code>reconnect</code></a>()</code> помощью вызова recnect (). В этом состоянии общение невозможно.
zh_cn: <strong><dfn> <code>closed</code> </dfn></strong>：<a href="https://www.w3.org/TR/presentation-api/#dfn-presentation-connection">演示文稿连接</a>已关闭或无法打开。可以通过调用 <code><a href="https://www.w3.org/TR/presentation-api/#dom-presentationrequest-reconnect"><code>reconnect</code></a>()</code> 重新打开连接。在这种状态下无法进行通讯。

source: <strong><dfn><code>connected</code></dfn></strong>: The <a href="https://www.w3.org/TR/presentation-api/#dfn-presentation-connection">presentation connection</a> is established and communication is possible.
es: <strong><dfn> <code>connected</code> </dfn></strong> :se establece la<a href="https://www.w3.org/TR/presentation-api/#dfn-presentation-connection">conexi&oacute;n de presentaci&oacute;n</a>y es posible la comunicaci&oacute;n.
ko: <strong><dfn> <code>connected</code> </dfn></strong> :<a href="https://www.w3.org/TR/presentation-api/#dfn-presentation-connection">프리젠 테이션 연결</a>이 설정되고 통신이 가능합니다.
ru: <strong><dfn> <code>connected</code> </dfn></strong> :<strong><dfn> подключение к</dfn></strong><a href="https://www.w3.org/TR/presentation-api/#dfn-presentation-connection"> презентации</a>установлено и связь возможна.
zh_cn: <strong><dfn> <code>connected</code> </dfn></strong>：建立<a href="https://www.w3.org/TR/presentation-api/#dfn-presentation-connection">演示连接</a>，并且可以进行通信。

source: <strong><dfn><code>connecting</code></dfn></strong>: The user agent is attempting to <a href="https://www.w3.org/TR/presentation-api/#dfn-establish-a-presentation-connection">establish a presentation connection</a> with the <a href="https://www.w3.org/TR/presentation-api/#dfn-destination-browsing-context">destination browsing context</a>. This is the initial state when a <a href="https://www.w3.org/TR/presentation-api/#idl-def-presentationconnection"><code>PresentationConnection</code></a> object is created.
es: <strong><dfn> <code>connecting</code> </dfn></strong> : El agente de usuario est&aacute; intentando<a href="https://www.w3.org/TR/presentation-api/#dfn-establish-a-presentation-connection">establecer una conexi&oacute;n de presentaci&oacute;n</a>con el<a href="https://www.w3.org/TR/presentation-api/#dfn-destination-browsing-context">contexto de navegaci&oacute;n de destino</a>. Este es el estado inicial cuandose creaunobjeto<a href="https://www.w3.org/TR/presentation-api/#idl-def-presentationconnection"> <code>PresentationConnection</code> </a> .
ko: <strong><dfn> <code>connecting</code> </dfn></strong> : 사용자 에이전트가<a href="https://www.w3.org/TR/presentation-api/#dfn-destination-browsing-context">대상 찾아보기 컨텍스트</a>와<a href="https://www.w3.org/TR/presentation-api/#dfn-establish-a-presentation-connection">프리젠 테이션 연결</a>을설정하려고합니다. <a href="https://www.w3.org/TR/presentation-api/#idl-def-presentationconnection"> <code>PresentationConnection</code> </a> 객체가 생성될 때의 초기 상태입니다.
ru: <strong><dfn> <code>connecting</code> </dfn></strong> : пользовательский агент пытается<a href="https://www.w3.org/TR/presentation-api/#dfn-establish-a-presentation-connection">установить соединение презентации</a>с<a href="https://www.w3.org/TR/presentation-api/#dfn-destination-browsing-context">контекстом просмотра назначения</a>. Это начальное состояние при созданииобъекта<a href="https://www.w3.org/TR/presentation-api/#idl-def-presentationconnection"> <code>PresentationConnection</code> </a> .
zh_cn: <strong><dfn> <code>connecting</code> </dfn></strong>：用户代理正在尝试与<a href="https://www.w3.org/TR/presentation-api/#dfn-destination-browsing-context">目标浏览上下文</a><a href="https://www.w3.org/TR/presentation-api/#dfn-establish-a-presentation-connection">建立演示连接</a>。这是创建<a href="https://www.w3.org/TR/presentation-api/#idl-def-presentationconnection"> <code>PresentationConnection</code> </a>对象时的初始状态。

source: <strong><dfn><code>terminated</code></dfn></strong>: The <a href="https://www.w3.org/TR/presentation-api/#dfn-receiving-browsing-context">receiving browsing context</a> has terminated. Any <a href="https://www.w3.org/TR/presentation-api/#dfn-presentation-connection">presentation connection</a> to that <a href="https://www.w3.org/TR/presentation-api/#dfn-presentation">presentation</a> has also terminated and cannot be reopened. No communication is possible.
es: <strong><dfn> <code>terminated</code> </dfn></strong> : el<a href="https://www.w3.org/TR/presentation-api/#dfn-receiving-browsing-context">contexto de navegaci&oacute;n de recepci&oacute;n</a>ha terminado. Cualquier<a href="https://www.w3.org/TR/presentation-api/#dfn-presentation-connection">conexi&oacute;n de presentaci&oacute;n</a>a esa<a href="https://www.w3.org/TR/presentation-api/#dfn-presentation">presentaci&oacute;n</a>tambi&eacute;n ha finalizado y no se puede volver a abrir. No es posible la comunicaci&oacute;n.
ko: <strong><dfn> <code>terminated</code> </dfn></strong> :<a href="https://www.w3.org/TR/presentation-api/#dfn-receiving-browsing-context">수신 브라우징 컨텍스트</a>가 종료되었습니다. 모든<a href="https://www.w3.org/TR/presentation-api/#dfn-presentation-connection">프리젠 테이션 연결</a>것과<a href="https://www.w3.org/TR/presentation-api/#dfn-presentation">프레젠테이션</a>도 종료하고 다시 열 수 없습니다. 통신이 불가능합니다.
ru: <strong><dfn> <code>terminated</code> </dfn></strong> :<a href="https://www.w3.org/TR/presentation-api/#dfn-receiving-browsing-context">получение контекста просмотра</a>прекращено. Любое<a href="https://www.w3.org/TR/presentation-api/#dfn-presentation-connection">подключение</a>к этой<a href="https://www.w3.org/TR/presentation-api/#dfn-presentation">презентации</a>также было разорвано и не может быть повторно открыто. Общение невозможно.
zh_cn: <strong><dfn> <code>terminated</code> </dfn></strong>：<a href="https://www.w3.org/TR/presentation-api/#dfn-receiving-browsing-context">接收的浏览上下文</a>已终止。与该<a href="https://www.w3.org/TR/presentation-api/#dfn-presentation">演示文稿的</a>任何<a href="https://www.w3.org/TR/presentation-api/#dfn-presentation-connection">演示文稿连接</a>也已终止，无法重新打开。无法进行通讯。

source: <strong><dfn>credentialId</dfn></strong> (variable length) - A unqiue identifier for this credential so that it can be requested for future authentications. The credential is "
es: <strong><dfn>credentialId</dfn></strong> (longitud variable): un identificador &uacute;nico para esta credencial para que se pueda solicitar para futuras autenticaciones. La credencial es "
ko: <strong><dfn>credentialId</dfn></strong> (가변 길이)-이 인증 정보가 향후 인증을 위해 요청 될 수 있도록 비 qiue 식별자입니다. 자격 증명은 "
ru: <strong><dfn>credentialId</dfn></strong> (переменная длина) - уникальный идентификатор для этих учетных данных, чтобы его можно было запрашивать для будущих аутентификаций. Полномочия есть
zh_cn: <strong><dfn>credentialId</dfn></strong>（可变长度）-此证书的唯一标识符，以便将来进行身份验证时可以请求它。凭据是&ldquo;

source: <strong><dfn>credentialIdLength</dfn></strong> (2 bytes) - The length of the credential ID that immediately follows these bytes.
es: <strong><dfn>credentialIdLength</dfn></strong> (2 bytes): la longitud del ID de credencial que sigue inmediatamente a estos bytes.
ko: <strong><dfn>credentialIdLength</dfn></strong> (2 bytes)-이 바이트 바로 뒤에 오는 자격 증명 ID의 길이입니다.
ru: <strong><dfn>credentialIdLength</dfn></strong> (2 байта) - длина идентификатора удостоверения, который следует сразу за этими байтами.
zh_cn: <strong><dfn>credentialIdLength</dfn></strong>（2个字节）-紧随这些字节之后的凭证ID的长度。

source: <strong><em>If you can see this, scrollTop is &gt; 0</em></strong>
es: <strong><em>Si puede ver esto, scrollTop es&gt; 0</em></strong>
ko: <strong><em>이것을 볼 수 있으면 scrollTop은&gt; 0입니다.</em></strong>
ru: <strong><em>Если вы видите это, scrollTop равен&gt; 0</em></strong>
zh_cn: <strong><em>如果您看到此内容，则scrollTop为&gt; 0</em></strong>

source: <strong><em>If you can see this, scrollTop is maxed-out</em></strong>
es: <strong><em>Si puede ver esto, scrollTop est&aacute; maximizado</em></strong>
ko: <strong><em>이것을 볼 수 있으면 scrollTop이 최대가됩니다</em></strong>
ru: <strong><em>Если вы можете видеть это, scrollTop максимально</em></strong>
zh_cn: <strong><em>如果您可以看到此内容，则scrollTop已最大化</em></strong>

source: <strong><em>Note</em>: </strong>This interface and its members are available in <a href="web_workers_api">Web Workers</a>, except where indicated below. Also note that performance markers and measures are per context. If you create a mark on the main thread (or other worker), you cannot see it in a worker thread, and vice versa.
es: <strong><em>Nota</em> :</strong> Esta interfaz y sus miembros est&aacute;n disponibles en<a href="web_workers_api"> Web Workers</a> , excepto donde se indica a continuaci&oacute;n. Tambi&eacute;n tenga en cuenta que los marcadores de rendimiento y las medidas son por contexto. Si crea una marca en el hilo principal (u otro trabajador), no puede verla en un hilo de trabajo, y viceversa.
ko: <strong><em>참고</em> :</strong> 이 인터페이스 및 해당 멤버는아래에 표시된 경우를 제외하고<a href="web_workers_api"> 웹 워커</a> 에서 사용할 수있습니다. 또한 성과 지표와 측정 값은 상황에 따라 다릅니다. 주 스레드 (또는 다른 작업자)에 마크를 만들면 작업자 스레드에서 마크를 볼 수 없으며 그 반대도 마찬가지입니다.
ru: <strong><em>Примечание</em> .</strong> Этот интерфейс и его члены доступны в<a href="web_workers_api"> Web Workers</a> , кроме случаев, указанных ниже. Также обратите внимание, что показатели эффективности и показатели указаны для каждого контекста. Если вы создаете метку в главном потоке (или другом работнике), вы не сможете увидеть ее в рабочем потоке, и наоборот.
zh_cn: <strong><em>注意</em>：</strong>该接口及其成员在<a href="web_workers_api"> Web Workers</a>中可用，除非以下指示。还要注意，绩效指标和衡量指标是根据具体情况而定的。如果在主线程（或其他工作线程）上创建标记，则无法在工作线程中看到它，反之亦然。

source: <strong><em>This feature has been removed. Please fix your Web sites and applications</em></strong>.
es: <strong><em>Esta caracter&iacute;stica ha sido eliminada. Por favor arregle sus sitios web y aplicaciones</em></strong> .
ko: <strong><em>이 기능은 제거되었습니다. 웹 사이트 및 응용 프로그램을 수정하십시오</em></strong> .
ru: <strong><em>Эта функция была удалена. Пожалуйста, исправьте ваши веб-сайты и приложения</em></strong> .
zh_cn: <strong><em>此功能已被删除。请修复您的网站和应用程序</em></strong>。

source: <strong><em>descriptions, candidates, etc. -- more coming up</em></strong>
es: <strong><em>descripciones, candidatos, etc. - m&aacute;s por venir</em></strong>
ko: <strong><em>설명, 후보 등</em></strong>
ru: <strong><em>описания, кандидаты и т. д.</em></strong>
zh_cn: <strong><em>说明，候选人等-还会有更多</em></strong>

source: <strong><var>intViewportWidth</var></strong> stores the <code>window.innerWidth</code> property value.
es: <strong> <var>intViewportWidth</var> </strong> almacena elvalor de la propiedad <code>window.innerWidth</code> .
ko: <strong> <var>intViewportWidth</var> </strong> 는 <code>window.innerWidth</code> 속성 값을저장합니다.
ru: <strong> <var>intViewportWidth</var> </strong> хранит <code>window.innerWidth</code> свойства window.innerWidth .
zh_cn: <strong> <var>intViewportWidth</var> </strong>存储 <code>window.innerWidth</code> 属性值。

source: <strong>A facial expression tracker (experimental)</strong>: Researchers at the University of Southern California and Facebook&rsquo;s Oculus division have been testing new ways of tracking facial expressions and transferring them to a virtual character.
es: <strong>Un rastreador de expresiones faciales (experimental)</strong> : Investigadores de la Universidad del Sur de California y la divisi&oacute;n Oculus de Facebook han estado probando nuevas formas de rastrear expresiones faciales y transferirlas a un personaje virtual.
ko: <strong>얼굴 표정 추적기 (실험)</strong> : 남부 캘리포니아 대학교 (University of Southern California)와 페이스 북의 오큘 러스 (Oculus) 부서의 연구원들은 얼굴 표정을 추적하고 가상의 인물로 옮기는 새로운 방법을 테스트하고 있습니다.
ru: <strong>Трекер выражений лица (экспериментальный)</strong> : Исследователи из Университета Южной Калифорнии и подразделения Oculus в Facebook тестируют новые способы отслеживания выражений лица и передачи их виртуальному персонажу.
zh_cn: <strong>面部表情跟踪器（实验）</strong>：南加州大学和Facebook的Oculus部门的研究人员正在测试追踪面部表情并将其转换为虚拟角色的新方法。

source: <strong>A gamepad</strong>: We can configurate an XBox controller or similar to work as a keyboard in the browser &mdash; this offers further possibilities of interaction with a VR webpage. There are some gamepads that work with a mobile setup &mdash; like the <a href="http://www.mergevr.com/">MergeVR headset</a> &mdash; but these are connected via Bluetooth so don't work with WebVR.
es: <strong>Un gamepad</strong> : podemos configurar un controlador XBox o similar para que funcione como un teclado en el navegador; esto ofrece m&aacute;s posibilidades de interacci&oacute;n con una p&aacute;gina web de realidad virtual. Hay algunos gamepads que funcionan con una configuraci&oacute;n m&oacute;vil, como los <a href="http://www.mergevr.com/">auriculares MergeVR</a> , pero est&aacute;n conectados a trav&eacute;s de Bluetooth, por lo que no funcionan con WebVR.
ko: <strong>게임 패드</strong> : 브라우저에서 키보드로 작동하도록 XBox 컨트롤러 또는 이와 유사한 기능을 구성 할 수 있습니다. 이는 VR 웹 페이지와의 상호 작용 가능성을 제공합니다. <a href="http://www.mergevr.com/">MergeVR 헤드셋</a> 과 같은 모바일 설정에서 작동하는 일부 게임 패드가 있지만 Bluetooth를 통해 연결되어 있으므로 WebVR에서 작동하지 않습니다.
ru: <strong>Геймпад</strong> : мы можем настроить контроллер XBox или аналогичный для работы в качестве клавиатуры в браузере - это открывает дополнительные возможности взаимодействия с веб-страницей виртуальной реальности. Есть некоторые <a href="http://www.mergevr.com/">игровые планшеты,</a> которые работают с мобильной установкой, например, с гарнитурой MergeVR, но они подключены через Bluetooth, поэтому не работают с WebVR.
zh_cn: <strong>游戏手柄</strong>：我们可以配置XBox控制器或类似的控件，使其在浏览器中充当键盘-这提供了与VR网页进行交互的更多可能性。有些游戏手柄可以与移动设备配合使用，例如<a href="http://www.mergevr.com/">MergeVR耳机</a>，但它们通过蓝牙连接，因此不能与WebVR一起使用。

source: <strong>A hand recognition sensor</strong>: A sensor that tracks the position and movement of your hand, allowing it to become an interesting controller, and an object in VR gameworlds. The most advanced to date is the <a href="https://www.leapmotion.com/">Leap Motion</a>, which works with the computer (connected to the Oculus Rift) and can also work connected to a mobile device (the latter is in an experimental phase.)
es: <strong>Un sensor de reconocimiento de manos</strong> : un sensor que rastrea la posici&oacute;n y el movimiento de su mano, lo que le permite convertirse en un controlador interesante y un objeto en los mundos de juego de realidad virtual. El m&aacute;s avanzado hasta la fecha es <a href="https://www.leapmotion.com/">Leap Motion</a> , que funciona con la computadora (conectada al Oculus Rift) y tambi&eacute;n puede funcionar conectado a un dispositivo m&oacute;vil (este &uacute;ltimo se encuentra en una fase experimental).
ko: <strong>손 인식 센서</strong> : <strong>손</strong> 의 위치와 움직임을 추적하여 재미있는 컨트롤러가되고 VR 게임 세계의 물체가 될 수있는 센서입니다. 가장 진보 된 <a href="https://www.leapmotion.com/">Leap Motion</a> 은 컴퓨터와 함께 작동하며 (Oculus Rift에 연결됨) 모바일 장치에 연결되어 작동 할 수 있습니다 (후자는 실험 단계에 있습니다).
ru: <strong>Датчик распознавания руки</strong> : датчик, который отслеживает положение и движение вашей руки, позволяя ей стать интересным контроллером и объектом в игровых мирах виртуальной реальности. Наиболее продвинутым на сегодняшний день является <a href="https://www.leapmotion.com/">Leap Motion</a> , который работает с компьютером (подключенным к Oculus Rift), а также может работать с мобильным устройством (последнее находится в экспериментальной фазе).
zh_cn: <strong>手势识别传感器</strong>：一种传感器，可跟踪您的手的位置和运动，使其成为有趣的控制器，并成为VR游戏世界中的对象。迄今为止，最先进的技术是<a href="https://www.leapmotion.com/">Leap Motion</a>，它可以与计算机（连接到Oculus Rift）一起使用，也可以与移动设备连接（后者处于实验阶段）。

source: <strong>A more complex positional sensor system</strong>: As an example, the HTC VIVE features two position sensors that sit in opposite corners of a space, mapping it all out and allowing VR experiences to be enjoyed in spaces of up to 5m x 5m.
es: <strong>Un sistema de sensor de posici&oacute;n m&aacute;s complejo</strong> : como ejemplo, el HTC VIVE presenta dos sensores de posici&oacute;n que se ubican en las esquinas opuestas de un espacio, lo mapean todo y permiten disfrutar de experiencias de realidad virtual en espacios de hasta 5m x 5m.
ko: <strong>보다 복잡한 위치 센서 시스템</strong> : 예를 들어, HTC VIVE는 공간의 반대편 구석에 위치하는 두 개의 위치 센서를 갖추고있어 모든 것을 매핑하고 최대 5m x 5m의 공간에서 VR 경험을 즐길 수 있습니다.
ru: <strong>Более сложная система позиционных датчиков</strong> . Например, в HTC VIVE есть два датчика положения, которые расположены в противоположных углах пространства, отображая их все и позволяя наслаждаться впечатлениями от VR в пространствах размером до 5 х 5 м.
zh_cn: <strong>更加复杂的位置传感器系统</strong>：例如，HTC VIVE的两个位置传感器位于空间的相对角，将它们全部映射出来，并允许在最大5m x 5m的空间中享受VR体验。

source: <strong>AAGUID</strong> (16 bytes) - Authenticator Attestation Globally Unique Identifier, a unique number that identifies the model of the authenticator (not the specific instance of the authenticator) so that a relying party can understand the characteristics of the authenticator by looking up its metadata statement.
es: <strong>AAGUID</strong> (16 bytes): identificador globalmente &uacute;nico de la <strong>atestaci&oacute;n del</strong> autenticador, un n&uacute;mero &uacute;nico que identifica el modelo del autenticador (no la instancia espec&iacute;fica del autenticador) para que una parte que conf&iacute;a pueda comprender las caracter&iacute;sticas del autenticador al buscar su declaraci&oacute;n de metadatos.
ko: <strong>AAGUID</strong> (16 바이트)-인증 자 증명 Globally Unique Identifier ( <strong>신뢰할</strong> 수있는 인증 자) (인증 자의 특정 인스턴스가 아닌) 인증 자 모델을 식별하여 신뢰 당사자가 메타 데이터 문을 찾아 인증 자의 특성을 이해할 수 있도록하는 고유 번호입니다.
ru: <strong>AAGUID</strong> (16 байт) - глобальный уникальный идентификатор <strong>аттестатора</strong> аутентификатора, уникальный номер, который идентифицирует модель аутентификатора (не конкретный экземпляр аутентификатора), чтобы проверяющая сторона могла понять характеристики аутентификатора, просматривая его оператор метаданных.
zh_cn: <strong>AAGUID</strong>（16字节）-身份验证者证明全局唯一标识符，一个唯一的数字，用于标识身份验证者的模型（不是身份验证者的特定实例），以便依赖方可以通过查找其元数据语句来了解身份验证者的特征。

source: <strong>Accessibility</strong>: As the browser controls the input elements of the payment sheet, it can assure consistent keyboard and screen reader accessibility on every website without developers needing to do anything. A browser could also adjust the font size or color contrast of the payment sheet, making it more comfortable for the user to make a payment.
es: <strong>Accesibilidad</strong> : a medida que el navegador controla los elementos de entrada de la hoja de pago, puede garantizar la accesibilidad constante del teclado y el lector de pantalla en cada sitio web sin que los desarrolladores tengan que hacer nada. Un navegador tambi&eacute;n podr&iacute;a ajustar el tama&ntilde;o de fuente o el contraste de color de la hoja de pago, haciendo que sea m&aacute;s c&oacute;modo para el usuario realizar un pago.
ko: <strong>접근성</strong> : 브라우저가 결제 시트의 입력 요소를 제어하므로 개발자가 별도의 조치를 취하지 않아도 모든 웹 사이트에서 일관된 키보드 및 화면 판독기 접근성을 보장 할 수 있습니다. 또한 브라우저는 지불 시트의 글꼴 크기 또는 색상 대비를 조정하여 사용자가 지불하기에 더 편합니다.
ru: <strong>Доступность</strong> : поскольку браузер контролирует элементы ввода платежной ведомости, он может обеспечить постоянную доступность клавиатуры и программы чтения с экрана на каждом веб-сайте без необходимости что-либо делать разработчикам. Браузер также может регулировать размер шрифта или цветовой контраст платежной ведомости, чтобы пользователю было удобнее осуществлять платеж.
zh_cn: <strong>可访问性</strong>：由于浏览器控制着付款单的输入元素，因此可以确保每个网站上一致的键盘和屏幕阅读器可访问性，而开发人员无需执行任何操作。浏览器还可以调整付款表的字体大小或颜色对比度，使用户更方便地进行付款。

source: <strong>Always specify an exact target origin, not <code>*</code>, when you use <code>postMessage</code> to send data to other windows.</strong> A malicious site can change the location of the window without your knowledge, and therefore it can intercept the data sent using <code>postMessage</code>.
es: <strong>Siempre especifique un origen de destino exacto, no <code>*</code> , cuando use <code>postMessage</code> para enviar datos a otras ventanas. </strong>Un sitio malicioso puede cambiar la ubicaci&oacute;n de la ventana sin su conocimiento y, por lo tanto, puede interceptar los datos enviados mediante <code>postMessage</code> .
ko: <strong> <code>postMessage</code> 를 사용 하여 다른 창으로 데이터를 보낼 때는 항상 <code>*</code> 가 아닌 정확한 대상 원점을 지정하십시오 . </strong>악의적 인 사이트는 사용자 모르게 창의 위치를 ​​변경할 수 있으므로 <code>postMessage</code> 를 사용하여 전송 된 데이터를 가로 챌 수 있습니다 .
ru: <strong>Всегда указывайте точное целевое происхождение, а не <code>*</code> , когда вы используете <code>postMessage</code> для отправки данных в другие окна. </strong>Вредоносный сайт может изменить местоположение окна без вашего ведома, и поэтому он может перехватывать данные, отправленные с помощью <code>postMessage</code> .
zh_cn: <strong>使用 <code>postMessage</code> 将数据发送到其他窗口时，请始终指定确切的目标来源，而不是 <code>*</code> 。</strong>恶意站点可能在您不知情的情况下更改窗口的位置，因此它可以拦截使用 <code>postMessage</code> 发送的数据。

source: <strong>Ambient light</strong> is the light that permeates the scene; it's non-directional and affects every face in the scene equally, regardless of which direction it's facing.
es: <strong>La luz ambiental</strong> es la luz que impregna la escena; no es direccional y afecta a todas las caras de la escena por igual, independientemente de la direcci&oacute;n que est&eacute; mirando.
ko: <strong>앰비언트 라이트</strong> 는 장면에 스며드는 라이트입니다. 방향이 없으며 방향이 무엇이든 관계없이 장면의 모든 얼굴에 동일하게 영향을줍니다.
ru: <strong>Окружающий свет</strong> - это свет, который пронизывает сцену; он ненаправленный и одинаково влияет на каждое лицо в сцене, независимо от того, в каком направлении он смотрит.
zh_cn: <strong>环境光是</strong>穿透场景的光。它是无方向性的，并且无论其面向哪个方向，均等地影响场景中的每个面孔。

source: <strong>An eye tracking sensor (experimental)</strong>: The FOVE project is the first headset that reads subtle eye movements.
es: <strong>Un sensor de seguimiento ocular (experimental)</strong> : el proyecto FOVE es el primer auricular que lee movimientos oculares sutiles.
ko: <strong>안구 추적 센서 (실험)</strong> : FOVE 프로젝트는 미묘한 안구 움직임을 읽는 첫 번째 헤드셋입니다.
ru: <strong>Датчик слежения за глазами (экспериментальный)</strong> : проект FOVE - это первая гарнитура, которая считывает тонкие движения глаз.
zh_cn: <strong>眼动追踪传感器（实验性）</strong>：FOVE项目是第一个读取细微眼动的耳机。
