Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/dom/dom.*.011.xlf
Languages: ja, ko, ru, zh_cn

source: Adds an HTML block-level element around the line containing the current selection, replacing the block element containing the line if one exists (in Firefox, <a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/blockquote"><code>&lt;blockquote&gt;</code></a> is the exception &mdash; it will wrap any containing block element). Requires a tag-name string as a value argument. Virtually all block-level elements can be used. (Internet Explorer and Edge support only heading tags <code>H1</code>&ndash;<code>H6</code>, <code>ADDRESS</code>, and <code>PRE</code>, which must be wrapped in angle brackets, such as <code>"&lt;H1&gt;"</code>.)
ja: 現在の選択を含む行の周りにHTMLブロックレベルの要素を追加します。行を含むブロック要素が存在する場合は置き換えます（Firefoxでは、<a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/blockquote"> <code>&lt;blockquote&gt;</code> </a>は例外です。含まれているすべてのブロック要素をラップします）。値の引数としてタグ名文字列が必要です。事実上すべてのブロックレベルの要素を使用できます。 （Internet Explorerとエッジサポートのみ見出しタグ <code>H1</code> - <code>H6</code> 、 <code>ADDRESS</code> 、および <code>PRE</code> などの角括弧に包まれなければならない、 <code>"&lt;H1&gt;"</code> ）。
ko: 현재 선택을 포함하는 행 주위에 HTML 블록 레벨 요소를 추가하고 행을 포함하는 블록 요소가있는 경우 해당 요소를 대체합니다 (Firefox에서 <a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/blockquote"> <code>&lt;blockquote&gt;</code> </a> 는 예외입니다. 포함하는 모든 블록 요소를 래핑합니다). 값 인수로 태그 이름 문자열이 필요합니다. 사실상 모든 블록 레벨 요소를 사용할 수 있습니다. Internet Explorer 및 Edge는 제목 태그 <code>H1</code> &ndash; <code>H6</code> , <code>ADDRESS</code> 및 <code>PRE</code> 만 지원하며 , <code>"&lt;H1&gt;"</code> 과 같이 꺾쇠 괄호로 묶어야 합니다.
ru: Добавляет элемент уровня блока HTML вокруг строки, содержащей текущий выбор, заменяя элемент блока, содержащий строку, если он существует (в Firefox <a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/blockquote"> <code>&lt;blockquote&gt;</code> </a> является исключением - он переносит любой содержащий элемент блока). Требуется строка имени тега в качестве аргумента значения. Практически все элементы уровня блока могут быть использованы. (Internet Explorer и Edge поддерживают только заголовочные теги <code>H1</code> - <code>H6</code> , <code>ADDRESS</code> и <code>PRE</code> , которые должны быть заключены в угловые скобки, например, <code>"&lt;H1&gt;"</code> .)
zh_cn: 在包含当前选择的行周围添加一个HTML块级元素，如果存在则替换包含该行的block元素（在Firefox中，<a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/blockquote"> <code>&lt;blockquote&gt;</code> </a>是一个例外，它将包装所有包含的block元素）。需要一个标记名字符串作为值参数。几乎所有块级元素都可以使用。 （Internet Explorer和Edge仅支持标题标签 <code>H1</code> - <code>H6</code> ， <code>ADDRESS</code> 和 <code>PRE</code> ，它们必须用尖括号括起来，例如 <code>"&lt;H1&gt;"</code> 。）

source: Adds an arc to the path which is centered at (<code>x, y</code>) position with radius<code>r</code> starting at <code>startAngle</code> and ending at <code>endAngle</code> going in the given direction by <code>anticlockwise</code> (defaulting to clockwise).
ja: （を中心とするパスに弧を追加し <code>x, y</code> 半径を有する）位置 <code>r</code> から始まる <code>startAngle</code> のとで終わる <code>endAngle</code> によって一定方向に向かう <code>anticlockwise</code> （時計回りにデフォルト設定）。
ko: <code>startAngle</code> 에서 시작 하고 <code>endAngle</code> 에서 주어진 방향으로 <code>anticlockwise</code> (기본값은 시계 방향) 으로 끝나는 반경 <code>r</code> 로 ( <code>x, y</code> ) 위치에 중심에있는 경로에 호를 추가합니다 .
ru: Добавляет дугу к траектории, которая находится в центре ( <code>x, y</code> ) с радиусом <code>r</code> , начинающимся в <code>startAngle</code> и заканчивающимся в <code>endAngle</code> , идущем в заданном направлении <code>anticlockwise</code> (по умолчанию по часовой стрелке).
zh_cn: 向以（ <code>x, y</code> ）位置为中心的路径添加弧，半径 <code>r</code> 从 <code>startAngle</code> 开始到 <code>endAngle</code> 终止，沿给定方向按 <code>anticlockwise</code> （默认为顺时针方向）。

source: Adds an arc to the path which is centered at <em>(x, y)</em> position with radius<em> r</em> starting at <em>startAngle</em> and ending at <em>endAngle</em> going in the given direction by <em>anticlockwise</em> (defaulting to clockwise).
ja: 中心とするパスに弧を追加<em>（x、y）を</em>半径と位置<em>R</em>で開始<em>startAngleの</em>とで終わる<em>endAngle</em>によって一定方向に向かう<em>反時計回り</em>（時計回りにデフォルト設定）。
ko: 중심되는 경로를 추가 아크 <em>(x, y)의</em> 반경 위치와 <em>R이</em> 시작 <em>startAngle로부터</em> 그리고에서 끝나는 <em>endAngle</em> 의해 주어진 방향으로가 <em>시계 반대 방향</em> (시계 방향으로 디폴트).
ru: Добавляет дугу к траектории, которая находится в центре <em>(x, y)</em> с радиусом <em>r,</em> начинающимся в <em>startAngle</em> и заканчивающимся в <em>endAngle,</em> идущем в заданном направлении <em>против часовой стрелки</em> (по умолчанию по часовой стрелке).
zh_cn: 向以<em>（x，y）</em>位置为中心的路径添加弧，半径<em>r</em>从<em>startAngle</em>开始到<em>endAngle</em>沿给定方向<em>逆时针旋转</em>（默认为顺时针）。

source: Adds an arc to the path with the given control points and radius, connected to the previous point by a straight line.
ja: 与えられた制御点と半径を持つパスに円弧を追加します。
ko: 주어진 제어점과 반지름으로 경로에 호를 추가하고 직선으로 이전 점에 연결합니다.
ru: Добавляет дугу к контуру с заданными контрольными точками и радиусом,соединенными с предыдущей точкой прямой.
zh_cn: 在给定控制点和半径的路径上添加一条弧线,用直线与前一点连接。

source: Adds an element to the collection of <code>option</code> elements for this <code>select</code> element.
ja: この <code>select</code> 要素の <code>option</code> 要素のコレクションに要素を追加します。
ko: 이 <code>select</code> 요소 의 <code>option</code> 요소 컬렉션에 요소를 추가합니다 .
ru: Добавляет элемент в коллекцию элементов <code>option</code> для этого элемента <code>select</code> .
zh_cn: 将元素添加到此 <code>select</code> 元素的 <code>option</code> 元素集合中。

source: Adds an ellipse to the path which is centered at <em>(x, y)</em> position with the radii <em>radiusX</em> and <em>radiusY</em> starting at <em>startAngle</em> and ending at <em>endAngle</em> going in the given direction by <em>anticlockwise</em> (defaulting to clockwise).
ja: 中心とするパスに楕円を追加<em>（x、y）の</em>半径を有する位置<em>radiusX</em>と<em>radiusY</em>始まる<em>startAngleの</em>とで終わる<em>endAngle</em>によって一定方向に向かう<em>反時計回り</em>（時計回りにデフォルト設定）。
ko: <em>startAngle</em> 에서 시작 하고 <em>endAngle</em> 에서 <em>반 시계 방향</em> (기본값은 시계 방향) 으로 끝나는 반지름 <em>radiusX</em> 및 <em>radiusY</em> 로 <em>(x, y)</em> 위치에 중심이되는 경로에 타원을 추가합니다 .<em></em><em></em><em></em><em></em><em></em>
ru: Добавляет эллипс к траектории, центрированной в положении <em>(x, y)</em> с радиусами радиуса <em>X</em> и <em>радиуса Y,</em> начинающимися в <em>startAngle</em> и заканчивающимися в <em>endAngle,</em> идущими в заданном направлении <em>против часовой стрелки</em> (по умолчанию по часовой стрелке).
zh_cn: 向以<em>（x，y）</em>位置为中心的路径添加一个椭圆，半径<em>radiusX</em>和<em>radiusY</em>从<em>startAngle</em>开始到<em>endAngle</em>沿给定方向按<em>逆时针方向移动</em>（默认为顺时针方向）。

source: Adds an elliptical arc to the path which is centered at (<code>x, y</code>) position with the radii <code>radiusX</code> and <code>radiusY</code> starting at <code>startAngle</code> and ending at <code>endAngle</code> going in the given direction by <code>anticlockwise</code> (defaulting to clockwise).
ja: （を中心とするパスに楕円形の円弧を追加し <code>x, y</code> 半径を有する）位置 <code>radiusX</code> と <code>radiusY</code> 始まる <code>startAngle</code> のとで終わる <code>endAngle</code> によって一定方向に向かう <code>anticlockwise</code> （時計回りにデフォルト設定）。
ko: (AT 중심 경로를 타원 호를 추가 <code>x, y</code> 반경)와 위치 <code>radiusX</code> 및 <code>radiusY</code> 에서 시작 <code>startAngle</code> 과 끝에서 <code>endAngle</code> 의해 주어진 방향으로가 <code>anticlockwise</code> (시계 방향으로 디폴트).
ru: Добавляет эллиптическую дугу к траектории, которая центрирована в положении ( <code>x, y</code> ) с радиусами <code>radiusX</code> и <code>radiusY</code> , начинающимися в <code>startAngle</code> и заканчивающимися в <code>endAngle</code> , идущими в заданном направлении <code>anticlockwise</code> (по умолчанию по часовой стрелке).
zh_cn: 向以（ <code>x, y</code> ）位置为中心的路径添加一个椭圆弧，半径 <code>radiusX</code> 和 <code>radiusY</code> 从 <code>startAngle</code> 开始到 <code>endAngle</code> 沿给定方向按 <code>anticlockwise</code> （默认为顺时针方向）。

source: Adds an item (either a <a href="file"><code>File</code></a> object or a <a href="domstring"><code>string</code></a>) to the drag item list and returns a <a href="datatransferitem"><code>DataTransferItem</code></a> object for the new item.
ja: 項目（<a href="file"> <code>File</code> </a>オブジェクトまたは<a href="domstring"> <code>string</code> </a>）をドラッグ項目リストに追加し、新しい項目の<a href="datatransferitem"> <code>DataTransferItem</code> </a>オブジェクトを返します。
ko: 드래그 아이템리스트에 아이템 ( <a href="file"> <code>File</code> </a> 객체 또는 <a href="domstring"> <code>string</code> </a> )을 <a href="datatransferitem"> <code>DataTransferItem</code> </a> , 새로운 아이템 의 DataTransferItem 객체를 돌려줍니다 .
ru: Добавляет элемент (либо объект <a href="file"> <code>File</code> ,</a> либо <a href="domstring"> <code>string</code> </a> ) в список элементов перетаскивания и возвращает объект <a href="datatransferitem"> <code>DataTransferItem</code> </a> для нового элемента.
zh_cn: 将一个项目（<a href="file"> <code>File</code> </a>对象或<a href="domstring"> <code>string</code> </a>）添加到拖动项目列表中，并为新项目返回一个<a href="datatransferitem"> <code>DataTransferItem</code> </a>对象。

source: Adds image constraints.
ja: イメージ制約を追加します。
ko: 이미지 제약 조건을 추가합니다.
ru: Добавляет ограничения на изображение.
zh_cn: 增加图像约束。

source: Adds many new internal formats.
ja: 新しい内部フォーマットを多数追加しました。
ko: 많은 새로운 내부 형식을 추가합니다.
ru: Добавляет много новых внутренних форматов.
zh_cn: 增加了许多新的内部格式。

source: Adds new <code>pname</code> values:
ja: 新しい <code>pname</code> 値を追加します。
ko: 새로운 <code>pname</code> 값을 추가합니다 :
ru: Добавляет новые значения <code>pname</code> :
zh_cn: 添加新的 <code>pname</code> 值：

source: Adds new <code>target</code> buffers:
ja: 新しい <code>target</code> バッファを追加します。
ko: 새로운 <code>target</code> 버퍼를 추가합니다 :
ru: Добавляет новые <code>target</code> буферы:
zh_cn: 添加新的 <code>target</code> 缓冲区：

source: Adds new <code>usage</code> hints:
ja: 新しい <code>usage</code> ヒントを追加します。
ko: 새로운 <code>usage</code> 힌트를 추가합니다 .
ru: Добавляет новые советы по <code>usage</code> :
zh_cn: 添加新的 <code>usage</code> 提示：

source: Adds requirements regarding trusted and untrusted events, though it does not itself define the <code>isTrusted</code> property.
ja: 信頼できるイベントと信頼できないイベントに関する要件を追加しますが、それ自体は <code>isTrusted</code> プロパティを定義しません。
ko: <code>isTrusted</code> 속성을 자체적으로 정의하지는 않지만 신뢰할 수있는 이벤트와 신뢰할 수없는 이벤트에 대한 요구 사항을 추가합니다 .
ru: Добавляет требования в отношении доверенных и ненадежных событий, хотя само по себе оно не определяет свойство <code>isTrusted</code> .
zh_cn: 添加有关受信任和不受信任事件的要求，尽管它本身并未定义 <code>isTrusted</code> 属性。

source: Adds serializer to the <code>PerformanceEntry</code> interface as well as adding the <code>PerformanceObserver</code> interface and callback
ja: <code>PerformanceEntry</code> インターフェイスにシリアライザーを追加し、 <code>PerformanceObserver</code> インターフェイスとコールバックを追加します。
ko: <code>PerformanceObserver</code> 인터페이스 및 콜백 을 추가 할뿐만 아니라 <code>PerformanceEntry</code> 인터페이스에 직렬 변환기를 추가합니다.
ru: Добавляет сериализатор в интерфейс <code>PerformanceEntry</code> , а также добавляет интерфейс <code>PerformanceObserver</code> и обратный вызов
zh_cn: 将序列化器添加到 <code>PerformanceEntry</code> 接口，以及添加 <code>PerformanceObserver</code> 接口和回调

source: Adds the <a href="https://developer.mozilla.org/en-US/docs/Web/API/ServiceWorkerRegistration/sync"><code>sync</code></a> property.
ja: <a href="https://developer.mozilla.org/en-US/docs/Web/API/ServiceWorkerRegistration/sync"> <code>sync</code> </a>プロパティを追加します。
ko: <a href="https://developer.mozilla.org/en-US/docs/Web/API/ServiceWorkerRegistration/sync"> <code>sync</code> </a> 속성을 추가합니다 .
ru: Добавляет свойство <a href="https://developer.mozilla.org/en-US/docs/Web/API/ServiceWorkerRegistration/sync"> <code>sync</code> </a> .
zh_cn: 添加<a href="https://developer.mozilla.org/en-US/docs/Web/API/ServiceWorkerRegistration/sync"> <code>sync</code> </a>属性。

source: Adds the <a href="onsync"><code>onsync</code></a> event.
ja: <a href="onsync"> <code>onsync</code> </a>イベントを追加します。
ko: <a href="onsync"> <code>onsync</code> </a> 이벤트를 추가합니다 .
ru: Добавляет событие <a href="onsync"> <code>onsync</code> </a> .
zh_cn: 添加<a href="onsync"> <code>onsync</code> </a>事件。

source: Adds the <a href="performanceframetiming"><code>PerformanceFrameTiming</code></a> interface and the <code>frame</code> value for <code>entryType</code>.
ja: 追加<a href="performanceframetiming"> <code>PerformanceFrameTiming</code> </a>インタフェースと <code>frame</code> の値 <code>entryType</code> を。
ko: <a href="performanceframetiming"> <code>PerformanceFrameTiming</code> </a> 인터페이스와 <code>entryType</code> 의 <code>frame</code> 값을 추가합니다 .
ru: Добавляет интерфейс <a href="performanceframetiming"> <code>PerformanceFrameTiming</code> </a> и значение <code>frame</code> для <code>entryType</code> .
zh_cn: 添加<a href="performanceframetiming"> <code>PerformanceFrameTiming</code> </a>接口和 <code>entryType</code> 的 <code>frame</code> 值。

source: Adds the <a href="performancemark"><code>PerformanceMark</code></a> and <a href="performancemeasure"><code>PerformanceMeasure</code></a> interfaces as well as the <code>mark</code> and <code>measure</code> values for <code>entryType</code>.
ja: 追加<a href="performancemark"> <code>PerformanceMark</code> </a>と<a href="performancemeasure"> <code>PerformanceMeasure</code> </a>インターフェース並びに <code>mark</code> と <code>measure</code> の値 <code>entryType</code> を。
ko: <code>entryType</code> 의 <code>mark</code> 및 <code>measure</code> 값 뿐만 아니라 <a href="performancemark"> <code>PerformanceMark</code> </a> 및 <a href="performancemeasure"> <code>PerformanceMeasure</code> </a> 인터페이스를 추가합니다 .
ru: Добавляет интерфейсы <a href="performancemark"> <code>PerformanceMark</code> </a> и <a href="performancemeasure"> <code>PerformanceMeasure</code> ,</a> а также значения <code>mark</code> и <code>measure</code> для <code>entryType</code> .
zh_cn: 添加<a href="performancemark"> <code>PerformanceMark</code> </a>和<a href="performancemeasure"> <code>PerformanceMeasure</code> </a>接口，以及 <code>entryType</code> 的 <code>mark</code> 和 <code>measure</code> 量值。

source: Adds the <a href="performancenavigationtiming"><code>PerformanceNavigationTiming</code></a> interface and the <code>navigation</code> value for <code>entryType</code>.
ja: 追加<a href="performancenavigationtiming"> <code>PerformanceNavigationTiming</code> </a>インターフェイスと <code>navigation</code> のための値 <code>entryType</code> を。
ko: <a href="performancenavigationtiming"> <code>PerformanceNavigationTiming</code> </a> 인터페이스와 <code>entryType</code> 의 <code>navigation</code> 값을 추가합니다 .
ru: Добавляет интерфейс <a href="performancenavigationtiming"> <code>PerformanceNavigationTiming</code> </a> и значение <code>navigation</code> для <code>entryType</code> .
zh_cn: 添加<a href="performancenavigationtiming"> <code>PerformanceNavigationTiming</code> </a>接口和 <code>entryType</code> 的 <code>navigation</code> 值。

source: Adds the <a href="performanceresourcetiming"><code>PerformanceResourceTiming</code></a> interface and the <code>resource</code> value for <code>entryType</code>.
ja: 追加<a href="performanceresourcetiming"> <code>PerformanceResourceTiming</code> の</a>インターフェースおよび <code>resource</code> の値 <code>entryType</code> を。
ko: <a href="performanceresourcetiming"> <code>PerformanceResourceTiming</code> </a> 인터페이스 및 <code>entryType</code> 의 <code>resource</code> 값을 추가합니다 .
ru: Добавляет интерфейс <a href="performanceresourcetiming"> <code>PerformanceResourceTiming</code> </a> и значение <code>resource</code> для <code>entryType</code> .
zh_cn: 添加<a href="performanceresourcetiming"> <code>PerformanceResourceTiming</code> </a>接口和 <code>entryType</code> 的 <code>resource</code> 值。

source: Adds the <a href="pushmanager"><code>pushManager</code></a> property.
ja: <a href="pushmanager"> <code>pushManager</code> </a>プロパティを追加します。
ko: <a href="pushmanager"> <code>pushManager</code> </a> 속성을 추가합니다 .
ru: Добавляет свойство <a href="pushmanager"> <code>pushManager</code> </a> .
zh_cn: 添加<a href="pushmanager"> <code>pushManager</code> </a>属性。

source: Adds the <a href="serviceworkerregistration/shownotification"><code>showNotification()</code></a> method and the <a href="serviceworkerregistration/getnotifications"><code>getNotifications()</code></a> method.
ja: <a href="serviceworkerregistration/shownotification"> <code>showNotification()</code> </a>メソッドと<a href="serviceworkerregistration/getnotifications"> <code>getNotifications()</code> </a>メソッドを追加します。
ko: 추가 <a href="serviceworkerregistration/shownotification"> <code>showNotification()</code> </a> 메소드와 <a href="serviceworkerregistration/getnotifications"> <code>getNotifications()</code> </a> 방법.
ru: Добавляет метод <a href="serviceworkerregistration/shownotification"> <code>showNotification()</code> </a> метод <a href="serviceworkerregistration/getnotifications"> <code>getNotifications()</code> </a> .
zh_cn: 添加<a href="serviceworkerregistration/shownotification"> <code>showNotification()</code> </a>方法和<a href="serviceworkerregistration/getnotifications"> <code>getNotifications()</code> </a>方法。

source: Adds the <a href="svgelement/dataset"><code>dataset</code></a> property.
ja: <a href="svgelement/dataset"> <code>dataset</code> </a>プロパティを追加します。
ko: <a href="svgelement/dataset"> <code>dataset</code> </a> 속성을 추가합니다 .
ru: Добавляет свойство <a href="svgelement/dataset"> <code>dataset</code> </a> .
zh_cn: 添加<a href="svgelement/dataset"> <code>dataset</code> </a>属性。

source: Adds the <code>PerformanceEntry</code> interface, the <code>PerformanceEntryList</code> type, as well as the <code>getEntries()</code>, <code>getEntriesByType()</code>, and <code>getEntriesByName()</code> methods on the <code>Performance</code> interface.
ja: 追加 <code>PerformanceEntry</code> のインターフェース、 <code>PerformanceEntryList</code> のタイプ、ならびに <code>getEntries()</code> 、 <code>getEntriesByType()</code> 、及び <code>getEntriesByName()</code> のメソッド <code>Performance</code> インタフェースを。
ko: 추가 <code>PerformanceEntry</code> 의 인터페이스는 <code>PerformanceEntryList</code> 의 유형뿐만 아니라 <code>getEntries()</code> , <code>getEntriesByType()</code> , 및 <code>getEntriesByName()</code> 온 방법 <code>Performance</code> 인터페이스를.
ru: Добавляет <code>PerformanceEntry</code> интерфейс, <code>PerformanceEntryList</code> типа, а также <code>getEntries()</code> , <code>getEntriesByType()</code> , и <code>getEntriesByName()</code> методы на <code>Performance</code> интерфейса.
zh_cn: 添加 <code>PerformanceEntry</code> 接口，所述 <code>PerformanceEntryList</code> 类型，以及所述 <code>getEntries()</code> ， <code>getEntriesByType()</code> ，和 <code>getEntriesByName()</code> 方法中的上 <code>Performance</code> 接口。

source: Adds the <code>PerformanceNavigationTiming</code> interface. Obsolete's the the <code>PerformanceTiming</code> interface, the <code>PerformanceNavigation</code> interface, as well as the <code>timing</code> and <code>navigation</code> properties to the <code>Performance</code> interface.
ja: <code>PerformanceNavigationTiming</code> インターフェイスを追加します。廃止されたのは、 <code>PerformanceTiming</code> インターフェース、 <code>PerformanceNavigation</code> インターフェース、および <code>Performance</code> インターフェースへの <code>timing</code> と <code>navigation</code> プロパティです。
ko: <code>PerformanceNavigationTiming</code> 인터페이스를 추가합니다 . 폐기의하여 <code>PerformanceTiming</code> 인터페이스의 <code>PerformanceNavigation</code> 의 인터페이스뿐만 아니라, <code>timing</code> 및 <code>navigation</code> 받는 속성 <code>Performance</code> 인터페이스를 제공합니다.
ru: Добавляет интерфейс <code>PerformanceNavigationTiming</code> . Устаревшими являются интерфейс <code>PerformanceTiming</code> , интерфейс <code>PerformanceNavigation</code> , а также свойства <code>timing</code> и <code>navigation</code> к интерфейсу <code>Performance</code> .
zh_cn: 添加 <code>PerformanceNavigationTiming</code> 接口。过时的了的 <code>PerformanceTiming</code> 接口方面， <code>PerformanceNavigation</code> 接口，还有 <code>timing</code> 和 <code>navigation</code> 性能的 <code>Performance</code> 接口。

source: Adds the <code>PerformanceResourceTiming</code> interface. Adds the <code>clearResourceTimings()</code> method, the <code>setResourceTimingBufferSize()</code> method, and the <code>onresourcetimingbufferfull</code> event handler to the <code>Performance</code> interface. Also adds the <code>Timing-Allow-Origin</code> response header.
ja: <code>PerformanceResourceTiming</code> インターフェイスを追加します。 <code>clearResourceTimings()</code> メソッド、 <code>setResourceTimingBufferSize()</code> メソッド、および <code>onresourcetimingbufferfull</code> イベントハンドラーを <code>Performance</code> インターフェイスに追加します。 <code>Timing-Allow-Origin</code> 応答ヘッダーも追加します。
ko: <code>PerformanceResourceTiming</code> 인터페이스를 추가합니다 . 추가 <code>clearResourceTimings()</code> 에있어서, 상기 <code>setResourceTimingBufferSize()</code> 메소드와 <code>onresourcetimingbufferfull</code> 받는 이벤트 핸들러 <code>Performance</code> 인터페이스. <code>Timing-Allow-Origin</code> 응답 헤더 도 추가합니다 .
ru: Добавляет интерфейс <code>PerformanceResourceTiming</code> . Добавляет метод <code>clearResourceTimings()</code> метод <code>setResourceTimingBufferSize()</code> и <code>onresourcetimingbufferfull</code> события onresourcetimingbufferfull в интерфейс <code>Performance</code> . Также добавляет заголовок ответа <code>Timing-Allow-Origin</code> .
zh_cn: 添加 <code>PerformanceResourceTiming</code> 接口。将 <code>clearResourceTimings()</code> 方法， <code>setResourceTimingBufferSize()</code> 方法和 <code>onresourcetimingbufferfull</code> 事件处理程序添加到 <code>Performance</code> 接口。还添加了 <code>Timing-Allow-Origin</code> 响应标头。

source: Adds the <code>PerformanceTiming</code> and <code>PerformanceNavigation</code> interfaces. Adds <code>timing</code> and <code>navigation</code> properties to the <code>Performance</code> interface.
ja: <code>PerformanceTiming</code> および <code>PerformanceNavigation</code> インターフェイスを追加します。 <code>timing</code> と <code>navigation</code> プロパティを <code>Performance</code> インターフェイスに追加します。
ko: <code>PerformanceTiming</code> 및 <code>PerformanceNavigation</code> 인터페이스를 추가합니다 . <code>timing</code> 및 <code>navigation</code> 속성을 <code>Performance</code> 인터페이스에 추가합니다 .
ru: Добавляет интерфейсы <code>PerformanceTiming</code> и <code>PerformanceNavigation</code> . Добавляет свойства <code>timing</code> и <code>navigation</code> в интерфейс <code>Performance</code> .
zh_cn: 添加 <code>PerformanceTiming</code> 和 <code>PerformanceNavigation</code> 接口。将 <code>timing</code> 和 <code>navigation</code> 属性添加到&ldquo; <code>Performance</code> 界面。

source: Adds the <code>escape()</code> static method.
ja: <code>escape()</code> 静的メソッドを追加します。
ko: <code>escape()</code> 정적 메소드를 추가합니다 .
ru: Добавляет статический метод <code>escape()</code> .
zh_cn: 添加 <code>escape()</code> 静态方法。

source: Adds the <code>images</code> property.
ja: <code>images</code> プロパティを追加します。
ko: <code>images</code> 속성을 추가합니다 .
ru: Добавляет свойство <code>images</code> .
zh_cn: 添加 <code>images</code> 属性。

source: Adds the <code>nextHopProtocol</code>, <code>workerStart</code>, <code>transferSize</code>, <code>encodedBodySize</code>, and <code>decodedBodySize</code> properties to the <code>PerformanceResourceTiming</code> interface.
ja: <code>nextHopProtocol</code> 、 <code>workerStart</code> 、 <code>transferSize</code> 、 <code>encodedBodySize</code> 、および <code>decodedBodySize</code> プロパティを <code>PerformanceResourceTiming</code> インターフェースに追加します。
ko: 추가 <code>nextHopProtocol</code> , <code>workerStart</code> , <code>transferSize</code> , <code>encodedBodySize</code> 및 <code>decodedBodySize</code> 을 받는 속성 <code>PerformanceResourceTiming</code> 의 인터페이스를.
ru: Добавляет <code>nextHopProtocol</code> , <code>workerStart</code> , <code>transferSize</code> , <code>encodedBodySize</code> и <code>decodedBodySize</code> свойства в <code>PerformanceResourceTiming</code> интерфейс.
zh_cn: 将 <code>nextHopProtocol</code> ， <code>workerStart</code> ， <code>transferSize</code> ， <code>encodedBodySize</code> 和 <code>decodedBodySize</code> 属性添加到 <code>PerformanceResourceTiming</code> 接口。

source: Adds the <code>paintWorklet</code> static property.
ja: <code>paintWorklet</code> 静的プロパティを追加します。
ko: <code>paintWorklet</code> 정적 속성을 추가합니다 .
ru: Добавляет статическое свойство <code>paintWorklet</code> .
zh_cn: 添加 <code>paintWorklet</code> 静态属性。
