Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/dom/dom.*.007.xlf
Languages: es, ko, ru, zh_cn

source: <em>This interface has no properties of its own; however, it inherits properties from its parent, </em><em><a href="audionode"><code>AudioNode</code></a></em>.
es: <em>Esta interfaz no tiene propiedades propias; sin embargo, hereda propiedades de su padre, </em><em><a href="audionode"> <code>AudioNode</code> </a></em> .
ko: <em>이 인터페이스에는 자체 속성이 없습니다. 그러나 부모 인 </em><em><a href="audionode"> <code>AudioNode</code> </a></em><em> 에서 속성을 상속합니다</em> .
ru: <em>Этот интерфейс не имеет собственных свойств; однако, он наследует свойства от своего родителя, </em><em><a href="audionode"> <code>AudioNode</code> </a></em> .
zh_cn: <em>该接口没有其自身的属性。但是，它从其父</em><em><a href="audionode"> <code>AudioNode</code> </a></em><em>继承属性</em>。

source: <em>This interface has no specific method, but inherits those of its parent, <a href="https://developer.mozilla.org/en-US/docs/Web/API/CharacterData"><code>CharacterData</code></a>, and indirectly those of <a href="node"><code>Node</code></a>.</em>
es: <em>Esta interfaz no tiene un m&eacute;todo espec&iacute;fico, pero hereda los de su padre, <a href="https://developer.mozilla.org/en-US/docs/Web/API/CharacterData"> <code>CharacterData</code> </a> e indirectamente los de <a href="node"> <code>Node</code> </a> .</em>
ko: <em>이 인터페이스에는 특정 메소드가 없지만 상위 메소드 인 <a href="https://developer.mozilla.org/en-US/docs/Web/API/CharacterData"> <code>CharacterData</code> </a> 및 간접적으로 <a href="node"> <code>Node</code> 의</a> 메소드를 상속합니다 .</em>
ru: <em>Этот интерфейс не имеет конкретного метода, но наследует те из его родителя, <a href="https://developer.mozilla.org/en-US/docs/Web/API/CharacterData"> <code>CharacterData</code> </a> , и косвенно те из <a href="node"> <code>Node</code> </a> .</em>
zh_cn: <em>该接口没有特定的方法，但是继承其父类<a href="https://developer.mozilla.org/en-US/docs/Web/API/CharacterData"> <code>CharacterData</code> 的方法</a>，并间接继承<a href="node"> <code>Node</code> 的方法</a>。</em>

source: <em>This interface has no specific methods and implements those of its parent <a href="text"><code>Text</code></a>.</em>
es: <em>Esta interfaz no tiene m&eacute;todos espec&iacute;ficos e implementa los de su <a href="text"> <code>Text</code> </a> principal .</em>
ko: <em>이 인터페이스에는 특정 메소드가 없으며 상위 <a href="text"> <code>Text</code> </a> 메소드를 구현합니다 .</em>
ru: <em>Этот интерфейс не имеет конкретных методов и реализует методы своего родительского <a href="text"> <code>Text</code> </a> .</em>
zh_cn: <em>此接口没有特定的方法，并实现其父<a href="text"> <code>Text</code> 的方法</a>。</em>

source: <em>This interface has no specific properties and implements those of its parent <a href="text"><code>Text</code></a>.</em>
es: <em>Esta interfaz no tiene propiedades espec&iacute;ficas e implementa las de su <a href="text"> <code>Text</code> </a> primario .</em>
ko: <em>이 인터페이스에는 특정 속성이 없으며 부모 <a href="text"> <code>Text</code> </a> 속성을 구현합니다 .</em>
ru: <em>Этот интерфейс не имеет особых свойств и реализует свойства своего родительского <a href="text"> <code>Text</code> </a> .</em>
zh_cn: <em>该接口没有特定的属性，并实现其父<a href="text"> <code>Text</code> 的</a>属性。</em>

source: <em>This interface has no specific properties, but inherits those of its parent, <a href="node"><code>Node</code></a>, and implements those of the <a href="parentnode"><code>ParentNode</code></a> interface.</em>
es: <em>Esta interfaz no tiene propiedades espec&iacute;ficas, pero hereda las de su padre, <a href="node"> <code>Node</code> </a> , e implementa las de la interfaz <a href="parentnode"> <code>ParentNode</code> </a> .</em>
ko: <em>이 인터페이스에는 특정 속성이 없지만 부모 인 <a href="node"> <code>Node</code> </a> 의 속성을 상속 하고 <a href="parentnode"> <code>ParentNode</code> </a> 인터페이스의 속성을 구현합니다 .</em>
ru: <em>Этот интерфейс не имеет специфических свойств, но наследует свойства его родителя, <a href="node"> <code>Node</code> </a> , и реализует <a href="parentnode"> <code>ParentNode</code> </a> интерфейса ParentNode .</em>
zh_cn: <em>该接口没有特定的属性，但是继承其父<a href="node"> <code>Node</code> </a>属性，并实现<a href="parentnode"> <code>ParentNode</code> </a>接口的属性。</em>

source: <em>This interface has no specific property and doesn't inherit any.</em>
es: <em>Esta interfaz no tiene ninguna propiedad espec&iacute;fica y no hereda ninguna.</em>
ko: <em>이 인터페이스에는 특정 속성이 없으며 상속되지 않습니다.</em>
ru: <em>Этот интерфейс не имеет специфического свойства и не наследует.</em>
zh_cn: <em>此接口没有特定的属性，并且不会继承任何属性。</em>

source: <em>This interface has no specific property, but inherits those of its parent, <a href="https://developer.mozilla.org/en-US/docs/Web/API/CharacterData"><code>CharacterData</code></a>, and indirectly those of <a href="node"><code>Node</code></a>.</em>
es: <em>Esta interfaz no tiene ninguna propiedad espec&iacute;fica, pero hereda las de su padre, <a href="https://developer.mozilla.org/en-US/docs/Web/API/CharacterData"> <code>CharacterData</code> </a> e indirectamente las de <a href="node"> <code>Node</code> </a> .</em>
ko: <em>이 인터페이스에는 특정 속성이 없지만 상위 속성 인 <a href="https://developer.mozilla.org/en-US/docs/Web/API/CharacterData"> <code>CharacterData</code> </a> 및 간접적으로 <a href="node"> <code>Node</code> 의</a> 속성을 상속합니다 .</em>
ru: <em>Этот интерфейс не имеет определенного свойства, но наследует те из его родителя, <a href="https://developer.mozilla.org/en-US/docs/Web/API/CharacterData"> <code>CharacterData</code> </a> , и косвенно те из <a href="node"> <code>Node</code> </a> .</em>
zh_cn: <em>该接口没有特定的属性，但是继承其父类<a href="https://developer.mozilla.org/en-US/docs/Web/API/CharacterData"> <code>CharacterData</code> 的</a>属性，并间接继承<a href="node"> <code>Node</code> 的</a>属性。</em>

source: <em>This interface has no unique methods; inherits methods from its parent <a href="event"><code>Event</code></a></em>.
es: <em>Esta interfaz no tiene m&eacute;todos &uacute;nicos; hereda m&eacute;todos de su <a href="event"> <code>Event</code> </a></em><em> principal</em> .
ko: <em>이 인터페이스에는 고유 한 방법이 없습니다. 부모 <a href="event"> <code>Event</code> </a></em><em> 에서 메소드를 상속합니다</em> .
ru: <em>Этот интерфейс не имеет уникальных методов; наследует методы от родительского <a href="event"> <code>Event</code> </a></em> .
zh_cn: <em>该接口没有独特的方法。从其父<a href="event"> <code>Event</code> </a></em><em>继承方法</em>。

source: <em>This interface implements methods defined on <a href="crypto/getrandomvalues"><code>RandomSource</code></a>.</em>
es: <em>Esta interfaz implementa m&eacute;todos definidos en <a href="crypto/getrandomvalues"> <code>RandomSource</code> </a> .</em>
ko: <em>이 인터페이스는 <a href="crypto/getrandomvalues"> <code>RandomSource</code> 에</a> 정의 된 메소드를 구현합니다 .</em>
ru: <em>Этот интерфейс реализует методы, определенные в <a href="crypto/getrandomvalues"> <code>RandomSource</code> </a> .</em>
zh_cn: <em>该接口实现在<a href="crypto/getrandomvalues"> <code>RandomSource</code> 上</a>定义的方法。</em>

source: <em>This interface implements no method.</em>
es: <em>Esta interfaz no implementa ning&uacute;n m&eacute;todo.</em>
ko: <em>이 인터페이스는 메소드를 구현하지 않습니다.</em>
ru: <em>Этот интерфейс не реализует никакой метод.</em>
zh_cn: <em>该接口没有实现任何方法。</em>

source: <em>This interface implements properties defined on <a href="crypto/getrandomvalues"><code>RandomSource</code></a>.</em>
es: <em>Esta interfaz implementa propiedades definidas en <a href="crypto/getrandomvalues"> <code>RandomSource</code> </a> .</em>
ko: <em>이 인터페이스는 <a href="crypto/getrandomvalues"> <code>RandomSource</code> 에</a> 정의 된 속성을 구현합니다 .</em>
ru: <em>Этот интерфейс реализует свойства, определенные в <a href="crypto/getrandomvalues"> <code>RandomSource</code> </a> .</em>
zh_cn: <em>该接口实现在<a href="crypto/getrandomvalues"> <code>RandomSource</code> 上</a>定义的属性。</em>

source: <em>This interface includes methods inherited from <a href="paymentrequestupdateevent"><code>PaymentRequestUpdateEvent</code></a>.</em>
es: <em>Esta interfaz incluye m&eacute;todos heredados de <a href="paymentrequestupdateevent"> <code>PaymentRequestUpdateEvent</code> </a> .</em>
ko: <em>이 인터페이스에는 <a href="paymentrequestupdateevent"> <code>PaymentRequestUpdateEvent</code> </a> 에서 상속 된 메소드가 포함됩니다 .</em>
ru: <em>Этот интерфейс включает методы, унаследованные от <a href="paymentrequestupdateevent"> <code>PaymentRequestUpdateEvent</code> </a> .</em>
zh_cn: <em>该接口包括从<a href="paymentrequestupdateevent"> <code>PaymentRequestUpdateEvent</code> </a>继承的方法。</em>

source: <em>This interface inherits all the methods of its parent interface, <a href="idbkeyrange"><code>IDBKeyRange</code></a>.</em>
es: <em>Esta interfaz hereda todos los m&eacute;todos de su interfaz principal, <a href="idbkeyrange"> <code>IDBKeyRange</code> </a> .</em>
ko: <em>이 인터페이스는 부모 인터페이스 <a href="idbkeyrange"> <code>IDBKeyRange</code> </a> 의 모든 메소드를 상속합니다 .</em>
ru: <em>Этот интерфейс наследует все методы его родительского интерфейса, <a href="idbkeyrange"> <code>IDBKeyRange</code> </a> .</em>
zh_cn: <em>此接口继承其父接口<a href="idbkeyrange"> <code>IDBKeyRange</code> 的</a>所有方法。</em>

source: <em>This interface inherits all the properties of its parent interface, <a href="idbkeyrange"><code>IDBKeyRange</code></a>.</em>
es: <em>Esta interfaz hereda todas las propiedades de su interfaz principal, <a href="idbkeyrange"> <code>IDBKeyRange</code> </a> .</em>
ko: <em>이 인터페이스는 부모 인터페이스 <a href="idbkeyrange"> <code>IDBKeyRange</code> </a> 의 모든 속성을 상속합니다 .</em>
ru: <em>Этот интерфейс наследует все свойства своего родительского интерфейса, <a href="idbkeyrange"> <code>IDBKeyRange</code> </a> .</em>
zh_cn: <em>此接口继承其父接口<a href="idbkeyrange"> <code>IDBKeyRange</code> 的</a>所有属性。</em>

source: <em>This interface inherits event handlers from the <a href="eventtarget"><code>EventTarget</code></a> interface and implements event handlers from <a href="windoweventhandlers"><code>WindowEventHandlers</code></a>.</em>
es: <em>Esta interfaz hereda los controladores de eventos de la interfaz <a href="eventtarget"> <code>EventTarget</code> </a> e implementa los controladores de eventos de <a href="windoweventhandlers"> <code>WindowEventHandlers</code> </a> .</em>
ko: <em>이 인터페이스는 <a href="eventtarget"> <code>EventTarget</code> </a> 인터페이스 에서 이벤트 핸들러를 상속 하고 <a href="windoweventhandlers"> <code>WindowEventHandlers</code> </a> 에서 이벤트 핸들러를 구현 합니다 .</em>
ru: <em>Этот интерфейс наследует обработчики событий из интерфейса <a href="eventtarget"> <code>EventTarget</code> </a> и реализует обработчики событий из <a href="windoweventhandlers"> <code>WindowEventHandlers</code> </a> .</em>
zh_cn: <em>此接口从<a href="eventtarget"> <code>EventTarget</code> </a>接口继承事件处理程序，并从<a href="windoweventhandlers"> <code>WindowEventHandlers</code> </a>实现事件处理程序。</em>

source: <em>This interface inherits event handlers from the <a href="workerglobalscope"><code>WorkerGlobalScope</code></a> interface, and its parent <a href="eventtarget"><code>EventTarget</code></a>, and therefore implements event handlers from <a href="windoworworkerglobalscope"><code>WindowTimers</code></a>, <a href="windoworworkerglobalscope"><code>WindowBase64</code></a>, and <a href="windoweventhandlers"><code>WindowEventHandlers</code></a>.</em>
es: <em>Esta interfaz hereda los controladores de eventos de la interfaz <a href="workerglobalscope"> <code>WorkerGlobalScope</code> </a> y su <a href="eventtarget"> <code>EventTarget</code> </a> principal y, por lo tanto, implementa controladores de eventos de <a href="windoworworkerglobalscope"> <code>WindowTimers</code> </a> , <a href="windoworworkerglobalscope"> <code>WindowBase64</code> </a> y <a href="windoweventhandlers"> <code>WindowEventHandlers</code> </a> .</em>
ko: <em>이 인터페이스는 <a href="workerglobalscope"> <code>WorkerGlobalScope</code> </a> 인터페이스 및 상위 <a href="eventtarget"> <code>EventTarget</code> </a> 에서 이벤트 핸들러를 상속 하므로 <a href="windoworworkerglobalscope"> <code>WindowTimers</code> </a> , <a href="windoworworkerglobalscope"> <code>WindowBase64</code> </a> 및 <a href="windoweventhandlers"> <code>WindowEventHandlers</code> </a> 에서 이벤트 핸들러를 구현 합니다 .</em>
ru: <em>Этот интерфейс наследует обработчики событий от интерфейса <a href="workerglobalscope"> <code>WorkerGlobalScope</code> </a> и его родительского <a href="eventtarget"> <code>EventTarget</code> </a> и поэтому реализует обработчики событий из <a href="windoworworkerglobalscope"> <code>WindowTimers</code> </a> , <a href="windoworworkerglobalscope"> <code>WindowBase64</code> </a> и <a href="windoweventhandlers"> <code>WindowEventHandlers</code> </a> .</em>
zh_cn: <em>此接口从<a href="workerglobalscope"> <code>WorkerGlobalScope</code> </a>接口及其父<a href="eventtarget"> <code>EventTarget</code> </a>继承事件处理程序，因此从<a href="windoworworkerglobalscope"> <code>WindowTimers</code> </a>，<a href="windoworworkerglobalscope"> <code>WindowBase64</code> </a>和<a href="windoweventhandlers"> <code>WindowEventHandlers</code> </a>实现事件处理程序。</em>

source: <em>This interface inherits its property from its parent, <a href="animationtimeline"><code>AnimationTimeline</code></a>.</em>
es: <em>Esta interfaz hereda su propiedad de su padre, <a href="animationtimeline"> <code>AnimationTimeline</code> </a> .</em>
ko: <em>이 인터페이스는 부모 인 <a href="animationtimeline"> <code>AnimationTimeline</code> </a> 에서 속성을 상속합니다 .</em>
ru: <em>Этот интерфейс наследует свое свойство от своего родителя, <a href="animationtimeline"> <code>AnimationTimeline</code> </a> .</em>
zh_cn: <em>此接口从其父级<a href="animationtimeline"> <code>AnimationTimeline</code> </a>继承其属性。</em>

source: <em>This interface inherits methods from <a href="dommatrixreadonly"><code>DOMMatrixReadOnly</code></a>.</em>
es: <em>Esta interfaz hereda los m&eacute;todos de <a href="dommatrixreadonly"> <code>DOMMatrixReadOnly</code> </a> .</em>
ko: <em>이 인터페이스는 <a href="dommatrixreadonly"> <code>DOMMatrixReadOnly</code> 의</a> 메소드를 상속합니다 .</em>
ru: <em>Этот интерфейс наследует методы от <a href="dommatrixreadonly"> <code>DOMMatrixReadOnly</code> </a> .</em>
zh_cn: <em>此接口从<a href="dommatrixreadonly"> <code>DOMMatrixReadOnly</code> </a>继承方法。</em>

source: <em>This interface inherits methods from its parent, </em><a href="event"><code>Event</code></a>:
es: <em>Esta interfaz hereda los m&eacute;todos de su padre, </em><a href="event"> <code>Event</code> o</a> :
ko: <em>이 인터페이스는 부모 인 </em><a href="event"> <code>Event</code> </a><em> 에서 메소드를 상속합니다</em> .
ru: <em>Этот интерфейс наследует методы от своего родителя, </em><a href="event"> <code>Event</code> </a> :
zh_cn: <em>此接口从其父</em><a href="event"> <code>Event</code> </a><em>继承方法</em>：

source: <em>This interface inherits methods from its parent, </em><em><a href="eventtarget"><code>EventTarget</code></a>.</em>
es: <em>Esta interfaz hereda los m&eacute;todos de su padre, </em><em><a href="eventtarget"> <code>EventTarget</code> </a> .</em>
ko: <em>이 인터페이스는 부모 인 </em><em><a href="eventtarget"> <code>EventTarget</code> </a></em><em> 에서 메소드를 상속합니다 </em><em>.</em><em></em>
ru: <em>Этот интерфейс наследует методы от своего родителя, </em><em><a href="eventtarget"> <code>EventTarget</code> </a> .</em>
zh_cn: <em>此接口从其父</em><em><a href="eventtarget"> <code>EventTarget</code> </a></em><em>继承方法</em><em>。</em><em></em>

source: <em>This interface inherits methods from the <a href="eventtarget"><code>EventTarget</code></a> interface and <a href="windoworworkerglobalscope"><code>WindowOrWorkerGlobalScope</code></a> and <a href="windoweventhandlers"><code>WindowEventHandlers</code></a> mixins.</em>
es: <em>M&eacute;todos de esta interfaz hereda de la <a href="eventtarget"> <code>EventTarget</code> </a> interfaz y <a href="windoworworkerglobalscope"> <code>WindowOrWorkerGlobalScope</code> </a> y <a href="windoweventhandlers"> <code>WindowEventHandlers</code> </a> mixins.</em>
ko: <em>이 인터페이스는 <a href="eventtarget"> <code>EventTarget</code> </a> 인터페이스와 <a href="windoworworkerglobalscope"> <code>WindowOrWorkerGlobalScope</code> </a> 및 <a href="windoweventhandlers"> <code>WindowEventHandlers</code> </a> 믹스 인 에서 메소드를 상속합니다 .</em>
ru: <em>Этот интерфейс наследует методы из <a href="eventtarget"> <code>EventTarget</code> </a> интерфейса и <a href="windoworworkerglobalscope"> <code>WindowOrWorkerGlobalScope</code> </a> и <a href="windoweventhandlers"> <code>WindowEventHandlers</code> </a> Mixins.</em>
zh_cn: <em>此接口从<a href="eventtarget"> <code>EventTarget</code> </a>接口以及<a href="windoworworkerglobalscope"> <code>WindowOrWorkerGlobalScope</code> </a>和<a href="windoweventhandlers"> <code>WindowEventHandlers</code> </a>混合实例继承方法。</em>

source: <em>This interface inherits methods from the <a href="eventtarget"><code>EventTarget</code></a> interface and implements methods from <a href="windoworworkerglobalscope"><code>WindowOrWorkerGlobalScope</code></a> and <a href="eventtarget"><code>EventTarget</code></a>.</em>
es: <em>Esta interfaz hereda m&eacute;todos de la interfaz <a href="eventtarget"> <code>EventTarget</code> </a> e implementa m&eacute;todos de <a href="windoworworkerglobalscope"> <code>WindowOrWorkerGlobalScope</code> </a> y <a href="eventtarget"> <code>EventTarget</code> </a> .</em>
ko: <em>이 인터페이스는 <a href="eventtarget"> <code>EventTarget</code> </a> 인터페이스 에서 메소드를 상속 하고 <a href="windoworworkerglobalscope"> <code>WindowOrWorkerGlobalScope</code> </a> 및 <a href="eventtarget"> <code>EventTarget</code> </a> 에서 메소드를 구현합니다 .</em>
ru: <em>Этот интерфейс наследует методы из интерфейса <a href="eventtarget"> <code>EventTarget</code> </a> и реализует методы из <a href="windoworworkerglobalscope"> <code>WindowOrWorkerGlobalScope</code> </a> и <a href="eventtarget"> <code>EventTarget</code> </a> .</em>
zh_cn: <em>此接口从<a href="eventtarget"> <code>EventTarget</code> </a>接口继承方法，并从<a href="windoworworkerglobalscope"> <code>WindowOrWorkerGlobalScope</code> </a>和<a href="eventtarget"> <code>EventTarget</code> </a>实现方法。</em>

source: <em>This interface inherits methods from the <a href="workerglobalscope"><code>WorkerGlobalScope</code></a> interface, and its parent <a href="eventtarget"><code>EventTarget</code></a>, and therefore implements methods from <a href="windoworworkerglobalscope"><code>WindowTimers</code></a>, <a href="windoworworkerglobalscope"><code>WindowBase64</code></a>, and <a href="windoweventhandlers"><code>WindowEventHandlers</code></a>.</em>
es: <em>Esta interfaz hereda los m&eacute;todos de la interfaz <a href="workerglobalscope"> <code>WorkerGlobalScope</code> </a> y su <a href="eventtarget"> <code>EventTarget</code> </a> principal y, por lo tanto, implementa m&eacute;todos de <a href="windoworworkerglobalscope"> <code>WindowTimers</code> </a> , <a href="windoworworkerglobalscope"> <code>WindowBase64</code> </a> y <a href="windoweventhandlers"> <code>WindowEventHandlers</code> </a> .</em>
ko: <em>이 인터페이스는 <a href="workerglobalscope"> <code>WorkerGlobalScope</code> </a> 인터페이스와 상위 <a href="eventtarget"> <code>EventTarget</code> </a> 에서 메소드를 상속 하므로 <a href="windoworworkerglobalscope"> <code>WindowTimers</code> </a> , <a href="windoworworkerglobalscope"> <code>WindowBase64</code> </a> 및 <a href="windoweventhandlers"> <code>WindowEventHandlers</code> </a> 에서 메소드를 구현합니다 .</em>
ru: <em>Этот интерфейс наследует методы от интерфейса <a href="workerglobalscope"> <code>WorkerGlobalScope</code> </a> и его родительского <a href="eventtarget"> <code>EventTarget</code> </a> и поэтому реализует методы из <a href="windoworworkerglobalscope"> <code>WindowTimers</code> </a> , <a href="windoworworkerglobalscope"> <code>WindowBase64</code> </a> и <a href="windoweventhandlers"> <code>WindowEventHandlers</code> </a> .</em>
zh_cn: <em>此接口从<a href="workerglobalscope"> <code>WorkerGlobalScope</code> </a>接口及其父<a href="eventtarget"> <code>EventTarget</code> </a>继承方法，因此从<a href="windoworworkerglobalscope"> <code>WindowTimers</code> </a>，<a href="windoworworkerglobalscope"> <code>WindowBase64</code> </a>和<a href="windoweventhandlers"> <code>WindowEventHandlers</code> </a>实现方法。</em>

source: <em>This interface inherits properties from <a href="dommatrixreadonly"><code>DOMMatrixReadOnly</code></a>, though some are modified not to be read-only.</em>
es: <em>Esta interfaz hereda propiedades de <a href="dommatrixreadonly"> <code>DOMMatrixReadOnly</code> </a> , aunque algunas se modifican para que no sean de solo lectura.</em>
ko: <em>이 인터페이스는 <a href="dommatrixreadonly"> <code>DOMMatrixReadOnly</code> </a> 에서 속성을 상속 하지만 일부는 읽기 전용이 아닌 것으로 수정되었습니다.</em>
ru: <em>Этот интерфейс наследует свойства от <a href="dommatrixreadonly"> <code>DOMMatrixReadOnly</code> </a> , хотя некоторые из них изменены и не предназначены только для чтения.</em>
zh_cn: <em>该接口从<a href="dommatrixreadonly"> <code>DOMMatrixReadOnly</code> </a>继承属性，尽管有些属性被修改为不是只读的。</em>

source: <em>This interface inherits properties from <a href="mouseevent"><code>MouseEvent</code></a> and <a href="event"><code>Event</code></a>.</em>
es: <em>Esta interfaz hereda propiedades de <a href="mouseevent"> <code>MouseEvent</code> </a> y <a href="event"> <code>Event</code> </a> .</em>
ko: <em>이 인터페이스는 <a href="mouseevent"> <code>MouseEvent</code> </a> 및 <a href="event"> <code>Event</code> 의</a> 속성을 상속합니다 .</em>
ru: <em>Этот интерфейс наследует свойства от <a href="mouseevent"> <code>MouseEvent</code> </a> и <a href="event"> <code>Event</code> </a> .</em>
zh_cn: <em>此接口从<a href="mouseevent"> <code>MouseEvent</code> </a>和<a href="event"> <code>Event</code> </a>继承属性。</em>

source: <em>This interface inherits properties from its parent, </em><a href="event"><code>Event</code></a>:
es: <em>Esta interfaz hereda propiedades de su padre, </em><a href="event"> <code>Event</code> o</a> :
ko: <em>이 인터페이스는 부모 인 </em><a href="event"> <code>Event</code> </a><em> 에서 속성을 상속합니다</em> .
ru: <em>Этот интерфейс наследует свойства от своего родителя, </em><a href="event"> <code>Event</code> </a> :
zh_cn: <em>此接口从其父</em><a href="event"> <code>Event</code> </a><em>继承属性</em>：

source: <em>This interface inherits properties from its parent, </em><em><a href="eventtarget"><code>EventTarget</code></a>.</em>
es: <em>Esta interfaz hereda propiedades de su padre, </em><em><a href="eventtarget"> <code>EventTarget</code> </a> .</em>
ko: <em>이 인터페이스는 부모 인 </em><em><a href="eventtarget"> <code>EventTarget</code> </a></em><em> 에서 속성을 상속합니다 </em><em>.</em><em></em>
ru: <em>Этот интерфейс наследует свойства от своего родителя, </em><em><a href="eventtarget"> <code>EventTarget</code> </a> .</em>
zh_cn: <em>此接口从其父</em><em><a href="eventtarget"> <code>EventTarget</code> </a></em><em>继承属性</em><em>。</em><em></em>

source: <em>This interface inherits properties from its parent, <a href="uievent"><code>UIEvent</code></a> and <a href="event"><code>Event</code></a>.</em>
es: <em>Esta interfaz hereda propiedades de su padre, <a href="uievent"> <code>UIEvent</code> </a> y <a href="event"> <code>Event</code> </a> .</em>
ko: <em>이 인터페이스는 부모 인 <a href="uievent"> <code>UIEvent</code> </a> 및 <a href="event"> <code>Event</code> </a> 에서 속성을 상속합니다 .</em>
ru: <em>Этот интерфейс наследует свойства от своего родителя, <a href="uievent"> <code>UIEvent</code> </a> и <a href="event"> <code>Event</code> </a> .</em>
zh_cn: <em>此接口从其父<a href="uievent"> <code>UIEvent</code> </a>和<a href="event"> <code>Event</code> </a>继承属性。</em>
