Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/dom/dom.*.007.xlf
Languages: es, ko, ru, zh_cn

source: <em><code>string</code>:</em><strong>Returns / Sets</strong> the element's <code><a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/input#attr-formtarget">formtarget</a></code> attribute, containing a name or keyword indicating where to display the response that is received after submitting the form. This overrides the <code><a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/form#attr-target">target</a></code> attribute of the parent form.
es: <em> <code>string</code> : </em><strong>Devuelve / Establece</strong> elatributo <code><a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/input#attr-formtarget">formtarget</a></code> del elemento, que contiene un nombre o una palabra clave que indica d&oacute;nde mostrar la respuesta que se recibe despu&eacute;s de enviar el formulario. Esto anula elatributo de <code><a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/form#attr-target">target</a></code> del formulario principal.
ko: <em> <code>string</code> : </em><strong>반환 /</strong> 양식 제출 후 수신 된 응답을 표시 할 위치를 나타내는 이름 또는 키워드를 포함하는요소의 <code><a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/input#attr-formtarget">formtarget</a></code> 속성을<strong> 설정</strong> 합니다. 이것은부모 폼의 <code><a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/form#attr-target">target</a></code> 속성보다 우선합니다.
ru: <em> <code>string</code> : </em><strong>Возвращает / Устанавливает</strong> атрибут <code><a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/input#attr-formtarget">formtarget</a></code> элемента, содержащий имя или ключевое слово, указывающее, где отображать ответ, полученный после отправки формы. Это переопределяет <code><a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/form#attr-target">target</a></code> атрибут родительской формы.
zh_cn: <em> <code>string</code> ：</em><strong>返回/设置</strong>元素的 <code><a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/input#attr-formtarget">formtarget</a></code> 属性，其中包含名称或关键字，该名称或关键字指示在提交表单后在何处显示收到的响应。这将覆盖父表单的 <code><a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/form#attr-target">target</a></code> 属性。

source: <em><code>string</code>:</em><strong>Returns / Sets</strong> the element's <code><a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/input#attr-max">max</a></code> attribute, containing the maximum (numeric or date-time) value for this item, which must not be less than its minimum (<strong>min</strong> attribute) value.
es: <em> <code>string</code> : </em><strong>Devuelve / establece</strong> elatributo <code><a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/input#attr-max">max</a></code> del elemento, que contiene el valor m&aacute;ximo (num&eacute;rico o de fecha y hora) para este elemento, que no debe ser menor que su valor m&iacute;nimo (atributo<strong> m&iacute;nimo</strong> ).
ko: <em> <code>string</code> : </em><strong>Returns /</strong> 이 항목의 <code><a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/input#attr-max">max</a></code> 값 (숫자 또는 날짜-시간)을 포함하는 요소의 최대 속성을<strong> 설정</strong> 합니다.최소값 (<strong> 최소</strong> 속성)보다 작을 수 없습니다.
ru: <em> <code>string</code> : </em><strong>Возвращает / Устанавливает</strong> атрибут <code><a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/input#attr-max">max</a></code> элемента, содержащий максимальное (числовое или дата-время) значение для этого элемента, которое не должно быть меньше его минимального значения (атрибут<strong> min</strong> ).
zh_cn: <em> <code>string</code> ：</em><strong>返回/设置</strong>元素的 <code><a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/input#attr-max">max</a></code> 属性，其中包含此项的最大值（数字或日期时间），该值不得小于其最小值（<strong> min</strong>属性）。

source: <em><code>string</code>:</em><strong>Returns / Sets</strong> the element's <code><a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/input#attr-min">min</a></code> attribute, containing the minimum (numeric or date-time) value for this item, which must not be greater than its maximum (<code><a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/input#attr-max">max</a></code> attribute) value.
es: <em> <code>string</code> : </em><strong>Devuelve / establece</strong> elatributo <code><a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/input#attr-min">min</a></code> del elemento, que contiene el valor m&iacute;nimo (num&eacute;rico o de fecha y hora) para este elemento, que no debe ser mayor que su valor m&aacute;ximo (atributo <code><a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/input#attr-max">max</a></code> ).
ko: <em> <code>string</code> : </em><strong>반환 /</strong> 이 항목의 최소 (숫자 또는 날짜-시간) 값을 포함하는 요소의 <code><a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/input#attr-min">min</a></code> 속성을<strong> 설정</strong> 합니다.이 값은 최대 ( <code><a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/input#attr-max">max</a></code> 속성) 값보다 크지 않아야합니다.
ru: <em> <code>string</code> : </em><strong>Возвращает / Устанавливает</strong> атрибут <code><a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/input#attr-min">min</a></code> элемента, содержащий минимальное (числовое или дата-время) значение для этого элемента, которое не должно быть больше его максимального значения (атрибута <code><a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/input#attr-max">max</a></code> ).
zh_cn: <em> <code>string</code> ：</em><strong>返回/设置</strong>元素的 <code><a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/input#attr-min">min</a></code> 属性，其中包含此项的最小值（数字或日期时间），该值不得大于其最大值（ <code><a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/input#attr-max">max</a></code> 属性）。

source: <em><code>string</code>:</em><strong>Returns / Sets</strong> the element's <code><a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/input#attr-name">name</a></code> attribute, containing a name that identifies the element when submitting the form.
es: <em> <code>string</code> : </em><strong>Devuelve / Establece</strong> elatributo de <code><a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/input#attr-name">name</a></code> del elemento, que contiene un nombre que identifica el elemento al enviar el formulario.
ko: <em> <code>string</code> : </em><strong>반환 /</strong> 양식을 제출할 때 요소를 식별하는 이름이 포함 된요소의 <code><a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/input#attr-name">name</a></code> 속성을<strong> 설정</strong> 합니다.
ru: <em> <code>string</code> : </em><strong>Возвращает / Устанавливает</strong> атрибут <code><a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/input#attr-name">name</a></code> элемента, содержащий имя, которое идентифицирует элемент при отправке формы.
zh_cn: <em> <code>string</code> ：</em><strong>返回/设置</strong>元素的 <code><a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/input#attr-name">name</a></code> 属性，其中包含在提交表单时标识元素的名称。

source: <em><code>string</code>:</em><strong>Returns / Sets</strong> the element's <code><a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/input#attr-pattern">pattern</a></code> attribute, containing a <u><strong>regular expression</strong></u> that the control's value is checked against. Use the <code><a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/input#attr-title">title</a></code> attribute to describe the pattern to help the user. This attribute applies when the value of the <code><a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/input#attr-type">type</a></code> attribute is <code>text</code>, <code>search</code>, <code>tel</code>, <code>url</code> or <code>email</code>; otherwise it is ignored.
es: <em> <code>string</code> : </em><strong>Devuelve / Establece</strong> elatributo de <code><a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/input#attr-pattern">pattern</a></code> del elemento, que contiene una<u><strong> expresi&oacute;n regular con la</strong></u> que se verifica el valor del control. Use elatributo de <code><a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/input#attr-title">title</a></code> para describir el patr&oacute;n para ayudar al usuario. Este atributo se aplica cuando el valor delatributo <code><a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/input#attr-type">type</a></code> es <code>text</code> , <code>search</code> , <code>tel</code> , <code>url</code> o <code>email</code> ; de lo contrario se ignora.
ko: <em> <code>string</code> : </em><strong>반환 /</strong> 컨트롤의 값을 확인하는<u><strong> 정규식을</strong></u> 포함하는요소의 <code><a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/input#attr-pattern">pattern</a></code> 속성을<strong> 설정</strong> 합니다. <code><a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/input#attr-title">title</a></code> 속성을사용하여사용자를 돕기 위해 패턴을 설명하십시오. 이 속성은 <code><a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/input#attr-type">type</a></code> 속성값이 <code>text</code> , <code>search</code> , <code>tel</code> , <code>url</code> 또는 <code>email</code> 일때 적용됩니다. 그렇지 않으면 무시됩니다.<u><strong></strong></u>
ru: <em> <code>string</code> : </em><strong>Возвращает / Устанавливает</strong> атрибут <code><a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/input#attr-pattern">pattern</a></code> элемента, содержащий<u><strong> регулярное выражение</strong></u> , с которым проверяется значениеэлементауправления. Используйтеатрибут <code><a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/input#attr-title">title</a></code> , чтобы описать шаблон, чтобы помочь пользователю. Этот атрибут применяется, когда значениематрибута <code><a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/input#attr-type">type</a></code> является <code>text</code> , <code>search</code> , <code>tel</code> , <code>url</code> или <code>email</code> ; в противном случае это игнорируется.
zh_cn: <em> <code>string</code> ：</em><strong>返回/设置</strong>元素的 <code><a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/input#attr-pattern">pattern</a></code> 属性，其中包含检查控件值的<u><strong>正则表达式</strong></u>。使用 <code><a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/input#attr-title">title</a></code> 属性描述模式以帮助用户。当 <code><a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/input#attr-type">type</a></code> 属性的值为 <code>text</code> ， <code>search</code> ， <code>tel</code> ， <code>url</code> 或 <code>email</code> 时，此属性适用；否则将被忽略。

source: <em><code>text2sign</code></em> is a <a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/ArrayBuffer"><code>ArrayBuffer</code></a> or an <a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/ArrayBufferView"><code>ArrayBufferView</code></a> containing the data to be signed.
es: <em> <code>text2sign</code> </em> es un<a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/ArrayBuffer"> <code>ArrayBuffer</code> </a> o un<a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/ArrayBufferView"> <code>ArrayBufferView</code> que</a> contiene los datos a firmar.
ko: <em> <code>text2sign</code> </em> 은서명 할 데이터를 포함하는<a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/ArrayBuffer"> <code>ArrayBuffer</code> </a> 또는<a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/ArrayBufferView"> <code>ArrayBufferView</code> </a> 입니다.
ru: <em> <code>text2sign</code> </em> - это<a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/ArrayBuffer"> <code>ArrayBuffer</code> </a> или<a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/ArrayBufferView"> <code>ArrayBufferView</code> ,</a> содержащий данные для подписи.
zh_cn: <em> <code>text2sign</code> </em>是包含要签名的数据的<a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/ArrayBuffer"> <code>ArrayBuffer</code> </a>或<a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/ArrayBufferView"> <code>ArrayBufferView</code> </a>。

source: <em><code>text2verify</code></em> is a <a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/ArrayBuffer"><code>ArrayBuffer</code></a> or an <a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/ArrayBufferView"><code>ArrayBufferView</code></a> containing the data whose signature as to be verified.
es: <em> <code>text2verify</code> </em> es un<a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/ArrayBuffer"> <code>ArrayBuffer</code> </a> o un<a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/ArrayBufferView"> <code>ArrayBufferView</code> que</a> contiene los datos cuya firma debe verificarse.
ko: <em> <code>text2verify</code> </em> 는서명을 확인할 데이터가 포함된<a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/ArrayBuffer"> <code>ArrayBuffer</code> </a> 또는<a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/ArrayBufferView"> <code>ArrayBufferView</code> </a> 입니다.
ru: <em> <code>text2verify</code> </em> - это<a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/ArrayBuffer"> <code>ArrayBuffer</code> </a> или<a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/ArrayBufferView"> <code>ArrayBufferView</code> ,</a> содержащий данные, подпись которых должна быть проверена.
zh_cn: <em> <code>text2verify</code> </em>是一个<a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/ArrayBuffer"> <code>ArrayBuffer</code> </a>或<a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/ArrayBufferView"> <code>ArrayBufferView</code> ,</a>其中包含要验证其签名的数据。

source: <em><code>unsigned long</code>:</em><strong>Returns / Sets </strong>the element's <code><a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/input#attr-size">size</a></code> attribute, containing <u><strong>size of the control</strong></u>. This value is in pixels unless the value of <code><a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/input#attr-type">type</a></code> is <code>text</code> or <code>password</code>, in which case, it is an integer number of characters. Applies only when <code><a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/input#attr-type">type</a></code> is set to <code>text</code>, <code>search</code>, <code>tel</code>, <code>url</code>, <code>email</code>, or <code>password</code>; otherwise it is ignored.
es: <em> <code>unsigned long</code> : </em><strong>Devuelve / Establece</strong> elatributo de <code><a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/input#attr-size">size</a></code> del elemento, que contiene el<u><strong> tama&ntilde;o del control</strong></u> . Este valor est&aacute; en p&iacute;xeles a menos que el valor de <code><a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/input#attr-type">type</a></code> sea <code>text</code> o o <code>password</code> , en cuyo caso, es un n&uacute;mero entero de caracteres. Se aplica solo cuando el <code><a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/input#attr-type">type</a></code> se establece en <code>text</code> o , <code>search</code> , <code>tel</code> , <code>url</code> , <code>email</code> o <code>password</code> ; de lo contrario se ignora.
ko: <em> <code>unsigned long</code> : </em><u><strong>컨트롤의 크기를</strong></u> 포함하는 요소의 <code><a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/input#attr-size">size</a></code> 속성을<strong> 반환 / 설정</strong> 합니다. <code><a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/input#attr-type">type</a></code> 의 값이 <code>text</code> 또는 <code>password</code> 가아닌 경우이 값은 픽셀 단위입니다.이 경우 정수 문자입니다. <code><a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/input#attr-type">type</a></code> 이 <code>text</code> , <code>search</code> , <code>tel</code> , <code>url</code> , <code>email</code> 또는 <code>password</code> 로 설정된경우에만 적용됩니다. 그렇지 않으면 무시됩니다.<u><strong></strong></u>
ru: <em> <code>unsigned long</code> : </em><strong>Возвращает / Устанавливает</strong> атрибут <code><a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/input#attr-size">size</a></code> элемента, содержащий<u><strong> размер элемента управления</strong></u> . Это значение указывается в пикселях, если только значение <code><a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/input#attr-type">type</a></code> не является <code>text</code> или <code>password</code> , в этом случае это целое число символов. Применяется только в том случае, если для <code><a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/input#attr-type">type</a></code> задано значение <code>text</code> , <code>search</code> , <code>tel</code> , <code>url</code> , <code>email</code> или <code>password</code> ; в противном случае это игнорируется.
zh_cn: <em> <code>unsigned long</code> ：</em><strong>返回/设置</strong>元素的 <code><a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/input#attr-size">size</a></code> 属性，其中包含<u><strong>控件的大小</strong></u>。除非 <code><a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/input#attr-type">type</a></code> 的值是 <code>text</code> 或 <code>password</code> ，否则此值以像素为单位，在这种情况下，它是整数个字符。仅当 <code><a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/input#attr-type">type</a></code> 设置为 <code>text</code> ， <code>search</code> ， <code>tel</code> ， <code>url</code> ， <code>email</code> 或 <code>password</code> 时才适用；否则将被忽略。

source: <em><code>unsigned long</code>:</em><strong>Returns / Sets </strong>the end index of the selected text. When there's no selection, this returns the offset of the character immediately following the current text input cursor position.
es: <em> <code>unsigned long</code> : </em><strong>Devuelve / Establece</strong> el &iacute;ndice final del texto seleccionado. Cuando no hay selecci&oacute;n, esto devuelve el desplazamiento del car&aacute;cter inmediatamente despu&eacute;s de la posici&oacute;n actual del cursor de entrada de texto.
ko: <em> <code>unsigned long</code> :</em> 선택된 텍스트의 끝 인덱스를<strong> 반환 / 설정</strong> 합니다. 선택이 없으면 현재 텍스트 입력 커서 위치 바로 다음에있는 문자의 오프셋을 반환합니다.
ru: <em> <code>unsigned long</code> : </em><strong>Возвращает / Устанавливает</strong> конечный индекс выделенного текста. Когда выбора нет, возвращается смещение символа, следующего сразу за текущей позицией ввода текста.
zh_cn: <em> <code>unsigned long</code> ：</em><strong>返回/设置</strong>所选文本的结束索引。如果没有选择，它将返回当前文本输入光标位置之后的字符偏移量。

source: <em><code>unsigned long</code>:</em><strong>Returns / Sets</strong> the beginning index of the selected text. When nothing is selected, this returns the position of the text input cursor (caret) inside of the <a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/input"><code>&lt;input&gt;</code></a> element.
es: <em> <code>unsigned long</code> : </em><strong>Devuelve / Establece</strong> el &iacute;ndice inicial del texto seleccionado. Cuando no se selecciona nada, esto devuelve la posici&oacute;n del cursor de entrada de texto (cursor) dentro delelemento<a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/input"> <code>&lt;input&gt;</code> </a> .
ko: <em> <code>unsigned long</code> :</em> 선택된 텍스트의 시작 인덱스를<strong> 반환 / 설정</strong> 합니다. 아무 것도 선택하지 않으면<a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/input"> <code>&lt;input&gt;</code> </a> 요소내에서 텍스트 입력 커서 (캐럿)의 위치를 ​​반환합니다.
ru: <em> <code>unsigned long</code> : </em><strong>Возвращает / Устанавливает</strong> начальный индекс выделенного текста. Если ничего не выбрано, это возвращает положение курсора ввода текста (каретки) внутри элемента<a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/input"> <code>&lt;input&gt;</code> </a> .
zh_cn: <em> <code>unsigned long</code> ：</em><strong>返回/设置</strong>所选文本的开始索引。如果未选择任何内容，则将返回<a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/input"> <code>&lt;input&gt;</code> </a>元素内部的文本输入光标（尖号）的位置。

source: <em><code>value</code></em>Optional is a <a href="../domstring"><code>DOMString</code></a> containing the new property value. If not specified, treated as the empty string.
es: <em> <code>value</code> </em> Opcional es un<a href="../domstring"> <code>DOMString</code> que</a> contiene el nuevo valor de la propiedad. Si no se especifica, se trata como la cadena vac&iacute;a.
ko: <em> <code>value</code> </em> 선택 사항은새 특성 값을 포함하는<a href="../domstring"> <code>DOMString</code> </a> 입니다. 지정하지 않으면 빈 문자열로 처리됩니다.
ru: <em> <code>value</code> </em> Необязательно -<a href="../domstring"> <code>DOMString</code> ,</a> содержащее новое значение свойства. Если не указано, обрабатывается как пустая строка.
zh_cn: <em> <code>value</code> </em>可选的是包含新属性值的<a href="../domstring"> <code>DOMString</code> </a>。如果未指定，则视为空字符串。

source: <em><em>The <code>Coordinates</code> interface <em>neither implements, nor inherits any method.</em></em></em>
es: <em><em>La interfaz de <code>Coordinates</code> <em>no implementa ni hereda ning&uacute;n m&eacute;todo.</em></em></em>
ko: <em><em> <code>Coordinates</code> 인터페이스 <em>도 구현,도 상속 어떤 방법.</em></em></em>
ru: <em><em> <code>Coordinates</code> интерфейс <em>ни орудия, ни наследуют любой метод.</em></em></em>
zh_cn: <em><em>的 <code>Coordinates</code> 界面<em>既不器具，也不继承的任何方法。</em></em></em>

source: <em><em>The <code>Geolocation</code> interface doesn't inherit any </em>method</em>.
es: <em><em>La interfaz de <code>Geolocation</code> no hereda ning&uacute;n</em> m&eacute;todo</em> .
ko: <em><em> <code>Geolocation</code> 인터페이스는 상속하지 않는</em> 방법</em> .
ru: <em><em>Интерфейс <code>Geolocation</code> не наследует никакой</em> метод</em> .
zh_cn: <em><em>该 <code>Geolocation</code> 接口不继承任何</em>方法</em>。

source: <em><em>The <code>Performance</code> interface doesn't inherit any </em>method</em>s.
es: <em><em>La interfaz de <code>Performance</code> no hereda ning&uacute;n</em> m&eacute;todo</em> .
ko: <em><em> <code>Performance</code> 인터페이스는 상속하지 않는</em> 방법</em> 들.
ru: <em><em>Интерфейс <code>Performance</code> не наследует никакой</em> метод</em> s.
zh_cn: <em><em>在 <code>Performance</code> 接口不继承任何</em>方法</em>秒。

source: <em><em>The <code>Performance</code> interface doesn't inherit any </em>methods</em>.
es: <em><em>La interfaz de <code>Performance</code> no hereda ning&uacute;n</em> m&eacute;todo</em> .
ko: <em><em> <code>Performance</code> 인터페이스는 상속하지 않는</em> 방법</em> .
ru: <em><em>Интерфейс <code>Performance</code> не наследует никаких</em> методов</em> .
zh_cn: <em><em>在 <code>Performance</code> 接口不继承任何</em>方法</em>。

source: <em><em>The <code>Position</code> interface <em>neither implements, nor inherit any method.</em></em></em>
es: <em><em>La interfaz de <code>Position</code> <em>no implementa ni hereda ning&uacute;n m&eacute;todo.</em></em></em>
ko: <em><em> <code>Position</code> 인터페이스 <em>도 구현 없으며, 어떤 방법을 상속합니다.</em></em></em>
ru: <em><em> <code>Position</code> интерфейса <em>ни орудия, ни унаследуют любым способом.</em></em></em>
zh_cn: <em><em>该 <code>Position</code> 接口<em>既不工具，也没有继承任何方法。</em></em></em>
