Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/dom/dom.*.007.xlf
Languages: es, ko, ru, zh_cn

source: <em>This interface <em>inherits properties from its parents, <a href="uievent"><code>UIEvent</code></a> and <a href="event"><code>Event</code></a>.</em></em>
es: <em>Esta interfaz <em>hereda propiedades de sus padres, <a href="uievent"> <code>UIEvent</code> </a> y <a href="event"> <code>Event</code> </a> .</em></em>
ko: <em>이 인터페이스 <em>는 부모 인 <a href="uievent"> <code>UIEvent</code> </a> 및 <a href="event"> <code>Event</code> 의</a> 속성을 상속합니다 .</em></em>
ru: <em>Этот интерфейс <em>наследует свойства от своих родителей, <a href="uievent"> <code>UIEvent</code> </a> и <a href="event"> <code>Event</code> </a> .</em></em>
zh_cn: <em>该接口<em>从其父<a href="uievent"> <code>UIEvent</code> </a>和<a href="event"> <code>Event</code> </a>继承属性。</em></em>

source: <em>This interface also inherits from the <a href="node"><code>Node</code></a> and <a href="eventtarget"><code>EventTarget</code></a> interfaces.</em>
es: <em>Esta interfaz tambi&eacute;n hereda de las interfaces <a href="node"> <code>Node</code> </a> y <a href="eventtarget"> <code>EventTarget</code> </a> .</em>
ko: <em>이 인터페이스는 <a href="node"> <code>Node</code> </a> 및 <a href="eventtarget"> <code>EventTarget</code> </a> 인터페이스에서도 상속 됩니다.</em>
ru: <em>Этот интерфейс также наследуется от интерфейсов <a href="node"> <code>Node</code> </a> и <a href="eventtarget"> <code>EventTarget</code> </a> .</em>
zh_cn: <em>该接口还继承自<a href="node"> <code>Node</code> </a>和<a href="eventtarget"> <code>EventTarget</code> </a>接口。</em>

source: <em>This interface also inherits methods from <a href="eventtarget"><code>EventTarget</code></a>.</em>
es: <em>Esta interfaz tambi&eacute;n hereda m&eacute;todos de <a href="eventtarget"> <code>EventTarget</code> </a> .</em>
ko: <em>이 인터페이스는 <a href="eventtarget"> <code>EventTarget</code> 의</a> 메소드도 상속합니다 .</em>
ru: <em>Этот интерфейс также наследует методы от <a href="eventtarget"> <code>EventTarget</code> </a> .</em>
zh_cn: <em>此接口还从<a href="eventtarget"> <code>EventTarget</code> </a>继承方法。</em>

source: <em>This interface also inherits methods from its ancestors <a href="htmlelement"><code>HTMLElement</code></a>, <a href="element"><code>Element</code></a>, <a href="node"><code>Node</code></a>, and <a href="eventtarget"><code>EventTarget</code></a>.</em>
es: <em>Esta interfaz tambi&eacute;n hereda m&eacute;todos de sus ancestros <a href="htmlelement"> <code>HTMLElement</code> </a> , <a href="element"> <code>Element</code> </a> , <a href="node"> <code>Node</code> </a> y <a href="eventtarget"> <code>EventTarget</code> </a> .</em>
ko: <em>이 인터페이스는 또한 조상 <a href="htmlelement"> <code>HTMLElement</code> </a> , <a href="element"> <code>Element</code> </a> , <a href="node"> <code>Node</code> </a> 및 <a href="eventtarget"> <code>EventTarget</code> </a> 으로부터 메소드를 상속합니다 .</em>
ru: <em>Этот интерфейс также наследует методы от своих предков <a href="htmlelement"> <code>HTMLElement</code> </a> , <a href="element"> <code>Element</code> </a> , <a href="node"> <code>Node</code> </a> и <a href="eventtarget"> <code>EventTarget</code> </a> .</em>
zh_cn: <em>此接口还从其祖先<a href="htmlelement"> <code>HTMLElement</code> </a>，<a href="element"> <code>Element</code> </a>，<a href="node"> <code>Node</code> </a>和<a href="eventtarget"> <code>EventTarget</code> </a>继承方法。</em>

source: <em>This interface also inherits methods from its parent interface, <a href="eventtarget"><code>EventTarget</code></a>.</em>
es: <em>Esta interfaz tambi&eacute;n hereda m&eacute;todos de su interfaz principal, <a href="eventtarget"> <code>EventTarget</code> </a> .</em>
ko: <em>이 인터페이스는 또한 부모 인터페이스 인 <a href="eventtarget"> <code>EventTarget</code> </a> 에서 메소드를 상속합니다 .</em>
ru: <em>Этот интерфейс также наследует методы от своего родительского интерфейса <a href="eventtarget"> <code>EventTarget</code> </a> .</em>
zh_cn: <em>此接口还从其父接口<a href="eventtarget"> <code>EventTarget</code> </a>继承方法。</em>

source: <em>This interface also inherits methods from its parent, </em><em><a href="svggeometryelement"><code>SVGGeometryElement</code></a>.</em>
es: <em>Esta interfaz tambi&eacute;n hereda m&eacute;todos de su padre, </em><em><a href="svggeometryelement"> <code>SVGGeometryElement</code> </a> .</em>
ko: <em>이 인터페이스는 부모 </em><em><a href="svggeometryelement"> <code>SVGGeometryElement</code> 의</a></em><em> 메소드도 상속합니다 </em><em>.</em><em></em>
ru: <em>Этот интерфейс также наследует методы от своего родителя, </em><em><a href="svggeometryelement"> <code>SVGGeometryElement</code> </a> .</em>
zh_cn: <em>此接口还从其父级</em><em><a href="svggeometryelement"> <code>SVGGeometryElement</code> </a></em><em>继承方法</em><em>。</em><em></em>

source: <em>This interface also inherits methods from its parent, <a href="event"><code>Event</code></a>.</em>
es: <em>Esta interfaz tambi&eacute;n hereda m&eacute;todos de su padre, <a href="event"> <code>Event</code> o</a> .</em>
ko: <em>이 인터페이스는 또한 부모 인 <a href="event"> <code>Event</code> </a> 에서 메소드를 상속합니다 .</em>
ru: <em>Этот интерфейс также наследует методы от своего родителя, <a href="event"> <code>Event</code> </a> .</em>
zh_cn: <em>此接口还从其父<a href="event"> <code>Event</code> </a>继承方法。</em>

source: <em>This interface also inherits methods from its parent, <a href="eventtarget"><code>EventTarget</code></a>.</em>
es: <em>Esta interfaz tambi&eacute;n hereda m&eacute;todos de su padre, <a href="eventtarget"> <code>EventTarget</code> </a> .</em>
ko: <em>이 인터페이스는 또한 부모 인 <a href="eventtarget"> <code>EventTarget</code> </a> 에서 메소드를 상속합니다 .</em>
ru: <em>Этот интерфейс также наследует методы от своего родителя <a href="eventtarget"> <code>EventTarget</code> </a> .</em>
zh_cn: <em>此接口还从其父<a href="eventtarget"> <code>EventTarget</code> </a>继承方法。</em>

source: <em>This interface also inherits methods from its parent, <a href="htmlelement"><code>HTMLElement</code></a>.</em>
es: <em>Esta interfaz tambi&eacute;n hereda m&eacute;todos de su padre, <a href="htmlelement"> <code>HTMLElement</code> </a> .</em>
ko: <em>이 인터페이스는 또한 부모 <a href="htmlelement"> <code>HTMLElement</code> 의</a> 메소드를 상속합니다 .</em>
ru: <em>Этот интерфейс также наследует методы от своего родителя, <a href="htmlelement"> <code>HTMLElement</code> </a> .</em>
zh_cn: <em>此接口还从其父<a href="htmlelement"> <code>HTMLElement</code> </a>继承方法。</em>

source: <em>This interface also inherits methods from its parent, <a href="svgelement"><code>SVGElement</code></a>.</em>
es: <em>Esta interfaz tambi&eacute;n hereda m&eacute;todos de su padre, <a href="svgelement"> <code>SVGElement</code> </a> .</em>
ko: <em>이 인터페이스는 부모 <a href="svgelement"> <code>SVGElement</code> 의</a> 메소드도 상속합니다 .</em>
ru: <em>Этот интерфейс также наследует методы от своего родителя, <a href="svgelement"> <code>SVGElement</code> </a> .</em>
zh_cn: <em>此接口还从其父级<a href="svgelement"> <code>SVGElement</code> </a>继承方法。</em>

source: <em>This interface also inherits methods from its parent, <a href="svggraphicselement"><code>SVGGraphicsElement</code></a> and also implements the ones from <a href="svgzoomandpan"><code>SVGZoomAndPan</code></a>, <a href="https://developer.mozilla.org/en-US/docs/Web/API/SVGFitToViewBox"><code>SVGFitToViewBox</code></a>, and <a href="windoweventhandlers"><code>WindowEventHandlers</code></a>.</em>
es: <em>Esta interfaz tambi&eacute;n hereda m&eacute;todos de su padre, <a href="svggraphicselement"> <code>SVGGraphicsElement</code> </a> y tambi&eacute;n implementa los de <a href="svgzoomandpan"> <code>SVGZoomAndPan</code> </a> , <a href="https://developer.mozilla.org/en-US/docs/Web/API/SVGFitToViewBox"> <code>SVGFitToViewBox</code> </a> y <a href="windoweventhandlers"> <code>WindowEventHandlers</code> </a> .</em>
ko: <em>이 인터페이스는 상위 <a href="svggraphicselement"> <code>SVGGraphicsElement</code> 의</a> 메소드를 상속 하고 <a href="svgzoomandpan"> <code>SVGZoomAndPan</code> </a> , <a href="https://developer.mozilla.org/en-US/docs/Web/API/SVGFitToViewBox"> <code>SVGFitToViewBox</code> </a> 및 <a href="windoweventhandlers"> <code>WindowEventHandlers</code> 의 메소드</a> 도 구현합니다 .</em>
ru: <em>Этот интерфейс также наследует методы от своего родителя <a href="svggraphicselement"> <code>SVGGraphicsElement</code> ,</a> а также реализует <a href="svgzoomandpan"> <code>SVGZoomAndPan</code> </a> из SVGZoomAndPan , <a href="https://developer.mozilla.org/en-US/docs/Web/API/SVGFitToViewBox"> <code>SVGFitToViewBox</code> </a> и <a href="windoweventhandlers"> <code>WindowEventHandlers</code> </a> .</em>
zh_cn: <em>此接口还从其父级<a href="svggraphicselement"> <code>SVGGraphicsElement</code> </a>继承方法，并从<a href="svgzoomandpan"> <code>SVGZoomAndPan</code> </a>，<a href="https://developer.mozilla.org/en-US/docs/Web/API/SVGFitToViewBox"> <code>SVGFitToViewBox</code> </a>和<a href="windoweventhandlers"> <code>WindowEventHandlers</code> 中实现方法</a>。</em>

source: <em>This interface also inherits methods from its parent, <a href="svggraphicselement"><code>SVGGraphicsElement</code></a>.</em>
es: <em>Esta interfaz tambi&eacute;n hereda m&eacute;todos de su padre, <a href="svggraphicselement"> <code>SVGGraphicsElement</code> </a> .</em>
ko: <em>이 인터페이스는 또한 상위 <a href="svggraphicselement"> <code>SVGGraphicsElement</code> 의</a> 메소드를 상속합니다 .</em>
ru: <em>Этот интерфейс также наследует методы от своего родителя, <a href="svggraphicselement"> <code>SVGGraphicsElement</code> </a> .</em>
zh_cn: <em>此接口还从其父级<a href="svggraphicselement"> <code>SVGGraphicsElement</code> </a>继承方法。</em>

source: <em>This interface also inherits methods of its parent, <a href="event"><code>Event</code></a>.</em>
es: <em>Esta interfaz tambi&eacute;n hereda los m&eacute;todos de su padre, <a href="event"> <code>Event</code> o</a> .</em>
ko: <em>이 인터페이스는 또한 부모 인 <a href="event"> <code>Event</code> 의</a> 메소드를 상속합니다 .</em>
ru: <em>Этот интерфейс также наследует методы своего родителя, <a href="event"> <code>Event</code> </a> .</em>
zh_cn: <em>此接口还继承其父<a href="event"> <code>Event</code> 的方法</a>。</em>

source: <em>This interface also inherits methods of its parent, <a href="eventtarget"><code>EventTarget</code></a>.</em>
es: <em>Esta interfaz tambi&eacute;n hereda los m&eacute;todos de su padre, <a href="eventtarget"> <code>EventTarget</code> </a> .</em>
ko: <em>이 인터페이스는 또한 부모 인 <a href="eventtarget"> <code>EventTarget</code> 의</a> 메소드를 상속합니다 .</em>
ru: <em>Этот интерфейс также наследует методы своего родителя, <a href="eventtarget"> <code>EventTarget</code> </a> .</em>
zh_cn: <em>此接口还继承其父<a href="eventtarget"> <code>EventTarget</code> 的方法</a>。</em>

source: <em>This interface also inherits methods of its parent, <a href="svgelement"><code>SVGElement</code></a>, and also implements methods of <a href="svgfilterprimitivestandardattributes"><code>SVGFilterPrimitiveStandardAttributes</code></a>.</em>
es: <em>Esta interfaz tambi&eacute;n hereda los m&eacute;todos de su padre, <a href="svgelement"> <code>SVGElement</code> </a> , y tambi&eacute;n implementa m&eacute;todos de <a href="svgfilterprimitivestandardattributes"> <code>SVGFilterPrimitiveStandardAttributes</code> </a> .</em>
ko: <em>이 인터페이스는 또한 부모의 방법 상속 <a href="svgelement"> <code>SVGElement</code> </a> 도, 그리고 구현 방법 <a href="svgfilterprimitivestandardattributes"> <code>SVGFilterPrimitiveStandardAttributes</code> 을</a> .</em>
ru: <em>Этот интерфейс также наследует методы своего родителя <a href="svgelement"> <code>SVGElement</code> </a> , а также реализует методы <a href="svgfilterprimitivestandardattributes"> <code>SVGFilterPrimitiveStandardAttributes</code> </a> .</em>
zh_cn: <em>此接口还继承其父级<a href="svgelement"> <code>SVGElement</code> 的</a>方法，并且还实现<a href="svgfilterprimitivestandardattributes"> <code>SVGFilterPrimitiveStandardAttributes</code> 的</a>方法。</em>

source: <em>This interface also inherits methods of its parent, <a href="uievent"><code>UIEvent</code></a>, and its ancestor &mdash; <a href="event"><code>Event</code></a>.</em>
es: <em>Esta interfaz tambi&eacute;n hereda los m&eacute;todos de su padre, <a href="uievent"> <code>UIEvent</code> </a> y su antecesor: <a href="event"> <code>Event</code> o</a> .</em>
ko: <em>이 인터페이스는 부모, <a href="uievent"> <code>UIEvent</code> </a> 및 조상 인 <a href="event"> <code>Event</code> 의</a> 메소드도 상속합니다 .</em>
ru: <em>Этот интерфейс также наследует методы своего родителя, <a href="uievent"> <code>UIEvent</code> </a> , и его предка - <a href="event"> <code>Event</code> </a> .</em>
zh_cn: <em>此接口还继承其父<a href="uievent"> <code>UIEvent</code> </a>及其祖先<a href="event"> <code>Event</code> 的方法</a>。</em>

source: <em>This interface also inherits methods of its parents, <a href="uievent"><code>UIEvent</code></a> and <a href="event"><code>Event</code></a>.</em>
es: <em>Esta interfaz tambi&eacute;n hereda los m&eacute;todos de sus padres, <a href="uievent"> <code>UIEvent</code> </a> y <a href="event"> <code>Event</code> </a> .</em>
ko: <em>이 인터페이스는 부모의 <a href="uievent"> <code>UIEvent</code> </a> 및 <a href="event"> <code>Event</code> </a> 메소드도 상속합니다 .</em>
ru: <em>Этот интерфейс также наследует методы своих родителей, <a href="uievent"> <code>UIEvent</code> </a> и <a href="event"> <code>Event</code> </a> .</em>
zh_cn: <em>此接口还继承其父方法<a href="uievent"> <code>UIEvent</code> </a>和<a href="event"> <code>Event</code> </a>。</em>

source: <em>This interface also inherits properties from <a href="eventtarget"><code>EventTarget</code></a>.</em>
es: <em>Esta interfaz tambi&eacute;n hereda propiedades de <a href="eventtarget"> <code>EventTarget</code> </a> .</em>
ko: <em>이 인터페이스는 <a href="eventtarget"> <code>EventTarget</code> 의</a> 속성도 상속합니다 .</em>
ru: <em>Этот интерфейс также наследует свойства от <a href="eventtarget"> <code>EventTarget</code> </a> .</em>
zh_cn: <em>此接口还从<a href="eventtarget"> <code>EventTarget</code> </a>继承属性。</em>

source: <em>This interface also inherits properties from <a href="texttrackcue"><code>TextTrackCue</code></a>.</em>
es: <em>Esta interfaz tambi&eacute;n hereda propiedades de <a href="texttrackcue"> <code>TextTrackCue</code> </a> .</em>
ko: <em>이 인터페이스는 <a href="texttrackcue"> <code>TextTrackCue</code> 의</a> 속성도 상속합니다 .</em>
ru: <em>Этот интерфейс также наследует свойства от <a href="texttrackcue"> <code>TextTrackCue</code> </a> .</em>
zh_cn: <em>此接口还从<a href="texttrackcue"> <code>TextTrackCue</code> </a>继承属性。</em>

source: <em>This interface also inherits properties from its ancestors </em><em><a href="htmlelement"><code>HTMLElement</code></a>, <a href="element"><code>Element</code></a>, <a href="node"><code>Node</code></a>, and <a href="eventtarget"><code>EventTarget</code></a>.</em>
es: <em>Esta interfaz tambi&eacute;n hereda propiedades de sus ancestros </em><em><a href="htmlelement"> <code>HTMLElement</code> </a> , <a href="element"> <code>Element</code> </a> , <a href="node"> <code>Node</code> </a> y <a href="eventtarget"> <code>EventTarget</code> </a> .</em>
ko: <em>이 인터페이스는 또한 조상 </em><em><a href="htmlelement"> <code>HTMLElement</code> </a></em><em> , </em><em><a href="element"> <code>Element</code> </a></em><em> , </em><em><a href="node"> <code>Node</code> </a></em><em> 및 </em><em><a href="eventtarget"> <code>EventTarget</code> </a></em><em> 으로부터 속성을 상속합니다 </em><em>.</em><em></em>
ru: <em>Этот интерфейс также наследует свойства от своих предков </em><em><a href="htmlelement"> <code>HTMLElement</code> </a> , <a href="element"> <code>Element</code> </a> , <a href="node"> <code>Node</code> </a> и <a href="eventtarget"> <code>EventTarget</code> </a> .</em>
zh_cn: <em>此接口还从其祖先</em><em><a href="htmlelement"> <code>HTMLElement</code> </a></em><em>，</em><em><a href="element"> <code>Element</code> </a></em><em>，</em><em><a href="node"> <code>Node</code> </a></em><em>和</em><em><a href="eventtarget"> <code>EventTarget</code> </a></em><em>继承属性</em><em>。</em><em></em>

source: <em>This interface also inherits properties from its parent <a href="cssrule"><code>CSSRule</code></a>.</em>
es: <em>Esta interfaz tambi&eacute;n hereda propiedades de su <a href="cssrule"> <code>CSSRule</code> </a> padre .</em>
ko: <em>이 인터페이스는 부모 <a href="cssrule"> <code>CSSRule</code> </a> 로부터 속성을 상속받습니다 .</em>
ru: <em>Этот интерфейс также наследует свойства от своего родительского <a href="cssrule"> <code>CSSRule</code> </a> .</em>
zh_cn: <em>此接口还从其父<a href="cssrule"> <code>CSSRule</code> </a>继承属性。</em>

source: <em>This interface also inherits properties from its parent interface, <a href="eventtarget"><code>EventTarget</code></a>.</em>
es: <em>Esta interfaz tambi&eacute;n hereda propiedades de su interfaz principal, <a href="eventtarget"> <code>EventTarget</code> </a> .</em>
ko: <em>이 인터페이스는 또한 부모 인터페이스 인 <a href="eventtarget"> <code>EventTarget</code> </a> 에서 속성을 상속합니다 .</em>
ru: <em>Этот интерфейс также наследует свойства от своего родительского интерфейса <a href="eventtarget"> <code>EventTarget</code> </a> .</em>
zh_cn: <em>此接口还从其父接口<a href="eventtarget"> <code>EventTarget</code> </a>继承属性。</em>

source: <em>This interface also inherits properties from its parent interface, <a href="svgelement"><code>SVGElement</code></a> and implements properties from <a href="linkstyle"><code>LinkStyle</code></a>.</em>
es: <em>Esta interfaz tambi&eacute;n hereda propiedades de su interfaz principal, <a href="svgelement"> <code>SVGElement</code> </a> e implementa propiedades de <a href="linkstyle"> <code>LinkStyle</code> </a> .</em>
ko: <em>이 인터페이스는 부모 인터페이스 <a href="svgelement"> <code>SVGElement</code> </a> 에서 속성을 상속 하고 <a href="linkstyle"> <code>LinkStyle</code> </a> 에서 속성을 구현합니다 .</em>
ru: <em>Этот интерфейс также наследует свойства от своего родительского интерфейса <a href="svgelement"> <code>SVGElement</code> </a> и реализует свойства из <a href="linkstyle"> <code>LinkStyle</code> </a> .</em>
zh_cn: <em>此接口还从其父接口<a href="svgelement"> <code>SVGElement</code> </a>继承属性，并从<a href="linkstyle"> <code>LinkStyle</code> </a>实现属性。</em>

source: <em>This interface also inherits properties from its parent interface, <a href="svgelement"><code>SVGElement</code></a>, and also implements properties of <a href="svgfilterprimitivestandardattributes"><code>SVGFilterPrimitiveStandardAttributes</code></a>.</em>
es: <em>Esta interfaz tambi&eacute;n hereda propiedades de su interfaz principal, <a href="svgelement"> <code>SVGElement</code> </a> , y tambi&eacute;n implementa propiedades de <a href="svgfilterprimitivestandardattributes"> <code>SVGFilterPrimitiveStandardAttributes</code> </a> .</em>
ko: <em>이 인터페이스는 또한 부모 인터페이스에서 속성을 상속 <a href="svgelement"> <code>SVGElement</code> </a> , 그리고 또한 구현 속성 <a href="svgfilterprimitivestandardattributes"> <code>SVGFilterPrimitiveStandardAttributes</code> 을</a> .</em>
ru: <em>Этот интерфейс также наследует свойства своего родительского интерфейса <a href="svgelement"> <code>SVGElement</code> </a> , а также реализует свойства <a href="svgfilterprimitivestandardattributes"> <code>SVGFilterPrimitiveStandardAttributes</code> </a> .</em>
zh_cn: <em>此接口还从其父接口<a href="svgelement"> <code>SVGElement</code> </a>继承属性，并且还实现<a href="svgfilterprimitivestandardattributes"> <code>SVGFilterPrimitiveStandardAttributes</code> 的</a>属性。</em>

source: <em>This interface also inherits properties from its parent interface, <a href="svgelement"><code>SVGElement</code></a>, and implements properties of <a href="svgfilterprimitivestandardattributes"><code>SVGFilterPrimitiveStandardAttributes</code></a> and <a href="svgurireference"><code>SVGURIReference</code></a>.</em>
es: <em>Esta interfaz tambi&eacute;n hereda las propiedades de su interfaz principal, <a href="svgelement"> <code>SVGElement</code> </a> , e implementa las propiedades de <a href="svgfilterprimitivestandardattributes"> <code>SVGFilterPrimitiveStandardAttributes</code> </a> y <a href="svgurireference"> <code>SVGURIReference</code> </a> .</em>
ko: <em>이 인터페이스는 부모 인터페이스 <a href="svgelement"> <code>SVGElement</code> </a> 로부터 속성을 상속 <a href="svgfilterprimitivestandardattributes"> <code>SVGFilterPrimitiveStandardAttributes</code> </a> 및 <a href="svgurireference"> <code>SVGURIReference</code> 의</a> 속성을 구현합니다 .</em>
ru: <em>Этот интерфейс также наследует свойства от своего родительского интерфейса <a href="svgelement"> <code>SVGElement</code> </a> и реализует свойства <a href="svgfilterprimitivestandardattributes"> <code>SVGFilterPrimitiveStandardAttributes</code> </a> и <a href="svgurireference"> <code>SVGURIReference</code> </a> .</em>
zh_cn: <em>此接口还从其父接口<a href="svgelement"> <code>SVGElement</code> </a>继承属性，并实现<a href="svgfilterprimitivestandardattributes"> <code>SVGFilterPrimitiveStandardAttributes</code> </a>和<a href="svgurireference"> <code>SVGURIReference</code> 的</a>属性。</em>

source: <em>This interface also inherits properties from its parent interface, <a href="svgelement"><code>SVGElement</code></a>, and implements properties of <a href="svgfilterprimitivestandardattributes"><code>SVGFilterPrimitiveStandardAttributes</code></a>.</em>
es: <em>Esta interfaz tambi&eacute;n hereda propiedades de su interfaz principal, <a href="svgelement"> <code>SVGElement</code> </a> , e implementa propiedades de <a href="svgfilterprimitivestandardattributes"> <code>SVGFilterPrimitiveStandardAttributes</code> </a> .</em>
ko: <em>이 인터페이스는 또한 부모 인터페이스에서 속성을 상속 <a href="svgelement"> <code>SVGElement</code> </a> , 그리고 구현 속성 <a href="svgfilterprimitivestandardattributes"> <code>SVGFilterPrimitiveStandardAttributes</code> 을</a> .</em>
ru: <em>Этот интерфейс также наследует свойства от своего родительского интерфейса <a href="svgelement"> <code>SVGElement</code> </a> и реализует свойства <a href="svgfilterprimitivestandardattributes"> <code>SVGFilterPrimitiveStandardAttributes</code> </a> .</em>
zh_cn: <em>此接口还从其父接口<a href="svgelement"> <code>SVGElement</code> </a>继承属性，并实现<a href="svgfilterprimitivestandardattributes"> <code>SVGFilterPrimitiveStandardAttributes</code> 的</a>属性。</em>

source: <em>This interface also inherits properties from its parent interface, <a href="svgelement"><code>SVGElement</code></a>.</em>
es: <em>Esta interfaz tambi&eacute;n hereda propiedades de su interfaz principal, <a href="svgelement"> <code>SVGElement</code> </a> .</em>
ko: <em>이 인터페이스는 부모 인터페이스 <a href="svgelement"> <code>SVGElement</code> </a> 로부터 속성을 상속합니다 .</em>
ru: <em>Этот интерфейс также наследует свойства от своего родительского интерфейса, <a href="svgelement"> <code>SVGElement</code> </a> .</em>
zh_cn: <em>此接口还从其父接口<a href="svgelement"> <code>SVGElement</code> </a>继承属性。</em>

source: <em>This interface also inherits properties from its parent interface, <a href="svgelement"><code>SVGElement</code></a></em><em>, and also implements properties of <a href="svgfilterprimitivestandardattributes"><code>SVGFilterPrimitiveStandardAttributes</code></a>.</em>
es: <em>Esta interfaz tambi&eacute;n hereda propiedades de su interfaz principal, <a href="svgelement"> <code>SVGElement</code> </a></em><em> , y tambi&eacute;n implementa propiedades de <a href="svgfilterprimitivestandardattributes"> <code>SVGFilterPrimitiveStandardAttributes</code> </a> .</em>
ko: <em>이 인터페이스는 또한 부모 인터페이스에서 속성을 상속 <a href="svgelement"> <code>SVGElement</code> </a></em><em> , 그리고 또한 구현 속성 <a href="svgfilterprimitivestandardattributes"> <code>SVGFilterPrimitiveStandardAttributes</code> 을</a> .</em>
ru: <em>Этот интерфейс также наследует свойства своего родительского интерфейса <a href="svgelement"> <code>SVGElement</code> </a></em><em> , а также реализует свойства <a href="svgfilterprimitivestandardattributes"> <code>SVGFilterPrimitiveStandardAttributes</code> </a> .</em>
zh_cn: <em>此接口还从其父接口<a href="svgelement"> <code>SVGElement</code> </a></em><em>继承属性</em><em>，并且还实现<a href="svgfilterprimitivestandardattributes"> <code>SVGFilterPrimitiveStandardAttributes</code> 的</a>属性。</em>
