Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/dom/dom.*.007.xlf
Languages: es, ko, ru, zh_cn

source: <em><code>algo</code></em> is a dictionary object defining the key generation function to use. Supported algo are: <a href="../web_crypto_api/supported_algorithms#AES-CBC">AES-CBC</a>, <code>AES-CTR</code>, <code>AES-GCM</code>, <code>RSA-OAEP</code>, <code>AES-KW</code>, <code>HMAC</code>, <code>RSASSA-PKCS1-v1_5</code>, <code>ECDSA</code>, <code>ECDH</code>, and <code>DH</code>. Format of the dictionary object is:
es: <em> <code>algo</code> </em> es un objeto de diccionario que define la funci&oacute;n de generaci&oacute;n de claves a utilizar. Algunos de los elementos admitidos son:<a href="../web_crypto_api/supported_algorithms#AES-CBC"> AES-CBC</a> , <code>AES-CTR</code> , <code>AES-GCM</code> , <code>RSA-OAEP</code> , <code>AES-KW</code> , <code>HMAC</code> , <code>RSASSA-PKCS1-v1_5</code> , <code>ECDSA</code> , <code>ECDH</code> y <code>DH</code> . El formato del objeto del diccionario es:
ko: <em> <code>algo</code> </em> 는 사용할 키 생성 기능을 정의하는 사전 객체입니다. 지원되는 알고리즘은<a href="../web_crypto_api/supported_algorithms#AES-CBC"> AES-CBC</a> , <code>AES-CTR</code> , <code>AES-GCM</code> , <code>RSA-OAEP</code> , <code>AES-KW</code> , <code>HMAC</code> , <code>RSASSA-PKCS1-v1_5</code> , <code>ECDSA</code> , <code>ECDH</code> 및 <code>DH</code> 입니다. 사전 객체의 형식은 다음과 같습니다.

source: <em><code>algorithm</code></em> is an object specifying the encryption function to be used and its parameters; if there are no parameters, <em>algorithm</em> can be a <a href="../domstring"><code>DOMString</code></a> with the algorithm name. Supported values<a href="https://www.w3.org/TR/WebCryptoAPI/#algorithm-overview">&sup1;</a> are:
es: <em> <code>algorithm</code> </em> es un objeto que especifica la funci&oacute;n de cifrado que se utilizar&aacute; y sus par&aacute;metros; Si no hay par&aacute;metros, el<em> algoritmo</em> puede ser una<a href="../domstring"> <code>DOMString</code> </a> con el nombre del algoritmo. Los valores admitidos<a href="https://www.w3.org/TR/WebCryptoAPI/#algorithm-overview"> &sup1;</a> son:
ko: <em> <code>algorithm</code> </em> 은 사용할 암호화 기능과 해당 매개 변수를 지정하는 객체입니다. 매개 변수가없는 경우<em> 알고리즘</em> 은알고리즘 이름을 가진<a href="../domstring"> <code>DOMString</code> 일</a> 수 있습니다. 지원되는 값<a href="https://www.w3.org/TR/WebCryptoAPI/#algorithm-overview"> &sup1;</a> 는 다음과 같습니다.

source: <em><code>algorithm</code></em> specifies the signature algorithm to use and its parameters:
es: <em> <code>algorithm</code> </em> especifica el algoritmo de firma a utilizar y sus par&aacute;metros:
ko: <em> <code>algorithm</code> </em> 은 사용할 서명 알고리즘과 해당 매개 변수를 지정합니다.

source: <code>www.mozilla.org</code> &mdash; group1, origin2
es: <code>www.mozilla.org</code> - grupo1, origen2

source: <em><code>argument</code></em><code> Optional</code>
es: <em> <code>argument</code> o</em> <code> Optional</code>
