Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/dom/dom.*.011.xlf
Languages: ja, ko, ru, zh_cn

source: A touch-sensitive surface. This may be a trackpad, a touch screen, or even a virtual mapping of a user's desk surface (or mousepad) with the physical screen.
ja: タッチセンシティブな表面。これは、トラックパッド、タッチスクリーン、あるいはユーザーの机の表面(またはマウスパッド)と物理的な画面を仮想的にマッピングしたものである場合もあります。
ko: 터치 감지 표면. 이것은 트랙 패드, 터치 스크린, 또는 심지어 물리적 인 스크린과 사용자의 책상 표면 (또는 마우스 패드)의 가상 매핑 일 수있다.
ru: Сенсорная поверхность.Это может быть трекпад,сенсорный экран или даже виртуальное отображение поверхности рабочего стола (или мыши)с помощью физического экрана.
zh_cn: 一个触摸敏感表面。这可能是一个触控板、一个触摸屏,甚至是用户的桌面(或鼠标垫)与物理屏幕的虚拟映射。

source: A transceiver is uniquely identified using its <a href="rtcrtptransceiver/mid"><code>mid</code></a> property, which is the same as the media ID (<code>mid</code>) of its corresponding m-line. An <code>RTCRtpTransceiver</code> is <strong>associated</strong> with an m-line if its <code>mid</code> is non-null; otherwise it's considered disassociated.
ja: トランシーバーは、対応するm行のメディアID（ <code>mid</code> ）と同じ<a href="rtcrtptransceiver/mid"> <code>mid</code> </a>プロパティを使用して一意に識別されます。AN <code>RTCRtpTransceiver</code> はれる<strong>関連</strong>その場合のM行と <code>mid</code> 非ヌルです。それ以外の場合は、関連付けが解除されたと見なされます。<strong></strong>
ko: 트랜시버는 해당 m- 라인 의 미디어 ID ( <code>mid</code> ) 와 동일한 <a href="rtcrtptransceiver/mid"> <code>mid</code> </a> 속성을 사용하여 고유하게 식별 됩니다. <code>RTCRtpTransceiver</code> 가 된다 <strong>연관된</strong> 의 경우 m 행으로 <code>mid</code> 비 - 널; 그렇지 않으면 관련이없는 것으로 간주됩니다.<strong></strong>
ru: Приемопередатчик однозначно идентифицируется с помощью его свойства <a href="rtcrtptransceiver/mid"> <code>mid</code> </a> , которое совпадает с идентификатором носителя ( <code>mid</code> ) соответствующей m-линии. <code>RTCRtpTransceiver</code> это <strong>связано</strong> с м-линии , если ее <code>mid</code> является ненулевым; в противном случае это считается диссоциированным.
zh_cn: 收发器使用其<a href="rtcrtptransceiver/mid"> <code>mid</code> </a>属性唯一标识，该属性与其对应的m线的媒体ID（ <code>mid</code> ）相同。一个 <code>RTCRtpTransceiver</code> 被<strong>关联</strong>与如果m行 <code>mid</code> 为非空; 否则，它被视为已取消关联。

source: A translated version of the primary audio track.
ja: プライマリーオーディオトラックの翻訳版。
ko: 기본 오디오 트랙의 번역 된 버전입니다.
ru: Переведенная версия основной звуковой дорожки.
zh_cn: 主要音轨的翻译版。

source: A translation matrix is based off the identity matrix. It moves the object in one of 3 directions, x, y, or z. The easiest way to think of a translation is like picking up a coffee cup. The coffee cup must be kept upright and oriented the same way so that no coffee is spilled. It can move up in the air off the table and around the air in space.
ja: 並進行列は、同一性行列を基にしています。これは、3 つの方向、x、y、または z のいずれかのオブジェクトを移動します。コーヒーカップは、コーヒーがこぼれないように、直立させ、同じ方向を向いていなければなりません。それは、テーブルから離れて空中を移動したり、空間の中で空中を移動したりすることができます。
ko: 변환 행렬은 단위 행렬을 기반으로합니다. 객체를 x, y 또는 z의 세 방향 중 하나로 이동합니다. 번역을 생각하는 가장 쉬운 방법은 커피 잔을 줍는 것과 같습니다. 커피를 엎 지르지 않도록 커피 컵을 똑바로 세우고 같은 방향으로 두어야합니다. 그것은 테이블의 공기와 공간의 공기 주위에서 위로 움직일 수 있습니다.
ru: Матрица перевода основана на матрице идентификации.Она перемещает объект в одном из 3-х направлений,x,y или z.Самый простой способ придумать перевод-это взять кофейную чашку.Кофейную чашку необходимо держать вертикально и ориентировать так,чтобы не проливать кофе.Она может перемещаться вверх по воздуху со стола и вокруг него в пространстве.
zh_cn: 平移矩阵是基于身份矩阵的,它使物体在x、y或z三个方向上移动。最简单的方法是将物体在X、Y或Z三个方向上移动。咖啡杯必须保持直立,并且方向不变,这样才不会洒出咖啡。它可以在离开桌子的空中移动,也可以在空间的空中移动。

source: A tutorial and example which turns a WebSocket-based chat system created for a previous example and adds support for opening video calls among participants. The chat server's WebSocket connection is used for WebRTC signaling.
ja: 前の例のために作成した WebSocket ベースのチャットシステムを回転させ、参加者間でビデオ通話を開くためのサポートを追加するチュートリアルと例です。チャットサーバの WebSocket 接続は、WebRTC シグナリングに使用されます。
ko: 이전 예제를 위해 작성된 WebSocket 기반 채팅 시스템을 전환하고 참가자들 사이에서 화상 통화를 열기위한 지원을 추가하는 학습서 및 예제. 채팅 서버의 WebSocket 연결은 WebRTC 신호에 사용됩니다.
ru: Учебник и пример,который превращает систему чата на базе WebSocket,созданную для предыдущего примера,и добавляет поддержку открытия видеозвонков между участниками.Для сигнализации WebRTC используется чат-серверное соединение WebSocket.
zh_cn: 该教程和示例将之前的示例中创建的基于 WebSocket 的聊天系统进行了转换,并增加了对参与者之间打开视频通话的支持。聊天服务器的 WebSocket 连接用于 WebRTC 信令。

source: A typical (simple) WebVR app works like this:
ja: 典型的な(シンプルな)WebVRアプリはこのように動作します。
ko: 일반적인 (간단한) WebVR 앱은 다음과 같이 작동합니다.
ru: Типичное (простое)приложение WebVR работает именно так:
zh_cn: 一个典型的(简单的)WebVR应用是这样的。

source: A typical (simple) WebVR app would work like so:
ja: 典型的な(シンプルな)WebVRアプリはこんな感じで動作します。
ko: 일반적인 (간단한) WebVR 앱은 다음과 같이 작동합니다.
ru: Типичное (простое)приложение WebVR будет работать именно так:
zh_cn: 一个典型的(简单的)WebVR应用可以这样工作。

source: A typical registration process has six steps, as illustrated in Figure 1 and described further below. This is a simplification of the data required for the registration process that is only intended to provide an overview. The full set of required fields, optional fields, and their meanings for creating a registration request can be found in the <a href="publickeycredentialcreationoptions"><code>PublicKeyCredentialCreationOptions</code></a> dictionary. Likewise, the full set of response fields can be found in the <a href="publickeycredential"><code>PublicKeyCredential</code></a> interface (where <a href="https://developer.mozilla.org/en-US/docs/Web/API/PublicKeyCredential/response"><code>PublicKeyCredential.response</code></a> is the <a href="authenticatorattestationresponse"><code>AuthenticatorAttestationResponse</code></a> interface). Note most JavaScript programmers that are creating an application will only really care about steps 1 and 5 where the create() function is called and subsequently returns; however, steps 2, 3, and 4 are essential to understanding the processing that takes place in the browser and authenticator and what the resulting data means.
ja: 図1に示し、以下でさらに説明するように、一般的な登録プロセスには6つのステップがあります。これは、概要を提供することのみを目的とした、登録プロセスに必要なデータの簡略化です。必須フィールド、オプションフィールド、および登録リクエストを作成するためのそれらの意味の完全なセットは、<a href="publickeycredentialcreationoptions"> <code>PublicKeyCredentialCreationOptions</code> </a>ディクショナリにあります。同様に、応答フィールドの完全なセットは、<a href="publickeycredential"> <code>PublicKeyCredential</code> </a>インターフェースにあります（<a href="https://developer.mozilla.org/en-US/docs/Web/API/PublicKeyCredential/response"> <code>PublicKeyCredential.response</code> </a>は<a href="authenticatorattestationresponse"> <code>AuthenticatorAttestationResponse</code> です)</a>インターフェース）。アプリケーションを作成しているほとんどのJavaScriptプログラマーは、create（）関数が呼び出されてその後に戻るステップ1と5のみを実際に気にすることに注意してください。ただし、ステップ2、3、および4は、ブラウザーと認証システムで行われる処理と、結果のデータの意味を理解するために不可欠です。
ko: 일반적인 등록 프로세스에는 그림 1에 설명되어 있고 아래에 더 설명 된대로 6 단계가 있습니다. 이것은 등록 과정에 필요한 데이터를 단순화 한 것으로, 개관 만 제공하기위한 것입니다. 필수 필드, 선택적 필드 및 등록 요청을 작성하기위한 의미의 전체 세트는 <a href="publickeycredentialcreationoptions"> <code>PublicKeyCredentialCreationOptions</code> </a> 사전 에서 찾을 수 있습니다 . 마찬가지로 전체 응답 필드 세트는 <a href="publickeycredential"> <code>PublicKeyCredential</code> </a> 인터페이스 ( <a href="https://developer.mozilla.org/en-US/docs/Web/API/PublicKeyCredential/response"> <code>PublicKeyCredential.response</code> </a> 는 <a href="authenticatorattestationresponse"> <code>AuthenticatorAttestationResponse</code> </a> 입니다) 에서 찾을 수 있습니다.상호 작용). 응용 프로그램을 만드는 대부분의 JavaScript 프로그래머는 실제로 create () 함수가 호출 된 다음 1 단계와 5 단계 만 신경을 씁니다. 그러나 2 단계, 3 단계 및 4 단계는 브라우저 및 인증 자에서 발생하는 처리 및 결과 데이터의 의미를 이해하는 데 필수적입니다.
ru: Типичный процесс регистрации состоит из шести этапов, как показано на рисунке 1 и описано ниже. Это упрощение данных, необходимых для процесса регистрации, которое предназначено только для обзора. Полный набор обязательных полей, необязательных полей и их значения для создания запроса на регистрацию можно найти в словаре <a href="publickeycredentialcreationoptions"> <code>PublicKeyCredentialCreationOptions</code> </a> . Аналогичным образом, полный набор полей ответов можно найти в интерфейсе <a href="publickeycredential"> <code>PublicKeyCredential</code> </a> (где <a href="https://developer.mozilla.org/en-US/docs/Web/API/PublicKeyCredential/response"> <code>PublicKeyCredential.response</code> </a> является <a href="authenticatorattestationresponse"> <code>AuthenticatorAttestationResponse</code> </a>интерфейс). Обратите внимание, что большинство программистов на JavaScript, создающих приложение, будут действительно заботиться только о шагах 1 и 5, где вызывается функция create (), а затем возвращается; однако шаги 2, 3 и 4 необходимы для понимания обработки, выполняемой в браузере и аутентификаторе, и того, что означают полученные данные.
zh_cn: 典型的注册过程包括六个步骤，如图1所示，并在下面进一步描述。这是注册过程所需数据的简化，仅用于提供概述。完整的必填字段，可选字段及其创建注册请求的含义可以在<a href="publickeycredentialcreationoptions"> <code>PublicKeyCredentialCreationOptions</code> </a>词典中找到。同样，可以在<a href="publickeycredential"> <code>PublicKeyCredential</code> </a>接口中找到完整的响应字段集（其中<a href="https://developer.mozilla.org/en-US/docs/Web/API/PublicKeyCredential/response"> <code>PublicKeyCredential.response</code> </a>是<a href="authenticatorattestationresponse"> <code>AuthenticatorAttestationResponse</code> </a>接口）。注意，大多数正在创建应用程序的JavaScript程序员只会真正关心第1步和第5步，其中create（）函数被调用并随后返回。但是，步骤2、3和4对于理解浏览器和身份验证器中进行的处理以及所得到的数据意味着什么至关重要。

source: A typical use case, is to resume the iteration where a previous cursor has been closed, without having to compare the keys one by one.
ja: 典型的な使用例としては、前のカーソルが閉じられているときに、キーを一つずつ比較しなくても、前のカーソルが閉じられているときの反復を再開することが挙げられます。
ko: 일반적인 사용 사례는 키를 하나씩 비교할 필요없이 이전 커서가 닫힌 반복을 재개하는 것입니다.
ru: Типичным случаем использования является возобновление итерации,при которой предыдущий курсор был закрыт,без необходимости сравнения клавиш по одной.
zh_cn: 一个典型的用例,是在前一个光标被关闭的地方继续迭代,而不必逐个比较按键。

source: A unique ID can be found in the <a href="id"><code>id</code></a> property.
ja: 一意のIDは<a href="id"> <code>id</code> </a>プロパティにあります。
ko: <a href="id"> <code>id</code> </a> 속성 에서 고유 한 ID를 찾을 수 있습니다 .
ru: Уникальный идентификатор можно найти в свойстве <a href="id"> <code>id</code> </a> .
zh_cn: 可以在<a href="id"> <code>id</code> </a>属性中找到唯一的ID 。

source: A unique identifier for a service worker registration &mdash; the scope URL of the registration object you want to return. This is usually a relative URL.
ja: Service Worker登録の一意の識別子&mdash;取得する登録オブジェクトのスコープURL。これは通常、相対URLです。
ko: 서비스 워커 등록을위한 고유 식별자-반환하려는 등록 객체의 범위 URL. 일반적으로 상대 URL입니다.
ru: Уникальный идентификатор для регистрации работника службы - URL области объекта регистрации, который вы хотите вернуть. Обычно это относительный URL.
zh_cn: 服务人员注册的唯一标识符-您要返回的注册对象的作用域URL。通常是相对URL。

source: A unique identifier for the pointer causing the event.
ja: イベントの原因となったポインタの一意の識別子。
ko: 이벤트를 발생시키는 포인터의 고유 식별자입니다.
ru: Уникальный идентификатор указателя,вызывающего событие.
zh_cn: 引起事件的指针的唯一标识符。

source: A unique string generated by the content decription module for the current media object and its associated keys or licenses.
ja: 現在のメディア・オブジェクトとその関連キーまたはライセンスのために、コンテンツ・デクリプション・モジュールによって生成された一意の文字列。
ko: 현재 미디어 개체 및 관련 키 또는 라이센스에 대해 컨텐츠 설명 모듈에서 생성 한 고유 한 문자열입니다.
ru: Уникальная строка,генерируемая модулем расшифровки контента для текущего медиа-объекта и связанных с ним ключей или лицензий.
zh_cn: 由内容解密模块为当前媒体对象及其相关密钥或许可证生成的唯一字符串。

source: A unitless <a href="https://developer.mozilla.org/en-US/docs/Web/CSS/number"><code>&lt;number&gt;</code></a> interpreted as a value in degrees.
ja: 度単位の値として解釈される単位のない<a href="https://developer.mozilla.org/en-US/docs/Web/CSS/number"> <code>&lt;number&gt;</code> </a>。
ko: 단위가없는 <a href="https://developer.mozilla.org/en-US/docs/Web/CSS/number"> <code>&lt;number&gt;</code> </a> 는도 단위 의 값으로 해석됩니다.
ru: <a href="https://developer.mozilla.org/en-US/docs/Web/CSS/number"> <code>&lt;number&gt;</code> </a> единиц измерения интерпретируется как значение в градусах.
zh_cn: 无单位<a href="https://developer.mozilla.org/en-US/docs/Web/CSS/number"> <code>&lt;number&gt;</code> </a>解释为以度为单位的值。

source: A usable pairing of local and remote candidates has been found for all components of the connection, and the connection has been established. It's possible that gathering is still underway, and it's also possible that the ICE agent is still checking candidates against one another looking for a better connection to use.
ja: ローカルとリモートの候補の使用可能なペアリングが、接続のすべてのコンポーネントで発見され、接続が確立されました。ギャザリングがまだ行われている可能性もありますし、ICEエージェントがより良い接続を探して候補を照合している可能性もあります。
ko: 연결의 모든 구성 요소에 대해 사용 가능한 로컬 및 원격 후보 쌍이 발견되었으며 연결이 설정되었습니다. 수집이 여전히 진행 중일 수 있으며 ICE 에이전트가 여전히 더 나은 연결을 위해 후보자를 서로 확인하고있을 수 있습니다.
ru: Для всех компонентов соединения была найдена полезная пара локальных и удаленных кандидатов,и соединение было установлено.Возможно,что сбор еще продолжается,а также возможно,что агент ICE все еще проверяет кандидатов друг на друга в поисках лучшего соединения для использования.
zh_cn: 已经为连接的所有组件找到了本地和远程候选者的可用配对,连接已经建立。有可能收集工作还在进行中,也有可能ICE代理还在互相检查候选者,寻找更好的连接来使用。

source: A useful guide to how 3D transform matrices work, and can be used on the web &mdash; both for WebGL calculations and in CSS3 transforms.
ja: 3D変換マトリックスがどのように機能するかについての有用なガイドであり、WebGLでの計算とCSS3変換の両方でWebで使用できます。
ko: 3D 변환 행렬의 작동 방식에 대한 유용한 안내서로, WebGL 계산 및 CSS3 변환 모두에서 웹에서 사용할 수 있습니다.
ru: Полезное руководство по работе с матрицами трехмерного преобразования, которое можно использовать в Интернете - как для расчетов WebGL, так и для преобразований CSS3.
zh_cn: 关于3D变换矩阵如何工作以及如何在Web上使用的有用指南，可用于WebGL计算和CSS3变换。

source: A user can normally only select one range at a time, so the <code>rangeCount</code> will usually be <code>1</code>. Scripting can be used to make the selection contain more than 1 range.
ja: 通常、ユーザーは一度に1つの範囲しか選択できないため、 <code>rangeCount</code> は通常 <code>1</code> になります。スクリプトを使用して、選択範囲に複数の範囲を含めることができます。
ko: 사용자는 일반적으로 한 번에 하나의 범위 만 선택할 수 있으므로 <code>rangeCount</code> 는 일반적으로 <code>1</code> 입니다. 스크립팅을 사용하여 선택에 둘 이상의 범위를 포함시킬 수 있습니다.
ru: Пользователь обычно может выбрать только один диапазон за раз, поэтому <code>rangeCount</code> обычно будет <code>1</code> . Сценарии могут быть использованы для того, чтобы выборка содержала более 1 диапазона.
zh_cn: 用户通常一次只能选择一个范围，因此 <code>rangeCount</code> 通常为 <code>1</code> 。脚本可用于使所选内容包含多个范围。

source: A user may make a selection from left to right (in document order) or right to left (reverse of document order). The <strong>anchor</strong> is where the user began the selection and the <strong>focus</strong> is where the user ends the selection. If you make a selection with a desktop mouse, the anchor is placed where you pressed the mouse button and the focus is placed where you released the mouse button. Anchor and focus should not be confused with the start and end positions of a selection, since anchor can be placed before the focus or vice versa, depending on the direction you made your selection.
ja: ユーザーは、左から右（ドキュメントの順序）または右から左（ドキュメントの順序の逆）から選択できます。<strong>アンカーは</strong>、ユーザーが選択を開始し、どこで<strong>フォーカスは</strong>、ユーザーが選択を終わるところです。デスクトップマウスで選択すると、アンカーはマウスボタンを押した場所に配置され、フォーカスはマウスボタンを離した場所に配置されます。アンカーとフォーカスは、選択の開始位置と終了位置と混同しないでください。選択した方向に応じて、アンカーをフォーカスの前に配置したり、その逆を行ったりできるためです。
ko: 사용자는 왼쪽에서 오른쪽으로 (문서 순서로) 또는 오른쪽에서 왼쪽으로 (문서 순서의 반대)를 선택할 수 있습니다. <strong>앵커는</strong> 사용자가 선택을 시작하고, 어디에 <strong>초점을</strong> 사용자가 선택을 종료 곳입니다. 데스크탑 마우스로 선택하면 마우스 버튼을 누른 위치에 앵커가 배치되고 마우스 버튼을 놓은 위치에 초점이 배치됩니다. 앵커와 포커스는 선택의 시작 및 끝 위치와 혼동되어서는 안됩니다. 선택하는 방향에 따라 앵커가 포커스 앞에 또는 그 반대로 배치 될 수 있기 때문입니다.
ru: Пользователь может сделать выбор слева направо (в порядке документа) или справа налево (в обратном порядке документа). <strong>Якорь</strong> , где пользователь начал отбор и <strong>фокус</strong> , где пользователь заканчивает выбор. Если вы сделаете выделение с помощью мыши на рабочем столе, якорь будет расположен там, где вы нажали кнопку мыши, а фокус - там, где вы отпустили кнопку мыши. Привязку и фокус не следует путать с начальной и конечной позициями выделения, поскольку привязку можно поместить перед фокусом или наоборот, в зависимости от направления, в котором вы сделали свой выбор.
zh_cn: 用户可以从左至右（按文档顺序）或从右至左（与文档顺序相反）进行选择。该<strong>锚</strong>是用户开始选择和<strong>焦点</strong>是用户端的选择。如果使用桌面鼠标进行选择，则将锚点放置在按下鼠标按钮的位置，将焦点放置在释放鼠标按钮的位置。不要将锚点和焦点与选区的开始和结束位置混淆，因为根据您选择的方向，可以将锚点放在焦点之前，反之亦然。

source: A user may make a selection from left to right (in document order) or right to left (reverse of document order). The anchor is where the user began the selection. This can be visualized by holding the Shift key and pressing the arrow keys on your keyboard. The selection's anchor does not move, but the selection's focus, the other end of the selection, does move.
ja: ユーザーは、左から右へ(文書順)または右から左へ(文書順の逆)の選択を行うことができます。アンカーとは、ユーザーが選択を開始した場所のことです。これはキーボードの Shift キーを押しながら矢印キーを押すとわかります。選択範囲のアンカーは移動しませんが、 選択範囲のもう一方の端にある焦点は移動します。
ko: 사용자는 왼쪽에서 오른쪽으로 (문서 순서로) 또는 오른쪽에서 왼쪽으로 (문서 순서의 반대)를 선택할 수 있습니다. 앵커는 사용자가 선택을 시작한 곳입니다. Shift 키를 누른 상태에서 키보드의 화살표 키를 누르면이를 확인할 수 있습니다. 선택의 앵커는 이동하지 않지만 선택의 다른 쪽 끝인 선택의 초점은 이동합니다.
ru: Пользователь может сделать выбор слева направо (в порядке заказа документов)или справа налево (в порядке обратного заказа документов).Анкер-это то место,где пользователь начал выделение.Это можно визуализировать,удерживая клавишу Shift и нажимая клавиши со стрелками на клавиатуре.Анкер выделения не перемещается,а фокус выделения,другой конец выделения,перемещается.
zh_cn: 用户可以从左到右(按文档顺序)或从右到左(与文档顺序相反)进行选择。锚点是用户开始选择的地方。这可以通过按住Shift键和按键盘上的方向键来可视化。选区的锚点不会移动,但选区的焦点,即选区的另一端会移动。

source: A user may make a selection from left to right (in document order) or right to left (reverse of document order). The focus is where the user ended the selection. This can be visualized by holding the Shift key and pressing the arrow keys on your keyboard to modify the current selection. The selection's focus moves, but the selection's anchor, the other end of the selection, does not move.
ja: ユーザーは、左から右へ(文書順)または右から左へ(文書順の逆)の選択を行うことができます。フォーカスは、ユーザーが選択を終了した場所にあります。これは Shift キーを押しながらキーボードの矢印キーを押して現在の選択範囲を変更するとわかります。選択範囲のフォーカスは移動しますが、 選択範囲のもう一方の端にあるアンカーは移動しません。
ko: 사용자는 왼쪽에서 오른쪽으로 (문서 순서로) 또는 오른쪽에서 왼쪽으로 (문서 순서의 반대)를 선택할 수 있습니다. 초점은 사용자가 선택을 끝내는 곳입니다. Shift 키를 누른 상태에서 키보드의 화살표 키를 누르면 현재 선택 항목을 수정하여이를 확인할 수 있습니다. 선택의 포커스는 이동하지만 선택의 다른 쪽 끝인 선택의 앵커는 이동하지 않습니다.
ru: Пользователь может сделать выбор слева направо (в порядке заказа документов)или справа налево (в порядке обратного заказа документов).В центре внимания находится место,где пользователь закончил выделение.Это можно визуализировать,удерживая клавишу Shift и нажимая клавиши со стрелками на клавиатуре,чтобы изменить текущее выделение.Фокус области выделения перемещается,но якорь области выделения-другой конец области выделения-не перемещается.
zh_cn: 用户可以从左到右(按文档顺序)或从右到左(与文档顺序相反)进行选择。焦点是用户结束选择的地方。这可以通过按住Shift键和按键盘上的方向键来修改当前选区来可视化。选区的焦点会移动,但选区的锚点,即选区的另一端不会移动。

source: A user selects the (imaginary) text "ve two ea" from "Rabbits have two ears." on a web page. The user then clicks a button that executes the JavaScript snippet <code>window.getSelection().deleteFromDocument()</code>. The document's text becomes "Rabbits hars."
ja: ユーザーは、「うさぎは耳が2つある」から（想像上の）テキスト「ve two ea」を選択します。Webページ上。次に、ユーザーはJavaScriptスニペット <code>window.getSelection().deleteFromDocument()</code> を実行するボタンをクリックします。ドキュメントのテキストは「うさぎのうさぎ」になります。
ko: 사용자는 "토끼는 두 귀가있다"에서 "가상"텍스트 "ve two ea"를 선택합니다. 웹 페이지에서. 그런 다음 사용자는 JavaScript 스 니펫 <code>window.getSelection().deleteFromDocument()</code> 를 실행하는 버튼을 클릭합니다 . 문서의 텍스트는 "Rabbits hars"가됩니다.
ru: Пользователь выбирает (воображаемый) текст &laquo;ve two ea&raquo; из &laquo;Кролики имеют два уха&raquo;. на веб-странице. Затем пользователь нажимает кнопку, которая выполняет фрагмент JavaScript <code>window.getSelection().deleteFromDocument()</code> . Текст документа становится &laquo;Кролики харс&raquo;.
zh_cn: 用户从&ldquo;兔子有两只耳朵的耳朵&rdquo;中选择（虚构）文本&ldquo; ve two ea&rdquo;。在网页上。然后，用户单击执行JavaScript代码段 <code>window.getSelection().deleteFromDocument()</code> 的按钮。该文档的文本变为&ldquo; Rabbits hars&rdquo;。

source: A user-readable title string for the protocol handler. This will be displayed to the user in interface objects as needed.
ja: プロトコルハンドラのユーザーが読めるタイトル文字列。これは、必要に応じてインターフェイスオブジェクトの中でユーザに表示されます。
ko: 프로토콜 핸들러의 사용자가 읽을 수있는 제목 문자열입니다. 필요한 경우 인터페이스 객체로 사용자에게 표시됩니다.
ru: Читаемая пользователем строка заголовка обработчика протокола.При необходимости она будет отображаться пользователю в объектах интерфейса.
zh_cn: 协议处理程序的一个用户可读的标题字符串。这将根据需要在界面对象中显示给用户。

source: A valid <a href="../credential"><code>Credential</code></a> instance.
ja: 有効な<a href="../credential"> <code>Credential</code> </a>インスタンス。
ko: 유효한 <a href="../credential"> <code>Credential</code> </a> 인스턴스
ru: Действительный экземпляр <a href="../credential"> <code>Credential</code> </a> .
zh_cn: 有效的<a href="../credential"> <code>Credential</code> </a>实例。

source: A valid <a href="../mediadecodingconfiguration"><code>MediaDecodingConfiguration</code></a> dictionary containing a valid media decoding <code>type</code> of <code>file</code> or <code>media-source</code> and a valid media configuration: either an <a href="../audioconfiguration"><code>AudioConfiguration</code></a> or a <a href="../videoconfiguration"><code>VideoConfiguration</code></a>.
ja: 有効<a href="../mediadecodingconfiguration"> <code>MediaDecodingConfiguration</code> の</a>復号有効なメディアを含む辞書 <code>type</code> の <code>file</code> 又は <code>media-source</code> と有効なメディアコンフィグレーションを：のいずれか<a href="../audioconfiguration"> <code>AudioConfiguration</code> </a>又は<a href="../videoconfiguration"> <code>VideoConfiguration</code> </a>。
ko: 유효한 미디어 디코딩 <code>type</code> 의 <code>file</code> 또는 <code>media-source</code> 와 유효한 미디어 구성 ( <a href="../audioconfiguration"> <code>AudioConfiguration</code> </a> 또는 <a href="../videoconfiguration"> <code>VideoConfiguration</code> )이</a> 포함 된 유효한 <a href="../mediadecodingconfiguration"> <code>MediaDecodingConfiguration</code> </a> 사전 입니다.
ru: Действительный <a href="../mediadecodingconfiguration"> <code>MediaDecodingConfiguration</code> </a> словарь , содержащий действительные носители декодирования <code>type</code> из <code>file</code> или <code>media-source</code> и действительной конфигурации СМИ: либо <a href="../audioconfiguration"> <code>AudioConfiguration</code> </a> или <a href="../videoconfiguration"> <code>VideoConfiguration</code> </a> .
zh_cn: 有效<a href="../mediadecodingconfiguration"> <code>MediaDecodingConfiguration</code> </a>包含有效的介质解码字典 <code>type</code> 的 <code>file</code> 或 <code>media-source</code> 和有效的介质构型：或者一个<a href="../audioconfiguration"> <code>AudioConfiguration</code> </a>或<a href="../videoconfiguration"> <code>VideoConfiguration</code> </a>。
