Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/dom/dom.*.007.xlf
Languages: es, ko, ru, zh_cn

source: <em>Also inherits properties from its parent, <a href="https://developer.mozilla.org/en-US/docs/Web/API/Method"><code>Method</code></a>.</em>
es: <em>Tambi&eacute;n hereda propiedades de su padre, <a href="https://developer.mozilla.org/en-US/docs/Web/API/Method"> <code>Method</code> </a> .</em>
ko: <em>또한 부모 인 <a href="https://developer.mozilla.org/en-US/docs/Web/API/Method"> <code>Method</code> </a> 에서 속성을 상속합니다 .</em>
ru: <em>Также наследует свойства от своего родителя, <a href="https://developer.mozilla.org/en-US/docs/Web/API/Method"> <code>Method</code> </a> .</em>
zh_cn: <em>还从其父类<a href="https://developer.mozilla.org/en-US/docs/Web/API/Method"> <code>Method</code> </a>继承属性。</em>

source: <em>Also inherits properties from: <a href="event"><code>Event</code></a></em>
es: <em>Tambi&eacute;n hereda propiedades de: <a href="event"> <code>Event</code> o</a></em>
ko: <em>다음에서 속성을 상속합니다. <a href="event"> <code>Event</code> </a></em>
ru: <em>Также наследует свойства от: <a href="event"> <code>Event</code> </a></em>
zh_cn: <em>还继承以下属性：<a href="event"> <code>Event</code> </a></em>

source: <em>Also inherits properties from: <a href="eventtarget"><code>EventTarget</code></a></em>
es: <em>Tambi&eacute;n hereda propiedades de: <a href="eventtarget"> <code>EventTarget</code> </a></em>
ko: <em><a href="eventtarget"> <code>EventTarget</code> </a> 에서 속성을 상속합니다.</em>
ru: <em>Также наследует свойства от: <a href="eventtarget"> <code>EventTarget</code> </a></em>
zh_cn: <em>还继承以下属性：<a href="eventtarget"> <code>EventTarget</code> </a></em>

source: <em>Also note the non-standard <code><a href="http://www.quirksmode.org/dom/w3c_css.html#change">removeRule()</a></code> and <code><a href="http://www.quirksmode.org/dom/w3c_css.html#access">.rules</a></code> instead of <a href="deleterule"><code>deleteRule()</code></a> and <a href="../cssstylesheet"><code>.cssRules</code></a> respectively.</em>
es: <em>Tambi&eacute;n tenga en cuenta los <code><a href="http://www.quirksmode.org/dom/w3c_css.html#change">removeRule()</a></code> y <code><a href="http://www.quirksmode.org/dom/w3c_css.html#access">.rules</a></code> no est&aacute;ndar en lugar de <a href="deleterule"> <code>deleteRule()</code> </a> y <a href="../cssstylesheet"> <code>.cssRules</code> </a> respectivamente.</em>
ko: <em>또한 <a href="deleterule"> <code>deleteRule()</code> </a> 및 <a href="../cssstylesheet"> <code>.cssRules</code> </a> 대신 비표준 <code><a href="http://www.quirksmode.org/dom/w3c_css.html#change">removeRule()</a></code> 및 <code><a href="http://www.quirksmode.org/dom/w3c_css.html#access">.rules</a></code> 를 참고하십시오 .</em>
ru: <em>Также обратите внимание на нестандартные <code><a href="http://www.quirksmode.org/dom/w3c_css.html#change">removeRule()</a></code> и <code><a href="http://www.quirksmode.org/dom/w3c_css.html#access">.rules</a></code> вместо <a href="deleterule"> <code>deleteRule()</code> </a> и <a href="../cssstylesheet"> <code>.cssRules</code> </a> соответственно.</em>
zh_cn: <em>还要注意非标准 <code><a href="http://www.quirksmode.org/dom/w3c_css.html#change">removeRule()</a></code> 和 <code><a href="http://www.quirksmode.org/dom/w3c_css.html#access">.rules</a></code> 代替<a href="deleterule"> <code>deleteRule()</code> </a>和<a href="../cssstylesheet"> <code>.cssRules</code> </a>分别。</em>

source: <em>Also note the non-standard</em><code> <a href="http://www.quirksmode.org/dom/w3c_css.html#change">addRule()</a>&nbsp;</code><em>and</em><code> <a href="http://www.quirksmode.org/dom/w3c_css.html#access">.rules</a>&nbsp;</code><em>instead of </em><a href="insertrule"><code>insertRule()</code></a><em> and </em><a href="../cssstylesheet"><code>.cssRules</code></a><em> respectively.</em>
es: <em>Tambi&eacute;n tenga en cuenta los </em> <code> <a href="http://www.quirksmode.org/dom/w3c_css.html#change">addRule()</a>&nbsp;</code> <em> y </em> <code> <a href="http://www.quirksmode.org/dom/w3c_css.html#access">.rules</a>&nbsp;</code> <em> no </em>est&aacute;ndar en<em> lugar de </em><a href="insertrule"> <code>insertRule()</code> </a><em> y </em><a href="../cssstylesheet"> <code>.cssRules</code> </a><em> respectivamente.</em> &nbsp;<em></em> &nbsp;<em></em><em></em><em></em>
ko: <em>또한 </em><a href="insertrule"> <code>insertRule()</code> </a><em> 및 </em><a href="../cssstylesheet"> <code>.cssRules</code> </a><em> 대신 </em><em>비표준 </em> <code> <a href="http://www.quirksmode.org/dom/w3c_css.html#change">addRule()</a>&nbsp;</code> <em> 및 </em> <code> <a href="http://www.quirksmode.org/dom/w3c_css.html#access">.rules</a>&nbsp;</code> <em> 를 </em><em>참고하십시오 </em><em>.</em> &nbsp;<em></em> &nbsp;<em></em><em></em><em></em>
ru: <em>Также обратите внимание на нестандартные </em> <code> <a href="http://www.quirksmode.org/dom/w3c_css.html#change">addRule()</a>&nbsp;</code> <em> и </em> <code> <a href="http://www.quirksmode.org/dom/w3c_css.html#access">.rules</a>&nbsp;</code> <em> вместо </em><a href="insertrule"> <code>insertRule()</code> </a><em> и </em><a href="../cssstylesheet"> <code>.cssRules</code> </a><em> соответственно.</em> &nbsp;<em></em> &nbsp;<em></em><em></em><em></em>
zh_cn: <em>还要注意非标准</em> <code> <a href="http://www.quirksmode.org/dom/w3c_css.html#change">addRule()</a>&nbsp;</code> <em>和</em> <code> <a href="http://www.quirksmode.org/dom/w3c_css.html#access">.rules</a>&nbsp;</code> <em>代替</em><a href="insertrule"> <code>insertRule()</code> </a><em>和</em><a href="../cssstylesheet"> <code>.cssRules</code> </a><em>分别。</em> &nbsp;<em></em> &nbsp;<em></em><em></em><em></em>

source: <em>Any combination of a valid local date and time string followed by a valid time-zone offset string</em>
es: <em>Cualquier combinaci&oacute;n de una cadena de fecha y hora local v&aacute;lida seguida de una cadena de desplazamiento de zona horaria v&aacute;lida</em>
ko: <em>유효한 현지 날짜 및 시간 문자열과 유효한 시간대 오프셋 문자열의 조합</em>
ru: <em>Любая комбинация допустимой строки даты и времени, за которой следует допустимая строка смещения часового пояса</em>
zh_cn: <em>有效本地日期和时间字符串后跟有效时区偏移字符串的任意组合</em>

source: <em>As an opaque object, there is no exposed property.</em>
es: <em>Como objeto opaco, no hay propiedad expuesta.</em>
ko: <em>불투명 한 객체로서 노출 된 속성이 없습니다.</em>
ru: <em>Как непрозрачный объект, здесь нет открытого свойства.</em>
zh_cn: <em>作为不透明的对象，没有暴露的属性。</em>

source: <em>As an opaque object, this has no exposed property.</em>
es: <em>Como objeto opaco, esto no tiene propiedad expuesta.</em>
ko: <em>불투명 한 객체로서 노출 된 속성이 없습니다.</em>
ru: <em>Как непрозрачный объект, он не имеет открытого свойства.</em>
zh_cn: <em>作为不透明的对象，它没有暴露的属性。</em>

source: <em>Brief history:</em> The first version of the Web Audio spec only defined the factory methods. After a <a href="https://github.com/WebAudio/web-audio-api/issues/250">design review in October 2013</a>, it was decided to add constructors because they have numerous benefits over factory methods. The constructors were added to the spec from August to October 2016. Factory methods continue to be included in the spec and are not deprecated.
es: <em>Breve historia:</em> la primera versi&oacute;n de la especificaci&oacute;n de Web Audio solo defini&oacute; los m&eacute;todos de f&aacute;brica. Despu&eacute;s de una <a href="https://github.com/WebAudio/web-audio-api/issues/250">revisi&oacute;n de dise&ntilde;o en octubre de 2013</a> , se decidi&oacute; agregar constructores porque tienen numerosos beneficios sobre los m&eacute;todos de f&aacute;brica. Los constructores se agregaron a la especificaci&oacute;n de agosto a octubre de 2016. Los m&eacute;todos de f&aacute;brica contin&uacute;an incluy&eacute;ndose en la especificaci&oacute;n y no est&aacute;n en desuso.
ko: <em>간략한 역사 :</em> Web Audio 사양의 첫 번째 버전은 공장 방법 만 정의했습니다. <a href="https://github.com/WebAudio/web-audio-api/issues/250">2013 년 10 월에 디자인 검토를</a> 한 후 팩토리 메소드에 비해 많은 이점이 있으므로 생성자를 추가하기로 결정했습니다. 생성자는 2016 년 8 월부터 10 월까지 스펙에 추가되었습니다. 팩토리 메소드는 스펙에 계속 포함되며 더 이상 사용되지 않습니다.
ru: <em>Краткая история:</em> Первая версия спецификации Web Audio определяла только фабричные методы. После <a href="https://github.com/WebAudio/web-audio-api/issues/250">проверки проекта в октябре 2013</a> года было решено добавить конструкторов, поскольку они имеют многочисленные преимущества по сравнению с заводскими методами. Конструкторы были добавлены в спецификацию с августа по октябрь 2016 года. Фабричные методы продолжают включаться в спецификацию и не считаются устаревшими.
zh_cn: <em>简要历史记录：</em> Web Audio规范的第一个版本仅定义了工厂方法。在<a href="https://github.com/WebAudio/web-audio-api/issues/250">2013年10月</a>进行设计审查后，决定添加构造函数，因为它们比工厂方法具有许多优点。从2016年8月到2016年10月，构造函数已添加到规范中。工厂方法继续包含在规范中，并且不建议弃用。

source: <em>Click on the circle.</em>
es: <em>Haz clic en el c&iacute;rculo.</em>
ko: <em>원을 클릭하십시오.</em>
ru: <em>Нажмите на круг.</em>
zh_cn: <em>点击圈子。</em>

source: <em>Click the rect.</em>
es: <em>Haga clic en el rect.</em>
ko: <em>rect를 클릭하십시오.</em>
ru: <em>Нажмите на прямоугольник.</em>
zh_cn: <em>单击矩形。</em>

source: <em>Custom data attributes can also be set directly on HTML elements, but attribute names must use the data- syntax above. </em>
es: <em>Los atributos de datos personalizados tambi&eacute;n se pueden establecer directamente en elementos HTML, pero los nombres de los atributos deben usar la sintaxis de datos anterior. </em>
ko: <em>사용자 정의 데이터 속성은 HTML 요소에서 직접 설정할 수도 있지만 속성 이름은 위의 데이터 구문을 사용해야합니다. </em>
ru: <em>Пользовательские атрибуты данных также могут быть установлены непосредственно для элементов HTML, но имена атрибутов должны использовать синтаксис данных выше. </em>
zh_cn: <em>自定义数据属性也可以直接在HTML元素上设置，但是属性名称必须使用上面的data-语法。 </em>

source: <em>D<sub>i</sub></em> = <em>E<sub>i</sub></em> XOR <em>M</em><sub>(<em>i</em> mod 4)</sub>
ru: <em>D <sub>i</sub></em> = <em>E <sub>i</sub></em> XOR <em>M </em><sub>( <em>я</em> мод 4)</sub>

source: <em>Daemons</em> management
es: <em></em>Manejo de <em>demonios</em>
ko: <em>데몬</em> 관리
ru: <em></em>Управление <em>демонами</em>
zh_cn: <em>守护程序</em>管理

source: <em>Doesn't implement any specific properties, but inherits properties from its parent, <a href="event"><code>Event</code></a>.</em>
es: <em>No implementa ninguna propiedad espec&iacute;fica, pero hereda las propiedades de su padre, <a href="event"> <code>Event</code> o</a> .</em>
ko: <em>특정 속성을 구현하지 않지만 부모 인 <a href="event"> <code>Event</code> </a> 에서 속성을 상속합니다 .</em>
ru: <em>Не реализует какие-либо конкретные свойства, но наследует свойства от своего родителя, <a href="event"> <code>Event</code> </a> .</em>
zh_cn: <em>不实现任何特定属性，但从其父<a href="event"> <code>Event</code> </a>继承属性。</em>

source: <em>Doesn't inherit any method, but implements those defined in <a href="navigatorid"><code>NavigatorID</code></a>, <a href="https://developer.mozilla.org/en-US/docs/Web/API/navigatorContentUtils"><code>NavigatorContentUtils</code></a>, <em><a href="https://developer.mozilla.org/en-US/docs/Web/API/navigatorUserMedia"><code>NavigatorUserMedia</code></a>, </em>and <a href="https://developer.mozilla.org/en-US/docs/Web/API/navigatorStorageUtils"><code>NavigatorStorageUtils</code></a>.</em>
es: <em>No hereda cualquier m&eacute;todo, pero implementos de los definidos en <a href="navigatorid"> <code>NavigatorID</code> </a> , <a href="https://developer.mozilla.org/en-US/docs/Web/API/navigatorContentUtils"> <code>NavigatorContentUtils</code> </a> , <em><a href="https://developer.mozilla.org/en-US/docs/Web/API/navigatorUserMedia"> <code>NavigatorUserMedia</code> </a> ,</em> y <a href="https://developer.mozilla.org/en-US/docs/Web/API/navigatorStorageUtils"> <code>NavigatorStorageUtils</code> </a> .</em>
ko: <em>어떤 방법을 상속하지만,하지 않습니다 구현에 정의 된 <a href="navigatorid"> <code>NavigatorID</code> </a> , <a href="https://developer.mozilla.org/en-US/docs/Web/API/navigatorContentUtils"> <code>NavigatorContentUtils</code> </a> , <em><a href="https://developer.mozilla.org/en-US/docs/Web/API/navigatorUserMedia"> <code>NavigatorUserMedia</code> </a> ,</em> 및 <a href="https://developer.mozilla.org/en-US/docs/Web/API/navigatorStorageUtils"> <code>NavigatorStorageUtils</code> </a> .</em>
ru: <em>Не наследуют любой метод, но реализует определенные в <a href="navigatorid"> <code>NavigatorID</code> </a> , <a href="https://developer.mozilla.org/en-US/docs/Web/API/navigatorContentUtils"> <code>NavigatorContentUtils</code> </a> , <em><a href="https://developer.mozilla.org/en-US/docs/Web/API/navigatorUserMedia"> <code>NavigatorUserMedia</code> </a> ,</em> и <a href="https://developer.mozilla.org/en-US/docs/Web/API/navigatorStorageUtils"> <code>NavigatorStorageUtils</code> </a> .</em>
zh_cn: <em>没有继承任何方法，但这些工具中定义<a href="navigatorid"> <code>NavigatorID</code> </a>，<a href="https://developer.mozilla.org/en-US/docs/Web/API/navigatorContentUtils"> <code>NavigatorContentUtils</code> </a>，<em><a href="https://developer.mozilla.org/en-US/docs/Web/API/navigatorUserMedia"> <code>NavigatorUserMedia</code> </a>，</em>和<a href="https://developer.mozilla.org/en-US/docs/Web/API/navigatorStorageUtils"> <code>NavigatorStorageUtils</code> </a>。</em>

source: <em>Doesn't inherit any properties, but implements those defined in <a href="navigatorid"><code>NavigatorID</code></a>, <a href="navigatorlanguage"><code>NavigatorLanguage</code></a>, <a href="navigatoronline"><code>NavigatorOnLine</code></a>, <a href="https://developer.mozilla.org/en-US/docs/Web/API/navigatorContentUtils"><code>NavigatorContentUtils</code></a>, <a href="navigatorstorage"><code>NavigatorStorage</code></a>, <a href="https://developer.mozilla.org/en-US/docs/Web/API/navigatorStorageUtils"><code>NavigatorStorageUtils</code></a>, <a href="navigatorconcurrenthardware"><code>NavigatorConcurrentHardware</code></a>, <a href="navigatorplugins"><code>NavigatorPlugins</code></a>, and <a href="https://developer.mozilla.org/en-US/docs/Web/API/navigatorUserMedia"><code>NavigatorUserMedia</code></a>.</em>
es: <em>No hereda ninguna propiedad, pero implementa las definidas en <a href="navigatorid"> <code>NavigatorID</code> </a> , <a href="navigatorlanguage"> <code>NavigatorLanguage</code> </a> , <a href="navigatoronline"> <code>NavigatorOnLine</code> </a> , <a href="https://developer.mozilla.org/en-US/docs/Web/API/navigatorContentUtils"> <code>NavigatorContentUtils</code> </a> , <a href="navigatorstorage"> <code>NavigatorStorage</code> </a> , <a href="https://developer.mozilla.org/en-US/docs/Web/API/navigatorStorageUtils"> <code>NavigatorStorageUtils</code> </a> , <a href="navigatorconcurrenthardware"> <code>NavigatorConcurrentHardware</code> </a> , <a href="navigatorplugins"> <code>NavigatorPlugins</code> </a> y <a href="https://developer.mozilla.org/en-US/docs/Web/API/navigatorUserMedia"> <code>NavigatorUserMedia</code> </a> .</em>
ko: <em>속성을 상속하지는 않지만 <a href="navigatorid"> <code>NavigatorID</code> </a> , <a href="navigatorlanguage"> <code>NavigatorLanguage</code> </a> , <a href="navigatoronline"> <code>NavigatorOnLine</code> </a> , <a href="https://developer.mozilla.org/en-US/docs/Web/API/navigatorContentUtils"> <code>NavigatorContentUtils</code> </a> , <a href="navigatorstorage"> <code>NavigatorStorage</code> </a> , <a href="https://developer.mozilla.org/en-US/docs/Web/API/navigatorStorageUtils"> <code>NavigatorStorageUtils</code> </a> , <a href="navigatorconcurrenthardware"> <code>NavigatorConcurrentHardware</code> </a> , <a href="navigatorplugins"> <code>NavigatorPlugins</code> </a> 및 <a href="https://developer.mozilla.org/en-US/docs/Web/API/navigatorUserMedia"> <code>NavigatorUserMedia</code> 에</a> 정의 된 속성을 구현합니다 .</em>
ru: <em>Не наследует никаких свойств, но реализует те, которые определены в <a href="navigatorid"> <code>NavigatorID</code> </a> , <a href="navigatorlanguage"> <code>NavigatorLanguage</code> </a> , <a href="navigatoronline"> <code>NavigatorOnLine</code> </a> , <a href="https://developer.mozilla.org/en-US/docs/Web/API/navigatorContentUtils"> <code>NavigatorContentUtils</code> </a> , <a href="navigatorstorage"> <code>NavigatorStorage</code> </a> , <a href="https://developer.mozilla.org/en-US/docs/Web/API/navigatorStorageUtils"> <code>NavigatorStorageUtils</code> </a> , <a href="navigatorconcurrenthardware"> <code>NavigatorConcurrentHardware</code> </a> , <a href="navigatorplugins"> <code>NavigatorPlugins</code> </a> и <a href="https://developer.mozilla.org/en-US/docs/Web/API/navigatorUserMedia"> <code>NavigatorUserMedia</code> </a> .</em>
zh_cn: <em>不继承任何属性，但是实现在<a href="navigatorid"> <code>NavigatorID</code> </a>，<a href="navigatorlanguage"> <code>NavigatorLanguage</code> </a>，<a href="navigatoronline"> <code>NavigatorOnLine</code> </a>，<a href="https://developer.mozilla.org/en-US/docs/Web/API/navigatorContentUtils"> <code>NavigatorContentUtils</code> </a>，<a href="navigatorstorage"> <code>NavigatorStorage</code> </a>，<a href="https://developer.mozilla.org/en-US/docs/Web/API/navigatorStorageUtils"> <code>NavigatorStorageUtils</code> </a>，<a href="navigatorconcurrenthardware"> <code>NavigatorConcurrentHardware</code> </a>，<a href="navigatorplugins"> <code>NavigatorPlugins</code> </a>和<a href="https://developer.mozilla.org/en-US/docs/Web/API/navigatorUserMedia"> <code>NavigatorUserMedia</code> 中</a>定义的那些属性。</em>

source: <em>Down-mix discrete channels.</em>
es: <em>Mezclar canales discretos.</em>
ko: <em>다운 믹스 개별 채널.</em>
ru: <em>Микширование дискретных каналов.</em>
zh_cn: <em>下混离散通道。</em>

source: <em>Down-mix from 5.1 to mono.</em>
es: <em>Mezcla descendente de 5.1 a mono.</em>
ko: <em>5.1에서 모노로 다운 믹스.</em>
ru: <em>Микширование с 5.1 до моно.</em>
zh_cn: <em>从5.1向下混合到单声道。</em>

source: <em>Down-mix from 5.1 to quad.</em>
es: <em>Mezcla descendente de 5.1 a quad.</em>
ko: <em>5.1에서 쿼드로 다운 믹스.</em>
ru: <em>Снизить с 5.1 до четырех.</em>
zh_cn: <em>从5.1向下混合到四倍。</em>

source: <em>Down-mix from 5.1 to stereo.</em>
es: <em>Mezcla descendente de 5.1 a est&eacute;reo.</em>
ko: <em>5.1에서 스테레오로 다운 믹스합니다.</em>
ru: <em>Микширование с 5.1 до стерео.</em>
zh_cn: <em>从5.1下混音到立体声。</em>

source: <em>Down-mix from quad to mono</em>.
es: <em>Mezcla descendente de quad a mono</em> .
ko: <em>쿼드에서 모노로 다운 믹스</em> .
ru: <em>Микшируйте от четырех до моно</em> .
zh_cn: <em>从Quad降混到Mono</em>。

source: <em>Down-mix from quad to stereo</em>.
es: <em>Mezcla descendente de cu&aacute;druple a est&eacute;reo</em> .
ko: <em>쿼드에서 스테레오로 다운 믹스</em> .
ru: <em>Микширование от четырех до стерео</em> .
zh_cn: <em>从四声道缩混到立体声</em>。

source: <em>Down-mix from stereo to mono</em>.
es: <em>Mezcla descendente de est&eacute;reo a mono</em> .
ko: <em>스테레오에서 모노로 다운 믹스</em> .
ru: <em>Микширование от стерео до моно</em> .
zh_cn: <em>从立体声降混到单声道</em>。

source: <em>Figure 1 - a diagram showing the sequence of actions for a WebAuthn registration and the essential data associated with each action.</em>
es: <em>Figura 1: un diagrama que muestra la secuencia de acciones para un registro de WebAuthn y los datos esenciales asociados con cada acci&oacute;n.</em>
ko: <em>그림 1-WebAuthn 등록을위한 일련의 작업 및 각 작업과 관련된 필수 데이터를 보여주는 다이어그램</em>
ru: <em>Рисунок 1 - схема, показывающая последовательность действий для регистрации в WebAuthn и основные данные, связанные с каждым действием.</em>
zh_cn: <em>图1-显示WebAuthn注册的动作序列以及与每个动作相关的基本数据的图。</em>

source: <em>Figure 2 - similar to Figure 1, a diagram showing the sequence of actions for a WebAuthn authentication and the essential data associated with each action.</em>
es: <em>Figura 2: similar a la Figura 1, un diagrama que muestra la secuencia de acciones para una autenticaci&oacute;n WebAuthn y los datos esenciales asociados con cada acci&oacute;n.</em>
ko: <em>그림 2-그림 1과 유사하게 WebAuthn 인증을위한 일련의 작업과 각 작업과 관련된 필수 데이터를 보여주는 다이어그램.</em>
ru: <em>Рисунок 2 - аналогично рисунку 1 - диаграмма, показывающая последовательность действий для аутентификации WebAuthn и основные данные, связанные с каждым действием.</em>
zh_cn: <em>图2-与图1相似，该图显示了WebAuthn身份验证的动作序列以及与每个动作关联的基本数据。</em>

source: <em>High precision timing</em> is achieved by using the <a href="../domhighrestimestamp"><code>DOMHighResTimeStamp</code></a> type for time values. The unit is milliseconds and should be accurate to 5 &micro;s (microseconds). However, if the browser is unable to provide a time value accurate to 5 microseconds (because, for example, due to hardware or software constraints), the browser can represent a the value as a time in milliseconds accurate to a millisecond.
es: <em>El tiempo de alta precisi&oacute;n</em> se logra utilizando el tipo <a href="../domhighrestimestamp"> <code>DOMHighResTimeStamp</code> </a> para los valores de tiempo. La unidad es milisegundos y debe tener una precisi&oacute;n de 5 &micro;s (microsegundos). Sin embargo, si el navegador no puede proporcionar un valor de tiempo preciso de 5 microsegundos (porque, por ejemplo, debido a restricciones de hardware o software), el navegador puede representar el valor como un tiempo en milisegundos exacto a un milisegundo.
ko: <em></em>시간 값에 <a href="../domhighrestimestamp"> <code>DOMHighResTimeStamp</code> </a> 유형을 사용하면 <em>고정밀 타이밍</em> 이 달성됩니다 . 단위는 밀리 초이며 5 &micro;s (마이크로 초)까지 정확해야합니다. 그러나 브라우저가 5 마이크로 초까지 정확한 시간 값을 제공 할 수없는 경우 (예 : 하드웨어 또는 소프트웨어 제한 사항으로 인해) 브라우저는 값을 밀리 초 단위의 정확한 시간 (밀리 초)으로 나타낼 수 있습니다.
ru: <em>Высокая точность синхронизации</em> достигается использованием типа <a href="../domhighrestimestamp"> <code>DOMHighResTimeStamp</code> </a> для значений времени. Единица измерения составляет миллисекунды и должна быть с точностью до 5 мкс (микросекунд). Однако, если браузер не может предоставить значение времени с точностью до 5 микросекунд (например, из-за аппаратных или программных ограничений), браузер может представить значение как время в миллисекундах с точностью до миллисекунды.
zh_cn: <em></em>通过将<a href="../domhighrestimestamp"> <code>DOMHighResTimeStamp</code> </a>类型用于时间值，可以实现<em>高精度计时</em>。单位为毫秒，应精确到5 &micro;s（微秒）。但是，如果浏览器无法提供精确到5微秒的时间值（例如，由于硬件或软件限制），则浏览器可以将值表示为精确到毫秒的时间（以毫秒为单位）。

source: <em>I'm experimenting with structure for pages documenting members of dictionaries. Please contact <a href="https://developer.mozilla.org/profiles/sheppy">sheppy</a> with any feedback.</em>
es: <em>Estoy experimentando con la estructura de p&aacute;ginas que documentan miembros de diccionarios. Por favor, p&oacute;ngase en contacto con <a href="https://developer.mozilla.org/profiles/sheppy">sheppy</a> con cualquier comentario.</em>
ko: <em>사전 구성원을 문서화하는 페이지 구조를 실험하고 있습니다. 피드백이 있으면 <a href="https://developer.mozilla.org/profiles/sheppy">sheppy</a> 에 문의하십시오 .</em>
ru: <em>Я экспериментирую со структурой для страниц, документирующих участников словарей. Пожалуйста, свяжитесь с <a href="https://developer.mozilla.org/profiles/sheppy">Шеппи</a> с любым отзывом .</em>
zh_cn: <em>我正在尝试记录字典成员页面的结构。如有任何反馈，请联系<a href="https://developer.mozilla.org/profiles/sheppy">sheppy</a>。</em>

source: <em>If the value of a <code>ConstrainDouble</code> is an object rather than a number, it may have the properties below in addition the properties it inherits from <a href="doublerange"><code>DoubleRange</code></a>.</em>
es: <em>Si el valor de <code>ConstrainDouble</code> es un objeto en lugar de un n&uacute;mero, puede tener las siguientes propiedades adem&aacute;s de las propiedades que hereda de <a href="doublerange"> <code>DoubleRange</code> </a> .</em>
ko: <em> <code>ConstrainDouble</code> 값이 숫자가 아닌 객체 인 경우 <a href="doublerange"> <code>DoubleRange</code> </a> 에서 상속되는 속성과 함께 아래 속성이있을 수 있습니다 .</em>
ru: <em>Если значение <code>ConstrainDouble</code> является объектом, а не числом, он может иметь свойства, указанные ниже, в дополнение к свойствам, которые он наследует от <a href="doublerange"> <code>DoubleRange</code> </a> .</em>
zh_cn: <em>如果 <code>ConstrainDouble</code> 的值是一个对象而不是数字，则它可能具有下面的属性，以及它从<a href="doublerange"> <code>DoubleRange</code> </a>继承的属性。</em>
