Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/dom/dom.*.007.xlf
Languages: es, ko, ru, zh_cn

source: <strong>Availability:</strong> This extension is only available to <a href="webglrenderingcontext">WebGL1</a> contexts. In <a href="webgl2renderingcontext">WebGL2</a>, the functionality of this extension is available on the WebGL2 context by default and the constants and methods are available without the "<code>OES</code>" suffix.
es: <strong>Disponibilidad:</strong> esta extensi&oacute;n solo est&aacute; disponible para contextos <a href="webglrenderingcontext">WebGL1</a> . En <a href="webgl2renderingcontext">WebGL2</a> , la funcionalidad de esta extensi&oacute;n est&aacute; disponible en el contexto WebGL2 de forma predeterminada y las constantes y m&eacute;todos est&aacute;n disponibles sin el sufijo " <code>OES</code> ".
ko: <strong>가용성 :</strong> 이 확장은 <a href="webglrenderingcontext">WebGL1</a> 컨텍스트 에서만 사용 가능 합니다. 에서 <a href="webgl2renderingcontext">WebGL2</a> ,이 확장 기능은 기본 및 상수 및 방법에 의해 WebGL2 컨텍스트에서 사용할 수는 "없이 사용할 수있는 <code>OES</code> "접미사.
ru: <strong>Доступность:</strong> это расширение доступно только для контекстов <a href="webglrenderingcontext">WebGL1</a> . В <a href="webgl2renderingcontext">WebGL2</a> функциональность этого расширения доступна по умолчанию в контексте WebGL2, а константы и методы доступны без суффикса &laquo; <code>OES</code> &raquo;.
zh_cn: <strong>可用性：</strong>此扩展仅适用于<a href="webglrenderingcontext">WebGL1</a>上下文。在<a href="webgl2renderingcontext">WebGL2中</a>，默认情况下，此扩展的功能在WebGL2上下文中可用，并且常量和方法在不带&ldquo; <code>OES</code> &rdquo;后缀的情况下可用。

source: <strong>Availability:</strong> This extension is only available to <a href="webglrenderingcontext">WebGL1</a> contexts. In <a href="webgl2renderingcontext">WebGL2</a>, the functionality of this extension is available on the WebGL2 context by default.
es: <strong>Disponibilidad:</strong> esta extensi&oacute;n solo est&aacute; disponible para contextos <a href="webglrenderingcontext">WebGL1</a> . En <a href="webgl2renderingcontext">WebGL2</a> , la funcionalidad de esta extensi&oacute;n est&aacute; disponible en el contexto de WebGL2 de manera predeterminada.
ko: <strong>가용성 :</strong> 이 확장은 <a href="webglrenderingcontext">WebGL1</a> 컨텍스트 에서만 사용 가능 합니다. 에서 <a href="webgl2renderingcontext">WebGL2</a> ,이 확장 기능은 기본적으로 WebGL2 컨텍스트에서 사용할 수 있습니다.
ru: <strong>Доступность:</strong> это расширение доступно только для контекстов <a href="webglrenderingcontext">WebGL1</a> . В <a href="webgl2renderingcontext">WebGL2</a> функциональность этого расширения доступна в контексте WebGL2 по умолчанию.
zh_cn: <strong>可用性：</strong>此扩展仅适用于<a href="webglrenderingcontext">WebGL1</a>上下文。在<a href="webgl2renderingcontext">WebGL2中</a>，默认情况下，此扩展的功能在WebGL2上下文中可用。

source: <strong>Availability:</strong> This extension is only available to <a href="webglrenderingcontext">WebGL1</a> contexts. In <a href="webgl2renderingcontext">WebGL2</a>, the functionality of this extension is available on the WebGL2 context by default. In WebGL 2, the constant is available as <code>gl.FRAGMENT_SHADER_DERIVATIVE_HINT</code> and it requires GLSL <code>#version 300 es</code>.
es: <strong>Disponibilidad:</strong> esta extensi&oacute;n solo est&aacute; disponible para contextos <a href="webglrenderingcontext">WebGL1</a> . En <a href="webgl2renderingcontext">WebGL2</a> , la funcionalidad de esta extensi&oacute;n est&aacute; disponible en el contexto de WebGL2 de manera predeterminada. En WebGL 2, la constante est&aacute; disponible como <code>gl.FRAGMENT_SHADER_DERIVATIVE_HINT</code> y requiere GLSL <code>#version 300 es</code> .
ko: <strong>가용성 :</strong> 이 확장은 <a href="webglrenderingcontext">WebGL1</a> 컨텍스트 에서만 사용 가능 합니다. 에서 <a href="webgl2renderingcontext">WebGL2</a> ,이 확장 기능은 기본적으로 WebGL2 컨텍스트에서 사용할 수 있습니다. WebGL 2에서 상수는 <code>gl.FRAGMENT_SHADER_DERIVATIVE_HINT</code> 로 제공되며 GLSL <code>#version 300 es</code> 가 필요합니다 .
ru: <strong>Доступность:</strong> это расширение доступно только для контекстов <a href="webglrenderingcontext">WebGL1</a> . В <a href="webgl2renderingcontext">WebGL2</a> функциональность этого расширения доступна в контексте WebGL2 по умолчанию. В WebGL 2 константа доступна как <code>gl.FRAGMENT_SHADER_DERIVATIVE_HINT</code> , и для нее требуется GLSL <code>#version 300 es</code> .
zh_cn: <strong>可用性：</strong>此扩展仅适用于<a href="webglrenderingcontext">WebGL1</a>上下文。在<a href="webgl2renderingcontext">WebGL2中</a>，默认情况下，此扩展的功能在WebGL2上下文中可用。在WebGL 2中，常量可以作为 <code>gl.FRAGMENT_SHADER_DERIVATIVE_HINT</code> 使用，它需要GLSL <code>#version 300 es</code> 。

source: <strong>Availability:</strong> This extension is only available to <a href="webglrenderingcontext">WebGL1</a> contexts. In <a href="webgl2renderingcontext">WebGL2</a>, the functionality of this extension is available on the WebGL2 context by default. In WebGL 2, the constant<code>s</code> are available without the "WEBGL" suffix and the new GLSL built-ins require GLSL <code>#version 300 es</code>.
es: <strong>Disponibilidad:</strong> esta extensi&oacute;n solo est&aacute; disponible para contextos <a href="webglrenderingcontext">WebGL1</a> . En <a href="webgl2renderingcontext">WebGL2</a> , la funcionalidad de esta extensi&oacute;n est&aacute; disponible en el contexto de WebGL2 de manera predeterminada. En WebGL 2, las constantes <code>s</code> est&aacute;n disponibles sin el sufijo "WEBGL" y las nuevas incorporaciones GLSL requieren GLSL <code>#version 300 es</code> .
ko: <strong>가용성 :</strong> 이 확장은 <a href="webglrenderingcontext">WebGL1</a> 컨텍스트 에서만 사용 가능 합니다. 에서 <a href="webgl2renderingcontext">WebGL2</a> ,이 확장 기능은 기본적으로 WebGL2 컨텍스트에서 사용할 수 있습니다. WebGL을 2에서, 상수의 <code>s</code> 은 "WEBGL"접미사없이 사용할 수 있으며, 새로운 GLSL 내장 기능은 GLSL의 요구 <code>#version 300 es</code> .
ru: <strong>Доступность:</strong> это расширение доступно только для контекстов <a href="webglrenderingcontext">WebGL1</a> . В <a href="webgl2renderingcontext">WebGL2</a> функциональность этого расширения доступна в контексте WebGL2 по умолчанию. В WebGL 2 константы <code>s</code> доступны без суффикса &laquo;WEBGL&raquo;, а новые встроенные GLSL требуют GLSL <code>#version 300 es</code> .
zh_cn: <strong>可用性：</strong>此扩展仅适用于<a href="webglrenderingcontext">WebGL1</a>上下文。在<a href="webgl2renderingcontext">WebGL2中</a>，默认情况下，此扩展的功能在WebGL2上下文中可用。在WebGL 2中，常量 <code>s</code> 可以不带&ldquo; WEBGL&rdquo;后缀，而新的GLSL内置组件需要GLSL <code>#version 300 es</code> 。

source: <strong>Availability:</strong> This extension is only available to <a href="webglrenderingcontext">WebGL1</a> contexts. In <a href="webgl2renderingcontext">WebGL2</a>, the functionality of this extension is available on the WebGL2 context by default. It requires GLSL <code>#version 300 es</code>.
es: <strong>Disponibilidad:</strong> esta extensi&oacute;n solo est&aacute; disponible para contextos <a href="webglrenderingcontext">WebGL1</a> . En <a href="webgl2renderingcontext">WebGL2</a> , la funcionalidad de esta extensi&oacute;n est&aacute; disponible en el contexto de WebGL2 de manera predeterminada. Requiere GLSL <code>#version 300 es</code> .
ko: <strong>가용성 :</strong> 이 확장은 <a href="webglrenderingcontext">WebGL1</a> 컨텍스트 에서만 사용 가능 합니다. 에서 <a href="webgl2renderingcontext">WebGL2</a> ,이 확장 기능은 기본적으로 WebGL2 컨텍스트에서 사용할 수 있습니다. GLSL <code>#version 300 es</code> 가 필요합니다 .
ru: <strong>Доступность:</strong> это расширение доступно только для контекстов <a href="webglrenderingcontext">WebGL1</a> . В <a href="webgl2renderingcontext">WebGL2</a> функциональность этого расширения доступна в контексте WebGL2 по умолчанию. Требуется GLSL # <code>#version 300 es</code> .
zh_cn: <strong>可用性：</strong>此扩展仅适用于<a href="webglrenderingcontext">WebGL1</a>上下文。在<a href="webgl2renderingcontext">WebGL2中</a>，默认情况下，此扩展的功能在WebGL2上下文中可用。它要求GLSL <code>#version 300 es</code> 。

source: <strong>Availability:</strong> This extension is only available to <a href="webglrenderingcontext">WebGL1</a> contexts. In <a href="webgl2renderingcontext">WebGL2</a>, the functionality of this extension is available on the WebGL2 context by default. The constant in WebGL2 is <code>gl.HALF_FLOAT</code>.
es: <strong>Disponibilidad:</strong> esta extensi&oacute;n solo est&aacute; disponible para contextos <a href="webglrenderingcontext">WebGL1</a> . En <a href="webgl2renderingcontext">WebGL2</a> , la funcionalidad de esta extensi&oacute;n est&aacute; disponible en el contexto de WebGL2 de manera predeterminada. La constante en WebGL2 es <code>gl.HALF_FLOAT</code> .
ko: <strong>가용성 :</strong> 이 확장은 <a href="webglrenderingcontext">WebGL1</a> 컨텍스트 에서만 사용 가능 합니다. 에서 <a href="webgl2renderingcontext">WebGL2</a> ,이 확장 기능은 기본적으로 WebGL2 컨텍스트에서 사용할 수 있습니다. WebGL2의 상수는 <code>gl.HALF_FLOAT</code> 입니다.
ru: <strong>Доступность:</strong> это расширение доступно только для контекстов <a href="webglrenderingcontext">WebGL1</a> . В <a href="webgl2renderingcontext">WebGL2</a> функциональность этого расширения доступна в контексте WebGL2 по умолчанию. Константа в WebGL2 - это <code>gl.HALF_FLOAT</code> .
zh_cn: <strong>可用性：</strong>此扩展仅适用于<a href="webglrenderingcontext">WebGL1</a>上下文。在<a href="webgl2renderingcontext">WebGL2中</a>，默认情况下，此扩展的功能在WebGL2上下文中可用。WebGL2中的常量是 <code>gl.HALF_FLOAT</code> 。

source: <strong>Availability:</strong> This extension is only available to <a href="webglrenderingcontext">WebGL1</a> contexts. In <a href="webgl2renderingcontext">WebGL2</a>, the functionality of this extension is available on the WebGL2 context by default. The constant in WebGL2 is <code>gl.UNSIGNED_INT_24_8</code>.
es: <strong>Disponibilidad:</strong> esta extensi&oacute;n solo est&aacute; disponible para contextos <a href="webglrenderingcontext">WebGL1</a> . En <a href="webgl2renderingcontext">WebGL2</a> , la funcionalidad de esta extensi&oacute;n est&aacute; disponible en el contexto de WebGL2 de manera predeterminada. La constante en WebGL2 es <code>gl.UNSIGNED_INT_24_8</code> .
ko: <strong>가용성 :</strong> 이 확장은 <a href="webglrenderingcontext">WebGL1</a> 컨텍스트 에서만 사용 가능 합니다. 에서 <a href="webgl2renderingcontext">WebGL2</a> ,이 확장 기능은 기본적으로 WebGL2 컨텍스트에서 사용할 수 있습니다. WebGL2의 상수는 <code>gl.UNSIGNED_INT_24_8</code> 입니다.
ru: <strong>Доступность:</strong> это расширение доступно только для контекстов <a href="webglrenderingcontext">WebGL1</a> . В <a href="webgl2renderingcontext">WebGL2</a> функциональность этого расширения доступна в контексте WebGL2 по умолчанию. Константа в WebGL2 - это <code>gl.UNSIGNED_INT_24_8</code> .
zh_cn: <strong>可用性：</strong>此扩展仅适用于<a href="webglrenderingcontext">WebGL1</a>上下文。在<a href="webgl2renderingcontext">WebGL2中</a>，默认情况下，此扩展的功能在WebGL2上下文中可用。WebGL2中的常量是 <code>gl.UNSIGNED_INT_24_8</code> 。

source: <strong>Availability:</strong> This extension is only available to <a href="webglrenderingcontext">WebGL1</a> contexts. In <a href="webgl2renderingcontext">WebGL2</a>, the functionality of this extension is available on the WebGL2 context by default. The constants in WebGL2 are <code>gl.MIN</code> and <code>gl.MAX</code>.
es: <strong>Disponibilidad:</strong> esta extensi&oacute;n solo est&aacute; disponible para contextos <a href="webglrenderingcontext">WebGL1</a> . En <a href="webgl2renderingcontext">WebGL2</a> , la funcionalidad de esta extensi&oacute;n est&aacute; disponible en el contexto de WebGL2 de manera predeterminada. Las constantes en WebGL2 son <code>gl.MIN</code> y <code>gl.MAX</code> .
ko: <strong>가용성 :</strong> 이 확장은 <a href="webglrenderingcontext">WebGL1</a> 컨텍스트 에서만 사용 가능 합니다. 에서 <a href="webgl2renderingcontext">WebGL2</a> ,이 확장 기능은 기본적으로 WebGL2 컨텍스트에서 사용할 수 있습니다. WebGL2의 상수는 <code>gl.MIN</code> 및 <code>gl.MAX</code> 입니다.
ru: <strong>Доступность:</strong> это расширение доступно только для контекстов <a href="webglrenderingcontext">WebGL1</a> . В <a href="webgl2renderingcontext">WebGL2</a> функциональность этого расширения доступна в контексте WebGL2 по умолчанию. Константами в WebGL2 являются <code>gl.MIN</code> и <code>gl.MAX</code> .
zh_cn: <strong>可用性：</strong>此扩展仅适用于<a href="webglrenderingcontext">WebGL1</a>上下文。在<a href="webgl2renderingcontext">WebGL2中</a>，默认情况下，此扩展的功能在WebGL2上下文中可用。WebGL2中的常量是 <code>gl.MIN</code> 和 <code>gl.MAX</code> 。

source: <strong>Availability:</strong> This extension is only available to <a href="webglrenderingcontext">WebGL1</a> contexts. In <a href="webgl2renderingcontext">WebGL2</a>, the functionality of this extension is available on the WebGL2 context by default. The constants in WebGL2 are: <code>gl.SRGB</code>, <code>gl.SRGB8</code>, <code>gl.SRGB8_ALPHA8</code> and <code>gl.FRAMEBUFFER_ATTACHMENT_COLOR_ENCODING</code>.
es: <strong>Disponibilidad:</strong> esta extensi&oacute;n solo est&aacute; disponible para contextos <a href="webglrenderingcontext">WebGL1</a> . En <a href="webgl2renderingcontext">WebGL2</a> , la funcionalidad de esta extensi&oacute;n est&aacute; disponible en el contexto de WebGL2 de manera predeterminada. Las constantes en WebGL2 son: <code>gl.SRGB</code> , <code>gl.SRGB8</code> , <code>gl.SRGB8_ALPHA8</code> y <code>gl.FRAMEBUFFER_ATTACHMENT_COLOR_ENCODING</code> .
ko: <strong>가용성 :</strong> 이 확장은 <a href="webglrenderingcontext">WebGL1</a> 컨텍스트 에서만 사용 가능 합니다. 에서 <a href="webgl2renderingcontext">WebGL2</a> ,이 확장 기능은 기본적으로 WebGL2 컨텍스트에서 사용할 수 있습니다. WebGL2의 상수는 다음과 같습니다 <code>gl.SRGB</code> , <code>gl.SRGB8</code> , <code>gl.SRGB8_ALPHA8</code> 및 <code>gl.FRAMEBUFFER_ATTACHMENT_COLOR_ENCODING</code> .
ru: <strong>Доступность:</strong> это расширение доступно только для контекстов <a href="webglrenderingcontext">WebGL1</a> . В <a href="webgl2renderingcontext">WebGL2</a> функциональность этого расширения доступна в контексте WebGL2 по умолчанию. Константы в WebGL2: <code>gl.SRGB</code> , <code>gl.SRGB8</code> , <code>gl.SRGB8_ALPHA8</code> и <code>gl.FRAMEBUFFER_ATTACHMENT_COLOR_ENCODING</code> .
zh_cn: <strong>可用性：</strong>此扩展仅适用于<a href="webglrenderingcontext">WebGL1</a>上下文。在<a href="webgl2renderingcontext">WebGL2中</a>，默认情况下，此扩展的功能在WebGL2上下文中可用。WebGL2中的常量是： <code>gl.SRGB</code> ， <code>gl.SRGB8</code> ， <code>gl.SRGB8_ALPHA8</code> 和 <code>gl.FRAMEBUFFER_ATTACHMENT_COLOR_ENCODING</code> 。

source: <strong>Availability:</strong> This extension should be available in <a href="webglrenderingcontext">WebGL1</a> contexts only. <a href="https://developer.mozilla.org/en-US/docs/Web/API/EXT_disjoint_timer_query_webgl2"><code>EXT_disjoint_timer_query_webgl2</code></a> is available in <a href="webgl2renderingcontext">WebGL 2</a> contexts .
es: <strong>Disponibilidad:</strong> esta extensi&oacute;n debe estar disponible solo en contextos <a href="webglrenderingcontext">WebGL1</a> . <a href="https://developer.mozilla.org/en-US/docs/Web/API/EXT_disjoint_timer_query_webgl2"> <code>EXT_disjoint_timer_query_webgl2</code> </a> est&aacute; disponible en contextos <a href="webgl2renderingcontext">WebGL 2</a> .
ko: <strong>가용성 :</strong> 이 확장은 <a href="webglrenderingcontext">WebGL1</a> 컨텍스트에서만 사용 가능해야합니다 . <a href="https://developer.mozilla.org/en-US/docs/Web/API/EXT_disjoint_timer_query_webgl2"> <code>EXT_disjoint_timer_query_webgl2</code> </a> 는 <a href="webgl2renderingcontext">WebGL 2</a> 컨텍스트 에서 사용 가능 합니다.
ru: <strong>Доступность:</strong> это расширение должно быть доступно только в контексте <a href="webglrenderingcontext">WebGL1</a> . <a href="https://developer.mozilla.org/en-US/docs/Web/API/EXT_disjoint_timer_query_webgl2"> <code>EXT_disjoint_timer_query_webgl2</code> </a> доступен в контекстах <a href="webgl2renderingcontext">WebGL 2</a> .
zh_cn: <strong>可用性：</strong>此扩展名仅在<a href="webglrenderingcontext">WebGL1</a>上下文中可用。<a href="https://developer.mozilla.org/en-US/docs/Web/API/EXT_disjoint_timer_query_webgl2"> <code>EXT_disjoint_timer_query_webgl2</code> </a>在<a href="webgl2renderingcontext">WebGL 2</a>上下文中可用。

source: <strong>Avoid making changes to the DOM within your idle callback.</strong> By the time your callback is run, the current frame has already finished drawing, and all layout updates and computations have been completed. If you make changes that affect layout, you may force a situation in which the browser has to stop and do recalculations that would otherwise be unnecessary. If your callback needs to change the DOM, it should use <a href="window/requestanimationframe"><code>Window.requestAnimationFrame()</code></a> to schedule that.
es: <strong>Evite realizar cambios en el DOM dentro de su devoluci&oacute;n de llamada inactiva. </strong>Para cuando se ejecuta la devoluci&oacute;n de llamada, el marco actual ya ha terminado de dibujarse y se han completado todas las actualizaciones y c&aacute;lculos de dise&ntilde;o. Si realiza cambios que afectan el dise&ntilde;o, puede forzar una situaci&oacute;n en la que el navegador tiene que detenerse y hacer nuevos c&aacute;lculos que de otra forma ser&iacute;an innecesarios. Si su devoluci&oacute;n de llamada necesita cambiar el DOM, debe usar <a href="window/requestanimationframe"> <code>Window.requestAnimationFrame()</code> </a> para programar eso.
ko: <strong>유휴 콜백 내에서 DOM을 변경하지 마십시오. </strong>콜백이 실행될 때 현재 프레임이 이미 그리기를 완료했으며 모든 레이아웃 업데이트 및 계산이 완료되었습니다. 레이아웃에 영향을주는 변경을 수행하면 브라우저가 중지되고 상황이 불필요하게 다시 계산되어야하는 상황이 발생할 수 있습니다. 콜백이 DOM을 변경해야하는 경우 <a href="window/requestanimationframe"> <code>Window.requestAnimationFrame()</code> </a> 을 사용 하여 예약해야합니다.
ru: <strong>Избегайте внесения изменений в DOM в режиме ожидания. </strong>Ко времени выполнения обратного вызова текущий кадр уже завершил рисование, и все обновления макета и вычисления были завершены. Если вы вносите изменения, которые влияют на макет, вы можете вызвать ситуацию, в которой браузер должен остановиться и выполнить пересчеты, которые в противном случае были бы излишними. Если ваш обратный вызов должен изменить DOM, он должен использовать <a href="window/requestanimationframe"> <code>Window.requestAnimationFrame()</code> </a> чтобы запланировать это.
zh_cn: <strong>避免在空闲回调中对DOM进行更改。</strong>在运行回调时，当前框架已经完成绘制，并且所有布局更新和计算都已完成。如果进行了影响布局的更改，则可能会导致浏览器不得不停止并进行重新计算的情况，否则这是不必要的。如果您的回调需要更改DOM，则应使用<a href="window/requestanimationframe"> <code>Window.requestAnimationFrame()</code> </a>进行安排。

source: <strong>Avoid tasks whose run time can't be predicted.</strong> Your idle callback should avoid doing anything that could take an unpredictable amount of time. For example, anything which might affect layout should be avoided. You should also avoid resolving or rejecting <a href="https://developer.mozilla.org/en-US/docs/Web/API/Promise"><code>Promise</code></a>s, since that would invoke the handler for that promise's resolution or rejection as soon as your callback returns.
es: <strong>Evite tareas cuyo tiempo de ejecuci&oacute;n no pueda predecirse. </strong>Su devoluci&oacute;n de llamada inactiva debe evitar hacer algo que pueda llevar una cantidad de tiempo impredecible. Por ejemplo, se debe evitar cualquier cosa que pueda afectar el dise&ntilde;o. Tambi&eacute;n debe evitar resolver o rechazar <a href="https://developer.mozilla.org/en-US/docs/Web/API/Promise"> <code>Promise</code> </a> , ya que eso invocar&iacute;a al controlador para la resoluci&oacute;n o rechazo de esa promesa tan pronto como regrese su devoluci&oacute;n de llamada.
ko: <strong>실행 시간을 예측할 수없는 작업은 피하십시오. </strong>유휴 콜백은 예상치 못한 시간이 걸리는 일을 피해야합니다. 예를 들어, 레이아웃에 영향을 줄 수있는 것은 피해야합니다. <a href="https://developer.mozilla.org/en-US/docs/Web/API/Promise"> <code>Promise</code> </a> 의 해결 또는 거부도 피해야 합니다. 콜백이 반환되는 즉시 해당 약속의 해결 또는 거부에 대한 처리기를 호출하기 때문입니다.
ru: <strong>Избегайте задач, время выполнения которых не может быть предсказано. </strong>Ваш неактивный обратный вызов должен избегать любых действий, которые могут занять непредсказуемое количество времени. Например, следует избегать всего, что может повлиять на макет. Вам также следует избегать разрешения или отклонения <a href="https://developer.mozilla.org/en-US/docs/Web/API/Promise"> <code>Promise</code> </a> , поскольку это вызовет обработчик для разрешения или отклонения этого обещания, как только ваш обратный вызов вернется.
zh_cn: <strong>避免运行时间无法预测的任务。</strong>空闲的回调应该避免做任何可能花费不可预测时间的事情。例如，应避免任何可能影响布局的事情。您还应该避免解析或拒绝<a href="https://developer.mozilla.org/en-US/docs/Web/API/Promise"> <code>Promise</code> </a>，因为这将在回调返回后立即调用处理程序以实现该Promise的解决或拒绝。

source: <strong>Base64</strong> is a group of similar <a href="https://en.wikipedia.org/wiki/Binary-to-text_encoding">binary-to-text encoding</a> schemes that represent binary data in an ASCII string format by translating it into a radix-64 representation. The term <em>Base64</em> originates from a specific <a href="https://en.wikipedia.org/wiki/MIME#Content-Transfer-Encoding">MIME content transfer encoding</a>.
es: <strong>Base64</strong> es un grupo de esquemas de <a href="https://en.wikipedia.org/wiki/Binary-to-text_encoding">codificaci&oacute;n binario a texto</a> similares que representan datos binarios en un formato de cadena ASCII traduci&eacute;ndolos a una representaci&oacute;n radix-64. El t&eacute;rmino <em>Base64 se</em> origina a partir de una <a href="https://en.wikipedia.org/wiki/MIME#Content-Transfer-Encoding">codificaci&oacute;n de transferencia de contenido MIME</a> espec&iacute;fica .
ko: <strong>Base64</strong> 는 바이너리 데이터를 ASCII 문자열 형식으로 기수 64 표현으로 변환하여 나타내는 이진 <a href="https://en.wikipedia.org/wiki/Binary-to-text_encoding">텍스트 인코딩</a> 체계 의 그룹입니다 . <em>Base64</em> 라는 용어 는 특정 <a href="https://en.wikipedia.org/wiki/MIME#Content-Transfer-Encoding">MIME 컨텐츠 전송 인코딩</a> 에서 유래 합니다.
ru: <strong>Base64</strong> - это группа похожих схем <a href="https://en.wikipedia.org/wiki/Binary-to-text_encoding">кодирования двоичного текста</a> , которые представляют двоичные данные в строковом формате ASCII, переводя их в представление radix-64. Термин <em>Base64</em> происходит от конкретной <a href="https://en.wikipedia.org/wiki/MIME#Content-Transfer-Encoding">кодировки передачи содержимого MIME</a> .
zh_cn: <strong>Base64</strong>是一组类似的<a href="https://en.wikipedia.org/wiki/Binary-to-text_encoding">二进制到文本编码</a>方案，它们通过将ASCII格式的二进制数据转换为基数64表示形式来表示二进制数据。术语<em>Base64</em>源自特定的<a href="https://en.wikipedia.org/wiki/MIME#Content-Transfer-Encoding">MIME内容传输编码</a>。

source: <strong>Bold tag</strong> (<code>&lt;b&gt;&lt;/b&gt;</code>)
es: <strong>Etiqueta en negrita</strong> ( <code>&lt;b&gt;&lt;/b&gt;</code> )
ko: <strong>굵은 체 태그</strong> ( <code>&lt;b&gt;&lt;/b&gt;</code> )
ru: <strong>Жирный шрифт</strong> ( <code>&lt;b&gt;&lt;/b&gt;</code> )
zh_cn: <strong>粗体标签</strong>（ <code>&lt;b&gt;&lt;/b&gt;</code> ）
