Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/dom/dom.*.011.xlf
Languages: ja, ko, ru, zh_cn

source: A long integer representing the cell's position in the <a href="https://developer.mozilla.org/en-US/docs/Web/API/HTMLTableRowElement/cells"><code>cells</code></a> collection of the <a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/tr"><code>&lt;tr&gt;</code></a> the cell is contained within. If the cell doesn't belong to a <code>&lt;tr&gt;</code>, it returns <code>-1</code>.
ja: セルの位置を表す長整数<a href="https://developer.mozilla.org/en-US/docs/Web/API/HTMLTableRowElement/cells"> <code>cells</code> </a>のコレクション<a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/tr"> <code>&lt;tr&gt;</code> </a>セル内に含まれます。セルが <code>&lt;tr&gt;</code> に属していない場合は、 <code>-1</code> を返します。
ko: 내의 셀의 총수를 나타내는 긴 정수 <a href="https://developer.mozilla.org/en-US/docs/Web/API/HTMLTableRowElement/cells"> <code>cells</code> </a> 의 컬렉션 <a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/tr"> <code>&lt;tr&gt;</code> </a> 세포가 포함된다. 셀이 <code>&lt;tr&gt;</code> 에 속하지 않으면 <code>-1</code> 을 반환합니다 .
ru: Длинное целое число, представляющее позицию <a href="https://developer.mozilla.org/en-US/docs/Web/API/HTMLTableRowElement/cells"> <code>cells</code> </a> коллекции ячеек <a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/tr"> <code>&lt;tr&gt;</code> ,</a> в которой находится ячейка. Если ячейка не принадлежит <code>&lt;tr&gt;</code> , она возвращает <code>-1</code> .
zh_cn: 一个长整数，表示该单元格在其中<a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/tr"> <code>&lt;tr&gt;</code> </a>的单元<a href="https://developer.mozilla.org/en-US/docs/Web/API/HTMLTableRowElement/cells"> <code>cells</code> </a>集合中的位置。如果单元格不属于 <code>&lt;tr&gt;</code> ，则返回 <code>-1</code> 。

source: A long integer value indicating the candidate's priority.
ja: 候補者の優先度を示す長い整数値。
ko: 응시자의 우선 순위를 나타내는 긴 정수 값.
ru: Длинное целое значение,указывающее приоритет кандидата.
zh_cn: 一个长整数值,表示候选人的优先级。

source: A long integer value indicating the current value of the <a href="mediatracksettings/width"><code>width</code></a> property, specifying the width of the track's video data in pixels.
ja: 現在の値を表す長整数値<a href="mediatracksettings/width"> <code>width</code> </a>をピクセル単位でトラックのビデオデータの幅を指定する、プロパティ。
ko: 의 전류 값을 나타내는 긴 정수 값 <a href="mediatracksettings/width"> <code>width</code> </a> 픽셀 트랙의 비디오 데이터 폭을 지정하는 속성.
ru: Длинное целое значение, указывающее текущее значение свойства <a href="mediatracksettings/width"> <code>width</code> </a> , определяющее ширину видеоданных дорожки в пикселях.
zh_cn: 一个长整数值，指示<a href="mediatracksettings/width"> <code>width</code> </a>属性的当前值，以像素为单位指定轨道的视频数据的宽度。

source: A long integer value indicating the current value of the <code><a href="mediatrackconstraints/channelcount"><code>channelCount</code></a></code> property, specifying the number of audio channels present on the track (therefore indicating how many audio samples exist in each audio frame). This is 1 for mono, 2 for stereo, and so forth.
ja: <code><a href="mediatrackconstraints/channelcount"><code>channelCount</code></a></code> プロパティの現在の値を示す長整数値。トラックに存在するオーディオチャネルの数を指定します（したがって、各オーディオフレームに存在するオーディオサンプルの数を示します）。これは、モノラルの場合は1、ステレオの場合は2などです。
ko: <code><a href="mediatrackconstraints/channelcount"><code>channelCount</code></a></code> 속성 의 현재 값을 나타내는 긴 정수 값 으로, 트랙에있는 오디오 채널 수를 지정합니다 (따라서 각 오디오 프레임에 존재하는 오디오 샘플 수를 나타냄). 모노의 경우 1, 스테레오의 경우 2 등입니다.
ru: Длинное целое значение, указывающее текущее значение свойства <code><a href="mediatrackconstraints/channelcount"><code>channelCount</code></a></code> , указывающее количество аудиоканалов, присутствующих на дорожке (следовательно, указывающее, сколько аудиосэмплов существует в каждом аудиокадре). Это 1 для моно, 2 для стерео и так далее.
zh_cn: 一个长整数值，指示 <code><a href="mediatrackconstraints/channelcount"><code>channelCount</code></a></code> 属性的当前值，该属性指定轨道上存在的音频通道数（因此，指示每个音频帧中存在多少个音频样本）。单声道为1，立体声为2，依此类推。

source: A long integer value indicating the current value of the <code><a href="mediatrackconstraints/height"><code>height</code></a></code> property, specifying the height of the track's video data in pixels.
ja: 長い整数値の現在値を示す <code><a href="mediatrackconstraints/height"><code>height</code></a></code> ピクセル単位でトラックのビデオデータの高さを指定し、プロパティ。
ko: 긴 정수 값의 현재 값을 나타내는 <code><a href="mediatrackconstraints/height"><code>height</code></a></code> 픽셀 트랙의 영상 데이터의 높이를 지정하는 속성.
ru: Длинное целое значение, указывающее текущее значение свойства <code><a href="mediatrackconstraints/height"><code>height</code></a></code> , указывающее высоту видеоданных дорожки в пикселях.
zh_cn: 一个长整数值，指示 <code><a href="mediatrackconstraints/height"><code>height</code></a></code> 属性的当前值，以像素为单位指定轨道的视频数据的高度。

source: A long integer value indicating the current value of the <code><a href="mediatrackconstraints/samplerate"><code>sampleRate</code></a></code> property, specifying the sample rate in samples per second of the audio data. Standard CD-quality audio, for example, has a sample rate of 41,000 samples per second.
ja: サンプルレートをオーディオデータの1秒あたりのサンプル数で指定する、 <code><a href="mediatrackconstraints/samplerate"><code>sampleRate</code></a></code> プロパティの現在の値を示す長整数値。たとえば、標準のCD品質のオーディオのサンプルレートは41,000サンプル/秒です。
ko: <code><a href="mediatrackconstraints/samplerate"><code>sampleRate</code></a></code> 속성 의 현재 값을 나타내는 긴 정수 값 으로, 오디오 데이터의 초당 샘플 수로 샘플 속도를 지정합니다. 예를 들어 표준 CD 품질의 오디오는 초당 41,000 개의 샘플 속도가 있습니다.
ru: Длинное целое значение, указывающее текущее значение свойства <code><a href="mediatrackconstraints/samplerate"><code>sampleRate</code></a></code> , указывающее частоту дискретизации в выборках в секунду аудиоданных. Например, стандартное аудио качества CD имеет частоту дискретизации 41 000 выборок в секунду.
zh_cn: 一个长整数值，指示 <code><a href="mediatrackconstraints/samplerate"><code>sampleRate</code></a></code> 属性的当前值，以音频数据的每秒采样数指定采样率。例如，标准CD质量的音频的采样率为每秒41,000个采样。

source: A long integer value indicating the current value of the <code><a href="mediatrackconstraints/samplesize"><code>sampleSize</code></a></code> property, specifying the linear size, in bits, of each audio sample. CD-quality audio, for example, is 16-bit, so this value would be 16 in that case.
ja: 各オーディオサンプルの線形サイズをビット単位で指定する、 <code><a href="mediatrackconstraints/samplesize"><code>sampleSize</code></a></code> プロパティの現在の値を示す長整数値。たとえば、CD品質のオーディオは16ビットなので、この場合、この値は16になります。
ko: 각 오디오 샘플의 선형 크기를 비트 단위로 지정하여 <code><a href="mediatrackconstraints/samplesize"><code>sampleSize</code></a></code> 속성 의 현재 값을 나타내는 긴 정수 값 입니다. 예를 들어 CD 품질의 오디오는 16 비트이므로이 값은 16입니다.
ru: Длинное целое значение, указывающее текущее значение свойства <code><a href="mediatrackconstraints/samplesize"><code>sampleSize</code></a></code> , указывающее линейный размер в битах каждого аудиосэмпла . Например, звук CD-качества 16-битный, поэтому в этом случае это значение будет 16.
zh_cn: 一个长整数值，指示 <code><a href="mediatrackconstraints/samplesize"><code>sampleSize</code></a></code> 属性的当前值，以比特为单位指定每个音频样本的线性大小。例如，CD品质的音频为16位，因此在这种情况下该值为16。

source: A long integer which indicates the total number of frames successfully encoded for this RTP stream. This field is only present on video connections.
ja: この RTP ストリームのエンコードに成功したフレームの総数を示す長い整数。このフィールドはビデオ接続でのみ存在します。
ko: 이 RTP 스트림에 대해 성공적으로 인코딩 된 총 프레임 수를 나타내는 긴 정수입니다. 이 필드는 비디오 연결에만 존재합니다.
ru: Длинное целое число,указывающее на общее количество успешно закодированных кадров для данного RTP потока.Это поле присутствует только при видеосвязи.
zh_cn: 一个长整数,表示该RTP流成功编码的总帧数。该字段仅在视频连接上存在。

source: A long integer.
ja: 長い整数。
ko: 긴 정수
ru: Длинное целое число.
zh_cn: 一个长整数。

source: A long representing the handle of the <code>requestAnimationFrame()</code> call. This can then be passed to a <a href="cancelanimationframe"><code>VRDisplay.cancelAnimationFrame()</code></a> call to unregister the callback.
ja: <code>requestAnimationFrame()</code> 呼び出しのハンドルを表すlong 。次に、これを<a href="cancelanimationframe"> <code>VRDisplay.cancelAnimationFrame()</code> </a>呼び出しに渡して、コールバックの登録を解除できます。
ko: <code>requestAnimationFrame()</code> 호출 의 핸들을 나타내는 long 입니다. 그런 다음 <a href="cancelanimationframe"> <code>VRDisplay.cancelAnimationFrame()</code> </a> 호출로 전달되어 콜백을 등록 취소 할 수 있습니다.
ru: Длинный, представляющий дескриптор запроса <code>requestAnimationFrame()</code> . Затем это можно передать <a href="cancelanimationframe"> <code>VRDisplay.cancelAnimationFrame()</code> </a> для отмены регистрации обратного вызова.
zh_cn: 一个长 <code>requestAnimationFrame()</code> 表示requestAnimationFrame（）调用的句柄。然后可以将其传递给<a href="cancelanimationframe"> <code>VRDisplay.cancelAnimationFrame()</code> </a>调用以注销回调。

source: A long value representing the amount of twist applied to the pointer.
ja: ポインタに適用されるツイストの量を表す長い値。
ko: 포인터에 적용되는 꼬임 정도를 나타내는 긴 값입니다.
ru: Длинное значение,представляющее собой количество закруток,приложенных к указателю.
zh_cn: 一个长的值,代表应用于指针的扭转量。

source: A long, unsigned integer value indicating the priority of the candidate according to the remote peer. The larger this value is, the more preferable the remote peer considers this candidate to be.
ja: リモートピアによる候補の優先度を示す長い符号なし整数値。この値が大きいほど、リモートピアはこの候補をより好ましいと考えます。
ko: 원격 피어에 따른 후보의 우선 순위를 나타내는 길고 부호없는 정수 값. 이 값이 클수록 원격 피어는이 후보를 더 선호합니다.
ru: Длинное,неподписанное целое значение,указывающее приоритет кандидата по отношению к удаленному коллеге.Чем больше это значение,тем предпочтительнее удаленный коллега считает данного кандидата.
zh_cn: 一个长的无符号整数值,表示根据远程对等体的候选者的优先级。该值越大,说明远程对等体认为该候选人越优先。

source: A looping panorama
ja: ループするパノラマ
ko: 루핑 파노라마
ru: Петляющая панорама
zh_cn: 循环的全景图

source: A lot more information can be found on the Wikipedia page <a href="https://en.wikipedia.org/wiki/Sampling_%28signal_processing%29">Sampling (signal processing)</a>.
ja: Wikipediaのページ<a href="https://en.wikipedia.org/wiki/Sampling_%28signal_processing%29">Sampling（signal processing）で</a>さらに多くの情報を見つけることができます。
ko: 더 많은 정보는 Wikipedia page <a href="https://en.wikipedia.org/wiki/Sampling_%28signal_processing%29">Sampling (신호 처리)</a> 페이지에서 찾을 수 있습니다 .
ru: Гораздо больше информации можно найти на странице Википедии <a href="https://en.wikipedia.org/wiki/Sampling_%28signal_processing%29">Выборка (обработка сигналов)</a> .
zh_cn: 可以在Wikipedia页面<a href="https://en.wikipedia.org/wiki/Sampling_%28signal_processing%29">Sampling（信号处理）</a>上找到更多信息。

source: A low performance polyfill based on toDataURL.
ja: toDataURLをベースにした低性能ポリフィルです。
ko: toDataURL을 기반으로 한 낮은 성능의 폴리 필입니다.
ru: Низкопроизводительный полипропилен на основе toDataURL.
zh_cn: 一个基于toDataURL的低性能的多元填充。

source: A mechanism for iterating over multiple records with a <em>key range</em>. The cursor has a source that indicates which index or object store it is iterating. It has a position within the range, and moves in a direction that is increasing or decreasing in the order of record keys. For the reference documentation on cursors, see <a href="../idbcursor"><code>IDBCursor</code></a>.
ja: <em>キー範囲を</em>持つ複数のレコードを反復するメカニズム。カーソルには、反復しているインデックスまたはオブジェクトストアを示すソースがあります。範囲内の位置にあり、記録キーの順に増加または減少する方向に移動します。カーソルのリファレンスドキュメントについては、<a href="../idbcursor"> <code>IDBCursor</code> を</a>参照してください。
ko: <em>키 범위를</em> 가진 여러 레코드를 반복하는 메커니즘입니다 . 커서에는 반복하는 인덱스 또는 객체 저장소를 나타내는 소스가 있습니다. 범위 내의 위치를 ​​가지며 레코드 키 순서대로 증가 또는 감소하는 방향으로 이동합니다. 커서에 대한 참조 문서는 <a href="../idbcursor"> <code>IDBCursor</code> 를</a> 참조하십시오 .
ru: Механизм для перебора нескольких записей с <em>диапазоном ключей</em> . У курсора есть источник, который указывает, какой индекс или хранилище объектов он итерирует. Он имеет позицию в пределах диапазона и перемещается в направлении, которое увеличивается или уменьшается в порядке ключей записи. Для справочной документации по курсорам, см. <a href="../idbcursor"> <code>IDBCursor</code> </a> .
zh_cn: 一种遍历具有<em>关键字范围的</em>多个记录的机制。游标具有一个源，该源指示它正在迭代哪个索引或对象存储。它的位置在范围内，并按照记录键的顺序在增加或减少的方向上移动。有关游标的参考文档，请参阅<a href="../idbcursor"> <code>IDBCursor</code> </a>。

source: A mechanism for producing new keys in an ordered sequence. If an object store does not have a key generator, then the application must provide keys for records being stored. Generators are not shared between stores. This is more a browser implementation detail, because in web development, you don't really create or access key generators.
ja: 新しい鍵を順序立てて生成するメカニズム。オブジェクトストアがキー生成器を持たない場合、アプリケーションは保存されているレコードのキーを提供しなければならない。ジェネレータはストア間で共有されません。Web 開発では、キー生成器を実際に作成したりアクセスしたりすることはないので、これはブラウザの実装の詳細です。
ko: 순서대로 새 키를 생성하는 메커니즘입니다. 오브젝트 저장소에 키 생성기가없는 경우 애플리케이션은 저장중인 레코드에 키를 제공해야합니다. 생성기는 상점간에 공유되지 않습니다. 웹 개발에서는 실제로 키 생성기를 작성하거나 액세스하지 않기 때문에 이는 브라우저 구현 세부 사항입니다.
ru: Механизм производства новых ключей в упорядоченной последовательности.Если в объектном хранилище нет генератора ключей,то приложение должно предоставить ключи для хранения записей.Генераторы не делятся между магазинами.Это больше похоже на реализацию браузера,потому что в веб-разработке вы на самом деле не создаете генераторы ключей и не имеете к ним доступа.
zh_cn: 一种按顺序产生新钥匙的机制。如果一个对象存储没有键生成器,那么应用程序必须为存储的记录提供键。生成器不在存储之间共享。这更多的是一个浏览器实现的细节,因为在Web开发中,你不会真正创建或访问密钥生成器。

source: A media configuration &mdash; a <a href="videoconfiguration"><code>VideoConfiguration</code></a> or <a href="audioconfiguration"><code>AudioConfiguration</code></a> dictionary.
ja: メディア構成&mdash; <a href="videoconfiguration"> <code>VideoConfiguration</code> </a>または<a href="audioconfiguration"> <code>AudioConfiguration</code> </a>辞書。
ko: 미디어 구성 - <a href="videoconfiguration"> <code>VideoConfiguration</code> </a> 또는 <a href="audioconfiguration"> <code>AudioConfiguration</code> 의</a> 사전.
ru: Конфигурация мультимедиа - словарь <a href="videoconfiguration"> <code>VideoConfiguration</code> </a> или <a href="audioconfiguration"> <code>AudioConfiguration</code> </a> .
zh_cn: 媒体配置<a href="videoconfiguration"> <code>VideoConfiguration</code> </a>或<a href="audioconfiguration"> <code>AudioConfiguration</code> </a>字典。

source: A media configuration &mdash; a <a href="videoconfiguration"><code>VideoConfiguration</code></a><a href="audioconfiguration"><code>AudioConfiguration</code></a> dictionary.
ja: メディア構成&mdash; <a href="videoconfiguration"> <code>VideoConfiguration</code> </a><a href="audioconfiguration"> <code>AudioConfiguration</code> </a>辞書。
ko: 미디어 구성 - <a href="videoconfiguration"> <code>VideoConfiguration</code> </a><a href="audioconfiguration"> <code>AudioConfiguration</code> 의</a> 사전.
ru: Конфигурация мультимедиа - словарь <a href="videoconfiguration"> <code>VideoConfiguration</code> </a><a href="audioconfiguration"> <code>AudioConfiguration</code> </a> .
zh_cn: 媒体配置<a href="videoconfiguration"> <code>VideoConfiguration</code> </a><a href="audioconfiguration"> <code>AudioConfiguration</code> </a>字典。

source: A media element whose source is a <a href="../mediastream"><code>MediaStream</code></a> and whose <code>autoplay</code> property is <code>true</code> will begin playback when it becomes active (that is, when <a href="../mediastream/active"><code>MediaStream.active</code></a> becomes <code>true</code>).
ja: ソースが<a href="../mediastream"> <code>MediaStream</code> </a>で、 <code>autoplay</code> プロパティが <code>true</code> のメディア要素は、アクティブになると（つまり、<a href="../mediastream/active"> <code>MediaStream.active</code> </a>が <code>true</code> になると）再生を開始します。
ko: 소스가 <a href="../mediastream"> <code>MediaStream</code> </a> 이고 <code>autoplay</code> 속성이 <code>true</code> 인 미디어 요소 는 활성화 될 때 (즉, <a href="../mediastream/active"> <code>MediaStream.active</code> </a> 가 <code>true</code> 인 경우 ) 재생을 시작합니다 .
ru: Элемент мультимедиа, источником которого является <a href="../mediastream"> <code>MediaStream</code> ,</a> а свойство <code>autoplay</code> которого имеет значение <code>true</code> , начнет воспроизведение, когда он станет активным (то есть, когда <a href="../mediastream/active"> <code>MediaStream.active</code> </a> станет <code>true</code> ).
zh_cn: 源为<a href="../mediastream"> <code>MediaStream</code> </a>且 <code>autoplay</code> 属性为 <code>true</code> 的媒体元素在变为活动状态（即<a href="../mediastream/active"> <code>MediaStream.active</code> </a>变为 <code>true</code> ）时将开始播放。

source: A message channel is created using the <a href="messagechannel/messagechannel"><code>MessageChannel()</code></a> constructor. Once created, the two ports of the channel can be accessed through the <a href="messagechannel/port1"><code>MessageChannel.port1</code></a> and <a href="messagechannel/port2"><code>MessageChannel.port2</code></a> properties (which both return <a href="messageport"><code>MessagePort</code></a> objects.) The app that created the channel uses <code>port1</code>, and the app at the other end of the port uses <code>port2</code> &mdash; you send a message to <code>port2</code>, and transfer the port over to the other browsing context using <a href="window/postmessage"><code>window.postMessage</code></a> along with two arguments (the message to send, and the object to transfer ownership of, in this case the port itself.)
ja: メッセージチャネルは、<a href="messagechannel/messagechannel"> <code>MessageChannel()</code> </a>コンストラクタを使用して作成されます。作成された、チャネルの2つのポートを介してアクセスすることができ、一度<a href="messagechannel/port1"> <code>MessageChannel.port1</code> </a>と<a href="messagechannel/port2"> <code>MessageChannel.port2</code> </a>特性（これは、両方のリターン<a href="messageport"> <code>MessagePort</code> が</a>オブジェクト。）を使用し、チャネル作成アプリ <code>port1</code> 、ポート使用のもう一方の端でのAPP <code>port2</code> &mdash;メッセージを <code>port2</code> に送信し、2つの引数（送信するメッセージ、および所有権を転送するオブジェクト、この場合はポート自体）とともに<a href="window/postmessage"> <code>window.postMessage</code> </a>を使用して、ポートを他のブラウジングコンテキストに転送します。
ko: 메시지 채널은 <a href="messagechannel/messagechannel"> <code>MessageChannel()</code> </a> 생성자를 사용하여 작성됩니다 . 일단 생성되면 <a href="messagechannel/port1"> <code>MessageChannel.port1</code> </a> 및 <a href="messagechannel/port2"> <code>MessageChannel.port2</code> </a> 속성 (둘 다 <a href="messageport"> <code>MessagePort</code> </a> 객체를 반환 함)을 통해 채널의 두 포트에 액세스 할 수 있습니다 . 채널을 생성 한 앱은 <code>port1</code> 을 사용하고 포트의 다른 쪽 끝에있는 앱은 <code>port2</code> - 당신에게 메시지를 보내 <code>port2</code> 및 사용하여 다른 검색 컨텍스트를 통해 포트를 전송 <a href="window/postmessage"> <code>window.postMessage</code> 을</a> 두 개의 인수와 함께 (이 경우 포트 자체에 보낼 메시지, 그리고 소유권의 객체입니다.)
ru: Канал сообщений создается с помощью конструктора <a href="messagechannel/messagechannel"> <code>MessageChannel()</code> </a> . После создания к двум портам канала можно получить доступ через свойства <a href="messagechannel/port1"> <code>MessageChannel.port1</code> </a> и <a href="messagechannel/port2"> <code>MessageChannel.port2</code> </a> (которые оба возвращают объекты <a href="messageport"> <code>MessagePort</code> </a> .) Приложение, создавшее канал, использует <code>port1</code> , а приложение на другом конце порта использует <code>port2</code> - вы отправляете сообщение на <code>port2</code> и переносите порт в другой контекст просмотра, используя <a href="window/postmessage"> <code>window.postMessage</code> </a> вместе с двумя аргументами (сообщение для отправки и объект для передачи прав собственности, в данном случае сам порт).
zh_cn: 使用<a href="messagechannel/messagechannel"> <code>MessageChannel()</code> </a>构造函数创建一个消息通道。创建通道后，可以通过<a href="messagechannel/port1"> <code>MessageChannel.port1</code> </a>和<a href="messagechannel/port2"> <code>MessageChannel.port2</code> </a>属性（均返回<a href="messageport"> <code>MessagePort</code> </a>对象）访问通道的两个端口。创建通道的应用程序使用 <code>port1</code> ，而端口另一端的应用程序使用 <code>port2</code> -您将消息发送到 <code>port2</code> ，并使用<a href="window/postmessage"> <code>window.postMessage</code> </a>以及两个参数（要发送的消息和要转让所有权的对象，在这种情况下，端口本身）将端口转移到其他浏览上下文。

source: A method containing a parameter <code>chunk</code> &mdash; this indicates the size to use for each chunk, in bytes.
ja: パラメータ <code>chunk</code> を含むメソッド&mdash;これは、各チャンクに使用するサイズをバイト単位で示します。
ko: 매개 변수 <code>chunk</code> 포함하는 메서드 &mdash; 각 청크에 사용할 크기를 바이트 단위로 나타냅니다.
ru: Метод, содержащий параметр <code>chunk</code> - это указывает размер, который нужно использовать для каждого чанка, в байтах.
zh_cn: 包含参数 <code>chunk</code> 方法-这指示每个块要使用的大小（以字节为单位）。

source: A method that compares two keys and returns a result indicating which one is greater in value.
ja: 2 つのキーを比較し、どちらの方が値が大きいかを示す結果を返すメソッド。
ko: 두 키를 비교하여 어느 키가 더 큰지를 나타내는 결과를 반환하는 메서드입니다.
ru: Метод,который сравнивает две клавиши и возвращает результат,указывающий,какая из них больше по значению.
zh_cn: 比较两个键的方法,并返回一个结果,表明哪一个键的值更大。

source: A method to be called if an error occurs. Receives as its sole input parameter a <a href="../fileerror"><code>FileError</code></a> object describing the error which occurred.
ja: エラーが発生した場合に呼び出されるメソッド。発生したエラーを説明する<a href="../fileerror"> <code>FileError</code> </a>オブジェクトを唯一の入力パラメーターとして受け取ります。
ko: 에러가 발생했을 경우에 호출되는 메소드. 발생한 오류를 설명 하는 <a href="../fileerror"> <code>FileError</code> </a> 객체를 유일한 입력 매개 변수로받습니다 .
ru: Метод, вызываемый при возникновении ошибки. Получает в качестве единственного входного параметра объект <a href="../fileerror"> <code>FileError</code> ,</a> описывающий возникшую ошибку.
zh_cn: 发生错误时要调用的方法。接收描述错误的<a href="../fileerror"> <code>FileError</code> </a>对象作为其唯一输入参数。

source: A method to be called once the <a href="https://developer.mozilla.org/en-US/docs/Web/API/FileSystemDirectoryEntry"><code>FileSystemDirectoryEntry</code></a> has been created. The method receives a single parameter: the <code>FileSystemDirectoryEntry</code> object representing the directory in question.
ja: <a href="https://developer.mozilla.org/en-US/docs/Web/API/FileSystemDirectoryEntry"> <code>FileSystemDirectoryEntry</code> </a>が作成されたときに呼び出されるメソッド。このメソッドは、単一のパラメーター、つまり問題のディレクトリを表す <code>FileSystemDirectoryEntry</code> オブジェクトを受け取ります。
ko: <a href="https://developer.mozilla.org/en-US/docs/Web/API/FileSystemDirectoryEntry"> <code>FileSystemDirectoryEntry</code> </a> 가 작성 되면 호출 될 메소드 입니다. 이 메소드는 단일 디렉토리, 즉 해당 디렉토리를 나타내는 <code>FileSystemDirectoryEntry</code> 오브젝트를 수신합니다 .
ru: Метод, вызываемый после создания <a href="https://developer.mozilla.org/en-US/docs/Web/API/FileSystemDirectoryEntry"> <code>FileSystemDirectoryEntry</code> </a> . Метод получает единственный параметр: объект <code>FileSystemDirectoryEntry</code> , представляющий рассматриваемый каталог.
zh_cn: 创建<a href="https://developer.mozilla.org/en-US/docs/Web/API/FileSystemDirectoryEntry"> <code>FileSystemDirectoryEntry</code> 后</a>立即调用的方法。该方法接收单个参数：代表所讨论目录的 <code>FileSystemDirectoryEntry</code> 对象。

source: A method to be called once the <a href="https://developer.mozilla.org/en-US/docs/Web/API/FileSystemFileEntry"><code>FileSystemFileEntry</code></a> has been created. The method receives a single parameter: the <code>FileSystemFileEntry</code> object representing the file in question.
ja: <a href="https://developer.mozilla.org/en-US/docs/Web/API/FileSystemFileEntry"> <code>FileSystemFileEntry</code> </a>が作成されたときに呼び出されるメソッド。このメソッドは、単一のパラメーター、つまり問題のファイルを表す <code>FileSystemFileEntry</code> オブジェクトを受け取ります。
ko: <a href="https://developer.mozilla.org/en-US/docs/Web/API/FileSystemFileEntry"> <code>FileSystemFileEntry</code> </a> 가 작성 되면 호출 될 메소드 입니다. 이 메소드는 단일 파일, 즉 해당 파일을 나타내는 <code>FileSystemFileEntry</code> 객체를 받습니다 .
ru: Метод, вызываемый после создания <a href="https://developer.mozilla.org/en-US/docs/Web/API/FileSystemFileEntry"> <code>FileSystemFileEntry</code> </a> . Метод получает единственный параметр: объект <code>FileSystemFileEntry</code> , представляющий рассматриваемый файл.
zh_cn: 创建<a href="https://developer.mozilla.org/en-US/docs/Web/API/FileSystemFileEntry"> <code>FileSystemFileEntry</code> </a>后将调用的方法。该方法接收单个参数：代表所讨论文件的 <code>FileSystemFileEntry</code> 对象。

source: A method to request the deletion of a database.
ja: データベースの削除を要求する方法。
ko: 데이터베이스 삭제를 요청하는 방법입니다.
ru: Способ запроса на удаление базы данных.
zh_cn: 一种请求删除数据库的方法。
