Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/dom/dom.*.007.xlf
Languages: es, ko, ru, zh_cn

source: <code>{"name": "<a href="https://www.w3.org/TR/WebCryptoAPI/#dfn-AesCbcParams">AES-CBC</a>", iv}</code> where <code><em>iv</em></code> is a 16-byte <a href="../buffersource"><code>BufferSource</code></a> initialization vector (generated by <a href="https://developer.mozilla.org/en-US/docs/Web/API/Crypto/getRandomValues"><code>RandomSource.getRandomValues()</code></a>).
es: <code>{"name": "<a href="https://www.w3.org/TR/WebCryptoAPI/#dfn-AesCbcParams">AES-CBC</a>", iv}</code> donde <code><em>iv</em></code> es un vector de inicializaci&oacute;n <a href="../buffersource"> <code>BufferSource</code> de</a> 16 bytes (generado por <a href="https://developer.mozilla.org/en-US/docs/Web/API/Crypto/getRandomValues"> <code>RandomSource.getRandomValues()</code> </a> ).
ko: <code>{"name": "<a href="https://www.w3.org/TR/WebCryptoAPI/#dfn-AesCbcParams">AES-CBC</a>", iv}</code> 여기서 <code><em>iv</em></code> 는 16 바이트 <a href="../buffersource"> <code>BufferSource</code> </a> 초기화 벡터입니다 ( <a href="https://developer.mozilla.org/en-US/docs/Web/API/Crypto/getRandomValues"> <code>RandomSource.getRandomValues()</code> </a> 의해 생성됨 ).

source: <code>{"name": "<a href="https://www.w3.org/TR/WebCryptoAPI/#dfn-AesCbcParams">AES-CBC</a>", iv}</code> where <code><em>iv</em></code> is as supplied to <a href="encrypt"><code>SubtleCrypto.encrypt()</code></a>.
es: <code>{"name": "<a href="https://www.w3.org/TR/WebCryptoAPI/#dfn-AesCbcParams">AES-CBC</a>", iv}</code> donde <code><em>iv</em></code> es como se suministra a <a href="encrypt"> <code>SubtleCrypto.encrypt()</code> </a> .
ko: <code>{"name": "<a href="https://www.w3.org/TR/WebCryptoAPI/#dfn-AesCbcParams">AES-CBC</a>", iv}</code> 여기서 <code><em>iv</em></code> 는 <a href="encrypt"> <code>SubtleCrypto.encrypt()</code> </a> 제공됩니다 .

source: <code>{"name": "<a href="https://www.w3.org/TR/WebCryptoAPI/#dfn-AesCtrParams">AES-CTR</a>", counter, length}</code> where <code><em>counter</em></code> and <code><em>length</em></code> are as supplied to <a href="encrypt"><code>SubtleCrypto.encrypt()</code></a>.
es: <code>{"name": "<a href="https://www.w3.org/TR/WebCryptoAPI/#dfn-AesCtrParams">AES-CTR</a>", counter, length}</code> donde el <code><em>counter</em></code> y la <code><em>length</em></code> son como se proporcionan a <a href="encrypt"> <code>SubtleCrypto.encrypt()</code> </a> .
ko: <code>{"name": "<a href="https://www.w3.org/TR/WebCryptoAPI/#dfn-AesCtrParams">AES-CTR</a>", counter, length}</code> 여기서 <code><em>counter</em></code> 와 <code><em>length</em></code> 는 <a href="encrypt"> <code>SubtleCrypto.encrypt()</code> </a> 제공됩니다 .

source: <code>{"name": "<a href="https://www.w3.org/TR/WebCryptoAPI/#dfn-AesCtrParams">AES-CTR</a>", counter, length}</code> where <code><em>counter</em></code> is an initialised 16-byte <a href="../buffersource"><code>BufferSource</code></a> counter block, and <code><em>length</em></code> is the length (in bits) of the part of the counter block that is incremented.
es: <code>{"name": "<a href="https://www.w3.org/TR/WebCryptoAPI/#dfn-AesCtrParams">AES-CTR</a>", counter, length}</code> donde <code><em>counter</em></code> es un bloque de contador <a href="../buffersource"> <code>BufferSource</code> </a> inicializado de 16 bytes , y <code><em>length</em></code> es la longitud (en bits) de la parte del bloque de contador que se incrementa.
ko: <code>{"name": "<a href="https://www.w3.org/TR/WebCryptoAPI/#dfn-AesCtrParams">AES-CTR</a>", counter, length}</code> 여기서 <code><em>counter</em></code> 는 초기화 된 16 바이트 <a href="../buffersource"> <code>BufferSource</code> </a> 카운터 블록이고 <code><em>length</em></code> 는 카운터 블록 부분이 증가하는 부분의 길이 (비트)입니다.

source: <code>{"name": "<a href="https://www.w3.org/TR/WebCryptoAPI/#dfn-AesGcmParams">AES-GCM</a>", iv[, additionalData, tagLength]}</code> where <code><em>iv</em></code> is a <a href="../buffersource"><code>BufferSource</code></a> initialization vector up to 2⁶⁴&minus;1 bytes long; <code><em>additionalData</em></code> is a <a href="../buffersource"><code>BufferSource</code></a> authentication data and <code><em>tagLength</em></code> is the length of the authentication tag.
es: <code>{"name": "<a href="https://www.w3.org/TR/WebCryptoAPI/#dfn-AesGcmParams">AES-GCM</a>", iv[, additionalData, tagLength]}</code> donde <code><em>iv</em></code> es un vector de inicializaci&oacute;n de <a href="../buffersource"> <code>BufferSource</code> de</a> hasta 2⁶⁴ &minus; 1 bytes de longitud; <code><em>additionalData</em></code> es un <a href="../buffersource"> <code>BufferSource</code> </a> datos de autenticaci&oacute;n y <code><em>tagLength</em></code> es la longitud de la etiqueta de autenticaci&oacute;n.
ko: <code>{"name": "<a href="https://www.w3.org/TR/WebCryptoAPI/#dfn-AesGcmParams">AES-GCM</a>", iv[, additionalData, tagLength]}</code> 여기서 <code><em>iv</em></code> 는 최대 2⁶⁴-1 바이트 길이 의 <a href="../buffersource"> <code>BufferSource</code> </a> 초기화 벡터입니다. <code><em>additionalData</em></code> 는 <a href="../buffersource"> <code>BufferSource</code> </a> 인증 데이터이고 <code><em>tagLength</em></code> 는 인증 태그의 길이입니다.

source: <code>{"name": "<a href="https://www.w3.org/TR/WebCryptoAPI/#dfn-AesGcmParams">AES-GCM</a>", iv[, additionalData, tagLength]}</code> where <code><em>iv</em></code>, <code><em>additionalData</em></code>, <code><em>tagLength</em></code> are as supplied to <a href="encrypt"><code>SubtleCrypto.encrypt()</code></a>.
es: <code>{"name": "<a href="https://www.w3.org/TR/WebCryptoAPI/#dfn-AesGcmParams">AES-GCM</a>", iv[, additionalData, tagLength]}</code> donde <code><em>iv</em></code> , <code><em>additionalData</em></code> , <code><em>tagLength</em></code> son como se suministran a <a href="encrypt"> <code>SubtleCrypto.encrypt()</code> </a> .
ko: <code>{"name": "<a href="https://www.w3.org/TR/WebCryptoAPI/#dfn-AesGcmParams">AES-GCM</a>", iv[, additionalData, tagLength]}</code> 여기서 <code><em>iv</em></code> , <code><em>additionalData</em></code> , <code><em>tagLength</em></code> 는 <a href="encrypt"> <code>SubtleCrypto.encrypt()</code> </a> 제공됩니다 .

source: <code>{"name": "<a href="https://www.w3.org/TR/WebCryptoAPI/#dfn-RsaOaepParams">RSA-OAEP</a>"[, label]} where <em>label</em> is</code> as supplied to <a href="encrypt"><code>SubtleCrypto.encrypt()</code></a>.
es: <code>{"name": "<a href="https://www.w3.org/TR/WebCryptoAPI/#dfn-RsaOaepParams">RSA-OAEP</a>"[, label]} where <em>label</em> is</code> como se suministra a <a href="encrypt"> <code>SubtleCrypto.encrypt()</code> </a> .
ko: <code>{"name": "<a href="https://www.w3.org/TR/WebCryptoAPI/#dfn-RsaOaepParams">RSA-OAEP</a>"[, label]} where <em>label</em> is</code> <a href="encrypt"> <code>SubtleCrypto.encrypt()</code> </a> 제공됩니다 .

source: <code>{"name": "PBKDF2", salt, iterations, hash}</code> where <em><code>salt</code></em> is an <a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/ArrayBuffer"><code>ArrayBuffer</code></a> or an <a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/ArrayBufferView"><code>ArrayBufferView</code></a>, <em><code>iterations</code></em> is the number of iterations and <em><code>hash</code></em> is a <a href="../domstring"><code>DOMString</code></a> identifying the hashing algorithm to use.
es: <code>{"name": "PBKDF2", salt, iterations, hash}</code> donde <em> <code>salt</code> </em> es un <a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/ArrayBuffer"> <code>ArrayBuffer</code> </a> o un <a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/ArrayBufferView"> <code>ArrayBufferView</code> </a> , <em> <code>iterations</code> </em> es el n&uacute;mero de iteraciones y <em> <code>hash</code> </em> es un <a href="../domstring"> <code>DOMString</code> que</a> identifica el algoritmo de hash que se va a usar.
ko: <code>{"name": "PBKDF2", salt, iterations, hash}</code> 여기서 <em> <code>salt</code> </em> 는 <a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/ArrayBuffer"> <code>ArrayBuffer</code> </a> 또는 <a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/ArrayBufferView"> <code>ArrayBufferView</code> </a> 이며, <em> <code>iterations</code> </em> 는 반복 횟수이며 <em> <code>hash</code> </em> 는 사용할 해싱 알고리즘을 식별 하는 <a href="../domstring"> <code>DOMString</code> </a> 입니다.

source: <em>(the result should be in the same range of 1-7)</em>
es: <em>(el resultado debe estar en el mismo rango de 1-7)</em>
ko: <em>(결과는 1-7의 동일한 범위에 있어야 함)</em>

source: <em>+x or -x, where x is the number relative to the value of the <code><a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/basefont#attr-size">size</a></code> attribute of the <a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/basefont"><code>&lt;basefont&gt;</code></a> element</em>
es: <em>+ x o -x, donde x es el n&uacute;mero relativo al valor del atributo de <code><a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/basefont#attr-size">size</a></code> del elemento <a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/basefont"> <code>&lt;basefont&gt;</code> </a></em>
ko: <em>+ x 또는 -x. 여기서 x는 <a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/basefont"> <code>&lt;basefont&gt;</code> </a> 요소 의 <code><a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/basefont#attr-size">size</a></code> 속성 값에 상대적인 숫자 입니다.</em>

source: <em><a href="http://nightly.mozilla.org/">Nightly build</a></em>
es: <em><a href="http://nightly.mozilla.org/">Construcci&oacute;n nocturna</a></em>
ko: <em><a href="http://nightly.mozilla.org/">야간 빌드</a></em>

source: <em><code><a href="filelist"><code>FileList</code></a> array:</code></em><strong>Returns</strong> the list of selected files.
es: <em> <code><a href="filelist"><code>FileList</code></a> array:</code> </em><strong>devuelve</strong>la lista de archivos seleccionados.
ko: <em> <code><a href="filelist"><code>FileList</code></a> array:</code> </em>선택한 파일의 목록을<strong>반환</strong>합니다.

source: <em><code><a href="htmlelement"><code>HTMLElement</code></a> object:</code></em><strong>Returns</strong> the element pointed by the <code><a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/input#attr-list">list</a></code> attribute. The property may be <code>null</code> if no HTML element found in the same tree.
es: <em> <code><a href="htmlelement"><code>HTMLElement</code></a> object:</code> </em><strong>devuelve</strong>el elemento se&ntilde;alado por elatributo de <code><a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/input#attr-list">list</a></code> a. La propiedad puede ser <code>null</code> si no se encuentra ning&uacute;n elemento HTML en el mismo &aacute;rbol.
ko: <em> <code><a href="htmlelement"><code>HTMLElement</code></a> object:</code> </em> <code><a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/input#attr-list">list</a></code> 속성이가리키는 요소를<strong>반환</strong>합니다. 동일한 트리에서 HTML 요소를 찾지 못하면이 속성은 <code>null</code> 일수 있습니다.

source: <em><code><a href="htmlformelement"><code>HTMLFormElement</code></a> object:</code></em> Returns a reference to the parent form element.
es: <em> <code><a href="htmlformelement"><code>HTMLFormElement</code></a> object:</code> </em>devuelve una referencia al elemento de formulario primario.
ko: <em> <code><a href="htmlformelement"><code>HTMLFormElement</code></a> object:</code> </em>부모 폼 요소에 대한 참조를 반환합니다.

source: <em><code><a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Boolean"><code>Boolean</code></a>:</code></em><strong>Indicates</strong> whether the element is a candidate for constraint validation. It is false if any conditions bar it from constraint validation, including: its <code>type</code> is <code>hidden</code>, <code>reset</code>, or <code>button</code>; it has a <a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/datalist">datalist</a> ancestor; its <code>disabled</code> property is <code>true</code>.
es: <em> <code><a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Boolean"><code>Boolean</code></a>:</code> </em><strong>indica</strong>si el elemento es candidato para la validaci&oacute;n de restricciones. Es falso si alguna condici&oacute;n le impide la validaci&oacute;n de restricciones, incluyendo: su <code>type</code> est&aacute; <code>hidden</code> , <code>reset</code> o <code>button</code> ; tiene unancestro<a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/datalist">datalista</a>; supropiedad <code>disabled</code> es <code>true</code> .
ko: <em> <code><a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Boolean"><code>Boolean</code></a>:</code> </em>요소가 제약 조건 검증 후보인지 여부를<strong>나타냅니다</strong>. 다음을 포함하여 조건 검증에서 제약 조건이없는 조건은다음과 같습니다. <code>type</code> 이 <code>hidden</code> , <code>reset</code> 또는 <code>button</code> ; 여기에는<a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/datalist">데이터 목록</a>조상이 있습니다. 그 <code>disabled</code> 속성입니다 <code>true</code> .

source: <em><code>Clipboard</code> is based on the <a href="eventtarget"><code>EventTarget</code></a> interface, and includes its methods.</em>
es: <em> <code>Clipboard</code> se basa en la interfaz <a href="eventtarget"> <code>EventTarget</code> </a> e incluye sus m&eacute;todos.</em>
ko: <em> <code>Clipboard</code> 는 <a href="eventtarget"> <code>EventTarget</code> </a> 인터페이스를 기반으로 하며 해당 메소드를 포함합니다.</em>

source: <em><code>DOMPoint</code> inherits methods from its parent, <a href="dompointreadonly"><code>DOMPointReadOnly</code></a>.</em>
es: <em> <code>DOMPoint</code> hereda m&eacute;todos de su padre, <a href="dompointreadonly"> <code>DOMPointReadOnly</code> </a> .</em>
ko: <em> <code>DOMPoint</code> 는 상위 <a href="dompointreadonly"> <code>DOMPointReadOnly</code> </a> 에서 메소드를 상속합니다 .</em>

source: <em><code>DOMPoint</code> inherits properties from its parent, <a href="dompointreadonly"><code>DOMPointReadOnly</code></a>.</em>
es: <em> <code>DOMPoint</code> hereda las propiedades de su padre, <a href="dompointreadonly"> <code>DOMPointReadOnly</code> </a> .</em>
ko: <em> <code>DOMPoint</code> 는 부모 <a href="dompointreadonly"> <code>DOMPointReadOnly</code> </a> 에서 속성을 상속합니다 .</em>

source: <em><code>DOMRect</code> inherits methods from its parent, <a href="domrectreadonly"><code>DOMRectReadOnly</code></a>.</em>
es: <em> <code>DOMRect</code> hereda los m&eacute;todos de su padre, <a href="domrectreadonly"> <code>DOMRectReadOnly</code> </a> .</em>
ko: <em> <code>DOMRect</code> 는 상위 <a href="domrectreadonly"> <code>DOMRectReadOnly</code> </a> 에서 메소드를 상속합니다 .</em>

source: <em><code>DOMRect</code> inherits properties from its parent, <a href="domrectreadonly"><code>DOMRectReadOnly</code></a>. The difference is that they are not read-only anymore.</em>
es: <em> <code>DOMRect</code> hereda las propiedades de su padre, <a href="domrectreadonly"> <code>DOMRectReadOnly</code> </a> . La diferencia es que ya no son de solo lectura.</em>
ko: <em> <code>DOMRect</code> 는 상위 <a href="domrectreadonly"> <code>DOMRectReadOnly</code> </a> 에서 속성을 상속합니다 . 차이점은 더 이상 읽기 전용이 아니라는 것입니다.</em>

source: <em><code>RTCTrackEventInit</code> inherits properties from the <a href="https://developer.mozilla.org/en-US/docs/Web/API/EventInit"><code>EventInit</code></a> dictionary, and also includes the following properties:</em>
es: <em> <code>RTCTrackEventInit</code> hereda las propiedades del diccionario <a href="https://developer.mozilla.org/en-US/docs/Web/API/EventInit"> <code>EventInit</code> </a> y tambi&eacute;n incluye las siguientes propiedades:</em>
ko: <em> <code>RTCTrackEventInit</code> 는 <a href="https://developer.mozilla.org/en-US/docs/Web/API/EventInit"> <code>EventInit</code> </a> 사전 에서 특성을 상속 하며 다음 특성도 포함합니다.</em>

source: <em><code>SpeechRecognitionError</code> also inherits properties from its parent interface, <a href="event"><code>Event</code></a>.</em>
es: <em> <code>SpeechRecognitionError</code> tambi&eacute;n hereda propiedades de su interfaz principal, <a href="event"> <code>Event</code> </a> .</em>
ko: <em> <code>SpeechRecognitionError</code> 는 부모 인터페이스 인 <a href="event"> <code>Event</code> </a> 에서 속성을 상속합니다 .</em>

source: <em><code>SpeechRecognitionEvent</code> also inherits properties from its parent interface, <a href="event"><code>Event</code></a>.</em>
es: <em> <code>SpeechRecognitionEvent</code> tambi&eacute;n hereda propiedades de su interfaz principal, <a href="event"> <code>Event</code> </a> .</em>
ko: <em> <code>SpeechRecognitionEvent</code> 는 부모 인터페이스 인 <a href="event"> <code>Event</code> </a> 에서 속성을 상속합니다 .</em>

source: <em><code>SpeechSynthesis</code> also inherits methods from its parent interface, <a href="eventtarget"><code>EventTarget</code></a>.</em>
es: <em> <code>SpeechSynthesis</code> tambi&eacute;n hereda m&eacute;todos de su interfaz principal, <a href="eventtarget"> <code>EventTarget</code> </a> .</em>
ko: <em> <code>SpeechSynthesis</code> 는 부모 인터페이스 인 <a href="eventtarget"> <code>EventTarget</code> </a> 에서 메소드를 상속합니다 .</em>

source: <em><code>SpeechSynthesis</code> also inherits properties from its parent interface, <a href="eventtarget"><code>EventTarget</code></a>.</em>
es: <em> <code>SpeechSynthesis</code> tambi&eacute;n hereda propiedades de su interfaz principal, <a href="eventtarget"> <code>EventTarget</code> </a> .</em>
ko: <em> <code>SpeechSynthesis</code> 는 또한 부모 인터페이스 인 <a href="eventtarget"> <code>EventTarget</code> </a> 에서 속성을 상속합니다 .</em>

source: <em><code>SpeechSynthesisErrorEvent</code> extends the <a href="speechsynthesisevent"><code>SpeechSynthesisEvent</code></a> interface, which inherits methods from its parent interface, <a href="event"><code>Event</code></a>.</em>
es: <em> <code>SpeechSynthesisErrorEvent</code> extiende la interfaz <a href="speechsynthesisevent"> <code>SpeechSynthesisEvent</code> </a> , que hereda los m&eacute;todos de su interfaz principal, <a href="event"> <code>Event</code> </a> .</em>
ko: <em> <code>SpeechSynthesisErrorEvent</code> 는 <a href="speechsynthesisevent"> <code>SpeechSynthesisEvent</code> </a> 인터페이스를 확장하여 부모 인터페이스 인 <a href="event"> <code>Event</code> </a> 에서 메소드를 상속합니다 .</em>

source: <em><code>SpeechSynthesisErrorEvent</code> extends the <a href="speechsynthesisevent"><code>SpeechSynthesisEvent</code></a> interface, which inherits properties from its parent interface, <a href="event"><code>Event</code></a>.</em>
es: <em> <code>SpeechSynthesisErrorEvent</code> extiende la interfaz <a href="speechsynthesisevent"> <code>SpeechSynthesisEvent</code> </a> , que hereda las propiedades de su interfaz principal, <a href="event"> <code>Event</code> </a> .</em>
ko: <em> <code>SpeechSynthesisErrorEvent</code> 는 <a href="speechsynthesisevent"> <code>SpeechSynthesisEvent</code> </a> 인터페이스를 확장하여 부모 인터페이스 인 <a href="event"> <code>Event</code> </a> 에서 속성을 상속합니다 .</em>

source: <em><code>SpeechSynthesisUtterance</code> also inherits properties from its parent interface, <a href="eventtarget"><code>EventTarget</code></a>.</em>
es: <em> <code>SpeechSynthesisUtterance</code> tambi&eacute;n hereda propiedades de su interfaz principal, <a href="eventtarget"> <code>EventTarget</code> </a> .</em>
ko: <em> <code>SpeechSynthesisUtterance</code> 는 부모 인터페이스 인 <a href="eventtarget"> <code>EventTarget</code> </a> 에서 속성을 상속합니다 .</em>

source: <em><code>TrackEvent</code> has no methods of its own; however, it is based on <a href="event"><code>Event</code></a>, so it provides the methods available on <code>Event</code> objects.</em>
es: <em> <code>TrackEvent</code> no tiene m&eacute;todos propios; sin embargo, se basa en <a href="event"> <code>Event</code> </a> , por lo que proporciona los m&eacute;todos disponibles en los objetos de <code>Event</code> .</em>
ko: <em> <code>TrackEvent</code> 에는 자체 메서드가 없습니다. 그러나 <a href="event"> <code>Event</code> 를</a> 기반으로 하므로 <code>Event</code> 객체에서 사용할 수있는 메서드를 제공 합니다.</em>

source: <em><code>TrackEvent</code> is based on <a href="event"><code>Event</code></a>, so properties of <code>Event</code> are also available on <code>TrackEvent</code> objects.</em>
es: <em> <code>TrackEvent</code> se basa en <a href="event"> <code>Event</code> </a> , por lo que las propiedades de <code>Event</code> tambi&eacute;n est&aacute;n disponibles en los objetos <code>TrackEvent</code> .</em>
ko: <em> <code>TrackEvent</code> 는 <a href="event"> <code>Event</code> 를</a> 기반으로 하므로 <code>TrackEvent</code> 객체 에서도 <code>Event</code> 속성을 사용할 수 있습니다.</em>

source: <em><code>VRDisplayEvent</code> also inherits properties from its parent object, <a href="event"><code>Event</code></a>.</em>
es: <em> <code>VRDisplayEvent</code> tambi&eacute;n hereda propiedades de su objeto principal, <a href="event"> <code>Event</code> o</a> .</em>
ko: <em> <code>VRDisplayEvent</code> 는 또한 부모 객체 인 <a href="event"> <code>Event</code> </a> 에서 속성을 상속합니다 .</em>

source: <em><code>VisualViewport</code> also inherits properties from its parent, <a href="eventtarget"><code>EventTarget</code></a>.</em>
es: <em> <code>VisualViewport</code> tambi&eacute;n hereda propiedades de su padre, <a href="eventtarget"> <code>EventTarget</code> </a> .</em>
ko: <em> <code>VisualViewport</code> 는 또한 부모 인 <a href="eventtarget"> <code>EventTarget</code> </a> 에서 속성을 상속합니다 .</em>

source: <em><code>WindowClient</code> inherits methods from its parent interface, <a href="client"><code>Client</code></a>.</em>
es: <em> <code>WindowClient</code> hereda los m&eacute;todos de su interfaz principal, <a href="client"> <code>Client</code> </a> .</em>
ko: <em> <code>WindowClient</code> 는 상위 인터페이스 인 <a href="client"> <code>Client</code> </a> 에서 메소드를 상속합니다 .</em>

source: <em><code>WindowClient</code> inherits properties from its parent interface, <a href="client"><code>Client</code></a>.</em>
es: <em> <code>WindowClient</code> hereda propiedades de su interfaz principal, <a href="client"> <code>Client</code> e</a> .</em>
ko: <em> <code>WindowClient</code> 는 상위 인터페이스 인 <a href="client"> <code>Client</code> </a> 에서 속성을 상속합니다 .</em>

source: <em><code>algo</code></em> is a <a href="../domstring"><code>DOMString</code></a> defining the hash function to use. Supported values are: <code>SHA-1</code> (not supported by Microsoft Edge), <code>SHA-256</code>, <code>SHA-384</code>, and <code>SHA-512</code>.
es: <em> <code>algo</code> </em> es un<a href="../domstring"> <code>DOMString</code> que</a> define la funci&oacute;n hash a usar. Los valores admitidos son: <code>SHA-1</code> (no compatible con Microsoft Edge), <code>SHA-256</code> , <code>SHA-384</code> y <code>SHA-512</code> .
ko: <em> <code>algo</code> </em> 는사용할 해시 함수를 정의하는<a href="../domstring"> <code>DOMString</code> </a> 입니다. 지원되는 값은 <code>SHA-1</code> (Microsoft Edge에서 지원되지 않음), <code>SHA-256</code> , <code>SHA-384</code> 및 <code>SHA-512</code> 입니다.

source: <em><code>algo</code></em> is a <a href="../domstring"><code>DOMString</code></a> defining the signature function to use. Supported values are: <code>HMAC</code>, <code>RSASSA-PKCS1-v1_5</code>, and <code>ECDSA</code>.
es: <em> <code>algo</code> </em> es un<a href="../domstring"> <code>DOMString</code> que</a> define la funci&oacute;n de firma a utilizar. Los valores admitidos son: <code>HMAC</code> , <code>RSASSA-PKCS1-v1_5</code> y <code>ECDSA</code> .
ko: <em> <code>algo</code> </em> 는사용할 서명 함수를 정의하는<a href="../domstring"> <code>DOMString</code> </a> 입니다. 지원되는 값은 <code>HMAC</code> , <code>RSASSA-PKCS1-v1_5</code> 및 <code>ECDSA</code> 입니다.

source: <em><code>algo</code></em> is a dictionary object defining the algorithm that was used to generate the key being imported.
es: <em> <code>algo</code> </em> es un objeto de diccionario que define el algoritmo que se utiliz&oacute; para generar la clave que se importa.
ko: <em> <code>algo</code> </em> 는 가져올 키를 생성하는 데 사용 된 알고리즘을 정의하는 사전 객체입니다.
