Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/dom/dom.*.011.xlf
Languages: ja, ko, ru, zh_cn

source: A newly-created <a href="../paymentmethodchangeevent"><code>PaymentMethodChangeEvent</code></a> object describing a change to the options specified for the payment method given in the <code>methodName</code> property.
ja: <code>methodName</code> プロパティで指定された支払い方法に指定されたオプションの変更を説明する、新しく作成された<a href="../paymentmethodchangeevent"> <code>PaymentMethodChangeEvent</code> </a>オブジェクト。
ko: <code>methodName</code> 속성에 지정된 결제 방법에 지정된 옵션의 변경 사항을 설명하는 새로 만든 <a href="../paymentmethodchangeevent"> <code>PaymentMethodChangeEvent</code> </a> 객체 입니다.
ru: Вновь созданный объект <a href="../paymentmethodchangeevent"> <code>PaymentMethodChangeEvent</code> ,</a> описывающий изменение параметров, указанных для метода оплаты, указанного в свойстве <code>methodName</code> .
zh_cn: 新创建的<a href="../paymentmethodchangeevent"> <code>PaymentMethodChangeEvent</code> </a>对象，描述对 <code>methodName</code> 属性中给定的付款方法指定的选项的更改。

source: A newly-created <a href="../rtcdtmftonechangeevent"><code>RTCDTMFToneChangeEvent</code></a>, configured as specified in the provided options.
ja: 新しく作成された<a href="../rtcdtmftonechangeevent"> <code>RTCDTMFToneChangeEvent</code> </a>。提供されたオプションで指定されたとおりに構成されます。
ko: 제공된 옵션에 지정된대로 구성된 새로 작성된 <a href="../rtcdtmftonechangeevent"> <code>RTCDTMFToneChangeEvent</code> </a>
ru: Вновь созданный <a href="../rtcdtmftonechangeevent"> <code>RTCDTMFToneChangeEvent</code> </a> , настроенный в соответствии с указанными параметрами.
zh_cn: 新创建的<a href="../rtcdtmftonechangeevent"> <code>RTCDTMFToneChangeEvent</code> </a>，按照提供的选项中的指定进行配置。

source: A newly-created <a href="../rtcicecandidate"><code>RTCIceCandidate</code></a> object, optionally configured based on the specified object based on the <a href="../rtcicecandidateinit"><code>RTCIceCandidateInit</code></a> dictionary.
ja: 新しく作成された<a href="../rtcicecandidate"> <code>RTCIceCandidate</code> </a>オブジェクト。オプションで、<a href="../rtcicecandidateinit"> <code>RTCIceCandidateInit</code> </a>辞書に基づいて、指定されたオブジェクトに基づいて構成されます。
ko: <a href="../rtcicecandidateinit"> <code>RTCIceCandidateInit</code> </a> 사전을 기반으로 지정된 오브젝트를 기반으로 선택적으로 구성된 새로 작성된 <a href="../rtcicecandidate"> <code>RTCIceCandidate</code> </a> 오브젝트 .
ru: Вновь созданный объект <a href="../rtcicecandidate"> <code>RTCIceCandidate</code> </a> , дополнительно настраиваемый на основе указанного объекта на <a href="../rtcicecandidateinit"> <code>RTCIceCandidateInit</code> </a> словаря RTCIceCandidateInit .
zh_cn: 新建的<a href="../rtcicecandidate"> <code>RTCIceCandidate</code> </a>对象，可以选择根据基于<a href="../rtcicecandidateinit"> <code>RTCIceCandidateInit</code> </a>字典的指定对象进行配置。

source: A newly-created <a href="../rtcpeerconnection"><code>RTCPeerConnection</code></a> object, configured as described by <code>configuration</code>, if specified; otherwise, configured to appropriate basic defaults.
ja: 新しく作成された<a href="../rtcpeerconnection"> <code>RTCPeerConnection</code> </a>オブジェクト。指定されている場合は、 <code>configuration</code> の説明に従って構成されます。それ以外の場合は、適切な基本デフォルトに構成されます。
ko: 새롭게 작성된 <a href="../rtcpeerconnection"> <code>RTCPeerConnection</code> 의</a> 목적은, 같은 설명으로 구성한 <code>configuration</code> 지정된 경우; 그렇지 않으면 적절한 기본 기본값으로 구성됩니다.
ru: Вновь созданный объект <a href="../rtcpeerconnection"> <code>RTCPeerConnection</code> </a> , настроенный, как описано в <code>configuration</code> , если указан; в противном случае настраивается на соответствующие основные значения по умолчанию.
zh_cn: 一个新创建的<a href="../rtcpeerconnection"> <code>RTCPeerConnection</code> </a>对象，按 <code>configuration</code> 说明进行配置（如果已指定）；否则，配置为适当的基本默认值。

source: A newly-created <a href="../rtcpeerconnectioniceevent"><code>RTCPeerConnectionIceEvent</code></a>, configured as specified in the provided options.
ja: 新しく作成された<a href="../rtcpeerconnectioniceevent"> <code>RTCPeerConnectionIceEvent</code> </a>。提供されたオプションで指定されたとおりに構成されます。
ko: 제공된 옵션에 지정된대로 구성된 새로 작성된 <a href="../rtcpeerconnectioniceevent"> <code>RTCPeerConnectionIceEvent</code> </a>
ru: Вновь созданный <a href="../rtcpeerconnectioniceevent"> <code>RTCPeerConnectionIceEvent</code> </a> , настроенный в соответствии с указанными параметрами.
zh_cn: 新创建的<a href="../rtcpeerconnectioniceevent"> <code>RTCPeerConnectionIceEvent</code> </a>，按照提供的选项中的指定进行配置。

source: A newly-created <a href="../trackevent"><code>TrackEvent</code></a> object, initialized as described by the inputs to the constructor.
ja: コンストラクターへの入力によって記述された<a href="../trackevent"> <code>TrackEvent</code> </a>に初期化された、新しく作成されたTrackEventオブジェクト。
ko: 생성자에 대한 입력에 설명 된대로 새로 만든 <a href="../trackevent"> <code>TrackEvent</code> </a> 객체입니다.
ru: Вновь созданный объект <a href="../trackevent"> <code>TrackEvent</code> </a> , инициализированный, как описано входными данными для конструктора.
zh_cn: 新创建的<a href="../trackevent"> <code>TrackEvent</code> </a>对象，按照构造函数的输入所描述的进行初始化。

source: A non-empty <a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Array"><code>Array</code></a> of <a href="../mediakeysystemconfiguration"><code>MediaKeySystemConfiguration</code></a> objects. The first element with a satisfiable configuration will be used.
ja: 空でない<a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Array"> <code>Array</code> </a>の<a href="../mediakeysystemconfiguration"> <code>MediaKeySystemConfiguration</code> の</a>オブジェクト。満足できる構成の最初の要素が使用されます。
ko: 비어 있지 않은 <a href="../mediakeysystemconfiguration"> <code>MediaKeySystemConfiguration</code> </a> 객체의 <a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Array"> <code>Array</code> </a> 입니다 . 만족스러운 구성의 첫 번째 요소가 사용됩니다.
ru: Непустая <a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Array"> <code>Array</code> </a> из <a href="../mediakeysystemconfiguration"> <code>MediaKeySystemConfiguration</code> </a> объектов. Первый элемент с удовлетворительной конфигурацией будет использоваться.
zh_cn: 非空<a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Array"> <code>Array</code> </a>的<a href="../mediakeysystemconfiguration"> <code>MediaKeySystemConfiguration</code> </a>对象。将使用具有令人满意配置的第一个元素。

source: A non-live <a href="../nodelist"><code>NodeList</code></a> containing one <a href="../element"><code>Element</code></a> object for each descendant node that matches at least one of the specified selectors.
ja: 指定されたセレクターの少なくとも1つに一致する子孫ノードごとに1つの<a href="../element"> <code>Element</code> </a>オブジェクトを含む非<a href="../nodelist"> <code>NodeList</code> </a>。
ko: 지정된 선택기 중 하나 이상과 일치하는 각 하위 노드에 대해 하나의 <a href="../element"> <code>Element</code> </a> 객체를 포함 하는 비 실시간 <a href="../nodelist"> <code>NodeList</code> </a> 입니다.
ru: Не-живая <a href="../nodelist"> <code>NodeList</code> </a> , содержащая один <a href="../element"> <code>Element</code> </a> объекта для каждого потомка узла , который соответствует по меньшей мере одному из указанных селекторов.
zh_cn: 一种非活动的<a href="../nodelist"> <code>NodeList</code> </a>，其中的每个后代节点都包含一个<a href="../element"> <code>Element</code> </a>对象，该对象与至少一个指定选择器匹配。

source: A non-live <a href="../nodelist"><code>NodeList</code></a> containing one <a href="../element"><code>Element</code></a> object for each element that matches at least one of the specified selectors or an empty <a href="../nodelist"><code>NodeList</code></a> in case of no matches.
ja: 指定されたセレクターの少なくとも1つに一致する要素ごとに1つの<a href="../element"> <code>Element</code> </a>オブジェクトを含む非ライブの<a href="../nodelist"> <code>NodeList</code> </a>、または一致しない場合は空の<a href="../nodelist"> <code>NodeList</code> </a>。
ko: 지정된 선택기 중 하나 이상과 일치하는 각 요소에 대해 하나의 <a href="../element"> <code>Element</code> </a> 객체를 포함 하는 비 실시간 <a href="../nodelist"> <code>NodeList</code> </a> 또는 일치하지 않는 경우 빈 <a href="../nodelist"> <code>NodeList</code> </a> 입니다.
ru: Не-живая <a href="../nodelist"> <code>NodeList</code> </a> , содержащая один <a href="../element"> <code>Element</code> </a> объекта для каждого элемента , который соответствует по меньшей мере одному из указанных селекторов или пустой <a href="../nodelist"> <code>NodeList</code> </a> в случае каких - либо совпадений.
zh_cn: 非活动<a href="../nodelist"> <code>NodeList</code> </a>，对于每个与至少一个指定选择器匹配的元素，包含一个<a href="../element"> <code>Element</code> </a>对象；如果不匹配，则为空<a href="../nodelist"> <code>NodeList</code> </a>。

source: A non-negative <a href="../webgl_api/types"><code>Glsizei</code></a> specifying the height of the scissor box. Default value: height of the canvas.
ja: シザーボックスの高さを指定する負でない<a href="../webgl_api/types"> <code>Glsizei</code> </a>。デフォルト値：キャンバスの高さ。
ko: 가위 상자의 높이를 지정하는 음이 아닌 <a href="../webgl_api/types"> <code>Glsizei</code> </a> 입니다. 기본값 : 캔버스 높이
ru: Неотрицательное <a href="../webgl_api/types"> <code>Glsizei</code> </a> , задающее высоту коробки ножницеобразной. Значение по умолчанию: высота холста.
zh_cn: 一个非负的<a href="../webgl_api/types"> <code>Glsizei</code> ,</a>用于指定剪刀盒的高度。默认值：画布的高度。

source: A non-negative <a href="../webgl_api/types"><code>Glsizei</code></a> specifying the height of the viewport. Default value: height of the canvas.
ja: ビューポートの高さを指定する負でない<a href="../webgl_api/types"> <code>Glsizei</code> </a>。デフォルト値：キャンバスの高さ。
ko: 뷰포트의 높이를 지정하는 음이 아닌 <a href="../webgl_api/types"> <code>Glsizei</code> </a> 입니다. 기본값 : 캔버스 높이
ru: Неотрицательное <a href="../webgl_api/types"> <code>Glsizei</code> </a> , задающее высоту окна просмотра. Значение по умолчанию: высота холста.
zh_cn: 一个非负的<a href="../webgl_api/types"> <code>Glsizei</code> ,</a>用于指定视口的高度。默认值：画布的高度。

source: A non-negative <a href="../webgl_api/types"><code>Glsizei</code></a> specifying the width of the scissor box. Default value: width of the canvas.
ja: シザーボックスの幅を指定する負でない<a href="../webgl_api/types"> <code>Glsizei</code> </a>。デフォルト値：キャンバスの幅。
ko: 가위 상자의 너비를 지정하는 음이 아닌 <a href="../webgl_api/types"> <code>Glsizei</code> </a> 입니다. 기본값 : 캔버스 너비
ru: Неотрицательное <a href="../webgl_api/types"> <code>Glsizei</code> </a> с указанием ширины коробки ножницеобразной. Значение по умолчанию: ширина холста.
zh_cn: 一个非负的<a href="../webgl_api/types"> <code>Glsizei</code> ,</a>用于指定剪刀盒的宽度。默认值：画布的宽度。

source: A non-negative <a href="../webgl_api/types"><code>Glsizei</code></a> specifying the width of the viewport. Default value: width of the canvas.
ja: ビューポートの幅を指定する負でない<a href="../webgl_api/types"> <code>Glsizei</code> </a>。デフォルト値：キャンバスの幅。
ko: 뷰포트의 너비를 지정하는 음이 아닌 <a href="../webgl_api/types"> <code>Glsizei</code> </a> 입니다. 기본값 : 캔버스 너비
ru: Неотрицательное <a href="../webgl_api/types"> <code>Glsizei</code> </a> указав ширину окна просмотра. Значение по умолчанию: ширина холста.
zh_cn: 一个非负的<a href="../webgl_api/types"> <code>Glsizei</code> ,</a>用于指定视口的宽度。默认值：画布的宽度。

source: A non-negative float specifying the level of shadow blur, where <code>0</code> represents no blur and larger numbers represent increasingly more blur. This value doesn't correspond to a number of pixels, and is not affected by the current transformation matrix. The default value is <code>0</code>. Negative, <a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Infinity"><code>Infinity</code></a>, and <a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/NaN"><code>NaN</code></a> values are ignored.
ja: 影のぼかしのレベルを指定する負でない浮動小数点数 <code>0</code> はぼかしなしを表し、数値が大きいほどぼかしが大きくなることを表します。この値はピクセル数に対応しておらず、現在の変換行列の影響を受けません。デフォルト値は <code>0</code> です。負の値、<a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Infinity"> <code>Infinity</code> </a>、および<a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/NaN"> <code>NaN</code> </a>値は無視されます。
ko: <code>0</code> 이 흐림을 나타내지 않고 숫자가 클수록 점점 더 많은 흐림을 나타내는 그림자 흐림 수준을 지정하는 음이 아닌 부동 소수점 . 이 값은 여러 픽셀에 해당하지 않으며 현재 변환 매트릭스의 영향을받지 않습니다. 기본값은 <code>0</code> 입니다. 음수, <a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Infinity"> <code>Infinity</code> </a> 및 <a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/NaN"> <code>NaN</code> </a> 값은 무시됩니다.
ru: Неотрицательное значение с плавающей точкой, определяющее уровень размытия тени, где <code>0</code> означает отсутствие размытия, а большие числа представляют все большее размытие. Это значение не соответствует количеству пикселей и не зависит от текущей матрицы преобразования. Значением по умолчанию является <code>0</code> . Отрицательные значения, значения <a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Infinity"> <code>Infinity</code> </a> и <a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/NaN"> <code>NaN</code> </a> игнорируются.
zh_cn: 一个非负浮点数，指定阴影模糊的级别，其中 <code>0</code> 表示无模糊，数字越大表示模糊越多。该值不对应于多个像素，并且不受当前变换矩阵的影响。默认值为 <code>0</code> 。负数，<a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Infinity"> <code>Infinity</code> </a>和<a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/NaN"> <code>NaN</code> </a>值将被忽略。

source: A non-negative integer &mdash; this defines the total number of chunks that can be contained in the internal queue before backpressure is applied.
ja: 負でない整数&mdash;これは、バックプレッシャーが適用される前に内部キューに含めることができるチャンクの総数を定義します。
ko: 음이 아닌 정수-역압이 적용되기 전에 내부 대기열에 포함될 수있는 총 청크 수를 정의합니다.
ru: Неотрицательное целое число - оно определяет общее количество фрагментов, которые могут содержаться во внутренней очереди до применения противодавления.
zh_cn: 非负整数&mdash;定义在施加反压之前内部队列中可包含的块总数。

source: A non-negative number. If the value is set to less than 0, a <code>RangeError</code> is thrown.
ja: 負でない数。値が0未満に設定されている場合、 <code>RangeError</code> がスローされます。
ko: 음수가 아닌 숫자. 값이 0보다 작 으면 <code>RangeError</code> 가 발생합니다.
ru: Неотрицательное число. Если значение меньше 0, <code>RangeError</code> .
zh_cn: 非负数。如果该值设置为小于0，则引发 <code>RangeError</code> 。

source: A non-standard alias (from old versions of Microsoft Internet Explorer) for <a href="event/target"><code>Event.target</code></a>, which is starting to be supported in some other browsers for web compatibility purposes.
ja: <a href="event/target"> <code>Event.target</code> </a>の非標準のエイリアス（古いバージョンのMicrosoft Internet Explorerからの）。これは、Web互換性の目的で他の一部のブラウザーでサポートされ始めています。
ko: 웹 호환성을 위해 다른 브라우저에서 지원되기 시작하는 <a href="event/target"> <code>Event.target</code> </a> 에 대한 비표준 별칭 (이전 버전의 Microsoft Internet Explorer) .
ru: Нестандартный псевдоним (из старых версий Microsoft Internet Explorer) для <a href="event/target"> <code>Event.target</code> </a> , который начинает поддерживаться в некоторых других браузерах для целей веб-совместимости.
zh_cn: <a href="event/target"> <code>Event.target</code> </a>的非标准别名（来自Microsoft Internet Explorer的旧版本），出于Web兼容性目的，一些其他浏览器已开始支持该别名。

source: A note to contributors
ja: 投稿者への注意事項
ko: 기고자에게주는 메모
ru: Записка для вкладчиков
zh_cn: 给撰稿人的说明

source: A number
ja: 数
ko: 숫자
ru: Номер
zh_cn: 若干

source: A number (to be precise, an unsigned short).
ja: 数値(正確には符号なしのショート)。
ko: 숫자 (정확히 말하면 부호가없는 단락)
ru: Номер (если быть точным,неподписанный короткий).
zh_cn: 一个数字(准确地说,是一个无符号的短号)。

source: A number between 0.0 and 1.0 which indicates how much of the target element is actually visible within the root's intersection rectangle. More precisely, this value is the ratio of the area of the intersection rectangle (<a href="intersectionrect"><code>intersectionRect</code></a>) to the area of the target's bounds rectangle (<a href="boundingclientrect"><code>boundingClientRect</code></a>).
ja: 0.0と1.0の間の数値で、ルートの交差長方形内に実際に表示されるターゲット要素の量を示します。より正確には、この値は、ターゲットの境界の長方形の領域（<a href="boundingclientrect"> <code>boundingClientRect</code> </a>）に対する交差の長方形の領域（<a href="intersectionrect"> <code>intersectionRect</code> </a>）の比率です。
ko: 0.0과 1.0 사이의 숫자로, 루트의 교차 사각형 내에 실제로 표시되는 대상 요소의 양을 나타냅니다. 보다 정확하게는이 값은 대상 사각형 경계 영역 ( <a href="boundingclientrect"> <code>boundingClientRect</code> </a> ) 에 대한 교차 사각형 영역 ( <a href="intersectionrect"> <code>intersectionRect</code> </a> ) 의 비율입니다 .
ru: Число от 0,0 до 1,0, которое указывает, какая часть целевого элемента фактически видна в прямоугольнике пересечения корня. Точнее, это значение представляет собой отношение площади прямоугольника <a href="intersectionrect"> <code>intersectionRect</code> </a> ( intersectionRect ) к площади прямоугольника границ цели ( <a href="boundingclientrect"> <code>boundingClientRect</code> </a> ).
zh_cn: 0.0到1.0之间的数字表示在根的相交矩形内实际上可见多少目标元素。更准确地说，此值是相交矩形的面积（<a href="intersectionrect"> <code>intersectionRect</code> </a>）与目标边界矩形的面积（<a href="boundingclientrect"> <code>boundingClientRect</code> </a>）之比。

source: A number between <code>0.0</code> (fully transparent) and <code>1.0</code> (fully opaque), inclusive. The default value is <code>1.0</code>. Values outside that range, including <a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Infinity"><code>Infinity</code></a> and <a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/NaN"><code>NaN</code></a>, will not be set and <code>globalAlpha</code> will retain its previous value.
ja: <code>0.0</code> （完全に透明）から <code>1.0</code> （完全に不透明）までの数値。デフォルト値は <code>1.0</code> です。<a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Infinity"> <code>Infinity</code> </a>や<a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/NaN"> <code>NaN</code> </a>など、この範囲外の値は設定されず、 <code>globalAlpha</code> は以前の値を保持します。
ko: <code>0.0</code> (완전 투명)과 <code>1.0</code> (완전 불투명) 사이의 숫자 입니다. 기본값은 <code>1.0</code> 입니다. <a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Infinity"> <code>Infinity</code> </a> 및 <a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/NaN"> <code>NaN</code> 을</a> 포함하여 해당 범위 밖의 값 은 설정되지 않으며 <code>globalAlpha</code> 는 이전 값을 유지합니다.
ru: Число от <code>0.0</code> (полностью прозрачное) до <code>1.0</code> (полностью непрозрачное) включительно. Значением по умолчанию является <code>1.0</code> . Значения вне этого диапазона, включая <a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Infinity"> <code>Infinity</code> </a> и <a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/NaN"> <code>NaN</code> </a> , не будут установлены, и <code>globalAlpha</code> сохранит свое предыдущее значение.
zh_cn: 一个介于 <code>0.0</code> （完全透明）和 <code>1.0</code> （完全不透明）之间的数字（含）。默认值为 <code>1.0</code> 。超出该范围的值（包括<a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Infinity"> <code>Infinity</code> </a>和<a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/NaN"> <code>NaN</code> </a>）将不会设置， <code>globalAlpha</code> 将保留其先前的值。

source: A number between <code>0</code> and <code>1</code>, inclusive, representing the position of the color stop. <code>0</code> represents the start of the gradient and <code>1</code> represents the end; an <code>INDEX_SIZE_ERR</code> is raised if the number is outside that range.
ja: 間数 <code>0</code> と <code>1</code> 色ストップの位置を表す包括的、。 <code>0</code> はグラデーションの開始を表し、 <code>1</code> はグラデーションの終了を表します。数値がその範囲外の場合、 <code>INDEX_SIZE_ERR</code> が発生します。
ko: 색상 정지 점의 위치를 ​​나타내는 <code>0</code> 과 <code>1</code> 사이의 숫자 입니다. <code>0</code> 은 그라디언트의 시작을 나타내고 <code>1</code> 은 끝을 나타냅니다. <code>INDEX_SIZE_ERR</code> 는 숫자가 범위를 벗어난 경우에 발생한다.
ru: Число от <code>0</code> до <code>1</code> включительно, обозначающее положение цветовой остановки. <code>0</code> представляет начало градиента и <code>1</code> представляет конец; <code>INDEX_SIZE_ERR</code> повышается , если число находится за пределами этого диапазона.
zh_cn: <code>0</code> 到 <code>1</code> 之间（包括0和1）的数字，表示色标的位置。 <code>0</code> 代表渐变的起点， <code>1</code> 代表终点；一个 <code>INDEX_SIZE_ERR</code> 如果数目在该范围之外的上升。

source: A number betwen 0 and 1.
ja: 0と1の間の数字。
ko: 0과 1 사이의 숫자입니다.
ru: Номер по ставке 0 и 1.
zh_cn: 0和1之间的数字。

source: A number containing a 0-based index into the set of m-lines providing media descriptions, indicating which media source is associated with the candidate, or <code>null</code> if no such association is available.
ja: メディアの説明を提供する一連のm行への0ベースのインデックスを含む数値。候補に関連付けられているメディアソースを示します。そのような関連付けが利用できない場合は <code>null</code> です。
ko: 미디어 설명을 제공하는 m- 행 세트에 0 기반 색인을 포함하는 숫자로, 후보와 연관되는 매체 소스를 표시하거나 해당 연관이 <code>null</code> 경우 널 (NULL) 입니다.
ru: Число, содержащее индекс на основе 0 в наборе m-строк, предоставляющих описания мультимедиа, указывающие, какой источник мультимедиа связан с кандидатом, или <code>null</code> если такая связь не доступна.
zh_cn: 一个数字，在提供媒体描述的m行集合中包含从0开始的索引，指示哪个媒体源与候选者相关联；如果没有这样的关联，则为 <code>null</code> 。

source: A number equal to the number of CSS pixels from the left edge of the browser viewport to the left edge of the screen.
ja: ブラウザのビューポートの左端から画面の左端までのCSSピクセル数に等しい数。
ko: 브라우저 뷰포트의 왼쪽 가장자리에서 화면의 왼쪽 가장자리까지 CSS 픽셀 수와 같은 숫자입니다.
ru: Число,равное количеству CSS-пикселей от левого края вью-порта браузера до левого края экрана.
zh_cn: 相当于从浏览器视窗左边缘到屏幕左边缘的CSS像素数。

source: A number equal to the number of CSS pixels from the top edge of the browser viewport to the top edge of the screen.
ja: ブラウザのビューポートの上端から画面の上端までのCSSピクセル数に等しい数。
ko: 브라우저 뷰포트 상단 가장자리에서 화면 상단 가장자리까지의 CSS 픽셀 수와 같은 수입니다.
ru: Число,равное количеству CSS-пикселей от верхнего края вью-порта браузера до верхнего края экрана.
zh_cn: 相当于从浏览器视窗顶部边缘到屏幕顶部边缘的CSS像素数。

source: A number indicating how many audio tracks are included in the <code>AudioTrackList</code>. Each track can be accessed by treating the <code>AudioTrackList</code> as an array of objects of type <a href="../audiotrack"><code>AudioTrack</code></a>.
ja: <code>AudioTrackList</code> に含まれるオーディオトラックの数を示す数値。 <code>AudioTrackList</code> をタイプ<a href="../audiotrack"> <code>AudioTrack</code> </a>のオブジェクトの配列として扱うことにより、各トラックにアクセスできます。
ko: <code>AudioTrackList</code> 에 포함 된 오디오 트랙 수를 나타내는 숫자 입니다. <code>AudioTrackList</code> 를 <a href="../audiotrack"> <code>AudioTrack</code> </a> 유형의 객체 배열로 취급하여 각 트랙에 액세스 할 수 있습니다 .
ru: Число, указывающее, сколько звуковых дорожек включено в <code>AudioTrackList</code> . Доступ к каждой дорожке можно получить, обработав <code>AudioTrackList</code> как массив объектов типа <a href="../audiotrack"> <code>AudioTrack</code> </a> .
zh_cn: 一个数字，指示 <code>AudioTrackList</code> 中包含多少个音频轨道。通过将 <code>AudioTrackList</code> 视为<a href="../audiotrack"> <code>AudioTrack</code> </a>类型的对象数组，可以访问每个轨道。

source: A number indicating how many video tracks are included in the <code>VideoTrackList</code>. Each track can be accessed by treating the <code>VideoTrackList</code> as an array of objects of type <a href="../videotrack"><code>VideoTrack</code></a>.
ja: <code>VideoTrackList</code> に含まれるビデオトラックの数を示す数値。各トラックは、処理することによりアクセスすることができる <code>VideoTrackList</code> の型のオブジェクトの配列として<a href="../videotrack"> <code>VideoTrack</code> </a>。
ko: <code>VideoTrackList</code> 에 포함 된 비디오 트랙 수를 나타내는 숫자 입니다. <code>VideoTrackList</code> 를 <a href="../videotrack"> <code>VideoTrack</code> </a> 유형의 객체 배열로 취급하여 각 트랙에 액세스 할 수 있습니다 .
ru: Число, указывающее, сколько видео дорожек включено в <code>VideoTrackList</code> . Доступ к каждой дорожке можно получить, обработав <code>VideoTrackList</code> как массив объектов типа <a href="../videotrack"> <code>VideoTrack</code> </a> .
zh_cn: 一个数字，指示 <code>VideoTrackList</code> 中包含多少个视频轨道。通过将 <code>VideoTrackList</code> 视为<a href="../videotrack"> <code>VideoTrack</code> </a>类型的对象数组，可以访问每个轨道。

source: A number indicating the index of the currently selected track, if any, or <code>-1</code> otherwise.
ja: 現在選択されているトラックがある場合はそのインデックスを示す数値、そうでない場合は <code>-1</code> 。
ko: 현재 선택된 트랙의 색인을 나타내는 숫자 (있는 경우), 그렇지 않은 경우 <code>-1</code>
ru: Число, указывающее индекс текущей выбранной дорожки, если есть, или <code>-1</code> в противном случае.
zh_cn: 一个数字，指示当前所选轨道的索引（如果有），否则为 <code>-1</code> 。
