Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/dom/dom.*.011.xlf
Languages: ja, ko, ru, zh_cn

source: A key or <a href="../idbkeyrange"><code>IDBKeyRange</code></a> to be queried. If a single valid key is passed, this will default to a range containing only that key. If nothing is passed, this will default to a key range that selects all the records in this object store.
ja: 照会するキーまたは<a href="../idbkeyrange"> <code>IDBKeyRange</code> </a>。単一の有効なキーが渡される場合、これはデフォルトでそのキーのみを含む範囲になります。何も渡されない場合、これはデフォルトで、このオブジェクトストア内のすべてのレコードを選択するキー範囲になります。
ko: 쿼리 할 키 또는 <a href="../idbkeyrange"> <code>IDBKeyRange</code> </a>유효한 단일 키가 전달되면 기본적으로 해당 키만 포함 된 범위로 설정됩니다. 아무것도 전달되지 않으면 기본적으로이 오브젝트 저장소의 모든 레코드를 선택하는 키 범위가됩니다.
ru: Ключ или <a href="../idbkeyrange"> <code>IDBKeyRange</code> </a> для запроса . Если передан один действительный ключ, по умолчанию это будет диапазон, содержащий только этот ключ. Если ничего не передано, по умолчанию будет выбран диапазон ключей, который выбирает все записи в этом хранилище объектов.
zh_cn: 要查询的键或<a href="../idbkeyrange"> <code>IDBKeyRange</code> </a>。如果传递了一个有效密钥，则默认为仅包含该密钥的范围。如果未传递任何内容，则默认为键范围，该键范围选择此对象存储中的所有记录。

source: A key or <a href="../idbkeyrange"><code>IDBKeyRange</code></a> to be queried. If nothing is passed, this will default to a key range that selects all the records in this object store.
ja: 照会するキーまたは<a href="../idbkeyrange"> <code>IDBKeyRange</code> </a>。何も渡されない場合、これはデフォルトで、このオブジェクトストア内のすべてのレコードを選択するキー範囲になります。
ko: 쿼리 할 키 또는 <a href="../idbkeyrange"> <code>IDBKeyRange</code> </a>아무것도 전달되지 않으면 기본적으로이 오브젝트 저장소의 모든 레코드를 선택하는 키 범위가됩니다.
ru: Ключ или <a href="../idbkeyrange"> <code>IDBKeyRange</code> </a> для запроса . Если ничего не передано, по умолчанию будет выбран диапазон ключей, который выбирает все записи в этом хранилище объектов.
zh_cn: 要查询的键或<a href="../idbkeyrange"> <code>IDBKeyRange</code> </a>。如果未传递任何内容，则默认为键范围，该键范围选择此对象存储中的所有记录。

source: A key or <a href="../idbkeyrange"><code>IDBKeyRange</code></a> to use as the cursor's range. If nothing is passed, this will default to a key range that selects all the records in this object store.
ja: カーソルの範囲として使用するキーまたは<a href="../idbkeyrange"> <code>IDBKeyRange</code> </a>。何も渡されない場合、これはデフォルトで、このオブジェクトストア内のすべてのレコードを選択するキー範囲になります。
ko: 커서 범위로 사용할 키 또는 <a href="../idbkeyrange"> <code>IDBKeyRange</code> </a>아무것도 전달되지 않으면 기본적으로이 오브젝트 저장소의 모든 레코드를 선택하는 키 범위가됩니다.
ru: Ключ или <a href="../idbkeyrange"> <code>IDBKeyRange</code> </a> для использования в качестве диапазона курсора. Если ничего не передано, по умолчанию будет выбран диапазон ключей, который выбирает все записи в этом хранилище объектов.
zh_cn: 一个键或<a href="../idbkeyrange"> <code>IDBKeyRange</code> </a>用作光标的范围。如果未传递任何内容，则默认为键范围，该键范围选择此对象存储中的所有记录。

source: A key or an <a href="../idbkeyrange"><code>IDBKeyRange</code></a> identifying the keys to retrieve. If this value is null or missing, the browser will use an unbound key range.
ja: 取得するキーを識別するキーまたは<a href="../idbkeyrange"> <code>IDBKeyRange</code> </a>。この値がnullまたは欠落している場合、ブラウザーはバインドされていないキー範囲を使用します。
ko: 검색 할 키를 식별 하는 키 또는 <a href="../idbkeyrange"> <code>IDBKeyRange</code> </a>이 값이 null이거나 누락 된 경우 브라우저는 언 바운드 키 범위를 사용합니다.
ru: Ключ или <a href="../idbkeyrange"> <code>IDBKeyRange</code> ,</a> идентифицирующий ключи для извлечения. Если это значение равно нулю или отсутствует, браузер будет использовать диапазон несвязанных ключей.
zh_cn: 标识要检索的键的键或<a href="../idbkeyrange"> <code>IDBKeyRange</code> </a>。如果此值为null或缺失，则浏览器将使用未绑定的键范围。

source: A key or an <a href="../idbkeyrange"><code>IDBKeyRange</code></a> identifying the records to retrieve. If this value is null or missing, the browser will use an unbound key range.
ja: 取得するレコードを識別するキーまたは<a href="../idbkeyrange"> <code>IDBKeyRange</code> </a>。この値がnullまたは欠落している場合、ブラウザーはバインドされていないキー範囲を使用します。
ko: 검색 할 레코드를 식별 하는 키 또는 <a href="../idbkeyrange"> <code>IDBKeyRange</code> </a>이 값이 null이거나 누락 된 경우 브라우저는 언 바운드 키 범위를 사용합니다.
ru: Ключ или <a href="../idbkeyrange"> <code>IDBKeyRange</code> ,</a> идентифицирующий записи для извлечения. Если это значение равно нулю или отсутствует, браузер будет использовать диапазон несвязанных ключей.
zh_cn: 标识要检索的记录的键或<a href="../idbkeyrange"> <code>IDBKeyRange</code> </a>。如果此值为null或缺失，则浏览器将使用未绑定的键范围。

source: A key range can be a single value or a range with upper and lower bounds or endpoints. If the key range has both upper and lower bounds, then it is <em>bounded</em>; if it has no bounds, it is <em>unbounded</em>. A bounded key range can either be open (the endpoints are excluded) or closed (the endpoints are included). To retrieve all keys within a certain range, you can use the following code constructs:
ja: キー範囲は、単一の値、または上限と下限またはエンドポイントを持つ範囲にすることができます。キーの範囲に上限と下限の両方がある場合、それは<em>有界</em>です。それはとどまるところを持っていない場合、それは<em>無制限</em>。制限付きのキー範囲は、開いている（エンドポイントが除外されている）か閉じている（エンドポイントが含まれている）かのいずれかです。特定の範囲内のすべてのキーを取得するには、次のコード構成を使用できます。
ko: 키 범위는 단일 값이거나 상한 및 하한 또는 끝 점이있는 범위 일 수 있습니다. 키 범위에 상한과 하한이 모두 있으면 <em>제한됩니다</em> . 제한이 없으면 제한이 <em>없습니다</em> . 바운드 키 범위는 열거 나 (끝점 제외) 닫을 수 있습니다 (끝점 포함). 특정 범위 내의 모든 키를 검색하려면 다음 코드 구성을 사용할 수 있습니다.
ru: Ключевым диапазоном может быть одно значение или диапазон с верхними и нижними границами или конечными точками. Если диапазон клавиш имеет как верхнюю, так и нижнюю границы, то он <em>ограничен</em> ; если оно не имеет границ, оно не <em>ограничено</em> . Ограниченный диапазон клавиш может быть открытым (конечные точки исключены) или закрытым (конечные точки включены). Чтобы получить все ключи в определенном диапазоне, вы можете использовать следующие конструкции кода:
zh_cn: 键范围可以是单个值，也可以是具有上限和下限或端点的范围。如果键范围同时具有上限和下限，则它是<em>有界的</em>；如果没有边界，则它是<em>无界的</em>。有界键范围可以是打开的（不包括端点），也可以是闭合的（包括端点）。要检索特定范围内的所有键，可以使用以下代码构造：

source: A key that is stored as part of the stored value. It is found using a <em>key path</em>. An in-line key can be generated using a generator. After the key has been generated, it can then be stored in the value using the key path or it can also be used as a key.
ja: 格納された値の一部として格納されるキー。キーパスを使用して検出され<em>ます</em>。インラインキーは、ジェネレータを使用して生成できます。キーが生成されたら、キーパスを使用して値に格納するか、キーとして使用することもできます。
ko: 저장된 값의 일부로 저장된 키입니다. <em>키 경로를</em> 사용하여 찾을 수 있습니다. 인라인 키는 생성기를 사용하여 생성 할 수 있습니다. 키가 생성 된 후 키 경로를 사용하여 값에 저장되거나 키로 사용될 수도 있습니다.
ru: Ключ, который хранится как часть сохраненного значения. Это найдено с помощью <em>ключевого пути</em> . Встроенный ключ может быть сгенерирован с использованием генератора. После того, как ключ был сгенерирован, его можно сохранить в значении, используя путь ключа, или его также можно использовать в качестве ключа.
zh_cn: 作为存储值一部分存储的键。使用<em>密钥路径</em>找到它。可以使用生成器生成嵌入式密钥。生成密钥后，可以使用密钥路径将其存储在值中，也可以将其用作密钥。

source: A key that is stored separately from the value being stored.
ja: 保存されている値とは別に保存されているキー。
ko: 저장되는 값과 별도로 저장되는 키입니다.
ru: Ключ,который хранится отдельно от сохраняемого значения.
zh_cn: 与被存储的值分开存储的键。

source: A key to use for identifying the record.
ja: レコードを識別するために使用するキー。
ko: 레코드를 식별하는 데 사용하는 키입니다.
ru: Ключ для идентификации записи.
zh_cn: 用于识别记录的钥匙。

source: A keyframe object or <code>null</code>. If set to <code>null</code>, the keyframes are replaced with a sequence of empty keyframes.
ja: キーフレームオブジェクトまたは <code>null</code> 。 <code>null</code> に設定すると、キーフレームは空のキーフレームのシーケンスで置き換えられます。
ko: 키 프레임 객체 또는 <code>null</code> 입니다. <code>null</code> 로 설정 하면 키 프레임이 일련의 빈 키 프레임으로 바뀝니다.
ru: Объект ключевого кадра или <code>null</code> . Если установлено значение <code>null</code> , ключевые кадры заменяются последовательностью пустых ключевых кадров.
zh_cn: 关键帧对象或 <code>null</code> 。如果设置为 <code>null</code> ，则关键帧将替换为一系列空关键帧。

source: A legacy Boolean option which used to control whether or not to offer to the remote peer the opportunity to try to send audio. If this value is <code>false</code>, the remote peer will not be offered to send audio data, even if the local side will be sending audio data. If this value is <code>true</code>, the remote peer will be offered to send audio data, even if the local side will <em>not</em> be sending audio data. The default behavior is to offer to receive audio only if the local side is sending audio, not otherwise.
ja: 音声の送信を試みる機会をリモートピアに提供するかどうかを制御するために使用されていた従来のブールオプション。この値が <code>false</code> の場合、ローカル側がオーディオデータを送信する場合でも、リモートピアはオーディオデータの送信を提供されません。この値が <code>true</code> の場合、ローカル側がオーディオデータを送信し<em>ない</em>場合でも、リモートピアはオーディオデータを送信するように提案されます。デフォルトの動作では、ローカル側がオーディオを送信している場合にのみオーディオを受信し、それ以外の場合はオーディオを受信しません。
ko: 레거시 부울 옵션으로 원격 피어에 오디오를 보낼 수있는 기회를 제공할지 여부를 제어하는 ​​데 사용되었습니다. 이 값이 <code>false</code> 인 경우 로컬 측에서 오디오 데이터를 보내더라도 원격 피어는 오디오 데이터를 보내도록 제공되지 않습니다. 이 값이 경우 <code>true</code> , 원격 피어는 로컬 측이 경우에도, 오디오 데이터를 전송하기 위해 제공됩니다 <em>하지</em> 음성 데이터를 전송한다. 기본 동작은 로컬 측에서 오디오를 보내는 경우에만 오디오를 받도록 제안하는 것입니다.
ru: Устаревшая логическая опция, которая использовалась для контроля, предлагать или нет удаленному пиру возможность попытаться отправить аудио. Если это значение равно <code>false</code> , удаленному узлу не будет предложено отправить аудиоданные, даже если местная сторона будет отправлять аудиоданные. Если это значение равно <code>true</code> , удаленному узлу будет предложено отправить аудиоданные, даже если локальная сторона <em>не</em> будет отправлять аудиоданные. Поведение по умолчанию состоит в том, чтобы предлагать принимать аудио, только если локальная сторона отправляет аудио, а не иначе.
zh_cn: 旧版布尔选项，用于控制是否向远程对等方提供尝试发送音频的机会。如果此值为 <code>false</code> ，即使本地端将发送音频数据，也不会提供远程对等方发送音频数据。如果此值为 <code>true</code> ，则将向远程对等方发送音频数据，即使本地端<em>不会</em>发送音频数据也是如此。默认行为是仅在本地发送音频时才提供接收音频，否则不提供。

source: A legacy Boolean option which used to control whether or not to offer to the remote peer the opportunity to try to send video. If this value is <code>false</code>, the remote peer will not be offered to send video data, even if the local side will be sending video data. If this value is <code>true</code>, the remote peer will be offered to send video data, even if the local side will <em>not</em> be sending video data. The default behavior is to offer to receive video only if the local side is sending video, not otherwise.
ja: ビデオを送信しようとする機会をリモートピアに提供するかどうかを制御するために使用されていた従来のブールオプション。この値が <code>false</code> の場合、ローカル側がビデオデータを送信する場合でも、リモートピアはビデオデータの送信を提供されません。この値が <code>true</code> の場合、ローカル側がビデオデータを送信し<em>ない</em>場合でも、リモートピアはビデオデータを送信するように提案されます。デフォルトの動作では、ローカル側がビデオを送信している場合にのみビデオを受信するように提案し、そうでない場合は提供しません。
ko: 레거시 부울 옵션으로 원격 피어에 비디오를 보낼 수있는 기회를 제공할지 여부를 제어하는 ​​데 사용되었습니다. 이 값이 <code>false</code> 인 경우 로컬 측에서 비디오 데이터를 보내더라도 원격 피어는 비디오 데이터를 보내도록 제공되지 않습니다. 이 값이 경우 <code>true</code> , 원격 피어는 로컬 측이 경우에도, 비디오 데이터를 전송하기 위해 제공됩니다 <em>하지</em> 비디오 데이터를 전송한다. 기본 동작은 로컬 측에서 비디오를 보내는 경우에만 비디오를 받도록 제안하는 것입니다.
ru: Устаревшая логическая опция, которая использовалась для контроля того, предлагать или нет удаленному пиру возможность попробовать отправить видео. Если это значение равно <code>false</code> , удаленному узлу не будет предложено отправлять видеоданные, даже если местная сторона будет отправлять видеоданные. Если это значение равно <code>true</code> , удаленному узлу будет предложено отправить видеоданные, даже если местная сторона <em>не</em> будет отправлять видеоданные. Поведение по умолчанию - предлагать получать видео, только если местная сторона отправляет видео, а не иначе.
zh_cn: 传统的布尔选项，用于控制是否向远程对等方提供尝试发送视频的机会。如果该值为 <code>false</code> ，即使本地端将发送视频数据，也不会提供远程对等方发送视频数据。如果此值为 <code>true</code> ，则将向远程对等方发送视频数据，即使本地端<em>不会</em>发送视频数据也是如此。默认行为是仅在本地端正在发送视频时才提供接收视频，否则不提供。

source: A linear <code>CanvasGradient</code> initialized with the specified line.
ja: 指定された行で初期化された線形 <code>CanvasGradient</code> 。
ko: 지정된 줄로 초기화 된 선형 <code>CanvasGradient</code>
ru: Линейный <code>CanvasGradient</code> , инициализированный указанной строкой.
zh_cn: 使用指定的行初始化的线性 <code>CanvasGradient</code> 。

source: A link is established to the source at the new location.
ja: 新しい場所のソースにリンクが確立されています。
ko: 새 위치에서 소스에 대한 링크가 설정됩니다.
ru: На новом месте устанавливается ссылка на источник.
zh_cn: 在新的地点建立了与源头的链接。

source: A link may be established to the source at the new location.
ja: 新しい場所のソースへのリンクが確立されている場合があります。
ko: 새로운 위치에서 소스에 대한 링크가 설정 될 수 있습니다.
ru: Может быть установлена связь с источником на новом месте.
zh_cn: 可以在新的地点建立与源头的联系。

source: A link or move operation is permitted.
ja: リンクや移動操作を許可しています。
ko: 링크 또는 이동 조작이 허용됩니다.
ru: Допускается работа в режиме соединения или перемещения.
zh_cn: 允许进行链接或移动操作。

source: A list (array) of <a href="../speechsynthesisvoice"><code>SpeechSynthesisVoice</code></a> objects.
ja: <a href="../speechsynthesisvoice"> <code>SpeechSynthesisVoice</code> </a>オブジェクトのリスト（配列）。
ko: <a href="../speechsynthesisvoice"> <code>SpeechSynthesisVoice</code> </a> 객체 의 목록 (배열)입니다 .
ru: Список (массив) объектов <a href="../speechsynthesisvoice"> <code>SpeechSynthesisVoice</code> </a> .
zh_cn: <a href="../speechsynthesisvoice"> <code>SpeechSynthesisVoice</code> </a>对象的列表（数组）。

source: A list of <a href="../intersectionobserverentry"><code>IntersectionObserverEntry</code></a> objects, each representing one threshold which was crossed, either becoming more or less visible than the percentage specified by that threshold.
ja: 交差した1つのしきい値を表す<a href="../intersectionobserverentry"> <code>IntersectionObserverEntry</code> </a>オブジェクトのリスト。そのしきい値で指定されたパーセンテージよりも多少見えるようになります。
ko: <a href="../intersectionobserverentry"> <code>IntersectionObserverEntry</code> </a> 하나의 임계 값을 나타내는 IntersectionObserverEntry 오브젝트 목록으로 , 해당 임계 값으로 지정된 백분율보다 눈에 띄게 표시됩니다.
ru: Список объектов <a href="../intersectionobserverentry"> <code>IntersectionObserverEntry</code> </a> , каждый из которых представляет один порог, который был пройден, либо становится более или менее видимым, чем процент, указанный этим порогом.
zh_cn: <a href="../intersectionobserverentry"> <code>IntersectionObserverEntry</code> </a>对象的列表，每个对象代表一个阈值，该阈值已被超过，变得比该阈值指定的百分比或多或少可见。

source: A list of <a href="../mediastream"><code>MediaStream</code></a> objects to add to the transceiver's<a href="../rtcrtpreceiver"><code>RTCRtpReceiver</code></a>; when the remote peer's <a href="../rtcpeerconnection"><code>RTCPeerConnection</code></a>'s <code><a href="https://developer.mozilla.org/en-US/docs/Web/Events/track">track</a></code> event occurs, these are the streams that will be specified by that event.
ja: トランシーバーの<a href="../rtcrtpreceiver"> <code>RTCRtpReceiver</code> </a>に追加する<a href="../mediastream"> <code>MediaStream</code> </a>オブジェクトのリスト。リモートピアの<a href="../rtcpeerconnection"> <code>RTCPeerConnection</code> </a>の <code><a href="https://developer.mozilla.org/en-US/docs/Web/Events/track">track</a></code> イベントが発生すると、これらはそのイベントによって指定されるストリームになります。
ko: 트랜시버의 <a href="../rtcrtpreceiver"> <code>RTCRtpReceiver</code> </a> 에 추가 할 <a href="../mediastream"> <code>MediaStream</code> </a> 객체 의 목록 . 원격 피어의 <a href="../rtcpeerconnection"> <code>RTCPeerConnection</code> </a> 의 <code><a href="https://developer.mozilla.org/en-US/docs/Web/Events/track">track</a></code> 이벤트가 발생하면 해당 이벤트에 의해 지정되는 스트림입니다.
ru: Список объектов <a href="../mediastream"> <code>MediaStream</code> </a> для добавления в <a href="../rtcrtpreceiver"> <code>RTCRtpReceiver</code> </a> приемопередатчика ; когда удаленный компьютер в <a href="../rtcpeerconnection"> <code>RTCPeerConnection</code> </a> &laquo;s <code><a href="https://developer.mozilla.org/en-US/docs/Web/Events/track">track</a></code> происходит событие, эти потоки , которые будут указаны этим событием.
zh_cn: 要添加到收发器的<a href="../rtcrtpreceiver"> <code>RTCRtpReceiver</code> </a>的<a href="../mediastream"> <code>MediaStream</code> </a>对象的列表；当远程对等方的<a href="../rtcpeerconnection"> <code>RTCPeerConnection</code> </a>的 <code><a href="https://developer.mozilla.org/en-US/docs/Web/Events/track">track</a></code> 事件发生时，这些是将由该事件指定的流。

source: A list of <a href="../performanceentry"><code>PerformanceEntry</code></a> objects that have the specified <code>name</code> and <code>type</code>. If the <code>type</code> argument is not specified, only the <code>name</code> will be used to determine the entries to return. The items will be in chronological order based on the entries' <a href="../performanceentry/starttime"><code>startTime</code></a>. If no objects meet the specified criteria, an empty list is returned.
ja: 指定された <code>name</code> と <code>type</code> を持つ<a href="../performanceentry"> <code>PerformanceEntry</code> </a>オブジェクトのリスト。 <code>type</code> 引数が指定されていない場合は、 <code>name</code> だけが返されるエントリを決定するために使用されます。項目は、エントリの<a href="../performanceentry/starttime"> <code>startTime</code> に</a>基づいて時系列に並べられます。指定した条件を満たすオブジェクトがない場合は、空のリストが返されます。
ko: 지정된 <code>name</code> 과 <code>type</code> 을 가진 <a href="../performanceentry"> <code>PerformanceEntry</code> </a> 객체 의 목록입니다 . 는 IF <code>type</code> 인수를 지정하지 만 <code>name</code> 반환 할 항목을 결정하는 데 사용됩니다. 항목은 항목의 <a href="../performanceentry/starttime"> <code>startTime</code> </a> 에 따라 시간 순서대로 정렬 됩니다. 지정된 기준에 맞는 개체가 없으면 빈 목록이 반환됩니다.
ru: Список объектов <a href="../performanceentry"> <code>PerformanceEntry</code> </a> с указанным <code>name</code> и <code>type</code> . Если аргумент <code>type</code> не указан, только <code>name</code> будет использоваться для определения возвращаемых записей. Элементы будут в хронологическом порядке, основанном на элементах <a href="../performanceentry/starttime"> <code>startTime</code> </a> . Если ни один объект не соответствует указанным критериям, возвращается пустой список.
zh_cn: 具有指定 <code>name</code> 和 <code>type</code> 的<a href="../performanceentry"> <code>PerformanceEntry</code> </a>对象的列表。如果未指定 <code>type</code> 参数，则仅使用 <code>name</code> 来确定要返回的条目。这些项目将基于条目的<a href="../performanceentry/starttime"> <code>startTime</code> </a>按时间顺序排列。如果没有对象符合指定的条件，则返回一个空列表。

source: A list of <a href="../performanceentry"><code>PerformanceEntry</code></a> objects that have the specified <code>type</code>. The items will be in chronological order based on the entries' <a href="../performanceentry/starttime"><code>startTime</code></a>. If no objects have the specified <code>type</code>, or no argument is provided, an empty list is returned.
ja: 指定した <code>type</code> の<a href="../performanceentry"> <code>PerformanceEntry</code> </a>オブジェクトのリスト。項目は、エントリの<a href="../performanceentry/starttime"> <code>startTime</code> に</a>基づいて時系列に並べられます。指定された <code>type</code> オブジェクトがない場合、または引数が指定されていない場合は、空のリストが返されます。
ko: 지정된 <code>type</code> 을 가진 <a href="../performanceentry"> <code>PerformanceEntry</code> </a> 객체 의 목록입니다 . 항목은 항목의 <a href="../performanceentry/starttime"> <code>startTime</code> </a> 에 따라 시간 순서대로 정렬 됩니다. 지정된 <code>type</code> 을 가진 객체가 없거나 인수가 제공되지 않으면 빈 목록이 반환됩니다.
ru: Список объектов <a href="../performanceentry"> <code>PerformanceEntry</code> </a> , имеющих указанный <code>type</code> . Элементы будут в хронологическом порядке, основанном на элементах <a href="../performanceentry/starttime"> <code>startTime</code> </a> . Если ни один объект не имеет указанного <code>type</code> или аргумент не предоставлен, возвращается пустой список.
zh_cn: 具有指定 <code>type</code> 的<a href="../performanceentry"> <code>PerformanceEntry</code> </a>对象的列表。这些项目将基于条目的<a href="../performanceentry/starttime"> <code>startTime</code> </a>按时间顺序排列。如果没有对象具有指定的 <code>type</code> ，或者不提供任何参数，则返回一个空列表。

source: A list of <a href="../performanceentry"><code>PerformanceEntry</code></a> objects that meets the criteria of the filter. The items will be in chronological order based on the entries' <a href="../performanceentry/starttime"><code>startTime</code></a>. If no objects that meet the filter are found, an empty list is returned. If no argument is given, all entries are returned.
ja: フィルターの基準を満たす<a href="../performanceentry"> <code>PerformanceEntry</code> </a>オブジェクトのリスト。項目は、エントリの<a href="../performanceentry/starttime"> <code>startTime</code> に</a>基づいて時系列に並べられます。フィルターを満たすオブジェクトが見つからない場合、空のリストが返されます。引数を指定しない場合、すべてのエントリが返されます。
ko: 필터 기준을 충족하는 <a href="../performanceentry"> <code>PerformanceEntry</code> </a> 개체 목록입니다 . 항목은 항목의 <a href="../performanceentry/starttime"> <code>startTime</code> </a> 에 따라 시간 순서대로 정렬 됩니다. 필터를 충족하는 개체가 없으면 빈 목록이 반환됩니다. 인수가 제공되지 않으면 모든 항목이 리턴됩니다.
ru: Список объектов <a href="../performanceentry"> <code>PerformanceEntry</code> ,</a> который соответствует критериям фильтра. Элементы будут в хронологическом порядке, основанном на элементах <a href="../performanceentry/starttime"> <code>startTime</code> </a> . Если не найдено объектов, соответствующих фильтру, возвращается пустой список. Если аргумент не указан, возвращаются все записи.
zh_cn: 符合过滤条件的<a href="../performanceentry"> <code>PerformanceEntry</code> </a>对象的列表。这些项目将基于条目的<a href="../performanceentry/starttime"> <code>startTime</code> </a>按时间顺序排列。如果找不到符合过滤条件的对象，则返回一个空列表。如果未提供任何参数，则返回所有条目。

source: A list of <a href="../performanceentry"><code>PerformanceEntry</code></a> objects.
ja: <a href="../performanceentry"> <code>PerformanceEntry</code> </a>オブジェクトのリスト。
ko: <a href="../performanceentry"> <code>PerformanceEntry</code> </a> 객체 의 목록입니다 .
ru: Список объектов <a href="../performanceentry"> <code>PerformanceEntry</code> </a> .
zh_cn: <a href="../performanceentry"> <code>PerformanceEntry</code> </a>对象的列表。

source: A list of <a href="mediastream"><code>MediaStream</code></a> objects to add to the transceiver's<a href="rtcrtpreceiver"><code>RTCRtpReceiver</code></a>; when the remote peer's <a href="rtcpeerconnection"><code>RTCPeerConnection</code></a>'s <code><a href="https://developer.mozilla.org/en-US/docs/Web/Events/track">track</a></code> event occurs, these are the streams that will be specified by that event.
ja: トランシーバーの<a href="rtcrtpreceiver"> <code>RTCRtpReceiver</code> </a>に追加する<a href="mediastream"> <code>MediaStream</code> </a>オブジェクトのリスト。リモートピアの<a href="rtcpeerconnection"> <code>RTCPeerConnection</code> </a>の <code><a href="https://developer.mozilla.org/en-US/docs/Web/Events/track">track</a></code> イベントが発生すると、これらはそのイベントによって指定されるストリームになります。
ko: 트랜시버의 <a href="rtcrtpreceiver"> <code>RTCRtpReceiver</code> </a> 에 추가 할 <a href="mediastream"> <code>MediaStream</code> </a> 객체 의 목록 . 원격 피어의 <a href="rtcpeerconnection"> <code>RTCPeerConnection</code> </a> 의 <code><a href="https://developer.mozilla.org/en-US/docs/Web/Events/track">track</a></code> 이벤트가 발생하면 해당 이벤트에 의해 지정되는 스트림입니다.
ru: Список объектов <a href="mediastream"> <code>MediaStream</code> </a> для добавления в <a href="rtcrtpreceiver"> <code>RTCRtpReceiver</code> </a> приемопередатчика ; когда удаленный компьютер в <a href="rtcpeerconnection"> <code>RTCPeerConnection</code> </a> &laquo;s <code><a href="https://developer.mozilla.org/en-US/docs/Web/Events/track">track</a></code> происходит событие, эти потоки , которые будут указаны этим событием.
zh_cn: 要添加到收发器的<a href="rtcrtpreceiver"> <code>RTCRtpReceiver</code> </a>的<a href="mediastream"> <code>MediaStream</code> </a>对象的列表；当远程对等方的<a href="rtcpeerconnection"> <code>RTCPeerConnection</code> </a>的 <code><a href="https://developer.mozilla.org/en-US/docs/Web/Events/track">track</a></code> 事件发生时，这些是将由该事件指定的流。
