Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/dom/dom.*.011.xlf
Languages: ja, ko, ru, zh_cn

source: A string which specifies a set of offsets to add to the root's <a href="https://developer.mozilla.org/en-US/docs/Glossary/bounding_box">bounding_box</a> when calculating intersections, effectively shrinking or growing the root for calculation purposes. The syntax is approximately the same as that for the CSS <a href="https://developer.mozilla.org/en-US/docs/Web/CSS/margin"><code>margin</code></a> property; see <a href="../intersection_observer_api#The_root_element_and_root_margin">The root element and root margin</a> in <a href="../intersection_observer_api">Intersection Observer API</a> for more information on how the margin works and the syntax. The default is "0px 0px 0px 0px".
ja: 交差を計算するときにルートの<a href="https://developer.mozilla.org/en-US/docs/Glossary/bounding_box">bounding_box</a>に追加するオフセットのセットを指定する文字列。計算のためにルートを効果的に縮小または拡大します。構文は、CSS <a href="https://developer.mozilla.org/en-US/docs/Web/CSS/margin"> <code>margin</code> </a>プロパティの構文とほぼ同じです。マージンの仕組みと構文の詳細については、<a href="../intersection_observer_api">Intersection Observer API </a><a href="../intersection_observer_api#The_root_element_and_root_margin">のルート要素とルートマージン</a>を参照してください。デフォルトは「0px 0px 0px 0px」です。
ko: 교차점을 계산할 때 루트의 <a href="https://developer.mozilla.org/en-US/docs/Glossary/bounding_box">bounding_box</a> 에 추가 할 오프셋 세트를 지정하여 계산 목적으로 루트를 효과적으로 줄이거 나 늘리는 문자열입니다 . 구문은 CSS <a href="https://developer.mozilla.org/en-US/docs/Web/CSS/margin"> <code>margin</code> </a> 속성 과 거의 동일 합니다. 참조 <a href="../intersection_observer_api#The_root_element_and_root_margin">루트 요소 루트 마진</a> 의 <a href="../intersection_observer_api">교차로 관찰자 API를</a> 더 여유가 작동하는 방법에 대한 정보와 구문. 기본값은 "0px 0px 0px 0px"입니다.
ru: Строка, которая задает набор смещений, добавляемых к <a href="https://developer.mozilla.org/en-US/docs/Glossary/bounding_box">bounding_box</a> корня при расчете пересечений, эффективно сжимая или увеличивая корень для целей вычисления. Синтаксис примерно такой же, как и для свойства CSS <a href="https://developer.mozilla.org/en-US/docs/Web/CSS/margin"> <code>margin</code> </a> ; см <a href="../intersection_observer_api#The_root_element_and_root_margin">. Корневой элемент и корневое поле</a> в <a href="../intersection_observer_api">API Intersection Observer</a> для получения дополнительной информации о том, как работает поле и синтаксис. По умолчанию это &laquo;0px 0px 0px 0px&raquo;.
zh_cn: 一个字符串，它指定在计算相交时要添加到根的<a href="https://developer.mozilla.org/en-US/docs/Glossary/bounding_box">bounding_box的</a>一组偏移量，可以有效地缩小或增大根以进行计算。语法与CSS <a href="https://developer.mozilla.org/en-US/docs/Web/CSS/margin"> <code>margin</code> </a>属性的语法大致相同；看到<a href="../intersection_observer_api#The_root_element_and_root_margin">根元素和根缘</a>在<a href="../intersection_observer_api">路口观察API</a>用于在边际上如何工作的更多信息和语法。默认值为&ldquo; 0px 0px 0px 0px&rdquo;。

source: A string which specifies the shape of waveform to play; this can be one of a number of standard values, or <code>custom</code> to use a <a href="periodicwave"><code>PeriodicWave</code></a> to describe a custom waveform. Different waves will produce different tones. Standard values are <code>"sine"</code>, <code>"square"</code>, <code>"sawtooth"</code>, <code>"triangle"</code> and <code>"custom"</code>. The default is <code>"sine"</code>.
ja: 再生する波形の形状を指定する文字列。これは、いくつかの標準値の1つにすることも、<a href="periodicwave"> <code>PeriodicWave</code> </a>を使用してカスタム波形を記述する <code>custom</code> にすることもできます。異なる波は異なるトーンを生成します。標準値は <code>"sine"</code> 、 <code>"square"</code> 、 <code>"sawtooth"</code> 、 <code>"triangle"</code> および <code>"custom"</code> です。デフォルトは <code>"sine"</code> です。
ko: 재생할 파형의 모양을 지정하는 문자열입니다. 이 값은 표준의 숫자 또는 중 하나가 될 수 <code>custom</code> 용도하기 <a href="periodicwave"> <code>PeriodicWave</code> 를</a> 정의 파형을 설명하기. 다른 파도는 다른 톤을 생성합니다. 표준 값은 <code>"sine"</code> , <code>"square"</code> , <code>"sawtooth"</code> , <code>"triangle"</code> 및 <code>"custom"</code> 입니다. 기본값은 <code>"sine"</code> 입니다.
ru: Строка, которая определяет форму сигнала для воспроизведения; это может быть одно из нескольких стандартных значений или <code>custom</code> чтобы использовать <a href="periodicwave"> <code>PeriodicWave</code> </a> для описания пользовательского сигнала. Разные волны будут давать разные тоны. Стандартными значениями являются <code>"sine"</code> , <code>"square"</code> , <code>"sawtooth"</code> , <code>"triangle"</code> и <code>"custom"</code> . По умолчанию это <code>"sine"</code> .
zh_cn: 一个字符串，指定要播放的波形的形状；它可以是许多标准值之一，也可以是 <code>custom</code> 以使用<a href="periodicwave"> <code>PeriodicWave</code> </a>来描述自定义波形。不同的波浪会产生不同的音调。标准值为 <code>"sine"</code> ， <code>"square"</code> ， <code>"sawtooth"</code> ， <code>"triangle"</code> 和 <code>"custom"</code> 。默认值为 <code>"sine"</code> 。

source: A string which specifies the type of event for which to remove an event listener.
ja: イベントリスナーを削除するイベントの種類を指定する文字列。
ko: 이벤트 리스너를 제거 할 이벤트 유형을 지정하는 문자열.
ru: Строка,определяющая тип события,для которого следует удалить слушателя событий.
zh_cn: 一个字符串,指定要删除事件监听器的事件类型。

source: A string whose characters each represent a single byte of binary data to be encoded into ASCII.
ja: 文字列で、それぞれの文字が1バイトのバイナリデータを表し、ASCIIにエンコードされます。
ko: ASCII로 인코딩 할 이진 데이터의 단일 바이트를 각각 나타내는 문자를 갖는 문자열입니다.
ru: Строка,каждый из символов которой представляет собой один байт двоичных данных,кодируемых в ASCII.
zh_cn: 一个字符串,其每个字符代表一个要编码成ASCII的二进制数据的单字节。

source: A string without the question mark.
ja: クエスチョンマークのない文字列。
ko: 물음표가없는 문자열
ru: Строка без вопросительного знака.
zh_cn: 不带问号的字符串。

source: A string you want to display in the alert dialog, or, alternatively, an object that is converted into a string and displayed.
ja: アラートダイアログに表示したい文字列、または文字列に変換して表示するオブジェクト。
ko: 경고 대화 상자에 표시 할 문자열 또는 문자열로 변환되어 표시되는 객체입니다.
ru: Строка,которую вы хотите отобразить в диалоге оповещения,или,как альтернатива,объект,который преобразуется в строку и отображается.
zh_cn: 要在警报对话框中显示的字符串,或者,一个转换为字符串并显示的对象。

source: A string, containing the media type(MIME) indicating what type of the file is it for example "image/png" for PNG images
ja: メディアタイプ(MIME)を含む文字列で、ファイルのタイプを示します。
ko: 파일 형식을 나타내는 미디어 형식 (MIME)을 포함하는 문자열입니다 (예 : PNG 이미지의 경우 "image / png").
ru: Строка,содержащая тип носителя (MIME),указывающая,какой тип файла,например "image/png" для изображений PNG
zh_cn: 一个字符串,包含媒体类型(MIME),表示文件的类型,例如 "image/png "表示PNG图片。

source: A string, containing the name of the file without path, such as "My Resume.rtf".
ja: My Resume.rtf "のように、パスのないファイル名を含む文字列。
ko: "My Resume.rtf"와 같이 경로가없는 파일 이름이 포함 된 문자열
ru: Строка,содержащая имя файла без пути,например "My Resume.rtf".
zh_cn: 一个字符串,包含文件名,不含路径,如 "My Resume.rtf"。

source: A string, formatted similarly to the CSS <a href="https://developer.mozilla.org/en-US/docs/Web/CSS/margin"><code>margin</code></a> property's value, which contains offsets for one or more sides of the root's bounding box. These offsets are added to the corresponding values in the root's bounding box before the intersection between the resulting rectangle and the target element's bounds.
ja: ルートのバウンディングボックスの1つ以上のサイドのオフセットを含む、CSS <a href="https://developer.mozilla.org/en-US/docs/Web/CSS/margin"> <code>margin</code> </a>プロパティの値と同様にフォーマットされた文字列。これらのオフセットは、ルートのバウンディングボックスの対応する値に追加され、結果の四角形とターゲット要素の境界が交差する前に追加されます。
ko: CSS <a href="https://developer.mozilla.org/en-US/docs/Web/CSS/margin"> <code>margin</code> </a> 속성 값 과 비슷하게 형식이 지정된 문자열로, 루트 경계 상자의 하나 이상의면에 대한 오프셋이 포함되어 있습니다. 이 오프셋은 결과 사각형과 대상 요소의 경계가 교차하기 전에 루트 경계 상자의 해당 값에 추가됩니다.
ru: Строка, отформатированная аналогично значению свойства CSS <a href="https://developer.mozilla.org/en-US/docs/Web/CSS/margin"> <code>margin</code> </a> , которая содержит смещения для одной или нескольких сторон ограничительной рамки корня. Эти смещения добавляются к соответствующим значениям в ограничительной рамке корня до пересечения полученного прямоугольника и границ целевого элемента.
zh_cn: 字符串，其格式类似于CSS <a href="https://developer.mozilla.org/en-US/docs/Web/CSS/margin"> <code>margin</code> </a>属性的值，其中包含根边界框的一侧或多侧的偏移量。在生成的矩形和目标元素的边界之间相交之前，将这些偏移量添加到根的边界框中的相应值。

source: A string, representing the client type. The value can be one of
ja: クライアントの種類を表す文字列。値は以下のいずれかになります。
ko: 클라이언트 유형을 나타내는 문자열 값은 다음 중 하나 일 수 있습니다.
ru: Строка,представляющая тип клиента.Значение может быть одним из
zh_cn: 一个字符串,代表客户端类型。该值可以是以下类型之一

source: A string, taken from the enum type <code><a href="#RTCStatsType">RTCStatsType</a></code>,
ja: 列挙型 <code><a href="#RTCStatsType">RTCStatsType</a></code> から取得した文字列、
ko: 열거 형에서 가져온 문자열, <code><a href="#RTCStatsType">RTCStatsType</a></code> ,
ru: Строка, взятая из перечислимого типа <code><a href="#RTCStatsType">RTCStatsType</a></code> ,
zh_cn: 从枚举类型 <code><a href="#RTCStatsType">RTCStatsType</a></code> 中获取的字符串，

source: A string.
ja: 文字列です。
ko: 문자열
ru: Струна.
zh_cn: 一个字符串。

source: A structured clone.
ja: 構造化されたクローン。
ko: 구조화 된 클론.
ru: Структурированный клон.
zh_cn: 一个结构化的克隆。

source: A style declaration is reset by setting it to <code>null</code> or an empty string, e.g. <code>elt.style.color = null</code>.
ja: スタイル宣言は、それを <code>null</code> または空の文字列に設定することによってリセットされます（例： <code>elt.style.color = null</code> 。
ko: 스타일 선언은 <code>null</code> 또는 빈 문자열 (예 : <code>elt.style.color = null</code> 로 설정하여 재설정됩니다 .
ru: Заявление стиля сбрасывается, установив его на <code>null</code> или пустую строку, например , <code>elt.style.color = null</code> .
zh_cn: 通过将样式声明设置为 <code>null</code> 或空字符串来重置样式声明，例如 <code>elt.style.color = null</code> 。

source: A style sheet consists of <em><a href="cssrule">rules</a></em>, such as <em><a href="cssstylerule">style rules</a></em>("<code>h1,h2 { font-size: 16pt }"</code>), various <em>at-rules</em> (<code>@import</code>, <code>@media</code>, ...), etc. This interface lets you inspect and modify the list of rules in the stylesheet.
ja: スタイルシートで構成され<em><a href="cssrule">たルール</a></em>など、<em><a href="cssstylerule">スタイルルール</a></em>（「 <code>h1,h2 { font-size: 16pt }"</code> さまざまな）<em>AT-ルール</em>（ <code>@import</code> 、 <code>@media</code> 等、...）、このインタフェースを使用して、検査しますスタイルシートのルールのリストを変更します。
ko: 스타일 시트는 다음과 같이 구성 <em><a href="cssrule">규칙</a></em> 과 같은, <em><a href="cssstylerule">스타일 규칙</a></em> ( " <code>h1,h2 { font-size: 16pt }"</code> 다양한) <em>에서-규칙</em> ( <code>@import</code> 는 , <code>@media</code> 는 , ...) 등이 인터페이스는 할 수 있습니다 당신이 검사하고 스타일 시트에서 규칙 목록을 수정하십시오.
ru: <code>h1,h2 { font-size: 16pt }"</code> стилей состоит из <em><a href="cssrule">правил</a></em> , таких как <em><a href="cssstylerule">правила стиля</a></em> (&laquo; h1, h2 {font-size: 16pt}&raquo; ), различные <em>at-правила</em> ( <code>@import</code> , <code>@media</code> , ...) и т. Д. Этот интерфейс позволяет проверять и изменить список правил в таблице стилей.
zh_cn: 样式表包含<em><a href="cssrule">规则</a></em>，例如<em><a href="cssstylerule">样式规则</a></em>（&ldquo; <code>h1,h2 { font-size: 16pt }"</code> ），各种<em>规则</em>（@ <code>@import</code> ，@ <code>@media</code> ，...）等。此界面可让您检查和修改样式表中的规则列表。

source: A stylesheet is associated with at most one <a href="document"><code>Document</code></a>, which it applies to (unless <a href="stylesheet/disabled">disabled</a>). A list of <code>CSSStyleSheet</code> objects for a given document can be obtained using the <a href="documentorshadowroot/stylesheets"><code>document.styleSheets</code></a> property. A specific style sheet can also be accessed from its <em>owner</em> object (<code>Node</code> or <code>CSSImportRule</code>), if any.
ja: スタイルシートは最大で1つの<a href="document"> <code>Document</code> に</a>関連付けられており、それに適用されます（<a href="stylesheet/disabled">disabledを</a>除く）。特定のドキュメントの <code>CSSStyleSheet</code> オブジェクトのリストは、<a href="documentorshadowroot/stylesheets"> <code>document.styleSheets</code> </a>プロパティを使用して取得できます。特定のスタイルシートには、その<em>所有者</em>オブジェクト（ <code>Node</code> または <code>CSSImportRule</code> ）からアクセスすることもできます。
ko: 스타일 시트는 최대 하나 개와 연관된 <a href="document"> <code>Document</code> </a> 는 행 (않는 적용 <a href="stylesheet/disabled">중지</a> )한다. 주어진 문서에 대한 <code>CSSStyleSheet</code> 객체 의 목록은 <a href="documentorshadowroot/stylesheets"> <code>document.styleSheets</code> </a> 속성을 사용하여 얻을 수 있습니다 . <em>소유자</em> 객체 ( <code>Node</code> 또는 <code>CSSImportRule</code> ) 에서 특정 스타일 시트에 액세스 할 수도 있습니다 (있는 경우).
ru: Таблица стилей связана не более чем с одним <a href="document"> <code>Document</code> </a> , к которому она применяется (если не <a href="stylesheet/disabled">отключена</a> ). Список объектов <code>CSSStyleSheet</code> для данного документа можно получить с помощью свойства <a href="documentorshadowroot/stylesheets"> <code>document.styleSheets</code> </a> . К определенной <code>CSSImportRule</code> стилей также можно получить доступ из объекта- <em>владельца</em> ( <code>Node</code> или CSSImportRule ), если таковой имеется.
zh_cn: 样式表最多与一个<a href="document"> <code>Document</code> </a>相关联，该文档适用于（除非被<a href="stylesheet/disabled">禁用</a>）。可以使用<a href="documentorshadowroot/stylesheets"> <code>document.styleSheets</code> </a>属性获取给定文档的 <code>CSSStyleSheet</code> 对象列表。特定样式表也可以从其<em>所有者</em>对象（ <code>Node</code> 或 <code>CSSImportRule</code> ）进行访问（如果有）。<em></em>

source: A sublocality is an area within a city, such as a neighborhood, borough, or district. In the United Kingdom, this is used to indicate the <strong>post town</strong> in the United Kingdom (known officially by the Royal Mail as the <strong>dependent locality</strong>). This is a disambiguating feature of addresses in places where a city may have areas that duplicate street names.
ja: サブローカリティとは、近所、区、地区など、都市内のエリアです。イギリスでは、これはイギリスの<strong>郵便の町</strong>を示すために使用されます（Royal Mailにより、正式には<strong>依存地域</strong>として知られてい<strong>ます</strong>）。これは、都市に通りの名前と重複するエリアがある可能性がある場所の住所の明確な機能です。
ko: 하위 지역은 이웃, 자치구 또는 지역과 같은 도시 내의 지역입니다. 영국에서는 영국의 <strong>우체국</strong> 을 나타내는 데 사용됩니다 (공식적으로 Royal Mail에서 <strong>종속 지역</strong> 으로 알려짐 ). 이것은 도시에 거리 이름이 중복 된 영역이있을 수있는 주소의 명확한 특징입니다.
ru: Сублокация - это район города, например район, район или район. В Соединенном Королевстве это используется для указания <strong>почтового города</strong> в Соединенном Королевстве (официально известного Королевской почтой как <strong>зависимый населенный пункт</strong> ). Это неоднозначная особенность адресов в местах, где в городе могут быть области, дублирующие названия улиц.
zh_cn: 子区域是城市中的一个区域，例如邻里，自治市镇或地区。在英国，这用来表示英国的<strong>邮递镇</strong>（皇家邮政正式将其称为<strong>附属地区</strong>）。这是城市中可能具有重复街道名称的区域的地址的歧义功能。

source: A summary of the interfaces' implementation status is provided below, including a link to more detailed information.
ja: 以下に、より詳細な情報へのリンクを含め、インターフェースの実装状況の概要を示します。
ko: 더 자세한 정보에 대한 링크를 포함하여 인터페이스의 구현 상태에 대한 요약이 아래에 제공됩니다.
ru: Ниже приводится краткая информация о состоянии реализации интерфейсов,включая ссылку на более подробную информацию.
zh_cn: 下文提供了这些接口的实施状况摘要,包括一个链接,可链接到更详细的信息。

source: A supporting browser installed &mdash; the latest <a href="https://www.mozilla.org/en-US/firefox/channel/desktop/">Firefox Nightly</a> or <a href="https://www.google.com/chrome/index.html">Chrome</a> are your best options right now, on desktop or mobile.
ja: インストールされているサポートブラウザー&mdash;最新の<a href="https://www.mozilla.org/en-US/firefox/channel/desktop/">Firefox Nightly</a>または<a href="https://www.google.com/chrome/index.html">Chrome</a>が、デスクトップまたはモバイルでの現在の最良のオプションです。
ko: 지원되는 브라우저 설치 &ndash; 최신 <a href="https://www.mozilla.org/en-US/firefox/channel/desktop/">Firefox Nightly</a> 또는 <a href="https://www.google.com/chrome/index.html">Chrome</a> 이 데스크탑 또는 모바일에서 가장 적합한 옵션입니다.
ru: Установлен поддерживающий браузер - последние версии <a href="https://www.mozilla.org/en-US/firefox/channel/desktop/">Firefox Nightly</a> или <a href="https://www.google.com/chrome/index.html">Chrome</a> - ваши лучшие варианты прямо сейчас, на настольном компьютере или мобильном устройстве.
zh_cn: 已安装支持的浏览器- 在台式机或移动设备上，当前最好的选择是最新的<a href="https://www.mozilla.org/en-US/firefox/channel/desktop/">Firefox Nightly</a>或<a href="https://www.google.com/chrome/index.html">Chrome</a>。

source: A table with a caption. Although the table's border box doesn't include the caption, the client rects do include the caption.
ja: キャプション付きの表。表のボーダーボックスにはキャプションが含まれていませんが、クライアントの rects にはキャプションが含まれています。
ko: 캡션이있는 테이블. 테이블의 테두리 상자에는 캡션이 포함되어 있지 않지만 클라이언트 사각형에는 캡션이 포함됩니다.
ru: Стол с подписью.Хотя поле на границе таблицы не содержит подписи,записи клиента содержат подписи.
zh_cn: 一个带标题的表格。虽然该表的边框不包括标题,但客户端的rects却包括标题。

source: A table's <a href="../element/innerhtml"><code>innerHTML</code></a> property should never be used to modify a table, although you can use it to write an entire table or the content of a cell.
ja: テーブルの<a href="../element/innerhtml"> <code>innerHTML</code> </a>プロパティを使用してテーブルを変更することはできませんが、これを使用してテーブル全体またはセルのコンテンツを書き込むことができます。
ko: 테이블의 <a href="../element/innerhtml"> <code>innerHTML</code> </a> 속성을 사용하여 테이블을 수정해서는 안되지만 테이블을 사용하여 전체 테이블 또는 셀 내용을 쓸 수는 있습니다.
ru: Свойство <a href="../element/innerhtml"> <code>innerHTML</code> </a> таблицы никогда не должно использоваться для изменения таблицы, хотя вы можете использовать ее для записи всей таблицы или содержимого ячейки.
zh_cn: 尽管可以使用表的<a href="../element/innerhtml"> <code>innerHTML</code> </a>属性写入整个表或单元格的内容，但绝对不要使用该表的innerHTML属性来修改表。

source: A term commonly used in VR because it is a major handicap of using an HMD &mdash; we are constantly fooling the eye with what we are showing in the app canvas, and this leads to the eyes doing a lot more work than they normally would, so using VR apps for any extended period of time can lead to eye strain.
ja: VRで一般的に使用される用語です。HMDを使用することの大きなハンディキャップであるため、アプリのキャンバスに表示されているものを常にだましており、これにより、目が通常よりもはるかに多くの作業を行うようになります。 VRアプリを長時間使用すると、目の疲れを引き起こす可能性があります。
ko: VR에서 일반적으로 사용되는 용어는 HMD를 사용하는 주요 핸디캡이기 때문입니다. 우리는 앱 캔버스에 표시되는 내용으로 끊임없이 눈을 속이고 있습니다. 장시간 VR 앱을 사용하면 눈이 피로해질 수 있습니다.
ru: Этот термин обычно используется в виртуальной реальности, потому что это основной недостаток использования HMD - мы постоянно дурачим глаза тем, что показываем на холсте приложения, и это приводит к тому, что глаза выполняют гораздо больше работы, чем обычно, поэтому использование приложений VR в течение любого длительного периода времени может привести к усталости глаз.
zh_cn: VR中常用的术语，因为它是使用HMD的主要障碍-我们一直在愚弄我们在应用程序画布中显示的内容，这导致眼睛比平时做更多的工作，因此长时间使用VR应用程序可能会导致眼睛疲劳。

source: A text label for accessibility tools to use as a description of the region, if there is no control. Defaults to <code>null</code>.
ja: コントロールがない場合に、領域の説明として使用するユーザー補助ツールのテキストラベル。デフォルトは <code>null</code> です。
ko: 컨트롤이없는 경우 지역에 대한 설명으로 사용할 접근성 도구의 텍스트 레이블입니다. 기본값은 <code>null</code> 입니다.
ru: Текстовая метка для инструментов доступности, используемая в качестве описания региона, если контроль отсутствует. По умолчанию равно <code>null</code> .
zh_cn: 可访问性工具的文本标签，如果没有控件，则用作区域描述。默认为 <code>null</code> 。

source: A text string that indicates the format of the attStmt. The <a href="https://www.w3.org/TR/webauthn/#defined-attestation-formats">WebAuthn specification defines a number of formats</a>; however, formats may also be defined in other specifications and registered in an <a href="https://www.w3.org/TR/webauthn/#sctn-att-fmt-reg">IANA registry</a>. Formats defined by WebAuthn are: "packed", "tpm", "android-key", "android-safetynet", "fido-u2f", and "none".
ja: attStmtの形式を示すテキスト文字列。<a href="https://www.w3.org/TR/webauthn/#defined-attestation-formats">WebAuthn仕様はフォーマットの数を定義します</a>。ただし、形式は他の仕様で定義され、<a href="https://www.w3.org/TR/webauthn/#sctn-att-fmt-reg">IANAレジストリに</a>登録される場合もあります。WebAuthnで定義されている形式は、「packed」、「tpm」、「android-key」、「android-safetynet」、「fido-u2f」、「none」です。
ko: attStmt의 형식을 나타내는 텍스트 문자열입니다. <a href="https://www.w3.org/TR/webauthn/#defined-attestation-formats">WebAuthn 사양은 형식의 수를 정의</a> ; 그러나 형식은 다른 사양으로 정의되어 <a href="https://www.w3.org/TR/webauthn/#sctn-att-fmt-reg">IANA 레지스트리에</a> 등록 될 수도 있습니다 . WebAuthn에 의해 정의 된 형식은 "packed", "tpm", "android-key", "android-safetynet", "fido-u2f"및 "none"입니다.
ru: Текстовая строка, которая указывает формат attStmt. Спецификация <a href="https://www.w3.org/TR/webauthn/#defined-attestation-formats">WebAuthn определяет несколько форматов</a> ; однако форматы также могут быть определены в других спецификациях и зарегистрированы в реестре <a href="https://www.w3.org/TR/webauthn/#sctn-att-fmt-reg">IANA</a> . Форматы, определенные WebAuthn: &laquo;упакованный&raquo;, &laquo;tpm&raquo;, &laquo;ключ-android&raquo;, &laquo;android-safetynet&raquo;, &laquo;fido-u2f&raquo; и &laquo;none&raquo;.
zh_cn: 一个文本字符串，指示attStmt的格式。所述<a href="https://www.w3.org/TR/webauthn/#defined-attestation-formats">WebAuthn规范定义了多种格式</a> ; 但是，格式也可以在其他规范中定义，并在<a href="https://www.w3.org/TR/webauthn/#sctn-att-fmt-reg">IANA注册中心中注册</a>。WebAuthn定义的格式为：&ldquo;打包&rdquo;，&ldquo; tpm&rdquo;，&ldquo; android-key&rdquo;，&ldquo; android-safetynet&rdquo;，&ldquo; fido-u2f&rdquo;和&ldquo; none&rdquo;。

source: A text string. The string is added to the buffer in UTF-8 format, and the value of <code>bufferedAmount</code> is increased by the number of bytes required to represent the UTF-8 string.
ja: テキスト文字列。文字列はバッファにUTF-8形式で追加され、 <code>bufferedAmount</code> の値は、UTF-8文字列を表すために必要なバイト数だけ増加します。
ko: 텍스트 문자열 문자열이 UTF-8 형식으로 버퍼에 추가되고 <code>bufferedAmount</code> 값이 UTF-8 문자열을 나타내는 데 필요한 바이트 수만큼 증가합니다.
ru: Текстовая строка. Строка добавляется в буфер в формате UTF-8, а значение <code>bufferedAmount</code> увеличивается на количество байтов, необходимое для представления строки UTF-8.
zh_cn: 文本字符串。该字符串以UTF-8格式添加到缓冲区中，并且 <code>bufferedAmount</code> 的值增加了代表UTF-8字符串所需的字节数。

source: A textBaseline example
ja: textBaseline の例
ko: textBaseline 예제
ru: Пример текстовой базы
zh_cn: 一个textBaseline的例子

source: A texture unit.
ja: テクスチャユニット。
ko: 텍스처 유닛.
ru: Текстура.
zh_cn: 一个纹理单元。

source: A three dimensional point is defined in a typical Cartesian coordinate system. The added 4th dimension changes this point into a homogeneous coordinate. It still represents a point in 3D space and it can easily be demonstrated how to construct this type of coordinate through a pair of simple functions.
ja: 3次元の点は、典型的なデカルト座標系で定義されています。4次元を追加すると、この点は均質な座標に変化します。これでも3次元空間上の点を表しているので、簡単な関数のペアを使ってこのような座標系を構築する方法を簡単に示すことができます。
ko: 3 차원 점은 일반적인 직교 좌표계에서 정의됩니다. 추가 된 4 차원은이 점을 동종 좌표로 변경합니다. 여전히 3D 공간의 점을 나타내며 간단한 함수 쌍을 통해 이러한 유형의 좌표를 구성하는 방법을 쉽게 보여줄 수 있습니다.
ru: Трехмерная точка определяется в типичной декартовой системе координат.Добавленное 4-е измерение превращает эту точку в однородную координату.Она все еще представляет точку в 3D пространстве,и можно легко продемонстрировать,как построить этот тип координат с помощью пары простых функций.
zh_cn: 在典型的笛卡尔坐标系中定义了一个三维点。增加的第4维使这个点变成了一个同质坐标。它仍然代表三维空间中的一个点,可以很容易地演示如何通过一对简单的函数来构造这种类型的坐标。

source: A threshold of 1.0 means that when 100% of the target is visible within the element specified by the <code>root</code> option, the callback is invoked.
ja: しきい値が1.0の場合、ターゲットの100％が <code>root</code> オプションで指定された要素内に表示されると、コールバックが呼び出されます。
ko: 임계 값 1.0은 <code>root</code> 옵션으로 지정된 요소 내에서 대상의 100 %가 표시 되면 콜백이 호출 됨을 의미합니다 .
ru: Порог 1,0 означает, что когда 100% цели видно в элементе, указанном в <code>root</code> параметре, вызывается обратный вызов.
zh_cn: 阈值1.0表示在 <code>root</code> 选项指定的元素中可见目标的100％时，将调用回调。

source: A total amount for the payment request that overrides value in details.total. This is typically used when <code>details.modifiers.additionalItems</code> adds a discount or a surchase to the request.
ja: details.totalの値をオーバーライドする支払い要求の合計金額。これは通常、 <code>details.modifiers.additionalItems</code> が割引または割引をリクエストに追加するときに使用されます。
ko: details.total의 값을 대체하는 지불 요청의 총액입니다. 이것은 <code>details.modifiers.additionalItems</code> 가 요청에 할인 또는 추가를 추가 할 때 일반적으로 사용됩니다 .
ru: Общая сумма для запроса платежа, которая переопределяет значение в details.total. Обычно это используется, когда <code>details.modifiers.additionalItems</code> добавляет скидку или дополнительную плату к запросу.
zh_cn: 付款请求的总金额超过details.total中的值。当 <code>details.modifiers.additionalItems</code> 向请求添加折扣或购买时，通常使用此方法。

source: A touch of CSS
ja: CSSのタッチ
ko: CSS의 터치
ru: Немного CSS
zh_cn: 触摸CSS
