Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/dom/dom.*.011.xlf
Languages: ja, ko, ru, zh_cn

source: Added of <code>VALIDATION_ERR</code> and <code>TYPE_MISMATCH_ERR</code>.
ja: <code>VALIDATION_ERR</code> および <code>TYPE_MISMATCH_ERR</code> が追加されました。
ko: <code>VALIDATION_ERR</code> 및 <code>TYPE_MISMATCH_ERR</code> 추가되었습니다 .
ru: Добавлено в <code>VALIDATION_ERR</code> и <code>TYPE_MISMATCH_ERR</code> .
zh_cn: 添加了 <code>VALIDATION_ERR</code> 和 <code>TYPE_MISMATCH_ERR</code> 。

source: Added the <code>Text()</code> constructor.
ja: <code>Text()</code> コンストラクタが追加されました。
ko: <code>Text()</code> 생성자를 추가했습니다 .
ru: Добавлен конструктор <code>Text()</code> .
zh_cn: 添加了 <code>Text()</code> 构造函数。

source: Added the <code>UIEvent()</code> constructor, deprecated the <code>initUIEvent()</code> method and changed the type of <code>view</code> from <code>AbstractView</code> to <code>WindowProxy</code>.
ja: 添加し <code>UIEvent()</code> コンストラクタを、非推奨 <code>initUIEvent()</code> メソッドおよびタイプ変更 <code>view</code> から <code>AbstractView</code> に <code>WindowProxy</code> 。
ko: 추가 <code>UIEvent()</code> 생성자, 중단 된 <code>initUIEvent()</code> 메소드와 유형 변경 <code>view</code> 에서 <code>AbstractView</code> 로 <code>WindowProxy</code> .
ru: Добавлен конструктор <code>UIEvent()</code> , устарел метод <code>initUIEvent()</code> и изменен тип <code>view</code> с <code>AbstractView</code> на <code>WindowProxy</code> .
zh_cn: 添加了 <code>UIEvent()</code> 构造函数，弃用了 <code>initUIEvent()</code> 方法，并将 <code>view</code> 类型从 <code>AbstractView</code> 更改为 <code>WindowProxy</code> 。

source: Added the <code>appCodeName</code> property and the <code>taintEnabled()</code> method, for compatibility purpose.
ja: 互換性のために、 <code>appCodeName</code> プロパティと <code>taintEnabled()</code> メソッドを追加しました。
ko: 호환성을 위해 <code>appCodeName</code> 속성과 <code>taintEnabled()</code> 메서드를 추가했습니다 .
ru: Для совместимости добавлено свойство <code>appCodeName</code> и метод <code>taintEnabled()</code> .
zh_cn: 添加了 <code>appCodeName</code> 属性和 <code>taintEnabled()</code> 方法，以实现兼容性。

source: Added the <code>assignedSlot</code> property.
ja: <code>assignedSlot</code> プロパティが追加されました。
ko: <code>assignedSlot</code> 속성을 추가 했습니다.
ru: Добавлено свойство <code>assignedSlot</code> слот.
zh_cn: 添加了 <code>assignedSlot</code> 属性。

source: Added the <code>createDocument()</code> and <code>createDocumentType()</code> methods.
ja: <code>createDocument()</code> および <code>createDocumentType()</code> メソッドが追加されました。
ko: 추가 <code>createDocument()</code> 및 <code>createDocumentType()</code> 메소드.
ru: Добавлены <code>createDocument()</code> и <code>createDocumentType()</code> .
zh_cn: 添加了 <code>createDocument()</code> 和 <code>createDocumentType()</code> 方法。

source: Added the <code>createHTMLDocument()</code> method.
ja: <code>createHTMLDocument()</code> メソッドを追加しました。
ko: <code>createHTMLDocument()</code> 메소드를 추가했습니다 .
ru: Добавлен метод <code>createHTMLDocument()</code> .
zh_cn: 添加了 <code>createHTMLDocument()</code> 方法。

source: Added the <code>createTBody()</code> method.
ja: <code>createTBody()</code> メソッドを追加しました。
ko: <code>createTBody()</code> 메소드를 추가했습니다 .
ru: Добавлен метод <code>createTBody()</code> .
zh_cn: 添加了 <code>createTBody()</code> 方法。

source: Added the <code>error</code> property and the 5th parameter to the constructor.
ja: <code>error</code> プロパティと5番目のパラメーターをコンストラクターに追加しました。
ko: 추가 <code>error</code> 속성과 생성자에 5 매개 변수를.
ru: Добавлено свойство <code>error</code> и 5-й параметр в конструктор.
zh_cn: 向构造函数添加了 <code>error</code> 属性和第5个参数。

source: Added the <code>getAnimations()</code> method.
ja: <code>getAnimations()</code> メソッドを追加しました。
ko: <code>getAnimations()</code> 메소드를 추가했습니다 .
ru: Добавлен метод <code>getAnimations()</code> .
zh_cn: 添加了 <code>getAnimations()</code> 方法。

source: Added the <code>getFeature()</code> method (never implemented by any user agent).
ja: <code>getFeature()</code> メソッドを追加しました（ユーザーエージェントによって実装されることはありません）。
ko: <code>getFeature()</code> 메소드를 추가했습니다 ( 사용자 에이전트가 구현하지 않음).
ru: Добавлен метод <code>getFeature()</code> (никогда не реализованный ни одним пользовательским агентом).
zh_cn: 添加了 <code>getFeature()</code> 方法（从未由任何用户代理实现）。

source: Added the <code>getVideoPlaybackQuality()</code> method.
ja: <code>getVideoPlaybackQuality()</code> メソッドを追加しました。
ko: <code>getVideoPlaybackQuality()</code> 메소드를 추가했습니다 .
ru: Добавлен метод <code>getVideoPlaybackQuality()</code> .
zh_cn: 添加了 <code>getVideoPlaybackQuality()</code> 方法。

source: Added the <code>isElementContentWhitespace</code> and <code>wholeText</code> properties.
ja: 追加しました <code>isElementContentWhitespace</code> と <code>wholeText</code> プロパティを。
ko: 추가 <code>isElementContentWhitespace</code> 과 <code>wholeText</code> 속성을.
ru: Добавлены свойства <code>isElementContentWhitespace</code> и <code>wholeText</code> .
zh_cn: 添加了 <code>isElementContentWhitespace</code> 和 <code>wholeText</code> 属性。

source: Added the <code>keySystem</code> attribute.
ja: <code>keySystem</code> 属性が追加されました。
ko: <code>keySystem</code> 속성을 추가했습니다 .
ru: Добавлен атрибут <code>keySystem</code> .
zh_cn: 添加了 <code>keySystem</code> 属性。

source: Added the <code>publicID</code>, <code>systemID</code>, and <code>internalSubset</code> properties.
ja: <code>publicID</code> 、 <code>systemID</code> 、および <code>internalSubset</code> プロパティが追加されました。
ko: 추가 된 <code>publicID</code> , <code>systemID</code> 및 <code>internalSubset</code> 의 속성을.
ru: Добавлены <code>publicID</code> , <code>systemID</code> и <code>internalSubset</code> .
zh_cn: 添加了 <code>publicID</code> ， <code>systemID</code> 和 <code>internalSubset</code> 属性。

source: Added the <code>querySelector()</code> and <code>querySelectorAll()</code> methods.
ja: <code>querySelector()</code> および <code>querySelectorAll()</code> メソッドが追加されました。
ko: 추가 <code>querySelector()</code> 및 <code>querySelectorAll()</code> 메소드.
ru: Добавлены методы <code>querySelector()</code> и <code>querySelectorAll()</code> .
zh_cn: 添加了 <code>querySelector()</code> 和 <code>querySelectorAll()</code> 方法。

source: Added the <code>referenceNode</code> and <code>pointerBeforeReferenceNode</code> properties.
ja: <code>referenceNode</code> および <code>pointerBeforeReferenceNode</code> プロパティを追加しました。
ko: <code>referenceNode</code> 및 <code>pointerBeforeReferenceNode</code> 속성을 추가했습니다 .
ru: Добавлены свойства <code>referenceNode</code> и <code>pointerBeforeReferenceNode</code> .
zh_cn: 添加了 <code>referenceNode</code> 和 <code>pointerBeforeReferenceNode</code> 属性。

source: Added the <code>referrerPolicy</code> attribute.
ja: <code>referrerPolicy</code> 属性が追加されました。
ko: <code>referrerPolicy</code> 속성을 추가했습니다 .
ru: Добавлен атрибут <code>referrerPolicy</code> .
zh_cn: 添加了 <code>referrerPolicy</code> 属性。

source: Added the <code>referrerPolicy</code> property.
ja: <code>referrerPolicy</code> プロパティが追加されました。
ko: <code>referrerPolicy</code> 속성을 추가 했습니다.
ru: Добавлено свойство <code>referrerPolicy</code> .
zh_cn: 添加了 <code>referrerPolicy</code> 属性。

source: Added the <code>replaceWholeText()</code> method.
ja: <code>replaceWholeText()</code> メソッドが追加されました。
ko: <code>replaceWholeText()</code> 메서드를 추가했습니다 .
ru: Добавлен метод <code>replaceWholeText()</code> .
zh_cn: 添加了 <code>replaceWholeText()</code> 方法。

source: Added the <code>requestFullscreen()</code> method.
ja: <code>requestFullscreen()</code> メソッドが追加されました。
ko: <code>requestFullscreen()</code> 메소드를 추가했습니다 .
ru: Добавлен метод <code>requestFullscreen()</code> .
zh_cn: 添加了 <code>requestFullscreen()</code> 方法。

source: Added the <code>requestPointerLock()</code> method.
ja: <code>requestPointerLock()</code> メソッドが追加されました。
ko: <code>requestPointerLock()</code> 메소드를 추가했습니다 .
ru: Добавлен метод <code>requestPointerLock()</code> .
zh_cn: 添加了 <code>requestPointerLock()</code> 方法。

source: Added the <code>reversed</code> property.
ja: 追加しました <code>reversed</code> プロパティを。
ko: <code>reversed</code> 속성을 추가 했습니다.
ru: Добавлено <code>reversed</code> свойство.
zh_cn: 添加了 <code>reversed</code> 属性。

source: Added the <code>schemaTypeInfo</code> property. This property was never implemented and has been removed in later specifications.
ja: <code>schemaTypeInfo</code> プロパティが追加されました。このプロパティは実装されておらず、後の仕様で削除されました。
ko: <code>schemaTypeInfo</code> 속성을 추가 했습니다. 이 속성은 구현되지 않았으며 이후 사양에서 제거되었습니다.
ru: Добавлено свойство <code>schemaTypeInfo</code> . Это свойство никогда не было реализовано и было удалено в последующих спецификациях.
zh_cn: 添加了 <code>schemaTypeInfo</code> 属性。此属性从未实现，在以后的规范中已删除。

source: Added the <code>undoScope</code> and <code>undoManager</code> properties.
ja: <code>undoScope</code> および <code>undoManager</code> プロパティを追加しました。
ko: <code>undoScope</code> 및 <code>undoManager</code> 속성을 추가했습니다 .
ru: Добавлены свойства <code>undoScope</code> и <code>undoManager</code> .
zh_cn: 添加了 <code>undoScope</code> 和 <code>undoManager</code> 属性。

source: Added the <code>x</code> and <code>y</code> properties.
ja: <code>x</code> および <code>y</code> プロパティを追加しました。
ko: <code>x</code> 및 <code>y</code> 속성을 추가했습니다 .
ru: Добавлены свойства <code>x</code> и <code>y</code> .
zh_cn: 添加了 <code>x</code> 和 <code>y</code> 属性。

source: Added the constructor <code>Range()</code>.
ja: コンストラクター <code>Range()</code> が追加されました。
ko: <code>Range()</code> 생성자를 추가했습니다 .
ru: Добавлен конструктор <code>Range()</code> .
zh_cn: 添加了构造函数 <code>Range()</code> 。

source: Added the constructor and the implementation of <a href="parentnode"><code>ParentNode</code></a>.
ja: <a href="parentnode"> <code>ParentNode</code> の</a>コンストラクタと実装が追加されました。
ko: 생성자 및 <a href="parentnode"> <code>ParentNode</code> </a> 구현을 추가했습니다 .
ru: Добавлен конструктор и реализация <a href="parentnode"> <code>ParentNode</code> </a> .
zh_cn: 添加了构造函数和<a href="parentnode"> <code>ParentNode</code> </a>的实现。

source: Added the constructor.
ja: コンストラクタを追加しました。
ko: 생성자를 추가했습니다.
ru: Добавил конструктор.
zh_cn: 添加了构造函数。

source: Added the following event handlers: <code>ongotpointercapture</code> and <code>onlostpointercapture</code>.
ja: 次のイベントハンドラーが追加されました： <code>ongotpointercapture</code> および <code>onlostpointercapture</code> 。
ko: <code>ongotpointercapture</code> 및 <code>onlostpointercapture</code> 이벤트 핸들러를 추가했습니다 .
ru: Добавлены следующие обработчики событий: <code>ongotpointercapture</code> и <code>onlostpointercapture</code> .
zh_cn: 添加了以下事件处理程序： <code>ongotpointercapture</code> 和 <code>onlostpointercapture</code> 。

source: Added the following method: <code>forceSpellcheck()</code>.
ja: 次のメソッドを追加しました： <code>forceSpellcheck()</code> 。
ko: <code>forceSpellcheck()</code> 메소드를 추가했습니다 .
ru: Добавлен следующий метод: <code>forceSpellcheck()</code> .
zh_cn: 添加了以下方法： <code>forceSpellcheck()</code> 。

source: Added the following method: <code>insertAdjacentHTML()</code>.
ja: 次のメソッドを追加しました： <code>insertAdjacentHTML()</code> 。
ko: <code>insertAdjacentHTML()</code> 메소드를 추가했습니다 .
ru: Добавлен следующий метод: <code>insertAdjacentHTML()</code> .
zh_cn: 添加了以下方法： <code>insertAdjacentHTML()</code> 。

source: Added the following methods: <code>closest()</code>, <code>insertAdjacentElement()</code> and <code>insertAdjacentText()</code>.
ja: 次のメソッドを追加しました： <code>closest()</code> 、 <code>insertAdjacentElement()</code> と <code>insertAdjacentText()</code> 。
ko: <code>closest()</code> , <code>insertAdjacentElement()</code> 및 <code>insertAdjacentText()</code> 메소드를 추가했습니다 .
ru: Добавлены следующие методы: <code>closest()</code> , <code>insertAdjacentElement()</code> и <code>insertAdjacentText()</code> .
zh_cn: 添加了以下方法： <code>closest()</code> ， <code>insertAdjacentElement()</code> 和 <code>insertAdjacentText()</code> 。

source: Added the following methods: <code>compareDocumentPosition()</code>, <code>isSameNode()</code>, <code>lookupPrefix()</code>, <code>isDefaultNamespace()</code>, <code>lookupNamespaceURI()</code>, <code>isEqualNode()</code>, <code>getFeature()</code>, <code>setUserData()</code>, and <code>getUserData().</code>
ja: 次のメソッドが追加されました： <code>compareDocumentPosition()</code> 、 <code>isSameNode()</code> 、 <code>lookupPrefix()</code> 、 <code>isDefaultNamespace()</code> 、 <code>lookupNamespaceURI()</code> 、 <code>isEqualNode()</code> 、 <code>getFeature()</code> 、 <code>setUserData()</code> 、および <code>getUserData().</code>
ko: <code>compareDocumentPosition()</code> , <code>isSameNode()</code> , <code>lookupPrefix()</code> , <code>isDefaultNamespace()</code> , <code>lookupNamespaceURI()</code> , <code>isEqualNode()</code> , <code>getFeature()</code> , <code>setUserData()</code> 및 <code>getUserData().</code> 메소드를 추가했습니다 .
ru: Добавлены следующие методы: <code>compareDocumentPosition()</code> , <code>isSameNode()</code> , <code>lookupPrefix()</code> , <code>isDefaultNamespace()</code> , <code>lookupNamespaceURI()</code> , <code>isEqualNode()</code> , <code>getFeature()</code> , <code>setUserData()</code> и <code>getUserData().</code>
zh_cn: 添加了以下方法： <code>compareDocumentPosition()</code> ， <code>isSameNode()</code> ， <code>lookupPrefix()</code> ， <code>isDefaultNamespace()</code> ， <code>lookupNamespaceURI()</code> ， <code>isEqualNode()</code> ， <code>getFeature()</code> ， <code>setUserData()</code> 和 <code>getUserData().</code>

source: Added the following methods: <code>getClientRects()</code>, <code>getBoundingClientRect()</code>, <code>scroll()</code>, <code>scrollBy()</code>, <code>scrollTo()</code> and <code>scrollIntoView()</code>.
ja: 次のメソッドを追加しました： <code>getClientRects()</code> 、 <code>getBoundingClientRect()</code> 、 <code>scroll()</code> 、 <code>scrollBy()</code> 、 <code>scrollTo()</code> および <code>scrollIntoView()</code> 。
ko: <code>getClientRects()</code> , <code>getBoundingClientRect()</code> , <code>scroll()</code> , <code>scrollBy()</code> , <code>scrollTo()</code> 및 <code>scrollIntoView()</code> 메소드가 추가되었습니다 .
ru: Добавлены следующие методы: <code>getClientRects()</code> , <code>getBoundingClientRect()</code> , <code>scroll()</code> , <code>scrollBy()</code> , <code>scrollTo()</code> и <code>scrollIntoView()</code> .
zh_cn: 添加了以下方法： <code>getClientRects()</code> ， <code>getBoundingClientRect()</code> ， <code>scroll()</code> ， <code>scrollBy()</code> ， <code>scrollTo()</code> 和 <code>scrollIntoView()</code> 。

source: Added the following methods: <code>getRootNode()</code>
ja: 次のメソッドが追加されました： <code>getRootNode()</code>
ko: 다음 메소드를 추가했습니다. <code>getRootNode()</code>
ru: Добавлены следующие методы: <code>getRootNode()</code>
zh_cn: 添加了以下方法： <code>getRootNode()</code>

source: Added the following methods: <code>normalize()</code>, <code>isSupported()</code> and <code>hasAttributes()</code>.
ja: 次のメソッドが追加されました： <code>normalize()</code> 、 <code>isSupported()</code> 、および <code>hasAttributes()</code> 。
ko: <code>normalize()</code> , <code>isSupported()</code> 및 <code>hasAttributes()</code> 메소드를 추가했습니다 .
ru: Добавлены следующие методы: <code>normalize()</code> , <code>isSupported()</code> и <code>hasAttributes()</code> .
zh_cn: 添加了以下方法： <code>normalize()</code> ， <code>isSupported()</code> 和 <code>hasAttributes()</code> 。

source: Added the following methods: <code>querySelector()</code> and <code>querySelectorAll()</code>.
ja: 次のメソッドが追加されました： <code>querySelector()</code> および <code>querySelectorAll()</code> 。
ko: <code>querySelector()</code> 및 <code>querySelectorAll()</code> 메소드를 추가했습니다 .
ru: Добавлены следующие методы: <code>querySelector()</code> и <code>querySelectorAll()</code> .
zh_cn: 添加了以下方法： <code>querySelector()</code> 和 <code>querySelectorAll()</code> 。

source: Added the following methods: <code>setIdAttribute()</code>, <code>setIdAttributeNS()</code>, and <code>setIdAttributeNode()</code>. These methods were never implemented and have been removed in later specifications.
ja: 次のメソッドが追加されました： <code>setIdAttribute()</code> 、 <code>setIdAttributeNS()</code> 、および <code>setIdAttributeNode()</code> 。これらのメソッドは実装されておらず、後の仕様で削除されました。
ko: <code>setIdAttribute()</code> , <code>setIdAttributeNS()</code> 및 <code>setIdAttributeNode()</code> 메소드를 추가했습니다 . 이러한 방법은 구현되지 않았으며 이후 사양에서 제거되었습니다.
ru: Добавлены следующие методы: <code>setIdAttribute()</code> , <code>setIdAttributeNS()</code> и <code>setIdAttributeNode()</code> . Эти методы никогда не были реализованы и были удалены в более поздних спецификациях.
zh_cn: 添加了以下方法： <code>setIdAttribute()</code> ， <code>setIdAttributeNS()</code> 和 <code>setIdAttributeNode()</code> 。这些方法从未实现，在以后的规范中已被删除。

source: Added the following methods: <code>setPointerCapture()</code> and <code>releasePointerCapture()</code>.
ja: 次のメソッドが追加されました： <code>setPointerCapture()</code> および <code>releasePointerCapture()</code> 。
ko: <code>setPointerCapture()</code> 및 <code>releasePointerCapture()</code> 메소드를 추가했습니다 .
ru: Добавлены следующие методы: <code>setPointerCapture()</code> и <code>releasePointerCapture()</code> .
zh_cn: 添加了以下方法： <code>setPointerCapture()</code> 和 <code>releasePointerCapture()</code> 。

source: Added the following properties: <code>baseURI</code> and <code>textContent</code>.
ja: 次のプロパティを追加しました： <code>baseURI</code> および <code>textContent</code> 。
ko: <code>baseURI</code> 및 <code>textContent</code> 특성을 추가했습니다 .
ru: Добавлены следующие свойства: <code>baseURI</code> и <code>textContent</code> .
zh_cn: 添加了以下属性： <code>baseURI</code> 和 <code>textContent</code> 。

source: Added the following properties: <code>dataset</code>, <code>hidden</code>, <code>tabindex</code>, <code>accessKey</code>, <code>accessKeyLabel</code>, <code>draggable</code>, <code>dropzone</code>, <code>contentEditable</code>, <code>isContentEditable</code>, <code>contextMenu</code>, <code>spellcheck</code>, <code>commandType</code>, <code>commandLabel</code>, <code>commandIcon</code>, <code>commandHidden</code>, <code>commandDisabled</code>, <code>commandChecked</code>, <code>style</code>, and all the <code>onXYZ</code> properties.
ja: 次のプロパティを追加しました： <code>dataset</code> 、 <code>hidden</code> 、 <code>tabindex</code> 属性、 <code>accessKey</code> 、 <code>accessKeyLabel</code> 、 <code>draggable</code> 、 <code>dropzone</code> 、 <code>contentEditable</code> 、 <code>isContentEditable</code> 、 <code>contextMenu</code> 、 <code>spellcheck</code> 、 <code>commandType</code> 、 <code>commandLabel</code> 、 <code>commandIcon</code> 、 <code>commandHidden</code> 、 <code>commandDisabled</code> 、 <code>commandChecked</code> 、 <code>style</code> 、およびすべての <code>onXYZ</code> のプロパティ。
ko: 다음과 같은 속성을 추가 : <code>dataset</code> , <code>hidden</code> , <code>tabindex</code> , <code>accessKey</code> , <code>accessKeyLabel</code> , <code>draggable</code> , <code>dropzone</code> , <code>contentEditable</code> , <code>isContentEditable</code> , <code>contextMenu</code> 를 , <code>spellcheck</code> , <code>commandType</code> , <code>commandLabel</code> , <code>commandIcon</code> , <code>commandHidden</code> , <code>commandDisabled</code> , <code>commandChecked</code> , <code>style</code> , 모든 <code>onXYZ</code> 의 속성.
ru: Добавлены следующие свойства: <code>dataset</code> , <code>hidden</code> , <code>tabindex</code> , <code>accessKey</code> , <code>accessKeyLabel</code> , <code>draggable</code> , <code>dropzone</code> , <code>contentEditable</code> , <code>isContentEditable</code> , <code>contextMenu</code> , <code>spellcheck</code> , <code>commandType</code> , <code>commandLabel</code> , <code>commandIcon</code> , <code>commandHidden</code> , <code>commandDisabled</code> , <code>commandChecked</code> , <code>style</code> , и все <code>onXYZ</code> свойства.
zh_cn: 添加了以下属性： <code>dataset</code> ， <code>hidden</code> ， <code>tabindex</code> ， <code>accessKey</code> ， <code>accessKeyLabel</code> ， <code>draggable</code> ， <code>dropzone</code> ， <code>contentEditable</code> ， <code>isContentEditable</code> ， <code>contextMenu</code> ， <code>spellcheck</code> ， <code>commandType</code> ， <code>commandLabel</code> ， <code>commandIcon</code> ， <code>commandHidden</code> ， <code>commandDisabled</code> ， <code>commandChecked</code> ， <code>style</code> 和所有 <code>onXYZ</code> 属性。

source: Added the following properties: <code>innerHTML</code>, and <code>outerHTML</code>.
ja: 以下のプロパティを追加しました： <code>innerHTML</code> および <code>outerHTML</code> 。
ko: <code>innerHTML</code> 및 <code>outerHTML</code> 속성을 추가했습니다 .
ru: Добавлены следующие свойства: <code>innerHTML</code> и <code>outerHTML</code> .
zh_cn: 添加了以下属性： <code>innerHTML</code> 和 <code>outerHTML</code> 。

source: Added the following properties: <code>namespaceURI</code>, <code>prefix</code>, and <code>localName</code>.
ja: 次のプロパティを追加： <code>namespaceURI</code> 、 <code>prefix</code> 、および <code>localName</code> 。
ko: <code>namespaceURI</code> , <code>prefix</code> 및 <code>localName</code> 특성을 추가했습니다 .
ru: Добавлены следующие свойства: <code>namespaceURI</code> , <code>prefix</code> и <code>localName</code> .
zh_cn: 添加了以下属性： <code>namespaceURI</code> ， <code>prefix</code> 和 <code>localName</code> 。

source: Added the following properties: <code>offsetParent</code>, <code>offsetTop</code>, <code>offsetLeft</code>, <code>offsetWidth</code>, and <code>offsetHeight</code>.
ja: 次のプロパティが追加されました： <code>offsetParent</code> 、 <code>offsetTop</code> 、 <code>offsetLeft</code> 、 <code>offsetWidth</code> 、および <code>offsetHeight</code> 。
ko: <code>offsetParent</code> , <code>offsetTop</code> , <code>offsetLeft</code> , <code>offsetWidth</code> 및 <code>offsetHeight</code> 속성을 추가했습니다 .
ru: Добавлены следующие свойства: <code>offsetParent</code> , <code>offsetTop</code> , <code>offsetLeft</code> , <code>offsetWidth</code> и <code>offsetHeight</code> .
zh_cn: 添加了以下属性： <code>offsetParent</code> ， <code>offsetTop</code> ， <code>offsetLeft</code> ， <code>offsetWidth</code> 和 <code>offsetHeight</code> 。

source: Added the following properties: <code>scrollTop</code>, <code>scrollLeft</code>, <code>scrollWidth</code>, <code>scrollHeight</code>, <code>clientTop</code>, <code>clientLeft</code>, <code>clientWidth</code>, and <code>clientHeight</code>.
ja: 次のプロパティを追加しました： <code>scrollTop</code> 、 <code>scrollLeft</code> 、 <code>scrollWidth</code> 、 <code>scrollHeight</code> 、 <code>clientTop</code> 、 <code>clientLeft</code> 、 <code>clientWidth</code> 、 <code>clientHeight</code> 。
ko: <code>scrollTop</code> , <code>scrollLeft</code> , <code>scrollWidth</code> , <code>scrollHeight</code> , <code>clientTop</code> , <code>clientLeft</code> , <code>clientWidth</code> 및 <code>clientHeight</code> 속성이 추가되었습니다 .
ru: Добавлены следующие свойства: <code>scrollTop</code> , <code>scrollLeft</code> , <code>scrollWidth</code> , <code>scrollHeight</code> , <code>clientTop</code> , <code>clientLeft</code> , <code>clientWidth</code> и <code>clientHeight</code> .
zh_cn: 添加了以下属性： <code>scrollTop</code> ， <code>scrollLeft</code> ， <code>scrollWidth</code> ， <code>scrollHeight</code> ， <code>clientTop</code> ， <code>clientLeft</code> ， <code>clientWidth</code> 和 <code>clientHeight</code> 。

source: Added the following properties: <code>translate</code>, <code>itemScope</code>, <code>itemType</code>, <code>itemId</code>, <code>itemRef</code>, <code>itemProp</code>, <code>properties</code>, and <code>itemValue</code>.
ja: 次のプロパティが追加されました： <code>translate</code> 、 <code>itemScope</code> 、 <code>itemType</code> 、 <code>itemId</code> 、 <code>itemRef</code> 、 <code>itemProp</code> 、 <code>properties</code> 、 <code>itemValue</code> 。
ko: 추가 된 다음과 같은 속성 : <code>translate</code> , <code>itemScope</code> , <code>itemType</code> , <code>itemId</code> , <code>itemRef</code> , <code>itemProp</code> , <code>properties</code> , 및 <code>itemValue</code> 을 .
ru: Добавлены следующие свойства: <code>translate</code> , <code>itemScope</code> , <code>itemType</code> , <code>itemId</code> , <code>itemRef</code> , <code>itemProp</code> , <code>properties</code> и <code>itemValue</code> .
zh_cn: 添加了以下属性： <code>translate</code> ， <code>itemScope</code> ， <code>itemType</code> ， <code>itemId</code> ， <code>itemRef</code> ， <code>itemProp</code> ， <code>properties</code> 和 <code>itemValue</code> 。
