Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/dom/dom.*.007.xlf
Languages: es, ko, ru, zh_cn

source: <strong>Note:</strong> Characters which are not part of standard CSS syntax must be escaped using a backslash character. Since JavaScript also uses backslash escaping, special care must be taken when writing string literals using these characters. See <a href="#Escaping_special_characters">Escaping special characters</a> for more information.
ru: <strong>Примечание.</strong> Символы, которые не являются частью стандартного синтаксиса CSS, должны быть экранированы с помощью символа обратной косой черты. Поскольку в JavaScript также используется экранирование обратной косой черты, при написании строковых литералов с использованием этих символов следует соблюдать особую осторожность. Посмотрите <a href="#Escaping_special_characters">Escapeing специальные символы</a> для получения дополнительной информации.
zh_cn: <strong>注意：</strong>不属于标准CSS语法的字符必须使用反斜杠字符进行转义。由于JavaScript也使用反斜杠转义，因此在使用这些字符编写字符串文字时必须格外小心。有关更多信息，请参见<a href="#Escaping_special_characters">转义特殊字符</a>。

source: <strong>Note:</strong> Characters which are not part of standard CSS syntax must be escaped using a backslash character. Since JavaScript also uses backspace escaping, special care must be taken when writing string literals using these characters. See <a href="#Escaping_special_characters">Escaping special characters</a> for more information.
ru: <strong>Примечание.</strong> Символы, которые не являются частью стандартного синтаксиса CSS, должны быть экранированы с помощью символа обратной косой черты. Поскольку JavaScript также использует экранирование backspace, при написании строковых литералов, использующих эти символы, необходимо соблюдать особую осторожность. Посмотрите <a href="#Escaping_special_characters">Escapeing специальные символы</a> для получения дополнительной информации.
zh_cn: <strong>注意：</strong>不属于标准CSS语法的字符必须使用反斜杠字符进行转义。由于JavaScript也使用退格转义，因此在使用这些字符编写字符串文字时必须格外小心。有关更多信息，请参见<a href="#Escaping_special_characters">转义特殊字符</a>。

source: <strong>Note:</strong> Collapsed groups are not supported yet in Gecko; the <code>groupCollapsed()</code> method is the same as <code>group()</code> at this time.
ru: <strong>Примечание.</strong> Свернутые группы еще не поддерживаются в Gecko; метод <code>groupCollapsed()</code> настоящее время такой же, как <code>group()</code> .
zh_cn: <strong>注意：</strong> Gecko还不支持折叠的组；此时的 <code>groupCollapsed()</code> 方法与 <code>group()</code> 相同。

source: <strong>Note:</strong> Currently, only Firefox 64 and Chrome 71 supports this unprefixed.
ru: <strong>Примечание.</strong> В настоящее время только Firefox 64 и Chrome 71 поддерживают этот префикс.
zh_cn: <strong>注意：</strong>目前，只有Firefox 64和Chrome 71支持此前缀。

source: <strong>Note:</strong> DOM Level 3 defined <code>namespaceURI</code>, <code>localName</code> and <code>prefix</code> on the <a href="node"><code>Node</code></a> interface. In DOM4 they were moved to <code>Attr</code>.
ru: <strong>Примечание:</strong> DOM Level 3 определил <code>namespaceURI</code> , <code>localName</code> и <code>prefix</code> в интерфейсе <a href="node"> <code>Node</code> </a> . В DOM4 они были перемещены в <code>Attr</code> .
zh_cn: <strong>注意：</strong> DOM级别3 在<a href="node"> <code>Node</code> </a>接口上定义了 <code>namespaceURI</code> ， <code>localName</code> 和 <code>prefix</code> 。在DOM4中，它们已移至 <code>Attr</code> 。

source: <strong>Note:</strong> DOM Level 3 defined <code>namespaceURI</code>, <code>localName</code> and <code>prefix</code> on the <a href="node"><code>Node</code></a> interface. In DOM4 they were moved to <code>Element</code>.
ru: <strong>Примечание:</strong> DOM Level 3 определил <code>namespaceURI</code> , <code>localName</code> и <code>prefix</code> в интерфейсе <a href="node"> <code>Node</code> </a> . В DOM4 они были перемещены в <code>Element</code> .
zh_cn: <strong>注意：</strong> DOM级别3 在<a href="node"> <code>Node</code> </a>接口上定义了 <code>namespaceURI</code> ， <code>localName</code> 和 <code>prefix</code> 。在DOM4中，它们已移至 <code>Element</code> 。

source: <strong>Note:</strong> DOM Level 4 removed this property. The assumption was that since you get an <code>Attr</code> object from an <a href="element"><code>Element</code></a>, you should already know the associated element.
ru: <strong>Примечание:</strong> DOM Level 4 удалил это свойство. Предполагалось, что, поскольку вы получаете объект <code>Attr</code> от <a href="element"> <code>Element</code> </a> , вы уже должны знать связанный элемент.
zh_cn: <strong>注意：</strong> DOM 4级删除了此属性。假设是，由于您从<a href="element"> <code>Element</code> </a>获得了 <code>Attr</code> 对象，因此您应该已经知道关联的元素。

source: <strong>Note:</strong> Different browsers support ICE restart under different sets of conditions. Not all browsers will perform ICE restart due to network congestion, for example.
ru: <strong>Примечание.</strong> Различные браузеры поддерживают перезапуск ICE при разных наборах условий. Например, не все браузеры будут выполнять перезапуск ICE из-за перегрузки сети.
zh_cn: <strong>注意：</strong>不同的浏览器在不同的条件下支持ICE重新启动。例如，由于网络拥堵，并非所有浏览器都会执行ICE重新启动。

source: <strong>Note:</strong> Do not confuse this property with the <a href="button"><code>MouseEvent.button</code></a> property. The <a href="buttons"><code>MouseEvent.buttons</code></a> property indicates the state of buttons pressed during any kind of mouse event, while the <a href="button"><code>MouseEvent.button</code></a> property only guarantees the correct value for mouse events caused by pressing or releasing one or multiple buttons.
ru: <strong>Примечание.</strong> Не путайте это свойство со свойством <a href="button"> <code>MouseEvent.button</code> </a> . Свойство <a href="buttons"> <code>MouseEvent.buttons</code> </a> указывает состояние кнопок, нажатых во время любого типа события мыши, а свойство <a href="button"> <code>MouseEvent.button</code> </a> гарантирует только правильное значение для событий мыши, вызванных нажатием или отпусканием одной или нескольких кнопок.
zh_cn: <strong>注意：</strong>不要将此属性与<a href="button"> <code>MouseEvent.button</code> </a>属性混淆。所述<a href="buttons"> <code>MouseEvent.buttons</code> </a>属性指示任何类型的鼠标事件的期间按下按钮的状态，而<a href="button"> <code>MouseEvent.button</code> </a>属性只保证所引起的按压或释放一个或多个按钮的鼠标事件的正确的值。

source: <strong>Note:</strong> Do not confuse this property with the <a href="buttons"><code>MouseEvent.buttons</code></a> property, which indicates which buttons are pressed for all mouse events types.
ru: <strong>Примечание.</strong> Не путайте это свойство со свойством <a href="buttons"> <code>MouseEvent.buttons</code> </a> , которое указывает, какие кнопки нажимаются для всех типов событий мыши.
zh_cn: <strong>注意：</strong>请勿将此属性与<a href="buttons"> <code>MouseEvent.buttons</code> </a>属性混淆，该属性表示所有鼠标事件类型都按下了哪些按钮。

source: <strong>Note:</strong> Do not rely on the numeric values of the constants, which might change as the specifications continue to change. Use the constant names instead.
ru: <strong>Примечание.</strong> Не полагайтесь на числовые значения констант, которые могут измениться, если спецификации продолжают изменяться. Вместо этого используйте имена констант.
zh_cn: <strong>注意：</strong>不要依赖常量的数值，因为规范的不断变化可能会改变常量的数值。请改用常量名称。

source: <strong>Note:</strong> Do not rely on this property to return a real product name.
ru: <strong>Примечание.</strong> Не полагайтесь на это свойство для возврата реального имени продукта.
zh_cn: <strong>注意：</strong>不要依赖此属性返回真实的产品名称。

source: <strong>Note:</strong> Do not rely on this property to return a real product name. All browsers return "<code>Mozilla</code>" as the value of this property.
ru: <strong>Примечание.</strong> Не полагайтесь на это свойство для возврата реального имени продукта. Все браузеры возвращают &laquo; <code>Mozilla</code> &raquo; в качестве значения этого свойства.
zh_cn: <strong>注意：</strong>不要依赖此属性返回真实的产品名称。所有浏览器均返回&ldquo; <code>Mozilla</code> &rdquo;作为此属性的值。

source: <strong>Note:</strong> Do not rely on this property to return the correct browser name.
ru: <strong>Примечание.</strong> Не полагайтесь на это свойство, чтобы вернуть правильное имя браузера.
zh_cn: <strong>注意：</strong>不要依赖此属性来返回正确的浏览器名称。

source: <strong>Note:</strong> Do not rely on this property to return the correct browser version.
ru: <strong>Примечание.</strong> Не полагайтесь на это свойство для возврата правильной версии браузера.
zh_cn: <strong>注意：</strong>不要依赖此属性来返回正确的浏览器版本。

source: <strong>Note:</strong> Due to the need for compatibility with legacy content, <code>EventListener</code> accepts both a function and an object with a <code>handleEvent()</code> property function. This is shown in the <a href="#Example">example</a> below.
ru: <strong>Примечание.</strong> Из-за необходимости совместимости с устаревшим контентом <code>EventListener</code> принимает функцию и объект с функцией свойства <code>handleEvent()</code> . Это показано в <a href="#Example">примере</a> ниже.
zh_cn: <strong>注意：</strong>由于需要与旧内容兼容，因此 <code>EventListener</code> 接受具有 <code>handleEvent()</code> 属性函数的函数和对象。在下面的<a href="#Example">示例</a>中显示。

source: <strong>Note:</strong> During the standardization process, this method was removed from the specification. It has been deprecated and is in the progress of being removed from most implementations. <strong>Do not use this method</strong>; instead, use the standard constructor, <a href="animationevent"><code>AnimationEvent()</code></a>, to create a synthetic <a href="../animationevent"><code>AnimationEvent</code></a>.
ru: <strong>Примечание.</strong> В процессе стандартизации этот метод был исключен из спецификации. Он устарел и находится в процессе удаления из большинства реализаций. <strong>Не используйте этот метод</strong> ; вместо этого используйте стандартный конструктор <a href="animationevent"> <code>AnimationEvent()</code> </a> для создания синтетического <a href="../animationevent"> <code>AnimationEvent</code> </a> .
zh_cn: <strong>注意：</strong>在标准化过程中，此方法已从规范中删除。它已被弃用，并且正在从大多数实现中删除。<strong>不要使用这种方法</strong> ; 而是使用标准构造函数<a href="animationevent"> <code>AnimationEvent()</code> </a>创建合成的<a href="../animationevent"> <code>AnimationEvent</code> </a>。

source: <strong>Note:</strong> Each of these values is what's called an <em>unrestricted</em> number. In addition to any finite floating-point value, you may use special values such as &plusmn;<a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Infinity"><code>Infinity</code></a> and <a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/NaN"><code>NaN</code></a>.
ru: <strong>Примечание.</strong> Каждое из этих значений называется <em>неограниченным</em> числом. В дополнение к любому конечному значению с плавающей точкой вы можете использовать специальные значения, такие как &plusmn; <a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Infinity"> <code>Infinity</code> </a> и <a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/NaN"> <code>NaN</code> </a> .
zh_cn: <strong>注意：</strong>这些值中的每一个都称为<em>无限制</em>数字。除了任何有限的浮点值，您还可以使用特殊值，例如&plusmn; <a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Infinity"> <code>Infinity</code> </a>和<a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/NaN"> <code>NaN</code> </a>。

source: <strong>Note:</strong> Even though both ends of our connection will be on the same page, we're going to refer to the one that starts the connection as the "local" one, and to the other as the "remote" end.
ru: <strong>Примечание.</strong> Даже если оба конца нашего соединения будут на одной странице, мы будем называть тот, который запускает соединение, &laquo;локальным&raquo;, а другой - &laquo;удаленным&raquo;.
zh_cn: <strong>注意：</strong>即使我们的连接两端都在同一页上，我们也将把开始连接的一端称为&ldquo;本地&rdquo;端，将另一端称为&ldquo;远程&rdquo;端。

source: <strong>Note:</strong> Every <code>RTCRtpSender</code> is paired with an <a href="../rtcrtpreceiver"><code>RTCRtpReceiver</code></a> to make up an <a href="../rtcrtptransceiver"><code>RTCRtpTransceiver</code></a>. The associated receiver is muted (indicating that it is not able to deliver packets) until and unless one or more streams are added to the receiver by the remote peer.
ru: <strong>Примечание.</strong> Каждый <code>RTCRtpSender</code> связан с <a href="../rtcrtpreceiver"> <code>RTCRtpReceiver</code> </a> для создания <a href="../rtcrtptransceiver"> <code>RTCRtpTransceiver</code> </a> . Связанный приемник отключается (что указывает на то, что он не может доставлять пакеты) до тех пор, пока один или несколько потоков не будут добавлены в приемник удаленным узлом.
zh_cn: <strong>注意：</strong>每个 <code>RTCRtpSender</code> 都与一个<a href="../rtcrtpreceiver"> <code>RTCRtpReceiver</code> </a>配对以组成一个<a href="../rtcrtptransceiver"> <code>RTCRtpTransceiver</code> </a>。除非并且除非远程对等方将一个或多个流添加到接收器，否则关联的接收器将被静音（指示它无法传递数据包）。

source: <strong>Note:</strong> Firefox 3 alters the security for windows' documents so that only the domain from which it was located can access the document. While this may break some existing sites, it's a move made by both Firefox 3 and Internet Explorer 7, and results in improved security.
ru: <strong>Примечание.</strong> Firefox 3 изменяет безопасность документов Windows, так что только тот домен, из которого он был расположен, может получить доступ к документу. Хотя это может сломать некоторые существующие сайты, это шаг, сделанный как Firefox 3, так и Internet Explorer 7, и приводит к повышению безопасности.
zh_cn: <strong>注意：</strong> Firefox 3更改了Windows文档的安全性，因此只有其所在的域才能访问该文档。尽管这可能会破坏某些现有站点，但Firefox 3和Internet Explorer 7都采取了此举，并提高了安全性。

source: <strong>Note:</strong> Firefox does not implement the <code>dialogHide</code>, <code>edge</code>, <code>status</code>, or <code>unadorned</code> arguments.
ru: <strong>Примечание.</strong> Firefox не поддерживает <code>dialogHide</code> , <code>edge</code> , <code>status</code> или <code>unadorned</code> .
zh_cn: <strong>注意：</strong> Firefox不实现 <code>dialogHide</code> ， <code>edge</code> ， <code>status</code> 或 <code>unadorned</code> 参数。

source: <strong>Note:</strong> First statement uses <a href="../nodelist/item">NodeList</a> method <code>item(0)</code>, which is equivalent to <code>getElementsByTagName('head')[0].</code>
ru: <strong>Примечание.</strong> Первая инструкция использует метод метода <a href="../nodelist/item">NodeList </a> <code>item(0)</code> , который эквивалентен <code>getElementsByTagName('head')[0].</code>
zh_cn: <strong>注意：</strong>第一条语句使用<a href="../nodelist/item">NodeList</a>方法 <code>item(0)</code> ，它等效于 <code>getElementsByTagName('head')[0].</code>

source: <strong>Note:</strong> Focus (which element is receiving user input events) is not the same thing as selection (the currently highlighted part of the document). You can get the current selection using <a href="../window/getselection"><code>window.getSelection()</code></a>.
ru: <strong>Примечание.</strong> Фокус (какой элемент получает события ввода пользователя) - это не то же самое, что выделение (текущая выделенная часть документа). Вы можете получить текущий выбор, используя <a href="../window/getselection"> <code>window.getSelection()</code> </a> .
zh_cn: <strong>注意：</strong>焦点（哪个元素正在接收用户输入事件）与选择（文档的当前突出显示部分）不同。您可以使用<a href="../window/getselection"> <code>window.getSelection()</code> </a>获得当前选择。

source: <strong>Note:</strong> For a more complete example, see the <a href="../element/requestfullscreen#Example">Example</a> in <a href="../element/requestfullscreen">Element.requestFullscreen()</a>.
ru: <strong>Примечание.</strong> Для более полного примера см. <a href="../element/requestfullscreen#Example">Пример</a> в <a href="../element/requestfullscreen">Element.requestFullscreen ()</a> .
zh_cn: <strong>注意：</strong>对于一个更完整的示例，请参见<a href="../element/requestfullscreen#Example">实施例</a>中<a href="../element/requestfullscreen">Element.requestFullscreen（） </a>。

source: <strong>Note:</strong> For backward compatibility, the constructor also accepts as input a string containing the value of the <a href="rtcicecandidate/candidate"><code>candidate</code></a> property instead of a <a href="rtcicecandidateinit"><code>RTCIceCandidateInit</code></a> object, since the <code>candidate</code> includes all of the information that <code>RTCIceCandidateInit</code> does and more.
ru: <strong>Примечание.</strong> Для обратной совместимости конструктор также принимает в качестве входных данных строку, содержащую значение свойства <a href="rtcicecandidate/candidate"> <code>candidate</code> </a> а <a href="rtcicecandidateinit"> <code>RTCIceCandidateInit</code> </a> объекта RTCIceCandidateInit , поскольку <code>candidate</code> включает в себя всю информацию, <code>RTCIceCandidateInit</code> делает RTCIceCandidateInit , и многое другое.
zh_cn: <strong>注意：</strong>为了向后兼容，构造函数还接受包含<a href="rtcicecandidate/candidate"> <code>candidate</code> </a>属性值的字符串（而不是<a href="rtcicecandidateinit"> <code>RTCIceCandidateInit</code> </a>对象）作为输入，因为 <code>candidate</code> 对象包括 <code>RTCIceCandidateInit</code> 所提供的所有信息以及更多信息。

source: <strong>Note:</strong> For event listeners attached to the event target, the event is in the target phase, rather than the capturing and bubbling phases. Events in the target phase will trigger all listeners on an element in the order they were registered, regardless of the <code>useCapture</code> parameter.
ru: <strong>Примечание.</strong> Для прослушивателей событий, подключенных к цели события, событие находится в целевой фазе, а не в фазах захвата и всплытия. События в целевой фазе будут запускать всех слушателей элемента в том порядке, в котором они были зарегистрированы, независимо от параметра <code>useCapture</code> .
zh_cn: <strong>注意：</strong>对于附加到事件目标的事件侦听器，事件处于目标阶段，而不是捕获和冒泡阶段。目标阶段中的事件将按照元素注册的顺序触发元素上的所有侦听器，而不管 <code>useCapture</code> 参数如何。

source: <strong>Note:</strong> For multipart requests, this returns the headers from the <em>current</em> part of the request, not from the original channel.
ru: <strong>Примечание.</strong> Для составных запросов это возвращает заголовки из <em>текущей</em> части запроса, а не из исходного канала.
zh_cn: <strong>注意：</strong>对于多部分请求，这将从请求的<em>当前</em>部分而不是原始通道返回标头。

source: <strong>Note:</strong> For security reasons, when a web page tries to access location information, the user is notified and asked to grant permission. Be aware that each browser has its own policies and methods for requesting this permission.
ru: <strong>Примечание.</strong> По соображениям безопасности, когда веб-страница пытается получить доступ к информации о местоположении, пользователь получает уведомление и запрашивает разрешение. Имейте в виду, что каждый браузер имеет свои собственные политики и методы для запроса этого разрешения.
zh_cn: <strong>注意：</strong>出于安全原因，当网页尝试访问位置信息时，会通知用户并要求其授予权限。请注意，每个浏览器都有自己的策略和方法来请求此权限。

source: <strong>Note:</strong> For your custom fields, you may encounter a "<strong>not allowed by Access-Control-Allow-Headers in preflight response</strong>" exception when you send requests across domains. In this situation, you need to set up the <a href="https://developer.mozilla.org/en-US/docs/Web/HTTP/Headers/Access-Control-Allow-Headers"><code>Access-Control-Allow-Headers</code></a> in your response header at server side.
ru: <strong>Примечание.</strong> Для пользовательских полей при отправке запросов между доменами может возникать исключение &laquo; <strong>не разрешено Access-Control-Allow-Headers in preflight response</strong> &raquo;. В этой ситуации вам необходимо настроить <a href="https://developer.mozilla.org/en-US/docs/Web/HTTP/Headers/Access-Control-Allow-Headers"> <code>Access-Control-Allow-Headers</code> </a> в заголовке вашего ответа на стороне сервера.
zh_cn: <strong>注意：</strong>对于您的自定义字段，跨域发送请求时，可能会遇到&ldquo; <strong>飞行前响应中Access-Control-Allow-Headers不允许的</strong> &rdquo;异常。在这种情况下，您需要在服务器端的响应头中设置<a href="https://developer.mozilla.org/en-US/docs/Web/HTTP/Headers/Access-Control-Allow-Headers"> <code>Access-Control-Allow-Headers</code> </a>。

source: <strong>Note:</strong> From Gecko 9 until Gecko 51, the <code>groupCollapsed()</code> method was the same as <code>group()</code>. Collapsed groups are fully supported starting in Gecko 52. See <a href="https://bugzilla.mozilla.org/show_bug.cgi?id=1088360">bug 1088360</a>.
ru: <strong>Примечание.</strong> С Gecko 9 до Gecko 51 метод <code>groupCollapsed()</code> был таким же, как и <code>group()</code> . Свернутые группы полностью поддерживаются, начиная с Gecko 52. См. <a href="https://bugzilla.mozilla.org/show_bug.cgi?id=1088360">Ошибку 1088360</a> .
zh_cn: <strong>注意：</strong>从Gecko 9到Gecko 51， <code>groupCollapsed()</code> 方法与 <code>group()</code> 相同。从Gecko 52开始，完全支持折叠的组。请参见<a href="https://bugzilla.mozilla.org/show_bug.cgi?id=1088360">bug 1088360</a>。

source: <strong>Note:</strong> Fullscreen requests need to be called from within an event handler or otherwise they will be denied.
ru: <strong>Примечание.</strong> Полноэкранные запросы необходимо вызывать из обработчика событий, иначе они будут отклонены.
zh_cn: <strong>注意：</strong>需要在事件处理程序中调用全屏请求，否则将被拒绝。

source: <strong>Note:</strong> Gecko's implementation of the <code>send()</code> method differs somewhat from the specification in Gecko 6.0; Gecko returns a <code>boolean</code> indicating whether or not the connection is still open (and, by extension, that the data was successfully queued or transmitted); this is corrected in Gecko 8.0.
ru: <strong>Примечание:</strong> реализация Gecko метода <code>send()</code> несколько отличается от спецификации в Gecko 6.0; Gecko возвращает <code>boolean</code> указывающее, открыто ли соединение или нет (и, соответственно, данные были успешно поставлены в очередь или переданы); это исправлено в Gecko 8.0.
zh_cn: <strong>注意：</strong> Gecko的 <code>send()</code> 方法的实现与Gecko 6.0中的规范有所不同。Gecko返回一个 <code>boolean</code> 指示连接是否仍处于打开状态（并扩展了数据是否已成功排队或传输）；这在Gecko 8.0中已得到纠正。

source: <strong>Note:</strong> Gradient coordinates are global, i.e., relative to the current coordinate space. When applied to a shape, the coordinates are NOT relative to the shape's coordinates.
ru: <strong>Примечание.</strong> Координаты градиента являются глобальными, т. Е. Относительно текущего координатного пространства. При применении к фигуре координаты НЕ относятся к координатам фигуры.
zh_cn: <strong>注意：</strong>梯度坐标是全局的，即相对于当前坐标空间。当应用于形状时，坐标不相对于形状的坐标。

source: <strong>Note:</strong> If <code>port</code> is <code>null</code> &mdash; and <code>port</code> is supported by the <a href="https://developer.mozilla.org/en-US/docs/Glossary/user_agent">user agent</a> &mdash; passing the candidate to <a href="../rtcpeerconnection/addicecandidate"><code>addIceCandidate()</code></a> will fail, throwing an <code>OperationError</code> exception.
ru: <strong>Примечание.</strong> Если <code>port</code> равен <code>null</code> а <code>port</code> поддерживается <a href="https://developer.mozilla.org/en-US/docs/Glossary/user_agent">пользовательским агентом,</a> передача кандидата в <a href="../rtcpeerconnection/addicecandidate"> <code>addIceCandidate()</code> </a> завершится неудачей, и будет выдано исключение <code>OperationError</code> .
zh_cn: <strong>注意：</strong>如果 <code>port</code> 为 <code>null</code> （并且<a href="https://developer.mozilla.org/en-US/docs/Glossary/user_agent">用户代理</a>支持 <code>port</code> <a href="../rtcpeerconnection/addicecandidate"> <code>addIceCandidate()</code> </a>则将候选对象传递给addIceCandidate（）将会失败，并引发 <code>OperationError</code> 异常。
