Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/dom/dom.*.007.xlf
Languages: es, ko, ru, zh_cn

source: <em>The <code>Performance</code> interface doesn't inherit any properties.</em>
es: <em>La interfaz de <code>Performance</code> no hereda ninguna propiedad.</em>
ko: <em> <code>Performance</code> 인터페이스는 어떤 속성을 상속하지 않습니다.</em>
ru: <em>Интерфейс <code>Performance</code> не наследует никаких свойств.</em>
zh_cn: <em>在 <code>Performance</code> 接口不继承任何属性。</em>

source: <em>The <code>PerformanceNavigation</code> interface doesn't inherit any properties.</em>
es: <em>La interfaz <code>PerformanceNavigation</code> no hereda ninguna propiedad.</em>
ko: <em> <code>PerformanceNavigation</code> 의 인터페이스는 어떤 속성을 상속하지 않습니다.</em>
ru: <em>Интерфейс <code>PerformanceNavigation</code> не наследует никаких свойств.</em>
zh_cn: <em>该 <code>PerformanceNavigation</code> 接口不继承任何属性。</em>

source: <em>The <code>PerformanceTiming</code> interface doesn't inherit any properties.</em>
es: <em>La interfaz <code>PerformanceTiming</code> no hereda ninguna propiedad.</em>
ko: <em> <code>PerformanceTiming</code> 인터페이스는 어떤 속성을 상속하지 않습니다.</em>
ru: <em>Интерфейс <code>PerformanceTiming</code> не наследует никаких свойств.</em>
zh_cn: <em>该 <code>PerformanceTiming</code> 接口不继承任何属性。</em>

source: <em>The <code>PerformanceTiming</code></em><em>interface doesn't inherit any methods.</em>
es: <em>La <code>PerformanceTiming</code> </em><em>interfaz </em><em>PerformanceTiming</em><em> no hereda ning&uacute;n m&eacute;todo.</em>
ko: <em> <code>PerformanceTiming</code> </em><em> 인터페이스는 어떤 방법을 상속하지 않습니다.</em>
ru: <em>Интерфейс <code>PerformanceTiming</code> </em><em> не наследует никаких методов.</em>
zh_cn: <em>该 <code>PerformanceTiming</code> </em><em>接口不继承任何方法。</em>

source: <em>The <code>Position</code> interface </em><em><em>doesn't inherit any property</em></em>.
es: <em>La interfaz de <code>Position</code> </em><em><em>no hereda ninguna propiedad</em></em> .
ko: <em> <code>Position</code> 인터페이스는 </em><em><em>모든 속성을 상속하지 않습니다</em></em> .
ru: <em> <code>Position</code> интерфейс </em><em><em>не наследует любое свойство</em></em> .
zh_cn: <em>该 <code>Position</code> 接口</em><em><em>不继承任何财产</em></em>。

source: <em>The <code>PositionError</code> interface </em><em><em>doesn't inherit any property</em></em>.
es: <em>La interfaz <code>PositionError</code> </em><em><em>no hereda ninguna propiedad</em></em> .
ko: <em> <code>PositionError</code> 의 인터페이스는 </em><em><em>모든 속성을 상속하지 않습니다</em></em> .
ru: <em> <code>PositionError</code> интерфейс </em><em><em>не наследует любое свойство</em></em> .
zh_cn: <em>该 <code>PositionError</code> 接口</em><em><em>不继承任何财产</em></em>。

source: <em>The <code>PositionOptions</code> interface </em><em><em>doesn't inherit any properties</em></em>.
es: <em>La interfaz de <code>PositionOptions</code> </em><em><em>no hereda ninguna propiedad</em></em> .
ko: <em> <code>PositionOptions</code> 의 인터페이스는 </em><em><em>어떤 속성을 상속하지 않습니다</em></em> .
ru: <em> <code>PositionOptions</code> интерфейс </em><em><em>не наследует никаких свойств</em></em> .
zh_cn: <em>该 <code>PositionOptions</code> 接口</em><em><em>不继承任何属性</em></em>。

source: <em>The <code>ProgressEvent()</code></em><em> constructor also inherits arguments from <a href="../event/event"><code>Event()</code></a>.</em>
es: <em>El <code>ProgressEvent()</code> </em><em>constructor </em><em>ProgressEvent ()</em><em> tambi&eacute;n hereda argumentos de <a href="../event/event"> <code>Event()</code> </a> .</em>
ko: <em> <code>ProgressEvent()</code> </em><em> 생성자도에서 인수를 상속 <a href="../event/event"> <code>Event()</code> </a> .</em>
ru: <em>Конструктор <code>ProgressEvent()</code> </em><em> также наследует аргументы от <a href="../event/event"> <code>Event()</code> </a> .</em>
zh_cn: <em>该 <code>ProgressEvent()</code> </em><em>构造函数也继承参数从<a href="../event/event"> <code>Event()</code> </a>。</em>

source: <em>The <code>PromiseRejectionEvent()</code></em><em> constructor also inherits parameters from <a href="../event/event"><code>Event()</code></a>.</em>
es: <em>El <code>PromiseRejectionEvent()</code> </em><em>constructor </em><em>PromiseRejectionEvent ()</em><em> tambi&eacute;n hereda los par&aacute;metros de <a href="../event/event"> <code>Event()</code> </a> .</em>
ko: <em> <code>PromiseRejectionEvent()</code> </em><em> 생성자도에서 매개 변수를 상속 <a href="../event/event"> <code>Event()</code> </a> .</em>
ru: <em>Конструктор <code>PromiseRejectionEvent()</code> </em><em> также наследует параметры от <a href="../event/event"> <code>Event()</code> </a> .</em>
zh_cn: <em>该 <code>PromiseRejectionEvent()</code> </em><em>构造函数也继承自参数<a href="../event/event"> <code>Event()</code> </a>。</em>

source: <em>The <code>RTCIceTransport</code> interface inherits properties from its parent, <a href="eventtarget"><code>EventTarget</code></a>. It also offers the following properties:</em>
es: <em>La interfaz <code>RTCIceTransport</code> hereda las propiedades de su padre, <a href="eventtarget"> <code>EventTarget</code> </a> . Tambi&eacute;n ofrece las siguientes propiedades:</em>
ko: <em> <code>RTCIceTransport</code> 부모로부터 인터페이스를 상속 속성 <a href="eventtarget"> <code>EventTarget</code> </a> . 또한 다음과 같은 속성을 제공합니다.</em>
ru: <em>Интерфейс <code>RTCIceTransport</code> наследует свойства от своего родителя <a href="eventtarget"> <code>EventTarget</code> </a> . Он также предлагает следующие свойства:</em>
zh_cn: <em>该 <code>RTCIceTransport</code> 从其父，接口继承性<a href="eventtarget"> <code>EventTarget</code> </a>。它还提供以下属性：</em>

source: <em>The <code>RTCRtpStreamStats</code> dictionary is based on <a href="rtcstats"><code>RTCStats</code></a>, and inherits its properties. In addition, some or all of the following properties are available.</em>
es: <em>El diccionario <code>RTCRtpStreamStats</code> se basa en <a href="rtcstats"> <code>RTCStats</code> </a> y hereda sus propiedades. Adem&aacute;s, algunas o todas las siguientes propiedades est&aacute;n disponibles.</em>
ko: <em> <code>RTCRtpStreamStats</code> 의 사전을 기반으로 <a href="rtcstats"> <code>RTCStats</code> </a> 및 상속 속성. 또한 다음 속성 중 일부 또는 전부를 사용할 수 있습니다.</em>
ru: <em> <code>RTCRtpStreamStats</code> словарь основан на <a href="rtcstats"> <code>RTCStats</code> </a> и наследует его свойства. Кроме того, доступны некоторые или все следующие свойства.</em>
zh_cn: <em>该 <code>RTCRtpStreamStats</code> 字典是基于<a href="rtcstats"> <code>RTCStats</code> </a>，并继承了它的属性。此外，某些或所有以下属性都可用。</em>

source: <em>The <code>RTCSctpTransport</code> interface doesn't inherit any properties.</em>
es: <em>La interfaz <code>RTCSctpTransport</code> no hereda ninguna propiedad.</em>
ko: <em> <code>RTCSctpTransport</code> 의 인터페이스는 어떤 속성을 상속하지 않습니다.</em>
ru: <em>Интерфейс <code>RTCSctpTransport</code> не наследует никаких свойств.</em>
zh_cn: <em>该 <code>RTCSctpTransport</code> 接口不继承任何属性。</em>

source: <em>The <code>RTCSessionDescription</code> doesn't inherit any methods and has no methods of its own.</em>
es: <em>El <code>RTCSessionDescription</code> no hereda todos los m&eacute;todos y no tiene m&eacute;todos propios.</em>
ko: <em> <code>RTCSessionDescription</code> 은 어떤 방법을 상속하고 자신의 어떤 방법을 가지고하지 않습니다.</em>
ru: <em> <code>RTCSessionDescription</code> не наследует никаких методов и не имеет собственных методов.</em>
zh_cn: <em>该 <code>RTCSessionDescription</code> 不继承任何方法，有没有自己的方法。</em>

source: <em>The <code>RTCSessionDescription</code> doesn't inherit any methods.</em>
es: <em>El <code>RTCSessionDescription</code> no hereda todos los m&eacute;todos.</em>
ko: <em> <code>RTCSessionDescription</code> 은 어떤 방법을 상속하지 않습니다.</em>
ru: <em> <code>RTCSessionDescription</code> не наследует никаких методов.</em>
zh_cn: <em>该 <code>RTCSessionDescription</code> 不继承任何方法。</em>

source: <em>The <code>RTCSessionDescription</code> interface doesn't inherit any properties.</em>
es: <em>La interfaz <code>RTCSessionDescription</code> no hereda ninguna propiedad.</em>
ko: <em> <code>RTCSessionDescription</code> 의 인터페이스는 어떤 속성을 상속하지 않습니다.</em>
ru: <em>Интерфейс <code>RTCSessionDescription</code> не наследует никаких свойств.</em>
zh_cn: <em>该 <code>RTCSessionDescription</code> 接口不继承任何属性。</em>

source: <em>The <code>RadioNodeList</code></em><em> interface inherits the methods of </em><a href="nodelist"><code>NodeList</code></a>.
es: <em>La <code>RadioNodeList</code> </em><em>interfaz </em><em>RadioNodeList</em><em> hereda los m&eacute;todos de </em><a href="nodelist"> <code>NodeList</code> </a> .
ko: <em> <code>RadioNodeList</code> 의</em><em> 인터페이스 방법의 상속 </em><a href="nodelist"> <code>NodeList</code> </a> .
ru: <em>Интерфейс <code>RadioNodeList</code> </em><em> наследует методы </em><a href="nodelist"> <code>NodeList</code> </a> .
zh_cn: <em>该 <code>RadioNodeList</code> </em><em>接口继承的方法</em><a href="nodelist"> <code>NodeList</code> </a>。

source: <em>The <code>RadioNodeList</code></em><em> interface inherits the properties of </em><a href="nodelist"><code>NodeList</code></a>.
es: <em>La <code>RadioNodeList</code> </em><em>interfaz </em><em>RadioNodeList</em><em> hereda las propiedades de </em><a href="nodelist"> <code>NodeList</code> </a> .
ko: <em> <code>RadioNodeList</code> 의</em><em> 인터페이스의 속성 상속 </em><a href="nodelist"> <code>NodeList</code> </a> .
ru: <em>Интерфейс <code>RadioNodeList</code> </em><em> наследует свойства </em><a href="nodelist"> <code>NodeList</code> </a> .
zh_cn: <em>该 <code>RadioNodeList</code> </em><em>接口继承的属性</em><a href="nodelist"> <code>NodeList</code> </a>。

source: <em>The <code>SVGAnimatedRect</code> interface do not provide any specific methods.</em>
es: <em>La interfaz <code>SVGAnimatedRect</code> no proporciona ning&uacute;n m&eacute;todo espec&iacute;fico.</em>
ko: <em> <code>SVGAnimatedRect</code> 의 인터페이스는 특정 방법을 제공하지 않습니다.</em>
ru: <em>Интерфейс <code>SVGAnimatedRect</code> не предоставляет никаких конкретных методов.</em>
zh_cn: <em>该 <code>SVGAnimatedRect</code> 接口没有提供任何具体的方法。</em>

source: <em>The <code>SVGAnimatedString</code> interface do not provide any specific methods.</em>
es: <em>La interfaz <code>SVGAnimatedString</code> no proporciona ning&uacute;n m&eacute;todo espec&iacute;fico.</em>
ko: <em> <code>SVGAnimatedString</code> 의 인터페이스는 특정 방법을 제공하지 않습니다.</em>
ru: <em>Интерфейс <code>SVGAnimatedString</code> не предоставляет никаких конкретных методов.</em>
zh_cn: <em>该 <code>SVGAnimatedString</code> 接口没有提供任何具体的方法。</em>

source: <em>The <code>SVGElement</code> interface doesn't provide any additional methods, but inherits methods from its parent, <a href="element"><code>Element</code></a>.</em>
es: <em>La interfaz <code>SVGElement</code> no proporciona ning&uacute;n m&eacute;todo adicional, pero hereda los m&eacute;todos de su <a href="element"> <code>Element</code> </a> primario, Element .</em>
ko: <em> <code>SVGElement</code> 의 인터페이스는 부모로부터 추가 방법,하지만 상속 방법을 제공하지 않습니다 <a href="element"> <code>Element</code> </a> .</em>
ru: <em>Интерфейс <code>SVGElement</code> не предоставляет никаких дополнительных методов, но наследует методы от своего родителя <a href="element"> <code>Element</code> </a> .</em>
zh_cn: <em>该 <code>SVGElement</code> 接口没有提供任何附加的方法，但是从它的父，继承方法<a href="element"> <code>Element</code> </a>。</em>

source: <em>The <code>ServiceWorker</code> interface inherits methods from its parent, <a href="worker"><code>Worker</code></a>, with the exception of <a href="worker/terminate"><code>Worker.terminate</code></a> &mdash; this should not be accessible from service workers.</em>
es: <em>La interfaz <code>ServiceWorker</code> hereda los m&eacute;todos de su padre, <a href="worker"> <code>Worker</code> </a> , con la excepci&oacute;n de <a href="worker/terminate"> <code>Worker.terminate</code> </a> : los trabajadores de servicio no deber&iacute;an poder acceder a ella.</em>
ko: <em> <code>ServiceWorker</code> 인터페이스는 <a href="worker/terminate"> <code>Worker.terminate</code> 를</a> 제외 하고 부모 <a href="worker"> <code>Worker</code> </a> 에서 메서드를 상속합니다. 이는 서비스 워커 가 액세스 할 수 없어야합니다.</em>
ru: <em>Интерфейс <code>ServiceWorker</code> наследует методы от своего родителя <a href="worker"> <code>Worker</code> </a> , за исключением <a href="worker/terminate"> <code>Worker.terminate</code> </a> - он не должен быть доступен для сервисных работников.</em>
zh_cn: <em>该 <code>ServiceWorker</code> 从其父，接口继承方法<a href="worker"> <code>Worker</code> </a>，与外<a href="worker/terminate"> <code>Worker.terminate</code> </a> -这不应该是从服务人员访问。</em>

source: <em>The <code>ServiceWorker</code> interface inherits properties from its parent, <a href="worker"><code>Worker</code></a>.</em>
es: <em>La interfaz de <code>ServiceWorker</code> hereda propiedades de su padre, <a href="worker"> <code>Worker</code> </a> .</em>
ko: <em> <code>ServiceWorker</code> 의 부모로부터 인터페이스를 상속 속성 <a href="worker"> <code>Worker</code> </a> .</em>
ru: <em>Интерфейс <code>ServiceWorker</code> наследует свойства от своего родителя <a href="worker"> <code>Worker</code> </a> .</em>
zh_cn: <em>该 <code>ServiceWorker</code> 从其父，接口继承性<a href="worker"> <code>Worker</code> </a>。</em>

source: <em>The <code>ShadowRoot</code> interface includes the following methods defined on the <a href="documentorshadowroot"><code>DocumentOrShadowRoot</code></a> mixin. Note that this is currently only implemented by Chrome; other browsers still implement them on the <a href="document"><code>Document</code></a> interface.</em>
es: <em>La interfaz <code>ShadowRoot</code> incluye los siguientes m&eacute;todos definidos en la mezcla <a href="documentorshadowroot"> <code>DocumentOrShadowRoot</code> </a> . Tenga en cuenta que actualmente solo lo implementa Chrome; otros navegadores a&uacute;n los implementan en la interfaz del <a href="document"> <code>Document</code> </a> .</em>
ko: <em> <code>ShadowRoot</code> 의 인터페이스에서 정의 된 다음과 같은 방법이 포함 <a href="documentorshadowroot"> <code>DocumentOrShadowRoot</code> 의</a> 믹스 인이. 이것은 현재 Chrome에서만 구현됩니다. 다른 브라우저는 여전히 <a href="document"> <code>Document</code> </a> 인터페이스 에서이를 구현합니다 .</em>
ru: <em>Интерфейс <code>ShadowRoot</code> включает следующие методы, определенные в миксине <a href="documentorshadowroot"> <code>DocumentOrShadowRoot</code> </a> . Обратите внимание, что в настоящее время это реализовано только в Chrome; другие браузеры все еще реализуют их в интерфейсе <a href="document"> <code>Document</code> </a> .</em>
zh_cn: <em>所述 <code>ShadowRoot</code> 接口包括所定义的下列方法<a href="documentorshadowroot"> <code>DocumentOrShadowRoot</code> </a>混入。请注意，这目前仅由Chrome实施；其他浏览器仍在<a href="document"> <code>Document</code> </a>界面上实现它们。</em>

source: <em>The <code>ShadowRoot</code> interface includes the following properties defined on the <a href="documentorshadowroot"><code>DocumentOrShadowRoot</code></a> mixin. Note that this is currently only implemented by Chrome; other browsers still implement them on the <a href="document"><code>Document</code></a> interface.</em>
es: <em>La interfaz <code>ShadowRoot</code> incluye las siguientes propiedades definidas en la combinaci&oacute;n <a href="documentorshadowroot"> <code>DocumentOrShadowRoot</code> </a> . Tenga en cuenta que actualmente solo lo implementa Chrome; otros navegadores a&uacute;n los implementan en la interfaz del <a href="document"> <code>Document</code> </a> .</em>
ko: <em> <code>ShadowRoot</code> 의 인터페이스는에 정의 된 다음과 같은 속성이 포함 <a href="documentorshadowroot"> <code>DocumentOrShadowRoot</code> 의</a> 믹스 인을. 이것은 현재 Chrome에서만 구현됩니다. 다른 브라우저는 여전히 <a href="document"> <code>Document</code> </a> 인터페이스 에서이를 구현합니다 .</em>
ru: <em>Интерфейс <code>ShadowRoot</code> включает в себя следующие свойства, определенные в миксине <a href="documentorshadowroot"> <code>DocumentOrShadowRoot</code> </a> . Обратите внимание, что в настоящее время это реализовано только в Chrome; другие браузеры все еще реализуют их в интерфейсе <a href="document"> <code>Document</code> </a> .</em>
zh_cn: <em>所述 <code>ShadowRoot</code> 接口包括所定义的下列属性<a href="documentorshadowroot"> <code>DocumentOrShadowRoot</code> </a>混入。请注意，这目前仅由Chrome实施；其他浏览器仍在<a href="document"> <code>Document</code> </a>界面上实现它们。</em>

source: <em>The <code>Text</code> interface includes the following property, defined on the <a href="slotable"><code>Slotable</code></a> mixin.</em>
es: <em>La interfaz de <code>Text</code> incluye la siguiente propiedad, definida en la <a href="slotable"> <code>Slotable</code> </a> .</em>
ko: <em> <code>Text</code> 인터페이스에 정의 된 다음과 같은 속성이 포함 <a href="slotable"> <code>Slotable</code> 의</a> 믹스 인을.</em>
ru: <em>Интерфейс <code>Text</code> включает следующее свойство, определенное в <a href="slotable"> <code>Slotable</code> </a> .</em>
zh_cn: <em>的 <code>Text</code> 接口包括以下特性，所定义的<a href="slotable"> <code>Slotable</code> </a>混入。</em>

source: <em>The <code>TextDecoder</code> interface doesn't inherit any properties.</em>
es: <em>La interfaz <code>TextDecoder</code> no hereda ninguna propiedad.</em>
ko: <em> <code>TextDecoder</code> 의 인터페이스는 어떤 속성을 상속하지 않습니다.</em>
ru: <em>Интерфейс <code>TextDecoder</code> не наследует никаких свойств.</em>
zh_cn: <em>该 <code>TextDecoder</code> 接口不继承任何属性。</em>

source: <em>The <code>TextEncoder</code> interface doesn't inherit any property.</em>
es: <em>La interfaz <code>TextEncoder</code> no hereda ninguna propiedad.</em>
ko: <em> <code>TextEncoder</code> 의 인터페이스는 모든 속성을 상속하지 않습니다.</em>
ru: <em>Интерфейс <code>TextEncoder</code> не наследует никаких свойств.</em>
zh_cn: <em>该 <code>TextEncoder</code> 接口不继承任何财产。</em>

source: <em>The <code>TransitionEvent()</code></em><em> constructor also inherits arguments from <a href="../event/event"><code>Event()</code></a>.</em>
es: <em>El <code>TransitionEvent()</code> </em><em>constructor </em><em>TransitionEvent ()</em><em> tambi&eacute;n hereda argumentos de <a href="../event/event"> <code>Event()</code> </a> .</em>
ko: <em> <code>TransitionEvent()</code> </em><em> 생성자도에서 인수를 상속 <a href="../event/event"> <code>Event()</code> </a> .</em>
ru: <em>Конструктор <code>TransitionEvent()</code> </em><em> также наследует аргументы от <a href="../event/event"> <code>Event()</code> </a> .</em>
zh_cn: <em>该 <code>TransitionEvent()</code> </em><em>构造函数也继承参数从<a href="../event/event"> <code>Event()</code> </a>。</em>

source: <em>The <code>UIEventInit</code></em><em> dictionary also accepts fields from the <a href="../event/event"><code>EventInit</code></a> dictionary.</em>
es: <em>El <code>UIEventInit</code> </em><em>diccionario </em><em>UIEventInit</em><em> tambi&eacute;n acepta campos del diccionario <a href="../event/event"> <code>EventInit</code> </a> .</em>
ko: <em> <code>UIEventInit</code> 의</em><em> 사전도에서 필드 받아 <a href="../event/event"> <code>EventInit</code> 의</a> 사전.</em>
ru: <em> <code>UIEventInit</code> </em><em> словарь также принимает поля из <a href="../event/event"> <code>EventInit</code> </a> словаря.</em>
zh_cn: <em>该 <code>UIEventInit</code> </em><em>字典还接受来自场<a href="../event/event"> <code>EventInit</code> </a>字典。</em>

source: <em>The <code>URL</code> interface implements methods defined in <a href="https://developer.mozilla.org/en-US/docs/Web/API/URLUtils"><code>URLUtils</code></a>.</em>
es: <em>La interfaz <code>URL</code> implementa m&eacute;todos definidos en <a href="https://developer.mozilla.org/en-US/docs/Web/API/URLUtils"> <code>URLUtils</code> </a> .</em>
ko: <em> <code>URL</code> 의 인터페이스 구현 방법에 정의 <a href="https://developer.mozilla.org/en-US/docs/Web/API/URLUtils"> <code>URLUtils</code> </a> .</em>
ru: <em>Интерфейс <code>URL</code> реализует методы, определенные в <a href="https://developer.mozilla.org/en-US/docs/Web/API/URLUtils"> <code>URLUtils</code> </a> .</em>
zh_cn: <em>在 <code>URL</code> 中定义的接口实现方法<a href="https://developer.mozilla.org/en-US/docs/Web/API/URLUtils"> <code>URLUtils</code> </a>。</em>

source: <em>The <code>VideoPlaybackQuality</code> interface doesn't inherit any property.</em>
es: <em>La interfaz <code>VideoPlaybackQuality</code> no hereda ninguna propiedad.</em>
ko: <em> <code>VideoPlaybackQuality</code> 의 인터페이스는 모든 속성을 상속하지 않습니다.</em>
ru: <em>Интерфейс <code>VideoPlaybackQuality</code> не наследует никаких свойств.</em>
zh_cn: <em>该 <code>VideoPlaybackQuality</code> 接口不继承任何财产。</em>

source: <em>The <code>VideoPlaybackQuality</code> interface neither implements any specific method, nor inherits any.</em>
es: <em>La interfaz <code>VideoPlaybackQuality</code> no implementa ning&uacute;n m&eacute;todo espec&iacute;fico ni hereda ninguno.</em>
ko: <em> <code>VideoPlaybackQuality</code> 의 인터페이스도 어떤 구현 특정 방법이나 상속합니다.</em>
ru: <em>Интерфейс <code>VideoPlaybackQuality</code> не реализует какой-либо конкретный метод и не наследует его.</em>
zh_cn: <em>所述 <code>VideoPlaybackQuality</code> 接口既不器具任何特定的方法，也没有任何继承。</em>

source: <em>The <code>WheelEventInit</code></em><em> dictionary also accepts fields from the <a href="../mouseevent/mouseevent"><code>MouseEventInit</code></a>, <a href="../uievent/uievent"><code>UIEventInit</code></a> and <a href="../event/event"><code>EventInit</code></a> dictionaries.</em>
es: <em>El <code>WheelEventInit</code> </em><em>diccionario </em><em>WheelEventInit</em><em> tambi&eacute;n acepta campos de los diccionarios <a href="../mouseevent/mouseevent"> <code>MouseEventInit</code> </a> , <a href="../uievent/uievent"> <code>UIEventInit</code> </a> y <a href="../event/event"> <code>EventInit</code> </a> .</em>
ko: <em> <code>WheelEventInit</code> </em><em> 사전도에서 필드 받아 <a href="../mouseevent/mouseevent"> <code>MouseEventInit</code> </a> , <a href="../uievent/uievent"> <code>UIEventInit</code> </a> 및 <a href="../event/event"> <code>EventInit</code> </a> 사전.</em>
ru: <em> <code>WheelEventInit</code> </em><em> словарь также принимает поля из <a href="../mouseevent/mouseevent"> <code>MouseEventInit</code> </a> , <a href="../uievent/uievent"> <code>UIEventInit</code> </a> и <a href="../event/event"> <code>EventInit</code> </a> словарей.</em>
zh_cn: <em>该 <code>WheelEventInit</code> </em><em>字典还接受来自场<a href="../mouseevent/mouseevent"> <code>MouseEventInit</code> </a>，<a href="../uievent/uievent"> <code>UIEventInit</code> </a>和<a href="../event/event"> <code>EventInit</code> </a>字典。</em>

source: <em>The <code>WorkerLocation</code> interface doesn't inherit any method, but implements methods defined in the <a href="urlutilsreadonly"><code>URLUtilsReadOnly</code></a> interface.</em>
es: <em>La interfaz <code>WorkerLocation</code> no hereda ning&uacute;n m&eacute;todo, pero implementa m&eacute;todos definidos en la interfaz <a href="urlutilsreadonly"> <code>URLUtilsReadOnly</code> </a> .</em>
ko: <em> <code>WorkerLocation</code> 의 인터페이스는 어떤 방법을 상속하지 않습니다 만, 구현 방법에 정의 <a href="urlutilsreadonly"> <code>URLUtilsReadOnly</code> 의</a> 인터페이스를 제공합니다.</em>
ru: <em>Интерфейс <code>WorkerLocation</code> не наследует никаких методов, но реализует методы, определенные в интерфейсе <a href="urlutilsreadonly"> <code>URLUtilsReadOnly</code> </a> .</em>
zh_cn: <em>所述 <code>WorkerLocation</code> 接口不继承的任何方法，但在所定义的工具的方法<a href="urlutilsreadonly"> <code>URLUtilsReadOnly</code> </a>接口。</em>

source: <em>The <code>WorkerLocation</code> interface doesn't inherit any property, but implements properties defined in the <a href="urlutilsreadonly"><code>URLUtilsReadOnly</code></a> interface.</em>
es: <em>La interfaz <code>WorkerLocation</code> no hereda ninguna propiedad, pero implementa las propiedades definidas en la interfaz <a href="urlutilsreadonly"> <code>URLUtilsReadOnly</code> </a> .</em>
ko: <em> <code>WorkerLocation</code> 의 인터페이스는 모든 속성을 상속하지 않지만, 구현 속성은 정의 <a href="urlutilsreadonly"> <code>URLUtilsReadOnly</code> 의</a> 인터페이스를 제공합니다.</em>
ru: <em>Интерфейс <code>WorkerLocation</code> не наследует никаких свойств, но реализует свойства, определенные в интерфейсе <a href="urlutilsreadonly"> <code>URLUtilsReadOnly</code> </a> .</em>
zh_cn: <em>该 <code>WorkerLocation</code> 接口没有继承任何财产，但在定义工具属性<a href="urlutilsreadonly"> <code>URLUtilsReadOnly</code> </a>接口。</em>
