Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/dom/dom.*.011.xlf
Languages: ja, ko, ru, zh_cn

source: A slot is a placeholder inside a <a href="https://developer.mozilla.org/en-US/docs/Web/Web_Components">web component</a> that users can fill with their own markup (see <a href="https://developer.mozilla.org/en-US/docs/Web/Web_Components/Using_templates_and_slots">Using templates and slots</a> for more information).
ja: スロットは、ユーザーが独自のマークアップで埋めることができる<a href="https://developer.mozilla.org/en-US/docs/Web/Web_Components">Webコンポーネント</a>内のプレースホルダーです（詳細については、<a href="https://developer.mozilla.org/en-US/docs/Web/Web_Components/Using_templates_and_slots">テンプレートとスロットの使用を</a>参照してください）。
ko: 슬롯은 사용자가 자신의 마크 업으로 채울 수 있는 <a href="https://developer.mozilla.org/en-US/docs/Web/Web_Components">웹 구성 요소</a> 내부의 자리 표시 자입니다 (자세한 내용은 <a href="https://developer.mozilla.org/en-US/docs/Web/Web_Components/Using_templates_and_slots">템플릿 및 슬롯 사용</a> 참조 ).
ru: Слот - это заполнитель внутри <a href="https://developer.mozilla.org/en-US/docs/Web/Web_Components">веб-компонента,</a> который пользователи могут заполнить собственной разметкой ( дополнительную информацию см. В разделе <a href="https://developer.mozilla.org/en-US/docs/Web/Web_Components/Using_templates_and_slots">Использование шаблонов и слотов</a> ).
zh_cn: 插槽是<a href="https://developer.mozilla.org/en-US/docs/Web/Web_Components">Web组件</a>内的占位符，用户可以用自己的标记填充该<a href="https://developer.mozilla.org/en-US/docs/Web/Web_Components/Using_templates_and_slots">插槽（</a>有关更多信息，请参阅使用模板和插槽）。

source: A space or a newline
ja: スペースまたは改行
ko: 공백 또는 개행
ru: Пространство или новая линия
zh_cn: 一个空格或一个换行符

source: A special encoding, <code>'replacement'</code>, which only emits an error and an <code>EOF</code> code point. It is used to prevent attacks that mismatch encodings between the client and server. It can happen with <code>ISO-2022-CN</code> and <code>ISO-2022-CN-ext</code>.
ja: エラーと <code>EOF</code> コードポイントのみを出力する特別なエンコーディング <code>'replacement'</code> 。これは、クライアントとサーバー間でエンコーディングを一致させない攻撃を防ぐために使用されます。 <code>ISO-2022-CN</code> および <code>ISO-2022-CN-ext</code> で発生する可能性があります。
ko: 오류 및 <code>EOF</code> 코드 포인트 만 생성 하는 특수 인코딩 <code>'replacement'</code> 클라이언트와 서버간에 인코딩이 일치하지 않는 공격을 방지하는 데 사용됩니다. <code>ISO-2022-CN</code> 및 <code>ISO-2022-CN-ext</code> 에서 발생할 수 있습니다 .
ru: Специальная кодировка <code>'replacement'</code> , которая генерирует только ошибку и код <code>EOF</code> . Он используется для предотвращения атак, которые не соответствуют кодировкам между клиентом и сервером. Это может случиться с <code>ISO-2022-CN</code> и <code>ISO-2022-CN-ext</code> .
zh_cn: 特殊编码 <code>'replacement'</code> ，仅发出错误和 <code>EOF</code> 代码点。它用于防止客户端和服务器之间的编码不匹配的攻击。 <code>ISO-2022-CN</code> 和 <code>ISO-2022-CN-ext</code> 可能会发生这种情况。

source: A special implementation of <a href="window/cancelanimationframe"><code>Window.cancelAnimationFrame</code></a> that allows callbacks registered with <a href="vrdisplay/requestanimationframe"><code>VRDisplay.requestAnimationFrame()</code></a> to be unregistered.
ja: <a href="vrdisplay/requestanimationframe"> <code>VRDisplay.requestAnimationFrame()</code> で</a>登録されたコールバックを登録解除できるようにする<a href="window/cancelanimationframe"> <code>Window.cancelAnimationFrame</code> の</a>特別な実装。
ko: <a href="vrdisplay/requestanimationframe"> <code>VRDisplay.requestAnimationFrame()</code> </a> 에 등록 된 콜백을 등록 취소 할 수 있는 <a href="window/cancelanimationframe"> <code>Window.cancelAnimationFrame</code> </a> 의 특수 구현입니다 .
ru: Специальная реализация <a href="window/cancelanimationframe"> <code>Window.cancelAnimationFrame</code> ,</a> которая позволяет отменить обратные вызовы, зарегистрированные в <a href="vrdisplay/requestanimationframe"> <code>VRDisplay.requestAnimationFrame()</code> </a> .
zh_cn: <a href="window/cancelanimationframe"> <code>Window.cancelAnimationFrame</code> </a>的特殊实现，它允许注销通过<a href="vrdisplay/requestanimationframe"> <code>VRDisplay.requestAnimationFrame()</code> </a>注册的回调。

source: A special implementation of <a href="window/requestanimationframe"><code>Window.requestAnimationFrame</code></a> containing a callback function that will be called every time a new frame of the <code>VRDisplay</code> presentation is rendered.
ja: <code>VRDisplay</code> プレゼンテーションの新しいフレームがレンダリングされるたびに呼び出されるコールバック関数を含む<a href="window/requestanimationframe"> <code>Window.requestAnimationFrame</code> </a>の特別な実装。
ko: <code>VRDisplay</code> 프리젠 테이션 의 새 프레임 이 렌더링 될 때마다 호출되는 콜백 함수를 포함하는 <a href="window/requestanimationframe"> <code>Window.requestAnimationFrame</code> </a> 의 특수 구현입니다 .
ru: Специальная реализация <a href="window/requestanimationframe"> <code>Window.requestAnimationFrame</code> ,</a> содержащая функцию обратного вызова, которая будет вызываться каждый раз, когда <code>VRDisplay</code> новый кадр представления VRDisplay .
zh_cn: <a href="window/requestanimationframe"> <code>Window.requestAnimationFrame</code> </a>的特殊实现，包含一个回调函数，该函数将在每次呈现 <code>VRDisplay</code> 演示文稿的新帧时调用。

source: A specific ancestor of the target <a href="element"><code>element</code></a> being observed. If no value was passed to the constructor or this is <code>null</code>, the top-level document's viewport is used.
ja: <a href="element"> <code>element</code> </a>されているターゲット要素の特定の祖先。コンストラクタに値が渡されなかった場合、または <code>null</code> の場合は、最上位のドキュメントのビューポートが使用されます。
ko: 대상 <a href="element"> <code>element</code> </a> 의 특정 조상 이 관찰되고 있습니다. 생성자에 값이 전달되지 않았거나이 값이 <code>null</code> 인 경우 최상위 문서의 뷰포트가 사용됩니다.
ru: Конкретный предок целевого <a href="element"> <code>element</code> </a> наблюдается. Если значение не было передано в конструктор или это значение равно <code>null</code> , используется область просмотра документа верхнего уровня.
zh_cn: 观察到的目标<a href="element"> <code>element</code> </a>特定祖先。如果未将任何值传递给构造函数，或者该值为 <code>null</code> ，则使用顶级文档的视口。

source: A specific type of event object, based on <a href="extendableevent"><code>ExtendableEvent</code></a>, which represents a notification that has fired.
ja: <a href="extendableevent"> <code>ExtendableEvent</code> </a>に基づく特定のタイプのイベントオブジェクト。発火した通知を表します。
ko: <a href="extendableevent"> <code>ExtendableEvent</code> </a> 기반의 특정 유형의 이벤트 객체로, 발생한 알림을 나타냅니다.
ru: Определенный тип объекта события, основанный на <a href="extendableevent"> <code>ExtendableEvent</code> </a> , который представляет уведомление, которое сработало.
zh_cn: 基于<a href="extendableevent"> <code>ExtendableEvent</code> 的</a>特定类型的事件对象，它表示已触发的通知。

source: A speed selector component would benefit from smooth updating of <code>updatePlaybackRate()</code>, as demonstrated below:
ja: 速度セレクターコンポーネントは、以下に示すように、 <code>updatePlaybackRate()</code> のスムーズな更新から恩恵を受けます。
ko: 속도 선택기 구성 요소는 아래에 설명 된대로 <code>updatePlaybackRate()</code> 의 원활한 업데이트를 통해 이점을 얻을 수 있습니다.
ru: Компонент селектора скорости выиграл бы от плавного обновления <code>updatePlaybackRate()</code> , как показано ниже:
zh_cn: 速度选择器组件将受益于 <code>updatePlaybackRate()</code> 的平滑更新，如下所示：

source: A standard CSS color value indicating the color of the shadow effect; by default, it is fully-transparent black.
ja: シャドウ効果の色を示す標準的なCSSの色の値です。
ko: 그림자 효과의 색상을 나타내는 표준 CSS 색상 값입니다. 기본적으로 완전히 투명한 검정색입니다.
ru: Стандартное значение цвета CSS,указывающее на цвет эффекта тени;по умолчанию-полностью прозрачный черный.
zh_cn: 一个标准的CSS颜色值,表示阴影效果的颜色;默认情况下,它是完全透明的黑色。

source: A standard DOM example:
ja: 標準的な DOM の例。
ko: 표준 DOM 예제 :
ru: Стандартный пример DOM:
zh_cn: 一个标准的DOM例子。

source: A standard getter that allows <a href="speechrecognitionalternative"><code>SpeechRecognitionAlternative</code></a> objects within the result to be accessed via array syntax.
ja: 結果内の<a href="speechrecognitionalternative"> <code>SpeechRecognitionAlternative</code> </a>オブジェクトに配列構文を介してアクセスできるようにする標準ゲッター。
ko: 결과 내 <a href="speechrecognitionalternative"> <code>SpeechRecognitionAlternative</code> </a> 객체에 배열 구문을 통해 액세스 할 수있는 표준 게터입니다 .
ru: Стандартный <a href="speechrecognitionalternative"> <code>SpeechRecognitionAlternative</code> </a> который позволяет объектам SpeechRecognitionAlternative внутри результата получать доступ через синтаксис массива.
zh_cn: 一种标准的getter，它允许通过数组语法访问结果中的<a href="speechrecognitionalternative"> <code>SpeechRecognitionAlternative</code> </a>对象。

source: A standard getter that allows <a href="speechrecognitionresult"><code>SpeechRecognitionResult</code></a> objects in the list to be accessed via array syntax.
ja: リスト内の<a href="speechrecognitionresult"> <code>SpeechRecognitionResult</code> </a>オブジェクトに配列構文を介してアクセスできるようにする標準ゲッター。
ko: 배열 구문을 통해 목록의 <a href="speechrecognitionresult"> <code>SpeechRecognitionResult</code> </a> 개체에 액세스 할 수있는 표준 게터입니다 .
ru: Стандартный <a href="speechrecognitionresult"> <code>SpeechRecognitionResult</code> </a> который позволяет объектам SpeechRecognitionResult в списке получить доступ через синтаксис массива.
zh_cn: 一个标准的获取器，允许通过数组语法访问列表中的<a href="speechrecognitionresult"> <code>SpeechRecognitionResult</code> Result</a>对象。

source: A standard serializer that returns a JSON representation of the <code>PaymentAddress</code> object's properties.
ja: <code>PaymentAddress</code> オブジェクトのプロパティのJSON表現を返す標準シリアライザ。
ko: <code>PaymentAddress</code> 객체 속성의 JSON 표현을 반환하는 표준 직렬 변환기입니다 .
ru: Стандартный сериализатор, который возвращает JSON-представление <code>PaymentAddress</code> объекта PaymentAddress .
zh_cn: 一个标准的序列化程序，它返回 <code>PaymentAddress</code> 对象的属性的JSON表示形式。

source: A static method that creates a new <code>DOMPointReadOnly</code> object given the coordinates provided in the specified <a href="dompointinit"><code>DOMPointInit</code></a> object.
ja: 指定された<a href="dompointinit"> <code>DOMPointInit</code> </a>オブジェクトで提供される座標を指定して、新しい <code>DOMPointReadOnly</code> オブジェクトを作成する静的メソッド。
ko: 지정된 <a href="dompointinit"> <code>DOMPointInit</code> </a> 객체에 제공된 좌표가 주어지면 새로운 <code>DOMPointReadOnly</code> 객체 를 생성하는 정적 메서드입니다 .
ru: Статический метод, который создает новый объект <code>DOMPointReadOnly</code> с учетом координат, указанных в указанном объекте <a href="dompointinit"> <code>DOMPointInit</code> </a> .
zh_cn: 创建一个新的静态方法 <code>DOMPointReadOnly</code> 对象给出指定提供的坐标<a href="dompointinit"> <code>DOMPointInit</code> </a>对象。

source: A string
ja: 文字列
ko: 끈
ru: Струна
zh_cn: 一串

source: A string (defined by the <a href="https://dvcs.w3.org/hg/IndexedDB/raw-file/default/Overview.html#idl-def-IDBCursorDirection"><code>IDBCursorDirection</code> enum</a>) indicating the direction in which the cursor is traversing the data. Possible values are:
ja: カーソルがデータをトラバースする方向を示す文字列（<a href="https://dvcs.w3.org/hg/IndexedDB/raw-file/default/Overview.html#idl-def-IDBCursorDirection"> <code>IDBCursorDirection</code> enumで</a>定義）。可能な値は次のとおりです。
ko: 커서가 데이터를 이동하는 방향을 나타내는 문자열 ( <a href="https://dvcs.w3.org/hg/IndexedDB/raw-file/default/Overview.html#idl-def-IDBCursorDirection"> <code>IDBCursorDirection</code> enum에</a> 의해 정의 됨 ). 가능한 값은 다음과 같습니다.
ru: Строка (определенная <a href="https://dvcs.w3.org/hg/IndexedDB/raw-file/default/Overview.html#idl-def-IDBCursorDirection">перечислением </a> <code>IDBCursorDirection</code> ), указывающая направление, в котором курсор перемещается по данным. Возможные значения:
zh_cn: 一个字符串（由<a href="https://dvcs.w3.org/hg/IndexedDB/raw-file/default/Overview.html#idl-def-IDBCursorDirection"> <code>IDBCursorDirection</code> 枚举</a>定义），指示光标在数据上移动的方向。可能的值为：

source: A string (enum) representing a <a href="http://webaudio.github.io/web-audio-api/#idl-def-BiquadFilterType">BiquadFilterType</a>.
ja: <a href="http://webaudio.github.io/web-audio-api/#idl-def-BiquadFilterType">BiquadFilterTypeを</a>表す文字列（列挙）。
ko: <a href="http://webaudio.github.io/web-audio-api/#idl-def-BiquadFilterType">BiquadFilterType을</a> 나타내는 문자열 (열) 입니다.
ru: Строка (enum), представляющая <a href="http://webaudio.github.io/web-audio-api/#idl-def-BiquadFilterType">BiquadFilterType</a> .
zh_cn: 表示<a href="http://webaudio.github.io/web-audio-api/#idl-def-BiquadFilterType">BiquadFilterType的</a>字符串（枚举）。

source: A string (enum) representing a <a href="https://webaudio.github.io/web-audio-api/#idl-def-BiquadFilterType">BiquadFilterType</a>.
ja: <a href="https://webaudio.github.io/web-audio-api/#idl-def-BiquadFilterType">BiquadFilterTypeを</a>表す文字列（列挙型）。

source: A string <code>data</code> parameter was provided, and the list already contains an item whose <a href="../datatransferitem/kind"><code>kind</code></a> is "Plain Unicode string" and whose type is equal to the specified type parameter.
ja: 文字列 <code>data</code> パラメータが指定されました。リストには、<a href="../datatransferitem/kind"> <code>kind</code> </a>が「プレーンUnicode文字列」で、タイプが指定されたタイプパラメータと等しいアイテムがリストに含まれています。
ko: 문자열 <code>data</code> 매개 변수가 제공되었으며 목록에 해당 <a href="../datatransferitem/kind"> <code>kind</code> </a> 이 "일반 유니 코드 문자열"이고 유형이 지정된 유형 매개 변수와 동일한 항목이 이미 포함되어 있습니다 .
ru: Был предоставлен параметр строковых <code>data</code> , и список уже содержит элемент, <a href="../datatransferitem/kind"> <code>kind</code> </a> которого &laquo;Обычная строка Юникода&raquo; и тип которого равен указанному параметру типа.
zh_cn: 提供了一个字符串 <code>data</code> 参数，并且列表中已经包含一个<a href="../datatransferitem/kind"> <code>kind</code> </a>为&ldquo;普通Unicode字符串&rdquo;且类型等于指定的type参数的项目。

source: A string containing a <a href="https://developer.mozilla.org/en-US/docs/Glossary/SDP">SDP</a> message describing the session. This value is an empty string (<code>""</code>) by default and may not be <code>null</code>.
ja: セッションを説明する<a href="https://developer.mozilla.org/en-US/docs/Glossary/SDP">SDP</a>メッセージを含む文字列。この値はデフォルトでは空の文字列（ <code>""</code> ）であり、 <code>null</code> にすることはできません。
ko: 세션을 설명 하는 <a href="https://developer.mozilla.org/en-US/docs/Glossary/SDP">SDP</a> 메시지가 포함 된 문자열 입니다. 이 값은 기본적으로 빈 문자열 ( <code>""</code> )이며 <code>null</code> 일 수 없습니다 .
ru: Строка, содержащая сообщение <a href="https://developer.mozilla.org/en-US/docs/Glossary/SDP">SDP,</a> описывающее сеанс. Это значение является пустой строкой ( <code>""</code> ) по умолчанию и не может быть <code>null</code> .
zh_cn: 包含描述会话的<a href="https://developer.mozilla.org/en-US/docs/Glossary/SDP">SDP</a>消息的字符串。默认情况下，此值为空字符串（ <code>""</code> ），并且不能为 <code>null</code> 。

source: A string containing a valid 3-letter <a href="https://www.iso.org/iso-4217-currency-codes.html">ISO 4217</a> currency identifier (<a href="https://en.wikipedia.org/wiki/ISO%204217">ISO 4217</a>) indicating the currency used for the payment <code>value</code>.
ja: 支払い <code>value</code> 使用される通貨を示す、有効な3文字の<a href="https://www.iso.org/iso-4217-currency-codes.html">ISO 4217</a>通貨識別子（<a href="https://en.wikipedia.org/wiki/ISO%204217">ISO 4217</a>）を含む文字列。
ko: 지불 <code>value</code> 사용 된 통화를 나타내는 유효한 3 자리 <a href="https://www.iso.org/iso-4217-currency-codes.html">ISO 4217</a> 통화 식별자 ( <a href="https://en.wikipedia.org/wiki/ISO%204217">ISO 4217</a> )를 포함하는 문자열 .
ru: Строка, содержащая действительный трехбуквенный идентификатор валюты <a href="https://www.iso.org/iso-4217-currency-codes.html">ISO 4217</a> ( <a href="https://en.wikipedia.org/wiki/ISO%204217">ISO 4217</a> ), указывающий валюту, используемую для <code>value</code> платежа .
zh_cn: 一个字符串，其中包含有效的3个字母的<a href="https://www.iso.org/iso-4217-currency-codes.html">ISO 4217</a>货币标识符（<a href="https://en.wikipedia.org/wiki/ISO%204217">ISO 4217</a>），指示用于支付 <code>value</code> 的货币。

source: A string containing a valid decimal value representing the mount of currency constituting the payment amount. This string must only contain an optional leading "-" to indicate a negative value, then one or more digits from 0 to 9, and an optional decimal point (".", regardless of locale) followed by at least one more digit. No whitespace is permitted.
ja: 支払額を構成する通貨のマウントを表す有効な 10 進数値を含む文字列。この文字列には、負の値を示すためのオプションの先頭の「-」、0 から 9 までの 1 桁以上の数字、ロケールに関係なくオプションの小数点 (".)の後に少なくとも 1 桁以上の数字を含める必要があります。空白は許されません。
ko: 지불 금액을 구성하는 통화 금액을 나타내는 유효한 10 진수 값을 포함하는 문자열입니다. 이 문자열에는 음수 값을 나타내는 선택적 선행 "-", 0에서 9 사이의 하나 이상의 숫자, 로케일에 관계없이 선택적 소수점 ( ".") 및 하나 이상의 숫자가 포함되어야합니다. 공백은 허용되지 않습니다.
ru: Строка,содержащая действительное десятичное значение,представляющее собой монтировку валюты,составляющей сумму платежа.Эта строка должна содержать только необязательную начальную "-" для указания отрицательного значения,затем одну или несколько цифр от 0 до 9,и необязательную десятичную точку (".",независимо от локали),за которой должна следовать,по крайней мере,еще одна цифра.Пробельные символы не допускаются.
zh_cn: 一个字符串,包含一个有效的十进制值,代表构成支付金额的货币种类。这个字符串必须只包含一个可选的前导"-"来表示负值,然后是一个或多个0到9的数字,以及一个可选的小数点(".",无论在什么地方),后面至少再加一个数字。不允许有空格。

source: A string containing the Base64 representation of <code>stringToEncode</code>.
ja: <code>stringToEncode</code> のBase64表現を含む文字列。
ko: <code>stringToEncode</code> 의 Base64 표현이 포함 된 문자열 입니다.
ru: Строка, содержащая представление Base64 <code>stringToEncode</code> .
zh_cn: 一个包含 <code>stringToEncode</code> 的Base64表示形式的字符串。

source: A string containing the data to be added to the Comment.
ja: コメントに追加するデータを含む文字列。
ko: 주석에 추가 할 데이터가 포함 된 문자열입니다.
ru: Строка,содержащая данные,которые необходимо добавить в Комментарий.
zh_cn: 包含要添加到评论中的数据的字符串。

source: A string containing the default value displayed in the text input field. Note that in Internet Explorer 7 and 8, if you do not provide this parameter, the string <code>"undefined"</code> is the default value.
ja: テキスト入力フィールドに表示されるデフォルト値を含む文字列。Internet Explorer 7および8では、このパラメーターを指定しない場合、ストリング <code>"undefined"</code> がデフォルト値になります。
ko: 텍스트 입력 필드에 표시되는 기본값을 포함하는 문자열입니다. Internet Explorer 7 및 8에서이 매개 변수를 제공하지 않으면 문자열 <code>"undefined"</code> 가 기본값입니다.
ru: Строка, содержащая значение по умолчанию, отображаемое в поле ввода текста. Обратите внимание, что в Internet Explorer 7 и 8, если этот параметр <code>"undefined"</code> по умолчанию используется строка &laquo;undefined&raquo; .
zh_cn: 一个字符串，其中包含在文本输入字段中显示的默认值。请注意，在Internet Explorer 7和8中，如果不提供此参数，则字符串 <code>"undefined"</code> 是默认值。

source: A string containing the payer name.
ja: 支払者名を含む文字列。
ko: 지불 자 이름이 포함 된 문자열.
ru: Строка,содержащая имя плательщика.
zh_cn: 包含付款人名称的字符串。

source: A string containing the text entered by the user, or <code>null</code>.
ja: ユーザーが入力したテキストを含む文字列、または <code>null</code> 。
ko: 사용자가 입력 한 텍스트를 포함하는 문자열 또는 <code>null</code> 입니다.
ru: Строка, содержащая текст, введенный пользователем, или <code>null</code> .
zh_cn: 包含用户输入的文本的字符串，或者为 <code>null</code> 。

source: A string containing the text to be written to the document.
ja: 文書に書き込まれるテキストを含む文字列。
ko: 문서에 쓸 텍스트가 포함 된 문자열입니다.
ru: Строка,содержащая текст,который должен быть записан в документ.
zh_cn: 包含要写入文档的文本的字符串。

source: A string containing valid file extensions for the data displayed by the plugin, or an empty string if an extension is not valid for the particular module. For example, a browser's content decryption module may appear in the plugin list, but support more file extenions than can be anticipated. It might therefore return an empty string.
ja: プラグインが表示するデータに対して有効なファイル拡張子を含む文字列、あるいは、拡張子が特定のモジュールに対して有効でない場合は空文字列。例えば、ブラウザのコンテンツ復号化モジュールはプラグインのリストに表示されますが、 予想以上に多くのファイル拡張子をサポートしているかもしれません。そのため、空の文字列を返すこともあります。
ko: 플러그인에 의해 표시되는 데이터의 유효한 파일 확장자를 포함하는 문자열 또는 특정 모듈에 대해 확장자가 유효하지 않은 경우 빈 문자열입니다. 예를 들어, 브라우저의 컨텐츠 암호 해독 모듈이 플러그인 목록에 나타날 수 있지만 예상보다 많은 파일 확장명을 지원합니다. 따라서 빈 문자열을 반환 할 수 있습니다.
ru: Строка,содержащая валидные расширения файлов для данных,отображаемых плагином,или пустая строка,если расширение не валидно для конкретного модуля.Например,модуль расшифровки содержимого браузера может отображаться в списке плагинов,но поддерживает больше расширений файлов,чем можно ожидать.Поэтому он может вернуть пустую строку.
zh_cn: 一个包含插件所显示数据的有效文件扩展名的字符串,如果扩展名对特定模块无效,则为空字符串。例如,浏览器的内容解密模块可能会出现在插件列表中,但支持的文件扩展名数量超过了预期。因此,它可能会返回一个空字符串。

source: A string controlling whether or not to keep browser user interface elements visible while the element is in full-screen mode. The default, <code>"auto"</code>, lets the browser make this decision.
ja: 要素がフルスクリーンモードのときにブラウザのユーザーインターフェイス要素を表示したままにするかどうかを制御する文字列。デフォルトの <code>"auto"</code> では、ブラウザがこの決定を行います。
ko: 요소가 전체 화면 모드 인 동안 브라우저 사용자 인터페이스 요소를 표시할지 여부를 제어하는 ​​문자열입니다. 기본값 <code>"auto"</code> 는 브라우저가이 결정을 할 수있게합니다.
ru: Строка, управляющая тем, должны ли элементы пользовательского интерфейса браузера оставаться видимыми, пока элемент находится в полноэкранном режиме. Значение по умолчанию <code>"auto"</code> позволяет браузеру принять это решение.
zh_cn: 一个字符串，用于控制在元素处于全屏模式时是否保持浏览器用户界面元素可见。默认值 <code>"auto"</code> 允许浏览器做出此决定。

source: A string defining a color we'll apply to the target element when the visibility ratio is increasing. The word "ratio" in this string will be replaced with the target's current visibility ratio, so that the element not only changes color but also becomes increasingly opaque as it becomes less obscured.
ja: 視認性の比率が増加しているときにターゲット要素に適用する色を定義する文字列。この文字列の "比率" という単語は、ターゲットの現在の可視性の比率に置き換えられ、要素は色が変わるだけでなく、不透明度が低くなるにつれてますます不透明になります。
ko: 가시성 비율이 증가 할 때 대상 요소에 적용 할 색상을 정의하는 문자열입니다. 이 문자열에서 "비율"이라는 단어는 대상의 현재 가시성 비율로 바뀌므로 요소의 색상이 변할뿐 아니라 덜 모호 해짐에 따라 점점 불투명 해집니다.
ru: Строка,определяющая цвет,который мы применим к целевому элементу при увеличении коэффициента видимости.Слово "отношение" в этой строке будет заменено на текущее отношение видимости цели,так что элемент не только меняет цвет,но и становится все более непрозрачным,так как он становится менее непонятным.
zh_cn: 一个定义了当可见度比增加时,我们将应用于目标元素的颜色的字符串。这个字符串中的 "比率 "一词将被替换为目标元素当前的可见度比率,这样,元素不仅会改变颜色,而且会随着遮挡度的降低而变得越来越不透明。

source: A string defining the timing function to use for easing transitions during the animation process. Accepts several pre-defined <a href="../domstring"><code>DOMString</code></a> values, a <code>steps()</code> timing function like <code>steps(5, end)</code>, or a custom <code>cubic-bezier</code> value like <code>cubic-bezier(0.42, 0, 0.58, 1)</code>. Defaults to <code>linear</code>. Available values include:
ja: アニメーションプロセス中にトランジションを緩和するために使用するタイミング関数を定義する文字列。いくつかの事前定義された<a href="../domstring"> <code>DOMString</code> </a>値、 <code>steps(5, end)</code> <code>steps()</code> ようなsteps（）タイミング関数、または <code>cubic-bezier(0.42, 0, 0.58, 1)</code> ようなカスタム <code>cubic-bezier</code> 値を受け入れます。デフォルトは <code>linear</code> です。使用可能な値は次のとおりです。
ko: 애니메이션 프로세스 중 전환을 완화하는 데 사용할 타이밍 함수를 정의하는 문자열입니다. 미리 정의 된 여러 <a href="../domstring"> <code>DOMString</code> </a> 값, <code>steps(5, end)</code> 와 같은 <code>steps()</code> 타이밍 함수 또는 <code>cubic-bezier(0.42, 0, 0.58, 1)</code> 와 같은 사용자 정의 <code>cubic-bezier</code> 값을 허용 합니다. 기본값은 <code>linear</code> 입니다. 사용 가능한 값은 다음과 같습니다.
ru: Строка, определяющая функцию синхронизации, которая используется для облегчения переходов во время процесса анимации. Принимает несколько предопределенных значений <a href="../domstring"> <code>DOMString</code> </a> , функцию синхронизации <code>steps()</code> например, <code>steps(5, end)</code> , или пользовательское значение <code>cubic-bezier</code> , например <code>cubic-bezier(0.42, 0, 0.58, 1)</code> . По умолчанию <code>linear</code> . Доступные значения включают в себя:
zh_cn: 一个字符串，定义用于在动画过程中缓和过渡的计时功能。接受几个预定义的<a href="../domstring"> <code>DOMString</code> </a>值，一个 <code>steps()</code> 计时函数（如 <code>steps(5, end)</code> 或一个自定义 <code>cubic-bezier</code> 值（如 <code>cubic-bezier(0.42, 0, 0.58, 1)</code> 。默认为 <code>linear</code> 。可用值包括：
