Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/dom/dom.*.011.xlf
Languages: ja, ko, ru, zh_cn

source: A method to set the float value with a specified unit. If the property attached with this value can not accept the specified unit or the float value, the value will be unchanged and a <a href="domexception"><code>DOMException</code></a> will be raised.
ja: 指定された単位で浮動小数点値を設定するメソッド。この値に関連付けられたプロパティが指定された単位または浮動小数点値を受け入れることができない場合、値は変更されず、<a href="domexception"> <code>DOMException</code> </a>が発生します。
ko: 지정된 단위로 float 값을 설정하는 방법입니다. 이 값으로 첨부 된 특성이 지정된 단위 또는 부동 소수점 값을 승인 할 수 없으면 값이 변경되지 않고 <a href="domexception"> <code>DOMException</code> </a> 이 발생합니다.
ru: Метод для установки значения с плавающей запятой с указанной единицей. Если свойство, связанное с этим значением, не может принять указанную единицу или значение с плавающей запятой, значение не изменится и будет повышено <a href="domexception"> <code>DOMException</code> </a> .
zh_cn: 一种以指定单位设置浮点值的方法。如果与此值关联的属性不能接受指定的单位或float值，则该值将保持不变，并且将引发<a href="domexception"> <code>DOMException</code> </a>。

source: A method to set the string value with the specified unit. If the property attached to this value can't accept the specified unit or the string value, the value will be unchanged and a <a href="domexception"><code>DOMException</code></a> will be raised.
ja: 指定した単位で文字列値を設定するメソッド。この値に関連付けられたプロパティが指定された単位または文字列値を受け入れることができない場合、値は変更されず、<a href="domexception"> <code>DOMException</code> </a>が発生します。
ko: 지정된 단위로 문자열 값을 설정하는 방법입니다. 이 값에 첨부 된 특성이 지정된 단위 또는 문자열 값을 승인 할 수 없으면 값이 변경되지 않고 <a href="domexception"> <code>DOMException</code> </a> 이 발생합니다.
ru: Метод для установки строкового значения с указанной единицей. Если свойство, присоединенное к этому значению, не может принять указанную единицу или строковое значение, значение не изменится и будет <a href="domexception"> <code>DOMException</code> </a> .
zh_cn: 用指定单位设置字符串值的方法。如果附加到该值的属性不能接受指定的单位或字符串值，则该值将保持不变，并且将引发<a href="domexception"> <code>DOMException</code> </a>。

source: A minor note is that in IE6-7, this polyfill uses the <code>window[" uCL"]</code> property on the window object for communicating with the CSS expressions, the <code>x-uCLp</code> css property on all elements, and the <code>element[" uCL"]</code> property on all elements to allow garbadge collection and boost performance. In all polyfilled browsers (IE6-9), an additional <code>element[" uCLp"]</code> property is added to element to ensure standards compliant prototyping, and a <code>DOMTokenList[" uCL"]</code> property is added to each <code>element["classList"]</code> object to ensure that the DOMTokenList is bounded to its own element.
ja: マイナーなメモは、IE6-7では、このポリフィルは、CSS式との通信にウィンドウオブジェクトの <code>window[" uCL"]</code> プロパティ、すべての要素の <code>x-uCLp</code> cssプロパティ、および <code>element[" uCL"]</code> すべての要素のプロパティでガーベッジコレクションを可能にし、パフォーマンスを向上させます。すべてのポリフィルされたブラウザ（IE6-9）では、追加の <code>element[" uCLp"]</code> プロパティが要素に追加され、標準に準拠したプロトタイピングが保証されます。また、 <code>DOMTokenList[" uCL"]</code> プロパティが各 <code>element["classList"]</code> オブジェクトに追加され、 DOMTokenListが独自の要素にバインドされていることを確認します。
ko: 주목할 점은 IE6-7에서이 폴리 필은 CSS 표현식, 모든 요소 의 <code>x-uCLp</code> css 속성 및 <code>element[" uCL"]</code> 와 통신하기 위해 window 객체 의 <code>window[" uCL"]</code> 속성을 사용 한다는 것입니다. 가바 지 수집을 허용하고 성능을 향상시키기 위해 모든 요소에 대한 속성. 모든 폴리 필식 브라우저 (IE6-9)에서 표준 준수 프로토 타이핑을 보장하기 위해 요소에 추가 <code>element[" uCLp"]</code> 특성이 추가되고 <code>DOMTokenList[" uCL"]</code> 특성이 각 <code>element["classList"]</code> 오브젝트에 추가됩니다. DOMTokenList가 자체 요소에 바인드되었는지 확인하십시오.
ru: Незначительное замечание заключается в том, что в IE6-7 этот полифилл использует свойство <code>window[" uCL"]</code> объекта window для связи с выражениями CSS, свойство <code>x-uCLp</code> css для всех элементов и <code>element[" uCL"]</code> свойство на всех элементах, чтобы позволить сбор Garbadge и повысить производительность. Во всех заполненных браузерами (IE6-9) к <code>element[" uCLp"]</code> свойство element ["uCLp"], чтобы обеспечить совместимость со стандартами, а <code>DOMTokenList[" uCL"]</code> добавляется к каждому объекту <code>element["classList"]</code> для убедитесь, что DOMTokenList ограничен своим собственным элементом.
zh_cn: 需要注意的一点是，在IE6-7中，此polyfill使用window对象上的 <code>window[" uCL"]</code> 属性与CSS表达式，所有元素上的 <code>x-uCLp</code> css属性以及 <code>element[" uCL"]</code> 所有元素上的属性，以允许垃圾收集并提高性能。在所有polyfilled浏览器（IE6-9）中，向元素添加了一个额外的 <code>element[" uCLp"]</code> 属性，以确保符合标准的原型，并且向每个 <code>element["classList"]</code> 对象添加了 <code>DOMTokenList[" uCL"]</code> 属性。确保DOMTokenList绑定到其自己的元素。

source: A mirror of the value in <code>numberOfItems</code>, for consistency with other interfaces.
ja: 他のインターフェースとの一貫性を <code>numberOfItems</code> ため、numberOfItemsの値のミラー。
ko: 다른 인터페이스와의 일관성을 위해 <code>numberOfItems</code> 값의 미러입니다 .
ru: Зеркало значения в <code>numberOfItems</code> для согласованности с другими интерфейсами.
zh_cn: <code>numberOfItems</code> 中的值的镜像，以与其他接口保持一致。

source: A miter limit equal to &radic;2 &asymp; 1.4142136 (rounded up) will strip miters for all acute angles, keeping miter joins only for obtuse or right angles.
ja: &radic;2&asymp;1.4142136（切り上げ）に等しい留め継ぎ制限は、すべての鋭角の留め継ぎを取り除き、鈍角または直角の留め継ぎのみを維持します。
ko: &radic;2 &asymp; 1.4142136 (반올림)과 같은 연귀 제한은 연한 또는 직각에 대해서만 연귀 결합을 유지하면서 모든 예각에 대해 연귀를 제거합니다.
ru: Митральный предел, равный &radic;2 &asymp; 1.4142136 (округленный в большую сторону), будет снимать митры для всех острых углов, оставляя митры только для тупых или прямых углов.
zh_cn: 等于&radic;2&asymp;1.4142136（四舍五入）的斜接极限将剥去所有锐角的斜角，使斜接仅保持钝角或直角。

source: A miter limit equal to 1.0 is valid but will disable all miters.
ja: 1.0に等しいマイター制限は有効ですが、すべてのマイターを無効にします。
ko: 1.0과 같은 연귀 제한은 유효하지만 모든 연귀를 비활성화합니다.
ru: Лимит митры,равный 1.0,действителен,но отключает все митры.
zh_cn: 斜角限制等于1.0是有效的,但会禁用所有斜角。

source: A modifier key value. The value must be one of the <a href="../keyboardevent/key"><code>KeyboardEvent.key</code></a> values which represent modifier keys or <code>"Accel"</code>. This is case-sensitive.
ja: 修飾キーの値。値は、修飾キーまたは <code>"Accel"</code> を表す<a href="../keyboardevent/key"> <code>KeyboardEvent.key</code> </a>値の1つでなければなりません。これは大文字と小文字が区別されます。
ko: 수정 자 키 값입니다. 값은 수정 자 키 또는 <code>"Accel"</code> 을 나타내는 <a href="../keyboardevent/key"> <code>KeyboardEvent.key</code> </a> 값 중 하나 여야합니다 . 대소 문자를 구분합니다.
ru: Значение ключа модификатора. Значение должно быть одним из значений <a href="../keyboardevent/key"> <code>KeyboardEvent.key</code> ,</a> которые представляют клавиши-модификаторы или <code>"Accel"</code> . Это с учетом регистра.
zh_cn: 修饰键值。该值必须是代表修饰键或 <code>"Accel"</code> 的<a href="../keyboardevent/key"> <code>KeyboardEvent.key</code> </a>值之一。这是区分大小写的。

source: A modifier key value. The value must be one of the <a href="key"><code>KeyboardEvent.key</code></a> values which represent modifier keys, or the string <code>"Accel"</code> . This is case-sensitive.
ja: 修飾キーの値。値は、修飾キーを表す<a href="key"> <code>KeyboardEvent.key</code> </a>値の1つ、または文字列 <code>"Accel"</code> である必要があります。これは大文字と小文字が区別されます。
ko: 수정 자 키 값입니다. 값은 수정 자 키를 나타내는 <a href="key"> <code>KeyboardEvent.key</code> </a> 값 중 하나 이거나 문자열 <code>"Accel"</code> 이어야합니다 . 대소 문자를 구분합니다.
ru: Значение ключа модификатора. Значением должно быть одно из значений <a href="key"> <code>KeyboardEvent.key</code> ,</a> представляющих клавиши-модификаторы, или строка <code>"Accel"</code> . Это с учетом регистра.
zh_cn: 修饰键值。该值必须是代表修饰键的<a href="key"> <code>KeyboardEvent.key</code> </a>值之一，或者是字符串 <code>"Accel"</code> 。这是区分大小写的。

source: A mono, stereo, or 4-channel <em><a href="audiobuffer"><code>AudioBuffer</code></a></em> containing the (possibly multichannel) impulse response used by the <code>ConvolverNode</code> to create the reverb effect.
ja: <code>ConvolverNode</code> がリバーブエフェクトを作成するために使用する（おそらくマルチチャネルの）インパルス応答を含むモノ、ステレオ、または4チャネルの<em><a href="audiobuffer"> <code>AudioBuffer</code> </a></em>。
ko: 리버브 효과를 생성하기 위해 <code>ConvolverNode</code> 에서 사용하는 (다중 채널) 임펄스 응답을 포함 하는 모노, 스테레오 또는 4 채널 오디오 <em><a href="audiobuffer"> <code>AudioBuffer</code> </a></em> .
ru: Моно, стерео или 4-канальный <em><a href="audiobuffer"> <code>AudioBuffer</code> ,</a></em> содержащий (возможно многоканальный) импульсный отклик, используемый <code>ConvolverNode</code> для создания эффекта реверберации.
zh_cn: 单声道，立体声或4声道<em><a href="audiobuffer"> <code>AudioBuffer</code> ,</a></em>其中包含 <code>ConvolverNode</code> 用于创建混响效果的（可能是多声道）脉冲响应。

source: A more complex selector
ja: より複雑なセレクター
ko: 더 복잡한 선택기
ru: Более сложный селектор
zh_cn: 一个更复杂的选择器

source: A more generic means of seeking to the 50% mark of an animation would be:
ja: アニメの50%マークを目指すというのは、より一般的な手段でしょう。
ko: 애니메이션의 50 %를 찾는보다 일반적인 방법은 다음과 같습니다.
ru: Более общим средством поиска до отметки 50% анимации было бы:
zh_cn: 一个更通用的寻求动画50%大关的手段是。

source: A more in-depth discussion
ja: より踏み込んだ議論
ko: 보다 심층적 인 토론
ru: Более глубокое обсуждение
zh_cn: 更深入的讨论

source: A mutation operation in a transaction failed because a constraint was not satisfied (No legacy code value and constant name).
ja: 制約が満たされていないため、トランザクション内の突然変異操作に失敗しました(レガシー・コードの値と定数名がありません)。
ko: 제약 조건이 충족되지 않아 트랜잭션의 돌연변이 작업이 실패했습니다 (레거시 코드 값 및 상수 이름 없음).
ru: Операция мутации в транзакции завершилась неудачей,поскольку не было выполнено ограничение (нет унаследованного значения кода и имени константы).
zh_cn: 事务中的一个突变操作失败了,因为没有满足约束条件(没有遗留代码值和常量名)。

source: A negative value was specified for one or more of the three time parameters. Please don't attempt to tamper with the laws of temporal physics.
ja: 3つの時間パラメータのうち1つ以上に負の値が指定されています。時間物理学の法則に手を加えようとしないでください。
ko: 세 가지 시간 매개 변수 중 하나 이상에 대해 음수 값을 지정했습니다. 시간 물리 법칙을 조작하려고 시도하지 마십시오.
ru: Отрицательное значение было указано для одного или нескольких из трех временных параметров.Пожалуйста,не пытайтесь нарушать законы временной физики.
zh_cn: 三个时间参数中有一个或多个指定了负值。请不要试图篡改时间物理定律。

source: A network error is triggered on certain combinations of <a href="../request/mode"><code>FetchEvent.request.mode</code></a> and <a href="../response/type"><code>Response.type</code></a> values, as hinted at in the "global rules" listed above.
ja: 上記の「グローバルルール」で示唆されているように、<a href="../request/mode"> <code>FetchEvent.request.mode</code> </a>と<a href="../response/type"> <code>Response.type</code> の</a>値の特定の組み合わせでネットワークエラーがトリガーされます。
ko: 위에 나열된 "전역 규칙"에서 암시 된 것처럼 <a href="../request/mode"> <code>FetchEvent.request.mode</code> </a> 및 <a href="../response/type"> <code>Response.type</code> </a> 값 의 특정 조합에서 네트워크 오류가 발생합니다 .
ru: Сетевая ошибка возникает при определенных комбинациях значений <a href="../request/mode"> <code>FetchEvent.request.mode</code> </a> и <a href="../response/type"> <code>Response.type</code> </a> , как указано в &laquo;глобальных правилах&raquo;, перечисленных выше.
zh_cn: 如上面&ldquo;全局规则&rdquo;中所暗示的，在<a href="../request/mode"> <code>FetchEvent.request.mode</code> </a>和<a href="../response/type"> <code>Response.type</code> </a>值的某些组合上触发了网络错误。

source: A network error occurred. (Legacy code value: <code>19</code> and legacy constant name: <code>NETWORK_ERR</code>)
ja: ネットワークエラーが発生しました。（レガシーコード値： <code>19</code> およびレガシー定数名： <code>NETWORK_ERR</code> ）
ko: 네트워크 오류가 발생했습니다. (레거시 코드 값 : <code>19</code> 및 레거시 상수 이름 : <code>NETWORK_ERR</code> )
ru: Произошла ошибка сети. (Значение <code>NETWORK_ERR</code> кода: <code>19</code> и имя постоянной константы: NETWORK_ERR )
zh_cn: 发生网络错误。（旧版代码值： <code>19</code> ，旧版常量名称： <code>NETWORK_ERR</code> ）

source: A new <a href="../analysernode"><code>AnalyserNode</code></a> object instance.
ja: 新しい<a href="../analysernode"> <code>AnalyserNode</code> </a>オブジェクトインスタンス。
ko: 새로운 <a href="../analysernode"> <code>AnalyserNode</code> </a> 객체 인스턴스.
ru: Новый <a href="../analysernode"> <code>AnalyserNode</code> </a> объекта AnalyserNode .
zh_cn: 一个新的<a href="../analysernode"> <code>AnalyserNode</code> </a>对象实例。

source: A new <a href="../animationevent"><code>AnimationEvent</code></a>, initialized per any provided options.
ja: 提供されたオプションごとに初期化された新しい<a href="../animationevent"> <code>AnimationEvent</code> </a>。
ko: 제공된 옵션마다 초기화 된 새로운 <a href="../animationevent"> <code>AnimationEvent</code> </a>
ru: Новый <a href="../animationevent"> <code>AnimationEvent</code> </a> , инициализированный для любых предоставленных опций.
zh_cn: 一个新的<a href="../animationevent"> <code>AnimationEvent</code> </a>，每个提供的选项都初始化。

source: A new <a href="../audiobuffer"><code>AudioBuffer</code></a> object instance.
ja: 新しい<a href="../audiobuffer"> <code>AudioBuffer</code> </a>オブジェクトのインスタンス。
ko: 새로운 <a href="../audiobuffer"> <code>AudioBuffer</code> </a> 객체 인스턴스
ru: Новый <a href="../audiobuffer"> <code>AudioBuffer</code> </a> объекта AudioBuffer .
zh_cn: 一个新的<a href="../audiobuffer"> <code>AudioBuffer</code> </a>对象实例。

source: A new <a href="../audiobuffersourcenode"><code>AudioBufferSourceNode</code></a> object instance.
ja: 新しい<a href="../audiobuffersourcenode"> <code>AudioBufferSourceNode</code> </a>オブジェクトのインスタンス。
ko: 새로운 <a href="../audiobuffersourcenode"> <code>AudioBufferSourceNode</code> </a> 객체 인스턴스.
ru: Новый <a href="../audiobuffersourcenode"> <code>AudioBufferSourceNode</code> </a> объекта AudioBufferSourceNode .
zh_cn: 一个新的<a href="../audiobuffersourcenode"> <code>AudioBufferSourceNode</code> </a>对象实例。

source: A new <a href="../biquadfilternode"><code>BiquadFilterNode</code></a> object instance.
ja: 新しい<a href="../biquadfilternode"> <code>BiquadFilterNode</code> </a>オブジェクトのインスタンス。
ko: 새로운 <a href="../biquadfilternode"> <code>BiquadFilterNode</code> </a> 객체 인스턴스.
ru: Новый <a href="../biquadfilternode"> <code>BiquadFilterNode</code> </a> объекта BiquadFilterNode .
zh_cn: 一个新的<a href="../biquadfilternode"> <code>BiquadFilterNode</code> </a>对象实例。

source: A new <a href="../blob"><code>Blob</code></a> object containing the specified data from the source <a href="../blob"><code>Blob</code></a>.
ja: ソース<a href="../blob"> <code>Blob</code> </a>からの指定されたデータを含む新しい<a href="../blob"> <code>Blob</code> </a>オブジェクト。
ko: 새 <a href="../blob"> <code>Blob</code> </a> 소스에서 지정된 데이터 객체 함유 <a href="../blob"> <code>Blob</code> </a> .
ru: Новый объект <a href="../blob"> <code>Blob</code> ,</a> содержащий указанные данные из исходного <a href="../blob"> <code>Blob</code> </a> .
zh_cn: 一个新的<a href="../blob"> <code>Blob</code> </a>对象，其中包含来自源<a href="../blob"> <code>Blob</code> </a>的指定数据。

source: A new <a href="../channelmergernode"><code>ChannelMergerNode</code></a> object instance.
ja: 新しい<a href="../channelmergernode"> <code>ChannelMergerNode</code> </a>オブジェクトインスタンス。
ko: 새로운 <a href="../channelmergernode"> <code>ChannelMergerNode</code> </a> 객체 인스턴스.
ru: Новый экземпляр объекта <a href="../channelmergernode"> <code>ChannelMergerNode</code> </a> .
zh_cn: 一个新的<a href="../channelmergernode"> <code>ChannelMergerNode</code> </a>对象实例。

source: A new <a href="../channelsplitternode"><code>ChannelSplitterNode</code></a> object instance.
ja: 新しい<a href="../channelsplitternode"> <code>ChannelSplitterNode</code> </a>オブジェクトインスタンス。
ko: 새로운 <a href="../channelsplitternode"> <code>ChannelSplitterNode</code> </a> 객체 인스턴스
ru: Новый экземпляр объекта <a href="../channelsplitternode"> <code>ChannelSplitterNode</code> </a> .
zh_cn: 一个新的<a href="../channelsplitternode"> <code>ChannelSplitterNode</code> </a>对象实例。

source: A new <a href="../convolvernode"><code>ConvolverNode</code></a> object instance.
ja: 新しい<a href="../convolvernode"> <code>ConvolverNode</code> </a>オブジェクトのインスタンス。
ko: 새로운 <a href="../convolvernode"> <code>ConvolverNode</code> </a> 객체 인스턴스
ru: Новый экземпляр объекта <a href="../convolvernode"> <code>ConvolverNode</code> </a> .
zh_cn: 一个新的<a href="../convolvernode"> <code>ConvolverNode</code> </a>对象实例。

source: A new <a href="../delaynode"><code>DelayNode</code></a> object instance.
ja: 新しい<a href="../delaynode"> <code>DelayNode</code> </a>オブジェクトのインスタンス。
ko: 새로운 <a href="../delaynode"> <code>DelayNode</code> </a> 객체 인스턴스
ru: Новый <a href="../delaynode"> <code>DelayNode</code> </a> объекта DelayNode .
zh_cn: 一个新的<a href="../delaynode"> <code>DelayNode</code> </a>对象实例。

source: A new <a href="../dompoint"><code>DOMPoint</code></a> object whose coordinate and perspective values are identical to those in the source point. The point's properties are mutable and may be changed at any time.
ja: 座標値とパースペクティブ値がソースポイントの値と同じである新しい<a href="../dompoint"> <code>DOMPoint</code> </a>オブジェクト。ポイントのプロパティは変更可能であり、いつでも変更できます。
ko: 좌표 및 원근감 값이 소스 포인트의 값과 동일한 새 <a href="../dompoint"> <code>DOMPoint</code> </a> 객체입니다. 포인트의 속성은 변경 가능하며 언제든지 변경 될 수 있습니다.
ru: Новый объект <a href="../dompoint"> <code>DOMPoint</code> </a> , координаты и значения перспективы которого идентичны значениям в исходной точке. Свойства точки изменчивы и могут быть изменены в любое время.
zh_cn: 一个新的<a href="../dompoint"> <code>DOMPoint</code> </a>对象，其坐标和透视值与源点中的相同。该点的属性是可变的，可以随时更改。

source: A new <a href="../dompointinit"><code>DOMPointInit</code></a> object whose properties are set to the values in the <code>DOMPoint</code> or <code>DOMPointReadOnly</code> on which the method was called.
ja: プロパティがメソッドが呼び出された <code>DOMPoint</code> または <code>DOMPointReadOnly</code> の値に設定される新しい<a href="../dompointinit"> <code>DOMPointInit</code> </a>オブジェクト。
ko: 메소드가 호출 된 <code>DOMPoint</code> 또는 <code>DOMPointReadOnly</code> 의 값으로 특성이 설정된 새 <a href="../dompointinit"> <code>DOMPointInit</code> </a> 오브젝트 .
ru: Новый объект <a href="../dompointinit"> <code>DOMPointInit</code> </a> , свойства которого установлены на значения в <code>DOMPoint</code> или <code>DOMPointReadOnly</code> , для которых был вызван метод.
zh_cn: 一个新的<a href="../dompointinit"> <code>DOMPointInit</code> </a>对象，其属性设置为调用该方法的 <code>DOMPoint</code> 或 <code>DOMPointReadOnly</code> 中的值。

source: A new <a href="../dompointreadonly"><code>DOMPointReadOnly</code></a> object representing the specified location in space.
ja: 空間内の指定された場所を表す新しい<a href="../dompointreadonly"> <code>DOMPointReadOnly</code> </a>オブジェクト。
ko: 공간에서 지정된 위치를 나타내는 새로운 <a href="../dompointreadonly"> <code>DOMPointReadOnly</code> </a> 객체.
ru: Новый объект <a href="../dompointreadonly"> <code>DOMPointReadOnly</code> ,</a> представляющий указанное местоположение в пространстве.
zh_cn: 表示空间中指定位置的新<a href="../dompointreadonly"> <code>DOMPointReadOnly</code> </a>对象。

source: A new <a href="../dompointreadonly"><code>DOMPointReadOnly</code></a> object which is identical to the source point.
ja: ソースポイントと同一の新しい<a href="../dompointreadonly"> <code>DOMPointReadOnly</code> </a>オブジェクト。
ko: 소스 포인트와 동일한 새로운 <a href="../dompointreadonly"> <code>DOMPointReadOnly</code> </a> 객체
ru: Новый объект <a href="../dompointreadonly"> <code>DOMPointReadOnly</code> ,</a> который идентичен исходной точке.
zh_cn: 与源点相同的新<a href="../dompointreadonly"> <code>DOMPointReadOnly</code> </a>对象。

source: A new <a href="../gainnode"><code>GainNode</code></a> object instance.
ja: 新しい<a href="../gainnode"> <code>GainNode</code> </a>オブジェクトのインスタンス。
ko: 새로운 <a href="../gainnode"> <code>GainNode</code> </a> 객체 인스턴스.
ru: Новый <a href="../gainnode"> <code>GainNode</code> </a> объекта GainNode .
zh_cn: 一个新的<a href="../gainnode"> <code>GainNode</code> </a>对象实例。

source: A new <a href="../iirfilternode"><code>IIRFilterNode</code></a> object instance.
ja: 新しい<a href="../iirfilternode"> <code>IIRFilterNode</code> </a>オブジェクトインスタンス。
ko: 새로운 <a href="../iirfilternode"> <code>IIRFilterNode</code> </a> 객체 인스턴스
ru: Новый <a href="../iirfilternode"> <code>IIRFilterNode</code> </a> объекта IIRFilterNode .
zh_cn: 一个新的<a href="../iirfilternode"> <code>IIRFilterNode</code> </a>对象实例。

source: A new <a href="../imagedata"><code>ImageData</code></a> object with the specified width and height. The new object is filled with transparent black pixels.
ja: 指定された幅と高さを持つ新しい<a href="../imagedata"> <code>ImageData</code> </a>オブジェクト。新しいオブジェクトは透明な黒いピクセルで塗りつぶされます。
ko: 지정된 폭과 높이를 가지는 새로운 <a href="../imagedata"> <code>ImageData</code> </a> 객체 새 개체는 투명한 검은 색 픽셀로 채워져 있습니다.
ru: Новый объект <a href="../imagedata"> <code>ImageData</code> </a> с указанными шириной и высотой. Новый объект заполнен прозрачными черными пикселями.
zh_cn: 具有指定宽度和高度的新<a href="../imagedata"> <code>ImageData</code> </a>对象。新对象将填充透明的黑色像素。

source: A new <a href="../imagedata"><code>ImageData</code></a> object.
ja: 新しい<a href="../imagedata"> <code>ImageData</code> </a>オブジェクト。
ko: 새로운 <a href="../imagedata"> <code>ImageData</code> </a> 객체
ru: Новый объект <a href="../imagedata"> <code>ImageData</code> </a> .
zh_cn: 一个新的<a href="../imagedata"> <code>ImageData</code> </a>对象。

source: A new <a href="../intersectionobserver"><code>IntersectionObserver</code></a> which can be used to watch for the visibility of a target element within the specified <code>root</code> crossing through any of the specified visibility <code>threshold</code>s. Call its <a href="observe"><code>observe()</code></a> method to begin watching for the visibility changes on a given target.
ja: 指定された可視性 <code>threshold</code> のいずれかを通過する、指定された <code>root</code> 内のターゲット要素の可視性を監視するために使用できる新しい<a href="../intersectionobserver"> <code>IntersectionObserver</code> </a>。その<a href="observe"> <code>observe()</code> </a>メソッドを呼び出して、特定のターゲットの可視性の変化を監視し始めます。
ko: 지정된 가시성 <code>threshold</code> 통해 지정된 <code>root</code> 내에서 대상 요소의 가시성을 감시하는 데 사용할 수있는 새로운 <a href="../intersectionobserver"> <code>IntersectionObserver</code> </a> . 주어진 대상에서 가시성 변경을 관찰하기 위해 <a href="observe"> <code>observe()</code> </a> 메소드를 호출하십시오 .
ru: Новый <a href="../intersectionobserver"> <code>IntersectionObserver</code> ,</a> который можно использовать для наблюдения за видимостью целевого элемента в пределах указанного <code>root</code> перехода через любой из указанных <code>threshold</code> видимости s. Вызвать его метод <a href="observe"> <code>observe()</code> </a> чтобы начать отслеживать изменения видимости для данной цели.
zh_cn: 一个新的<a href="../intersectionobserver"> <code>IntersectionObserver</code> </a>，可用于通过任何指定的可见性 <code>threshold</code> s 监视指定 <code>root</code> 中的目标元素的可见性。调用其<a href="observe"> <code>observe()</code> </a>方法开始观察给定目标上的可见性更改。

source: A new <a href="../mediaelementaudiosourcenode"><code>MediaElementAudioSourceNode</code></a> object instance.
ja: 新しい<a href="../mediaelementaudiosourcenode"> <code>MediaElementAudioSourceNode</code> </a>オブジェクトインスタンス。
ko: 새로운 <a href="../mediaelementaudiosourcenode"> <code>MediaElementAudioSourceNode</code> </a> 객체 인스턴스.
ru: Новый экземпляр объекта <a href="../mediaelementaudiosourcenode"> <code>MediaElementAudioSourceNode</code> </a> .
zh_cn: 一个新的<a href="../mediaelementaudiosourcenode"> <code>MediaElementAudioSourceNode</code> </a>对象实例。

source: A new <a href="../mediastream"><code>MediaStream</code></a> instance which has a new unique ID and contains clones of every <a href="../mediastreamtrack"><code>MediaStreamTrack</code></a> contained by the <code>MediaStream</code> on which <code>clone()</code> was called.
ja: 新しい一意のIDを持ち、 <code>clone()</code> が呼び出された <code>MediaStream</code> に含まれるすべての<a href="../mediastreamtrack"> <code>MediaStreamTrack</code> の</a>クローンを含む新しい<a href="../mediastream"> <code>MediaStream</code> </a>インスタンス。
ko: 새로운 고유 ID를 가지며 <code>clone()</code> 이 호출 된 <code>MediaStream</code> 에 포함 된 모든 <a href="../mediastreamtrack"> <code>MediaStreamTrack</code> 의</a> 복제본을 포함 하는 새로운 <a href="../mediastream"> <code>MediaStream</code> </a> 인스턴스입니다 .
ru: Новый экземпляр <a href="../mediastream"> <code>MediaStream</code> ,</a> который имеет новый уникальный идентификатор и содержит клоны каждого <a href="../mediastreamtrack"> <code>MediaStreamTrack</code> ,</a> содержащегося в <code>MediaStream</code> , для которого был вызван <code>clone()</code> .
zh_cn: 新<a href="../mediastream"> <code>MediaStream</code> </a>其中有一个新的唯一的ID，并包含所有的克隆实例<a href="../mediastreamtrack"> <code>MediaStreamTrack</code> </a>包含由 <code>MediaStream</code> 上 <code>clone()</code> 被调用。
