Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/dom/dom.*.011.xlf
Languages: ja, ko, ru, zh_cn

source: A valid <a href="../mediaencodingconfiguration"><code>MediaEncodingConfiguration</code></a> dictionary containing a valid media encoding type of <code>record</code> or <code>transmission</code> and a valid media configuration: either an <a href="../audioconfiguration"><code>AudioConfiguration</code></a> or <a href="../videoconfiguration"><code>VideoConfiguration</code></a> dictionary.
ja: 有効<a href="../mediaencodingconfiguration"> <code>MediaEncodingConfiguration</code> の</a>タイプコード有効なメディアを含む辞書 <code>record</code> 又は <code>transmission</code> のいずれか：と有効なメディアコンフィグレーション<a href="../audioconfiguration"> <code>AudioConfiguration</code> </a>又は<a href="../videoconfiguration"> <code>VideoConfiguration</code> の</a>辞書。
ko: 유효한 미디어 인코딩 유형의 <code>record</code> 또는 <code>transmission</code> 포함하는 유효한 <a href="../mediaencodingconfiguration"> <code>MediaEncodingConfiguration</code> </a> 사전 과 유효한 미디어 구성 : <a href="../audioconfiguration"> <code>AudioConfiguration</code> </a> 또는 <a href="../videoconfiguration"> <code>VideoConfiguration</code> </a> 사전.
ru: Допустимый словарь <a href="../mediaencodingconfiguration"> <code>MediaEncodingConfiguration</code> ,</a> содержащий действительный тип кодирования медиа <code>record</code> или <code>transmission</code> и действительную конфигурацию мультимедиа: словарь <a href="../audioconfiguration"> <code>AudioConfiguration</code> </a> или <a href="../videoconfiguration"> <code>VideoConfiguration</code> </a> .
zh_cn: 有效的<a href="../mediaencodingconfiguration"> <code>MediaEncodingConfiguration</code> </a>字典，其中包含 <code>record</code> 或 <code>transmission</code> 的有效媒体编码类型以及有效的媒体配置：<a href="../audioconfiguration"> <code>AudioConfiguration</code> </a>或<a href="../videoconfiguration"> <code>VideoConfiguration</code> </a>字典。

source: A valid <a href="audioconfiguration">audio configuration</a> includes:
ja: 有効な<a href="audioconfiguration">オーディオ構成</a>は次のとおりです。
ko: 유효한 <a href="audioconfiguration">오디오 구성</a> 은 다음과 같습니다.
ru: Действительная <a href="audioconfiguration">аудио конфигурация</a> включает в себя:
zh_cn: 有效的<a href="audioconfiguration">音频配置</a>包括：

source: A valid <a href="videoconfiguration">video configuration</a> includes:
ja: 有効な<a href="videoconfiguration">ビデオ構成</a>は次のとおりです。
ko: 유효한 <a href="videoconfiguration">비디오 구성</a> 은 다음과 같습니다.
ru: Действительная <a href="videoconfiguration">конфигурация видео</a> включает в себя:
zh_cn: 有效的<a href="videoconfiguration">视频配置</a>包括：

source: A valid XML document. The exact contents can vary across user agents and recognition engines, but all supporting implementations will expose a valid XML document complete with an EMMA namespace. If the speech recognition system does not supply EMMA data then the user agent will return <code>null</code>.
ja: 有効なXMLドキュメント。正確な内容はユーザーエージェントや認識エンジンによって異なる場合がありますが、サポートされるすべての実装は、EMMA名前空間を備えた有効なXMLドキュメントを公開します。音声認識システムがEMMAデータを提供しない場合、ユーザーエージェントは <code>null</code> を返します。
ko: 유효한 XML 문서 정확한 내용은 사용자 에이전트와 인식 엔진마다 다를 수 있지만 모든 지원 구현에는 EMMA 네임 스페이스가 포함 된 유효한 XML 문서가 노출됩니다. 음성 인식 시스템이 EMMA 데이터를 제공하지 않으면 사용자 에이전트는 <code>null</code> 을 반환 합니다.
ru: Действительный документ XML. Точное содержимое может варьироваться в зависимости от пользовательских агентов и механизмов распознавания, но все поддерживающие реализации предоставят действительный документ XML с пространством имен EMMA. Если система распознавания речи не предоставляет данные EMMA, тогда пользовательский агент возвратит <code>null</code> .
zh_cn: 有效的XML文档。确切的内容可能因用户代理和识别引擎而异，但是所有支持的实现都将公开带有EMMA命名空间的有效XML文档。如果语音识别系统不提供EMMA数据，则用户代理将返回 <code>null</code> 。

source: A valid configuration includes a valid encoding configuration type or decoding configuration type and a valid <a href="audioconfiguration">audio configuration</a> or <a href="videoconfiguration">video configuration</a>. If you plan on querying <a href="mediaencodingconfiguration">encoding</a> information, set the media type to record or transmission.
ja: 有効な構成には、有効なエンコード構成タイプまたはデコード構成タイプ、および有効な<a href="audioconfiguration">オーディオ構成</a>または<a href="videoconfiguration">ビデオ構成が含まれます</a>。<a href="mediaencodingconfiguration">エンコーディング</a>情報のクエリを行う場合は、メディアタイプを記録または送信に設定します。
ko: 유효한 구성에는 유효한 인코딩 구성 유형 또는 디코딩 구성 유형 및 유효한 <a href="audioconfiguration">오디오 구성</a> 또는 <a href="videoconfiguration">비디오 구성이 포함</a> 됩니다. <a href="mediaencodingconfiguration">인코딩</a> 정보 를 쿼리하려는 경우 미디어 유형을 기록 또는 전송으로 설정하십시오.
ru: Допустимая конфигурация включает в себя допустимый тип конфигурации кодирования или тип конфигурации декодирования и допустимую <a href="audioconfiguration">конфигурацию аудио</a> или <a href="videoconfiguration">видео</a> . Если вы планируете запрашивать информацию о <a href="mediaencodingconfiguration">кодировке</a> , установите тип носителя для записи или передачи.
zh_cn: 有效配置包括有效的编码配置类型或解码配置类型以及有效的<a href="audioconfiguration">音频配置</a>或<a href="videoconfiguration">视频配置</a>。如果计划查询<a href="mediaencodingconfiguration">编码</a>信息，请将媒体类型设置为记录或传输。

source: A valid media decoding configuration, to be submitted as the parameter for <a href="mediacapabilities/decodinginfo"><code>mediaCapabilities.decodingInfo()</code></a> method, has it's `type` set as:
ja: <a href="mediacapabilities/decodinginfo"> <code>mediaCapabilities.decodingInfo()</code> </a>メソッドのパラメーターとして送信される有効なメディアデコード構成では、` type`が次のように設定されています。
ko: <a href="mediacapabilities/decodinginfo"> <code>mediaCapabilities.decodingInfo()</code> </a> 메서드 의 매개 변수로 제출할 유효한 미디어 디코딩 구성의 유형 은 다음과 같습니다.
ru: Действительная конфигурация декодирования медиа, которая должна быть передана в качестве параметра для <a href="mediacapabilities/decodinginfo"> <code>mediaCapabilities.decodingInfo()</code> </a> , имеет тип `type`, установленный как:
zh_cn: 有效的媒体解码配置（要作为<a href="mediacapabilities/decodinginfo"> <code>mediaCapabilities.decodingInfo()</code> </a>方法的参数提交），其&ldquo;类型&rdquo;设置为：

source: A valid media encoding configuration, to be submitted as the parameter for <a href="mediacapabilities/encodinginfo"><code>mediaCapabilities.encodingInfo()</code></a> method, has it's `type` set as:
ja: <a href="mediacapabilities/encodinginfo"> <code>mediaCapabilities.encodingInfo()</code> </a>メソッドのパラメーターとして送信される有効なメディアエンコード構成では、` type`が次のように設定されています。
ko: <a href="mediacapabilities/encodinginfo"> <code>mediaCapabilities.encodingInfo()</code> </a> 메서드 의 매개 변수로 제출할 유효한 미디어 인코딩 구성의 유형 은 다음과 같습니다.
ru: Действительная конфигурация кодирования мультимедиа, которая должна быть передана в качестве параметра для <a href="mediacapabilities/encodinginfo"> <code>mediaCapabilities.encodingInfo()</code> </a> , имеет тип `type`, установленный как:
zh_cn: 有效的媒体编码配置，要作为<a href="mediacapabilities/encodinginfo"> <code>mediaCapabilities.encodingInfo()</code> </a>方法的参数提交，其&ldquo;类型&rdquo;设置为：

source: A value defined in the <a href="https://w3c.github.io/webappsec-csp/#enumdef-securitypolicyviolationeventdisposition">SecurityPolicyViolationEventDisposition enum</a> representing the URI of the blocked resource. Possible values are <code>"enforce"</code> or <code>"report"</code>
ja: ブロックされたリソースのURIを表す<a href="https://w3c.github.io/webappsec-csp/#enumdef-securitypolicyviolationeventdisposition">SecurityPolicyViolationEventDisposition列挙型で</a>定義された値。可能な値は <code>"enforce"</code> または <code>"report"</code>
ko: 차단 된 리소스의 URI를 나타내는 <a href="https://w3c.github.io/webappsec-csp/#enumdef-securitypolicyviolationeventdisposition">SecurityPolicyViolationEventDisposition 열거 형에</a> 정의 된 값 입니다. 가능한 값은 <code>"enforce"</code> 또는 <code>"report"</code> 입니다.
ru: Значение, определенное в <a href="https://w3c.github.io/webappsec-csp/#enumdef-securitypolicyviolationeventdisposition">перечислении SecurityPolicyViolationEventDisposition,</a> представляющее URI заблокированного ресурса. Возможные значения: <code>"enforce"</code> или <code>"report"</code>
zh_cn: 在<a href="https://w3c.github.io/webappsec-csp/#enumdef-securitypolicyviolationeventdisposition">SecurityPolicyViolationEventDisposition枚举中</a>定义的值，代表阻止资源的URI。可能的值为 <code>"enforce"</code> 或 <code>"report"</code>

source: A value defined in the <code><a href="https://dom.spec.whatwg.org/#enumdef-shadowrootmode">ShadowRootMode</a></code> enum &mdash; either <code>open</code> or <code>closed</code>.
ja: <code><a href="https://dom.spec.whatwg.org/#enumdef-shadowrootmode">ShadowRootMode</a></code> 列挙型で定義された値&mdash; <code>open</code> または <code>closed</code> 。
ko: <code><a href="https://dom.spec.whatwg.org/#enumdef-shadowrootmode">ShadowRootMode</a></code> 열거 형에 정의 된 값 ( <code>open</code> 또는 <code>closed</code> ) 입니다.
ru: Значение, определенное в перечислении <code><a href="https://dom.spec.whatwg.org/#enumdef-shadowrootmode">ShadowRootMode</a></code> - <code>open</code> или <code>closed</code> .
zh_cn: 在限定的A值 <code><a href="https://dom.spec.whatwg.org/#enumdef-shadowrootmode">ShadowRootMode</a></code> 枚举-无论是 <code>open</code> 或 <code>closed</code> 。

source: A value of 1.0 indicates it should play at the same speed as its sampling rate, values less than 1.0 cause the sound to play more slowly, while values greater than 1.0 result in audio playing faster than normal. The default value is <code>1.0</code>. When set to another value, the <code>AudioBufferSourceNode</code> resamples the audio before sending it to the output.
ja: 値1.0は、サンプリングレートと同じ速度で再生する必要があることを示します。1.0未満の値は、サウンドの再生速度を遅くします。1.0より大きい値は、オーディオの再生が通常より速くなります。デフォルト値は <code>1.0</code> です。別の値に設定すると、 <code>AudioBufferSourceNode</code> は出力に送信する前にオーディオをリサンプリングします。
ko: 값이 1.0이면 샘플링 속도와 동일한 속도로 재생해야하며 1.0보다 작 으면 사운드가 느리게 재생되고 1.0보다 크면 오디오가 일반보다 빠르게 재생됩니다. 기본값은 <code>1.0</code> 입니다. 다른 값으로 설정하면 <code>AudioBufferSourceNode</code> 는 오디오를 다시 샘플링하여 출력으로 보냅니다.
ru: Значение 1,0 указывает, что оно должно воспроизводиться с той же скоростью, что и частота дискретизации, при значениях менее 1,0 звук воспроизводится медленнее, а при значениях, превышающих 1,0, звук воспроизводится быстрее, чем обычно. Значением по умолчанию является <code>1.0</code> . Когда установлено другое значение, <code>AudioBufferSourceNode</code> повторно дискретизирует аудио перед отправкой его на выход.
zh_cn: 值1.0表示应以与其采样率相同的速度播放，值小于1.0会导致声音播放更慢，而值大于1.0会导致音频播放速度比正常速度快。默认值为 <code>1.0</code> 。设置为另一个值时， <code>AudioBufferSourceNode</code> 在将音频发送到输出之前会对其重新采样。

source: A value of <code>auto</code> means the browser is free to apply its default touch behavior (to the specified region) and the value of <code>none</code> disables the browser's default touch behavior for the region. The values <code>pan-x</code> and <code>pan-y</code>, mean that touches that begin on the specified region are only for horizontal and vertical scrolling, respectively. The value <code>manipulation</code> means the browser may consider touches that begin on the element are only for scrolling and zooming.
ja: <code>auto</code> の値は、ブラウザーが（指定された領域に）デフォルトのタッチ動作を自由に適用できることを意味し、 <code>none</code> の値は、その領域に対するブラウザーのデフォルトのタッチ動作を無効にします。値 <code>pan-x</code> と <code>pan-y</code> は、指定された領域で始まるタッチがそれぞれ水平スクロールと垂直スクロールのみであることを意味します。値の <code>manipulation</code> は、ブラウザが要素で始まるタッチがスクロールとズームのみであると見なす可能性があることを意味します。
ko: <code>auto</code> 값은 브라우저가 기본 터치 동작을 지정된 영역에 자유롭게 적용 할 수 있고 <code>none</code> 값은 해당 영역에 대한 브라우저의 기본 터치 동작을 비활성화합니다. <code>pan-x</code> 및 <code>pan-y</code> 값 은 지정된 영역에서 시작하는 터치가 각각 가로 및 세로 스크롤 전용임을 의미합니다. 값 <code>manipulation</code> 은 브라우저에서 요소에서 시작되는 터치가 스크롤 및 확대 / 축소 전용임을 고려할 수 있음을 의미합니다.
ru: Значение <code>auto</code> означает, что браузер может свободно применять свое поведение касания по умолчанию (к указанной области), а значение <code>none</code> отключает поведение касания браузера по умолчанию для региона. Значения <code>pan-x</code> и <code>pan-y</code> означают, что касания, начинающиеся в указанной области, предназначены только для горизонтальной и вертикальной прокрутки соответственно. <code>manipulation</code> значениями означает, что браузер может учитывать касания, начинающиеся с элемента, только для прокрутки и масштабирования.
zh_cn: <code>auto</code> 值表示浏览器可以自由地将其默认触摸行为（应用于指定区域）， <code>none</code> 值禁用浏览器对该区域的默认触摸行为。值 <code>pan-x</code> 和 <code>pan-y</code> 表示分别从指定区域开始的触摸仅用于水平和垂直滚动。值 <code>manipulation</code> 意味着浏览器可以考虑从元素开始的触摸仅用于滚动和缩放。

source: A value of <code>false</code> indicates that the audio should continue to be transmitted regardless of whether or not speech is detected.
ja: <code>false</code> の値は、音声が検出されたかどうかに関係なく、オーディオが送信され続けることを示します。
ko: 값이 <code>false</code> 이면 음성 감지 여부에 관계없이 오디오가 계속 전송되어야 함을 나타냅니다.
ru: Значение <code>false</code> указывает, что звук должен продолжать передаваться независимо от того, обнаружена ли речь.
zh_cn: 值为 <code>false</code> 表示无论是否检测到语音，都应继续发送音频。

source: A value of any data type.
ja: 任意のデータ型の値。
ko: 모든 데이터 유형의 값
ru: Значение любого типа данных.
zh_cn: 任何数据类型的值。

source: A value of any type.
ja: 任意の型の値。
ko: 모든 유형의 값
ru: Значение любого типа.
zh_cn: 任何类型的值。

source: A value or <a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Object"><code>Object</code></a> indicating why the promise was rejected, as passed to <a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Promise/reject"><code>Promise.reject()</code></a>.
ja: <a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Promise/reject"> <code>Promise.reject()</code> に</a>渡された、プロミスが拒否された理由を示す値または<a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Object"> <code>Object</code> </a>。
ko: <a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Promise/reject"> <code>Promise.reject()</code> </a> 로 전달 된 약속이 거부 된 이유를 나타내는 값 또는 <a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Object"> <code>Object</code> </a> 입니다.
ru: Значение или <a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Object"> <code>Object</code> </a> указывающий, почему обещание было отклонено, как передано <a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Promise/reject"> <code>Promise.reject()</code> </a> .
zh_cn: 传递给<a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Promise/reject"> <code>Promise.reject()</code> </a>的值或<a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Object"> <code>Object</code> </a>指示为何拒绝承诺。

source: A value or object which provides information you can use to understand why the promise was rejected. This could be anything from an error code to an object with text, links, and whatever else you might wish to include.
ja: 約束が拒否された理由を理解するために使用できる情報を提供する値またはオブジェクト。これは、エラーコードからテキスト、リンク、その他何でも含むことができます。
ko: 약속이 거부 된 이유를 이해하는 데 사용할 수있는 정보를 제공하는 값 또는 개체입니다. 이것은 오류 코드부터 텍스트, 링크 및 기타 포함 할 수있는 객체에 이르기까지 다양합니다.
ru: Ценность или объект,который предоставляет информацию,которую вы можете использовать,чтобы понять,почему обещание было отклонено.Это может быть что угодно,начиная от кода ошибки и заканчивая объектом с текстом,ссылками и всем остальным,что вы захотите включить.
zh_cn: 一个值或对象,它提供了你可以用来了解为什么承诺被拒绝的信息。这可以是任何东西,从一个错误代码到一个包含文本、链接和其他任何你可能希望包含的对象。

source: A value specified for <code>input</code> or <code>output</code> is invalid, referring to a node which doesn't exist or outside the permitted range.
ja: <code>input</code> または <code>output</code> 指定された値が無効です。存在しないノードまたは許容範囲外のノードを参照しています。
ko: 존재하지 않거나 허용 범위를 벗어난 노드를 참조하여 <code>input</code> 또는 <code>output</code> 지정된 값 이 유효하지 않습니다.
ru: Значение, указанное для <code>input</code> или <code>output</code> , недопустимо, ссылаясь на узел, который не существует или находится за пределами допустимого диапазона.
zh_cn: 为 <code>input</code> 或 <code>output</code> 指定的值无效，指的是不存在或超出允许范围的节点。

source: A value that further specifies the value returned by the <a href="performanceentry/entrytype"><code>PerformanceEntry.entryType</code></a> property. The value of both depends on the subtype. See property page for valid values.
ja: <a href="performanceentry/entrytype"> <code>PerformanceEntry.entryType</code> </a>プロパティによって返される値をさらに指定する値。両方の値はサブタイプによって異なります。有効な値については、プロパティページを参照してください。
ko: <a href="performanceentry/entrytype"> <code>PerformanceEntry.entryType</code> </a> 속성에서 반환 한 값을 추가로 지정하는 값 입니다. 두 값 모두 하위 유형에 따라 다릅니다. 유효한 값은 속성 페이지를 참조하십시오.
ru: Значение, которое дополнительно указывает значение, возвращаемое свойством <a href="performanceentry/entrytype"> <code>PerformanceEntry.entryType</code> </a> . Значение обоих зависит от подтипа. Смотрите страницу свойств для правильных значений.
zh_cn: 该值进一步指定<a href="performanceentry/entrytype"> <code>PerformanceEntry.entryType</code> </a>属性返回的值。两者的值取决于子类型。请参阅属性页以获取有效值。

source: A value that is cloned and not shared is called <em>message</em>. As you will probably know by now, <em>messages</em> can be sent to and from the main thread by using <code>postMessage()</code>, and the <code>message</code> event's <a href="../messageevent/data"><code>data</code></a> attribute contains data passed back from the worker.
ja: 複製され、共有されない値は、<em>メッセージ</em>と呼ばれ<em>ます</em>。あなたはおそらく、今では知っているように、<em>メッセージが</em>使用してにし、メインスレッドから送信することができます <code>postMessage()</code> 、および <code>message</code> イベントの<a href="../messageevent/data"> <code>data</code> </a>属性は、バック労働者から渡されたデータが含まれています。
ko: 복제되고 공유되지 않은 값을 <em>message</em> 라고 <em>합니다</em> . 당신은 아마 지금 쯤 알 때, <em>메시지는</em> 사용에 의해 메인 스레드에서 보낼 수 <code>postMessage()</code> 하고, <code>message</code> 이벤트의 <a href="../messageevent/data"> <code>data</code> </a> 속성은 다시 노동자에서 전달되는 데이터가 포함되어 있습니다.
ru: Значение, которое клонируется и не используется совместно, называется <em>сообщением</em> . Как вы , наверное , уже знаете, <em>сообщения</em> могут быть отправлены и от основного потока с помощью <code>postMessage()</code> , и <code>message</code> мероприятия <a href="../messageevent/data"> <code>data</code> </a> атрибута содержит данные , передаваемые назад от работника.
zh_cn: 克隆但不共享的值称为<em>message</em>。正如你可能已经知道，<em>信息</em>可以通过发送和从主线程 <code>postMessage()</code> ，和 <code>message</code> 事件的<a href="../messageevent/data"> <code>data</code> </a>属性包含传递从工人回的数据。

source: A value that is or resolves to an <a href="../idbkeyrange"><code>IDBKeyRange</code></a>.
ja: <a href="../idbkeyrange"> <code>IDBKeyRange</code> </a>であるか、IDBKeyRangeに解決される値。
ko: <a href="../idbkeyrange"> <code>IDBKeyRange</code> 로</a> 해석되는 값입니다 .
ru: Значение, которое является или разрешается в <a href="../idbkeyrange"> <code>IDBKeyRange</code> </a> .
zh_cn: <a href="../idbkeyrange"> <code>IDBKeyRange</code> </a>或解析为IDBKeyRange的值。

source: A value was specified using the cm units defined in CSS2.
ja: CSS2 で定義されている cm 単位で値を指定した。
ko: CSS2에 정의 된 cm 단위를 사용하여 값을 지정했습니다.
ru: Значение было задано с помощью единиц измерения в сантиметрах,определенных в CSS2.
zh_cn: 使用CSS2中定义的cm单位指定了一个值。

source: A value was specified using the em units defined in CSS2.
ja: CSS2で定義されているem単位で値を指定しました。
ko: CSS2에 정의 된 em 단위를 사용하여 값을 지정했습니다.
ru: Значение было задано с помощью единиц эмуляции,определенных в CSS2.
zh_cn: 使用CSS2中定义的em单位指定了一个值。

source: A value was specified using the ex units defined in CSS2.
ja: CSS2 で定義されている ex 単位を使用して値を指定しました。
ko: CSS2에 정의 된 ex 단위를 사용하여 값을 지정했습니다.
ru: Значение было задано с помощью единиц ex,определенных в CSS2.
zh_cn: 使用CSS2中定义的ex单位指定了一个值。

source: A value was specified using the in units defined in CSS2.
ja: CSS2で定義されている単位で値を指定しました。
ko: CSS2에 정의 된 in 단위를 사용하여 값을 지정했습니다.
ru: Значение было задано с помощью единиц,определенных в CSS2.
zh_cn: 使用CSS2中定义的in单位指定了一个值。

source: A value was specified using the mm units defined in CSS2.
ja: CSS2 で定義されている mm 単位で値を指定した。
ko: CSS2에 정의 된 mm 단위를 사용하여 값을 지정했습니다.
ru: Значение было задано с помощью единиц мм,определенных в CSS2.
zh_cn: 使用CSS2中定义的mm单位指定了一个值。

source: A value was specified using the pc units defined in CSS2.
ja: CSS2 で定義されている pc 単位で値を指定しました。
ko: CSS2에 정의 된 pc 단위를 사용하여 값을 지정했습니다.
ru: Значение было задано с помощью единиц pc,определенных в CSS2.
zh_cn: 使用CSS2中定义的pc单位指定了一个值。

source: A value was specified using the pt units defined in CSS2.
ja: CSS2で定義されているpt単位で値を指定しました。
ko: CSS2에 정의 된 pt 단위를 사용하여 값을 지정했습니다.
ru: Значение было задано с помощью единиц pt,определенных в CSS2.
zh_cn: 使用CSS2中定义的pt单位指定了一个值。

source: A value was specified using the px units defined in CSS2.
ja: CSS2で定義されているpx単位で値を指定しました。
ko: CSS2에 정의 된 px 단위를 사용하여 값을 지정했습니다.
ru: Значение было задано с помощью единиц px,определенных в CSS2.
zh_cn: 使用CSS2中定义的px单位指定了一个值。

source: A variable to contain the data that will be transfered out of the device.
ja: デバイスから転送されるデータを格納する変数です。
ko: 장치에서 전송 될 데이터를 포함하는 변수입니다.
ru: Переменная,содержащая данные,которые будут переданы из устройства.
zh_cn: 一个包含将从设备中传输出来的数据的变量。

source: A variable to contain the length of the data that will be read back from the device. The actual data is in the <a href="https://developer.mozilla.org/en-US/docs/Web/API/USBInTransferResult"><code>USBInTransferResult</code></a> in the resolved Promise.
ja: デバイスから読み戻されるデータの長さを含む変数。実際のデータは、解決されたPromiseの<a href="https://developer.mozilla.org/en-US/docs/Web/API/USBInTransferResult"> <code>USBInTransferResult</code> </a>にあります。
ko: 장치에서 다시 읽을 데이터의 길이를 포함하는 변수입니다. 실제 데이터는 해결 된 약속 의 <a href="https://developer.mozilla.org/en-US/docs/Web/API/USBInTransferResult"> <code>USBInTransferResult</code> </a> 에 있습니다.
ru: Переменная для хранения длины данных, которые будут считываться с устройства. Фактические данные находятся в <a href="https://developer.mozilla.org/en-US/docs/Web/API/USBInTransferResult"> <code>USBInTransferResult</code> </a> в разрешенном Обещании .
zh_cn: 一个变量，包含将从设备读取的数据长度。实际数据位于已解决的Promise 中的<a href="https://developer.mozilla.org/en-US/docs/Web/API/USBInTransferResult"> <code>USBInTransferResult</code> </a>中。

source: A variable to hold the data returned by the transfer.
ja: 転送によって返されたデータを保持するための変数です。
ko: 전송에서 리턴 된 데이터를 보유하는 변수입니다.
ru: Переменная для хранения данных,возвращаемых при передаче.
zh_cn: 一个变量,用于保存传输返回的数据。

source: A variant of the <code>send()</code> method that sends binary data.
ja: バイナリデータを送信する <code>send()</code> メソッドのバリアント。
ko: 이진 데이터를 보내는 <code>send()</code> 메서드 의 변형입니다 .
ru: Вариант метода <code>send()</code> который отправляет двоичные данные.
zh_cn: <code>send()</code> 方法的一种变体，用于发送二进制数据。

source: A version of the main video track with captions burnt in.
ja: メインのビデオトラックにキャプションを埋め込んだバージョン。
ko: 캡션이 포함 된 기본 비디오 트랙 버전입니다.
ru: Версия основного видео трека с выжженными подписями.
zh_cn: 主视频轨的版本,并刻录了字幕。

source: A version of the main video track with subtitles burnt in.
ja: メインのビデオトラックに字幕が焼き付けられたバージョン。
ko: 자막이 포함 된 기본 비디오 트랙 버전입니다.
ru: Версия основного видео трека с субтитрами сгорела.
zh_cn: 主视频轨的版本,并刻录了字幕。

source: A very basic color animation, done by clearing the <a href="https://developer.mozilla.org/en-US/docs/Glossary/WebGL">WebGL</a> drawing buffer with a different random color every second.
ja: 毎秒異なるランダムカラーで<a href="https://developer.mozilla.org/en-US/docs/Glossary/WebGL">WebGL</a>描画バッファーをクリアすることによって行われる、非常に基本的なカラーアニメーション。
ko: 매초마다 다른 임의의 색상으로 <a href="https://developer.mozilla.org/en-US/docs/Glossary/WebGL">WebGL</a> 그리기 버퍼를 지워서 수행되는 매우 기본적인 색상 애니메이션 입니다.
ru: Очень простая цветовая анимация, выполняемая путем очистки буфера рисования <a href="https://developer.mozilla.org/en-US/docs/Glossary/WebGL">WebGL</a> разным случайным цветом каждую секунду.
zh_cn: 一种非常基本的彩色动画，通过每秒用不同的随机颜色清除<a href="https://developer.mozilla.org/en-US/docs/Glossary/WebGL">WebGL</a>绘图缓冲区来完成。

source: A very basic shader program that draws a solid color square.
ja: ソリッドカラーの正方形を描く、とても基本的なシェーダプログラムです。
ko: 단색 사각형을 그리는 매우 기본적인 셰이더 프로그램입니다.
ru: Очень базовая шейдерная программа,которая рисует сплошной цветной квадрат.
zh_cn: 一个非常基本的着色器程序,可以绘制一个纯色的方块。
