Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/dom/dom.*.007.xlf
Languages: es, ko, ru, zh_cn

source: <em>This interface does not provide any specific methods, but implements those of its parent, <a href="svgelement"><code>SVGElement</code></a>, and also implements methods of <a href="svgfilterprimitivestandardattributes"><code>SVGFilterPrimitiveStandardAttributes</code></a>.</em>
es: <em>Esta interfaz no proporciona ning&uacute;n m&eacute;todo espec&iacute;fico, pero implementa los de su padre, <a href="svgelement"> <code>SVGElement</code> </a> , y tambi&eacute;n implementa los m&eacute;todos de <a href="svgfilterprimitivestandardattributes"> <code>SVGFilterPrimitiveStandardAttributes</code> </a> .</em>
ko: <em>이 인터페이스는 특정 메소드를 제공하지 않지만 상위 <a href="svgelement"> <code>SVGElement</code> </a> 메소드를 구현하고 <a href="svgfilterprimitivestandardattributes"> <code>SVGFilterPrimitiveStandardAttributes</code> </a> 메소드도 구현합니다 .</em>
ru: <em>Этот интерфейс не предоставляет каких-либо конкретных методов, но реализует методы его родителя <a href="svgelement"> <code>SVGElement</code> </a> , а также реализует методы <a href="svgfilterprimitivestandardattributes"> <code>SVGFilterPrimitiveStandardAttributes</code> </a> .</em>
zh_cn: <em>该接口不提供任何特定方法，但实现其父级<a href="svgelement"> <code>SVGElement</code> 的</a>方法，并且还实现<a href="svgfilterprimitivestandardattributes"> <code>SVGFilterPrimitiveStandardAttributes</code> 的</a>方法。</em>

source: <em>This interface does not provide any specific methods, but implements those of its parent, <a href="svgelement"><code>SVGElement</code></a>, and implements methods of <a href="svgfilterprimitivestandardattributes"><code>SVGFilterPrimitiveStandardAttributes</code></a>.</em>
es: <em>Esta interfaz no proporciona ning&uacute;n m&eacute;todo espec&iacute;fico, pero implementa los de su padre, <a href="svgelement"> <code>SVGElement</code> </a> , e implementa m&eacute;todos de <a href="svgfilterprimitivestandardattributes"> <code>SVGFilterPrimitiveStandardAttributes</code> </a> .</em>
ko: <em>이 인터페이스는 특정 메소드를 제공하지 않지만 상위 <a href="svgelement"> <code>SVGElement</code> </a> 메소드를 구현하고 <a href="svgfilterprimitivestandardattributes"> <code>SVGFilterPrimitiveStandardAttributes</code> </a> 메소드를 구현합니다 .</em>
ru: <em>Этот интерфейс не предоставляет никаких конкретных методов, но реализует методы его родителя, <a href="svgelement"> <code>SVGElement</code> </a> , и реализует методы <a href="svgfilterprimitivestandardattributes"> <code>SVGFilterPrimitiveStandardAttributes</code> </a> .</em>
zh_cn: <em>该接口不提供任何特定方法，但是实现其父级<a href="svgelement"> <code>SVGElement</code> 的</a>方法，并实现<a href="svgfilterprimitivestandardattributes"> <code>SVGFilterPrimitiveStandardAttributes</code> 的</a>方法。</em>

source: <em>This interface does not provide any specific methods, but implements those of its parent, <a href="svgelement"><code>SVGElement</code></a>, and implements methods of <a href="svgfilterprimitivestandardattributes"><code>SVGFilterPrimitiveStandardAttributes</code></a>and <a href="svgurireference"><code>SVGURIReference</code></a>.</em>
es: <em>Esta interfaz no proporciona ning&uacute;n m&eacute;todo espec&iacute;fico, pero implementa los de su padre, <a href="svgelement"> <code>SVGElement</code> </a> , e implementa m&eacute;todos de <a href="svgfilterprimitivestandardattributes"> <code>SVGFilterPrimitiveStandardAttributes</code> </a> y <a href="svgurireference"> <code>SVGURIReference</code> </a> .</em>
ko: <em>이 인터페이스는 특정 방법을 제공하지 않지만, 구현 부모의 그 <a href="svgelement"> <code>SVGElement</code> </a> , 그리고 구현 방법 <a href="svgfilterprimitivestandardattributes"> <code>SVGFilterPrimitiveStandardAttributes</code> </a> 및 <a href="svgurireference"> <code>SVGURIReference</code> </a> .</em>
ru: <em>Этот интерфейс не предоставляет никаких конкретных методов, но реализует методы его родителя <a href="svgelement"> <code>SVGElement</code> </a> и реализует методы <a href="svgfilterprimitivestandardattributes"> <code>SVGFilterPrimitiveStandardAttributes</code> </a> и <a href="svgurireference"> <code>SVGURIReference</code> </a> .</em>
zh_cn: <em>该接口不提供任何特定方法，但实现其父级<a href="svgelement"> <code>SVGElement</code> 的</a>方法，并实现<a href="svgfilterprimitivestandardattributes"> <code>SVGFilterPrimitiveStandardAttributes</code> </a>和<a href="svgurireference"> <code>SVGURIReference</code> 的</a>方法。</em>

source: <em>This interface does not provide any specific methods, but implements those of its parent, <a href="svgelement"><code>SVGElement</code></a>.</em>
es: <em>Esta interfaz no proporciona ning&uacute;n m&eacute;todo espec&iacute;fico, pero implementa los de su padre, <a href="svgelement"> <code>SVGElement</code> </a> .</em>
ko: <em>이 인터페이스는 특정 메소드를 제공하지 않지만 상위 <a href="svgelement"> <code>SVGElement</code> </a> 메소드를 구현합니다 .</em>
ru: <em>Этот интерфейс не предоставляет никаких конкретных методов, но реализует методы его родителя, <a href="svgelement"> <code>SVGElement</code> </a> .</em>
zh_cn: <em>该接口不提供任何特定方法，但是实现其父级<a href="svgelement"> <code>SVGElement</code> 的方法</a>。</em>

source: <em>This interface does not provide any specific methods, but implements those of its parent, <a href="svgelement"><code>SVGElement</code></a></em><em>, and also implements methods of <a href="svgfilterprimitivestandardattributes"><code>SVGFilterPrimitiveStandardAttributes</code></a>.</em>
es: <em>Esta interfaz no proporciona ning&uacute;n m&eacute;todo espec&iacute;fico, pero implementa los de su padre, <a href="svgelement"> <code>SVGElement</code> </a></em><em> , y tambi&eacute;n implementa los m&eacute;todos de <a href="svgfilterprimitivestandardattributes"> <code>SVGFilterPrimitiveStandardAttributes</code> </a> .</em>
ko: <em>이 인터페이스는 특정 메소드를 제공하지 않지만 상위 <a href="svgelement"> <code>SVGElement</code> </a></em><em> 메소드를 구현하고 <a href="svgfilterprimitivestandardattributes"> <code>SVGFilterPrimitiveStandardAttributes</code> </a> 메소드도 구현합니다 .</em>
ru: <em>Этот интерфейс не предоставляет каких-либо конкретных методов, но реализует методы его родителя <a href="svgelement"> <code>SVGElement</code> </a></em><em> , а также реализует методы <a href="svgfilterprimitivestandardattributes"> <code>SVGFilterPrimitiveStandardAttributes</code> </a> .</em>
zh_cn: <em>该接口不提供任何特定方法，但实现其父级<a href="svgelement"> <code>SVGElement</code> 的</a></em><em>方法，并且还实现<a href="svgfilterprimitivestandardattributes"> <code>SVGFilterPrimitiveStandardAttributes</code> 的</a>方法。</em>

source: <em>This interface does not provide any specific methods, but implements those of its parent, <a href="svgtextcontentelement"><code>SVGTextContentElement</code></a>, and also implements methods of <a href="svgurireference"><code>SVGURIReference</code></a>.</em>
es: <em>Esta interfaz no proporciona ning&uacute;n m&eacute;todo espec&iacute;fico, pero implementa los de su padre, <a href="svgtextcontentelement"> <code>SVGTextContentElement</code> </a> , y tambi&eacute;n implementa m&eacute;todos de <a href="svgurireference"> <code>SVGURIReference</code> </a> .</em>
ko: <em>이 인터페이스는 특정 메소드를 제공하지 않지만 상위 <a href="svgtextcontentelement"> <code>SVGTextContentElement</code> </a> 메소드를 구현하고 <a href="svgurireference"> <code>SVGURIReference</code> </a> 메소드도 구현합니다 .</em>
ru: <em>Этот интерфейс не предоставляет никаких конкретных методов, но реализует методы его родителя <a href="svgtextcontentelement"> <code>SVGTextContentElement</code> </a> , а также реализует методы <a href="svgurireference"> <code>SVGURIReference</code> </a> .</em>
zh_cn: <em>该接口不提供任何特定方法，但是实现其父级<a href="svgtextcontentelement"> <code>SVGTextContentElement</code> 的</a>方法，并且还实现<a href="svgurireference"> <code>SVGURIReference</code> 的</a>方法。</em>

source: <em>This interface does not provide any specific methods.</em>
es: <em>Esta interfaz no proporciona ning&uacute;n m&eacute;todo espec&iacute;fico.</em>
ko: <em>이 인터페이스는 특정 방법을 제공하지 않습니다.</em>
ru: <em>Этот интерфейс не предоставляет никаких конкретных методов.</em>
zh_cn: <em>该接口不提供任何特定方法。</em>

source: <em>This interface doesn't define any methods, but inherits methods from its parents, <a href="mouseevent"><code>MouseEvent</code></a>, <a href="uievent"><code>UIEvent</code></a> and <a href="event"><code>Event</code></a>.</em>
es: <em>Esta interfaz no define ning&uacute;n m&eacute;todo, pero hereda los m&eacute;todos de sus padres, <a href="mouseevent"> <code>MouseEvent</code> </a> , <a href="uievent"> <code>UIEvent</code> </a> y <a href="event"> <code>Event</code> </a> .</em>
ko: <em>이 인터페이스는 메소드를 정의하지 않지만 부모, <a href="mouseevent"> <code>MouseEvent</code> </a> , <a href="uievent"> <code>UIEvent</code> </a> 및 <a href="event"> <code>Event</code> </a> 에서 메소드를 상속합니다 .</em>
ru: <em>Этот интерфейс не определяет никаких методов, но наследует методы от своих родителей, <a href="mouseevent"> <code>MouseEvent</code> </a> , <a href="uievent"> <code>UIEvent</code> </a> и <a href="event"> <code>Event</code> </a> .</em>
zh_cn: <em>此接口未定义任何方法，但从其父项<a href="mouseevent"> <code>MouseEvent</code> </a>，<a href="uievent"> <code>UIEvent</code> </a>和<a href="event"> <code>Event</code> </a>继承方法。</em>

source: <em>This interface doesn't define any own methods, but inherits methods from its parent interface, <a href="event"><code>Event</code></a>.</em>
es: <em>Esta interfaz no define ning&uacute;n m&eacute;todo propio, pero hereda los m&eacute;todos de su interfaz principal, <a href="event"> <code>Event</code> o</a> .</em>
ko: <em>이 인터페이스는 자체 메소드를 정의하지 않지만 상위 인터페이스 <a href="event"> <code>Event</code> </a> 에서 메소드를 상속합니다 .</em>
ru: <em>Этот интерфейс не определяет никаких собственных методов, но наследует методы от своего родительского интерфейса, <a href="event"> <code>Event</code> </a> .</em>
zh_cn: <em>该接口没有定义任何自己的方法，但是从其父接口<a href="event"> <code>Event</code> </a>继承方法。</em>

source: <em>This interface doesn't define any properties of its own, but it does inherit the properties of its parent interface, <a href="https://developer.mozilla.org/en-US/docs/Web/API/VRDisplay"><code>VRDevice</code></a>.</em>
es: <em>Esta interfaz no define ninguna propiedad propia, pero hereda las propiedades de su interfaz principal, <a href="https://developer.mozilla.org/en-US/docs/Web/API/VRDisplay"> <code>VRDevice</code> </a> .</em>
ko: <em>이 인터페이스는 자체 속성을 정의하지 않지만 상위 인터페이스 <a href="https://developer.mozilla.org/en-US/docs/Web/API/VRDisplay"> <code>VRDevice</code> </a> 의 속성을 상속합니다 .</em>
ru: <em>Этот интерфейс не определяет свои собственные свойства, но он наследует свойства своего родительского интерфейса, <a href="https://developer.mozilla.org/en-US/docs/Web/API/VRDisplay"> <code>VRDevice</code> </a> .</em>
zh_cn: <em>该接口没有定义其自己的任何属性，但确实继承了其父接口<a href="https://developer.mozilla.org/en-US/docs/Web/API/VRDisplay"> <code>VRDevice</code> </a>的属性。</em>

source: <em>This interface doesn't implement any specific method but inherits methods from its parent <a href="cssrule"><code>CSSRule</code></a>.</em>
es: <em>Esta interfaz no implementa ning&uacute;n m&eacute;todo espec&iacute;fico, pero hereda m&eacute;todos de su <a href="cssrule"> <code>CSSRule</code> </a> padre .</em>
ko: <em>이 인터페이스는 특정 메소드를 구현하지 않지만 상위 <a href="cssrule"> <code>CSSRule</code> </a> 에서 메소드를 상속합니다 .</em>
ru: <em>Этот интерфейс не реализует какой-либо конкретный метод, но наследует методы от своего родительского <a href="cssrule"> <code>CSSRule</code> </a> .</em>
zh_cn: <em>此接口未实现任何特定的方法，但会从其父<a href="cssrule"> <code>CSSRule</code> </a>继承方法。</em>

source: <em>This interface doesn't implement any specific methods, <em>but inherits methods from its parent, <a href="svggeometryelement"><code>SVGGeometryElement</code></a>.</em></em>
es: <em>Esta interfaz no implementa ning&uacute;n m&eacute;todo espec&iacute;fico, <em>pero hereda m&eacute;todos de su padre, <a href="svggeometryelement"> <code>SVGGeometryElement</code> </a> .</em></em>
ko: <em>이 인터페이스는 특정 메소드를 구현하지 않지만 <em>상위 <a href="svggeometryelement"> <code>SVGGeometryElement</code> </a> 에서 메소드를 상속합니다 .</em></em>
ru: <em>Этот интерфейс не реализует никаких конкретных методов, <em>но наследует методы от своего родителя, <a href="svggeometryelement"> <code>SVGGeometryElement</code> </a> .</em></em>
zh_cn: <em>该接口未实现任何特定的方法，<em>但会从其父级<a href="svggeometryelement"> <code>SVGGeometryElement</code> </a>继承方法。</em></em>

source: <em>This interface doesn't implement any specific methods, but inherits methods from its parent interface, <a href="svganimationelement"><code>SVGAnimationElement</code></a>.</em>
es: <em>Esta interfaz no implementa ning&uacute;n m&eacute;todo espec&iacute;fico, pero hereda m&eacute;todos de su interfaz principal, <a href="svganimationelement"> <code>SVGAnimationElement</code> </a> .</em>
ko: <em>이 인터페이스는 특정 메소드를 구현하지 않지만 상위 인터페이스 <a href="svganimationelement"> <code>SVGAnimationElement</code> </a> 에서 메소드를 상속합니다 .</em>
ru: <em>Этот интерфейс не реализует никаких конкретных методов, но наследует методы от своего родительского интерфейса, <a href="svganimationelement"> <code>SVGAnimationElement</code> </a> .</em>
zh_cn: <em>该接口没有实现任何特定的方法，但是从其父接口<a href="svganimationelement"> <code>SVGAnimationElement</code> </a>继承了方法。</em>

source: <em>This interface doesn't implement any specific methods, but inherits methods from its parent interface, <a href="svgelement"><code>SVGElement</code></a> and implements methods from <a href="linkstyle"><code>LinkStyle</code></a>.</em>
es: <em>Esta interfaz no implementa ning&uacute;n m&eacute;todo espec&iacute;fico, pero hereda m&eacute;todos de su interfaz principal, <a href="svgelement"> <code>SVGElement</code> </a> e implementa m&eacute;todos de <a href="linkstyle"> <code>LinkStyle</code> </a> .</em>
ko: <em>이 인터페이스는 특정 메소드를 구현하지 않지만 상위 인터페이스 <a href="svgelement"> <code>SVGElement</code> </a> 에서 메소드를 상속 하고 <a href="linkstyle"> <code>LinkStyle</code> </a> 에서 메소드를 구현합니다 .</em>
ru: <em>Этот интерфейс не реализует никаких конкретных методов, но наследует методы от его родительского интерфейса <a href="svgelement"> <code>SVGElement</code> </a> и реализует методы из <a href="linkstyle"> <code>LinkStyle</code> </a> .</em>
zh_cn: <em>该接口没有实现任何特定的方法，但是从其父接口<a href="svgelement"> <code>SVGElement</code> </a>继承方法，并从<a href="linkstyle"> <code>LinkStyle</code> </a>实现方法。</em>

source: <em>This interface doesn't implement any specific methods, but inherits methods from its parent interface, <a href="svgelement"><code>SVGElement</code></a> and implements the ones from <a href="https://developer.mozilla.org/en-US/docs/Web/API/SVGFitToViewBox"><code>SVGFitToViewBox</code></a> and <a href="svgurireference"><code>SVGURIReference</code></a></em>.
es: <em>Esta interfaz no implementa ning&uacute;n m&eacute;todo espec&iacute;fico, pero hereda m&eacute;todos de su interfaz principal, <a href="svgelement"> <code>SVGElement</code> </a> e implementa los de <a href="https://developer.mozilla.org/en-US/docs/Web/API/SVGFitToViewBox"> <code>SVGFitToViewBox</code> </a> y <a href="svgurireference"> <code>SVGURIReference</code> </a></em> .
ko: <em>이 인터페이스는 부모 인터페이스에서 특정 방법,하지만 상속 방법을 구현하지 않습니다 <a href="svgelement"> <code>SVGElement</code> </a> 및 구현에서 사람 <a href="https://developer.mozilla.org/en-US/docs/Web/API/SVGFitToViewBox"> <code>SVGFitToViewBox</code> </a> 및 <a href="svgurireference"> <code>SVGURIReference</code> 을</a></em> .
ru: <em>Этот интерфейс не реализует никаких конкретных методов, но наследует методы от своего родительского интерфейса, <a href="svgelement"> <code>SVGElement</code> ,</a> и реализует <a href="https://developer.mozilla.org/en-US/docs/Web/API/SVGFitToViewBox"> <code>SVGFitToViewBox</code> </a> из SVGFitToViewBox и <a href="svgurireference"> <code>SVGURIReference</code> </a></em> .
zh_cn: <em>该接口没有实现任何特定的方法，但是从其父接口<a href="svgelement"> <code>SVGElement</code> </a>继承了方法，并从<a href="https://developer.mozilla.org/en-US/docs/Web/API/SVGFitToViewBox"> <code>SVGFitToViewBox</code> </a>和<a href="svgurireference"> <code>SVGURIReference</code> </a></em><em>实现了这些</em><em>方法</em>。

source: <em>This interface doesn't implement any specific methods, but inherits methods from its parent interface, <a href="svgelement"><code>SVGElement</code></a>, and implements methods from <a href="svgfilterprimitivestandardattributes"><code>SVGFilterPrimitiveStandardAttributes</code></a>.</em>
es: <em>Esta interfaz no implementa ning&uacute;n m&eacute;todo espec&iacute;fico, pero hereda m&eacute;todos de su interfaz principal, <a href="svgelement"> <code>SVGElement</code> </a> , e implementa m&eacute;todos de <a href="svgfilterprimitivestandardattributes"> <code>SVGFilterPrimitiveStandardAttributes</code> </a> .</em>
ko: <em>이 인터페이스는 특정 방법,하지만 부모 인터페이스에서 상속 방법을 구현하지 않습니다 <a href="svgelement"> <code>SVGElement</code> </a> 에서, 및 구현 방법 <a href="svgfilterprimitivestandardattributes"> <code>SVGFilterPrimitiveStandardAttributes</code> 을</a> .</em>
ru: <em>Этот интерфейс не реализует никаких конкретных методов, но наследует методы от его родительского интерфейса, <a href="svgelement"> <code>SVGElement</code> </a> , и реализует методы из <a href="svgfilterprimitivestandardattributes"> <code>SVGFilterPrimitiveStandardAttributes</code> </a> .</em>
zh_cn: <em>该接口不实现任何特定的方法，但是从其父接口<a href="svgelement"> <code>SVGElement</code> </a>继承方法，并从<a href="svgfilterprimitivestandardattributes"> <code>SVGFilterPrimitiveStandardAttributes</code> </a>实现方法。</em>

source: <em>This interface doesn't implement any specific methods, but inherits methods from its parent interface, <a href="svgelement"><code>SVGElement</code></a>.</em>
es: <em>Esta interfaz no implementa ning&uacute;n m&eacute;todo espec&iacute;fico, pero hereda m&eacute;todos de su interfaz principal, <a href="svgelement"> <code>SVGElement</code> </a> .</em>
ko: <em>이 인터페이스는 특정 메소드를 구현하지 않지만 상위 인터페이스 <a href="svgelement"> <code>SVGElement</code> </a> 에서 메소드를 상속합니다 .</em>
ru: <em>Этот интерфейс не реализует никаких конкретных методов, но наследует методы от своего родительского интерфейса <a href="svgelement"> <code>SVGElement</code> </a> .</em>
zh_cn: <em>该接口未实现任何特定的方法，但会从其父接口<a href="svgelement"> <code>SVGElement</code> </a>继承方法。</em>

source: <em>This interface doesn't implement any specific methods, but inherits methods from its parent interface, <a href="svggeometryelement"><code>SVGGeometryElement</code></a>, and implements the methods of <a href="svgurireference"><code>SVGURIReference</code></a>.</em>
es: <em>Esta interfaz no implementa ning&uacute;n m&eacute;todo espec&iacute;fico, pero hereda m&eacute;todos de su interfaz principal, <a href="svggeometryelement"> <code>SVGGeometryElement</code> </a> , e implementa los m&eacute;todos de <a href="svgurireference"> <code>SVGURIReference</code> </a> .</em>
ko: <em>이 인터페이스는 특정 방법,하지만 부모 인터페이스에서 상속 방법을 구현하지 않습니다 <a href="svggeometryelement"> <code>SVGGeometryElement</code> </a> 및 구현의 방법 <a href="svgurireference"> <code>SVGURIReference</code> 을</a> .</em>
ru: <em>Этот интерфейс не реализует никаких конкретных методов, но наследует методы от его родительского интерфейса <a href="svggeometryelement"> <code>SVGGeometryElement</code> </a> и реализует методы <a href="svgurireference"> <code>SVGURIReference</code> </a> .</em>
zh_cn: <em>该接口没有实现任何特定的方法，但是从其父接口<a href="svggeometryelement"> <code>SVGGeometryElement</code> </a>继承了方法，并实现了<a href="svgurireference"> <code>SVGURIReference</code> </a>的方法。</em>

source: <em>This interface doesn't implement any specific methods, but inherits methods from its parent interface, <a href="svggeometryelement"><code>SVGGeometryElement</code></a>.</em>
es: <em>Esta interfaz no implementa ning&uacute;n m&eacute;todo espec&iacute;fico, pero hereda m&eacute;todos de su interfaz principal, <a href="svggeometryelement"> <code>SVGGeometryElement</code> </a> .</em>
ko: <em>이 인터페이스는 특정 메소드를 구현하지 않지만 상위 인터페이스 <a href="svggeometryelement"> <code>SVGGeometryElement</code> </a> 에서 메소드를 상속합니다 .</em>
ru: <em>Этот интерфейс не реализует никаких конкретных методов, но наследует методы от своего родительского интерфейса, <a href="svggeometryelement"> <code>SVGGeometryElement</code> </a> .</em>
zh_cn: <em>该接口没有实现任何特定的方法，但是从其父接口<a href="svggeometryelement"> <code>SVGGeometryElement</code> </a>继承了方法。</em>

source: <em>This interface doesn't implement any specific methods, but inherits methods from its parent interface, <a href="svggradientelement"><code>SVGGradientElement</code></a>.</em>
es: <em>Esta interfaz no implementa ning&uacute;n m&eacute;todo espec&iacute;fico, pero hereda m&eacute;todos de su interfaz principal, <a href="svggradientelement"> <code>SVGGradientElement</code> </a> .</em>
ko: <em>이 인터페이스는 특정 메소드를 구현하지 않지만 상위 인터페이스 <a href="svggradientelement"> <code>SVGGradientElement</code> </a> 에서 메소드를 상속합니다 .</em>
ru: <em>Этот интерфейс не реализует никаких конкретных методов, но наследует методы от своего родительского интерфейса <a href="svggradientelement"> <code>SVGGradientElement</code> </a> .</em>
zh_cn: <em>该接口没有实现任何特定的方法，但是从其父接口<a href="svggradientelement"> <code>SVGGradientElement</code> </a>继承方法。</em>

source: <em>This interface doesn't implement any specific methods, but inherits methods from its parent interface, <a href="svggraphicselement"><code>SVGGraphicsElement</code></a> and implements methods from <a href="svgurireference"><code>SVGURIReference</code></a>.</em>
es: <em>Esta interfaz no implementa ning&uacute;n m&eacute;todo espec&iacute;fico, pero hereda m&eacute;todos de su interfaz principal, <a href="svggraphicselement"> <code>SVGGraphicsElement</code> </a> e implementa m&eacute;todos de <a href="svgurireference"> <code>SVGURIReference</code> </a> .</em>
ko: <em>이 인터페이스는 특정 메소드를 구현하지 않지만 상위 인터페이스 <a href="svggraphicselement"> <code>SVGGraphicsElement</code> </a> 에서 메소드를 상속 하고 <a href="svgurireference"> <code>SVGURIReference</code> 의</a> 메소드를 구현합니다 .</em>
ru: <em>Этот интерфейс не реализует никаких конкретных методов, но наследует методы от его родительского интерфейса <a href="svggraphicselement"> <code>SVGGraphicsElement</code> </a> и реализует методы из <a href="svgurireference"> <code>SVGURIReference</code> </a> .</em>
zh_cn: <em>该接口不实现任何特定的方法，但是从其父接口<a href="svggraphicselement"> <code>SVGGraphicsElement</code> </a>继承方法，并从<a href="svgurireference"> <code>SVGURIReference</code> </a>实现方法。</em>

source: <em>This interface doesn't implement any specific methods, but inherits methods from its parent interface, <a href="svggraphicselement"><code>SVGGraphicsElement</code></a>, and implements methods from <a href="https://developer.mozilla.org/en-US/docs/Web/API/SVGFitToViewBox"><code>SVGFitToViewBox</code></a>.</em>
es: <em>Esta interfaz no implementa ning&uacute;n m&eacute;todo espec&iacute;fico, pero hereda m&eacute;todos de su interfaz principal, <a href="svggraphicselement"> <code>SVGGraphicsElement</code> </a> , e implementa m&eacute;todos de <a href="https://developer.mozilla.org/en-US/docs/Web/API/SVGFitToViewBox"> <code>SVGFitToViewBox</code> </a> .</em>
ko: <em>이 인터페이스는 특정 방법,하지만 부모 인터페이스에서 상속 방법을 구현하지 않습니다 <a href="svggraphicselement"> <code>SVGGraphicsElement</code> </a> 에서, 및 구현 방법 <a href="https://developer.mozilla.org/en-US/docs/Web/API/SVGFitToViewBox"> <code>SVGFitToViewBox</code> 을</a> .</em>
ru: <em>Этот интерфейс не реализует никаких конкретных методов, но наследует методы от его родительского интерфейса <a href="svggraphicselement"> <code>SVGGraphicsElement</code> </a> и реализует методы из <a href="https://developer.mozilla.org/en-US/docs/Web/API/SVGFitToViewBox"> <code>SVGFitToViewBox</code> </a> .</em>
zh_cn: <em>该接口不实现任何特定的方法，但是从其父接口<a href="svggraphicselement"> <code>SVGGraphicsElement</code> </a>继承方法，并从<a href="https://developer.mozilla.org/en-US/docs/Web/API/SVGFitToViewBox"> <code>SVGFitToViewBox</code> </a>实现方法。</em>
