Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/dom/dom.*.007.xlf
Languages: es, ko, ru, zh_cn

source: <em>This interface also inherits properties from its parent interface, <a href="svggeometryelement"><code>SVGGeometryElement</code></a>.</em>
es: <em>Esta interfaz tambi&eacute;n hereda propiedades de su interfaz principal, <a href="svggeometryelement"> <code>SVGGeometryElement</code> </a> .</em>
ko: <em>이 인터페이스는 상위 인터페이스 <a href="svggeometryelement"> <code>SVGGeometryElement</code> </a> 에서 속성을 상속합니다 .</em>
ru: <em>Этот интерфейс также наследует свойства от своего родительского интерфейса, <a href="svggeometryelement"> <code>SVGGeometryElement</code> </a> .</em>
zh_cn: <em>此接口还从其父接口<a href="svggeometryelement"> <code>SVGGeometryElement</code> </a>继承属性。</em>

source: <em>This interface also inherits properties from its parent interface, <a href="svggraphicselement"><code>SVGGraphicsElement</code></a> and implements properties from <a href="svgurireference"><code>SVGURIReference</code></a>.</em>
es: <em>Esta interfaz tambi&eacute;n hereda propiedades de su interfaz principal, <a href="svggraphicselement"> <code>SVGGraphicsElement</code> </a> e implementa propiedades de <a href="svgurireference"> <code>SVGURIReference</code> </a> .</em>
ko: <em>이 인터페이스는 또한 부모 인터페이스에서 속성 상속 <a href="svggraphicselement"> <code>SVGGraphicsElement</code> </a> 에서와 구현 속성 <a href="svgurireference"> <code>SVGURIReference</code> 을</a> .</em>
ru: <em>Этот интерфейс также наследует свойства из своего родительского интерфейса <a href="svggraphicselement"> <code>SVGGraphicsElement</code> </a> и реализует свойства из <a href="svgurireference"> <code>SVGURIReference</code> </a> .</em>
zh_cn: <em>该接口还从其父接口<a href="svggraphicselement"> <code>SVGGraphicsElement</code> </a>继承属性，并从<a href="svgurireference"> <code>SVGURIReference</code> </a>实现属性。</em>

source: <em>This interface also inherits properties from its parent interface, <a href="svgtextcontentelement"><code>SVGTextContentElement</code></a>, and also implements properties of <a href="svgurireference"><code>SVGURIReference</code></a>.</em>
es: <em>Esta interfaz tambi&eacute;n hereda propiedades de su interfaz principal, <a href="svgtextcontentelement"> <code>SVGTextContentElement</code> </a> , y tambi&eacute;n implementa propiedades de <a href="svgurireference"> <code>SVGURIReference</code> </a> .</em>
ko: <em>이 인터페이스는 또한 부모 인터페이스에서 속성 상속 <a href="svgtextcontentelement"> <code>SVGTextContentElement</code> </a> 도, 그리고 구현 속성 <a href="svgurireference"> <code>SVGURIReference</code> 을</a> .</em>
ru: <em>Этот интерфейс также наследует свойства от своего родительского интерфейса <a href="svgtextcontentelement"> <code>SVGTextContentElement</code> </a> , а также реализует свойства <a href="svgurireference"> <code>SVGURIReference</code> </a> .</em>
zh_cn: <em>此接口还从其父接口<a href="svgtextcontentelement"> <code>SVGTextContentElement</code> </a>继承属性，并且还实现<a href="svgurireference"> <code>SVGURIReference</code> 的</a>属性。</em>

source: <em>This interface also inherits properties from its parent, </em><em><a href="svgelement"><code>SVGElement</code></a> and implements the ones from <a href="https://developer.mozilla.org/en-US/docs/Web/API/SVGFitToViewBox"><code>SVGFitToViewBox</code></a> and <a href="svgurireference"><code>SVGURIReference</code></a>.</em>
es: <em>Esta interfaz tambi&eacute;n hereda propiedades de su padre, </em><em><a href="svgelement"> <code>SVGElement</code> </a> e implementa las de <a href="https://developer.mozilla.org/en-US/docs/Web/API/SVGFitToViewBox"> <code>SVGFitToViewBox</code> </a> y <a href="svgurireference"> <code>SVGURIReference</code> </a> .</em>
ko: <em>이 인터페이스는 또한 부모로부터 속성을 상속 </em><em><a href="svgelement"> <code>SVGElement</code> </a> 및 구현에서 사람 <a href="https://developer.mozilla.org/en-US/docs/Web/API/SVGFitToViewBox"> <code>SVGFitToViewBox</code> </a> 및 <a href="svgurireference"> <code>SVGURIReference</code> 을</a> .</em>
ru: <em>Этот интерфейс также наследует свойства от своего родителя </em><em><a href="svgelement"> <code>SVGElement</code> </a></em><em> и реализует </em><em>свойства </em><em>из </em><em><a href="https://developer.mozilla.org/en-US/docs/Web/API/SVGFitToViewBox"> <code>SVGFitToViewBox</code> </a></em><em> и </em><em><a href="svgurireference"> <code>SVGURIReference</code> </a></em><em> .</em><em></em>
zh_cn: <em>此接口还从其父级</em><em><a href="svgelement"> <code>SVGElement</code> </a></em><em>继承属性，</em><em>并从</em><em><a href="https://developer.mozilla.org/en-US/docs/Web/API/SVGFitToViewBox"> <code>SVGFitToViewBox</code> </a></em><em>和</em><em><a href="svgurireference"> <code>SVGURIReference</code> </a></em><em>实现这些</em><em>属性</em><em>。</em><em></em>

source: <em>This interface also inherits properties from its parent, </em><em><a href="svgelement"><code>SVGElement</code></a>.</em>
es: <em>Esta interfaz tambi&eacute;n hereda propiedades de su padre, </em><em><a href="svgelement"> <code>SVGElement</code> </a> .</em>
ko: <em>이 인터페이스는 부모 </em><em><a href="svgelement"> <code>SVGElement</code> 의</a></em><em> 속성도 상속합니다 </em><em>.</em><em></em>
ru: <em>Этот интерфейс также наследует свойства от своего родителя, </em><em><a href="svgelement"> <code>SVGElement</code> </a> .</em>
zh_cn: <em>此接口还从其父级</em><em><a href="svgelement"> <code>SVGElement</code> </a></em><em>继承属性</em><em>。</em><em></em>

source: <em>This interface also inherits properties from its parent, </em><em><a href="svggeometryelement"><code>SVGGeometryElement</code></a>.</em>
es: <em>Esta interfaz tambi&eacute;n hereda propiedades de su padre, </em><em><a href="svggeometryelement"> <code>SVGGeometryElement</code> </a> .</em>
ko: <em>이 인터페이스는 상위 </em><em><a href="svggeometryelement"> <code>SVGGeometryElement</code> 의</a></em><em> 속성도 상속합니다 </em><em>.</em><em></em>
ru: <em>Этот интерфейс также наследует свойства от своего родителя, </em><em><a href="svggeometryelement"> <code>SVGGeometryElement</code> </a> .</em>
zh_cn: <em>此接口还从其父级</em><em><a href="svggeometryelement"> <code>SVGGeometryElement</code> </a></em><em>继承属性</em><em>。</em><em></em>

source: <em>This interface also inherits properties from its parent, </em><em><a href="svggraphicselement"><code>SVGGraphicsElement</code></a>.</em>
es: <em>Esta interfaz tambi&eacute;n hereda propiedades de su padre, </em><em><a href="svggraphicselement"> <code>SVGGraphicsElement</code> </a> .</em>
ko: <em>이 인터페이스는 부모 </em><em><a href="svggraphicselement"> <code>SVGGraphicsElement</code> </a></em><em> 로부터 속성을 상속받습니다 </em><em>.</em><em></em>
ru: <em>Этот интерфейс также наследует свойства от своего родителя, </em><em><a href="svggraphicselement"> <code>SVGGraphicsElement</code> </a> .</em>
zh_cn: <em>此接口还从其父级</em><em><a href="svggraphicselement"> <code>SVGGraphicsElement</code> </a></em><em>继承属性</em><em>。</em><em></em>

source: <em>This interface also inherits properties from its parent, <a href="event"><code>Event</code></a>.</em>
es: <em>Esta interfaz tambi&eacute;n hereda propiedades de su padre, <a href="event"> <code>Event</code> o</a> .</em>
ko: <em>이 인터페이스는 또한 부모 인 <a href="event"> <code>Event</code> </a> 에서 속성을 상속합니다 .</em>
ru: <em>Этот интерфейс также наследует свойства от своего родителя, <a href="event"> <code>Event</code> </a> .</em>
zh_cn: <em>此接口还从其父<a href="event"> <code>Event</code> </a>继承属性。</em>

source: <em>This interface also inherits properties from its parent, <a href="eventtarget"><code>EventTarget</code></a>.</em>
es: <em>Esta interfaz tambi&eacute;n hereda propiedades de su padre, <a href="eventtarget"> <code>EventTarget</code> </a> .</em>
ko: <em>이 인터페이스는 부모 인 <a href="eventtarget"> <code>EventTarget</code> </a> 에서 속성을 상속합니다 .</em>
ru: <em>Этот интерфейс также наследует свойства своего родителя <a href="eventtarget"> <code>EventTarget</code> </a> .</em>
zh_cn: <em>此接口还从其父<a href="eventtarget"> <code>EventTarget</code> </a>继承属性。</em>

source: <em>This interface also inherits properties from its parent, <a href="htmlelement"><code>HTMLElement</code></a>.</em>
es: <em>Esta interfaz tambi&eacute;n hereda propiedades de su padre, <a href="htmlelement"> <code>HTMLElement</code> </a> .</em>
ko: <em>이 인터페이스는 부모 <a href="htmlelement"> <code>HTMLElement</code> </a> 에서 속성을 상속합니다 .</em>
ru: <em>Этот интерфейс также наследует свойства от своего родителя, <a href="htmlelement"> <code>HTMLElement</code> </a> .</em>
zh_cn: <em>此接口还从其父<a href="htmlelement"> <code>HTMLElement</code> </a>继承属性。</em>

source: <em>This interface also inherits properties from its parent, <a href="svgelement"><code>SVGElement</code></a>, and implements properties from <a href="svgurireference"><code>SVGURIReference</code></a>.</em>
es: <em>Esta interfaz tambi&eacute;n hereda propiedades de su elemento primario, <a href="svgelement"> <code>SVGElement</code> </a> , e implementa propiedades de <a href="svgurireference"> <code>SVGURIReference</code> </a> .</em>
ko: <em>이 인터페이스는 또한 부모로부터 속성을 상속 <a href="svgelement"> <code>SVGElement</code> </a> 에서, 및 구현 속성을 <a href="svgurireference"> <code>SVGURIReference</code> </a> .</em>
ru: <em>Этот интерфейс также наследует свойства своего родителя <a href="svgelement"> <code>SVGElement</code> </a> и реализует свойства из <a href="svgurireference"> <code>SVGURIReference</code> </a> .</em>
zh_cn: <em>此接口还从其父<a href="svgelement"> <code>SVGElement</code> </a>继承属性，并从<a href="svgurireference"> <code>SVGURIReference</code> </a>实现属性。</em>

source: <em>This interface also inherits properties from its parent, <a href="svgelement"><code>SVGElement</code></a>, and implements those of <a href="svgurireference"><code>SVGURIReference</code></a>.</em>
es: <em>Esta interfaz tambi&eacute;n hereda las propiedades de su elemento primario, <a href="svgelement"> <code>SVGElement</code> </a> , e implementa las de <a href="svgurireference"> <code>SVGURIReference</code> </a> .</em>
ko: <em>이 인터페이스는 또한 부모로부터 속성을 상속 <a href="svgelement"> <code>SVGElement</code> </a> 및 구현의 그 <a href="svgurireference"> <code>SVGURIReference</code> 을</a> .</em>
ru: <em>Этот интерфейс также наследует свойства своего родителя <a href="svgelement"> <code>SVGElement</code> </a> и реализует свойства <a href="svgurireference"> <code>SVGURIReference</code> </a> .</em>
zh_cn: <em>此接口还从其父级<a href="svgelement"> <code>SVGElement</code> </a>继承属性，并实现<a href="svgurireference"> <code>SVGURIReference</code> 的属性</a>。</em>

source: <em>This interface also inherits properties from its parent, <a href="svgelement"><code>SVGElement</code></a>.</em>
es: <em>Esta interfaz tambi&eacute;n hereda propiedades de su padre, <a href="svgelement"> <code>SVGElement</code> </a> .</em>
ko: <em>이 인터페이스는 부모 <a href="svgelement"> <code>SVGElement</code> 의</a> 속성도 상속합니다 .</em>
ru: <em>Этот интерфейс также наследует свойства от своего родителя, <a href="svgelement"> <code>SVGElement</code> </a> .</em>
zh_cn: <em>此接口还从其父级<a href="svgelement"> <code>SVGElement</code> </a>继承属性。</em>

source: <em>This interface also inherits properties from its parent, <a href="svggeometryelement"><code>SVGGeometryElement</code></a>.</em>
es: <em>Esta interfaz tambi&eacute;n hereda propiedades de su padre, <a href="svggeometryelement"> <code>SVGGeometryElement</code> </a> .</em>
ko: <em>이 인터페이스는 상위 <a href="svggeometryelement"> <code>SVGGeometryElement</code> 의</a> 속성도 상속합니다 .</em>
ru: <em>Этот интерфейс также наследует свойства от своего родителя, <a href="svggeometryelement"> <code>SVGGeometryElement</code> </a> .</em>
zh_cn: <em>此接口还从其父级<a href="svggeometryelement"> <code>SVGGeometryElement</code> </a>继承属性。</em>

source: <em>This interface also inherits properties from its parent, <a href="svggradientelement"><code>SVGGradientElement</code></a>.</em>
es: <em>Esta interfaz tambi&eacute;n hereda propiedades de su padre, <a href="svggradientelement"> <code>SVGGradientElement</code> </a> .</em>
ko: <em>이 인터페이스는 부모 <a href="svggradientelement"> <code>SVGGradientElement</code> </a> 로부터 속성을 상속받습니다 .</em>
ru: <em>Этот интерфейс также наследует свойства от своего родителя, <a href="svggradientelement"> <code>SVGGradientElement</code> </a> .</em>
zh_cn: <em>此接口还从其父级<a href="svggradientelement"> <code>SVGGradientElement</code> </a>继承属性。</em>

source: <em>This interface also inherits properties from its parent, <a href="svggraphicselement"><code>SVGGraphicsElement</code></a> and also implements the ones from <a href="svgzoomandpan"><code>SVGZoomAndPan</code></a>, <a href="https://developer.mozilla.org/en-US/docs/Web/API/SVGFitToViewBox"><code>SVGFitToViewBox</code></a>, and <a href="windoweventhandlers"><code>WindowEventHandlers</code></a>.</em>
es: <em>Esta interfaz tambi&eacute;n hereda propiedades de su padre, <a href="svggraphicselement"> <code>SVGGraphicsElement</code> </a> y tambi&eacute;n implementa las de <a href="svgzoomandpan"> <code>SVGZoomAndPan</code> </a> , <a href="https://developer.mozilla.org/en-US/docs/Web/API/SVGFitToViewBox"> <code>SVGFitToViewBox</code> </a> y <a href="windoweventhandlers"> <code>WindowEventHandlers</code> </a> .</em>
ko: <em>이 인터페이스는 상위 <a href="svggraphicselement"> <code>SVGGraphicsElement</code> 의</a> 속성을 상속 <a href="svgzoomandpan"> <code>SVGZoomAndPan</code> </a> , <a href="https://developer.mozilla.org/en-US/docs/Web/API/SVGFitToViewBox"> <code>SVGFitToViewBox</code> </a> 및 <a href="windoweventhandlers"> <code>WindowEventHandlers</code> 의</a> 속성 도 구현합니다 .</em>
ru: <em>Этот интерфейс также наследует свойства от своего родителя <a href="svggraphicselement"> <code>SVGGraphicsElement</code> ,</a> а также реализует <a href="svgzoomandpan"> <code>SVGZoomAndPan</code> </a> из SVGZoomAndPan , <a href="https://developer.mozilla.org/en-US/docs/Web/API/SVGFitToViewBox"> <code>SVGFitToViewBox</code> </a> и <a href="windoweventhandlers"> <code>WindowEventHandlers</code> </a> .</em>
zh_cn: <em>此接口还从其父级<a href="svggraphicselement"> <code>SVGGraphicsElement</code> </a>继承属性，并从<a href="svgzoomandpan"> <code>SVGZoomAndPan</code> </a>，<a href="https://developer.mozilla.org/en-US/docs/Web/API/SVGFitToViewBox"> <code>SVGFitToViewBox</code> </a>和<a href="windoweventhandlers"> <code>WindowEventHandlers</code> 中</a>实现属性。</em>

source: <em>This interface also inherits properties from its parent, <a href="svggraphicselement"><code>SVGGraphicsElement</code></a> and implements properties from <a href="svgurireference"><code>SVGURIReference</code></a>.</em>
es: <em>Esta interfaz tambi&eacute;n hereda propiedades de su padre, <a href="svggraphicselement"> <code>SVGGraphicsElement</code> </a> e implementa propiedades de <a href="svgurireference"> <code>SVGURIReference</code> </a> .</em>
ko: <em>이 인터페이스는 또한 부모로부터 속성을 상속 <a href="svggraphicselement"> <code>SVGGraphicsElement</code> </a> 에서와 구현 속성 <a href="svgurireference"> <code>SVGURIReference</code> </a> .</em>
ru: <em>Этот интерфейс также наследует свойства от своего родителя <a href="svggraphicselement"> <code>SVGGraphicsElement</code> </a> и реализует свойства из <a href="svgurireference"> <code>SVGURIReference</code> </a> .</em>
zh_cn: <em>此接口还从其父级<a href="svggraphicselement"> <code>SVGGraphicsElement</code> </a>继承属性，并从<a href="svgurireference"> <code>SVGURIReference</code> </a>实现属性。</em>

source: <em>This interface also inherits properties from its parent, <a href="svggraphicselement"><code>SVGGraphicsElement</code></a>, and implements properties from <a href="svgurireference"><code>SVGURIReference</code></a> and <a href="htmlhyperlinkelementutils"><code>HTMLHyperlinkElementUtils</code></a>.</em>
es: <em>Esta interfaz tambi&eacute;n hereda propiedades de su padre, <a href="svggraphicselement"> <code>SVGGraphicsElement</code> </a> , e implementa propiedades de <a href="svgurireference"> <code>SVGURIReference</code> </a> y <a href="htmlhyperlinkelementutils"> <code>HTMLHyperlinkElementUtils</code> </a> .</em>
ko: <em>이 인터페이스는 부모 <a href="svggraphicselement"> <code>SVGGraphicsElement</code> </a> 로부터 속성을 상속 <a href="svgurireference"> <code>SVGURIReference</code> </a> 및 <a href="htmlhyperlinkelementutils"> <code>HTMLHyperlinkElementUtils</code> </a> 로부터 속성을 구현합니다 .</em>
ru: <em>Этот интерфейс также наследует свойства от своего родителя <a href="svggraphicselement"> <code>SVGGraphicsElement</code> </a> и реализует свойства из <a href="svgurireference"> <code>SVGURIReference</code> </a> и <a href="htmlhyperlinkelementutils"> <code>HTMLHyperlinkElementUtils</code> </a> .</em>
zh_cn: <em>此接口还从其父级<a href="svggraphicselement"> <code>SVGGraphicsElement</code> </a>继承属性，并从<a href="svgurireference"> <code>SVGURIReference</code> </a>和<a href="htmlhyperlinkelementutils"> <code>HTMLHyperlinkElementUtils</code> </a>实现属性。</em>

source: <em>This interface also inherits properties from its parent, <a href="svggraphicselement"><code>SVGGraphicsElement</code></a>.</em>
es: <em>Esta interfaz tambi&eacute;n hereda propiedades de su padre, <a href="svggraphicselement"> <code>SVGGraphicsElement</code> </a> .</em>
ko: <em>이 인터페이스는 부모 <a href="svggraphicselement"> <code>SVGGraphicsElement</code> </a> 로부터 속성을 상속받습니다 .</em>
ru: <em>Этот интерфейс также наследует свойства от своего родителя, <a href="svggraphicselement"> <code>SVGGraphicsElement</code> </a> .</em>
zh_cn: <em>此接口还从其父级<a href="svggraphicselement"> <code>SVGGraphicsElement</code> </a>继承属性。</em>

source: <em>This interface also inherits properties from its parent, <a href="svgtextcontentelement"><code>SVGTextContentElement</code></a>.</em>
es: <em>Esta interfaz tambi&eacute;n hereda propiedades de su padre, <a href="svgtextcontentelement"> <code>SVGTextContentElement</code> </a> .</em>
ko: <em>이 인터페이스는 상위 <a href="svgtextcontentelement"> <code>SVGTextContentElement</code> 의</a> 속성도 상속합니다 .</em>
ru: <em>Этот интерфейс также наследует свойства от своего родителя, <a href="svgtextcontentelement"> <code>SVGTextContentElement</code> </a> .</em>
zh_cn: <em>此接口还从其父级<a href="svgtextcontentelement"> <code>SVGTextContentElement</code> </a>继承属性。</em>

source: <em>This interface also inherits properties of <a href="https://developer.mozilla.org/en-US/docs/Web/API/XMLHttpRequestEventTarget"><code>XMLHttpRequestEventTarget</code></a> and of <a href="eventtarget"><code>EventTarget</code></a>.</em>
es: <em>Esta interfaz tambi&eacute;n hereda las propiedades de <a href="https://developer.mozilla.org/en-US/docs/Web/API/XMLHttpRequestEventTarget"> <code>XMLHttpRequestEventTarget</code> </a> y de <a href="eventtarget"> <code>EventTarget</code> </a> .</em>
ko: <em>이 인터페이스는 <a href="https://developer.mozilla.org/en-US/docs/Web/API/XMLHttpRequestEventTarget"> <code>XMLHttpRequestEventTarget</code> </a> 및 <a href="eventtarget"> <code>EventTarget</code> 의</a> 속성도 상속합니다 .</em>
ru: <em>Этот интерфейс также наследует свойства <a href="https://developer.mozilla.org/en-US/docs/Web/API/XMLHttpRequestEventTarget"> <code>XMLHttpRequestEventTarget</code> </a> и <a href="eventtarget"> <code>EventTarget</code> </a> .</em>
zh_cn: <em>此接口还继承<a href="https://developer.mozilla.org/en-US/docs/Web/API/XMLHttpRequestEventTarget"> <code>XMLHttpRequestEventTarget</code> </a>和<a href="eventtarget"> <code>EventTarget</code> 的</a>属性。</em>

source: <em>This interface also inherits properties of its parent, <a href="event"><code>Event</code></a>.</em>
es: <em>Esta interfaz tambi&eacute;n hereda las propiedades de su padre, <a href="event"> <code>Event</code> o</a> .</em>
ko: <em>이 인터페이스는 또한 부모 인 <a href="event"> <code>Event</code> 의</a> 속성을 상속합니다 .</em>
ru: <em>Этот интерфейс также наследует свойства своего родителя, <a href="event"> <code>Event</code> </a> .</em>
zh_cn: <em>此接口还继承其父<a href="event"> <code>Event</code> 的</a>属性。</em>

source: <em>This interface also inherits properties of its parent, <a href="eventtarget"><code>EventTarget</code></a>.</em>
es: <em>Esta interfaz tambi&eacute;n hereda las propiedades de su padre, <a href="eventtarget"> <code>EventTarget</code> </a> .</em>
ko: <em>이 인터페이스는 부모 인 <a href="eventtarget"> <code>EventTarget</code> 의</a> 속성도 상속합니다 .</em>
ru: <em>Этот интерфейс также наследует свойства своего родителя, <a href="eventtarget"> <code>EventTarget</code> </a> .</em>
zh_cn: <em>此接口还继承其父<a href="eventtarget"> <code>EventTarget</code> 的</a>属性。</em>

source: <em>This interface also inherits properties of its parent, <a href="uievent"><code>UIEvent</code></a>, and its ancestor &mdash; <a href="event"><code>Event</code></a>.</em>
es: <em>Esta interfaz tambi&eacute;n hereda las propiedades de su padre, <a href="uievent"> <code>UIEvent</code> </a> y su antecesor - <a href="event"> <code>Event</code> o</a> .</em>
ko: <em>이 인터페이스는 부모, <a href="uievent"> <code>UIEvent</code> </a> 및 조상 &mdash; <a href="event"> <code>Event</code> 의</a> 속성도 상속합니다 .</em>
ru: <em>Этот интерфейс также наследует свойства своего родителя, <a href="uievent"> <code>UIEvent</code> </a> , и его предка - <a href="event"> <code>Event</code> </a> .</em>
zh_cn: <em>此接口还继承其父<a href="uievent"> <code>UIEvent</code> </a>和其祖先<a href="event"> <code>Event</code> 的</a>属性。</em>

source: <em>This interface also inherits properties of its parents, <a href="uievent"><code>UIEvent</code></a> and <a href="event"><code>Event</code></a>.</em>
es: <em>Esta interfaz tambi&eacute;n hereda las propiedades de sus padres, <a href="uievent"> <code>UIEvent</code> </a> y <a href="event"> <code>Event</code> </a> .</em>
ko: <em>이 인터페이스는 부모의 <a href="uievent"> <code>UIEvent</code> </a> 및 <a href="event"> <code>Event</code> </a> 속성도 상속합니다 .</em>
ru: <em>Этот интерфейс также наследует свойства своих родителей, <a href="uievent"> <code>UIEvent</code> </a> и <a href="event"> <code>Event</code> </a> .</em>
zh_cn: <em>此接口还继承其父级<a href="uievent"> <code>UIEvent</code> </a>和<a href="event"> <code>Event</code> 的</a>属性。</em>

source: <em>This interface defines no method.</em>
es: <em>Esta interfaz no define ning&uacute;n m&eacute;todo.</em>
ko: <em>이 인터페이스는 메소드를 정의하지 않습니다.</em>
ru: <em>Этот интерфейс не определяет метод.</em>
zh_cn: <em>此接口未定义任何方法。</em>

source: <em>This interface defines no methods.</em>
es: <em>Esta interfaz no define m&eacute;todos.</em>
ko: <em>이 인터페이스는 메소드를 정의하지 않습니다.</em>
ru: <em>Этот интерфейс не определяет методы.</em>
zh_cn: <em>此接口未定义任何方法。</em>

source: <em>This interface does not implement any properties.</em>
es: <em>Esta interfaz no implementa ninguna propiedad.</em>
ko: <em>이 인터페이스는 속성을 구현하지 않습니다.</em>
ru: <em>Этот интерфейс не реализует никаких свойств.</em>
zh_cn: <em>此接口未实现任何属性。</em>

source: <em>This interface does not implement any specific methods but inherits methods from its parent, <a href="htmlelement"><code>HTMLElement</code></a>.</em>
es: <em>Esta interfaz no implementa ning&uacute;n m&eacute;todo espec&iacute;fico, pero hereda los m&eacute;todos de su elemento primario, <a href="htmlelement"> <code>HTMLElement</code> </a> .</em>
ko: <em>이 인터페이스는 특정 메소드를 구현하지 않지만 상위 <a href="htmlelement"> <code>HTMLElement</code> </a> 에서 메소드를 상속합니다 .</em>
ru: <em>Этот интерфейс не реализует какие-либо конкретные методы, но наследует методы от своего родителя, <a href="htmlelement"> <code>HTMLElement</code> </a> .</em>
zh_cn: <em>此接口未实现任何特定的方法，但从其父<a href="htmlelement"> <code>HTMLElement</code> </a>继承了方法。</em>

source: <em>This interface does not provide any specific methods, but implements those of its parent, <a href="svgcomponenttransferfunctionelement"><code>SVGComponentTransferFunctionElement</code></a>.</em>
es: <em>Esta interfaz no proporciona ning&uacute;n m&eacute;todo espec&iacute;fico, pero implementa los de su padre, <a href="svgcomponenttransferfunctionelement"> <code>SVGComponentTransferFunctionElement</code> </a> .</em>
ko: <em>이 인터페이스는 특정 메소드를 제공하지 않지만 상위 <a href="svgcomponenttransferfunctionelement"> <code>SVGComponentTransferFunctionElement</code> </a> 메소드를 구현합니다 .</em>
ru: <em>Этот интерфейс не предоставляет никаких конкретных методов, но реализует методы его родителя, <a href="svgcomponenttransferfunctionelement"> <code>SVGComponentTransferFunctionElement</code> </a> .</em>
zh_cn: <em>该接口不提供任何特定方法，但实现其父级<a href="svgcomponenttransferfunctionelement"> <code>SVGComponentTransferFunctionElement</code> 的方法</a>。</em>
