Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/dom/dom.*.007.xlf
Languages: es, ko, ru, zh_cn

source: <strong>Making sure a payment can be made.</strong> The conditions that make payment possible vary depending on the payment method and the user's payment request; for example, if the user chooses to pay using a credit card that isn't accepted by the payee, the payment can't be made.
ru: <strong>Убедиться, что оплата может быть произведена. </strong>Условия, которые делают возможной оплату, варьируются в зависимости от способа оплаты и запроса платежа пользователя; например, если пользователь выбирает оплату с помощью кредитной карты, которая не принята получателем платежа, платеж не может быть произведен.
zh_cn: <strong>确保可以付款。</strong>付款的条件取决于付款方式和用户的付款请求；例如，如果用户选择使用收款人不接受的信用卡付款，则无法付款。

source: <strong>Microsoft Edge</strong>: Go to <code>about:flags</code> and tick <code>Enable service workers</code>; restart browser.
ru: <strong>Microsoft Edge</strong> : перейдите к <code>about:flags</code> и отметьте <code>Enable service workers</code> ; перезапустите браузер.
zh_cn: <strong>Microsoft Edge</strong>：转到 <code>about:flags</code> ,然后勾选 <code>Enable service workers</code> ；重启浏览器。

source: <strong>Non-HTML documents</strong>. The DOM implementation must have information that says which attributes are of type ID. Attributes with the name "id" are not of type ID unless so defined in the document's DTD. The <code>id</code> attribute is defined to be of ID type in the common cases of <a href="https://developer.mozilla.org/en-US/docs/XHTML">XHTML</a>, <a href="https://developer.mozilla.org/en-US/docs/XUL">XUL</a>, and other. Implementations that do not know whether attributes are of type ID or not are expected to return <code>null</code>.
ru: <strong>Не-HTML документы</strong> . Реализация DOM должна иметь информацию о том, какие атрибуты имеют тип ID. Атрибуты с именем &laquo;id&raquo; не имеют типа ID, если это не определено в DTD документа. <code>id</code> атрибут определен , чтобы быть ID типа в общих случаях <a href="https://developer.mozilla.org/en-US/docs/XHTML">XHTML</a> , <a href="https://developer.mozilla.org/en-US/docs/XUL">XUL</a> , и другие. Реализации, которые не знают, имеют ли атрибуты тип ID или нет, должны возвращать <code>null</code> .
zh_cn: <strong>非HTML文档</strong>。DOM实现必须具有说明哪些属性为ID类型的信息。除非在文档的DTD中定义，否则名称为&ldquo; id&rdquo;的属性的类型不是ID。该 <code>id</code> 属性被定义为ID类型在共同案件<a href="https://developer.mozilla.org/en-US/docs/XHTML">XHTML</a>，<a href="https://developer.mozilla.org/en-US/docs/XUL">XUL</a>，和其它。不知道属性是否为ID类型的实现应返回 <code>null</code> 。

source: <strong>Non-standard. Do not use!</strong>
ru: <strong>Нестандартные. Не используй!</strong>
zh_cn: <strong>非标。不使用！</strong>

source: <strong>Note: </strong> The <code>beforebegin</code> and <code>afterend</code> positions work only if the node is in the DOM tree and has a parent element.
ru: <strong>Примечание</strong> . <code>beforebegin</code> и <code>afterend</code> работают, только если узел находится в дереве DOM и имеет родительский элемент.
zh_cn: <strong>注意：</strong>仅当节点在DOM树中并且具有父元素时， <code>beforebegin</code> 和 <code>afterend</code> 位置才起作用。

source: <strong>Note: </strong><code>useCapture</code> is not supported, as IE 8 does not have any alternative method. The following code only adds IE 8 support. This IE 8 polyfill only works in standards mode: a doctype declaration is required.
ru: <strong>Примечание: </strong> <code>useCapture</code> не поддерживается, поскольку в IE 8 нет альтернативного метода. Следующий код только добавляет поддержку IE 8. Этот полифилл IE 8 работает только в стандартном режиме: требуется декларация типа документа.
zh_cn: <strong>注意：</strong>不支持 <code>useCapture</code> ，因为IE 8没有任何替代方法。以下代码仅添加了对IE 8的支持。此IE 8 polyfill仅在标准模式下工作：需要doctype声明。

source: <strong>Note: </strong>Gecko always returns <code>DOM_KEY_LOCATION_MOBILE</code> on Android (Prior to 18), Maemo, and <a href="https://developer.mozilla.org/en-US/docs/Mozilla/Boot_to_Gecko">Boot to Gecko</a>. However, at Gecko 38, this is dropped.
ru: <strong>Примечание.</strong> Gecko всегда возвращает <code>DOM_KEY_LOCATION_MOBILE</code> на Android (до 18), Maemo и <a href="https://developer.mozilla.org/en-US/docs/Mozilla/Boot_to_Gecko">Boot to Gecko</a> . Однако на Gecko 38 это упало.
zh_cn: <strong>注意：</strong> Gecko始终在Android（早于18），Maemo和<a href="https://developer.mozilla.org/en-US/docs/Mozilla/Boot_to_Gecko">Boot to Gecko</a>上返回 <code>DOM_KEY_LOCATION_MOBILE</code> 。但是，在Gecko 38处，该位置被删除。

source: <strong>Note: </strong>Gecko never fires trusted key events with <code>DOM_KEY_LOCATION_JOYSTICK</code> except on Android. Starting 18, native key events on Android may have this value. However, at Gecko 38, this is dropped.
ru: <strong>Примечание:</strong> Gecko никогда не запускает события доверенных ключей с <code>DOM_KEY_LOCATION_JOYSTICK</code> , кроме как на Android. Начиная с 18, события родного ключа на Android могут иметь это значение. Однако на Gecko 38 это упало.
zh_cn: <strong>注意：</strong>除了Android之外，Gecko永远不会使用 <code>DOM_KEY_LOCATION_JOYSTICK</code> 触发可信键事件。从18开始，Android上的本机按键事件可能具有此值。但是，在Gecko 38处，该位置被删除。

source: <strong>Note: </strong>If a <a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/div"><code>&lt;div&gt;</code></a>, <a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/span"><code>&lt;span&gt;</code></a>, or <a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/noembed"><code>&lt;noembed&gt;</code></a> node has a child text node that includes the characters <code>(&amp;)</code>, <code>(&lt;)</code>, or <code>(&gt;)</code>, <code>innerHTML</code> returns these characters as the HTML entities <code>"&amp;amp;"</code>, <code>"&amp;lt;"</code> and <code>"&amp;gt;"</code> respectively. Use <a href="../node/textcontent"><code>Node.textContent</code></a> to get a raw copy of these text nodes' contents.
ru: <strong>Примечание.</strong> Если узел <a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/div"> <code>&lt;div&gt;</code> </a> , <a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/span"> <code>&lt;span&gt;</code> </a> или <a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/noembed"> <code>&lt;noembed&gt;</code> </a> имеет дочерний текстовый узел, который включает символы <code>(&amp;)</code> , <code>(&lt;)</code> или <code>(&gt;)</code> , <code>innerHTML</code> возвращает эти символы как объекты HTML <code>"&amp;amp;"</code> , <code>"&amp;lt;"</code> и <code>"&amp;gt;"</code> соответственно. Используйте <a href="../node/textcontent"> <code>Node.textContent</code> ,</a> чтобы получить необработанную копию содержимого этих текстовых узлов.
zh_cn: <strong>注意：</strong>如果<a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/div"> <code>&lt;div&gt;</code> </a>，<a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/span"> <code>&lt;span&gt;</code> </a>或<a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/noembed"> <code>&lt;noembed&gt;</code> </a>节点的子文本节点包含字符 <code>(&amp;)</code> ， <code>(&lt;)</code> 或 <code>(&gt;)</code> ， <code>innerHTML</code> 会将这些字符作为HTML实体 <code>"&amp;amp;"</code> ， <code>"&amp;lt;"</code> 和 <code>"&amp;gt;"</code> 分别。使用<a href="../node/textcontent"> <code>Node.textContent</code> </a>获取这些文本节点内容的原始副本。

source: <strong>Note: </strong>NodeList is not a genuine array, that is to say it doesn't have the array methods like slice, some, map etc. To convert it into an array, try Array.from(nodeList).
ru: <strong>Примечание:</strong> NodeList не является подлинным массивом, то есть он не имеет методов массива, таких как slice, some, map и т. Д. Чтобы преобразовать его в массив, попробуйте Array.from (nodeList).
zh_cn: <strong>注意：</strong> NodeList不是真正的数组，也就是说它没有诸如slice，some，map等数组方法。要将其转换为数组，请尝试Array.from（nodeList）。

source: <strong>Note: </strong>Some <a href="https://www.w3.org/TR/presentation-api/#dfn-controlling-user-agent">controlling user agents</a> may allow the user to initiate a default <a href="https://www.w3.org/TR/presentation-api/#dfn-presentation-connection">presentation connection</a> and select a <a href="https://www.w3.org/TR/presentation-api/#dfn-presentation-display">presentation display</a> with the same user gesture. For example, the browser chrome could allow the user to pick a display from a menu, or allow the user to tap on an <a href="https://nfc-forum.org/">Near Field Communications (NFC)</a> enabled display. In this case, when the <a href="https://www.w3.org/TR/presentation-api/#dfn-controlling-user-agent">controlling user agent</a> asks for permission while <a href="https://www.w3.org/TR/presentation-api/#dfn-start-a-presentation">starting a presentation</a>, the browser could offer that display as the default choice, or consider the gesture as granting permission for the display and bypass display selection entirely.
ru: <strong>Примечание.</strong> Некоторые <a href="https://www.w3.org/TR/presentation-api/#dfn-controlling-user-agent">управляющие пользовательские агенты</a> могут разрешать пользователю инициировать <a href="https://www.w3.org/TR/presentation-api/#dfn-presentation-connection">подключение</a> к <a href="https://www.w3.org/TR/presentation-api/#dfn-presentation-display">презентации</a> по умолчанию и выбирать отображение презентации с тем же жестом пользователя. Например, браузер Chrome может позволить пользователю выбрать дисплей из меню или позволить пользователю нажать на дисплей с поддержкой <a href="https://nfc-forum.org/">ближней связи (NFC)</a> . В этом случае, когда <a href="https://www.w3.org/TR/presentation-api/#dfn-controlling-user-agent">управляющий пользовательский агент</a> запрашивает разрешение во время <a href="https://www.w3.org/TR/presentation-api/#dfn-start-a-presentation">запуска презентации</a> , браузер может предложить этот дисплей в качестве выбора по умолчанию или рассматривать жест как предоставление разрешения для отображения и полностью игнорировать выбор дисплея.
zh_cn: <strong>注意：</strong>一些<a href="https://www.w3.org/TR/presentation-api/#dfn-controlling-user-agent">控制用户代理</a>可能允许用户启动默认<a href="https://www.w3.org/TR/presentation-api/#dfn-presentation-connection">演示文稿连接</a>并选择具有相同用户手势的<a href="https://www.w3.org/TR/presentation-api/#dfn-presentation-display">演示文稿显示</a>。例如，浏览器镶边可以允许用户从菜单中选择显示，或者允许用户点击启用了<a href="https://nfc-forum.org/">近场通信（NFC）的</a>显示。在这种情况下，当<a href="https://www.w3.org/TR/presentation-api/#dfn-controlling-user-agent">控制用户代理</a>在<a href="https://www.w3.org/TR/presentation-api/#dfn-start-a-presentation">开始演示时</a>请求许可时，浏览器可以将该显示提供为默认选择，或将手势视为授予该显示许可，并完全绕开显示选择。

source: <strong>Note: </strong>This interface doesn't inherit any method.
ru: <strong>Примечание.</strong> Этот интерфейс не наследует никакой метод.
zh_cn: <strong>注意：</strong>此接口不会继承任何方法。

source: <strong>Note: </strong>This interface doesn't inherit any property.
ru: <strong>Примечание.</strong> Этот интерфейс не наследует никаких свойств.
zh_cn: <strong>注意：</strong>此接口不会继承任何属性。

source: <strong>Note:</strong> A more complete framework for capturing the typing of hidden words is <a href="https://github.com/madmurphy/spell.js/">available on GitHub</a>.
ru: <strong>Примечание.</strong> Более полная структура для ввода набора скрытых слов <a href="https://github.com/madmurphy/spell.js/">доступна на GitHub</a> .
zh_cn: <strong>注意：</strong><a href="https://github.com/madmurphy/spell.js/">GitHub上提供了</a>一个更完整的框架来捕获隐藏单词的类型。

source: <strong>Note:</strong> A real service worker implementation would use caching and onfetch rather than the deprecated XMLHttpRequest API. Those features are not used here so that you can focus on understanding Promises.
ru: <strong>Примечание.</strong> Реальная реализация работника сервиса будет использовать кэширование и onfetch, а не устаревший API XMLHttpRequest. Эти функции здесь не используются, чтобы вы могли сосредоточиться на понимании обещаний.
zh_cn: <strong>注意：</strong>真正的服务工作者实现将使用缓存和onfetch，而不是不建议使用的XMLHttpRequest API。此处未使用这些功能，因此您可以专注于理解承诺。

source: <strong>Note:</strong> A screen lock is web application dependent. If application A is locked to <code>landscape</code> and application B is locked to <code>portrait</code>, switching from application A to B or B to A will not fire an <code><a href="https://developer.mozilla.org/en-US/docs/Web/Events/orientationchange">orientationchange</a></code> event because both applications will keep the orientation they had.
ru: <strong>Примечание.</strong> Блокировка экрана зависит от веб-приложения. Если приложение А заперто в <code>landscape</code> и приложении B привязан к <code>portrait</code> , переход от приложения А к В или В к А не сгореть <code><a href="https://developer.mozilla.org/en-US/docs/Web/Events/orientationchange">orientationchange</a></code> события , потому что оба приложения будут поддерживать ориентацию они имели.
zh_cn: <strong>注意：</strong>屏幕锁定取决于Web应用程序。如果将应用程序A锁定为 <code>landscape</code> 并且将应用程序B锁定为 <code>portrait</code> ，则从应用程序A切换到B或从B切换到A不会触发 <code><a href="https://developer.mozilla.org/en-US/docs/Web/Events/orientationchange">orientationchange</a></code> 更改事件，因为两个应用程序都将保持其原来的方向。

source: <strong>Note:</strong> According to the HTTP/2 specification (<a href="https://http2.github.io/http2-spec/#rfc.section.8.1.2.4">8.1.2.4</a><a href="https://http2.github.io/http2-spec/#HttpResponse">Response Pseudo-Header Fields</a>), HTTP/2 does not define a way to carry the version or reason phrase that is included in an HTTP/1.1 status line.
ru: <strong>Примечание.</strong> Согласно спецификации HTTP / 2 ( <a href="https://http2.github.io/http2-spec/#rfc.section.8.1.2.4">8.1.2.4 поля псевдозаголовка </a><a href="https://http2.github.io/http2-spec/#HttpResponse">ответа</a> ) HTTP / 2 не определяет способ переноса версии или фразы причины, включенной в строку состояния HTTP / 1.1.
zh_cn: <strong>注意：</strong>根据HTTP / 2规范（<a href="https://http2.github.io/http2-spec/#rfc.section.8.1.2.4">8.1.2.4 </a><a href="https://http2.github.io/http2-spec/#HttpResponse">Response Pseudo-Header Fields</a>），HTTP / 2没有定义一种方式来承载HTTP / 1.1状态行中包含的版本或原因短语。

source: <strong>Note:</strong> Adding a track to a connection triggers renegotiation by firing an <code><a href="https://developer.mozilla.org/en-US/docs/Web/Events/negotiationneeded">negotiationneeded</a></code> event.
ru: <strong>Примечание.</strong> Добавление дорожки к соединению вызывает повторное согласование, вызывая событие, требующее <code><a href="https://developer.mozilla.org/en-US/docs/Web/Events/negotiationneeded">negotiationneeded</a></code> .
zh_cn: <strong>注意：</strong>在连接中添加轨道会触发需要 <code><a href="https://developer.mozilla.org/en-US/docs/Web/Events/negotiationneeded">negotiationneeded</a></code> 事件，从而触发重新协商。

source: <strong>Note:</strong> All notifications of mutations that have already been detected but not yet reported to the observer are discarded.
ru: <strong>Примечание.</strong> Все уведомления о мутациях, которые уже были обнаружены, но еще не переданы наблюдателю, отбрасываются.
zh_cn: <strong>注意：</strong>所有已经检测到但尚未报告给观察者的突变通知都将被丢弃。

source: <strong>Note:</strong> All of the methods in this section are Gecko-specific.
ru: <strong>Примечание.</strong> Все методы в этом разделе относятся к Gecko.
zh_cn: <strong>注意：</strong>本节中的所有方法都是特定于Ge​​cko的。

source: <strong>Note:</strong> All of the properties in this section are Gecko-specific.
ru: <strong>Примечание.</strong> Все свойства в этом разделе относятся к Gecko.
zh_cn: <strong>注意：</strong>本节中的所有属性都是特定于Ge​​cko的。

source: <strong>Note:</strong> Although <code>insertRule()</code> is exclusively a method of <a href="../cssstylesheet"><code>CSSStyleSheet</code></a>, it actually inserts the rule into <code><a href="../cssstylesheet">CSSStyleSheet</a>.cssRules</code> &mdash; its internal <a href="../cssrulelist"><code>CSSRuleList</code></a>.
ru: <strong>Примечание.</strong> Хотя <code>insertRule()</code> является исключительно методом <a href="../cssstylesheet"> <code>CSSStyleSheet</code> </a> , он фактически вставляет правило в <code><a href="../cssstylesheet">CSSStyleSheet</a>.cssRules</code> - его внутренний <a href="../cssrulelist"> <code>CSSRuleList</code> </a> .
zh_cn: <strong>注意：</strong>尽管 <code>insertRule()</code> 仅是<a href="../cssstylesheet"> <code>CSSStyleSheet</code> 的</a>一种方法，但实际上它会将规则插入 <code><a href="../cssstylesheet">CSSStyleSheet</a>.cssRules</code> （其内部<a href="../cssrulelist"> <code>CSSRuleList</code> )中</a>。

source: <strong>Note:</strong> Although this event existed prior to Gecko 2.0, it did not match the specification. The old event format is now represented by the <code><a href="https://developer.mozilla.org/en-US/docs/Mozilla/Tech/XPCOM/Reference/Interface/nsIDOMStorageEventObsolete">nsIDOMStorageEventObsolete</a></code> interface.
ru: <strong>Примечание.</strong> Хотя это событие существовало до Gecko 2.0, оно не соответствовало спецификации. Старый формат событий теперь представлен интерфейсом <code><a href="https://developer.mozilla.org/en-US/docs/Mozilla/Tech/XPCOM/Reference/Interface/nsIDOMStorageEventObsolete">nsIDOMStorageEventObsolete</a></code> .
zh_cn: <strong>注意：</strong>尽管此事件在Gecko 2.0之前存在，但与规范不匹配。现在，旧的事件格式由 <code><a href="https://developer.mozilla.org/en-US/docs/Mozilla/Tech/XPCOM/Reference/Interface/nsIDOMStorageEventObsolete">nsIDOMStorageEventObsolete</a></code> 接口表示。

source: <strong>Note:</strong> Although this interface was previously implemented in Gecko, there was no way to actually create one. NameList has been removed effective with Gecko 10.0
ru: <strong>Примечание.</strong> Хотя этот интерфейс ранее был реализован в Gecko, его фактически не было. NameList был удален с Gecko 10.0
zh_cn: <strong>注意：</strong>尽管此接口以前是在Gecko中实现的，但无法实际创建一个。NameList已从Gecko 10.0中删除

source: <strong>Note:</strong> Any codecs not included in <code>codecs</code> will not be considered during the process of negotiating a connection. This lets you prevent the use of codecs you don't wish to use.
ru: <strong>Примечание.</strong> Любые кодеки, не включенные в <code>codecs</code> , не будут учитываться в процессе согласования соединения. Это позволяет вам предотвратить использование кодеков, которые вы не хотите использовать.
zh_cn: <strong>注意：</strong>在协商连接过程中，不会考虑编解码器中未包括的任何编解码 <code>codecs</code> 。这样一来，您就可以避免使用不想使用的编解码器。

source: <strong>Note:</strong> As is the case with the caller, once the <code>setLocalDescription()</code> fulfillment handler has run, the browser begins firing <code><a href="https://developer.mozilla.org/en-US/docs/Web/Events/icecandidate">icecandidate</a></code> events that the callee must handle, one for each candidate that needs to be transmitted to the remote peer.
ru: <strong>Примечание.</strong> Как и в случае с вызывающей стороной, после <code>setLocalDescription()</code> обработчика выполнения setLocalDescription () браузер начинает <code><a href="https://developer.mozilla.org/en-US/docs/Web/Events/icecandidate">icecandidate</a></code> события icecandidate, которые должен обрабатывать вызываемый, по одному для каждого кандидата, который должен быть передан удаленному узлу.
zh_cn: <strong>注意：</strong>与调用方一样，一旦 <code>setLocalDescription()</code> 实现处理程序运行，浏览器就会启动被调用方必须处理的 <code><a href="https://developer.mozilla.org/en-US/docs/Web/Events/icecandidate">icecandidate</a></code> 事件，每个需要发送给远程对等方的候选对象。

source: <strong>Note:</strong> As of Gecko 1.9, the Internet Explorer equivalent to this feature is the <a href="showmodaldialog"><code>window.showModalDialog()</code></a> method. For compatibility reasons, it's now supported in Firefox. Note also that starting in Gecko 2.0, you can use <a href="showmodaldialog"><code>window.showModalDialog()</code></a> without UniversalBrowserWrite privileges.
ru: <strong>Примечание.</strong> Начиная с версии Gecko 1.9 Internet Explorer, эквивалентный этой функции, - это метод <a href="showmodaldialog"> <code>window.showModalDialog()</code> </a> . По соображениям совместимости, теперь он поддерживается в Firefox. Также обратите внимание, что начиная с Gecko 2.0, вы можете использовать <a href="showmodaldialog"> <code>window.showModalDialog()</code> </a> без привилегий UniversalBrowserWrite.
zh_cn: <strong>注意：</strong>从Gecko 1.9开始，相当于此功能的Internet Explorer是<a href="showmodaldialog"> <code>window.showModalDialog()</code> </a>方法。出于兼容性原因，Firefox现在支持它。还要注意，从Gecko 2.0开始，您可以使用没有UniversalBrowserWrite特权的<a href="showmodaldialog"> <code>window.showModalDialog()</code> </a>。

source: <strong>Note:</strong> As of Gecko 12.0, if your progress event is called with a <code>responseType</code> of "moz-blob", the value of response is a <a href="../blob"><code>Blob</code></a> containing the data received so far.
ru: <strong>Примечание.</strong> Начиная с Gecko 12.0, если ваше событие progress вызывается с <code>responseType</code> &laquo;moz-blob&raquo;, значением response будет <a href="../blob"> <code>Blob</code> ,</a> содержащий данные, полученные до сих пор.
zh_cn: <strong>注意：</strong>从Gecko 12.0开始，如果使用 <code>responseType</code> 为&ldquo; moz-blob&rdquo; 调用进度事件，则response的值为一个<a href="../blob"> <code>Blob</code> ,</a>其中包含到目前为止接收到的数据。

source: <strong>Note:</strong> As of November 2017, browsers only support <code>MediaStream</code>. For <code>MediaSource</code>, <code>Blob</code> and <code>File</code>, you have to create a URL with <a href="../url/createobjecturl"><code>URL.createObjectURL()</code></a> and assign it to <a href="src"><code>HTMLMediaElement.src</code></a>. See below for an example.
ru: <strong>Примечание.</strong> С ноября 2017 года браузеры поддерживают только <code>MediaStream</code> . Для <code>MediaSource</code> , <code>Blob</code> и <code>File</code> необходимо создать URL-адрес с помощью <a href="../url/createobjecturl"> <code>URL.createObjectURL()</code> </a> и назначить его для <a href="src"> <code>HTMLMediaElement.src</code> </a> . Смотрите ниже пример.
zh_cn: <strong>注意：</strong>从2017年11月开始，浏览器仅支持 <code>MediaStream</code> 。对于 <code>MediaSource</code> ， <code>Blob</code> 和 <code>File</code> ，您必须使用<a href="../url/createobjecturl"> <code>URL.createObjectURL()</code> </a>创建一个URL 并将其分配给<a href="src"> <code>HTMLMediaElement.src</code> </a>。请参阅下面的示例。
