Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/dom/dom.*.007.xlf
Languages: es, ko, ru, zh_cn

source: <em>If the value of a <code>ConstrainLong</code> is an object rather than a number, it may have the properties below in addition to the properties it inherits from <a href="longrange"><code>LongRange</code></a>.</em>
es: <em>Si el valor de un <code>ConstrainLong</code> es un objeto en lugar de un n&uacute;mero, puede tener las siguientes propiedades adem&aacute;s de las propiedades que hereda de <a href="longrange"> <code>LongRange</code> </a> .</em>
ko: <em> <code>ConstrainLong</code> 값이 숫자가 아닌 객체 인 경우 <a href="longrange"> <code>LongRange</code> </a> 에서 상속되는 속성 외에도 아래에 속성이있을 수 있습니다 .</em>
ru: <em>Если значение <code>ConstrainLong</code> является объектом, а не числом, он может иметь свойства, указанные ниже, в дополнение к свойствам, которые он наследует от <a href="longrange"> <code>LongRange</code> </a> .</em>
zh_cn: <em>如果 <code>ConstrainLong</code> 的值是一个对象而不是数字，则它除了从<a href="longrange"> <code>LongRange</code> </a>继承的属性外，还可能具有以下属性。</em>

source: <em>In addition to the event handlers defined by the parent interface, <code>EventTarget</code>, <code>RTCIceTransport</code> includes the following:</em>
es: <em>Adem&aacute;s de los controladores de eventos definidos por la interfaz principal, <code>EventTarget</code> , <code>RTCIceTransport</code> incluye lo siguiente:</em>
ko: <em>상위 인터페이스 인 <code>EventTarget</code> , <code>RTCIceTransport</code> 에 의해 정의 된 이벤트 핸들러 외에도 다음이 포함됩니다.</em>
ru: <em>Помимо обработчиков событий, определенных родительским интерфейсом, <code>EventTarget</code> , <code>RTCIceTransport</code> включает в себя следующее:</em>
zh_cn: <em>除了父接口定义的事件处理程序之外， <code>EventTarget</code> ， <code>RTCIceTransport</code> 还包括以下内容：</em>

source: <em>In addition to the properties below, this interface includes properties inherited from <a href="paymentrequestupdateevent"><code>PaymentRequestUpdateEvent</code></a>.</em>
es: <em>Adem&aacute;s de las propiedades a continuaci&oacute;n, esta interfaz incluye propiedades heredadas de <a href="paymentrequestupdateevent"> <code>PaymentRequestUpdateEvent</code> </a> .</em>
ko: <em>아래의 속성 <a href="paymentrequestupdateevent"> <code>PaymentRequestUpdateEvent</code> </a> 인터페이스에는 PaymentRequestUpdateEvent 에서 상속 된 속성이 포함되어 있습니다 .</em>
ru: <em>В дополнение к свойствам ниже, этот интерфейс включает свойства, унаследованные от <a href="paymentrequestupdateevent"> <code>PaymentRequestUpdateEvent</code> </a> .</em>
zh_cn: <em>除了下面的属性，此接口还包括从<a href="paymentrequestupdateevent"> <code>PaymentRequestUpdateEvent</code> </a>继承的属性。</em>

source: <em>In addition to the properties of <a href="event"><code>Event</code></a>, this interface offers the following:</em>
es: <em>Adem&aacute;s de las propiedades de <a href="event"> <code>Event</code> </a> , esta interfaz ofrece lo siguiente:</em>
ko: <em><a href="event"> <code>Event</code> </a> 의 속성 외에도이 인터페이스는 다음을 제공합니다.</em>
ru: <em>В дополнение к свойствам <a href="event"> <code>Event</code> </a> этот интерфейс предлагает следующее:</em>
zh_cn: <em>除了<a href="event"> <code>Event</code> </a>的属性，此接口还提供以下内容：</em>

source: <em>Inherits event handlers from its parent interface, <a href="audioscheduledsourcenode"><code>AudioScheduledSourceNode</code></a>.</em>
es: <em>Hereda controladores de eventos de su interfaz principal, <a href="audioscheduledsourcenode"> <code>AudioScheduledSourceNode</code> </a> .</em>
ko: <em>부모 인터페이스 <a href="audioscheduledsourcenode"> <code>AudioScheduledSourceNode</code> </a> 에서 이벤트 핸들러를 상속합니다 .</em>
ru: <em>Наследует обработчики событий из своего родительского интерфейса <a href="audioscheduledsourcenode"> <code>AudioScheduledSourceNode</code> </a> .</em>
zh_cn: <em>从其父接口<a href="audioscheduledsourcenode"> <code>AudioScheduledSourceNode</code> </a>继承事件处理程序。</em>

source: <em>Inherits event handlers from its parent, </em><em><a href="audioscheduledsourcenode"><code>AudioScheduledSourceNode</code></a></em>.
es: <em>Hereda controladores de eventos de su padre, </em><em><a href="audioscheduledsourcenode"> <code>AudioScheduledSourceNode</code> </a></em> .
ko: <em>부모 </em><em><a href="audioscheduledsourcenode"> <code>AudioScheduledSourceNode</code> </a></em><em> 에서 이벤트 핸들러를 상속합니다</em> .
ru: <em>Унаследует обработчики событий от своего родителя </em><em><a href="audioscheduledsourcenode"> <code>AudioScheduledSourceNode</code> </a></em> .
zh_cn: <em>从其父</em><em><a href="audioscheduledsourcenode"> <code>AudioScheduledSourceNode</code> </a></em><em>继承事件处理程序</em>。

source: <em>Inherits event handlers from its parent, <a href="eventtarget"><code>EventTarget</code></a></em>
es: <em>Hereda controladores de eventos de su padre, <a href="eventtarget"> <code>EventTarget</code> </a></em>
ko: <em>부모 인 <a href="eventtarget"> <code>EventTarget</code> </a> 에서 이벤트 핸들러를 상속합니다.</em>
ru: <em>Наследует обработчики событий от своего родителя, <a href="eventtarget"> <code>EventTarget</code> </a></em>
zh_cn: <em>从其父级<a href="eventtarget"> <code>EventTarget</code> </a>继承事件处理程序</em>

source: <em>Inherits methods from <a href="cssstylevalue"><code>CSSStyleValue</code></a>.</em>
es: <em>Hereda m&eacute;todos de <a href="cssstylevalue"> <code>CSSStyleValue</code> </a> .</em>
ko: <em><a href="cssstylevalue"> <code>CSSStyleValue</code> </a> 에서 메소드를 상속합니다 .</em>
ru: <em>Наследует методы из <a href="cssstylevalue"> <code>CSSStyleValue</code> </a> .</em>
zh_cn: <em>从<a href="cssstylevalue"> <code>CSSStyleValue</code> </a>继承方法。</em>

source: <em>Inherits methods from its parent <a href="event"><code>Event</code></a></em>.
es: <em>Hereda los m&eacute;todos de su <a href="event"> <code>Event</code> </a></em><em> principal</em> .
ko: <em>부모 <a href="event"> <code>Event</code> </a></em><em> 에서 메서드를 상속합니다</em> .
ru: <em>Наследует методы от своего родительского <a href="event"> <code>Event</code> </a></em> .
zh_cn: <em>从其父<a href="event"> <code>Event</code> </a></em><em>继承方法</em>。

source: <em>Inherits methods from its parent <a href="eventtarget"><code>EventTarget</code></a>.</em>
es: <em>Hereda m&eacute;todos de su <a href="eventtarget"> <code>EventTarget</code> </a> padre .</em>
ko: <em>부모 <a href="eventtarget"> <code>EventTarget</code> </a> 에서 메소드를 상속합니다 .</em>
ru: <em>Наследует методы от своего родительского <a href="eventtarget"> <code>EventTarget</code> </a> .</em>
zh_cn: <em>从其父<a href="eventtarget"> <code>EventTarget</code> </a>继承方法。</em>

source: <em>Inherits methods from its parent interface, <a href="audionode"><code>AudioNode</code></a>, and adds the following methods:</em>
es: <em>Hereda los m&eacute;todos de su interfaz principal, <a href="audionode"> <code>AudioNode</code> </a> , y agrega los siguientes m&eacute;todos:</em>
ko: <em>부모 인터페이스 인 <a href="audionode"> <code>AudioNode</code> </a> 에서 메소드를 상속 하고 다음 메소드를 추가합니다.</em>
ru: <em>Наследует методы из родительского интерфейса <a href="audionode"> <code>AudioNode</code> </a> и добавляет следующие методы:</em>
zh_cn: <em>从其父接口<a href="audionode"> <code>AudioNode</code> </a>继承方法，并添加以下方法：</em>

source: <em>Inherits methods from its parent interface, <a href="audioscheduledsourcenode"><code>AudioScheduledSourceNode</code></a>.</em>
es: <em>Hereda los m&eacute;todos de su interfaz principal, <a href="audioscheduledsourcenode"> <code>AudioScheduledSourceNode</code> </a> .</em>
ko: <em>부모 인터페이스 인 <a href="audioscheduledsourcenode"> <code>AudioScheduledSourceNode</code> </a> 에서 메소드를 상속합니다 .</em>
ru: <em>Наследует методы из родительского интерфейса <a href="audioscheduledsourcenode"> <code>AudioScheduledSourceNode</code> </a> .</em>
zh_cn: <em>从其父接口<a href="audioscheduledsourcenode"> <code>AudioScheduledSourceNode</code> </a>继承方法。</em>

source: <em>Inherits methods from its parent interface, <a href="event"><code>Event</code></a></em>.
es: <em>Hereda m&eacute;todos de su interfaz principal, <a href="event"> <code>Event</code> o</a></em> .
ko: <em>부모 인터페이스 인 <a href="event"> <code>Event</code> </a></em><em> 에서 메소드를 상속합니다</em> .
ru: <em>Наследует методы от родительского интерфейса <a href="event"> <code>Event</code> </a></em> .
zh_cn: <em>从其父接口<a href="event"> <code>Event</code> </a></em><em>继承方法</em>。

source: <em>Inherits methods from its parent interface, <a href="eventtarget"><code>EventTarget</code></a>.</em>
es: <em>Hereda m&eacute;todos de su interfaz principal, <a href="eventtarget"> <code>EventTarget</code> </a> .</em>
ko: <em>부모 인터페이스 인 <a href="eventtarget"> <code>EventTarget</code> </a> 에서 메소드를 상속합니다 .</em>
ru: <em>Наследует методы из родительского интерфейса <a href="eventtarget"> <code>EventTarget</code> </a> .</em>
zh_cn: <em>从其父接口<a href="eventtarget"> <code>EventTarget</code> </a>继承方法。</em>

source: <em>Inherits methods from its parent, </em><a href="audionode"><code>AudioNode</code></a>.
es: <em>Hereda m&eacute;todos de su padre, </em><a href="audionode"> <code>AudioNode</code> </a> .
ko: <em>부모 인 </em><a href="audionode"> <code>AudioNode</code> </a><em> 에서 메소드를 상속합니다</em> .
ru: <em>Наследует методы от своего родителя, </em><a href="audionode"> <code>AudioNode</code> </a> .
zh_cn: <em>从其父</em><a href="audionode"> <code>AudioNode</code> </a><em>继承方法</em>。

source: <em>Inherits methods from its parent, </em><em><a href="audionode"><code>AudioNode</code></a></em>.
es: <em>Hereda m&eacute;todos de su padre, </em><em><a href="audionode"> <code>AudioNode</code> </a></em> .
ko: <em>부모 인 </em><em><a href="audionode"> <code>AudioNode</code> </a></em><em> 에서 메소드를 상속합니다</em> .
ru: <em>Наследует методы от своего родителя, </em><em><a href="audionode"> <code>AudioNode</code> </a></em> .
zh_cn: <em>从其父</em><em><a href="audionode"> <code>AudioNode</code> </a></em><em>继承方法</em>。

source: <em>Inherits methods from its parent, </em><em><a href="audioscheduledsourcenode"><code>AudioScheduledSourceNode</code></a></em>.
es: <em>Hereda m&eacute;todos de su padre, </em><em><a href="audioscheduledsourcenode"> <code>AudioScheduledSourceNode</code> </a></em> .
ko: <em>부모 </em><em><a href="audioscheduledsourcenode"> <code>AudioScheduledSourceNode</code> </a></em><em> 에서 메소드를 상속합니다</em> .
ru: <em>Наследует методы от своего родителя </em><em><a href="audioscheduledsourcenode"> <code>AudioScheduledSourceNode</code> </a></em> .
zh_cn: <em>从其父</em><em><a href="audioscheduledsourcenode"> <code>AudioScheduledSourceNode</code> </a></em><em>继承方法</em>。

source: <em>Inherits methods from its parent, </em><em><a href="event"><code>Event</code></a></em>.
es: <em>Hereda m&eacute;todos de su padre, </em><em><a href="event"> <code>Event</code> o</a></em> .
ko: <em>부모 인 </em><em><a href="event"> <code>Event</code> </a></em><em> 에서 메소드를 상속합니다</em> .
ru: <em>Наследует методы от своего родителя, </em><em><a href="event"> <code>Event</code> </a></em> .
zh_cn: <em>从其父</em><em><a href="event"> <code>Event</code> </a></em><em>继承方法</em>。

source: <em>Inherits methods from its parent, </em><em><a href="extendableevent"><code>ExtendableEvent</code></a></em>.
es: <em>Hereda m&eacute;todos de su padre, </em><em><a href="extendableevent"> <code>ExtendableEvent</code> </a></em> .
ko: <em>부모 </em><em><a href="extendableevent"> <code>ExtendableEvent</code> </a></em><em> 에서 메소드를 상속합니다</em> .
ru: <em>Наследует методы от своего родителя, </em><em><a href="extendableevent"> <code>ExtendableEvent</code> </a></em> .
zh_cn: <em>从其父级</em><em><a href="extendableevent"> <code>ExtendableEvent</code> </a></em><em>继承方法</em>。

source: <em>Inherits methods from its parent, </em><em><a href="htmlelement"><code>HTMLElement</code></a>.</em>
es: <em>Hereda m&eacute;todos de su padre, </em><em><a href="htmlelement"> <code>HTMLElement</code> </a> .</em>
ko: <em>부모 </em><em><a href="htmlelement"> <code>HTMLElement</code> </a></em><em> 에서 메서드를 상속합니다 </em><em>.</em><em></em>
ru: <em>Наследует методы от своего родителя, </em><em><a href="htmlelement"> <code>HTMLElement</code> </a> .</em>
zh_cn: <em>从其父</em><em><a href="htmlelement"> <code>HTMLElement</code> </a></em><em>继承方法</em><em>。</em><em></em>

source: <em>Inherits methods from its parent, <a href="audionode"><code>AudioNode</code></a>. It also has the following additional methods:</em>
es: <em>Hereda m&eacute;todos de su padre, <a href="audionode"> <code>AudioNode</code> </a> . Tambi&eacute;n tiene los siguientes m&eacute;todos adicionales:</em>
ko: <em>부모 인 <a href="audionode"> <code>AudioNode</code> </a> 에서 메소드를 상속합니다 . 또한 다음과 같은 추가 방법이 있습니다.</em>
ru: <em>Наследует методы от своего родителя, <a href="audionode"> <code>AudioNode</code> </a> . Он также имеет следующие дополнительные методы:</em>
zh_cn: <em>从其父<a href="audionode"> <code>AudioNode</code> </a>继承方法。它还具有以下其他方法：</em>

source: <em>Inherits methods from its parent, <a href="audioscheduledsourcenode"><code>AudioScheduledSourceNode</code></a>, and adds the following:</em>
es: <em>Hereda los m&eacute;todos de su padre, <a href="audioscheduledsourcenode"> <code>AudioScheduledSourceNode</code> </a> , y agrega lo siguiente:</em>
ko: <em>부모 <a href="audioscheduledsourcenode"> <code>AudioScheduledSourceNode</code> </a> 에서 메소드를 상속 하고 다음을 추가합니다.</em>
ru: <em>Наследует методы от своего родителя <a href="audioscheduledsourcenode"> <code>AudioScheduledSourceNode</code> </a> и добавляет следующее:</em>
zh_cn: <em>从其父<a href="audioscheduledsourcenode"> <code>AudioScheduledSourceNode</code> </a>继承方法，并添加以下内容：</em>

source: <em>Inherits methods from its parent, <a href="element"><code>Element</code></a>.</em>
es: <em>Hereda los m&eacute;todos de su <a href="element"> <code>Element</code> </a> primario, Element .</em>
ko: <em>부모 <a href="element"> <code>Element</code> </a> 로부터 메소드를 상속합니다 .</em>
ru: <em>Наследует методы от своего родителя <a href="element"> <code>Element</code> </a> .</em>
zh_cn: <em>从其父<a href="element"> <code>Element</code> </a>继承方法。</em>

source: <em>Inherits methods from its parent, <a href="event"><code>Event</code></a></em>.
es: <em>Hereda m&eacute;todos de su padre, <a href="event"> <code>Event</code> o</a></em> .
ko: <em>부모 인 <a href="event"> <code>Event</code> </a></em><em> 에서 메소드를 상속합니다</em> .
ru: <em>Наследует методы от своего родителя, <a href="event"> <code>Event</code> </a></em> .
zh_cn: <em>从其父<a href="event"> <code>Event</code> </a></em><em>继承方法</em>。

source: <em>Inherits methods from its parent, <a href="eventtarget"><code>EventTarget</code></a>, and implements methods from <a href="abstractworker"><code>AbstractWorker</code></a>.</em>
es: <em>Hereda m&eacute;todos de su padre, <a href="eventtarget"> <code>EventTarget</code> </a> e implementa m&eacute;todos de <a href="abstractworker"> <code>AbstractWorker</code> </a> .</em>
ko: <em>부모 인 <a href="eventtarget"> <code>EventTarget</code> </a> 에서 메소드를 상속 하고 <a href="abstractworker"> <code>AbstractWorker</code> </a> 에서 메소드를 구현합니다 .</em>
ru: <em>Наследует методы от своего родителя <a href="eventtarget"> <code>EventTarget</code> </a> и реализует методы из <a href="abstractworker"> <code>AbstractWorker</code> </a> .</em>
zh_cn: <em>从其父<a href="eventtarget"> <code>EventTarget</code> </a>继承方法，并从<a href="abstractworker"> <code>AbstractWorker</code> </a>实现方法。</em>

source: <em>Inherits methods from its parent, <a href="eventtarget"><code>EventTarget</code></a></em>
es: <em>Hereda m&eacute;todos de su padre, <a href="eventtarget"> <code>EventTarget</code> </a></em>
ko: <em>부모 인 <a href="eventtarget"> <code>EventTarget</code> </a> 에서 메소드를 상속합니다.</em>
ru: <em>Наследует методы от своего родителя, <a href="eventtarget"> <code>EventTarget</code> </a></em>
zh_cn: <em>从其父<a href="eventtarget"> <code>EventTarget</code> </a>继承方法</em>

source: <em>Inherits methods from its parent, <a href="eventtarget"><code>EventTarget</code></a></em>.<sup>[1]</sup>
es: <em>Hereda m&eacute;todos de su padre, <a href="eventtarget"> <code>EventTarget</code> </a></em> . <sup>[1]</sup>
ko: <em>부모 인 <a href="eventtarget"> <code>EventTarget</code> </a></em><em> 에서 메소드를 상속합니다</em> . <sup>[1]</sup>
ru: <em>Наследует методы от своего родителя, <a href="eventtarget"> <code>EventTarget</code> </a></em> . <sup>[1]</sup>
zh_cn: <em>从其父类<a href="eventtarget"> <code>EventTarget</code> </a></em><em>继承方法</em>。<sup>[1]</sup>

source: <em>Inherits methods from its parent, <a href="extendableevent"><code>ExtendableEvent</code></a></em>.
es: <em>Hereda m&eacute;todos de su padre, <a href="extendableevent"> <code>ExtendableEvent</code> </a></em> .
ko: <em>부모 <a href="extendableevent"> <code>ExtendableEvent</code> </a></em><em> 에서 메소드를 상속합니다</em> .
ru: <em>Наследует методы от своего родителя, <a href="extendableevent"> <code>ExtendableEvent</code> </a></em> .
zh_cn: <em>从其父级<a href="extendableevent"> <code>ExtendableEvent</code> </a></em><em>继承方法</em>。

source: <em>Inherits methods from its parent, <a href="htmlelement"><code>HTMLElement</code></a>, and implements those from <a href="htmlhyperlinkelementutils"><code>HTMLHyperlinkElementUtils</code></a>.</em>
es: <em>Hereda los m&eacute;todos de su padre, <a href="htmlelement"> <code>HTMLElement</code> </a> , e implementa los de <a href="htmlhyperlinkelementutils"> <code>HTMLHyperlinkElementUtils</code> </a> .</em>
ko: <em>부모 인 <a href="htmlelement"> <code>HTMLElement</code> </a> 에서 메소드를 상속 하고 <a href="htmlhyperlinkelementutils"> <code>HTMLHyperlinkElementUtils</code> </a> 에서 메소드를 구현합니다 .</em>
ru: <em>Наследует методы от своего родителя, <a href="htmlelement"> <code>HTMLElement</code> </a> , и реализует <a href="htmlhyperlinkelementutils"> <code>HTMLHyperlinkElementUtils</code> </a> из HTMLHyperlinkElementUtils .</em>
zh_cn: <em>从其父<a href="htmlhyperlinkelementutils"> <code>HTMLHyperlinkElementUtils</code> </a><a href="htmlelement"> <code>HTMLElement</code> </a>继承方法，并从HTMLHyperlinkElementUtils实现这些方法。</em>

source: <em>Inherits methods from its parent, <a href="htmlelement"><code>HTMLElement</code></a>.</em>
es: <em>Hereda m&eacute;todos de su padre, <a href="htmlelement"> <code>HTMLElement</code> </a> .</em>
ko: <em>부모 <a href="htmlelement"> <code>HTMLElement</code> </a> 에서 메서드를 상속합니다 .</em>
ru: <em>Наследует методы от своего родителя, <a href="htmlelement"> <code>HTMLElement</code> </a> .</em>
zh_cn: <em>从其父<a href="htmlelement"> <code>HTMLElement</code> </a>继承方法。</em>

source: <em>Inherits methods from its parent, <a href="htmlelement"><code>HTMLElement</code></a></em>.
es: <em>Hereda m&eacute;todos de su padre, <a href="htmlelement"> <code>HTMLElement</code> </a></em> .
ko: <em>부모 <a href="htmlelement"> <code>HTMLElement</code> </a></em><em> 에서 메서드를 상속합니다 </em>.
ru: <em>Наследует методы от своего родителя, <a href="htmlelement"> <code>HTMLElement</code> </a></em> .
zh_cn: <em>从其父<a href="htmlelement"> <code>HTMLElement</code> </a></em><em>继承方法</em>。

source: <em>Inherits methods from its parent, <a href="htmlmediaelement"><code>HTMLMediaElement</code></a>, and <a href="htmlelement"><code>HTMLElement</code></a>.</em>
es: <em>Hereda m&eacute;todos de su padre, <a href="htmlmediaelement"> <code>HTMLMediaElement</code> </a> y <a href="htmlelement"> <code>HTMLElement</code> </a> .</em>
ko: <em>부모, <a href="htmlmediaelement"> <code>HTMLMediaElement</code> </a> 및 <a href="htmlelement"> <code>HTMLElement</code> </a> 에서 메서드를 상속합니다 .</em>
ru: <em>Наследует методы от своего родителя, <a href="htmlmediaelement"> <code>HTMLMediaElement</code> </a> и <a href="htmlelement"> <code>HTMLElement</code> </a> .</em>
zh_cn: <em>从其父<a href="htmlmediaelement"> <code>HTMLMediaElement</code> </a>和<a href="htmlelement"> <code>HTMLElement</code> </a>继承方法。</em>

source: <em>Inherits methods from its parent, <a href="htmlmediaelement"><code>HTMLMediaElement</code></a>, and from <a href="htmlelement"><code>HTMLElement</code></a>.</em>
es: <em>Hereda m&eacute;todos de su padre, <a href="htmlmediaelement"> <code>HTMLMediaElement</code> </a> y de <a href="htmlelement"> <code>HTMLElement</code> </a> .</em>
ko: <em>부모, <a href="htmlmediaelement"> <code>HTMLMediaElement</code> </a> 및 <a href="htmlelement"> <code>HTMLElement</code> </a> 에서 메서드를 상속합니다 .</em>
ru: <em>Наследует методы от своего родителя, <a href="htmlmediaelement"> <code>HTMLMediaElement</code> </a> и от <a href="htmlelement"> <code>HTMLElement</code> </a> .</em>
zh_cn: <em>从其父<a href="htmlmediaelement"> <code>HTMLMediaElement</code> </a>和<a href="htmlelement"> <code>HTMLElement</code> </a>继承方法。</em>

source: <em>Inherits methods from its parent, <a href="https://developer.mozilla.org/en-US/docs/Web/API/CharacterData"><code>CharacterData</code></a>.</em>
es: <em>Hereda m&eacute;todos de su padre, <a href="https://developer.mozilla.org/en-US/docs/Web/API/CharacterData"> <code>CharacterData</code> </a> .</em>
ko: <em>부모 인 <a href="https://developer.mozilla.org/en-US/docs/Web/API/CharacterData"> <code>CharacterData</code> </a> 에서 메소드를 상속합니다 .</em>
ru: <em>Наследует методы от своего родителя <a href="https://developer.mozilla.org/en-US/docs/Web/API/CharacterData"> <code>CharacterData</code> </a> .</em>
zh_cn: <em>从其父<a href="https://developer.mozilla.org/en-US/docs/Web/API/CharacterData"> <code>CharacterData</code> </a>继承方法。</em>

source: <em>Inherits methods from its parent, <a href="node"><code>Node</code></a>, and implements the <a href="childnode"><code>ChildNode</code></a> interface.</em>
es: <em>Hereda m&eacute;todos de su padre, <a href="node"> <code>Node</code> </a> , e implementa la interfaz <a href="childnode"> <code>ChildNode</code> </a> .</em>
ko: <em>부모 인 <a href="node"> <code>Node</code> </a> 에서 메소드를 상속 하고 <a href="childnode"> <code>ChildNode</code> </a> 인터페이스를 구현합니다 .</em>
ru: <em>Наследует методы от своего родителя <a href="node"> <code>Node</code> </a> и реализует интерфейс <a href="childnode"> <code>ChildNode</code> </a> .</em>
zh_cn: <em>从其父<a href="node"> <code>Node</code> </a>继承方法，并实现<a href="childnode"> <code>ChildNode</code> </a>接口。</em>

source: <em>Inherits methods from its parent, <a href="stylepropertymapreadonly"><code>StylePropertyMapReadOnly</code></a>.</em>
es: <em>Hereda m&eacute;todos de su padre, <a href="stylepropertymapreadonly"> <code>StylePropertyMapReadOnly</code> </a> .</em>
ko: <em>부모 <a href="stylepropertymapreadonly"> <code>StylePropertyMapReadOnly</code> </a> 에서 메소드를 상속합니다 .</em>
ru: <em>Наследует методы от своего родителя, <a href="stylepropertymapreadonly"> <code>StylePropertyMapReadOnly</code> </a> .</em>
zh_cn: <em>从其父级<a href="stylepropertymapreadonly"> <code>StylePropertyMapReadOnly</code> </a>继承方法。</em>

source: <em>Inherits methods from its parent, <a href="stylesheet"><code>Stylesheet</code></a>.</em>
es: <em>Hereda m&eacute;todos de su padre, <a href="stylesheet"> <code>Stylesheet</code> </a> .</em>
ko: <em>부모 인 <a href="stylesheet"> <code>Stylesheet</code> </a> 에서 메서드를 상속합니다 .</em>
ru: <em>Наследует методы от своего родителя, <a href="stylesheet"> <code>Stylesheet</code> </a> .</em>
zh_cn: <em>从其父<a href="stylesheet"> <code>Stylesheet</code> </a>继承方法。</em>
