Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/dom/dom.*.011.xlf
Languages: ja, ko, ru, zh_cn

source: Acceleration &mdash; There are two types of acceleration to consider in VR:
ja: 加速&mdash; VRで考慮すべき加速には2つのタイプがあります。
ko: 가속 &mdash; VR에서 고려해야 할 가속에는 두 가지 유형이 있습니다.
ru: Ускорение - В VR есть два типа ускорения:
zh_cn: 加速&mdash; VR中要考虑两种类型的加速：

source: Acceleration is typically read in the <a href="../sensor/onreading"><code>Sensor.onreading</code></a> event callback. In the example below this occurs sixty times a second.
ja: 加速は通常、<a href="../sensor/onreading"> <code>Sensor.onreading</code> </a>イベントコールバックで読み取られます。以下の例では、これは1秒に60回発生します。
ko: 가속은 일반적으로 <a href="../sensor/onreading"> <code>Sensor.onreading</code> </a> 이벤트 콜백 에서 읽습니다 . 아래 예에서 이것은 초당 60 번 발생합니다.
ru: Ускорение обычно читается в <a href="../sensor/onreading"> <code>Sensor.onreading</code> </a> события Sensor.onreading . В приведенном ниже примере это происходит шестьдесят раз в секунду.
zh_cn: 通常在<a href="../sensor/onreading"> <code>Sensor.onreading</code> </a>事件回调中读取加速。在下面的示例中，这每秒发生60次。

source: Acceleration is typically read in the <a href="sensor/onreading"><code>Sensor.onreading</code></a> event callback. In the example below this occurs sixty times a second.
ja: 加速は通常、<a href="sensor/onreading"> <code>Sensor.onreading</code> </a>イベントコールバックで読み取られます。以下の例では、これは1秒に60回発生します。
ko: 가속은 일반적으로 <a href="sensor/onreading"> <code>Sensor.onreading</code> </a> 이벤트 콜백 에서 읽습니다 . 아래 예에서 이것은 초당 60 번 발생합니다.
ru: Ускорение обычно читается в <a href="sensor/onreading"> <code>Sensor.onreading</code> </a> события Sensor.onreading . В приведенном ниже примере это происходит шестьдесят раз в секунду.
zh_cn: 通常在<a href="sensor/onreading"> <code>Sensor.onreading</code> </a>事件回调中读取加速。在下面的示例中，这每秒发生60次。

source: Accelerometer<br/><small>The definition of 'Accelerometer' in that specification.</small>
ja: 加速度計<br/><small>その仕様における「加速度計」の定義。</small>
ko: 가속도계 <br/><small>해당 사양에서 '가속도계'의 정의.</small>
ru: Акселерометр <br/><small>Определение &laquo;Акселерометр&raquo; в этой спецификации.</small>
zh_cn: 加速度计<br/><small>该规范中&ldquo;加速度计&rdquo;的定义。</small>

source: Accelerometer<br/><small>The definition of 'LinearAccelerationSensor' in that specification.</small>
ja: 加速度計<br/><small>その仕様における「LinearAccelerationSensor」の定義。</small>
ko: 가속도계 <br/><small>해당 사양에서 'LinearAccelerationSensor'의 정의.</small>
ru: Акселерометр <br/><small>Определение 'LinearAccelerationSensor' в этой спецификации.</small>
zh_cn: 加速度计<br/><small>该规范中&ldquo; LinearAccelerationSensor&rdquo;的定义。</small>

source: Accelerometer<br/><small>The definition of 'x' in that specification.</small>
ja: 加速度計<br/><small>その仕様における「x」の定義。</small>
ko: 가속도계 <br/><small>해당 사양에서 'x'의 정의.</small>
ru: Акселерометр <br/><small>Определение &laquo;х&raquo; в этой спецификации.</small>
zh_cn: 加速度计<br/><small>该规范中&ldquo; x&rdquo;的定义。</small>

source: Accelerometer<br/><small>The definition of 'y' in that specification.</small>
ja: 加速度計<br/><small>その仕様における「y」の定義。</small>
ko: 가속도계 <br/><small>해당 사양에서 'y'의 정의.</small>
ru: Акселерометр <br/><small>Определение &laquo;у&raquo; в этой спецификации.</small>
zh_cn: 加速度计<br/><small>该规范中&ldquo; y&rdquo;的定义。</small>

source: Accelerometer<br/><small>The definition of 'z' in that specification.</small>
ja: 加速度計<br/><small>その仕様における「z」の定義。</small>
ko: 가속도계 <br/><small>해당 사양에서 'z'의 정의.</small>
ru: Акселерометр <br/><small>Определение &laquo;z&raquo; в этой спецификации.</small>
zh_cn: 加速度计<br/><small>该规范中&ldquo; z&rdquo;的定义。</small>

source: Accepts a <a href="vrframedata"><code>VRFrameData</code></a> object and populates it with the information required to render the current frame.
ja: <a href="vrframedata"> <code>VRFrameData</code> </a>オブジェクトを受け入れ、現在のフレームのレンダリングに必要な情報をこのオブジェクトに入力します。
ko: 수용 <a href="vrframedata"> <code>VRFrameData</code> 의</a> 객체를 현재 프레임을 렌더링하기 위해서 필요한 정보로 채 웁니다.
ru: Принимает объект <a href="vrframedata"> <code>VRFrameData</code> </a> и заполняет его информацией, необходимой для визуализации текущего кадра.
zh_cn: 接受一个<a href="vrframedata"> <code>VRFrameData</code> </a>对象，并使用呈现当前帧所需的信息填充它。

source: Accepts a namespace URI as an argument and returns a <a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Boolean"><code>Boolean</code></a> with a value of <code>true</code> if the namespace is the default namespace on the given node or <code>false</code> if not.
ja: ネームスペースURIを引数として受け入れ、ネームスペースが指定されたノードのデフォルトのネームスペースで <code>true</code> 場合はtrueの値を持つ<a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Boolean"> <code>Boolean</code> </a>を返し、そうでない場合は <code>false</code> を返します。
ko: 네임 스페이스 URI를 인수로 허용하고 네임 스페이스가 지정된 노드의 기본 네임 스페이스 인 경우 <code>true</code> 값을 가진 <a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Boolean"> <code>Boolean</code> </a> 을 반환하고 그렇지 않은 경우 <code>false</code> 를 반환합니다.
ru: Принимает URI пространства имен в качестве аргумента и возвращает <a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Boolean"> <code>Boolean</code> </a> значение со значением <code>true</code> , если пространство имен является пространством имен по умолчанию на данном узле, или <code>false</code> , если нет.
zh_cn: 接受名称空间URI作为参数，如果名称空间是给定节点上的默认名称空间，则返回<a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Boolean"> <code>Boolean</code> </a>，其值为 <code>true</code> ;否则为 <code>false</code> 。

source: Accepts a prefix and returns the namespace URI associated with it on the given node if found (and <code>null</code> if not). Supplying <code>null</code> for the prefix will return the default namespace.
ja: プレフィックスを受け入れ、見つかった場合は指定されたノードでプレフィックスに関連付けられている名前空間URIを返します（見つからなかった場合は <code>null</code> ）。供給 <code>null</code> 接頭辞は、デフォルトの名前空間を返します。
ko: 접두사를 허용하고 주어진 노드에서 접두사와 관련된 네임 스페이스 URI를 반환합니다 (찾을 수 <code>null</code> 경우 null ). 접두사에 <code>null</code> 을 제공 하면 기본 네임 스페이스가 반환됩니다.
ru: Принимает префикс и возвращает URI пространства имен, связанный с ним на данном узле, если он найден (и <code>null</code> если нет). Если указать префикс <code>null</code> , будет возвращено пространство имен по умолчанию.
zh_cn: 接受前缀并返回给定节点上与之关联的名称空间URI（如果找到）（否则为 <code>null</code> ）。为前缀提供 <code>null</code> 将返回默认名称空间。

source: Accepts a variety of different image sources, and returns a <a href="https://developer.mozilla.org/en-US/docs/Web/API/Promise"><code>Promise</code></a> which resolves to an <a href="imagebitmap"><code>ImageBitmap</code></a>. Optionally the source is cropped to the rectangle of pixels originating at <em>(sx, sy)</em> with width sw, and height sh.
ja: さまざまな異なる画像ソースを受け入れ、<a href="imagebitmap"> <code>ImageBitmap</code> に</a>解決される<a href="https://developer.mozilla.org/en-US/docs/Web/API/Promise"> <code>Promise</code> </a>を返します。オプションで、ソースは<em>（sx、sy）から</em>始まり、幅がsw、高さがsh のピクセルの長方形にトリミングされます。<em></em>
ko: 다양한 이미지 소스를 허용하고 <a href="imagebitmap"> <code>ImageBitmap</code> 으로</a> 해석 되는 <a href="https://developer.mozilla.org/en-US/docs/Web/API/Promise"> <code>Promise</code> </a> 를 반환 합니다 . 선택적으로 소스는 너비 sw 및 높이 sh 로 <em>(sx, sy)</em> 에서 시작하는 픽셀의 사각형으로 잘립니다 .<em></em>
ru: Принимает различные источники изображений и возвращает <a href="https://developer.mozilla.org/en-US/docs/Web/API/Promise"> <code>Promise</code> </a> которое разрешается в <a href="imagebitmap"> <code>ImageBitmap</code> </a> . При желании источник обрезается до прямоугольника пикселей <em>, начинающихся</em> с <em>(sx, sy)</em> с шириной sw и высотой sh.
zh_cn: 接受各种不同的图像源，并返回解析为<a href="imagebitmap"> <code>ImageBitmap</code> </a>的<a href="https://developer.mozilla.org/en-US/docs/Web/API/Promise"> <code>Promise</code> </a>。可选地，将源裁剪为以<em>（sx，sy）</em>为起点，宽度为sw且高度为sh 的像素的矩形。<em></em>

source: Access API
ja: アクセスAPI
ko: 액세스 API
ru: API доступа
zh_cn: 访问API

source: Access API: Using
ja: APIにアクセスします。使用方法
ko: 액세스 API : 사용
ru: API доступа:Использование
zh_cn: 访问API。使用

source: Access requests are automatically denied unless the embedded content is currently processing a user gesture such as a tap or click. This also prevents embedded content on the page from spamming the browser or user with excessive access requests.
ja: 埋め込みコンテンツが現在タップやクリックなどのユーザージェスチャーを処理中でない限り、アクセス要求は自動的に拒否されます。これにより、ページ上の埋め込みコンテンツがブラウザやユーザーに過剰なアクセスリクエストをスパムするのを防ぐこともできます。
ko: 임베드 된 컨텐츠가 현재 탭 또는 클릭과 같은 사용자 제스처를 처리하지 않으면 액세스 요청이 자동으로 거부됩니다. 또한 페이지에 포함 된 콘텐츠가 과도한 액세스 요청으로 브라우저 나 사용자에게 스팸을 보내는 것을 방지합니다.
ru: Запросы доступа автоматически отклоняются,если только встроенный контент в настоящее время не обрабатывает пользовательский жест,например,нажатие или щелчок.Это также предотвращает рассылку встроенного содержимого на странице спама браузеру или пользователю с чрезмерными запросами доступа.
zh_cn: 除非嵌入的内容当前正在处理用户的手势,如点击或单击,否则访问请求会被自动拒绝。这也可以防止页面上的嵌入式内容向浏览器或用户发送过多的访问请求。

source: Access the attributes of a touch point.
ja: タッチポイントの属性にアクセスします。
ko: 터치 포인트의 속성에 액세스하십시오.
ru: Доступ к атрибутам точки касания.
zh_cn: 访问触摸点的属性。

source: Access to the files were denied for one of the following reasons:
ja: 以下のいずれかの理由でファイルへのアクセスが拒否されました。
ko: 다음 이유 중 하나로 파일에 대한 액세스가 거부되었습니다.
ru: Доступ к файлам был запрещен по одной из следующих причин:
zh_cn: 拒绝查阅档案的原因如下:

source: Accessibility concerns
ja: アクセシビリティへの配慮
ko: 접근성 문제
ru: Проблема доступности
zh_cn: 无障碍问题

source: Accessibility of keyboard-navigable JavaScript widgets
ja: キーボード操作可能なJavaScriptウィジェットのアクセシビリティ
ko: 키보드로 탐색 가능한 JavaScript 위젯의 접근성
ru: Доступность навигационных виджетов на JavaScript с клавиатурой
zh_cn: 键盘导航的JavaScript小部件的可访问性

source: Accessible Rich Internet Applications <strong>(<a href="https://developer.mozilla.org/en-US/docs/Web/Accessibility/ARIA">ARIA</a>)</strong> defines ways to make Web content and Web applications more accessible to people with disabilities. You can use ARIA attributes to describe the behavior and purpose of the canvas element. See <a href="https://developer.mozilla.org/en-US/docs/Web/Accessibility/ARIA">ARIA</a> and <a href="https://developer.mozilla.org/en-US/docs/Web/Accessibility/ARIA/ARIA_Techniques">ARIA techniques</a> for more information.
ja: Accessible Rich Internet Applications <strong>（<a href="https://developer.mozilla.org/en-US/docs/Web/Accessibility/ARIA">ARIA</a>）</strong>は、障害を持つ人々がWebコンテンツとWebアプリケーションにアクセスしやすくする方法を定義しています。ARIA属性を使用して、キャンバス要素の動作と目的を説明できます。詳細については、<a href="https://developer.mozilla.org/en-US/docs/Web/Accessibility/ARIA">ARIA</a>および<a href="https://developer.mozilla.org/en-US/docs/Web/Accessibility/ARIA/ARIA_Techniques">ARIAテクニック</a>を参照してください。
ko: <strong><a href="https://developer.mozilla.org/en-US/docs/Web/Accessibility/ARIA">ARIA</a></strong><strong> (</strong> Accessible Rich Internet Application <strong>)</strong> 는 장애인이 웹 컨텐츠 및 웹 애플리케이션에보다 쉽게 ​​액세스 할 수 있도록하는 방법을 정의합니다. ARIA 속성을 사용하여 canvas 요소의 동작과 목적을 설명 할 수 있습니다. 자세한 내용은 <a href="https://developer.mozilla.org/en-US/docs/Web/Accessibility/ARIA">ARIA</a> 및 <a href="https://developer.mozilla.org/en-US/docs/Web/Accessibility/ARIA/ARIA_Techniques">ARIA 기술</a> 을 참조하십시오.
ru: Доступные многофункциональные интернет-приложения <strong>( <a href="https://developer.mozilla.org/en-US/docs/Web/Accessibility/ARIA">ARIA</a> )</strong> определяют способы сделать веб-контент и веб-приложения более доступными для людей с ограниченными возможностями. Вы можете использовать атрибуты ARIA, чтобы описать поведение и назначение элемента canvas. Смотрите <a href="https://developer.mozilla.org/en-US/docs/Web/Accessibility/ARIA">ARIA</a> и <a href="https://developer.mozilla.org/en-US/docs/Web/Accessibility/ARIA/ARIA_Techniques">ARIA методы</a> для получения дополнительной информации.
zh_cn: 可访问的富Internet应用程序<strong>（<a href="https://developer.mozilla.org/en-US/docs/Web/Accessibility/ARIA">ARIA</a>）</strong>定义了使残障人士更容易访问Web内容和Web应用程序的方法。您可以使用ARIA属性来描述canvas元素的行为和目的。有关更多信息，请参见<a href="https://developer.mozilla.org/en-US/docs/Web/Accessibility/ARIA">ARIA</a>和<a href="https://developer.mozilla.org/en-US/docs/Web/Accessibility/ARIA/ARIA_Techniques">ARIA技术</a>。

source: Accessible from <code>Window</code> from version 43.
ja: バージョン43 以降の <code>Window</code> からアクセスできます。
ko: 버전 43의 <code>Window</code> 에서 액세스 할 수 있습니다 .
ru: Доступно из <code>Window</code> с версии 43.
zh_cn: 可从版本43的 <code>Window</code> 访问。

source: Accessible from <code>WorkerGlobalScope</code> from version 43.
ja: バージョン43 以降の <code>WorkerGlobalScope</code> からアクセスできます。
ko: 버전 43의 <code>WorkerGlobalScope</code> 에서 액세스 할 수 있습니다 .
ru: Доступно из <code>WorkerGlobalScope</code> с версии 43.
zh_cn: 可从43版的 <code>WorkerGlobalScope</code> 访问。

source: Accessing <code>response</code> during a <code>progress</code> event returns the data received so far. Outside the <code>progress</code> event handler, the value of <code>response</code> is always <code>null</code>.
ja: <code>progress</code> イベント中に <code>response</code> にアクセスすると、これまでに受信したデータが返されます。 <code>progress</code> イベントハンドラーの外では、 <code>response</code> の値は常に <code>null</code> です。
ko: <code>progress</code> 이벤트 동안 <code>response</code> 에 액세스 하면 지금까지 수신 된 데이터가 반환됩니다. <code>progress</code> 이벤트 핸들러 외부에서 <code>response</code> 값 은 항상 <code>null</code> 입니다.
ru: Доступ к <code>response</code> во время события <code>progress</code> возвращает полученные данные. За пределами обработчика событий <code>progress</code> значение <code>response</code> всегда равно <code>null</code> .
zh_cn: 在 <code>progress</code> 事件期间访问 <code>response</code> 将返回到目前为止接收到的数据。在 <code>progress</code> 事件处理程序之外， <code>response</code> 的值始终为 <code>null</code> 。

source: Accessing Event interfaces
ja: イベントインターフェイスへのアクセス
ko: 이벤트 인터페이스에 액세스
ru: Доступ к интерфейсам событий
zh_cn: 访问事件接口

source: Accessing a user's cookies in an embedded cross-origin iframe
ja: 埋め込みクロスオリジンiframeでのユーザーのクッキーへのアクセス
ko: 임베디드 교차 출처 iframe에서 사용자 쿠키에 액세스
ru: Доступ к куки-файлам пользователя во встроенном ифрейме перекрестного происхождения
zh_cn: 在嵌入式跨源iframe中访问用户的cookie

source: Accessing form controls
ja: フォームコントロールへのアクセス
ko: 폼 컨트롤에 액세스
ru: Формы контроля доступа
zh_cn: 访问表单控制

source: Accessing frame data
ja: フレームデータへのアクセス
ko: 프레임 데이터에 액세스
ru: Доступ к кадровым данным
zh_cn: 访问框架数据

source: Accessing one selected file using a classical DOM selector:
ja: 古典的な DOM セレクタを使って選択されたファイルにアクセスします。
ko: 클래식 DOM 선택기를 사용하여 하나의 선택된 파일에 액세스 :
ru: Доступ к одному выбранному файлу с помощью классического селектора флэш-памяти:
zh_cn: 使用经典的DOM选择器访问一个选定的文件。

source: Accessing selected file(s)
ja: 選択したファイルへのアクセス
ko: 선택한 파일에 액세스
ru: доступ к выбранным файлам
zh_cn: 访问选定的文件

source: Accessing selected file(s) on a change event
ja: 変更イベントで選択したファイルへのアクセス
ko: 변경 이벤트에서 선택된 파일에 액세스
ru: Доступ к выбранным файлам по событию изменения
zh_cn: 在变更事件中访问所选文件。

source: Accessing the clipboard
ja: クリップボードへのアクセス
ko: 클립 보드에 액세스
ru: Доступ к буферу обмена
zh_cn: 访问剪贴板

source: Accessing the connection list
ja: 接続リストへのアクセス
ko: 연결 목록에 액세스
ru: Доступ к списку соединений
zh_cn: 访问连接列表

source: Accessing the form's elements
ja: フォームの要素にアクセスする
ko: 양식의 요소에 액세스
ru: Доступ к элементам формы
zh_cn: 访问表格的元素

source: Accessing the gamepad data
ja: ゲームパッドのデータにアクセスする
ko: 게임 패드 데이터에 액세스
ru: Доступ к данным геймпада
zh_cn: 访问游戏手柄的数据

source: Accessing the matches
ja: マッチへのアクセス
ko: 경기에 액세스
ru: Доступ к спичкам
zh_cn: 获取火柴

source: Accessing values
ja: 値へのアクセス
ko: 값에 액세스
ru: Доступ к значениям
zh_cn: 访问值

source: According to the specification, the default value for the <code>passive</code> option is always false. However, this introduces the potential for event listeners handling certain touch events (among others) to block the browser's main thread while it is attempting to handle scrolling, resulting in possibly enormous reduction in performance during scroll handling.
ja: 仕様によると、 <code>passive</code> デフォルト値オプションのは常にfalseです。ただし、これにより、（特に）特定のタッチイベントを処理するイベントリスナーがスクロールを処理しようとしているときにブラウザーのメインスレッドをブロックする可能性が生じ、スクロール処理中のパフォーマンスが大幅に低下する可能性があります。
ko: 사양에 따르면 <code>passive</code> 옵션 의 기본값 은 항상 false입니다. 그러나, 이는 특정 터치 이벤트를 처리하는 이벤트 리스너가 스크롤 처리를 시도하는 동안 브라우저의 메인 스레드를 차단하여 스크롤 처리 중에 성능이 크게 저하 될 수있는 가능성을 소개합니다.
ru: Согласно спецификации, значение по умолчанию для <code>passive</code> опции всегда ложно. Тем не менее, это открывает для слушателей возможность обрабатывать определенные сенсорные события (среди прочих), чтобы блокировать основной поток браузера, когда он пытается обработать прокрутку, что может привести к огромному снижению производительности при обработке прокрутки.
zh_cn: 根据规范， <code>passive</code> 选项的默认值始终为false。但是，这会导致事件侦听器可能会处理某些触摸事件（以及其他事件），从而在浏览器尝试处理滚动时阻塞浏览器的主线程，从而可能导致滚动处理期间的性能大幅下降。

source: Accuracy of the derivative calculation for the GLSL built-in functions: <code>dFdx</code>, <code>dFdy</code>, and <code>fwidth</code>.
ja: GLSL組み込み関数の微分計算の精度： <code>dFdx</code> 、 <code>dFdy</code> 、および <code>fwidth</code> 。
ko: GLSL 대한 미분 계산의 정확도는 기본 함수 : <code>dFdx</code> , <code>dFdy</code> 및 <code>fwidth</code> 를 .
ru: Точность вычисления производной для встроенных функций GLSL: <code>dFdx</code> , <code>dFdy</code> и <code>fwidth</code> .
zh_cn: GLSL内置函数 <code>dFdx</code> ， <code>dFdy</code> 和 <code>fwidth</code> 的导数计算的准确性。

source: Activates ANDing the fragment's coverage with the temporary coverage value. See <a href="samplecoverage"><code>WebGLRenderingContext.sampleCoverage()</code></a>.
ja: フラグメントのカバレッジと一時的なカバレッジ値のANDを有効にします。<a href="samplecoverage"> <code>WebGLRenderingContext.sampleCoverage()</code> を</a>参照してください。
ko: 임시 적용 범위 값으로 단편의 적용 범위를 AND로 활성화합니다. <a href="samplecoverage"> <code>WebGLRenderingContext.sampleCoverage()</code> </a> 참조하십시오 .
ru: Активирует AND для покрытия фрагмента временным значением покрытия. Смотрите <a href="samplecoverage"> <code>WebGLRenderingContext.sampleCoverage()</code> </a> .
zh_cn: 激活将片段的coverage与临时coverage值进行&ldquo;与&rdquo;运算。请参阅<a href="samplecoverage"> <code>WebGLRenderingContext.sampleCoverage()</code> </a>。

source: Activates adding an offset to depth values of polygon's fragments. See <a href="polygonoffset"><code>WebGLRenderingContext.polygonOffset()</code></a>.
ja: ポリゴンのフラグメントの深度値にオフセットを追加することをアクティブにします。<a href="polygonoffset"> <code>WebGLRenderingContext.polygonOffset()</code> を</a>参照してください。
ko: 다각형 조각의 깊이 값에 오프셋을 추가합니다. <a href="polygonoffset"> <code>WebGLRenderingContext.polygonOffset()</code> </a> 참조하십시오 .
ru: Активирует добавление смещения к значениям глубины фрагментов полигона. Смотрите <a href="polygonoffset"> <code>WebGLRenderingContext.polygonOffset()</code> </a> .
zh_cn: 激活为多边形片段的深度值添加偏移量。请参见<a href="polygonoffset"> <code>WebGLRenderingContext.polygonOffset()</code> </a>。

source: Activates blending of the computed fragment color values. See <a href="blendfunc"><code>WebGLRenderingContext.blendFunc()</code></a>.
ja: 計算されたフラグメントのカラー値のブレンドをアクティブにします。<a href="blendfunc"> <code>WebGLRenderingContext.blendFunc()</code> を</a>参照してください。
ko: 계산 된 조각 색상 값의 혼합을 활성화합니다. <a href="blendfunc"> <code>WebGLRenderingContext.blendFunc()</code> </a> 참조하십시오 .
ru: Активирует смешивание вычисленных значений цвета фрагмента. Смотрите <a href="blendfunc"> <code>WebGLRenderingContext.blendFunc()</code> </a> .
zh_cn: 激活计算片段颜色值的混合。请参阅<a href="blendfunc"> <code>WebGLRenderingContext.blendFunc()</code> </a>。

source: Activates culling of polygons. See <a href="cullface"><code>WebGLRenderingContext.cullFace()</code></a>.
ja: ポリゴンのカリングをアクティブにします。<a href="cullface"> <code>WebGLRenderingContext.cullFace()</code> を</a>参照してください。
ko: 다각형 컬링을 활성화합니다. <a href="cullface"> <code>WebGLRenderingContext.cullFace()</code> </a> 참조하십시오 .
ru: Активирует отбраковку полигонов. Смотрите <a href="cullface"> <code>WebGLRenderingContext.cullFace()</code> </a> .
zh_cn: 激活多边形的剔除。请参阅<a href="cullface"> <code>WebGLRenderingContext.cullFace()</code> </a>。

source: Activates depth comparisons and updates to the depth buffer. See <a href="depthfunc"><code>WebGLRenderingContext.depthFunc()</code></a>.
ja: 深度の比較を有効にし、深度バッファを更新します。<a href="depthfunc"> <code>WebGLRenderingContext.depthFunc()</code> を</a>参照してください。
ko: 깊이 비교를 활성화하고 깊이 버퍼를 업데이트합니다. <a href="depthfunc"> <code>WebGLRenderingContext.depthFunc()</code> </a> 참조하십시오 .
ru: Активирует сравнения глубины и обновления буфера глубины. Смотрите <a href="depthfunc"> <code>WebGLRenderingContext.depthFunc()</code> </a> .
zh_cn: 激活深度比较并更新深度缓冲区。请参阅<a href="depthfunc"> <code>WebGLRenderingContext.depthFunc()</code> </a>。

source: Activates dithering of color components before they get written to the color buffer.
ja: カラーバッファに書き込まれる前のカラーコンポーネントのディザリングを有効にします。
ko: 컬러 버퍼에 쓰여지기 전에 컬러 컴포넌트의 디더링을 활성화합니다.
ru: Активирует дизеринг компонентов цвета до того,как они будут записаны в цветовой буфер.
zh_cn: 激活颜色组件在写入颜色缓冲区之前的抖动。

source: Activates one of the sensors based on <code>Sensor</code>.
ja: <code>Sensor</code> に基づいてセンサーの 1つをアクティブにします。
ko: <code>Sensor</code> 기반 센서 중 하나를 활성화합니다 .
ru: Активирует один из датчиков на основе <code>Sensor</code> .
zh_cn: 激活基于 <code>Sensor</code> 的传感器之一。

source: Activates stencil testing and updates to the stencil buffer. See <a href="stencilfunc"><code>WebGLRenderingContext.stencilFunc()</code></a>.
ja: ステンシルテストをアクティブにし、ステンシルバッファを更新します。<a href="stencilfunc"> <code>WebGLRenderingContext.stencilFunc()</code> を</a>参照してください。
ko: 스텐실 테스트를 활성화하고 스텐실 버퍼를 업데이트합니다. <a href="stencilfunc"> <code>WebGLRenderingContext.stencilFunc()</code> </a> 참조하십시오 .
ru: Активирует тестирование трафарета и обновление буфера трафарета. Смотрите <a href="stencilfunc"> <code>WebGLRenderingContext.stencilFunc()</code> </a> .
zh_cn: 激活模板测试并更新模板缓冲区。请参阅<a href="stencilfunc"> <code>WebGLRenderingContext.stencilFunc()</code> </a>。

source: Activates the computation of a temporary coverage value determined by the alpha value.
ja: アルファ値で決定された一時的なカバレッジ値の計算をアクティブにします。
ko: 알파 값에 의해 결정된 임시 적용 범위 값의 계산을 활성화합니다.
ru: Активирует расчет временного значения покрытия,определяемого альфа-значением.
zh_cn: 激活由alpha值决定的临时覆盖值的计算。

source: Activates the scissor test that discards fragments that are outside of the scissor rectangle. See <a href="scissor"><code>WebGLRenderingContext.scissor()</code></a>.
ja: シザー長方形の外側にあるフラグメントを破棄するシザーテストをアクティブにします。<a href="scissor"> <code>WebGLRenderingContext.scissor()</code> を</a>参照してください。
ko: 가위 사각형 외부에있는 조각을 삭제하는 가위 테스트를 활성화합니다. <a href="scissor"> <code>WebGLRenderingContext.scissor()</code> </a> 참조하십시오 .
ru: Активирует тест ножниц, который отбрасывает фрагменты, находящиеся за пределами прямоугольника ножниц. Смотрите <a href="scissor"> <code>WebGLRenderingContext.scissor()</code> </a> .
zh_cn: 激活剪刀测试，该测试将丢弃剪刀矩形外部的片段。请参阅<a href="scissor"> <code>WebGLRenderingContext.scissor()</code> </a>。
