Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/dom/dom.*.011.xlf
Languages: ja, ko, ru, zh_cn

source: A handler for the <code><a href="https://developer.mozilla.org/en-US/docs/Web/Events/levelchange">levelchange</a></code> event; This event is sent when the battery level is updated.
ja: <code><a href="https://developer.mozilla.org/en-US/docs/Web/Events/levelchange">levelchange</a></code> イベントのハンドラー。このイベントは、バッテリーレベルが更新されると送信されます。
ko: <code><a href="https://developer.mozilla.org/en-US/docs/Web/Events/levelchange">levelchange</a></code> 이벤트 처리기 . 이 이벤트는 배터리 잔량이 업데이트 될 때 전송됩니다.
ru: Обработчик события <code><a href="https://developer.mozilla.org/en-US/docs/Web/Events/levelchange">levelchange</a></code> ; Это событие отправляется при обновлении уровня заряда батареи.
zh_cn: <code><a href="https://developer.mozilla.org/en-US/docs/Web/Events/levelchange">levelchange</a></code> 事件的处理程序；电池电量更新时发送此事件。

source: A handler for the <code><a href="https://developer.mozilla.org/en-US/docs/Web/Events/load">load</a></code> event. This event is triggered each time the reading operation is successfully completed.
ja: <code><a href="https://developer.mozilla.org/en-US/docs/Web/Events/load">load</a></code> イベントのハンドラー。このイベントは、読み取り操作が正常に完了するたびにトリガーされます。
ko: <code><a href="https://developer.mozilla.org/en-US/docs/Web/Events/load">load</a></code> 이벤트 처리기 이 이벤트는 읽기 작업이 성공적으로 완료 될 때마다 트리거됩니다.
ru: Обработчик события <code><a href="https://developer.mozilla.org/en-US/docs/Web/Events/load">load</a></code> . Это событие вызывается каждый раз, когда операция чтения успешно завершена.
zh_cn: <code><a href="https://developer.mozilla.org/en-US/docs/Web/Events/load">load</a></code> 事件的处理程序。每当读取操作成功完成时，都会触发此事件。

source: A handler for the <code><a href="https://developer.mozilla.org/en-US/docs/Web/Events/loadend">loadend</a></code> event. This event is triggered each time the reading operation is completed (either in success or failure).
ja: <code><a href="https://developer.mozilla.org/en-US/docs/Web/Events/loadend">loadend</a></code> イベントのハンドラー。このイベントは、読み取り操作が完了するたびに（成功または失敗して）トリガーされます。
ko: <code><a href="https://developer.mozilla.org/en-US/docs/Web/Events/loadend">loadend</a></code> 이벤트 핸들러 . 이 이벤트는 읽기 작업이 완료 될 때마다 (성공 또는 실패) 트리거됩니다.
ru: Обработчик события <code><a href="https://developer.mozilla.org/en-US/docs/Web/Events/loadend">loadend</a></code> . Это событие срабатывает каждый раз, когда операция чтения завершается (в случае успеха или неудачи).
zh_cn: <code><a href="https://developer.mozilla.org/en-US/docs/Web/Events/loadend">loadend</a></code> 事件的处理程序。每次读取操作完成（成功或失败）都会触发此事件。

source: A handler for the <code><a href="https://developer.mozilla.org/en-US/docs/Web/Events/loadstart">loadstart</a></code> event. This event is triggered each time the reading is starting.
ja: <code><a href="https://developer.mozilla.org/en-US/docs/Web/Events/loadstart">loadstart</a></code> イベントのハンドラー。このイベントは、読み取りが開始されるたびにトリガーされます。
ko: <code><a href="https://developer.mozilla.org/en-US/docs/Web/Events/loadstart">loadstart</a></code> 이벤트 처리기 이 이벤트는 판독이 시작될 때마다 트리거됩니다.
ru: Обработчик события <code><a href="https://developer.mozilla.org/en-US/docs/Web/Events/loadstart">loadstart</a></code> . Это событие срабатывает каждый раз, когда начинается чтение.
zh_cn: <code><a href="https://developer.mozilla.org/en-US/docs/Web/Events/loadstart">loadstart</a></code> 事件的处理程序。每次开始读取时都会触发此事件。

source: A handler for the <code><a href="https://developer.mozilla.org/en-US/docs/Web/Events/orientationchange">orientationchange</a></code> events.
ja: <code><a href="https://developer.mozilla.org/en-US/docs/Web/Events/orientationchange">orientationchange</a></code> イベントのハンドラー。
ko: <code><a href="https://developer.mozilla.org/en-US/docs/Web/Events/orientationchange">orientationchange</a></code> 이벤트 처리기입니다 .
ru: Обработчик событий <code><a href="https://developer.mozilla.org/en-US/docs/Web/Events/orientationchange">orientationchange</a></code> .
zh_cn: <code><a href="https://developer.mozilla.org/en-US/docs/Web/Events/orientationchange">orientationchange</a></code> 事件的处理程序。

source: A handler for the <code><a href="https://developer.mozilla.org/en-US/docs/Web/Events/progress">progress</a></code> event. This event is triggered while reading a <a href="blob"><code>Blob</code></a> content.
ja: <code><a href="https://developer.mozilla.org/en-US/docs/Web/Events/progress">progress</a></code> イベントのハンドラー。このイベントは、<a href="blob"> <code>Blob</code> </a>コンテンツの読み取り中にトリガーされます。
ko: <code><a href="https://developer.mozilla.org/en-US/docs/Web/Events/progress">progress</a></code> 이벤트 처리기입니다 . 이 이벤트는 <a href="blob"> <code>Blob</code> </a> 컨텐츠 를 읽는 동안 트리거 됩니다.
ru: Обработчик события <code><a href="https://developer.mozilla.org/en-US/docs/Web/Events/progress">progress</a></code> . Это событие вызывается при чтении содержимого <a href="blob"> <code>Blob</code> </a> .
zh_cn: <code><a href="https://developer.mozilla.org/en-US/docs/Web/Events/progress">progress</a></code> 事件的处理程序。读取<a href="blob"> <code>Blob</code> </a>内容时触发此事件。

source: A handler for the <code><a href="https://developer.mozilla.org/en-US/docs/Web/Events/show">show</a></code> event. It is triggered when the notification is displayed.
ja: <code><a href="https://developer.mozilla.org/en-US/docs/Web/Events/show">show</a></code> イベントのハンドラー。通知が表示されるとトリガーされます。
ko: <code><a href="https://developer.mozilla.org/en-US/docs/Web/Events/show">show</a></code> 이벤트 처리기 알림이 표시되면 트리거됩니다.
ru: Обработчик для события <code><a href="https://developer.mozilla.org/en-US/docs/Web/Events/show">show</a></code> . Он срабатывает при отображении уведомления.
zh_cn: <code><a href="https://developer.mozilla.org/en-US/docs/Web/Events/show">show</a></code> 事件的处理程序。显示通知时触发。

source: A handy web audio inspector can be found in the <a href="https://chrome.google.com/webstore/detail/web-audio-inspector/cmhomipkklckpomafalojobppmmidlgl">Chrome Web Store</a>.
ja: 便利なウェブオーディオインスペクタは<a href="https://chrome.google.com/webstore/detail/web-audio-inspector/cmhomipkklckpomafalojobppmmidlgl">Chromeウェブストアにあり</a>ます。
ko: 편리한 웹 오디오 관리자는 <a href="https://chrome.google.com/webstore/detail/web-audio-inspector/cmhomipkklckpomafalojobppmmidlgl">Chrome 웹 스토어</a> 에서 찾을 수 있습니다 .
ru: Удобный веб-аудиоинспектор можно найти в <a href="https://chrome.google.com/webstore/detail/web-audio-inspector/cmhomipkklckpomafalojobppmmidlgl">Chrome Web Store</a> .
zh_cn: 在<a href="https://chrome.google.com/webstore/detail/web-audio-inspector/cmhomipkklckpomafalojobppmmidlgl">Chrome网上应用店中</a>可以找到方便的网络音频检查器。

source: A hardware agnostic representation of input devices that can target a specific coordinate (or set of coordinates) on a screen. Examples of <em>pointer</em> input devices are mouse, pen/stylus, and touch contacts.
ja: 画面上の特定の座標（または座標セット）をターゲットにできる入力デバイスのハードウェアにとらわれない表現。<em>ポインター</em>入力デバイスの例は、マウス、ペン/スタイラス、およびタッチ接点です。
ko: 화면에서 특정 좌표 (또는 좌표 세트)를 대상으로 할 수있는 입력 장치의 하드웨어 불가지론 적 표현. <em>포인터</em> 입력 장치의 예로 는 마우스, 펜 / 스타일러스 및 터치 접점이 있습니다.
ru: Аппаратно-независимое представление устройств ввода, которые могут нацеливать определенную координату (или набор координат) на экране. Примерами устройств ввода <em>указателя</em> являются мышь, перо / стилус и сенсорные контакты.
zh_cn: 输入设备的硬件不可知论表示，可以以屏幕上的特定坐标（或一组坐标）为目标。<em>指针</em>输入设备的示例是鼠标，笔/手写笔和触摸触点。

source: A header's guard affects the <a href="../headers/set"><code>set()</code></a>, <a href="../headers/delete"><code>delete()</code></a>, and <a href="../headers/append"><code>append()</code></a> methods which change the header's contents. A <code>TypeError</code> is thrown if you try to modify a <a href="../headers"><code>Headers</code></a> object whose guard is <code>immutable</code>. However, the operation will work if
ja: ヘッダーのガードは、ヘッダーの内容を変更<a href="../headers/delete"> <code>delete()</code> </a><a href="../headers/set"> <code>set()</code> </a>、delete（）、および<a href="../headers/append"> <code>append()</code> </a>メソッドに影響します。A <code>TypeError</code> 変更しようとした場合にスローされる<a href="../headers"> <code>Headers</code> </a>そのガードであるオブジェクト <code>immutable</code> 。ただし、操作は次の場合に機能します
ko: 헤더의 가드 는 헤더의 내용을 변경하는 <a href="../headers/set"> <code>set()</code> </a> , <a href="../headers/delete"> <code>delete()</code> </a> 및 <a href="../headers/append"> <code>append()</code> </a> 메소드에 영향을줍니다 . <code>TypeError</code> 당신이 수정하려고하면 발생합니다 <a href="../headers"> <code>Headers</code> </a> 그 가드 객체 <code>immutable</code> . 그러나 작업이 작동하면
ru: Защита заголовка влияет на методы <a href="../headers/set"> <code>set()</code> </a> , <a href="../headers/delete"> <code>delete()</code> </a> и <a href="../headers/append"> <code>append()</code> </a> которые изменяют содержимое заголовка. Ошибка <code>TypeError</code> генерируется, если вы пытаетесь изменить объект <a href="../headers"> <code>Headers</code> </a> , защита которого <code>immutable</code> . Однако операция будет работать, если
zh_cn: 标头的防护会影响<a href="../headers/set"> <code>set()</code> </a>，<a href="../headers/delete"> <code>delete()</code> </a>和<a href="../headers/append"> <code>append()</code> </a>方法，这些方法会更改标头的内容。一个 <code>TypeError</code> ，如果你尝试修改抛出<a href="../headers"> <code>Headers</code> </a>的对象，其后卫是 <code>immutable</code> 。但是，如果

source: A helpful exercise at this point is to move the boxes around the clip space by varying the code to get a feel for how points get clipped and moved around in clip space. Try drawing a picture like a boxy smiley face with a background.
ja: このときに役立つ練習として、コードを変えてボックスをクリップスペースの周りに移動させて、ポイントがどのようにクリップされ、クリップスペースの中を移動されるかの感覚を得ることができます。背景に箱型のスマイリーフェイスのような絵を描いてみてください。
ko: 이 시점에서 유용한 연습은 코드를 변경하여 클립 공간에서 상자를 이동하여 포인트가 클립 공간에서 잘리고 이동하는 방법에 대한 느낌을 얻는 것입니다. 배경이있는 웃는 얼굴처럼 그림을 그려보십시오.
ru: Полезное упражнение на данном этапе заключается в перемещении ящиков вокруг пространства клипов,изменяя код,чтобы получить представление о том,как точки обрезаются и перемещаются в пространстве клипов.Попробуйте нарисовать картинку в виде коробочного смайлика с фоном.
zh_cn: 这时一个有用的练习是通过改变代码来移动盒子在夹子空间中的位置,以了解点是如何在夹子空间中被剪断和移动的。试着画一张图片,比如一个有背景的方框笑脸。

source: A high resolution timestamp.
ja: 高解像度のタイムスタンプ。
ko: 고해상도 타임 스탬프
ru: Временная метка высокого разрешения.
zh_cn: 一个高分辨率的时间戳。

source: A historical alias to <a href="event/stoppropagation"><code>Event.stopPropagation()</code></a>. Setting its value to <code>true</code> before returning from an event handler prevents propagation of the event.
ja: <a href="event/stoppropagation"> <code>Event.stopPropagation()</code> の</a>歴史的なエイリアス。イベントハンドラーから戻る前にその値を <code>true</code> に設定すると、イベントの伝播が防止されます。
ko: <a href="event/stoppropagation"> <code>Event.stopPropagation()</code> </a> 의 히스토리 별명 . 이벤트 핸들러에서 리턴하기 전에 값을 <code>true</code> 로 설정 하면 이벤트가 전파되지 않습니다.
ru: Исторический псевдоним <a href="event/stoppropagation"> <code>Event.stopPropagation()</code> </a> . Установка его значения в <code>true</code> перед возвратом из обработчика событий предотвращает распространение события.
zh_cn: <a href="event/stoppropagation"> <code>Event.stopPropagation()</code> 的</a>历史别名。在从事件处理程序返回之前将其值设置为 <code>true</code> 可以防止事件传播。

source: A historical property introduced by Internet Explorer and eventually adopted into the DOM specification in order to ensure existing sites continue to work. Ideally, you should try to use <a href="event/preventdefault"><code>Event.preventDefault()</code></a> and <a href="event/defaultprevented"><code>Event.defaultPrevented</code></a> instead, but you can use <code>returnValue</code> if you choose to do so.
ja: Internet Explorerによって導入され、既存のサイトが引き続き機能することを保証するために最終的にDOM仕様に採用された歴史的な特性。理想的には、代わりに<a href="event/preventdefault"> <code>Event.preventDefault()</code> </a>と<a href="event/defaultprevented"> <code>Event.defaultPrevented</code> </a>を使用する必要がありますが、必要に <code>returnValue</code> を使用できます。
ko: Internet Explorer가 도입하고 기존 사이트가 계속 작동하도록 DOM 사양에 채택 된 역사적 속성입니다. 이상적으로는 <a href="event/preventdefault"> <code>Event.preventDefault()</code> </a> 및 <a href="event/defaultprevented"> <code>Event.defaultPrevented</code> 를</a> 대신 사용하려고 하지만 원하는 경우 <code>returnValue</code> 를 사용할 수 있습니다 .
ru: Историческое свойство, введенное Internet Explorer и в конечном итоге принятое в спецификации DOM, чтобы обеспечить работу существующих сайтов. В идеале вы должны попытаться использовать <a href="event/preventdefault"> <code>Event.preventDefault()</code> </a> и <a href="event/defaultprevented"> <code>Event.defaultPrevented</code> </a> вместо этого, но вы можете использовать <code>returnValue</code> , если вы решите это сделать.
zh_cn: Internet Explorer引入的历史属性，最终被DOM规范采用，以确保现有站点继续工作。理想情况下，您应该尝试改用<a href="event/preventdefault"> <code>Event.preventDefault()</code> </a>和<a href="event/defaultprevented"> <code>Event.defaultPrevented</code> </a>，但是如果选择这样做，则可以使用 <code>returnValue</code> 。

source: A host candidate is one for which its <a href="../rtcicecandidate/ip"><code>ip</code></a> address is the actual, direct IP address of the remote peer.
ja: ホスト候補は、その<a href="../rtcicecandidate/ip"> <code>ip</code> </a>アドレスがリモートピアの実際の直接IPアドレスであるものです。
ko: 호스트 후보는 해당 <a href="../rtcicecandidate/ip"> <code>ip</code> </a> 주소가 원격 피어의 실제 직접 IP 주소 인 후보입니다 .
ru: Кандидатом на хост является тот, для которого его <a href="../rtcicecandidate/ip"> <code>ip</code> </a> адрес является фактическим, прямым IP-адресом удаленного узла.
zh_cn: 候选主机是其<a href="../rtcicecandidate/ip"> <code>ip</code> </a>地址是远程对等方的实际直接IP地址的主机。

source: A human readable description of the plugin.
ja: プラグインの人間が読みやすい説明。
ko: 플러그인에 대한 사람이 읽을 수있는 설명.
ru: Человеческое описание плагина.
zh_cn: 对插件的可读性描述。

source: A human-readable <a href="domstring"><code>DOMString</code></a> which contains the text track's label, if one is present; otherwise, this is an empty string (<code>""</code>), in which case a custom label may need to be generated by your code using other attributes of the track, if the track's label needs to be exposed to the user.
ja: 存在する<a href="domstring"> <code>DOMString</code> </a>、テキストトラックのラベルを含む、人間が読めるDOMString。それ以外の場合、これは空の文字列（ <code>""</code> ）です。この場合、トラックのラベルをユーザーに公開する必要がある場合は、トラックの他の属性を使用してコードでカスタムラベルを生成する必要があります。
ko: 텍스트 트랙의 레이블이있는 경우 사람이 읽을 수있는 <a href="domstring"> <code>DOMString</code> 입니다 (</a> 있는 경우). 그렇지 않으면, 이것은 빈 문자열 ( <code>""</code> )이며,이 경우 트랙의 레이블을 사용자에게 노출해야하는 경우 트랙의 다른 속성을 사용하여 코드에서 사용자 지정 레이블을 생성해야 할 수 있습니다.
ru: <a href="domstring"> <code>DOMString</code> </a> чтения DOMString, которая содержит метку текстовой дорожки, если таковая имеется; в противном случае это пустая строка ( <code>""</code> ), и в этом случае ваш код может сгенерировать пользовательскую метку с использованием других атрибутов дорожки, если метка дорожки должна быть предоставлена ​​пользователю.
zh_cn: 可读的<a href="domstring"> <code>DOMString</code> </a>，包含文本轨道的标签（如果存在）；否则，这是一个空字符串（ <code>""</code> ），在这种情况下，如果轨道的标签需要向用户公开，则您的代码可能需要使用轨道的其他属性来生成自定义标签。

source: A human-readable error message.
ja: 人間が読めるエラーメッセージ。
ko: 사람이 읽을 수있는 오류 메시지
ru: Человеческое сообщение об ошибке.
zh_cn: 一个人类可读的错误信息。

source: A human-readable message that provides more information about why the connection was closed.
ja: 接続が閉じられた理由についての詳細な情報を提供する、人間が読めるメッセージ。
ko: 연결이 닫힌 이유에 대한 자세한 정보를 제공하는 사람이 읽을 수있는 메시지입니다.
ru: Человеческое сообщение,которое предоставляет больше информации о том,почему соединение было закрыто.
zh_cn: 一条人类可读的信息,提供了更多关于为什么关闭连接的信息。

source: A human-readable name for the channel. <code>null</code> is treated as if you specified an empty string (""). This string may not be longer than 65,535 <em>bytes</em>.
ja: 人間が読めるチャネルの名前。 <code>null</code> は、空の文字列（ ""）を指定した場合と同様に扱われます。この文字列は65,535 <em>バイト</em>以下にする必要があり<em>ます</em>。
ko: 사람이 읽을 수있는 채널 이름입니다. 빈 문자열 ( "")을 지정한 것처럼 <code>null</code> 이 처리됩니다. 이 문자열은 65,535 <em>바이트를</em> 초과 할 수 없습니다 .
ru: Удобное для восприятия название канала. <code>null</code> обрабатывается так, как если бы вы указали пустую строку (""). Эта строка не может быть длиннее 65 535 <em>байт</em> .
zh_cn: 通道的易读名称。 <code>null</code> 视为您指定了空字符串（&ldquo;&rdquo;）。该字符串不能超过65,535 <em>个字节</em>。

source: A human-readable name to identify the <code>VRDevice</code>.
ja: <code>VRDevice</code> を識別する、人間が読める形式の名前。
ko: <code>VRDevice</code> 를 식별하기위한 사람이 읽을 수있는 이름 입니다.
ru: <code>VRDevice</code> имя для идентификации устройства VRD .
zh_cn: 易于识别的名称，用于标识 <code>VRDevice</code> 。

source: A human-readable reason why the event was fired.
ja: イベントがクビになった理由を人間が読み取れるようにしたもの。
ko: 이벤트가 발생한 이유는 사람이 읽을 수있는 이유입니다.
ru: Человеческая причина,по которой это событие было уволено.
zh_cn: 一个人类可以读懂的理由,为什么事件被解雇。

source: A human-readable string explaining why the connection is closing. This string must be no longer than 123 bytes of UTF-8 text (<strong>not</strong> characters).
ja: 接続が閉じている理由を説明する人間が読める文字列。この文字列は、もはやUTF-8テキスト（123バイト以下にする必要があり<strong>ません</strong>文字）。
ko: 연결이 닫히는 이유를 설명하는 사람이 읽을 수있는 문자열입니다. 이 문자열은 더 이상 UTF-8 텍스트의 123 바이트 (이하 여야한다 <strong>없습니다</strong> 문자).
ru: Удобная для чтения строка, объясняющая, почему соединение закрывается. Эта строка не должна превышать 123 байта текста UTF-8 ( <strong>не</strong> символов).
zh_cn: 易于理解的字符串，用于说明连接为何关闭。该字符串不得超过123个字节的UTF-8文本（<strong>非</strong>字符）。

source: A key can be one of the following types: <a href="https://developer.mozilla.org/en/JavaScript/Reference/Global_Objects/String">string</a>, <a href="https://developer.mozilla.org/en/JavaScript/Reference/Global_Objects/Date">date</a>, float, a binary blob, and <a href="https://developer.mozilla.org/en/JavaScript/Reference/Global_Objects/Array">array</a>. For arrays, the key can range from an empty value to infinity. And you can include an array within an array.
ja: キーは、<a href="https://developer.mozilla.org/en/JavaScript/Reference/Global_Objects/String">string</a>、<a href="https://developer.mozilla.org/en/JavaScript/Reference/Global_Objects/Date">date</a>、float、バイナリblob、および<a href="https://developer.mozilla.org/en/JavaScript/Reference/Global_Objects/Array">arrayの</a>いずれかのタイプになります。配列の場合、キーの範囲は空の値から無限大までです。また、配列内に配列を含めることができます。
ko: 키는 <a href="https://developer.mozilla.org/en/JavaScript/Reference/Global_Objects/String">string</a> , <a href="https://developer.mozilla.org/en/JavaScript/Reference/Global_Objects/Date">date</a> , float, binary blob 및 <a href="https://developer.mozilla.org/en/JavaScript/Reference/Global_Objects/Array">array</a> 유형 중 하나 일 수 있습니다 . 배열의 경우 키는 빈 값에서 무한대까지 다양합니다. 그리고 배열 안에 배열을 포함시킬 수 있습니다.
ru: Ключ может быть одного из следующих типов: <a href="https://developer.mozilla.org/en/JavaScript/Reference/Global_Objects/String">строка</a> , <a href="https://developer.mozilla.org/en/JavaScript/Reference/Global_Objects/Date">дата</a> , число с плавающей запятой, двоичный двоичный объект и <a href="https://developer.mozilla.org/en/JavaScript/Reference/Global_Objects/Array">массив</a> . Для массивов ключ может варьироваться от пустого значения до бесконечности. И вы можете включить массив в массив.
zh_cn: 键可以是以下类型之一：<a href="https://developer.mozilla.org/en/JavaScript/Reference/Global_Objects/String">string</a>，<a href="https://developer.mozilla.org/en/JavaScript/Reference/Global_Objects/Date">date</a>，float，二进制blob和<a href="https://developer.mozilla.org/en/JavaScript/Reference/Global_Objects/Array">array</a>。对于数组，键的范围可以从空值到无穷大。您可以在数组中包含一个数组。

source: A key difference between the <a href="datatransfer"><code>DataTransfer</code></a> and <a href="datatransferitem"><code>DataTransferItem</code></a> interfaces is that the former uses the synchronous <a href="datatransfer/getdata"><code>getData()</code></a> method to access a drag item's data, whereas the latter uses the asynchronous <a href="datatransferitem/getasstring"><code>getAsString()</code></a> method to access a drag item's data.
ja: 主な違い<a href="datatransfer"> <code>DataTransfer</code> </a>と<a href="datatransferitem"> <code>DataTransferItem</code> </a>インターフェースは、前者の使用同期点である<a href="datatransfer/getdata"> <code>getData()</code> </a>アクセスする方法ドラッグ項目のデータ、後者の用途に対し非同期<a href="datatransferitem/getasstring"> <code>getAsString()</code> </a>アクセスドラッグアイテムのデータへの方法。
ko: <a href="datatransfer"> <code>DataTransfer</code> </a> 와 <a href="datatransferitem"> <code>DataTransferItem</code> </a> 인터페이스 의 주요 차이점 은 전자는 동기 <a href="datatransfer/getdata"> <code>getData()</code> </a> 메소드를 사용하여 드래그 항목의 데이터에 액세스하는 반면, 후자는 비동기 <a href="datatransferitem/getasstring"> <code>getAsString()</code> </a> 메소드를 사용하여 드래그 항목의 데이터에 액세스한다는 것입니다.
ru: Основное различие между <a href="datatransfer"> <code>DataTransfer</code> </a> и <a href="datatransferitem"> <code>DataTransferItem</code> </a> интерфейсами является то , что первым использует синхронный <a href="datatransfer/getdata"> <code>getData()</code> </a> метод , чтобы получить доступ к данным перетаскивания элемента, в то время как вторые используют асинхронный <a href="datatransferitem/getasstring"> <code>getAsString()</code> </a> метод для доступа к данным перетаскивания элемента.
zh_cn: <a href="datatransfer"> <code>DataTransfer</code> </a>和<a href="datatransferitem"> <code>DataTransferItem</code> </a>接口之间的主要区别在于，前者使用同步<a href="datatransfer/getdata"> <code>getData()</code> </a>方法访问拖动项的数据，而后者使用异步<a href="datatransferitem/getasstring"> <code>getAsString()</code> </a>方法访问拖动项的数据。

source: A key is in a key range if the following conditions are true:
ja: 以下の条件が真の場合、キーはキー範囲内にあります。
ko: 다음 조건에 해당하는 경우 키는 키 범위에 있습니다.
ru: Ключ находится в диапазоне ключей,если следующие условия верны:
zh_cn: 如果以下条件为真,则钥匙在钥匙范围内。

source: A key on numpad pressed
ja: numpadのキーが押された
ko: 숫자 키패드의 키를 눌렀습니다.
ru: Нажатая клавиша на нумерационной панели
zh_cn: 拨号盘上的一个键被按下

source: A key or <a href="../idbkeyrange"><code>IDBKeyRange</code></a> object that specifies a range of records you want to count.
ja: カウントするレコードの範囲を指定するキーまたは<a href="../idbkeyrange"> <code>IDBKeyRange</code> </a>オブジェクト。
ko: 계산할 레코드 범위를 지정하는 키 또는 <a href="../idbkeyrange"> <code>IDBKeyRange</code> </a> 개체입니다.
ru: Ключ или объект <a href="../idbkeyrange"> <code>IDBKeyRange</code> ,</a> который определяет диапазон записей, которые вы хотите считать.
zh_cn: 一个键或<a href="../idbkeyrange"> <code>IDBKeyRange</code> </a>对象，它指定要计数的记录范围。

source: A key or <a href="../idbkeyrange"><code>IDBKeyRange</code></a> that identifies a record to be retrieved. If this value is null or missing, the browser will use an unbound key range.
ja: 取得するレコードを識別するキーまたは<a href="../idbkeyrange"> <code>IDBKeyRange</code> </a>。この値がnullまたは欠落している場合、ブラウザーはバインドされていないキー範囲を使用します。
ko: 검색 할 레코드를 식별하는 키 또는 <a href="../idbkeyrange"> <code>IDBKeyRange</code> </a>이 값이 null이거나 누락 된 경우 브라우저는 언 바운드 키 범위를 사용합니다.
ru: Ключ или <a href="../idbkeyrange"> <code>IDBKeyRange</code> ,</a> который идентифицирует запись для извлечения. Если это значение равно нулю или отсутствует, браузер будет использовать диапазон несвязанных ключей.
zh_cn: 标识要检索的记录的键或<a href="../idbkeyrange"> <code>IDBKeyRange</code> </a>。如果此值为null或缺失，则浏览器将使用未绑定的键范围。

source: A key or <a href="../idbkeyrange"><code>IDBKeyRange</code></a> that identifies the record to be retrieved. If this value is null or missing, the browser will use an unbound key range.
ja: 取得するレコードを識別するキーまたは<a href="../idbkeyrange"> <code>IDBKeyRange</code> </a>。この値がnullまたは欠落している場合、ブラウザーはバインドされていないキー範囲を使用します。
ko: 검색 할 레코드를 식별 하는 키 또는 <a href="../idbkeyrange"> <code>IDBKeyRange</code> </a>이 값이 null이거나 누락 된 경우 브라우저는 언 바운드 키 범위를 사용합니다.
ru: Ключ или <a href="../idbkeyrange"> <code>IDBKeyRange</code> ,</a> который идентифицирует запись для извлечения. Если это значение равно нулю или отсутствует, браузер будет использовать диапазон несвязанных ключей.
zh_cn: 标识要检索的记录的键或<a href="../idbkeyrange"> <code>IDBKeyRange</code> </a>。如果此值为null或缺失，则浏览器将使用未绑定的键范围。
