Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/dom/dom.*.007.xlf
Languages: es, ko, ru, zh_cn

source: <em>be detached</em>, which is the case for <code>SVGAngle</code> objects created with <a href="https://developer.mozilla.org/en-US/docs/Web/API/SVGSVGElement/createSVGAngle"><code>SVGSVGElement.createSVGAngle()</code></a>.
es: <em>separarse</em> , que es el caso de los objetos <code>SVGAngle</code> creados con <a href="https://developer.mozilla.org/en-US/docs/Web/API/SVGSVGElement/createSVGAngle"> <code>SVGSVGElement.createSVGAngle()</code> </a> .
ko: <em></em><a href="https://developer.mozilla.org/en-US/docs/Web/API/SVGSVGElement/createSVGAngle"> <code>SVGSVGElement.createSVGAngle()</code> </a> 만든 <code>SVGAngle</code> 객체 의 경우 <em>분리</em> 됩니다.
ru: <em>быть отсоединенным</em> , что имеет место для объектов <code>SVGAngle</code> , созданных с помощью <a href="https://developer.mozilla.org/en-US/docs/Web/API/SVGSVGElement/createSVGAngle"> <code>SVGSVGElement.createSVGAngle()</code> </a> .
zh_cn: <em>被分离</em>，使用<a href="https://developer.mozilla.org/en-US/docs/Web/API/SVGSVGElement/createSVGAngle"> <code>SVGSVGElement.createSVGAngle()</code> </a>创建的 <code>SVGAngle</code> 对象就是这种情况。

source: <em>before</em> is optional and an element of the collection, or an index of type <em>long</em>, representing the item <em>item </em>should be inserted before. If this parameter is <code>null</code> (or the index does not exist), the new element is appended to the end of the collection.
es: <em>antes</em> es opcional y un elemento de la colecci&oacute;n, o un &iacute;ndice de tipo <em>largo</em> , que representa el elemento del <em>elemento,</em> debe insertarse antes. Si este par&aacute;metro es <code>null</code> (o el &iacute;ndice no existe), el nuevo elemento se agrega al final de la colecci&oacute;n.
ko: <em>before</em> 는 선택 사항이며 항목 <em>항목을</em> 나타내는 컬렉션의 요소 또는 <em>long</em> 유형의 인덱스를 앞에 삽입해야합니다. 이 매개 변수가 <code>null</code> (또는 색인이없는 경우)이면 새 요소가 콜렉션의 끝에 추가됩니다.<em></em>
ru: <em>before</em> является необязательным, и перед этим должен быть вставлен элемент коллекции или индекс типа <em>long</em> , представляющий элемент <em>item</em> . Если этот параметр имеет значение <code>null</code> (или индекс не существует), новый элемент добавляется в конец коллекции.
zh_cn: <em>之前</em>是可选的，并且收集，或类型的索引的元素<em>长</em>，代表项目<em>项目</em>应之前被插入。如果此参数为 <code>null</code> （或索引不存在），则新元素将附加到集合的末尾。

source: <em>bound</em> specifies the upper bound of the new key range.
es: <em>l&iacute;mite</em> especifica el l&iacute;mite superior del nuevo rango de claves.
ko: <em>bound</em> 는 새 키 범위의 상한을 지정합니다.
ru: <em>граница</em> определяет верхнюю границу нового диапазона ключей.
zh_cn: <em>bound</em>指定新键范围的上限。

source: <em>deep Optional</em>
es: <em>profundo opcional</em>
ko: <em>깊은 선택</em>
ru: <em>глубокий необязательно</em>
zh_cn: <em>深度可选</em>

source: <em>digest</em>, the ability to compute a hash of an arbitrary block of data, in order to detect any change in it.
es: <em>resumen</em> , la capacidad de calcular un hash de un bloque arbitrario de datos, para detectar cualquier cambio en &eacute;l.
ko: <em>digest-</em> 임의의 데이터 블록의 해시를 계산하여 변경 사항을 감지하는 기능.
ru: <em>дайджест</em> , возможность вычислить хэш произвольного блока данных, чтобы обнаружить любое изменение в нем.
zh_cn: <em>摘要</em>，一种计算任意数据块的哈希值的能力，以便检测其中的任何更改。

source: <em>direction </em>Optional
es: <em>direcci&oacute;n</em> opcional
ko: <em>방향</em> 옵션
ru: <em>направление</em> Необязательно
zh_cn: <em>方向</em>可选

source: <em>distortion</em> is a <a href="../waveshapernode"><code>WaveShaperNode</code></a>.
es: <em>La distorsi&oacute;n</em> es un <a href="../waveshapernode"> <code>WaveShaperNode</code> </a> .
ko: <em>왜곡</em> 은 <a href="../waveshapernode"> <code>WaveShaperNode</code> </a> 입니다.
ru: <em>искажение</em> является <a href="../waveshapernode"> <code>WaveShaperNode</code> </a> .
zh_cn: <em>变形</em>是<a href="../waveshapernode"> <code>WaveShaperNode</code> </a>。

source: <em>documentType </em>Optional
es: <em>documentType</em> Opcional
ko: <em>documentType</em> 선택 사항
ru: <em>documentType</em> Необязательно
zh_cn: <em>documentType</em>可选

source: <em>element.</em><strong>dataset</strong>.<em>camelCasedName</em> = <em>string</em>;
es: <em>elemento. </em><strong>conjunto de datos</strong> . <em>camelCasedName</em> = <em>cadena</em> ;
ko: <em>요소. </em><strong>데이터 세트</strong> . <em>camelCasedName</em> = <em>문자열</em> ;
ru: <em>элемент. </em><strong>набор данных</strong> . <em>camelCasedName</em> = <em>string</em> ;
zh_cn: <em>元件。</em><strong>数据集</strong>。<em>camelCasedName</em> = <em>字符串</em>；

source: <em>element</em> is the <a href="../element"><code>Element</code></a> at the top of the tree of elements to be dealt with.
ko: <em>element</em> 는 처리 할 <a href="../element"> <code>Element</code> </a> 트리의 맨 위에 있는 요소 입니다.
ru: <em>Элемент</em> - это <a href="../element"> <code>Element</code> </a> в верхней части дерева элементов, с которыми нужно иметь дело.
zh_cn: <em>element</em>是要处理的元素树顶部的<a href="../element"> <code>Element</code> </a>。

source: <em>element</em>.<strong>dataset</strong>[<em>camelCasedName</em>] = <em>string</em>;
es: <em>elemento</em> . <strong>conjunto de datos</strong> [ <em>camelCasedName</em> ] = <em>cadena</em> ;
ko: <em>요소</em> . <strong>데이터 세트</strong> [ <em>camelCasedName</em> ] = <em>문자열</em> ;
ru: <em>элемент</em> . <strong>набор данных</strong> [ <em>camelCasedName</em> ] = <em>строка</em> ;
zh_cn: <em>元素</em>。<strong>数据集</strong> [ <em>camelCasedName</em> ] = <em>字符串</em> ;

source: <em>elt</em> is the <a href="../element"><code>Element</code></a> which is the closest ancestor of the selected elements. It may be null.
es: <em>elt</em> es el <a href="../element"> <code>Element</code> </a> que es el ancestro m&aacute;s cercano de los elementos seleccionados. Puede ser nulo.
ko: <em>ELT는</em> 은 IS <a href="../element"> <code>Element</code> </a> 선택된 요소의 가장 가까운 상위하다. null 일 수 있습니다.
ru: <em>elt</em> - <a href="../element"> <code>Element</code> </a> который является ближайшим предком выбранных элементов. Это может быть ноль.
zh_cn: <em>elt</em>是<a href="../element"> <code>Element</code> </a>，它是所选元素的最接近的祖先。它可以为空。

source: <em>encrypt</em> and <em>decrypt</em>, the ability to encode or decode a document.
es: <em>cifrar</em> y <em>descifrar</em> , la capacidad de codificar o decodificar un documento.
ko: <em>암호화</em> 및 <em>해독</em> , 문서를 인코딩 또는 디코딩하는 기능.
ru: <em>шифровать</em> и <em>дешифровать</em> , возможность кодировать или декодировать документ.
zh_cn: <em>加密</em>和<em>解密</em>，具有对文档进行编码或解码的能力。

source: <em>entityReferenceExpansion<em> Optional</em></em>
es: <em>entityReferenceExpansion <em>Opcional</em></em>
ko: <em>entityReferenceExpansion <em>선택 사항</em></em>
ru: <em>entityReferenceExpansion <em>Необязательно</em></em>
zh_cn: <em>entityReferenceExpansion <em>可选</em></em>

source: <em>enumeratedValue</em> is one of <code>'none'</code>, <code>'2x'</code>, or <code>'4x'</code>.
es: <em>enumeratedValue</em> es uno de <code>'none'</code> , <code>'2x'</code> o <code>'4x'</code> .
ko: <em>enumeratedValue</em> 는 <code>'none'</code> , <code>'2x'</code> 또는 <code>'4x'</code> 중 하나입니다 .
ru: <em>enumeratedValue</em> является одним из <code>'none'</code> , <code>'2x'</code> или <code>'4x'</code> .
zh_cn: <em>enumeratedValue</em>是 <code>'none'</code> ， <code>'2x'</code> 或 <code>'4x'</code> 之一。

source: <em>filter <em>Optional</em></em>
es: <em>filtro <em>opcional</em></em>
ko: <em>필터 <em>옵션</em></em>
ru: <em>фильтр <em>Необязательно</em></em>
zh_cn: <em>过滤器<em>可选</em></em>

source: <em>idx</em> is an unsigned long.
es: <em>idx</em> es un largo sin signo.
ko: <em>idx</em> 는 부호없는 long입니다.
ru: <em>idx</em> является неподписанным длинным.
zh_cn: <em>idx</em>是一个无符号的长<em>整数</em>。

source: <em>import</em> and <em>export</em>, the ability to import a key or export a key.
es: <em>importar</em> y <em>exportar</em> , la capacidad de importar una clave o exportar una clave.
ko: <em>가져 오기</em> 및 <em>내보내기-</em> 키를 가져 오거나 키를 내보내는 기능.
ru: <em>импорт</em> и <em>экспорт</em> , возможность импортировать ключ или экспортировать ключ.
zh_cn: <em>导入</em>和<em>导出</em>，具有导入密钥或导出密钥的能力。

source: <em>in </em><a href="https://developer.mozilla.org/en-US/docs/Web/CSS/color_value#rgb"><code>rgb format</code></a><em>: #RRGGBB</em>
es: <em>en </em><a href="https://developer.mozilla.org/en-US/docs/Web/CSS/color_value#rgb"> <code>rgb format</code> </a><em> : #RRGGBB</em>
ko: <em>에서 </em><a href="https://developer.mozilla.org/en-US/docs/Web/CSS/color_value#rgb"> <code>rgb format</code> </a><em> : #RRGGBB</em>
ru: <em>в </em><a href="https://developer.mozilla.org/en-US/docs/Web/CSS/color_value#rgb"> <code>rgb format</code> </a><em> : #RRGGBB</em>
zh_cn: <em>以</em><a href="https://developer.mozilla.org/en-US/docs/Web/CSS/color_value#rgb"> <code>rgb format</code> </a><em>：#RRGGBB</em>

source: <em>index </em>is a long for the index of the <a href="../htmloptionelement"><code>HTMLOptionElement</code></a> to remove from the collection. If the index is not found the method has no effect.
es: <em>index</em> es un per&iacute;odo largo para que el &iacute;ndice de <a href="../htmloptionelement"> <code>HTMLOptionElement</code> se</a> elimine de la colecci&oacute;n. Si no se encuentra el &iacute;ndice, el m&eacute;todo no tiene efecto.
ko: <em>index</em> 는 <a href="../htmloptionelement"> <code>HTMLOptionElement</code> </a> 의 색인 이 콜렉션에서 제거되는 데 오래 걸립니다 . 색인을 찾지 못하면이 방법은 효과가 없습니다.
ru: <em>index</em> является длинным для индекса <a href="../htmloptionelement"> <code>HTMLOptionElement</code> ,который</a> нужно удалить из коллекции. Если индекс не найден, метод не имеет никакого эффекта.
zh_cn: <em>index</em>是将<a href="../htmloptionelement"> <code>HTMLOptionElement</code> </a>的索引从集合中删除的时间。如果找不到索引，则该方法无效。

source: <em>intElemScrollHeight</em> is a variable storing an integer corresponding to the scrollHeight pixel value of the element. The scrollHeight property is read-only.
es: <em>intElemScrollHeight</em> es una variable que almacena un n&uacute;mero entero correspondiente al valor de p&iacute;xel scrollHeight del elemento. La propiedad scrollHeight es de solo lectura.
ko: <em>intElemScrollHeight</em> 는 요소의 scrollHeight 픽셀 값에 해당하는 정수를 저장하는 변수입니다. scrollHeight 속성은 읽기 전용입니다.
ru: <em>intElemScrollHeight</em> - это переменная, хранящая целое число, соответствующее пиксельному значению scrollHeight элемента. Свойство scrollHeight доступно только для чтения.
zh_cn: <em>intElemScrollHeight</em>是一个变量，用于存储一个与元素的scrollHeight像素值相对应的整数。scrollHeight属性是只读的。

source: <em>integer number in the range of 1-7</em>
es: <em>n&uacute;mero entero en el rango de 1-7</em>
ko: <em>1-7 범위의 정수</em>
ru: <em>целое число в диапазоне 1-7</em>
zh_cn: <em>1-7范围内的整数</em>

source: <em>item</em> is a <a href="../htmloptionelement"><code>HTMLOptionElement</code></a>.
es: <em>El elemento</em> es un <a href="../htmloptionelement"> <code>HTMLOptionElement</code> </a> .
ko: <em>item</em> 은 <a href="../htmloptionelement"> <code>HTMLOptionElement</code> </a> 입니다.
ru: <em>Элемент</em> является <a href="../htmloptionelement"> <code>HTMLOptionElement</code> </a> .
zh_cn: <em>item</em>是一个<a href="../htmloptionelement"> <code>HTMLOptionElement</code> </a>。

source: <em>item</em> is a <a href="../radionodelist"><code>RadioNodeList</code></a> , <a href="../element"><code>Element</code></a>, or <a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/null"><code>null</code></a>.
es: <em>El elemento</em> es <a href="../radionodelist"> <code>RadioNodeList</code> </a> , <a href="../element"> <code>Element</code> </a> o <a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/null"> <code>null</code> </a> .
ko: <em>item</em> 은 <a href="../radionodelist"> <code>RadioNodeList</code> </a> , <a href="../element"> <code>Element</code> </a> 또는 <a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/null"> <code>null</code> </a> 입니다.
ru: <em>item</em> - это <a href="../radionodelist"> <code>RadioNodeList</code> </a> , <a href="../element"> <code>Element</code> </a> или <a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/null"> <code>null</code> </a> .
zh_cn: <em>item</em>是<a href="../radionodelist"> <code>RadioNodeList</code> </a>，<a href="../element"> <code>Element</code> </a>或<a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/null"> <code>null</code> </a>。

source: <em>item</em> is an <a href="../htmloptionelement"><code>HTMLOptionElement</code></a> or <a href="../htmloptgroupelement"><code>HTMLOptGroupElement</code></a>
es: <em>El elemento</em> es un <a href="../htmloptionelement"> <code>HTMLOptionElement</code> </a> o <a href="../htmloptgroupelement"> <code>HTMLOptGroupElement</code> </a>
ko: <em>item</em> 은 <a href="../htmloptionelement"> <code>HTMLOptionElement</code> </a> 또는 <a href="../htmloptgroupelement"> <code>HTMLOptGroupElement</code> 입니다.</a>
ru: <em>элемент</em> является <a href="../htmloptionelement"> <code>HTMLOptionElement</code> </a> или <a href="../htmloptgroupelement"> <code>HTMLOptGroupElement</code> </a>
zh_cn: <em>项目</em>是<a href="../htmloptionelement"> <code>HTMLOptionElement</code> </a>或<a href="../htmloptgroupelement"> <code>HTMLOptGroupElement</code> </a>

source: <em>key </em>The key you want to check for in your key range. This can be any type.
es: <em>clave</em> La clave que desea verificar en su rango de claves. Esto puede ser de cualquier tipo.
ko: <em>키</em> 키 범위에서 확인하려는 키입니다. 이것은 모든 유형이 될 수 있습니다.
ru: <em>ключ</em> Ключ, который вы хотите проверить в вашем диапазоне ключей. Это может быть любой тип.
zh_cn: <em>密钥</em>要在密钥范围内检查的密钥。可以是任何类型。

source: <em>key generation</em>, the ability to create a cryptographically secure key, or key pair, without the use of base key, but using the available entropy of the local system.
es: <em>generaci&oacute;n de claves</em> , la capacidad de crear una clave criptogr&aacute;ficamente segura, o par de claves, sin el uso de la clave base, pero utilizando la entrop&iacute;a disponible del sistema local.
ko: <em>키 생성-</em> 기본 키를 사용하지 않고 로컬 시스템의 사용 가능한 엔트로피를 사용하여 암호화 보안 키 또는 키 쌍을 생성하는 기능.
ru: <em>генерация ключа</em> , возможность создания криптографически защищенного ключа или пары ключей без использования базового ключа, но с использованием доступной энтропии локальной системы.
zh_cn: <em>密钥生成</em>，一种创建加密安全密钥或密钥对的能力，无需使用基本密钥，而是使用本地系统的可用熵。

source: <em>key wrapping</em> and <em>unwrapping</em>, the ability to transmit, and to receive, a key from a third party, encoded using another key, without exposing the underlying key to JavaScript.
es: <em>envoltorio clave</em> y <em>desenvolver</em> , la capacidad de transmitir y recibir, una llave de un tercero, codificado utilizando otra clave, sin exponer la clave subyacente a JavaScript.
ko: <em>키 랩핑</em> 및 <em>언 랩핑</em> , 기본 키를 JavaScript에 노출시키지 않고 다른 키를 사용하여 인코딩 된 타사에서 키를 전송 및 수신하는 기능.
ru: <em>обертывание</em> и <em>распаковка </em><em>ключей</em> , возможность передавать и получать ключ от третьей стороны, закодированный с использованием другого ключа, без предоставления базового ключа JavaScript.
zh_cn: <em>密钥包装</em>和<em>展开</em>，能够将发送和接收，从第三方密钥，使用另一密钥进行编码，而不暴露下面的键为JavaScript。

source: <em>key</em> is a <a href="../cryptokey"><code>CryptoKey</code></a> containing the private key to be used for signing.
es: <em>La clave</em> es una <a href="../cryptokey"> <code>CryptoKey</code> que</a> contiene la clave privada que se utilizar&aacute; para firmar.
ko: <em>key</em> 는 서명에 사용될 개인 키를 포함 하는 <a href="../cryptokey"> <code>CryptoKey</code> </a> 입니다.
ru: <em>ключ</em> - это <a href="../cryptokey"> <code>CryptoKey</code> ,</a> содержащий закрытый ключ, который будет использоваться для подписи.
zh_cn: <em>key</em>是一个<a href="../cryptokey"> <code>CryptoKey</code> ,</a>其中包含要用于签名的私钥。

source: <em>mac</em>, the ability to compute a message authentication code.
es: <em>mac</em> , la capacidad de calcular un c&oacute;digo de autenticaci&oacute;n de mensaje.
ko: <em></em>메시지 인증 코드를 계산하는 기능인 <em>mac</em>
ru: <em>mac</em> , возможность вычислить код аутентификации сообщения.
zh_cn: <em>mac</em>，具有计算消息身份验证代码的能力。

source: <em>nameOfColor (case insensitive)</em>
es: <em>nameOfColor (no distingue entre may&uacute;sculas y min&uacute;sculas)</em>
ko: <em>nameOfColor (대소 문자 구분)</em>
ru: <em>nameOfColor (без учета регистра)</em>
zh_cn: <em>nameOfColor（不区分大小写）</em>

source: <em>open </em>indicates whether the upper bound excludes the endpoint value. The default is false. Optional
es: <em>abierto</em> indica si el l&iacute;mite superior excluye el valor del punto final. El valor predeterminado es falso. Opcional
ko: <em>open</em> 은 상한이 엔드 포인트 값을 제외하는지 여부를 나타냅니다. 기본값은 false입니다. 선택 과목
ru: <em>open</em> указывает, исключает ли верхняя граница значение конечной точки. По умолчанию установлено значение false. По желанию
zh_cn: <em>open</em>表示上限是否排除端点值。默认值为false。可选的

source: <em>option</em><em>s</em> is an optional <code>BlobPropertyBag</code> dictionary which may specify the following two attributes:
es: <em>la opci&oacute;n </em><em>s</em> es un diccionario opcional <code>BlobPropertyBag</code> que puede especificar los siguientes dos atributos:
ko: <em>옵션 </em><em>s</em> 는 다음 두 속성을 지정할 수 있는 선택적 <code>BlobPropertyBag</code> 사전입니다.
ru: <em>option </em><em>s</em> - это необязательный словарь <code>BlobPropertyBag</code> , который может указывать следующие два атрибута:
zh_cn: <em>option </em><em>s</em>是可选的 <code>BlobPropertyBag</code> 字典，可以指定以下两个属性：

source: <em>options Optional</em>
es: <em>opciones opcionales</em>
ko: <em>옵션</em>
ru: <em>варианты Необязательно</em>
zh_cn: <em>选项可选</em>

source: <em>query </em>Optional
es: <em>consulta</em> Opcional
ko: <em>쿼리</em> 옵션
ru: <em>запрос</em> Необязательно
zh_cn: <em>查询</em>可选

source: <em>random</em>, the ability to generate cryptographically sound pseudo-random numbers.
es: <em>aleatorio</em> , la capacidad de generar n&uacute;meros pseudoaleatorios criptogr&aacute;ficamente s&oacute;lidos.
ko: <em>random</em> , 암호화 적으로 안전한 의사 난수를 생성하는 기능.
ru: <em>случайный</em> , способность генерировать криптографически обоснованные псевдослучайные числа.
zh_cn: <em>random</em>，具有生成密码学上合理的伪随机数的能力。

source: <em>reflect the base value</em> of a reflected animatable attribute (being exposed through the <code><a href="https://developer.mozilla.org/en-US/docs/Web/SVG/Attribute/baseVal">baseVal</a></code> member of an <a href="svganimatedangle"><code>SVGAnimatedAngle</code></a>),
es: <em>reflejar el valor base</em> de un atributo animable reflejado (exponerse a trav&eacute;s del miembro <code><a href="https://developer.mozilla.org/en-US/docs/Web/SVG/Attribute/baseVal">baseVal</a></code> de un <a href="svganimatedangle"> <code>SVGAnimatedAngle</code> </a> ),
ko: <em></em><a href="svganimatedangle"> <code>SVGAnimatedAngle</code> </a> 의 <code><a href="https://developer.mozilla.org/en-US/docs/Web/SVG/Attribute/baseVal">baseVal</a></code> 멤버를 통해 노출되는 반사 가능한 애니메이션 가능 속성 <em>의 기본 값</em> 을 <em>반영합니다</em> .
ru: <em>отражают базовое значение</em> отраженного анимируемого атрибута (подвергаясь через <code><a href="https://developer.mozilla.org/en-US/docs/Web/SVG/Attribute/baseVal">baseVal</a></code> члена в <a href="svganimatedangle"> <code>SVGAnimatedAngle</code> </a> ),
zh_cn: <em>反映</em>反射的可设置动画的属性<em>的基本值</em>（通过<a href="svganimatedangle"> <code>SVGAnimatedAngle</code> </a>的 <code><a href="https://developer.mozilla.org/en-US/docs/Web/SVG/Attribute/baseVal">baseVal</a></code> 成员公开），

source: <em>rgb(x,x,x) (x in 0-255 range)</em>
es: <em>rgb (x, x, x) (x en el rango 0-255)</em>
ko: <em>rgb (x, x, x) (0-255 범위의 x)</em>
ru: <em>RGB (х, х, х) (х в диапазоне 0-255)</em>
zh_cn: <em>rgb（x，x，x）（x在0-255范围内）</em>

source: <em>selectors</em> is a <a href="../domstring"><code>DOMString</code></a> containing a selector list like <code>"p:hover, .toto + q"</code>
es: <em>selectores</em> es un <a href="../domstring"> <code>DOMString</code> que</a> contiene una lista de selectores como <code>"p:hover, .toto + q"</code>
ko: <em>선택기</em> 는 <code>"p:hover, .toto + q"</code> 와 같은 선택기 목록을 포함 하는 <a href="../domstring"> <code>DOMString</code> </a> 입니다.
ru: <em>selectors</em> - это <a href="../domstring"> <code>DOMString</code> ,</a> содержащая список селекторов, такой как <code>"p:hover, .toto + q"</code>
zh_cn: <em>选择器</em>是一个包含选择器列表的<a href="../domstring"> <code>DOMString</code> </a>，例如 <code>"p:hover, .toto + q"</code>

source: <em>sign</em> and <em>verify</em>, the ability to digitally sign a document, and to verify a signature.
es: <em>firmar</em> y <em>verificar</em> , la capacidad de firmar digitalmente un documento y verificar una firma.
ko: <em>sign</em> and <em>verify</em> , 문서에 디지털 서명 및 서명 확인 기능.
ru: <em>подписать</em> и <em>проверить</em> , возможность цифровой подписи документа и проверки подписи.
zh_cn: <em>签名</em>和<em>验证</em>，具有对文档进行数字签名以及验证签名的能力。

source: <em>str</em> is a <a href="../domstring"><code>DOMString</code></a>
es: <em>str</em> es un <a href="../domstring"> <code>DOMString</code> </a>
ko: <em>str</em> 은 <a href="../domstring"> <code>DOMString</code> 입니다</a>
ru: <em>str</em> является <a href="../domstring"> <code>DOMString</code> </a>
zh_cn: <em>str</em>是<a href="../domstring"> <code>DOMString</code> </a>

source: <em>string</em> = <em>element</em>.<strong>dataset</strong>.<em>camelCasedName</em>;
es: <em>cadena</em> = <em>elemento</em> . <strong>conjunto de datos</strong> . <em>camelCasedName</em> ;
ko: <em>문자열</em> = <em>요소</em> . <strong>데이터 세트</strong> . <em>camelCasedName</em> ;
ru: <em>строка</em> = <em>элемент</em> . <strong>набор данных</strong> . <em>camelCasedName</em> ;
zh_cn: <em>字符串</em> = <em>元素</em>。<strong>数据集</strong>。<em>camelCasedName</em> ;

source: <em>string</em> = <em>element</em>.<strong>dataset</strong>[<em>camelCasedName</em>];
es: <em>cadena</em> = <em>elemento</em> . <strong>conjunto de datos</strong> [ <em>camelCasedName</em> ];
ko: <em>문자열</em> = <em>요소</em> . <strong>데이터 세트</strong> [ <em>camelCasedName</em> ];
ru: <em>строка</em> = <em>элемент</em> . <strong>набор данных</strong> [ <em>camelCasedName</em> ];
zh_cn: <em>字符串</em> = <em>元素</em>。<strong>数据集</strong> [ <em>camelCasedName</em> ];

source: <em>string</em> is the <a href="../domstring"><code>DOMString</code></a> containing the error message.
es: <em>string</em> es el <a href="../domstring"> <code>DOMString</code> que</a> contiene el mensaje de error.
ko: <em>string</em> 은 오류 메시지가 포함 된 <a href="../domstring"> <code>DOMString</code> </a> 입니다.
ru: <em>Строка</em> - это <a href="../domstring"> <code>DOMString</code> ,</a> содержащая сообщение об ошибке.
zh_cn: <em>string</em>是包含错误消息的<a href="../domstring"> <code>DOMString</code> </a>。

source: <em>title</em>Optional (except in IE)
es: <em>t&iacute;tulo</em> Opcional (excepto en IE)
ko: <em>제목</em> 선택 사항 (IE 제외)
ru: <em>название</em> Необязательно (кроме IE)
zh_cn: <em>title</em>可选（IE中除外）

source: <em>toStart </em>Optional
es: <em>Iniciar</em> Opcional
ko: <em>toStart</em> 옵션
ru: <em>toStart</em> Необязательно
zh_cn: <em>开始</em>可选

source: <em>type </em>Optional
es: <em>tipo</em> opcional
ko: <em>입력</em> 선택 사항
ru: <em>тип</em> Необязательно
zh_cn: <em>类型</em>可选

source: <em>url</em> (in the case of absolute URLs) or <em>base</em> + <em>url</em> (in the case of relative URLs) is not a valid URL.
es: <em>url</em> (en el caso de URL absolutas) o <em>base</em> + <em>url</em> (en el caso de URL relativas) no es una URL v&aacute;lida.
ko: <em>url</em> (절대 URL의 경우) 또는 <em>base</em> + <em>url</em> (상대 URL의 경우)은 유효한 URL이 아닙니다.
ru: <em>url</em> (в случае абсолютных URL) или <em>base</em> + <em>url</em> (в случае относительных URL) не является допустимым URL.
zh_cn: <em>url</em>（对于绝对URL）或<em>基本</em> + <em>url</em>（对于相对URL）不是有效的URL。
