Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/dom/dom.*.007.xlf
Languages: es, ko, ru, zh_cn

source: <em>The <code>BlobEvent()</code></em><em> constructor also inherits arguments from <a href="../event/event"><code>Event()</code></a>.</em>
es: <em>El <code>BlobEvent()</code> </em><em>constructor </em><em>BlobEvent ()</em><em> tambi&eacute;n hereda argumentos de <a href="../event/event"> <code>Event()</code> </a> .</em>
ko: <em> <code>BlobEvent()</code> </em><em> 생성자도에서 인수를 상속 <a href="../event/event"> <code>Event()</code> </a> .</em>
ru: <em>Конструктор <code>BlobEvent()</code> </em><em> также наследует аргументы от <a href="../event/event"> <code>Event()</code> </a> .</em>
zh_cn: <em>该 <code>BlobEvent()</code> </em><em>构造函数也继承参数从<a href="../event/event"> <code>Event()</code> </a>。</em>

source: <em>The <code>ClipboardEvent()</code></em><em> constructor also inherits arguments from <a href="../event/event"><code>Event()</code></a>.</em>
es: <em>El <code>ClipboardEvent()</code> </em><em>constructor </em><em>ClipboardEvent ()</em><em> tambi&eacute;n hereda argumentos de <a href="../event/event"> <code>Event()</code> </a> .</em>
ko: <em> <code>ClipboardEvent()</code> </em><em> 생성자도에서 인수를 상속 <a href="../event/event"> <code>Event()</code> </a> .</em>
ru: <em>Конструктор <code>ClipboardEvent()</code> </em><em> также наследует аргументы от <a href="../event/event"> <code>Event()</code> </a> .</em>
zh_cn: <em>该 <code>ClipboardEvent()</code> </em><em>构造函数也继承参数从<a href="../event/event"> <code>Event()</code> </a>。</em>

source: <em>The <code>CloseEventInit</code></em><em> dictionary also accepts fields from the <a href="../event/event"><code>EventInit</code></a> dictionary.</em>
es: <em>El <code>CloseEventInit</code> </em><em>diccionario </em><em>CloseEventInit</em><em> tambi&eacute;n acepta campos del diccionario <a href="../event/event"> <code>EventInit</code> </a> .</em>
ko: <em> <code>CloseEventInit</code> 의</em><em> 사전도에서 필드 받아 <a href="../event/event"> <code>EventInit</code> 의</a> 사전.</em>
ru: <em> <code>CloseEventInit</code> </em><em> словарь также принимает поля из <a href="../event/event"> <code>EventInit</code> </a> словаря.</em>
zh_cn: <em>该 <code>CloseEventInit</code> </em><em>字典还接受来自场<a href="../event/event"> <code>EventInit</code> </a>字典。</em>

source: <em>The <code>Coordinates</code> interface </em><em><em>doesn't inherit any property</em></em>.
es: <em>La interfaz de <code>Coordinates</code> </em><em><em>no hereda ninguna propiedad</em></em> .
ko: <em> <code>Coordinates</code> 인터페이스는 </em><em><em>모든 속성을 상속하지 않습니다</em></em> .
ru: <em> <code>Coordinates</code> интерфейс </em><em><em>не наследует любое свойства</em></em> .
zh_cn: <em>该 <code>Coordinates</code> 接口</em><em><em>不继承任何财产</em></em>。

source: <em>The <code>Document</code> interface for HTML documents inherits from the <a href="htmldocument"><code>HTMLDocument</code></a> interface or, since HTML5, is extended for such documents.</em>
es: <em>La interfaz de <code>Document</code> para documentos HTML hereda de la interfaz <a href="htmldocument"> <code>HTMLDocument</code> </a> o, desde HTML5, se extiende para dichos documentos.</em>
ko: <em>HTML 문서 의 <code>Document</code> 인터페이스는 <a href="htmldocument"> <code>HTMLDocument</code> </a> 인터페이스 에서 상속 되거나 HTML5부터 이러한 문서에 대해 확장됩니다.</em>
ru: <em>Интерфейс <code>Document</code> для документов HTML наследуется от интерфейса <a href="htmldocument"> <code>HTMLDocument</code> </a> или, начиная с HTML5, расширяется для таких документов.</em>
zh_cn: <em>HTML文档的 <code>Document</code> 接口是从<a href="htmldocument"> <code>HTMLDocument</code> </a>接口继承的，或者因为HTML5而扩展了此类文档。</em>

source: <em>The <code>Document</code> interface includes the following methods defined on the <a href="documentorshadowroot"><code>DocumentOrShadowRoot</code></a> mixin. Note that this is currently only implemented by Chrome; other browsers still implement them on the <a href="document"><code>Document</code></a> interface.</em>
es: <em>La interfaz del <code>Document</code> incluye los siguientes m&eacute;todos definidos en la mezcla <a href="documentorshadowroot"> <code>DocumentOrShadowRoot</code> </a> . Tenga en cuenta que actualmente solo lo implementa Chrome; otros navegadores a&uacute;n los implementan en la interfaz del <a href="document"> <code>Document</code> </a> .</em>
ko: <em> <code>Document</code> 인터페이스에 정의 된 다음과 같은 방법이 포함 <a href="documentorshadowroot"> <code>DocumentOrShadowRoot</code> 의</a> 믹스 인이. 이것은 현재 Chrome에서만 구현됩니다. 다른 브라우저는 여전히 <a href="document"> <code>Document</code> </a> 인터페이스 에서이를 구현합니다 .</em>
ru: <em>Интерфейс <code>Document</code> включает следующие методы, определенные в миксине <a href="documentorshadowroot"> <code>DocumentOrShadowRoot</code> </a> . Обратите внимание, что в настоящее время это реализовано только в Chrome; другие браузеры все еще реализуют их в интерфейсе <a href="document"> <code>Document</code> </a> .</em>
zh_cn: <em>该 <code>Document</code> 的界面包括在所定义的下列方法<a href="documentorshadowroot"> <code>DocumentOrShadowRoot</code> </a>混入。请注意，这目前仅由Chrome实施；其他浏览器仍在<a href="document"> <code>Document</code> </a>界面上实现它们。</em>

source: <em>The <code>Document</code> interface includes the following properties defined on the <a href="documentorshadowroot"><code>DocumentOrShadowRoot</code></a> mixin. Note that this is currently only implemented by Chrome; other browsers still implement them directly on the <a href="document"><code>Document</code></a> interface.</em>
es: <em>La interfaz del <code>Document</code> incluye las siguientes propiedades definidas en la mezcla <a href="documentorshadowroot"> <code>DocumentOrShadowRoot</code> </a> . Tenga en cuenta que actualmente solo lo implementa Chrome; otros navegadores a&uacute;n los implementan directamente en la interfaz del <a href="document"> <code>Document</code> </a> .</em>
ko: <em> <code>Document</code> 인터페이스에 정의 된 다음 속성 포함 <a href="documentorshadowroot"> <code>DocumentOrShadowRoot</code> 의</a> 믹스 인이. 이것은 현재 Chrome에서만 구현됩니다. 다른 브라우저는 여전히 <a href="document"> <code>Document</code> </a> 인터페이스 에서 직접 구현합니다 .</em>
ru: <em>Интерфейс <code>Document</code> включает следующие свойства, определенные в миксине <a href="documentorshadowroot"> <code>DocumentOrShadowRoot</code> </a> . Обратите внимание, что в настоящее время это реализовано только в Chrome; другие браузеры по-прежнему реализуют их непосредственно в интерфейсе <a href="document"> <code>Document</code> </a> .</em>
zh_cn: <em>该 <code>Document</code> 的界面包括在所定义的下列属性<a href="documentorshadowroot"> <code>DocumentOrShadowRoot</code> </a>混入。请注意，这目前仅由Chrome实施；其他浏览器仍直接在<a href="document"> <code>Document</code> </a>界面上实现它们。</em>

source: <em>The <code>Element</code> interface includes the following property, defined on the <a href="slotable"><code>Slotable</code></a> mixin.</em>
es: <em>La interfaz de <code>Element</code> incluye la siguiente propiedad, definida en la <a href="slotable"> <code>Slotable</code> </a> .</em>
ko: <em> <code>Element</code> 인터페이스에 정의 된 다음과 같은 속성이 포함 <a href="slotable"> <code>Slotable</code> 의</a> 믹스 인을.</em>
ru: <em>Интерфейс <code>Element</code> включает следующее свойство, определенное в <a href="slotable"> <code>Slotable</code> </a> .</em>
zh_cn: <em>所述 <code>Element</code> 接口包括以下特性，所定义的<a href="slotable"> <code>Slotable</code> </a>混入。</em>

source: <em>The <code>File</code> interface doesn't define any methods, but inherits methods from the <a href="blob"><code>Blob</code></a> interface:</em>
es: <em>La interfaz de <code>File</code> no define ning&uacute;n m&eacute;todo, pero hereda m&eacute;todos de la interfaz <a href="blob"> <code>Blob</code> </a> :</em>
ko: <em> <code>File</code> 인터페이스는 어떠한 방법,하지만 상속 방법을 정의하지 않습니다 <a href="blob"> <code>Blob</code> </a> 인터페이스를 :</em>
ru: <em>Интерфейс <code>File</code> не определяет никаких методов, но наследует методы от интерфейса <a href="blob"> <code>Blob</code> </a> :</em>
zh_cn: <em>该 <code>File</code> 的接口并没有定义从任何方法，但继承方法<a href="blob"> <code>Blob</code> </a>接口：</em>

source: <em>The <code>FocusEvent()</code></em><em> constructor also inherits arguments from <a href="../uievent/uievent"><code>UIEvent()</code></a> and from <a href="../event/event"><code>Event()</code></a>.</em>
es: <em>El <code>FocusEvent()</code> </em><em>constructor </em><em>FocusEvent ()</em><em> tambi&eacute;n hereda argumentos de <a href="../uievent/uievent"> <code>UIEvent()</code> </a> y de <a href="../event/event"> <code>Event()</code> </a> .</em>
ko: <em> <code>FocusEvent()</code> </em><em> 생성자도에서 인수를 상속 <a href="../uievent/uievent"> <code>UIEvent()</code> </a> 와에서 <a href="../event/event"> <code>Event()</code> </a> .</em>
ru: <em>Конструктор <code>FocusEvent()</code> </em><em> также наследует аргументы от <a href="../uievent/uievent"> <code>UIEvent()</code> </a> и <a href="../event/event"> <code>Event()</code> </a> .</em>
zh_cn: <em>该 <code>FocusEvent()</code> </em><em>构造函数也继承自变量<a href="../uievent/uievent"> <code>UIEvent()</code> </a>和<a href="../event/event"> <code>Event()</code> </a>。</em>

source: <em>The <code>FocusEventInit</code></em><em> dictionary also accepts fields from the <a href="../uievent/uievent"><code>UIEventInit</code></a> and <a href="../event/event"><code>EventInit</code></a> dictionaries.</em>
es: <em>El <code>FocusEventInit</code> </em><em>diccionario </em><em>FocusEventInit</em><em> tambi&eacute;n acepta campos de los diccionarios <a href="../uievent/uievent"> <code>UIEventInit</code> </a> y <a href="../event/event"> <code>EventInit</code> </a> .</em>
ko: <em> <code>FocusEventInit</code> 의</em><em> 사전도에서 필드 받아 <a href="../uievent/uievent"> <code>UIEventInit</code> </a> 및 <a href="../event/event"> <code>EventInit</code> </a> 사전.</em>
ru: <em> <code>FocusEventInit</code> </em><em> словарь также принимает поля из <a href="../uievent/uievent"> <code>UIEventInit</code> </a> и <a href="../event/event"> <code>EventInit</code> </a> словарей.</em>
zh_cn: <em>该 <code>FocusEventInit</code> </em><em>字典还接受来自场<a href="../uievent/uievent"> <code>UIEventInit</code> </a>和<a href="../event/event"> <code>EventInit</code> </a>字典。</em>

source: <em>The <code>Geolocation</code> interface neither implements, nor inherits any property.</em>
es: <em>La interfaz de <code>Geolocation</code> no implementa ni hereda ninguna propiedad.</em>
ko: <em> <code>Geolocation</code> 인터페이스도 구현,도 상속 재산.</em>
ru: <em>Интерфейс <code>Geolocation</code> не реализует и не наследует никаких свойств.</em>
zh_cn: <em>该 <code>Geolocation</code> 接口既不工具，也没有继承任何财产。</em>

source: <em>The <code>History</code></em><em> interface doesn't inherit any property.</em>
es: <em>La <code>History</code> </em><em>interfaz del </em><em>historial</em><em> no hereda ninguna propiedad.</em>
ko: <em> <code>History</code> </em><em> 인터페이스는 모든 속성을 상속하지 않습니다.</em>
ru: <em>Интерфейс <code>History</code> </em><em> не наследует никаких свойств.</em>
zh_cn: <em>在 <code>History</code> </em><em>接口不继承任何财产。</em>

source: <em>The <code>History</code></em><em>interface doesn't inherit any methods.</em>
es: <em>La <code>History</code> </em><em>interfaz de </em><em>Historial</em><em> no hereda ning&uacute;n m&eacute;todo.</em>
ko: <em> <code>History</code> </em><em> 인터페이스는 어떤 방법을 상속하지 않습니다.</em>
ru: <em>Интерфейс <code>History</code> </em><em> не наследует никаких методов.</em>
zh_cn: <em>在 <code>History</code> </em><em>接口不继承任何方法。</em>

source: <em>The <code>ImageCapture</code> interface is based on <a href="eventtarget"><code>EventTarget</code></a>, so it includes the methods defined by that interface as well as the ones listed below.</em>
es: <em>La interfaz <code>ImageCapture</code> se basa en <a href="eventtarget"> <code>EventTarget</code> </a> , por lo que incluye los m&eacute;todos definidos por esa interfaz, as&iacute; como los que se enumeran a continuaci&oacute;n.</em>
ko: <em> <code>ImageCapture</code> 의 인터페이스에 기반 <a href="eventtarget"> <code>EventTarget</code> </a> 는 그 인터페이스뿐만 아니라 아래의 것들에 의해 정의 된 방법을 포함하므로.</em>
ru: <em>Интерфейс <code>ImageCapture</code> основан на <a href="eventtarget"> <code>EventTarget</code> </a> , поэтому он включает методы, определенные этим интерфейсом, а также методы, перечисленные ниже.</em>
zh_cn: <em>所述 <code>ImageCapture</code> 中接口基于<a href="eventtarget"> <code>EventTarget</code> </a>，因此它包括由接口以及下面列出的定义的方法。</em>

source: <em>The <code>InputEventInit</code></em><em> dictionary also accepts fields from <a href="../uievent/uievent"><code>UIEventInit</code></a> and from <a href="../event/event"><code>EventInit</code></a> dictionaries.</em>
es: <em>El <code>InputEventInit</code> </em><em>diccionario </em><em>InputEventInit</em><em> tambi&eacute;n acepta campos de <a href="../uievent/uievent"> <code>UIEventInit</code> </a> y de los diccionarios <a href="../event/event"> <code>EventInit</code> </a> .</em>
ko: <em> <code>InputEventInit</code> 의</em><em> 사전도에서 필드 받아 <a href="../uievent/uievent"> <code>UIEventInit</code> </a> 과에서 <a href="../event/event"> <code>EventInit</code> 의</a> 사전.</em>
ru: <em> <code>InputEventInit</code> </em><em> словарь также принимает поля из <a href="../uievent/uievent"> <code>UIEventInit</code> </a> и из <a href="../event/event"> <code>EventInit</code> </a> словарей.</em>
zh_cn: <em>该 <code>InputEventInit</code> </em><em>字典也接受来自场<a href="../uievent/uievent"> <code>UIEventInit</code> </a>和<a href="../event/event"> <code>EventInit</code> </a>字典。</em>

source: <em>The <code>KeyboardEventInit</code></em><em> dictionary also accepts fields from the <a href="../uievent/uievent"><code>UIEventInit</code></a> and <a href="../event/event"><code>EventInit</code></a> dictionaries.</em>
es: <em>El <code>KeyboardEventInit</code> </em><em>diccionario </em><em>KeyboardEventInit</em><em> tambi&eacute;n acepta campos de los diccionarios <a href="../uievent/uievent"> <code>UIEventInit</code> </a> y <a href="../event/event"> <code>EventInit</code> </a> .</em>
ko: <em> <code>KeyboardEventInit</code> 의</em><em> 사전도에서 필드 받아 <a href="../uievent/uievent"> <code>UIEventInit</code> </a> 및 <a href="../event/event"> <code>EventInit</code> </a> 사전.</em>
ru: <em> <code>KeyboardEventInit</code> </em><em> словарь также принимает поля из <a href="../uievent/uievent"> <code>UIEventInit</code> </a> и <a href="../event/event"> <code>EventInit</code> </a> словарей.</em>
zh_cn: <em>该 <code>KeyboardEventInit</code> </em><em>字典还接受来自场<a href="../uievent/uievent"> <code>UIEventInit</code> </a>和<a href="../event/event"> <code>EventInit</code> </a>字典。</em>

source: <em>The <code>Location</code></em><em> interface doesn't inherit any method<em>, but implements those from <a href="https://developer.mozilla.org/en-US/docs/Web/API/URLUtils"><code>URLUtils</code></a></em>.</em>
es: <em>La <code>Location</code> </em><em>interfaz de </em><em>ubicaci&oacute;n</em><em> no hereda ning&uacute;n m&eacute;todo <em>, pero implementa los de <a href="https://developer.mozilla.org/en-US/docs/Web/API/URLUtils"> <code>URLUtils</code> </a></em> .</em>
ko: <em> <code>Location</code> </em><em> 인터페이스는 어떤 방법을 상속하지 않습니다 <em>,하지만에서 구현하는 <a href="https://developer.mozilla.org/en-US/docs/Web/API/URLUtils"> <code>URLUtils</code> </a></em> .</em>
ru: <em>Интерфейс <code>Location</code> </em><em> не наследует никакой метод <em>, но реализует те из <a href="https://developer.mozilla.org/en-US/docs/Web/API/URLUtils"> <code>URLUtils</code> </a></em> .</em>
zh_cn: <em>该 <code>Location</code> </em><em>接口不继承任何方法<em>，但实施这些从<a href="https://developer.mozilla.org/en-US/docs/Web/API/URLUtils"> <code>URLUtils</code> </a></em>。</em>

source: <em>The <code>Location</code></em><em> interface doesn't inherit any property, but implements those from <a href="https://developer.mozilla.org/en-US/docs/Web/API/URLUtils"><code>URLUtils</code></a>.</em>
es: <em>La <code>Location</code> </em><em>interfaz de </em><em>ubicaci&oacute;n</em><em> no hereda ninguna propiedad, pero las implementa de <a href="https://developer.mozilla.org/en-US/docs/Web/API/URLUtils"> <code>URLUtils</code> </a> .</em>
ko: <em> <code>Location</code> </em><em> 인터페이스는 모든 속성을 상속하지만,에서 구현하는하지 않습니다 <a href="https://developer.mozilla.org/en-US/docs/Web/API/URLUtils"> <code>URLUtils</code> </a> .</em>
ru: <em>Интерфейс <code>Location</code> </em><em> не наследует никаких свойств, но реализует их из <a href="https://developer.mozilla.org/en-US/docs/Web/API/URLUtils"> <code>URLUtils</code> </a> .</em>
zh_cn: <em>该 <code>Location</code> </em><em>接口没有继承任何财产，但实施这些从<a href="https://developer.mozilla.org/en-US/docs/Web/API/URLUtils"> <code>URLUtils</code> </a>。</em>

source: <em>The <code>MediaQueryListEvent</code> interface inherits methods from its parent interface, <a href="event"><code>Event</code></a>.</em>
es: <em>La interfaz <code>MediaQueryListEvent</code> hereda los m&eacute;todos de su interfaz principal, <a href="event"> <code>Event</code> </a> .</em>
ko: <em> <code>MediaQueryListEvent</code> 부모 인터페이스에서 인터페이스 상속 방법 <a href="event"> <code>Event</code> </a> .</em>
ru: <em>Интерфейс <code>MediaQueryListEvent</code> наследует методы от своего родительского интерфейса <a href="event"> <code>Event</code> </a> .</em>
zh_cn: <em>该 <code>MediaQueryListEvent</code> 从其父接口，接口继承方法<a href="event"> <code>Event</code> </a>。</em>

source: <em>The <code>MediaQueryListEvent</code> interface inherits properties from its parent interface, <a href="event"><code>Event</code></a>.</em>
es: <em>La interfaz <code>MediaQueryListEvent</code> hereda las propiedades de su interfaz principal, <a href="event"> <code>Event</code> o</a> .</em>
ko: <em> <code>MediaQueryListEvent</code> 의 부모 인터페이스에서 인터페이스 상속 속성 <a href="event"> <code>Event</code> </a> .</em>
ru: <em>Интерфейс <code>MediaQueryListEvent</code> наследует свойства от своего родительского интерфейса <a href="event"> <code>Event</code> </a> .</em>
zh_cn: <em>该 <code>MediaQueryListEvent</code> 从其父接口，接口继承性<a href="event"> <code>Event</code> </a>。</em>

source: <em>The <code>MediaStreamTrackEvent()</code> constructor also inherits arguments from <a href="../event/event"><code>Event()</code></a>.</em>
es: <em>El constructor <code>MediaStreamTrackEvent()</code> tambi&eacute;n hereda argumentos de <a href="../event/event"> <code>Event()</code> </a> .</em>
ko: <em> <code>MediaStreamTrackEvent()</code> 생성자도에서 인수를 상속 <a href="../event/event"> <code>Event()</code> </a> .</em>
ru: <em>Конструктор <code>MediaStreamTrackEvent()</code> также наследует аргументы от <a href="../event/event"> <code>Event()</code> </a> .</em>
zh_cn: <em>该 <code>MediaStreamTrackEvent()</code> 构造函数也继承参数从<a href="../event/event"> <code>Event()</code> </a>。</em>

source: <em>The <code>MouseEventInit</code></em><em> dictionary also accepts fields from <a href="../uievent/uievent"><code>UIEventInit</code></a> and from <a href="../event/event"><code>EventInit</code></a> dictionaries.</em>
es: <em>El <code>MouseEventInit</code> </em><em>diccionario </em><em>MouseEventInit</em><em> tambi&eacute;n acepta campos de <a href="../uievent/uievent"> <code>UIEventInit</code> </a> y de los diccionarios <a href="../event/event"> <code>EventInit</code> </a> .</em>
ko: <em> <code>MouseEventInit</code> 의</em><em> 사전도에서 필드 받아 <a href="../uievent/uievent"> <code>UIEventInit</code> </a> 과에서 <a href="../event/event"> <code>EventInit</code> 의</a> 사전.</em>
ru: <em> <code>MouseEventInit</code> </em><em> словарь также принимает поля из <a href="../uievent/uievent"> <code>UIEventInit</code> </a> и из <a href="../event/event"> <code>EventInit</code> </a> словарей.</em>
zh_cn: <em>该 <code>MouseEventInit</code> </em><em>字典也接受来自场<a href="../uievent/uievent"> <code>UIEventInit</code> </a>和<a href="../event/event"> <code>EventInit</code> </a>字典。</em>

source: <em>The <code>NavigatorConcurrentHardware</code></em><em> mixin has no methods.</em>
es: <em>La <code>NavigatorConcurrentHardware</code> </em><em>combinaci&oacute;n </em><em>NavigatorConcurrentHardware</em><em> no tiene m&eacute;todos.</em>
ko: <em> <code>NavigatorConcurrentHardware</code> 의</em><em> 믹스 인은 어떤 방법이 없습니다.</em>
ru: <em> <code>NavigatorConcurrentHardware</code> </em><em> Mixin не имеет методов.</em>
zh_cn: <em>该 <code>NavigatorConcurrentHardware</code> </em><em>混入没有任何方法。</em>

source: <em>The <code>NavigatorGeolocation</code></em><em> interface doesn't inherit any property.</em>
es: <em>La <code>NavigatorGeolocation</code> </em><em>interfaz </em><em>NavigatorGeolocation</em><em> no hereda ninguna propiedad.</em>
ko: <em> <code>NavigatorGeolocation</code> 의</em><em> 인터페이스는 모든 속성을 상속하지 않습니다.</em>
ru: <em>Интерфейс <code>NavigatorGeolocation</code> </em><em> не наследует никаких свойств.</em>
zh_cn: <em>该 <code>NavigatorGeolocation</code> </em><em>接口不继承任何财产。</em>

source: <em>The <code>NavigatorID</code></em><em> interface doesn't inherit any properties.</em>
es: <em>La <code>NavigatorID</code> </em><em>interfaz </em><em>NavigatorID</em><em> no hereda ninguna propiedad.</em>
ko: <em> <code>NavigatorID</code> 의</em><em> 인터페이스는 어떤 속성을 상속하지 않습니다.</em>
ru: <em>Интерфейс <code>NavigatorID</code> </em><em> не наследует никаких свойств.</em>
zh_cn: <em>该 <code>NavigatorID</code> </em><em>接口不继承任何属性。</em>

source: <em>The <code>NavigatorLanguage</code></em><em> interface doesn't inherit any property.</em>
es: <em>La <code>NavigatorLanguage</code> </em><em>interfaz </em><em>NavigatorLanguage</em><em> no hereda ninguna propiedad.</em>
ko: <em> <code>NavigatorLanguage</code> 의</em><em> 인터페이스는 모든 속성을 상속하지 않습니다.</em>
ru: <em>Интерфейс <code>NavigatorLanguage</code> </em><em> не наследует никаких свойств.</em>
zh_cn: <em>该 <code>NavigatorLanguage</code> </em><em>接口不继承任何财产。</em>

source: <em>The <code>NavigatorOnLine</code></em><em> interface doesn't inherit any property.</em>
es: <em>La <code>NavigatorOnLine</code> </em><em>interfaz </em><em>NavigatorOnLine</em><em> no hereda ninguna propiedad.</em>
ko: <em> <code>NavigatorOnLine</code> 의</em><em> 인터페이스는 모든 속성을 상속하지 않습니다.</em>
ru: <em>Интерфейс <code>NavigatorOnLine</code> </em><em> не наследует никаких свойств.</em>
zh_cn: <em>该 <code>NavigatorOnLine</code> </em><em>接口不继承任何财产。</em>

source: <em>The <code>NavigatorPlugins</code></em><em> interface doesn't inherit any methods.</em>
es: <em>La <code>NavigatorPlugins</code> </em><em>interfaz </em><em>NavigatorPlugins</em><em> no hereda ning&uacute;n m&eacute;todo.</em>
ko: <em> <code>NavigatorPlugins</code> 의</em><em> 인터페이스는 어떤 방법을 상속하지 않습니다.</em>
ru: <em>Интерфейс <code>NavigatorPlugins</code> </em><em> не наследует никаких методов.</em>
zh_cn: <em>该 <code>NavigatorPlugins</code> </em><em>接口不继承任何方法。</em>

source: <em>The <code>NavigatorStorage</code></em><em> mixin has no methods.</em>
es: <em>La <code>NavigatorStorage</code> </em><em>mezcla </em><em>NavigatorStorage</em><em> no tiene m&eacute;todos.</em>
ko: <em> <code>NavigatorStorage</code> 의</em><em> 믹스 인은 어떤 방법이 없습니다.</em>
ru: <em> <code>NavigatorStorage</code> </em><em> Mixin не имеет методов.</em>
zh_cn: <em>该 <code>NavigatorStorage</code> </em><em>混入没有任何方法。</em>

source: <em>The <code>PaymentDetailsUpdate</code> dictionary is based on the <a href="paymentdetailsbase"><code>PaymentDetailsBase</code></a> dictionary, and inherits its properties, <strong>which are included in the list below</strong>.</em>
es: <em>El diccionario <code>PaymentDetailsUpdate</code> se basa en el diccionario <a href="paymentdetailsbase"> <code>PaymentDetailsBase</code> </a> y hereda sus propiedades, <strong>que se incluyen en la lista a continuaci&oacute;n</strong> .</em>
ko: <em> <code>PaymentDetailsUpdate</code> 의 사전은에 기초 <a href="paymentdetailsbase"> <code>PaymentDetailsBase</code> 의</a> 사전 및 상속 속성, <strong>아래 목록에 포함된다</strong> .</em>
ru: <em> <code>PaymentDetailsUpdate</code> словарь на основе <a href="paymentdetailsbase"> <code>PaymentDetailsBase</code> </a> словаря, и наследует его свойства, <strong>которые включены в список ниже</strong> .</em>
zh_cn: <em>所述 <code>PaymentDetailsUpdate</code> 字典是基于<a href="paymentdetailsbase"> <code>PaymentDetailsBase</code> </a>字典，并且继承其属性，<strong>其被包括在下面的列表</strong>。</em>
