Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/dom/dom.*.011.xlf
Languages: ja, ko, ru, zh_cn

source: A series of live samples with short explanations that showcase WebGL concepts and capabilities. The examples are sorted according to topic and level of difficulty, covering the WebGL rendering context, shader programming, textures, geometry, user interaction, and more.
ja: WebGL のコンセプトと機能を紹介する短い解説付きのライブサンプルのシリーズです。サンプルはトピックと難易度に応じて分類されており、WebGL レンダリング コンテキスト、シェーダ プログラミング、テクスチャ、ジオメトリ、ユーザー インタラクションなどをカバーしています。
ko: WebGL 개념 및 기능을 보여주는 간단한 설명이 포함 된 일련의 라이브 샘플입니다. WebGL 렌더링 컨텍스트, 쉐이더 프로그래밍, 텍스처, 지오메트리, 사용자 상호 작용 등을 다루는 주제 및 난이도에 따라 예제가 정렬됩니다.
ru: Серия живых примеров с краткими объяснениями,которые демонстрируют концепции и возможности WebGL.Примеры отсортированы в соответствии с тематикой и уровнем сложности,охватывая контекст рендеринга WebGL,шейдерное программирование,текстуры,геометрию,взаимодействие с пользователем и многое другое.
zh_cn: 一系列带有简短说明的实时示例,展示了WebGL的概念和功能。示例按照主题和难易程度分类,涵盖WebGL渲染上下文、着色器编程、纹理、几何、用户交互等内容。

source: A server reflexive candidate is generated by a STUN/TURN server; the connection's initiator requests a candidate from the STUN server, which forwards the request through the remote peer's NAT, which creates and returns a candidate whose IP address is local to the remote peer. The STUN server then replies to the initiator's request with a candidate whose IP address is unrelated to the remote peer.
ja: 接続のイニシエータは、STUN/TURN サーバーから候補を要求し、STUN サーバーはリモートピアの NAT を介して要求を転送し、リモートピアにローカルな IP アドレスを持つ候補を生成して返します。その後、STUN サーバーは、イニシエータの要求に対して、リモートピアとは関係のない IP アドレスを持つ候補を返信します。
ko: 서버 재귀 후보는 STUN / TURN 서버에 의해 생성됩니다. 연결 개시자는 STUN 서버에서 후보를 요청합니다. STUN 서버는 원격 피어의 NAT를 통해 요청을 전달합니다. 그러면 원격 IP 주소가 로컬 인 후보를 작성하여 리턴합니다. 그런 다음 STUN 서버는 IP 주소가 원격 피어와 관련이없는 후보와 함께 개시 자의 요청에 응답합니다.
ru: Рефлексивный кандидат сервера генерируется сервером STUN/TURN;инициатор соединения запрашивает кандидата с сервера STUN,который перенаправляет запрос через NAT удаленного коллеги,который создает и возвращает кандидата,IP-адрес которого является локальным,удаленному коллегиару.Затем сервер STUN отвечает на запрос инициатора кандидатом,IP-адрес которого не связан с удаленным коллегой.
zh_cn: 服务器反射候选者由STUN/TURN服务器生成;连接的发起者向STUN服务器请求候选者,STUN服务器通过远程对等体的NAT转发该请求,创建并返回一个IP地址与远程对等体无关的候选者。然后STUN服务器用一个IP地址与远程对等体无关的候选者来回复发起者的请求。

source: A service worker is an event-driven <a href="worker">worker</a> registered against an origin and a path. It takes the form of a JavaScript file that can control the web page/site it is associated with, intercepting and modifying navigation and resource requests, and caching resources in a very granular fashion to give you complete control over how your app behaves in certain situations, (the most obvious one being when the network is not available.)
ja: サービスワーカーは、起点とパスに対して登録されたイベント駆動型の<a href="worker">ワーカー</a>です。これは、関連付けられているWebページ/サイトを制御できるJavaScriptファイルの形式を取り、ナビゲーションおよびリソース要求をインターセプトおよび変更し、リソースを非常に細かくキャッシュして、特定の状況でのアプリの動作を完全に制御できるようにします、（最も明白なのはネットワークが利用できないときです。）
ko: 서비스 워커는 출발지와 경로에 등록 된 이벤트 중심 <a href="worker">워커</a> 입니다. 탐색 및 리소스 요청을 가로 채고 수정하며 리소스를 매우 세밀하게 캐싱하여 특정 상황에서 앱의 동작 방식을 완전히 제어 할 수있는 JavaScript 파일 형식으로되어 있습니다. , (네트워크를 사용할 수 없을 때 가장 분명합니다.)
ru: Работник службы - это управляемый событиями <a href="worker">работник,</a> зарегистрированный для источника и пути. Он принимает форму файла JavaScript, который может контролировать веб-страницу / сайт, с которым он связан, перехватывать и изменять запросы навигации и ресурсов, а также очень детально кэшировать ресурсы, чтобы дать вам полный контроль над тем, как ваше приложение ведет себя в определенных ситуациях. (Наиболее очевидным из них является ситуация, когда сеть недоступна.)
zh_cn: 服务工作人员是根据原点和路径注册的事件驱动的<a href="worker">工作人员</a>。它采用JavaScript文件的形式，该文件可以控制与其关联的网页/站点，以非常精细的方式拦截和修改导航和资源请求，以及缓存资源，从而使您可以完全控制应用在特定情况下的行为，（最明显的情况是网络不可用时。）

source: A service worker is first registered using the <a href="serviceworkercontainer/register"><code>ServiceWorkerContainer.register()</code></a> method. If successful, your service worker will be downloaded to the client and attempt installation/activation (see below) for URLs accessed by the user inside the whole origin, or inside a subset specified by you.
ja: Service Workerは、最初に<a href="serviceworkercontainer/register"> <code>ServiceWorkerContainer.register()</code> </a>メソッドを使用して登録されます。成功すると、Service Workerがクライアントにダウンロードされ、オリジン全体またはユーザーが指定したサブセット内でユーザーがアクセスするURLのインストール/アクティベーション（下記参照）が試行されます。
ko: 서비스 워커는 먼저 <a href="serviceworkercontainer/register"> <code>ServiceWorkerContainer.register()</code> </a> 메소드를 사용하여 등록됩니다 . 성공하면 서비스 워커가 클라이언트로 다운로드되고 전체 출처 또는 사용자가 지정한 하위 세트 내에서 사용자가 액세스 한 URL에 대해 설치 / 활성화 (아래 참조)를 시도합니다.
ru: Сервисный работник сначала регистрируется с помощью метода <a href="serviceworkercontainer/register"> <code>ServiceWorkerContainer.register()</code> </a> . В случае успеха ваш сервисный работник будет загружен на клиент и попытается установить / активировать (см. Ниже) URL-адреса, к которым пользователь обращается во всем источнике или в указанном вами подмножестве.
zh_cn: 首先使用<a href="serviceworkercontainer/register"> <code>ServiceWorkerContainer.register()</code> </a>方法注册服务工作者。如果成功，则将您的服务工作者下载到客户端，并尝试安装/激活（请参见下文）用户在整个来源内或在您指定的子集内访问的URL。

source: A service worker is run in a worker context: it therefore has no DOM access, and runs on a different thread to the main JavaScript that powers your app, so it is not blocking. It is designed to be fully async; as a consequence, APIs such as synchronous <a href="xmlhttprequest">XHR</a> and <a href="https://developer.mozilla.org/en-US/docs/Web/Guide/API/DOM/Storage">localStorage</a> can't be used inside a service worker.
ja: サービスワーカーはワーカーコンテキストで実行されます。したがって、DOMへのアクセス権はなく、アプリを実行するメインのJavaScriptとは別のスレッドで実行されるため、ブロックされません。完全に非同期になるように設計されています。結果として、同期<a href="xmlhttprequest">XHR</a>や<a href="https://developer.mozilla.org/en-US/docs/Web/Guide/API/DOM/Storage">localStorage</a>などのAPI はService Worker内では使用できません。
ko: 서비스 워커는 워커 컨텍스트에서 실행되므로 DOM 액세스 권한이 없으며 앱을 구동하는 기본 JavaScript와 다른 스레드에서 실행되므로 차단되지 않습니다. 완전히 비동기식으로 설계되었습니다. 결과적 으로 서비스 워커 내부에서는 동기 <a href="xmlhttprequest">XHR</a> 및 <a href="https://developer.mozilla.org/en-US/docs/Web/Guide/API/DOM/Storage">localStorage</a> 와 같은 API를 사용할 수 없습니다.
ru: Работник службы запускается в рабочем контексте: поэтому он не имеет доступа к DOM и работает в потоке, отличном от основного JavaScript, который обеспечивает работу вашего приложения, поэтому он не блокируется. Это разработано, чтобы быть полностью асинхронным; как следствие, интерфейсы , такие как синхронное <a href="xmlhttprequest">XHR</a> и <a href="https://developer.mozilla.org/en-US/docs/Web/Guide/API/DOM/Storage">LocalStorage</a> не могут быть использованы внутри рабочего обслуживания.
zh_cn: 服务工作程序是在工作程序上下文中运行的：因此它没有DOM访问权限，并且在与为您的应用程序提供功能的主JavaScript不同的线程上运行，因此它不会阻塞。它设计为完全异步；结果，同步<a href="xmlhttprequest">XHR</a>和<a href="https://developer.mozilla.org/en-US/docs/Web/Guide/API/DOM/Storage">localStorage之类的</a> API 不能在服务工作者内部使用。

source: A set of <a href="../node"><code>Node</code></a> or <a href="../domstring"><code>DOMString</code></a> objects to insert.
ja: 挿入する<a href="../node"> <code>Node</code> </a>オブジェクトまたは<a href="../domstring"> <code>DOMString</code> </a>オブジェクトのセット。
ko: 삽입 할 <a href="../node"> <code>Node</code> </a> 또는 <a href="../domstring"> <code>DOMString</code> </a> 객체 세트입니다 .
ru: Набор объектов <a href="../node"> <code>Node</code> </a> или <a href="../domstring"> <code>DOMString</code> </a> для вставки.
zh_cn: 要插入的一组<a href="../node"> <code>Node</code> </a>或<a href="../domstring"> <code>DOMString</code> </a>对象。

source: A set of <a href="../node"><code>Node</code></a> or <a href="../domstring"><code>DOMString</code></a> objects to replace.
ja: 置き換える<a href="../node"> <code>Node</code> </a>オブジェクトまたは<a href="../domstring"> <code>DOMString</code> </a>オブジェクトのセット。
ko: 바꿀 <a href="../node"> <code>Node</code> </a> 또는 <a href="../domstring"> <code>DOMString</code> </a> 객체 세트입니다 .
ru: Набор объектов <a href="../node"> <code>Node</code> </a> или <a href="../domstring"> <code>DOMString</code> </a> для замены.
zh_cn: 一组要替换的<a href="../node"> <code>Node</code> </a>或<a href="../domstring"> <code>DOMString</code> </a>对象。

source: A set of optional descriptors passed as an object. It can have the following keys:
ja: オブジェクトとして渡されるオプションの記述子のセット。以下のキーを持つことができます。
ko: 객체로 전달 된 선택적 설명자 집합입니다. 다음과 같은 키를 가질 수 있습니다.
ru: Набор необязательных дескрипторов,передаваемых в качестве объекта.Он может иметь следующие ключи:
zh_cn: 作为对象传递的一组可选描述符。它可以有以下键:

source: A shadow DOM example:
ja: 影のDOMの例。
ko: 그림자 DOM 예제 :
ru: Пример теневого DOM:
zh_cn: 一个影子DOM的例子。

source: A shadowed text example
ja: 影のある文章例
ko: 어두운 텍스트 예제
ru: Текстовый пример в тени
zh_cn: 阴影文本示例

source: A shared worker is accessible by multiple scripts &mdash; even if they are being accessed by different windows, iframes or even workers. In this section we'll discuss the JavaScript found in our <a href="https://github.com/mdn/simple-shared-worker">Basic shared worker example</a> (<a href="https://mdn.github.io/simple-shared-worker/">run shared worker</a>): This is very similar to the basic dedicated worker example, except that it has two functions available handled by different script files: <em>multiplying two numbers</em>, or <em>squaring a number</em>. Both scripts use the same worker to do the actual calculation required.
ja: 共有ワーカーには、異なるウィンドウ、iframe、さらにはワーカーからアクセスされている場合でも、複数のスクリプトからアクセスできます。このセクションでは、JavaScriptが私たちの中に見つかっ説明します<a href="https://github.com/mdn/simple-shared-worker">基本的には労働者の例を共有</a>（<a href="https://mdn.github.io/simple-shared-worker/">共有のワーカーを実行する</a>：これは別のスクリプトファイルで扱う利用可能な2つの機能を持っていることを除いて、基本的な専用の労働者の例と非常によく似ています）<em>2つの数値を乗算し</em>、または<em>数値を二乗します</em>。両方のスクリプトは、同じワーカーを使用して、必要な実際の計算を行います。
ko: 다른 창, iframe 또는 작업자가 액세스하는 경우에도 여러 작업자가 공유 작업자에 액세스 할 수 있습니다. 이 섹션에서 우리는 자바 스크립트를 우리에서 발견 논의 할 것이다 <a href="https://github.com/mdn/simple-shared-worker">기본은 작업자 예를 공유</a> ( <a href="https://mdn.github.io/simple-shared-worker/">공유 노동자를 실행</a> : 이것은 다른 스크립트 파일에 의해 처리 가능한 두 가지 기능을 가지고 것을 제외하고, 기본 전용 작업자 예와 매우 유사합니다 :) <em>두 숫자를 곱하는을</em> , 또는 <em>숫자를 제곱합니다</em> . 두 스크립트 모두 동일한 작업자를 사용하여 필요한 실제 계산을 수행합니다.
ru: Совместно используемый работник доступен несколькими сценариями - даже если к ним обращаются разные окна, фреймы или даже работники. В этом разделе мы обсудим JavaScript, найденный в нашем <a href="https://github.com/mdn/simple-shared-worker">базовом примере общего рабочего</a> ( <a href="https://mdn.github.io/simple-shared-worker/">запустите общий работник</a> ): это очень похоже на базовый пример выделенного рабочего, за исключением того, что у него есть две функции, доступные для обработки различными файлами сценариев: <em>умножение двух чисел</em> , или <em>квадрат числа</em> . Оба сценария используют одного и того же работника для выполнения требуемого фактического расчета.
zh_cn: 一个共享的工作程序可以通过多个脚本访问-即使它们被不同的窗口，iframe甚至工作程序访问。在本节中，我们将讨论在<a href="https://github.com/mdn/simple-shared-worker">基本共享工作程序示例</a>（<a href="https://mdn.github.io/simple-shared-worker/">运行共享工作程序</a>）中找到的JavaScript ：与基本专用工作程序示例非常相似，不同之处在于它具有两个可通过不同脚本文件处理的功能：<em>两个数字相乘</em>，或<em>平方一个数字</em>。这两个脚本使用相同的工作程序进行所需的实际计算。

source: A short introduction to media queries in Firefox 3.5
ja: Firefox 3.5 でのメディアクエリの簡単な紹介
ko: Firefox 3.5의 미디어 쿼리에 대한 간단한 소개
ru: Краткое введение в Firefox 3.5,посвященное запросам СМИ.
zh_cn: 简单介绍一下火狐3.5中的媒体查询。

source: A short number.
ja: 短い数字。
ko: 짧은 숫자입니다.
ru: Короткий номер.
zh_cn: 一个短号码。

source: A shortcut method for creating and playing an animation on an element. It returns the created <a href="animation"><code>Animation</code></a> object instance.
ja: 要素のアニメーションを作成および再生するためのショートカットメソッド。作成された<a href="animation"> <code>Animation</code> </a>オブジェクトのインスタンスを返します。
ko: 요소에서 애니메이션을 만들고 재생하기위한 바로 가기 방법입니다. 생성 된 <a href="animation"> <code>Animation</code> </a> 객체 인스턴스를 반환합니다 .
ru: Сокращенный метод для создания и воспроизведения анимации на элементе. Возвращает созданный экземпляр объекта <a href="animation"> <code>Animation</code> </a> .
zh_cn: 在元素上创建和播放动画的快捷方式。它返回创建的<a href="animation"> <code>Animation</code> </a>对象实例。

source: A shortcut method to create and run an animation on an element. Returns the created Animation object instance.
ja: 要素上にアニメーションを作成して実行するためのショートカットメソッドです。作成したアニメーションオブジェクトのインスタンスを返します。
ko: 요소에서 애니메이션을 만들고 실행하는 바로 가기 방법입니다. 생성 된 애니메이션 객체 인스턴스를 반환합니다.
ru: Способ быстрого создания и запуска анимации на элементе.Возвращает созданный экземпляр анимационного объекта.
zh_cn: 在元素上创建和运行动画的快捷方法。返回创建的动画对象实例。

source: A sign-language interpretation of an audio track.
ja: オーディオトラックの手話通訳。
ko: 오디오 트랙의 수화 해석.
ru: Железнодорожный перевод аудиодорожки.
zh_cn: 音轨的手语翻译。

source: A similar approach can be taken elsewhere in the File and Directory Entries API.
ja: 同様のアプローチは、File and Directory Entries API の他の場所でも取ることができます。
ko: 파일 및 디렉토리 항목 API의 다른 곳에서도 비슷한 방법을 사용할 수 있습니다.
ru: Аналогичный подход можно применить и в других местах API для записи файлов и каталогов.
zh_cn: 在文件和目录条目API的其他地方也可以采取类似的方法。

source: A similar information, but attached to the <a href="https://developer.mozilla.org/en-US/docs/Glossary/browsing_context">browsing context</a>, <a href="../window/location"><code>Window.location</code></a>.
ja: 同様の情報が、これらに取り付けた<a href="https://developer.mozilla.org/en-US/docs/Glossary/browsing_context">ブラウジング・コンテキスト</a>、<a href="../window/location"> <code>Window.location</code> </a>。
ko: 비슷한 정보이지만 <a href="https://developer.mozilla.org/en-US/docs/Glossary/browsing_context">브라우징 컨텍스트</a> 인 <a href="../window/location"> <code>Window.location</code> 에</a> 첨부됩니다 .
ru: Аналогичная информация, но прикрепленная к <a href="https://developer.mozilla.org/en-US/docs/Glossary/browsing_context">контексту просмотра</a> , <a href="../window/location"> <code>Window.location</code> </a> .
zh_cn: 类似的信息，但附着在<a href="https://developer.mozilla.org/en-US/docs/Glossary/browsing_context">浏览器上下文</a>，<a href="../window/location"> <code>Window.location</code> </a>。

source: A similar information, but attached to the document, <a href="../document/location"><code>Document.location</code></a>.
ja: 同様の情報ですが、<a href="../document/location"> <code>Document.location</code> </a>添付されています。
ko: 비슷한 정보이지만 <a href="../document/location"> <code>Document.location</code> </a> 문서에 첨부되어 있습니다.
ru: Аналогичная информация, но приложенная к документу <a href="../document/location"> <code>Document.location</code> </a> .
zh_cn: 类似的信息，但附加在文档<a href="../document/location"> <code>Document.location</code> 上</a>。

source: A similar method: <a href="getcurrentposition"><code>Geolocation.getCurrentPosition()</code></a>
ja: 同様のメソッド：<a href="getcurrentposition"> <code>Geolocation.getCurrentPosition()</code> </a>
ko: 비슷한 방법 : <a href="getcurrentposition"> <code>Geolocation.getCurrentPosition()</code> </a>
ru: Аналогичный метод: <a href="getcurrentposition"> <code>Geolocation.getCurrentPosition()</code> </a>
zh_cn: 类似的方法：<a href="getcurrentposition"> <code>Geolocation.getCurrentPosition()</code> </a>

source: A simple <code>log()</code> function is used throughout the code to append HTML to a <a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/div"><code>&lt;div&gt;</code></a> box for displaying status and errors to the user.
ja: コード全体で単純な <code>log()</code> 関数を使用して、HTMLを<a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/div"> <code>&lt;div&gt;</code> </a>ボックスに追加し、ステータスとエラーをユーザーに表示します。
ko: 코드 전체에서 간단한 <code>log()</code> 함수를 사용하여 <a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/div"> <code>&lt;div&gt;</code> </a> 상자에 HTML을 추가 하여 사용자에게 상태 및 오류를 표시합니다.
ru: Простая функция <code>log()</code> используется во всем коде для добавления HTML в поле <a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/div"> <code>&lt;div&gt;</code> </a> для отображения статуса и ошибок для пользователя.
zh_cn: 在整个代码中使用了一个简单的 <code>log()</code> 函数，将HTML附加到<a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/div"> <code>&lt;div&gt;</code> </a>框中，以向用户显示状态和错误。

source: A simple B&eacute;zier curve
ja: 単純なベジエ曲線
ko: 간단한 베 지어 곡선
ru: Простая кривая Безье
zh_cn: 简单的贝塞尔曲线

source: A simple RTCDataChannel sample
ja: 単純なRTCDataChannelのサンプル
ko: 간단한 RTCDataChannel 샘플
ru: Простой образец RTCDataChannel
zh_cn: 一个简单的RTCDataChannel样本

source: A simple clipping region
ja: 単純なクリッピング領域
ko: 간단한 클리핑 영역
ru: Простая область обрезки
zh_cn: 一个简单的剪切区域

source: A simple container list for multiple <code>SourceBuffer</code> objects.
ja: 複数の <code>SourceBuffer</code> オブジェクトの単純なコンテナリスト。
ko: 여러 <code>SourceBuffer</code> 객체에 대한 간단한 컨테이너 목록입니다 .
ru: Простой список контейнеров для нескольких объектов <code>SourceBuffer</code> .
zh_cn: 一个用于多个 <code>SourceBuffer</code> 对象的简单容器列表。

source: A simple container list for multiple <code>TrackDefault</code> objects.
ja: 複数の <code>TrackDefault</code> オブジェクトのシンプルなコンテナリスト。
ko: 여러 <code>TrackDefault</code> 객체에 대한 간단한 컨테이너 목록입니다 .
ru: Простой список контейнеров для нескольких объектов <code>TrackDefault</code> .
zh_cn: 多个 <code>TrackDefault</code> 对象的简单容器列表。

source: A simple demonstration of procedural texturing with fragment shaders.
ja: フラグメントシェーダを使ったプロシージャルテクスチャリングの簡単なデモ。
ko: 프래그먼트 셰이더를 사용한 절차 적 텍스처링에 대한 간단한 데모.
ru: Простая демонстрация процедурного текстурирования фрагментами шейдеров.
zh_cn: 使用碎片着色器进行程序化纹理的简单演示。

source: A simple example
ja: 簡単な例
ko: 간단한 예
ru: простой пример
zh_cn: 一个简单的例子

source: A simple filled rectangle
ja: シンプルな塗りつぶした長方形
ko: 채워진 간단한 사각형
ru: Простой заполненный прямоугольник
zh_cn: 一个简单的填充矩形

source: A simple game that demonstrates clearing with solid colors, scissoring, animation, and user interaction.
ja: ベタ塗り、ハサミ、アニメーション、ユーザーとのやりとりでクリアを実演するシンプルなゲームです。
ko: 단색, 가위질, 애니메이션 및 사용자 상호 작용을 통해 제거하는 간단한 게임.
ru: Простая игра,которая демонстрирует очистку с помощью твердых цветов,ножниц,анимации и взаимодействия с пользователем.
zh_cn: 一个简单的游戏,演示了用纯色、剪刀、动画和用户互动来进行清场。

source: A simple getter used to expose a <a href="readablestream"><code>ReadableStream</code></a> of the body contents.
ja: 本文コンテンツの<a href="readablestream"> <code>ReadableStream</code> </a>を公​​開するために使用される単純なゲッター。
ko: 본문 내용 의 <a href="readablestream"> <code>ReadableStream</code> </a> 을 노출하는 데 사용되는 간단한 getter 입니다.
ru: Простой метод получения, используемый для представления <a href="readablestream"> <code>ReadableStream</code> </a> содержимого тела.
zh_cn: 一个简单的getter，用于公开主体内容的<a href="readablestream"> <code>ReadableStream</code> </a>。

source: A simple quadratic curve
ja: 単純な二次曲線
ko: 간단한 2 차 곡선
ru: Простая квадратичная кривая
zh_cn: 一个简单的二次曲线

source: A simple stroked rectangle
ja: シンプルにストロークされた長方形
ko: 간단한 스트로크 사각형
ru: Простой гладкий прямоугольник
zh_cn: 一个简单的笔画矩形

source: A simple test case
ja: シンプルなテストケース
ko: 간단한 테스트 사례
ru: Простой тестовый пример
zh_cn: 一个简单的测试案例

source: A simple, typical workflow for web audio would look something like this:
ja: ウェブオーディオのシンプルで典型的なワークフローは以下のようになります。
ko: 웹 오디오의 단순하고 일반적인 작업 과정은 다음과 같습니다.
ru: Простой,типичный рабочий процесс для веб-аудио будет выглядеть примерно так:
zh_cn: 一个简单的、典型的网络音频工作流程是这样的。

source: A single <a href="domstring"><code>DOMString</code></a>
ja: 単一の<a href="domstring"> <code>DOMString</code> </a>
ko: 단일 <a href="domstring"> <code>DOMString</code> </a>
ru: Одна <a href="domstring"> <code>DOMString</code> </a>
zh_cn: 单个<a href="domstring"> <code>DOMString</code> </a>

source: A single ICE server
ja: 1台のICEサーバ
ko: 단일 ICE 서버
ru: Один сервер ICE
zh_cn: 一台ICE服务器

source: A single ICE server with authentication
ja: 認証機能を持つ単一のICEサーバ
ko: 인증 된 단일 ICE 서버
ru: Один ICE-сервер с аутентификацией
zh_cn: 具有认证功能的单一ICE服务器

source: A single ICE server with multiple URLs
ja: 複数のURLを持つ単一のICEサーバ
ko: URL이 여러 개인 단일 ICE 서버
ru: Один сервер ICE с несколькими URL-адресами
zh_cn: 一个ICE服务器有多个URL

source: A single constraint is an object whose name matches the constrainable property whose desired value or range of values is being specified. This object contains zero or more individual constraints, as well as an optional sub-object named <code>advanced</code>, which contains another set of zero or more constraints which the user agent must satisfy if at all possible. The user agent attempts to satisfy constraints in the order specified in the constraint set.
ja: 単一の制約とは、目的の値または値の範囲が指定されている制約可能なプロパティと名前が一致するオブジェクトです。このオブジェクトには0個以上の個別の制約、および <code>advanced</code> という名前のオプションのサブオブジェクトが含まれます。これには、ユーザーエージェントが可能な限り満たす必要がある0個以上の制約の別のセットが含まれます。ユーザーエージェントは、制約セットで指定された順序で制約を満たそうとします。
ko: 단일 제한 조건은 이름이 원하는 값 또는 값 범위가 지정되는 제한 가능한 특성과 이름이 같은 오브젝트입니다. 이 오브젝트에는 0 개 이상의 개별 제한 조건과 <code>advanced</code> 라는 선택적 서브 오브젝트가 있으며 여기에는 사용자 에이전트가 가능한 경우 충족해야하는 0 개 이상의 제한 조건 세트가 포함되어 있습니다. 사용자 에이전트는 제한 조건 세트에 지정된 순서대로 제한 조건을 충족 시키려고 시도합니다.
ru: Единственное ограничение - это объект, имя которого соответствует ограничиваемому свойству, для которого указывается желаемое значение или диапазон значений. Этот объект содержит ноль или более отдельных ограничений, а также необязательный подобъект с именем <code>advanced</code> , который содержит другой набор из ноля или более ограничений, которым должен удовлетворять пользовательский агент, если это вообще возможно. Пользовательский агент пытается удовлетворить ограничения в порядке, указанном в наборе ограничений.
zh_cn: 单个约束是名称与可约束属性匹配的对象，该可约束属性的期望值或值的范围已指定。该对象包含零个或多个约束，以及一个可选的名为 <code>advanced</code> 子对象，该子对象包含另一组零个或多个约束，用户代理必须尽可能满足这些约束。用户代理尝试按照约束集中指定的顺序满足约束。

source: A single service worker can control many pages. Each time a page within your scope is loaded, the service worker is installed against that page and operates on it. Bear in mind therefore that you need to be careful with global variables in the service worker script: each page doesn&rsquo;t get its own unique worker.
ja: 1人のサービスワーカーが多くのページを制御できます。スコープ内のページが読み込まれるたびに、そのページに対してService Workerがインストールされ、操作されます。したがって、Service Workerスクリプトのグローバル変数には注意する必要があることを覚えておいてください。各ページは独自の固有のワーカーを取得しません。
ko: 한 서비스 직원이 여러 페이지를 제어 할 수 있습니다. 범위 내의 페이지가로드 될 때마다 서비스 워커가 해당 페이지에 대해 설치되어 작동합니다. 따라서 서비스 워커 스크립트에서 전역 변수에주의해야합니다. 각 페이지에는 고유 한 워커가 없습니다.
ru: Один работник службы может контролировать много страниц. Каждый раз, когда страница в вашей области загружается, работник службы устанавливается на эту страницу и работает с ней. Поэтому имейте в виду, что вам нужно быть осторожным с глобальными переменными в скрипте рабочего сервиса: каждая страница не имеет своего уникального работника.
zh_cn: 一个服务人员可以控制多个页面。每次加载您范围内的页面时，都会针对该页面安装Service Worker并对其进行操作。因此请记住，您需要小心服务工作程序脚本中的全局变量：每个页面都没有自己的唯一工作程序。

source: A single vibration
ja: 単発の振動
ko: 단일 진동
ru: Одна вибрация
zh_cn: 单次振动

source: A single-character access key to give access to the element.
ja: 要素へのアクセス権を与えるための1文字のアクセスキー。
ko: 요소에 액세스 할 수있는 단일 문자 액세스 키입니다.
ru: Односимвольная клавиша доступа для предоставления доступа к элементу.
zh_cn: 一个单字符的访问密钥,以允许访问该元素。

source: A site has an image carousel that shouldn't advance to the next slide unless the user is viewing the page
ja: サイトは、ユーザーがページを表示している場合を除き、次のスライドに進むべきではない画像カルーセルを持っている
ko: 사이트에 사용자가 페이지를 보지 않는 한 다음 슬라이드로 넘어 가지 않아야하는 이미지 슬라이드 쇼가 있습니다.
ru: На сайте есть карусель изображения,которая не должна перейти к следующему слайду,если только пользователь не просматривает страницу.
zh_cn: 一个网站有一个图像旋转木马,除非用户正在浏览页面,否则不应该推进到下一张幻灯片。

source: A site wants to switch off sounds when a device is in standby mode (user pushes power button to turn screen off)
ja: 端末がスタンバイ状態の時に音を消したい(ユーザーが電源ボタンを押して画面を消したい)。
ko: 장치가 대기 모드에있을 때 사이트에서 소리를 끄려고합니다 (사용자가 전원 버튼을 눌러 화면을 끕니다)
ru: Сайт хочет отключить звуки,когда устройство находится в режиме ожидания (пользователь нажимает кнопку питания,чтобы выключить экран).
zh_cn: 某网站希望在设备处于待机模式时(用户按下电源键关闭屏幕)关闭声音。

source: A skeleton template
ja: スケルトンテンプレート
ko: 골격 템플릿
ru: Шаблон скелета
zh_cn: 一个骨架模板
