Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/dom/dom.*.007.xlf
Languages: es, ko, ru, zh_cn

source: <strong>Don't use <code><a href="https://developer.mozilla.org/en-US/docs/JavaScript/Reference/Statements/for...in">for...in</a></code> or <code><a href="https://developer.mozilla.org/en-US/docs/JavaScript/Reference/Statements/for_each...in">for each...in</a></code> to enumerate the items in <code>NodeList</code>s</strong>, since they will <em>also</em> enumerate its <code>length</code> and <code>item</code> properties and cause errors if your script assumes it only has to deal with <a href="element"><code>element</code></a> objects. Also, <code>for..in</code> is not guaranteed to visit the properties in any particular order.
es: <strong>No utilice <code><a href="https://developer.mozilla.org/en-US/docs/JavaScript/Reference/Statements/for...in">for...in</a></code> o <code><a href="https://developer.mozilla.org/en-US/docs/JavaScript/Reference/Statements/for_each...in">for each...in</a></code> para enumerar los elementos en <code>NodeList</code> s</strong> , ya que <em>tambi&eacute;n</em> enumerar&aacute;n sus propiedades de <code>length</code> y <code>item</code> y causar&aacute;n errores si su script asume que solo tiene que tratar con objetos de <a href="element"> <code>element</code> os</a> . Adem&aacute;s, <code>for..in</code> no se garantiza visitar las propiedades en ning&uacute;n orden en particular.
ko: <strong>사용하지 마십시오 <code><a href="https://developer.mozilla.org/en-US/docs/JavaScript/Reference/Statements/for...in">for...in</a></code> 나 <code><a href="https://developer.mozilla.org/en-US/docs/JavaScript/Reference/Statements/for_each...in">for each...in</a></code> 의 항목을 열거 <code>NodeList</code> 를 들</strong> 그들이 때문에, <em>또한</em> 그것의 열거 <code>length</code> 와 <code>item</code> 스크립트가 만 처리해야 가정하면 특성과 원인 오류 <a href="element"> <code>element</code> </a> 객체. 또한 <code>for..in</code> 은 특정 순서로 속성을 방문한다고 보장하지 않습니다.
ru: <strong>Не используйте <code><a href="https://developer.mozilla.org/en-US/docs/JavaScript/Reference/Statements/for...in">for...in</a></code> или <code><a href="https://developer.mozilla.org/en-US/docs/JavaScript/Reference/Statements/for_each...in">for each...in</a></code> перечислять элементы в <code>NodeList</code> s</strong> , так как они будут <em>также</em> перечислить его <code>length</code> и <code>item</code> свойств и вызывают ошибки , если ваш сценарий предполагает , что он имеет дело только с <a href="element"> <code>element</code> </a> объектами. Кроме того, <code>for..in</code> не гарантируется посещение свойств в любом конкретном порядке.
zh_cn: <strong>不要使用 <code><a href="https://developer.mozilla.org/en-US/docs/JavaScript/Reference/Statements/for...in">for...in</a></code> 或 <code><a href="https://developer.mozilla.org/en-US/docs/JavaScript/Reference/Statements/for_each...in">for each...in</a></code> 列举中的项目 <code>NodeList</code> 小号</strong>，因为他们<em>也</em>列举其 <code>length</code> 和 <code>item</code> ，如果你的脚本假设它只有处理性能和导致错误<a href="element"> <code>element</code> </a>的对象。同样，不能保证 <code>for..in</code> 以任何特定顺序访问属性。

source: <strong>Draw animated shapes</strong>
es: <strong>Dibuja formas animadas</strong>
ko: <strong>애니메이션 모양 그리기</strong>
ru: <strong>Рисовать анимированные фигуры</strong>
zh_cn: <strong>绘制动画形状</strong>

source: <strong>Elements not in the document</strong> are not searched by <code>getElementById()</code>. When creating an element and assigning it an ID, you have to insert the element into the document tree with <a href="../node/insertbefore"><code>Node.insertBefore()</code></a> or a similar method before you can access it with <code>getElementById()</code>:
es: <strong></strong> <code>getElementById()</code> no busca los <strong>elementos que no est&aacute;n en el documento</strong> . Al crear un elemento y asignarle un ID, debe insertar el elemento en el &aacute;rbol del documento con <a href="../node/insertbefore"> <code>Node.insertBefore()</code> </a> o un m&eacute;todo similar antes de poder acceder con <code>getElementById()</code> :
ko: <strong>문서</strong> 에없는 <strong>요소</strong> 는 <code>getElementById()</code> 검색되지 않습니다 . 요소를 작성하고 ID를 지정할 때 <code>getElementById()</code> 액세스하기 전에 <a href="../node/insertbefore"> <code>Node.insertBefore()</code> </a> 또는 유사한 메소드 를 사용하여 문서 트리에 요소를 삽입 해야합니다 .
ru: <strong>Элементы, отсутствующие в документе</strong> , не ищутся методом <code>getElementById()</code> . При создании элемента и присвоении ему идентификатора необходимо вставить элемент в дерево документа с помощью <a href="../node/insertbefore"> <code>Node.insertBefore()</code> </a> или аналогичного метода, прежде чем вы сможете получить к нему доступ с помощью <code>getElementById()</code> :
zh_cn: <strong></strong> <code>getElementById()</code> 不会搜索<strong>文档</strong>中未包含的<strong>元素</strong>。创建元素并为其分配ID时，必须先使用<a href="../node/insertbefore"> <code>Node.insertBefore()</code> </a>或类似方法将元素插入文档树中，然后才能使用 <code>getElementById()</code> 访问它：

source: <strong>Exceptions on setting:</strong>
es: <strong>Excepciones en la configuraci&oacute;n:</strong>
ko: <strong>설정 예외 :</strong>
ru: <strong>Исключения по настройке:</strong>
zh_cn: <strong>设置例外：</strong>

source: <strong>Exceptions on setting:</strong> A <a href="domexception"><code>DOMException</code></a> with the code <code>NO_MODIFICATION_ALLOWED_ERR</code> is raised on an attempt to change the value of a read-only attribute.
es: <strong>Excepciones en la configuraci&oacute;n: se </strong><a href="domexception"> <code>DOMException</code> </a> una DOMException con el c&oacute;digo <code>NO_MODIFICATION_ALLOWED_ERR</code> en un intento de cambiar el valor de un atributo de solo lectura.
ko: <strong>설정 예외 :</strong> 읽기 전용 속성의 값을 변경하려고 하면 코드 <code>NO_MODIFICATION_ALLOWED_ERR</code> 의 <a href="domexception"> <code>DOMException</code> </a> 이 발생합니다.
ru: <strong>Исключения по настройке:</strong> A <a href="domexception"> <code>DOMException</code> </a> с кодом <code>NO_MODIFICATION_ALLOWED_ERR</code> подняты на попытку изменить значение атрибута только для чтения.
zh_cn: <strong>设置上</strong>的<a href="domexception"> <code>DOMException</code> </a><strong>：</strong>尝试更改只读属性的值时，将 <code>NO_MODIFICATION_ALLOWED_ERR</code> 代码为NO_MODIFICATION_ALLOWED_ERR的DOMException。

source: <strong>Exceptions on setting:</strong> a <a href="domexception"><code>DOMException</code></a> with code <code>NO_MODIFICATION_ALLOWED_ERR</code> is raised when the length corresponds to a read only attribute or when the object itself is read only.
es: <strong>Excepciones en la configuraci&oacute;n:</strong> una <a href="domexception"> <code>DOMException</code> </a> con el c&oacute;digo <code>NO_MODIFICATION_ALLOWED_ERR</code> se genera cuando la longitud corresponde a un atributo de solo lectura o cuando el objeto en s&iacute; mismo es de solo lectura.
ko: <strong>설정 예외 :</strong> 길이가 읽기 전용 속성에 해당하거나 오브젝트 자체가 읽기 전용 인 경우 코드 <code>NO_MODIFICATION_ALLOWED_ERR</code> 의 <a href="domexception"> <code>DOMException</code> </a> 이 발생합니다.
ru: <strong>Исключения по установке: </strong><a href="domexception"> <code>DOMException</code> </a> с кодом <code>NO_MODIFICATION_ALLOWED_ERR</code> возникает , когда длина соответствует только для чтения атрибута или когда сам объект только для чтения.
zh_cn: <strong>设置例外：</strong>当长度对应于只读属性或对象本身为只读时，将 <code>NO_MODIFICATION_ALLOWED_ERR</code> 代码为NO_MODIFICATION_ALLOWED_ERR的<a href="domexception"> <code>DOMException</code> </a>。

source: <strong>Exceptions on setting:</strong> a <code><a href="domexception">DOMException</a></code> with code <code>NO_MODIFICATION_ALLOWED_ERR</code> is raised on an attempt to change the value of an attribute on a read only object.
es: <strong>Excepciones en la configuraci&oacute;n: se </strong> <code><a href="domexception">DOMException</a></code> una DOMException con el c&oacute;digo <code>NO_MODIFICATION_ALLOWED_ERR</code> en un intento de cambiar el valor de un atributo en un objeto de solo lectura.
ko: <strong>설정 예외 :</strong> 읽기 전용 객체의 속성 값을 변경하려고하면 코드 <code>NO_MODIFICATION_ALLOWED_ERR</code> 의 <code><a href="domexception">DOMException</a></code> 이 발생합니다.
ru: <strong>Исключения по установке: </strong> <code><a href="domexception">DOMException</a></code> с кодом <code>NO_MODIFICATION_ALLOWED_ERR</code> подняты на попытку изменить значение атрибута на только для чтения объекта.
zh_cn: <strong>设置异常：</strong>尝试更改只读对象上的属性值时， <code>NO_MODIFICATION_ALLOWED_ERR</code> 代码为NO_MODIFICATION_ALLOWED_ERR的 <code><a href="domexception">DOMException</a></code> 。

source: <strong>FIDO U2F</strong> - security keys that implement the FIDO U2F standard use this format
es: <strong>FIDO U2F</strong> : las claves de seguridad que implementan el est&aacute;ndar FIDO U2F utilizan este formato
ko: <strong>FIDO U2F</strong> -FIDO U2F 표준을 구현하는 보안 키는이 형식을 사용합니다
ru: <strong>FIDO U2F</strong> - ключи безопасности, которые реализуют стандарт FIDO U2F, используют этот формат
zh_cn: <strong>FIDO U2F-</strong>实施FIDO U2F标准的安全密钥使用此格式

source: <strong>FYI:</strong> This seemingly overcomplicated process exists so that it's obvious to the client whether or not the server supports WebSockets. This is important because security issues might arise if the server accepts a WebSockets connection but interprets the data as a HTTP request.
es: <strong>FYI:</strong> este proceso aparentemente excesivamente complicado existe para que sea obvio para el cliente si el servidor admite o no WebSockets. Esto es importante porque pueden surgir problemas de seguridad si el servidor acepta una conexi&oacute;n WebSockets pero interpreta los datos como una solicitud HTTP.
ko: <strong>참고 :</strong> 서버가 WebSockets를 지원하는지 여부를 명확하게 알 수 있도록 지나치게 복잡해 보이는이 프로세스가 존재합니다. 이는 서버가 WebSockets 연결을 수락하지만 데이터를 HTTP 요청으로 해석하는 경우 보안 문제가 발생할 수 있기 때문에 중요합니다.
ru: <strong>К вашему сведению:</strong> этот, казалось бы, слишком сложный процесс существует, поэтому для клиента очевидно, поддерживает ли сервер WebSockets. Это важно, потому что могут возникнуть проблемы с безопасностью, если сервер принимает соединение WebSockets, но интерпретирует данные как HTTP-запрос.
zh_cn: <strong>仅供参考：</strong>这个看似过于复杂的过程存在，因此对于客户端来说，服务器是否支持WebSockets是显而易见的。这很重要，因为如果服务器接受WebSockets连接但将数据解释为HTTP请求，则可能会出现安全问题。

source: <strong>Fan-out</strong> describes the opposite process, whereby a <a href="../channelsplitternode"><code>ChannelSplitterNode</code></a> takes a multi-channel input source and outputs multiple mono output signals:
es: <strong>Fan-out</strong> describe el proceso opuesto, mediante el cual un <a href="../channelsplitternode"> <code>ChannelSplitterNode</code> </a> toma una fuente de entrada multicanal y emite m&uacute;ltiples se&ntilde;ales de salida mono:
ko: <strong>팬 아웃</strong> 은 반대 프로세스를 설명하며, <a href="../channelsplitternode"> <code>ChannelSplitterNode</code> </a> 는 다중 채널 입력 소스를 사용하여 여러 모노 출력 신호를 출력합니다.
ru: <strong>Разветвление</strong> описывает противоположный процесс, при котором <a href="../channelsplitternode"> <code>ChannelSplitterNode</code> </a> принимает многоканальный входной источник и выводит несколько монофонических выходных сигналов:
zh_cn: <strong>扇出</strong>描述相反的过程，其中<a href="../channelsplitternode"> <code>ChannelSplitterNode</code> </a>获取多通道输入源并输出多个单声道输出信号：

source: <strong>Fast purchase experience</strong>: Users enter their details once into the browser and are then ready to pay for goods and services on the web. They no longer have to fill out the same details repeatedly across different sites.
es: <strong>Experiencia de compra r&aacute;pida</strong> : los usuarios ingresan sus datos una vez en el navegador y luego est&aacute;n listos para pagar los bienes y servicios en la web. Ya no tienen que completar los mismos detalles repetidamente en diferentes sitios.
ko: <strong>빠른 구매 경험</strong> : 사용자는 브라우저에 세부 정보를 한 번 입력하면 웹에서 상품 및 서비스에 대한 비용을 지불 할 수 있습니다. 더 이상 서로 다른 사이트에서 동일한 세부 정보를 반복적으로 작성할 필요가 없습니다.
ru: <strong>Быстрый опыт покупки</strong> : пользователи вводят свои данные один раз в браузер, а затем готовы платить за товары и услуги в Интернете. Им больше не нужно заполнять одни и те же данные неоднократно на разных сайтах.
zh_cn: <strong>快速的购买体验</strong>：用户只需在浏览器中输入其详细信息，即可准备在网上购买商品和服务。他们不再需要在不同站点之间重复填写相同的详细信息。

source: <strong>Firefox Nightly</strong>: Go to <code>about:config</code> and set <code>dom.serviceWorkers.enabled</code> to true; restart browser.
es: <strong>Firefox Nightly</strong> : vaya a <code>about:config</code> y establezca <code>dom.serviceWorkers.enabled</code> en true; reiniciar navegador.
ko: <strong>Firefox Nightly</strong> : <code>about:config</code> 로 이동하여 <code>dom.serviceWorkers.enabled</code> 를 true로 설정하십시오 . 브라우저를 재시작하시오.
ru: <strong>Firefox Nightly</strong> : <code>dom.serviceWorkers.enabled</code> в <code>about:config</code> и установите для dom.serviceWorkers.enabled значение true; перезапустите браузер.
zh_cn: <strong>Firefox Nightly</strong>：转到 <code>about:config</code> 并将 <code>dom.serviceWorkers.enabled</code> 设置为true；重启浏览器。

source: <strong>For <a href="https://developer.mozilla.org/en-US/docs/Web/CSS/At-rule">at-rules</a></strong>, both an at-identifier and the rule content.
es: <strong>Para <a href="https://developer.mozilla.org/en-US/docs/Web/CSS/At-rule">at-rules</a></strong> , tanto un at-identifier como el contenido de la regla.
ko: <strong>대한 <a href="https://developer.mozilla.org/en-US/docs/Web/CSS/At-rule">-규칙에서</a></strong> ,가 AT-식별자와 규칙의 내용을 모두.
ru: <strong>Для <a href="https://developer.mozilla.org/en-US/docs/Web/CSS/At-rule">правил</a></strong> at - и идентификатор at, и содержание правила.
zh_cn: <strong>对于<a href="https://developer.mozilla.org/en-US/docs/Web/CSS/At-rule">规则</a></strong>，同时包含标识符和规则内容。

source: <strong>For <a href="https://developer.mozilla.org/en-US/docs/Web/CSS/Syntax#CSS_statements">rule-sets</a></strong>, both a <a href="https://developer.mozilla.org/en-US/docs/Web/Guide/CSS/Getting_Started/Selectors">selector</a> and a style declaration.
es: <strong>Para <a href="https://developer.mozilla.org/en-US/docs/Web/CSS/Syntax#CSS_statements">conjuntos de reglas</a></strong> , tanto un <a href="https://developer.mozilla.org/en-US/docs/Web/Guide/CSS/Getting_Started/Selectors">selector</a> como una declaraci&oacute;n de estilo.
ko: <strong>대한 <a href="https://developer.mozilla.org/en-US/docs/Web/CSS/Syntax#CSS_statements">규칙 세트</a></strong> , 둘 다를 <a href="https://developer.mozilla.org/en-US/docs/Web/Guide/CSS/Getting_Started/Selectors">선택</a> 과 스타일 선언.
ru: <strong>Для <a href="https://developer.mozilla.org/en-US/docs/Web/CSS/Syntax#CSS_statements">наборов правил</a></strong> , как <a href="https://developer.mozilla.org/en-US/docs/Web/Guide/CSS/Getting_Started/Selectors">селектор, так</a> и объявление стиля.
zh_cn: <strong>对于<a href="https://developer.mozilla.org/en-US/docs/Web/CSS/Syntax#CSS_statements">规则集</a></strong>，既包括<a href="https://developer.mozilla.org/en-US/docs/Web/Guide/CSS/Getting_Started/Selectors">选择器</a>，也包括样式声明。

source: <strong>Further reading:</strong>
es: <strong>Otras lecturas:</strong>
ko: <strong>더 읽을 거리 :</strong>
ru: <strong>Дальнейшее чтение:</strong>
zh_cn: <strong>进一步阅读：</strong>

source: <strong>Gecko:</strong> Paint thread
es: <strong>Gecko:</strong> hilo de pintura
ko: <strong>게코 :</strong> 페인트 실
ru: <strong>Геккон:</strong> Краска ниток
zh_cn: <strong>壁虎：</strong>油漆线

source: <strong>General note:</strong> In newer browser versions, <code>close()</code> is available on <code>SharedWorkerGlobalScope</code> and <a href="../dedicatedworkerglobalscope/close"><code>DedicatedWorkerGlobalScope</code></a>. In older browser versions, it is available on <a href="https://developer.mozilla.org/en-US/docs/Web/API/WorkerGlobalScope/close"><code>WorkerGlobalScope</code></a>. This change was made to stop <code>close()</code> being available on service workers, as it isn't supposed to be used there and always throws an exception when called (see <a href="https://bugzilla.mozilla.org/show_bug.cgi?id=1336043">bug 1336043</a>).
es: <strong>Nota general:</strong> en las versiones m&aacute;s recientes del navegador, <code>close()</code> est&aacute; disponible en <code>SharedWorkerGlobalScope</code> y <a href="../dedicatedworkerglobalscope/close"> <code>DedicatedWorkerGlobalScope</code> </a> . En versiones anteriores del navegador, est&aacute; disponible en <a href="https://developer.mozilla.org/en-US/docs/Web/API/WorkerGlobalScope/close"> <code>WorkerGlobalScope</code> </a> . Este cambio se realiz&oacute; para evitar que <code>close()</code> est&eacute; disponible para los trabajadores de servicio, ya que no se supone que se use all&iacute; y siempre arroja una excepci&oacute;n cuando se llama (vea el <a href="https://bugzilla.mozilla.org/show_bug.cgi?id=1336043">error 1336043</a> ).
ko: <strong>일반 참고 사항 :</strong> 최신 브라우저 버전에서는 <code>close()</code> 를 <code>SharedWorkerGlobalScope</code> 및 <a href="../dedicatedworkerglobalscope/close"> <code>DedicatedWorkerGlobalScope</code> </a> 에서 사용할 수 있습니다 . 이전 브라우저 버전에서는 <a href="https://developer.mozilla.org/en-US/docs/Web/API/WorkerGlobalScope/close"> <code>WorkerGlobalScope</code> 에서</a> 사용할 수 있습니다 . 이 변경은 서비스 워커에서 <code>close()</code> 사용 을 중지하도록 만들어졌습니다. close () 는 사용되지 않아야하며 호출 될 때 항상 예외를 발생 <a href="https://bugzilla.mozilla.org/show_bug.cgi?id=1336043">시킵니다</a> ( 버그 1336043 참조 ).
ru: <strong>Общее примечание.</strong> В более новых версиях браузера <code>SharedWorkerGlobalScope</code> <code>close()</code> доступна в SharedWorkerGlobalScope и <a href="../dedicatedworkerglobalscope/close"> <code>DedicatedWorkerGlobalScope</code> </a> . В более старых версиях браузера он доступен на <a href="https://developer.mozilla.org/en-US/docs/Web/API/WorkerGlobalScope/close"> <code>WorkerGlobalScope</code> </a> . Это изменение было сделано, чтобы <a href="https://bugzilla.mozilla.org/show_bug.cgi?id=1336043">запретить</a> доступность <code>close()</code> для сервисных работников, поскольку он не должен использоваться там и всегда вызывает исключение при вызове (см. Ошибку 1336043 ).
zh_cn: <strong>一般说明：</strong>在较新的浏览器版本中， <code>close()</code> 在 <code>SharedWorkerGlobalScope</code> 和<a href="../dedicatedworkerglobalscope/close"> <code>DedicatedWorkerGlobalScope</code> </a>上可用。在较旧的浏览器版本中，它在<a href="https://developer.mozilla.org/en-US/docs/Web/API/WorkerGlobalScope/close"> <code>WorkerGlobalScope</code> </a>上可用。进行此更改是为了使 <code>close()</code> 停止在服务工作者上可用，因为不应在服务工作者上使用close（），并且在调用它时始终会引发异常（请参见<a href="https://bugzilla.mozilla.org/show_bug.cgi?id=1336043">bug 1336043</a>）。

source: <strong>Happens when</strong>
es: <strong>Sucede cuando</strong>
ko: <strong>언제 발생</strong>
ru: <strong>Бывает когда</strong>
zh_cn: <strong>发生在</strong>

source: <strong>ICE trickling</strong> is the process of continuing to send candidates after the initial offer or answer has already been sent to the other peer.
es: <strong>ICE goteo</strong> es el proceso de continuar enviando candidatos despu&eacute;s de que la oferta o respuesta inicial ya se haya enviado al otro par.
ko: <strong>ICE 물방울</strong> 은 초기 제안 또는 답변이 다른 상대방에게 이미 전송 된 후 후보자를 계속 전송하는 프로세스입니다.
ru: <strong>ICE Trickling</strong> - это процесс продолжения отправки кандидатов после того, как первоначальное предложение или ответ уже отправлен другому партнеру.
zh_cn: <strong>ICE欺骗</strong>是在初始要约或答案已发送给其他对等方之后继续发送候选人的过程。

source: <strong>Idle callbacks should do their best not to overrun the time allotted.</strong> While the browser, your code, and the Web in general will continue to run normally if you go over the specified time limit (even if you go<em>way</em> over it), the time restriction is intended to ensure that you leave the system enough time to finish the current pass through the event loop and get on to the next one without causing other code to stutter or animation effects to lag. Currently, <a href="idledeadline/timeremaining"><code>timeRemaining()</code></a> has an upper limit of 50 milliseconds, but in reality you will often have less time than that, since the event loop may already be eating into that time on complex sites, with browser extensions needing processor time, and so forth.
es: <strong>Las devoluciones de llamada inactivas deber&iacute;an hacer todo lo posible para no sobrepasar el tiempo asignado.</strong> Mientras que el navegador, su c&oacute;digo, y la web en general continuar&aacute;n funcionando normalmente si se excede el l&iacute;mite de tiempo especificado (incluso si vas <em>manera</em> sobre ella), la restricci&oacute;n de tiempo tiene como objetivo garantizar que deje el sistema de tiempo suficiente para finalice el paso actual a trav&eacute;s del bucle de eventos y contin&uacute;e con el siguiente sin causar que otro c&oacute;digo tartamudee o que los efectos de animaci&oacute;n se retrasen. Actualmente, <a href="idledeadline/timeremaining"> <code>timeRemaining()</code> </a> tiene un l&iacute;mite superior de 50 milisegundos, pero en realidad a menudo tendr&aacute; menos tiempo que eso, ya que el bucle de eventos ya puede estar consumiendo ese tiempo en sitios complejos, con extensiones de navegador que necesitan tiempo de procesador, etc. .
ko: <strong>유휴 콜백은 할당 된 시간을 초과하지 않도록 최선을 다해야합니다.</strong> 브라우저, 코드, 그리고 일반적으로 웹 (당신이가는 경우에도 지정된 시간 제한을 통해 갈 경우 정상적으로 계속 실행되지만 <em>방법을</em> 그 위에), 시간 제한은 당신이 시스템을 충분한 시간을두고 수 있도록하기위한 것입니다 이벤트 루프를 통과하는 현재 패스를 끝내고 다른 코드가 끊기거나 애니메이션 효과가 지연되지 않도록 다음 루프로 넘어갑니다. 현재 <a href="idledeadline/timeremaining"> <code>timeRemaining()</code> </a> 상한은 50 밀리 초이지만 실제로는 이벤트 루프가 프로세서 시간이 필요한 브라우저 확장을 사용하여 복잡한 사이트에서 해당 시간에 해당 시간을 먹고있을 수 있으므로 실제로는 시간보다 적은 시간이 소요됩니다. .
ru: <strong>Неактивные обратные вызовы должны делать все возможное, чтобы не превышать выделенное время.</strong> В то время как браузер, ваш код, и Web в целом будет продолжать работать нормально , если вы идете на определенный срок (даже если вы идете <em>путь</em> над ним), то ограничение времени предназначено для того , чтобы вы оставить систему достаточно времени , чтобы завершите текущий проход через цикл обработки событий и переходите к следующему, не вызывая заикания другого кода или задержки анимационных эффектов. В настоящее время <a href="idledeadline/timeremaining"> <code>timeRemaining()</code> </a> имеет верхний предел в 50 миллисекунд, но на самом деле у вас часто будет меньше времени, чем это, поскольку цикл обработки событий может уже потребляться в это время на сложных сайтах, поскольку расширениям браузера требуется процессорное время и т. Д. ,
zh_cn: <strong>空闲的回调应尽最大努力不超过分配的时间。</strong>虽然浏览器，你的代码，和一般的网络将继续，如果你去了指定的时间限制（即使你到正常运行<em>方式</em>在它），时间限制是为了确保你离开系统足够的时间来完成当前通过事件循环的操作并继续进行下一个操作，而不会导致其他代码结结或动画效果滞后。当前，<a href="idledeadline/timeremaining"> <code>timeRemaining()</code> </a>的上限为50毫秒，但实际上，您的时间通常少于该时间，因为事件循环可能已经在复杂站点上占用了该时间，而浏览器扩展需要处理器时间，依此类推。 。

source: <strong>If merchant validation is supported by the payment handler, respond to merchant validation requests from the user agent.</strong> See <a href="#Merchant_validation">Merchant validation</a> for details.
es: <strong>Si el manejador de pagos admite la validaci&oacute;n de comerciante, responda a las solicitudes de validaci&oacute;n de comerciante del agente de usuario. </strong>Ver <a href="#Merchant_validation">Validaci&oacute;n de comerciante</a> para m&aacute;s detalles.
ko: <strong>지불 핸들러가 판매자 유효성 검증을 지원하는 경우 사용자 에이전트의 판매자 유효성 검증 요청에 응답하십시오. </strong>자세한 내용은 <a href="#Merchant_validation">판매자 유효성 검사</a> 를 참조하십시오.
ru: <strong>Если проверка продавца поддерживается обработчиком платежа, ответьте на запросы проверки продавца от пользовательского агента. </strong>См. <a href="#Merchant_validation">Подтверждение продавца</a> для деталей.
zh_cn: <strong>如果付款处理程序支持商家验证，请响应来自用户代理的商家验证请求。</strong>有关详情，请参见<a href="#Merchant_validation">商家验证</a>。
