Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/dom/dom.*.007.xlf
Languages: es, ko, ru, zh_cn

source: <em>Inherits properties from its parent, <a href="htmlelement"><code>HTMLElement</code></a></em><em>, and implements <a href="linkstyle"><code>LinkStyle</code></a></em><em>.</em>
es: <em>Hereda propiedades de su padre, <a href="htmlelement"> <code>HTMLElement</code> </a></em><em> e implementa <a href="linkstyle"> <code>LinkStyle</code> </a></em><em> .</em>
ko: <em>부모 <a href="htmlelement"> <code>HTMLElement</code> </a></em><em> 에서 속성을 상속 </em><em>하고 <a href="linkstyle"> <code>LinkStyle</code> 을</a></em><em> 구현 </em><em>합니다</em><em> .</em>
ru: <em>Наследует свойства от своего родителя, <a href="htmlelement"> <code>HTMLElement</code> </a></em><em> , и реализует <a href="linkstyle"> <code>LinkStyle</code> </a></em><em> .</em>
zh_cn: <em>从其父<a href="htmlelement"> <code>HTMLElement</code> </a></em><em><a href="linkstyle"> <code>LinkStyle</code> </a></em><em>HTMLElement</em><em>继承属性</em><em>，并实现LinkStyle</em><em>。</em>

source: <em>Inherits properties from its parent, <a href="https://developer.mozilla.org/en-US/docs/Web/API/CharacterData"><code>CharacterData</code></a>.</em>
es: <em>Hereda propiedades de su padre, <a href="https://developer.mozilla.org/en-US/docs/Web/API/CharacterData"> <code>CharacterData</code> </a> .</em>
ko: <em>부모 인 <a href="https://developer.mozilla.org/en-US/docs/Web/API/CharacterData"> <code>CharacterData</code> </a> 에서 속성을 상속합니다 .</em>
ru: <em>Унаследует свойства от своего родителя <a href="https://developer.mozilla.org/en-US/docs/Web/API/CharacterData"> <code>CharacterData</code> </a> .</em>
zh_cn: <em>从其父<a href="https://developer.mozilla.org/en-US/docs/Web/API/CharacterData"> <code>CharacterData</code> </a>继承属性。</em>

source: <em>Inherits properties from its parent, <a href="node"><code>Node</code></a>, and implements the <a href="childnode"><code>ChildNode</code></a> interface.</em>
es: <em>Hereda las propiedades de su padre, <a href="node"> <code>Node</code> </a> , e implementa la interfaz <a href="childnode"> <code>ChildNode</code> </a> .</em>
ko: <em>부모 인 <a href="node"> <code>Node</code> </a> 에서 속성을 상속 하고 <a href="childnode"> <code>ChildNode</code> </a> 인터페이스를 구현합니다 .</em>
ru: <em>Наследует свойства от своего родителя <a href="node"> <code>Node</code> </a> и реализует интерфейс <a href="childnode"> <code>ChildNode</code> </a> .</em>
zh_cn: <em>从其父<a href="node"> <code>Node</code> </a>继承属性，并实现<a href="childnode"> <code>ChildNode</code> </a>接口。</em>

source: <em>Inherits properties from its parent, <a href="stylepropertymapreadonly"><code>StylePropertyMapReadOnly</code></a>.</em>
es: <em>Hereda propiedades de su padre, <a href="stylepropertymapreadonly"> <code>StylePropertyMapReadOnly</code> </a> .</em>
ko: <em>부모로부터 상속 속성 <a href="stylepropertymapreadonly"> <code>StylePropertyMapReadOnly</code> </a> .</em>
ru: <em>Унаследует свойства от своего родителя <a href="stylepropertymapreadonly"> <code>StylePropertyMapReadOnly</code> </a> .</em>
zh_cn: <em>从其父级<a href="stylepropertymapreadonly"> <code>StylePropertyMapReadOnly</code> </a>继承属性。</em>

source: <em>Inherits properties from its parent, <a href="stylesheet"><code>StyleSheet</code></a>.</em>
es: <em>Hereda propiedades de su padre, <a href="stylesheet"> <code>StyleSheet</code> </a> .</em>
ko: <em>부모 <a href="stylesheet"> <code>StyleSheet</code> </a> 에서 속성을 상속합니다 .</em>
ru: <em>Унаследует свойства от своего родителя, <a href="stylesheet"> <code>StyleSheet</code> </a> .</em>
zh_cn: <em>从其父级<a href="stylesheet"> <code>StyleSheet</code> </a>继承属性。</em>

source: <em>Inherits properties from its parent, <code><a href="cssvalue"><code>CSSValue</code></a></code></em>.
es: <em>Hereda propiedades de su padre, <code><a href="cssvalue"><code>CSSValue</code></a></code> </em> .
ko: <em>부모 <code><a href="cssvalue"><code>CSSValue</code></a></code> </em><em> 에서 속성을 상속합니다</em> .
ru: <em>Наследует свойства от своего родителя, <code><a href="cssvalue"><code>CSSValue</code></a></code> </em> .
zh_cn: <em>从其父 <code><a href="cssvalue"><code>CSSValue</code></a></code> </em><em>继承属性</em>。

source: <em>Never</em> use this form of code for links: <code>&lt;a href="javascript:window.open(...)" ...&gt;</code>
es: <em>Nunca</em> use esta forma de c&oacute;digo para enlaces: <code>&lt;a href="javascript:window.open(...)" ...&gt;</code>
ko: <em></em>링크에이 형식의 코드를 사용 <em>하지 마십시오</em> : <code>&lt;a href="javascript:window.open(...)" ...&gt;</code>
ru: <em>Никогда не</em> используйте эту форму кода для ссылок: <code>&lt;a href="javascript:window.open(...)" ...&gt;</code>
zh_cn: <em>切勿</em>将这种形式的代码用于链接： <code>&lt;a href="javascript:window.open(...)" ...&gt;</code>

source: <em>No inherited method.</em>
es: <em>No hay m&eacute;todo heredado.</em>
ko: <em>상속 된 방법이 없습니다.</em>
ru: <em>Нет унаследованного метода.</em>
zh_cn: <em>没有继承的方法。</em>

source: <em>No inherited static methods</em>.
es: <em>No hay m&eacute;todos est&aacute;ticos heredados</em> .
ko: <em>상속 된 정적 메소드가 없습니다</em> .
ru: <em>Нет унаследованных статических методов</em> .
zh_cn: <em>没有继承的静态方法</em>。

source: <em>No methods, but inherits methods from <a href="eventtarget"><code>EventTarget</code></a>.</em>
es: <em>No hay m&eacute;todos, pero hereda m&eacute;todos de <a href="eventtarget"> <code>EventTarget</code> </a> .</em>
ko: <em>메소드는 없지만 <a href="eventtarget"> <code>EventTarget</code> 의</a> 메소드를 상속합니다 .</em>
ru: <em>Нет методов, но наследует методы от <a href="eventtarget"> <code>EventTarget</code> </a> .</em>
zh_cn: <em>没有方法，但是从<a href="eventtarget"> <code>EventTarget</code> </a>继承方法。</em>

source: <em>No methods, but inherits methods from its parents <a href="idbrequest"><code>IDBRequest</code></a> and <a href="eventtarget"><code>EventTarget</code></a>.</em>
es: <em>No hay m&eacute;todos, pero hereda m&eacute;todos de sus padres <a href="idbrequest"> <code>IDBRequest</code> </a> y <a href="eventtarget"> <code>EventTarget</code> </a> .</em>
ko: <em>메서드는 없지만 부모 <a href="idbrequest"> <code>IDBRequest</code> </a> 및 <a href="eventtarget"> <code>EventTarget</code> 의</a> 메서드를 상속합니다 .</em>
ru: <em>Нет методов, но наследует методы от своих родителей <a href="idbrequest"> <code>IDBRequest</code> </a> и <a href="eventtarget"> <code>EventTarget</code> </a> .</em>
zh_cn: <em>没有方法，但是从其父<a href="idbrequest"> <code>IDBRequest</code> </a>和<a href="eventtarget"> <code>EventTarget</code> </a>继承方法。</em>

source: <em>No specific event handler; inherits event handlers from its parent, <a href="htmlelement"><code>HTMLElement</code></a> and from <a href="windoweventhandlers"><code>WindowEventHandlers</code></a></em><em>.</em>
es: <em>No hay controlador de eventos espec&iacute;fico; hereda controladores de eventos de su padre, <a href="htmlelement"> <code>HTMLElement</code> </a> y de <a href="windoweventhandlers"> <code>WindowEventHandlers</code> </a></em><em> .</em>
ko: <em>특정 이벤트 핸들러가 없습니다. 부모, <a href="htmlelement"> <code>HTMLElement</code> </a> 및 <a href="windoweventhandlers"> <code>WindowEventHandlers</code> </a></em><em> 에서 이벤트 핸들러를 상속 </em><em>합니다</em><em> .</em>
ru: <em>Нет конкретного обработчика событий; наследует обработчики событий от своего родителя, <a href="htmlelement"> <code>HTMLElement</code> </a> и от <a href="windoweventhandlers"> <code>WindowEventHandlers</code> </a></em><em> .</em>
zh_cn: <em>没有特定的事件处理程序；从其父<a href="htmlelement"> <code>HTMLElement</code> </a>和<a href="windoweventhandlers"> <code>WindowEventHandlers</code> </a></em><em>继承事件处理程序</em><em>。</em>

source: <em>No specific event handlers; inherits event handlers from its parent, <a href="htmlelement"><code>HTMLElement</code></a> and from <a href="windoweventhandlers"><code>WindowEventHandlers</code></a></em><em>.</em>
es: <em>No hay controladores de eventos espec&iacute;ficos; hereda controladores de eventos de su padre, <a href="htmlelement"> <code>HTMLElement</code> </a> y de <a href="windoweventhandlers"> <code>WindowEventHandlers</code> </a></em><em> .</em>
ko: <em>특정 이벤트 핸들러가 없습니다. 부모, <a href="htmlelement"> <code>HTMLElement</code> </a> 및 <a href="windoweventhandlers"> <code>WindowEventHandlers</code> </a></em><em> 에서 이벤트 핸들러를 상속 </em><em>합니다</em><em> .</em>
ru: <em>Нет конкретных обработчиков событий; наследует обработчики событий от своего родителя, <a href="htmlelement"> <code>HTMLElement</code> </a> и от <a href="windoweventhandlers"> <code>WindowEventHandlers</code> </a></em><em> .</em>
zh_cn: <em>没有特定的事件处理程序；从其父<a href="htmlelement"> <code>HTMLElement</code> </a>和<a href="windoweventhandlers"> <code>WindowEventHandlers</code> </a></em><em>继承事件处理程序</em><em>。</em>

source: <em>No specific event handlers; inherits methods from its ancestor, <a href="sensor"><code>Sensor</code></a>.</em>
es: <em>No hay controladores de eventos espec&iacute;ficos; hereda m&eacute;todos de su antepasado, <a href="sensor"> <code>Sensor</code> </a> .</em>
ko: <em>특정 이벤트 핸들러가 없습니다. 조상 인 <a href="sensor"> <code>Sensor</code> </a> 에서 메소드를 상속합니다 .</em>
ru: <em>Нет конкретных обработчиков событий; наследует методы от своего предка, <a href="sensor"> <code>Sensor</code> </a> .</em>
zh_cn: <em>没有特定的事件处理程序；从其祖先<a href="sensor"> <code>Sensor</code> </a>继承方法。</em>

source: <em>No specific method, but inherits methods from its parent, <a href="htmlelement"><code>HTMLElement</code></a>.</em>
es: <em>No hay un m&eacute;todo espec&iacute;fico, pero hereda m&eacute;todos de su elemento primario, <a href="htmlelement"> <code>HTMLElement</code> </a> .</em>
ko: <em>특정 메소드는 없지만 상위 <a href="htmlelement"> <code>HTMLElement</code> 의</a> 메소드를 상속합니다 .</em>
ru: <em>Нет конкретного метода, но наследует методы от своего родителя, <a href="htmlelement"> <code>HTMLElement</code> </a> .</em>
zh_cn: <em>没有特定的方法，但是从其父<a href="htmlelement"> <code>HTMLElement</code> </a>继承方法。</em>

source: <em>No specific method, but inherits properties from its parent, <a href="https://developer.mozilla.org/en-US/docs/Web/API/Method"><code>Method</code></a>.</em>
es: <em>No hay un m&eacute;todo espec&iacute;fico, pero hereda las propiedades de su padre, <a href="https://developer.mozilla.org/en-US/docs/Web/API/Method"> <code>Method</code> </a> .</em>
ko: <em>특정 메서드는 없지만 부모 인 <a href="https://developer.mozilla.org/en-US/docs/Web/API/Method"> <code>Method</code> </a> 에서 속성을 상속합니다 .</em>
ru: <em>Нет конкретного метода, но наследует свойства от своего родителя, <a href="https://developer.mozilla.org/en-US/docs/Web/API/Method"> <code>Method</code> </a> .</em>
zh_cn: <em>没有特定的方法，但是从其父类<a href="https://developer.mozilla.org/en-US/docs/Web/API/Method"> <code>Method</code> </a>继承属性。</em>

source: <em>No specific method; </em><em>inherits methods from its parent, <a href="htmlelement"><code>HTMLElement</code></a></em>.
es: <em>No hay un m&eacute;todo espec&iacute;fico; </em><em>hereda m&eacute;todos de su padre, <a href="htmlelement"> <code>HTMLElement</code> </a></em> .
ko: <em>구체적인 방법은 없습니다. </em><em>부모 <a href="htmlelement"> <code>HTMLElement</code> </a></em><em> 에서 메소드를 상속합니다</em> .
ru: <em>Нет конкретного метода; </em><em>наследует методы от своего родителя, <a href="htmlelement"> <code>HTMLElement</code> </a></em> .
zh_cn: <em>没有具体方法；</em><em>从其父<a href="htmlelement"> <code>HTMLElement</code> </a></em><em>继承方法</em>。

source: <em>No specific method; inherits attributes from its parent, <a href="htmlelement"><code>HTMLElement</code></a>.</em>
es: <em>No hay un m&eacute;todo espec&iacute;fico; hereda los atributos de su padre, <a href="htmlelement"> <code>HTMLElement</code> </a> .</em>
ko: <em>구체적인 방법은 없습니다. 부모 <a href="htmlelement"> <code>HTMLElement</code> </a> 로부터 속성을 상속합니다 .</em>
ru: <em>Нет конкретного метода; наследует атрибуты от своего родителя, <a href="htmlelement"> <code>HTMLElement</code> </a> .</em>
zh_cn: <em>没有具体方法；从其父<a href="htmlelement"> <code>HTMLElement</code> </a>继承属性。</em>

source: <em>No specific method; inherits methods <em>from its parent <a href="event"><code>Event</code></a>.</em></em>
es: <em>No hay un m&eacute;todo espec&iacute;fico; hereda m&eacute;todos <em>de su <a href="event"> <code>Event</code> </a> principal .</em></em>
ko: <em>구체적인 방법은 없습니다. <em>부모 </em><em><a href="event"> <code>Event</code> </a></em><em> 에서</em> 메소드 <em>를</em> 상속합니다 <em>.</em><em></em></em>
ru: <em>Нет конкретного метода; наследует методы <em>от родительского <a href="event"> <code>Event</code> </a> .</em></em>
zh_cn: <em>没有具体方法；<em>从其父</em><em><a href="event"> <code>Event</code> </a></em>继承方法<em>。</em><em></em></em>

source: <em>No specific method; inherits methods <em>from its parent <a href="uievent"><code>UIEvent</code></a>, and indirectly from <a href="event"><code>Event</code></a>.</em></em>
es: <em>No hay un m&eacute;todo espec&iacute;fico; hereda m&eacute;todos <em>de su <a href="uievent"> <code>UIEvent</code> </a> padre e indirectamente de <a href="event"> <code>Event</code> </a> .</em></em>
ko: <em>구체적인 방법은 없습니다. <em>부모 </em><em><a href="uievent"> <code>UIEvent</code> </a></em><em> 및 간접적으로 </em><em><a href="event"> <code>Event</code> </a></em><em> 에서</em> 메서드 <em>를</em> 상속합니다 <em>.</em><em></em></em>
ru: <em>Нет конкретного метода; наследует методы <em>от родительского <a href="uievent"> <code>UIEvent</code> </a> и косвенно от <a href="event"> <code>Event</code> </a> .</em></em>
zh_cn: <em>没有具体方法；<em>从其父</em><em><a href="uievent"> <code>UIEvent</code> </a></em>继承方法<em>，并从</em><em><a href="event"> <code>Event</code> </a></em><em>间接</em>继承<em>。</em><em></em></em>

source: <em>No specific method; inherits methods from its parent, </em><em><a href="audionode"><code>AudioNode</code></a></em>.
es: <em>No hay un m&eacute;todo espec&iacute;fico; hereda m&eacute;todos de su padre, </em><em><a href="audionode"> <code>AudioNode</code> </a></em> .
ko: <em>구체적인 방법은 없습니다. 부모 인 </em><em><a href="audionode"> <code>AudioNode</code> </a></em><em> 에서 메소드를 상속합니다</em> .
ru: <em>Нет конкретного метода; наследует методы от своего родителя, </em><em><a href="audionode"> <code>AudioNode</code> </a></em> .
zh_cn: <em>没有具体方法；从其父</em><em><a href="audionode"> <code>AudioNode</code> </a></em><em>继承方法</em>。

source: <em>No specific method; inherits methods from its parent, <a href="htmlelement"><code>HTMLElement</code></a> .</em>
es: <em>No hay un m&eacute;todo espec&iacute;fico; hereda m&eacute;todos de su padre, <a href="htmlelement"> <code>HTMLElement</code> </a> .</em>
ko: <em>구체적인 방법은 없습니다. 부모 <a href="htmlelement"> <code>HTMLElement</code> </a> 에서 메소드를 상속합니다 .</em>
ru: <em>Нет конкретного метода; наследует методы от своего родителя, <a href="htmlelement"> <code>HTMLElement</code> </a> .</em>
zh_cn: <em>没有具体方法；从其父<a href="htmlelement"> <code>HTMLElement</code> </a>继承方法。</em>

source: <em>No specific method; inherits methods from its parent, <a href="htmlelement"><code>HTMLElement</code></a> and from <a href="windoweventhandlers"><code>WindowEventHandlers</code></a></em><em>.</em>
es: <em>No hay un m&eacute;todo espec&iacute;fico; hereda m&eacute;todos de su padre, <a href="htmlelement"> <code>HTMLElement</code> </a> y de <a href="windoweventhandlers"> <code>WindowEventHandlers</code> </a></em><em> .</em>
ko: <em>구체적인 방법은 없습니다. 부모, <a href="htmlelement"> <code>HTMLElement</code> </a> 및 <a href="windoweventhandlers"> <code>WindowEventHandlers</code> </a></em><em> 에서 메소드를 상속합니다 </em><em>.</em>
ru: <em>Нет конкретного метода; наследует методы от своего родителя, <a href="htmlelement"> <code>HTMLElement</code> </a> и от <a href="windoweventhandlers"> <code>WindowEventHandlers</code> </a></em><em> .</em>
zh_cn: <em>没有具体方法；从其父<a href="htmlelement"> <code>HTMLElement</code> </a>和<a href="windoweventhandlers"> <code>WindowEventHandlers</code> </a></em><em>继承方法</em><em>。</em>

source: <em>No specific method; inherits methods from its parent, <a href="htmlelement"><code>HTMLElement</code></a>.</em>
es: <em>No hay un m&eacute;todo espec&iacute;fico; hereda m&eacute;todos de su padre, <a href="htmlelement"> <code>HTMLElement</code> </a> .</em>
ko: <em>구체적인 방법은 없습니다. 부모 <a href="htmlelement"> <code>HTMLElement</code> </a> 에서 메소드를 상속합니다 .</em>
ru: <em>Нет конкретного метода; наследует методы от своего родителя, <a href="htmlelement"> <code>HTMLElement</code> </a> .</em>
zh_cn: <em>没有具体方法；从其父<a href="htmlelement"> <code>HTMLElement</code> </a>继承方法。</em>

source: <em>No specific method; inherits methods from its parent, <a href="htmlelement"><code>HTMLElement</code></a></em>.
es: <em>No hay un m&eacute;todo espec&iacute;fico; hereda m&eacute;todos de su padre, <a href="htmlelement"> <code>HTMLElement</code> </a></em> .
ko: <em>구체적인 방법은 없습니다. 부모 <a href="htmlelement"> <code>HTMLElement</code> </a></em><em> 에서 메소드를 상속합니다 </em>.
ru: <em>Нет конкретного метода; наследует методы от своего родителя, <a href="htmlelement"> <code>HTMLElement</code> </a></em> .
zh_cn: <em>没有具体方法；从其父<a href="htmlelement"> <code>HTMLElement</code> </a></em><em>继承方法</em>。

source: <em>No specific method; inherits methods from its parent, <a href="htmlelement"><code>HTMLElement</code></a></em><em>, and <a href="linkstyle"><code>LinkStyle</code></a>.</em>
es: <em>No hay un m&eacute;todo espec&iacute;fico; hereda m&eacute;todos de su padre, <a href="htmlelement"> <code>HTMLElement</code> </a></em><em> y <a href="linkstyle"> <code>LinkStyle</code> </a> .</em>
ko: <em>구체적인 방법은 없습니다. 부모, <a href="htmlelement"> <code>HTMLElement</code> </a></em><em> 및 </em><em><a href="linkstyle"> <code>LinkStyle</code> </a></em><em> 에서 메서드를 상속합니다 </em><em>.</em><em></em>
ru: <em>Нет конкретного метода; наследует методы от своего родителя, <a href="htmlelement"> <code>HTMLElement</code> </a></em><em> и <a href="linkstyle"> <code>LinkStyle</code> </a> .</em>
zh_cn: <em>没有具体方法；从其父<a href="htmlelement"> <code>HTMLElement</code> </a></em><em><a href="linkstyle"> <code>LinkStyle</code> </a></em><em>HTMLElement</em><em>和</em><em>LinkStyle</em><em>继承方法</em><em>。</em><em></em>

source: <em>No specific method; inherits methods from its parent, <a href="htmlelement"><code>HTMLElement</code></a></em><em>.</em>
es: <em>No hay un m&eacute;todo espec&iacute;fico; hereda m&eacute;todos de su padre, <a href="htmlelement"> <code>HTMLElement</code> </a></em><em> .</em>
ko: <em>구체적인 방법은 없습니다. 부모 <a href="htmlelement"> <code>HTMLElement</code> </a></em><em> 에서 메소드를 상속합니다 </em><em>.</em>
ru: <em>Нет конкретного метода; наследует методы от своего родителя, <a href="htmlelement"> <code>HTMLElement</code> </a></em><em> .</em>
zh_cn: <em>没有具体方法；从其父<a href="htmlelement"> <code>HTMLElement</code> </a></em><em>继承方法</em><em>。</em>

source: <em>No specific method; inherits properties from its parent, <a href="htmlelement"><code>HTMLElement</code></a>.</em>
es: <em>No hay un m&eacute;todo espec&iacute;fico; hereda propiedades de su padre, <a href="htmlelement"> <code>HTMLElement</code> </a> .</em>
ko: <em>구체적인 방법은 없습니다. 부모 <a href="htmlelement"> <code>HTMLElement</code> </a> 에서 속성을 상속합니다 .</em>
ru: <em>Нет конкретного метода; наследует свойства от своего родителя, <a href="htmlelement"> <code>HTMLElement</code> </a> .</em>
zh_cn: <em>没有具体方法；从其父<a href="htmlelement"> <code>HTMLElement</code> </a>继承属性。</em>

source: <em>No specific method; inherits properties from its parent, <a href="htmlelement"><code>HTMLElement</code></a></em>.
es: <em>No hay un m&eacute;todo espec&iacute;fico; hereda propiedades de su padre, <a href="htmlelement"> <code>HTMLElement</code> </a></em> .
ko: <em>구체적인 방법은 없습니다. 부모 <a href="htmlelement"> <code>HTMLElement</code> </a></em><em> 에서 속성을 상속합니다 </em>.
ru: <em>Нет конкретного метода; наследует свойства от своего родителя, <a href="htmlelement"> <code>HTMLElement</code> </a></em> .
zh_cn: <em>没有具体方法；从其父<a href="htmlelement"> <code>HTMLElement</code> </a></em><em>继承属性</em>。

source: <em>No specific method; inherits properties from its parent, <a href="htmlelement"><code>HTMLElement</code></a></em><em>, and <a href="linkstyle"><code>LinkStyle</code></a></em><em>.</em>
es: <em>No hay un m&eacute;todo espec&iacute;fico; hereda propiedades de su padre, <a href="htmlelement"> <code>HTMLElement</code> </a></em><em> y <a href="linkstyle"> <code>LinkStyle</code> </a></em><em> .</em>
ko: <em>구체적인 방법은 없습니다. 부모, <a href="htmlelement"> <code>HTMLElement</code> </a></em><em> 및 <a href="linkstyle"> <code>LinkStyle</code> </a></em><em> 에서 속성을 상속합니다 </em><em>.</em>
ru: <em>Нет конкретного метода; наследует свойства от своего родителя, <a href="htmlelement"> <code>HTMLElement</code> </a></em><em> и <a href="linkstyle"> <code>LinkStyle</code> </a></em><em> .</em>
zh_cn: <em>没有具体方法；从其父<a href="htmlelement"> <code>HTMLElement</code> </a></em><em><a href="linkstyle"> <code>LinkStyle</code> </a></em><em>HTMLElement</em><em>和LinkStyle</em><em>继承属性</em><em>。</em>

source: <em>No specific methods, inherits methods from its parent, <a href="htmlelement"><code>HTMLElement</code></a>.</em>
es: <em>No hay m&eacute;todos espec&iacute;ficos, hereda m&eacute;todos de su elemento primario, <a href="htmlelement"> <code>HTMLElement</code> </a> .</em>
ko: <em>특정 메소드가 없으며 상위 <a href="htmlelement"> <code>HTMLElement</code> </a> 에서 메소드를 상속합니다 .</em>
ru: <em>Нет конкретных методов, наследует методы от своего родителя, <a href="htmlelement"> <code>HTMLElement</code> </a> .</em>
zh_cn: <em>没有特定的方法，而是从其父<a href="htmlelement"> <code>HTMLElement</code> </a>继承方法。</em>

source: <em>No specific methods; inherits methods from its ancestors <a href="orientationsensor"><code>OrientationSensor</code></a> and <a href="sensor"><code>Sensor</code></a>.</em>
es: <em>No hay m&eacute;todos espec&iacute;ficos; hereda m&eacute;todos de sus antepasados <a href="orientationsensor"> <code>OrientationSensor</code> </a> y <a href="sensor"> <code>Sensor</code> </a> .</em>
ko: <em>구체적인 방법은 없습니다. 조상 <a href="orientationsensor"> <code>OrientationSensor</code> </a> 및 <a href="sensor"> <code>Sensor</code> </a> 에서 메소드를 상속합니다 .</em>
ru: <em>Нет конкретных методов; наследует методы от своих предков <a href="orientationsensor"> <code>OrientationSensor</code> </a> и <a href="sensor"> <code>Sensor</code> </a> .</em>
zh_cn: <em>没有具体方法；从其祖先<a href="orientationsensor"> <code>OrientationSensor</code> </a>和<a href="sensor"> <code>Sensor</code> </a>继承方法。</em>

source: <em>No specific methods; inherits methods from its parent <a href="event"><code>Event</code></a></em>.
es: <em>No hay m&eacute;todos espec&iacute;ficos; hereda m&eacute;todos de su <a href="event"> <code>Event</code> </a></em><em> principal</em> .
ko: <em>구체적인 방법은 없습니다. 부모 <a href="event"> <code>Event</code> </a></em><em> 에서 메소드를 상속합니다</em> .
ru: <em>Нет конкретных методов; наследует методы от родительского <a href="event"> <code>Event</code> </a></em> .
zh_cn: <em>没有具体方法；从其父<a href="event"> <code>Event</code> </a></em><em>继承方法</em>。

source: <em>No specific methods; inherits methods from its parent, </em><em><a href="audionode"><code>AudioNode</code></a></em>.
es: <em>No hay m&eacute;todos espec&iacute;ficos; hereda m&eacute;todos de su padre, </em><em><a href="audionode"> <code>AudioNode</code> </a></em> .
ko: <em>구체적인 방법은 없습니다. 부모 인 </em><em><a href="audionode"> <code>AudioNode</code> </a></em><em> 에서 메소드를 상속합니다</em> .
ru: <em>Нет конкретных методов; наследует методы от своего родителя, </em><em><a href="audionode"> <code>AudioNode</code> </a></em> .
zh_cn: <em>没有具体方法；从其父</em><em><a href="audionode"> <code>AudioNode</code> </a></em><em>继承方法</em>。

source: <em>No specific methods; inherits methods from its parent, <a href="audionode"><code>AudioNode</code></a>.</em>
es: <em>No hay m&eacute;todos espec&iacute;ficos; hereda m&eacute;todos de su padre, <a href="audionode"> <code>AudioNode</code> </a> .</em>
ko: <em>구체적인 방법은 없습니다. 부모 인 <a href="audionode"> <code>AudioNode</code> </a> 에서 메소드를 상속합니다 .</em>
ru: <em>Нет конкретных методов; наследует методы от своего родителя, <a href="audionode"> <code>AudioNode</code> </a> .</em>
zh_cn: <em>没有具体方法；从其父<a href="audionode"> <code>AudioNode</code> </a>继承方法。</em>
