Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/dom/dom.*.007.xlf
Languages: es, ko, ru, zh_cn

source: <strong>Note:</strong> As we said,<strong> <a href="../formdata"><code>FormData</code></a> objects are not <a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/JSON/stringify">stringifiable</a> objects</strong>. If you want to stringify a submitted data, use <a href="#A_little_vanilla_framework">the previous <em>pure</em>-AJAX example</a>. Note also that, although in this example there are some <code>file</code><a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/input"><code>&lt;input&gt;</code></a> fields, <strong>when you submit a form through the <code>FormData</code> API you do not need to use the <a href="../filereader"><code>FileReader</code></a> API also</strong>: files are automatically loaded and uploaded.
ru: <strong>Примечание.</strong> Как мы уже говорили, <strong>объекты </strong><strong><a href="../formdata"> <code>FormData</code> </a></strong><strong> не являются </strong><strong><a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/JSON/stringify">строковыми</a></strong><strong> объектами</strong> . Если вы хотите упорядочить представленные данные, используйте <a href="#A_little_vanilla_framework">предыдущий </a>пример <em>чистого</em> -AJAX . Также обратите внимание, что, хотя в этом примере есть некоторые поля <a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/input"> <code>&lt;input&gt;</code> для</a> <code>file</code> , <strong>при </strong><strong> <code>FormData</code> </strong><strong> формы через </strong><strong>API-интерфейс </strong><strong>FormData</strong><strong> вам не нужно также использовать </strong><strong>API-интерфейс </strong><strong><a href="../filereader"> <code>FileReader</code> </a></strong> : файлы автоматически загружаются и выгружаются.<strong> </strong><em></em><strong></strong>
zh_cn: <strong>注意：</strong>如前所述，<strong><a href="../formdata"> <code>FormData</code> </a></strong><strong>对象不是可</strong><strong><a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/JSON/stringify">字符串化的</a></strong><strong>对象</strong>。如果要对提交的数据进行字符串化，请使用<a href="#A_little_vanilla_framework">前面的</a><em>纯</em> -AJAX示例。还要注意，尽管在此示例中有一些 <code>file</code> <a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/input"> <code>&lt;input&gt;</code> </a>字段，但是<strong>当您通过</strong><strong> <code>FormData</code> </strong><strong> API </strong><strong>提交表单时，您</strong><strong>也不需要使用</strong><strong><a href="../filereader"> <code>FileReader</code> </a></strong><strong> API</strong>：文件会自动加载和上传。<strong> </strong><em></em><strong></strong>

source: <strong>Note:</strong> As you can see from the code above, <code>document.cookie</code> is an <a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Object/defineProperty#Description">accessor property</a> with native <em>setter</em> and <em>getter</em> functions, and consequently is <strong>not</strong> a <a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Object/defineProperty#Description">data property</a> with a value: what you write is not the same as what you read, everything is always mediated by the JavaScript interpreter.
ru: <strong>Примечание.</strong> Как видно из приведенного выше кода, <code>document.cookie</code> - это <a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Object/defineProperty#Description">свойство accessor</a> с собственными функциями <em>set</em> и <em>get</em> , и, следовательно, <strong>не</strong> является <a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Object/defineProperty#Description">свойством data</a> со значением: то, что вы пишете, не совпадает с тем, что вы читаете, все всегда опосредуется интерпретатором JavaScript.
zh_cn: <strong>注意：</strong>从上面的代码中可以看到， <code>document.cookie</code> 是具有本地<em>setter</em>和<em>getter</em>函数的<a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Object/defineProperty#Description">访问器属性</a>，因此<strong>不是</strong>具有值的<a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Object/defineProperty#Description">数据属性</a>：您编写的内容与所读取的内容不同，所有内容都是始终由JavaScript解释器介导。<em></em><em></em><strong></strong>

source: <strong>Note:</strong> At this time, <code>RTCAnswerOptions</code> does not have any additional properties defined beyond those included in <a href="rtcofferansweroptions"><code>RTCOfferAnswerOptions</code></a>. However, this is likely to change in the future, so the type has been defined in preparation for that eventuality.
ru: <strong>Примечание.</strong> В настоящее время <code>RTCAnswerOptions</code> не имеет дополнительных свойств, определенных помимо свойств, включенных в <a href="rtcofferansweroptions"> <code>RTCOfferAnswerOptions</code> </a> . Тем не менее, это может измениться в будущем, поэтому тип был определен при подготовке к такой возможности.
zh_cn: <strong>注意：</strong>此时， <code>RTCAnswerOptions</code> 没有超出包含在定义的任何附加属性<a href="rtcofferansweroptions"> <code>RTCOfferAnswerOptions</code> </a>。但是，这种情况将来可能会改变，因此已为可能发生的情况定义了类型。

source: <strong>Note:</strong> At this time, while Firefox does implement <code>read()</code>, it does not recognize the <code>"clipboard-read"</code> permission, so attempting to use the <a href="https://developer.mozilla.org/en-US/docs/Web/API/Permissions_API">Permissions API</a> to manage access to the API will not work.
ru: <strong>Примечание.</strong> В настоящее время, хотя Firefox и реализует <code>read()</code> , он не распознает разрешение <code>"clipboard-read"</code> , поэтому попытка использовать <a href="https://developer.mozilla.org/en-US/docs/Web/API/Permissions_API">API разрешений</a> для управления доступом к API не будет работать.
zh_cn: <strong>注意：</strong>目前，虽然Firefox确实实现了 <code>read()</code> ，但它无法识别 <code>"clipboard-read"</code> 权限，因此尝试使用<a href="https://developer.mozilla.org/en-US/docs/Web/API/Permissions_API">Permissions API</a>来管理对该API的访问将不起作用。

source: <strong>Note:</strong> Attempting to add a candidate (using <a href="../rtcpeerconnection/addicecandidate"><code>addIceCandidate()</code></a>) that has a value of <code>null</code> for either <code>sdpMid</code> or <code>sdpMLineIndex</code> will throw a <code>TypeError</code> exception.
ru: <strong>Примечание:</strong> При попытке добавить кандидата ( с использованием <a href="../rtcpeerconnection/addicecandidate"> <code>addIceCandidate()</code> </a> ) , что имеет значение <code>null</code> или для <code>sdpMid</code> или <code>sdpMLineIndex</code> выбросит <code>TypeError</code> исключение.
zh_cn: <strong>注意：</strong>尝试添加（使用<a href="../rtcpeerconnection/addicecandidate"> <code>addIceCandidate()</code> </a>）的 <code>sdpMid</code> 或 <code>sdpMLineIndex</code> 值为 <code>null</code> 的候选者将引发 <code>TypeError</code> 异常。

source: <strong>Note:</strong> Based on the current implementation, browsers won't actually read the bytestream of a file to determine its media type. It is assumed based on the file extension; a PNG image file renamed to .txt would give "<em>text/plain</em>" and not "<em>image/png</em>". Moreover, <code>file.type</code> is generally reliable only for common file types like images, HTML documents, audio and video. Uncommon file extensions would return an empty string. Client configuration (for instance, the Windows Registry) may result in unexpected values even for common types. <strong>Developers are advised not to rely on this property as a sole validation scheme.</strong>
ru: <strong>Примечание.</strong> Исходя из текущей реализации, браузеры фактически не будут считывать поток файла, чтобы определить его тип носителя. Предполагается на основе расширения файла; файл изображения PNG, переименованный в .txt, выдает &laquo; <em>text / plain</em> &raquo;, а не &laquo; <em>image / png</em> &raquo;. Кроме того, <code>file.type</code> обычно надежен только для распространенных типов файлов, таких как изображения, документы HTML, аудио и видео. Необычные расширения файлов вернут пустую строку. Конфигурация клиента (например, реестр Windows) может привести к неожиданным значениям даже для распространенных типов. <strong>Разработчикам рекомендуется не полагаться на это свойство в качестве единственной схемы проверки.</strong>
zh_cn: <strong>注意：</strong>根据当前的实现，浏览器实际上不会读取文件的字节流来确定其媒体类型。假定基于文件扩展名；一个重命名为.txt的PNG图片文件将显示&ldquo; <em>text / plain</em> &rdquo;而不是&ldquo; <em>image / png</em> &rdquo;。此外， <code>file.type</code> 通常仅对常见文件类型（例如图像，HTML文档，音频和视频）可靠。不常见的文件扩展名将返回一个空字符串。客户端配置（例如，Windows注册表）可能会导致意外值，即使对于常见类型也是如此。<strong>建议开发人员不要将此属性作为唯一的验证方案。</strong>

source: <strong>Note:</strong> Be aware that <code>clearRect()</code> may cause unintended side effects if you're not <a href="../canvas_api/tutorial/drawing_shapes#Drawing_paths">using paths properly</a>. Make sure to call <a href="beginpath"><code>beginPath()</code></a> before starting to draw new items after calling <code>clearRect()</code>.
ru: <strong>Примечание.</strong> Помните, что <code>clearRect()</code> может вызывать непреднамеренные побочные эффекты, если вы не <a href="../canvas_api/tutorial/drawing_shapes#Drawing_paths">используете пути правильно</a> . Обязательно вызовите <a href="beginpath"> <code>beginPath()</code> </a> перед началом рисования новых элементов после вызова <code>clearRect()</code> .
zh_cn: <strong>注意：</strong>请注意，如果未<a href="../canvas_api/tutorial/drawing_shapes#Drawing_paths">正确使用path</a>， <code>clearRect()</code> 可能会导致意外的副作用。确保在调用<a href="beginpath"> <code>beginPath()</code> </a>之后开始绘制新项目之前先调用 <code>clearRect()</code> 。

source: <strong>Note:</strong> Be aware that if the canvas contains any pixels that were obtained from another <a href="https://developer.mozilla.org/en-US/docs/Glossary/origin">origin</a> without using CORS, the canvas is <strong>tainted</strong> and its contents can no longer be read and saved. See <a href="https://developer.mozilla.org/en-US/docs/Web/HTML/CORS_enabled_image#Security_and_tainted_canvases">Security and tainted canvases</a> in <a href="https://developer.mozilla.org/en-US/docs/Web/HTML/CORS_enabled_image">Allowing cross-origin use of images and canvas</a>
ru: <strong>Примечание.</strong> Имейте в виду, что если холст содержит пиксели, полученные из другого <a href="https://developer.mozilla.org/en-US/docs/Glossary/origin">источника</a> без использования CORS, холст будет <strong>испорчен,</strong> и его содержимое больше не будет считываться и сохраняться. См. <a href="https://developer.mozilla.org/en-US/docs/Web/HTML/CORS_enabled_image#Security_and_tainted_canvases">Безопасность и испорченные холсты</a> в разделе <a href="https://developer.mozilla.org/en-US/docs/Web/HTML/CORS_enabled_image">Использование изображений и </a>холстов из разных источников.
zh_cn: <strong>注意：</strong>请注意，如果画布包含不使用CORS 而从其他<a href="https://developer.mozilla.org/en-US/docs/Glossary/origin">来源</a>获得的任何像素，则该画布将被<strong>污染，</strong>并且其内容将无法再读取和保存。见<a href="https://developer.mozilla.org/en-US/docs/Web/HTML/CORS_enabled_image#Security_and_tainted_canvases">保安和被污染的画布</a>中<a href="https://developer.mozilla.org/en-US/docs/Web/HTML/CORS_enabled_image">允许跨域使用图像和帆布</a>

source: <strong>Note:</strong> Be aware that in our vertical line example, the Y position still referenced an integer gridline position&mdash;if it hadn't, we would see pixels with half coverage at the endpoints (but note also that this behavior depends on the current <code>lineCap</code> style whose default value is <code>butt</code>; you may want to compute consistent strokes with half-pixel coordinates for odd-width lines, by setting the <code>lineCap</code> style to <code>square</code>, so that the outer border of the stroke around the endpoint will be automatically extended to cover the whole pixel exactly).
ru: <strong>Примечание.</strong> Имейте в виду, что в нашем примере с вертикальной линией позиция Y по-прежнему ссылается на целочисленную позицию сетки - если бы этого не было, мы бы увидели пиксели с половиной покрытия на конечных точках (но также обратите внимание, что это поведение зависит от текущего стиля <code>lineCap</code> значение которого по умолчанию <code>butt</code> , вы можете вычислить последовательные удары с координатами половины пикселя для нечетных ширины линий, устанавливая <code>lineCap</code> стиль в <code>square</code> , так что внешняя граница хода вокруг конечной точки будет автоматически продлеваться на покрытие целый пиксель точно).
zh_cn: <strong>注意：</strong>请注意，在我们的垂直线示例中，Y位置仍然引用了整数网格线位置-如果没有，则在端点处我们会看到像素覆盖了一半（但还要注意，此行为取决于当前的 <code>lineCap</code> 样式）的默认值是 <code>butt</code> ；通过将 <code>lineCap</code> 样式设置为 <code>square</code> ，您可能想通过半像素坐标为奇数宽度的线计算一致的笔触，以便围绕端点的笔触的外边界将自动扩展为覆盖整个像素）。

source: <strong>Note:</strong> Be aware that the <code>slice()</code> method has vendor prefixes on some browsers and versions: <code>blob.mozSlice()</code> for Firefox 12 and earlier and <code>blob.webkitSlice()</code> in Safari. An old version of the <code>slice()</code> method, without vendor prefixes, had different semantics, and is obsolete.
ru: <strong>Примечание.</strong> Помните, что метод <code>slice()</code> имеет префиксы поставщиков в некоторых браузерах и версиях: <code>blob.mozSlice()</code> для Firefox 12 и более ранних <code>blob.webkitSlice()</code> и blob.webkitSlice () в Safari. Старая версия метода <code>slice()</code> без префиксов поставщика имела другую семантику и является устаревшей.
zh_cn: <strong>注：</strong>请注意， <code>slice()</code> 方法对某些浏览器和版本供应商前缀： <code>blob.mozSlice()</code> 用于Firefox 12和更早版本和 <code>blob.webkitSlice()</code> 在Safari。没有供应商前缀的 <code>slice()</code> 方法的旧版本具有不同的语义，并且已过时。

source: <strong>Note:</strong> Be aware that the <code>slice()</code> method has vendor prefixes on some browsers and versions: <code>blob.mozSlice()</code> for Firefox 12 and earlier and <code>blob.webkitSlice()</code> in Safari. An old version of the <code>slice()</code> method, without vendor prefixes, had different semantics, and is obsolete. The support for <code>blob.mozSlice()</code> has been dropped with Firefox 30.
ru: <strong>Примечание.</strong> Помните, что метод <code>slice()</code> имеет префиксы поставщиков в некоторых браузерах и версиях: <code>blob.mozSlice()</code> для Firefox 12 и более ранних <code>blob.webkitSlice()</code> и blob.webkitSlice () в Safari. Старая версия метода <code>slice()</code> без префиксов поставщика имела другую семантику и является устаревшей. Поддержка <code>blob.mozSlice()</code> была прекращена в Firefox 30.
zh_cn: <strong>注：</strong>请注意， <code>slice()</code> 方法对某些浏览器和版本供应商前缀： <code>blob.mozSlice()</code> 用于Firefox 12和更早版本和 <code>blob.webkitSlice()</code> 在Safari。没有供应商前缀的 <code>slice()</code> 方法的旧版本具有不同的语义，并且已过时。Firefox 30已 <code>blob.mozSlice()</code> 支持blob.mozSlice（）。

source: <strong>Note:</strong> Be aware that you may get unexpected results when using a relatively large radius: the arc's connecting line will go in whatever direction it must to meet the specified radius.
ru: <strong>Примечание.</strong> Имейте в виду, что при использовании относительно большого радиуса вы можете получить неожиданные результаты: соединительная линия дуги будет идти в любом направлении, в котором она должна соответствовать указанному радиусу.
zh_cn: <strong>注意：</strong>请注意，使用相对较大的半径时，您可能会得到意想不到的结果：圆弧的连接线将沿必须达到指定半径的任何方向移动。

source: <strong>Note:</strong> Because the contents of an <code>HTMLCollection</code> are live, changes to the underlying DOM can and will cause the position of individual nodes in the collection to change, so the index value will not necessarily remain constant for a given node.
ru: <strong>Примечание.</strong> Поскольку содержимое <code>HTMLCollection</code> является действующим, изменения в базовом DOM могут и будут приводить к изменению положения отдельных узлов в коллекции, поэтому значение индекса не обязательно будет оставаться постоянным для данного узла.
zh_cn: <strong>注意：</strong>因为 <code>HTMLCollection</code> 的内容是活动的，所以对基础DOM的更改可能并且将导致集合中各个节点的位置发生更改，因此索引值对于给定的节点不一定保持恒定。

source: <strong>Note:</strong> Because the result returned by<code>compareDocumentPosition</code> is a bitmask, the <a href="https://developer.mozilla.org/en-US/docs/JavaScript/Reference/Operators/Bitwise_Operators">bitwise and operator</a> has to be used for meaningful results.
ru: <strong>Примечание.</strong> Поскольку результат, возвращаемый методом <code>compareDocumentPosition</code> является битовой маской, для получения значимых результатов необходимо использовать <a href="https://developer.mozilla.org/en-US/docs/JavaScript/Reference/Operators/Bitwise_Operators">побитовый оператор и оператор</a> .
zh_cn: <strong>注意：</strong>由于 <code>compareDocumentPosition</code> 返回的结果是位掩码，因此必须使用<a href="https://developer.mozilla.org/en-US/docs/JavaScript/Reference/Operators/Bitwise_Operators">按位和运算符</a>来获得有意义的结果。

source: <strong>Note:</strong> Before version 37, Chrome doesn't let you call <a href="../notification/requestpermission"><code>Notification.requestPermission()</code></a> in the <code>load</code> event handler (see <a href="https://code.google.com/p/chromium/issues/detail?id=274284">issue 274284</a>).
ru: <strong>Примечание.</strong> До версии 37 Chrome не разрешал вызывать <a href="../notification/requestpermission"> <code>Notification.requestPermission()</code> </a> в обработчике событий <code>load</code> (см. <a href="https://code.google.com/p/chromium/issues/detail?id=274284">Проблему 274284</a> ).
zh_cn: <strong>注意：</strong>在版本37之前，Chrome浏览器不允许您在 <code>load</code> 事件处理程序中调用<a href="../notification/requestpermission"> <code>Notification.requestPermission()</code> </a>（请参阅<a href="https://code.google.com/p/chromium/issues/detail?id=274284">问题274284</a>）。

source: <strong>Note:</strong> Browser support for the asynchronous clipboard APIs is still in the process of being implemented. Be sure to check the <a href="#Browser_compatibility">compatibility table</a> as well as <a href="../clipboard#Clipboard_availability">Clipboard availability</a> in <a href="../clipboard">Clipboard</a> for more information.
ru: <strong>Примечание.</strong> Поддержка браузером API асинхронного буфера обмена все еще находится в процессе реализации. Не забудьте проверить <a href="#Browser_compatibility">таблицу совместимости,</a> а также <a href="../clipboard#Clipboard_availability">наличие </a><a href="../clipboard">буфера </a>обмена в буфере обмена для получения дополнительной информации.
zh_cn: <strong>注意：</strong>浏览器对异步剪贴板API的支持仍在实施中。一定要检查<a href="#Browser_compatibility">兼容性表</a>，以及<a href="../clipboard#Clipboard_availability">剪贴板的可用性</a>在<a href="../clipboard">剪贴板中</a>获取更多信息。

source: <strong>Note:</strong> By default, <a href="geolocation/getcurrentposition"><code>getCurrentPosition()</code></a> tries to answer as fast as possible with a low accuracy result. It is useful if you need a quick answer regardless of the accuracy. Devices with a GPS, for example, can take a minute or more to get a GPS fix, so less accurate data (IP location or wifi) may be returned to <a href="geolocation/getcurrentposition"><code>getCurrentPosition()</code></a>.
ru: <strong>Примечание.</strong> По умолчанию <a href="geolocation/getcurrentposition"> <code>getCurrentPosition()</code> </a> пытается ответить максимально быстро с низким уровнем точности результата. Это полезно, если вам нужен быстрый ответ независимо от точности. Например, для устройств с GPS может потребоваться минута или больше, чтобы получить исправление GPS, поэтому менее точные данные (IP-адрес или wifi) могут быть возвращены <a href="geolocation/getcurrentposition"> <code>getCurrentPosition()</code> </a> .
zh_cn: <strong>注意：</strong>默认情况下，<a href="geolocation/getcurrentposition"> <code>getCurrentPosition()</code> </a>尝试以较低的准确性结果尽可能快地回答。如果您需要快速解答而不考虑准确性，这将很有用。例如，具有GPS的设备可能需要一分钟或更长时间才能获得GPS定位，因此精度较低的数据（IP位置或wifi）可能会返回给<a href="geolocation/getcurrentposition"> <code>getCurrentPosition()</code> </a>。

source: <strong>Note:</strong> CORS support for Canvas 2D <code>drawImage</code> is implemented in Gecko 9.0. This means that using a cross-domain image with CORS approval does no longer taint the 2D canvas, so the 2D canvas remains usable as the source of a WebGL texture.
ru: <strong>Примечание:</strong> поддержка CORS для Canvas 2D <code>drawImage</code> реализована в Gecko 9.0. Это означает, что использование междоменного изображения с утверждением CORS больше не портит 2D-холст, поэтому 2D-холст остается пригодным для использования в качестве источника текстуры WebGL.
zh_cn: <strong>注意：</strong>在Gecko 9.0中实现了对Canvas 2D <code>drawImage</code> 的 CORS支持。这意味着使用具有CORS批准的跨域图像不会再污染2D画布，因此2D画布仍可用作WebGL纹理的来源。

source: <strong>Note:</strong> CORS support for WebGL textures and the <code>crossOrigin</code> attribute for image elements is implemented in Gecko 8.0.
ru: <strong>Примечание:</strong> поддержка CORS для текстур WebGL и атрибута <code>crossOrigin</code> для элементов изображения реализована в Gecko 8.0.
zh_cn: <strong>注意：</strong>在Gecko 8.0中实现了对WebGL纹理和图像元素的 <code>crossOrigin</code> 属性的CORS支持。

source: <strong>Note:</strong> CORS support for cross-domain videos and the <code>crossorigin</code> attribute for <a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/video"><code>&lt;video&gt;</code></a> elements is implemented in Gecko 12.0.
ru: <strong>Примечание. В</strong> Gecko 12.0 реализована поддержка CORS для междоменных видео и атрибута <code>crossorigin</code> для элементов <a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/video"> <code>&lt;video&gt;</code> </a> .
zh_cn: <strong>注意：</strong>在Gecko 12.0中实现了对跨域视频的CORS支持和<a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/video"> <code>&lt;video&gt;</code> </a>元素的 <code>crossorigin</code> 属性。

source: <strong>Note:</strong> Calling this method for an already active request (one for which <code>open()</code> has already been called) is the equivalent of calling <a href="abort"><code>abort()</code></a>.
ru: <strong>Примечание.</strong> Вызов этого метода для уже активного запроса (тот, для которого <code>open()</code> уже был вызван) является эквивалентом вызова <a href="abort"> <code>abort()</code> </a> .
zh_cn: <strong>注意：</strong>为一个已经处于活动状态的请求（已针对其调用 <code>open()</code> )调用此方法等效于调用<a href="abort"> <code>abort()</code> </a>。

source: <strong>Note:</strong> Characters that are not part of standard CSS syntax must be escaped using a backslash character. Since JavaScript also uses backslash escaping, be especially careful when writing string literals using these characters. See <a href="#Escaping_special_characters">Escaping special characters</a> for more information.
ru: <strong>Примечание.</strong> Символы, которые не являются частью стандартного синтаксиса CSS, должны быть экранированы с помощью символа обратной косой черты. Поскольку JavaScript также использует экранирование от обратной косой черты, будьте особенно осторожны при написании строковых литералов с использованием этих символов. Посмотрите <a href="#Escaping_special_characters">Escapeing специальные символы</a> для получения дополнительной информации.
zh_cn: <strong>注意：</strong>不属于标准CSS语法的字符必须使用反斜杠字符进行转义。由于JavaScript也使用反斜杠转义，因此在使用这些字符编写字符串文字时要特别小心。有关更多信息，请参见<a href="#Escaping_special_characters">转义特殊字符</a>。
