Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/dom/dom.*.007.xlf
Languages: es, ko, ru, zh_cn

source: <em><code>boolean:</code></em><strong>Returns / Sets</strong> the default state of a radio button or checkbox as originally specified in HTML that created this object.
es: <em> <code>boolean:</code> </em><strong> Devuelve / Establece</strong> el estado predeterminado de un bot&oacute;n de opci&oacute;n o casilla de verificaci&oacute;n como se especific&oacute; originalmente en HTML que cre&oacute; este objeto.
ko: <em> <code>boolean:</code> </em> 이 객체를 만든 HTML에 원래 지정된 라디오 버튼 또는 확인란의 기본 상태를<strong> 반환</strong> 합니다.
ru: <em> <code>boolean:</code> </em><strong> Возвращает / Устанавливает состояние</strong> по умолчанию для переключателя или флажка, как изначально указано в HTML, который создал этот объект.
zh_cn: <em> <code>boolean:</code> </em><strong>返回/设置</strong>单选按钮或复选框的默认状态，如创建该对象的HTML中最初指定的那样。

source: <em><code>boolean</code>:</em><strong> Returns / Sets</strong> the element's <code><a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/input#attr-readonly">readonly</a></code> attribute, indicating that the user cannot modify the value of the control.
es: <em> <code>boolean</code> o : </em><strong>Devuelve / establece</strong> elatributo de <code><a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/input#attr-readonly">readonly</a></code> del elemento, lo que indica que el usuario no puede modificar el valor del control.
ko: <em> <code>boolean</code> : </em><strong>반환 값 /</strong> 요소의 <code><a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/input#attr-readonly">readonly</a></code> 속성을<strong> 설정</strong> 하여사용자가 컨트롤 값을 수정할 수 없음을 나타냅니다.
ru: <em> <code>boolean</code> : </em><strong>Возвращает / Устанавливает</strong> атрибутэлемента только для <code><a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/input#attr-readonly">readonly</a></code> , указывая, что пользователь не может изменить значение элемента управления.
zh_cn: <em> <code>boolean</code> ：</em><strong>返回/设置</strong>元素的 <code><a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/input#attr-readonly">readonly</a></code> 属性，指示用户无法修改控件的值。

source: <em><code>boolean</code>:</em><strong>Returns / Sets</strong> the element's <code><a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/input#attr-disabled">disabled</a></code> attribute, indicating that the control is not available for interaction. The input values will not be submitted with the form. See also <code><a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/input#attr-readonly">readonly</a></code>
es: <em> <code>boolean</code> o : </em><strong>Devuelve / Establece</strong> elatributo <code><a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/input#attr-disabled">disabled</a></code> del elemento, lo que indica que el control no est&aacute; disponible para la interacci&oacute;n. Los valores de entrada no se enviar&aacute;n con el formulario. Ver tambi&eacute;n <code><a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/input#attr-readonly">readonly</a></code>
ko: <em> <code>boolean</code> :</em> 컨트롤의 상호 작용에 사용할 수 없음을 나타내는요소의 <code><a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/input#attr-disabled">disabled</a></code> 속성을<strong> 반환 / 설정</strong> 합니다. 입력 값은 양식과 함께 제출되지 않습니다. <code><a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/input#attr-readonly">readonly</a></code> 참조
ru: <em> <code>boolean</code> : </em><strong>Возвращает / Устанавливает</strong> атрибут <code><a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/input#attr-disabled">disabled</a></code> элемента, указывая, что элемент управления недоступен для взаимодействия. Входные значения не будут отправлены с формой. Смотрите также только для <code><a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/input#attr-readonly">readonly</a></code>
zh_cn: <em> <code>boolean</code> ：</em><strong>返回/设置</strong>元素的 <code><a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/input#attr-disabled">disabled</a></code> 属性，指示该控件不可用于交互。输入值将不会与表单一起提交。又见 <code><a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/input#attr-readonly">readonly</a></code>

source: <em><code>boolean</code>:</em><strong>Returns / Sets</strong> the element's <code><a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/input#attr-formnovalidate">formnovalidate</a></code> attribute, indicating that the form is not to be validated when it is submitted. This overrides the <code><a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/form#attr-novalidate">novalidate</a></code> attribute of the parent form.
es: <em> <code>boolean</code> o : </em><strong>Devuelve / Establece</strong> elatributo <code><a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/input#attr-formnovalidate">formnovalidate</a></code> del elemento, lo que indica que el formulario no se validar&aacute; cuando se env&iacute;e. Esto anula elatributo <code><a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/form#attr-novalidate">novalidate</a></code> del formulario principal.
ko: <em> <code>boolean</code> :</em> 요소의 <code><a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/input#attr-formnovalidate">formnovalidate</a></code> 속성을<strong> 반환 / 설정</strong> 하여양식을 제출할 때 유효성을 검사하지 않음을 나타냅니다. 이는상위 양식의 <code><a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/form#attr-novalidate">novalidate</a></code> 속성을대체합니다.
ru: <em> <code>boolean</code> : </em><strong>Возвращает / Устанавливает</strong> атрибут <code><a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/input#attr-formnovalidate">formnovalidate</a></code> элемента, указывая, что форма не должна проверяться при отправке . Это переопределяетатрибут <code><a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/form#attr-novalidate">novalidate</a></code> родительской формы.
zh_cn: <em> <code>boolean</code> ：</em><strong>返回/设置</strong>元素的 <code><a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/input#attr-formnovalidate">formnovalidate</a></code> 属性，指示在提交表单时不对其进行验证。这将覆盖父表单的 <code><a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/form#attr-novalidate">novalidate</a></code> 属性。

source: <em><code>boolean</code>:</em><strong>Returns / Sets</strong> the element's <code><a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/input#attr-multiple">multiple</a></code> attribute, indicating whether more than one value is possible (e.g., multiple files).
es: <em> <code>boolean</code> o : </em><strong>Devuelve / Establece</strong> elatributo <code><a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/input#attr-multiple">multiple</a></code> del elemento, lo que indica si es posible m&aacute;s de un valor (por ejemplo, varios archivos).
ko: <em> <code>boolean</code> :</em> 둘 이상의 값이 가능한지 여부를 나타내는요소의 <code><a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/input#attr-multiple">multiple</a></code> 속성을<strong> 반환 / 설정</strong> 합니다 (예 : 여러 파일).
ru: <em> <code>boolean</code> : </em><strong>Возвращает / Устанавливает </strong> <code><a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/input#attr-multiple">multiple</a></code> атрибутэлемента, указывая, возможно ли более одного значения (например, несколько файлов).
zh_cn: <em> <code>boolean</code> ：</em><strong>返回/设置</strong>元素的 <code><a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/input#attr-multiple">multiple</a></code> 属性，指示是否可以使用多个值（例如，多个文件）。

source: <em><code>boolean</code>:</em><strong>Returns / Sets</strong> the element's <code><a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/input#attr-required">required</a></code> attribute, indicating that the user must fill in a value before submitting a form.
es: <em> <code>boolean</code> o : </em><strong>Devuelve / establece</strong> elatributo <code><a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/input#attr-required">required</a></code> del elemento, lo que indica que el usuario debe completar un valor antes de enviar un formulario.
ko: <em> <code>boolean</code> : </em><strong>반환 /</strong> 요소의 <code><a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/input#attr-required">required</a></code> 속성을<strong> 설정</strong> 하여사용자가 양식을 제출하기 전에 값을 채워야 함을 나타냅니다.
ru: <em> <code>boolean</code> : </em><strong>Возвращает / Устанавливает </strong> <code><a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/input#attr-required">required</a></code> атрибутэлемента, указывающий, что пользователь должен заполнить значение перед отправкой формы.
zh_cn: <em> <code>boolean</code> ：</em><strong>返回/设置</strong>元素的 <code><a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/input#attr-required">required</a></code> 属性，指示用户在提交表单之前必须填写一个值。

source: <em><code>buffer</code></em> is an <a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/ArrayBuffer"><code>ArrayBuffer</code></a> or an <a href="../arraybufferview"><code>ArrayBufferView</code></a> containing the data to be hashed using the hashing algorithm.
es: <em> <code>buffer</code> </em> es un<a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/ArrayBuffer"> <code>ArrayBuffer</code> </a> o un<a href="../arraybufferview"> <code>ArrayBufferView</code> que</a> contiene los datos que se van a hash utilizando el algoritmo de hash.
ko: <em> <code>buffer</code> </em> 는해시 알고리즘을 사용하여 해시 할 데이터를 포함하는<a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/ArrayBuffer"> <code>ArrayBuffer</code> </a> 또는<a href="../arraybufferview"> <code>ArrayBufferView</code> </a> 입니다.
ru: <em> <code>buffer</code> </em> представляет собой<a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/ArrayBuffer"> <code>ArrayBuffer</code> </a> или<a href="../arraybufferview"> <code>ArrayBufferView</code> ,</a> содержащий данные, которые должны быть хэшированы с использованием алгоритма хэширования.
zh_cn: <em> <code>buffer</code> </em>是一个<a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/ArrayBuffer"> <code>ArrayBuffer</code> </a>或<a href="../arraybufferview"> <code>ArrayBufferView</code> ,</a>其中包含要使用哈希算法哈希的数据。

source: <em><code>data</code></em> is a <a href="../buffersource"><code>BufferSource</code></a> containing the data to be decrypted, the <a href="https://developer.mozilla.org/en-US/docs/Glossary/ciphertext">ciphertext</a>.
es: <em> <code>data</code> </em> es un<a href="../buffersource"> <code>BufferSource</code> que</a> contiene los datos a descifrar, el<a href="https://developer.mozilla.org/en-US/docs/Glossary/ciphertext"> texto cifrado</a> .
ko: <em> <code>data</code> </em> A는<a href="../buffersource"> <code>BufferSource</code> </a> 복호화 될 데이터를 포함하는 상기<a href="https://developer.mozilla.org/en-US/docs/Glossary/ciphertext"> 암호문</a> .
ru: <em> <code>data</code> </em> - это<a href="../buffersource"> <code>BufferSource</code> ,</a> содержащий данные для расшифровки,<a href="https://developer.mozilla.org/en-US/docs/Glossary/ciphertext"> зашифрованный текст</a> .
zh_cn: <em> <code>data</code> </em>是一个<a href="../buffersource"> <code>BufferSource</code> ,</a>其中包含要解密的数据（<a href="https://developer.mozilla.org/en-US/docs/Glossary/ciphertext">密文）</a>。

source: <em><code>data</code></em> is a <a href="../buffersource"><code>BufferSource</code></a> containing the data to be encrypted, the <a href="https://developer.mozilla.org/en-US/docs/Glossary/plaintext">plaintext</a>.
es: <em> <code>data</code> </em> es un<a href="../buffersource"> <code>BufferSource</code> que</a> contiene los datos a cifrar, el<a href="https://developer.mozilla.org/en-US/docs/Glossary/plaintext"> texto sin formato</a> .
ko: <em> <code>data</code> </em> 는암호화 할 데이터 인<a href="https://developer.mozilla.org/en-US/docs/Glossary/plaintext"> 평문</a> 을 포함하는<a href="../buffersource"> <code>BufferSource</code> </a> 입니다.
ru: <em> <code>data</code> </em> - это<a href="../buffersource"> <code>BufferSource</code> ,</a> содержащий данные для шифрования,<a href="https://developer.mozilla.org/en-US/docs/Glossary/plaintext"> открытый текст</a> .
zh_cn: <em> <code>data</code> </em>是一个<a href="../buffersource"> <code>BufferSource</code> ,</a>其中包含要加密的数据，即<a href="https://developer.mozilla.org/en-US/docs/Glossary/plaintext">纯文本</a>。

source: <em><code>event.loaded</code></em> the amount of data currently transfered.
es: <em> <code>event.loaded</code> </em> la cantidad de datos actualmente transferidos.
ko: <em> <code>event.loaded</code> </em> 현재 전송 된 데이터의 양입니다.
ru: <em> <code>event.loaded</code> </em> объем данных, в настоящее время переданных.
zh_cn: <em> <code>event.loaded</code> </em>当前传输的数据量。

source: <em><code>event.total</code></em> the total amount of data to be transferred.
es: <em> <code>event.total</code> </em> la cantidad total de datos a transferir.
ko: <em> <code>event.total</code> </em> 전송 될 총 데이터 양입니다.
ru: <em> <code>event.total</code> </em> общий объем данных для передачи.
zh_cn: <em> <code>event.total</code> </em>要传输的数据总量。

source: <em><code>format</code></em> is an enumerated value describing the data format in which the key has to be exported. It can be one of the following:
es: <em> <code>format</code> o</em> es un valor enumerado que describe el formato de datos en el que se debe exportar la clave. Puede ser uno de los siguientes:
ko: <em> <code>format</code> </em> 은 키를 내 보내야하는 데이터 형식을 설명하는 열거 된 값입니다. 다음 중 하나 일 수 있습니다.
ru: <em> <code>format</code> </em> - это перечисляемое значение, описывающее формат данных, в который должен быть экспортирован ключ. Это может быть одно из следующих:
zh_cn: <em> <code>format</code> </em>是一个枚举值，描述了必须导出密钥的数据格式。可以是以下之一：

source: <em><code>format</code></em> is an enumerated value describing the data format in which the key must be wrapped. It can be one of the following:
es: <em> <code>format</code> o</em> es un valor enumerado que describe el formato de datos en el que se debe ajustar la clave. Puede ser uno de los siguientes:
ko: <em> <code>format</code> </em> 은 키를 줄 바꿈해야하는 데이터 형식을 설명하는 열거 된 값입니다. 다음 중 하나 일 수 있습니다.
ru: <em> <code>format</code> </em> - это перечисляемое значение, описывающее формат данных, в который должен быть заключен ключ. Это может быть одно из следующих:
zh_cn: <em> <code>format</code> </em>是一个枚举值，描述必须包装密钥的数据格式。可以是以下之一：

source: <em><code>format</code></em> is an enumerated value describing the data format of the key to imported. It can be one of the following:
es: <em> <code>format</code> o</em> es un valor enumerado que describe el formato de datos de la clave a importar. Puede ser uno de los siguientes:
ko: <em> <code>format</code> </em> 은 가져올 키의 데이터 형식을 설명하는 열거 된 값입니다. 다음 중 하나 일 수 있습니다.
ru: <em> <code>format</code> </em> - это перечисляемое значение, описывающее формат данных ключа для импорта. Это может быть одно из следующих:
zh_cn: <em> <code>format</code> </em>是一个枚举值，描述要导入的密钥的数据格式。可以是以下之一：

source: <em><code>format</code></em> is an enumerated value describing the data format of the key to unwrap. It can be one of the following:
es: <em> <code>format</code> o</em> es un valor enumerado que describe el formato de datos de la clave para desenvolver. Puede ser uno de los siguientes:
ko: <em> <code>format</code> </em> 은 랩 해제 할 키의 데이터 형식을 설명하는 열거 된 값입니다. 다음 중 하나 일 수 있습니다.
ru: <em> <code>format</code> </em> - это перечисляемое значение, описывающее формат данных ключа, который необходимо развернуть. Это может быть одно из следующих:
zh_cn: <em> <code>format</code> </em>是一个枚举值，描述了要解开密钥的数据格式。可以是以下之一：

source: <em><code>idStr</code></em> is the identifier of the element.
es: <em> <code>idStr</code> </em> es el identificador del elemento.
ko: <em> <code>idStr</code> </em> 은 요소의 식별자입니다.
ru: <em> <code>idStr</code> </em> - это идентификатор элемента.
zh_cn: <em> <code>idStr</code> </em>是元素的标识符。

source: <em><code>index</code></em> is the index of the node to be fetched. The index is zero-based.
es: <em> <code>index</code> </em> es el &iacute;ndice del nodo que se va a buscar. El &iacute;ndice est&aacute; basado en cero.
ko: <em> <code>index</code> </em> 는 가져올 노드의 인덱스입니다. 인덱스는 0부터 시작합니다.
ru: <em> <code>index</code> </em> - это индекс узла, который нужно получить. Индекс начинается с нуля.
zh_cn: <em> <code>index</code> </em>是要获取的节点的索引。索引从零开始。

source: <em><code>long</code>:</em><strong>Returns / Sets</strong> the element's <code><a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/input#attr-maxlength">maxlength</a></code> attribute, containing the <u><strong>maximum <strong>l</strong>ength of characters</strong></u> (in Unicode code points) that the value can have. (If you set this to a negative number, an exception will be thrown.)
es: <em> <code>long</code> : </em><strong>Devuelve / Graba</strong> del elemento <code><a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/input#attr-maxlength">maxlength</a></code> atributo, que contiene la<u><strong> m&aacute;xima <strong>l</strong> ength de caracteres</strong></u> (en puntos de c&oacute;digo Unicode) que el valor puede tener. (Si establece esto en un n&uacute;mero negativo, se generar&aacute; una excepci&oacute;n).
ko: <em> <code>long</code> : </em><strong>반환 / 설정</strong> 요소의 <code><a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/input#attr-maxlength">maxlength</a></code> 포함하는, 속성을<u><strong> 최대 <strong>리터의</strong> 문자 ength</strong></u> 값을 가질 수 (Unicode 코드 포인트)를. (이 값을 음수로 설정하면 예외가 발생합니다.)
ru: <em> <code>long</code> : </em><strong>Возврат / Sets</strong> элемента <code><a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/input#attr-maxlength">maxlength</a></code> атрибут, содержащий<u><strong> максимум <strong>л</strong> ength символов</strong></u> (в точках кода Unicode)что значение может иметь. (Если вы установите это значение отрицательным, будет сгенерировано исключение.)
zh_cn: <em> <code>long</code> ：</em><strong>返回/设置</strong>元素的 <code><a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/input#attr-maxlength">maxlength</a></code> 属性，含有该<u><strong>最大<strong>升</strong>字符ength</strong></u>（以Unicode代码点）的值可以有。（如果将此值设置为负数，将引发异常。）

source: <em><code>masterKey</code></em> is a <a href="../cryptokey"><code>CryptoKey</code></a> representing the master key to be used by the key derivation algorithm.
es: <em> <code>masterKey</code> </em> es una<a href="../cryptokey"> <code>CryptoKey</code> que</a> representa la clave maestra que utilizar&aacute; el algoritmo de derivaci&oacute;n de clave.
ko: <em> <code>masterKey</code> </em> 는키 파생 알고리즘에서 사용할 마스터 키를 나타내는<a href="../cryptokey"> <code>CryptoKey</code> </a> 입니다.
ru: <em> <code>masterKey</code> </em> - это<a href="../cryptokey"> <code>CryptoKey</code> ,</a> представляющий главный ключ, который будет использоваться алгоритмом получения ключа.
zh_cn: <em> <code>masterKey</code> </em>是一个<a href="../cryptokey"> <code>CryptoKey</code> ,</a>表示要由密钥派生算法使用的主密钥。

source: <em><code>priority</code></em>Optional is a <a href="../domstring"><code>DOMString</code></a> allowing the "important" CSS priority to be set. If not specified, treated as the empty string. The following values are accepted:
es: <em> <code>priority</code> </em> Opcional es un<a href="../domstring"> <code>DOMString</code> que</a> permite establecer la prioridad CSS "importante". Si no se especifica, se trata como la cadena vac&iacute;a. Se aceptan los siguientes valores:
ko: <em> <code>priority</code> </em> 선택적은"중요한"CSS 우선 순위를 설정할 수있는<a href="../domstring"> <code>DOMString</code> </a> 입니다. 지정하지 않으면 빈 문자열로 처리됩니다. 다음 값이 허용됩니다.
ru: <em> <code>priority</code> </em> Необязательный<a href="../domstring"> <code>DOMString</code> ,</a> позволяющий установить &laquo;важный&raquo; приоритет CSS. Если не указано, обрабатывается как пустая строка. Следующие значения принимаются:
zh_cn: <em> <code>priority</code> </em>可选是<a href="../domstring"> <code>DOMString</code> ,</a>允许设置&ldquo;重要&rdquo; CSS优先级。如果未指定，则视为空字符串。接受以下值：

source: <em><code>property</code></em> is a <a href="../domstring"><code>DOMString</code></a> representing the property name to be checked.
es: <em> <code>property</code> </em> es un<a href="../domstring"> <code>DOMString</code> que</a> representa el nombre de la propiedad que se va a verificar.
ko: <em> <code>property</code> </em> 는확인할 특성 이름을 나타내는<a href="../domstring"> <code>DOMString</code> </a> 입니다.
ru: <em> <code>property</code> </em> - это<a href="../domstring"> <code>DOMString</code> ,</a> представляющая имя свойства, которое нужно проверить.
zh_cn: <em> <code>property</code> </em>是一个<a href="../domstring"> <code>DOMString</code> ,</a>表示要检查的属性名称。

source: <em><code>property</code></em> is a <a href="../domstring"><code>DOMString</code></a> representing the property name to be removed. Note that multi-word property names are hyphenated and not camel-cased.
es: <em> <code>property</code> </em> es un<a href="../domstring"> <code>DOMString</code> que</a> representa el nombre de la propiedad que se eliminar&aacute;. Tenga en cuenta que los nombres de propiedad de varias palabras est&aacute;n separados por guiones y no en camello.
ko: <em> <code>property</code> </em> 는제거 할 특성 이름을 나타내는<a href="../domstring"> <code>DOMString</code> </a> 입니다. 여러 단어로 된 속성 이름은 하이픈으로 표시되며 낙타로 표시되지 않습니다.
ru: <em> <code>property</code> </em> - это<a href="../domstring"> <code>DOMString</code> ,</a> представляющая имя свойства, которое нужно удалить. Обратите внимание, что имена свойств, состоящие из нескольких слов, пишутся через дефис, а не в верблюжьих.
zh_cn: <em> <code>property</code> </em>是一个<a href="../domstring"> <code>DOMString</code> ,</a>表示要删除的属性名称。请注意，多字属性名称是带连字符的，而不是驼峰式的。

source: <em><code>property</code></em> is a <a href="../domstring"><code>DOMString</code></a> representing the property name to be retrieved.
es: <em> <code>property</code> </em> es un<a href="../domstring"> <code>DOMString</code> que</a> representa el nombre de la propiedad que se va a recuperar.
ko: <em> <code>property</code> </em> 는검색 할 특성 이름을 나타내는<a href="../domstring"> <code>DOMString</code> </a> 입니다.
ru: <em> <code>property</code> </em> - это<a href="../domstring"> <code>DOMString</code> ,</a> представляющая имя свойства, которое нужно получить.
zh_cn: <em> <code>property</code> </em>是一个<a href="../domstring"> <code>DOMString</code> ,</a>表示要检索的属性名称。

source: <em><code>propertyName</code></em> is a <a href="../domstring"><code>DOMString</code></a> representing the CSS property name (hyphen case) to be modified.
es: <em> <code>propertyName</code> </em> es un<a href="../domstring"> <code>DOMString</code> que</a> representa el nombre de la propiedad CSS (gui&oacute;n) que se va a modificar.
ko: <em> <code>propertyName</code> </em> 은수정할 CSS 속성 이름 (하이픈 대 / 소문자)을 나타내는<a href="../domstring"> <code>DOMString</code> </a> 입니다.
ru: <em> <code>propertyName</code> </em> - это<a href="../domstring"> <code>DOMString</code> ,</a> представляющая имя свойства CSS (случай дефиса) для изменения.
zh_cn: <em> <code>propertyName</code> </em>是一个<a href="../domstring"> <code>DOMString</code> ,</a>表示要修改的CSS属性名称（连字符）。
