Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/dom/dom.*.011.xlf
Languages: ja, ko, ru, zh_cn

source: Activating a service worker to deliver a push message can result in increased resource usage, particularly of the battery. Different browsers have different schemes for handling this, there is currently no standard mechanism. Firefox allows a limited number (quota) of push messages to be sent to an application, although Push messages that generate notifications are exempt from this limit. The limit is refreshed each time the site is visited. In comparison, Chrome applies no limit, but requires that every push message causes a notification to be displayed.
ja: サービスワーカーを起動してプッシュメッセージを配信すると、リソースの使用量、特にバッテリーの使用量が増加する可能性があります。異なるブラウザはこれを処理するための異なるスキームを持っており、現在のところ標準的なメカニズムはありません。Firefox では、アプリケーションに送信するプッシュメッセージの数に制限(クォータ)がありますが、通知を生成するプッシュメッセージはこの制限から除外されます。制限数はサイトが訪問されるたびに更新されます。それに比べて、Chromeは制限を適用しないが、プッシュメッセージのたびに通知が表示されることを要求している。
ko: 서비스 워커를 활성화하여 푸시 메시지를 전달하면 특히 배터리의 자원 사용량이 증가 할 수 있습니다. 브라우저마다 다른 처리 방식이 있으며 현재 표준 메커니즘이 없습니다. Firefox는 알림을 생성하는 푸시 메시지가이 제한에서 제외되지만 제한된 수의 푸시 메시지를 응용 프로그램으로 보낼 수 있습니다. 사이트를 방문 할 때마다 제한이 새로 고쳐집니다. 이에 비해 Chrome은 제한이 없지만 모든 푸시 메시지에 알림이 표시되도록 요구합니다.
ru: Активация работника сервисной службы для доставки push-сообщения может привести к увеличению использования ресурсов,особенно аккумулятора.Разные браузеры имеют разные схемы работы с этим,в настоящее время нет стандартного механизма.Firefox позволяет отправить приложению ограниченное количество (квоту)push-сообщений,хотя Push-сообщения,которые генерируют уведомления,исключаются из этого лимита.Лимит обновляется каждый раз при посещении сайта.Для сравнения,Chrome не применяет никаких ограничений,но требует,чтобы каждое push-сообщение вызывало отображение уведомления.
zh_cn: 激活服务工作者来传递推送消息会导致资源使用量增加,尤其是电池。不同的浏览器有不同的处理方案,目前还没有标准的机制。火狐允许向应用程序发送有限数量(配额)的推送消息,尽管生成通知的推送消息不受此限制。每次访问网站时,该限制都会被刷新。相比之下,Chrome没有限制,但要求每条推送消息都要显示通知。

source: Activating full-screen mode
ja: フルスクリーンモードを有効にする
ko: 전체 화면 모드 활성화
ru: Включение полноэкранного режима
zh_cn: 激活全屏模式

source: Activating hold mode
ja: ホールドモードの起動
ko: 홀드 모드 활성화
ru: Активация режима удержания
zh_cn: 激活保持模式

source: Actually part of CSS Animations.
ja: 実はCSS Animationsの一部です。
ko: 실제로 CSS 애니메이션의 일부입니다.
ru: Фактически,часть анимации CSS.
zh_cn: 其实是CSS Animations的一部分。

source: Actually, regarding memory consumption, the lack of keeping a function reference is not the real issue; rather it is the lack of keeping a STATIC function reference. In both problem-cases below, a function reference is kept, but since it is redefined on each iteration, it is not static. In the third case, the reference to the anonymous function is being reassigned with each iteration. In the fourth case, the entire function definition is unchanging, but it is still being repeatedly defined as if new (unless it was [[promoted]] by the complier) and so is not static. Therefore, though appearing to be simply [[Multiple identical event listeners]], in both cases each iteration will instead create a new listener with its own unique reference to the handler function. However, since the function definition itself does not change, the SAME function may still be called for every duplicate listener (especially if the code gets optimized.)
ja: 実際には、メモリ消費に関しては、関数参照が保持されていないことが本当の問題ではなく、STATIC関数参照が保持されていないことが問題なのです。以下の問題ケースでは、どちらも関数参照は保持されていますが、繰り返しのたびに再定義されているため、静的なものではありません。3つ目のケースでは、無名関数の参照が反復のたびに再割り当てされている。4番目のケースでは,関数の定義全体は不変ですが,(コンプライアによって[[昇格]]されていない限り)新しいものであるかのように繰り返し定義されているので,静的ではありません.したがって、単純に[[複数の同一のイベントリスナー]]のように見えますが、どちらの場合も、それぞれの繰り返しは、ハンドラ関数への独自の参照を持つ新しいリスナーを作成する代わりに、新しいリスナーを作成します。しかし、関数の定義自体は変更されないので、重複するリスナーごとにSAME関数が呼び出される可能性があります(特にコードが最適化されている場合)。
ko: 실제로 메모리 소비와 관련하여 함수 참조를 유지하지 못하는 것은 실제 문제가 아닙니다. 오히려 STATIC 함수 참조를 유지하는 것이 부족합니다. 아래의 두 가지 문제 모두에서 함수 참조는 유지되지만 각 반복에서 재정의되므로 정적이 아닙니다. 세 번째 경우에는 익명 함수에 대한 참조가 각 반복마다 재 지정됩니다. 네 번째 경우, 전체 함수 정의는 변경되지 않지만 여전히 새 것처럼 반복적으로 정의되고 있으며 (컴파일러가 [[승격]하지 않은 경우) 정적이 아닙니다. 따라서 단순히 [[여러 개의 동일한 이벤트 리스너]] 인 것처럼 보이지만 두 경우 모두 각 반복이 대신 핸들러 함수에 대한 고유 한 참조를 가진 새 리스너를 작성합니다. 그러나 함수 정의 자체는 변경되지 않으므로SAME 함수는 여전히 모든 중복 리스너에 대해 호출 될 수 있습니다 (특히 코드가 최적화 된 경우).
ru: На самом деле,что касается потребления памяти,то проблема не в том,чтобы держать ссылку на функцию,а в том,чтобы не держать ссылку на функцию STATIC.В обоих случаях,приведенных ниже,ссылка на функцию сохраняется,но,поскольку она переопределяется при каждой итерации,она не является статической.В третьем случае при каждой итерации происходит переназначение ссылки на анонимную функцию.В четвертом случае все определение функции остается неизменным,но оно все еще многократно определяется как новое (если только оно не было [[продвинуто]]компилятором)и поэтому не является статическим.Поэтому,хотя и кажется,что это просто [[Несколько одинаковых слушателей событий]],в обоих случаях каждая итерация вместо этого будет создавать новый слушатель со своей собственной уникальной ссылкой на функцию обработчика.Однако,так как определение функции само по себе не меняется,SAME-функция все равно может быть вызвана для каждого дублирующего слушателя (особенно если код оптимизирован).
zh_cn: 其实,关于内存消耗,没有保留函数引用并不是真正的问题,而是没有保留static函数引用。在下面的两个问题案例中,都保留了一个函数引用,但由于它在每次迭代时都被重新定义,所以不是静态的。在第三种情况下,匿名函数的引用在每次迭代时都被重新分配。在第四种情况下,整个函数定义是不变的,但它仍然被重复定义为新的(除非它被编译器[[promoted]]),所以不是静态的。因此,虽然看起来只是[[多个相同的事件监听器]],但在这两种情况下,每次迭代反而会创建一个新的监听器,并有自己对处理函数的唯一引用。然而,由于函数定义本身并没有改变,所以对于每个重复的监听器,仍然可以调用SAME函数(特别是当代码得到优化时。

source: Adapting Sync XHR usecases to the Beacon API
ja: Sync XHR のユースケースを Beacon API に適応させる
ko: Sync XHR 사용 사례를 Beacon API에 적용
ru: Адаптация Синхронизация XHR в соответствии с Beacon API.
zh_cn: 将同步XHR用例适配到Beacon API。

source: Add <code><a href="https://developer.mozilla.org/en-US/docs/Web/Events/touchmove">touchmove</a></code>, <code><a href="https://developer.mozilla.org/en-US/docs/Web/Events/touchend">touchend</a></code> and <code><a href="https://developer.mozilla.org/en-US/docs/Web/Events/touchcancel">touchcancel</a></code> event handlers within the <code><a href="https://developer.mozilla.org/en-US/docs/Web/Events/touchstart">touchstart</a></code>.
ja: 追加 <code><a href="https://developer.mozilla.org/en-US/docs/Web/Events/touchmove">touchmove</a></code> 、 <code><a href="https://developer.mozilla.org/en-US/docs/Web/Events/touchend">touchend</a></code> と <code><a href="https://developer.mozilla.org/en-US/docs/Web/Events/touchcancel">touchcancel</a></code> 内のイベントハンドラを <code><a href="https://developer.mozilla.org/en-US/docs/Web/Events/touchstart">touchstart</a></code> 。
ko: 추가 <code><a href="https://developer.mozilla.org/en-US/docs/Web/Events/touchmove">touchmove</a></code> , <code><a href="https://developer.mozilla.org/en-US/docs/Web/Events/touchend">touchend</a></code> 및 <code><a href="https://developer.mozilla.org/en-US/docs/Web/Events/touchcancel">touchcancel</a></code> 의 내에서 이벤트 핸들러를 <code><a href="https://developer.mozilla.org/en-US/docs/Web/Events/touchstart">touchstart</a></code> .
ru: Добавьте обработчики событий <code><a href="https://developer.mozilla.org/en-US/docs/Web/Events/touchmove">touchmove</a></code> , <code><a href="https://developer.mozilla.org/en-US/docs/Web/Events/touchend">touchend</a></code> и <code><a href="https://developer.mozilla.org/en-US/docs/Web/Events/touchcancel">touchcancel</a></code> в <code><a href="https://developer.mozilla.org/en-US/docs/Web/Events/touchstart">touchstart</a></code> .
zh_cn: 添加 <code><a href="https://developer.mozilla.org/en-US/docs/Web/Events/touchmove">touchmove</a></code> ， <code><a href="https://developer.mozilla.org/en-US/docs/Web/Events/touchend">touchend</a></code> 和 <code><a href="https://developer.mozilla.org/en-US/docs/Web/Events/touchcancel">touchcancel</a></code> 的内部事件处理程序 <code><a href="https://developer.mozilla.org/en-US/docs/Web/Events/touchstart">touchstart</a></code> 。

source: Add <code>timeOrigin</code> property to <code>Performance</code> interface.
ja: <code>timeOrigin</code> プロパティを <code>Performance</code> インターフェイスに追加します。
ko: <code>timeOrigin</code> 속성을 <code>Performance</code> 인터페이스에 추가하십시오 .
ru: Добавьте свойство <code>timeOrigin</code> в интерфейс <code>Performance</code> .
zh_cn: 将 <code>timeOrigin</code> 属性添加到 <code>Performance</code> 界面。

source: Add <var>S</var> to the <a href="https://www.w3.org/TR/presentation-api/#dfn-set-of-controlled-presentations">set of controlled presentations</a>.
ja: <a href="https://www.w3.org/TR/presentation-api/#dfn-set-of-controlled-presentations">制御されたプレゼンテーション</a>のセットに <var>S</var> を追加します。
ko: <a href="https://www.w3.org/TR/presentation-api/#dfn-set-of-controlled-presentations">제어 된 프리젠 테이션 세트에 </a> <var>S</var> 를 추가하십시오 .
ru: Добавьте <var>S</var> к <a href="https://www.w3.org/TR/presentation-api/#dfn-set-of-controlled-presentations">набору контролируемых презентаций</a> .
zh_cn: 将 <var>S</var> 添加到<a href="https://www.w3.org/TR/presentation-api/#dfn-set-of-controlled-presentations">受控表示</a>的集合中。

source: Add a <code>rotateZ</code> matrix.
ja: <code>rotateZ</code> 行列を追加します。
ko: <code>rotateZ</code> 행렬을 추가하십시오 .
ru: Добавьте матрицу <code>rotateZ</code> .
zh_cn: 添加 <code>rotateZ</code> 矩阵。

source: Add a listener for the <code><code><a href="https://developer.mozilla.org/en-US/docs/Web/Events/dragstart">dragstart</a></code></code> event
ja: <code><code><a href="https://developer.mozilla.org/en-US/docs/Web/Events/dragstart">dragstart</a></code></code> イベントのリスナーを追加する
ko: <code><code><a href="https://developer.mozilla.org/en-US/docs/Web/Events/dragstart">dragstart</a></code></code> 이벤트에 대한 리스너 추가
ru: Добавьте прослушиватель для <code><code><a href="https://developer.mozilla.org/en-US/docs/Web/Events/dragstart">dragstart</a></code></code> события
zh_cn: 为 <code><code><a href="https://developer.mozilla.org/en-US/docs/Web/Events/dragstart">dragstart</a></code></code> 事件添加一个侦听器

source: Add a simple listener
ja: シンプルなリスナーを追加
ko: 간단한 청취자 추가
ru: Добавить простого слушателя
zh_cn: 增加一个简单的监听器

source: Add fixed points of reference for fixed objects (otherwise the user will believe they are on the move.)
ja: 固定オブジェクトの固定参照点を追加します(そうしないと、ユーザーは移動中だと思ってしまいます)。
ko: 고정 된 개체에 대한 고정 된 참조 점을 추가하십시오 (그렇지 않으면 사용자가 이동 중이라고 생각할 것입니다).
ru: Добавить фиксированные опорные точки для фиксированных объектов (иначе пользователь поверит,что они находятся в движении).
zh_cn: 为固定对象增加固定的参考点(否则用户会认为他们是在移动中。

source: Add some rotation matrices to the view matrix to look around.
ja: ビューマトリックスにいくつかの回転行列を追加して、見て回るようにします。
ko: 둘러보기 위해 회전 행렬을 뷰 행렬에 추가하십시오.
ru: Добавьте несколько матриц вращения в матрицу просмотра,чтобы осмотреться.
zh_cn: 在视图矩阵中添加一些旋转矩阵,以环顾四周。

source: Add the event handlers to a specific target element (rather than the entire document or nodes higher up in the document tree).
ja: イベントハンドラを特定のターゲット要素に追加します (ドキュメント全体やドキュメントツリーの上位ノードではなく)。
ko: 전체 문서 또는 문서 트리에서 상위 노드가 아닌 특정 대상 요소에 이벤트 핸들러를 추가하십시오.
ru: Добавьте обработчики событий к конкретному целевому элементу (а не ко всему документу или узлам выше в дереве документов).
zh_cn: 将事件处理程序添加到一个特定的目标元素(而不是整个文档或文档树中较高的节点)。

source: Add the touch point handlers to the specific target element (rather than the entire document or nodes higher up in the document tree).
ja: 特定のターゲット要素にタッチポイントハンドラを追加します(ドキュメント全体やドキュメントツリーの上位ノードではなく)。
ko: 터치 포인트 핸들러를 전체 문서 또는 문서 트리에서 상위 노드가 아닌 특정 대상 요소에 추가하십시오.
ru: Добавьте обработчики точек касания к конкретному целевому элементу (а не ко всему документу или узлам выше в дереве документов).
zh_cn: 将触摸点处理程序添加到特定的目标元素(而不是整个文档或文档树中较高的节点)。

source: Add touch screen support to your website (The easy way)
ja: あなたのウェブサイトにタッチスクリーンのサポートを追加する(簡単な方法
ko: 웹 사이트에 터치 스크린 지원 추가 (쉬운 방법)
ru: Добавить поддержку сенсорного экрана на вашем сайте (Простой способ)
zh_cn: 为您的网站添加触摸屏支持(简单的方法

source: Added <code>SECURITY_ERR</code>, <code>NETWORK_ERR</code>, <code>ABORT_ERR</code>, <code>URL_MISMATCH_ERR</code>, <code>QUOTA_EXCEEDED_ERR</code>, <code>TIMEOUT_ERR</code>, <code>INVALID_NODE_TYPE_ERR</code>, and <code>DATA_CLONE_ERR</code>. The property <code>code</code> has been deprecated for exception values. The <code>EncodingError</code> value added.
ja: 追加 <code>SECURITY_ERR</code> 、 <code>NETWORK_ERR</code> 、 <code>ABORT_ERR</code> 、 <code>URL_MISMATCH_ERR</code> 、 <code>QUOTA_EXCEEDED_ERR</code> 、 <code>TIMEOUT_ERR</code> 、 <code>INVALID_NODE_TYPE_ERR</code> 、および <code>DATA_CLONE_ERR</code> 。プロパティ <code>code</code> は、例外値で非推奨になりました。 <code>EncodingError</code> 値が追加されました。
ko: 추가 <code>SECURITY_ERR</code> , <code>NETWORK_ERR</code> , <code>ABORT_ERR</code> , <code>URL_MISMATCH_ERR</code> , <code>QUOTA_EXCEEDED_ERR</code> , <code>TIMEOUT_ERR</code> , <code>INVALID_NODE_TYPE_ERR</code> 및 <code>DATA_CLONE_ERR</code> . 예외 값으로 인해 특성 <code>code</code> 가 더 이상 사용되지 않습니다. <code>EncodingError</code> 의 값했다.
ru: Добавлены <code>SECURITY_ERR</code> , <code>NETWORK_ERR</code> , <code>ABORT_ERR</code> , <code>URL_MISMATCH_ERR</code> , <code>QUOTA_EXCEEDED_ERR</code> , <code>TIMEOUT_ERR</code> , <code>INVALID_NODE_TYPE_ERR</code> и <code>DATA_CLONE_ERR</code> . Свойство <code>code</code> устарели для значений исключений. Добавлено значение <code>EncodingError</code> .
zh_cn: 添加了 <code>SECURITY_ERR</code> ， <code>NETWORK_ERR</code> ， <code>ABORT_ERR</code> ， <code>URL_MISMATCH_ERR</code> ， <code>QUOTA_EXCEEDED_ERR</code> ， <code>TIMEOUT_ERR</code> ， <code>INVALID_NODE_TYPE_ERR</code> 和 <code>DATA_CLONE_ERR</code> 。不建议使用属性 <code>code</code> 来获取异常值。该 <code>EncodingError</code> 附加值。

source: Added <code>code</code> and <code>key</code> to <em><code>KeyboardEventInit</code></em>
ja: <em> <code>KeyboardEventInit</code> に</em> <code>code</code> と <code>key</code> を追加しました<em></em>
ko: 추가 된 <code>code</code> 와 <code>key</code> 에 <em> <code>KeyboardEventInit</code> </em>
ru: Добавлен <code>code</code> и <code>key</code> к <em> <code>KeyboardEventInit</code> </em>
zh_cn: 向<em> <code>KeyboardEventInit</code> </em>添加了 <code>code</code> 和 <code>key</code> <em></em>

source: Added <code>continuePrimaryKey()</code> and support for binary keys.
ja: <code>continuePrimaryKey()</code> とバイナリキーのサポートを追加しました。
ko: <code>continuePrimaryKey()</code> 추가 하고 이진 키를 지원합니다.
ru: Добавлен <code>continuePrimaryKey()</code> и поддержка двоичных ключей.
zh_cn: 添加了 <code>continuePrimaryKey()</code> 并支持二进制密钥。

source: Added <code>edgeMode</code> property.
ja: <code>edgeMode</code> プロパティを追加しました。
ko: <code>edgeMode</code> 속성을 추가 했습니다.
ru: Добавлено свойство <code>edgeMode</code> .
zh_cn: 添加了 <code>edgeMode</code> 属性。

source: Added <code>getNamedItemNS()</code>, <code>setNamedItemNS()</code> and <code>removeNamedItemNS()</code>
ja: <code>getNamedItemNS()</code> 、 <code>setNamedItemNS()</code> 、および <code>removeNamedItemNS()</code> を追加しました
ko: 추가 <code>getNamedItemNS()</code> , <code>setNamedItemNS()</code> 및 <code>removeNamedItemNS()</code>
ru: Добавлены <code>getNamedItemNS()</code> , <code>setNamedItemNS()</code> и <code>removeNamedItemNS()</code>
zh_cn: 添加了 <code>getNamedItemNS()</code> ， <code>setNamedItemNS()</code> 和 <code>removeNamedItemNS()</code>

source: Added <code>null</code> as return value in case that no target element is being animated.
ja: <code>null</code> を追加ターゲット要素がアニメーション化されていない場合の戻り値としてを。
ko: 애니메이션 대상 요소가없는 경우 반환 값으로 <code>null</code> 을 추가했습니다 .
ru: Добавлен <code>null</code> качестве возвращаемого значения в случае, если ни один целевой элемент не анимируется.
zh_cn: 在没有动画目标元素的情况下，将 <code>null</code> 添加为返回值。

source: Added <code>ontouchstart</code>, <code>ontouchend</code>, <code>ontouchmove</code>, <code>ontouchend</code> global attribute handlers
ja: <code>ontouchstart</code> 、 <code>ontouchend</code> 、 <code>ontouchmove</code> 、 <code>ontouchend</code> グローバル属性ハンドラーを追加
ko: <code>ontouchstart</code> , <code>ontouchend</code> , <code>ontouchmove</code> , <code>ontouchend</code> 전역 속성 핸들러가 추가되었습니다.
ru: Добавлены обработчики глобальных атрибутов <code>ontouchstart</code> , <code>ontouchend</code> , <code>ontouchmove</code> , <code>ontouchend</code>
zh_cn: 添加了 <code>ontouchstart</code> ， <code>ontouchend</code> ， <code>ontouchmove</code> ， <code>ontouchend</code> 全局属性处理程序

source: Added <code>ownerElement</code> property back
ja: <code>ownerElement</code> プロパティを追加して戻しました
ko: <code>ownerElement</code> 속성을 다시 추가 했습니다.
ru: Добавлено свойство <code>ownerElement</code> назад
zh_cn: 添加了 <code>ownerElement</code> 属性

source: Added <code>radiusX</code>, <code>radiusY</code>, <code>rotationAngle</code>, <code>force</code> properties
ja: <code>radiusX</code> 、 <code>radiusY</code> 、 <code>rotationAngle</code> 、 <code>force</code> プロパティを追加
ko: 추가 <code>radiusX</code> , <code>radiusY</code> , <code>rotationAngle</code> , <code>force</code> 속성
ru: Добавлено <code>radiusX</code> , <code>radiusY</code> , <code>rotationAngle</code> , <code>force</code> свойства
zh_cn: 增加了 <code>radiusX</code> ， <code>radiusY</code> ， <code>rotationAngle</code> ， <code>force</code> 属性

source: Added <code>radiusX</code>, <code>radiusY</code>, <code>rotationAngle</code>, <code>force</code> properties, as well as the <code>Touch()</code> constructor.
ja: <code>radiusX</code> 、 <code>radiusY</code> 、 <code>rotationAngle</code> 、 <code>force</code> プロパティ、および <code>Touch()</code> コンストラクタが追加されました。
ko: <code>Touch()</code> 생성자 뿐만 아니라 <code>radiusX</code> , <code>radiusY</code> , <code>rotationAngle</code> , <code>force</code> 속성을 추가 했습니다 .
ru: Добавлено <code>radiusX</code> , <code>radiusY</code> , <code>rotationAngle</code> , <code>force</code> свойства, а также <code>Touch()</code> конструктор.
zh_cn: 添加了 <code>radiusX</code> ， <code>radiusY</code> ， <code>rotationAngle</code> ， <code>force</code> 属性以及 <code>Touch()</code> 构造函数。

source: Added <code>setTransform()</code> method in v5.
ja: v5に <code>setTransform()</code> メソッドを追加しました。
ko: v5에 <code>setTransform()</code> 메소드가 추가되었습니다 .
ru: Добавлен <code>setTransform()</code> в версии 5.
zh_cn: 在v5中添加了 <code>setTransform()</code> 方法。

source: Added <code>sourceCapabilities</code> property.
ja: <code>sourceCapabilities</code> プロパティが追加されました。
ko: <code>sourceCapabilities</code> 속성을 추가 했습니다.
ru: Добавлено свойство <code>sourceCapabilities</code> .
zh_cn: 添加了 <code>sourceCapabilities</code> 属性。

source: Added <code>toJSON()</code> serializer method.
ja: <code>toJSON()</code> シリアライザメソッドを追加しました。
ko: <code>toJSON()</code> 시리얼 라이저 메소드에 추가되었습니다 .
ru: Добавлен <code>toJSON()</code> сериализатора JSON () .
zh_cn: 添加到 <code>toJSON()</code> 序列化器方法。

source: Added a second inheritence, the <a href="linkstyle"><code>LinkStyle</code></a> interface.
ja: 2番目の継承である<a href="linkstyle"> <code>LinkStyle</code> </a>インターフェイスを追加しました。
ko: 두 번째 상속인 <a href="linkstyle"> <code>LinkStyle</code> </a> 인터페이스를 추가했습니다 .
ru: Добавлено второе наследование, интерфейс <a href="linkstyle"> <code>LinkStyle</code> </a> .
zh_cn: 添加了第二个继承，<a href="linkstyle"> <code>LinkStyle</code> </a>接口。

source: Added for legacy compatibility.
ja: レガシー互換性のために追加されました。
ko: 레거시 호환성을 위해 추가되었습니다.
ru: Добавлена для совместимости с наследием.
zh_cn: 为传统的兼容性而添加。

source: Added implemention of the <a href="childnode"><code>ChildNode</code></a> interface.
ja: <a href="childnode"> <code>ChildNode</code> </a>インターフェースの実装が追加されました。
ko: <a href="childnode"> <code>ChildNode</code> </a> 인터페이스의 구현이 추가되었습니다 .
ru: Добавлена ​​реализация интерфейса <a href="childnode"> <code>ChildNode</code> </a> .
zh_cn: 添加了<a href="childnode"> <code>ChildNode</code> </a>接口的实现。

source: Added in <a href="https://developer.mozilla.org/en-US/docs/HTML/HTML5">HTML5</a>, the <strong>HTML <a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/canvas"><code>&lt;canvas&gt;</code></a> element</strong> can be used to draw graphics via scripting in <a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript">JavaScript</a>. For example, it can be used to draw graphs, make photo compositions, create animations, or even do real-time video processing or rendering.
ja: <a href="https://developer.mozilla.org/en-US/docs/HTML/HTML5">HTML5</a>に追加された<strong>HTML <a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/canvas"> <code>&lt;canvas&gt;</code> </a>要素</strong>を使用して、<a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript">JavaScriptの</a>スクリプトでグラフィックを描画できます。たとえば、グラフの描画、写真の合成、アニメーションの作成、さらにはリアルタイムのビデオ処理やレンダリングに使用できます。
ko: 에 추가 된 <a href="https://developer.mozilla.org/en-US/docs/HTML/HTML5">HTML5</a> 는 <strong>HTML <a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/canvas"> <code>&lt;canvas&gt;</code> </a> 요소</strong> 에 스크립트를 통해 그림을 그리는데 사용하는 <a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript">자바 스크립트</a> . 예를 들어, 그래프를 그리거나 사진 구성을 만들거나 애니메이션을 만들거나 실시간 비디오 처리 또는 렌더링을 수행하는 데 사용할 수 있습니다.
ru: Добавленный в <a href="https://developer.mozilla.org/en-US/docs/HTML/HTML5">HTML5</a> , <strong>элемент </strong><strong>HTML <a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/canvas"> <code>&lt;canvas&gt;</code> </a></strong> можно использовать для рисования графики с помощью сценариев в <a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript">JavaScript</a> . Например, его можно использовать для рисования графиков, создания фото композиций, создания анимации или даже для обработки или рендеринга видео в реальном времени.
zh_cn: 加入在<a href="https://developer.mozilla.org/en-US/docs/HTML/HTML5">HTML5</a>中，<strong>HTML <a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/canvas"> <code>&lt;canvas&gt;</code> </a>元件</strong>可以用于通过脚本在绘制图形<a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript">的JavaScript</a>。例如，它可以用于绘制图形，制作照片构图，创建动画，甚至进行实时视频处理或渲染。

source: Added inheritance of <a href="linkstyle"><code>LinkStyle</code></a>.
ja: <a href="linkstyle"> <code>LinkStyle</code> の</a>継承を追加しました。
ko: <a href="linkstyle"> <code>LinkStyle</code> 의</a> 상속을 추가 했습니다 .
ru: Добавлено наследование <a href="linkstyle"> <code>LinkStyle</code> </a> .
zh_cn: 添加了<a href="linkstyle"> <code>LinkStyle</code> 的</a>继承。

source: Added inheritance of the <a href="elementtraversal"><code>ElementTraversal</code></a> interface.
ja: <a href="elementtraversal"> <code>ElementTraversal</code> </a>インターフェースの継承が追加されました。
ko: <a href="elementtraversal"> <code>ElementTraversal</code> </a> 인터페이스의 상속이 추가되었습니다 .
ru: Добавлено наследование интерфейса <a href="elementtraversal"> <code>ElementTraversal</code> </a> .
zh_cn: 添加了<a href="elementtraversal"> <code>ElementTraversal</code> </a>接口的继承。

source: Added its initial definition to the <code>ElementTraversal</code> pure interface and use it on <a href="../element"><code>Element</code></a>.
ja: <code>ElementTraversal</code> ピュアインターフェースに初期定義を追加し、<a href="../element"> <code>Element</code> で</a>使用します。
ko: <code>ElementTraversal</code> 순수 인터페이스에 초기 정의를 추가하고 <a href="../element"> <code>Element</code> 에서</a> 사용하십시오 .
ru: Добавил свое первоначальное определение в чистый интерфейс <code>ElementTraversal</code> и использовал его в <a href="../element"> <code>Element</code> </a> .
zh_cn: 将其初始定义添加到 <code>ElementTraversal</code> 纯接口中，并在<a href="../element"> <code>Element</code> </a>上使用它。

source: Added of <code>INVALID_STATE_ERR</code>, <code>SYNTAX_ERR</code>, <code>INVALID_MODIFICATION_ERR</code>, <code>NAMESPACE_ERR</code>, and <code>INVALID_ACCESS_ERR</code>.
ja: 加え <code>INVALID_STATE_ERR</code> 、 <code>SYNTAX_ERR</code> 、 <code>INVALID_MODIFICATION_ERR</code> 、 <code>NAMESPACE_ERR</code> 、および <code>INVALID_ACCESS_ERR</code> 。
ko: 의 추가 <code>INVALID_STATE_ERR</code> , <code>SYNTAX_ERR</code> , <code>INVALID_MODIFICATION_ERR</code> , <code>NAMESPACE_ERR</code> 및 <code>INVALID_ACCESS_ERR</code> .
ru: Добавлены <code>INVALID_STATE_ERR</code> , <code>SYNTAX_ERR</code> , <code>INVALID_MODIFICATION_ERR</code> , <code>NAMESPACE_ERR</code> и <code>INVALID_ACCESS_ERR</code> .
zh_cn: 添加了 <code>INVALID_STATE_ERR</code> ， <code>SYNTAX_ERR</code> ， <code>INVALID_MODIFICATION_ERR</code> ， <code>NAMESPACE_ERR</code> 和 <code>INVALID_ACCESS_ERR</code> 。
