Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/yii/yii.*.022.xlf
Languages: ja, ko, ru

source: This method is mainly called by <a href="yii-helpers-basehtml#activeListBox()-detail">activeListBox()</a>, <a href="yii-helpers-basehtml#activeRadioList()-detail">activeRadioList()</a> and <a href="yii-helpers-basehtml#activeCheckboxList()-detail">activeCheckboxList()</a>.
ko: 이 메소드는 주로 <a href="yii-helpers-basehtml#activeListBox()-detail">activeListBox ()</a> , <a href="yii-helpers-basehtml#activeRadioList()-detail">activeRadioList ()</a> 및 <a href="yii-helpers-basehtml#activeCheckboxList()-detail">activeCheckboxList ()에</a> 의해 호출됩니다 .

source: This method is mainly called by <a href="yii-web-user#login()-detail">login()</a>, <a href="yii-web-user#logout()-detail">logout()</a> and <a href="yii-web-user#loginByCookie()-detail">loginByCookie()</a> when the current user needs to be associated with the corresponding identity information.
ko: 이 메소드는 현재 사용자가 해당 ID 정보와 연관되어야하는 경우 <a href="yii-web-user#login()-detail">login ()</a> , <a href="yii-web-user#logout()-detail">logout ()</a> 및 <a href="yii-web-user#loginByCookie()-detail">loginByCookie ()에</a> 의해 주로 호출됩니다 .

source: This method is mainly called by pagers when creating URLs used to perform pagination.
ko: 이 방법은 페이지 매김을 수행하는 데 사용되는 URL을 만들 때 주로 호출기에서 호출합니다.

source: This method is mainly invoked by the controller.
ko: 이 메소드는 주로 컨트롤러에 의해 호출됩니다.

source: This method is mainly provided for testing purpose.
ko: 이 방법은 주로 테스트 목적으로 제공됩니다.

source: This method is mainly used by <a href="yii-caching-filecache#gc()-detail">gc()</a>.
ko: 이 메소드는 주로 <a href="yii-caching-filecache#gc()-detail">gc ()에</a> 의해 사용됩니다 .

source: This method is mainly used by test scripts to set up a fixture.
ko: 이 방법은 주로 테스트 스크립트에서 조명기를 설정하는 데 사용됩니다.

source: This method is mainly used internally to implement dynamic content feature.
ko: 이 방법은 주로 동적 컨텐츠 기능을 구현하기 위해 내부적으로 사용됩니다.

source: This method is mainly used to collect tabular data input. The data to be loaded for each model is <code>$data[formName][index]</code>, where <code>formName</code> refers to the value of <a href="yii-base-model#formName()-detail">formName()</a>, and <code>index</code> the index of the model in the <code>$models</code> array. If <a href="yii-base-model#formName()-detail">formName()</a> is empty, <code>$data[index]</code> will be used to populate each model. The data being populated to each model is subject to the safety check by <a href="yii-base-model#setAttributes()-detail">setAttributes()</a>.
ko: 이 방법은 주로 테이블 형식의 데이터 입력을 수집하는 데 사용됩니다. 각 모델에 대해로드되는 데이터는 <code>$data[formName][index]</code> 여기서, <code>formName</code> 값을 의미한다 <a href="yii-base-model#formName()-detail">)는 FormName (</a> 및 <code>index</code> 에서 모델의 인덱스 <code>$models</code> 어레이. 경우 <a href="yii-base-model#formName()-detail">는 FormName은 ()</a> 비어, <code>$data[index]</code> 각 모델을 채우는 데 사용됩니다. 각 모델에 채워지는 데이터는 <a href="yii-base-model#setAttributes()-detail">setAttributes ()에</a> 의해 안전 점검을받습니다 .

source: This method is mainly used together with content caching (fragment caching and page caching) when some portions of the content (called <em>dynamic content</em>) should not be cached. The dynamic content must be returned by some PHP statements.
ko: 이 방법은 컨텐츠의 일부 ( <em>동적 컨텐츠</em> 라고 함 )를 캐시하지 않아야 할 때 컨텐츠 캐싱 (조각 캐싱 및 페이지 캐싱)과 함께 주로 사용됩니다 . 동적 내용은 일부 PHP 문으로 반환해야합니다.

source: This method is meant to be overwritten to declare external actions for the controller. It should return an array, with array keys being action IDs, and array values the corresponding action class names or action configuration arrays. For example,
ko: 이 메소드는 컨트롤러에 대한 외부 조치를 선언하기 위해 겹쳐 써야합니다. 배열 키가 조치 ID 인 배열을 리턴해야하며 배열 값은 해당 조치 클래스 이름 또는 조치 구성 배열입니다. 예를 들어

source: This method is not designed for content compression (you should use <code>gzip</code> output compression to achieve it). Main intention is to strip out extra whitespace characters between HTML tags in order to avoid browser rendering quirks in some circumstances (e.g. newlines between inline-block elements).
ko: 이 방법은 컨텐츠 압축 용으로 설계되지 않았습니다 ( 이를 달성 하려면 <code>gzip</code> 출력 압축을 사용해야합니다). 주요 목적은 일부 상황에서 브라우저 렌더링 문제를 피하기 위해 HTML 태그 사이에 여분의 공백 문자를 제거하는 것입니다 (예 : 인라인 블록 요소 사이의 줄 바꿈).

source: This method is not supported by Sphinx.
ko: 이 방법은 Sphinx에서 지원되지 않습니다.

source: This method is not supported by elasticsearch.
ko: 이 방법은 elasticsearch에서 지원되지 않습니다.

source: This method is only useful when there are multiple result sets returned by the query. Not all DBMS support this feature.
ko: 이 방법은 쿼리에서 여러 결과 집합이 반환 된 경우에만 유용합니다. 모든 DBMS가이 기능을 지원하지는 않습니다.

source: This method is overridden so that AR attributes can be accessed like properties.
ko: 이 속성은 속성처럼 AR 속성에 액세스 할 수 있도록 재정의됩니다.

source: This method is overridden so that attributes and related objects can be accessed like properties.
ko: 이 메소드는 속성과 같은 속성 및 관련 객체에 액세스 할 수 있도록 재정의됩니다.

source: This method is overridden to support accessing components like reading properties.
ko: 이 속성은 속성 읽기와 같은 구성 요소 액세스를 지원하도록 재정의되었습니다.

source: This method is provided so that you can override the default way of determining whether the session ID is sent.
ko: 이 방법은 세션 ID의 전송 여부를 판별하는 기본 방법을 대체 할 수 있도록 제공됩니다.

source: This method is provided so that you can temporarily force using the master connection to perform DB operations even if they are read queries. For example,
ko: 이 방법은 마스터 연결을 사용하여 읽기 작업 인 경우에도 DB 작업을 일시적으로 수행 할 수 있도록하기 위해 제공됩니다. 예를 들어

source: This method is provided such that we can get the public member variables of an object. It is different from "get_object_vars()" because the latter will return private and protected variables if it is called within the object itself.
ko: 이 메소드는 객체의 public 멤버 변수를 얻을 수 있도록 제공됩니다. "get_object_vars ()"와 다릅니다. 후자는 개체 자체 내에서 호출 된 개인 및 보호 변수를 반환하기 때문입니다.

source: This method is required by <a href="http://www.php.net/class.countable">Countable</a> interface.
ko: 이 방법은 <a href="http://www.php.net/class.countable">Countable</a> 인터페이스에 필요합니다 .

source: This method is required by Countable interface.
ko: 이 방법은 Countable 인터페이스에 필요합니다.

source: This method is required by IApplicationComponent and is invoked by application.
ko: 이 메소드는 IApplicationComponent에 필요하며 애플리케이션에 의해 호출됩니다.

source: This method is required by the Countable interface. Note, most DBMS may not give a meaningful count. In this case, use "SELECT COUNT(*) FROM tableName" to obtain the number of rows.
ko: 이 메소드는 Countable 인터페이스에 필요합니다. 대부분의 DBMS는 의미있는 수를 제공하지 않을 수 있습니다. 이 경우 "SELECT COUNT (*) FROM tableName"을 사용하여 행 수를 얻으십시오.

source: This method is required by the SPL <code>Countable</code> interface. It will be implicitly called when you use <code>count($collection)</code>.
ko: 이 방법은 SPL <code>Countable</code> 인터페이스에 필요합니다 . <code>count($collection)</code> 사용하면 암시 적으로 호출됩니다 .

source: This method is required by the SPL interface <a href="http://www.php.net/class.arrayaccess">ArrayAccess</a>. It is implicitly called when you use something like <code>$collection[$name] = $cookie;</code>. This is equivalent to <a href="yii-web-cookiecollection#add()-detail">add()</a>.
ko: 이 메소드는 SPL 인터페이스 <a href="http://www.php.net/class.arrayaccess">ArrayAccess에</a> 필요합니다 . <code>$collection[$name] = $cookie;</code> 와 같은 것을 사용할 때 암시 적으로 호출됩니다 . . 이것은 <a href="yii-web-cookiecollection#add()-detail">add ()</a> 와 동일합니다 .

source: This method is required by the SPL interface <a href="http://www.php.net/class.arrayaccess">ArrayAccess</a>. It is implicitly called when you use something like <code>$collection[$name] = $header;</code>. This is equivalent to <a href="yii-web-headercollection#add()-detail">add()</a>.
ko: 이 메소드는 SPL 인터페이스 <a href="http://www.php.net/class.arrayaccess">ArrayAccess에</a> 필요합니다 . <code>$collection[$name] = $header;</code> 와 같은 것을 사용할 때 암시 적으로 호출됩니다 . . 이것은 <a href="yii-web-headercollection#add()-detail">add ()</a> 와 동일합니다 .

source: This method is required by the SPL interface <a href="http://www.php.net/class.arrayaccess">ArrayAccess</a>. It is implicitly called when you use something like <code>$cookie = $collection[$name];</code>. This is equivalent to <a href="yii-web-cookiecollection#get()-detail">get()</a>.
ko: 이 메소드는 SPL 인터페이스 <a href="http://www.php.net/class.arrayaccess">ArrayAccess에</a> 필요합니다 . <code>$cookie = $collection[$name];</code> 과 같은 것을 사용할 때 암시 적으로 호출됩니다 . . 이것은 <a href="yii-web-cookiecollection#get()-detail">get ()</a> 과 동일합니다 .

source: This method is required by the SPL interface <a href="http://www.php.net/class.arrayaccess">ArrayAccess</a>. It is implicitly called when you use something like <code>$header = $collection[$name];</code>. This is equivalent to <a href="yii-web-headercollection#get()-detail">get()</a>.
ko: 이 메소드는 SPL 인터페이스 <a href="http://www.php.net/class.arrayaccess">ArrayAccess에</a> 필요합니다 . <code>$header = $collection[$name];</code> 과 같은 것을 사용할 때 암시 적으로 호출됩니다 . . 이것은 <a href="yii-web-headercollection#get()-detail">get ()</a> 과 동일합니다 .

source: This method is required by the SPL interface <a href="http://www.php.net/class.arrayaccess">ArrayAccess</a>. It is implicitly called when you use something like <code>$model[$offset] = $item;</code>.
ko: 이 메소드는 SPL 인터페이스 <a href="http://www.php.net/class.arrayaccess">ArrayAccess에</a> 필요합니다 . <code>$model[$offset] = $item;</code> 과 같은 것을 사용할 때 암시 적으로 호출됩니다 . .

source: This method is required by the SPL interface <a href="http://www.php.net/class.arrayaccess">ArrayAccess</a>. It is implicitly called when you use something like <code>$value = $model[$offset];</code>.
ko: 이 메소드는 SPL 인터페이스 <a href="http://www.php.net/class.arrayaccess">ArrayAccess에</a> 필요합니다 . <code>$value = $model[$offset];</code> 같은 것을 사용할 때 암시 적으로 호출됩니다 . .

source: This method is required by the SPL interface <a href="http://www.php.net/class.arrayaccess">ArrayAccess</a>. It is implicitly called when you use something like <code>isset($collection[$name])</code>.
ko: 이 메소드는 SPL 인터페이스 <a href="http://www.php.net/class.arrayaccess">ArrayAccess에</a> 필요합니다 . <code>isset($collection[$name])</code> 과 같은 것을 사용할 때 암시 적으로 호출됩니다 .

source: This method is required by the SPL interface <a href="http://www.php.net/class.arrayaccess">ArrayAccess</a>. It is implicitly called when you use something like <code>isset($model[$offset])</code>.
ko: 이 메소드는 SPL 인터페이스 <a href="http://www.php.net/class.arrayaccess">ArrayAccess에</a> 필요합니다 . <code>isset($model[$offset])</code> 과 같은 것을 사용할 때 암시 적으로 호출됩니다 .

source: This method is required by the SPL interface <a href="http://www.php.net/class.arrayaccess">ArrayAccess</a>. It is implicitly called when you use something like <code>unset($collection[$name])</code>. This is equivalent to <a href="yii-web-cookiecollection#remove()-detail">remove()</a>.
ko: 이 메소드는 SPL 인터페이스 <a href="http://www.php.net/class.arrayaccess">ArrayAccess에</a> 필요합니다 . <code>unset($collection[$name])</code> 과 같은 것을 사용할 때 암시 적으로 호출됩니다 . 이것은 <a href="yii-web-cookiecollection#remove()-detail">remove ()</a> 와 동일합니다 .

source: This method is required by the SPL interface <a href="http://www.php.net/class.arrayaccess">ArrayAccess</a>. It is implicitly called when you use something like <code>unset($collection[$name])</code>. This is equivalent to <a href="yii-web-headercollection#remove()-detail">remove()</a>.
ko: 이 메소드는 SPL 인터페이스 <a href="http://www.php.net/class.arrayaccess">ArrayAccess에</a> 필요합니다 . <code>unset($collection[$name])</code> 과 같은 것을 사용할 때 암시 적으로 호출됩니다 . 이것은 <a href="yii-web-headercollection#remove()-detail">remove ()</a> 와 동일합니다 .

source: This method is required by the SPL interface <a href="http://www.php.net/class.arrayaccess">ArrayAccess</a>. It is implicitly called when you use something like <code>unset($model[$offset])</code>.
ko: 이 메소드는 SPL 인터페이스 <a href="http://www.php.net/class.arrayaccess">ArrayAccess에</a> 필요합니다 . <code>unset($model[$offset])</code> 과 같은 것을 사용할 때 암시 적으로 호출됩니다 .

source: This method is required by the SPL interface <a href="http://www.php.net/class.iteratoraggregate">IteratorAggregate</a>. It will be implicitly called when you use <code>foreach</code> to traverse the collection.
ko: 이 메소드는 SPL 인터페이스 <a href="http://www.php.net/class.iteratoraggregate">IteratorAggregate에</a> 필요합니다 . <code>foreach</code> 를 사용 하여 컬렉션을 탐색 할 때 암시 적으로 호출됩니다 .

source: This method is required by the interface <a href="http://www.php.net/class.arrayaccess">ArrayAccess</a>.
ko: 이 메소드는 <a href="http://www.php.net/class.arrayaccess">ArrayAccess</a> 인터페이스에 필요합니다 .

source: This method is required by the interface <a href="http://www.php.net/class.countable">Countable</a>.
ko: 이 메소드는 <a href="http://www.php.net/class.countable">Countable</a> 인터페이스에 필요합니다 .

source: This method is required by the interface <a href="http://www.php.net/class.iterator">Iterator</a>.
ko: 이 메소드는 <a href="http://www.php.net/class.iterator">Iterator</a> 인터페이스에 필요합니다 .

source: The prefix for automatically generated query binding parameters.
ja: 自動生成されたクエリバインディングパラメータの接頭辞。
ru: Префикс автоматически генерируемых параметров привязки запросов.

source: The prefix for the key used to store <a href="yii-authclient-openidconnect#%24configParams-detail">$configParams</a> data in cache.
ja: <a href="yii-authclient-openidconnect#%24configParams-detail">$ configParams</a>データをキャッシュに格納するために使用されるキーのプレフィックス。
ru: Префикс ключа, используемого для хранения данных <a href="yii-authclient-openidconnect#%24configParams-detail">$ configParams</a> в кеше.

source: The prefix for the key used to store <a href="yii-authclient-openidconnect#%24configParams-detail">$configParams</a> data in cache. Actual cache key will be formed addition <a href="yii-authclient-clientinterface#%24id-detail">$id</a> value to it.
ja: <a href="yii-authclient-openidconnect#%24configParams-detail">$ configParams</a>データをキャッシュに格納するために使用されるキーのプレフィックス。実際のキャッシュキーは、それに<a href="yii-authclient-clientinterface#%24id-detail">$ id</a>値が追加されて形成されます。
ru: Префикс ключа, используемого для хранения данных <a href="yii-authclient-openidconnect#%24configParams-detail">$ configParams</a> в кеше. Фактический ключ кеша будет сформирован добавлением к нему значения <a href="yii-authclient-clientinterface#%24id-detail">$ id</a> .

source: The prefix for the pattern part of every rule declared in <a href="yii-web-groupurlrule#%24rules-detail">$rules</a>.
ja: <a href="yii-web-groupurlrule#%24rules-detail">$ rulesで</a>宣言されたすべてのルールのパターン部分の接頭辞。
ru: Префикс для части шаблона каждого правила, объявленного в <a href="yii-web-groupurlrule#%24rules-detail">$ rules</a> .

source: The prefix for the pattern part of every rule declared in <a href="yii-web-groupurlrule#%24rules-detail">$rules</a>. The prefix and the pattern will be separated with a slash.
ja: <a href="yii-web-groupurlrule#%24rules-detail">$ rulesで</a>宣言されたすべてのルールのパターン部分の接頭辞。接頭辞とパターンはスラッシュで区切られます。
ru: Префикс для части шаблона каждого правила, объявленного в <a href="yii-web-groupurlrule#%24rules-detail">$ rules</a> . Префикс и образец будут разделены косой чертой.

source: The prefix for the route part of every rule declared in <a href="yii-web-groupurlrule#%24rules-detail">$rules</a>.
ja: <a href="yii-web-groupurlrule#%24rules-detail">$ rulesで</a>宣言されたすべてのルールのルート部分のプレフィックス。
ru: Префикс для части маршрута каждого правила, объявленного в <a href="yii-web-groupurlrule#%24rules-detail">$ rules</a> .

source: The prefix for the route part of every rule declared in <a href="yii-web-groupurlrule#%24rules-detail">$rules</a>. The prefix and the route will be separated with a slash. If this property is not set, it will take the value of <a href="yii-web-groupurlrule#%24prefix-detail">$prefix</a>.
ja: <a href="yii-web-groupurlrule#%24rules-detail">$ rulesで</a>宣言されたすべてのルールのルート部分のプレフィックス。接頭辞とルートはスラッシュで区切られます。このプロパティが設定されていない場合は、<a href="yii-web-groupurlrule#%24prefix-detail">$ prefixの</a>値を取ります。
ru: Префикс для части маршрута каждого правила, объявленного в <a href="yii-web-groupurlrule#%24rules-detail">$ rules</a> . Префикс и маршрут будут разделены косой чертой. Если это свойство не установлено, оно принимает значение <a href="yii-web-groupurlrule#%24prefix-detail">префикса $</a> .

source: The prefix string
ja: プレフィックス文字列
ru: Префиксная строка

source: The prefix to apply to all AR keys
ja: すべてのARキーに適用される接頭辞
ru: Префикс,применяемый ко всем клавишам AR

source: The prefix to the automatically generated widget IDs.
ja: 自動生成されたウィジェットIDの接頭辞。
ru: Префикс к автоматически генерируемым идентификаторам виджетов.

source: The pretty URL format uses the extra path following the entry script name to represent the route and the associated query parameters. For example, the extra path in the URL <code>/index.php/post/100</code> is <code>/post/100</code> which may represent the route <code>post/view</code> and the <code>id</code> query parameter <code>100</code> with a proper <a href="yii-web-urlmanager#%24rules-detail">URL rule</a>. To use the pretty URL format, you will need to design a set of <a href="yii-web-urlmanager#%24rules-detail">URL rules</a> according to the actual requirement about how the URLs should look like.
ja: pretty URL形式では、エントリスクリプト名に続く追加のパスを使用して、ルートと関連するクエリパラメータを表します。たとえば、URL <code>/index.php/post/100</code> の追加パスは <code>/post/100</code> であり、適切な<a href="yii-web-urlmanager#%24rules-detail">URLルール</a>を使用して、 <code>post/view</code> ルートと <code>id</code> クエリパラメータ <code>100</code> を表すことができます。Pretty URL形式を使用するには、URLの外観に関する実際の要件に従って、一連の<a href="yii-web-urlmanager#%24rules-detail">URLルール</a>を設計する必要があります。
ru: В красивом формате URL для представления маршрута и связанных параметров запроса используется дополнительный путь, следующий за именем сценария входа. Например, дополнительный путь в URL-адресе <code>/index.php/post/100</code> - <code>/post/100</code> , который может представлять маршрут <code>post/view</code> и параметр запроса <code>100</code> <code>id</code> с правильным <a href="yii-web-urlmanager#%24rules-detail">правилом URL-адреса</a> . Чтобы использовать красивый формат URL-адреса, вам нужно будет разработать набор <a href="yii-web-urlmanager#%24rules-detail">правил URL-адресов в</a> соответствии с фактическими требованиями о том, как должны выглядеть URL-адреса.

source: The previous SQL execution (if any) will be cancelled, and <a href="yii-db-command#%24params-detail">$params</a> will be cleared as well.
ja: 以前のSQL実行（ある場合）はキャンセルされ、<a href="yii-db-command#%24params-detail">$ params</a>もクリアされます。
ru: Предыдущее выполнение SQL (если таковое было) будет отменено, и <a href="yii-db-command#%24params-detail">$ params</a> также будут очищены.

source: The previous example shows how you can use named placeholders. That is, each placeholder is written in the format of <code>{name}</code>, and you provide an associative array whose keys are the placeholder names (without the curly brackets) and whose values are the corresponding values placeholder to be replaced with.
ja: 前の例は、名前付きプレースホルダーの使用方法を示しています。つまり、各プレースホルダーは <code>{name}</code> の形式で記述され、キーがプレースホルダー名（中かっこなし）であり、値が置き換えられる対応する値プレースホルダーである連想配列を提供します。
ru: В предыдущем примере показано, как можно использовать именованные заполнители. То есть каждый заполнитель записывается в формате <code>{name}</code> , и вы предоставляете ассоциативный массив, ключи которого являются именами заполнителей (без фигурных скобок), а значениями являются соответствующие заполнители значений, которые должны быть заменены.

source: The previous exception used for the exception chaining
ja: 例外チェーニングに使用される前回の例外
ru: Предыдущее исключение,использованное для цепочки исключений

source: The previous exception used for the exception chaining.
ja: 例外のチェーニングに使用された前回の例外。
ru: Предыдущее исключение,используемое для цепочки исключений.

source: The primary key (can be composite)
ja: 主キー(合成可能
ru: Основной ключ (может быть составным)

source: The primary key name(s) for this AR class.
ja: このARクラスの主キー名。
ru: Имя (имена)первичного ключа для данного класса AR.

source: The primary key of the model.
ja: モデルのプライマリーキー。
ru: Основной ключ модели.

source: The primary key value.
ja: 主なキーの値。
ru: Первичная ключевая ценность.

source: The primary key value. An array (attribute name =&gt; attribute value) is returned if the primary key is composite or <code>$asArray</code> is true. A string is returned otherwise (<code>null</code> will be returned if the key value is <code>null</code>).
ja: 主キー値。主キーが複合であるか、 <code>$asArray</code> がtrueの場合、配列（属性名=&gt;属性値）が返されます。文字列は、（そうでない場合は返される <code>null</code> がキー値がある場合に返されます <code>null</code> ）。
ru: Значение первичного ключа. Массив (имя атрибута =&gt; значение атрибута) возвращается, если первичный ключ является составным или <code>$asArray</code> истинно. Строка возвращается в противном случае ( <code>null</code> будет возвращен , если значение ключа является <code>null</code> ).

source: The primary key value. An array (column name =&gt; column value) is returned if the primary key is composite or <code>$asArray</code> is <code>true</code>. A string is returned otherwise (null will be returned if the key value is null).
ja: 主キー値。主キーが複合であるか <code>$asArray</code> が <code>true</code> の場合、配列（列名=&gt;列値）が返されます。それ以外の場合は文字列が返されます（キー値がnullの場合はnullが返されます）。
ru: Значение первичного ключа. Массив (имя столбца =&gt; значение столбца) возвращается , если первичный ключ является составным или <code>$asArray</code> является <code>true</code> . В противном случае возвращается строка (будет возвращено значение null, если значение ключа равно null).

source: The primary keys of the associated Mongo collection.
ja: 関連する Mongo コレクションの主キー。
ru: Первичные ключи соответствующей коллекции Mongo.

source: The primary keys of the associated Sphinx index.
ja: 関連するSphinxインデックスの主キーです。
ru: Первичные ключи ассоциированного индекса Сфинкса.

source: The primary keys of the associated database table.
ja: 関連するデータベース・テーブルの主キー。
ru: Первичные ключи соответствующей таблицы БД.

source: The primary keys of this record.
ja: このレコードの主キー。
ru: Основные ключи этой записи.

source: The primary model
ja: プライマリーモデル
ru: Первичная модель

source: The primary model of a relational query.
ja: リレーショナルクエリのプライマリモデル。
ru: Первичная модель реляционного запроса.

source: The primary model of a relational query. This is used only in lazy loading with dynamic query options.
ja: リレーショナルクエリのプライマリモデル。これは、動的なクエリオプションを使用した遅延ロードでのみ使用されます。
ru: Первичная модель реляционного запроса.Используется только при ленивой загрузке с опциями динамического запроса.

source: The primary models (can be either AR instances or arrays)
ja: プライマリモデル(ARインスタンスまたは配列のいずれかである可能性があります
ru: Первичные модели (могут быть как экземплярами AR,так и массивами)

source: The primary way of using forms in Yii is through <a href="yii-widgets-activeform">yii\widgets\ActiveForm</a>. This approach should be preferred when the form is based upon a model. Additionally, there are some useful methods in <a href="yii-helpers-html">yii\helpers\Html</a> that are typically used for adding buttons and help text to any form.
ja: Yiiでフォームを使用する主な方法は、<a href="yii-widgets-activeform">yii \ widgets \ ActiveFormを使用すること</a>です。このアプローチは、フォームがモデルに基づいている場合に推奨されます。さらに、<a href="yii-helpers-html">yii \ helpers \ Html</a>には、フォームにボタンとヘルプテキストを追加するために通常使用されるいくつかの便利なメソッドがあります。
ru: Основной способ использования форм в Yii - через <a href="yii-widgets-activeform">yii \ widgets \ ActiveForm</a> . Этот подход следует предпочесть, когда форма основана на модели. Кроме того, в <a href="yii-helpers-html">yii \ helpers \ Html</a> есть несколько полезных методов , которые обычно используются для добавления кнопок и текста справки в любую форму.

source: The primary-foreign key constraint.
ja: 主キーと外国キーの制約。
ru: Первоначальное ключевое ограничение.
