Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/yii/yii.*.022.xlf
Languages: ja, ko, ru

source: This is similar to <a href="yii-sphinx-command#bindValue()-detail">bindValue()</a> except that it binds multiple values at a time. Note that the SQL data type of each value is determined by its PHP type.
ko: 한 번에 여러 값을 바인딩한다는 점을 제외하면 <a href="yii-sphinx-command#bindValue()-detail">bindValue ()</a> 와 유사합니다 . 각 값의 SQL 데이터 유형은 PHP 유형에 따라 결정됩니다.

source: This is similar to <a href="yii-web-request#%24scriptUrl-detail">$scriptUrl</a> except that it does not include the script file name, and the ending slashes are removed.
ko: 스크립트 파일 이름이 포함되지 않고 슬래시가 제거 <a href="yii-web-request#%24scriptUrl-detail">된다는</a> 점을 제외하면 $ scriptUrl 과 유사합니다 .

source: This is the bulk version of <a href="yii-di-servicelocator#set()-detail">set()</a>. The parameter should be an array whose keys are component IDs and values the corresponding component definitions.
ko: 이것은 대량 버전의 <a href="yii-di-servicelocator#set()-detail">set ()</a> 입니다. 매개 변수는 키가 구성 요소 ID이고 해당 구성 요소 정의 값을 갖는 배열이어야합니다.

source: This is the core framework code of <a href="https://github.com/yiisoft/yii2#readme">Yii 2</a>.
ko: 이것은 <a href="https://github.com/yiisoft/yii2#readme">Yii 2</a> 의 핵심 프레임 워크 코드입니다 .

source: This is the implementation of the method declared in the parent class.
ko: 이것은 부모 클래스에서 선언 된 메소드의 구현입니다.

source: This is the main entrance of an application.
ko: 이것은 응용 프로그램의 주요 입구입니다.

source: This is the main entry of the whole detail view rendering.
ko: 전체 디테일 뷰 렌더링의 주요 항목입니다.

source: This is the main method that child classes should implement. Please refer to <a href="yii-gii-generators-controller-generator#generate()-detail">yii\gii\generators\controller\Generator::generate()</a> as an example on how to implement this method.
ko: 이것은 자식 클래스가 구현해야하는 주요 방법입니다. 이 메소드를 구현하는 방법에 대한 예는 <a href="yii-gii-generators-controller-generator#generate()-detail">yii \ gii \ generators \ controller \ Generator :: generate ()</a> 를 참조하십시오 .

source: This is the opposite of <a href="yii-helpers-basehtml#encode()-detail">encode()</a>.
ko: 이것은 <a href="yii-helpers-basehtml#encode()-detail">encode ()</a> 와 반대입니다 .

source: This is the short form of <a href="yii-i18n-formatter#asSize()-detail">asSize()</a>.
ko: 이것은 <a href="yii-i18n-formatter#asSize()-detail">asSize ()</a> 의 짧은 형식입니다 .

source: This is the single most important property. It allows you to register a list of named components called <a href="guide-structure-application-components">application components</a> that you can use in other places. For example:
ko: 이것이 가장 중요한 단일 속성입니다. 다른 곳에서 사용할 수있는 <a href="guide-structure-application-components">응용 프로그램 구성</a> 요소라는 명명 된 구성 요소 목록을 등록 할 수 있습니다. 예를 들면 다음과 같습니다.

source: This is used for shell completion.
ko: 쉘 완성에 사용됩니다.

source: This is used to construct the UNION clause(s) in a SQL statement.
ko: 이것은 SQL 문에서 UNION 절을 구성하는 데 사용됩니다.

source: This is used to construct the UNION clause(s) in a SQL statement. Each array element is an array of the following structure:
ko: 이것은 SQL 문에서 UNION 절을 구성하는 데 사용됩니다. 각 배열 요소는 다음 구조의 배열입니다.

source: This is useful for creating customized queries, which is described in the next section.
ko: 이는 다음 섹션에서 설명하는 사용자 정의 조회를 작성하는 데 유용합니다.

source: This is valid query that will search for users with empty username and then will drop <code>user</code> table most probably resulting in broken website and data loss (you've set up regular backups, right?).
ko: 이것은 사용자 이름이 비어있는 사용자를 검색하고 <code>user</code> 테이블 을 삭제 하여 웹 사이트가 손상되고 데이터가 손실 되는 유효한 쿼리입니다 (정기 백업을 설정 했습니까?).

source: This logger will be automatically created and applied to underlying \Swift_Mailer instance, if <a href="yii-swiftmailer-mailer#%24enableSwiftMailerLogging-detail">yii\swiftmailer\Mailer::$enableSwiftMailerLogging</a> is enabled. For example:
ko: yii <a href="yii-swiftmailer-mailer#%24enableSwiftMailerLogging-detail">\ swiftmailer \ Mailer :: $ enableSwiftMailerLogging</a> 이 활성화 된 경우이 로거는 자동으로 작성되어 기본 \ Swift_Mailer 인스턴스에 적용됩니다 . 예를 들면 다음과 같습니다.

source: This make sense for the distributed applications, which provides several Auth clients (web and mobile) to avoid triggering Facebook's automated spam systems.
ko: 이는 Facebook의 자동 스팸 시스템을 유발하지 않도록 여러 인증 클라이언트 (웹 및 모바일)를 제공하는 분산 응용 프로그램에 적합합니다.

source: This message source uses single collection for the message translations storage, defined via <a href="yii-mongodb-i18n-mongodbmessagesource#%24collection-detail">$collection</a>. each entry in this collection should have 3 fields:
ko: 이 메시지 소스는 <a href="yii-mongodb-i18n-mongodbmessagesource#%24collection-detail">$ collection을</a> 통해 정의 된 메시지 변환 스토리지에 단일 콜렉션을 사용합니다 . 이 컬렉션의 각 항목에는 3 개의 필드가 있어야합니다.

source: This method accepts an array of the <a href="yii-httpclient-request">yii\httpclient\Request</a> objects and returns an array of the <a href="yii-httpclient-response">yii\httpclient\Response</a> objects. Keys of the response array correspond the ones from request array.
ko: 이 메소드는 <a href="yii-httpclient-request">yii \ httpclient \ Request</a> 오브젝트 의 배열을 승인하고 yii <a href="yii-httpclient-response">\ httpclient \ Response</a> 오브젝트 의 배열을 리턴 합니다. 응답 배열의 키는 요청 배열의 키와 일치합니다.

source: This method achieves the similar functionality as var_dump and print_r but is more robust when handling complex objects such as Yii controllers.
ko: 이 방법은 var_dump 및 print_r과 유사한 기능을 수행하지만 Yii 컨트롤러와 같은 복잡한 객체를 처리 할 때 더욱 강력합니다.

source: This method activates the first tab that is visible and not explicitly set to inactive (<code>'active' =&gt; false</code>).
ko: 이 메소드는 첫 번째 탭을 활성화하고 명시 적으로 비활성 ( <code>'active' =&gt; false</code> ) 으로 설정하지 않은 탭을 활성화합니다 .

source: This method adds a "Location" header to the current response. Note that it does not send out the header until <a href="yii-web-response#send()-detail">send()</a> is called. In a controller action you may use this method as follows:
ko: 이 메소드는 "Location"헤더를 현재 응답에 추가합니다. <a href="yii-web-response#send()-detail">send ()</a> 가 호출 될 때까지 헤더를 보내지 않습니다 . 컨트롤러 작업에서이 방법을 다음과 같이 사용할 수 있습니다.

source: This method allows you to reuse existing relation definitions to perform JOIN queries. Based on the definition of the specified relation(s), the method will append one or multiple JOIN statements to the current query.
ko: 이 방법을 사용하면 기존 관계 정의를 재사용하여 JOIN 쿼리를 수행 할 수 있습니다. 지정된 관계의 정의에 따라 메소드는 하나 이상의 JOIN 문을 현재 조회에 추가합니다.

source: This method attempts to log in a user using the ID and authKey information provided by the <a href="yii-web-user#%24identityCookie-detail">identity cookie</a>.
ko: 이 방법은 <a href="yii-web-user#%24identityCookie-detail">아이디 쿠키에서</a> 제공 한 ID 및 authKey 정보를 사용하여 사용자 로그인을 시도합니다 .

source: This method calculates the difference between now and the timestamp defined by constant <code>YII_BEGIN_TIME</code> which is evaluated at the beginning of <a href="yii-baseyii">yii\BaseYii</a> class file.
ko: 이 메소드 는 <a href="yii-baseyii">yii \ BaseYii</a> 클래스 파일 의 시작 부분에서 평가 되는 상수 <code>YII_BEGIN_TIME</code> 에 의해 정의 된 현재 시간 소인과 현재 시간 소인의 차이를 계산 합니다.

source: This method calls <a href="yii-baseyii#setAlias()-detail">Yii::setAlias()</a> to register the path aliases. This method is provided so that you can define path aliases when configuring a module.
ko: 이 메소드는 <a href="yii-baseyii#setAlias()-detail">Yii :: setAlias ​​()</a> 를 호출 하여 경로 별명을 등록합니다. 이 방법은 모듈을 구성 할 때 경로 별명을 정의 할 수 있도록 제공됩니다.

source: This method can be invoked several times checking different requirement sets. Use <a href="yiirequirementchecker#getResult()-detail">getResult()</a> or <a href="yiirequirementchecker#render()-detail">render()</a> to get the results.
ko: 이 메소드는 여러 요구 사항 세트를 확인하여 여러 번 호출 할 수 있습니다. 사용 <a href="yiirequirementchecker#getResult()-detail">getResult를 ()</a> 또는 <a href="yiirequirementchecker#render()-detail">() 렌더링</a> 결과를 얻을 수 있습니다.

source: This method can be use during request formatting and preparation. Do not use it for the target URL specification, use <a href="yii-httpclient-request#setUrl()-detail">setUrl()</a> instead.
ko: 이 방법은 요청 형식 및 준비 중에 사용할 수 있습니다. 대상 URL 스펙에 사용 하지 말고 대신 <a href="yii-httpclient-request#setUrl()-detail">setUrl ()을</a> 사용하십시오.

source: This method can be used in three different ways:
ko: 이 방법은 세 가지 방법으로 사용할 수 있습니다.

source: This method can be used to break cycle references between <a href="yii-mongodb-database">yii\mongodb\Database</a> and <a href="yii-mongodb-collection">yii\mongodb\Collection</a> instances.
ko: 이 메소드는 <a href="yii-mongodb-database">yii \ mongodb \ Database</a> 와 <a href="yii-mongodb-collection">yii \ mongodb \ Collection</a> 인스턴스 사이의주기 참조를 구분하는 데 사용할 수 있습니다 .

source: This method can be used to convert exceptions inside of methods like <code>__toString()</code> to PHP errors because exceptions cannot be thrown inside of them.
ko: 이 메소드는 예외를 <code>__toString()</code> 과 같은 메소드 내부 에서 PHP 오류 로 변환하는 데 사용할 수 있습니다. 예외는 예외를 처리 할 수 ​​없기 때문입니다.

source: This method can be used to implement nested layout. For example, a layout can be embedded in another layout file specified as '@app/views/layouts/base.php' like the following:
ko: 이 방법을 사용하면 중첩 레이아웃을 구현할 수 있습니다. 예를 들어, 레이아웃은 다음과 같이 '@ app / views / layouts / base.php'로 지정된 다른 레이아웃 파일에 임베드 될 수 있습니다.

source: This method can be used to implement similar functionality as provided by <a href="yii-di-container#invoke()-detail">invoke()</a> in other components.
ko: 이 메소드는 다른 컴포넌트에서 <a href="yii-di-container#invoke()-detail">invoke ()</a> 가 제공하는 것과 유사한 기능을 구현하는 데 사용할 수 있습니다 .

source: This method can be used to set the isolation level while the transaction is already active. However this is not supported by all DBMS so you might rather specify the isolation level directly when calling <a href="yii-db-transaction#begin()-detail">begin()</a>.
ko: 이 방법을 사용하면 트랜잭션이 이미 활성화되어있는 동안 격리 수준을 설정할 수 있습니다. 그러나 이것은 모든 DBMS에서 지원되지 않으므로 <a href="yii-db-transaction#begin()-detail">begin ()을</a> 호출 할 때 격리 수준을 직접 지정할 수 있습니다 .

source: This method can invoked several times before <a href="yii-mongodb-file-upload#complete()-detail">complete()</a> is called.
ko: <a href="yii-mongodb-file-upload#complete()-detail">complete ()</a> 를 호출 하기 전에이 메소드를 여러 번 호출 할 수 있습니다 .

source: This method can only be invoked at the beginning of the constructor.
ko: 이 메소드는 생성자 시작시에만 호출 할 수 있습니다.

source: This method cleans up all cached index schemas so that they can be re-created later to reflect the Sphinx schema change.
ko: 이 방법은 캐시 된 모든 인덱스 스키마를 정리하여 나중에 스핑크스 스키마 변경 사항을 반영하기 위해 다시 만들 수 있도록합니다.

source: This method cleans up all cached table schemas so that they can be re-created later to reflect the database schema change.
ko: 이 메소드는 캐시 된 모든 테이블 스키마를 정리하여 나중에 데이터베이스 스키마 변경 사항을 반영하기 위해 다시 작성할 수 있도록합니다.

source: This method cleans up cached table schema so that it can be re-created later to reflect the database schema change.
ko: 이 메소드는 캐시 된 테이블 스키마를 정리하여 나중에 데이터베이스 스키마 변경 사항을 반영하기 위해 다시 작성할 수 있도록합니다.

source: This method contains the logic to be executed when applying this migration.
ko: 이 방법에는이 마이그레이션을 적용 할 때 실행할 논리가 포함됩니다.

source: This method contains the logic to be executed when removing this migration.
ko: 이 방법에는이 마이그레이션을 제거 할 때 실행할 논리가 포함되어 있습니다.

source: This method converts the result <a href="yii-helpers-basehtml#getInputName()-detail">getInputName()</a> into a valid input ID. For example, if <a href="yii-helpers-basehtml#getInputName()-detail">getInputName()</a> returns <code>Post[content]</code>, this method will return <code>post-content</code>.
ko: 이 메소드는 결과 <a href="yii-helpers-basehtml#getInputName()-detail">getInputName ()</a> 을 유효한 입력 ID로 변환합니다 . 예를 들어, <a href="yii-helpers-basehtml#getInputName()-detail">getInputName ()</a> 이 <code>Post[content]</code> 를 반환하면이 메소드는 <code>post-content</code> 를 반환 합니다 .

source: This method could be overridden by child classes to define available attributes. Note: all attributes defined in base Active Record class should be always present in returned array. For example:
ko: 이 메소드는 사용 가능한 속성을 정의하기 위해 하위 클래스로 대체 될 수 있습니다. 참고 : 기본 Active Record 클래스에 정의 된 모든 속성은 항상 반환 된 배열에 있어야합니다. 예를 들면 다음과 같습니다.

source: This method creates an instance of the calling class setting the MODE_BEGIN mode. Any item between <a href="yii-jui-selectable#begin()-detail">begin()</a> and <a href="yii-base-widget#end()-detail">end()</a> which match the filter attribute, will be selectable. It will apply the configuration to the created instance. A matching <a href="yii-base-widget#end()-detail">end()</a> call should be called later. As some widgets may use output buffering, the <a href="yii-base-widget#end()-detail">end()</a> call should be made in the same view to avoid breaking the nesting of output buffers.
ko: 이 메소드는 MODE_BEGIN 모드를 설정하는 호출 클래스의 인스턴스를 작성합니다. 필터 속성과 일치하는 <a href="yii-jui-selectable#begin()-detail">begin ()</a> 과 <a href="yii-base-widget#end()-detail">end ()</a> 사이의 모든 항목을 선택할 수 있습니다. 생성 된 인스턴스에 구성을 적용합니다. 일치하는 <a href="yii-base-widget#end()-detail">end ()</a> 호출은 나중에 호출해야합니다. 일부 위젯은 출력 버퍼링을 사용할 수 있으므로 <a href="yii-base-widget#end()-detail">end ()</a> 호출은 출력 버퍼의 중첩을 중단하지 않도록 동일한보기에서 이루어져야합니다.

source: This method creates an instance of the calling class. It will apply the configuration to the created instance. A matching <a href="yii-base-widget#end()-detail">end()</a> call should be called later. As some widgets may use output buffering, the <a href="yii-base-widget#end()-detail">end()</a> call should be made in the same view to avoid breaking the nesting of output buffers.
ko: 이 메소드는 호출 클래스의 인스턴스를 작성합니다. 생성 된 인스턴스에 구성을 적용합니다. 일치하는 <a href="yii-base-widget#end()-detail">end ()</a> 호출은 나중에 호출해야합니다. 일부 위젯은 출력 버퍼링을 사용할 수 있으므로 <a href="yii-base-widget#end()-detail">end ()</a> 호출은 출력 버퍼의 중첩을 중단하지 않도록 동일한보기에서 이루어져야합니다.

source: This method defines the attribute that uniquely identifies a record.
ko: 이 방법은 레코드를 고유하게 식별하는 속성을 정의합니다.

source: This method differs from <a href="yii-base-controller#render()-detail">render()</a> in that it does not apply any layout.
ko: 이 메소드는 레이아웃을 적용하지 않는다는 점에서 <a href="yii-base-controller#render()-detail">render ()</a> 와 다릅니다 .

source: This method differs from <a href="yii-base-model#getActiveValidators()-detail">getActiveValidators()</a> in that the latter only returns the validators applicable to the current <a href="yii-base-model#%24scenario-detail">$scenario</a>.
ko: 이 메소드는 <a href="yii-base-model#getActiveValidators()-detail">getActiveValidators ()</a> 와 다릅니다 . 후자는 현재 <a href="yii-base-model#%24scenario-detail">$ scenario에</a> 적용 가능한 유효성 검증기만 리턴합니다 .

source: This method differs from <a href="yii-db-activequerytrait#with()-detail">with()</a> in that it will build up and execute a JOIN SQL statement for the primary table. And when <code>$eagerLoading</code> is true, it will call <a href="yii-db-activequerytrait#with()-detail">with()</a> in addition with the specified relations.
ko: 이 메소드는 기본 테이블에 대해 JOIN SQL 문을 빌드하고 실행한다는 점에서 <a href="yii-db-activequerytrait#with()-detail">with ()와</a> 다릅니다 . 그리고 <code>$eagerLoading</code> 이 true이면 지정된 관계와 함께 <a href="yii-db-activequerytrait#with()-detail">with ()</a> 를 호출 합니다.

source: This method differs from <a href="yii-db-migration#down()-detail">down()</a> in that the DB logic implemented here will be enclosed within a DB transaction. Child classes may implement this method instead of <a href="yii-db-migration#down()-detail">down()</a> if the DB logic needs to be within a transaction.
ko: 이 메소드는 여기서 구현 된 DB 로직이 DB 트랜잭션 내에 포함된다는 점에서 <a href="yii-db-migration#down()-detail">down ()</a> 과 다릅니다 . DB 로직이 트랜잭션 내에 있어야하는 경우 하위 클래스는 <a href="yii-db-migration#down()-detail">down ()</a> 대신이 메소드를 구현할 수 있습니다 .

source: This method differs from <a href="yii-db-migration#up()-detail">up()</a> in that the DB logic implemented here will be enclosed within a DB transaction. Child classes may implement this method instead of <a href="yii-db-migration#up()-detail">up()</a> if the DB logic needs to be within a transaction.
ko: 이 메소드는 여기서 구현 된 DB 로직이 DB 트랜잭션 내에 포함된다는 점에서 <a href="yii-db-migration#up()-detail">up ()</a> 과 다릅니다 . DB 로직이 트랜잭션 내에 있어야하는 경우 하위 클래스는 <a href="yii-db-migration#up()-detail">up ()</a> 대신이 메소드를 구현할 수 있습니다 .

source: This method displays the view requested by the user.
ko: 이 방법은 사용자가 요청한보기를 표시합니다.

source: This method does not perform any publishing. It merely tells you if the file or directory is published, where it will go.
ko: 이 방법은 게시를 수행하지 않습니다. 파일이나 디렉토리가 게시되었는지 어디로 갈지를 알려줍니다.

source: This method does not perform any publishing. It merely tells you if the file path is published, what the URL will be to access it.
ko: 이 방법은 게시를 수행하지 않습니다. 파일 경로가 게시되었는지, 액세스 할 URL이 무엇인지 알려줍니다.

source: This method does nothing in this class.
ko: 이 메소드는이 클래스에서 아무 것도 수행하지 않습니다.

source: This method does the same as the PHP function <a href="http://php.net/manual/en/function.in-array.php">in_array()</a> but additionally works for objects that implement the <a href="http://www.php.net/class.traversable">Traversable</a> interface.
ko: 이 메소드는 PHP 함수 <a href="http://php.net/manual/en/function.in-array.php">in_array ()</a> 와 동일 하지만 <a href="http://www.php.net/class.traversable">Traversable</a> 인터페이스 를 구현하는 객체에 추가로 작동합니다 .

source: This method does the same as the PHP function <a href="http://php.net/manual/en/function.is-array.php">is_array()</a> but additionally works on objects that implement the <a href="http://www.php.net/class.traversable">Traversable</a> interface.
ko: 이 메소드는 PHP 함수 <a href="http://php.net/manual/en/function.is-array.php">is_array ()</a> 와 동일 하지만 <a href="http://www.php.net/class.traversable">Traversable</a> 인터페이스 를 구현하는 객체에서 추가로 작동합니다 .

source: This method enhances the <code>array_key_exists()</code> function by supporting case-insensitive key comparison.
ko: 이 메소드는 대소 문자를 구분하지 않는 키 비교를 지원 하여 <code>array_key_exists()</code> 함수를 향상시킵니다 .

source: This method ensures the string is treated as a byte array by using <code>mb_strlen()</code>.
ko: 이 메소드는 <code>mb_strlen()</code> 을 사용하여 문자열이 바이트 배열로 취급되도록합니다 .

source: This method ensures the string is treated as a byte array by using <code>mb_substr()</code>.
ko: 이 메소드는 <code>mb_substr()</code> 을 사용하여 문자열이 바이트 배열로 처리되도록합니다 .

source: This method executes the specified SQL statement using <a href="yii-db-migration#%24db-detail">$db</a>.
ko: 이 메소드는 <a href="yii-db-migration#%24db-detail">$ db를</a> 사용하여 지정된 SQL 문을 실행합니다 .

source: This method executes the validation rules applicable to the current <a href="yii-base-model#%24scenario-detail">$scenario</a>. The following criteria are used to determine whether a rule is currently applicable:
ko: 이 방법은 현재 <a href="yii-base-model#%24scenario-detail">$ scenario에</a> 적용 가능한 유효성 검사 규칙을 실행합니다 . 다음 기준은 규칙이 현재 적용 가능한지 여부를 결정하는 데 사용됩니다.

source: This method generates a name that can be used as the input name to collect user input for the specified attribute. The name is generated according to the <a href="yii-base-model#formName()-detail">form name</a> of the model and the given attribute name. For example, if the form name of the <code>Post</code> model is <code>Post</code>, then the input name generated for the <code>content</code> attribute would be <code>Post[content]</code>.
ko: 이 메소드는 지정된 속성에 대한 사용자 입력을 수집하기 위해 입력 이름으로 사용할 수있는 이름을 생성합니다. 이름은 모델 의 <a href="yii-base-model#formName()-detail">양식 이름</a> 과 지정된 속성 이름 에 따라 생성됩니다 . 예를 들어, <code>Post</code> 모델 의 양식 이름 이 <code>Post</code> 인 경우 <code>content</code> 속성에 대해 생성 된 입력 이름 은 <code>Post[content]</code> 입니다.

source: This method has no effect in Elasticsearch ActiveRecord.
ko: 이 방법은 Elasticsearch ActiveRecord에 영향을 미치지 않습니다.

source: This method has no effect when session is not <a href="yii-web-session#getIsActive()-detail">active</a>. Make sure to call <a href="yii-web-session#open()-detail">open()</a> before calling it.
ko: 이 방법은 세션이 <a href="yii-web-session#getIsActive()-detail">활성화</a> 되지 않은 경우 효과가 없습니다 . 전화를해야합니다 <a href="yii-web-session#open()-detail">() 공개</a> 를 호출하기 전에.

source: This method implements the load balancing among the given list of the servers. Connections will be tried in random order.
ko: 이 방법은 주어진 서버 목록간에로드 밸런싱을 구현합니다. 연결은 무작위 순서로 시도됩니다.

source: This method implements the load balancing among the given list of the servers. Connections will be tried in sequential order.
ko: 이 방법은 주어진 서버 목록간에로드 밸런싱을 구현합니다. 연결은 순차적으로 시도됩니다.

source: This method includes the view file as a PHP script and captures the display result if required.
ko: 이 방법은보기 파일을 PHP 스크립트로 포함하고 필요한 경우 표시 결과를 캡처합니다.

source: This method is a shortcut for sending data formatted as JSON. It will return the <a href="yii-web-application#getResponse()-detail">response</a> application component after configuring the <a href="yii-web-response#%24format-detail">format</a> and setting the <a href="yii-web-response#%24data-detail">data</a> that should be formatted. A common usage will be:
ko: 이 방법은 JSON 형식의 데이터를 전송하기위한 바로 가기입니다. <a href="yii-web-response#%24format-detail">형식</a> 을 구성하고 형식 을 지정 해야하는 <a href="yii-web-response#%24data-detail">데이터</a> 를 설정 한 후 <a href="yii-web-application#getResponse()-detail">응답</a> 응용 프로그램 구성 요소를 반환합니다 . 일반적인 사용법은 다음과 같습니다.

source: This method is a shortcut for sending data formatted as XML. It will return the <a href="yii-web-application#getResponse()-detail">response</a> application component after configuring the <a href="yii-web-response#%24format-detail">format</a> and setting the <a href="yii-web-response#%24data-detail">data</a> that should be formatted. A common usage will be:
ko: 이 방법은 XML 형식의 데이터를 전송하기위한 바로 가기입니다. <a href="yii-web-response#%24format-detail">형식</a> 을 구성하고 형식 을 지정 해야하는 <a href="yii-web-response#%24data-detail">데이터</a> 를 설정 한 후 <a href="yii-web-application#getResponse()-detail">응답</a> 응용 프로그램 구성 요소를 반환합니다 . 일반적인 사용법은 다음과 같습니다.

source: This method is a shortcut to <a href="yii-db-baseactiverecord#update()-detail">update()</a> when data validation is not needed and only a small set attributes need to be updated.
ko: 이 메소드는 데이터 유효성 검사가 필요하지 않고 작은 집합 속성 만 업데이트해야 할 때 <a href="yii-db-baseactiverecord#update()-detail">update ()</a> 의 바로 가기 입니다.

source: This method is a shortcut to <a href="yii-web-response#redirect()-detail">yii\web\Response::redirect()</a>.
ko: 이 메소드는 <a href="yii-web-response#redirect()-detail">yii \ web \ Response :: redirect ()</a> 의 단축키 입니다.

source: This method is a shortcut to <a href="yii-web-response#refresh()-detail">yii\web\Response::refresh()</a>.
ko: 이 메소드는 <a href="yii-web-response#refresh()-detail">yii \ web \ Response :: refresh ()</a> 의 바로 가기 입니다.

source: This method is a shortcut to beginning <a href="yii-widgets-block">yii\widgets\Block</a>
ko: 이 방법은 <a href="yii-widgets-block">yii \ widgets \ Block</a> 을 시작하는 바로 가기입니다.

source: This method is also called by <a href="yii-db-baseactiverecord#hasOne()-detail">yii\db\BaseActiveRecord::hasOne()</a> and <a href="yii-db-baseactiverecord#hasMany()-detail">yii\db\BaseActiveRecord::hasMany()</a> to create a relational query.
ko: 이 메소드는 <a href="yii-db-baseactiverecord#hasOne()-detail">yii \ db \ BaseActiveRecord :: hasOne ()</a> 및 <a href="yii-db-baseactiverecord#hasMany()-detail">yii \ db \ BaseActiveRecord :: hasMany ()</a> 에 의해 호출되어 관계형 쿼리를 작성합니다.

source: This method is also called by \yii\mongodb\file\BaseActiveRecord::hasOne() and \yii\mongodb\file\BaseActiveRecord::hasMany() to create a relational query.
ko: 이 메소드는 \ yii \ mongodb \ file \ BaseActiveRecord :: hasOne () 및 \ yii \ mongodb \ file \ BaseActiveRecord :: hasMany ()에 의해 호출되어 관계형 쿼리를 작성합니다.

source: This method is best used when only a single value is needed for a query.
ko: 이 방법은 쿼리에 단일 값만 필요한 경우에 가장 적합합니다.

source: This method is best used when only the first column of result (i.e. the first element in each row) is needed for a query.
ko: 이 방법은 쿼리에 첫 번째 결과 열 (즉, 각 행의 첫 번째 요소) 만 필요한 경우에 가장 적합합니다.

source: This method is best used when only the first row of result is needed for a query.
ko: 이 방법은 쿼리에 첫 번째 결과 행만 필요한 경우에 가장 적합합니다.
