Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/yii/yii.*.022.xlf
Languages: ja, ko, ru

source: This method is called AFTER all fixture data have been loaded for the current test.
ko: 이 방법은 현재 테스트를 위해 모든 조명기 데이터가로드 된 후에 호출됩니다.

source: This method is called AFTER all fixture data have been unloaded for the current test.
ko: 이 방법을 현재 테스트를 위해 모든 조명기 데이터가 언로드 된 후에 호출합니다.

source: This method is called BEFORE any fixture data is loaded for the current test.
ko: 이 방법은 현재 테스트를 위해 모든 조명기 데이터가로드되기 전에 호출됩니다.

source: This method is called BEFORE any fixture data is unloaded for the current test.
ko: 이 방법은 현재 테스트를 위해 모든 조명기 데이터가 언로드되기 전에 호출됩니다.

source: This method is called after every test method finishes. You may override this method to perform necessary cleanup work for the fixture.
ko: 이 메소드는 모든 테스트 메소드가 완료된 후에 호출됩니다. 픽스처에 필요한 정리 작업을 수행하기 위해이 방법을 재정의 할 수 있습니다.

source: This method is called after the module is created and initialized with property values given in configuration. The default implementation will initialize <a href="yii-base-application#%24controllerNamespace-detail">$controllerNamespace</a> if it is not set.
ko: 이 메소드는 모듈이 작성되고 구성에 제공된 특성 값으로 초기화 된 후에 호출됩니다. 기본 구현은 설정되지 않은 경우 <a href="yii-base-application#%24controllerNamespace-detail">$ controllerNamespace</a> 를 초기화 합니다.

source: This method is called after the module is created and initialized with property values given in configuration. The default implementation will initialize <a href="yii-base-module#%24controllerNamespace-detail">$controllerNamespace</a> if it is not set.
ko: 이 메소드는 모듈이 작성되고 구성에 제공된 특성 값으로 초기화 된 후에 호출됩니다. 기본 구현은 설정되지 않은 경우 <a href="yii-base-module#%24controllerNamespace-detail">$ controllerNamespace</a> 를 초기화 합니다.

source: This method is called after the module is created and initialized with property values given in configuration. The default implementation will initialize <a href="yii-debug-module#%24controllerNamespace-detail">$controllerNamespace</a> if it is not set.
ko: 이 메소드는 모듈이 작성되고 구성에 제공된 특성 값으로 초기화 된 후에 호출됩니다. 기본 구현은 설정되지 않은 경우 <a href="yii-debug-module#%24controllerNamespace-detail">$ controllerNamespace</a> 를 초기화 합니다.

source: This method is called after the object is created by cloning an existing one.
ko: 이 메소드는 기존 오브젝트를 복제하여 오브젝트를 작성한 후에 호출됩니다.

source: This method is called after the user is successfully logged in.
ko: 이 메소드는 사용자가 성공적으로 로그인 한 후에 호출됩니다.

source: This method is called at the beginning of inserting or updating a record.
ko: 이 메소드는 레코드 삽입 또는 업데이트 시작시 호출됩니다.

source: This method is called at the beginning of the application constructor. It initializes several important application properties. If you override this method, please make sure you call the parent implementation.
ko: 이 메소드는 애플리케이션 생성자의 시작 부분에서 호출됩니다. 몇 가지 중요한 응용 프로그램 속성을 초기화합니다. 이 메서드를 재정의하는 경우 부모 구현을 호출해야합니다.

source: This method is called at the end of inserting or updating a record.
ko: 이 메소드는 레코드를 삽입하거나 업데이트 할 때 호출됩니다.

source: This method is called at the end of the constructor. The default implementation will trigger an <a href="yii-base-widget#EVENT_INIT-detail">EVENT_INIT</a> event.
ko: 이 메소드는 생성자 끝에서 호출됩니다. 기본 구현은 <a href="yii-base-widget#EVENT_INIT-detail">EVENT_INIT</a> 이벤트를 트리거합니다 .

source: This method is called at the end of the constructor. The default implementation will trigger an <a href="yii-db-activequery#EVENT_INIT-detail">EVENT_INIT</a> event. If you override this method, make sure you call the parent implementation at the end to ensure triggering of the event.
ko: 이 메소드는 생성자 끝에서 호출됩니다. 기본 구현은 <a href="yii-db-activequery#EVENT_INIT-detail">EVENT_INIT</a> 이벤트를 트리거합니다 . 이 메서드를 재정의하는 경우 이벤트가 트리거되도록 마지막에 부모 구현을 호출해야합니다.

source: This method is called at the end of the constructor. The default implementation will trigger an <a href="yii-db-baseactiverecord#EVENT_INIT-detail">EVENT_INIT</a> event. If you override this method, make sure you call the parent implementation at the end to ensure triggering of the event.
ko: 이 메소드는 생성자 끝에서 호출됩니다. 기본 구현은 <a href="yii-db-baseactiverecord#EVENT_INIT-detail">EVENT_INIT</a> 이벤트를 트리거합니다 . 이 메서드를 재정의하는 경우 이벤트가 트리거되도록 마지막에 부모 구현을 호출해야합니다.

source: This method is called at the end of the constructor. The default implementation will trigger an <a href="yii-elasticsearch-activequery#EVENT_INIT-detail">EVENT_INIT</a> event. If you override this method, make sure you call the parent implementation at the end to ensure triggering of the event.
ko: 이 메소드는 생성자 끝에서 호출됩니다. 기본 구현은 <a href="yii-elasticsearch-activequery#EVENT_INIT-detail">EVENT_INIT</a> 이벤트를 트리거합니다 . 이 메서드를 재정의하는 경우 이벤트가 트리거되도록 마지막에 부모 구현을 호출해야합니다.

source: This method is called at the end of the constructor. The default implementation will trigger an <a href="yii-mongodb-activequery#EVENT_INIT-detail">EVENT_INIT</a> event. If you override this method, make sure you call the parent implementation at the end to ensure triggering of the event.
ko: 이 메소드는 생성자 끝에서 호출됩니다. 기본 구현은 <a href="yii-mongodb-activequery#EVENT_INIT-detail">EVENT_INIT</a> 이벤트를 트리거합니다 . 이 메서드를 재정의하는 경우 이벤트가 트리거되도록 마지막에 부모 구현을 호출해야합니다.

source: This method is called at the end of the constructor. The default implementation will trigger an <a href="yii-mongodb-file-activequery#EVENT_INIT-detail">EVENT_INIT</a> event. If you override this method, make sure you call the parent implementation at the end to ensure triggering of the event.
ko: 이 메소드는 생성자 끝에서 호출됩니다. 기본 구현은 <a href="yii-mongodb-file-activequery#EVENT_INIT-detail">EVENT_INIT</a> 이벤트를 트리거합니다 . 이 메서드를 재정의하는 경우 이벤트가 트리거되도록 마지막에 부모 구현을 호출해야합니다.

source: This method is called at the end of the constructor. The default implementation will trigger an <a href="yii-redis-activequery#EVENT_INIT-detail">EVENT_INIT</a> event. If you override this method, make sure you call the parent implementation at the end to ensure triggering of the event.
ko: 이 메소드는 생성자 끝에서 호출됩니다. 기본 구현은 <a href="yii-redis-activequery#EVENT_INIT-detail">EVENT_INIT</a> 이벤트를 트리거합니다 . 이 메서드를 재정의하는 경우 이벤트가 트리거되도록 마지막에 부모 구현을 호출해야합니다.

source: This method is called at the end of the constructor. The default implementation will trigger an <a href="yii-sphinx-activequery#EVENT_INIT-detail">EVENT_INIT</a> event. If you override this method, make sure you call the parent implementation at the end to ensure triggering of the event.
ko: 이 메소드는 생성자 끝에서 호출됩니다. 기본 구현은 <a href="yii-sphinx-activequery#EVENT_INIT-detail">EVENT_INIT</a> 이벤트를 트리거합니다 . 이 메서드를 재정의하는 경우 이벤트가 트리거되도록 마지막에 부모 구현을 호출해야합니다.

source: This method is called before actual query composition, e.g. building cursor, count etc. You may override this method to do some final preparation work before query execution.
ko: 이 메소드는 실제 조회 작성 전에 호출됩니다 (예 : 커서 작성, 계수 등). 조회 실행 전에 최종 준비 작업을 수행하기 위해이 메소드를 대체 할 수 있습니다.

source: This method is called before logging in a user.
ko: 이 메소드는 사용자 로그인 전에 호출됩니다.

source: This method is called before performing every test method. You should override this method with concrete implementation about how to set up the fixture.
ko: 이 메소드는 모든 테스트 메소드를 수행하기 전에 호출됩니다. 조명기를 설정하는 방법에 대한 구체적인 구현으로이 방법을 재정의해야합니다.

source: This method is called before populating fixture data into the collection associated with this fixture.
ko: 이 메소드는 조명기 데이터를이 조명기와 관련된 컬렉션에 채우기 전에 호출됩니다.

source: This method is called before populating fixture data into the index associated with this fixture.
ko: 이 방법은 조명기 데이터를이 조명기와 관련된 인덱스로 채우기 전에 호출됩니다.

source: This method is called before populating fixture data into the table associated with this fixture.
ko: 이 메소드는이 조명기와 관련된 테이블에 조명기 데이터를 채우기 전에 호출됩니다.

source: This method is called by <a href="yii-base-application#init()-detail">init()</a> after the application has been fully configured. If you override this method, make sure you also call the parent implementation.
ko: 이 메소드는 응용 프로그램이 완전히 구성된 후 <a href="yii-base-application#init()-detail">init ()에</a> 의해 호출됩니다 . 이 메소드를 대체하는 경우 상위 구현도 호출해야합니다.

source: This method is called by <a href="yii-behaviors-attributebehavior#evaluateAttributes()-detail">evaluateAttributes()</a>. Its return value will be assigned to the attributes corresponding to the triggering event.
ko: 이 메소드는 <a href="yii-behaviors-attributebehavior#evaluateAttributes()-detail">evaluationAttributes ()에</a> 의해 호출됩니다 . 리턴 값은 트리거 이벤트에 해당하는 속성에 지정됩니다.

source: This method is called by <a href="yii-behaviors-sluggablebehavior#getValue()-detail">getValue()</a> to generate the slug.
ko: 이 메소드는 슬러그를 생성하기 위해 <a href="yii-behaviors-sluggablebehavior#getValue()-detail">getValue ()</a> 에 의해 호출됩니다 .

source: This method is called by <a href="yii-behaviors-sluggablebehavior#getValue()-detail">getValue()</a> when <a href="yii-behaviors-sluggablebehavior#%24ensureUnique-detail">$ensureUnique</a> is true to generate the unique slug.
ko: 이 메소드는 고유 슬러그를 생성하기 위해 <a href="yii-behaviors-sluggablebehavior#%24ensureUnique-detail">$ ensureUnique</a> 가 true 일 때 <a href="yii-behaviors-sluggablebehavior#getValue()-detail">getValue ()에</a> 의해 호출됩니다 .

source: This method is called by <a href="yii-db-connection#open()-detail">open()</a> to establish a DB connection. The default implementation will create a PHP PDO instance. You may override this method if the default PDO needs to be adapted for certain DBMS.
ko: 이 메소드는 <a href="yii-db-connection#open()-detail">open ()</a> 에 의해 호출되어 DB 연결을 설정합니다. 기본 구현은 PHP PDO 인스턴스를 만듭니다. 기본 PDO를 특정 DBMS에 맞게 조정해야하는 경우이 방법을 대체 할 수 있습니다.

source: This method is called by <a href="yii-db-querybuilder">yii\db\QueryBuilder</a> when it starts to build SQL from a query object. You may override this method to do some final preparation work when converting a query into a SQL statement.
ko: 이 메소드는 조회 오브젝트에서 SQL 빌드를 시작할 때 <a href="yii-db-querybuilder">yii \ db \ QueryBuilder에</a> 의해 호출됩니다 . 쿼리를 SQL 문으로 변환 할 때 최종 준비 작업을 수행하기 위해이 방법을 재정의 할 수 있습니다.

source: This method is called by \yii\mongodb\loadData() to get the needed fixture data.
ko: 이 메소드는 필요한 조명기 데이터를 얻기 위해 \ yii \ mongodb \ loadData ()에 의해 호출됩니다.

source: This method is called for each button and each row.
ko: 이 메소드는 각 단추와 각 행에 대해 호출됩니다.

source: This method is called immediately after the wrapper is initialized (f.e. by <code>fopen()</code> and <code>file_get_contents()</code>).
ko: 이 메소드는 랩퍼가 초기화 된 직후 ( <code>fopen()</code> 및 <code>file_get_contents()</code> 의해 fe) 호출 됩니다.

source: This method is called in response to <code>fclose()</code>.
ko: 이 메소드는 <code>fclose()</code> 에 대한 응답으로 호출됩니다 .

source: This method is called in response to <code>feof()</code>.
ko: 이 메소드는 <code>feof()</code> 에 대한 응답으로 호출됩니다 .

source: This method is called in response to <code>fflush()</code> and when the stream is being closed while any unflushed data has been written to it before.
ko: 이 메소드는 <code>fflush()</code> 에 대한 응답으로 플러시 되지 않은 데이터가 이전에 기록 된 상태에서 스트림이 닫힐 때 호출됩니다 .

source: This method is called in response to <code>fread()</code> and <code>fgets()</code>.
ko: 이 메소드는 <code>fread()</code> 및 <code>fgets()</code> 에 대한 응답으로 호출됩니다 .

source: This method is called in response to <code>fseek()</code> to determine the current position.
ko: 이 메소드는 <code>fseek()</code> 에 대한 응답으로 현재 위치를 판별하기 위해 호출됩니다 .

source: This method is called in response to <code>fseek()</code>.
ko: 이 메소드는 <code>fseek()</code> 에 대한 응답으로 호출됩니다 .

source: This method is called in response to <code>fwrite()</code>.
ko: 이 메소드는 <code>fwrite()</code> 에 대한 응답으로 호출됩니다 .

source: This method is called in response to <code>stat()</code>.
ko: 이 메소드는 <code>stat()</code> 에 대한 응답으로 호출됩니다 .

source: This method is called on every page where debugger is enabled.
ko: 이 메소드는 디버거가 사용 가능한 모든 페이지에서 호출됩니다.

source: This method is called right after <code>run()</code> is executed.
ko: 이 메소드는 <code>run()</code> 이 실행 된 직후에 호출 됩니다.

source: This method is called right before <code>run()</code> is executed.
ko: 이 메소드는 <code>run()</code> 이 실행 되기 직전에 호출 됩니다.

source: This method is called to create sub-menus.
ko: 이 메소드는 하위 메뉴를 작성하기 위해 호출됩니다.

source: This method is called together with <a href="yii-db-baseactiverecord#populateRecord()-detail">populateRecord()</a> by <a href="yii-db-activequery">yii\db\ActiveQuery</a>. It is not meant to be used for creating new records directly.
ko: 이 메소드는 <a href="yii-db-activequery">yii \ db \ ActiveQuery에</a> 의해 <a href="yii-db-baseactiverecord#populateRecord()-detail">populateRecord ()</a> 와 함께 호출됩니다 . 새 레코드를 직접 작성하는 데 사용되지는 않습니다.

source: This method is called together with <a href="yii-elasticsearch-activerecord#populateRecord()-detail">populateRecord()</a> by <a href="yii-elasticsearch-activequery">yii\elasticsearch\ActiveQuery</a>. It is not meant to be used for creating new records directly.
ko: 이 메소드는 <a href="yii-elasticsearch-activequery">yii \ elasticsearch \ ActiveQuery에</a> 의해 <a href="yii-elasticsearch-activerecord#populateRecord()-detail">populateRecord ()</a> 와 함께 호출됩니다 . 새 레코드를 직접 작성하는 데 사용되지는 않습니다.

source: This method is called when the AR object is created and populated with the query result.
ko: 이 메소드는 AR 오브젝트가 작성되고 조회 결과로 채워질 때 호출됩니다.

source: This method is called when the AR object is refreshed.
ko: 이 메소드는 AR 오브젝트가 새로 고쳐질 때 호출됩니다.

source: This method is for executing a SQL query that returns result set, such as <code>SELECT</code>.
ko: 이 메소드는 <code>SELECT</code> 와 같은 결과 세트를 리턴하는 SQL 쿼리를 실행하기위한 것 입니다.

source: This method is implemented as a PHP exception handler.
ko: 이 메소드는 PHP 예외 핸들러로 구현됩니다.

source: This method is internally called by <a href="yii-db-baseactiverecord#findOne()-detail">findOne()</a> and <a href="yii-db-baseactiverecord#findAll()-detail">findAll()</a>.
ko: 이 메소드는 내부적으로 <a href="yii-db-baseactiverecord#findOne()-detail">findOne ()</a> 및 <a href="yii-db-baseactiverecord#findAll()-detail">findAll ()에</a> 의해 호출됩니다 .

source: This method is internally called by <a href="yii-mongodb-rbac-mongodbmanager#checkAccess()-detail">checkAccess()</a> when <a href="yii-mongodb-rbac-mongodbmanager#%24cache-detail">$cache</a> is enabled.
ko: 이 메소드는 <a href="yii-mongodb-rbac-mongodbmanager#%24cache-detail">$ cache</a> 가 활성화 된 경우 <a href="yii-mongodb-rbac-mongodbmanager#checkAccess()-detail">checkAccess ()에</a> 의해 내부적으로 호출됩니다 .

source: This method is internally called by <a href="yii-mongodb-rbac-mongodbmanager#checkAccess()-detail">checkAccess()</a>.
ko: 이 메소드는 내부적으로 <a href="yii-mongodb-rbac-mongodbmanager#checkAccess()-detail">checkAccess ()에</a> 의해 호출됩니다 .

source: This method is internally called by <a href="yii-rbac-dbmanager#checkAccess()-detail">checkAccess()</a> when <a href="yii-rbac-dbmanager#%24cache-detail">$cache</a> is enabled.
ko: 이 메소드는 <a href="yii-rbac-dbmanager#%24cache-detail">$ cache</a> 가 활성화 된 경우 <a href="yii-rbac-dbmanager#checkAccess()-detail">checkAccess ()에</a> 의해 내부적으로 호출됩니다 .

source: This method is internally called by <a href="yii-rbac-dbmanager#checkAccess()-detail">checkAccess()</a>.
ko: 이 메소드는 내부적으로 <a href="yii-rbac-dbmanager#checkAccess()-detail">checkAccess ()에</a> 의해 호출됩니다 .

source: This method is internally called by <a href="yii-rbac-phpmanager#checkAccess()-detail">checkAccess()</a>.
ko: 이 메소드는 내부적으로 <a href="yii-rbac-phpmanager#checkAccess()-detail">checkAccess ()에</a> 의해 호출됩니다 .

source: This method is internally used to convert the data fetched from MongoDB into the format as required by this query.
ko: 이 메소드는 MongoDB에서 가져온 데이터를이 쿼리에 필요한 형식으로 변환하는 데 내부적으로 사용됩니다.

source: This method is internally used to convert the data fetched from database into the format as required by this query.
ko: 이 메소드는 데이터베이스에서 가져온 데이터를이 쿼리에 필요한 형식으로 변환하는 데 내부적으로 사용됩니다.

source: This method is internally used.
ko: 이 방법은 내부적으로 사용됩니다.

source: This method is invoked after deleting a record.
ko: 이 메소드는 레코드를 삭제 한 후에 호출됩니다.

source: This method is invoked after the route is created by the route manager.
ko: 이 메소드는 라우트 관리자가 라우트를 작성한 후에 호출됩니다.

source: This method is invoked after validation ends.
ko: 이 메소드는 유효성 검증이 종료 된 후에 호출됩니다.

source: This method is invoked at the end of the constructor after the object is initialized with the given configuration.
ko: 이 메소드는 지정된 구성으로 오브젝트가 초기화 된 후 생성자의 끝에서 호출됩니다.

source: This method is invoked automatically when PHP sees an unknown class. The method will attempt to include the class file according to the following procedure:
ko: 이 메소드는 PHP가 알 수없는 클래스를 볼 때 자동으로 호출됩니다. 이 메소드는 다음 절차에 따라 클래스 파일 포함을 시도합니다.

source: This method is invoked before deleting a record.
ko: 이 메소드는 레코드를 삭제하기 전에 호출됩니다.

source: This method is invoked before validation starts.
ko: 이 메소드는 유효성 검사가 시작되기 전에 호출됩니다.

source: This method is invoked by <a href="yii-base-action">yii\base\Action</a> when it begins to run with the given parameters.
ko: 이 메소드는 주어진 매개 변수로 실행을 시작할 때 <a href="yii-base-action">yii \ base \ Action에</a> 의해 호출됩니다 .

source: This method is invoked by <a href="yii-base-action">yii\base\Action</a> when it begins to run with the given parameters. This method will check the parameter names that the action requires and return the provided parameters according to the requirement. If there is any missing parameter, an exception will be thrown.
ko: 이 메소드는 주어진 매개 변수로 실행을 시작할 때 <a href="yii-base-action">yii \ base \ Action에</a> 의해 호출됩니다 . 이 메소드는 조치에 필요한 매개 변수 이름을 확인하고 요구 사항에 따라 제공된 매개 변수를 리턴합니다. 누락 된 매개 변수가 있으면 예외가 발생합니다.

source: This method is invoked by <a href="yii-base-action">yii\base\Action</a> when it begins to run with the given parameters. This method will first bind the parameters with the <a href="yii-console-controller#options()-detail">options</a> available to the action. It then validates the given arguments.
ko: 이 메소드는 주어진 매개 변수로 실행을 시작할 때 <a href="yii-base-action">yii \ base \ Action에</a> 의해 호출됩니다 . 이 메소드는 먼저 조치에 사용 가능한 <a href="yii-console-controller#options()-detail">옵션으로</a> 매개 변수를 바인드합니다 . 그런 다음 주어진 인수를 확인합니다.

source: This method is invoked by <a href="yii-base-view">yii\base\View</a> whenever it tries to render a view. Child classes must implement this method to render the given view file.
ko: 이 메소드는 뷰를 렌더링하려고 할 때마다 <a href="yii-base-view">yii \ base \ View에</a> 의해 호출됩니다 . 지정된 뷰 파일을 렌더링하려면 하위 클래스가이 메소드를 구현해야합니다.

source: This method is invoked by <a href="yii-web-view">yii\web\View</a> whenever it tries to render a view. Child classes must implement this method to render the given view file.
ko: 이 메소드는 뷰를 렌더링하려고 할 때마다 <a href="yii-web-view">yii \ web \ View에</a> 의해 호출됩니다 . 지정된 뷰 파일을 렌더링하려면 하위 클래스가이 메소드를 구현해야합니다.

source: This method is invoked by cache before writing data into it.
ko: 이 메소드는 데이터를 쓰기 전에 캐시에 의해 호출됩니다.

source: This method is invoked in case of successful authentication via auth client.
ko: 이 메소드는 인증 클라이언트를 통한 인증에 성공한 경우에 호출됩니다.

source: This method is invoked right after <a href="yii-base-view#renderFile()-detail">renderFile()</a> renders a view file.
ko: 이 메소드는 <a href="yii-base-view#renderFile()-detail">renderFile ()</a> 이 뷰 파일을 렌더링 한 직후에 호출 됩니다.

source: This method is invoked right after a user is logged out via <a href="yii-web-user#logout()-detail">logout()</a>.
ko: 이 메소드는 사용자가 <a href="yii-web-user#logout()-detail">logout ()을</a> 통해 로그 아웃 한 직후에 호출됩니다 .

source: This method is invoked right after a widget is executed.
ko: 이 메소드는 위젯이 실행 된 직후에 호출됩니다.

source: This method is invoked right after an action is executed.
ko: 이 메소드는 조치가 실행 된 직후에 호출됩니다.

source: This method is invoked right after an action within this module is executed.
ko: 이 메소드는이 모듈 내의 조치가 실행 된 직후에 호출됩니다.

source: This method is invoked right after mail was send.
ko: 이 메소드는 메일을 보낸 직후에 호출됩니다.

source: This method is invoked right after request is sent.
ko: 이 메소드는 요청이 전송 된 직후에 호출됩니다.

source: This method is invoked right after the DB connection is established. The default implementation triggers an <a href="yii-elasticsearch-connection#EVENT_AFTER_OPEN-detail">EVENT_AFTER_OPEN</a> event.
ko: 이 메소드는 DB 연결이 설정된 직후에 호출됩니다. 기본 구현은 <a href="yii-elasticsearch-connection#EVENT_AFTER_OPEN-detail">EVENT_AFTER_OPEN</a> 이벤트를 트리거합니다 .

source: This method is invoked right after the DB connection is established. The default implementation triggers an <a href="yii-mongodb-connection#EVENT_AFTER_OPEN-detail">EVENT_AFTER_OPEN</a> event.
ko: 이 메소드는 DB 연결이 설정된 직후에 호출됩니다. 기본 구현은 <a href="yii-mongodb-connection#EVENT_AFTER_OPEN-detail">EVENT_AFTER_OPEN</a> 이벤트를 트리거합니다 .

source: This method is invoked right after the DB connection is established. The default implementation triggers an <a href="yii-redis-connection#EVENT_AFTER_OPEN-detail">EVENT_AFTER_OPEN</a> event.
ko: 이 메소드는 DB 연결이 설정된 직후에 호출됩니다. 기본 구현은 <a href="yii-redis-connection#EVENT_AFTER_OPEN-detail">EVENT_AFTER_OPEN</a> 이벤트를 트리거합니다 .

source: This method is invoked right after the DB connection is established. The default implementation turns on <code>PDO::ATTR_EMULATE_PREPARES</code> if <a href="yii-db-connection#%24emulatePrepare-detail">$emulatePrepare</a> is true, and sets the database <a href="yii-db-connection#%24charset-detail">$charset</a> if it is not empty. It then triggers an <a href="yii-db-connection#EVENT_AFTER_OPEN-detail">EVENT_AFTER_OPEN</a> event.
ko: 이 메소드는 DB 연결이 설정된 직후에 호출됩니다. 기본 구현은 <a href="yii-db-connection#%24emulatePrepare-detail">$ emulatePrepare</a> 가 true 인 경우 <code>PDO::ATTR_EMULATE_PREPARES</code> <a href="yii-db-connection#%24charset-detail">$ charset</a> 데이터베이스 가 비어 있지 않은 경우 데이터베이스를 설정합니다 . 그런 다음 <a href="yii-db-connection#EVENT_AFTER_OPEN-detail">EVENT_AFTER_OPEN</a> 이벤트 를 트리거합니다 .

source: This method is invoked right after the response restoring is finished (but before the response is sent).
ko: 이 메소드는 응답 복원이 완료된 직후 (응답이 전송되기 전에) 호출됩니다.

source: This method is invoked right after this request is sent.
ko: 이 메소드는 요청이 전송 된 직후에 호출됩니다.

source: This method is invoked right before <a href="yii-base-view#renderFile()-detail">renderFile()</a> renders a view file.
ko: 이 메소드는 <a href="yii-base-view#renderFile()-detail">renderFile ()</a> 이 뷰 파일을 렌더링 하기 직전에 호출 됩니다.

source: This method is invoked right before an action is executed.
ko: 이 메소드는 조치가 실행되기 직전에 호출됩니다.

source: This method is invoked right before an action is to be executed (after all possible filters.) It checks the existence of the <a href="yii-console-controllers-basemigratecontroller#%24migrationPath-detail">$migrationPath</a>.
ko: 이 메소드는 조치가 실행되기 직전에 (가능한 모든 필터 뒤에서) 호출됩니다. 이는 <a href="yii-console-controllers-basemigratecontroller#%24migrationPath-detail">$ migrationPath</a> 의 존재를 점검합니다 .

source: This method is invoked right before an action is to be executed (after all possible filters.) You may override this method to do last-minute preparation for the action.
ko: 이 메소드는 조치가 실행되기 직전에 (가능한 모든 필터 뒤에서) 호출됩니다. 조치를 막판으로 준비하기 위해이 메소드를 대체 할 수 있습니다.

source: This method is invoked right before an action within this module is executed.
ko: 이 메소드는이 모듈 내의 조치가 실행되기 직전에 호출됩니다.

source: This method is invoked right before mail send.
ko: 이 메소드는 메일을 보내기 직전에 호출됩니다.

source: This method is invoked right before request is sent.
ko: 이 메소드는 요청이 전송되기 직전에 호출됩니다.

source: This method is invoked right before the response caching is to be started.
ko: 이 메소드는 응답 캐싱이 시작되기 직전에 호출됩니다.

source: This method is invoked right before the widget is executed.
ko: 이 메소드는 위젯이 실행되기 직전에 호출됩니다.

source: This method is invoked right before this request is sent.
ko: 이 메소드는이 요청이 전송되기 직전에 호출됩니다.

source: This method is invoked when a relation of an ActiveRecord is being accessed in a lazy fashion.
ko: 이 메소드는 ActiveRecord의 관계가 게으른 방식으로 액세스 될 때 호출됩니다.

source: This method is invoked when an unsafe attribute is being massively assigned.
ko: 이 메소드는 안전하지 않은 속성이 대량으로 할당 될 때 호출됩니다.

source: This method is invoked when calling <a href="yii-web-user#logout()-detail">logout()</a> to log out a user.
ko: 이 메소드는 <a href="yii-web-user#logout()-detail">logout ()</a> 을 호출 하여 사용자를 로그 아웃 할 때 호출됩니다 .
