Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/yii/yii.*.022.xlf
Languages: ja, ko, ru

source: There's another method <code>Url::to()</code> that is very similar to toRoute(). The only difference is that this method requires a route to be specified as an array only. If a string is given, it will be treated as a URL.
ja: toRoute（）によく似た別のメソッド <code>Url::to()</code> があります。唯一の違いは、この方法ではルートを配列としてのみ指定する必要があることです。文字列が指定された場合、それはURLとして扱われます。
ko: toRoute ()와 매우 유사한 또 다른 메소드 <code>Url::to()</code> 가 있습니다. 유일한 차이점은이 방법은 경로를 배열로만 지정해야한다는 것입니다. 문자열이 제공되면 URL로 취급됩니다.
ru: Есть еще один метод <code>Url::to()</code> , очень похожий на toRoute (). Единственная разница в том, что этот метод требует, чтобы маршрут был указан только как массив. Если дана строка, она будет рассматриваться как URL.

source: There's nothing wrong in creating tests covering behavior of existing implementation.
ja: 既存の実装の動作をカバーするテストを作成することには何の問題もありません。
ko: 기존 구현의 동작을 다루는 테스트를 작성하는 데 아무런 문제가 없습니다.
ru: Нет ничего плохого в создании тестов,охватывающих поведение существующей реализации.

source: These <code>$items</code> have to be processed by the different list widgets. The value of the form field (and the current active item) will be automatically set by the current value of the <code>$model</code>'s attribute.
ja: これらの <code>$items</code> は、さまざまなリストウィジェットで処理する必要があります。フォームフィールド（および現在アクティブなアイテム）の値は、 <code>$model</code> の属性の現在の値によって自動的に設定されます。
ko: 이 <code>$items</code> 은 다른 목록 위젯으로 처리해야합니다. 양식 필드의 값 (및 현재 활성 항목)은 <code>$model</code> 속성 의 현재 값에 의해 자동으로 설정됩니다 .
ru: Эти <code>$items</code> должны обрабатываться различными виджетами списка. Значение поля формы (и текущего активного элемента) будет автоматически установлено текущим значением атрибута <code>$model</code> .

source: These <code>other</code>, <code>few</code>, <code>many</code> and other special argument names vary depending on language. To learn which ones you should specify for a particular locale, please refer to "Plural Rules, Cardinal" at <a href="http://intl.rmcreative.ru/">http://intl.rmcreative.ru/</a>. Alternatively you can refer to <a href="http://unicode.org/repos/cldr-tmp/trunk/diff/supplemental/language_plural_rules.html">rules reference at unicode.org</a>.
ja: これらの <code>other</code> 、 <code>few</code> 、 <code>many</code> 、およびその他の特別な引数名は、言語によって異なります。特定のロケールにどのルールを指定する必要があるかについては、<a href="http://intl.rmcreative.ru/">http：</a> //intl.rmcreative.ru/にある「Plural Rules、Cardinal」を参照してください。または<a href="http://unicode.org/repos/cldr-tmp/trunk/diff/supplemental/language_plural_rules.html">、unicode.orgでルールリファレンスを</a>参照することもできます。
ko: 이러한 <code>other</code> , <code>few</code> , <code>many</code> 및 기타 특수 인수 이름은 언어에 따라 다릅니다. 특정 로케일에 대해 지정해야하는 것을 배우려면 <a href="http://intl.rmcreative.ru/">http://intl.rmcreative.ru/의</a> "복수 규칙, 추기경"을 참조하십시오 . 또는 <a href="http://unicode.org/repos/cldr-tmp/trunk/diff/supplemental/language_plural_rules.html">unicode.org에서 규칙 참조를</a> 참조 할 수 있습니다 .
ru: Эти <code>other</code> , <code>few</code> , <code>many</code> и другие специальные имена аргументов различаются в зависимости от языка. Чтобы узнать, какие из них следует указать для конкретной локали, обратитесь к разделу &laquo;Правила множественного числа, кардинал&raquo; на <a href="http://intl.rmcreative.ru/">http://intl.rmcreative.ru/</a> . В качестве альтернативы вы можете обратиться к <a href="http://unicode.org/repos/cldr-tmp/trunk/diff/supplemental/language_plural_rules.html">справке</a> по правилам на unicode.org .

source: These are "escapeable" characters.
ja: これらは「逃げられる」文字です。
ko: 이들은 "탈출 가능한"문자입니다.
ru: Это "спасаемые" персонажи.

source: These are "escapeable" characters. When using one of these prefixed with a backslash, the character will be outputted without the backslash and is not interpreted as markdown.
ja: これらは「エスケープ可能な」文字です。これらのうちの1つをバックスラッシュ付きで使用する場合、その文字はバックスラッシュなしで出力され、マークダウンとして解釈されません。
ko: 이들은 "탈출 가능한"문자입니다. 이 중 하나를 백 슬래시로 접두어로 사용하면 문자가 백 슬래시없이 출력되며 마크 다운으로 해석되지 않습니다.
ru: Это "спасаемые" персонажи.При использовании одного из этих префиксов с обратным слешем,символ будет выводиться без обратного слеша и не будет интерпретироваться как уценка.

source: These are then also available as variables in the view.
ja: これらは、ビュー内の変数としても利用可能です。
ko: 그런 다음 뷰에서 변수로도 사용할 수 있습니다.
ru: Затем они также доступны как переменные в представлении.

source: These can be used in database migrations to define database schema types using a PHP interface. This is useful to define a schema in a DBMS independent way so that the application may run on different DBMS the same way.
ja: これらは、データベースの移行で PHP インターフェイスを使用してデータベーススキーマタイプを定義するために使用することができます。これはDBMSに依存しない方法でスキーマを定義するのに便利です。
ko: 이들은 데이터베이스 마이그레이션에서 PHP 인터페이스를 사용하여 데이터베이스 스키마 유형을 정의하는 데 사용할 수 있습니다. 이는 응용 프로그램이 다른 DBMS에서 동일한 방식으로 실행될 수 있도록 스키마를 DBMS 독립 방식으로 정의하는 데 유용합니다.
ru: Они могут быть использованы при миграции баз данных для определения типов схем баз данных с помощью PHP-интерфейса.Это полезно для самостоятельного определения схемы СУБД,чтобы приложение могло одинаково работать на разных СУБД.

source: These collection are better to be pre-created with search fields indexed.
ja: これらのコレクションは、検索フィールドがインデックス化された状態であらかじめ作成されている方が良いでしょう。
ko: 이러한 콜렉션은 검색 필드를 색인하여 미리 작성하는 것이 좋습니다.
ru: Эти коллекции лучше предварительно создавать с индексированными полями поиска.

source: These data providers mainly vary in the way how the data source is specified. In the following subsections, we will explain the detailed usage of each of these data providers.
ja: これらのデータプロバイダは、主にデータソースの指定方法が異なります。以下のサブセクションでは、これらのデータプロバイダのそれぞれの詳しい使い方を説明します。
ko: 이러한 데이터 공급자는 주로 데이터 소스를 지정하는 방법에 따라 다릅니다. 다음 하위 섹션에서는 이러한 각 데이터 공급자의 자세한 사용법을 설명합니다.
ru: Эти провайдеры данных в основном отличаются друг от друга способом указания источника данных.В следующих подразделах мы подробно опишем использование каждого из этих провайдеров данных.

source: These links are generated using <a href="yii-data-pagination#getLinks()-detail">yii\data\Pagination::getLinks()</a>.
ja: これらのリンクは<a href="yii-data-pagination#getLinks()-detail">yii \ data \ Pagination :: getLinks（）</a>を使用して生成されます。
ko: 이 링크는 <a href="yii-data-pagination#getLinks()-detail">yii \ data \ Pagination :: getLinks ()를</a> 사용하여 생성됩니다 .
ru: Эти ссылки создаются с помощью <a href="yii-data-pagination#getLinks()-detail">yii \ data \ Pagination :: getLinks ()</a> .

source: These logging methods record log messages at various <em>severity levels</em> and <em>categories</em>. They share the same function signature <code>function ($message, $category = 'application')</code>, where <code>$message</code> stands for the log message to be recorded, while <code>$category</code> is the category of the log message. The code in the following example records a trace message under the default category <code>application</code>:
ja: これらのロギングメソッドは、さまざまな<em>重大度レベル</em>と<em>カテゴリ</em>でログメッセージを記録します。それらは同じ関数署名 <code>function ($message, $category = 'application')</code> を共有します。 <code>$message</code> は記録されるログメッセージを表し、 <code>$category</code> はログメッセージのカテゴリです。次の例のコードは、デフォルトのカテゴリ <code>application</code> の下にトレースメッセージを記録します。
ko: 이러한 로깅 방법은 다양한 <em>심각도 수준</em> 및 <em>범주</em> 에서 로그 메시지를 기록합니다 . 동일한 함수 서명 <code>function ($message, $category = 'application')</code> . 여기서 <code>$message</code> 는 기록 될 로그 메시지를 나타내고 <code>$category</code> 는 로그 메시지의 범주입니다. 다음 예제의 코드는 기본 카테고리 <code>application</code> 아래에 추적 메시지를 기록합니다 .
ru: Эти методы ведения журнала записывают сообщения журнала с различными <em>уровнями серьезности</em> и <em>категориями</em> . Они используют одну и ту же функцию подписи <code>function ($message, $category = 'application')</code> , где <code>$message</code> обозначает записываемое сообщение журнала, а <code>$category</code> - это категория сообщения журнала. Код в следующем примере записывает сообщение трассировки в <code>application</code> категории по умолчанию :

source: These methods can be used like the following:
ja: これらの方法は、以下のように使用することができます。
ko: 이러한 방법은 다음과 같이 사용할 수 있습니다.
ru: Эти методы могут быть использованы следующим образом:

source: These methods have the same method signature with the response object as the return value. If the file to be sent is very big, you should consider using <a href="yii-web-response#sendStreamAsFile()-detail">yii\web\Response::sendStreamAsFile()</a> because it is more memory efficient. The following example shows how to send a file in a controller action:
ja: これらのメソッドには、応答オブジェクトを戻り値とする同じメソッドシグネチャがあります。送信するファイルが非常に大きい場合は、メモリ効率が高いため、<a href="yii-web-response#sendStreamAsFile()-detail">yii \ web \ Response :: sendStreamAsFile（）の</a>使用を検討する必要があります。次の例は、コントローラーアクションでファイルを送信する方法を示しています。
ko: 이러한 메소드는 응답 오브젝트와 동일한 메소드 서명을 리턴 값으로 갖습니다. 전송할 파일이 매우 큰 경우 메모리 효율성이 더 높은 <a href="yii-web-response#sendStreamAsFile()-detail">yii \ web \ Response :: sendStreamAsFile ()을 사용</a> 하는 것이 좋습니다. 다음 예제는 컨트롤러 조치에서 파일을 보내는 방법을 보여줍니다.
ru: Эти методы имеют ту же сигнатуру метода с объектом ответа, что и возвращаемое значение. Если отправляемый файл очень большой, вам следует рассмотреть возможность использования <a href="yii-web-response#sendStreamAsFile()-detail">yii \ web \ Response :: sendStreamAsFile (),</a> потому что это более эффективно с точки зрения памяти. В следующем примере показано, как отправить файл в действии контроллера:

source: These named filters are declared in the <a href="yii-rest-controller#behaviors()-detail">behaviors()</a> method. You may override this method to configure individual filters, disable some of them, or add your own filters. For example, if you only want to use HTTP basic authentication, you may write the following code:
ja: これらの名前付きフィルターは、<a href="yii-rest-controller#behaviors()-detail">behaviors（）</a>メソッドで宣言されます。このメソッドをオーバーライドして、個々のフィルターを構成したり、一部のフィルターを無効にしたり、独自のフィルターを追加したりできます。たとえば、HTTP基本認証のみを使用する場合は、次のコードを記述できます。
ko: 이러한 명명 된 필터는 <a href="yii-rest-controller#behaviors()-detail">behaviors ()</a> 메소드 에서 선언됩니다 . 이 방법을 재정 의하여 개별 필터를 구성하거나 일부 필터를 비활성화하거나 고유 한 필터를 추가 할 수 있습니다. 예를 들어 HTTP 기본 인증 만 사용하려는 경우 다음 코드를 작성할 수 있습니다.
ru: Эти именованные фильтры объявлены в методе <a href="yii-rest-controller#behaviors()-detail">behavior ()</a> . Вы можете переопределить этот метод, чтобы настроить отдельные фильтры, отключить некоторые из них или добавить свои собственные фильтры. Например, если вы хотите использовать только базовую аутентификацию HTTP, вы можете написать следующий код:

source: These options can be configured using methods of the same name. For example:
ja: これらのオプションは、同名のメソッドを使用して設定することができます。例えば、以下のようになります。
ko: 이러한 옵션은 동일한 이름의 방법을 사용하여 구성 할 수 있습니다. 예를 들면 다음과 같습니다.
ru: Эти опции могут быть настроены с помощью одноименных методов.Например:

source: These properties do not support visibility. It makes no difference to the defining getter or setter method if the property is public, protected or private.
ja: これらのプロパティは可視性をサポートしていません。プロパティが public、protected、private のいずれであっても、ゲッターやセッターの定義に違いはありません。
ko: 이러한 속성은 가시성을 지원하지 않습니다. 속성이 공용, 보호 또는 개인 인 경우 정의하는 getter 또는 setter 메소드와 차이가 없습니다.
ru: Эти свойства не поддерживают видимость.Для определяющего геттера или метода сеттера не имеет значения,является ли это свойство публичным,защищенным или частным.

source: Third argument is direction. In case of sorting by a single key it could be either <code>SORT_ASC</code> or <code>SORT_DESC</code>. If sorting by multiple values you can sort each value differently by providing an array of sort direction.
ja: 3番目の引数は方向です。単一のキーでソートする場合は、 <code>SORT_ASC</code> または <code>SORT_DESC</code> のいずれかになります。複数の値で並べ替える場合は、並べ替え方向の配列を指定することで、各値を異なる方法で並べ替えることができます。
ko: 세 번째 주장은 방향입니다. 단일 키로 정렬하는 경우 <code>SORT_ASC</code> 또는 <code>SORT_DESC</code> 일 수 있습니다 . 여러 값으로 정렬하는 경우 정렬 방향 배열을 제공하여 각 값을 다르게 정렬 할 수 있습니다.
ru: Третий аргумент - направление. В случае сортировки по одному ключу это может быть <code>SORT_ASC</code> или <code>SORT_DESC</code> . При сортировке по нескольким значениям вы можете отсортировать каждое значение по-разному, предоставив массив направлений сортировки.

source: Third optional argument is default value which is <code>null</code> if not specified. Could be used as follows:
ja: 3番目のオプションの引数はデフォルト値で、指定しない場合は <code>null</code> になります。次のように使用できます。
ko: 세 번째 선택적 인수는 기본값이며, 지정하지 않으면 <code>null</code> 입니다. 다음과 같이 사용될 수 있습니다 :
ru: Третий необязательный аргумент - это значение по умолчанию, которое, если не указано, является <code>null</code> . Может использоваться следующим образом:

source: This above query brings back <em>all</em> customers, and for each customer it brings back all active orders. Note that this differs from our earlier example which only brings back customers who have at least one active order.
ja: 上記のクエリは<em>すべての</em>顧客を返し<em>、</em>顧客ごとにすべてのアクティブな注文を返します。これは、少なくとも1つのアクティブな注文を持つ顧客のみを返す以前の例とは異なることに注意してください。
ko: 이 쿼리는 <em>모든</em> 고객을 불러오고 각 고객마다 모든 활성 주문을 다시 불러옵니다. 이는 하나 이상의 활성 주문이있는 고객 만 다시 가져 오는 이전 예와 다릅니다.
ru: Этот запрос выше возвращает <em>всех</em> клиентов и для каждого клиента возвращает все активные заказы. Обратите внимание, что это отличается от нашего предыдущего примера, который возвращает только тех клиентов, у которых есть хотя бы один активный заказ.

source: This allows <a href="yii-db-schema#refresh()-detail">refresh()</a> to invalidate all cached table schemas.
ja: これにより、<a href="yii-db-schema#refresh()-detail">refresh（）</a>はすべてのキャッシュされたテーブルスキーマを無効にすることができます。
ko: 이렇게하면 <a href="yii-db-schema#refresh()-detail">refresh ()</a> 가 모든 캐시 된 테이블 스키마를 무효화 할 수 있습니다 .
ru: Это позволяет <a href="yii-db-schema#refresh()-detail">refresh ()</a> аннулировать все схемы кэшированных таблиц.

source: This allows <a href="yii-sphinx-schema#refresh()-detail">refresh()</a> to invalidate all cached index schemas.
ja: これにより、<a href="yii-sphinx-schema#refresh()-detail">refresh（）</a>はすべてのキャッシュされたインデックススキーマを無効にすることができます。
ko: 이렇게하면 <a href="yii-sphinx-schema#refresh()-detail">refresh ()</a> 가 모든 캐시 된 인덱스 스키마를 무효화 할 수 있습니다 .
ru: Это позволяет <a href="yii-sphinx-schema#refresh()-detail">refresh ()</a> аннулировать все схемы кэшированных индексов.

source: This allows you to write query building code like the following:
ja: これにより、以下のようなクエリ構築コードを書くことができます。
ko: 이를 통해 다음과 같은 쿼리 작성 코드를 작성할 수 있습니다.
ru: Это позволяет писать код построения запросов следующим образом:

source: This alternative approach is most preferable when you are releasing a Yii component which encapsulates some non-Yii 3rd-party library. You use the static method like shown above to represent the complex logic of building the 3rd-party object, and the user of your component only needs to call the static method to configure the component.
ja: この代替アプローチは、Yii 以外のサードパーティライブラリをカプセル化した Yii コンポーネントをリリースする場合に最も適しています。上記のような静的メソッドを使ってサードパーティオブジェクトを構築する複雑なロジックを表現し、コンポーネントのユーザはコンポーネントを設定するために静的メソッドを呼び出すだけで済みます。
ko: 이 대안은 Yii 이외의 타사 라이브러리를 캡슐화하는 Yii 구성 요소를 릴리스 할 때 가장 바람직합니다. 위에 표시된 정적 메서드를 사용하여 타사 개체를 작성하는 복잡한 논리를 나타내며 구성 요소 사용자는 구성 요소를 구성하기 위해 정적 메서드 만 호출하면됩니다.
ru: Этот альтернативный подход наиболее предпочтителен,когда вы выпускаете компонент Yii,который инкапсулирует некоторую не Yii библиотеку сторонних разработчиков.Вы используете статический метод,как показано выше,для представления сложной логики построения стороннего объекта,а пользователю вашего компонента нужно только вызвать статический метод для настройки компонента.

source: This approach can be as well used for creation of the shortcuts for some relational data, especially for the aggregation. For example:
ja: このアプローチは、いくつかのリレーショナルデータ、特に集約のためのショートカットの作成にも使用できます。例えば、以下のようになります。
ko: 이 접근법은 일부 관계형 데이터, 특히 집계에 대한 바로 가기를 작성하는 데에도 사용될 수 있습니다. 예를 들면 다음과 같습니다.
ru: Этот подход может быть также использован для создания ярлыков для некоторых реляционных данных,особенно для агрегирования.Например:

source: This asset bundle provides the <a href="http://jquery.com/">jQuery</a> JavaScript library.
ja: このアセットバンドルは、<a href="http://jquery.com/">jQuery</a> JavaScriptライブラリを提供します。
ko: 이 자산 번들은 <a href="http://jquery.com/">jQuery</a> JavaScript 라이브러리를 제공합니다 .
ru: Этот комплект ресурсов предоставляет библиотеку <a href="http://jquery.com/">jQuery</a> JavaScript.

source: This asset bundle provides the base JavaScript files for the Yii Framework.
ja: このアセットバンドルは、Yii フレームワークの基本となる JavaScript ファイルを提供します。
ko: 이 자산 번들은 Yii 프레임 워크의 기본 JavaScript 파일을 제공합니다.
ru: Этот пакет активов обеспечивает базовые файлы JavaScript для Yii Framework.

source: This asset bundle provides the javascript files for client validation.
ja: このアセットバンドルは、クライアント検証用のjavascriptファイルを提供します。
ko: 이 자산 번들은 클라이언트 유효성 검증을위한 Javascript 파일을 제공합니다.
ru: Этот пакет активов обеспечивает файлы javascript для проверки клиента.

source: This asset bundle provides the javascript files for the <a href="yii-grid-gridview">yii\grid\GridView</a> widget.
ja: このアセットバンドルは、<a href="yii-grid-gridview">yii \ grid \ GridView</a>ウィジェット用のJavaScriptファイルを提供します。
ko: 이 자산 번들은 <a href="yii-grid-gridview">yii \ grid \ GridView</a> 위젯에 대한 JavaScript 파일을 제공합니다 .
ru: Этот пакет ресурсов предоставляет файлы javascript для виджета <a href="yii-grid-gridview">yii \ grid \ GridView</a> .

source: This asset bundle provides the javascript files needed for the <a href="yii-captcha-captcha">yii\captcha\Captcha</a> widget.
ja: このアセットバンドルは、<a href="yii-captcha-captcha">yii \ captcha \ Captcha</a>ウィジェットに必要なjavascriptファイルを提供します。
ko: 이 자산 번들은 <a href="yii-captcha-captcha">yii \ captcha \ Captcha</a> 위젯에 필요한 자바 스크립트 파일을 제공합니다 .
ru: Этот пакет ресурсов предоставляет файлы javascript, необходимые для виджета <a href="yii-captcha-captcha">yii \ captcha \ Captcha</a> .

source: This asset bundle provides the javascript files needed for the <a href="yii-validators-emailvalidator">yii\validators\EmailValidator</a>s client validation.
ja: このアセットバンドルは、<a href="yii-validators-emailvalidator">yii \ validators \ EmailValidator</a>のクライアント検証に必要なjavascriptファイルを提供します。
ko: 이 자산 번들은 <a href="yii-validators-emailvalidator">yii \ validators \ EmailValidator</a> 클라이언트 검증에 필요한 자바 스크립트 파일을 제공합니다 .
ru: Этот пакет ресурсов предоставляет файлы javascript, необходимые для проверки клиента <a href="yii-validators-emailvalidator">yii \ validators \ EmailValidator</a> .

source: This asset bundle provides the javascript files required by <a href="yii-widgets-pjax">yii\widgets\Pjax</a> widget.
ja: このアセットバンドルは、<a href="yii-widgets-pjax">yii \ widgets \ Pjax</a>ウィジェットに必要なJavaScriptファイルを提供します。
ko: 이 자산 번들은 <a href="yii-widgets-pjax">yii \ widgets \ Pjax</a> 위젯에 필요한 자바 스크립트 파일을 제공합니다 .
ru: Этот пакет ресурсов предоставляет файлы javascript, необходимые для <a href="yii-widgets-pjax">виджета yii \ widgets \ Pjax</a> .

source: This autoloader allows loading classes that follow the <a href="http://www.php-fig.org/psr/psr-4/">PSR-4 standard</a> and have its top-level namespace or sub-namespaces defined as path aliases.
ja: このオートローダーを使用すると、<a href="http://www.php-fig.org/psr/psr-4/">PSR-4標準に準拠</a>し、最上位の名前空間またはサブ名前空間がパスエイリアスとして定義されているクラスをロードできます。
ko: 이 오토로더를 사용하면 <a href="http://www.php-fig.org/psr/psr-4/">PSR-4 표준</a> 을 따르고 최상위 네임 스페이스 또는 하위 네임 스페이스가 경로 별칭으로 정의 된 클래스를로드 할 수 있습니다 .
ru: Этот автозагрузчик позволяет загружать классы, которые следуют стандарту <a href="http://www.php-fig.org/psr/psr-4/">PSR-4</a> и имеют свое пространство имен верхнего уровня или подпространства имен, определенные как псевдонимы пути.

source: This bar will be updated by <a href="yii-helpers-baseconsole#updateProgress()-detail">updateProgress()</a> and my be ended by <a href="yii-helpers-baseconsole#endProgress()-detail">endProgress()</a>.
ja: このバーはによって更新されます<a href="yii-helpers-baseconsole#updateProgress()-detail">（のUpdateProgress）</a>とによって終了するMY <a href="yii-helpers-baseconsole#endProgress()-detail">）（endProgress</a>。
ko: 이 막대는 <a href="yii-helpers-baseconsole#updateProgress()-detail">updateProgress ()</a> 로 업데이트 되고 <a href="yii-helpers-baseconsole#endProgress()-detail">endProgress ()</a> 로 종료됩니다 .
ru: Эта полоса будет обновлена <a href="yii-helpers-baseconsole#updateProgress()-detail">updateProgress (),</a> а моя <a href="yii-helpers-baseconsole#endProgress()-detail">закроется endProgress ()</a> .

source: This behavior allows automatic attribute typecasting at following cases:
ja: この動作により、以下のような場合に自動的に属性のタイプキャスティングを行うことができます。
ko: 이 동작은 다음과 같은 경우에 자동 속성 유형 변환을 허용합니다.
ru: Такое поведение позволяет автоматически набирать атрибуты в следующих случаях:

source: This behavior is very useful in case of usage of ActiveRecord for the schema-less databases like MongoDB or Redis. It may also come in handy for regular <a href="yii-db-activerecord">yii\db\ActiveRecord</a> or even <a href="yii-base-model">yii\base\Model</a>, allowing to maintain strict attribute types after model validation.
ja: この動作は、MongoDBやRedisなどのスキーマレスデータベースでActiveRecordを使用する場合に非常に役立ちます。また、通常の<a href="yii-db-activerecord">yii \ db \ ActiveRecord</a>または<a href="yii-base-model">yii \ base \ Modelに</a>も役立ち、モデルの検証後に厳密な属性タイプを維持できます。
ko: 이 동작은 MongoDB 또는 Redis와 같은 스키마가없는 데이터베이스에 ActiveRecord를 사용하는 경우에 매우 유용합니다. 일반 <a href="yii-db-activerecord">yii \ db \ ActiveRecord</a> 또는 심지어 <a href="yii-base-model">yii \ base \ Model</a> 에도 유용하여 모델 유효성 검사 후 엄격한 속성 유형을 유지할 수 있습니다.
ru: Такое поведение очень полезно в случае использования ActiveRecord для баз данных без схемы, таких как MongoDB или Redis. Это также может пригодиться для обычного <a href="yii-db-activerecord">yii \ db \ ActiveRecord</a> или даже <a href="yii-base-model">yii \ base \ Model</a> , позволяя поддерживать строгие типы атрибутов после проверки модели.

source: This behavior should be attached to <a href="yii-base-model">yii\base\Model</a> or <a href="yii-db-baseactiverecord">yii\db\BaseActiveRecord</a> descendant.
ja: この動作は<a href="yii-base-model">yii \ base \ Model</a>または<a href="yii-db-baseactiverecord">yii \ db \ BaseActiveRecordの</a>子孫にアタッチする必要があります。
ko: 이 동작은 <a href="yii-db-baseactiverecord">yii </a><a href="yii-base-model">\ base \ Model</a> 또는 yii \ db \ BaseActiveRecord 하위 항목에 연결해야합니다.
ru: Это поведение должно быть связано с <a href="yii-base-model">yii \ base \ Model</a> или потомком <a href="yii-db-baseactiverecord">yii \ db \ BaseActiveRecord</a> .

source: This callback function will run upon encountering an error.
ja: このコールバック関数は、エラーが発生したときに実行されます。
ko: 이 콜백 함수는 오류가 발생하면 실행됩니다.
ru: Эта функция обратного вызова будет запущена при обнаружении ошибки.

source: This callback function will run upon encountering an error. The callback is run before fail over is attempted. The function takes two parameters, the <a href="yii-caching-memcacheserver#%24host-detail">$host</a> and the <a href="yii-caching-memcacheserver#%24port-detail">$port</a> of the failed server. This is used by memcache only.
ja: このコールバック関数は、エラーが発生したときに実行されます。コールバックは、フェイルオーバーが試行される前に実行されます。この関数は、障害が発生したサーバーの<a href="yii-caching-memcacheserver#%24host-detail">$ host</a>と<a href="yii-caching-memcacheserver#%24port-detail">$ port</a>の2つのパラメーターを取ります。これはmemcacheでのみ使用されます。
ko: 이 콜백 함수는 오류가 발생하면 실행됩니다. 장애 조치가 시도되기 전에 콜백이 실행됩니다. 이 함수는 실패한 서버 의 <a href="yii-caching-memcacheserver#%24host-detail">$ host</a> 및 <a href="yii-caching-memcacheserver#%24port-detail">$ port</a> 라는 두 가지 매개 변수를 사용 합니다. 이것은 memcache에서만 사용됩니다.
ru: Эта функция обратного вызова запускается при возникновении ошибки. Обратный вызов выполняется до попытки переключения при отказе. Функция принимает два параметра: <a href="yii-caching-memcacheserver#%24host-detail">$ host</a> и <a href="yii-caching-memcacheserver#%24port-detail">$ port</a> отказавшего сервера. Используется только кешем памяти.

source: This can also be a configuration array for creating the object.
ja: これは、オブジェクトを作成するための設定配列にすることもできます。
ko: 이것은 객체를 생성하기위한 구성 배열 일 수도 있습니다.
ru: Это также может быть массив настроек для создания объекта.
