Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/yii/yii.*.022.xlf
Languages: ja, ko, ru

source: The response format. This determines how to convert <a href="yii-web-response#%24data-detail">$data</a> into <a href="yii-web-response#%24content-detail">$content</a> when the latter is not set. The value of this property must be one of the keys declared in the <a href="yii-web-response#%24formatters-detail">$formatters</a> array. By default, the following formats are supported:
ja: 応答フォーマット。これは、<a href="yii-web-response#%24data-detail">$ data</a>が設定されていない場合に$ dataを<a href="yii-web-response#%24content-detail">$ content</a>に変換する方法を決定します。このプロパティの値は、<a href="yii-web-response#%24formatters-detail">$ formatters</a>配列で宣言されたキーの1つである必要があります。デフォルトでは、次の形式がサポートされています。
ru: Формат ответа. Это определяет, как преобразовать <a href="yii-web-response#%24data-detail">$ data</a> в <a href="yii-web-response#%24content-detail">$ content,</a> если последнее не установлено. Значение этого свойства должно быть одним из ключей, объявленных в массиве <a href="yii-web-response#%24formatters-detail">$ formatters</a> . По умолчанию поддерживаются следующие форматы:

source: The response object itself
ja: レスポンスオブジェクト自体
ru: Сам объект ответа

source: The response property data.
ja: レスポンスプロパティのデータです。
ru: Данные о свойстве реакции.

source: The response to be formatted.
ja: フォーマットされるレスポンス。
ru: Ответ должен быть отформатирован.

source: The response to be restored.
ja: 元に戻す対応。
ru: Реакция должна быть восстановлена.

source: The response to be sent.
ja: 送られてくる回答。
ru: Ответ,который нужно отправить.

source: The response to be sent. If not set, the <code>response</code> application component will be used.
ja: 送信される応答。設定しない場合、 <code>response</code> アプリケーションコンポーネントが使用されます。
ru: Отправляемый ответ. Если не установлен, будет использоваться компонент приложения <code>response</code> .

source: The response to be sent. If not set, the default application <a href="yii-base-application#%24response-detail">$response</a> component will be used.
ja: 送信される応答。設定しない場合、デフォルトのアプリケーション<a href="yii-base-application#%24response-detail">$ response</a>コンポーネントが使用されます。
ru: Отправляемый ответ. Если не задан, будет использоваться компонент приложения <a href="yii-base-application#%24response-detail">$ response</a> по умолчанию .

source: The rest of the options will be rendered as the HTML attributes of the button tag. Please refer to the <a href="http://getbootstrap.com/components/#alerts">Alert documentation</a> for the supported HTML attributes.
ja: 残りのオプションは、ボタンタグのHTML属性としてレンダリングされます。サポートされているHTML属性については、<a href="http://getbootstrap.com/components/#alerts">アラートのドキュメント</a>を参照してください。
ru: Остальные параметры будут отображаться как атрибуты HTML тега кнопки. Пожалуйста, обратитесь к <a href="http://getbootstrap.com/components/#alerts">документации</a> по оповещениям о поддерживаемых атрибутах HTML.

source: The rest of the options will be rendered as the HTML attributes of the button tag. Please refer to the <a href="http://getbootstrap.com/javascript/#modals">Modal plugin help</a> for the supported HTML attributes.
ja: 残りのオプションは、ボタンタグのHTML属性としてレンダリングされます。サポートされているHTML属性については、<a href="http://getbootstrap.com/javascript/#modals">Modalプラグインのヘルプ</a>を参照してください。
ru: Остальные параметры будут отображаться как атрибуты HTML тега кнопки. Пожалуйста, обратитесь к <a href="http://getbootstrap.com/javascript/#modals">справке модального плагина,</a> чтобы узнать о поддерживаемых атрибутах HTML.

source: The rest of the options will be rendered as the attributes of the container tag.
ja: 残りのオプションはコンテナタグの属性としてレンダリングされます。
ru: Остальные опции будут отображаться как атрибуты тега контейнера.

source: The rest of the options will be rendered as the attributes of the container tag. The values will be HTML-encoded using <a href="yii-helpers-basehtml#encode()-detail">yii\helpers\Html::encode()</a>. If a value is <code>null</code>, the corresponding attribute will not be rendered.
ja: 残りのオプションは、コンテナタグの属性としてレンダリングされます。値は<a href="yii-helpers-basehtml#encode()-detail">yii \ helpers \ Html :: encode（）</a>を使用してHTMLエンコードされます。値が <code>null</code> の場合、対応する属性はレンダリングされません。
ru: Остальные параметры будут отображаться как атрибуты тега контейнера. Значения будут закодированы в HTML с помощью <a href="yii-helpers-basehtml#encode()-detail">yii \ helpers \ Html :: encode ()</a> . Если значение равно <code>null</code> , соответствующий атрибут не будет отображаться.

source: The rest of the options will be rendered as the attributes of the resulting checkbox tag. The values will be HTML-encoded using <a href="yii-helpers-basehtml#encode()-detail">encode()</a>. If a value is null, the corresponding attribute will not be rendered. See <a href="yii-helpers-basehtml#renderTagAttributes()-detail">renderTagAttributes()</a> for details on how attributes are being rendered.
ja: 残りのオプションは、結果のチェックボックスタグの属性としてレンダリングされます。値は、<a href="yii-helpers-basehtml#encode()-detail">encode（）</a>を使用してHTMLエンコードされます。値がnullの場合、対応する属性はレンダリングされません。参照<a href="yii-helpers-basehtml#renderTagAttributes()-detail">renderTagAttributes（）</a>属性がレンダリングされている方法の詳細については、を。
ru: Остальные параметры будут отображаться как атрибуты результирующего тега флажка. Значения будут закодированы в HTML с помощью <a href="yii-helpers-basehtml#encode()-detail">encode ()</a> . Если значение равно нулю, соответствующий атрибут не будет отображаться. См. <a href="yii-helpers-basehtml#renderTagAttributes()-detail">RenderTagAttributes ()</a> для получения подробной информации о том, как отображаются атрибуты.

source: The rest of the options will be rendered as the attributes of the resulting link tag. The values will be HTML-encoded using <a href="yii-helpers-basehtml#encode()-detail">encode()</a>. If a value is null, the corresponding attribute will not be rendered. See <a href="yii-helpers-basehtml#renderTagAttributes()-detail">renderTagAttributes()</a> for details on how attributes are being rendered.
ja: 残りのオプションは、結果のリンクタグの属性としてレンダリングされます。値は、<a href="yii-helpers-basehtml#encode()-detail">encode（）</a>を使用してHTMLエンコードされます。値がnullの場合、対応する属性はレンダリングされません。参照<a href="yii-helpers-basehtml#renderTagAttributes()-detail">renderTagAttributes（）</a>属性がレンダリングされている方法の詳細については、を。
ru: Остальные параметры будут отображаться как атрибуты результирующего тега ссылки. Значения будут закодированы в HTML с помощью <a href="yii-helpers-basehtml#encode()-detail">encode ()</a> . Если значение равно нулю, соответствующий атрибут не будет отображаться. См. <a href="yii-helpers-basehtml#renderTagAttributes()-detail">RenderTagAttributes ()</a> для получения подробной информации о том, как отображаются атрибуты.

source: The rest of the options will be rendered as the attributes of the resulting script tag. The values will be HTML-encoded using <a href="yii-helpers-basehtml#encode()-detail">encode()</a>. If a value is null, the corresponding attribute will not be rendered. See <a href="yii-helpers-basehtml#renderTagAttributes()-detail">renderTagAttributes()</a> for details on how attributes are being rendered.
ja: 残りのオプションは、結果のスクリプトタグの属性としてレンダリングされます。値は、<a href="yii-helpers-basehtml#encode()-detail">encode（）</a>を使用してHTMLエンコードされます。値がnullの場合、対応する属性はレンダリングされません。参照<a href="yii-helpers-basehtml#renderTagAttributes()-detail">renderTagAttributes（）</a>属性がレンダリングされている方法の詳細については、を。
ru: Остальные параметры будут отображаться как атрибуты результирующего тега скрипта. Значения будут закодированы в HTML с помощью <a href="yii-helpers-basehtml#encode()-detail">encode ()</a> . Если значение равно нулю, соответствующий атрибут не будет отображаться. См. <a href="yii-helpers-basehtml#renderTagAttributes()-detail">RenderTagAttributes ()</a> для получения подробной информации о том, как отображаются атрибуты.

source: The rest of the options will be rendered as the attributes of the resulting tag. The values will be HTML-encoded using <a href="yii-helpers-basehtml#encode()-detail">encode()</a>. If a value is null, the corresponding attribute will not be rendered. See <a href="yii-helpers-basehtml#renderTagAttributes()-detail">renderTagAttributes()</a> for details on how attributes are being rendered.
ja: 残りのオプションは、結果のタグの属性としてレンダリングされます。値は、<a href="yii-helpers-basehtml#encode()-detail">encode（）</a>を使用してHTMLエンコードされます。値がnullの場合、対応する属性はレンダリングされません。参照<a href="yii-helpers-basehtml#renderTagAttributes()-detail">renderTagAttributes（）</a>属性がレンダリングされている方法の詳細については、を。
ru: Остальные параметры будут отображаться как атрибуты результирующего тега. Значения будут закодированы в HTML с помощью <a href="yii-helpers-basehtml#encode()-detail">encode ()</a> . Если значение равно нулю, соответствующий атрибут не будет отображаться. См. <a href="yii-helpers-basehtml#renderTagAttributes()-detail">RenderTagAttributes ()</a> для получения подробной информации о том, как отображаются атрибуты.

source: The rest of the options will be rendered as the attributes of the resulting tag. The values will be HTML-encoded using <a href="yii-helpers-basehtml#encode()-detail">yii\bootstrap\Html::encode()</a>. If a value is <code>null</code>, the corresponding attribute will not be rendered.
ja: 残りのオプションは、結果のタグの属性としてレンダリングされます。値は<a href="yii-helpers-basehtml#encode()-detail">yii \ bootstrap \ Html :: encode（）</a>を使用してHTMLエンコードされます。値が <code>null</code> の場合、対応する属性はレンダリングされません。
ru: Остальные параметры будут отображаться как атрибуты результирующего тега. Значения будут закодированы в HTML с помощью <a href="yii-helpers-basehtml#encode()-detail">yii \ bootstrap \ Html :: encode ()</a> . Если значение равно <code>null</code> , соответствующий атрибут не будет отображаться.

source: The rest of the options will be rendered as the attributes of the resulting tag. The values will be HTML-encoded using <a href="yii-helpers-basehtml#encode()-detail">yii\helpers\Html::encode()</a>. If a value is <code>null</code>, the corresponding attribute will not be rendered.
ja: 残りのオプションは、結果のタグの属性としてレンダリングされます。値は<a href="yii-helpers-basehtml#encode()-detail">yii \ helpers \ Html :: encode（）</a>を使用してHTMLエンコードされます。値が <code>null</code> の場合、対応する属性はレンダリングされません。
ru: Остальные параметры будут отображаться как атрибуты результирующего тега. Значения будут закодированы в HTML с помощью <a href="yii-helpers-basehtml#encode()-detail">yii \ helpers \ Html :: encode ()</a> . Если значение равно <code>null</code> , соответствующий атрибут не будет отображаться.

source: The result
ja: 結果
ru: Результат

source: The result fetch mode. Please refer to <a href="http://php.net/manual/en/pdostatement.setfetchmode.php">PHP manual</a> for valid fetch modes. If this parameter is null, the value set in <a href="yii-db-command#%24fetchMode-detail">$fetchMode</a> will be used.
ja: 結果フェッチモード。有効なフェッチモードについては、<a href="http://php.net/manual/en/pdostatement.setfetchmode.php">PHPのマニュアル</a>を参照してください。このパラメーターがnullの場合、<a href="yii-db-command#%24fetchMode-detail">$ fetchModeに</a>設定された値が使用されます。
ru: Режим получения результата. Пожалуйста, обратитесь к <a href="http://php.net/manual/en/pdostatement.setfetchmode.php">руководству PHP,</a> чтобы узнать о допустимых режимах выборки. Если этот параметр имеет значение NULL, будет использоваться значение, установленное в <a href="yii-db-command#%24fetchMode-detail">$ fetchMode</a> .

source: The result fetch mode. Please refer to <a href="http://www.php.net/manual/en/function.PDOStatement-setFetchMode.php">PHP manual</a> for valid fetch modes. If this parameter is null, the value set in <a href="yii-db-command#%24fetchMode-detail">$fetchMode</a> will be used.
ja: 結果フェッチモード。有効なフェッチモードについては、<a href="http://www.php.net/manual/en/function.PDOStatement-setFetchMode.php">PHPのマニュアル</a>を参照してください。このパラメーターがnullの場合、<a href="yii-db-command#%24fetchMode-detail">$ fetchModeに</a>設定された値が使用されます。
ru: Режим получения результата. Пожалуйста, обратитесь к <a href="http://www.php.net/manual/en/function.PDOStatement-setFetchMode.php">руководству PHP,</a> чтобы узнать о допустимых режимах выборки. Если этот параметр имеет значение NULL, будет использоваться значение, установленное в <a href="yii-db-command#%24fetchMode-detail">$ fetchMode</a> .

source: The result in "header" format
ja: ヘッダー」形式の結果
ru: Результат в формате "заголовок"

source: The result in "php $_SERVER header" format
ja: php $_SERVER ヘッダー」形式の結果です。
ru: Результат в формате "php $_SERVER заголовок".

source: The result of <code>ArrayHelper::toArray($post, $properties)</code> could be like the following:
ja: <code>ArrayHelper::toArray($post, $properties)</code> の結果は次のようになります。
ru: Результат <code>ArrayHelper::toArray($post, $properties)</code> может быть таким:

source: The result of a transaction commit.
ja: トランザクションコミットの結果。
ru: Результат совершения сделки.

source: The result of a transaction roll back.
ja: トランザクションのロールバックの結果。
ru: Результат сделки откат.

source: The result of a transaction start.
ja: トランザクションの開始結果。
ru: Результат начала транзакции.

source: The result of conversion above for single model will be:
ja: シングルモデルの場合は上記の変換結果となります。
ru: Результатом преобразования для одной модели будет:

source: The result of the action
ja: 行動の結果
ru: Результат действия

source: The result of the action.
ja: 行動した結果です。
ru: Результат действия.

source: The result of the action. This can be either an exit code or Response object. Exit code 0 means normal, and other values mean abnormal. Exit code of <code>null</code> is treaded as <code>0</code> as well.
ja: アクションの結果。これは、終了コードまたはResponseオブジェクトのいずれかです。終了コード0は正常を意味し、他の値は異常を意味します。 <code>null</code> の終了コードも <code>0</code> として扱われます。
ru: Результат действия. Это может быть либо код выхода, либо объект ответа. Код выхода 0 означает нормальное состояние, а другие значения - ненормальное. Код выхода, равный <code>null</code> , также обрабатывается как <code>0</code> .

source: The result of the aggregation.
ja: 集計した結果です。
ru: Результат суммирования.

source: The result of widget execution to be outputted.
ja: 出力されるウィジェットの実行結果。
ru: Результат выполнения виджета для вывода.

source: The result set (each array element represents a row of data). An empty array will be returned if the result contains no row.
ja: 結果セット(各配列要素はデータの行を表します)。結果に行が含まれていない場合は空の配列が返されます。
ru: Результирующий набор (каждый элемент массива представляет собой строку данных).Если результат не содержит строки,то возвращается пустой массив.

source: The result will be
ja: 結果は次のようになります。
ru: Результатом будет

source: The result will be <code>['123', '345']</code>.
ja: 結果は <code>['123', '345']</code> ます。
ru: Результатом будет <code>['123', '345']</code> .

source: The result will be a multidimensional array grouped by <code>id</code> on the first level and not indexed on the second level:
ja: 結果は、第1レベルで <code>id</code> によってグループ化され、第2レベルでインデックス付けされない多次元配列になります。
ru: Результатом будет многомерный массив, сгруппированный по <code>id</code> на первом уровне и не проиндексированный на втором уровне:

source: The result will be a multidimensional array grouped by <code>id</code> on the first level, by <code>device</code> on the second level and indexed by <code>data</code> on the third level:
ja: 結果は、第1レベルの <code>id</code> 、第2レベルの <code>device</code> 、および第3レベルの <code>data</code> でインデックス付けされた多次元配列になります。
ru: Результатом будет многомерный массив, сгруппированный по <code>id</code> на первом уровне, по <code>device</code> на втором уровне и проиндексированный <code>data</code> на третьем уровне:

source: The result will be a multidimensional array grouped by <code>id</code> on the first level, by the <code>device</code> on the second one and indexed by the <code>data</code> on the third level:
ja: 結果は、第1レベルの <code>id</code> 、第2レベルの <code>device</code> 、および第3レベルの <code>data</code> でインデックス付けされた多次元配列になります。
ru: Результатом будет многомерный массив, сгруппированный по <code>id</code> на первом уровне, <code>device</code> на втором и проиндексированный <code>data</code> на третьем уровне:

source: The result will be an associative array, where the key is the value of <code>id</code> attribute
ja: 結果は連想配列になります。キーは <code>id</code> 属性の値です
ru: Результатом будет ассоциативный массив, где ключ - значение атрибута <code>id</code> .

source: The result will be an associative array, where the key is the value of <code>id</code> attribute:
ja: 結果は連想配列になります。キーは <code>id</code> 属性の値です。
ru: Результатом будет ассоциативный массив, где ключом является значение атрибута <code>id</code> :

source: The result will be:
ja: 結果が出てきます。
ru: Результат будет:

source: The resulting CamelCase name
ja: 結果として得られるキャメルケース名
ru: Полученное имя CamelCase

source: The resulting ID
ja: 結果のID
ru: Полученный ID

source: The resulting response
ja: 結果として得られるレスポンス
ru: Полученная реакция

source: The resulting words
ja: 結果として出てきた言葉
ru: Полученные слова

source: The results returned include the number of SQL statements executed and the total time spent.
ja: 返された結果には、実行された SQL 文の数と総消費時間が含まれます。
ru: Возвращаемые результаты включают количество выполненных SQL-запросов и общее время,потраченное на их выполнение.

source: The retry interval in seconds for dead servers listed in <a href="yii-db-connection#%24masters-detail">$masters</a> and <a href="yii-db-connection#%24slaves-detail">$slaves</a>.
ja: <a href="yii-db-connection#%24masters-detail">$ masters</a>および<a href="yii-db-connection#%24slaves-detail">$ slavesに</a>リストされている停止中のサーバーの再試行間隔（秒）。
ru: Интервал повтора в секундах для мертвых серверов, перечисленных в <a href="yii-db-connection#%24masters-detail">$ master</a> и <a href="yii-db-connection#%24slaves-detail">$ slave</a> .

source: The retry interval in seconds for dead servers listed in <a href="yii-db-connection#%24masters-detail">$masters</a> and <a href="yii-db-connection#%24slaves-detail">$slaves</a>. This is used together with <a href="yii-db-connection#%24serverStatusCache-detail">$serverStatusCache</a>.
ja: <a href="yii-db-connection#%24masters-detail">$ masters</a>および<a href="yii-db-connection#%24slaves-detail">$ slavesに</a>リストされている停止中のサーバーの再試行間隔（秒）。これは<a href="yii-db-connection#%24serverStatusCache-detail">$ serverStatusCache</a>と一緒に使用されます。
ru: Интервал повтора в секундах для мертвых серверов, перечисленных в <a href="yii-db-connection#%24masters-detail">$ master</a> и <a href="yii-db-connection#%24slaves-detail">$ slave</a> . Используется вместе с <a href="yii-db-connection#%24serverStatusCache-detail">$ serverStatusCache</a> .

source: The return data format of <code>extraFields()</code> is the same as that of <code>fields()</code>. Usually, <code>extraFields()</code> is mainly used to specify fields whose values are objects. For example, given the following field declaration,
ja: 戻りデータフォーマット <code>extraFields()</code> と同じである <code>fields()</code> 。通常、 <code>extraFields()</code> は主に値がオブジェクトであるフィールドを指定するために使用されます。たとえば、次のフィールド宣言があるとします。
ru: Формат возвращаемых данных <code>extraFields()</code> такой же, как и у <code>fields()</code> . Обычно <code>extraFields()</code> в основном используется для указания полей, значения которых являются объектами. Например, учитывая следующее объявление поля,

source: The return result of the callable
ja: 呼び出し可能な
ru: Результат возврата вызываемого

source: The return result of the function will be rendered directly. Note: If the function returns <code>null</code>, nothing will be rendered after the item.
ja: 関数の戻り結果は直接レンダリングされます。注：関数が <code>null</code> を返す場合、アイテムの後に何もレンダリングされません。
ru: Возвращаемый результат функции будет отображаться напрямую. Примечание. Если функция возвращает значение <code>null</code> , после элемента ничего не будет отображаться.

source: The return result of the function will be rendered directly. Note: If the function returns <code>null</code>, nothing will be rendered before the item.
ja: 関数の戻り結果は直接レンダリングされます。注：関数が <code>null</code> を返す場合、アイテムの前には何もレンダリングされません。
ru: Возвращаемый результат функции будет отображаться напрямую. Примечание. Если функция возвращает значение <code>null</code> , перед элементом ничего не будет отображаться.

source: The return value can be a <a href="guide-runtime-responses">response</a> object which will be sent to the end user as the response.
ja: 戻り値は、エンドユーザーに応答として送信される<a href="guide-runtime-responses">応答</a>オブジェクトにすることができます。
ru: Возвращаемое значение может быть объектом <a href="guide-runtime-responses">ответа,</a> который будет отправлен конечному пользователю в качестве ответа.

source: The return value of <a href="yii-rbac-rule#execute()-detail">yii\rbac\Rule::execute()</a>. If the auth item does not specify a rule, true will be returned.
ja: <a href="yii-rbac-rule#execute()-detail">yii \ rbac \ Rule :: execute（）</a>の戻り値。authアイテムがルールを指定しない場合、trueが返されます。
ru: Возвращаемое значение <a href="yii-rbac-rule#execute()-detail">yii \ rbac \ Rule :: execute ()</a> . Если в элементе аутентификации не указано правило, будет возвращено значение true.

source: The return value of an action method or of the <code>run()</code> method of a standalone action is significant. It stands for the result of the corresponding action.
ja: アクションメソッドまたはスタンドアロンアクションの <code>run()</code> メソッドの戻り値は重要です。対応するアクションの結果を表します。
ru: Возвращаемое значение метода действия или метода <code>run()</code> автономного действия имеет значение. Это результат соответствующего действия.

source: The return value of the PHP statements.
ja: PHPステートメントの戻り値。
ru: Возвращаемое значение выражений PHP.

source: The return value of the callback
ja: コールバックの戻り値
ru: Возвращаемое значение обратного вызова

source: The return value of this method must be an array of fixture configurations. For example,
ja: このメソッドの戻り値は、フィクスチャ構成の配列でなければなりません。例えば
ru: Возвращаемое значение этого метода должно быть массивом конфигураций креплений.Например,

source: The return value of this method should be an array of behavior objects or configurations indexed by behavior names. A behavior configuration can be either a string specifying the behavior class or an array of the following structure:
ja: このメソッドの戻り値は、ビヘイビアオブジェクトまたはビヘイビア名でインデックス付けされたコンフィギュレーションの配列でなければなりません。ビヘイビア設定は、ビヘイビアクラスを指定する文字列か、以下の構造の配列のいずれかになります。
ru: Возвращаемым значением этого метода должен быть массив объектов поведения или конфигураций,проиндексированных по именам поведения.Конфигурация поведения может быть как строкой,указывающей на класс поведения,так и массивом следующей структуры:

source: The return value should be similar to that of <a href="yii-test-fixturetrait#fixtures()-detail">fixtures()</a>. You should usually override this method in a base class.
ja: 戻り値は、<a href="yii-test-fixturetrait#fixtures()-detail">fixtures（）</a>の戻り値と同様である必要があります。通常、このメソッドは基本クラスでオーバーライドする必要があります。
ru: Возвращаемое значение должно быть таким же, как у <a href="yii-test-fixturetrait#fixtures()-detail">fixtures ()</a> . Обычно вам следует переопределить этот метод в базовом классе.

source: The returned <a href="yii-db-activequeryinterface">yii\db\ActiveQueryInterface</a> instance can be further customized by calling methods defined in <a href="yii-db-activequeryinterface">yii\db\ActiveQueryInterface</a> before <code>one()</code> or <code>all()</code> is called to return populated ActiveRecord instances. For example,
ja: 返された<a href="yii-db-activequeryinterface">yii \ db \ ActiveQueryInterface</a>インスタンスは、 <code>one()</code> または <code>all()</code> が呼び出されて、設定されたActiveRecordインスタンスが返される前に、<a href="yii-db-activequeryinterface">yii \ db \ ActiveQueryInterfaceで</a>定義されたメソッドを呼び出すことにより、さらにカスタマイズできます。例えば、
ru: Возвращенный <a href="yii-db-activequeryinterface">юй \ DB \ ActiveQueryInterface</a> экземпляр может быть дополнительно настроены путем вызова методов , определенных в <a href="yii-db-activequeryinterface">юй \ дб \ ActiveQueryInterface</a> до того <code>one()</code> или <code>all()</code> вызывается для возврата заселенных экземпляры ActiveRecord. Например,

source: The returned URL does not have an ending slash.
ja: 返された URL には末尾のスラッシュがありません。
ru: Возвращаемый URL не имеет косая черта.
