Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/yii/yii.*.022.xlf
Languages: ja, ko, ru

source: Theming is a way to replace a set of <a href="guide-structure-views">views</a> with another without the need of touching the original view rendering code. You can use theming to systematically change the look and feel of an application.
ja: テーマ設定は、元のビューのレンダリングコードを変更することなく、<a href="guide-structure-views">ビューの</a>セットを別のビューに置き換える方法です。テーマを使用して、アプリケーションのルックアンドフィールを体系的に変更できます。
ko: 테마는 원래 뷰 렌더링 코드를 건드릴 필요없이 <a href="guide-structure-views">뷰</a> 세트 를 다른 뷰로 바꾸는 방법 입니다. 테마를 사용하여 응용 프로그램의 모양과 느낌을 체계적으로 변경할 수 있습니다.
ru: Тематизация - это способ заменить набор <a href="guide-structure-views">представлений</a> другим без необходимости касаться исходного кода визуализации представления. Вы можете использовать темы для систематического изменения внешнего вида приложения.

source: Then in the layout, make sure you have the following code in the <code>&lt;head&gt;</code> section:
ja: 次に、レイアウトの <code>&lt;head&gt;</code> セクションに次のコードがあることを確認します。
ko: 그런 다음 레이아웃에서 <code>&lt;head&gt;</code> 섹션 에 다음 코드가 있는지 확인하십시오 .
ru: Затем в макете убедитесь, что в разделе <code>&lt;head&gt;</code> есть следующий код :

source: Then in your code where you need to use the size value, you can simply use code like the following:
ja: そして、サイズの値を使用する必要があるコードでは、以下のようなコードを使用することができます。
ko: 그런 다음 크기 값을 사용해야하는 코드에서 다음과 같은 코드를 간단히 사용할 수 있습니다.
ru: Тогда в вашем коде,где нужно использовать значение размера,вы можете просто использовать код,как показано ниже:

source: Then in your code, whenever you need to refer to a table whose name contains such a prefix, use the syntax <code>{{%table_name}}</code>. The percentage character will be automatically replaced with the table prefix that you have specified when configuring the DB connection. For example,
ja: 次に、コードで、名前にそのようなプレフィックスが含まれるテーブルを参照する必要がある場合は常に、構文 <code>{{%table_name}}</code> を使用します。パーセント文字は、DB接続の構成時に指定したテーブルプレフィックスに自動的に置き換えられます。例えば、
ko: 그런 다음 코드에서 이름에 접두사가 포함 된 테이블을 참조해야 할 때마다 <code>{{%table_name}}</code> 구문을 사용하십시오 . 백분율 문자는 DB 연결을 구성 할 때 지정한 테이블 접두사로 자동 대체됩니다. 예를 들어
ru: Затем в вашем коде, когда вам нужно обратиться к таблице, имя которой содержит такой префикс, используйте синтаксис <code>{{%table_name}}</code> . Символ процента будет автоматически заменен префиксом таблицы, который вы указали при настройке соединения с БД. Например,

source: Then inside the view file you can use the following code:
ja: そして、ビューファイルの内部では、以下のコードを使用することができます。
ko: 그런 다음 뷰 파일 내에서 다음 코드를 사용할 수 있습니다.
ru: Затем внутри файла просмотра можно использовать следующий код:

source: Then reload your shell
ja: その後、あなたのシェルをリロードします。
ko: 그런 다음 쉘을 다시로드하십시오.
ru: Тогда перезагрузите вашу оболочку

source: Then wait for the repository to be downloaded to your computer. Since the changes made to the template won't be pushed back, you can delete the <code>.git</code> directory and all of its contents from the download.
ja: 次に、リポジトリがコンピュータにダウンロードされるのを待ちます。テンプレートに加えられた変更はプッシュバックされないので、 <code>.git</code> ディレクトリとそのすべてのコンテンツをダウンロードから削除できます。
ko: 그런 다음 리포지토리가 컴퓨터에 다운로드 될 때까지 기다립니다. 템플릿에 대한 변경 사항은 푸시되지 않으므로 <code>.git</code> 디렉토리와 모든 내용을 다운로드에서 삭제할 수 있습니다 .
ru: Затем подождите, пока репозиторий загрузится на ваш компьютер. Поскольку изменения, внесенные в шаблон, не будут возвращены, вы можете удалить каталог <code>.git</code> и все его содержимое из загрузки.

source: Then you can compose a query, which joins the orders and calculates their count:
ja: 次に、注文を結合してその数を計算するクエリを作成することができます。
ko: 그런 다음 주문을 결합하고 개수를 계산하는 쿼리를 작성할 수 있습니다.
ru: Затем можно составить запрос,который объединит заказы и вычислит их количество:

source: Then you need to compose a query, which calculates volume of the room and performs the sort:
ja: 次に、部屋の容積を計算してソートを実行するクエリを作成する必要があります。
ko: 그런 다음 방의 부피를 계산하고 정렬을 수행하는 쿼리를 작성해야합니다.
ru: Затем необходимо составить запрос,который вычислит объем помещения и выполнит сортировку:

source: Then you need to create the ActiveRecord that will be representing this view:
ja: 次に、このビューを表すActiveRecordを作成する必要があります。
ko: 그런 다음이보기를 나타내는 ActiveRecord를 작성해야합니다.
ru: Затем вам нужно создать ActiveRecord,который будет представлять этот вид:

source: Then you will be able to perform the following relational queries:
ja: そうすると、次のようなリレーショナルクエリを実行できるようになります。
ko: 그러면 다음 관계형 쿼리를 수행 할 수 있습니다.
ru: Тогда вы сможете выполнять следующие реляционные запросы:

source: Then, create a view file for this action. If the route of your error action is <code>site/error</code>, then the view file should be <code>views/site/error.php</code>. In this view file, the following variables are available:
ja: 次に、このアクションのビューファイルを作成します。エラーアクションのルートが <code>site/error</code> の場合、ビューファイルは <code>views/site/error.php</code> になります。このビューファイルでは、次の変数を使用できます。
ko: 그런 다음이 조치에 대한보기 파일을 작성하십시오. 오류 조치의 경로가 <code>site/error</code> 인 경우보기 파일은 <code>views/site/error.php</code> 이어야 합니다. 이보기 파일에서 다음 변수를 사용할 수 있습니다.
ru: Затем создайте файл представления для этого действия. Если маршрут вашего действия с ошибкой - <code>site/error</code> , тогда файл представления должен быть <code>views/site/error.php</code> . В этом файле просмотра доступны следующие переменные:

source: Then, in the <a href="#layouts">layout</a> file, which is also a view, you can display the breadcrumbs using the data passed along <a href="yii-base-view#%24params-detail">params</a>:
ja: 次に、ビューでもある<a href="#layouts">レイアウト</a>ファイルで、<a href="yii-base-view#%24params-detail">paramsに</a>沿って渡されたデータを使用してブレッドクラムを表示できます。
ko: 그런 다음 뷰이기도 한 <a href="#layouts">레이아웃</a> 파일에서 <a href="yii-base-view#%24params-detail">매개 변수를</a> 따라 전달 된 데이터를 사용하여 이동 경로를 표시 할 수 있습니다 .
ru: Затем в файле <a href="#layouts">макета</a> , который также является представлением, вы можете отобразить хлебные крошки, используя данные, переданные по <a href="yii-base-view#%24params-detail">параметрам</a> :

source: Then, in the layout view, render the blocks if they are available, or display some default content if a block is not defined.
ja: そして、レイアウトビューで、ブロックが利用可能な場合はブロックをレンダリングし、ブロックが定義されていない場合はデフォルトのコンテンツを表示します。
ko: 그런 다음 배치 뷰에서 사용 가능한 블록을 렌더링하거나 블록이 정의되지 않은 경우 일부 기본 컨텐츠를 표시합니다.
ru: Затем,в просмотре макета,отобразить блоки,если они доступны,или отобразить некоторое содержимое по умолчанию,если блок не определен.

source: Then, modify the configuration of the <code>urlManager</code> component in your application configuration:
ja: 次に、アプリケーション構成で <code>urlManager</code> コンポーネントの構成を変更します。
ko: 그런 다음 애플리케이션 구성에서 <code>urlManager</code> 구성 요소 의 구성을 수정하십시오 .
ru: Затем измените конфигурацию компонента <code>urlManager</code> в конфигурации вашего приложения:

source: Then, queries are created normally. The new connection is used to run batch queries and retrieve results either in batches or one by one:
ja: その後、クエリは通常通り作成されます。新しい接続は、バッチクエリを実行し、結果をバッチまたは1つずつ取得するために使用されます。
ko: 그런 다음 쿼리가 정상적으로 만들어집니다. 새로운 연결은 배치 쿼리를 실행하고 배치 또는 하나씩 결과를 검색하는 데 사용됩니다.
ru: Тогда запросы создаются нормально.Новое соединение используется для выполнения пакетных запросов и получения результатов либо партиями,либо по одному:

source: There are 3 types of lists:
ja: リストには3種類あります。
ko: 3 가지 유형의 목록이 있습니다.
ru: Существует 3 типа списков:

source: There are <a href="yii-base-view#beginContent()-detail">yii\base\View::beginContent()</a> and <a href="yii-base-view#endContent()-detail">yii\base\View::endContent()</a> wrapper methods in the <a href="yii-base-view">yii\base\View</a> component to make syntax more friendly. In the view these could be used as follows:
ja: 構文をより<a href="yii-base-view#endContent()-detail">わかりやすく</a>するために、<a href="yii-base-view">yii \ base \ View</a>コンポーネントには<a href="yii-base-view#beginContent()-detail">yii \ base \ View :: beginContent（）</a>およびyii \ base \ View :: endContent（）ラッパーメソッドがあります。ビューでは、これらは次のように使用できます。
ko: 있다 <a href="yii-base-view#beginContent()-detail">YII \ 기본 \보기 :: beginContent ()</a> 와 <a href="yii-base-view#endContent()-detail">YII \ 기본 \보기 :: endContent ()</a> 메소드 래퍼 <a href="yii-base-view">YII \ 기본 \보기</a> 보다 쉬운 메이크업 구문 구성 요소. 보기에서 이들은 다음과 같이 사용될 수 있습니다.
ru: Есть <a href="yii-base-view#beginContent()-detail">юй \ базы \ View :: beginContent ()</a> и <a href="yii-base-view#endContent()-detail">евайте \ базы \ View :: endContent ()</a> обертка методов в <a href="yii-base-view">YII \ базы \ View</a> компонентах , чтобы сделать синтаксис более дружественным. По мнению авторов, они могут использоваться следующим образом:

source: There are a good number of widgets bundled with Yii, such as <a href="yii-widgets-activeform">active form</a>, <a href="yii-widgets-menu">menu</a>, <a href="guide-widget-jui">jQuery UI widgets</a>, <a href="guide-widget-bootstrap">Twitter Bootstrap widgets</a>. In the following, we will introduce the basic knowledge about widgets. Please refer to the class API documentation if you want to learn about the usage of a particular widget.
ja: Yiiには、<a href="yii-widgets-activeform">アクティブフォーム</a>、<a href="yii-widgets-menu">メニュー</a>、<a href="guide-widget-jui">jQuery UIウィジェット</a>、<a href="guide-widget-bootstrap">Twitterブートストラップウィジェット</a>など、数多くのウィジェットがバンドルされています。以下では、ウィジェットに関する基本的な知識を紹介します。特定のウィジェットの使用法について知りたい場合は、クラスAPIドキュメントを参照してください。
ko: <a href="yii-widgets-activeform">활성 양식</a> , <a href="yii-widgets-menu">메뉴</a> , <a href="guide-widget-jui">jQuery UI 위젯</a> , <a href="guide-widget-bootstrap">Twitter 부트 스트랩 위젯</a> 과 같이 Yii와 함께 번들로 제공되는 위젯이 많이 있습니다 . 다음에서는 위젯에 대한 기본 지식을 소개합니다. 특정 위젯 사용법에 대해 배우려면 클래스 API 설명서를 참조하십시오.
ru: Есть большое количество виджетов в комплекте с Yii, такие как <a href="yii-widgets-activeform">активная форма</a> , <a href="yii-widgets-menu">меню</a> , <a href="guide-widget-jui">виджеты Jquery UI</a> , <a href="guide-widget-bootstrap">Twitter Bootstrap виджетов</a> . Далее мы познакомим вас с основными знаниями о виджетах. Если вы хотите узнать об использовании определенного виджета, обратитесь к документации по API класса.

source: There are also some new placeholders that you can use in the <a href="yii-widgets-activefield#%24template-detail">$template</a> configuration:
ja: <a href="yii-widgets-activefield#%24template-detail">$ template</a>構成で使用できるいくつかの新しいプレースホルダーもあります。
ko: <a href="yii-widgets-activefield#%24template-detail">$ template</a> 구성에 사용할 수있는 몇 가지 새로운 자리 표시자가 있습니다.
ru: Также есть несколько новых заполнителей, которые вы можете использовать в конфигурации <a href="yii-widgets-activefield#%24template-detail">$ template</a> :

source: There are cases when you need to remember URL and afterwards use it during processing of the one of sequential requests. It can be achieved in the following way:
ja: 連続したリクエストの処理中にURLを覚えておいて、その後に使用する場合があります。これは以下のような方法で実現できます。
ko: URL을 기억하고 나중에 순차적 요청 중 하나를 처리하는 동안 URL을 사용해야하는 경우가 있습니다. 다음과 같은 방법으로 달성 할 수 있습니다.
ru: Бывают случаи,когда необходимо запомнить URL и впоследствии использовать его при обработке одного из последовательных запросов.Этого можно добиться следующим образом:

source: There are different ways to send an access token:
ja: アクセストークンを送信するには、さまざまな方法があります。
ko: 액세스 토큰을 보내는 방법에는 여러 가지가 있습니다.
ru: Существуют различные способы отправки токена доступа:

source: There are known issues using <code>jQuery.serializeArray()</code> when dealing with <a href="https://github.com/jquery/jquery/issues/2321">files</a> and <a href="https://github.com/jquery/jquery/issues/2321">submit button values</a> which won't be solved and are instead deprecated in favor of the <code>FormData</code> class introduced in HTML5.
ja: 使用した既知の問題があります <code>jQuery.serializeArray()</code> 扱う際に<a href="https://github.com/jquery/jquery/issues/2321">、ファイル</a>や<a href="https://github.com/jquery/jquery/issues/2321">ボタンの値を提出</a>解決されず、代わりに賛成で廃止され <code>FormData</code> HTML5で導入されたクラスを。
ko: 사용 알려진 문제가 <code>jQuery.serializeArray()</code> 처리 할 때 <a href="https://github.com/jquery/jquery/issues/2321">파일</a> 과 <a href="https://github.com/jquery/jquery/issues/2321">버튼 값을 제출</a> 해결되지 않고 대신에 찬성되지 않습니다 <code>FormData</code> 의 HTML5에 도입 클래스를.
ru: Известны проблемы с использованием <code>jQuery.serializeArray()</code> при работе с <a href="https://github.com/jquery/jquery/issues/2321">файлами</a> и <a href="https://github.com/jquery/jquery/issues/2321">значениями кнопок отправки,</a> которые не будут решены и вместо этого устарели в пользу класса <code>FormData</code> , представленного в HTML5.

source: There are many important application properties that you should configure in application configurations. These properties typically describe the environment that applications are running in. For example, applications need to know how to load <a href="guide-structure-controllers">controllers</a>, where to store temporary files, etc. In the following, we will summarize these properties.
ja: アプリケーション構成で構成する必要のある重要なアプリケーションプロパティが多数あります。これらのプロパティは通常、アプリケーションが実行されている環境を示します。たとえば、アプリケーションは、<a href="guide-structure-controllers">コントローラーの</a>読み込み方法、一時ファイルの保存場所などを知る必要があります。以下では、これらのプロパティを要約します。
ko: 응용 프로그램 구성에서 구성해야하는 중요한 응용 프로그램 속성이 많이 있습니다. 이러한 속성은 일반적으로 응용 프로그램이 실행되는 환경을 설명합니다. 예를 들어, 응용 프로그램은 <a href="guide-structure-controllers">컨트롤러</a> 를로드하는 방법 , 임시 파일을 저장할 위치 등 을 알아야합니다 . 다음에서는 이러한 속성을 요약합니다.
ru: Есть много важных свойств приложения, которые вы должны настроить в конфигурациях приложения. Эти свойства обычно описывают среду, в которой работают приложения. Например, приложениям необходимо знать, как загружать <a href="guide-structure-controllers">контроллеры</a> , где хранить временные файлы и т. Д. Ниже мы резюмируем эти свойства.

source: There are methods to get names, ids and values for input fields based on the model. These are mainly used internally, but could be handy sometimes:
ja: モデルに基づいて入力フィールドの名前、id、値を取得するメソッドがあります。これらは主に内部で使用されますが、時には便利なこともあります。
ko: 모델을 기반으로 입력 필드의 이름, ID 및 값을 가져 오는 방법이 있습니다. 이들은 주로 내부적으로 사용되지만 때로는 편리 할 수 ​​있습니다.
ru: Существуют методы получения имен,идентификаторов и значений для полей ввода на основе модели.В основном они используются внутри модели,но иногда могут быть удобны:

source: There are several built-in and external behaviors available:
ja: いくつかのビルトインおよび外部のビヘイビアが利用可能です。
ko: 사용 가능한 몇 가지 기본 제공 및 외부 동작이 있습니다.
ru: Существует несколько встроенных и внешних моделей поведения:

source: There are several special rules for, and limitations on, the properties defined via getters and setters:
ja: ゲッターやセッターを介して定義されるプロパティには、いくつかの特別なルールや制限があります。
ko: 게터와 세터를 통해 정의 된 속성에는 몇 가지 특별한 규칙과 제한이 있습니다.
ru: Существует несколько специальных правил и ограничений для свойств,определяемых через геттеры и сеттеры:

source: There are several ways to customize the migration command.
ja: 移行コマンドをカスタマイズする方法はいくつかあります。
ko: 마이그레이션 명령을 사용자 정의하는 방법에는 여러 가지가 있습니다.
ru: Существует несколько способов настройки команды миграции.

source: There are situations in which you need to verify that your data hasn't been tampered with by a third party or even corrupted in some way. Yii provides an easy way to confirm data integrity in the form of two helper functions.
ja: 第三者によってデータが改ざんされていないか、あるいは何らかの方法でデータが破損していないかを確認する必要がある場合があります。Yii は、データの完全性を簡単に確認する方法を二つのヘルパー関数の形で提供しています。
ko: 데이터가 제 3 자에 의해 변조되거나 어떤 식 으로든 손상되지 않았는지 확인해야하는 상황이 있습니다. Yii는 두 가지 도우미 기능의 형태로 데이터 무결성을 쉽게 확인할 수있는 방법을 제공합니다.
ru: Существуют ситуации,в которых вам необходимо убедиться,что ваши данные не были подделаны третьей стороной или даже каким-либо образом повреждены.Yii предоставляет простой способ подтверждения целостности данных в виде двух вспомогательных функций.

source: There are some predefined constants you can use:
ja: 使用できる定義済みの定数がいくつかあります。
ko: 사용할 수있는 사전 정의 된 상수가 있습니다.
ru: Есть несколько предопределенных констант,которые вы можете использовать:

source: There are three different situations to cover, which have to be handled slightly different:
ja: カバーするシチュエーションは3つあり、少しずつ対応が異なります。
ko: 다루어야 할 상황은 세 가지가 있으며, 약간 다르게 처리해야합니다.
ru: Существуют три различные ситуации,которые должны быть решены немного по-разному:

source: There are two approaches to access data within a view: push and pull.
ja: ビュー内のデータにアクセスするには、プッシュとプルの2つのアプローチがあります。
ko: 뷰 내에서 데이터에 액세스하는 방법에는 푸시 앤 풀의 두 가지가 있습니다.
ru: Существует два подхода к доступу к данным в представлении:толкать и тянуть.

source: There are two groups of input methods. The ones starting with <code>active</code>, which are called active inputs, and the ones not starting with it. Active inputs take data from the model and attribute specified, while in the case of a regular input, data is specified directly.
ja: インプットメソッドには2つのグループがあります。始まるもの <code>active</code> アクティブな入力、およびそれで始まらないものをと呼ばれ、。アクティブな入力は、指定されたモデルと属性からデータを取得しますが、通常の入力の場合、データは直接指定されます。
ko: 입력 방법에는 두 가지 그룹이 있습니다. <code>active</code> 로 시작하는 것 (활성 입력이라고하며, 시작하지 않는 것). 활성 입력은 지정된 모델 및 속성에서 데이터를 가져 오는 반면 일반 입력의 경우 데이터가 직접 지정됩니다.
ru: Есть две группы методов ввода. Те, которые начинаются с <code>active</code> , называются активными входами, а те, которые не начинаются с него. Активные входы берут данные из указанной модели и атрибута, тогда как в случае обычного входа данные указываются напрямую.

source: There are two main principles when it comes to security no matter which application is being developed:
ja: どのアプリケーションを開発するにしても、セキュリティに関しては、2つの主要な原則があります。
ko: 어떤 응용 프로그램을 개발하든 보안에 관한 두 가지 주요 원칙이 있습니다.
ru: Существуют два основных принципа,когда речь идет о безопасности,независимо от того,какое приложение разрабатывается:

source: There are two methods to generate tags wrapping embedded styles and scripts:
ja: 埋め込みスタイルやスクリプトをラッピングしたタグを生成する方法は2つあります。
ko: 임베디드 스타일과 스크립트를 래핑하여 태그를 생성하는 방법에는 두 가지가 있습니다.
ru: Существует два метода генерации тегов,обертывающих встроенные стили и скрипты:

source: There are two methods you can use to get common URLs: home URL and base URL of the current request. In order to get home URL, use the following:
ja: 共通のURLを取得するには、ホームURLと現在のリクエストのベースURLの2つの方法があります。ホームURLを取得するには、以下のようにします。
ko: 공통 URL을 얻는 데 사용할 수있는 두 가지 방법이 있습니다 : 현재 요청의 홈 URL과 기본 URL. 홈 URL을 얻으려면 다음을 사용하십시오.
ru: Есть два метода,которые вы можете использовать для получения общих URL:домашний URL и базовый URL текущего запроса.Чтобы получить домашний URL,используйте следующие методы:

source: There are two types of applications: <a href="yii-web-application">Web applications</a> and <a href="yii-console-application">console applications</a>. As the names indicate, the former mainly handles Web requests, while the latter handles console command requests.
ja: <a href="yii-web-application">アプリケーションには</a>、Webアプリケーションと<a href="yii-console-application">コンソールアプリケーションの</a> 2種類があります。名前が示すように、前者は主にWeb要求を処理し、後者はコンソールコマンド要求を処理します。
ko: 응용 프로그램에는 <a href="yii-web-application">웹 응용 프로그램</a> 과 <a href="yii-console-application">콘솔 응용 </a>프로그램 의 두 가지 유형이 있습니다 . 이름에서 알 수 있듯이 전자는 주로 웹 요청을 처리하고 후자는 콘솔 명령 요청을 처리합니다.
ru: Есть два типа приложений: <a href="yii-web-application">веб-приложения</a> и <a href="yii-console-application">консольные приложения</a> . Как видно из названий, первый в основном обрабатывает веб-запросы, а второй - запросы консольных команд.

source: There are two ways of using <a href="guide-db-dao#performing-transactions">transactions</a> while working with Active Record.
ja: Active Recordでの作業中に<a href="guide-db-dao#performing-transactions">トランザクション</a>を使用する方法は2つあります。
ko: Active Record로 작업하는 동안 <a href="guide-db-dao#performing-transactions">트랜잭션</a> 을 사용하는 두 가지 방법이 있습니다 .
ru: Есть два способа использования <a href="guide-db-dao#performing-transactions">транзакций</a> при работе с Active Record.

source: There is a Bug with Internet Explorer 6, 7 and 8 when X-SENDFILE is used over an SSL connection, it will show an error message like this: "Internet Explorer was not able to open this Internet site. The requested site is either unavailable or cannot be found.". You can work around this problem by removing the <code>Pragma</code>-header.
ja: X-SENDFILEがSSL接続で使用されている場合、Internet Explorer 6、7、8にはバグがあり、次のようなエラーメッセージが表示されます：「Internet Explorerはこのインターネットサイトを開けませんでした。リクエストされたサイトも使用できないまたは見つかりません。」この問題は、 <code>Pragma</code> ヘッダーを削除することで回避できます。
ko: SSL 연결을 통해 X-SENDFILE을 사용하면 Internet Explorer 6, 7 및 8에 버그가 있습니다. "Internet Explorer에서이 인터넷 사이트를 열 수 없습니다. 요청한 사이트를 사용할 수 없습니다. 찾을 수 없습니다. " <code>Pragma</code> -header 를 제거하여이 문제를 해결할 수 있습니다 .
ru: При использовании X-SENDFILE через SSL-соединение возникает ошибка Internet Explorer 6, 7 и 8, отображается сообщение об ошибке следующего вида: &laquo;Internet Explorer не смог открыть этот сайт в Интернете. Запрошенный сайт либо недоступен. или не может быть найден. ". Вы можете обойти эту проблему, удалив <code>Pragma</code> -header.

source: There is also another approach that can be faster and more useful - SQL views. For example, if we need to show the gridview with users and their profiles, we can do so in this way:
ja: また、より速く、より有用な方法として、SQLビューを使用する方法もあります。例えば、ユーザーとそのプロフィールを持つグリッドビューを表示する必要がある場合、このような方法で表示することができます。
ko: 더 빠르고 유용 할 수있는 또 다른 접근법 인 SQL보기도 있습니다. 예를 들어, 사용자 및 해당 프로파일과 함께 gridview를 표시해야하는 경우 다음과 같이 수행 할 수 있습니다.
ru: Существует и другой подход,который может быть более быстрым и полезным-SQL-виды.Например,если нам нужно показать сетку с пользователями и их профилями,мы можем сделать это таким образом:

source: There is even more abstract way to deal with events. You can create a separated interface for the special event and implement it in classes, where you need it.
ja: イベントを扱うには、もっと抽象的な方法があります。特別なイベントのために分離されたインターフェイスを作成して、必要なところにクラスで実装することができます。
ko: 이벤트를 처리하는 더 추상적 인 방법이 있습니다. 특별 이벤트에 대해 별도의 인터페이스를 작성하고 필요한 경우 클래스에서 구현할 수 있습니다.
ru: Есть еще более абстрактный способ справляться с событиями.Вы можете создать отдельный интерфейс для специального события и реализовать его в классах,где это необходимо.

source: There is no need to hash inputs or outputs of <a href="yii-base-security#encryptByKey()-detail">encryptByKey()</a> or <a href="yii-base-security#encryptByPassword()-detail">encryptByPassword()</a> as those methods perform the task.
ja: <a href="yii-base-security#encryptByKey()-detail">encryptByKey（）</a>または<a href="yii-base-security#encryptByPassword()-detail">encryptByPassword（）の</a>入力または出力をハッシュする必要はありません。これらのメソッドがタスクを実行するためです。
ko: 해당 메소드가 태스크를 수행하므로 <a href="yii-base-security#encryptByKey()-detail">encryptByKey ()</a> 또는 <a href="yii-base-security#encryptByPassword()-detail">encryptByPassword ()</a> 의 입력 또는 출력을 해시 할 필요가 없습니다 .
ru: Нет необходимости хэшировать входные и выходные данные <a href="yii-base-security#encryptByKey()-detail">encryptByKey ()</a> или <a href="yii-base-security#encryptByPassword()-detail">encryptByPassword (),</a> поскольку эти методы выполняют задачу.

source: There is one final trick to make the above approach work more smoothly. Instead of directly modifying the application configuration file, you may put the bundle customization array in a separate file and conditionally include this file in the application configuration. For example,
ja: 上記のアプローチをよりスムーズに動作させるための最後のトリックがあります。アプリケーション設定ファイルを直接変更する代わりに、バンドルのカスタマイズ配列を別のファイルに入れて、このファイルを条件付きでアプリケーション設定に含めることができます。例えば、以下のようにします。
ko: 위의 접근 방식을보다 원활하게 작동시키는 마지막 트릭이 있습니다. 애플리케이션 구성 파일을 직접 수정하는 대신 번들 사용자 정의 배열을 별도의 파일에 넣고이 파일을 조건부로 애플리케이션 구성에 포함시킬 수 있습니다. 예를 들어
ru: Есть один последний трюк,чтобы сделать вышеописанный подход более гладким.Вместо того чтобы непосредственно изменить файл конфигурации приложения,вы можете положить массив настройки пакета в отдельный файл и условно включить этот файл в конфигурацию приложения.Например,

source: There's a method to generate hyperlinks conveniently:
ja: ハイパーリンクを便利に生成する方法があります。
ko: 하이퍼 링크를 편리하게 생성하는 방법이 있습니다.
ru: Есть способ удобно генерировать гиперссылки:

source: There's an <code>offset</code> parameter for the cases when the string is like the following:
ja: 文字列が次のような場合の <code>offset</code> パラメータがあります。
ko: 문자열이 다음과 같은 경우에 대한 <code>offset</code> 매개 변수 가 있습니다 .
ru: Есть параметр <code>offset</code> для случаев, когда строка имеет следующий вид:
