Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/yii/yii.*.022.xlf
Languages: ja, ko, ru

source: The rules for converting a word into its plural form. The keys are the regular expressions and the values are the corresponding replacements.
ja: 単語を複数形に変換するための規則です。キーは正規表現、値は対応する置換子です。
ko: 단어를 복수형으로 변환하는 규칙. 키는 정규식이고 값은 해당하는 대체입니다.
ru: Правила преобразования слова во множественное число.Клавиши являются регулярными выражениями,а значения-соответствующими заменами.

source: The rules for converting a word into its singular form.
ja: 単語を単数形に変換するためのルール。
ko: 단어를 단수형으로 변환하는 규칙.
ru: Правила преобразования слова в его единственную форму.

source: The rules for converting a word into its singular form. The keys are the regular expressions and the values are the corresponding replacements.
ja: 単語を単数形に変換するための規則です。キーは正規表現であり、値は対応する置換子です。
ko: 단어를 단수형으로 변환하는 규칙. 키는 정규식이고 값은 해당하는 대체입니다.
ru: Правила преобразования слова в его единственную форму.Ключи являются регулярными выражениями,а значения-соответствующими заменами.

source: The rules for creating and parsing URLs when <a href="yii-web-urlmanager#%24enablePrettyUrl-detail">$enablePrettyUrl</a> is <code>true</code>.
ja: <a href="yii-web-urlmanager#%24enablePrettyUrl-detail">$ enablePrettyUrl</a>が <code>true</code> の場合のURLの作成と解析のルール。
ko: <a href="yii-web-urlmanager#%24enablePrettyUrl-detail">$ enablePrettyUrl</a> 이 <code>true</code> 일 때 URL을 작성하고 구문 분석하는 규칙입니다 .
ru: Правила для создания и анализа URL , когда <a href="yii-web-urlmanager#%24enablePrettyUrl-detail">$ enablePrettyUrl</a> это <code>true</code> .

source: The rules for creating and parsing URLs when <a href="yii-web-urlmanager#%24enablePrettyUrl-detail">$enablePrettyUrl</a> is <code>true</code>. This property is used only if <a href="yii-web-urlmanager#%24enablePrettyUrl-detail">$enablePrettyUrl</a> is <code>true</code>. Each element in the array is the configuration array for creating a single URL rule. The configuration will be merged with <a href="yii-web-urlmanager#%24ruleConfig-detail">$ruleConfig</a> first before it is used for creating the rule object.
ja: <a href="yii-web-urlmanager#%24enablePrettyUrl-detail">$ enablePrettyUrl</a>が <code>true</code> の場合のURLの作成と解析のルール。このプロパティは、<a href="yii-web-urlmanager#%24enablePrettyUrl-detail">$ enablePrettyUrl</a>が <code>true</code> の場合にのみ使用されます。配列の各要素は、単一のURLルールを作成するための構成配列です。構成は、ルールオブジェクトの作成に使用される前に、まず<a href="yii-web-urlmanager#%24ruleConfig-detail">$ ruleConfig</a>とマージされます。
ko: <a href="yii-web-urlmanager#%24enablePrettyUrl-detail">$ enablePrettyUrl</a> 이 <code>true</code> 일 때 URL을 작성하고 구문 분석하는 규칙입니다 . 이 속성은 <a href="yii-web-urlmanager#%24enablePrettyUrl-detail">$ enablePrettyUrl</a> 이 <code>true</code> 인 경우에만 사용됩니다 . 배열의 각 요소는 단일 URL 규칙을 만들기위한 구성 배열입니다. 구성은 규칙 오브젝트 작성에 사용되기 전에 <a href="yii-web-urlmanager#%24ruleConfig-detail">$ ruleConfig</a> 와 먼저 병합됩니다 .
ru: Правила для создания и анализа URL , когда <a href="yii-web-urlmanager#%24enablePrettyUrl-detail">$ enablePrettyUrl</a> это <code>true</code> . Это свойство используется только если <a href="yii-web-urlmanager#%24enablePrettyUrl-detail">$ enablePrettyUrl</a> это <code>true</code> . Каждый элемент в массиве представляет собой массив конфигурации для создания единого правила URL. Конфигурация будет объединена с <a href="yii-web-urlmanager#%24ruleConfig-detail">$ ruleConfig,</a> прежде чем она будет использоваться для создания объекта правила.

source: The rules indexed by the rule names
ja: ルール名でインデックス化されたルール
ko: 규칙 이름으로 색인화 된 규칙
ru: Правила,проиндексированные именами правил

source: The same applies for if you're using GBK or BIG5 charset with MySQL, then it's highly recommended to specify charset via <a href="yii-db-connection#%24dsn-detail">$dsn</a> like <code>'mysql:dbname=mydatabase;host=127.0.0.1;charset=GBK;'</code>.
ja: MySQLでGBKまたはBIG5文字セットを使用している場合も同じことが当てはまり、 <code>'mysql:dbname=mydatabase;host=127.0.0.1;charset=GBK;'</code> のように<a href="yii-db-connection#%24dsn-detail">$ dsnで</a>文字セットを指定することを強くお勧めします。。
ko: MySQL에서 GBK 또는 BIG5 문자 집합을 사용하는 경우에도 마찬가지입니다. <code>'mysql:dbname=mydatabase;host=127.0.0.1;charset=GBK;'</code> 와 같이 <a href="yii-db-connection#%24dsn-detail">$ dsn을</a> 통해 문자 집합 을 지정하는 것이 좋습니다 . .
ru: То же самое применимо, если вы используете кодировку GBK или BIG5 с MySQL, тогда настоятельно рекомендуется указывать кодировку через <a href="yii-db-connection#%24dsn-detail">$ dsn,</a> например <code>'mysql:dbname=mydatabase;host=127.0.0.1;charset=GBK;'</code> .

source: The same can be done in <code>rules()</code> method:
ja: <code>rules()</code> メソッドでも同じことができます：
ko: <code>rules()</code> 메소드 에서도 동일하게 수행 할 수 있습니다 .
ru: То же самое можно сделать в методе <code>rules()</code> :

source: The same is true for the sorting definition:
ja: ソートの定義も同様です。
ko: 정렬 정의도 마찬가지입니다.
ru: То же самое верно и для определения сортировки:

source: The same rule as applied for Modules above can be applied for widgets too, for example:
ja: 上記のモジュールに適用したのと同じルールを、例えばウィジェットにも適用することができます。
ko: 위의 모듈에 적용되는 것과 동일한 규칙을 위젯에도 적용 할 수 있습니다.
ru: То же правило,что и для вышеприведенных модулей,может быть применено,например,и для виджетов:

source: The savepoint name
ja: セーブポイント名
ko: 저장 점 이름
ru: Имя точки сохранения

source: The scenario feature is primarily used by <a href="#validation-rules">validation</a> and <a href="#massive-assignment">massive attribute assignment</a>. You can, however, use it for other purposes. For example, you may declare <a href="#attribute-labels">attribute labels</a> differently based on the current scenario.
ja: シナリオ機能は、主に<a href="#validation-rules">検証</a>と<a href="#massive-assignment">大規模な属性割り当て</a>によって使用されます。ただし、他の目的に使用することはできます。たとえば、現在のシナリオに基づいて異なる方法で<a href="#attribute-labels">属性ラベルを</a>宣言することができます。
ko: 시나리오 기능은 주로 <a href="#validation-rules">유효성 검사</a> 및 <a href="#massive-assignment">대규모 속성 할당에</a> 사용됩니다 . 그러나 다른 용도로 사용할 수 있습니다. 예를 들어, 현재 시나리오에 따라 <a href="#attribute-labels">속성 레이블을</a> 다르게 선언 할 수 있습니다.
ru: Функция сценария в основном используется для <a href="#validation-rules">проверки</a> и <a href="#massive-assignment">массового присвоения атрибутов</a> . Однако вы можете использовать его для других целей. Например, вы можете объявить <a href="#attribute-labels">метки атрибутов по-</a> разному в зависимости от текущего сценария.

source: The scenario that this model is in.
ja: このモデルのシナリオ
ko: 이 모델이있는 시나리오
ru: Сценарий,в котором находится эта модель.

source: The scenario that this model is in. Defaults to <a href="yii-base-model#SCENARIO_DEFAULT-detail">SCENARIO_DEFAULT</a>.
ja: このモデルが含まれる<a href="yii-base-model#SCENARIO_DEFAULT-detail">シナリオ</a>。デフォルトはSCENARIO_DEFAULTです。
ko: 이 모델이있는 <a href="yii-base-model#SCENARIO_DEFAULT-detail">시나리오</a> . 기본값은 SCENARIO_DEFAULT 입니다.
ru: Сценарий, в котором находится эта модель. По умолчанию <a href="yii-base-model#SCENARIO_DEFAULT-detail">SCENARIO_DEFAULT</a> .

source: The scenario to be assigned to the model before it is validated and updated.
ja: モデルが検証・更新される前に、モデルに割り当てるシナリオ。
ko: 모델을 검증하고 업데이트하기 전에 모델에 할당 할 시나리오입니다.
ru: Сценарий,который должен быть присвоен модели до того,как она будет проверена и обновлена.

source: The scenario to be assigned to the new model before it is validated and saved.
ja: 新しいモデルが検証されて保存される前に、新しいモデルに割り当てるシナリオ。
ko: 검증 및 저장하기 전에 새 모델에 할당 할 시나리오.
ru: Сценарий,который должен быть назначен новой модели,прежде чем он будет подтвержден и сохранен.

source: The scenario used for creating a model.
ja: モデルを作成する際に使用するシナリオ。
ko: 모델 생성에 사용 된 시나리오.
ru: Сценарий,используемый для создания модели.

source: The scenario used for updating a model.
ja: モデルの更新に使用するシナリオ。
ko: 모델 업데이트에 사용 된 시나리오.
ru: Сценарий,используемый для обновления модели.

source: The schema and host part of the application URL. The trailing slashes will be removed.
ja: アプリケーションURLのスキーマとホストの部分。最後のスラッシュは削除されます。
ko: 응용 프로그램 URL의 스키마 및 호스트 부분. 후행 슬래시가 제거됩니다.
ru: Схема и часть URL-адреса хоста приложения.Трейлинговые слэши будут удалены.

source: The schema information for the database opened by this connection.
ja: この接続によって開かれたデータベースのスキーマ情報。
ko: 이 연결에 의해 열린 데이터베이스의 스키마 정보.
ru: Схематическая информация для БД,открываемая этим соединением.

source: The schema information of the DB table associated with this AR class.
ja: このARクラスに関連付けられたDBテーブルのスキーマ情報。
ko: 이 AR 클래스와 연관된 DB 테이블의 스키마 정보입니다.
ru: Схематичная информация таблицы БД,связанная с этим классом AR.

source: The schema information of the Sphinx index associated with this AR class.
ja: このARクラスに関連付けられたSphinxインデックスのスキーマ情報。
ko: 이 AR 클래스와 연관된 Sphinx 색인의 스키마 정보.
ru: Информация о схеме индекса Sphinx,связанного с этим классом AR.

source: The schema information of the database table associated with this fixture.
ja: このフィクスチャに関連付けられたデータベーステーブルのスキーマ情報。
ko: 이 조명기와 연관된 데이터베이스 테이블의 스키마 정보.
ru: Схематическая информация таблицы БД,связанная с этим приспособлением.

source: The schema name of the tables. Defaults to empty string, meaning the current or default schema.
ja: テーブルのスキーマ名。デフォルトは空の文字列で、現在のスキーマまたはデフォルトのスキーマを意味します。
ko: 테이블의 스키마 이름. 기본값은 빈 문자열로, 현재 또는 기본 스키마를 의미합니다.
ru: Схематическое название таблиц.По умолчанию-пустая строка,означающая текущую схему или схему по умолчанию.

source: The schema of the tables.
ja: テーブルのスキーマ。
ko: 테이블의 스키마.
ru: Схема таблиц.

source: The schema of the tables. Defaults to empty string, meaning the current or default schema name.
ja: テーブルのスキーマ。デフォルトは空の文字列で、現在のスキーマ名またはデフォルトのスキーマ名を意味します。
ko: 테이블의 스키마. 기본값은 빈 문자열로, 현재 또는 기본 스키마 이름을 의미합니다.
ru: Схема таблиц.По умолчанию-пустая строка,означающая текущее имя схемы или имя схемы по умолчанию.

source: The schema of the tables. Defaults to empty string, meaning the current or default schema name. If not empty, the returned table names will be prefixed with the schema name.
ja: テーブルのスキーマ。デフォルトは空の文字列で、現在のスキーマ名またはデフォルトのスキーマ名を意味します。空でない場合、返されるテーブル名の前にはスキーマ名が付けられます。
ko: 테이블의 스키마. 기본값은 빈 문자열로, 현재 또는 기본 스키마 이름을 의미합니다. 비어 있지 않으면 반환 된 테이블 이름 앞에 스키마 이름이 붙습니다.
ru: Схема таблиц.По умолчанию-пустая строка,означающая текущее имя схемы или имя схемы по умолчанию.Если не пустая строка,возвращаемые имена таблиц будут иметь префикс с именем схемы.

source: The schema of the tables. Defaults to empty string, meaning the current or default schema.
ja: テーブルのスキーマ。デフォルトは空の文字列で、現在のスキーマまたはデフォルトのスキーマを意味します。
ko: 테이블의 스키마. 기본값은 빈 문자열로, 현재 또는 기본 스키마를 의미합니다.
ru: Схема таблиц.По умолчанию пустая строка,означающая текущую схему или схему по умолчанию.

source: The schema of the tables. Meaningless for MySQL.
ja: テーブルのスキーマ。MySQLでは無意味。
ko: 테이블의 스키마. MySQL에게는 의미가 없습니다.
ru: Схема таблиц.Бессмысленно для MySQL.

source: The schema of the tables. Meaningless for SQLite.
ja: テーブルのスキーマ。SQLiteでは無意味。
ko: 테이블의 스키마. SQLite에는 의미가 없습니다.
ru: Схема таблиц.Бессмысленно для SQLite.

source: The schema of the views. Defaults to empty string, meaning the current or default schema name. If not empty, the returned view names will be prefixed with the schema name.
ja: ビューのスキーマ。デフォルトは空の文字列で、現在のスキーマ名またはデフォルトのスキーマ名を意味します。空でない場合、返されるビュー名の前にはスキーマ名が付けられます。
ko: 뷰의 스키마. 기본값은 빈 문자열로, 현재 또는 기본 스키마 이름을 의미합니다. 비어 있지 않으면 반환 된 뷰 이름 앞에 스키마 이름이 붙습니다.
ru: Схема взглядов.По умолчанию пустая строка,означающая текущее имя схемы или имя схемы по умолчанию.Если не пустая строка,возвращаемые имена представлений будут префиксованы с именем схемы.

source: The schema of the views. Defaults to empty string, meaning the current or default schema.
ja: ビューのスキーマ。デフォルトは空の文字列で、現在のスキーマまたはデフォルトのスキーマを意味します。
ko: 뷰의 스키마. 기본값은 빈 문자열로, 현재 또는 기본 스키마를 의미합니다.
ru: Схема взглядов.По умолчанию пустая строка,означающая текущую схему или схему по умолчанию.

source: The scheme to use for the URL (either <code>http</code>, <code>https</code> or empty string for protocol-relative URL). If not specified the scheme of the current request will be used.
ja: URLに使用するスキーム（ <code>http</code> 、 <code>https</code> 、またはプロトコル相対URLの空の文字列）。指定しない場合は、現在のリクエストのスキームが使用されます。
ko: URL에 사용할 체계 ( <code>http</code> , <code>https</code> 또는 프로토콜 기준 URL의 경우 빈 문자열). 지정하지 않으면 현재 요청의 체계가 사용됩니다.
ru: Схема, используемая для URL-адреса ( <code>http</code> , <code>https</code> или пустая строка для URL-адреса , зависящего от протокола). Если не указано иное, будет использоваться схема текущего запроса.

source: The script content
ja: スクリプトの内容
ko: 스크립트 내용
ru: Содержание сценария

source: The searching is based on the specified language code. In particular, a file with the same name will be looked for under the subdirectory whose name is the same as the language code. For example, given the file "path/to/view.php" and language code "zh-CN", the localized file will be looked for as "path/to/zh-CN/view.php". If the file is not found, it will try a fallback with just a language code that is "zh" i.e. "path/to/zh/view.php". If it is not found as well the original file will be returned.
ja: 指定された言語コードに基づいて検索します。特に、同じ名前のファイルは、言語コードと同じ名前のサブディレクトリの下で検索されます。例えば、ファイル「path/to/view.php」と言語コード「zh-CN」が指定されている場合、ローカライズされたファイルは「path/to/zh-CN/view.php」として検索されます。もしファイルが見つからない場合は、言語コードが "zh "のフォールバック、つまり "path/to/zh/view.php "を試します。もしファイルが見つからなければ、元のファイルが返されます。
ko: 검색은 지정된 언어 코드를 기반으로합니다. 특히, 이름이 언어 코드와 동일한 서브 디렉토리에서 동일한 이름을 가진 파일을 찾습니다. 예를 들어, 파일 "path / to / view.php"및 언어 코드 "zh-CN"이 지정된 경우 지역화 된 파일은 "path / to / zh-CN / view.php"로 나타납니다. 파일이 없으면 "zh"인 언어 코드 (예 : "path / to / zh / view.php")로 대체를 시도합니다. 찾을 수 없으면 원본 파일이 반환됩니다.
ru: Поиск осуществляется по заданному коду языка.В частности,файл с таким же именем будет искаться в подкаталоге,имя которого совпадает с кодом языка.Например,учитывая файл "path/to/view.php" и код языка "zh-CN",локализованный файл будет искаться как "path/to/zh-CN/view.php".Если файл не найден,он попробует откатиться назад только с кодом языка "zh",т.е."path/to/zh/view.php".Если он не найден,то будет возвращен исходный файл.

source: The second approach is used by application code which needs to register some code to be run during the bootstrap process. This is done by configuring the <a href="yii-base-application#bootstrap()-detail">yii\base\Application::bootstrap()</a> property:
ja: 2番目のアプローチは、ブートストラッププロセス中に実行されるいくつかのコードを登録する必要があるアプリケーションコードによって使用されます。これを行うには、<a href="yii-base-application#bootstrap()-detail">yii \ base \ Application :: bootstrap（）</a>プロパティを設定します。
ko: 두 번째 방법은 부트 스트랩 프로세스 중에 실행될 일부 코드를 등록해야하는 애플리케이션 코드에서 사용됩니다. 이것은<a href="yii-base-application#bootstrap()-detail">yii \ base \ Application :: bootstrap ()</a> 속성 됩니다.
ru: Второй подход используется кодом приложения, которому необходимо зарегистрировать некоторый код для запуска во время процесса начальной загрузки. Это делается путем настройки свойства <a href="yii-base-application#bootstrap()-detail">yii \ base \ Application :: bootstrap ()</a> :

source: The second argument is conversion mapping per class. We're setting a mapping for <code>Post</code> model. Each mapping array contains a set of mappings. Each mapping could be:
ja: 2番目の引数は、クラスごとの変換マッピングです。 <code>Post</code> モデルのマッピングを設定しています。各マッピング配列には、一連のマッピングが含まれています。各マッピングは次のようになります。
ko: 두 번째 인수는 클래스 당 변환 매핑입니다. <code>Post</code> 에 대한 매핑을 설정하고 있습니다 모델에 있습니다. 각 매핑 배열에는 일련의 매핑이 포함됩니다. 각 매핑은 다음과 같습니다.
ru: Второй аргумент - сопоставление преобразования для каждого класса. Мы устанавливаем отображение для модели <code>Post</code> . Каждый массив сопоставлений содержит набор сопоставлений. Каждое сопоставление может быть:

source: The second argument specifies the HTML attributes for the resulting <code>&lt;link&gt;</code> tag. The option <code>depends</code> is specially handled. It specifies which asset bundles this CSS file depends on. In this case, the dependent asset bundle is <a href="yii-bootstrap-bootstrapasset">BootstrapAsset</a>. This means the CSS file will be added <em>after</em> the CSS files from <a href="yii-bootstrap-bootstrapasset">BootstrapAsset</a>.
ja: 2番目の引数は、結果の <code>&lt;link&gt;</code> タグのHTML属性を指定します。オプションに <code>depends</code> は特別に処理されます。このCSSファイルが依存するアセットバンドルを指定します。この場合、依存アセットバンドルは<a href="yii-bootstrap-bootstrapasset">BootstrapAsset</a>です。つまり、CSSファイルは<a href="yii-bootstrap-bootstrapasset">BootstrapAsset</a>からのCSSファイルの<em>後</em>に追加されます。
ko: 두 번째 인수는 결과 <code>&lt;link&gt;</code> 태그 의 HTML 속성을 지정합니다 . 이 옵션은 <code>depends</code> 특수하게 처리됩니다. 이 CSS 파일이 의존하는 자산 번들을 지정합니다. 이 경우 종속 자산 번들은 <a href="yii-bootstrap-bootstrapasset">BootstrapAsset</a> 입니다. 이것은 CSS 파일이 <a href="yii-bootstrap-bootstrapasset">BootstrapAsset</a> 의 CSS 파일 <em>뒤에</em> 추가됨 <em>을</em> 의미합니다. .
ru: Второй аргумент указывает атрибуты HTML для результирующего <code>&lt;link&gt;</code> . Вариант <code>depends</code> специально обрабатывается. Он указывает, от каких пакетов ресурсов зависит этот файл CSS. В этом случае зависимым комплектом активов является <a href="yii-bootstrap-bootstrapasset">BootstrapAsset</a> . Это означает, что файл CSS будет добавлен <em>после</em> файлов CSS из <a href="yii-bootstrap-bootstrapasset">BootstrapAsset</a> .

source: The second format:
ja: 第二のフォーマット。
ko: 두 번째 형식 :
ru: Второй формат:

source: The second operand is a single value or an array of values that column value should be compared with. If it is an empty array the generated expression will be a <code>false</code> value if operator is <code>LIKE</code> or <code>OR LIKE</code>, and empty if operator is <code>NOT LIKE</code> or <code>OR NOT LIKE</code>.
ja: 2番目のオペランドは、列の値と比較する必要がある単一の値または値の配列です。空の配列の場合、生成される式は、演算子が <code>LIKE</code> または <code>OR LIKE</code> の場合は <code>false</code> 値になり、演算子が <code>NOT LIKE</code> または <code>OR NOT LIKE</code> の場合は空になります。
ko: 두 번째 피연산자는 단일 값 또는 열 값과 비교해야하는 값의 배열입니다. 이 빈 배열 인 경우, 생성 식은 것이다 <code>false</code> 조작인지 값 <code>LIKE</code> 또는 <code>OR LIKE</code> , AND 연산자가 비어 있으면 <code>NOT LIKE</code> 또는 <code>OR NOT LIKE</code> .
ru: Второй операнд - это одно значение или массив значений, с которыми следует сравнивать значение столбца. Если это пустой массив, сгенерированное выражение будет <code>false</code> значением, если оператор <code>LIKE</code> или <code>OR LIKE</code> , и пустым, если оператор <code>NOT LIKE</code> или <code>OR NOT LIKE</code> .

source: The second way is to list the DB operations that require transactional support in the <a href="yii-db-activerecord#transactions()-detail">yii\db\ActiveRecord::transactions()</a> method. For example,
ja: 2番目の方法は、<a href="yii-db-activerecord#transactions()-detail">yii \ db \ ActiveRecord :: transactions（）</a>メソッドでトランザクションサポートを必要とするDB操作をリストすることです。例えば、
ko: 두 번째 방법은 <a href="yii-db-activerecord#transactions()-detail">yii \ db \ ActiveRecord :: transactions ()</a> 에서 트랜잭션 지원이 필요한 DB 작업을 나열하는 것입니다 메소드 것입니다. 예를 들어
ru: Второй способ - перечислить операции БД, требующие поддержки транзакций, в методе <a href="yii-db-activerecord#transactions()-detail">yii \ db \ ActiveRecord :: transaction ()</a> . Например,

source: The secret key that was previously used to generate the hash for the data in <a href="yii-base-security#hashData()-detail">hashData()</a>. function to see the supported hashing algorithms on your system. This must be the same as the value passed to <a href="yii-base-security#hashData()-detail">hashData()</a> when generating the hash for the data.
ja: 以前に<a href="yii-base-security#hashData()-detail">hashData（）で</a>データのハッシュを生成するために使用された秘密鍵。システムでサポートされているハッシュアルゴリズムを表示する関数。これは、データのハッシュを生成するときに<a href="yii-base-security#hashData()-detail">hashData（）</a>に渡される値と同じである必要があります。
ko: <a href="yii-base-security#hashData()-detail">hashData ()</a> 의 데이터에 대한 해시를 생성하는 데 이전에 사용 된 비밀 키입니다 . 시스템에서 지원되는 해싱 알고리즘을 볼 수 있습니다. 데이터의 해시를 생성 할 때 <a href="yii-base-security#hashData()-detail">hashData ()에</a> 전달 된 값과 같아야 합니다.
ru: Секретный ключ, который ранее использовался для генерации хэша данных в <a href="yii-base-security#hashData()-detail">hashData ()</a> . для просмотра поддерживаемых алгоритмов хеширования в вашей системе. Это должно быть то же самое, что и значение, переданное в <a href="yii-base-security#hashData()-detail">hashData ()</a> при генерации хэша для данных.

source: The secret key to be used for generating hash. Should be a secure cryptographic key.
ja: ハッシュを生成するために使用する秘密鍵。安全な暗号鍵でなければなりません。
ko: 해시 생성에 사용되는 비밀 키입니다. 안전한 암호화 키 여야합니다.
ru: Секретный ключ для генерации гашиша.Должен быть защищенный криптографический ключ.

source: The section name, e.g., <code>{summary}</code>, <code>{items}</code>.
ja: セクション名。たとえば、 <code>{summary}</code> 、 <code>{items}</code> 。
ko: 섹션 이름, 예를 들어, <code>{summary}</code> , <code>{items}</code> .
ru: Название раздела, например <code>{summary}</code> , <code>{items}</code> .

source: The security application component.
ja: セキュリティアプリケーションのコンポーネント。
ko: 보안 응용 프로그램 구성 요소
ru: Компонент приложения безопасности.

source: The selected value(s). String for single or array for multiple selection(s).
ja: 選択された値。単一選択の場合は文字列、複数選択の場合は配列。
ko: 선택된 값. 다중 선택을위한 단일 또는 배열의 문자열입니다.
ru: Выбранные значения.Строка для одиночного или массива для множественного выделения.

source: The selection of the drop-down list is taken from the value of the model attribute.
ja: ドロップダウンリストの選択は、モデル属性の値から取られます。
ko: 드롭 다운 목록의 선택은 모델 속성 값에서 가져옵니다.
ru: Выбор выпадающего списка происходит из значения атрибута модели.

source: The selection of the list box is taken from the value of the model attribute.
ja: リストボックスの選択は、モデル属性の値から取られます。
ko: 목록 상자의 선택은 모델 속성 값에서 가져옵니다.
ru: Выбор окошка списка происходит из значения атрибута модели.

source: The self link.
ja: セルフリンクです。
ko: 자기 링크.
ru: Самодостаточная связь.

source: The sender
ja: 送信者
ko: 발신자
ru: Отправитель

source: The sender of this event.
ja: このイベントの送信者。
ko: 이 이벤트의 발신자
ru: Отправитель этого мероприятия.

source: The sender of this event. If not set, this property will be set as the object whose <code>trigger()</code> method is called. This property may also be a <code>null</code> when this event is a class-level event which is triggered in a static context.
ja: このイベントの送信者。設定されていない場合、このプロパティは、 <code>trigger()</code> メソッドが呼び出されるオブジェクトとして設定されます。このイベントが静的コンテキストでトリガーされるクラスレベルのイベントである場合、このプロパティは <code>null</code> になることもあります。
ko: 이 이벤트의 발신자 설정하지 않으면이 속성이 <code>trigger()</code> 메서드가 호출 되는 객체로 설정됩니다 . 이 이벤트가 정적 컨텍스트에서 트리거되는 클래스 수준 이벤트 인 경우이 속성이 <code>null</code> 일 수도 있습니다 .
ru: Отправитель этого события. Если не задан, это свойство будет установлено как объект, для которого <code>trigger()</code> метод trigger () . Это свойство также может быть <code>null</code> если это событие является событием уровня класса, которое запускается в статическом контексте.

source: The separator between different fragments of a SQL statement.
ja: SQL文の異なるフラグメント間の区切り文字。
ko: SQL 문의 여러 조각 사이의 구분 기호입니다.
ru: Разделитель между различными фрагментами SQL-запроса.

source: The separator between different fragments of a SQL statement. Defaults to an empty space. This is mainly used by <a href="yii-db-querybuilder#build()-detail">build()</a> when generating a SQL statement.
ja: SQLステートメントの異なるフラグメント間のセパレーター。デフォルトは空白です。これは主に、SQLステートメントを生成するときに<a href="yii-db-querybuilder#build()-detail">build（）</a>によって使用されます。
ko: SQL 문의 여러 조각 사이의 구분 기호입니다. 빈 공간이 기본값입니다. 주로 SQL 문을 생성 할 때 <a href="yii-db-querybuilder#build()-detail">build ()에</a> 의해 사용됩니다 .
ru: Разделитель между различными фрагментами оператора SQL. По умолчанию пустое пространство. В основном это используется <a href="yii-db-querybuilder#build()-detail">build ()</a> при генерации оператора SQL.

source: The separator between different fragments of a SQL statement. Defaults to an empty space. This is mainly used by <a href="yii-sphinx-querybuilder#build()-detail">build()</a> when generating a SQL statement.
ja: SQLステートメントの異なるフラグメント間のセパレーター。デフォルトは空白です。これは主に、SQLステートメントを生成するときに<a href="yii-sphinx-querybuilder#build()-detail">build（）</a>によって使用されます。
ko: SQL 문의 여러 조각 사이의 구분 기호입니다. 빈 공간이 기본값입니다. 주로 SQL 문을 생성 할 때 <a href="yii-sphinx-querybuilder#build()-detail">build ()에</a> 의해 사용됩니다 .
ru: Разделитель между различными фрагментами оператора SQL. По умолчанию пустое пространство. В основном это используется <a href="yii-sphinx-querybuilder#build()-detail">build ()</a> при генерации оператора SQL.
