Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/yii/yii.*.022.xlf
Languages: ja, ko, ru

source: This command will list all migrations that have not been applied so far. If you confirm that you want to apply these migrations, it will run the <code>up()</code> or <code>safeUp()</code> method in every new migration class, one after another, in the order of their timestamp values. If any of the migrations fails, the command will quit without applying the rest of the migrations.
ja: このコマンドは、これまでに適用されていないすべての移行を一覧表示します。これらの移行を適用することを確認すると、タイムスタンプ値の順序で、新しい移行クラスごとに <code>up()</code> または <code>safeUp()</code> メソッドが順番に実行されます。移行のいずれかが失敗した場合、コマンドは残りの移行を適用せずに終了します。
ko: 이 명령은 지금까지 적용되지 않은 모든 마이그레이션을 나열합니다. 이러한 마이그레이션을 적용 할 것임을 확인하면 모든 새 마이그레이션 클래스에서 <code>up()</code> 또는 <code>safeUp()</code> 메서드가 타임 스탬프 값의 순서대로 하나씩 실행됩니다. 마이그레이션 중 하나라도 실패하면 나머지 마이그레이션을 적용하지 않고 명령이 종료됩니다.
ru: Эта команда выведет список всех миграций, которые еще не были применены. Если вы подтвердите, что хотите применить эти миграции, он будет запускать метод <code>up()</code> или <code>safeUp()</code> в каждом новом классе миграции, один за другим, в порядке их значений меток времени. Если какая-либо из миграций завершится неудачно, команда завершится без применения остальных миграций.

source: This command will search through source code files and extract messages that need to be translated in different languages.
ja: このコマンドは、ソースコードファイルを検索し、異なる言語に翻訳する必要があるメッセージを抽出します。
ko: 이 명령은 소스 코드 파일을 검색하여 다른 언어로 번역해야하는 메시지를 추출합니다.
ru: Эта команда будет искать в файлах исходного кода и извлекать сообщения,которые необходимо перевести на разные языки.

source: This command will show the list of migrations that have been applied so far. For example,
ja: このコマンドは、これまでに適用されたマイグレーションのリストを表示します。例えば、以下のようになります。
ko: 이 명령은 지금까지 적용된 마이그레이션 목록을 표시합니다. 예를 들어
ru: Эта команда покажет список миграций,которые были применены до сих пор.Например,

source: This command will show the new migrations that have not been applied. For example,
ja: このコマンドは、適用されていない新しいマイグレーションを表示します。例えば、以下のようになります。
ko: 이 명령은 적용되지 않은 새 마이그레이션을 보여줍니다. 예를 들어
ru: Эта команда покажет новые миграции,которые не были применены.Например,

source: This component relies on PHP <code>flock()</code> function.
ja: このコンポーネントは、PHPの <code>flock()</code> 関数に依存しています。
ko: 이 컴포넌트는 PHP <code>flock()</code> 함수 에 의존 합니다.
ru: Этот компонент основан на функции PHP <code>flock()</code> .

source: This constant represents a fatal error in the HHVM engine. PHP Zend runtime won't call the error handler on fatals, HHVM will, with an error code of 16777217 We will handle fatal error a bit different on HHVM.
ja: この定数は、HHVM エンジンにおける致命的なエラーを表します。PHP Zend ランタイムは致命的なエラーに対してエラーハンドラをコールしませんが、 HHVM はエラーコードが 16777217 の場合にはエラーハンドラをコールします。
ko: 이 상수는 HHVM 엔진의 치명적인 오류를 나타냅니다. PHP Zend 런타임은 치명적인 오류 처리기를 호출하지 않습니다. HHVM은 16777217의 오류 코드로 치명적인 오류를 처리합니다. HHVM에서는 약간 다릅니다.
ru: Эта константа представляет собой фатальную ошибку в двигателе HHVM.Во время выполнения PHP Zend обработчик ошибок не будет вызываться на фатальных ошибках,HHVM будет,с кодом ошибки 16777217 Мы будем обрабатывать фатальные ошибки немного по-другому на HHVM.

source: This event class is used for Events triggered by the <a href="yii-web-user">yii\web\User</a> class.
ja: このイベントクラスは、<a href="yii-web-user">yii \ web \ User</a>クラスによってトリガーされるイベントに使用されます。
ko: 이 이벤트 클래스는 <a href="yii-web-user">yii \ web \ User</a> 클래스 에 의해 트리거 된 이벤트에 사용됩니다 .
ru: Этот класс событий используется для событий, запускаемых классом <a href="yii-web-user">yii \ web \ User</a> .

source: This event is triggered <em>after</em> an application finishes handling a request but <em>before</em> sending the response. The actual event name is <code>afterRequest</code>.
ja: このイベントは、アプリケーションが要求の処理を<em>完了し</em>た<em>後</em>、応答を送信する<em>前に</em>トリガーさ<em>れ</em>ます。実際のイベント名は <code>afterRequest</code> です。
ko: 이 이벤트는 애플리케이션이 요청 처리를 완료 <em>한 후</em> 응답을 보내기 <em>전에</em> 트리거 됩니다. 실제 이벤트 이름은 <code>afterRequest</code> 입니다.
ru: Это событие запускается <em>после того,</em> как приложение завершает обработку запроса, но <em>до</em> отправки ответа. Фактическое название события - <code>afterRequest</code> .

source: This event is triggered <em>after</em> running every <a href="guide-structure-controllers">controller action</a>. The actual event name is <code>afterAction</code>.
ja: このイベントは<em>、</em>すべての<a href="guide-structure-controllers">コントローラーアクションの</a>実行<em>後に</em>トリガーさ<em>れ</em>ます。実際のイベント名は <code>afterAction</code> です。
ko: 이 이벤트는 모든 <a href="guide-structure-controllers">컨트롤러 작업 </a><em>을</em> 실행 <em>한 후에</em> 트리거 됩니다 . 실제 이벤트 이름은 <code>afterAction</code> 입니다.
ru: Это событие запускается <em>после</em> выполнения каждого <a href="guide-structure-controllers">действия контроллера</a> . Фактическое название события - <code>afterAction</code> .

source: This event is triggered <em>before</em> an application handles a request. The actual event name is <code>beforeRequest</code>.
ja: このイベントは、アプリケーションがリクエストを処理する<em>前に</em>トリガーされます。実際のイベント名は <code>beforeRequest</code> です。
ko: 이 이벤트는 애플리케이션이 요청을 처리 <em>하기 전에</em> 트리거 됩니다. 실제 이벤트 이름은 <code>beforeRequest</code> 입니다.
ru: Это событие запускается <em>до того,</em> как приложение обработает запрос. Фактическое название события - <code>beforeRequest</code> .

source: This event is triggered <em>before</em> running every <a href="guide-structure-controllers">controller action</a>. The actual event name is <code>beforeAction</code>.
ja: このイベントは、すべての<a href="guide-structure-controllers">コントローラーアクションを</a>実行<em>する前に</em>トリガーされます。実際のイベント名は <code>beforeAction</code> です。
ko: 이 이벤트는 모든 <a href="guide-structure-controllers">컨트롤러 작업을</a> 실행 <em>하기 전에</em> 트리거 됩니다 . 실제 이벤트 이름은 <code>beforeAction</code> 입니다.
ru: Это событие запускается <em>перед</em> запуском каждого <a href="guide-structure-controllers">действия контроллера</a> . Фактическое название события - <code>beforeAction</code> .

source: This example will generate the following HTML:
ko: 이 예제는 다음 HTML을 생성합니다.

source: This exception thrown when the requested range is not satisfiable: the client asked for a portion of the file (byte serving), but the server cannot supply that portion. For example, if the client asked for a part of the file that lies beyond the end of the file.
ko: 요청 된 범위를 만족할 수없는 경우이 예외가 발생합니다. 클라이언트가 파일의 일부 (바이트 제공)를 요청했지만 서버가 해당 부분을 제공 할 수 없습니다. 예를 들어, 클라이언트가 파일 끝을 넘어 파일의 일부를 요청한 경우.

source: This field can be specified as a PHP callback of following signature:
ko: 이 필드는 다음 서명의 PHP 콜백으로 지정할 수 있습니다.

source: This field is not present in the trait in order to avoid possible PHP Fatal error on definition conflict.
ko: 정의 충돌시 발생할 수있는 PHP 치명적 오류를 피하기 위해이 필드는 특성에 존재하지 않습니다.

source: This filter provides protection against <a href="https://www.acunetix.com/vulnerabilities/web/host-header-attack">'host header' attacks</a>, allowing action execution only for specified host names.
ko: 이 필터는 <a href="https://www.acunetix.com/vulnerabilities/web/host-header-attack">'호스트 헤더'공격</a> 에 대한 보호 기능을 제공 하여 지정된 호스트 이름에 대해서만 작업을 실행할 수 있습니다.

source: This frees up the resources allocated for executing this SQL statement. Read attempts after this method call are unpredictable.
ko: 이것은이 SQL 문을 실행하기 위해 할당 된 자원을 비 웁니다. 이 메소드 호출 후 읽기 시도는 예측할 수 없습니다.

source: This function does not require the <a href="http://php.net/manual/en/book.intl.php">PHP intl extension</a> to be installed to work, but it is highly recommended to install it to get good formatting results.
ko: 이 기능을 사용하려면 <a href="http://php.net/manual/en/book.intl.php">PHP intl 확장 프로그램</a> 을 설치 하지 않아도 되지만 포맷 결과를 얻으려면 설치하는 것이 좋습니다.

source: This function requires the <a href="http://php.net/manual/en/book.intl.php">PHP intl extension</a> to be installed.
ko: 이 기능을 사용하려면 <a href="http://php.net/manual/en/book.intl.php">PHP intl 확장</a> 을 설치해야합니다.

source: This function tries to guess the columns to show from the given data if <a href="yii-grid-gridview#%24columns-detail">$columns</a> are not explicitly specified.
ko: 이 함수는 <a href="yii-grid-gridview#%24columns-detail">$ columns</a> 가 명시 적으로 지정되지 않은 경우 주어진 데이터에서 표시 할 열을 추측 합니다.

source: This function will do nothing on namespaced migrations, which are loaded by autoloading automatically. It will include the migration file, by searching <a href="yii-console-controllers-basemigratecontroller#%24migrationPath-detail">$migrationPath</a> for classes without namespace.
ko: 이 함수는 네임 스페이스 마이그레이션에서 자동로드를 통해로드되는 작업을 수행하지 않습니다. 네임 스페이스가없는 클래스의 <a href="yii-console-controllers-basemigratecontroller#%24migrationPath-detail">$ migrationPath</a> 를 검색하여 마이그레이션 파일을 포함합니다 .

source: This has to be matched with a call to <a href="yii-baseyii#endProfile()-detail">endProfile()</a> with the same category name. The begin- and end- calls must also be properly nested. For example,
ko: 이것은 동일한 카테고리 이름을 가진 <a href="yii-baseyii#endProfile()-detail">endProfile ()에</a> 대한 호출과 일치해야합니다 . 시작 및 종료 호출도 올바르게 중첩되어야합니다. 예를 들어

source: This has to be matched with a previous call to <a href="yii-baseyii#beginProfile()-detail">beginProfile()</a> with the same category name.
ko: 이것은 동일한 카테고리 이름을 가진 <a href="yii-baseyii#beginProfile()-detail">beginProfile ()에</a> 대한 이전 호출과 일치해야합니다 .

source: This however looks very complicated and involves either hardcoding the related objects table name or calling <code>Order::tableName()</code>. Since version 2.0.7, Yii provides a shortcut for this. You may now define and use the alias for the relation table like the following:
ko: 그러나 이것은 매우 복잡해 보이며 관련 객체 테이블 이름을 하드 코딩하거나 <code>Order::tableName()</code> 호출 합니다. 버전 2.0.7부터 Yii는 이에 대한 바로 가기를 제공합니다. 이제 다음과 같이 관계 테이블의 별명을 정의하고 사용할 수 있습니다.

source: This interface can typically be implemented by a user model class. For example, the following code shows how to implement this interface by a User ActiveRecord class:
ko: 이 인터페이스는 일반적으로 사용자 모델 클래스로 구현할 수 있습니다. 예를 들어 다음 코드는 User ActiveRecord 클래스로이 인터페이스를 구현하는 방법을 보여줍니다.

source: This interface is mainly used by <a href="yii-di-container">yii\di\Container</a> so that it can pass object configuration as the last parameter to the implementing class' constructor.
ko: 이 인터페이스는 주로 <a href="yii-di-container">yii \ di \ Container에서 사용</a> 되므로 객체 구성을 마지막 매개 변수로 구현 클래스 생성자에 전달할 수 있습니다.

source: This is PHP magic method that returns string representation of an object. The implementation here returns the uploaded file's name.
ko: 이것은 객체의 문자열 표현을 반환하는 PHP 매직 메소드입니다. 여기에서 구현하면 업로드 된 파일 이름이 반환됩니다.

source: This is a base class, which should be extended in order to implement the actual lock mechanism.
ko: 이것은 기본 클래스이며 실제 잠금 메커니즘을 구현하기 위해 확장되어야합니다.

source: This is a callable that will be used to generate the content of each cell.
ko: 이것은 각 셀의 내용을 생성하는 데 사용되는 호출 가능입니다.

source: This is a callable that will be used to generate the content of each cell. The signature of the function should be the following: <code>function ($model, $key, $index, $column)</code>. Where <code>$model</code>, <code>$key</code>, and <code>$index</code> refer to the model, key and index of the row currently being rendered and <code>$column</code> is a reference to the <a href="yii-grid-column">yii\grid\Column</a> object.
ko: 이것은 각 셀의 내용을 생성하는 데 사용되는 호출 가능입니다. 함수의 서명은 <code>function ($model, $key, $index, $column)</code> 이어야합니다 . 여기서 <code>$model</code> , <code>$key</code> 및 <code>$index</code> 는 현재 렌더링중인 행의 모델, 키 및 인덱스를 나타내고 <code>$column</code> 은 <a href="yii-grid-column">yii \ grid \ Column</a> 객체에 대한 참조 입니다.

source: This is a convenient method for retrieving a named column even if it does not exist.
ko: 명명 된 열이없는 경우에도 검색 할 수있는 편리한 방법입니다.

source: This is a helper method that performs message selection and internationalization.
ko: 메시지 선택 및 국제화를 수행하는 도우미 방법입니다.

source: This is a helper method that simplifies the way of writing AJAX validation code for tabular input.
ko: 이것은 테이블 형식 입력을위한 AJAX 유효성 검사 코드 작성 방법을 단순화하는 도우미 방법입니다.

source: This is a helper method that simplifies the way of writing AJAX validation code.
ko: 이것은 AJAX 유효성 검사 코드 작성 방법을 단순화하는 도우미 방법입니다.

source: This is a shortcut method of <a href="yii-i18n-i18n#translate()-detail">yii\i18n\I18N::translate()</a>.
ko: 이것은 <a href="yii-i18n-i18n#translate()-detail">yii \ i18n \ I18N :: translate ()</a> 의 바로 가기 메소드입니다 .

source: This is a shortcut method to <a href="yii-db-activequery#joinWith()-detail">joinWith()</a> with the join type set as "INNER JOIN". Please refer to <a href="yii-db-activequery#joinWith()-detail">joinWith()</a> for detailed usage of this method.
ko: 조인 유형이 "INNER JOIN"으로 설정된 <a href="yii-db-activequery#joinWith()-detail">joinWith ()에</a> 대한 바로 가기 방법 입니다. 이 메소드의 자세한 사용법은 <a href="yii-db-activequery#joinWith()-detail">joinWith ()</a> 를 참조하십시오 .

source: This is a shortcut to the concatenation of <a href="yii-web-request#%24hostInfo-detail">$hostInfo</a> and <a href="yii-web-request#%24url-detail">$url</a>.
ko: 이것은 <a href="yii-web-request#%24hostInfo-detail">$ hostInfo</a> 및 <a href="yii-web-request#%24url-detail">$ url</a> 연결에 대한 바로 가기 입니다.

source: This is a simple wrapper of PHP function date_default_timezone_get(). If time zone is not configured in php.ini or application config, it will be set to UTC by default.
ko: PHP 함수 date_default_timezone_get ()의 간단한 래퍼입니다. 시간대가 php.ini 또는 응용 프로그램 구성에서 구성되어 있지 않으면 기본적으로 UTC로 설정됩니다.

source: This is a simple wrapper of PHP function date_default_timezone_set(). Refer to the <a href="http://www.php.net/manual/en/timezones.php">php manual</a> for available timezones.
ko: PHP 함수 date_default_timezone_set ()의 간단한 래퍼입니다. <a href="http://www.php.net/manual/en/timezones.php">사용</a> 가능한 시간대 는 PHP 설명서 를 참조하십시오 .

source: This is a very useful property. It allows you to specify an array of components that should be run during the application <a href="yii-base-application#bootstrap()-detail">bootstrapping process</a>. For example, if you want a <a href="guide-structure-modules">module</a> to customize the <a href="guide-runtime-routing">URL rules</a>, you may list its ID as an element in this property.
ko: 이것은 매우 유용한 속성입니다. 응용 프로그램 <a href="yii-base-application#bootstrap()-detail">부트 스트랩 프로세스</a> 중에 실행해야 할 구성 요소 배열을 지정할 수 있습니다 . 예를 들어, <a href="guide-structure-modules">모듈</a> 이 <a href="guide-runtime-routing">URL 규칙</a> 을 사용자 정의하도록하려면 해당 ID를이 특성의 요소로 나열 할 수 있습니다.

source: This is a wrapper for <a href="http://php.net/manual/en/function.session-id.php">PHP session_id()</a>.
ko: 이것은 <a href="http://php.net/manual/en/function.session-id.php">PHP session_id ()</a> 의 래퍼입니다 .

source: This is a wrapper for <a href="http://php.net/manual/en/function.session-name.php">PHP session_name()</a>.
ko: 이것은 <a href="http://php.net/manual/en/function.session-name.php">PHP session_name ()</a> 의 래퍼입니다 .

source: This is a wrapper for <a href="http://php.net/manual/en/function.session-save-path.php">PHP session_save_path()</a>.
ko: 이것은 <a href="http://php.net/manual/en/function.session-save-path.php">PHP session_save_path ()</a> 의 래퍼입니다 .

source: This is achieved by using a "lock" mechanism. Each possibly concurrent thread cooperates by acquiring a lock before accessing the corresponding data.
ko: "잠금"메커니즘을 사용하면됩니다. 각각의 가능한 동시 스레드는 해당 데이터에 액세스하기 전에 잠금을 획득하여 협력합니다.

source: This is an analog of <a href="yii-console-controllers-migratecontroller">yii\console\controllers\MigrateController</a> for MongoDB.
ko: 이것은 <a href="yii-console-controllers-migratecontroller">mongoDB</a> 용 yii \ console \ controllers \ MigrateController 의 아날로그입니다 .

source: This is an extension of the default PDO class of MSSQL and DBLIB drivers.
ko: 이것은 MSSQL 및 DBLIB 드라이버의 기본 PDO 클래스의 확장입니다.

source: This is an extension of the default PDO class of SQLSRV driver.
ko: 이것은 SQLSRV 드라이버의 기본 PDO 클래스의 확장입니다.

source: This is an internal method meant to be called to create active record objects after fetching data from the database. It is mainly used by <a href="yii-db-activequery">yii\db\ActiveQuery</a> to populate the query results into active records.
ko: 데이터베이스에서 데이터를 가져온 후 활성 레코드 오브젝트를 작성하기 위해 호출되는 내부 메소드입니다. 주로 <a href="yii-db-activequery">yii \ db \ ActiveQuery</a> 에서 쿼리 결과를 활성 레코드로 채우는 데 사용됩니다 .

source: This is an internal method meant to be called to create active record objects after fetching data from the database. It is mainly used by <a href="yii-elasticsearch-activequery">yii\elasticsearch\ActiveQuery</a> to populate the query results into active records.
ko: 데이터베이스에서 데이터를 가져온 후 활성 레코드 오브젝트를 작성하기 위해 호출되는 내부 메소드입니다. 주로 <a href="yii-elasticsearch-activequery">yii \ elasticsearch \ ActiveQuery</a> 에서 쿼리 결과를 활성 레코드에 채우는 데 사용됩니다 .

source: This is an internal method meant to be called to create active record objects after fetching data from the database. It is mainly used by <a href="yii-sphinx-activequery">yii\sphinx\ActiveQuery</a> to populate the query results into active records.
ko: 데이터베이스에서 데이터를 가져온 후 활성 레코드 오브젝트를 작성하기 위해 호출되는 내부 메소드입니다. 주로 <a href="yii-sphinx-activequery">yii \ sphinx \ ActiveQuery</a> 에서 쿼리 결과를 활성 레코드로 채우는 데 사용됩니다 .

source: This is determined based on four factors:
ko: 이것은 네 가지 요인에 따라 결정됩니다.

source: This is determined by checking if the attribute is associated with a <a href="yii-validators-requiredvalidator">required</a> validation rule in the current <a href="yii-base-model#%24scenario-detail">$scenario</a>.
ko: 이는 속성이 현재 <a href="yii-base-model#%24scenario-detail">$ scenario</a> 의 <a href="yii-validators-requiredvalidator">필수</a> 유효성 검증 규칙 과 연관되어 있는지 확인하여 판별됩니다 .

source: This is determined by the <code>Accept-Language</code> HTTP header.
ko: 이는 <code>Accept-Language</code> HTTP 헤더에 의해 결정됩니다 .

source: This is determined by the <code>Accept</code> HTTP header. For example,
ko: 이는 <code>Accept</code> HTTP 헤더에 의해 결정됩니다 . 예를 들어

source: This is done by checking if <a href="yii-bootstrap-nav#%24route-detail">$route</a> and <a href="yii-bootstrap-nav#%24params-detail">$params</a> match that specified in the <code>url</code> option of the menu item. When the <code>url</code> option of a menu item is specified in terms of an array, its first element is treated as the route for the item and the rest of the elements are the associated parameters. Only when its route and parameters match <a href="yii-bootstrap-nav#%24route-detail">$route</a> and <a href="yii-bootstrap-nav#%24params-detail">$params</a>, respectively, will a menu item be considered active.
ko: 이는 <a href="yii-bootstrap-nav#%24route-detail">$ route</a> 및 <a href="yii-bootstrap-nav#%24params-detail">$ params</a> 가 메뉴 항목 의 <code>url</code> 옵션에 지정된 것과 일치 하는지 확인하여 수행됩니다 . 메뉴 항목 의 <code>url</code> 옵션이 배열 측면에서 지정되면 첫 번째 요소는 항목의 경로로 취급되고 나머지 요소는 연관된 매개 변수입니다. 해당 경로와 매개 변수가 각각 <a href="yii-bootstrap-nav#%24route-detail">$ route</a> 및 <a href="yii-bootstrap-nav#%24params-detail">$ params</a> 와 일치하는 경우에만 메뉴 항목이 활성화 된 것으로 간주됩니다.

source: This is done by checking if <a href="yii-widgets-menu#%24route-detail">$route</a> and <a href="yii-widgets-menu#%24params-detail">$params</a> match that specified in the <code>url</code> option of the menu item. When the <code>url</code> option of a menu item is specified in terms of an array, its first element is treated as the route for the item and the rest of the elements are the associated parameters. Only when its route and parameters match <a href="yii-widgets-menu#%24route-detail">$route</a> and <a href="yii-widgets-menu#%24params-detail">$params</a>, respectively, will a menu item be considered active.
ko: 이는 <a href="yii-widgets-menu#%24route-detail">$ route</a> 및 <a href="yii-widgets-menu#%24params-detail">$ params</a> 가 메뉴 항목 의 <code>url</code> 옵션에 지정된 것과 일치 하는지 확인하여 수행됩니다 . 메뉴 항목 의 <code>url</code> 옵션이 배열 측면에서 지정되면 첫 번째 요소는 항목의 경로로 취급되고 나머지 요소는 연관된 매개 변수입니다. 해당 경로와 매개 변수가 각각 <a href="yii-widgets-menu#%24route-detail">$ route</a> 및 <a href="yii-widgets-menu#%24params-detail">$ params</a> 와 일치하는 경우에만 메뉴 항목이 활성화 된 것으로 간주됩니다.

source: This is done by replacing underscores, dashes and dots with blanks and changing the first letter of each word to upper case. For example, 'department_name' or 'DepartmentName' will generate 'Department Name'.
ko: 밑줄, 대시 및 점을 공백으로 바꾸고 각 단어의 첫 글자를 대문자로 변경하면됩니다. 예를 들어 'department_name'또는 'DepartmentName'은 'Department Name'을 생성합니다.

source: This is equal to calling
ko: 이것은 부르는 것과 같습니다

source: This is equivalent to <code>count($provider-&gt;getModels())</code>. When <a href="yii-data-dataproviderinterface#getPagination()-detail">pagination</a> is false, this is the same as <a href="yii-data-dataproviderinterface#getTotalCount()-detail">totalCount</a>.
ko: 이것은와 같습니다 <code>count($provider-&gt;getModels())</code> . 때 <a href="yii-data-dataproviderinterface#getPagination()-detail">페이지 매김이</a> 거짓이는 동일 <a href="yii-data-dataproviderinterface#getTotalCount()-detail">에서는 totalCount</a> .

source: This is internally used as the placeholder for receiving the content registered for the beginning of the body section.
ko: 본문 부분의 시작 부분에 등록 된 콘텐츠를 받기위한 자리 표시 자로 내부적으로 사용됩니다.

source: This is internally used as the placeholder for receiving the content registered for the end of the body section.
ko: 내부적으로 본문 섹션의 끝에 등록 된 컨텐츠를 수신하기위한 플레이스 홀더로 사용됩니다.

source: This is internally used as the placeholder for receiving the content registered for the head section.
ko: 내부적으로 헤드 섹션에 등록 된 컨텐츠를 수신하기위한 플레이스 홀더로 사용됩니다.

source: This is mainly used when <a href="yii-web-urlmanager#%24enablePrettyUrl-detail">$enablePrettyUrl</a> is <code>false</code> or <a href="yii-web-urlmanager#%24showScriptName-detail">$showScriptName</a> is <code>true</code>.
ko: 주로 <a href="yii-web-urlmanager#%24enablePrettyUrl-detail">$ enablePrettyUrl</a> 이 <code>false</code> 이거나 <a href="yii-web-urlmanager#%24showScriptName-detail">$ showScriptName</a> 이 <code>true</code> 일 때 사용됩니다 .

source: This is mainly used when <a href="yii-web-urlmanager#%24enablePrettyUrl-detail">$enablePrettyUrl</a> is <code>true</code> and <a href="yii-web-urlmanager#%24showScriptName-detail">$showScriptName</a> is <code>false</code>.
ko: <a href="yii-web-urlmanager#%24enablePrettyUrl-detail">$ enablePrettyUrl</a> 이 <code>true</code> 이고 <a href="yii-web-urlmanager#%24showScriptName-detail">$ showScriptName</a> 이 <code>false</code> 인 경우 주로 사용됩니다 .

source: This is mainly used when multiple files were uploaded and saved as 'files[0]', 'files[1]', 'files[n]'..., and you can retrieve them all by passing 'files' as the name.
ko: 주로 여러 파일을 업로드하여 'files [0]', 'files [1]', 'files [n]'...으로 저장 한 경우 'files'를 이름으로 전달하여 모두 검색 할 수 있습니다. .

source: This is only effective when the <a href="http://php.net/manual/en/book.intl.php">PHP intl extension</a> is installed.
ko: 이것은 <a href="http://php.net/manual/en/book.intl.php">PHP intl 확장 기능</a> 이 설치된 경우에만 유효합니다 .

source: This is passed as a parameter <code>beforeCopy</code> to <a href="yii-helpers-basefilehelper#copyDirectory()-detail">yii\helpers\FileHelper::copyDirectory()</a>.
ko: 이것은 매개 변수로 전달되는 <code>beforeCopy</code> 에 <a href="yii-helpers-basefilehelper#copyDirectory()-detail">YII \ 도우미 \ FileHelper :: copyDirectory ()</a> .

source: This is populated with the result of a cluster nodes request when <a href="yii-elasticsearch-connection#%24autodetectCluster-detail">$autodetectCluster</a> is true.
ko: <a href="yii-elasticsearch-connection#%24autodetectCluster-detail">$ autodetectCluster</a> 가 true 인 경우 클러스터 노드 요청 결과로 채워집니다 .

source: This is required if <a href="yii-web-user#%24enableAutoLogin-detail">yii\web\User::$enableAutoLogin</a> is enabled.
ko: <a href="yii-web-user#%24enableAutoLogin-detail">yii \ web \ User :: $ enableAutoLogin</a> 이 활성화 된 경우 필요합니다 .

source: This is similar to <a href="yii-db-command#bindValue()-detail">bindValue()</a> except that it binds multiple values at a time. Note that the SQL data type of each value is determined by its PHP type.
ko: 한 번에 여러 값을 바인딩한다는 점을 제외하면 <a href="yii-db-command#bindValue()-detail">bindValue ()</a> 와 유사합니다 . 각 값의 SQL 데이터 유형은 PHP 유형에 따라 결정됩니다.
