Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/yii/yii.*.022.xlf
Languages: ja, ko, ru

source: The primary-foreign key constraint. The keys of the array refer to the attributes of the record associated with the <code>$class</code> model, while the values of the array refer to the corresponding attributes in <strong>this</strong> AR class.
ja: 主外部キー制約。配列のキーは <code>$class</code> モデルに関連付けられたレコードの属性を参照し、配列の値は<strong>この</strong> ARクラスの対応する属性を参照します。
ru: Ограничение первичного внешнего ключа. Ключи массива относятся к атрибутам записи, связанной с моделью <code>$class</code> , а значения массива относятся к соответствующим атрибутам в <strong>этом</strong> классе AR.

source: The primaryKey for elasticsearch documents is the <code>_id</code> field by default. This field is not part of the ActiveRecord attributes so you should never add <code>_id</code> to the list of <a href="yii-elasticsearch-activerecord#attributes()-detail">attributes</a>.
ja: elasticsearchドキュメントのprimaryKeyは、デフォルトでは <code>_id</code> フィールドです。このフィールドはActiveRecord属性の一部ではないため、<a href="yii-elasticsearch-activerecord#attributes()-detail">属性</a>のリストに <code>_id</code> を追加しないでください。
ru: PrimaryKey для elasticsearch документов является <code>_id</code> поля по умолчанию. Это поле не является частью атрибутов ActiveRecord, поэтому вам никогда не следует добавлять <code>_id</code> в список <a href="yii-elasticsearch-activerecord#attributes()-detail">атрибутов</a> .

source: The primaryKey value
ja: primaryKeyの値
ru: Стоимость первичного ключа

source: The probability (parts per million) that garbage collection (GC) should be performed when storing a piece of data in the cache.
ja: データの一部をキャッシュに格納する際に、ガベージコレクション(GC)が実行されるべき確率(百万分の一)。
ru: Вероятность (части на миллион),что сбор мусора (GC)должен быть выполнен при хранении части данных в кэше.

source: The probability (parts per million) that garbage collection (GC) should be performed when storing a piece of data in the cache. Defaults to 10, meaning 0.001% chance. This number should be between 0 and 1000000. A value 0 means no GC will be performed at all.
ja: キャッシュにデータを保存する際にガベージコレクション(GC)を実行する確率(百万分の一)。デフォルトは10で、0.001%の確率を意味します。この数値は 0 から 1000000 の間でなければなりません。値 0 は GC が全く実行されないことを意味します。
ru: Вероятность (части на миллион),что сбор мусора (GC)должен быть выполнен при хранении части данных в кэше.По умолчанию 10,что означает вероятность 0,001%.Это число должно быть между 0 и 1000000.Значение 0 означает,что GC не будет выполняться вообще.

source: The probability (parts per million) that garbage collection (GC) should be performed when storing a piece of data in the cache. Defaults to 100, meaning 0.01% chance. This number should be between 0 and 1000000. A value 0 meaning no GC will be performed at all.
ja: キャッシュにデータを保存する際にガベージコレクション(GC)を実行する確率(百万分の一)。デフォルトは100で、0.01%の確率を意味します。この数値は 0 から 1000000 の間でなければなりません。値 0 は GC が全く実行されないことを意味します。
ru: Вероятность (части на миллион),что сбор мусора (GC)должен быть выполнен при хранении части данных в кэше.По умолчанию 100,что означает вероятность 0,01%.Это число должно быть между 0 и 1000000.Значение 0,означающее,что никакие GC не будут выполняться вообще.

source: The probability (percentage) that the GC (garbage collection) process is started on every session initialization, defaults to 1 meaning 1% chance.
ja: GC(ガベージコレクション)プロセスがセッションの初期化ごとに開始される確率(パーセンテージ)で、デフォルトは1%の確率を意味する1です。
ru: Вероятность (в процентах)того,что процесс GC (сборка мусора)запускается при каждой инициализации сессии,по умолчанию равна 1,что означает 1% шанс.

source: The probability (percentage) that the GC (garbage collection) process is started on every session initialization.
ja: セッションの初期化ごとにGC(ガベージコレクション)プロセスが開始される確率(パーセンテージ)。
ru: Вероятность (в процентах)того,что процесс GC (сбор мусора)запускается при каждой инициализации сессии.

source: The problem with windows systems where the <a href="http://www.php.net/manual/en/function.rename.php">rename()</a> function does not work with files that are opened by some process is described in a <a href="http://www.php.net/manual/en/function.rename.php#102274">comment by Martin Pelletier</a> in the PHP documentation. By setting rotateByCopy to <code>true</code> you can work around this problem.
ja: <a href="http://www.php.net/manual/en/function.rename.php">rename（）</a>関数が一部のプロセスで開かれたファイルで機能しないWindowsシステムの問題は、PHPドキュメントの<a href="http://www.php.net/manual/en/function.rename.php#102274">Martin Pelletierによるコメントで</a>説明されています。rotateByCopyを <code>true</code> に設定すると、この問題を回避できます。
ru: Проблема с системами Windows, в которых функция <a href="http://www.php.net/manual/en/function.rename.php">rename ()</a> не работает с файлами, открытыми каким-либо процессом, описана в <a href="http://www.php.net/manual/en/function.rename.php#102274">комментарии Мартина Пеллетье</a> в документации PHP. Установив для параметра rotateByCopy значение <code>true</code> , вы можете обойти эту проблему.

source: The process of developing a feature is the following:
ja: 機能開発のプロセスは以下の通りです。
ru: Процесс разработки функции заключается в следующем:

source: The processed URL
ja: 処理されたURL
ru: Обработанный URL-адрес

source: The processed action result.
ja: 処理されたアクションの結果。
ru: Обработанный результат действия.

source: The processed data
ja: 処理されたデータ
ru: Обработанные данные

source: The processed data.
ja: 加工されたデータです。
ru: Обработанные данные.

source: The processed widget result.
ja: 処理されたウィジェットの結果。
ru: Обработанный результат виджета.

source: The processing result
ja: 処理結果
ru: Результат обработки

source: The profiling results.
ja: プロファイリングの結果。
ru: Результаты профилирования.

source: The profiling results. Each element is an array consisting of these elements: <code>info</code>, <code>category</code>, <code>timestamp</code>, <code>trace</code>, <code>level</code>, <code>duration</code>, <code>memory</code>, <code>memoryDiff</code>. The <code>memory</code> and <code>memoryDiff</code> values are available since version 2.0.11.
ja: プロファイリング結果。各要素は、これらの要素で構成される配列です： <code>info</code> 、 <code>category</code> 、 <code>timestamp</code> 、 <code>trace</code> 、 <code>level</code> 、 <code>duration</code> 、 <code>memory</code> 、 <code>memoryDiff</code> 。 <code>memory</code> と <code>memoryDiff</code> 値は、バージョン2.0.11以降で利用可能です。
ru: Результаты профилирования. Каждый элемент представляет собой массив, состоящий из следующих элементов: <code>info</code> , <code>category</code> , <code>timestamp</code> , <code>trace</code> , <code>level</code> , <code>duration</code> , <code>memory</code> , <code>memoryDiff</code> . Значения <code>memory</code> и <code>memoryDiff</code> доступны с версии 2.0.11.

source: The prompt message
ja: プロンプトメッセージ
ru: Быстрое сообщение

source: The prompt to display before waiting for input (optional)
ja: 入力を待つ前に表示するプロンプト(オプション
ru: Запрос на отображение перед ожиданием ввода (опция)

source: The proper array representation of the links.
ja: リンクの適切な配列表現。
ru: Правильное представление массива ссылок.

source: The properly escaped string.
ja: 適切にエスケープされた文字列。
ru: Правильно сбежавшая струна.

source: The properly quoted column name
ja: 適切に引用されたカラム名
ru: Правильно процитированное название колонки

source: The properly quoted column name.
ja: 適切に引用されたカラム名。
ru: Правильно процитированное название колонки.

source: The properly quoted index name
ja: 適切に引用されたインデックス名
ru: Правильно процитированное имя индекса

source: The properly quoted string
ja: 適切に引用された文字列
ru: Правильно процитированная строка

source: The properly quoted table name
ja: 適切に引用されたテーブル名
ru: Правильно процитированное название таблицы

source: The properly quoted table name.
ja: 適切に引用されたテーブル名。
ru: Правильно процитированное название таблицы.

source: The properties being copies are the ones to be used by query builders.
ja: コピーされるプロパティは、クエリビルダーが使用するプロパティです。
ru: Свойства,являющиеся копиями,являются теми,которые будут использоваться конструкторами запросов.

source: The properties can only be defined by <em>non-static</em> getters and/or setters. Static methods will not be treated in the same manner.
ja: プロパティは、<em>非静的</em>ゲッターおよび/またはセッターによってのみ定義できます。静的メソッドは同じ方法で処理されません。
ru: Свойства могут быть определены только <em>нестатическими</em> геттерами и / или сеттерами. Статические методы не будут обрабатываться таким же образом.

source: The properties corresponding to the passed options
ja: 渡されたオプションに対応するプロパティ
ru: Свойства,соответствующие переданным опциям

source: The properties described in this subsection are not commonly configured because their default values derive from common conventions. However, you may still configure them in case you want to break the conventions.
ja: このサブセクションで説明されているプロパティは、デフォルト値が一般的な慣習から派生しているため、一般的には設定されていません。しかし、規約を破りたい場合には、それらを設定することができます。
ru: Свойства,описанные в этом подразделе,обычно не конфигурируются,так как их значения по умолчанию вытекают из общих конвенций.Тем не менее,вы можете настроить их на случай,если захотите нарушить эти соглашения.

source: The properties described in this subsection often need to be configured because they differ across different applications.
ja: このサブセクションで説明されているプロパティは、アプリケーションによって異なるため、しばしば設定が必要になることがあります。
ru: Свойства,описанные в этом подразделе,часто нуждаются в настройке,так как они различаются в разных приложениях.

source: The property <a href="yii-rest-urlrule#%24controller-detail">$controller</a> is required and should represent one or multiple controller IDs. Each controller ID should be prefixed with the module ID if the controller is within a module. The controller ID used in the pattern will be automatically pluralized (e.g. <code>user</code> becomes <code>users</code> as shown in the above examples).
ja: プロパティ<a href="yii-rest-urlrule#%24controller-detail">$ controller</a>は必須であり、1つまたは複数のコントローラーIDを表す必要があります。コントローラがモジュール内にある場合は、各コントローラIDの前にモジュールIDを付ける必要があります。パターンで使用されるコントローラIDは自動的に複数化されます（たとえば、上記の例に示すように、 <code>users</code> は <code>user</code> なります）。
ru: Свойство <a href="yii-rest-urlrule#%24controller-detail">$ controller</a> является обязательным и должно представлять один или несколько идентификаторов контроллера. Каждый идентификатор контроллера должен начинаться с идентификатора модуля, если контроллер находится внутри модуля. Идентификатор контроллера, используемый в шаблоне, будет автоматически иметь множественное число (например, <code>user</code> становится <code>users</code> как показано в приведенных выше примерах).

source: The property initial values given in terms of name-value pairs.
ja: 名前と値のペアで与えられたプロパティの初期値。
ru: Начальные значения свойства,приведенные в терминах пар название-значение.

source: The property name
ja: プロパティ名
ru: Имя собственности

source: The property name or the event name
ja: プロパティ名またはイベント名
ru: Название собственности или название мероприятия

source: The property takes an array of module classes or <a href="guide-concept-configurations">configurations</a> with the array keys being the module IDs. For example:
ja: このプロパティは、モジュールクラスまたは<a href="guide-concept-configurations">構成の</a>配列を取り、配列キーはモジュールIDです。例えば：
ru: Свойство принимает массив классов или <a href="guide-concept-configurations">конфигураций</a> модулей, причем ключи массива являются идентификаторами модулей. Например:

source: The property value
ja: 資産価値
ru: Стоимость недвижимости

source: The property value or the value of a behavior's property
ja: ビヘイビアのプロパティ値またはその値の
ru: Значение свойства или значение свойства поведения

source: The public member variables of the object
ja: オブジェクトのパブリックメンバ変数
ru: Публичные переменные-члены объекта

source: The pull approach actively retrieves data from the <a href="yii-base-view">view component</a> or other objects accessible in views (e.g. <code>Yii::$app</code>). Using the code below as an example, within the view you can get the controller object by the expression <code>$this-&gt;context</code>. And as a result, it is possible for you to access any properties or methods of the controller in the <code>report</code> view, such as the controller ID shown in the following:
ja: プルアプローチは、<a href="yii-base-view">ビューコンポーネント</a>またはビューでアクセス可能な他のオブジェクト（ <code>Yii::$app</code> ）からデータをアクティブに取得します。以下のコードを例として使用すると、ビュー内で、式 <code>$this-&gt;context</code> によってコントローラーオブジェクトを取得できます。その結果、以下に示すコントローラーIDなど、 <code>report</code> ビューでコントローラーの任意のプロパティまたはメソッドにアクセスできます。
ru: Подход pull активно извлекает данные из <a href="yii-base-view">компонента представления</a> или других объектов, доступных в представлениях (например, <code>Yii::$app</code> ). Используя приведенный ниже код в качестве примера, внутри представления вы можете получить объект контроллера с помощью выражения <code>$this-&gt;context</code> . В результате вы можете получить доступ к любым свойствам или методам контроллера в представлении <code>report</code> , например к идентификатору контроллера, показанному ниже:

source: The purified HTML content.
ja: 精製されたHTMLコンテンツ。
ru: Очищенный HTML контент.

source: The purpose of the above naming schema is that for forms which contain multiple different models, the attributes of each model are grouped in sub-arrays of the POST-data and it is easier to differentiate between them.
ja: 上記の命名スキーマの目的は、複数の異なるモデルを含むフォームでは、各モデルの属性がPOSTデータのサブ配列にまとめられており、それらを区別しやすくなることにあります。
ru: Назначение приведенной выше схемы наименований состоит в том,что для форм,содержащих несколько различных моделей,атрибуты каждой модели сгруппированы в подмассивах POST-данных и их легче различать.

source: The purpose of this section is to highlight risks that need to be considered when creating a server configuration for serving a Yii based website. Besides the points covered here there may be other security related configuration options to be considered, so do not consider this section to be complete.
ja: この節の目的は、Yii ベースのウェブサイトを提供するためのサーバ設定を作成する際に考慮すべきリスクを強調することです。ここで取り上げたポイントの他にも、考慮すべきセキュリティ関連の設定オプションがあるかもしれませんので、このセクションが全てではないと考えてください。
ru: Цель этого раздела-выделить риски,которые необходимо учитывать при создании конфигурации сервера для обслуживания веб-сайта на базе Yii.Помимо рассмотренных здесь моментов,могут быть рассмотрены и другие варианты конфигурации,связанные с безопасностью,поэтому не считайте этот раздел полным.

source: The push approach is usually the preferred way of accessing data in views, because it makes views less dependent on context objects. Its drawback is that you need to manually build the data array all the time, which could become tedious and error prone if a view is shared and rendered in different places.
ja: プッシュアプローチは通常、ビュー内のデータにアクセスする際に好まれる方法です。欠点は、データ配列を常に手動で構築しなければならないことです。
ru: Подход push обычно является предпочтительным способом доступа к данным в представлениях,поскольку он делает представления менее зависимыми от контекстных объектов.Его недостаток заключается в том,что необходимо постоянно вручную строить массив данных,что может стать утомительным и предрасположенным к ошибкам,если представление совместно используется и визуализируется в разных местах.

source: The query associated with the junction table.
ja: ジャンクション・テーブルに関連付けられたクエリ。
ru: Запрос,связанный с таблицей соединений.

source: The query associated with the junction table. Please call <a href="yii-db-activerelationtrait#via()-detail">via()</a> to set this property instead of directly setting it. This property is only used in relational context.
ja: ジャンクションテーブルに関連付けられたクエリ。このプロパティを直接設定するのではなく、<a href="yii-db-activerelationtrait#via()-detail">via（）</a>を呼び出してこのプロパティを設定してください。このプロパティは、リレーショナルコンテキストでのみ使用されます。
ru: Запрос, связанный с таблицей соединений. Пожалуйста, вызовите <a href="yii-db-activerelationtrait#via()-detail">via (),</a> чтобы установить это свойство, вместо того, чтобы устанавливать его напрямую. Это свойство используется только в реляционном контексте.

source: The query builder for the current DB connection.
ja: 現在のDB接続のクエリビルダ。
ru: Конструктор запросов для текущего соединения с БД.

source: The query builder for the this MongoDB connection.
ja: この MongoDB 接続のクエリビルダ。
ru: Конструктор запросов для этого MongoDB соединения.

source: The query builder for this MongoDB connection.
ja: この MongoDB 接続のクエリビルダ。
ru: Конструктор запросов для этого MongoDB соединения.

source: The query builder for this connection.
ja: この接続のためのクエリビルダ。
ru: Конструктор запросов для этого соединения.

source: The query instance
ja: クエリのインスタンス
ru: Экземпляр запроса

source: The query object associated with this batch query.
ja: このバッチクエリに関連付けられたクエリオブジェクト。
ru: Объект запроса,связанный с данным пакетным запросом.

source: The query object associated with this batch query. Do not modify this property directly unless after <a href="yii-db-batchqueryresult#reset()-detail">reset()</a> is called explicitly.
ja: このバッチクエリに関連付けられているクエリオブジェクト。<a href="yii-db-batchqueryresult#reset()-detail">reset（）</a>が明示的に呼び出されない限り、このプロパティを直接変更しないでください。
ru: Объект запроса, связанный с этим пакетным запросом. Не изменяйте это свойство напрямую, если только после этого явно не вызывается функция <a href="yii-db-batchqueryresult#reset()-detail">reset ()</a> .

source: The query object associated with this batch query. Do not modify this property directly unless after <a href="yii-elasticsearch-batchqueryresult#reset()-detail">reset()</a> is called explicitly.
ja: このバッチクエリに関連付けられているクエリオブジェクト。<a href="yii-elasticsearch-batchqueryresult#reset()-detail">reset（）</a>が明示的に呼び出されない限り、このプロパティを直接変更しないでください。
ru: Объект запроса, связанный с этим пакетным запросом. Не изменяйте это свойство напрямую, если только после этого явно не вызывается функция <a href="yii-elasticsearch-batchqueryresult#reset()-detail">reset ()</a> .

source: The query object associated with this batch query. Do not modify this property directly unless after <a href="yii-mongodb-batchqueryresult#reset()-detail">reset()</a> is called explicitly.
ja: このバッチクエリに関連付けられているクエリオブジェクト。<a href="yii-mongodb-batchqueryresult#reset()-detail">reset（）</a>が明示的に呼び出されない限り、このプロパティを直接変更しないでください。
ru: Объект запроса, связанный с этим пакетным запросом. Не изменяйте это свойство напрямую, если только после этого явно не вызывается функция <a href="yii-mongodb-batchqueryresult#reset()-detail">reset ()</a> .

source: The query object itself
ja: クエリオブジェクト自体
ru: Сам объект запроса

source: The query object itself.
ja: クエリオブジェクト自体。
ru: Сам объект запроса.

source: The query part of this search query.
ja: この検索クエリのクエリ部分。
ru: Часть запроса в этом поисковом запросе.

source: The query part of this search query. This is an array or json string that follows the format of the elasticsearch <a href="http://www.elastic.co/guide/en/elasticsearch/reference/current/query-dsl.html">Query DSL</a>.
ja: この検索クエリのクエリ部分。これはelasticsearch <a href="http://www.elastic.co/guide/en/elasticsearch/reference/current/query-dsl.html">Query DSLの</a>フォーマットに従う配列またはjson文字列です。
ru: Часть запроса этого поискового запроса. Это массив или строка json, которая соответствует формату <a href="http://www.elastic.co/guide/en/elasticsearch/reference/current/query-dsl.html">DSL запроса</a> elasticsearch .

source: The query results.
ja: クエリの結果です。
ru: Результаты запроса.

source: The query results. If the query results in nothing, an empty array will be returned.
ja: クエリの結果。クエリの結果が何もなかった場合は、空の配列が返されます。
ru: Результаты запроса.Если запрос ничего не даст,то будет возвращен пустой массив.

source: The query that is used to fetch data models and <a href="yii-data-basedataprovider#%24totalCount-detail">$totalCount</a> if it is not explicitly set.
ja: データモデルをフェッチするために使用されるクエリと、明示的に設定されていない場合は<a href="yii-data-basedataprovider#%24totalCount-detail">$ totalCount</a>。
ru: Запрос, который используется для получения моделей данных и <a href="yii-data-basedataprovider#%24totalCount-detail">$ totalCount,</a> если он не задан явно.

source: The query used to build the script
ja: スクリプトの構築に使用したクエリ
ru: Запрос,использованный для создания скрипта

source: The query which result is used to determine if the dependency has been changed.
ja: 依存関係が変更されたかどうかを判断するために結果が使用されるクエリ。
ru: Запрос,результат которого используется для определения того,была ли изменена зависимость.

source: The query which result is used to determine if the dependency has been changed. Actual query method to be invoked is determined by <a href="yii-caching-dbquerydependency#%24method-detail">$method</a>.
ja: 依存関係が変更されたかどうかを判断するために使用される結果のクエリ。呼び出される実際のクエリメソッドは、<a href="yii-caching-dbquerydependency#%24method-detail">$ method</a>によって決定されます。
ru: Запрос, результат которого используется для определения, была ли изменена зависимость. Фактический вызываемый метод запроса определяется <a href="yii-caching-dbquerydependency#%24method-detail">$ method</a> .

source: The quoted SQL
ja: 引用されたSQL
ru: Цитируемый SQL

source: The random salt
ja: ランダムな塩
ru: Случайная соль

source: The random salt value.
ja: ランダムな塩の値。
ru: Случайное значение соли.

source: The random token for CSRF validation.
ja: CSRF検証用のランダムトークン。
ru: Случайный токен для проверки CSRF.

source: The range (begin, end), or false if the range request is invalid.
ja: 範囲(開始、終了)、または範囲要求が無効な場合は偽。
ru: Диапазон (начало,конец),или ложь,если запрос диапазона недействителен.

source: The range can be specified via the <a href="yii-validators-rangevalidator#%24range-detail">$range</a> property. If the <a href="yii-validators-rangevalidator#%24not-detail">$not</a> property is set true, the validator will ensure the attribute value is NOT among the specified range.
ja: 範囲は<a href="yii-validators-rangevalidator#%24range-detail">$ range</a>プロパティで指定できます。場合は<a href="yii-validators-rangevalidator#%24not-detail">$でない</a>プロパティがtrueに設定され、バリデータは属性値が指定した範囲の中でされていないことを確認します。
ru: Диапазон можно указать с помощью свойства <a href="yii-validators-rangevalidator#%24range-detail">$ range</a> . Если для свойства <a href="yii-validators-rangevalidator#%24not-detail">$ not</a> установлено значение true, валидатор гарантирует, что значение атрибута НЕ находится в указанном диапазоне.

source: The raw HTTP request body.
ja: 生の HTTP リクエストボディ。
ru: Сырое тело запроса HTTP.

source: The raw SQL with parameter values inserted into the corresponding placeholders in <a href="yii-db-command#%24sql-detail">$sql</a>.
ja: <a href="yii-db-command#%24sql-detail">$ sql</a>内の対応するプレースホルダーにパラメーター値が挿入された生のSQL 。
ru: Необработанный SQL со значениями параметров, вставленными в соответствующие заполнители в <a href="yii-db-command#%24sql-detail">$ sql</a> .

source: The raw query result from MongoDB
ja: MongoDBからの生のクエリ結果
ru: Результат необработанного запроса из MongoDB

source: The raw query result from database
ja: データベースからの生のクエリ結果
ru: Результат исходного запроса из базы данных

source: The reader object for fetching the query result
ja: クエリ結果を取得するためのリーダーオブジェクト
ru: Объект чтения для получения результата запроса

source: The real data with the hash stripped off. False if the data is tampered.
ja: ハッシュを剥ぎ取った実データ。データが改ざんされている場合は偽。
ru: Настоящие данные со снятым хэшем.Ложно,если данные фальсифицированы.

source: The real name of the given index name
ja: 与えられたインデックス名の実名
ru: Настоящее имя данного индекса

source: The real name of the given table name
ja: 与えられたテーブル名の実名
ru: Настоящее название данной таблицы

source: The reason to create tests before doing any implementation is that it allows us to focus on what we want to achieve and fully dive into "how to do it" afterwards. Usually it leads to better abstractions and easier test maintenance when it comes to feature adjustments or less coupled components.
ja: 実装を行う前にテストを作成する理由は、達成したいことに集中し、その後に「どうやってやるか」に完全に飛び込むことができるからです。通常、それは機能の調整や結合の少ないコンポーネントになると、より良い抽象化とテストのメンテナンスの容易さにつながります。
ru: Причина создания тестов перед любой реализацией заключается в том,что это позволяет нам сосредоточиться на том,чего мы хотим достичь,а затем полностью погрузиться в "как это сделать".Обычно это приводит к лучшим абстракциям и более легкому обслуживанию теста,когда дело доходит до настройки функций или менее связанных компонентов.

source: The record instance or null if it was not found.
ja: レコードのインスタンス、または見つからなかった場合はNULL。
ru: Экземпляр записи или нулевой,если он не был найден.
