Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/yii/yii.*.022.xlf
Languages: ja, ko, ru

source: The returned \yii\elasticsearch\ActiveQueryInterface instance can be further customized by calling methods defined in \yii\elasticsearch\ActiveQueryInterface before <code>one()</code> or <code>all()</code> is called to return populated ActiveRecord instances. For example,
ja: 返された\ yii \ elasticsearch \ ActiveQueryInterfaceインスタンスは、 <code>one()</code> または <code>all()</code> が呼び出されて入力されたActiveRecordインスタンスが返される前に、\ yii \ elasticsearch \ ActiveQueryInterfaceで定義されたメソッドを呼び出すことにより、さらにカスタマイズできます。例えば、
ru: Возвращенный экземпляр \ yii \ elasticsearch \ ActiveQueryInterface может быть дополнительно настроен путем вызова методов, определенных в \ yii \ elasticsearch \ ActiveQueryInterface, перед вызовом <code>one()</code> или <code>all()</code> для возврата заполненных экземпляров ActiveRecord. Например,

source: The returned \yii\mongodb\ActiveQueryInterface instance can be further customized by calling methods defined in \yii\mongodb\ActiveQueryInterface before <code>one()</code> or <code>all()</code> is called to return populated ActiveRecord instances. For example,
ja: 返された\ yii \ mongodb \ ActiveQueryInterfaceインスタンスは、 <code>one()</code> または <code>all()</code> が呼び出されて、設定されたActiveRecordインスタンスが返される前に、\ yii \ mongodb \ ActiveQueryInterfaceで定義されたメソッドを呼び出すことにより、さらにカスタマイズできます。例えば、
ru: Возвращенный экземпляр \ yii \ mongodb \ ActiveQueryInterface можно дополнительно настроить, вызвав методы, определенные в \ yii \ mongodb \ ActiveQueryInterface, перед вызовом <code>one()</code> или <code>all()</code> для возврата заполненных экземпляров ActiveRecord. Например,

source: The returned \yii\mongodb\file\ActiveQueryInterface instance can be further customized by calling methods defined in \yii\mongodb\file\ActiveQueryInterface before <code>one()</code> or <code>all()</code> is called to return populated ActiveRecord instances. For example,
ja: 返された\ yii \ mongodb \ file \ ActiveQueryInterfaceインスタンスは、 <code>one()</code> または <code>all()</code> が呼び出されて、設定されたActiveRecordインスタンスを返す前に、\ yii \ mongodb \ file \ ActiveQueryInterfaceで定義されたメソッドを呼び出すことにより、さらにカスタマイズできます。例えば、
ru: Возвращенный экземпляр \ yii \ mongodb \ file \ ActiveQueryInterface можно дополнительно настроить, вызвав методы, определенные в \ yii \ mongodb \ file \ ActiveQueryInterface, перед вызовом <code>one()</code> или <code>all()</code> для возврата заполненных экземпляров ActiveRecord. Например,

source: The returned \yii\redis\ActiveQueryInterface instance can be further customized by calling methods defined in \yii\redis\ActiveQueryInterface before <code>one()</code> or <code>all()</code> is called to return populated ActiveRecord instances. For example,
ja: 返された\ yii \ redis \ ActiveQueryInterfaceインスタンスは、 <code>one()</code> または <code>all()</code> が呼び出されて入力されたActiveRecordインスタンスが返される前に、\ yii \ redis \ ActiveQueryInterfaceで定義されたメソッドを呼び出すことによってさらにカスタマイズできます。例えば、
ru: Возвращенный экземпляр \ yii \ redis \ ActiveQueryInterface можно дополнительно настроить, вызвав методы, определенные в \ yii \ redis \ ActiveQueryInterface, перед вызовом <code>one()</code> или <code>all()</code> для возврата заполненных экземпляров ActiveRecord. Например,
