Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/yii/yii.*.022.xlf
Languages: ja, ko, ru

source: The type of join, such as INNER JOIN, LEFT JOIN.
ja: INNER JOIN、LEFT JOINなどの結合のタイプ。
ko: INNER JOIN, LEFT JOIN과 같은 조인 유형입니다.
ru: Тип соединения,например,INNER JOIN,LEFT JOIN.

source: The type of the input tag.
ja: 入力タグの種類。
ko: 입력 태그의 유형입니다.
ru: Тип входной метки.

source: The type of the input tag. Currently only 'text' and 'tel' are supported.
ja: 入力タグのタイプ。現在は 'text' と 'tel' のみがサポートされています。
ko: 입력 태그의 유형입니다. 현재 'text'및 'tel'만 지원됩니다.
ru: Тип входной метки.В настоящее время поддерживаются только 'text' и 'tel'.

source: The type of the item.
ja: アイテムの種類。
ko: 아이템의 타입.
ru: Тип элемента.

source: The type of the item. This should be either <a href="yii-rbac-item#TYPE_ROLE-detail">TYPE_ROLE</a> or <a href="yii-rbac-item#TYPE_PERMISSION-detail">TYPE_PERMISSION</a>.
ja: アイテムのタイプ。これは<a href="yii-rbac-item#TYPE_ROLE-detail">TYPE_ROLE</a>または<a href="yii-rbac-item#TYPE_PERMISSION-detail">TYPE_PERMISSIONで</a>なければなりません。
ko: 아이템의 타입. <a href="yii-rbac-item#TYPE_ROLE-detail">TYPE_ROLE</a> 또는 <a href="yii-rbac-item#TYPE_PERMISSION-detail">TYPE_PERMISSION</a> 이어야합니다 .
ru: Тип предмета. Это должно быть либо <a href="yii-rbac-item#TYPE_ROLE-detail">TYPE_ROLE,</a> либо <a href="yii-rbac-item#TYPE_PERMISSION-detail">TYPE_PERMISSION</a> .

source: The type of the number formatter. Values: NumberFormatter::DECIMAL, ::CURRENCY, ::PERCENT, ::SCIENTIFIC, ::SPELLOUT, ::ORDINAL ::DURATION, ::PATTERN_RULEBASED, ::DEFAULT_STYLE, ::IGNORE
ja: 数値フォーマッタのタイプ。値を指定します。NumberFormatter::DECIMAL,::CURRENCY,::PERCENT,::SCIENTIFIC,::SPELLOUT,::ORDINAL ::DURATION,::PATTERN_RULEBASED,::DEFAULT_STYLE,::IGNORE
ko: 숫자 포맷터의 유형입니다. 값 : NumberFormatter :: DECIMAL, :: CURRENCY, :: PERCENT, :: SCIENTIFIC, :: SPELLOUT, :: ORDINAL :: DURATION, :: PATTERN_RULEBASED, :: DEFAULT_STYLE, :: IGNORE
ru: Тип числового формата.Значения:Формат числа::DECIMAL,::CURRENCY,::PERCENT,::SCIENTIFIC,::SPELLOUT,::ORDINAL ::DURATION,::PATTERN_RULEBASED,::DEFAULT_STYLE,::IGNORE

source: The type of the option or argument
ja: オプションまたは引数のタイプ
ko: 옵션 또는 인수의 유형
ru: Тип опции или аргумента

source: The type of the script to generate
ja: 生成するスクリプトのタイプ
ko: 생성 할 스크립트 유형
ru: Тип генерируемого скрипта

source: The type of the token. The value of this parameter depends on the implementation. For example, <a href="yii-filters-auth-httpbearerauth">yii\filters\auth\HttpBearerAuth</a> will set this parameter to be <code>yii\filters\auth\HttpBearerAuth</code>.
ja: トークンのタイプ。このパラメーターの値は、実装によって異なります。例えば、<a href="yii-filters-auth-httpbearerauth">Yiiは\フィルター\認証\ HttpBearerAuth</a>ように、このパラメータを設定します <code>yii\filters\auth\HttpBearerAuth</code> 。
ko: 토큰의 유형입니다. 이 매개 변수의 값은 구현에 따라 다릅니다. 예를 들어, <a href="yii-filters-auth-httpbearerauth">YII \ 필터는 \ 인증 \ HttpBearerAuth을</a> 수 있도록이 매개 변수를 설정합니다 <code>yii\filters\auth\HttpBearerAuth</code> .
ru: Тип токена. Значение этого параметра зависит от реализации. Например, <a href="yii-filters-auth-httpbearerauth">yii \ filters \ auth \ HttpBearerAuth</a> установит для этого параметра значение <code>yii\filters\auth\HttpBearerAuth</code> .

source: The type of the validator.
ja: バリデータのタイプ。
ko: 유효성 검사기의 유형입니다.
ru: Тип валидатора.

source: The type of the validator. Indicates, whether a date, time or datetime value should be validated. This property influences the default value of <a href="yii-validators-datevalidator#%24format-detail">$format</a> and also sets the correct behavior when <a href="yii-validators-datevalidator#%24format-detail">$format</a> is one of the intl short formats, <code>short</code>, <code>medium</code>, <code>long</code>, or <code>full</code>.
ja: バリデーターのタイプ。日付、時刻、または日時値を検証する必要があるかどうかを示します。このプロパティは、<a href="yii-validators-datevalidator#%24format-detail">$ formatの</a>デフォルト値に影響し、<a href="yii-validators-datevalidator#%24format-detail">$ format</a>がintl short形式、 <code>short</code> 、 <code>medium</code> 、 <code>long</code> 、 <code>full</code> のいずれかである場合の正しい動作も設定します。
ko: 유효성 검사기의 유형입니다. 날짜, 시간 또는 날짜 / 시간 값을 유효성 검증해야하는지 여부를 나타냅니다. 이 속성은 <a href="yii-validators-datevalidator#%24format-detail">$ format</a> 의 기본값에 영향을 미치며 <a href="yii-validators-datevalidator#%24format-detail">$ format</a> 이 intl short 형식, <code>short</code> , <code>medium</code> , <code>long</code> 또는 <code>full</code> 중 하나 일 때 올바른 동작을 설정합니다 .
ru: Тип валидатора. Указывает, следует ли проверять дату, время или значение datetime. Это свойство влияет на значение по умолчанию для <a href="yii-validators-datevalidator#%24format-detail">$ format,</a> а также задает правильное поведение, когда <a href="yii-validators-datevalidator#%24format-detail">$ format</a> является одним из коротких форматов intl, <code>short</code> , <code>medium</code> , <code>long</code> или <code>full</code> .

source: The type of the values being compared
ja: 比較される値のタイプ
ko: 비교되는 값의 유형
ru: Тип сравниваемых значений

source: The type of the values being compared.
ja: 比較される値のタイプ。
ko: 비교할 값의 유형입니다.
ru: Тип сравниваемых значений.

source: The type of the values being compared. The follow types are supported:
ja: 比較される値のタイプ。以下のタイプがサポートされています。
ko: 비교할 값의 유형입니다. 다음 유형이 지원됩니다.
ru: Тип сравниваемых значений.Поддерживаются следующие типы:

source: The type or class name.
ja: タイプまたはクラス名。
ko: 유형 또는 클래스 이름
ru: Тип или имя класса.

source: The type to retrieve data from.
ja: データを取得するタイプです。
ko: 데이터를 검색 할 유형입니다.
ru: Тип для получения данных.

source: The type to retrieve data from. This can be a string representing a single type or a an array of multiple types. If this is <code>null</code> it means that all types are being queried.
ja: データを取得するタイプ。これは、単一のタイプを表す文字列、または複数のタイプの配列です。これが <code>null</code> の場合、すべてのタイプが照会されていることを意味します。
ko: 데이터를 검색 할 유형입니다. 단일 유형을 나타내는 문자열이거나 여러 유형의 배열 일 수 있습니다. 이 값이 <code>null</code> 이면 모든 유형이 쿼리되고 있음을 의미합니다.
ru: Тип, из которого нужно получить данные. Это может быть строка, представляющая один тип, или массив нескольких типов. Если это значение <code>null</code> это означает, что запрашиваются все типы.

source: The type to retrieve data from. This can be a string representing a single type or a an array of multiple types. If this is not set, all types are being queried.
ja: データを取得する型。これは単一の型を表す文字列か、複数の型の配列になります。これが設定されていない場合は、すべての型が照会されます。
ko: 데이터를 검색 할 유형입니다. 단일 유형을 나타내는 문자열이거나 여러 유형의 배열 일 수 있습니다. 설정하지 않으면 모든 유형이 쿼리됩니다.
ru: Тип для получения данных.Это может быть строка,представляющая один тип или массив из нескольких типов.Если это не установлено,опрашиваются все типы.

source: The types to execute the query on.
ja: クエリを実行する型。
ko: 쿼리를 실행할 유형입니다.
ru: Типы для выполнения запроса.

source: The types to execute the query on. Defaults to null meaning all types
ja: クエリを実行する型。デフォルトは null で、すべての型を意味します。
ko: 쿼리를 실행할 유형입니다. 모든 유형을 의미하는 기본값은 null입니다.
ru: Типы для выполнения запроса.По умолчанию равен нулю,что означает все типы

source: The typical usage of DynamicModel is as follows,
ja: DynamicModelの典型的な使い方は以下の通りです。
ko: DynamicModel의 일반적인 사용법은 다음과 같습니다.
ru: Типичное использование DynamicModel заключается в следующем,

source: The unique ID of the module.
ja: モジュールの一意の ID。
ko: 모듈의 고유 ID
ru: Уникальный идентификатор модуля.

source: The unique ID of this action among the whole application.
ja: アプリケーション全体の中で、このアクションのユニークなID。
ko: 전체 애플리케이션에서이 조치의 고유 ID
ru: Уникальный идентификатор этого действия среди всего приложения.

source: The unique identifier for the user.
ja: ユーザーの一意の識別子。
ko: 사용자의 고유 식별자입니다.
ru: Уникальный идентификатор пользователя.

source: The unique identifier for the user. If <code>null</code>, it means the user is a guest.
ja: ユーザーの一意の識別子。 <code>null</code> の場合、ユーザーがゲストであることを意味します。
ko: 사용자의 고유 식별자입니다. <code>null</code> 의 경우 는 사용자가 손님 인 것을 의미합니다.
ru: Уникальный идентификатор пользователя. Если значение <code>null</code> , это означает, что пользователь является гостем.

source: The unix socket path (e.g. <code>/var/run/redis/redis.sock</code>) to use for connecting to the redis server. This can be used instead of <a href="yii-redis-connection#%24hostname-detail">$hostname</a> and <a href="yii-redis-connection#%24port-detail">$port</a> to connect to the server using a unix socket. If a unix socket path is specified, <a href="yii-redis-connection#%24hostname-detail">$hostname</a> and <a href="yii-redis-connection#%24port-detail">$port</a> will be ignored.
ja: Redisサーバーへの接続に使用するUNIXソケットパス（例： <code>/var/run/redis/redis.sock</code> ）。これは、<a href="yii-redis-connection#%24hostname-detail">$ hostname</a>および<a href="yii-redis-connection#%24port-detail">$ portの</a>代わりに使用して、UNIXソケットを使用してサーバーに接続できます。UNIXソケットパスが指定されている場合、<a href="yii-redis-connection#%24hostname-detail">$ hostname</a>および<a href="yii-redis-connection#%24port-detail">$ port</a>は無視されます。
ko: Redis 서버에 연결하는 데 사용할 유닉스 소켓 경로 (예 : <code>/var/run/redis/redis.sock</code> ) 이것은 unix 소켓을 사용하여 서버에 연결하기 위해 <a href="yii-redis-connection#%24hostname-detail">$ hostname</a> 및 <a href="yii-redis-connection#%24port-detail">$ port</a> 대신 사용될 수 있습니다 . 유닉스 소켓 경로가 지정되면 <a href="yii-redis-connection#%24hostname-detail">$ hostname</a> 과 <a href="yii-redis-connection#%24port-detail">$ port</a> 는 무시됩니다.
ru: Путь к сокету unix (например, <code>/var/run/redis/redis.sock</code> ) для подключения к серверу redis. Его можно использовать вместо <a href="yii-redis-connection#%24hostname-detail">$ hostname</a> и <a href="yii-redis-connection#%24port-detail">$ port</a> для подключения к серверу через сокет unix. Если указан путь к сокету unix, <a href="yii-redis-connection#%24hostname-detail">$ hostname</a> и <a href="yii-redis-connection#%24port-detail">$ port</a> игнорируются.

source: The unix socket path (e.g. `/var/run/redis/redis.
ja: unix ソケットパス (例:`/var/run/redis/redis.
ko: 유닉스 소켓 경로 (예 :`/ var / run / redis / redis).
ru: Путь сокета unix (например,`/var/run/redis/redis.

source: The unsafe attribute name
ja: 安全でない属性名
ko: 안전하지 않은 속성 이름
ru: Небезопасное имя атрибута

source: The update operation. This is mainly used when overriding <a href="yii-db-activerecord#transactions()-detail">transactions()</a> to specify which operations are transactional.
ja: 更新操作。これは主に、<a href="yii-db-activerecord#transactions()-detail">transactions（）</a>をオーバーライドしてトランザクション操作を指定するときに使用されます。
ko: 업데이트 작업 주로 <a href="yii-db-activerecord#transactions()-detail">transaction ()</a> 을 재정 의하여 트랜잭션 작업을 지정할 때 사용됩니다 .
ru: Операция обновления. Это в основном используется при переопределении <a href="yii-db-activerecord#transactions()-detail">транзакций (),</a> чтобы указать, какие операции являются транзакционными.

source: The update operation. This is mainly used when overriding <a href="yii-sphinx-activerecord#transactions()-detail">transactions()</a> to specify which operations are transactional.
ja: 更新操作。これは主に、<a href="yii-sphinx-activerecord#transactions()-detail">transactions（）</a>をオーバーライドしてトランザクション操作を指定するときに使用されます。
ko: 업데이트 작업 주로 <a href="yii-sphinx-activerecord#transactions()-detail">transaction ()</a> 을 재정 의하여 트랜잭션 작업을 지정할 때 사용됩니다 .
ru: Операция обновления. Это в основном используется при переопределении <a href="yii-sphinx-activerecord#transactions()-detail">транзакций (),</a> чтобы указать, какие операции являются транзакционными.

source: The updated item
ja: 更新された項目
ko: 업데이트 된 항목
ru: Обновлённый пункт

source: The updated rule
ja: 更新されたルール
ko: 업데이트 된 규칙
ru: Обновленное правило

source: The usage of all these data providers share the following common pattern:
ja: これらすべてのデータプロバイダの使用法は、次のような共通のパターンを持っています。
ko: 이러한 모든 데이터 공급자의 사용법은 다음과 같은 일반적인 패턴을 공유합니다.
ru: Использование всех этих провайдеров данных имеет следующую общую закономерность:

source: The usage of relations declared with a junction table is the same as that of normal relations. For example,
ja: 接続表で宣言された関係の使い方は、通常の関係と同じです。例えば、以下のようになります。
ko: 정션 테이블로 선언 된 관계의 사용법은 일반 관계의 사용법과 동일합니다. 예를 들어
ru: Использование отношений,объявленных с таблицей слияния,такое же,как и при использовании нормальных отношений.Например,

source: The use of the <code>on eventName</code> syntax is described in the <a href="guide-concept-configurations#configuration-format">Configurations</a> section.
ja: <code>on eventName</code> 構文の使用については、「<a href="guide-concept-configurations#configuration-format">構成」</a>セクションで説明しています。
ko: 의 사용 <code>on eventName</code> 구문에서 설명되는 <a href="guide-concept-configurations#configuration-format">구성의</a> 단면도.
ru: Использование синтаксиса <code>on eventName</code> описано в разделе &laquo; <a href="guide-concept-configurations#configuration-format">Конфигурации</a> &raquo;.

source: The user ID (see <a href="yii-web-user#%24id-detail">yii\web\User::$id</a>)
ja: ユーザーID（<a href="yii-web-user#%24id-detail">yii \ web \ User :: $ idを</a>参照）
ko: 사용자 ID ( <a href="yii-web-user#%24id-detail">yii \ web \ User :: $ id 참조</a> )
ru: ID пользователя (см. <a href="yii-web-user#%24id-detail">Yii \ web \ User :: $ id</a> )

source: The user ID. This should be either an integer or a string representing the unique identifier of a user. See <a href="yii-web-user#%24id-detail">yii\web\User::$id</a>.
ja: ユーザーID。これは、ユーザーの一意の識別子を表す整数または文字列である必要があります。<a href="yii-web-user#%24id-detail">yii \ web \ User :: $ idを</a>参照してください。
ko: 사용자 ID 정수 또는 사용자의 고유 식별자를 나타내는 문자열이어야합니다. <a href="yii-web-user#%24id-detail">yii \ web \ User :: $ id를</a> 참조하십시오 .
ru: ID пользователя. Это должно быть целое число или строка, представляющая уникальный идентификатор пользователя. См. <a href="yii-web-user#%24id-detail">Yii \ web \ User :: $ id</a> .

source: The user ID. This should can be either an integer or a string representing the unique identifier of a user. See <a href="yii-web-user#%24id-detail">yii\web\User::$id</a>.
ja: ユーザーID。これは、ユーザーの一意の識別子を表す整数または文字列にする必要があります。<a href="yii-web-user#%24id-detail">yii \ web \ User :: $ idを</a>参照してください。
ko: 사용자 ID 정수 또는 사용자의 고유 식별자를 나타내는 문자열이어야합니다. <a href="yii-web-user#%24id-detail">yii \ web \ User :: $ id를</a> 참조하십시오 .
ru: ID пользователя. Это может быть целое число или строка, представляющая уникальный идентификатор пользователя. См. <a href="yii-web-user#%24id-detail">Yii \ web \ User :: $ id</a> .

source: The user component.
ja: ユーザーコンポーネントです。
ko: 사용자 구성 요소.
ru: Пользовательский компонент.

source: The user identity (which should already be authenticated)
ja: ユーザ ID (すでに認証されている必要があります)
ko: 사용자 ID (이미 인증되어 있어야 함)
ru: Идентификатор пользователя (который уже должен быть аутентифицирован).

source: The user identity information
ja: ユーザーの身元情報
ko: 사용자 신원 정보
ru: Идентификационные данные пользователя

source: The user input
ja: ユーザー入力
ko: 사용자 입력
ru: Пользовательский ввод

source: The user object
ja: ユーザーオブジェクト
ko: 사용자 객체
ru: Объект пользователя

source: The user object or <code>false</code> in case of detached User component
ja: ユーザーオブジェクト、またはデタッチされたユーザーコンポーネントの場合は <code>false</code>
ko: 사용자 컴포넌트가 분리 된 경우 사용자 오브젝트 또는 <code>false</code>
ru: Объект пользователя или <code>false</code> в случае отсоединенного компонента User

source: The user object representing the authentication status or the ID of the user application component.
ja: ユーザアプリケーションコンポーネントの認証状態またはIDを表すユーザオブジェクト。
ko: 인증 상태 또는 사용자 응용 프로그램 구성 요소의 ID를 나타내는 사용자 개체
ru: Объект пользователя,представляющий статус аутентификации или идентификатор компонента пользовательского приложения.

source: The user object representing the authentication status or the ID of the user application component. Starting from version 2.0.2, this can also be a configuration array for creating the object. Starting from version 2.0.12, you can set it to <code>false</code> to explicitly switch this component support off for the filter.
ja: ユーザーアプリケーションコンポーネントの認証ステータスまたはIDを表すユーザーオブジェクト。バージョン2.0.2以降、これはオブジェクトを作成するための構成配列にもなります。バージョン2.0.12以降、これを <code>false</code> に設定して、このコンポーネントのサポートをフィルターに対して明示的にオフにすることができます。
ko: 인증 상태 또는 사용자 응용 프로그램 구성 요소의 ID를 나타내는 사용자 개체 버전 2.0.2부터는 오브젝트 작성을위한 구성 배열 일 수도 있습니다. 버전 2.0.12부터는 필터에 대해이 구성 요소 지원을 명시 적으로 해제하기 위해 <code>false</code> 로 설정할 수 있습니다 .
ru: Пользовательский объект, представляющий статус аутентификации или идентификатор пользовательского компонента приложения. Начиная с версии 2.0.2, это также может быть массив конфигурации для создания объекта. Начиная с версии 2.0.12, вы можете установить значение <code>false</code> , чтобы явно отключить поддержку этого компонента для фильтра.

source: The user object representing the user authentication status.
ja: ユーザの認証状態を表すユーザオブジェクト。
ko: 사용자 인증 상태를 나타내는 사용자 개체입니다.
ru: Объект пользователя,представляющий статус аутентификации пользователя.

source: The user object representing the user authentication status. If not set, the <code>user</code> application component will be used.
ja: ユーザー認証ステータスを表すユーザーオブジェクト。設定しない場合、 <code>user</code> アプリケーションコンポーネントが使用されます。
ko: 사용자 인증 상태를 나타내는 사용자 개체입니다. 설정하지 않으면 <code>user</code> 응용 프로그램 구성 요소가 사용됩니다.
ru: Пользовательский объект, представляющий статус аутентификации пользователя. Если не установлен, будет использоваться компонент <code>user</code> приложения.

source: The user object that implements the RateLimitInterface.
ja: RateLimitInterfaceを実装したユーザーオブジェクト。
ko: RateLimitInterface를 구현하는 사용자 개체입니다.
ru: Пользовательский объект,реализующий RateLimitInterface.

source: The user object that implements the RateLimitInterface. If not set, it will take the value of <code>Yii::$app-&gt;user-&gt;getIdentity(false)</code>.
ja: RateLimitInterfaceを実装するユーザーオブジェクト。設定されていない場合は、 <code>Yii::$app-&gt;user-&gt;getIdentity(false)</code> の値を取ります。
ko: RateLimitInterface를 구현하는 사용자 개체입니다. 설정하지 않으면 <code>Yii::$app-&gt;user-&gt;getIdentity(false)</code> 됩니다.
ru: Пользовательский объект, реализующий RateLimitInterface. Если не установлен, он будет принимать значение <code>Yii::$app-&gt;user-&gt;getIdentity(false)</code> .

source: The user's input
ja: ユーザーの入力
ko: 사용자 입력
ru: Вход пользователя

source: The user-defined error message.
ja: ユーザー定義のエラーメッセージ。
ko: 사용자 정의 오류 메시지
ru: Сообщение об ошибке,определяемое пользователем.

source: The user-defined error message. It may contain the following placeholders which will be replaced accordingly by the validator:
ja: ユーザー定義のエラーメッセージ。このメッセージには以下のプレースホルダが含まれている可能性があります。
ko: 사용자 정의 오류 메시지 유효성 검사기로 대체되는 다음 자리 표시자가 포함될 수 있습니다.
ru: Сообщение об ошибке,определяемое пользователем.В нем могут содержаться следующие закладки,которые будут соответственно заменены валидатором:

source: The user-friendly name of this exception
ja: この例外のユーザーフレンドリーな名前
ko: 이 예외의 사용자에게 친숙한 이름
ru: Удобное для пользователя название этого исключения

source: The user-provided CSRF token to be validated. If null, the token will be retrieved from the <a href="yii-web-request#%24csrfParam-detail">$csrfParam</a> POST field or HTTP header. This parameter is available since version 2.0.4.
ja: 検証されるユーザー提供のCSRFトークン。nullの場合、トークンは<a href="yii-web-request#%24csrfParam-detail">$ csrfParam</a> POSTフィールドまたはHTTPヘッダーから取得されます。このパラメーターは、バージョン2.0.4以降で使用できます。
ko: 검증 할 사용자 제공 CSRF 토큰. null의 경우, 토큰은 <a href="yii-web-request#%24csrfParam-detail">$ csrfParam</a> POST 필드 또는 HTTP 헤더 에서 검색됩니다 . 이 매개 변수는 버전 2.0.4부터 사용 가능합니다.
ru: Предоставленный пользователем токен CSRF для проверки. Если значение равно null, токен будет извлечен из <a href="yii-web-request#%24csrfParam-detail">поля</a> POST $ csrfParam или заголовка HTTP. Этот параметр доступен с версии 2.0.4.

source: The username for establishing DB connection.
ja: DB接続を確立するためのユーザ名です。
ko: DB 연결을 설정하기위한 사용자 이름입니다.
ru: Имя пользователя для установления соединения с БД.

source: The username for establishing DB connection. Defaults to <code>null</code> meaning no username to use.
ja: DB接続を確立するためのユーザー名。デフォルトは <code>null</code> で、使用するユーザー名がないことを意味します。
ko: DB 연결을 설정하기위한 사용자 이름입니다. 사용할 사용자 이름이 없음을 의미하는 기본값은 <code>null</code> 입니다.
ru: Имя пользователя для установления соединения с БД. По умолчанию значение <code>null</code> означает, что имя пользователя не используется.

source: The username sent via HTTP authentication, null if the username is not given
ja: HTTP 認証で送信されたユーザ名、ユーザ名が指定されていない場合は null
ko: HTTP 인증을 통해 전송 된 사용자 이름으로, 사용자 이름을 제공하지 않으면 null
ru: Имя пользователя,отправленное с помощью HTTP-аутентификации,становится нулевым,если имя пользователя не указано.

source: The valid parameters that the action can run with.
ja: アクションが実行できる有効なパラメータです。
ko: 조치를 실행할 수있는 유효한 매개 변수입니다.
ru: Действительные параметры,с которыми может выполняться действие.

source: The valid sort attributes.
ja: 有効なソート属性。
ko: 유효한 정렬 속성
ru: Действительные атрибуты сортировки.

source: The validation method must have the following signature:
ja: バリデーションメソッドには、以下の署名が必要です。
ko: 유효성 검사 방법에는 다음 서명이 있어야합니다.
ru: Метод проверки должен иметь следующую подпись:

source: The validation options
ja: 検証オプション
ko: 유효성 검사 옵션
ru: Валидационные опции

source: The validation rules. Please refer to <a href="yii-base-model#rules()-detail">yii\base\Model::rules()</a> on the format of this parameter.
ja: 検証ルール。このパラメーターの形式については、<a href="yii-base-model#rules()-detail">yii \ base \ Model :: rules（）</a>を参照してください。
ko: 유효성 검사 규칙 이 매개 변수의 형식에 대해서는 <a href="yii-base-model#rules()-detail">yii \ base \ Model :: rules ()</a> 를 참조하십시오 .
ru: Правила проверки. Пожалуйста, обратитесь к <a href="yii-base-model#rules()-detail">yii \ base \ Model :: rules ()</a> о формате этого параметра.

source: The validator
ja: バリデータ
ko: 유효성 검사기
ru: Валидатор

source: The validator checks if the attribute value is a valid IPv4/IPv6 address or subnet.
ja: バリデータは、属性値が有効なIPv4/IPv6アドレスまたはサブネットであるかどうかをチェックします。
ko: 유효성 검사기는 속성 값이 유효한 IPv4 / IPv6 주소 또는 서브넷인지 확인합니다.
ru: Валидатор проверяет,является ли значение атрибута действительным IPv4/IPv6 адресом или подсетью.

source: The validator checks if the attribute value is a valid IPv4/IPv6 address or subnet. It also may change attribute's value if normalization or IPv6 expansion is enabled.
ja: バリデータは、属性値が有効なIPv4/IPv6アドレスまたはサブネットであるかどうかをチェックします。また、正規化またはIPv6拡張が有効になっている場合、属性の値を変更することもあります。
ko: 유효성 검사기는 속성 값이 유효한 IPv4 / IPv6 주소 또는 서브넷인지 확인합니다. 정규화 또는 IPv6 확장이 활성화 된 경우 속성 값을 변경할 수도 있습니다.
ru: Валидатор проверяет,является ли значение атрибута действительным IPv4/IPv6 адресом или подсетью.Он также может изменить значение атрибута,если включена нормализация или расширение IPv6.

source: The validator for the rule.This can be a built-in validator name, a method name of the model class, an anonymous function, or a validator class name.
ja: これは、組み込みのバリデータ名、モデルクラスのメソッド名、匿名関数、バリデータクラス名のいずれかになります。
ko: 규칙의 유효성 검사기 내장 유효성 검사기 이름, 모델 클래스의 메서드 이름, 익명 함수 또는 유효성 검사기 클래스 이름 일 수 있습니다.
ru: Это может быть встроенное имя валидатора,имя метода класса модели,анонимная функция или имя класса валидатора.

source: The validator has such configuration options:
ja: バリデータにはこのような設定オプションがあります。
ko: 유효성 검사기에는 다음과 같은 구성 옵션이 있습니다.
ru: Валидатор имеет такие опции конфигурации:

source: The validator type. This can be either:
ja: バリデータのタイプ。これは次のいずれかです。
ko: 유효성 검사기 유형 다음 중 하나 일 수 있습니다.
ru: Тип валидатора.Это может быть тоже:

source: The validator will check if the directory containing the new class file exist or not.
ja: バリデータは新しいクラスファイルを含むディレクトリが存在するかどうかをチェックします。
ko: 유효성 검사기는 새 클래스 파일이 포함 된 디렉토리가 있는지 확인합니다.
ru: Валидатор проверит,существует ли директория,содержащая новый файл класса или нет.

source: The validators applicable to the current <a href="yii-base-model#%24scenario-detail">$scenario</a>.
ja: 現在の<a href="yii-base-model#%24scenario-detail">$ scenarioに</a>適用できるバリデーター。
ko: 현재 <a href="yii-base-model#%24scenario-detail">$ scenario에</a> 적용 가능한 유효성 검증기 .
ru: Валидаторы, применимые к текущему <a href="yii-base-model#%24scenario-detail">сценарию $</a> .

source: The value attribute. If it is null, the value attribute will not be generated.
ja: 値属性です。nullの場合、value属性は生成されません。
ko: 값 속성 널 (NULL)이면 값 속성이 생성되지 않습니다.
ru: Атрибут значения.Если он равен нулю,атрибут значения не будет сформирован.

source: The value being compared
ja: 比較される値
ko: 비교되는 가치
ru: Сравниваемая величина
