Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/yii/yii.*.022.xlf
Languages: ja, ko, ru

source: The structure of console applications is very similar to a Yii web application. It consists of one or more <a href="yii-console-controller">yii\console\Controller</a> classes, which are often referred to as <em>commands</em> in the console environment. Each controller can also have one or more actions, just like web controllers.
ja: コンソールアプリケーションの構造は、Yii Webアプリケーションとよく似ています。これは、1つ以上の<a href="yii-console-controller">yii \ console \ Controller</a>クラスで構成され<em>ます</em>。これらのクラスは、コンソール環境では<em>コマンド</em>と呼ばれることがよくあります。各コントローラーは、Webコントローラーと同様に、1つ以上のアクションを持つこともできます。
ko: 콘솔 응용 프로그램의 구조는 Yii 웹 응용 프로그램과 매우 유사합니다. 하나 이상의 <a href="yii-console-controller">yii \ console \ Controller</a> 클래스로 구성되며, 종종 콘솔 환경에서 <em>명령</em> 이라고 합니다. 각 컨트롤러에는 웹 컨트롤러와 마찬가지로 하나 이상의 작업이있을 수 있습니다.
ru: Структура консольных приложений очень похожа на веб-приложение Yii. Он состоит из одного или нескольких классов <a href="yii-console-controller">yii \ console \ Controller</a> , которые часто называют <em>командами</em> в среде консоли. Каждый контроллер также может иметь одно или несколько действий, как и веб-контроллеры.

source: The style content
ja: スタイルの内容
ko: 스타일 내용
ru: Стилевое содержание

source: The sub-module to be added to this module. This can be one of the following:
ja: このモジュールに追加するサブモジュール。これは以下のいずれかになります。
ko: 이 모듈에 추가 할 하위 모듈입니다. 이것은 다음 중 하나 일 수 있습니다.
ru: Подмодуль,который будет добавлен в этот модуль.Это может быть один из следующих вариантов:

source: The subquery in a raw form to select from.
ja: から選択する生の形式のサブクエリ。
ko: 선택할 원시 양식의 부속 조회.
ru: Подзапрос в необработанном виде для выбора.

source: The suffix that will be assigned to <a href="yii-web-urlrule#%24suffix-detail">yii\web\UrlRule::$suffix</a> for every generated rule.
ja: 生成されたすべてのルールの<a href="yii-web-urlrule#%24suffix-detail">yii \ web \ UrlRule :: $ suffix</a>に割り当てられるサフィックス。
ko: 생성 된 모든 규칙에 대해 <a href="yii-web-urlrule#%24suffix-detail">yii \ web \ UrlRule :: $ suffix</a> 에 할당 될 접미사 입니다.
ru: Суффикс, который будет присвоен <a href="yii-web-urlrule#%24suffix-detail">yii \ web \ UrlRule :: $ суффикс</a> для каждого сгенерированного правила.

source: The suggester body
ja: 暗示器本体
ko: 제안자 본문
ru: Предлагаемое тело

source: The sum of the specified column values
ja: 指定された列の値の合計
ko: 지정된 열 값의 합
ru: Сумма указанных значений столбца

source: The sum of the specified column values.
ja: 指定された列の値の合計。
ko: 지정된 열 값의 합계입니다.
ru: Сумма значений указанных столбцов.

source: The summary data (e.g. URL, time)
ja: サマリーデータ(URLや時間など
ko: 요약 데이터 (예 : URL, 시간)
ru: Сводные данные (например,URL,время).

source: The supported DB operations are: <a href="yii-db-activerecord#OP_INSERT-detail">OP_INSERT</a>, <a href="yii-db-activerecord#OP_UPDATE-detail">OP_UPDATE</a> and <a href="yii-db-activerecord#OP_DELETE-detail">OP_DELETE</a>, which correspond to the <a href="yii-db-activerecord#insert()-detail">insert()</a>, <a href="yii-db-activerecord#update()-detail">update()</a> and <a href="yii-db-activerecord#delete()-detail">delete()</a> methods, respectively. By default, these methods are NOT enclosed in a DB transaction.
ja: サポートされているDB操作は、<a href="yii-db-activerecord#OP_INSERT-detail">OP_INSERT</a>、<a href="yii-db-activerecord#OP_UPDATE-detail">OP_UPDATE</a>および<a href="yii-db-activerecord#OP_DELETE-detail">OP_DELETEで</a>、それぞれ<a href="yii-db-activerecord#insert()-detail">insert（）</a>、<a href="yii-db-activerecord#update()-detail">update（）</a>および<a href="yii-db-activerecord#delete()-detail">delete（）</a>メソッドに対応しています。デフォルトでは、これらのメソッドはDBトランザクションに含まれていません。
ko: 지원되는 DB 조작은 <a href="yii-db-activerecord#OP_INSERT-detail">OP_INSERT</a> , <a href="yii-db-activerecord#OP_UPDATE-detail">OP_UPDATE</a> 및 <a href="yii-db-activerecord#OP_DELETE-detail">OP_DELETE</a> 이며 , 각각 <a href="yii-db-activerecord#insert()-detail">insert ()</a> , <a href="yii-db-activerecord#update()-detail">update ()</a> 및 <a href="yii-db-activerecord#delete()-detail">delete ()</a> 메소드에 해당합니다. 기본적으로 이러한 메소드는 DB 트랜잭션에 포함되지 않습니다.
ru: Поддерживаемые операции БД: <a href="yii-db-activerecord#OP_INSERT-detail">OP_INSERT</a> , <a href="yii-db-activerecord#OP_UPDATE-detail">OP_UPDATE</a> и <a href="yii-db-activerecord#OP_DELETE-detail">OP_DELETE</a> , которые соответствуют методам <a href="yii-db-activerecord#insert()-detail">insert ()</a> , <a href="yii-db-activerecord#update()-detail">update ()</a> и <a href="yii-db-activerecord#delete()-detail">delete ()</a> соответственно. По умолчанию эти методы НЕ включены в транзакцию БД.

source: The supported DB operations are: <a href="yii-sphinx-activerecord#OP_INSERT-detail">OP_INSERT</a>, <a href="yii-sphinx-activerecord#OP_UPDATE-detail">OP_UPDATE</a> and <a href="yii-sphinx-activerecord#OP_DELETE-detail">OP_DELETE</a>, which correspond to the <a href="yii-sphinx-activerecord#insert()-detail">insert()</a>, <a href="yii-sphinx-activerecord#update()-detail">update()</a> and <a href="yii-sphinx-activerecord#delete()-detail">delete()</a> methods, respectively. By default, these methods are NOT enclosed in a transaction.
ja: サポートされているDB操作は、<a href="yii-sphinx-activerecord#OP_INSERT-detail">OP_INSERT</a>、<a href="yii-sphinx-activerecord#OP_UPDATE-detail">OP_UPDATE</a>および<a href="yii-sphinx-activerecord#OP_DELETE-detail">OP_DELETEで</a>、それぞれ<a href="yii-sphinx-activerecord#insert()-detail">insert（）</a>、<a href="yii-sphinx-activerecord#update()-detail">update（）</a>および<a href="yii-sphinx-activerecord#delete()-detail">delete（）</a>メソッドに対応しています。デフォルトでは、これらのメソッドはトランザクションに含まれていません。
ko: 지원되는 DB 조작은 <a href="yii-sphinx-activerecord#OP_INSERT-detail">OP_INSERT</a> , <a href="yii-sphinx-activerecord#OP_UPDATE-detail">OP_UPDATE</a> 및 <a href="yii-sphinx-activerecord#OP_DELETE-detail">OP_DELETE</a> 이며 , 각각 <a href="yii-sphinx-activerecord#insert()-detail">insert ()</a> , <a href="yii-sphinx-activerecord#update()-detail">update ()</a> 및 <a href="yii-sphinx-activerecord#delete()-detail">delete ()</a> 메소드에 해당합니다. 기본적으로 이러한 메소드는 트랜잭션에 포함되지 않습니다.
ru: Поддерживаемые операции БД: <a href="yii-sphinx-activerecord#OP_INSERT-detail">OP_INSERT</a> , <a href="yii-sphinx-activerecord#OP_UPDATE-detail">OP_UPDATE</a> и <a href="yii-sphinx-activerecord#OP_DELETE-detail">OP_DELETE</a> , которые соответствуют методам <a href="yii-sphinx-activerecord#insert()-detail">insert ()</a> , <a href="yii-sphinx-activerecord#update()-detail">update ()</a> и <a href="yii-sphinx-activerecord#delete()-detail">delete ()</a> соответственно. По умолчанию эти методы НЕ включаются в транзакцию.

source: The supported authentication methods.
ja: サポートされている認証方法。
ko: 지원되는 인증 방법.
ru: Поддерживаемые методы аутентификации.

source: The supported authentication methods. This property should take a list of supported authentication methods, each represented by an authentication class or configuration.
ja: サポートされている認証メソッド。このプロパティは、サポートされている認証メソッドのリストを取る必要があります。
ko: 지원되는 인증 방법. 이 속성은 각각 인증 클래스 또는 구성으로 표시되는 지원되는 인증 방법 목록을 가져와야합니다.
ru: Поддерживаемые методы аутентификации.Данное свойство должно содержать список поддерживаемых методов аутентификации,каждый из которых представлен классом или конфигурацией аутентификации.

source: The supported language code
ja: サポートされている言語コード
ko: 지원되는 언어 코드
ru: Поддерживаемый код языка

source: The table alias.
ja: テーブルのエイリアスです。
ko: 테이블 별명.
ru: Псевдоним стола.

source: The table metadata
ja: テーブルのメタデータ
ko: 테이블 메타 데이터
ru: Табличные метаданные

source: The table metadata object
ja: テーブルのメタデータオブジェクト
ko: 테이블 메타 데이터 개체
ru: Объект метаданных таблицы

source: The table name
ja: テーブル名
ko: 테이블 이름
ru: Название таблицы

source: The table name (which may contain schema prefix)
ja: テーブル名 (スキーマ接頭辞を含む可能性があります)
ko: 테이블 이름 (스키마 접두사를 포함 할 수 있음)
ru: Имя таблицы (которое может содержать префикс схемы)

source: The table name to be converted
ja: 変換されるテーブル名
ko: 변환 할 테이블 이름
ru: Имя таблицы,которая будет конвертирована

source: The table name to generate.
ja: 生成するテーブル名。
ko: 생성 할 테이블 이름입니다.
ru: Имя таблицы для генерации.

source: The table name.
ja: テーブル名です。
ko: 테이블 이름
ru: Название таблицы.

source: The table name. Defaults to empty string, meaning that no table will be changed.
ja: テーブル名。デフォルトは空の文字列で、テーブルが変更されないことを意味します。
ko: 테이블 이름 기본값은 빈 문자열로, 테이블이 변경되지 않음을 의미합니다.
ru: Название таблицы.По умолчанию пустая строка,что означает,что таблица не будет изменена.

source: The table name. Meaningless for MySQL.
ja: テーブル名。MySQLでは無意味。
ko: 테이블 이름 MySQL에게는 의미가 없습니다.
ru: Название таблицы.Бессмысленно для MySQL.

source: The table name. Meaningless for SQLite.
ja: テーブル名。SQLiteでは無意味。
ko: 테이블 이름 SQLite에는 의미가 없습니다.
ru: Название таблицы.Бессмысленно для SQLite.

source: The table names that match the pattern specified by <a href="yii-gii-generators-model-generator#%24tableName-detail">$tableName</a>.
ja: <a href="yii-gii-generators-model-generator#%24tableName-detail">$ tableNameで</a>指定されたパターンに一致するテーブル名。
ko: <a href="yii-gii-generators-model-generator#%24tableName-detail">$ tableName에</a> 의해 지정된 패턴과 일치하는 테이블 이름입니다 .
ru: Имена таблиц, соответствующие шаблону, указанному в <a href="yii-gii-generators-model-generator#%24tableName-detail">$ tableName</a> .

source: The table schema
ja: テーブルスキーマ
ko: 테이블 스키마
ru: Схема таблицы

source: The table that new rows will be inserted into.
ja: 新しい行が挿入されるテーブル。
ko: 새 행이 삽입 될 테이블입니다.
ru: Таблица,в которую будут вставляться новые строки.

source: The table that the foreign key constraint will be added to.
ja: 外部キー制約が追加されるテーブル。
ko: 외래 키 제약 조건이 추가 될 테이블입니다.
ru: Таблица,к которой будет добавлено ограничение по внешнему ключу.

source: The table that the foreign key references to.
ja: 外部キーが参照するテーブル。
ko: 외래 키가 참조하는 테이블입니다.
ru: Таблица,на которую ссылаются иностранные ключи.

source: The table that the new column will be added to. The table name will be properly quoted by the method.
ja: 新しいカラムが追加されるテーブル。テーブル名はメソッドによって適切に引用されます。
ko: 새 열이 추가 될 테이블입니다. 테이블 이름은 메소드에 의해 올바르게 인용됩니다.
ru: Таблица,к которой будет добавлен новый столбец.Имя таблицы будет правильно процитировано методом.

source: The table that the new index will be created for. The table name will be properly quoted by the method.
ja: 新しいインデックスが作成されるテーブル。テーブル名はメソッドによって適切に引用されます。
ko: 새 색인이 작성 될 테이블입니다. 테이블 이름은 메소드에 의해 올바르게 인용됩니다.
ru: Таблица,для которой будет создан новый индекс.Имя таблицы будет правильно процитировано методом.

source: The table that the primary key constraint will be added to.
ja: 主キー制約が追加されるテーブル。
ko: 기본 키 제약 조건이 추가 될 테이블입니다.
ru: Таблица,к которой будет добавлено ограничение первичного ключа.

source: The table that the primary key constraint will be removed from.
ja: 主キー制約が削除されるテーブル。
ko: 기본 키 제약 조건이 제거 될 테이블입니다.
ru: Таблица,из которой будет удалено ограничение первичного ключа.

source: The table to be dropped. The name will be properly quoted by the method.
ja: ドロップするテーブルです。名前はメソッドによって適切に引用されます。
ko: 제거 할 테이블입니다. 이 방법으로 이름이 올바르게 인용됩니다.
ru: Стол,который нужно опустить.Имя будет правильно процитировано методом.

source: The table to be joined.
ja: 結合されるテーブル。
ko: 결합 할 테이블입니다.
ru: Стол,к которому нужно присоединиться.

source: The table to be renamed. The name will be properly quoted by the method.
ja: 名前を変更するテーブル。この名前はメソッドによって適切に引用されます。
ko: 이름을 바꿀 테이블입니다. 이 방법으로 이름이 올바르게 인용됩니다.
ru: Стол,который будет переименован.Имя будет правильно процитировано методом.

source: The table to be truncated. The name will be properly quoted by the method.
ja: 切り捨てられるテーブル。この名前はメソッドによって適切に引用されます。
ko: 잘릴 테이블입니다. 이 방법으로 이름이 올바르게 인용됩니다.
ru: Стол,который будет усечен.Имя будет правильно процитировано методом.

source: The table to be updated.
ja: 更新するテーブルです。
ko: 업데이트 할 테이블입니다.
ru: Таблица будет обновлена.

source: The table where the data will be deleted from.
ja: データが削除されるテーブル。
ko: 데이터가 삭제 될 테이블입니다.
ru: Таблица,из которой будут удалены данные.

source: The table whose column is to be changed. The table name will be properly quoted by the method.
ja: カラムが変更されるテーブル。テーブル名はメソッドによって適切に引用されます。
ko: 열을 변경할 테이블입니다. 테이블 이름은 메소드에 의해 올바르게 인용됩니다.
ru: Таблица,столбец которой должен быть изменен.Имя таблицы будет правильно процитировано методом.

source: The table whose column is to be commented. The table name will be properly quoted by the method.
ja: 列がコメントされるテーブル。テーブル名はメソッドによって適切に引用されます。
ko: 열을 주석 처리 할 테이블입니다. 테이블 이름은 메소드에 의해 올바르게 인용됩니다.
ru: Таблица,столбец которой должен быть прокомментирован.Имя таблицы будет правильно процитировано методом.

source: The table whose column is to be dropped. The name will be properly quoted by the method.
ja: カラムがドロップされるテーブル。この名前はメソッドによって適切に引用符で囲まれます。
ko: 열을 삭제할 테이블입니다. 이 방법으로 이름이 올바르게 인용됩니다.
ru: Стол,колонка которого должна быть опущена.Название будет правильно процитировано методом.

source: The table whose column is to be renamed. The name will be properly quoted by the method.
ja: カラムの名前を変更するテーブル。この名前はメソッドによって適切に引用されます。
ko: 열 이름을 바꿀 테이블입니다. 이 방법으로 이름이 올바르게 인용됩니다.
ru: Таблица,столбец которой должен быть переименован.Название будет правильно процитировано методом.

source: The table whose foreign is to be dropped. The name will be properly quoted by the method.
ja: 外部が削除されるテーブル。この名前はメソッドによって適切に引用符で囲まれます。
ko: 외부를 제거 할 테이블입니다. 이 방법으로 이름이 올바르게 인용됩니다.
ru: Стол,чей иноземец должен быть сброшен.Имя будет правильно процитировано методом.

source: The table whose index is to be dropped. The name will be properly quoted by the method.
ja: インデックスが削除されるテーブル。この名前はメソッドによって適切に引用符で囲まれます。
ko: 인덱스를 삭제할 테이블입니다. 이 방법으로 이름이 올바르게 인용됩니다.
ru: Таблица,чей индекс должен быть опущен.Имя будет правильно процитировано методом.

source: The table(s) to be selected from.
ja: 選択されるテーブル。
ko: 선택할 테이블.
ru: Таблица(и),из которой(ых)следует выбрать.

source: The table(s) to be selected from. For example, <code>['user', 'post']</code>. This is used to construct the FROM clause in a SQL statement.
ja: 選択するテーブル。たとえば、 <code>['user', 'post']</code> 。これは、SQLステートメントでFROM句を作成するために使用されます。
ko: 선택할 테이블. 예를 들어 <code>['user', 'post']</code> 입니다. 이것은 SQL 문에서 FROM 절을 구성하는 데 사용됩니다.
ru: Таблица (ы) для выбора. Например, <code>['user', 'post']</code> . Это используется для создания предложения FROM в операторе SQL.

source: The table(s) to be selected from. This can be either a string (e.g. <code>'user'</code>) or an array (e.g. <code>['user', 'profile']</code>) specifying one or several table names. Table names can contain schema prefixes (e.g. <code>'public.user'</code>) and/or table aliases (e.g. <code>'user u'</code>). The method will automatically quote the table names unless it contains some parenthesis (which means the table is given as a sub-query or DB expression).
ja: 選択するテーブル。これは <code>['user', 'profile']</code> 1つまたは複数のテーブル名を指定する文字列（例： <code>'user'</code> ）または配列（例：['user'、 'profile']）のいずれかです。テーブル名には、スキーマプレフィックス（ <code>'public.user'</code> など）やテーブルエイリアス（ <code>'user u'</code> など）を含めることができます。このメソッドは、括弧が含まれていない限り、テーブル名を自動的に引用します（つまり、テーブルがサブクエリまたはDB式として指定されていることを意味します）。
ko: 선택할 테이블. 하나 이상의 테이블 이름을 지정 하는 문자열 (예 : <code>'user'</code> ) 또는 배열 (예 : <code>['user', 'profile']</code> ) 일 수 있습니다. 테이블 이름은 스키마 접두사 (예 : <code>'public.user'</code> ) 및 / 또는 테이블 별칭 (예 : <code>'user u'</code> )을 포함 할 수 있습니다. 메소드는 괄호를 포함하지 않는 한 테이블 이름을 자동으로 인용합니다 (테이블이 하위 쿼리 또는 DB 표현식으로 제공됨을 의미 함).
ru: Таблица (ы) для выбора. Это может быть строка (например, <code>'user'</code> ) или массив (например, <code>['user', 'profile']</code> ), определяющий одно или несколько имен таблиц. Имена таблиц могут содержать префиксы схемы (например, <code>'public.user'</code> ) и / или псевдонимы таблиц (например, <code>'user u'</code> ). Метод будет автоматически заключать имена таблиц в кавычки, если они не содержат скобки (что означает, что таблица задана как подзапрос или выражение БД).

source: The tag name. If $name is <code>null</code> or <code>false</code>, the corresponding content will be rendered without any tag.
ja: タグ名。$ nameが <code>null</code> または <code>false</code> の場合、対応するコンテンツはタグなしでレンダリングされます。
ko: 태그 이름 $ name이 <code>null</code> 또는 <code>false</code> 인 경우 해당 컨텐츠는 태그없이 렌더링됩니다.
ru: Имя тега. Если $ name имеет значение <code>null</code> или <code>false</code> , соответствующий контент будет отображаться без тега.

source: The tag options
ja: タグオプション
ko: 태그 옵션
ru: Опции тегов

source: The tag options in terms of name-value pairs.
ja: 名前と値のペアでのタグオプション。
ko: 이름-값 쌍으로 태그 옵션.
ru: Опции тегов с точки зрения пар "имя-значение".

source: The tag options in terms of name-value pairs. It will be merged with <a href="yii-widgets-activefield#%24errorOptions-detail">$errorOptions</a>. The options will be rendered as the attributes of the resulting tag. The values will be HTML-encoded using <a href="yii-helpers-basehtml#encode()-detail">yii\helpers\Html::encode()</a>. If this parameter is <code>false</code>, no error tag will be rendered.
ja: 名前と値のペアに関するタグオプション。これは、とマージされます<a href="yii-widgets-activefield#%24errorOptions-detail">$ errorOptions</a>。オプションは、結果のタグの属性としてレンダリングされます。値は<a href="yii-helpers-basehtml#encode()-detail">yii \ helpers \ Html :: encode（）</a>を使用してHTMLエンコードされます。このパラメーターが <code>false</code> の場合、エラータグはレンダリングされません。
ko: 이름-값 쌍으로 태그 옵션. <a href="yii-widgets-activefield#%24errorOptions-detail">$ errorOptions</a> 와 병합됩니다 . 옵션은 결과 태그의 속성으로 렌더링됩니다. 값은 <a href="yii-helpers-basehtml#encode()-detail">yii \ helpers \ Html :: encode ()를</a> 사용하여 HTML로 인코딩됩니다 . 이 매개 변수가 <code>false</code> 이면 오류 태그가 렌더링되지 않습니다.
ru: Параметры тега в виде пар имя-значение. Он будет объединен с <a href="yii-widgets-activefield#%24errorOptions-detail">$ errorOptions</a> . Параметры будут отображаться как атрибуты результирующего тега. Значения будут закодированы в HTML с помощью <a href="yii-helpers-basehtml#encode()-detail">yii \ helpers \ Html :: encode ()</a> . Если этот параметр равен <code>false</code> , тег ошибки отображаться не будет.

source: The tag options in terms of name-value pairs. It will be merged with <a href="yii-widgets-activefield#%24labelOptions-detail">$labelOptions</a>. The options will be rendered as the attributes of the resulting tag. The values will be HTML-encoded using <a href="yii-helpers-basehtml#encode()-detail">yii\bootstrap\Html::encode()</a>. If a value is <code>null</code>, the corresponding attribute will not be rendered.
ja: 名前と値のペアに関するタグオプション。これは、とマージされます<a href="yii-widgets-activefield#%24labelOptions-detail">$ labelOptions</a>。オプションは、結果のタグの属性としてレンダリングされます。値は<a href="yii-helpers-basehtml#encode()-detail">yii \ bootstrap \ Html :: encode（）</a>を使用してHTMLエンコードされます。値が <code>null</code> の場合、対応する属性はレンダリングされません。
ko: 이름-값 쌍으로 태그 옵션. <a href="yii-widgets-activefield#%24labelOptions-detail">$ labelOptions</a> 와 병합됩니다 . 옵션은 결과 태그의 속성으로 렌더링됩니다. 값은 <a href="yii-helpers-basehtml#encode()-detail">yii \ bootstrap \ Html :: encode ()를</a> 사용하여 HTML로 인코딩됩니다 . 값이 <code>null</code> 인 경우 해당 속성이 렌더링되지 않습니다.
ru: Параметры тега в виде пар имя-значение. Он будет объединен с <a href="yii-widgets-activefield#%24labelOptions-detail">$ labelOptions</a> . Параметры будут отображаться как атрибуты результирующего тега. Значения будут закодированы в HTML с помощью <a href="yii-helpers-basehtml#encode()-detail">yii \ bootstrap \ Html :: encode ()</a> . Если значение равно <code>null</code> , соответствующий атрибут не будет отображаться.

source: The tag options in terms of name-value pairs. It will be merged with <a href="yii-widgets-activefield#%24labelOptions-detail">$labelOptions</a>. The options will be rendered as the attributes of the resulting tag. The values will be HTML-encoded using <a href="yii-helpers-basehtml#encode()-detail">yii\helpers\Html::encode()</a>. If a value is <code>null</code>, the corresponding attribute will not be rendered.
ja: 名前と値のペアに関するタグオプション。これは、とマージされます<a href="yii-widgets-activefield#%24labelOptions-detail">$ labelOptions</a>。オプションは、結果のタグの属性としてレンダリングされます。値は<a href="yii-helpers-basehtml#encode()-detail">yii \ helpers \ Html :: encode（）</a>を使用してHTMLエンコードされます。値が <code>null</code> の場合、対応する属性はレンダリングされません。
ko: 이름-값 쌍으로 태그 옵션. <a href="yii-widgets-activefield#%24labelOptions-detail">$ labelOptions</a> 와 병합됩니다 . 옵션은 결과 태그의 속성으로 렌더링됩니다. 값은 <a href="yii-helpers-basehtml#encode()-detail">yii \ helpers \ Html :: encode ()를</a> 사용하여 HTML로 인코딩됩니다 . 값이 <code>null</code> 인 경우 해당 속성이 렌더링되지 않습니다.
ru: Параметры тега в виде пар имя-значение. Он будет объединен с <a href="yii-widgets-activefield#%24labelOptions-detail">$ labelOptions</a> . Параметры будут отображаться как атрибуты результирующего тега. Значения будут закодированы в HTML с помощью <a href="yii-helpers-basehtml#encode()-detail">yii \ helpers \ Html :: encode ()</a> . Если значение равно <code>null</code> , соответствующий атрибут не будет отображаться.

source: The tag options in terms of name-value pairs. See <a href="yii-bootstrap-basehtml#staticControl()-detail">staticControl()</a> for details.
ja: 名前と値のペアに関するタグオプション。詳細については、<a href="yii-bootstrap-basehtml#staticControl()-detail">staticControl（）</a>を参照してください。
ko: 이름-값 쌍으로 태그 옵션. 자세한 내용은 <a href="yii-bootstrap-basehtml#staticControl()-detail">staticControl ()</a> 을 참조하십시오.
ru: Параметры тега в виде пар имя-значение. Подробнее см. <a href="yii-bootstrap-basehtml#staticControl()-detail">StaticControl ()</a> .

source: The tag options in terms of name-value pairs. See <a href="yii-helpers-basehtml#a()-detail">yii\helpers\Html::a()</a>.
ja: 名前と値のペアに関するタグオプション。<a href="yii-helpers-basehtml#a()-detail">yii \ helpers \ Html :: a（）を</a>参照してください。
ko: 이름-값 쌍으로 태그 옵션. <a href="yii-helpers-basehtml#a()-detail">yii \ helpers \ Html :: a ()를</a> 참조하십시오 .
ru: Параметры тега в виде пар имя-значение. См. <a href="yii-helpers-basehtml#a()-detail">Yii \ helpers \ Html :: a ()</a> .

source: The tag options in terms of name-value pairs. See <a href="yii-helpers-basehtml#booleanInput()-detail">booleanInput()</a> for details about accepted attributes.
ja: 名前と値のペアに関するタグオプション。参照<a href="yii-helpers-basehtml#booleanInput()-detail">booleanInputを（）</a>受け入れた属性の詳細については。
ko: 이름-값 쌍으로 태그 옵션. 허용되는 속성에 대한 자세한 내용은 <a href="yii-helpers-basehtml#booleanInput()-detail">booleanInput ()</a> 을 참조하십시오 .
ru: Параметры тега в виде пар имя-значение. См. <a href="yii-helpers-basehtml#booleanInput()-detail">BooleanInput ()</a> для получения подробной информации о принятых атрибутах.

source: The tag options in terms of name-value pairs. See <a href="yii-helpers-basehtml#img()-detail">yii\helpers\Html::img()</a>.
ja: 名前と値のペアに関するタグオプション。<a href="yii-helpers-basehtml#img()-detail">yii \ helpers \ Html :: img（）を</a>参照してください。
ko: 이름-값 쌍으로 태그 옵션. <a href="yii-helpers-basehtml#img()-detail">yii \ helpers \ Html :: img ()를</a> 참조하십시오 .
ru: Параметры тега в виде пар имя-значение. См. <a href="yii-helpers-basehtml#img()-detail">Yii \ helpers \ Html :: img ()</a> .

source: The tag options in terms of name-value pairs. See <a href="yii-helpers-basehtml#mailto()-detail">yii\helpers\Html::mailto()</a>.
ja: 名前と値のペアに関するタグオプション。<a href="yii-helpers-basehtml#mailto()-detail">yii \ helpers \ Html :: mailto（）を</a>参照してください。
ko: 이름-값 쌍으로 태그 옵션. <a href="yii-helpers-basehtml#mailto()-detail">yii \ helpers \ Html :: mailto ()를</a> 참조하십시오 .
ru: Параметры тега в виде пар имя-значение. См. <a href="yii-helpers-basehtml#mailto()-detail">Yii \ helpers \ Html :: mailto ()</a> .

source: The tag options in terms of name-value pairs. The following option is specially handled:
ja: 名前と値のペアでのタグオプション。以下のオプションを特別に扱います。
ko: 이름-값 쌍으로 태그 옵션. 다음 옵션이 특별히 처리됩니다.
ru: Опции тегов с точки зрения пар "имя-значение".Следующий вариант специально обработан:

source: The tag options in terms of name-value pairs. The following options are specially handled:
ja: 名前と値のペアでのタグオプション。以下のオプションは特別に扱われます。
ko: 이름-값 쌍으로 태그 옵션. 다음과 같은 옵션이 특별히 처리됩니다.
ru: Опции тегов с точки зрения пар "имя-значение".Специально обработаны следующие опции:
