Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/yii/yii.*.022.xlf
Languages: ja, ko, ru

source: The sequence name. Defaults to null.
ja: シーケンス名。デフォルトは null です。
ko: 시퀀스 이름 기본값은 null입니다.
ru: Имя последовательности.По умолчанию равен нулю.

source: The sequence will be reset such that the primary key of the next new row inserted will have the specified value or 1.
ja: 次に挿入される新しい行の主キーが指定された値か 1 になるようにシーケンスがリセットされます。
ko: 삽입 된 다음 새 행의 기본 키에 지정된 값 또는 1이 있도록 순서가 재설정됩니다.
ru: Последовательность будет сброшена таким образом,что первичный ключ следующей новой вставленной строки будет иметь заданное значение или 1.

source: The serialized data.
ja: シリアル化されたデータです。
ko: 직렬화 된 데이터
ru: Сериализованные данные.

source: The session ID for the current session
ja: 現在のセッションのセッションID
ko: 현재 세션의 세션 ID
ru: Идентификатор сессии для текущей сессии

source: The session component.
ja: セッションコンポーネント。
ko: 세션 구성 요소
ru: Сессионный компонент.

source: The session cookie parameters.
ja: セッションクッキーのパラメータです。
ko: 세션 쿠키 매개 변수
ru: Параметры сессионного куки-файла.

source: The session data
ja: セッションデータ
ko: 세션 데이터
ru: Данные сессии

source: The session name for the current session, must be an alphanumeric string. It defaults to "PHPSESSID".
ja: 現在のセッションのセッション名は、英数字の文字列でなければなりません。デフォルトは "PHPSESSID "です。
ko: 현재 세션의 세션 이름은 영숫자 문자열이어야합니다. 기본값은 "PHPSESSID"입니다.
ru: Имя сессии для текущей сессии должно быть буквенно-цифровой строкой.По умолчанию оно имеет значение "PHPSESSID".

source: The session variable name
ja: セッション変数名
ko: 세션 변수 이름
ru: Имя переменной сеанса

source: The session variable name used to store the value of <a href="yii-web-user#%24id-detail">$id</a>.
ja: <a href="yii-web-user#%24id-detail">$ idの</a>値を格納するために使用されるセッション変数名。
ko: <a href="yii-web-user#%24id-detail">$ id</a> 값을 저장하는 데 사용되는 세션 변수 이름 입니다.
ru: Имя переменной сеанса, используемое для хранения значения <a href="yii-web-user#%24id-detail">$ id</a> .

source: The session variable name used to store the value of <a href="yii-web-user#%24returnUrl-detail">$returnUrl</a>.
ja: <a href="yii-web-user#%24returnUrl-detail">$ returnUrlの</a>値を格納するために使用されるセッション変数名。
ko: <a href="yii-web-user#%24returnUrl-detail">$ returnUrl</a> 값을 저장하는 데 사용되는 세션 변수 이름 입니다.
ru: Имя переменной сеанса, используемое для хранения значения <a href="yii-web-user#%24returnUrl-detail">$ returnUrl</a> .

source: The session variable name used to store the value of absolute expiration timestamp of the authenticated state.
ja: 認証された状態の絶対的な有効期限のタイムスタンプの値を格納するために使用されるセッション変数名です。
ko: 인증 된 상태의 절대 만료 타임 스탬프 값을 저장하는 데 사용되는 세션 변수 이름입니다.
ru: Имя переменной сеанса,используемое для хранения значения абсолютного времени истечения срока действия аутентифицированного состояния.

source: The session variable name used to store the value of absolute expiration timestamp of the authenticated state. This is used when <a href="yii-web-user#%24absoluteAuthTimeout-detail">$absoluteAuthTimeout</a> is set.
ja: 認証済み状態の絶対有効期限タイムスタンプの値を格納するために使用されるセッション変数名。これは、<a href="yii-web-user#%24absoluteAuthTimeout-detail">$ absoluteAuthTimeout</a>が設定されている場合に使用されます。
ko: 인증 된 상태의 절대 만료 타임 스탬프 값을 저장하는 데 사용되는 세션 변수 이름입니다. <a href="yii-web-user#%24absoluteAuthTimeout-detail">$ absoluteAuthTimeout</a> 이 설정된 경우에 사용됩니다 .
ru: Имя переменной сеанса, используемое для хранения значения абсолютной отметки времени истечения аутентифицированного состояния. Используется, когда установлен <a href="yii-web-user#%24absoluteAuthTimeout-detail">$ absoluteAuthTimeout</a> .

source: The session variable name used to store the value of expiration timestamp of the authenticated state.
ja: 認証された状態の有効期限のタイムスタンプの値を格納するために使用されるセッション変数名です。
ko: 인증 된 상태의 만료 타임 스탬프 값을 저장하는 데 사용되는 세션 변수 이름입니다.
ru: Имя переменной сеанса,используемое для хранения значения метки времени истечения срока действия аутентифицированного состояния.

source: The session variable name used to store the value of expiration timestamp of the authenticated state. This is used when <a href="yii-web-user#%24authTimeout-detail">$authTimeout</a> is set.
ja: 認証済み状態の有効期限タイムスタンプの値を格納するために使用されるセッション変数名。これは、<a href="yii-web-user#%24authTimeout-detail">$ authTimeout</a>が設定されているときに使用されます。
ko: 인증 된 상태의 만료 타임 스탬프 값을 저장하는 데 사용되는 세션 변수 이름입니다. <a href="yii-web-user#%24authTimeout-detail">$ authTimeout 일</a> 때 사용됩니다. 이 설정 .
ru: Имя переменной сеанса, используемое для хранения значения метки времени истечения аутентифицированного состояния. Используется, когда установлен <a href="yii-web-user#%24authTimeout-detail">$ authTimeout</a> .

source: The session variable value, or $defaultValue if the session variable does not exist.
ja: セッション変数の値、またはセッション変数が存在しない場合は$defaultValue。
ko: 세션 변수 값 또는 세션 변수가없는 경우 $ defaultValue
ru: Значение переменной сеанса,или $defaultValue,если переменная сеанса не существует.

source: The set of attributes to check
ja: チェックする属性のセット
ko: 확인할 속성 세트
ru: Набор атрибутов для проверки

source: The set of value to search.
ja: 検索する値のセット。
ko: 검색 할 값 집합입니다.
ru: Набор значений для поиска.

source: The set of values to search.
ja: 検索する値のセット。
ko: 검색 할 값 집합입니다.
ru: Набор значений для поиска.

source: The signature of an event handler is:
ja: イベントハンドラのシグネチャは
ko: 이벤트 핸들러의 서명은 다음과 같습니다.
ru: Подпись обработчика события:

source: The signature of an event handler should be as follows, where <code>$event</code> refers to the event parameter. Please refer to the <a href="guide-concept-events">Events</a> section for more details about events.
ja: イベントハンドラーのシグネチャは次のようにする必要があります。 <code>$event</code> はイベントパラメーターを表します。<a href="guide-concept-events">イベントの</a>詳細については、「イベント」セクションを参照してください。
ko: 이벤트 핸들러의 서명은 다음과 같아야합니다. 여기서 <code>$event</code> 는 이벤트 매개 변수를 나타냅니다. 를 참조하십시오 <a href="guide-concept-events">이벤트</a> 이벤트에 대한 자세한 내용은 섹션을 참조하십시오.
ru: Сигнатура обработчика события должна быть следующей, где <code>$event</code> относится к параметру события. Пожалуйста, обратитесь к разделу <a href="guide-concept-events">События</a> для получения более подробной информации о событиях.

source: The signature of an event handler should be like the following:
ja: イベントハンドラのシグネチャは以下のようにします。
ko: 이벤트 핸들러의 서명은 다음과 같아야합니다.
ru: Подпись обработчика события должна быть следующей:

source: The signature of the anonymous function should be as follows:
ja: 匿名関数のシグネチャは以下のようにします。
ko: 익명 함수의 서명은 다음과 같아야합니다.
ru: Подпись анонимной функции должна быть следующей:

source: The signature of the callable should be <code>function ($message)</code>.
ja: 呼び出し可能オブジェクトの署名は <code>function ($message)</code> 必要があります。
ko: 콜 러블의 서명은 <code>function ($message)</code> 이어야합니다 .
ru: Подпись вызываемого объекта должна быть <code>function ($message)</code> .

source: The signature of the callback is:
ja: コールバックのシグネチャは
ko: 콜백의 서명은 다음과 같습니다.
ru: Подпись обратного вызова:

source: The signature of the callback should be as follows:
ja: コールバックのシグネチャは以下のようにします。
ko: 콜백의 서명은 다음과 같아야합니다.
ru: Подпись обратного вызова должна быть следующей:

source: The signature of the callback should be: <code>function ($from, $to)</code>, where <code>$from</code> is the sub-directory or file to be copied from, while <code>$to</code> is the copy target.
ja: コールバックのシグネチャは <code>function ($from, $to)</code> でなければなりません。ここで、 <code>$from</code> はコピー元のサブディレクトリまたはファイル、 <code>$to</code> はコピー先です。
ko: 콜백의 서명은 <code>function ($from, $to)</code> 이어야합니다. 여기서 <code>$from</code> 은 복사 할 서브 디렉토리 또는 파일이고 <code>$to</code> 는 복사 대상입니다.
ru: Сигнатура обратного вызова должна быть следующей: <code>function ($from, $to)</code> , где <code>$from</code> - подкаталог или файл, из которого нужно скопировать, а <code>$to</code> - цель копирования.

source: The signature of the function should be as follows: <code>function ($model, $key, $index, $column)</code> where <code>$model</code>, <code>$key</code>, and <code>$index</code> refer to the model, key and index of the row currently being rendered and <code>$column</code> is a reference to the <a href="yii-grid-radiobuttoncolumn">yii\grid\RadioButtonColumn</a> object.
ja: 関数のシグネチャは次のようになります <code>function ($model, $key, $index, $column)</code> ここで、 <code>$model</code> 、 <code>$key</code> 、および <code>$index</code> indexは、現在レンダリングされている行のモデル、キー、およびインデックスと <code>$column</code> は、<a href="yii-grid-radiobuttoncolumn">yii \ grid \ RadioButtonColumn</a>オブジェクトへの参照です。
ko: 과 같아야 함수의 서명은 다음과 <code>function ($model, $key, $index, $column)</code> <code>$model</code> , <code>$key</code> , 그리고 <code>$index</code> 모델, 키 인덱스 행의 현재 렌더링되고 그리고 참조 <code>$column</code> 은 <a href="yii-grid-radiobuttoncolumn">yii \ grid \ RadioButtonColumn</a> 객체에 대한 참조 입니다.
ru: Сигнатура функции должна быть следующей: <code>function ($model, $key, $index, $column)</code> где <code>$model</code> , <code>$key</code> и <code>$index</code> относятся к модели, ключу и индексу строки, отображаемой в данный момент, и <code>$column</code> - это ссылка на объект <a href="yii-grid-radiobuttoncolumn">yii \ grid \ RadioButtonColumn</a> .

source: The similar hierarchy can be used to organize fixture class files. Instead of using <code>data</code> as the root directory, you may want to use <code>fixtures</code> as the root directory to avoid conflict with the data files.
ja: 同様の階層を使用して、器具クラスファイルを整理できます。 <code>data</code> をルートディレクトリとして使用する代わりに、 <code>fixtures</code> をルートディレクトリとして使用して、データファイルとの競合を回避することができます。
ko: 조명기 클래스 파일을 구성하기 위해 유사한 계층을 사용할 수 있습니다. <code>data</code> 를 루트 디렉토리로 사용하는 대신 , 데이터 파일과의 충돌을 피하기 위해 <code>fixtures</code> 를 루트 디렉토리로 사용할 수 있습니다.
ru: Подобная иерархия может использоваться для организации файлов классов приборов. Вместо использования <code>data</code> в качестве корневого каталога вы можете использовать <code>fixtures</code> в качестве корневого каталога, чтобы избежать конфликта с файлами данных.

source: The simplest usage of UrlRule is to declare a rule like the following in the application configuration,
ja: UrlRuleの最も簡単な使い方は、アプリケーションの設定で以下のようなルールを宣言することです。
ko: UrlRule의 가장 간단한 사용법은 응용 프로그램 구성에서 다음과 같은 규칙을 선언하는 것입니다.
ru: Самое простое использование UrlRule-это объявление правила,подобного следующему,в конфигурации приложения,

source: The simplest way of converting a model into an array is to use the <a href="yii-base-model#%24attributes-detail">yii\base\Model::$attributes</a> property. For example,
ja: モデルを配列に変換する最も簡単な方法は、<a href="yii-base-model#%24attributes-detail">yii \ base \ Model :: $ attributes</a>プロパティを使用することです。例えば、
ko: 모델을 배열로 변환하는 가장 간단한 방법은 <a href="yii-base-model#%24attributes-detail">yii \ base \ Model :: $ attributes</a> 속성을 사용하는 것입니다. 예를 들어
ru: Самый простой способ преобразовать модель в массив - использовать свойство <a href="yii-base-model#%24attributes-detail">yii \ base \ Model :: $ attributes</a> . Например,

source: The single document. Null is returned if the query results in nothing.
ja: 単一のドキュメント。クエリの結果が何もない場合はNullが返されます。
ko: 단일 문서 쿼리 결과가 없으면 Null이 반환됩니다.
ru: Единый документ.Ноль возвращается,если запрос ничего не дает.

source: The size limit for uploaded files.
ja: アップロードされたファイルのサイズ制限。
ko: 업로드 된 파일의 크기 제한
ru: Ограничение по размеру загружаемых файлов.

source: The size of the file that will be used to validate the requested HTTP range.
ja: 要求された HTTP 範囲を検証するために使用されるファイルのサイズ。
ko: 요청 된 HTTP 범위의 유효성을 검증하는 데 사용될 파일의 ​​크기입니다.
ru: Размер файла,который будет использован для проверки запрашиваемого диапазона HTTP.

source: The size of the reserved memory.
ja: 予約されたメモリのサイズ。
ko: 예약 된 메모리의 크기입니다.
ru: Размер зарезервированной памяти.

source: The size of the reserved memory. A portion of memory is pre-allocated so that when an out-of-memory issue occurs, the error handler is able to handle the error with the help of this reserved memory. If you set this value to be 0, no memory will be reserved. Defaults to 256KB.
ja: 予約済みメモリのサイズ。メモリの一部が事前に割り当てられているので、メモリ切れの問題が発生したときに、エラーハンドラはこの予約されたメモリの助けを借りてエラーを処理することができます。この値を 0 に設定すると、メモリは予約されません。既定値は256KBです。
ko: 예약 된 메모리의 크기입니다. 메모리 부족 문제가 발생할 때 오류 처리기는이 예약 된 메모리를 사용하여 오류를 처리 할 수 ​​있도록 메모리의 일부가 사전 할당됩니다. 이 값을 0으로 설정하면 메모리가 예약되지 않습니다. 기본값은 256KB입니다.
ru: Размер зарезервированной памяти.Часть памяти предварительно распределена таким образом,чтобы при возникновении проблемы вне памяти обработчик ошибок мог справиться с ошибкой с помощью этой зарезервированной памяти.Если вы установите это значение равным 0,память не будет зарезервирована.По умолчанию 256 КБ.

source: The so-called message translation service mainly translates a text message from source language to target language.
ja: いわゆるメッセージ翻訳サービスは、主にテキストメッセージをソース言語からターゲット言語に翻訳するサービスです。
ko: 소위 메시지 번역 서비스는 주로 문자 메시지를 원본 언어에서 대상 언어로 번역합니다.
ru: Так называемая услуга перевода сообщений в основном переводит текстовое сообщение с языка оригинала на язык перевода.

source: The sort definition
ja: ソートの定義
ko: 정렬 정의
ru: Определение сорта

source: The sort definition to be used by this data provider. This can be one of the following:
ja: このデータプロバイダが使用するソート定義。これは以下のいずれかになります。
ko: 이 데이터 공급자가 사용할 정렬 정의입니다. 이것은 다음 중 하나 일 수 있습니다.
ru: Определение сортировки,которое будет использоваться этим провайдером данных.Это может быть одно из следующих:

source: The sorted data models
ja: ソートされたデータモデル
ko: 정렬 된 데이터 모델
ru: Модели отсортированных данных

source: The sorting direction. It can be either <code>SORT_ASC</code> or <code>SORT_DESC</code>. When sorting by multiple keys with different sorting directions, use an array of sorting directions.
ja: ソート方向。 <code>SORT_ASC</code> または <code>SORT_DESC</code> のいずれかです。並べ替え方向が異なる複数のキーで並べ替える場合は、並べ替え方向の配列を使用します。
ko: 정렬 방향. <code>SORT_ASC</code> 또는 <code>SORT_DESC</code> 일 수 있습니다 . 정렬 방향이 다른 여러 키로 정렬 할 때는 정렬 방향 배열을 사용하십시오.
ru: Направление сортировки. Это может быть <code>SORT_ASC</code> или <code>SORT_DESC</code> . При сортировке по нескольким ключам с разными направлениями сортировки используйте массив направлений сортировки.

source: The sorting object.
ja: ソートオブジェクトです。
ko: 정렬 객체.
ru: Объект сортировки.

source: The sorting object. If this is false, it means the sorting is disabled.
ja: ソートオブジェクト。これがfalseの場合、ソートが無効になっていることを意味します。
ko: 정렬 객체. 이것이 거짓이면 정렬이 비활성화 된 것입니다.
ru: Объект сортировки.Если он ложный,значит сортировка отключена.

source: The source data to extract a snippet from.
ja: スニペットを抽出するソースデータ。
ko: 스 니펫을 추출 할 소스 데이터입니다.
ru: Исходные данные для извлечения фрагмента.

source: The source directory
ja: ソースディレクトリ
ko: 소스 디렉토리
ru: Исходный каталог

source: The source key
ja: ソースキー
ko: 소스 키
ru: Ключ источника

source: The source password
ja: ソースパスワード
ko: 소스 비밀번호
ru: Исходный пароль

source: The source patterns to be selected.
ja: 選択するソースパターン。
ko: 선택할 소스 패턴.
ru: Выбор исходных шаблонов.

source: The source query object
ja: ソースクエリオブジェクト
ko: 소스 쿼리 객체
ru: Объект исходного запроса

source: The space of such keys should be big enough to defeat potential identity attacks.
ja: このような鍵の空間は、潜在的な ID 攻撃を打ち負かすのに十分な大きさでなければならない。
ko: 이러한 키의 공간은 잠재적 인 신원 공격을 물리 칠 수있을만큼 커야합니다.
ru: Пространство таких ключей должно быть достаточно большим,чтобы победить потенциальные атаки на идентичность.

source: The special rules for converting a word between its plural form and singular form.
ja: 複数形と単数形の間で単語を変換するための特別なルール。
ko: 복수형과 단수형 사이에서 단어를 변환하는 특수 규칙.
ru: Специальные правила преобразования слова между его множественной и единственной формой.

source: The special rules for converting a word between its plural form and singular form. The keys are the special words in singular form, and the values are the corresponding plural form.
ja: 単語を複数形と単数形の間で変換するための特別な規則。キーは単数形の特殊な単語、値は対応する複数形です。
ko: 복수형과 단수형 사이에서 단어를 변환하는 특수 규칙. 키는 단수 형태의 특수 단어이고 값은 해당하는 복수 형태입니다.
ru: Специальные правила преобразования слова между его множественной и единственной формой.Ключами являются специальные слова в единственном числе,а значения-в соответствующем множественном числе.

source: The specification of the attribute to be rendered.
ja: レンダリングする属性の指定。
ko: 렌더링 할 속성의 스펙입니다.
ru: Спецификация отображаемого атрибута.

source: The starting position
ja: 開始位置
ko: 시작 위치
ru: Стартовая позиция

source: The static string being rendered
ja: レンダリングされる静的文字列
ko: 렌더링되는 정적 문자열
ru: Отрисовывается статическая строка

source: The status code
ja: ステータスコード
ko: 상태 코드
ru: Код статуса

source: The status of the action execution. 0 means normal, other values mean abnormal.
ja: アクションの実行状態を表します。0は正常、その他の値は異常を意味します。
ko: 작업 실행 상태 0은 정상, 다른 값은 비정상을 의미합니다.
ru: Статус выполнения действия.0 означает нормальное,другие значения-аномальное.

source: The status text. If not set, it will be set automatically based on the status code.
ja: ステータステキストです。設定されていない場合は、ステータスコードに基づいて自動的に設定されます。
ko: 상태 텍스트 설정하지 않으면 상태 코드에 따라 자동으로 설정됩니다.
ru: Текст статуса.Если он не установлен,он будет установлен автоматически на основе кода статуса.

source: The stream offset to seek to.
ja: シークするストリームオフセット。
ko: 검색 할 스트림 오프셋입니다.
ru: Смещение потока,к которому нужно стремиться.

source: The stream to be sent.
ja: 送信するストリーム。
ko: 전송할 스트림입니다.
ru: Поток,который нужно отправить.

source: The stream to be sent. This can be a stream handle or an array of stream handle, the begin position and the end position. Note that when this property is set, the <a href="yii-web-response#%24data-detail">$data</a> and <a href="yii-web-response#%24content-detail">$content</a> properties will be ignored by <a href="yii-web-response#send()-detail">send()</a>.
ja: 送信するストリーム。これは、ストリームハンドルまたはストリームハンドルの配列、開始位置と終了位置にすることができます。このプロパティが設定されている場合、<a href="yii-web-response#%24data-detail">$ data</a>および<a href="yii-web-response#%24content-detail">$ content</a>プロパティは<a href="yii-web-response#send()-detail">send（）</a>によって無視されることに注意してください。
ko: 전송할 스트림입니다. 스트림 핸들 또는 스트림 핸들 배열, 시작 위치 및 종료 위치 일 수 있습니다. 이 속성이 설정되면 <a href="yii-web-response#%24data-detail">$ data</a> 및 <a href="yii-web-response#%24content-detail">$ content</a> 속성은 <a href="yii-web-response#send()-detail">send ()에</a> 의해 무시됩니다. .
ru: Поток для отправки. Это может быть дескриптор потока или массив дескрипторов потока, начальная и конечная позиции. Обратите внимание, что когда это свойство установлено, свойства <a href="yii-web-response#%24data-detail">$ data</a> и <a href="yii-web-response#%24content-detail">$ content</a> будут игнорироваться функцией <a href="yii-web-response#send()-detail">send ()</a> .

source: The stream to check.
ja: 確認する流れ。
ko: 확인할 스트림입니다.
ru: Поток для проверки.

source: The string being measured for length
ja: 長さを測定しているストリング
ko: 길이를 측정하는 스트링
ru: Измеряемая длина строки

source: The string connecting the last two words. If this is null, it will take the value of <code>$twoWordsConnector</code>.
ja: 最後の2つの単語をつなぐ文字列。これがnullの場合は、 <code>$twoWordsConnector</code> 値を取ります。
ko: 마지막 두 단어를 연결하는 문자열입니다. 이 값이 null이면 <code>$twoWordsConnector</code> 값을 갖습니다 .
ru: Строка, соединяющая последние два слова. Если это значение null, оно примет значение <code>$twoWordsConnector</code> .

source: The string connecting words other than those connected by $lastWordConnector and $twoWordsConnector
ja: lastWordConnector と $twoWordsConnector で接続されている単語以外の単語を接続する文字列。
ko: $ lastWordConnector 및 $ twoWordsConnector로 연결된 단어 이외의 단어를 연결하는 문자열
ru: Строка,соединяющая слова,отличные от тех,что соединены $lastWordConnector и $twoWordsConnector.

source: The string connecting words when there are only two
ja: 単語が2つしかないときに単語をつなぐ文字列
ko: 두 개만있을 때 단어를 연결하는 문자열
ru: Слова,соединяющие строки,когда есть только два

source: The string generated matches [A-Za-z0-9_-]+ and is transparent to URL-encoding.
ja: 生成された文字列は[A-Za-z0-9_-]+と一致し、URLエンコードに対して透過的です。
ko: 생성 된 문자열은 [A-Za-z0-9 _-] +와 일치하며 URL 인코딩에 투명합니다.
ru: Генерируемая строка соответствует [A-Za-z0-9_-]+и прозрачна для кодирования URL.

source: The string is a valid PHP expression that can be evaluated by PHP parser and the evaluation result will give back the variable value.
ja: この文字列は、PHP パーサーが評価できる有効な PHP 式であり、評価結果は変数の値を返します。
ko: 문자열은 PHP 파서로 평가할 수있는 유효한 PHP 표현식이며 평가 결과는 변수 값을 반환합니다.
ru: Строка является действительным выражением PHP,которое может быть вычислено парсером PHP,и результат вычисления вернет значение переменной.

source: The string read from stdin
ja: stdin から読み込んだ文字列
ko: stdin에서 읽은 문자열
ru: Строка,считанная из stdin

source: The string representation of a PHP expression whose result is used to determine the dependency.
ja: PHP の式を文字列で表現したもので、その結果を用いて依存関係を決定します。
ko: 의존성을 결정하기 위해 결과가 사용되는 PHP 표현식의 문자열 표현.
ru: Строковое представление выражения PHP,результат которого используется для определения зависимости.

source: The string representation of a PHP expression whose result is used to determine the dependency. A PHP expression can be any PHP code that evaluates to a value. To learn more about what an expression is, please refer to the <a href="http://www.php.net/manual/en/language.expressions.php">php manual</a>.
ja: 結果が依存関係を決定するために使用されるPHP式の文字列表現。 PHP式には、値に評価される任意のPHPコードを使用できます。式の詳細については、<a href="http://www.php.net/manual/en/language.expressions.php">PHPのマニュアル</a>を参照してください。
ko: 의존성을 결정하기 위해 결과가 사용되는 PHP 표현식의 문자열 표현. PHP 표현식은 값으로 평가되는 모든 PHP 코드 일 수 있습니다. 표현식이 무엇인지에 대한 자세한 내용은 <a href="http://www.php.net/manual/en/language.expressions.php">PHP 매뉴얼을</a> 참조하십시오 .
ru: Строковое представление выражения PHP, результат которого используется для определения зависимости. Выражением PHP может быть любой код PHP, который оценивает значение. Чтобы узнать больше о том, что такое выражение, обратитесь к руководству по <a href="http://www.php.net/manual/en/language.expressions.php">php</a> .

source: The string representation of the exception.
ja: 例外の文字列表現。
ko: 예외의 문자열 표현.
ru: Строковое представление исключения.

source: The string representation of the object
ja: オブジェクトの文字列表現
ko: 객체의 문자열 표현
ru: Строковое представление объекта

source: The string representation of the variable
ja: 変数の文字列表現
ko: 변수의 문자열 표현
ru: Строковое представление переменной

source: The string representation of this HTTP message.
ja: この HTTP メッセージの文字列表現。
ko: 이 HTTP 메시지의 캐릭터 라인 표현
ru: Строковое представление этого HTTP-сообщения.

source: The string representation of this message.
ja: このメッセージの文字列表現。
ko: 이 메세지의 캐릭터 라인 표현
ru: Строковое представление этого сообщения.

source: The string representation of this object.
ja: このオブジェクトの文字列表現。
ko: 이 객체의 캐릭터 라인 표현
ru: Строковое представление этого объекта.

source: The string to be converted
ja: 変換される文字列
ko: 변환 할 문자열
ru: Строка,которая будет преобразована

source: The string to be formatted
ja: フォーマットされる文字列
ko: 형식화 할 문자열
ru: Строка для форматирования

source: The string to convert.
ja: 変換する文字列。
ko: 변환 할 문자열입니다.
ru: Строка для преобразования.

source: The string to encode.
ja: エンコードする文字列。
ko: 인코딩 할 문자열입니다.
ru: Строка для кодирования.

source: The string to humanize
ja: 人間化するための文字列
ko: 인간화 할 줄
ru: Строка для гуманизации

source: The string to measure
ja: 測定する文字列
ko: 측정 할 문자열
ru: Струна для измерения

source: The string to print
ja: 印刷する文字列
ko: 인쇄 할 문자열
ru: Строка для печати

source: The string to truncate
ja: 切り捨てる文字列
ko: 자를 문자열
ru: Строка для усечения

source: The string to truncate.
ja: 切り捨てる文字列。
ko: 자를 문자열입니다.
ru: Строка для усечения.

source: The string with placeholders to be be substituted or an anonymous function that returns the trace line string.
ja: 置換されるプレースホルダ付きの文字列、またはトレースラインの文字列を返す匿名関数。
ko: 대체 할 자리 표시자가있는 문자열 또는 추적 행 문자열을 반환하는 익명 함수입니다.
ru: Строка с подставляемыми плейсхолдерами или анонимная функция,возвращающая строку трассы.

source: The string with placeholders to be be substituted or an anonymous function that returns the trace line string. The placeholders are {file}, {line} and {text} and the string should be as follows:
ja: 置換するプレースホルダを持つ文字列、またはトレースラインの文字列を返す匿名関数を指定します。プレースホルダーは{file},{line},{text}で、文字列は以下のようにします。
ko: 대체 할 자리 표시자가있는 문자열 또는 추적 행 문자열을 반환하는 익명 함수입니다. 자리 표시자는 {file}, {line} 및 {text}이며 문자열은 다음과 같아야합니다.
ru: Строка с подставляемыми плейсхолдерами или анонимная функция,возвращающая строку трассы.Месторасположениями являются {файл},{строка}и {текст},а строка должна быть следующей:
