Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/yii/yii.*.022.xlf
Languages: ja, ko, ru

source: The value being compared with can be another attribute value (specified via <a href="yii-validators-comparevalidator#%24compareAttribute-detail">$compareAttribute</a>) or a constant (specified via <a href="yii-validators-comparevalidator#%24compareValue-detail">$compareValue</a>. When both are specified, the latter takes precedence. If neither is specified, the attribute will be compared with another attribute whose name is by appending "_repeat" to the source attribute name.
ja: 比較される値は、別の属性値（<a href="yii-validators-comparevalidator#%24compareAttribute-detail">$ compareAttribute</a>を介して指定）または定数（<a href="yii-validators-comparevalidator#%24compareValue-detail">$ compareValue</a>を介して指定）のいずれかです。両方が指定されている場合は、後者が優先されます。どちらも指定されていない場合、属性は名前が別の属性と比較されますソース属性名に「_repeat」を追加することによります。
ko: 비교할 값은 다른 속성 값 ( <a href="yii-validators-comparevalidator#%24compareAttribute-detail">$ compareAttribute</a> 를 통해 지정됨 ) 또는 상수 ( <a href="yii-validators-comparevalidator#%24compareValue-detail">$ compareValue</a> 를 통해 지정됨) 일 수 있습니다. 둘 다 지정되면 후자가 우선합니다. 둘 중 하나를 지정하지 않으면 특성이 이름이 다른 속성과 비교됩니다. 소스 속성 이름에 "_repeat"를 추가하는 것입니다.
ru: Сравниваемое значение может быть другим значением атрибута (указанным с помощью <a href="yii-validators-comparevalidator#%24compareAttribute-detail">$ compareAttribute</a> ) или константой (указанным с помощью <a href="yii-validators-comparevalidator#%24compareValue-detail">$ compareValue</a> . Когда оба указаны, последнее имеет приоритет. Если ни один из них не указан, атрибут будет сравниваться с другим атрибутом, имя которого заключается в добавлении &laquo;_repeat&raquo; к имени исходного атрибута.

source: The value for the primary key of the next new row inserted. If this is not set, the next new row's primary key will have a value 1.
ja: 次に挿入される新しい行の主キーの値。これが設定されていない場合、次の新しい行の主キーの値は1になります。
ko: 삽입 된 다음 새 행의 기본 키 값입니다. 설정하지 않으면 다음 새 행의 기본 키 값이 1이됩니다.
ru: Значение для первичного ключа следующей новой вставленной строки.Если это не установлено,то первичный ключ следующей новой строки будет иметь значение 1.

source: The value indicating whether cookies should be used to store session IDs.
ja: セッションIDを保存するためにクッキーを使用するかどうかを示す値。
ko: 쿠키를 사용하여 세션 ID를 저장해야하는지 여부를 나타내는 값입니다.
ru: Значение,указывающее,следует ли использовать куки-файлы для хранения идентификаторов сессий.

source: The value indicating whether the current request is made via command line
ja: 現在のリクエストがコマンドライン経由で行われているかどうかを示す値
ko: 현재 요청이 명령 행을 통해 이루어 졌는지 여부를 나타내는 값
ru: Значение,указывающее,осуществляется ли текущий запрос через командную строку.

source: The value indicating whether the current request is made via console
ja: 現在のリクエストがコンソール経由で行われているかどうかを示す値
ko: 현재 요청이 콘솔을 통해 이루어 졌는지 여부를 나타내는 값
ru: Значение,указывающее,осуществляется ли текущий запрос через консоль.

source: The value is always formatted according to the locale you are translating to i.e. you cannot change decimal or thousands separators, currency symbol etc. without changing translation locale. If you need to customize these you can use <a href="yii-i18n-formatter#asDecimal()-detail">yii\i18n\Formatter::asDecimal()</a> and <a href="yii-i18n-formatter#asCurrency()-detail">yii\i18n\Formatter::asCurrency()</a>.
ja: 値は常に、翻訳先のロケールに従ってフォーマットされます。つまり、翻訳ロケールを変更しないと、小数点や3桁の区切り記号、通貨記号などを変更できません。これらをカスタマイズする必要がある場合は、<a href="yii-i18n-formatter#asDecimal()-detail">yii \ i18n \ Formatter :: asDecimal（）</a>および<a href="yii-i18n-formatter#asCurrency()-detail">yii \ i18n \ Formatter :: asCurrency（）を使用でき</a>ます。
ko: 값은 항상 번역하려는 로캘에 따라 형식이 지정됩니다. 즉, 번역 로캘을 변경하지 않으면 10 진수 또는 수천 구분 기호, 통화 기호 등을 변경할 수 없습니다. 이를 사용자 정의해야하는 경우 <a href="yii-i18n-formatter#asDecimal()-detail">yii \ i18n \ Formatter :: asDecimal ()</a> 및 yii <a href="yii-i18n-formatter#asCurrency()-detail">\ i18n \ Formatter :: asCurrency ()를 사용할 수</a> 있습니다.
ru: Значение всегда форматируется в соответствии с локалью, на которую вы переводите, т.е. вы не можете изменить десятичный разделитель или разделитель тысяч, символ валюты и т. Д. Без изменения языкового стандарта перевода. Если вам нужно настроить их, вы можете использовать <a href="yii-i18n-formatter#asDecimal()-detail">yii \ i18n \ Formatter :: asDecimal ()</a> и <a href="yii-i18n-formatter#asCurrency()-detail">yii \ i18n \ Formatter :: asCurrency ()</a> .

source: The value is considered "empty", if one of the following conditions is satisfied:
ja: 以下の条件のいずれかが満たされた場合、値は "空 "とみなされます。
ko: 다음 조건 중 하나가 충족되면이 값은 "빈"것으로 간주됩니다.
ru: Значение считается "пустым",если выполняется одно из следующих условий:

source: The value must be a valid time zone identifier, e.g. <code>UTC</code>, <code>Europe/Berlin</code> or <code>America/Chicago</code>. Please refer to the <a href="http://www.php.net/manual/en/timezones.php">php manual</a> for available time zones.
ja: 値は有効なタイムゾーン識別子である必要があります（例： <code>UTC</code> 、 <code>Europe/Berlin</code> または <code>America/Chicago</code> )。利用可能なタイムゾーンについては、<a href="http://www.php.net/manual/en/timezones.php">phpのマニュアル</a>を参照してください。
ko: 값은 유효한 시간대 식별자 (예 : <code>UTC</code> , <code>Europe/Berlin</code> 또는 <code>America/Chicago</code> ) 여야합니다 . <a href="http://www.php.net/manual/en/timezones.php">사용</a> 가능한 시간대 는 PHP 설명서 를 참조하십시오 .
ru: Значение должно быть действительным идентификатором часового пояса, например <code>UTC</code> , <code>Europe/Berlin</code> или <code>America/Chicago</code> . Пожалуйста, обратитесь к <a href="http://www.php.net/manual/en/timezones.php">руководству</a> по php, чтобы узнать о доступных часовых поясах.

source: The value of the <a href="yii-data-sort#%24sortParam-detail">$sortParam</a>.
ja: <a href="yii-data-sort#%24sortParam-detail">$ sortParam</a>の値。
ko: <a href="yii-data-sort#%24sortParam-detail">$ sortParam</a> 의 값입니다 .
ru: Значение <a href="yii-data-sort#%24sortParam-detail">$ sortParam</a> .

source: The value of the <code>Cache-Control</code> HTTP header.
ja: <code>Cache-Control</code> HTTPヘッダーの値。
ko: <code>Cache-Control</code> HTTP 헤더 의 값입니다 .
ru: Значение HTTP-заголовка <code>Cache-Control</code> .

source: The value of the <code>Cache-Control</code> HTTP header. If null, the header will not be sent.
ja: <code>Cache-Control</code> HTTPヘッダーの値。nullの場合、ヘッダーは送信されません。
ko: <code>Cache-Control</code> HTTP 헤더 의 값입니다 . null의 경우, 헤더는 송신되지 않습니다.
ru: Значение HTTP-заголовка <code>Cache-Control</code> . Если null, заголовок не будет отправлен.

source: The value of the cookie. If the value property is null, an empty string will be returned.
ja: クッキーの値。valueプロパティがnullの場合、空の文字列が返されます。
ko: 쿠키의 가치. value 속성이 null이면 빈 문자열이 반환됩니다.
ru: Ценность печенья.Если свойство value равно нулю,то будет возвращена пустая строка.

source: The value of the element if found, default value otherwise
ja: 見つかった場合の要素の値、そうでない場合のデフォルト値
ko: 발견 된 경우 요소의 값, 그렇지 않은 경우 기본값
ru: Значение элемента если найдено,значение по умолчанию иначе

source: The value of the first column in the first row of the query result. <code>false</code> is returned if the query result is empty.
ja: クエリ結果の最初の行の最初の列の値。クエリ結果が空の場合は <code>false</code> が返されます。
ko: 쿼리 결과의 첫 번째 행에있는 첫 번째 열의 값입니다. 쿼리 결과가 비어 있으면 <code>false</code> 가 반환됩니다.
ru: Значение первого столбца в первой строке результата запроса. <code>false</code> возвращается, если результат запроса пуст.

source: The value of the first column in the first row of the query result. False is returned if the query result is empty.
ja: クエリ結果の最初の行の最初のカラムの値。クエリ結果が空の場合はFalseを返します。
ko: 쿼리 결과의 첫 번째 행에있는 첫 번째 열의 값입니다. 쿼리 결과가 비어 있으면 False가 반환됩니다.
ru: Значение первого столбца в первой строке результата запроса.Ложное возвращается,если результат запроса пуст.

source: The value of the first column in the first row of the query result. False is returned if there is no value.
ja: クエリ結果の最初の行の最初の列の値。値がない場合はFalseを返します。
ko: 쿼리 결과의 첫 번째 행에있는 첫 번째 열의 값입니다. 값이 없으면 False가 반환됩니다.
ru: Значение первого столбца в первой строке результата запроса.Ложное возвращается при отсутствии значения.

source: The value of the header
ja: ヘッダの値
ko: 헤더 값
ru: Значение заголовка

source: The value of the named cookie.
ja: 指定されたクッキーの値。
ko: 명명 된 쿠키의 값입니다.
ru: Значение названного печенья.

source: The value of the removed header. Null is returned if the header does not exist.
ja: 削除されたヘッダの値。ヘッダが存在しない場合はNullが返されます。
ko: 제거 된 헤더의 값입니다. 헤더가 존재하지 않으면 널이 리턴됩니다.
ru: Значение удаленного заголовка.Нуль возвращается,если заголовок не существует.

source: The value of the sort variable
ja: ソート変数
ko: 정렬 변수의 값
ru: Значение переменной сортировки

source: The value of the specified attribute in the first record of the query result. Null is returned if the query result is empty or the field does not exist.
ja: クエリ結果の最初のレコードにある指定された属性の値。クエリ結果が空であるか、フィールドが存在しない場合はNullが返されます。
ko: 쿼리 결과의 첫 번째 레코드에서 지정된 속성의 값입니다. 조회 결과가 비어 있거나 필드가 없으면 널이 리턴됩니다.
ru: Значение указанного атрибута в первой записи результата запроса.Нуль возвращается,если результат запроса пуст или поле не существует.

source: The value of the specified attribute in the first record of the query result. Null is returned if the query result is empty.
ja: クエリ結果の最初のレコードにある指定された属性の値。クエリ結果が空の場合はNullを返します。
ko: 쿼리 결과의 첫 번째 레코드에서 지정된 속성의 값입니다. 쿼리 결과가 비어 있으면 Null이 반환됩니다.
ru: Значение указанного атрибута в первой записи результата запроса.Возвращается нуль,если результат запроса пуст.

source: The value of this property determines various <a href="guide-tutorial-i18n">internationalization</a> aspects, including message translation, date formatting, number formatting, etc. For example, the <a href="yii-jui-datepicker">yii\jui\DatePicker</a> widget will use this property value by default to determine in which language the calendar should be displayed and how the date should be formatted.
ja: このプロパティの値は、メッセージの翻訳、日付のフォーマット、数値のフォーマットなど、さまざまな<a href="guide-tutorial-i18n">国際化の</a>側面を決定します。たとえば、<a href="yii-jui-datepicker">yii \ jui \ DatePicker</a>ウィジェットはデフォルトでこのプロパティの値を使用して、カレンダーを表示する言語を決定します。日付のフォーマット方法。
ko: 이 특성의 값은 메시지 번역, 날짜 형식, 숫자 형식 등을 포함하여 다양한 <a href="guide-tutorial-i18n">국제화</a> 측면을 결정합니다 . 예를 들어, <a href="yii-jui-datepicker">yii \ jui \ DatePicker</a> 위젯은 기본적으로이 특성 값을 사용하여 달력을 표시 할 언어를 결정합니다. 날짜 형식을 지정하는 방법
ru: Значение этого свойства определяет различные аспекты <a href="guide-tutorial-i18n">интернационализации</a> , включая перевод сообщений, форматирование даты, форматирование чисел и т. Д. Например, виджет <a href="yii-jui-datepicker">yii \ jui \ DatePicker</a> будет использовать это значение свойства по умолчанию, чтобы определить, на каком языке должен отображаться календарь и как должна быть отформатирована дата.

source: The value of this property will be merged recursively with the <code>$options</code> parameter passed to <a href="yii-widgets-activeform#field()-detail">field()</a>.
ja: このプロパティの値は、<a href="yii-widgets-activeform#field()-detail">field（）に</a>渡された <code>$options</code> パラメータと再帰的にマージされます。
ko: 이 속성의 값은 <a href="yii-widgets-activeform#field()-detail">field ()에</a> 전달 된 <code>$options</code> 매개 변수 와 함께 재귀 적으로 병합됩니다 .
ru: Значение этого свойства будет рекурсивно объединено с параметром <code>$options</code> переданным в <a href="yii-widgets-activeform#field()-detail">field ()</a> .

source: The value representing false status.
ja: 偽の状態を表す値。
ko: 거짓 상태를 나타내는 값입니다.
ru: Значение,представляющее ложное состояние.

source: The value representing false status. Defaults to '0'.
ja: 偽の状態を表す値。デフォルトは '0' です。
ko: 거짓 상태를 나타내는 값입니다. 기본값은 '0'입니다.
ru: Значение,представляющее ложное состояние.По умолчанию '0'.

source: The value representing true status.
ja: 真のステータスを表す値。
ko: 실제 상태를 나타내는 값입니다.
ru: Значение,представляющее истинный статус.

source: The value representing true status. Defaults to '1'.
ja: 真のステータスを表す値。デフォルトは '1' です。
ko: 실제 상태를 나타내는 값입니다. 기본값은 '1'입니다.
ru: Значение,представляющее истинный статус.По умолчанию '1'.

source: The value returned will be the first column in the first row of the query results.
ja: 返される値は、クエリ結果の最初の行の最初のカラムになります。
ko: 반환 된 값은 쿼리 결과의 첫 번째 행에서 첫 번째 열입니다.
ru: Возвращаемое значение будет первым столбцом в первой строке результатов запроса.

source: The value returned will be the first column in the first row of the query results. Column <code>_id</code> will be automatically excluded from select fields, if <a href="yii-mongodb-query#select()-detail">select()</a> is not empty and <code>_id</code> is not selected explicitly.
ja: 返される値は、クエリ結果の最初の行の最初の列になります。<a href="yii-mongodb-query#select()-detail">select（）</a>が空でなく、 <code>_id</code> が明示的に選択されていない場合、列 <code>_id</code> は選択フィールドから自動的に除外されます。
ko: 반환 된 값은 쿼리 결과의 첫 번째 행에서 첫 번째 열입니다. <a href="yii-mongodb-query#select()-detail">select ()</a> 가 비어 있지 않고 <code>_id</code> 가 명시 적으로 선택 되지 않은 경우 열 <code>_id</code> 는 선택 필드에서 자동으로 제외됩니다 .
ru: Возвращаемое значение будет первым столбцом в первой строке результатов запроса. Столбец <code>_id</code> будет автоматически исключен из полей выбора, если <a href="yii-mongodb-query#select()-detail">select ()</a> не пуст и <code>_id</code> не выбран явно.

source: The value returned will be the specified attribute in the first record of the query results.
ja: 返される値は、クエリ結果の最初のレコードで指定された属性になります。
ko: 반환 된 값은 쿼리 결과의 첫 번째 레코드에 지정된 속성이됩니다.
ru: Возвращаемое значение будет указанным атрибутом в первой записи результатов запроса.

source: The value returned will be the specified field in the first document of the query results.
ja: 返される値は、クエリ結果の最初のドキュメントで指定されたフィールドになります。
ko: 반환 된 값은 쿼리 결과의 첫 번째 문서에서 지정된 필드입니다.
ru: Возвращаемым значением будет указанное поле в первом документе результатов запроса.

source: The value stored in cache, false if the value is not in the cache or expired.
ja: キャッシュに保存されている値で、値がキャッシュにない場合や期限切れの場合は false。
ko: 캐시에 저장된 값으로, 값이 캐시에 없거나 만료 된 경우 false입니다.
ru: Значение,сохраненное в кэше,ложное,если значение не находится в кэше или истекло.

source: The value stored in cache, false if the value is not in the cache or expired. Most often value is a string. If you have disabled <a href="yii-caching-cache#%24serializer-detail">$serializer</a>, it could be something else.
ja: キャッシュに保存されている値。値がキャッシュにないか期限切れの場合はfalse。ほとんどの場合、値は文字列です。<a href="yii-caching-cache#%24serializer-detail">$ serializer</a>を無効にしている場合は、別の可能性があります。
ko: 캐시에 저장된 값으로, 값이 캐시에 없거나 만료 된 경우 false입니다. 대부분의 경우 값은 문자열입니다. <a href="yii-caching-cache#%24serializer-detail">$ serializer를</a> 비활성화 한 경우 다른 것일 수 있습니다.
ru: Значение, хранящееся в кеше, false, если значение отсутствует в кеше или срок его действия истек. Чаще всего значение - это строка. Если вы отключили <a href="yii-caching-cache#%24serializer-detail">сериализатор $</a> , это могло быть что-то еще.

source: The value stored in cache, false if the value is not in the cache, expired, or the dependency associated with the cached data has changed.
ja: キャッシュに格納されている値で、値がキャッシュにない場合、有効期限が切れている場合、またはキャッシュされたデータに関連付けられている依存関係が変更されている場合は、falseとなります。
ko: 캐시에 저장된 값입니다. 값이 캐시에 없거나, 만료되었거나 캐시 된 데이터와 관련된 종속성이 변경된 경우 false입니다.
ru: Значение,хранящееся в кэше,ложное,если значение не находится в кэше,истекло,или зависимость,связанная с кэшированными данными,изменилась.

source: The value that should be returned when the named cookie does not exist.
ja: 指定されたクッキーが存在しない場合に返されるべき値。
ko: 명명 된 쿠키가 없을 때 반환되어야하는 값입니다.
ru: Значение,которое должно быть возвращено,когда именованный куки-файл не существует.

source: The value that will be assigned to the current attributes.
ja: 現在の属性に割り当てられる値。
ko: 현재 속성에 할당 될 값입니다.
ru: Значение,которое будет присвоено текущим атрибутам.

source: The value that will be assigned to the current attributes. This can be an anonymous function, callable in array format (e.g. <code>[$this, 'methodName']</code>), an <a href="yii-db-expression">Expression</a> object representing a DB expression (e.g. <code>new Expression('NOW()')</code>), scalar, string or an arbitrary value. If the former, the return value of the function will be assigned to the attributes. The signature of the function should be as follows,
ja: 現在の属性に割り当てられる値。これは、配列形式で呼び出すことができる無名関数（ <code>[$this, 'methodName']</code> ）、DB式を表す<a href="yii-db-expression">Expression</a>オブジェクト（例： <code>new Expression('NOW()')</code> ）、スカラー、文字列、または任意の値にすることができます。前者の場合、関数の戻り値が属性に割り当てられます。関数のシグネチャは次のようになります。
ko: 현재 속성에 할당 될 값입니다. 이것은 배열 형식 (예 : <code>[$this, 'methodName']</code> ), DB 표현식 (예 : <code>new Expression('NOW()')</code> )을 나타내는 <a href="yii-db-expression">Expression</a> 객체 , 스칼라, 문자열 또는 임의의 값 으로 호출 할 수있는 익명 함수일 수 있습니다. . 전자의 경우, 함수의 반환 값이 속성에 할당됩니다. 기능의 서명은 다음과 같아야합니다.
ru: Значение, которое будет присвоено текущим атрибутам. Это может быть анонимная функция, вызываемая в формате массива (например, <code>[$this, 'methodName']</code> ), объект <a href="yii-db-expression">Expression,</a> представляющий выражение DB (например, <code>new Expression('NOW()')</code> ), скаляр, строка или произвольное значение . В первом случае возвращаемое значение функции будет присвоено атрибутам. Сигнатура функции должна быть следующей:

source: The value that will be used as a slug.
ja: スラッグとして使用される値。
ko: 슬러그로 사용될 값입니다.
ru: Значение,которое будет использоваться как слизняк.

source: The value that will be used as a slug. This can be an anonymous function or an arbitrary value or null. If the former, the return value of the function will be used as a slug. If <code>null</code> then the <code>$attribute</code> property will be used to generate a slug. The signature of the function should be as follows,
ja: スラグとして使用される値。これは、無名関数、任意の値、またはnullにすることができます。前者の場合、関数の戻り値はスラッグとして使用されます。場合は <code>null</code> が、その後 <code>$attribute</code> プロパティは、スラグを生成するために使用されます。関数のシグネチャは次のようになります。
ko: 슬러그로 사용될 값입니다. 익명 함수이거나 임의의 값이거나 null 일 수 있습니다. 전자의 경우 함수의 반환 값이 슬러그로 사용됩니다. 경우 <code>null</code> 다음 <code>$attribute</code> 속성은 슬러그을 생성하는 데 사용됩니다. 기능의 서명은 다음과 같아야합니다.
ru: Значение, которое будет использоваться в качестве пули. Это может быть анонимная функция, произвольное значение или null. В первом случае возвращаемое значение функции будет использоваться в качестве заголовка. Если значение <code>null</code> , то свойство <code>$attribute</code> будет использоваться для создания заголовка. Сигнатура функции должна быть следующей:

source: The value to be cached
ja: キャッシュされる値
ko: 캐시 될 값
ru: Значение,которое необходимо кэшировать

source: The value to be cached.
ja: キャッシュされる値。
ko: 캐시 할 값입니다.
ru: Значение,которое нужно кэшировать.

source: The value to be cached. Most often it's a string. If you have disabled <a href="yii-caching-cache#%24serializer-detail">$serializer</a>, it could be something else.
ja: キャッシュする値。ほとんどの場合、それは文字列です。<a href="yii-caching-cache#%24serializer-detail">$ serializer</a>を無効にしている場合は、別の可能性があります。
ko: 캐시 할 값입니다. 대부분 문자열입니다. <a href="yii-caching-cache#%24serializer-detail">$ serializer를</a> 비활성화 한 경우 다른 것일 수 있습니다.
ru: Значение для кеширования. Чаще всего это строка. Если вы отключили <a href="yii-caching-cache#%24serializer-detail">сериализатор $</a> , это могло быть что-то еще.

source: The value to be cached. Other types (If you have disabled <a href="yii-caching-cache#%24serializer-detail">$serializer</a>) unable to get is correct in <a href="yii-caching-filecache#getValue()-detail">getValue()</a>.
ja: キャッシュする値。<a href="yii-caching-filecache#getValue()-detail">getValue（）</a>では、他のタイプ（<a href="yii-caching-cache#%24serializer-detail">$ serializer</a>を無効にしている場合）を取得できないことが正しいです。
ko: 캐시 할 값입니다. <a href="yii-caching-filecache#getValue()-detail">getValue ()</a> 에서 얻을 수없는 다른 유형 ( <a href="yii-caching-cache#%24serializer-detail">$ serializer를</a> 비활성화 한 경우 )이 올바른 것입니다 .
ru: Значение для кеширования. Другие типы (если вы отключили <a href="yii-caching-cache#%24serializer-detail">сериализатор $</a> ), которые невозможно получить, являются правильными в <a href="yii-caching-filecache#getValue()-detail">getValue ()</a> .

source: The value to be cached. Other types (if you have disabled <a href="yii-caching-cache#%24serializer-detail">$serializer</a>) cannot be saved.
ja: キャッシュする値。他のタイプ（<a href="yii-caching-cache#%24serializer-detail">$ serializer</a>を無効にしている場合）は保存できません。
ko: 캐시 할 값입니다. 다른 유형 ( <a href="yii-caching-cache#%24serializer-detail">$ serializer를</a> 비활성화 한 경우 )은 저장할 수 없습니다.
ru: Значение для кеширования. Другие типы (если вы отключили <a href="yii-caching-cache#%24serializer-detail">$ serializer</a> ) не могут быть сохранены.

source: The value to be cached. Other types (if you have disabled <a href="yii-caching-cache#%24serializer-detail">$serializer</a>) unable to get is correct in <a href="yii-caching-filecache#getValue()-detail">getValue()</a>.
ja: キャッシュする値。<a href="yii-caching-filecache#getValue()-detail">getValue（）</a>では、他のタイプ（<a href="yii-caching-cache#%24serializer-detail">$ serializer</a>を無効にしている場合）を取得できない場合は正しいです。
ko: 캐시 할 값입니다. <a href="yii-caching-filecache#getValue()-detail">getValue ()</a> 에서 얻을 수없는 다른 유형 ( <a href="yii-caching-cache#%24serializer-detail">$ serializer를</a> 비활성화 한 경우 )이 올바른 것입니다 .
ru: Значение для кеширования. Другие типы (если вы отключили <a href="yii-caching-cache#%24serializer-detail">сериализатор $</a> ), которые невозможно получить, верны в <a href="yii-caching-filecache#getValue()-detail">getValue ()</a> .

source: The value to be checked
ja: チェックする値
ko: 확인할 값
ru: Значение,которое необходимо проверить

source: The value to be formatted
ja: フォーマットされる値
ko: 형식화 할 값
ru: Значение для форматирования

source: The value to be formatted.
ja: フォーマットされる値。
ko: 형식화 할 값입니다.
ru: Значение для форматирования.

source: The value to be formatted. Acceptable formats:
ja: フォーマットされる値。使用可能なフォーマット。
ko: 형식화 할 값입니다. 허용되는 형식 :
ru: Значение для форматирования.Приемлемые форматы:

source: The value to be formatted. It must be a factor e.g. <code>0.75</code> will result in <code>75%</code>.
ja: フォーマットする値。これは係数でなければなりません。たとえば、 <code>0.75</code> は <code>75%</code> になります。
ko: 형식화 할 값입니다. 그것은 예를 들면 요인이 될 수 있어야합니다 <code>0.75</code> 을 발생합니다 <code>75%</code> .
ru: Форматируемое значение. Это должен быть коэффициент, например <code>0.75</code> приведет к <code>75%</code> .

source: The value to be formatted. The following types of value are supported:
ja: フォーマットされる値。以下のタイプの値がサポートされています。
ko: 형식화 할 값입니다. 다음과 같은 유형의 값이 지원됩니다.
ru: Значение для форматирования.Поддерживаются следующие типы значений:

source: The value to be returned when the specified parameter does not exist in <a href="yii-data-pagination#%24params-detail">$params</a>.
ja: 指定されたパラメーターが<a href="yii-data-pagination#%24params-detail">$ paramsに</a>存在しない場合に返される値。
ko: 지정된 매개 변수가 <a href="yii-data-pagination#%24params-detail">$ params에</a> 없을 때 리턴되는 값 입니다.
ru: Значение, которое будет возвращено, если указанный параметр не существует в <a href="yii-data-pagination#%24params-detail">$ params</a> .

source: The value to bind to the parameter
ja: パラメータにバインドする値
ko: 매개 변수에 바인드 할 값
ru: Значение для привязки к параметру

source: The value to look for.
ja: 探すべき値。
ko: 찾을 값입니다.
ru: Ценность,которую нужно искать.

source: The value to remove from the array
ja: 配列から削除する値
ko: 배열에서 제거 할 값
ru: Значение для удаления из массива

source: The value to return in case the named header does not exist
ja: 名前付きヘッダが存在しない場合に返す値。
ko: 명명 된 헤더가없는 경우 반환 할 값
ru: Значение,которое нужно вернуть в случае,если именованный заголовок не существует.

source: The value will be purified using <a href="yii-helpers-htmlpurifier">yii\helpers\HtmlPurifier</a> to avoid XSS attacks. Use <a href="yii-i18n-formatter#asRaw()-detail">asRaw()</a> if you do not want any purification of the value.
ja: 値は、XSS攻撃を回避するために<a href="yii-helpers-htmlpurifier">yii \ helpers \ HtmlPurifier</a>を使用して浄化されます。値の精製が必要ない場合は、<a href="yii-i18n-formatter#asRaw()-detail">asRaw（）を</a>使用してください。
ko: XSS 공격을 피하기 위해 <a href="yii-helpers-htmlpurifier">yii \ helpers \ HtmlPurifier</a> 를 사용하여 값을 정리 합니다. 값을 정제하지 않으려면 <a href="yii-i18n-formatter#asRaw()-detail">asRaw ()를</a> 사용하십시오 .
ru: Значение будет очищено с помощью <a href="yii-helpers-htmlpurifier">yii \ helpers \ HtmlPurifier,</a> чтобы избежать атак XSS. Используйте <a href="yii-i18n-formatter#asRaw()-detail">asRaw (),</a> если вы не хотите очищать значение.
