Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/yii/yii.*.022.xlf
Languages: ja, ko, ru

source: The testing process could be automated so that each time when we need to verify something, we just need to call up the code that does it for us. The code that verifies the result matches what we've planned is called <em>test</em> and the process of its creation and further execution is known as <em>automated testing</em>, which is the main topic of these testing chapters.
ja: テストプロセスを自動化して、何かを検証する必要があるたびに、それを実行するコードを呼び出すだけで済みます。結果が我々が計画したものと一致することを検証するコードは<em>テスト</em>と呼ばれ、その作成とその後の実行のプロセスは<em>自動テスト</em>と呼ばれ、これらのテストの章のメイントピックです。
ko: 테스트 프로세스를 자동화하여 무언가를 확인해야 할 때마다 코드를 호출하기 만하면됩니다. 결과를 확인하는 코드는 우리가 계획 한 <em>테스트</em> 와 일치하며 <em>테스트</em> 및 생성 및 추가 프로세스는 <em>자동화 테스트</em> 라고하며 ,이 테스트 장의 주요 주제입니다.
ru: Процесс тестирования можно автоматизировать, чтобы каждый раз, когда нам нужно что-то проверить, нам просто нужно было вызывать код, который делает это за нас. Код, который проверяет соответствие результата тому, что мы запланировали, называется <em>тестом,</em> а процесс его создания и дальнейшего выполнения известен как <em>автоматическое тестирование</em> , которое является основной темой этих глав о тестировании.

source: The text be generated
ja: テキストが生成される
ko: 텍스트가 생성됩니다
ru: Генерируемый текст

source: The text display of the level
ja: レベルのテキスト表示
ko: 레벨의 텍스트 표시
ru: Текстовое отображение уровня

source: The text label for the "first" page button.
ja: 最初の」ページボタンのテキストラベル。
ko: "첫 번째"페이지 버튼의 텍스트 레이블입니다.
ru: Текстовая наклейка для кнопки "первая" страница.

source: The text label for the "first" page button. Note that this will NOT be HTML-encoded. If it's specified as true, page number will be used as label. Default is false that means the "first" page button will not be displayed.
ja: 最初の "ページボタンのテキストラベル。これはHTMLエンコードされていないことに注意してください。true を指定した場合、ページ番号がラベルとして使用されます。デフォルトはfalseで、"最初の "ページボタンは表示されません。
ko: "첫 번째"페이지 버튼의 텍스트 레이블입니다. 이것은 HTML로 인코딩되지 않습니다. true로 지정하면 페이지 번호가 레이블로 사용됩니다. 기본값은 false이며 "첫 번째"페이지 단추가 표시되지 않음을 의미합니다.
ru: Текстовая наклейка для кнопки "первая" страница.Обратите внимание,что это НЕ будет HTML-кодировка.Если он указан как истинный,номер страницы будет использоваться в качестве этикетки.По умолчанию является ложным,что означает,что "первая" кнопка страницы не будет отображаться.

source: The text label for the "last" page button.
ja: 最後の」ページボタンのテキストラベル。
ko: "마지막"페이지 버튼의 텍스트 레이블.
ru: Текстовый ярлык для кнопки "последняя" страница.

source: The text label for the "last" page button. Note that this will NOT be HTML-encoded. If it's specified as true, page number will be used as label. Default is false that means the "last" page button will not be displayed.
ja: 最後の "ページボタンのテキストラベル。これはHTMLエンコードされないことに注意してください。true を指定した場合、ページ番号がラベルとして使用されます。デフォルトはfalseで、「最後の」ページボタンは表示されません。
ko: "마지막"페이지 버튼의 텍스트 레이블. 이것은 HTML로 인코딩되지 않습니다. true로 지정하면 페이지 번호가 레이블로 사용됩니다. 기본값은 "마지막"페이지 버튼이 표시되지 않음을 나타내는 false입니다.
ru: Текстовый ярлык для кнопки "последняя" страница.Обратите внимание,что это НЕ будет HTML-кодировка.Если он указан как истинный,номер страницы будет использоваться в качестве этикетки.По умолчанию является ложным,что означает,что "последняя" кнопка страницы не будет отображаться.

source: The text label for the button
ja: ボタンのテキストラベル
ko: 버튼의 텍스트 레이블
ru: Текстовая наклейка для кнопки

source: The text label for the previous page button.
ja: 前のページボタンのテキストラベル。
ko: 이전 페이지 버튼의 텍스트 레이블입니다.
ru: Текстовый ярлык для кнопки предыдущей страницы.

source: The text label for the previous page button. Note that this will NOT be HTML-encoded. If this property is false, the "previous" page button will not be displayed.
ja: 前のページボタンのテキストラベル。これはHTMLエンコードされないことに注意してください。このプロパティがfalseの場合、"前 "ページボタンは表示されません。
ko: 이전 페이지 버튼의 텍스트 레이블입니다. 이것은 HTML로 인코딩되지 않습니다. 이 속성이 false이면 "이전"페이지 버튼이 표시되지 않습니다.
ru: Текстовый ярлык для кнопки предыдущей страницы.Обратите внимание,что это НЕ будет HTML-кодировка.Если это свойство является ложным,кнопка "предыдущая" страница не будет отображаться.

source: The text of the brand or false if it's not used.
ja: ブランドのテキストか、使われていない場合はfalse。
ko: 브랜드의 텍스트이거나 사용하지 않으면 false입니다.
ru: Текст марки или фальшивый,если он не используется.

source: The text of the brand or false if it's not used. Note that this is not HTML-encoded.
ja: ブランドのテキスト、または使用されていない場合はfalse。これはHTMLエンコードされていないことに注意してください。
ko: 브랜드의 텍스트이거나 사용하지 않으면 false입니다. 이것은 HTML 인코딩이 아닙니다.
ru: Текст марки или фальшивый,если он не используется.Обратите внимание,что это не HTML-кодировка.

source: The text of the comment to be added. The comment will be properly quoted by the method.
ja: 追加するコメントのテキスト。コメントはメソッドによって適切に引用されます。
ko: 추가 할 주석의 텍스트입니다. 이 방법으로 주석이 올바르게 인용됩니다.
ru: Текст комментария,который будет добавлен.Комментарий будет правильно цитироваться методом.

source: The text to be displayed when formatting a <code>null</code> value.
ja: <code>null</code> 値をフォーマットするときに表示されるテキスト。
ko: <code>null</code> 형식화 할 때 표시되는 텍스트 입니다.
ru: Текст, который будет отображаться при форматировании <code>null</code> значения.

source: The text to be displayed when formatting a <code>null</code> value. Defaults to <code>'&lt;span class="not-set"&gt;(not set)&lt;/span&gt;'</code>, where <code>(not set)</code> will be translated according to <a href="yii-i18n-formatter#%24locale-detail">$locale</a>.
ja: <code>null</code> 値をフォーマットするときに表示されるテキスト。デフォルトは <code>'&lt;span class="not-set"&gt;(not set)&lt;/span&gt;'</code> で、 <code>(not set)</code> は<a href="yii-i18n-formatter#%24locale-detail">$ locale</a>に従って変換されます。
ko: <code>null</code> 형식화 할 때 표시되는 텍스트 입니다. 기본값은 <code>'&lt;span class="not-set"&gt;(not set)&lt;/span&gt;'</code> 이며, 여기서 <code>(not set)</code> 은 <a href="yii-i18n-formatter#%24locale-detail">$ locale</a> 에 따라 변환 됩니다 .
ru: Текст, который будет отображаться при форматировании <code>null</code> значения. По умолчанию <code>'&lt;span class="not-set"&gt;(not set)&lt;/span&gt;'</code> , где <code>(not set)</code> будет переведено в соответствии с <a href="yii-i18n-formatter#%24locale-detail">$ locale</a> .

source: The text to be displayed when formatting a boolean value.
ja: ブール値をフォーマットするときに表示されるテキスト。
ko: 부울 값을 형식화 할 때 표시 할 텍스트입니다.
ru: Текст,который будет отображаться при форматировании булевого значения.

source: The text to be displayed when formatting a boolean value. The first element corresponds to the text displayed for <code>false</code>, the second element for <code>true</code>. Defaults to <code>['No', 'Yes']</code>, where <code>Yes</code> and <code>No</code> will be translated according to <a href="yii-i18n-formatter#%24locale-detail">$locale</a>.
ja: ブール値をフォーマットするときに表示されるテキスト。最初の要素は <code>false</code> に対して表示されるテキストに対応し、2番目の要素は <code>true</code> に対して表示されます。デフォルトは <code>['No', 'Yes']</code> で、 <code>Yes</code> と <code>No</code> は<a href="yii-i18n-formatter#%24locale-detail">$ locale</a>に従って変換されます。
ko: 부울 값을 형식화 할 때 표시 할 텍스트입니다. 첫 번째 요소는 <code>false</code> 로 표시되는 텍스트에 해당 하고 두 번째 요소는 <code>true</code> 로 표시됩니다 . 기본값은 <code>['No', 'Yes']</code> . 여기서 <code>Yes</code> 및 <code>No</code> 는 <a href="yii-i18n-formatter#%24locale-detail">$ locale</a> 에 따라 변환 됩니다 .
ru: Текст, который будет отображаться при форматировании логического значения. Первый элемент соответствует тексту, отображаемому для <code>false</code> , второй элемент для <code>true</code> . По умолчанию <code>['No', 'Yes']</code> , где <code>Yes</code> и <code>No</code> будут переведены в соответствии с <a href="yii-i18n-formatter#%24locale-detail">$ locale</a> .

source: The text to be wrapped
ja: 包み込むテキスト
ko: 줄 바꿈 할 텍스트
ru: Завершаемый текст

source: The text to break down to keywords.
ja: キーワードに分解する文章。
ko: 키워드로 분류 할 텍스트입니다.
ru: Текст для разбиения на ключевые слова.

source: The text to print
ja: 印刷するテキスト
ko: 인쇄 할 텍스트
ru: Текст для печати

source: The theme object or the configuration for creating the theme object.
ja: テーマオブジェクトまたはテーマオブジェクトを作成するための設定。
ko: 테마 오브젝트 또는 테마 오브젝트 작성을위한 구성
ru: Объект темы или конфигурация для создания объекта темы.

source: The theme object or the configuration for creating the theme object. If not set, it means theming is not enabled.
ja: テーマオブジェクトまたはテーマオブジェクトを作成するための設定。設定されていない場合は、テーマが有効になっていないことを意味します。
ko: 테마 오브젝트 또는 테마 오브젝트 작성을위한 구성 설정하지 않으면 테마를 사용할 수 없습니다.
ru: Объект темы или конфигурация для создания объекта темы.Если параметр не установлен,это означает,что тематическая привязка не включена.

source: The themed file, or the original file if the themed version is not available.
ja: テーマ付きファイル、またはテーマ付きバージョンがない場合はオリジナルファイル。
ko: 테마 파일 또는 테마 버전을 사용할 수없는 경우 원본 파일
ru: Тематический файл,или оригинальный файл,если тематическая версия недоступна.

source: The threshold for determining whether the request has involved critical number of DB queries.
ja: リクエストがクリティカルな数のDBクエリを含んでいるかどうかを判断するための閾値。
ko: 요청에 중요한 수의 DB 쿼리가 포함되어 있는지 확인하기위한 임계 값입니다.
ru: Порог для определения того,был ли запрос связан с критическим количеством запросов БД.

source: The threshold for determining whether the request has involved critical number of DB queries. If the number of queries exceeds this number, the execution is considered taking critical number of DB queries.
ja: リクエストにクリティカル数のDBクエリが含まれているかどうかを判断するための閾値。クエリ数がこの数を超えた場合、実行はDBクエリのクリティカル数を取っていると判断されます。
ko: 요청에 중요한 수의 DB 쿼리가 포함되어 있는지 확인하기위한 임계 값입니다. 쿼리 수가이 수를 초과하면 중요한 DB 쿼리를 수행하는 것으로 간주됩니다.
ru: Порог для определения того,был ли запрос связан с критическим количеством запросов БД.Если количество запросов превышает это число,то считается,что выполнение выполняется с критическим количеством запросов к БД.

source: The time in seconds that the messages can remain valid in cache.
ja: メッセージがキャッシュ内で有効になるまでの時間を秒単位で指定します。
ko: 메시지가 캐시에서 유효한 상태를 유지할 수있는 시간 (초)입니다.
ru: Время в секундах,в течение которого сообщения могут оставаться действительными в кэше.

source: The time in seconds that the messages can remain valid in cache. Use 0 to indicate that the cached data will never expire.
ja: メッセージがキャッシュ内で有効な状態を維持できる時間を秒単位で指定します。0 を使用すると、キャッシュされたデータが有効期限切れにならないことを示します。
ko: 메시지가 캐시에서 유효한 상태를 유지할 수있는 시간 (초)입니다. 캐시 된 데이터가 만료되지 않음을 나타내려면 0을 사용하십시오.
ru: Время в секундах,в течение которого сообщения могут оставаться действительными в кэше.Используйте 0,чтобы указать,что срок действия кэшированных данных никогда не истечет.

source: The time zone that is assumed for input values if they do not include a time zone explicitly.
ja: 入力値に明示的にタイムゾーンが含まれていない場合に想定されるタイムゾーン。
ko: 명시 적으로 시간대를 포함하지 않는 경우 입력 값으로 가정되는 시간대.
ru: Часовой пояс,который принимается за входные значения,если в них явно не указан часовой пояс.

source: The time zone to use for formatting time and date values.
ja: 時間と日付の値をフォーマットする際に使用するタイムゾーン。
ko: 시간 및 날짜 값을 형식화하는 데 사용할 시간대입니다.
ru: Часовой пояс,который следует использовать для форматирования значений времени и даты.

source: The time zone used by this application.
ja: このアプリケーションで使用されているタイムゾーンです。
ko: 이 응용 프로그램에서 사용하는 시간대.
ru: Часовой пояс,используемый этим приложением.

source: The timestamp at which the cookie expires.
ja: クッキーの有効期限が切れるタイムスタンプ。
ko: 쿠키가 만료되는 타임 스탬프입니다.
ru: Штемпель времени,когда истекает срок годности печенья.

source: The timestamp at which the cookie expires. This is the server timestamp. Defaults to 0, meaning "until the browser is closed".
ja: クッキーの有効期限が切れるタイムスタンプです。これはサーバーのタイムスタンプです。デフォルトは0で、「ブラウザが閉じるまで」を意味します。
ko: 쿠키가 만료되는 타임 스탬프입니다. 서버 타임 스탬프입니다. "브라우저가 닫힐 때까지"를 의미하는 기본값은 0입니다.
ru: Штемпель времени,когда истекает срок годности печенья.Это метка времени сервера.По умолчанию равен 0,что означает "до закрытия браузера".

source: The timestamp indexed by cache keys
ja: キャッシュキーでインデックス化されたタイムスタンプ
ko: 캐시 키로 인덱스 된 타임 스탬프
ru: Временная метка,проиндексированная ключами кэша.

source: The timestamps indexed by the specified tags.
ja: 指定されたタグでインデックス化されたタイムスタンプ。
ko: 지정된 태그에 의해 인덱스 된 타임 스탬프.
ru: Временные метки,проиндексированные указанными тегами.

source: The timezone to use for parsing date and time values.
ja: 日付と時刻の値を解析するために使用するタイムゾーン。
ko: 날짜 및 시간 값을 구문 분석하는 데 사용할 시간대입니다.
ru: Часовой пояс,используемый для разбора значений даты и времени.

source: The timezone to use for parsing date and time values. This can be any value that may be passed to <a href="http://www.php.net/manual/en/function.date-default-timezone-set.php">date_default_timezone_set()</a> e.g. <code>UTC</code>, <code>Europe/Berlin</code> or <code>America/Chicago</code>. Refer to the <a href="http://www.php.net/manual/en/timezones.php">php manual</a> for available timezones. If this property is not set, <a href="yii-base-application#%24timeZone-detail">yii\base\Application::$timeZone</a> will be used.
ja: 日付と時刻の値の解析に使用するタイムゾーン。これは、<a href="http://www.php.net/manual/en/function.date-default-timezone-set.php">date_default_timezone_set（）に</a>渡すことができる任意の値にすることができます（例： <code>UTC</code> 、 <code>Europe/Berlin</code> または <code>America/Chicago</code> )。利用可能なタイムゾーンについては、<a href="http://www.php.net/manual/en/timezones.php">phpのマニュアル</a>を参照してください。このプロパティが設定されていない場合、<a href="yii-base-application#%24timeZone-detail">yii \ base \ Application :: $ timeZone</a>が使用されます。
ko: 날짜 및 시간 값을 구문 분석하는 데 사용할 시간대입니다. 이는 전달 될 수있는 값이 될 수 있습니다 <a href="http://www.php.net/manual/en/function.date-default-timezone-set.php">) (date_default_timezone_set</a> 예를 들어, <code>UTC</code> , <code>Europe/Berlin</code> 또는 <code>America/Chicago</code> . <a href="http://www.php.net/manual/en/timezones.php">사용</a> 가능한 시간대 는 PHP 설명서 를 참조하십시오 . 이 속성을 설정하지 않으면 <a href="yii-base-application#%24timeZone-detail">yii \ base \ Application :: $ timeZone</a> 이 사용됩니다.
ru: Часовой пояс, используемый для анализа значений даты и времени. Это может быть любое значение, которое может быть передано в <a href="http://www.php.net/manual/en/function.date-default-timezone-set.php">date_default_timezone_set (),</a> например, <code>UTC</code> , <code>Europe/Berlin</code> или <code>America/Chicago</code> . Обратитесь к <a href="http://www.php.net/manual/en/timezones.php">руководству</a> по php, чтобы узнать о доступных часовых поясах. Если это свойство не установлено, будет использоваться <a href="yii-base-application#%24timeZone-detail">yii \ base \ Application :: $ timeZone</a> .

source: The timezone to use when populating the <a href="yii-validators-datevalidator#%24timestampAttribute-detail">$timestampAttribute</a>.
ja: <a href="yii-validators-datevalidator#%24timestampAttribute-detail">$ timestampAttribute</a>に入力するときに使用するタイムゾーン。
ko: <a href="yii-validators-datevalidator#%24timestampAttribute-detail">$ timestampAttribute를 채울</a> 때 사용할 시간대 입니다.
ru: Часовой пояс, используемый при <a href="yii-validators-datevalidator#%24timestampAttribute-detail">заполнении атрибута $ timestampAttribute</a> .

source: The timezone to use when populating the <a href="yii-validators-datevalidator#%24timestampAttribute-detail">$timestampAttribute</a>. Defaults to <code>UTC</code>.
ja: <a href="yii-validators-datevalidator#%24timestampAttribute-detail">$ timestampAttribute</a>に入力するときに使用するタイムゾーン。デフォルトは <code>UTC</code> です。
ko: <a href="yii-validators-datevalidator#%24timestampAttribute-detail">$ timestampAttribute를 채울</a> 때 사용할 시간대 입니다. 기본값은 <code>UTC</code> 입니다.
ru: Часовой пояс, используемый при <a href="yii-validators-datevalidator#%24timestampAttribute-detail">заполнении атрибута $ timestampAttribute</a> . По умолчанию <code>UTC</code> .

source: The token to be looked for
ja: 探すトークン
ko: 찾을 토큰
ru: Жетон,который нужно искать

source: The token used to perform CSRF validation.
ja: CSRFの検証に使用されるトークン。
ko: CSRF 유효성 검증을 수행하는 데 사용되는 토큰.
ru: Токен,используемый для выполнения проверки CSRF.

source: The total elapsed time in seconds for current request.
ja: 現在のリクエストの総経過時間を秒単位で表示します。
ko: 현재 요청의 총 경과 시간 (초)입니다.
ru: Общее истекшее время в секундах для текущего запроса.

source: The total number of data models.
ja: データモデルの総数。
ko: 총 데이터 모델 수
ru: Общее количество моделей данных.

source: The total value of items that are to be done.
ja: 行う項目の合計値です。
ko: 수행 할 항목의 총계입니다.
ru: Общая стоимость объектов,которые должны быть сделаны.

source: The trace line
ja: トレースライン
ko: 트레이스 라인
ru: Линия трассировки

source: The trailing name component of the given path.
ja: 与えられたパスの末尾の名前のコンポーネント。
ko: 주어진 경로의 후행 이름 구성 요소.
ru: Компонент имени трейлинга данного пути.

source: The transaction initiated
ja: トランザクションが開始されました。
ko: 거래가 시작되었습니다
ru: Инициированная сделка

source: The transaction isolation level to use for this transaction.
ja: このトランザクションに使用するトランザクション分離レベル。
ko: 이 트랜잭션에 사용할 트랜잭션 격리 수준입니다.
ru: Уровень изоляции транзакции,используемый для данной транзакции.

source: The transaction isolation level to use for this transaction. This can be either <a href="yii-db-transaction#READ_UNCOMMITTED-detail">yii\db\Transaction::READ_UNCOMMITTED</a> or <a href="yii-db-transaction#SERIALIZABLE-detail">yii\db\Transaction::SERIALIZABLE</a>.
ja: このトランザクションに使用するトランザクション分離レベル。これは<a href="yii-db-transaction#READ_UNCOMMITTED-detail">yii \ db \ Transaction :: READ_UNCOMMITTED</a>または<a href="yii-db-transaction#SERIALIZABLE-detail">yii \ db \ Transaction :: SERIALIZABLEの</a>いずれかです。
ko: 이 트랜잭션에 사용할 트랜잭션 격리 수준입니다. <a href="yii-db-transaction#READ_UNCOMMITTED-detail">yii \ db \ Transaction :: READ_UNCOMMITTED</a> 또는 <a href="yii-db-transaction#SERIALIZABLE-detail">yii \ db \ Transaction :: SERIALIZABLE</a> 이 될 수 있습니다 .
ru: Уровень изоляции транзакции, используемый для этой транзакции. Это может быть <a href="yii-db-transaction#READ_UNCOMMITTED-detail">yii \ db \ Transaction :: READ_UNCOMMITTED</a> или yii <a href="yii-db-transaction#SERIALIZABLE-detail">\ db \ Transaction :: SERIALIZABLE</a> .

source: The transaction isolation level to use for this transaction. This can be one of <a href="yii-db-transaction#READ_UNCOMMITTED-detail">READ_UNCOMMITTED</a>, <a href="yii-db-transaction#READ_COMMITTED-detail">READ_COMMITTED</a>, <a href="yii-db-transaction#REPEATABLE_READ-detail">REPEATABLE_READ</a> and <a href="yii-db-transaction#SERIALIZABLE-detail">SERIALIZABLE</a> but also a string containing DBMS specific syntax to be used after <code>SET TRANSACTION ISOLATION LEVEL</code>.
ja: このトランザクションに使用するトランザクション分離レベル。これは、<a href="yii-db-transaction#READ_UNCOMMITTED-detail">READ_UNCOMMITTED</a>、<a href="yii-db-transaction#READ_COMMITTED-detail">READ_COMMITTED</a>、<a href="yii-db-transaction#REPEATABLE_READ-detail">REPEATABLE_READ</a>、および<a href="yii-db-transaction#SERIALIZABLE-detail">SERIALIZABLEのいずれかです</a>が、 <code>SET TRANSACTION ISOLATION LEVEL</code> の後に使用されるDBMS固有の構文を含む文字列にすることもできます。
ko: 이 트랜잭션에 사용할 트랜잭션 격리 수준입니다. <a href="yii-db-transaction#READ_UNCOMMITTED-detail">READ_UNCOMMITTED</a> , <a href="yii-db-transaction#READ_COMMITTED-detail">READ_COMMITTED</a> , <a href="yii-db-transaction#REPEATABLE_READ-detail">REPEATABLE_READ</a> 및 <a href="yii-db-transaction#SERIALIZABLE-detail">SERIALIZABLE</a> 중 하나 일 수 있으며 <code>SET TRANSACTION ISOLATION LEVEL</code> 이후에 사용할 DBMS 특정 구문이 포함 된 문자열 일 수도 있습니다 .
ru: Уровень изоляции транзакции, используемый для этой транзакции. Это может быть один из <a href="yii-db-transaction#READ_UNCOMMITTED-detail">READ_UNCOMMITTED</a> , <a href="yii-db-transaction#READ_COMMITTED-detail">READ_COMMITTED</a> , <a href="yii-db-transaction#REPEATABLE_READ-detail">REPEATABLE_READ</a> и <a href="yii-db-transaction#SERIALIZABLE-detail">SERIALIZABLE,</a> а также строка, содержащая специфический синтаксис СУБД, который будет использоваться после <code>SET TRANSACTION ISOLATION LEVEL</code> .

source: The transaction isolation level to use for this transaction. This can be one of <a href="yii-db-transaction#READ_UNCOMMITTED-detail">yii\db\Transaction::READ_UNCOMMITTED</a>, <a href="yii-db-transaction#READ_COMMITTED-detail">yii\db\Transaction::READ_COMMITTED</a>, <a href="yii-db-transaction#REPEATABLE_READ-detail">yii\db\Transaction::REPEATABLE_READ</a> and <a href="yii-db-transaction#SERIALIZABLE-detail">yii\db\Transaction::SERIALIZABLE</a> but also a string containing DBMS specific syntax to be used after <code>SET TRANSACTION ISOLATION LEVEL</code>.
ja: このトランザクションに使用するトランザクション分離レベル。これは<a href="yii-db-transaction#READ_UNCOMMITTED-detail">yii \ db \ Transaction :: READ_UNCOMMITTED</a>、<a href="yii-db-transaction#READ_COMMITTED-detail">yii \ db \ Transaction :: READ_COMMITTED</a>、<a href="yii-db-transaction#REPEATABLE_READ-detail">yii \ db \ Transaction :: REPEATABLE_READ</a>および<a href="yii-db-transaction#SERIALIZABLE-detail">yii \ db \ Transaction :: SERIALIZABLEのいずれかです</a>が、DBMS固有の構文を含む文字列にすることもできます <code>SET TRANSACTION ISOLATION LEVEL</code> の後に使用されます。
ko: 이 트랜잭션에 사용할 트랜잭션 격리 수준입니다. 이것은 <a href="yii-db-transaction#READ_UNCOMMITTED-detail">yii \ db \ Transaction :: READ_UNCOMMITTED</a> , <a href="yii-db-transaction#READ_COMMITTED-detail">yii \ db \ Transaction :: READ_COMMITTED</a> , <a href="yii-db-transaction#REPEATABLE_READ-detail">yii \ db \ Transaction :: REPEATABLE_READ</a> 및 <a href="yii-db-transaction#SERIALIZABLE-detail">yii \ db \ Transaction :: SERIALIZABLE 중</a> 하나 일 수 있지만 DBMS 특정 구문을 포함하는 문자열이기도합니다. <code>SET TRANSACTION ISOLATION LEVEL</code> 후에 사용됩니다 .
ru: Уровень изоляции транзакции, используемый для этой транзакции. Это может быть один из <a href="yii-db-transaction#READ_UNCOMMITTED-detail">yii \ db \ Transaction :: READ_UNCOMMITTED</a> , yii <a href="yii-db-transaction#READ_COMMITTED-detail">\ db \ Transaction :: READ_COMMITTED</a> , yii <a href="yii-db-transaction#REPEATABLE_READ-detail">\ db \ Transaction :: REPEATABLE_READ</a> и yii <a href="yii-db-transaction#SERIALIZABLE-detail">\ db \ Transaction :: SERIALIZABLE,</a> но также строка, содержащая специфический синтаксис СУБД, который должен быть используется после <code>SET TRANSACTION ISOLATION LEVEL</code> .

source: The translated and formatted message.
ja: 翻訳され、フォーマットされたメッセージ。
ko: 번역 및 형식화 된 메시지
ru: Переведенное и отформатированное сообщение.

source: The translated message or false if translation wasn't found or isn't required
ja: 翻訳されたメッセージ、または翻訳が見つからなかった場合や翻訳が必要でない場合はfalse
ko: 번역 된 메시지 또는 번역을 찾을 수 없거나 필요하지 않은 경우 false
ru: Переведенное сообщение или ложное,если перевод не найден или не требуется.

source: The translated message or false if translation wasn't found.
ja: 翻訳されたメッセージ、または翻訳が見つからなかった場合はfalse。
ko: 번역 된 메시지 또는 번역을 찾을 수 없으면 false입니다.
ru: Переведенное сообщение или ложное,если перевод не был найден.

source: The translated message.
ja: 翻訳されたメッセージ。
ko: 번역 된 메시지.
ru: Переведенное сообщение.

source: The translated message. An event handler may overwrite this property with a translated version of <a href="yii-i18n-missingtranslationevent#%24message-detail">$message</a> if possible. If not set (null), it means the message is not translated.
ja: 翻訳されたメッセージ。イベントハンドラーは、可能な場合、翻訳されたバージョンの<a href="yii-i18n-missingtranslationevent#%24message-detail">$ messageで</a>このプロパティを上書きする場合があります。設定されていない場合（null）、メッセージが翻訳されていないことを意味します。
ko: 번역 된 메시지. 가능하면 이벤트 핸들러가이 특성을 번역 된 <a href="yii-i18n-missingtranslationevent#%24message-detail">$ message</a> 버전으로 겹쳐 쓸 수 있습니다. 설정하지 않으면 (널), 메시지가 번역되지 않았 음을 의미합니다.
ru: Переведенное сообщение. Обработчик события может перезаписать это свойство переведенной версией <a href="yii-i18n-missingtranslationevent#%24message-detail">$ message,</a> если это возможно. Если не установлен (null), это означает, что сообщение не переведено.

source: The translation is done according to the following procedure:
ja: 以下の手順で翻訳を行います。
ko: 번역은 다음 절차에 따라 수행됩니다.
ru: Перевод осуществляется в соответствии со следующей процедурой:

source: The translation will be conducted according to the message category and the target language will be used.
ja: メッセージのカテゴリーに応じて翻訳を行い、対象言語を使用します。
ko: 메시지 범주에 따라 번역이 진행되고 대상 언어가 사용됩니다.
ru: Перевод будет осуществляться в соответствии с категорией сообщения и языком перевода.

source: The truncated string.
ja: 切り捨てられた文字列。
ko: 잘린 문자열입니다.
ru: Усеченная строка.

source: The type attribute.
ja: タイプ属性です。
ko: 유형 속성
ru: Атрибут типа.

source: The type of data that you're expecting back from the server.
ja: サーバーから戻ってくると予想されるデータの種類です。
ko: 서버에서 다시 기대하는 데이터 유형입니다.
ru: Тип данных,которые вы ожидаете обратно от сервера.
