Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/yii/yii.*.022.xlf
Languages: ja, ko, ru

source: The tag options in terms of name-value pairs. The values will be HTML-encoded using <a href="yii-helpers-basehtml#encode()-detail">encode()</a>. If a value is null, the corresponding attribute will not be rendered.
ja: 名前と値のペアに関するタグオプション。値は、<a href="yii-helpers-basehtml#encode()-detail">encode（）</a>を使用してHTMLエンコードされます。値がnullの場合、対応する属性はレンダリングされません。
ko: 이름-값 쌍으로 태그 옵션. 값은 <a href="yii-helpers-basehtml#encode()-detail">encode ()를</a> 사용하여 HTML로 인코딩됩니다 . 값이 null이면 해당 속성이 렌더링되지 않습니다.
ru: Параметры тега в виде пар имя-значение. Значения будут закодированы в HTML с помощью <a href="yii-helpers-basehtml#encode()-detail">encode ()</a> . Если значение равно нулю, соответствующий атрибут не будет отображаться.

source: The tag options in terms of name-value pairs. These will be rendered as the attributes of the hint tag. The values will be HTML-encoded using <a href="yii-helpers-basehtml#encode()-detail">yii\helpers\Html::encode()</a>.
ja: 名前と値のペアに関するタグオプション。これらは、ヒントタグの属性としてレンダリングされます。値は<a href="yii-helpers-basehtml#encode()-detail">yii \ helpers \ Html :: encode（）</a>を使用してHTMLエンコードされます。
ko: 이름-값 쌍으로 태그 옵션. 이들은 힌트 태그의 속성으로 렌더링됩니다. 값은 <a href="yii-helpers-basehtml#encode()-detail">yii \ helpers \ Html :: encode ()를</a> 사용하여 HTML로 인코딩됩니다 .
ru: Параметры тега в виде пар имя-значение. Они будут отображаться как атрибуты тега подсказки. Значения будут закодированы в HTML с помощью <a href="yii-helpers-basehtml#encode()-detail">yii \ helpers \ Html :: encode ()</a> .

source: The tag options in terms of name-value pairs. These will be rendered as the attributes of the resulting tag. The values will be HTML-encoded using <a href="yii-helpers-basehtml#encode()-detail">encode()</a>. If a value is null, the corresponding attribute will not be rendered. See <a href="yii-helpers-basehtml#renderTagAttributes()-detail">renderTagAttributes()</a> for details on how attributes are being rendered.
ja: 名前と値のペアに関するタグオプション。これらは、結果のタグの属性としてレンダリングされます。値は、<a href="yii-helpers-basehtml#encode()-detail">encode（）</a>を使用してHTMLエンコードされます。値がnullの場合、対応する属性はレンダリングされません。参照<a href="yii-helpers-basehtml#renderTagAttributes()-detail">renderTagAttributes（）</a>属性がレンダリングされている方法の詳細については、を。
ko: 이름-값 쌍으로 태그 옵션. 이들은 결과 태그의 속성으로 렌더링됩니다. 값은 <a href="yii-helpers-basehtml#encode()-detail">encode ()를</a> 사용하여 HTML로 인코딩됩니다 . 값이 null이면 해당 속성이 렌더링되지 않습니다. 속성을 렌더링하는 방법에 대한 자세한 내용 은 <a href="yii-helpers-basehtml#renderTagAttributes()-detail">renderTagAttributes ()</a> 를 참조하십시오 .
ru: Параметры тега в виде пар имя-значение. Они будут отображаться как атрибуты результирующего тега. Значения будут закодированы в HTML с помощью <a href="yii-helpers-basehtml#encode()-detail">encode ()</a> . Если значение равно нулю, соответствующий атрибут не будет отображаться. См. <a href="yii-helpers-basehtml#renderTagAttributes()-detail">RenderTagAttributes ()</a> для получения подробной информации о том, как отображаются атрибуты.

source: The tag options in terms of name-value pairs. These will be rendered as the attributes of the resulting tag. The values will be HTML-encoded using <a href="yii-helpers-basehtml#encode()-detail">encode()</a>. If a value is null, the corresponding attribute will not be rendered. See <a href="yii-helpers-basehtml#renderTagAttributes()-detail">renderTagAttributes()</a> for details on how attributes are being rendered. The following special options are recognized:
ja: 名前と値のペアに関するタグオプション。これらは、結果のタグの属性としてレンダリングされます。値は、<a href="yii-helpers-basehtml#encode()-detail">encode（）</a>を使用してHTMLエンコードされます。値がnullの場合、対応する属性はレンダリングされません。参照<a href="yii-helpers-basehtml#renderTagAttributes()-detail">renderTagAttributes（）</a>属性がレンダリングされている方法の詳細については、を。次の特別なオプションが認識されます。
ko: 이름-값 쌍으로 태그 옵션. 이들은 결과 태그의 속성으로 렌더링됩니다. 값은 <a href="yii-helpers-basehtml#encode()-detail">encode ()를</a> 사용하여 HTML로 인코딩됩니다 . 값이 null이면 해당 속성이 렌더링되지 않습니다. 속성을 렌더링하는 방법에 대한 자세한 내용 은 <a href="yii-helpers-basehtml#renderTagAttributes()-detail">renderTagAttributes ()</a> 를 참조하십시오 . 다음과 같은 특수 옵션이 인식됩니다.
ru: Параметры тега в виде пар имя-значение. Они будут отображаться как атрибуты результирующего тега. Значения будут закодированы в HTML с помощью <a href="yii-helpers-basehtml#encode()-detail">encode ()</a> . Если значение равно нулю, соответствующий атрибут не будет отображаться. См. <a href="yii-helpers-basehtml#renderTagAttributes()-detail">RenderTagAttributes ()</a> для получения подробной информации о том, как отображаются атрибуты. Различают следующие специальные опции:

source: The tag options in terms of name-value pairs. These will be rendered as the attributes of the resulting tag. The values will be HTML-encoded using <a href="yii-helpers-basehtml#encode()-detail">encode()</a>. If a value is null, the corresponding attribute will not be rendered. The following options are specially handled:
ja: 名前と値のペアに関するタグオプション。これらは、結果のタグの属性としてレンダリングされます。値は、<a href="yii-helpers-basehtml#encode()-detail">encode（）</a>を使用してHTMLエンコードされます。値がnullの場合、対応する属性はレンダリングされません。次のオプションは特別に処理されます。
ko: 이름-값 쌍으로 태그 옵션. 이들은 결과 태그의 속성으로 렌더링됩니다. 값은 <a href="yii-helpers-basehtml#encode()-detail">encode ()를</a> 사용하여 HTML로 인코딩됩니다 . 값이 null이면 해당 속성이 렌더링되지 않습니다. 다음과 같은 옵션이 특별히 처리됩니다.
ru: Параметры тега в виде пар имя-значение. Они будут отображаться как атрибуты результирующего тега. Значения будут закодированы в HTML с помощью <a href="yii-helpers-basehtml#encode()-detail">encode ()</a> . Если значение равно нулю, соответствующий атрибут не будет отображаться. Особо обрабатываются следующие параметры:

source: The tag options in terms of name-value pairs. These will be rendered as the attributes of the resulting tag. The values will be HTML-encoded using <a href="yii-helpers-basehtml#encode()-detail">encode()</a>. See <a href="yii-helpers-basehtml#renderTagAttributes()-detail">renderTagAttributes()</a> for details on how attributes are being rendered.
ja: 名前と値のペアに関するタグオプション。これらは、結果のタグの属性としてレンダリングされます。値は、<a href="yii-helpers-basehtml#encode()-detail">encode（）</a>を使用してHTMLエンコードされます。参照<a href="yii-helpers-basehtml#renderTagAttributes()-detail">renderTagAttributes（）</a>属性がレンダリングされている方法の詳細については、を。
ko: 이름-값 쌍으로 태그 옵션. 이들은 결과 태그의 속성으로 렌더링됩니다. 값은 <a href="yii-helpers-basehtml#encode()-detail">encode ()를</a> 사용하여 HTML로 인코딩됩니다 . 속성을 렌더링하는 방법에 대한 자세한 내용 은 <a href="yii-helpers-basehtml#renderTagAttributes()-detail">renderTagAttributes ()</a> 를 참조하십시오 .
ru: Параметры тега в виде пар имя-значение. Они будут отображаться как атрибуты результирующего тега. Значения будут закодированы в HTML с помощью <a href="yii-helpers-basehtml#encode()-detail">encode ()</a> . См. <a href="yii-helpers-basehtml#renderTagAttributes()-detail">RenderTagAttributes ()</a> для получения подробной информации о том, как отображаются атрибуты.

source: The tag options in terms of name-value pairs. These will be rendered as the attributes of the resulting tag. The values will be HTML-encoded using <a href="yii-helpers-basehtml#encode()-detail">encode()</a>. See <a href="yii-helpers-basehtml#renderTagAttributes()-detail">renderTagAttributes()</a> for details on how attributes are being rendered. The following special options are recognized:
ja: 名前と値のペアに関するタグオプション。これらは、結果のタグの属性としてレンダリングされます。値は、<a href="yii-helpers-basehtml#encode()-detail">encode（）</a>を使用してHTMLエンコードされます。参照<a href="yii-helpers-basehtml#renderTagAttributes()-detail">renderTagAttributes（）</a>属性がレンダリングされている方法の詳細については、を。次の特別なオプションが認識されます。
ko: 이름-값 쌍으로 태그 옵션. 이들은 결과 태그의 속성으로 렌더링됩니다. 값은 <a href="yii-helpers-basehtml#encode()-detail">encode ()를</a> 사용하여 HTML로 인코딩됩니다 . 속성을 렌더링하는 방법에 대한 자세한 내용 은 <a href="yii-helpers-basehtml#renderTagAttributes()-detail">renderTagAttributes ()</a> 를 참조하십시오 . 다음과 같은 특수 옵션이 인식됩니다.
ru: Параметры тега в виде пар имя-значение. Они будут отображаться как атрибуты результирующего тега. Значения будут закодированы в HTML с помощью <a href="yii-helpers-basehtml#encode()-detail">encode ()</a> . См. <a href="yii-helpers-basehtml#renderTagAttributes()-detail">RenderTagAttributes ()</a> для получения подробной информации о том, как отображаются атрибуты. Различают следующие специальные опции:

source: The tag options in terms of name-value pairs. These will be rendered as the attributes of the resulting tag. The values will be HTML-encoded using <a href="yii-helpers-basehtml#encode()-detail">yii\helpers\Html::encode()</a>.
ja: 名前と値のペアに関するタグオプション。これらは、結果のタグの属性としてレンダリングされます。値は<a href="yii-helpers-basehtml#encode()-detail">yii \ helpers \ Html :: encode（）</a>を使用してHTMLエンコードされます。
ko: 이름-값 쌍으로 태그 옵션. 이들은 결과 태그의 속성으로 렌더링됩니다. 값은 <a href="yii-helpers-basehtml#encode()-detail">yii \ helpers \ Html :: encode ()를</a> 사용하여 HTML로 인코딩됩니다 .
ru: Параметры тега в виде пар имя-значение. Они будут отображаться как атрибуты результирующего тега. Значения будут закодированы в HTML с помощью <a href="yii-helpers-basehtml#encode()-detail">yii \ helpers \ Html :: encode ()</a> .

source: The tag options in terms of name-value pairs. These will be rendered as the attributes of the resulting tag. There are also a special options:
ja: 名前と値のペアでのタグオプション。これらは結果のタグの属性として表示されます。特別なオプションもあります。
ko: 이름-값 쌍으로 태그 옵션. 이들은 결과 태그의 속성으로 렌더링됩니다. 특별한 옵션도 있습니다 :
ru: Опции тегов с точки зрения пар "имя-значение".Они будут отображены как атрибуты результирующего тега.Существуют также специальные опции:

source: The tag to use to render the button
ja: ボタンのレンダリングに使用するタグ
ko: 버튼을 렌더링하는 데 사용할 태그
ru: Тег,который необходимо использовать для отображения кнопки

source: The target AR class
ja: 対象となるARクラス
ko: 대상 AR 클래스
ru: Целевой класс AR

source: The target fallback language
ja: ターゲットのフォールバック言語
ko: 대상 대체 언어
ru: Язык ожидания цели

source: The target language
ja: 対象言語
ko: 대상 언어
ru: Язык перевода

source: The target language that the file should be localized to. If not set, the value of <a href="yii-base-application#%24language-detail">yii\base\Application::$language</a> will be used.
ja: ファイルをローカライズするターゲット言語。設定されていない場合、<a href="yii-base-application#%24language-detail">yii \ base \ Application :: $ language</a>の値が使用されます。
ko: 파일을 현지화해야하는 대상 언어입니다. 설정하지 않으면 <a href="yii-base-application#%24language-detail">yii \ base \ Application :: $ language</a> 값이 사용됩니다.
ru: Целевой язык, на который следует локализовать файл. Если не установлен, будет использоваться значение <a href="yii-base-application#%24language-detail">yii \ base \ Application :: $ language</a> .

source: The target language.
ja: ターゲット言語。
ko: 대상 언어
ru: Язык перевода.

source: The template file for generating new migrations.
ja: 新しいマイグレーションを生成するためのテンプレートファイルです。
ko: 새 마이그레이션을 생성하기위한 템플릿 파일.
ru: Файл шаблона для генерации новых миграций.

source: The template file for generating new migrations. This can be either a <a href="guide-concept-aliases">path alias</a> (e.g. "@app/migrations/template.php") or a file path.
ja: 新しいマイグレーションを生成するためのテンプレートファイル。これは、<a href="guide-concept-aliases">パスエイリアス</a>（ "@ app / migrations / template.php"など）またはファイルパスのいずれかです。
ko: 새 마이그레이션을 생성하기위한 템플릿 파일. 이것은이 될 수 있습니다 <a href="guide-concept-aliases">경로 별명</a> (예 : "@ 응용 프로그램 / 마이그레이션 / template.php") 또는 파일 경로.
ru: Файл шаблона для создания новых миграций. Это может быть <a href="guide-concept-aliases">псевдоним пути</a> (например, &laquo;@ app / migrations / template.php&raquo;) или путь к файлу.

source: The template for arranging the CAPTCHA image tag and the text input tag.
ja: CAPTCHA画像タグとテキスト入力タグを並べるテンプレートです。
ko: 보안 문자 이미지 태그와 텍스트 입력 태그를 정렬하기위한 템플릿입니다.
ru: Шаблон для организации тега изображения CAPTCHA и тега ввода текста.

source: The template for arranging the CAPTCHA image tag and the text input tag. In this template, the token <code>{image}</code> will be replaced with the actual image tag, while <code>{input}</code> will be replaced with the text input tag.
ja: CAPTCHA画像タグとテキスト入力タグを配置するためのテンプレート。このテンプレートでは、トークン <code>{image}</code> は実際の画像タグに置き換えられ、 <code>{input}</code> はテキスト入力タグに置き換えられます。
ko: 보안 문자 이미지 태그와 텍스트 입력 태그를 정렬하기위한 템플릿입니다. 이 템플릿에서 <code>{image}</code> 토큰 은 실제 이미지 태그로 대체되고 <code>{input}</code> 은 텍스트 입력 태그로 대체됩니다.
ru: Шаблон для размещения тега изображения CAPTCHA и тега ввода текста. В этом шаблоне токен <code>{image}</code> будет заменен фактическим тегом изображения, а <code>{input}</code> будет заменен тегом ввода текста.

source: The template for checkboxes in default layout
ja: デフォルトレイアウトのチェックボックスのテンプレート
ko: 기본 레이아웃의 체크 박스 템플릿
ru: Шаблон для флажков по умолчанию

source: The template for checkboxes in horizontal layout
ja: 横長レイアウトのチェックボックスのテンプレート
ko: 가로 레이아웃의 체크 박스 템플릿
ru: Шаблон для флажков в горизонтальном расположении

source: The template for inline checkboxLists
ja: インラインチェックボックスリストのテンプレート
ko: 인라인 확인란의 템플릿
ru: Шаблон для встроенных флажковЛисты

source: The template for inline radioLists
ja: インラインradioListsのテンプレート
ko: 인라인 라디오 목록 템플릿
ru: Шаблон для встроенных радиолистов

source: The template for radio buttons in horizontal layout
ja: 横長レイアウトのラジオボタンのテンプレート
ko: 가로 레이아웃의 라디오 버튼 템플릿
ru: Шаблон для радиокнопок в горизонтальном расположении

source: The template for radios in default layout
ja: デフォルトレイアウトのラジオ用テンプレート
ko: 기본 레이아웃의 라디오 템플릿
ru: Шаблон для радиостанций по умолчанию

source: The template that is used to arrange the label, the input field, the error message and the hint text.
ja: ラベル、入力フィールド、エラーメッセージ、ヒントテキストを配置するために使用されるテンプレート。
ko: 레이블, 입력 필드, 오류 메시지 및 힌트 텍스트를 정렬하는 데 사용되는 템플릿입니다.
ru: Шаблон,который используется для расположения метки,поля ввода,сообщения об ошибке и текста подсказки.

source: The template that is used to arrange the label, the input field, the error message and the hint text. The following tokens will be replaced when <a href="yii-widgets-activefield#render()-detail">render()</a> is called: <code>{label}</code>, <code>{input}</code>, <code>{error}</code> and <code>{hint}</code>.
ja: ラベル、入力フィールド、エラーメッセージ、ヒントテキストを配置するために使用されるテンプレート。<a href="yii-widgets-activefield#render()-detail">render（）</a>が呼び出されると、次のトークンが置き換えられます： <code>{label}</code> 、 <code>{input}</code> 、 <code>{error}</code> および <code>{hint}</code> 。
ko: 레이블, 입력 필드, 오류 메시지 및 힌트 텍스트를 정렬하는 데 사용되는 템플릿입니다. <a href="yii-widgets-activefield#render()-detail">render ()</a> 가 호출 되면 <code>{label}</code> , <code>{input}</code> , <code>{error}</code> 및 <code>{hint}</code> 토큰이 대체됩니다 .
ru: Шаблон, который используется для размещения метки, поля ввода, сообщения об ошибке и текста подсказки. Следующие токены будут заменены при вызове <a href="yii-widgets-activefield#render()-detail">render ()</a> : <code>{label}</code> , <code>{input}</code> , <code>{error}</code> и <code>{hint}</code> .

source: The template to be used to rendered the link. The token "{link}" will be replaced by the link.
ja: リンクをレンダリングするために使用されるテンプレート。トークン"{link}"はリンクに置き換えられます。
ko: 링크를 렌더링하는 데 사용되는 템플릿입니다. "{link}"토큰이 링크로 대체됩니다.
ru: Шаблон,который будет использоваться для отображения ссылки.Токен "{link}" будет заменен на ссылку.

source: The template used for composing each cell in the action column.
ja: アクション欄の各セルを構成するために使用されるテンプレート。
ko: 작업 열의 각 셀을 구성하는 데 사용되는 템플릿입니다.
ru: Шаблон,используемый для составления каждой ячейки в столбце действия.

source: The template used for composing each cell in the action column. Tokens enclosed within curly brackets are treated as controller action IDs (also called <em>button names</em> in the context of action column). They will be replaced by the corresponding button rendering callbacks specified in <a href="yii-grid-actioncolumn#%24buttons-detail">$buttons</a>. For example, the token <code>{view}</code> will be replaced by the result of the callback <code>buttons['view']</code>. If a callback cannot be found, the token will be replaced with an empty string.
ja: アクション列の各セルを構成するために使用されるテンプレート。中括弧で囲まれたトークンは、コントローラーアクションID（アクション列のコンテキストでは<em>ボタン名</em>とも呼ばれ<em>ます）</em>として扱われ<em>ます</em>。これらは、<a href="yii-grid-actioncolumn#%24buttons-detail">$ buttonsで</a>指定された対応するボタンレンダリングコールバックに置き換えられます。たとえば、トークン <code>{view}</code> は、コールバック <code>buttons['view']</code> の結果に置き換えられます。コールバックが見つからない場合、トークンは空の文字列に置き換えられます。
ko: 작업 열의 각 셀을 구성하는 데 사용되는 템플릿입니다. 중괄호로 묶인 토큰은 컨트롤러 작업 ID ( 작업 열 컨텍스트에서 <em>버튼 이름</em> 이라고도 함)로 취급됩니다 . <a href="yii-grid-actioncolumn#%24buttons-detail">$ buttons에</a> 지정된 해당 버튼 렌더링 콜백으로 대체됩니다 . 예를 들어, <code>{view}</code> 토큰 은 콜백 <code>buttons['view']</code> 의 결과로 대체됩니다 . 콜백을 찾을 수 없으면 토큰이 빈 문자열로 바뀝니다.
ru: Шаблон, используемый для создания каждой ячейки в столбце действий. Токены, заключенные в фигурные скобки, рассматриваются как идентификаторы действий контроллера (также называемые <em>именами кнопок</em> в контексте столбца действий). Они будут заменены соответствующими обратными вызовами рендеринга кнопок, указанными в <a href="yii-grid-actioncolumn#%24buttons-detail">$ buttons</a> . Например, токен <code>{view}</code> будет заменен результатом <code>buttons['view']</code> обратного вызова ['view'] . Если обратный вызов не может быть найден, токен будет заменен пустой строкой.

source: The template used to render a list of sub-menus.
ja: サブメニューのリストをレンダリングするために使用されるテンプレートです。
ko: 하위 메뉴 목록을 렌더링하는 데 사용되는 템플릿입니다.
ru: Шаблон,используемый для отображения списка подменю.

source: The template used to render a list of sub-menus. In this template, the token <code>{items}</code> will be replaced with the rendered sub-menu items.
ja: サブメニューのリストをレンダリングするために使用されるテンプレート。このテンプレートでは、トークン <code>{items}</code> がレンダリングされたサブメニューアイテムに置き換えられます。
ko: 하위 메뉴 목록을 렌더링하는 데 사용되는 템플릿입니다. 이 템플릿에서 <code>{items}</code> 토큰 은 렌더링 된 하위 메뉴 항목으로 대체됩니다.
ru: Шаблон, используемый для отображения списка подменю. В этом шаблоне токен <code>{items}</code> будет заменен отображаемыми элементами подменю.

source: The template used to render a single attribute.
ja: 1つの属性をレンダリングするために使用されるテンプレート。
ko: 단일 속성을 렌더링하는 데 사용되는 템플릿입니다.
ru: Шаблон,используемый для отображения одного атрибута.

source: The template used to render a single attribute. If a string, the token <code>{label}</code> and <code>{value}</code> will be replaced with the label and the value of the corresponding attribute. If a callback (e.g. an anonymous function), the signature must be as follows:
ja: 単一の属性のレンダリングに使用されるテンプレート。文字列の場合、トークン <code>{label}</code> と <code>{value}</code> は、対応する属性のラベルと値に置き換えられます。コールバック（たとえば、無名関数）の場合、シグネチャは次のようにする必要があります。
ko: 단일 속성을 렌더링하는 데 사용되는 템플릿입니다. 문자열 인 경우 <code>{label}</code> 및 <code>{value}</code> 토큰 이 해당 속성의 레이블 및 값으로 바뀝니다. 콜백 (예 : 익명 함수)의 경우 서명은 다음과 같아야합니다.
ru: Шаблон, используемый для визуализации одного атрибута. Если строка, то лексемы <code>{label}</code> и <code>{value}</code> будут заменены меткой и значением соответствующего атрибута. Если обратный вызов (например, анонимная функция), подпись должна быть следующей:

source: The template used to render each active item in the breadcrumbs.
ja: パンくずの各アクティブな項目をレンダリングするために使用されるテンプレートです。
ko: 사이트 이동 경로에서 각 활성 항목을 렌더링하는 데 사용되는 템플릿입니다.
ru: Шаблон,используемый для рендеринга каждого активного элемента в хлебных крошках.

source: The template used to render each active item in the breadcrumbs. The token <code>{link}</code> will be replaced with the actual HTML link for each active item.
ja: ブレッドクラム内のアクティブな各アイテムをレンダリングするために使用されるテンプレート。トークン <code>{link}</code> は、アクティブな各アイテムの実際のHTMLリンクに置き換えられます。
ko: 사이트 이동 경로에서 각 활성 항목을 렌더링하는 데 사용되는 템플릿입니다. <code>{link}</code> 토큰 은 각 활성 항목에 대한 실제 HTML 링크로 대체됩니다.
ru: Шаблон, используемый для отображения каждого активного элемента в хлебных крошках. Токен <code>{link}</code> будет заменен фактической ссылкой HTML для каждого активного элемента.

source: The template used to render each inactive item in the breadcrumbs.
ja: パンくずの各非アクティブな項目をレンダリングするために使用されるテンプレート。
ko: 이동 경로에서 각 비활성 항목을 렌더링하는 데 사용되는 템플리트입니다.
ru: Шаблон,используемый для отображения каждого неактивного элемента в хлебных крошках.

source: The template used to render each inactive item in the breadcrumbs. The token <code>{link}</code> will be replaced with the actual HTML link for each inactive item.
ja: パンくずリスト内の非アクティブな各アイテムをレンダリングするために使用されるテンプレート。トークン <code>{link}</code> は、非アクティブな各アイテムの実際のHTMLリンクに置き換えられます。
ko: 이동 경로에서 각 비활성 항목을 렌더링하는 데 사용되는 템플리트입니다. <code>{link}</code> 토큰 은 각 비활성 아이템에 대한 실제 HTML 링크로 대체됩니다.
ru: Шаблон, используемый для отображения каждого неактивного элемента в хлебных крошках. Токен <code>{link}</code> будет заменен фактической ссылкой HTML для каждого неактивного элемента.

source: The template used to render the body of a menu which is NOT a link.
ja: リンクではないメニューの本文をレンダリングするために使用されるテンプレートです。
ko: 링크가 아닌 메뉴 본문을 렌더링하는 데 사용되는 템플릿입니다.
ru: Шаблон,используемый для отображения тела меню,которое НЕ является ссылкой.

source: The template used to render the body of a menu which is NOT a link. In this template, the token <code>{label}</code> will be replaced with the label of the menu item. This property will be overridden by the <code>template</code> option set in individual menu items via <a href="yii-widgets-menu#%24items-detail">$items</a>.
ja: リンクではないメニューの本体をレンダリングするために使用されるテンプレート。このテンプレートでは、トークン <code>{label}</code> がメニュー項目のラベルに置き換えられます。このプロパティは、<a href="yii-widgets-menu#%24items-detail">$ items</a>を介して個々のメニュー項目に設定された <code>template</code> オプションによってオーバーライドされます。
ko: 링크가 아닌 메뉴 본문을 렌더링하는 데 사용되는 템플릿입니다. 이 템플릿에서 <code>{label}</code> 토큰 은 메뉴 항목의 레이블로 대체됩니다. 이 속성은 <a href="yii-widgets-menu#%24items-detail">$ items</a> 를 통해 개별 메뉴 항목에서 설정된 <code>template</code> 옵션 으로 재정의됩니다 .
ru: Шаблон, используемый для отображения тела меню, НЕ являющегося ссылкой. В этом шаблоне маркер <code>{label}</code> будет заменен на ярлык пункта меню. Это свойство будет переопределено опцией <code>template</code> установленной в отдельных пунктах меню через <a href="yii-widgets-menu#%24items-detail">$ items</a> .

source: The template used to render the body of a menu which is a link.
ja: リンクであるメニューの本文をレンダリングするために使用されるテンプレートです。
ko: 링크 인 메뉴의 본문을 렌더링하는 데 사용되는 템플릿입니다.
ru: Шаблон,используемый для отображения тела меню,которое является ссылкой.

source: The template used to render the body of a menu which is a link. In this template, the token <code>{url}</code> will be replaced with the corresponding link URL; while <code>{label}</code> will be replaced with the link text. This property will be overridden by the <code>template</code> option set in individual menu items via <a href="yii-widgets-menu#%24items-detail">$items</a>.
ja: リンクであるメニューの本体をレンダリングするために使用されるテンプレート。このテンプレートでは、トークン <code>{url}</code> は対応するリンクURLに置き換えられます。一方、 <code>{label}</code> はリンクテキストに置き換えられます。このプロパティは、<a href="yii-widgets-menu#%24items-detail">$ items</a>を介して個々のメニュー項目に設定された <code>template</code> オプションによってオーバーライドされます。
ko: 링크 인 메뉴의 본문을 렌더링하는 데 사용되는 템플릿입니다. 이 템플릿에서 <code>{url}</code> 토큰 은 해당 링크 URL로 대체됩니다. 반면 <code>{label}</code> 링크 텍스트로 대체됩니다. 이 속성은 <a href="yii-widgets-menu#%24items-detail">$ items</a> 를 통해 개별 메뉴 항목에서 설정된 <code>template</code> 옵션 으로 재정의됩니다 .
ru: Шаблон, используемый для отображения тела меню, которое является ссылкой. В этом шаблоне токен <code>{url}</code> будет заменен на соответствующий URL-адрес ссылки; а <code>{label}</code> будет заменен текстом ссылки. Это свойство будет переопределено опцией <code>template</code> установленной в отдельных пунктах меню через <a href="yii-widgets-menu#%24items-detail">$ items</a> .

source: The test guy instance
ja: テスト担当者のインスタンス
ko: 테스트 가이 인스턴스
ru: Испытательный парень пример

source: The testing guy object
ja: テストする人のオブジェクト
ko: 테스트 녀석 개체
ru: Объект тестирующего парня
