Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/yii/yii.*.022.xlf
Languages: ja, ko, ru

source: The record instances, or empty array if nothing was found
ja: レコードインスタンス、または何も見つからなかった場合は空の配列
ru: Экземпляры записей,или пустой массив,если ничего не было найдено.

source: The record to be linked with the current one.
ja: 現在のものと連動するレコード。
ru: Запись должна быть связана с текущей.

source: The record to be populated. In most cases this will be an instance created by <a href="yii-db-baseactiverecord#instantiate()-detail">instantiate()</a> beforehand.
ja: 移入されるレコード。ほとんどの場合、これは事前に<a href="yii-db-baseactiverecord#instantiate()-detail">instantiate（）</a>によって作成されたインスタンスです。
ru: Заполняемая запись. В большинстве случаев это будет экземпляр, созданный заранее <a href="yii-db-baseactiverecord#instantiate()-detail">instantiate ()</a> .

source: The record to be populated. In most cases this will be an instance created by <a href="yii-elasticsearch-activerecord#instantiate()-detail">instantiate()</a> beforehand.
ja: 移入されるレコード。ほとんどの場合、これは事前に<a href="yii-elasticsearch-activerecord#instantiate()-detail">instantiate（）</a>によって作成されたインスタンスです。
ru: Заполняемая запись. В большинстве случаев это будет экземпляр, созданный заранее <a href="yii-elasticsearch-activerecord#instantiate()-detail">instantiate ()</a> .

source: The record with the foreign key of the relationship will be deleted if <code>$delete</code> is true. Otherwise, the foreign key will be set <code>null</code> and the record will be saved without validation.
ja: <code>$delete</code> がtrueの場合、関係の外部キーを持つレコードが削除されます。それ以外の場合、外部キーは <code>null</code> に設定され、レコードは検証なしで保存されます。
ru: Запись с внешним ключом отношения будет удалена, если <code>$delete</code> истинно. В противном случае внешнему ключу будет присвоено значение <code>null</code> , и запись будет сохранена без проверки.

source: The redirection response if <a href="yii-web-user#%24loginUrl-detail">$loginUrl</a> is set
ja: <a href="yii-web-user#%24loginUrl-detail">$ loginUrl</a>が設定されている場合のリダイレクト応答
ru: Ответ Перенаправление если <a href="yii-web-user#%24loginUrl-detail">$ loginUrl</a> является набор

source: The redis database to use.
ja: 使用するredisデータベース。
ru: Использовать базу данных redis.

source: The redis database to use. This is an integer value starting from 0. Defaults to 0. Since version 2.0.6 you can disable the SELECT command sent after connection by setting this property to <code>null</code>.
ja: 使用するredisデータベース。これは0から始まる整数値です。デフォルトは0です。バージョン2.0.6以降、このプロパティを <code>null</code> に設定することにより、接続後に送信されるSELECTコマンドを無効にできます。
ru: База данных redis, которую нужно использовать. Это целочисленное значение, начинающееся с 0. По умолчанию - 0. Начиная с версии 2.0.6, вы можете отключить команду SELECT, отправляемую после соединения, установив для этого свойства значение <code>null</code> .

source: The reference may be specified as a string or an Instance object. If the former, it will be treated as a component ID, a class/interface name or an alias, depending on the container type.
ja: 参照は文字列またはInstanceオブジェクトとして指定することができます。前者の場合は、コンテナの種類に応じて、コンポーネントID、クラス/インターフェース名、またはエイリアスとして扱われます。
ru: Ссылка может быть указана в виде строки или объекта Экземпляр.Если первая,то она будет рассматриваться как идентификатор компонента,имя класса/интерфейса или псевдоним,в зависимости от типа контейнера.

source: The registered CSS code blocks.
ja: 登録されているCSSコードブロック。
ru: Зарегистрированные блоки CSS-кодов.

source: The registered CSS files.
ja: 登録されているCSSファイル。
ru: Зарегистрированные CSS-файлы.

source: The registered JS code blocks
ja: 登録されているJSコードブロック
ru: Зарегистрированные блоки JS-кодов

source: The registered JS files.
ja: 登録されているJSファイルです。
ru: Зарегистрированные JS-файлы.

source: The registered asset bundle instance
ja: 登録されているアセットバンドルのインスタンス
ru: Зарегистрированный экземпляр пакета активов

source: The registered link tags.
ja: 登録されているリンクタグです。
ru: Зарегистрированные теги ссылок.

source: The registered meta tags.
ja: 登録されているメタタグ。
ru: Зарегистрированные мета-теги.

source: The regular expression for matching integers.
ja: 整数を一致させるための正規表現です。
ru: Регулярное выражение для соответствия целых чисел.

source: The regular expression for matching numbers.
ja: 数字を一致させるための正規表現です。
ru: Регулярное выражение для совпадения чисел.

source: The regular expression for matching numbers. It defaults to a pattern that matches floating numbers with optional exponential part (e.g. -1.23e-10).
ja: 数値にマッチする正規表現。デフォルトは,浮動小数点数と任意の指数部(例えば,-1.23e-10)を持つ浮動小数点数にマッチするパターンです.
ru: Регулярное выражение для совпадения чисел.По умолчанию оно соответствует шаблону,который соответствует плавающим числам с необязательной экспоненциальной частью (например,-1.23e-10).

source: The regular expression to be escaped.
ja: エスケープされる正規表現。
ru: Регулярное выражение,чтобы сбежать.

source: The regular expression to be matched with
ja: と一致させる正規表現は
ru: Регулярное выражение,которое должно соответствовать

source: The regular expression used to validate email addresses with the name part.
ja: 名前の部分でメールアドレスを検証する際に使用する正規表現です。
ru: Регулярное выражение,используемое для проверки адресов электронной почты с именной частью.

source: The regular expression used to validate email addresses with the name part. This property is used only when <a href="yii-validators-emailvalidator#%24allowName-detail">$allowName</a> is true.
ja: 名前の部分でメールアドレスを検証するために使用される正規表現。このプロパティは、<a href="yii-validators-emailvalidator#%24allowName-detail">$ allowName</a>がtrueの場合にのみ使用されます。
ru: Регулярное выражение, используемое для проверки адресов электронной почты с частью имени. Это свойство используется, только когда <a href="yii-validators-emailvalidator#%24allowName-detail">$ allowName</a> истинно.

source: The regular expression used to validate the attribute value.
ja: 属性値を検証するために使用される正規表現。
ru: Регулярное выражение,используемое для проверки значения атрибута.

source: The regular expression used to validate the attribute value. The pattern may contain a <code>{schemes}</code> token that will be replaced by a regular expression which represents the <a href="yii-validators-urlvalidator#%24validSchemes-detail">$validSchemes</a>.
ja: 属性値の検証に使用される正規表現。パターンには、<a href="yii-validators-urlvalidator#%24validSchemes-detail">$ validSchemes</a>を表す正規表現に置き換えられる <code>{schemes}</code> トークンを含めることができます。
ru: Регулярное выражение, используемое для проверки значения атрибута. Шаблон может содержать токен <code>{schemes}</code> который будет заменен регулярным выражением, представляющим <a href="yii-validators-urlvalidator#%24validSchemes-detail">$ validSchemes</a> .

source: The related models
ja: 関連モデル
ru: Соответствующие модели

source: The related record(s)
ja: 関連レコード
ru: Соответствующие записи

source: The related records to be populated into the relation.
ja: 関連するレコードをリレーションに入力します。
ru: Соответствующие записи,которые будут занесены в отношение.

source: The relation name
ja: 関係名
ru: Имя родственника

source: The relation name may optionally contain an alias for the relation table (e.g. <code>books b</code>).
ja: リレーション名には、オプションでリレーションテーブルのエイリアス（ <code>books b</code> など）を含めることができます。
ru: Имя отношения может дополнительно содержать псевдоним для таблицы отношений (например, <code>books b</code> ).

source: The relation name, e.g. <code>orders</code> for a relation defined via <code>getOrders()</code> method (case-sensitive).
ja: リレーション名、たとえば <code>getOrders()</code> メソッドで定義されたリレーションの <code>orders</code> （大文字と小文字を区別）。
ru: Имя отношения, например <code>orders</code> для отношения, определенного с помощью <code>getOrders()</code> (с учетом регистра).

source: The relation name. This refers to a relation declared in <a href="yii-db-activerelationtrait#%24primaryModel-detail">$primaryModel</a>.
ja: リレーション名。これは、<a href="yii-db-activerelationtrait#%24primaryModel-detail">$ primaryModelで</a>宣言された関係を参照します。
ru: Имя отношения. Это относится к отношению, объявленному в <a href="yii-db-activerelationtrait#%24primaryModel-detail">$ primaryModel</a> .

source: The relation name. This refers to a relation declared in the <a href="yii-db-activerelationtrait#%24primaryModel-detail">primaryModel</a> of the relation.
ja: リレーション名。これは、関係の<a href="yii-db-activerelationtrait#%24primaryModel-detail">primaryModel</a>で宣言された関係を参照します。
ru: Имя отношения. Это относится к отношению, объявленному в <a href="yii-db-activerelationtrait#%24primaryModel-detail">primaryModel</a> отношения.

source: The relation object itself.
ja: リレーションオブジェクトそのもの。
ru: Сам объект связи.

source: The relational queries that we have described so far only reference the primary table columns when querying for the primary data. In reality we often need to reference columns in the related tables. For example, we may want to bring back the customers who have at least one active order. To solve this problem, we can build a join query like the following:
ja: これまで説明してきたリレーショナルクエリは、プライマリデータのクエリを行う際にプライマリテーブルのカラムを参照するだけです。実際には、関連テーブルのカラムを参照する必要があることがよくあります。例えば、少なくとも1つのアクティブな注文を持っている顧客を復活させたい場合があります。この問題を解決するには、以下のような結合クエリを作成します。
ru: Описанные до сих пор реляционные запросы ссылаются только на столбцы первичной таблицы при запросе первичных данных.В реальности нам часто приходится ссылаться на столбцы в соответствующих таблицах.Например,мы можем захотеть вернуть клиентов,у которых есть хотя бы один активный порядок.Чтобы решить эту проблему,мы можем построить запрос на присоединение,как показано ниже:

source: The relational query object
ja: リレーショナルクエリオブジェクト
ru: Объект реляционного запроса

source: The relational query object.
ja: リレーショナルクエリオブジェクト。
ru: Объект реляционного запроса.

source: The relational query object. If the relation does not exist and <code>$throwException</code> is <code>false</code>, <code>null</code> will be returned.
ja: リレーショナルクエリオブジェクト。リレーションが存在せず、 <code>$throwException</code> が <code>false</code> の場合、 <code>null</code> が返されます。
ru: Объект реляционного запроса. Если отношение не существует и <code>$throwException</code> имеет значение <code>false</code> , возвращается <code>null</code> .

source: The relations being generated currently.
ja: 現在生成されている関係。
ru: Отношения,создаваемые в настоящее время.

source: The relations to be joined with.
ja: 一緒に参加する関係。
ru: Отношения,с которыми нужно соединиться.

source: The relations to be joined. This can either be a string, representing a relation name or an array with the following semantics:
ja: 結合される関係。これは、リレーション名を表す文字列か、以下のセマンティクスを持つ配列のいずれかです。
ru: Отношения,к которым нужно присоединиться.Это может быть либо строка,представляющая собой имя отношения,либо массив со следующей семантикой:

source: The relationship is established by setting the foreign key value(s) in one model to be the corresponding primary key value(s) in the other model. The model with the foreign key will be saved into database without performing validation.
ja: 一方のモデルの外部キーの値を、他方のモデルの対応する主キーの値に設定することで関係が成立します。外部キーが設定されたモデルは、検証を行わずにデータベースに保存されます。
ru: Связь устанавливается путем установки в одной модели значения(-ий)иностранного(-их)ключа(-ов)в качестве соответствующих значений(-ий)первичного ключа(-ов)в другой модели.Модель с иностранным ключом будет сохранена в базе данных без проведения валидации.

source: The relationship is established by setting the foreign key value(s) in one record to be the corresponding primary key value(s) in the other record. The record with the foreign key will be saved into database without performing validation.
ja: 一方のレコードの外部キーの値を、もう一方のレコードの対応する主キーの値に設定することで関係が成立します。外部キーを持つレコードは、検証を行わずにデータベースに保存されます。
ru: Связь устанавливается путем установки значения(ий)иностранного(ых)ключа(ов)в одной записи в качестве соответствующего(ых)значения(й)первичного ключа(ов)в другой записи.Запись с иностранным ключом будет сохранена в базе данных без проведения валидации.

source: The relative URL for the application
ja: アプリケーションの相対 URL
ru: Относительный URL-адрес приложения

source: The relative URL for the application entry script.
ja: アプリケーションエントリースクリプトの相対 URL。
ru: Относительный URL для скрипта ввода приложения.

source: The relative URL of the entry script.
ja: エントリースクリプトの相対URL。
ru: Относительный URL скрипта записи.

source: The relative URL to be converted.
ja: 変換する相対URL。
ru: Относительный URL-адрес,который должен быть преобразован.

source: The relative file path to be converted.
ja: 変換するファイルの相対パスです。
ru: Относительный путь к файлу,который необходимо преобразовать.

source: The remaining number of allowed requests within the current period
ja: 現在の期間内に許可されたリクエストの残り数
ru: Оставшееся количество разрешенных заявок в течение текущего периода

source: The removed flash message. Null if the flash message does not exist.
ja: 削除されたフラッシュ メッセージ。フラッシュメッセージが存在しない場合はNULL。
ru: Удаленное мгновенное сообщение.Закрыть,если мгновенное сообщение не существует.

source: The removed value, null if no such session variable.
ja: 削除された値、そのようなセッション変数がない場合はnull。
ru: Удаленное значение,ноль,если нет такой переменной сеанса.

source: The rendered caption element or <code>false</code> if no caption element should be rendered.
ja: レンダリングされたキャプション要素。キャプション要素をレンダリングする必要がない場合は <code>false</code> 。
ru: Отображаемый элемент заголовка или <code>false</code> , если визуализировать элемент заголовка не требуется.

source: The rendered content
ja: レンダリングされた内容
ru: Оказанное содержание

source: The rendering library to use.
ja: 使用するレンダリングライブラリ。
ru: Библиотека рендеринга для использования.

source: The rendering library to use. Currently supported only 'gd' and 'imagick'. If not set, library will be determined automatically.
ja: 使用するレンダリングライブラリ。現在サポートされているのは 'gd' と 'imagick' のみです。設定されていない場合、ライブラリは自動的に決定されます。
ru: Библиотека рендеринга для использования.В настоящее время поддерживаются только 'gd' и 'imagick'.Если не установить,библиотека будет определена автоматически.

source: The rendering result
ja: レンダリング結果
ru: Результат рендеринга

source: The rendering result of <a href="yii-base-view#renderFile()-detail">yii\base\View::renderFile()</a>.
ja: <a href="yii-base-view#renderFile()-detail">yii \ base \ View :: renderFile（）</a>のレンダリング結果。
ru: Результат рендеринга <a href="yii-base-view#renderFile()-detail">yii \ base \ View :: renderFile ()</a> .

source: The rendering result of <a href="yii-base-view#renderFile()-detail">yii\base\View::renderFile()</a>. Event handlers may modify this property and the modified output will be returned by <a href="yii-base-view#renderFile()-detail">yii\base\View::renderFile()</a>. This property is only used by <a href="yii-base-view#EVENT_AFTER_RENDER-detail">yii\base\View::EVENT_AFTER_RENDER</a> event.
ja: <a href="yii-base-view#renderFile()-detail">yii \ base \ View :: renderFile（）</a>のレンダリング結果。イベントハンドラーはこのプロパティを変更でき、変更された出力は<a href="yii-base-view#renderFile()-detail">yii \ base \ View :: renderFile（）</a>によって返されます。このプロパティは<a href="yii-base-view#EVENT_AFTER_RENDER-detail">yii \ base \ View :: EVENT_AFTER_RENDER</a>イベントでのみ使用されます。
ru: Результат рендеринга <a href="yii-base-view#renderFile()-detail">yii \ base \ View :: renderFile ()</a> . Обработчики событий могут изменять это свойство, и измененный вывод будет возвращен <a href="yii-base-view#renderFile()-detail">yii \ base \ View :: renderFile ()</a> . Это свойство используется только событием <a href="yii-base-view#EVENT_AFTER_RENDER-detail">yii \ base \ View :: EVENT_AFTER_RENDER</a> .

source: The rendering result of the layout with the given static string as the <code>$content</code> variable. If the layout is disabled, the string will be returned back.
ja: <code>$content</code> 変数として指定された静的文字列を使用したレイアウトのレンダリング結果。レイアウトが無効になっている場合、文字列が返されます。
ru: Результат отрисовки макета с заданной статической строкой в ​​качестве переменной <code>$content</code> . Если макет отключен, строка будет возвращена обратно.

source: The rendering result of the section, or false if the named section is not supported.
ja: セクションのレンダリング結果、または指定されたセクションがサポートされていない場合は false。
ru: Результат рендеринга раздела,или false,если именованный раздел не поддерживается.

source: The rendering result of the view file. Updates to this parameter will be passed back and returned by <a href="yii-base-view#renderFile()-detail">renderFile()</a>.
ja: ビューファイルのレンダリング結果。このパラメーターの更新は、<a href="yii-base-view#renderFile()-detail">renderFile（）</a>によって返され、返されます。
ru: Результат рендеринга файла представления. Обновления этого параметра будут переданы обратно и возвращены <a href="yii-base-view#renderFile()-detail">функцией renderFile ()</a> .

source: The rendering result of the widget.
ja: ウィジェットのレンダリング結果。
ru: Результат рендеринга виджета.

source: The rendering result.
ja: レンダリング結果です。
ru: Результат рендеринга.

source: The rendering result. If the attributes are not empty, they will be rendered into a string with a leading white space (so that it can be directly appended to the tag name in a tag. If there is no attribute, an empty string will be returned.
ja: レンダリング結果です。属性が空でなければ、先頭に空白を入れた文字列にレンダリングされます(タグ内のタグ名に直接追記できるように)。属性がない場合は、空の文字列が返されます。
ru: Результат рендеринга.Если атрибуты не пустые,они будут отрисовываться в строку с ведущим белым пробелом (так,чтобы их можно было непосредственно добавить к имени тега в теге.Если атрибут отсутствует,то возвращается пустая строка.

source: The rendering result. Null if the rendering result is not required.
ja: レンダリング結果。レンダリング結果が不要な場合はNull。
ru: Результат рендеринга.Нуль,если результат рендеринга не требуется.

source: The rendering toggle button.
ja: レンダリングのトグルボタン。
ru: Кнопка переключения рендеринга.

source: The replacement to use for spaces
ja: スペースのために使用するための置き換え
ru: Замена для использования в пространствах

source: The reply-to address of this message.
ja: このメッセージの返信先アドレスです。
ru: Ответ на адрес данного сообщения.

source: The reply-to address. You may pass an array of addresses if this message should be replied to multiple people. You may also specify reply-to name in addition to email address using format: <code>[email =&gt; name]</code>.
ja: 返信先アドレス。このメッセージを複数の人に返信する必要がある場合は、アドレスの配列を渡すことができます。 <code>[email =&gt; name]</code> 形式を使用して、電子メールアドレスに加えて返信先の名前を指定することもできます。
ru: Адрес для ответа. Вы можете передать массив адресов, если на это сообщение нужно ответить нескольким людям. Вы также можете указать имя для ответа в дополнение к адресу электронной почты, используя формат: <code>[email =&gt; name]</code> .

source: The request GET parameter values.
ja: リクエストのGETパラメータの値です。
ru: Запрос значений GET-параметров.

source: The request URI portion for the currently requested URL. Note that the URI returned may be URL-encoded depending on the client.
ja: 現在リクエストされているURLのリクエストURI部分。返されるURIはクライアントによってはURLエンコードされている可能性があることに注意してください。
ru: Часть URI запроса для запрашиваемого в настоящее время URL.Обратите внимание,что возвращаемый URI может быть закодирован по URL в зависимости от клиента.

source: The request URI to be set
ja: 設定するリクエストURI
ru: Установка URI запроса

source: The request body
ja: リクエストボディ
ru: Орган запроса

source: The request body parameters (name-value pairs)
ja: リクエスト本体のパラメータ(名前と値のペア
ru: Параметры тела запроса (пары имя-значение)

source: The request component
ja: リクエストコンポーネント
ru: Компонент запроса

source: The request component.
ja: リクエストコンポーネントです。
ru: Компонент запроса.

source: The request is sent to the server through a special non-standard HTTP-header. When the web server encounters the presence of such header it will discard all output and send the file specified by that header using web server internals including all optimizations like caching-headers.
ja: リクエストは特別な非標準の HTTP ヘッダを通してサーバに送られます。ウェブサーバがそのようなヘッダの存在に遭遇した場合、すべての出力を破棄し、キャッシングヘッダのようなすべての最適化を含むウェブサーバ内部を使用して、そのヘッダで指定されたファイルを送信します。
ru: Запрос посылается на сервер через специальный нестандартный HTTP-заголовок.Когда веб-сервер сталкивается с таким заголовком,он отбрасывает все выходные данные и посылает файл,указанный в этом заголовке,используя внутреннюю часть веб-сервера,включая все оптимизации,такие как кэширующие заголовки.

source: The request method.
ja: リクエスト方法です。
ru: Способ запроса.

source: The request parameters given in the request body.
ja: リクエストボディで与えられたリクエストパラメータ。
ru: Параметры запроса,заданные в теле запроса.

source: The request query parameters (name-value pairs)
ja: リクエストクエリパラメータ(名前と値のペア)
ru: Параметры запроса (пары имя-значение)

source: The request to be handled
ja: 対応してほしいという要望
ru: Запрос на обработку

source: The requested Action.
ja: 要求されたアクション。
ru: Запрошенное действие.

source: The requested Action. If null, it means the request cannot be resolved into an action.
ja: 要求されたアクション。nullの場合、リクエストをアクションに解決できないことを意味します。
ru: Запрошенное действие.Если он равен нулю,это означает,что запрос не может быть преобразован в Действие.

source: The requested language code
ja: 要求された言語コード
ru: Запрошенный код языка

source: The requested route
ja: ご希望のルート
ru: Запрошенный маршрут

source: The required <code>fixture_name</code> parameter specifies a fixture name which data will be loaded. You can load several fixtures at once. Below are correct formats of this command:
ja: 必須の <code>fixture_name</code> パラメータは、データがロードされるフィクスチャ名を指定します。複数の器具を一度にロードできます。このコマンドの正しい形式は次のとおりです。
ru: Требуется <code>fixture_name</code> параметр определяет приспособление имя , которое будет загружены данные. Вы можете загрузить сразу несколько светильников. Ниже приведены правильные форматы этой команды:

source: The required <code>name</code> argument gives a brief description about the new migration. For example, if the migration is about creating a new table named <em>news</em>, you may use the name <code>create_news_table</code> and run the following command:
ja: 必須の <code>name</code> 引数は、新しい移行に関する簡単な説明を提供します。たとえば、移行で<em>news</em>という名前の新しいテーブルを作成する場合は、 <code>create_news_table</code> という名前を使用して、次のコマンドを実行できます。
ru: Обязательный аргумент <code>name</code> дает краткое описание новой миграции. Например, если миграция касается создания новой таблицы с именем <em>news</em> , вы можете использовать имя <code>create_news_table</code> и выполнить следующую команду:

source: The resolved dependencies
ja: 解決された依存関係
ru: Разрешенные зависимости

source: The resolved dependencies.
ja: 解決された依存関係。
ru: Разрешенные зависимости.

source: The resolved directory name
ja: 解決したディレクトリ名
ru: Имя разрешенной директории

source: The resolved view name
ja: 解決されたビュー名
ru: Имя разрешенного вида

source: The response component.
ja: レスポンス成分です。
ru: Компонент реагирования.

source: The response content.
ja: レスポンスの内容です。
ru: Содержание ответа.

source: The response content. When <a href="yii-web-response#%24data-detail">$data</a> is not null, it will be converted into <a href="yii-web-response#%24content-detail">$content</a> according to <a href="yii-web-response#%24format-detail">$format</a> when the response is being sent out.
ja: 応答コンテンツ。ときに<a href="yii-web-response#%24data-detail">$データが</a> nullではない、それが変換されます<a href="yii-web-response#%24content-detail">$内容</a>に応じて<a href="yii-web-response#%24format-detail">$形式</a>の応答が送信されています。
ru: Содержание ответа. Если <a href="yii-web-response#%24data-detail">$ data</a> не равно нулю, он будет преобразован в <a href="yii-web-response#%24content-detail">$ content в</a> соответствии с <a href="yii-web-response#%24format-detail">форматом $</a> при отправке ответа.

source: The response format.
ja: 応答形式です。
ru: Формат ответа.
