Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/yii/yii.*.022.xlf
Languages: ja, ko, ru

source: The returned \yii\sphinx\ActiveQueryInterface instance can be further customized by calling methods defined in \yii\sphinx\ActiveQueryInterface before <code>one()</code> or <code>all()</code> is called to return populated ActiveRecord instances. For example,
ja: 返された\ yii \ sphinx \ ActiveQueryInterfaceインスタンスは、 <code>one()</code> または <code>all()</code> が呼び出されて設定済みのActiveRecordインスタンスが返される前に、\ yii \ sphinx \ ActiveQueryInterfaceで定義されたメソッドを呼び出すことにより、さらにカスタマイズできます。例えば、
ko: 채워진 ActiveRecord 인스턴스를 리턴 하기 위해 <code>one()</code> 또는 <code>all()</code> 을 호출 하기 전에 \ yii \ sphinx \ ActiveQueryInterface에 정의 된 메소드를 호출하여 리턴 된 \ yii \ sphinx \ ActiveQueryInterface 인스턴스를 추가로 사용자 정의 할 수 있습니다 . 예를 들어
ru: Возвращенный экземпляр \ yii \ sphinx \ ActiveQueryInterface можно дополнительно настроить, вызвав методы, определенные в \ yii \ sphinx \ ActiveQueryInterface, перед вызовом <code>one()</code> или <code>all()</code> для возврата заполненных экземпляров ActiveRecord. Например,

source: The returned value should be an array. The keys are the argument names, and the values are the corresponding help information. Each value must be an array of the following structure:
ja: 返される値は配列でなければなりません。キーは引数名、値は対応するヘルプ情報です。各値は以下の構造の配列でなければなりません。
ko: 반환 된 값은 배열이어야합니다. 키는 인수 이름이고 값은 해당 도움말 정보입니다. 각 값은 다음 구조의 배열이어야합니다.
ru: Возвращаемое значение должно быть массивом.Ключами являются имена аргументов,а значения-соответствующая справочная информация.Каждое значение должно быть массивом следующей структуры:

source: The returned value should be an array. The keys are the option names, and the values are the corresponding help information. Each value must be an array of the following structure:
ja: 返される値は配列でなければなりません。キーはオプション名、値は対応するヘルプ情報です。各値は、以下の構造の配列でなければなりません。
ko: 반환 된 값은 배열이어야합니다. 키는 옵션 이름이고 값은 해당 도움말 정보입니다. 각 값은 다음 구조의 배열이어야합니다.
ru: Возвращаемое значение должно быть массивом.Ключами являются имена опций,а значения-соответствующая справочная информация.Каждое значение должно быть массивом следующей структуры:

source: The reverse process of routing is called <em>URL creation</em>, which creates a URL from a given route and the associated query parameters. When the created URL is later requested, the routing process can resolve it back into the original route and query parameters.
ja: ルーティングの逆のプロセスは<em>URL作成</em>と呼ばれ、特定のルートと関連するクエリパラメータからURLを作成します。作成されたURLが後で要求されると、ルーティングプロセスはそれを元のルートおよびクエリパラメータに解決できます。
ko: 라우팅의 반대 과정을 <em>URL 작성</em> 이라고 하며, 지정된 경로 및 관련 쿼리 매개 변수에서 URL을 만듭니다. 생성 된 URL을 나중에 요청하면 라우팅 프로세스에서 URL을 원래 경로 및 쿼리 매개 변수로 다시 확인할 수 있습니다.
ru: Обратный процесс маршрутизации называется <em>созданием URL-адреса</em> , при котором создается URL-адрес из заданного маршрута и связанных параметров запроса. Когда позже будет запрошен созданный URL-адрес, процесс маршрутизации может разрешить его обратно в исходный маршрут и параметры запроса.

source: The role assignment information.
ja: 役割分担情報です。
ko: 역할 할당 정보
ru: Информация о распределении ролей.

source: The role corresponding to the specified name. Null is returned if no such role.
ja: 指定された名前に対応するロール。そのようなロールがない場合はNullを返します。
ko: 지정된 이름에 해당하는 역할 그러한 역할이 없으면 널이 리턴됩니다.
ru: Роль,соответствующая указанному имени.Нуль возвращается,если такой роли нет.

source: The role name
ja: 役割名
ko: 역할 이름
ru: Название роли

source: The role name.
ja: 役名です。
ko: 역할 이름
ru: Название роли.

source: The role or permission that this rule is associated with
ja: このルールが関連付けられているロールまたはパーミッション
ko: 이 규칙과 관련된 역할 또는 권한
ru: Роль или разрешение,с которым связано данное правило

source: The root alias, or false if no root alias is found
ja: ルートエイリアス、またはルートエイリアスが見つからない場合は false
ko: 루트 별명. 루트 별명이 없으면 false
ru: Псевдоним корня,или ложный,если псевдоним корня не найден.

source: The root directory of layout files.
ja: レイアウトファイルのルートディレクトリです。
ko: 레이아웃 파일의 루트 디렉토리
ru: Корневой каталог файлов макетов.

source: The root directory of layout files. Defaults to "<a href="yii-base-module#%24viewPath-detail">$viewPath</a>/layouts".
ja: レイアウトファイルのルートディレクトリ。デフォルトは " <a href="yii-base-module#%24viewPath-detail">$ viewPath</a> / layouts"です。
ko: 레이아웃 파일의 루트 디렉토리 기본값은 " <a href="yii-base-module#%24viewPath-detail">$ viewPath</a> / layouts"입니다.
ru: Корневой каталог файлов макета. По умолчанию " <a href="yii-base-module#%24viewPath-detail">$ viewPath</a> / layouts".

source: The root directory of the application.
ja: アプリケーションのルートディレクトリ。
ko: 응용 프로그램의 루트 디렉토리
ru: Корневой каталог приложения.

source: The root directory of the module.
ja: モジュールのルートディレクトリ。
ko: 모듈의 루트 디렉토리
ru: Корневой каталог модуля.

source: The root directory of the module. This can be either a directory name or a <a href="guide-concept-aliases">path alias</a>.
ja: モジュールのルートディレクトリ。これは、ディレクトリ名または<a href="guide-concept-aliases">パスエイリアスの</a>いずれかです。
ko: 모듈의 루트 디렉토리 디렉토리 이름 또는 <a href="guide-concept-aliases">경로 별명 일 수</a> 있습니다.
ru: Корневой каталог модуля. Это может быть имя каталога или <a href="guide-concept-aliases">псевдоним пути</a> .

source: The root directory of view files.
ja: ビューファイルのルートディレクトリ。
ko: 뷰 파일의 루트 디렉토리.
ru: Корневой каталог файлов просмотра.

source: The root directory of view files. Defaults to "<a href="yii-base-module#%24basePath-detail">$basePath</a>/views".
ja: ビューファイルのルートディレクトリ。デフォルトは " <a href="yii-base-module#%24basePath-detail">$ basePath</a> / views"です。
ko: 뷰 파일의 루트 디렉토리. 기본값은 " <a href="yii-base-module#%24basePath-detail">$ basePath</a> / views"입니다.
ru: Корневой каталог файлов просмотра. По умолчанию " <a href="yii-base-module#%24basePath-detail">$ basePath</a> / views".

source: The root directory or <a href="guide-concept-aliases">path alias</a> of layout files.
ja: レイアウトファイルのルートディレクトリまたは<a href="guide-concept-aliases">パスエイリアス</a>。
ko: 레이아웃 파일 의 루트 디렉토리 또는 <a href="guide-concept-aliases">경로 별명</a> .
ru: Корневой каталог или <a href="guide-concept-aliases">псевдоним пути</a> к файлам макета.

source: The root directory storing the published asset files.
ja: 公開されているアセットファイルを格納するルートディレクトリ。
ko: 게시 된 자산 파일을 저장하는 루트 디렉토리입니다.
ru: Корневая директория,в которой хранятся файлы опубликованных активов.

source: The root path of the template files that are currently being used.
ja: 現在使用しているテンプレートファイルのルートパスです。
ko: 현재 사용중인 템플릿 파일의 루트 경로입니다.
ru: Корневой путь к файлам шаблонов,которые используются в настоящее время.

source: The root path of this theme.
ja: このテーマのルートパス。
ko: 이 테마의 루트 경로입니다.
ru: Коренной путь этой темы.

source: The root path of this theme. All resources of this theme are located under this directory.
ja: このテーマのルートパスです。このテーマのすべてのリソースはこのディレクトリの下にあります。
ko: 이 테마의 루트 경로입니다. 이 테마의 모든 자원은이 디렉토리 아래에 있습니다.
ru: Коренной путь этой темы.Все ресурсы этой темы находятся под этой директорией.

source: The root path or <a href="guide-concept-aliases">path alias</a> of this theme. All resources of this theme are located under this directory.
ja: このテーマのルートパスまたは<a href="guide-concept-aliases">パスエイリアス</a>。このテーマのすべてのリソースは、このディレクトリの下にあります。
ko: 이 테마 의 루트 경로 또는 <a href="guide-concept-aliases">경로 별명 </a>이 테마의 모든 자원은이 디렉토리 아래에 있습니다.
ru: Корневой путь или <a href="guide-concept-aliases">псевдоним пути</a> к этой теме. Все ресурсы этой темы находятся в этом каталоге.

source: The root path to the default code template files.
ja: デフォルトのコードテンプレートファイルのルートパス。
ko: 기본 코드 템플릿 파일의 루트 경로입니다.
ru: Корневой путь к файлам шаблонов кода по умолчанию.

source: The route (controller ID and action ID, e.g. <code>site/about</code>) to this page.
ja: このページへのルート（コントローラーIDとアクションID、たとえば <code>site/about</code> ）。
ko: 이 페이지 <code>site/about</code> 경로 (컨트롤러 ID 및 작업 ID (예 : site / about ))
ru: Маршрут (ID контроллера и ID действия, например <code>site/about</code> ) к этой странице.

source: The route (controller ID and action ID, e.g. <code>site/about</code>) to this page. Use array to represent a route with GET parameters. The first element of the array represents the route and the rest of the name-value pairs are treated as GET parameters, e.g. <code>array('site/page', 'name' =&gt; 'about')</code>.
ja: このページへのルート（コントローラーIDとアクションID、たとえば <code>site/about</code> ）。配列を使用して、GETパラメーターでルートを表します。配列の最初の要素はルートを表し、名前と値のペアの残りはGETパラメーターとして扱われます（例： <code>array('site/page', 'name' =&gt; 'about')</code> 。
ko: 이 페이지 <code>site/about</code> 경로 (컨트롤러 ID 및 작업 ID (예 : site / about )) 배열을 사용하여 GET 매개 변수가있는 경로를 나타냅니다. 배열의 첫 번째 요소는 경로를 나타내고 나머지 이름-값 쌍은 GET 매개 변수로 처리됩니다 <code>array('site/page', 'name' =&gt; 'about')</code> 예 : array ( 'site / page', 'name'=&gt; 'about')) .
ru: Маршрут (ID контроллера и ID действия, например <code>site/about</code> ) к этой странице. Используйте массив для представления маршрута с параметрами GET. Первый элемент массива представляет маршрут, а остальные пары имя-значение обрабатываются как параметры GET, например <code>array('site/page', 'name' =&gt; 'about')</code> .

source: The route (e.g. <code>site/error</code>) to the controller action that will be used to display external errors.
ja: 外部エラーを表示するために使用されるコントローラーアクションへのルート（例： <code>site/error</code> ）。
ko: 외부 오류를 표시하는 데 사용될 컨트롤러 작업에 대한 경로 (예 : <code>site/error</code> ).
ru: Маршрут (например, <code>site/error</code> ) к действию контроллера, которое будет использоваться для отображения внешних ошибок.

source: The route (e.g. <code>site/error</code>) to the controller action that will be used to display external errors. Inside the action, it can retrieve the error information using <code>Yii::$app-&gt;errorHandler-&gt;exception</code>. This property defaults to null, meaning ErrorHandler will handle the error display.
ja: 外部エラーを表示するために使用されるコントローラーアクションへのルート（例： <code>site/error</code> ）。アクション内では、 <code>Yii::$app-&gt;errorHandler-&gt;exception</code> を使用してエラー情報を取得できます。このプロパティのデフォルトはnullです。つまり、ErrorHandlerがエラー表示を処理します。
ko: 외부 오류를 표시하는 데 사용될 컨트롤러 작업에 대한 경로 (예 : <code>site/error</code> ). 작업 내에서 <code>Yii::$app-&gt;errorHandler-&gt;exception</code> 사용하여 오류 정보를 검색 할 수 있습니다 . 이 속성의 기본값은 null입니다. 즉, ErrorHandler가 오류 표시를 처리합니다.
ru: Маршрут (например, <code>site/error</code> ) к действию контроллера, которое будет использоваться для отображения внешних ошибок. Внутри действия он может получить информацию об ошибке с помощью <code>Yii::$app-&gt;errorHandler-&gt;exception</code> . По умолчанию это свойство равно null, что означает, что ErrorHandler будет обрабатывать отображение ошибок.

source: The route (e.g. <code>site/index</code>).
ja: ルート（例： <code>site/index</code> ）。
ko: 경로 (예 : <code>site/index</code> )
ru: Маршрут (например, <code>site/index</code> ).

source: The route (module ID, controller ID and action ID) of the current request.
ja: 現在のリクエストのルート(モジュールID、コントローラID、アクションID)。
ko: 현재 요청의 경로 (모듈 ID, 컨트롤러 ID 및 작업 ID)
ru: Маршрут (ID модуля,ID контроллера и ID действия)текущего запроса.

source: The route and the associated parameters. The latter is always empty if <a href="yii-web-urlmanager#%24enablePrettyUrl-detail">$enablePrettyUrl</a> is <code>false</code>. <code>false</code> is returned if the current request cannot be successfully parsed.
ja: ルートと関連パラメータ。<a href="yii-web-urlmanager#%24enablePrettyUrl-detail">$ enablePrettyUrl</a>が <code>false</code> の場合、後者は常に空です。現在のリクエストを正常に解析できない場合は <code>false</code> が返されます。
ko: 경로 및 관련 매개 변수 <a href="yii-web-urlmanager#%24enablePrettyUrl-detail">$ enablePrettyUrl</a> 이 <code>false</code> 인 경우 후자는 항상 비어 있습니다. 현재 요청을 구문 분석 할 수 없으면 <code>false</code> 가 리턴됩니다.
ru: Маршрут и связанные параметры. Последний всегда пуст, если <a href="yii-web-urlmanager#%24enablePrettyUrl-detail">$ enablePrettyUrl</a> имеет значение <code>false</code> . <code>false</code> возвращается, если текущий запрос не может быть успешно проанализирован.

source: The route can be either an ID of an action within this controller or a complete route consisting of module IDs, controller ID and action ID. If the route starts with a slash '/', the parsing of the route will start from the application; otherwise, it will start from the parent module of this controller.
ja: ルートは、このコントローラ内のアクションの ID か、モジュール ID、コントローラ ID、アクション ID で構成される完全なルートのいずれかになります。ルートがスラッシュ「/」で始まる場合、ルートの解析はアプリケーションから始まります。
ko: 라우트는이 제어기 내의 조치 ID이거나 모듈 ID, 제어기 ID 및 조치 ID로 구성된 완전한 라우트 일 수 있습니다. 경로가 슬래시 '/'로 시작하면 경로 구문 분석이 응용 프로그램에서 시작됩니다. 그렇지 않으면이 컨트롤러의 상위 모듈에서 시작됩니다.
ru: Маршрут может быть как идентификатором действия внутри данного контроллера,так и полным маршрутом,состоящим из идентификаторов модулей,идентификаторов контроллеров и идентификаторов действий.Если маршрут начинается со слеша "/",то разбор маршрута будет начинаться с приложения,в противном случае-с родительского модуля данного контроллера.

source: The route consisting of module, controller and action IDs.
ja: モジュール、コントローラ、アクションIDからなるルート。
ko: 모듈, 컨트롤러 및 작업 ID로 구성된 경로입니다.
ru: Маршрут,состоящий из идентификаторов модуля,контроллера и действия.

source: The route of the action that generates the CAPTCHA images.
ja: CAPTCHA画像を生成するアクションのルート。
ko: 보안 문자 이미지를 생성하는 조치의 경로.
ru: Маршрут действия,который генерирует изображения CAPTCHA.

source: The route of the action that generates the CAPTCHA images. The action represented by this route must be an action of <a href="yii-captcha-captchaaction">yii\captcha\CaptchaAction</a>. Please refer to <a href="yii-helpers-baseurl#toRoute()-detail">yii\helpers\Url::toRoute()</a> for acceptable formats.
ja: CAPTCHA画像を生成するアクションのルート。このルートで表されるアクションは、<a href="yii-captcha-captchaaction">yii \ captcha \ CaptchaActionの</a>アクションでなければなりません。許容される形式については、<a href="yii-helpers-baseurl#toRoute()-detail">yii \ helpers \ Url :: toRoute（）</a>を参照してください。
ko: 보안 문자 이미지를 생성하는 조치의 경로. 이 경로로 표시되는 조치는 <a href="yii-captcha-captchaaction">yii \ captcha \ CaptchaAction</a> 조치 여야합니다 . 허용되는 형식은 <a href="yii-helpers-baseurl#toRoute()-detail">yii \ helpers \ Url :: toRoute ()</a> 를 참조하십시오 .
ru: Маршрут действия, генерирующего изображения CAPTCHA. Действие, представленное этим маршрутом, должно быть действием <a href="yii-captcha-captchaaction">yii \ captcha \ CaptchaAction</a> . Пожалуйста, обратитесь к <a href="yii-helpers-baseurl#toRoute()-detail">yii \ helpers \ Url :: toRoute ()</a> для получения информации о допустимых форматах.

source: The route of the command that could not be found.
ja: 見つからなかったコマンドのルート。
ko: 찾을 수없는 명령의 경로입니다.
ru: Маршрут команды,который не был найден.

source: The route of the controller action for displaying the paged contents.
ja: ページ化されたコンテンツを表示するためのコントローラアクションのルート。
ko: 페이징 된 내용을 표시하기위한 컨트롤러 작업의 경로입니다.
ru: Маршрут действий контроллера для отображения содержимого страницы.

source: The route of the controller action for displaying the paged contents. If not set, it means using the currently requested route.
ja: ページングされたコンテンツを表示するためのコントローラアクションのルート。設定されていない場合は、現在要求されているルートを使用することを意味します。
ko: 페이징 된 내용을 표시하기위한 컨트롤러 작업의 경로입니다. 설정하지 않으면 현재 요청 된 경로를 사용하는 것을 의미합니다.
ru: Маршрут действий контроллера для отображения содержимого страницы.Если не установлен,это означает использование запрашиваемого в данный момент маршрута.

source: The route of the controller action for displaying the sorted contents.
ja: ソートされたコンテンツを表示するためのコントローラアクションのルート。
ko: 정렬 된 컨텐츠를 표시하기위한 제어기 조치의 경로.
ru: Маршрут действий контроллера для отображения отсортированного содержимого.

source: The route of the controller action for displaying the sorted contents. If not set, it means using the currently requested route.
ja: ソートされたコンテンツを表示するためのコントローラアクションのルート。設定されていない場合は、現在要求されているルートを使用することを意味します。
ko: 정렬 된 컨텐츠를 표시하기위한 제어기 조치의 경로. 설정하지 않으면 현재 요청 된 경로를 사용하는 것을 의미합니다.
ru: Маршрут действий контроллера для отображения отсортированного содержимого.Если не установлен,это означает использование запрашиваемого в данный момент маршрута.

source: The route of the controller action that renders the CAPTCHA image.
ja: CAPTCHA画像をレンダリングするコントローラアクションのルート。
ko: 보안 문자 이미지를 렌더링하는 컨트롤러 조치의 경로입니다.
ru: Маршрут действия контроллера,который визуализирует изображение CAPTCHA.

source: The route passed to the <a href="yii-helpers-baseurl#to()-detail">yii\helpers\Url::to()</a> method is context sensitive. It can be either a <em>relative</em> route or an <em>absolute</em> route which will be normalized according to the following rules:
ja: <a href="yii-helpers-baseurl#to()-detail">yii \ helpers \ Url :: to（）</a>メソッドに渡されるルートは状況依存です。これは、次のルールに従って正規化される<em>相対</em>ルートまたは<em>絶対</em>ルートのいずれかになります。
ko: <a href="yii-helpers-baseurl#to()-detail">yii \ helpers \ Url :: to ()</a> 메서드에 전달 된 경로는 상황에 따라 다릅니다 . 다음 규칙에 따라 정규화되는 <em>상대</em> 경로 또는 <em>절대</em> 경로 일 수 있습니다 .
ru: Маршрут, передаваемый методу <a href="yii-helpers-baseurl#to()-detail">yii \ helpers \ Url :: to (),</a> зависит от контекста. Это может быть <em>относительный</em> или <em>абсолютный</em> маршрут, который будет нормализован в соответствии со следующими правилами:

source: The route should be relative to this module. The method implements the following algorithm to resolve the given route:
ja: ルートはこのモジュールからの相対的なものでなければなりません。このメソッドは、与えられたルートを解決するために以下のアルゴリズムを実装しています。
ko: 경로는이 모듈과 관련이 있어야합니다. 이 메소드는 주어진 경로를 해결하기 위해 다음 알고리즘을 구현합니다.
ru: Маршрут должен быть относительно этого модуля.Метод реализует следующий алгоритм решения данного маршрута:

source: The route that specifies the action.
ja: アクションを指定するルート。
ko: 동작을 지정하는 경로입니다.
ru: Маршрут,который определяет действие.

source: The route to be handled, e.g., 'view', 'comment/view', '/admin/comment/view'.
ja: 扱うルート、例えば、'view'、'comment/view'、'/admin/comment/view'。
ko: 처리 할 경로 (예 : 'view', 'comment / view', '/ admin / comment / view')
ru: Маршрут,который необходимо обработать,например,'просмотр','комментарий/просмотр','/админ/комментарий/просмотр'.

source: The route to the controller action
ja: コントローラアクションへのルート
ko: 컨트롤러 작업으로의 경로
ru: Маршрут к действию контроллера

source: The route used to determine if a menu item is active or not.
ja: メニュー項目がアクティブかどうかを判断するために使用するルート。
ko: 메뉴 항목의 활성화 여부를 결정하는 데 사용되는 경로입니다.
ru: Маршрут,используемый для определения,активен тот или иной пункт меню или нет.

source: The route used to determine if a menu item is active or not. If not set, it will use the route of the current request.
ja: メニュー項目がアクティブかどうかを判断するために使用されるルート。設定されていない場合は、現在のリクエストのルートを使用します。
ko: 메뉴 항목의 활성화 여부를 결정하는 데 사용되는 경로입니다. 설정하지 않으면 현재 요청의 경로를 사용합니다.
ru: Маршрут,используемый для определения,активен тот или иной пункт меню или нет.Если он не установлен,он будет использовать маршрут текущего запроса.

source: The route. It should not have slashes at the beginning or the end.
ja: ルートです。最初と最後にスラッシュを入れてはいけません。
ko: 경로. 시작 또는 끝에 슬래시가 없어야합니다.
ru: Маршрут.Он не должен иметь косых черт в начале или в конце.

source: The route. This can be either an absolute route or a relative route.
ja: ルートです。これは絶対ルートか相対ルートのどちらかになります。
ko: 경로. 이것은 절대 경로이거나 상대 경로 일 수 있습니다.
ru: Маршрут.Это может быть как абсолютный маршрут,так и относительный маршрут.

source: The row ID of the last row inserted, or the last value retrieved from the sequence object
ja: 最後に挿入された行の行 ID、あるいはシーケンスオブジェクトから取得された最後の値。
ko: 삽입 된 마지막 행의 행 ID 또는 시퀀스 오브젝트에서 검색된 마지막 값
ru: Идентификатор последней вставленной строки,или последнее значение,полученное из объекта последовательности

source: The rows to be batch inserted into the index
ja: インデックスに一括挿入される行
ko: 인덱스에 일괄 삽입 할 행
ru: Строки,которые будут вставлены в индекс.

source: The rows to be batch inserted into the table
ja: テーブルに一括挿入される行
ko: 테이블에 일괄 삽입 할 행
ru: Строки,которые будут вставлены в таблицу партиями

source: The rows to be batch replaced in the index
ja: インデックスで一括置換される行
ko: 인덱스에서 일괄 교체 할 행
ru: Строки,подлежащие пакетной замене в индексе

source: The rule above checks if the <code>post</code> is created by <code>$user</code>. We'll create a special permission <code>updateOwnPost</code> in the command we've used previously:
ja: 上記のルールは、 <code>post</code> が <code>$user</code> によって作成されたかどうかをチェックします。以前に使用したコマンドで、特別な権限 <code>updateOwnPost</code> を作成します。
ko: 위의 규칙 은 <code>$user</code> 가 <code>post</code> 을 작성 했는지 확인합니다 . 이전에 사용한 명령에서 특별한 권한 <code>updateOwnPost</code> 를 만듭니다 .
ru: Приведенное выше правило проверяет, создан ли <code>post</code> пользователем <code>$user</code> . Мы создадим специальное разрешение <code>updateOwnPost</code> в команде, которую мы использовали ранее:

source: The rule declarations. Each array element represents a single rule declaration. Please refer to <a href="yii-web-urlmanager#%24rules-detail">$rules</a> for the acceptable rule formats.
ja: ルール宣言。各配列要素は、単一のルール宣言を表します。使用可能なルールの形式については、<a href="yii-web-urlmanager#%24rules-detail">$ rules</a>を参照してください。
ko: 규칙 선언. 각 배열 요소는 단일 규칙 선언을 나타냅니다. 허용되는 규칙 형식은 <a href="yii-web-urlmanager#%24rules-detail">$ rules</a> 를 참조하십시오 .
ru: Объявление правил. Каждый элемент массива представляет собой одно объявление правила. Пожалуйста, обратитесь к <a href="yii-web-urlmanager#%24rules-detail">$ rules</a> для получения информации о приемлемых форматах правил.

source: The rule name
ja: ルール名
ko: 규칙 이름
ru: Имя правила

source: The rule object, or null if the specified name does not correspond to a rule.
ja: 指定した名前がルールに対応していない場合はNULLとなります。
ko: 규칙 객체. 지정된 이름이 규칙과 일치하지 않으면 null입니다.
ru: Объект правила,или ноль,если указанное имя не соответствует правилу.

source: The rule objects built from the given rule declarations
ja: 与えられたルール宣言から構築されたルールオブジェクト
ko: 주어진 규칙 선언에서 작성된 규칙 객체
ru: Объекты правила,построенные из данных деклараций правил

source: The rule to add
ja: 追加するルール
ko: 추가 할 규칙
ru: Правило добавления

source: The rule to remove
ja: 除去するためのルール
ko: 제거 할 규칙
ru: Правило удаления

source: The rule which defines who allowed to switch user identity.
ja: 誰がユーザーIDを切り替えることを許可するかを定義するルールです。
ko: 사용자 ID 전환을 허용 한 사람을 정의하는 규칙입니다.
ru: Правило,определяющее,кто разрешил изменять идентификационные данные пользователей.

source: The rule which defines who allowed to switch user identity. Access Control Filter single rule. Ignore: actions, controllers, verbs. Settable: allow, roles, ips, matchCallback, denyCallback. By default deny for everyone. Recommendation: can allow for administrator or developer (if implement) role: ['allow' =&gt; true, 'roles' =&gt; ['admin']]
ja: ユーザーIDの切り替えを許可するユーザーを定義するルール。アクセス制御フィルターの単一ルール。無視：アクション、コントローラー、動詞。設定可能：許可、役割、ips、matchCallback、denyCallback。デフォルトでは、すべてのユーザーを拒否します。推奨事項：管理者または開発者（実装する場合）の役割を許可できます：['allow' =&gt; true、 'roles' =&gt; ['admin']]
ko: 사용자 ID 전환을 허용 한 사람을 정의하는 규칙입니다. 액세스 제어 필터 단일 규칙. 무시 : 조치, 제어기, 동사. 설정 가능 : allow, 역할, ips, matchCallback, denyCallback 기본적으로 모든 사람을 거부합니다. 권장 사항 : 관리자 또는 개발자 (구현하는 경우) 역할 허용 : [ 'allow'=&gt; true, 'roles'=&gt; [ 'admin']]
ru: Правило, определяющее, кому разрешено переключать личность пользователя. Единое правило фильтра контроля доступа. Игнорировать: действия, контроллеры, глаголы. Настраиваемые: разрешить, роли, IPS, matchCallback, denyCallback. По умолчанию запретить всем. Рекомендация: можно разрешить роль администратора или разработчика (если реализована): ['allow' =&gt; true, 'roles' =&gt; ['admin']]

source: The rules contained within this composite rule.
ja: この複合ルールに含まれるルール。
ko: 이 복합 규칙에 포함 된 규칙.
ru: Правила,содержащиеся в этом сводном правиле.

source: The rules contained within this composite rule. Please refer to <a href="yii-web-urlmanager#%24rules-detail">yii\web\UrlManager::$rules</a> for the format of this property.
ja: この複合ルールに含まれるルール。このプロパティの形式については、<a href="yii-web-urlmanager#%24rules-detail">yii \ web \ UrlManager :: $ rules</a>を参照してください。
ko: 이 복합 규칙에 포함 된 규칙. 이 프로퍼티의 형식에 대해서는 <a href="yii-web-urlmanager#%24rules-detail">yii \ web \ UrlManager :: $ rules</a> 를 참조하십시오 .
ru: Правила, содержащиеся в этом составном правиле. Пожалуйста, обратитесь к <a href="yii-web-urlmanager#%24rules-detail">правилам yii \ web \ UrlManager :: $,</a> чтобы узнать о формате этого свойства.

source: The rules for converting a word into its plural form.
ja: 単語を複数形に変換するためのルール。
ko: 단어를 복수형으로 변환하는 규칙.
ru: Правила преобразования слова во множественное число.
