Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/yii/yii.*.022.xlf
Languages: ja, ko, ru

source: This can be "short", "medium", "long", or "full", which represents a preset format of different lengths. It can also be a custom format as specified in the <a href="http://userguide.icu-project.org/formatparse/datetime">ICU manual</a>.
ja: これは、「長さ」、「中」、「長」、「長さ」のいずれかで、さまざまな長さの事前設定された形式を表します。<a href="http://userguide.icu-project.org/formatparse/datetime">ICUマニュアルで</a>指定されているカスタム形式にすることもできます。
ko: 이것은 "짧은", "중간", "긴"또는 "전체"일 수 있으며 길이가 다른 사전 설정 형식을 나타냅니다. <a href="http://userguide.icu-project.org/formatparse/datetime">ICU 매뉴얼에</a> 지정된 사용자 정의 형식 일 수도 있습니다 .
ru: Это может быть &laquo;короткий&raquo;, &laquo;средний&raquo;, &laquo;длинный&raquo; или &laquo;полный&raquo;, что представляет собой предварительно установленный формат разной длины. Это также может быть пользовательский формат, как указано в руководстве <a href="http://userguide.icu-project.org/formatparse/datetime">ICU</a> .

source: This can be <code>false</code> to leave the progress bar on screen and just print a newline. If set to <code>true</code>, the line of the progress bar will be cleared. This may also be a string to be displayed instead of the progress bar.
ja: 画面にプログレスバーを残し、改行を印刷するだけの場合、これは <code>false</code> になる可能性があります。 <code>true</code> に設定すると、進行状況バーの線がクリアされます。これは、プログレスバーの代わりに表示される文字列でもかまいません。
ko: 진행률 표시 줄을 화면에 그대로두고 개행을 인쇄하는 경우에는 <code>false</code> 수 있습니다 . <code>true</code> 로 설정 하면 진행률 표시 줄이 지워집니다. 진행률 표시 줄 대신 표시 될 문자열 일 수도 있습니다.
ru: Это может быть <code>false</code> , чтобы оставить индикатор выполнения на экране и просто распечатать новую строку. Если установлено значение <code>true</code> , строка индикатора выполнения будет очищена. Это также может быть строка, отображаемая вместо индикатора выполнения.

source: This can be any value that may be passed to <a href="http://www.php.net/manual/en/function.date-default-timezone-set.php">date_default_timezone_set()</a> e.g. <code>UTC</code>, <code>Europe/Berlin</code> or <code>America/Chicago</code>. Refer to the <a href="http://www.php.net/manual/en/timezones.php">php manual</a> for available time zones. If this property is not set, <a href="yii-base-application#%24timeZone-detail">yii\base\Application::$timeZone</a> will be used.
ja: これは、<a href="http://www.php.net/manual/en/function.date-default-timezone-set.php">date_default_timezone_set（）に</a>渡すことができる任意の値にすることができます（例： <code>UTC</code> 、 <code>Europe/Berlin</code> または <code>America/Chicago</code> )。利用可能なタイムゾーンについては、<a href="http://www.php.net/manual/en/timezones.php">phpのマニュアル</a>を参照してください。このプロパティが設定されていない場合、<a href="yii-base-application#%24timeZone-detail">yii \ base \ Application :: $ timeZone</a>が使用されます。
ko: 이는 전달 될 수있는 값이 될 수 있습니다 <a href="http://www.php.net/manual/en/function.date-default-timezone-set.php">) (date_default_timezone_set</a> 예를 들어, <code>UTC</code> , <code>Europe/Berlin</code> 또는 <code>America/Chicago</code> . <a href="http://www.php.net/manual/en/timezones.php">사용</a> 가능한 시간대 는 php 매뉴얼 을 참조하십시오 . 이 속성을 설정하지 않으면 <a href="yii-base-application#%24timeZone-detail">yii \ base \ Application :: $ timeZone</a> 이 사용됩니다.
ru: Это может быть любое значение, которое может быть передано в <a href="http://www.php.net/manual/en/function.date-default-timezone-set.php">date_default_timezone_set (),</a> например, <code>UTC</code> , <code>Europe/Berlin</code> или <code>America/Chicago</code> . Обратитесь к <a href="http://www.php.net/manual/en/timezones.php">руководству</a> по php, чтобы узнать о доступных часовых поясах. Если это свойство не установлено, будет использоваться <a href="yii-base-application#%24timeZone-detail">yii \ base \ Application :: $ timeZone</a> .

source: This can be any value that may be passed to <a href="http://www.php.net/manual/en/function.date-default-timezone-set.php">date_default_timezone_set()</a> e.g. <code>UTC</code>, <code>Europe/Berlin</code> or <code>America/Chicago</code>. Refer to the <a href="http://www.php.net/manual/en/timezones.php">php manual</a> for available timezones.
ja: これは、<a href="http://www.php.net/manual/en/function.date-default-timezone-set.php">date_default_timezone_set（）に</a>渡すことができる任意の値にすることができます（例： <code>UTC</code> 、 <code>Europe/Berlin</code> または <code>America/Chicago</code> )。利用可能なタイムゾーンについては、<a href="http://www.php.net/manual/en/timezones.php">phpのマニュアル</a>を参照してください。
ko: 이는 전달 될 수있는 값이 될 수 있습니다 <a href="http://www.php.net/manual/en/function.date-default-timezone-set.php">) (date_default_timezone_set</a> 예를 들어, <code>UTC</code> , <code>Europe/Berlin</code> 또는 <code>America/Chicago</code> . <a href="http://www.php.net/manual/en/timezones.php">사용</a> 가능한 시간대 는 PHP 설명서 를 참조하십시오 .
ru: Это может быть любое значение, которое может быть передано в <a href="http://www.php.net/manual/en/function.date-default-timezone-set.php">date_default_timezone_set (),</a> например, <code>UTC</code> , <code>Europe/Berlin</code> или <code>America/Chicago</code> . Обратитесь к <a href="http://www.php.net/manual/en/timezones.php">руководству</a> по php, чтобы узнать о доступных часовых поясах.

source: This can be faster than getting the value from the cache if the data is big. In case a cache does not support this feature natively, this method will try to simulate it but has no performance improvement over getting it. Note that this method does not check whether the dependency associated with the cached data, if there is any, has changed. So a call to <a href="yii-caching-cache#get()-detail">get()</a> may return false while exists returns true.
ja: これは、データが大きい場合にキャッシュから値を取得するよりも高速です。キャッシュがこの機能をネイティブでサポートしていない場合、このメソッドはキャッシュをシミュレートしようとしますが、取得することによるパフォーマンスの向上はありません。このメソッドは、キャッシュされたデータに関連付けられている依存関係がある場合、それに依存しているかどうかをチェックしないことに注意してください。したがって、gets <a href="yii-caching-cache#get()-detail">（）の</a>呼び出しは、existsがtrueを返す一方でfalseを返す場合があります。
ko: 데이터가 큰 경우 캐시에서 값을 얻는 것보다 빠를 수 있습니다. 캐시가이 기능을 기본적으로 지원하지 않는 경우,이 방법은이를 시뮬레이션하려고 시도하지만 가져 오는 것보다 성능이 향상되지 않습니다. 이 방법은 캐시 된 데이터와 관련된 종속성 (있는 경우)이 변경되었는지 여부를 확인하지 않습니다. 따라서 <a href="yii-caching-cache#get()-detail">get ()에</a> 대한 호출 은 false를 반환 할 수 있지만 exist는 true를 반환합니다.
ru: Это может быть быстрее, чем получение значения из кеша, если данные большие. Если кеш не поддерживает эту функцию изначально, этот метод попытается смоделировать ее, но не улучшит производительность по сравнению с ее получением. Обратите внимание, что этот метод не проверяет, изменилась ли зависимость, связанная с кэшированными данными, если таковая имеется. Таким образом, вызов <a href="yii-caching-cache#get()-detail">get ()</a> может вернуть false, а exists возвращает true.

source: This can be faster than getting the value from the cache if the data is big. In case a cache does not support this feature natively, this method will try to simulate it but has no performance improvement over getting it. Note that this method does not check whether the dependency associated with the cached data, if there is any, has changed. So a call to <a href="yii-caching-cacheinterface#get()-detail">get()</a> may return false while exists returns true.
ja: これは、データが大きい場合にキャッシュから値を取得するよりも高速です。キャッシュがこの機能をネイティブでサポートしていない場合、このメソッドはキャッシュをシミュレートしようとしますが、取得することによるパフォーマンスの向上はありません。このメソッドは、キャッシュされたデータに関連付けられている依存関係がある場合、それに依存しているかどうかをチェックしないことに注意してください。したがって、gets <a href="yii-caching-cacheinterface#get()-detail">（）の</a>呼び出しは、existsがtrueを返す一方でfalseを返す場合があります。
ko: 데이터가 큰 경우 캐시에서 값을 얻는 것보다 빠를 수 있습니다. 캐시가이 기능을 기본적으로 지원하지 않는 경우,이 방법은이를 시뮬레이션하려고 시도하지만 가져 오는 것보다 성능이 향상되지 않습니다. 이 방법은 캐시 된 데이터와 관련된 종속성 (있는 경우)이 변경되었는지 여부를 확인하지 않습니다. 따라서 <a href="yii-caching-cacheinterface#get()-detail">get ()에</a> 대한 호출 은 false를 반환 할 수 있지만 exist는 true를 반환합니다.
ru: Это может быть быстрее, чем получение значения из кеша, если данные большие. Если кеш не поддерживает эту функцию изначально, этот метод попытается смоделировать ее, но не улучшит производительность по сравнению с ее получением. Обратите внимание, что этот метод не проверяет, изменилась ли зависимость, связанная с кэшированными данными, если таковая имеется. Таким образом, вызов <a href="yii-caching-cacheinterface#get()-detail">get ()</a> может вернуть false, а exists возвращает true.

source: This can be faster than getting the value from the cache if the data is big. Note that this method does not check whether the dependency associated with the cached data, if there is any, has changed. So a call to <a href="yii-caching-cache#get()-detail">get()</a> may return false while exists returns true.
ja: これは、データが大きい場合にキャッシュから値を取得するよりも高速です。このメソッドは、キャッシュされたデータに関連付けられている依存関係がある場合、それに依存しているかどうかをチェックしないことに注意してください。したがって、gets <a href="yii-caching-cache#get()-detail">（）の</a>呼び出しは、existsがtrueを返す一方でfalseを返す場合があります。
ko: 데이터가 큰 경우 캐시에서 값을 얻는 것보다 빠를 수 있습니다. 이 방법은 캐시 된 데이터와 관련된 종속성 (있는 경우)이 변경되었는지 여부를 확인하지 않습니다. 따라서 <a href="yii-caching-cache#get()-detail">get ()에</a> 대한 호출 은 false를 반환 할 수 있지만 exist는 true를 반환합니다.
ru: Это может быть быстрее, чем получение значения из кеша, если данные большие. Обратите внимание, что этот метод не проверяет, изменилась ли зависимость, связанная с кэшированными данными, если таковая имеется. Таким образом, вызов <a href="yii-caching-cache#get()-detail">get ()</a> может вернуть false, а exists возвращает true.

source: This can be one of the following:
ja: これは以下のいずれかになります。
ko: 이것은 다음 중 하나 일 수 있습니다.
ru: Это может быть одним из следующих:

source: This can be the same attribute as the one being validated. If this is the case, the original value will be overwritten with the timestamp value after successful validation.
ja: これは検証されている属性と同じ属性である可能性があります。この場合、検証が成功した後、元の値はタイムスタンプの値で上書きされます。
ko: 이것은 검증되는 것과 동일한 속성 일 수 있습니다. 이 경우 유효성 검사에 성공하면 원래 값을 타임 스탬프 값으로 덮어 씁니다.
ru: Это может быть тот же самый атрибут,что и проверяемый.В этом случае исходное значение после успешной проверки будет перезаписано значением метки времени.

source: This can be the same attribute as the one being validated. If this is the case, the original value will be overwritten with the value after successful validation.
ja: これは検証対象の属性と同じ属性である可能性があります。この場合、検証が成功した後に元の値が上書きされます。
ko: 이것은 검증되는 것과 동일한 속성 일 수 있습니다. 이 경우 유효성 검사에 성공한 후 원래 값을 해당 값으로 덮어 씁니다.
ru: Это может быть тот же самый атрибут,что и проверяемый.В этом случае исходное значение после успешной проверки будет перезаписано значением.

source: This can be useful for parsing small comments or description lines.
ja: 小さなコメントや説明文の行を解析するのに便利です。
ko: 작은 주석 또는 설명 줄을 구문 분석하는 데 유용 할 수 있습니다.
ru: Это может быть полезно при разборе небольших комментариев или строк описания.

source: This class adds some useful features to <a href="yii-widgets-activefield">ActiveField</a> to render all sorts of Bootstrap 3 form fields in different form layouts:
ja: このクラスはいくつかの便利な機能を<a href="yii-widgets-activefield">ActiveField</a>に追加して、あらゆる種類のBootstrap 3フォームフィールドを異なるフォームレイアウトでレンダリングします。
ko: 이 클래스는 <a href="yii-widgets-activefield">ActiveField</a> 에 유용한 기능을 추가 하여 모든 종류의 Bootstrap 3 양식 필드를 다른 양식 레이아웃으로 렌더링합니다.
ru: Этот класс добавляет некоторые полезные функции в <a href="yii-widgets-activefield">ActiveField</a> для отображения всевозможных полей формы Bootstrap 3 в различных макетах форм:

source: This class allows rendering of the check report for the web and console application interface.
ja: このクラスは、Web およびコンソール・アプリケーション・インターフェースのチェック・レポートのレンダリングを可能にします。
ko: 이 클래스를 사용하면 웹 및 콘솔 응용 프로그램 인터페이스에 대한 검사 보고서를 렌더링 할 수 있습니다.
ru: Данный класс позволяет отрисовывать отчет о проверке для веб-интерфейса и интерфейса консольного приложения.

source: This class enhances the message formatter class provided by the PHP intl extension.
ja: このクラスは、PHP intl 拡張モジュールが提供するメッセージフォーマッタクラスを強化します。
ko: 이 클래스는 PHP intl 확장에서 제공하는 메시지 포맷터 클래스를 향상시킵니다.
ru: Этот класс расширяет класс форматирования сообщений,предоставляемый расширением PHP intl.

source: This class implements the ActiveRecord pattern for the <a href="http://redis.io/">redis</a> key-value store.
ja: このクラスは、<a href="http://redis.io/">redis</a>キー値ストアのActiveRecordパターンを実装します。
ko: 이 클래스는 <a href="http://redis.io/">redis</a> 키-값 저장소에 대한 ActiveRecord 패턴을 구현합니다 .
ru: Этот класс реализует шаблон ActiveRecord для <a href="http://redis.io/">хранилища</a> ключей и значений redis .

source: This class implements the ActiveRecord pattern for the fulltext search and data storage <a href="https://www.elastic.co/products/elasticsearch">elasticsearch</a>.
ja: このクラスは、全文検索およびデータストレージ<a href="https://www.elastic.co/products/elasticsearch">elasticsearch</a>のActiveRecordパターンを実装します。
ko: 이 클래스는 전체 텍스트 검색 및 데이터 저장소 <a href="https://www.elastic.co/products/elasticsearch">elasticsearch에</a> 대한 ActiveRecord 패턴을 구현합니다 .
ru: Этот класс реализует шаблон ActiveRecord для полнотекстового поиска и <a href="https://www.elastic.co/products/elasticsearch">эластичного</a> поиска данных .

source: This class inherits all functionality available at <a href="yii-helpers-html">yii\helpers\Html</a> and can be used as substitute.
ja: このクラスは<a href="yii-helpers-html">yii \ helpers \ Html</a>で利用可能なすべての機能を継承し、代替として使用できます。
ko: 이 클래스는 <a href="yii-helpers-html">yii \ helpers \ Html</a> 에서 사용 가능한 모든 기능을 상속 하며 대체 기능으로 사용할 수 있습니다.
ru: Этот класс наследует все функции, доступные в <a href="yii-helpers-html">yii \ helpers \ Html,</a> и может использоваться в качестве замены.

source: This class is required because of the way in which Yii determines whether a property is safe for massive assignment, that is, when a user submits form data to be loaded into a model directly from the POST data, is it ok for a property to be copied. In many cases, this is required but because sometimes properties are internal and you do not want the POST data to be able to override these internal values (especially things like database row ids), Yii assumes all values are unsafe for massive assignment unless a validation rule exists for the property, which in most cases it will. Sometimes, however, an item is safe for massive assigment but does not have a validation rule associated with it - for instance, due to no validation being performed, in which case, you use this class as a validation rule for that property. Although it has no functionality, it allows Yii to determine that the property is safe to copy.
ja: つまり、ユーザがフォームデータを POST データから直接モデルにロードするためにフォームデータを送信した場合、プロパティがコピーされても良いかどうかを判断するためです。多くの場合、これは必須ですが、プロパティが内部的なものであり、POST データがこれらの内部的な値(特にデータベースの行 ID のようなもの)を上書きしたくない場合があるため、Yii は、プロパティのバリデーションルールが存在しない限り、すべての値は大量代入に対して安全ではないと仮定しています(ほとんどの場合は存在します)。しかし、ある項目が大量代入に対して安全であるにも関わらず、それに関連するバリデーションルールを持たない場合があります。このクラスには機能はありませんが、Yii はそのプロパティがコピーしても安全であるかどうかを判断することができます。
ko: 이 클래스는 Yii가 속성이 대규모 할당에 안전한지 여부를 결정하는 방식, 즉 사용자가 POST 데이터에서 직접 모델에로드 할 양식 데이터를 제출할 때 속성이 올바른지 여부에 따라 필요합니다. 복사. 많은 경우에 이것이 필요하지만 때로는 속성이 내부적이며 POST 데이터가 이러한 내부 값 (특히 데이터베이스 행 ID와 같은 것)을 재정의하지 못하도록하기 위해 Yii는 유효성 검사를하지 않으면 모든 값이 대규모 할당에 안전하지 않은 것으로 가정합니다. 대부분의 경우 속성에 대한 규칙이 존재합니다. 그러나 경우에 따라 항목이 대규모 어설 션에 안전하지만 해당 항목과 관련된 유효성 검사 규칙이없는 경우도 있습니다. 예를 들어 유효성 검사가 수행되지 않기 때문에이 클래스를 해당 속성의 유효성 검사 규칙으로 사용합니다. 기능이 없지만그것은 Yii가 그 속성이 복사하기에 안전한지 결정할 수있게한다.
ru: Этот класс необходим из-за того,как Yii определяет,является ли свойство безопасным для массивного присвоения,то есть когда пользователь отправляет данные формы для загрузки в модель непосредственно из POST-данных,допустимо ли копирование свойства.Во многих случаях это необходимо,но поскольку иногда свойства являются внутренними и вы не хотите,чтобы POST-данные могли переопределять эти внутренние значения (особенно такие вещи,как идентификаторы строк базы данных),Yii предполагает,что все значения небезопасны для массивного назначения,если только для свойства не существует правила валидации,которое в большинстве случаев будет существовать.Иногда,однако,элемент безопасен для массивного присвоения,но не имеет связанного с ним правила валидации-например,из-за того,что валидация не выполняется,и в этом случае вы используете данный класс в качестве правила валидации для данного свойства.Хотя он не имеет функциональности,он позволяет Yii определить,что данное свойство безопасно для копирования.

source: This class is written by adapting Michael's Gettext_MO class in PEAR. Please refer to the following license terms.
ja: このクラスは、MichaelのGettext_MOクラスをPEARで翻案して書いたものです。以下のライセンス条項を参照してください。
ko: 이 클래스는 PEAR에서 Michael의 Gettext_MO 클래스를 조정하여 작성되었습니다. 다음 라이센스 조건을 참조하십시오.
ru: Этот класс написан путем адаптации класса Gettext_MO Майкла в PEAR.Пожалуйста,ознакомьтесь со следующими лицензионными условиями.

source: This class mainly adds the <a href="yii-bootstrap-activeform#%24layout-detail">$layout</a> property to choose a Bootstrap 3 form layout. So for example to render a horizontal form you would:
ja: このクラスは主に<a href="yii-bootstrap-activeform#%24layout-detail">$ layout</a>プロパティを追加して、Bootstrap 3フォームレイアウトを選択します。たとえば、水平方向のフォームをレンダリングするには、次のようにします。
ko: 이 클래스는 주로 <a href="yii-bootstrap-activeform#%24layout-detail">$ layout</a> 속성을 추가하여 Bootstrap 3 양식 레이아웃을 선택합니다. 예를 들어 가로 형식을 렌더링하려면 다음을 수행하십시오.
ru: Этот класс в основном добавляет свойство <a href="yii-bootstrap-activeform#%24layout-detail">$ layout</a> для выбора макета формы Bootstrap 3. Так, например, для визуализации горизонтальной формы вы должны:

source: This class represents an access rule defined by the <a href="yii-filters-accesscontrol">yii\filters\AccessControl</a> action filter
ja: このクラスは、<a href="yii-filters-accesscontrol">yii \ filters \ AccessControl</a>アクションフィルターによって定義されたアクセスルールを表します
ko: 이 클래스는 <a href="yii-filters-accesscontrol">yii \ filters \ AccessControl</a> 작업 필터에 의해 정의 된 액세스 규칙을 나타냅니다.
ru: Этот класс представляет правило доступа, определяемое <a href="yii-filters-accesscontrol">фильтром</a> действия yii \ filters \ AccessControl.

source: This class requires <code>spomky-labs/jose</code> library to be installed for JWS verification. This can be done via composer:
ja: このクラスでは、JWS検証のために <code>spomky-labs/jose</code> ライブラリをインストールする必要があります。これは作曲家を介して行うことができます：
ko: 이 클래스는 JWS 검증을 위해 <code>spomky-labs/jose</code> 라이브러리를 설치해야합니다. 이는 composer를 통해 수행 할 수 있습니다.
ru: Для этого класса требуется, чтобы была установлена ​​библиотека <code>spomky-labs/jose</code> для проверки JWS. Это можно сделать через композитор:

source: This class supports transactions exactly as "yii\db\Connection".
ja: yiidb\\Connection "と全く同じトランザクションをサポートしています。
ko: 이 클래스는 "yii \ db \ Connection"과 동일한 트랜잭션을 지원합니다.
ru: Данный класс поддерживает транзакции точно так же,как и "yii\db\Connection".

source: This class uses <a href="http://www.php.net/manual/en/ref.pdo.php">PDO</a> to maintain such connection. Note: although PDO supports numerous database drivers, this class supports only MySQL.
ja: このクラスは、<a href="http://www.php.net/manual/en/ref.pdo.php">PDO</a>を使用してそのような接続を維持します。注：PDOは多数のデータベースドライバーをサポートしていますが、このクラスはMySQLのみをサポートしています。
ko: 이 클래스는 <a href="http://www.php.net/manual/en/ref.pdo.php">PDO</a> 를 사용 하여 이러한 연결을 유지합니다. 참고 : PDO는 수많은 데이터베이스 드라이버를 지원하지만이 클래스는 MySQL 만 지원합니다.
ru: Этот класс использует <a href="http://www.php.net/manual/en/ref.pdo.php">PDO</a> для поддержания такого соединения. Примечание: хотя PDO поддерживает множество драйверов баз данных, этот класс поддерживает только MySQL.

source: This command can be used as follows on command line:
ja: このコマンドは、コマンドラインで以下のように使用できます。
ko: 이 명령은 명령 행에서 다음과 같이 사용할 수 있습니다.
ru: Эта команда может быть использована в командной строке следующим образом:

source: This command creates a new migration using the available migration template. After using this command, developers should modify the created migration skeleton by filling up the actual migration logic.
ja: このコマンドは、利用可能なマイグレーションテンプレートを使用して新しいマイグレーションを作成します。このコマンドを使用した後、開発者は実際のマイグレーションロジックを埋めて、作成されたマイグレーションのスケルトンを修正する必要があります。
ko: 이 명령은 사용 가능한 마이그레이션 템플릿을 사용하여 새 마이그레이션을 만듭니다. 이 명령을 사용한 후 개발자는 실제 마이그레이션 로직을 채워 생성 된 마이그레이션 스켈레톤을 수정해야합니다.
ru: Эта команда создает новую миграцию с помощью доступного шаблона миграции.После использования этой команды разработчики должны изменить созданный скелет миграции,заполнив реальную логику миграции.

source: This command displays the available command list in the application or the detailed instructions about using a specific command.
ja: このコマンドは、アプリケーションで利用可能なコマンドのリストや、特定のコマンドの使用に関する詳細な説明を表示します。
ko: 이 명령은 응용 프로그램에서 사용 가능한 명령 목록 또는 특정 명령 사용에 대한 자세한 지시 사항을 표시합니다.
ru: Эта команда отображает список доступных команд в приложении или подробные инструкции по использованию конкретной команды.

source: This command installs <a href="https://github.com/francoispluchino/composer-asset-plugin/">composer asset plugin</a> globally which allows managing Bower and NPM package dependencies through Composer. After the plugin installation, every single project on your computer will support Bower and NPM packages through <code>composer.json</code>.
ja: このコマンドは、Composer <a href="https://github.com/francoispluchino/composer-asset-plugin/">アセットプラグインを</a>グローバルにインストールし、Composerを介してBowerおよびNPMパッケージの依存関係を管理できるようにします。プラグインのインストール後、コンピューター上のすべてのプロジェクトは、 <code>composer.json</code> を通じてBowerおよびNPMパッケージをサポートします。
ko: 이 명령 은 Composer <a href="https://github.com/francoispluchino/composer-asset-plugin/">자산 플러그인을</a> 전체적으로 설치 하여 Composer를 통해 Bower 및 NPM 패키지 종속성을 관리 할 수 ​​있습니다. 플러그인 설치 후 컴퓨터의 모든 단일 프로젝트는 <code>composer.json</code> 을 통해 Bower 및 NPM 패키지를 지원합니다 .
ru: Эта команда устанавливает <a href="https://github.com/francoispluchino/composer-asset-plugin/">плагин ресурсов композитора</a> глобально, который позволяет управлять зависимостями пакетов Bower и NPM через Composer. После установки плагина каждый проект на вашем компьютере будет поддерживать пакеты Bower и NPM через <code>composer.json</code> .

source: This command instance
ja: このコマンドインスタンスは
ko: 이 명령 인스턴스
ru: этот командный экземпляр

source: This command provides support for tracking the migration history, upgrading or downloading with migrations, and creating new migration skeletons.
ja: このコマンドは、移行履歴の追跡、移行のアップグレードやダウンロード、新しい移行スケルトンの作成をサポートします。
ko: 이 명령은 마이그레이션 기록 추적, 마이그레이션으로 업그레이드 또는 다운로드 및 새 마이그레이션 스켈레톤 생성을 지원합니다.
ru: Эта команда обеспечивает поддержку для отслеживания истории миграции,обновления или загрузки с помощью миграции,а также создания новых скелетов миграции.

source: This command will first revert the specified migrations, and then apply them again. For example,
ja: このコマンドは、最初に指定した移行を元に戻してから、再度適用します。例えば、以下のようになります。
ko: 이 명령은 먼저 지정된 마이그레이션을 되돌리고 다시 적용합니다. 예를 들어
ru: Эта команда сначала вернет указанные миграции,а затем применит их снова.Например,

source: This command will generate fixtures for all template files that are stored under $templatePath and store fixtures under <code>$fixtureDataPath</code> with file names same as templates names.
ja: このコマンドは、$ templatePathの下に格納されているすべてのテンプレートファイルのフィクスチャを生成し、 <code>$fixtureDataPath</code> 下にテンプレート名と同じファイル名でフィクスチャを格納します。
ko: 이 명령은 $ templatePath에 저장된 모든 템플릿 파일에 대한 조명기를 생성하고 템플릿 이름과 동일한 파일 이름을 가진 <code>$fixtureDataPath</code> 조명기를 저장 합니다.
ru: Эта команда сгенерирует фикстуры для всех файлов шаблонов, которые хранятся в $ templatePath, и сохранит фикстуры в <code>$fixtureDataPath</code> с именами файлов, такими же, как имена шаблонов.
