Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/yii/yii.*.022.xlf
Languages: ja, ko, ru

source: The values of attributes will be HTML-encoded using <a href="yii-helpers-basehtml#encode()-detail">Html::encode()</a>.
ja: 属性の値は、<a href="yii-helpers-basehtml#encode()-detail">Html :: encode（）</a>を使用してHTMLエンコードされます。
ko: 속성 값은 <a href="yii-helpers-basehtml#encode()-detail">Html :: encode ()를</a> 사용하여 HTML로 인코딩됩니다 .
ru: Значения атрибутов будут закодированы в HTML с помощью <a href="yii-helpers-basehtml#encode()-detail">Html :: encode ()</a> .

source: The values of attributes will be HTML-encoded using <a href="yii-helpers-basehtml#encode()-detail">encode()</a>.
ja: 属性の値は、<a href="yii-helpers-basehtml#encode()-detail">encode（）</a>を使用してHTMLエンコードされます。
ko: 속성 값은 <a href="yii-helpers-basehtml#encode()-detail">encode ()를</a> 사용하여 HTML로 인코딩됩니다 .
ru: Значения атрибутов будут закодированы в HTML с помощью <a href="yii-helpers-basehtml#encode()-detail">encode ()</a> .

source: The values that must <strong>all</strong> be in <code>$haystack</code>.
ja: 必要のある値<strong>のすべての</strong>中でも <code>$haystack</code> 。
ko: <strong>모두 </strong> <code>$haystack</code> 에 있어야하는 값입니다 .
ru: Значения , которые должны <strong>все</strong> быть в <code>$haystack</code> .

source: The values to be bound. This must be given in terms of an associative array with array keys being the parameter names, and array values the corresponding parameter values, e.g. <code>[':name' =&gt; 'John', ':age' =&gt; 25]</code>. By default, the PDO type of each value is determined by its PHP type. You may explicitly specify the PDO type by using an array: <code>[value, type]</code>, e.g. <code>[':name' =&gt; 'John', ':profile' =&gt; [$profile, \PDO::PARAM_LOB]]</code>.
ja: バインドされる値。これは、連想配列の観点から指定する必要があります。配列キーはパラメーター名であり、配列値は対応するパラメーター値です（例： <code>[':name' =&gt; 'John', ':age' =&gt; 25]</code> 。デフォルトでは、各値のPDOタイプはそのPHPタイプによって決定されます。配列を使用してPDOタイプを明示的に指定できます： <code>[value, type]</code> 、たとえば <code>[':name' =&gt; 'John', ':profile' =&gt; [$profile, \PDO::PARAM_LOB]]</code> 。
ko: 바인딩 할 값입니다. 이는 배열 키가 매개 변수 이름 인 연관 배열로 제공되어야하며 배열 값은 해당 매개 변수 값 (예 : <code>[':name' =&gt; 'John', ':age' =&gt; 25]</code> 입니다. 기본적으로 각 값의 PDO 유형은 PHP 유형에 따라 결정됩니다. <code>[value, type]</code> 배열을 사용하여 PDO 유형을 명시 적으로 지정할 수 있습니다 ( 예 : <code>[':name' =&gt; 'John', ':profile' =&gt; [$profile, \PDO::PARAM_LOB]]</code> .
ru: Связанные значения. Это должно быть дано в терминах ассоциативного массива, где ключи массива являются именами параметров, а значения массива - соответствующими значениями параметров, например <code>[':name' =&gt; 'John', ':age' =&gt; 25]</code> . По умолчанию тип PDO каждого значения определяется его типом PHP. Вы можете явно указать тип PDO, используя массив: <code>[value, type]</code> , например <code>[':name' =&gt; 'John', ':profile' =&gt; [$profile, \PDO::PARAM_LOB]]</code> .

source: The variable being evaluated.
ja: 評価される変数。
ko: 평가할 변수입니다.
ru: Переменная оценивается.

source: The variable name
ja: 変数名
ko: 변수 이름
ru: Имя переменной

source: The variable to be exported.
ja: エクスポートする変数。
ko: 내보낼 변수입니다.
ru: Переменная для экспорта.

source: The variable value, or <code>null</code> if the variable does not exist.
ja: 変数値。変数が存在しない場合は <code>null</code> 。
ko: 변수 값 . 변수가 존재하지 않는 경우는 <code>null</code>
ru: Значение переменной или <code>null</code> , если переменная не существует.

source: The variables (name =&gt; value) to be extracted and made available in the decorative view.
ja: 抽出され、装飾ビューで使用可能になる変数（名前=&gt;値）。
ko: 장식보기에서 추출하여 사용할 수있는 변수 (이름 =&gt; 값)
ru: Переменные (имя =&gt; значение), которые нужно извлечь и сделать доступными в декоративном виде.

source: The verification code
ja: 検証コード
ko: 인증 코드
ru: Верификационный код

source: The verification code.
ja: 検証コードです。
ko: 인증 코드.
ru: Верификационный код.

source: The version at which the migration history should be marked. This can be either the timestamp or the full name of the migration.
ja: 移行履歴をマークするバージョン。これは、タイムスタンプまたはマイグレーションのフルネームのいずれかです。
ko: 마이그레이션 기록을 표시 할 버전입니다. 타임 스탬프이거나 마이그레이션의 전체 이름 일 수 있습니다.
ru: Версия,при которой должна быть отмечена история миграции.Это может быть как метка времени,так и полное название миграции.

source: The version of Yii framework
ja: Yii フレームワークのバージョン
ko: Yii 프레임 워크의 버전
ru: Версия Yii-фреймворка

source: The version of the HTTP protocol to use.
ja: 使用するHTTPプロトコルのバージョン。
ko: 사용할 HTTP 프로토콜의 버전입니다.
ru: Версия протокола HTTP для использования.

source: The version of the HTTP protocol to use. If not set, it will be determined via <code>$_SERVER['SERVER_PROTOCOL']</code>, or '1.1' if that is not available.
ja: 使用するHTTPプロトコルのバージョン。設定されていない場合、 <code>$_SERVER['SERVER_PROTOCOL']</code> を介して決定されます。それが使用できない場合は、 '1.1' によって決定されます。
ko: 사용할 HTTP 프로토콜의 버전입니다. 설정하지 않으면 <code>$_SERVER['SERVER_PROTOCOL']</code> 통해 결정 되거나, 사용 불가능한 경우 '1.1'으로 결정됩니다.
ru: Версия используемого протокола HTTP. Если не установлен, он будет определен через <code>$_SERVER['SERVER_PROTOCOL']</code> или через '1.1', если он недоступен.

source: The version of this module.
ja: このモジュールのバージョン。
ko: 이 모듈의 버전입니다.
ru: Версия этого модуля.

source: The version of this module. Version can be specified as a PHP callback, which can accept module instance as an argument and should return the actual version. For example:
ja: このモジュールのバージョン。Version は PHP コールバックで指定することができ、モジュールのインスタンスを引数として受け取ることができ、 実際のバージョンを返します。例えば、以下のようになります。
ko: 이 모듈의 버전입니다. 버전은 PHP 콜백으로 지정 될 수 있으며, 이는 모듈 인스턴스를 인수로 허용하고 실제 버전을 반환해야합니다. 예를 들면 다음과 같습니다.
ru: Версия этого модуля.Версия может быть указана как обратный вызов PHP,который может принять экземпляр модуля в качестве аргумента и должен вернуть актуальную версию.Например:

source: The view application component that is used to render various view files.
ja: 様々なビューファイルをレンダリングするために使用されるビューアプリケーションコンポーネントです。
ko: 다양한 뷰 파일을 렌더링하는 데 사용되는 뷰 애플리케이션 구성 요소입니다.
ru: Компонент приложения View,который используется для отрисовки различных файлов представления.

source: The view component to use for caching.
ja: キャッシングに使用するビューコンポーネント。
ko: 캐싱에 사용할 뷰 구성 요소입니다.
ru: Видовой компонент для кэширования.

source: The view component to use for caching. If not set, the default application view component <a href="yii-base-application#%24view-detail">yii\web\Application::$view</a> will be used.
ja: キャッシュに使用するビューコンポーネント。設定されていない場合、デフォルトのアプリケーションビューコンポーネント<a href="yii-base-application#%24view-detail">yii \ web \ Application :: $ view</a>が使用されます。
ko: 캐싱에 사용할 뷰 구성 요소입니다. 설정하지 않으면 기본 응용 프로그램보기 구성 요소 <a href="yii-base-application#%24view-detail">yii \ web \ Application :: $ view</a> 가 사용됩니다.
ru: Компонент представления, используемый для кэширования. Если не задан, будет использоваться компонент представления приложения по умолчанию <a href="yii-base-application#%24view-detail">yii \ web \ Application :: $ view</a> .

source: The view file being rendered.
ja: レンダリングされるビューファイル。
ko: 렌더링되는 뷰 파일
ru: Отображаемый файл просмотра.

source: The view file currently being rendered.
ja: 現在レンダリング中のビューファイル。
ko: 현재 렌더링중인 뷰 파일입니다.
ru: Файл просмотра,который в настоящее время визуализируется.

source: The view file currently being rendered. False if no view file is being rendered.
ja: 現在レンダリング中のビューファイル。レンダリング中のビューファイルがない場合は False。
ko: 현재 렌더링중인 뷰 파일입니다. 뷰 파일이 렌더링되지 않으면 False입니다.
ru: Файл просмотра,который в настоящее время визуализируется.Ошибка,если файл просмотра не отображается.

source: The view file for the input form of the generator.
ja: ジェネレーターの入力フォームのビューファイル。
ko: 생성기의 입력 양식에 대한보기 파일입니다.
ru: Файл вида для входной формы генератора.

source: The view file path. Note that the file may not exist.
ja: ビューファイルのパスです。ファイルが存在しない場合があることに注意してください。
ko: 보기 파일 경로 파일이 존재하지 않을 수 있습니다.
ru: Путь к файлу просмотра.Обратите внимание,что файл может не существовать.

source: The view file that will be used to decorate the content enclosed by this widget.
ja: このウィジェットで囲まれたコンテンツを装飾するために使用されるビューファイル。
ko: 이 위젯으로 둘러싸인 컨텐츠를 장식하는 데 사용되는보기 파일입니다.
ru: Файл просмотра,который будет использоваться для украшения содержимого,заключенного в этот виджет.

source: The view file that will be used to decorate the content enclosed by this widget. This can be specified as either the view file path or <a href="guide-concept-aliases">path alias</a>.
ja: このウィジェットで囲まれたコンテンツを装飾するために使用されるビューファイル。これは、ビューファイルパスまたは<a href="guide-concept-aliases">パスエイリアス</a>として指定できます。
ko: 이 위젯으로 둘러싸인 컨텐츠를 장식하는 데 사용되는보기 파일입니다. 보기 파일 경로 또는 <a href="guide-concept-aliases">경로 별명</a> 으로 지정할 수 있습니다 .
ru: Файл представления, который будет использоваться для украшения содержимого, заключенного в этот виджет. Это может быть указано либо как путь к файлу представления, либо как <a href="guide-concept-aliases">псевдоним пути</a> .

source: The view file to be rendered.
ja: レンダリングされるビューファイル。
ko: 렌더링 할 뷰 파일입니다.
ru: Файл просмотра,который будет отображен.

source: The view file to be rendered. If not set, it will take the value of <a href="yii-base-action#%24id-detail">$id</a>. That means, if you name the action as "error" in "SiteController", then the view name would be "error", and the corresponding view file would be "views/site/error.php".
ja: レンダリングされるビューファイル。設定されていない場合は、<a href="yii-base-action#%24id-detail">$ idの</a>値を取ります。つまり、「SiteController」でアクションに「error」という名前を付けると、ビュー名は「error」になり、対応するビューファイルは「views / site / error.php」になります。
ko: 렌더링 할 뷰 파일입니다. 설정하지 않으면 <a href="yii-base-action#%24id-detail">$ id</a> 값을 갖습니다 . 즉, "SiteController"에서 조치 이름을 "error"로 지정하면보기 이름은 "error"가되고 해당보기 파일은 "views / site / error.php"가됩니다.
ru: Файл представления для рендеринга. Если не установлен, он будет иметь значение <a href="yii-base-action#%24id-detail">$ id</a> . Это означает, что если вы назовете действие как &laquo;ошибка&raquo; в &laquo;SiteController&raquo;, тогда имя представления будет &laquo;error&raquo;, а соответствующий файл представления будет &laquo;views / site / error.php&raquo;.

source: The view file to be rendered. This can be either a file path or a <a href="guide-concept-aliases">path alias</a>.
ja: レンダリングされるビューファイル。これは、ファイルパスまたは<a href="guide-concept-aliases">パスエイリアスの</a>いずれかです。
ko: 렌더링 할 뷰 파일입니다. 파일 경로 또는 <a href="guide-concept-aliases">경로 별칭 일 수</a> 있습니다.
ru: Файл представления для рендеринга. Это может быть либо путь к файлу, либо <a href="guide-concept-aliases">псевдоним пути</a> .

source: The view file.
ja: ビューファイルです。
ko: 뷰 파일.
ru: Файл просмотра.

source: The view file. This can be either an absolute file path or an alias of it.
ja: ビューファイル。これは、絶対ファイルパスかそのエイリアスのどちらかになります。
ko: 뷰 파일. 이것은 절대 파일 경로이거나 별명 일 수 있습니다.
ru: Файл просмотра.Это может быть как абсолютный путь к файлу,так и его псевдоним.

source: The view instance
ja: ビューのインスタンス
ko: 뷰 인스턴스
ru: Видовой экземпляр

source: The view name or the <a href="guide-concept-aliases">path alias</a> of the view file.
ja: ビューファイルのビュー名または<a href="guide-concept-aliases">パスエイリアス</a>。
ko: 보기 파일 의보기 이름 또는 <a href="guide-concept-aliases">경로 별명</a>
ru: Имя представления или <a href="guide-concept-aliases">псевдоним пути</a> к файлу представления.

source: The view name or the <a href="guide-concept-aliases">path alias</a> of the view file. Please refer to <a href="yii-base-view#render()-detail">render()</a> on how to specify this parameter.
ja: ビューファイルのビュー名または<a href="guide-concept-aliases">パスエイリアス</a>。このパラメーターの指定方法については、<a href="yii-base-view#render()-detail">render（）</a>を参照してください。
ko: 보기 파일 의보기 이름 또는 <a href="guide-concept-aliases">경로 별명 </a>이 매개 변수를 지정하는 방법에 대해서는 <a href="yii-base-view#render()-detail">render ()</a> 를 참조하십시오 .
ru: Имя представления или <a href="guide-concept-aliases">псевдоним пути</a> к файлу представления. Пожалуйста, обратитесь к <a href="yii-base-view#render()-detail">render (),</a> чтобы узнать, как указать этот параметр.

source: The view name.
ja: ビュー名です。
ko: 뷰 이름
ru: Название вида.

source: The view name. Please refer to <a href="yii-base-controller#render()-detail">render()</a> on how to specify a view name.
ja: ビュー名。ビュー名の指定方法については<a href="yii-base-controller#render()-detail">render（）</a>を参照してください。
ko: 뷰 이름 뷰 이름을 지정하는 방법에 대해서는 <a href="yii-base-controller#render()-detail">render ()</a> 를 참조하십시오 .
ru: Название представления. Пожалуйста, обратитесь к <a href="yii-base-controller#render()-detail">render ()</a> о том, как указать имя представления.

source: The view name. Please refer to <a href="yii-base-view#render()-detail">render()</a> on how to specify this parameter.
ja: ビュー名。このパラメーターの指定方法については、<a href="yii-base-view#render()-detail">render（）</a>を参照してください。
ko: 뷰 이름 이 매개 변수를 지정하는 방법에 대해서는 <a href="yii-base-view#render()-detail">render ()</a> 를 참조하십시오 .
ru: Название представления. Пожалуйста, обратитесь к <a href="yii-base-view#render()-detail">render (),</a> чтобы узнать, как указать этот параметр.

source: The view object that can be used to render views or view files.
ja: ビューやビューファイルのレンダリングに使用できるビューオブジェクト。
ko: 뷰를 렌더링하거나 파일을 보는 데 사용할 수있는 뷰 객체입니다.
ru: Объект представления,который может быть использован для отображения представлений или просмотра файлов.

source: The view object that is going to be used to render views or view files containing a model form with this validator applied.
ja: このバリデータを適用したモデルフォームを含むビューやビューファイルのレンダリングに使われるビューオブジェクト。
ko: 이 유효성 검증 기가 적용된 모델 양식을 포함하는보기 또는보기 파일을 렌더링하는 데 사용될보기 오브젝트입니다.
ru: Объект представления,который будет использоваться для отображения представлений или файлов представлений,содержащих форму модели с применением этого валидатора.

source: The view object to render the layout file.
ja: レイアウトファイルをレンダリングするビューオブジェクト。
ko: 레이아웃 파일을 렌더링 할 뷰 객체입니다.
ru: Объект просмотра для отображения файла макета.

source: The view object used for rendering the file.
ja: ファイルのレンダリングに使用されるビューオブジェクト。
ko: 파일을 렌더링하는 데 사용되는 뷰 객체입니다.
ru: Объект просмотра,используемый для отрисовки файла.

source: The view path that may be prefixed to a relative view name.
ja: 相対ビュー名の先頭に付けられるビューパス。
ko: 상대 뷰 이름 앞에 붙일 수있는 뷰 경로입니다.
ru: Траектория представления,которая может быть префиксована к имени относительного представления.

source: The view that the asset files are to be registered with.
ja: アセットファイルが登録されるビューです。
ko: 자산 파일이 등록 될보기입니다.
ru: Представление о том,что файлы активов должны быть зарегистрированы.

source: The view to be registered with
ja: に登録されるビュー
ko: 등록 할 뷰
ru: Вид для регистрации на

source: The view to be rendered can be specified in one of the following formats:
ja: レンダリングされるビューは、以下のいずれかの形式で指定できます。
ko: 렌더링 할 뷰는 다음 형식 중 하나로 지정할 수 있습니다.
ru: Вид,который необходимо отрисовать,можно указать в одном из следующих форматов:

source: The view to be used for rendering the message body. This can be:
ja: メッセージ本文のレンダリングに使用するビュー。これは次のようになります。
ko: 메시지 본문을 렌더링하는 데 사용되는보기입니다. 이것은 될 수있다:
ru: Вид,который будет использоваться для отображения тела сообщения.Это может быть:

source: The view will be rendered using the <a href="yii-mail-basemailer#%24view-detail">$view</a> component.
ja: ビューは<a href="yii-mail-basemailer#%24view-detail">$ view</a>コンポーネントを使用してレンダリングされます。
ko: 보기는 <a href="yii-mail-basemailer#%24view-detail">$ view</a> 구성 요소를 사용하여 렌더링됩니다 .
ru: Представление будет отображаться с использованием компонента <a href="yii-mail-basemailer#%24view-detail">$ view</a> .

source: The web Request class represents an HTTP request
ja: web Request クラスは HTTP リクエストを表します。
ko: 웹 요청 클래스는 HTTP 요청을 나타냅니다.
ru: Класс Web Request представляет собой запрос HTTP

source: The web Response class represents an HTTP response
ja: web レスポンスクラスは HTTP レスポンスを表します。
ko: 웹 응답 클래스는 HTTP 응답을 나타냅니다.
ru: Класс Web Response представляет собой ответ HTTP

source: The webroot in our basic project template is named <code>web</code>. Before uploading the application to your webserver rename your local webroot to match your server, i.e., from <code>web</code> to <code>www</code>, <code>public_html</code> or whatever the name of your hosting webroot.
ja: 基本的なプロジェクトテンプレートのwebrootの名前は <code>web</code> です。アプリケーションをウェブサーバーにアップロードする前に、ローカルウェブルートの名前をサーバーと一致するように変更します。つまり、 <code>web</code> から <code>www</code> 、 <code>public_html</code> など、ホスティングウェブルートの名前に変更します。
ko: 기본 프로젝트 템플릿의 webroot 이름은 <code>web</code> 입니다. 응용 프로그램을 웹 서버에 업로드하기 전에 서버와 일치하도록 로컬 웹 루트의 이름을 바꾸십시오 (예 : <code>web</code> 에서 <code>www</code> , <code>public_html</code> 또는 호스팅 웹 루트의 이름).
ru: Корневой каталог в нашем базовом шаблоне проекта называется <code>web</code> . Перед загрузкой приложения на ваш веб-сервер переименуйте локальный веб-корневой каталог в соответствии с вашим сервером, т. <code>public_html</code> С <code>web</code> на <code>www</code> , public_html или другое имя корневого веб- узла вашего хостинга.

source: The widget class name.
ja: ウィジェットのクラス名です。
ko: 위젯 클래스 이름
ru: Имя класса виджета.

source: The widget instance that is ended.
ja: 終了したウィジェットのインスタンス。
ko: 종료 된 위젯 인스턴스
ru: Экземпляр виджета,который закончился.

source: The widget rendering result is returned by this method.
ja: このメソッドはウィジェットのレンダリング結果を返します。
ko: 이 메소드는 위젯 렌더링 결과를 리턴합니다.
ru: Результат рендеринга виджета возвращается этим методом.

source: The widget result.
ja: ウィジェットの結果。
ko: 위젯 결과.
ru: Результат виджета.

source: The widget result. Event handlers may modify this property to change the widget result.
ja: ウィジェットの結果。イベントハンドラは、ウィジェットの結果を変更するためにこのプロパティを変更することができます。
ko: 위젯 결과. 이벤트 핸들러는 위젯 결과를 변경하기 위해이 특성을 수정할 수 있습니다.
ru: Результат виджета.Обработчики событий могут изменять это свойство для изменения результата виджета.

source: The widget return result.
ja: ウィジェットの戻り値。
ko: 위젯 반환 결과.
ru: Результат возврата виджета.

source: The widget's properties are easily writable because the class extends <a href="yii-base-component">yii\base\Component</a>.
ja: クラスが<a href="yii-base-component">yii \ base \ Componentを</a>拡張するため、ウィジェットのプロパティは簡単に書き込み可能です。
ko: 클래스가 <a href="yii-base-component">yii \ base \ Component를</a> 확장하므로 위젯의 속성을 쉽게 쓸 수 있습니다 .
ru: Свойства виджета легко доступны для записи, поскольку класс расширяет <a href="yii-base-component">yii \ base \ Component</a> .

source: The widgets that are currently being rendered (not ended).
ja: 現在レンダリング中のウィジェット(終了していません)。
ko: 현재 렌더링중인 위젯 (종료되지 않음).
ru: Виджеты,которые в настоящее время отображаются (не заканчиваются).

source: The widgets that are currently being rendered (not ended). This property is maintained by <a href="yii-base-widget#begin()-detail">begin()</a> and <a href="yii-base-widget#end()-detail">end()</a> methods.
ja: 現在レンダリングされている（終了していない）ウィジェット。このプロパティは、<a href="yii-base-widget#begin()-detail">begin（）</a>および<a href="yii-base-widget#end()-detail">end（）</a>メソッドによって維持されます。
ko: 현재 렌더링중인 위젯 (종료되지 않음). 이 속성은 <a href="yii-base-widget#begin()-detail">begin ()</a> 및 <a href="yii-base-widget#end()-detail">end ()</a> 메서드 로 유지 관리됩니다 .
ru: Виджеты, которые в настоящее время отображаются (не завершены). Это свойство поддерживается методами <a href="yii-base-widget#begin()-detail">begin ()</a> и <a href="yii-base-widget#end()-detail">end ()</a> .

source: The width of the generated CAPTCHA image.
ja: 生成されたCAPTCHA画像の幅。
ko: 생성 된 보안 문자 이미지의 너비입니다.
ru: Ширина сгенерированного изображения CAPTCHA.

source: The width of the generated CAPTCHA image. Defaults to 120.
ja: 生成されるCAPTCHA画像の幅。デフォルトは120です。
ko: 생성 된 보안 문자 이미지의 너비입니다. 기본값은 120입니다.
ru: Ширина сгенерированного изображения CAPTCHA.По умолчанию 120.

source: The word to CamelCase
ja: キャメルケースへのクチコミ
ko: CamelCase에 대한 단어
ru: Слово КэмелКейсу

source: The word to be pluralized
ja: 複数化する言葉
ko: 복수 될 단어
ru: Слово для множественного числа

source: The word(s) to underscore
ja: 下線を引く単語
ko: 밑줄을 긋는 단어
ru: Слово(и)для подчеркивания

source: The words to be converted into an string
ja: 文字列に変換される単語
ko: 문자열로 변환 될 단어
ru: Слова,которые будут преобразованы в строку

source: The wrapped text.
ja: 包み込まれたテキスト。
ko: 랩핑 된 텍스트
ru: Завернутый текст.

source: The wrapper tag is only used for some layouts and form elements.
ja: ラッパータグは、一部のレイアウトやフォーム要素でのみ使用されます。
ko: 랩퍼 태그는 일부 레이아웃 및 양식 요소에만 사용됩니다.
ru: Тэг обертки используется только для некоторых макетов и элементов формы.

source: The yii.js script
ja: yii.js スクリプト
ko: yii.js 스크립트
ru: Сценарий Yii.js

source: The zero-based current page number.
ja: ゼロベースの現在のページ番号。
ko: 0부터 시작하는 현재 페이지 번호입니다.
ru: Нулевой номер текущей страницы.

source: The zero-based index of the attribute in the <a href="yii-widgets-detailview#%24attributes-detail">$attributes</a> array
ja: <a href="yii-widgets-detailview#%24attributes-detail">$ attributes</a>配列内の属性のゼロから始まるインデックス
ko: <a href="yii-widgets-detailview#%24attributes-detail">$ attributes</a> 배열 에서 속성의 인덱스 (0부터 시작)
ru: Отсчитываемый от нуля индекс атрибута в массиве <a href="yii-widgets-detailview#%24attributes-detail">$ attributes</a>

source: The zero-based index of the current page.
ja: 現在のページのゼロベースのインデックス。
ko: 현재 페이지의 인덱스 (0부터 시작)입니다.
ru: Нулевой индекс текущей страницы.

source: The zero-based index of the data item among the item array returned by <a href="yii-widgets-baselistview#%24dataProvider-detail">yii\grid\GridView::$dataProvider</a>.
ja: <a href="yii-widgets-baselistview#%24dataProvider-detail">yii \ grid \ GridView :: $ dataProvider</a>によって返されるアイテム配列の中のデータアイテムのゼロから始まるインデックス。
ko: <a href="yii-widgets-baselistview#%24dataProvider-detail">yii \ grid \ GridView :: $ dataProvider에서</a> 반환 한 항목 배열 중 데이터 항목의 인덱스 (0부터 시작) 입니다.
ru: Отсчитываемый от нуля индекс элемента данных в массиве элементов, возвращаемый <a href="yii-widgets-baselistview#%24dataProvider-detail">yii \ grid \ GridView :: $ dataProvider</a> .

source: The zero-based index of the data model among the model array returned by <a href="yii-widgets-baselistview#%24dataProvider-detail">$dataProvider</a>.
ja: <a href="yii-widgets-baselistview#%24dataProvider-detail">$ dataProvider</a>によって返されるモデル配列の中のデータモデルのゼロベースのインデックス。
ko: <a href="yii-widgets-baselistview#%24dataProvider-detail">$ dataProvider에서</a> 반환 한 모델 배열 중 데이터 모델의 인덱스 (0부터 시작) 입니다.
ru: Отсчитываемый от нуля индекс модели данных в массиве модели, возвращаемый <a href="yii-widgets-baselistview#%24dataProvider-detail">$ dataProvider</a> .

source: The zero-based index of the data model among the models array returned by <a href="yii-widgets-baselistview#%24dataProvider-detail">yii\grid\GridView::$dataProvider</a>.
ja: <a href="yii-widgets-baselistview#%24dataProvider-detail">yii \ grid \ GridView :: $ dataProvider</a>によって返されるモデル配列の中のデータモデルのゼロベースのインデックス。
ko: <a href="yii-widgets-baselistview#%24dataProvider-detail">yii \ grid \ GridView :: $ dataProvider에서</a> 반환 한 모델 배열 중 데이터 모델의 인덱스 (0부터 시작) 입니다.
ru: Отсчитываемый от нуля индекс модели данных среди массива моделей, возвращаемый <a href="yii-widgets-baselistview#%24dataProvider-detail">yii \ grid \ GridView :: $ dataProvider</a> .

source: The zero-based index of the data model in the model array returned by <a href="yii-widgets-baselistview#%24dataProvider-detail">$dataProvider</a>.
ja: <a href="yii-widgets-baselistview#%24dataProvider-detail">$ dataProvider</a>によって返されるモデル配列内のデータモデルのゼロから始まるインデックス。
ko: <a href="yii-widgets-baselistview#%24dataProvider-detail">$ dataProvider에서</a> 반환 한 모델 배열에서 데이터 모델의 인덱스 (0부터 시작) 입니다.
ru: Отсчитываемый от нуля индекс модели данных в массиве модели, возвращаемый <a href="yii-widgets-baselistview#%24dataProvider-detail">$ dataProvider</a> .

source: The zero-based page number that the URL should point to.
ja: URL が指すべきゼロベースのページ番号。
ko: URL이 가리키는 0부터 시작하는 페이지 번호입니다.
ru: Нулевой номер страницы,на которую должен указывать URL.

source: Theme Inheritance
ja: テーマの継承
ko: 테마 상속
ru: Наследование темы

source: Theme represents an application theme.
ja: テーマはアプリケーションのテーマを表しています。
ko: 테마는 응용 프로그램 테마를 나타냅니다.
ru: Тема представляет собой прикладную тему.

source: Theme uses <a href="yii-base-theme#%24pathMap-detail">$pathMap</a> to achieve the view file replacement:
ja: テーマは<a href="yii-base-theme#%24pathMap-detail">$ pathMap</a>を使用して、ビューファイルの置換を実現します。
ko: 테마는 <a href="yii-base-theme#%24pathMap-detail">$ pathMap</a> 을 사용 하여보기 파일을 대체합니다.
ru: Тема использует <a href="yii-base-theme#%24pathMap-detail">$ pathMap</a> для замены файла представления:

source: Theming Modules
ja: テーミングモジュール
ko: 테마 모듈
ru: Тематические модули

source: Theming Widgets
ja: ザミングウィジェット
ko: 테마 위젯
ru: Теминговые виджеты
