Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/octave/octave.*.011.xlf
Languages: es, ja, ru, zh_cn

source: Any window elements outside the data array are replaced by the value of <var>x</var> at the boundary. For example, with a window of length 3, <code><var>y</var>(1) = movstd ([<var>x</var>(1), <var>x</var>(1:2)])</code>, and <code><var>y</var>(end) = movstd ([<var>x</var>(end-1:end), <var>x</var>(end)])</code>.
es: Cualquier elemento de ventana fuera de la matriz de datos se reemplaza por el valor de <var>x</var> en el l&iacute;mite. Por ejemplo, con una ventana de longitud 3, <code><var>y</var>(1) = movstd ([<var>x</var>(1), <var>x</var>(1:2)])</code> e <code><var>y</var>(end) = movstd ([<var>x</var>(end-1:end), <var>x</var>(end)])</code> .
ja: データ配列外のウィンドウ要素は、境界で <var>x</var> の値に置き換えられます。たとえば、ウィンドウの長さが3の場合、 <code><var>y</var>(1) = movstd ([<var>x</var>(1), <var>x</var>(1:2)])</code> と <code><var>y</var>(end) = movstd ([<var>x</var>(end-1:end), <var>x</var>(end)])</code> 。
ru: Любые элементы окна вне массива данных заменяются значением <var>x</var> на границе. Например, с окном длиной 3 <code><var>y</var>(1) = movstd ([<var>x</var>(1), <var>x</var>(1:2)])</code> и <code><var>y</var>(end) = movstd ([<var>x</var>(end-1:end), <var>x</var>(end)])</code> .
zh_cn: 数据数组外部的所有窗口元素都将被边界处的 <var>x</var> 值替换。例如，对于一个长度为3的窗口， <code><var>y</var>(1) = movstd ([<var>x</var>(1), <var>x</var>(1:2)])</code> ，而 <code><var>y</var>(end) = movstd ([<var>x</var>(end-1:end), <var>x</var>(end)])</code> 。

source: Any window elements outside the data array are replaced by the value of <var>x</var> at the boundary. For example, with a window of length 3, <code><var>y</var>(1) = movsum ([<var>x</var>(1), <var>x</var>(1:2)])</code>, and <code><var>y</var>(end) = movsum ([<var>x</var>(end-1:end), <var>x</var>(end)])</code>.
es: Cualquier elemento de ventana fuera de la matriz de datos se reemplaza por el valor de <var>x</var> en el l&iacute;mite. Por ejemplo, con una ventana de longitud 3, <code><var>y</var>(1) = movsum ([<var>x</var>(1), <var>x</var>(1:2)])</code> e <code><var>y</var>(end) = movsum ([<var>x</var>(end-1:end), <var>x</var>(end)])</code> .
ja: データ配列外のウィンドウ要素は、境界で <var>x</var> の値に置き換えられます。たとえば、ウィンドウの長さが3の場合、 <code><var>y</var>(1) = movsum ([<var>x</var>(1), <var>x</var>(1:2)])</code> と <code><var>y</var>(end) = movsum ([<var>x</var>(end-1:end), <var>x</var>(end)])</code> 。
ru: Любые элементы окна вне массива данных заменяются значением <var>x</var> на границе. Например, с окном длиной 3 <code><var>y</var>(1) = movsum ([<var>x</var>(1), <var>x</var>(1:2)])</code> и <code><var>y</var>(end) = movsum ([<var>x</var>(end-1:end), <var>x</var>(end)])</code> .
zh_cn: 数据数组外部的所有窗口元素都将被边界处的 <var>x</var> 值替换。例如，对于一个长度为3的窗口， <code><var>y</var>(1) = movsum ([<var>x</var>(1), <var>x</var>(1:2)])</code> ，而 <code><var>y</var>(end) = movsum ([<var>x</var>(end-1:end), <var>x</var>(end)])</code> 。

source: Any window elements outside the data array are replaced by the value of <var>x</var> at the boundary. For example, with a window of length 3, <code><var>y</var>(1) = var ([<var>x</var>(1), <var>x</var>(1:2)])</code>, and <code><var>y</var>(end) = var ([<var>x</var>(end-1:end), <var>x</var>(end)])</code>.
es: Cualquier elemento de ventana fuera de la matriz de datos se reemplaza por el valor de <var>x</var> en el l&iacute;mite. Por ejemplo, con una ventana de longitud 3, <code><var>y</var>(1) = var ([<var>x</var>(1), <var>x</var>(1:2)])</code> e <code><var>y</var>(end) = var ([<var>x</var>(end-1:end), <var>x</var>(end)])</code> .
ja: データ配列外のウィンドウ要素は、境界で <var>x</var> の値に置き換えられます。たとえば、ウィンドウの長さが3の場合、 <code><var>y</var>(1) = var ([<var>x</var>(1), <var>x</var>(1:2)])</code> と <code><var>y</var>(end) = var ([<var>x</var>(end-1:end), <var>x</var>(end)])</code> 。
ru: Любые элементы окна вне массива данных заменяются значением <var>x</var> на границе. Например, с окном длиной 3 <code><var>y</var>(1) = var ([<var>x</var>(1), <var>x</var>(1:2)])</code> и <code><var>y</var>(end) = var ([<var>x</var>(end-1:end), <var>x</var>(end)])</code> .
zh_cn: 数据数组外部的所有窗口元素都将被边界处的 <var>x</var> 值替换。例如，对于一个长度为3的窗口， <code><var>y</var>(1) = var ([<var>x</var>(1), <var>x</var>(1:2)])</code> ，而 <code><var>y</var>(end) = var ([<var>x</var>(end-1:end), <var>x</var>(end)])</code> 。

source: Apart from the string concatenation functions (see <a href="concatenating-strings#Concatenating-Strings">Concatenating Strings</a>) which cast numerical data to the corresponding UTF-8 encoded characters, there are several functions that format numerical data as strings. <code>mat2str</code> and <code>num2str</code> convert real or complex matrices, while <code>int2str</code> converts integer matrices. <code>int2str</code> takes the real part of complex values and round fractional values to integer. A more flexible way to format numerical data as strings is the <code>sprintf</code> function (see <a href="formatted-output#Formatted-Output">Formatted Output</a>, <a href="formatted-output#XREFsprintf">sprintf</a>).
es: Adem&aacute;s de las funciones de <a href="concatenating-strings#Concatenating-Strings">concatenaci&oacute;n de cadenas</a> (consulte Concatenaci&oacute;n de cadenas ) que emiten datos num&eacute;ricos a los caracteres codificados en UTF-8 correspondientes, hay varias funciones que formatean datos num&eacute;ricos como cadenas. <code>mat2str</code> y <code>num2str</code> convierten matrices reales o complejas, mientras que <code>int2str</code> convierte matrices enteras. <code>int2str</code> toma la parte real de los valores complejos y redondea los valores fraccionarios a un n&uacute;mero entero. Una forma m&aacute;s flexible de formatear datos num&eacute;ricos como cadenas es la funci&oacute;n <code>sprintf</code> (ver <a href="formatted-output#Formatted-Output">Salida formateada</a> , <a href="formatted-output#XREFsprintf">sprintf</a> ).
ja: 別に文字列連結関数から（参照<a href="concatenating-strings#Concatenating-Strings">連結ストリング</a>対応するUTF-8でエンコードされた文字の数値データキャスト）、文字列としてフォーマット数値データをそのいくつかの機能があります。 <code>mat2str</code> と <code>num2str</code> は実数または複素数の行列を変換し、 <code>int2str</code> は整数行列を変換します。 <code>int2str</code> は、複素数値の実部を取り、小数値を整数に丸めます。数値データを文字列としてフォーマットするためのより柔軟な方法は、 <code>sprintf</code> 関数です（<a href="formatted-output#Formatted-Output">Formatted Output</a>、<a href="formatted-output#XREFsprintf">sprintfを</a>参照）。
ru: Помимо функций конкатенации строк (см. &laquo; <a href="concatenating-strings#Concatenating-Strings">Объединение строк&raquo;</a> ), которые преобразуют числовые данные в соответствующие символы в кодировке UTF-8, существует несколько функций, которые форматируют числовые данные как строки. <code>mat2str</code> и <code>num2str</code> преобразуют вещественные или комплексные матрицы, а <code>int2str</code> преобразует целочисленные матрицы. <code>int2str</code> принимает действительную часть комплексных значений и округляет дробные значения до целого числа. Более гибкий способ форматирования числовых данных в виде строк - это функция <code>sprintf</code> (см. <a href="formatted-output#Formatted-Output">Форматированный вывод</a> , <a href="formatted-output#XREFsprintf">sprintf</a> ).
zh_cn: 除了将数字数据转换为对应的UTF-8编码字符的字符串连接函数（请参阅<a href="concatenating-strings#Concatenating-Strings">Concatenating Strings</a>）之外，还有一些函数将数字数据格式化为字符串。 <code>mat2str</code> 和 <code>num2str</code> 转换实数或复数矩阵，而 <code>int2str</code> 转换整数矩阵。 <code>int2str</code> 将复数值和小数部分的整数部分取整。将数字数据格式化为字符串的一种更灵活的方法是 <code>sprintf</code> 函数（请参见<a href="formatted-output#Formatted-Output">Formatted Output</a>，<a href="formatted-output#XREFsprintf">sprintf</a>）。

source: Append PostScript or PDF output to an existing file of the same type.
es: Añade la salida PostScript o PDF a un archivo existente del mismo tipo.
ja: PostScriptまたはPDF出力を、同じタイプの既存のファイルに追加します。
ru: Добавить вывод PostScript или PDF к существующему файлу того же типа.
zh_cn: 将PostScript或PDF输出附加到现有的相同类型的文件中。

source: Append a <code>"t"</code> to the mode string to open the file in text mode or a <code>"b"</code> to open in binary mode. On Windows systems, text mode reading and writing automatically converts linefeeds to the appropriate line end character for the system (carriage-return linefeed on Windows). The default when no mode is specified is binary.
es: Agregue una <code>"t"</code> a la cadena de modo para abrir el archivo en modo texto o una <code>"b"</code> para abrirlo en modo binario. En los sistemas Windows, la lectura y escritura en modo texto convierte autom&aacute;ticamente los avances de l&iacute;nea en el car&aacute;cter de final de l&iacute;nea apropiado para el sistema (avance de l&iacute;nea de retorno de carro en Windows). El valor predeterminado cuando no se especifica ning&uacute;n modo es binario.
ja: モード文字列に <code>"t"</code> を追加してファイルをテキストモードで開くか、 <code>"b"</code> を追加してバイナリモードで開きます。Windowsシステムでは、テキストモードの読み取りと書き込みにより、ラインフィードがシステムの適切なラインエンド文字に自動的に変換されます（Windowsではキャリッジリターンのラインフィード）。モードが指定されていない場合のデフォルトはバイナリです。
ru: Добавьте букву <code>"t"</code> в строку режима, чтобы открыть файл в текстовом режиме, или букву <code>"b"</code> чтобы открыть файл в двоичном режиме. В системах Windows чтение и запись в текстовом режиме автоматически преобразует перевод строки в соответствующий символ конца строки для системы (перевод строки с возвратом каретки в Windows). Если режим не указан, по умолчанию используется двоичный код.
zh_cn: 在模式字符串后附加 <code>"t"</code> 以文本模式打开文件，或在 <code>"b"</code> 以二进制模式打开文件。在Windows系统上，文本模式下的读写会自动将换行符转换为系统的相应换行符（在Windows上为回车换行符）。未指定任何模式时的默认值为二进制。

source: Append on each write.
es: Añada a cada escrito.
ja: 各書き込みに付記してください。
ru: Приложите к каждой записи.
zh_cn: 在每写上附加。

source: Append the scalar value <var>c</var> to the vector <var>x</var> until it is of length <var>l</var>. If <var>c</var> is not given, a value of 0 is used.
es: Agregue el valor escalar <var>c</var> al vector <var>x</var> hasta que tenga una longitud <var>l</var> . Si no se da <var>c</var> , se usa un valor de 0.
ja: 長さが <var>l</var> になるまで、スカラー値 <var>c</var> をベクトル <var>x</var> に追加します。 <var>c</var> が指定されていない場合は、値0が使用されます。
ru: Добавьте скалярное значение <var>c</var> к вектору <var>x</var> , пока оно не станет длиной <var>l</var> . Если <var>c</var> не указан, используется значение 0.
zh_cn: 将标量值 <var>c</var> 附加到向量 <var>x</var> ,直到长度为 <var>l</var> 为止。如果未给出 <var>c</var> ，则使用0值。

source: Append to the destination instead of overwriting.
es: Apéndase al destino en lugar de sobrescribirlo.
ja: 上書きではなく、宛先に追加します。
ru: Приложите к месту назначения вместо перезаписи.
zh_cn: 附加到目的地,而不是覆盖。

source: Appendix A External Code Interface
es: Apéndice A Interfaz de código externo
ja: 付録A 外部コードインタフェース
ru: Приложение A Внешний кодовый интерфейс
zh_cn: 附录A 外部代码接口

source: Appendix B Test and Demo Functions
es: Apéndice B Funciones de prueba y demostración
ja: 付録B テスト・デモ機能
ru: Приложение Б Тест и демонстрационные функции
zh_cn: 附录B 测试和演示功能

source: Appendix C Obsolete Functions
es: Apéndice C Funciones obsoletas
ja: 付録C 廃止された機能
ru: Приложение С Устаревшие функции
zh_cn: 附录C 过时的功能

source: Appendix D Known Causes of Trouble
es: Apéndice D Causas conocidas de los problemas
ja: 付録 D トラブルの既知の原因
ru: Приложение D Известные причины проблем
zh_cn: 附录D 已知的故障原因

source: Appendix E Installing Octave
es: Apéndice E Instalación de la octava
ja: 付録 E オクターブのインストール
ru: Приложение Е Установка октавы
zh_cn: 附录E 安装Octave

source: Appendix F Grammar and Parser
es: Apéndice F Gramática y análisis
ja: 付録F 文法とパーサー
ru: Приложение F Грамматика и парсер
zh_cn: 附录F 语法和解析器

source: Appendix G GNU GENERAL PUBLIC LICENSE
es: Apéndice G LICENCIA PÚBLICA GENERAL GNU
ja: 付録G GNU一般公衆使用権
ru: Приложение G GNU ГЕНЕРАЛЬНАЯ ОБЩЕСТВЕННАЯ ЛИЦЕНЗИЯ
zh_cn: 附录G GNU通用公共许可证

source: Application Note: If <var>x</var> is not specified then unit spacing will be used. To scale the integral to the correct value you must multiply by the actual spacing value (deltaX).
es: Nota de aplicaci&oacute;n: si no se especifica <var>x</var> , se utilizar&aacute; el espaciado unitario. Para escalar la integral al valor correcto, debe multiplicar por el valor de espaciado real (deltaX).
ja: 適用上の注意： <var>x</var> が指定されていない場合、単位間隔が使用されます。積分を正しい値にスケーリングするには、実際の間隔値（deltaX）を掛ける必要があります。
ru: Примечание по применению: Если <var>x</var> не указан, будет использоваться единичный интервал. Чтобы масштабировать интеграл до правильного значения, вы должны умножить его на фактическое значение интервала (deltaX).
zh_cn: 应用说明：如果未指定 <var>x</var> ,则将使用单位间距。要将积分缩放为正确的值，必须乘以实际的间距值（deltaX）。

source: Application Note: If <var>x</var> is not specified then unit spacing will be used. To scale the integral to the correct value you must multiply by the actual spacing value (deltaX). As an example, the integral of <em>x^3</em> over the range [0, 1] is <em>x^4/4</em> or 0.25. The following code uses <code>trapz</code> to calculate the integral in three different ways.
es: Nota de aplicaci&oacute;n: si no se especifica <var>x</var> , se utilizar&aacute; el espaciado unitario. Para escalar la integral al valor correcto, debe multiplicar por el valor de espaciado real (deltaX). Como ejemplo, la integral de <em>x ^ 3</em> en el rango [0, 1] es <em>x ^</em> 4/4 o 0.25. El siguiente c&oacute;digo usa <code>trapz</code> para calcular la integral de tres formas diferentes.
ja: 適用上の注意： <var>x</var> が指定されていない場合、単位間隔が使用されます。積分を正しい値にスケーリングするには、実際の間隔値（deltaX）を掛ける必要があります。一例として、の積分<em>X ^ 3</em>範囲[0、1]上であり<em>、X ^ 4月4日</em>または0.25。次のコードは、 <code>trapz</code> を使用して、3つの異なる方法で積分を計算します。
ru: Примечание по применению: Если <var>x</var> не указан, будет использоваться единичный интервал. Чтобы масштабировать интеграл до правильного значения, вы должны умножить его на фактическое значение интервала (deltaX). Например, интеграл от <em>x ^ 3</em> в диапазоне [0, 1] равен <em>x ^ 4/4</em> или 0,25. Следующий код использует <code>trapz</code> для вычисления интеграла тремя различными способами.
zh_cn: 应用说明：如果未指定 <var>x</var> ,则将使用单位间距。要将积分缩放为正确的值，必须乘以实际的间距值（deltaX）。例如，在范围[0，1] 上<em>x ^ 3</em>的积分是<em>x ^ 4/4</em>或0.25。以下代码使用 <code>trapz</code> 以三种不同方式计算积分。

source: Application Notes: If the objective function is a single nonlinear equation of one variable then using <code>fminbnd</code> is usually a better choice.
es: Notas de aplicaci&oacute;n: si la funci&oacute;n objetivo es una &uacute;nica ecuaci&oacute;n no lineal de una variable, usar <code>fminbnd</code> suele ser una mejor opci&oacute;n.
ja: アプリケーションノート：目的関数が1つの変数の単一の非線形方程式である場合、通常は <code>fminbnd</code> を使用する方が適切です。
ru: Замечания по применению: Если целевая функция представляет собой одно нелинейное уравнение одной переменной, то обычно лучше использовать <code>fminbnd</code> .
zh_cn: 应用注释：如果目标函数是一个变量的单个非线性方程，则使用 <code>fminbnd</code> 通常是更好的选择。

source: Application-defined Data
es: Datos definidos por la aplicación
ja: アプリケーション定義データ
ru: Определенные приложением Данные
zh_cn: 应用定义数据

source: Applied Numerical Linear Algebra
es: Álgebra lineal numérica aplicada
ja: 応用数値線形代数
ru: Прикладная числовая линейная алгебра
zh_cn: 应用数值线性代数

source: Apply a 1-D digital filter to the data <var>x</var>.
es: Aplique un filtro digital 1-D a los datos <var>x</var> .
ja: 1次元デジタルフィルターをデータ <var>x</var> に適用します。
ru: Примените 1-D цифровой фильтр к данным <var>x</var> .
zh_cn: 对数据 <var>x</var> 应用一维数字滤波器。

source: Apply a binary function <var>f</var> element-by-element to two array arguments <var>A</var> and <var>B</var>, expanding singleton dimensions in either input argument as necessary.
es: Aplique una funci&oacute;n binaria <var>f</var> elemento por elemento a dos argumentos de matriz <var>A</var> y <var>B</var> , expandiendo las dimensiones singleton en cualquier argumento de entrada seg&uacute;n sea necesario.
ja: バイナリ関数 <var>f</var> を要素ごとに2つの配列引数 <var>A</var> および <var>B</var> に適用し、必要に応じていずれかの入力引数のシングルトン次元を拡張します。
ru: Примените бинарную функцию <var>f</var> поэлементно к двум аргументам массива <var>A</var> и <var>B</var> , при необходимости расширяя одноэлементные измерения в любом входном аргументе.
zh_cn: 将二元函数 <var>f</var> 逐个元素应用于两个数组参数 <var>A</var> 和 <var>B</var> ，根据需要在任一输入参数中扩展单例尺寸。

source: Apply function <var>fcn</var> to a moving window of length <var>wlen</var> on data <var>x</var>.
es: Aplique la funci&oacute;n <var>fcn</var> a una ventana m&oacute;vil de longitud <var>wlen</var> en los datos <var>x</var> .
ja: 関数 <var>fcn</var> をデータ <var>x</var> 上の長さ <var>wlen</var> の移動ウィンドウに適用します。
ru: Примените функцию <var>fcn</var> к движущемуся окну длины <var>wlen</var> для данных <var>x</var> .
zh_cn: 将函数 <var>fcn</var> 应用于数据 <var>x</var> 上长度为 <var>wlen</var> 的移动窗口。

source: Apply the 2-D FIR filter <var>b</var> to <var>x</var>.
es: Aplicar el filtro de 2-D FIR <var>b</var> a <var>x</var> .
ja: 2次元FIRフィルター <var>b</var> を <var>x</var> に適用します。
ru: Примените 2-D FIR-фильтр <var>b</var> к <var>x</var> .
zh_cn: 将2-D FIR滤波器 <var>b</var> 应用于 <var>x</var> 。

source: Applying functions to arrays, cells, and structs
es: Aplicando funciones a los conjuntos,células y estructuras
ja: 配列、セル、および構造体への関数の適用
ru: Применение функций к массивам,ячейкам и структурам
zh_cn: 将函数应用于数组、单元格和结构。

source: Architecture-independent data files.
es: Archivos de datos independientes de la arquitectura.
ja: アーキテクチャに依存しないデータファイル。
ru: Архитектурно-независимые файлы данных.
zh_cn: 独立于结构的数据文件。

source: Area Series
es: Serie de áreas
ja: エリアシリーズ
ru: Территориальная серия
zh_cn: 面积系列

source: Area plot of the columns of <var>y</var>.
es: Gr&aacute;fica de &aacute;rea de las columnas de <var>y</var> .
ja: <var>y</var> の列の面積プロット。
ru: График площади столбцов <var>y</var> .
zh_cn: <var>y</var> 列的面积图。

source: Area series objects are created by the <code>area</code> function. Each of the <code>hggroup</code> elements contains a single patch object. The properties of the area series are
es: Los objetos de la serie de <code>area</code> son creados por la funci&oacute;n de &aacute;rea . Cada uno de los elementos de <code>hggroup</code> contiene un &uacute;nico objeto de parche. Las propiedades de la serie de &aacute;reas son
ja: エリアシリーズオブジェクトは、 <code>area</code> 関数によって作成されます。各 <code>hggroup</code> 要素には、単一のpatchオブジェクトが含まれています。エリアシリーズのプロパティは次のとおりです。
ru: Объекты серии <code>area</code> создаются функцией площадей . Каждый из элементов <code>hggroup</code> содержит один объект patch. Свойства серии площадей:
zh_cn: 区域系列对象由 <code>area</code> 功能创建。每个 <code>hggroup</code> 元素都包含一个补丁对象。区域系列的属性是

source: Arguments are
es: Los argumentos son
ja: 引数は
ru: Аргументы
zh_cn: 论据是

source: Arguments are concatenated vertically. The returned values are padded with blanks as needed to make each row of the string array have the same length. Empty input strings are significant and will concatenated in the output.
es: Los argumentos están concatenados verticalmente.Los valores devueltos se rellenan con espacios en blanco según sea necesario para que cada fila de la matriz de cuerdas tenga la misma longitud.Las cadenas de entrada vacías son significativas y se concatenarán en la salida.
ja: 引数は縦に連結されます。返された値は、文字列配列の各行が同じ長さになるように必要に応じて空白でパディングされます。空の入力文字列は重要な意味を持ち、出力では連結されます。
ru: Аргументы сжаты вертикально.Возвращаемые значения заполняются пробелами,необходимыми для того,чтобы каждая строка массива строк имела одинаковую длину.Пустые входные строки имеют существенное значение и будут сконцентрированы в выводе.
zh_cn: 参数是垂直连接的。返回的值会根据需要用空格填充,以使字符串数组的每一行都有相同的长度。空的输入字符串很重要,将在输出中进行连接。

source: Arguments are concatenated vertically. The returned values are padded with blanks as needed to make each row of the string array have the same length. Unlike <code>char</code>, empty strings are removed and will not appear in the output.
es: Los argumentos se concatenan verticalmente. Los valores devueltos se rellenan con espacios en blanco seg&uacute;n sea necesario para que cada fila de la matriz de cadenas tenga la misma longitud. A diferencia de <code>char</code> , las cadenas vac&iacute;as se eliminan y no aparecer&aacute;n en la salida.
ja: 引数は垂直方向に連結されます。文字列配列の各行が同じ長さになるように、必要に応じて戻り値に空白が埋め込まれます。 <code>char</code> とは異なり、空の文字列は削除され、出力には表示されません。
ru: Аргументы объединяются по вертикали. Возвращаемые значения дополняются пробелами по мере необходимости, чтобы каждая строка массива строк имела одинаковую длину. В отличие от <code>char</code> , пустые строки удаляются и не отображаются в выводе.
zh_cn: 参数是垂直连接的。返回的值将根据需要用空格填充，以使字符串数组的每一行具有相同的长度。与 <code>char</code> 不同，空字符串将被删除，并且不会出现在输出中。

source: Arguments may also be given in groups of three as
es: Los argumentos también pueden darse en grupos de tres como
ja: のように3つのグループで引数を与えることもできます。
ru: Аргументы могут быть также приведены в группах по три в качестве
zh_cn: 也可以以三人为一组的方式提供论据,如

source: Arithmetic Operators
es: Operadores aritméticos
ja: 算術演算子
ru: арифметические операторы
zh_cn: 算术运算符

source: Arithmetic Ops
es: Operaciones Aritméticas
ja: 算術演算装置
ru: арифметические операции
zh_cn: 算术操作

source: Array and Sparse Class Differences
es: Diferencias de clase de matrices y de clases dispersas
ja: 配列とスパースクラスの違い
ru: Массивные и разделенные классовые различия
zh_cn: 阵列和稀疏类的区别

source: Arrays may also be concatenated horizontally using the syntax for creating new matrices. For example:
es: Las matrices también pueden ser concatenadas horizontalmente usando la sintaxis para crear nuevas matrices.Por ejemplo:
ja: 配列は、新しい行列を作成するための構文を使用して水平方向に連結することもできます。例えば、以下のようになります。
ru: Массивы также можно объединять по горизонтали,используя синтаксис для создания новых матриц.Например:
zh_cn: 数组也可以使用创建新矩阵的语法进行水平连接。例如:

source: Arrays may also be concatenated vertically using the syntax for creating new matrices. For example:
es: Las matrices también pueden ser concatenadas verticalmente usando la sintaxis para crear nuevas matrices.Por ejemplo:
ja: 配列は、新しい行列を作成するための構文を使用して縦に連結することもできます。例えば、以下のようになります。
ru: Массивы также могут быть соединены вертикально,используя синтаксис для создания новых матриц.Например:
zh_cn: 数组也可以使用创建新矩阵的语法进行垂直连接。例如:

source: Artist name.
es: Nombre del artista.
ja: アーティスト名。
ru: Имя художника.
zh_cn: 艺术家名字:

source: As a complex example consider a parent function <code>ex_top</code> with two child functions, <code>ex_a</code> and <code>ex_b</code>. In addition, <code>ex_a</code> has two more child functions, <code>ex_aa</code> and <code>ex_ab</code>. For example:
es: Como ejemplo complejo, considere una funci&oacute;n padre <code>ex_top</code> con dos funciones hijo, <code>ex_a</code> y <code>ex_b</code> . Adem&aacute;s, <code>ex_a</code> tiene dos funciones secundarias m&aacute;s, <code>ex_aa</code> y <code>ex_ab</code> . Por ejemplo:
ja: 複雑な例として、親機能を考慮 <code>ex_top</code> 2つの関数、と <code>ex_a</code> と <code>ex_b</code> を。さらに、 <code>ex_a</code> には <code>ex_aa</code> と <code>ex_ab</code> の 2つの子関数があります。例えば：
ru: В качестве сложного примера рассмотрим родительскую функцию <code>ex_top</code> с двумя дочерними функциями <code>ex_a</code> и <code>ex_b</code> . Кроме того, <code>ex_a</code> имеет еще две дочерние функции: <code>ex_aa</code> и <code>ex_ab</code> . Например:
zh_cn: 作为一个复杂的例子考虑父功能 <code>ex_top</code> 具有两个子功能， <code>ex_a</code> 和 <code>ex_b</code> 。此外， <code>ex_a</code> 还有两个 <code>ex_aa</code> 和 <code>ex_ab</code> 。例如：
