Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/octave/octave.*.011.xlf
Languages: es, ja, ru, zh_cn

source: C = mat2cell (A, dim1, dim2, &hellip;, dimi, &hellip;, dimn)
zh_cn: C = mat2cell（A，dim1，dim2，...，dimi，...，dimn）

source: C = textscan (fid, format, param, value, &hellip;)
ru: C = textcan (идентификатор, формат, параметр, значение,&hellip;)
zh_cn: C = textscan（fid，格式，参数，值等）

source: C = textscan (fid, format, repeat, param, value, &hellip;)
ru: C = textcan (fid, format, repeat, param, value,&hellip;)
zh_cn: C = textscan（fid，格式，重复，参数，值等）

source: A_UP = triu (A)
ru: A_UP=триу (A)

source: A_UP = triu (A, k)
ru: A_UP=триу (A,k)

source: B = spdiags (A)
ru: B=спады (A)

source: B = spdiags (A, d)
ru: B=спады (A,d)

source: C = num2cell (A)
ru: C=цифра 2 ячейки (A)

source: C = textscan (str, &hellip;)
es: C = texto escaneado (str,&hellip;)
ru: C =textcan (str,&hellip;)
