Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/octave/octave.*.011.xlf
Languages: es, ja, ru, zh_cn

source: A diagonal matrix is defined as a matrix that has zero entries outside the main diagonal; that is, <code>D(i,j) == 0</code> if <code>i != j</code>. Most often, square diagonal matrices are considered; however, the definition can equally be applied to non-square matrices, in which case we usually speak of a rectangular diagonal matrix.
es: Una matriz diagonal se define como una matriz que tiene cero entradas fuera de la diagonal principal; es decir, <code>D(i,j) == 0</code> si <code>i != j</code> . Muy a menudo, se consideran matrices diagonales cuadradas; sin embargo, la definici&oacute;n se puede aplicar igualmente a matrices no cuadradas, en cuyo caso solemos hablar de una matriz diagonal rectangular.
ja: 対角行列は、主対角の外側のエントリがゼロの行列として定義されます。つまり、 <code>i != j</code> 場合、 <code>D(i,j) == 0</code> です。ほとんどの場合、正方対角行列が考慮されます。ただし、この定義は非正方行列にも同様に適用できます。その場合、通常、長方形の対角行列について説明します。
ru: Диагональная матрица определяется как матрица, у которой есть нулевые элементы вне главной диагонали; то есть <code>D(i,j) == 0</code> если <code>i != j</code> . Чаще всего рассматриваются квадратные диагональные матрицы; однако это определение в равной степени применимо к неквадратным матрицам, и в этом случае мы обычно говорим о прямоугольной диагональной матрице.
zh_cn: 对角矩阵定义为在主对角线之外具有零项的矩阵。也就是说，如果 <code>i != j</code> ，则 <code>D(i,j) == 0</code> 。最常见的是，考虑对角矩阵。但是，该定义同样适用于非正方形矩阵，在这种情况下，我们通常说的是矩形对角矩阵。

source: A difference between the oct-file interface to structures and the mex-file version is that the functions to operate on structures in mex-files directly include an <code>index</code> over the elements of the arrays of elements per <code>field</code>; Whereas, the oct-file structure includes a Cell Array per field of the structure.
es: Una diferencia entre la interfaz de archivos oct para estructuras y la versi&oacute;n de archivos mex es que las funciones para operar en estructuras en archivos mex incluyen directamente un <code>index</code> sobre los elementos de las matrices de elementos por <code>field</code> ; Considerando que, la estructura del archivo oct incluye una matriz de celdas por campo de la estructura.
ja: 構造体へのoct-fileインターフェイスとmex-fileバージョンの違いは、mex-filesの構造体を操作する関数には、 <code>field</code> ごとの要素の配列の要素に対する <code>index</code> 直接含まれていることです。一方、octファイル構造には、構造のフィールドごとにセル配列が含まれます。
ru: Различие между интерфейсом oct-файла к структурам и версией mex-файла заключается в том, что функции для работы со структурами в mex-файлах напрямую включают <code>index</code> по элементам массивов элементов на <code>field</code> ; Принимая во внимание, что структура файла oct включает в себя массив ячеек на каждое поле структуры.
zh_cn: 结构的oct-file接口与mex-file版本之间的区别在于，对mex-file中的结构进行操作的函数直接在每个 <code>field</code> 的元素数组的元素上包含一个 <code>index</code> ；而八进制文件结构在该结构的每个字段中都包含一个单元格数组。

source: A directory name or path name
es: Un nombre de directorio o un nombre de ruta
ja: ディレクトリ名またはパス名
ru: Имя каталога или путь к нему
zh_cn: 目录名或路径名

source: A documentation cache is generated for all functions in <var>directory</var> which may be a single string or a cell array of strings. The cache is used to speed up the function <code>lookfor</code>.
es: Se genera una cach&eacute; de documentaci&oacute;n para todas las funciones en el <var>directory</var> que puede ser una sola cadena o una matriz de cadenas de celdas. La cach&eacute; se utiliza para acelerar la <code>lookfor</code> funciones .
ja: ドキュメントキャッシュは、単一の文字列または文字列のセル配列である <var>directory</var> 内のすべての関数に対して生成されます。キャッシュは、関数 <code>lookfor</code> を高速化するために使用されます。
ru: Кэш документации создается для всех функций в <var>directory</var> который может быть одной строкой или массивом ячеек строк. Кеш используется для ускорения <code>lookfor</code> функций .
zh_cn: 将为 <var>directory</var> 中的所有功能生成一个文档缓存，该缓存可以是单个字符串或字符串的单元格数组。高速缓存用于加速功能 <code>lookfor</code> 。

source: A double precision array class defined in
es: Una clase de matriz de doble precisión definida en
ja: で定義されている倍精度配列クラス
ru: Класс массива двойной точности,определенный в
zh_cn: 中定义的双精度数组类。

source: A double precision matrix class defined in
es: Una clase de matriz de doble precisión definida en
ja: で定義されている倍精度の行列クラス
ru: Класс матрицы двойной точности,определенный в
zh_cn: 中定义的双精度矩阵类。

source: A double precision sparse matrix class
es: Una clase de matriz dispersa de doble precisión
ja: 倍精度の疎な行列クラス
ru: Класс разреженных матриц двойной точности
zh_cn: 双精度稀疏矩阵类

source: A figure window.
es: Una ventana de figuras.
ja: 図のウィンドウ。
ru: Фигурное окно.
zh_cn: 一个数字窗口。

source: A filename with spaces.txt
ja: ファイル名に spaces.txt を指定した場合
zh_cn: 带有空格.txt的文件名

source: A filled polygon, currently limited to two dimensions.
es: Un polígono relleno,actualmente limitado a dos dimensiones.
ja: 塗りつぶされた多角形で、現在は二次元に制限されています。
ru: Наполненный полигон,в настоящее время ограниченный двумя измерениями.
zh_cn: 一个填充的多边形,目前仅限于二维。

source: A fixed set of functions are <em>built-in</em>, which means they are available in every Octave program. The <code>sqrt</code> function is one of these. In addition, you can define your own functions. See <a href="functions-and-scripts#Functions-and-Scripts">Functions and Scripts</a>, for information about how to do this.
es: Se <em>incorpora</em> un conjunto fijo de funciones , lo que significa que est&aacute;n disponibles en todos los programas de Octave. La funci&oacute;n <code>sqrt</code> es una de ellas. Adem&aacute;s, puede definir sus propias funciones. Consulte <a href="functions-and-scripts#Functions-and-Scripts">Funciones y secuencias de comandos</a> para obtener informaci&oacute;n sobre c&oacute;mo hacer esto.
ja: 関数の固定セットが<em>組み込まれ</em>ています。つまり、すべてのOctaveプログラムで使用できます。 <code>sqrt</code> 機能は、これらのいずれかです。さらに、独自の関数を定義できます。これを行う方法については、<a href="functions-and-scripts#Functions-and-Scripts">関数とスクリプトを</a>参照してください。
ru: <em>Встроенный</em> фиксированный набор функций означает, что они доступны в каждой программе Octave. Функция <code>sqrt</code> - одна из них. Кроме того, вы можете определять свои собственные функции. См. &laquo; <a href="functions-and-scripts#Functions-and-Scripts">Функции и сценарии&raquo;</a> , чтобы узнать, как это сделать.
zh_cn: <em>内置了一</em>组固定的函数，这意味着它们在每个Octave程序中都可用。该 <code>sqrt</code> 功能就是其中之一。另外，您可以定义自己的功能。有关如何执行此操作的信息，请参见<a href="functions-and-scripts#Functions-and-Scripts">函数和脚本</a>。

source: A free (unbounded) constraint (the constraint is ignored).
es: Una restricción libre (sin límites)(la restricción es ignorada).
ja: 自由な(拘束されていない)制約(制約は無視される)。
ru: Свободное (неограниченное)ограничение (ограничение игнорируется).
zh_cn: 一个自由(无约束)的约束(约束被忽略)。

source: A full format string is:
es: Una cadena de formato completo es:
ja: フルフォーマットの文字列です。
ru: Полная строка формата:
zh_cn: 一个完整的格式字符串是:

source: A function file may contain secondary functions called <em>subfunctions</em>. These secondary functions are only visible to the other functions in the same function file. For example, a file
es: Un archivo de funci&oacute;n puede contener funciones secundarias llamadas <em>subfunciones</em> . Estas funciones secundarias solo son visibles para las otras funciones en el mismo archivo de funci&oacute;n. Por ejemplo, un archivo
ja: 関数ファイルには、<em>サブ</em>関数と呼ばれる二次関数が含まれる場合があります。これらの2次関数は、同じ関数ファイル内の他の関数にのみ表示されます。たとえば、ファイル
ru: Файл функций может содержать вторичные функции, называемые <em>подфункциями</em> . Эти вторичные функции видны только другим функциям в том же файле функции. Например, файл
zh_cn: 功能文件可能包含称为<em>子功能的</em>辅助功能。这些辅助功能仅对同一功能文件中的其他功能可见。例如，一个文件

source: A function handle is a pointer to another function and is defined with the syntax
es: Un mango de función es un puntero a otra función y se define con la sintaxis
ja: 関数ハンドルは別の関数へのポインタで、構文
ru: Хэндл функции является указателем на другую функцию и определяется синтаксисом
zh_cn: 函数句柄是指向另一个函数的指针,其定义语法为

source: A function handle to confirm if a file is of the specified format.
es: Un mango de función para confirmar si un archivo tiene el formato especificado.
ja: 指定した形式のファイルかどうかを確認するための関数ハンドルです。
ru: Ручка функций для подтверждения того,что файл имеет указанный формат.
zh_cn: 用于确认文件是否为指定格式的函数句柄。

source: A function handle to obtain image information of the specified format.
es: Un mango de función para obtener información de la imagen del formato especificado.
ja: 指定されたフォーマットの画像情報を取得するための関数ハンドル。
ru: Ручка функций для получения информации об изображении указанного формата.
zh_cn: 获取指定格式的图像信息的函数句柄。

source: A function handle to open files the specified format.
es: Una función que permite abrir archivos con el formato especificado.
ja: 指定した形式のファイルを開くための関数ハンドルです。
ru: Ручка функций для открытия файлов указанного формата.
zh_cn: 一个函数句柄,用于打开指定格式的文件。

source: A function handle to write if a file is of the specified format.
es: Una función que se maneja para escribir si un archivo tiene el formato especificado.
ja: 指定した形式のファイルであるかどうかを書き込むための関数ハンドル。
ru: Ручка функции для записи,если файл имеет указанный формат.
zh_cn: 如果文件是指定格式,则写一个函数句柄。

source: A function may be abstracted and referenced via a function handle acquired using the special operator &lsquo;
es: Una funci&oacute;n puede ser abstra&iacute;da y referenciada a trav&eacute;s de un identificador de funci&oacute;n adquirido usando el operador especial '
ja: 関数は、特殊な演算子を使用して取得した関数ハンドルを介して抽象化および参照できます '
ru: Функция может быть абстрагирована и на нее можно ссылаться через дескриптор функции, полученный с помощью специального оператора '
zh_cn: 可以通过使用特殊运算符'

source: A function much similar to <code>fputs</code> is available for writing data to the screen. The <code>puts</code> function works just like <code>fputs</code> except it doesn&rsquo;t take a file pointer as its input.
es: Hay disponible una funci&oacute;n muy similar a <code>fputs</code> para escribir datos en la pantalla. Los <code>puts</code> funcionan funciona igual que <code>fputs</code> excepto que no toma un puntero a un archivo como entrada.
ja: 画面にデータを書き込むために、 <code>fputs</code> によく似た関数を使用できます。 <code>puts</code> 同じような作品に機能 <code>fputs</code> を、その入力としてファイルポインタを取らない点が異なります。
ru: Для записи данных на экран доступна функция, очень похожая на <code>fputs</code> . Функция <code>puts</code> работает так же, как <code>fputs</code> , за исключением того, что она не принимает на вход указатель файла.
zh_cn: 可使用与 <code>fputs</code> 非常相似的功能将数据写入屏幕。该 <code>puts</code> 函数就像 <code>fputs</code> 但它并不需要一个文件指针作为它的输入。

source: A further constraint on the sparse matrix storage used by Octave is that all elements in the rows are stored in increasing order of their row index, which makes certain operations faster. However, it imposes the need to sort the elements on the creation of sparse matrices. Having disordered elements is potentially an advantage in that it makes operations such as concatenating two sparse matrices together easier and faster, however it adds complexity and speed problems elsewhere.
es: Otra limitación del almacenamiento de matriz dispersa utilizado por Octave es que todos los elementos de las filas se almacenan en orden creciente de su índice de fila,lo que hace que ciertas operaciones sean más rápidas.Sin embargo,impone la necesidad de clasificar los elementos en la creación de matrices dispersas.El hecho de tener elementos desordenados es potencialmente una ventaja en el sentido de que hace que operaciones como la concatenación de dos matrices dispersas juntas sean más fáciles y rápidas,sin embargo añade problemas de complejidad y velocidad en otros lugares.
ja: Octaveによって使用される疎な行列の記憶に関するさらなる制約は,行内のすべての要素がその行のインデッ クスの高い順に記憶されることであり,これはある種の操作を高速化します。しかし,これは,疎な行列の作成時に要素をソートする必要性を課しています。無秩序な要素を持つことは,2つの疎な行列を連結するなどの操作をより簡単かつ高速にするという点で,潜在的な利点がありますが,他の場所では複雑さと速度の問題が追加されます。
ru: Еще одним ограничением для разреженного матричного хранилища,используемого Октавой,является то,что все элементы в строках хранятся в порядке возрастания их рядового индекса,что ускоряет выполнение определенных операций.Однако это накладывает необходимость сортировки элементов при создании разреженных матриц.Наличие неупорядоченных элементов потенциально является преимуществом в том,что делает такие операции,как объединение двух разрозненных матриц вместе,проще и быстрее,однако в других местах это усложняет и ускоряет работу.
zh_cn: Octave使用的稀疏矩阵存储的另一个约束条件是,行中的所有元素按其行索引的递增顺序存储,这使得某些操作变得更快。然而,它要求在创建稀疏矩阵时需要对元素进行排序。拥有无序元素是一个潜在的优势,因为它使诸如将两个稀疏矩阵连接在一起的操作变得更容易和更快,然而它在其他地方增加了复杂性和速度问题。

source: A general recommendation for users unfamiliar with these techniques is to use the function <code>repmat</code> for replicating smaller arrays into bigger ones, which uses such tricks.
es: Una recomendaci&oacute;n general para los usuarios que no <code>repmat</code> familiarizados con estas t&eacute;cnicas es utilizar la funci&oacute;n repmat para replicar matrices m&aacute;s peque&ntilde;as en matrices m&aacute;s grandes, que utiliza estos trucos.
ja: これらの手法に慣れていないユーザーに対する一般的な推奨事項は、関数 <code>repmat</code> を使用して、小さい配列を大きい配列に複製し、そのようなトリックを使用することです。
ru: Общая рекомендация для пользователей, незнакомых с этими методами, - использовать функцию <code>repmat</code> для репликации меньших массивов в большие, которая использует такие приемы.
zh_cn: 对于不熟悉这些技术的用户，通常的建议是使用函数 <code>repmat</code> 将较小的阵列复制到较大的阵列中，这使用了这些技巧。

source: A generalization of the function <code>diag</code>.
es: Una generalizaci&oacute;n de la funci&oacute;n <code>diag</code> .
ja: 関数 <code>diag</code> の一般化。
ru: Обобщение функции <code>diag</code> .
zh_cn: 函数 <code>diag</code> 的推广。

source: A global installation (package available to all users) is forced, even if the user doesn&rsquo;t normally have system privileges.
es: Se fuerza una instalaci&oacute;n global (paquete disponible para todos los usuarios), incluso si el usuario normalmente no tiene privilegios del sistema.
ja: ユーザーに通常システム権限がない場合でも、グローバルインストール（すべてのユーザーが利用できるパッケージ）が強制されます。
ru: Глобальная установка (пакет доступен всем пользователям) принудительно, даже если пользователь обычно не имеет системных привилегий.
zh_cn: 即使该用户通常没有系统特权，也必须强制进行全局安装（所有用户都可以使用该软件包）。

source: A global variable may only be initialized once in a <code>global</code> statement. For example, after executing the following code
es: Una variable global solo se puede inicializar una vez en una declaraci&oacute;n <code>global</code> . Por ejemplo, despu&eacute;s de ejecutar el siguiente c&oacute;digo
ja: グローバル変数は、 <code>global</code> ステートメントで一度だけ初期化できます。たとえば、次のコードを実行した後
ru: Глобальная переменная может быть инициализирована только один раз в <code>global</code> операторе. Например, после выполнения следующего кода
zh_cn: 全局变量只能在 <code>global</code> 语句中初始化一次。例如，执行以下代码后

source: A handle property. This kind of property holds the handle of a graphics object. <var>arg</var> contains the default handle value. When no default value is given, the property is initialized to the empty matrix.
es: Una propiedad de identificador. Este tipo de propiedad tiene el identificador de un objeto gr&aacute;fico. <var>arg</var> contiene el valor de identificador predeterminado. Cuando no se proporciona un valor predeterminado, la propiedad se inicializa en la matriz vac&iacute;a.
ja: ハンドルプロパティ。この種類のプロパティは、グラフィックスオブジェクトのハンドルを保持します。 <var>arg</var> には、デフォルトのハンドル値が含まれています。デフォルト値が指定されていない場合、プロパティは空の行列に初期化されます。
ru: Свойство ручки. Это свойство содержит дескриптор графического объекта. <var>arg</var> содержит значение дескриптора по умолчанию. Если значение по умолчанию не указано, свойство инициализируется пустой матрицей.
zh_cn: 句柄属性。这种属性持有图形对象的句柄。 <var>arg</var> 包含默认句柄值。如果未提供默认值，则该属性将初始化为空矩阵。

source: A legend is implemented as an additional axes object with the <code>tag</code> property set to <code>"legend"</code>. Properties of the legend object may be manipulated directly by using <code>set</code>.
es: Una leyenda se implementa como un objeto de ejes adicional con la propiedad de <code>tag</code> establecida en <code>"legend"</code> . Las propiedades del objeto de leyenda se pueden manipular directamente usando <code>set</code> .
ja: 凡例は、 <code>tag</code> プロパティが <code>"legend"</code> に設定された追加のAxesオブジェクトとして実装されます。凡例オブジェクトのプロパティは、 <code>set</code> を使用して直接操作できます。
ru: Легенда реализована как дополнительный объект осей со свойством <code>tag</code> установленным на <code>"legend"</code> . Свойства объекта легенды можно изменять напрямую с помощью <code>set</code> .
zh_cn: 将图例作为附加轴对象实现，其 <code>tag</code> 属性设置为 <code>"legend"</code> 。图例对象的属性可以通过使用 <code>set</code> 直接操作。

source: A light object has the following properties which alter the appearance of the plot.
es: Un objeto luminoso tiene las siguientes propiedades que alteran el aspecto de la trama.
ja: ライトオブジェクトは、プロットの外観を変化させる以下の特性を持っています。
ru: Светлый объект обладает следующими свойствами,которые изменяют внешний вид участка.
zh_cn: 光对象具有以下属性,可以改变情节的外观。

source: A light object used for lighting effects on patches and surfaces.
es: Un objeto de luz usado para efectos de iluminación en parches y superficies.
ja: パッチや表面の照明効果に使用されるライトオブジェクト。
ru: Световой объект,используемый для осветительных эффектов на пятнах и поверхностях.
zh_cn: 用于在斑块和表面上产生照明效果的光对象。

source: A line in two or three dimensions.
es: Una línea en dos o tres dimensiones.
ja: 2次元または3次元の線。
ru: Линия в двух или трех измерениях.
zh_cn: 二维或三维中的一条线。

source: A link starting with &lsquo;
es: Un enlace que comienza con '
ja: 'で始まるリンク
ru: Ссылка, начинающаяся с "
zh_cn: 以'开头的链接

source: A list of default values to place in each text field. It must be a cell array of strings with the same size as <var>prompt</var>.
es: Una lista de valores predeterminados para colocar en cada campo de texto. Debe ser una matriz de cadenas de celdas con el mismo tama&ntilde;o que el <var>prompt</var> .
ja: 各テキストフィールドに配置するデフォルト値のリスト。これは、 <var>prompt</var> と同じサイズの文字列のセル配列でなければなりません。
ru: Список значений по умолчанию для размещения в каждом текстовом поле. Это должен быть массив ячеек со строками того же размера, что и <var>prompt</var> .
zh_cn: 放置在每个文本字段中的默认值列表。它必须是字符串的单元格数组，其大小与 <var>prompt</var> 相同。

source: A list of graphic handles can also be passed as the first argument. In this case, the properties of these handles and all child <code>patch</code> and <code>surface</code> objects will be updated.
es: Tambi&eacute;n se puede pasar una lista de identificadores gr&aacute;ficos como primer argumento. En este caso, se actualizar&aacute;n las propiedades de estos identificadores y todos los <code>patch</code> secundarios y <code>surface</code> objetos de superficie .
ja: グラフィックハンドルのリストを最初の引数として渡すこともできます。この場合、これらのハンドルとすべての子 <code>patch</code> および <code>surface</code> オブジェクトのプロパティが更新されます。
ru: Список графических дескрипторов также может быть передан в качестве первого аргумента. В этом случае будут обновлены свойства этих маркеров и всех дочерних <code>patch</code> и объектов <code>surface</code> .
zh_cn: 图形句柄列表也可以作为第一个参数传递。在这种情况下，将更新这些控柄以及所有子 <code>surface</code> <code>patch</code> 和表面对象的属性。

source: A list of ideas for future enhancements is distributed with Octave. See the file
es: Una lista de ideas para futuras mejoras se distribuye con Octava.Vea el archivo
ja: 将来の拡張のためのアイデアのリストがOctaveと一緒に配布されています。ファイルを参照してください。
ru: Список идей для будущих усовершенствований распространяется вместе с Октавой.См.файл
zh_cn: 一个关于未来增强功能的想法清单随Octave一起分发。参见文件

source: A list of other Octave packages that this package depends on. This can include dependencies on particular versions, with a format
es: Una lista de otros paquetes de Octava de los que depende este paquete.Esto puede incluir dependencias de versiones particulares,con un formato
ja: このパッケージが依存する他のOctaveパッケージのリスト。これは、特定のバージョンへの依存関係を含むことができます。
ru: Список других октавных пакетов,от которых зависит данный пакет.Он может включать в себя зависимости от конкретных версий,в формате
zh_cn: 该软件包所依赖的其他Octave软件包的列表。这可以包括对特定版本的依赖,格式为

source: A list of the basic <code>Matrix</code> and <code>Array</code> types, the methods to extract these from an <code>octave_value</code>, and the associated header file is listed below.
es: A continuaci&oacute;n se incluye una lista de los tipos b&aacute;sicos de <code>Matrix</code> y <code>Array</code> , los m&eacute;todos para extraerlos de un <code>octave_value</code> y el archivo de encabezado asociado.
ja: 基本的な <code>Matrix</code> および <code>Array</code> タイプのリスト、 <code>octave_value</code> からこれらを抽出するメソッド、および関連するヘッダーファイルを以下に示します。
ru: Список основных типов <code>Matrix</code> и <code>Array</code> , методы их извлечения из <code>octave_value</code> и связанный файл заголовка перечислены ниже.
zh_cn: 下面列出了基本的 <code>Matrix</code> 和 <code>Array</code> 类型，从 <code>octave_value</code> 中提取它们的方法以及相关的头文件的列表。

source: A local installation (package available only to current user) is forced, even if the user has system privileges.
es: Se obliga a realizar una instalación local (paquete disponible sólo para el usuario actual),incluso si el usuario tiene privilegios de sistema.
ja: ユーザーがシステム権限を持っていても、ローカルインストール(現在のユーザーのみが利用可能なパッケージ)が強制的に行われます。
ru: Локальная установка (пакет,доступный только текущему пользователю)принудительна,даже если пользователь имеет системные привилегии.
zh_cn: 即使用户有系统权限,也会强制进行本地安装(包只对当前用户可用)。

source: A long description of the file format.
es: Una larga descripción del formato del archivo.
ja: ファイル形式の長い説明。
ru: Длинное описание формата файла.
zh_cn: 文件格式的长篇描述。

source: A lower triangular matrix has nonzero entries only on the main diagonal and below.
es: Una matriz triangular inferior tiene entradas que no son cero sólo en la diagonal principal y abajo.
ja: 下位三角行列は、主対角線上とその下にのみ非ゼロのエントリを持つ。
ru: Нижняя треугольная матрица имеет ненулевые значения только по главной диагонали и ниже.
zh_cn: 一个下三角矩阵只有在主对角线上和下面有非零的条目。

source: A magic square is an arrangement of the integers <code>1:n^2</code> such that the row sums, column sums, and diagonal sums are all equal to the same value.
es: Un cuadrado m&aacute;gico es una disposici&oacute;n de los n&uacute;meros enteros <code>1:n^2</code> modo que las sumas de las filas, las sumas de las columnas y las sumas diagonales son todas iguales al mismo valor.
ja: 魔方陣とは、行の合計、列の合計、および対角の合計がすべて同じ値になるような整数 <code>1:n^2</code> 配置です。
ru: Магический квадрат - это такое расположение целых чисел <code>1:n^2</code> , при котором суммы строк, суммы столбцов и диагональные суммы равны одному и тому же значению.
zh_cn: 幻方是整数 <code>1:n^2</code> 的排列，以使行总和，列总和对角线总和都等于相同的值。

source: A marker is plotted at each point defined by the coordinates in the vectors <var>x</var> and <var>y</var>.
es: Un marcador se representa en cada punto definido por las coordenadas en los vectores <var>x</var> y <var>y</var> .
ja: マーカーは、ベクトル <var>x</var> と <var>y</var> の座標によって定義される各点にプロットされます。
ru: Маркер наносится в каждой точке, определяемой координатами векторов <var>x</var> и <var>y</var> .
zh_cn: 在由向量 <var>x</var> 和 <var>y</var> 的坐标定义的每个点上绘制一个标记。

source: A marker is plotted at each point defined by the coordinates in the vectors <var>x</var>, <var>y</var>, and <var>z</var>.
es: Se traza un marcador en cada punto definido por las coordenadas en los vectores <var>x</var> , <var>y</var> y <var>z</var> .
ja: マーカーは、ベクトル <var>x</var> 、 <var>y</var> 、 <var>z</var> の座標によって定義される各点にプロットされます。
ru: Маркер наносится в каждой точке, определяемой координатами векторов <var>x</var> , <var>y</var> и <var>z</var> .
zh_cn: 在由向量 <var>x</var> ， <var>y</var> 和 <var>z</var> 的坐标定义的每个点上绘制一个标记。

source: A matrix containing the RGB color map for the current axes.
es: Una matriz que contiene el mapa de colores RGB para los ejes actuales.
ja: 現在の軸のRGBカラーマップを含む行列。
ru: Матрица,содержащая цветовую карту RGB для текущих осей.
zh_cn: 一个包含当前轴的RGB颜色图的矩阵。

source: A matrix containing the constraints coefficients.
es: Una matriz que contiene los coeficientes de restricción.
ja: 制約係数を含む行列。
ru: Матрица,содержащая коэффициенты ограничений.
zh_cn: 包含约束系数的矩阵。
