Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/octave/octave.*.011.xlf
Languages: es, ja, ru, zh_cn

source: As a consequence of using <code>quadcc</code>, <code>quadgk</code>, and <code>quadv</code>, certain option combinations are not supported. Currently, <code>"ArrayValued"</code> cannot be combined with <code>"RelTol"</code> or <code>"Waypoints"</code>.
es: Como consecuencia del uso de <code>quadcc</code> , <code>quadgk</code> y <code>quadv</code> , no se admiten determinadas combinaciones de opciones. Actualmente, <code>"ArrayValued"</code> no se puede combinar con <code>"RelTol"</code> o <code>"Waypoints"</code> .
ja: <code>quadcc</code> 、 <code>quadgk</code> 、および <code>quadv</code> を使用した結果、特定のオプションの組み合わせはサポートされません。現在、 <code>"ArrayValued"</code> と組み合わせることはできません <code>"RelTol"</code> または <code>"Waypoints"</code> 。
ru: Вследствие использования <code>quadcc</code> , <code>quadgk</code> и <code>quadv</code> некоторые комбинации опций не поддерживаются. В настоящее время <code>"ArrayValued"</code> нельзя комбинировать с <code>"RelTol"</code> или <code>"Waypoints"</code> Путевыми точками &raquo; .
zh_cn: 由于使用了 <code>quadcc</code> ， <code>quadgk</code> 和 <code>quadv</code> ，因此不支持某些选项组合。当前， <code>"ArrayValued"</code> 不能与 <code>"RelTol"</code> 或 <code>"Waypoints"</code> 结合使用。

source: As a general rule, functions should already be written with matrix arguments in mind and should consider whole matrix operations in a vectorized manner. Sometimes, writing functions in this way appears difficult or impossible for various reasons. For those situations, Octave provides facilities for applying a function to each element of an array, cell, or struct.
es: Por regla general,las funciones deben escribirse ya con argumentos de matriz en mente y deben considerar operaciones de matriz entera de manera vectorizada.A veces,escribir las funciones de esta manera parece difícil o imposible por varias razones.Para esas situaciones,Octave ofrece facilidades para aplicar una función a cada elemento de una matriz,célula o estructura.
ja: 一般的なルールとして,関数はすでに行列の引数を念頭に置いて書かれており,行列全体の演算をベクトル化した方法で考慮しなければなりません.時々,このように関数を書くことが,様々な理由で困難に見えたり,不可能に見えたりします。このような状況に対して,Octaveは,配列,セル,構造体の各要素に関数を適用する機能を提供しています。
ru: Как правило,функции уже должны быть написаны с учетом аргументов матрицы и должны векторизованно рассматривать целые матричные операции.Иногда по разным причинам написание функций таким образом оказывается затруднительным или невозможным.Для таких ситуаций Октава предоставляет средства для применения функции к каждому элементу массива,ячейке или структуре.
zh_cn: 一般来说,函数的编写应该已经考虑到了矩阵参数,应该以向量化的方式考虑整个矩阵的运算。有时,由于各种原因,以这种方式编写函数似乎很难或不可能。对于这些情况,Octave提供了将函数应用于数组、单元格或结构体的每个元素的功能。

source: As a less trivial example, instead of
es: Como un ejemplo menos trivial,en lugar de
ja: 些細な例として、代わりに
ru: В качестве менее банального примера,вместо того,чтобы
zh_cn: 举一个不那么简单的例子,而非

source: As a measure of dispersion, <code>mad</code> is less affected by outliers than <code>std</code>.
es: Como medida de dispersi&oacute;n, <code>mad</code> valores at&iacute;picos afectan menos a mad que <code>std</code> .
ja: 分散の尺度として、 <code>mad</code> は <code>std</code> よりも外れ値の影響を受けません。
ru: В качестве меры дисперсии <code>mad</code> меньше подвержен выбросам, чем <code>std</code> .
zh_cn: 作为分散性的度量， <code>mad</code> 受异常值的影响小于 <code>std</code> 。

source: As a measure of dispersion, the interquartile range is less affected by outliers than either <code>range</code> or <code>std</code>.
es: Como medida de dispersi&oacute;n, el rango intercuart&iacute;lico se ve menos afectado por valores at&iacute;picos que el <code>range</code> o el <code>std</code> .
ja: 分散の尺度として、四分位範囲は <code>range</code> または <code>std</code> よりも外れ値の影響を受けません。
ru: В качестве меры дисперсии межквартильного диапазон менее подвержен воздействию выбросов , чем любой из <code>range</code> или <code>std</code> .
zh_cn: 作为弥散度的度量，四分位数范围受离群值的影响小于 <code>range</code> 或 <code>std</code> 。

source: As a simple example, consider a function <code>func1</code>, that calls a helper function <code>func2</code> to do much of the work. For example:
es: Como ejemplo simple, considere una funci&oacute;n <code>func1</code> , que llama a una funci&oacute;n auxiliar <code>func2</code> para hacer gran parte del trabajo. Por ejemplo:
ja: 簡単な例として、ヘルパー関数 <code>func2</code> を呼び出してほとんどの作業を行う関数 <code>func1</code> を考えてみましょう。例えば：
ru: В качестве простого примера рассмотрим функцию <code>func1</code> , которая вызывает вспомогательную функцию <code>func2</code> для выполнения большей части работы. Например:
zh_cn: 举一个简单的例子，考虑一个函数 <code>func1</code> ，该函数调用一个辅助函数 <code>func2</code> 来完成许多工作。例如：

source: As a simple example, consider a parent function <code>foo</code>, that calls a nested child function <code>bar</code>, with a shared variable <var>x</var>.
es: Como ejemplo simple, considere una funci&oacute;n padre <code>foo</code> , que llama a una <code>bar</code> ra de funci&oacute;n secundaria anidada , con una variable compartida <var>x</var> .
ja: 簡単な例として、ネストされた子関数 <code>bar</code> を呼び出す親関数 <code>foo</code> と、共有変数 <var>x</var> を考えます。
ru: В качестве простого примера рассмотрим родительскую функцию <code>foo</code> , которая вызывает вложенную дочернюю <code>bar</code> функций с общей переменной <var>x</var> .
zh_cn: 举一个简单的例子，考虑一个父函数 <code>foo</code> ，它调用一个带有共享变量 <var>x</var> 的嵌套子函数 <code>bar</code> 。

source: As a trivial example of an executable Octave script, you might create a text file named
es: Como un ejemplo trivial de un guión de Octava ejecutable,podrías crear un archivo de texto llamado
ja: 実行可能なOctaveスクリプトの些細な例として,以下の名前のテキストファイルを作成することができます。
ru: В качестве тривиального примера исполняемого сценария Октавы,вы можете создать текстовый файл с именем
zh_cn: 作为一个简单的可执行Octave脚本的例子,您可以创建一个名为

source: As a trivial example of the use of <em>gplot</em> consider the example,
es: Como ejemplo trivial del uso de <em>gplot,</em> considere el ejemplo,
ja: <em>gplot</em>の使用の簡単な例として、例を考えます。
ru: В качестве тривиального примера использования <em>gplot</em> рассмотрим пример,
zh_cn: 作为使用<em>gplot</em>的简单示例，<em>请</em>考虑以下示例：

source: As all of the mixed operators and functions between full and sparse matrices exist, in general this does not cause any problems. However, one area where it does cause a problem is where a sparse matrix is promoted to a full matrix, where subsequent operations would resparsify the matrix. Such cases are rare, but can be artificially created, for example <code>(fliplr (speye (3)) + speye (3)) - speye (3)</code> gives a full matrix when it should give a sparse one. In general, where such cases occur, they impose only a small memory penalty.
es: Como existen todos los operadores y funciones mixtos entre matrices completas y dispersas, en general esto no causa ning&uacute;n problema. Sin embargo, un &aacute;rea en la que s&iacute; causa un problema es cuando una matriz dispersa se promueve a una matriz completa, donde las operaciones posteriores volver&iacute;an a esparcir la matriz. Tales casos son raros, pero pueden crearse artificialmente, por ejemplo <code>(fliplr (speye (3)) + speye (3)) - speye (3)</code> da una matriz completa cuando deber&iacute;a dar una escasa. En general, cuando ocurren tales casos, imponen solo una peque&ntilde;a penalizaci&oacute;n de memoria.
ja: 完全行列と疎行列の間にすべての混合演算子と関数が存在するため、一般にこれは問題を引き起こしません。ただし、問題が発生する領域の1つは、スパースマトリックスが完全なマトリックスに昇格し、その後の操作でマトリックスが再スパース化されることです。このようなケースはまれですが、人工的に作成できます。たとえば、 <code>(fliplr (speye (3)) + speye (3)) - speye (3)</code> は、スパース行列が必要なときに完全な行列を提供します。一般に、このようなケースが発生した場合、メモリのペナルティはほんのわずかです。
ru: Поскольку все смешанные операторы и функции между полными и разреженными матрицами существуют, в целом это не вызывает никаких проблем. Однако одна область, где это действительно вызывает проблему, - это когда разреженная матрица превращается в полную матрицу, где последующие операции будут повторно анализировать матрицу. Такие случаи редки, но могут быть созданы искусственно, например <code>(fliplr (speye (3)) + speye (3)) - speye (3)</code> дает полную матрицу, тогда как должна давать разреженную. Как правило, в таких случаях они накладывают лишь небольшой штраф за память.
zh_cn: 由于存在完整矩阵和稀疏矩阵之间的所有混合运算符和函数，因此通常不会造成任何问题。但是，确实会引起问题的一个领域是将稀疏矩阵提升为完整矩阵，随后的操作将重新分配矩阵。这种情况很少见，但是可以人为地创建，例如 <code>(fliplr (speye (3)) + speye (3)) - speye (3)</code> 在应提供稀疏矩阵时给出完整的矩阵。通常，在发生这种情况的地方，它们只会施加很小的内存损失。

source: As alternatives to <code>validateattributes</code> there are several shorter convenience functions to check for individual properties.
ja: <code>validateattributes</code> の代わりに、個々のプロパティをチェックするためのより短い便利な関数がいくつかあります。
zh_cn: 作为 <code>validateattributes</code> 属性的替代方法，有几个简短的便捷功能可以检查单个属性。

source: As an alternative to creating empty cell arrays, and then filling them, it is possible to convert numerical arrays into cell arrays using the <code>num2cell</code>, <code>mat2cell</code> and <code>cellslices</code> functions.
es: Como alternativa a crear matrices de celdas vac&iacute;as y luego llenarlas, es posible convertir matrices num&eacute;ricas en matrices de celdas usando las <code>num2cell</code> , <code>mat2cell</code> y <code>cellslices</code> .
ja: 空のセル配列を作成してそれらを埋める代わりに、 <code>num2cell</code> 、 <code>mat2cell</code> 、および <code>cellslices</code> 関数を使用して数値配列をセル配列に変換することができます。
ru: В качестве альтернативы созданию массивов пустых ячеек и последующему их заполнению можно преобразовать числовые массивы в массивы ячеек с помощью <code>num2cell</code> , <code>mat2cell</code> и <code>cellslices</code> .
zh_cn: 作为创建空单元格数组然后填充它们的替代方法，可以使用 <code>num2cell</code> ， <code>mat2cell</code> 和 <code>cellslices</code> 函数将数字数组转换为单元格数组。

source: As an example the following code creates a 3-by-3 matrix and saves it to the file &lsquo;
es: Como ejemplo, el siguiente c&oacute;digo crea una matriz de 3 por 3 y la guarda en el archivo '
ja: 例として、次のコードは3行3列の行列を作成し、ファイルに保存します '
ru: В качестве примера следующий код создает матрицу 3 на 3 и сохраняет ее в файл '
zh_cn: 例如，以下代码创建一个3&times;3矩阵并将其保存到文件&ldquo;

source: As an example the following function sets the first output argument to 1, the second to 2, and so on.
es: Como ejemplo,la siguiente función establece el primer argumento de salida en 1,el segundo en 2,y así sucesivamente.
ja: 例として、以下の関数では、第1引数の出力を1に、第2引数の出力を2に設定しています。
ru: В качестве примера следующая функция устанавливает первый выходной аргумент равным 1,второй-2 и так далее.
zh_cn: 例如,下面的函数将第一个输出参数设置为1,第二个设置为2,以此类推。

source: As an example,
es: Como ejemplo,
ja: 一例として。
ru: В качестве примера,
zh_cn: 举个例子:

source: As an example, the first sentence of this help text is
es: Como ejemplo,la primera frase de este texto de ayuda es
ja: 例として、このヘルプテキストの最初の文は
ru: В качестве примера,первое предложение этого справочного текста выглядит следующим образом
zh_cn: 例如,该帮助文本的第一句话是

source: As an example, the following code creates a cell array containing a string and a 2-by-2 random matrix
es: Como ejemplo,el siguiente código crea una matriz celular que contiene una cadena y una matriz aleatoria de 2 por 2
ja: 例として、以下のコードは、文字列と 2 行 2 列のランダムな行列を含むセル配列を作成します。
ru: В качестве примера,следующий код создает массив ячеек,содержащий строку и случайную матрицу 2 на 2
zh_cn: 例如,以下代码创建了一个包含一个字符串和一个2乘2随机矩阵的单元格数组。

source: As an example, the following code finds the roots of the quadratic polynomial
es: Como ejemplo,el siguiente código encuentra las raíces del polinomio cuadrático
ja: 例として、次のコードは二次多項式の根を求めます。
ru: В качестве примера,следующий код находит корни квадратичного полинома
zh_cn: 举个例子,下面的代码是求二次多项式的根。

source: As an example, the following function implements a variant of the classic &ldquo;Hello, World&rdquo; program.
es: Como ejemplo, la siguiente funci&oacute;n implementa una variante del programa cl&aacute;sico "Hello, World".
ja: 例として、次の関数は、古典的な「Hello、World」プログラムのバリアントを実装します。
ru: В качестве примера следующая функция реализует вариант классической программы &laquo;Hello, World&raquo;.
zh_cn: 例如，以下函数实现了经典&ldquo; Hello，World&rdquo;程序的变体。

source: As before, the leading comments provide documentation for the class constructor. This constructor is very similar to the polynomial class constructor, except that a polynomial object is passed as the third argument to the <code>class</code> function, telling Octave that the <code>FIRfilter</code> class will be derived from the polynomial class. The FIR filter class itself does not have any data fields, but it must provide a struct to the <code>class</code> function. Given that the <code>@polynomial</code> constructor will add an element named <var>polynomial</var> to the object struct, the <code>@FIRfilter</code> just initializes a struct with a dummy field <var>polynomial</var> which will later be overwritten.
es: Como antes, los comentarios principales proporcionan documentaci&oacute;n para el constructor de la clase. Este constructor es muy similar al constructor de la clase polinomial, excepto que se pasa un objeto polinomial como tercer argumento a la funci&oacute;n de la <code>class</code> , indicando a Octave que la clase <code>FIRfilter</code> se derivar&aacute; de la clase polinomial. La clase de filtro FIR en s&iacute; misma no tiene ning&uacute;n campo de datos, pero debe proporcionar una estructura a la funci&oacute;n de <code>class</code> . Dado que el constructor <code>@polynomial</code> agregar&aacute; un elemento llamado <var>polynomial</var> a la estructura del objeto, <code>@FIRfilter</code> simplemente inicializa una estructura con un <var>polynomial</var> campo ficticio que luego se sobrescribir&aacute;.
ja: 前と同様に、先頭のコメントはクラスコンストラクターのドキュメントを提供します。このコンストラクターは多項式クラスコンストラクターに非常に似ていますが、多項式オブジェクトが <code>class</code> 関数の3番目の引数として渡され、 <code>FIRfilter</code> クラスが多項式クラスから派生することをOctaveに伝えます。 FIRフィルタークラス自体にはデータフィールドはありませんが、 <code>class</code> 関数に構造体を提供する必要があります。ことを考えると <code>@polynomial</code> コンストラクタは、名前の要素を追加します <var>polynomial</var> オブジェクト構造体への、 <code>@FIRfilter</code> はちょうどダミーフィールドを持つ構造体を初期化 <var>polynomial</var> 後に上書きされます。
ru: Как и прежде, первые комментарии предоставляют документацию для конструктора класса. Этот конструктор очень похож на конструктор полиномиального класса, за исключением того, что полиномиальный объект передается в качестве третьего аргумента функции <code>class</code> , сообщая Octave, что класс <code>FIRfilter</code> будет производным от полиномиального класса. Сам класс FIR-фильтра не имеет полей данных, но он должен предоставить структуру функции <code>class</code> . Учитывая, что конструктор <code>@polynomial</code> добавит элемент с именем <var>polynomial</var> в структуру объекта, <code>@FIRfilter</code> просто инициализирует структуру фиктивным <var>polynomial</var> который позже будет перезаписан.
zh_cn: 和以前一样，前导注释为类构造函数提供了文档。该构造函数与多项式类构造函数非常相似，不同之处在于，将多项式对象作为第三个参数传递给 <code>class</code> 函数，告诉Octave <code>FIRfilter</code> 类将从多项式类派生。 FIR过滤器类本身没有任何数据字段，但是它必须为 <code>class</code> 函数提供一个结构。假定 <code>@polynomial</code> 构造函数将向对象struct 添加一个名为 <var>polynomial</var> 的元素，则 <code>@FIRfilter</code> 只是使用一个伪字段 <var>polynomial</var> 初始化一个结构，该伪字段随后将被覆盖。

source: As can be seen in the example:
es: Como se puede ver en el ejemplo:
ja: 例を見てもわかるように
ru: Как видно из примера:
zh_cn: 从例子中可以看出。

source: As can be seen, floating point values are rounded to the nearest integer when converted.
es: Como puede verse,los valores de punto flotante se redondean al entero más cercano cuando se convierten.
ja: このように、浮動小数点値は変換時に最も近い整数に丸められます。
ru: Как видно,при преобразовании значения с плавающей точкой округляются до ближайшего целого числа.
zh_cn: 可以看出,浮点值在转换时都会四舍五入到最接近的整数。

source: As can be seen, the <a href="object-sizes#XREFsize">size</a> function also works for cell arrays. As do other functions describing the size of an object, such as <a href="object-sizes#XREFlength">length</a>, <a href="object-sizes#XREFnumel">numel</a>, <a href="object-sizes#XREFrows">rows</a>, and <a href="object-sizes#XREFcolumns">columns</a>.
es: Como puede verse, la funci&oacute;n de <a href="object-sizes#XREFsize">tama&ntilde;o</a> tambi&eacute;n funciona para matrices de celdas. Al igual que otras funciones que describen el tama&ntilde;o de un objeto, como <a href="object-sizes#XREFlength">longitud</a> , <a href="object-sizes#XREFnumel">n&uacute;mero</a> , <a href="object-sizes#XREFrows">filas</a> y <a href="object-sizes#XREFcolumns">columnas</a> .
ja: 見てわかるように、<a href="object-sizes#XREFsize">サイズ</a>関数はセル配列に対しても機能します。などのようなオブジェクトの大きさを説明する他の機能、実行<a href="object-sizes#XREFlength">長さ</a>、<a href="object-sizes#XREFnumel">numelの</a>、<a href="object-sizes#XREFrows">行</a>、および<a href="object-sizes#XREFcolumns">列を</a>。
ru: Как видно, функция <a href="object-sizes#XREFsize">размера</a> также работает для массивов ячеек. Как и другие функции, описывающие размер объекта, такие как <a href="object-sizes#XREFlength">длина</a> , <a href="object-sizes#XREFnumel">число</a> , <a href="object-sizes#XREFrows">строки</a> и <a href="object-sizes#XREFcolumns">столбцы</a> .
zh_cn: 可以看出，<a href="object-sizes#XREFsize">size</a>函数也适用于单元阵列。与描述对象大小的其他函数一样，例如<a href="object-sizes#XREFlength">length</a>，<a href="object-sizes#XREFnumel">numel</a>，<a href="object-sizes#XREFrows">rows</a>和<a href="object-sizes#XREFcolumns">column</a>。

source: As discussed in the chapter on Sparse Matrices, the values of the sparse matrix are stored in increasing column-major ordering. Although the data passed by the user need not respect this requirement, pre-sorting the data will significantly speed up creation of the sparse matrix.
es: Como se discutió en el capítulo sobre Matrices Raras,los valores de la matriz rara se almacenan en orden creciente de columnas.Aunque los datos transmitidos por el usuario no tienen por qué respetar este requisito,la preclasificación de los datos acelerará considerablemente la creación de la matriz dispersa.
ja: 疎行列の章で議論されているように,疎行列の値は,カラム-メジャーの順序を増やして格納されます.ユーザから渡されたデータはこの条件を満たす必要はありませんが,データを事前にソートすることで,疎な行列の作成を大幅に高速化することができます.
ru: Как обсуждалось в главе,посвященной разреженным матрицам,значения разреженной матрицы хранятся в порядке возрастания колонок-мажор.Хотя данные,передаваемые пользователем,не обязательно должны соответствовать этому требованию,предварительная сортировка данных существенно ускорит создание разреженной матрицы.
zh_cn: 正如在稀疏矩阵一章中所讨论的那样,稀疏矩阵的值是以列大顺序递增的方式存储的。虽然用户传递的数据不需要遵守这一要求,但对数据进行预排序将大大加快稀疏矩阵的创建速度。

source: As for struct arrays and numerical arrays, the empty matrix &lsquo;
es: En cuanto a las matrices de estructuras y matrices num&eacute;ricas, la matriz vac&iacute;a '
ja: 構造体配列と数値配列については、空の行列 '
ru: Что касается структурных массивов и числовых массивов, пустая матрица '
zh_cn: 至于结构数组和数值数组，空矩阵'

source: As has been already said, diagonal and permutation matrices make it possible to use efficient algorithms while preserving natural linear algebra syntax. This section describes in detail the operations that are treated specially when performed on these special matrix objects.
es: Como ya se ha dicho,las matrices diagonales y de permutación permiten utilizar algoritmos eficientes,preservando la sintaxis natural del álgebra lineal.En esta sección se describen en detalle las operaciones que se tratan especialmente cuando se realizan en estos objetos matrices especiales.
ja: すでに述べたように、対角行列と順列行列は、自然な線形代数の構文を維持しつつ、効率的なアルゴリズムを使用することを可能にします。ここでは、これらの特殊な行列オブジェクトに対して実行されるときに特別に扱われる操作について詳しく説明します。
ru: Как уже было сказано,диагональные и перестановочные матрицы позволяют использовать эффективные алгоритмы при сохранении естественного синтаксиса линейной алгебры.В данном разделе подробно описаны операции,которые специально обрабатываются при выполнении над этими специальными матричными объектами.
zh_cn: 如前所述,对角矩阵和换元矩阵使我们有可能在保留自然线性代数语法的同时,使用高效的算法。本节将详细介绍在这些特殊矩阵对象上进行的特殊处理的操作。

source: As has been mentioned above (see <a href="indexing-cell-arrays#Indexing-Cell-Arrays">Indexing Cell Arrays</a>), elements of a cell array can be extracted into a comma separated list with the <code>{</code> and <code>}</code> operators. By surrounding this list with <code>[</code> and <code>]</code>, it can be concatenated into an array. For example:
es: Como se mencion&oacute; anteriormente (consulte <a href="indexing-cell-arrays#Indexing-Cell-Arrays">Indexaci&oacute;n de matrices de celdas</a> ), los elementos de una matriz de celdas se pueden extraer en una lista separada por comas con los operadores <code>{</code> y <code>}</code> . Al rodear esta lista con <code>[</code> y <code>]</code> , se puede concatenar en una matriz. Por ejemplo:
ja: 上記のように（<a href="indexing-cell-arrays#Indexing-Cell-Arrays">セル配列のインデックス付けを</a>参照）、セル配列の要素は、 <code>{</code> および <code>}</code> 演算子を使用して、コンマ区切りのリストに抽出できます。このリストを <code>[</code> および <code>]</code> で囲むことで、配列に連結できます。例えば：
ru: Как было упомянуто выше (см. <a href="indexing-cell-arrays#Indexing-Cell-Arrays">Индексирование массивов ячеек</a> ), элементы массива ячеек могут быть извлечены в список, разделенный запятыми, с помощью операторов <code>{</code> и <code>}</code> . Заключив этот список в <code>[</code> и <code>]</code> , он может быть объединен в массив. Например:
zh_cn: 如上文所述（请参见<a href="indexing-cell-arrays#Indexing-Cell-Arrays">索引单元格数组</a>），可以使用 <code>{</code> 和 <code>}</code> 运算符将单元格数组的元素提取到以逗号分隔的列表中。通过用 <code>[</code> 和 <code>]</code> 包围此列表，可以将其串联成一个数组。例如：

source: As in form 2 above, but allows ordering of generalized eigenpairs for, e.g., solution of discrete time algebraic Riccati equations. Form 3 is not available for complex matrices, and does not compute the generalized eigenvectors <var>V</var>, <var>W</var>, nor the orthogonal matrix <var>Q</var>.
es: Como en el formulario 2 anterior, pero permite ordenar los pares propios generalizados para, por ejemplo, la soluci&oacute;n de ecuaciones de Riccati algebraicas de tiempo discreto. Forma 3 no est&aacute; disponible para matrices complejas, y no calcula los vectores propios generalizada <var>V</var> , <var>W</var> , ni la matriz ortogonal <var>Q</var> .
ja: 上記の形式2と同じですが、たとえば、離散時間代数リカッチ方程式の解の一般化された固有ペアの順序付けを許可します。フォーム3は、複雑な行列には使用できず、一般化固有ベクトル <var>V</var> 、 <var>W</var> 、および直交行列 <var>Q</var> を計算しません。
ru: То же, что и в форме 2 выше, но позволяет упорядочивать обобщенные собственные пары, например, для решения алгебраических уравнений Риккати с дискретным временем. Форма 3 не доступна для комплексных матриц, и не вычислить обобщенные собственные векторы <var>V</var> , <var>W</var> , ни ортогональной матрицу <var>Q</var> .
zh_cn: 如以上形式2中那样，但是允许例如对于离散时间代数Riccati方程的解的广义特征对的排序。表格3不适用于复杂的基质，并且不计算广义本征向量 <var>V</var> ， <var>W</var> ，也不是正交矩阵 <var>Q</var> 。

source: As mentioned before, method and constructor parameters are converted automatically between Octave and Java types, if appropriate. For functions this is also true with return values, whereas for constructors this is not.
es: Como ya se ha mencionado,los parámetros del método y del constructor se convierten automáticamente entre los tipos Octava y Java,si procede.Para las funciones esto también es cierto con los valores de retorno,mientras que para los constructores no lo es.
ja: 前述したように,メソッドとコンストラクタのパラメータは,適切な場合には,Octave型とJava型の間で自動的に変換されます。関数については,これは戻り値についても同様ですが,コンストラクタについてはそうではありません。
ru: Как уже упоминалось ранее,параметры метода и конструктора при необходимости автоматически конвертируются между типами Octave и Java.Для функций это также верно при возвращаемых значениях,а для конструкторов-нет.
zh_cn: 如前所述,如果合适的话,方法和构造函数参数会在Octave和Java类型之间自动转换。对于函数的返回值也是如此,而对于构造函数则不然。
