Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/octave/octave.*.011.xlf
Languages: es, ja, ru, zh_cn

source: Avoid computing costly intermediate results multiple times. Octave currently does not eliminate common subexpressions. Also, certain internal computation results are cached for variables. For instance, if a matrix variable is used multiple times as an index, checking the indices (and internal conversion to integers) is only done once.
es: Evite computar costosos resultados intermedios varias veces.La octava actualmente no elimina las subexpresiones comunes.Además,ciertos resultados de cálculo internos se almacenan en la memoria caché para las variables.Por ejemplo,si una variable matriz se utiliza varias veces como índice,la comprobación de los índices (y la conversión interna a números enteros)sólo se hace una vez.
ja: コストのかかる中間結果を複数回計算することを避けます。Octaveは現在のところ,一般的な副式を排除していません。また,ある種の内部計算結果は,変数に対してキャッシュされます。例えば,行列変数がインデックスとして複数回使用される場合,インデックスのチェック(および内部の整数への変換)は一度だけ行われます。
ru: Избегайте многократного получения дорогостоящих промежуточных результатов.Октава в настоящее время не исключает общих подвыражений.Кроме того,некоторые результаты внутренних вычислений кэшируются для переменных.Например,если матричная переменная используется несколько раз в качестве индекса,проверка индексов (и внутреннее преобразование в целые числа)производится только один раз.
zh_cn: 避免多次计算昂贵的中间结果。Octave目前没有消除常见的子表达式。另外,对于变量来说,某些内部计算结果会被缓存。例如,如果一个矩阵变量被多次用作索引,检查索引(以及内部转换为整数)只需要做一次。

source: Avoid deep recursion. Function calls to m-file functions carry a relatively significant overhead, so rewriting a recursion as a loop often helps. Also, note that the maximum level of recursion is limited.
es: Evite la recidiva profunda.Las llamadas a funciones de archivos m tienen una sobrecarga relativamente importante,por lo que reescribir una recursividad como un bucle a menudo ayuda.Además,tenga en cuenta que el nivel máximo de recursividad es limitado.
ja: 深い再帰を避ける。m-file 関数への関数呼び出しは比較的大きなオーバーヘッドを伴うため、再帰をループとして書き換えることはしばしば助けになります。また、再帰の最大レベルには制限があることにも注意してください。
ru: Избегайте глубокой рекурсии.Вызовы функций к m-файлам несут относительно значительные накладные расходы,поэтому часто помогает переписать рекурсию в виде цикла.Обратите внимание,что максимальный уровень рекурсии ограничен.
zh_cn: 避免深度递归。对m文件函数的调用会带来比较大的开销,所以把递归改写成循环往往会有帮助。另外,注意递归的最大级别是有限的。

source: Avoid resizing matrices unnecessarily. When building a single result matrix from a series of calculations, set the size of the result matrix first, then insert values into it. Write
es: Evite cambiar el tamaño de las matrices innecesariamente.Cuando se construye una única matriz de resultados a partir de una serie de cálculos,establezca primero el tamaño de la matriz de resultados y luego inserte los valores en ella.Escriba a
ja: 行列のサイズを不必要に変更しないようにします。一連の計算から単一の結果行列を作成する場合、最初に結果行列のサイズを設定してから値を挿入します。書いてください。
ru: Избегайте чрезмерного изменения размеров матриц.При построении одной матрицы результата из серии вычислений сначала задайте размер матрицы результата,а затем вставьте в нее значения.Напишите .
zh_cn: 避免不必要地调整矩阵的大小。当从一系列计算中建立一个单一的结果矩阵时,先设置结果矩阵的大小,然后再将值插入其中。编写

source: Axes NextPlot
es: Hachas NextPlot
ja: アクスNextPlot

source: Axes Properties
es: Propiedades de las hachas
ja: アクシーズプロパティ
ru: Свойства осей
zh_cn: 斧头属性

source: Axis Configuration
es: Configuración del eje
ja: 軸構成
ru: Осевая конфигурация
zh_cn: 轴配置

source: B = rescale (&hellip;, "inputmax", inmax)
ja: B =再スケール（&hellip;、 "inputmax"、inmax）
zh_cn: B =重新缩放（&hellip;，&ldquo; inputmax&rdquo;，inmax）

source: B = rescale (&hellip;, "inputmin", inmin)
ja: B =再スケール（&hellip;、 "inputmin"、inmin）
zh_cn: B =重新缩放（&hellip;，&ldquo; inputmin&rdquo;，inmin）

source: B = rescale (A)
ja: B=リスケール(A
zh_cn: B=重新标定(A)

source: B.1 Test Functions
es: B.1 Funciones de prueba
ja: B.1 テスト機能
ru: B.1 Функции тестирования
zh_cn: B.1 测试功能

source: B.2 Demonstration Functions
es: B.2 Funciones de demostración
ja: B.2 デモンストレーション機能
ru: B.2 Демонстрационные функции
zh_cn: B.2 示范功能

source: BDemonstration Functions
es: Funciones de demostración B
ja: BDデモ機能
ru: Демонстрационные функции
zh_cn: BD演示函数

source: BSD-style license without advertising clause.
es: Licencia estilo BSD sin cláusula de publicidad.
ja: 広告条項のないBSDスタイルのライセンス。
ru: Лицензия в стиле BSD без пункта о рекламе.
zh_cn: 无广告条款的BSD式许可。

source: BTest Functions
es: Funciones de BTest
ja: BTest 関数
ru: функции тестирования
zh_cn: BT测试功能

source: Background Information: This function is called by an ode solver function if it was specified in the <code>"OutputFcn"</code> property of an options structure created with <code>odeset</code>. The ode solver will initially call the function with the syntax <code>odeplot ([<var>tfirst</var>, <var>tlast</var>], <var>y0</var>, "init")</code>. The function initializes internal variables, creates a new figure window, and sets the x limits of the plot. Subsequently, at each time step during the integration the ode solver calls <code>odeplot (<var>t</var>, <var>y</var>, [])</code>. At the end of the solution the ode solver calls <code>odeplot ([], [], "done")</code> so that odeplot can perform any clean-up actions required.
es: Informaci&oacute;n <code>"OutputFcn"</code> : esta funci&oacute;n es llamada por una funci&oacute;n de resoluci&oacute;n de ode si se especific&oacute; en la propiedad "OutputFcn" de una estructura de opciones creada con <code>odeset</code> . El solucionador de odas inicialmente llamar&aacute; a la funci&oacute;n con la sintaxis <code>odeplot ([<var>tfirst</var>, <var>tlast</var>], <var>y0</var>, "init")</code> . La funci&oacute;n inicializa las variables internas, crea una nueva ventana de figura y establece los l&iacute;mites x del gr&aacute;fico. Posteriormente, en cada paso de tiempo durante la integraci&oacute;n, el solucionador de <code>odeplot (<var>t</var>, <var>y</var>, [])</code> llama a odeplot ( t , y , []) . Al final de la soluci&oacute;n, el solucionador de <code>odeplot ([], [], "done")</code> llama a odeplot ([], [], "hecho") para que odeplot pueda realizar las acciones de limpieza necesarias.
ja: 背景情報：この関数は、 <code>odeset</code> で作成されたオプション構造体の <code>"OutputFcn"</code> プロパティで指定されている場合、odeソルバー関数によって呼び出されます。 odeソルバーは、最初に <code>odeplot ([<var>tfirst</var>, <var>tlast</var>], <var>y0</var>, "init")</code> <var>tfirst</var> 、 <var>tlast</var> ]、 <var>y0</var> 、 "init"）という構文で関数を呼び出します。この関数は、内部変数を初期化し、新しいFigureウィンドウを作成し、プロットのx範囲を設定します。続いて、積分中の各タイムステップで、odeソルバーは <code>odeplot (<var>t</var>, <var>y</var>, [])</code> <var>t</var> 、 <var>y</var> 、[]）を呼び出します。ソリューションの最後に、odeソルバーは <code>odeplot ([], [], "done")</code> 呼び出します odeplotが必要なクリーンアップアクションを実行できるようにします。
ru: Общие сведения: эта функция вызывается функцией решателя <code>"OutputFcn"</code> если она была указана в свойстве &laquo;OutputFcn&raquo; структуры параметров, созданной с помощью <code>odeset</code> . Решатель <code>odeplot ([<var>tfirst</var>, <var>tlast</var>], <var>y0</var>, "init")</code> сначала вызовет функцию с синтаксисом odeplot ([ tfirst , tlast ], y0 , "init") . Функция инициализирует внутренние переменные, создает новое окно рисунка и устанавливает пределы x графика. Впоследствии, на каждом временном шаге во время интегрирования решатель <code>odeplot (<var>t</var>, <var>y</var>, [])</code> вызывает odeplot ( t , y , []) . В конце решения решатель <code>odeplot ([], [], "done")</code> вызывает odeplot ([], [], "готово") так что odeplot может выполнять любые необходимые действия по очистке.
zh_cn: 背景信息：如果在由 <code>"OutputFcn"</code> 创建的选项结构的&ldquo; OutputFcn&rdquo;属性中指定了该函数，则它由ode求解器函数 <code>odeset</code> 。 ode求解器将首先使用语法 <code>odeplot ([<var>tfirst</var>, <var>tlast</var>], <var>y0</var>, "init")</code> 调用该函数。该函数初始化内部变量，创建一个新的图形窗口，并设置绘图的x极限。随后，在积分期间的每个时间步，ode求解器都会调用 <code>odeplot (<var>t</var>, <var>y</var>, [])</code> 。在解决方案的最后，ode求解器调用 <code>odeplot ([], [], "done")</code> 这样odeplot可以执行所需的任何清理操作。

source: Background: A matrix is Hermitian if the complex conjugate transpose of the matrix is equal to the original matrix: <code><var>A</var>&nbsp;==&nbsp;<var>A</var>'</code>. If a tolerance is given then the calculation is <code>norm (<var>A</var> - <var>A</var>', Inf) / norm (<var>A</var>, Inf) &lt; <var>tol</var></code>.
es: Antecedentes: una matriz es hermitiana si la transpuesta conjugada compleja de la matriz es igual a la matriz original: <code><var>A</var>&nbsp;==&nbsp;<var>A</var>'</code> . Si se da una tolerancia, el c&aacute;lculo es <code>norm (<var>A</var> - <var>A</var>', Inf) / norm (<var>A</var>, Inf) &lt; <var>tol</var></code> .
ja: 背景：行列の複素共役転置が元の行列 <code><var>A</var>&nbsp;==&nbsp;<var>A</var>'</code> と等しい場合、行列はエルミート行列です。許容誤差が指定されている場合、計算は <code>norm (<var>A</var> - <var>A</var>', Inf) / norm (<var>A</var>, Inf) &lt; <var>tol</var></code> です。
ru: Предпосылки: матрица является эрмитовой, если комплексно сопряженное транспонирование матрицы равно исходной матрице: <code><var>A</var>&nbsp;==&nbsp;<var>A</var>'</code> . Если задан допуск, то расчет будет <code>norm (<var>A</var> - <var>A</var>', Inf) / norm (<var>A</var>, Inf) &lt; <var>tol</var></code> .
zh_cn: 背景：如果矩阵的复共轭转置等于原始矩阵： <code><var>A</var>&nbsp;==&nbsp;<var>A</var>'</code> 则该矩阵为Hermitian 。如果给出公差，则计算为 <code>norm (<var>A</var> - <var>A</var>', Inf) / norm (<var>A</var>, Inf) &lt; <var>tol</var></code> 。

source: Background: A matrix is symmetric if the transpose of the matrix is equal to the original matrix: <code><var>A</var>&nbsp;==&nbsp;<var>A</var>.'</code>. If a tolerance is given then symmetry is determined by <code>norm (<var>A</var> - <var>A</var>.', Inf) / norm (<var>A</var>, Inf) &lt; <var>tol</var></code>.
es: Antecedentes: una matriz es sim&eacute;trica si la transposici&oacute;n de la matriz es igual a la matriz original: <code><var>A</var>&nbsp;==&nbsp;<var>A</var>.'</code> . Si se da una tolerancia, la simetr&iacute;a est&aacute; determinada por la <code>norm (<var>A</var> - <var>A</var>.', Inf) / norm (<var>A</var>, Inf) &lt; <var>tol</var></code> .
ja: 背景：行列の転置が元の行列と等しい場合、行列は対称です： <code><var>A</var>&nbsp;==&nbsp;<var>A</var>.'</code> 。許容誤差が指定されている場合、対称性は <code>norm (<var>A</var> - <var>A</var>.', Inf) / norm (<var>A</var>, Inf) &lt; <var>tol</var></code> によって決定されます。
ru: Предпосылки: Матрица является симметричной, если транспонированная матрица равна исходной матрице: <code><var>A</var>&nbsp;==&nbsp;<var>A</var>.'</code> . Если задан допуск, то симметрия определяется соотношением <code>norm (<var>A</var> - <var>A</var>.', Inf) / norm (<var>A</var>, Inf) &lt; <var>tol</var></code> .
zh_cn: 背景：一个矩阵是对称的，如果矩阵的转置是等于原始矩阵： <code><var>A</var>&nbsp;==&nbsp;<var>A</var>.'</code> 。如果给出公差，则对称性由 <code>norm (<var>A</var> - <var>A</var>.', Inf) / norm (<var>A</var>, Inf) &lt; <var>tol</var></code> 。

source: Background: A positive definite matrix has eigenvalues which are all greater than zero. A positive semi-definite matrix has eigenvalues which are all greater than or equal to zero. The matrix <var>A</var> is very likely to be positive semi-definite if the following two conditions hold for a suitably small tolerance <var>tol</var>.
es: Antecedentes: una matriz definida positiva tiene valores propios que son todos mayores que cero. Una matriz semidefinida positiva tiene valores propios que son todos mayores o iguales a cero. Es muy probable que la matriz <var>A</var> sea ​​semidefinida positiva si se cumplen las dos condiciones siguientes para una tolerancia <var>tol</var> adecuadamente peque&ntilde;a .
ja: 背景：正定行列には、すべてゼロより大きい固有値があります。正の半定行列には、すべてゼロ以上の固有値があります。次の2つの条件が適切に小さい許容誤差 <var>tol</var> に当てはまる場合、行列 <var>A</var> は正の半定値である可能性が非常に高くなります。
ru: Предпосылки: положительно определенная матрица имеет собственные значения, все больше нуля. Положительная полуопределенная матрица имеет собственные значения, которые все больше или равны нулю. Матрица <var>A</var> , скорее всего, будет положительно полуопределенной, если следующие два условия выполняются для достаточно малого допуска <var>tol</var> .
zh_cn: 背景：一个正定矩阵的特征值都大于零。一个正半定矩阵具有均大于或等于零的特征值。如果以下两个条件对于适当小的公差 <var>tol</var> 成立，则矩阵 <var>A</var> 很可能是正半定的。

source: Background: Array elements can be specified either by a linear index which starts at 1 and runs through the number of elements in the array, or they may be specified with subscripts for the row, column, page, etc. The functions <code>ind2sub</code> and <code>sub2ind</code> interconvert between the two forms.
es: Antecedentes: los elementos de la matriz se pueden especificar mediante un &iacute;ndice lineal que comienza en 1 y recorre el n&uacute;mero de elementos de la matriz, o se pueden especificar con sub&iacute;ndices para la fila, columna, p&aacute;gina, etc. Las funciones <code>ind2sub</code> y <code>sub2ind</code> se interconvierten entre las dos formas.
ja: 背景：配列要素は、1から始まり、配列内の要素の数を実行する線形インデックスによって指定するか、行、列、ページなどの添え字を使用して指定できます。関数 <code>ind2sub</code> および <code>sub2ind</code> interconvert 2つのフォームの間。
ru: Справочная информация: элементы массива могут быть указаны либо линейным индексом, который начинается с 1 и проходит через количество элементов в массиве, либо они могут быть указаны с индексами для строки, столбца, страницы и т. Д. Функции <code>ind2sub</code> и <code>sub2ind</code> interconvert между двумя формами.
zh_cn: 背景：数组元素可以由从1开始并贯穿数组元素数的线性索引指定，也可以由行，列，页面等的下标指定 <code>ind2sub</code> 和 <code>sub2ind</code> 函数可相互转换两种形式之间。

source: Background: The QR factorization has applications in the solution of least squares problems
es: Antecedentes:La factorización del QR tiene aplicaciones en la solución de problemas de mínimos cuadrados
ja: 背景には以下のようなものがあります。QR因数分解は、最小二乗問題の解法に応用されています。
ru: Подоплёка:QR-факторизация имеет приложения для решения задач наименьших квадратов
zh_cn: 背景:QR因式化在最小二乘问题的求解上有应用。QR因式化在解决最小二乘法问题方面有一定的应用。

source: Backtracking technique option (for MIP only):
es: Opción de técnica de retroceso (sólo para MIP):
ja: バックトラックテクニックオプション(MIPのみ)。
ru: Опция техники обратного слежения (только для MIP):
zh_cn: 回溯技术选项(仅适用于MIP)。

source: Balance the matrix <var>A</var> to reduce numerical errors in future calculations.
es: Equilibre la matriz <var>A</var> para reducir errores num&eacute;ricos en c&aacute;lculos futuros.
ja: 行列 <var>A</var> のバランスを取り、将来の計算における数値誤差を減らします。
ru: Сбалансируйте матрицу <var>A</var> , чтобы уменьшить числовые ошибки в будущих расчетах.
zh_cn: 平衡矩阵 <var>A</var> 以减少将来计算中的数值误差。

source: Banded matrix with the band size of <var>nl</var> below the diagonal and <var>nu</var> above it. If <var>nl</var> and <var>nu</var> are 1, then the matrix is tridiagonal and treated with specialized code. In addition the matrix can be marked as probably a positive definite. (Sparse matrices only)
es: Matriz con bandas con el tama&ntilde;o de banda de <var>nl</var> debajo de la diagonal y <var>nu</var> encima de ella. Si <var>nl</var> y <var>nu</var> son 1, entonces la matriz es tridiagonal y se trata con c&oacute;digo especializado. Adem&aacute;s, la matriz puede marcarse como probablemente un definido positivo. (Solo matrices dispersas)
ja: 対角線の下に <var>nl</var> 、上に <var>nu</var> のバンドサイズを持つバンド行列。場合 <var>nl</var> と <var>nu</var> 1であり、次いで、マトリックスは三重対角と特殊コードで処理されます。さらに、マトリックスはおそらく正定としてマークできます。（スパース行列のみ）
ru: Линейная матрица с размером полосы <var>nl</var> под диагональю и <var>nu</var> над ней. Если <var>nl</var> и <var>nu</var> равны 1, то матрица трехдиагональная и обрабатывается специализированным кодом. Кроме того, матрица может быть отмечена как положительно определенная. (Только разреженные матрицы)
zh_cn: 带状矩阵，其带大小为 <var>nl</var> 在对角线以下， <var>nu</var> 在其对角线上方。如果 <var>nl</var> 和 <var>nu</var> 为1，则矩阵为三对角线，并用专用代码处理。此外，矩阵可以标记为正定数。（仅限稀疏矩阵）

source: Bar Series
es: Serie Bar
ja: バーシリーズ
ru: Серия баров
zh_cn: 酒吧系列

source: Bar series objects are created by the <code>bar</code> or <code>barh</code> functions. Each <code>hggroup</code> element contains a single patch object. The properties of the bar series are
es: Los objetos de la serie de barras son creados por las funciones <code>bar</code> o <code>barh</code> . Cada elemento <code>hggroup</code> contiene un &uacute;nico objeto de parche. Las propiedades de la serie de barras son
ja: 棒シリーズオブジェクトは、関数 <code>bar</code> または <code>barh</code> によって作成されます。各 <code>hggroup</code> 要素には、単一のpatchオブジェクトが含まれています。棒シリーズの特性は
ru: Объекты серии Bar создаются <code>bar</code> или <code>barh</code> функций. Каждый элемент <code>hggroup</code> содержит один объект patch. Свойства серии стержней:
zh_cn: Bar系列对象是通过 <code>bar</code> 或 <code>barh</code> 函数创建的。每个 <code>hggroup</code> 元素都包含一个补丁程序对象。酒吧系列的属性是

source: Barber, C.B., Dobkin, D.P., and Huhdanpaa, H.T.,
es: Barber,C.B.,Dobkin,D.P.,y Huhdanpaa,H.T.,
ja: バーバー、C.B.、ドブキン、D.P.、およびHuhdanpaa、H.T.。
ru: Барбер,К.Б.,Добкин,Д.П.,и Хухданпаа,Х.Т.,

source: Bars are stacked so that each X value has a single bar composed of multiple segments.
es: Las barras se apilan de manera que cada valor X tiene una sola barra compuesta de múltiples segmentos.
ja: 棒グラフは、各X値が複数のセグメントで構成された単一の棒グラフを持つように積み重ねられます。
ru: Бары складываются таким образом,что каждое значение X имеет один бар,состоящий из нескольких сегментов.
zh_cn: 条形图是堆叠的,因此每个X值都有一个由多段组成的单条。

source: Bars are stacked so that each Y value has a single bar composed of multiple segments.
es: Las barras se apilan de manera que cada valor Y tiene una sola barra compuesta de múltiples segmentos.
ja: バーは、各Y値が複数のセグメントで構成された単一のバーを持つように積み重ねられます。
ru: Бары складываются таким образом,что каждое значение Y имеет один бар,состоящий из нескольких сегментов.
zh_cn: 条形图叠加,使每个Y值都有一个由多段组成的单条。

source: Base64 and Binary Data Transmission
es: Transmisión de datos de base64 y binarios
ja: Base64とバイナリデータ伝送
ru: Передача двоичных данных Base64 и Binary Data Transmission
zh_cn: Base64和二进制数据传输

source: Basic Input and Output
es: Entrada y salida básica
ja: 基本入出力
ru: Основной вход и выход
zh_cn: 基本输入和输出

source: Basic Linear Algebra Subroutine library. Accelerated <small>BLAS</small> libraries such as OpenBLAS (<a href="https://www.openblas.net/">https://www.openblas.net/</a>) or ATLAS (<a href="http://math-atlas.sourceforge.net">http://math-atlas.sourceforge.net</a>) are recommended for best performance. The reference implementation (<a href="http://www.netlib.org/blas">http://www.netlib.org/blas</a>) is slow, unmaintained, and suffers from certain bugs in corner case inputs.
es: Biblioteca de subrutinas de &aacute;lgebra lineal b&aacute;sica. Se recomiendan bibliotecas <small>BLAS</small> aceleradas como OpenBLAS ( <a href="https://www.openblas.net/">https://www.openblas.net/</a> ) o ATLAS ( <a href="http://math-atlas.sourceforge.net">http://math-atlas.sourceforge.net</a> ) para obtener el mejor rendimiento. La implementaci&oacute;n de referencia ( <a href="http://www.netlib.org/blas">http://www.netlib.org/blas</a> ) es lenta, no se mantiene y sufre ciertos errores en las entradas de los casos de esquina.
ja: 基本的な線形代数サブルーチンライブラリ。最高のパフォーマンスを得るには、OpenBLAS（<a href="https://www.openblas.net/">https://www.openblas.net/</a>）またはATLAS（<a href="http://math-atlas.sourceforge.net">http://math-atlas.sourceforge.net</a>）などの高速化された<small>BLAS</small>ライブラリが推奨されます。リファレンス実装（<a href="http://www.netlib.org/blas">http://www.netlib.org/blas</a>）は遅く、メンテナンスされておらず、コーナーケース入力の特定のバグに悩まされています。
ru: Базовая библиотека подпрограмм линейной алгебры. Для лучшей производительности рекомендуются ускоренные библиотеки <small>BLAS,</small> такие как OpenBLAS ( <a href="https://www.openblas.net/">https://www.openblas.net/</a> ) или ATLAS ( <a href="http://math-atlas.sourceforge.net">http://math-atlas.sourceforge.net</a> ). Эталонная реализация ( <a href="http://www.netlib.org/blas">http://www.netlib.org/blas</a> ) медленная, не обслуживается и страдает некоторыми ошибками при вводе углового случая.
zh_cn: 基本的线性代数子例程库。为了获得最佳性能，建议使用加速的<small>BLAS</small>库，例如OpenBLAS（<a href="https://www.openblas.net/">https://www.openblas.net/</a>）或ATLAS（<a href="http://math-atlas.sourceforge.net">http://math-atlas.sourceforge.net</a>）。参考实现（<a href="http://www.netlib.org/blas">http://www.netlib.org/blas</a>）速度慢，无法维护，并且在特殊情况输入中存在某些错误。

source: Basic Matrix Functions
es: Funciones básicas de la matriz
ja: 基本的な行列関数
ru: Функции базовой матрицы
zh_cn: 基本矩阵函数

source: Basic Operators and Functions on Sparse Matrices
es: Operadores y funciones básicas en matrices dispersas
ja: 疎行列の基本的な演算子と関数
ru: Основные операторы и функции на разделенных матрицах
zh_cn: 稀疏矩阵的基本运算法则和函数

source: Basic Statistical Functions
es: Funciones estadísticas básicas
ja: 基本的な統計関数
ru: Основные статистические функции
zh_cn: 基本统计功能

source: Basic Unix system utilities are required for building Octave. All will be available with any modern Unix system and also on Windows with either Cygwin or MinGW and MSYS.
es: Se requieren utilidades básicas del sistema Unix para construir la Octava.Todas estarán disponibles con cualquier sistema Unix moderno y también en Windows con Cygwin o MinGW y MSYS.
ja: Octaveを構築するためには,基本的なUnixシステムユーティリティが必要です。すべてのユーティリティは,最新のUnixシステムで利用可能であり,Cygwin,MinGW,MSYSのいずれかのWindowsでも利用可能です。
ru: Для построения Октавы требуются базовые утилиты системы Unix.Все они будут доступны с любой современной Unix системой,а также на Windows с Cygwin или MinGW и MSYS.
zh_cn: 构建Octave需要基本的Unix系统实用程序,所有这些都可以在任何现代Unix系统上使用,也可以在Windows上使用Cygwin或MinGW和MSYS。所有的工具都可以在任何现代Unix系统中使用,也可以在Windows中使用Cygwin或MinGW和MSYS。

source: Basic Usage
es: Uso básico
ja: 基本的な使い方
ru: Основное использование
zh_cn: 基本使用方法

source: Basic Usage and Examples
es: Uso básico y ejemplos
ja: 基本的な使い方と例文
ru: Основное использование и примеры
zh_cn: 基本用法和实例

source: Basic Usage of Cell Arrays
es: Uso básico de los conjuntos celulares
ja: セルアレイの基本的な使い方
ru: Основное использование клеточных массивов
zh_cn: 电池阵列的基本使用方法

source: Basic Vectorization
es: Vectorización básica
ja: 基本的なベクトル化
ru: Базовая векторизация
zh_cn: 基本向量化

source: Basic techniques for code optimization
es: Técnicas básicas para la optimización del código
ja: コード最適化のための基本テクニック
ru: Основные методы оптимизации кода
zh_cn: 代码优化的基本技术

source: Basic text formatting is supported inside sections, see the example given below:
es: El formato básico del texto se admite dentro de las secciones,véase el ejemplo que figura a continuación:
ja: 基本的なテキストの書式設定はセクション内でサポートされています。
ru: Основное форматирование текста поддерживается внутри разделов,см.пример ниже:
zh_cn: 节内支持基本的文本格式,请看下面给出的例子。

source: Basically, a URL is written between an opening &lsquo;
es: B&aacute;sicamente, una URL se escribe entre una apertura '
ja: 基本的に、URLは開始 '
ru: Обычно URL пишется между открытием '
zh_cn: 基本上，URL是在开头的'

source: Batch mode is enabled by either 1) specifying a logfile using the third argument <var>fname</var> or <var>fid</var>, or 2) requesting an output argument such as <var>success</var>, <var>n</var>, etc.
es: El modo por lotes se habilita 1) especificando un archivo de registro usando el tercer argumento <var>fname</var> o <var>fid</var> , o 2) solicitando un argumento de salida como <var>success</var> , <var>n</var> , etc.
ja: バッチモードを有効にするには、1）3番目の引数 <var>fname</var> または <var>fid</var> を使用してログファイルを指定するか、2） <var>success</var> 、 <var>n</var> などの出力引数を要求します。
ru: Пакетный режим включается либо 1) указанием файла журнала с использованием третьего аргумента <var>fname</var> или <var>fid</var> , либо 2) запросом выходного аргумента, такого как <var>success</var> , <var>n</var> и т. Д.
zh_cn: 批处理模式通过以下方式启用：1）使用第三个参数 <var>fname</var> 或 <var>fid</var> 指定日志文件，或2）请求输出参数诸如 <var>success</var> ， <var>n</var> 等。
