Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/octave/octave.*.011.xlf
Languages: es, ja, ru, zh_cn

source: A matrix is an object with two dimensions (<code>ndims (<var>x</var>) == 2</code>) for which <code>size (<var>x</var>)</code> returns <code>[M,&nbsp;N]</code> with non-negative M and N.
ja: 行列は、2次元（ <code>ndims (<var>x</var>) == 2</code> ）のオブジェクトであり、 <code>size (<var>x</var>)</code> は非負のMとNで <code>[M,&nbsp;N]</code> を返します。
zh_cn: 矩阵是具有二维（ <code>ndims (<var>x</var>) == 2</code> ）的对象，其 <code>size (<var>x</var>)</code> 返回带有非负M和N的 <code>[M,&nbsp;N]</code> 。

source: A matrix is skew-Hermitian if the complex conjugate transpose of the matrix is equal to the negative of the original matrix: <code><var>A</var>&nbsp;==&nbsp;-<var>A</var>'</code>. If a tolerance is given then the calculation is <code>norm (<var>A</var> + <var>A</var>', Inf) / norm (<var>A</var>, Inf) &lt; <var>tol</var></code>.
es: Una matriz es sesgada-hermitiana si la transpuesta conjugada compleja de la matriz es igual al negativo de la matriz original: <code><var>A</var>&nbsp;==&nbsp;-<var>A</var>'</code> . Si se da una tolerancia, el c&aacute;lculo es <code>norm (<var>A</var> + <var>A</var>', Inf) / norm (<var>A</var>, Inf) &lt; <var>tol</var></code> .
ja: 行列の複素共役転置が元の行列の負の値に等しい場合、行列はスキューエルミート行列です： <code><var>A</var>&nbsp;==&nbsp;-<var>A</var>'</code> 。許容誤差が指定されている場合、計算は <code>norm (<var>A</var> + <var>A</var>', Inf) / norm (<var>A</var>, Inf) &lt; <var>tol</var></code> です。
ru: Матрица является косоэрмитовой, если комплексно-сопряженное транспонирование матрицы равно отрицательному элементу исходной матрицы: <code><var>A</var>&nbsp;==&nbsp;-<var>A</var>'</code> . Если задан допуск, то расчет будет <code>norm (<var>A</var> + <var>A</var>', Inf) / norm (<var>A</var>, Inf) &lt; <var>tol</var></code> .
zh_cn: 如果矩阵的复共轭转置等于原始矩阵的负数： <code><var>A</var>&nbsp;==&nbsp;-<var>A</var>'</code> 则该矩阵为斜-埃尔米特矩阵。如果给出公差，则计算为 <code>norm (<var>A</var> + <var>A</var>', Inf) / norm (<var>A</var>, Inf) &lt; <var>tol</var></code> 。

source: A matrix is skew-symmetric if the transpose of the matrix is equal to the negative of the original matrix: <code><var>A</var>&nbsp;==&nbsp;-<var>A</var>.'</code>. If a tolerance is given then skew-symmetry is determined by <code>norm (<var>A</var> + <var>A</var>.', Inf) / norm (<var>A</var>, Inf) &lt; <var>tol</var></code>.
es: Una matriz es asim&eacute;trica si la transpuesta de la matriz es igual a la negativa de la matriz original: <code><var>A</var>&nbsp;==&nbsp;-<var>A</var>.'</code> . Si se da una tolerancia, la simetr&iacute;a de sesgo est&aacute; determinada por la <code>norm (<var>A</var> + <var>A</var>.', Inf) / norm (<var>A</var>, Inf) &lt; <var>tol</var></code> .
ja: 行列の転置が元の行列の負の値に等しい場合、行列は非対称である： <code><var>A</var>&nbsp;==&nbsp;-<var>A</var>.'</code> 。許容誤差が指定されている場合、スキュー対称性は <code>norm (<var>A</var> + <var>A</var>.', Inf) / norm (<var>A</var>, Inf) &lt; <var>tol</var></code> によって決定されます。
ru: Матрица является кососимметричной, если транспонированная матрица равна отрицательному значению исходной матрицы: <code><var>A</var>&nbsp;==&nbsp;-<var>A</var>.'</code> . Если задан допуск, то асимметрия определяется соотношением <code>norm (<var>A</var> + <var>A</var>.', Inf) / norm (<var>A</var>, Inf) &lt; <var>tol</var></code> .
zh_cn: 如果矩阵的转置等于原始矩阵的负数，则矩阵是歪斜对称的： <code><var>A</var>&nbsp;==&nbsp;-<var>A</var>.'</code> 。如果给定了公差，则偏斜对称性由 <code>norm (<var>A</var> + <var>A</var>.', Inf) / norm (<var>A</var>, Inf) &lt; <var>tol</var></code> 。

source: A matrix may have one or both dimensions zero, and operations on empty matrices are handled as described by Carl de Boor in
es: Una matriz puede tener una o ambas dimensiones cero,y las operaciones en matrices vacías se manejan como las describe Carl de Boor en
ja: 行列は片方または両方の次元がゼロの場合があり、空の行列に対する操作は、Carl de Boor が
ru: Матрица может иметь один или оба нулевых размера,а операции с пустыми матрицами обрабатываются так,как это описано Карлом де Буром в статье
zh_cn: 矩阵可以有一个或两个维度为零,对空矩阵的操作由Carl de Boor 在

source: A matrix type that stores only the nonzero elements is generally called sparse. It is the purpose of this document to discuss the basics of the storage and creation of sparse matrices and the fundamental operations on them.
es: Un tipo de matriz que almacena sólo los elementos que no son cero se llama generalmente disperso.El propósito de este documento es discutir los fundamentos del almacenamiento y la creación de matrices dispersas y las operaciones fundamentales sobre ellas.
ja: 0 以外の要素のみを格納する行列型は,一般に疎と呼ばれます.このドキュメントの目的は,疎な行列の保存と作成の基本と,その基本的な操作について説明することです.
ru: Матричный тип,который хранит только ненулевые элементы,обычно называется разреженным.Целью данного документа является обсуждение основ хранения и создания разреженных матриц и фундаментальных операций над ними.
zh_cn: 只存储非零元素的矩阵类型通常被称为稀疏矩阵。本文档的目的是讨论稀疏矩阵的存储和创建的基础知识以及对它们的基本操作。

source: A maximum of <code>length (<var>y0</var>)</code> components between <var>fixed_y0</var> and <var>fixed_yp0</var> may be chosen as fixed values.
es: Se puede elegir un m&aacute;ximo de componentes de <code>length (<var>y0</var>)</code> entre <var>fixed_y0</var> y <var>fixed_yp0</var> como valores fijos.
ja: <var>fixed_y0</var> と <var>fixed_yp0</var> の間の最大 <code>length (<var>y0</var>)</code> コンポーネントを固定値として選択できます。
ru: Компоненты максимальной <code>length (<var>y0</var>)</code> между <var>fixed_y0</var> и <var>fixed_yp0</var> могут быть выбраны в качестве фиксированных значений.
zh_cn: 可以将 <var>fixed_y0</var> 和 <var>fixed_yp0</var> 之间的最大 <code>length (<var>y0</var>)</code> 分量选择为固定值。

source: A message will be displayed as each of the startup files is read if you invoke Octave with the
es: Se mostrará un mensaje cuando se lea cada uno de los archivos de inicio si se invoca a Octava con el
ja: Octaveを
ru: При вызове команды "Октава" с помощью команды "Октава" будет отображено сообщение о том,что каждый из загрузочных файлов прочитан.
zh_cn: 如果您用

source: A method taking either an argument of type <code>dim_vector</code>, or, in the case of a matrix, two arguments of type <code>octave_idx_type</code> defining the number of rows and columns in the matrix.
es: Un m&eacute;todo que toma un argumento de tipo <code>dim_vector</code> o, en el caso de una matriz, dos argumentos de tipo <code>octave_idx_type</code> que definen el n&uacute;mero de filas y columnas en la matriz.
ja: <code>dim_vector</code> 型の引数、または行列の場合は、行列の行と列の数を定義する <code>octave_idx_type</code> 型の2つの引数を取るメソッド。
ru: Метод, принимающий либо аргумент типа <code>dim_vector</code> , либо, в случае матрицы, два аргумента типа <code>octave_idx_type</code> , определяющих количество строк и столбцов в матрице.
zh_cn: 一种方法，服用任一类型的参数 <code>dim_vector</code> ，或者，以矩阵的情况下，类型的两个参数 <code>octave_idx_type</code> 限定在矩阵的行和列的数目。

source: A mouse button was pressed
es: Un botón del ratón fue presionado
ja: マウスボタンが押された
ru: Была нажата кнопка мыши
zh_cn: 鼠标按钮被按下

source: A mouse button was released
es: Un botón del ratón fue liberado
ja: マウスボタンが解除されました
ru: Кнопка мыши была освобождена
zh_cn: 松开了鼠标按钮

source: A movie frame is simply a struct with the fields <code>"cdata"</code> and <code>"colormap"</code>.
es: Un fotograma de pel&iacute;cula es simplemente una estructura con los campos <code>"cdata"</code> y <code>"colormap"</code> .
ja: ムービーフレームは、フィールド <code>"cdata"</code> および <code>"colormap"</code> colormap"を持つ単純な構造体です。
ru: Кадр фильма - это просто структура с полями <code>"cdata"</code> и <code>"colormap"</code> .
zh_cn: 电影帧只是具有字段 <code>"cdata"</code> 和 <code>"colormap"</code> 。

source: A natural part of image processing is visualization of an image. The most basic function for this is the <code>imshow</code> function that shows the image given in the first input argument.
es: Una parte natural del procesamiento de im&aacute;genes es la visualizaci&oacute;n de una imagen. La funci&oacute;n m&aacute;s b&aacute;sica para esto es la funci&oacute;n <code>imshow</code> que muestra la imagen dada en el primer argumento de entrada.
ja: 画像処理の自然な部分は、画像の視覚化です。このための最も基本的な関数は、最初の入力引数で指定されたイメージを表示する <code>imshow</code> 関数です。
ru: Естественная часть обработки изображения - визуализация изображения. Самая основная функция для этого - функция <code>imshow</code> , которая показывает изображение, указанное в первом входном аргументе.
zh_cn: 图像处理的自然部分是图像的可视化。最基本的功能是 <code>imshow</code> 函数，该函数显示第一个输入参数中给出的图像。

source: A newline is not required between the <code>do</code> keyword and the body; but using one makes the program clearer unless the body is very simple.
es: No se requiere una nueva l&iacute;nea entre la palabra clave <code>do</code> y el cuerpo; pero usar uno hace que el programa sea m&aacute;s claro a menos que el cuerpo sea muy simple.
ja: <code>do</code> キーワードと本文の間に改行は不要です。しかし、1つを使用すると、本体が非常に単純でない限り、プログラムがより明確になります。
ru: Новая строка не требуется между ключевым словом <code>do</code> и телом; но использование одного делает программу более понятной, если только тело не очень простое.
zh_cn: <code>do</code> 关键字和正文之间不需要换行符；但是除非身体非常简单，否则使用它会使程序更清晰。

source: A newline is not required between the condition and the body; but using one makes the program clearer unless the body is very simple.
es: No se requiere una nueva línea entre la condición y el cuerpo;pero usar una hace que el programa sea más claro a menos que el cuerpo sea muy simple.
ja: コンディションと身体の間に改行は必要ありませんが、1つを使うことで、よっぽどシンプルな身体でない限り、プログラムがより明確になります。
ru: Между состоянием и телом не требуется новая линия;но использование новой линии делает программу более четкой,если только тело не очень простое.
zh_cn: 条件和正文之间不需要换行,但使用换行可以使程序更加清晰,除非正文非常简单。

source: A non-negative scalar <var>alpha</var> for incomplete Cholesky factorization of <code><var>A</var> + <var>alpha</var> * diag (diag (<var>A</var>))</code> instead of <var>A</var>. This can be useful when <var>A</var> is not positive definite. The default value is 0.
es: A escalar no negativo <var>alpha</var> para incompleta factorizaci&oacute;n de Cholesky de <code><var>A</var> + <var>alpha</var> * diag (diag (<var>A</var>))</code> en lugar de <var>A</var> . Esto puede resultar &uacute;til cuando <var>A</var> no es positivo definido. El valor predeterminado es 0.
ja: 非負スカラー <var>alpha</var> の不完全コレスキー分解のための <code><var>A</var> + <var>alpha</var> * diag (diag (<var>A</var>))</code> の代わりに、 <var>A</var> 。これは、 <var>A</var> が正定でない場合に役立ちます。デフォルト値は0です。
ru: Неотрицательный скалярный <var>alpha</var> - за неполную факторизацию Холецкого <code><var>A</var> + <var>alpha</var> * diag (diag (<var>A</var>))</code> вместо <var>A</var> . Это может быть полезно, когда <var>A</var> не является положительно определенным. Значение по умолчанию - 0.
zh_cn: 用于 <code><var>A</var> + <var>alpha</var> * diag (diag (<var>A</var>))</code> + <var>alpha</var> * diag（diag（ <var>A</var> ））而不是 <var>A</var> 的不完全Cholesky因式分解的非负标量 <var>alpha</var> 。当 <var>A</var> 不是正定时，这很有用。默认值为0。

source: A non-negative scalar specifying the drop tolerance for factorization if performing ICT. The default value is 0 which produces the complete Cholesky factorization.
es: Un escalar no negativo que especifica la tolerancia a la caída de la factorización si se realiza TIC.El valor por defecto es 0,lo que produce la factorización completa de Cholesky.
ja: ICTを実行する場合の因数分解のドロップ・トレランスを指定する非負のスカラー.デフォルト値は0で,完全なコレスキー因数分解を行います.
ru: Отрицательный скаляр,определяющий допуск на падение для факторизации при выполнении ИКТ.Значение по умолчанию равно 0,что приводит к полной факторизации Холески.
zh_cn: 一个非负值标量,用于指定在执行ICT分解时的容差。默认值为0,产生完整的Cholesky分解。

source: A non-negative scalar specifying the drop tolerance for factorization. The default value is 0 which produces the complete LU factorization.
es: Un escalar no negativo que especifica la tolerancia a la caída para la factorización.El valor por defecto es 0,lo que produce la factorización completa de la LU.
ja: 因数分解のドロップ・トレランスを指定する非負のスカラー.デフォルト値は0で,完全なLU因数分解を行います.
ru: Отрицательный скаляр,определяющий допуск на падение для факторизации.Значение по умолчанию равно 0,что приводит к полной факторизации ЛУ.
zh_cn: 一个非负的标量,用于指定因子化的下降容差。默认值是0,产生完整的LU分解。

source: A note on terminology: &ldquo;broadcasting&rdquo; is the term popularized by the Numpy numerical environment in the Python programming language. In other programming languages and environments, broadcasting may also be known as <em>binary singleton expansion</em> (BSX, in <small>MATLAB</small>, and the origin of the name of the <code>bsxfun</code> function), <em>recycling</em> (R programming language), <em>single-instruction multiple data</em> (SIMD), or <em>replication</em>.
es: Una nota sobre terminolog&iacute;a: "difusi&oacute;n" es el t&eacute;rmino popularizado por el entorno num&eacute;rico Numpy en el lenguaje de programaci&oacute;n Python. En otros lenguajes y entornos de programaci&oacute;n, la transmisi&oacute;n tambi&eacute;n puede conocerse como <em>expansi&oacute;n binaria singleton</em> (BSX, en <small>MATLAB</small> , y el origen del nombre de la funci&oacute;n <code>bsxfun</code> ), <em>reciclaje</em> (lenguaje de programaci&oacute;n R), <em>datos m&uacute;ltiples de instrucci&oacute;n &uacute;nica</em> (SIMD), o <em>replicaci&oacute;n</em> .
ja: 用語に関する注記：「ブロードキャスティング」は、Pythonプログラミング言語のNumpy数値環境によって一般化された用語です。他のプログラミング言語および環境では、ブロードキャストは<em>バイナリシングルトン拡張</em>（BSX、<small>MATLAB</small>、および <code>bsxfun</code> 関数の名前の由来）、<em>リサイクル</em>（Rプログラミング言語）、<em>単一命令複数データ</em>（SIMD）としても知られてい<em>ます</em>。または<em>レプリケーション</em>。
ru: Примечание по терминологии: &laquo;широковещательная передача&raquo; - это термин, популяризированный числовой средой Numpy на языке программирования Python. В других языках программирования и средах широковещательная передача может также называться <em>двоичным расширением одиночных</em> элементов (BSX в <small>MATLAB</small> и источником имени функции <code>bsxfun</code> ), повторным <em>использованием</em> (язык программирования R), <em>множественными данными с одной инструкцией</em> (SIMD), или <em>репликация</em> .
zh_cn: 关于术语的注释：&ldquo;广播&rdquo;是Python编程语言中Numpy数值环境所流行的术语。在其他编程语言和环境中，广播也可以称为<em>二进制单例扩展</em>（<small>MATLAB中的</small> BSX 和 <code>bsxfun</code> 函数名称的起源），<em>回收</em>（R编程语言），<em>单指令多数据</em>（SIMD），或<em>复制</em>。

source: A null string ("") input to <code>error</code> will be ignored and the code will continue running as if the statement were a NOP. This is for compatibility with <small>MATLAB</small>. It also makes it possible to write code such as
es: Se ignorar&aacute; una entrada de cadena nula ("") al <code>error</code> y el c&oacute;digo continuar&aacute; ejecut&aacute;ndose como si la declaraci&oacute;n fuera un NOP. Esto es por compatibilidad con <small>MATLAB</small> . Tambi&eacute;n hace posible escribir c&oacute;digo como
ja: <code>error</code> へのnull文字列（ ""）入力は無視され、ステートメントがNOPであるかのようにコードは実行を継続します。これは、<small>MATLAB</small>との互換性のためです。また、次のようなコードを作成することもできます。
ru: Пустая строка (""), введенная для <code>error</code> будет проигнорирована, и код продолжит выполнение, как если бы оператор был NOP. Это сделано для совместимости с <small>MATLAB</small> . Это также позволяет писать такой код, как
zh_cn: 输入 <code>error</code> 的空字符串（&ldquo;&rdquo;）将被忽略，并且代码将继续运行，就像该语句是NOP一样。这是为了与<small>MATLAB</small>兼容。这也使得编写诸如

source: A number of Octave high level plot functions return groups of other graphics objects or they return graphics objects that have their properties linked in such a way that changes to one of the properties results in changes in the others. A graphic object that groups other objects is an <code>hggroup</code>
es: Varias funciones de gr&aacute;fico de alto nivel de Octave devuelven grupos de otros objetos gr&aacute;ficos o devuelven objetos gr&aacute;ficos que tienen sus propiedades vinculadas de tal manera que los cambios en una de las propiedades dan como resultado cambios en las dem&aacute;s. Un objeto gr&aacute;fico que agrupa otros objetos es un <code>hggroup</code>
ja: 多くのOctave高レベルプロット関数は、他のグラフィックスオブジェクトのグループを返すか、プロパティの1つに変更を加えると他のプロパティも変更されるようにプロパティがリンクされたグラフィックスオブジェクトを返します。他のオブジェクトをグループ化するグラフィックオブジェクトは <code>hggroup</code> です。
ru: Некоторые высокоуровневые графические функции Octave возвращают группы других графических объектов или возвращают графические объекты, свойства которых связаны таким образом, что изменение одного из свойств приводит к изменениям других. Графический объект, который группирует другие объекты, является <code>hggroup</code>
zh_cn: 许多Octave高级绘图函数返回其他图形对象组，或者它们返回其属性链接的图形对象，从而改变其中一个属性会导致其他属性的改变。将其他对象分组的图形对象是 <code>hggroup</code>

source: A number specifying the size of the marker. The default is 1. A value of 2 is twice as large as the default, etc.
es: Un número que especifica el tamaño del marcador.El valor por defecto es 1.Un valor de 2 es el doble del valor por defecto,etc.
ja: マーカーのサイズを指定する数値。デフォルトは1で、2を指定すると2倍の大きさになります。
ru: Число,указывающее размер маркера.По умолчанию-1.Значение 2 в два раза больше,чем по умолчанию,и т.д.
zh_cn: 一个数字,指定标记的大小,默认为1。默认值是1,2是默认值的两倍,等等。

source: A number specifying the width of the line. The default is 1. A value of 2 is twice as wide as the default, etc.
es: Un número que especifica el ancho de la línea.El valor por defecto es 1.Un valor de 2 es el doble del ancho por defecto,etc.
ja: 線の幅を指定する数値。デフォルトは1で、2の値を指定すると2倍の幅になるなどの効果があります。
ru: Число,определяющее ширину линии.По умолчанию-1.Значение 2-в два раза шире,чем по умолчанию,и т.д.
zh_cn: 一个指定行的宽度的数字,默认为1。默认值是1,值为2时,宽度是默认值的两倍,等等。

source: A one line description of the package.
es: Una descripción de una línea del paquete.
ja: パッケージの一行説明。
ru: Описание пакета в одну строку.
zh_cn: 包裹的一行说明;

source: A one paragraph description of the package.
es: Una descripción de un párrafo del paquete.
ja: パッケージの説明を1段落で。
ru: Описание пакета в одном абзаце.
zh_cn: 一段关于包件的说明;

source: A particular problem of sparse matrices comes about due to the fact that as the zeros are not stored, the sign-bit of these zeros is equally not stored. In certain cases the sign-bit of zero is important. For example:
es: Un problema particular de las matrices dispersas se debe al hecho de que como los ceros no se almacenan,el signo-bit de estos ceros tampoco se almacena.En ciertos casos el signo-bit de cero es importante.Por ejemplo:
ja: 疎な行列の特定の問題は、ゼロが格納されていないので、これらのゼロの符号ビットも同様に格納されていないという事実に起因しています。特定のケースでは,ゼロの符号ビットが重要です.例えば
ru: Особая проблема разреженных матриц возникает из-за того,что,поскольку нули не хранятся,знак-бит этих нулей одинаково не хранится.В некоторых случаях важен знак-бит нуля.Например:
zh_cn: 稀疏矩阵的一个特殊问题是由于不存储零,这些零的符号位同样不存储。在某些情况下,零的符号位很重要。比如说

source: A patch for the bug. Patches can be helpful, but if you find a bug, you should report it, even if you cannot send a fix for the problem.
es: Un parche para el bicho.Los parches pueden ser útiles,pero si encuentras un error,debes reportarlo,incluso si no puedes enviar una solución al problema.
ja: バグに対するパッチです。パッチは役に立つかもしれませんが、バグを見つけたら、問題の修正プログラムを送ることができなくても、そのバグを報告してください。
ru: Заплатка за жучок.Патчи могут быть полезны,но если вы нашли ошибку,вы должны сообщить об этом,даже если вы не можете отправить исправление проблемы.
zh_cn: 错误的补丁。补丁是很有帮助的,但是如果你发现了一个bug,你应该报告它,即使你不能发送问题的修复。

source: A permutation matrix can also be returned from the built-in functions <em>lu</em> and <em>qr</em>, if a pivoted factorization is requested.
es: Tambi&eacute;n se puede devolver una matriz de permutaci&oacute;n de las funciones integradas <em>lu</em> y <em>qr</em> , si se solicita una factorizaci&oacute;n pivotada.
ja: ピボット分解が要求された場合、置換行列は組み込み関数<em>lu</em>および<em>qr</em>から返すこともできます。
ru: Матрица перестановок также может быть возвращена из встроенных функций <em>lu</em> и <em>qr</em> , если требуется поворотная факторизация.
zh_cn: 如果需要透视分解，也可以从内置函数<em>lu</em>和<em>qr</em>返回置换矩阵。

source: A permutation matrix can be transposed (or conjugate-transposed, which is the same, because a permutation matrix is never complex), inverting the permutation, or equivalently, turning a row-permutation matrix into a column-permutation one. For permutation matrices, transpose is equivalent to inversion, thus <code>P\M</code> is equivalent to <code>P'*M</code>. Transpose of a permutation matrix (or inverse) is a constant-time operation, flipping only a flag internally, and thus the choice between the two above equivalent expressions for inverse permuting is completely up to the user&rsquo;s taste.
es: Una matriz de permutaci&oacute;n se puede transponer (o conjugar-transponer, que es lo mismo, porque una matriz de permutaci&oacute;n nunca es compleja), invirtiendo la permutaci&oacute;n, o lo que es lo mismo, convirtiendo una matriz de permutaci&oacute;n de fila en una de permutaci&oacute;n de columna. Para matrices de permutaci&oacute;n, transpuesta es equivalente a la inversi&oacute;n, por lo tanto <code>P\M</code> es equivalente a <code>P'*M</code> . La transposici&oacute;n de una matriz de permutaci&oacute;n (o inversa) es una operaci&oacute;n de tiempo constante, volteando solo una bandera internamente y, por lo tanto, la elecci&oacute;n entre las dos expresiones equivalentes anteriores para la permutaci&oacute;n inversa depende completamente del gusto del usuario.
ja: 置換行列は転置できます（または、転置行列は複雑ではないため、共役転置でも同じです）、置換を反転するか、同等に、行置換行列を列置換行列に変換できます。置換行列の場合、転置は反転と同じです。したがって、 <code>P\M</code> は <code>P'*M</code> と同じです。置換行列（または逆行列）の転置は一定時間の演算であり、フラグのみを内部で反転します。したがって、逆置換の上記の2つの同等の式のどちらを選択するかは、ユーザーの好み次第です。
ru: Матрицу перестановок можно транспонировать (или сопряженно транспонировать, что то же самое, потому что матрица перестановок никогда не бывает сложной), инвертируя перестановку или, что эквивалентно, превращая матрицу перестановки строк в матрицу перестановки столбцов. Для матриц перестановок, транспонированная эквивалентна инверсии, что <code>P\M</code> эквивалентно <code>P'*M</code> . Транспонирование матрицы перестановок (или обратная перестановка) - это операция с постоянным временем, внутренняя перестановка только флага, и, таким образом, выбор между двумя вышеуказанными эквивалентными выражениями для обратной перестановки полностью зависит от вкуса пользователя.
zh_cn: 可以置换一个置换矩阵（或共轭置换，这是相同的，因为置换矩阵从不复杂），可以反转置换，或者等效地将行置换矩阵转换为列置换。为置换矩阵，转置相当于反转，从而 <code>P\M</code> 相当于 <code>P'*M</code> 。置换矩阵（或逆矩阵）的转置是固定时间的操作，仅在内部翻转标志，因此，上述两个用于逆置换的等效表达式之间的选择完全取决于用户的喜好。

source: A permutation matrix is defined as a square matrix that has a single element equal to unity in each row and each column; all other elements are zero. That is, there exists a permutation (vector) <code>p</code> such that <code>P(i,j) == 1</code> if <code>j == p(i)</code> and <code>P(i,j) == 0</code> otherwise.
es: Una matriz de permutaci&oacute;n se define como una matriz cuadrada que tiene un solo elemento igual a la unidad en cada fila y cada columna; todos los dem&aacute;s elementos son cero. Es decir, existe una permutaci&oacute;n (vector) <code>p</code> tal que <code>P(i,j) == 1</code> si <code>j == p(i)</code> y <code>P(i,j) == 0</code> caso contrario.
ja: 順列行列は、各行と各列の単一性に等しい単一の要素を持つ正方行列として定義されます。他のすべての要素はゼロです。すなわち、順列（ベクトル）が存在する <code>p</code> ように <code>P(i,j) == 1</code> であれば <code>j == p(i)</code> 及び <code>P(i,j) == 0</code> そうでない場合に。
ru: Матрица перестановок определяется как квадратная матрица, имеющая единственный элемент, равный единице, в каждой строке и каждом столбце; все остальные элементы равны нулю. То есть существует перестановка (вектор) <code>p</code> такая, что <code>P(i,j) == 1</code> если <code>j == p(i)</code> и <code>P(i,j) == 0</code> противном случае.
zh_cn: 置换矩阵定义为在每个行和每一列中具有等于1的单个元素的方阵；其他所有元素均为零。也就是说，存在一个置换（矢量） <code>p</code> ，使得 <code>P(i,j) == 1</code> 如果 <code>j == p(i)</code> 和 <code>P(i,j) == 0</code> 否则。

source: A positive <var>k</var> leads to a left shift; A negative value to a right shift.
es: Un <var>k</var> positivo conduce a un desplazamiento a la izquierda; Un valor negativo para un desplazamiento a la derecha.
ja: 正の <var>k</var> は左シフトにつながります。右シフトに対して負の値。
ru: Положительный <var>k</var> приводит к сдвигу влево; Отрицательное значение сдвига вправо.
zh_cn: 正 <var>k</var> 导致左移；负值右移。
