Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/octave/octave.*.011.xlf
Languages: es, ja, ru, zh_cn

source: Both <var>minargs</var> and <var>maxargs</var> must be numeric scalars. Zero, Inf, and negative are all valid, and they can have the same value.
es: Tanto los <var>minargs</var> como los <var>maxargs</var> deben ser escalares num&eacute;ricos. Cero, Inf y negativo son todos v&aacute;lidos y pueden tener el mismo valor.
ja: <var>minargs</var> と <var>maxargs</var> はどちらも数値スカラーでなければなりません。Zero、Inf、negativeはすべて有効であり、同じ値を持つことができます。
ru: И <var>minargs</var> , и <var>maxargs</var> должны быть числовыми скалярами. Ноль, Inf и отрицательное значение - все действительны и могут иметь одно и то же значение.
zh_cn: 无论 <var>minargs</var> 和 <var>maxargs</var> 必须是数字标量。零，Inf和负数均有效，并且它们可以具有相同的值。

source: Both <var>minargs</var> and <var>maxargs</var> must be scalar numeric values. Zero, Inf, and negative values are all allowed, and <var>minargs</var> and <var>maxargs</var> may be equal.
es: Tanto los <var>minargs</var> como los <var>maxargs</var> deben ser valores num&eacute;ricos escalares. Se permiten valores cero, Inf y negativos, y los <var>minargs</var> y <var>maxargs</var> pueden ser iguales.
ja: <var>minargs</var> と <var>maxargs</var> はどちらもスカラー数値でなければなりません。ゼロ、Inf、および負の値はすべて許可され、 <var>minargs</var> と <var>maxargs</var> は等しい場合があります。
ru: И <var>minargs</var> , и <var>maxargs</var> должны быть скалярными числовыми значениями. <var>minargs</var> <var>maxargs</var> и отрицательные значения, а minargs и maxargs могут быть равны.
zh_cn: 无论 <var>minargs</var> 和 <var>maxargs</var> 必须是标量数值。零，Inf和负值都是允许的，并且 <var>minargs</var> 和 <var>maxargs</var> 可以相等。

source: Both <var>val</var> and <var>type</var> are typically one of the following built-in classes:
es: Tanto <var>val</var> como <var>type</var> suelen ser una de las siguientes clases integradas:
ja: 両方 <var>val</var> と <var>type</var> 一般的にビルトインクラス次のいずれかです：
ru: И <var>val</var> , и <var>type</var> обычно являются одним из следующих встроенных классов:
zh_cn: 这两个 <var>val</var> 和 <var>type</var> 通常是以下内置类之一：

source: Both Ends, with one more from the high-end if <var>k</var> is odd (valid only for real symmetric problems).
es: Ambos extremos, con uno m&aacute;s del extremo superior si <var>k</var> es impar (v&aacute;lido solo para problemas sim&eacute;tricos reales).
ja: 両端、 <var>k</var> が奇数の場合は上限からもう1つ（真の対称問題でのみ有効）。
ru: Оба конца, и еще один от верхнего уровня, если <var>k</var> нечетное (действительно только для реальных симметричных задач).
zh_cn: 两端，如果 <var>k</var> 为奇数，则高端还有一个（仅对于实对称问题有效）。

source: Both arrays can be broadcast across each other, for example, all pairwise differences of the elements of a vector with itself:
es: Ambas matrices pueden transmitirse entre sí,por ejemplo,todas las diferencias de pares de los elementos de un vector con él mismo:
ja: 両方の配列は、例えば、それ自身とのベクトルの要素のすべてのペアワイズの差分など、互いにブロードキャストすることができます。
ru: Оба массива могут транслироваться друг на друга,например,все парные разности элементов вектора с самим собой:
zh_cn: 这两个数组可以互相广播,例如,一个向量的元素与自身的所有对差。

source: Both function files and script files end with an extension of .m, for <small>MATLAB</small> compatibility. If you want more than one independent functions in a file, it must be a script file (see <a href="script-files#Script-Files">Script Files</a>), and to use these functions you must execute the script file before you can use the functions that are in the script file.
es: Tanto los archivos de funciones como los archivos de script terminan con una extensi&oacute;n de .m, para compatibilidad con <small>MATLAB</small> . Si desea m&aacute;s de una funci&oacute;n independiente en un archivo, debe ser un archivo de secuencia de comandos (consulte <a href="script-files#Script-Files">Archivos de secuencia de comandos</a> ) y para usar estas funciones debe ejecutar el archivo de secuencia de comandos antes de poder usar las funciones que est&aacute;n en el archivo de secuencia de comandos.
ja: 関数ファイルとスクリプトファイルはどちらも、<small>MATLABとの</small>互換性のために拡張子.mで終わります。ファイルに複数の独立した関数が必要な場合は、スクリプトファイルである必要があります（<a href="script-files#Script-Files">スクリプトファイルを</a>参照）。これらの関数を使用するには、スクリプトファイル内の関数を使用する前にスクリプトファイルを実行する必要があります。
ru: И файлы функций, и файлы сценариев заканчиваются расширением .m для совместимости с <small>MATLAB</small> . Если вы хотите, чтобы в файле было несколько независимых функций, это должен быть файл сценария (см. <a href="script-files#Script-Files">Файлы сценария</a> ), и для использования этих функций вы должны выполнить файл сценария, прежде чем вы сможете использовать функции, которые находятся в файле сценария.
zh_cn: 为了与<small>MATLAB</small>兼容，函数文件和脚本文件都以.m扩展名结尾。如果文件中需要多个独立功能，则该文件必须是脚本文件（请参阅<a href="script-files#Script-Files">脚本文件</a>），并且要使用这些功能，必须先执行脚本文件，然后才能使用脚本文件中的功能。

source: Both parameters are optional. The default cycle time is 5 seconds and the default increment is 2. If the option <code>"inf"</code> is given then cycle continuously until
es: Ambos par&aacute;metros son opcionales. El tiempo de ciclo predeterminado es de 5 segundos y el incremento predeterminado es 2. Si se da la opci&oacute;n <code>"inf"</code> ,realice el ciclo de forma continua hasta que
ja: どちらのパラメーターもオプションです。デフォルトのサイクルタイムは5秒で、デフォルトの増分は2です。オプション <code>"inf"</code> が指定されている場合は、
ru: Оба параметра необязательны. Время цикла по умолчанию составляет 5 секунд, а приращение по умолчанию - 2. Если задана опция <code>"inf"</code> продолжайте цикл до тех пор, пока
zh_cn: 这两个参数都是可选的。默认的循环时间是5秒，默认的增量是2。如果给出选项 <code>"inf"</code> ，则连续循环直到

source: Both the class of <var>x</var> and <var>class</var> must be one of the built-in numeric classes:
es: Tanto la clase de <var>x</var> como la <var>class</var> deben ser una de las clases num&eacute;ricas integradas:
ja: クラスの両方 <var>x</var> と <var>class</var> 組み込み数値クラスのいずれかである必要があります。
ru: И класс <var>x</var> , и <var>class</var> должны быть одним из встроенных числовых классов:
zh_cn: 这两个类 <var>x</var> 和 <var>class</var> 必须是一个内置数字类：

source: Bottom center of the screen.
es: En el centro inferior de la pantalla.
ja: 画面下中央。
ru: Нижний центр экрана.
zh_cn: 画面的底部中心。

source: Bottom left of the screen.
es: Abajo a la izquierda de la pantalla.
ja: 画面の左下。
ru: Внизу слева от экрана.
zh_cn: 屏幕左下角。

source: Bottom right of the screen.
es: Abajo a la derecha de la pantalla.
ja: 画面の右下。
ru: В нижней правой части экрана.
zh_cn: 屏幕右下方。

source: Branching technique option (for MIP only):
es: Opción de técnica de ramificación (sólo para MIP):
ja: 分岐テクニックオプション(MIPのみ)。
ru: Опция техники разветвления (только для MIP):
zh_cn: 分支技术选项(仅适用于MIP)。

source: Breadth first search.
es: Amplia primera búsqueda.
ja: 最初の検索の幅。
ru: Первый поиск хлеба.
zh_cn: 广度先搜索。

source: Breakpoints and events can be removed using the <code>dbclear</code> command with the same syntax.
es: Los <code>dbclear</code> y los eventos se pueden eliminar mediante el comando dbclear con la misma sintaxis.
ja: ブレークポイントとイベントは、同じ構文で <code>dbclear</code> コマンドを使用して削除できます。
ru: Точки останова и события можно удалить с помощью команды <code>dbclear</code> с тем же синтаксисом.
zh_cn: 可以使用具有相同语法的 <code>dbclear</code> 命令删除断点和事件。

source: Breakpoints can be set in any m-file function by using the <code>dbstop</code> function.
es: Los <code>dbstop</code> se pueden establecer en cualquier funci&oacute;n de archivo m mediante la funci&oacute;n dbstop .
ja: ブレークポイントは、 <code>dbstop</code> 関数を使用して、任意のmファイル関数で設定できます。
ru: Точки останова могут быть установлены в любой функции m-файла с помощью функции <code>dbstop</code> .
zh_cn: 可以使用 <code>dbstop</code> 函数在任何m文件功能中设置断点。

source: Breakpoints in class methods are also supported (e.g., <code>dbstop ("@class/method")</code>). However, breakpoints cannot be set in built-in functions (e.g., <code>sin</code>, etc.) or dynamically loaded functions (i.e., oct-files).
es: Los <code>dbstop ("@class/method")</code> en los m&eacute;todos de clase tambi&eacute;n son compatibles (por ejemplo, dbstop ("@ class / method") ). Sin embargo, los puntos de interrupci&oacute;n no se pueden establecer en funciones integradas (por ejemplo, <code>sin</code> , etc.) o funciones cargadas din&aacute;micamente (por ejemplo, archivos oct).
ja: クラスメソッドのブレークポイントもサポートされています（例： <code>dbstop ("@class/method")</code> ）。ただし、組み込み関数（たとえば、 <code>sin</code> など）または動的に読み込まれる関数（つまり、octファイル）にはブレークポイントを設定できません。
ru: Также поддерживаются точки останова в методах класса (например, <code>dbstop ("@class/method")</code> ). Однако точки останова не могут быть установлены во встроенных функциях (например, <code>sin</code> и т.д.) или динамически загружаемых функциях (например, в файлах oct).
zh_cn: 还支持类方法中的断点（例如 <code>dbstop ("@class/method")</code> ）。但是，不能在内置函数（例如 <code>sin</code> 等）或动态加载的函数（即oct文件）中设置断点。

source: Brighten or darken a colormap.
es: Aclarar u oscurecer un mapa de colores.
ja: カラーマップを明るくしたり暗くしたりします。
ru: Осветлить или затемнить цветную карту.
zh_cn: 使彩色地图变亮或变暗。

source: Broadcasting is only applied if either of the two broadcasting conditions hold. As usual, however, broadcasting does not apply when two dimensions differ and neither is 1:
es: La radiodifusión sólo se aplica si se mantiene alguna de las dos condiciones de radiodifusión.Sin embargo,como es habitual,la radiodifusión no se aplica cuando dos dimensiones difieren y ninguna de ellas es 1:
ja: ブロードキャストは、2つのブロードキャスト条件のいずれかが成立した場合にのみ適用される。ただし、通常通り、2つの次元が異なり、どちらも1ではない場合は放送は適用されません。
ru: Трансляция применяется только в том случае,если одно из двух условий трансляции соблюдено.Однако,как обычно,вещание не применяется,когда два измерения различаются и ни одно из них не равно 1:
zh_cn: 只有当两个广播条件中的任何一个条件成立时,才适用广播。但一样平常来说,当两个维度差别且都不为1时,不适用广播。

source: Broadcasting operations
es: Operaciones de radiodifusión
ja: 放送事業
ru: Трансляционная деятельность
zh_cn: 广播业务

source: Broadcasting refers to how Octave binary operators and functions behave when their matrix or array operands or arguments differ in size. Since version 3.6.0, Octave now automatically broadcasts vectors, matrices, and arrays when using elementwise binary operators and functions. Broadly speaking, smaller arrays are &ldquo;broadcast&rdquo; across the larger one, until they have a compatible shape. The rule is that corresponding array dimensions must either
es: La difusi&oacute;n se refiere a c&oacute;mo se comportan los operadores binarios y las funciones de Octave cuando sus operandos o argumentos de matriz o arreglo difieren en tama&ntilde;o. Desde la versi&oacute;n 3.6.0, Octave ahora transmite autom&aacute;ticamente vectores, matrices y matrices cuando se utilizan operadores y funciones binarios de elementos. En t&eacute;rminos generales, las matrices m&aacute;s peque&ntilde;as se "transmiten" a trav&eacute;s de la m&aacute;s grande, hasta que tengan una forma compatible. La regla es que las dimensiones de matriz correspondientes deben
ja: ブロードキャストとは、行列または配列のオペランドまたは引数のサイズが異なる場合のOctaveの2項演算子と関数の動作を指します。バージョン3.6.0以降、Octaveは要素ごとの2項演算子と関数を使用するときに、ベクトル、行列、配列を自動的にブロードキャストするようになりました。大まかに言えば、互換性のある形状になるまで、小さなアレイは大きなアレイ全体に「ブロードキャスト」されます。ルールは、対応する配列の次元は、
ru: Трансляция относится к поведению двоичных операторов и функций Octave, когда их операнды или аргументы матрицы или массива различаются по размеру. Начиная с версии 3.6.0, Octave теперь автоматически передает векторы, матрицы и массивы при использовании поэлементных бинарных операторов и функций. Вообще говоря, меньшие массивы &laquo;транслируются&raquo; по большему массиву до тех пор, пока они не приобретут совместимую форму. Правило состоит в том, что соответствующие размеры массива должны либо
zh_cn: 广播是指八度二进制运算符和函数在其矩阵或数组操作数或参数的大小不同时的行为。从3.6.0版开始，Octave现在在使用元素智能二进制运算符和函数时自动广播矢量，矩阵和数组。广义上讲，较小的阵列在较大的阵列上&ldquo;广播&rdquo;，直到它们具有兼容的形状为止。规则是相应的数组维必须

source: Bug Criteria
es: Criterios de los bichos
ja: バグ基準
ru: Критерии ошибок
zh_cn: 错误标准

source: Bug Reporting
es: Reporte de Bichos
ja: バグ報告
ru: Сообщение об ошибках
zh_cn: 错误报告

source: Bug Tracker
es: Rastreador de bichos
ja: バグトラッカー
ru: Отслеживатель ошибок
zh_cn: 错误追踪器

source: Bugs we will fix later.
es: Bugs que arreglaremos más tarde.
ja: バグは後ほど修正します。
ru: Ошибки мы исправим позже.
zh_cn: 错误我们会在以后修复。

source: Build a binary form of a package or packages. The binary file produced will itself be an Octave package that can be installed normally with <code>pkg</code>. The form of the command to build a binary package is
es: Cree una forma binaria de un paquete o paquetes. El archivo binario producido ser&aacute; en s&iacute; mismo un paquete Octave que se puede instalar normalmente con <code>pkg</code> . La forma del comando para construir un paquete binario es
ja: パッケージのバイナリ形式をビルドします。生成されるバイナリファイルは、それ自体が通常の <code>pkg</code> でインストールできるOctaveパッケージになります。バイナリパッケージをビルドするコマンドの形式は次のとおりです。
ru: Создайте двоичную форму пакета или пакетов. Созданный двоичный файл будет сам по себе пакетом Octave, который можно установить с помощью <code>pkg</code> . Форма команды для создания двоичного пакета:
zh_cn: 构建一个或多个程序包的二进制形式。产生的二进制文件本身将是一个Octave软件包，可以使用 <code>pkg</code> 正常安装。生成二进制软件包的命令形式为

source: Build a block diagonal matrix from <var>A</var>, <var>B</var>, <var>C</var>, &hellip;
es: Construye una matriz diagonal de bloques a partir de <var>A</var> , <var>B</var> , <var>C</var> ,&hellip;
ja: <var>A</var> 、 <var>B</var> 、 <var>C</var> 、&hellip; からブロック対角行列を作成します
ru: Постройте блочно-диагональную матрицу из <var>A</var> , <var>B</var> , <var>C</var> ,&hellip;
zh_cn: 根据 <var>A</var> ， <var>B</var> ， <var>C</var> &hellip; 建立块对角矩阵

source: Build complete filename from separate parts.
es: Construye un nombre de archivo completo a partir de partes separadas.
ja: 別々のパーツから完全なファイル名を構築します。
ru: Постройте полное имя файла из отдельных частей.
zh_cn: 从单独的部分建立完整的文件名。

source: Built-in Data Types
es: Tipos de datos incorporados
ja: 組み込みのデータ型
ru: Встроенные Типы данных
zh_cn: 内置数据类型

source: Built-in function A function that is a part of core Octave such as <code>numel</code>, <code>size</code>, etc.
es: Funci&oacute;n incorporada Una funci&oacute;n que forma parte de la octava principal, como <code>numel</code> , <code>size</code> , etc.
ja: 組み込み関数 <code>numel</code> 、 <code>size</code> など、コアOctaveの一部である関数。
ru: Встроенная функция Функция, которая является частью ядра Octave, например <code>numel</code> , <code>size</code> и т. Д.
zh_cn: 内置函数是核心Octave一部分的函数，例如 <code>numel</code> ， <code>size</code> 等。

source: Bulleted Lists
es: Listas con viñetas
ja: 箇条書きリスト
ru: Бюллетени
zh_cn: 列表

source: Bulleted list item 1
es: Lista de viñetas,punto 1
ja: 箇条書きのリスト項目1
ru: Бюллетеный список пункт 1
zh_cn: 列表项目1

source: Bulleted list item 2
es: Lista de viñetas del artículo 2
ja: 箇条書きのリスト項目2
ru: Бюллетеный список пункт 2
zh_cn: 列表项目2

source: But it is if you preallocate the cell array <code>y</code>:
es: Pero lo es si preasigna la matriz de celdas <code>y</code> :
ja: しかし、これはセル配列 <code>y</code> を事前に割り当てている場合です。
ru: Но это если вы предварительно выделите массив ячеек <code>y</code> :
zh_cn: 但这是如果您预先分配了单元格数组 <code>y</code> ：

source: But that also means that you might have to assign the output of a method that changes properties back to the object manually:
es: Pero eso también significa que podría tener que asignar la salida de un método que cambia las propiedades de nuevo al objeto manualmente:
ja: しかし、それはプロパティを変更するメソッドの出力を手動でオブジェクトに戻さなければならないかもしれないことも意味します。
ru: Но это также означает,что вам,возможно,придется назначить вывод метода,который изменяет свойства обратно на объект вручную:
zh_cn: 但这也意味着,你可能必须将改变属性的方法的输出手动分配回对象。

source: But this does not give much information about where this time is spent; for instance, whether the single call to <code>expm</code> is more expensive or the recursive time-stepping itself. To get a more detailed picture, we can use the profiler.
es: Pero esto no proporciona mucha informaci&oacute;n sobre d&oacute;nde se pasa este tiempo; por ejemplo, si la llamada &uacute;nica a <code>expm</code> es m&aacute;s cara o el paso de tiempo recursivo en s&iacute;. Para obtener una imagen m&aacute;s detallada, podemos usar el generador de perfiles.
ja: しかし、これはこの時間が費やされている場所についての多くの情報を提供しません。たとえば、 <code>expm</code> の1回の呼び出しの方が負荷が高いか、それとも再帰的な時間ステップ自体か。より詳細な画像を取得するには、プロファイラーを使用できます。
ru: Но это не дает много информации о том, на что тратится это время; например, является ли одиночный вызов <code>expm</code> более дорогим или сам рекурсивный пошаговый режим. Чтобы получить более подробную картину, мы можем использовать профилировщик.
zh_cn: 但这并不能提供太多有关此时间的信息。例如，单次调用 <code>expm</code> 会更昂贵，还是递归时间步长本身。要获得更详细的图片，我们可以使用探查器。

source: ButtonDownFcn: called if a mouse button is pressed while the pointer is over this object. Note, that the gnuplot interface does not implement this callback.
es: ButtonDownFcn:se llama si se presiona un botón del ratón mientras el puntero está sobre este objeto.Nota,que la interfaz gnuplot no implementa esta llamada.
ja: ButtonDownFcn:ポインタがこのオブジェクトの上にあるときにマウスのボタンが押された場合に呼び出されます。gnuplot インターフェースはこのコールバックを実装していないことに注意してください。
ru: ButtonDownFcn:вызывается,если нажать кнопку мыши при наведении указателя на данный объект.Обратите внимание,что интерфейс gnuplot не реализует этот обратный вызов.
zh_cn: ButtonDownFcn:当鼠标指针在此对象上时,如果鼠标按钮被按下,则调用此回调。注意,gnuplot接口没有实现这个回调。

source: By convention,
es: Por convención,
ja: 慣例では
ru: По условию,
zh_cn: 按照惯例:

source: By default (<var>c</var> omitted, or a particular column unspecified in <var>c</var>) an ascending sort order is used. However, if elements of <var>c</var> are negative then the corresponding column is sorted in descending order. If the elements of <var>A</var> are strings then a lexicographical sort is used.
es: Por defecto ( <var>c</var> omitido, o una columna en particular no especificada en <var>c</var> ) se usa un orden de clasificaci&oacute;n ascendente. Sin embargo, si los elementos de <var>c</var> son negativos, la columna correspondiente se ordena en orden descendente. Si los elementos de <var>A</var> son cadenas, se utiliza una ordenaci&oacute;n lexicogr&aacute;fica.
ja: デフォルトでは（ <var>c</var> 省略、または <var>c</var> で指定されていない特定の列）、昇順のソート順が使用されます。ただし、 <var>c</var> の要素が負の場合、対応する列は降順で並べ替えられます。 <var>A</var> の要素が文字列の場合、辞書式ソートが使用されます。
ru: По умолчанию ( <var>c</var> опущено или конкретный столбец не указан в <var>c</var> ) используется возрастающий порядок сортировки. Однако, если элементы <var>c</var> отрицательны, соответствующий столбец сортируется в порядке убывания. Если элементы <var>A</var> являются строками, используется лексикографическая сортировка.
zh_cn: 默认情况下（省略 <var>c</var> 或 <var>c</var> 中未指定的特定列），使用升序排序。但是，如果 <var>c</var> 的元素为负，则对应的列将按降序排序。如果 <var>A</var> 的元素是字符串，则使用字典排序。

source: By default <code>accumarray</code> returns a full matrix. If <var>issparse</var> is logically true, then a sparse matrix is returned instead.
es: De forma predeterminada, <code>accumarray</code> devuelve una matriz completa. Si <var>issparse</var> es l&oacute;gicamente verdadero, en su lugar se devuelve una matriz dispersa.
ja: デフォルトでは、 <code>accumarray</code> は完全な行列を返します。場合 <var>issparse</var> が論理的に真である場合、スパース行列が代わりに返されます。
ru: По умолчанию <code>accumarray</code> возвращает полную матрицу. Если <var>issparse</var> логически истинно, то вместо него возвращается разреженная матрица.
zh_cn: 默认情况下， <code>accumarray</code> 返回完整的矩阵。如果 <var>issparse</var> 在逻辑上为true，则将返回一个稀疏矩阵。

source: By default <var>S</var> is assumed to be symmetric and the symmetric elimination tree is returned. The argument <var>typ</var> controls whether a symmetric or column elimination tree is returned. Valid values of <var>typ</var> are <code>"sym"</code> or <code>"col"</code>, for symmetric or column elimination tree respectively.
es: Por defecto, se supone que <var>S</var> es sim&eacute;trico y se devuelve el &aacute;rbol de eliminaci&oacute;n sim&eacute;trico. El argumento <var>typ</var> controla si se devuelve un &aacute;rbol de eliminaci&oacute;n sim&eacute;trico o de columna. Los valores v&aacute;lidos de <var>typ</var> son <code>"sym"</code> o <code>"col"</code> , para &aacute;rbol de eliminaci&oacute;n sim&eacute;trico o de columna, respectivamente.
ja: デフォルトでは、 <var>S</var> は対称であると見なされ、対称除去木が返されます。引数 <var>typ</var> は、対称または列消去ツリーを返すかどうかを制御します。有効な値 <var>typ</var> ある <code>"sym"</code> または <code>"col"</code> それぞれ対称または列消去ツリーのため、。
ru: По умолчанию <var>S</var> считается симметричным, и возвращается симметричное дерево исключения. Аргумент <var>typ</var> определяет , будет ли возвращено симметричное или столбец дерево ликвидации. Допустимые значения <var>typ</var> являются <code>"sym"</code> или <code>"col"</code> , для симметричного или элиминации столбца дерева соответственно.
zh_cn: 默认情况下，假设 <var>S</var> 是对称的，并且返回对称消除树。参数 <var>typ</var> 控制返回对称树还是列消除树。的有效值 <var>typ</var> 是 <code>"sym"</code> 或 <code>"col"</code> 分别为对称或列消除树。

source: By default callback functions are queued (they are executed one after the other in the event queue) unless the <code>drawnow</code>, <code>figure</code>, <code>waitfor</code>, <code>getframe</code>, or <code>pause</code> functions are used. If an executing callback invokes one of those functions, it causes Octave to flush the event queue, which results in the executing callback being interrupted.
es: Por defecto, las funciones de devoluci&oacute;n de llamada se ponen en cola (se ejecutan una tras otra en la cola de eventos) a menos que se <code>drawnow</code> las funciones dibujar , <code>figure</code> , <code>waitfor</code> , obtener <code>getframe</code> o <code>pause</code> . Si una devoluci&oacute;n de llamada en ejecuci&oacute;n invoca una de esas funciones, hace que Octave vac&iacute;e la cola de eventos, lo que resulta en la interrupci&oacute;n de la devoluci&oacute;n de llamada en ejecuci&oacute;n.
ja: デフォルトでは、 <code>drawnow</code> 、 <code>figure</code> 、 <code>waitfor</code> 、 <code>getframe</code> 、または <code>pause</code> 関数が使用されていない限り、コールバック関数はキューに入れられます（イベントキューで順番に実行されます）。実行中のコールバックがこれらの関数の1つを呼び出すと、Octaveはイベントキューをフラッシュし、その結果、実行中のコールバックが中断されます。
ru: По умолчанию функции обратного вызова ставятся в очередь (они выполняются одна за другой в очереди событий), если не используются функции <code>drawnow</code> , <code>figure</code> , <code>waitfor</code> , <code>getframe</code> или <code>pause</code> . Если выполняющийся обратный вызов вызывает одну из этих функций, он заставляет Octave очищать очередь событий, что приводит к прерыванию выполнения обратного вызова.
zh_cn: 默认情况下，回调函数会排队（它们在事件队列中一个接一个地执行），除非使用了 <code>drawnow</code> ， <code>figure</code> ， <code>waitfor</code> ， <code>getframe</code> 或 <code>pause</code> 函数。如果正在执行的回调调用这些函数之一，则它将使Octave刷新事件队列，从而导致正在执行的回调被中断。

source: By default installed packages are not available from the Octave prompt, but it is possible to control this using the <code>pkg load</code> and <code>pkg unload</code> commands. The functions from a package can be added to the Octave path by typing
es: Por defecto, los paquetes instalados no est&aacute;n disponibles desde el indicador de Octave, pero es posible controlar esto usando los comandos <code>pkg load</code> y <code>pkg unload</code> . Las funciones de un paquete se pueden agregar a la ruta Octave escribiendo
ja: デフォルトでは、インストールされたパッケージはOctaveプロンプトからは利用できませんが、 <code>pkg load</code> および <code>pkg unload</code> コマンドを使用してこれを制御することが可能です。次のように入力して、パッケージの関数をOctaveパスに追加できます。
ru: По умолчанию установленные пакеты недоступны из командной строки Octave, но это можно контролировать с помощью команд <code>pkg load</code> и <code>pkg unload</code> . Функции из пакета можно добавить в путь Octave, набрав
zh_cn: 默认情况下，已安装的软件包在Octave提示符下不可用，但是可以使用 <code>pkg load</code> 和 <code>pkg unload</code> 命令来控制它。可以通过键入将包中的功能添加到八度路径
