Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/octave/octave.*.020.xlf
Languages: es, ru, zh_cn

source: The values <var>n</var> for which the expression was calculated <strong>AND</strong> the execution time was greater than zero.
es: Los valores <var>n</var> para los que se calcul&oacute; la expresi&oacute;n <strong>Y</strong> el tiempo de ejecuci&oacute;n fue mayor que cero.
ru: Значения <var>n</var> , для которых было вычислено выражение, <strong>И</strong> время выполнения больше нуля.
zh_cn: 值 <var>n</var> 用于其计算的表达<strong>和</strong>执行时间为大于零。

source: The values <var>y</var> and <var>c</var> can be derived by
es: Los valores <var>y</var> y <var>c</var> se pueden derivar por
ru: Значения <var>y</var> и <var>c</var> могут быть получены с помощью
zh_cn: 值 <var>y</var> 和 <var>c</var> 可以通过

source: The values in <var>c</var> are scaled to span the range of the current colormap. Limits may be placed on the color axis by the command <code>caxis</code>, or by setting the <code>clim</code> property of the parent axis.
es: Los valores de <var>c</var> se escalan para abarcar el rango del mapa de colores actual. Los l&iacute;mites se pueden colocar en el eje de color mediante el <code>caxis</code> de comando o estableciendo la propiedad <code>clim</code> del eje principal.
ru: Значения в <var>c</var> масштабируются, чтобы охватить диапазон текущей цветовой карты. Ограничения могут быть помещены на цветовую ось с помощью команды <code>caxis</code> или путем установки свойства <code>clim</code> родительской оси.
zh_cn: <var>c</var> 中的值被缩放以覆盖当前颜色图的范围。可以通过命令 <code>caxis</code> 或通过设置父轴的 <code>clim</code> 属性在颜色轴上设置限制。

source: The values of the polynomial for each value of <var>x</var>.
es: Los valores del polinomio para cada valor de <var>x</var> .
ru: Значения полинома для каждого значения <var>x</var> .
zh_cn: 每个 <var>x</var> 值的多项式值。

source: The values of the vector field to plot.
es: Los valores del campo vectorial a trazar.
ru: Значения векторного поля для построения графиков.
zh_cn: 要绘制的向量域的值。

source: The variable <code><var>pos</var>(1:2)</code> defines the lower left-hand corner of the patch and <code><var>pos</var>(3:4)</code> defines its width and height. By default, the value of <var>pos</var> is <code>[0, 0, 1, 1]</code>.
es: La variable <code><var>pos</var>(1:2)</code> define la esquina inferior izquierda del parche y <code><var>pos</var>(3:4)</code> define su ancho y alto. De forma predeterminada, el valor de <var>pos</var> es <code>[0, 0, 1, 1]</code> .
ru: Переменная <code><var>pos</var>(1:2)</code> определяет нижний левый угол патча, а <code><var>pos</var>(3:4)</code> определяет его ширину и высоту. По умолчанию значение <var>pos</var> равно <code>[0, 0, 1, 1]</code> .
zh_cn: 变量 <code><var>pos</var>(1:2)</code> 定义了补丁的左下角，而 <code><var>pos</var>(3:4)</code> 定义了补丁的宽度和高度。默认情况下， <var>pos</var> 的值为 <code>[0, 0, 1, 1]</code> 0，0，1，1 ]。

source: The variable <var>curv</var> defines the curvature of the sides of the rectangle and may be a scalar or two-element vector with values between 0 and 1. A value of 0 represents no curvature of the side, whereas a value of 1 means that the side is entirely curved into the arc of a circle. If <var>curv</var> is a two-element vector, then the first element is the curvature along the x-axis of the patch and the second along y-axis.
es: La variable <var>curv</var> define la curvatura de los lados del rect&aacute;ngulo y puede ser un vector escalar o de dos elementos con valores entre 0 y 1. Un valor de 0 no representa ninguna curvatura del lado, mientras que un valor de 1 significa que el lado es completamente curvado en el arco de un c&iacute;rculo. Si <var>curv</var> es un vector de dos elementos, entonces el primer elemento es la curvatura a lo largo del eje x del parche y el segundo a lo largo del eje y.
ru: Переменная <var>curv</var> определяет кривизну сторон прямоугольника и может быть скалярным или двухэлементным вектором со значениями от 0 до 1. Значение 0 означает отсутствие кривизны стороны, тогда как значение 1 означает, что сторона полностью изогнуты по дуге круга. Если <var>curv</var> - это двухэлементный вектор, то первый элемент - это кривизна по оси x патча, а второй - по оси y.
zh_cn: 变量 <var>curv</var> 定义矩形边的曲率，并且可以是标量或两元素矢量，其值在0到1之间。值0表示该边没有曲率，而值1表示该边是曲率。完全弯曲成一个圆弧。如果 <var>curv</var> 是一个包含两个元素的矢量，则第一个元素是沿着贴片的x轴的曲率，第二个元素是沿y轴的曲率。

source: The variable <var>k</var> is the constant of integration, which by default is set to zero.
es: La variable <var>k</var> es la constante de integraci&oacute;n, que por defecto se establece en cero.
ru: Переменная <var>k</var> - это постоянная интегрирования, которая по умолчанию равна нулю.
zh_cn: 变量 <var>k</var> 是积分常数，默认情况下设置为零。

source: The variable <var>rootkey</var> must be a string with a valid root key identifier:
es: La variable <var>rootkey</var> debe ser una cadena con un identificador de clave ra&iacute;z v&aacute;lido:
ru: Переменная <var>rootkey</var> должна быть строкой с допустимым идентификатором корневого ключа:
zh_cn: 变量 <var>rootkey</var> 必须是具有有效根密钥标识符的字符串：

source: The variable <var>s</var> is accepted for compatibility but is ignored.
es: La variable <var>s</var> se acepta por compatibilidad, pero se ignora.
ru: Переменная <var>s</var> принимается для совместимости, но игнорируется.
zh_cn: 变量 <var>s</var> 被接受以兼容，但是被忽略。

source: The variable <var>success</var> is 1 if the download was successful, otherwise it is 0 in which case <var>message</var> contains an error message.
es: La variable <var>success</var> es 1 si la descarga se realiz&oacute; correctamente; de ​​lo contrario, es 0, en cuyo caso el <var>message</var> contiene un mensaje de error.
ru: Переменная <var>success</var> - 1, если загрузка прошла успешно, иначе - 0, и в этом случае <var>message</var> содержит сообщение об ошибке.
zh_cn: 如果下载成功，则变量 <var>success</var> 为1，否则为0，在这种情况下， <var>message</var> 包含错误消息。

source: The variable <var>x</var> must be a strictly monotonic vector (either increasing or decreasing) of length <var>n</var>.
es: La variable <var>x</var> debe ser un vector estrictamente mon&oacute;tono (creciente o decreciente) de longitud <var>n</var> .
ru: Переменная <var>x</var> должна быть строго монотонным вектором (возрастающим или убывающим) длины <var>n</var> .
zh_cn: 变量 <var>x</var> 必须是长度为 <var>n</var> 的严格单调矢量（递增或递减）。

source: The variable <var>x</var> must be a vector of length <var>n</var>.
es: La variable <var>x</var> debe ser un vector de longitud <var>n</var> .
ru: Переменная <var>x</var> должна быть вектором длины <var>n</var> .
zh_cn: 变量 <var>x</var> 必须是长度为 <var>n</var> 的向量。

source: The variable <var>y</var> must be in the interval [0,1], while <var>a</var> and <var>b</var> must be real and strictly positive.
es: La variable <var>y</var> debe estar en el intervalo [0,1], mientras que <var>a</var> y <var>b</var> debe ser real y estrictamente positivo.
ru: Переменная <var>y</var> должна быть в интервале [0,1], а <var>a</var> и <var>b</var> должны быть действительными и строго положительными.
zh_cn: 变量 <var>y</var> 必须在[0,1]区间内，而 <var>a</var> 和 <var>b</var> 必须是实数且严格为正。

source: The variables <var>x</var> and <var>y</var> define the vertex pairs, and must therefore have the same shape. They can be either vectors or arrays. If they are arrays then the columns of <var>x</var> and <var>y</var> are treated separately and an area returned for each.
es: Las variables <var>x</var> e <var>y</var> definir los pares de puntos, y por lo tanto deben tener la misma forma. Pueden ser vectores o matrices. Si son arrays entonces las columnas de <var>x</var> y <var>y</var> se tratan por separado y un &aacute;rea devuelto para cada uno.
ru: Переменные <var>x</var> и <var>y</var> определяют пары вершин и поэтому должны иметь одинаковую форму. Они могут быть векторами или массивами. Если это массивы, то столбцы <var>x</var> и <var>y</var> обрабатываются отдельно, и для каждого из них возвращается область.
zh_cn: 变量 <var>x</var> 和 <var>y</var> 定义了顶点对，因此必须具有相同的形状。它们可以是向量或数组。如果它们是数组，则将 <var>x</var> 和 <var>y</var> 的列分别处理，并分别返回一个区域。

source: The variance is defined as
es: La varianza se define como
ru: Разница определяется как
zh_cn: 差异定义为

source: The variant with no input and output argument is an alias for the function <code>OCTAVE_VERSION</code> provided for compatibility.
es: La variante sin argumento de entrada y salida es un alias para la funci&oacute;n <code>OCTAVE_VERSION</code> proporcionada por compatibilidad.
ru: Вариант без аргументов ввода и вывода - это псевдоним для функции <code>OCTAVE_VERSION</code> , предоставленный для совместимости.
zh_cn: 没有输入和输出参数的变量是为兼容性提供的函数 <code>OCTAVE_VERSION</code> 的别名。

source: The vector <var>C</var> specifies the color of each tetrahedron as an index into the current colormap. The default value is 1:m where m is the number of tetrahedrons; the indices are scaled to map to the full range of the colormap. If there are more tetrahedrons than colors in the colormap then the values in <var>C</var> are cyclically repeated.
es: El vector <var>C</var> especifica el color de cada tetraedro como &iacute;ndice en el mapa de colores actual. El valor predeterminado es 1: m donde m es el n&uacute;mero de tetraedros; los &iacute;ndices se escalan para mapear el rango completo del mapa de colores. Si hay m&aacute;s tetraedros que colores en el mapa de colores, los valores de <var>C</var> se repiten c&iacute;clicamente.
ru: Вектор <var>C</var> определяет цвет каждого тетраэдра в качестве индекса в текущей цветовой карте. Значение по умолчанию - 1: m, где m - количество тетраэдров; индексы масштабируются для отображения на весь диапазон цветовой карты. Если тетраэдров больше, чем цветов в палитре, то значения в <var>C</var> циклически повторяются.
zh_cn: 向量 <var>C</var> 将每个四面体的颜色指定为当前色图的索引。默认值为1：m，其中m是四面体的数量；索引被缩放以映射到颜色表的整个范围。如果四面体的数量多于颜色图中的颜色，则循环重复 <var>C</var> 中的值。

source: The vector <var>c</var> specifies the autocovariances <code>[gamma_0, &hellip;, gamma_t]</code> from lag 0 to <var>t</var>, <var>oldphi</var> specifies the coefficients based on <var>c</var>(<var>t</var>-1) and <var>oldv</var> specifies the corresponding error.
es: El vector <var>c</var> especifica las autocovarianzas <code>[gamma_0, &hellip;, gamma_t]</code> desde el retardo 0 hasta <var>t</var> , <var>oldphi</var> especifica los coeficientes basados ​​en <var>c</var> ( <var>t</var> -1) y <var>oldv</var> especifica el error correspondiente.
ru: Вектор <var>c</var> определяет автоковариации <code>[gamma_0, &hellip;, gamma_t]</code> от лага 0 до <var>t</var> , <var>oldphi</var> задает коэффициенты на основе <var>c</var> ( <var>t</var> -1), а <var>oldv</var> указывает соответствующую ошибку.
zh_cn: 向量 <var>c</var> 指定从滞后0到 <var>t</var> 的自协方差 <code>[gamma_0, &hellip;, gamma_t]</code> ， <var>oldphi</var> 指定基于 <var>c</var> （ <var>t</var> -1）的系数，而 <var>oldv</var> 指定相应的误差。

source: The vector <var>t</var> provides an upper limit on the length of the integration. If the stopping condition is met, the vector <var>t_out</var> will be shorter than <var>t</var>, and the final element of <var>t_out</var> will be the point at which the stopping condition was met, and may not correspond to any element of the vector <var>t</var>.
es: El vector <var>t</var> proporciona un l&iacute;mite superior en la longitud de la integraci&oacute;n. Si se cumple la condici&oacute;n de parada, el vector <var>t_out</var> ser&aacute; m&aacute;s corto que <var>t</var> , y el elemento final de <var>t_out</var> ser&aacute; el punto en el que se cumpli&oacute; la condici&oacute;n de parada, y puede que no corresponda a ning&uacute;n elemento del vector <var>t</var> .
ru: Вектор <var>t</var> обеспечивает верхний предел длины интегрирования. Если условие остановки выполнено, вектор <var>t_out</var> будет короче, чем <var>t</var> , и последний элемент <var>t_out</var> будет точкой, в которой было выполнено условие остановки, и может не соответствовать ни одному элементу вектора <var>t</var> .
zh_cn: 向量 <var>t</var> 提供积分长度的上限。如果满足停止条件，则向量 <var>t_out</var> 将小于 <var>t</var> ，并且 <var>t_out</var> 的最后元素将是满足停止条件的点，并且可能不对应于向量 <var>t</var> 的任何元素。

source: The vector argument specifying limits is optional, and additional string arguments may be used to specify various axis properties.
es: El argumento vectorial que especifica los límites es opcional,y se pueden utilizar argumentos de cadena adicionales para especificar varias propiedades del eje.
ru: Векторный аргумент,задающий ограничения,является необязательным,а дополнительные строковые аргументы могут быть использованы для задания различных свойств осей.
zh_cn: 指定限制的向量参数是可选的,附加的字符串参数可以用来指定各种轴属性。

source: The vector field is given by <code>[<var>u</var>, <var>v</var>, <var>w</var>]</code> and is defined over a rectangular grid given by <code>[<var>x</var>, <var>y</var>, <var>z</var>]</code>. The streamtubes start at the seed points <code>[<var>sx</var>, <var>sy</var>, <var>sz</var>]</code>.
zh_cn: 向量场由 <code>[<var>u</var>, <var>v</var>, <var>w</var>]</code> 给出，并在由 <code>[<var>x</var>, <var>y</var>, <var>z</var>]</code> 给出的矩形网格上定义。流管从种子点 <code>[<var>sx</var>, <var>sy</var>, <var>sz</var>]</code> 。

source: The vector specifies the coordinates (x0,y0) of the origin of the annotation object, its width, and its height. The width and height may be negative, depending on the orientation of the object.
es: El vector especifica las coordenadas (x0,y0)del origen del objeto de la anotación,su anchura y su altura.La anchura y la altura pueden ser negativas,dependiendo de la orientación del objeto.
ru: Вектор задает координаты (x0,y0)начала отсчета объекта аннотации,его ширину и высоту.Ширина и высота могут быть отрицательными,в зависимости от ориентации объекта.
zh_cn: 向量指定注释对象的原点坐标(x0,y0)、宽度和高度。根据对象的方向,宽度和高度可能为负值。

source: The version is first split into numeric and character portions and then the parts are padded to be the same length (i.e., <code>"1.1"</code> would be padded to be <code>"1.1.0"</code> when being compared with <code>"1.1.1"</code>, and separately, the character parts of the strings are padded with nulls).
es: La versi&oacute;n se divide primero en porciones num&eacute;ricas y de caracteres y luego las partes se rellenan para que tengan la misma longitud (es decir, <code>"1.1"</code> se rellenar&iacute;a para ser <code>"1.1.0"</code> cuando se compara con <code>"1.1.1"</code> , y por separado, las partes de caracteres de las cadenas se rellenan con nulos).
ru: Версия сначала разделяется на числовую и символьную части, а затем части дополняются, чтобы иметь одинаковую длину (т. Е. <code>"1.1"</code> будет дополнено до <code>"1.1.0"</code> при сравнении с <code>"1.1.1"</code> , и по отдельности, символьные части строк дополняются нулями).
zh_cn: 首先将版本分为数字部分和字符部分，然后将这些部分填充为相同的长度（即，与 <code>"1.1.1"</code> 进行比较时，会将 <code>"1.1"</code> 填充为 <code>"1.1.0"</code> &rdquo;），分别地，字符串的字符部分用null填充）。

source: The version of Octave. You can get this by noting the version number that is printed when Octave starts, or running it with the &lsquo;
es: La versi&oacute;n de Octave. Puede obtener esto anotando el n&uacute;mero de versi&oacute;n que se imprime cuando se inicia Octave, o ejecut&aacute;ndolo con el '
ru: Версия Octave. Вы можете получить это, указав номер версии, который печатается при запуске Octave, или запустив его с '
zh_cn: 八度的版本。您可以通过注意到Octave启动时打印的版本号或使用'

source: The versions listed below are the versions used for testing. If newer versions of these packages are available, you should try to use them, although there may be some differences.
es: Las versiones que se enumeran a continuación son las que se utilizan para las pruebas.Si hay disponibles versiones más recientes de estos paquetes,debería tratar de usarlas,aunque puede haber algunas diferencias.
ru: Перечисленные ниже версии являются версиями,используемыми для тестирования.Если доступны более новые версии этих пакетов,вы должны попытаться использовать их,хотя могут быть некоторые различия.
zh_cn: 下面列出的版本是用于测试的版本。如果这些软件包有较新的版本,你应该尝试使用它们,尽管可能会有一些差异。

source: The vertex normals <var>vn</var> are calculated from the gradient of the 3-dimensional array <var>val</var> (size: lxmxn) containing the data for an isosurface geometry. The normals point towards smaller values in <var>val</var>.
es: Las normales de v&eacute;rtice <var>vn</var> se calculan a partir del gradiente de la matriz tridimensional <var>val</var> (tama&ntilde;o: lxmxn) que contiene los datos para una geometr&iacute;a de isosuperficie. Las normales apuntan hacia valores menores en <var>val</var> .
ru: Нормали вершин <var>vn</var> вычисляются из градиента 3-мерного массива <var>val</var> (размер: lxmxn), содержащего данные для геометрии изоповерхности. Нормали указывают на меньшие значения в <var>val</var> .
zh_cn: 顶点法线 <var>vn</var> 是根据包含等值面几何数据的3维数组 <var>val</var> （大小：lxmxn）的梯度计算得出的。法线指向 <var>val</var> 中的较小值。

source: The waitbar is filled to fraction <var>frac</var> which must be in the range [0, 1].
es: La barra de espera se llena a una fracci&oacute;n <var>frac</var> que debe estar en el rango [0, 1].
ru: Полоса ожидания заполнена до фракции <var>frac</var> , которая должна быть в диапазоне [0, 1].
zh_cn: 等待条被填充至分数 <var>frac</var> ，分数必须在[0，1]范围内。

source: The warning for division by zero (and in fact all warnings) are disabled in the <code>unwinddemo</code> function.
es: La advertencia de divisi&oacute;n por cero (y de hecho todas las advertencias) est&aacute;n deshabilitadas en la funci&oacute;n de <code>unwinddemo</code> .
ru: Предупреждение о делении на ноль (и фактически все предупреждения) отключены в функции <code>unwinddemo</code> .
zh_cn: 在 <code>unwinddemo</code> 函数中禁用了除以零的警告（实际上是所有警告）。

source: The warning id <code>Octave:language-extension</code> can be enabled to warn about this usage. See <a href="issuing-warnings#XREFwarning_005fids">warning_ids</a>.
es: La identificaci&oacute;n de advertencia <code>Octave:language-extension</code> se puede habilitar para advertir sobre este uso. Consulte <a href="issuing-warnings#XREFwarning_005fids">warning_ids</a> .
ru: Идентификатор предупреждения <code>Octave:language-extension</code> может быть включен для предупреждения об этом использовании. См. <a href="issuing-warnings#XREFwarning_005fids">Warning_ids</a> .
zh_cn: 可以启用警告ID <code>Octave:language-extension</code> 来警告此用法。参见<a href="issuing-warnings#XREFwarning_005fids">warning_ids</a>。

source: The warning message may have multiple lines separated by newline characters ("\n"), or it may be a cellstr array with one element for each line.
es: El mensaje de advertencia puede tener múltiples líneas separadas por caracteres de nueva línea ("\n"),o puede ser un conjunto de celdas con un elemento por cada línea.
ru: Предупреждающее сообщение может содержать несколько строк,разделенных символами новой строки ("\n"),или это может быть массив клеток с одним элементом для каждой строки.
zh_cn: 警告信息可以有多行,用换行符("\n")隔开,也可以是一个单元格数组,每行一个元素。

source: The way to use a function is with a <em>function call</em> expression, which consists of the function name followed by a list of <em>arguments</em> in parentheses. The arguments are expressions which give the raw materials for the calculation that the function will do. When there is more than one argument, they are separated by commas. If there are no arguments, you can omit the parentheses, but it is a good idea to include them anyway, to clearly indicate that a function call was intended. Here are some examples:
es: La forma de utilizar una funci&oacute;n es con una expresi&oacute;n de <em>llamada de funci&oacute;n</em> , que consta del nombre de la funci&oacute;n seguido de una lista de <em>argumentos</em> entre par&eacute;ntesis. Los argumentos son expresiones que dan la materia prima para el c&aacute;lculo que har&aacute; la funci&oacute;n. Cuando hay m&aacute;s de un argumento, est&aacute;n separados por comas. Si no hay argumentos, puede omitir los par&eacute;ntesis, pero es una buena idea incluirlos de todos modos, para indicar claramente que se pretend&iacute;a realizar una llamada a la funci&oacute;n. Aqu&iacute; hay unos ejemplos:
ru: Способ использования функции - выражение <em>вызова функции</em> , которое состоит из имени функции, за которым следует список <em>аргументов</em> в круглых скобках. Аргументы - это выражения, которые дают исходный материал для вычислений, которые будет выполнять функция. Если аргументов больше одного, они разделяются запятыми. Если аргументов нет, вы можете опустить круглые скобки, но все равно будет неплохо включить их, чтобы четко указать, что был предназначен вызов функции. Вот некоторые примеры:
zh_cn: 使用函数的方法是使用<em>函数调用</em>表达式，该表达式由函数名称和括号中的<em>参数</em>列表组成。自变量是为函数提供计算所需原料的表达式。当有多个参数时，它们之间用逗号分隔。如果没有参数，则可以省略括号，但是无论如何都应将其包括在内，以明确表明打算进行函数调用。这里有些例子：

source: The while Statement
es: La declaración de While
ru: Заявление о допущениях
zh_cn: while语句

source: The width of the stem. (Default: 0.5)
es: El ancho del tallo.(Por defecto:0.5)
ru: Ширина стебля.(По умолчанию:0.5)
zh_cn: 阀杆的宽度。(默认值:0.5)

source: The wildcard characters <code>.</code>, <code>*</code>, and <code>?</code> are replaced with wildcards that are appropriate for a regular expression. For example:
es: Los caracteres comod&iacute;n <code>.</code> , <code>*</code> y <code>?</code> se reemplazan con comodines que son apropiados para una expresi&oacute;n regular. Por ejemplo:
ru: Подстановочные знаки <code>.</code> , <code>*</code> и <code>?</code> заменяются символами подстановки, подходящими для регулярного выражения. Например:
zh_cn: 通配符 <code>.</code> ， <code>*</code> 和 <code>?</code> 被适合于正则表达式的通配符替换。例如：

source: The window is truncated at the beginning and end of the array to exclude elements for which there is no source data. For example, with a window of length 3, <code><var>y</var>(1) = <var>fcn</var> (<var>x</var>(1:2))</code>, and <code><var>y</var>(end) = <var>fcn</var> (<var>x</var>(end-1:end))</code>.
es: La ventana se trunca al principio y al final de la matriz para excluir elementos para los que no hay datos de origen. Por ejemplo, con una ventana de longitud 3, <code><var>y</var>(1) = <var>fcn</var> (<var>x</var>(1:2))</code> e <code><var>y</var>(end) = <var>fcn</var> (<var>x</var>(end-1:end))</code> .
ru: Окно усекается в начале и в конце массива, чтобы исключить элементы, для которых нет исходных данных. Например, для окна длиной 3 <code><var>y</var>(1) = <var>fcn</var> (<var>x</var>(1:2))</code> и <code><var>y</var>(end) = <var>fcn</var> (<var>x</var>(end-1:end))</code> .
zh_cn: 该窗口在数组的开头和结尾处被截断，以排除没有源数据的元素。例如，对于一个长度为3的窗口， <code><var>y</var>(1) = <var>fcn</var> (<var>x</var>(1:2))</code> ，而 <code><var>y</var>(end) = <var>fcn</var> (<var>x</var>(end-1:end))</code> 。

source: The window is truncated at the beginning and end of the array to exclude elements for which there is no source data. For example, with a window of length 3, <code><var>y</var>(1) = mad (<var>x</var>(1:2))</code>, and <code><var>y</var>(end) = mad (<var>x</var>(end-1:end))</code>.
es: La ventana se trunca al principio y al final de la matriz para excluir elementos para los que no hay datos de origen. Por ejemplo, con una ventana de longitud 3, <code><var>y</var>(1) = mad (<var>x</var>(1:2))</code> e <code><var>y</var>(end) = mad (<var>x</var>(end-1:end))</code> .
ru: Окно усекается в начале и в конце массива, чтобы исключить элементы, для которых нет исходных данных. Например, с окном длиной 3 <code><var>y</var>(1) = mad (<var>x</var>(1:2))</code> и <code><var>y</var>(end) = mad (<var>x</var>(end-1:end))</code> .
zh_cn: 该窗口在数组的开头和结尾处被截断，以排除没有源数据的元素。例如，对于一个长度为3的窗口， <code><var>y</var>(1) = mad (<var>x</var>(1:2))</code> ，而 <code><var>y</var>(end) = mad (<var>x</var>(end-1:end))</code> 。
