Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/octave/octave.*.011.xlf
Languages: es, ja, ru, zh_cn

source: Be aware of lazy copies (copy-on-write). When a copy of an object is created, the data is not immediately copied, but rather shared. The actual copying is postponed until the copied data needs to be modified. For example:
es: Tengan cuidado con las copias perezosas (copy-on-write).Cuando se crea una copia de un objeto,los datos no se copian inmediatamente,sino que se comparten.La copia real se pospone hasta que los datos copiados deban ser modificados.Por ejemplo:
ja: 遅延コピー(コピーオンライト)に注意しましょう。オブジェクトのコピーが作成されると、データはすぐにコピーされるのではなく、共有されます。実際のコピーは、コピーされたデータを変更する必要があるまで延期されます。例えば、以下のようになります。
ru: Будьте в курсе ленивых копий (копия на запись).Когда создается копия объекта,данные не сразу копируются,а совместно используются.Фактическое копирование откладывается до тех пор,пока скопированные данные не потребуют изменения.Например:
zh_cn: 要注意懒惰复制(copy-on-write)。当创建一个对象的副本时,数据不会立即被复制,而是共享。实际的复制会被推迟到需要修改被复制的数据时再进行。比如说

source: Be precise about these changes&mdash;show a context diff for them.
es: Sea preciso acerca de estos cambios, muestre una diferencia de contexto para ellos.
ja: これらの変更について正確に説明してください。それらのコンテキストの違いを示してください。
ru: Будьте точны в этих изменениях - покажите для них контекстную разницу.
zh_cn: 请准确了解这些更改-为它们显示上下文差异。

source: Because <code>assert</code> is so frequently used alone in a test block, there is a shorthand form:
es: Dado que <code>assert</code> se usa con tanta frecuencia solo en un bloque de prueba, existe una forma abreviada:
ja: ため <code>assert</code> 頻繁試験ブロックに単独で使用される、簡略形があります。
ru: Поскольку <code>assert</code> так часто используется отдельно в тестовом блоке, существует сокращенная форма:
zh_cn: 因为 <code>assert</code> 在测试块中经常被单独使用，所以有一种简写形式：

source: Because compilation is a costly operation it does not make sense to employ JIT when the loop count is low. By default only loops with greater than 1000 iterations will be accelerated.
es: Debido a que la compilación es una operación costosa,no tiene sentido emplear JIT cuando el conteo de bucles es bajo.Por defecto,sólo se acelerarán los bucles con más de 1000 iteraciones.
ja: コンパイルはコストのかかる作業なので、ループ数が少ない場合はJITを採用する意味がありません。デフォルトでは、1000回以上の繰り返しを持つループのみが高速化されます。
ru: Поскольку компиляция является дорогостоящей операцией,нет смысла использовать JIT при низком количестве циклов.По умолчанию ускоряются только циклы с более чем 1000 итераций.
zh_cn: 因为编译是一项昂贵的操作,所以在循环次数较少时采用JIT是没有意义的。默认情况下,只有迭代次数超过1000次的循环才会被加速。

source: Because many other languages provide C or C++ APIs it is relatively simple to build bridges between Octave and other languages. This is also a way to bridge to hardware resources which often have device drivers written in C.
es: Debido a que muchos otros lenguajes proporcionan APIs en C o C++,es relativamente simple construir puentes entre Octave y otros lenguajes.Esta es también una manera de establecer un puente con los recursos de hardware que a menudo tienen controladores de dispositivos escritos en C.
ja: 他の多くの言語がCやC++のAPIを提供しているので,Octaveと他の言語との間のブリッジを構築するのは比較的簡単です。これは,しばしばCで書かれたデバイスドライバを持っているハードウェアリソースへのブリッジの方法でもあります。
ru: Поскольку многие другие языки предоставляют C или C++API,построить мосты между октавой и другими языками относительно просто.Это также способ моста к аппаратным ресурсам,в которых часто используются драйверы устройств,написанные на C.
zh_cn: 因为许多其他语言提供了C或C++API,所以在Octave和其他语言之间建立桥接相对简单。这也是连接硬件资源的一种方式,因为硬件资源通常有用C语言编写的设备驱动程序。

source: Because oct-files are compiled functions they open up the possibility of crashing Octave through careless function calls or memory faults. It is quite important that each and every function have a sufficient level of parameter checking to ensure that Octave behaves well.
es: Debido a que los archivos oct se compilan las funciones,abren la posibilidad de estrellarse Octava a través de llamadas de funciones descuidadas o fallos de memoria.Es muy importante que todas y cada una de las funciones tengan un nivel suficiente de comprobación de parámetros para asegurar que Octava se comporte bien.
ja: oct-fileはコンパイルされた関数なので,不注意な関数呼び出しやメモリ障害によってOctaveがクラッシュする可能性があります。各関数が,Octaveが正常に動作することを確実にするために,十分なレベルのパラメー タ検査を行うことが非常に重要です。
ru: Поскольку октавные файлы являются компилируемыми функциями,они открывают возможность падения октавы из-за небрежных вызовов функций или ошибок в памяти.Весьма важно,чтобы каждая функция имела достаточный уровень проверки параметров,чтобы убедиться,что Октава ведет себя хорошо.
zh_cn: 因为oct-files是编译过的函数,所以它们有可能因为粗心的函数调用或内存故障而导致Octave崩溃。每一个函数都要有足够的参数检查,以确保Octave表现良好,这一点非常重要。

source: Because there is a space after &lsquo;
es: Porque hay un espacio despu&eacute;s de '
ja: 後にスペースがあるので '
ru: Потому что после '
zh_cn: 因为&ldquo;

source: Because there may be output waiting to be displayed by the pager, it is a good idea to always call <code>fflush (stdout)</code> before calling <code>input</code>. This will ensure that all pending output is written to the screen before your prompt.
es: Debido a que puede haber una salida esperando a ser mostrada por el localizador, es una buena idea llamar siempre a <code>fflush (stdout)</code> antes de llamar a <code>input</code> . Esto asegurar&aacute; que todos los resultados pendientes se escriban en la pantalla antes de su solicitud.
ja: ページャーによって表示されるのを待っている出力があるかもしれないので、 <code>input</code> を呼び出す前に常に <code>fflush (stdout)</code> 呼び出すことは良い考えです。これにより、保留中のすべての出力がプロンプトの前に画面に書き込まれるようになります。
ru: Поскольку может быть вывод, ожидающий отображения пейджера, рекомендуется всегда вызывать <code>fflush (stdout)</code> перед вызовом <code>input</code> . Это гарантирует, что весь ожидающий вывод выводится на экран до вашего запроса.
zh_cn: 因为可能有等待寻呼机显示的输出，所以始终在调用 <code>input</code> 之前始终调用 <code>fflush (stdout)</code> 是一个好主意。这将确保所有未完成的输出在提示之前被写入屏幕。

source: Becker, R. A., Chambers, J. M. and Wilks, A. R. (1988) The New S Language. Wadsworth &amp; Brooks/Cole.
es: Becker, RA, Chambers, JM y Wilks, AR (1988) The New S Language. Wadsworth y Brooks / Cole.
ja: ベッカー、RA、チェンバーズ、JMおよびウィルクス、AR（1988）新しいS言語。Wadsworth＆Brooks / Cole。
ru: Беккер, Р. А., Чемберс, Дж. М. и Уилкс, А. Р. (1988) Новый язык S. Уодсворт и Брукс / Коул.
zh_cn: Becker，RA，Chambers，JM和Wilks，AR（1988）The New S Language。沃兹沃思和布鲁克斯/科尔。

source: Before computing the Fourier transform, one of the following windows is applied:
es: Antes de computar la transformación de Fourier,se aplica una de las siguientes ventanas:
ja: フーリエ変換を計算する前に、以下のいずれかのウィンドウを適用します。
ru: Перед вычислением преобразования Фурье применяется одно из следующих окон:
zh_cn: 在计算傅立叶变换之前,应用以下窗口之一。

source: Before going further, you should first determine if you really need to bother writing code outside of Octave.
es: Antes de seguir adelante,primero debes determinar si realmente necesitas molestarte en escribir el código fuera de la Octava.
ja: これ以上進む前に、まず、あなたが本当にOctave以外のコードをわざわざ書く必要があるかどうかを判断すべきです。
ru: Перед тем,как идти дальше,следует сначала определить,действительно ли вам нужно потрудиться с написанием кода за пределами Октавы.
zh_cn: 在进一步发展之前,你应该首先确定是否真的需要麻烦地在Octave之外编写代码。

source: Before you evaluate an expression you need to substitute the values of the variables used in the expression. These are stored in the symbol table. Whenever the interpreter starts a new function it saves the current symbol table and creates a new one, initializing it with the list of function parameters and a couple of predefined variables such as <code>nargin</code>. Expressions inside the function use the new symbol table.
es: Antes de evaluar una expresi&oacute;n, debe sustituir los valores de las variables utilizadas en la expresi&oacute;n. Estos se almacenan en la tabla de s&iacute;mbolos. Siempre que el int&eacute;rprete inicia una nueva funci&oacute;n, guarda la tabla de s&iacute;mbolos actual y crea una nueva, inicializ&aacute;ndola con la lista de par&aacute;metros de la funci&oacute;n y un par de variables predefinidas como <code>nargin</code> . Las expresiones dentro de la funci&oacute;n usan la nueva tabla de s&iacute;mbolos.
ja: 式を評価する前に、式で使用されている変数の値を置き換える必要があります。これらはシンボルテーブルに格納されます。インタープリターが新しい関数を開始するたびに、現在のシンボルテーブルを保存して新しいものを作成し、関数パラメーターのリストと <code>nargin</code> などのいくつかの定義済み変数で初期化します。関数内の式は新しいシンボルテーブルを使用します。
ru: Перед тем как оценивать выражение, вам необходимо подставить значения переменных, используемых в выражении. Они хранятся в таблице символов. Каждый раз, когда интерпретатор запускает новую функцию, он сохраняет текущую таблицу символов и создает новую, инициализируя ее списком параметров функции и парой предопределенных переменных, таких как <code>nargin</code> . Выражения внутри функции используют новую таблицу символов.
zh_cn: 在评估表达式之前，需要替换表达式中使用的变量的值。这些存储在符号表中。每当解释器启动新函数时，它将保存当前符号表并创建一个新符号表，并使用函数参数列表和几个预定义变量（如 <code>nargin</code> )对其进行初始化。函数内部的表达式使用新的符号表。

source: Begins a new line by printing the equivalent of a carriage return followed by a line feed.
es: Comienza una nueva línea imprimiendo el equivalente a un retorno de carro seguido de un avance de línea.
ja: キャリッジリターンに相当するものを印刷して改行を開始します。
ru: Начинает новую линию с печати эквивалента возврата каретки с последующей подачей линии.
zh_cn: 通过打印相当于回车和换行的方式开始一个新行。

source: Below is an example of creating a small sparse matrix using the first technique
es: A continuación se muestra un ejemplo de la creación de una pequeña matriz dispersa utilizando la primera técnica
ja: 以下に,最初の手法を用いて小さな疎な行列を作成する例を示します.
ru: Ниже приведен пример создания небольшой разреженной матрицы с использованием первой методики.
zh_cn: 下面是一个使用第一种技术创建小型稀疏矩阵的例子。

source: Below, we will give a short example of a profiler session. See <a href="profiling#Profiling">Profiling</a>, for the documentation of the profiler functions in detail. Consider the code:
es: A continuaci&oacute;n, daremos un breve ejemplo de una sesi&oacute;n de perfilador. Consulte <a href="profiling#Profiling">Creaci&oacute;n de perfiles</a> para obtener la documentaci&oacute;n detallada de las funciones del generador de perfiles. Considere el c&oacute;digo:
ja: 以下に、プロファイラーセッションの短い例を示します。プロファイラ関数の詳細については、<a href="profiling#Profiling">プロファイリングを</a>参照してください。コードを考えてみましょう：
ru: Ниже мы приведем небольшой пример сеанса профилировщика. Подробную документацию по функциям профилировщика см. В разделе <a href="profiling#Profiling">Профилирование</a> . Рассмотрим код:
zh_cn: 下面，我们将给出一个探查器会话的简短示例。有关探查器功能的详细文档，请参见<a href="profiling#Profiling">分析</a>。考虑以下代码：

source: Besides common arithmetic operations, several functions of two arguments also broadcast. The full list of functions and operators that broadcast is
es: Además de las operaciones aritméticas comunes,también se difunden varias funciones de dos argumentos.La lista completa de funciones y operadores que difunden es
ja: 一般的な算術演算の他に、2つの引数のいくつかの関数もブロードキャストします。ブロードキャストする関数と演算子の完全なリストは以下の通りです。
ru: Кроме обычных арифметических операций,также транслируются несколько функций двух аргументов.Полный список функций и операторов,которые транслируются,составляет
zh_cn: 除了常见的算术运算外,还有一些两个参数的函数也会广播。完整的广播函数和运算符列表是

source: Besides line properties, the arrowhead can be customized using <code>"headlength"</code>, <code>"headwidth"</code>, and <code>"headstyle"</code> properties. Supported values for <code>"headstyle"</code> property are: [<code>"diamond"</code> | <code>"ellipse"</code> | <code>"plain"</code> | <code>"rectangle"</code> | <code>"vback1"</code> | <code>"{vback2}"</code> | <code>"vback3"</code>]
es: Adem&aacute;s de las propiedades de l&iacute;nea, la punta de flecha se puede personalizar utilizando las <code>"headlength"</code> , <code>"headwidth"</code> y <code>"headstyle"</code> . Los valores admitidos para la propiedad <code>"headstyle"</code> son: [ <code>"diamond"</code> | <code>"ellipse"</code> | <code>"plain"</code> | <code>"rectangle"</code> | <code>"vback1"</code> | <code>"{vback2}"</code> | <code>"vback3"</code> ]
ja: 線のプロパティに加えて、 <code>"headlength"</code> 、 <code>"headwidth"</code> 、および <code>"headstyle"</code> プロパティを使用して矢印をカスタマイズできます。 <code>"headstyle"</code> プロパティでサポートされている値は次のとおりです：[ <code>"diamond"</code> | <code>"ellipse"</code> | <code>"plain"</code> | <code>"rectangle"</code> | <code>"vback1"</code> | <code>"{vback2}"</code> | <code>"vback3"</code> ]
ru: Помимо свойств линии, <code>"headlength"</code> можно настроить с помощью свойств &laquo;длина головы&raquo; , <code>"headwidth"</code> и <code>"headstyle"</code> . Поддерживаемые значения <code>"headstyle"</code> : [ <code>"diamond"</code> | <code>"ellipse"</code> | <code>"plain"</code> | <code>"rectangle"</code> | <code>"vback1"</code> | <code>"{vback2}"</code> | <code>"vback3"</code> ]
zh_cn: 此外线的特性，该箭头可使用定制的 <code>"headlength"</code> ， <code>"headwidth"</code> ，和 <code>"headstyle"</code> 属性。受支持的 <code>"headstyle"</code> 属性值为：[ <code>"diamond"</code> | <code>"ellipse"</code> | <code>"plain"</code> | <code>"rectangle"</code> | <code>"vback1"</code> | <code>"{vback2}"</code> | <code>"vback3"</code> ]

source: Besides special glyphs, the formatting of the text can be changed within the string by using the codes
es: Además de los glifos especiales,el formato del texto puede ser cambiado dentro de la cadena utilizando los códigos
ja: 特殊なグリフの他にも、文字列内ではコードを用いてテキストの書式を変更することができます。
ru: Кроме специальных глифов,форматирование текста внутри строки может быть изменено с помощью кодов
zh_cn: 除了特殊的字形,文本的格式也可以通过使用以下代码来改变字符串的格式

source: Besides the above mentioned files, a package can also contain one or more of the following directories:
es: Además de los archivos mencionados,un paquete también puede contener uno o más de los siguientes directorios:
ja: 上記のファイルの他に、パッケージには以下のディレクトリが含まれています。
ru: Помимо вышеперечисленных файлов,пакет может содержать один или несколько из следующих каталогов:
zh_cn: 除了以上提到的文件,一个软件包还可以包含以下一个或多个目录。

source: Besides the index operator <code>"."</code>, Octave can use dynamic naming <code>"(var)"</code> or the <code>struct</code> function to create structures. Dynamic naming uses the string value of a variable as the field name. For example:
es: Adem&aacute;s del operador de &iacute;ndice <code>"."</code> , Octave puede usar la denominaci&oacute;n din&aacute;mica <code>"(var)"</code> o la funci&oacute;n <code>struct</code> para crear estructuras. La denominaci&oacute;n din&aacute;mica utiliza el valor de cadena de una variable como nombre de campo. Por ejemplo:
ja: インデックス演算子 <code>"."</code> 加えて。、Octaveは動的命名 <code>"(var)"</code> または <code>struct</code> 関数を使用して構造を作成できます。動的命名では、変数の文字列値をフィールド名として使用します。例えば：
ru: Помимо оператора индекса <code>"."</code> Octave может использовать динамическое именование <code>"(var)"</code> или функцию <code>struct</code> для создания структур. В динамическом именовании в качестве имени поля используется строковое значение переменной. Например:
zh_cn: 除了索引运算符 <code>"."</code> ，Octave可以使用动态命名 <code>"(var)"</code> 或 <code>struct</code> 函数来创建结构。动态命名使用变量的字符串值作为字段名称。例如：

source: Besides the least-squares estimate matrix <var>x</var> (p-by-k), the function also returns <var>stdx</var> (p-by-k), the error standard deviation of estimated <var>x</var>; <var>mse</var> (k-by-1), the estimated data error covariance scale factors (<em>\sigma^2</em>); and <var>S</var> (p-by-p, or p-by-p-by-k if k &gt; 1), the error covariance of <var>x</var>.
es: Adem&aacute;s de la matriz de estimaci&oacute;n de m&iacute;nimos cuadrados <var>x</var> (p-by-k), la funci&oacute;n tambi&eacute;n devuelve <var>stdx</var> (p-by-k), la desviaci&oacute;n est&aacute;ndar del error de la estimaci&oacute;n <var>x</var> ; <var>mse</var> (k-por-1), los factores de escala de covarianza de error de datos estimados ( <em>\ sigma ^ 2</em> ); y <var>S</var> (p-por-p, o p-por-p-por-k si k&gt; 1), la covarianza del error de <var>x</var> .
ja: 最小二乗推定行列 <var>x</var> （p 行k 列）のほかに、関数は <var>stdx</var> （p行k 列）、推定 <var>x</var> の誤差標準偏差も返します。 <var>mse</var> （k行1 列）、推定データ誤差の共分散スケール係数（<em>\ sigma ^ 2</em>）; および <var>S</var> （P-によって-P、またはp行p行K K&gt; 1の場合）の誤差共分散 <var>x</var> 。
ru: Помимо матрицы оценок наименьших квадратов <var>x</var> (p-by-k), функция также возвращает <var>stdx</var> (p-by-k), стандартное отклонение ошибки оцененного <var>x</var> ; <var>mse</var> (k-by-1), оценочные масштабные коэффициенты ковариации ошибок данных ( <em>\ sigma ^ 2</em> ); и <var>S</var> (p-by-p или p-by-p-by-k, если k&gt; 1), ковариация ошибок <var>x</var> .
zh_cn: 除了最小二乘估计矩阵 <var>x</var> （p-by-k），该函数还返回 <var>stdx</var> （p-by-k），即估计 <var>x</var> 的误差标准偏差； <var>mse</var> （k-by-1），估计的数据误差协方差比例因子（<em>\ sigma ^ 2</em>）; 和 <var>S</var> （如果k&gt; 1，则逐个p或p逐个k），则 <var>x</var> 的误差协方差。

source: Besides the number of arguments, inputs can be checked for various properties. <code>validatestring</code> is used for string arguments and <code>validateattributes</code> for numeric arguments.
es: Adem&aacute;s del n&uacute;mero de argumentos, las entradas se pueden verificar para varias propiedades. <code>validatestring</code> se utiliza para argumentos de cadena y <code>validateattributes</code> para argumentos num&eacute;ricos.
ja: 引数の数に加えて、さまざまなプロパティの入力をチェックできます。 <code>validatestring</code> は文字列引数に使用され、 <code>validateattributes</code> は数値引数に使用されます。
ru: Помимо количества аргументов, входные данные можно проверить на предмет различных свойств. <code>validatestring</code> используется для строковых аргументов и <code>validateattributes</code> для числовых аргументов.
zh_cn: 除了参数数量之外，还可以检查输入的各种属性。 <code>validatestring</code> 用于字符串参数， <code>validateattributes</code> 用于数字参数。

source: Best local bound.
es: El mejor local.
ja: 最高のローカルバウンド。
ru: Лучшая местная привязка.
zh_cn: 最好的本地绑定。

source: Best projection heuristic.
es: La mejor proyección heurística.
ja: 最高の投影ヒューリスティック。
ru: Лучшая эвристика проекции.
zh_cn: 最佳预测启发式。

source: Beware of resorting to broadcasting if a simpler operation will suffice. For matrices <var>a</var> and <var>b</var>, consider the following:
es: Tenga cuidado con recurrir a la radiodifusi&oacute;n si basta con una operaci&oacute;n m&aacute;s sencilla. Para matrices <var>a</var> y <var>b</var> , considere lo siguiente:
ja: 簡単な操作で十分な場合は、ブロードキャストに頼らないように注意してください。行列 <var>a</var> および <var>b</var> については、以下を考慮してください。
ru: Остерегайтесь прибегать к трансляции, если будет достаточно более простой операции. Для матриц <var>a</var> и <var>b</var> рассмотрим следующее:
zh_cn: 如果简单的操作就足够了，请当心广播。对于矩阵 <var>a</var> 和 <var>b</var> ，请考虑以下因素：

source: Beyond speed and memory issues, there have been instances where some input matrices were not accurately decomposed by <code>gesdd</code>. See currently active bug <a href="https://savannah.gnu.org/bugs/?55564">https://savannah.gnu.org/bugs/?55564</a>. Until these accuracy issues are resolved in a new version of the <small>LAPACK</small> library, the default driver in Octave has been set to <code>"gesvd"</code>.
es: M&aacute;s all&aacute; de los problemas de velocidad y memoria, ha habido casos en los que <code>gesdd</code> no descompuso con precisi&oacute;n algunas matrices de entrada . Vea el error actualmente activo <a href="https://savannah.gnu.org/bugs/?55564">https://savannah.gnu.org/bugs/?55564</a> . Hasta que estos problemas de precisi&oacute;n se resuelvan en una nueva versi&oacute;n de la biblioteca <small>LAPACK</small> , el controlador predeterminado en Octave se ha establecido en <code>"gesvd"</code> .
ja: 速度とメモリの問題を超えて、一部の入力行列が <code>gesdd</code> によって正確に分解されない場合がありました。現在アクティブなバグ<a href="https://savannah.gnu.org/bugs/?55564">https://savannah.gnu.org/bugs/?55564を</a>参照してください。<small>LAPACK</small>ライブラリの新しいバージョンでこれらの精度の問題が解決されるまで、Octaveのデフォルトドライバーは <code>"gesvd"</code> に設定されています。
ru: Помимо проблем со скоростью и памятью, были случаи, когда некоторые входные матрицы не были точно разложены <code>gesdd</code> . См. Текущую активную ошибку <a href="https://savannah.gnu.org/bugs/?55564">https://savannah.gnu.org/bugs/?55564</a> . Пока эти проблемы с точностью не будут решены в новой версии библиотеки <small>LAPACK</small> , драйвер по умолчанию в Octave установлен на <code>"gesvd"</code> .
zh_cn: 除了速度和内存问题外，有些实例还没有通过 <code>gesdd</code> 准确地分解某些输入矩阵。请参阅当前活动的错误<a href="https://savannah.gnu.org/bugs/?55564">https://savannah.gnu.org/bugs/?55564</a>。在新版本的<small>LAPACK</small>库中解决这些准确性问题之前，Octave中的默认驱动程序已设置为 <code>"gesvd"</code> 。

source: Binary I/O
es: E/S binarias
ja: バイナリI/O
ru: Двоичный вход/выход
zh_cn: 二进制I/O

source: Binary Operators
es: Operadores binarios
ja: バイナリ演算子
ru: Двоичные операторы
zh_cn: 二进制运算符

source: Binary addition
es: Adición binaria
ja: バイナリ加算
ru: Двоичное добавление
zh_cn: 二进制加法

source: Binary subtraction
es: Sustracción binaria
ja: 二項減算
ru: двоичное вычитание
zh_cn: 二进制减法

source: Bit Manipulations
es: Manipulaciones de bits
ja: ビット操作
ru: Манипуляции битов
zh_cn: 位操作

source: Bits that are shifted out of either end of the value are lost. Octave also uses arithmetic shifts, where the sign bit of the value is kept during a right shift. For example:
es: Los trozos que se desplazan de cualquiera de los extremos del valor se pierden.Octava también utiliza desplazamientos aritméticos,donde el bit del signo del valor se mantiene durante un desplazamiento a la derecha.Por ejemplo:
ja: 値のどちらかの端からシフトされたビットは失われます。Octaveはまた、値の符号ビットが右シフト中も保持される算術シフトを使用します。例えば、次のようになります。
ru: Биты,сдвинутые с любого конца значения,теряются.Октава также использует арифметические сдвиги,при которых знаковый бит значения сохраняется при сдвиге вправо.Например:
zh_cn: 从值的两端移出的位会丢失。Octave也使用算术移位,在右移过程中,值的符号位被保留。例如

source: Block Comments
es: Bloquee los comentarios.
ja: ブロックコメント
ru: Блок Комментарии
zh_cn: 块评论

source: Block type summary:
es: Resumen del tipo de bloque:
ja: ブロックタイプのまとめ。
ru: Сводка по типу блока:
zh_cn: 块型汇总。

source: Bold font
es: Fuente en negrita
ja: 太字フォント
ru: жирный шрифт
zh_cn: 粗体字

source: Boolean Expressions
es: Expresiones booleanas
ja: ブール式
ru: булевы выражения
zh_cn: 布尔表达式

source: Boolean. <code>idx(i)</code> is a logical 1 or 0, indicating whether <code>y(i)</code> is contained in table or not.
es: Booleano. <code>idx(i)</code> es un 1 o 0 l&oacute;gico, que indica si <code>y(i)</code> est&aacute; contenido en la tabla o no.
ja: ブール。 <code>idx(i)</code> は論理値1または0で、 <code>y(i)</code> がテーブルに含まれているかどうかを示します。
ru: Boolean. <code>idx(i)</code> - это логическая 1 или 0, указывающая, содержится ли <code>y(i)</code> в таблице или нет.
zh_cn: 布尔值。 <code>idx(i)</code> 为逻辑1或0，指示 <code>y(i)</code> 是否包含在表中。

source: Both <small>GLPK</small> and Qhull use <code>int</code> internally so maximum problem sizes may be limited.
es: Tanto <small>GLPK</small> como Qhull utilizan <code>int</code> internamente, por lo que el tama&ntilde;o m&aacute;ximo de los problemas puede ser limitado.
ja: <small>GLPK</small>とQhullはどちらも内部で <code>int</code> を使用するため、問題の最大サイズが制限される場合があります。
ru: И <small>GLPK,</small> и Qhull используют <code>int</code> внутри, поэтому максимальный размер проблемы может быть ограничен.
zh_cn: <small>GLPK</small>和Qhull 都在内部使用 <code>int</code> ,因此最大问题大小可能会受到限制。

source: Both <var>dim</var> and <var>opt</var> are optional. If both are supplied, either may appear first.
es: Tanto <var>dim</var> como <var>opt</var> son opcionales. Si se proporcionan ambos, cualquiera puede aparecer primero.
ja: <var>dim</var> と <var>opt</var> はどちらもオプションです。両方が指定されている場合、どちらかが最初に表示されます。
ru: И <var>dim</var> , и <var>opt</var> не являются обязательными. Если поставляются оба, любой может появиться первым.
zh_cn: 无论 <var>dim</var> 和 <var>opt</var> 是可选的。如果两者都提供，则可能首先出现。
