Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/octave/octave.*.011.xlf
Languages: es, ja, ru, zh_cn

source: A prime number is conventionally defined as a positive integer greater than 1 (e.g., 2, 3, &hellip;) which is divisible only by itself and 1. Octave extends this definition to include both negative integers and complex values. A negative integer is prime if its positive counterpart is prime. This is equivalent to <code>isprime (abs (x))</code>.
es: Un n&uacute;mero primo se define convencionalmente como un n&uacute;mero entero positivo mayor que 1 (por ejemplo, 2, 3,&hellip;) que es divisible solo por s&iacute; mismo y 1. Octava extiende esta definici&oacute;n para incluir tanto n&uacute;meros enteros negativos como valores complejos. Un n&uacute;mero entero negativo es primo si su contraparte positiva es primo. Esto es equivalente a <code>isprime (abs (x))</code> .
ja: 素数は通常、1より大きい正の整数として定義されます（たとえば、2、3、&hellip;）。これは、それ自体と1でのみ割り切れることができます。Octaveは、この定義を拡張して、負の整数と複素数値の両方を含みます。正の対応物が素数である場合、負の整数は素数です。これは <code>isprime (abs (x))</code> と同等です。
ru: Простое число обычно определяется как положительное целое число больше 1 (например, 2, 3,&hellip;), которое делится только само на себя и 1. Octave расширяет это определение, включая отрицательные целые числа и комплексные значения. Отрицательное целое число является простым, если его положительное число является простым. Это эквивалентно <code>isprime (abs (x))</code> .
zh_cn: 素数通常定义为大于1（例如，2、3，...）的正整数，该整数只能被其自身和1整除。八度扩展此定义以包括负整数和复数值。如果负整数为正数，则为负数。这等效于 <code>isprime (abs (x))</code> 。

source: A radio property that can have the values <code>"on"</code> or <code>"off"</code> that flags whether the contours to plot are to be filled.
es: Una propiedad de radio que puede tener los valores <code>"on"</code> o <code>"off"</code> que marca si los contornos a trazar se deben rellenar.
ja: プロットするコンターを塗りつぶすかどうかを示す <code>"on"</code> または <code>"off"</code> の値を持つことができるラジオプロパティ。
ru: Свойство радио, которое может иметь значения <code>"on"</code> или <code>"off"</code> которое указывает, должны ли быть заполнены контуры для построения.
zh_cn: 可以具有值 <code>"on"</code> 或 <code>"off"</code> 的无线电属性，用于标记是否要填充要绘制的轮廓。

source: A rational approximation to a floating point number is a simple fraction with numerator <var>N</var> and denominator <var>D</var> such that <code><var>x</var> = <var>N</var>/<var>D</var></code>.
ja: 浮動小数点数の有理数近似は、分子 <var>N</var> と分母 <var>D</var> が <code><var>x</var> = <var>N</var>/<var>D</var></code> ある単純な分数です。
zh_cn: 理性近似浮点数是与分子的简单分数 <var>N</var> 和分母 <var>D</var> ，使得 <code><var>x</var> = <var>N</var>/<var>D</var></code> 。

source: A read only property that contains the data return by <code>contourc</code> used to create the contours of the plot.
es: Una propiedad de solo lectura que contiene los datos devueltos por <code>contourc</code> que se utilizan para crear los contornos del gr&aacute;fico.
ja: プロットの等高線を作成するために使用される <code>contourc</code> によって返されるデータを含む読み取り専用プロパティ。
ru: Свойство только для чтения, которое содержит данные, возвращаемые <code>contourc</code> , используемые для создания контуров графика.
zh_cn: 一个只读属性，其中包含用于创建绘图轮廓的 <code>contourc</code> 返回的数据。

source: A repeat instruction <var>R_j</var> must either be a scalar or a vector. If the instruction is a scalar then each component of <var>x</var> in dimension <var>j</var> is repeated <var>R_j</var> times. If the instruction is a vector then it must have the same number of elements as the corresponding dimension <var>j</var> of <var>x</var>. In this case, the <var>k</var>th component of dimension <var>j</var> is repeated <code><var>R_j</var>(<var>k</var>)</code> times.
es: Una instrucci&oacute;n repetida <var>R_j</var> debe ser un escalar o un vector. Si la instrucci&oacute;n es un escalar, entonces cada componente de <var>x</var> en la dimensi&oacute;n <var>j</var> se repite <var>R_j</var> veces. Si la instrucci&oacute;n es un vector, entonces debe tener el mismo n&uacute;mero de elementos que la dimensi&oacute;n correspondiente <var>j</var> de <var>x</var> . En este caso, el <var>k</var> - &eacute;simo componente de la dimensi&oacute;n <var>j</var> se repite <code><var>R_j</var>(<var>k</var>)</code> veces.
ja: 繰り返し命令 <var>R_j</var> は、スカラーまたはベクトルでなければなりません。命令がスカラーの場合、次元 <var>j</var> の <var>x</var> の各コンポーネントは <var>R_j</var> 回繰り返されます。命令がベクトルの場合、要素の数は <var>x</var> の対応する次元 <var>j</var> と同じでなければなりません。この場合、次元 <var>j</var> の <var>k</var> 番目の成分は <code><var>R_j</var>(<var>k</var>)</code> （ <var>k</var> ）回繰り返されます。
ru: Инструкция повторения <var>R_j</var> должна быть либо скаляром, либо вектором. Если инструкция является скаляром, то каждый компонент <var>x</var> в размерности <var>j</var> повторяется <var>R_j</var> раз. Если инструкция является вектором, то она должна иметь то же количество элементов, что и соответствующая размерность <var>j</var> для <var>x</var> . В этом случае <var>k</var> - я компонента размерности <var>j</var> повторяется <code><var>R_j</var>(<var>k</var>)</code> раз.
zh_cn: 重复指令 <var>R_j</var> 必须是标量或向量。如果指令是标量，则将维度 <var>j</var> 中 <var>x</var> 的每个分量重复 <var>R_j</var> 次。如果该指令是一个矢量，那么它必须具有相同数量的元件与相应的尺寸的 <var>j</var> 的 <var>x</var> 。在这种情况下，将维度 <var>j</var> 的第 <var>k</var> 个分量重复 <code><var>R_j</var>(<var>k</var>)</code> （ <var>k</var> ）次。

source: A row vector is a 2-D array for which <code>size (<var>x</var>)</code> returns <code>[1,&nbsp;N]</code> with non-negative N.
ja: 行ベクトルは、 <code>size (<var>x</var>)</code> が負でない <code>[1,&nbsp;N]</code> を返す2次元配列です。
zh_cn: 行向量是一个二维数组，其 <code>size (<var>x</var>)</code> 返回带有非负N的 <code>[1,&nbsp;N]</code> 。

source: A row vector that selects which dimensions of the calculation will appear in the output <var>y</var>. This is only useful when <var>fcn</var> returns an N-dimensional array in Format 1. The default is to return all output dimensions.
es: Un vector de fila que selecciona qu&eacute; dimensiones del c&aacute;lculo aparecer&aacute;n en la salida <var>y</var> . Esto solo es &uacute;til cuando <var>fcn</var> devuelve una matriz N-dimensional en Formato 1. El valor predeterminado es devolver todas las dimensiones de salida.
ja: 出力 <var>y</var> に表示される計算の次元を選択する行ベクトル。これは、 <var>fcn</var> がフォーマット1のN次元配列を返す場合にのみ役立ちます。デフォルトでは、すべての出力次元が返されます。
ru: Вектор-строка, который выбирает, какие измерения вычисления будут отображаться в выходных данных <var>y</var> . Это полезно только тогда, когда <var>fcn</var> возвращает N-мерный массив в формате 1. По умолчанию возвращаются все выходные размеры.
zh_cn: 选择输出的维数的行向量将出现在输出 <var>y</var> 中。仅当 <var>fcn</var> 以格式1返回N维数组时，此选项才有用。默认值是返回所有输出维。

source: A sample usage of <code>mysparse</code> is
es: Un ejemplo de uso de <code>mysparse</code> es
ja: <code>mysparse</code> の使用例は次のとおりです。
ru: Пример использования <code>mysparse</code> :
zh_cn: <code>mysparse</code> 的示例用法是

source: A scalar double property. <var>arg</var> contains the default value.
es: Una propiedad doble escalar. <var>arg</var> contiene el valor predeterminado.
ja: スカラーdoubleプロパティ。 <var>arg</var> にはデフォルト値が含まれています。
ru: Скалярное двойное свойство. <var>arg</var> содержит значение по умолчанию.
zh_cn: 标量double属性。 <var>arg</var> 包含默认值。

source: A scalar is an object with two dimensions for which <code>size (<var>x</var>)</code> returns <code>[1,&nbsp;1]</code>.
ja: スカラーは、 <code>size (<var>x</var>)</code> が <code>[1,&nbsp;1]</code> 返す2次元のオブジェクトです。
zh_cn: 标量是具有二维尺寸的对象， <code>size (<var>x</var>)</code> 返回 <code>[1,&nbsp;1]</code> 。

source: A script file also differs from a function file in that the variables named in a script file are not local variables, but are in the same scope as the other variables that are visible on the command line.
es: Un archivo de guión también se diferencia de un archivo de función en que las variables nombradas en un archivo de guión no son variables locales,sino que tienen el mismo alcance que las demás variables que son visibles en la línea de comandos.
ja: また、スクリプトファイルは関数ファイルとは異なり、スクリプトファイル内で名前が付けられた変数はローカル変数ではなく、コマンドライン上で表示される他の変数と同じスコープ内にあるという点でも異なります。
ru: Файл скрипта также отличается от файла функции тем,что переменные,названные в файле скрипта,не являются локальными переменными,а находятся в той же области видимости,что и другие переменные,видимые в командной строке.
zh_cn: 脚本文件也不同于函数文件,脚本文件中命名的变量不是局部变量,而是与命令行上可见的其他变量处于同一范围。

source: A script file is a file containing (almost) any sequence of Octave commands. It is read and evaluated just as if you had typed each command at the Octave prompt, and provides a convenient way to perform a sequence of commands that do not logically belong inside a function.
es: Un archivo de guión es un archivo que contiene (casi)cualquier secuencia de comandos de la Octava.Se lee y evalúa como si se hubiera escrito cada comando en la línea de comandos de la Octava,y proporciona una forma conveniente de realizar una secuencia de comandos que lógicamente no pertenecen a una función.
ja: スクリプトファイルは,Octaveコマンドの(ほぼ)任意のシーケンスを含むファイルです。これは,Octaveプロンプトで各コマンドを入力したかのように読み込まれ評価され,関数内に論理的に属さない一連のコマンドを実行するための便利な方法を提供します。
ru: Файл скрипта-это файл,содержащий (почти)любую последовательность команд Октавы.Он читается и оценивается так же,как если бы Вы набирали каждую команду в октавной строке,и обеспечивает удобный способ выполнения последовательности команд,которые логически не принадлежат внутри функции.
zh_cn: 脚本文件是一个包含(几乎)任何Octave命令序列的文件。它的读取和评估就像你在Octave提示符下键入每一条命令一样,它提供了一种方便的方式来执行一系列在逻辑上不属于一个函数的命令。

source: A second use of indexing is to speed up code. Indexing is a fast operation and judicious use of it can reduce the requirement for looping over individual array elements, which is a slow operation.
es: Un segundo uso de la indexación es para acelerar el código.La indexación es una operación rápida y su uso juicioso puede reducir la necesidad de hacer bucles sobre elementos individuales del conjunto,lo cual es una operación lenta.
ja: インデックスの2つ目の用途は、コードの高速化です。インデックス化は高速な操作であり、それを賢く使うことで、遅い操作である個々の配列要素をループさせる必要性を減らすことができます。
ru: Второе использование индексации-это ускорение кода.Индексация является быстрой операцией,и разумное ее использование может снизить требования к наведению шлейфа на отдельные элементы массива,что является медленной операцией.
zh_cn: 索引的第二个用途是加快代码速度。索引是一种快速的操作,明智地使用它可以减少对单个数组元素的循环要求,因为这是一种缓慢的操作。

source: A section is started by typing &lsquo;
es: Una secci&oacute;n se inicia escribiendo '
ja: セクションを開始するには、「
ru: Раздел начинается с ввода '
zh_cn: 输入&ldquo;

source: A section starting in the first line of the document, followed by another start of a section that might be empty, is interpreted as a document title and introduction text.
es: Una sección que comienza en la primera línea del documento,seguida de otro comienzo de una sección que podría estar vacía,se interpreta como un título del documento y un texto de introducción.
ja: 文書の最初の行で始まるセクションの後に、空になりそうなセクションの別の開始が続くと、文書のタイトルと紹介文として解釈されます。
ru: Раздел,начинающийся в первой строке документа,за которым следует другое начало раздела,который может быть пустым,интерпретируется как заголовок документа и вводный текст.
zh_cn: 以文档第一行开始的部分,后面可能是空的部分的另一个开始,被解释为文档标题和介绍文字。

source: A set of axes. This object is a child of a figure object and may be a parent of line, text, image, patch, surface, or light objects.
es: Un juego de hachas.Este objeto es hijo de un objeto figurativo y puede ser padre de objetos de línea,texto,imagen,parche,superficie o luz.
ja: 軸の集合。このオブジェクトは図形オブジェクトの子であり、線、テキスト、画像、パッチ、サーフェス、またはライトオブジェクトの親になることがあります。
ru: Набор осей.Этот объект является дочерним по отношению к объекту фигуры и может быть родителем линий,текста,изображения,патча,поверхности или светлых объектов.
zh_cn: 一组轴。此对象是图形对象的子对象,可以是线条、文字、图像、贴图、曲面或光对象的父对象。

source: A significant difference between <code>interpn</code> and the other two multi-dimensional interpolation functions is the fashion in which the dimensions are treated. For <code>interp2</code> and <code>interp3</code>, the y-axis is considered to be the columns of the matrix, whereas the x-axis corresponds to the rows of the array. As Octave indexes arrays in column major order, the first dimension of any array is the columns, and so <code>interpn</code> effectively reverses the &rsquo;x&rsquo; and &rsquo;y&rsquo; dimensions. Consider the example,
es: Una diferencia significativa entre <code>interpn</code> y las otras dos funciones de interpolaci&oacute;n multidimensionales es la forma en que se tratan las dimensiones. Para <code>interp2</code> e <code>interp3</code> , el eje y se considera las columnas de la matriz, mientras que el eje x corresponde a las filas de la matriz. Como Octave indexa matrices en orden de columna, la primera dimensi&oacute;n de cualquier matriz son las columnas, por lo que <code>interpn</code> invierte efectivamente las dimensiones 'x' e 'y'. Considere el ejemplo,
ja: <code>interpn</code> と他の2つの多次元補間関数の大きな違いは、次元の処理方法です。以下のために <code>interp2</code> と <code>interp3</code> を、y軸は、アレイの行へx軸対応一方、行列の列であると考えられます。Octaveは列をメジャー順に配列にインデックスを付けるので、配列の最初の次元は列なので、 <code>interpn</code> は「x」と「y」の次元を効果的に逆にします。例を考えてみましょう。
ru: Существенная разница между <code>interpn</code> и двумя другими функциями многомерной интерполяции заключается в способе обработки измерений. Для <code>interp2</code> и <code>interp3</code> ось y считается столбцами матрицы, тогда как ось x соответствует строкам массива. Поскольку Octave индексирует массивы в основном порядке столбцов, первое измерение любого массива - это столбцы, и поэтому <code>interpn</code> эффективно меняет размеры &laquo;x&raquo; и &laquo;y&raquo;. Рассмотрим пример,
zh_cn: <code>interpn</code> 和其他两个多维插值函数之间的显着区别是处理维的方式。对于 <code>interp2</code> 和 <code>interp3</code> ，将y轴视为矩阵的列，而x轴则对应于数组的行。由于Octave以列的主要顺序对数组进行索引，因此任何数组的第一维都是列，因此 <code>interpn</code> 有效地反转了&ldquo; x&rdquo;和&ldquo; y&rdquo;维。考虑这个例子，

source: A similar function <code>run</code> exists for calling user script files, that are not necessarily on the user path
es: Existe una <code>run</code> funci&oacute;n similar para llamar a archivos de script de usuario, que no est&aacute;n necesariamente en la ruta del usuario
ja: 同様の関数 <code>run</code> が、ユーザーパス上にあるとは限らない、ユーザースクリプトファイルを呼び出すために存在します。
ru: Аналогичный <code>run</code> функции существует для вызова файлов пользовательских сценариев, которые не обязательно находятся на пути пользователя.
zh_cn: 类似的功能 <code>run</code> 存在主叫用户脚本文件，这不一定是用户路径上

source: A simple example comes from chemistry and the need to obtain balanced chemical equations. Consider the burning of hydrogen and oxygen to produce water.
es: Un ejemplo sencillo viene de la química y de la necesidad de obtener ecuaciones químicas equilibradas.Consideremos la quema de hidrógeno y oxígeno para producir agua.
ja: 簡単な例は、化学から来ており、バランスのとれた化学式を得る必要があります。水素と酸素を燃やして水を作ることを考えてみましょう。
ru: Простой пример-химия и необходимость получения сбалансированных химических уравнений.Рассмотрим сжигание водорода и кислорода для получения воды.
zh_cn: 一个简单的例子来自于化学,需要获得平衡的化学方程式。考虑氢气和氧气燃烧产生水。

source: A simple example demonstrating the use of structures within oct-files is
es: Un ejemplo sencillo que demuestra el uso de estructuras dentro de los archivos oct.es
ja: オクトファイル内での構造体の使用を示す簡単な例は以下の通りです。
ru: Простой пример,демонстрирующий использование структур внутри осьминогенных файлов,-это
zh_cn: 以下是一个简单的例子,展示了八进制文件中结构的使用。

source: A simple way of preventing the above from happening is to create a temporary constant version of the sparse matrix. Note that only the container for the sparse matrix will be copied, while the actual representation of the data will be shared between the two versions of the sparse matrix; This is not a costly operation. The example above, re-written to prevent sparse-to-dense conversion, is
es: Una forma sencilla de evitar que ocurra lo anterior es crear una versión temporal constante de la matriz dispersa.Obsérvese que sólo se copiará el contenedor de la matriz dispersa,mientras que la representación real de los datos se compartirá entre las dos versiones de la matriz dispersa.El ejemplo anterior,reescrito para evitar la conversión de escasa a densa,es
ja: 上記のようなことが起こらないようにする簡単な方法は,疎な行列の一時的な定数バージョンを作成することです.疎な行列のコンテナだけがコピーされ,データの実際の表現は,2つのバージョンの疎な行列の間で共有されることに注意してください;これは,コストのかかる操作ではありません.上の例は,疎な行列から密な行列への変換を防ぐために書き直されたものです.
ru: Простой способ предотвратить это-создать временную постоянную версию разреженной матрицы.Обратите внимание,что будет скопирован только контейнер для разреженной матрицы,в то время как фактическое представление данных будет разделено между двумя версиями разреженной матрицы;это не является дорогостоящей операцией.Пример выше,переписанный для предотвращения преобразования разреженной матрицы в плотную,выглядит следующим образом
zh_cn: 防止上述情况发生的一个简单方法是创建一个临时的稀疏矩阵常量版本。请注意,只有稀疏矩阵的容器会被复制,而数据的实际表示将在两个版本的稀疏矩阵之间共享;这不是一个昂贵的操作。上面的例子,为了防止稀疏到稠密的转换,重新编写的是

source: A single dimension of the return matrix may be left unspecified and Octave will determine its size automatically. An empty matrix ([]) is used to flag the unspecified dimension.
es: Una sola dimensión de la matriz de retorno puede dejarse sin especificar y Octava determinará su tamaño automáticamente.Una matriz vacía ([])se utiliza para marcar la dimensión no especificada.
ja: 戻り行列の1次元は,指定されないままにしておくことができ,Octaveはそのサイズを自動的に決定します。空の行列([])は,指定されていない次元にフラグを立てるために使用されます。
ru: Одно измерение матрицы возврата может остаться неопределенным,а октава определит его размер автоматически.Пустая матрица ([])используется для пометки неуказанного измерения.
zh_cn: 返回矩阵的一个维度可以不指定,Octave将自动确定其大小。一个空矩阵([])用来标记未指定的维度。

source: A single dynamically linked file might define several functions. However, as Octave searches for functions based on the functions filename, Octave needs a manner in which to find each of the functions in the dynamically linked file. On operating systems that support symbolic links, it is possible to create a symbolic link to the original file for each of the functions which it contains.
es: Un solo archivo vinculado dinámicamente podría definir varias funciones.Sin embargo,como Octave busca funciones basadas en el nombre de archivo de las funciones,Octave necesita una forma de encontrar cada una de las funciones en el archivo vinculado dinámicamente.En los sistemas operativos que admiten enlaces simbólicos,es posible crear un enlace simbólico con el archivo original para cada una de las funciones que contiene.
ja: 単一の動的にリンクされたファイルは,いくつかの関数を定義しているかもしれません。しかし,Octaveが関数ファイル名に基づいて関数を検索するので,Octaveは,動的にリンクされたファイルの中の各関数を見つける方法を必要とします。シンボリックリンクをサポートするオペレーティングシステム上では,それが含む関数のそれぞれに対 して,元のファイルへのシンボリックリンクを作成することが可能です。
ru: Один динамически связанный файл может определять несколько функций.Однако,поскольку Октава ищет функции,основанные на имени файла функций,Октаве необходимо найти каждую из них в динамически связанном файле.На операционных системах,поддерживающих символические связи,можно создать символическую ссылку на исходный файл для каждой из функций,которые он содержит.
zh_cn: 一个动态链接的文件可能定义了多个函数,但Octave根据函数的文件名搜索函数,Octave需要找到动态链接文件中的每个函数。然而,由于Octave会根据函数文件名搜索函数,因此Octave需要一种方式来找到动态链接文件中的每个函数。在支持符号链接的操作系统上,可以为每一个包含函数的文件创建一个到原始文件的符号链接。

source: A single file extension <code>"*.ext"</code>
es: Una &uacute;nica extensi&oacute;n de archivo <code>"*.ext"</code>
ja: 単一のファイル拡張子 <code>"*.ext"</code>
ru: <code>"*.ext"</code> расширение файла "* .ext"
zh_cn: 单个文件扩展名 <code>"*.ext"</code>

source: A single file extension. Example: <code>uiputfile ("*.ext")</code>
es: Una sola extensi&oacute;n de archivo. Ejemplo: <code>uiputfile ("*.ext")</code>
ja: 単一のファイル拡張子。例： <code>uiputfile ("*.ext")</code>
ru: Единое расширение файла. Пример: <code>uiputfile ("*.ext")</code>
zh_cn: 单个文件扩展名。示例： <code>uiputfile ("*.ext")</code>

source: A single statement may not be enough of an example&mdash;the bug might depend on other details that are missing from the single statement where the error finally occurs.
es: Una sola declaraci&oacute;n puede no ser un ejemplo suficiente; el error puede depender de otros detalles que faltan en la declaraci&oacute;n &uacute;nica donde finalmente ocurre el error.
ja: 単一のステートメントでは十分な例ではない可能性があります。バグは、エラーが最終的に発生する単一のステートメントから欠落している他の詳細に依存している場合があります。
ru: Одного оператора может быть недостаточно для примера - ошибка может зависеть от других деталей, которые отсутствуют в единственном операторе, в котором, наконец, возникает ошибка.
zh_cn: 一个示例可能还不够，该错误可能取决于最终导致错误的单个语句中缺少的其他详细信息。

source: A slightly more complex example of <code>varargin</code> is a function <code>print_arguments</code> that prints all input arguments. Such a function can be defined like this
es: Un ejemplo un poco m&aacute;s complejo de <code>varargin</code> es una funci&oacute;n <code>print_arguments</code> que imprime todos los argumentos de entrada. Tal funci&oacute;n se puede definir as&iacute;
ja: <code>varargin</code> のもう少し複雑な例は、すべての入力引数を出力する関数 <code>print_arguments</code> です。このような関数は次のように定義できます
ru: Чуть более сложный пример <code>varargin</code> - это функция <code>print_arguments</code> , которая печатает все входные аргументы. Такую функцию можно определить так
zh_cn: <code>varargin</code> 的一个更复杂的示例是一个函数 <code>print_arguments</code> ，它打印所有输入参数。这样的功能可以这样定义

source: A sparse boolean matrix whose structure is that of the Cholesky factorization as determined by <var>typ</var>.
es: Una matriz booleana dispersa cuya estructura es la de la factorizaci&oacute;n de Cholesky determinada por el <var>typ</var> .
ja: <var>typ</var> によって決定されるコレスキー分解の構造を持つスパースブール行列。
ru: Разреженная логическая матрица, структура которой является структурой факторизации Холецкого, как определено <var>typ</var> .
zh_cn: 一个稀疏布尔矩阵，其结构是由 <var>typ</var> 确定的Cholesky分解。

source: A special case of broadcasting that may be familiar is when all dimensions of the array being broadcast are 1, i.e., the array is a scalar. Thus for example, operations like <code>x - 42</code> and <code>max (x, 2)</code> are basic examples of broadcasting.
es: Un caso especial de transmisi&oacute;n que puede resultar familiar es cuando todas las dimensiones de la matriz que se est&aacute; transmitiendo son 1, es decir, la matriz es un escalar. As&iacute;, por ejemplo, operaciones como <code>x - 42</code> y <code>max (x, 2)</code> son ejemplos b&aacute;sicos de transmisi&oacute;n.
ja: よく知られているブロードキャストの特殊なケースは、ブロードキャストされるアレイのすべての次元が1の場合、つまり、アレイがスカラーの場合です。したがって、たとえば、 <code>x - 42</code> や <code>max (x, 2)</code> などの操作は、ブロードキャストの基本的な例です。
ru: Частный случай широковещательной передачи, который может быть знаком, - это когда все измерения широковещательного массива равны 1, т. Е. Массив является скаляром. Так, например, такие операции, как <code>x - 42</code> и <code>max (x, 2)</code> являются основными примерами широковещательной передачи.
zh_cn: 可能熟悉的广播的一种特殊情况是，正在广播的数组的所有维数均为1时，即数组为标量。因此，例如， <code>x - 42</code> 和 <code>max (x, 2)</code> 是广播的基本示例。

source: A special form of the <code>for</code> statement allows you to loop over all the elements of a structure:
es: Una forma especial de la instrucci&oacute;n <code>for</code> le permite recorrer todos los elementos de una estructura:
ja: <code>for</code> ステートメントの特殊な形式を使用すると、構造のすべての要素をループできます。
ru: Специальная форма оператора <code>for</code> позволяет вам перебирать все элементы структуры:
zh_cn: <code>for</code> 语句的一种特殊形式允许您遍历结构的所有元素：
