Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/octave/octave.*.020.xlf
Languages: es, ru, zh_cn

source: The window is truncated at the beginning and end of the array to exclude elements for which there is no source data. For example, with a window of length 3, <code><var>y</var>(1) = max (<var>x</var>(1:2))</code>, and <code><var>y</var>(end) = max (<var>x</var>(end-1:end))</code>.
es: La ventana se trunca al principio y al final de la matriz para excluir elementos para los que no hay datos de origen. Por ejemplo, con una ventana de longitud 3, <code><var>y</var>(1) = max (<var>x</var>(1:2))</code> e <code><var>y</var>(end) = max (<var>x</var>(end-1:end))</code> .
ru: Окно усекается в начале и в конце массива, чтобы исключить элементы, для которых нет исходных данных. Например, с окном длиной 3 <code><var>y</var>(1) = max (<var>x</var>(1:2))</code> и <code><var>y</var>(end) = max (<var>x</var>(end-1:end))</code> .
zh_cn: 该窗口在数组的开头和结尾处被截断，以排除没有源数据的元素。例如，对于一个长度为3的窗口， <code><var>y</var>(1) = max (<var>x</var>(1:2))</code> ，而 <code><var>y</var>(end) = max (<var>x</var>(end-1:end))</code> 。

source: The window is truncated at the beginning and end of the array to exclude elements for which there is no source data. For example, with a window of length 3, <code><var>y</var>(1) = mean (<var>x</var>(1:2))</code>, and <code><var>y</var>(end) = mean (<var>x</var>(end-1:end))</code>.
es: La ventana se trunca al principio y al final de la matriz para excluir elementos para los que no hay datos de origen. Por ejemplo, con una ventana de longitud 3, <code><var>y</var>(1) = mean (<var>x</var>(1:2))</code> , e <code><var>y</var>(end) = mean (<var>x</var>(end-1:end))</code> .
ru: Окно усекается в начале и в конце массива, чтобы исключить элементы, для которых нет исходных данных. Например, с окном длиной 3 <code><var>y</var>(1) = mean (<var>x</var>(1:2))</code> и <code><var>y</var>(end) = mean (<var>x</var>(end-1:end))</code> .
zh_cn: 该窗口在数组的开头和结尾处被截断，以排除没有源数据的元素。例如，对于一个长度为3的窗口， <code><var>y</var>(1) = mean (<var>x</var>(1:2))</code> ，而 <code><var>y</var>(end) = mean (<var>x</var>(end-1:end))</code> 。

source: The window is truncated at the beginning and end of the array to exclude elements for which there is no source data. For example, with a window of length 3, <code><var>y</var>(1) = min (<var>x</var>(1:2))</code>, and <code><var>y</var>(end) = min (<var>x</var>(end-1:end))</code>.
es: La ventana se trunca al principio y al final de la matriz para excluir elementos para los que no hay datos de origen. Por ejemplo, con una ventana de longitud 3, <code><var>y</var>(1) = min (<var>x</var>(1:2))</code> e <code><var>y</var>(end) = min (<var>x</var>(end-1:end))</code> .
ru: Окно усекается в начале и в конце массива, чтобы исключить элементы, для которых нет исходных данных. Например, с окном длиной 3 <code><var>y</var>(1) = min (<var>x</var>(1:2))</code> , а <code><var>y</var>(end) = min (<var>x</var>(end-1:end))</code> .
zh_cn: 该窗口在数组的开头和结尾处被截断，以排除没有源数据的元素。例如，对于一个长度为3的窗口， <code><var>y</var>(1) = min (<var>x</var>(1:2))</code> ，而 <code><var>y</var>(end) = min (<var>x</var>(end-1:end))</code> 。

source: The window is truncated at the beginning and end of the array to exclude elements for which there is no source data. For example, with a window of length 3, <code><var>y</var>(1) = movmedian (<var>x</var>(1:2))</code>, and <code><var>y</var>(end) = movmedian (<var>x</var>(end-1:end))</code>.
es: La ventana se trunca al principio y al final de la matriz para excluir elementos para los que no hay datos de origen. Por ejemplo, con una ventana de longitud 3, <code><var>y</var>(1) = movmedian (<var>x</var>(1:2))</code> e <code><var>y</var>(end) = movmedian (<var>x</var>(end-1:end))</code> .
ru: Окно усекается в начале и в конце массива, чтобы исключить элементы, для которых нет исходных данных. Например, с окном длиной 3 <code><var>y</var>(1) = movmedian (<var>x</var>(1:2))</code> и <code><var>y</var>(end) = movmedian (<var>x</var>(end-1:end))</code> .
zh_cn: 该窗口在数组的开头和结尾处被截断，以排除没有源数据的元素。例如，对于一个长度为3的窗口， <code><var>y</var>(1) = movmedian (<var>x</var>(1:2))</code> ，而 <code><var>y</var>(end) = movmedian (<var>x</var>(end-1:end))</code> 。

source: The window is truncated at the beginning and end of the array to exclude elements for which there is no source data. For example, with a window of length 3, <code><var>y</var>(1) = movprod (<var>x</var>(1:2))</code>, and <code><var>y</var>(end) = movprod (<var>x</var>(end-1:end))</code>.
es: La ventana se trunca al principio y al final de la matriz para excluir elementos para los que no hay datos de origen. Por ejemplo, con una ventana de longitud 3, <code><var>y</var>(1) = movprod (<var>x</var>(1:2))</code> e <code><var>y</var>(end) = movprod (<var>x</var>(end-1:end))</code> .
ru: Окно усекается в начале и в конце массива, чтобы исключить элементы, для которых нет исходных данных. Например, с окном длиной 3 <code><var>y</var>(1) = movprod (<var>x</var>(1:2))</code> и <code><var>y</var>(end) = movprod (<var>x</var>(end-1:end))</code> .
zh_cn: 该窗口在数组的开头和结尾处被截断，以排除没有源数据的元素。例如，对于一个长度为3的窗口， <code><var>y</var>(1) = movprod (<var>x</var>(1:2))</code> ，而 <code><var>y</var>(end) = movprod (<var>x</var>(end-1:end))</code> 。

source: The window is truncated at the beginning and end of the array to exclude elements for which there is no source data. For example, with a window of length 3, <code><var>y</var>(1) = movstd (<var>x</var>(1:2))</code>, and <code><var>y</var>(end) = movstd (<var>x</var>(end-1:end))</code>.
es: La ventana se trunca al principio y al final de la matriz para excluir elementos para los que no hay datos de origen. Por ejemplo, con una ventana de longitud 3, <code><var>y</var>(1) = movstd (<var>x</var>(1:2))</code> e <code><var>y</var>(end) = movstd (<var>x</var>(end-1:end))</code> .
ru: Окно усекается в начале и в конце массива, чтобы исключить элементы, для которых нет исходных данных. Например, с окном длиной 3 <code><var>y</var>(1) = movstd (<var>x</var>(1:2))</code> и <code><var>y</var>(end) = movstd (<var>x</var>(end-1:end))</code> .
zh_cn: 该窗口在数组的开头和结尾处被截断，以排除没有源数据的元素。例如，对于一个长度为3的窗口， <code><var>y</var>(1) = movstd (<var>x</var>(1:2))</code> ，而 <code><var>y</var>(end) = movstd (<var>x</var>(end-1:end))</code> 。

source: The window is truncated at the beginning and end of the array to exclude elements for which there is no source data. For example, with a window of length 3, <code><var>y</var>(1) = movsum (<var>x</var>(1:2))</code>, and <code><var>y</var>(end) = movsum (<var>x</var>(end-1:end))</code>.
es: La ventana se trunca al principio y al final de la matriz para excluir elementos para los que no hay datos de origen. Por ejemplo, con una ventana de longitud 3, <code><var>y</var>(1) = movsum (<var>x</var>(1:2))</code> e <code><var>y</var>(end) = movsum (<var>x</var>(end-1:end))</code> .
ru: Окно усекается в начале и в конце массива, чтобы исключить элементы, для которых нет исходных данных. Например, с окном длиной 3 <code><var>y</var>(1) = movsum (<var>x</var>(1:2))</code> и <code><var>y</var>(end) = movsum (<var>x</var>(end-1:end))</code> .
zh_cn: 该窗口在数组的开头和结尾处被截断，以排除没有源数据的元素。例如，对于一个长度为3的窗口， <code><var>y</var>(1) = movsum (<var>x</var>(1:2))</code> ，而 <code><var>y</var>(end) = movsum (<var>x</var>(end-1:end))</code> 。

source: The window is truncated at the beginning and end of the array to exclude elements for which there is no source data. For example, with a window of length 3, <code><var>y</var>(1) = var (<var>x</var>(1:2))</code>, and <code><var>y</var>(end) = var (<var>x</var>(end-1:end))</code>.
es: La ventana se trunca al principio y al final de la matriz para excluir elementos para los que no hay datos de origen. Por ejemplo, con una ventana de longitud 3, <code><var>y</var>(1) = var (<var>x</var>(1:2))</code> e <code><var>y</var>(end) = var (<var>x</var>(end-1:end))</code> .
ru: Окно усекается в начале и в конце массива, чтобы исключить элементы, для которых нет исходных данных. Например, для окна длиной 3 <code><var>y</var>(1) = var (<var>x</var>(1:2))</code> и <code><var>y</var>(end) = var (<var>x</var>(end-1:end))</code> .
zh_cn: 该窗口在数组的开头和结尾处被截断，以排除没有源数据的元素。例如，对于一个长度为3的窗口， <code><var>y</var>(1) = var (<var>x</var>(1:2))</code> ，而 <code><var>y</var>(end) = var (<var>x</var>(end-1:end))</code> 。

source: The window is wrapped so that any missing data elements are taken from the other side of the data. For example, with a window of length 3, <code><var>y</var>(1) = <var>fcn</var> ([<var>x</var>(end), <var>x</var>(1:2)])</code>, and <code><var>y</var>(end) = <var>fcn</var> ([<var>x</var>(end-1:end), <var>x</var>(1)])</code>.
es: La ventana se ajusta para que los elementos de datos faltantes se tomen del otro lado de los datos. Por ejemplo, con una ventana de longitud 3, <code><var>y</var>(1) = <var>fcn</var> ([<var>x</var>(end), <var>x</var>(1:2)])</code> e <code><var>y</var>(end) = <var>fcn</var> ([<var>x</var>(end-1:end), <var>x</var>(1)])</code> .
ru: Окно оборачивается так, что любые недостающие элементы данных берутся с другой стороны данных. Например, при длине окна 3 <code><var>y</var>(1) = <var>fcn</var> ([<var>x</var>(end), <var>x</var>(1:2)])</code> и <code><var>y</var>(end) = <var>fcn</var> ([<var>x</var>(end-1:end), <var>x</var>(1)])</code> .
zh_cn: 对该窗口进行了包装，以便从数据的另一侧获取所有丢失的数据元素。例如，对于一个长度为3的窗口， <code><var>y</var>(1) = <var>fcn</var> ([<var>x</var>(end), <var>x</var>(1:2)])</code> ，而 <code><var>y</var>(end) = <var>fcn</var> ([<var>x</var>(end-1:end), <var>x</var>(1)])</code> 。

source: The window is wrapped so that any missing data elements are taken from the other side of the data. For example, with a window of length 3, <code><var>y</var>(1) = mad ([<var>x</var>(end), <var>x</var>(1:2)])</code>, and <code><var>y</var>(end) = mad ([<var>x</var>(end-1:end), <var>x</var>(1)])</code>.
es: La ventana se ajusta para que los elementos de datos faltantes se tomen del otro lado de los datos. Por ejemplo, con una ventana de longitud 3, <code><var>y</var>(1) = mad ([<var>x</var>(end), <var>x</var>(1:2)])</code> e <code><var>y</var>(end) = mad ([<var>x</var>(end-1:end), <var>x</var>(1)])</code> .
ru: Окно оборачивается так, что любые недостающие элементы данных берутся с другой стороны данных. Например, с окном длиной 3 <code><var>y</var>(1) = mad ([<var>x</var>(end), <var>x</var>(1:2)])</code> и <code><var>y</var>(end) = mad ([<var>x</var>(end-1:end), <var>x</var>(1)])</code> .
zh_cn: 对该窗口进行了包装，以便从数据的另一侧获取所有丢失的数据元素。例如，对于一个长度为3的窗口， <code><var>y</var>(1) = mad ([<var>x</var>(end), <var>x</var>(1:2)])</code> ，而 <code><var>y</var>(end) = mad ([<var>x</var>(end-1:end), <var>x</var>(1)])</code> 。

source: The window is wrapped so that any missing data elements are taken from the other side of the data. For example, with a window of length 3, <code><var>y</var>(1) = max ([<var>x</var>(end), <var>x</var>(1:2)])</code>, and <code><var>y</var>(end) = max ([<var>x</var>(end-1:end), <var>x</var>(1)])</code>.
es: La ventana se ajusta para que los elementos de datos faltantes se tomen del otro lado de los datos. Por ejemplo, con una ventana de longitud 3, <code><var>y</var>(1) = max ([<var>x</var>(end), <var>x</var>(1:2)])</code> e <code><var>y</var>(end) = max ([<var>x</var>(end-1:end), <var>x</var>(1)])</code> .
ru: Окно оборачивается так, что любые недостающие элементы данных берутся с другой стороны данных. Например, с окном длиной 3 <code><var>y</var>(1) = max ([<var>x</var>(end), <var>x</var>(1:2)])</code> и <code><var>y</var>(end) = max ([<var>x</var>(end-1:end), <var>x</var>(1)])</code> .
zh_cn: 对该窗口进行了包装，以便从数据的另一侧获取所有丢失的数据元素。例如，对于一个长度为3的窗口， <code><var>y</var>(1) = max ([<var>x</var>(end), <var>x</var>(1:2)])</code> ，而 <code><var>y</var>(end) = max ([<var>x</var>(end-1:end), <var>x</var>(1)])</code> 。

source: The window is wrapped so that any missing data elements are taken from the other side of the data. For example, with a window of length 3, <code><var>y</var>(1) = mean ([<var>x</var>(end), <var>x</var>(1:2)])</code>, and <code><var>y</var>(end) = mean ([<var>x</var>(end-1:end), <var>x</var>(1)])</code>.
es: La ventana se ajusta para que los elementos de datos faltantes se tomen del otro lado de los datos. Por ejemplo, con una ventana de longitud 3, <code><var>y</var>(1) = mean ([<var>x</var>(end), <var>x</var>(1:2)])</code> , y <code><var>y</var>(end) = mean ([<var>x</var>(end-1:end), <var>x</var>(1)])</code> .
ru: Окно оборачивается так, что любые недостающие элементы данных берутся с другой стороны данных. Например, для окна длиной 3 <code><var>y</var>(1) = mean ([<var>x</var>(end), <var>x</var>(1:2)])</code> и <code><var>y</var>(end) = mean ([<var>x</var>(end-1:end), <var>x</var>(1)])</code> .
zh_cn: 对该窗口进行了包装，以便从数据的另一侧获取所有丢失的数据元素。例如，对于一个长度为3的窗口， <code><var>y</var>(1) = mean ([<var>x</var>(end), <var>x</var>(1:2)])</code> ，而 <code><var>y</var>(end) = mean ([<var>x</var>(end-1:end), <var>x</var>(1)])</code> 。

source: The window is wrapped so that any missing data elements are taken from the other side of the data. For example, with a window of length 3, <code><var>y</var>(1) = min ([<var>x</var>(end), <var>x</var>(1:2)])</code>, and <code><var>y</var>(end) = min ([<var>x</var>(end-1:end), <var>x</var>(1)])</code>.
es: La ventana se ajusta para que los elementos de datos faltantes se tomen del otro lado de los datos. Por ejemplo, con una ventana de longitud 3, <code><var>y</var>(1) = min ([<var>x</var>(end), <var>x</var>(1:2)])</code> e <code><var>y</var>(end) = min ([<var>x</var>(end-1:end), <var>x</var>(1)])</code> .
ru: Окно оборачивается так, что любые недостающие элементы данных берутся с другой стороны данных. Например, с окном длиной 3 <code><var>y</var>(1) = min ([<var>x</var>(end), <var>x</var>(1:2)])</code> и <code><var>y</var>(end) = min ([<var>x</var>(end-1:end), <var>x</var>(1)])</code> .
zh_cn: 对该窗口进行了包装，以便从数据的另一侧获取所有丢失的数据元素。例如，对于一个长度为3的窗口， <code><var>y</var>(1) = min ([<var>x</var>(end), <var>x</var>(1:2)])</code> ，而 <code><var>y</var>(end) = min ([<var>x</var>(end-1:end), <var>x</var>(1)])</code> 。

source: The window is wrapped so that any missing data elements are taken from the other side of the data. For example, with a window of length 3, <code><var>y</var>(1) = movmedian ([<var>x</var>(end), <var>x</var>(1:2)])</code>, and <code><var>y</var>(end) = movmedian ([<var>x</var>(end-1:end), <var>x</var>(1)])</code>.
es: La ventana se ajusta para que los elementos de datos faltantes se tomen del otro lado de los datos. Por ejemplo, con una ventana de longitud 3, <code><var>y</var>(1) = movmedian ([<var>x</var>(end), <var>x</var>(1:2)])</code> , y <code><var>y</var>(end) = movmedian ([<var>x</var>(end-1:end), <var>x</var>(1)])</code> .
ru: Окно оборачивается так, что любые недостающие элементы данных берутся с другой стороны данных. Например, с окном длиной 3 <code><var>y</var>(1) = movmedian ([<var>x</var>(end), <var>x</var>(1:2)])</code> и <code><var>y</var>(end) = movmedian ([<var>x</var>(end-1:end), <var>x</var>(1)])</code> .
zh_cn: 对该窗口进行了包装，以便从数据的另一侧获取所有丢失的数据元素。例如，对于一个长度为3的窗口， <code><var>y</var>(1) = movmedian ([<var>x</var>(end), <var>x</var>(1:2)])</code> ，而 <code><var>y</var>(end) = movmedian ([<var>x</var>(end-1:end), <var>x</var>(1)])</code> 。

source: The window is wrapped so that any missing data elements are taken from the other side of the data. For example, with a window of length 3, <code><var>y</var>(1) = movprod ([<var>x</var>(end), <var>x</var>(1:2)])</code>, and <code><var>y</var>(end) = movprod ([<var>x</var>(end-1:end), <var>x</var>(1)])</code>.
es: La ventana se ajusta para que los elementos de datos faltantes se tomen del otro lado de los datos. Por ejemplo, con una ventana de longitud 3, <code><var>y</var>(1) = movprod ([<var>x</var>(end), <var>x</var>(1:2)])</code> e <code><var>y</var>(end) = movprod ([<var>x</var>(end-1:end), <var>x</var>(1)])</code> .
ru: Окно оборачивается так, что любые недостающие элементы данных берутся с другой стороны данных. Например, с окном длиной 3 <code><var>y</var>(1) = movprod ([<var>x</var>(end), <var>x</var>(1:2)])</code> и <code><var>y</var>(end) = movprod ([<var>x</var>(end-1:end), <var>x</var>(1)])</code> .
zh_cn: 对该窗口进行了包装，以便从数据的另一侧获取所有丢失的数据元素。例如，对于一个长度为3的窗口， <code><var>y</var>(1) = movprod ([<var>x</var>(end), <var>x</var>(1:2)])</code> 和 <code><var>y</var>(end) = movprod ([<var>x</var>(end-1:end), <var>x</var>(1)])</code> 。

source: The window is wrapped so that any missing data elements are taken from the other side of the data. For example, with a window of length 3, <code><var>y</var>(1) = movstd ([<var>x</var>(end), <var>x</var>(1:2)])</code>, and <code><var>y</var>(end) = movstd ([<var>x</var>(end-1:end), <var>x</var>(1)])</code>.
es: La ventana se ajusta para que los elementos de datos faltantes se tomen del otro lado de los datos. Por ejemplo, con una ventana de longitud 3, <code><var>y</var>(1) = movstd ([<var>x</var>(end), <var>x</var>(1:2)])</code> e <code><var>y</var>(end) = movstd ([<var>x</var>(end-1:end), <var>x</var>(1)])</code> .
ru: Окно оборачивается так, что любые недостающие элементы данных берутся с другой стороны данных. Например, с окном длиной 3 <code><var>y</var>(1) = movstd ([<var>x</var>(end), <var>x</var>(1:2)])</code> и <code><var>y</var>(end) = movstd ([<var>x</var>(end-1:end), <var>x</var>(1)])</code> .
zh_cn: 对该窗口进行了包装，以便从数据的另一侧获取所有丢失的数据元素。例如，对于一个长度为3的窗口， <code><var>y</var>(1) = movstd ([<var>x</var>(end), <var>x</var>(1:2)])</code> ，而 <code><var>y</var>(end) = movstd ([<var>x</var>(end-1:end), <var>x</var>(1)])</code> 。

source: The window is wrapped so that any missing data elements are taken from the other side of the data. For example, with a window of length 3, <code><var>y</var>(1) = movsum ([<var>x</var>(end), <var>x</var>(1:2)])</code>, and <code><var>y</var>(end) = movsum ([<var>x</var>(end-1:end), <var>x</var>(1)])</code>.
es: La ventana se ajusta para que los elementos de datos faltantes se tomen del otro lado de los datos. Por ejemplo, con una ventana de longitud 3, <code><var>y</var>(1) = movsum ([<var>x</var>(end), <var>x</var>(1:2)])</code> e <code><var>y</var>(end) = movsum ([<var>x</var>(end-1:end), <var>x</var>(1)])</code> .
ru: Окно оборачивается так, что любые недостающие элементы данных берутся с другой стороны данных. Например, с окном длиной 3 <code><var>y</var>(1) = movsum ([<var>x</var>(end), <var>x</var>(1:2)])</code> и <code><var>y</var>(end) = movsum ([<var>x</var>(end-1:end), <var>x</var>(1)])</code> .
zh_cn: 对该窗口进行了包装，以便从数据的另一侧获取所有丢失的数据元素。例如，对于一个长度为3的窗口， <code><var>y</var>(1) = movsum ([<var>x</var>(end), <var>x</var>(1:2)])</code> ，而 <code><var>y</var>(end) = movsum ([<var>x</var>(end-1:end), <var>x</var>(1)])</code> 。

source: The window is wrapped so that any missing data elements are taken from the other side of the data. For example, with a window of length 3, <code><var>y</var>(1) = var ([<var>x</var>(end), <var>x</var>(1:2)])</code>, and <code><var>y</var>(end) = var ([<var>x</var>(end-1:end), <var>x</var>(1)])</code>.
es: La ventana se ajusta para que los elementos de datos faltantes se tomen del otro lado de los datos. Por ejemplo, con una ventana de longitud 3, <code><var>y</var>(1) = var ([<var>x</var>(end), <var>x</var>(1:2)])</code> e <code><var>y</var>(end) = var ([<var>x</var>(end-1:end), <var>x</var>(1)])</code> .
ru: Окно оборачивается так, что любые недостающие элементы данных берутся с другой стороны данных. Например, с окном длиной 3 <code><var>y</var>(1) = var ([<var>x</var>(end), <var>x</var>(1:2)])</code> и <code><var>y</var>(end) = var ([<var>x</var>(end-1:end), <var>x</var>(1)])</code> .
zh_cn: 对该窗口进行了包装，以便从数据的另一侧获取所有丢失的数据元素。例如，对于一个长度为3的窗口， <code><var>y</var>(1) = var ([<var>x</var>(end), <var>x</var>(1:2)])</code> ，而 <code><var>y</var>(end) = var ([<var>x</var>(end-1:end), <var>x</var>(1)])</code> 。

source: The window name, e.g., <code>"triangle"</code> or <code>"rectangle"</code> is used to search for a function called <code><var>win</var>_lw</code>.
es: El nombre de la ventana, por ejemplo, <code>"triangle"</code> o <code>"rectangle"</code> se utiliza para buscar una funci&oacute;n llamada <code><var>win</var>_lw</code> .
ru: Имя окна, например, <code>"triangle"</code> или <code>"rectangle"</code> , используется для поиска функции с именем <code><var>win</var>_lw</code> .
zh_cn: 窗口名称（例如 <code>"triangle"</code> 或 <code>"rectangle"</code> ）用于搜索称为 <code><var>win</var>_lw</code> 的函数。

source: The window name, e.g., <code>"triangle"</code> or <code>"rectangle"</code> is used to search for a function called <code><var>win</var>_sw</code>.
es: El nombre de la ventana, por ejemplo, <code>"triangle"</code> o <code>"rectangle"</code> se utiliza para buscar una funci&oacute;n llamada <code><var>win</var>_sw</code> .
ru: Имя окна, например, <code>"triangle"</code> или <code>"rectangle"</code> , используется для поиска функции с именем <code><var>win</var>_sw</code> .
zh_cn: 窗口名称（例如 <code>"triangle"</code> 或 <code>"rectangle"</code> ）用于搜索称为 <code><var>win</var>_sw</code> 的函数。

source: The window names can be passed as strings or by the <var>win_type</var> number.
es: Los nombres de las ventanas se pueden pasar como cadenas o por el n&uacute;mero <var>win_type</var> .
ru: Имена окон могут передаваться как строки или по <var>win_type</var> .
zh_cn: 窗口名称可以作为字符串或通过 <var>win_type</var> 数字传递。

source: The window style of a figure. One of the following values:
es: El estilo de la ventana de una figura.Uno de los siguientes valores:
ru: Окно в стиле фигуры.Одно из следующих значений:
zh_cn: 图的窗口样式。以下数值之一:

source: The wireframe mesh is plotted using rectangles. The vertices of the rectangles [<var>x</var>, <var>y</var>] are typically the output of <code>meshgrid</code>. over a 2-D rectangular region in the x-y plane. <var>z</var> determines the height above the plane of each vertex. If only a single <var>z</var> matrix is given, then it is plotted over the meshgrid <code><var>x</var> = 1:columns (<var>z</var>), <var>y</var> = 1:rows (<var>z</var>)</code>. Thus, columns of <var>z</var> correspond to different <var>x</var> values and rows of <var>z</var> correspond to different <var>y</var> values.
es: La malla de alambre se traza usando rect&aacute;ngulos. Los v&eacute;rtices de los rect&aacute;ngulos [ <var>x</var> , <var>y</var> ] suelen ser la salida de <code>meshgrid</code> . sobre una regi&oacute;n rectangular 2-D en el plano xy. <var>z</var> determina la altura sobre el plano de cada v&eacute;rtice. Si solo se proporciona una &uacute;nica matriz <var>z</var> , entonces se traza sobre la cuadr&iacute;cula de malla <code><var>x</var> = 1:columns (<var>z</var>), <var>y</var> = 1:rows (<var>z</var>)</code> . Por tanto, las columnas de <var>z</var> corresponden a diferentes valores de <var>x</var> y las filas de <var>z</var> corresponden a diferentes valores de <var>y</var> .
ru: Каркасная сетка строится с использованием прямоугольников. Вершины прямоугольников [ <var>x</var> , <var>y</var> ] обычно являются выходными <code>meshgrid</code> . над двумерной прямоугольной областью в плоскости xy. <var>z</var> определяет высоту над плоскостью каждой вершины. Если задана только одна <var>z</var> - матрица, то она строится по сетке <code><var>x</var> = 1:columns (<var>z</var>), <var>y</var> = 1:rows (<var>z</var>)</code> . Таким образом, столбцы <var>z</var> соответствуют разным значениям <var>x</var> , а строки <var>z</var> соответствуют разным значениям <var>y</var> .
zh_cn: 使用矩形绘制线框网格。矩形[ <var>x</var> ， <var>y</var> ] 的顶点通常是 <code>meshgrid</code> 的输出。在xy平面的二维矩形区域上。 <var>z</var> 确定每个顶点平面上方的高度。如果仅给出单个 <var>z</var> 矩阵，则将其绘制在网格 <code><var>x</var> = 1:columns (<var>z</var>), <var>y</var> = 1:rows (<var>z</var>)</code> 。因此， <var>z</var> 的列对应于不同的 <var>x</var> 值， <var>z</var> 的行对应于不同的 <var>y</var> 值。
