Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/octave/octave.*.020.xlf
Languages: es, ru, zh_cn

source: Type <code>demo tetramesh</code> to see examples on using <code>tetramesh</code>.
es: Escriba <code>demo tetramesh</code> para ver ejemplos sobre el uso de <code>tetramesh</code> .
ru: Введите <code>demo tetramesh</code> , чтобы увидеть примеры использования <code>tetramesh</code> .
zh_cn: 键入 <code>demo tetramesh</code> 以查看有关使用 <code>tetramesh</code> 的示例。

source: Type of factorization.
es: Tipo de factorización.
ru: Тип факторизации.
zh_cn: 因式化的类型。

source: Type of the function.
es: Tipo de la función.
ru: Тип функции.
zh_cn: 职能的类型。

source: Typecast a hexadecimal character array or cell array of strings to an array of numbers.
es: Tipifica una matriz de caracteres hexadecimales o una matriz de celdas de cuerdas a una matriz de números.
ru: Типизируется шестнадцатеричный символьный массив или массив ячеек строк в массив чисел.
zh_cn: 将十六进制字符数组或字符串单元格数组打入数字数组。

source: Typically only the magnitude data <var>y</var> is present in which case <var>x</var> is taken to be the range <code>1 : length (<var>y</var>)</code>. If <var>x</var> is given it may be a string array, a cell array of strings, or a numerical vector.
es: Normalmente, solo est&aacute;n presentes los datos de magnitud <var>y</var> , en cuyo caso <var>x</var> se toma como el rango <code>1 : length (<var>y</var>)</code> . Si se da <var>x</var> , puede ser una matriz de cadenas, una matriz de cadenas de celdas o un vector num&eacute;rico.
ru: Обычно присутствуют только данные величины <var>y</var> , и в этом случае <var>x</var> принимается равным диапазону <code>1 : length (<var>y</var>)</code> . Если задан <var>x</var> , это может быть массив строк, массив ячеек строк или числовой вектор.
zh_cn: 通常，仅存在大小数据 <var>y</var> ，在这种情况下， <var>x</var> 的取值范围为 <code>1 : length (<var>y</var>)</code> 。如果给出 <var>x</var> ,则它可以是字符串数组，字符串的单元格数组或数值向量。

source: Typing in a function at the command prompt.
es: Escribiendo una función en la línea de comandos.
ru: Ввод функции в командной строке.
zh_cn: 在命令提示符下输入一个函数。

source: UI Elements
es: Elementos de la UI
ru: элементы интерфейса
zh_cn: UI元素

source: URL Manipulation
es: Manipulación de URL
ru: Манипуляция URL-адресами
zh_cn: URL操作

source: Uibuttongroup Properties
es: Propiedades del Uibuttongroup
ru: Свойства Уибуттонгрупп
zh_cn: 优步集团物业

source: Uicontextmenu Properties
es: Propiedades de Uicontextmenu
ru: Уикотекстменю Свойства
zh_cn: Uicontextmenu属性

source: Uicontextmenu properties are documented at <a href="uicontextmenu-properties#Uicontextmenu-Properties">Uicontextmenu Properties</a>.
es: Las propiedades de Uicontextmenu est&aacute;n documentadas en <a href="uicontextmenu-properties#Uicontextmenu-Properties">Propiedades de Uicontextmenu</a> .
ru: Свойства Uicontextmenu задокументированы в <a href="uicontextmenu-properties#Uicontextmenu-Properties">разделе Свойства Uicontextmenu</a> .
zh_cn: Uicontextmenu属性记录在<a href="uicontextmenu-properties#Uicontextmenu-Properties">Uicontextmenu属性中</a>。

source: Uicontrol Properties
es: Propiedades de Uicontrol
ru: Свойства Уиконтроля
zh_cn: Uicontrol属性

source: Uipanel Properties
es: Propiedades de Uipanel
ru: Свойства бипанелей
zh_cn: Uipanel地产

source: Uipanel properties are documented at <a href="uipanel-properties#Uipanel-Properties">Uipanel Properties</a>.
es: Las propiedades de Uipanel est&aacute;n documentadas en <a href="uipanel-properties#Uipanel-Properties">Propiedades de Uipanel</a> .
ru: Свойства Uipanel задокументированы в <a href="uipanel-properties#Uipanel-Properties">свойствах Uipanel</a> .
zh_cn: Uipanel属性记录在<a href="uipanel-properties#Uipanel-Properties">Uipanel Properties中</a>。

source: Uipushtool Properties
es: Propiedades de Uipushtool
ru: Свойства дипуштука
zh_cn: Uipushtool属性

source: Uipushtool properties are documented at <a href="uipushtool-properties#Uipushtool-Properties">Uipushtool Properties</a>.
es: Las propiedades de Uipushtool est&aacute;n documentadas en <a href="uipushtool-properties#Uipushtool-Properties">Uipushtool Properties</a> .
ru: Свойства Uipushtool задокументированы в <a href="uipushtool-properties#Uipushtool-Properties">Uipushtool Properties</a> .
zh_cn: Uipushtool属性记录在<a href="uipushtool-properties#Uipushtool-Properties">Uipushtool属性中</a>。

source: Uitable Properties
es: Propiedades útiles
ru: Подходящая недвижимость
zh_cn: 可利用的属性

source: Uitoggletool Properties
es: Propiedades de Uitoggletool
ru: Уитоглетол Свойства
zh_cn: Uitoggletool属性

source: Uitoggletool properties are documented at <a href="uitoggletool-properties#Uitoggletool-Properties">Uitoggletool Properties</a>.
es: Las propiedades de Uitoggletool est&aacute;n documentadas en <a href="uitoggletool-properties#Uitoggletool-Properties">Uitoggletool Properties</a> .
ru: Свойства Uitoggletool описаны в <a href="uitoggletool-properties#Uitoggletool-Properties">разделе &laquo;Свойства Uitoggletool&raquo;</a> .
zh_cn: Uitoggletool属性记录在<a href="uitoggletool-properties#Uitoggletool-Properties">Uitoggletool属性中</a>。

source: Uitoolbar Properties
ru: Уитолбар Свойства
zh_cn: Uitoolbar属性

source: Uitoolbar properties are documented at <a href="uitoolbar-properties#Uitoolbar-Properties">Uitoolbar Properties</a>.
es: Las propiedades de Uitoolbar est&aacute;n documentadas en <a href="uitoolbar-properties#Uitoolbar-Properties">Propiedades de Uitoolbar</a> .
ru: Свойства Uitoolbar задокументированы в <a href="uitoolbar-properties#Uitoolbar-Properties">свойствах Uitoolbar</a> .
zh_cn: Uitoolbar属性记录在<a href="uitoolbar-properties#Uitoolbar-Properties">Uitoolbar属性</a>。

source: Unary addition
es: Adición unitaria
ru: Унарное дополнение
zh_cn: 单数加法

source: Unary plus. This operator has no effect on the operand.
es: Unary plus.Este operador no tiene ningún efecto sobre el operando.
ru: Унарный плюс.Этот оператор не влияет на операнд.
zh_cn: 一元加号。这个操作数对操作数没有影响。

source: Unary subtraction
es: Sustracción unitaria
ru: Унарное вычитание
zh_cn: 单元减法

source: Under some circumstances, <code>subplot</code> might not be able to identify axes that it could re-use and might replace them. If <code>subplot</code> axes should be referenced repeatedly, consider creating and storing their axes handles beforehand instead of calling <code>subplot</code> repeatedly for the same position.
zh_cn: 在某些情况下， <code>subplot</code> 可能无法识别可重复使用的轴并可能会替换它们。如果应该重复引用 <code>subplot</code> 图轴，请考虑事先创建并存储其轴句柄，而不是针对同一位置重复调用 <code>subplot</code> 。

source: Under the null, LM approximately has a chisquare distribution with <var>p</var> degrees of freedom and <var>pval</var> is the <em>p</em>-value (1 minus the CDF of this distribution at LM) of the test.
es: Bajo el valor nulo, LM aproximadamente tiene una distribuci&oacute;n chi cuadrado con <var>p</var> grados de libertad y <var>pval</var> es el valor <em>p</em> (1 menos el CDF de esta distribuci&oacute;n en LM) de la prueba.
ru: При нулевом значении LM приблизительно имеет chisquare-распределение с <var>p</var> степенями свободы, а <var>pval</var> - это <em>p</em> -значение (1 минус CDF этого распределения на LM) теста.
zh_cn: 在零值下，LM近似具有 <var>p</var> 自由度的卡方分布， <var>pval</var> 是测试的<em>p</em>值（1减去LM处此分布的CDF）。

source: Undo all changes made to this line. This is like typing the &lsquo;undo&rsquo; command enough times to get back to the beginning.
es: Deshaga todos los cambios realizados en esta l&iacute;nea. Esto es como escribir el comando 'deshacer' suficientes veces para volver al principio.
ru: Отменить все изменения, внесенные в эту строку. Это похоже на набор команды &laquo;отменить&raquo; достаточное количество раз, чтобы вернуться к началу.
zh_cn: 撤消对此行所做的所有更改。这就像键入&ldquo; undo&rdquo;命令足够多次以回到开始一样。

source: Undo the action of the <code>fftshift</code> function.
es: <code>fftshift</code> la acci&oacute;n de la funci&oacute;n fftshift .
ru: Отмените действие функции <code>fftshift</code> .
zh_cn: 撤消 <code>fftshift</code> 功能的操作。

source: Undo the last action. You can undo all the way back to an empty line.
es: Deshaz la última acción.Puedes deshacer todo el camino de vuelta a una línea vacía.
ru: Отменить последнее действие.Ты можешь отменить все,что у тебя есть,до пустой строчки.
zh_cn: 撤销上一个操作。你可以一直撤销到空行。

source: Undocumented output
es: Salida indocumentada
ru: Недокументированный выход
zh_cn: 未记录的产出

source: Uniform Distribution
es: Distribución uniforme
ru: Равномерное распределение
zh_cn: 统一分配

source: Uniform Distribution (integers)
es: Distribución uniforme (números enteros)
ru: Равномерное распределение (целые числа)
zh_cn: 均匀分布(整数)

source: Uninstall named packages. For example,
es: Desinstalar los paquetes con nombre.Por ejemplo,
ru: Удалить именованные пакеты.Например,
zh_cn: 卸载命名的软件包。例如:

source: Units of image resolution. Value is <code>"Inch"</code>, <code>"Centimeter"</code>, or <code>"undefined"</code>.
es: Unidades de resoluci&oacute;n de imagen. El valor es <code>"Inch"</code> , <code>"Centimeter"</code> o <code>"undefined"</code> .
ru: Единицы разрешения изображения. Значение - <code>"Inch"</code> , <code>"Centimeter"</code> или <code>"undefined"</code> .
zh_cn: 图像分辨率的单位。值是 <code>"Inch"</code> ， <code>"Centimeter"</code> 或 <code>"undefined"</code> 。

source: Units used to interpret the <code>"fontsize"</code> property.
es: Unidades utilizadas para interpretar la propiedad <code>"fontsize"</code> .
ru: Единицы, используемые для интерпретации <code>"fontsize"</code> .
zh_cn: 用于解释 <code>"fontsize"</code> 属性的单位。

source: Units used to interpret the <code>"position"</code>, <code>"outerposition"</code>, and <code>"tightinset"</code> properties.
es: Unidades utilizadas para interpretar las propiedades de <code>"position"</code> , <code>"outerposition"</code> y <code>"tightinset"</code> .
ru: Единицы измерения, используемые для интерпретации свойств <code>"position"</code> , <code>"outerposition"</code> и <code>"tightinset"</code> .
zh_cn: 用于解释 <code>"position"</code> ， <code>"outerposition"</code> 位置&rdquo;和 <code>"tightinset"</code> 属性的单位。

source: Units used to interpret the <code>"position"</code>, property.
zh_cn: 用于解释 <code>"position"</code> 属性的单位。

source: Univariate Discrete Distribution
es: Distribución discreta univariante
ru: Одномерное дискретное распределение
zh_cn: 单变量离散分布

source: Unix-style man pages describing Octave.
es: Páginas de hombre al estilo de Unix describiendo a Octava.
ru: Мужские страницы в стиле Unix,описывающие Октаву.
zh_cn: 描述Octave的Unix风格的手册页。

source: Unless otherwise noted, all of the functions described in this chapter will work for real and complex scalar, vector, or matrix arguments. Functions described as <em>mapping functions</em> apply the given operation individually to each element when given a matrix argument. For example:
es: A menos que se indique lo contrario, todas las funciones descritas en este cap&iacute;tulo funcionar&aacute;n para argumentos escalares, vectoriales o matriciales reales y complejos. Las funciones descritas como <em>funciones de mapeo</em> aplican la operaci&oacute;n dada individualmente a cada elemento cuando se les da un argumento de matriz. Por ejemplo:
ru: Если не указано иное, все функции, описанные в этой главе, будут работать для вещественных и комплексных скалярных, векторных или матричных аргументов. Функции, описанные как <em>функции отображения,</em> применяют данную операцию индивидуально к каждому элементу, если задан аргумент матрицы. Например:
zh_cn: 除非另有说明，否则本章介绍的所有功能都将适用于实数和复数标量，向量或矩阵参数。当给定矩阵参数时，描述为<em>映射函数的函数</em>将给定操作分别应用于每个元素。例如：

source: Unless you specify &lsquo;
es: A menos que especifique '
ru: Если вы не укажете
zh_cn: 除非您指定&ldquo;

source: Unlike <code><var>x</var>^(1/3)</code>, the result will be negative if <var>x</var> is negative.
es: A diferencia de <code><var>x</var>^(1/3)</code> , el resultado ser&aacute; negativo si <var>x</var> es negativo.
ru: В отличие от <code><var>x</var>^(1/3)</code> , результат будет отрицательным, если <var>x</var> отрицателен.
zh_cn: 与 <code><var>x</var>^(1/3)</code> ，如果 <var>x</var> 为负，则结果将为负。

source: Unlike a function file, a script file must <em>not</em> begin with the keyword <code>function</code>. If it does, Octave will assume that it is a function file, and that it defines a single function that should be evaluated as soon as it is defined.
es: A diferencia de un archivo de funci&oacute;n, un archivo de script <em>no</em> debe comenzar con la palabra clave <code>function</code> . Si lo hace, Octave asumir&aacute; que es un archivo de funci&oacute;n y que define una sola funci&oacute;n que debe evaluarse tan pronto como se defina.
ru: В отличие от файла функции, файл сценария <em>не</em> должен начинаться с ключевого слова <code>function</code> . Если это так, Octave будет считать, что это файл функции и что он определяет одну функцию, которая должна быть оценена, как только она будет определена.
zh_cn: 与功能文件不同，脚本文件<em>不能</em>以关键字 <code>function</code> 开头。如果是这样，Octave将假定它是一个功能文件，并且它定义了一个应在定义后立即求值的功能。

source: Unlike many other computer languages, Octave allows you to define functions that return more than one value. The syntax for defining functions that return multiple values is
es: A diferencia de muchos otros lenguajes de computación,Octava permite definir funciones que devuelven más de un valor.La sintaxis para definir funciones que devuelven múltiples valores es
ru: В отличие от многих других компьютерных языков,Октава позволяет определить функции,возвращающие более одного значения.Синтаксис для определения функций,возвращающих несколько значений,следующий
zh_cn: 与其他许多计算机语言不同,Octave允许您定义返回多个值的函数。定义返回多个值的函数的语法为

source: Unlike most languages, functions in Octave may return multiple values. For example, the following statement
es: A diferencia de la mayoría de los idiomas,las funciones en Octava pueden devolver múltiples valores.Por ejemplo,la siguiente declaración
ru: В отличие от большинства языков,функции в Октаве могут возвращать несколько значений.Например,следующее утверждение
zh_cn: 与大多数语言不同,Octave中的函数可以返回多个值。例如,下面的语句

source: Unlike most programming languages, complex numeric constants are denoted as the sum of real and imaginary parts. The imaginary part is denoted by a real-valued numeric constant followed immediately by a complex value indicator (&lsquo;
es: A diferencia de la mayor&iacute;a de los lenguajes de programaci&oacute;n, las constantes num&eacute;ricas complejas se denotan como la suma de partes reales e imaginarias. La parte imaginaria se denota mediante una constante num&eacute;rica de valor real seguida inmediatamente por un indicador de valor complejo ('
ru: В отличие от большинства языков программирования, сложные числовые константы обозначаются как сумма действительной и мнимой частей. Мнимая часть обозначается числовой константой с действительным знаком, за которой сразу следует индикатор комплексного значения ('
zh_cn: 与大多数编程语言不同，复杂的数字常量表示为实部和虚部的总和。虚部用实数值常量表示，后跟复数值指示符（&ldquo;

source: Unlike the <code>return</code> statement in C, Octave&rsquo;s <code>return</code> statement cannot be used to return a value from a function. Instead, you must assign values to the list of return variables that are part of the <code>function</code> statement. The <code>return</code> statement simply makes it easier to exit a function from a deeply nested loop or conditional statement.
es: A diferencia de la declaraci&oacute;n <code>return</code> en C, la declaraci&oacute;n <code>return</code> de Octave no se puede utilizar para devolver un valor de una funci&oacute;n. En su lugar, debe asignar valores a la lista de variables de retorno que forman parte de la declaraci&oacute;n de <code>function</code> . La declaraci&oacute;n <code>return</code> simplemente facilita la salida de una funci&oacute;n de un bucle profundamente anidado o declaraci&oacute;n condicional.
ru: В отличие от оператора <code>return</code> в C, оператор <code>return</code> Octave не может использоваться для возврата значения из функции. Вместо этого вы должны присвоить значения списку возвращаемых переменных, которые являются частью оператора <code>function</code> . Оператор <code>return</code> просто упрощает выход из функции из глубоко вложенного цикла или условного оператора.
zh_cn: 与C语言中的 <code>return</code> 语句不同，Octave的 <code>return</code> 语句不能用于从函数返回值。而是必须将值分配给 <code>function</code> 语句一部分的返回变量列表。在 <code>return</code> 语句只是可以更容易地从一个深度嵌套的循环或条件语句退出功能。

source: Unlike the C library function, which requires you to provide a suitably sized string as an argument, Octave&rsquo;s <code>sprintf</code> function returns the string, automatically sized to hold all of the items converted.
es: A diferencia de la funci&oacute;n de la biblioteca de C, que requiere que proporciones una cadena de tama&ntilde;o adecuado como argumento, la funci&oacute;n <code>sprintf</code> de Octave devuelve la cadena, autom&aacute;ticamente dimensionada para contener todos los elementos convertidos.
ru: В отличие от библиотечной функции C, которая требует, чтобы вы предоставили строку подходящего размера в качестве аргумента, функция Octave <code>sprintf</code> возвращает строку с автоматическим размером, чтобы содержать все преобразованные элементы.
zh_cn: 与C库函数要求您提供适当大小的字符串作为参数不同，Octave的 <code>sprintf</code> 函数返回该字符串，并自动调整大小以容纳所有转换后的项目。

source: Unlock the named function <var>fcn</var> so that it may be removed from memory with <code>clear</code>.
es: Desbloquee la funci&oacute;n nombrada <var>fcn</var> para que pueda eliminarse de la memoria con <code>clear</code> .
ru: Разблокируйте <var>fcn</var> функцию fcn, чтобы ее можно было удалить из памяти с помощью <code>clear</code> .
zh_cn: 解锁命名函数 <var>fcn</var> ,以便可以使用 <code>clear</code> 将其从内存中删除。

source: Unpack the TAR archive <var>tarfile</var>.
es: Descomprima el archivo <var>tarfile</var> archivo TAR .
ru: Распакуйте <var>tarfile</var> архива TAR .
zh_cn: 解压缩TAR存档 <var>tarfile</var> 。

source: Unpack the ZIP archive <var>zipfile</var>.
es: Descomprima el archivo <var>zipfile</var> .
ru: Распакуйте ZIP-архив <var>zipfile</var> .
zh_cn: 解压缩ZIP存档 <var>zipfile</var> 。

source: Unpack the archive <var>file</var> based on its extension to the directory <var>dir</var>.
es: Descomprima el archivo de <var>file</var> seg&uacute;n su extensi&oacute;n al directorio <var>dir</var> .
ru: Распакуйте архивный <var>file</var> по его расширению в каталог <var>dir</var> .
zh_cn: 根据压缩 <var>file</var> 到目录 <var>dir</var> 的扩展名将其解压缩。

source: Unpack the bzip2 archive <var>bzfile</var>.
es: Desempaquete el archivo bzip2 <var>bzfile</var> .
ru: Распаковать bzip2 архив <var>bzfile</var> .
zh_cn: 解压缩bzip2存档 <var>bzfile</var> 。

source: Unpack the gzip archive <var>gzfile</var>.
es: Descomprima el archivo gzip <var>gzfile</var> .
ru: Распаковать gzip-архив <var>gzfile</var> .
zh_cn: 解压缩gzip存档 <var>gzfile</var> 。

source: Unshared data size.
es: Tamaño de los datos no compartidos.
ru: Необъединенный размер данных.
zh_cn: 未共享的数据大小。

source: Unshared stack size.
es: Tamaño de la pila no compartida.
ru: Неразделенный размер стопки.
zh_cn: 未共享的堆栈大小。

source: Unsurprisingly, <code>bar</code> is also recursive. It has been called 13,529 times in the course of recursively calculating the Fibonacci number in a suboptimal way, and most of the time was spent in <code>bar</code> itself.
es: Como era de esperar, la <code>bar</code> ra tambi&eacute;n es recursiva. Ha sido llamado 13,529 veces en el curso del c&aacute;lculo recursivo del n&uacute;mero de Fibonacci de una manera sub&oacute;ptima, y ​​la mayor parte del tiempo se pas&oacute; en la <code>bar</code> ra misma.
ru: Неудивительно, что <code>bar</code> также рекурсивен. Он был вызван 13 529 раз в ходе рекурсивного вычисления числа Фибоначчи неоптимальным способом, и большая часть времени была проведена на самом <code>bar</code> .
zh_cn: 毫不奇怪， <code>bar</code> 也是递归的。在以次优的方式递归计算斐波那契数的过程中，它被称为13529次，并且大部分时间都花在了 <code>bar</code> 本身上。

source: Unwrap radian phases by adding or subtracting multiples of 2*pi as appropriate to remove jumps greater than <var>tol</var>.
es: Desenvuelva las fases en radianes sumando o restando m&uacute;ltiplos de 2 * pi seg&uacute;n corresponda para eliminar los saltos mayores que <var>tol</var> .
ru: Разверните радианные фазы, добавляя или вычитая кратные 2 * пи, чтобы удалить скачки, превышающие <var>tol</var> .
zh_cn: 通过适当地增加或减去2 * pi的倍数来消除弧度相位，以消除大于 <var>tol</var> 的跳变。

source: Unwrap will work along the dimension <var>dim</var>. If <var>dim</var> is unspecified it defaults to the first non-singleton dimension.
es: Desenvolver funcionar&aacute; a lo largo de la dimensi&oacute;n <var>dim</var> . Si no se especifica <var>dim</var> , se establece de forma predeterminada en la primera dimensi&oacute;n que no es singleton.
ru: Распаковать будет работать по размеру <var>dim</var> . Если <var>dim</var> не указан, по умолчанию используется первое не одноэлементное измерение.
zh_cn: 展开将沿尺寸 <var>dim</var> 起作用。如果未指定 <var>dim</var> ，则默认为第一个非单一尺寸。

source: Up to eight light objects are supported per axes. (Implementation dependent)
es: Hasta ocho objetos ligeros son soportados por ejes.(Depende de la implementación)
ru: На каждую ось поддерживается до восьми световых объектов.(Зависит от реализации)
zh_cn: 每个轴最多支持八个光对象。(取决于实施)

source: Update a Cholesky factorization given a range of columns to shift in the original factored matrix.
es: Actualizar una factorización de Cholesky dado un rango de columnas para cambiar en la matriz factorizada original.
ru: Обновите факторизацию Холесского с учетом ряда столбцов для сдвига в исходной матрице факторизации.
zh_cn: 更新一个Cholesky因式,给定一个列的范围,在原定理矩阵中进行移动。

source: Update a Cholesky factorization given a row or column to delete from the original factored matrix.
es: Actualizar una factorización Cholesky dada una fila o columna para eliminarla de la matriz factorizada original.
ru: Обновите факторизацию Холески,задав строку или столбец для удаления из исходной матрицы учета.
zh_cn: 更新一个给定的Cholesky因式,从原定理矩阵中删除一行或一列。

source: Update a Cholesky factorization given a row or column to insert in the original factored matrix.
es: Actualizar una factorización Cholesky dada una fila o columna para insertar en la matriz factorizada original.
ru: Обновите факторизацию Холески,заданную строкой или столбцом для вставки в исходную матрицу факторизации.
zh_cn: 更新给定行或列的Cholesky因式,将其插入到原始因子矩阵中。

source: Update a QR factorization given a range of columns to shift in the original factored matrix.
es: Actualizar una factorización de QR dado un rango de columnas para cambiar en la matriz factorizada original.
ru: Обновите QR-факторизацию с учетом ряда столбцов для сдвига в исходной матрице учета.
zh_cn: 更新一个QR分解,给定一个列的范围,在原始保理矩阵中进行移动。

source: Update a QR factorization given a row or column to delete from the original factored matrix.
es: Actualizar una factorización QR dada una fila o columna para eliminarla de la matriz factorizada original.
ru: Обновите QR-факторизацию,получив строку или столбец для удаления из исходной матрицы учета.
zh_cn: 更新给定的QR因子化,从原始因子化矩阵中删除一行或一列。

source: Update a QR factorization given a row or column to insert in the original factored matrix.
es: Actualizar una factorización de QR dada una fila o columna para insertarla en la matriz factorizada original.
ru: Обновите QR-факторизацию,присвоенную строке или столбцу для вставки в исходную матрицу учета.
zh_cn: 更新一个给定的行或列的QR分解,以插入到原始保理矩阵中。

source: Update a QR factorization given update vectors or matrices.
es: Actualizar una factorización QR dado vectores o matrices de actualización.
ru: Обновите QR-факторизацию с учетом векторов обновления или матриц.
zh_cn: 更新给定更新向量或矩阵的QR分解。

source: Update figure windows and their children.
es: Actualizar las ventanas de figuras y sus hijos.
ru: Обновите иллюминаторы и их детей.
zh_cn: 更新人物窗口及其子女。

source: Update or downdate a Cholesky factorization.
es: Actualizar o reducir una factorización de Cholesky.
ru: Обновление или понижение факторизации Холески.
zh_cn: 更新或降级一个Cholesky因子化。

source: Upload local files
es: Subir los archivos locales
ru: Загрузить локальные файлы
zh_cn: 上传本地文件
