Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/octave/octave.*.020.xlf
Languages: es, ru, zh_cn

source: User-defined Data Types
es: Tipos de datos definidos por el usuario
ru: Определяемые пользователем Типы данных
zh_cn: 用户定义的数据类型

source: User-defined data to associate with the graphics object.
es: Datos definidos por el usuario para asociarlos con el objeto gráfico.
ru: Пользовательские данные для связи с графическим объектом.
zh_cn: 要与图形对象关联的用户自定义数据。

source: Using <a href="java-interface-functions#XREFisjava">isjava</a>, it is possible to check whether a variable is a Java object and its class can be determined as well. In addition to the previous example:
es: Usando <a href="java-interface-functions#XREFisjava">isjava</a> , es posible verificar si una variable es un objeto Java y tambi&eacute;n se puede determinar su clase. Adem&aacute;s del ejemplo anterior:
ru: Используя <a href="java-interface-functions#XREFisjava">isjava</a> , можно проверить, является ли переменная объектом Java, а также определить ее класс. В дополнение к предыдущему примеру:
zh_cn: 使用<a href="java-interface-functions#XREFisjava">isjava</a>，可以检查变量是否为Java对象，并且还可以确定其类。除了前面的示例：

source: Using <code>dbstep in</code> will cause execution of the next line to step into any m-files defined on the next line.
es: El uso de <code>dbstep in</code> har&aacute; que la ejecuci&oacute;n de la siguiente l&iacute;nea pase a cualquier archivo-m definido en la siguiente l&iacute;nea.
ru: Использование <code>dbstep in</code> вызовет выполнение следующей строки для перехода к любым m-файлам, определенным в следующей строке.
zh_cn: 使用 <code>dbstep in</code> 将导致下一行的执行进入下一行定义的所有m文件。

source: Using <code>dbstep out</code> will cause execution to continue until the current function returns.
es: El uso de <code>dbstep out</code> har&aacute; que la ejecuci&oacute;n contin&uacute;e hasta que regrese la funci&oacute;n actual.
ru: Использование <code>dbstep out</code> приведет к продолжению выполнения до возврата из текущей функции.
zh_cn: 使用 <code>dbstep out</code> 将导致执行继续直到当前函数返回。

source: Using <code>publish (<var>file</var>, <var>output_format</var>)</code> is equivalent to the function call using a structure
es: El uso de <code>publish (<var>file</var>, <var>output_format</var>)</code> es equivalente a la llamada a la funci&oacute;n usando una estructura
ru: Использование <code>publish (<var>file</var>, <var>output_format</var>)</code> эквивалентно вызову функции с использованием структуры
zh_cn: 使用 <code>publish (<var>file</var>, <var>output_format</var>)</code> 等效于使用结构的函数调用

source: Using <code>quadgk</code> in the example below, a double integration can be performed. (Note that any of the 1-D quadrature functions can be used in this fashion except for <code>quad</code> since it is written in Fortran and cannot be called recursively.)
es: Usando <code>quadgk</code> en el siguiente ejemplo, se puede realizar una doble integraci&oacute;n. (Tenga en cuenta que cualquiera de las funciones de cuadratura 1-D se puede usar de esta manera, excepto <code>quad</code> , ya que est&aacute; escrito en Fortran y no se puede llamar de forma recursiva).
ru: Используя <code>quadgk</code> в примере ниже, можно выполнить двойное интегрирование. (Обратите внимание, что любая из одномерных квадратурных функций может использоваться таким образом, кроме <code>quad</code> , поскольку она написана на Фортране и не может быть вызвана рекурсивно.)
zh_cn: 在下面的示例中使用 <code>quadgk</code> ，可以执行双重积分。（请注意，除了 <code>quad</code> 之外，任何一维正交函数都可以这种方式使用，因为它是用Fortran编写的，因此不能递归调用。）

source: Using Packages
es: Uso de los paquetes
ru: Использование пакетов
zh_cn: 使用软件包

source: Using Publishing Markup in Script Files
es: Uso de la marca de publicación en los archivos de guión
ru: Использование публикации разметки в файлах сценариев
zh_cn: 在脚本文件中使用发布标记

source: Using Sparse Matrices
es: Usando matrices dispersas
ru: Использование разрозненных матриц
zh_cn: 使用稀疏矩阵

source: Using Sparse Matrices in Oct-Files
es: Usando matrices dispersas en los archivos de octubre
ru: Использование разделенных матриц в октябрьских файлах
zh_cn: 在Oct-Files中使用稀疏矩阵。

source: Using a first order FEM, we approximate the electrical conductivity distribution in Omega as constant on each simplex (represented by the vector <code>conductivity</code>). Based on the finite element geometry, we first calculate a system (or stiffness) matrix for each simplex (represented as 3-by-3 elements on the diagonal of the element-wise system matrix <code>SE</code>). Based on <code>SE</code> and a N-by-DE connectivity matrix <code>C</code>, representing the connections between simplices and vertices, the global connectivity matrix <code>S</code> is calculated.
es: Usando un FEM de primer orden, aproximamos la distribuci&oacute;n de conductividad el&eacute;ctrica en Omega como constante en cada simplex (representado por la <code>conductivity</code> del vector ). Con base en la geometr&iacute;a de elementos finitos, primero calculamos una matriz de sistema (o rigidez) para cada simplex (representado como elementos de 3 por 3 en la diagonal de la matriz de sistema de elementos <code>SE</code> ). Con base en <code>SE</code> y una matriz de conectividad <code>C</code> N-por-DE , que representa las conexiones entre simples y v&eacute;rtices, se calcula la matriz <code>S</code> de conectividad global .
ru: Используя МКЭ первого порядка, мы аппроксимируем распределение электропроводности в Омеге как постоянное на каждом симплексе (представленное вектором <code>conductivity</code> ). Основываясь на геометрии конечных элементов, мы сначала вычисляем матрицу системы (или жесткости) для каждого симплекса (представленного в виде элементов 3 на 3 на диагонали поэлементной матрицы системы <code>SE</code> ). На основе <code>SE</code> и матрицы связности N-by-DE <code>C</code> , представляющей связи между симплексами и вершинами, вычисляется глобальная матрица связности <code>S</code> .
zh_cn: 使用一阶有限元法，我们将欧米茄的电导率分布近似为每个单形上的常数（由矢量 <code>conductivity</code> 表示）。基于有限元几何，我们首先为每个单纯形计算一个系统（或刚度）矩阵（在元素方式系统矩阵 <code>SE</code> 的对角线上表示为3&times;3元素）。基于 <code>SE</code> 和代表单纯形和顶点之间的连接的N-by-DE连接矩阵 <code>C</code> ，计算全局连接矩阵 <code>S</code> 。

source: Using classes to build new classes is supported by Octave through the use of both inheritance and aggregation.
es: El uso de clases para construir nuevas clases es apoyado por Octave a través del uso de la herencia y la agregación.
ru: Использование классов для построения новых классов поддерживается Октавой посредством использования как наследования,так и агрегирования.
zh_cn: Octave通过使用继承和聚合两种方式支持使用类来构建新的类。

source: Using just one number, such as the mean, to represent an entire data set may not give an accurate picture of the data. One way to characterize the fit is to measure the dispersion of the data. Octave provides several functions for measuring dispersion.
es: El uso de un solo número,como la media,para representar todo un conjunto de datos puede no dar una imagen exacta de los datos.Una forma de caracterizar el ajuste es medir la dispersión de los datos.La octava proporciona varias funciones para medir la dispersión.
ru: Использование только одного числа,например среднего,для представления всего массива данных может не дать точной картины данных.Одним из способов характеризовать подгонку является измерение дисперсии данных.Октава обеспечивает несколько функций для измерения дисперсии.
zh_cn: 仅用一个数字,如平均值,来代表整个数据集,可能无法准确反映数据的情况。表征拟合的一种方法是测量数据的离散度。Octave 提供了几个测量离散度的函数。

source: Using the &lsquo;
es: Utilizando la '
ru: Используя '
zh_cn: 使用 '

source: Using zero as an increment in the colon notation, as <code>1:0:1</code> is not allowed, because a division by zero would occur in determining the number of range elements. However, ranges with zero increment (i.e., all elements equal) are useful, especially in indexing, and Octave allows them to be constructed using the built-in function <code>ones</code>. Note that because a range must be a row vector, <code>ones (1, 10)</code> produces a range, while <code>ones (10, 1)</code> does not.
es: El uso de cero como un incremento en la notaci&oacute;n de dos puntos, como <code>1:0:1</code> no est&aacute; permitido, porque se producir&iacute;a una divisi&oacute;n por cero al determinar el n&uacute;mero de elementos de rango. Sin embargo, los rangos con cero incremento (es decir, todos los elementos iguales) son &uacute;tiles, especialmente en la indexaci&oacute;n, y Octave les permite ser construidos utilizando la funci&oacute;n incorporada de <code>ones</code> . Tenga en cuenta que debido a que un rango debe ser un vector de fila, <code>ones (1, 10)</code> produce un rango, mientras que <code>ones (10, 1)</code> no.
ru: Использование нуля в качестве приращения в нотации двоеточия, поскольку <code>1:0:1</code> не допускается, потому что деление на ноль могло бы произойти при определении количества элементов диапазона. Тем не менее, в диапазоне с нулевым приращения (то есть, все элементы равны) являются полезными, особенно в индексации, и октавных позволяет им быть построены с использованием встроенных функциональных <code>ones</code> . Обратите внимание: поскольку диапазон должен быть вектором-строкой, <code>ones (1, 10)</code> создает диапазон, а <code>ones (10, 1)</code> - нет.
zh_cn: 不允许使用零作为冒号表示的增量，因为 <code>1:0:1</code> 是不允许的，因为在确定范围元素的数量时会被零除。但是，具有零增量的范围（即，所有元素相等）是有用的，尤其是在索引编制中，并且Octave允许使用内置函数&ldquo; <code>ones</code> 来构造它们。请注意，因为范围必须是行向量，所以 <code>ones (1, 10)</code> 会产生范围，而 <code>ones (10, 1)</code> 不会。

source: Usually Octave will manage the memory, but sometimes it can be practical to remove variables from memory manually. This is usually needed when working with large variables that fill a substantial part of the memory. On a computer that uses the IEEE floating point format, the following program allocates a matrix that requires around 128 MB memory.
es: Normalmente Octave se encargará de la memoria,pero a veces puede ser práctico eliminar las variables de la memoria manualmente.Esto suele ser necesario cuando se trabaja con grandes variables que llenan una parte sustancial de la memoria.En una computadora que utiliza el formato de punto flotante del IEEE,el siguiente programa asigna una matriz que requiere alrededor de 128 MB de memoria.
ru: Обычно Октава будет управлять памятью,но иногда бывает практично удалять переменные из памяти вручную.Обычно это необходимо при работе с большими переменными,которые заполняют значительную часть памяти.На компьютере,использующем формат IEEE с плавающей запятой,следующая программа выделяет матрицу,которая требует около 128 Мб памяти.
zh_cn: 通常Octave会管理内存,但有时手动从内存中删除变量也是可行的。这通常是在处理占内存很大一部分的大变量时需要的。在一台使用IEEE浮点格式的计算机上,以下程序分配了一个需要约128MB内存的矩阵。

source: Utility Functions
es: Funciones de utilidad
ru: Функции полезности
zh_cn: 实用功能

source: Valid <var>key</var> and <var>value</var> pairs are:
es: Los pares de <var>key</var> y <var>value</var> v&aacute;lidos son:
ru: Допустимые пары <var>key</var> и <var>value</var> :
zh_cn: 有效的 <var>key</var> 和 <var>value</var> 对为：

source: Valid annotation types and their specific properties are described below:
es: A continuación se describen los tipos de anotación válidos y sus propiedades específicas:
ru: Действующие типы аннотаций и их специфические свойства описаны ниже:
zh_cn: 有效的注释类型及其具体属性描述如下。

source: Valid argument name, but ignored. Left for compatibility with <small>MATLAB</small>.
es: Nombre de argumento v&aacute;lido, pero ignorado. Dejado por compatibilidad con <small>MATLAB</small> .
ru: Допустимое имя аргумента, но игнорируется. Оставлено для совместимости с <small>MATLAB</small> .
zh_cn: 有效的参数名称，但被忽略。左为与<small>MATLAB</small>兼容。

source: Valid arguments for <var>type</var> are
es: Los argumentos v&aacute;lidos para el <var>type</var> son
ru: Допустимые аргументы для <var>type</var> :
zh_cn: <var>type</var> 有效参数是

source: Valid filetype extensions:
es: Extensiones de tipo de archivo válidas:
ru: Допустимые расширения файловых типов:
zh_cn: 有效的文件类型扩展。

source: Valid format options for floating point numbers are listed in the following table.
zh_cn: 浮点数的有效格式选项如下表所示。

source: Valid formats for floating point numbers are listed in the following table.
es: Los formatos válidos para los números de punto flotante se enumeran en el siguiente cuadro.
ru: Действующие форматы чисел с плавающей точкой перечислены в следующей таблице.
zh_cn: 浮点数的有效格式如下表所示。

source: Valid indices are either positive integers (although possibly of real data type), or logical arrays.
es: Los índices válidos son o bien enteros positivos (aunque posiblemente de tipo de datos reales),o bien matrices lógicas.
ru: Действительные индексы являются либо целыми положительными числами (хотя,возможно,и реального типа данных),либо логическими массивами.
zh_cn: 有效的指数可以是正整数(虽然可能是实数据类型),也可以是逻辑数组。

source: Valid options are:
es: Las opciones válidas son:
ru: Варианты действительны:
zh_cn: 有效选项为:

source: Valid options for <code>load</code> are listed in the following table.
es: Las opciones v&aacute;lidas para la <code>load</code> se enumeran en la siguiente tabla.
ru: Допустимые варианты <code>load</code> перечислены в следующей таблице.
zh_cn: 下表列出了有效的 <code>load</code> 选项。

source: Valid options for the <code>save</code> command are listed in the following table. Options that modify the output format override the format specified by <code>save_default_options</code>.
es: Las opciones v&aacute;lidas para el comando de <code>save</code> se enumeran en la siguiente tabla. Las opciones que modifican el formato de salida anulan el formato especificado por <code>save_default_options</code> .
ru: Допустимые параметры для команды <code>save</code> перечислены в следующей таблице. Параметры, изменяющие формат вывода, имеют приоритет над форматом, заданным параметром <code>save_default_options</code> .
zh_cn: 下表列出了 <code>save</code> 命令的有效选项。修改输出格式的选项将覆盖 <code>save_default_options</code> 指定的格式。

source: Valid parameters are:
es: Los parámetros válidos son:
ru: Действительные параметры:
zh_cn: 有效参数为:

source: Valid pattern syntax is the same as described for the <code>clear</code> command. If no patterns are supplied, all variables are listed.
es: La sintaxis de patr&oacute;n v&aacute;lida es la misma que se describe para el comando <code>clear</code> . Si no se proporcionan patrones, se enumeran todas las variables.
ru: Допустимый синтаксис шаблона такой же, как описано для команды <code>clear</code> . Если шаблоны не указаны, отображаются все переменные.
zh_cn: 有效模式语法与对 <code>clear</code> 命令的描述相同。如果未提供任何模式，则会列出所有变量。

source: Valid styles for uicontrol are:
es: Los estilos válidos para el uicontrol son:
ru: Валидные стили для uicontrol:
zh_cn: uicontrol的有效样式是。

source: Valid values for <var>orientation</var> are <code>"portrait"</code>, <code>"landscape"</code>, and <code>"tall"</code>.
es: Los valores v&aacute;lidos para la <var>orientation</var> son <code>"portrait"</code> , <code>"landscape"</code> y <code>"tall"</code> .
ru: Допустимые значения для <var>orientation</var> : <code>"portrait"</code> , <code>"landscape"</code> и <code>"tall"</code> .
zh_cn: 为有效值 <var>orientation</var> 是 <code>"portrait"</code> ， <code>"landscape"</code> ，和 <code>"tall"</code> 。

source: Validating Arguments
zh_cn: 验证参数

source: Validating the number of Arguments
zh_cn: 验证Arguments的数量

source: Validating the type of Arguments
zh_cn: 验证Arguments的类型

source: Value Classes vs. Handle Classes
es: Clases de Valor vs.Clases de Manipulación
ru: Классы стоимости против классов обработки
zh_cn: 值类与处理类

source: Value is a 1x8 Matrix with the x,y chromaticity values for white, red, green, and blue points, in that order.
es: El valor es una Matriz 1x8 con los valores de cromaticidad x,y para los puntos blancos,rojos,verdes y azules,en ese orden.
ru: Значение представляет собой матрицу 1x8 со значениями цветности x,y для белых,красных,зеленых и синих точек в этом порядке.
zh_cn: 值是一个1x8矩阵,依次为白、红、绿、蓝点的x、y色度值。

source: Value is a diagonal matrix.
es: El valor es una matriz diagonal.
ru: Значение-это диагональная матрица.
zh_cn: 值是一个对角线矩阵。

source: Value to return for empty numeric values in non-whitespace delimited data. The default is NaN. When the data type does not support NaN (int32 for example), then default is zero.
es: Valor a devolver para los valores numéricos vacíos en los datos delimitados no blancos.El valor por defecto es NaN.Cuando el tipo de datos no admite NaN (int32 por ejemplo),entonces el valor por defecto es cero.
ru: Значение для возврата пустых числовых значений в данных,не ограниченных пробелами.По умолчанию используется NaN.Если тип данных не поддерживает NaN (например,int32),то по умолчанию равен нулю.
zh_cn: 对于非空格分隔的数据中的空数值,要返回的值。缺省值是NaN.当数据类型不支持NaN时(例如int32),缺省值为0。当数据类型不支持NaN时(例如int32),则默认为0。

source: Value to return for empty numeric values in non-whitespace delimited data. The default is NaN. When the data type does not support NaN (int32 for example), then the default is zero.
es: Valor a devolver para los valores numéricos vacíos en los datos delimitados no blancos.El valor por defecto es NaN.Cuando el tipo de datos no soporta NaN (int32 por ejemplo),entonces el valor por defecto es cero.
ru: Значение для возврата пустых числовых значений в данных,не ограниченных пробелами.По умолчанию используется NaN.Если тип данных не поддерживает NaN (например,int32),то значение по умолчанию равно нулю.
zh_cn: 对于非空格分隔的数据中的空数值,要返回的值。缺省值是NaN.当数据类型不支持NaN时(例如int32),缺省值为0。当数据类型不支持NaN时(例如int32),默认值为0。

source: Values are arranged in a single column.
es: Los valores están dispuestos en una sola columna.
ru: Значения расположены в одном столбце.
zh_cn: 数值以单列方式排列。

source: Values are arranged in a single row.
es: Los valores están dispuestos en una sola fila.
ru: Значения расположены в одном ряду.
zh_cn: 数值以单行排列。

source: Values are arranged in a single vector (column or vector).
es: Los valores están dispuestos en un solo vector (columna o vector).
ru: Значения располагаются в одном векторе (столбце или векторе).
zh_cn: 值排列在一个单一的向量中(列或向量)。

source: Values are cast to double.
es: Los valores se duplican.
ru: Значения отбрасываются в двойном размере.
zh_cn: 数值投为双倍。

source: Variable in local scope
es: Variable en el ámbito local
ru: Переменная в локальном масштабе
zh_cn: 当地范围内的变量

source: Variable inheritance leads to a problem for <code>eval</code> and scripts. If a new variable is created in a parent function, it is not clear what should happen in nested child functions. For example, consider a parent function <code>foo</code> with a nested child function <code>bar</code>:
es: La herencia de variables genera un problema para <code>eval</code> y scripts. Si se crea una nueva variable en una funci&oacute;n principal, no est&aacute; claro qu&eacute; deber&iacute;a suceder en las funciones secundarias anidadas. Por ejemplo, considere una funci&oacute;n principal <code>foo</code> con una <code>bar</code> ra de funci&oacute;n secundaria anidada :
ru: Наследование переменных приводит к проблемам для <code>eval</code> и скриптов. Если в родительской функции создается новая переменная, неясно, что должно происходить во вложенных дочерних функциях. Например, рассмотрим родительскую функцию <code>foo</code> с вложенной дочерней <code>bar</code> функций :
zh_cn: 变量继承导致 <code>eval</code> 和脚本问题。如果在父函数中创建了新变量，则不清楚在嵌套子函数中会发生什么。例如，考虑一个带有嵌套子功能 <code>bar</code> 的父功能 <code>foo</code> ：

source: Variable is either 6 or 7
es: La variable es 6 o 7
ru: Переменная 6 или 7
zh_cn: 变量为6或7

source: Variable of complex type.
es: Variable de tipo complejo.
ru: Переменная сложного типа.
zh_cn: 复合型变量。

source: Variable with global scope.
es: Variable con alcance global.
ru: Переменная с глобальным масштабом.
zh_cn: 具有全球范围的变量。

source: Variable-length Argument Lists
es: Listas de argumentos de longitud variable
ru: Списки аргументов переменной длины
zh_cn: 可变长度的参数列表

source: Variable-length Return Lists
es: Listas de retorno de longitud variable
ru: Списки возврата с переменной длиной
zh_cn: 可变长度的返回列表

source: Variables in Octave do not have fixed types, so it is possible to first store a numeric value in a variable and then to later use the same name to hold a string value in the same program. Variables may not be used before they have been given a value. Doing so results in an error.
es: Las variables en Octava no tienen tipos fijos,por lo que es posible almacenar primero un valor numérico en una variable y luego utilizar el mismo nombre para mantener un valor de cadena en el mismo programa.Las variables no pueden utilizarse antes de que se les haya dado un valor.Si se hace así,se produce un error.
ru: Переменные в Октаве не имеют фиксированных типов,поэтому можно сначала хранить числовое значение в переменной,а затем использовать то же самое имя для хранения строкового значения в той же программе.Переменные нельзя использовать до того,как им присвоено значение.Это приводит к ошибке.
zh_cn: Octave中的变量没有固定的类型,所以可以先在一个变量中存储一个数值,然后再在同一程序中使用相同的名称来存放一个字符串值。变量在被赋值之前不能使用。这样做会导致一个错误。

source: Variables let you give names to values and refer to them later. You have already seen variables in many of the examples. The name of a variable must be a sequence of letters, digits and underscores, but it may not begin with a digit. Octave does not enforce a limit on the length of variable names, but it is seldom useful to have variables with names longer than about 30 characters. The following are all valid variable names
es: Las variables permiten dar nombres a los valores y referirse a ellos más tarde.Ya has visto variables en muchos de los ejemplos.El nombre de una variable debe ser una secuencia de letras,dígitos y guiones bajos,pero no puede comenzar con un dígito.Octava no impone un límite a la longitud de los nombres de las variables,pero rara vez es útil tener variables con nombres de más de unos 30 caracteres.Los siguientes son todos los nombres de variables válidos
ru: Переменные позволяют давать имена значениям и обращаться к ним позже.Вы уже видели переменные во многих примерах.Имя переменной должно состоять из последовательности букв,цифр и знаков подчеркивания,но оно может и не начинаться с цифры.Октава не ограничивает длину имен переменных,но редко бывает полезно иметь переменные с именами длиннее примерно 30 символов.Ниже перечислены все допустимые имена переменных
zh_cn: 变量可以让你给值命名,并在以后引用它们。你已经在许多例子中看到过变量。变量名必须是由字母、数字和下划线组成的序列,但不能以数字开头。Octave并没有对变量名的长度进行限制,但是变量名超过30个字符的情况很少。以下是所有有效的变量名

source: Variables used in the body of a function are local to the function. Variables named in <var>arg-list</var> and <var>ret-var</var> are also local to the function. See <a href="global-variables#Global-Variables">Global Variables</a>, for information about how to access global variables inside a function.
es: Las variables utilizadas en el cuerpo de una funci&oacute;n son locales a la funci&oacute;n. Las variables nombradas en <var>arg-list</var> y <var>ret-var</var> tambi&eacute;n son locales a la funci&oacute;n. Consulte <a href="global-variables#Global-Variables">Variables globales</a> para obtener informaci&oacute;n sobre c&oacute;mo acceder a las variables globales dentro de una funci&oacute;n.
ru: Переменные, используемые в теле функции, являются локальными по отношению к функции. Переменные, названные в <var>arg-list</var> и <var>ret-var</var> , также являются локальными для функции. См. Раздел &laquo; <a href="global-variables#Global-Variables">Глобальные переменные&raquo;</a> для получения информации о том, как получить доступ к глобальным переменным внутри функции.
zh_cn: 函数主体中使用的变量是该函数的局部变量。在 <var>arg-list</var> 和 <var>ret-var</var> 中命名的变量也是该函数的局部变量。有关如何访问函数内部的全局变量的信息，请参见<a href="global-variables#Global-Variables">全局变量</a>。
