Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/octave/octave.*.011.xlf
Languages: es, ja, ru, zh_cn

source: An optional final argument, which must be a string or cell array of strings, contains options passed to the underlying qhull command. See the documentation for the Qhull library for details <a href="http://www.qhull.org/html/qh-quick.htm#options">http://www.qhull.org/html/qh-quick.htm#options</a>. The default options are <code>{"Qt", "Qbb", "Qc", "Qz"}</code>.
es: Un argumento final opcional, que debe ser una cadena o una matriz de cadenas de celdas, contiene opciones pasadas al comando qhull subyacente. Consulte la documentaci&oacute;n de la biblioteca Qhull para obtener m&aacute;s detalles <a href="http://www.qhull.org/html/qh-quick.htm#options">http://www.qhull.org/html/qh-quick.htm#options</a> . Las opciones predeterminadas son <code>{"Qt", "Qbb", "Qc", "Qz"}</code> .
ja: オプションの最後の引数は、文字列または文字列のセル配列でなければならず、基礎となるqhullコマンドに渡されるオプションを含みます。詳細については、Qhullライブラリのドキュメント<a href="http://www.qhull.org/html/qh-quick.htm#options">http://www.qhull.org/html/qh-quick.htm#options</a>を参照してください。デフォルトのオプションは <code>{"Qt", "Qbb", "Qc", "Qz"}</code> です。
ru: Необязательный последний аргумент, который должен быть строкой или массивом ячеек строк, содержит параметры, переданные базовой команде qhull. Подробную информацию смотрите в документации по библиотеке Qhull <a href="http://www.qhull.org/html/qh-quick.htm#options">http://www.qhull.org/html/qh-quick.htm#options</a> . Параметры по умолчанию: <code>{"Qt", "Qbb", "Qc", "Qz"}</code> .
zh_cn: 可选的最终参数（必须是字符串或字符串单元格数组）包含传递给基础qhull命令的选项。有关详细信息，请参见Qhull库的文档<a href="http://www.qhull.org/html/qh-quick.htm#options">http://www.qhull.org/html/qh-quick.htm#options</a>。默认选项为 <code>{"Qt", "Qbb", "Qc", "Qz"}</code> 。

source: An optional final argument, which must be a string or cell array of strings, contains options passed to the underlying qhull command. See the documentation for the Qhull library for details <a href="http://www.qhull.org/html/qh-quick.htm#options">http://www.qhull.org/html/qh-quick.htm#options</a>. The default options are <code>{"Qt", "Qbb", "Qc"}</code>. If Qhull fails for 2-D input the triangulation is attempted again with the options <code>{"Qt", "Qbb", "Qc", "Qz"}</code> which may result in reduced accuracy.
ja: オプションのfinal引数は、文字列または文字列のセル配列である必要があり、基になるqhullコマンドに渡されるオプションが含まれています。詳細については、Qhullライブラリのドキュメントを参照して<a href="http://www.qhull.org/html/qh-quick.htm#options">くださいhttp://www.qhull.org/html/qh-quick.htm#options</a>。デフォルトのオプションは <code>{"Qt", "Qbb", "Qc"}</code> です。 Qhullが2D入力で失敗した場合、オプション <code>{"Qt", "Qbb", "Qc", "Qz"}</code> を使用して三角測量が再試行されるため、精度が低下する可能性があります。
zh_cn: 可选的最终参数（必须是字符串或字符串单元格数组）包含传递给基础qhull命令的选项。有关详细信息，请参见Qhull库的文档<a href="http://www.qhull.org/html/qh-quick.htm#options">http://www.qhull.org/html/qh-quick.htm#options</a>。默认选项为 <code>{"Qt", "Qbb", "Qc"}</code> 。如果Qhull无法进行2D输入，则使用选项 <code>{"Qt", "Qbb", "Qc", "Qz"}</code> 再次尝试三角剖分，这可能会导致精度降低。

source: An optional list of <var>property</var>/<var>value</var> pairs can be used to change the appearance of the created title text object.
es: Se puede utilizar una lista opcional de pares de <var>property</var> / <var>value</var> para cambiar la apariencia del objeto de texto de t&iacute;tulo creado.
ja: オプションのリスト <var>property</var> / <var>value</var> ペアが作成されたタイトルテキストオブジェクトの外観を変更するために使用することができます。
ru: Необязательный список пар <var>property</var> / <var>value</var> может использоваться для изменения внешнего вида созданного текстового объекта заголовка.
zh_cn: <var>property</var> / <var>value</var> 对的可选列表可用于更改创建的标题文本对象的外观。

source: An optional list of <var>property</var>/<var>value</var> pairs can be used to change the properties of the created text label.
es: Se puede utilizar una lista opcional de pares de <var>property</var> / <var>value</var> para cambiar las propiedades de la etiqueta de texto creada.
ja: オプションのリスト <var>property</var> / <var>value</var> ペアが作成されたテキストラベルのプロパティを変更するために使用することができます。
ru: Необязательный список пар <var>property</var> / <var>value</var> можно использовать для изменения свойств созданной текстовой метки.
zh_cn: <var>property</var> / <var>value</var> 对的可选列表可用于更改创建的文本标签的属性。

source: An optional range specification can be used to list only a portion of the file. The special keyword <code>"end"</code> is a valid line number specification for the last line of the file.
es: Se puede utilizar una especificaci&oacute;n de rango opcional para enumerar solo una parte del archivo. La palabra clave especial <code>"end"</code> es una especificaci&oacute;n de n&uacute;mero de l&iacute;nea v&aacute;lida para la &uacute;ltima l&iacute;nea del archivo.
ja: オプションの範囲指定を使用して、ファイルの一部のみをリストできます。特別なキーワード <code>"end"</code> は、ファイルの最終行の有効な行番号指定です。
ru: Необязательная спецификация диапазона может использоваться для перечисления только части файла. Специальное ключевое слово <code>"end"</code> - это допустимая спецификация номера строки для последней строки файла.
zh_cn: 可选范围规范只能用于列出文件的一部分。特殊关键字 <code>"end"</code> 是文件最后一行的有效行号规范。

source: An optional second argument, which must be a string or cell array of strings, contains options passed to the underlying qhull command. See the documentation for the Qhull library for details <a href="http://www.qhull.org/html/qh-quick.htm#options">http://www.qhull.org/html/qh-quick.htm#options</a>.
es: Un segundo argumento opcional, que debe ser una cadena o una matriz de cadenas de celdas, contiene opciones pasadas al comando qhull subyacente. Consulte la documentaci&oacute;n de la biblioteca Qhull para obtener m&aacute;s detalles <a href="http://www.qhull.org/html/qh-quick.htm#options">http://www.qhull.org/html/qh-quick.htm#options</a> .
ja: 文字列または文字列のセル配列でなければならないオプションの2番目の引数には、基になるqhullコマンドに渡されるオプションが含まれます。詳細については、Qhullライブラリのドキュメント<a href="http://www.qhull.org/html/qh-quick.htm#options">http://www.qhull.org/html/qh-quick.htm#options</a>を参照してください。
ru: Необязательный второй аргумент, который должен быть строкой или массивом ячеек строк, содержит параметры, переданные базовой команде qhull. Подробную информацию смотрите в документации по библиотеке Qhull <a href="http://www.qhull.org/html/qh-quick.htm#options">http://www.qhull.org/html/qh-quick.htm#options</a> .
zh_cn: 可选的第二个参数（必须是字符串或字符串的单元格数组）包含传递给基础qhull命令的选项。有关详细信息，请参见Qhull库的文档<a href="http://www.qhull.org/html/qh-quick.htm#options">http://www.qhull.org/html/qh-quick.htm#options</a>。

source: An optional second argument, which must be a string or cell array of strings, contains options passed to the underlying qhull command. See the documentation for the Qhull library for details <a href="http://www.qhull.org/html/qh-quick.htm#options">http://www.qhull.org/html/qh-quick.htm#options</a>. The default options depend on the dimension of the input:
es: Un segundo argumento opcional, que debe ser una cadena o una matriz de cadenas de celdas, contiene opciones pasadas al comando qhull subyacente. Consulte la documentaci&oacute;n de la biblioteca Qhull para obtener m&aacute;s detalles <a href="http://www.qhull.org/html/qh-quick.htm#options">http://www.qhull.org/html/qh-quick.htm#options</a> . Las opciones predeterminadas dependen de la dimensi&oacute;n de la entrada:
ja: 文字列または文字列のセル配列でなければならないオプションの2番目の引数には、基になるqhullコマンドに渡されるオプションが含まれます。詳細については、Qhullライブラリのドキュメント<a href="http://www.qhull.org/html/qh-quick.htm#options">http://www.qhull.org/html/qh-quick.htm#options</a>を参照してください。デフォルトのオプションは、入力の次元によって異なります。
ru: Необязательный второй аргумент, который должен быть строкой или массивом ячеек строк, содержит параметры, переданные базовой команде qhull. Подробную информацию смотрите в документации по библиотеке Qhull <a href="http://www.qhull.org/html/qh-quick.htm#options">http://www.qhull.org/html/qh-quick.htm#options</a> . Параметры по умолчанию зависят от размера ввода:
zh_cn: 可选的第二个参数（必须是字符串或字符串的单元格数组）包含传递给基础qhull命令的选项。有关详细信息，请参见Qhull库的文档<a href="http://www.qhull.org/html/qh-quick.htm#options">http://www.qhull.org/html/qh-quick.htm#options</a>。默认选项取决于输入的尺寸：

source: An optional short description of the used license (e.g., GPL version 3 or newer). This is optional since the file
es: Una breve descripción opcional de la licencia utilizada (por ejemplo,GPL versión 3 o más reciente).Esto es opcional ya que el archivo
ja: 使用されているライセンスのオプションの短い説明 (例:GPL バージョン 3 または新しいもの)。これはオプションです。
ru: Необязательное краткое описание применяемой лицензии (например,GPL версии 3 или более новой).Это необязательно,поскольку файл
zh_cn: 所用许可证的可选简短描述(例如,GPL第3版或更新版本)。这是可选的,因为文件

source: An optional sixth argument specifies the specular exponent (spread) <var>se</var>. If not given, <var>se</var> defaults to 10.
es: Un sexto argumento opcional especifica el exponente especular (dispersi&oacute;n) <var>se</var> . Si no se da, <var>se</var> por defecto es 10.
ja: オプションの6番目の引数は、鏡面指数（拡散） <var>se</var> を指定します。指定しない場合、 <var>se</var> のデフォルトは10です。
ru: Необязательный шестой аргумент задает зеркальный показатель (спред) <var>se</var> . Если не задано, <var>se</var> по умолчанию 10.
zh_cn: 可选的第六个参数指定镜面指数（展宽） <var>se</var> 。如果未给出，则 <var>se</var> 默认为10。

source: An optional structure containing the following parameter(s) used to define the behavior of the solver. Missing elements in the structure take on default values, so you only need to set the elements that you wish to change from the default.
es: Una estructura opcional que contiene los siguientes parámetros usados para definir el comportamiento del solucionador.Los elementos faltantes en la estructura toman valores por defecto,por lo que sólo es necesario fijar los elementos que se desean cambiar del valor por defecto.
ja: ソルバーの動作を定義するために使用される以下のパラメータを含むオプションの構造体。構造体にない要素はデフォルト値を取るので、デフォルトから変更したい要素だけを設定する必要があります。
ru: Необязательная структура,содержащая следующий(ие)параметр(ы),используемый(ие)для определения поведения решателя.Пропущенные элементы в структуре принимают значения по умолчанию,поэтому вам нужно установить только те элементы,которые вы хотите изменить по умолчанию.
zh_cn: 一个包含以下参数的可选结构,用于定义求解器的行为。结构中缺失的元素采用默认值,所以只需要设置你想改变默认值的元素。

source: An optional third argument <code>"enable"</code> or <code>"disable"</code> is accepted but ignored.
es: Se acepta un tercer argumento opcional <code>"enable"</code> o <code>"disable"</code> pero se ignora.
ja: オプションの3番目の引数 <code>"enable"</code> または <code>"disable"</code> は受け入れられますが、無視されます。
ru: Необязательный третий аргумент <code>"enable"</code> или <code>"disable"</code> принимается, но игнорируется.
zh_cn: 可选的第三个参数 <code>"enable"</code> 或 <code>"disable"</code> 被接受但被忽略。

source: An optional timeout can be specified using the property <code>"timeout"</code>. This timeout value is the number of seconds to wait for the condition to be true. <var>timeout</var> must be at least 1. If a smaller value is specified, a warning is issued and a value of 1 is used instead. If the timeout value is not an integer, it is truncated towards 0.
es: Se puede especificar un tiempo de espera opcional mediante la propiedad <code>"timeout"</code> . Este valor de tiempo de espera es el n&uacute;mero de segundos de espera para que se cumpla la condici&oacute;n. <var>timeout</var> debe ser al menos 1. Si se especifica un valor menor, se emite una advertencia y en su lugar se usa un valor de 1. Si el valor del tiempo de espera no es un n&uacute;mero entero, se trunca hacia 0.
ja: オプションのタイムアウトは、プロパティ <code>"timeout"</code> を使用して指定できます。このタイムアウト値は、条件がtrueになるまで待機する秒数です。 <var>timeout</var> は少なくとも1でなければなりません。これより小さい値を指定すると、警告が発行され、代わりに値1が使用されます。タイムアウト値が整数でない場合、0に向かって切り捨てられます。
ru: Необязательный тайм-аут можно указать с помощью свойства <code>"timeout"</code> . Это значение тайм-аута представляет собой количество секунд ожидания выполнения условия. <var>timeout</var> должен быть не меньше 1. Если указано меньшее значение, выдается предупреждение и вместо него используется значение 1. Если значение тайм-аута не является целым числом, оно обрезается до 0.
zh_cn: 可以使用属性 <code>"timeout"</code> 来指定可选的超时时间。此超时值是等待条件为真的秒数。 <var>timeout</var> 必须至少为1。如果指定了较小的值，则会发出警告，并使用值1代替。如果超时值不是整数，则将其截断为0。

source: An optional type modifier character. This character is ignored by Octave&rsquo;s <code>scanf</code> function, but is recognized to provide compatibility with the C language <code>scanf</code>.
es: Un car&aacute;cter modificador de tipo opcional. La funci&oacute;n <code>scanf</code> de Octave ignora este car&aacute;cter , pero se reconoce que proporciona compatibilidad con el lenguaje C <code>scanf</code> .
ja: オプションのタイプ修飾文字。この文字はOctaveの <code>scanf</code> 関数では無視されますが、C言語の <code>scanf</code> との互換性を提供するために認識されています。
ru: Необязательный символ-модификатор типа. Этот символ игнорируется Октав <code>scanf</code> функции, но признается , чтобы обеспечить совместимость с языком C <code>scanf</code> .
zh_cn: 可选的类型修饰符。Octave的 <code>scanf</code> 函数将忽略此字符，但可以识别该字符以提供与C语言 <code>scanf</code> 的兼容性。

source: An scalar value containing the relative menu position. The entry with the lowest value is at the first position starting from left or top.
es: Un valor escalar que contiene la posición relativa del menú.La entrada con el valor más bajo se encuentra en la primera posición empezando por la izquierda o por arriba.
ja: メニューの相対的な位置を含むスカラー値。値が最も小さいエントリは、左または上から始まる最初の位置にあります。
ru: Скалярное значение,содержащее относительное положение меню.Запись с наименьшим значением находится в первой позиции слева или сверху.
zh_cn: 一个包含相对菜单位置的标量值。值最小的条目位于从左边或顶部开始的第一个位置。

source: An un-typed property. This kind of property can hold any octave value. <var>args</var> contains the default value.
es: Una propiedad sin escribir. Este tipo de propiedad puede contener cualquier valor de octava. <var>args</var> contiene el valor predeterminado.
ja: 型指定されていないプロパティ。この種類のプロパティは、任意のオクターブ値を保持できます。 <var>args</var> にはデフォルト値が含まれています。
ru: Нетипизированное свойство. Это свойство может содержать любое значение октавы. <var>args</var> содержит значение по умолчанию.
zh_cn: 无类型的属性。这种属性可以保存任何八度值。 <var>args</var> 包含默认值。

source: An upper triangular matrix has nonzero entries only on the main diagonal and above.
es: Una matriz triangular superior tiene entradas que no son cero sólo en la diagonal principal y arriba.
ja: 上三角行列は、主対角線上にのみ非ゼロのエントリを持ちます。
ru: Верхняя треугольная матрица имеет ненулевые значения только по главной диагонали и выше.
zh_cn: 一个上三角矩阵只有在主对角线及以上才有非零的条目。

source: Anchoring operators. Requires pattern to occur at the start (<code>^</code>) or end (<code>$</code>) of the string.
es: Operadores de fondeo. Requiere que el patr&oacute;n ocurra al principio ( <code>^</code> ) o al final ( <code>$</code> ) de la cadena.
ja: アンカー演算子。文字列の先頭（ <code>^</code> ）または末尾（ <code>$</code> ）でパターンが発生する必要があります。
ru: Операторы привязки. Требует, чтобы шаблон находился в начале ( <code>^</code> ) или конце ( <code>$</code> ) строки.
zh_cn: 锚定运算符。要求模式出现在字符串的开头（ <code>^</code> ）或结尾（ <code>$</code> ）。

source: And to compute the hash value of a file, e.g., <code>file = "file.txt"</code>, call <code>hash</code> in combination with the <code>fileread</code>:
es: Y para calcular el valor hash de un archivo, por ejemplo, <code>file = "file.txt"</code> , llame a <code>hash</code> en combinaci&oacute;n con <code>fileread</code> :
ja: そして、ファイルのハッシュ値を計算するには、例えば <code>file = "file.txt"</code> 、 <code>hash</code> を <code>fileread</code> と組み合わせて呼び出します：
ru: А чтобы вычислить хеш-значение файла, например <code>file = "file.txt"</code> , вызовите <code>hash</code> в сочетании с <code>fileread</code> :
zh_cn: 为了计算文件的哈希值，例如 <code>file = "file.txt"</code> ，请与文件 <code>fileread</code> 结合调用 <code>hash</code> ：

source: And, here is how to <em>yank</em> the text back into the line. Yanking means to copy the most-recently-killed text from the kill buffer.
es: Y aqu&iacute; se explica c&oacute;mo volver a <em>colocar</em> el texto en la l&iacute;nea. Yanking significa copiar el texto matado m&aacute;s recientemente del b&uacute;fer de eliminaci&oacute;n.
ja: そして、これがテキストを行に<em>ヤンク</em>する方法です。ヤンキングとは、最後にキルされたテキストをキルバッファからコピーすることです。
ru: И вот как <em>дергать</em> текст обратно в линию. Янкинг означает копирование последнего уничтоженного текста из буфера уничтожения.
zh_cn: 而且，这里是如何<em>抽出</em>文本回线。Yanking意味着从kill缓冲区复制最近被杀死的文本。

source: Anonymous Function Handle
es: Mango de función anónima
ja: 匿名関数ハンドル
ru: Анонимная функциональная ручка
zh_cn: 匿名功能手柄

source: Anonymous Functions
es: Funciones anónimas
ja: 匿名機能
ru: Анонимные функции
zh_cn: 匿名函数

source: Anonymous functions are defined using the syntax
es: Las funciones anónimas se definen utilizando la sintaxis
ja: 匿名関数は、以下の構文を使用して定義されます。
ru: Анонимные функции определяются с помощью синтаксиса
zh_cn: 匿名函数的定义使用的语法是

source: Another advanced use of linear indexing is to create arrays filled with a single value. This can be done by using an index of ones on a scalar value. The result is an object with the dimensions of the index expression and every element equal to the original scalar. For example, the following statements
es: Otro uso avanzado de la indexación lineal es crear matrices llenas de un solo valor.Esto puede hacerse utilizando un índice de unos en un valor escalar.El resultado es un objeto con las dimensiones de la expresión del índice y cada elemento igual al escalar original.Por ejemplo,las siguientes afirmaciones
ja: 線形インデキシングのもう一つの高度な使用法は、単一の値で満たされた配列を作成することです。これはスカラ値に1のインデックスを使用することで行うことができます。その結果、インデックス式の次元を持ち、すべての要素が元のスカラ値と等しいオブジェクトが得られます。例えば、以下の文は
ru: Другое продвинутое использование линейной индексации заключается в создании массивов,заполненных одним значением.Это можно сделать с помощью индекса единиц на скалярное значение.В результате получается объект с размерами индексного выражения и каждым элементом,равным исходному скаляру.Например,следующие утверждения
zh_cn: 线性索引的另一个高级用法是创建充满单一值的数组。这可以通过在一个标量值上使用1的索引来实现。结果是一个对象,其维度为索引表达式的维度,每个元素都等于原始标量。例如,下面的语句

source: Another class of error message occurs at evaluation time. These errors are called <em>run-time errors</em>, or sometimes <em>evaluation errors</em>, because they occur when your program is being <em>run</em>, or <em>evaluated</em>. For example, if after correcting the mistake in the previous function definition, you type
es: Otra clase de mensaje de error ocurre en el momento de la evaluaci&oacute;n. Estos errores se denominan <em>errores en tiempo de ejecuci&oacute;n</em> , o algunas veces <em>errores de evaluaci&oacute;n</em> , porque ocurren cuando su programa se est&aacute; <em>ejecutando</em> o <em>evaluado</em> . Por ejemplo, si despu&eacute;s de corregir el error en la definici&oacute;n de funci&oacute;n anterior, escribe
ja: 別のクラスのエラーメッセージが評価時に発生します。これらのエラーは、プログラムの<em>実行</em>時または<em>評価</em>時に発生するため、<em>実行時エラー</em>、または場合によっては<em>評価エラー</em>と呼ば<em>れ</em>ます。たとえば、前の関数定義の誤りを修正した後、次のように入力したとします。<em></em><em></em>
ru: Другой класс сообщений об ошибках возникает во время оценки. Эти ошибки называются <em>ошибками времени выполнения</em> или иногда <em>ошибками оценки</em> , потому что они возникают, когда ваша программа <em>выполняется</em> или <em>оценивается</em> . Например, если после исправления ошибки в предыдущем определении функции вы наберете
zh_cn: 在评估时会出现另一类错误消息。这些错误称为<em>运行时错误</em>，有时也称为<em>评估错误</em>，因为它们是在<em>运行</em>或<em>评估</em>程序时发生的。例如，如果在更正了先前的函数定义中的错误之后，键入

source: Another example for decomposition is a finite difference matrix used to solve a boundary value problem on the unit square.
es: Otro ejemplo de descomposición es una matriz de diferencias finitas utilizada para resolver un problema de valor límite en el cuadrado de la unidad.
ja: 分解の別の例としては、単位平方上の境界値問題を解くために使用される有限差分行列がある。
ru: Другим примером декомпозиции является матрица конечных разностей,используемая для решения краевой задачи на единичном квадрате.
zh_cn: 分解的另一个例子是一个有限差分矩阵,用于解决单位平方的边界值问题。

source: Another example of where comma separated lists are used is in the creation of a new array with <code>[]</code> (see <a href="matrices#Matrices">Matrices</a>) or the creation of a cell array with <code>{}</code> (see <a href="basic-usage-of-cell-arrays#Basic-Usage-of-Cell-Arrays">Basic Usage of Cell Arrays</a>). In the expressions
es: Otro ejemplo de d&oacute;nde se utilizan listas separadas por comas es en la creaci&oacute;n de una nueva matriz con <code>[]</code> (ver <a href="matrices#Matrices">Matrices</a> ) o la creaci&oacute;n de una matriz de celdas con <code>{}</code> (ver <a href="basic-usage-of-cell-arrays#Basic-Usage-of-Cell-Arrays">Uso b&aacute;sico de matrices de celdas</a> ). En las expresiones
ja: コンマ区切りのリストが使用されるもう1つの例は、 <code>[]</code> を使用した新しい配列の作成（<a href="matrices#Matrices">マトリックスを</a>参照）または <code>{}</code> を<a href="basic-usage-of-cell-arrays#Basic-Usage-of-Cell-Arrays">使用</a>したセル配列の作成（セル配列の基本的な使用法を参照）です。式で
ru: Другой пример использования списков, разделенных запятыми, - создание нового массива с помощью <code>[]</code> (см. <a href="matrices#Matrices">Матрицы</a> ) или создание массива ячеек с помощью <code>{}</code> (см. <a href="basic-usage-of-cell-arrays#Basic-Usage-of-Cell-Arrays">Основное использование массивов ячеек</a> ). В выражениях
zh_cn: 使用逗号分隔列表的另一个示例是使用 <code>[]</code> 创建新数组（请参见<a href="matrices#Matrices">Matrices</a>）或使用 <code>{}</code> 创建单元格数组（请参见<a href="basic-usage-of-cell-arrays#Basic-Usage-of-Cell-Arrays">Cell Arrays的基本用法</a>）。在表达式中

source: Another example, where the result is a multi-dimensional 3-D array and the default value (zero) appears in the output:
es: Otro ejemplo,en el que el resultado es una matriz tridimensional multidimensional y el valor por defecto (cero)aparece en la salida:
ja: 別の例では、結果が多次元3次元配列であり、デフォルト値(ゼロ)が出力されます。
ru: Другой пример,где в результате получается многомерный 3-D массив и на выходе появляется значение по умолчанию (ноль):
zh_cn: 另一个例子,其结果是一个多维的三维数组,默认值(0)出现在输出中。

source: Another important feature of Octave is its ability to react to the user typing
es: Otra característica importante de Octava es su capacidad de reaccionar a la escritura del usuario
ja: Octaveのもう一つの重要な特徴は,ユーザが入力すると反応する能力です。
ru: Еще одной важной особенностью Октавы является ее способность реагировать на набор текста пользователем.
zh_cn: Octave的另一个重要特点是它能够对用户输入的信息做出反应。

source: Another possible workaround is to use the command
es: Otra posible solución es usar el comando
ja: もう一つの回避策は、コマンド
ru: Другой возможный обходной путь-использовать команду
zh_cn: 另一种可能的变通方法是使用命令

source: Another set of command-line editing functions use Meta characters. To type
es: Otro conjunto de funciones de edición de la línea de comandos utiliza los meta caracteres.Para escribir
ja: コマンドライン編集機能のもう一つのセットは、メタ文字を使用しています。以下のように入力します。
ru: Другой набор функций редактирования из командной строки использует мета-символы.Для ввода
zh_cn: 另一组命令行编辑功能使用元字符。要输入

source: Another simple way of setting a breakpoint in an Octave script is the use of the <code>keyboard</code> function.
es: Otra forma sencilla de establecer un punto de interrupci&oacute;n en un script de Octave es el uso de la funci&oacute;n del <code>keyboard</code> .
ja: Octaveスクリプトでブレークポイントを設定するもう1つの簡単な方法は、 <code>keyboard</code> 機能の使用です。
ru: Еще один простой способ установки точки останова в сценарии Octave - использование функции <code>keyboard</code> .
zh_cn: 在八度脚本中设置断点的另一种简单方法是使用 <code>keyboard</code> 功能。
