Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/octave/octave.*.020.xlf
Languages: es, ru, zh_cn

source: When a file is re-parsed, such as when it is modified outside the GUI, all breakpoints within the file are cleared.
es: Cuando se repasa un archivo,como cuando se modifica fuera de la interfaz gráfica de usuario,se borran todos los puntos de ruptura dentro del archivo.
ru: При повторном открытии файла,например,при его изменении за пределами графического интерфейса,все точки останова в файле удаляются.
zh_cn: 当一个文件被重新解析时,比如在GUI外修改时,文件内的所有断点都会被清除。

source: When a function is called, Octave searches a list of directories for a file that contains the function declaration. This list of directories is known as the load path. By default the load path contains a list of directories distributed with Octave plus the current working directory. To see your current load path call the <code>path</code> function without any input or output arguments.
es: Cuando se llama a una funci&oacute;n, Octave busca en una lista de directorios un archivo que contenga la declaraci&oacute;n de la funci&oacute;n. Esta lista de directorios se conoce como ruta de carga. Por defecto, la ruta de carga contiene una lista de directorios distribuidos con Octave m&aacute;s el directorio de trabajo actual. Para ver su ruta de carga actual, llame a la funci&oacute;n de <code>path</code> sin ning&uacute;n argumento de entrada o salida.
ru: Когда функция вызывается, Octave ищет в списке каталогов файл, содержащий объявление функции. Этот список каталогов известен как путь загрузки. По умолчанию путь загрузки содержит список каталогов, распространяемых с Octave, плюс текущий рабочий каталог. Чтобы увидеть текущий путь загрузки, вызовите функцию <code>path</code> без каких-либо аргументов ввода или вывода.
zh_cn: 调用函数时，Octave在目录列表中搜索包含函数声明的文件。此目录列表称为加载路径。默认情况下，加载路径包含使用Octave分发的目录列表以及当前工作目录。要查看当前的加载路径，请调用没有任何输入或输出参数的 <code>path</code> 函数。

source: When a light object is present in an axes object, and the properties <code>"EdgeLighting"</code> or <code>"FaceLighting"</code> of a <code>patch</code> or <code>surface</code> object are set to a value other than <code>"none"</code>, these objects are drawn with lighting effects. Supported values for Lighting properties are <code>"none"</code> (no lighting effects), <code>"flat"</code> (faceted look of the objects), and <code>"gouraud"</code> (linear interpolation of the lighting effects between the vertices). If the lighting mode is set to <code>"flat"</code>, the <code>"FaceNormals"</code> property is used for lighting. For <code>"gouraud"</code>, the <code>"VertexNormals"</code> property is used.
es: Cuando un objeto de luz est&aacute; presente en un objeto de ejes y las propiedades <code>"EdgeLighting"</code> o <code>"FaceLighting"</code> de un <code>patch</code> o de un objeto de <code>surface</code> se establecen en un valor distinto de <code>"none"</code> , estos objetos se dibujan con efectos de iluminaci&oacute;n. Los valores admitidos para las propiedades de iluminaci&oacute;n son <code>"none"</code> (sin efectos de iluminaci&oacute;n), <code>"flat"</code> (aspecto facetado de los objetos) y <code>"gouraud"</code> (interpolaci&oacute;n lineal de los efectos de iluminaci&oacute;n entre los v&eacute;rtices). Si el modo de iluminaci&oacute;n se establece en <code>"flat"</code> , la propiedad <code>"FaceNormals"</code> se utiliza para la iluminaci&oacute;n. Para <code>"gouraud"</code> , los <code>"VertexNormals"</code> se utiliza la propiedad.
ru: Когда объект освещения присутствует в объекте осей, а для свойств <code>"EdgeLighting"</code> или <code>"FaceLighting"</code> объекта <code>patch</code> или <code>surface</code> задано значение, отличное от <code>"none"</code> , эти объекты рисуются с эффектами освещения. Поддерживаемые значения для свойств освещения: <code>"none"</code> (без световых эффектов), <code>"flat"</code> (фасеточный вид объектов) и <code>"gouraud"</code> (линейная интерполяция световых эффектов между вершинами). Если режим освещения установлен на <code>"flat"</code> , свойство <code>"FaceNormals"</code> используется для освещения. Для <code>"gouraud"</code> , <code>"VertexNormals"</code> свойство используется.
zh_cn: 当光对象存在于一个轴对象，并且属性 <code>"EdgeLighting"</code> 或 <code>"FaceLighting"</code> 一个的 <code>patch</code> 或 <code>surface</code> 对象被设定为比其它的值 <code>"none"</code> ，这些目的绘制的照明效果。照明属性的支持值为 <code>"none"</code> （无照明效果）， <code>"flat"</code> （对象的多面外观）和 <code>"gouraud"</code> （顶点之间的照明效果的线性插值）。如果将照明模式设置为 <code>"flat"</code> ，则将 <code>"FaceNormals"</code> 属性用于照明。对于 <code>"gouraud"</code> ，即 <code>"VertexNormals"</code> 属性被使用。

source: When a local variable name, which is linked to a global variable, is cleared only the local copy of the variable is removed. The global copy is untouched and can be restored with <code>global <var>global_varname</var></code>. Conversely, <code>clear -g <var>global_varname</var></code> will remove both the local and global variables.
zh_cn: 清除链接到全局变量的本地变量名称后，仅删除该变量的本地副本。全局副本未 <code>global <var>global_varname</var></code> ，可以使用global global_varname进行还原。相反， <code>clear -g <var>global_varname</var></code> 将同时删除局部变量和全局变量。

source: When a second output argument is requested an index matrix is also returned. The <var>idx</var> matrix has the same size as <var>x</var>. Each element of <var>idx</var> contains the index of the histogram bin in which the corresponding element of <var>x</var> was counted.
es: Cuando se solicita un segundo argumento de salida, tambi&eacute;n se devuelve una matriz de &iacute;ndice. La matriz <var>idx</var> tiene el mismo tama&ntilde;o que <var>x</var> . Cada elemento de <var>idx</var> contiene el &iacute;ndice del intervalo de histograma en el que se cont&oacute; el elemento correspondiente de <var>x</var> .
ru: Когда запрашивается второй выходной аргумент, также возвращается индексная матрица. <var>idx</var> матрица имеет тот же размер, <var>x</var> . Каждый элемент <var>idx</var> содержит индекс ячейки гистограммы, в которой был подсчитан соответствующий элемент <var>x</var> .
zh_cn: 当请求第二个输出参数时，也会返回索引矩阵。的 <var>idx</var> 矩阵具有大小为相同的 <var>x</var> 。 <var>idx</var> 的每个元素都包含直方图bin的索引，其中 <var>x</var> 的相应元素已在其中进行计数。

source: When a test fails, you will see something like:
es: Cuando una prueba falla,verás algo como:
ru: Когда тест провалится,вы увидите нечто подобное:
zh_cn: 当测试失败时,你会看到这样的内容。

source: When adding a scalar to a range, subtracting a scalar from it (or subtracting a range from a scalar) and multiplying by scalar, Octave will attempt to avoid unpacking the range and keep the result as a range, too, if it can determine that it is safe to do so. For instance, doing
es: Al añadir un escalar a una gama,restarle un escalar (o restarle una gama a un escalar)y multiplicarlo por el escalar,Octave tratará de evitar desempacar la gama y mantener el resultado como una gama,también,si puede determinar que es seguro hacerlo.Por ejemplo,haciendo
ru: При добавлении скаляра к диапазону,вычитании скаляра из него (или вычитании диапазона из скаляра)и умножении на скаляр Октава попытается избежать распаковки диапазона и сохранить результат в виде диапазона,если сможет определить,что это безопасно.Например,делая
zh_cn: 当向一个范围添加一个标量,从中减去一个标量(或从一个标量中减去一个范围)和乘以标量时,如果Octave能够确定这样做是安全的,它将试图避免解包范围,并将结果也保留为一个范围。例如,做

source: When all dependencies are satisfied, the package&rsquo;s subdirectories are added to the search path.
zh_cn: 当满足所有依赖性时，程序包的子目录将添加到搜索路径。

source: When an error has been handled it is possible to raise it again. This can be useful when an error needs to be detected, but the program should still abort. This is possible using the <code>rethrow</code> function. The previous example can now be changed to count the number of errors related to the &lsquo;
es: Cuando se ha gestionado un error, es posible volver a plantearlo. Esto puede ser &uacute;til cuando es necesario detectar un error, pero el programa a&uacute;n deber&iacute;a abortar. Esto es posible usando la funci&oacute;n de <code>rethrow</code> . El ejemplo anterior ahora se puede cambiar para contar el n&uacute;mero de errores relacionados con el '
ru: Когда ошибка была обработана, ее можно поднять снова. Это может быть полезно, когда необходимо обнаружить ошибку, но программа все равно должна прерваться. Это возможно с <code>rethrow</code> функции переброса . Предыдущий пример теперь можно изменить, чтобы подсчитать количество ошибок, связанных с '
zh_cn: 处理错误后，可以再次引发该错误。当需要检测错误但程序仍应中止时，此功能很有用。使用 <code>rethrow</code> 功能可以做到这一点。现在可以更改前面的示例，以计算与&ldquo;

source: When an error occurs, it can be detected and handled using the <code>try</code> statement as described in <a href="the-try-statement#The-try-Statement">The try Statement</a>. As an example, the following piece of code counts the number of errors that occurs during a <code>for</code> loop.
es: Cuando ocurre un error, puede detectarse y manejarse utilizando la declaraci&oacute;n <code>try</code> como se describe en <a href="the-try-statement#The-try-Statement">La declaraci&oacute;n try</a> . Como ejemplo, el siguiente fragmento de c&oacute;digo cuenta el n&uacute;mero de errores que ocurren durante un ciclo <code>for</code> .
ru: Когда возникает ошибка, ее можно обнаружить и обработать с помощью инструкции <code>try</code> , как описано в инструкции <a href="the-try-statement#The-try-Statement">try</a> . В качестве примера следующий фрагмент кода подсчитывает количество ошибок, возникающих во время цикла <code>for</code> .
zh_cn: 当发生错误时，可以检测并利用处理 <code>try</code> 语句中描述<a href="the-try-statement#The-try-Statement">try语句</a>。例如，以下代码计算了 <code>for</code> 循环期间发生的错误数。

source: When applied to an array (possibly multi-dimensional) with <var>n</var> columns, <var>fcn</var> may return a result in either of two formats: Format 1) an array of size 1-by-<var>n</var>-by-<var>dim3</var>-by-&hellip;-by-<var>dimN</var>. This is the typical output format from Octave core functions. Type <code>demo ("movfun", 5)</code> for an example of this use case. Format 2) a row vector of length <code><var>n</var> * <var>numel_higher_dims</var></code> where <var>numel_higher_dims</var> is <code>prod&nbsp;(size&nbsp;(<var>x</var>)(3:end))</code>. The output of <var>fcn</var> for the i-th input column must be found in the output at indices <code>i:<var>n</var>:(<var>n</var>*<var>numel_higher_dims</var>)</code>. This format is useful when concatenating functions into arrays, or when using <code>nthargout</code>. Type <code>demo ("movfun", 6)</code> for an example of this case.
es: Cuando se aplica a una matriz (posiblemente multidimensional) con <var>n</var> columnas, <var>fcn</var> puede devolver un resultado en cualquiera de estos dos formatos: Formato 1) una matriz de tama&ntilde;o 1-by- <var>n</var> -by- <var>dim3</var> -by-&hellip; -by- <var>dimN</var> . Este es el formato de salida t&iacute;pico de las funciones principales de Octave. Escriba <code>demo ("movfun", 5)</code> para ver un ejemplo de este caso de uso. Formato 2) un vector de fila de longitud <code><var>n</var> * <var>numel_higher_dims</var></code> donde <var>numel_higher_dims</var> es <code>prod&nbsp;(size&nbsp;(<var>x</var>)(3:end))</code> . La salida de <var>fcn</var> para la i-&eacute;sima columna de entrada debe encontrarse en la salida en los &iacute;ndices <code>i:<var>n</var>:(<var>n</var>*<var>numel_higher_dims</var>)</code> . Este formato es &uacute;til cuando se concatenan funciones en matrices o cuando se usa <code>nthargout</code> . Escriba <code>demo ("movfun", 6)</code> para ver un ejemplo de este caso.
ru: При применении к массиву (возможно, многомерному) с <var>n</var> столбцами, <var>fcn</var> может возвращать результат в любом из двух форматов: Формат 1) массив размером 1 на <var>n</var> -by- <var>dim3</var> -by-&hellip; -by- <var>dimN</var> . Это типичный выходной формат для основных функций Octave. Введите <code>demo ("movfun", 5)</code> для примера этого варианта использования. Формат 2) вектор-строка длиной <code><var>n</var> * <var>numel_higher_dims</var></code> где <var>numel_higher_dims</var> - это <code>prod&nbsp;(size&nbsp;(<var>x</var>)(3:end))</code> . Выходные данные <var>fcn</var> для i-го входного столбца должны быть найдены в выходных данных с индексами <code>i:<var>n</var>:(<var>n</var>*<var>numel_higher_dims</var>)</code> . Этот формат полезен при объединении функций в массивы или при использовании <code>nthargout</code> . Для <code>demo ("movfun", 6)</code> .
zh_cn: 当应用于阵列（可能多维的）与 <var>n</var> 列， <var>fcn</var> 格式1）的大小为1逐阵列：可以以两种格式返回结果 <var>n</var> -by- <var>dim3</var> -by- ... -by- <var>dimN</var> 。这是Octave核心功能的典型输出格式。键入 <code>demo ("movfun", 5)</code> 作为该用例的示例。格式2）长度为 <code><var>n</var> * <var>numel_higher_dims</var></code> 的行向量，其中 <var>numel_higher_dims</var> 是 <code>prod&nbsp;(size&nbsp;(<var>x</var>)(3:end))</code> 。第i个输入列的 <var>fcn</var> 输出必须在输出的索引 <code>i:<var>n</var>:(<var>n</var>*<var>numel_higher_dims</var>)</code> 。当将函数连接到数组中或使用 <code>nthargout</code> 时，此格式很有用。键入 <code>demo ("movfun", 6)</code> 作为这种情况的示例。

source: When called from a class constructor, mark the object currently constructed as having a higher precedence than <var>class_name</var>.
es: Cuando se llama desde un constructor de clase, marque el objeto actualmente construido con una precedencia mayor que <var>class_name</var> .
ru: При вызове из конструктора класса пометьте созданный объект как имеющий более высокий приоритет, чем <var>class_name</var> .
zh_cn: 从类构造函数调用时，将当前构造的对象标记为具有比 <var>class_name</var> 更高的优先级。

source: When called from a class constructor, mark the object currently constructed as having a lower precedence than <var>class_name</var>.
es: Cuando se lo llame desde un constructor de clase, marque el objeto actualmente construido con una precedencia menor que <var>class_name</var> .
ru: При вызове из конструктора класса пометьте созданный в настоящее время объект как имеющий более низкий приоритет, чем <var>class_name</var> .
zh_cn: 从类构造函数调用时，将当前构造的对象标记为具有比 <var>class_name</var> 更低的优先级。

source: When called from an m-file function, the error is prefixed with the name of the caller function.
es: Cuando se llama desde una función de archivo m,el error se prefija con el nombre de la función llamadora.
ru: При вызове из функции m-файла ошибка префиксруется именем вызывающей функции.
zh_cn: 当从m-file函数中调用时,错误的前缀是调用者函数的名称。

source: When called from inside a function with the <code>"local"</code> option, the variable is changed locally for the function and any subroutines it calls. The original variable value is restored when exiting the function.
es: Cuando se llama desde dentro de una funci&oacute;n con la opci&oacute;n <code>"local"</code> , la variable se cambia localmente para la funci&oacute;n y cualquier subrutina que llame. El valor de la variable original se restaura al salir de la funci&oacute;n.
ru: При вызове изнутри функции с параметром <code>"local"</code> переменная изменяется локально для функции и любых вызываемых ею подпрограмм. Исходное значение переменной восстанавливается при выходе из функции.
zh_cn: 当使用 <code>"local"</code> 选项从函数内部调用时，该变量及其所调用的任何子例程都会在本地更改。退出函数时，将恢复原始变量值。

source: When called this function returns values like this
es: Cuando se llama esta función devuelve valores como este
ru: При вызове этой функции возвращаются значения типа
zh_cn: 当调用这个函数时,会返回这样的值

source: When called with <code>"KeyType"</code> and <code>"ValueType"</code> arguments, create an empty map with the specified types. The inputs <var>kt</var> and <var>vt</var> are the types for the keys and values of the map respectively. Allowed values for <var>kt</var> are <code>"char"</code>, <code>"double"</code>, <code>"single"</code>, <code>"int32"</code>, <code>"uint32"</code>, <code>"int64"</code>, <code>"uint64"</code>. Allowed values for <var>vt</var> are <code>"any"</code>, <code>"char"</code>, <code>"double"</code>, <code>"single"</code>, <code>"int32"</code>, <code>"uint32"</code>, <code>"int64"</code>, <code>"uint64"</code>, <code>"logical"</code>.
es: Cuando se llama con los <code>"KeyType"</code> y <code>"ValueType"</code> , crea un mapa vac&iacute;o con los tipos especificados. Las entradas <var>kt</var> y <var>vt</var> son los tipos para las claves y valores del mapa respectivamente. Los valores permitidos para <var>kt</var> son <code>"char"</code> , <code>"double"</code> , <code>"single"</code> , <code>"int32"</code> , <code>"uint32"</code> , <code>"int64"</code> , <code>"uint64"</code> . Los valores permitidos para <var>vt</var> son <code>"any"</code> , <code>"char"</code> , <code>"double"</code> , <code>"single"</code> , <code>"int32"</code> , <code>"uint32"</code> , <code>"int64"</code> , <code>"uint64"</code> , <code>"logical"</code> .
ru: При вызове с <code>"KeyType"</code> и <code>"ValueType"</code> создайте пустую карту с указанными типами. <var>kt</var> данные kt и <var>vt</var> являются типами ключей и значений карты соответственно. Допустимые значения для <var>kt</var> : <code>"char"</code> , <code>"double"</code> , <code>"single"</code> , <code>"int32"</code> , <code>"uint32"</code> , <code>"int64"</code> , <code>"uint64"</code> . Допустимые значения для <var>vt</var> : <code>"any"</code> , <code>"char"</code> , <code>"double"</code> , <code>"single"</code> , <code>"int32"</code> , <code>"uint32"</code> , <code>"int64"</code> , <code>"uint64"</code> , <code>"logical"</code> .
zh_cn: 当使用 <code>"KeyType"</code> 和 <code>"ValueType"</code> 参数调用时，创建具有指定类型的空映射。输入 <var>kt</var> 和 <var>vt</var> 分别是映射的键和值的类型。有关允许值， <var>kt</var> 是 <code>"char"</code> ， <code>"double"</code> ， <code>"single"</code> ， <code>"int32"</code> ， <code>"uint32"</code> &ldquo; <code>"int64"</code> ， <code>"uint64"</code> 。有关允许值， <var>vt</var> 是 <code>"any"</code> ， <code>"char"</code> ， <code>"double"</code> ， <code>"single"</code> ， <code>"int32"</code> ， <code>"uint32"</code> ， <code>"int64"</code> ， <code>"uint64"</code> ， <code>"logical"</code> 。

source: When called with a character string <var>name</var>, return the numeric value of errno which corresponds to the specified error code. If <var>name</var> is not a recognized error code then -1 is returned.
es: Cuando se llama con un <var>name</var> cadena de caracteres , devuelve el valor num&eacute;rico de errno que corresponde al c&oacute;digo de error especificado. Si el <var>name</var> no es un c&oacute;digo de error reconocido, se devuelve -1.
ru: При вызове с <var>name</var> строки символов вернуть числовое значение errno, которое соответствует указанному коду ошибки. Если <var>name</var> не является распознанным кодом ошибки, возвращается -1.
zh_cn: 当使用字符串 <var>name</var> 调用时，返回errno的数值，该数值对应于指定的错误代码。如果 <var>name</var> 不是可识别的错误代码，则返回-1。

source: When called with a complex-valued argument, the function <code>f</code> returns the data structure containing the real and imaginary parts of the original function argument.
es: Cuando se llama con un argumento de valor complejo, la funci&oacute;n <code>f</code> devuelve la estructura de datos que contiene las partes real e imaginaria del argumento de la funci&oacute;n original.
ru: При вызове с комплексным аргументом функция <code>f</code> возвращает структуру данных, содержащую действительную и мнимую части исходного аргумента функции.
zh_cn: 当使用复数值参数调用时，函数 <code>f</code> 返回包含原始函数参数的实部和虚部的数据结构。

source: When called with a list of parameter/value pairs, return an options structure with only the named parameters initialized.
es: Cuando se llama con una lista de pares de parámetros/valores,devuelve una estructura de opciones con sólo los parámetros nombrados inicializados.
ru: При вызове со списком пар параметр/значение возвращает структуру опций только с инициализированными именованными параметрами.
zh_cn: 当调用参数/值对列表时,返回一个只初始化了命名参数的选项结构。

source: When called with a numeric input <var>val</var>, set the current value of errno to the specified value. The previous value of errno is returned as <var>err</var>.
es: Cuando se llama con una entrada num&eacute;rica <var>val</var> , establecer el valor actual de errno en el valor especificado. El valor anterior de errno se devuelve como <var>err</var> .
ru: При вызове с числовым входным значением <var>val</var> установите текущее значение errno на указанное значение. Предыдущее значение errno возвращается как <var>err</var> .
zh_cn: 当使用数字输入 <var>val</var> 调用时，将errno的当前值设置为指定值。errno的先前值作为 <var>err</var> 返回。

source: When called with a second output argument, return the handle of the figure containing the object whose callback is currently executing. If no callback is executing the second output is also set to the empty matrix.
es: Cuando se le llame con un segundo argumento de salida,devuelva el "handle" de la figura que contiene el objeto cuya devolución de llamada se está ejecutando actualmente.Si no se está ejecutando ninguna llamada de retorno,la segunda salida también se establece en la matriz vacía.
ru: При вызове со вторым выходным аргументом верните хэндл фигуры,содержащий объект,обратный вызов которого выполняется в данный момент.Если обратный вызов не выполняется,второй вывод также устанавливается в пустую матрицу.
zh_cn: 当调用第二个输出参数时,返回包含当前回调正在执行的对象的图的句柄。如果没有回调在执行,第二个输出也被设置为空矩阵。

source: When called with a single argument <var>h</var> which is a handle to an existing uibuttongroup object, switch the focus to the specified uibuttongroup. This functionality is not currently implemented.
es: Cuando se llama con un solo argumento <var>h</var> , que es un identificador de un objeto uibuttongroup existente, cambie el foco al uibuttongroup especificado. Esta funcionalidad no est&aacute; implementada actualmente.
ru: При вызове с одним аргументом <var>h</var> , который является дескриптором существующего объекта uibuttongroup, переключите фокус на указанную uibuttongroup. Эта функция в настоящее время не реализована.
zh_cn: 当使用单个参数 <var>h</var> (它是现有uibuttongroup对象的句柄）调用时，将焦点切换到指定的uibuttongroup。当前未实现此功能。

source: When called with a single argument <var>h</var> which is a handle to an existing uicontrol object, switch the keyboard focus to the specified uicontrol. As a result, the uicontrol object will receive keyboard events that can be processed using the <code>"keypressfcn"</code> callback.
es: Cuando se llama con un solo argumento <var>h</var> , que es un identificador de un objeto uicontrol existente, cambie el foco del teclado al uicontrol especificado. Como resultado, el objeto uicontrol recibir&aacute; eventos de teclado que se pueden procesar mediante la devoluci&oacute;n de llamada <code>"keypressfcn"</code> .
ru: При вызове с одним аргументом <var>h</var> , который является дескриптором существующего объекта uicontrol, переключите фокус клавиатуры на указанный uicontrol. В результате объект uicontrol получит события клавиатуры, которые могут быть обработаны с помощью обратного вызова <code>"keypressfcn"</code> .
zh_cn: 当使用单个参数 <var>h</var> (它是现有uicontrol对象的句柄）调用时，将键盘焦点切换到指定的uicontrol。结果，uicontrol对象将接收可以使用 <code>"keypressfcn"</code> 回调处理的键盘事件。

source: When called with a single argument <var>x</var> this is equivalent to
es: Cuando se llama con un solo argumento <var>x</var> esto es equivalente a
ru: При вызове с одним аргументом <var>x</var> это эквивалентно
zh_cn: 当使用单个参数 <var>x</var> 调用时，这等效于

source: Uimenu Properties
es: Propiedades de Uimenu
ru: Уимену Свойства

source: W. H. Press, S. A. Teukolsky, W. T. Vetterling, and B. P. Flannery,
es: W.H.Press,S.A.Teukolsky,W.T.Vetterling y B.P.Flannery,
ru: W.Х.Пресс,С.А.Теукольский,В.Т.Веттерлинг и Б.П.Фланнери,

source: WNOHANG ()
ru: ХОЧЕТ

source: WUNTRACED ()
ru: ВЫНТРАХОВАННЫЙ ()

source: When called with a single argument, return a square matrix with the dimension specified.
es: Cuando se llama con un solo argumento,devuelve una matriz cuadrada con la dimensión especificada.
