Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/octave/octave.*.020.xlf
Languages: es, ru, zh_cn

source: Transparency is not yet implemented for patch objects. <code>alphadatamapping</code> is unused.
es: La transparencia a&uacute;n no est&aacute; implementada para los objetos de parche. <code>alphadatamapping</code> no se utiliza.
ru: Прозрачность еще не реализована для объектов заплат. <code>alphadatamapping</code> не используется.
zh_cn: 修补程序对象尚未实现透明性。 <code>alphadatamapping</code> 未使用。

source: Transparency is not yet implemented for patch objects. <code>edgealpha</code> is unused.
es: La transparencia a&uacute;n no est&aacute; implementada para los objetos de parche. <code>edgealpha</code> no se utiliza.
ru: Прозрачность еще не реализована для объектов заплат. <code>edgealpha</code> не используется.
zh_cn: 修补程序对象尚未实现透明性。 <code>edgealpha</code> 未使用。

source: Transparency is not yet implemented for patch objects. <code>facevertexalphadata</code> is unused.
es: La transparencia a&uacute;n no est&aacute; implementada para los objetos de parche. <code>facevertexalphadata</code> no se utiliza.
ru: Прозрачность еще не реализована для объектов заплат. <code>facevertexalphadata</code> не используется.
zh_cn: 修补程序对象尚未实现透明性。 <code>facevertexalphadata</code> 未使用。

source: Transparency is not yet implemented for surface objects. <code>alphadata</code> is unused.
es: La transparencia a&uacute;n no est&aacute; implementada para los objetos de superficie. <code>alphadata</code> no se utiliza.
ru: Для поверхностных объектов прозрачность еще не реализована. <code>alphadata</code> не используется.
zh_cn: 尚未为表面对象实现透明度。 <code>alphadata</code> 未使用。

source: Transparency is not yet implemented for surface objects. <code>alphadatamapping</code> is unused.
es: La transparencia a&uacute;n no est&aacute; implementada para los objetos de superficie. <code>alphadatamapping</code> no se utiliza.
ru: Для поверхностных объектов прозрачность еще не реализована. <code>alphadatamapping</code> не используется.
zh_cn: 尚未为表面对象实现透明度。 <code>alphadatamapping</code> 未使用。

source: Transparency is not yet implemented for surface objects. <code>edgealpha</code> is unused.
es: La transparencia a&uacute;n no est&aacute; implementada para los objetos de superficie. <code>edgealpha</code> no se utiliza.
ru: Для поверхностных объектов прозрачность еще не реализована. <code>edgealpha</code> не используется.
zh_cn: 尚未为表面对象实现透明度。 <code>edgealpha</code> 未使用。

source: Transparency level of the faces of the patch object. Only double values are supported at present where a value of 0 means complete transparency and a value of 1 means solid faces without transparency. Setting the property to <code>"flat"</code> or <code>"interp"</code> causes the faces to not being rendered. Additionally, the faces are not sorted from back to front which might lead to unexpected results when rendering layered transparent faces.
es: Nivel de transparencia de las caras del objeto de parche. En la actualidad, solo se admiten valores dobles, donde un valor de 0 significa transparencia completa y un valor de 1 significa caras s&oacute;lidas sin transparencia. Establecer la propiedad en <code>"flat"</code> o <code>"interp"</code> hace que las caras no se rendericen. Adem&aacute;s, las caras no se ordenan de atr&aacute;s hacia adelante, lo que puede dar lugar a resultados inesperados al renderizar caras transparentes en capas.
ru: Уровень прозрачности граней патч-объекта. В настоящее время поддерживаются только двойные значения, где значение 0 означает полную прозрачность, а значение 1 означает твердые грани без прозрачности. Если <code>"interp"</code> для свойства значение <code>"flat"</code> или &laquo;interp&raquo;, грани не будут отображаться. Кроме того, грани не сортируются спереди назад, что может привести к неожиданным результатам при рендеринге многослойных прозрачных граней.
zh_cn: 补丁对象的面的透明度级别。当前仅支持双精度值，其中0表示完全透明，而1表示没有透明的实体面。将属性设置为 <code>"flat"</code> 或 <code>"interp"</code> 会导致不渲染面。此外，这些面未从背面到正面进行排序，这在渲染分层透明面时可能会导致意外结果。

source: Transparency level of the faces of the surface object. Only double values are supported at present where a value of 0 means complete transparency and a value of 1 means solid faces without transparency. Setting the property to <code>"flat"</code>, <code>"interp"</code> or <code>"texturemap"</code> causes the faces to not being rendered. Additionally, the faces are not sorted from back to front which might lead to unexpected results when rendering layered transparent faces.
es: Nivel de transparencia de las caras del objeto de superficie. En la actualidad, solo se admiten valores dobles, donde un valor de 0 significa transparencia completa y un valor de 1 significa caras s&oacute;lidas sin transparencia. Establecer la propiedad en <code>"flat"</code> , <code>"interp"</code> o <code>"texturemap"</code> hace que las caras no se rendericen. Adem&aacute;s, las caras no se ordenan de atr&aacute;s hacia adelante, lo que puede dar lugar a resultados inesperados al renderizar caras transparentes en capas.
ru: Уровень прозрачности граней поверхностного объекта. В настоящее время поддерживаются только двойные значения, где значение 0 означает полную прозрачность, а значение 1 означает твердые грани без прозрачности. Установка для свойства значения <code>"flat"</code> , <code>"interp"</code> или <code>"texturemap"</code> приводит к тому, что грани не отображаются. Кроме того, грани не сортируются спереди назад, что может привести к неожиданным результатам при рендеринге многослойных прозрачных граней.
zh_cn: 曲面对象的面的透明度级别。当前仅支持双精度值，其中0表示完全透明，而1表示没有透明的实体面。将属性设置为 <code>"flat"</code> ， <code>"interp"</code> 或 <code>"texturemap"</code> 会导致不渲染面。此外，这些面未从背面到正面进行排序，这在渲染分层透明面时可能会导致意外结果。

source: Treat a series of consecutive delimiters, without whitespace in between, as a single delimiter. Consecutive delimiter series need not be vertically <code>"aligned"</code>.
es: Trate una serie de delimitadores consecutivos, sin espacios en blanco entre ellos, como un solo delimitador. Las series de delimitadores consecutivos no necesitan estar <code>"aligned"</code> verticalmente .
ru: Считайте серию последовательных разделителей без пробелов между ними как один разделитель. Последовательные серии разделителей не должны быть <code>"aligned"</code> вертикали .
zh_cn: 将一系列连续的定界符（之间没有空格）视为单个定界符。连续定界符序列不必垂直 <code>"aligned"</code> 。

source: Treat single occurrences (surrounded by delimiters or whitespace) of the string(s) in <var>value</var> as missing values.
es: Trate las apariciones &uacute;nicas (rodeadas por delimitadores o espacios en blanco) de las cadenas en <var>value</var> como valores perdidos.
ru: Обрабатывать отдельные вхождения (окруженные разделителями или пробелами) строки (строк) в <var>value</var> как отсутствующие значения.
zh_cn: 治疗单个出现的串（一个或多个）的在（由分隔符或空格包围） <var>value</var> 作为缺失值。

source: Triangular factor R from the QR decomposition.
es: El factor triangular R de la descomposición QR.
ru: Треугольный коэффициент R от QR-разложения.
zh_cn: 三角因子R从QR分解。

source: True and false values are assigned a value of 0 and 1 respectively.
es: A los valores verdadero y falso se les asigna un valor de 0 y 1 respectivamente.
ru: Значения True и false присваиваются значениям 0 и 1 соответственно.
zh_cn: 真值和假值分别赋予0和1的值。

source: True for characters that are alphabetic (letters).
es: Cierto para los caracteres que son alfabéticos (letras).
ru: Верно для символов,которые являются алфавитными (буквенными).
zh_cn: 字母(字母)的字符为真。

source: True for characters that are alphabetic or digits.
es: Cierto para los caracteres que son alfabéticos o dígitos.
ru: Верно для буквенных или цифровых символов.
zh_cn: 对于字母或数字的字符为真。

source: True for characters that are in the range of ASCII encoding.
es: Cierto para los caracteres que están en el rango de la codificación ASCII.
ru: Истина для символов,находящихся в диапазоне кодировки ASCII.
zh_cn: 对于ASCII编码范围内的字符为真。

source: True for control characters.
es: Cierto para los personajes de control.
ru: Верно для управляющих символов.
zh_cn: 控制字符为真。

source: True for decimal digits (0-9).
es: Verdadero para los dígitos decimales (0-9).
ru: Верно для десятичных цифр (0-9).
zh_cn: 对十进制数字(0-9)为真。

source: True for hexadecimal digits (a-fA-F0-9).
es: Cierto para los dígitos hexadecimales (a-fA-F0-9).
ru: Верно для шестнадцатеричных цифр (a-fA-F0-9).
zh_cn: 对于十六进制数字(a-fA-F0-9)为真。

source: True for lowercase letters.
es: Cierto para las minúsculas.
ru: Верно для строчных букв.
zh_cn: 小写字母为真。

source: True for printing characters except space.
es: Cierto para los caracteres de impresión,excepto el espacio.
ru: Верно для печати символов за исключением пробела.
zh_cn: 打印除空格以外的字符时为真。

source: True for printing characters including space.
es: Cierto para imprimir caracteres incluyendo el espacio.
ru: Верно для печати символов,включая пробел.
zh_cn: 打印包括空格在内的字符为真。

source: True for punctuation characters (printing characters except space or letter or digit).
es: Cierto para los caracteres de puntuación (caracteres de impresión excepto el espacio o la letra o el dígito).
ru: Истина для знаков препинания (печатающих символы,кроме пробела,буквы или цифры).
zh_cn: 标点符号为真(打印除空格、字母或数字以外的字符)。

source: True for uppercase letters.
es: Cierto para las mayúsculas.
ru: Верно для заглавных букв.
zh_cn: 大写字母为真。

source: True for whitespace characters (space, formfeed, newline, carriage return, tab, vertical tab).
es: Cierto para los caracteres de espacio en blanco (espacio,avance de forma,nueva línea,retorno de carro,tabulación,tabulación vertical).
ru: Истина для пробельных символов (пробел,форма подачи,новая строка,возврат каретки,табуляция,вертикальная табуляция).
zh_cn: 对于空白字符(空格、换行、换行、回车、制表符、垂直制表符)为真。

source: True if <var>file</var> is a directory.
es: Verdadero si el <var>file</var> es un directorio.
ru: Истинно, если <var>file</var> является каталогом.
zh_cn: 如果 <var>file</var> 是目录，则为True 。

source: True if <var>file</var> is a hidden file (Windows).
es: Verdadero si el <var>file</var> es un archivo oculto (Windows).
ru: Истинно, если <var>file</var> является скрытым (Windows).
zh_cn: 如果 <var>file</var> 是隐藏文件，则为True （Windows）。

source: True if <var>file</var> is a system file (Windows).
es: Verdadero si el <var>file</var> es un archivo del sistema (Windows).
ru: Истинно, если <var>file</var> является системным (Windows).
zh_cn: 如果 <var>file</var> 是系统文件（Windows），则为true 。

source: True if <var>file</var> is an archive (Windows).
es: Verdadero si el <var>file</var> es un archivo (Windows).
ru: Истинно, если <var>file</var> является архивом (Windows).
zh_cn: 如果 <var>file</var> 是存档，则为True （Windows）。

source: True if <var>x</var> is equal to <var>y</var>.
es: Verdadero si <var>x</var> es igual <var>y</var> .
ru: Истинно, если <var>x</var> равно <var>y</var> .
zh_cn: 如果 <var>x</var> 等于 <var>y</var> ,则为true 。

source: True if <var>x</var> is greater than <var>y</var>.
es: Verdadero si <var>x</var> es mayor que <var>y</var> .
ru: Истинно, если <var>x</var> больше <var>y</var> .
zh_cn: 如果 <var>x</var> 大于 <var>y</var> ,则为true 。

source: True if <var>x</var> is greater than or equal to <var>y</var>.
es: Verdadero si <var>x</var> es mayor o igual que <var>y</var> .
ru: Истинно, если <var>x</var> больше или равно <var>y</var> .
zh_cn: 如果 <var>x</var> 大于或等于 <var>y</var> ,则为true 。

source: True if <var>x</var> is less than <var>y</var>.
es: Verdadero si <var>x</var> es menor que <var>y</var> .
ru: Истинно, если <var>x</var> меньше <var>y</var> .
zh_cn: 如果 <var>x</var> 小于 <var>y</var> ,则为true 。

source: True if <var>x</var> is less than or equal to <var>y</var>.
es: Verdadero si <var>x</var> es menor o igual que <var>y</var> .
ru: Истинно, если <var>x</var> меньше или равно <var>y</var> .
zh_cn: 如果 <var>x</var> 小于或等于 <var>y</var> ,则为true 。

source: True if <var>x</var> is not equal to <var>y</var>.
es: Verdadero si <var>x</var> no es igual <var>y</var> .
ru: Истинно, если <var>x</var> не равно <var>y</var> .
zh_cn: 如果 <var>x</var> 不等于 <var>y</var> ,则为true 。

source: True if name is a directory.
es: Cierto si el nombre es un directorio.
ru: Правда,если имя каталога.
zh_cn: 如果名字是一个目录,则为真。

source: True if the user (group; other users) has execute permission for <var>file</var>.
es: Verdadero si el usuario (grupo; otros usuarios) tiene permiso de ejecuci&oacute;n para el <var>file</var> .
ru: Истинно, если у пользователя (группы; других пользователей) есть разрешение на выполнение <var>file</var> .
zh_cn: 如果用户（组；其他用户）具有 <var>file</var> 的执行权限，则为true 。

source: True if the user (group; other users) has read permission for <var>file</var>.
es: Verdadero si el usuario (grupo; otros usuarios) tiene permiso de lectura para el <var>file</var> .
ru: Истинно, если у пользователя (группы; других пользователей) есть разрешение на чтение <var>file</var> .
zh_cn: 如果用户（组；其他用户）具有 <var>file</var> 的读取权限，则为true 。

source: True if the user (group; other users) has write permission for <var>file</var>.
es: Verdadero si el usuario (grupo; otros usuarios) tiene permiso de escritura para el <var>file</var> .
ru: Истинно, если пользователь (группа; другие пользователи) имеет разрешение на запись в <var>file</var> .
zh_cn: 如果用户（组；其他用户）具有 <var>file</var> 的写许可权，则为true 。

source: Truncate fractional portion of <var>x</var> and return the integer portion.
es: Truncar la parte fraccionaria de <var>x</var> y devolver la parte entera.
ru: Обрезать дробную часть <var>x</var> и вернуть целую часть.
zh_cn: 截断 <var>x</var> 的小数部分，然后返回整数部分。

source: Truncate the character string <var>s</var> to length <var>n</var>.
es: Truncar la cadena de caracteres <var>s</var> a la longitud <var>n</var> .
ru: Усечь строку символов <var>s</var> до длины <var>n</var> .
zh_cn: 将字符串 <var>s</var> 截短为长度 <var>n</var> 。

source: Try <code>demo humps</code> to see a plot of the <code>humps</code> function.
es: Pruebe las <code>demo humps</code> para ver un diagrama de la funci&oacute;n <code>humps</code> .
ru: Попробуйте <code>demo humps</code> , чтобы увидеть график <code>humps</code> функции.
zh_cn: 尝试 <code>demo humps</code> 以查看 <code>humps</code> 函数的图。

source: Try to make your bug report self-contained. If we have to ask you for more information, it is best if you include all the previous information in your response, as well as the information that was missing.
es: Intenta que tu informe de errores sea autónomo.Si tenemos que pedirle más información,es mejor que incluya toda la información anterior en su respuesta,así como la información que faltaba.
ru: Постарайся сделать свой отчет об ошибке самодостаточным.Если нам нужно запросить у вас дополнительную информацию,лучше всего включить в ответ всю предыдущую информацию,а также информацию,которая отсутствовала.
zh_cn: 尽量让你的错误报告自成一体。如果我们不得不要求你提供更多的信息,你最好在回复中包含之前所有的信息,以及缺少的信息。

source: Turn off linking
es: Apaga la conexión
ru: Выключить связь
zh_cn: 关闭链接

source: Turn on verbose output.
es: Enciende la salida verbosa.
ru: Включите многословный выход.
zh_cn: 开启verbose输出。

source: Turn output pagination on or off.
es: Activar o desactivar la paginación de salida.
ru: Включить или выключить пагинацию выхода.
zh_cn: 打开或关闭输出分页。

source: Turn tick labels off for all axes.
es: Apaga las etiquetas de las marcas de todos los ejes.
ru: Отключите наклейки с галочкой для всех осей.
zh_cn: 关闭所有轴的"√"标签。

source: Turn tick labels on for all axes, or turn them on for the specified axes and off for the remainder.
es: Ponga las etiquetas de las marcas en todos los ejes,o póngalas en los ejes especificados y apáguelas en los restantes.
ru: Включите галочки для всех осей или включите их для указанных осей и выключите для остальных.
zh_cn: 为所有轴打开"√"标签,或为指定的轴打开"√"标签,为其余轴关闭"√"标签。

source: Turn tick marks on for all axes, or turn them on for the specified axes and off for the remainder.
es: Encienda las marcas para todos los ejes,o enciéndalas para los ejes especificados y apáguelas para el resto.
ru: Включите галочки для всех осей или включите их для указанных осей и выключите для остальных.
zh_cn: 将所有轴的刻度线打开,或者将指定轴的刻度线打开,其余轴的刻度线关闭。

source: Turn warnings identified by <var>id</var> into errors and optionally return their previous state <var>stout</var>.
es: Convierta las advertencias identificadas por <var>id</var> en errores y, opcionalmente, devuelva su estado anterior <var>stout</var> .
ru: Включите предупреждения , выявленные <var>id</var> на ошибки и , возможно , вернуть свое прежнее состояние <var>stout</var> .
zh_cn: 将 <var>id</var> 标识的警告转换为错误，并可以选择返回其先前的状态 <var>stout</var> 。

source: Two different <var>style</var>s are available for displaying the <var>cmap</var>:
es: Hay dos <var>style</var> diferentes disponibles para mostrar el <var>cmap</var> :
ru: Для отображения <var>cmap</var> доступны два разных <var>style</var> :
zh_cn: 可以使用两种不同的 <var>style</var> 来显示 <var>cmap</var> ：

source: Two element range
es: Rango de dos elementos
ru: Двухэлементный диапазон
zh_cn: 双元素范围

source: Two permutation matrices can be multiplied or divided (if their sizes match), performing a composition of permutations. Also a permutation matrix can be indexed by a permutation vector (or two vectors), giving again a permutation matrix. Any other operations do not generally yield a permutation matrix and will thus trigger the implicit conversion.
es: Dos matrices de permutación pueden multiplicarse o dividirse (si sus tamaños coinciden),realizando una composición de permutaciones.También una matriz de permutación puede ser indexada por un vector de permutación (o dos vectores),dando de nuevo una matriz de permutación.Cualquier otra operación no suele dar lugar a una matriz de permutación y,por lo tanto,desencadenará la conversión implícita.
ru: Две матрицы перестановок могут быть умножены или разделены (если их размеры совпадают),выполняя композицию перестановок.Также матрица перестановки может быть проиндексирована по вектору перестановки (или по двум векторам),вновь давая матрицу перестановки.Любые другие операции,как правило,не дают матрицы перестановки и,таким образом,вызывают неявное преобразование.
zh_cn: 两个换元矩阵可以相乘或相除(如果它们的大小匹配),进行换元组合。也可以用一个换元向量(或两个向量)对换元矩阵进行索引,再次得到一个换元矩阵。其他任何操作一般都不会得到一个换元矩阵,因此会触发隐式转换。

source: Two-Dimensional Plots
es: Gráficas bidimensionales
ru: Двухмерные сюжеты
zh_cn: 二维平面图

source: Two-digit year
es: Un año de dos dígitos
ru: двузначный год
zh_cn: 两位数年份

source: Two-dimensional Function Plotting
es: Trazado de funciones bidimensionales
ru: Двухмерное функциональное построение
zh_cn: 二维函数绘图

source: Two-dimensional Geometric Shapes
es: Formas geométricas bidimensionales
ru: Двумерные геометрические формы
zh_cn: 二维几何图形

source: Two-dimensional interpolation.
es: Interpolación bidimensional.
ru: Двухмерная интерполяция.
zh_cn: 二维插值。

source: Two-element vector <code>[2Dlen 3Dlen]</code> specifying the length of the tickmarks relative to the longest visible axis.
es: Vector de dos elementos <code>[2Dlen 3Dlen]</code> que especifica la longitud de las marcas de graduaci&oacute;n en relaci&oacute;n con el eje visible m&aacute;s largo.
ru: <code>[2Dlen 3Dlen]</code> вектор [2Dlen 3Dlen], определяющий длину отметок относительно самой длинной видимой оси.
zh_cn: 两元素矢量 <code>[2Dlen 3Dlen]</code> ,用于指定刻度线相对于最长可见轴的长度。

source: Two-element vector <code>[azimuth elevation]</code> specifying the viewpoint for three-dimensional plots
es: Vector de dos elementos <code>[azimuth elevation]</code> especifica el punto de vista para gr&aacute;ficos tridimensionales
ru: Двухэлементный вектор <code>[azimuth elevation]</code> определяющий точку обзора для трехмерных графиков.
zh_cn: 为三维图指定视点的两元素矢量 <code>[azimuth elevation]</code>

source: Two-element vector <code>[xfirst xlast]</code> specifying the x coordinates of the centers of the first and last columns of the image.
es: Vector de dos elementos <code>[xfirst xlast]</code> que especifica las coordenadas x de los centros de la primera y &uacute;ltima columna de la imagen.
ru: <code>[xfirst xlast]</code> вектор [xfirst xlast], определяющий координаты x центров первого и последнего столбцов изображения.
zh_cn: 两元素矢量 <code>[xfirst xlast]</code> ,指定图像的第一列和最后一列的中心的x坐标。

source: Two-element vector <code>[xmin xmax]</code> specifying the limits for the x-axis. Setting <code>xlim</code> also forces the <code>xlimmode</code> property to be set to <code>"manual"</code>. See <a href="axis-configuration#XREFxlim">xlim function</a>.
es: Vector de dos elementos <code>[xmin xmax]</code> que especifica los l&iacute;mites para el eje x. Establecer <code>xlim</code> tambi&eacute;n obliga a que la propiedad <code>xlimmode</code> se establezca en <code>"manual"</code> . Ver <a href="axis-configuration#XREFxlim">funci&oacute;n xlim</a> .
ru: Двухэлементный вектор <code>[xmin xmax]</code> , определяющий пределы для оси x. Установка <code>xlim</code> также <code>xlimmode</code> к тому, что для свойства xlimmode устанавливается значение <code>"manual"</code> . См. <a href="axis-configuration#XREFxlim">Функцию xlim</a> .
zh_cn: 两元素矢量 <code>[xmin xmax]</code> ,指定x轴的极限。设置 <code>xlim</code> 也会强制将 <code>xlimmode</code> 属性设置为 <code>"manual"</code> 。请参阅<a href="axis-configuration#XREFxlim">xlim函数</a>。

source: Two-element vector <code>[yfirst ylast]</code> specifying the y coordinates of the centers of the first and last rows of the image.
es: Vector de dos elementos <code>[yfirst ylast]</code> que especifica las coordenadas y de los centros de la primera y &uacute;ltima fila de la imagen.
ru: <code>[yfirst ylast]</code> вектор [yfirst ylast], определяющий координаты y центров первой и последней строк изображения.
zh_cn: 两元素矢量 <code>[yfirst ylast]</code> 指定图像第一行和最后一行的中心的y坐标。

source: Two-element vector <code>[ymin ymax]</code> specifying the limits for the y-axis. Setting <code>ylim</code> also forces the <code>ylimmode</code> property to be set to <code>"manual"</code>. See <a href="axis-configuration#XREFylim">ylim function</a>.
es: Vector de dos elementos <code>[ymin ymax]</code> que especifica los l&iacute;mites para el eje y. Establecer <code>ylim</code> tambi&eacute;n obliga a que la propiedad <code>ylimmode</code> se establezca en <code>"manual"</code> . Ver <a href="axis-configuration#XREFylim">funci&oacute;n ylim</a> .
ru: <code>[ymin ymax]</code> вектор [ymin ymax], определяющий пределы для оси y. Установка <code>ylim</code> также <code>ylimmode</code> к тому, что для свойства ylimmode устанавливается значение <code>"manual"</code> . См. <a href="axis-configuration#XREFylim">Функцию ylim</a> .
zh_cn: 两元素矢量 <code>[ymin ymax]</code> ,指定y轴的极限。设置 <code>ylim</code> 还可以将 <code>ylimmode</code> 属性强制设置为 <code>"manual"</code> 。参见<a href="axis-configuration#XREFylim">ylim函数</a>。

source: Two-element vector <code>[zmin zmaz]</code> specifying the limits for the z-axis. Setting <code>zlim</code> also forces the <code>zlimmode</code> property to be set to <code>"manual"</code>. See <a href="axis-configuration#XREFzlim">zlim function</a>.
es: Vector de dos elementos <code>[zmin zmaz]</code> que especifica los l&iacute;mites para el eje z. La configuraci&oacute;n de <code>zlim</code> tambi&eacute;n obliga a que la propiedad <code>zlimmode</code> se establezca en <code>"manual"</code> . Ver <a href="axis-configuration#XREFzlim">funci&oacute;n zlim</a> .
ru: <code>[zmin zmaz]</code> вектор [zmin zmaz], определяющий пределы для оси z. Установка <code>zlim</code> также <code>zlimmode</code> к тому, что для свойства zlimmode устанавливается значение <code>"manual"</code> . См. <a href="axis-configuration#XREFzlim">Функцию zlim</a> .
zh_cn: 两元素矢量 <code>[zmin zmaz]</code> ,用于指定z轴的限制。设置 <code>zlim</code> 也会强制将 <code>zlimmode</code> 属性设置为 <code>"manual"</code> 。请参阅<a href="axis-configuration#XREFzlim">zlim函数</a>。
