Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/octave/octave.*.020.xlf
Languages: es, ru, zh_cn

source: This value determines whether the editor should be started in async mode (editor is started in the background and Octave continues) or sync mode (Octave waits until the editor exits). Set it to <code>"sync"</code> to start the editor in sync mode. The default is <code>"async"</code> (see <a href="controlling-subprocesses#XREFsystem">system</a>).
es: Este valor determina si el editor debe iniciarse en modo as&iacute;ncrono (el editor se inicia en segundo plano y Octave contin&uacute;a) o en modo sincronizado (Octave espera hasta que el editor salga). Config&uacute;relo en <code>"sync"</code> para iniciar el editor en modo de sincronizaci&oacute;n. El valor predeterminado es <code>"async"</code> (ver <a href="controlling-subprocesses#XREFsystem">sistema</a> ).
ru: Это значение определяет, следует ли запускать редактор в асинхронном режиме (редактор запускается в фоновом режиме, а Octave продолжается) или в режиме синхронизации (Octave ожидает выхода редактора). Установите для него значение <code>"sync"</code> чтобы запустить редактор в режиме синхронизации. По умолчанию используется <code>"async"</code> (см. <a href="controlling-subprocesses#XREFsystem">Систему</a> ).
zh_cn: 此值确定是在异步模式下启动编辑器（编辑器在后台启动，八度继续）还是在同步模式下（八度等待直到编辑器退出）。将其设置为 <code>"sync"</code> 以在同步模式下启动编辑器。默认值为 <code>"async"</code> （请参阅<a href="controlling-subprocesses#XREFsystem">system</a>）。

source: This value indicates a directory that system m-files should be copied into before opening them in the editor. The intent is that this directory is also in the path, so that the edited copy of a system function file shadows the original. This setting only has an effect when &lsquo;
zh_cn: 此值指示在编辑器中打开系统m文件之前应将其复制到的目录。目的是该目录也位于路径中，因此系统功能文件的编辑副本会遮盖原始目录。此设置仅在&ldquo;

source: This will also inhibit printing of the normal traceback message (you will only see the top-level error message).
es: Esto también inhibirá la impresión del mensaje de rastreo normal (sólo verá el mensaje de error de nivel superior).
ru: Это также заблокирует печать обычного сообщения об обратной связи (вы увидите только сообщение об ошибке верхнего уровня).
zh_cn: 这也将禁止打印正常的回溯信息(你将只看到顶层的错误信息)。

source: This will be faster than using <code>regexp</code> in most cases.
zh_cn: 在大多数情况下，这将比使用 <code>regexp</code> 更快。

source: This will be faster than using regexp in most cases.
es: Esto será más rápido que el uso de regexp en la mayoría de los casos.
ru: Это будет быстрее,чем использование регэкспо в большинстве случаев.
zh_cn: 这在大多数情况下会比使用regexp快。

source: This will be stored as three vectors <var>cidx</var>, <var>ridx</var> and <var>data</var>, representing the column indexing, row indexing and data respectively. The contents of these three vectors for the above matrix will be
es: Esto se almacenar&aacute; como tres vectores <var>cidx</var> , <var>ridx</var> y <var>data</var> , que representan la indexaci&oacute;n de columnas, la indexaci&oacute;n de filas y los datos respectivamente. El contenido de estos tres vectores para la matriz anterior ser&aacute;
ru: Он будет сохранен в виде трех векторов <var>cidx</var> , <var>ridx</var> и <var>data</var> , представляющих индексирование столбцов, индексирование строк и данные соответственно. Содержимое этих трех векторов для указанной выше матрицы будет
zh_cn: 这将被存储为三个向量 <var>cidx</var> ， <var>ridx</var> 和 <var>data</var> ，分别代表列索引，行索引和数据。上面矩阵的这三个向量的内容将是

source: This will create a file called
es: Esto creará un archivo llamado
ru: В результате будет создан файл с именем
zh_cn: 这将创建一个名为

source: This will install a copy of Octave, its libraries, and its documentation in the destination directory. As distributed, Octave is installed in the following directories. In the table below, <var>prefix</var> defaults to
es: Esto instalar&aacute; una copia de Octave, sus bibliotecas y su documentaci&oacute;n en el directorio de destino. Tal como se distribuye, Octave se instala en los siguientes directorios. En la siguiente tabla, el <var>prefix</var> predeterminado es
ru: Это установит копию Octave, ее библиотеки и документацию в целевой каталог. При распространении Octave устанавливается в следующие каталоги. В приведенной ниже таблице <var>prefix</var> умолчанию является
zh_cn: 这将在目标目录中安装Octave的副本，其库及其文档。分发后，Octave安装在以下目录中。在下表中， <var>prefix</var> 默认为

source: This will plot the cosine and sine functions and label them accordingly in the legend.
es: Esto trazará las funciones del coseno y el seno y las etiquetará de acuerdo con la leyenda.
ru: При этом косинусные и синусовые функции будут сконструированы и помечены соответствующим образом в легенде.
zh_cn: 这将绘制余弦和正弦函数,并在图例中进行相应的标注。

source: This will produce an error about nonconformant arguments.
es: Esto producirá un error sobre los argumentos no conformes.
ru: Это приведет к ошибке о несоответствующих аргументах.
zh_cn: 这将产生一个关于不符合要求的参数的错误。

source: This workaround description will not appear when listing functions in the package with <code>pkg describe</code> but they will be published in the HTML documentation online. Workaround descriptions can use any HTML markup, but keep in mind that it will be enclosed in a bold-italic environment. For the special case of:
es: Esta descripci&oacute;n de la soluci&oacute;n alternativa no aparecer&aacute; cuando se enumeren las funciones en el paquete con <code>pkg describe</code> , pero se publicar&aacute;n en la documentaci&oacute;n HTML en l&iacute;nea. Las descripciones de soluciones alternativas pueden usar cualquier marcado HTML, pero tenga en cuenta que se incluir&aacute; en un entorno en negrita y cursiva. Para el caso especial de:
ru: Это описание обходного пути не будет отображаться при перечислении функций в пакете с помощью <code>pkg describe</code> , но они будут опубликованы в онлайн-документации HTML. В описаниях обходных путей можно использовать любую разметку HTML, но имейте в виду, что они будут выделены полужирным курсивом. Для особого случая:
zh_cn: 当在带有 <code>pkg describe</code> 的软件包中列出函数时，不会出现此解决方法描述，但它们将在线发布在HTML文档中。解决方法说明可以使用任何HTML标记，但请记住，它将被包含在粗体斜体环境中。对于特殊情况：

source: This works well as long as it is acceptable to have the name of the variable (or &lsquo;
es: Esto funciona bien siempre que sea aceptable tener el nombre de la variable (o '
ru: Это работает хорошо, если допустимо иметь имя переменной (или '
zh_cn: 只要可以接受变量名称（或'

source: Three element range
es: Rango de tres elementos
ru: Трехэлементный диапазон
zh_cn: 三要素范围

source: Three functions are available for setting and determining the position of the file pointer for a given file.
es: Se dispone de tres funciones para establecer y determinar la posición del puntero de un archivo determinado.
ru: Для настройки и определения положения указателя на файл для данного файла доступны три функции.
zh_cn: 有三个函数可用于设置和确定给定文件的文件指针的位置。

source: Three-Dimensional Plots
es: Gráficas tridimensionales
ru: Трехмерные сюжеты
zh_cn: 三维平面图

source: Three-dimensional Function Plotting
es: Trazado de funciones tridimensionales
ru: Трехмерное построение функций
zh_cn: 三维函数绘图

source: Three-dimensional Geometric Shapes
es: Formas geométricas tridimensionales
ru: Трехмерные геометрические формы
zh_cn: 三维几何图形

source: Three-dimensional interpolation.
es: Interpolación tridimensional.
ru: Трехмерная интерполяция.
zh_cn: 三维插值。

source: Thus, for example:
es: Así,por ejemplo:
ru: Так,например:
zh_cn: 因此,例如:

source: Tilde expansion is performed on each of the patterns before looking for matching filenames. For example:
es: La expansión de la tilde se realiza en cada uno de los patrones antes de buscar nombres de archivo que coincidan.Por ejemplo:
ru: Расширение тильды выполняется на каждой из деталей перед поиском совпадений имен.Например:
zh_cn: 在寻找匹配的文件名之前,会对每个模式进行Tilde扩展。例如:

source: Time (in seconds) used for solving LP/MIP problem.
es: Tiempo (en segundos)utilizado para resolver el problema de LP/MIP.
ru: Время (в секундах),используемое для решения проблемы LP/MIP.
zh_cn: 用于解决LP/MIP问题的时间(秒)。

source: Time Series: Theory and Methods
es: Serie de tiempo:Teoría y métodos
ru: Временная серия:Теория и методы
zh_cn: 时间序列。时间序列:理论和方法

source: Time fields:
es: Campos de tiempo:
ru: Временные поля:
zh_cn: 时间领域:

source: Time in 1/100ths of a second (0 to 65535) which must expire before displaying the next image in an animated sequence.
es: Tiempo en 1/100 de segundo (0 a 65535)que debe expirar antes de mostrar la siguiente imagen en una secuencia animada.
ru: Время в 1/100 секунды (от 0 до 65535),которое должно истечь,прежде чем будет показано следующее изображение в анимированной последовательности.
zh_cn: 以1/100秒为单位的时间(0到65535),在动画序列中显示下一个图像之前必须过期。

source: Time in seconds since 00:00:00, Jan 1, 1970 (a nonstandard extension).
es: Tiempo en segundos desde las 00:00:00 del 1 de enero de 1970 (una extensión no estándar).
ru: Время в секундах с 00:00:00,1 января 1970 года (нестандартное расширение).
zh_cn: 自1970年1月1日00:00:00起,时间以秒为单位(非标准扩展)。

source: Time limit exhausted.
es: Límite de tiempo agotado.
ru: Время истекло.
zh_cn: 时限已尽。

source: Time of last access in the same form as time values returned from <code>time</code>. See <a href="timing-utilities#Timing-Utilities">Timing Utilities</a>.
es: Hora del &uacute;ltimo acceso en la misma forma que los valores de hora devueltos desde la <code>time</code> . Consulte <a href="timing-utilities#Timing-Utilities">Utilidades de temporizaci&oacute;n</a> .
ru: Время последнего доступа в той же форме, что и значения времени, возвращенные из <code>time</code> . См. <a href="timing-utilities#Timing-Utilities">Утилиты синхронизации</a> .
zh_cn: 上次访问的时间，其格式与从 <code>time</code> 返回的时间值相同。请参阅<a href="timing-utilities#Timing-Utilities">计时实用程序</a>。

source: Time of last file status change in the same form as time values returned from <code>time</code>. See <a href="timing-utilities#Timing-Utilities">Timing Utilities</a>.
es: La hora del &uacute;ltimo cambio de estado del archivo de la misma forma que los valores de hora devueltos desde la <code>time</code> . Consulte <a href="timing-utilities#Timing-Utilities">Utilidades de temporizaci&oacute;n</a> .
ru: Время последнего изменения статуса файла в той же форме, что и значения времени, возвращаемые из <code>time</code> . См. <a href="timing-utilities#Timing-Utilities">Утилиты синхронизации</a> .
zh_cn: 上次文件状态更改的时间与从 <code>time</code> 返回的时间值的格式相同。请参阅<a href="timing-utilities#Timing-Utilities">计时实用程序</a>。

source: Time of last modification in the same form as time values returned from <code>time</code>. See <a href="timing-utilities#Timing-Utilities">Timing Utilities</a>.
es: Hora de la &uacute;ltima modificaci&oacute;n en la misma forma que los valores de hora devueltos desde la <code>time</code> . Consulte <a href="timing-utilities#Timing-Utilities">Utilidades de temporizaci&oacute;n</a> .
ru: Время последней модификации в той же форме, что и значения времени, возвращаемые из <code>time</code> . См. <a href="timing-utilities#Timing-Utilities">Утилиты синхронизации</a> .
zh_cn: 上次修改时间与从 <code>time</code> 返回的时间值格式相同。请参阅<a href="timing-utilities#Timing-Utilities">计时实用程序</a>。

source: Time zone (EDT), or nothing if no time zone is determinable.
es: Zona horaria (EDT),o nada si no se puede determinar la zona horaria.
ru: Часовой пояс (EDT),или ничего,если часовой пояс не определен.
zh_cn: 时区(EDT),如果无法确定时区,则无。

source: Time zone.
es: Zona horaria.
ru: Часовой пояс.
zh_cn: 时区:

source: Time, 12-hour (hh:mm:ss [AP]M).
es: Tiempo,12 horas (hh:mm:ss [AP]M).
ru: Время,12 часов (hh:mm:ss [AP]M).
zh_cn: 时间,12小时(hh:mm:ss[AP]M)。

source: Time, 24-hour (hh:mm).
es: Tiempo,24 horas (hh:mm).
ru: Время,24 часа.
zh_cn: 时间,24小时(小时:毫米)。

source: Time, 24-hour (hh:mm:ss).
es: Tiempo,24 horas (hh:mm:ss).
ru: Время,24 часа в сутки (hh:mm:ss).
zh_cn: 时间,24小时(小时:毫米:秒)。

source: Timestamp of file modification (string value).
es: Sello de tiempo de la modificación del archivo (valor de la cadena).
ru: Временная метка изменения файла (значение строки).
zh_cn: 文件修改的时间戳(字符串值)。

source: Timestamp of file modification as serial date number (double).
es: Sello de tiempo de la modificación del archivo como número de fecha de serie (doble).
ru: Штемпель времени модификации файла в виде серийного номера даты (двойной).
zh_cn: 文件修改的时间戳为序列日期号(双)。

source: Timing Utilities
es: Utilidades de cronometraje
ru: Коммунальные услуги по таймингу
zh_cn: 定时工具

source: Timing, however, is not the only information available from the profile. The attribute column shows us that <code>timesteps</code> calls itself recursively. This may not be that remarkable in this example (since it&rsquo;s clear anyway), but could be helpful in a more complex setting. As to the question of why is there a &lsquo;
es: Sin embargo, el tiempo no es la &uacute;nica informaci&oacute;n disponible en el perfil. La columna de atributos nos muestra que los <code>timesteps</code> llaman a s&iacute; mismos de forma recursiva. Esto puede no ser tan notable en este ejemplo (ya que est&aacute; claro de todos modos), pero podr&iacute;a ser &uacute;til en un entorno m&aacute;s complejo. En cuanto a la pregunta de por qu&eacute; existe un '
ru: Однако время - не единственная информация, доступная в профиле. Столбец атрибутов показывает нам, что <code>timesteps</code> вызываются рекурсивно. Это может быть не так уж и замечательно в этом примере (поскольку все равно ясно), но может быть полезно в более сложных условиях. Что касается вопроса о том, почему существует '
zh_cn: 但是，时间不是配置文件中唯一可用的信息。属性列向我们显示 <code>timesteps</code> 会递归调用自身。在此示例中，这可能并不那么引人注目（因为还是很清楚），但是在更复杂的环境中可能会有所帮助。至于为什么会有&ldquo;

source: Title for the audio file.
es: Título para el archivo de audio.
ru: Название аудиофайла.
zh_cn: 音频文件的标题。

source: To a very good first approximation, the goal in vectorization is to write code that avoids loops and uses whole-array operations. As a trivial example, consider
es: Para una muy buena primera aproximación,el objetivo de la vectorización es escribir código que evite los bucles y utilice operaciones de conjunto.Como ejemplo trivial,consideremos
ru: Для очень хорошего первого приближения,целью в векторизации является написание кода,который избегает циклов и использует операции с целыми массивами.В качестве тривиального примера рассмотрим
zh_cn: 在一个非常好的第一近似值中,矢量化的目标是编写避免循环和使用整数组操作的代码。作为一个微不足道的例子,请考虑

source: To access the elements of a cell array, it can be indexed with the { and } operators. Thus, the variable created in the previous example can be indexed like this:
es: Para acceder a los elementos de un conjunto de células,puede ser indexado con los operadores{y }.Así,la variable creada en el ejemplo anterior puede ser indexada así:
ru: Для доступа к элементам массива ячеек можно проиндексировать его с помощью операторов{и }.Таким образом,переменная,созданная в предыдущем примере,может быть проиндексирована следующим образом:
zh_cn: 要访问单元格数组的元素,可以使用{和}运算符进行索引。因此,前面例子中创建的变量可以这样索引。

source: To avoid degrading performance unnecessarily by checking the time stamps on functions that are not likely to change, Octave assumes that function files in the directory tree
es: Para evitar degradar innecesariamente el rendimiento comprobando las marcas de tiempo de las funciones que no es probable que cambien,Octave asume que los archivos de funciones en el árbol de directorios
ru: Чтобы избежать ненужного снижения производительности путем проверки временных меток на функциях,которые вряд ли изменятся,Октава предполагает,что файлы функций в дереве каталогов
zh_cn: 为了避免不必要地检查不可能改变的函数上的时间戳而降低性能,Octave假设在目录树中的函数文件是

source: To avoid segmentation faults causing Octave to abort, this function explicitly checks that there are sufficient arguments available before accessing these arguments. It then obtains two multi-dimensional arrays of type <code>NDArray</code> and adds these together. Note that the <code>array_value</code> method is called without using the <code>is_matrix_type</code> method. If an error occurs when attempting to extract the value, Octave will print a message and throw an exception. The reason to prefer this coding structure is that the arguments might be a type which is not an <code>NDArray</code>, but for which it would make sense to convert them to one. The <code>array_value</code> method allows this conversion to be performed transparently when possible. If you need to catch errors like this, and perform some kind of cleanup or other operation, you can catch the <code>octave_execution_error</code> exception.
es: Para evitar fallas de segmentaci&oacute;n que provoquen la interrupci&oacute;n de Octave, esta funci&oacute;n verifica expl&iacute;citamente que haya suficientes argumentos disponibles antes de acceder a estos argumentos. Luego obtiene dos matrices multidimensionales de tipo <code>NDArray</code> y las suma. Tenga en cuenta que el m&eacute;todo <code>array_value</code> se llama sin utilizar el m&eacute;todo <code>is_matrix_type</code> . Si ocurre un error al intentar extraer el valor, Octave imprimir&aacute; un mensaje y lanzar&aacute; una excepci&oacute;n. La raz&oacute;n para preferir esta estructura de codificaci&oacute;n es que los argumentos pueden ser de un tipo que no sea un <code>NDArray</code> , pero para el que tendr&iacute;a sentido convertirlos en uno. El <code>array_value</code> El m&eacute;todo permite que esta conversi&oacute;n se realice de forma transparente cuando sea posible. Si necesita detectar errores como este y realizar alg&uacute;n tipo de limpieza u otra operaci&oacute;n, puede detectar la excepci&oacute;n <code>octave_execution_error</code> .
ru: Чтобы избежать ошибок сегментации, вызывающих прерывание Octave, эта функция явно проверяет наличие достаточных аргументов, прежде чем обращаться к этим аргументам. Затем он получает два многомерных массива типа <code>NDArray</code> и складывает их. Обратите внимание, что метод <code>array_value</code> вызывается без использования метода <code>is_matrix_type</code> . Если при попытке извлечь значение произойдет ошибка, Octave напечатает сообщение и выдаст исключение. Причина предпочтения этой структуры кодирования заключается в том, что аргументы могут быть типом, который не является <code>NDArray</code> , но для которого имеет смысл преобразовать их в один. Значение <code>array_value</code> Метод позволяет выполнять это преобразование прозрачно, когда это возможно. Если вам нужно отловить подобные ошибки и выполнить какую-либо очистку или другую операцию, вы можете перехватить исключение <code>octave_execution_error</code> .
zh_cn: 为避免分段错误导致Octave中止，此函数在访问这些参数之前会明确检查是否有足够的参数可用。然后，获得两个 <code>NDArray</code> 类型的多维数组，并将它们加在一起。请注意，不使用 <code>is_matrix_type</code> 方法就调用 <code>array_value</code> 方法。如果尝试提取值时发生错误，Octave将打印一条消息并引发异常。之所以喜欢这种编码结构，是因为参数可能不是 <code>NDArray</code> ，而是将其转换为一个是有意义的类型。该 <code>array_value</code> 方法允许在可能的情况下透明地执行此转换。如果您需要捕获此类错误并执行某种清理或其他操作，则可以捕获 <code>octave_execution_error</code> 异常。

source: To be consistent with the Octave graphic handle classes, a class should also define the <code>get</code> and <code>set</code> methods. The <code>get</code> method accepts one or two arguments. The first argument is an object of the appropriate class. If no second argument is given then the method should return a structure with all the properties of the class. If the optional second argument is given it should be a property name and the specified property should be retrieved.
es: Para ser coherente con las clases de control gr&aacute;fico de Octave, una clase tambi&eacute;n debe definir los m&eacute;todos <code>get</code> y <code>set</code> . El m&eacute;todo <code>get</code> acepta uno o dos argumentos. El primer argumento es un objeto de la clase apropiada. Si no se proporciona un segundo argumento, el m&eacute;todo debe devolver una estructura con todas las propiedades de la clase. Si se proporciona el segundo argumento opcional, deber&iacute;a ser un nombre de propiedad y la propiedad especificada deber&iacute;a recuperarse.
ru: Чтобы быть совместимым с классами графических дескрипторов Octave, класс также должен определять методы <code>get</code> и <code>set</code> . Метод <code>get</code> принимает один или два аргумента. Первый аргумент - это объект соответствующего класса. Если второй аргумент не указан, метод должен вернуть структуру со всеми свойствами класса. Если указан необязательный второй аргумент, это должно быть имя свойства, и указанное свойство должно быть получено.
zh_cn: 为了与Octave图形句柄类保持一致，一个类还应该定义 <code>get</code> 和 <code>set</code> 方法。该 <code>get</code> 方法接受一个或两个参数。第一个参数是适当类的对象。如果未提供第二个参数，则该方法应返回具有该类所有属性的结构。如果给出了可选的第二个参数，则它应该是一个属性名称，并且应该检索指定的属性。

source: To be more clear, the approximation <var>x</var> is computed at the iteration <code>(<var>iter(1)</var> - 1) * <var>restart</var> + <var>iter(2)</var></code>. Since the output <var>x</var> corresponds to the minimal preconditioned residual solution, the total number of iterations that the method performed is given by <code>length (resvec) - 1</code>.
es: Para ser m&aacute;s claro, la aproximaci&oacute;n <var>x</var> se calcula en la iteraci&oacute;n <code>(<var>iter(1)</var> - 1) * <var>restart</var> + <var>iter(2)</var></code> . Dado que la salida <var>x</var> corresponde a la soluci&oacute;n residual m&iacute;nima preacondicionada, el n&uacute;mero total de iteraciones que realiz&oacute; el m&eacute;todo viene dado por la <code>length (resvec) - 1</code> .
ru: Чтобы быть более ясным, приближение <var>x</var> вычисляется на итерации <code>(<var>iter(1)</var> - 1) * <var>restart</var> + <var>iter(2)</var></code> . Так как выход <var>x</var> соответствует минимальному предварительно обусловленному остаточному решению, общее количество итераций, выполненных методом, определяется <code>length (resvec) - 1</code> .
zh_cn: 更清楚地说，在迭代 <code>(<var>iter(1)</var> - 1) * <var>restart</var> + <var>iter(2)</var></code> <var>iter(1)</var> -1）* <var>restart</var> + <var>iter(2)</var> 时计算近似值 <var>x</var> 。由于输出 <var>x</var> 对应于最小预处理残差解，因此该方法执行的迭代总数由 <code>length (resvec) - 1</code> 。

source: To calculate for example the MD5 hash value of the string <code>"abc"</code> the <code>hash</code> function is called as follows:
es: Para calcular, por ejemplo, el valor hash MD5 de la cadena <code>"abc"</code> , la funci&oacute;n <code>hash</code> se llama de la siguiente manera:
ru: Чтобы вычислить, например, хэш - значение MD5 строки <code>"abc"</code> <code>hash</code> - функция вызывается следующим образом :
zh_cn: 为了计算例如字符串的MD5哈希值 <code>"abc"</code> 的 <code>hash</code> 函数被调用如下：

source: To call a method of an object the same structure indexing operator &lsquo;
es: Para llamar a un m&eacute;todo de un objeto el mismo operador de indexaci&oacute;n de estructura '
ru: Для вызова метода объекта используется тот же оператор индексации структуры '
zh_cn: 要调用对象的方法，相同结构的索引运算符'

source: To check whether a variable belongs to a user class, the <code>isobject</code> and <code>isa</code> functions can be used. For example:
es: Para comprobar si una variable pertenece a una clase de usuario, se pueden utilizar las funciones <code>isobject</code> e <code>isa</code> . Por ejemplo:
ru: Чтобы проверить, принадлежит ли переменная к пользовательскому классу, можно использовать функции <code>isobject</code> и <code>isa</code> . Например:
zh_cn: 要检查变量是否属于用户类，可以使用 <code>isobject</code> 和 <code>isa</code> 函数。例如：
