Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/octave/octave.*.011.xlf
Languages: es, ja, ru, zh_cn

source: All of the solvers above, can calculate an estimate of the condition number. This can be used to detect numerical stability problems in the solution and force a minimum norm solution to be used. However, for narrow banded, triangular or diagonal matrices, the cost of calculating the condition number is significant, and can in fact exceed the cost of factoring the matrix. Therefore the condition number is not calculated in these cases, and Octave relies on simpler techniques to detect singular matrices or the underlying <small>LAPACK</small> code in the case of banded matrices.
es: Todos los solucionadores anteriores pueden calcular una estimaci&oacute;n del n&uacute;mero de condici&oacute;n. Esto se puede utilizar para detectar problemas de estabilidad num&eacute;rica en la soluci&oacute;n y forzar el uso de una soluci&oacute;n de norma m&iacute;nima. Sin embargo, para matrices de bandas estrechas, triangulares o diagonales, el costo de calcular el n&uacute;mero de condici&oacute;n es significativo y, de hecho, puede exceder el costo de factorizar la matriz. Por lo tanto, el n&uacute;mero de condici&oacute;n no se calcula en estos casos y Octave se basa en t&eacute;cnicas m&aacute;s simples para detectar matrices singulares o el c&oacute;digo <small>LAPACK</small> subyacente en el caso de matrices en bandas.
ja: 上記のすべてのソルバーは、条件数の推定を計算できます。これを使用して、解の数値安定性の問題を検出し、最小ノルム解を強制的に使用することができます。ただし、狭帯域、三角形、または対角行列の場合、条件数を計算するコストは重要であり、実際には行列を因数分解するコストを超える可能性があります。したがって、これらの場合、条件数は計算されません。Octaveは、特異行列またはバンド行列の場合は、基礎となる<small>LAPACK</small>コードを検出するためのより単純な手法に依存しています。
ru: Все вышеперечисленные решатели могут вычислить оценку числа обусловленности. Это можно использовать для обнаружения проблем численной устойчивости в решении и принудительного использования решения с минимальной нормой. Однако для узкополосных, треугольных или диагональных матриц затраты на вычисление числа обусловленности значительны и фактически могут превышать затраты на факторизацию матрицы. Поэтому в этих случаях число условий не вычисляется, и Octave полагается на более простые методы обнаружения сингулярных матриц или лежащего в основе кода <small>LAPACK</small> в случае полосовых матриц.
zh_cn: 以上所有求解器都可以计算条件数的估计值。这可用于检测解中的数值稳定性问题，并强制使用最小范数解。但是，对于窄带，三角或对角矩阵，计算条件数的成本很高，实际上可能超过分解矩阵的成本。因此，在这些情况下不会计算条件编号，在带状矩阵的情况下，Octave依靠更简单的技术来检测奇异矩阵或基础的<small>LAPACK</small>代码。

source: All of these classes inherit from the <code>Sparse&lt;T&gt;</code> template class, and so all have similar capabilities and usage. The <code>Sparse&lt;T&gt;</code> class was based on Octave&rsquo;s <code>Array&lt;T&gt;</code> class and users familiar with Octave&rsquo;s <code>Array</code> classes will be comfortable with the use of the sparse classes.
es: Todas estas clases heredan de la clase de plantilla <code>Sparse&lt;T&gt;</code> , por lo que todas tienen capacidades y usos similares. La clase <code>Sparse&lt;T&gt;</code> se bas&oacute; en la clase <code>Array&lt;T&gt;</code> Octave y los usuarios familiarizados con las clases <code>Array</code> de Octave se sentir&aacute;n c&oacute;modos con el uso de las clases dispersas.
ja: これらのクラスはすべて <code>Sparse&lt;T&gt;</code> テンプレートクラスを継承しているため、同様の機能と使用法があります。 <code>Sparse&lt;T&gt;</code> クラスは、Octaveのに基づいていた <code>Array&lt;T&gt;</code> Octaveの精通クラスとユーザー <code>Array</code> クラスは、スパースクラスの使用と快適になります。
ru: Все эти классы наследуются от класса шаблона <code>Sparse&lt;T&gt;</code> , поэтому все имеют схожие возможности и использование. Класс <code>Sparse&lt;T&gt;</code> был основан на классе Octave <code>Array&lt;T&gt;</code> и пользователи, знакомые с классами Octave <code>Array</code> , будут комфортно использовать разреженные классы.
zh_cn: 所有这些类都继承自 <code>Sparse&lt;T&gt;</code> 模板类，因此都具有相似的功能和用法。该 <code>Sparse&lt;T&gt;</code> 类是基于倍频的 <code>Array&lt;T&gt;</code> 类和用户熟悉倍频的 <code>Array</code> 类将舒适与使用稀疏类。

source: All string concatenation functions except <code>cstrcat</code> also accept cell array data (see <a href="cell-arrays#Cell-Arrays">Cell Arrays</a>). <code>char</code> and <code>strvcat</code> convert cell arrays into character arrays, while <code>strcat</code> concatenates within the cells of the cell arrays:
es: Todas las funciones de concatenaci&oacute;n de cadenas, excepto <code>cstrcat</code> , tambi&eacute;n aceptan datos de matrices de celdas (consulte <a href="cell-arrays#Cell-Arrays">Matrices de celdas</a> ). <code>char</code> y <code>strvcat</code> convierten matrices de celdas en matrices de caracteres, mientras que <code>strcat</code> concatena dentro de las celdas de las matrices de celdas:
ja: <code>cstrcat</code> を除くすべての文字列連結関数は、セル配列データも受け入れます（「<a href="cell-arrays#Cell-Arrays">セル配列</a>」を参照）。 <code>char</code> と <code>strvcat</code> はセル配列を文字配列に変換しますが、 <code>strcat</code> はセル配列のセル内で連結します。
ru: Все функции конкатенации строк, кроме <code>cstrcat</code> , также принимают данные массива ячеек (см. <a href="cell-arrays#Cell-Arrays">Массивы ячеек</a> ). <code>char</code> и <code>strvcat</code> преобразуют массивы ячеек в символьные массивы, в то время как <code>strcat</code> объединяет ячейки в массивы ячеек:
zh_cn: 除 <code>cstrcat</code> 之外的所有字符串连接函数也都接受单元数组数据（请参见<a href="cell-arrays#Cell-Arrays">Cell Arrays</a>）。 <code>char</code> 和 <code>strvcat</code> 将单元格数组转换为字符数组，而 <code>strcat</code> 在单元格数组的单元格内串联：

source: All string concatenation functions except <code>cstrcat</code> convert numerical input into character data by taking the corresponding UTF-8 character for each element (or multi-byte sequence), as in the following example:
es: Todas las funciones de concatenaci&oacute;n de cadenas, excepto <code>cstrcat</code> , convierten la entrada num&eacute;rica en datos de caracteres tomando el car&aacute;cter UTF-8 correspondiente para cada elemento (o secuencia multibyte), como en el siguiente ejemplo:
ja: 次の例のように、 <code>cstrcat</code> を除くすべての文字列連結関数は、各要素（またはマルチバイトシーケンス）に対応するUTF-8文字を取得することにより、数値入力を文字データに変換します。
ru: Все функции конкатенации строк, кроме <code>cstrcat</code> , преобразуют числовой ввод в символьные данные, принимая соответствующий символ UTF-8 для каждого элемента (или многобайтовой последовательности), как в следующем примере:
zh_cn: 除 <code>cstrcat</code> 之外，所有字符串连接函数都通过为每个元素（或多字节序列）采用对应的UTF-8字符来将数字输入转换为字符数据，如以下示例所示：

source: All strings must be UTF-8 encoded.
ja: すべての文字列はUTF-8でエンコードされている必要があります。
zh_cn: 所有字符串必须是UTF-8编码。

source: All text objects&mdash;such as titles, labels, legends, and text&mdash;include the property <code>"interpreter"</code> that determines the manner in which special control sequences in the text are rendered.
es: Todos los objetos de texto, como t&iacute;tulos, etiquetas, leyendas y texto, incluyen la propiedad <code>"interpreter"</code> que determina la manera en que se representan las secuencias de control especiales en el texto.
ja: タイトル、ラベル、凡例、テキストなどのすべてのテキストオブジェクトには、テキスト内の特別な制御シーケンスのレンダリング方法を決定するプロパティ <code>"interpreter"</code> が含まれています。
ru: Все текстовые объекты, такие как заголовки, метки, легенды и текст, включают свойство <code>"interpreter"</code> которое определяет способ визуализации специальных управляющих последовательностей в тексте.
zh_cn: 所有文本对象（例如标题，标签，图例和文本）都包括属性 <code>"interpreter"</code> ，该属性确定了呈现文本中特殊控制序列的方式。

source: All values are either 1 or 0.
es: Todos los valores son 1 o 0.
ja: すべての値は1または0です。
ru: Все значения 1 или 0.
zh_cn: 所有值都是1或0。

source: All values are even numbers.
es: Todos los valores son números pares.
ja: すべての値は偶数です。
ru: Все значения-четные числа.
zh_cn: 所有数值都是偶数。

source: All values are finite.
es: Todos los valores son finitos.
ja: すべての値は有限です。
ru: Все значения конечные.
zh_cn: 所有的数值都是有限的。

source: All values are greater than or equal to the following value in <var>attributes</var>.
es: Todos los valores son mayores o iguales que el siguiente valor en <var>attributes</var> .
ja: すべての値は、 <var>attributes</var> 次の値以上です。
ru: Все значения больше или равны следующему значению в <var>attributes</var> .
zh_cn: 所有值都大于或等于以下值 <var>attributes</var> 。

source: All values are greater than the following value in <var>attributes</var>.
es: Todos los valores son mayores que el siguiente valor en <var>attributes</var> .
ja: <var>attributes</var> すべての値が次の値よりも大きい。
ru: Все значения в <var>attributes</var> больше следующего значения .
zh_cn: 所有值都大于 <var>attributes</var> 的以下值。

source: All values are integer. This is different than using <code>isinteger</code> which only checks its an integer type. This checks that each value in <var>A</var> is an integer value, i.e., it has no decimal part.
es: Todos los valores son enteros. Esto es diferente a usar <code>isinteger</code> que solo verifica que sea un tipo entero. Esto verifica que cada valor en <var>A</var> sea ​​un valor entero, es decir, que no tenga parte decimal.
ja: すべての値は整数です。これは、整数型のみをチェックする <code>isinteger</code> を使用する場合とは異なります。これは、 <var>A</var> の各値が整数値であること、つまり小数部がないことを確認します。
ru: Все значения целые. Это отличается от использования <code>isinteger</code> , которое проверяет только его целочисленный тип. Это проверяет, что каждое значение в <var>A</var> является целым числом, т. Е. Не имеет десятичной части.
zh_cn: 所有值都是整数。这与使用 <code>isinteger</code> （仅检查其整数类型）不同。这检查 <var>A</var> 中的每个值都是整数值，即它没有小数部分。

source: All values are less than or equal to the following value in <var>attributes</var>.
es: Todos los valores son menores o iguales al siguiente valor en <var>attributes</var> .
ja: すべての値は、 <var>attributes</var> 次の値以下です。
ru: Все значения меньше или равны следующему значению в <var>attributes</var> .
zh_cn: 所有值均小于或等于 <var>attributes</var> 的以下值。

source: All values are less than the following value in <var>attributes</var>.
es: Todos los valores son menores que el siguiente valor en <var>attributes</var> .
ja: <var>attributes</var> すべての値が次の値よりも小さい。
ru: Все значения в <var>attributes</var> меньше следующего значения .
zh_cn: 所有值均小于 <var>attributes</var> 的以下值。

source: All values are non negative.
es: Todos los valores no son negativos.
ja: すべての値は非負である。
ru: Все значения не являются отрицательными.
zh_cn: 所有数值均为非负值。

source: All values are odd numbers.
es: Todos los valores son números impares.
ja: すべての値は奇数です。
ru: Все значения-нечетные числа.
zh_cn: 所有数值都是奇数。

source: All values are positive.
es: Todos los valores son positivos.
ja: 全ての価値観がプラスになります。
ru: Все значения положительны.
zh_cn: 所有数值都是正数。

source: All values in a colormap should be in the [0 1] range but this is not enforced. Each function must decide what to do for values outside this range.
es: Todos los valores en un mapa de color deberían estar en el rango [0 1]pero esto no se aplica.Cada función debe decidir qué hacer con los valores fuera de este rango.
ja: colormap内のすべての値は[0 1]の範囲内にあるべきですが、これは強制されていません。各関数は、この範囲外の値をどうするかを決定しなければなりません。
ru: Все значения в цветовой карте должны находиться в диапазоне [0 1],но это не принудительно.Каждая функция должна решить,что делать со значениями вне этого диапазона.
zh_cn: colormap中的所有值都应该在[0 1]范围内,但这并没有被强制执行。每个函数必须决定如何处理这个范围之外的值。

source: All versions of Octave include a number of built-in data types, including real and complex scalars and matrices, character strings, a data structure type, and an array that can contain all data types.
es: Todas las versiones de Octava incluyen una serie de tipos de datos incorporados,incluyendo escalares y matrices reales y complejas,cadenas de caracteres,un tipo de estructura de datos y una matriz que puede contener todos los tipos de datos.
ja: Octaveのすべてのバージョンは,実数および複素数のスカラーと行列,文字列,データ構造型,およびすべてのデータ型を含むことができる配列を含む多くの組み込みデータ型を含んでいます。
ru: Все версии Octave включают в себя ряд встроенных типов данных,включая реальные и сложные скаляры и матрицы,символьные строки,тип структуры данных,а также массив,который может содержать все типы данных.
zh_cn: 所有版本的Octave都包含了许多内置的数据类型,包括实数和复杂的标量和矩阵、字符字符串、数据结构类型以及一个可以包含所有数据类型的数组。

source: Allocating Local Memory in Oct-Files
es: Asignación de la memoria local en los archivos de octubre
ja: Oct-Fileでのローカルメモリの割り当て
ru: Распределение локальной памяти в октябрьских файлах
zh_cn: 在Oct-Files中分配本地内存

source: Allocating memory within an oct-file might seem easy, as the C++ new/delete operators can be used. However, in that case great care must be taken to avoid memory leaks. The preferred manner in which to allocate memory for use locally is to use the <code>OCTAVE_LOCAL_BUFFER</code> macro. An example of its use is
es: Asignar memoria dentro de un archivo oct puede parecer f&aacute;cil, ya que se pueden usar los operadores C ++ new / delete. Sin embargo, en ese caso se debe tener mucho cuidado para evitar p&eacute;rdidas de memoria. La forma preferida de asignar memoria para su uso local es utilizar la macro <code>OCTAVE_LOCAL_BUFFER</code> . Un ejemplo de su uso es
ja: C ++のnew / delete演算子を使用できるため、octファイル内にメモリを割り当てるのは簡単に思えるかもしれません。ただし、その場合、メモリリークを回避するために細心の注意を払う必要があります。ローカルで使用するためにメモリを割り当てる好ましい方法は、 <code>OCTAVE_LOCAL_BUFFER</code> マクロを使用することです。その使用例は
ru: Выделение памяти в oct-файле может показаться простым, поскольку можно использовать операторы C ++ new / delete. Однако в этом случае следует проявлять большую осторожность, чтобы избежать утечки памяти. Предпочтительным способом выделения памяти для локального использования является использование макроса <code>OCTAVE_LOCAL_BUFFER</code> . Пример его использования:
zh_cn: 在oct文件中分配内存似乎很容易，因为可以使用C ++的new / delete运算符。但是，在这种情况下，必须格外小心，以避免内存泄漏。分配内存以供本地使用的首选方式是使用 <code>OCTAVE_LOCAL_BUFFER</code> 宏。其用法的一个例子是

source: Allows for printing transparent graphics objects in PDF format. For PostScript formats the presence of any transparent object will cause the output to be rasterized.
ja: 透過グ ラ フ ィ ッ ク オブジ ェ ク ト を PDF 形式で印刷する こ と がで き ます。PostScript 形式の場合、 透過オブジェクトがあると出力はラスタライズされます。
zh_cn: 允许打印PDF格式的透明图形对象。对于PostScript格式,任何透明对象的存在都会导致输出被光栅化。

source: Alpha (transparency) channel for the image. This must be a matrix with same class, and number of rows and columns of <var>img</var>. In case of a multipage image, the size of the 4th dimension must also match and the third dimension must be a singleton. By default, image will be completely opaque.
es: Canal alfa (transparencia) para la imagen. Esta debe ser una matriz con la misma clase y n&uacute;mero de filas y columnas de <var>img</var> . En el caso de una imagen de varias p&aacute;ginas, el tama&ntilde;o de la cuarta dimensi&oacute;n tambi&eacute;n debe coincidir y la tercera dimensi&oacute;n debe ser singleton. Por defecto, la imagen ser&aacute; completamente opaca.
ja: 画像のアルファ（透明度）チャネル。これは、同じクラス、および <var>img</var> の行と列の数を持つ行列でなければなりません。複数ページの画像の場合、4番目の次元のサイズも一致し、3番目の次元はシングルトンでなければなりません。デフォルトでは、画像は完全に不透明になります。
ru: Альфа-канал (прозрачность) изображения. Это должна быть матрица с таким же классом и количеством строк и столбцов <var>img</var> . В случае многостраничного изображения размер четвертого измерения также должен совпадать, а третье измерение должно быть одноэлементным. По умолчанию изображение будет полностью непрозрачным.
zh_cn: 图像的Alpha（透明）通道。该矩阵必须是具有相同类的矩阵，并且必须是 <var>img</var> 的行数和列数。如果是多页图像，则第4维的尺寸也必须匹配，第3维的尺寸必须为单例。默认情况下，图像将完全不透明。

source: Also exploit broadcasting in these elementwise operators both to avoid looping and unnecessary intermediate memory allocations. See <a href="broadcasting#Broadcasting">Broadcasting</a>.
es: Tambi&eacute;n aproveche la difusi&oacute;n en estos operadores de elementos para evitar bucles y asignaciones de memoria intermedias innecesarias. Ver <a href="broadcasting#Broadcasting">Difusi&oacute;n</a> .
ja: また、これらの要素ごとの演算子のブロードキャストを利用して、ループと不要な中間メモリ割り当てを回避します。<a href="broadcasting#Broadcasting">Broadcastingを</a>参照してください。
ru: Также используйте широковещательную передачу в этих поэлементных операторах, чтобы избежать зацикливания и ненужного промежуточного выделения памяти. См. <a href="broadcasting#Broadcasting">Вещание</a> .
zh_cn: 还应利用这些元素运算符中的广播来避免循环和不必要的中间存储器分配。请参阅<a href="broadcasting#Broadcasting">广播</a>。

source: Also for compatibility with <small>MATLAB</small>, return the right-hand side of the range (10^<var>b</var>) when just a single value is requested.
es: Tambi&eacute;n para compatibilidad con <small>MATLAB</small> , devuelva el lado derecho del rango (10 ^ <var>b</var> ) cuando se solicita un solo valor.
ja: また、<small>MATLAB</small>との互換性のために、単一の値のみが要求された場合は、範囲の右側（10 ^ <var>b</var> ）を返します。
ru: Также для совместимости с <small>MATLAB</small> верните правую часть диапазона (10 ^ <var>b</var> ), когда запрашивается только одно значение.
zh_cn: 同样为了与<small>MATLAB</small>兼容，当只需要一个值时，返回范围的右侧（10 ^ <var>b</var> ）。

source: Also included in Octave&rsquo;s geometry functions are primitive functions to enable vector rotations in 3-dimensional space. Separate functions are provided for rotation about each of the principle axes, <var>x</var>, <var>y</var>, and <var>z</var>. According to Euler&rsquo;s rotation theorem, any arbitrary rotation, <var>R</var>, of any vector, <var>p</var>, can be expressed as a product of the three principle rotations:
ja: Octaveのジオメトリ関数には、3次元空間でのベクトル回転を可能にするプリミティブ関数も含まれています。主軸 <var>x</var> 、 <var>y</var> 、 <var>z</var> のそれぞれを中心に回転するための個別の関数が用意されています。オイラーの回転定理によれば、任意のベクトル <var>p</var> の任意の回転 <var>R</var> は、次の3つの主回転の積として表すことができます。
zh_cn: Octave的几何函数还包括基本函数，以使向量可以在3维空间中旋转。提供了独立的功能，可以绕每个主轴 <var>x</var> ， <var>y</var> 和 <var>z</var> 旋转。根据欧拉旋转定理，任何向量 <var>p</var> 的任意旋转 <var>R</var> 都可以表示为三个主旋转的乘积：

source: Also, a diagonal matrix <var>D</var> can be multiplied or divided by a scalar, or raised to a scalar power if it is square, producing diagonal matrix result in all cases.
es: Adem&aacute;s, una matriz diagonal <var>D</var> se puede multiplicar o dividir por un escalar, o elevar a una potencia escalar si es cuadrada, produciendo un resultado de matriz diagonal en todos los casos.
ja: また、対角行列 <var>D</var> をスカラーで乗算または除算したり、正方行列の場合はスカラー乗にして、すべての場合に対角行列の結果を生成したりできます。
ru: Кроме того, диагональная матрица <var>D</var> может быть умножена или разделена на скаляр или возведена в скалярную степень, если она квадратная, что во всех случаях дает результат диагональной матрицы.
zh_cn: 同样，对角矩阵 <var>D</var> 可以乘以标量或除以标量，或者如果对角矩阵D是正方形，则可以提高到标量幂，从而在所有情况下都产生对角矩阵结果。

source: Also, note that Octave always reserves storage for at least one value. Thus, for empty matrices <code>nnz</code> will report 0, but <code>nzmax</code> will report 1.
ja: また、Octaveは常に少なくとも1つの値のストレージを予約することに注意してください。したがって、空の行列の場合、 <code>nnz</code> は0を報告しますが、 <code>nzmax</code> は1を報告します。
zh_cn: 另外，请注意，Octave总是保留至少一个值的存储空间。因此，对于空矩阵， <code>nnz</code> 将报告0，但 <code>nzmax</code> 将报告1。

source: Also, the test for positive definiteness is a low-cost test for a Hermitian matrix with a real positive diagonal. This does not guarantee that the matrix is positive definite, but only that it is a probable candidate. When such a matrix is factorized, a Cholesky factorization is first attempted, and if that fails the matrix is then treated with an LU factorization. Once the matrix has been factorized, <code>matrix_type</code> will return the correct classification of the matrix.
es: Adem&aacute;s, la prueba de definici&oacute;n positiva es una prueba de bajo costo para una matriz hermitiana con una diagonal positiva real. Esto no garantiza que la matriz sea definida positiva, sino solo que es un candidato probable. Cuando se factoriza una matriz de este tipo, primero se intenta una factorizaci&oacute;n Cholesky, y si eso falla, la matriz se trata con una factorizaci&oacute;n LU. Una vez que la matriz ha sido factorizada, <code>matrix_type</code> devolver&aacute; la clasificaci&oacute;n correcta de la matriz.
ja: また、正定性の検定は、正の対角を持つエルミート行列の低コストの検定です。これは、行列が正定であることを保証するのではなく、それが有望な候補であることだけを保証します。このような行列が因数分解されると、コレスキー因数分解が最初に試行され、失敗した場合、行列はLU因数分解で処理されます。行列が因数分解されると、 <code>matrix_type</code> は行列の正しい分類を返します。
ru: Кроме того, тест на положительную определенность является недорогим тестом для эрмитовой матрицы с реальной положительной диагональю. Это не гарантирует, что матрица положительно определена, а только то, что она является вероятным кандидатом. Когда такая матрица факторизуется, сначала предпринимается попытка факторизации Холецкого, и если это не удается, матрица обрабатывается факторизацией LU. После факторизации матрицы <code>matrix_type</code> вернет правильную классификацию матрицы.
zh_cn: 同样，对正定性的检验是对带实正对角线的Hermitian矩阵的低成本检验。这不能保证矩阵是正定的，而只能保证矩阵是可能的候选。对这样的矩阵进行分解时，首先尝试进行Cholesky分解，如果失败，则使用LU分解对矩阵进行处理。矩阵分解后， <code>matrix_type</code> 将返回矩阵的正确分类。

source: Alternate Names
es: Nombres alternativos
ja: 代替名
ru: Альтернативные имена
zh_cn: 备用名

source: Alternation operator. Match one of a choice of regular expressions. The alternatives must be delimited by the grouping operator <code>()</code> above.
es: Operador de alternancia. Coincide con una de una selecci&oacute;n de expresiones regulares. Las alternativas deben estar delimitadas por el operador de agrupaci&oacute;n <code>()</code> anterior.
ja: 代替演算子。選択した正規表現のいずれかに一致します。選択肢は、上記のグループ化演算子 <code>()</code> で区切る必要があります。
ru: Оператор чередования. Соответствует одному из возможных регулярных выражений. Альтернативы должны быть разделены оператором группировки <code>()</code> выше.
zh_cn: 备用运算符。匹配正则表达式之一。替代项必须由上述分组运算符 <code>()</code> 界定。

source: Alternatively the multiplicity may be defined explicitly, for example,
es: Alternativamente,la multiplicidad puede definirse explícitamente,por ejemplo,
ja: あるいは、多重性を明示的に定義することもできます。
ru: В качестве альтернативы,например,множественность может быть определена явно,
zh_cn: 另外,倍数也可以明确地定义,例如。

source: Alternatively, a value of 128 (<code>GLP_SF_AUTO</code>) may be also specified, in which case the routine chooses the scaling options automatically.
es: Alternativamente, tambi&eacute;n se puede especificar un valor de 128 ( <code>GLP_SF_AUTO</code> ), en cuyo caso la rutina elige las opciones de escala autom&aacute;ticamente.
ja: または、128（ <code>GLP_SF_AUTO</code> ）の値も指定できます。この場合、ルーチンはスケーリングオプションを自動的に選択します。
ru: В качестве альтернативы также может быть указано значение 128 ( <code>GLP_SF_AUTO</code> ), и в этом случае подпрограмма автоматически выбирает параметры масштабирования.
zh_cn: 或者，也可以指定128（ <code>GLP_SF_AUTO</code> ）的值，在这种情况下，例程将自动选择缩放选项。

source: Alternatively, properties of <code>quadgk</code> can be passed to the function as pairs <code>"<var>prop</var>", <var>val</var></code>. Valid properties are
es: Alternativamente, las propiedades de <code>quadgk</code> se pueden pasar a la funci&oacute;n como pares <code>"<var>prop</var>", <var>val</var></code> . Las propiedades v&aacute;lidas son
ja: 代わりに、 <code>quadgk</code> のプロパティを <code>"<var>prop</var>", <var>val</var></code> ペアとして関数に渡すことができます。有効なプロパティは
ru: В качестве альтернативы свойства <code>quadgk</code> могут быть переданы функции как пары <code>"<var>prop</var>", <var>val</var></code> . Действительные свойства
zh_cn: 或者，可以将 <code>quadgk</code> 的属性作为 <code>"<var>prop</var>", <var>val</var></code> 对val传递给函数。有效属性为

source: Alternatively, the output of the <code>lasterror</code> function can be found in a variable indicated immediately after the <code>catch</code> keyword, as in the example below showing how to redirect an error as a warning:
es: Alternativamente, la salida de la funci&oacute;n <code>lasterror</code> se puede encontrar en una variable indicada inmediatamente despu&eacute;s de la palabra clave <code>catch</code> , como en el siguiente ejemplo que muestra c&oacute;mo redirigir un error como advertencia:
ja: または、次の例のようにエラーを警告としてリダイレクトする方法を示すように、 <code>lasterror</code> 関数の出力は、 <code>catch</code> キーワードの直後に示される変数で見つけることができます。
ru: В качестве альтернативы, вывод функции <code>lasterror</code> можно найти в переменной, указанной сразу после ключевого слова <code>catch</code> , как в примере ниже, показывающем, как перенаправить ошибку как предупреждение:
zh_cn: 另外，可以在 <code>catch</code> 关键字后紧跟的变量中找到 <code>lasterror</code> 函数的输出，如以下示例所示，该示例显示了如何将错误重定向为警告：
