Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/octave/octave.*.020.xlf
Languages: es, ru, zh_cn

source: This function is useful for interactive programs. There is no limit to the number of options that may be passed in, but it may be confusing to present more than will fit easily on one screen.
es: Esta función es útil para los programas interactivos.No hay límite en el número de opciones que se pueden pasar,pero puede ser confuso presentar más de las que caben fácilmente en una pantalla.
ru: Эта функция полезна для интерактивных программ.Нет ограничения на количество опций,которые могут быть переданы,но может быть запутано представить больше,чем легко поместится на одном экране.
zh_cn: 这个功能对交互式程序很有用。对可以传入的选项数量没有限制,但如果要在一个屏幕上显示更多的选项,可能会令人困惑。

source: This function is usually used as a prelude to interpolation.
es: Esta función suele utilizarse como preludio de la interpolación.
ru: Эта функция обычно используется в качестве прелюдии к интерполяции.
zh_cn: 这个函数通常用作插值的前奏。

source: This function just hands off the work to the normal Octave <code>polyval</code> function. Another interesting example of an overloaded function for the polynomial class is the <code>plot</code> function.
es: Esta funci&oacute;n simplemente <code>polyval</code> el trabajo a la funci&oacute;n normal de octava polyval . Otro ejemplo interesante de una funci&oacute;n sobrecargada para la clase polinomial es la funci&oacute;n <code>plot</code> .
ru: Эта функция просто <code>polyval</code> работу на обычную многозначную функцию Octave . Еще один интересный пример перегруженной функции для класса полиномов - функция построения <code>plot</code> .
zh_cn: 此功能只是将工作 <code>polyval</code> 给正常的八度倍频函数。多项式类的重载函数的另一个有趣示例是 <code>plot</code> 函数。

source: This function makes the current figure visible, and places it on top of of all other plot windows.
es: Esta función hace visible la figura actual,y la coloca encima de todas las demás ventanas de la trama.
ru: Эта функция делает текущую фигуру видимой и помещает ее поверх всех остальных окон графика.
zh_cn: 该功能使当前图形可见,并将其置于所有其他绘图窗口的顶部。

source: This function may be used, for example, to reduce the impact of noise in <var>data</var> before calculating isosurfaces.
zh_cn: 例如，此功能可用于在计算等值面之前减少 <var>data</var> 中噪声的影响。

source: This function places caps at the open ends of isosurfaces.
es: Esta función coloca tapas en los extremos abiertos de las isosuperficies.
ru: Эта функция устанавливает колпачки на открытых концах изоповерхностей.
zh_cn: 这个函数将盖帽放置在等曲面的开口端。

source: This function produces output like this
es: Esta función produce una salida como esta
ru: Эта функция производит такой вывод
zh_cn: 这个函数产生的输出是这样的

source: This function sends the alarm character <code>"\a"</code> to the terminal. Depending on the user&rsquo;s configuration this may produce an audible beep, a visual bell, or nothing at all.
es: Esta funci&oacute;n env&iacute;a el car&aacute;cter de alarma <code>"\a"</code> al terminal. Dependiendo de la configuraci&oacute;n del usuario, esto puede producir un pitido audible, una campana visual o nada en absoluto.
ru: Эта функция отправляет на терминал аварийный <code>"\a"</code> . В зависимости от конфигурации пользователя при этом может подаваться звуковой сигнал, визуальный звонок или вообще ничего.
zh_cn: 此功能将警报字符 <code>"\a"</code> 发送到终端。根据用户的配置，这可能会产生可听见的哔哔声，可视铃声或什么都不发出。

source: This function should only be employed if <code>WIFEXITED</code> returned true.
es: Esta funci&oacute;n solo debe emplearse si <code>WIFEXITED</code> devuelve verdadero.
ru: Эту функцию следует использовать, только если <code>WIFEXITED</code> вернул истину.
zh_cn: 仅当 <code>WIFEXITED</code> 返回true时，才应使用此函数。

source: This function should only be employed if <code>WIFSIGNALED</code> returned true.
es: Esta funci&oacute;n solo debe emplearse si <code>WIFSIGNALED</code> devolvi&oacute; verdadero.
ru: Эту функцию следует использовать только в том случае, если <code>WIFSIGNALED</code> вернул true.
zh_cn: 仅当 <code>WIFSIGNALED</code> 返回true时，才应使用此函数。

source: This function should only be employed if <code>WIFSIGNALED</code> returned true. The macro used to implement this function is not specified in POSIX.1-2001 and is not available on some Unix implementations (e.g., AIX, SunOS).
es: Esta funci&oacute;n solo debe emplearse si <code>WIFSIGNALED</code> devolvi&oacute; verdadero. La macro utilizada para implementar esta funci&oacute;n no se especifica en POSIX.1-2001 y no est&aacute; disponible en algunas implementaciones de Unix (por ejemplo, AIX, SunOS).
ru: Эту функцию следует использовать только в том случае, если <code>WIFSIGNALED</code> вернул true. Макрос, используемый для реализации этой функции, не указан в POSIX.1-2001 и недоступен в некоторых реализациях Unix (например, AIX, SunOS).
zh_cn: 仅当 <code>WIFSIGNALED</code> 返回true时，才应使用此函数。用于实现此功能的宏未在POSIX.1-2001中指定，并且在某些Unix实现（例如AIX，SunOS）上不可用。

source: This function should only be employed if <code>WIFSTOPPED</code> returned true.
es: Esta funci&oacute;n solo debe emplearse si <code>WIFSTOPPED</code> devolvi&oacute; verdadero.
ru: Эту функцию следует использовать, только если <code>WIFSTOPPED</code> вернул true.
zh_cn: 仅当 <code>WIFSTOPPED</code> 返回true时，才应使用此函数。

source: This function uses libcurl. Curl supports, among others, the HTTP, FTP, and FILE protocols. Username and password may be specified in the URL, for example:
es: Esta función utiliza la libcurl.Curl soporta,entre otros,los protocolos HTTP,FTP y FILE.El nombre de usuario y la contraseña pueden ser especificados en la URL,por ejemplo:
ru: Эта функция использует libcurl.Curl поддерживает,среди прочего,протоколы HTTP,FTP и FILE.Имя пользователя и пароль могут быть,например,указаны в URL:
zh_cn: 该函数使用libcurl。Curl支持HTTP、FTP和FILE等协议。例如,可以在URL中指定用户名和密码。

source: This function uses libcurl. Curl supports, among others, the HTTP, FTP, and FILE protocols. Username and password may be specified in the URL. For example:
es: Esta función utiliza la libcurl.Curl soporta,entre otros,los protocolos HTTP,FTP y FILE.El nombre de usuario y la contraseña se pueden especificar en la URL.Por ejemplo:
ru: Эта функция использует libcurl.Curl поддерживает,среди прочего,протоколы HTTP,FTP и FILE.Имя пользователя и пароль могут быть указаны в URL.Например:
zh_cn: 该函数使用libcurl。Curl支持HTTP、FTP和FILE等协议。可以在URL中指定用户名和密码。例如

source: This gives:
es: Esto da:
ru: Это даёт:
zh_cn: 这使得:

source: This has uses in matrix calculus where the underlying matrix is symmetric and it would be pointless to keep values above the main diagonal.
es: Esto tiene usos en el cálculo matricial donde la matriz subyacente es simétrica y no tendría sentido mantener los valores por encima de la diagonal principal.
ru: Это используется в матричном исчислении,где лежащая в основе матрица симметрична,и было бы бессмысленно держать значения выше главной диагонали.
zh_cn: 这在矩阵微积分中也有用途,因为底层矩阵是对称的,如果把值保持在主对角线以上就没有意义了。

source: This implementation behaves in exactly the same way as the previous implementation of <code>count_calls</code>.
es: Esta implementaci&oacute;n se comporta exactamente de la misma manera que la implementaci&oacute;n anterior de <code>count_calls</code> .
ru: Эта реализация ведет себя точно так же, как предыдущая реализация <code>count_calls</code> .
zh_cn: 此实现的行为与 <code>count_calls</code> 的先前实现完全相同。

source: This implementation handles any number of input arguments, but it&rsquo;s also a very simple solution to the problem.
es: Esta implementaci&oacute;n maneja cualquier n&uacute;mero de argumentos de entrada, pero tambi&eacute;n es una soluci&oacute;n muy simple al problema.
ru: Эта реализация обрабатывает любое количество входных аргументов, но это также очень простое решение проблемы.
zh_cn: 此实现可处理任意数量的输入参数，但这也是解决该问题的非常简单的方法。

source: This is a difficult test case used to evaluate eigenvalue algorithms.
es: Se trata de un difícil caso de prueba utilizado para evaluar los algoritmos de valor propio.
ru: Это сложный тестовый случай,используемый для оценки алгоритмов собственных значений.
zh_cn: 这是一个用于评估特征值算法的困难测试案例。

source: This is a fairly difficult integration (plot the function over the range of integration to see why).
es: Se trata de una integración bastante difícil (trazar la función sobre el rango de integración para ver por qué).
ru: Это довольно сложная интеграция (построение функции по диапазону интеграции,чтобы понять,почему).
zh_cn: 这是一个相当困难的积分(把函数绘制在积分范围内,看看为什么)。

source: This is a permutation such that the Cholesky factorization of <code><var>S</var> (<var>p</var>, <var>p</var>)</code> tends to be sparser than the Cholesky factorization of <var>S</var> itself. <code>amd</code> is typically faster than <code>symamd</code> but serves a similar purpose.
es: Esta es una permutaci&oacute;n tal que la factorizaci&oacute;n Cholesky de <code><var>S</var> (<var>p</var>, <var>p</var>)</code> tiende a ser m&aacute;s escasa que la factorizaci&oacute;n Cholesky de <var>S</var> en s&iacute;. <code>amd</code> suele ser m&aacute;s r&aacute;pido que <code>symamd</code> , pero tiene un prop&oacute;sito similar.
ru: Это перестановка такой , что Холецкая факторизация <code><var>S</var> (<var>p</var>, <var>p</var>)</code> имеет тенденцию быть более редкой , чем Холецкие факторизации <var>S</var> сами. <code>amd</code> обычно быстрее, чем <code>symamd</code> , но служит той же цели.
zh_cn: 这是一个置换，使得 <code><var>S</var> (<var>p</var>, <var>p</var>)</code> 的Cholesky分解比 <var>S</var> 本身的Cholesky分解更稀疏。 <code>amd</code> 通常比 <code>symamd</code> 快，但起着类似的作用。

source: This is a required file containing information about the package. See <a href="the-description-file#The-DESCRIPTION-File">The DESCRIPTION File</a>, for details on this file.
es: Este es un archivo obligatorio que contiene informaci&oacute;n sobre el paquete. Consulte <a href="the-description-file#The-DESCRIPTION-File">El archivo DESCRIPTION</a> para obtener detalles sobre este archivo.
ru: Это обязательный файл, содержащий информацию о пакете. См <a href="the-description-file#The-DESCRIPTION-File">. Файл DESCRIPTION</a> для получения подробной информации об этом файле.
zh_cn: 这是包含有关软件包信息的必需文件。有关<a href="the-description-file#The-DESCRIPTION-File">此文件</a>的详细信息，请参见DESCRIPTION文件。

source: This is a required file containing the license of the package. No restrictions is made on the license in general. If however the package contains dynamically linked functions the license must be compatible with the GNU General Public License.
es: Este es un archivo requerido que contiene la licencia del paquete.No hay restricciones en la licencia en general.Sin embargo,si el paquete contiene funciones vinculadas dinámicamente,la licencia debe ser compatible con la Licencia Pública General de GNU.
ru: Это необходимый файл,содержащий лицензию пакета.Никаких ограничений на лицензию в целом не накладывается.Однако если пакет содержит динамически связанные функции,лицензия должна быть совместима с Стандартной общественной лицензией GNU.
zh_cn: 这是一个包含软件包许可证的必要文件。一般来说,对许可证没有任何限制。然而,如果软件包包含动态链接的函数,许可证必须与GNU通用公共许可证兼容。

source: This is a sufficient specification to begin writing the constructor for the polynomial class. All object oriented classes in Octave must be located in a directory that is the name of the class prepended with the &lsquo;
es: Esta es una especificaci&oacute;n suficiente para comenzar a escribir el constructor de la clase polinomial. Todas las clases orientadas a objetos en Octave deben estar ubicadas en un directorio que es el nombre de la clase antepuesto con el '
ru: Это достаточная спецификация, чтобы начать писать конструктор для полиномиального класса. Все объектно-ориентированные классы в Octave должны располагаться в каталоге, который является именем класса, перед которым стоит '
zh_cn: 这是足以开始为多项式类编写构造函数的规范。Octave中的所有面向对象的类都必须位于目录中，该目录是以'

source: This is also true of assignments to lists of values, so the following is a valid expression
es: Esto también es cierto para las asignaciones a las listas de valores,por lo que la siguiente es una expresión válida
ru: Это также относится и к присваиванию списков значений,поэтому следующим является действительное выражение
zh_cn: 对值列表的赋值也是如此,所以下面是一个有效的表达式。

source: This is am optional file describing instructions on how to cite the package for publication. It will be displayed verbatim by the function <code>citation</code>.
es: Este es un archivo opcional que describe las instrucciones sobre c&oacute;mo citar el paquete para su publicaci&oacute;n. Se mostrar&aacute; literalmente con la <code>citation</code> la funci&oacute;n .
ru: Это необязательный файл с инструкциями по цитированию пакета для публикации. Он будет отображаться дословно под <code>citation</code> на функцию .
zh_cn: 这是一个可选文件，描述有关如何引用该软件包进行发布的说明。它将通过功能 <code>citation</code> 逐字显示。

source: This is an alias for the <code>isalpha</code> function.
es: Este es un alias para la funci&oacute;n <code>isalpha</code> .
ru: Это псевдоним для функции <code>isalpha</code> .
zh_cn: 这是 <code>isalpha</code> 函数的别名。

source: This is an alias for the function <code>OCTAVE_HOME</code> provided for compatibility.
es: Este es un alias para la funci&oacute;n <code>OCTAVE_HOME</code> proporcionada por compatibilidad.
ru: Это псевдоним функции <code>OCTAVE_HOME</code> , предоставленный для совместимости.
zh_cn: 这是为兼容性提供的函数 <code>OCTAVE_HOME</code> 的别名。

source: This is an alternative method to specify <var>idx</var>. When specifying it in this way, its value can also be the string <code>"all"</code>.
es: Este es un m&eacute;todo alternativo para especificar <var>idx</var> . Al especificarlo de esta manera, su valor tambi&eacute;n puede ser la cadena <code>"all"</code> .
ru: Это альтернативный метод указания <var>idx</var> . При таком указании его значением также может быть строка <code>"all"</code> .
zh_cn: 这是指定 <var>idx</var> 的替代方法。当以这种方式指定它时，它的值也可以是字符串 <code>"all"</code> 。

source: This is an optional file describing all the changes made to the package source files.
es: Este es un archivo opcional que describe todos los cambios realizados en los archivos fuente del paquete.
ru: Это необязательный файл,описывающий все изменения,внесенные в исходные файлы пакета.
zh_cn: 这是一个可选的文件,描述了对软件包源文件的所有修改。

source: This is an optional file describing all user-visible changes worth mentioning. As this file increases on size, old entries can be moved into
es: Se trata de un archivo opcional que describe todos los cambios visibles para el usuario que vale la pena mencionar.A medida que este archivo aumenta de tamaño,las entradas antiguas pueden ser movidas a
ru: Это необязательный файл,описывающий все видимые пользователю изменения,о которых стоит упомянуть.По мере увеличения размера этого файла,старые записи могут быть перемещены в
zh_cn: 这是一个可选的文件,描述了所有值得一提的用户可见的变化。随着这个文件大小的增加,旧的条目可以被移到

source: This is an optional file describing old entries from the
es: Este es un archivo opcional que describe las entradas antiguas del
ru: Это необязательный файл,описывающий старые записи из
zh_cn: 这是一个可选的文件,描述了来自于

source: This is an optional file describing the functions provided by the package. If this file is not given then one with be created automatically from the functions in the package and the <code>Categories</code> keyword in the
es: Este es un archivo opcional que describe las funciones proporcionadas por el paquete. Si no se proporciona este archivo, se crear&aacute; uno autom&aacute;ticamente a partir de las funciones del paquete y la palabra clave <code>Categories</code> en el
ru: Это необязательный файл с описанием функций, предоставляемых пакетом. Если этот файл не указан, то он будет создан автоматически из функций в пакете и ключевого слова <code>Categories</code> в
zh_cn: 这是一个可选文件，描述了软件包提供的功能。如果没有给出这个文件，然后用一个从封装中的功能自动创建和 <code>Categories</code> 的关键字

source: This is an optional function that is run after the installation of a package. This function is called with a single argument, a struct with fields names after the data in the
es: Esta es una función opcional que se ejecuta después de la instalación de un paquete.Esta función se llama con un solo argumento,una estructura con nombres de campos después de los datos en el
ru: Это дополнительная функция,которая запускается после установки пакета.Эта функция вызывается с единственным аргументом,структурой с именами полей после данных в
zh_cn: 这是一个在安装包后运行的可选函数。这个函数的调用只需要一个参数,即一个结构体,它的字段名是用

source: This is an optional function that is run prior to the installation of a package. This function is called with a single argument, a struct with fields names after the data in the
es: Esta es una función opcional que se ejecuta antes de la instalación de un paquete.Esta función se llama con un solo argumento,una estructura con nombres de campos después de los datos en el
ru: Это дополнительная функция,которая запускается перед установкой пакета.Эта функция вызывается с единственным аргументом,структурой с именами полей после данных в
zh_cn: 这是一个在安装软件包之前运行的可选函数。这个函数的调用只需要一个参数,即一个结构体,它的字段名是以在

source: This is an optional function that is run prior to the removal of a package. This function is called with a single argument, a struct with fields names after the data in the
es: Es una función opcional que se ejecuta antes de retirar un paquete.Esta función se llama con un solo argumento,una estructura con nombres de campos después de los datos en el
ru: Это дополнительная функция,которая запускается перед удалением пакета.Эта функция вызывается с единственным аргументом,структурой с именами полей после данных в
zh_cn: 这是一个可选择的函数,它是在移除一个包之前运行的。这个函数的调用只需要一个参数,即一个结构体,它的字段名是以

source: This is cleaner and more memory efficient than using a dummy variable. The <code>nargout</code> value for the right-hand side expression is not affected. If the assignment is used as an expression, the return value is a comma-separated list with the ignored values dropped.
es: Esto es m&aacute;s limpio y m&aacute;s eficiente en memoria que usar una variable ficticia. El valor de <code>nargout</code> para la expresi&oacute;n del lado derecho no se ve afectado. Si la asignaci&oacute;n se usa como una expresi&oacute;n, el valor de retorno es una lista separada por comas con los valores ignorados descartados.
ru: Это чище и эффективнее с точки зрения памяти, чем использование фиктивной переменной. Значение <code>nargout</code> для выражения в правой части не изменяется . Если присвоение используется как выражение, возвращаемое значение представляет собой список, разделенный запятыми, с отброшенными игнорируемыми значениями.
zh_cn: 与使用伪变量相比，这更干净，内存使用效率更高。右侧表达式的 <code>nargout</code> 值不受影响。如果将赋值用作表达式，则返回值是一个逗号分隔的列表，其中忽略了忽略的值。

source: This is conceptually equivalent to <code>inv (A) * b</code>, but avoids computing the inverse of a matrix directly.
es: Esto es conceptualmente equivalente a <code>inv (A) * b</code> , pero evita calcular directamente la inversa de una matriz.
ru: Это концептуально эквивалентно <code>inv (A) * b</code> , но позволяет избежать прямого вычисления обратной матрицы.
zh_cn: 从概念上讲，这等效于 <code>inv (A) * b</code> ，但是避免了直接计算矩阵逆。

source: This is consistent with the ordering used by <em>max</em>, <em>min</em> and <em>sort</em>, but is not consistent with <small>MATLAB</small>, which only compares the real parts.
es: Esto es consistente con el orden usado por <em>max</em> , <em>min</em> y <em>sort</em> , pero no es consistente con <small>MATLAB</small> , que solo compara las partes reales.
ru: Это согласуется с порядком, используемым <em>max</em> , <em>min</em> и <em>sort</em> , но не согласуется с <small>MATLAB</small> , который сравнивает только реальные части.
zh_cn: 这与<em>max</em>，<em>min</em>和<em>sort</em>所使用的顺序一致，但与<small>MATLAB</small>不一致，后者仅比较实际部分。

source: This is defined as
es: Esto se define como
ru: Это определяется как
zh_cn: 这被定义为

source: This is defined as, <var>theta</var> = <code>atan2 (<var>y</var>, <var>x</var>)</code>, in radians.
es: Esto se define como, <var>theta</var> = <code>atan2 (<var>y</var>, <var>x</var>)</code> , en radianes.
ru: Это определяется как <var>theta</var> = <code>atan2 (<var>y</var>, <var>x</var>)</code> в радианах.
zh_cn: 定义为 <var>theta</var> = <code>atan2 (<var>y</var>, <var>x</var>)</code> ，以弧度为单位。

source: This is defined block by block as
es: Esto se define bloque por bloque como
ru: Это определяется блоком за блоком как
zh_cn: 这被逐块定义为

source: This is equivalent to
es: Esto equivale a
ru: Это эквивалентно
zh_cn: 这相当于

source: This is equivalent to (<code>isalpha (<var>s</var>) | isdigit (<var>s</var>)</code>).
es: Esto es equivalente a ( <code>isalpha (<var>s</var>) | isdigit (<var>s</var>)</code> ).
ru: Это эквивалентно ( <code>isalpha (<var>s</var>) | isdigit (<var>s</var>)</code> ).
zh_cn: 这等效于（ <code>isalpha (<var>s</var>) | isdigit (<var>s</var>)</code> ）。

source: This is equivalent to (<code>islower (<var>s</var>) | isupper (<var>s</var>)</code>).
es: Esto es equivalente a ( <code>islower (<var>s</var>) | isupper (<var>s</var>)</code> ).
ru: Это эквивалентно ( <code>islower (<var>s</var>) | isupper (<var>s</var>)</code> ).
zh_cn: 这等效于（ <code>islower (<var>s</var>) | isupper (<var>s</var>)</code> ）。

source: This is equivalent to <code>"\n"</code>.
zh_cn: 这等效于 <code>"\n"</code> 。

source: This is equivalent to <code><var>x</var>&nbsp;.^&nbsp;<var>y</var></code>, except that <code>realpow</code> reports an error if any return value is complex.
es: Esto es equivalente a <code><var>x</var>&nbsp;.^&nbsp;<var>y</var></code> , excepto que <code>realpow</code> informa un error si alg&uacute;n valor de retorno es complejo.
ru: Это эквивалентно <code><var>x</var>&nbsp;.^&nbsp;<var>y</var></code> , за исключением того, что <code>realpow</code> сообщает об ошибке, если какое-либо возвращаемое значение является сложным.
zh_cn: 这等效于 <code><var>x</var>&nbsp;.^&nbsp;<var>y</var></code> ，不同之处在于，如果任何返回值很复杂， <code>realpow</code> 都会报告错误。

source: This is equivalent to <code>ctime (time ())</code>.
es: Esto es equivalente a <code>ctime (time ())</code> .
ru: Это эквивалентно <code>ctime (time ())</code> .
zh_cn: 这等效于 <code>ctime (time ())</code> 。

source: This is equivalent to <code>mkoctfile --mex [-options] file</code>.
zh_cn: 这等效于 <code>mkoctfile --mex [-options] file</code> 。

source: This is equivalent to <code>mkoctfile --mex [options] file</code>.
es: Esto es equivalente al <code>mkoctfile --mex [options] file</code> .
ru: Это эквивалент <code>mkoctfile --mex [options] file</code> .
zh_cn: 这等效于 <code>mkoctfile --mex [options] file</code> 。

source: This is equivalent to <code>sqrt (<var>x</var>.^2 + <var>y</var>.^2)</code>, but is calculated in a manner that avoids overflows for large values of <var>x</var> or <var>y</var>.
es: Esto es equivalente a <code>sqrt (<var>x</var>.^2 + <var>y</var>.^2)</code> , pero se calcula de una manera que evita desbordamientos para valores grandes de <var>x</var> o <var>y</var> .
ru: Это эквивалентно <code>sqrt (<var>x</var>.^2 + <var>y</var>.^2)</code> , но вычисляется таким образом, чтобы избежать переполнения для больших значений <var>x</var> или <var>y</var> .
zh_cn: 这等效于 <code>sqrt (<var>x</var>.^2 + <var>y</var>.^2)</code> ，但以避免针对 <var>x</var> 或 <var>y</var> 较大的值溢出的方式进行计算。
