Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/octave/octave.*.011.xlf
Languages: es, ja, ru, zh_cn

source: By default the arguments are evaluated with <code>feval (@plot, <var>x</var>, <var>y</var>)</code>. However the type of plot can be modified with the <var>fun</var> argument, in which case the plots are generated by <code>feval (<var>fun</var>, <var>x</var>, <var>y</var>)</code>. <var>fun</var> can be a function handle, an inline function, or a string of a function name.
es: Por defecto, los argumentos se eval&uacute;an con <code>feval (@plot, <var>x</var>, <var>y</var>)</code> . Sin embargo, el tipo de gr&aacute;fico se puede modificar con el argumento <var>fun</var> , en cuyo caso los gr&aacute;ficos son generados por <code>feval (<var>fun</var>, <var>x</var>, <var>y</var>)</code> . <var>fun</var> puede ser un identificador de funci&oacute;n, una funci&oacute;n en l&iacute;nea o una cadena de nombre de funci&oacute;n.
ja: デフォルトでは、引数は <code>feval (@plot, <var>x</var>, <var>y</var>)</code> 評価されます。ただし、プロットのタイプは <var>fun</var> 引数で変更できます。この場合、プロットは <code>feval (<var>fun</var>, <var>x</var>, <var>y</var>)</code> によって生成されます。 <var>fun</var> は、関数ハンドル、インライン関数、または関数名の文字列です。
ru: По умолчанию аргументы оцениваются с помощью <code>feval (@plot, <var>x</var>, <var>y</var>)</code> . Однако тип сюжета можно изменить с помощью аргумента <var>fun</var> , и в этом случае сюжеты генерируются <code>feval (<var>fun</var>, <var>x</var>, <var>y</var>)</code> . <var>fun</var> может быть дескриптором функции, встроенной функцией или строкой имени функции.
zh_cn: 默认情况下，参数使用 <code>feval (@plot, <var>x</var>, <var>y</var>)</code> 求值。但是，可以使用 <var>fun</var> 参数修改图的类型，在这种情况下，图是通过 <code>feval (<var>fun</var>, <var>x</var>, <var>y</var>)</code> 。 <var>fun</var> 可以是函数句柄，内联函数或函数名称的字符串。

source: By default the complex pairs are sorted along the first non-singleton dimension of <var>z</var>. If <var>dim</var> is specified, then the complex pairs are sorted along this dimension.
es: De forma predeterminada, los pares complejos se ordenan a lo largo de la primera dimensi&oacute;n no singleton de <var>z</var> . Si se especifica <var>dim</var> , los pares complejos se ordenan a lo largo de esta dimensi&oacute;n.
ja: デフォルトでは、複素数ペアは <var>z</var> の最初の1でない次元に沿ってソートされます。 <var>dim</var> が指定されている場合、複素数ペアはこの次元に沿ってソートされます。
ru: По умолчанию сложные пары сортируются по первому не одноэлементному измерению <var>z</var> . Если указан <var>dim</var> , то сложные пары сортируются по этому измерению.
zh_cn: 默认情况下，复数对沿 <var>z</var> 的第一个非单维度进行排序。如果指定了 <var>dim</var> ，则复数对将沿该维排序。

source: By default the values are displayed with the name of the variable <var>c</var>. However, this name can be replaced with the variable <var>name</var>. For example:
es: Por defecto, los valores se muestran con el nombre de la variable <var>c</var> . Sin embargo, este nombre se puede reemplazar por el <var>name</var> la variable . Por ejemplo:
ja: デフォルトでは、値は変数 <var>c</var> の名前で表示されます。ただし、この名前は変数 <var>name</var> に置き換えることができます。例えば：
ru: По умолчанию значения отображаются с именем переменной <var>c</var> . Однако это имя можно заменить <var>name</var> переменной . Например:
zh_cn: 默认情况下，值显示为变量 <var>c</var> 的名称。但是，可以用变量 <var>name</var> 代替该名称。例如：

source: By default, <code><var>p</var> = 2</code> is used which implies a (relatively slow) singular value decomposition. Other possible selections are <code><var>p</var> = 1, Inf, "fro"</code> which are generally faster. See <code>norm</code> for a full discussion of possible <var>p</var> values.
es: Por defecto, se utiliza <code><var>p</var> = 2</code> lo que implica una descomposici&oacute;n de valores singulares (relativamente lenta). Otras selecciones posibles son <code><var>p</var> = 1, Inf, "fro"</code> que generalmente son m&aacute;s r&aacute;pidas. Consulte la <code>norm</code> a para una discusi&oacute;n completa de los posibles valores de <var>p</var> .
ja: デフォルトでは、 <code><var>p</var> = 2</code> が使用され、（比較的遅い）特異値分解を意味します。その他の可能な選択は、 <code><var>p</var> = 1, Inf, "fro"</code> で、一般的に高速です。可能な <var>p</var> 値の詳細については、 <code>norm</code> を参照してください。
ru: По умолчанию используется <code><var>p</var> = 2</code> что подразумевает (относительно медленное) разложение по сингулярным значениям. Другие возможные варианты: <code><var>p</var> = 1, Inf, "fro"</code> которые обычно быстрее. См. <code>norm</code> для полного обсуждения возможных значений <var>p</var> .
zh_cn: 默认情况下，使用 <code><var>p</var> = 2</code> ，这意味着（相对较慢）奇异值分解。其他可能的选择是 <code><var>p</var> = 1, Inf, "fro"</code> ，通常更快。有关可能的 <var>p</var> 值的完整讨论，请参见 <code>norm</code> 。

source: By default, <code>eigs</code> solve the equation where is the corresponding eigenvector. If given the positive definite matrix <var>B</var> then <code>eigs</code> solves the general eigenvalue equation
es: Por defecto, los <code>eigs</code> resuelven la ecuaci&oacute;n donde est&aacute; el vector propio correspondiente. Si se da la matriz definida positiva <var>B</var> , entonces <code>eigs</code> resuelve la ecuaci&oacute;n de valor propio general
ja: デフォルトでは、 <code>eigs</code> は方程式を解きます。ここで、は対応する固有ベクトルです。正定行列 <var>B</var> が与えられた場合、 <code>eigs</code> は一般的な固有値方程式を解きます
ru: По умолчанию <code>eigs</code> решает уравнение, где - соответствующий собственный вектор. Если дана положительно определенная матрица <var>B</var> , то <code>eigs</code> решает общее уравнение для собственных значений
zh_cn: 默认情况下， <code>eigs</code> 求解方程式，其中是相应的特征向量。如果给定正定矩阵 <var>B</var> ,则 <code>eigs</code> 求解一般特征值方程

source: By default, <code>ichol</code> uses only the lower triangle of <var>A</var> and produces a lower triangular factor <var>L</var> such that <code>L*L'</code> approximates <var>A</var>.
es: Por defecto, <code>ichol</code> utiliza s&oacute;lo el tri&aacute;ngulo inferior de <var>A</var> y produce un factor triangular inferior <var>L</var> tal que <code>L*L'</code> se aproxima a <var>A</var> .
ja: デフォルトでは、 <code>ichol</code> は <var>A</var> の下三角のみを使用し、 <code>L*L'</code> <var>A</var> に近似するような下三角因子 <var>L</var> を生成します。
ru: По умолчанию, <code>ichol</code> использует только нижний треугольник <var>A</var> и производит нижнетреугольную фактор <var>L</var> таких , что <code>L*L'</code> аппроксимирует <var>A</var> .
zh_cn: 默认情况下， <code>ichol</code> 只使用的下三角 <var>A</var> ，并产生下三角因子 <var>L</var> 使得 <code>L*L'</code> 近似于 <var>A</var> 。

source: By default, <code>lookfor</code> looks for <var>str</var> in just the first sentence of the help string for each function found. The entire help text of each function can be searched by using the <code>"-all"</code> argument. All searches are case insensitive.
es: De forma predeterminada, <code>lookfor</code> busca <var>str</var> solo en la primera oraci&oacute;n de la cadena de ayuda para cada funci&oacute;n encontrada. Se puede buscar todo el texto de ayuda de cada funci&oacute;n utilizando el argumento <code>"-all"</code> . Todas las b&uacute;squedas no distinguen entre may&uacute;sculas y min&uacute;sculas.
ja: デフォルトでは、 <code>lookfor</code> は、見つかった各関数のヘルプ文字列の最初の文だけで <var>str</var> を探します。各関数のヘルプテキスト全体は、 <code>"-all"</code> 引数を使用して検索できます。すべての検索では大文字と小文字が区別されません。
ru: По умолчанию <code>lookfor</code> ищет <var>str</var> только в первом предложении строки справки для каждой найденной функции. Весь текст справки по каждой функции можно найти с помощью аргумента <code>"-all"</code> . При поиске регистр не учитывается.
zh_cn: 默认情况下， <code>lookfor</code> 在找到的每个函数的帮助字符串的第一句中仅查找 <var>str</var> 。可以使用 <code>"-all"</code> 参数搜索每个功能的整个帮助文本。所有搜索都不区分大小写。

source: By default, <code>ode23</code> uses an adaptive timestep with the <code>integrate_adaptive</code> algorithm. The tolerance for the timestep computation may be changed by using the options <code>"RelTol"</code> and <code>"AbsTol"</code>.
es: De forma predeterminada, <code>ode23</code> usa un paso de tiempo adaptativo con el algoritmo <code>integrate_adaptive</code> . La tolerancia para el c&aacute;lculo del intervalo de tiempo se puede cambiar utilizando las opciones <code>"RelTol"</code> y <code>"AbsTol"</code> .
ja: 既定では、 <code>ode23</code> は、 <code>integrate_adaptive</code> アルゴリズムで適応タイムステップを使用します。タイムステップ計算の許容誤差は、オプション <code>"RelTol"</code> および <code>"AbsTol"</code> を使用して変更できます。
ru: По умолчанию <code>ode23</code> использует адаптивный временной шаг с алгоритмом <code>integrate_adaptive</code> . Допуск для вычисления временного шага может быть изменен с помощью опций <code>"RelTol"</code> и <code>"AbsTol"</code> .
zh_cn: 默认情况下， <code>ode23</code> 将自适应时间步与 <code>integrate_adaptive</code> 算法一起使用。可以通过使用选项 <code>"RelTol"</code> 和 <code>"AbsTol"</code> 来更改时间步计算的公差。

source: By default, <code>ode23s</code> uses an adaptive timestep with the <code>integrate_adaptive</code> algorithm. The tolerance for the timestep computation may be changed by using the options <code>"RelTol"</code> and <code>"AbsTol"</code>.
ja: デフォルトでは、 <code>ode23s</code> は <code>integrate_adaptive</code> アルゴリズムで適応タイムステップを使用します。タイムステップ計算の許容誤差は、オプション <code>"RelTol"</code> および <code>"AbsTol"</code> を使用して変更できます。
zh_cn: 默认情况下， <code>ode23s</code> 使用带有 <code>integrate_adaptive</code> 算法的自适应时间步。可以通过使用选项 <code>"RelTol"</code> 和 <code>"AbsTol"</code> 来更改时间步计算的容差。

source: By default, <code>ode45</code> uses an adaptive timestep with the <code>integrate_adaptive</code> algorithm. The tolerance for the timestep computation may be changed by using the options <code>"RelTol"</code> and <code>"AbsTol"</code>.
es: Por defecto, <code>ode45</code> utiliza un paso de tiempo adaptativo con el <code>integrate_adaptive</code> algoritmo. La tolerancia para el c&aacute;lculo del intervalo de tiempo se puede cambiar utilizando las opciones <code>"RelTol"</code> y <code>"AbsTol"</code> .
ja: デフォルトでは、 <code>ode45</code> は、 <code>integrate_adaptive</code> アルゴリズムで適応タイムステップを使用します。タイムステップ計算の許容誤差は、オプション <code>"RelTol"</code> および <code>"AbsTol"</code> を使用して変更できます。
ru: По умолчанию <code>ode45</code> использует адаптивный временной шаг с алгоритмом <code>integrate_adaptive</code> . Допуск для вычисления временного шага может быть изменен с помощью опций <code>"RelTol"</code> и <code>"AbsTol"</code> .
zh_cn: 缺省情况下， <code>ode45</code> 将自适应时间步与 <code>integrate_adaptive</code> 算法一起使用。可以通过使用选项 <code>"RelTol"</code> 和 <code>"AbsTol"</code> 来更改时间步计算的公差。

source: By default, <code>rande</code> uses the Marsaglia and Tsang &ldquo;Ziggurat technique&rdquo; to transform from a uniform to an exponential distribution.
es: Por defecto, <code>rande</code> usa la &ldquo;t&eacute;cnica Ziggurat&rdquo; de Marsaglia y Tsang para transformar una distribuci&oacute;n uniforme a una exponencial.
ja: デフォルトでは、 <code>rande</code> はMarsagliaおよびTsangの「Zigguratテクニック」を使用して、一様分布から指数分布に変換します。
ru: По умолчанию, <code>rande</code> использует &laquo;технику зиккурата&raquo; Марсалья и Цанга для преобразования однородного распределения в экспоненциальное.
zh_cn: 默认情况下， <code>rande</code> 使用Marsaglia和Tsang的&ldquo; Ziggurat技术&rdquo;将均匀分布转换为指数分布。

source: By default, <code>randn</code> uses the Marsaglia and Tsang &ldquo;Ziggurat technique&rdquo; to transform from a uniform to a normal distribution.
es: De forma predeterminada, <code>randn</code> utiliza la &ldquo;t&eacute;cnica Ziggurat&rdquo; de Marsaglia y Tsang para transformarse de una distribuci&oacute;n uniforme a una normal.
ja: デフォルトでは、 <code>randn</code> はMarsagliaおよびTsangの「Zigguratテクニック」を使用して、一様分布から正規分布に変換します。
ru: По умолчанию <code>randn</code> использует &laquo;технику зиккурата&raquo; Марсалья и Цанга для преобразования однородного распределения в нормальное.
zh_cn: 默认情况下， <code>randn</code> 使用Marsaglia和Tsang的&ldquo; Ziggurat技术&rdquo;将均匀分布转换为正态分布。

source: By default, <var>filename</var> is <code>"Untitled.fig"</code>. If a full path is not specified, the file opened will be the first one encountered in the load path. If <var>filename</var> is not found and does not have an extension, a search will take place for the first file in the load path with extension <code>".fig"</code> or <code>".ofig"</code>, in that order.
es: De forma predeterminada, el <var>filename</var> es <code>"Untitled.fig"</code> . Si no se especifica una ruta completa, el archivo abierto ser&aacute; el primero que se encuentre en la ruta de carga. Si no se encuentra el <var>filename</var> y no tiene extensi&oacute;n, se buscar&aacute; el primer archivo en la ruta de carga con extensi&oacute;n <code>".fig"</code> o <code>".ofig"</code> , en ese orden.
ja: デフォルトでは、 <var>filename</var> は <code>"Untitled.fig"</code> です。フルパスが指定されていない場合、開かれるファイルは、ロードパスで最初に見つかったファイルになります。 <var>filename</var> が見つからず、拡張子がない場合は、ロードパス内で拡張子が <code>".fig"</code> または <code>".ofig"</code> の最初のファイルがこの順序で検索されます。
ru: По умолчанию <var>filename</var> - <code>"Untitled.fig"</code> . Если полный путь не указан, открытый файл будет первым из найденных в пути загрузки. Если <var>filename</var> не найдено и не имеет расширения, будет выполнен поиск первого файла в пути загрузки с расширением <code>".fig"</code> или <code>".ofig"</code> в указанном порядке.
zh_cn: 默认情况下， <var>filename</var> 是 <code>"Untitled.fig"</code> 。如果未指定完整路径，则打开的文件将是加载路径中遇到的第一个文件。如果找不到 <var>filename</var> 并且没有扩展名，则将按照该顺序在加载路径中搜索扩展名为 <code>".fig"</code> 或 <code>".ofig"</code> 的第一个文件。

source: By default, <var>format</var> is
es: Por defecto, el <var>format</var> o es
ja: デフォルトでは、 <var>format</var> は
ru: По умолчанию <var>format</var> является
zh_cn: 默认情况下， <var>format</var> 为

source: By default, <var>mode</var> is <code>"ascend"</code>. NaNs are treated in the same manner as <code>sort</code>.
ja: デフォルトでは、 <var>mode</var> は <code>"ascend"</code> です。NaNは <code>sort</code> と同じように扱われます。
zh_cn: 默认情况下， <var>mode</var> 为 <code>"ascend"</code> 。NaN的处理方式与 <code>sort</code> 相同。

source: By default, <var>mode</var> is <code>"ascending"</code>. NaNs are treated in the same manner as <code>sort</code>.
es: Por defecto, el <var>mode</var> es <code>"ascending"</code> . Los NaN se tratan de la misma manera que la <code>sort</code> .
ja: デフォルトでは、 <var>mode</var> は <code>"ascending"</code> です。NaNは <code>sort</code> と同じように扱われます。
ru: По умолчанию <var>mode</var> является <code>"ascending"</code> . NaN обрабатываются так же, как и <code>sort</code> .
zh_cn: 默认情况下， <var>mode</var> 为 <code>"ascending"</code> 。NaN的处理方式与 <code>sort</code> 相同。

source: By default, <var>tail</var> is <code>"lower"</code> and the incomplete beta function integrated from 0 to <var>x</var> is computed. If <var>tail</var> is <code>"upper"</code> then the complementary function integrated from <var>x</var> to 1 is calculated. The two choices are related by
es: De forma predeterminada, <var>tail</var> es <code>"lower"</code> y se calcula la funci&oacute;n beta incompleta integrada de 0 a <var>x</var> . Si la <var>tail</var> es <code>"upper"</code> , se calcula la funci&oacute;n complementaria integrada de <var>x</var> a 1. Las dos opciones est&aacute;n relacionadas por
ja: デフォルトでは、 <var>tail</var> は <code>"lower"</code> あり、0から <var>x</var> まで積分された不完全ベータ関数が計算されます。場合 <var>tail</var> である <code>"upper"</code> 、次いでから集積相補関数 <var>x</var> 1が計算されます。2つの選択肢は、
ru: По умолчанию, <var>tail</var> является <code>"lower"</code> и неполная бета - функция интегрирована от 0 до <var>x</var> вычисляется. Если <var>tail</var> является <code>"upper"</code> , то дополнительная функция интегрированы с <var>x</var> 1 вычисляются. Два варианта связаны
zh_cn: 默认情况下， <var>tail</var> 为 <code>"lower"</code> 并计算从0到 <var>x</var> 积分的不完整beta函数。如果 <var>tail</var> 是 <code>"upper"</code> 则计算从 <var>x</var> 到1 积分的互补函数。这两个选择通过

source: By default, <var>tail</var> is <code>"lower"</code> and the incomplete gamma function integrated from 0 to <var>x</var> is computed. If <var>tail</var> is <code>"upper"</code> then the complementary function integrated from <var>x</var> to infinity is calculated.
es: De forma predeterminada, la <var>tail</var> es <code>"lower"</code> y se calcula la funci&oacute;n gamma incompleta integrada de 0 a <var>x</var> . Si la <var>tail</var> es <code>"upper"</code> , se calcula la funci&oacute;n complementaria integrada desde <var>x</var> hasta el infinito.
ja: デフォルトでは、 <var>tail</var> は <code>"lower"</code> 、0から <var>x</var> まで積分された不完全なガンマ関数が計算されます。場合は <var>tail</var> ある <code>"upper"</code> 、その後から統合補完機能 <var>x</var> 無限大には計算されます。
ru: По умолчанию, <var>tail</var> является <code>"lower"</code> и неполной гамма - функция интегрирован от 0 до <var>x</var> вычисляются. Если <var>tail</var> является <code>"upper"</code> , то дополнительная функция интегрированы от <var>x</var> до бесконечности вычисляются.
zh_cn: 默认情况下， <var>tail</var> 为 <code>"lower"</code> 并计算从0到 <var>x</var> 积分的不完整伽玛函数。如果 <var>tail</var> 是 <code>"upper"</code> 则计算从 <var>x</var> 到无穷大积分的互补函数。

source: By default, <var>tail</var> is <code>"lower"</code> and the inverse of the incomplete beta function integrated from 0 to <var>x</var> is computed. If <var>tail</var> is <code>"upper"</code> then the complementary function integrated from <var>x</var> to 1 is inverted.
es: Por defecto, <var>tail</var> es <code>"lower"</code> y se calcula la inversa de la funci&oacute;n beta incompleta integrada de 0 a <var>x</var> . Si <var>tail</var> es <code>"upper"</code> entonces la funci&oacute;n complementaria integrada de <var>x</var> a 1 se invierte.
ja: デフォルトでは、 <var>tail</var> は <code>"lower"</code> なり、0から <var>x</var> に積分された不完全ベータ関数の逆が計算されます。場合は <var>tail</var> ある <code>"upper"</code> 、その後から統合補完機能 <var>x</var> 1には反転しています。
ru: По умолчанию, <var>tail</var> является <code>"lower"</code> и обратным неполной бетой - функции интегрированной от 0 до <var>x</var> вычисляются. Если <var>tail</var> является <code>"upper"</code> , то дополнительная функция интегрирована с <var>x</var> 1 инвертируется.
zh_cn: 默认情况下， <var>tail</var> 为 <code>"lower"</code> 并计算从0到 <var>x</var> 积分的不完整beta函数的反函数。如果 <var>tail</var> 是 <code>"upper"</code> ，则从 <var>x</var> 到1 积分的互补函数将被反转。

source: By default, <var>tail</var> is <code>"lower"</code> and the inverse of the incomplete gamma function integrated from 0 to <var>x</var> is computed. If <var>tail</var> is <code>"upper"</code>, then the complementary function integrated from <var>x</var> to infinity is inverted.
es: Por defecto, la <var>tail</var> es <code>"lower"</code> y se calcula la inversa de la funci&oacute;n gamma incompleta integrada de 0 <var>x</var> . Si la <var>tail</var> es <code>"upper"</code> , entonces la funci&oacute;n complementaria integrada desde <var>x</var> hasta el infinito se invierte.
ja: デフォルトでは、 <var>tail</var> は <code>"lower"</code> 、0から <var>x</var> に積分された不完全なガンマ関数の逆が計算されます。 <var>tail</var> が <code>"upper"</code> の場合、 <var>x</var> から無限大に積分される相補関数が反転されます。
ru: По умолчанию, <var>tail</var> является <code>"lower"</code> , а обратная неполной гамма - функции интегрированного от 0 до <var>x</var> вычисляется. Если <var>tail</var> является <code>"upper"</code> , то дополнительной функция интегрированы от <var>x</var> до бесконечности инвертируется.
zh_cn: 默认情况下， <var>tail</var> 为 <code>"lower"</code> 并计算从0到 <var>x</var> 积分的不完整伽玛函数的逆。如果 <var>tail</var> 是 <code>"upper"</code> ，则从 <var>x</var> 到无穷大积分的互补函数将被反转。

source: By default, <var>y</var> is automatically normalized to the range [-1, 1]. If the range [<var>ymin</var>, <var>ymax</var>] is given, then elements of <var>y</var> that fall within the range <var>ymin</var> &le; <var>y</var> &le; <var>ymax</var> are scaled to the range [-1, 1] instead.
es: De forma predeterminada, <var>y</var> se normaliza autom&aacute;ticamente al rango [-1, 1]. Si se da el rango [ <var>ymin</var> , <var>ymax</var> ], entonces los elementos de <var>y</var> que caen dentro del rango <var>ymin</var> &le; <var>y</var> &le; <var>ymax</var> se escalan al rango [-1, 1] en su lugar.
ja: デフォルトでは、 <var>y</var> は自動的に範囲[-1、1]に正規化されます。範囲[場合 <var>ymin</var> 、 <var>ymax</var> ]が与えられ、その後の要素 <var>y</var> が範囲内に入るその <var>ymin</var> &le; <var>y</var> &le; <var>ymax</var> 範囲にスケーリングされた[-1、1]の代わりに。
ru: По умолчанию <var>y</var> автоматически нормализуется до диапазона [-1, 1]. Если <var>ymin</var> диапазон [ ymin , <var>ymax</var> ], то вместо этого элементы <var>y</var> , попадающие в диапазон <var>ymin</var> &le; <var>y</var> &le; <var>ymax</var> , масштабируются до диапазона [-1, 1].
zh_cn: 默认情况下， <var>y</var> 会自动归一化为[-1，1]范围。如果范围[ <var>ymin</var> ， <var>ymax</var> ]给出，那么元件 <var>y</var> 落在该范围内 <var>ymin</var> &le; <var>y</var> &le; <var>ymax</var> 被缩放到范围[-1,1]代替。

source: By default, Octave displays 5 significant digits in a human readable form (option &lsquo;
es: De forma predeterminada, Octave muestra 5 d&iacute;gitos significativos en una forma legible por humanos (opci&oacute;n '
ja: デフォルトでは、Octaveは5桁の有効数字を人間が読める形式で表示します（オプション '
ru: По умолчанию Octave отображает 5 значащих цифр в удобочитаемой форме (опция '
zh_cn: 默认情况下，八度以易于理解的形式显示5个有效数字（选项&ldquo;

source: By default, Octave refreshes the plot window when a prompt is printed, or when waiting for input. The <code>drawnow</code> function is used to cause a plot window to be updated.
es: De forma predeterminada, Octave actualiza la ventana de trazado cuando se imprime un mensaje o cuando se espera una entrada. La funci&oacute;n <code>drawnow</code> se utiliza para hacer que se actualice una ventana de gr&aacute;fico.
ja: デフォルトでは、プロンプトが出力されたとき、または入力を待っているときに、Octaveはプロットウィンドウを更新します。 <code>drawnow</code> 機能は、プロットウィンドウが更新させるために使用されます。
ru: По умолчанию Octave обновляет окно графика при печати приглашения или при ожидании ввода. Функция <code>drawnow</code> используется для обновления окна графика.
zh_cn: 默认情况下，八度会在打印提示或等待输入时刷新绘图窗口。该 <code>drawnow</code> 功能用于使要更新的图形窗口。
