Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/octave/octave.*.020.xlf
Languages: es, ru, zh_cn

source: The state or seed of the generator can be reset to a new random value using the <code>"reset"</code> keyword.
ru: Состояние или начальное значение генератора может быть сброшено на новое случайное значение с помощью ключевого слова <code>"reset"</code> .
zh_cn: 可以使用 <code>"reset"</code> 关键字将生成器的状态或种子重置为新的随机值。

source: The stem and leaf plot and associated displays are described in: Chapter 3,
ru: График стеблей и листьев и связанные с ним изображения описаны в разделе:Глава 3,
zh_cn: 茎叶图和相关的显示在。第三章。

source: The stem-and-leaf plot shows on each line the stem value followed by the string made up of the leaf digits. If the <var>stem_sz</var> is not 1 the successive leaf values are separated by ",".
es: El diagrama de tallo y hojas muestra en cada l&iacute;nea el valor del tallo seguido de la cadena formada por los d&iacute;gitos de la hoja. Si <var>stem_sz</var> no es 1, los valores de las hojas sucesivas est&aacute;n separados por ",".
ru: На графике &laquo;стебель-лист&raquo; в каждой строке отображается значение стержня, за которым следует строка, составленная из цифр листа. Если <var>stem_sz</var> не равен 1, следующие значения листьев разделяются ",".
zh_cn: 茎叶图在每行上显示茎值，后跟由叶数字组成的字符串。如果 <var>stem_sz</var> 不为1，则连续的叶子值用&ldquo;，&rdquo;分隔。

source: The step size to be attempted on the first step (default is determined automatically).
es: El tamaño del paso que se intentará en el primer paso (el valor por defecto se determina automáticamente).
ru: Размер шага,который будет пытаться сделать на первом шаге (по умолчанию определяется автоматически).
zh_cn: 第一步要尝试的步长大小(默认值自动确定)。

source: The stepsize has become too small, i.e., delta <var>x</var>, is less than <code><var>tol</var> * norm (x)</code>.
es: El tama&ntilde;o del paso se ha vuelto demasiado peque&ntilde;o, es decir, delta <var>x</var> , es menor que <code><var>tol</var> * norm (x)</code> .
ru: Размер шага стал слишком маленьким, т. Е. Delta <var>x</var> меньше <code><var>tol</var> * norm (x)</code> .
zh_cn: 步长变得太小，即delta <var>x</var> 小于 <code><var>tol</var> * norm (x)</code> 。

source: The storage technique used within Octave is the compressed column format. It is similar to the Yale format. <a href="#FOOT9" name="DOCF9"><sup>9</sup></a> In this format the position of each element in a row and the data are stored as previously. However, if we assume that all elements in the same column are stored adjacent in the computers memory, then we only need to store information on the number of nonzero elements in each column, rather than their positions. Thus assuming that the matrix has more nonzero elements than there are columns in the matrix, we win in terms of the amount of memory used.
es: La t&eacute;cnica de almacenamiento utilizada en Octave es el formato de columna comprimido. Es similar al formato de Yale. <a href="#FOOT9" name="DOCF9"><sup>9</sup></a> En este formato, la posici&oacute;n de cada elemento en una fila y los datos se almacenan como anteriormente. Sin embargo, si asumimos que todos los elementos de la misma columna se almacenan adyacentes en la memoria de la computadora, entonces solo necesitamos almacenar informaci&oacute;n sobre el n&uacute;mero de elementos distintos de cero en cada columna, en lugar de sus posiciones. Asumiendo que la matriz tiene m&aacute;s elementos distintos de cero que columnas en la matriz, ganamos en t&eacute;rminos de la cantidad de memoria utilizada.
ru: Метод хранения, используемый в Octave, - это формат сжатых столбцов. Он похож на формат Йельского университета. <a href="#FOOT9" name="DOCF9"><sup>9</sup></a> В этом формате положение каждого элемента в строке и данные сохраняются, как и раньше. Однако, если мы предположим, что все элементы в одном столбце хранятся рядом в памяти компьютера, то нам нужно хранить информацию только о количестве ненулевых элементов в каждом столбце, а не об их позициях. Таким образом, предполагая, что в матрице больше ненулевых элементов, чем столбцов в матрице, мы выигрываем с точки зрения объема используемой памяти.
zh_cn: Octave中使用的存储技术是压缩列格式。它类似于耶鲁格式。<a href="#FOOT9" name="DOCF9"><sup>9</sup></a>以这种格式，每个元素在行中的位置以及数据都像以前一样存储。但是，如果我们假设同一列中的所有元素都相邻存储在计算机内存中，那么我们只需要存储有关每列中非零元素数量的信息，而不是它们的位置。因此，假设矩阵具有比矩阵中的列更多的非零元素，那么就使用的内存量而言，我们获胜。

source: The string <var>default</var> identifies the default button, which is activated by pressing the
es: La cadena <var>default</var> identifica el bot&oacute;n predeterminado, que se activa presionando el
ru: Строка по <var>default</var> определяет кнопку по умолчанию, которая активируется нажатием
zh_cn: 字符串 <var>default</var> 标识默认按钮，可以通过按

source: The string <var>format</var> describes how the words in <var>str</var> should be parsed. As in <var>fscanf</var>, any (non-whitespace) text in the format that is not one of these specifiers is considered a literal. If there is a literal between two format specifiers then that same literal must appear in the input stream between the matching words.
es: El <var>format</var> o de cadena describe c&oacute;mo se deben analizar las palabras en <var>str</var> . Como en <var>fscanf</var> , cualquier texto (sin espacios en blanco) en el formato que no sea uno de estos especificadores se considera literal. Si hay un literal entre dos especificadores de formato, ese mismo literal debe aparecer en el flujo de entrada entre las palabras coincidentes.
ru: Строка <var>format</var> описывает , как слова <var>str</var> должны быть разобраны. Как и в <var>fscanf</var> , любой текст (без пробелов) в формате, который не является одним из этих спецификаторов, считается литералом. Если между двумя описателями формата есть литерал, то этот же литерал должен появиться во входном потоке между совпадающими словами.
zh_cn: 字符串 <var>format</var> 描述了应如何解析 <var>str</var> 中的单词。与 <var>fscanf</var> 中一样，格式不是这些说明符之一的任何（非空白）文本都被视为文字。如果两个格式说明符之间有一个文字，则该相同的文字必须出现在匹配单词之间的输入流中。

source: The string <var>format</var> describes how the words in <var>str</var> should be parsed. It may contain any combination of the following specifiers:
es: El <var>format</var> o de cadena describe c&oacute;mo se deben analizar las palabras en <var>str</var> . Puede contener cualquier combinaci&oacute;n de los siguientes especificadores:
ru: Строка <var>format</var> описывает , как слова <var>str</var> должны быть разобраны. Он может содержать любую комбинацию следующих спецификаторов:
zh_cn: 字符串 <var>format</var> 描述了应如何解析 <var>str</var> 中的单词。它可以包含以下说明符的任意组合：

source: The string <var>str</var> is split into words that are repeatedly matched to the specifiers in <var>format</var>. The first word is matched to the first specifier, the second to the second specifier and so forth. If there are more words than specifiers, the process is repeated until all words have been processed.
es: La cadena <var>str</var> se divide en palabras que coinciden repetidamente con los especificadores en <var>format</var> o . La primera palabra coincide con el primer especificador, la segunda con el segundo especificador y as&iacute; sucesivamente. Si hay m&aacute;s palabras que especificadores, el proceso se repite hasta que se hayan procesado todas las palabras.
ru: Строка <var>str</var> разбивается на слова, которые многократно сопоставляются со спецификаторами в <var>format</var> . Первое слово соответствует первому спецификатору, второе - второму спецификатору и так далее. Если слов больше, чем спецификаторов, процесс повторяется до тех пор, пока все слова не будут обработаны.
zh_cn: 字符串 <var>str</var> 分为多个单词，这些单词与 <var>format</var> 的说明符重复匹配。第一个单词与第一个说明符匹配，第二个与第二个说明符匹配，依此类推。如果单词多于指定符，则重复该过程，直到处理完所有单词为止。

source: The string <var>str</var> or file associated with <var>fid</var> is read from and parsed according to <var>format</var>. The function is an extension of <code>strread</code> and <code>textread</code>. Differences include: the ability to read from either a file or a string, additional options, and additional format specifiers.
es: La cadena <var>str</var> o el archivo asociado con <var>fid</var> se lee y analiza seg&uacute;n el <var>format</var> o . La funci&oacute;n es una extensi&oacute;n de <code>strread</code> y <code>textread</code> . Las diferencias incluyen: la capacidad de leer desde un archivo o una cadena, opciones adicionales y especificadores de formato adicionales.
ru: Строка <var>str</var> или файл, связанный с <var>fid</var> , считывается и анализируется в соответствии с <var>format</var> . Функция является расширением <code>strread</code> и <code>textread</code> . Различия включают: возможность чтения из файла или строки, дополнительные параметры и дополнительные спецификаторы формата.
zh_cn: 与 <var>fid</var> 关联的字符串 <var>str</var> 或文件是根据 <var>format</var> 读取和解析的。该功能是 <code>strread</code> 和 <code>textread</code> 的扩展。区别包括：从文件或字符串中读取的功能，其他选项以及其他格式说明符。

source: The string <var>try</var> is evaluated in the current context, so any results remain available after <code>eval</code> returns.
es: La cadena <var>try</var> se eval&uacute;a en el contexto actual, por lo que cualquier resultado permanece disponible despu&eacute;s de que <code>eval</code> regrese.
ru: Строка <var>try</var> оценивается в текущем контексте, поэтому любые результаты остаются доступными после возврата <code>eval</code> .
zh_cn: <var>try</var> 字符串是在当前上下文中求值的，因此在 <code>eval</code> 返回之后，任何结果仍然可用。

source: The string argument <var>s</var> may be a character array or a cell array of strings. If <var>s</var> has more than one row, each row is used to create a separate text object after a mouse click. For example:
zh_cn: 字符串参数 <var>s</var> 可以是字符串的字符数组或单元格数组。如果 <var>s</var> 有多行，则在单击鼠标后，将使用每一行来创建单独的文本对象。例如：

source: The string can be converted back into a matrix as follows:
es: La cuerda puede ser convertida de nuevo en una matriz de la siguiente manera:
ru: Строка может быть преобразована обратно в матрицу следующим образом:
zh_cn: 字符串可以转换成矩阵,如下所示。

source: The string input argument <code>"verbose"</code> is supported for <small>MATLAB</small> compatibility, but has no effect.
es: El argumento de entrada de cadena <code>"verbose"</code> es compatible con <small>MATLAB</small> , pero no tiene ning&uacute;n efecto.
ru: Строковый входной аргумент <code>"verbose"</code> поддерживается для совместимости с <small>MATLAB</small> , но не имеет никакого эффекта.
zh_cn: <small>MATLAB</small>兼容性支持字符串输入参数 <code>"verbose"</code> ，但无效。<small></small>

source: The string is written to the file with no additional formatting. Use <code>fdisp</code> instead to automatically append a newline character appropriate for the local machine.
es: La cadena se escribe en el archivo sin formato adicional. Use <code>fdisp</code> en su lugar para agregar autom&aacute;ticamente un car&aacute;cter de nueva l&iacute;nea apropiado para la m&aacute;quina local.
ru: Строка записывается в файл без дополнительного форматирования. <code>fdisp</code> этого используйте fdisp для автоматического добавления символа новой строки, подходящего для локального компьютера.
zh_cn: 字符串将以其他格式写入文件。而是使用 <code>fdisp</code> 自动添加适合本地计算机的换行符。

source: The string is written verbatim to the standard output. Use <code>disp</code> to automatically append a newline character appropriate for the local machine.
es: La cadena se escribe literalmente en la salida est&aacute;ndar. Utilice <code>disp</code> para agregar autom&aacute;ticamente un car&aacute;cter de nueva l&iacute;nea apropiado para la m&aacute;quina local.
ru: Строка дословно выводится на стандартный вывод. Используйте <code>disp</code> для автоматического добавления символа новой строки, подходящего для локального компьютера.
zh_cn: 该字符串将逐字写入标准输出。使用 <code>disp</code> 自动添加适合本地计算机的换行符。

source: The string must be in one of the following formats where a and b are real numbers and the complex unit is <code>'i'</code> or <code>'j'</code>:
es: La cadena debe tener uno de los siguientes formatos, donde ayb son n&uacute;meros reales y la unidad compleja es <code>'i'</code> o <code>'j'</code> :
ru: Строка должна быть в одном из следующих форматов, где a и b - действительные числа, а комплексная единица - <code>'i'</code> или <code>'j'</code> :
zh_cn: 字符串必须采用以下格式之一，其中a和b是实数，而复数单位是 <code>'i'</code> 或 <code>'j'</code> ：

source: The string representation used by Octave is an array of characters, so internally the string <code>"dddddddddd"</code> is actually a row vector of length 10 containing the value 100 in all places (100 is the ASCII code of <code>"d"</code>). This lends itself to the obvious generalization to character matrices. Using a matrix of characters, it is possible to represent a collection of same-length strings in one variable. The convention used in Octave is that each row in a character matrix is a separate string, but letting each column represent a string is equally possible.
es: La representaci&oacute;n de cadena utilizada por Octave es una matriz de caracteres, por lo que internamente la cadena <code>"dddddddddd"</code> es en realidad un vector de fila de longitud 10 que contiene el valor 100 en todos los lugares (100 es el c&oacute;digo ASCII de <code>"d"</code> ). Esto se presta a la generalizaci&oacute;n obvia a las matrices de caracteres. Usando una matriz de caracteres, es posible representar una colecci&oacute;n de cadenas de la misma longitud en una variable. La convenci&oacute;n utilizada en Octave es que cada fila en una matriz de caracteres es una cadena separada, pero dejar que cada columna represente una cadena es igualmente posible.
ru: Строковое представление, используемое Octave, представляет собой массив символов, поэтому внутренне строка <code>"dddddddddd"</code> фактически представляет собой вектор-строку длиной 10, содержащий значение 100 во всех местах (100 - это код ASCII для <code>"d"</code> ). Это поддается очевидному обобщению на матрицы характеров. Используя матрицу символов, можно представить набор строк одинаковой длины в одной переменной. Соглашение, используемое в Octave, состоит в том, что каждая строка в символьной матрице является отдельной строкой, но в равной степени возможно позволить каждому столбцу представлять строку.
zh_cn: Octave使用的字符串表示形式是一个字符数组，因此在内部字符串 <code>"dddddddddd"</code> 实际上是一个长度为10的行向量，在所有位置都包含值100（100是 <code>"d"</code> 的ASCII码）。这有助于对字符矩阵进行明显的概括。使用字符矩阵，可以在一个变量中表示一组等长字符串。Octave中使用的约定是，字符矩阵中的每一行都是一个单独的字符串，但是让每一列代表一个字符串也是可能的。

source: The string to use for the help text of the function.
es: La cadena a utilizar para el texto de ayuda de la función.
ru: Строка,которую необходимо использовать для текста справки функции.
zh_cn: 用于函数帮助文本的字符串。

source: The structure <var>options</var> can have the following field names. If a field name is not specified, the default value is used:
es: Las <var>options</var> estructura pueden tener los siguientes nombres de campo. Si no se especifica un nombre de campo, se utiliza el valor predeterminado:
ru: Структурные <var>options</var> могут иметь следующие имена полей. Если имя поля не указано, используется значение по умолчанию:
zh_cn: 结构 <var>options</var> 可以具有以下字段名称。如果未指定字段名称，则使用默认值：

source: The structure <var>s</var> always contains these three fields:
es: La estructura <var>s</var> siempre contiene estos tres campos:
ru: Структура <var>s</var> всегда содержит эти три поля:
zh_cn: 结构 <var>s</var> 始终包含以下三个字段：

source: The structure must contain the fields <code>"handle"</code>, <code>"type"</code>, <code>"children"</code>, <code>"properties"</code>, and <code>"special"</code>.
es: La estructura debe contener los campos <code>"handle"</code> , <code>"type"</code> , <code>"children"</code> , <code>"properties"</code> y <code>"special"</code> .
ru: Структура должна содержать поля <code>"handle"</code> , <code>"type"</code> , <code>"children"</code> , <code>"properties"</code> и <code>"special"</code> .
zh_cn: 结构必须包含字段 <code>"handle"</code> ， <code>"type"</code> ， <code>"children"</code> ， <code>"properties"</code> 和 <code>"special"</code> 。

source: The style to use for the plot can be defined with a line style <var>style</var> of the same format as the <code>plot</code> command.
es: El estilo que se utilizar&aacute; para el trazado se puede definir con un estilo de <var>style</var> de l&iacute;nea del mismo formato que el comando de <code>plot</code> .
ru: Стиль использование для участка может быть определен с помощью стиля линии <var>style</var> того же формата, что и <code>plot</code> команды.
zh_cn: 样式，以使用的情节可以以线型被定义 <var>style</var> 的相同的格式的 <code>plot</code> 命令。

source: The style to use for the plot can be defined with a line style <var>style</var> of the same format as the <code>plot</code> command. If a marker is specified then the markers are drawn at the origin of the vectors (which are the grid points defined by <var>x</var> and <var>y</var>). When a marker is specified, the arrowhead is not drawn. If the argument <code>"filled"</code> is given then the markers are filled.
es: El estilo que se utilizar&aacute; para el trazado se puede definir con un estilo de <var>style</var> de l&iacute;nea del mismo formato que el comando de <code>plot</code> . Si se especifica un marcador entonces los marcadores se dibujan en el origen de los vectores (que son los puntos de cuadr&iacute;cula definidas por <var>x</var> y <var>y</var> ). Cuando se especifica un marcador, la punta de flecha no se dibuja. Si se da el argumento <code>"filled"</code> , los marcadores se rellenan.
ru: Стиль использование для участка может быть определен с помощью стиля линии <var>style</var> того же формата, что и <code>plot</code> команды. Если маркер указан, то маркеры рисуются в начале векторов (которые являются точками сетки, определяемыми <var>x</var> и <var>y</var> ). Когда маркер указан, стрелка не отображается. Если указан аргумент <code>"filled"</code> то маркеры заполняются.
zh_cn: 样式，以使用的情节可以以线型被定义 <var>style</var> 的相同的格式的 <code>plot</code> 命令。如果指定了标记，则将标记绘制在向量的原点（它们是 <var>x</var> 和 <var>y</var> 定义的网格点）上。指定标记时，不会绘制箭头。如果给出参数 <code>"filled"</code> ，则标记将被填充。

source: The style to use for the plot can be defined with a line style <var>style</var> of the same format as the <code>plot</code> command. If a marker is specified then the markers are drawn at the origin of the vectors (which are the grid points defined by <var>x</var>, <var>y</var>, <var>z</var>). When a marker is specified, the arrowhead is not drawn. If the argument <code>"filled"</code> is given then the markers are filled.
es: El estilo que se utilizar&aacute; para el trazado se puede definir con un estilo de <var>style</var> de l&iacute;nea del mismo formato que el comando de <code>plot</code> . Si se especifica un marcador, los marcadores se dibujan en el origen de los vectores (que son los puntos de la cuadr&iacute;cula definidos por <var>x</var> , <var>y</var> , <var>z</var> ). Cuando se especifica un marcador, la punta de flecha no se dibuja. Si se da el argumento <code>"filled"</code> , los marcadores se rellenan.
ru: Стиль использование для участка может быть определен с помощью стиля линии <var>style</var> того же формата, что и <code>plot</code> команды. Если маркер указан, то маркеры рисуются в начале векторов (которые являются точками сетки, определяемыми <var>x</var> , <var>y</var> , <var>z</var> ). Когда маркер указан, стрелка не отображается. Если указан аргумент <code>"filled"</code> то маркеры заполняются.
zh_cn: 样式，以使用的情节可以以线型被定义 <var>style</var> 的相同的格式的 <code>plot</code> 命令。如果指定了标记，则将标记绘制在向量的原点（它们是 <var>x</var> ， <var>y</var> ， <var>z</var> 定义的网格点）上。指定标记时，不会绘制箭头。如果给出参数 <code>"filled"</code> ，则标记将被填充。

source: The subscript <var>idx</var> must be a structure array with fields &lsquo;
es: El sub&iacute;ndice <var>idx</var> debe ser una matriz de estructura con campos '
ru: Индекс <var>idx</var> должен быть структурным массивом с полями '
zh_cn: 下标 <var>idx</var> 必须是具有字段&ldquo;

source: The subscripts are defined by the index vector <var>subs</var>. The dimension is specified by <var>dim</var>. If not given, it defaults to the first non-singleton dimension. The length of <var>subs</var> must be equal to <code>size (<var>vals</var>, <var>dim</var>)</code>.
es: Los sub&iacute;ndices se definen por el &iacute;ndice de vector <var>subs</var> . La dimensi&oacute;n se especifica mediante <var>dim</var> . Si no se proporciona, toma de forma predeterminada la primera dimensi&oacute;n que no es singleton. La longitud de los <var>subs</var> debe ser igual al <code>size (<var>vals</var>, <var>dim</var>)</code> .
ru: Индексы определяются индексом вектора <var>subs</var> . Размер указан <var>dim</var> . Если не указан, по умолчанию используется первое не одноэлементное измерение. Длина <var>subs</var> должна быть равна <code>size (<var>vals</var>, <var>dim</var>)</code> .
zh_cn: 下标由索引向量 <var>subs</var> 定义。尺寸由 <var>dim</var> 指定。如果未给出，则默认为第一个非单维。 <var>subs</var> 的长度必须等于 <code>size (<var>vals</var>, <var>dim</var>)</code> 。

source: The subscripts are defined by the rows of the matrix <var>subs</var> and the values by <var>vals</var>. Each row of <var>subs</var> corresponds to one of the values in <var>vals</var>. If <var>vals</var> is a scalar, it will be used for each of the row of <var>subs</var>. If <var>subs</var> is a cell array of vectors, all vectors must be of the same length, and the subscripts in the <var>k</var>th vector must correspond to the <var>k</var>th dimension of the result.
es: Los sub&iacute;ndices se definen por las filas de los <var>subs</var> de la matriz y los valores por <var>vals</var> . Cada fila de <var>subs</var> corresponde a uno de los valores en <var>vals</var> . Si <var>vals</var> es un escalar, se usar&aacute; para cada una de las filas de <var>subs</var> . Si <var>subs</var> es una matriz de vectores de celdas, todos los vectores deben tener la misma longitud y los sub&iacute;ndices del <var>k</var> - &eacute;simo vector deben corresponder a la <var>k</var> - &eacute;sima dimensi&oacute;n del resultado.
ru: Индексы определяются строками <var>subs</var> матрицы, а значения - <var>vals</var> . Каждая строка <var>subs</var> соответствует одному из значений в <var>vals</var> . Если <var>vals</var> - скаляр, он будет использоваться для каждой строки <var>subs</var> . Если <var>subs</var> - это массив ячеек векторов, все векторы должны быть одинаковой длины, а индексы в <var>k</var> - м векторе должны соответствовать <var>k</var> - му измерению результата.
zh_cn: 下标是由矩阵的行定义的 <var>subs</var> 和值由 <var>vals</var> 。每一行 <var>subs</var> 对应于 <var>vals</var> 中的值之一。如果 <var>vals</var> 是一个标量，它将用于 <var>subs</var> 的每一行。如果 <var>subs</var> 是向量的单元格数组，则所有向量的长度必须相同，并且第 <var>k</var> 个向量中的下标必须与结果的第 <var>k</var> 个维度相对应。

source: The supported property types are:
es: Los tipos de propiedad apoyados son:
ru: Поддерживаемые типы свойств:
zh_cn: 支持的属性类型有:
