Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/octave/octave.*.011.xlf
Languages: es, ja, ru, zh_cn

source: An alternative is to convert the data to a different container, such as a matrix or a data structure. Depending on the data this is possible using the <code>cell2mat</code> and <code>cell2struct</code> functions.
es: Una alternativa es convertir los datos a un contenedor diferente, como una matriz o una estructura de datos. Dependiendo de los datos, esto es posible usando las funciones <code>cell2mat</code> y <code>cell2struct</code> .
ja: 別の方法は、データをマトリックスやデータ構造などの別のコンテナーに変換することです。データに応じて、これは使用可能です <code>cell2mat</code> と <code>cell2struct</code> 機能を。
ru: Альтернативой является преобразование данных в другой контейнер, такой как матрица или структура данных. В зависимости от данных это возможно с помощью <code>cell2mat</code> и <code>cell2struct</code> .
zh_cn: 一种替代方法是将数据转换为其他容器，例如矩阵或数据结构。根据数据，可以使用 <code>cell2mat</code> 和 <code>cell2struct</code> 函数。

source: An array containing the lower bound on each of the variables. If <var>lb</var> is not supplied, the default lower bound for the variables is zero.
es: Una matriz que contiene el l&iacute;mite inferior de cada una de las variables. Si no se proporciona <var>lb</var> , el l&iacute;mite inferior predeterminado para las variables es cero.
ja: 各変数の下限を含む配列。 <var>lb</var> が指定されていない場合、変数のデフォルトの下限はゼロです。
ru: Массив, содержащий нижнюю границу каждой из переменных. Если <var>lb</var> не указан, нижняя граница по умолчанию для переменных равна нулю.
zh_cn: 包含每个变量下限的数组。如果未提供 <var>lb</var> ，则变量的默认下限为零。

source: An array containing the upper bound on each of the variables. If <var>ub</var> is not supplied, the default upper bound is assumed to be infinite.
es: Una matriz que contiene el l&iacute;mite superior de cada una de las variables. Si no se proporciona <var>ub</var> , se supone que el l&iacute;mite superior predeterminado es infinito.
ja: 各変数の上限を含む配列。 <var>ub</var> が指定されていない場合、デフォルトの上限は無限であると見なされます。
ru: Массив, содержащий верхнюю границу каждой из переменных. Если <var>ub</var> не указан, предполагается, что верхняя граница по умолчанию бесконечна.
zh_cn: 包含每个变量上限的数组。如果未提供 <var>ub</var> ，则默认上限为无限大。

source: An array of characters containing the sense of each constraint in the constraint matrix. Each element of the array may be one of the following values
es: Un conjunto de caracteres que contienen el sentido de cada restricción en la matriz de restricciones.Cada elemento de la matriz puede ser uno de los siguientes valores
ja: 制約行列の各制約の意味を含む文字の配列。配列の各要素は、以下の値のいずれかになります。
ru: Массив символов,содержащий смысл каждого ограничения в матрице ограничений.Каждый элемент массива может быть одним из следующих значений
zh_cn: 一个字符数组,包含约束矩阵中每个约束的意义。数组中的每个元素可以是下列数值之一

source: An array of pointers to input arguments.
es: Una serie de indicadores para introducir argumentos.
ja: 入力引数へのポインタの配列。
ru: Массив указателей на входные аргументы.
zh_cn: 一个指向输入参数的指针数组。

source: An array of pointers to return arguments.
es: Una serie de indicaciones para devolver los argumentos.
ja: 引数を返すポインタの配列。
ru: Массив указателей для возврата аргументов.
zh_cn: 返回参数的指针数组。

source: An array with &lsquo;
es: Una matriz con '
ja: 'を含む配列
ru: Массив с '
zh_cn: 带有'的数组

source: An assignment is an expression, so it has a value. Thus, <code>z = 1</code> as an expression has the value 1. One consequence of this is that you can write multiple assignments together:
es: Una asignaci&oacute;n es una expresi&oacute;n, por lo que tiene un valor. Por lo tanto, <code>z = 1</code> como expresi&oacute;n tiene el valor 1. Una consecuencia de esto es que puede escribir varias asignaciones juntas:
ja: 代入は式なので、値があります。したがって、式としての <code>z = 1</code> の値は1です。これの1つの結果は、複数の割り当てを一緒に記述できることです。
ru: Присвоение - это выражение, поэтому у него есть значение. Таким образом, <code>z = 1</code> как выражение имеет значение 1. Одним из следствий этого является то, что вы можете записывать несколько присваиваний вместе:
zh_cn: 赋值是一个表达式，因此它具有一个值。因此， <code>z = 1</code> 作为表达式的值为1。其结果是您可以一起编写多个赋值：

source: An attempt is made to approximate the cost of individual operations, but it is wildly inaccurate. You can improve the stability somewhat by doing more work for each <code>n</code>. For example:
es: Se intenta aproximar el costo de las operaciones individuales, pero es tremendamente inexacto. Puede mejorar un poco la estabilidad haciendo m&aacute;s trabajo para cada <code>n</code> . Por ejemplo:
ja: 個々の操作のコストを概算する試みが行われますが、非常に不正確です。各 <code>n</code> に対してより多くの作業を行うことにより、安定性をある程度向上させることができます。例えば：
ru: Предпринята попытка приблизительно оценить стоимость отдельных операций, но это дико неточно. Вы можете немного улучшить стабильность, выполнив больше работы для каждого <code>n</code> . Например:
zh_cn: 试图估算单个操作的成本，但这是非常不准确的。您可以通过对每个 <code>n</code> 进行更多工作来稍微提高稳定性。例如：

source: An easy way to get an overview over the collected data is <code>profshow</code>. This function takes the profiler data returned by <code>profile</code> as input and prints a flat profile, for instance:
es: Una forma sencilla de obtener una descripci&oacute;n general de los datos recopilados es <code>profshow</code> . Esta funci&oacute;n toma los datos del generador de perfiles devueltos por el <code>profile</code> como entrada e imprime un perfil plano, por ejemplo:
ja: 収集されたデータの概要を取得する簡単な方法は、 <code>profshow</code> です。この関数は、 <code>profile</code> から返されたプロファイラーデータを入力として受け取り、フラットプロファイルを出力します。次に例を示します。
ru: Простой способ получить обзор собранных данных - это <code>profshow</code> . Эта функция принимает данные профилировщика, возвращаемые <code>profile</code> качестве входных данных и печатает плоский профиль, например:
zh_cn: <code>profshow</code> 是获得所收集数据概览的一种简单方法。此函数将概要 <code>profile</code> 返回的概要文件数据作为输入，并打印平面概要文件，例如：

source: An equality constraint (<code>A(i,:)*x = b(i)</code>).
es: Una restricci&oacute;n de igualdad ( <code>A(i,:)*x = b(i)</code> ).
ja: 等式制約（ <code>A(i,:)*x = b(i)</code> ）。
ru: Ограничение равенства ( <code>A(i,:)*x = b(i)</code> ).
zh_cn: 等式约束（ <code>A(i,:)*x = b(i)</code> ）。

source: An equivalent definition is
es: Una definición equivalente es
ja: 同等の定義は
ru: Эквивалентным определением является
zh_cn: 相应的定义是:

source: An equivalent form of the equation is:
es: Una forma equivalente de la ecuación es:
ja: 等価な式は次のようになります。
ru: Эквивалентная форма уравнения:
zh_cn: 方程的等效形式是:

source: An error is something that occurs when a program is in a state where it doesn&rsquo;t make sense to continue. An example is when a function is called with too few input arguments. In this situation the function should abort with an error message informing the user of the lacking input arguments.
es: Un error es algo que ocurre cuando un programa se encuentra en un estado en el que no tiene sentido continuar. Un ejemplo es cuando se llama a una funci&oacute;n con muy pocos argumentos de entrada. En esta situaci&oacute;n, la funci&oacute;n debe abortar con un mensaje de error que informe al usuario de los argumentos de entrada que faltan.
ja: エラーは、プログラムが続行しても意味がない状態にあるときに発生するものです。例として、入力引数が少なすぎる関数が呼び出された場合があります。この状況では、入力引数がないことをユーザーに通知するエラーメッセージが表示され、関数は異常終了するはずです。
ru: Ошибка - это то, что происходит, когда программа находится в состоянии, в котором нет смысла продолжать. Примером может служить вызов функции с слишком небольшим количеством входных аргументов. В этой ситуации функция должна прерваться с сообщением об ошибке, информирующим пользователя об отсутствии входных аргументов.
zh_cn: 错误是指程序处于无法继续执行的状态时发生的事情。一个例子是调用输入参数太少的函数。在这种情况下，该函数应中止并显示一条错误消息，通知用户缺少输入参数。

source: An error message is printed if the dimensions of the arguments do not agree, or if either argument is complex.
es: Se imprime un mensaje de error si las dimensiones de los argumentos no concuerdan,o si alguno de los argumentos es complejo.
ja: 引数の寸法が一致しない場合や、どちらかの引数が複雑な場合は、エラーメッセージが表示されます。
ru: Сообщение об ошибке выводится,если размеры аргументов не совпадают,или если любой из аргументов является сложным.
zh_cn: 如果参数的尺寸不一致,或者任何一个参数是复杂的,就会打印一个错误信息。

source: An error results if the dimensions of the arguments do not agree, or if either of the arguments is complex.
es: Se produce un error si las dimensiones de los argumentos no coinciden,o si alguno de los argumentos es complejo.
ja: 引数の次元が一致しない場合や、どちらかの引数が複雑な場合にエラーが発生します。
ru: Ошибка возникает,если размеры аргументов не совпадают,или если один из аргументов является сложным.
zh_cn: 如果参数的尺寸不一致,或者参数中的任何一个是复杂的,就会产生错误。

source: An event such as <code>error</code>, <code>interrupt</code>, or <code>warning</code> (see <a href="#XREFdbstop">dbstop</a> for details).
es: Un evento como <code>error</code> , <code>interrupt</code> o <code>warning</code> (consulte <a href="#XREFdbstop">dbstop</a> para obtener m&aacute;s detalles).
ja: <code>error</code> 、 <code>interrupt</code> 、 <code>warning</code> などのイベント（詳細は<a href="#XREFdbstop">dbstop</a>を参照）。
ru: Событие, такое как <code>error</code> , <code>interrupt</code> или <code>warning</code> ( подробности см. В <a href="#XREFdbstop">dbstop</a> ).
zh_cn: 一个事件，例如 <code>error</code> ， <code>interrupt</code> 或 <code>warning</code> （有关详细信息，请参见<a href="#XREFdbstop">dbstop</a>）。

source: An example <code>mtimes</code> method for the polynomial class might look like
es: Un ejemplo de m&eacute;todo <code>mtimes</code> para la clase polinomial podr&iacute;a verse como
ja: 多項式クラスの <code>mtimes</code> メソッドの例は次のようになります。
ru: Пример метода <code>mtimes</code> для полиномиального класса может выглядеть так:
zh_cn: 多项式类的示例 <code>mtimes</code> 方法可能看起来像

source: An example from Octave&rsquo;s built-in char class demonstrates the interpreter behavior when <code>isnull</code> is used correctly.
es: Un ejemplo de la clase char incorporada de Octave demuestra el comportamiento del int&eacute;rprete cuando <code>isnull</code> se usa correctamente.
ja: Octaveの組み込みcharクラスの例は、 <code>isnull</code> が正しく使用されている場合のインタープリターの動作を示しています。
ru: Пример из встроенного класса char в Octave демонстрирует поведение интерпретатора при <code>isnull</code> использовании isnull .
zh_cn: Octave内置char类的示例演示了 <code>isnull</code> 使用isull时解释器的行为。

source: An example of a <code>disp</code> method for the polynomial class might be
es: Un ejemplo de un m&eacute;todo <code>disp</code> para la clase polinomial podr&iacute;a ser
ja: 多項式クラスの <code>disp</code> メソッドの例は、
ru: Примером метода <code>disp</code> для полиномиального класса может быть
zh_cn: 多项式类的 <code>disp</code> 方法的示例可能是

source: An example of a Delaunay triangulation of a set of points is
es: Un ejemplo de una triangulación de Delaunay de un conjunto de puntos es
ja: 点の集合を三角測量したデローネの例は
ru: Пример триангуляции множества точек Делоне -
zh_cn: 一组点的德劳内三角测量的例子是

source: An example of an isosurface geometry with different additional coloring:
es: Un ejemplo de una geometría de isosuperficie con diferente coloración adicional:
ja: 色付けを変えたアイソサーフェスジオメトリの例。
ru: Пример геометрии изоповерхности с различной дополнительной раскраской:
zh_cn: 一个具有不同附加着色的等曲面几何体的例子。

source: An example of calling <code>sqp</code>:
es: Un ejemplo de llamar a <code>sqp</code> :
ja: <code>sqp</code> を呼び出す例：
ru: Пример вызова <code>sqp</code> :
zh_cn: 调用 <code>sqp</code> 的示例：

source: An example of creating and filling a matrix might be
es: Un ejemplo de creación y llenado de una matriz podría ser
ja: マトリックスの作成と塗りつぶしの例は次のようになります。
ru: Примером создания и заполнения матрицы может служить
zh_cn: 创建和填充矩阵的一个例子可能是

source: An example of its expected output is
es: Un ejemplo de su producción prevista es
ja: 期待される出力の例としては
ru: Примером его ожидаемой производительности является
zh_cn: 其预期产出的一个例子是

source: An example of its use is
es: Un ejemplo de su uso es
ja: その使用例としては
ru: Примером его использования является
zh_cn: 其使用的一个例子是

source: An example of its use is:
es: Un ejemplo de su uso es:
ja: その使用例としては
ru: Пример его использования:
zh_cn: 其使用的一个例子是:

source: An example of the behavior of this function within Octave is then
es: Un ejemplo del comportamiento de esta función dentro de la Octava es entonces
ja: Octave内でのこの関数の動作の例を以下に示します。
ru: Пример поведения этой функции в пределах Октавы.
zh_cn: 这个函数在Octave中的行为举例如下。

source: An example of the inclusion of a Fortran function in an oct-file is given in the following example, where the C++ wrapper is
es: Un ejemplo de la inclusión de una función de Fortran en un archivo oct-file se da en el siguiente ejemplo,donde el envoltorio de C++es
ja: オクトファイルにFortran関数を含める例を次の例に示します。
ru: Пример включения функции Fortran в окта-файл приведен в следующем примере,где обертка C++-это
zh_cn: 下面是一个在oct-file中包含Fortran函数的例子,其中C++封装器是

source: An example of the use of <code>accumdim</code> is:
es: Un ejemplo del uso de <code>accumdim</code> es:
ja: <code>accumdim</code> の使用例は次のとおりです。
ru: Пример использования <code>accumdim</code> :
zh_cn: 使用 <code>accumdim</code> 的一个示例是：

source: An example of the use of <code>clabel</code> is
es: Un ejemplo del uso de <code>clabel</code> es
ja: <code>clabel</code> の使用例は次のとおりです。
ru: Пример использования <code>clabel</code> :
zh_cn: 使用 <code>clabel</code> 的示例是

source: An example of the use of <code>convhull</code> is
es: Un ejemplo del uso de <code>convhull</code> es
ja: <code>convhull</code> の使用例は次のとおりです。
ru: Пример использования <code>convhull</code> :
zh_cn: 使用 <code>convhull</code> 的示例是

source: An example of the use of <code>dsearch</code>, using the above values of <var>x</var>, <var>y</var> and <var>tri</var> is
es: Un ejemplo del uso de <code>dsearch</code> , utilizando los valores anteriores de <var>x</var> , <var>y</var> y <var>tri</var> es
ja: 上記の <var>x</var> 、 <var>y</var> 、 <var>tri</var> の値を使用した <code>dsearch</code> の使用例は次のとおりです。
ru: Пример использования <code>dsearch</code> с использованием вышеуказанных значений <var>x</var> , <var>y</var> и <var>tri</var> :
zh_cn: 使用 <code>dsearch</code> 的示例（使用 <var>x</var> ， <var>y</var> 和 <var>tri</var> 的上述值）是

source: An example of the use of <code>inpolygon</code> might be
es: Un ejemplo del uso de <code>inpolygon</code> podr&iacute;a ser
ja: 使用例 <code>inpolygon</code> があるかもしれません
ru: Примером использования <code>inpolygon</code> может быть
zh_cn: 使用 <code>inpolygon</code> 的示例可能是

source: An example of the use of <code>interp1</code> is
es: Un ejemplo del uso de <code>interp1</code> es
ja: <code>interp1</code> の使用例は次のとおりです。
ru: Пример использования <code>interp1</code> :
zh_cn: 使用 <code>interp1</code> 的示例是

source: An example of the use of <code>linkprop</code> is
es: Un ejemplo del uso de <code>linkprop</code> es
ja: <code>linkprop</code> の使用例は次のとおりです。
ru: Пример использования <code>linkprop</code> :
zh_cn: 使用 <code>linkprop</code> 的一个示例是

source: An example of the use of <code>pareto</code> is
es: Un ejemplo del uso de <code>pareto</code> es
ja: <code>pareto</code> の使用例は
ru: Пример использования <code>pareto</code> :
zh_cn: 使用 <code>pareto</code> 的一个示例是

source: An example of the use of <code>polyarea</code> might be
es: Un ejemplo del uso de <code>polyarea</code> podr&iacute;a ser
ja: 使用例 <code>polyarea</code> があるかもしれません
ru: Примером использования <code>polyarea</code> может быть
zh_cn: 使用多 <code>polyarea</code> 一个例子可能是

source: An example of the use of <code>refreshdata</code> is:
es: Un ejemplo del uso de <code>refreshdata</code> es:
ja: <code>refreshdata</code> の使用例は次のとおりです。
ru: Пример использования <code>refreshdata</code> :
zh_cn: 使用 <code>refreshdata</code> 的一个示例是：

source: An example of the use of <code>surfnorm</code> is
es: Un ejemplo del uso de <code>surfnorm</code> es
ja: <code>surfnorm</code> の使用例は
ru: Пример использования <code>surfnorm</code> :
zh_cn: 使用 <code>surfnorm</code> 的一个示例是

source: An example of the use of <code>tsearch</code> can be seen with the simple triangulation
es: Un ejemplo del uso de <code>tsearch</code> se puede ver con la triangulaci&oacute;n simple
ja: <code>tsearch</code> の使用例は、単純な三角形分割で見ることができます
ru: Пример использования <code>tsearch</code> можно увидеть с помощью простой триангуляции
zh_cn: 通过简单的三角剖分可以看到使用 <code>tsearch</code> 的示例

source: An example of the use of <code>voronoi</code> is
es: Un ejemplo del uso de <code>voronoi</code> es
ja: <code>voronoi</code> の使用例は
ru: Пример использования <code>voronoi</code> :
zh_cn: <code>voronoi</code> 的使用示例是

source: An example of the use of the <code>griddata</code> function is
es: Un ejemplo del uso de la funci&oacute;n <code>griddata</code> es
ja: <code>griddata</code> 関数の使用例は次のとおりです。
ru: Пример использования функции <code>griddata</code> :
zh_cn: 使用 <code>griddata</code> 函数的一个示例是

source: An example of the use of these two functions might be
es: Un ejemplo de la utilización de estas dos funciones podría ser
ja: この2つの関数の使用例としては、次のようなものが考えられます。
ru: Примером использования этих двух функций может быть следующее
zh_cn: 使用这两个函数的一个例子可能是

source: An example of the use of this function is
es: Un ejemplo del uso de esta función es
ja: この関数の使用例としては
ru: Примером использования этой функции является
zh_cn: 使用该函数的一个例子是

source: An example of the use of typecast on a little-endian machine is
es: Un ejemplo de la utilización del encasillamiento en una máquina de poco tiempo es
ja: リトルエンディアンマシンでのタイプキャストの使用例としては
ru: Примером использования шрифтового литья на машине с маленькой подвеской может служить
zh_cn: 在小英机上使用打字法的例子是

source: An example that demonstrates how to work with arbitrary real or complex double precision arrays is given by the file
es: Un ejemplo que demuestra cómo trabajar con matrices arbitrarias reales o complejas de doble precisión está dado por el archivo
ja: 任意の実数または複素数の倍精度配列をどのように扱うかを示す例は、以下のファイルにあります。
ru: Пример,демонстрирующий работу с произвольными реальными или сложными массивами двойной точности,приведен в файле
zh_cn: 文件中给出了一个演示如何处理任意实数或复杂的双精度数组的例子。

source: An example that demonstrates the use of structures in a mex-file can be found in the file
es: Un ejemplo que demuestra el uso de las estructuras en un archivo mex-se puede encontrar en el archivo
ja: mexファイルでの構造体の使用を示す例は、ファイル
ru: Пример,демонстрирующий использование структур в mex-файле,можно найти в файле
zh_cn: 一个例子可以在文件

source: An explicit conversion to a full matrix can be requested using the built-in function <em>full</em>. It should also be noted that the diagonal and permutation matrix objects will cache the result of the conversion after it is first requested (explicitly or implicitly), so that subsequent conversions will be very cheap.
es: Se puede solicitar una conversi&oacute;n expl&iacute;cita a una matriz completa utilizando la funci&oacute;n incorporada <em>full</em> . Tambi&eacute;n debe tenerse en cuenta que los objetos de la matriz diagonal y de permutaci&oacute;n almacenar&aacute;n en cach&eacute; el resultado de la conversi&oacute;n despu&eacute;s de que se solicite por primera vez (expl&iacute;cita o impl&iacute;citamente), por lo que las conversiones posteriores ser&aacute;n muy econ&oacute;micas.
ja: 組み込み関数<em>full</em>を使用して、完全な行列への明示的な変換を要求できます。また、対角行列と順列行列オブジェクトは、最初に要求された後（明示的または暗黙的に）変換の結果をキャッシュするため、その後の変換は非常に安価になります。
ru: Явное преобразование в полную матрицу можно запросить с помощью встроенной функции <em>full</em> . Следует также отметить, что объекты диагональной матрицы и матрицы перестановок будут кэшировать результат преобразования после того, как он будет впервые запрошен (явно или неявно), так что последующие преобразования будут очень дешевыми.
zh_cn: 可以使用内置函数<em>full</em>显式转换为完整矩阵。还应注意，对角矩阵和置换矩阵对象将在首次（显式或隐式）请求转换结果后对其进行缓存，因此后续转换将非常便宜。

source: An expression can serve as a statement on its own. Most other kinds of statements contain one or more expressions which specify data to be operated on. As in other languages, expressions in Octave include variables, array references, constants, and function calls, as well as combinations of these with various operators.
es: Una expresión puede servir como una declaración por sí misma.La mayoría de los demás tipos de declaraciones contienen una o más expresiones que especifican los datos con los que se va a operar.Como en otros idiomas,las expresiones en Octava incluyen variables,referencias de arreglos,constantes y llamadas a funciones,así como combinaciones de éstas con diversos operadores.
ja: 式はそれ自体がステートメントとして機能することができます。他のほとんどの種類の文は,操作されるデータを指定する1つ以上の式を含んでいます。他の言語と同様に,Octaveの式には,変数,配列参照,定数,関数呼び出しのほか,様々な 演算子とこれらの組み合わせが含まれます。
ru: Выражение может само по себе служить заявлением.Большинство других видов выражений содержат одно или несколько выражений,которые указывают на данные,с которыми необходимо работать.Как и в других языках,выражения в Октаве включают в себя переменные,ссылки на массивы,константы и вызовы функций,а также их комбинации с различными операторами.
zh_cn: 一个表达式可以单独作为一个语句。大多数其他类型的语句都包含一个或多个表达式,这些表达式指定了要操作的数据。和其他语言一样,Octave中的表达式包括变量、数组引用、常量和函数调用,以及这些变量与各种运算符的组合。

source: An important use of the Delaunay tessellation is that it can be used to interpolate from scattered data to an arbitrary set of points. To do this the N-simplex of the known set of points is calculated with <code>delaunay</code> or <code>delaunayn</code>. Then the simplices in to which the desired points are found are identified. Finally the vertices of the simplices are used to interpolate to the desired points. The functions that perform this interpolation are <code>griddata</code>, <code>griddata3</code> and <code>griddatan</code>.
es: Un uso importante de la teselaci&oacute;n de Delaunay es que se puede utilizar para interpolar desde datos dispersos a un conjunto arbitrario de puntos. Para hacer esto, el N-simplex del conjunto conocido de puntos se calcula con <code>delaunay</code> o <code>delaunayn</code> . Luego se identifican los simples en los que se encuentran los puntos deseados. Finalmente, los v&eacute;rtices de los simples se utilizan para interpolar a los puntos deseados. Las funciones que realizan esta interpolaci&oacute;n son <code>griddata</code> , <code>griddata3</code> y <code>griddatan</code> .
ja: Delaunayテッセレーションの重要な用途は、散在データから任意のポイントセットに補間するために使用できることです。これを行うには、既知の点のセットのNシンプレックスを <code>delaunay</code> または <code>delaunayn</code> で計算します。次に、目的のポイントが見つかるシンプレックスが特定されます。最後に、シンプレックスの頂点を使用して、目的のポイントに補間します。この補間を実行する関数は、 <code>griddata</code> 、 <code>griddata3</code> 、および <code>griddatan</code> です。
ru: Важное применение тесселяции Делоне состоит в том, что ее можно использовать для интерполяции разрозненных данных в произвольный набор точек. Для этого N-симплекс известного набора точек вычисляется с помощью <code>delaunay</code> или <code>delaunayn</code> . Затем идентифицируются симплексы, в которых находятся искомые точки. Наконец, вершины симплексов используются для интерполяции в нужные точки. Эту интерполяцию выполняют функции <code>griddata</code> , <code>griddata3</code> и <code>griddatan</code> .
zh_cn: Delaunay细分的一个重要用途是可以用于将分散的数据插值到任意点集。为此，使用 <code>delaunay</code> 或 <code>delaunayn</code> 计算已知点集的N-单形。然后，识别出在其中找到所需点的单纯形。最后，将单纯形的顶点插值到所需的点。执行此插值的函数是 <code>griddata</code> ， <code>griddata3</code> 和 <code>griddatan</code> 。
