Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/octave/octave.*.020.xlf
Languages: es, ru, zh_cn

source: When <var>file</var> is already an absolute name, the name is checked against the file system instead of Octave&rsquo;s loadpath. In this case, if <var>file</var> exists it will be returned in <var>fname</var>, otherwise an empty string is returned.
es: Cuando el <var>file</var> ya es un nombre absoluto, el nombre se compara con el sistema de archivos en lugar de la ruta de carga de Octave. En este caso, si el <var>file</var> existe, se devolver&aacute; en <var>fname</var> ; de lo contrario, se devolver&aacute; una cadena vac&iacute;a.
ru: Когда <var>file</var> уже имеет абсолютное имя, имя проверяется по файловой системе, а не по пути загрузки Octave. В этом случае, если <var>file</var> существует, он будет возвращен в виде <var>fname</var> , в противном случае возвращается пустая строка.
zh_cn: 当 <var>file</var> 已经是绝对名称时，将根据文件系统而不是Octave的加载路径来检查该名称。在这种情况下，如果 <var>file</var> 存在，它将以 <var>fname</var> 返回，否则返回空字符串。

source: When <var>filename</var> does not have an extension the default filename extension
es: Cuando el <var>filename</var> no tiene una extensi&oacute;n, la extensi&oacute;n de nombre de archivo predeterminada
ru: Если <var>filename</var> не имеет расширения, расширение имени файла по умолчанию
zh_cn: 当 <var>filename</var> 没有扩展名时，默认文件名扩展名

source: When <var>m</var> is the polynomial order <var>coefs</var> must be of size: <var>ni</var>-by-(<var>m</var> + 1).
es: Cuando <var>m</var> es el orden polinomial, los <var>coefs</var> deben ser de tama&ntilde;o: <var>ni</var> -by- ( <var>m</var> + 1).
ru: Когда <var>m</var> является полиномиальным порядком, <var>coefs</var> должны иметь размер: <var>ni</var> -by- ( <var>m</var> + 1).
zh_cn: 当 <var>m</var> 是多项式阶时， <var>coefs</var> 必须为： <var>ni</var> -by-（ <var>m</var> +1）。

source: When <var>method</var> is <code>"gaussian"</code>, <var>std_dev</var> defines the standard deviation of the trivariate normal distribution function. <var>std_dev</var> is either a vector of 3 elements representing the standard deviation of the Gaussian convolution kernel in x-, y- and z-directions or a scalar, in which case the same value is used in all three dimensions. The default value is 0.65.
es: Cuando el <var>method</var> es <code>"gaussian"</code> , <var>std_dev</var> define la desviaci&oacute;n est&aacute;ndar de la funci&oacute;n de distribuci&oacute;n normal trivariada. <var>std_dev</var> es un vector de 3 elementos que representan la desviaci&oacute;n est&aacute;ndar del n&uacute;cleo de convoluci&oacute;n gaussiano en las direcciones x, y y z, o un escalar, en cuyo caso se usa el mismo valor en las tres dimensiones. El valor predeterminado es 0,65.
ru: Когда <var>method</var> является <code>"gaussian"</code> , <var>std_dev</var> определяет стандартное отклонение trivariate функции нормального распределения. <var>std_dev</var> - это либо вектор из 3 элементов, представляющий стандартное отклонение ядра свертки Гаусса в направлениях x, y и z, либо скаляр, и в этом случае одно и то же значение используется во всех трех измерениях. Значение по умолчанию - 0,65.
zh_cn: 当 <var>method</var> 为 <code>"gaussian"</code> ， <var>std_dev</var> 定义三变量正态分布函数的标准偏差。 <var>std_dev</var> 是3个元素的矢量，代表3个元素在x，y和z方向上的高斯卷积核的标准偏差，或者是标量，在这种情况下，所有三个维度均使用相同的值。默认值为0.65。

source: When <var>mode</var> is unspecified return the Cholesky factorization for <var>R</var>. If <var>mode</var> is <code>"lower"</code> or <code>"L"</code> then return the conjugate transpose <code><var>R</var>'</code> which is a lower triangular factor. The conjugate transpose version is faster and uses less memory, but still returns the same values for all other outputs: <var>count</var>, <var>h</var>, <var>parent</var>, and <var>post</var>.
es: Cuando <var>mode</var> es el retorno no especificado factorizaci&oacute;n de Cholesky para el <var>R</var> . Si el <var>mode</var> es <code>"lower"</code> o <code>"L"</code> , devuelve la transposici&oacute;n conjugada <code><var>R</var>'</code> que es un factor triangular inferior. La versi&oacute;n de transposici&oacute;n conjugada es m&aacute;s r&aacute;pida y usa menos memoria, pero a&uacute;n devuelve los mismos valores para todas las dem&aacute;s salidas: <var>count</var> , <var>h</var> , <var>parent</var> y <var>post</var> .
ru: Если <var>mode</var> не определен возвращают Cholesky факторизации <var>R</var> . Если <var>mode</var> является <code>"lower"</code> или <code>"L"</code> , а затем вернуть сопряженное транспонирование <code><var>R</var>'</code> , которая является нижним треугольным фактором. Версия с сопряженным транспонированием работает быстрее и использует меньше памяти, но по-прежнему возвращает те же значения для всех других выходных данных: <var>count</var> , <var>h</var> , <var>parent</var> и <var>post</var> .
zh_cn: 当 <var>mode</var> 是不确定的回报Cholesky分解为 <var>R</var> 。如果 <var>mode</var> 为 <code>"lower"</code> 或 <code>"L"</code> 则返回共轭转置 <code><var>R</var>'</code> ，它是较低的三角因子。共轭转置版本速度更快且使用的内存更少，但对于其他所有输出仍返回相同的值： <var>count</var> ， <var>h</var> ， <var>parent</var> 和 <var>post</var> 。

source: When <var>mu</var> is present, evaluate the polynomial for (<var>x</var>-<var>mu</var>(1)) / <var>mu</var>(2).
zh_cn: 当存在 <var>mu</var> 时，评估（ <var>x</var> - <var>mu</var> （1））/ <var>mu</var> （2）的多项式。

source: When <var>mu</var> is present, evaluate the polynomial for (<var>x</var>-<var>mu</var>(1))/<var>mu</var>(2).
es: Cuando <var>mu</var> est&aacute; presente, eval&uacute;e el polinomio para ( <var>x</var> - <var>mu</var> (1)) / <var>mu</var> (2).
ru: Когда присутствует <var>mu</var> , вычислите полином для ( <var>x</var> - <var>mu</var> (1)) / <var>mu</var> (2).
zh_cn: 如果存在 <var>mu</var> ，请评估（ <var>x</var> - <var>mu</var> （1））/ <var>mu</var> （2）的多项式。

source: When <var>n</var> is positive, the dimensions of <var>x</var> are shifted to the left, with the leading dimensions circulated to the end. If <var>n</var> is negative, then the dimensions of <var>x</var> are shifted to the right, with <var>n</var> leading singleton dimensions added.
es: Cuando <var>n</var> es positivo, las dimensiones de <var>x</var> se desplazan hacia la izquierda y las dimensiones principales circulan hasta el final. Si <var>n</var> es negativo, entonces las dimensiones de <var>x</var> se desplazan hacia la derecha y se suman <var>n</var> dimensiones individuales iniciales.
ru: Когда <var>n</var> положительно, размеры <var>x</var> сдвигаются влево, а ведущие измерения распространяются до конца. Если <var>n</var> отрицательно, то размеры <var>x</var> сдвигаются вправо с добавлением <var>n</var> ведущих одиночных измерений.
zh_cn: 当 <var>n</var> 为正数时， <var>x</var> 的尺寸向左移动，而前导尺寸循环到末端。如果 <var>n</var> 为负，则 <var>x</var> 的尺寸会向右移动，并添加 <var>n</var> 个前导单例尺寸。

source: When <var>obj</var> is a class object defined with a class constructor, then <code>subsindex</code> is the overloading method that allows the conversion of this class object to a valid indexing vector. It is important to note that <code>subsindex</code> must return a zero-based real integer vector of the class <code>"double"</code>. For example, if the class constructor were
es: Cuando <var>obj</var> es un objeto de clase definido con un constructor de clase, entonces <code>subsindex</code> es el m&eacute;todo de sobrecarga que permite la conversi&oacute;n de este objeto de clase en un vector de indexaci&oacute;n v&aacute;lido. Es importante notar que el <code>subsindex</code> debe devolver un vector entero real de base cero de la clase <code>"double"</code> . Por ejemplo, si el constructor de la clase fuera
ru: Если <var>obj</var> является объектом класса, определенным с помощью конструктора класса, то <code>subsindex</code> является методом перегрузки, который позволяет преобразовать этот объект класса в допустимый вектор индексации. Важно отметить, что <code>subsindex</code> должен возвращать отсчитываемый от нуля вещественный целочисленный вектор класса <code>"double"</code> . Например, если конструктор класса был
zh_cn: 如果 <var>obj</var> 是使用类构造函数定义的类对象，则 <code>subsindex</code> 是允许将此类对象转换为有效索引向量的重载方法。重要的是要注意， <code>subsindex</code> 必须返回 <code>"double"</code> 类的从零开始的实整数向量。例如，如果类构造函数是

source: When <var>obj</var> is a regular Java object, structure-like indexing can be used as a shortcut syntax. For instance, the following two statements are equivalent
es: Cuando <var>obj</var> es un objeto Java normal, la indexaci&oacute;n similar a una estructura se puede utilizar como sintaxis de acceso directo. Por ejemplo, las siguientes dos declaraciones son equivalentes
ru: Когда <var>obj</var> является обычным объектом Java, индексирование, подобное структуре, может использоваться как сокращенный синтаксис. Например, следующие два утверждения эквивалентны
zh_cn: 当 <var>obj</var> 是常规Java对象时，类似结构的索引可以用作快捷方式语法。例如，以下两个语句是等效的

source: When <var>obj</var> is a regular Java object, structure-like indexing can be used as a shortcut syntax. For instance, the two following statements are equivalent
es: Cuando <var>obj</var> es un objeto Java normal, la indexaci&oacute;n similar a una estructura se puede utilizar como sintaxis de acceso directo. Por ejemplo, las dos siguientes declaraciones son equivalentes
ru: Когда <var>obj</var> является обычным объектом Java, индексирование, подобное структуре, может использоваться как сокращенный синтаксис. Например, два следующих утверждения эквивалентны
zh_cn: 当 <var>obj</var> 是常规Java对象时，类似结构的索引可以用作快捷方式语法。例如，以下两个语句是等效的

source: When <var>str</var> is a character string to be tested, and <var>strarray</var> is a cellstr of valid values, then <var>validstr</var> will be the validated form of <var>str</var> where validation is defined as <var>str</var> being a member or substring of <var>validstr</var>. This is useful for both verifying and expanding short options, such as <code>"r"</code>, to their longer forms, such as <code>"red"</code>. If <var>str</var> is a substring of <var>validstr</var>, and there are multiple matches, the shortest match will be returned if all matches are substrings of each other. Otherwise, an error will be raised because the expansion of <var>str</var> is ambiguous. All comparisons are case insensitive.
es: Cuando <var>str</var> es una cadena de caracteres para ser probada, y <var>strarray</var> es una celltr de valores v&aacute;lidos, entonces <var>validstr</var> ser&aacute; la forma validada de <var>str</var> donde la validaci&oacute;n se define como <var>str</var> siendo un miembro o subcadena de <var>validstr</var> . Esto es &uacute;til para verificar y expandir opciones cortas, como <code>"r"</code> , a sus formas m&aacute;s largas, como <code>"red"</code> . Si <var>str</var> es una subcadena de <var>validstr</var> y hay varias coincidencias, se devolver&aacute; la coincidencia m&aacute;s corta si todas las coincidencias son subcadenas entre s&iacute;. De lo contrario, se generar&aacute; un error porque la expansi&oacute;n de <var>str</var> es ambiguo. Todas las comparaciones no distinguen entre may&uacute;sculas y min&uacute;sculas.
ru: Когда <var>str</var> - это проверяемая символьная строка, а <var>strarray</var> - это cellstr с допустимыми значениями, то <var>validstr</var> будет проверенной формой <var>str</var> , где проверка определяется как <var>str</var> , являющаяся членом или подстрокой <var>validstr</var> . Это полезно как для проверки, так и для расширения коротких опций, таких как <code>"r"</code> , до их более длинных форм, таких как <code>"red"</code> . Если <var>str</var> является подстрокой <var>validstr</var> и есть несколько совпадений, будет возвращено самое короткое совпадение, если все совпадения являются подстроками друг друга. В противном случае возникнет ошибка, поскольку расширение <var>str</var> неоднозначно. Все сравнения нечувствительны к регистру.
zh_cn: 当 <var>str</var> 是要测试的字符串，并且 <var>strarray</var> 是有效值的单元格strstr时， <var>validstr</var> 将是 <var>str</var> 的有效形式，其中validation定义为 <var>str</var> 是 <var>validstr</var> 的成员或子字符串。这对于将短选项（例如 <code>"r"</code> 验证和扩展为较长的形式（例如 <code>"red"</code> 都是有用的。如果 <var>str</var> 是 <var>validstr</var> 的子字符串，并且有多个匹配项，则如果所有匹配项都是彼此的子字符串，则将返回最短的匹配项。否则会因为 <var>str</var> 的扩展而产生错误是模棱两可的。所有比较都不区分大小写。

source: When <var>x</var> is a vector, the function counts the number of elements of <var>x</var> that fall in the histogram bins defined by <var>edges</var>. This must be a vector of monotonically increasing values that define the edges of the histogram bins. <code><var>n</var>(k)</code> contains the number of elements in <var>x</var> for which <code><var>edges</var>(k) &lt;= <var>x</var> &lt; <var>edges</var>(k+1)</code>. The final element of <var>n</var> contains the number of elements of <var>x</var> exactly equal to the last element of <var>edges</var>.
es: Cuando <var>x</var> es un vector, la funci&oacute;n cuenta el n&uacute;mero de elementos de <var>x</var> que caen en los contenedores del histograma definidos por los <var>edges</var> . Debe ser un vector de valores crecientes mon&oacute;tonamente que definan los bordes de los contenedores del histograma. <code><var>n</var>(k)</code> contiene el n&uacute;mero de elementos en <var>x</var> para los cuales <code><var>edges</var>(k) &lt;= <var>x</var> &lt; <var>edges</var>(k+1)</code> . El elemento final de <var>n</var> contiene el n&uacute;mero de elementos de <var>x</var> exactamente igual al &uacute;ltimo elemento de <var>edges</var> .
ru: Когда <var>x</var> является вектором, функция подсчитывает количество элементов <var>x</var> , которые попадают в интервалы гистограммы, определенные <var>edges</var> . Это должен быть вектор монотонно возрастающих значений, которые определяют края интервалов гистограммы. <code><var>n</var>(k)</code> содержит количество элементов в <var>x</var> , для которых <code><var>edges</var>(k) &lt;= <var>x</var> &lt; <var>edges</var>(k+1)</code> . Последний элемент <var>n</var> содержит количество элементов <var>x</var> , точно равное последнему элементу <var>edges</var> .
zh_cn: 当 <var>x</var> 是向量时，该函数计算落入 <var>edges</var> 定义的直方图bin中的 <var>x</var> 元素的数量。它必须是定义直方图块边缘的单调递增值的向量。 <code><var>n</var>(k)</code> （k）包含 <var>x</var> 中 <code><var>edges</var>(k) &lt;= <var>x</var> &lt; <var>edges</var>(k+1)</code> （k）&lt;= <var>x</var> &lt; <var>edges</var> （k + 1）的元素数。 <var>n</var> 的最后一个元素包含 <var>x</var> 的元素的数量完全等于 <var>edges</var> 的最后一个元素。

source: When <var>x</var> is an <em>N</em>-dimensional array, the computation is carried out along dimension <var>dim</var>. If not specified <var>dim</var> defaults to the first non-singleton dimension.
es: Cuando <var>x</var> es una matriz <em>N</em> -dimensional, el c&aacute;lculo se realiza a lo largo de la dimensi&oacute;n <var>dim</var> . Si no se especifica <var>dim</var> por defecto a la primera dimensi&oacute;n no Singleton.
ru: Когда <var>x</var> является <em>N-</em> мерным массивом, вычисление выполняется по измерению <var>dim</var> . Если не указано иное, <var>dim</var> по умолчанию соответствует первому не одноэлементному измерению.
zh_cn: 当 <var>x</var> 是<em>N</em>维数组时，计算是沿 <var>dim</var> 进行的。如果未指定， <var>dim</var> 默认为第一个非单维度。

source: When Ghostscript output is sent to a printer the size is determined by the figure&rsquo;s <code>"papersize"</code> property. When the output is sent to a file the size is determined by the plot box defined by the figure&rsquo;s <code>"paperposition"</code> property.
es: Cuando la salida de Ghostscript se env&iacute;a a una impresora, el tama&ntilde;o lo determina la propiedad <code>"papersize"</code> tama&ntilde;o del papel" de la figura . Cuando la salida se env&iacute;a a un archivo, el tama&ntilde;o lo determina el cuadro de trazado definido por la propiedad <code>"paperposition"</code> de la figura .
ru: Когда вывод Ghostscript отправляется на принтер, размер определяется свойством рисунка <code>"papersize"</code> . Когда выходные данные отправляются в файл, размер определяется рамкой графика, определяемой свойством фигуры <code>"paperposition"</code> .
zh_cn: 当Ghostscript输出发送到打印机时，大小由图形的 <code>"papersize"</code> 属性确定。将输出发送到文件时，大小由图形的 <code>"paperposition"</code> 属性定义的绘图框确定。

source: When Octave defines a function from a function file, it saves the full name of the file it read and the time stamp on the file. If the time stamp on the file changes, Octave may reload the file. When Octave is running interactively, time stamp checking normally happens at most once each time Octave prints the prompt. Searching for new function definitions also occurs if the current working directory changes.
es: Cuando Octava define una función a partir de un archivo de función,guarda el nombre completo del archivo que ha leído y la marca de tiempo en el archivo.Si la marca de tiempo en el archivo cambia,Octava puede recargar el archivo.Cuando Octave se ejecuta de forma interactiva,la comprobación de la marca de tiempo normalmente se realiza como máximo una vez cada vez que Octave imprime el aviso.La búsqueda de nuevas definiciones de funciones también se produce si cambia el directorio de trabajo actual.
ru: Когда Октава определяет функцию из файла функции,она сохраняет полное имя файла,который она прочитала,и метку времени на файле.Если метка времени на файле меняется,Октава может перезагрузить файл.При интерактивном запуске Октавы проверка метки времени обычно происходит не чаще одного раза каждый раз,когда Октава печатает подсказку.Поиск новых определений функций также происходит при изменении текущего рабочего каталога.
zh_cn: 当Octave从函数文件中定义一个函数时,它会保存读取的文件全名和文件上的时间戳。如果文件上的时间戳发生变化,Octave可能会重新加载文件。当Octave交互式运行时,时间戳检查通常在Octave每次打印提示时最多进行一次。如果当前工作目录发生变化,也会搜索新的函数定义。

source: When Octave encounters an identifier that is undefined, it first looks for variables or functions that are already compiled and currently listed in its symbol table. If it fails to find a definition there, it searches a list of directories (the <em>path</em>) for files ending in
es: Cuando Octave encuentra un identificador que no est&aacute; definido, primero busca variables o funciones que ya est&aacute;n compiladas y listadas actualmente en su tabla de s&iacute;mbolos. Si no encuentra una definici&oacute;n all&iacute;, busca en una lista de directorios (la <em>ruta</em> ) archivos que terminan en
ru: Когда Octave встречает неопределенный идентификатор, он сначала ищет переменные или функции, которые уже скомпилированы и в настоящее время перечислены в его таблице символов. Если ему не удается найти там определение, он ищет в списке каталогов ( <em>путь</em> ) файлы, заканчивающиеся на
zh_cn: 当Octave遇到未定义的标识符时，它将首先查找已编译且当前在其符号表中列出的变量或函数。如果无法在此处找到定义，则会在目录列表（<em>路径</em>）中搜索以结尾的文件

source: When Octave encounters the keyword <code>return</code> inside a function or script, it returns control to the caller immediately. At the top level, the return statement is ignored. A <code>return</code> statement is assumed at the end of every function definition.
es: Cuando Octave encuentra la palabra clave <code>return</code> dentro de una funci&oacute;n o script, devuelve el control a la persona que llama de inmediato. En el nivel superior, se ignora la declaraci&oacute;n de devoluci&oacute;n. Se asume una declaraci&oacute;n de <code>return</code> al final de cada definici&oacute;n de funci&oacute;n.
ru: Когда Octave встречает ключевое слово <code>return</code> внутри функции или скрипта, он немедленно возвращает управление вызывающей стороне. На верхнем уровне оператор return игнорируется. <code>return</code> заявление принимается в конце каждого определения функции.
zh_cn: 当Octave 在函数或脚本中遇到关键字 <code>return</code> 时，它将立即将控制权返回给调用者。在顶层，return语句将被忽略。在每个函数定义的末尾都假定有 <code>return</code> 语句。

source: When Octave is used interactively, stdin is filtered through the command line editing functions.
es: Cuando Octava se utiliza de forma interactiva,la stdin se filtra a través de las funciones de edición de la línea de comandos.
ru: При интерактивном использовании Октавы,stdin фильтруется через функции редактирования командной строки.
zh_cn: 当交互式使用Octave时,通过命令行编辑功能对stdin进行过滤。

source: When Octave parses a matrix expression, it examines the elements of the list to determine whether they are all constants. If they are, it replaces the list with a single matrix constant.
es: Cuando Octave analiza una expresión matricial,examina los elementos de la lista para determinar si todos son constantes.Si lo son,reemplaza la lista con una única constante de la matriz.
ru: Когда Октава разбирает матричное выражение,она изучает элементы списка,чтобы определить,все ли они являются константами.Если да,то список заменяется единственной матричной константой.
zh_cn: 当Octave解析一个矩阵表达式时,它会检查列表中的元素,以确定它们是否都是常量。如果是,它就用一个矩阵常数替换列表。

source: When Octave parses a range expression, it examines the elements of the expression to determine whether they are all constants. If they are, it replaces the range expression with a single range constant.
es: Cuando Octave analiza una expresión de rango,examina los elementos de la expresión para determinar si todos son constantes.Si lo son,reemplaza la expresión de rango con una única constante de rango.
ru: Когда Октава разбирает выражение диапазона,она изучает элементы выражения,чтобы определить,все ли они являются константами.Если это так,он заменяет выражение диапазона константой одного диапазона.
zh_cn: 当Octave解析一个范围表达式时,它会检查表达式中的元素,以确定它们是否都是常数。如果它们都是,它就用一个范围常数替换范围表达式。

source: When Octave starts, it looks for commands to execute from the files in the following list. These files may contain any valid Octave commands, including function definitions.
es: Cuando comienza Octava,busca comandos para ejecutar desde los archivos de la siguiente lista.Estos archivos pueden contener cualquier comando válido de Octava,incluyendo definiciones de funciones.
ru: Когда запускается Октава,она ищет команды для выполнения из файлов в следующем списке.Эти файлы могут содержать любые действительные команды Октавы,включая определения функций.
zh_cn: 当Octave启动时,它会从下面列表中的文件中查找要执行的命令。这些文件可以包含任何有效的Octave命令,包括函数定义。

source: When a <em>matching failure</em> occurs, <code>scanf</code> returns immediately, leaving the first non-matching character as the next character to be read from the stream, and <code>scanf</code> returns all the items that were successfully converted.
es: Cuando ocurre <em>una falla de coincidencia</em> , <code>scanf</code> regresa inmediatamente, dejando el primer car&aacute;cter no coincidente como el siguiente car&aacute;cter que se leer&aacute; de la secuencia, y <code>scanf</code> devuelve todos los elementos que se convirtieron con &eacute;xito.
ru: Когда происходит <em>сбой сопоставления</em> , <code>scanf</code> немедленно возвращается, оставляя первый несоответствующий символ в качестве следующего символа, который будет считан из потока, а <code>scanf</code> возвращает все элементы, которые были успешно преобразованы.
zh_cn: 当发生<em>匹配失败</em>时， <code>scanf</code> 立即返回，将第一个不匹配字符保留为要从流中读取的下一个字符， <code>scanf</code> 返回所有已成功转换的项目。

source: When a colon is used in the special case of 1-D indexing the result is always a column vector. Creating column vectors with a colon index is a very frequently encountered code idiom and is faster and generally clearer than calling <code>reshape</code> for this case.
es: Cuando se utilizan dos puntos en el caso especial de indexaci&oacute;n 1-D, el resultado es siempre un vector de columna. La creaci&oacute;n de vectores de columna con un &iacute;ndice de dos puntos es un lenguaje de c&oacute;digo que se encuentra con mucha frecuencia y es m&aacute;s r&aacute;pido y generalmente m&aacute;s claro que llamar a <code>reshape</code> para este caso.
ru: Когда двоеточие используется в частном случае одномерного индексирования, результатом всегда является вектор-столбец. Создание векторов-столбцов с индексом двоеточия - это очень часто встречающаяся идиома кода, которая в этом случае быстрее и, как правило, более понятна, чем вызов <code>reshape</code> .
zh_cn: 在一维索引的特殊情况下使用冒号时，结果始终是列向量。使用冒号索引创建列向量是一种非常常见的代码习惯用法，比在这种情况下调用 <code>reshape</code> 更快，更清晰。
