Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/octave/octave.*.020.xlf
Languages: es, ru, zh_cn

source: The word is parsed as a "quoted string". If the first character of the string is a double quote (") then the string includes everything until a matching double quote&mdash;including whitespace, delimiters, and end-of-line characters. If a pair of consecutive double quotes appears in the input, it is replaced in the output by a single double quote. For examples, the input "He said ""Hello""" would return the value &rsquo;He said "Hello"&rsquo;.
es: La palabra se analiza como una "cadena entre comillas". Si el primer car&aacute;cter de la cadena es una comilla doble ("), la cadena incluye todo hasta una comilla doble coincidente, incluidos espacios en blanco, delimitadores y caracteres de final de l&iacute;nea. Si aparece un par de comillas dobles consecutivas en la entrada, se reemplaza en la salida por una comilla doble simple. Por ejemplo, la entrada "Dijo" "Hola" "" devolver&iacute;a el valor 'Dijo "Hola"'.
ru: Слово анализируется как "строка в кавычках". Если первым символом строки является двойная кавычка ("), то строка включает все, до совпадения двойной кавычки, включая пробелы, разделители и символы конца строки. Если во входных данных появляется пара последовательных двойных кавычек, в выводе оно заменяется одинарной двойной кавычкой. Например, вход &laquo;Он сказал&raquo; &laquo;Привет&raquo; &laquo;&raquo; вернет значение &laquo;Он сказал&laquo; Привет &raquo;&raquo;.
zh_cn: 该词被解析为&ldquo;引用字符串&rdquo;。如果字符串的第一个字符是双引号（&ldquo;），则字符串将包含所有内容，直到匹配的双引号为止，包括空格，定界符和行尾字符。如果输入中出现一对连续的双引号，例如，输入&ldquo;他说&ldquo;你好&rdquo;&rdquo;会返回值&ldquo;他说&ldquo;你好&rdquo;&rdquo;。

source: The word is parsed as a number and converted to double.
es: La palabra se analiza como un número y se convierte en doble.
ru: Слово разбирается как число и преобразуется в двойное.
zh_cn: 该词被解析为一个数字,并转换为双数。

source: The word is parsed as a number and converted to int32.
es: La palabra se analiza como un número y se convierte en int32.
ru: Слово разбирается как число и преобразуется в int32.
zh_cn: 该词被解析为一个数字,并转换为int32。

source: The word is parsed as a number and converted to int8, int16, int32, or int64. If no size is specified then int32 is used.
es: La palabra se analiza como un número y se convierte en int8,int16,int32 o int64.Si no se especifica ningún tamaño,se utiliza int32.
ru: Слово разбирается как число и преобразуется в int8,int16,int32 или int64.Если размер не указан,то используется int32.
zh_cn: 字被解析为一个数字,并转换为int8、int16、int32或int64。如果没有指定大小,则使用int32。

source: The word is parsed as a number and converted to single (float).
es: La palabra se analiza como un número y se convierte en simple (flotador).
ru: Слово разбирается как число и преобразуется в единственное (плавающее).
zh_cn: 该字被解析为一个数字,并转换为单数(float)。

source: The word is parsed as a number and converted to uint8, uint16, uint32, or uint64. If no size is specified then uint32 is used.
es: La palabra se analiza como un número y se convierte en uint8,uint16,uint32 o uint64.Si no se especifica ningún tamaño,se utiliza uint32.
ru: Слово разбирается как число и преобразуется в uint8,uint16,uint32 или uint64.Если размер не указан,то используется uint32.
zh_cn: 字被解析为一个数字,并转换为uint8、uint16、uint32或uint64。如果没有指定大小,则使用uint32。

source: The word is parsed as a string ending at the last character before whitespace, an end-of-line, or a delimiter specified in the options.
es: La palabra se analiza como una cadena que termina en el último carácter antes del espacio en blanco,un final de línea o un delimitador especificado en las opciones.
ru: Слово анализируется как строка,заканчивающаяся последним символом перед пробелом,концом строки или разделителем,указанным в опциях.
zh_cn: 字词被解析为一个字符串,以空格、行尾或选项中指定的定界符前的最后一个字符结束。

source: The word is parsed as a string.
es: La palabra está analizada como una cuerda.
ru: Слово разбирается как строка.
zh_cn: 该词被解析为一个字符串。

source: The word is skipped.
es: La palabra se salta.
ru: Слово пропущено.
zh_cn: 这个词是跳过的。

source: The word specified by the remainder of the conversion specifier is skipped.
es: Se omite la palabra especificada por el resto del especificador de conversión.
ru: Слово,указанное оставшимся спецификатором преобразования,пропускается.
zh_cn: 转换指定器的剩余部分所指定的词被跳过。

source: The x and y coordinates of the original columns of the data passed to <code>area</code> prior to the cumulative summation used in the <code>area</code> function.
es: Las coordenadas xey de las columnas originales de los datos pasados ​​al <code>area</code> antes de la suma acumulativa utilizada en la funci&oacute;n de <code>area</code> .
ru: Координаты x и y исходных столбцов данных, передаваемых в <code>area</code> до кумулятивного суммирования, используемого в функции <code>area</code> .
zh_cn: 在 <code>area</code> 函数中使用的累积求和之前，传递到 <code>area</code> 的数据原始列的x和y坐标。

source: The y value of the bars in the <code>hggroup</code>.
es: El valor y de las barras en <code>hggroup</code> .
ru: Значение y <code>hggroup</code> в hggroup .
zh_cn: <code>hggroup</code> 中柱的y值。

source: The y-value where the baseline is drawn. (Default: 0)
es: El valor y donde se dibuja la línea de base.(Por defecto:0)
ru: Значение по оси Y,по которой рисуется базовая линия.(По умолчанию:0)
zh_cn: 基线的y值。(默认值:0)

source: Then if the path to <code>func1</code> is <code>&lt;directory&gt;/func1.m</code>, and if <code>func2</code> is found in the directory <code>&lt;directory&gt;/private/func2.m</code>, then <code>func2</code> is only available for use of the functions, like <code>func1</code>, that are found in <code>&lt;directory&gt;</code>.
es: Entonces, si la ruta a <code>func1</code> es <code>&lt;directory&gt;/func1.m</code> , y si <code>func2</code> se encuentra en el directorio <code>&lt;directory&gt;/private/func2.m</code> , entonces <code>func2</code> solo est&aacute; disponible para el uso de las funciones, como <code>func1</code> , que se encuentran en <code>&lt;directory&gt;</code> .
ru: Тогда, если путь к <code>func1</code> - <code>&lt;directory&gt;/func1.m</code> , и если <code>func2</code> найден в каталоге <code>&lt;directory&gt;/private/func2.m</code> , то <code>func2</code> доступен только для использования функций, таких как <code>func1</code> , которые найдены в <code>&lt;directory&gt;</code> .
zh_cn: 然后，如果路径 <code>func1</code> 是 <code>&lt;directory&gt;/func1.m</code> ，并且如果 <code>func2</code> 是在目录中找到 <code>&lt;directory&gt;/private/func2.m</code> ，然后 <code>func2</code> 仅适用于使用的功能，如 <code>func1</code> 的，被发现在 <code>&lt;directory&gt;</code> 中。

source: Then the solution at the roots <var>r</var> is
es: Entonces la soluci&oacute;n en las ra&iacute;ces <var>r</var> es
ru: Тогда решение в корнях <var>r</var> есть
zh_cn: 那么根 <var>r</var> 的解是

source: Then, call <code>fsolve</code> with a specified initial condition to find the roots of the system of equations. For example, given the function <code>f</code> defined above,
es: Luego, llame a <code>fsolve</code> con una condici&oacute;n inicial especificada para encontrar las ra&iacute;ces del sistema de ecuaciones. Por ejemplo, dada la funci&oacute;n <code>f</code> definida anteriormente,
ru: Затем вызовите <code>fsolve</code> с указанным начальным условием, чтобы найти корни системы уравнений. Например, учитывая функцию <code>f</code> , определенную выше,
zh_cn: 然后，使用指定的初始条件调用 <code>fsolve</code> 来找到方程组的根。例如，给定上面定义的函数 <code>f</code> ，

source: There are a couple of important considerations in the choice of function name. First, it must be a valid Octave function name and so must be a sequence of letters, digits, and underscores not starting with a digit. Second, as Octave uses the function name to define the filename it attempts to find the function in, the function name in the <code>DEFUN_DLD</code> macro must match the filename of the oct-file. Therefore, the above function should be in a file
es: Hay un par de consideraciones importantes en la elecci&oacute;n del nombre de la funci&oacute;n. Primero, debe ser un nombre de funci&oacute;n de Octave v&aacute;lido y, por lo tanto, debe ser una secuencia de letras, d&iacute;gitos y guiones bajos que no comiencen con un d&iacute;gito. En segundo lugar, como Octave usa el nombre de la funci&oacute;n para definir el nombre del archivo en el que intenta encontrar la funci&oacute;n, el nombre de la funci&oacute;n en la macro <code>DEFUN_DLD</code> debe coincidir con el nombre del archivo oct. Por lo tanto, la funci&oacute;n anterior debe estar en un archivo
ru: При выборе имени функции необходимо учитывать несколько важных моментов. Во-первых, это должно быть допустимое имя функции Octave и, следовательно, должна быть последовательность букв, цифр и подчеркиваний, не начинающаяся с цифры. Во-вторых, поскольку Octave использует имя функции для определения имени файла, в котором пытается найти функцию, имя функции в макросе <code>DEFUN_DLD</code> должно соответствовать имени файла oct-файла. Следовательно, указанная выше функция должна быть в файле
zh_cn: 在选择函数名称时，有两个重要的注意事项。首先，它必须是有效的Octave函数名称，因此必须是字母，数字和下划线（不以数字开头）的序列。其次，由于Octave使用函数名称定义尝试在其中查找函数的文件名，因此 <code>DEFUN_DLD</code> 宏中的函数名称必须与oct文件的文件名匹配。因此，以上功能应在文件中

source: There are a few further points to note about this method of creating a sparse matrix. First, it is possible to create a sparse matrix with fewer elements than are actually inserted in the matrix. Therefore,
es: Hay algunos puntos más a destacar sobre este método de crear una matriz dispersa.En primer lugar,es posible crear una matriz dispersa con menos elementos de los que realmente se insertan en la matriz.Por lo tanto,
ru: Отметим еще несколько моментов,связанных с этим методом создания разреженной матрицы.Во-первых,можно создать разреженную матрицу с меньшим количеством элементов,чем реально вставляется в матрицу.Поэтому,
zh_cn: 关于这种创建稀疏矩阵的方法,还有几点需要注意。首先,可以用比实际插入矩阵中的元素更少的元素来创建一个稀疏矩阵。因此。

source: There are a number of basic class methods that can (and should) be defined to allow the contents of the classes to be queried and set. The most basic of these is the <code>disp</code> method. The <code>disp</code> method is used by Octave whenever a class should be displayed on the screen. Usually this is the result of an Octave expression that doesn&rsquo;t end with a semicolon. If this method is not defined, then Octave won&rsquo;t print anything when displaying the contents of a class which can be confusing.
es: Hay una serie de m&eacute;todos de clase b&aacute;sicos que pueden (y deben) definirse para permitir la consulta y configuraci&oacute;n del contenido de las clases. El m&aacute;s b&aacute;sico de ellos es el m&eacute;todo <code>disp</code> . El <code>disp</code> m&eacute;todo es utilizado por Octave cada vez que una clase se debe mostrar en la pantalla. Por lo general, este es el resultado de una expresi&oacute;n de octava que no termina con un punto y coma. Si este m&eacute;todo no est&aacute; definido, Octave no imprimir&aacute; nada al mostrar el contenido de una clase, lo que puede resultar confuso.
ru: Существует ряд базовых методов класса, которые можно (и нужно) определить, чтобы можно было запрашивать и устанавливать содержимое классов. Самый простой из них - метод <code>disp</code> . Метод <code>disp</code> используется Octave всякий раз, когда класс должен отображаться на экране. Обычно это результат выражения Octave, которое не заканчивается точкой с запятой. Если этот метод не определен, Octave не будет ничего печатать при отображении содержимого класса, что может сбивать с толку.
zh_cn: 可以（应该）定义许多基本的类方法，以允许查询和设置类的内容。其中最基本的是 <code>disp</code> 方法。该 <code>disp</code> 方法用于通过倍频每当类应该在屏幕上显示。通常，这是不以分号结尾的倍频程表达式的结果。如果未定义此方法，则在显示可能令人困惑的类的内容时，Octave将不会打印任何内容。

source: There are a number of functions available for checking to see if the elements of a matrix meet some condition, and for rearranging the elements of a matrix. For example, Octave can easily tell you if all the elements of a matrix are finite, or are less than some specified value. Octave can also rotate the elements, extract the upper- or lower-triangular parts, or sort the columns of a matrix.
es: Hay varias funciones disponibles para comprobar si los elementos de una matriz cumplen alguna condición,y para reordenar los elementos de una matriz.Por ejemplo,Octava puede decir fácilmente si todos los elementos de una matriz son finitos,o son menores que algún valor especificado.Octava también puede rotar los elementos,extraer las partes triangulares superiores o inferiores,o clasificar las columnas de una matriz.
ru: Имеется ряд функций для проверки соответствия элементов матрицы тому или иному условию,а также для переупорядочивания элементов матрицы.Например,Октава может легко определить,все ли элементы матрицы конечны или меньше некоторого заданного значения.Октава также может вращать элементы,извлекать верхние или нижние треугольные части или сортировать столбцы матрицы.
zh_cn: 有很多函数可以用来检查矩阵的元素是否满足某些条件,以及重新排列矩阵的元素。例如,Octave可以很容易地告诉你一个矩阵的所有元素是否都是有限的,或者是否小于某个指定值。Octave还可以旋转元素,提取上三角或下三角部分,或对矩阵的列进行排序。

source: There are a number of functions that allow information concerning sparse matrices to be obtained. The most basic of these is <em>issparse</em> that identifies whether a particular Octave object is in fact a sparse matrix.
es: Hay una serie de funciones que permiten obtener informaci&oacute;n sobre matrices dispersas. El m&aacute;s b&aacute;sico de ellos es el <em>disperso</em> que identifica si un objeto Octave en particular es de hecho una matriz dispersa.
ru: Существует ряд функций, позволяющих получать информацию о разреженных матрицах. Самый простой из них - это <em>issparse,</em> который определяет, действительно ли конкретный объект Octave является разреженной матрицей.
zh_cn: 有许多功能可以获取有关稀疏矩阵的信息。其中最基本的是<em>issparse</em>，它标识特定的Octave对象是否实际上是稀疏矩阵。

source: There are also conversions for printing an integer argument as an unsigned value in octal, decimal, or hexadecimal radix (&lsquo;
es: Tambi&eacute;n hay conversiones para imprimir un argumento entero como un valor sin signo en base octal, decimal o hexadecimal ('
ru: Существуют также преобразования для печати целочисленного аргумента как значения без знака в восьмеричной, десятичной или шестнадцатеричной системе счисления ('
zh_cn: 还有一些转换可以将整数参数打印为八进制，十进制或十六进制基数的无符号值（'

source: There are also many ways in which a function could be given as input. It might be passed as one of
es: También hay muchas maneras en que una función puede ser dada como entrada.Podría ser pasada como una de
ru: Существует также множество способов,с помощью которых функция может быть задана в качестве входной.Она может быть передана как один из
zh_cn: 还有很多方法可以将函数作为输入。它可能被传递为

source: There are also the functions <code>mxSetPr</code>, etc., that perform the inverse, and set the data of an array to use the block of memory pointed to by the argument of <code>mxSetPr</code>.
es: Tambi&eacute;n existen las funciones <code>mxSetPr</code> , etc., que realizan lo inverso y establecen los datos de una matriz para usar el bloque de memoria apuntado por el argumento de <code>mxSetPr</code> .
ru: Есть также функции <code>mxSetPr</code> и т. Д., Которые выполняют обратное и устанавливают данные массива для использования блока памяти, на который указывает аргумент <code>mxSetPr</code> .
zh_cn: 还有函数 <code>mxSetPr</code> 等执行相反的操作，并设置数组的数据以使用 <code>mxSetPr</code> 参数所指向的内存块。

source: There are currently three options for plotting in Octave: the external program gnuplot, the internal graphics engine using OpenGL coupled with either FLTK or Qt widgets. Gnuplot is a command-driven interactive function plotting program.
es: Actualmente hay tres opciones para trazar en Octava:el programa externo gnuplot,el motor gráfico interno que usa OpenGL acoplado a los widgets FLTK o Qt.Gnuplot es un programa de trazado de funciones interactivas guiado por comandos.
ru: В настоящее время существует три варианта построения плоттера в Октаве:внешняя программа gnuplot,внутренний графический движок,использующий OpenGL в сочетании с виджетами FLTK или Qt.Gnuplot-это управляемая командами интерактивная функциональная программа для построения чертежей.
zh_cn: 目前在Octave中绘图有三种选择:外部程序gnuplot,内部图形引擎使用OpenGL与FLTK或Qt widgets结合。Gnuplot是一个命令驱动的交互式函数绘图程序。

source: There are many classes of mathematical problems which give rise to matrices, where a large number of the elements are zero. In this case it makes sense to have a special matrix type to handle this class of problems where only the nonzero elements of the matrix are stored. Not only does this reduce the amount of memory to store the matrix, but it also means that operations on this type of matrix can take advantage of the a priori knowledge of the positions of the nonzero elements to accelerate their calculations.
es: Hay muchas clases de problemas matemáticos que dan lugar a matrices,donde un gran número de los elementos son cero.En este caso tiene sentido tener un tipo de matriz especial para manejar esta clase de problemas donde sólo se almacenan los elementos no nulos de la matriz.Esto no sólo reduce la cantidad de memoria para almacenar la matriz,sino que también significa que las operaciones en este tipo de matriz pueden aprovechar el conocimiento a priori de las posiciones de los elementos no nulos para acelerar sus cálculos.
ru: Существует множество классов математических задач,которые порождают матрицы,где большое количество элементов равно нулю.В этом случае имеет смысл иметь специальный тип матрицы для работы с этим классом задач,где хранятся только ненулевые элементы матрицы.Это не только уменьшает объем памяти для хранения матрицы,но и означает,что операции с этим типом матриц могут воспользоваться априорным знанием позиций ненулевых элементов для ускорения их вычислений.
zh_cn: 有许多类数学问题都会产生矩阵,其中有大量的元素为零。在这种情况下,有一种特殊的矩阵类型来处理这类问题是有意义的,在这种情况下,只有矩阵的非零元素被存储。这不仅减少了存储矩阵的内存量,而且意味着对这类矩阵的操作可以利用非零元素位置的先验知识来加速计算。

source: There are many different formats for representing such data. Currently, only the two most popular, <em>linear encoding</em> and <em>mu-law encoding</em>, are supported by Octave. There is an excellent FAQ on audio formats by Guido van Rossum <a href="mailto:guido@cwi.nl">guido@cwi.nl</a> which can be found at any FAQ ftp site, in particular in the directory
es: Hay muchos formatos diferentes para representar estos datos. Actualmente, solo las dos m&aacute;s populares, <em>la codificaci&oacute;n lineal</em> y la <em>codificaci&oacute;n </em><em>mu-law</em> , son compatibles con Octave. Hay una excelente FAQ sobre formatos de audio de Guido van Rossum <a href="mailto:guido@cwi.nl">guido@cwi.nl</a> que se puede encontrar en cualquier sitio ftp de FAQ, en particular en el directorio
ru: Есть много разных форматов для представления таких данных. В настоящее время Octave поддерживает только два самых популярных: <em>линейное кодирование</em> и <em>кодирование </em><em>по закону mu</em> . Есть отличный FAQ по аудиоформатам от Guido van Rossum <a href="mailto:guido@cwi.nl">guido@cwi.nl,</a> который можно найти на любом ftp-сайте FAQ, в частности, в каталоге
zh_cn: 有很多不同的格式来表示此类数据。当前，Octave仅支持两种最流行的<em>线性编码</em>和<em>mu-law编码</em>。有音频格式由Guido van Rossum的一个很好的常见问题<a href="mailto:guido@cwi.nl">guido@cwi.nl</a>它可以在任何FAQ ftp站点在目录中找到，特别是

source: There are many different means of storing sparse matrix data. What all of the methods have in common is that they attempt to reduce the complexity and storage given a priori knowledge of the particular class of problems that will be solved. A good summary of the available techniques for storing sparse matrix is given by Saad <a href="#FOOT8" name="DOCF8"><sup>8</sup></a>. With full matrices, knowledge of the point of an element of the matrix within the matrix is implied by its position in the computers memory. However, this is not the case for sparse matrices, and so the positions of the nonzero elements of the matrix must equally be stored.
es: Hay muchos medios diferentes para almacenar datos matriciales dispersos. Lo que todos los m&eacute;todos tienen en com&uacute;n es que intentan reducir la complejidad y el almacenamiento dado el conocimiento a priori de la clase particular de problemas que se resolver&aacute;n. Saad <a href="#FOOT8" name="DOCF8"><sup>8 ofrece</sup></a> un buen resumen de las t&eacute;cnicas disponibles para almacenar matrices dispersas . Con matrices completas, el conocimiento del punto de un elemento de la matriz dentro de la matriz est&aacute; impl&iacute;cito en su posici&oacute;n en la memoria de la computadora. Sin embargo, este no es el caso de las matrices dispersas, por lo que las posiciones de los elementos distintos de cero de la matriz deben almacenarse igualmente.
ru: Есть много разных способов хранения разреженных матричных данных. Общим для всех этих методов является то, что они пытаются уменьшить сложность и объем памяти, учитывая априорное знание конкретного класса задач, которые будут решены. Хороший обзор доступных методов хранения разреженной матрицы дан в Saad <a href="#FOOT8" name="DOCF8"><sup>8</sup></a> . В случае полных матриц знание точки элемента матрицы внутри матрицы подразумевается его положением в памяти компьютера. Однако это не относится к разреженным матрицам, и поэтому позиции ненулевых элементов матрицы должны сохраняться одинаково.
zh_cn: 存储稀疏矩阵数据有很多不同的方法。所有这些方法的共同点是，在事先了解将要解决的特定问题类别的前提下，它们试图降低复杂性和存储量。 Saad <a href="#FOOT8" name="DOCF8"><sup>8</sup></a>很好地总结了稀疏矩阵的可用存储技术。对于全矩阵，矩阵元素在计算机内存中的位置隐含了矩阵元素的点的知识。但是，对于稀疏矩阵则不是这种情况，因此必须平等地存储矩阵的非零元素的位置。

source: There are many different variable types in Octave, but only ones created through <code>javaObject</code> can use Java functions. Before using Java with an unknown object the type can be checked with <code>isjava</code>.
es: Hay muchos tipos de variables diferentes en Octave, pero solo las creadas a trav&eacute;s de <code>javaObject</code> pueden usar funciones de Java. Antes de usar Java con un objeto desconocido, el tipo se puede verificar con <code>isjava</code> .
ru: В Octave есть много разных типов переменных, но только те, которые созданы с помощью <code>javaObject</code> , могут использовать функции Java. Перед использованием Java с неизвестным объектом тип можно проверить с помощью <code>isjava</code> .
zh_cn: Octave中有许多不同的变量类型，但是只有通过 <code>javaObject</code> 创建的变量类型才能使用Java函数。在对未知对象使用Java之前，可以使用 <code>isjava</code> 检查类型。

source: There are many functions that directly return sparse matrices. These include <em>speye</em>, <em>sprand</em>, <em>diag</em>, etc.
es: Hay muchas funciones que devuelven directamente matrices dispersas. Estos incluyen <em>speye</em> , <em>sprand</em> , <em>diag</em> , etc.
ru: Есть много функций, которые напрямую возвращают разреженные матрицы. К ним относятся <em>speye</em> , <em>sprand</em> , <em>diag</em> и т. Д.
zh_cn: 有许多直接返回稀疏矩阵的函数。这些包括<em>speye</em>，<em>sprand</em>，<em>diag</em>等。

source: There are seven different things covered in this section.
es: Hay siete cosas diferentes cubiertas en esta sección.
ru: В этом разделе рассматриваются семь разных вещей.
zh_cn: 本节涉及七种不同的东西。
