Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/octave/octave.*.020.xlf
Languages: es, ru, zh_cn

source: Vector <code>[X0 Y0 Z0]</code> where X0, Y0 and Z0 indicate the position of the text anchor as defined by <code>verticalalignment</code> and <code>horizontalalignment</code>.
es: Vector <code>[X0 Y0 Z0]</code> donde X0, Y0 y Z0 indican la posici&oacute;n del ancla de texto definida por <code>verticalalignment</code> y <code>horizontalalignment</code> .
ru: Вектор <code>[X0 Y0 Z0]</code> , где X0, Y0 и Z0 указывают положение привязки текста, определяемое <code>verticalalignment</code> и <code>horizontalalignment</code> .
zh_cn: 向量 <code>[X0 Y0 Z0]</code> 其中X0，Y0和Z0表示文本锚点的位置，该位置由 <code>verticalalignment</code> 和 <code>horizontalalignment</code> 定义。

source: Vector <code>[X0 Y0 Z0]</code> where X0, Y0, and Z0 indicate the position of the text anchor as defined by <code>verticalalignment</code> and <code>horizontalalignment</code>.
zh_cn: 向量 <code>[X0 Y0 Z0]</code> ，其中X0，Y0和Z0表示文本锚点的位置，该位置由 <code>verticalalignment</code> 和 <code>horizontalalignment</code> 定义。

source: Vector <code>[left bottom width height]</code> defining the position and size of the figure (in <code>paperunits</code> units) on the printed page. The position <code>[left bottom]</code> defines the lower left corner of the figure on the page, and the size is defined by <code>[width height]</code>. For output formats not implicitly rendered on paper, <code>width</code> and <code>height</code> define the size of the image and the position information is ignored. Setting <code>paperposition</code> also forces the <code>paperpositionmode</code> property to be set to <code>"manual"</code>.
es: Vector <code>[left bottom width height]</code> define la posici&oacute;n y el tama&ntilde;o de la figura (en unidades de <code>paperunits</code> ) en la p&aacute;gina impresa. La posici&oacute;n <code>[left bottom]</code> define la esquina inferior izquierda de la figura en la p&aacute;gina, y el tama&ntilde;o est&aacute; definido por <code>[width height]</code> . Para los formatos de salida no representados impl&iacute;citamente en papel, el <code>width</code> y el <code>height</code> definen el tama&ntilde;o de la imagen y la informaci&oacute;n de posici&oacute;n se ignora. La configuraci&oacute;n de la posici&oacute;n del <code>paperposition</code> tambi&eacute;n obliga a que la propiedad del modo de <code>paperpositionmode</code> del papel se establezca en <code>"manual"</code> .
ru: Вектор <code>[left bottom width height]</code> определяющий положение и размер рисунка (в <code>paperunits</code> единицах) на отпечатанной странице. Позиция <code>[left bottom]</code> определяет нижний левый угол рисунка на странице, а размер определяется <code>[width height]</code> . Для выходных форматов, которые неявно отображаются на бумаге, <code>width</code> и <code>height</code> определяют размер изображения, а информация о положении игнорируется. Установка <code>paperposition</code> также <code>paperpositionmode</code> устанавливает для свойства paperpositionmode значение <code>"manual"</code> .
zh_cn: 向量 <code>[left bottom width height]</code> 定义图形在打印页面上的位置和大小（以 <code>paperunits</code> 单位为单位）。位置 <code>[left bottom]</code> 定义页面上图形的左下角，大小由 <code>[width height]</code> 定义。对于未在纸上隐式呈现的输出格式， <code>width</code> 和 <code>height</code> 定义图像的大小，并且位置信息被忽略。设置 <code>paperposition</code> 还将强制将 <code>paperpositionmode</code> 属性设置为 <code>"manual"</code> 。

source: Vector <code>[width height]</code> defining the size of the paper for printing. Setting the <code>papersize</code> property to a value, not associated with one of the defined <code>papertypes</code> and consistent with the setting for <code>paperorientation</code>, forces the <code>papertype</code> property to the value <code>"&lt;custom&gt;"</code>. If <code>papersize</code> is set to a value associated with a supported <code>papertype</code> and consistent with the <code>paperorientation</code>, the <code>papertype</code> value is modified to the associated value.
es: Vector <code>[width height]</code> define el tama&ntilde;o del papel para imprimir. Configuraci&oacute;n del <code>papersize</code> propiedad en un valor, no asociado con uno de los definidos <code>papertypes</code> y consistente con el escenario de <code>paperorientation</code> , obliga al <code>papertype</code> propiedad en el valor <code>"&lt;custom&gt;"</code> . Si <code>papersize</code> se establece en un valor asociado con una soportado <code>papertype</code> y consistente con el <code>paperorientation</code> , la <code>papertype</code> valor se modifica para el valor asociado.
ru: Вектор <code>[width height]</code> определяющий размер бумаги для печати. Установка для свойства <code>papersize</code> значения, не связанного с одним из определенных <code>papertypes</code> и согласованного с установкой для <code>paperorientation</code> , принудительно устанавливает для свойства <code>papertype</code> значение <code>"&lt;custom&gt;"</code> . Если <code>papersize</code> установлен в значение , связанное с поддерживаемой <code>papertype</code> и в соответствии с <code>paperorientation</code> , то <code>papertype</code> значение изменяется с соответствующим значением.
zh_cn: 向量 <code>[width height]</code> 定义了要打印的纸张尺寸。设定 <code>papersize</code> 属性的一个值，而不是与所定义的一个相关联 <code>papertypes</code> 和与设定为一致 <code>paperorientation</code> ，迫使 <code>papertype</code> 属性的值 <code>"&lt;custom&gt;"</code> 。如果将 <code>papersize</code> 设置为与支持的 <code>papertype</code> 相关联且与paperorientation一致的 <code>paperorientation</code> ，则将 <code>papertype</code> 值修改为关联值。

source: Vector <code>[x0 y0 width height]</code> indicating the size and location of the text string.
es: Vector <code>[x0 y0 width height]</code> indica el tama&ntilde;o y la ubicaci&oacute;n de la cadena de texto.
ru: Вектор <code>[x0 y0 width height]</code> , указывающий размер и расположение текстовой строки.
zh_cn: 向量 <code>[x0 y0 width height]</code> 指示文本字符串的大小和位置。

source: Vector Formats
es: Formatos vectoriales
ru: векторные форматы
zh_cn: 矢量格式

source: Vector Rotation Matrices
zh_cn: 矢量旋转矩阵

source: Vector of the x-locations of the constraints.
es: Vector de las x-locaciones de las restricciones.
ru: Вектор х-локаций ограничений.
zh_cn: 限制因素的x位置的向量。

source: Vector of x data to be plotted.
es: Vector de datos x a ser graficado.
ru: Вектор х данных для построения графика.
zh_cn: 要绘制的x数据的向量。

source: Vector of y data to be plotted.
es: Vector de datos de y para ser graficado.
ru: Вектор данных y для построения графика.
zh_cn: 要绘制的y数据的向量。

source: Vector of z data to be plotted.
es: Vector de datos z a ser graficados.
ru: Вектор z данных для построения графика.
zh_cn: 要绘制的z数据的向量。

source: Vectorization and Faster Code Execution
es: Vectorización y ejecución más rápida de códigos
ru: Векторизация и более быстрое выполнение кода
zh_cn: 矢量化和更快的代码执行速度

source: Vectorization is a programming technique that uses vector operations instead of element-by-element loop-based operations. Besides frequently producing more succinct Octave code, vectorization also allows for better optimization in the subsequent implementation. The optimizations may occur either in Octave&rsquo;s own Fortran, C, or C++ internal implementation, or even at a lower level depending on the compiler and external numerical libraries used to build Octave. The ultimate goal is to make use of your hardware&rsquo;s vector instructions if possible or to perform other optimizations in software.
es: La vectorizaci&oacute;n es una t&eacute;cnica de programaci&oacute;n que utiliza operaciones vectoriales en lugar de operaciones basadas en bucles elemento por elemento. Adem&aacute;s de producir con frecuencia un c&oacute;digo de octava m&aacute;s sucinto, la vectorizaci&oacute;n tambi&eacute;n permite una mejor optimizaci&oacute;n en la implementaci&oacute;n posterior. Las optimizaciones pueden ocurrir en la propia implementaci&oacute;n interna de Fortran, C o C ++ de Octave, o incluso en un nivel m&aacute;s bajo, dependiendo del compilador y las bibliotecas num&eacute;ricas externas utilizadas para construir Octave. El objetivo final es hacer uso de las instrucciones vectoriales de su hardware si es posible o realizar otras optimizaciones en el software.
ru: Векторизация - это метод программирования, который использует векторные операции вместо поэлементных операций на основе цикла. Помимо частого создания более сжатого кода Octave, векторизация также позволяет улучшить оптимизацию в последующей реализации. Оптимизация может происходить либо во внутренней реализации Octave на Fortran, C или C ++, либо даже на более низком уровне, в зависимости от компилятора и внешних числовых библиотек, используемых для построения Octave. Конечная цель - по возможности использовать векторные инструкции вашего оборудования или выполнить другие оптимизации в программном обеспечении.
zh_cn: 向量化是一种使用向量运算而非基于逐个元素的循环的运算的编程技术。除了经常产生更简洁的Octave代码外，矢量化还允许在后续实现中进行更好的优化。优化可能在Octave自己的Fortran，C或C ++内部实现中进行，甚至可能在较低级别进行，具体取决于用于构建Octave的编译器和外部数值库。最终目标是在可能的情况下利用硬件的矢量指令或在软件中执行其他优化。

source: Vectorization is not a concept unique to Octave, but it is particularly important because Octave is a matrix-oriented language. Vectorized Octave code will see a dramatic speed up (10X&ndash;100X) in most cases.
es: La vectorizaci&oacute;n no es un concepto exclusivo de Octave, pero es particularmente importante porque Octave es un lenguaje orientado a matrices. El c&oacute;digo de octava vectorizado ver&aacute; una aceleraci&oacute;n espectacular (10X &ndash; 100X) en la mayor&iacute;a de los casos.
ru: Векторизация - это не уникальная концепция Octave, но она особенно важна, потому что Octave - это матрично-ориентированный язык. Векторизованный октавный код в большинстве случаев значительно ускоряется (в 10&ndash;100 раз).
zh_cn: 向量化不是Octave独有的概念，但它特别重要，因为Octave是面向矩阵的语言。在大多数情况下，矢量化倍频程代码的速度将大大提高（10X&ndash;100X）。

source: Vectorization is the preferred technique for eliminating loops and speeding up code. Nevertheless, it is not always possible to replace every loop. In such situations it may be worth trying Octave&rsquo;s <strong>experimental</strong> Just-In-Time (JIT) compiler.
es: La vectorizaci&oacute;n es la t&eacute;cnica preferida para eliminar bucles y acelerar el c&oacute;digo. Sin embargo, no siempre es posible reemplazar todos los bucles. En tales situaciones, puede valer la pena probar el compilador <strong>experimental</strong> Just-In-Time (JIT) de Octave .
ru: Векторизация - предпочтительный метод устранения циклов и ускорения кода. Тем не менее не всегда возможно заменить каждую петлю. В таких ситуациях, возможно, стоит попробовать <strong>экспериментальный</strong> компилятор Octave Just-In-Time (JIT).
zh_cn: 向量化是消除循环并加快代码速度的首选技术。但是，并非总是可以替换每个循环。在这种情况下，值得尝试使用Octave的<strong>实验</strong>性即时（JIT）编译器。

source: Vectorized arithmetic
es: Aritmética vectorial
ru: векторизованная арифметика
zh_cn: 矢量化算术

source: Vectors and matrices are the basic building blocks for numerical analysis. To create a new matrix and store it in a variable so that you can refer to it later, type the command
es: Los vectores y las matrices son los elementos básicos para el análisis numérico.Para crear una nueva matriz y guardarla en una variable para poder consultarla más tarde,escriba el comando
ru: Векторы и матрицы являются основными строительными блоками для численного анализа.Чтобы создать новую матрицу и сохранить ее в переменной,чтобы к ней можно было обратиться позже,наберите команду
zh_cn: 矢量和矩阵是数值分析的基本构件。要创建一个新的矩阵并将其存储在一个变量中,以便以后可以引用它,请键入以下命令

source: Verify that <var>str</var> is an element, or substring of an element, in <var>strarray</var>.
es: Verifique que <var>str</var> sea ​​un elemento, o subcadena de un elemento, en <var>strarray</var> .
ru: Убедитесь, что <var>str</var> является элементом или подстрокой элемента в <var>strarray</var> .
zh_cn: 验证 <var>str</var> 是 <var>strarray</var> 中的一个元素或元素的子字符串。

source: Version of the package.
es: Versión del paquete.
ru: Версия пакета.
zh_cn: 包的版本。

source: Version of the package. A package version is typically digits separated by dots but may also contain &lsquo;
zh_cn: 软件包的版本。套件版本通常是由点分隔的数字，但也可能包含'

source: Version of the package. A package version must be 3 numbers separated by dots.
es: Versión del paquete.Una versión del paquete debe ser de 3 números separados por puntos.
ru: Версия пакета.Версия пакета должна состоять из 3-х чисел,разделенных точками.
zh_cn: 软件包的版本。一个软件包的版本必须是3个用点分开的数字。

source: Vertex normals are used for lighting the edges or faces if the <code>edgelighting</code> or <code>facelighting</code> properties are set to <code>"gouraud"</code>. Setting <code>vertexnormals</code> also forces the <code>vertexnormalsmode</code> property to be set to <code>"manual"</code>
es: V&eacute;rtices normales se utilizan para la iluminaci&oacute;n de los bordes o caras si los <code>edgelighting</code> o <code>facelighting</code> propiedades se establecen a <code>"gouraud"</code> . La configuraci&oacute;n de <code>vertexnormals</code> tambi&eacute;n obliga a que la propiedad <code>vertexnormalsmode</code> se establezca en <code>"manual"</code>
ru: Vertex нормали используются для освещения краев или лица , если <code>edgelighting</code> или <code>facelighting</code> свойство установлены в <code>"gouraud"</code> . Установка <code>vertexnormals</code> также <code>vertexnormalsmode</code> к тому, что для свойства vertexnormalsmode устанавливается значение <code>"manual"</code>
zh_cn: 顶点法线用于如果照明边缘或面 <code>edgelighting</code> 或 <code>facelighting</code> 属性被设置为 <code>"gouraud"</code> 。设置 <code>vertexnormals</code> 模式也会强制将 <code>vertexnormalsmode</code> 属性设置为 <code>"manual"</code>

source: Vertical concatenation
es: Concatenación vertical
ru: Вертикальное уплотнение
zh_cn: 纵向连接

source: Via <a href="java-interface-functions#XREFjavaObject">javaObject</a> one may create all kinds of Java objects but arrays. The latter are created through <a href="java-interface-functions#XREFjavaArray">javaArray</a>.
es: A trav&eacute;s de <a href="java-interface-functions#XREFjavaObject">javaObject,</a> uno puede crear todo tipo de objetos Java, excepto matrices. Estos &uacute;ltimos se crean a trav&eacute;s de <a href="java-interface-functions#XREFjavaArray">javaArray</a> .
ru: С помощью <a href="java-interface-functions#XREFjavaObject">javaObject</a> можно создавать все виды Java-объектов, кроме массивов. Последние создаются через <a href="java-interface-functions#XREFjavaArray">javaArray</a> .
zh_cn: 通过<a href="java-interface-functions#XREFjavaObject">javaObject</a>可以创建除数组之外的所有Java对象。后者是通过<a href="java-interface-functions#XREFjavaArray">javaArray</a>创建的。

source: Voronoi Diagrams
es: Diagramas de Voronoi
ru: Вороной Диаграммы
zh_cn: 伏罗尼图

source: W. Gautschi,
ru: W.Гаучи,
zh_cn: W.高奇

source: W.H. Press, et al.,
ru: У.Х.Пресс и др..,
zh_cn: W.H.Press,等。

source: WAV file
es: Archivo WAV
ru: WAV-файл
zh_cn: WAV文件

source: WCOREDUMP (status)
es: WCOREDUMP (estado)
ru: WCOREDUMP (статус)
zh_cn: WCOREDUMP(状态)

source: WEXITSTATUS (status)
es: WEXITSTATUS (estado)
ru: ВЕКСИТСТАТУС (статус)
zh_cn: WEXITSTATUS(状态)

source: WIFCONTINUED (status)
es: WIFCONTINUADO (estado)
ru: ВИФКОНТИНУИРОВАННЫЙ (статус)
zh_cn: WIFCONTINUED(状态)

source: WIFEXITED (status)
es: WIFEXITED (estado)
ru: ПОЖАЛУЧЕННЫЙ (статус)
zh_cn: WIFEXITED(状态)

source: WIFSIGNALED (status)
es: WIFSIGNALED (estado)
ru: ПОДРАЗУМЕВАЕМЫЙ (статус)
zh_cn: WIFSIGNALED(状态)

source: WIFSTOPPED (status)
es: WIFSTOPPED (estado)
ru: ПОДТВЕРЖДЕННЫЙ (статус)
zh_cn: WIFSTOPPED(状态)

source: WSTOPSIG (status)
es: WSTOPSIG (estado)
ru: WSTOPSIG (статус)
zh_cn: WSTOPSIG(状态)

source: WTERMSIG (status)
es: WTERMSIG (estado)
ru: ВТЕРМСИГ (статус)
zh_cn: WTERMSIG(状态)

source: WWW Access
zh_cn: WWW访问

source: Wait for any child process whose process group ID is equal to that of the Octave interpreter process.
es: Espere a cualquier proceso infantil cuya identificación de grupo de proceso sea igual a la del proceso de interpretación de la Octava.
ru: Дождитесь любого дочернего процесса,идентификатор группы процессов которого равен идентификатору процесса интерпретации октавы.
zh_cn: 等待进程组ID与Octave解释器进程ID相等的任何子进程。

source: Wait for any child process.
es: Espera a cualquier proceso infantil.
ru: Дождитесь любого детского процесса.
zh_cn: 等待任何一个孩子的过程。

source: Wait for mouse click or key press over the current figure window.
es: Espere a que el ratón haga clic o pulse la tecla sobre la ventana de la figura actual.
ru: Дождитесь щелчка мыши или нажатия клавиши над текущим окном рисунка.
zh_cn: 在当前人物窗口上等待鼠标点击或按键。

source: Wait for process <var>pid</var> to terminate.
es: Espere a que termine el <var>pid</var> del proceso .
ru: Подождите, пока процесс <var>pid</var> завершится.
zh_cn: 等待进程 <var>pid</var> 终止。

source: Wait for termination of the child process with ID <var>pid</var>.
es: Espere la finalizaci&oacute;n del proceso hijo con ID <var>pid</var> .
ru: Дождитесь завершения дочернего процесса с идентификатором <var>pid</var> .
zh_cn: 等待ID为 <var>pid</var> 的子进程终止。

source: Wait for writes to complete.
es: Espere a que se complete la escritura.
ru: Подожди,пока не закончат писать.
zh_cn: 等待写入完成。

source: Wait until signal is received or a child process exits (this is the default if the <var>options</var> argument is missing).
es: Espere hasta que se reciba la se&ntilde;al o se cierre un proceso hijo (este es el valor predeterminado si falta el argumento de <var>options</var> ).
ru: Подождите, пока не будет получен сигнал или пока дочерний процесс не завершится (это значение по умолчанию, если аргумент <var>options</var> отсутствует).
zh_cn: 等待直到收到信号或退出子进程（如果缺少 <var>options</var> 参数，这是默认值）。

source: We can check for the existence of the <code>roots</code>-method by calling:
es: Podemos verificar la existencia del m&eacute;todo de <code>roots</code> llamando a:
ru: Мы можем проверить существование метода <code>roots</code> , вызвав:
zh_cn: 我们可以通过调用以下命令来检查是否存在 <code>roots</code> -method：

source: We can reset it to be automatic:
es: Podemos resetearlo para que sea automático:
ru: Мы можем перезагрузить его в автоматический режим:
zh_cn: 我们可以将其重置为自动。

source: We can set it back to automatic:
es: Podemos volver a ponerlo en automático:
ru: Мы можем перевести его на автоматический режим:
zh_cn: 我们可以把它设置为自动。

source: We can then move the camera further up the z-axis:
es: Entonces podemos mover la cámara más arriba del eje z:
ru: Затем мы можем передвинуть камеру дальше по оси Z:
zh_cn: 然后,我们可以将摄像机进一步向Z轴上移动。

source: We can turn the camera to point at a new target:
es: Podemos girar la cámara para apuntar a un nuevo objetivo:
ru: Мы можем повернуть камеру,чтобы указать на новую цель:
zh_cn: 我们可以将摄像头转向指向一个新的目标。

source: We only know it is the binary multiplication operator, but fortunately this operator appears only at one place in the code and thus we know which occurrence takes so much time. If there were multiple places, we would have to use the hierarchical profile to find out the exact place which uses up the time which is not covered in this example.
es: Sólo sabemos que es el operador de multiplicación binaria,pero afortunadamente este operador aparece sólo en un lugar del código y así sabemos qué ocurrencia lleva tanto tiempo.Si hubiera varios lugares,tendríamos que usar el perfil jerárquico para averiguar el lugar exacto que consume el tiempo que no está cubierto en este ejemplo.
ru: Известно только,что это двоичный оператор умножения,но,к счастью,этот оператор появляется в коде только в одном месте,а значит,мы знаем,какое событие занимает столько времени.Если бы их было несколько,то нам пришлось бы использовать иерархический профиль,чтобы узнать точное место,использующее время,не описанное в данном примере.
zh_cn: 我们只知道是二进制乘法运算符,但幸运的是这个运算符在代码中只出现了一个地方,因此我们知道是哪个地方出现了这么多时间。如果有多处,我们就必须用层次剖析法来找出到底是哪个地方耗费了时间,这在本例中没有涉及。

source: Week number of year with Monday as first day of week (00-53).
es: El número de la semana del año con el lunes como primer día de la semana (00-53).
ru: Номер недели в году с понедельника как первого дня недели (00-53).
zh_cn: 年的周数,周一为一周的第一天(00-53)。

source: Week number of year with Sunday as first day of week (00-53).
es: Semana número del año con el domingo como primer día de la semana (00-53).
ru: Номер недели в году с воскресеньем в первый день недели (00-53).
zh_cn: 以星期日为一周的第一天(00-53)的年份周数。

source: What are the possible pairs?
es: ¿Cuáles son los posibles pares?
ru: Каковы возможные пары?
zh_cn: 可能的对子有哪些?

source: When <code><var>t</var> = 1</code>, return the pseudo-lower triangular Cholesky factor of the Pascal matrix (The sign of some columns may be negative). This matrix is its own inverse, that is <code>pascal (<var>n</var>, 1) ^ 2 == eye (<var>n</var>)</code>.
es: Cuando <code><var>t</var> = 1</code> , devuelve el factor Cholesky triangular pseudo-inferior de la matriz de Pascal (el signo de algunas columnas puede ser negativo). Esta matriz es su propia inversa, es decir, <code>pascal (<var>n</var>, 1) ^ 2 == eye (<var>n</var>)</code> .
ru: Когда <code><var>t</var> = 1</code> , вернуть псевдо-нижний треугольный фактор Холецкого матрицы Паскаля (знак некоторых столбцов может быть отрицательным). Эта матрица является собственной инверсией, то есть <code>pascal (<var>n</var>, 1) ^ 2 == eye (<var>n</var>)</code> .
zh_cn: 当 <code><var>t</var> = 1</code> ，返回Pascal矩阵的伪下三角Cholesky因子（某些列的符号可能为负）。这个矩阵是它自己的逆，即 <code>pascal (<var>n</var>, 1) ^ 2 == eye (<var>n</var>)</code> 。

source: When <code>page_screen_output</code> is <code>false</code>, this variable has no effect.
zh_cn: 当 <code>page_screen_output</code> 为 <code>false</code> 时，此变量无效。

source: When <var>a</var> and <var>b</var> are the coefficient vectors of two polynomials, the convolution represents the coefficient vector of the product polynomial.
es: Cuando <var>a</var> y <var>b</var> son los vectores de coeficientes de dos polinomios, la convoluci&oacute;n representa el vector de coeficientes del polinomio producto.
ru: Когда <var>a</var> и <var>b</var> являются векторами коэффициентов двух полиномов, свертка представляет вектор коэффициентов полинома произведения.
zh_cn: 当 <var>a</var> 和 <var>b</var> 是两个多项式的系数向量时，卷积表示乘积多项式的系数向量。

source: When <var>coorsys</var> is set to <code>"camera"</code>, the camera is moved left or right by rotating it around an axis parallel to the camera up vector (see <a href="#XREFcamup">camup</a>). The input <var>dir</var> should not be specified in this case. Example:
es: Cuando <var>coorsys</var> se establece en <code>"camera"</code> , la c&aacute;mara se mueve hacia la izquierda o hacia la derecha gir&aacute;ndola alrededor de un eje paralelo al vector de c&aacute;mara hacia arriba (ver <a href="#XREFcamup">camup</a> ). En este caso, no se debe especificar el <var>dir</var> ectorio de entrada . Ejemplo:
ru: Когда для <var>coorsys</var> установлено значение <code>"camera"</code> , камера перемещается влево или вправо, вращая ее вокруг оси, параллельной вектору вверх камеры (см. <a href="#XREFcamup">Camup</a> ). Входной <var>dir</var> в этом случае указывать не нужно. Пример:
zh_cn: 当 <var>coorsys</var> 设置为 <code>"camera"</code> ，通过绕平行于摄像机向上向量的轴旋转摄像机，可以左右移动摄像机（请参见<a href="#XREFcamup">camup</a>）。在这种情况下，不应指定输入 <var>dir</var> 。例：
