Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/octave/octave.*.011.xlf
Languages: es, ja, ru, zh_cn

source: Any number of <code>elseif</code> clauses may appear. Each condition is tested in turn, and if one is found to be true, its corresponding <var>body</var> is executed. If none of the conditions are true and the <code>else</code> clause is present, its body is executed. Only one <code>else</code> clause may appear, and it must be the last part of the statement.
es: Puede aparecer cualquier cantidad de cl&aacute;usulas <code>elseif</code> . Cada condici&oacute;n se prueba a su vez, y si se encuentra que una es verdadera, se ejecuta su <var>body</var> correspondiente . Si ninguna de las condiciones es verdadera y la cl&aacute;usula <code>else</code> est&aacute; presente, su cuerpo se ejecuta. Solo puede aparecer una cl&aacute;usula <code>else</code> , y debe ser la &uacute;ltima parte de la declaraci&oacute;n.
ja: <code>elseif</code> 句はいくつあってもかまいません。各条件が順番にテストされ、条件が真であることが判明した場合、対応する <var>body</var> が実行されます。いずれの条件も満たさず、 <code>else</code> 句が存在する場合、その本体が実行されます。 <code>else</code> 句は1つだけ指定でき、ステートメントの最後の部分でなければなりません。
ru: Может появиться любое количество предложений <code>elseif</code> . Каждое условие проверяется по очереди, и если какое-либо условие выполняется, выполняется соответствующее <var>body</var> . Если ни одно из условий не является истинным и присутствует предложение <code>else</code> , выполняется его тело. Может появиться только одно предложение <code>else</code> , и оно должно быть последней частью утверждения.
zh_cn: 可以出现任意数量的 <code>elseif</code> 子句。依次测试每个条件，如果发现一个条件为真，则执行其对应的 <var>body</var> 。如果所有条件都不为真且 <code>else</code> 子句存在，则执行其主体。只能出现 <code>else</code> 子句，并且它必须是语句的最后一部分。

source: Any number of data sets (<var>x1</var>,<var>y1</var>, <var>x2</var>,<var>y2</var>, &hellip;) may appear as long as they are separated by a format string <var>fmt</var>.
es: Puede aparecer cualquier n&uacute;mero de conjuntos de datos ( <var>x1</var> , <var>y1</var> , <var>x2</var> , <var>y2</var> ,&hellip;) siempre que est&eacute;n separados por una cadena de formato <var>fmt</var> .
ja: フォーマット文字列 <var>fmt</var> で区切られている限り、任意の数のデータセット（ <var>x1</var> 、 <var>y1</var> 、 <var>x2</var> 、 <var>y2</var> 、&hellip;）が表示されます。
ru: Может появиться любое количество наборов данных ( <var>x1</var> , <var>y1</var> , <var>x2</var> , <var>y2</var> ,&hellip;), если они разделены строкой формата <var>fmt</var> .
zh_cn: 只要由格式字符串 <var>fmt</var> 分隔，就可以出现任意数量的数据集（ <var>x1</var> ， <var>y1</var> ， <var>x2</var> ， <var>y2</var> 等）。

source: Any numeric entries in a cell array will be converted to text using <code>sprintf ("%g")</code>. For more precise control of the appearance convert any numeric entries to strings using <code>num2str</code>, <code>sprintf</code>, etc., before calling <code>text</code>.
ja: セル配列の数値エントリは、 <code>sprintf ("%g")</code> を使用してテキストに変換されます。外観をより正確に制御するには、 <code>text</code> 呼び出す前に、 <code>num2str</code> 、 <code>sprintf</code> などを使用して数値エントリを文字列に変換します。
zh_cn: 单元格数组中的任何数字条目都将使用 <code>sprintf ("%g")</code> 转换为文本。为了更精确地控制外观，在调用 <code>text</code> 之前，请使用 <code>num2str</code> ， <code>sprintf</code> 等将任何数字条目转换为字符串。

source: Any optional <var>format</var> specified by the programmer is used without modification. This is in contrast to <small>MATLAB</small> which tampers with the <var>format</var> based on internal heuristics.
es: Cualquier <var>format</var> o opcional especificado por el programador se utiliza sin modificaciones. Esto contrasta con <small>MATLAB,</small> que manipula el <var>format</var> o bas&aacute;ndose en heur&iacute;sticas internas.
ja: プログラマーが指定したオプションの <var>format</var> は、変更せずに使用されます。これは、内部のヒューリスティックに基づいて <var>format</var> を改ざんする<small>MATLAB</small>とは対照的です。
ru: Любой дополнительный <var>format</var> указанный программистом, используется без изменений. Это контрастирует с <small>MATLAB,</small> который вмешивается в <var>format</var> на основе внутренней эвристики.
zh_cn: 使用程序员指定的任何可选 <var>format</var> ，无需进行修改。这与<small>MATLAB</small>会篡改基于内部启发法的 <var>format</var> 相反。

source: Any optional arguments are passed directly to <code>dlmread</code> (see <a href="#XREFdlmread">dlmread</a>).
es: Cualquier argumento opcional se pasa directamente a <code>dlmread</code> (ver <a href="#XREFdlmread">dlmread</a> ).
ja: オプションの引数は、 <code>dlmread</code> に直接渡されます（<a href="#XREFdlmread">dlmreadを</a>参照）。
ru: Любые необязательные аргументы передаются непосредственно в <code>dlmread</code> (см. <a href="#XREFdlmread">Dlmread</a> ).
zh_cn: 任何可选参数都直接传递到 <code>dlmread</code> （请参阅<a href="#XREFdlmread">dlmread</a>）。

source: Any optional arguments are passed directly to <code>dlmwrite</code> (see <a href="#XREFdlmwrite">dlmwrite</a>).
es: Cualquier argumento opcional se pasa directamente a <code>dlmwrite</code> (ver <a href="#XREFdlmwrite">dlmwrite</a> ).
ja: オプションの引数は <code>dlmwrite</code> に直接渡されます（<a href="#XREFdlmwrite">dlmwriteを</a>参照）。
ru: Любые необязательные аргументы передаются непосредственно в <code>dlmwrite</code> (см. <a href="#XREFdlmwrite">Dlmwrite</a> ).
zh_cn: 任何可选参数都直接传递到 <code>dlmwrite</code> （请参阅<a href="#XREFdlmwrite">dlmwrite</a>）。

source: Any parameter whose name contains the name of a type (e.g., <var>integer</var> or <var>matrix</var>) is expected to be of that type. Parameters named <var>object</var> may be of any type. Parameters with other sorts of names (e.g., <var>new_file</var>) are discussed specifically in the description of the function. In some sections, features common to parameters of several functions are described at the beginning.
es: Se espera que cualquier par&aacute;metro cuyo nombre contenga el nombre de un tipo (por ejemplo, <var>integer</var> o <var>matrix</var> ) sea de ese tipo. Los par&aacute;metros denominados <var>object</var> pueden ser de cualquier tipo. Los par&aacute;metros con otros tipos de nombres (por ejemplo, <var>new_file</var> ) se tratan espec&iacute;ficamente en la descripci&oacute;n de la funci&oacute;n. En algunas secciones, las caracter&iacute;sticas comunes a los par&aacute;metros de varias funciones se describen al principio.
ja: 名前に型の名前（例： <var>integer</var> または <var>matrix</var> ）が含まれているパラメーターは、その型であることが期待されます。 <var>object</var> という名前のパラメーターは、どのタイプでもかまいません。他の種類の名前を持つパラメータ（たとえば、 <var>new_file</var> ）は、関数の説明で具体的に説明されています。一部のセクションでは、いくつかの関数のパラメーターに共通する機能が最初に説明されています。
ru: Ожидается, что любой параметр, имя которого содержит имя типа (например, <var>integer</var> или <var>matrix</var> ), будет иметь этот тип. Параметры именованного <var>object</var> могут быть любого типа. Параметры с другими видами имен (например, <var>new_file</var> ) обсуждаются специально в описании функции. В некоторых разделах в начале описываются особенности, общие для параметров нескольких функций.
zh_cn: 名称中包含类型名称（例如 <var>integer</var> 或 <var>matrix</var> ）的任何参数都应属于该类型。名为 <var>object</var> 的参数可以是任何类型。具有其他种类名称的参数（例如 <var>new_file</var> ）在函数说明中进行了专门讨论。在某些部分中，开头描述了几个功能的参数共有的功能。

source: Any previously existing axes that would be (partly) covered by the newly created axes are deleted.
ja: 新しく作成された軸によって(部分的に)カバーされるであろう以前に存在していた軸はすべて削除されます。
zh_cn: 任何先前存在的、将被新创建的轴所覆盖(部分)的轴都被删除。

source: Any property/value input pairs are assigned to the surface object.
es: Cualquier par de entrada de propiedad/valor se asigna al objeto de la superficie.
ja: 任意のプロパティ/値の入力ペアがサーフェスオブジェクトに割り当てられます。
ru: Любые пары входных свойств/значений назначаются объекту поверхности.
zh_cn: 任何属性/值输入对都被分配给曲面对象。

source: Any property/value input pairs are assigned to the surface object. The full list of properties is documented at <a href="surface-properties#Surface-Properties">Surface Properties</a>.
ja: プロパティ/値の入力ペアはすべて、サーフェスオブジェクトに割り当てられます。プロパティの完全なリストは、SurfacePropertiesに記載されてい<a href="surface-properties#Surface-Properties">ます</a>。
zh_cn: 任何属性/值输入对都分配给表面对象。有关属性的完整列表，请参见&ldquo;<a href="surface-properties#Surface-Properties">表面属性&rdquo;</a>。

source: Any property/value pairs are passed directly to the underlying axes object.
es: Cualquier par de propiedad/valor se pasa directamente al objeto de los ejes subyacentes.
ja: すべてのプロパティ/値のペアは、基礎となる軸オブジェクトに直接渡されます。
ru: Любые пары свойств/значений передаются непосредственно объекту базовых осей.
zh_cn: 任何属性/值对都直接传递给底层的轴对象。

source: Any property/value pairs are passed directly to the underlying axes object. The full list of properties is documented at <a href="axes-properties#Axes-Properties">Axes Properties</a>.
ja: プロパティと値のペアはすべて、基になるAxesオブジェクトに直接渡されます。プロパティの完全なリストは、<a href="axes-properties#Axes-Properties">AxesPropertiesに</a>記載されています。
zh_cn: 任何属性/值对都直接传递到基础轴对象。有关属性的完整列表，请<a href="axes-properties#Axes-Properties">参见&ldquo;轴属性&rdquo;</a>。

source: Any property/value pairs are passed directly to the underlying patch object.
es: Cualquier par de propiedad/valor se pasa directamente al objeto de parcheo subyacente.
ja: すべてのプロパティ/値のペアは、基礎となるパッチオブジェクトに直接渡されます。
ru: Любые пары свойств/значений передаются непосредственно в базовый объект патча.
zh_cn: 任何属性/值对都直接传递给底层补丁对象。

source: Any property/value pairs are passed directly to the underlying patch object. The full list of properties is documented at <a href="patch-properties#Patch-Properties">Patch Properties</a>.
ja: プロパティと値のペアはすべて、基になるパッチオブジェクトに直接渡されます。プロパティの完全なリストは、<a href="patch-properties#Patch-Properties">パッチのプロパティに</a>記載されています。
zh_cn: 任何属性/值对都直接传递到基础补丁对象。有关属性的完整列表，请<a href="patch-properties#Patch-Properties">参见&ldquo;修补程序属性&rdquo;</a>。

source: Any property/value pairs are passed directly to the underlying surface object.
es: Cualquier par de propiedad/valor se pasa directamente al objeto de la superficie subyacente.
ja: すべてのプロパティ/値のペアは、基礎となるサーフェスオブジェクトに直接渡されます。
ru: Любые пары свойства/значения передаются непосредственно объекту подстилающей поверхности.
zh_cn: 任何属性/值对都直接传递给底层曲面对象。

source: Any property/value pairs are passed directly to the underlying surface object. The full list of properties is documented at <a href="surface-properties#Surface-Properties">Surface Properties</a>.
ja: プロパティと値のペアはすべて、基になるサーフェスオブジェクトに直接渡されます。プロパティの完全なリストは、SurfacePropertiesに記載されてい<a href="surface-properties#Surface-Properties">ます</a>。
zh_cn: 任何属性/值对都直接传递到基础表面对象。有关属性的完整列表，请参见&ldquo;<a href="surface-properties#Surface-Properties">表面属性&rdquo;</a>。

source: Any provided property value pairs will override the default values of the created uibuttongroup object.
es: Los pares de valores de propiedad proporcionados anularán los valores por defecto del objeto uibuttongroup creado.
ja: 与えられたプロパティ値のペアは、作成された uibuttongroup オブジェクトのデフォルト値を上書きします。
ru: Любые предоставленные пары значений свойств будут переопределять значения по умолчанию созданного объекта uibuttongroup.
zh_cn: 任何提供的属性值对都将覆盖创建的uibuttongroup对象的默认值。

source: Any provided property value pairs will override the default values of the created uicontextmenu object.
es: Los pares de valores de propiedad proporcionados anularán los valores por defecto del objeto creado uicontextmenu.
ja: 与えられたプロパティ値のペアは、作成されたuicontextmenuオブジェクトのデフォルト値を上書きします。
ru: Любые предоставленные пары значений свойств будут переопределять значения по умолчанию созданного объекта uicontextmenu.
zh_cn: 任何提供的属性值对将覆盖创建的uicontextmenu对象的默认值。

source: Any provided property value pairs will override the default values of the created uicontrol object.
es: Los pares de valores de propiedad proporcionados anularán los valores por defecto del objeto de uicontrol creado.
ja: 提供されたプロパティ値のペアは、作成されたuicontrolオブジェクトのデフォルト値を上書きします。
ru: Любые предоставленные пары значений свойств будут переопределять значения по умолчанию созданного объекта uicontrol.
zh_cn: 任何提供的属性值对将覆盖创建的uicontrol对象的默认值。

source: Any provided property value pairs will override the default values of the created uipanel object.
es: Los pares de valores de propiedad proporcionados anularán los valores por defecto del objeto uipanel creado.
ja: 指定されたプロパティ値のペアは、作成されたuipanelオブジェクトのデフォルト値を上書きします。
ru: Любые предоставленные пары значений свойств будут переопределять значения по умолчанию созданного объекта uipanel.
zh_cn: 任何提供的属性值对将覆盖创建的uipanel对象的默认值。

source: Any provided property value pairs will override the default values of the created uipushtool object.
es: Los pares de valores de propiedad proporcionados anularán los valores por defecto del objeto uipushtool creado.
ja: 指定されたプロパティ値のペアは、作成されたuipushtoolオブジェクトのデフォルト値を上書きします。
ru: Любые предоставленные пары значений свойств будут переопределять значения по умолчанию созданного объекта uipushtool.
zh_cn: 任何提供的属性值对都将覆盖创建的uipushtool对象的默认值。

source: Any provided property value pairs will override the default values of the created uitable object.
es: Los pares de valores de propiedad proporcionados anularán los valores por defecto del objeto útil creado.
ja: 提供されたプロパティ値のペアは、作成されたuitableオブジェクトのデフォルト値を上書きします。
ru: Любые предоставленные пары значений свойств будут переопределять значения по умолчанию созданного uitable объекта.
zh_cn: 任何提供的属性值对将覆盖创建的可使用对象的默认值。

source: Any provided property value pairs will override the default values of the created uitoggletool object.
es: Los pares de valores de propiedad proporcionados anularán los valores por defecto del objeto uitoggletool creado.
ja: 指定されたプロパティ値のペアは、作成された uitoggletool オブジェクトのデフォルト値を上書きします。
ru: Любые предоставленные пары значений свойств будут переопределять значения по умолчанию созданного объекта uitoggletool.
zh_cn: 任何提供的属性值对将覆盖创建的uitoggletool对象的默认值。

source: Any provided property value pairs will override the default values of the created uitoolbar object.
es: Los pares de valores de propiedad proporcionados anularán los valores por defecto del objeto uitoolbar creado.
ja: 指定されたプロパティ値のペアは、作成されたuitoolbarオブジェクトのデフォルト値を上書きします。
ru: Любые предоставленные пары значений свойств будут переопределять значения по умолчанию созданного объекта uitoolbar.
zh_cn: 任何提供的属性值对都将覆盖创建的uitoolbar对象的默认值。

source: Any regular function can be used as a command if it accepts string input arguments. For example:
es: Cualquier función regular puede ser usada como un comando si acepta argumentos de entrada de cadena.Por ejemplo:
ja: 文字列の入力引数を受け付ける場合は、どのような正規関数でもコマンドとして使用できます。例えば、以下のようになります。
ru: Любая обычная функция может быть использована в качестве команды,если она принимает входные строковые аргументы.Например:
zh_cn: 任何正则函数都可以作为命令使用,如果它接受字符串输入参数。例如:

source: Any string arguments must be passed after the other arguments.
es: Cualquier argumento de cuerda debe ser pasado después de los otros argumentos.
ja: 文字列の引数は、他の引数の後に渡さなければなりません。
ru: Любые строковые аргументы должны передаваться после других аргументов.
zh_cn: 任何字符串参数必须在其他参数之后传递。

source: Any string input arguments must be passed after all other arguments.
es: Cualquier argumento de entrada de cadena debe ser pasado después de todos los demás argumentos.
ja: 文字列入力の引数は、他のすべての引数の後に渡されなければなりません。
ru: Любые входные аргументы строки должны передаваться после всех остальных аргументов.
zh_cn: 任何字符串输入参数必须在所有其他参数之后传递。

source: Any text between the continuation marker and the newline character is ignored. For example, the statement
es: Cualquier texto entre el marcador de continuación y el carácter de la nueva línea es ignorado.Por ejemplo,la declaración
ja: 継続マーカと改行文字の間のテキストはすべて無視されます。例えば
ru: Любой текст между маркером продолжения и символом новой строки игнорируется.Например,утверждение
zh_cn: 延续标记和换行符之间的任何文本都将被忽略。例如,语句

source: Any variables that are not found in the argument list are inherited from the enclosing scope. Anonymous functions are useful for creating simple unnamed functions from expressions or for wrapping calls to other functions to adapt them for use by functions like <code>quad</code>. For example,
es: Cualquier variable que no se encuentre en la lista de argumentos se hereda del &aacute;mbito adjunto. Las funciones an&oacute;nimas son &uacute;tiles para crear funciones simples sin nombre a partir de expresiones o para envolver llamadas a otras funciones para adaptarlas para su uso por funciones como <code>quad</code> . Por ejemplo,
ja: 引数リストにない変数は、それを囲むスコープから継承されます。無名関数は、式から名前のない単純な関数を作成する場合や、他の関数の呼び出しをラップして <code>quad</code> などの関数で使用できるようにそれらを適合させる場合に役立ちます。例えば、
ru: Любые переменные, которые не найдены в списке аргументов, наследуются из окружающей области. Анонимные функции полезны для создания простых безымянных функций из выражений или для обертывания вызовов других функций, чтобы адаптировать их для использования такими функциями, как <code>quad</code> . Например,
zh_cn: 在参数列表中找不到的所有变量均从封闭范围继承。匿名函数可用于从表达式创建简单的未命名函数，或者用于包装对其他函数的调用，以使它们适合 <code>quad</code> 等函数使用。例如，

source: Any whitespace character in the template causes any number of whitespace characters in the input stream to be read and discarded. The whitespace characters that are matched need not be exactly the same whitespace characters that appear in the template string. For example, write &lsquo;
es: Cualquier car&aacute;cter de espacio en blanco en la plantilla hace que se lea y se descarte cualquier n&uacute;mero de caracteres de espacio en blanco en el flujo de entrada. Los caracteres de espacio en blanco que coinciden no necesitan ser exactamente los mismos caracteres de espacio en blanco que aparecen en la cadena de la plantilla. Por ejemplo, escriba '
ja: テンプレートに空白文字があると、入力ストリームの任意の数の空白文字が読み取られて破棄されます。一致する空白文字は、テンプレート文字列に現れる空白文字とまったく同じである必要はありません。たとえば、「
ru: Любой пробельный символ в шаблоне приводит к тому, что любое количество пробельных символов во входном потоке будет считано и отброшено. Соответствующие пробельные символы не обязательно должны быть точно такими же пробельными символами, которые появляются в строке шаблона. Например, напишите '
zh_cn: 模板中的任何空格字符都会导致读取和丢弃输入流中任意数量的空格字符。匹配的空格字符不必与模板字符串中出现的空格字符完全相同。例如，写&ldquo;

source: Any window elements outside the data array are replaced by <code>NaN</code>. For example, with a window of length 3, <code><var>y</var>(1) = <var>fcn</var> ([NaN, <var>x</var>(1:2)])</code>, and <code><var>y</var>(end) = <var>fcn</var> ([<var>x</var>(end-1:end), NaN])</code>. This option usually results in <var>y</var> having <code>NaN</code> values at the boundaries, although it is influenced by how <var>fcn</var> handles <code>NaN</code>, and also by the property <code>"nancond"</code>.
es: Cualquier elemento de ventana fuera de la matriz de datos se reemplaza por <code>NaN</code> . Por ejemplo, con una ventana de longitud 3, <code><var>y</var>(1) = <var>fcn</var> ([NaN, <var>x</var>(1:2)])</code> e <code><var>y</var>(end) = <var>fcn</var> ([<var>x</var>(end-1:end), NaN])</code> . Esta opci&oacute;n generalmente da como resultado que <var>y</var> tenga valores de <code>NaN</code> en los l&iacute;mites, aunque est&aacute; influenciado por c&oacute;mo <var>fcn</var> maneja <code>NaN</code> , y tambi&eacute;n por la propiedad <code>"nancond"</code> .
ja: データ配列外のウィンドウ要素はすべて <code>NaN</code> に置き換えられます。たとえば、ウィンドウの長さが3の場合、 <code><var>y</var>(1) = <var>fcn</var> ([NaN, <var>x</var>(1:2)])</code> と <code><var>y</var>(end) = <var>fcn</var> ([<var>x</var>(end-1:end), NaN])</code> 。このオプションは、通常、その結果 <var>y</var> 持つ <code>NaN</code> それがどのように影響を受けているが、境界での値を <var>fcn</var> ハンドル <code>NaN</code> 、また、プロパティで <code>"nancond"</code> 。
ru: Любые элементы окна за пределами массива данных заменяются <code>NaN</code> . Например, с окном длиной 3 <code><var>y</var>(1) = <var>fcn</var> ([NaN, <var>x</var>(1:2)])</code> и <code><var>y</var>(end) = <var>fcn</var> ([<var>x</var>(end-1:end), NaN])</code> . Эта опция обычно приводит к тому, что <var>y</var> имеет значения <code>NaN</code> на границах, хотя на это влияет то, как <var>fcn</var> обрабатывает <code>NaN</code> , а также свойство <code>"nancond"</code> .
zh_cn: 数据数组外部的所有窗口元素都将替换为 <code>NaN</code> 。例如，对于一个长度为3的窗口， <code><var>y</var>(1) = <var>fcn</var> ([NaN, <var>x</var>(1:2)])</code> 和 <code><var>y</var>(end) = <var>fcn</var> ([<var>x</var>(end-1:end), NaN])</code> 。该选项通常会导致 <var>y</var> 在边界处具有 <code>NaN</code> 值，尽管它受 <var>fcn</var> 处理 <code>NaN</code> 的方式以及属性 <code>"nancond"</code> 。

source: Any window elements outside the data array are replaced by <code>NaN</code>. For example, with a window of length 3, <code><var>y</var>(1) = mad ([NaN, <var>x</var>(1:2)])</code>, and <code><var>y</var>(end) = mad ([<var>x</var>(end-1:end), NaN])</code>. This option usually results in <var>y</var> having <code>NaN</code> values at the boundaries, although it is influenced by how <code>mad</code> handles <code>NaN</code>, and also by the property <code>"nancond"</code>.
es: Cualquier elemento de ventana fuera de la matriz de datos se reemplaza por <code>NaN</code> . Por ejemplo, con una ventana de longitud 3, <code><var>y</var>(1) = mad ([NaN, <var>x</var>(1:2)])</code> e <code><var>y</var>(end) = mad ([<var>x</var>(end-1:end), NaN])</code> . Esta opci&oacute;n generalmente da como resultado que <var>y</var> tenga valores de <code>NaN</code> en los l&iacute;mites, aunque est&aacute; influenciado por la forma en que <code>mad</code> maneja <code>NaN</code> y tambi&eacute;n por la propiedad <code>"nancond"</code> .
ja: データ配列外のウィンドウ要素はすべて <code>NaN</code> に置き換えられます。たとえば、長さが3のウィンドウの場合、 <code><var>y</var>(1) = mad ([NaN, <var>x</var>(1:2)])</code> と <code><var>y</var>(end) = mad ([<var>x</var>(end-1:end), NaN])</code> 。このオプションは通常、境界に <code>NaN</code> 値を持つ <var>y</var> になりますが、 <code>mad</code> が <code>NaN</code> を処理する方法、およびプロパティ <code>"nancond"</code> にも影響されます。
ru: Любые элементы окна за пределами массива данных заменяются <code>NaN</code> . Например, с окном длиной 3 <code><var>y</var>(1) = mad ([NaN, <var>x</var>(1:2)])</code> и <code><var>y</var>(end) = mad ([<var>x</var>(end-1:end), NaN])</code> . Эта опция обычно приводит к тому, что <var>y</var> имеет значения <code>NaN</code> на границах, хотя на это влияет то, как <code>mad</code> обрабатывает <code>NaN</code> , а также свойство <code>"nancond"</code> .
zh_cn: 数据数组外部的所有窗口元素都将替换为 <code>NaN</code> 。例如，对于一个长度为3的窗口， <code><var>y</var>(1) = mad ([NaN, <var>x</var>(1:2)])</code> 和 <code><var>y</var>(end) = mad ([<var>x</var>(end-1:end), NaN])</code> 。此选项通常会导致 <var>y</var> 在边界处具有 <code>NaN</code> 值，尽管它受 <code>mad</code> 处理 <code>NaN</code> 的方式以及属性 <code>"nancond"</code> 。
