Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/octave/octave.*.011.xlf
Languages: es, ja, ru, zh_cn

source: By default, Octave&rsquo;s image IO functions (<code>imread</code>, <code>imwrite</code>, and <code>imfinfo</code>) use the <code>GraphicsMagick</code> library for their operations. This means a vast number of image formats is supported but considering the large amount of image formats in science and its commonly closed nature, it is impossible to have a library capable of reading them all. Because of this, the function <code>imformats</code> keeps a configurable list of available formats, their extensions, and what functions should the image IO functions use. This allows one to expand Octave&rsquo;s image IO capabilities by creating functions aimed at acting on specific file formats.
es: De forma predeterminada, las funciones de E / S de imagen de Octave ( <code>imread</code> , <code>imwrite</code> e <code>imfinfo</code> ) utilizan la biblioteca <code>GraphicsMagick</code> para sus operaciones. Esto significa que se admite una gran cantidad de formatos de imagen, pero considerando la gran cantidad de formatos de imagen en la ciencia y su naturaleza com&uacute;nmente cerrada, es imposible tener una biblioteca capaz de leerlos todos. Debido a esto, la funci&oacute;n <code>imformats</code> mantiene una lista configurable de formatos disponibles, sus extensiones y qu&eacute; funciones deben usar las funciones de E / S de imagen. Esto le permite expandir las capacidades de E / S de imagen de Octave mediante la creaci&oacute;n de funciones destinadas a actuar en formatos de archivo espec&iacute;ficos.
ja: デフォルトでは、OctaveのイメージIO関数（ <code>imread</code> 、 <code>imwrite</code> 、および <code>imfinfo</code> ）は、操作に <code>GraphicsMagick</code> ライブラリを使用します。これは、膨大な数の画像フォーマットがサポートされていることを意味しますが、科学における大量の画像フォーマットとその一般的な閉鎖性を考慮すると、それらすべてを読み取ることができるライブラリーを持つことは不可能です。このため、関数 <code>imformats</code> は、使用可能な形式、それらの拡張子、およびイメージIO関数が使用する必要がある関数の構成可能なリストを保持します。これにより、特定のファイル形式で動作することを目的とした関数を作成することにより、OctaveのイメージIO機能を拡張できます。
ru: По умолчанию функции ввода-вывода изображений Octave ( <code>imread</code> , <code>imwrite</code> и <code>imfinfo</code> ) используют библиотеку <code>GraphicsMagick</code> для своих операций. Это означает, что поддерживается огромное количество форматов изображений, но, учитывая большое количество форматов изображений в науке и их обычно закрытый характер, невозможно иметь библиотеку, способную читать их все. По этой <code>imformats</code> функция imformats хранит настраиваемый список доступных форматов, их расширений и функций, которые должны использовать функции ввода-вывода изображений. Это позволяет расширить возможности ввода-вывода изображений Octave, создав функции, предназначенные для работы с определенными форматами файлов.
zh_cn: 默认情况下，Octave的图像IO函数（ <code>imread</code> ， <code>imwrite</code> 和 <code>imfinfo</code> ）使用 <code>GraphicsMagick</code> 库进行操作。这意味着支持大量图像格式，但是考虑到科学中的大量图像格式及其通常封闭的性质，不可能拥有能够读取所有图像格式的库。正因为如此，该功能 <code>imformats</code> 保持可用的格式，其扩展和功能应该像IO功能，使用什么的可配置列表。通过创建针对特定文件格式的功能，这可以扩展Octave的图像IO功能。

source: By default, PDF inherits the same limitations as PostScript. For an enhanced output with complete text support and basic transparency, use the
ja: デフォルトでは、PDF は PostScript と同じ制限を継承します。完全なテキストサポートと基本的な透過性を備えた強化された出力には
zh_cn: 默认情况下,PDF继承了与PostScript相同的限制。要获得具有完整文本支持和基本透明度的增强输出,请使用

source: By default, all contours are labeled. However, the contours to label can be specified by the vector <var>v</var>. If the <code>"manual"</code> argument is given then the contours to label can be selected with the mouse.
es: De forma predeterminada, todos los contornos est&aacute;n etiquetados. Sin embargo, los contornos a etiquetar se pueden especificar mediante el vector <var>v</var> . Si se proporciona el argumento <code>"manual"</code> , los contornos a etiquetar se pueden seleccionar con el mouse.
ja: デフォルトでは、すべての等高線にラベルが付けられます。ただし、ラベルを付ける等高線は、ベクトル <var>v</var> で指定できます。場合は <code>"manual"</code> 引数が指定されたラベルの輪郭をマウスで選択することができます。
ru: По умолчанию помечены все контуры. Однако контуры для маркировки могут быть заданы вектором <var>v</var> . Если указан аргумент <code>"manual"</code> то контуры для надписи можно выбрать с помощью мыши.
zh_cn: 默认情况下，所有轮廓都被标记。但是，可以通过向量 <var>v</var> 指定要标记的轮廓。如果给出了 <code>"manual"</code> 参数，则可以用鼠标选择要标记的轮廓。

source: By default, configure looks for the best <small>BLAS</small> matrix libraries on your system, including optimized implementations such as the free ATLAS 3.0, as well as vendor-tuned libraries. (The use of an optimized <small>BLAS</small> will generally result in several-times faster matrix operations.) Use this option to specify a particular <small>BLAS</small> library that Octave should use.
es: De forma predeterminada, configure busca las mejores bibliotecas de matrices <small>BLAS</small> en su sistema, incluidas implementaciones optimizadas como ATLAS 3.0 gratuito, as&iacute; como bibliotecas ajustadas por el proveedor. (El uso de un <small>BLAS</small> optimizado generalmente resultar&aacute; en operaciones matriciales varias veces m&aacute;s r&aacute;pidas). Use esta opci&oacute;n para especificar una biblioteca <small>BLAS</small> particular que Octave deber&iacute;a usar.
ja: デフォルトでは、configureは、無料のATLAS 3.0などの最適化された実装やベンダー調整ライブラリを含む、システムで最高の<small>BLAS</small>マトリックスライブラリを探します。（通常、最適化された<small>BLAS</small>を使用すると、行列演算が数倍高速になります。）このオプションを使用して、Octaveが使用する特定の<small>BLAS</small>ライブラリを指定します。
ru: По умолчанию configure ищет лучшие библиотеки матриц <small>BLAS</small> в вашей системе, включая оптимизированные реализации, такие как бесплатный ATLAS 3.0, а также библиотеки, настроенные производителем. (Использование оптимизированного <small>BLAS</small> обычно приводит к ускорению матричных операций в несколько раз.) Используйте эту опцию, чтобы указать конкретную библиотеку <small>BLAS,</small> которую следует использовать Octave.
zh_cn: 默认情况下，configure 在系统上寻找最佳的<small>BLAS</small>矩阵库，包括优化的实现，例如免费的ATLAS 3.0，以及供应商调整的库。（使用优化的<small>BLAS</small>通常会导致矩阵运算快几倍。）使用此选项可以指定Octave应该使用的特定<small>BLAS</small>库。

source: By default, configure looks for the best <small>LAPACK</small> matrix libraries on your system, including optimized implementations such as the free ATLAS 3.0, as well as vendor-tuned libraries. (The use of an optimized <small>LAPACK</small> will generally result in several-times faster matrix operations.) Use this option to specify a particular <small>LAPACK</small> library that Octave should use.
es: De forma predeterminada, configure busca las mejores bibliotecas de matriz <small>LAPACK</small> en su sistema, incluidas implementaciones optimizadas como ATLAS 3.0 gratuito, as&iacute; como bibliotecas ajustadas por el proveedor. (El uso de un <small>LAPACK</small> optimizado generalmente resultar&aacute; en operaciones matriciales varias veces m&aacute;s r&aacute;pidas). Use esta opci&oacute;n para especificar una biblioteca <small>LAPACK</small> particular que Octave deber&iacute;a usar.
ja: デフォルトでは、configureは、無料のATLAS 3.0などの最適化された実装やベンダーが調整したライブラリなど、システム上で最適な<small>LAPACK</small>マトリックスライブラリを探します。（最適化された<small>LAPACK</small>を使用すると、通常、行列演算が数倍高速になります。）このオプションを使用して、Octaveが使用する特定の<small>LAPACK</small>ライブラリーを指定します。
ru: По умолчанию configure ищет лучшие библиотеки матриц <small>LAPACK</small> в вашей системе, включая оптимизированные реализации, такие как бесплатный ATLAS 3.0, а также библиотеки, настроенные производителем. (Использование оптимизированного <small>LAPACK</small> обычно приводит к ускорению матричных операций в несколько раз.) Используйте эту опцию, чтобы указать конкретную библиотеку <small>LAPACK,</small> которую следует использовать Octave.
zh_cn: 默认情况下，configure 在系统上寻找最佳的<small>LAPACK</small>矩阵库，包括优化的实现，例如免费的ATLAS 3.0，以及供应商调整的库。（使用优化的<small>LAPACK</small>通常会导致矩阵运算快几倍。）使用此选项可以指定Octave应该使用的特定<small>LAPACK</small>库。

source: By default, dimensions of the empty matrix are printed along with the empty matrix symbol, &lsquo;
es: Por defecto, las dimensiones de la matriz vac&iacute;a se imprimen junto con el s&iacute;mbolo de matriz vac&iacute;a, '
ja: デフォルトでは、空行列の次元は、空行列記号 'とともに印刷されます。
ru: По умолчанию размеры пустой матрицы печатаются вместе с символом пустой матрицы, '
zh_cn: 默认情况下，空白矩阵的尺寸与空白矩阵符号'

source: By default, high level plotting functions such as <code>plot</code> reset and redefine axes properties independently from the defaults. An example of such property is the axes <code>box</code> property: it is set <code>on</code> by high level 2-D graphics functions regardless of the property <code>"defaultaxesbox"</code>. Use the <code>hold</code> function to prevent this behavior:
es: De forma predeterminada, las funciones de trazado de alto nivel, como el restablecimiento del <code>plot</code> y la redefinici&oacute;n de las propiedades de los ejes, independientemente de los valores predeterminados. Un ejemplo de dichos bienes son ejes <code>box</code> la propiedad: se establece <code>on</code> por funciones de gr&aacute;ficos 2-D de alto nivel, independientemente de la propiedad <code>"defaultaxesbox"</code> . Utilice la funci&oacute;n de <code>hold</code> para evitar este comportamiento:
ja: 既定では、 <code>plot</code> などの高レベルのプロット関数は、デフォルトとは独立して軸のプロパティをリセットおよび再定義します。そのようなプロパティの例は、Axes <code>box</code> プロパティです。これは、プロパティ <code>"defaultaxesbox"</code> に関係なく、高レベルの2次元グラフィックス関数によって設定 <code>on</code> れます。この動作を防ぐには、 <code>hold</code> 機能を使用します。
ru: По умолчанию высокоуровневые функции построения графиков, такие как сброс <code>plot</code> и переопределение свойств осей, независимо от значений по умолчанию. Пример такого свойства является ось <code>box</code> свойства: оно установлено <code>on</code> высоком уровень 2-D графических функций независимо от собственности <code>"defaultaxesbox"</code> . Используйте функцию <code>hold</code> чтобы предотвратить такое поведение:
zh_cn: 默认情况下，高级绘图功能（例如， <code>plot</code> 重置和重新定义轴属性）独立于默认设置。这样的属性的一个例子是轴 <code>box</code> 属性：它被设置 <code>on</code> 由高电平2- d图形函数不论属性的 <code>"defaultaxesbox"</code> 。使用 <code>hold</code> 功能可防止此行为：

source: By default, if there is only one input argument, <var>format</var> is
es: De forma predeterminada, si solo hay un argumento de entrada, el <var>format</var> o es
ja: デフォルトでは、入力引数が1つしかない場合、 <var>format</var> は
ru: По умолчанию, если есть только один входной аргумент, <var>format</var> является
zh_cn: 默认情况下，如果只有一个输入参数，则 <var>format</var> 为

source: By default, in the example <var>prop4</var>, properties are not constant and have public read and write access.
es: De forma predeterminada, en el ejemplo <var>prop4</var> , las propiedades no son constantes y tienen acceso p&uacute;blico de lectura y escritura.
ja: デフォルトでは、例の <var>prop4</var> では、プロパティは一定ではなく、パブリックの読み取りおよび書き込みアクセス権を持っています。
ru: По умолчанию в примере <var>prop4</var> свойства не являются постоянными и имеют общедоступный доступ для чтения и записи.
zh_cn: 默认情况下，在示例 <var>prop4</var> 中，属性不是恒定的，并且具有公共读写访问权限。

source: By default, integers are read as 32-bit quantities. With the &lsquo;
es: De forma predeterminada, los enteros se leen como cantidades de 32 bits. Con el '
ja: デフォルトでは、整数は32ビット量として読み取られます。とともに '
ru: По умолчанию целые числа читаются как 32-битные величины. С '
zh_cn: 默认情况下，整数读取为32位量。与&ldquo;

source: By default, only variables visible in the local scope are displayed.
es: Por defecto,sólo se muestran las variables visibles en el ámbito local.
ja: デフォルトでは、ローカルスコープで表示される変数のみが表示されます。
ru: По умолчанию отображаются только переменные,видимые в локальной области видимости.
zh_cn: 默认情况下,只显示本地作用域中可见的变量。

source: By default, recognized file types are
es: Por defecto,los tipos de archivo reconocidos son
ja: デフォルトでは、認識されるファイルタイプは
ru: По умолчанию,распознанные типы файлов
zh_cn: 默认情况下,识别的文件类型是

source: By default, return an empty string if the <var>n</var>-th argument is not a valid variable name. If the optional argument <var>ids_only</var> is false, return the text of the argument even if it is not a valid variable name.
es: De forma predeterminada, devuelve una cadena vac&iacute;a si el <var>n</var> -&eacute;simo argumento no es un nombre de variable v&aacute;lido. Si el argumento opcional <var>ids_only</var> es falso, devuelve el texto del argumento incluso si no es un nombre de variable v&aacute;lido.
ja: デフォルトでは、 <var>n</var> 番目の引数が有効な変数名でない場合は空の文字列を返します。オプションの引数 <var>ids_only</var> がfalseの場合、有効な変数名でなくても、引数のテキストを返します。
ru: По умолчанию возвращается пустая строка, если <var>n</var> -й аргумент не является допустимым именем переменной. Если необязательный аргумент <var>ids_only</var> имеет значение false, вернуть текст аргумента, даже если это неверное имя переменной.
zh_cn: 默认情况下，如果第 <var>n</var> 个参数不是有效的变量名，则返回一个空字符串。如果可选参数 <var>ids_only</var> 为false，则返回参数文本，即使该参数不是有效的变量名也是如此。

source: By default, the <code>"closerequestfcn"</code> property of a new plot figure points to this function.
es: De forma predeterminada, la propiedad <code>"closerequestfcn"</code> de una nueva figura de gr&aacute;fico apunta a esta funci&oacute;n.
ja: デフォルトでは、新しいプロット図の <code>"closerequestfcn"</code> プロパティはこの関数を指します。
ru: По умолчанию свойство <code>"closerequestfcn"</code> новой фигуры графика указывает на эту функцию.
zh_cn: 默认情况下，新图的 <code>"closerequestfcn"</code> 属性指向此函数。

source: By default, the <code>Octave:abbreviated-property-match</code> warning is enabled.
es: De forma predeterminada, la advertencia <code>Octave:abbreviated-property-match</code> est&aacute; habilitada.
ja: デフォルトでは、 <code>Octave:abbreviated-property-match</code> 警告が有効になっています。
ru: По умолчанию предупреждение <code>Octave:abbreviated-property-match</code> включено.
zh_cn: 默认情况下，启用&ldquo; <code>Octave:abbreviated-property-match</code> 警告。

source: By default, the <code>Octave:assign-as-truth-value</code> warning is enabled.
es: De forma predeterminada, la advertencia <code>Octave:assign-as-truth-value</code> est&aacute; habilitada.
ja: デフォルトでは、 <code>Octave:assign-as-truth-value</code> 警告が有効になっています。
ru: По умолчанию предупреждение <code>Octave:assign-as-truth-value</code> включено.
zh_cn: 默认情况下，启用&ldquo; <code>Octave:assign-as-truth-value</code> &rdquo;警告。

source: By default, the <code>Octave:built-in-variable-assignment</code> warning is enabled.
es: De forma predeterminada, la advertencia <code>Octave:built-in-variable-assignment</code> est&aacute; habilitada.
ja: デフォルトでは、 <code>Octave:built-in-variable-assignment</code> 警告が有効になっています。
ru: По умолчанию включено предупреждение <code>Octave:built-in-variable-assignment</code> .
zh_cn: 默认情况下，启用 <code>Octave:built-in-variable-assignment</code> 警告。

source: By default, the <code>Octave:glyph-render</code> warning is enabled.
es: De forma predeterminada, la advertencia <code>Octave:glyph-render</code> est&aacute; habilitada.
ja: デフォルトでは、 <code>Octave:glyph-render</code> 警告は有効になっています。
ru: По умолчанию включено предупреждение <code>Octave:glyph-render</code> .
zh_cn: 默认情况下，启用 <code>Octave:glyph-render</code> 警告。

source: By default, the <code>Octave:logical-conversion</code> warning is enabled.
es: De forma predeterminada, la advertencia <code>Octave:logical-conversion</code> est&aacute; habilitada.
ja: デフォルトでは、 <code>Octave:logical-conversion</code> 警告は有効になっています。
ru: По умолчанию включено предупреждение <code>Octave:logical-conversion</code> .
zh_cn: 默认情况下，启用 <code>Octave:logical-conversion</code> 警告。

source: By default, the <code>Octave:missing-glyph</code> warning is enabled.
es: De forma predeterminada, la advertencia <code>Octave:missing-glyph</code> est&aacute; habilitada.
ja: デフォルトでは、 <code>Octave:missing-glyph</code> 警告は有効になっています。
ru: По умолчанию предупреждение <code>Octave:missing-glyph</code> включено.
zh_cn: 默认情况下，启用 <code>Octave:missing-glyph</code> 警告。

source: By default, the <code>Octave:neg-dim-as-zero</code> warning is disabled.
es: De forma predeterminada, la advertencia <code>Octave:neg-dim-as-zero</code> est&aacute; desactivada.
ja: デフォルトでは、 <code>Octave:neg-dim-as-zero</code> 警告は無効になっています。
ru: По умолчанию предупреждение <code>Octave:neg-dim-as-zero</code> отключено.
zh_cn: 默认情况下，禁用 <code>Octave:neg-dim-as-zero</code> 警告。

source: By default, the <code>Octave:nested-functions-coerced</code> warning is enabled.
es: De forma predeterminada, la advertencia <code>Octave:nested-functions-coerced</code> est&aacute; habilitada.
ja: デフォルトでは、 <code>Octave:nested-functions-coerced</code> 警告が有効になっています。
ru: По умолчанию предупреждение <code>Octave:nested-functions-coerced</code> включено.
zh_cn: 默认情况下，启用 <code>Octave:nested-functions-coerced</code> 警告。

source: By default, the <code>Octave:noninteger-range-as-index</code> warning is enabled.
es: De forma predeterminada, la advertencia <code>Octave:noninteger-range-as-index</code> est&aacute; habilitada.
ja: デフォルトでは、 <code>Octave:noninteger-range-as-index</code> 警告が有効になっています。
ru: По умолчанию предупреждение <code>Octave:noninteger-range-as-index</code> включено.
zh_cn: 默认情况下，启用 <code>Octave:noninteger-range-as-index</code> 警告。

source: By default, the <code>Octave:recursive-path-search</code> warning is enabled.
es: De forma predeterminada, la advertencia <code>Octave:recursive-path-search</code> est&aacute; habilitada.
ja: デフォルトでは、 <code>Octave:recursive-path-search</code> 警告は有効になっています。
ru: По умолчанию предупреждение <code>Octave:recursive-path-search</code> включено.
zh_cn: 默认情况下，启用 <code>Octave:recursive-path-search</code> 警告。

source: By default, the <code>Octave:shadowed-function</code> warning is enabled.
es: De forma predeterminada, la advertencia <code>Octave:shadowed-function</code> est&aacute; habilitada.
ja: デフォルトでは、 <code>Octave:shadowed-function</code> 警告が有効になっています。
ru: По умолчанию предупреждение <code>Octave:shadowed-function</code> включено.
zh_cn: 默认情况下，启用 <code>Octave:shadowed-function</code> 警告。

source: By default, the <code>Octave:sqrtm:SingularMatrix</code> warning is enabled.
es: De forma predeterminada, la advertencia <code>Octave:sqrtm:SingularMatrix</code> est&aacute; habilitada.
ja: デフォルトでは、 <code>Octave:sqrtm:SingularMatrix</code> 警告は有効になっています。
ru: По умолчанию предупреждение <code>Octave:sqrtm:SingularMatrix</code> включено.
zh_cn: 默认情况下，启用 <code>Octave:sqrtm:SingularMatrix</code> 警告。

source: By default, the camera is oriented so that &ldquo;up&rdquo; corresponds to the positive z-axis:
es: De forma predeterminada, la c&aacute;mara est&aacute; orientada de modo que "arriba" corresponda al eje z positivo:
ja: デフォルトでは、カメラは「上」が正のz軸に対応するように向けられています。
ru: По умолчанию камера ориентирована так, что &laquo;вверх&raquo; соответствует положительной оси z:
zh_cn: 默认情况下，摄影机的方向是&ldquo;上&rdquo;对应于z轴正方向：

source: By default, the generator is initialized from <code>/dev/urandom</code> if it is available, otherwise from CPU time, wall clock time, and the current fraction of a second. Note that this differs from <small>MATLAB</small>, which always initializes the state to the same state at startup. To obtain behavior comparable to <small>MATLAB</small>, initialize with a deterministic state vector in Octave&rsquo;s startup files (see <a href="startup-files#Startup-Files">Startup Files</a>).
es: De forma predeterminada, el generador se inicializa desde <code>/dev/urandom</code> si est&aacute; disponible; de ​​lo contrario, desde el tiempo de la CPU, el tiempo del reloj de pared y la fracci&oacute;n de segundo actual. Tenga en cuenta que esto difiere de <small>MATLAB</small> , que siempre inicializa el estado al mismo estado al inicio. Para obtener un comportamiento comparable con <small>MATLAB</small> , inicialice con un vector de estado determinista en los archivos de inicio de Octave (consulte <a href="startup-files#Startup-Files">Archivos de inicio</a> ).
ja: デフォルトでは、ジェネレーターは <code>/dev/urandom</code> （使用可能な場合）から初期化されます。それ以外の場合は、CPU時間、実時間、および現在の秒の小数部分から初期化されます。これは、起動時に常に状態を同じ状態に初期化する<small>MATLAB</small>とは異なることに注意してください。<small>MATLAB</small>と同等の動作を得るには、Octaveのスタートアップファイルで確定的な状態ベクトルで初期化します（「<a href="startup-files#Startup-Files">スタートアップファイル」を</a>参照）。
ru: По умолчанию генератор инициализируется из <code>/dev/urandom</code> , если он доступен, в противном случае из процессорного времени, времени настенных часов и текущей доли секунды. Обратите внимание, что это отличается от <small>MATLAB</small> , который всегда инициализирует состояние одним и тем же состоянием при запуске. Чтобы получить поведение, сопоставимое с <small>MATLAB</small> , инициализируйте детерминированным вектором состояния в файлах запуска Octave (см. <a href="startup-files#Startup-Files">Файлы запуска</a> ).
zh_cn: 默认情况下，如果可用，则从 <code>/dev/urandom</code> 初始化生成器，否则从CPU时间，挂钟时间和当前秒数初始化。请注意，这不同于<small>MATLAB</small>，后者始终在启动时将状态初始化为相同状态。要获得可与<small>MATLAB</small>媲美的行为，请在Octave的启动文件（请参阅<a href="startup-files#Startup-Files">启动文件</a>）中使用确定性状态向量进行初始化。

source: By default, the input array is interpreted as a hexadecimal number representing a double precision value. If fewer than 16 characters are given the strings are right padded with <code>'0'</code> characters.
es: De forma predeterminada, la matriz de entrada se interpreta como un n&uacute;mero hexadecimal que representa un valor de precisi&oacute;n doble. Si se dan menos de 16 caracteres, las cadenas se rellenan a la derecha con caracteres <code>'0'</code> .
ja: デフォルトでは、入力配列は倍精度値を表す16進数として解釈されます。16文字未満が指定された場合、文字列は <code>'0'</code> 文字で右側が埋め込まれます。
ru: По умолчанию входной массив интерпретируется как шестнадцатеричное число, представляющее значение двойной точности. Если указано менее 16 символов, строки заполняются справа символами <code>'0'</code> .
zh_cn: 默认情况下，输入数组被解释为代表双精度值的十六进制数。如果给出的字符数少于16个，则将字符串用 <code>'0'</code> 字符正确填充。

source: By default, the option
ja: デフォルトでは
zh_cn: 默认情况下,选项

source: By default, these commands affect the current axis; alternatively, an axis can be specified by the optional argument <var>ax</var>.
es: Por defecto, estos comandos afectan al eje actual; alternativamente, un eje se puede especificar mediante el argumento opcional <var>ax</var> .
ja: デフォルトでは、これらのコマンドは現在の軸に影響します。または、オプションの引数 <var>ax</var> で軸を指定することもできます。
ru: По умолчанию эти команды влияют на текущую ось; в качестве альтернативы ось может быть указана необязательным аргументом <var>ax</var> .
zh_cn: 默认情况下，这些命令会影响当前轴。或者，可以通过可选参数 <var>ax</var> 指定轴。

source: By default, this command affects the current axis; alternatively, an axis can be specified by the optional argument <var>hax</var>.
es: De forma predeterminada, este comando afecta al eje actual; alternativamente, un eje se puede especificar mediante el argumento opcional <var>hax</var> .
ja: デフォルトでは、このコマンドは現在の軸に影響します。または、オプションの引数 <var>hax</var> で軸を指定することもできます。
ru: По умолчанию эта команда влияет на текущую ось; в качестве альтернативы ось может быть указана необязательным аргументом <var>hax</var> .
zh_cn: 默认情况下，此命令影响当前轴；否则，该命令将影响当前轴。或者，可以通过可选参数 <var>hax</var> 指定轴。

source: C = bitset (A, n)
es: C=conjunto de bits (A,n)
ja: C=ビットセット(A,n
ru: C=битсет (A,n)
zh_cn: C=位组(A,n)

source: C = bitset (A, n, val)
ja: C=ビットセット (A,n,val)
ru: C=битсет (A,n,val)
zh_cn: C=位组(A,n,val)

source: C = convn (A, B, shape)
es: C=convn (A,B,forma)
ja: C=convn(A,B,形状
ru: C=convn (A,B,форма)

source: C = textscan (fid, format)
es: C=textscan (fid,formato)
ja: C=テキストスキャン (fid、フォーマット)
ru: C=текстовый сканер (fid,формат)
zh_cn: C=textcan (fid,format)

source: C = textscan (fid, format, repeat)
es: C=textscan (fid,formato,repetición)
ja: C=テキストスキャン (fid、フォーマット、リピート)
ru: C=текстовый сканер (fid,формат,повтор)
zh_cn: C=文本扫描 (fid,format,repeat)

source: C = who ("pattern", &hellip;)
es: C = qui&eacute;n ("patr&oacute;n",&hellip;)
ja: C =だれ（ "パターン"、&hellip;）
ru: C = who ("шаблон",&hellip;)
zh_cn: C =谁（&ldquo;模式&rdquo;，&hellip;）

source: C++, C, and Fortran compilers
es: Compiladores de C++,C y Fortran
ja: C++、C、Fortran コンパイラ
ru: Компиляторы C++,C и Fortran
zh_cn: C++、C和Fortran编译器

source: C-Style I/O Functions
es: Funciones de E/S de estilo C
ja: C-スタイルI/O機能
ru: Функции ввода/вывода в стиле C
zh_cn: C型I/O功能

source: C.T. Kelley,
ja: C.T.ケリー
ru: Си-Ти Келли,

source: B = rescale (A, l, u)
zh_cn: B=重新标定 (A,l,u)
