Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/octave/octave.*.011.xlf
Languages: es, ja, ru, zh_cn

source: After defining the function API with these methods, the supplied arguments can be parsed with the <code>parse</code> method and the parsing results accessed with the <code>Results</code> accessor.
es: Despu&eacute;s de definir la API de la funci&oacute;n con estos m&eacute;todos, los argumentos proporcionados se pueden analizar con el m&eacute;todo de <code>parse</code> y se puede acceder a los <code>Results</code> del an&aacute;lisis con el descriptor de acceso de Resultados .
ja: これらのメソッドで関数APIを定義した後、指定された引数を <code>parse</code> メソッドで解析し、 <code>Results</code> アクセサーを使用して結果を解析できます。
ru: После определения функции API с этими методами, переданные аргументы могут быть проанализированы с помощью <code>parse</code> метода и результатов синтаксического анализа доступен с <code>Results</code> аксессор.
zh_cn: 使用这些方法定义函数API之后，可以使用 <code>parse</code> 方法解析提供的参数，并使用 <code>Results</code> 访问器访问解析结果。

source: After importing, the data may need to be transformed before further analysis. The <code>rescale</code> function can shift and normalize a data set to a specified range.
ja: インポート後、さらに分析する前にデータを変換する必要がある場合があります。 <code>rescale</code> 関数は、指定された範囲へのデータセットをシフトし、正規化することができます。
zh_cn: 导入后，可能需要对数据进行转换，然后再进行进一步分析。在 <code>rescale</code> 功能可以转移和标准化的数据集，以在指定的范围。

source: After the <var>x</var> and <var>y</var> arguments there can be 1, 2, or 4 parameters specifying the error values depending on the nature of the error values and the plot format <var>fmt</var>.
es: Despu&eacute;s de las <var>x</var> y <var>y</var> argumentos no puede ser 1, 2, o 4 par&aacute;metros que especifican los valores de error en funci&oacute;n de la naturaleza de los valores de error y el formato de trama <var>fmt</var> .
ja: <var>x</var> 引数と <var>y</var> 引数の後には、エラー値の性質とプロット形式 <var>fmt</var> に応じて、エラー値を指定する1、2、または4つのパラメーターがあります。
ru: После аргументов <var>x</var> и <var>y</var> могут быть 1, 2 или 4 параметра, определяющие значения ошибок в зависимости от природы значений ошибок и формата графика <var>fmt</var> .
zh_cn: 在 <var>x</var> 和 <var>y</var> 参数之后，可以有1个，2个或4个参数来指定错误值，具体取决于错误值的性质和绘图格式 <var>fmt</var> 。

source: After the summary there may be documentation on the inputs and outputs, examples of function usage, notes about the algorithm used, and references to related functions.
es: Después del resumen puede haber documentación sobre las entradas y salidas,ejemplos de uso de funciones,notas sobre el algoritmo utilizado y referencias a funciones relacionadas.
ja: 概要の後には、入力と出力に関する文書、関数の使用例、使用されているアルゴリズムに関する注意事項、関連する関数への参照があるかもしれません。
ru: После резюме может быть представлена документация по входам и выходам,примеры использования функций,заметки об используемом алгоритме,а также ссылки на смежные функции.
zh_cn: 在摘要之后,可能会有关于输入和输出的文档,函数使用的例子,关于使用的算法的说明,以及相关函数的参考。

source: After this expression is executed, the variable <code>z</code> has the value 1. Whatever old value <code>z</code> had before the assignment is forgotten. The &lsquo;
es: Despu&eacute;s de ejecutar esta expresi&oacute;n, la variable <code>z</code> tiene el valor 1. Cualquiera que sea vieja valor <code>z</code> ten&iacute;a antes de que se olvida la tarea. Los '
ja: この式が実行されると、変数 <code>z</code> の値は1になります。割り当て前の古い値 <code>z</code> の値はすべて忘れられます。「
ru: После выполнения этого выражения переменная <code>z</code> принимает значение 1. Любое старое значение <code>z</code> ,которое было до присвоения, забывается. '
zh_cn: 执行该表达式后，变量 <code>z</code> 的值为1。无论赋值之前忘记了 <code>z</code> 的旧值是多少。'

source: After this it is possible to evaluate <em>f</em> at any <em>x</em> by writing <code>f(x)</code>.
es: Despu&eacute;s de esto, es posible evaluar <em>f</em> en cualquier <em>x</em> escribiendo <code>f(x)</code> .
ja: この後、 <code>f(x)</code> を記述することにより、任意の<em>xで</em><em>f</em>を評価できます。<em></em>
ru: После этого можно вычислить <em>f</em> для любого <em>x</em> , написав <code>f(x)</code> .
zh_cn: 在此之后，可以评估<em>˚F</em>在任何<em>X</em>写 <code>f(x)</code> 。

source: After this the directory &lsquo;
es: Despu&eacute;s de esto, el directorio '
ja: この後、ディレクトリ '
ru: После этого каталог '
zh_cn: 在此目录之后

source: Algebraic eigenvalue balancing uses standard <small>LAPACK</small> routines.
es: El equilibrio de valores propios algebraicos utiliza rutinas <small>LAPACK</small> est&aacute;ndar .
ja: 代数固有値バランシングは、標準の<small>LAPACK</small>ルーチンを使用します。
ru: Алгебраическая балансировка собственных значений использует стандартные процедуры <small>LAPACK</small> .
zh_cn: 代数特征值平衡使用标准的<small>LAPACK</small>例程。

source: Algorithm Note: <code>condest</code> uses a randomized algorithm to approximate the 1-norms. Therefore, if consistent results are required, the <code>"state"</code> of the random generator should be fixed before invoking <code>condest</code>.
es: Nota de algoritmo: <code>condest</code> utiliza un algoritmo aleatorio para aproximar las normas 1. Por lo tanto, si se requieren resultados consistentes, el <code>"state"</code> del generador aleatorio debe fijarse antes de invocar <code>condest</code> .
ja: アルゴリズム注： <code>condest</code> は、ランダム化アルゴリズムを使用して1ノルムを近似します。したがって、一貫した結果が必要な場合は、ランダムジェネレーターの <code>"state"</code> を <code>condest</code> を呼び出す前に修正する必要があります。
ru: Примечание к алгоритму: <code>condest</code> использует рандомизированный алгоритм для аппроксимации 1-норм. Следовательно, если требуются согласованные результаты, <code>"state"</code> генератора случайных чисел должно быть зафиксировано перед <code>condest</code> .
zh_cn: 算法说明： <code>condest</code> 使用随机算法来近似1-范数。因此，如果需要一致的结果，则应在调用 <code>condest</code> 之前固定随机生成器的 <code>"state"</code> 。

source: Algorithm Note: <code>normest1</code> uses random numbers during evaluation. Therefore, if consistent results are required, the <code>"state"</code> of the random generator should be fixed before invoking <code>normest1</code>.
es: Nota de algoritmo: <code>normest1</code> utiliza n&uacute;meros aleatorios durante la evaluaci&oacute;n. Por lo tanto, si se requieren resultados consistentes, el <code>"state"</code> del generador aleatorio debe fijarse antes de invocar <code>normest1</code> .
ja: アルゴリズム注： <code>normest1</code> は、評価中に乱数を使用します。したがって、一貫した結果が必要な場合は、 <code>normest1</code> を呼び出す前に、ランダムジェネレーターの <code>"state"</code> を修正する必要があります。
ru: Примечание к алгоритму: <code>normest1</code> использует случайные числа во время оценки. Следовательно, если требуются согласованные результаты, <code>"state"</code> генератора случайных чисел должно быть зафиксировано перед <code>normest1</code> .
zh_cn: 算法说明： <code>normest1</code> 在评估期间使用随机数。因此，如果需要一致的结果，则应在调用 <code>normest1</code> 之前固定随机生成器的 <code>"state"</code> 。

source: Algorithm Notes: The <small>LAPACK</small> library provides two routines for calculating the full singular value decomposition (left and right singular matrices as well as singular values). When calculating just the singular values the following discussion is not relevant.
es: Notas de algoritmo: La biblioteca <small>LAPACK</small> proporciona dos rutinas para calcular la descomposici&oacute;n completa de valores singulares (matrices singulares izquierda y derecha, as&iacute; como valores singulares). Al calcular solo los valores singulares, la siguiente discusi&oacute;n no es relevante.
ja: アルゴリズムに関する注記：<small>LAPACK</small>ライブラリーは、完全な特異値分解（左および右の特異行列と特異値）を計算するための2つのルーチンを提供します。特異値のみを計算する場合、以下の説明は関係ありません。
ru: Примечания к алгоритму: библиотека <small>LAPACK</small> предоставляет две процедуры для вычисления полного разложения по сингулярным значениям (левая и правая сингулярные матрицы, а также сингулярные значения). При вычислении только сингулярных значений следующее обсуждение не актуально.
zh_cn: 算法说明：<small>LAPACK</small>库提供了两个例程，用于计算完整的奇异值分解（左右奇异矩阵以及奇异值）。仅计算奇异值时，以下讨论不相关。

source: Algorithm Notes: When calculating the full decomposition (left and right singular matrices in addition to singular values) there is a choice of two routines in <small>LAPACK</small>. The default routine used by Octave is <code>gesvd</code>. The alternative is <code>gesdd</code> which is 5X faster, but may use more memory and may be inaccurate for some input matrices. See the documentation for <code>svd_driver</code> for more information on choosing a driver.
es: Notas de algoritmo: Al calcular la descomposici&oacute;n completa (matrices singulares izquierda y derecha adem&aacute;s de valores singulares), hay una opci&oacute;n de dos rutinas en <small>LAPACK</small> . La rutina predeterminada utilizada por Octave es <code>gesvd</code> . La alternativa es <code>gesdd</code> , que es 5 veces m&aacute;s r&aacute;pido, pero puede usar m&aacute;s memoria y puede ser inexacto para algunas matrices de entrada. Consulte la documentaci&oacute;n de <code>svd_driver</code> para obtener m&aacute;s informaci&oacute;n sobre c&oacute;mo elegir un controlador.
ja: アルゴリズムに関する注意：完全な分解（特異値に加えて左右の特異行列）を計算する場合、<small>LAPACKでは</small> 2つのルーチンを選択できます。Octaveが使用するデフォルトのルーチンは <code>gesvd</code> です。代わりの方法は <code>gesdd</code> で5倍高速ですが、より多くのメモリを使用し、一部の入力行列では不正確になる場合があります。ドライバーの選択の詳細については、 <code>svd_driver</code> のドキュメントを参照してください。
ru: Примечания к алгоритму: При вычислении полной декомпозиции (левая и правая сингулярные матрицы в дополнение к сингулярным значениям) в <small>LAPACK</small> есть выбор из двух процедур . По умолчанию Octave использует процедуру <code>gesvd</code> . Альтернативой является <code>gesdd</code> , который в 5 раз быстрее, но может использовать больше памяти и может быть неточным для некоторых входных матриц. См. Документацию для <code>svd_driver</code> для получения дополнительной информации о выборе драйвера.
zh_cn: 算法注释：在计算完全分解时（除了奇异值之外，还有左和右奇异矩阵），可以在<small>LAPACK中</small>选择两个例程。Octave使用的默认例程是 <code>gesvd</code> 。替代方法是 <code>gesdd</code> ，它快5倍，但可能会使用更多的内存，并且对于某些输入矩阵可能不准确。有关选择驱动程序的更多信息，请参见 <code>svd_driver</code> 的文档。

source: Algorithm taken from Golub and Van Loan,
es: Algoritmo tomado de Golub y Van Loan,
ja: アルゴリズムはGolubとVan Loanから取得しました。
ru: Алгоритм,взятый у Голуба и Ван Лоана,
zh_cn: 算法取自Golub和Van Loan。

source: Algorithm terminated by <code>OutputFcn</code>.
es: Algoritmo terminado por <code>OutputFcn</code> .
ja: アルゴリズムは <code>OutputFcn</code> によって終了しました。
ru: Алгоритм завершается <code>OutputFcn</code> .
zh_cn: 算法由 <code>OutputFcn</code> 终止。

source: Algorithm: The normal vectors are calculated by taking the cross product of the diagonals of each of the quadrilateral faces in the meshgrid to find the normal vectors at the center of each face. Next, for each meshgrid point the four nearest normal vectors are averaged to obtain the final normal to the surface at the meshgrid point.
es: Algoritmo:Los vectores normales se calculan tomando el producto cruzado de las diagonales de cada una de las caras del cuadrilátero en la malla para encontrar los vectores normales en el centro de cada cara.A continuación,para cada punto de la malla se promedian los cuatro vectores normales más cercanos para obtener la normalidad final de la superficie en el punto de la malla.
ja: アルゴリズム。法線ベクトルは、各面の中心にある法線ベクトルを見つけるために、メッシュグリッド内の四角形の各面の対角線の積を取ることによって計算されます。次に、各メッシュグリッド点について、4つの最も近い法線ベクトルが平均化され、メッシュグリッド点での表面への最終的な法線が得られます。
ru: Алгоритм:Нормальные векторы вычисляются путем взятия поперечного произведения диагоналей каждой из четырехугольных граней в сетке для нахождения нормальных векторов в центре каждой из граней.Далее для каждой точки сетки усредняются четыре ближайших нормальных вектора,чтобы получить конечную норму к поверхности в точке сетки.
zh_cn: 算法。法线矢量的计算方法是:取网格中每个四边形面的对角线的交叉乘积,找出每个面中心的法线矢量。接下来,对于每个网格点,将最近的四个法向量进行平均,得到网格点处的最终法线。

source: All Java-based routines are run in the JVM&rsquo;s shared memory pool, a dedicated and separate part of memory claimed by the JVM from your computer&rsquo;s total memory (which comprises physical RAM and virtual memory / swap space on hard disk).
es: Todas las rutinas basadas en Java se ejecutan en el grupo de memoria compartida de la JVM, una parte de la memoria dedicada y separada reclamada por la JVM de la memoria total de su computadora (que comprende RAM f&iacute;sica y memoria virtual / espacio de intercambio en el disco duro).
ja: すべてのJavaベースのルーチンは、JVMの共有メモリプールで実行されます。これは、コンピューターの合計メモリ（ハードディスク上の物理RAMと仮想メモリ/スワップスペースで構成される）から、JVMが要求するメモリの専用部分です。
ru: Все подпрограммы на основе Java выполняются в пуле разделяемой памяти JVM, выделенной и отдельной части памяти, требуемой JVM от общей памяти вашего компьютера (которая включает физическую RAM и виртуальную память / пространство подкачки на жестком диске).
zh_cn: 所有基于Java的例程都在JVM的共享内存池中运行，这是JVM要求的专用和独立内存部分，它与计算机的总内存（包括物理RAM和虚拟内存/硬盘上的交换空间）有关。

source: All annotation objects share two properties:
es: Todos los objetos de anotación comparten dos propiedades:
ja: すべての注釈オブジェクトは、2つのプロパティを共有しています。
ru: Все объекты аннотации имеют два общих свойства:
zh_cn: 所有注解对象都有两个共同的属性。

source: All arguments must be numeric and either two-dimensional matrices or scalars. If any argument is of type sparse, the output will also be sparse.
es: Todos los argumentos deben ser numéricos y o bien matrices bidimensionales o escalares.Si algún argumento es de tipo disperso,la salida también será dispersa.
ja: すべての引数は数値であり、2次元の行列かスカラでなければなりません。いずれかの引数がスパース型の場合、出力もスパースになります。
ru: Все аргументы должны быть числовыми и либо двумерными матрицами,либо скалярами.Если любой аргумент имеет разреженный тип,то вывод также будет разреженным.
zh_cn: 所有参数都必须是数字,并且是二维矩阵或标量。如果任何参数是稀疏类型,输出也将是稀疏的。

source: All arguments must be the same size or scalar. For arrays, the greatest common divisor is calculated for each element individually. All elements must be ordinary or Gaussian (complex) integers. Note that for Gaussian integers, the gcd is only unique up to a phase factor (multiplication by 1, -1, i, or -i), so an arbitrary greatest common divisor among the four possible is returned.
ja: すべての引数は同じサイズかスカラでなければなりません。配列の場合、最大公約数は各要素に対して個別に計算されます。すべての要素は,通常の整数かガウス(複素)整数でなければなりません.ガウシアン整数の場合、gcdは位相因子(1,-1,i,-iによる乗算)までしか一意ではないことに注意してください。
zh_cn: 所有参数必须是相同大小或标量。对于数组,每个元素都要单独计算最大公因子。所有元素必须是普通或高斯(复数)整数。请注意,对于高斯整数,gcd只有在相位因子(乘以1、-1、i或-i)的范围内是唯一的,所以返回的是四种可能的最大公因子。

source: All characters in the pattern, including whitespace, are significant and are used in pattern matching. (default)
es: Todos los caracteres del patrón,incluyendo los espacios en blanco,son significativos y se usan en la comparación de patrones.(por defecto)
ja: 空白を含むパターン内のすべての文字は有効であり、パターンマッチングで使用されます。(デフォルト)
ru: Все символы в шаблоне,включая пробелы,являются значимыми и используются при подборе шаблона.(по умолчанию)
zh_cn: 模式中的所有字符,包括空格,都是重要的,并用于模式匹配。(默认)

source: All class methods must be defined within <code>methods</code> blocks. An exception to this rule is described at the end of this subsection. Those <code>methods</code> blocks can have additional attributes specifying the access rights or whether the methods are static, i.e., methods that can be called without creating an object of that class.
es: Todos los m&eacute;todos de clase deben definirse dentro de bloques de <code>methods</code> . Una excepci&oacute;n a esta regla se describe al final de esta subsecci&oacute;n. Esos bloques de <code>methods</code> pueden tener atributos adicionales que especifiquen los derechos de acceso o si los m&eacute;todos son est&aacute;ticos, es decir, m&eacute;todos que se pueden llamar sin crear un objeto de esa clase.
ja: すべてのクラスメソッドは、 <code>methods</code> ブロック内で定義する必要があります。この規則の例外については、このサブセクションの最後で説明します。これらの <code>methods</code> ブロックには、アクセス権またはメソッドが静的であるかどうか、つまり、そのクラスのオブジェクトを作成せずに呼び出すことができるメソッドかどうかを指定する追加の属性を含めることができます。
ru: Все методы класса должны быть определены в блоках <code>methods</code> . Исключение из этого правила описано в конце этого подраздела. Эти блоки <code>methods</code> могут иметь дополнительные атрибуты, определяющие права доступа или статические методы, т. Е. Методы, которые могут быть вызваны без создания объекта этого класса.
zh_cn: 所有类方法必须在 <code>methods</code> 块中定义。本小节的末尾描述了此规则的例外情况。这些 <code>methods</code> 块可以具有其他属性，这些属性指定访问权限或方法是否为静态，即可以在不创建该类对象的情况下调用的方法。

source: All class properties must be defined within <code>properties</code> blocks. The definition of a default value for a property is optional and can be omitted. The default initial value for each class property is <code>[]</code>.
es: Todas las propiedades de la clase deben definirse dentro de los bloques de <code>properties</code> . La definici&oacute;n de un valor predeterminado para una propiedad es opcional y puede omitirse. El valor inicial predeterminado para cada propiedad de clase es <code>[]</code> .
ja: すべてのクラスプロパティは、 <code>properties</code> ブロック内で定義する必要があります。プロパティのデフォルト値の定義はオプションであり、省略できます。各クラスプロパティのデフォルトの初期値は <code>[]</code> です。
ru: Все свойства класса должны быть определены в блоках <code>properties</code> . Определение значения по умолчанию для свойства не является обязательным и может быть опущено. Начальное значение по умолчанию для каждого свойства класса - <code>[]</code> .
zh_cn: 所有类属性必须在 <code>properties</code> 块中定义。属性默认值的定义是可选的，可以省略。每个类属性的默认初始值为 <code>[]</code> 。

source: All device formats accepted by <code>print</code> may be used. Common formats are:
es: Se pueden utilizar todos los formatos de dispositivo aceptados por <code>print</code> . Los formatos habituales son:
ja: <code>print</code> 受け入れられているすべてのデバイス形式を使用できます。一般的な形式は次のとおりです。
ru: Можно использовать все форматы устройств, принятые для <code>print</code> . Общие форматы:
zh_cn: 可以使用 <code>print</code> 接受的所有设备格式。常见格式为：

source: All elements must be numeric and of the same size or scalar.
es: Todos los elementos deben ser numéricos y del mismo tamaño o escalares.
ja: すべての要素は数値で、同じサイズまたはスカラーでなければなりません。
ru: Все элементы должны быть числовыми и иметь одинаковый размер или скаляр.
zh_cn: 所有元素都必须是数字,并且大小相同或标量。

source: All future commands issued during the current Octave session will be written to this new file (if the current setting of <code>history_save</code> allows for this).
ja: 現在のOctaveセッション中に発行される今後のすべてのコマンドは、この新しいファイルに書き込まれます（ <code>history_save</code> の現在の設定でこれが許可されている場合）。
zh_cn: 在当前Octave会话期间发出的所有将来的命令都将写入此新文件（如果 <code>history_save</code> 的当前设置允许这样做）。

source: All key-value pairs given (<var>name1</var>, <var>value1</var>, &hellip;) are added as pairs of query parameters to the body of request method (<code>get</code>, <code>post</code>, <code>put</code>, etc.).
ja: 指定されたすべてのキーと値のペア（ <var>name1</var> 、 <var>value1</var> 、&hellip;）は、クエリパラメーターのペアとしてリクエストメソッドの本体（ <code>get</code> 、 <code>post</code> 、 <code>put</code> など）に追加されます。
zh_cn: 给定的所有键值对（ <var>name1</var> ， <var>value1</var> ，&hellip;）作为查询参数对添加到请求方法的主体（ <code>get</code> ， <code>post</code> ， <code>put</code> 等）中。

source: All key-value pairs given (<var>name1</var>, <var>value1</var>, &hellip;) are appended as query parameters to <var>url</var>. To place a query in the body of the message, use <code>webwrite</code>. The web service defines the acceptable query parameters.
ja: 指定されたすべてのキーと値のペア（ <var>name1</var> 、 <var>value1</var> 、&hellip;）は、クエリパラメータとして <var>url</var> に追加されます。メッセージの本文にクエリを配置するには、 <code>webwrite</code> を使用します。Webサービスは、受け入れ可能なクエリパラメータを定義します。
zh_cn: 给定的所有键值对（ <var>name1</var> ， <var>value1</var> ，&hellip;）都作为查询参数附加到 <var>url</var> 。要将查询放在邮件正文中，请使用 <code>webwrite</code> 。Web服务定义了可接受的查询参数。

source: All libraries and header files will be installed in subdirectories of <code>$prefix64</code> (you must choose the location of this directory).
es: Todas las bibliotecas y archivos de encabezado se instalar&aacute;n en subdirectorios de <code>$prefix64</code> (debe elegir la ubicaci&oacute;n de este directorio).
ja: すべてのライブラリとヘッダーファイルは、 <code>$prefix64</code> サブディレクトリにインストールされます（このディレクトリの場所を選択する必要があります）。
ru: Все библиотеки и файлы заголовков будут установлены в подкаталоги <code>$prefix64</code> (вы должны выбрать расположение этого каталога).
zh_cn: 所有库和头文件都将安装在 <code>$prefix64</code> 子目录中（您必须选择此目录的位置）。

source: All of Octave&rsquo;s comparison operators return a value of 1 if the comparison is true, or 0 if it is false. For matrix values, they all work on an element-by-element basis. Broadcasting rules apply. See <a href="broadcasting#Broadcasting">Broadcasting</a>. For example:
es: Todos los operadores de comparaci&oacute;n de Octave devuelven un valor de 1 si la comparaci&oacute;n es verdadera o 0 si es falsa. Para los valores matriciales, todos funcionan elemento por elemento. Se aplican las reglas de transmisi&oacute;n. Ver <a href="broadcasting#Broadcasting">Difusi&oacute;n</a> . Por ejemplo:
ja: Octaveのすべての比較演算子は、比較が真の場合は1、偽の場合は0を返します。行列値の場合、これらはすべて要素ごとに機能します。放送ルールが適用されます。<a href="broadcasting#Broadcasting">Broadcastingを</a>参照してください。例えば：
ru: Все операторы сравнения Octave возвращают значение 1, если сравнение истинно, или 0, если оно ложно. Для значений матрицы все они работают поэлементно. Применяются правила вещания. См. <a href="broadcasting#Broadcasting">Вещание</a> . Например:
zh_cn: 如果比较为真，则所有Octave的比较运算符均返回1的值，否则为0。对于矩阵值，它们都在逐个元素的基础上工作。广播规则适用。请参阅<a href="broadcasting#Broadcasting">广播</a>。例如：

source: All of the file formats supported by <code>save</code> and <code>load</code> are supported. In certain circumstances a user class might contain a field that it doesn&rsquo;t make sense to save, or a field that needs to be initialized before it is saved. This can be done with the <code>saveobj</code> method of the class.
es: Se admiten todos los formatos de archivo compatibles con <code>save</code> y <code>load</code> . En determinadas circunstancias, una clase de usuario puede contener un campo que no tiene sentido guardar o un campo que debe inicializarse antes de guardarlo. Esto se puede hacer con el m&eacute;todo <code>saveobj</code> de la clase.
ja: <code>save</code> と <code>load</code> サポートされているすべてのファイル形式がサポートされています。特定の状況では、ユーザークラスには、保存しても意味のないフィールドや、保存する前に初期化する必要のあるフィールドが含まれている場合があります。これは、クラスの <code>saveobj</code> メソッドで実行できます。
ru: Поддерживаются все форматы файлов, поддерживаемые функциями <code>save</code> и <code>load</code> . В определенных обстоятельствах пользовательский класс может содержать поле, которое не имеет смысла сохранять, или поле, которое необходимо инициализировать перед сохранением. Это можно сделать с <code>saveobj</code> метода saveobj класса.
zh_cn: 支持 <code>save</code> 和 <code>load</code> 支持的所有文件格式。在某些情况下，用户类可能包含一个没有意义的字段，或者在保存之前需要初始化的字段。这可以通过该类的 <code>saveobj</code> 方法完成。

source: All of the group objects contain data source parameters. There are string parameters that contain an expression that is evaluated to update the relevant data property of the group when the <code>refreshdata</code> function is called.
es: Todos los objetos de grupo contienen par&aacute;metros de fuente de datos. Hay par&aacute;metros de cadena que contienen una expresi&oacute;n que se eval&uacute;a para actualizar la propiedad de datos relevantes del grupo cuando el <code>refreshdata</code> funci&oacute;n se llama.
ja: すべてのグループオブジェクトには、データソースパラメータが含まれています。 <code>refreshdata</code> 関数が呼び出されたときにグループの関連データプロパティを更新するために評価される式を含む文字列パラメーターがあります。
ru: Все объекты группы содержат параметры источника данных. Есть строковые параметры, которые содержат выражение, которое оценивается для обновления соответствующего свойства данных группы при <code>refreshdata</code> функции refreshdata .
zh_cn: 所有组对象都包含数据源参数。有些字符串参数包含一个表达式，当调用 <code>refreshdata</code> 函数时，该表达式将被评估以更新组的相关数据属性。
