Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/octave/octave.*.020.xlf
Languages: es, ru, zh_cn

source: This file is used to make personal changes to the default Octave environment.
es: Este archivo se utiliza para hacer cambios personales en el entorno predeterminado de la Octava.
ru: Этот файл используется для внесения личных изменений в окружение Октавы по умолчанию.
zh_cn: 该文件用于对默认的Octave环境进行个人修改。

source: This file is used to make personal changes to the default Octave environment. It is executed for <small>MATLAB</small> compatibility, but
es: Este archivo se utiliza para realizar cambios personales en el entorno Octave predeterminado. Se ejecuta para compatibilidad con <small>MATLAB</small> , pero
ru: Этот файл используется для внесения личных изменений в среду Octave по умолчанию. Он выполнен для совместимости с <small>MATLAB</small> , но
zh_cn: 该文件用于对默认的Octave环境进行个人更改。它是为了与<small>MATLAB</small>兼容而执行的，但是

source: This function and <code>+&nbsp;<var>x</var></code> are equivalent.
es: Esta funci&oacute;n y <code>+&nbsp;<var>x</var></code> son equivalentes.
ru: Эта функция и <code>+&nbsp;<var>x</var></code> эквивалентны.
zh_cn: 此函数与 <code>+&nbsp;<var>x</var></code> 等效。

source: This function and <code>-&nbsp;<var>x</var></code> are equivalent.
es: Esta funci&oacute;n y <code>-&nbsp;<var>x</var></code> son equivalentes.
ru: Эта функция и <code>-&nbsp;<var>x</var></code> эквивалентны.
zh_cn: 此功能与 <code>-&nbsp;<var>x</var></code> 是等价的。

source: This function and <code><var>x</var>&nbsp;*&nbsp;<var>y</var></code> are equivalent. If more arguments are given, the multiplication is applied cumulatively from left to right:
es: Esta funci&oacute;n y <code><var>x</var>&nbsp;*&nbsp;<var>y</var></code> son equivalentes. Si se dan m&aacute;s argumentos, la multiplicaci&oacute;n se aplica de forma acumulativa de izquierda a derecha:
ru: Эта функция и <code><var>x</var>&nbsp;*&nbsp;<var>y</var></code> эквивалентны. Если указано больше аргументов, умножение применяется кумулятивно слева направо:
zh_cn: 此函数与 <code><var>x</var>&nbsp;*&nbsp;<var>y</var></code> 等价。如果给出更多的参数，则从左到右累积应用乘法：

source: This function and <code><var>x</var>&nbsp;+&nbsp;<var>y</var></code> are equivalent.
es: Esta funci&oacute;n y <code><var>x</var>&nbsp;+&nbsp;<var>y</var></code> son equivalentes.
ru: Эта функция и <code><var>x</var>&nbsp;+&nbsp;<var>y</var></code> эквивалентны.
zh_cn: 此函数与 <code><var>x</var>&nbsp;+&nbsp;<var>y</var></code> 等效。

source: This function and <code><var>x</var>&nbsp;-&nbsp;<var>y</var></code> are equivalent.
es: Esta funci&oacute;n y <code><var>x</var>&nbsp;-&nbsp;<var>y</var></code> son equivalentes.
ru: Эта функция и <code><var>x</var>&nbsp;-&nbsp;<var>y</var></code> эквивалентны.
zh_cn: 此函数与 <code><var>x</var>&nbsp;-&nbsp;<var>y</var></code> 等效。

source: This function and <code><var>x</var>&nbsp;.*&nbsp;<var>y</var></code> are equivalent. If more arguments are given, the multiplication is applied cumulatively from left to right:
es: Esta funci&oacute;n y <code><var>x</var>&nbsp;.*&nbsp;<var>y</var></code> son equivalentes. Si se dan m&aacute;s argumentos, la multiplicaci&oacute;n se aplica de forma acumulativa de izquierda a derecha:
ru: Эта функция и <code><var>x</var>&nbsp;.*&nbsp;<var>y</var></code> эквивалентны. Если указано больше аргументов, умножение применяется кумулятивно слева направо:
zh_cn: 此函数与 <code><var>x</var>&nbsp;.*&nbsp;<var>y</var></code> 等效。如果给出更多的参数，则从左到右累积应用乘法：

source: This function and <code><var>x</var>&nbsp;./&nbsp;<var>y</var></code> are equivalent.
es: Esta funci&oacute;n y <code><var>x</var>&nbsp;./&nbsp;<var>y</var></code> son equivalentes.
ru: Эта функция и <code><var>x</var>&nbsp;./&nbsp;<var>y</var></code> эквивалентны.
zh_cn: 此函数与 <code><var>x</var>&nbsp;./&nbsp;<var>y</var></code> 等效。

source: This function and <code><var>x</var>&nbsp;.\&nbsp;<var>y</var></code> are equivalent.
es: Esta funci&oacute;n y <code><var>x</var>&nbsp;.\&nbsp;<var>y</var></code> son equivalentes.
ru: Эта функция и <code><var>x</var>&nbsp;.\&nbsp;<var>y</var></code> эквивалентны.
zh_cn: 此函数与 <code><var>x</var>&nbsp;.\&nbsp;<var>y</var></code> 等效。

source: This function and <code><var>x</var>&nbsp;.^&nbsp;<var>y</var></code> are equivalent.
es: Esta funci&oacute;n y <code><var>x</var>&nbsp;.^&nbsp;<var>y</var></code> son equivalentes.
ru: Эта функция и <code><var>x</var>&nbsp;.^&nbsp;<var>y</var></code> эквивалентны.
zh_cn: 此函数与 <code><var>x</var>&nbsp;.^&nbsp;<var>y</var></code> 等价。

source: This function and <code><var>x</var>&nbsp;/&nbsp;<var>y</var></code> are equivalent.
es: Esta funci&oacute;n y <code><var>x</var>&nbsp;/&nbsp;<var>y</var></code> son equivalentes.
ru: Эта функция и <code><var>x</var>&nbsp;/&nbsp;<var>y</var></code> эквивалентны.
zh_cn: 此函数与 <code><var>x</var>&nbsp;/&nbsp;<var>y</var></code> 等效。

source: This function and <code><var>x</var>&nbsp;\&nbsp;<var>y</var></code> are equivalent.
es: Esta funci&oacute;n y <code><var>x</var>&nbsp;\&nbsp;<var>y</var></code> son equivalentes.
ru: Эта функция и <code><var>x</var>&nbsp;\&nbsp;<var>y</var></code> эквивалентны.
zh_cn: 此函数与 <code><var>x</var>&nbsp;\&nbsp;<var>y</var></code> 等效。

source: This function and <code><var>x</var>&nbsp;^&nbsp;<var>y</var></code> are equivalent.
es: Esta funci&oacute;n y <code><var>x</var>&nbsp;^&nbsp;<var>y</var></code> son equivalentes.
ru: Эта функция и <code><var>x</var>&nbsp;^&nbsp;<var>y</var></code> эквивалентны.
zh_cn: 此函数与 <code><var>x</var>&nbsp;^&nbsp;<var>y</var></code> 等价。

source: This function and <code><var>x</var>'</code> are equivalent.
es: Esta funci&oacute;n y <code><var>x</var>'</code> son equivalentes.
ru: Эта функция и <code><var>x</var>'</code> эквивалентны.
zh_cn: 此函数与 <code><var>x</var>'</code> 等效。

source: This function and <code><var>x</var>.'</code> are equivalent.
es: Esta funci&oacute;n y <code><var>x</var>.'</code> son equivalentes.
ru: Эта функция и <code><var>x</var>.'</code> эквивалентны.
zh_cn: 这个函数和 <code><var>x</var>.'</code> 是等效的。

source: This function assumes that versions <var>v1</var> and <var>v2</var> are arbitrarily long strings made of numeric and period characters possibly followed by an arbitrary string (e.g., <code>"1.2.3"</code>, <code>"0.3"</code>, <code>"0.1.2+"</code>, or <code>"1.2.3.4-test1"</code>).
es: Esta funci&oacute;n asume que las versiones <var>v1</var> y <var>v2</var> son cadenas arbitrariamente largas compuestas por caracteres num&eacute;ricos y de punto, posiblemente seguidas de una cadena arbitraria (por ejemplo, <code>"1.2.3"</code> , <code>"0.3"</code> , <code>"0.1.2+"</code> o <code>"1.2.3.4-test1"</code> ).
ru: Эта функция предполагает, что версии <var>v1</var> и <var>v2</var> представляют собой произвольно длинные строки, состоящие из числовых символов и символов точки, за которыми может следовать произвольная строка (например, <code>"1.2.3"</code> , <code>"0.3"</code> , <code>"0.1.2+"</code> или <code>"1.2.3.4-test1"</code> ).
zh_cn: 此函数假定版本 <var>v1</var> 和 <var>v2</var> 是由数字和句点字符组成的任意长字符串，可能后跟任意字符串（例如 <code>"1.2.3"</code> ， <code>"0.3"</code> ， <code>"0.1.2+"</code> 或 <code>"1.2.3.4-test1"</code> ）。

source: This function behaves like <code>eval</code>, but any output or warning messages which would normally be written to the console are captured and returned in the string <var>s</var>.
es: Esta funci&oacute;n se comporta como <code>eval</code> , pero cualquier salida o mensaje de advertencia que normalmente se escribir&iacute;a en la consola se captura y devuelve en la cadena <var>s</var> .
ru: Эта функция ведет себя как <code>eval</code> , но любые выходные или предупреждающие сообщения, которые обычно записываются в консоль, захватываются и возвращаются в строке <var>s</var> .
zh_cn: 该函数的行为类似于 <code>eval</code> ，但是通常会写入控制台的所有输出或警告消息均会在字符串 <var>s</var> 中捕获并返回。

source: This function can be used, for example, to reduce the impact of noise in <var>data</var> before calculating isosurfaces.
es: Esta funci&oacute;n se puede utilizar, por ejemplo, para reducir el impacto del ruido en los <var>data</var> antes de calcular las isosuperficies.
ru: Эту функцию можно использовать, например, для уменьшения влияния шума на <var>data</var> перед вычислением изоповерхностей.
zh_cn: 例如，此功能可用于在计算等值面之前减少 <var>data</var> 中噪声的影响。

source: This function changes the ambient, diffuse, and specular strengths, as well as the specular exponent and specular color reflectance, of all <code>patch</code> and <code>surface</code> objects in the current axes. This can be used to simulate, to some extent, the reflectance properties of certain materials when used with <code>light</code>.
es: Esta funci&oacute;n cambia la intensidad ambiental, difusa y especular, as&iacute; como el exponente especular y la reflectancia de color especular, de todos los objetos de <code>surface</code> y <code>patch</code> en los ejes actuales. Esto puede usarse para simular, hasta cierto punto, las propiedades de reflectancia de ciertos materiales cuando se usan con <code>light</code> .
ru: Эта функция изменяет силу окружающей среды, диффузного и зеркального отражения, а также показатель зеркального отражения и зеркальный цветовой коэффициент отражения всех <code>patch</code> и <code>surface</code> объектов в текущих осях. Это может быть использовано для имитации в некоторой степени отражательных свойств некоторых материалов при использовании со <code>light</code> .
zh_cn: 此功能可更改当前轴上所有 <code>surface</code> <code>patch</code> 和曲面对象的环境强度，漫反射强度和镜面反射强度以及镜面指数和镜面颜色反射率。当与 <code>light</code> 一起使用时，这可以用来在某种程度上模拟某些材料的反射特性。

source: This function does not support sparse matrices.
es: Esta función no soporta matrices dispersas.
ru: Эта функция не поддерживает разреженные матрицы.
zh_cn: 该函数不支持稀疏矩阵。

source: This function is based on the <small>ARPACK</small> package, written by R. Lehoucq, K. Maschhoff, D. Sorensen, and C. Yang. For more information see <a href="http://www.caam.rice.edu/software/ARPACK/">http://www.caam.rice.edu/software/ARPACK/</a>.
es: Esta funci&oacute;n se basa en el paquete <small>ARPACK</small> , escrito por R. Lehoucq, K. Maschhoff, D. Sorensen y C. Yang. Para obtener m&aacute;s informaci&oacute;n, consulte <a href="http://www.caam.rice.edu/software/ARPACK/">http://www.caam.rice.edu/software/ARPACK/</a> .
ru: Эта функция основана на пакете <small>ARPACK</small> , написанном R. Lehoucq, K. Maschhoff, D. Sorensen и C. Yang. Для получения дополнительной информации см. <a href="http://www.caam.rice.edu/software/ARPACK/">Http://www.caam.rice.edu/software/ARPACK/</a> .
zh_cn: 此功能基于R.Lehoucq，K.Maschhoff，D.Sorensen和C.Yang编写的<small>ARPACK</small>软件包。有关更多信息，请参见<a href="http://www.caam.rice.edu/software/ARPACK/">http://www.caam.rice.edu/software/ARPACK/</a>。

source: This function is called at the beginning of all high-level plotting functions. It is not normally required in user programs. <code>newplot</code> queries the <code>"NextPlot"</code> field of the current figure and axes to determine what to do.
es: Esta funci&oacute;n se llama al comienzo de todas las funciones de trazado de alto nivel. Normalmente no se requiere en los programas de usuario. <code>newplot</code> consulta el campo <code>"NextPlot"</code> de la figura actual y los ejes para determinar qu&eacute; hacer.
ru: Эта функция вызывается в начале всех высокоуровневых функций построения графиков. Обычно это не требуется в пользовательских программах. <code>newplot</code> запрашивает поле <code>"NextPlot"</code> текущей фигуры и осей, чтобы определить, что делать.
zh_cn: 在所有高级绘图功能的开头都会调用此功能。用户程序中通常不需要它。 <code>newplot</code> 查询当前图形和轴的 <code>"NextPlot"</code> 字段，以确定要执行的操作。

source: This function is conceptually equivalent to computing
es: Esta función es conceptualmente equivalente a la computación
ru: Эта функция концептуально эквивалентна вычислениям
zh_cn: 这个函数在概念上等同于计算

source: This function is equivalent to
es: Esta función es equivalente a
ru: Эта функция эквивалентна
zh_cn: 这个功能相当于

source: This function is equivalent to <code><var>x</var>&nbsp;!=&nbsp;<var>y</var></code>.
es: Esta funci&oacute;n es equivalente a <code><var>x</var>&nbsp;!=&nbsp;<var>y</var></code> .
ru: Эта функция эквивалентна <code><var>x</var>&nbsp;!=&nbsp;<var>y</var></code> .
zh_cn: 此函数等效于 <code><var>x</var>&nbsp;!=&nbsp;<var>y</var></code> 。

source: This function is equivalent to <code><var>x</var>&nbsp;&gt;&nbsp;<var>y</var></code>.
es: Esta funci&oacute;n es equivalente <code><var>x</var>&nbsp;&gt;&nbsp;<var>y</var></code> .
ru: Эта функция эквивалентна <code><var>x</var>&nbsp;&gt;&nbsp;<var>y</var></code> .
zh_cn: 此函数等效于 <code><var>x</var>&nbsp;&gt;&nbsp;<var>y</var></code> 。

source: This function is equivalent to <code><var>x</var>&nbsp;&gt;=&nbsp;<var>y</var></code>.
es: Esta funci&oacute;n es equivalente <code><var>x</var>&nbsp;&gt;=&nbsp;<var>y</var></code> .
ru: Эта функция эквивалентна <code><var>x</var>&nbsp;&gt;=&nbsp;<var>y</var></code> .
zh_cn: 此函数等效于 <code><var>x</var>&nbsp;&gt;=&nbsp;<var>y</var></code> 。

source: This function is equivalent to <code><var>x</var>&nbsp;&lt;&nbsp;<var>y</var></code>.
es: Esta funci&oacute;n es equivalente <code><var>x</var>&nbsp;&lt;&nbsp;<var>y</var></code> .
ru: Эта функция эквивалентна <code><var>x</var>&nbsp;&lt;&nbsp;<var>y</var></code> .
zh_cn: 此函数等效于 <code><var>x</var>&nbsp;&lt;&nbsp;<var>y</var></code> 。

source: This function is equivalent to <code><var>x</var>&nbsp;&lt;=&nbsp;<var>y</var></code>.
es: Esta funci&oacute;n es equivalente <code><var>x</var>&nbsp;&lt;=&nbsp;<var>y</var></code> .
ru: Эта функция эквивалентна <code><var>x</var>&nbsp;&lt;=&nbsp;<var>y</var></code> .
zh_cn: 此函数等效于 <code><var>x</var>&nbsp;&lt;=&nbsp;<var>y</var></code> 。

source: This function is equivalent to <code><var>x</var>&nbsp;==&nbsp;<var>y</var></code>.
es: Esta funci&oacute;n es equivalente a <code><var>x</var>&nbsp;==&nbsp;<var>y</var></code> .
ru: Эта функция эквивалентна <code><var>x</var>&nbsp;==&nbsp;<var>y</var></code> .
zh_cn: 此函数等效于 <code><var>x</var>&nbsp;==&nbsp;<var>y</var></code> 。

source: This function is equivalent to <code>arg (complex (<var>x</var>, <var>y</var>))</code>.
es: Esta funci&oacute;n es equivalente a <code>arg (complex (<var>x</var>, <var>y</var>))</code> .
ru: Эта функция эквивалентна <code>arg (complex (<var>x</var>, <var>y</var>))</code> .
zh_cn: 此函数等效于 <code>arg (complex (<var>x</var>, <var>y</var>))</code> 。

source: This function is equivalent to <code>printf</code>, except that the output is written to the file descriptor <var>fid</var> instead of <code>stdout</code>.
es: Esta funci&oacute;n es equivalente a <code>printf</code> , excepto que la salida se escribe en el descriptor de archivo <var>fid</var> en lugar de <code>stdout</code> .
ru: Эта функция эквивалентна <code>printf</code> , за исключением того, что вывод записывается в файловый дескриптор <var>fid</var> вместо <code>stdout</code> .
zh_cn: 此函数等效于 <code>printf</code> ，除了将输出写入文件描述符 <var>fid</var> 而不是 <code>stdout</code> 之外。

source: This function is equivalent to the operator syntax <code>!&nbsp;<var>x</var></code>.
es: Esta funci&oacute;n es equivalente a la sintaxis del operador <code>!&nbsp;<var>x</var></code> .
ru: Эта функция эквивалентна синтаксису оператора <code>!&nbsp;<var>x</var></code> .
zh_cn: 此功能等效于运算符语法 <code>!&nbsp;<var>x</var></code> 。

source: This function is equivalent to the operator syntax <code><var>base</var>&nbsp;:&nbsp;<var>limit</var></code> or <code><var>base</var>&nbsp;:&nbsp;<var>increment</var>&nbsp;:&nbsp;<var>limit</var></code>.
es: Esta funci&oacute;n es equivalente a la sintaxis del operador <code><var>base</var>&nbsp;:&nbsp;<var>limit</var></code> o <code><var>base</var>&nbsp;:&nbsp;<var>increment</var>&nbsp;:&nbsp;<var>limit</var></code> .
ru: Эта функция эквивалентна синтаксису оператора <code><var>base</var>&nbsp;:&nbsp;<var>limit</var></code> или <code><var>base</var>&nbsp;:&nbsp;<var>increment</var>&nbsp;:&nbsp;<var>limit</var></code> .
zh_cn: 此函数等效于运算符语法 <code><var>base</var>&nbsp;:&nbsp;<var>limit</var></code> 或 <code><var>base</var>&nbsp;:&nbsp;<var>increment</var>&nbsp;:&nbsp;<var>limit</var></code> 。

source: This function is equivalent to the operator syntax <code><var>x</var>&nbsp;&amp;&nbsp;<var>y</var></code>. If more than two arguments are given, the logical AND is applied cumulatively from left to right:
es: Esta funci&oacute;n es equivalente a la sintaxis del operador <code><var>x</var>&nbsp;&amp;&nbsp;<var>y</var></code> . Si se dan m&aacute;s de dos argumentos, el Y l&oacute;gico se aplica de forma acumulativa de izquierda a derecha:
ru: Эта функция эквивалентна синтаксису оператора <code><var>x</var>&nbsp;&amp;&nbsp;<var>y</var></code> . Если указано более двух аргументов, логическое И применяется кумулятивно слева направо:
zh_cn: 此函数等效于运算符语法 <code><var>x</var>&nbsp;&amp;&nbsp;<var>y</var></code> 。如果给出两个以上的参数，则从左到右累计应用逻辑AND：

source: This function is equivalent to the operator syntax <code><var>x</var>&nbsp;|&nbsp;<var>y</var></code>. If more than two arguments are given, the logical OR is applied cumulatively from left to right:
es: Esta funci&oacute;n es equivalente a la sintaxis del operador <code><var>x</var>&nbsp;|&nbsp;<var>y</var></code> . Si se dan m&aacute;s de dos argumentos, el OR l&oacute;gico se aplica de forma acumulativa de izquierda a derecha:
ru: Эта функция эквивалентна синтаксису оператора <code><var>x</var>&nbsp;|&nbsp;<var>y</var></code> . Если указано более двух аргументов, применяется логическое ИЛИ кумулятивно слева направо:
zh_cn: 此函数等效于运算符语法 <code><var>x</var>&nbsp;|&nbsp;<var>y</var></code> 。如果给出两个以上的参数，则从左到右累积应用逻辑或：

source: This function is intended to facilitate manipulation of the output of functions such as <code>stemleaf</code>.
es: Esta funci&oacute;n est&aacute; destinada a facilitar la manipulaci&oacute;n de la salida de funciones como <code>stemleaf</code> .
ru: Эта функция предназначена для облегчения манипулирования выводом таких функций, как <code>stemleaf</code> .
zh_cn: 此功能旨在促进对诸如 <code>stemleaf</code> 之类的功能的输出进行操作。

source: This function is not recommended. Use <code>isfolder</code> or <code>file_in_loadpath</code> instead.
es: No se recomienda esta funci&oacute;n. En su lugar, utilice <code>isfolder</code> o <code>file_in_loadpath</code> .
ru: Эта функция не рекомендуется. <code>isfolder</code> этого используйте isfolder или <code>file_in_loadpath</code> .
zh_cn: 不建议使用此功能。请改用 <code>isfolder</code> 或 <code>file_in_loadpath</code> 。

source: This function is not very flexible. For better control over the results, use <code>sprintf</code> (see <a href="formatted-output#Formatted-Output">Formatted Output</a>).
es: Esta funci&oacute;n no es muy flexible. Para un mejor control sobre los resultados, use <code>sprintf</code> (consulte <a href="formatted-output#Formatted-Output">Salida formateada</a> ).
ru: Эта функция не очень гибкая. Для лучшего контроля над результатами используйте <code>sprintf</code> (см. <a href="formatted-output#Formatted-Output">Форматированный вывод</a> ).
zh_cn: 此功能不是很灵活。为了更好地控制结果，请使用 <code>sprintf</code> （请参见<a href="formatted-output#Formatted-Output">Formatted Output</a>）。

source: This function is obsolete. Use <code>strfind</code> instead.
es: Esta funci&oacute;n est&aacute; obsoleta. Utilice <code>strfind</code> en su lugar.
ru: Эта функция устарела. <code>strfind</code> этого используйте strfind .
zh_cn: 该功能已过时。请改用 <code>strfind</code> 。

source: This function is obsolete. Use <code>textscan</code> instead.
es: Esta funci&oacute;n est&aacute; obsoleta. <code>textscan</code> lugar, utilice escaneo de textos .
ru: Эта функция устарела. <code>textscan</code> этого используйте TextScan .
zh_cn: 该功能已过时。请改用 <code>textscan</code> 。

source: This function is obsolete. Use an alternative such as <code>strncmp</code> or <code>strcmp</code> instead.
es: Esta funci&oacute;n est&aacute; obsoleta. Use una alternativa como <code>strncmp</code> o <code>strcmp</code> en su lugar.
ru: Эта функция устарела. <code>strcmp</code> этого используйте альтернативу, например <code>strncmp</code> или strcmp .
zh_cn: 该功能已过时。请使用诸如 <code>strncmp</code> 或 <code>strcmp</code> 之类的替代方法。

source: This function is patterned after the equivalent function in Perl.
es: Esta función sigue el patrón de la función equivalente en Perl.
ru: Эта функция узорчата после эквивалентной функции на Perl.
zh_cn: 这个函数是模仿Perl中的等价函数。

source: This function is provided for compatibility, but does nothing in Octave.
es: Esta función se proporciona para la compatibilidad,pero no hace nada en Octava.
ru: Эта функция предусмотрена для совместимости,но ничего не делает в Октаве.
zh_cn: 这个功能是为了兼容而提供的,但在Octave中没有任何作用。

source: This function is provided for the benefit of programs like Emacs which might be controlling Octave and handling user input. The current command number is not incremented when this function is called. This is a feature, not a bug.
es: Esta función se proporciona para el beneficio de programas como Emacs que podrían estar controlando la Octava y manejando la entrada del usuario.El número de comando actual no se incrementa cuando se llama a esta función.Esta es una característica,no un error.
ru: Эта функция предусмотрена для таких программ,как Emacs,которые могут управлять октавой и обрабатывать пользовательский ввод.Номер текущей команды не увеличивается при вызове этой функции.Это функция,а не ошибка.
zh_cn: 这个函数是为Emacs等程序提供的,这些程序可能会控制Octave并处理用户输入。当这个函数被调用时,当前的命令号不会被递增。这是一个特性,而不是一个错误。

source: This function is recursive because it calls itself directly. It eventually terminates because each time it calls itself, it uses an argument that is one less than was used for the previous call. Once the argument is no longer greater than zero, it does not call itself, and the recursion ends.
es: Esta función es recursiva porque se llama a sí misma directamente.Termina eventualmente porque cada vez que se llama a sí misma,utiliza un argumento que es uno menos que el utilizado para la llamada anterior.Una vez que el argumento ya no es mayor que cero,no se llama a sí mismo,y la recursividad termina.
ru: Эта функция является рекурсивной,так как называется напрямую.В конце концов,она прекращает работу,потому что каждый раз,когда она вызывает себя,она использует аргумент,который на один аргумент меньше,чем был использован для предыдущего вызова.Как только аргумент больше не превышает нуля,он не вызывает себя,и рекурсия заканчивается.
zh_cn: 这个函数是递归的,因为它直接调用自己。它最终会终止,因为每次调用自己时,它使用的参数都比前一次调用时少一个。一旦参数不再大于0,它就不调用自己,递归结束。

source: This function is similar to <code>get (h, "children")</code>, but also returns hidden objects (HandleVisibility = <code>"off"</code>).
es: Esta funci&oacute;n es similar a <code>get (h, "children")</code> , pero tambi&eacute;n devuelve objetos ocultos (HandleVisibility = <code>"off"</code> ).
ru: Эта функция похожа на <code>get (h, "children")</code> , но также возвращает скрытые объекты (HandleVisibility = <code>"off"</code> ).
zh_cn: 此函数类似于 <code>get (h, "children")</code> ，但还返回隐藏的对象（HandleVisibility = <code>"off"</code> ）。

source: This function is the inverse of <code>mkpp</code>: it extracts the inputs to <code>mkpp</code> needed to create the piecewise polynomial structure <var>PP</var>. The code below makes this relation explicit:
es: Esta funci&oacute;n es la inversa de <code>mkpp</code> : extrae las entradas a <code>mkpp</code> necesarias para crear la estructura polinomial <var>PP</var> por partes . El siguiente c&oacute;digo hace expl&iacute;cita esta relaci&oacute;n:
ru: Эта функция является обратной для <code>mkpp</code> : она извлекает входные данные в <code>mkpp</code> , необходимые для создания кусочно-полиномиальной структуры <var>PP</var> . Код ниже делает это отношение явным:
zh_cn: 此功能的逆 <code>mkpp</code> ：它提取输入 <code>mkpp</code> 创建分段多项式结构所需 <var>PP</var> 。下面的代码使此关系明确：
