Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/octave/octave.*.020.xlf
Languages: es, ru, zh_cn

source: The surface mesh is plotted using shaded rectangles. The vertices of the rectangles [<var>x</var>, <var>y</var>] are typically the output of <code>meshgrid</code>. over a 2-D rectangular region in the x-y plane. <var>z</var> determines the height above the plane of each vertex. If only a single <var>z</var> matrix is given, then it is plotted over the meshgrid <code><var>x</var> = 1:columns (<var>z</var>), <var>y</var> = 1:rows (<var>z</var>)</code>. Thus, columns of <var>z</var> correspond to different <var>x</var> values and rows of <var>z</var> correspond to different <var>y</var> values.
es: La malla de la superficie se traza utilizando rect&aacute;ngulos sombreados. Los v&eacute;rtices de los rect&aacute;ngulos [ <var>x</var> , <var>y</var> ] suelen ser la salida de <code>meshgrid</code> . sobre una regi&oacute;n rectangular 2-D en el plano xy. <var>z</var> determina la altura sobre el plano de cada v&eacute;rtice. Si solo se proporciona una &uacute;nica matriz <var>z</var> , entonces se traza sobre la cuadr&iacute;cula de malla <code><var>x</var> = 1:columns (<var>z</var>), <var>y</var> = 1:rows (<var>z</var>)</code> . Por tanto, las columnas de <var>z</var> corresponden a diferentes valores de <var>x</var> y las filas de <var>z</var> corresponden a diferentes valores de <var>y</var> .
ru: Поверхностная сетка строится с помощью закрашенных прямоугольников. Вершины прямоугольников [ <var>x</var> , <var>y</var> ] обычно являются выходными <code>meshgrid</code> . над двумерной прямоугольной областью в плоскости xy. <var>z</var> определяет высоту над плоскостью каждой вершины. Если задана только одна <var>z</var> - матрица, то она строится по сетке <code><var>x</var> = 1:columns (<var>z</var>), <var>y</var> = 1:rows (<var>z</var>)</code> . Таким образом, столбцы <var>z</var> соответствуют разным значениям <var>x</var> , а строки <var>z</var> соответствуют разным значениям <var>y</var> .
zh_cn: 使用阴影矩形绘制表面网格。矩形[ <var>x</var> ， <var>y</var> ] 的顶点通常是 <code>meshgrid</code> 的输出。在xy平面的二维矩形区域上。 <var>z</var> 确定每个顶点平面上方的高度。如果仅给出单个 <var>z</var> 矩阵，则将其绘制在网格 <code><var>x</var> = 1:columns (<var>z</var>), <var>y</var> = 1:rows (<var>z</var>)</code> 。因此， <var>z</var> 的列对应于不同的 <var>x</var> 值， <var>z</var> 的行对应于不同的 <var>y</var> 值。

source: The switch Statement
es: La declaración del interruptor
ru: Сообщение о переключении
zh_cn: 转换声明

source: The symbol <code>~</code> may be used as a placeholder in the list of lvalues, indicating that the corresponding return value should be ignored and not stored anywhere:
es: El s&iacute;mbolo <code>~</code> se puede utilizar como marcador de posici&oacute;n en la lista de lvalores, lo que indica que el valor de retorno correspondiente debe ignorarse y no almacenarse en ning&uacute;n lugar:
ru: Символ <code>~</code> может использоваться в качестве заполнителя в списке lvalues, указывая, что соответствующее возвращаемое значение следует игнорировать и нигде не сохранять:
zh_cn: 符号 <code>~</code> 可用作左值列表中的占位符，指示应忽略相应的返回值，而不要将其存储在任何位置：

source: The symbol <var>ret-var</var> is the name of the variable that will hold the value to be returned by the function. This variable must be defined before the end of the function body in order for the function to return a value.
es: El s&iacute;mbolo <var>ret-var</var> es el nombre de la variable que contendr&aacute; el valor que devolver&aacute; la funci&oacute;n. Esta variable debe definirse antes del final del cuerpo de la funci&oacute;n para que la funci&oacute;n devuelva un valor.
ru: Символ <var>ret-var</var> - это имя переменной, которая будет содержать значение, возвращаемое функцией. Эта переменная должна быть определена до конца тела функции, чтобы функция возвращала значение.
zh_cn: 符号 <var>ret-var</var> 是变量的名称，该变量将保存函数要返回的值。必须在函数体末尾之前定义此变量，以便函数返回值。

source: The system matrix acts like the conductivity <code>S</code> in Ohm&rsquo;s law <code>S * V = I</code>. Based on the Dirichlet and Neumann boundary conditions, we are able to solve for the voltages at each vertex <code>V</code>.
es: La matriz del sistema act&uacute;a como la conductividad <code>S</code> en la ley de Ohm <code>S * V = I</code> . Sobre la base de las condiciones de contorno de Dirichlet y Neumann, somos capaces de resolver para los voltajes en cada v&eacute;rtice <code>V</code> .
ru: Матричная система действует как проводимость <code>S</code> в законе Ома <code>S * V = I</code> . На основе граничных условий Дирихле и Неймана, мы можем решить для напряжений в каждой вершине <code>V</code> .
zh_cn: 该系统矩阵就像电导率 <code>S</code> 的欧姆定律 <code>S * V = I</code> 。基于Dirichlet和Neumann边界条件，我们能够求解每个顶点 <code>V</code> 的电压。

source: The tab width is specified by <var>tw</var>, and defaults to eight.
es: El ancho de la pesta&ntilde;a se especifica mediante <var>tw</var> y el valor predeterminado es ocho.
ru: Ширина табуляции задается <var>tw</var> и по умолчанию равна восьми.
zh_cn: 制表符宽度由 <var>tw</var> 指定，默认为8。

source: The table below lists all of the sparse functions of Octave. Note that the names of the specific sparse forms of the functions are typically the same as the general versions with a <em>sp</em> prefix. In the table below, and in the rest of this article, the specific sparse versions of functions are used.
es: La siguiente tabla enumera todas las funciones dispersas de Octave. Tenga en cuenta que los nombres de las formas dispersas espec&iacute;ficas de las funciones suelen ser los mismos que los de las versiones generales con un prefijo <em>sp</em> . En la siguiente tabla, y en el resto de este art&iacute;culo, se utilizan las versiones dispersas espec&iacute;ficas de funciones.
ru: В таблице ниже перечислены все редкие функции Octave. Обратите внимание, что имена конкретных разреженных форм функций обычно совпадают с именами общих версий с префиксом <em>sp</em> . В таблице ниже и в остальной части этой статьи используются конкретные разреженные версии функций.
zh_cn: 下表列出了Octave的所有稀疏函数。请注意，函数的特定稀疏形式的名称通常与带有<em>sp</em>前缀的常规版本的名称相同。在下表以及本文的其余部分中，将使用特定的稀疏函数版本。

source: The table can be customized to display more or less information through the function <code>whos_line_format</code>.
es: La tabla se puede personalizar para mostrar m&aacute;s o menos informaci&oacute;n a trav&eacute;s de la funci&oacute;n <code>whos_line_format</code> .
ru: Таблицу можно настроить для отображения большего или меньшего количества информации с помощью функции <code>whos_line_format</code> .
zh_cn: 可以通过 <code>whos_line_format</code> 函数自定义表以显示更多或更少的信息。

source: The text is defined by the string <var>s</var>. If <var>s</var> is a cell string organized as a row vector then each string of the cell array is written to a separate line. If <var>s</var> is organized as a column vector then one string element of the cell array is placed for every mouse click.
es: El texto est&aacute; definido por la cadena <var>s</var> . Si <var>s</var> es una cadena de celdas organizada como un vector de fila, entonces cada cadena de la matriz de celdas se escribe en una l&iacute;nea separada. Si <var>s</var> est&aacute; organizado como un vector de columna, entonces se coloca un elemento de cadena de la matriz de celdas por cada clic del mouse.
ru: Текст определяется строкой <var>s</var> . Если <var>s</var> - это строка ячеек, организованная как вектор-строка, тогда каждая строка массива ячеек записывается в отдельную строку. Если <var>s</var> организован как вектор-столбец, то для каждого щелчка мыши помещается один строковый элемент массива ячеек.
zh_cn: 文本由字符串 <var>s</var> 定义。如果 <var>s</var> 是组织为行向量的单元格字符串，则将单元格数组的每个字符串写入单独的行。如果将 <var>s</var> 组织为列向量，则每次单击鼠标都会放置一个单元格数组的字符串元素。

source: The text object string content.
es: El contenido de la cadena de objetos de texto.
ru: Содержание строки текстового объекта.
zh_cn: 文本对象的字符串内容。

source: The text of the last error message
es: El texto del último mensaje de error
ru: Текст последнего сообщения об ошибке
zh_cn: 最后一条错误信息的文本

source: The third and fourth arguments <var>g</var> and <var>h</var> are function handles pointing to functions that compute the equality constraints and the inequality constraints, respectively. If the problem does not have equality (or inequality) constraints, then use an empty matrix ([]) for <var>g</var> (or <var>h</var>). When supplied, these equality and inequality constraint functions must accept one vector argument and return a vector.
es: El tercer y cuarto argumentos <var>g</var> y <var>h</var> son las manijas de funci&oacute;n que apuntan a las funciones que calculan las restricciones de igualdad y desigualdad de las limitaciones, respectivamente. Si el problema no tiene restricciones de igualdad (o desigualdad), utilice una matriz vac&iacute;a ([]) para <var>g</var> ( <var>h</var> ). Cuando se proporcionan, estas funciones de restricci&oacute;n de igualdad y desigualdad deben aceptar un argumento de vector y devolver un vector.
ru: Третий и четвертый аргументы <var>g</var> и <var>h</var> являются дескрипторами функций, указывающими на функции, которые вычисляют ограничения равенства и ограничения неравенства соответственно. Если проблема не имеет ограничений равенства (или неравенства), используйте пустую матрицу ([]) для <var>g</var> (или <var>h</var> ). При поставке эти функции ограничения равенства и неравенства должны принимать один аргумент вектора и возвращать вектор.
zh_cn: 第三和第四自变量 <var>g</var> 和 <var>h</var> 是指向分别计算等式约束和不等式约束的函数的函数句柄。如果问题没有等式（或不等式）约束，则将空矩阵（[]）用于 <var>g</var> （或 <var>h</var> ）。提供时，这些相等和不相等约束函数必须接受一个向量参数并返回一个向量。

source: The third and fourth arguments may also be 2-element cell arrays of function handles. The first element should point to the constraint function and the second should point to a function that computes the gradient of the constraint function:
es: El tercer y cuarto argumento pueden ser también conjuntos de células de dos elementos de manejos de funciones.El primer elemento debe apuntar a la función de restricción y el segundo debe apuntar a una función que compute el gradiente de la función de restricción:
ru: Третьим и четвертым аргументами также могут быть 2-элементные ячейки массивов дескрипторов функций.Первый элемент должен указывать на функцию ограничения,а второй-на функцию,которая вычисляет градиент функции ограничения:
zh_cn: 第三个和第四个参数也可以是函数句柄的2元素单元格数组,第一个元素应该指向约束函数,第二个元素应该指向计算约束函数梯度的函数。第一个元素应该指向约束函数,第二个元素应该指向计算约束函数梯度的函数。

source: The third and fourth arguments to <code>dasrt</code> specify the initial condition of the states and their derivatives, and the fourth argument specifies a vector of output times at which the solution is desired, including the time corresponding to the initial condition.
es: Los argumentos tercero y cuarto de <code>dasrt</code> especifican la condici&oacute;n inicial de los estados y sus derivadas, y el cuarto argumento especifica un vector de tiempos de salida en los que se desea la soluci&oacute;n, incluido el tiempo correspondiente a la condici&oacute;n inicial.
ru: Третий и четвертый аргументы <code>dasrt</code> определяют начальное состояние состояний и их производных, а четвертый аргумент задает вектор времени вывода, при котором требуется решение, включая время, соответствующее начальному условию.
zh_cn: <code>dasrt</code> 的第三个和第四个参数指定状态及其导数的初始条件，第四个参数指定所需解的输出时间向量，包括对应于初始条件的时间。

source: The third and most general form of the <code>if</code> statement allows multiple decisions to be combined in a single statement. It looks like this:
es: La tercera y m&aacute;s general forma del enunciado <code>if</code> permite combinar varias decisiones en un solo enunciado. Se parece a esto:
ru: Третья и наиболее общая форма оператора <code>if</code> позволяет объединить несколько решений в одном операторе. Выглядит это так:
zh_cn: <code>if</code> 语句的第三种也是最通用的形式，是允许将多个决策合并到一个语句中。看起来像这样：

source: The third argument is also optional and defines the plane of the rotation. If present, <var>plane</var> is a two element vector containing two different valid dimensions of the matrix. When <var>plane</var> is not given the first two non-singleton dimensions are used.
es: El tercer argumento tambi&eacute;n es opcional y define el plano de la rotaci&oacute;n. Si est&aacute; presente, el <var>plane</var> es un vector de dos elementos que contiene dos dimensiones v&aacute;lidas diferentes de la matriz. Cuando no se proporciona el <var>plane</var> se utilizan las dos primeras dimensiones que no son singleton.
ru: Третий аргумент также является необязательным и определяет плоскость вращения. Если присутствует, <var>plane</var> - это двухэлементный вектор, содержащий два разных действительных размера матрицы. Если <var>plane</var> не указана, используются первые два не одноэлементных размера.
zh_cn: 第三个参数也是可选的，它定义旋转平面。如果存在， <var>plane</var> 是一个包含两个不同有效矩阵尺寸的两元素向量。如果未指定 <var>plane</var> 则使用前两个非单尺寸。

source: The third calling form of <code>drawnow</code> is for debugging and is undocumented.
es: La tercera forma de <code>drawnow</code> de drawnow es para depurar y no est&aacute; documentada.
ru: Третья форма вызова <code>drawnow</code> предназначена для отладки и не документирована.
zh_cn: <code>drawnow</code> 的第三种调用形式是用于调试且未记录。

source: The third form of the <code>fopen</code> function returns information about the open file given its file id.
es: La tercera forma de la funci&oacute;n <code>fopen</code> devuelve informaci&oacute;n sobre el archivo abierto dado su ID de archivo.
ru: Третья форма функции <code>fopen</code> возвращает информацию об открытом файле с учетом его идентификатора файла.
zh_cn: <code>fopen</code> 函数的第三种形式在给定文件ID的情况下返回有关打开文件的信息。

source: The third optional argument <var>opt</var> controls the behavior of the dialog. See <code>msgbox</code> for details.
es: El tercer argumento opcional <var>opt</var> controla el comportamiento del di&aacute;logo. Consulte <code>msgbox</code> para obtener m&aacute;s detalles.
ru: Третий необязательный аргумент <var>opt</var> управляет поведением диалога. Подробности смотрите в <code>msgbox</code> .
zh_cn: 第三个可选参数 <var>opt</var> 控制对话框的行为。有关详细信息，请参见 <code>msgbox</code> 。

source: The third output <var>exitflag</var> reports whether the algorithm succeeded and may take one of the following values:
es: El tercer <var>exitflag</var> salida de salida informa si el algoritmo tuvo &eacute;xito y puede tomar uno de los siguientes valores:
ru: Третий выходной <var>exitflag</var> выхода сообщает об успешном выполнении алгоритма и может принимать одно из следующих значений:
zh_cn: 第三个输出 <var>exitflag</var> 报告算法是否成功，并且可以采用以下值之一：

source: The third output <var>info</var> reports whether the algorithm succeeded and may take one of the following values:
es: La tercera <var>info</var> rmaci&oacute;n de salida informa si el algoritmo tuvo &eacute;xito y puede tomar uno de los siguientes valores:
ru: Третья <var>info</var> о выходе сообщает, успешно ли алгоритм, и может принимать одно из следующих значений:
zh_cn: 第三个输出 <var>info</var> 报告算法是否成功，并且可以采用以下值之一：

source: The third output, <var>j</var>, has not been implemented yet when the sort order is <code>"stable"</code>.
zh_cn: 当排序顺序为 <code>"stable"</code> 时，尚未实现第三输出 <var>j</var> 。

source: The third way to create structures is the <code>struct</code> command. <code>struct</code> takes pairs of arguments, where the first argument in the pair is the fieldname to include in the structure and the second is a scalar or cell array, representing the values to include in the structure or structure array. For example:
es: La tercera forma de crear estructuras es el comando <code>struct</code> . <code>struct</code> toma pares de argumentos, donde el primer argumento del par es el nombre del campo a incluir en la estructura y el segundo es un escalar o matriz de celdas, que representa los valores a incluir en la estructura o matriz de estructura. Por ejemplo:
ru: Третий способ создания структур - это команда <code>struct</code> . <code>struct</code> принимает пары аргументов, где первый аргумент в паре - это имя поля, которое нужно включить в структуру, а второй - скаляр или массив ячеек, представляющий значения для включения в структуру или массив структур. Например:
zh_cn: 创建结构的第三种方法是 <code>struct</code> 命令。 <code>struct</code> 接受参数对，其中对中的第一个参数是要包含在结构中的字段名，第二个是标量或单元格数组，表示要包含在结构或结构数组中的值。例如：

source: The time complexity of the expression <em>O(a*n^p)</em>. This is a structure with fields <code>a</code> and <code>p</code>.
es: La complejidad temporal de la expresi&oacute;n <em>O (a * n ^ p)</em> . Se trata de una estructura con campos <code>a</code> y <code>p</code> .
ru: Временная сложность выражения <em>O (a * n ^ p)</em> . Это структура с полями <code>a</code> и <code>p</code> .
zh_cn: 表达式<em>O（a * n ^ p）</em>的时间复杂度。这是具有字段 <code>a</code> 和 <code>p</code> 的结构。

source: The time.
es: La hora.
ru: Время.
zh_cn: 时候。

source: The title of the dialog window can be changed using the last argument <var>title</var>.
zh_cn: 对话框窗口的标题可以使用最后一个参数 <var>title</var> 进行更改。

source: The title of the image as defined by the Exif standard.
es: El título de la imagen como se define en la norma Exif.
ru: Название изображения в соответствии со стандартом Exif.
zh_cn: 由Exif标准定义的图像标题。

source: The tolerance <var>tol</var> defaults to <code>sqrt (eps)</code>.
es: La tolerancia <var>tol</var> est&aacute; predeterminada en <code>sqrt (eps)</code> .
ru: Допуск <var>tol</var> по умолчанию равен <code>sqrt (eps)</code> .
zh_cn: 公差 <var>tol</var> 默认为 <code>sqrt (eps)</code> 。

source: The top level of the hierarchy and the parent of all figure objects. Use <code>groot</code> to obtain the handle of the root graphics object.
es: El nivel superior de la jerarqu&iacute;a y el padre de todos los objetos de figura. Utilice <code>groot</code> para obtener el identificador del objeto gr&aacute;fico ra&iacute;z.
ru: Верхний уровень иерархии и родитель всех фигурных объектов. Используйте <code>groot</code> , чтобы получить дескриптор корневого графического объекта.
zh_cn: 层次结构的顶层和所有图形对象的父级。使用 <code>groot</code> 获取根图形对象的句柄。

source: The total number of elements in the matrix or array.
es: El número total de elementos en la matriz o conjunto.
ru: Общее количество элементов в матрице или массиве.
zh_cn: 矩阵或数组中元素的总数。

source: The total number of returned values is the product of the number of elements returned for each index component. In the example above, the total is 2*1*1 = 2 elements.
es: El número total de valores devueltos es el producto del número de elementos devueltos para cada componente del índice.En el ejemplo anterior,el total es 2*1*1=2 elementos.
ru: Общее количество возвращаемых значений является произведением количества элементов,возвращаемых для каждого компонента индекса.В приведенном выше примере общее количество составляет 2*1*1=2 элемента.
zh_cn: 返回值的总数是每个索引组件返回的元素数的乘积。在上面的例子中,总数是2*1*1=2个元素。

source: The trust region radius became excessively small.
es: El radio de la región de confianza se hizo excesivamente pequeño.
ru: Радиус зоны доверия стал слишком мал.
zh_cn: 信任区域半径变得过小。

source: The truth table for the xor operation is
es: La tabla de verdad para la operación xor es
ru: Таблица правды для операции xor
zh_cn: xor操作的真值表是

source: The try Statement
es: La declaración de prueba
ru: Заявление о попытке
zh_cn: 尝试声明

source: The tubes are colored based on the local vector field strength.
zh_cn: 管子的颜色是基于当地矢量场强度的。

source: The two basic reasons to use sparse matrices are to reduce the memory usage and to not have to do calculations on zero elements. The two are closely related in that the computation time on a sparse matrix operator or function is roughly linear with the number of nonzero elements.
es: Las dos razones básicas para utilizar matrices escasas son reducir el uso de la memoria y no tener que hacer cálculos sobre elementos cero.Ambas están estrechamente relacionadas en el sentido de que el tiempo de cálculo en un operador o función de matriz dispersa es aproximadamente lineal con el número de elementos que no son cero.
ru: Две основные причины использования разреженных матриц-это уменьшение использования памяти и отсутствие необходимости делать вычисления по нулевым элементам.Эти две причины тесно связаны в том,что время вычислений на разреженных матрицах оператора или функции грубо линейно с числом ненулевых элементов.
zh_cn: 使用稀疏矩阵的两个基本原因是减少内存的使用量和不必对零元素进行计算。这两者密切相关,因为稀疏矩阵算子或函数的计算时间与非零元素的数量大致呈线性关系。

source: The two definitions are related, for positive real values of <var>x</var>, by <code>E_1&nbsp;(-x)&nbsp;=&nbsp;-Ei&nbsp;(x)&nbsp;-&nbsp;i*pi</code>.
es: Las dos definiciones est&aacute;n relacionadas, para valores reales positivos de <var>x</var> , por <code>E_1&nbsp;(-x)&nbsp;=&nbsp;-Ei&nbsp;(x)&nbsp;-&nbsp;i*pi</code> .
ru: Два определения связаны для положительных вещественных значений <var>x</var> соотношением <code>E_1&nbsp;(-x)&nbsp;=&nbsp;-Ei&nbsp;(x)&nbsp;-&nbsp;i*pi</code> .
zh_cn: 两种定义是相关的，为的正实值 <var>x</var> ，由 <code>E_1&nbsp;(-x)&nbsp;=&nbsp;-Ei&nbsp;(x)&nbsp;-&nbsp;i*pi</code> 。

source: The type of machine you are using, and the operating system name and version number.
es: El tipo de máquina que está usando,y el nombre del sistema operativo y el número de versión.
ru: Тип используемой машины,а также название и номер версии операционной системы.
zh_cn: 你使用的机器类型,以及操作系统名称和版本号。

source: The type of symmetry to check may be specified with the additional input <code>"nonskew"</code> (default) for regular Hermitian or <code>"skew"</code> for skew-Hermitian.
es: El tipo de simetr&iacute;a a verificar se puede especificar con la entrada adicional <code>"nonskew"</code> (predeterminado) para Hermitian regular o <code>"skew"</code> para skew-Hermitian.
ru: Тип симметрии для проверки может быть указан с дополнительным вводом <code>"nonskew"</code> (по умолчанию) для обычного эрмитова или <code>"skew"</code> для косоэрмитова.
zh_cn: 可以使用常规Hermitian 的附加输入 <code>"nonskew"</code> （默认）或 <code>"skew"</code> skew-Hermitian &rdquo;的&ldquo; skew&rdquo;来指定要检查的对称类型。

source: The type of symmetry to check may be specified with the additional input <code>"nonskew"</code> (default) for regular symmetry or <code>"skew"</code> for skew-symmetry.
es: El tipo de simetr&iacute;a a comprobar se puede especificar con la entrada adicional <code>"nonskew"</code> (predeterminado) para la simetr&iacute;a regular o <code>"skew"</code> para la simetr&iacute;a sesgada.
ru: Тип симметрии для проверки может быть указан с дополнительным вводом <code>"nonskew"</code> (по умолчанию) для регулярной симметрии или <code>"skew"</code> для кососимметрии.
zh_cn: 可以使用附加输入 <code>"nonskew"</code> （默认值）（用于常规对称）或 <code>"skew"</code> 用于倾斜对称）来指定要检查的对称类型。

source: The type of uicontrol created is specified by the <var>style</var> property. If no style property is provided, a push button will be created.
es: El tipo de uicontrol creado se especifica mediante la propiedad de <var>style</var> . Si no se proporciona ninguna propiedad de estilo, se crear&aacute; un pulsador.
ru: Тип создаваемого uicontrol определяется свойством <var>style</var> . Если свойство стиля не указано, будет создана кнопка.
zh_cn: 所创建的uicontrol的类型由 <var>style</var> 属性指定。如果未提供样式属性，则将创建一个按钮。

source: The types and values of the input parameters <var>t</var> and <var>y</var> depend on the input <var>flag</var> that is of type string. Valid values of <var>flag</var> are:
es: Los tipos y los valores de los par&aacute;metros de entrada <var>t</var> y <var>y</var> dependen de la entrada <var>flag</var> que es de tipo cadena. Los valores v&aacute;lidos de <var>flag</var> son:
ru: Типы и значения входных параметров <var>t</var> и <var>y</var> зависят от <var>flag</var> ввода, который имеет тип string. Допустимые значения <var>flag</var> :
zh_cn: 输入参数 <var>t</var> 和 <var>y</var> 的类型和值取决于string类型的输入 <var>flag</var> 。 <var>flag</var> 有效值为：
