Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/octave/octave.*.011.xlf
Languages: es, ja, ru, zh_cn

source: Another typical sparse matrix that is often needed is a random distribution of random elements. The functions <em>sprand</em> and <em>sprandn</em> perform this for uniform and normal random distributions of elements. They have exactly the same calling convention, where <code>sprand (<var>r</var>, <var>c</var>, <var>d</var>)</code>, creates an <var>r</var>-by-<var>c</var> sparse matrix with a density of filled elements of <var>d</var>.
es: Otra matriz dispersa t&iacute;pica que a menudo se necesita es una distribuci&oacute;n aleatoria de elementos aleatorios. Las funciones <em>sprand</em> y <em>sprandn</em> realizan esto para distribuciones aleatorias uniformes y normales de elementos. Tienen exactamente la misma convenci&oacute;n de llamada, donde <code>sprand (<var>r</var>, <var>c</var>, <var>d</var>)</code> , crea una matriz dispersa <var>r</var> - por- <var>c</var> con una densidad de elementos rellenos de <var>d</var> .
ja: しばしば必要となるもう1つの典型的なスパース行列は、ランダム要素のランダム分布です。関数<em>sprand</em>および<em>sprandnは</em>、これを要素の均一および正規のランダム分布に対して実行します。それらは正確に同じ呼び出し規約有する <code>sprand (<var>r</var>, <var>c</var>, <var>d</var>)</code> 、作成 <var>r</var> 行列 <var>c</var> の充填要素の密度が疎な行列 <var>d</var> 。
ru: Еще одна типичная разреженная матрица, которая часто требуется, - это случайное распределение случайных элементов. Функции <em>sprand</em> и <em>sprandn</em> выполняют это для равномерного и нормального случайного распределения элементов. У них точно такое же соглашение о вызовах, где <code>sprand (<var>r</var>, <var>c</var>, <var>d</var>)</code> создает разреженную матрицу размером <var>r</var> на <var>c</var> с плотностью заполненных элементов <var>d</var> .
zh_cn: 通常需要的另一个典型的稀疏矩阵是随机元素的随机分布。<em>sprand</em>和<em>sprandn</em>函数执行此操作以使元素均匀且正态随机分布。它们具有完全相同的调用约定，其中 <code>sprand (<var>r</var>, <var>c</var>, <var>d</var>)</code> 创建一个密度为 <var>d</var> 的 <var>r</var> - by- <var>c</var> 稀疏矩阵。

source: Another use of the hashing function is to check for file integrity. The user can check the hash of the file against a known value and find if the file they have is the same as the one that the original hash was produced with.
es: Otro uso de la función de hashing es comprobar la integridad de los archivos.El usuario puede comprobar el hash del archivo con un valor conocido y encontrar si el archivo que tiene es el mismo con el que se produjo el hash original.
ja: ハッシュ関数のもう一つの用途は、ファイルの整合性をチェックすることです。ユーザーはファイルのハッシュを既知の値と照合して、元のハッシュが生成されたものと同じかどうかを調べます。
ru: Другое использование функции хэширования-проверка целостности файла.Пользователь может проверить хэш файла по известному значению и выяснить,совпадает ли файл,который у него есть,с оригинальным хэшем,который был создан.
zh_cn: 散列函数的另一个用途是检查文件的完整性。用户可以根据已知值检查文件的哈希值,发现他们所拥有的文件是否与原始哈希值产生的文件相同。

source: Another very basic function is <em>nnz</em> that returns the number of nonzero entries there are in a sparse matrix, while the function <em>nzmax</em> returns the amount of storage allocated to the sparse matrix. Note that Octave tends to crop unused memory at the first opportunity for sparse objects. There are some cases of user created sparse objects where the value returned by <em>nzmax</em> will not be the same as <em>nnz</em>, but in general they will give the same result. The function <em>spstats</em> returns some basic statistics on the columns of a sparse matrix including the number of elements, the mean and the variance of each column.
es: Otra funci&oacute;n muy b&aacute;sica es <em>nnz</em> que devuelve el n&uacute;mero de entradas distintas de cero que hay en una matriz dispersa, mientras que la funci&oacute;n <em>nzmax</em> devuelve la cantidad de almacenamiento asignado a la matriz dispersa. Tenga en cuenta que Octave tiende a recortar la memoria no utilizada a la primera oportunidad para objetos dispersos. Hay algunos casos de objetos dispersos creados por el usuario donde el valor devuelto por <em>nzmax</em> no ser&aacute; el mismo que <em>nnz</em> , pero en general dar&aacute;n el mismo resultado. La funci&oacute;n <em>spstats</em> devuelve algunas estad&iacute;sticas b&aacute;sicas sobre las columnas de una matriz dispersa, incluido el n&uacute;mero de elementos, la media y la varianza de cada columna.
ja: もう1つの非常に基本的な関数は、疎行列にあるゼロ以外のエントリの数を返す<em>nnz</em>ですが、関数<em>nzmax</em>は疎行列に割り当てられたストレージの量を返します。 Octaveはスパースオブジェクトの最初の機会に未使用のメモリをトリミングする傾向があることに注意してください。で返される値は、スパースオブジェクト作成したユーザーのいくつかの例があります<em>nzmaxは</em>同じではありません<em>NNZ</em>が、一般的に、彼らは同じ結果が得られますが。関数<em>spstats</em>は、要素の数、各列の平均および分散を含む疎行列の列に関するいくつかの基本的な統計を返します。
ru: Еще одна очень простая функция - это <em>nnz,</em> которая возвращает количество ненулевых записей в разреженной матрице, а функция <em>nzmax</em> возвращает объем памяти, выделенный разреженной матрице. Обратите внимание, что Octave имеет тенденцию обрезать неиспользуемую память при первой возможности для разреженных объектов. Бывают случаи, когда пользователь создает разреженные объекты, когда значение, возвращаемое <em>nzmax</em> , не будет таким же, как <em>nnz</em> , но в целом они дадут тот же результат. Функция <em>spstats</em> возвращает некоторую базовую статистику по столбцам разреженной матрицы, включая количество элементов, среднее значение и дисперсию каждого столбца.
zh_cn: 另一个非常基本的函数是<em>nnz</em>，它返回稀疏矩阵中存在的非零条目数，而函数<em>nzmax</em>返回分配给稀疏矩阵的存储量。请注意，Octave倾向于在稀疏对象的第一个机会时裁剪未使用的内存。在某些情况下，用户创建的稀疏对象的情况下，<em>nzmax</em>返回的值将与<em>nnz不同</em>，但通常它们将给出相同的结果。函数<em>spstats</em>返回有关稀疏矩阵列的一些基本统计信息，包括元素数，每列的均值和方差。

source: Another way to add files to the <var>dynamic classpath</var> exclusively for your user account is to use the file
es: Otra forma de agregar archivos a la <var>dynamic classpath</var> exclusivamente para su cuenta de usuario es usar el archivo
ja: ユーザーアカウント専用の <var>dynamic classpath</var> ファイルを追加する別の方法は、ファイルを使用することです
ru: Другой способ добавить файлы в <var>dynamic classpath</var> путь к классам исключительно для вашей учетной записи - использовать файл
zh_cn: 将文件专门添加到您的用户帐户的 <var>dynamic classpath</var> 另一种方法是使用文件

source: Any <var>y</var> values that use a window extending beyond the original data array are deleted. For example, with a 10-element data vector and a window of length 3, the output will contain only 8 elements. The first element would require calculating the function over indices <code>[0,&nbsp;1,&nbsp;2]</code> and is therefore discarded. The last element would require calculating the function over indices <code>[9,&nbsp;10,&nbsp;11]</code> and is therefore discarded.
es: Se eliminan todos los valores <var>y</var> que utilicen una ventana que se extienda m&aacute;s all&aacute; de la matriz de datos original. Por ejemplo, con un vector de datos de 10 elementos y una ventana de longitud 3, la salida contendr&aacute; solo 8 elementos. El primer elemento requerir&iacute;a calcular la funci&oacute;n sobre &iacute;ndices <code>[0,&nbsp;1,&nbsp;2]</code> y, por lo tanto, se descarta. El &uacute;ltimo elemento requerir&iacute;a calcular la funci&oacute;n sobre &iacute;ndices <code>[9,&nbsp;10,&nbsp;11]</code> y, por lo tanto, se descarta.
ja: 元のデータ配列を超えるウィンドウを使用する <var>y</var> 値はすべて削除されます。たとえば、10要素のデータベクトルと長さ3のウィンドウの場合、出力には8要素しか含まれません。最初の要素は、インデックス <code>[0,&nbsp;1,&nbsp;2]</code> 関数を計算する必要があるため、破棄されます。最後の要素は、インデックス <code>[9,&nbsp;10,&nbsp;11]</code> 関数を計算する必要があるため、破棄されます。
ru: Любые значения <var>y</var> , которые используют окно, выходящее за пределы исходного массива данных, удаляются. Например, с вектором данных с 10 элементами и окном длиной 3, вывод будет содержать только 8 элементов. Первый элемент потребует вычисления функции по индексам <code>[0,&nbsp;1,&nbsp;2]</code> и поэтому отбрасывается. Последний элемент потребовал бы вычисления функции по индексам <code>[9,&nbsp;10,&nbsp;11]</code> и поэтому отбрасывается.
zh_cn: 使用窗口超出原始数据数组的所有 <var>y</var> 值都将被删除。例如，对于一个包含10个元素的数据矢量和一个长度为3的窗口，输出将仅包含8个元素。第一个元素将需要计算索引为 <code>[0,&nbsp;1,&nbsp;2]</code> 的函数，因此将其丢弃。最后一个元素将需要根据索引 <code>[9,&nbsp;10,&nbsp;11]</code> 计算函数，因此将其丢弃。

source: Any Octave function can be overloaded, and this allows an object-specific version of a function to be called as needed. A pertinent example for the polynomial class might be to overload the <code>polyval</code> function.
es: Cualquier funci&oacute;n de Octave se puede sobrecargar, y esto permite que se llame a una versi&oacute;n espec&iacute;fica de objeto de una funci&oacute;n seg&uacute;n sea necesario. Un ejemplo pertinente para la clase polinomial podr&iacute;a ser sobrecargar la funci&oacute;n <code>polyval</code> .
ja: Octave関数はオーバーロードすることができ、これにより、必要に応じてオブジェクト固有の関数バージョンを呼び出すことができます。多項式クラスの適切な例は、 <code>polyval</code> 関数をオーバーロードすることです。
ru: Любая функция Octave может быть перегружена, и это позволяет при необходимости вызывать объектно-ориентированную версию функции. Подходящим примером для класса полиномов может быть перегрузка функции <code>polyval</code> .
zh_cn: 任何Octave函数都可以重载，这允许根据需要调用函数的特定于对象的版本。多项式类的一个相关示例可能是重载 <code>polyval</code> 函数。

source: Any additional arguments are passed directly to <var>func</var>. The total number of arguments to call <var>func</var> with can be passed in <var>ntot</var>; by default <var>ntot</var> is <var>n</var>. The input <var>n</var> can also be a vector of indices of the output, in which case the output will be a cell array of the requested output arguments.
es: Cualquier argumento adicional se pasa directamente a <var>func</var> . El n&uacute;mero total de argumentos para llamar a <var>func</var> se puede pasar en <var>ntot</var> ; por defecto, <var>ntot</var> es <var>n</var> . La entrada <var>n</var> tambi&eacute;n puede ser un vector de &iacute;ndices de la salida, en cuyo caso la salida ser&aacute; una matriz de celdas de los argumentos de salida solicitados.
ja: 追加の引数は直接 <var>func</var> に渡されます。 <var>func</var> を呼び出す引数の総数は <var>ntot</var> で渡すことができます。デフォルトでは、 <var>ntot</var> は <var>n</var> です。入力 <var>n</var> は出力のインデックスのベクトルにすることもできます。その場合、出力は要求された出力引数のセル配列になります。
ru: Любые дополнительные аргументы передаются напрямую в <var>func</var> . Общее количество аргументов для вызова <var>func</var> может быть передано в <var>ntot</var> ; по умолчанию <var>ntot</var> равно <var>n</var> . Вход <var>n</var> также может быть вектором индексов выхода, и в этом случае выходом будет массив ячеек запрошенных выходных аргументов.
zh_cn: 任何其他参数都直接传递给 <var>func</var> 。调用 <var>func</var> 所使用的参数总数可以在 <var>ntot</var> 中传递；默认情况下， <var>ntot</var> 为 <var>n</var> 。输入 <var>n</var> 也可以是输出索引的向量，在这种情况下，输出将是所请求输出参数的单元格数组。

source: Any additional arguments are passed to the <code>error</code> function for processing.
es: Cualquier argumento adicional se pasa a la funci&oacute;n de <code>error</code> para su procesamiento.
ja: 追加の引数は、処理のために <code>error</code> 関数に渡されます。
ru: Любые дополнительные аргументы передаются функции <code>error</code> для обработки.
zh_cn: 任何其他参数都将传递给 <code>error</code> 函数进行处理。

source: Any arguments after the first are passed as inputs to the named function. For example,
es: Cualquier argumento después del primero se pasa como entrada a la función nombrada.Por ejemplo,
ja: 最初の引数以降の引数は、指定された関数の入力として渡されます。例えば、以下のようになります。
ru: Любые аргументы после первого передаются как входы в именованную функцию.Например,
zh_cn: 第一个参数之后的任何参数都会作为输入传递给命名的函数。例如:

source: Any arguments which follow <var>x0</var> are treated as parameters, and passed in an appropriate manner to any of the functions (<var>Afun</var> or <var>Mfun</var>) or that have been given to <code>bicg</code>.
es: Los argumentos que siguen a <var>x0</var> se tratan como par&aacute;metros y se pasan de forma adecuada a cualquiera de las funciones ( <var>Afun</var> o <var>Mfun</var> ) o que se hayan dado a <code>bicg</code> .
ja: 続く引数 <var>x0</var> 関数（のいずれかにパラメータとして扱われ、適切な方法で渡される <var>Afun</var> または <var>Mfun</var> に与えられているか） <code>bicg</code> 。
ru: Любые аргументы, следующие за <var>x0</var> , рассматриваются как параметры и передаются соответствующим образом любой из функций ( <var>Afun</var> или <var>Mfun</var> ) или функции, которые были переданы <code>bicg</code> .
zh_cn: 跟随 <var>x0</var> 的任何参数都被视为参数，并以适当的方式传递给任何函数（ <var>Afun</var> 或 <var>Mfun</var> ）或已提供给 <code>bicg</code> 的函数。

source: Any bound (<var>A</var>, <var>b</var>, <var>lb</var>, <var>ub</var>, <var>A_in</var>, <var>A_lb</var>, <var>A_ub</var>) may be set to the empty matrix (<code>[]</code>) if not present. The constraints <var>A</var> and <var>A_in</var> are matrices with each row representing a single constraint. The other bounds are scalars or vectors depending on the number of constraints. The algorithm is faster if the initial guess is feasible.
es: Cualquier l&iacute;mite ( <var>A</var> , <var>b</var> , <var>lb</var> , <var>ub</var> , <var>A_in</var> , <var>A_lb</var> , <var>A_ub</var> ) se puede establecer en la matriz vac&iacute;a ( <code>[]</code> ) si no est&aacute; presente. Las restricciones <var>A</var> y <var>A_in</var> son matrices y cada fila representa una sola restricci&oacute;n. Los otros l&iacute;mites son escalares o vectores dependiendo del n&uacute;mero de restricciones. El algoritmo es m&aacute;s r&aacute;pido si la suposici&oacute;n inicial es factible.
ja: 存在しない場合は、任意の境界（ <var>A</var> 、 <var>b</var> 、 <var>lb</var> 、 <var>ub</var> 、 <var>A_in</var> 、 <var>A_lb</var> 、 <var>A_ub</var> ）を空の行列（ <code>[]</code> ）に設定できます。制約 <var>A</var> および <var>A_in</var> は、各行が単一の制約を表す行列です。その他の境界は、制約の数に応じてスカラーまたはベクトルです。初期推測が可能であれば、アルゴリズムはより高速です。
ru: Любая граница ( <var>A</var> , <var>b</var> , <var>lb</var> , <var>ub</var> , <var>A_in</var> , <var>A_lb</var> , <var>A_ub</var> ) может быть установлена ​​в пустую матрицу ( <code>[]</code> ), если отсутствует. Ограничения <var>A</var> и <var>A_in</var> представляют собой матрицы, каждая строка которых представляет одно ограничение. Остальные границы - скаляры или векторы, в зависимости от количества ограничений. Алгоритм работает быстрее, если первоначальное предположение осуществимо.
zh_cn: 如果不存在任何边界（ <var>A</var> ， <var>b</var> ， <var>lb</var> ， <var>ub</var> ， <var>A_in</var> ， <var>A_lb</var> ， <var>A_ub</var> ），则可以将其设置为空矩阵（ <code>[]</code> ）。约束 <var>A</var> 和 <var>A_in</var> 是矩阵，每行代表一个约束。其他边界是标量或向量，具体取决于约束的数量。如果初始猜测可行，则该算法速度更快。

source: Any character in <var>value</var> will be interpreted as whitespace and trimmed; The default value for whitespace is <code>" \b\r\n\t"</code> (note the space). Unless whitespace is set to <code>""</code> (empty) AND at least one <code>"%s"</code> format conversion specifier is supplied, a space is always part of whitespace.
es: Cualquier car&aacute;cter de <var>value</var> se interpretar&aacute; como un espacio en blanco y se recortar&aacute;; El valor predeterminado para los espacios en blanco es <code>" \b\r\n\t"</code> (observe el espacio). A menos que el espacio en blanco est&eacute; establecido en <code>""</code> (vac&iacute;o) Y se proporcione al menos un especificador de conversi&oacute;n de formato <code>"%s"</code> , un espacio siempre es parte del espacio en blanco.
ja: <var>value</var> 文字はすべて空白として解釈され、削除されます。空白のデフォルト値は <code>" \b\r\n\t"</code> （スペースに注意）です。空白が <code>""</code> （空）に設定され、かつ少なくとも1つの <code>"%s"</code> 形式変換指定子が指定されていない限り、スペースは常に空白の一部です。
ru: Любой символ в <var>value</var> будет интерпретирован как пробел и обрезан; Значение по умолчанию для пробелов - <code>" \b\r\n\t"</code> (обратите внимание на пробел). Если пробел не установлен в <code>""</code> (пустой) И не указан хотя бы один спецификатор преобразования формата <code>"%s"</code> , пробел всегда является частью пробела.
zh_cn: <var>value</var> 任何字符都将被解释为空格并进行修剪；空格的默认值为 <code>" \b\r\n\t"</code> （注意空格）。除非将空格设置为 <code>""</code> （空），并且至少提供一个 <code>"%s"</code> 格式转换说明符，否则空格始终是空格的一部分。

source: Any character in <var>value</var> will be interpreted as whitespace and trimmed; the string defining whitespace must be enclosed in double quotes for proper processing of special characters like <code>"\t"</code>. In each data field, multiple consecutive whitespace characters are collapsed into one space and leading and trailing whitespace is removed. The default value for whitespace is <code>" \b\r\n\t"</code> (note the space). Whitespace is always added to the set of delimiter characters unless at least one <code>"%s"</code> format conversion specifier is supplied; in that case only whitespace explicitly specified in <code>"delimiter"</code> is retained as delimiter and removed from the set of whitespace characters. If whitespace characters are to be kept as-is (in e.g., strings), specify an empty value (i.e., <code>""</code>) for <code>"whitespace"</code>; obviously, whitespace cannot be a delimiter then.
es: Cualquier car&aacute;cter de <var>value</var> se interpretar&aacute; como un espacio en blanco y se recortar&aacute;; la cadena que define los espacios en blanco debe incluirse entre comillas dobles para el procesamiento adecuado de caracteres especiales como <code>"\t"</code> . En cada campo de datos, varios caracteres de espacios en blanco consecutivos se contraen en un espacio y se eliminan los espacios en blanco iniciales y finales. El valor predeterminado para los espacios en blanco es <code>" \b\r\n\t"</code> (observe el espacio). Los espacios en blanco siempre se agregan al conjunto de caracteres delimitadores a menos que se proporcione al menos un especificador de conversi&oacute;n de formato <code>"%s"</code> ; en ese caso, solo los espacios en blanco especificados expl&iacute;citamente en <code>"delimiter"</code> se retiene como delimitador y se elimina del conjunto de caracteres de espacio en blanco. Si los caracteres de espacio en blanco deben mantenerse como est&aacute;n (por ejemplo, en cadenas), especifique un valor vac&iacute;o (es decir, <code>""</code> ) para <code>"whitespace"</code> ; obviamente, entonces los espacios en blanco no pueden ser un delimitador.
ja: <var>value</var> 文字はすべて空白として解釈され、削除されます。 <code>"\t"</code> ような特殊文字を適切に処理するには、空白を定義する文字列を二重引用符で囲む必要があります。各データフィールドでは、連続する複数の空白文字が1つのスペースに折りたたまれ、先頭と末尾の空白が削除されます。空白のデフォルト値は <code>" \b\r\n\t"</code> （スペースに注意）です。少なくとも1つの <code>"%s"</code> 形式変換指定子が指定されていない限り、空白は常に区切り文字のセットに追加されます。その場合、 <code>"delimiter"</code> で明示的に指定された空白のみ区切り文字として保持され、空白文字のセットから削除されます。空白文字をそのまま（文字列など）保持する場合は、 <code>"whitespace"</code> に空の値（つまり <code>""</code> ）を指定します。明らかに、空白は区切り文字にはなり得ません。
ru: Любой символ в <var>value</var> будет интерпретирован как пробел и обрезан; строка, определяющая пробелы, должна быть заключена в двойные кавычки для правильной обработки специальных символов, таких как <code>"\t"</code> . В каждом поле данных несколько последовательных пробельных символов сворачиваются в один пробел, а начальные и конечные пробелы удаляются. Значение по умолчанию для пробелов - <code>" \b\r\n\t"</code> (обратите внимание на пробел). Пробелы всегда добавляются к набору символов-разделителей, если не указан хотя бы один спецификатор преобразования формата <code>"%s"</code> ; в этом случае только пробелы, явно указанные в <code>"delimiter"</code> сохраняется как разделитель и удаляется из набора пробельных символов. Если символы-пробелы должны быть сохранены как есть (например, в строках), укажите пустое значение (т. Е. <code>""</code> ) Для <code>"whitespace"</code> ; очевидно, что тогда пробелы не могут быть разделителем.
zh_cn: <var>value</var> 任何字符都将被解释为空格并进行修剪；定义空白的字符串必须用双引号引起来，以便正确处理特殊字符，例如 <code>"\t"</code> 。在每个数据字段中，将多个连续的空白字符折叠成一个空格，并删除了前导和尾随空格。空格的默认值为 <code>" \b\r\n\t"</code> （注意空格）。除非提供至少一个 <code>"%s"</code> 格式转换说明符，否则始终将空格添加到定界符字符集；在这种情况下，只有在 <code>"delimiter"</code> 明确指定的空格保留为定界符，并从空白字符集中删除。如果要按原样保留空格字符（例如，字符串），请为 <code>"whitespace"</code> 指定一个空值（即 <code>""</code> ）；显然，空白不能成为分隔符。

source: Any character in <var>value</var> will be used to split <var>str</var> into words (default value = any whitespace). Note that whitespace is implicitly added to the set of delimiter characters unless a <code>"%s"</code> format conversion specifier is supplied; see <code>"whitespace"</code> parameter below. The set of delimiter characters cannot be empty; if needed Octave substitutes a space as delimiter.
es: Cualquier car&aacute;cter en el <var>value</var> se utilizar&aacute; para dividir <var>str</var> en palabras (valor predeterminado = cualquier espacio en blanco). Tenga en cuenta que los espacios en blanco se agregan impl&iacute;citamente al conjunto de caracteres delimitadores a menos que se proporcione un especificador de conversi&oacute;n de formato <code>"%s"</code> ; consulte el par&aacute;metro <code>"whitespace"</code> continuaci&oacute;n. El conjunto de caracteres delimitadores no puede estar vac&iacute;o; si es necesario, Octave sustituye un espacio como delimitador.
ja: <var>value</var> 任意の文字を使用して <var>str</var> を単語に分割します（デフォルト値=空白）。 <code>"%s"</code> フォーマット変換指定子が指定されていない限り、空白は暗黙的に区切り文字のセットに追加されることに注意してください。以下の <code>"whitespace"</code> パラメータを参照してください。区切り文字のセットは空にできません。必要に応じて、オクターブはスペースを区切り文字として置き換えます。
ru: Любой символ в <var>value</var> будет использоваться для разделения <var>str</var> на слова (значение по умолчанию = любой пробел). Обратите внимание, что пробелы неявно добавляются к набору символов-разделителей, если не указан спецификатор преобразования формата <code>"%s"</code> ; см. параметр <code>"whitespace"</code> ниже. Набор символов-разделителей не может быть пустым; при необходимости Octave заменяет пробел в качестве разделителя.
zh_cn: <var>value</var> 中的任何字符都将用于将 <var>str</var> 拆分为单词（默认值=任何空格）。请注意，除非提供了 <code>"%s"</code> 格式转换说明符，否则会将空格隐式添加到定界符字符集；请参阅下面的 <code>"whitespace"</code> 参数。分隔符字符集不能为空；如果需要，八度会用空格代替定界符。

source: Any function that the nested function&rsquo;s parent can call
es: Cualquier funci&oacute;n que el padre de la funci&oacute;n anidada pueda llamar
ja: ネストされた関数の親が呼び出すことができるすべての関数
ru: Любая функция, которую может вызвать родитель вложенной функции
zh_cn: 嵌套函数的父级可以调用的任何函数

source: Any names identified are returned in a cell array of strings. The array is empty if no variables were found.
es: Cualquier nombre identificado es devuelto en un conjunto de células de cuerdas.La matriz está vacía si no se han encontrado variables.
ja: 識別された名前は、文字列のセル配列で返されます。変数が見つからなかった場合、配列は空になります。
ru: Любые идентифицированные имена возвращаются в массиве строк ячейки.Массив пуст,если переменные не найдены.
zh_cn: 任何被识别的名称都会以一个字符串的单元格数组返回。如果没有发现任何变量,则该数组为空。

source: Any nonzero values will be converted to true (1) while zero values will be converted to false (0). The non-numeric value NaN cannot be converted and will produce an error.
es: Cualquier valor distinto de cero se convertirá en verdadero (1)mientras que los valores de cero se convertirán en falsos (0).El valor no numérico NaN no puede ser convertido y producirá un error.
ja: ゼロ以外の値は真(1)に変換され、ゼロの値は偽(0)に変換されます。数値以外のNaNは変換できず、エラーとなります。
ru: Любые ненулевые значения будут преобразованы в true (1),а нулевые-в false (0).Ненулевое значение NaN не может быть преобразовано и приведет к ошибке.
zh_cn: 任何非零值将被转换为真(1),而零值将被转换为假(0)。非数字值NaN不能被转换,并会产生错误。
