Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/octave/octave.*.011.xlf
Languages: es, ja, ru, zh_cn

source: Any window elements outside the data array are replaced by <code>NaN</code>. For example, with a window of length 3, <code><var>y</var>(1) = max ([NaN, <var>x</var>(1:2)])</code>, and <code><var>y</var>(end) = max ([<var>x</var>(end-1:end), NaN])</code>. This option usually results in <var>y</var> having <code>NaN</code> values at the boundaries, although it is influenced by how <code>max</code> handles <code>NaN</code>, and also by the property <code>"nancond"</code>.
es: Cualquier elemento de ventana fuera de la matriz de datos se reemplaza por <code>NaN</code> . Por ejemplo, con una ventana de longitud 3, <code><var>y</var>(1) = max ([NaN, <var>x</var>(1:2)])</code> e <code><var>y</var>(end) = max ([<var>x</var>(end-1:end), NaN])</code> . Esta opci&oacute;n generalmente da como resultado que <var>y</var> tenga valores de <code>NaN</code> en los l&iacute;mites, aunque est&aacute; influenciado por c&oacute;mo <code>max</code> maneja <code>NaN</code> , y tambi&eacute;n por la propiedad <code>"nancond"</code> .
ja: データ配列外のウィンドウ要素はすべて <code>NaN</code> に置き換えられます。たとえば、ウィンドウの長さが3の場合、 <code><var>y</var>(1) = max ([NaN, <var>x</var>(1:2)])</code> と <code><var>y</var>(end) = max ([<var>x</var>(end-1:end), NaN])</code> 。このオプションは通常、境界で <code>NaN</code> 値を持つ <var>y</var> になりますが、 <code>max</code> が <code>NaN</code> を処理する方法と、プロパティ <code>"nancond"</code> にも影響されます。
ru: Любые элементы окна за пределами массива данных заменяются <code>NaN</code> . Например, с окном длиной 3 <code><var>y</var>(1) = max ([NaN, <var>x</var>(1:2)])</code> и <code><var>y</var>(end) = max ([<var>x</var>(end-1:end), NaN])</code> . Эта опция обычно приводит к тому, что <var>y</var> имеет значения <code>NaN</code> на границах, хотя на это влияет то, как <code>max</code> обрабатывает <code>NaN</code> , а также свойство <code>"nancond"</code> .
zh_cn: 数据数组外部的所有窗口元素都将替换为 <code>NaN</code> 。例如，对于一个长度为3的窗口， <code><var>y</var>(1) = max ([NaN, <var>x</var>(1:2)])</code> ，而 <code><var>y</var>(end) = max ([<var>x</var>(end-1:end), NaN])</code> 。此选项通常会导致 <var>y</var> 在边界处具有 <code>NaN</code> 值，尽管它受 <code>max</code> 处理 <code>NaN</code> 的方式以及属性 <code>"nancond"</code> 。

source: Any window elements outside the data array are replaced by <code>NaN</code>. For example, with a window of length 3, <code><var>y</var>(1) = mean ([NaN, <var>x</var>(1:2)])</code>, and <code><var>y</var>(end) = mean ([<var>x</var>(end-1:end), NaN])</code>. This option usually results in <var>y</var> having <code>NaN</code> values at the boundaries, although it is influenced by how <code>mean</code> handles <code>NaN</code>, and also by the property <code>"nancond"</code>.
es: Cualquier elemento de ventana fuera de la matriz de datos se reemplaza por <code>NaN</code> . Por ejemplo, con una ventana de longitud 3, <code><var>y</var>(1) = mean ([NaN, <var>x</var>(1:2)])</code> e <code><var>y</var>(end) = mean ([<var>x</var>(end-1:end), NaN])</code> . Esta opci&oacute;n generalmente da como resultado que <var>y</var> tenga valores de <code>NaN</code> en los l&iacute;mites, aunque est&aacute; influenciada por la forma en que la <code>mean</code> maneja <code>NaN</code> y tambi&eacute;n por la propiedad <code>"nancond"</code> .
ja: データ配列外のウィンドウ要素はすべて <code>NaN</code> に置き換えられます。たとえば、長さが3のウィンドウの場合、 <code><var>y</var>(1) = mean ([NaN, <var>x</var>(1:2)])</code> 、および <code><var>y</var>(end) = mean ([<var>x</var>(end-1:end), NaN])</code> 。このオプションは通常、 <var>y</var> が境界で <code>NaN</code> 値を持つことになりますが、 <code>mean</code> が <code>NaN</code> を処理する方法と、プロパティ <code>"nancond"</code> にも影響されます。
ru: Любые элементы окна за пределами массива данных заменяются <code>NaN</code> . Например, с окном длиной 3 <code><var>y</var>(1) = mean ([NaN, <var>x</var>(1:2)])</code> и <code><var>y</var>(end) = mean ([<var>x</var>(end-1:end), NaN])</code> . Эта опция обычно приводит к тому, что <var>y</var> имеет значения <code>NaN</code> на границах, хотя на это влияет то, как <code>mean</code> обрабатывает <code>NaN</code> , а также свойство <code>"nancond"</code> .
zh_cn: 数据数组外部的所有窗口元素都将替换为 <code>NaN</code> 。例如，对于一个长度为3的窗口， <code><var>y</var>(1) = mean ([NaN, <var>x</var>(1:2)])</code> ，而 <code><var>y</var>(end) = mean ([<var>x</var>(end-1:end), NaN])</code> 。此选项通常会导致 <var>y</var> 在边界处具有 <code>NaN</code> 值，尽管它受 <code>mean</code> 处理 <code>NaN</code> 的方式以及属性 <code>"nancond"</code> 。

source: Any window elements outside the data array are replaced by <code>NaN</code>. For example, with a window of length 3, <code><var>y</var>(1) = min ([NaN, <var>x</var>(1:2)])</code>, and <code><var>y</var>(end) = min ([<var>x</var>(end-1:end), NaN])</code>. This option usually results in <var>y</var> having <code>NaN</code> values at the boundaries, although it is influenced by how <code>min</code> handles <code>NaN</code>, and also by the property <code>"nancond"</code>.
es: Cualquier elemento de ventana fuera de la matriz de datos se reemplaza por <code>NaN</code> . Por ejemplo, con una ventana de longitud 3, <code><var>y</var>(1) = min ([NaN, <var>x</var>(1:2)])</code> e <code><var>y</var>(end) = min ([<var>x</var>(end-1:end), NaN])</code> . Esta opci&oacute;n generalmente da como resultado que <var>y</var> tenga valores de <code>NaN</code> en los l&iacute;mites, aunque est&aacute; influenciada por c&oacute;mo <code>min</code> maneja <code>NaN</code> y tambi&eacute;n por la propiedad <code>"nancond"</code> .
ja: データ配列外のウィンドウ要素はすべて <code>NaN</code> に置き換えられます。たとえば、長さが3のウィンドウの場合、 <code><var>y</var>(1) = min ([NaN, <var>x</var>(1:2)])</code> と <code><var>y</var>(end) = min ([<var>x</var>(end-1:end), NaN])</code> 。このオプションは通常、境界で <code>NaN</code> 値を持つ <var>y</var> になりますが、 <code>min</code> が <code>NaN</code> を処理する方法と、プロパティ <code>"nancond"</code> にも影響されます。
ru: Любые элементы окна за пределами массива данных заменяются <code>NaN</code> . Например, с окном длиной 3 <code><var>y</var>(1) = min ([NaN, <var>x</var>(1:2)])</code> и <code><var>y</var>(end) = min ([<var>x</var>(end-1:end), NaN])</code> . Эта опция обычно приводит к тому, что <var>y</var> имеет значения <code>NaN</code> на границах, хотя на это влияет то, как <code>min</code> обрабатывает <code>NaN</code> , а также свойство <code>"nancond"</code> .
zh_cn: 数据数组外部的所有窗口元素都将替换为 <code>NaN</code> 。例如，对于一个长度为3的窗口， <code><var>y</var>(1) = min ([NaN, <var>x</var>(1:2)])</code> 和 <code><var>y</var>(end) = min ([<var>x</var>(end-1:end), NaN])</code> 。该选项通常会导致 <var>y</var> 在边界处具有 <code>NaN</code> 值，尽管它受 <code>min</code> 处理 <code>NaN</code> 的方式以及属性 <code>"nancond"</code> 。

source: Any window elements outside the data array are replaced by <code>NaN</code>. For example, with a window of length 3, <code><var>y</var>(1) = movmedian ([NaN, <var>x</var>(1:2)])</code>, and <code><var>y</var>(end) = movmedian ([<var>x</var>(end-1:end), NaN])</code>. This option usually results in <var>y</var> having <code>NaN</code> values at the boundaries, although it is influenced by how <code>movmedian</code> handles <code>NaN</code>, and also by the property <code>"nancond"</code>.
es: Cualquier elemento de ventana fuera de la matriz de datos se reemplaza por <code>NaN</code> . Por ejemplo, con una ventana de longitud 3, <code><var>y</var>(1) = movmedian ([NaN, <var>x</var>(1:2)])</code> e <code><var>y</var>(end) = movmedian ([<var>x</var>(end-1:end), NaN])</code> . Esta opci&oacute;n generalmente da como resultado que <var>y</var> tenga valores de <code>NaN</code> en los l&iacute;mites, aunque est&aacute; influenciado por c&oacute;mo <code>movmedian</code> maneja <code>NaN</code> , y tambi&eacute;n por la propiedad <code>"nancond"</code> .
ja: データ配列外のウィンドウ要素はすべて <code>NaN</code> に置き換えられます。たとえば、ウィンドウの長さが3の場合、 <code><var>y</var>(1) = movmedian ([NaN, <var>x</var>(1:2)])</code> と <code><var>y</var>(end) = movmedian ([<var>x</var>(end-1:end), NaN])</code> 。このオプションは通常、境界に <code>NaN</code> 値を持つ <var>y</var> になりますが、 <code>movmedian</code> が <code>NaN</code> を処理する方法や、プロパティ <code>"nancond"</code> にも影響されます。
ru: Любые элементы окна за пределами массива данных заменяются <code>NaN</code> . Например, с окном длиной 3 <code><var>y</var>(1) = movmedian ([NaN, <var>x</var>(1:2)])</code> и <code><var>y</var>(end) = movmedian ([<var>x</var>(end-1:end), NaN])</code> . Эта опция обычно приводит к тому, что <var>y</var> имеет значения <code>NaN</code> на границах, хотя на это влияет то, как <code>movmedian</code> обрабатывает <code>NaN</code> , а также свойство <code>"nancond"</code> .
zh_cn: 数据数组外部的所有窗口元素都将替换为 <code>NaN</code> 。例如，对于一个长度为3的窗口， <code><var>y</var>(1) = movmedian ([NaN, <var>x</var>(1:2)])</code> ，而 <code><var>y</var>(end) = movmedian ([<var>x</var>(end-1:end), NaN])</code> 。此选项通常会导致 <var>y</var> 在边界处具有 <code>NaN</code> 值，尽管它受 <code>movmedian</code> 处理 <code>NaN</code> 的方式以及属性 <code>"nancond"</code> 。

source: Any window elements outside the data array are replaced by <code>NaN</code>. For example, with a window of length 3, <code><var>y</var>(1) = movprod ([NaN, <var>x</var>(1:2)])</code>, and <code><var>y</var>(end) = movprod ([<var>x</var>(end-1:end), NaN])</code>. This option usually results in <var>y</var> having <code>NaN</code> values at the boundaries, although it is influenced by how <code>movprod</code> handles <code>NaN</code>, and also by the property <code>"nancond"</code>.
es: Cualquier elemento de ventana fuera de la matriz de datos se reemplaza por <code>NaN</code> . Por ejemplo, con una ventana de longitud 3, <code><var>y</var>(1) = movprod ([NaN, <var>x</var>(1:2)])</code> e <code><var>y</var>(end) = movprod ([<var>x</var>(end-1:end), NaN])</code> . Esta opci&oacute;n generalmente da como resultado que <var>y</var> tenga valores de <code>NaN</code> en los l&iacute;mites, aunque est&aacute; influenciada por c&oacute;mo <code>movprod</code> maneja <code>NaN</code> , y tambi&eacute;n por la propiedad <code>"nancond"</code> .
ja: データ配列外のウィンドウ要素はすべて <code>NaN</code> に置き換えられます。たとえば、ウィンドウの長さが3の場合、 <code><var>y</var>(1) = movprod ([NaN, <var>x</var>(1:2)])</code> と <code><var>y</var>(end) = movprod ([<var>x</var>(end-1:end), NaN])</code> 。このオプションは通常、境界に <code>NaN</code> 値を持つ <var>y</var> になりますが、 <code>movprod</code> が <code>NaN</code> を処理する方法と、プロパティ <code>"nancond"</code> にも影響されます。
ru: Любые элементы окна за пределами массива данных заменяются <code>NaN</code> . Например, с окном длиной 3 <code><var>y</var>(1) = movprod ([NaN, <var>x</var>(1:2)])</code> и <code><var>y</var>(end) = movprod ([<var>x</var>(end-1:end), NaN])</code> . Эта опция обычно приводит к тому, что <var>y</var> имеет значения <code>NaN</code> на границах, хотя на это влияет то, как <code>movprod</code> обрабатывает <code>NaN</code> , а также свойство <code>"nancond"</code> .
zh_cn: 数据数组外部的所有窗口元素都将替换为 <code>NaN</code> 。例如，对于一个长度为3的窗口， <code><var>y</var>(1) = movprod ([NaN, <var>x</var>(1:2)])</code> 和 <code><var>y</var>(end) = movprod ([<var>x</var>(end-1:end), NaN])</code> 。尽管受 <code>movprod</code> 处理 <code>NaN</code> 的方式以及属性 <code>"nancond"</code> 影响，此选项通常会导致 <var>y</var> 在边界处具有 <code>NaN</code> 值。

source: Any window elements outside the data array are replaced by <code>NaN</code>. For example, with a window of length 3, <code><var>y</var>(1) = movstd ([NaN, <var>x</var>(1:2)])</code>, and <code><var>y</var>(end) = movstd ([<var>x</var>(end-1:end), NaN])</code>. This option usually results in <var>y</var> having <code>NaN</code> values at the boundaries, although it is influenced by how <code>movstd</code> handles <code>NaN</code>, and also by the property <code>"nancond"</code>.
es: Cualquier elemento de ventana fuera de la matriz de datos se reemplaza por <code>NaN</code> . Por ejemplo, con una ventana de longitud 3, <code><var>y</var>(1) = movstd ([NaN, <var>x</var>(1:2)])</code> e <code><var>y</var>(end) = movstd ([<var>x</var>(end-1:end), NaN])</code> . Esta opci&oacute;n generalmente da como resultado que <var>y</var> tenga valores de <code>NaN</code> en los l&iacute;mites, aunque est&aacute; influenciada por c&oacute;mo maneja <code>movstd</code> <code>NaN</code> , y tambi&eacute;n por la propiedad <code>"nancond"</code> .
ja: データ配列外のウィンドウ要素はすべて <code>NaN</code> に置き換えられます。たとえば、ウィンドウの長さが3の場合、 <code><var>y</var>(1) = movstd ([NaN, <var>x</var>(1:2)])</code> と <code><var>y</var>(end) = movstd ([<var>x</var>(end-1:end), NaN])</code> 。このオプションは通常、境界で <code>NaN</code> 値を持つ <var>y</var> になりますが、 <code>movstd</code> が <code>NaN</code> を処理する方法と、プロパティ <code>"nancond"</code> にも影響されます。
ru: Любые элементы окна за пределами массива данных заменяются <code>NaN</code> . Например, с окном длиной 3 <code><var>y</var>(1) = movstd ([NaN, <var>x</var>(1:2)])</code> и <code><var>y</var>(end) = movstd ([<var>x</var>(end-1:end), NaN])</code> . Эта опция обычно приводит к тому, что <var>y</var> имеет значения <code>NaN</code> на границах, хотя на это влияет то, как <code>movstd</code> обрабатывает <code>NaN</code> , а также свойство <code>"nancond"</code> .
zh_cn: 数据数组外部的所有窗口元素都将替换为 <code>NaN</code> 。例如，对于一个长度为3的窗口， <code><var>y</var>(1) = movstd ([NaN, <var>x</var>(1:2)])</code> 和 <code><var>y</var>(end) = movstd ([<var>x</var>(end-1:end), NaN])</code> 。尽管受 <code>movstd</code> 处理 <code>NaN</code> 的方式以及属性 <code>"nancond"</code> 影响，此选项通常会导致 <var>y</var> 在边界处具有 <code>NaN</code> 值。

source: Any window elements outside the data array are replaced by <code>NaN</code>. For example, with a window of length 3, <code><var>y</var>(1) = movsum ([NaN, <var>x</var>(1:2)])</code>, and <code><var>y</var>(end) = movsum ([<var>x</var>(end-1:end), NaN])</code>. This option usually results in <var>y</var> having <code>NaN</code> values at the boundaries, although it is influenced by how <code>movsum</code> handles <code>NaN</code>, and also by the property <code>"nancond"</code>.
es: Cualquier elemento de ventana fuera de la matriz de datos se reemplaza por <code>NaN</code> . Por ejemplo, con una ventana de longitud 3, <code><var>y</var>(1) = movsum ([NaN, <var>x</var>(1:2)])</code> e <code><var>y</var>(end) = movsum ([<var>x</var>(end-1:end), NaN])</code> . Esta opci&oacute;n generalmente da como resultado que <var>y</var> tenga valores de <code>NaN</code> en los l&iacute;mites, aunque est&aacute; influenciado por c&oacute;mo <code>movsum</code> maneja <code>NaN</code> , y tambi&eacute;n por la propiedad <code>"nancond"</code> .
ja: データ配列外のウィンドウ要素はすべて <code>NaN</code> に置き換えられます。たとえば、長さが3のウィンドウの場合、 <code><var>y</var>(1) = movsum ([NaN, <var>x</var>(1:2)])</code> と <code><var>y</var>(end) = movsum ([<var>x</var>(end-1:end), NaN])</code> 。このオプションは通常、境界に <code>NaN</code> 値を持つ <var>y</var> になりますが、 <code>movsum</code> が <code>NaN</code> を処理する方法と、プロパティ <code>"nancond"</code> にも影響されます。
ru: Любые элементы окна за пределами массива данных заменяются <code>NaN</code> . Например, с окном длиной 3 <code><var>y</var>(1) = movsum ([NaN, <var>x</var>(1:2)])</code> и <code><var>y</var>(end) = movsum ([<var>x</var>(end-1:end), NaN])</code> . Эта опция обычно приводит к тому, что <var>y</var> имеет значения <code>NaN</code> на границах, хотя на это влияет то, как <code>movsum</code> обрабатывает <code>NaN</code> , а также свойство <code>"nancond"</code> .
zh_cn: 数据数组外部的所有窗口元素都将替换为 <code>NaN</code> 。例如，对于一个长度为3的窗口， <code><var>y</var>(1) = movsum ([NaN, <var>x</var>(1:2)])</code> 和 <code><var>y</var>(end) = movsum ([<var>x</var>(end-1:end), NaN])</code> 。此选项通常会导致 <var>y</var> 在边界处具有 <code>NaN</code> 值，尽管它受 <code>movsum</code> 处理 <code>NaN</code> 的方式以及属性 <code>"nancond"</code> 。

source: Any window elements outside the data array are replaced by <code>NaN</code>. For example, with a window of length 3, <code><var>y</var>(1) = var ([NaN, <var>x</var>(1:2)])</code>, and <code><var>y</var>(end) = var ([<var>x</var>(end-1:end), NaN])</code>. This option usually results in <var>y</var> having <code>NaN</code> values at the boundaries, although it is influenced by how <code>var</code> handles <code>NaN</code>, and also by the property <code>"nancond"</code>.
es: Cualquier elemento de ventana fuera de la matriz de datos se reemplaza por <code>NaN</code> . Por ejemplo, con una ventana de longitud 3, <code><var>y</var>(1) = var ([NaN, <var>x</var>(1:2)])</code> e <code><var>y</var>(end) = var ([<var>x</var>(end-1:end), NaN])</code> . Esta opci&oacute;n generalmente da como resultado que <var>y</var> tenga valores de <code>NaN</code> en los l&iacute;mites, aunque est&aacute; influenciado por c&oacute;mo <code>var</code> maneja <code>NaN</code> , y tambi&eacute;n por la propiedad <code>"nancond"</code> .
ja: データ配列外のウィンドウ要素はすべて <code>NaN</code> に置き換えられます。たとえば、長さが3のウィンドウの場合、 <code><var>y</var>(1) = var ([NaN, <var>x</var>(1:2)])</code> 、および <code><var>y</var>(end) = var ([<var>x</var>(end-1:end), NaN])</code> 。このオプションは通常、境界で <code>NaN</code> 値を持つ <var>y</var> になりますが、 <code>var</code> が <code>NaN</code> を処理する方法、およびプロパティ <code>"nancond"</code> にも影響されます。
ru: Любые элементы окна за пределами массива данных заменяются <code>NaN</code> . Например, для окна длиной 3 <code><var>y</var>(1) = var ([NaN, <var>x</var>(1:2)])</code> и <code><var>y</var>(end) = var ([<var>x</var>(end-1:end), NaN])</code> . Эта опция обычно приводит к тому, что <var>y</var> имеет значения <code>NaN</code> на границах, хотя на это влияет то, как <code>var</code> обрабатывает <code>NaN</code> , а также свойство <code>"nancond"</code> .
zh_cn: 数据数组外部的所有窗口元素都将替换为 <code>NaN</code> 。例如，对于一个长度为3的窗口， <code><var>y</var>(1) = var ([NaN, <var>x</var>(1:2)])</code> 和 <code><var>y</var>(end) = var ([<var>x</var>(end-1:end), NaN])</code> 。此选项通常会导致 <var>y</var> 在边界具有 <code>NaN</code> 值，尽管它受 <code>var</code> 处理 <code>NaN</code> 的方式以及属性 <code>"nancond"</code> 。

source: Any window elements outside the data array are replaced by the specified value <var>user_value</var> which must be a numeric scalar. For example, with a window of length 3, <code><var>y</var>(1) = <var>fcn</var> ([<var>user_value</var>, <var>x</var>(1:2)])</code>, and <code><var>y</var>(end) = <var>fcn</var> ([<var>x</var>(end-1:end), <var>user_value</var>])</code>. A common choice for <var>user_value</var> is 0.
es: Cualquier elemento de ventana fuera de la matriz de datos se reemplaza por el valor especificado <var>user_value</var> , que debe ser un escalar num&eacute;rico. Por ejemplo, con una ventana de longitud 3, <code><var>y</var>(1) = <var>fcn</var> ([<var>user_value</var>, <var>x</var>(1:2)])</code> e <code><var>y</var>(end) = <var>fcn</var> ([<var>x</var>(end-1:end), <var>user_value</var>])</code> . Una opci&oacute;n com&uacute;n para <var>user_value</var> es 0.
ja: データ配列の外側のウィンドウ要素はすべて、指定された値 <var>user_value</var> で置き換えられます。user_valueは数値スカラーでなければなりません。たとえば、長さが3のウィンドウの場合、 <code><var>y</var>(1) = <var>fcn</var> ([<var>user_value</var>, <var>x</var>(1:2)])</code> と <code><var>y</var>(end) = <var>fcn</var> ([<var>x</var>(end-1:end), <var>user_value</var>])</code> 。 <var>user_value</var> の一般的な選択は0です。
ru: Любые элементы окна вне массива данных заменяются указанным значением <var>user_value</var> , которое должно быть числовым скаляром. Например, с окном длиной 3 <code><var>y</var>(1) = <var>fcn</var> ([<var>user_value</var>, <var>x</var>(1:2)])</code> и <code><var>y</var>(end) = <var>fcn</var> ([<var>x</var>(end-1:end), <var>user_value</var>])</code> . Обычный выбор для <var>user_value</var> - 0.
zh_cn: 数据数组外部的所有窗口元素都将替换为指定值 <var>user_value</var> ，该值必须是数字标量。例如，对于长度为3的窗口， <code><var>y</var>(1) = <var>fcn</var> ([<var>user_value</var>, <var>x</var>(1:2)])</code> 和 <code><var>y</var>(end) = <var>fcn</var> ([<var>x</var>(end-1:end), <var>user_value</var>])</code> 。 <var>user_value</var> 的常见选择是0。

source: Any window elements outside the data array are replaced by the specified value <var>user_value</var> which must be a numeric scalar. For example, with a window of length 3, <code><var>y</var>(1) = mad ([<var>user_value</var>, <var>x</var>(1:2)])</code>, and <code><var>y</var>(end) = mad ([<var>x</var>(end-1:end), <var>user_value</var>])</code>. A common choice for <var>user_value</var> is 0.
es: Cualquier elemento de ventana fuera de la matriz de datos se reemplaza por el valor especificado <var>user_value</var> , que debe ser un escalar num&eacute;rico. Por ejemplo, con una ventana de longitud 3, <code><var>y</var>(1) = mad ([<var>user_value</var>, <var>x</var>(1:2)])</code> e <code><var>y</var>(end) = mad ([<var>x</var>(end-1:end), <var>user_value</var>])</code> . Una opci&oacute;n com&uacute;n para <var>user_value</var> es 0.
ja: データ配列の外側のウィンドウ要素はすべて、指定された値 <var>user_value</var> で置き換えられます。user_valueは数値スカラーでなければなりません。たとえば、ウィンドウの長さが3の場合、 <code><var>y</var>(1) = mad ([<var>user_value</var>, <var>x</var>(1:2)])</code> と <code><var>y</var>(end) = mad ([<var>x</var>(end-1:end), <var>user_value</var>])</code> 。 <var>user_value</var> の一般的な選択は0です。
ru: Любые элементы окна вне массива данных заменяются указанным значением <var>user_value</var> , которое должно быть числовым скаляром. Например, с окном длиной 3 <code><var>y</var>(1) = mad ([<var>user_value</var>, <var>x</var>(1:2)])</code> и <code><var>y</var>(end) = mad ([<var>x</var>(end-1:end), <var>user_value</var>])</code> . Обычный выбор для <var>user_value</var> - 0.
zh_cn: 数据数组外部的所有窗口元素都将替换为指定值 <var>user_value</var> ，该值必须是数字标量。例如，对于一个长度为3的窗口， <code><var>y</var>(1) = mad ([<var>user_value</var>, <var>x</var>(1:2)])</code> 和 <code><var>y</var>(end) = mad ([<var>x</var>(end-1:end), <var>user_value</var>])</code> 。 <var>user_value</var> 的常见选择是0。

source: Any window elements outside the data array are replaced by the specified value <var>user_value</var> which must be a numeric scalar. For example, with a window of length 3, <code><var>y</var>(1) = max ([<var>user_value</var>, <var>x</var>(1:2)])</code>, and <code><var>y</var>(end) = max ([<var>x</var>(end-1:end), <var>user_value</var>])</code>. A common choice for <var>user_value</var> is 0.
es: Cualquier elemento de ventana fuera de la matriz de datos se reemplaza por el valor especificado <var>user_value</var> , que debe ser un escalar num&eacute;rico. Por ejemplo, con una ventana de longitud 3, <code><var>y</var>(1) = max ([<var>user_value</var>, <var>x</var>(1:2)])</code> e <code><var>y</var>(end) = max ([<var>x</var>(end-1:end), <var>user_value</var>])</code> . Una opci&oacute;n com&uacute;n para <var>user_value</var> es 0.
ja: データ配列の外側のウィンドウ要素はすべて、指定された値 <var>user_value</var> で置き換えられます。user_valueは数値スカラーでなければなりません。たとえば、長さが3のウィンドウの場合、 <code><var>y</var>(1) = max ([<var>user_value</var>, <var>x</var>(1:2)])</code> 、および <code><var>y</var>(end) = max ([<var>x</var>(end-1:end), <var>user_value</var>])</code> 。 <var>user_value</var> の一般的な選択は0です。
ru: Любые элементы окна вне массива данных заменяются указанным значением <var>user_value</var> , которое должно быть числовым скаляром. Например, для окна длиной 3 <code><var>y</var>(1) = max ([<var>user_value</var>, <var>x</var>(1:2)])</code> и <code><var>y</var>(end) = max ([<var>x</var>(end-1:end), <var>user_value</var>])</code> . Обычный выбор для <var>user_value</var> - 0.
zh_cn: 数据数组外部的所有窗口元素都将替换为指定值 <var>user_value</var> ，该值必须是数字标量。例如，对于一个长度为3的窗口， <code><var>y</var>(1) = max ([<var>user_value</var>, <var>x</var>(1:2)])</code> 和 <code><var>y</var>(end) = max ([<var>x</var>(end-1:end), <var>user_value</var>])</code> 。 <var>user_value</var> 的常见选择是0。
