Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/octave/octave.*.020.xlf
Languages: es, ru, zh_cn

source: There is still one additional problem with this function. What if it is called without an argument? Without additional error checking, Octave will probably print an error message that won&rsquo;t really help you track down the source of the error. To allow you to catch errors like this, Octave provides each function with an automatic variable called <code>nargin</code>. Each time a function is called, <code>nargin</code> is automatically initialized to the number of arguments that have actually been passed to the function. For example, we might rewrite the <code>avg</code> function like this:
es: Todav&iacute;a hay un problema adicional con esta funci&oacute;n. &iquest;Qu&eacute; pasa si se llama sin un argumento? Sin una verificaci&oacute;n adicional de errores, Octave probablemente imprimir&aacute; un mensaje de error que realmente no lo ayudar&aacute; a rastrear la fuente del error. Para permitirle detectar errores como este, Octave proporciona a cada funci&oacute;n una variable autom&aacute;tica llamada <code>nargin</code> . Cada vez que se llama a una funci&oacute;n, <code>nargin</code> se inicializa autom&aacute;ticamente con el n&uacute;mero de argumentos que realmente se han pasado a la funci&oacute;n. Por ejemplo, podr&iacute;amos reescribir la funci&oacute;n <code>avg</code> as&iacute;:
ru: Есть еще одна проблема с этой функцией. Что делать, если он вызывается без аргумента? Без дополнительной проверки ошибок Octave, вероятно, напечатает сообщение об ошибке, которое на самом деле не поможет вам отследить источник ошибки. Чтобы вы могли обнаруживать подобные ошибки, Octave предоставляет каждой функции автоматическую переменную <code>nargin</code> . Каждый раз, когда вызывается функция, <code>nargin</code> автоматически инициализируется количеством аргументов, которые фактически были переданы функции. Например, мы могли бы переписать функцию <code>avg</code> следующим образом:
zh_cn: 此功能还有另一个问题。如果不带参数调用该怎么办？如果没有其他错误检查，Octave可能会打印一条错误消息，但实际上并不能帮助您找到错误的来源。为了使您能够捕获这样的错误，Octave为每个函数提供了一个自动变量 <code>nargin</code> 。每次调用一个函数时， <code>nargin</code> 都会自动初始化为实际传递给该函数的参数数量。例如，我们可以这样重写 <code>avg</code> 函数：

source: Therefore, the test in <code>tsearch</code> and <code>tsearchn</code> essentially only needs to express each point in terms of the Barycentric coordinates of each of the simplices of the N-simplex and test the values of <var>beta</var>. This is exactly the implementation used in <code>tsearchn</code>. <code>tsearch</code> is optimized for 2-dimensions and the Barycentric coordinates are not explicitly formed.
es: Por lo tanto, la prueba en <code>tsearch</code> y <code>tsearchn</code> esencialmente solo necesita expresar cada punto en t&eacute;rminos de las coordenadas baric&eacute;ntricas de cada uno de los simples del N-simplex y probar los valores de <var>beta</var> . Esta es exactamente la implementaci&oacute;n utilizada en <code>tsearchn</code> . <code>tsearch</code> est&aacute; optimizado para 2 dimensiones y las coordenadas baric&eacute;ntricas no se forman expl&iacute;citamente.
ru: Следовательно, тест в <code>tsearch</code> и <code>tsearchn</code> по существу должен только выразить каждую точку в терминах барицентрических координат каждого из симплексов N-симплекса и проверить значения <var>beta</var> . Это именно та реализация, которая используется в <code>tsearchn</code> . <code>tsearch</code> оптимизирован для 2-х измерений, и барицентрические координаты явно не формируются.
zh_cn: 因此， <code>tsearch</code> 和 <code>tsearchn</code> 中的测试本质上仅需要根据N单项的每个单纯形的重心坐标表示每个点，并测试 <var>beta</var> 的值。这正是 <code>tsearchn</code> 中使用的实现。 <code>tsearch</code> 已针对二维进行了优化，并且重心坐标未明确形成。

source: Therefore, there is a certain density of nonzero elements of a matrix where it no longer makes sense to store it as a sparse matrix, but rather as a full matrix. For this reason operators and functions that have a high probability of returning a full matrix will always return one. For example adding a scalar constant to a sparse matrix will almost always make it a full matrix, and so the example,
es: Por lo tanto,hay una cierta densidad de elementos no nulos de una matriz en la que ya no tiene sentido almacenarla como una matriz escasa,sino como una matriz completa.Por esta razón,los operadores y funciones que tienen una alta probabilidad de devolver una matriz completa siempre devolverán una.Por ejemplo,si se añade una constante escalar a una matriz dispersa,casi siempre será una matriz completa,y así el ejemplo,
ru: Поэтому существует определенная плотность ненулевых элементов матрицы,где уже нет смысла хранить ее в виде разреженной матрицы,а есть смысл хранить ее в виде полной матрицы.По этой причине операторы и функции,имеющие высокую вероятность возврата полной матрицы,всегда будут возвращать одну.Например,добавление скалярной константы в разреженную матрицу почти всегда сделает ее полной матрицей,и так далее в примере,
zh_cn: 因此,矩阵的非零元素有一定的密度,在这种情况下,将其存储为稀疏矩阵,而将其存储为全矩阵已经没有意义。出于这个原因,具有高概率返回全矩阵的运算符和函数将总是返回一个。例如在一个稀疏矩阵中加入一个标量常数几乎总是会使其成为一个全矩阵,所以这个例子。

source: These are the basic two-dimensional matrix types of Octave. In addition there are a number of multi-dimensional array types including
es: Estos son los tipos básicos de matriz bidimensional de la Octava.Además hay una serie de tipos de matrices multidimensionales que incluyen
ru: Это основные двумерные матричные типы октав.Кроме того,существует ряд многомерных типов массивов,включая
zh_cn: 这些是Octave的基本二维矩阵类型。此外,还有一些多维数组类型,包括

source: These are the external build dependencies of the package and are not checked by the package manager. This is here as a hint to the distribution packager. They follow the same conventions as the <code>Depends</code> keyword. Note that in general, packaging systems such as <code>rpm</code> or <code>deb</code> autoprobe the install dependencies from the build dependencies, and therefore a <code>BuildRequires</code> dependency usually removes the need for a <code>SystemRequirements</code> dependency.
es: Estas son las dependencias de compilaci&oacute;n externas del paquete y el administrador de paquetes no las verifica. Esto est&aacute; aqu&iacute; como una pista para el empaquetador de distribuci&oacute;n. Siguen las mismas convenciones que la palabra clave <code>Depends</code> . Tenga en cuenta que, en general, los sistemas de empaquetado, como <code>rpm</code> o <code>deb</code> , sondean autom&aacute;ticamente las dependencias de instalaci&oacute;n de las dependencias de compilaci&oacute;n y, por lo tanto, una dependencia de <code>BuildRequires</code> generalmente elimina la necesidad de una dependencia de <code>SystemRequirements</code> .
ru: Это внешние зависимости сборки пакета, которые не проверяются менеджером пакетов. Это здесь как подсказка для упаковщика дистрибутива. Они следуют тем же соглашениям, что и ключевое слово <code>Depends</code> . Обратите внимание, что в общем случае системы упаковки, такие как <code>rpm</code> или <code>deb</code> , автоматически проверяют зависимости установки на основе зависимостей сборки, и поэтому зависимость <code>BuildRequires</code> обычно устраняет необходимость в зависимости <code>SystemRequirements</code> .
zh_cn: 这些是程序包的外部构建依赖关系，程序包管理器不会检查它们。这是对分发打包程序的提示。它们遵循与 <code>Depends</code> 关键字相同的约定。请注意，通常，诸如 <code>rpm</code> 或 <code>deb</code> 之类的打包系统会自动从构建依赖项中检测安装依赖项，因此 <code>BuildRequires</code> 依赖项通常不需要 <code>SystemRequirements</code> 依赖项。

source: These are the external install dependencies of the package and are not checked by the package manager. This is here as a hint to the distribution packager. They follow the same conventions as the <code>Depends</code> keyword.
es: Estas son las dependencias de instalaci&oacute;n externas del paquete y el administrador de paquetes no las comprueba. Esto est&aacute; aqu&iacute; como una pista para el empaquetador de distribuci&oacute;n. Siguen las mismas convenciones que la palabra clave <code>Depends</code> .
ru: Это внешние зависимости установки пакета, которые не проверяются менеджером пакетов. Это здесь как подсказка для упаковщика дистрибутива. Они следуют тем же соглашениям, что и ключевое слово <code>Depends</code> .
zh_cn: 这些是程序包的外部安装依赖项，程序包管理器不会检查它们。这是对分发打包程序的提示。它们遵循与 <code>Depends</code> 关键字相同的约定。

source: These capabilities are used in a number of basic graphics objects. The <code>hggroup</code> objects created by the functions of Octave contain one or more graphics object and are used to:
es: Estas capacidades se utilizan en varios objetos gr&aacute;ficos b&aacute;sicos. Los objetos <code>hggroup</code> creados por las funciones de Octave contienen uno o m&aacute;s objetos gr&aacute;ficos y se utilizan para:
ru: Эти возможности используются в ряде основных графических объектов. В <code>hggroup</code> объекты , созданные с помощью функций Октавы содержат один или более графического объект и используются для:
zh_cn: 这些功能已在许多基本图形对象中使用。由Octave函数创建的 <code>hggroup</code> 对象包含一个或多个图形对象，并用于：

source: These codes may be used in conjunction with the { and } characters to limit the change to a part of the string. For example,
es: Estos códigos pueden ser usados en conjunto con los caracteres{y}para limitar el cambio a una parte de la cadena.Por ejemplo,
ru: Эти коды могут использоваться в сочетании с символами{и}для ограничения изменения части строки.Например,
zh_cn: 这些代码可与{和}字符一起使用,以限制对字符串的部分更改。例如:

source: These functions are rarely used in practice. One example is the <code>fail (&lsquo;<samp>code</samp>&rsquo;, &lsquo;<samp>pattern</samp>&rsquo;)</code> function which evaluates &lsquo;
es: Estas funciones rara vez se utilizan en la pr&aacute;ctica. Un ejemplo es el <code>fail (&lsquo;<samp>code</samp>&rsquo;, &lsquo;<samp>pattern</samp>&rsquo;)</code> funci&oacute;n que eval&uacute;a'
ru: На практике эти функции используются редко. Одним из примеров является <code>fail (&lsquo;<samp>code</samp>&rsquo;, &lsquo;<samp>pattern</samp>&rsquo;)</code> функция, которая оценивает'
zh_cn: 这些功能在实践中很少使用。一个例子是 <code>fail (&lsquo;<samp>code</samp>&rsquo;, &lsquo;<samp>pattern</samp>&rsquo;)</code> 计算'

source: These functions do not implement a GUI element but are useful when developing programs that do. The functions <code>uiwait</code>, <code>uiresume</code>, and <code>waitfor</code> are only available with the <code>qt</code> or <code>fltk</code> toolkits.
es: Estas funciones no implementan un elemento GUI pero son &uacute;tiles cuando se desarrollan programas que lo hacen. Las funciones <code>uiwait</code> , <code>uiresume</code> y <code>waitfor</code> solo est&aacute;n disponibles con los kits de herramientas <code>qt</code> o <code>fltk</code> .
ru: Эти функции не реализуют элемент графического интерфейса пользователя, но полезны при разработке программ, которые это делают. Функции <code>uiwait</code> , <code>uiresume</code> и <code>waitfor</code> доступны только с инструментами <code>qt</code> или <code>fltk</code> .
zh_cn: 这些功能没有实现GUI元素，但是在开发有此功能的程序时很有用。 <code>uiwait</code> ， <code>uiresume</code> 和 <code>waitfor</code> 函数仅在 <code>qt</code> 或 <code>fltk</code> 工具包中可用。

source: These lists of function calls make it fairly easy to trace the path your program took before the error occurred, and to correct the error before trying again.
es: Estas listas de llamadas a funciones hacen que sea bastante fácil rastrear el camino que tomó su programa antes de que ocurriera el error,y corregir el error antes de intentarlo de nuevo.
ru: Эти списки вызовов функций позволяют довольно легко проследить путь,пройденный вашей программой до возникновения ошибки,и исправить ошибку перед повторной попыткой.
zh_cn: 这些函数调用列表可以相当容易地追踪你的程序在错误发生之前的路径,并在再次尝试之前纠正错误。

source: These operators group right to left.
es: Estos operadores se agrupan de derecha a izquierda.
ru: Эти операторы группируются справа налево.
zh_cn: 这些运算符从右到左分组。

source: These operators work on an element-by-element basis. For example, the expression
es: Estos operadores trabajan elemento por elemento.Por ejemplo,la expresión
ru: Эти операторы работают по элементному принципу.Например,выражение
zh_cn: 这些运算符以元素为基础进行工作。例如,表达式

source: These rotations are centered around the camera target (see <a href="#XREFcamtarget">camtarget</a>). First the camera position is pitched up or down by rotating it <var>phi</var> degrees around an axis orthogonal to both the viewing direction (specifically <code>camtarget() - campos()</code>) and the camera &ldquo;up vector&rdquo; (see <a href="#XREFcamup">camup</a>). Example:
es: Estas rotaciones se centran alrededor del objetivo de la c&aacute;mara (ver <a href="#XREFcamtarget">camtarget</a> ). Primero, la posici&oacute;n de la c&aacute;mara se inclina hacia arriba o hacia abajo gir&aacute;ndola <var>phi</var> grados alrededor de un eje ortogonal a la direcci&oacute;n de visualizaci&oacute;n (espec&iacute;ficamente <code>camtarget() - campos()</code> ) y el &ldquo;vector hacia arriba&rdquo; de la c&aacute;mara (ver <a href="#XREFcamup">camup</a> ). Ejemplo:
ru: Эти вращения центрируются вокруг цели камеры (см. <a href="#XREFcamtarget">Camtarget</a> ). Сначала положение камеры наклоняется вверх или вниз, поворачивая ее на <var>phi</var> градусы вокруг оси, ортогональной как направлению обзора (в частности, <code>camtarget() - campos()</code> ), так и &laquo;вектору вверх&raquo; камеры (см. <a href="#XREFcamup">Camup</a> ). Пример:
zh_cn: 这些旋转以相机目标为中心（请参见<a href="#XREFcamtarget">camtarget</a>）。首先，通过围绕垂直于观看方向（特别是 <code>camtarget() - campos()</code> ）和相机&ldquo;上矢量&rdquo;（请参见<a href="#XREFcamup">camup</a>）的轴旋转 <var>phi</var> 度，使相机位置向上或向下倾斜。例：

source: These routines are highly optimized and many do not carry the overhead of being interpreted.
es: Estas rutinas están altamente optimizadas y muchas no llevan la carga de ser interpretadas.
ru: Эти процедуры в высшей степени оптимизированы,и многие из них не несут на себе накладных расходов,связанных с интерпретацией.
zh_cn: 这些例程都是高度优化的,很多例程都不带有被解释的开销。

source: These types all share a number of basic methods and operators. Many bear a resemblance to functions that exist in the interpreter. A selection of useful methods include
es: Todos estos tipos comparten una serie de métodos y operadores básicos.Muchos se parecen a las funciones que existen en el intérprete.Una selección de métodos útiles incluye
ru: Все эти типы имеют ряд основных методов и операторов.Многие из них имеют сходство с функциями,которые существуют в интерпретаторе.Ряд полезных методов включает в себя
zh_cn: 这些类型都有一些基本的方法和操作符。许多类型与解释器中存在的函数有相似之处。一些有用的方法包括

source: These warnings are emitted if a (nearly) singular matrix is inverted. By default, the <code>Octave:nearly-singular-matrix</code> and <code>Octave:singular-matrix</code> warnings are enabled.
es: Estas advertencias se emiten si se invierte una matriz (casi) singular. De forma predeterminada, las advertencias <code>Octave:singular-matrix</code> <code>Octave:nearly-singular-matrix</code> y Octava: matriz singular est&aacute;n habilitadas.
ru: Эти предупреждения выдаются, если инвертируется (почти) сингулярная матрица. По умолчанию предупреждения <code>Octave:nearly-singular-matrix</code> и <code>Octave:singular-matrix</code> включены.
zh_cn: 如果（几乎）奇异矩阵反转，则会发出这些警告。默认情况下，启用 <code>Octave:nearly-singular-matrix</code> 和 <code>Octave:singular-matrix</code> 警告。

source: This allows more rapid solutions of linear equations involving <var>A</var> to be performed.
es: Esto permite soluciones m&aacute;s r&aacute;pidas de ecuaciones lineales que implican <var>A</var> a realizar.
ru: Это позволяет более быстрые решения линейных уравнений с <var>A</var> должны быть выполнены.
zh_cn: 这允许执行涉及 <var>A</var> 的线性方程的更快速解。

source: This allows the cost of determining the matrix type to be avoided. However, incorrectly defining the matrix type will result in incorrect results from solutions of linear equations, and so it is entirely the responsibility of the user to correctly identify the matrix type
es: Esto permite evitar el costo de determinar el tipo de matriz.Sin embargo,la definición incorrecta del tipo de matriz dará lugar a resultados incorrectos de las soluciones de las ecuaciones lineales,por lo que es responsabilidad exclusiva del usuario identificar correctamente el tipo de matriz
ru: Это позволяет избежать затрат на определение типа матрицы.Однако неправильное определение матричного типа приведет к неправильным результатам решения линейных уравнений,и поэтому ответственность за правильную идентификацию матричного типа целиком ложится на пользователя
zh_cn: 这样可以避免确定矩阵类型的成本。然而,错误地定义矩阵类型将导致线性方程解的结果不正确,因此正确确定矩阵类型完全是用户的责任。

source: This allows you to view one screenful at a time. Some pagers (such as <code>less</code>&mdash;see <a href="installation#Installation">Installation</a>) are also capable of moving backward on the output.
es: Esto le permite ver una pantalla completa a la vez. Algunos buscapersonas (como <code>less</code> consulte <a href="installation#Installation">Instalaci&oacute;n</a> ) tambi&eacute;n pueden retroceder en la salida.
ru: Это позволяет просматривать по одному экрану за раз. Некоторые пейджеры (например, <code>less</code> - см. &laquo; <a href="installation#Installation">Установка&raquo;</a> ) также могут перемещаться назад на выходе.
zh_cn: 这样您可以一次查看一个屏幕。一些寻呼机（如 <code>less</code> -见<a href="installation#Installation">安装</a>）也能够在输出向后移动。

source: This appendix will eventually contain a semi-formal description of Octave&rsquo;s language.
es: Este ap&eacute;ndice eventualmente contendr&aacute; una descripci&oacute;n semiformal del lenguaje de Octave.
ru: В конечном итоге это приложение будет содержать полуформальное описание языка Octave.
zh_cn: 本附录最终将包含对Octave语言的半正式描述。

source: This applies to arrays (matrices), cell arrays, and structs indexed using &lsquo;
es: Esto se aplica a matrices (matrices), matrices de celdas y estructuras indexadas mediante '
ru: Это относится к массивам (матрицам), массивам ячеек и структурам, индексированным с помощью '
zh_cn: 这适用于使用'索引的数组（矩阵），单元格数组和结构

source: This behavior is consistent with the other logical functions. See <a href="logical-values#Logical-Values">Logical Values</a>. The behavior differs from the C language function which returns nonzero if the sign bit is set.
es: Este comportamiento es consistente con las otras funciones l&oacute;gicas. Consulte <a href="logical-values#Logical-Values">Valores l&oacute;gicos</a> . El comportamiento difiere de la funci&oacute;n del lenguaje C que devuelve un valor distinto de cero si el bit de signo est&aacute; establecido.
ru: Такое поведение согласуется с другими логическими функциями. См. &laquo; <a href="logical-values#Logical-Values">Логические значения&raquo;</a> . Поведение отличается от функции языка C, которая возвращает ненулевое значение, если установлен знаковый бит.
zh_cn: 此行为与其他逻辑功能一致。请参阅<a href="logical-values#Logical-Values">逻辑值</a>。行为不同于C语言函数，如果设置了符号位，C语言函数将返回非零值。

source: This behavior is necessary for the boolean operators to work as described for matrix-valued operands.
es: Este comportamiento es necesario para que los operadores booleanos trabajen como se describe para los operandos con valor de matriz.
ru: Такое поведение необходимо для того,чтобы булевые операторы работали так,как это описано для операндов с матричным значением.
zh_cn: 这种行为对于布尔运算符的工作是必要的,就像对矩阵值操作数所描述的那样。

source: This behavior not only facilitates the most straightforward and efficient implementation of algorithms, but also preserves certain useful invariants, like:
es: Este comportamiento no sólo facilita la implementación más directa y eficiente de los algoritmos,sino que también preserva ciertas invariantes útiles,como:
ru: Такое поведение не только облегчает самую простую и эффективную реализацию алгоритмов,но и сохраняет некоторые полезные инварианты,например:
zh_cn: 这种行为不仅有利于算法最直接有效的实现,而且还保留了某些有用的不变量,比如。

source: This can be accomplished with the following functions by
es: Esto puede lograrse con las siguientes funciones
ru: Это может быть выполнено с помощью следующих функций
zh_cn: 这可以通过以下功能来实现。

source: This can be computed exactly using
es: Esto puede ser calculado exactamente usando
ru: Это можно точно рассчитать,используя
zh_cn: 这可以通过以下方法精确计算出来

source: This can be demonstrated by the code
es: Esto puede ser demostrado por el código
ru: Это может быть продемонстрировано кодом
zh_cn: 这可以通过以下代码来证明

source: This can be used by Octave packages to extend the image reading capabilities Octave, through use of the PKG_ADD and PKG_DEL commands.
es: Esto puede ser usado por los paquetes Octave para extender las capacidades de lectura de imágenes Octave,a través del uso de los comandos PKG_ADD y PKG_DEL.
ru: Это может быть использовано пакетами Octave для расширения возможностей чтения изображений Octave с помощью команд PKG_ADD и PKG_DEL.
zh_cn: 这可以被Octave包用来扩展Octave的图像读取功能,通过使用PKG_ADD和PKG_DEL命令。

source: This can be used for all matrix and array types.
es: Esto puede ser usado para todos los tipos de matrices y matrices.
ru: Это может быть использовано для всех типов матриц и массивов.
zh_cn: 这可以用于所有矩阵和数组类型。

source: This can be used to generate many distributions:
es: Esto puede ser usado para generar muchas distribuciones:
ru: Это может быть использовано для генерации многих дистрибутивов:
zh_cn: 这可以用来生成许多分布。

source: This can be used to write somewhat more concise code. For example, it is possible write
es: Esto puede ser usado para escribir un código algo más conciso.Por ejemplo,es posible escribir
ru: Это может быть использовано для написания более лаконичного кода.Например,можно написать
zh_cn: 这可以用来写一些比较简洁的代码。例如,可以写

source: This can be useful for packagers that may split the Octave installation into multiple sub-packages, for example, to provide a hint to users for how to install the missing components.
es: Esto puede ser útil para los empaquetadores que pueden dividir la instalación de Octava en múltiples subpaquetes,por ejemplo,para proporcionar una pista a los usuarios sobre cómo instalar los componentes que faltan.
ru: Это может быть полезно для упаковщиков,которые могут разделить установку Octave на несколько подпакетов,например,для предоставления подсказки пользователям о том,как установить недостающие компоненты.
zh_cn: 这对于打包者来说是很有用的,他们可能会把Octave的安装分成多个子包,例如,为用户提供一个提示,告诉他们如何安装缺少的组件。

source: This can be written in a clearer and more condensed form using the <code>+=</code> operator
es: Esto se puede escribir en una forma m&aacute;s clara y condensada usando el operador <code>+=</code>
ru: Это можно записать в более четкой и сжатой форме с помощью оператора <code>+=</code>
zh_cn: 可以使用 <code>+=</code> 运算符以更清晰，更简洁的形式编写

source: This can then be associated with an object either at the object&rsquo;s creation, or later with the <code>set</code> function. For example,
es: Esto puede asociarse con un objeto en la creaci&oacute;n del objeto o m&aacute;s tarde con la funci&oacute;n de <code>set</code> . Por ejemplo,
ru: Затем это может быть связано с объектом либо при создании объекта, либо позже с функцией <code>set</code> . Например,
zh_cn: 然后可以在对象创建时将其与对象关联，也可以在以后使用 <code>set</code> 函数将其与对象关联。例如，

source: This changes the encoding that is used to interpret all subsequently run startup and m-files (not including the currently executing file).
zh_cn: 这将改变用于解释所有后续运行的启动文件和m-files(不包括当前执行的文件)的编码。
