Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/octave/octave.*.011.xlf
Languages: es, ja, ru, zh_cn

source: Alternatively, to process the data in a structure, the structure might be converted to another type of container before being treated.
es: Alternativamente,para procesar los datos en una estructura,ésta podría convertirse en otro tipo de contenedor antes de ser tratada.
ja: あるいは、構造体のデータを処理するために、構造体は、処理される前に別のタイプの容器に変換されてもよい。
ru: В качестве альтернативы,для обработки данных в структуре,перед обработкой структура может быть преобразована в контейнер другого типа.
zh_cn: 另外,为了处理结构体中的数据,在处理之前可能会将结构体转换为另一种类型的容器。

source: Alternatively, use (?-i) in the pattern.
es: Alternativamente,use (?-i)en el patrón.
ja: あるいは、パターンの中で(?-i)を使用することもできます。
ru: Или используйте (?-i)в шаблоне.
zh_cn: 或者,在图案中使用(?-i)。

source: Alternatively, use (?-m) in the pattern.
es: Alternativamente,use (?-m)en el patrón.
ja: あるいは、パターンの中で(?-m)を使用することもできます。
ru: Или используйте (?-m)в шаблоне.
zh_cn: 或者,在图案中使用(?-m)。

source: Alternatively, use (?-s) in the pattern.
es: Alternativamente,use (?-s)en el patrón.
ja: あるいは、パターンの中で(?-s)を使うこともできます。
ru: Или используйте (?-s)в шаблоне.
zh_cn: 或者,在图案中使用(?-s)。

source: Alternatively, use (?-x) in the pattern.
es: Alternativamente,use (?-x)en el patrón.
ja: あるいは、パターンの中で(?-x)を使うこともできます。
ru: В качестве альтернативы,используйте (?-x)в шаблоне.
zh_cn: 或者,在图案中使用(?-x)。

source: Alternatively, use (?i) in the pattern.
es: Alternativamente,use (?i)en el patrón.
ja: あるいは、パターンの中で(?i)を使用することもできます。
ru: Или используйте (?i)в шаблоне.
zh_cn: 或者,在模式中使用(?i)。

source: Alternatively, use (?m) in the pattern.
es: Alternativamente,use (?m)en el patrón.
ja: あるいは、パターンの中で(?m)を使うこともできます。
ru: Или используйте (?m)в шаблоне.
zh_cn: 或者,在图案中使用(?m)。

source: Alternatively, use (?s) in the pattern.
es: Alternativamente,use (?s)en el patrón.
ja: あるいは、パターンの中で(?s)を使うこともできます。
ru: Или используйте (?s)в шаблоне.
zh_cn: 或者,在模式中使用(?s)。

source: Alternatively, use (?x) in the pattern.
es: Alternativamente,use (?x)en el patrón.
ja: あるいは、パターンの中で(?x)を使用することもできます。
ru: Или используйте (?x)в шаблоне.
zh_cn: 或者,在模式中使用(?x)。

source: Alternatively, we can concatenate <var>A</var> and <var>B</var> along the second dimension in the following way:
es: Alternativamente, podemos concatenar <var>A</var> y <var>B</var> a lo largo de la segunda dimensi&oacute;n de la siguiente manera:
ja: あるいは、次の方法で2番目の次元に沿って <var>A</var> と <var>B</var> を連結できます。
ru: В качестве альтернативы мы можем объединить <var>A</var> и <var>B</var> по второму измерению следующим образом:
zh_cn: 或者，我们可以按以下方式将 <var>A</var> 和 <var>B</var> 沿第二维连接起来：

source: Alternatively, you can write the full or relative path to the file.
es: Alternativamente,puede escribir la ruta completa o relativa del archivo.
ja: あるいは、ファイルへのフルパスまたは相対パスを書き込むこともできます。
ru: Или же вы можете записать полный или относительный путь к файлу.
zh_cn: 另外,你也可以写出文件的完整或相对路径。

source: Alternatively, you can write the full path to the graphic.
es: Alternativamente,puedes escribir la ruta completa del gráfico.
ja: あるいは、グラフィックへのフルパスを書くこともできます。
ru: Или же вы можете написать полный путь к графике.
zh_cn: 另外,你也可以写出图形的完整路径。

source: Although <code>quad</code> returns a nonzero value for <var>ier</var>, the result is reasonably accurate (to see why, examine what happens to the result if you move the lower bound to 0.1, then 0.01, then 0.001, etc.).
es: Aunque <code>quad</code> devuelve un valor distinto de cero para <var>ier</var> , el resultado es razonablemente preciso (para ver por qu&eacute;, examine qu&eacute; sucede con el resultado si mueve el l&iacute;mite inferior a 0.1, luego a 0.01, luego a 0.001, etc.).
ja: けれども <code>quad</code> にゼロ以外の値を返す <var>ier</var> 、結果が合理的に正確である（あなたがして、その後0.1、0.01、0.001、などに下限移動した場合、結果がどうなるかを調べて、理由を知るために）。
ru: Хотя <code>quad</code> возвращает ненулевое значение для <var>ier</var> , результат достаточно точен (чтобы понять, почему, изучите, что произойдет с результатом, если вы переместите нижнюю границу на 0,1, затем на 0,01, затем на 0,001 и т. Д.).
zh_cn: 尽管 <code>quad</code> 为 <var>ier</var> 返回了一个非零值，但结果是相当准确的（要知道为什么，请检查一下将下限移到0.1，然后是0.01，然后是0.001，等等，结果将如何变化）。

source: Although Octave does not automatically report an error if you call a function with more arguments than expected, doing so probably indicates that something is wrong. Octave also does not automatically report an error if a function is called with too few arguments, but any attempt to use a variable that has not been given a value will result in an error. To avoid such problems and to provide useful messages, we check for both possibilities and issue our own error message.
es: Aunque Octava no informa automáticamente de un error si llama a una función con más argumentos de los esperados,hacerlo probablemente indica que algo está mal.Octava tampoco informa automáticamente de un error si se llama a una función con muy pocos argumentos,pero cualquier intento de utilizar una variable a la que no se le ha dado un valor dará lugar a un error.Para evitar tales problemas y proporcionar mensajes útiles,comprobamos ambas posibilidades y emitimos nuestro propio mensaje de error.
ja: Octaveは,期待されているよりも多くの引数を持つ関数を呼び出しても,自動的にエラーを報告しませんが,そうすることは,おそらく何かが間違っていることを示しています。Octaveはまた,関数が少なすぎる引数で呼び出されても自動的にエラーを報告しませんが,値が与えられていない変数を使おうとするとエラーになります。そのような問題を避け,有用なメッセージを提供するために,我々は両方の可能性をチェックし,我々自身のエラーメッセージを発行します。
ru: Хотя Октава не сообщает об ошибке автоматически,если Вы вызываете функцию с большим количеством аргументов,чем ожидалось,это,вероятно,указывает на то,что что-то не так.Октава также не сообщает об ошибке автоматически,если функция вызывается со слишком малым количеством аргументов,но любая попытка использовать переменную,которой не было присвоено значение,приведет к ошибке.Чтобы избежать таких проблем и предоставить полезные сообщения,мы проверяем обе возможности и выдаем собственное сообщение об ошибке.
zh_cn: 虽然Octave不会在调用一个参数多于预期的函数时自动报错,但这样做很可能说明有问题。如果调用的函数参数太少,Octave也不会自动报错,但任何使用未给定值的变量的尝试都会导致错误。为了避免这样的问题,并提供有用的信息,我们检查这两种可能性,并发布我们自己的错误信息。

source: Although Octave normally executes commands from script files that have the name
es: Aunque Octava normalmente ejecuta los comandos de los archivos de escritura que tienen el nombre
ja: Octaveは通常,以下の名前を持つスクリプトファイルからコマンドを実行します。
ru: Хотя Октава обычно выполняет команды из файлов сценариев,которые имеют имя
zh_cn: 虽然Octave通常会执行来自脚本文件的命令,这些脚本文件的名称是

source: Although Octave uses a compressed column format, it should be noted that compressed row formats are equally possible. However, in the context of mixed operations between mixed sparse and dense matrices, it makes sense that the elements of the sparse matrices are in the same order as the dense matrices. Octave stores dense matrices in column major ordering, and so sparse matrices are equally stored in this manner.
es: Aunque Octava utiliza un formato de columna comprimido,cabe señalar que los formatos de fila comprimidos son igualmente posibles.Sin embargo,en el contexto de operaciones mixtas entre matrices mixtas dispersas y densas,tiene sentido que los elementos de las matrices dispersas estén en el mismo orden que las matrices densas.Octava almacena las matrices densas en orden de columnas principales,y así las matrices raras se almacenan igualmente de esta manera.
ja: Octaveは圧縮列形式を使用していますが,圧縮行形式も同様に可能であることに注意する必要があります。しかし,疎な行列と密な行列の混合演算の文脈では,疎な行列の要素が密な行列と同じ順序であることは理にかなっています。Octaveは密な行列を列のメジャー順序で格納しますので,疎な行列はこの方法で等しく格納されます。
ru: Хотя Октава использует формат сжатых столбцов,следует отметить,что форматы сжатых рядов одинаково возможны.Однако в контексте смешанных операций между смешанными разреженными и плотными матрицами имеет смысл,чтобы элементы разреженных матриц находились в том же порядке,что и плотные матрицы.Октава хранит плотные матрицы в порядке следования колонок,поэтому разреженные матрицы хранятся в том же порядке,что и плотные матрицы.
zh_cn: 虽然Octave使用的是压缩列格式,但需要注意的是,压缩行格式也同样可以。但是,在混合稀疏矩阵和密集矩阵混合运算的情况下,稀疏矩阵的元素与密集矩阵的顺序相同是合理的。Octave以列主序存储密集矩阵,因此稀疏矩阵同样以这种方式存储。

source: Although a range constant specifies a row vector, Octave does <em>not</em> normally convert range constants to vectors unless it is necessary to do so. This allows you to write a constant like <code>1 : 10000</code> without using 80,000 bytes of storage on a typical 32-bit workstation.
es: Aunque una constante de rango especifica un vector de fila, Octave normalmente <em>no</em> convierte las constantes de rango en vectores a menos que sea necesario hacerlo. Esto le permite escribir una constante como <code>1 : 10000</code> sin utilizar 80.000 bytes de almacenamiento en una estaci&oacute;n de trabajo t&iacute;pica de 32 bits.
ja: 範囲定数は行ベクトルを指定しますが、必要がない限り、Octaveは通常、範囲定数をベクトルに変換しませ<em>ん</em>。これにより、典型的な32ビットワークステーションで80,000バイトのストレージを使用せずに、 <code>1 : 10000</code> ような定数を書き込むことができます。
ru: Хотя константа диапазона определяет вектор-строку, Octave обычно <em>не</em> преобразует константы диапазона в векторы, если в этом нет необходимости. Это позволяет вам записывать константу типа <code>1 : 10000</code> не используя 80 000 байт памяти на типичной 32-битной рабочей станции.
zh_cn: 尽管范围常数指定了行向量，但是Octave通常<em>不会</em>将范围常数转换为向量，除非有必要这样做。这样，您就可以在不使用典型32位工作站上80,000字节存储空间的情况下编写 <code>1 : 10000</code> 类的常量。

source: Although accepted, the argument <var>-completenames</var> is silently ignored. Octave always returns absolute filenames.
es: Aunque se acepta, el argumento <var>-completenames</var> se ignora en silencio. Octave siempre devuelve nombres de archivo absolutos.
ja: 受け入れられますが、引数 <var>-completenames</var> は暗黙的に無視されます。Octaveは常に絶対ファイル名を返します。
ru: Хотя аргумент <var>-completenames</var> принят, он игнорируется. Octave всегда возвращает абсолютные имена файлов.
zh_cn: 尽管已接受参数 <var>-completenames</var> ,但它会被静默忽略。八度总是返回绝对文件名。

source: Although default values may be set for any object, they are set in parent objects and apply to child objects, of the specified object type. For example, setting the default <code>color</code> property of <code>line</code> objects to <code>"green"</code>, for the <code>root</code> object, will result in all <code>line</code> objects inheriting the <code>color</code><code>"green"</code> as the default value.
es: Aunque los valores predeterminados se pueden establecer para cualquier objeto, se establecen en los objetos principales y se aplican a los objetos secundarios del tipo de objeto especificado. Por ejemplo, si se establece la propiedad de <code>color</code> predeterminada de los objetos de <code>line</code> en <code>"green"</code> , para el objeto <code>root</code> , todos los objetos de <code>line</code> heredar&aacute;n el <code>color</code> <code>"green"</code> como valor predeterminado.
ja: デフォルト値は任意のオブジェクトに設定できますが、指定したオブジェクトタイプの親オブジェクトに設定され、子オブジェクトに適用されます。たとえば、 <code>root</code> オブジェクトの <code>line</code> オブジェクトのデフォルトの <code>color</code> プロパティを <code>"green"</code> に設定すると、すべての <code>line</code> オブジェクトがデフォルト値として <code>"green"</code> の <code>color</code> 継承します。
ru: Хотя значения по умолчанию могут быть установлены для любого объекта, они устанавливаются в родительских объектах и ​​применяются к дочерним объектам указанного типа объекта. Например, установка по умолчанию в <code>color</code> свойства <code>line</code> объектов на <code>"green"</code> , для <code>root</code> объекта, приведет все <code>line</code> объектов наследуя <code>color</code> <code>"green"</code> в качестве значения по умолчанию.
zh_cn: 尽管可以为任何对象设置默认值，但是它们在指定对象类型的父对象中设置并应用于子对象。例如，将 <code>line</code> 对象的默认 <code>color</code> 属性设置为 <code>root</code> 对象的 <code>"green"</code> ，将导致所有 <code>line</code> 对象继承 <code>color</code> <code>"green"</code> 作为默认值。

source: Although it is possible to put comment lines into keyboard-composed, throw-away Octave programs, it usually isn&rsquo;t very useful because the purpose of a comment is to help you or another person understand the program at a later time.
es: Aunque es posible poner l&iacute;neas de comentarios en programas Octave desechables y compuestos por teclado, generalmente no es muy &uacute;til porque el prop&oacute;sito de un comentario es ayudarlo a usted oa otra persona a comprender el programa en un momento posterior.
ja: キーボードで構成された使い捨てのOctaveプログラムにコメント行を入れることは可能ですが、コメントの目的は、後であなたや他の人がプログラムを理解するのに役立つため、通常はあまり役に立ちません。
ru: Хотя можно помещать строки комментариев в программы Octave, составленные с помощью клавиатуры, обычно это не очень полезно, потому что цель комментария - помочь вам или другому человеку понять программу в более позднее время.
zh_cn: 尽管可以将注释行放入由键盘组成的一次性Octave程序中，但是它通常不是很有用，因为注释的目的是帮助您或其他人稍后理解该程序。

source: Although it is possible to rewrite all <code>for</code> loops as <code>while</code> loops, the Octave language has both statements because often a <code>for</code> loop is both less work to type and more natural to think of. Counting the number of iterations is very common in loops and it can be easier to think of this counting as part of looping rather than as something to do inside the loop.
es: Aunque es posible volver a escribir todo <code>for</code> bucles tan <code>while</code> los bucles, el lenguaje de Octave tiene dos estados, porque a menudo una <code>for</code> bucle es tanto menos trabajo para escribir y m&aacute;s natural pensar. Contar el n&uacute;mero de iteraciones es muy com&uacute;n en los bucles y puede ser m&aacute;s f&aacute;cil pensar en este conteo como parte del bucle en lugar de como algo que hacer dentro del bucle.
ja: すべての <code>for</code> ループを <code>while</code> ループのように書き直すことは可能ですが、多くの場合、 <code>for</code> ループは入力する作業が少なく、考えるのが自然であるため、Octave言語には両方のステートメントがあります。ループでは反復回数を数えることは非常に一般的であり、この数え方は、ループ内で行うものとしてではなく、ループの一部として考える方が簡単です。
ru: Хотя можно переписать все циклы <code>for</code> как циклы <code>while</code> , в языке Octave есть оба оператора, потому что часто цикл <code>for</code> требует меньше работы для ввода и более естественного представления. Подсчет количества итераций очень распространен в циклах, и может быть проще думать об этом как о части цикла, а не как о чем-то, что нужно делать внутри цикла.
zh_cn: 尽管可以将所有的 <code>for</code> 循环重写为 <code>while</code> 循环，但是Octave语言同时具有这两种语句，因为通常 <code>for</code> 循环的工作量较小，而且想起来也很自然。计算循环中的迭代次数是很常见的，将计数视为循环的一部分而不是在循环内部进行操作会更容易。

source: Although the user should only include
es: Aunque el usuario sólo debe incluir
ja: ユーザーは
ru: Хотя пользователь должен включать только
zh_cn: 虽然用户应该只包括

source: Although there cannot be multiple entry points in a single mex-file, one can use the <code>mexFunctionName</code> function to determine what name the mex-file was called with. This can be used to alter the behavior of the mex-file based on the function name. For example, if
es: Aunque no puede haber varios puntos de entrada en un solo archivo mex, se puede usar la funci&oacute;n <code>mexFunctionName</code> para determinar con qu&eacute; nombre se llam&oacute; el archivo mex. Esto se puede usar para alterar el comportamiento del archivo mex seg&uacute;n el nombre de la funci&oacute;n. Por ejemplo, si
ja: 1つのmex-fileに複数のエントリポイントを <code>mexFunctionName</code> ことはできませんが、mexFunctionName関数を使用して、mex-fileの呼び出しに使用された名前を判別できます。これを使用して、関数名に基づいてmexファイルの動作を変更できます。たとえば、
ru: Хотя в одном mex-файле не может быть нескольких точек входа, можно использовать функцию <code>mexFunctionName</code> , чтобы определить, с каким именем был вызван mex-файл. Это можно использовать для изменения поведения mex-файла в зависимости от имени функции. Например, если
zh_cn: 尽管单个mex文件中不能有多个入口点，但是可以使用 <code>mexFunctionName</code> 函数来确定调用mex文件的名称。这可用于根据函数名称更改mex文件的行为。例如，如果

source: Although this is inconsistent with the normal behavior of Octave&rsquo;s lexer, which usually prefers to break the input into tokens by preferring the longest possible match at any given point, it is more useful in this case.
es: Aunque esto es inconsistente con el comportamiento normal del lexer de Octave, que por lo general prefiere dividir la entrada en tokens prefiriendo la coincidencia m&aacute;s larga posible en cualquier punto dado, es m&aacute;s &uacute;til en este caso.
ja: これは、Octaveのレクサーの通常の動作と一致していませんが、通常、任意の時点で可能な限り最長の一致を優先することにより、入力をトークンに分割することを優先しますが、この場合はより便利です。
ru: Хотя это несовместимо с обычным поведением лексера Octave, который обычно предпочитает разбивать ввод на токены, отдавая предпочтение самому длинному из возможных совпадений в любой заданной точке, в данном случае это более полезно.
zh_cn: 尽管这与Octave的词法分析器的正常行为不一致，后者通常倾向于通过在任意给定点上选择尽可能长的匹配项来将输入分解为令牌，但在这种情况下它更有用。

source: Always include a plus or minus sign in the result.
es: Incluya siempre un signo más o menos en el resultado.
ja: 結果には必ずプラスまたはマイナス記号を入れてください。
ru: Всегда включайте в результат знак "плюс" или "минус".
zh_cn: 始终在结果中包含一个加号或减号。

source: Always include a proper bug report for the problem you think you have fixed. We need to convince ourselves that the change is right before installing it. Even if it is right, we might have trouble judging it if we don&rsquo;t have a way to reproduce the problem.
es: Incluya siempre un informe de error adecuado para el problema que cree haber solucionado. Necesitamos convencernos de que el cambio es correcto antes de instalarlo. Incluso si es correcto, podr&iacute;amos tener problemas para juzgarlo si no tenemos una forma de reproducir el problema.
ja: 修正したと思われる問題については、必ず適切なバグレポートを含めてください。インストールする前に、変更が正しいことを納得させる必要があります。たとえそれが正しいとしても、問題を再現する方法がないと、判断が難しい場合があります。
ru: Всегда включайте надлежащий отчет об ошибке для проблемы, которую вы считаете исправленной. Нам нужно убедить себя в правильности внесенного изменения перед его установкой. Даже если это верно, у нас могут возникнуть проблемы с его оценкой, если у нас нет способа воспроизвести проблему.
zh_cn: 始终针对您认为已解决的问题提供适当的错误报告。我们需要说服自己，更改才是正确的，然后再安装。即使是正确的，但是如果我们没有办法重现问题，我们可能会很难判断。

source: An <em>assignment</em> is an expression that stores a new value into a variable. For example, the following expression assigns the value 1 to the variable <code>z</code>:
es: Una <em>asignaci&oacute;n</em> es una expresi&oacute;n que almacena un nuevo valor en una variable. Por ejemplo, la siguiente expresi&oacute;n asigna el valor 1 a la variable <code>z</code> :
ja: <em>割り当ては、</em>変数に新しい値を格納式です。たとえば、次の式は値1を変数 <code>z</code> に割り当てます。
ru: <em>Присваивания</em> является выражением , которое сохраняет новое значение в переменную. Например, следующее выражение присваивает значение 1 переменной <code>z</code> :
zh_cn: 的<em>分配</em>是用于存储一个新值到一个变量的表达式。例如，以下表达式将值1分配给变量 <code>z</code> ：

source: An <em>element-by-element boolean expression</em> is a combination of comparison expressions using the boolean operators &ldquo;or&rdquo; (&lsquo;
es: Una <em>expresi&oacute;n booleana elemento por elemento</em> es una combinaci&oacute;n de expresiones de comparaci&oacute;n que utilizan los operadores booleanos "o" ('
ja: <em>要素ごとのブール式は</em>「ブール演算子を使用して比較式の組み合わせである「または」（
ru: <em>Выражение логического элемента-на-элемент</em> представляет собой комбинацию из выражений сравнения с использованием логических операторов &laquo;или&raquo; (&raquo;
zh_cn: 一个<em>元件逐元素布尔表达式</em>是使用布尔运算符&ldquo;或&rdquo;比较表达式的组合（&rdquo;

source: An <em>index expression</em> allows you to reference or extract selected elements of a vector, a matrix (2-D), or a higher-dimensional array.
es: Una <em>expresi&oacute;n de &iacute;ndice le</em> permite hacer referencia o extraer elementos seleccionados de un vector, una matriz (2-D) o una matriz de dimensiones superiores.
ja: <em>インデックス式は、</em>あなたが参照またはベクトルの抽出選択された要素、マトリックス（2-D）、またはより高い次元配列することを可能にします。
ru: <em>Выражение индекса</em> позволяет ссылаться или экстракт выбранных элементов вектора, матрица (2-D), или выше , одномерный массив.
zh_cn: 一个<em>索引表达式</em>允许你的矢量的参考或提取选定的元素，一个矩阵（2- d），或更高的维阵列。

source: An Empty Exercise
es: Un ejercicio vacío
ja: 空の運動
ru: Пустое упражнение
zh_cn: 一个空的练习

source: An Improved Incomplete Cholesky Factorization
es: Una mejor factorización incompleta de Cholesky
ja: 改良された不完全コレスキー因数分解
ru: Улучшенная неполная факторизация Холески
zh_cn: 一种改进的不完全Cholesky因子法

source: An additional input argument <var>thres</var>, that defines the pivoting threshold can be given. <var>thres</var> can be a scalar, in which case it defines the <small>UMFPACK</small> pivoting tolerance for both symmetric and unsymmetric cases. If <var>thres</var> is a 2-element vector, then the first element defines the pivoting tolerance for the unsymmetric <small>UMFPACK</small> pivoting strategy and the second for the symmetric strategy. By default, the values defined by <code>spparms</code> are used ([0.1, 0.001]).
es: Se puede dar un argumento de entrada adicional <var>thres</var> , que define el umbral de pivote. <var>thres</var> puede ser un escalar, en cuyo caso define la tolerancia pivotante <small>UMFPACK</small> para casos sim&eacute;tricos y asim&eacute;tricos. Si <var>thres</var> es un vector de 2 elementos, entonces el primer elemento define la tolerancia de pivote para la estrategia de pivote <small>UMFPACK</small> asim&eacute;trica y el segundo para la estrategia sim&eacute;trica. De forma predeterminada, se utilizan los valores definidos por <code>spparms</code> ([0,1, 0,001]).
ja: ピボットしきい値を定義 <var>thres</var> 追加の入力引数thresを指定できます。 <var>thres</var> はスカラーにすることができます。その場合、対称と非対称の両方の場合の<small>UMFPACK</small>ピボット許容値が定義されます。場合 <var>thres</var> 2要素ベクトルであり、その後、最初の要素は、非対称のために旋回公差定義<small>UMFPACKの</small>旋回戦略および対称戦略の秒。デフォルトでは、 <code>spparms</code> によって定義された値が使用されます（[ 0.1、0.001 ]）。
ru: Можно <var>thres</var> дополнительный входной аргумент thres , который определяет порог поворота. <var>thres</var> может быть скаляром, и в этом случае он определяет <small>допуск</small> поворота <small>UMFPACK</small> как для симметричных, так и для несимметричных случаев. Если <var>thres</var> является двухэлементным вектором, то первый элемент определяет допуск поворота для несимметричной стратегии поворота <small>UMFPACK</small> , а второй - для симметричной стратегии. По умолчанию используются значения, определенные <code>spparms</code> ([0.1, 0.001]).
zh_cn: 可以提供定义枢轴阈值的附加输入参数 <var>thres</var> 。 <var>thres</var> 可以是标量，在这种情况下，它定义了对称和不对称情况下的<small>UMFPACK</small>枢轴公差。如果 <var>thres</var> 是2元素向量，则第一个元素定义非对称<small>UMFPACK</small>旋转策略的旋转公差，第二个元素定义对称策略的旋转公差。默认情况下，使用 <code>spparms</code> 定义的值（[ 0.1，0.001 ]）。

source: An additional input argument <var>thresh</var> that defines the pivoting threshold can be given. <var>thresh</var> can be a scalar, in which case it defines the <small>UMFPACK</small> pivoting tolerance for both symmetric and unsymmetric cases. If <var>thresh</var> is a 2-element vector, then the first element defines the pivoting tolerance for the unsymmetric <small>UMFPACK</small> pivoting strategy and the second for the symmetric strategy. By default, the values defined by <code>spparms</code> are used ([0.1, 0.001]).
ja: 付加的な入力引数 <var>thresh</var> 旋回閾値を定義する与えることができます。 <var>thresh</var> はスカラーにすることができます。その場合、対称と非対称の両方の場合の<small>UMFPACK</small>ピボット許容値を定義し<small>ます</small>。場合 <var>thresh</var> 2要素ベクトルであり、その後、最初の要素は、非対称のために旋回公差定義<small>UMFPACK</small>戦略および対称戦略の第二の枢動を。デフォルトでは、 <code>spparms</code> によって定義された値が使用されます（[ 0.1、0.001 ]）。
zh_cn: 可以给出定义旋转阈值的附加输入参数 <var>thresh</var> 。 <var>thresh</var> 可以是一个标量，在这种情况下，它定义了对称和不对称情况下的<small>UMFPACK</small>枢轴公差。如果 <var>thresh</var> 是2元素向量，则第一个元素定义非对称<small>UMFPACK</small>旋转策略的旋转公差，第二个元素定义对称策略的旋转公差。默认情况下，使用由 <code>spparms</code> 定义的值（[ 0.1，0.001 ]）。

source: An alternative expression to evaluate, so that the speed of two expressions can be directly compared. The default is <code>[]</code>.
es: Una expresi&oacute;n alternativa para evaluar, de modo que la velocidad de dos expresiones se pueda comparar directamente. El valor predeterminado es <code>[]</code> .
ja: 2つの式の速度を直接比較できるように、評価する代替式。デフォルトは <code>[]</code> です。
ru: Альтернативное выражение для оценки, чтобы можно было напрямую сравнивать скорость двух выражений. По умолчанию - <code>[]</code> .
zh_cn: 评估一个替代表达式，以便可以直接比较两个表达式的速度。默认值为 <code>[]</code> 。
