Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/octave/octave.*.011.xlf
Languages: es, ja, ru, zh_cn

source: An index expression consists of a set of parentheses enclosing <em>M</em> expressions separated by commas. Each individual index value, or component, is used for the respective dimension of the object that it is applied to. In other words, the first index component is used for the first dimension (rows) of the object, the second index component is used for the second dimension (columns) of the object, and so on. The number of index components <em>M</em> defines the dimensionality of the index expression. An index with two components would be referred to as a 2-D index because it has two dimensions.
es: Una expresi&oacute;n de &iacute;ndice consta de un conjunto de par&eacute;ntesis que encierran <em>M</em> expresiones separadas por comas. Cada valor o componente de &iacute;ndice individual se utiliza para la dimensi&oacute;n respectiva del objeto al que se aplica. En otras palabras, el primer componente de &iacute;ndice se usa para la primera dimensi&oacute;n (filas) del objeto, el segundo componente de &iacute;ndice se usa para la segunda dimensi&oacute;n (columnas) del objeto, y as&iacute; sucesivamente. El n&uacute;mero de componentes del &iacute;ndice <em>M</em> define la dimensionalidad de la expresi&oacute;n del &iacute;ndice. Un &iacute;ndice con dos componentes se denominar&iacute;a &iacute;ndice 2-D porque tiene dos dimensiones.
ja: インデックス式は、コンマで区切られた<em>M</em>式を囲む括弧のセットで構成されます。個々のインデックス値またはコンポーネントは、それが適用されるオブジェクトのそれぞれの次元に使用されます。つまり、最初のインデックスコンポーネントはオブジェクトの最初の次元（行）に使用され、2番目のインデックスコンポーネントはオブジェクトの2番目の次元（列）に使用されます。インデックスコンポーネントの数<em>M</em>は、インデックス式の次元を定義します。 2つのコンポーネントを持つインデックスは、2次元であるため、2-Dインデックスと呼ばれます。
ru: Выражение индекса состоит из набора круглых скобок, заключающих <em>M</em> выражений, разделенных запятыми. Каждое отдельное значение индекса или компонент используется для соответствующего измерения объекта, к которому оно применяется. Другими словами, первый компонент индекса используется для первого измерения (строк) объекта, второй компонент индекса используется для второго измерения (столбцов) объекта и так далее. Количество компонентов индекса <em>M</em> определяет размерность выражения индекса. Индекс с двумя компонентами будет называться двумерным индексом, потому что он имеет два измерения.
zh_cn: 索引表达式由一组括号组成，这些括号包含用逗号分隔的<em>M个</em>表达式。每个单独的索引值或分量都用于对其应用到的对象的相应尺寸。换句话说，第一索引分量用于对象的第一维度（行），第二索引分量用于对象的第二维度（列），依此类推。索引分量的数量<em>M</em>定义了索引表达式的维数。具有两个分量的索引将被称为2-D索引，因为它具有两个维度。

source: An indexed image consists of an M-by-N matrix of integers and a C-by-3 color map. Each integer corresponds to an index in the color map, and each row in the color map corresponds to an RGB color. The color map must be of class <code>double</code> with values between 0 and 1.
es: Una imagen indexada consta de una matriz de n&uacute;meros enteros M-por-N y un mapa de colores de C-por-3. Cada n&uacute;mero entero corresponde a un &iacute;ndice en el mapa de colores y cada fila en el mapa de colores corresponde a un color RGB. El mapa de colores debe ser de clase <code>double</code> con valores entre 0 y 1.
ja: インデックス付きイメージは、整数のM行N列の行列とC行3列のカラーマップで構成されます。各整数はカラーマップのインデックスに対応し、カラーマップの各行はRGBカラーに対応します。カラーマップは、クラス <code>double</code> で、値は0〜1でなければなりません。
ru: Индексированное изображение состоит из матрицы целых чисел M-by-N и цветовой карты C-by-3. Каждое целое число соответствует индексу в цветовой карте, а каждая строка в цветовой карте соответствует цвету RGB. Цветовая карта должна быть <code>double</code> класса со значениями от 0 до 1.
zh_cn: 索引图像由整数的M&times;N矩阵和C&times;3色图组成。每个整数对应于颜色图中的索引，并且颜色图中的每一行对应于RGB颜色。颜色图必须是 <code>double</code> 类，其值在0到1之间。

source: An indicator of convergence. 0 indicates that the iteration count was exceeded, and therefore convergence was not reached; &gt;0 indicates that the algorithm converged. (The algorithm is stable and will converge given enough iterations.)
es: Un indicador de convergencia. 0 indica que se super&oacute; el recuento de iteraciones y, por lo tanto, no se alcanz&oacute; la convergencia; &gt; 0 indica que el algoritmo convergi&oacute;. (El algoritmo es estable y converger&aacute; dadas suficientes iteraciones).
ja: 収束の指標。0は反復回数を超えたため、収束に到達しなかったことを示します。&gt; 0は、アルゴリズムが収束したことを示します。（アルゴリズムは安定しており、十分な反復があれば収束します。）
ru: Индикатор конвергенции. 0 указывает, что количество итераций было превышено, и поэтому сходимость не была достигнута; &gt; 0 указывает, что алгоритм сошелся. (Алгоритм стабилен и сойдется при достаточном количестве итераций.)
zh_cn: 趋同指标。0表示已超过迭代次数，因此未达到收敛；&gt; 0表示算法已收敛。（该算法稳定，并且在进行足够的迭代后会收敛。）

source: An inequality constraint with an upper bound (<code>A(i,:)*x &lt;= b(i)</code>).
es: Una restricci&oacute;n de desigualdad con un l&iacute;mite superior ( <code>A(i,:)*x &lt;= b(i)</code> ).
ja: 上限のある不等式制約（ <code>A(i,:)*x &lt;= b(i)</code> ）。
ru: Ограничение неравенства с верхней границей ( <code>A(i,:)*x &lt;= b(i)</code> ).
zh_cn: 具有上限（ <code>A(i,:)*x &lt;= b(i)</code> ）的不等式约束。

source: An inequality constraint with both upper and lower bounds (<code>A(i,:)*x &gt;= -b(i)</code>) <em>and</em> (<code>A(i,:)*x &lt;= b(i)</code>).
es: Una restricci&oacute;n de desigualdad con l&iacute;mites superior e inferior ( <code>A(i,:)*x &gt;= -b(i)</code> ) <em>y</em> ( <code>A(i,:)*x &lt;= b(i)</code> ).
ja: 上限と下限の両方を持つ不等式制約（ <code>A(i,:)*x &gt;= -b(i)</code> ）<em>および</em>（ <code>A(i,:)*x &lt;= b(i)</code> ）。
ru: Ограничение неравенства с верхними и нижними границами ( <code>A(i,:)*x &gt;= -b(i)</code> ) <em>и</em> ( <code>A(i,:)*x &lt;= b(i)</code> ).
zh_cn: 具有上限和下限（ <code>A(i,:)*x &gt;= -b(i)</code> ）<em>和</em>（ <code>A(i,:)*x &lt;= b(i)</code> ）的不等式约束。

source: An inequality with a lower bound (<code>A(i,:)*x &gt;= b(i)</code>).
es: Una desigualdad con un l&iacute;mite inferior ( <code>A(i,:)*x &gt;= b(i)</code> ).
ja: 下限のある不等式（ <code>A(i,:)*x &gt;= b(i)</code> ）。
ru: Неравенство с нижней границей ( <code>A(i,:)*x &gt;= b(i)</code> ).
zh_cn: 下界不等式（ <code>A(i,:)*x &gt;= b(i)</code> ）。

source: An inline function is created from a string containing the function body using the <code>inline</code> function. The following code defines the function <em>f(x) = x^2 + 2</em>.
es: Una funci&oacute;n en l&iacute;nea se crea a partir de una cadena que contiene el cuerpo de la funci&oacute;n utilizando la funci&oacute;n en <code>inline</code> . El siguiente c&oacute;digo define la funci&oacute;n <em>f (x) = x ^ 2 + 2</em> .
ja: インライン関数は、 <code>inline</code> 関数を使用して、関数本体を含む文字列から作成されます。次のコードは、関数<em>f（x）= x ^ 2 + 2を</em>定義します。
ru: Встроенная функция создается из строки, содержащей тело функции, с помощью <code>inline</code> функции. Следующий код определяет функцию <em>f (x) = x ^ 2 + 2</em> .
zh_cn: 使用内联函数从包含函数主体的字符串创建 <code>inline</code> 函数。以下代码定义函数<em>f（x）= x ^ 2 + 2</em>。

source: An integer indicating the status of the solution.
es: Un número entero que indica el estado de la solución.
ja: 解の状態を示す整数。
ru: Целое число,указывающее на статус решения.
zh_cn: 表示解决方案状态的整数。

source: An integer variable.
es: Una variable entera.
ja: 整数変数。
ru: Целую переменную.
zh_cn: 一个整数变量。

source: An isosurface connects points with the same value and is analogous to a contour plot, but in three dimensions.
es: Una isosuperficie conecta puntos con el mismo valor y es análoga a una gráfica de contorno,pero en tres dimensiones.
ja: 等値面は、同じ値を持つ点を結んだもので、等高線図に似ていますが、3次元です。
ru: Изо-поверхность соединяет точки с одинаковым значением и является аналогом контурного графика,но в трех измерениях.
zh_cn: 等值线连接具有相同值的点,类似于等值线图,但在三维空间。

source: An m-file for the differential equation used above is included with the Octave distribution in the examples directory under the name
es: Un archivo m para la ecuación diferencial utilizada anteriormente se incluye con la distribución Octava en el directorio de ejemplos bajo el nombre de
ja: 上記で使用した微分方程式のためのmファイルが,examplesディレクトリのOctaveディストリビューションに含まれています。
ru: m-файл для используемого выше дифференциального уравнения включен в распределение Октав в каталоге примеров под именем
zh_cn: 上面使用的微分方程的m文件包含在Octave发行版的例子目录中,文件名为

source: An object can be resized to more dimensions than it has; in such case the missing dimensions are assumed to be 1. Resizing an object to fewer dimensions is not possible.
es: Un objeto puede ser redimensionado a más dimensiones de las que tiene;en tal caso se supone que las dimensiones que faltan son 1.No es posible redimensionar un objeto a menos dimensiones.
ja: オブジェクトは、それが持っている寸法よりも多くの寸法にリサイズすることができます;その場合、欠落している寸法は1と仮定されます。オブジェクトをより少ない寸法にリサイズすることはできません。
ru: Объект может быть изменен на большее количество размеров,чем у него есть;в этом случае пропущенные размеры принимаются равными 1.Изменение размера объекта на меньшее количество размеров невозможно.
zh_cn: 可以将对象的尺寸调整到比它所拥有的尺寸更多的尺寸;在这种情况下,缺失的尺寸被假定为1。不可能将对象调整到较少的尺寸。

source: An object of class <code>polynomial2</code> is created by calling the class constructor:
es: Un objeto de la clase <code>polynomial2</code> se crea llamando al constructor de la clase:
ja: クラス <code>polynomial2</code> のオブジェクトは、クラスコンストラクターを呼び出すことによって作成されます。
ru: Объект класса <code>polynomial2</code> создается путем вызова конструктора класса:
zh_cn: 通过调用类构造函数来创建类 <code>polynomial2</code> 的对象：

source: An obvious way to do this is by storing the elements of the matrix as triplets, with two elements being their position in the array (rows and column) and the third being the data itself. This is conceptually easy to grasp, but requires more storage than is strictly needed.
es: Una forma obvia de hacerlo es almacenar los elementos de la matriz como trillizos,siendo dos elementos su posición en la matriz (filas y columna)y el tercero los datos propiamente dichos.Esto es conceptualmente fácil de comprender,pero requiere más almacenamiento del estrictamente necesario.
ja: これを行う明白な方法は,行列の要素を三重項として格納し,2 つの要素を配列内の位置(行と列)とし,3 つ目の要素をデータそのものとすることです.これは概念的には簡単に理解できますが,厳密には必要以上のストレージが必要になります.
ru: Очевидный способ сделать это-хранить элементы матрицы в виде триплетов,причем два элемента-это их положение в массиве (строки и столбец),а третий-это сами данные.Концептуально это легко понять,но требует большего объема хранения,чем это необходимо.
zh_cn: 一个显而易见的方法是将矩阵中的元素存储为三倍体,其中两个元素是它们在数组中的位置(行和列),第三个是数据本身。这在概念上很容易掌握,但需要比严格意义上的需要更多的存储量。

source: An optional <em>flag character</em> &lsquo;
es: Un <em>car&aacute;cter de bandera</em> opcional '
ja: オプションの<em>フラグ文字</em> '
ru: Необязательный <em>символ флага</em> '
zh_cn: 可选的<em>标志字符</em> '

source: An optional <em>precision</em> to specify the number of digits to be written for the numeric conversions. If the precision is specified, it consists of a period (&lsquo;
es: Una <em>precisi&oacute;n</em> opcional para especificar el n&uacute;mero de d&iacute;gitos que se escribir&aacute;n para las conversiones num&eacute;ricas. Si se especifica la precisi&oacute;n, consta de un punto ('
ja: 数値変換のために書き込まれる桁数を指定するオプションの<em>精度</em>。精度が指定されている場合、それはピリオド（ '
ru: Необязательная <em>точность</em> для указания количества цифр, записываемых для числовых преобразований. Если точность указана, она состоит из точки ('
zh_cn: 一种可选的<em>精度，</em>用于指定要为数字转换写入的位数。如果指定了精度，则它由一个句点（'

source: An optional <em>type modifier character</em>. This character is ignored by Octave&rsquo;s <code>printf</code> function, but is recognized to provide compatibility with the C language <code>printf</code>.
es: Un <em>car&aacute;cter modificador de tipo</em> opcional . La funci&oacute;n <code>printf</code> de Octave ignora este car&aacute;cter , pero se reconoce que proporciona compatibilidad con el lenguaje C <code>printf</code> .
ja: オプションの<em>タイプ修飾子</em>。この文字はOctaveの <code>printf</code> 関数では無視されますが、C言語の <code>printf</code> との互換性を提供するために認識されています。
ru: Необязательный <em>символ-модификатор типа</em> . Этот символ игнорируется Октав <code>printf</code> функции, но признается , чтобы обеспечить совместимость с языком C <code>printf</code> .
zh_cn: 一个可选的<em>类型修饰符</em>。Octave的 <code>printf</code> 函数将忽略此字符，但可以识别该字符以提供与C语言 <code>printf</code> 的兼容性。

source: An optional decimal integer specifying the <em>minimum field width</em>. If the normal conversion produces fewer characters than this, the field is padded with spaces to the specified width. This is a <em>minimum</em> value; if the normal conversion produces more characters than this, the field is <em>not</em> truncated. Normally, the output is right-justified within the field.
es: Un entero decimal opcional que especifica el <em>ancho m&iacute;nimo del campo</em> . Si la conversi&oacute;n normal produce menos caracteres que esto, el campo se rellena con espacios hasta el ancho especificado. Este es un valor <em>m&iacute;nimo</em> ; si la conversi&oacute;n normal produce m&aacute;s caracteres que &eacute;ste, el campo <em>no se</em> trunca. Normalmente, la salida se justifica a la derecha dentro del campo.
ja: <em>最小フィールド幅を</em>指定するオプションの10進整数。通常の変換で生成される文字数がこれより少ない場合、フィールドは指定された幅になるまでスペースが埋め込まれます。これは<em>最小</em>値です。通常の変換でこれより多くの文字が生成される場合、フィールドは切り捨てられ<em>ません</em>。通常、出力はフィールド内で右寄せされます。
ru: Необязательное десятичное целое число, определяющее <em>минимальную ширину поля</em> . Если обычное преобразование производит меньше символов, чем это, поле заполняется пробелами до указанной ширины. Это <em>минимальное</em> значение; если обычное преобразование производит больше символов, чем это, поле <em>не</em> усекается. Обычно вывод выравнивается по правому краю в пределах поля.
zh_cn: 一个可选的十进制整数，指定<em>最小字段宽度</em>。如果普通转换产生的字符少于此字符，则将字段填充为指定宽度的字段。这是<em>最小值</em>。如果普通转换产生的字符超过此数目，则该字段<em>不会</em>被截断。通常，输出在该字段内是右对齐的。

source: An optional decimal integer that specifies the <em>maximum field width</em>. Reading of characters from the input stream stops either when this maximum is reached or when a non-matching character is found, whichever happens first. Most conversions discard initial whitespace characters, and these discarded characters don&rsquo;t count towards the maximum field width. Conversions that do not discard initial whitespace are explicitly documented.
es: Un entero decimal opcional que especifica el <em>ancho m&aacute;ximo de campo</em> . La lectura de caracteres del flujo de entrada se detiene cuando se alcanza este m&aacute;ximo o cuando se encuentra un car&aacute;cter que no coincide, lo que ocurra primero. La mayor&iacute;a de las conversiones descartan los espacios en blanco iniciales y estos caracteres descartados no cuentan para el ancho m&aacute;ximo del campo. Las conversiones que no descartan los espacios en blanco iniciales se documentan expl&iacute;citamente.
ja: <em>最大フィールド幅</em>を指定するオプションの10進整数。入力ストリームからの文字の読み取りは、この最大値に達したとき、または一致しない文字が見つかったときのいずれかが最初に発生したときに停止します。ほとんどの変換では最初の空白文字が破棄され、これらの破棄された文字は最大フィールド幅にカウントされません。初期の空白を破棄しない変換は明示的に文書化されています。
ru: Необязательное десятичное целое число, указывающее <em>максимальную ширину поля</em> . Чтение символов из входного потока останавливается либо при достижении этого максимума, либо при обнаружении несовпадающего символа, в зависимости от того, что произойдет раньше. Большинство преобразований отбрасывают начальные пробельные символы, и эти отброшенные символы не учитываются при максимальной ширине поля. Преобразования, которые не отбрасывают начальные пробелы, явно документируются.
zh_cn: 一个可选的十进制整数，指定<em>最大字段宽度</em>。当达到此最大值或发现不匹配的字符时（以先发生者为准），将停止从输入流中读取字符。大多数转换会丢弃初始空白字符，并且这些丢弃的字符不会计入最大字段宽度。明确记录不放弃初始空格的转换。

source: An optional directory containing any files that are directly installed by the package. Typically this will include any <code>m</code>-files.
es: Un directorio opcional que contiene los archivos que el paquete instala directamente. Por lo general, esto incluir&aacute; cualquier archivo- <code>m</code> .
ja: パッケージによって直接インストールされるファイルを含むオプションのディレクトリ。通常、これには <code>m</code> ファイルが含まれます。
ru: Необязательный каталог, содержащий все файлы, непосредственно установленные пакетом. Обычно сюда входят любые <code>m</code> -файлы.
zh_cn: 一个可选目录，包含该软件包直接安装的所有文件。通常，这将包括任何 <code>m</code> 个文件。

source: An optional directory containing code that must be built prior to the packages installation. The Octave package manager will execute
es: Un directorio opcional que contiene el código que debe ser construido antes de la instalación de los paquetes.El gestor de paquetes Octave ejecutará
ja: パッケージのインストール前にビルドしなければならないコードを含むオプションのディレクトリです。Octaveパッケージマネージャは
ru: Необязательный каталог,содержащий код,который должен быть собран перед установкой пакетов.Менеджер пакетов Octave выполнит
zh_cn: 一个可选的目录,包含必须在安装包之前构建的代码。Octave软件包管理器将执行

source: An optional directory containing documentation for the package. The files in this directory will be directly installed in a sub-directory of the installed package for future reference.
es: Un directorio opcional que contiene la documentación del paquete.Los archivos de este directorio se instalarán directamente en un subdirectorio del paquete instalado para su futura referencia.
ja: パッケージのドキュメントを含むオプションのディレクトリ。このディレクトリのファイルは、将来の参照のために、 インストールされたパッケージのサブディレクトリに直接インストールされます。
ru: Дополнительный каталог,содержащий документацию к пакету.Файлы в этом каталоге будут непосредственно установлены в подкаталог инсталлированного пакета для дальнейшего использования.
zh_cn: 一个包含软件包文档的可选目录。该目录中的文件将直接安装在已安装包的子目录中,供将来参考。

source: An optional directory containing files that will be added to the Octave <code>EXEC_PATH</code> when the package is loaded. This might contain external scripts, etc., called by functions within the package.
es: Un directorio opcional que contiene archivos que se agregar&aacute;n a Octave <code>EXEC_PATH</code> cuando se cargue el paquete. Esto puede contener scripts externos, etc., llamados por funciones dentro del paquete.
ja: パッケージのロード時にOctave <code>EXEC_PATH</code> に追加されるファイルを含むオプションのディレクトリ。これには、パッケージ内の関数によって呼び出される外部スクリプトなどが含まれる場合があります。
ru: Необязательный каталог, содержащий файлы, которые будут добавлены в Octave <code>EXEC_PATH</code> при загрузке пакета. Он может содержать внешние сценарии и т. Д., Вызываемые функциями внутри пакета.
zh_cn: 可选目录，其中包含在加载程序包时将添加到Octave <code>EXEC_PATH</code> 的文件。它可能包含由程序包中的函数调用的外部脚本等。

source: An optional field with the column number at which the error occurred
es: Un campo opcional con el número de columna en el que se produjo el error
ja: エラーが発生した列番号を持つオプションのフィールド
ru: Необязательное поле с номером столбца,в котором произошла ошибка.
zh_cn: 可选字段,包含发生错误的列号。

source: An optional file that includes commands that are run when the package is added to the users path. Note that <code>PKG_ADD</code> directives in the source code of the package will also be added to this file by the Octave package manager. Note that symbolic links are to be avoided in packages, as symbolic links do not exist on some file systems, and so a typical use for this file is the replacement of the symbolic link
es: Un archivo opcional que incluye comandos que se ejecutan cuando el paquete se agrega a la ruta de los usuarios. Tenga en cuenta que el administrador de paquetes de Octave tambi&eacute;n <code>PKG_ADD</code> directivas PKG_ADD en el c&oacute;digo fuente del paquete a este archivo. Tenga en cuenta que los enlaces simb&oacute;licos deben evitarse en los paquetes, ya que los enlaces simb&oacute;licos no existen en algunos sistemas de archivos, por lo que un uso t&iacute;pico de este archivo es la sustituci&oacute;n del enlace simb&oacute;lico.
ja: パッケージがユーザーパスに追加されたときに実行されるコマンドを含むオプションファイル。パッケージのソースコード内の <code>PKG_ADD</code> ディレクティブも、Octaveパッケージマネージャーによってこのファイルに追加されることに注意してください。一部のファイルシステムにはシンボリックリンクが存在しないため、シンボリックリンクはパッケージでは避けてください。このファイルの一般的な用途は、シンボリックリンクの置き換えです。
ru: Необязательный файл, содержащий команды, запускаемые при добавлении пакета в путь пользователя. Обратите внимание, что директивы <code>PKG_ADD</code> в исходном коде пакета также будут добавлены в этот файл менеджером пакетов Octave. Обратите внимание, что в пакетах следует избегать символических ссылок, поскольку символические ссылки не существуют в некоторых файловых системах, и поэтому типичным использованием этого файла является замена символической ссылки.
zh_cn: 可选文件，其中包含将程序包添加到用户路径时运行的命令。请注意，程序包源代码中的 <code>PKG_ADD</code> 指令也将由Octave程序包管理器添加到此文件中。请注意，在软件包中应避免使用符号链接，因为某些文件系统上不存在符号链接，因此该文件的典型用法是替换符号链接

source: An optional file that includes commands that are run when the package is removed from the users path. Note that <code>PKG_DEL</code> directives in the source code of the package will also be added to this file by the Octave package manager. See <a href="pkg_005fadd-and-pkg_005fdel-directives#PKG_005fADD-and-PKG_005fDEL-Directives">PKG_ADD and PKG_DEL Directives</a>, for details on <code>PKG_DEL</code> directives.
es: Un archivo opcional que incluye comandos que se ejecutan cuando el paquete se elimina de la ruta de los usuarios. Tenga en cuenta que el administrador de paquetes de Octave tambi&eacute;n agregar&aacute; a este archivo las directivas <code>PKG_DEL</code> en el c&oacute;digo fuente del paquete. Consulte las <a href="pkg_005fadd-and-pkg_005fdel-directives#PKG_005fADD-and-PKG_005fDEL-Directives">Directivas PKG_ADD y PKG_DEL</a> para obtener detalles sobre <code>PKG_DEL</code> directivas PKG_DEL .
ja: パッケージがユーザーパスから削除されたときに実行されるコマンドを含むオプションファイル。パッケージのソースコード内の <code>PKG_DEL</code> ディレクティブも、Octaveパッケージマネージャーによってこのファイルに追加されることに注意してください。参照<a href="pkg_005fadd-and-pkg_005fdel-directives#PKG_005fADD-and-PKG_005fDEL-Directives">はpkg_addとPKG_DELディレクティブ</a>の詳細については、 <code>PKG_DEL</code> のディレクティブ。
ru: Необязательный файл, содержащий команды, которые запускаются при удалении пакета из пути пользователя. Обратите внимание, что директивы <code>PKG_DEL</code> в исходном коде пакета также будут добавлены в этот файл менеджером пакетов Octave. См <a href="pkg_005fadd-and-pkg_005fdel-directives#PKG_005fADD-and-PKG_005fDEL-Directives">pkg_add и PKG_DEL Директивы</a> , для подробной информации о <code>PKG_DEL</code> директив.
zh_cn: 可选文件，包括从用户路径中删除软件包时运行的命令。请注意，程序包源代码中的 <code>PKG_DEL</code> 指令也将由Octave程序包管理器添加到此文件中。有关<a href="pkg_005fadd-and-pkg_005fdel-directives#PKG_005fADD-and-PKG_005fDEL-Directives">PKG_DEL指令</a>的详细信息，请参见PKG_ADD和 <code>PKG_DEL</code> 指令。

source: An optional final argument, which must be a string or cell array of strings, contains options passed to the underlying qhull command. See the documentation for the Qhull library for details <a href="http://www.qhull.org/html/qh-quick.htm#options">http://www.qhull.org/html/qh-quick.htm#options</a>. The default option is <code>{"Qt"}</code>.
es: Un argumento final opcional, que debe ser una cadena o una matriz de cadenas de celdas, contiene opciones pasadas al comando qhull subyacente. Consulte la documentaci&oacute;n de la biblioteca Qhull para obtener m&aacute;s detalles <a href="http://www.qhull.org/html/qh-quick.htm#options">http://www.qhull.org/html/qh-quick.htm#options</a> . La opci&oacute;n predeterminada es <code>{"Qt"}</code> .
ja: オプションの最後の引数は、文字列または文字列のセル配列でなければならず、基礎となるqhullコマンドに渡されるオプションを含みます。詳細については、Qhullライブラリのドキュメント<a href="http://www.qhull.org/html/qh-quick.htm#options">http://www.qhull.org/html/qh-quick.htm#options</a>を参照してください。デフォルトのオプションは <code>{"Qt"}</code> です。
ru: Необязательный последний аргумент, который должен быть строкой или массивом ячеек строк, содержит параметры, переданные базовой команде qhull. Подробную информацию смотрите в документации по библиотеке Qhull <a href="http://www.qhull.org/html/qh-quick.htm#options">http://www.qhull.org/html/qh-quick.htm#options</a> . Параметр по умолчанию - <code>{"Qt"}</code> .
zh_cn: 可选的最终参数（必须是字符串或字符串单元格数组）包含传递给基础qhull命令的选项。有关详细信息，请参见Qhull库的文档<a href="http://www.qhull.org/html/qh-quick.htm#options">http://www.qhull.org/html/qh-quick.htm#options</a>。默认选项为 <code>{"Qt"}</code> 。
