Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/octave/octave.*.011.xlf
Languages: es, ja, ru, zh_cn

source: As mex-files do not make the distinction between single and double quoted strings that Octave does, there is perhaps less complexity in the use of strings and character matrices. An example of their use that parallels the demo in
es: Como los archivos mexicanos no hacen la distinción entre las cuerdas de cita simple y doble que hace Octava,hay quizás menos complejidad en el uso de las cuerdas y las matrices de caracteres.Un ejemplo de su uso que es paralelo a la demostración en
ja: mex-filesは、Octaveが行うシングルとダブル引用符で囲まれた文字列の区別をしないように、文字列と文字列行列の使用には、おそらくあまり複雑ではありません。のデモに類似したそれらの使用例があります。
ru: Поскольку в mex-файлах не делается различия между строками с одинарными и двойными кавычками,как это делает Октава,то,пожалуй,в использовании строк и символьных матриц сложнее.Пример их использования,который параллелен демонстрации в
zh_cn: 由于mex-files没有像Octave那样对单引号和双引号字符串进行区分,因此在使用字符串和字符矩阵时可能没有那么复杂。一个与Octave中的演示相似的使用例子。

source: As run-time measurement of the algorithm can be expensive, this is a compromise where <code>"measure"</code> is used for transforms up to the size of 8192 and beyond that the <code>"estimate"</code> method is used.
es: Como la medici&oacute;n en tiempo de ejecuci&oacute;n del algoritmo puede ser costosa, este es un compromiso en el que se usa <code>"measure"</code> para transformadas hasta el tama&ntilde;o de 8192 y m&aacute;s all&aacute; de que se usa el m&eacute;todo de <code>"estimate"</code> .
ja: アルゴリズムの実行時測定は高価になる可能性があるため、これは <code>"measure"</code> が8192のサイズまでの変換に使用され、 <code>"estimate"</code> メソッドが使用される場合を超える妥協です。
ru: Поскольку измерение времени выполнения алгоритма может быть дорогостоящим, это компромисс, когда <code>"measure"</code> используется для преобразований размером до 8192 и выше, чем используется метод <code>"estimate"</code> .
zh_cn: 由于算法的运行时测量可能很昂贵，因此这是一个折衷，其中 <code>"measure"</code> 用于最多8192的大小的转换，并且超出了使用 <code>"estimate"</code> 方法的范围。

source: As shown in see <a href="basic-usage-of-cell-arrays#Basic-Usage-of-Cell-Arrays">Basic Usage of Cell Arrays</a> elements can be extracted from cell arrays using the &lsquo;
es: Como se muestra en ver <a href="basic-usage-of-cell-arrays#Basic-Usage-of-Cell-Arrays">Uso b&aacute;sico de matrices de celdas, los</a> elementos se pueden extraer de las matrices de celdas usando el '
ja: に示すように<a href="basic-usage-of-cell-arrays#Basic-Usage-of-Cell-Arrays">、セル配列の基本的な使用法は</a>、 'を使用してセル配列から要素を抽出できます。
ru: Как показано в разделе &laquo; <a href="basic-usage-of-cell-arrays#Basic-Usage-of-Cell-Arrays">Основы использования массивов ячеек&raquo;,</a> элементы могут быть извлечены из массивов ячеек с помощью '
zh_cn: 如请参阅<a href="basic-usage-of-cell-arrays#Basic-Usage-of-Cell-Arrays">单元格数组的基本用法中</a>所示，可以使用'

source: As the example shows, a variable may be declared persistent using a <code>persistent</code> declaration statement. The following statements are all persistent declarations.
es: Como muestra el ejemplo, una variable puede declararse persistente mediante una declaraci&oacute;n de declaraci&oacute;n <code>persistent</code> e . Las siguientes declaraciones son todas declaraciones persistentes.
ja: 例が示すように、変数は <code>persistent</code> 宣言ステートメントを使用して永続宣言できます。次のステートメントはすべて永続的な宣言です。
ru: Как показывает пример, переменная может быть объявлена ​​постоянной с помощью оператора <code>persistent</code> объявления. Все следующие утверждения являются постоянными декларациями.
zh_cn: 如示例所示，可以使用 <code>persistent</code> 声明语句将变量声明为持久性。以下语句都是持久声明。

source: As the matrix <var>s</var> is symmetric indefinite it can be factorized with <code>lu</code>, and the minimum norm solution can therefore be found without the need for a <code>qr</code> factorization. As the residual error will be <code>zeros (<var>m</var>, <var>m</var>)</code> for underdetermined problems, and example can be
es: Como la matriz <var>s</var> es sim&eacute;trica indefinida, se puede factorizar con <code>lu</code> y, por tanto, se puede encontrar la soluci&oacute;n de norma m&iacute;nima sin necesidad de factorizar <code>qr</code> . Como el error residual ser&aacute; <code>zeros (<var>m</var>, <var>m</var>)</code> para problemas indeterminados, un ejemplo puede ser
ja: 行列 <var>s</var> は不定対称であるため、 <code>lu</code> で因数分解でき、 <code>qr</code> 因数分解を必要とせずに最小ノルム解を見つけることができます。残差エラーは、未決定の問題の場合は <code>zeros (<var>m</var>, <var>m</var>)</code> ため、例は次のようになります。
ru: Поскольку матрица <var>s</var> является симметричной неопределенной, ее можно факторизовать с помощью <code>lu</code> , и поэтому решение с минимальной нормой может быть найдено без необходимости факторизации <code>qr</code> . Поскольку остаточная ошибка будет <code>zeros (<var>m</var>, <var>m</var>)</code> для недоопределенных задач, и пример может быть
zh_cn: 由于矩阵 <var>s</var> 是对称不定的，因此可以使用 <code>lu</code> 进行分解，因此可以找到最小范数解，而无需进行 <code>qr</code> 分解。由于对于不确定问题，残留误差将 <code>zeros (<var>m</var>, <var>m</var>)</code> ，因此示例可以为

source: As the maximum value that can be represented by a number is important for bit manipulation, particularly when forming masks, Octave supplies two utility functions: <code>flintmax</code> for floating point integers, and <code>intmax</code> for integer objects (<code>uint8</code>, <code>int64</code>, etc.).
es: Como el valor m&aacute;ximo que puede ser representado por un n&uacute;mero es importante para la manipulaci&oacute;n de bits, particularmente cuando se forman m&aacute;scaras, Octave proporciona dos funciones de utilidad: <code>flintmax</code> para enteros de coma flotante e <code>intmax</code> para objetos enteros ( <code>uint8</code> , <code>int64</code> , etc.).
ja: ：数値で表すことができる最大値は、ビット操作のために重要であるようにマスクを形成する際に、特に、オクターブは、二つのユーティリティ関数供給する <code>flintmax</code> 浮動小数点整数の、および <code>intmax</code> Integerオブジェクト（のため <code>uint8</code> 、 <code>int64</code> 等）。
ru: Поскольку максимальное значение, которое может быть представлено числом, важно для манипуляций с битами, особенно при формировании масок, Octave предоставляет две служебные функции: <code>flintmax</code> для целых чисел с плавающей запятой и <code>intmax</code> для целочисленных объектов ( <code>uint8</code> , <code>int64</code> и т. Д.).
zh_cn: 由于可以用数字表示的最大值对于位操作（尤其是在形成掩码时）很重要，因此Octave提供了两个实用函数： <code>flintmax</code> 用于浮点整数， <code>intmax</code> 用于整数对象（ <code>uint8</code> ， <code>int64</code> 等）。

source: As with all other specific <code>end</code> keywords, <code>endswitch</code> may be replaced by <code>end</code>, but you can get better diagnostics if you use the specific forms.
es: Al igual que con todas las dem&aacute;s palabras clave <code>end</code> espec&iacute;ficas , <code>endswitch</code> puede reemplazarse por <code>end</code> , pero puede obtener mejores diagn&oacute;sticos si usa los formularios espec&iacute;ficos.
ja: 他のすべての特定の <code>end</code> キーワードと <code>endswitch</code> 、endswitchは <code>end</code> に置き換えることができますが、特定の形式を使用すると、より良い診断を得ることができます。
ru: Как и в случае со всеми другими конкретными ключевыми словами <code>end</code> , <code>endswitch</code> может быть заменен на <code>end</code> , но вы можете получить лучшую диагностику, если используете определенные формы.
zh_cn: 与所有其他特定的 <code>end</code> 关键字一样， <code>endswitch</code> 可以由 <code>end</code> 代替，但是如果使用特定的形式，则可以得到更好的诊断。

source: As with numerical arrays several elements of a cell array can be extracted by indexing with a vector of indexes
es: Al igual que con las matrices numéricas,varios elementos de una matriz celular pueden extraerse mediante la indexación con un vector de índices
ja: 数値配列と同様に,セル配列のいくつかの要素は,インデックスのベクトルを用いてインデックスを作成することで抽出することができます.
ru: Как и в случае с числовыми массивами,несколько элементов массива ячеек могут быть извлечены путем индексирования с вектором индексов
zh_cn: 与数字数组一样,单元格数组的几个元素可以通过索引向量来提取。

source: As with subfunctions, only the first nested function in a file may be called from the outside. Inside a function the rules are more complicated. In general a nested function may call:
es: Al igual que con las subfunciones,sólo la primera función anidada en un archivo puede ser llamada desde el exterior.Dentro de una función las reglas son más complicadas.En general,una función anidada puede ser llamada:
ja: サブ関数と同様に、ファイル内の最初の入れ子になっている関数だけが外部から呼び出すことができます。関数の内部では、ルールはより複雑になります。一般的には、入れ子になった関数は
ru: Как и в подфункциях,только первая вложенная функция в файле может быть вызвана извне.Внутри функции правила сложнее.Обычно может вызываться вложенная функция:
zh_cn: 与子函数一样,只有文件中的第一个嵌套函数可以从外部调用。在一个函数内部,规则就比较复杂了。一般来说,一个嵌套函数可以调用:

source: As with the &lsquo;
es: Como con el '
ja: と同様に
ru: Как и в случае с '
zh_cn: 与&ldquo;

source: As you can see in the table below, now we have both profiles mixed together.
es: Como pueden ver en la tabla de abajo,ahora tenemos ambos perfiles mezclados.
ja: 下の表にあるように、今は両方のプロファイルが混在しています。
ru: Как видно из таблицы ниже,теперь у нас оба профиля смешанные.
zh_cn: 从下表中可以看出,现在我们已经将两个配置文件混合在一起了。

source: Ask the user a yes-or-no question.
es: Hazle al usuario una pregunta de sí o no.
ja: ユーザーにイエスかノーかの質問をしてください。
ru: Задайте пользователю вопрос "да" или "нет".
zh_cn: 向用户提出一个 "是 "或 "否 "的问题。

source: Aspect Ratio
es: Relación de aspecto
ja: アスペクト比
ru: Соотношение сторон
zh_cn: 纵横比

source: Assign <var>value</var> to <var>varname</var> in context <var>context</var>, which may be either <code>"base"</code> or <code>"caller"</code>.
es: Asignar <var>value</var> a <var>varname</var> en el contexto de <var>context</var> o , que puede ser <code>"base"</code> o <code>"caller"</code> .
ja: コンテキスト <var>context</var> の <var>varname</var> に <var>value</var> を割り当てます。これは、 <code>"base"</code> または <code>"caller"</code> いずれかです。
ru: Присвоить <var>value</var> для <var>varname</var> в контексте <var>context</var> , который может быть либо <code>"base"</code> или <code>"caller"</code> .
zh_cn: 在上下文 <var>context</var> 中将 <var>value</var> 分配给 <var>varname</var> ，可以是 <code>"base"</code> 或 <code>"caller"</code> 。

source: Assign the next lowest unused integer as the Figure number.
es: Asigne el siguiente número entero más bajo no utilizado como el número de la figura.
ja: 次に低い未使用の整数を図番に代入します。
ru: Назначьте следующее наименьшее неиспользованное целое число номером рисунка.
zh_cn: 指定下一个未使用的最低整数作为图号。

source: Assigning an empty matrix &lsquo;
es: Asignar una matriz vac&iacute;a '
ja: 空の行列の割り当て '
ru: Назначение пустой матрицы '
zh_cn: 分配一个空矩阵'

source: Assigning an object of that class to another variable essentially creates a new object:
es: Asignar un objeto de esa clase a otra variable crea esencialmente un nuevo objeto:
ja: そのクラスのオブジェクトを別の変数に代入すると、本質的に新しいオブジェクトが作成されます。
ru: Присвоение объекта этого класса другой переменной по сути создает новый объект:
zh_cn: 将该类的一个对象赋值给另一个变量,本质上是创建一个新的对象。

source: Assignment Expressions
es: Expresiones de asignación
ja: 課題表現
ru: Выражения назначения
zh_cn: 赋值表达式

source: Assignment Ops
es: Operaciones de asignación
ja: アサインメントオペレーション
ru: Назначение Операций
zh_cn: 派遣行动

source: Assignment of a scalar to an indexed matrix sets all of the elements that are referenced by the indices to the scalar value. For example, if <code>a</code> is a matrix with at least two columns,
es: La asignaci&oacute;n de un escalar a una matriz indexada establece todos los elementos a los que hacen referencia los &iacute;ndices en el valor escalar. Por ejemplo, si <code>a</code> es una matriz con al menos dos columnas,
ja: インデックス付き行列へのスカラーの割り当ては、インデックスによって参照されるすべての要素をスカラー値に設定します。たとえば、 <code>a</code> が2列以上の行列の場合、
ru: Присваивание скаляра индексированной матрице устанавливает все элементы, на которые ссылаются индексы, на скалярное значение. Например, если <code>a</code> - матрица как минимум с двумя столбцами,
zh_cn: 将标量分配给索引矩阵会将索引所引用的所有元素都设置为标量值。例如，如果 <code>a</code> 是至少包含两列的矩阵，

source: Assignments can store string values also. For example, the following expression would store the value <code>"this food is good"</code> in the variable <code>message</code>:
es: Las asignaciones tambi&eacute;n pueden almacenar valores de cadena. Por ejemplo, la siguiente expresi&oacute;n almacenar&iacute;a el valor <code>"this food is good"</code> en el <code>message</code> la variable :
ja: 割り当てには文字列値も格納できます。たとえば、次の式は、変数 <code>"this food is good"</code> を変数 <code>message</code> に格納します。
ru: Присвоения также могут хранить строковые значения. Например, следующее выражение сохранит значение <code>"this food is good"</code> в <code>message</code> переменной :
zh_cn: 分配也可以存储字符串值。例如，以下表达式将在变量 <code>message</code> 中存储值 <code>"this food is good"</code> ：

source: Assume <var>D</var> is a diagonal matrix. If <var>M</var> is a full matrix, then <code>D*M</code> will scale the rows of <var>M</var>. That means, if <code>S = D*M</code>, then for each pair of indices i,j it holds
es: Suponga que <var>D</var> es una matriz diagonal. Si <var>M</var> es una matriz completa, entonces <code>D*M</code> escalar&aacute; la filas de <var>M</var> . Eso significa, si <code>S = D*M</code> , entonces para cada par de &iacute;ndices i, j se mantiene
ja: <var>D</var> が対角行列であると仮定します。場合 <var>M</var> がフル行列で、次に <code>D*M</code> は、列スケーリングます <var>M</var> を。つまり、 <code>S = D*M</code> 場合、インデックスi、jの各ペアに対して、
ru: Предположим, что <var>D</var> - диагональная матрица. Если <var>M</var> является полной матрицей, то <code>D*M</code> масштабируется строка <var>M</var> . Это означает, что если <code>S = D*M</code> , то для каждой пары индексов i, j выполняется
zh_cn: 假设 <var>D</var> 是对角矩阵。如果 <var>M</var> 是一个完整的矩阵，那么 <code>D*M</code> 将缩放的行 <var>M</var> 。这意味着，如果 <code>S = D*M</code> ，那么对于每对索引i，j，它成立

source: Assume creation of a MEX file. Set the default output extension to
ja: MEXファイルの作成を想定しています。デフォルトの出力拡張子を
zh_cn: 假设创建一个MEX文件。设置默认输出扩展名为

source: Assume we are creating a MEX file. Set the default output extension to ".mex".
es: Supongamos que estamos creando un archivo MEX.Establezca la extensión de salida por defecto en ".mex".
ja: mexファイルを作成しているとします。デフォルトの出力拡張子を".mex "に設定します。
ru: Предположим,мы создаем MEX-файл.Установите выходное расширение по умолчанию в ".mex".
zh_cn: 假设我们正在创建一个MEX文件。设置默认的输出扩展名为".mex"。

source: Assuming <var>data</var> is the structure with profile data returned by <code>profile (<code>"info"</code>)</code>, this command opens an interactive prompt that can be used to explore the call-tree. Type
es: Suponiendo que los <var>data</var> son la estructura con los datos del perfil devueltos por el <code>profile (<code>"info"</code>)</code> , este comando abre un indicador interactivo que se puede utilizar para explorar el &aacute;rbol de llamadas. Tipo
ja: <var>data</var> が <code>profile (<code>"info"</code>)</code> によって返されるプロファイルデータの構造であると仮定すると、このコマンドは、呼び出しツリーを探索するために使用できるインタラクティブプロンプトを開きます。タイプ
ru: Предполагая, что <var>data</var> представляют собой структуру с данными профиля, возвращаемыми <code>profile (<code>"info"</code>)</code> , эта команда открывает интерактивную подсказку, которую можно использовать для исследования дерева вызовов. Тип
zh_cn: 假设 <var>data</var> 是具有由 <code>profile (<code>"info"</code>)</code> 返回的profile 数据的结构，则此命令将打开一个交互式提示，可用于浏览调用树。类型

source: Assuming a package is available in the file
es: Suponiendo que un paquete esté disponible en el archivo
ja: ファイル内にパッケージがあると仮定して
ru: Если предположить,что пакет доступен в файле
zh_cn: 假设文件中的一个包是可用的

source: Assuming one of the two versions is in xcorr_orig, this would compare their speed and their output values. Note that the FFT version is not exact, so one must specify an acceptable tolerance on the comparison <code>100*eps</code>. In this case, the comparison should be computed relatively, as <code>abs ((<var>x</var> - <var>y</var>) ./ <var>y</var>)</code> rather than absolutely as <code>abs (<var>x</var> - <var>y</var>)</code>.
es: Suponiendo que una de las dos versiones est&aacute; en xcorr_orig, esto comparar&iacute;a su velocidad y sus valores de salida. Tenga en cuenta que la versi&oacute;n FFT no es exacta, por lo que se debe especificar una tolerancia aceptable en la comparaci&oacute;n <code>100*eps</code> . En este caso, la comparaci&oacute;n debe calcularse relativamente, como <code>abs ((<var>x</var> - <var>y</var>) ./ <var>y</var>)</code> lugar de absolutamente como <code>abs (<var>x</var> - <var>y</var>)</code> .
ja: 2つのバージョンのうちの1つがxcorr_origにあると仮定すると、これはそれらの速度と出力値を比較します。FFTのバージョンは正確ではないので、 <code>100*eps</code> の比較で許容範囲を指定する必要があることに注意してください。この場合、比較は絶対的に <code>abs (<var>x</var> - <var>y</var>)</code> <var>x</var> - <var>y</var> ）としてではなく、 <code>abs ((<var>x</var> - <var>y</var>) ./ <var>y</var>)</code> として相対的に計算する必要があります。
ru: Предполагая, что одна из двух версий находится в xcorr_orig, это позволит сравнить их скорость и их выходные значения. Обратите внимание, что версия БПФ не точна, поэтому необходимо указать приемлемый допуск для сравнения <code>100*eps</code> . В этом случае сравнение следует вычислять относительно, как <code>abs ((<var>x</var> - <var>y</var>) ./ <var>y</var>)</code> а не абсолютно как <code>abs (<var>x</var> - <var>y</var>)</code> .
zh_cn: 假设两个版本之一在xcorr_orig中，则将比较它们的速度和输出值。请注意，FFT版本并不精确，因此必须在比较 <code>100*eps</code> 上指定可接受的容差。在这种情况下，比较应该相对地计算为 <code>abs ((<var>x</var> - <var>y</var>) ./ <var>y</var>)</code> 而不是绝对地作为 <code>abs (<var>x</var> - <var>y</var>)</code> 。

source: Asymptotic expansions of integrals
es: Expansiones asintóticas de las integrales
ja: 積分の漸近展開
ru: Асимптотические расширения интегралов
zh_cn: 积分的渐近展开

source: Asynchronous I/O.
es: E/S asíncrona.
ja: 非同期I/O。
ru: Асинхронный ввод-вывод.
zh_cn: 异步I/O。

source: At boundary points a linear extrapolation is applied. Interior points are calculated with the first approximation of the numerical gradient
es: En los puntos límite se aplica una extrapolación lineal.Los puntos interiores se calculan con la primera aproximación del gradiente numérico
ja: 境界点では線形外挿が適用されます。内側の点は、数値勾配の最初の近似を用いて計算されます.
ru: В пограничных точках применяется линейная экстраполяция.Внутренние точки вычисляются с первым приближением численного градиента
zh_cn: 在边界点采用线性外推法。内部点用数值梯度的第一近似值计算。

source: At the Octave prompt, you can recall, edit, and reissue previous commands using Emacs- or vi-style editing commands. The default keybindings use Emacs-style commands. For example, to recall the previous command, press
es: En el indicador de la Octava,puedes recordar,editar y volver a emitir comandos anteriores usando los comandos de edición de estilo Emacs o vi-.Las combinaciones de teclas predeterminadas utilizan comandos de estilo Emacs.Por ejemplo,para recuperar el comando anterior,pulsa
ja: Octaveプロンプトでは、Emacs形式またはvi形式の編集コマンドを使用して、以前のコマンドを呼び出し、編集し、再発行することができます。デフォルトのキーバインドはEmacsスタイルのコマンドを使用します。例えば,前のコマンドを呼び出すには
ru: В октавной строке можно вспомнить,отредактировать и переиздать предыдущие команды,используя команды редактирования в стиле Emacs-или vi.По умолчанию используются команды в стиле Emacs-.Например,чтобы вспомнить предыдущую команду,нажмите кнопку
zh_cn: 在Octave提示下,你可以使用Emacs或vi风格的编辑命令来调用、编辑和重新发布以前的命令。默认的键绑定使用Emacs风格的命令。例如,要调用以前的命令,按

source: Attempt to do completion on the text before the cursor. Octave can complete the names of commands and variables.
es: Intenta completar el texto delante del cursor.Octava puede completar los nombres de los comandos y variables.
ja: カーソル前のテキストの補完を試みます。Octaveはコマンドや変数の名前を補完することができます。
ru: Попытайтесь выполнить завершение текста перед курсором.Октава может завершать имена команд и переменных.
zh_cn: 试图对光标前的文本进行补全。Octave可以完成命令和变量的名称。

source: Attributes of the listed variable. Possible attributes are:
es: Atributos de la variable listada.Los posibles atributos son:
ja: リストされた変数の属性。可能な属性は以下の通りです。
ru: Атрибуты перечисленной переменной.Возможные атрибуты:
zh_cn: 所列变量的属性。可能的属性有:

source: Audio Data Processing
es: Procesamiento de datos de audio
ja: オーディオデータ処理
ru: Обработка аудиоданных
zh_cn: 音频数据处理

source: Audio Device Information
es: Información del dispositivo de audio
ja: オーディオデバイス情報
ru: Информация об аудиоустройстве
zh_cn: 音频设备信息

source: Audio File Utilities
es: Utilidades de archivos de audio
ja: オーディオファイルユーティリティ
ru: Аудио файловые утилиты
zh_cn: 音频文件实用程序

source: Audio Player
es: Reproductor de audio
ja: オーディオプレーヤー
ru: Аудиоплеер
zh_cn: 音频播放器

source: Audio Processing
es: Procesamiento de audio
ja: オーディオ処理
ru: Обработка аудио
zh_cn: 音频处理

source: Audio Recorder
es: Grabadora de audio
ja: オーディオレコーダー
ru: Аудиорегистратор
zh_cn: 录音机

source: Audio bit rate. Unused, only present for compatibility with <small>MATLAB</small>.
es: Tasa de bits de audio. Sin usar, solo presente para compatibilidad con <small>MATLAB</small> .
ja: オーディオビットレート。未使用<small>。MATLAB</small>との互換性のためにのみ存在します。
ru: Битрейт аудио. Не используется, присутствует только для совместимости с <small>MATLAB</small> .
zh_cn: 音频比特率。未使用，仅出于与<small>MATLAB的</small>兼容性而存在。

source: Audio compression method. Unused, only present for compatibility with <small>MATLAB</small>.
es: M&eacute;todo de compresi&oacute;n de audio. Sin usar, solo presente para compatibilidad con <small>MATLAB</small> .
ja: オーディオ圧縮方式。未使用<small>。MATLAB</small>との互換性のためにのみ存在します。
ru: Метод сжатия звука. Не используется, присутствует только для совместимости с <small>MATLAB</small> .
zh_cn: 音频压缩方法。未使用，仅出于与<small>MATLAB的</small>兼容性而存在。

source: Autoload function A function that is marked as autoloaded with See <a href="overloading-and-autoloading#XREFautoload">autoload</a>.
es: Funci&oacute;n de carga autom&aacute;tica Una funci&oacute;n que est&aacute; marcada como de carga autom&aacute;tica con Ver <a href="overloading-and-autoloading#XREFautoload">carga autom&aacute;tica</a> .
ja: オートロード機能「<a href="overloading-and-autoloading#XREFautoload">オート</a>ロード」を参照して、オートロードとしてマークされている機能。
ru: Функция автозагрузки Функция, помеченная как автозагрузка с помощью См. <a href="overloading-and-autoloading#XREFautoload">Автозагрузка</a> .
zh_cn: 自动加载功能标记为自动加载的功能，请参见<a href="overloading-and-autoloading#XREFautoload">autoload</a>。

source: Automatic Variable: ans
es: Variable automática:ans
ja: 自動変数:ans
ru: Автоматическая переменная:ans
zh_cn: 自动变量:ans

source: Automatic variable. An automatic variable is one created by the interpreter, for example <code>argn</code>.
es: Variable autom&aacute;tica. Una variable autom&aacute;tica es una creada por el int&eacute;rprete, por ejemplo, <code>argn</code> .
ja: 自動変数。自動変数は、インタープリターによって作成された変数です（例： <code>argn</code> )。
ru: Автоматическая переменная. Автоматическая переменная - это переменная, созданная интерпретатором, например <code>argn</code> .
zh_cn: 自动变量。自动变量是由解释器创建的变量，例如 <code>argn</code> 。

source: Available commands:
es: Comandos disponibles:
ja: 利用可能なコマンド。
ru: Доступные команды:
zh_cn: 可用的命令:

source: Avoid calling <code>eval</code> or <code>feval</code> excessively. Parsing input or looking up the name of a function in the symbol table are relatively expensive operations.
es: Evite llamar a <code>eval</code> o <code>feval</code> en exceso. Analizar la entrada o buscar el nombre de una funci&oacute;n en la tabla de s&iacute;mbolos son operaciones relativamente caras.
ja: <code>eval</code> または <code>feval</code> を過度に呼び出すことは避けてください。入力の解析またはシンボルテーブル内の関数の名前の検索は、比較的負荷の高い操作です。
ru: Избегайте чрезмерного вызова <code>eval</code> или <code>feval</code> . Анализ ввода или поиск имени функции в таблице символов - относительно дорогие операции.
zh_cn: 避免过度调用 <code>eval</code> 或 <code>feval</code> 。解析输入或在符号表中查找函数名称是相对昂贵的操作。
