Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/octave/octave.*.011.xlf
Languages: es, ja, ru, zh_cn

source: A cell array of the text of each match
es: Una matriz de celdas del texto de cada partido
ja: 各マッチのテキストのセル配列
ru: Массив ячеек с текстом каждого совпадения
zh_cn: 每个匹配文本的单元格数组

source: A cell array of the text of each token matched
es: Una matriz de células del texto de cada ficha coincidió
ja: 一致した各トークンのテキストのセル配列
ru: Массив ячеек текста каждой маркера соответствует
zh_cn: 匹配的每个标记的文本的单元格数组。

source: A cell array with strings labeling each text field. This input is required.
es: Una matriz de celdas con cadenas que etiquetan cada campo de texto.Esta entrada es necesaria.
ja: 各テキストフィールドに文字列をラベル付けしたセル配列。この入力は必須です。
ru: Массив ячеек со строками,обозначающими каждое текстовое поле.Этот ввод необходим.
zh_cn: 一个单元格数组,每个文本字段都标有字符串。此项为必填项。

source: A character indicating a plot marker to be place at each data point, or <code>"none"</code>, meaning no markers should be displayed.
es: Un car&aacute;cter que indica que se colocar&aacute; un marcador de trama en cada punto de datos, o <code>"none"</code> , lo que significa que no se deben mostrar marcadores.
ja: 各データポイントに配置するプロットマーカーを示す文字、または <code>"none"</code> 。マーカーを表示しないことを意味します。
ru: Символ, указывающий, что маркер графика должен быть помещен в каждую точку данных, или <code>"none"</code> , что означает, что маркеры не должны отображаться.
zh_cn: 一个字符，指示要在每个数据点放置的绘图标记，即 <code>"none"</code> ，表示不应显示任何标记。

source: A character string in Octave consists of a sequence of characters enclosed in either double-quote or single-quote marks. Internally, Octave currently stores strings as matrices of characters. All the indexing operations that work for matrix objects also work for strings.
es: Una cadena de caracteres en Octava consiste en una secuencia de caracteres encerrados entre comillas dobles o simples.Internamente,Octava actualmente almacena cadenas como matrices de caracteres.Todas las operaciones de indexación que funcionan para los objetos de la matriz también funcionan para las cadenas.
ja: Octaveにおける文字列は,ダブルクオートまたはシングルクオートで囲まれた文字列で構成されています。内部的には,Octaveは現在文字列を文字の行列として格納しています。行列オブジェクトに対して機能するすべてのインデックス操作は,文字列に対しても機能します。
ru: Символьная строка в октаве состоит из последовательности символов,заключенной в двойные или одинарные кавычки.В настоящее время в Октаве строки хранятся как матрицы символов.Все операции индексирования,которые работают для объектов матрицы,также работают и для строк.
zh_cn: 在Octave中,一个字符串由一串用双引号或单引号括起来的字符组成。在内部,Octave目前将字符串存储为字符的矩阵。所有适用于矩阵对象的索引操作也适用于字符串。

source: A character string in Octave is just a special <code>Array</code> class. Consider the example:
es: Una cadena de caracteres en Octave es solo una clase de <code>Array</code> especial . Considere el ejemplo:
ja: Octaveの文字列は、特別な <code>Array</code> クラスです。例を考えてみましょう：
ru: Строка символов в Octave - это просто специальный класс <code>Array</code> . Рассмотрим пример:
zh_cn: Octave中的字符串只是一个特殊的 <code>Array</code> 类。考虑示例：

source: A character that specifies the conversion to be applied.
es: Un carácter que especifica la conversión a aplicar.
ja: 適用する変換を指定する文字。
ru: Символ,определяющий применяемое преобразование.
zh_cn: 指定要应用的转换的字符。

source: A class may be a child of more than one class (see <a href="built_002din-data-types#XREFclass">class</a>), and inheritance may be nested. There is no limitation to the number of parents or the level of nesting other than memory or other physical issues.
es: Una clase puede ser hija de m&aacute;s de una clase (ver <a href="built_002din-data-types#XREFclass">clase</a> ) y la herencia puede estar anidada. No hay ninguna limitaci&oacute;n para el n&uacute;mero de padres o el nivel de anidaci&oacute;n que no sea la memoria u otros problemas f&iacute;sicos.
ja: クラスは複数のクラスの子である場合があり（<a href="built_002din-data-types#XREFclass">classを</a>参照）、継承がネストされる場合があります。メモリやその他の物理的な問題以外に、親の数やネストのレベルに制限はありません。
ru: Класс может быть дочерним по отношению к нескольким классам (см. <a href="built_002din-data-types#XREFclass">Класс</a> ), и наследование может быть вложенным. Нет никаких ограничений на количество родителей или уровень вложенности, кроме памяти или других физических проблем.
zh_cn: 一个类可能是一个以上类的孩子（请参阅<a href="built_002din-data-types#XREFclass">class</a>），并且继承可能是嵌套的。除内存或其他物理问题外，对父母的数量或嵌套级别没有任何限制。

source: A clear understanding might be had by considering an example of how the above applies to an example matrix. Consider the matrix
es: Se podría llegar a un entendimiento claro si se considera un ejemplo de cómo lo anterior se aplica a una matriz de ejemplo.Considere la matriz
ja: 上記がどのように行列の例に当てはまるかの例を考えることで、明確な理解が得られるかもしれません。行列を考えてみましょう
ru: Четкое понимание можно было бы получить,рассмотрев пример применения вышеизложенного к матрице-примеру.Рассмотрим матрицу
zh_cn: 通过考虑一个例子,可以清楚地了解上述内容如何适用于一个矩阵的例子。考虑矩阵

source: A colon (&lsquo;
es: Dos puntos ('
ja: コロン（ '
ru: Двоеточие ('
zh_cn: 冒号（'

source: A color in HSV space is represented by hue, saturation and value (brightness) levels in a cylindrical coordinate system. Hue is the azimuth and describes the dominant color. Saturation is the radial distance and gives the amount of hue mixed into the color. Value is the height and is the amount of light in the color.
es: Un color en el espacio HSV está representado por los niveles de matiz,saturación y valor (brillo)en un sistema de coordenadas cilíndricas.El matiz es el azimut y describe el color dominante.La saturación es la distancia radial y da la cantidad de matiz que se mezcla con el color.El valor es la altura y es la cantidad de luz en el color.
ja: HSV 空間における色は色相・彩度・値(明度)レベルで円筒座標系上で表現されます。色相は方位であり、 支配的な色を表します。彩度は半径方向の距離であり、 色に混ざった色相の量を表します。値は高さであり、色に含まれる光の量を表します。
ru: Цвет в пространстве HSV представлен уровнями оттенка,насыщенности и значения (яркости)в цилиндрической системе координат.Оттенок является азимутом и описывает доминирующий цвет.Насыщенность-это радиальное расстояние и дает количество оттенков,смешиваемых с цветом.Значение-это высота и количество света в цвете.
zh_cn: 在HSV空间中,颜色由圆柱坐标系中的色相、饱和度和值(亮度)级别表示。色调是方位角,描述的是主色。饱和度是径向距离,给出了混入颜色中的色相量。值是高度,是颜色中的光量。

source: A color in the RGB space consists of red, green, and blue intensities.
es: Un color en el espacio RGB consiste en intensidades de rojo,verde y azul.
ja: RGB空間の色は、赤、緑、青の濃さで構成されています。
ru: Цвет в пространстве RGB состоит из интенсивности красного,зеленого и синего.
zh_cn: RGB空间中的颜色由红、绿、蓝三色组成。

source: A color property. <var>arg</var> contains the default color value. When no default color is given, the property is set to black. An optional second string argument may be given to specify an additional set of accepted string values (like a radio property).
es: Una propiedad de color. <var>arg</var> contiene el valor de color predeterminado. Cuando no se proporciona un color predeterminado, la propiedad se establece en negro. Se puede proporcionar un segundo argumento de cadena opcional para especificar un conjunto adicional de valores de cadena aceptados (como una propiedad de radio).
ja: 色のプロパティ。 <var>arg</var> にはデフォルトのカラー値が含まれています。デフォルトの色が指定されていない場合、プロパティは黒に設定されます。オプションの2番目の文字列引数を指定して、追加の受け入れられる文字列値のセットを指定できます（ラジオプロパティなど）。
ru: Свойство цвета. <var>arg</var> содержит значение цвета по умолчанию. Если цвет по умолчанию не указан, свойство устанавливается на черный. Необязательный второй строковый аргумент может быть указан для указания дополнительного набора принятых строковых значений (например, свойства radio).
zh_cn: 颜色属性。 <var>arg</var> 包含默认颜色值。如果未提供默认颜色，则该属性将设置为黑色。可以提供一个可选的第二个字符串参数来指定其他一组可接受的字符串值（如radio属性）。

source: A color value setting the text color for this menu entry.
es: Un valor de color que ajusta el color del texto para esta entrada de menú.
ja: このメニュー項目のテキストの色を設定する色の値。
ru: Значение цвета,устанавливающее цвет текста для этого пункта меню.
zh_cn: 一个颜色值,设置该菜单项的文字颜色。

source: A colorbar displays the current colormap along with numerical rulings so that the color scale can be interpreted.
es: Una barra de color muestra el mapa de colores actual junto con las reglas numéricas para que la escala de colores pueda ser interpretada.
ja: カラーバーは、カラースケールを解釈できるように、現在のカラーマップを数値の罫線とともに表示します。
ru: На цветовой панели отображается текущая цветовая карта вместе с числовыми линейками,чтобы цветовую шкалу можно было интерпретировать.
zh_cn: 颜色条显示当前的彩色地图以及数字规则,以便解释色标。

source: A colormap is a real matrix, of class single or double, with 3 columns. Each row represents a single color. The 3 columns contain red, green, and blue intensities respectively.
es: Un mapa de color es una matriz real,de clase simple o doble,con 3 columnas.Cada fila representa un solo color.Las 3 columnas contienen intensidades de rojo,verde y azul respectivamente.
ja: colormapは、3列のシングルまたはダブルクラスの実数行列です。各行は1つの色を表します。3つの列にはそれぞれ赤、緑、青の強度が含まれています。
ru: Цветная карта-это реальная матрица,класса одинарный или двойной,с 3 столбцами.Каждая строка представляет собой один цвет.3 столбца содержат интенсивность красного,зеленого и синего цветов соответственно.
zh_cn: colormap是一个实数矩阵,单列或双列,有3列。每一行代表一种颜色。3列分别包含红、绿、蓝三种颜色的强度。

source: A colour scheme for the display of astronomical intensity images
ja: 天体強度画像を表示するための配色
zh_cn: 用于显示天体强度图像的色彩方案。

source: A column array containing the objective function coefficients.
es: Una matriz de columnas que contiene los coeficientes de funciones objetivas.
ja: 対物関数の係数を含む列の配列。
ru: Массив столбцов,содержащий коэффициенты объективной функции.
zh_cn: 包含目标函数系数的列阵。

source: A column array containing the right-hand side value for each constraint in the constraint matrix.
es: Una matriz de columnas que contiene el valor del lado derecho para cada restricción de la matriz de restricciones.
ja: 制約行列の各制約の右辺の値を含む列配列.
ru: Массив столбцов,содержащий значение правой стороны для каждого ограничения в матрице ограничений.
zh_cn: 一个列数组,包含约束矩阵中每个约束的右侧值。

source: A column array containing the types of the variables.
es: Una matriz de columnas que contiene los tipos de las variables.
ja: 変数の型を含むカラム配列。
ru: Массив столбцов,содержащий типы переменных.
zh_cn: 一个包含变量类型的列阵。

source: A column vector is a 2-D array for which <code>size (<var>x</var>)</code> returns <code>[N,&nbsp;1]</code> with non-negative N.
ja: 列ベクトルは、 <code>size (<var>x</var>)</code> が負でない <code>[N,&nbsp;1]</code> を返す2次元配列です。
zh_cn: 列向量是一个二维数组，其 <code>size (<var>x</var>)</code> 返回带有非负N的 <code>[N,&nbsp;1]</code> 。

source: A common application for sparse matrices is in the solution of Finite Element Models. Finite element models allow numerical solution of partial differential equations that do not have closed form solutions, typically because of the complex shape of the domain.
es: Una aplicación común para las matrices dispersas está en la solución de los modelos de elementos finitos.Los modelos de elementos finitos permiten la solución numérica de ecuaciones diferenciales parciales que no tienen soluciones de forma cerrada,típicamente debido a la forma compleja del dominio.
ja: 疎な行列の一般的なアプリケーションは、有限要素モデルの解法です。有限要素モデルを使用すると、閉じた形の解を持たない偏微分方程式を数値的に解くことができますが、これは通常、ドメインの形状が複雑であるためです。
ru: Обычным приложением для разреженных матриц является решение моделирования методом конечных элементов.Конечно-элементные модели позволяют численно решать частные дифференциальные уравнения,не имеющие решений замкнутой формы,как правило,из-за сложной формы области.
zh_cn: 稀疏矩阵的一个常见应用是在有限元模型的求解中。有限元模型允许对没有闭式解的偏微分方程进行数值求解,通常是因为域的复杂形状。

source: A common example of when it does become necessary to convert ranges into vectors occurs when they appear within a vector (i.e., inside square brackets). For instance, whereas
es: Un ejemplo común de cuándo es necesario convertir los rangos en vectores se da cuando aparecen dentro de un vector (es decir,entre corchetes).Por ejemplo,mientras que
ja: 範囲をベクトルに変換する必要がある場合の一般的な例としては、範囲がベクトル内に現れる場合(すなわち、角括弧内に現れる場合)があります。例えば
ru: Распространенный пример того,когда действительно возникает необходимость преобразования диапазонов в векторы,возникает тогда,когда они появляются внутри вектора (т.е.внутри квадратных скобок).Например,когда
zh_cn: 一个常见的例子是,当有必要将范围转换为向量时,它们会出现在向量中(即,方括号内)。例如,当

source: A common text for engineering courses is G. Strang,
es: Un texto común para los cursos de ingeniería es G.Strang,
ja: 工学系の授業でよく使われるテキストは、G.Strangです。
ru: Общий текст для инженерных курсов-Г.Стрэнг,
zh_cn: 工程类课程的常用教材是G.斯特朗。

source: A common use of <code>mlock</code> is to prevent persistent variables from being removed from memory, as the following example shows:
es: Un uso com&uacute;n de <code>mlock</code> es evitar que las variables persistentes se eliminen de la memoria, como muestra el siguiente ejemplo:
ja: <code>mlock</code> の一般的な用途は、次の例に示すように、永続変数がメモリから削除されないようにすることです。
ru: Обычно <code>mlock</code> используется для предотвращения удаления постоянных переменных из памяти, как показано в следующем примере:
zh_cn: <code>mlock</code> 的常见用法是防止将持久变量从内存中删除，如以下示例所示：

source: A compatibility wrapper function that will choose between <code>quadv</code> and <code>quadgk</code> depending on the integrand and options chosen.
es: Una funci&oacute;n de contenedor de compatibilidad que elegir&aacute; entre <code>quadv</code> y <code>quadgk</code> dependiendo del integrando y las opciones elegidas.
ja: 選択した被積分関数とオプションに応じて <code>quadv</code> と <code>quadgk</code> の間で選択する互換性ラッパー関数。
ru: Функция-оболочка совместимости, которая будет выбирать между <code>quadv</code> и <code>quadgk</code> в зависимости от подынтегрального выражения и выбранных опций.
zh_cn: 兼容性包装函数，将根据被积数和所选选项在 <code>quadv</code> 和 <code>quadgk</code> 之间进行选择。

source: A complete description of the command line editing capability is given in this manual, see <a href="command-line-editing#Command-Line-Editing">Command Line Editing</a>.
es: En este manual se ofrece una descripci&oacute;n completa de la capacidad de edici&oacute;n de la l&iacute;nea de comandos; consulte <a href="command-line-editing#Command-Line-Editing">Edici&oacute;n de la l&iacute;nea de comandos</a> .
ja: コマンドライン編集機能の完全な説明は、このマニュアルに記載されています。<a href="command-line-editing#Command-Line-Editing">コマンドライン編集を</a>参照してください。
ru: Полное описание возможности редактирования командной строки дается в этом руководстве, см. <a href="command-line-editing#Command-Line-Editing">Редактирование командной строки</a> .
zh_cn: 本手册提供了命令行编辑功能的完整说明，请参见<a href="command-line-editing#Command-Line-Editing">命令行编辑</a>。

source: A complete example showing the capabilities of text printing using the
es: Un ejemplo completo que muestra las capacidades de impresión de texto utilizando el
ja: を使用したテキスト印刷の機能を示す完全な例です。
ru: Полный пример,показывающий возможности печати текста с помощью кнопки
zh_cn: 一个完整的例子,展示了使用该软件进行文本打印的功能。

source: A complete input file that will reproduce the bug.
es: Un archivo de entrada completo que reproducirá el bicho.
ja: バグを再現する完全な入力ファイル。
ru: Полный входной файл,который будет воспроизводить ошибку.
zh_cn: 一个完整的输入文件,将重现这个错误。

source: A complete list of any modifications you have made to the interpreter source.
es: Una lista completa de cualquier modificación que haya hecho a la fuente del intérprete.
ja: インタープリタのソースに変更を加えた場合の完全なリスト。
ru: Полный список всех изменений,которые вы внесли в исходный текст переводчика.
zh_cn: 您对解释器源的任何修改的完整列表。

source: A complex array class defined in
es: Una clase de conjunto complejo definido en
ja: で定義されている複合配列クラス
ru: Класс сложного массива,определенный в
zh_cn: 中定义的复数组类。

source: A complex matrix class defined in
es: Una clase de matriz compleja definida en
ja: で定義されている複素行列クラス
ru: Класс сложной матрицы,определенный в
zh_cn: 中定义的复矩阵类。

source: A complex sparse matrix class
es: Una compleja clase de matriz dispersa
ja: 複素疎な行列クラス
ru: Сложный разреженный матричный класс
zh_cn: 一个复杂的稀疏矩阵类

source: A computational procedure for incomplete gamma functions
es: Un procedimiento computacional para las funciones gamma incompletas
ja: 不完全ガンマ関数の計算手順
ru: Вычислительная процедура для неполных гамма-функций
zh_cn: 不完全伽马函数的计算程序

source: A consequence is that &ldquo;pulling back&rdquo; on the up vector does not pitch the camera view (as that would require changing the target). Setting the up vector is thus typically used only to roll the camera. A more intuitive command for this purpose is <a href="#XREFcamroll">camroll</a>.
ja: 結果として、アップベクトルを「引き戻す」と、カメラビューがピッチングされません（ターゲットを変更する必要があるため）。したがって、アップベクトルの設定は、通常、カメラを回転させるためにのみ使用されます。この目的のためのより直感的なコマンドは<a href="#XREFcamroll">camroll</a>です。
zh_cn: 结果是在向上矢量上&ldquo;向后拉&rdquo;不会使摄像机视图倾斜（因为这将需要更改目标）。因此，设置向上矢量通常仅用于滚动相机。为此目的，更直观的命令是<a href="#XREFcamroll">camroll</a>。

source: A consequence is that &ldquo;pulling back&rdquo; on the up vector does not pitch the camera view (as that would require changing the target). Setting the up vector is thus typically used only to roll the camera. A more intuitive command for this purpose is see <a href="#XREFcamroll">camroll</a>.
es: Una consecuencia es que "retroceder" en el vector ascendente no inclina la vista de la c&aacute;mara (ya que eso requerir&iacute;a cambiar el objetivo). Por lo tanto, la configuraci&oacute;n del vector de configuraci&oacute;n se usa generalmente solo para rodar la c&aacute;mara. Un comando m&aacute;s intuitivo para este prop&oacute;sito es ver <a href="#XREFcamroll">camroll</a> .
ja: 結果として、上向きベクトルを「引き戻す」と、カメラのビューがピッチングされなくなります（ターゲットを変更する必要があるため）。したがって、アップベクトルの設定は通常、カメラを回転させるためにのみ使用されます。この目的のためのより直感的なコマンドは<a href="#XREFcamroll">camrollを</a>参照してください。
ru: Следствием этого является то, что &laquo;оттягивание&raquo; вектора вверх не приводит к изменению угла обзора камеры (так как это потребует изменения цели). Таким образом, установка вектора подъема обычно используется только для поворота камеры. Более интуитивно понятная команда для этой цели - см. <a href="#XREFcamroll">Camroll</a> .
zh_cn: 结果是在向上矢量上&ldquo;向后拉&rdquo;不会使摄像机视图倾斜（因为这将需要更改目标）。因此，设置向上矢量通常仅用于滚动相机。为此目的，一个更直观的命令是<a href="#XREFcamroll">camroll</a>。

source: A constant spacing between two points can be provided by the <var>s</var> parameter. If <var>s</var> is a scalar, it is assumed to be the spacing for all dimensions. Otherwise, separate values of the spacing can be supplied by the <var>x</var>, &hellip; arguments. Scalar values specify an equidistant spacing. Vector values for the <var>x</var>, &hellip; arguments specify the coordinate for that dimension. The length must match their respective dimension of <var>m</var>.
es: El par&aacute;metro <var>s</var> puede proporcionar un espaciado constante entre dos puntos . Si <var>s</var> es un escalar, se supone que es el espaciado para todas las dimensiones. De lo contrario, los argumentos <var>x</var> ,&hellip; pueden proporcionar valores separados del espaciado . Los valores escalares especifican un espaciado equidistante. Los valores vectoriales para los argumentos <var>x</var> ,&hellip; especifican la coordenada para esa dimensi&oacute;n. La longitud debe coincidir con su respectiva dimensi&oacute;n de <var>m</var> .
ja: 2つのポイント間の一定の間隔は、 <var>s</var> パラメータで指定できます。 <var>s</var> がスカラーの場合、すべての次元の間隔と見なされます。それ以外の場合は、間隔の個別の値を <var>x</var> 、&hellip;引数で指定できます。スカラー値は、等間隔の間隔を指定します。 <var>x</var> 、&hellip;引数のベクトル値は、その次元の座標を指定します。長さは、それぞれの <var>m</var> の次元と一致する必要があります。
ru: Постоянное расстояние между двумя точками может быть обеспечено параметром <var>s</var> . Если <var>s</var> - скаляр, предполагается, что это интервал для всех измерений. В противном случае отдельные значения интервала могут быть предоставлены аргументами <var>x</var> ,&hellip;. Скалярные значения задают эквидистантный интервал. Векторные значения для аргументов <var>x</var> ,&hellip; определяют координату для этого измерения. Длина должна соответствовать их соответствующему размеру <var>m</var> .
zh_cn: <var>s</var> 参数可以在两点之间提供恒定的间距。如果 <var>s</var> 为标量，则假定为所有尺寸的间距。否则，可以通过 <var>x</var> ，&hellip;参数提供单独的间距值。标量值指定等距间距。 <var>x</var> ，&hellip;参数的矢量值指定该尺寸的坐标。长度必须与它们各自的尺寸 <var>m</var> 相匹配。

source: A continuous variable.
es: Una variable continua.
ja: 連続変数です。
ru: Непрерывная переменная.
zh_cn: 一个连续的变量。

source: A dash-dot line.
es: Una línea de puntos.
ja: ダッシュドットのライン。
ru: Точка с пунктиром.
zh_cn: 一个破折号线。

source: A data (matrix) property. <var>arg</var> contains the default data value. When no default value is given, the data is initialized to the empty matrix.
es: Una propiedad de datos (matriz). <var>arg</var> contiene el valor de datos predeterminado. Cuando no se proporciona un valor predeterminado, los datos se inicializan en la matriz vac&iacute;a.
ja: データ（行列）プロパティ。 <var>arg</var> にはデフォルトのデータ値が含まれています。デフォルト値が指定されていない場合、データは空の行列に初期化されます。
ru: Свойство данных (матрицы). <var>arg</var> содержит значение данных по умолчанию. Если значение по умолчанию не указано, данные инициализируются пустой матрицей.
zh_cn: 数据（矩阵）属性。 <var>arg</var> 包含默认数据值。如果未提供默认值，则数据将初始化为空矩阵。

source: A data structure containing the following fields:
es: Una estructura de datos que contiene los siguientes campos:
ja: 以下のフィールドを含むデータ構造体。
ru: Структура данных,содержащая следующие поля:
zh_cn: 一个包含以下字段的数据结构:

source: A date vector is a row vector with six members, representing the year, month, day, hour, minute, and seconds respectively.
es: Un vector de fecha es un vector de fila con seis miembros,que representan el año,el mes,el día,la hora,los minutos y los segundos,respectivamente.
ja: 日付ベクトルは、年、月、日、時、分、秒をそれぞれ表す6つのメンバを持つ行ベクトルです。
ru: Вектор даты-это рядный вектор с шестью членами,представляющий год,месяц,день,час,минуту и секунды соответственно.
zh_cn: 日期向量是一个有六个成员的行向量,分别代表年、月、日、时、分、秒。

source: A description of the envelope of the bug.
es: Una descripción del sobre del bicho.
ja: バグのエンベロープの説明。
ru: Описание конверта с жучком.
zh_cn: 虫子的包围圈的描述。

source: A description of what behavior you observe that you believe is incorrect. For example, "The interpreter gets a fatal signal," or, "The output produced at line 208 is incorrect."
es: Una descripción del comportamiento que observas y que crees que es incorrecto.Por ejemplo,"El intérprete recibe una señal fatal",o,"La salida producida en la línea 208 es incorrecta".
ja: どのような動作を観察して、正しくないと思うかを説明します。例えば、"インタプリタが致命的なシグナルを取得した"、"208 行目で生成された出力が正しくない" などです。
ru: Описание того,какое поведение вы наблюдаете,которое,по вашему мнению,является некорректным.Например,"Интерпретатор получает фатальный сигнал" или "Некорректен вывод,выданный на линии 208".
zh_cn: 描述你观察到的你认为不正确的行为。例如,"解释器得到一个致命信号",或 "208行产生的输出不正确"。

source: A diagonal matrix can also be transposed or conjugate-transposed, giving the expected result. Extracting a leading submatrix of a diagonal matrix, i.e., <code>D(1:m,1:n)</code>, will produce a diagonal matrix, other indexing expressions will implicitly convert to full matrix.
es: Una matriz diagonal tambi&eacute;n se puede transponer o conjugar-transponer, dando el resultado esperado. Si se extrae una submatriz inicial de una matriz diagonal, es decir, <code>D(1:m,1:n)</code> , se producir&aacute; una matriz diagonal, otras expresiones de indexaci&oacute;n se convertir&aacute;n impl&iacute;citamente en una matriz completa.
ja: 対角行列は転置または共役転置することもでき、期待される結果が得られます。対角行列の先頭のサブ行列、つまり <code>D(1:m,1:n)</code> 抽出すると、対角行列が生成され、他のインデックス式は暗黙的に完全行列に変換されます。
ru: Диагональная матрица также может быть транспонирована или сопряжена-транспонирована, что даст ожидаемый результат. При извлечении ведущей подматрицы диагональной матрицы, то есть <code>D(1:m,1:n)</code> , будет получена диагональная матрица, другие выражения индексации неявно преобразуются в полную матрицу.
zh_cn: 对角矩阵也可以进行转置或共轭转置，从而获得预期的结果。提取对角矩阵的前导子矩阵，即 <code>D(1:m,1:n)</code> 将产生对角矩阵，其他索引表达式将隐式转换为完整矩阵。
