Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/octave/octave.*.011.xlf
Languages: es, ja, ru, zh_cn

source: A specified logical operator may be used between <var>prop_name</var>, <var>prop_value</var> pairs. The supported logical operators are: <code>"-and"</code>, <code>"-or"</code>, <code>"-xor"</code>, <code>"-not"</code>. Example code to locate all figure and axes objects is
es: Se puede utilizar un operador l&oacute;gico especificado entre <var>prop_name</var> , <var>prop_value</var> pares. Los operadores l&oacute;gicos admitidos son: <code>"-and"</code> , <code>"-or"</code> , <code>"-xor"</code> , <code>"-not"</code> -not " . El c&oacute;digo de ejemplo para ubicar todos los objetos de figuras y ejes es
ja: 指定された論理演算子は、 <var>prop_name</var> と <var>prop_value</var> のペアの間で使用できます。サポートされる論理演算子は以下のとおりです。 <code>"-and"</code> 、 <code>"-or"</code> 、 <code>"-xor"</code> 、 <code>"-not"</code> 。すべてのFigureおよびAxesオブジェクトを見つけるためのサンプルコードは
ru: Указанный логический оператор может использоваться между <var>prop_name</var> , <var>prop_value</var> . Поддерживаемые логические операторы: <code>"-and"</code> , <code>"-or"</code> , <code>"-xor"</code> , <code>"-not"</code> . Пример кода для поиска всех объектов фигур и осей:
zh_cn: 在 <var>prop_name</var> 和 <var>prop_value</var> 对之间可以使用指定的逻辑运算符。支持的逻辑运算符是： <code>"-and"</code> ， <code>"-or"</code> ， <code>"-xor"</code> ， <code>"-not"</code> -not &rdquo;。定位所有图形和轴对象的示例代码为

source: A square array is a 2-D object for which <code>size (<var>x</var>)</code> returns <code>[N,&nbsp;N]</code> where N is a non-negative integer.
ja: 正方形配列は、 <code>size (<var>x</var>)</code> が <code>[N,&nbsp;N]</code> 返す2次元オブジェクトです。ここで、Nは非負の整数です。
zh_cn: 方阵是二维对象，其 <code>size (<var>x</var>)</code> 返回 <code>[N,&nbsp;N]</code> ，其中N是非负整数。

source: A string array is a data type that stores strings (row vectors of characters) at each element in the array. It is distinct from character arrays which are N-dimensional arrays where each element is a single 1x1 character. It is also distinct from cell arrays of strings which store strings at each element, but use cell indexing &lsquo;
es: Una matriz de cadenas es un tipo de datos que almacena cadenas (vectores de fila de caracteres) en cada elemento de la matriz. Es diferente de las matrices de caracteres que son matrices de N dimensiones donde cada elemento es un solo car&aacute;cter 1x1. Tambi&eacute;n es diferente de las matrices de cadenas de celdas que almacenan cadenas en cada elemento, pero utilizan la indexaci&oacute;n de celdas '
ja: 文字列配列は、配列の各要素に文字列（文字の行ベクトル）を格納するデータ型です。これは、各要素が単一の1x1文字であるN次元配列である文字配列とは異なります。また、各要素に文字列を格納する文字列のセル配列とは異なりますが、セルインデックスを使用します '
ru: Строковый массив - это тип данных, который хранит строки (векторы-строки символов) в каждом элементе массива. Он отличается от символьных массивов, которые представляют собой N-мерные массивы, где каждый элемент представляет собой один символ 1x1. Он также отличается от массивов ячеек строк, которые хранят строки в каждом элементе, но используют индексацию ячеек '
zh_cn: 字符串数组是一种数据类型，它在数组中的每个元素上存储字符串（字符的行向量）。它与字符数组不同，后者是N维数组，其中每个元素都是单个1x1字符。它也不同于在单元格中存储字符串的字符串单元格数组，但是使用单元格索引'

source: A string containing the key combination together with CTRL to execute this menu entry (e.g., <code>"x"</code> for CTRL+x).
es: Una cadena que contiene la combinaci&oacute;n de teclas junto con CTRL para ejecutar esta entrada de men&uacute; (por ejemplo, <code>"x"</code> para CTRL + x).
ja: このメニューエントリを実行するためのCTRLとキーの組み合わせを含む文字列（たとえば、CTRL + xの場合は <code>"x"</code> ）。
ru: Строка, содержащая комбинацию клавиш вместе с CTRL для выполнения этого пункта меню (например, <code>"x"</code> для CTRL + x).
zh_cn: 包含组合键和CTRL的字符串，以执行此菜单项（例如CTRL + x为 <code>"x"</code> ）。

source: A string containing the label for this menu entry. A <code>"&amp;"</code>-symbol can be used to mark the <code>"accelerator"</code> character (e.g., <code>"E&amp;xit"</code>)
es: Una cadena que contiene la etiqueta de esta entrada de men&uacute;. Se puede usar un s&iacute;mbolo <code>"&amp;"</code> para marcar el car&aacute;cter <code>"accelerator"</code> (por ejemplo, <code>"E&amp;xit"</code> )
ja: このメニューエントリのラベルを含む文字列。 <code>"&amp;"</code> -symbolをマークするために使用することができ <code>"accelerator"</code> の文字（例えば、 <code>"E&amp;xit"</code> ）
ru: Строка, содержащая метку для этого пункта меню. Для обозначения символа <code>"accelerator"</code> можно использовать символ <code>"&amp;"</code> (например, <code>"E&amp;xit"</code> ).
zh_cn: 包含此菜单项标签的字符串。阿 <code>"&amp;"</code> 码元可被用于标记 <code>"accelerator"</code> 的字符（例如， <code>"E&amp;xit"</code> ）

source: A string is returned if <var>template</var> specifies only character conversions.
es: Se devuelve una cadena si la <var>template</var> especifica solo conversiones de caracteres.
ja: <var>template</var> 文字変換のみを指定している場合、文字列が返されます。
ru: Строка возвращается, если в <var>template</var> указаны только преобразования символов.
zh_cn: 如果 <var>template</var> 仅指定字符转换，则返回字符串。

source: A string property with a limited set of accepted values. The first argument must be a string with all accepted values separated by a vertical bar (&rsquo;|&rsquo;). The default value can be marked by enclosing it with a &rsquo;{&rsquo; &rsquo;}&rsquo; pair. The default value may also be given as an optional second string argument.
es: Una propiedad de cadena con un conjunto limitado de valores aceptados. El primer argumento debe ser una cadena con todos los valores aceptados separados por una barra vertical ('|'). El valor predeterminado se puede marcar encerr&aacute;ndolo con un par '{' '}'. El valor predeterminado tambi&eacute;n se puede proporcionar como un segundo argumento de cadena opcional.
ja: 受け入れられる値の制限されたセットを持つ文字列プロパティ。最初の引数は、受け入れ可能なすべての値が縦棒（ '|'）で区切られたストリングでなければなりません。デフォルト値は、 '{' '}'ペアで囲むことによりマークできます。デフォルト値は、オプションの2番目の文字列引数として指定することもできます。
ru: Строковое свойство с ограниченным набором допустимых значений. Первым аргументом должна быть строка со всеми допустимыми значениями, разделенными вертикальной чертой ('|'). Значение по умолчанию можно пометить, заключив его в пару '{' '}'. Значение по умолчанию также может быть указано как необязательный второй строковый аргумент.
zh_cn: 具有一组有限的可接受值的字符串属性。第一个参数必须是一个字符串，所有接受的值都用竖线（'|'）分隔。默认值可以通过用'{''}'对括起来进行标记。默认值也可以作为可选的第二个字符串参数给出。

source: A string property. <var>arg</var> contains the default string value.
es: Una propiedad de cadena. <var>arg</var> contiene el valor de cadena predeterminado.
ja: 文字列プロパティ。 <var>arg</var> にはデフォルトの文字列値が含まれています。
ru: Строковое свойство. <var>arg</var> содержит строковое значение по умолчанию.
zh_cn: 字符串属性。 <var>arg</var> 包含默认字符串值。

source: A string specifying the method of integration to use to solve the ODE system. Valid values are
es: Una cadena que especifica el método de integración a utilizar para resolver el sistema ODE.Los valores válidos son
ja: ODE システムを解くために使用する統合方法を指定する文字列。有効な値は以下の通りです。
ru: Строка,указывающая способ интеграции для решения ODE-системы.Валидные значения
zh_cn: 一个字符串,指定用于解决ODE系统的积分方法。有效值是

source: A struct with geotagging information retrieved from the Exif tag.
es: Una estructura con información de geoetiquetado recuperada de la etiqueta Exif.
ja: Exif タグから取得したジオタグ情報を持つ構造体。
ru: Структура с геотеговой информацией,извлеченной из Exif-тега.
zh_cn: 一个包含从Exif标签中获取的地理标签信息的结构。

source: A struct with information retrieved from the Exif tag.
es: Una estructura con información recuperada de la etiqueta Exif.
ja: Exifタグから取得した情報を持つ構造体。
ru: Структура с информацией,извлеченной из Exif-тега.
zh_cn: 一个包含从Exif标签中获取信息的结构。

source: A structure array is a particular instance of a structure, where each of the fields of the structure is represented by a cell array. Each of these cell arrays has the same dimensions. Conceptually, a structure array can also be seen as an array of structures with identical fields. An example of the creation of a structure array is
es: Un conjunto de estructuras es un caso particular de una estructura,en el que cada uno de los campos de la estructura está representado por un conjunto de células.Cada uno de estos conjuntos de células tiene las mismas dimensiones.Conceptualmente,un conjunto de estructuras también puede verse como un conjunto de estructuras con campos idénticos.Un ejemplo de la creación de un conjunto de estructuras es
ja: 構造体配列は構造体の特定のインスタンスであり、構造体の各フィールドはセル配列で表されます。これらのセル配列のそれぞれは同じ次元を持っています。概念的には、構造体の配列は、同じフィールドを持つ構造体の配列として見ることもできます。構造体の配列を作成する例を以下に示します。
ru: Массив структуры-это конкретный экземпляр структуры,где каждое из полей структуры представлено массивом ячеек.Каждый из этих массивов ячеек имеет одинаковые размеры.Концептуально массив структуры также можно рассматривать как массив структур с одинаковыми полями.Примером создания массива структуры является
zh_cn: 结构数组是结构的一个特定实例,结构的每个字段都由一个单元格数组表示。每一个单元数组都有相同的尺寸。从概念上讲,结构数组也可以看作是具有相同字段的结构数组。创建结构数组的一个例子是

source: A structure containing information on where the message occurred. This may be an empty structure if the information cannot be obtained. The fields of the structure are:
es: Una estructura que contiene información sobre el lugar donde se produjo el mensaje.Puede ser una estructura vacía si no se puede obtener la información.Los campos de la estructura son:
ja: メッセージが発生した場所に関する情報を含む構造体。情報が得られない場合は空の構造体になることがあります。構造体のフィールドは以下の通りです。
ru: Структура,содержащая информацию о том,где произошло сообщение.Это может быть пустая структура,если информация не может быть получена.Поля структуры являются полями:
zh_cn: 包含电文发生地信息的结构。如果无法获得信息,可以是一个空结构。该结构的字段为:

source: A structure containing the following parameters used to define the behavior of solver. Missing elements in the structure take on default values, so you only need to set the elements that you wish to change from the default.
es: Una estructura que contiene los siguientes parámetros usados para definir el comportamiento del solucionador.Los elementos faltantes en la estructura toman valores por defecto,por lo que sólo es necesario fijar los elementos que se desean cambiar del valor por defecto.
ja: ソルバーの動作を定義するために使用される以下のパラメータを含む構造体。構造体の中で欠落している要素はデフォルト値を取るので、デフォルトから変更したい要素だけを設定する必要があります。
ru: Структура,содержащая следующие параметры,используемые для определения поведения решателя.Пропущенные элементы в структуре принимают значения по умолчанию,поэтому вам нужно только установить элементы,которые вы хотите изменить по умолчанию.
zh_cn: 一个包含以下参数的结构,用于定义求解器的行为。结构中缺失的元素采用默认值,所以只需要设置你想改变默认值的元素。

source: A structure containing the system CPU time used. The structure has the elements <code>sec</code> (seconds) <code>usec</code> (microseconds).
es: Una estructura que contiene el tiempo de CPU del sistema utilizado. La estructura tiene los elementos <code>sec</code> (segundos) <code>usec</code> (microsegundos).
ja: 使用されたシステムCPU時間を含む構造。構造には、 <code>sec</code> （秒）、 <code>usec</code> （マイクロ秒）の要素があります。
ru: Структура, содержащая используемое время процессора системы. В структуре есть элементы <code>sec</code> (секунды) <code>usec</code> (микросекунды).
zh_cn: 包含使用的系统CPU时间的结构。该结构的元素为 <code>sec</code> （秒）， <code>usec</code> （微秒）。

source: A structure containing the text of each matched named token, with the name being used as the fieldname. A named token is denoted by <code>(?&lt;name&gt;&hellip;)</code>.
es: Una estructura que contiene el texto de cada token con nombre coincidente, y el nombre se utiliza como nombre de campo. Un token con nombre se indica mediante <code>(?&lt;name&gt;&hellip;)</code> .
ja: 一致する各名前付きトークンのテキストを含む構造。名前はフィールド名として使用されます。名前付きトークンは <code>(?&lt;name&gt;&hellip;)</code> で示されます。
ru: Структура, содержащая текст каждого сопоставленного именованного токена, при этом имя используется в качестве имени поля. Именованный токен обозначается <code>(?&lt;name&gt;&hellip;)</code> .
zh_cn: 包含每个匹配的命名令牌的文本的结构，该名称用作字段名。命名令牌由 <code>(?&lt;name&gt;&hellip;)</code> 。

source: A structure containing the user CPU time used. The structure has the elements <code>sec</code> (seconds) <code>usec</code> (microseconds).
es: Una estructura que contiene el tiempo de CPU del usuario utilizado. La estructura tiene los elementos <code>sec</code> (segundos) <code>usec</code> (microsegundos).
ja: 使用されたユーザーCPU時間を含む構造。構造には、 <code>sec</code> （秒）、 <code>usec</code> （マイクロ秒）の要素があります。
ru: Структура, содержащая использованное время ЦП пользователя. В структуре есть элементы <code>sec</code> (секунды) <code>usec</code> (микросекунды).
zh_cn: 包含使用的用户CPU时间的结构。该结构的元素为 <code>sec</code> （秒）， <code>usec</code> （微秒）。

source: A structure in Octave is a map between a number of fields represented and their values. The Standard Template Library <code>map</code> class is used, with the pair consisting of a <code>std::string</code> and an Octave <code>Cell</code> variable.
es: Una estructura en Octave es un mapa entre varios campos representados y sus valores. Se utiliza la clase de <code>map</code> a de la biblioteca de plantillas est&aacute;ndar , y el par consta de una variable <code>std::string</code> y una <code>Cell</code> octava .
ja: Octaveの構造は、表現されたいくつかのフィールドとそれらの値の間のマップです。標準テンプレートライブラリ <code>map</code> クラスが使用され、ペアは <code>std::string</code> とOctave <code>Cell</code> 変数で構成されます。
ru: Структура в Octave - это карта между количеством представленных полей и их значениями. Используется класс <code>map</code> стандартной библиотеки шаблонов с парой, состоящей из <code>std::string</code> и переменной Octave <code>Cell</code> .
zh_cn: Octave中的结构是表示的多个字段与其值之间的映射。使用标准模板库 <code>map</code> 类，该对类由 <code>std::string</code> 和Octave <code>Cell</code> 变量组成。

source: A structure or structure array <var>warning_struct</var>, with fields <code>"state"</code> and <code>"identifier"</code>, may be given as an input to achieve equivalent results. The following example shows how to temporarily disable a warning and then restore its original state:
es: Una estructura o matriz de estructura <var>warning_struct</var> , con los campos <code>"state"</code> e <code>"identifier"</code> , puede proporcionarse como entrada para lograr resultados equivalentes. El siguiente ejemplo muestra c&oacute;mo deshabilitar temporalmente una advertencia y luego restaurar su estado original:
ja: 同等の結果を得るには、フィールド <code>"state"</code> と <code>"identifier"</code> 持つ構造または構造配列 <var>warning_struct</var> を入力として指定できます。次の例は、警告を一時的に無効にしてから元の状態に戻す方法を示しています。
ru: Структура или массив структур <var>warning_struct</var> с полями <code>"state"</code> и <code>"identifier"</code> могут быть предоставлены в качестве входных данных для достижения эквивалентных результатов. В следующем примере показано, как временно отключить предупреждение, а затем восстановить его исходное состояние:
zh_cn: 可以将具有字段 <code>"state"</code> 和 <code>"identifier"</code> 的结构或结构数组 <var>warning_struct</var> 用作输入，以实现等效的结果。以下示例显示如何临时禁用警告，然后恢复其原始状态：

source: A structure returned from <code>optimset</code> or an empty matrix to indicate that defaults should be used.
es: Una estructura devuelta de <code>optimset</code> o una matriz vac&iacute;a para indicar que se deben usar los valores predeterminados.
ja: デフォルトを使用する必要があることを示すために <code>optimset</code> または空の行列から返される構造。
ru: Структура, возвращаемая из <code>optimset</code> , или пустая матрица, указывающая, что следует использовать значения по умолчанию.
zh_cn: 从 <code>optimset</code> 返回的结构或一个空矩阵，指示应使用默认值。

source: A structure with two fields:
es: Una estructura con dos campos:
ja: 2つのフィールドを持つ構造体。
ru: Структура с двумя полями:
zh_cn: 一个结构有两个领域。

source: A summary view of a data set can be generated quickly with the <code>statistics</code> function.
es: Se puede generar r&aacute;pidamente una vista resumida de un conjunto de datos con la funci&oacute;n de <code>statistics</code> .
ja: <code>statistics</code> 機能を使用すると、データセットの概要ビューをすばやく生成できます。
ru: Сводное представление набора данных можно быстро создать с помощью функции <code>statistics</code> .
zh_cn: 可以使用 <code>statistics</code> 功能快速生成数据集的摘要视图。

source: A third boolean argument <var>hilev</var> can be passed to specify whether the function should preserve listeners/callbacks, e.g., for legends or hggroups. The default is false.
es: Se puede pasar un tercer argumento booleano <var>hilev</var> para especificar si la funci&oacute;n debe preservar los oyentes / devoluciones de llamada, por ejemplo, para leyendas o hggroups. El valor predeterminado es falso.
ja: 3番目のブール引数 <var>hilev</var> を渡して、関数がリスナーやコールバックを保存するかどうかを指定できます（例：凡例またはhggroups）。デフォルトはfalseです。
ru: Можно <var>hilev</var> третий логический аргумент hilev , чтобы указать, должна ли функция сохранять слушателей / обратные вызовы, например, для легенд или hggroups. По умолчанию - false.
zh_cn: 可以传递第三个布尔参数 <var>hilev</var> 来指定函数是否应保留侦听器/回调，例如用于图例或hggroup。默认为false。

source: A third means of creating a sparse matrix is to work directly with the data in compressed row format. An example of this advanced technique might be
es: Un tercer medio de crear una matriz dispersa es trabajar directamente con los datos en formato de fila comprimida.Un ejemplo de esta técnica avanzada podría ser
ja: 疎な行列を作成する第三の方法は,圧縮された行形式のデータを直接扱うことです.この高度な手法の例としては,次のようなものがあります.
ru: Третьим способом создания разреженной матрицы является работа непосредственно с данными в сжатом строковом формате.Примером этой передовой методики может быть
zh_cn: 创建稀疏矩阵的第三种手段是直接以压缩行格式处理数据。这种先进技术的一个例子可能是

source: A three-dimensional surface.
es: Una superficie tridimensional.
ja: 立体的な表面。
ru: Трехмерная поверхность.
zh_cn: 一个立体的表面。

source: A trivial example which redefines the <code>sin</code> function to be the <code>cos</code> function shows how <code>builtin</code> works.
es: Un ejemplo trivial que redefine la funci&oacute;n <code>sin</code> para que sea la funci&oacute;n <code>cos</code> muestra c&oacute;mo funciona la funci&oacute;n <code>builtin</code> .
ja: <code>sin</code> 関数を <code>cos</code> 関数に再定義する簡単な例は、 <code>builtin</code> 関数がどのように機能するかを示しています。
ru: Тривиальный пример, который переопределяет функцию <code>sin</code> на функцию <code>cos</code> , показывает, как работает <code>builtin</code> функция .
zh_cn: 一个简单的示例将 <code>sin</code> 函数重新定义为 <code>cos</code> 函数，显示了 <code>builtin</code> 函数的工作原理。

source: A tube diameter of zero corresponds to the smallest scaling value along the streamline and the largest tube diameter corresponds to the largest scaling value.
ja: チューブ径がゼロの場合は、流線に沿った最小のスケーリング値に対応し、最大のチューブ径は最大のスケーリング値に対応します。
zh_cn: 管径为零对应的是沿流线最小的缩放值,管径最大对应的是最大的缩放值。

source: A typical case is <var>A</var> defined by <code><var>b</var> ^ <var>m</var></code>, in which the result <code><var>A</var> * <var>x</var></code> can be computed without even forming explicitly <code><var>b</var> ^ <var>m</var></code> by:
es: Un caso t&iacute;pico es <var>A</var> definido por <code><var>b</var> ^ <var>m</var></code> , en el que el resultado <code><var>A</var> * <var>x</var></code> se puede calcular sin siquiera formar expl&iacute;citamente <code><var>b</var> ^ <var>m</var></code> mediante:
ja: 典型的なケースは <code><var>b</var> ^ <var>m</var></code> ^ <var>m</var> で定義された <var>A</var> であり、結果 <code><var>A</var> * <var>x</var></code> * <var>x</var> は次のように明示的に <code><var>b</var> ^ <var>m</var></code> ^ <var>m</var> を形成することなく計算できます。
ru: Типичным случаем является <var>A</var> , определяемый как <code><var>b</var> ^ <var>m</var></code> , в котором результат <code><var>A</var> * <var>x</var></code> может быть вычислен даже без явного формирования <code><var>b</var> ^ <var>m</var></code> :
zh_cn: 典型的情况是由 <code><var>b</var> ^ <var>m</var></code> ^ <var>m</var> 定义的 <var>A</var> ，其中可以通过以下方式甚至不显式地形成 <code><var>b</var> ^ <var>m</var></code> ^ <var>m</var> 来计算结果 <code><var>A</var> * <var>x</var></code> * <var>x</var> ：

source: A uibuttongroup is used to group uicontrol objects.
es: Un uibuttongroup se utiliza para agrupar objetos de uicontrol.
ja: uibuttongroupは、uicontrolオブジェクトをグループ化するために使用されます。
ru: Для группировки объектов uicontrol используется uibuttongroup.
zh_cn: uibuttongroup用于对uicontrol对象进行分组。

source: A uicontrol object is used to create simple interactive controls such as push buttons, checkboxes, edit and list controls.
es: Un objeto de uicontrol se utiliza para crear controles interactivos simples como botones pulsadores,casillas de verificación,controles de edición y de lista.
ja: uicontrol オブジェクトは、プッシュボタン、チェックボックス、編集、リストコントロールなどのシンプルなインタラクティブコントロールを作成するために使用されます。
ru: Объект uicontrol используется для создания простых интерактивных элементов управления,таких как кнопки,флажки,элементы управления редактированием и списком.
zh_cn: uicontrol对象用于创建简单的交互式控件,如按钮、复选框、编辑和列表控件。

source: A uitable object is used to show tables of data in a figure window.
es: Un objeto útil se utiliza para mostrar tablas de datos en una ventana de figuras.
ja: uitableオブジェクトは、図ウィンドウにデータの表を表示するために使用されます。
ru: Для отображения таблиц данных в окне рисунка используется объект uitable.
zh_cn: uitable对象用于在图形窗口中显示数据的表格。

source: A user-defined function executed once per algorithm iteration.
es: Una función definida por el usuario ejecutada una vez por iteración de algoritmo.
ja: アルゴリズムの繰り返しごとに1回実行されるユーザ定義の関数。
ru: Определенная пользователем функция,выполняемая один раз за итерацию алгоритма.
zh_cn: 用户定义的函数,每次算法迭代执行一次。

source: A user-defined string to label the graphics object.
es: Una cadena definida por el usuario para etiquetar el objeto gráfico.
ja: グラフィックスオブジェクトにラベルを付けるためのユーザー定義の文字列。
ru: Определенная пользователем строка для обозначения графического объекта.
zh_cn: 用于标记图形对象的用户自定义字符串。

source: A valid function name is like a valid variable name: a sequence of letters, digits and underscores, not starting with a digit. Functions share the same pool of names as variables.
es: Un nombre de función válido es como un nombre de variable válido:una secuencia de letras,dígitos y guiones bajos,que no comienza con un dígito.Las funciones comparten el mismo conjunto de nombres que las variables.
ja: 有効な関数名は、有効な変数名のようなものです。関数は変数と同じ名前のプールを共有しています。
ru: Имя допустимой функции похоже на имя допустимой переменной:последовательность букв,цифр и знаков подчеркивания,не начинающаяся с цифры.Функции имеют тот же пул имен,что и переменные.
zh_cn: 一个有效的函数名就像一个有效的变量名一样:一个由字母、数字和下划线组成的序列,而不是以数字开头。函数与变量共享同一个名字。

source: A valid variable name is a sequence of letters, digits, and underscores that does not begin with a digit.
es: Un nombre de variable válido es una secuencia de letras,dígitos y guiones bajos que no comienza con un dígito.
ja: 有効な変数名は、桁で始まらない文字、数字、アンダースコアのシーケンスです。
ru: Имя допустимой переменной-это последовательность букв,цифр и символов подчеркивания,которая не начинается с цифры.
zh_cn: 一个有效的变量名是一个不以数字开头的字母、数字和下划线的序列。

source: A valid variable name is composed of letters, digits, and underscores ("_"), and the first character must not be a digit.
es: Un nombre de variable válido se compone de letras,dígitos y guiones bajos ("_"),y el primer carácter no debe ser un dígito.
ja: 有効な変数名は、文字、数字、アンダースコア("_")で構成され、最初の文字は数字であってはなりません。
ru: Имя допустимой переменной состоит из букв,цифр и символов подчеркивания ("_"),и первый символ не должен быть цифрой.
zh_cn: 一个有效的变量名由字母、数字和下划线("_")组成,第一个字符不能是数字。

source: A value of 1 or true instructs <code>textscan</code> to concatenate consecutive columns of the same class in the output cell array. A value of 0 or false (default) leaves output in distinct columns.
es: Un valor de 1 o verdadero indica a <code>textscan</code> que concatenar columnas consecutivas de la misma clase en la matriz de celdas de salida. Un valor de 0 o falso (predeterminado) deja la salida en columnas distintas.
ja: 1またはtrueの値は、出力セル配列内の同じクラスの連続する列を連結するように <code>textscan</code> に指示します。値0またはfalse（デフォルト）は、出力を別個の列に残します。
ru: Значение 1 или истина указывает <code>textscan</code> объединять последовательные столбцы одного и того же класса в выходной массив ячеек. Значение 0 или false (по умолчанию) оставляет вывод в отдельных столбцах.
zh_cn: 值为1或true指示 <code>textscan</code> 串联输出单元格数组中同一类的连续列。值为0或false（默认）会将输出留在不同的列中。
