Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/octave/octave.*.020.xlf
Languages: es, ru, zh_cn

source: There are several basic functions to return specific sparse matrices. For example the sparse identity matrix, is a matrix that is often needed. It therefore has its own function to create it as <code>speye (<var>n</var>)</code> or <code>speye (<var>r</var>, <var>c</var>)</code>, which creates an <var>n</var>-by-<var>n</var> or <var>r</var>-by-<var>c</var> sparse identity matrix.
es: Hay varias funciones b&aacute;sicas para devolver matrices dispersas espec&iacute;ficas. Por ejemplo, la matriz de identidad dispersa es una matriz que a menudo se necesita. Por lo tanto, tiene su propia funci&oacute;n para crearlo como <code>speye (<var>n</var>)</code> o <code>speye (<var>r</var>, <var>c</var>)</code> , lo que crea una matriz de identidad escasa <var>n</var> - por- <var>n</var> o <var>r</var> -by- <var>c</var> .
ru: Есть несколько основных функций для возврата конкретных разреженных матриц. Например, разреженная единичная матрица - это матрица, которая часто требуется. Поэтому она имеет свою собственную функцию , чтобы создать его как <code>speye (<var>n</var>)</code> или <code>speye (<var>r</var>, <var>c</var>)</code> , что создает <var>n</var> матрицу с размерностью <var>n</var> или <var>r</var> матрица с размерностью <var>c</var> разреженной матрицей.
zh_cn: 有几个基本函数可返回特定的稀疏矩阵。例如，稀疏身份矩阵是经常需要的矩阵。因此，它具有将其创建为 <code>speye (<var>n</var>)</code> 或 <code>speye (<var>r</var>, <var>c</var>)</code> ，这会创建 <var>n</var> &times; <var>n</var> 或 <var>r</var> &times; <var>c</var> 稀疏身份矩阵。

source: There are several basic ways of constructing matrices or multi-dimensional arrays. Using the class <code>Matrix</code> as an example one can
es: Hay varias formas b&aacute;sicas de construir matrices o arreglos multidimensionales. Usando la clase <code>Matrix</code> como ejemplo, uno puede
ru: Есть несколько основных способов построения матриц или многомерных массивов. На примере класса <code>Matrix</code> можно
zh_cn: 有几种构造矩阵或多维数组的基本方法。以 <code>Matrix</code> 类为例可以

source: There are several functions within Octave that can be useful for the purposes of parameter checking. These include the methods of the <code>octave_value</code> class like <code>is_real_matrix</code>, <code>is_numeric_type</code>, etc. (see
es: Hay varias funciones dentro de Octave que pueden resultar &uacute;tiles para comprobar los par&aacute;metros. Estos incluyen los m&eacute;todos de la <code>octave_value</code> clase como <code>is_real_matrix</code> , <code>is_numeric_type</code> , etc. (v&eacute;ase
ru: В Octave есть несколько функций, которые могут быть полезны для проверки параметров. К ним относятся методы <code>octave_value</code> класса как <code>is_real_matrix</code> , <code>is_numeric_type</code> и т.д. (см
zh_cn: Octave中有几个功能可用于参数检查。这些包括 <code>octave_value</code> 类的方法，例如 <code>is_real_matrix</code> ， <code>is_numeric_type</code> 等（请参见）。

source: There are several graphical means of finding out information about sparse matrices. The first is the <em>spy</em> command, which displays the structure of the nonzero elements of the matrix. See <a href="#fig_003aspmatrix">Figure 22.1</a>, for an example of the use of <em>spy</em>. More advanced graphical information can be obtained with the <em>treeplot</em>, <em>etreeplot</em> and <em>gplot</em> commands.
es: Hay varios medios gr&aacute;ficos para encontrar informaci&oacute;n sobre matrices dispersas. El primero es el comando <em>esp&iacute;a</em> , que muestra la estructura de los elementos distintos de cero de la matriz. Consulte la <a href="#fig_003aspmatrix">Figura 22.1</a> para ver un ejemplo del uso de <em>esp&iacute;a</em> . Se puede obtener informaci&oacute;n gr&aacute;fica m&aacute;s avanzada con los <em>comandos treeplot</em> , <em>etreeplot</em> y <em>gplot</em> .
ru: Есть несколько графических средств поиска информации о разреженных матрицах. Первая - это <em>шпионская</em> команда, которая отображает структуру ненулевых элементов матрицы. См. <a href="#fig_003aspmatrix">Рисунок 22.1</a> , где показан пример использования <em>шпиона</em> . Более подробную графическую информацию можно получить с помощью <em>команд treeplot</em> , <em>etreeplot</em> и <em>gplot</em> .
zh_cn: 有几种图形方法可以找到有关稀疏矩阵的信息。第一个是<em>spy</em>命令，该命令显示矩阵的非零元素的结构。有关使用<em>间谍</em>的示例，请参<a href="#fig_003aspmatrix">见图22.1</a>。可以使用<em>treeplot</em>，<em>etreeplot</em>和<em>gplot</em>命令获得更高级的图形信息。<em></em><em></em><em></em><em></em>

source: There are several means to create sparse matrix.
es: Hay varios medios para crear una matriz dispersa.
ru: Существует несколько способов создания разреженной матрицы.
zh_cn: 创建稀疏矩阵有几种手段。

source: There are some important differences between the various interpolation methods. The <code>"spline"</code> method enforces that both the first and second derivatives of the interpolated values have a continuous derivative, whereas the other methods do not. This means that the results of the <code>"spline"</code> method are generally smoother. If the function to be interpolated is in fact smooth, then <code>"spline"</code> will give excellent results. However, if the function to be evaluated is in some manner discontinuous, then <code>"pchip"</code> interpolation might give better results.
es: Existen algunas diferencias importantes entre los distintos m&eacute;todos de interpolaci&oacute;n. El m&eacute;todo <code>"spline"</code> obliga a que tanto la primera como la segunda derivada de los valores interpolados tengan una derivada continua, mientras que los otros m&eacute;todos no. Esto significa que los resultados del m&eacute;todo <code>"spline"</code> son generalmente m&aacute;s suaves. Si la funci&oacute;n a interpolar es de hecho fluida, entonces <code>"spline"</code> dar&aacute; excelentes resultados. Sin embargo, si la funci&oacute;n a evaluar es de alguna manera discontinua, entonces la interpolaci&oacute;n <code>"pchip"</code> podr&iacute;a dar mejores resultados.
ru: Между различными методами интерполяции есть некоторые важные различия. Метод <code>"spline"</code> требует, чтобы и первая, и вторая производные интерполированных значений имели непрерывную производную, тогда как другие методы не имеют. Это означает, что результаты <code>"spline"</code> метода в целом более плавные. Если функция, которую нужно интерполировать, действительно гладкая, то <code>"spline"</code> даст отличные результаты. Однако, если функция, которая должна быть оценена, в некотором <code>"pchip"</code> прерывистая, то интерполяция "pchip" может дать лучшие результаты.
zh_cn: 各种插值方法之间存在一些重要差异。在 <code>"spline"</code> 方法强制执行内插的值的所述第一和第二导数具有连续衍生物，而其它方法则没有。这意味着 <code>"spline"</code> 方法的结果通常更平滑。如果要插值的函数实际上是平滑的，则 <code>"spline"</code> 将给出出色的结果。但是，如果要评估的函数以某种方式不连续，则 <code>"pchip"</code> 插值可能会提供更好的结果。

source: There are three additional support functions that allow the user to find out where in the execution of a script Octave entered the debug mode, and to print the code in the script surrounding the point where Octave entered debug mode.
es: Hay tres funciones de apoyo adicionales que permiten al usuario averiguar en qué punto de la ejecución de un script Octava entró en el modo de depuración,e imprimir el código del script que rodea el punto en el que Octava entró en el modo de depuración.
ru: Есть три дополнительные функции поддержки,которые позволяют пользователю узнать,где в исполнении скрипта Октава вошла в отладочный режим,и распечатать код в скрипте,окружающем точку,где Октава вошла в отладочный режим.
zh_cn: 有三个额外的支持功能,允许用户找出Octave在脚本执行过程中进入调试模式的位置,并打印Octave进入调试模式点周围的脚本代码。

source: There are three calling forms of the function:
es: Hay tres formas de llamada de la función:
ru: Есть три формы вызова функции:
zh_cn: 函数的调用形式有三种。

source: There are three classes of sparse objects that are of interest to the user.
es: Hay tres clases de objetos dispersos que son de interés para el usuario.
ru: Существует три класса разрозненных объектов,представляющих интерес для пользователя.
zh_cn: 用户感兴趣的稀疏对象有三类。

source: There are three files that are always available. Although these files can be accessed using their corresponding numeric file ids, you should always use the symbolic names given in the table below, since it will make your programs easier to understand.
es: Hay tres archivos que siempre están disponibles.Aunque se puede acceder a estos archivos mediante sus correspondientes identificadores de archivos numéricos,debe utilizar siempre los nombres simbólicos que se indican en la tabla siguiente,ya que esto hará que sus programas sean más fáciles de entender.
ru: Есть три файла,которые всегда доступны.Хотя доступ к этим файлам можно получить,используя их соответствующие цифровые идентификаторы файлов,вы всегда должны использовать символические имена,приведенные в таблице ниже,так как это сделает ваши программы более понятными.
zh_cn: 有三个文件是始终可用的。虽然这些文件可以使用相应的数字文件ID来访问,但你应该始终使用下表给出的符号名称,因为这将使你的程序更容易理解。

source: There are three functions that modify the behavior of <code>save</code>.
es: Hay tres funciones que modifican el comportamiento de <code>save</code> .
ru: Есть три функции, которые изменяют поведение <code>save</code> .
zh_cn: 有三个函数可以修改 <code>save</code> 的行为。

source: There are three multi-dimensional interpolation functions in Octave, with similar capabilities. Methods using Delaunay tessellation are described in <a href="interpolation-on-scattered-data#Interpolation-on-Scattered-Data">Interpolation on Scattered Data</a>.
es: Hay tres funciones de interpolaci&oacute;n multidimensionales en Octave, con capacidades similares. Los m&eacute;todos que utilizan la teselaci&oacute;n de Delaunay se describen en <a href="interpolation-on-scattered-data#Interpolation-on-Scattered-Data">Interpolaci&oacute;n de datos dispersos</a> .
ru: В Octave есть три функции многомерной интерполяции с аналогичными возможностями. Методы, использующие тесселяцию Делоне, описаны в <a href="interpolation-on-scattered-data#Interpolation-on-Scattered-Data">разделе &laquo;Интерполяция разбросанных данных&raquo;</a> .
zh_cn: 八度中有三个多维内插函数，具有相似的功能。<a href="interpolation-on-scattered-data#Interpolation-on-Scattered-Data">在散乱数据插值</a>中介绍了使用Delaunay细分的方法。

source: There are three ways to give the property names and values:
es: Hay tres maneras de dar los nombres y valores de las propiedades:
ru: Есть три способа дать имена и значения свойств:
zh_cn: 有三种方式可以赋予属性名称和数值。

source: There are times when it is useful to write code that contains assignments within the condition of a <code>while</code> or <code>if</code> statement. For example, statements like
es: Hay ocasiones en las que es &uacute;til escribir c&oacute;digo que contenga asignaciones dentro de la condici&oacute;n de una instrucci&oacute;n <code>while</code> o <code>if</code> . Por ejemplo, declaraciones como
ru: Бывают случаи, когда полезно писать код, содержащий присваивания в пределах условия <code>while</code> или <code>if</code> . Например, такие утверждения, как
zh_cn: 有时在 <code>while</code> 或 <code>if</code> 语句的条件下编写包含赋值的代码很有用。例如，类似

source: There are two basic means of interrupting the execution of an Octave script. These are breakpoints (see <a href="breakpoints#Breakpoints">Breakpoints</a>), discussed in the next section, and interruption based on some condition.
es: Hay dos medios b&aacute;sicos para interrumpir la ejecuci&oacute;n de un script de Octave. Estos son puntos de interrupci&oacute;n (consulte <a href="breakpoints#Breakpoints">Puntos de</a> interrupci&oacute;n ), que se tratan en la siguiente secci&oacute;n, e interrupciones basadas en alguna condici&oacute;n.
ru: Есть два основных способа прерывания выполнения скрипта Octave. Это точки останова (см. <a href="breakpoints#Breakpoints">Точки останова</a> ), обсуждаемые в следующем разделе, и прерывание, основанное на каком-либо условии.
zh_cn: 有两种基本方法可以中断Octave脚本的执行。这些是断点（请参见<a href="breakpoints#Breakpoints">Breakpoints</a>），将在下一节中进行讨论，并会基于某些条件而中断。

source: There are two important things to know in this case. First, the number of input arguments to the user function is fixed, and in the above example is a single argument. Second, to avoid leaving the temporary function in the Octave symbol table it should be cleared after use. Also, by convention all internal function names begin and end with the character sequence &lsquo;
es: Hay dos cosas importantes que debe saber en este caso. Primero, el n&uacute;mero de argumentos de entrada para la funci&oacute;n de usuario es fijo, y en el ejemplo anterior es un solo argumento. En segundo lugar, para evitar dejar la funci&oacute;n temporal en la tabla de s&iacute;mbolos de octava, debe borrarse despu&eacute;s de su uso. Adem&aacute;s, por convenci&oacute;n, todos los nombres de funciones internas comienzan y terminan con la secuencia de caracteres '
ru: В этом случае нужно знать две важные вещи. Во-первых, количество входных аргументов для пользовательской функции фиксировано, и в приведенном выше примере это единственный аргумент. Во-вторых, чтобы не оставлять временную функцию в таблице символов Octave, ее следует очистить после использования. Кроме того, по соглашению все имена внутренних функций начинаются и заканчиваются последовательностью символов '
zh_cn: 在这种情况下，有两件重要的事情要知道。首先，用户函数的输入参数的数量是固定的，在上面的示例中是单个参数。其次，为避免将临时功能保留在八度符号表中，使用后应将其清除。同样，按照惯例，所有内部函数名称都以字符序列&ldquo;

source: There are two intrinsically different types of <code>classdef</code> classes, whose major difference is the behavior regarding variable assignment. The first type are <b>value classes</b>:
es: Hay dos tipos intr&iacute;nsecamente diferentes de clases <code>classdef</code> , cuya principal diferencia es el comportamiento con respecto a la asignaci&oacute;n de variables. El primer tipo son <b>clases de valor</b> :
ru: Существует два принципиально разных типа классов <code>classdef</code> , основное различие которых заключается в поведении при назначении переменных. Первый тип - это <b>классы значений</b> :
zh_cn: 有两种本质上不同的 <code>classdef</code> 类，它们的主要区别是关于变量赋值的行为。第一种类型是<b>值类</b>：

source: There are two significant limitations on Fourier interpolation. First, the function signal is assumed to be periodic, and so non-periodic signals will be poorly represented at the edges. Second, both the signal and its interpolation are required to be sampled at equispaced points. An example of the use of <code>interpft</code> is
es: Hay dos limitaciones importantes en la interpolaci&oacute;n de Fourier. Primero, se supone que la se&ntilde;al de funci&oacute;n es peri&oacute;dica, por lo que las se&ntilde;ales no peri&oacute;dicas estar&aacute;n mal representadas en los bordes. En segundo lugar, tanto la se&ntilde;al como su interpolaci&oacute;n deben muestrearse en puntos equiespaciados. Un ejemplo del uso de <code>interpft</code> es
ru: Есть два существенных ограничения на интерполяцию Фурье. Во-первых, предполагается, что функциональный сигнал является периодическим, и поэтому непериодические сигналы будут плохо представлены на краях. Во-вторых, и сигнал, и его интерполяция должны быть дискретизированы в точках с равным интервалом. Пример использования <code>interpft</code> :
zh_cn: 傅里叶插值有两个明显的限制。首先，功能信号被假定为周期性的，因此非周期性信号在边缘处的表现不佳。其次，信号及其内插都需要在等距点进行采样。使用 <code>interpft</code> 的示例是

source: There are two useful strategies for creating a sparse matrix. The first is to create three vectors representing the row index, column index, and data values, and from these create the matrix. The second alternative is to create a sparse matrix with the appropriate amount of space, and then fill in the values. Both techniques have their advantages and disadvantages.
es: Hay dos estrategias útiles para crear una matriz dispersa.La primera es crear tres vectores que representen el índice de fila,el índice de columna y los valores de los datos,y a partir de ellos crear la matriz.La segunda alternativa es crear una matriz dispersa con la cantidad apropiada de espacio,y luego llenar los valores.Ambas técnicas tienen sus ventajas y desventajas.
ru: Есть две полезные стратегии для создания разреженной матрицы.Первая-это создание трех векторов,представляющих индекс строки,индекс столбца и значения данных,из которых и создается матрица.Второй вариант-создать разреженную матрицу с соответствующим количеством пространства,а затем заполнить значения.Оба метода имеют свои преимущества и недостатки.
zh_cn: 创建稀疏矩阵有两种有用的策略。第一种是创建三个向量,分别代表行索引、列索引和数据值,并由这些向量创建矩阵。第二种选择是用适当的空间创建一个稀疏矩阵,然后填入数值。这两种技术各有优缺点。

source: There is however one known case where this behavior of Octave&rsquo;s sparse matrices will cause a problem. That is in the handling of the <em>diag</em> function. Whether <em>diag</em> returns a sparse or full matrix depending on the type of its input arguments. So
es: Sin embargo, hay un caso conocido en el que este comportamiento de las matrices dispersas de Octave causar&aacute; un problema. Eso est&aacute; en el manejo de la funci&oacute;n <em>diag</em> . Si <em>diag</em> devuelve una matriz dispersa o completa seg&uacute;n el tipo de sus argumentos de entrada. Entonces
ru: Однако есть один известный случай, когда такое поведение разреженных матриц Octave вызовет проблему. Это связано с обработкой функции <em>диагностики</em> . Возвращает ли <em>diag</em> разреженную или полную матрицу в зависимости от типа входных аргументов. Так
zh_cn: 但是，在一种已知的情况下，八度的稀疏矩阵的这种行为会引起问题。那就是在处理<em>diag</em>功能。是否<em>DIAG</em>返回一个稀疏或全矩阵取决于其输入参数的类型。所以

source: There is no great harm in using <code>F77_XFCN</code> in all cases, except that for Fortran code that is short running and executes a large number of times, there is potentially an overhead in doing so. However, if <code>F77_FCN</code> is used with code that calls <code>XSTOP</code>, Octave can generate a segmentation fault.
es: No hay gran da&ntilde;o en el uso de <code>F77_XFCN</code> en todos los casos, excepto que para el c&oacute;digo Fortran que se ejecuta brevemente y se ejecuta una gran cantidad de veces, existe una sobrecarga potencial al hacerlo. Sin embargo, si <code>F77_FCN</code> se usa con un c&oacute;digo que llama a <code>XSTOP</code> , Octave puede generar una falla de segmentaci&oacute;n.
ru: Нет большого вреда в использовании <code>F77_XFCN</code> во всех случаях, за исключением того, что для кода Fortran, который работает быстро и выполняется большое количество раз, это потенциально связано с накладными расходами. Однако, если <code>F77_FCN</code> используется с кодом, который вызывает <code>XSTOP</code> , Octave может сгенерировать ошибку сегментации.
zh_cn: 在所有情况下使用 <code>F77_XFCN</code> 都没有太大危害，除了对于运行时间短且执行次数很多的Fortran代码而言，这样做可能会产生开销。但是，如果 <code>F77_FCN</code> 与调用 <code>XSTOP</code> 的代码一起使用，则Octave会生成分段错误。

source: There is often a need to be able to call another Octave function from within an oct-file, and there are many examples of such within Octave itself. For example, the <code>quad</code> function is an oct-file that calculates the definite integral by quadrature over a user-supplied function.
es: A menudo existe la necesidad de poder llamar a otra funci&oacute;n de Octave desde dentro de un archivo oct, y hay muchos ejemplos de este tipo dentro de Octave. Por ejemplo, la funci&oacute;n <code>quad</code> es un archivo oct que calcula la integral definida por cuadratura sobre una funci&oacute;n proporcionada por el usuario.
ru: Часто бывает необходимо иметь возможность вызывать другую функцию Octave из файла octave, и есть много примеров таких функций в самой Octave. Например, функция <code>quad</code> - это файл oct, который вычисляет определенный интеграл по квадратуре по заданной пользователем функции.
zh_cn: 通常需要能够从一个八进制文件中调用另一个Octave函数，并且在Octave本身中有很多这样的示例。例如， <code>quad</code> 函数是一个八进制文件，它通过对用户提供的函数进行正交运算来确定定积分。

source: There is one automatically created variable with a special meaning. The <code>ans</code> variable always contains the result of the last computation, where the output wasn&rsquo;t assigned to any variable. The code <code>a = cos (pi)</code> will assign the value -1 to the variable <code>a</code>, but will not change the value of <code>ans</code>. However, the code <code>cos (pi)</code> will set the value of <code>ans</code> to -1.
zh_cn: 有一个自动创建的具有特殊含义的变量。该 <code>ans</code> 变量总是包含最近一次计算，其中输出没有分配到任何变量的结果。代码 <code>a = cos (pi)</code> 会将值-1分配给变量 <code>a</code> ，但不会更改 <code>ans</code> 的值。但是，代码 <code>cos (pi)</code> 会将 <code>ans</code> 的值设置为-1。

source: There is one built-in variable with a special meaning. The <code>ans</code> variable always contains the result of the last computation, where the output wasn&rsquo;t assigned to any variable. The code <code>a = cos (pi)</code> will assign the value -1 to the variable <code>a</code>, but will not change the value of <code>ans</code>. However, the code <code>cos (pi)</code> will set the value of <code>ans</code> to -1.
es: Hay una variable incorporada con un significado especial. La variable <code>ans</code> siempre contiene el resultado del &uacute;ltimo c&aacute;lculo, donde la salida no se asign&oacute; a ninguna variable. El c&oacute;digo <code>a = cos (pi)</code> asignar&aacute; el valor -1 a la variable <code>a</code> , pero no cambiar&aacute; el valor de <code>ans</code> . Sin embargo, el c&oacute;digo <code>cos (pi)</code> establecer&aacute; el valor de <code>ans</code> en -1.
ru: Есть одна встроенная переменная со специальным значением. <code>ans</code> переменная всегда содержит результат последнего вычисления, где выход не был назначен какой - либо переменной. Код <code>a = cos (pi)</code> присвоит значение -1 переменной <code>a</code> , но не изменит значение <code>ans</code> . Однако код <code>cos (pi)</code> установит значение <code>ans</code> равным -1.
zh_cn: 有一个具有特殊含义的内置变量。该 <code>ans</code> 变量总是包含最近一次计算，其中输出没有分配到任何变量的结果。代码 <code>a = cos (pi)</code> 会将值-1分配给变量 <code>a</code> ，但不会更改 <code>ans</code> 的值。但是，代码 <code>cos (pi)</code> 会将 <code>ans</code> 的值设置为-1。
