Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/octave/octave.*.020.xlf
Languages: es, ru, zh_cn

source: When called with a single input <var>name</var> set the default graphics toolkit to <var>name</var>. If the toolkit is not already loaded, it is initialized by calling the function <code>__init_<var>name</var>__</code>. If the first input is a list of figure handles, <var>hlist</var>, then the graphics toolkit is set to <var>name</var> for these figures only.
es: Cuando se llama con un solo <var>name</var> entrada, configure el conjunto de herramientas de gr&aacute;ficos predeterminado en <var>name</var> . Si el kit de herramientas a&uacute;n no est&aacute; cargado, se inicializa llamando a la funci&oacute;n <code>__init_<var>name</var>__</code> . Si la primera entrada es una lista de identificadores de figuras, <var>hlist</var> , entonces el conjunto de herramientas de gr&aacute;ficos est&aacute; configurado para <var>name</var> solo estas figuras.
