Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/octave/octave.*.020.xlf
Languages: es, ru, zh_cn

source: The typical way to extract a matrix or array from the input arguments of <code>DEFUN_DLD</code> function is as follows
es: La forma t&iacute;pica de extraer una matriz o matriz de los argumentos de entrada de la funci&oacute;n <code>DEFUN_DLD</code> es la siguiente
ru: Типичный способ извлечения матрицы или массива из входных аргументов функции <code>DEFUN_DLD</code> выглядит следующим образом
zh_cn: 从 <code>DEFUN_DLD</code> 函数的输入参数中提取矩阵或数组的典型方法如下

source: The ui* series of functions work best with the <code>qt</code> graphics toolkit, although some functionality is available with the <code>fltk</code> toolkit. There is no support for the <code>gnuplot</code> toolkit.
es: La serie de funciones ui * funciona mejor con el kit de herramientas de gr&aacute;ficos <code>qt</code> , aunque algunas funciones est&aacute;n disponibles con el <code>fltk</code> herramientas fltk . No hay soporte para el kit de herramientas de <code>gnuplot</code> .
ru: Функции серии ui * лучше всего работают с набором графических инструментов <code>qt</code> , хотя некоторые функции доступны с помощью <code>fltk</code> инструментов fltk . Нет поддержки <code>gnuplot</code> toolkit.
zh_cn: ui *系列功能最适合 <code>qt</code> 图形工具包，尽管 <code>fltk</code> 工具包提供了某些功能。 <code>gnuplot</code> 工具包不支持。

source: The underlying Fortran code should use the <code>XSTOPX</code> function to replace the Fortran <code>STOP</code> function. <code>XSTOPX</code> uses the Octave exception handler to treat failing cases in the Fortran code explicitly. Note that Octave supplies its own replacement <small>BLAS</small><code>XERBLA</code> function, which uses <code>XSTOPX</code>.
es: El c&oacute;digo Fortran subyacente debe usar la funci&oacute;n <code>XSTOPX</code> para reemplazar la funci&oacute;n <code>STOP</code> de Fortran . <code>XSTOPX</code> utiliza el controlador de excepciones de Octave para tratar los casos fallidos en el c&oacute;digo Fortran de forma expl&iacute;cita. Tenga en cuenta que Octave proporciona su propia funci&oacute;n <small>BLAS </small> <code>XERBLA</code> de reemplazo , que utiliza <code>XSTOPX</code> .
ru: Базовый код Fortran должен использовать функцию <code>XSTOPX</code> для замены функции Fortran <code>STOP</code> . <code>XSTOPX</code> использует обработчик исключений Octave для явной обработки сбоев в коде Fortran. Обратите внимание, что Octave предоставляет собственную заменяющую функцию <small>BLAS </small> <code>XERBLA</code> , которая использует <code>XSTOPX</code> .
zh_cn: 底层的Fortran代码应使用 <code>XSTOPX</code> 函数替换Fortran <code>STOP</code> 函数。 <code>XSTOPX</code> 使用Octave异常处理程序在Fortran代码中显式处理失败的情况。请注意，Octave提供了自己的替代<small>BLAS </small> <code>XERBLA</code> 函数，该函数使用 <code>XSTOPX</code> 。

source: The unit used to compute the <code>paperposition</code> property. For <code>paperunits</code> set to <code>"pixels"</code>, the conversion between physical units (ex: <code>"inches"</code>) and <code>"pixels"</code> is dependent on the <code>screenpixelsperinch</code> property of the root object.
es: Unidad utilizada para calcular la propiedad de <code>paperposition</code> del papel . Para <code>paperunits</code> configuradas en <code>"pixels"</code> , la conversi&oacute;n entre unidades f&iacute;sicas (por ejemplo: <code>"inches"</code> ) y <code>"pixels"</code> depende de la propiedad <code>screenpixelsperinch</code> del objeto ra&iacute;z.
ru: Единица, используемая для вычисления свойства положения <code>paperposition</code> . Для <code>paperunits</code> установленных в <code>"pixels"</code> , преобразование между физическими единицами (например, <code>"inches"</code> ) и <code>"pixels"</code> зависит от свойства <code>screenpixelsperinch</code> корневого объекта.
zh_cn: 用于计算 <code>paperposition</code> 属性的单位。对于设置为 <code>"pixels"</code> <code>paperunits</code> 单位，物理单位（例如： <code>"inches"</code> ）与 <code>"pixels"</code> 之间的转换取决于根对象的 <code>screenpixelsperinch</code> 属性。

source: The unit used to compute the <code>paperposition</code> property. The conversion from physical units (e.g., <code>"inches"</code>) is dependent on the <code>screenpixelsperinch</code> property of the root object.
zh_cn: 用于计算 <code>paperposition</code> 属性的单位。来自物理单位的转换（例如， <code>"inches"</code> ）取决于根对象的 <code>screenpixelsperinch</code> 属性。

source: The unit used to compute the <code>position</code> and <code>outerposition</code> properties.
es: Unidad utilizada para calcular las propiedades de <code>position</code> y posici&oacute;n <code>outerposition</code> .
ru: Единица, используемая для вычисления свойств <code>position</code> и <code>outerposition</code> .
zh_cn: 用于计算 <code>position</code> 和 <code>outerposition</code> 位置属性的单位。

source: The unscaled covariance matrix, formally equal to the inverse of <var>x&rsquo;</var>*<var>x</var>, but computed in a way minimizing roundoff error propagation.
es: La matriz de covarianza sin escala, formalmente igual a la inversa de <var>x&rsquo;</var> * <var>x</var> , pero calculada de una manera que minimiza la propagaci&oacute;n del error de redondeo.
ru: Немасштабированная ковариационная матрица, формально равная обратной величине <var>x&rsquo;</var> * <var>x</var> , но вычисленная таким образом, чтобы минимизировать распространение ошибки округления.
zh_cn: 未缩放的协方差矩阵，形式上等于 <var>x&rsquo;</var> * <var>x</var> 的逆，但以最小化舍入误差传播的方式进行计算。

source: The unwind_protect Statement
es: La declaración de unwind_protect
ru: Заявление о защите от ветра
zh_cn: unwind_protect声明

source: The upper Cholesky factor <var>R</var> is computed by using the upper triangular part of matrix <var>A</var> and is defined by
es: El factor de Cholesky superior <var>R</var> se calcula utilizando la parte triangular superior de la matriz <var>A</var> y se define por
ru: Верхний фактор Холецкого <var>R</var> вычисляется с использованием верхней треугольной части матрицы <var>A</var> и определяется как
zh_cn: 通过使用矩阵 <var>A</var> 的上三角部分来计算上胆固醇系数 <var>R</var> ，并由下式定义

source: The use of the <code>maybe_compress</code> function should be avoided if possible as it will slow the creation of the matrix.
es: Si es posible, debe evitarse el uso de la funci&oacute;n <code>maybe_compress</code> ya que ralentizar&aacute; la creaci&oacute;n de la matriz.
ru: По возможности следует избегать использования функции <code>maybe_compress</code> поскольку это замедлит создание матрицы.
zh_cn: 如果可能，应避免使用 <code>maybe_compress</code> 函数，因为这会减慢矩阵的创建速度。

source: The user can directly create the sparse matrix within an oct-file.
es: El usuario puede crear directamente la matriz dispersa dentro de un archivo oct.
ru: Пользователь может напрямую создать разреженную матрицу в окта-файле.
zh_cn: 用户可以直接在一个oct-file中创建稀疏矩阵。

source: The user can force the type of the matrix with the <code>matrix_type</code> function. This overcomes the cost of discovering the type of the matrix. However, it should be noted that identifying the type of the matrix incorrectly will lead to unpredictable results, and so <code>matrix_type</code> should be used with care.
es: El usuario puede forzar el tipo de matriz con la funci&oacute;n <code>matrix_type</code> . Esto supera el costo de descubrir el tipo de matriz. Sin embargo, debe tenerse en cuenta que la identificaci&oacute;n incorrecta del tipo de matriz conducir&aacute; a resultados impredecibles, por lo que <code>matrix_type</code> debe usarse con cuidado.
ru: Пользователь может <code>matrix_type</code> тип матрицы с помощью функции matrix_type . Это позволяет избежать затрат на обнаружение типа матрицы. Однако следует отметить, что неправильное определение типа матрицы приведет к непредсказуемым результатам, и поэтому <code>matrix_type</code> следует использовать с осторожностью.
zh_cn: 用户可以使用 <code>matrix_type</code> 函数强制使用矩阵的类型。这克服了发现矩阵类型的成本。但是，应注意，错误地识别矩阵的类型将导致不可预测的结果，因此应谨慎使用 <code>matrix_type</code> 。

source: The user can select points on a plot with the <code>ginput</code> function or select the position at which to place text on the plot with the <code>gtext</code> function using the mouse.
es: El usuario puede seleccionar puntos en un gr&aacute;fico con la funci&oacute;n <code>ginput</code> o seleccionar la posici&oacute;n en la que colocar el texto en el gr&aacute;fico con la funci&oacute;n <code>gtext</code> usando el mouse.
ru: Пользователь может выбирать точки на графике с <code>ginput</code> функции ginput или выбирать позицию, в которую помещать текст на графике с <code>gtext</code> функции gtext с помощью мыши.
zh_cn: 用户可以使用 <code>ginput</code> 函数在图上选择点，或使用 <code>gtext</code> 函数使用鼠标选择在图上放置文本的位置。

source: The user name.
es: El nombre de usuario.
ru: Имя пользователя.
zh_cn: 用户名称。

source: The username of the current user.
es: El nombre de usuario del usuario actual.
ru: Имя пользователя текущего пользователя.
zh_cn: 当前用户的用户名。

source: The uses of <code>get</code> and <code>set</code> are further explained in <a href="graphics-objects#XREFget">get</a>, <a href="graphics-objects#XREFset">set</a>.
es: Los usos de <code>get</code> y <code>set</code> se explican con m&aacute;s detalle en <a href="graphics-objects#XREFget">get</a> , <a href="graphics-objects#XREFset">set</a> .
ru: Использование <code>get</code> и <code>set</code> более подробно описано в <a href="graphics-objects#XREFget">get</a> , <a href="graphics-objects#XREFset">set</a> .
zh_cn: 的使用 <code>get</code> 和 <code>set</code> 中进一步解释<a href="graphics-objects#XREFget">GET</a>，<a href="graphics-objects#XREFset">集</a>。

source: The validity of this formula can easily be checked by expanding the binomial coefficients in both formulas as factorials. It can be derived more directly via the theory of Cauchy matrices. See J. W. Demmel,
es: La validez de esta fórmula puede comprobarse fácilmente ampliando los coeficientes binomiales en ambas fórmulas como factoriales.Se puede derivar más directamente a través de la teoría de las matrices de Cauchy.Véase J.W.Demmel,
ru: Действительность этой формулы можно легко проверить,расширив биномиальные коэффициенты в обеих формулах в виде факториалов.Она может быть получена более непосредственно с помощью теории матриц Коши.См.Дж.В.Деммель,
zh_cn: 将两个公式中的二项式系数扩大为阶乘,可以很容易地检验这个公式的有效性。它可以通过Cauchy矩阵的理论更直接地推导出来。参见J.W.Demmel,

source: The value <var>n</var> must be a real non-negative integer.
es: El valor <var>n</var> debe ser un entero real no negativo.
ru: Значение <var>n</var> должно быть действительным неотрицательным целым числом.
zh_cn: 值 <var>n</var> 必须是一个实数非负整数。

source: The value <var>val</var> may be modified to fit within the range of the new type.
es: El valor <var>val</var> puede modificarse para ajustarse al rango del nuevo tipo.
ru: Значение <var>val</var> можно изменить, чтобы оно соответствовало диапазону нового типа.
zh_cn: 可以将值 <var>val</var> 修改为适合新类型的范围。

source: The value for the <code>papersize</code>, and <code>paperposition</code> properties depends upon <code>paperorientation</code>. The horizontal and vertical values for <code>papersize</code> and <code>paperposition</code> reverse order when <code>paperorientation</code> is switched between <code>"portrait"</code> and <code>"landscape"</code>.
es: El valor para el <code>papersize</code> , y <code>paperposition</code> propiedades depende de <code>paperorientation</code> . Los valores horizontales y verticales para <code>papersize</code> y <code>paperposition</code> orden inverso cuando <code>paperorientation</code> cambia entre <code>"portrait"</code> y <code>"landscape"</code> .
ru: Значение <code>papersize</code> и свойства расположения <code>paperposition</code> зависят от <code>paperorientation</code> . Горизонтальные и вертикальные значения для <code>papersize</code> и <code>paperposition</code> обратном порядке , когда <code>paperorientation</code> переключается между <code>"portrait"</code> и <code>"landscape"</code> .
zh_cn: 对于价值 <code>papersize</code> ，并 <code>paperposition</code> 性能取决于 <code>paperorientation</code> 。用于水平和垂直值 <code>papersize</code> 和 <code>paperposition</code> 相反的顺序时 <code>paperorientation</code> 之间切换 <code>"portrait"</code> 和 <code>"landscape"</code> 。

source: The value must be <code>"non-modal"</code>, <code>"modal"</code>, or <code>"replace"</code>. See above.
es: El valor debe ser <code>"non-modal"</code> , <code>"modal"</code> o <code>"replace"</code> . V&eacute;ase m&aacute;s arriba.
ru: Значение должно быть <code>"non-modal"</code> , <code>"modal"</code> или <code>"replace"</code> . См. Выше.
zh_cn: 该值必须为 <code>"non-modal"</code> ， <code>"modal"</code> 或 <code>"replace"</code> 。往上看。

source: The value must be a single character and the default is <code>" "</code> (a single space). For example:
es: El valor debe ser un solo car&aacute;cter y el valor predeterminado es <code>" "</code> (un solo espacio). Por ejemplo:
ru: Значение должно состоять из одного символа, по умолчанию - <code>" "</code> (один пробел). Например:
zh_cn: 该值必须是单个字符，默认值为 <code>" "</code> （单个空格）。例如：

source: The value of <code>history_control</code> is a colon-separated list of values controlling how commands are saved on the history list. If the list of values includes <code>ignorespace</code>, lines which begin with a space character are not saved in the history list. A value of <code>ignoredups</code> causes lines matching the previous history entry to not be saved. A value of <code>ignoreboth</code> is shorthand for <code>ignorespace</code> and <code>ignoredups</code>. A value of <code>erasedups</code> causes all previous lines matching the current line to be removed from the history list before that line is saved. Any value not in the above list is ignored. If <code>history_control</code> is the empty string, all commands are saved on the history list, subject to the value of <code>history_save</code>.
es: El valor de <code>history_control</code> es una lista de valores separados por dos puntos que controla c&oacute;mo se guardan los comandos en la lista del historial. Si la lista de valores incluye <code>ignorespace</code> , las l&iacute;neas que comienzan con un car&aacute;cter de espacio no se guardan en la lista del historial. Un valor de <code>ignoredups</code> hace que las l&iacute;neas que coincidan con la entrada del historial anterior no se guarden. Un valor de <code>ignoreboth</code> es una abreviatura de <code>ignorespace</code> e <code>ignoredups</code> . Un valor de <code>erasedups</code> hace que todas las l&iacute;neas anteriores que coincidan con la l&iacute;nea actual se eliminen de la lista del historial antes de que se guarde esa l&iacute;nea. Se ignora cualquier valor que no est&eacute; en la lista anterior. Si <code>history_control</code> es la cadena vac&iacute;a, todos los comandos se guardan en la lista del historial, sujeto al valor de <code>history_save</code> .
ru: Значение <code>history_control</code> - это список значений, разделенных двоеточиями, управляющих тем, как команды сохраняются в списке истории. Если список значений включает в себя <code>ignorespace</code> , строки, начинающиеся с символа пробела, не сохраняются в списке истории. Значение <code>ignoredups</code> приводит к тому, что строки, соответствующие предыдущей записи в истории, не сохраняются. Значение <code>ignoreboth</code> является сокращением для <code>ignorespace</code> и <code>ignoredups</code> . Значение <code>erasedups</code> приводит к тому, что все предыдущие строки, соответствующие текущей строке, удаляются из списка истории перед сохранением этой строки. Любое значение, не указанное в приведенном выше списке, игнорируется. Если <code>history_control</code> - пустая строка, все команды сохраняются в списке истории в зависимости от значения <code>history_save</code> .
zh_cn: <code>history_control</code> 的值是一个用冒号分隔的值列表，用于控制如何在历史记录列表中保存命令。如果值列表包含 <code>ignorespace</code> ，则以空格字符开头的行不会保存在历史记录列表中。 <code>ignoredups</code> 的值将导致不保存与上一个历史记录条目匹配的行。 <code>ignoreboth</code> 的值是 <code>ignorespace</code> 和 <code>ignoredups</code> 简写。 <code>erasedups</code> 值的值使与当前行匹配的所有先前行在保存该行之前从历史记录列表中删除。不在上面列表中的任何值都将被忽略。如果 <code>history_control</code> 是空字符串，所有命令均以 <code>history_save</code> 的值保存在历史列表中。

source: The value of <code>nargin</code> is not affected by using this declaration.
es: El valor de <code>nargin</code> no se ve afectado por el uso de esta declaraci&oacute;n.
ru: Использование этого объявления не влияет на значение <code>nargin</code> .
zh_cn: <code>nargin</code> 的值不受使用此声明的影响。

source: The value of <code>octave_core_file_options</code> should follow the same format as the options for the <code>save</code> function. The default value is Octave&rsquo;s binary format.
es: El valor de <code>octave_core_file_options</code> debe seguir el mismo formato que las opciones para la funci&oacute;n de <code>save</code> . El valor predeterminado es el formato binario de Octave.
ru: Значение <code>octave_core_file_options</code> должно соответствовать тому же формату, что и параметры для функции <code>save</code> . Значение по умолчанию - двоичный формат Octave.
zh_cn: <code>octave_core_file_options</code> 的值应采用与 <code>save</code> 功能的选项相同的格式。默认值为八度的二进制格式。

source: The value of <var>c</var> specifies the number of delimiters to prepend to each line of data.
es: El valor de <var>c</var> especifica el n&uacute;mero de delimitadores que se anteponen a cada l&iacute;nea de datos.
ru: Значение <var>c</var> указывает количество разделителей, добавляемых к каждой строке данных.
zh_cn: <var>c</var> 的值指定要在每行数据前加定界符的数量。

source: The value of <var>d</var> is simply the mean of <var>dd</var>.
es: El valor de <var>d</var> es simplemente la media de <var>dd</var> .
ru: Значение <var>d</var> - это просто среднее значение <var>dd</var> .
zh_cn: <var>d</var> 的值只是 <var>dd</var> 的平均值。

source: The value of <var>mode</var> is assumed to be returned from a call to <code>stat</code>.
es: Se supone que el valor de <var>mode</var> se devuelve de una llamada a <code>stat</code> .
ru: Предполагается, что значение <var>mode</var> возвращается из вызова <code>stat</code> .
zh_cn: 假定 <var>mode</var> 的值是从 <code>stat</code> 的调用返回的。

source: The value of <var>nu</var> is the dimension of the span of the Krylov subspace (based on <var>eps1</var>).
es: El valor de <var>nu</var> es la dimensi&oacute;n del intervalo del subespacio de Krylov (basado en <var>eps1</var> ).
ru: Значение <var>nu</var> - это размерность подпространства Крылова (на основе <var>eps1</var> ).
zh_cn: <var>nu</var> 的值是Krylov子空间的跨度尺寸（基于 <var>eps1</var> ）。

source: The value of <var>ok</var> is 1 if the user closed the box with the OK button, otherwise it is 0 and <var>sel</var> is empty.
es: El valor de <var>ok</var> es 1 si el usuario cerr&oacute; el cuadro con el bot&oacute;n OK, de lo contrario es 0 y <var>sel</var> est&aacute; vac&iacute;o.
ru: Значение <var>ok</var> равно 1, если пользователь закрыл окно с помощью кнопки OK, в противном случае - 0 и <var>sel</var> пусто.
zh_cn: 的值 <var>ok</var> 为1，如果用户按OK按钮关闭盒子，否则是0， <var>sel</var> 是空的。

source: The value of <var>path</var> should be a colon-separated list of directories in the format described for <code>path</code>. If no file is found, return an empty character string. For example:
es: El valor de <var>path</var> debe ser una lista de directorios separados por dos puntos en el formato descrito para <code>path</code> . Si no se encuentra ning&uacute;n archivo, devuelva una cadena de caracteres vac&iacute;a. Por ejemplo:
ru: Значение <var>path</var> должно быть разделенным двоеточием списком каталогов в формате, описанном для <code>path</code> . Если файл не найден, верните пустую строку символов. Например:
zh_cn: <var>path</var> 的值应为用冒号分隔的目录列表，格式为 <code>path</code> 所述。如果找不到文件，则返回一个空字符串。例如：

source: The value of <var>r</var> specifies the number of delimiter-only lines to add to the start of the file.
es: El valor de <var>r</var> especifica el n&uacute;mero de l&iacute;neas de solo delimitador que se agregar&aacute;n al inicio del archivo.
ru: Значение <var>r</var> указывает количество строк, содержащих только разделители, которые нужно добавить в начало файла.
zh_cn: <var>r</var> 的值指定要添加到文件开头的仅分隔符的行数。

source: The value of <var>u</var> may be complex. The value of <var>m</var> must be 0 &le; <var>m</var> &le; 1.
es: El valor de <var>u</var> puede ser complejo. El valor de <var>m</var> debe ser 0 &le; <var>m</var> &le; 1.
ru: Значение <var>u</var> может быть комплексным. Значение <var>m</var> должно быть 0 &le; <var>m</var> &le; 1.
zh_cn: <var>u</var> 的值可能很复杂。的值 <var>m</var> 必须是0&le; <var>m</var> &le;1。

source: The value of a persistent variable is kept in memory until it is explicitly cleared. Assuming that the implementation of <code>count_calls</code> is saved on disk, we get the following behavior.
es: El valor de una variable persistente se mantiene en la memoria hasta que se borra expl&iacute;citamente. Suponiendo que la implementaci&oacute;n de <code>count_calls</code> se guarda en el disco, obtenemos el siguiente comportamiento.
ru: Значение постоянной переменной сохраняется в памяти до тех пор, пока не будет явно очищено. Предполагая, что реализация <code>count_calls</code> сохранена на диске, мы получаем следующее поведение.
zh_cn: 持久变量的值将保留在内存中，直到将其明确清除为止。假设 <code>count_calls</code> 的实现保存在磁盘上，我们将得到以下行为。

source: The value of a polynomial represented by the vector <var>c</var> can be evaluated at the point <var>x</var> very easily, as the following example shows:
es: El valor de un polinomio representado por el vector <var>c</var> se puede evaluar en el punto <var>x</var> muy f&aacute;cilmente, como muestra el siguiente ejemplo:
ru: Значение полинома, представленного вектором <var>c</var> , может быть очень легко вычислено в точке <var>x</var> , как показано в следующем примере:
zh_cn: 可以很容易地在点 <var>x</var> 处评估向量 <var>c</var> 表示的多项式的值，如以下示例所示：

source: The value of individual keys can be set with <code>spparms (<var>key</var>, <var>val</var>)</code>. The default values can be restored with the special keyword <code>"default"</code>. The special keyword <code>"tight"</code> can be used to set the mmd solvers to attempt a sparser solution at the potential cost of longer running time.
es: El valor de las claves individuales se puede configurar con <code>spparms (<var>key</var>, <var>val</var>)</code> . Los valores predeterminados se pueden restaurar con la palabra clave especial <code>"default"</code> . La palabra clave especial <code>"tight"</code> se puede utilizar para configurar los solucionadores de mmd para intentar una soluci&oacute;n m&aacute;s dispersa con el coste potencial de un mayor tiempo de ejecuci&oacute;n.
ru: Значение отдельных ключей можно установить с помощью <code>spparms (<var>key</var>, <var>val</var>)</code> . Значения по умолчанию можно восстановить с помощью специального ключевого слова <code>"default"</code> . Специальное ключевое слово <code>"tight"</code> можно использовать для настройки решателей mmd на попытку решения с более разреженными данными с потенциальной ценой более длительного времени работы.
zh_cn: 各个键的值可以使用 <code>spparms (<var>key</var>, <var>val</var>)</code> 。可以使用特殊关键字 <code>"default"</code> 恢复默认值。特殊关键字 <code>"tight"</code> 可用于设置mmd求解器，以花费更长的运行时间来尝试稀疏解决方案。

source: The value of this property can then be retrieved as a string by a Java object or in Octave:
es: El valor de esta propiedad puede ser recuperado como una cadena por un objeto de Java o en Octava:
ru: Значение этого свойства может быть получено в виде строки по объекту Java или в октаве:
zh_cn: 此属性的值可以作为一个字符串被Java对象或Octave检索。

source: The value returned in <var>info</var> may be one of the following:
es: El valor devuelto en <var>info</var> puede ser uno de los siguientes:
ru: Значение, возвращаемое в <var>info</var> , может быть одним из следующих:
zh_cn: <var>info</var> 中返回的值可能是以下之一：

source: The value where the base of the area plot is drawn.
es: El valor donde se dibuja la base del área.
ru: Значение,на котором нарисована основа участка.
zh_cn: 绘制区域图的基点所在的数值。
