Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/octave/octave.*.020.xlf
Languages: es, ru, zh_cn

source: Upload the local file <var>file</var> into the current remote directory on the FTP connection <var>f</var>.
es: Sube el archivo local <var>file</var> en el directorio remoto actual sobre la conexi&oacute;n FTP <var>f</var> .
ru: Загрузить локальный файл <var>file</var> в текущий удаленный каталог на FTP соединение <var>f</var> .
zh_cn: 将本地文件 <var>file</var> 到FTP连接上的当前远程目录 <var>f</var> 。

source: Upper limit of the objective function. If the objective function reaches this limit and continues increasing, the solver stops the search. This parameter is used in the dual simplex only.
es: Límite superior de la función objetivo.Si la función objetivo alcanza este límite y continúa aumentando,el solucionador detiene la búsqueda.Este parámetro se utiliza sólo en el doble simplex.
ru: Верхний предел объективной функции.Если объективная функция достигает этого предела и продолжает увеличиваться,решающее устройство останавливает поиск.Этот параметр используется только в двойном симплексе.
zh_cn: 目标函数的上限。如果目标函数达到这个极限并继续增加,求解器将停止搜索。此参数仅用于双单工况。

source: Upper triangular. If the optional third argument <var>perm</var> is given, the matrix is assumed to be a permuted upper triangular with the permutations defined by the vector <var>perm</var>.
es: Triangular superior. Si se da el tercer argumento opcional <var>perm</var> anente , se supone que la matriz es un triangular superior permutado con las permutaciones definidas por el vector <var>perm</var> anente .
ru: Верхний треугольный. Если указан необязательный третий аргумент <var>perm</var> , матрица считается переставленным верхним треугольником с перестановками, определенными вектором <var>perm</var> .
zh_cn: 上三角。如果给出了可选的第三个参数 <var>perm</var> ，则假定矩阵为一个置换的上三角，其置换由向量 <var>perm</var> 定义。

source: Uppercase the character following the cursor (or the beginning of the next word if the cursor is between words), moving the cursor to the end of the word.
es: Poner en mayúsculas el carácter que sigue al cursor (o el comienzo de la siguiente palabra si el cursor está entre palabras),moviendo el cursor al final de la palabra.
ru: Пролистайте символ,следующий за курсором (или начало следующего слова,если курсор находится между словами),перемещая курсор в конец слова.
zh_cn: 将光标后面的字符大写(如果光标在两个字之间,则是下一个字的开头),将光标移到字的末尾。

source: Uppercase the characters following the cursor to the end of the current (or following) word, moving the cursor to the end of the word.
es: Poner en mayúsculas los caracteres que siguen al cursor hasta el final de la palabra actual (o siguiente),moviendo el cursor hasta el final de la palabra.
ru: Произнесите прописные буквы,следующие за курсором в конец текущего (или следующего)слова,перемещая курсор в конец слова.
zh_cn: 将光标后面的字符大写,将光标移动到当前(或后面)字的末尾。

source: Use &lsquo;
es: Utilizar '
ru: Используйте '
zh_cn: 用 '

source: Use &lt;char&gt; as the path separation character. This option can help when running Octave on non-Unix systems.
es: Utilice &lt;char&gt; como car&aacute;cter de separaci&oacute;n de ruta. Esta opci&oacute;n puede ayudar cuando se ejecuta Octave en sistemas que no son Unix.
ru: Используйте &lt;char&gt; в качестве символа разделения пути. Эта опция может помочь при запуске Octave в системах, отличных от Unix.
zh_cn: 使用&lt;char&gt;作为路径分隔字符。在非Unix系统上运行Octave时，此选项可以提供帮助。

source: Use 12-hour time format
es: Usar el formato de tiempo de 12 horas
ru: Использовать 12-часовой формат времени
zh_cn: 使用12小时时间格式

source: Use <code>cellfun</code> intelligently. The <code>cellfun</code> function is a useful tool for avoiding loops. It is often used with anonymous function handles; however, calling an anonymous function involves an overhead quite comparable to the overhead of an m-file function. Passing a handle to a built-in function is faster, because the interpreter is not involved in the internal loop. For example:
es: Utilice <code>cellfun</code> de forma inteligente. La funci&oacute;n <code>cellfun</code> es una herramienta &uacute;til para evitar bucles. A menudo se utiliza con identificadores de funciones an&oacute;nimos; sin embargo, llamar a una funci&oacute;n an&oacute;nima implica una sobrecarga bastante comparable a la sobrecarga de una funci&oacute;n de archivo m. Pasar un identificador a una funci&oacute;n incorporada es m&aacute;s r&aacute;pido, porque el int&eacute;rprete no est&aacute; involucrado en el ciclo interno. Por ejemplo:
ru: Используйте приложение <code>cellfun</code> умом. Функция <code>cellfun</code> - полезный инструмент для предотвращения циклов. Часто используется с указателями анонимных функций; однако вызов анонимной функции связан с накладными расходами, вполне сопоставимыми с накладными расходами функции m-файла. Передача дескриптора встроенной функции выполняется быстрее, поскольку интерпретатор не участвует во внутреннем цикле. Например:
zh_cn: 聪明地使用 <code>cellfun</code> 。该 <code>cellfun</code> 功能是避免环路的有用工具。它通常与匿名函数句柄一起使用。但是，调用匿名函数所产生的开销与m文件函数所产生的开销相当。将句柄传递给内置函数的速度更快，因为解释器不参与内部循环。例如：

source: Use <code>ignore_function_time_stamp</code> when appropriate. If you are calling lots of functions, and none of them will need to change during your run, set the variable <code>ignore_function_time_stamp</code> to <code>"all"</code>. This will stop Octave from checking the time stamp of a function file to see if it has been updated while the program is being run.
es: Utilice <code>ignore_function_time_stamp</code> cuando sea apropiado. Si est&aacute; llamando a muchas funciones, y ninguna de ellas tendr&aacute; que cambiar durante su ejecuci&oacute;n, establezca la variable <code>ignore_function_time_stamp</code> en <code>"all"</code> . Esto evitar&aacute; que Octave verifique la marca de tiempo de un archivo de funci&oacute;n para ver si se ha actualizado mientras se ejecuta el programa.
ru: При <code>ignore_function_time_stamp</code> используйте ignore_function_time_stamp . Если вы вызываете множество функций, и ни одна из них не должна изменяться во время выполнения, установите для переменной <code>ignore_function_time_stamp</code> значение <code>"all"</code> . Это остановит Octave от проверки метки времени файла функции, чтобы увидеть, обновлялся ли он во время выполнения программы.
zh_cn: 适当时使用 <code>ignore_function_time_stamp</code> 。如果您要调用许多函数，并且在运行期间无需更改任何函数，请将变量 <code>ignore_function_time_stamp</code> 设置为 <code>"all"</code> 。这将使Octave停止检查功能文件的时间戳，以查看程序运行时是否已对其进行更新。

source: Use <code>pdfcrop</code> if you don&rsquo;t want the surrounding page.
zh_cn: 如果您不需要周围的页面，请使用 <code>pdfcrop</code> 。

source: Use <var>fontname</var> and/or <var>fontsize</var> for all text. <var>fontname</var> is ignored for some devices: dxf, fig, hpgl, etc.
es: Utilice <var>fontname</var> y / o <var>fontsize</var> para todo el texto. <var>fontname</var> se ignora para algunos dispositivos: dxf, fig, hpgl, etc.
ru: Используйте имя <var>fontname</var> и / или <var>fontsize</var> для всего текста. <var>fontname</var> игнорируется для некоторых устройств: dxf, fig, hpgl и т. д.
zh_cn: 使用 <var>fontname</var> 和/或 <var>fontsize</var> 所有文本。 <var>fontname</var> 被用于某些设备忽略：DXF，无花果，HPGL等

source: Use <var>fontname</var> and/or <var>fontsize</var> for all text. <var>fontname</var> is ignored for some devices: fig, etc.
zh_cn: 对所有文本使用 <var>fontname</var> 和/或 <var>fontsize</var> 。对于某些设备， <var>fontname</var> 被忽略：无花果等。

source: Use BDF formulas in implicit multistep methods. <em>Note</em>: This option is not yet implemented.
es: Utilice f&oacute;rmulas BDF en m&eacute;todos impl&iacute;citos de varios pasos. <em>Nota</em> : esta opci&oacute;n a&uacute;n no est&aacute; implementada.
ru: Используйте формулы BDF в неявных многошаговых методах. <em>Примечание</em> : эта опция еще не реализована.
zh_cn: 在隐式多步方法中使用BDF公式。<em>注意</em>：此选项尚未实现。

source: Use a lowercase &lsquo;
zh_cn: 使用小写的&ldquo;

source: Use an uppercase &lsquo;
zh_cn: 使用大写的'

source: Use built-in and library functions if possible. Built-in and compiled functions are very fast. Even with an m-file library function, chances are good that it is already optimized, or will be optimized more in a future release.
es: Utilice las funciones incorporadas y de biblioteca si es posible.Las funciones incorporadas y compiladas son muy rápidas.Incluso con una función de biblioteca de archivos m,es muy probable que ya esté optimizada,o que se optimice más en una futura versión.
ru: По возможности используйте встроенные и библиотечные функции.Встроенные и скомпилированные функции очень быстры.Даже с функцией библиотеки m-файлов есть шанс,что она уже оптимизирована,или будет оптимизирована больше в будущем релизе.
zh_cn: 尽可能使用内置和库函数。内置函数和编译函数的速度非常快。即使是m-file库函数,也很有可能已经被优化了,或者在未来的版本中会有更多的优化。

source: Use dash-dotted lines.
es: Usa las líneas de puntos.
ru: Используйте пунктирные линии.
zh_cn: 使用破折号线。

source: Use dashed lines.
es: Usa las líneas discontinuas.
ru: Используйте пунктирные линии.
zh_cn: 使用虚线。

source: Use dotted lines.
es: Usa las líneas punteadas.
ru: Используйте пунктирные линии.
zh_cn: 使用虚线。

source: Use either <code>dbcont</code> or <code>return</code> to leave the debug mode and continue the normal execution of the script.
es: Utilice <code>dbcont</code> o <code>return</code> para salir del modo de depuraci&oacute;n y continuar con la ejecuci&oacute;n normal del script.
ru: Используйте либо <code>dbcont</code> , либо <code>return</code> , чтобы выйти из режима отладки и продолжить нормальное выполнение скрипта.
zh_cn: 使用 <code>dbcont</code> 或 <code>return</code> 可以退出调试模式并继续正常执行脚本。

source: Use elementwise vector operators whenever possible to avoid looping (operators like <code>.*</code> and <code>.^</code>). See <a href="arithmetic-ops#Arithmetic-Ops">Arithmetic Ops</a>.
zh_cn: 尽可能使用元素向量运算符以避免循环（如 <code>.*</code> 和 <code>.^</code> 运算符）。参见<a href="arithmetic-ops#Arithmetic-Ops">算术运算</a>。

source: Use elementwise vector operators whenever possible to avoid looping (operators like <code>.*</code> and <code>.^</code>). See <a href="arithmetic-ops#Arithmetic-Ops">Arithmetic Ops</a>. For simple inline functions, the <code>vectorize</code> function can do this automatically.
es: Utilizar operadores vector elementwise siempre que sea posible para evitar un bucle (operadores como <code>.*</code> E <code>.^</code> ). Consulte <a href="arithmetic-ops#Arithmetic-Ops">Operaciones aritm&eacute;ticas</a> . Para funciones en l&iacute;nea simples, la funci&oacute;n <code>vectorize</code> puede hacer esto autom&aacute;ticamente.
ru: Используйте поэлементно векторные операторы всякий раз , когда это возможно , чтобы избежать зацикливания (операторы , такие как <code>.*</code> И <code>.^</code> ). См. <a href="arithmetic-ops#Arithmetic-Ops">Арифметические операции</a> . Для простых встроенных функций функция <code>vectorize</code> может делать это автоматически.
zh_cn: 尽可能使用元素向量运算符来避免循环（如 <code>.*</code> 和 <code>.^</code> 运算符）。参见<a href="arithmetic-ops#Arithmetic-Ops">算术运算</a>。对于简单的内联函数， <code>vectorize</code> 功能可以自动执行此操作。

source: Use of the <code>interpreter</code> Property
es: Uso de la propiedad del <code>interpreter</code>
ru: Использование свойства <code>interpreter</code>
zh_cn: 在使用 <code>interpreter</code> 房产

source: Use of the interpreter Property
es: Uso del intérprete Propiedad
ru: Использование собственности переводчика
zh_cn: 解释器的使用属性

source: Use only the lower triangle of <var>A</var> and return a lower triangular factor <var>L</var> such that <code>L*L'</code> approximates <var>A</var>.
es: Utilice &uacute;nicamente el tri&aacute;ngulo inferior de <var>A</var> y devolver un factor triangular inferior <var>L</var> tal que <code>L*L'</code> se aproxima a <var>A</var> .
ru: Используйте только нижний треугольник <var>A</var> и возвращает нижнюю треугольную фактор <var>L</var> такой , что <code>L*L'</code> аппроксимирует <var>A</var> .
zh_cn: 仅使用较低的三角 <var>A</var> ，并返回一个下三角因子 <var>L</var> 使得 <code>L*L'</code> 近似于 <var>A</var> 。

source: Use only the upper triangle of <var>A</var> and return an upper triangular factor <var>U</var> such that <code>U'*U</code> approximates <var>A</var>.
es: Utilice &uacute;nicamente el tri&aacute;ngulo superior de <var>A</var> y devolver un factor triangular superior <var>U</var> tal que <code>U'*U</code> se aproxima a <var>A</var> .
ru: Используйте только верхний треугольник <var>A</var> и возвращает верхний треугольный фактор <var>U</var> такая , что <code>U'*U</code> аппроксимирует <var>A</var> .
zh_cn: 仅使用的上三角 <var>A</var> ，并返回一个上三角因子 <var>U</var> 使得 <code>U'*U</code> 近似 <var>A</var> 。

source: Use smoothing techniques to reduce the appearance of jagged lines.
es: Usar técnicas de alisado para reducir la apariencia de las líneas dentadas.
ru: Используйте методы сглаживания,чтобы уменьшить появление зазубрин.
zh_cn: 使用平滑技术来减少锯齿状线条的出现。

source: Use solid lines (default).
es: Usar líneas sólidas (por defecto).
ru: Используйте сплошные линии (по умолчанию).
zh_cn: 使用实线(默认)。

source: Use stiff backward differentiation formula (BDF) method. If a function to compute the Jacobian is not supplied, <code>lsode</code> will compute a finite difference approximation of the Jacobian matrix.
es: Utilice el m&eacute;todo de f&oacute;rmula de diferenciaci&oacute;n hacia atr&aacute;s r&iacute;gida (BDF). Si no se proporciona una funci&oacute;n para calcular el jacobiano, <code>lsode</code> calcular&aacute; una aproximaci&oacute;n en diferencias finitas de la matriz jacobiana.
ru: Используйте метод жесткой обратной формулы дифференцирования (BDF). Если функция для вычисления якобиана не предоставлена, <code>lsode</code> вычислит конечно-разностную аппроксимацию матрицы якобиана.
zh_cn: 使用刚性后向微分公式（BDF）方法。如果未提供用于计算雅可比 <code>lsode</code> 函数，则lsode将计算雅可比行列矩阵的有限差分近似值。

source: Use the <code>"string"</code> property to change the text string. The line and the arrowhead can be customized as for arrow annotations, and the text can be customized using the same properties as <code>text</code> graphics objects. Note, however, that some text property names are prefixed with "text" to distinguish them from arrow properties: <code>"textbackgroundcolor"</code>, <code>"textcolor"</code>, <code>"textedgecolor"</code>, <code>"textlinewidth"</code>, <code>"textmargin"</code>, <code>"textrotation"</code>.
es: Utilice la propiedad <code>"string"</code> para cambiar la cadena de texto. La l&iacute;nea y la punta de flecha se pueden personalizar como para las anotaciones de flecha, y el texto se puede personalizar utilizando las mismas propiedades que los objetos gr&aacute;ficos de <code>text</code> o . Sin embargo, <code>"textbackgroundcolor"</code> cuenta que algunos nombres de propiedades de texto tienen el prefijo "text" para distinguirlos de las propiedades de flecha: "textbackgroundcolor" , <code>"textcolor"</code> , <code>"textedgecolor"</code> , <code>"textlinewidth"</code> , <code>"textmargin"</code> , <code>"textrotation"</code> .
ru: Используйте свойство <code>"string"</code> чтобы изменить текстовую строку. Линию и стрелку можно настроить так же, как для аннотаций со стрелками, а текст можно настроить, используя те же свойства, что и <code>text</code> графические объекты. Обратите внимание, однако, что имена некоторых текстовых свойств имеют префикс &laquo;text&raquo;, чтобы отличать их от свойств стрелки: <code>"textbackgroundcolor"</code> , <code>"textcolor"</code> , <code>"textedgecolor"</code> , <code>"textlinewidth"</code> , <code>"textmargin"</code> , <code>"textrotation"</code> .
zh_cn: 使用 <code>"string"</code> 属性更改文本字符串。可以像箭头注解一样自定义线条和箭头，并可以使用与 <code>text</code> 图形对象相同的属性来自定义文本。但是请注意，某些文本属性名称以&ldquo; text&rdquo;开头，以与箭头属性区分开： <code>"textbackgroundcolor"</code> ， <code>"textcolor"</code> ， <code>"textedgecolor"</code> ， <code>"textlinewidth"</code> ， <code>"textmargin"</code> ， <code>"textrotation"</code> 。

source: Use the <code>"string"</code> property to change the text string. You may use <code>"backgroundcolor"</code>, <code>"edgecolor"</code>, <code>"linestyle"</code>, and <code>"linewidth"</code> properties to customize the box background color and edge appearance. A limited set of <code>text</code> objects properties are also available; Besides <code>"font&hellip;"</code> properties, you may also use <code>"horizontalalignment"</code> and <code>"verticalalignment"</code> to position the text inside the box.
es: Utilice la propiedad <code>"string"</code> para cambiar la cadena de texto. Puede utilizar las propiedades <code>"backgroundcolor"</code> , <code>"edgecolor"</code> , <code>"linestyle"</code> y <code>"linewidth"</code> para personalizar el color de fondo del cuadro y la apariencia del borde. Tambi&eacute;n est&aacute; disponible un conjunto limitado de propiedades de objetos de <code>text</code> o ; Adem&aacute;s de las propiedades de <code>"font&hellip;"</code> , tambi&eacute;n puede utilizar <code>"horizontalalignment"</code> y <code>"verticalalignment"</code> para colocar el texto dentro del cuadro.
ru: Используйте свойство <code>"string"</code> чтобы изменить текстовую строку. Вы можете использовать свойства <code>"backgroundcolor"</code> , <code>"edgecolor"</code> , <code>"linestyle"</code> и <code>"linewidth"</code> для настройки цвета фона блока и внешнего вида краев. Также доступен ограниченный набор свойств <code>text</code> объектов; Помимо свойств <code>"font&hellip;"</code> , вы также можете использовать <code>"horizontalalignment"</code> и <code>"verticalalignment"</code> для размещения текста внутри поля.
zh_cn: 使用 <code>"string"</code> 属性更改文本字符串。您可以使用 <code>"backgroundcolor"</code> ， <code>"edgecolor"</code> ， <code>"linestyle"</code> 和 <code>"linewidth"</code> 属性自定义框的背景色和边缘的外观。还提供了一组有限的 <code>text</code> 对象属性。除了 <code>"font&hellip;"</code> 属性外，您还可以使用 <code>"horizontalalignment"</code> 对齐&rdquo;和 <code>"verticalalignment"</code> 对齐&rdquo;将文本放置在框中。

source: Use the <code>fftw</code> function to generate and save wisdom. Using the utilities provided together with the <small>FFTW</small> libraries (<code>fftw-wisdom</code> on Unix systems), you can even add wisdom generated by Octave to the system-wide wisdom file.
es: Utilice la funci&oacute;n <code>fftw</code> para generar y guardar sabidur&iacute;a. Utilizando las utilidades proporcionadas junto con las bibliotecas <small>FFTW</small> ( <code>fftw-wisdom</code> en sistemas Unix), puede incluso agregar sabidur&iacute;a generada por Octave al archivo de sabidur&iacute;a de todo el sistema.
ru: Используйте функцию <code>fftw</code> , чтобы генерировать и сохранять мудрость. Используя утилиты, поставляемые вместе с библиотеками <small>FFTW</small> ( <code>fftw-wisdom</code> в системах Unix), вы даже можете добавить мудрость, сгенерированную Octave, в общесистемный файл мудрости.
zh_cn: 使用 <code>fftw</code> 函数生成并保存智慧。使用与<small>FFTW</small>库一起提供的<small>实用</small>程序（在Unix系统上为<small>fftw </small> <code>fftw-wisdom</code> <small>wisdom</small>），您甚至可以将Octave生成的智慧添加到系统范围的智慧文件中。

source: Use the Cholesky factorization of B. (default if <var>A</var> is symmetric (Hermitian) and <var>B</var> is symmetric (Hermitian) positive definite)
es: Utilice la factorizaci&oacute;n Cholesky de B. (predeterminado si <var>A</var> es sim&eacute;trico (hermitiano) y <var>B</var> es sim&eacute;trico (hermitiano) positivo definido)
ru: Используйте факторизацию Холецкого B. (по умолчанию, если <var>A</var> симметрично (эрмитово), а <var>B</var> симметрично (эрмитово) положительно определено)
zh_cn: 使用B的Cholesky分解。（如果 <var>A</var> 是对称的（赫米特式）且 <var>B</var> 是对称的（赫米特式）正定值，则为默认设置）

source: Use the QZ algorithm. (used whenever <var>A</var> or <var>B</var> are not symmetric)
es: Utilice el algoritmo QZ. (usado siempre que <var>A</var> o <var>B</var> no sean sim&eacute;tricos)
ru: Используйте алгоритм QZ. (используется, когда <var>A</var> или <var>B</var> не симметричны)
zh_cn: 使用QZ算法。（在 <var>A</var> 或 <var>B</var> 不对称时使用）

source: Use the gzip algorithm to compress the file. This works on files that are compressed with gzip outside of Octave, and gzip can also be used to convert the files for backward compatibility. This option is only available if Octave was built with a link to the zlib libraries.
es: Usa el algoritmo gzip para comprimir el archivo.Esto funciona en archivos que están comprimidos con gzip fuera de Octava,y gzip también puede usarse para convertir los archivos para que sean compatibles con los anteriores.Esta opción sólo está disponible si Octave se construyó con un enlace a las bibliotecas zlib.
ru: Используйте алгоритм gzip для сжатия файла.Это работает на файлах,сжатых с помощью gzip за пределами Октавы,и gzip также может быть использован для преобразования файлов для обратной совместимости.Эта опция доступна только в том случае,если Октава была построена со ссылкой на библиотеки zlib.
zh_cn: 使用gzip算法来压缩文件。这适用于在Octave之外使用gzip压缩的文件,gzip也可以用来转换文件以实现向后兼容。只有当Octave在构建时带有zlib库的链接时,这个选项才可用。

source: Use the included <small>FFTPACK</small> library for computing Fast Fourier Transforms instead of the <small>FFTW3</small> library when operating on single precision (float) values.
es: Utilice la biblioteca <small>FFTPACK</small> incluida para calcular las transformadas r&aacute;pidas de Fourier en lugar de la biblioteca <small>FFTW3</small> cuando opere con valores de precisi&oacute;n simple (flotante).
ru: Используйте <small>прилагаемую</small> библиотеку <small>FFTPACK</small> для вычисления быстрых преобразований Фурье вместо библиотеки <small>FFTW3</small> при работе со значениями одинарной точности (с плавающей запятой).
zh_cn: 使用附带的<small>FFTPACK</small>用于计算快速傅立叶变换，而不是库<small>FFTW3</small>上单精度（浮点）的值操作时库。

source: Use the included <small>FFTPACK</small> library for computing Fast Fourier Transforms instead of the <small>FFTW3</small> library.
es: Utilice la biblioteca <small>FFTPACK</small> incluida para calcular transformadas r&aacute;pidas de Fourier en lugar de la biblioteca <small>FFTW3</small> .
ru: Используйте <small>прилагаемую</small> библиотеку <small>FFTPACK</small> для вычисления быстрых преобразований Фурье вместо библиотеки <small>FFTW3</small> .
zh_cn: 使用附带的<small>FFTPACK</small>计算快速傅立叶变换，而不是库<small>FFTW3</small>库。

source: Use the package name <var>package</var> or Octave to limit the listing to a desired component.
es: Utilice el nombre del <var>package</var> u Octave para limitar la lista a un componente deseado.
ru: Используйте имя <var>package</var> или Octave, чтобы ограничить список желаемым компонентом.
zh_cn: 使用包名称 <var>package</var> 或Octave将列表限制为所需的组件。

source: Use the package name <var>package</var> or Octave to query a specific component.
zh_cn: 使用包名称 <var>package</var> 或Octave来查询特定组件。

source: Use the readline library to provide for editing of the command line in terminal environments. This option is on by default.
es: Utilice la biblioteca de línea de lectura para proporcionar la edición de la línea de comandos en entornos terminales.Esta opción está activada por defecto.
ru: Используйте библиотеку readline,чтобы обеспечить редактирование командной строки в терминальных средах.Эта опция включена по умолчанию.
zh_cn: 使用readline库提供在终端环境下编辑命令行的功能。该选项默认为开启。

source: Use two-phase dual simplex, and if it fails, switch to the primal simplex.
es: Use el doble simplex bifásico,y si falla,cambie al simplex primario.
ru: Используйте двухфазный двойной симплекс,и в случае неудачи переключитесь на первобытный симплекс.
zh_cn: 使用两相双简,如果失败,就换成原始简。

source: Use two-phase dual simplex.
es: Usa el doble simplex de dos fases.
ru: Используйте двухфазный двойной симплекс.
zh_cn: 采用两相双简式。

source: Use two-phase primal simplex.
es: Usar el simplex primitivo de dos fases.
ru: Используйте двухфазный первобытный симплекс.
zh_cn: 使用两相质朴。

source: User ID of file&rsquo;s owner.
es: ID de usuario del propietario del archivo.
ru: ID пользователя владельца файла.
zh_cn: 文件所有者的用户标识。

source: User-Defined Preferences
es: Preferencias definidas por el usuario
ru: Определяемые пользователем предпочтения
zh_cn: 用户自定义首选项
