Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/octave/octave.*.020.xlf
Languages: es, ru, zh_cn

source: To clear the current figure, call the <code>clf</code> function. To clear the current axis, call the <code>cla</code> function. To bring the current figure to the top of the window stack, call the <code>shg</code> function. To delete a graphics object, call <code>delete</code> on its index. To close the figure window, call the <code>close</code> function.
es: Para borrar la cifra actual, llame a la funci&oacute;n <code>clf</code> . Para borrar el eje actual, llame a la funci&oacute;n <code>cla</code> . Para llevar la figura actual a la parte superior de la pila de ventanas, llame a la funci&oacute;n <code>shg</code> . Para eliminar un objeto gr&aacute;fico, llame a <code>delete</code> en su &iacute;ndice. Para cerrar la ventana de la figura, llame a la funci&oacute;n de <code>close</code> .
ru: Чтобы очистить текущий рисунок, вызовите функцию <code>clf</code> . Чтобы очистить текущую ось, вызовите функцию <code>cla</code> . Чтобы вывести текущую фигуру на вершину стека окон, вызовите функцию <code>shg</code> . Чтобы удалить графический объект, вызовите <code>delete</code> для его индекса. Чтобы закрыть окно рисунка, вызовите функцию <code>close</code> .
zh_cn: 要清除当前图形，请调用 <code>clf</code> 函数。要清除当前轴，请调用 <code>cla</code> 函数。要将当前图形置于窗口堆栈的顶部，请调用 <code>shg</code> 函数。要删除图形对象，请在其索引上调用 <code>delete</code> 。要关闭图形窗口，请调用 <code>close</code> 功能。

source: To compile Octave, you will need a recent version of <code>g++</code> or other ANSI C++ compiler. In addition, you will need a Fortran 77 compiler or <code>f2c</code>. If you use <code>f2c</code>, you will need a script like <code>fort77</code> that works like a normal Fortran compiler by combining <code>f2c</code> with your C compiler in a single script.
es: Para compilar Octave, necesitar&aacute; una versi&oacute;n reciente de <code>g++</code> u otro compilador ANSI C ++. Adem&aacute;s, necesitar&aacute; un compilador de Fortran 77 o <code>f2c</code> . Si usa <code>f2c</code> , necesitar&aacute; un script como <code>fort77</code> que funcione como un compilador Fortran normal al combinar <code>f2c</code> con su compilador C en un solo script.
ru: Для компиляции Octave вам понадобится последняя версия <code>g++</code> или другого компилятора ANSI C ++. Кроме того, вам понадобится компилятор Fortran 77 или <code>f2c</code> . Если вы используете <code>f2c</code> , вам понадобится сценарий типа <code>fort77</code> , который работает как обычный компилятор Fortran, объединив <code>f2c</code> с вашим компилятором C в одном сценарии.
zh_cn: 要编译Octave，您将需要最新版本的 <code>g++</code> 或其他ANSI C ++编译器。另外，您将需要Fortran 77编译器或 <code>f2c</code> 。如果使用 <code>f2c</code> ，则需要一个像 <code>fort77</code> 这样的脚本，它可以通过将 <code>f2c</code> 与C编译器合并在一个脚本中来像普通的Fortran编译器一样工作。

source: To compute the matrix exponential, see <a href="linear-algebra#Linear-Algebra">Linear Algebra</a>.
es: Para calcular la matriz exponencial, consulte <a href="linear-algebra#Linear-Algebra">&Aacute;lgebra lineal</a> .
ru: Чтобы вычислить экспоненту матрицы, см. <a href="linear-algebra#Linear-Algebra">Линейная алгебра</a> .
zh_cn: 要计算矩阵指数，请参见<a href="linear-algebra#Linear-Algebra">线性代数</a>。

source: To compute the matrix logarithm, see <a href="linear-algebra#Linear-Algebra">Linear Algebra</a>.
es: Para calcular el logaritmo de la matriz, consulte <a href="linear-algebra#Linear-Algebra">&Aacute;lgebra lineal</a> .
ru: Чтобы вычислить матричный логарифм, см. <a href="linear-algebra#Linear-Algebra">Линейная алгебра</a> .
zh_cn: 要计算矩阵对数，请参阅<a href="linear-algebra#Linear-Algebra">线性代数</a>。

source: To compute the matrix square root, see <a href="linear-algebra#Linear-Algebra">Linear Algebra</a>.
es: Para calcular la ra&iacute;z cuadrada de la matriz, consulte <a href="linear-algebra#Linear-Algebra">&Aacute;lgebra lineal</a> .
ru: Чтобы вычислить квадратный корень из матрицы, см. <a href="linear-algebra#Linear-Algebra">Раздел Линейная алгебра</a> .
zh_cn: 要计算矩阵平方根，请参见<a href="linear-algebra#Linear-Algebra">线性代数</a>。

source: To compute the pseudo-random sequence, <code>rand</code> uses the Mersenne Twister with a period of <em>2^{19937}-1</em> (See M. Matsumoto and T. Nishimura,
es: Para calcular la secuencia pseudoaleatoria, <code>rand</code> usa el Mersenne Twister con un per&iacute;odo de <em>2 ^ {19937} -1</em> (Ver M. Matsumoto y T. Nishimura,
ru: Для вычисления псевдослучайной последовательности <code>rand</code> использует Twister Мерсенна с периодом <em>2 ^ {19937} -1</em> (см. М. Мацумото и Т. Нишимура,
zh_cn: 为了计算伪随机序列， <code>rand</code> 使用了周期为<em>2 ^ {19937} -1</em>的梅森扭曲器（请参阅M. Matsumoto和T. Nishimura，

source: To control the grid lines for an individual axes use the <code>set</code> function. For example:
es: Para controlar las l&iacute;neas de la cuadr&iacute;cula para un eje individual, use la funci&oacute;n <code>set</code> . Por ejemplo:
ru: Для управления линиями сетки для отдельных осей используйте функцию <code>set</code> . Например:
zh_cn: 要控制单个轴的网格线，请使用 <code>set</code> 功能。例如：

source: To convert back from a cellstr to a character array use <code>char</code>.
es: Para volver a convertir de una cadena de celdas a una matriz de caracteres, use <code>char</code> .
ru: Для обратного преобразования cellstr в массив символов используйте <code>char</code> .
zh_cn: 要从cellstr转换回字符数组，请使用 <code>char</code> 。

source: To correct this behavior would mean that zero elements with a negative sign-bit would need to be stored in the matrix to ensure that their sign-bit was respected. This is not done at this time, for reasons of efficiency, and so the user is warned that calculations where the sign-bit of zero is important must not be done using sparse matrices.
es: Corregir este comportamiento significaría que los elementos cero con un signo-bit negativo tendrían que ser almacenados en la matriz para asegurar que su signo-bit fuera respetado.Esto no se hace en este momento,por razones de eficiencia,por lo que se advierte al usuario que los cálculos en los que el signo-bit de cero es importante no deben hacerse utilizando matrices dispersas.
ru: Исправление такого поведения означало бы,что нулевые элементы с отрицательным знаковым разрядом должны были бы храниться в матрице,чтобы обеспечить соблюдение их знакового разряда.В настоящее время это не делается из соображений эффективности,поэтому пользователь предупреждается,что вычисления,где важен знак-бит нуля,не должны производиться с использованием разреженных матриц.
zh_cn: 为了纠正这种行为,意味着需要将负符号位的零元素存储在矩阵中,以确保其符号位得到尊重。出于效率的考虑,目前并没有这样做,因此警告用户,对于零的符号位很重要的计算,一定不要使用稀疏矩阵。

source: To create a bulleted list, type
es: Para crear una lista con viñetas,escriba
ru: Чтобы создать маркированный список,введите
zh_cn: 要创建一个带项目符号的列表,请输入

source: To create a constant matrix whose values are all the same use an expression such as
es: Para crear una matriz constante cuyos valores son todos iguales,use una expresión como
ru: Для создания постоянной матрицы,значения которой одинаковы,используйте выражение типа
zh_cn: 要创建一个常量矩阵,其值都是相同的,使用一个表达式,如

source: To create a numbered list, type
es: Para crear una lista numerada,escriba
ru: Чтобы создать пронумерованный список,введите
zh_cn: 要创建一个编号的列表,请输入

source: To define a condition on a property named <code>"timeout"</code>, use the string <code>'\timeout'</code> instead.
es: Para definir una condici&oacute;n en una propiedad llamada <code>"timeout"</code> , use la cadena <code>'\timeout'</code> lugar.
ru: Чтобы определить условие для свойства с именем <code>"timeout"</code> , используйте вместо этого строку <code>'\timeout'</code> .
zh_cn: 要在名为 <code>"timeout"</code> 的属性上定义条件，请改用字符串 <code>'\timeout'</code> 。

source: To determine if two strings are identical it is necessary to use the <code>strcmp</code> function. It compares complete strings and is case sensitive. <code>strncmp</code> compares only the first <code>N</code> characters (with <code>N</code> given as a parameter). <code>strcmpi</code> and <code>strncmpi</code> are the corresponding functions for case-insensitive comparison.
es: Para determinar si dos cadenas son id&eacute;nticas, es necesario utilizar la funci&oacute;n <code>strcmp</code> . Compara cadenas completas y distingue entre may&uacute;sculas y min&uacute;sculas. <code>strncmp</code> compara solo los primeros <code>N</code> caracteres (con <code>N</code> dado como par&aacute;metro). <code>strcmpi</code> y <code>strncmpi</code> son las funciones correspondientes para la comparaci&oacute;n que no distingue entre may&uacute;sculas y min&uacute;sculas.
ru: Чтобы определить, идентичны ли две строки, необходимо использовать функцию <code>strcmp</code> . Он сравнивает полные строки и чувствителен к регистру. <code>strncmp</code> сравнивает только первые <code>N</code> символов (с <code>N</code> в качестве параметра). <code>strcmpi</code> и <code>strncmpi</code> - соответствующие функции для сравнения без учета регистра.
zh_cn: 要确定两个字符串是否相同，必须使用 <code>strcmp</code> 函数。它比较完整的字符串，并且区分大小写。 <code>strncmp</code> 仅比较前 <code>N</code> 个字符（以 <code>N</code> 作为参数）。 <code>strcmpi</code> 和 <code>strncmpi</code> 是不区分大小写的比较的对应函数。

source: To determine the integer size of the <small>BLAS</small> library used by Octave, the following code can be executed:
zh_cn: 要确定Octave使用的<small>BLAS</small>库的整数大小，可以执行以下代码：

source: To determine whether a variable is a graphics object index, or an index to an axes or figure, use the functions <code>ishghandle</code>, <code>isgraphics</code>, <code>isaxes</code>, and <code>isfigure</code>.
es: Para determinar si una variable es un &iacute;ndice de objeto gr&aacute;fico o un &iacute;ndice de un eje o figura, use las funciones <code>ishghandle</code> , <code>isgraphics</code> , <code>isaxes</code> e <code>isfigure</code> .
ru: Чтобы определить, является ли переменная индексом графического объекта или индексом осей или фигуры, используйте функции <code>ishghandle</code> , <code>isgraphics</code> , <code>isaxes</code> и <code>isfigure</code> .
zh_cn: 要确定变量是图形对象索引还是轴或图形的索引，请使用函数 <code>ishghandle</code> ， <code>isgraphics</code> ， <code>isaxes</code> 和 <code>isfigure</code> 。

source: To display the solution of the previous example graphically, use the command
es: Para mostrar la solución del ejemplo anterior gráficamente,use el comando
ru: Чтобы графически отобразить решение предыдущего примера,воспользуйтесь командой
zh_cn: 要以图形化的方式显示上一个例子的解,请使用以下命令

source: To display the value of a variable, simply type the name of the variable at the prompt. For example, to display the value stored in the matrix <code>B</code>, type the command
es: Para mostrar el valor de una variable, simplemente escriba el nombre de la variable en el indicador. Por ejemplo, para mostrar el valor almacenado en la matriz <code>B</code> , escriba el comando
ru: Чтобы отобразить значение переменной, просто введите имя переменной в командной строке. Например, чтобы отобразить значение, хранящееся в матрице <code>B</code> , введите команду
zh_cn: 要显示变量的值，只需在提示符下键入变量的名称。例如，要显示存储在矩阵 <code>B</code> 中的值，请键入以下命令

source: To enable someone to investigate the bug, you should include all these things:
es: Para permitir que alguien investigue el bicho,deberías incluir todas estas cosas:
ru: Чтобы кто-нибудь мог расследовать жучок,вы должны включить все эти вещи:
zh_cn: 为了让别人能够调查这个bug,你应该包括所有这些东西。

source: To enforce both options 1 and 2.
es: Para hacer cumplir las opciones 1 y 2.
ru: Обеспечить соблюдение обоих вариантов 1 и 2.
zh_cn: 同时执行备选方案1和2。

source: To enforce constraint checking during the integration.
es: Para hacer cumplir el control de restricciones durante la integración.
ru: Для обеспечения проверки ограничений во время интеграции.
zh_cn: 要在集成过程中实施约束检查。

source: To exit Octave, type
es: Para salir de Octava,escriba
ru: Чтобы выйти из Октавы,введите
zh_cn: 要退出Octave,请输入

source: To facilitate smooth mixing with full matrices, backward compatibility, and compatibility with <small>MATLAB</small>, the diagonal and permutation matrices should allow any operation that works on full matrices, and will either treat it specially, or implicitly convert themselves to full matrices.
es: Para facilitar la mezcla sin problemas con matrices completas, compatibilidad con versiones anteriores y compatibilidad con <small>MATLAB</small> , las matrices diagonales y de permutaci&oacute;n deben permitir cualquier operaci&oacute;n que funcione en matrices completas y las tratar&aacute;n de manera especial o impl&iacute;citamente se convertir&aacute;n ellas mismas en matrices completas.
ru: Чтобы облегчить плавное смешивание с полными матрицами, обратную совместимость и совместимость с <small>MATLAB</small> , матрицы диагонали и перестановки должны позволять любую операцию, которая работает с полными матрицами, и либо обрабатывать ее специально, либо неявно преобразовывать себя в полные матрицы.
zh_cn: 为了促进与完整矩阵的平滑混合，向后兼容性以及与<small>MATLAB的</small>兼容性，对角矩阵和置换矩阵应允许对完整矩阵进行任何操作，并将对其进行特殊处理，或将其自身隐式转换为完整矩阵。

source: To find the solution of an overdetermined problem needs an estimate of the residual error <var>r</var> and so it is more complex to formulate a minimum norm solution using the <code>spaugment</code> function.
es: Para encontrar la soluci&oacute;n de un problema sobredeterminado se necesita una estimaci&oacute;n del error residual <var>r</var> , por lo que es m&aacute;s complejo formular una soluci&oacute;n de norma m&iacute;nima utilizando la funci&oacute;n de <code>spaugment</code> .
ru: Чтобы найти решение переопределенной проблемы, необходима оценка остаточной ошибки <var>r</var> , поэтому сложнее сформулировать решение с минимальной нормой, используя функцию <code>spaugment</code> .
zh_cn: 要找到超定问题的解决方案，需要估计残余误差 <var>r</var> ，因此使用 <code>spaugment</code> 函数制定最小范数解决方案更为复杂。

source: To function properly the package manager needs to keep some information about the installed packages. For per-user packages this information is by default stored in the file
es: Para funcionar correctamente,el administrador de paquetes necesita guardar alguna información sobre los paquetes instalados.En el caso de los paquetes por usuario,esta información se almacena por defecto en el archivo
ru: Для корректной работы менеджера пакетов необходимо сохранять некоторую информацию об установленных пакетах.Для пакетов для каждого пользователя эта информация по умолчанию хранится в файле
zh_cn: 为了正常运行,软件包管理器需要保存一些关于安装软件包的信息。对于每个用户的软件包,这些信息默认存储在文件-----------------。

source: To get a wider-angle view, we could double the viewing angle. This will also set the mode to manual:
es: Para obtener una vista de ángulo más amplio,podríamos duplicar el ángulo de visión.Esto también fijará el modo a manual:
ru: Чтобы получить более широкий угол обзора,можно удвоить угол обзора.При этом режим также будет переведен в ручной режим:
zh_cn: 为了获得更宽广的视角,我们可以将视角扩大一倍。这样也可以将模式设置为手动。

source: To give another example for indexing cell arrays with &lsquo;
es: Para dar otro ejemplo para indexar matrices de celdas con '
ru: Чтобы дать еще один пример индексации массивов ячеек с помощью '
zh_cn: 再举一个用'

source: To have Octave read and compile these functions into an internal form, you need to make sure that the file is in Octave&rsquo;s load path (accessible through the <code>path</code> function), then simply type the base name of the file that contains the commands. (Octave uses the same rules to search for script files as it does to search for function files.)
es: Para que Octave lea y compile estas funciones en un formulario interno, debe asegurarse de que el archivo est&eacute; en la ruta de carga de Octave (accesible a trav&eacute;s de la funci&oacute;n de <code>path</code> ), luego simplemente escriba el nombre base del archivo que contiene los comandos. (Octave usa las mismas reglas para buscar archivos de script que para buscar archivos de funciones).
ru: Чтобы Octave прочитал и скомпилировал эти функции во внутреннюю форму, вам необходимо убедиться, что файл находится в пути загрузки Octave (доступном через функцию <code>path</code> ), а затем просто введите базовое имя файла, содержащего команды. (Octave использует те же правила для поиска файлов сценариев, что и для поиска файлов функций.)
zh_cn: 要使Octave读取这些函数并将其编译成内部形式，您需要确保该文件位于Octave的加载路径中（可通过 <code>path</code> 函数访问），然后只需键入包含命令的文件的基本名称即可。 （Octave使用与搜索功能文件相同的规则来搜索脚本文件。）

source: To have constraint checking only in the initial condition calculation.
es: Tener una verificación de restricciones sólo en el cálculo de la condición inicial.
ru: Проверять ограничения только при расчете исходного состояния.
zh_cn: 仅在初始条件计算中进行约束检查。

source: To identify whether a particular point represented by a vector <var>p</var> falls within one of the simplices of an N-simplex, we can write the Cartesian coordinates of the point in a parametric form with respect to the N-simplex. This parametric form is called the Barycentric Coordinates of the point. If the points defining the N-simplex are given by <var>N</var> + 1 vectors <code><var>t</var>(<var>i</var>,:)</code>, then the Barycentric coordinates defining the point <var>p</var> are given by
es: Para identificar si un punto particular representado por un vector <var>p</var> cae dentro de uno de los simples de un N-simplex, podemos escribir las coordenadas cartesianas del punto en forma param&eacute;trica con respecto al N-simplex. Esta forma param&eacute;trica se llama Coordenadas baric&eacute;ntricas del punto. Si los puntos que definen el N-simplex est&aacute;n dados por <var>N</var> + 1 vectores <code><var>t</var>(<var>i</var>,:)</code> , entonces las coordenadas baric&eacute;ntricas que definen el punto <var>p</var> est&aacute;n dadas por
ru: Чтобы определить, попадает ли конкретная точка, представленная вектором <var>p</var> , в один из симплексов N-симплекса, мы можем записать декартовы координаты точки в параметрической форме относительно N-симплекса. Эта параметрическая форма называется барицентрическими координатами точки. Если точки, определяющие N-симплекс, задаются <var>N</var> + 1 векторами <code><var>t</var>(<var>i</var>,:)</code> , то барицентрические координаты, определяющие точку <var>p</var> , задаются как
zh_cn: 为了识别由向量 <var>p</var> 表示的特定点是否落在N-单纯形的单纯形之一内，我们可以相对于N-单纯形以参数形式写出该点的笛卡尔坐标。此参数形式称为点的重心坐标。如果定义N个单点的点由 <var>N</var> + 1个向量 <code><var>t</var>(<var>i</var>,:)</code> 给出，则定义点 <var>p</var> 的重心坐标由

source: To include external graphics, e.g., a graphic called &lsquo;
es: Para incluir gr&aacute;ficos externos, por ejemplo, un gr&aacute;fico llamado '
ru: Чтобы включить внешнюю графику, например графику с названием '
zh_cn: 包括外部图形，例如称为&ldquo;

source: To include the content of an external file, e.g., a file called &lsquo;
es: Para incluir el contenido de un archivo externo, por ejemplo, un archivo llamado '
ru: Чтобы включить содержимое внешнего файла, например, файла с именем '
zh_cn: 包含外部文件（例如名为&ldquo;

source: To inquire whether a particular method exists for a user class, the <code>ismethod</code> function can be used.
es: Para averiguar si existe un m&eacute;todo en particular para una clase de usuario, se puede utilizar la funci&oacute;n <code>ismethod</code> .
ru: Чтобы узнать, существует ли конкретный метод для пользовательского класса, можно использовать функцию <code>ismethod</code> .
zh_cn: 要查询用户类是否存在特定方法，可以使用 <code>ismethod</code> 函数。

source: To insert printing characters (letters, digits, symbols, etc.), simply type the character. Octave will insert the character at the cursor and advance the cursor forward.
es: Para insertar caracteres de imprenta (letras,dígitos,símbolos,etc.),simplemente escriba el carácter.Octava insertará el carácter en el cursor y avanzará el cursor hacia adelante.
ru: Для вставки печатных символов (букв,цифр,символов и т.д.)просто введите символ.Октава вставит символ у курсора и переместит курсор вперед.
zh_cn: 要插入打印字符(字母、数字、符号等),只需键入该字符。Octave将在光标处插入该字符,并将光标向前推进。

source: To make the process easier, use the <code>assert</code> function. For example, with <code>assert</code> the previous test is reduced to:
es: Para facilitar el proceso, utilice la funci&oacute;n de <code>assert</code> . Por ejemplo, con <code>assert</code> la prueba anterior se reduce a:
ru: Чтобы упростить процесс, используйте функцию <code>assert</code> . Например, с <code>assert</code> предыдущий тест сводится к:
zh_cn: 为了使过程更容易，请使用 <code>assert</code> 函数。例如，使用 <code>assert</code> 可以将先前的测试简化为：

source: To minimize the amount of code duplication between packages it is possible that one package depends on another one. If a package depends on another, it will check if that package is installed during installation. If it is not, an error will be reported and the package will not be installed. This behavior can be disabled by passing the
es: Para minimizar la cantidad de duplicación de código entre los paquetes es posible que un paquete dependa de otro.Si un paquete depende de otro,se comprobará si ese paquete se instala durante la instalación.Si no lo está,se informará de un error y el paquete no se instalará.Este comportamiento puede ser desactivado pasando el
ru: Для минимизации дублирования кода между пакетами возможно,что один пакет зависит от другого.Если пакет зависит от другого,то во время установки будет проверено,установлен ли этот пакет.Если нет,то будет сообщено об ошибке и пакет не будет установлен.Это поведение можно отключить,передав команду
zh_cn: 为了最大限度地减少包之间的代码重复,有可能一个包依赖于另一个包。如果一个包依赖于另一个包,它将在安装过程中检查该包是否被安装。如果没有,则会报告一个错误,并且该软件包不会被安装。这个行为可以通过传递

source: To multiply the two matrices <code>A</code> and <code>B</code>, type the command
es: Para multiplicar las dos matrices <code>A</code> y <code>B</code> , escriba el comando
ru: Чтобы умножить две матрицы <code>A</code> и <code>B</code> , введите команду
zh_cn: 要将两个矩阵 <code>A</code> 和 <code>B</code> 相乘，请键入以下命令

source: To obtain a single index for each matrix element, Octave pretends that the columns of a matrix form one long vector (like Fortran arrays are stored). For example:
es: Para obtener un índice único para cada elemento de la matriz,Octava pretende que las columnas de una matriz formen un vector largo (como se almacenan las matrices Fortran).Por ejemplo:
ru: Чтобы получить единый индекс для каждого элемента матрицы,Октава притворяется,что столбцы матрицы образуют один длинный вектор (подобно массивам Фортрана).Например:
zh_cn: 为了获得每个矩阵元素的单一索引,Octave假装矩阵的列形成一个长向量(就像Fortran数组的存储方式)。例如,Octave假设矩阵的列形成一个长向量(就像Fortran数组的存储方式一样)。
