Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/octave/octave.*.011.xlf
Languages: es, ja, ru, zh_cn

source: Additional information about the size of the facets of a Voronoi diagram, and which points of a set of points is in a polygon can be had with the <code>polyarea</code> and <code>inpolygon</code> functions respectively.
es: Se puede obtener informaci&oacute;n adicional sobre el tama&ntilde;o de las facetas de un diagrama de Voronoi y qu&eacute; puntos de un conjunto de puntos est&aacute;n en un pol&iacute;gono con las funciones <code>polyarea</code> e <code>inpolygon</code> respectivamente.
ja: ボロノイ図のファセットのサイズ、およびポイントセットのどのポイントがポリゴン内にあるかに関する追加情報は、それぞれ <code>inpolygon</code> 関数とinpolygon関数で <code>polyarea</code> できます。
ru: Дополнительную информацию о размере граней диаграммы Вороного и о том, какие точки набора точек находятся в многоугольнике, можно получить с помощью <code>polyarea</code> и <code>inpolygon</code> соответственно.
zh_cn: 有关Voronoi图的构面大小以及一组点中的哪些点在多边形中的其他信息，可以分别使用 <code>polyarea</code> 和 <code>inpolygon</code> 函数获取。

source: Additional name/value argument pairs may be used to specify the following options:
es: Se pueden utilizar pares de argumentos de nombre/valor adicionales para especificar las siguientes opciones:
ja: 追加の名前/値の引数ペアを使用して、以下のオプションを指定することができます。
ru: Дополнительные пары аргументов имя/значение могут быть использованы для указания следующих опций:
zh_cn: 其他名称/值参数对可用于指定以下选项:

source: Additional optional parameters can be specified using <code>"<var>property</var>", <var>value</var></code> pairs. Valid properties are:
es: Se pueden especificar par&aacute;metros opcionales adicionales usando <code>"<var>property</var>", <var>value</var></code> pares de valores . Las propiedades v&aacute;lidas son:
ja: 追加のオプションパラメータは <code>"<var>property</var>", <var>value</var></code> 「 <var>property</var> 」と <var>value</var> ペアを使用して指定できます。有効なプロパティは次のとおりです。
ru: Дополнительные необязательные параметры можно указать с помощью пар <code>"<var>property</var>", <var>value</var></code> . Допустимые свойства:
zh_cn: 可以使用 <code>"<var>property</var>", <var>value</var></code> 对指定其他可选参数。有效属性是：

source: Additional options can be passed for <small>MATLAB</small> compatibility, but are ignored.
ja: <small>MATLABとの</small>互換性のために追加のオプションを渡すことができますが、無視されます。
zh_cn: 可以传递其他选项以实现<small>MATLAB</small>兼容性，但将被​​忽略。

source: Additional property/value pairs are passed directly to the underlying axes object.
es: Los pares adicionales de propiedad/valor se pasan directamente al objeto de los ejes subyacentes.
ja: 追加のプロパティ/値のペアは、基礎となる軸オブジェクトに直接渡されます。
ru: Дополнительные пары свойств/значений передаются непосредственно объекту подосевой.
zh_cn: 附加的属性/值对直接传递给底层轴对象。

source: Additional property/value pairs are passed directly to the underlying axes object. The full list of properties is documented at <a href="axes-properties#Axes-Properties">Axes Properties</a>.
ja: 追加のプロパティ/値のペアは、基になるAxesオブジェクトに直接渡されます。プロパティの完全なリストは、<a href="axes-properties#Axes-Properties">AxesPropertiesに</a>記載されています。
zh_cn: 其他属性/值对将直接传递到基础轴对象。有关属性的完整列表，请<a href="axes-properties#Axes-Properties">参见&ldquo;轴属性&rdquo;</a>。

source: Additional property/value pairs are passed directly to the underlying patch object.
es: Los pares de propiedades/valores adicionales se pasan directamente al objeto del parche subyacente.
ja: 追加のプロパティ/値のペアは、基礎となるパッチオブジェクトに直接渡されます。
ru: Дополнительные пары свойств/значений передаются непосредственно в базовый объект патча.
zh_cn: 额外的属性/值对直接传递给底层补丁对象。

source: Additional property/value pairs are passed directly to the underlying patch object. The full list of properties is documented at <a href="patch-properties#Patch-Properties">Patch Properties</a>.
ja: 追加のプロパティ/値のペアは、基になるパッチオブジェクトに直接渡されます。プロパティの完全なリストは、<a href="patch-properties#Patch-Properties">パッチのプロパティに</a>記載されています。
zh_cn: 其他属性/值对将直接传递到基础补丁对象。有关属性的完整列表，请<a href="patch-properties#Patch-Properties">参见&ldquo;修补程序属性&rdquo;</a>。

source: Additional property/value pairs are passed to the underlying patch command.
es: Los pares adicionales de propiedad/valor se pasan al comando de parche subyacente.
ja: 追加のプロパティ/値のペアは、基礎となるパッチコマンドに渡されます。
ru: Дополнительные пары свойств/значений передаются базовой команде патча.
zh_cn: 额外的属性/值对被传递给底层补丁命令。

source: Additional property/value pairs are passed to the underlying patch command. The full list of properties is documented at <a href="patch-properties#Patch-Properties">Patch Properties</a>.
ja: 追加のプロパティ/値のペアは、基になるパッチコマンドに渡されます。プロパティの完全なリストは、<a href="patch-properties#Patch-Properties">パッチのプロパティに</a>記載されています。
zh_cn: 附加的属性/值对将传递给基础的patch命令。有关属性的完整列表，请<a href="patch-properties#Patch-Properties">参见&ldquo;修补程序属性&rdquo;</a>。

source: Additional property/value pairs that are valid properties of text objects can be given and are passed to the underlying text objects. Moreover, the contour group property <code>"LabelSpacing"</code> is available which determines the spacing between labels on a contour to be specified. The default is 144 points, or 2 inches.
es: Se pueden proporcionar pares de propiedad / valor adicionales que son propiedades v&aacute;lidas de los objetos de texto y se pasan a los objetos de texto subyacentes. Adem&aacute;s, est&aacute; disponible la propiedad de grupo de contornos <code>"LabelSpacing"</code> , que determina el espacio entre etiquetas en un contorno a especificar. El valor predeterminado es 144 puntos o 2 pulgadas.
ja: テキストオブジェクトの有効なプロパティである追加のプロパティ/値のペアを指定して、基になるテキストオブジェクトに渡すことができます。また、指定するコンターのラベル間の間隔を決定するコンターグループプロパティ <code>"LabelSpacing"</code> が利用できます。デフォルトは144ポイント、つまり2インチです。
ru: Дополнительные пары свойство / значение, которые являются допустимыми свойствами текстовых объектов, могут быть заданы и переданы в базовые текстовые объекты. Кроме того, доступно свойство группы контуров <code>"LabelSpacing"</code> которое определяет интервал между метками на контуре, который необходимо указать. По умолчанию 144 точки или 2 дюйма.
zh_cn: 可以提供作为文本对象有效属性的其他属性/值对，并将其传递给基础文本对象。此外，轮廓组属性 <code>"LabelSpacing"</code> 可用，该属性确定要指定的轮廓上标签之间的间距。默认值为144点或2英寸。

source: Additional supported options: <code>milu</code>, <code>droptol</code>, <code>udiag</code>, <code>thresh</code>.
es: Las opciones adicionales soportados: <code>milu</code> , <code>droptol</code> , <code>udiag</code> , <code>thresh</code> .
ja: 追加でサポートされているオプション： <code>milu</code> 、 <code>droptol</code> 、 <code>udiag</code> 、 <code>thresh</code> 。
ru: Дополнительные поддерживаемые опции: <code>milu</code> , <code>droptol</code> , <code>udiag</code> , <code>thresh</code> .
zh_cn: 其它支持的选项： <code>milu</code> ， <code>droptol</code> ， <code>udiag</code> ， <code>thresh</code> 。

source: Additional supported options: <code>milu</code>, <code>droptol</code>.
es: Opciones adicionales admitidas: <code>milu</code> , <code>droptol</code> .
ja: 追加でサポートされているオプション： <code>milu</code> 、 <code>droptol</code> 。
ru: Дополнительные поддерживаемые опции: <code>milu</code> , <code>droptol</code> .
zh_cn: 其它支持的选项： <code>milu</code> ， <code>droptol</code> 。

source: Additional supported options: <code>milu</code>.
es: Opciones adicionales compatibles: <code>milu</code> .
ja: 追加でサポートされているオプション： <code>milu</code> 。
ru: Дополнительные поддерживаемые параметры: <code>milu</code> .
zh_cn: 其他受支持的选项： <code>milu</code> 。

source: Additional user arguments can be passed to callback functions, and will be passed after the two default arguments. For example:
es: Se pueden pasar argumentos de usuario adicionales a las funciones de devolución de llamada,y se pasarán después de los dos argumentos predeterminados.Por ejemplo:
ja: 追加のユーザー引数をコールバック関数に渡すことができ、2つのデフォルト引数の後に渡されます。例えば、以下のようになります。
ru: Дополнительные аргументы пользователя могут быть переданы в функции обратного вызова и будут переданы после двух аргументов по умолчанию.Например:
zh_cn: 附加的用户参数可以传递给回调函数,并且会在两个默认参数之后传递。例如

source: Additionally two trademark symbols are supported, just embrace the letters &lsquo;
es: Adem&aacute;s, se admiten dos s&iacute;mbolos de marca registrada, simplemente abrace las letras '
ja: さらに、2つの商標記号がサポートされています。
ru: Кроме того, поддерживаются два символа товарных знаков, просто охватывайте буквы "
zh_cn: 此外，还支持两个商标符号，只需将字母&ldquo;

source: Additionally, <code>cellfun</code> accepts an arbitrary function <var>func</var> in the form of an inline function, function handle, or the name of a function (in a character string). The function can take one or more arguments, with the inputs arguments given by <var>C</var>, <var>D</var>, etc. Equally the function can return one or more output arguments. For example:
es: Adem&aacute;s, <code>cellfun</code> acepta una funci&oacute;n arbitraria <var>func</var> en forma de funci&oacute;n en l&iacute;nea, identificador de funci&oacute;n o el nombre de una funci&oacute;n (en una cadena de caracteres). La funci&oacute;n puede tomar uno o m&aacute;s argumentos, con los argumentos de entrada dados por <var>C</var> , <var>D</var> , etc. Igualmente, la funci&oacute;n puede devolver uno o m&aacute;s argumentos de salida. Por ejemplo:
ja: さらに、 <code>cellfun</code> は、インライン関数、関数ハンドル、または関数名（文字列）の形式で任意の関数 <var>func</var> を受け入れます。関数は1つ以上の引数を取ることができ、入力引数は <var>C</var> 、 <var>D</var> などによって与えられます。同様に、関数は1つ以上の出力引数を返すことができます。例えば：
ru: Кроме того, <code>cellfun</code> принимает произвольную функцию <var>func</var> в форме встроенной функции, дескриптора функции или имени функции (в строке символов). Функция может принимать один или несколько аргументов, причем входные аргументы задаются <var>C</var> , <var>D</var> и т. Д. Равным образом функция может возвращать один или несколько выходных аргументов. Например:
zh_cn: 另外， <code>cellfun</code> 接受内联函数，函数句柄或函数名称（以字符串形式）形式的任意函数 <var>func</var> 。函数可以接受一个或多个参数，输入参数由 <var>C</var> ， <var>D</var> 等给出。同样，该函数可以返回一个或多个输出参数。例如：

source: Additionally, <code>material</code> can be called with a single output argument. If called without input arguments, a column cell vector <var>mtypes</var> with the strings for all available materials is returned. If the one input argument <var>mtype_string</var> is the name of a material, a 1x5 cell vector <var>refl_props</var> with the reflectance properties of that material is returned. In both cases, no graphic properties are changed.
es: Adem&aacute;s, el <code>material</code> se puede llamar con un &uacute;nico argumento de salida. Si se llama sin argumentos de entrada, se <var>mtypes</var> vector de celda de columna mtypes con las cadenas de todos los materiales disponibles. Si el &uacute;nico argumento de entrada <var>mtype_string</var> es el nombre de un material, se devuelve un vector de celda <var>refl_props</var> con las propiedades de reflectancia de ese material. En ambos casos, no se cambian las propiedades gr&aacute;ficas.
ja: さらに、 <code>material</code> は単一の出力引数で呼び出すことができます。入力引数なしで呼び出された場合、すべての使用可能なマテリアルの文字列を <var>mtypes</var> 列セルベクトルmtypesが返されます。1つの入力引数 <var>mtype_string</var> がマテリアルの名前である場合、そのマテリアルの反射特性を持つ1x5セルベクトル <var>refl_props</var> が返されます。どちらの場合も、グラフィックプロパティは変更されません。
ru: Кроме того, <code>material</code> можно вызвать с одним выходным аргументом. При вызове без входных аргументов <var>mtypes</var> вектор mtypes ячеек столбца со строками для всех доступных материалов. Если одним входным аргументом <var>mtype_string</var> является имя материала, <var>refl_props</var> вектор ячейки 1x5 refl_props со свойствами отражения этого материала. В обоих случаях графические свойства не меняются.
zh_cn: 此外，可以使用单个输出参数调用 <code>material</code> 。如果在没有输入参数的情况下调用，则返回带有所有可用材料的字符串的列单元向量 <var>mtypes</var> 。如果一个输入参数 <var>mtype_string</var> 是材质的名称， <var>refl_props</var> 返回具有该材质的反射特性的1x5像元向量refl_props。在这两种情况下，都不会更改图形属性。

source: Additionally, class methods can be defined as functions in a folder of the same name as the class prepended with the &lsquo;
es: Adem&aacute;s, los m&eacute;todos de clase se pueden definir como funciones en una carpeta con el mismo nombre que la clase antepuesta con el '
ja: さらに、クラスメソッドは、 'を前に付けたクラスと同じ名前のフォルダー内の関数として定義できます。
ru: Кроме того, методы класса могут быть определены как функции в папке с тем же именем, что и класс, перед которым стоит '
zh_cn: 另外，可以将类方法定义为函数，该函数与&ldquo;

source: Additionally, if <code>sparse_auto_mutate</code> is true, all sparse functions test the amount of memory occupied by the sparse matrix to see if the amount of storage used is larger than the amount used by the full equivalent. Therefore <code>speye (2) * 1</code> will return a full matrix as the memory used is smaller for the full version than the sparse version.
es: Adem&aacute;s, si <code>sparse_auto_mutate</code> es verdadero, todas las funciones dispersas prueban la cantidad de memoria ocupada por la matriz dispersa para ver si la cantidad de almacenamiento utilizada es mayor que la cantidad utilizada por el equivalente completo. Por <code>speye (2) * 1</code> tanto, speye (2) * 1 devolver&aacute; una matriz completa ya que la memoria utilizada es m&aacute;s peque&ntilde;a para la versi&oacute;n completa que para la versi&oacute;n dispersa.
ja: さらに、 <code>sparse_auto_mutate</code> がtrueの場合、すべてのスパース関数はスパースマトリックスによって占有されているメモリの量をテストして、使用されるストレージの量が完全な同等のものによって使用される量よりも大きいかどうかを確認します。したがって、 <code>speye (2) * 1</code> は、使用されるメモリがスパースバージョンよりもフルバージョンの方が小さいため、完全な行列を返します。
ru: Кроме того, если <code>sparse_auto_mutate</code> истинно, все разреженные функции проверяют объем памяти, занятой разреженной матрицей, чтобы увидеть, превышает ли объем используемой памяти объем, используемый полным эквивалентом. Поэтому <code>speye (2) * 1</code> вернет полную матрицу, поскольку используемая память меньше для полной версии, чем для разреженной версии.
zh_cn: 此外，如果 <code>sparse_auto_mutate</code> 为true，则所有稀疏函数都会测试稀疏矩阵占用的内存量，以查看所使用的存储量是否大于完全等效的存储量。因此， <code>speye (2) * 1</code> 将返回完整矩阵，因为完整版本所使用的内存小于稀疏版本。

source: Additionally, if <var>i</var> is a requested output then one of <code>"first"</code> or <code>"last"</code> may be given as an input. If <code>"last"</code> is specified, return the highest possible indices in <var>i</var>, otherwise, if <code>"first"</code> is specified, return the lowest. The default is <code>"last"</code>.
es: Adem&aacute;s, si <var>i</var> es una salida solicitada, se puede dar como entrada uno de <code>"first"</code> o <code>"last"</code> . Si se especifica <code>"last"</code> , devuelve los &iacute;ndices m&aacute;s altos posibles en <var>i</var> ; de lo contrario, si se especifica <code>"first"</code> , devuelve el m&aacute;s bajo. El valor predeterminado es <code>"last"</code> .
ja: さらに、 <var>i</var> が要求された出力である場合、 <code>"first"</code> または <code>"last"</code> いずれかを入力として指定できます。 <code>"last"</code> が指定されている場合は、 <var>i</var> の最大のインデックスを返します。それ以外の場合は、 <code>"first"</code> が指定されている場合は、最小のインデックスを返します。デフォルトは <code>"last"</code> です。
ru: Кроме того, если <var>i</var> является запрошенным выводом, то в качестве ввода может быть задано одно из <code>"first"</code> или <code>"last"</code> . Если указано <code>"last"</code> , вернуть наивысшие возможные индексы в <var>i</var> , в противном случае, если указано <code>"first"</code> , вернуть наименьшие. По умолчанию <code>"last"</code> .
zh_cn: 另外，如果 <var>i</var> 是请求的输出，则可以将 <code>"first"</code> 或 <code>"last"</code> 作为输入。如果指定了 <code>"last"</code> ，则返回 <var>i</var> 中可能的最高索引，否则，如果指定 <code>"first"</code> ，则返回最低的索引。默认值为 <code>"last"</code> 。

source: Additionally, if <var>i</var> is a requested output then one of the flags <code>"first"</code> or <code>"last"</code> may be given. If <code>"last"</code> is specified, return the highest possible indices in <var>i</var>, otherwise, if <code>"first"</code> is specified, return the lowest. The default is <code>"first"</code>.
ja: さらに、 <var>i</var> が要求された出力である場合、フラグ <code>"first"</code> または <code>"last"</code> いずれかを指定できます。 <code>"last"</code> が指定されている場合は、 <var>i</var> で可能な最高のインデックスを返します。それ以外の場合は、 <code>"first"</code> が指定されている場合は、最低のインデックスを返します。デフォルトは <code>"first"</code> です。
zh_cn: 另外，如果 <var>i</var> 是请求的输出，则可以给出标志 <code>"first"</code> 或 <code>"last"</code> 。如果指定了 <code>"last"</code> ，则返回 <var>i</var> 中可能的最高索引，否则，如果指定 <code>"first"</code> ，则返回最低的索引。默认值为 <code>"first"</code> 。

source: Additionally, index expressions also use lazy copying when Octave can determine that the indexed portion is contiguous in memory. For example:
es: Además,las expresiones de índice también utilizan la copia perezosa cuando Octava puede determinar que la porción indexada es contigua en la memoria.Por ejemplo:
ja: さらに、インデックス式は、Octaveがインデックス化された部分がメモリ上で連続していると判断できる場合には、遅延コピーも使用します。例えば,以下のようになります。
ru: Кроме того,в индексных выражениях также используется ленивое копирование,когда Октава может определить,что индексированная часть является смежной в памяти.Например:
zh_cn: 此外,当Octave可以确定索引部分在内存中是连续的时候,索引表达式也会使用懒惰复制。例如

source: Additionally, the following libraries use <code>int</code> internally, so maximum problem sizes are always limited:
es: Adem&aacute;s, las siguientes bibliotecas usan <code>int</code> internamente, por lo que los tama&ntilde;os m&aacute;ximos de problemas siempre son limitados:
ja: さらに、次のライブラリは内部で <code>int</code> を使用するため、最大問題サイズは常に制限されます。
ru: Кроме того, следующие библиотеки используют <code>int</code> внутри, поэтому максимальные размеры проблем всегда ограничены:
zh_cn: 此外，以下库在内部使用 <code>int</code> ，因此最大问题大小始终受到限制：

source: Additionally, the following tools may be needed:
es: Además,es posible que se necesiten las siguientes herramientas:
ja: さらに、以下のようなツールが必要になる場合があります。
ru: Кроме того,могут потребоваться следующие инструменты:
zh_cn: 此外,可能还需要以下工具:

source: Additionally, there are dialog boxes for displaying help messages, warnings, or errors, and for getting text input from the user.
es: Además,hay cuadros de diálogo para mostrar mensajes de ayuda,advertencias o errores,y para obtener la entrada de texto del usuario.
ja: さらに、ヘルプメッセージ、警告、エラーを表示するためのダイアログボックスや、ユーザーからのテキスト入力を取得するためのダイアログボックスがあります。
ru: Кроме того,существуют диалоговые окна для отображения справочных сообщений,предупреждений или ошибок,а также для получения текстовых сообщений от пользователя.
zh_cn: 此外,还有一些对话框用于显示帮助信息、警告或错误,以及获取用户的文本输入。

source: Additionally, you may append a <code>"z"</code> to the mode string to open a gzipped file for reading or writing. For this to be successful, you must also open the file in binary mode.
es: Adem&aacute;s, puede agregar una <code>"z"</code> a la cadena de modo para abrir un archivo comprimido con gzip para leer o escribir. Para que esto tenga &eacute;xito, tambi&eacute;n debe abrir el archivo en modo binario.
ja: さらに、モード文字列に <code>"z"</code> を追加して、読み取りまたは書き込み用にgzip圧縮されたファイルを開くことができます。これを成功させるには、ファイルをバイナリモードで開く必要もあります。
ru: Кроме того, вы можете добавить букву <code>"z"</code> к строке режима, чтобы открыть сжатый файл для чтения или записи. Чтобы это было успешным, вы также должны открыть файл в двоичном режиме.
zh_cn: 此外，您可以在模式字符串后附加 <code>"z"</code> 以打开压缩后的文件以进行读取或写入。为使此操作成功，您还必须以二进制模式打开文件。

source: Administrating Packages
es: Administración de paquetes
ja: パッケージの管理
ru: Административные пакеты
zh_cn: 管理软件包

source: Adobe Illustrator (obsolete for Gnuplot versions &gt; 4.2)
es: Adobe Illustrator (obsoleto para las versiones de Gnuplot&gt; 4.2)
ja: Adobe Illustrator（Gnuplotバージョン&gt; 4.2では廃止）
ru: Adobe Illustrator (устарело для версий Gnuplot&gt; 4.2)
zh_cn: Adobe Illustrator（对于Gnuplot版本&gt; 4.2已作废）

source: Advanced Indexing
es: Indexación avanzada
ja: 高度なインデックス作成
ru: Расширенная индексация
zh_cn: 高级索引

source: Advanced Plotting
es: Trazado avanzado
ja: 高度なプロッティング
ru: Расширенное планирование
zh_cn: 高级绘图

source: After a successful computation, the value of <var>istate</var> will be 2 (consistent with the Fortran version of <small>LSODE</small>).
es: Despu&eacute;s de un c&aacute;lculo exitoso, el valor de <var>istate</var> ser&aacute; 2 (consistente con la versi&oacute;n Fortran de <small>LSODE</small> ).
ja: 計算が成功すると、 <var>istate</var> の値は2になります（<small>LSODEの</small> Fortranバージョンと<small>一致</small>）。
ru: После успешного вычисления значение <var>istate</var> будет равно 2 (в соответствии с версией <small>LSODE</small> для <small>Fortran</small> ).
zh_cn: 计算成功后， <var>istate</var> 的值将为2（与<small>LSODE</small>的Fortran版本<small>一致</small>）。

source: After a successful computation, the value of <var>istate</var> will be greater than zero (consistent with the Fortran version of <small>DASPK</small>).
es: Despu&eacute;s de un c&aacute;lculo exitoso, el valor de <var>istate</var> ser&aacute; mayor que cero (consistente con la versi&oacute;n Fortran de <small>DASPK</small> ).
ja: 計算が成功すると、 <var>istate</var> の値はゼロより大きくなります（<small>DASPKの</small> Fortranバージョンと<small>一致します</small>）。
ru: После успешного вычисления значение <var>istate</var> будет больше нуля (в соответствии с версией <small>DASPK</small> для <small>Fortran</small> ).
zh_cn: 计算成功后， <var>istate</var> 的值将大于零（与<small>DASPK</small>的Fortran版本<small>一致</small>）。

source: After a successful computation, the value of <var>istate</var> will be greater than zero (consistent with the Fortran version of <small>DASSL</small>).
es: Despu&eacute;s de un c&aacute;lculo exitoso, el valor de <var>istate</var> ser&aacute; mayor que cero (consistente con la versi&oacute;n Fortran de <small>DASSL</small> ).
ja: 計算が成功すると、 <var>istate</var> の値はゼロより大きくなります（<small>DASSLの</small> Fortranバージョンと一致します）。
ru: После успешного вычисления значение <var>istate</var> будет больше нуля (в соответствии с версией <small>DASSL</small> для <small>Fortran</small> ).
zh_cn: 一个成功的计算之后，价值 <var>istate</var> 将大于零（具备Fortran语言版本一致<small>DASSL</small>）。

source: After all of the calling forms have been enumerated, the next line is a concise one-sentence summary of the function.
es: Después de enumerar todas las formas de llamada,la siguiente línea es un resumen conciso de una frase de la función.
ja: すべての呼び出しフォームが列挙された後、次の行は関数の簡潔な一文要約です。
ru: После того,как все вызывающие формы перечислены,следующая строка представляет собой краткое резюме функции.
zh_cn: 在列举完所有的调用形式后,下一行是对函数的简明的一句话总结。

source: After being marked as deprecated for two major releases, the following functions have been removed from Octave. The third column of the table shows the version of Octave in which the function was removed. Prior to removal, each function in the list was marked as deprecated for at least two major releases. All deprecated functions issue warnings explaining that they will be removed in a future version of Octave, and which function should be used instead.
es: Después de haber sido marcado como desaprobado para dos liberaciones importantes,las siguientes funciones han sido eliminadas de la Octava.La tercera columna de la tabla muestra la versión de Octava en la que la función fue eliminada.Antes de la eliminación,cada función de la lista se marcó como obsoleta para al menos dos versiones principales.Todas las funciones desaprobadas emiten advertencias que explican que serán eliminadas en una futura versión de Octava,y qué función debería utilizarse en su lugar.
ja: 2つのメジャーリリースで非推奨とマークされた後,以下の関数がOctaveから削除されました。表の3番目の列は,その関数が削除されたOctaveのバージョンを示しています。除去される前に,リストの各関数は少なくとも2つのメジャーリリースで非推奨とマークされていました。すべての非推奨関数は,それらがOctaveの将来のバージョンで削除されることと,その代わりにどの関数を使用すべきかを説明する警告を発行します。
ru: После того,как два мажорных релиза были помечены как устаревшие,следующие функции были удалены из Октавы.В третьем столбце таблицы показана версия Октавы,в которой функция была удалена.Перед удалением каждая функция в списке была помечена как устаревшая как минимум для двух мажорных выпусков.Все устаревшие функции выдают предупреждения,объясняющие,что они будут удалены в будущей версии Октавы,и какую функцию следует использовать вместо нее.
zh_cn: 在两个主要版本中被标记为废弃后,以下函数已经从Octave中删除。表格的第三列显示了删除该函数的Octave版本。在删除之前,列表中的每个函数至少在两个主要版本中被标记为弃用。所有被弃用的函数都会发出警告,解释它们将在未来的Octave版本中被删除,以及应该使用哪个函数来代替。
