Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/octave/octave.*.011.xlf
Languages: es, ja, ru, zh_cn

source: Any window elements outside the data array are replaced by the specified value <var>user_value</var> which must be a numeric scalar. For example, with a window of length 3, <code><var>y</var>(1) = mean ([<var>user_value</var>, <var>x</var>(1:2)])</code>, and <code><var>y</var>(end) = mean ([<var>x</var>(end-1:end), <var>user_value</var>])</code>. A common choice for <var>user_value</var> is 0.
es: Cualquier elemento de ventana fuera de la matriz de datos se reemplaza por el valor especificado <var>user_value</var> , que debe ser un escalar num&eacute;rico. Por ejemplo, con una ventana de longitud 3, <code><var>y</var>(1) = mean ([<var>user_value</var>, <var>x</var>(1:2)])</code> e <code><var>y</var>(end) = mean ([<var>x</var>(end-1:end), <var>user_value</var>])</code> . Una opci&oacute;n com&uacute;n para <var>user_value</var> es 0.
ja: データ配列の外側のウィンドウ要素はすべて、指定された値 <var>user_value</var> で置き換えられます。user_valueは数値スカラーでなければなりません。たとえば、長さが3のウィンドウの場合、 <code><var>y</var>(1) = mean ([<var>user_value</var>, <var>x</var>(1:2)])</code> 、および <code><var>y</var>(end) = mean ([<var>x</var>(end-1:end), <var>user_value</var>])</code> 。 <var>user_value</var> の一般的な選択は0です。
ru: Любые элементы окна вне массива данных заменяются указанным значением <var>user_value</var> , которое должно быть числовым скаляром. Например, для окна длиной 3 <code><var>y</var>(1) = mean ([<var>user_value</var>, <var>x</var>(1:2)])</code> и <code><var>y</var>(end) = mean ([<var>x</var>(end-1:end), <var>user_value</var>])</code> . Обычный выбор для <var>user_value</var> - 0.
zh_cn: 数据数组外部的所有窗口元素都将替换为指定值 <var>user_value</var> ，该值必须是数字标量。例如，对于长度为3的窗口， <code><var>y</var>(1) = mean ([<var>user_value</var>, <var>x</var>(1:2)])</code> 和 <code><var>y</var>(end) = mean ([<var>x</var>(end-1:end), <var>user_value</var>])</code> 。 <var>user_value</var> 的常见选择是0。

source: Any window elements outside the data array are replaced by the specified value <var>user_value</var> which must be a numeric scalar. For example, with a window of length 3, <code><var>y</var>(1) = min ([<var>user_value</var>, <var>x</var>(1:2)])</code>, and <code><var>y</var>(end) = min ([<var>x</var>(end-1:end), <var>user_value</var>])</code>. A common choice for <var>user_value</var> is 0.
es: Cualquier elemento de ventana fuera de la matriz de datos se reemplaza por el valor especificado <var>user_value</var> , que debe ser un escalar num&eacute;rico. Por ejemplo, con una ventana de longitud 3, <code><var>y</var>(1) = min ([<var>user_value</var>, <var>x</var>(1:2)])</code> e <code><var>y</var>(end) = min ([<var>x</var>(end-1:end), <var>user_value</var>])</code> . Una opci&oacute;n com&uacute;n para <var>user_value</var> es 0.
ja: データ配列の外側のウィンドウ要素はすべて、指定された値 <var>user_value</var> で置き換えられます。user_valueは数値スカラーでなければなりません。たとえば、長さが3のウィンドウの場合、 <code><var>y</var>(1) = min ([<var>user_value</var>, <var>x</var>(1:2)])</code> 、および <code><var>y</var>(end) = min ([<var>x</var>(end-1:end), <var>user_value</var>])</code> 。 <var>user_value</var> の一般的な選択は0です。
ru: Любые элементы окна вне массива данных заменяются указанным значением <var>user_value</var> , которое должно быть числовым скаляром. Например, с окном длиной 3 <code><var>y</var>(1) = min ([<var>user_value</var>, <var>x</var>(1:2)])</code> и <code><var>y</var>(end) = min ([<var>x</var>(end-1:end), <var>user_value</var>])</code> . Обычный выбор для <var>user_value</var> - 0.
zh_cn: 数据数组外部的所有窗口元素都将替换为指定值 <var>user_value</var> ，该值必须是数字标量。例如，对于长度为3的窗口， <code><var>y</var>(1) = min ([<var>user_value</var>, <var>x</var>(1:2)])</code> 和 <code><var>y</var>(end) = min ([<var>x</var>(end-1:end), <var>user_value</var>])</code> 。 <var>user_value</var> 的常见选择是0。

source: Any window elements outside the data array are replaced by the specified value <var>user_value</var> which must be a numeric scalar. For example, with a window of length 3, <code><var>y</var>(1) = movmedian ([<var>user_value</var>, <var>x</var>(1:2)])</code>, and <code><var>y</var>(end) = movmedian ([<var>x</var>(end-1:end), <var>user_value</var>])</code>. A common choice for <var>user_value</var> is 0.
es: Cualquier elemento de ventana fuera de la matriz de datos se reemplaza por el valor especificado <var>user_value</var> , que debe ser un escalar num&eacute;rico. Por ejemplo, con una ventana de longitud 3, <code><var>y</var>(1) = movmedian ([<var>user_value</var>, <var>x</var>(1:2)])</code> e <code><var>y</var>(end) = movmedian ([<var>x</var>(end-1:end), <var>user_value</var>])</code> . Una opci&oacute;n com&uacute;n para <var>user_value</var> es 0.
ja: データ配列の外側のウィンドウ要素はすべて、指定された値 <var>user_value</var> で置き換えられます。user_valueは数値スカラーでなければなりません。たとえば、ウィンドウの長さが3の場合、 <code><var>y</var>(1) = movmedian ([<var>user_value</var>, <var>x</var>(1:2)])</code> と <code><var>y</var>(end) = movmedian ([<var>x</var>(end-1:end), <var>user_value</var>])</code> 。 <var>user_value</var> の一般的な選択は0です。
ru: Любые элементы окна вне массива данных заменяются указанным значением <var>user_value</var> , которое должно быть числовым скаляром. Например, для окна длиной 3 <code><var>y</var>(1) = movmedian ([<var>user_value</var>, <var>x</var>(1:2)])</code> и <code><var>y</var>(end) = movmedian ([<var>x</var>(end-1:end), <var>user_value</var>])</code> . Обычный выбор для <var>user_value</var> - 0.
zh_cn: 数据数组外部的所有窗口元素都将替换为指定值 <var>user_value</var> ，该值必须是数字标量。例如，对于长度为3的窗口， <code><var>y</var>(1) = movmedian ([<var>user_value</var>, <var>x</var>(1:2)])</code> 和 <code><var>y</var>(end) = movmedian ([<var>x</var>(end-1:end), <var>user_value</var>])</code> 。 <var>user_value</var> 的常见选择是0。

source: Any window elements outside the data array are replaced by the specified value <var>user_value</var> which must be a numeric scalar. For example, with a window of length 3, <code><var>y</var>(1) = movprod ([<var>user_value</var>, <var>x</var>(1:2)])</code>, and <code><var>y</var>(end) = movprod ([<var>x</var>(end-1:end), <var>user_value</var>])</code>. A common choice for <var>user_value</var> is 0.
es: Cualquier elemento de ventana fuera de la matriz de datos se reemplaza por el valor especificado <var>user_value</var> , que debe ser un escalar num&eacute;rico. Por ejemplo, con una ventana de longitud 3, <code><var>y</var>(1) = movprod ([<var>user_value</var>, <var>x</var>(1:2)])</code> , e <code><var>y</var>(end) = movprod ([<var>x</var>(end-1:end), <var>user_value</var>])</code> . Una opci&oacute;n com&uacute;n para <var>user_value</var> es 0.
ja: データ配列の外側のウィンドウ要素はすべて、指定された値 <var>user_value</var> で置き換えられます。user_valueは数値スカラーでなければなりません。たとえば、長さが3のウィンドウの場合、 <code><var>y</var>(1) = movprod ([<var>user_value</var>, <var>x</var>(1:2)])</code> と <code><var>y</var>(end) = movprod ([<var>x</var>(end-1:end), <var>user_value</var>])</code> 。 <var>user_value</var> の一般的な選択は0です。
ru: Любые элементы окна вне массива данных заменяются указанным значением <var>user_value</var> , которое должно быть числовым скаляром. Например, с окном длиной 3 <code><var>y</var>(1) = movprod ([<var>user_value</var>, <var>x</var>(1:2)])</code> и <code><var>y</var>(end) = movprod ([<var>x</var>(end-1:end), <var>user_value</var>])</code> . Обычный выбор для <var>user_value</var> - 0.
zh_cn: 数据数组外部的所有窗口元素都将替换为指定值 <var>user_value</var> ，该值必须是数字标量。例如，对于长度为3的窗口， <code><var>y</var>(1) = movprod ([<var>user_value</var>, <var>x</var>(1:2)])</code> 和 <code><var>y</var>(end) = movprod ([<var>x</var>(end-1:end), <var>user_value</var>])</code> 。 <var>user_value</var> 的常见选择是0。

source: Any window elements outside the data array are replaced by the specified value <var>user_value</var> which must be a numeric scalar. For example, with a window of length 3, <code><var>y</var>(1) = movstd ([<var>user_value</var>, <var>x</var>(1:2)])</code>, and <code><var>y</var>(end) = movstd ([<var>x</var>(end-1:end), <var>user_value</var>])</code>. A common choice for <var>user_value</var> is 0.
es: Cualquier elemento de ventana fuera de la matriz de datos se reemplaza por el valor especificado <var>user_value</var> , que debe ser un escalar num&eacute;rico. Por ejemplo, con una ventana de longitud 3, <code><var>y</var>(1) = movstd ([<var>user_value</var>, <var>x</var>(1:2)])</code> e <code><var>y</var>(end) = movstd ([<var>x</var>(end-1:end), <var>user_value</var>])</code> . Una opci&oacute;n com&uacute;n para <var>user_value</var> es 0.
ja: データ配列の外側のウィンドウ要素はすべて、指定された値 <var>user_value</var> で置き換えられます。user_valueは数値スカラーでなければなりません。たとえば、ウィンドウの長さが3の場合、 <code><var>y</var>(1) = movstd ([<var>user_value</var>, <var>x</var>(1:2)])</code> と <code><var>y</var>(end) = movstd ([<var>x</var>(end-1:end), <var>user_value</var>])</code> 。 <var>user_value</var> の一般的な選択は0です。
ru: Любые элементы окна вне массива данных заменяются указанным значением <var>user_value</var> , которое должно быть числовым скаляром. Например, для окна длиной 3 <code><var>y</var>(1) = movstd ([<var>user_value</var>, <var>x</var>(1:2)])</code> и <code><var>y</var>(end) = movstd ([<var>x</var>(end-1:end), <var>user_value</var>])</code> . Обычный выбор для <var>user_value</var> - 0.
zh_cn: 数据数组外部的所有窗口元素都将替换为指定值 <var>user_value</var> ，该值必须是数字标量。例如，对于一个长度为3的窗口， <code><var>y</var>(1) = movstd ([<var>user_value</var>, <var>x</var>(1:2)])</code> 和 <code><var>y</var>(end) = movstd ([<var>x</var>(end-1:end), <var>user_value</var>])</code> 。 <var>user_value</var> 的常见选择是0。

source: Any window elements outside the data array are replaced by the specified value <var>user_value</var> which must be a numeric scalar. For example, with a window of length 3, <code><var>y</var>(1) = movsum ([<var>user_value</var>, <var>x</var>(1:2)])</code>, and <code><var>y</var>(end) = movsum ([<var>x</var>(end-1:end), <var>user_value</var>])</code>. A common choice for <var>user_value</var> is 0.
es: Cualquier elemento de ventana fuera de la matriz de datos se reemplaza por el valor especificado <var>user_value</var> , que debe ser un escalar num&eacute;rico. Por ejemplo, con una ventana de longitud 3, <code><var>y</var>(1) = movsum ([<var>user_value</var>, <var>x</var>(1:2)])</code> e <code><var>y</var>(end) = movsum ([<var>x</var>(end-1:end), <var>user_value</var>])</code> . Una opci&oacute;n com&uacute;n para <var>user_value</var> es 0.
ja: データ配列の外側のウィンドウ要素はすべて、指定された値 <var>user_value</var> で置き換えられます。user_valueは数値スカラーでなければなりません。たとえば、ウィンドウの長さが3の場合、 <code><var>y</var>(1) = movsum ([<var>user_value</var>, <var>x</var>(1:2)])</code> と <code><var>y</var>(end) = movsum ([<var>x</var>(end-1:end), <var>user_value</var>])</code> 。 <var>user_value</var> の一般的な選択は0です。
ru: Любые элементы окна вне массива данных заменяются указанным значением <var>user_value</var> , которое должно быть числовым скаляром. Например, с окном длиной 3 <code><var>y</var>(1) = movsum ([<var>user_value</var>, <var>x</var>(1:2)])</code> и <code><var>y</var>(end) = movsum ([<var>x</var>(end-1:end), <var>user_value</var>])</code> . Обычный выбор для <var>user_value</var> - 0.
zh_cn: 数据数组外部的所有窗口元素都将替换为指定值 <var>user_value</var> ，该值必须是数字标量。例如，对于一个长度为3的窗口， <code><var>y</var>(1) = movsum ([<var>user_value</var>, <var>x</var>(1:2)])</code> 和 <code><var>y</var>(end) = movsum ([<var>x</var>(end-1:end), <var>user_value</var>])</code> 。 <var>user_value</var> 的常见选择是0。

source: Any window elements outside the data array are replaced by the specified value <var>user_value</var> which must be a numeric scalar. For example, with a window of length 3, <code><var>y</var>(1) = var ([<var>user_value</var>, <var>x</var>(1:2)])</code>, and <code><var>y</var>(end) = var ([<var>x</var>(end-1:end), <var>user_value</var>])</code>. A common choice for <var>user_value</var> is 0.
es: Cualquier elemento de ventana fuera de la matriz de datos se reemplaza por el valor especificado <var>user_value</var> , que debe ser un escalar num&eacute;rico. Por ejemplo, con una ventana de longitud 3, <code><var>y</var>(1) = var ([<var>user_value</var>, <var>x</var>(1:2)])</code> e <code><var>y</var>(end) = var ([<var>x</var>(end-1:end), <var>user_value</var>])</code> . Una opci&oacute;n com&uacute;n para <var>user_value</var> es 0.
ja: データ配列の外側のウィンドウ要素はすべて、指定された値 <var>user_value</var> で置き換えられます。user_valueは数値スカラーでなければなりません。たとえば、ウィンドウの長さが3の場合、 <code><var>y</var>(1) = var ([<var>user_value</var>, <var>x</var>(1:2)])</code> と <code><var>y</var>(end) = var ([<var>x</var>(end-1:end), <var>user_value</var>])</code> 。 <var>user_value</var> の一般的な選択は0です。
ru: Любые элементы окна вне массива данных заменяются указанным значением <var>user_value</var> , которое должно быть числовым скаляром. Например, с окном длиной 3 <code><var>y</var>(1) = var ([<var>user_value</var>, <var>x</var>(1:2)])</code> и <code><var>y</var>(end) = var ([<var>x</var>(end-1:end), <var>user_value</var>])</code> . Обычный выбор для <var>user_value</var> - 0.
zh_cn: 数据数组外部的所有窗口元素都将替换为指定值 <var>user_value</var> ，该值必须是数字标量。例如，对于一个长度为3的窗口， <code><var>y</var>(1) = var ([<var>user_value</var>, <var>x</var>(1:2)])</code> 和 <code><var>y</var>(end) = var ([<var>x</var>(end-1:end), <var>user_value</var>])</code> 。 <var>user_value</var> 的常见选择是0。

source: Any window elements outside the data array are replaced by the value of <var>x</var> at the boundary. For example, with a window of length 3, <code><var>y</var>(1) = <var>fcn</var> ([<var>x</var>(1), <var>x</var>(1:2)])</code>, and <code><var>y</var>(end) = <var>fcn</var> ([<var>x</var>(end-1:end), <var>x</var>(end)])</code>.
es: Cualquier elemento de ventana fuera de la matriz de datos se reemplaza por el valor de <var>x</var> en el l&iacute;mite. Por ejemplo, con una ventana de longitud 3, <code><var>y</var>(1) = <var>fcn</var> ([<var>x</var>(1), <var>x</var>(1:2)])</code> , y <code><var>y</var>(end) = <var>fcn</var> ([<var>x</var>(end-1:end), <var>x</var>(end)])</code> .
ja: データ配列外のウィンドウ要素は、境界で <var>x</var> の値に置き換えられます。たとえば、ウィンドウの長さが3の場合、 <code><var>y</var>(1) = <var>fcn</var> ([<var>x</var>(1), <var>x</var>(1:2)])</code> と <code><var>y</var>(end) = <var>fcn</var> ([<var>x</var>(end-1:end), <var>x</var>(end)])</code> 。
ru: Любые элементы окна вне массива данных заменяются значением <var>x</var> на границе. Например, для окна длиной 3 <code><var>y</var>(1) = <var>fcn</var> ([<var>x</var>(1), <var>x</var>(1:2)])</code> и <code><var>y</var>(end) = <var>fcn</var> ([<var>x</var>(end-1:end), <var>x</var>(end)])</code> .
zh_cn: 数据数组外部的所有窗口元素都将被边界处的 <var>x</var> 值替换。例如，对于一个长度为3的窗口， <code><var>y</var>(1) = <var>fcn</var> ([<var>x</var>(1), <var>x</var>(1:2)])</code> 和 <code><var>y</var>(end) = <var>fcn</var> ([<var>x</var>(end-1:end), <var>x</var>(end)])</code> 。

source: Any window elements outside the data array are replaced by the value of <var>x</var> at the boundary. For example, with a window of length 3, <code><var>y</var>(1) = mad ([<var>x</var>(1), <var>x</var>(1:2)])</code>, and <code><var>y</var>(end) = mad ([<var>x</var>(end-1:end), <var>x</var>(end)])</code>.
es: Cualquier elemento de ventana fuera de la matriz de datos se reemplaza por el valor de <var>x</var> en el l&iacute;mite. Por ejemplo, con una ventana de longitud 3, <code><var>y</var>(1) = mad ([<var>x</var>(1), <var>x</var>(1:2)])</code> e <code><var>y</var>(end) = mad ([<var>x</var>(end-1:end), <var>x</var>(end)])</code> .
ja: データ配列外のウィンドウ要素は、境界で <var>x</var> の値に置き換えられます。たとえば、長さが3のウィンドウの場合、 <code><var>y</var>(1) = mad ([<var>x</var>(1), <var>x</var>(1:2)])</code> 、および <code><var>y</var>(end) = mad ([<var>x</var>(end-1:end), <var>x</var>(end)])</code> 。
ru: Любые элементы окна вне массива данных заменяются значением <var>x</var> на границе. Например, с окном длиной 3 <code><var>y</var>(1) = mad ([<var>x</var>(1), <var>x</var>(1:2)])</code> и <code><var>y</var>(end) = mad ([<var>x</var>(end-1:end), <var>x</var>(end)])</code> .
zh_cn: 数据数组外部的所有窗口元素都将被边界处的 <var>x</var> 值替换。例如，对于一个长度为3的窗口， <code><var>y</var>(1) = mad ([<var>x</var>(1), <var>x</var>(1:2)])</code> ，而 <code><var>y</var>(end) = mad ([<var>x</var>(end-1:end), <var>x</var>(end)])</code> 。

source: Any window elements outside the data array are replaced by the value of <var>x</var> at the boundary. For example, with a window of length 3, <code><var>y</var>(1) = max ([<var>x</var>(1), <var>x</var>(1:2)])</code>, and <code><var>y</var>(end) = max ([<var>x</var>(end-1:end), <var>x</var>(end)])</code>.
es: Cualquier elemento de ventana fuera de la matriz de datos se reemplaza por el valor de <var>x</var> en el l&iacute;mite. Por ejemplo, con una ventana de longitud 3, <code><var>y</var>(1) = max ([<var>x</var>(1), <var>x</var>(1:2)])</code> e <code><var>y</var>(end) = max ([<var>x</var>(end-1:end), <var>x</var>(end)])</code> .
ja: データ配列外のウィンドウ要素は、境界で <var>x</var> の値に置き換えられます。たとえば、ウィンドウの長さが3の場合、 <code><var>y</var>(1) = max ([<var>x</var>(1), <var>x</var>(1:2)])</code> であり、 <code><var>y</var>(end) = max ([<var>x</var>(end-1:end), <var>x</var>(end)])</code> 。
ru: Любые элементы окна вне массива данных заменяются значением <var>x</var> на границе. Например, с окном длиной 3 <code><var>y</var>(1) = max ([<var>x</var>(1), <var>x</var>(1:2)])</code> и <code><var>y</var>(end) = max ([<var>x</var>(end-1:end), <var>x</var>(end)])</code> .
zh_cn: 数据数组外部的所有窗口元素都将被边界处的 <var>x</var> 值替换。例如，对于一个长度为3的窗口， <code><var>y</var>(1) = max ([<var>x</var>(1), <var>x</var>(1:2)])</code> ，而 <code><var>y</var>(end) = max ([<var>x</var>(end-1:end), <var>x</var>(end)])</code> 。

source: Any window elements outside the data array are replaced by the value of <var>x</var> at the boundary. For example, with a window of length 3, <code><var>y</var>(1) = mean ([<var>x</var>(1), <var>x</var>(1:2)])</code>, and <code><var>y</var>(end) = mean ([<var>x</var>(end-1:end), <var>x</var>(end)])</code>.
es: Cualquier elemento de ventana fuera de la matriz de datos se reemplaza por el valor de <var>x</var> en el l&iacute;mite. Por ejemplo, con una ventana de longitud 3, <code><var>y</var>(1) = mean ([<var>x</var>(1), <var>x</var>(1:2)])</code> , y <code><var>y</var>(end) = mean ([<var>x</var>(end-1:end), <var>x</var>(end)])</code> .
ja: データ配列外のウィンドウ要素は、境界で <var>x</var> の値に置き換えられます。たとえば、ウィンドウの長さが3の場合、 <code><var>y</var>(1) = mean ([<var>x</var>(1), <var>x</var>(1:2)])</code> であり、 <code><var>y</var>(end) = mean ([<var>x</var>(end-1:end), <var>x</var>(end)])</code> 。
ru: Любые элементы окна вне массива данных заменяются значением <var>x</var> на границе. Например, с окном длиной 3 <code><var>y</var>(1) = mean ([<var>x</var>(1), <var>x</var>(1:2)])</code> и <code><var>y</var>(end) = mean ([<var>x</var>(end-1:end), <var>x</var>(end)])</code> .
zh_cn: 数据数组外部的所有窗口元素都将被边界处的 <var>x</var> 值替换。例如，对于一个长度为3的窗口， <code><var>y</var>(1) = mean ([<var>x</var>(1), <var>x</var>(1:2)])</code> ，而 <code><var>y</var>(end) = mean ([<var>x</var>(end-1:end), <var>x</var>(end)])</code> 。

source: Any window elements outside the data array are replaced by the value of <var>x</var> at the boundary. For example, with a window of length 3, <code><var>y</var>(1) = min ([<var>x</var>(1), <var>x</var>(1:2)])</code>, and <code><var>y</var>(end) = min ([<var>x</var>(end-1:end), <var>x</var>(end)])</code>.
es: Cualquier elemento de ventana fuera de la matriz de datos se reemplaza por el valor de <var>x</var> en el l&iacute;mite. Por ejemplo, con una ventana de longitud 3, <code><var>y</var>(1) = min ([<var>x</var>(1), <var>x</var>(1:2)])</code> e <code><var>y</var>(end) = min ([<var>x</var>(end-1:end), <var>x</var>(end)])</code> .
ja: データ配列外のウィンドウ要素は、境界で <var>x</var> の値に置き換えられます。たとえば、ウィンドウの長さが3の場合、 <code><var>y</var>(1) = min ([<var>x</var>(1), <var>x</var>(1:2)])</code> であり、 <code><var>y</var>(end) = min ([<var>x</var>(end-1:end), <var>x</var>(end)])</code> 。
ru: Любые элементы окна вне массива данных заменяются значением <var>x</var> на границе. Например, с окном длиной 3 <code><var>y</var>(1) = min ([<var>x</var>(1), <var>x</var>(1:2)])</code> и <code><var>y</var>(end) = min ([<var>x</var>(end-1:end), <var>x</var>(end)])</code> .
zh_cn: 数据数组外部的所有窗口元素都将被边界处的 <var>x</var> 值替换。例如，对于一个长度为3的窗口， <code><var>y</var>(1) = min ([<var>x</var>(1), <var>x</var>(1:2)])</code> ，而 <code><var>y</var>(end) = min ([<var>x</var>(end-1:end), <var>x</var>(end)])</code> 。

source: Any window elements outside the data array are replaced by the value of <var>x</var> at the boundary. For example, with a window of length 3, <code><var>y</var>(1) = movmedian ([<var>x</var>(1), <var>x</var>(1:2)])</code>, and <code><var>y</var>(end) = movmedian ([<var>x</var>(end-1:end), <var>x</var>(end)])</code>.
es: Cualquier elemento de ventana fuera de la matriz de datos se reemplaza por el valor de <var>x</var> en el l&iacute;mite. Por ejemplo, con una ventana de longitud 3, <code><var>y</var>(1) = movmedian ([<var>x</var>(1), <var>x</var>(1:2)])</code> e <code><var>y</var>(end) = movmedian ([<var>x</var>(end-1:end), <var>x</var>(end)])</code> .
ja: データ配列外のウィンドウ要素は、境界で <var>x</var> の値に置き換えられます。たとえば、ウィンドウの長さが3の場合、 <code><var>y</var>(1) = movmedian ([<var>x</var>(1), <var>x</var>(1:2)])</code> と <code><var>y</var>(end) = movmedian ([<var>x</var>(end-1:end), <var>x</var>(end)])</code> 。
ru: Любые элементы окна вне массива данных заменяются значением <var>x</var> на границе. Например, для окна длиной 3 <code><var>y</var>(1) = movmedian ([<var>x</var>(1), <var>x</var>(1:2)])</code> и <code><var>y</var>(end) = movmedian ([<var>x</var>(end-1:end), <var>x</var>(end)])</code> .
zh_cn: 数据数组外部的所有窗口元素都将被边界处的 <var>x</var> 值替换。例如，对于一个长度为3的窗口， <code><var>y</var>(1) = movmedian ([<var>x</var>(1), <var>x</var>(1:2)])</code> ，而 <code><var>y</var>(end) = movmedian ([<var>x</var>(end-1:end), <var>x</var>(end)])</code> 。

source: Any window elements outside the data array are replaced by the value of <var>x</var> at the boundary. For example, with a window of length 3, <code><var>y</var>(1) = movprod ([<var>x</var>(1), <var>x</var>(1:2)])</code>, and <code><var>y</var>(end) = movprod ([<var>x</var>(end-1:end), <var>x</var>(end)])</code>.
es: Cualquier elemento de ventana fuera de la matriz de datos se reemplaza por el valor de <var>x</var> en el l&iacute;mite. Por ejemplo, con una ventana de longitud 3, <code><var>y</var>(1) = movprod ([<var>x</var>(1), <var>x</var>(1:2)])</code> e <code><var>y</var>(end) = movprod ([<var>x</var>(end-1:end), <var>x</var>(end)])</code> .
ja: データ配列外のウィンドウ要素は、境界で <var>x</var> の値に置き換えられます。たとえば、ウィンドウの長さが3の場合、 <code><var>y</var>(1) = movprod ([<var>x</var>(1), <var>x</var>(1:2)])</code> と <code><var>y</var>(end) = movprod ([<var>x</var>(end-1:end), <var>x</var>(end)])</code> 。
ru: Любые элементы окна вне массива данных заменяются значением <var>x</var> на границе. Например, с окном длиной 3 <code><var>y</var>(1) = movprod ([<var>x</var>(1), <var>x</var>(1:2)])</code> и <code><var>y</var>(end) = movprod ([<var>x</var>(end-1:end), <var>x</var>(end)])</code> .
zh_cn: 数据数组外部的所有窗口元素都将被边界处的 <var>x</var> 值替换。例如，对于一个长度为3的窗口， <code><var>y</var>(1) = movprod ([<var>x</var>(1), <var>x</var>(1:2)])</code> ，而 <code><var>y</var>(end) = movprod ([<var>x</var>(end-1:end), <var>x</var>(end)])</code> 。
