Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/octave/octave.*.011.xlf
Languages: es, ja, ru, zh_cn

source: A value of <code>info = 1</code> indicates that the solution has converged.
es: Un valor de <code>info = 1</code> indica que la soluci&oacute;n ha convergido.
ja: <code>info = 1</code> 値は、解が収束したことを示します。
ru: Значение <code>info = 1</code> указывает, что решение сходилось.
zh_cn: <code>info = 1</code> 值表示解决方案已经收敛。

source: A value of <var>zf</var> larger than 1 &ldquo;zooms in&rdquo; such that the scene appears magnified:
es: Un valor de <var>zf</var> mayor que 1 "acerca", de modo que la escena aparece ampliada:
ja: 1より大きい <var>zf</var> の値は、シーンが拡大して見えるように「ズームイン」します。
ru: Значение <var>zf</var> больше 1 &laquo;увеличивается&raquo;, так что сцена кажется увеличенной:
zh_cn: 大于1 的 <var>zf</var> 值会&ldquo;放大&rdquo;，以使场景放大显示：

source: A value smaller than 1 &ldquo;zooms out&rdquo; so the camera can see more of the scene:
es: Un valor menor que 1 "aleja" para que la c&aacute;mara pueda ver m&aacute;s de la escena:
ja: 1より小さい値は「ズームアウト」するため、カメラはより多くのシーンを見ることができます。
ru: Значение меньше 1 &laquo;уменьшает масштаб&raquo;, чтобы камера могла видеть большую часть сцены:
zh_cn: 小于1的值&ldquo;缩小&rdquo;，因此相机可以看到更多场景：

source: A variable is declared global by using a <code>global</code> declaration statement. The following statements are all global declarations.
ja: 変数は、 <code>global</code> 宣言ステートメントを使用してグローバルに宣言されます。次のステートメントはすべてグローバル宣言です。
zh_cn: 通过使用 <code>global</code> 声明语句将变量声明为全局变量。以下语句均为全局声明。

source: A variable may be declared global using a <code>global</code> declaration statement. The following statements are all global declarations.
es: Una variable puede declararse global mediante una declaraci&oacute;n de declaraci&oacute;n <code>global</code> . Las siguientes declaraciones son todas declaraciones globales.
ja: 変数は、 <code>global</code> 宣言ステートメントを使用してグローバルに宣言できます。次のステートメントはすべてグローバル宣言です。
ru: Переменная может быть объявлена ​​глобальной с помощью оператора <code>global</code> объявления. Следующие ниже операторы являются глобальными декларациями.
zh_cn: 可以使用 <code>global</code> 声明语句将变量声明为全局变量。以下语句均为全局声明。

source: A variable name is a valid expression by itself. It represents the variable&rsquo;s current value. Variables are given new values with <em>assignment operators</em> and <em>increment operators</em>. See <a href="assignment-ops#Assignment-Ops">Assignment Expressions</a>.
es: Un nombre de variable es una expresi&oacute;n v&aacute;lida por s&iacute; misma. Representa el valor actual de la variable. Las variables reciben nuevos valores con <em>operadores de asignaci&oacute;n</em> y <em>operadores de incremento</em> . Consulte <a href="assignment-ops#Assignment-Ops">Expresiones de asignaci&oacute;n</a> .
ja: 変数名はそれ自体が有効な式です。変数の現在の値を表します。変数には、<em>代入演算子</em>と<em>増分演算</em><em>子</em>を使用して新しい値が与えられ<em>ます</em>。<a href="assignment-ops#Assignment-Ops">割り当て式を</a>参照してください。
ru: Имя переменной само по себе является допустимым выражением. Он представляет текущее значение переменной. Переменным присваиваются новые значения с помощью <em>операторов присваивания</em> и <em>приращения</em> . См. <a href="assignment-ops#Assignment-Ops">Выражения присвоения</a> .
zh_cn: 变量名本身就是有效的表达式。它代表变量的当前值。使用<em>赋值运算符</em>和<em>增量运算符为</em>变量赋予新值。请参阅<a href="assignment-ops#Assignment-Ops">赋值表达式</a>。

source: A variable that has been declared <em>global</em> may be accessed from within a function body without having to pass it as a formal parameter.
es: Se puede acceder a una variable que se ha declarado <em>global</em> desde el cuerpo de una funci&oacute;n sin tener que pasarla como par&aacute;metro formal.
ja: <em>グローバル</em>として宣言された変数は、仮引数として渡さなくても、関数本体内からアクセスできます。
ru: Переменная, которая была объявлена <em>глобальной,</em> может быть доступна из тела функции без необходимости передавать ее как формальный параметр.
zh_cn: 可以从函数体内访问已声明为<em>全局</em>变量，而不必将其作为形式参数传递。

source: A variable that has been declared <em>persistent</em> within a function will retain its contents in memory between subsequent calls to the same function. The difference between persistent variables and global variables is that persistent variables are local in scope to a particular function and are not visible elsewhere.
es: Una variable que ha sido declarada <em>persistente</em> dentro de una funci&oacute;n retendr&aacute; su contenido en la memoria entre llamadas posteriores a la misma funci&oacute;n. La diferencia entre las variables persistentes y las variables globales es que las variables persistentes tienen un alcance local para una funci&oacute;n particular y no son visibles en otros lugares.
ja: 関数内で<em>永続的</em>であると宣言された変数は、同じ関数への後続の呼び出し間でその内容をメモリに保持します。永続変数とグローバル変数の違いは、永続変数は特定の関数のスコープ内でローカルであり、他の場所には表示されないことです。
ru: Переменная, которая была объявлена <em>постоянной</em> внутри функции, будет сохранять свое содержимое в памяти между последующими вызовами той же функции. Разница между постоянными переменными и глобальными переменными заключается в том, что постоянные переменные являются локальными в области видимости для конкретной функции и не видны в другом месте.
zh_cn: 在一个函数中声明为<em>持久性</em>的变量将在后续对该函数的调用之间将其内容保留在内存中。持久变量与全局变量之间的区别在于，持久变量在范围上是特定函数的局部变量，在其他地方不可见。

source: A vector is a 2-D array where one of the dimensions is equal to 1 (either 1xN or Nx1). As a consequence of this definition, a 1x1 array (a scalar) is also a vector.
ja: ベクトルは,次元の1つが1に等しい2次元配列です(1xNまたはNx1).この定義の結果として,1x1 の配列(スカラー)もベクトルになります.
zh_cn: 向量是一个二维数组,其中一个维数等于1(1xN或Nx1)。根据这个定义,1x1数组(标量)也是一个向量。

source: A vector is a 2-D array where one of the dimensions is equal to 1. As a consequence a 1x1 array, or scalar, is also a vector.
es: Un vector es un conjunto de 2 dimensiones donde una de las dimensiones es igual a 1.Por consiguiente,una matriz de 1x1,o escalar,es también un vector.
ja: ベクトルは,次元の1つが1に等しい2次元配列です.結果として,1x1の配列,またはスカラもまたベクトルです.
ru: Вектор-это двухмерный массив,в котором одно из измерений равно 1.Как следствие,массив 1x1,или скаляр,также является вектором.
zh_cn: 矢量是一个二维数组,其中一个维数等于1。因此,1x1数组或标量也是一个向量。

source: A vector of the following parameters that can be used to control the initial condition calculation.
es: Un vector de los siguientes parámetros que puede utilizarse para controlar el cálculo de la condición inicial.
ja: 初期条件の計算を制御するために使用できる以下のパラメータのベクトル。
ru: Вектор следующих параметров,который может быть использован для управления вычислением начального состояния.
zh_cn: 以下参数的向量,可以用来控制初始条件的计算。

source: A vector of the same length as the state specifying the type of inequality constraint. Each element of the vector corresponds to an element of the state and should be assigned one of the following codes
es: Un vector de la misma longitud que el estado que especifica el tipo de restricción de la desigualdad.Cada elemento del vector corresponde a un elemento del estado y se le debe asignar uno de los siguientes códigos
ja: 不等式制約の種類を指定する状態と同じ長さのベクトル。ベクトルの各要素は状態の要素に対応しており、以下のコードのいずれかを割り当てる必要があります。
ru: Вектор той же длины,что и состояние,определяющее тип ограничения неравенства.Каждому элементу вектора соответствует элемент состояния и ему должна быть присвоена одна из следующих кодов
zh_cn: 一个与状态长度相同的向量,说明不等式约束的类型。向量的每一个元素对应于状态的一个元素,应该被分配给以下代码之一:1.

source: A vector of the same length as the state vector. A nonzero element indicates that the corresponding element of the state vector is an algebraic variable (i.e., its derivative does not appear explicitly in the equation set).
es: Un vector de la misma longitud que el vector de estado.Un elemento distinto de cero indica que el elemento correspondiente del vector de estado es una variable algebraica (es decir,su derivada no aparece explícitamente en el conjunto de la ecuación).
ja: 状態ベクトルと同じ長さのベクトル.ゼロ以外の要素は状態ベクトルの対応する要素が代数変数であることを示します(すなわち、その微分が式集合の中に明示的に現れません)。
ru: Вектор той же длины,что и вектор состояния.Ненулевой элемент указывает на то,что соответствующим элементом вектора состояния является алгебраическая переменная (т.е.ее производная не появляется явно в наборе уравнений).
zh_cn: 一个与状态向量长度相同的向量,非零元素表示状态向量的对应元素是一个代数变量(即其导数没有明确出现在方程组中)。非零元素表示状态向量的相应元素是一个代数变量(即它的导数没有明确地出现在方程组中)。

source: A very basic <code>classdef</code> value class (see <a href="value-classes-vs_002e-handle-classes#Value-Classes-vs_002e-Handle-Classes">Value Classes vs. Handle Classes</a>) is defined by:
es: Una clase de valor <code>classdef</code> muy b&aacute;sica (ver <a href="value-classes-vs_002e-handle-classes#Value-Classes-vs_002e-Handle-Classes">Clases de valor frente a clases de </a>control ) se define por:
ja: 非常に基本的な <code>classdef</code> 値クラス（<a href="value-classes-vs_002e-handle-classes#Value-Classes-vs_002e-Handle-Classes">値クラスとハンドルクラスを</a>参照）は、次のように定義されます。
ru: <code>classdef</code> простой класс значений classdef (см. <a href="value-classes-vs_002e-handle-classes#Value-Classes-vs_002e-Handle-Classes">Классы значений и классы </a>дескрипторов ) определяется следующим образом:
zh_cn: 一个非常基本的 <code>classdef</code> 值类（请参阅<a href="value-classes-vs_002e-handle-classes#Value-Classes-vs_002e-Handle-Classes">值类与句柄类</a>）由以下方式定义：

source: A very common programming pattern is to increment an existing variable with a given value, like this
es: Un patrón de programación muy común es incrementar una variable existente con un valor dado,así
ja: 非常に一般的なプログラミングパターンは、次のように既存の変数を与えられた値でインクリメントすることです。
ru: Очень распространенный шаблон программирования состоит в инкременте существующей переменной с заданным значением,например,следующим образом
zh_cn: 一个非常常见的编程模式是用一个给定的值来递增一个现有的变量,就像下面这样

source: A very specific form of polynomial interpretation is the Pad&eacute; approximant. For control systems, a continuous-time delay can be modeled very simply with the approximant.
es: Una forma muy espec&iacute;fica de interpretaci&oacute;n polinomial es el aproximado de Pad&eacute;. Para los sistemas de control, un retardo de tiempo continuo se puede modelar de manera muy simple con el aproximado.
ja: 多項式解釈の非常に具体的な形式は、パデ近似です。制御システムの場合、連続時間遅延は近似を使用して非常に簡単にモデル化できます。
ru: Очень специфическая форма полиномиальной интерпретации - аппроксимация Паде. Для систем управления непрерывную задержку можно очень просто смоделировать с помощью аппроксимации.
zh_cn: 多项式解释的一种非常特殊的形式是Pad&eacute;近似值。对于控制系统，可以使用近似值非常简单地对连续时间延迟进行建模。

source: A waterfall plot is similar to a <code>meshz</code> plot except only mesh lines for the rows of <var>z</var> (x-values) are shown.
es: Una gr&aacute;fica de cascada es similar a una gr&aacute;fica <code>meshz</code> , excepto que solo se muestran las l&iacute;neas de malla para las filas de <var>z</var> (valores x).
ja: ウォーターフォールプロットは、 <var>z</var> （x値）の行のメッシュ線のみが表示されることを除いて、 <code>meshz</code> プロットに似ています。
ru: График водопада похож на график сетки, за исключением того, что <code>meshz</code> только линии сетки для строк <var>z</var> (значения x).
zh_cn: 瀑布图类似于 <code>meshz</code> 图，除了仅显示 <var>z</var> 行（x值）的网格线。

source: A. George, J.W.H. Liu.
ja: A.ジョージ、J.
ru: A.Джордж,Джей-Ви-Эйч Лю.

source: A.1 Oct-Files
es: A.1 Archivos de octubre
ja: A.1 オクトファイル
ru: A.1 Октябрь-файлы

source: A.1.1 Getting Started with Oct-Files
es: A.1.1 Empezando con los archivos de octubre
ja: A.1.1 Oct-Filesを使い始めよう
ru: A.1.1 Начало работы с октябрьскими файлами
zh_cn: A.1.1 开始使用Oct-Files。

source: A.1.10 Allocating Local Memory in Oct-Files
es: A.1.10 Asignación de la memoria local en los archivos de octubre
ja: A.1.10 Oct-Fileでのローカルメモリの割り当て
ru: А.1.10 Распределение локальной памяти в октябрьских файлах
zh_cn: A.1.10 在Oct-Files中分配本地内存

source: A.1.11 Input Parameter Checking in Oct-Files
es: A.1.11 Comprobación de los parámetros de entrada en los archivos de octubre
ja: A.1.11 Oct-Filesでの入力パラメータチェック
ru: А.1.11 Проверка параметров входа в октябрьских файлах
zh_cn: A.1.11 八进制文件中的输入参数检查

source: A.1.12 Exception and Error Handling in Oct-Files
es: A.1.12 Excepción y tratamiento de errores en los archivos de octubre
ja: A.1.12 Oct-Fileの例外とエラー処理
ru: A.1.12 Исключения и обработка ошибок в октябрьских файлах
zh_cn: A.1.12 Oct-Files的异常和错误处理

source: A.1.13 Documentation and Testing of Oct-Files
es: A.1.13 Documentación y pruebas de los archivos de octubre
ja: A.1.13 Oct-Fileの文書化とテスト
ru: А.1.13 Документация и тестирование октябрьских файлов
zh_cn: A.1.13 Oct-Files的文件和测试

source: A.1.2 Matrices and Arrays in Oct-Files
es: A.1.2 Matrices y matrices en los archivos de octubre
ja: A.1.2 Oct-Fileの行列と配列
ru: A.1.2 Матрицы и массивы в октябрьских файлах
zh_cn: A.1.2 八进制文件中的矩阵和数组

source: A.1.3 Character Strings in Oct-Files
es: A.1.3 Cadenas de caracteres en los archivos de octubre
ja: A.1.3 Oct-Fileの文字列
ru: A.1.3 Строки символов в октябрьских файлах
zh_cn: A.1.3 八进制文件中的字符字符串

source: A.1.4 Cell Arrays in Oct-Files
es: A.1.4 Matrices de células en archivos de octubre
ja: A.1.4 オクトファイルのセルアレイ
ru: A.1.4 Массивы клеток в октябрьских файлах
zh_cn: A.1.4 八角文件中的单元格阵列

source: A.1.5 Structures in Oct-Files
es: A.1.5 Estructuras en los archivos de octubre
ja: A.1.5 Oct-Filesの構造
ru: A.1.5 Структуры в октябрьских файлах
zh_cn: A.1.5 八角文件的结构

source: A.1.6 Sparse Matrices in Oct-Files
es: A.1.6 Matrices dispersas en los archivos de octubre
ja: A.1.6 Oct-Fileのスパース行列
ru: A.1.6 Раздельные матрицы в октябрьских файлах
zh_cn: A.1.6 Oct-Files中的稀疏矩阵

source: A.1.6.1 Array and Sparse Class Differences
es: A.1.6.1 Diferencias de clase de matriz y dispersión
ja: A.1.6.1 配列と疎なクラスの違い
ru: A.1.6.1 Массивные и разнесенные по классам различия
zh_cn: A.1.6.1 阵列和稀疏类的区别

source: A.1.6.2 Creating Sparse Matrices in Oct-Files
es: A.1.6.2 Creación de matrices dispersas en los archivos de octubre
ja: A.1.6.2 Oct-Fileでのスパース行列の作成
ru: A.1.6.2 Создание разделенных матриц в октябрьских файлах
zh_cn: A.1.6.2 在Oct-Files中创建稀疏矩阵

source: A.1.6.3 Using Sparse Matrices in Oct-Files
es: A.1.6.3 Uso de matrices dispersas en los archivos de octubre
ja: A.1.6.3 Oct-Fileでのスパース行列の使用
ru: A.1.6.3 Использование разделенных матриц в октябрьских файлах
zh_cn: A.1.6.3 在Oct-Files中使用稀疏矩阵。

source: A.1.7 Accessing Global Variables in Oct-Files
es: A.1.7 Acceso a las variables mundiales en los archivos de octubre
ja: A.1.7 Oct-Fileでのグローバル変数へのアクセス
ru: A.1.7 Доступ к глобальным переменным в октябрьских файлах
zh_cn: A.1.7 访问Oct-Files中的全局变量

source: A.1.8 Calling Octave Functions from Oct-Files
es: A.1.8 Llamar las funciones de octava desde los archivos de octubre
ja: A.1.8 Oct-FileからのOctave関数の呼び出し
ru: A.1.8 Вызов функций октавы из октябрьских файлов
zh_cn: A.1.8 从Oct-Files调用八度函数

source: A.1.9 Calling External Code from Oct-Files
es: A.1.9 Llamada del código externo desde los archivos de octubre
ja: A.1.9 Oct-Fileからの外部コードの呼び出し
ru: A.1.9 Вызов внешнего кода из Oct-Files
zh_cn: A.1.9 从八进制文件中调用外部代码

source: A.2 Mex-Files
es: A.2 Archivos mexicanos
ja: A.2 メックスファイル
ru: А.2 Мекс-Файлы

source: A.2.1 Getting Started with Mex-Files
es: A.2.1 Empezando con los Archivos-Mex
ja: A.2.1 Mex-Filesを始めるには
ru: А.2.1 Начало работы с мексиканскими файлами.
zh_cn: A.2.1 开始使用 Mex-Files

source: A.2.2 Working with Matrices and Arrays in Mex-Files
es: A.2.2 Trabajo con matrices y matrices en archivos mexicanos
ja: A.2.2 Mex-Fileでの行列と配列の操作
ru: A.2.2 Работа с матрицами и массивами в мексиканских файлах
zh_cn: A.2.2 在Mex-Files中使用矩阵和数组。

source: A.2.3 Character Strings in Mex-Files
es: A.2.3 Cadenas de caracteres en los archivos Mex
ja: A.2.3 Mex-Files の文字列
ru: А.2.3 Строки символов в мексиканских файлах
zh_cn: A.2.3 Mex-Files中的字符串

source: A.2.4 Cell Arrays with Mex-Files
es: A.2.4 Matrices de células con archivos Mex...
ja: A.2.4 メックスファイルを用いたセルアレイ
ru: A.2.4 Массивы клеток с мексиканскими файлами
zh_cn: A.2.4 带有Mex-Files的细胞阵列

source: A.2.5 Structures with Mex-Files
es: A.2.5 Estructuras con Archivos Mex
ja: A.2.5 Mex-Filesを用いた構造物
ru: A.2.5 Структуры с мексиканскими файлами
zh_cn: A.2.5 带有Mex-Files的结构。

source: A.2.6 Sparse Matrices with Mex-Files
es: A.2.6 Matrices dispersas con archivos MEX
ja: A.2.6 Mex-Fileを用いた疎行列
ru: A.2.6 Раздельные матрицы с мексиканскими файлами
zh_cn: A.2.6 带Mex-Files的稀疏矩阵

source: A.2.7 Calling Other Functions in Mex-Files
es: A.2.7 Llamar a otras funciones en los archivos Mex
ja: A.2.7 Mex-File での他の関数の呼び出し
ru: А.2.7 Вызов других функций в мексиканских файлах
zh_cn: A.2.7 调用Mex-Files中的其他函数

source: A.3 Standalone Programs
es: A.3 Programas independientes
ja: A.3 スタンドアロンプログラム
ru: A.3 Автономные программы
zh_cn: A.3 独立方案

source: A.4 Java Interface
es: A.4 Interfaz de Java
ja: A.4 Javaインタフェース
ru: A.4 Java-интерфейс
zh_cn: A.4 Java接口

source: A.4.1 Making Java Classes Available
es: A.4.1 Poner a disposición las clases de Java
ja: A.4.1 Javaクラスを利用可能にする
ru: А.4.1 Обеспечение доступности классов Java
zh_cn: A.4.1 使Java类可以使用

source: A.4.2 How to use Java from within Octave
es: A.4.2 Cómo usar Java desde dentro de Octava
ja: A.4.2 Octave内からJavaを使用する方法
ru: A.4.2 Как использовать Java изнутри Октавы.
zh_cn: A.4.2 如何在Octave中使用Java。

source: A.4.3 Set up the JVM
es: A.4.3 Establecer la JVM
ja: A.4.3 JVMのセットアップ
ru: A.4.3 Настройка JVM
zh_cn: A.4.3 设置JVM

source: A.4.4 Java Interface Functions
es: A.4.4 Funciones de la interfaz de Java
ja: A.4.4 Javaインタフェース関数
ru: A.4.4 Функции Java-интерфейса
zh_cn: A.4.4 Java接口函数

source: AA = balance (A)
es: AA=equilibrio (A)
ja: AA=残高(A
ru: АА=баланс (А)
zh_cn: AA=余额(A)

source: AA = balance (A, opt)
es: AA=equilibrio (A,optativo)
ja: AA=バランス(A、オプト
ru: AA=баланс (A,выбор)
zh_cn: AA=余额(A,选择)

source: API for portable 2-D and 3-D graphics (<a href="https://www.opengl.org">https://www.opengl.org</a>). An OpenGL implementation can be used to provide a renderer for Octave&rsquo;s graphics functions. Octave&rsquo;s OpenGL-based graphics functions usually outperform the gnuplot-based graphics functions because plot data can be rendered directly instead of sending data and commands to gnuplot for interpretation and rendering. Since Octave 4.0, the default graphics renderer (<code>"qt"</code>) has been OpenGL-based.
ja: ポータブル2Dおよび3Dグラフィックス用のAPI（<a href="https://www.opengl.org">https://www.opengl.org</a>）。OpenGL実装を使用して、Octaveのグラフィック関数のレンダラーを提供できます。OctaveのOpenGLベースのグラフィックス関数は通常gnuplotベースのグラフィックス関数よりも優れています。これは、解釈とレンダリングのためにデータとコマンドをgnuplotに送信する代わりに、プロットデータを直接レンダリングできるためです。Octave 4.0以降、デフォルトのグラフィックスレンダラー（ <code>"qt"</code> ）はOpenGLベースになっています。
zh_cn: 用于便携式2D和3D图形的API（<a href="https://www.opengl.org">https://www.opengl.org</a>）。OpenGL实现可用于为Octave的图形功能提供渲染器。Octave基于OpenGL的图形功能通常优于基于gnuplot的图形功能，因为可以直接绘制绘图数据，而不是将数据和命令发送到gnuplot进行解释和渲染。从Octave 4.0开始，默认的图形渲染器（ <code>"qt"</code> ）已基于OpenGL。

source: API for portable 2-D and 3-D graphics (<a href="https://www.opengl.org">https://www.opengl.org</a>). An OpenGL implementation is required to provide Octave&rsquo;s OpenGL-based graphics functions. Octave&rsquo;s OpenGL-based graphics functions usually outperform the gnuplot-based graphics functions because plot data can be rendered directly instead of sending data and commands to gnuplot for interpretation and rendering.
es: API para gr&aacute;ficos port&aacute;tiles 2-D y 3-D ( <a href="https://www.opengl.org">https://www.opengl.org</a> ). Se requiere una implementaci&oacute;n de OpenGL para proporcionar las funciones gr&aacute;ficas basadas en OpenGL de Octave. Las funciones gr&aacute;ficas basadas en OpenGL de Octave generalmente superan a las funciones gr&aacute;ficas basadas en gnuplot porque los datos de los gr&aacute;ficos se pueden representar directamente en lugar de enviar datos y comandos a gnuplot para su interpretaci&oacute;n y representaci&oacute;n.
ja: ポータブル2Dおよび3Dグラフィック用のAPI（<a href="https://www.opengl.org">https://www.opengl.org</a>）。OctaveのOpenGLベースのグラフィックス機能を提供するには、OpenGL実装が必要です。OctaveのOpenGLベースのグラフィックス関数は通常、gnuplotベースのグラフィックス関数よりも優れています。これは、解釈とレンダリングのためにgnuplotにデータとコマンドを送信する代わりに、プロットデータを直接レンダリングできるためです。
ru: API для переносимой двухмерной и трехмерной графики ( <a href="https://www.opengl.org">https://www.opengl.org</a> ). Реализация OpenGL требуется для предоставления графических функций Octave на основе OpenGL. Графические функции Octave на основе OpenGL обычно превосходят графические функции на основе gnuplot, поскольку данные графика можно визуализировать напрямую, вместо того, чтобы отправлять данные и команды в gnuplot для интерпретации и визуализации.
zh_cn: 适用于便携式2D和3D图形的API（<a href="https://www.opengl.org">https://www.opengl.org</a>）。要提供Octave基于OpenGL的图形功能，需要使用OpenGL实现。Octave基于OpenGL的图形功能通常优于基于gnuplot的图形功能，因为可以直接绘制绘图数据，而不是将数据和命令发送到gnuplot进行解释和渲染。

source: ASCII art
es: Arte ASCII
ja: アスキーアート
ru: ASCII искусство
zh_cn: ASCII艺术

source: ASCII mode is only appropriate for text files as it will convert the remote host&rsquo;s newline representation to the local host&rsquo;s newline representation.
es: El modo ASCII solo es apropiado para archivos de texto, ya que convertir&aacute; la representaci&oacute;n de nueva l&iacute;nea del host remoto en la representaci&oacute;n de nueva l&iacute;nea del host local.
ja: ASCIIモードは、リモートホストの改行表現をローカルホストの改行表現に変換するため、テキストファイルにのみ適しています。
ru: Режим ASCII подходит только для текстовых файлов, поскольку он преобразует представление новой строки удаленного хоста в представление новой строки локального хоста.
zh_cn: ASCII模式仅适用于文本文件，因为它将将远程主机的换行表示形式转换为本地主机的换行表示形式。

source: ASCII table
es: Tabla ASCII
ja: アスキー表
ru: ASCII-таблица
zh_cn: ASCII表

source: ATLAS instead of reference <small>BLAS</small> and <small>LAPACK</small>
es: ATLAS en lugar de referencia <small>BLAS</small> y <small>LAPACK</small>
ja: 参照<small>BLAS</small>および<small>LAPACKの</small>代わりにATLAS<small></small>
ru: ATLAS вместо ссылки <small>BLAS</small> и <small>LAPACK</small>
zh_cn: ATLAS代替参考<small>BLAS</small>和<small>LAPACK</small>

source: AWK, sed, and other Unix utilities
es: AWK,sed,y otras utilidades de Unix
ja: AWK,sed,その他の Unix ユーティリティ
ru: AWK,sed и другие утилиты Unix.
zh_cn: AWK、sed和其他Unix工具

source: A_LO = tril (A)
ja: A_LO=トリル(A

source: Abbreviated month name
es: Nombre abreviado del mes
ja: 月名の略称
ru: сокращённое наименование месяца
zh_cn: 缩略月名

source: Abbreviated weekday name
es: Nombre abreviado del día de la semana
ja: 平日の略称
ru: сокращённое название дня недели
zh_cn: 缩写工作日名称

source: Absolute Central Moment. The moment about the mean ignoring sign defined as
es: Momento central absoluto.El momento sobre el signo medio de ignorar definido como
ja: 絶対中心モーメント。として定義された平均無視符号に関するモーメント。
ru: Абсолютно центральный момент.Момент о среднем знаке игнорирования,определяемый как
zh_cn: 绝对中心矩。关于均值忽略符号的时刻,定义为

source: Absolute Raw Moment. The moment about zero ignoring sign defined as
es: Un momento absolutamente crudo.El momento sobre el cero ignorando el signo definido como
ja: 絶対生モーメント。次のように定義された符号を無視したゼロに関するモーメント
ru: Абсолютный Сырой Момент.Момент о нулевом игнорирующем знаке,определяемом как
zh_cn: 绝对原始力矩。关于零的时刻,忽略符号,定义为

source: Absolute error tolerance.
es: Tolerancia absoluta a los errores.
ja: 絶対的な誤差の許容範囲。
ru: Абсолютная погрешность.
zh_cn: 绝对容错率。

source: Absolute tolerance for single precision; may be zero for pure relative error test.
es: Tolerancia absoluta para la precisión simple;puede ser cero para la prueba de error relativo puro.
ja: 単精度の絶対許容差;純粋な相対誤差テストではゼロになることがあります。
ru: Абсолютный допуск для одной точности;может быть равен нулю для теста на чистую относительную погрешность.
zh_cn: 单一精度的绝对公差;纯相对误差测试时可能为零。

source: Absolute tolerance used to check if the current basic solution is dual feasible. It is not recommended that you change this parameter unless you have a detailed understanding of its purpose.
es: Tolerancia absoluta utilizada para comprobar si la solución básica actual es doblemente factible.No se recomienda cambiar este parámetro a menos que se tenga un entendimiento detallado de su propósito.
ja: 現在の基本解がデュアル・フィージビリティーであるかどうかをチェックするために使用される絶対的な許容値です。このパラメータの目的を詳細に理解していない限り、このパラメータを変更することはお勧めしません。
ru: Абсолютный допуск,используемый для проверки того,является ли текущее базовое решение двояким.Не рекомендуется изменять этот параметр,если у вас нет подробного понимания его назначения.
zh_cn: 绝对容差,用于检查当前基本解是否具有双重可行性。除非您对其目的有详细的了解,否则不建议您更改该参数。
