Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/octave/octave.*.020.xlf
Languages: es, ru, zh_cn

source: This chapter describes the functions that are available to allow you to get information about what is happening outside of Octave, while it is still running, and use this information in your program. For example, you can get information about environment variables, the current time, and even start other programs from the Octave prompt.
es: En este capítulo se describen las funciones que están disponibles para permitirle obtener información sobre lo que está sucediendo fuera de Octava,mientras está en funcionamiento,y utilizar esta información en su programa.Por ejemplo,puede obtener información sobre las variables de entorno,la hora actual e incluso iniciar otros programas desde el indicador de Octava.
ru: В этой главе описываются функции,которые доступны для получения информации о том,что происходит за пределами Октавы,пока она еще запущена,и использования этой информации в Вашей программе.Например,Вы можете получить информацию о переменных окружения,текущем времени и даже запустить другие программы из подсказки Октава.
zh_cn: 本章介绍了一些可用的功能,这些功能可以让你在Octave还在运行的时候,获取Octave外部发生的信息,并在你的程序中使用这些信息。例如,你可以从Octave提示中获取环境变量、当前时间的信息,甚至可以启动其他程序。

source: This chapter describes the signal processing and fast Fourier transform functions available in Octave. Fast Fourier transforms are computed with the <small>FFTW</small> or <small>FFTPACK</small> libraries depending on how Octave is built.
es: Este cap&iacute;tulo describe el procesamiento de se&ntilde;ales y las funciones de transformaci&oacute;n r&aacute;pida de Fourier disponibles en Octave. Las transformadas r&aacute;pidas de Fourier se calculan con las bibliotecas <small>FFTW</small> o <small>FFTPACK</small> dependiendo de c&oacute;mo se construya Octave.
ru: В этой главе описаны функции обработки сигналов и быстрого преобразования Фурье, доступные в Octave. Быстрые преобразования Фурье вычисляются с <small>помощью</small> библиотек <small>FFTW</small> или <small>FFTPACK в</small> зависимости от того, как построен Octave.
zh_cn: 本章介绍八度中可用的信号处理和快速傅立叶变换功能。快速傅立叶变换是使用<small>FFTW</small>或<small>FFTPACK</small>库计算的，具体取决于八度的构建方式。

source: This chapter discusses the means of constructing a user class, how to query and set the properties of a class, and how to overload operators and functions. Throughout this chapter real code examples are given using a class designed for polynomials.
es: En este capítulo se examinan los medios para construir una clase de usuario,cómo consultar y establecer las propiedades de una clase y cómo sobrecargar a los operadores y las funciones.A lo largo de este capítulo se dan ejemplos de código real utilizando una clase diseñada para polinomios.
ru: В этой главе обсуждаются средства построения пользовательского класса,как запрашивать и устанавливать свойства класса,а также как перегружать операторы и функции.На протяжении всей главы приводятся реальные примеры кода с использованием класса,предназначенного для полиномов.
zh_cn: 本章讨论了构造用户类的方法,如何查询和设置类的属性,以及如何重载运算符和函数。在本章中,用一个为多项式设计的类给出了实际的代码示例。

source: This chapter discusses vectorization and other techniques for writing faster code.
es: Este capítulo trata de la vectorización y otras técnicas para escribir un código más rápido.
ru: В этой главе рассматривается векторизация и другие техники для написания более быстрого кода.
zh_cn: 本章讨论了矢量化和其他技术,以便编写更快的代码。

source: This chapter documents the linear algebra functions provided in Octave. Reference material for many of these functions may be found in Golub and Van Loan,
es: Este capítulo documenta las funciones de álgebra lineal proporcionadas en Octava.El material de referencia para muchas de estas funciones se puede encontrar en Golub y Van Loan,
ru: В данной главе документально подтверждены функции линейной алгебры,представленные в октаве.Справочные материалы по многим из этих функций можно найти в изданиях "Голуб" и "Ван Лоан",
zh_cn: 本章记录了Octave中提供的线性代数函数,其中许多函数的参考资料可以在Golub和Van Loan中找到。其中许多函数的参考资料可以在Golub和Van Loan中找到。

source: This chapter explains some of Octave&rsquo;s basic features, including how to start an Octave session, get help at the command prompt, edit the command line, and write Octave programs that can be executed as commands from your shell.
es: Este cap&iacute;tulo explica algunas de las caracter&iacute;sticas b&aacute;sicas de Octave, incluyendo c&oacute;mo iniciar una sesi&oacute;n de Octave, obtener ayuda en la l&iacute;nea de comandos, editar la l&iacute;nea de comandos y escribir programas de Octave que se pueden ejecutar como comandos desde su shell.
ru: В этой главе объясняются некоторые из основных функций Octave, включая то, как запустить сеанс Octave, получить справку из командной строки, отредактировать командную строку и написать программы Octave, которые могут выполняться как команды из вашей оболочки.
zh_cn: 本章介绍了Octave的一些基本功能，包括如何启动Octave会话，如何在命令提示符下获得帮助，编辑命令行以及编写可以从Shell作为命令执行的Octave程序。

source: This chapter illustrates user-defined classes and object oriented programming through a custom class designed for polynomials. This class was chosen for its simplicity which does not distract unnecessarily from the discussion of the programming features of Octave. Even so, a bit of background on the goals of the polynomial class is necessary before the syntax and techniques of Octave object oriented programming are introduced.
es: Este capítulo ilustra las clases definidas por el usuario y la programación orientada a objetos a través de una clase personalizada diseñada para polinomios.Esta clase fue elegida por su simplicidad que no distrae innecesariamente de la discusión de las características de programación de Octava.Aun así,es necesario conocer un poco los objetivos de la clase polinómica antes de introducir la sintaxis y las técnicas de la programación orientada a objetos de Octava.
ru: Эта глава иллюстрирует пользовательские классы и объектно-ориентированное программирование через пользовательский класс,предназначенный для полиномов.Данный класс был выбран за его простоту,не отвлекающую от обсуждения особенностей программирования октавы.Тем не менее,прежде чем вводить синтаксис и приемы объектно-ориентированного программирования Октавы,необходимо немного подумать о задачах класса полиномов.
zh_cn: 本章通过一个为多项式设计的自定义类来说明用户定义的类和面向对象的编程。选择这个类是因为它的简单性不会不必要地分散对Octave编程特性的讨论。即便如此,在介绍Octave面向对象编程的语法和技术之前,有必要先了解一下多项式类的目标背景。

source: This class is designed to allow easy parsing of function arguments. The class supports four types of arguments:
es: Esta clase está diseñada para permitir un fácil análisis de los argumentos de la función.La clase soporta cuatro tipos de argumentos:
ru: Данный класс предназначен для легкого разбора аргументов функции.Класс поддерживает четыре типа аргументов:
zh_cn: 这个类的设计是为了方便解析函数参数。该类支持四种类型的参数。

source: This code makes the repetitive structure of the problem more explicit, making the code easier to read, and hence maintain. Also, if the variable <code>X</code> should change its name, only one line would need changing compared to one line per case when <code>if</code> statements are used.
es: Este c&oacute;digo hace que la estructura repetitiva del problema sea m&aacute;s expl&iacute;cita, lo que hace que el c&oacute;digo sea m&aacute;s f&aacute;cil de leer y, por lo tanto, de mantener. Adem&aacute;s, si la variable <code>X</code> cambiara su nombre, solo se necesitar&iacute;a cambiar una l&iacute;nea en comparaci&oacute;n con una l&iacute;nea por caso cuando se usan declaraciones <code>if</code> .
ru: Этот код делает повторяющуюся структуру проблемы более явной, облегчая чтение и, следовательно, поддержку кода. Кроме того, если переменная <code>X</code> должна изменить свое имя, потребуется изменить только одну строку по сравнению с одной строкой на случай, когда используются операторы <code>if</code> .
zh_cn: 该代码使问题的重复结构更加明确，使代码更易于阅读和维护。同样，如果变量 <code>X</code> 应该更改其名称， <code>if</code> 在使用if语句的情况下，只需更改一行，而在每种情况下则只需更改一行。

source: This code works by first evaluating the expression <code>3:10</code>, to produce a range of values from 3 to 10 inclusive. Then the variable <code>i</code> is assigned the first element of the range and the body of the loop is executed once. When the end of the loop body is reached, the next value in the range is assigned to the variable <code>i</code>, and the loop body is executed again. This process continues until there are no more elements to assign.
es: Este c&oacute;digo funciona evaluando primero la expresi&oacute;n <code>3:10</code> , para producir un rango de valores de 3 a 10 inclusive. Luego, a la variable <code>i</code> se le asigna el primer elemento del rango y el cuerpo del ciclo se ejecuta una vez. Cuando se alcanza el final del cuerpo del bucle, el siguiente valor del rango se asigna a la variable <code>i</code> , y el cuerpo del bucle se ejecuta nuevamente. Este proceso contin&uacute;a hasta que no hay m&aacute;s elementos para asignar.
ru: Этот код работает, сначала вычисляя выражение <code>3:10</code> , чтобы получить диапазон значений от 3 до 10 включительно. Затем переменной <code>i</code> присваивается первый элемент диапазона, и тело цикла выполняется один раз. Когда достигается конец тела цикла, следующее значение в диапазоне присваивается переменной <code>i</code> , и тело цикла выполняется снова. Этот процесс продолжается до тех пор, пока не останется больше элементов для назначения.
zh_cn: 该代码的工作方式是首先对表达式 <code>3:10</code> 求值，以产生3到10（含）之间的值范围。然后，将变量 <code>i</code> 分配给范围的第一个元素，并且循环主体执行一次。当到达循环体的末尾时，范围内的下一个值将分配给变量 <code>i</code> ，并再次执行循环体。此过程将继续进行，直到没有其他要分配的元素为止。

source: This colormap gives a sepia tone when used on grayscale images.
es: Este mapa de color da un tono sepia cuando se usa en imágenes en escala de grises.
ru: Эта цветовая карта дает тон сепии при использовании на изображениях с градациями серого.
zh_cn: 当使用在灰度图像上时,该彩色地图会呈现出深褐色的色调。

source: This colormap varies from black to white going though blue, green, and red tones while maintaining a monotonically increasing perception of intensity. This is achieved by traversing a color cube from black to white through a helix, hence the name cubehelix, while taking into account the perceived brightness of each channel according to the NTSC specifications from 1953.
es: Este mapa de colores varía del negro al blanco pasando por los tonos azules,verdes y rojos mientras mantiene una percepción monótona de la intensidad.Esto se logra atravesando un cubo de color de negro a blanco a través de una hélice,de ahí el nombre de cubehelix,mientras se tiene en cuenta el brillo percibido de cada canal según las especificaciones del NTSC de 1953.
ru: Эта цветовая карта варьируется от черного до белого,проходя через синие,зеленые и красные тона,сохраняя при этом монотонно усиливающееся восприятие интенсивности.Это достигается путем перемещения цветового куба от черного к белому через спираль,отсюда и название кубегликса,с учетом воспринимаемой яркости каждого канала согласно спецификациям NTSC от 1953 года.
zh_cn: 这个彩色图从黑到白经过蓝、绿、红三色,同时保持单调地增加感知强度。这是通过一个颜色立方体从黑到白通过螺旋线,因此被称为立方体螺旋线,同时根据1953年的NTSC规范考虑到每个通道的感知亮度来实现的。

source: This command fixes the camera&rsquo;s viewing direction (<code>camtarget() - campos()</code>), camera up vector (see <a href="#XREFcamup">camup</a>) and viewing angle (see <a href="#XREFcamva">camva</a>). The camera target (see <a href="#XREFcamtarget">camtarget</a>) and camera position (see <a href="#XREFcampos">campos</a>) are changed.
es: Este comando fija la direcci&oacute;n de visualizaci&oacute;n de la c&aacute;mara ( <code>camtarget() - campos()</code> ), el vector de c&aacute;mara hacia arriba (ver <a href="#XREFcamup">camup</a> ) y el &aacute;ngulo de visi&oacute;n (ver <a href="#XREFcamva">camva</a> ). El objetivo de la c&aacute;mara (ver <a href="#XREFcamtarget">camtarget</a> ) y la posici&oacute;n de la c&aacute;mara (v&eacute;ase <a href="#XREFcampos">Campos</a> ) se cambian.
ru: Эта команда фиксирует направление обзора камеры ( <code>camtarget() - campos()</code> ), вектор вверх камеры (см. <a href="#XREFcamup">Camup</a> ) и угол обзора (см. <a href="#XREFcamva">Camva</a> ). Цель камеры (см. <a href="#XREFcamtarget">Camtarget</a> ) и положение камеры (см <a href="#XREFcampos">campos</a> ) изменены.
zh_cn: 此命令固定相机的观看方向（ <code>camtarget() - campos()</code> ），相机向上矢量（请参见<a href="#XREFcamup">camup</a>）和视角（请参见<a href="#XREFcamva">camva</a>）。摄像机目标（请参见<a href="#XREFcamtarget">camtarget</a>）和摄像机位置（请参见<a href="#XREFcampos">campos</a>）已更改。

source: This command only affects the display of numbers, but not how they are stored or computed. To change the internal representation from the default double use one of the conversion functions such as <code>single</code>, <code>uint8</code>, <code>int64</code>, etc.
es: Este comando solo afecta la visualizaci&oacute;n de los n&uacute;meros, pero no c&oacute;mo se almacenan o calculan. Para cambiar la representaci&oacute;n interna del doble predeterminado, use una de las funciones de conversi&oacute;n como <code>single</code> , <code>uint8</code> , <code>int64</code> , etc.
ru: Эта команда влияет только на отображение чисел, но не на то, как они хранятся или вычисляются. Чтобы изменить внутреннее представление с двойного по умолчанию, используйте одну из функций преобразования, например, <code>single</code> , <code>uint8</code> , <code>int64</code> и т. Д.
zh_cn: 此命令仅影响数字的显示，而不影响数字的存储或计算方式。要从默认的double更改内部表示，请使用转换函数之一，例如 <code>single</code> ， <code>uint8</code> ， <code>int64</code> 等。

source: This command will plot <code>y</code> with red circles, <code>y2</code> with solid lines, <code>y3</code> with solid magenta lines, and <code>y4</code> with points displayed as &lsquo;
es: Este comando trazar&aacute; <code>y</code> con c&iacute;rculos rojos, <code>y2</code> con l&iacute;neas continuas, <code>y3</code> con l&iacute;neas s&oacute;lidas magenta e <code>y4</code> con puntos mostrados como '
ru: Эта команда построит график <code>y</code> с красными кружками, <code>y2</code> со сплошными линиями, <code>y3</code> с сплошными пурпурными линиями и <code>y4</code> с точками, отображаемыми как '
zh_cn: 此命令将绘制 <code>y</code> 用红色圆圈， <code>y2</code> 用实线， <code>y3</code> 用实线品红，和 <code>y4</code> 与点显示为'

source: This command will plot the data in the variable <code>b</code>, with points displayed as &lsquo;
es: Este comando trazar&aacute; los datos en la variable <code>b</code> , con los puntos mostrados como '
ru: Эта команда отобразит данные в переменной <code>b</code> с точками, отображаемыми как '
zh_cn: 此命令将在变量 <code>b</code> 中绘制数据，点显示为'

source: This constructor can <strong>only</strong> be used with matrix types.
es: Este constructor <strong>solo se</strong> puede utilizar con tipos de matriz.
ru: Этот конструктор можно использовать <strong>только</strong> с матричными типами.
zh_cn: 该构造函数<strong>只能</strong>与矩阵类型一起使用。

source: This creates a 2-by-9 character matrix.
es: Esto crea una matriz de caracteres de 2 por 9.
ru: Это создает матрицу 2 на 9 символов.
zh_cn: 这将创建一个2乘9的字符矩阵。

source: This creates a N-by-2 matrix <code>nodes</code> and a E-by-3 matrix <code>elems</code> with values, which define finite element triangles:
es: Esto crea una matriz de N-por-2 <code>nodes</code> y una matriz de E-por-3 <code>elems</code> con valores, que definen tri&aacute;ngulos de elementos finitos:
ru: Это создает N-на-2 матрицы <code>nodes</code> и E-от-3 - матрицу <code>elems</code> со значениями, которые определяют конечные треугольники элементов:
zh_cn: 这就形成了一个n乘2矩阵 <code>nodes</code> 和一个E-3矩阵 <code>elems</code> 的与值，其定义有限元三角形：

source: This creates a sparse matrix with the same structure as <var>S</var>.
es: Esto crea una matriz dispersa con la misma estructura que <var>S</var> .
ru: Это создает разреженную матрицу с той же структурой , как <var>S</var> .
zh_cn: 这将创建一个结构与 <var>S</var> 相同的稀疏矩阵。

source: This creates the same matrix as previously. Again, although not strictly necessary, it is significantly faster if the sparse matrix is created and the elements are added in column-major ordering. The reason for this is that when elements are inserted at the end of the current list of known elements then no element in the matrix needs to be moved to allow the new element to be inserted; Only the column indices need to be updated.
es: Esto crea la misma matriz que antes.De nuevo,aunque no es estrictamente necesario,es significativamente más rápido si se crea la matriz dispersa y se añaden los elementos en orden de columnas.La razón de ello es que cuando se insertan los elementos al final de la lista actual de elementos conocidos,entonces no es necesario mover ningún elemento de la matriz para permitir la inserción del nuevo elemento;sólo es necesario actualizar los índices de las columnas.
ru: Это создает ту же матрицу,что и раньше.Опять же,хотя это и не является строго необходимым,но значительно быстрее,если создается разреженная матрица и элементы добавляются в порядке столбцов-мажор.Причина этого заключается в том,что когда элементы вставляются в конец текущего списка известных элементов,то ни один элемент в матрице не нужно перемещать,чтобы позволить вставить новый элемент;нужно обновлять только индексы столбцов.
zh_cn: 这将创建与之前相同的矩阵。同样,虽然不是严格意义上的必要,但如果创建稀疏矩阵并按列-主排序添加元素,速度会明显加快。这样做的原因是,当元素被插入到当前已知元素列表的末尾时,矩阵中的任何元素都不需要移动,以便插入新的元素;只需要更新列索引。

source: This document corresponds to Octave version 5.1.0.
es: Este documento corresponde a la versión 5.1.0 de Octava.
ru: Этот документ соответствует версии Октавы 5.1.0.
zh_cn: 本文档对应Octave 5.1.0版本。

source: This document corresponds to Octave version 6.1.0.
zh_cn: 本文档对应Octave 6.1.0版本。

source: This error message has several parts, and gives quite a bit of information to help you locate the source of the error. The messages are generated from the point of the innermost error, and provide a traceback of enclosing expressions and function calls.
es: Este mensaje de error tiene varias partes,y da bastante información para ayudar a localizar la fuente del error.Los mensajes se generan desde el punto del error más interno,y proporcionan un rastro de las expresiones y llamadas a funciones que lo rodean.
ru: Это сообщение об ошибке состоит из нескольких частей и дает довольно много информации,которая поможет вам найти источник ошибки.Сообщения генерируются из точки самой сокровенной ошибки и обеспечивают трассировку вложенных выражений и вызовов функций.
zh_cn: 这个错误信息有几个部分,并提供了相当多的信息来帮助你定位错误的来源。这些信息是从最内部的错误点生成的,并提供了包围表达式和函数调用的回溯。

source: This example creates a variable <code>fib</code> that contains the first ten elements of the Fibonacci sequence.
es: Este ejemplo crea una variable <code>fib</code> que contiene los primeros diez elementos de la secuencia de Fibonacci.
ru: В этом примере создается переменная <code>fib</code> , содержащая первые десять элементов последовательности Фибоначчи.
zh_cn: 本示例创建一个变量 <code>fib</code> ，其中包含Fibonacci序列的前十个元素。

source: This example demonstrates most of the features needed to link to an external Fortran function, including passing arrays and strings, as well as exception handling. Both the Fortran and C++ files need to be compiled in order for the example to work.
es: Este ejemplo demuestra la mayoría de las características necesarias para vincularse a una función Fortran externa,incluidos los arreglos de paso y las cuerdas,así como el manejo de excepciones.Tanto los archivos de Fortran como los de C++necesitan ser compilados para que el ejemplo funcione.
ru: Этот пример демонстрирует большинство функций,необходимых для связи с внешней функцией Fortran,включая передачу массивов и строк,а также обработку исключений.Для работы примера необходимо скомпилировать как Fortran,так и C++файлы.
zh_cn: 这个例子演示了链接到外部Fortran函数所需的大部分功能,包括传递数组和字符串,以及异常处理。Fortran和C++文件都需要编译,以便这个例子能正常工作。

source: This example shows the use of the &lsquo;
es: Este ejemplo muestra el uso de '
ru: В этом примере показано использование символа '
zh_cn: 此示例说明了&ldquo;

source: This example uses ILU as preconditioner for a random FEM-Matrix, which has a large condition number. Without <var>L</var> and <var>U</var> BICG would not converge.
es: Este ejemplo utiliza ILU como preacondicionador para una matriz FEM aleatoria, que tiene un n&uacute;mero de condici&oacute;n grande. Sin <var>L</var> y <var>U</var> BICG no converger&iacute;a.
ru: В этом примере ILU используется в качестве предобуславливателя для случайной FEM-матрицы, которая имеет большое число условий. Без <var>L</var> и <var>U</var> BICG не сойдется.
zh_cn: 此示例将ILU用作条件数较大的随机FEM-Matrix的前置条件。没有 <var>L</var> 和 <var>U</var> , BICG将不会收敛。

source: This expression causes the variable <var>x</var> to be decremented. The value of the expression is the <em>old</em> value of <var>x</var>.
es: Esta expresi&oacute;n hace que la variable <var>x</var> se reduzca. El valor de la expresi&oacute;n es el <em>antiguo</em> valor de <var>x</var> .
ru: Это выражение вызывает уменьшение переменной <var>x</var> . Значение выражения - это <em>старое</em> значение <var>x</var> .
zh_cn: 此表达式使变量 <var>x</var> 减小。表达式的值是 <var>x</var> 的<em>旧</em>值。

source: This expression causes the variable <var>x</var> to be incremented. The value of the expression is the <em>old</em> value of <var>x</var>.
es: Esta expresi&oacute;n hace que se incremente la variable <var>x</var> . El valor de la expresi&oacute;n es el <em>antiguo</em> valor de <var>x</var> .
ru: Это выражение приводит к увеличению переменной <var>x</var> . Значение выражения - это <em>старое</em> значение <var>x</var> .
zh_cn: 该表达式使变量 <var>x</var> 递增。表达式的值是 <var>x</var> 的<em>旧</em>值。

source: This expression decrements the variable <var>x</var>. The value of the expression is the <em>new</em> value of <var>x</var>. It is equivalent to the expression <code><var>x</var> = <var>x</var> - 1</code>.
es: Esta expresi&oacute;n disminuye la variable <var>x</var> . El valor de la expresi&oacute;n es el <em>nuevo</em> valor de <var>x</var> . Es equivalente a la expresi&oacute;n <code><var>x</var> = <var>x</var> - 1</code> .
ru: Это выражение уменьшает переменную <var>x</var> . Значение выражения - это <em>новое</em> значение <var>x</var> . Это эквивалентно выражению <code><var>x</var> = <var>x</var> - 1</code> .
zh_cn: 此表达式将变量 <var>x</var> 减1。表达式的值是 <var>x</var> 的<em>新</em>值。它等效于表达式 <code><var>x</var> = <var>x</var> - 1</code> = <var>x</var> -1。

source: This expression increments the variable <var>x</var>. The value of the expression is the <em>new</em> value of <var>x</var>. It is equivalent to the expression <code><var>x</var> = <var>x</var> + 1</code>.
es: Esta expresi&oacute;n incrementa la variable <var>x</var> . El valor de la expresi&oacute;n es el <em>nuevo</em> valor de <var>x</var> . Es equivalente a la expresi&oacute;n <code><var>x</var> = <var>x</var> + 1</code> .
ru: Это выражение увеличивает переменную <var>x</var> . Значение выражения - это <em>новое</em> значение <var>x</var> . Это эквивалентно выражению <code><var>x</var> = <var>x</var> + 1</code> .
zh_cn: 该表达式使变量 <var>x</var> 递增。表达式的值是 <var>x</var> 的<em>新</em>值。它等效于表达式 <code><var>x</var> = <var>x</var> + 1</code> = <var>x</var> + 1。

source: This file can be used to make changes to the default Octave environment for a particular project. Octave searches for this file in the current directory after it reads
es: Este archivo puede utilizarse para hacer cambios en el entorno de la Octava por defecto para un proyecto en particular.Octava busca este archivo en el directorio actual después de leer
ru: Этот файл может быть использован для внесения изменений в окружение Октавы по умолчанию для конкретного проекта.Октава ищет этот файл в текущем каталоге после его прочтения
zh_cn: 这个文件可以用来对特定项目的默认Octave环境进行修改。Octave在读取到该文件后,会在当前目录下搜索该文件。
