Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/octave/octave.*.020.xlf
Languages: es, ru, zh_cn

source: This option allows for truncation of intermediate floating point results in calculations. It is only necessary for certain platforms.
es: Esta opción permite el truncamiento de los resultados de la coma flotante intermedia en los cálculos.Sólo es necesaria para ciertas plataformas.
ru: Эта опция позволяет усечь промежуточные результаты с плавающей точкой в вычислениях.Это необходимо только для определенных платформ.
zh_cn: 这个选项允许在计算中截断中间的浮点结果。只有在某些平台上才需要这个选项。

source: This option exists for <small>MATLAB</small> compatibility, but has no effect. For maximum performance when reading multiple images from a single file, use the <code>"Index"</code> option.
es: Esta opci&oacute;n existe para compatibilidad con <small>MATLAB</small> , pero no tiene ning&uacute;n efecto. Para obtener el m&aacute;ximo rendimiento al leer varias im&aacute;genes de un solo archivo, utilice la opci&oacute;n <code>"Index"</code> .
ru: Эта опция существует для совместимости с <small>MATLAB</small> , но не имеет никакого эффекта. Для максимальной производительности при чтении нескольких изображений из одного файла используйте параметр <code>"Index"</code> .
zh_cn: 存在此选项是为了与<small>MATLAB</small>兼容，但无效。为了从单个文件中读取多个图像时获得最佳性能，请使用 <code>"Index"</code> 选项。

source: This option is accepted for backward compatibility but is ignored. Octave can now support multi-dimensional HDF data and automatically modifies variable names if they are invalid Octave identifiers.
es: Esta opción se acepta para la compatibilidad retroactiva pero se ignora.Octave puede ahora soportar datos HDF multidimensionales y modifica automáticamente los nombres de las variables si son identificadores de Octave inválidos.
ru: Эта опция принимается для обратной совместимости,но игнорируется.Октава теперь может поддерживать многомерные данные HDF и автоматически модифицирует имена переменных,если они являются недействительными идентификаторами октавы.
zh_cn: 为了向后兼容,这个选项被接受,但会被忽略。Octave现在可以支持多维HDF数据,如果变量名是无效的Octave标识符,会自动修改它们。

source: This option is accepted for backward compatibility but is ignored. Octave now overwrites variables currently in memory with those of the same name found in the file.
es: Esta opción se acepta para la compatibilidad retroactiva pero se ignora.Octava ahora sobrescribe las variables actualmente en memoria con las del mismo nombre que se encuentran en el archivo.
ru: Эта опция принимается для обратной совместимости,но игнорируется.Октава теперь перезаписывает переменные,находящиеся в памяти,одноименными,найденными в файле.
zh_cn: 为了向后兼容,这个选项被接受,但会被忽略。Octave现在会用文件中的同名变量覆盖当前内存中的变量。

source: This option is present for compatibility but is ignored.
es: Esta opción está presente para la compatibilidad pero se ignora.
ru: Эта опция присутствует для совместимости,но игнорируется.
zh_cn: 这个选项是为了兼容性而存在的,但会被忽略。

source: This option is required by the <code>"compute consistent initial condition"</code> and <code>"exclude algebraic variables from error test"</code> options.
es: Esta opci&oacute;n es requerida por las opciones <code>"compute consistent initial condition"</code> y <code>"exclude algebraic variables from error test"</code> .
ru: Эта опция требуется для опций <code>"compute consistent initial condition"</code> и <code>"exclude algebraic variables from error test"</code> .
zh_cn: 此选项是必需的 <code>"compute consistent initial condition"</code> 和 <code>"exclude algebraic variables from error test"</code> 选项。

source: This option only affects PDF outputs, unless it is combined with
es: Esta opción sólo afecta a las salidas de PDF,a menos que se combine con
ru: Этот параметр влияет только на PDF-вывод,если только он не комбинируется с
zh_cn: 这个选项只影响PDF的输出,除非它结合了

source: This option only has an effect if the <code>"enforce inequality constraints"</code> option is nonzero.
es: Esta opci&oacute;n solo tiene efecto si la opci&oacute;n <code>"enforce inequality constraints"</code> es distinta de cero.
ru: Этот параметр действует только в том случае, если параметр <code>"enforce inequality constraints"</code> равен нулю.
zh_cn: 仅当 <code>"enforce inequality constraints"</code> 选项为非零时，此选项才有效。

source: This plot shows the contributions of each column value to the row sum. It is functionally similar to <code>plot (<var>x</var>, cumsum (<var>y</var>, 2))</code>, except that the area under the curve is shaded.
es: Este gr&aacute;fico muestra las contribuciones de cada valor de columna a la suma de filas. Es funcionalmente similar a <code>plot (<var>x</var>, cumsum (<var>y</var>, 2))</code> , excepto que el &aacute;rea debajo de la curva est&aacute; sombreada.
ru: Этот график показывает вклад каждого значения столбца в сумму строки. Функционально он похож на <code>plot (<var>x</var>, cumsum (<var>y</var>, 2))</code> , за исключением того, что область под кривой заштрихована.
zh_cn: 该图显示了每个列值对行总和的贡献。它在功能上类似于 <code>plot (<var>x</var>, cumsum (<var>y</var>, 2))</code> ，不同之处在于曲线下的区域被阴影化。

source: This prevents long and confusing output from large deeply nested structures. The number of levels to print for nested structures may be set with the function <code>struct_levels_to_print</code>, and the function <code>print_struct_array_contents</code> may be used to enable printing of the contents of structure arrays.
es: Esto evita una salida larga y confusa de grandes estructuras profundamente anidadas. El n&uacute;mero de niveles para imprimir para estructuras anidadas se puede establecer con la funci&oacute;n <code>struct_levels_to_print</code> , y la funci&oacute;n <code>print_struct_array_contents</code> se puede usar para habilitar la impresi&oacute;n del contenido de los arreglos de estructura.
ru: Это предотвращает долгий и запутанный вывод из больших глубоко вложенных структур. Количество уровней для печати для вложенных структур может быть установлено с помощью функции <code>struct_levels_to_print</code> , а функция <code>print_struct_array_contents</code> может использоваться для разрешения печати содержимого массивов структур.
zh_cn: 这样可以防止大型的深层嵌套结构产生冗长而令人困惑的输出。可以使用 <code>struct_levels_to_print</code> 函数设置要为嵌套结构打印的级别数，并且可以使用函数 <code>print_struct_array_contents</code> 来打印结构数组的内容。

source: This prints a table like:
es: Esto imprime una tabla como:
ru: Это печатает такой же стол:
zh_cn: 这就打印了一张表,像。

source: This property controls how results are calculated at the boundaries (endpoints) of the window. Possible values are:
es: Esta propiedad controla la forma en que se calculan los resultados en los límites (puntos finales)de la ventana.Los posibles valores son:
ru: Это свойство контролирует,как рассчитываются результаты на границах (конечных точках)окна.Возможные значения:
zh_cn: 此属性控制了如何在窗口的边界(端点)计算结果。可能的值是:

source: This property controls the size of the head of the arrows in the quiver series. The default value is 0.2.
es: Esta propiedad controla el tamaño de la cabeza de las flechas en la serie de carcaj.El valor por defecto es 0.2.
ru: Это свойство контролирует размер заголовка стрелок в дрожащем цикле.Значение по умолчанию равно 0.2.
zh_cn: 此属性控制箭筒系列中箭头的大小。默认值为 0.2。

source: This results in a sparse matrix with the same structure as <var>S</var>. The function <var>f</var> can be passed as a string, a function handle, or an inline function.
es: Esto resulta en una matriz dispersa con la misma estructura que <var>S</var> . La funci&oacute;n <var>f</var> se puede pasar como una cadena, un identificador de funci&oacute;n o una funci&oacute;n en l&iacute;nea.
ru: Это приводит к разреженной матрицей с той же структурой , как <var>S</var> . Функцию <var>f</var> можно передать как строку, дескриптор функции или встроенную функцию.
zh_cn: 这将导致结构与 <var>S</var> 相同的稀疏矩阵。函数 <var>f</var> 可以作为字符串，函数句柄或内联函数传递。

source: This returns a column vector <var>v</var> of length 625. Later, you can restore the random number generator to the state <var>v</var> using the form
es: Esto devuelve un vector de columna <var>v</var> de longitud 625. M&aacute;s tarde, puede restaurar el generador de n&uacute;meros aleatorios al estado <var>v</var> usando el formulario
ru: Это возвращает вектор-столбец <var>v</var> длиной 625. Позже вы можете восстановить генератор случайных чисел в состояние <var>v</var> , используя форму
zh_cn: 这将返回长度为625 的列向量 <var>v</var> 。稍后，您可以使用以下形式将随机数生成器恢复为状态 <var>v</var> :

source: This rotation matrix is intended to be used as a left-multiplying matrix when acting on a column vector, using the notation <var>v</var> = <var>T</var><var>u</var>. For example, a vector, <var>u</var>, pointing along the positive x-axis, rotated 90-degrees about the z-axis, will result in a vector pointing along the positive y-axis:
zh_cn: 当使用符号 <var>v</var> = <var>T</var> <var>u</var> 作用于列向量时，此旋转矩阵打算用作左乘矩阵。例如，沿着正x轴指向，绕z轴旋转90度的向量 <var>u</var> 将导致沿着正y轴指向的向量：

source: This rotation matrix is intended to be used as a left-multiplying matrix when acting on a column vector, using the notation <var>v</var> = <var>T</var><var>u</var>. For example, a vector, <var>u</var>, pointing along the positive y-axis, rotated 90-degrees about the x-axis, will result in a vector pointing along the positive z-axis:
zh_cn: 当使用符号 <var>v</var> = <var>T</var> <var>u</var> 作用于列向量时，此旋转矩阵打算用作左乘矩阵。例如，沿 <var>u</var> 的正y轴指向的矢量u绕x轴旋转了90度，则矢量将沿z的正轴指向：

source: This rotation matrix is intended to be used as a left-multiplying matrix when acting on a column vector, using the notation <var>v</var> = <var>T</var><var>u</var>. For example, a vector, <var>u</var>, pointing along the positive z-axis, rotated 90-degrees about the y-axis, will result in a vector pointing along the positive x-axis:
zh_cn: 当使用符号 <var>v</var> = <var>T</var> <var>u</var> 作用于列向量时，此旋转矩阵打算用作左乘矩阵。例如，沿 <var>u</var> 的正z轴指向向量，绕y轴旋转90度，则矢量u会沿x的正轴指向向量：

source: This rule can lead to some strange looking names, for example <code>defaultlinelinewidth"</code> specifies the default <code>linewidth</code> property for <code>line</code> objects.
es: Esta regla puede dar lugar a nombres extra&ntilde;os, por ejemplo, <code>defaultlinelinewidth"</code> especifica la propiedad de <code>linewidth</code> predeterminada para los objetos de <code>line</code> .
ru: Это правило может привести к <code>defaultlinelinewidth"</code> некоторых странно выглядящих имен, например, defaultlinelinewidth " определяет свойство <code>linewidth</code> по умолчанию для <code>line</code> объектов.
zh_cn: 此规则可能导致看起来有些奇怪的名称，例如 <code>defaultlinelinewidth"</code> 指定 <code>line</code> 对象的默认 <code>linewidth</code> 属性。

source: This section contains a list of problems (and some apparent problems that don&rsquo;t really mean anything is wrong) that may show up during installation of Octave.
es: Esta secci&oacute;n contiene una lista de problemas (y algunos problemas aparentes que realmente no significan que nada est&eacute; mal) que pueden aparecer durante la instalaci&oacute;n de Octave.
ru: В этом разделе содержится список проблем (и некоторые очевидные проблемы, которые на самом деле не означают, что что-то не так), которые могут появиться во время установки Octave.
zh_cn: 本节包含在安装Octave期间可能会出现的问题列表（以及一些并不真正表示任何错误的明显问题）。

source: This section describes how to call <code>printf</code> and related functions.
es: Esta secci&oacute;n describe c&oacute;mo llamar a <code>printf</code> y funciones relacionadas.
ru: В этом разделе описывается, как вызывать <code>printf</code> и связанные с ним функции.
zh_cn: 本节介绍如何调用 <code>printf</code> 和相关函数。

source: This section describes known problems that affect users of Octave. Most of these are not Octave bugs per se&mdash;if they were, we would fix them. But the result for a user may be like the result of a bug.
es: Esta secci&oacute;n describe los problemas conocidos que afectan a los usuarios de Octave. La mayor&iacute;a de estos no son errores de Octave per se; si lo fueran, los arreglar&iacute;amos. Pero el resultado para un usuario puede ser como el resultado de un error.
ru: В этом разделе описаны известные проблемы, с которыми сталкиваются пользователи Octave. Большинство из них не являются ошибками Octave сами по себе - если бы они были, мы бы исправили их. Но результат для пользователя может быть похож на результат ошибки.
zh_cn: 本节介绍影响八度用户的已知问题。其中大多数本身不是Octave错误-如果是，我们将对其进行修复。但是，对用户的结果可能像是错误的结果。

source: This section describes miscellaneous conversions for <code>printf</code>.
es: Esta secci&oacute;n describe diversas conversiones para <code>printf</code> .
ru: В этом разделе описываются различные преобразования для <code>printf</code> .
zh_cn: 本节介绍了 <code>printf</code> 的各种转换。

source: This section describes the <code>scanf</code> conversions for reading numeric values.
es: Esta secci&oacute;n describe las conversiones de <code>scanf</code> para leer valores num&eacute;ricos.
ru: В этом разделе описываются преобразования <code>scanf</code> для чтения числовых значений.
zh_cn: 本节介绍用于读取数值的 <code>scanf</code> 转换。

source: This section describes the <code>scanf</code> input conversions for reading string and character values: &lsquo;
es: Esta secci&oacute;n describe las conversiones de entrada de <code>scanf</code> para leer valores de cadenas y caracteres: '
ru: В этом разделе описываются преобразования ввода <code>scanf</code> для чтения строковых и символьных значений: '
zh_cn: 本节介绍用于读取字符串和字符值的 <code>scanf</code> 输入转换：'

source: This section describes the options for the &lsquo;
es: Esta secci&oacute;n describe las opciones para el '
ru: В этом разделе описаны параметры для '
zh_cn: 本部分介绍了&ldquo;

source: This section discusses the conversion specifications for floating-point numbers: the &lsquo;
es: Esta secci&oacute;n analiza las especificaciones de conversi&oacute;n para n&uacute;meros de punto flotante: el '
ru: В этом разделе обсуждаются спецификации преобразования для чисел с плавающей запятой: '
zh_cn: 本节讨论浮点数的转换规范：

source: This section explains the notation conventions that are used in this manual. You may want to skip this section and refer back to it later.
es: Esta sección explica las convenciones de notación que se utilizan en este manual.Es posible que desee saltarse esta sección y volver a consultarla más tarde.
ru: В этом разделе разъясняются условные обозначения,используемые в данном руководстве.Возможно,вы захотите пропустить этот раздел и вернуться к нему позже.
zh_cn: 本节解释了本手册中使用的符号约定。您可能想跳过本节,以后再参考。

source: This section lists the built-in functions that are aware of diagonal and permutation matrices on input, or can return them as output. Passed to other functions, these matrices will in general trigger an implicit conversion. (Of course, user-defined dynamically linked functions may also work with diagonal or permutation matrices).
es: En esta sección se enumeran las funciones incorporadas que conocen las matrices diagonales y de permutación en la entrada,o que pueden devolverlas como salida.Pasadas a otras funciones,estas matrices desencadenarán en general una conversión implícita.(Por supuesto,las funciones definidas por el usuario y vinculadas dinámicamente también pueden funcionar con matrices diagonales o de permutación).
ru: В этом разделе перечислены встроенные функции,которые знают диагональные и перестановочные матрицы на входе,или могут возвращать их в качестве выходных.При переходе к другим функциям эти матрицы,как правило,вызывают неявное преобразование.(Конечно,определяемые пользователем динамически связанные функции могут также работать с диагональными матрицами или матрицами перестановки).
zh_cn: 本节列出了内置的函数,这些函数在输入时可以知道对角和换元矩阵,或者可以将它们作为输出返回。传递给其他函数,这些矩阵一般会触发一个隐式转换。当然,用户定义的动态链接函数也可以使用对角线或换元矩阵)。

source: This section provides details about the precise syntax of conversion specifications that can appear in a <code>printf</code> template string.
es: Esta secci&oacute;n proporciona detalles sobre la sintaxis precisa de las especificaciones de conversi&oacute;n que pueden aparecer en una <code>printf</code> plantilla printf .
ru: В этом разделе представлены подробные сведения о точном синтаксисе спецификаций преобразования, которые могут появляться в строке шаблона <code>printf</code> .
zh_cn: 本节提供有关可以在 <code>printf</code> 模板字符串中出现的转换规范的精确语法的详细信息。

source: This shows a problem with character matrices. It simply isn&rsquo;t possible to represent strings of different lengths. The solution is to use a cell array of strings, which is described in <a href="cell-arrays-of-strings#Cell-Arrays-of-Strings">Cell Arrays of Strings</a>.
es: Esto muestra un problema con las matrices de caracteres. Simplemente no es posible representar cadenas de diferentes longitudes. La soluci&oacute;n es utilizar una matriz de cadenas de celdas, que se describe en <a href="cell-arrays-of-strings#Cell-Arrays-of-Strings">Matrices de cadenas de celdas</a> .
ru: Это показывает проблему с матрицами символов. Просто невозможно представить строки разной длины. Решение состоит в том, чтобы использовать массив ячеек строк, который описан в <a href="cell-arrays-of-strings#Cell-Arrays-of-Strings">Массивы ячеек строк</a> .
zh_cn: 这显示了字符矩阵的问题。根本不可能表示不同长度的字符串。解决方案是使用字符串的单元格数组，这在<a href="cell-arrays-of-strings#Cell-Arrays-of-Strings">&ldquo;字符串的单元格数组&rdquo;中进行了</a>介绍。

source: This shows an important general concept about using arrays for indexing instead of looping over an index variable. See <a href="index-expressions#Index-Expressions">Index Expressions</a>. Also use boolean indexing generously. If a condition needs to be tested, this condition can also be written as a boolean index. For instance, instead of
es: Esto muestra un concepto general importante sobre el uso de matrices para indexar en lugar de recorrer una variable de &iacute;ndice. Consulte <a href="index-expressions#Index-Expressions">Expresiones de &iacute;ndice</a> . Tambi&eacute;n use generosamente la indexaci&oacute;n booleana. Si es necesario probar una condici&oacute;n, esta condici&oacute;n tambi&eacute;n se puede escribir como un &iacute;ndice booleano. Por ejemplo, en lugar de
ru: Это показывает важную общую концепцию использования массивов для индексации вместо цикла по индексной переменной. См. <a href="index-expressions#Index-Expressions">Индексные выражения</a> . Также щедро используйте логическое индексирование. Если необходимо проверить условие, это условие также можно записать как логический индекс. Например, вместо
zh_cn: 这显示了有关使用数组进行索引而不是循环遍历索引变量的重要一般概念。请参阅<a href="index-expressions#Index-Expressions">索引表达式</a>。还要慷慨地使用布尔索引。如果需要测试条件，则该条件也可以写为布尔索引。例如，代替

source: This shows that <var>A</var> has 7,840 nonzeros, the complete LU factorization has 126,478 nonzeros, and the incomplete LU factorization, with 0 level of fill-in, has 7,840 nonzeros, the same amount as <var>A</var>. Taken from: <a href="http://www.mathworks.com/help/matlab/ref/ilu.html">http://www.mathworks.com/help/matlab/ref/ilu.html</a>
es: Esto demuestra que <var>A</var> tiene 7.840 nonzeros, la factorizaci&oacute;n LU completo tiene 126,478 nonzeros, y la factorizaci&oacute;n LU incompleta, con 0 nivel de relleno, tiene 7.840 nonzeros, la misma cantidad que <var>A</var> . Tomado de: <a href="http://www.mathworks.com/help/matlab/ref/ilu.html">http://www.mathworks.com/help/matlab/ref/ilu.html</a>
ru: Это показывает , что имеет 7,840 ненулевых, полное LU разложение имеет 126,478 ненулевых и неполное LU разложение, с 0 уровня заполнения в, имеет 7,840 ненулевых, такое же количество , как <var>A</var> . Взято с: <a href="http://www.mathworks.com/help/matlab/ref/ilu.html">http://www.mathworks.com/help/matlab/ref/ilu.html</a> <var>A</var>
zh_cn: 这表明 <var>A</var> 有7,840个非零，完整LU分解有126,478个非零，不完全LU分解（填充级别为0）有7,840个非零，与 <var>A</var> 相同。摘自：<a href="http://www.mathworks.com/help/matlab/ref/ilu.html">http</a> : //www.mathworks.com/help/matlab/ref/ilu.html

source: This shows that <var>A</var> has 7,840 nonzeros, the complete LU factorization has 126,478 nonzeros, and the incomplete LU factorization, with 0 level of fill-in, has 7,840 nonzeros, the same amount as <var>A</var>. Taken from: <a href="https://www.mathworks.com/help/matlab/ref/ilu.html">https://www.mathworks.com/help/matlab/ref/ilu.html</a>
zh_cn: 这表明 <var>A</var> 有7,840个非零，完整LU分解有126,478个非零，不完全LU分解（填充级别为0）有7,840个非零，与 <var>A</var> 相同。摘自：<a href="https://www.mathworks.com/help/matlab/ref/ilu.html">https</a> : //www.mathworks.com/help/matlab/ref/ilu.html

source: This shows that most of the run time was spent executing the function &lsquo;
es: Esto muestra que la mayor parte del tiempo de ejecuci&oacute;n se dedic&oacute; a ejecutar la funci&oacute;n '
ru: Это показывает, что большая часть времени выполнения была потрачена на выполнение функции '
zh_cn: 这表明大部分运行时间都花在了执行功能上，

source: This space saving optimization may be disabled using the function <em>disable_range</em>.
es: Esta optimizaci&oacute;n de ahorro de espacio puede desactivarse utilizando la funci&oacute;n <em>disable_range</em> .
ru: Эту оптимизацию экономии места можно отключить с помощью функции <em>disable_range</em> .
zh_cn: 可以使用功能<em>disable_range</em>禁用此节省空间的优化功能。

source: This specifies the number of bytes to use for the internal buffer. A modest speed improvement may be obtained by setting this to a large value when reading a large file, especially if the input contains long strings. The default is 4096, or a value dependent on <var>n</var> if that is specified.
es: Esto especifica el n&uacute;mero de bytes que se utilizar&aacute;n para el b&uacute;fer interno. Se puede obtener una modesta mejora de la velocidad estableciendo esto en un valor grande al leer un archivo grande, especialmente si la entrada contiene cadenas largas. El valor predeterminado es 4096, o un valor que depende de <var>n</var> si se especifica.
ru: Это определяет количество байтов для использования во внутреннем буфере. Небольшое улучшение скорости может быть получено путем установки большого значения при чтении большого файла, особенно если ввод содержит длинные строки. Значение по умолчанию - 4096 или значение, зависящее от <var>n</var> , если оно указано.
zh_cn: 这指定了用于内部缓冲区的字节数。通过在读取大文件时将其设置为较大的值可以获得适度的速度改进，尤其是在输入包含长字符串的情况下。默认值为4096，如果指定，则取决于 <var>n</var> 的值。

source: This string defines whether the light emanates from a light source at infinite distance (<code>"infinite"</code>) or from a local point source (<code>"local"</code>).
es: Esta cadena define si la luz emana de una fuente de luz a una distancia infinita ( <code>"infinite"</code> ) o de una fuente puntual local ( <code>"local"</code> ).
ru: Эта строка определяет, исходит ли свет от источника света на бесконечном расстоянии ( <code>"infinite"</code> ) или от локального точечного источника ( <code>"local"</code> ).
zh_cn: 此字符串定义光是从无限距离的光源（ <code>"infinite"</code> ）还是从本地点光源（ <code>"local"</code> ）发出。
