Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/octave/octave.*.020.xlf
Languages: es, ru, zh_cn

source: To partially solve the problem Octave uses a special optimization for user-defined <code>subsasgn</code> methods coded as m-files. When the method gets called as a result of the built-in assignment syntax (not a direct <code>subsasgn</code> call as shown above), i.e., <code>x(1)&nbsp;=&nbsp;1</code>, <b>AND</b> if the <code>subsasgn</code> method is declared with identical input and output arguments, as in the example above, then Octave will ignore the copy of <code>x</code> inside the caller&rsquo;s scope; therefore, any changes made to <code>x</code> during the method execution will directly affect the caller&rsquo;s copy as well. This allows, for instance, defining a polynomial class where modifying a single element takes constant time.
es: Para resolver parcialmente el problema, Octave utiliza una optimizaci&oacute;n especial para los m&eacute;todos de <code>subsasgn</code> definidos por el usuario codificados como archivos m. Cuando se llama al m&eacute;todo como resultado de la sintaxis de asignaci&oacute;n incorporada (no una llamada directa a <code>subsasgn</code> como se muestra arriba), es decir, <code>x(1)&nbsp;=&nbsp;1</code> , <b>Y</b> si el m&eacute;todo <code>subsasgn</code> se declara con argumentos de entrada y salida id&eacute;nticos, como en el ejemplo anterior, Octave ignorar&aacute; la copia de <code>x</code> dentro del alcance de la persona que llama; por lo tanto, cualquier cambio realizado en <code>x</code> durante la ejecuci&oacute;n del m&eacute;todo afectar&aacute; directamente a la copia del llamador tambi&eacute;n. Esto permite, por ejemplo, definir una clase polinomial donde la modificaci&oacute;n de un solo elemento lleva un tiempo constante.
ru: Для частичного решения проблемы Octave использует специальную оптимизацию для определяемых <code>subsasgn</code> методов подсистемы, закодированных как m-файлы. Когда метод вызывается в результате встроенного синтаксиса присваивания (а не прямого вызова <code>subsasgn</code> , как показано выше), т. Е. <code>x(1)&nbsp;=&nbsp;1</code> , <b>И</b> если метод <code>subsasgn</code> объявлен с идентичными входными и выходными аргументами, как в приведенном выше примере Octave проигнорирует копию <code>x</code> внутри области действия вызывающего; поэтому любые изменения, внесенные в <code>x</code> во время выполнения метода, также напрямую повлияют на копию вызывающего объекта. Это позволяет, например, определить класс полиномов, в котором изменение одного элемента занимает постоянное время.
zh_cn: 为了部分解决问题，Octave对编码为m文件的用户定义的 <code>subsasgn</code> 方法使用了特殊的优化。当该方法由于内置的​​赋值语法而 <code>subsasgn</code> 调用（不是如上所示的直接subsasgn调用）时，即 <code>x(1)&nbsp;=&nbsp;1</code> ，并且<b>，</b>如果 <code>subsasgn</code> 方法使用相同的输入和输出参数声明，则为在上面的示例中，Octave将忽略调用者范围内的 <code>x</code> 副本；因此，在方法执行期间对 <code>x</code> 所做的任何更改也会直接影响调用者的副本。例如，这允许定义多项式类，其中修改单个元素需要花费固定时间。

source: To plot multiple one- or two-argument groups, separate each group with an empty format string, as
es: Para graficar múltiples grupos de uno o dos argumentos,separe cada grupo con una cadena de formato vacía,como
ru: Чтобы построить несколько групп с одним или двумя памятниками,разделите каждую группу пустой строкой формата,так как
zh_cn: 要绘制多个单参数组或双参数组,请用一个空的格式字符串分隔每个组,如

source: To post-increment a variable <var>x</var>, you would write <code><var>x</var>++</code>. This adds one to the variable <var>x</var>, but returns the value that <var>x</var> had prior to incrementing it. For example, if <var>x</var> is equal to 2, the result of the expression <code><var>x</var>++</code> is 2, and the new value of <var>x</var> is 3.
es: Para incrementar posteriormente una variable <var>x</var> , deber&iacute;a escribir <code><var>x</var>++</code> . Esto agrega uno a la variable <var>x</var> , pero devuelve el valor que ten&iacute;a <var>x</var> antes de incrementarlo. Por ejemplo, si <var>x</var> es igual a 2, el resultado de la expresi&oacute;n <code><var>x</var>++</code> es 2 y el nuevo valor de <var>x</var> es 3.
ru: Чтобы пост-инкрементировать переменную <var>x</var> , вы должны написать <code><var>x</var>++</code> . Это добавляет единицу к переменной <var>x</var> , но возвращает значение, которое <var>x</var> имело до ее увеличения. Например, если <var>x</var> равно 2, результатом выражения <code><var>x</var>++</code> будет 2, а новое значение <var>x</var> будет 3.
zh_cn: 要后递增变量 <var>x</var> ，您可以编写 <code><var>x</var>++</code> 。这会将 <var>x</var> 加一个，但返回 <var>x</var> 递增之前的值。例如，如果 <var>x</var> 等于2，则表达式 <code><var>x</var>++</code> 的结果为2，而 <var>x</var> 的新值是3。

source: To print a message along with ringing the bell, you might modify the <code>wakeup</code> to look like this:
es: Para imprimir un mensaje junto con el timbre, puede modificar la <code>wakeup</code> para que se vea as&iacute;:
ru: Чтобы распечатать сообщение вместе со звонком, вы можете изменить <code>wakeup</code> чтобы оно выглядело следующим образом:
zh_cn: 要在响铃时打印一条消息，可以将 <code>wakeup</code> 方式修改为如下所示：

source: To publish this script file, type <code>publish ("pub_example.m")</code>.
es: Para publicar este archivo de secuencia de comandos, escriba <code>publish ("pub_example.m")</code> .
ru: Чтобы опубликовать этот файл сценария, введите <code>publish ("pub_example.m")</code> .
zh_cn: 要发布此脚本文件，请键入 <code>publish ("pub_example.m")</code> 。

source: To query the current hold state use the <code>ishold</code> function.
es: Para consultar el estado de retenci&oacute;n actual, utilice la funci&oacute;n <code>ishold</code> .
ru: Чтобы запросить текущее состояние удержания, используйте функцию <code>ishold</code> .
zh_cn: 要查询当前的保持状态，请使用 <code>ishold</code> 函数。

source: To quit debug mode and return directly to the prompt without executing any additional code use <code>dbquit</code>.
es: Para salir del modo de depuraci&oacute;n y volver directamente al indicador sin ejecutar ning&uacute;n c&oacute;digo adicional, utilice <code>dbquit</code> .
ru: Чтобы выйти из режима отладки и вернуться непосредственно в <code>dbquit</code> строку без выполнения дополнительного кода, используйте dbquit .
zh_cn: 要退出调试模式并直接返回到提示而不执行任何其他代码，请使用 <code>dbquit</code> 。

source: To read a line and discard the terminating newline see <code>fgetl</code>.
es: Para leer una l&iacute;nea y descartar la nueva l&iacute;nea final, consulte <code>fgetl</code> .
ru: Чтобы прочитать строку и отбросить завершающуюся новую <code>fgetl</code> см. Fgetl .
zh_cn: 要读取一行并丢弃终止的换行符，请参见 <code>fgetl</code> 。

source: To read a line and return the terminating newline see <code>fgets</code>.
es: Para leer una l&iacute;nea y devolver la nueva l&iacute;nea final, consulte <code>fgets</code> .
ru: Чтобы прочитать строку и вернуть завершающуюся новую строку, см. <code>fgets</code> .
zh_cn: 要读取一行并返回终止的换行符，请参阅 <code>fgets</code> 。

source: To read from a file it must be opened for reading using <code>fopen</code>. Then a line can be read from the file using <code>fgetl</code> as the following code illustrates
es: Para leer de un archivo, debe abrirse para leer usando <code>fopen</code> . Luego se puede leer una l&iacute;nea del archivo usando <code>fgetl</code> como lo ilustra el siguiente c&oacute;digo
ru: Чтобы читать из файла, его необходимо открыть для чтения с помощью <code>fopen</code> . Затем строку можно прочитать из файла с помощью <code>fgetl</code> , как показано в следующем коде.
zh_cn: 要从文件中读取文件，必须使用 <code>fopen</code> 打开该文件以进行读取。然后可以使用 <code>fgetl</code> 从文件中读取一行，如以下代码所示

source: To remove a colorbar from a plot use any one of the following keywords for the <var>delete_option</var>: <code>"off"</code>, <code>"delete"</code>, <code>"hide"</code>.
es: Para eliminar una barra de color de un gr&aacute;fico, utilice cualquiera de las siguientes palabras clave para <var>delete_option</var> : <code>"off"</code> , <code>"delete"</code> , <code>"hide"</code> .
ru: Чтобы удалить цветовую шкалу с графика, используйте одно из следующих ключевых слов для параметра <var>delete_option</var> : <code>"off"</code> , <code>"delete"</code> , <code>"hide"</code> .
zh_cn: 要从图中删除 <var>delete_option</var> ，请对delete_option使用以下任一关键字： <code>"off"</code> ， <code>"delete"</code> ， <code>"hide"</code> 。

source: To remove a user-defined default setting, set the default property to the value <code>"remove"</code>. For example,
es: Para eliminar una configuraci&oacute;n predeterminada definida por el usuario, establezca la propiedad predeterminada en el valor <code>"remove"</code> . Por ejemplo,
ru: Чтобы удалить пользовательский параметр по умолчанию, установите для свойства по умолчанию значение <code>"remove"</code> . Например,
zh_cn: 要删除用户定义的默认设置，请将default属性设置为值 <code>"remove"</code> 。例如，

source: To report a bug in Octave, submit a bug report to the Octave bug tracker <a href="https://bugs.octave.org">https://bugs.octave.org</a>.
es: Para informar un error en Octave, env&iacute;e un informe de error al rastreador de errores de Octave <a href="https://bugs.octave.org">https://bugs.octave.org</a> .
ru: Чтобы сообщить об ошибке в Octave, отправьте отчет об ошибке в трекер ошибок Octave <a href="https://bugs.octave.org">https://bugs.octave.org</a> .
zh_cn: 要报告Octave中的错误，请将错误报告提交给Octave错误跟踪器<a href="https://bugs.octave.org">https://bugs.octave.org</a>。

source: To save a plot once it has been displayed on the screen, use the print command. For example,
es: Para guardar un gráfico una vez que se ha mostrado en la pantalla,utilice el comando de impresión.Por ejemplo,
ru: Чтобы сохранить график после его отображения на экране,используйте команду печати.Например,
zh_cn: 要在屏幕上显示图形后保存图形,请使用打印命令。例如

source: To save a plot, in one of several image formats such as PostScript or PNG, use the <code>print</code> command.
es: Para guardar un gr&aacute;fico, en uno de varios formatos de imagen como PostScript o PNG, use el comando de <code>print</code> .
ru: Чтобы сохранить график в одном из нескольких форматов изображения, например PostScript или PNG, используйте команду <code>print</code> .
zh_cn: 要以多种图像格式（例如PostScript或PNG）之一保存图，请使用 <code>print</code> 命令。

source: To see what functions can be called with an object use <code>methods</code>. For example, using the previously created <var>dobj</var>:
es: Para ver qu&eacute; funciones se pueden llamar con un objeto, use <code>methods</code> . Por ejemplo, usando el <var>dobj</var> creado previamente :
ru: Чтобы узнать, какие функции можно вызывать с помощью объекта, используйте <code>methods</code> . Например, используя ранее созданный <var>dobj</var> :
zh_cn: 若要查看可使用对象调用的函数，请使用 <code>methods</code> 。例如，使用先前创建的 <var>dobj</var> ：

source: To see what is new in the current release of Octave, use the <code>news</code> function.
es: Para ver las novedades de la versi&oacute;n actual de Octave, utilice la funci&oacute;n de <code>news</code> .
ru: Чтобы узнать, что нового в текущей версии Octave, используйте функцию <code>news</code> .
zh_cn: 要查看当前版本的Octave中的新增功能，请使用 <code>news</code> 功能。

source: To see which packages are installed type
es: Para ver qué paquetes están instalados escriba
ru: Чтобы посмотреть,какие пакеты установлены,введите
zh_cn: 要查看安装了哪些软件包,请输入

source: To set a breakpoint immediately upon entering a function use line number 1, or omit the line number entirely and just give the function name. When setting the breakpoint Octave will ignore the leading comment block, and the breakpoint will be set on the first executable statement in the function. For example:
es: Para establecer un punto de interrupción inmediatamente después de entrar en una función,utilice la línea número 1,u omita el número de línea por completo y sólo dé el nombre de la función.Al establecer el punto de interrupción,Octave ignorará el bloque de comentarios principal,y el punto de interrupción se establecerá en la primera declaración ejecutable de la función.Por ejemplo:
ru: Для установки точки останова сразу после ввода функции используйте строку номер 1,или опустите номер строки полностью и просто дайте имя функции.При установке точки останова Октава будет игнорировать ведущий блок комментариев,а точка останова будет установлена на первом исполняемом выражении в функции.Например:
zh_cn: 要在进入一个函数后立即设置断点,请使用第1行,或者完全省略行号,只给出函数名。当设置断点时,Octave将忽略前面的注释块,断点将设置在函数的第一条可执行语句上。例如,在函数中的第一条可执行语句上设置断点。

source: To set graphics object properties, use the set function. For example,
es: Para establecer las propiedades de los objetos gráficos,utilice la función de establecer.Por ejemplo,
ru: Для задания свойств графических объектов используйте функцию set.Например,
zh_cn: 要设置图形对象属性,请使用设置函数。例如

source: To test if an object is a cell array, use the <code>iscell</code> function. For example:
es: Para probar si un objeto es una matriz de celdas, use la funci&oacute;n <code>iscell</code> . Por ejemplo:
ru: Чтобы проверить, является ли объект массивом ячеек, используйте функцию <code>iscell</code> . Например:
zh_cn: 要测试对象是否为单元格数组，请使用 <code>iscell</code> 函数。例如：

source: To test if an object is a string (i.e., a 1xN row vector of characters and not a character matrix) you can use the <code>ischar</code> function in combination with the <code>isrow</code> function as in the following example:
es: Para probar si un objeto es una cadena (es decir, un vector de caracteres de fila 1xN y no una matriz de caracteres), puede usar la funci&oacute;n <code>ischar</code> en combinaci&oacute;n con la funci&oacute;n <code>isrow</code> como en el siguiente ejemplo:
ru: Чтобы проверить, является ли объект строкой (т. Е. Вектор-строкой символов 1xN, а не символьной матрицей), вы можете использовать функцию <code>ischar</code> в сочетании с функцией <code>isrow</code> , как в следующем примере:
zh_cn: 要测试对象是否为字符串（即字符的1xN行向量，而不是字符矩阵），可以将 <code>ischar</code> 函数与 <code>isrow</code> 函数结合使用，如以下示例所示：

source: To update a single package use <code>pkg install -forge</code>
es: Para actualizar un solo paquete, use <code>pkg install -forge</code>
ru: Чтобы обновить один пакет, используйте <code>pkg install -forge</code>
zh_cn: 要更新单个软件包，请使用 <code>pkg install -forge</code>

source: To use Publishing Markup, start by typing &lsquo;
es: Para usar Publishing Markup, comience escribiendo '
ru: Чтобы использовать разметку публикации, начните с ввода "
zh_cn: 要使用发布标记，请先输入&ldquo;

source: To write preformatted code inside a section, indent the code by three spaces after &lsquo;
es: Para escribir c&oacute;digo preformateado dentro de una secci&oacute;n, sangra el c&oacute;digo con tres espacios despu&eacute;s de '
ru: Чтобы записать предварительно отформатированный код внутри раздела, сделайте отступ в три пробела после '
zh_cn: 要在部分中编写预格式化的代码，请在&ldquo;

source: To write preformatted text inside a section, indent the code by two spaces after &lsquo;
es: Para escribir texto preformateado dentro de una secci&oacute;n, sangra el c&oacute;digo con dos espacios despu&eacute;s de '
ru: Чтобы записать предварительно отформатированный текст внутри раздела, сделайте отступ в коде двумя пробелами после '
zh_cn: 要在节内编写预格式化的文本，请在&ldquo;

source: Toggle between <code>"hide"</code> and <code>"show"</code>
es: Alternar entre <code>"hide"</code> y <code>"show"</code>
ru: Переключение между <code>"hide"</code> и <code>"show"</code>
zh_cn: 在 <code>"hide"</code> 和 <code>"show"</code> 之间切换

source: Toggle or set the <code>"hold"</code> state of the plotting engine which determines whether new graphic objects are added to the plot or replace the existing objects.
es: Cambie o establezca el estado de <code>"hold"</code> del motor de trazado, que determina si se agregan nuevos objetos gr&aacute;ficos al trazado o si reemplazan los objetos existentes.
ru: Переключите или установите состояние <code>"hold"</code> механизма построения графиков, которое определяет, будут ли добавлены новые графические объекты к графику или заменены существующие объекты.
zh_cn: 切换或设置绘图引擎的 <code>"hold"</code> 状态，该状态确定是将新的图形对象添加到绘图还是替换现有的对象。

source: Toggle the current hold state.
es: Cambie el estado de espera actual.
ru: Переключите текущее состояние удержания.
zh_cn: 切换当前的保持状态。

source: Tolerance used to compare the results of expression <var>f</var> and expression <var>f2</var>. If <var>tol</var> is positive, the tolerance is an absolute one. If <var>tol</var> is negative, the tolerance is a relative one. The default is <code>eps</code>. If <var>tol</var> is <code>Inf</code>, then no comparison will be made.
es: Tolerancia utilizada para comparar los resultados de la expresi&oacute;n <var>f</var> y la expresi&oacute;n <var>f2</var> . Si <var>tol</var> es positivo, la tolerancia es absoluta. Si <var>tol</var> es negativo, la tolerancia es relativa. El valor predeterminado es <code>eps</code> . Si <var>tol</var> es <code>Inf</code> , no se realizar&aacute; ninguna comparaci&oacute;n.
ru: Допуск, используемый для сравнения результатов выражения <var>f</var> и выражения <var>f2</var> . Если <var>tol</var> положительный, допуск является абсолютным. Если <var>tol</var> отрицательное, допуск относительный. По умолчанию - <code>eps</code> . Если <var>tol</var> равно <code>Inf</code> , то сравнение производиться не будет.
zh_cn: 公差用于比较表达式 <var>f</var> 和表达式 <var>f2</var> 的结果。如果 <var>tol</var> 为正，则公差为绝对值。如果 <var>tol</var> 为负，则公差为相对公差。默认值为 <code>eps</code> 。如果 <var>tol</var> 是 <code>Inf</code> ，则不会进行比较。

source: Tool for building software (<a href="https://www.gnu.org/software/make">https://www.gnu.org/software/make</a>). Octave&rsquo;s build system requires GNU Make. Other versions of Make will not work. Fortunately, GNU Make is highly portable and easy to install.
es: Herramienta para la construcci&oacute;n de software ( <a href="https://www.gnu.org/software/make">https://www.gnu.org/software/make</a> ). El sistema de compilaci&oacute;n de Octave requiere GNU Make. Otras versiones de Make no funcionar&aacute;n. Afortunadamente, GNU Make es muy port&aacute;til y f&aacute;cil de instalar.
ru: Инструмент для создания программного обеспечения ( <a href="https://www.gnu.org/software/make">https://www.gnu.org/software/make</a> ). Для системы сборки Octave требуется GNU Make. Другие версии Make работать не будут. К счастью, GNU Make очень портативна и проста в установке.
zh_cn: 用于构建软件的工具（<a href="https://www.gnu.org/software/make">https://www.gnu.org/software/make</a>）。Octave的构建系统需要GNU Make。其他版本的Make将不起作用。幸运的是，GNU Make具有高度的可移植性并且易于安装。

source: Top center of the screen.
es: En la parte superior central de la pantalla.
ru: Верхний центр экрана.
zh_cn: 画面的顶部中心。

source: Top left of the screen.
es: Arriba a la izquierda de la pantalla.
ru: В верхней левой части экрана.
zh_cn: 屏幕的左上方。

source: Top right of the screen.
es: Arriba a la derecha de la pantalla.
ru: Верхняя правая часть экрана.
zh_cn: 屏幕的右上方。

source: Trailing singleton dimensions are ignored. When called with a single argument, or no argument, <code>size_equal</code> returns true.
es: Las cotas finales de singleton se ignoran. Cuando se llama con un solo argumento, o sin argumento, <code>size_equal</code> devuelve verdadero.
ru: Конечные одиночные размеры игнорируются. При вызове с одним аргументом или без аргумента <code>size_equal</code> возвращает true.
zh_cn: 尾随的单例尺寸将被忽略。当使用单个参数或不使用任何参数调用时， <code>size_equal</code> 返回true。

source: Transform Cartesian coordinates to polar or cylindrical coordinates.
es: Transformar las coordenadas cartesianas en coordenadas polares o cilíndricas.
ru: Преобразовать декартовые координаты в полярные или цилиндрические.
zh_cn: 将笛卡尔坐标转换为极坐标或圆柱坐标。

source: Transform Cartesian coordinates to spherical coordinates.
es: Transformar las coordenadas cartesianas en coordenadas esféricas.
ru: Преобразовать декартовые координаты в сферические.
zh_cn: 将笛卡尔坐标转换为球面坐标。

source: Transform Groups
es: Transformar los grupos
ru: Группы Преобразования
zh_cn: 变换组

source: Transform a colormap or image from HSV to RGB color space.
es: Transformar un mapa de color o una imagen de HSV a un espacio de color RGB.
ru: Преобразование цветовой карты или изображения из цветового пространства HSV в RGB.
zh_cn: 将彩色图或图像从HSV转换为RGB色彩空间。

source: Transform a colormap or image from RGB to HSV color space.
es: Transformar un mapa de color o una imagen de un espacio de color RGB a un espacio de color HSV.
ru: Преобразование цветовой карты или изображения из цветового пространства RGB в цветовое пространство HSV.
zh_cn: 将colormap或图像从RGB转换为HSV颜色空间。

source: Transform an image or colormap from red-green-blue (RGB) color space to a grayscale intensity image.
es: Transformar una imagen o mapa de color del espacio de color rojo-verde-azul (RGB)a una imagen de intensidad de escala de grises.
ru: Преобразование изображения или цветовой карты из красно-зелено-синего (RGB)цветового пространства в изображение с интенсивностью серого.
zh_cn: 将图像或彩色图从红-绿-蓝(RGB)色彩空间转换为灰度强度图像。

source: Transform polar or cylindrical coordinates to Cartesian coordinates.
es: Transformar las coordenadas polares o cilíndricas en coordenadas cartesianas.
ru: Преобразовать полярные или цилиндрические координаты в декартовые.
zh_cn: 将极坐标或圆柱坐标转换为笛卡尔坐标。

source: Transform spherical coordinates to Cartesian coordinates.
es: Transformar las coordenadas esféricas en coordenadas cartesianas.
ru: Преобразовать сферические координаты в декартовые.
zh_cn: 将球面坐标转换为笛卡尔坐标。

source: Translate a string for use in a regular expression.
es: Traducir una cuerda para usarla en una expresión regular.
ru: Транслируйте строку для использования в регулярном выражении.
zh_cn: 翻译一个字符串,用于正则表达式。

source: Transparency is not yet implemented for axes objects. <code>alim</code> is unused.
es: La transparencia a&uacute;n no est&aacute; implementada para los objetos de ejes. <code>alim</code> no se utiliza.
ru: Для объектов осей прозрачность еще не реализована. <code>alim</code> не используется.
zh_cn: 轴对象尚未实现透明度。 <code>alim</code> 未使用。

source: Transparency is not yet implemented for axes objects. <code>gridalpha</code> is unused.
es: La transparencia a&uacute;n no est&aacute; implementada para los objetos de ejes. <code>gridalpha</code> no se ha utilizado.
ru: Для объектов осей прозрачность еще не реализована. <code>gridalpha</code> не используется.
zh_cn: 轴对象尚未实现透明度。 <code>gridalpha</code> 未使用。

source: Transparency is not yet implemented for axes objects. <code>minorgridalpha</code> is unused.
es: La transparencia a&uacute;n no est&aacute; implementada para los objetos de ejes. <code>minorgridalpha</code> no se ha utilizado.
ru: Для объектов осей прозрачность еще не реализована. <code>minorgridalpha</code> не используется.
zh_cn: 轴对象尚未实现透明度。 <code>minorgridalpha</code> 未使用。

source: Transparency is not yet implemented for figure objects. <code>alphamap</code> is unused.
es: La transparencia a&uacute;n no est&aacute; implementada para objetos de figura. <code>alphamap</code> no se utiliza.
ru: Для фигурных объектов прозрачность еще не реализована. <code>alphamap</code> не используется.
zh_cn: 尚未为图形对象实现透明度。 <code>alphamap</code> 未使用。

source: Transparency is not yet implemented for image objects. <code>alphadata</code> is unused.
es: La transparencia a&uacute;n no est&aacute; implementada para los objetos de imagen. <code>alphadata</code> no se utiliza.
ru: Прозрачность еще не реализована для объектов изображения. <code>alphadata</code> не используется.
zh_cn: 尚未为图像对象实现透明度。 <code>alphadata</code> 未使用。

source: Transparency is not yet implemented for image objects. <code>alphadatamapping</code> is unused.
es: La transparencia a&uacute;n no est&aacute; implementada para los objetos de imagen. <code>alphadatamapping</code> no se utiliza.
ru: Прозрачность еще не реализована для объектов изображения. <code>alphadatamapping</code> не используется.
zh_cn: 尚未为图像对象实现透明度。 <code>alphadatamapping</code> 未使用。
