Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/octave/octave.*.020.xlf
Languages: es, ru, zh_cn

source: This is equivalent to <code>sum (conj (<var>X</var>) .* <var>Y</var>, <var>dim</var>)</code>, but avoids forming a temporary array and is faster. When <var>X</var> and <var>Y</var> are column vectors, the result is equivalent to <code><var>X</var>' * <var>Y</var></code>.
es: Esto es equivalente a <code>sum (conj (<var>X</var>) .* <var>Y</var>, <var>dim</var>)</code> , pero evita formar una matriz temporal y es m&aacute;s r&aacute;pido. Cuando <var>X</var> y <var>Y</var> son vectores de columna, el resultado es equivalente a <code><var>X</var>' * <var>Y</var></code> .
ru: Это эквивалентно <code>sum (conj (<var>X</var>) .* <var>Y</var>, <var>dim</var>)</code> , но позволяет избежать формирования временного массива и работает быстрее. Когда <var>X</var> и <var>Y</var> являются векторами - столбцами, то результат эквивалентен <code><var>X</var>' * <var>Y</var></code> .
zh_cn: 这等效于 <code>sum (conj (<var>X</var>) .* <var>Y</var>, <var>dim</var>)</code> ，但避免形成临时数组，并且速度更快。当 <var>X</var> 和 <var>Y</var> 是列向量，则结果等于 <code><var>X</var>' * <var>Y</var></code> 。

source: This is equivalent to calling <code>fscanf</code> with <var>fid</var> = <code>stdin</code>.
es: Esto es equivalente a llamar a <code>fscanf</code> con <var>fid</var> = <code>stdin</code> .
ru: Это эквивалентно вызову <code>fscanf</code> с <var>fid</var> = <code>stdin</code> .
zh_cn: 这等效于使用 <var>fid</var> = <code>stdin</code> 调用 <code>fscanf</code> 。

source: This is equivalent to rounding towards negative infinity. If <var>x</var> is complex, return <code>floor (real (<var>x</var>)) + floor (imag (<var>x</var>)) * I</code>.
es: Esto equivale a redondear hacia el infinito negativo. Si <var>x</var> es compleja, el retorno <code>floor (real (<var>x</var>)) + floor (imag (<var>x</var>)) * I</code> .
ru: Это эквивалентно округлению в сторону отрицательной бесконечности. Если <var>x</var> сложный, обратный <code>floor (real (<var>x</var>)) + floor (imag (<var>x</var>)) * I</code> .
zh_cn: 这等效于四舍五入为负无穷大。如果 <var>x</var> 是复杂的，返回 <code>floor (real (<var>x</var>)) + floor (imag (<var>x</var>)) * I</code> 。

source: This is equivalent to rounding towards positive infinity.
es: Esto equivale a redondear hacia el infinito positivo.
ru: Это эквивалентно округлению в сторону положительной бесконечности.
zh_cn: 这相当于向正无穷大的方向取整。

source: This is equivalent to rounding towards zero. If <var>x</var> is complex, return <code>fix (real (<var>x</var>)) + fix (imag (<var>x</var>)) * I</code>.
es: Esto equivale a redondear hacia cero. Si <var>x</var> es compleja, el retorno <code>fix (real (<var>x</var>)) + fix (imag (<var>x</var>)) * I</code> .
ru: Это эквивалентно округлению в сторону нуля. Если <var>x</var> является сложным, возвращение <code>fix (real (<var>x</var>)) + fix (imag (<var>x</var>)) * I</code> .
zh_cn: 这等效于四舍五入。如果 <var>x</var> 是复杂的，收益 <code>fix (real (<var>x</var>)) + fix (imag (<var>x</var>)) * I</code> 。

source: This is equivalent to the polynomial found by multiplying together all the common roots. Together with deconv, you can reduce a ratio of two polynomials.
es: Esto equivale al polinomio que se encuentra multiplicando todas las raíces comunes.Junto con la deconv,puedes reducir una proporción de dos polinomios.
ru: Это эквивалентно многочлену,найденному путем умножения всех общих корней.Вместе с деконвом можно уменьшить соотношение двух полиномов.
zh_cn: 这相当于将所有的公共根相乘后找到的多项式。与deconv一起,你可以减少两个多项式的比值。

source: This is especially important for loops with "cheap" bodies. Often it suffices to vectorize just the innermost loop to get acceptable performance. A general rule of thumb is that the "order" of the vectorized body should be greater or equal to the "order" of the enclosing loop.
es: Esto es especialmente importante para los bucles con cuerpos "baratos".A menudo basta con vectorizar sólo el bucle más interno para obtener un rendimiento aceptable.Una regla general es que el "orden" del cuerpo vectorizado debe ser mayor o igual al "orden" del bucle cerrado.
ru: Это особенно важно для петель с "дешевыми" телами.Часто достаточно векторизовать только самый внутренний цикл,чтобы получить приемлемое исполнение.Общее правило заключается в том,что "порядок" векторизованного тела должен быть больше или равен "порядку" замкнутого цикла.
zh_cn: 这对于具有 "廉价 "主体的循环来说尤其重要。通常情况下,只需对最内部的循环进行矢量化,就可以获得可接受的性能。一般的经验法则是矢量化的主体的 "顺序 "应该大于或等于包围循环的 "顺序"。

source: This is given by
es: Esto está dado por
ru: Это дано
zh_cn: 这是由

source: This is like <code>fscanf</code>, except that the characters are taken from the string <var>string</var> instead of from a stream.
es: Esto es como <code>fscanf</code> , excepto que los caracteres se toman de la <var>string</var> lugar de una secuencia.
ru: Это похоже на <code>fscanf</code> , за исключением того, что символы берутся из строковой <var>string</var> а не из потока.
zh_cn: 类似于 <code>fscanf</code> ，不同之处在于字符是从字符串 <var>string</var> 而不是流中获取的。

source: This is like <code>printf</code>, except that the output is returned as a string.
es: Esto es como <code>printf</code> , excepto que la salida se devuelve como una cadena.
ru: Это похоже на <code>printf</code> , за исключением того, что вывод возвращается в виде строки.
zh_cn: 类似于 <code>printf</code> ，除了输出以字符串形式返回。

source: This is most easily demonstrated by example. Suppose the programmer needs a FIR filter, i.e., a filter with a numerator polynomial but a denominator of 1. In traditional Octave programming this would be performed as follows.
es: Esto se demuestra más fácilmente con el ejemplo.Supongamos que el programador necesita un filtro FIR,es decir,un filtro con un polinomio numerador pero con un denominador de 1.En la programación tradicional de la Octava esto se realizaría de la siguiente manera.
ru: Это легче всего продемонстрировать на примере.Предположим,программисту нужен ИК-фильтр,т.е.фильтр с полиномом числителя,но знаменателем 1.В традиционном октавном программировании это выполнялось бы следующим образом.
zh_cn: 这一点最容易通过例子来证明。假设程序员需要一个FIR滤波器,即分子为多项式但分母为1的滤波器,在传统的Octave编程中,可以按以下方式进行。

source: This is normally useful when doing object-oriented programming and there is a requirement to call one of Octave&rsquo;s base functions rather than the overloaded one of a new class.
es: Esto normalmente es &uacute;til cuando se hace programaci&oacute;n orientada a objetos y existe el requisito de llamar a una de las funciones base de Octave en lugar de la sobrecargada de una nueva clase.
ru: Обычно это полезно при объектно-ориентированном программировании, когда требуется вызвать одну из базовых функций Octave, а не перегруженную функцию нового класса.
zh_cn: 这在进行面向对象的编程时通常很有用，并且需要调用Octave的基本函数之一，而不是调用新类的重载函数。

source: This is not a practical example of the <code>continue</code> statement, but it should give you a clear understanding of how it works. Normally, one would probably write the loop like this:
es: Este no es un ejemplo pr&aacute;ctico de la declaraci&oacute;n <code>continue</code> , pero deber&iacute;a darle una idea clara de c&oacute;mo funciona. Normalmente, uno probablemente escribir&iacute;a el bucle as&iacute;:
ru: Это не практический пример оператора <code>continue</code> , но он должен дать вам четкое представление о том, как он работает. Обычно цикл можно было бы написать так:
zh_cn: 这不是 <code>continue</code> 语句的实际示例，但是它应该使您对其工作方式有一个清晰的了解。通常，可能会这样编写循环：

source: This is not the same as <code>x &lt; 0.0</code>, because IEEE 754 floating point allows zero to be signed. The comparison <code>-0.0 &lt; 0.0</code> is false, but <code>signbit (-0.0)</code> will return a nonzero value.
es: Esto no es lo mismo que <code>x &lt; 0.0</code> , porque el punto flotante IEEE 754 permite que se firme el cero. La comparaci&oacute;n <code>-0.0 &lt; 0.0</code> es falsa, pero <code>signbit (-0.0)</code> devolver&aacute; un valor distinto de cero.
ru: Это не то же самое, что <code>x &lt; 0.0</code> , потому что с плавающей запятой IEEE 754 можно подписывать ноль. Сравнение <code>-0.0 &lt; 0.0</code> ложно, но <code>signbit (-0.0)</code> вернет ненулевое значение.
zh_cn: 这与 <code>x &lt; 0.0</code> ，因为IEEE 754浮点允许对零进行签名。比较 <code>-0.0 &lt; 0.0</code> 为假，但 <code>signbit (-0.0)</code> 将返回非零值。

source: This is one way to normalize columns of a matrix <var>X</var> to unit norm:
es: Esta es una forma de normalizar las columnas de una matriz <var>X</var> a la norma unitaria:
ru: Это один из способов нормализовать столбцы матрицы <var>X</var> до единичной нормы:
zh_cn: 这是将矩阵 <var>X</var> 的列标准化为单位范数的一种方法：

source: This is only possible if the call was done using <code>WUNTRACED</code> or when the child is being traced (see ptrace(2)).
es: Esto solo es posible si la llamada se realiz&oacute; usando <code>WUNTRACED</code> o cuando se est&aacute; rastreando al ni&ntilde;o (ver ptrace (2)).
ru: Это возможно только в том случае, если вызов был выполнен с использованием <code>WUNTRACED</code> или когда дочерний элемент отслеживается (см. Ptrace (2)).
zh_cn: 仅当使用 <code>WUNTRACED</code> 进行调用或在跟踪子项时（参见ptrace（2）），才有可能。

source: This is related to the least squares solution of <code><var>A</var> \ <var>b</var></code>, by
es: Esto est&aacute; relacionado con la soluci&oacute;n de m&iacute;nimos cuadrados de <code><var>A</var> \ <var>b</var></code> , por
ru: Это связано с решением <code><var>A</var> \ <var>b</var></code> методом наименьших квадратов следующим образом:
zh_cn: 这与 <code><var>A</var> \ <var>b</var></code> 的最小二乘解有关，通过

source: This is the e-mail address to list after the name in the author field. By default it guesses <code>&lt;$LOGNAME@$HOSTNAME&gt;</code>, and if <code>$HOSTNAME</code> is not defined it uses <code>uname -n</code>. You probably want to override this. Be sure to use the format <code><a href="mailto:user@host">user@host</a></code>.
es: Esta es la direcci&oacute;n de correo electr&oacute;nico que se debe incluir despu&eacute;s del nombre en el campo del autor. De forma predeterminada, adivina <code>&lt;$LOGNAME@$HOSTNAME&gt;</code> , y si <code>$HOSTNAME</code> no est&aacute; definido, usa <code>uname -n</code> . Probablemente desee anular esto. Aseg&uacute;rese de utilizar el formato <code><a href="mailto:user@host">user@host</a></code> .
ru: Это адрес электронной почты, который нужно указать после имени в поле автора. По умолчанию он угадывает <code>&lt;$LOGNAME@$HOSTNAME&gt;</code> , а если <code>$HOSTNAME</code> не определен, он использует <code>uname -n</code> . Вы, вероятно, захотите изменить это. Обязательно используйте формат <code><a href="mailto:user@host">user@host</a></code> .
zh_cn: 这是要在作者字段中的名称之后列出的电子邮件地址。缺省情况下，它猜测 <code>&lt;$LOGNAME@$HOSTNAME&gt;</code> ，如果未定义 <code>$HOSTNAME</code> 则使用 <code>uname -n</code> 。您可能想覆盖此。确保使用格式 <code><a href="mailto:user@host">user@host</a></code> 。

source: This is the location of user local m-files. Be sure it is in your path. The default is
es: Esta es la ubicación de los archivos m locales del usuario.Asegúrate de que está en tu camino.El valor predeterminado es
ru: Это местоположение локальных m-файлов пользователя.Убедитесь,что оно на вашем пути.По умолчанию
zh_cn: 这是用户本地m-files的位置。确保它在你的路径中。默认是

source: This is the name to put after the "## Author:" field of new functions. By default it guesses from the <code>gecos</code> field of the password database.
es: Este es el nombre que se debe poner despu&eacute;s del campo "## Autor:" de las nuevas funciones. De forma predeterminada, adivina desde el campo <code>gecos</code> de la base de datos de contrase&ntilde;as.
ru: Это имя следует помещать после поля &laquo;## Автор:&raquo; новых функций. По умолчанию он догадывается из поля <code>gecos</code> базы данных паролей.
zh_cn: 这是要在新函数的&ldquo; ## Author：&rdquo;字段后面加上的名称。默认情况下，它从密码数据库的 <code>gecos</code> 字段进行猜测。

source: This is the number of combinations of <var>n</var> items taken in groups of size <var>k</var>.
es: Este es el n&uacute;mero de combinaciones de <var>n</var> elementos tomados en grupos de tama&ntilde;o <var>k</var> .
ru: Это количество комбинаций из <var>n</var> элементов, взятых в группы размером <var>k</var> .
zh_cn: 这是大小为 <var>k</var> 的组中 <var>n</var> 个项目的组合数。

source: This is typically used for large matrices, where the cost of calculating <code>norm (<var>A</var>)</code> is prohibitive and an approximation to the 2-norm is acceptable.
es: Esto se usa t&iacute;picamente para matrices grandes, donde el costo de calcular la <code>norm (<var>A</var>)</code> es prohibitivo y una aproximaci&oacute;n a la norma 2 es aceptable.
ru: Обычно это используется для больших матриц, где стоимость вычисления <code>norm (<var>A</var>)</code> непомерно высока, а приближение к 2-норме приемлемо.
zh_cn: 这通常用于大型矩阵，在这种情况下，计算 <code>norm (<var>A</var>)</code> 的成本高昂，并且可以接受2范数的近似值。

source: This is useful for building a matrix incrementally by a sequence of indexed assignments. Subsequent indexed assignments after <code>spalloc</code> will reuse the pre-allocated memory, provided they are of one of the simple forms
es: Esto es &uacute;til para construir una matriz de forma incremental mediante una secuencia de asignaciones indexadas. Las asignaciones indexadas posteriores despu&eacute;s de <code>spalloc</code> reutilizar&aacute;n la memoria preasignada, siempre que sean de una de las formas simples
ru: Это полезно для постепенного построения матрицы последовательностью индексированных назначений. Последующие индексированные назначения после <code>spalloc</code> будут повторно использовать предварительно выделенную память, при условии, что они имеют одну из простых форм
zh_cn: 这对于通过一系列索引分配来逐步构建矩阵很有用。 <code>spalloc</code> 之后的后续索引分配将重用预分配的内存，前提是它们是简单形式之一

source: This is useful for checking to that the number of output arguments supplied to a function is within an acceptable range.
es: Esto es útil para comprobar que el número de argumentos de salida suministrados a una función está dentro de un rango aceptable.
ru: Это полезно для проверки того,что количество выходных аргументов,передаваемых функции,находится в допустимом диапазоне.
zh_cn: 这对于检查提供给函数的输出参数的数量是否在可接受的范围内很有用。

source: This is useful for functions that do not accept array arguments. If the function does accept array arguments it is better to call the function directly.
es: Esto es útil para las funciones que no aceptan argumentos de matriz.Si la función acepta argumentos de matriz es mejor llamar a la función directamente.
ru: Это полезно для функций,которые не принимают аргументы массива.Если функция действительно принимает аргументы массивов,то лучше вызвать функцию напрямую.
zh_cn: 这对于不接受数组参数的函数很有用。如果函数接受数组参数,最好直接调用函数。

source: This is useful for implementing functions where arguments can either be scalars or of common size.
es: Esto es útil para implementar funciones en las que los argumentos pueden ser escalares o de tamaño común.
ru: Это полезно для реализации функций,где аргументы могут быть как скалярными,так и общего размера.
zh_cn: 这对于实现参数既可以是标量也可以是普通大小的函数很有用。

source: This is useful to protect temporary changes to global variables from possible errors. For example, the following code will always restore the original value of the global variable <code>frobnosticate</code> even if an error occurs in the first part of the <code>unwind_protect</code> block.
es: Esto es &uacute;til para proteger los cambios temporales en las variables globales de posibles errores. Por ejemplo, el siguiente c&oacute;digo siempre restaurar&aacute; el valor original de la variable global <code>frobnosticate</code> incluso si ocurre un error en la primera parte del bloque <code>unwind_protect</code> .
ru: Это полезно для защиты временных изменений глобальных переменных от возможных ошибок. Например, следующий код всегда будет восстанавливать исходное значение глобальной переменной <code>frobnosticate</code> , даже если ошибка возникает в первой части блока <code>unwind_protect</code> .
zh_cn: 这对于保护临时更改全局变量免受可能的错误很有用。例如，即使在 <code>unwind_protect</code> 块的第一部分发生错误，下面的代码也将始终恢复全局变量 <code>frobnosticate</code> 的原始值。

source: This isn&rsquo;t merely easier to write; it is also internally much easier to optimize. Octave delegates this operation to an underlying implementation which, among other optimizations, may use special vector hardware instructions or could conceivably even perform the additions in parallel. In general, if the code is vectorized, the underlying implementation has more freedom about the assumptions it can make in order to achieve faster execution.
es: Esto no es simplemente m&aacute;s f&aacute;cil de escribir; tambi&eacute;n internamente es mucho m&aacute;s f&aacute;cil de optimizar. Octave delega esta operaci&oacute;n a una implementaci&oacute;n subyacente que, entre otras optimizaciones, puede usar instrucciones especiales de hardware de vector o posiblemente incluso podr&iacute;a realizar las adiciones en paralelo. En general, si el c&oacute;digo est&aacute; vectorizado, la implementaci&oacute;n subyacente tiene m&aacute;s libertad sobre las suposiciones que puede hacer para lograr una ejecuci&oacute;n m&aacute;s r&aacute;pida.
ru: Это не просто проще написать; его также намного проще оптимизировать внутренне. Octave делегирует эту операцию базовой реализации, которая, помимо других оптимизаций, может использовать специальные векторные аппаратные инструкции или, возможно, даже может выполнять добавления параллельно. В общем, если код векторизован, базовая реализация имеет больше свободы в предположениях, которые она может сделать, чтобы добиться более быстрого выполнения.
zh_cn: 这不仅容易编写；它在内部也更容易优化。Octave将此操作委托给一个基础实现，该实现除了其他优化之外，还可以使用特殊的矢量硬件指令，或者甚至可以并行执行加法。通常，如果代码是矢量化的，则基础实现对其可以进行的假设具有更大的自由度，以实现更快的执行。

source: This kind of code can however be very cumbersome to both write and maintain. To overcome this problem Octave supports the <code>switch</code> statement. Using this statement, the above example becomes
es: Sin embargo, este tipo de c&oacute;digo puede ser muy engorroso tanto de escribir como de mantener. Para superar este problema, Octave admite la declaraci&oacute;n de <code>switch</code> . Usando esta declaraci&oacute;n, el ejemplo anterior se convierte en
ru: Однако такой код может быть очень громоздким как для написания, так и для поддержки. Чтобы решить эту проблему, Octave поддерживает оператор <code>switch</code> . Используя этот оператор, приведенный выше пример становится
zh_cn: 但是，此类代码在编写和维护时都非常麻烦。为克服此问题，Octave支持 <code>switch</code> 语句。使用此语句，上面的示例变为

source: This linear transformation of <var>x</var> improves the numerical stability of the fit.
es: Esta transformaci&oacute;n lineal de <var>x</var> mejora la estabilidad num&eacute;rica del ajuste.
ru: Это линейное преобразование <var>x</var> улучшает численную стабильность подгонки.
zh_cn: <var>x</var> 的这种线性变换提高了拟合的数值稳定性。

source: This load order leads to functions that are provided by dependencies being potentially shadowed by functions of the same name that are provided by top-level packages.
zh_cn: 这种加载顺序会导致由依赖关系提供的函数有可能被顶层包提供的同名函数所影响。

source: This manual provides comprehensive documentation on how to install, run, use, and extend GNU Octave. Additional chapters describe how to report bugs and help contribute code.
es: Este manual proporciona una completa documentación sobre cómo instalar,ejecutar,usar y extender GNU Octave.Los capítulos adicionales describen cómo reportar errores y ayudar a contribuir con el código.
ru: Это руководство содержит исчерпывающую документацию по установке,запуску,использованию и расширению GNU Octave.Дополнительные главы описывают,как сообщать об ошибках и помогать в написании кода.
zh_cn: 本手册提供了关于如何安装、运行、使用和扩展 GNU Octave 的全面文档。其他章节介绍了如何报告错误和帮助贡献代码。

source: This matches a literal &lsquo;
es: Esto coincide con un literal '
ru: Это соответствует буквальному '
zh_cn: 这与文字'

source: This may be useful, for example, when using inline functions with numerical integration or optimization where a vector-valued function is expected.
es: Esto puede ser útil,por ejemplo,cuando se utilizan funciones en línea con integración numérica u optimización donde se espera una función con valor vectorial.
ru: Это может быть полезно,например,при использовании встроенных функций с числовым интегрированием или оптимизации,когда ожидается использование векторно-значимой функции.
zh_cn: 例如,当使用数值积分或优化的内联函数时,这可能是有用的,在这种情况下,预期的是一个矢量值的函数。

source: This may include either wildcard replacement or special character escaping.
es: Esto puede incluir tanto el reemplazo de comodines como la fuga de personajes especiales.
ru: Это может включать в себя либо замену подстановочного знака,либо уход специального символа.
zh_cn: 这可能包括通配符替换或特殊字符转义。

source: This means, for example, adding new objects to the scene will not retarget the camera:
es: Esto significa,por ejemplo,que al añadir nuevos objetos a la escena no se reajustará la cámara:
ru: Это означает,что,например,добавление новых объектов в сцену не повлечет за собой повторной наведения на камеру:
zh_cn: 这意味着,例如,在场景中添加新的对象将不会重新瞄准摄像机。

source: This method is also called when an object appears as lvalue with cs-list indexing, i.e., <code>object{&hellip;}</code> or <code>object(&hellip;).field</code>.
es: Este m&eacute;todo tambi&eacute;n se llama cuando un objeto aparece como lvalue con indexaci&oacute;n cs-list, es decir, <code>object{&hellip;}</code> u <code>object(&hellip;).field</code> .
ru: Этот метод также вызывается, когда объект отображается как lvalue с индексированием cs-list, то есть <code>object{&hellip;}</code> или <code>object(&hellip;).field</code> .
zh_cn: 当一个对象以带有cs-list索引的左值出现时，也称为此方法，即 <code>object{&hellip;}</code> 或 <code>object(&hellip;).field</code> 。

source: This method returns a pointer to the underlying data of the matrix or array so that it can be manipulated directly, either within Octave or by an external library.
es: Este método devuelve un puntero a los datos subyacentes de la matriz o matriz para que pueda ser manipulado directamente,ya sea dentro de la Octava o por una biblioteca externa.
ru: Этот метод возвращает указатель на базовые данные матрицы или массива,чтобы им можно было манипулировать напрямую,как в пределах Октавы,так и с помощью внешней библиотеки.
zh_cn: 该方法返回一个指向矩阵或数组的底层数据的指针,这样就可以直接在Octave内部或由外部库进行操作。

source: This of course assumes that the file &lsquo;
es: Esto, por supuesto, supone que el archivo '
ru: Это, конечно, предполагает, что файл '
zh_cn: 当然，这假设文件&ldquo;

source: This operation broadcasts the two matrices with permuted dimensions across each other during elementwise multiplication in order to obtain a larger 3-D array, and this array is then summed along the third dimension. A moment of thought will prove that this operation is simply the much faster ordinary matrix multiplication, <code><var>c</var> = <var>a</var>*<var>b</var>;</code>.
es: Esta operaci&oacute;n transmite las dos matrices con dimensiones permutadas entre s&iacute; durante la multiplicaci&oacute;n por elementos para obtener una matriz 3-D m&aacute;s grande, y esta matriz luego se suma a lo largo de la tercera dimensi&oacute;n. Un momento de reflexi&oacute;n demostrar&aacute; que esta operaci&oacute;n es simplemente la multiplicaci&oacute;n de matrices ordinaria mucho m&aacute;s r&aacute;pida, <code><var>c</var> = <var>a</var>*<var>b</var>;</code> .
ru: Эта операция транслирует две матрицы с переставленными измерениями друг на друга во время поэлементного умножения, чтобы получить больший трехмерный массив, а затем этот массив суммируется по третьему измерению. Немного подумав, мы докажем, что эта операция - просто гораздо более быстрое умножение обычных матриц, <code><var>c</var> = <var>a</var>*<var>b</var>;</code> .
zh_cn: 此操作在元素逐次乘法过程中将彼此置换尺寸的两个矩阵相互广播，以获得更大的3-D数组，然后将该数组沿第三维进行求和。片刻的思考将证明此运算只是更快的普通矩阵乘法，即 <code><var>c</var> = <var>a</var>*<var>b</var>;</code> 。
