Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/octave/octave.*.011.xlf
Languages: es, ja, ru, zh_cn

source: Absolute tolerance. May be either vector or scalar. If a vector, it must match the dimension of the state vector, and the relative tolerance must also be a vector of the same length.
es: Tolerancia absoluta.Puede ser vectorial o escalar.Si es vector,debe coincidir con la dimensión del vector de estado,y la tolerancia relativa debe ser también un vector de la misma longitud.
ja: 絶対的な許容範囲。ベクトルでもスカラでもよい。ベクトルの場合は、状態ベクトルの次元と一致しなければならず、相対的な許容範囲も同じ長さのベクトルでなければなりません。
ru: Абсолютная терпимость.Может быть векторной или скалярной.Если вектор,то он должен соответствовать размерности вектора состояния,а относительный допуск также должен быть вектором той же длины.
zh_cn: 绝对公差。可以是向量或标量。如果是向量,它必须与状态向量的维度相匹配,相对容差也必须是相同长度的向量。

source: Absolute tolerance. May be either vector or scalar. If a vector, it must match the dimension of the state vector.
es: Tolerancia absoluta.Puede ser vectorial o escalar.Si es vectorial,debe coincidir con la dimensión del vector de estado.
ja: 絶対的な許容範囲。ベクトルでもスカラでもよい。ベクトルの場合は、状態ベクトルの次元と一致しなければなりません。
ru: Абсолютная терпимость.Может быть векторной или скалярной.Если вектор,то он должен соответствовать размерности вектора состояния.
zh_cn: 绝对公差。可以是向量或标量。如果是向量,它必须与状态向量的维度相匹配。

source: Absolute tolerance; may be zero for pure relative error test.
es: Tolerancia absoluta;puede ser cero para la prueba de error relativo puro.
ja: 絶対許容差;純粋な相対誤差テストではゼロになることがあります。
ru: Абсолютный допуск;может быть равен нулю для теста на чистую относительную погрешность.
zh_cn: 绝对公差;对于纯相对误差测试,可能为零。

source: Abstract Window Toolkit for GUIs.
es: Kit de herramientas de ventanas abstractas para GUI.
ja: GUI用の抽象ウィンドウツールキット。
ru: Инструментарий абстрактных окон для графических интерфейсов.
zh_cn: GUIs的抽象窗口工具包。

source: Accept the current line regardless of where the cursor is. If the line is non-empty, add it to the history list. If the line was a history line, then restore the history line to its original state.
es: Acepta la línea actual sin importar dónde esté el cursor.Si la línea no está vacía,agréguela a la lista de historial.Si la línea era una línea de historia,entonces restaure la línea de historia a su estado original.
ja: カーソルの位置に関係なく、現在の行を受け入れます。行が空でない場合は、その行を履歴リストに追加します。行が履歴行であった場合は、履歴行を元の状態に戻す。
ru: Принять текущую строку независимо от того,где находится курсор.Если строка не пуста,добавьте ее в список истории.Если строка была строкой истории,то восстановить строку истории до ее первоначального состояния.
zh_cn: 无论光标在哪里,都接受当前的行。如果该行是非空行,则将其添加到历史记录列表中。如果该行是历史行,则将历史行恢复到原始状态。

source: Access via Handle
es: Acceso a través de la manija
ja: ハンドルからのアクセス
ru: Доступ через ручку
zh_cn: 通过手柄访问

source: Accessing Global Variables in Oct-Files
es: Acceso a las variables globales en los archivos de octubre
ja: Oct-Fileでのグローバル変数へのアクセス
ru: Доступ к глобальным переменным в октябрьских файлах
zh_cn: 在Oct-Files中访问全局变量

source: Accessing multiple elements of a cell array with the &lsquo;
es: Accediendo a m&uacute;ltiples elementos de una matriz de celdas con el '
ja: 'を使用してセル配列の複数の要素にアクセスする
ru: Доступ к нескольким элементам массива ячеек с помощью '
zh_cn: 使用'访问单元格数组的多个元素

source: Accessing the fields of the structure can then be performed with <code>mxGetField</code> and <code>mxSetField</code> or alternatively with the <code>mxGetFieldByNumber</code> and <code>mxSetFieldByNumber</code> functions.
es: El acceso a los campos de la estructura se puede realizar con <code>mxGetField</code> y <code>mxSetField</code> o alternativamente con las funciones <code>mxGetFieldByNumber</code> y <code>mxSetFieldByNumber</code> .
ja: 構造体のフィールドへのアクセスは、 <code>mxGetField</code> および <code>mxSetField</code> 、あるいは <code>mxGetFieldByNumber</code> および <code>mxSetFieldByNumber</code> 関数を使用して実行できます。
ru: Доступ к полям структуры затем может быть выполнен с помощью <code>mxGetField</code> и <code>mxSetField</code> или, альтернативно, с помощью <code>mxGetFieldByNumber</code> и <code>mxSetFieldByNumber</code> .
zh_cn: 然后，可以使用 <code>mxGetField</code> 和 <code>mxSetField</code> 或使用 <code>mxGetFieldByNumber</code> 和 <code>mxSetFieldByNumber</code> 函数来访问结构的字段。

source: According to broadcasting rules, if one operand is a scalar and the other is a matrix, the scalar is compared to each element of the matrix in turn, and the result is the same size as the matrix.
es: Según las normas de radiodifusión,si un operando es un escalar y el otro es una matriz,el escalar se compara a su vez con cada elemento de la matriz,y el resultado es del mismo tamaño que la matriz.
ja: 放送ルールによれば、一方のオペランドがスカラーで他方のオペランドが行列の場合、スカラーは行列の各要素と順番に比較され、結果は行列と同じ大きさになる。
ru: Согласно правилам вещания,если один операнд является скаляром,а другой-матрицей,то скаляр поочередно сравнивается с каждым элементом матрицы,и в результате получается тот же размер,что и матрица.
zh_cn: 根据广播规则,如果一个操作数是标量,另一个操作数是矩阵,则依次将标量与矩阵的每个元素进行比较,结果与矩阵大小相同。

source: Accordingly, with <a href="java-interface-functions#XREFjava_005fset">java_set</a> the value of a field can be set. Note that only public Java fields are accessible from within Octave.
es: En consecuencia, con <a href="java-interface-functions#XREFjava_005fset">java_set</a> se puede establecer el valor de un campo. Tenga en cuenta que solo se puede acceder a los campos p&uacute;blicos de Java desde Octave.
ja: したがって、<a href="java-interface-functions#XREFjava_005fset">java_set</a>を使用してフィールドの値を設定できます。Octave内からアクセスできるのはパブリックJavaフィールドのみであることに注意してください。
ru: Соответственно, с помощью <a href="java-interface-functions#XREFjava_005fset">java_set можно</a> установить значение поля. Обратите внимание, что из Octave доступны только общедоступные поля Java.
zh_cn: 因此，使用<a href="java-interface-functions#XREFjava_005fset">java_set</a>可以设置字段的值。请注意，只能从Octave访问公共Java字段。

source: Accumulation functions
es: Funciones de acumulación
ja: 蓄積機能
ru: Накопительные функции
zh_cn: 积累功能

source: Adaptive Quadrature - Revisited
es: Cuadratura Adaptable-Revisado
ja: 適応直交法-再訪
ru: Адаптивная квадратность-пересмотрено
zh_cn: 自适应正交-重新审视

source: Adaptive quadrature is used to minimize the estimate of error until the following is satisfied:
es: La cuadratura adaptativa se utiliza para minimizar la estimación del error hasta que se cumpla lo siguiente:
ja: 以下の条件を満たすまで誤差の推定値を最小化するために、適応的な求積法が使用されます。
ru: Адаптивная квадратура используется для минимизации оценки погрешности до тех пор,пока не будет выполнено следующее:
zh_cn: 自适应正交用于最小化估计误差,直到满足以下条件。

source: Add <var>clspath</var> to the beginning of the dynamic class path of the Java virtual machine.
ja: Java仮想マシンの動的クラスパスの先頭に <var>clspath</var> を追加します。
zh_cn: 将 <var>clspath</var> 添加到Java虚拟机的动态类路径的开头。

source: Add <var>clspath</var> to the dynamic class path of the Java virtual machine.
es: Agregue <var>clspath</var> a la ruta de clases din&aacute;mica de la m&aacute;quina virtual Java.
ja: Java仮想マシンの動的クラスパスに <var>clspath</var> を追加します。
ru: Добавьте <var>clspath</var> в путь динамического класса виртуальной машины Java.
zh_cn: 将 <var>clspath</var> 添加到Java虚拟机的动态类路径。

source: Add <var>q</var> amount of time (with units <var>f</var>) to the serial datenum, <var>d</var>.
es: Agregue <var>q</var> cantidad de tiempo (con unidades <var>f</var> ) al datenum serial, <var>d</var> .
ja: <var>q</var> の時間（単位は <var>f</var> ）をシリアル日付番号 <var>d</var> に追加します。
ru: Добавьте <var>q</var> количество времени (в единицах <var>f</var> ) к серийному datenum, <var>d</var> .
zh_cn: 将 <var>q</var> 的时间量（单位为 <var>f</var> ）加到序列日期 <var>d</var> 中。

source: Add a colorbar to the current axes.
es: Añade una barra de color a los ejes actuales.
ja: 現在の軸にカラーバーを追加します。
ru: Добавьте цветовую панель к текущим осям.
zh_cn: 在当前轴上添加一个颜色条。

source: Add a light object to a figure using a simple interface.
es: Añade un objeto ligero a una figura usando una simple interfaz.
ja: シンプルなインターフェースを使用して、図にライトオブジェクトを追加します。
ru: Добавьте световой объект к фигуре с помощью простого интерфейса.
zh_cn: 使用简单的界面为图中添加一个光对象。

source: Add a light object to a plot
es: Añadir un objeto luminoso a una trama
ja: プロットにライトオブジェクトを追加
ru: Добавить световой объект на участок
zh_cn: 在剧情中添加一个光对象

source: Add a light object to the current axes using spherical coordinates.
ja: 球面座標を使用して、現在の軸にライトオブジェクトを追加します。
zh_cn: 使用球面坐标在当前轴上添加一个光对象。

source: Add a preview to EPS files. Supported formats are:
es: Añade una vista previa a los archivos EPS.Los formatos soportados son:
ja: EPSファイルにプレビューを追加します。サポートされている形式は以下の通りです。
ru: Добавить предварительный просмотр EPS файлов.Поддерживаемые форматы:
zh_cn: 为EPS文件添加预览。支持的格式有:

source: Add date-formatted tick labels to an axis.
es: Añade etiquetas con formato de fecha a un eje.
ja: 軸に日付書式の目盛りラベルを追加します。
ru: Добавьте к оси метки в формате данных.
zh_cn: 在轴上添加日期格式的刻度线标签。

source: Add labels to the contours of a contour plot.
es: Añade etiquetas a los contornos de una trama de contorno.
ja: 等高線プロットの等高線にラベルを追加します。
ru: Добавьте метки к контурам контурного графика.
zh_cn: 在等高线图的等高线上添加标签。

source: Add named directories to the function search path.
es: Añade directorios con nombre a la ruta de búsqueda de la función.
ja: 関数の検索パスに名前付きディレクトリを追加します。
ru: Добавьте именованные каталоги в путь поиска функций.
zh_cn: 在函数搜索路径中添加命名目录。

source: Add named packages to the path. After loading a package it is possible to use the functions provided by the package. For example,
es: Añade paquetes con nombre al camino.Después de cargar un paquete,es posible utilizar las funciones que el paquete proporciona.Por ejemplo,
ja: 名前付きパッケージをパスに追加します。パッケージをロードした後、そのパッケージが提供する関数を使用することができます。例えば、以下のようになります。
ru: Добавьте именованные пакеты в путь.После загрузки пакета можно использовать функции,предоставляемые пакетом.Например,
zh_cn: 将命名的包添加到路径中。加载包后,可以使用包提供的函数。例如:

source: Add new graphic objects to the current axes. This is equivalent to <code>hold on</code>.
es: Agrega nuevos objetos gr&aacute;ficos a los ejes actuales. Esto es equivalente a <code>hold on</code> .
ja: 現在のAxesに新しいグラフィックオブジェクトを追加します。これは <code>hold on</code> と同じです。
ru: Добавить новые графические объекты к текущим осям. Это эквивалентно <code>hold on</code> .
zh_cn: 将新的图形对象添加到当前轴。这相当于 <code>hold on</code> 。

source: Add new graphic objects to the current figure.
es: Añade nuevos objetos gráficos a la figura actual.
ja: 現在の図に新しいグラフィックオブジェクトを追加します。
ru: Добавьте новые графические объекты к текущему рисунку.
zh_cn: 在当前图中添加新的图形对象。

source: Add path to the head of the search path for function files. The value of <var>path</var> specified on the command line will override any value of <code>OCTAVE_PATH</code> found in the environment, but not any commands in the system or user startup files that set the internal load path through one of the path functions.
es: Agregue una ruta al encabezado de la ruta de b&uacute;squeda para archivos de funciones. El valor de la <var>path</var> especificado en la l&iacute;nea de comandos anular&aacute; cualquier valor de <code>OCTAVE_PATH</code> que se encuentre en el entorno, pero no los comandos del sistema o los archivos de inicio del usuario que establezcan la ruta de carga interna a trav&eacute;s de una de las funciones de la ruta.
ja: 関数ファイルの検索パスの先頭にパスを追加します。コマンドラインで指定された <var>path</var> の値は、環境で見つかった <code>OCTAVE_PATH</code> の値をオーバーライドしますが、パス関数の1つを介して内部ロードパスを設定するシステムまたはユーザースタートアップファイルのコマンドはオーバーライドしません。
ru: Добавьте путь в начало пути поиска файлов функций. Значение <var>path</var> указанное в командной строке, переопределит любое значение <code>OCTAVE_PATH</code> , обнаруженное в среде, но не любые команды в системных или пользовательских файлах запуска, которые устанавливают внутренний путь загрузки с помощью одной из функций пути.
zh_cn: 在功能文件的搜索路径的开头添加路径。在命令行上指定的 <var>path</var> 的值将覆盖在环境中找到的 <code>OCTAVE_PATH</code> 的任何值，但不能设置通过路径功能之一设置内部加载路径的系统或用户启动文件中的任何命令。

source: Add path to the head of the search path for images. The value of <var>path</var> specified on the command line will override any value of <code>OCTAVE_IMAGE_PATH</code> found in the environment, but not any commands in the system or user startup files that call the <code>IMAGE_PATH</code> function.
ja: 画像の検索パスの先頭にパスを追加します。コマンドラインで指定された <var>path</var> の値は、環境で見つかった <code>OCTAVE_IMAGE_PATH</code> の値を上書きしますが、 <code>IMAGE_PATH</code> 関数を呼び出すシステムまたはユーザー起動ファイルのコマンドは上書きしません。
zh_cn: 将路径添加到图像的搜索路径的开头。在命令行上指定的 <var>path</var> 的值将覆盖在环境中找到的 <code>OCTAVE_IMAGE_PATH</code> 的任何值，但不会调用系统或用户启动文件中调用 <code>IMAGE_PATH</code> 函数的任何命令。

source: Add path to the head of the search path for images. The value of <var>path</var> specified on the command line will override any value of <code>OCTAVE_IMAGE_PATH</code> found in the environment, but not any commands in the system or user startup files that set the built-in variable <code>IMAGE_PATH</code>.
es: Agregue una ruta al principio de la ruta de b&uacute;squeda de im&aacute;genes. El valor de la <var>path</var> especificado en la l&iacute;nea de comandos anular&aacute; cualquier valor de <code>OCTAVE_IMAGE_PATH</code> que se encuentre en el entorno, pero no los comandos del sistema o los archivos de inicio del usuario que establezcan la variable <code>IMAGE_PATH</code> .
ja: 画像の検索パスの先頭にパスを追加します。コマンドラインで指定された <var>path</var> の値は、環境で見つかった <code>OCTAVE_IMAGE_PATH</code> の値を上書きしますが、組み込み変数 <code>IMAGE_PATH</code> を設定するシステムまたはユーザースタートアップファイルのコマンドは上書きしません。
ru: Добавьте путь в начало пути поиска изображений. Значение <var>path</var> указанное в командной строке, переопределит любое значение <code>OCTAVE_IMAGE_PATH</code> , найденное в среде, но не любые команды в системных или пользовательских файлах запуска, которые устанавливают встроенную переменную <code>IMAGE_PATH</code> .
zh_cn: 将路径添加到图像搜索路径的开头。在命令行上指定的 <var>path</var> 的值将覆盖在环境中找到的 <code>OCTAVE_IMAGE_PATH</code> 的任何值，但不会设置系统或用户启动文件中设置内置变量 <code>IMAGE_PATH</code> 的任何命令。

source: Add the definition DEF to the compiler call.
es: Añade la definición DEF a la llamada del compilador.
ja: コンパイラの呼び出しに定義defを追加します。
ru: Добавьте определение DEF к вызову компилятора.
zh_cn: 在编译器调用中加入定义DEF。

source: Add the include directory DIR to compile commands.
es: Añade el directorio de inclusión DIR para compilar los comandos.
ja: コマンドをコンパイルするためのインクルードディレクトリDIRを追加します。
ru: Добавьте включенный каталог DIR для компиляции команд.
zh_cn: 在编译命令中加入包含目录DIR。

source: Add the library LIB to the link command.
es: Añade el LIB de la biblioteca al comando de enlace.
ja: リンクコマンドにライブラリLIBを追加します。
ru: Добавьте библиотечную LIB к команде link.
zh_cn: 在链接命令中加入库LIB。

source: Add the library directory DIR to the link command.
es: Añade el directorio de la biblioteca DIR al comando de enlace.
ja: リンクコマンドにライブラリディレクトリDIRを追加します。
ru: Добавьте библиотечный каталог DIR к команде link.
zh_cn: 在链接命令中加入库目录DIR。

source: Add the named function or function handle <var>fcn</var> to the list of functions to call periodically when Octave is waiting for input.
es: Agregue la funci&oacute;n nombrada o el identificador de funci&oacute;n <var>fcn</var> a la lista de funciones para llamar peri&oacute;dicamente cuando Octave est&eacute; esperando una entrada.
ja: 名前付き関数または関数ハンドル <var>fcn</var> を関数のリストに追加して、Octaveが入力を待機しているときに定期的に呼び出すようにします。
ru: Добавьте названную функцию или дескриптор функции <var>fcn</var> в список функций для периодического вызова, когда Octave ожидает ввода.
zh_cn: 将命名函数或函数句柄 <var>fcn</var> 添加到函数列表中，以在Octave等待输入时定期调用。

source: Add the next character that you type to the line verbatim. This is how to insert things like
es: Añade el siguiente personaje que escribas a la línea al pie de la letra.Así es como se insertan cosas como
ja: 入力した次の文字を、その行に逐語的に追加します。のようなものを挿入する方法です。
ru: Добавьте следующий символ в строку дословно.Вот как вставить такие вещи как
zh_cn: 将你输入的下一个字符逐字添加到行中。这就是插入以下内容的方法

source: Add the preference <var>pref</var> and associated value <var>val</var> to the named preference group <var>group</var>.
es: Agregue la preferencia <var>pref</var> y el valor asociado <var>val</var> al grupo de <var>group</var> preferencias nombrado .
ja: 名前付き設定グループ <var>group</var> に設定 <var>pref</var> と関連する値 <var>val</var> を追加します。
ru: Добавьте предпочтение <var>pref</var> и соответствующее значение <var>val</var> к названному предпочтение групповой <var>group</var> .
zh_cn: 喜好添加 <var>pref</var> 和相关值 <var>val</var> 到指定的偏好组 <var>group</var> 。

source: Add the run-time path to the link command.
es: Añade la ruta de ejecución al comando de enlace.
ja: linkコマンドにランタイムパスを追加します。
ru: Добавьте путь выполнения к команде link.
zh_cn: 在链接命令中添加运行时路径。

source: Adding &rsquo;*&rsquo; to the start of any method above forces <code>interp1</code> to assume that <var>x</var> is uniformly spaced, and only <code><var>x</var>(1)</code> and <code><var>x</var>(2)</code> are referenced. This is usually faster, and is never slower. The default method is <code>"linear"</code>.
es: Agregar '*' al comienzo de cualquier m&eacute;todo anterior obliga a <code>interp1</code> a asumir que <var>x</var> est&aacute; uniformemente espaciado, y solo se hace referencia a <code><var>x</var>(1)</code> y <code><var>x</var>(2)</code> . Esto suele ser m&aacute;s r&aacute;pido y nunca m&aacute;s lento. El m&eacute;todo predeterminado es <code>"linear"</code> .
ja: 上記のメソッドの先頭に「*」を追加すると、 <code>interp1</code> は <var>x</var> が等間隔に配置され、 <code><var>x</var>(1)</code> と <code><var>x</var>(2)</code> のみが参照されると想定します。これは通常より速く、決して遅くなることはありません。デフォルトの方法は <code>"linear"</code> です。
ru: Добавление '*' в начало любого метода, приведенного выше, вынуждает <code>interp1</code> предполагать, что <var>x</var> равномерно распределен, и только ссылки на <code><var>x</var>(1)</code> и <code><var>x</var>(2)</code> . Обычно это происходит быстрее и никогда не бывает медленнее. Метод по умолчанию - <code>"linear"</code> .
zh_cn: 在上述任何方法的开头添加&ldquo; *&rdquo;会强制 <code>interp1</code> 假定 <var>x</var> 的间距均匀，并且仅引用 <code><var>x</var>(1)</code> 和 <code><var>x</var>(2)</code> 。通常这会更快，并且永远不会变慢。默认方法是 <code>"linear"</code> 。

source: Adding a diagonal matrix to a full matrix only operates on the diagonal elements. Thus,
es: Añadir una matriz diagonal a una matriz completa sólo funciona con los elementos diagonales.Por lo tanto,
ja: 完全な行列に対角線の行列を追加すると、対角線の要素に対してのみ動作します。したがって
ru: Добавление диагональной матрицы к полной матрице работает только на диагональных элементах.Таким образом,
zh_cn: 在全矩阵中添加对角矩阵,只对对角线元素进行操作。因此:

source: Addition. If both operands are matrices, the number of rows and columns must both agree, or they must be broadcastable to the same shape.
es: Adición.Si ambas operandos son matrices,el número de filas y columnas debe coincidir,o deben ser emitidas con la misma forma.
ja: 加算です。オペランドが両方とも行列である場合、行と列の数が両方とも一致しなければならないか、同じ形状にブロードキャスト可能でなければなりません。
ru: Добавление.Если оба операнда являются матрицами,то количество строк и столбцов должно совпадать,или они должны быть транслируемы в одной и той же форме.
zh_cn: 加法。如果两个操作数都是矩阵,则行数和列数必须都是一致的,或者必须是可以广播到相同的形状。

source: Additional Calling Syntaxes
es: Sintaxis de llamadas adicionales
ja: 追加の呼び出し構文
ru: Дополнительные синтаксисы вызова
zh_cn: 其他调用语法

source: Additional arguments <var>p1</var>, etc., are passed directly to the function <var>f</var>. To use default values for <var>tol</var> and <var>trace</var>, one may pass empty matrices ([]).
es: Los argumentos adicionales <var>p1</var> , etc., se pasan directamente a la funci&oacute;n <var>f</var> . Para usar valores predeterminados para <var>tol</var> y <var>trace</var> , se pueden pasar matrices vac&iacute;as ([]).
ja: 追加の引数 <var>p1</var> などは、関数 <var>f</var> に直接渡されます。 <var>tol</var> と <var>trace</var> にデフォルト値を使用するには、空の行列（[]）を渡します。
ru: Дополнительные аргументы <var>p1</var> и т. Д. Передаются непосредственно в функцию <var>f</var> . Чтобы использовать значения по умолчанию для <var>tol</var> и <var>trace</var> , можно передать пустые матрицы ([]).
zh_cn: 其他参数 <var>p1</var> 等直接传递给函数 <var>f</var> 。要将默认值用于 <var>tol</var> 和 <var>trace</var> ，可以传递空矩阵（[]）。

source: Additional arguments are summarized below.
es: A continuación se resumen otros argumentos.
ja: 追加の論拠は以下にまとめられています。
ru: Дополнительные аргументы кратко изложены ниже.
zh_cn: 其他论点概述如下。

source: Additional arguments determine the shape of the return matrix. When no arguments are specified a single random integer is returned. If one argument <var>n</var> is specified then a square matrix (<var>n</var> x <var>n</var>) is returned. Two or more arguments will return a multi-dimensional matrix (<var>m</var> x <var>n</var> x &hellip;).
es: Los argumentos adicionales determinan la forma de la matriz de retorno. Cuando no se especifican argumentos, se devuelve un &uacute;nico entero aleatorio. Si se especifica un argumento <var>n</var> , se devuelve una matriz cuadrada ( <var>n</var> x <var>n</var> ). Dos o m&aacute;s argumentos devolver&aacute;n una matriz multidimensional ( <var>m</var> x <var>n</var> x&hellip;).
ja: 追加の引数は、戻り行列の形状を決定します。引数を指定しないと、単一のランダムな整数が返されます。1つの引数 <var>n</var> を指定すると、正方行列（ <var>n</var> x <var>n</var> ）が返されます。2つ以上の引数が多次元行列（ <var>m</var> x <var>n</var> x&hellip;）を返します。
ru: Дополнительные аргументы определяют форму возвращаемой матрицы. Если аргументы не указаны, возвращается одно случайное целое число. Если указан один аргумент <var>n</var> , возвращается квадратная матрица ( <var>n</var> x <var>n</var> ). Два или более аргумента вернут многомерную матрицу ( <var>m</var> x <var>n</var> x&hellip;).
zh_cn: 附加参数确定返回矩阵的形状。如果未指定任何参数，则返回单个随机整数。如果指定了一个参数 <var>n</var> ,则返回方阵（ <var>n</var> x <var>n</var> ）。两个或多个参数将返回一个多维矩阵（ <var>m</var> x <var>n</var> x&hellip;）。

source: Additional arguments name a list of parent classes from which the new class is derived.
es: Los argumentos adicionales nombran una lista de las clases parentales de las que se deriva la nueva clase.
ja: 追加の引数には、新しいクラスが派生する親クラスのリストを指定します。
ru: Дополнительные аргументы называют список родительских классов,из которых выводится новый класс.
zh_cn: 额外的参数命名了一个父类的列表,新的类是由它派生出来的。

source: Additional arguments to pass to the external plotting program may also be given. The default value is <code>"gnuplot"</code> with no additional arguments. See <a href="installation#Installation">Installation</a>.
es: Tambi&eacute;n se pueden proporcionar argumentos adicionales para pasar al programa de trazado externo. El valor predeterminado es <code>"gnuplot"</code> sin argumentos adicionales. Ver <a href="installation#Installation">instalaci&oacute;n</a> .
ja: 外部プロットプログラムに渡す追加の引数も指定できます。デフォルト値は <code>"gnuplot"</code> で、追加の引数はありません。<a href="installation#Installation">インストールを</a>参照してください。
ru: Также могут быть указаны дополнительные аргументы для передачи внешней программе построения графиков. Значение по умолчанию - <code>"gnuplot"</code> без дополнительных аргументов. См. <a href="installation#Installation">Установка</a> .
zh_cn: 还可以给出传递给外部绘图程序的其他参数。默认值为 <code>"gnuplot"</code> ，不带其他参数。请参阅<a href="installation#Installation">安装</a>。

source: Additional arguments, are passed directly to <var>f</var>. To use the default value for <var>tol</var> or <var>quadf</var> one may pass <code>':'</code> or an empty matrix ([]).
es: Los argumentos adicionales se pasan directamente a <var>f</var> . Para usar el valor predeterminado de <var>tol</var> o <var>quadf</var> , se puede pasar <code>':'</code> o una matriz vac&iacute;a ([]).
ja: 追加の引数は直接 <var>f</var> に渡されます。 <var>tol</var> または <var>quadf</var> のデフォルト値を使用するには、 <code>':'</code> または空の行列（[]）を渡します。
ru: Дополнительные аргументы передаются непосредственно в <var>f</var> . Чтобы использовать значение по умолчанию для <var>tol</var> или <var>quadf</var> , можно передать <code>':'</code> или пустую матрицу ([]).
zh_cn: 其他参数直接传递给 <var>f</var> 。要为 <var>tol</var> 或 <var>quadf</var> 使用默认值，可以传递 <code>':'</code> 或空矩阵（[]）。

source: Additional devices are supported by Ghostscript. Some examples are:
es: Ghostscript admite dispositivos adicionales.Algunos ejemplos son:
ja: 追加のデバイスはGhostscriptでサポートされています。いくつかの例があります。
ru: Дополнительные устройства поддерживаются Ghostscript.Некоторые примеры:
zh_cn: Ghostscript 还支持其他设备。一些例子是:
