Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/angular/angular.*.006.xlf
Languages: es, ja, ko, ru, zh_cn

source: Contains your library project's logic and data. Like an application project, a library project can contain components, services, modules, directives, and pipes.
es: Contiene la lógica y los datos de su proyecto de biblioteca.Al igual que un proyecto de aplicación,un proyecto de biblioteca puede contener componentes,servicios,módulos,directivas y tuberías.
ja: ライブラリプロジェクトのロジックとデータを格納します。アプリケーションプロジェクトと同様に、ライブラリプロジェクトにはコンポーネント、サービス、モジュール、ディレクティブ、パイプを含めることができます。
ko: 라이브러리 프로젝트의 논리 및 데이터를 포함합니다. 응용 프로그램 프로젝트와 같이 라이브러리 프로젝트에는 구성 요소, 서비스, 모듈, 지시문 및 파이프가 포함될 수 있습니다.
ru: Содержит логику и данные проекта вашей библиотеки.Как и проект приложения,проект библиотеки может содержать компоненты,сервисы,модули,директивы и трубы.

source: Content Security Policy (CSP) is a defense-in-depth technique to prevent XSS. To enable CSP, configure your web server to return an appropriate <code>Content-Security-Policy</code> HTTP header. Read more about content security policy at <a href="http://www.html5rocks.com/en/tutorials/security/content-security-policy/">An Introduction to Content Security Policy</a> on the HTML5Rocks website.
es: La Pol&iacute;tica de seguridad de contenido (CSP) es una t&eacute;cnica de defensa en profundidad para prevenir XSS. Para habilitar CSP, configure su servidor web para que devuelva un encabezado HTTP de <code>Content-Security-Policy</code> apropiado . Lea m&aacute;s sobre la pol&iacute;tica de seguridad de contenido en <a href="http://www.html5rocks.com/en/tutorials/security/content-security-policy/">Introducci&oacute;n a la pol&iacute;tica de seguridad de contenido</a> en el sitio web HTML5Rocks.
ja: コンテンツセキュリティポリシー（CSP）は、XSSを防ぐための多層防御手法です。CSPを有効にするには、適切な <code>Content-Security-Policy</code> HTTPヘッダーを返すようにWebサーバーを構成します。コンテンツセキュリティポリシーの詳細については、HTML5Rocks Webサイトの「<a href="http://www.html5rocks.com/en/tutorials/security/content-security-policy/">コンテンツセキュリティポリシーの概要」を</a>参照してください。
ko: CSP (콘텐츠 보안 정책)는 XSS를 방지하기위한 심층 보안 기술입니다. CSP를 사용하려면 적절한 <code>Content-Security-Policy</code> HTTP 헤더 를 반환하도록 웹 서버를 구성하십시오 . HTML5Rocks 웹 사이트의 <a href="http://www.html5rocks.com/en/tutorials/security/content-security-policy/">컨텐츠 보안 정책 소개에서 컨텐츠 보안 정책</a> 에 대해 자세히 알아보십시오 .
ru: Политика безопасности контента (CSP) - это метод углубленной защиты от XSS. Чтобы включить CSP, настройте свой веб-сервер так, чтобы он возвращал соответствующий HTTP-заголовок <code>Content-Security-Policy</code> . Узнайте больше о политике безопасности <a href="http://www.html5rocks.com/en/tutorials/security/content-security-policy/">контента</a> в разделе Введение в политику безопасности контента на веб-сайте HTML5Rocks.

source: Content Security Policy (CSP) is a defense-in-depth technique to prevent XSS. To enable CSP, configure your web server to return an appropriate <code>Content-Security-Policy</code> HTTP header. Read more about content security policy at <a href="https://www.html5rocks.com/en/tutorials/security/content-security-policy/">An Introduction to Content Security Policy</a> on the HTML5Rocks website.
ru: Политика безопасности контента (CSP) - это методика глубокой защиты для предотвращения XSS. Чтобы включить CSP, настройте свой веб-сервер так, чтобы он возвращал соответствующий HTTP-заголовок <code>Content-Security-Policy</code> . Подробнее о политике безопасности контента читайте в разделе &laquo; <a href="https://www.html5rocks.com/en/tutorials/security/content-security-policy/">Введение в политику безопасности контента&raquo;</a> на веб-сайте HTML5Rocks.

source: Content projection
es: Proyección de contenidos
ja: コンテンツの投影
ko: 컨텐츠 프로젝션
ru: Проекция контента

source: Content projection: yes
es: Proyección de contenidos:sí
ja: コンテンツの投影:はい
ko: 콘텐츠 프로젝션 : 예
ru: Проекция содержания:да

source: Content queries are set before the <code>ngAfterContentInit</code> callback is called.
es: Las consultas de contenido se establecen antes de que se <code>ngAfterContentInit</code> devoluci&oacute;n de llamada ngAfterContentInit .
ja: コンテンツクエリは、 <code>ngAfterContentInit</code> コールバックが呼び出される前に設定されます。
ko: <code>ngAfterContentInit</code> 콜백이 호출 되기 전에 컨텐츠 쿼리가 설정 됩니다.
ru: Запросы содержимого устанавливаются до вызова обратного вызова <code>ngAfterContentInit</code> .

source: Content queries are set before the <code>ngAfterContentInit</code> callback is called. View queries are set before the <code>ngAfterViewInit</code> callback is called.
es: Las consultas de contenido se establecen antes de que se <code>ngAfterContentInit</code> devoluci&oacute;n de llamada ngAfterContentInit . Las consultas de vista se establecen antes de que se <code>ngAfterViewInit</code> devoluci&oacute;n de llamada ngAfterViewInit .
ja: コンテンツクエリは、 <code>ngAfterContentInit</code> コールバックが呼び出される前に設定されます。ビュークエリは、 <code>ngAfterViewInit</code> コールバックが呼び出される前に設定されます。
ko: <code>ngAfterContentInit</code> 콜백이 호출 되기 전에 컨텐츠 쿼리가 설정 됩니다. <code>ngAfterViewInit</code> 콜백이 호출 되기 전에 뷰 쿼리가 설정 됩니다.
ru: Запросы содержимого устанавливаются до вызова обратного вызова <code>ngAfterContentInit</code> . Запросы на просмотр устанавливаются до вызова обратного вызова <code>ngAfterViewInit</code> .

source: Content security
es: Seguridad del contenido
ja: コンテンツセキュリティ
ko: 콘텐츠 보안
ru: Безопасность содержимого

source: Content security policy
es: Política de seguridad del contenido
ja: コンテンツセキュリティポリシー
ko: 콘텐츠 보안 정책
ru: Политика безопасности контента

source: Context-dependant translation forms for strings. Typically the standalone version is for the nominative form of the word, and the format version is used for the genitive case.
es: Formas de traducción dependientes del contexto para las cuerdas.Típicamente la versión independiente es para la forma nominativa de la palabra,y la versión de formato se usa para el caso genitivo.
ja: 文脈に依存する文字列の翻訳形式。通常、スタンドアロン版は単語の名詞形に使用され、フォーマット版は主格格に使用されます。
ko: 문자열에 대한 상황에 따른 번역 양식. 일반적으로 독립형 버전은 명목 형태의 단어 용이며 형식 버전은 생식 케이스에 사용됩니다.
ru: Контекстно-зависимые формы перевода для строк.Обычно автономная версия предназначена для номинативной формы слова,а версия формата используется для генитивного падежа.

source: Continue working in <code>cart.service.ts</code>.
es: Contin&uacute;a trabajando en <code>cart.service.ts</code> .
ja: <code>cart.service.ts</code> で作業を続けます。
ko: <code>cart.service.ts</code> 에서 계속 작업 하십시오 .
ru: Продолжайте работать в <code>cart.service.ts</code> .

source: Continuing with the same example, suppose the components of a module truly require a private, custom <code><a href="../api/common/http/httpbackend">HttpBackend</a></code>.
es: Continuando con el mismo ejemplo, supongamos que los componentes de un m&oacute;dulo realmente requieren un <code><a href="../api/common/http/httpbackend">HttpBackend</a></code> privado y personalizado .
ja: 同じ例を続けて、モジュールのコンポーネントが本当にプライベートなカスタム <code><a href="../api/common/http/httpbackend">HttpBackend</a></code> を必要とするとします。
ko: 동일한 예제를 계속 진행하면서 모듈의 구성 요소에 개인 사용자 정의 <code><a href="../api/common/http/httpbackend">HttpBackend</a></code> 가 필요하다고 가정하십시오 .
ru: Продолжая с тем же примером, предположим, что компоненты модуля действительно требуют частного, настраиваемого <code><a href="../api/common/http/httpbackend">HttpBackend</a></code> .

source: Contribute to Angular docs by creating <a href="https://github.com/angular/angular/pulls">pull requests</a> on the Angular Github repository. See <a href="https://github.com/angular/angular/blob/master/CONTRIBUTING.md">Contributing to Angular</a> for information about submission guidelines.
es: Contribuya a documentos de Angular creando <a href="https://github.com/angular/angular/pulls">solicitudes de extracci&oacute;n</a> en el repositorio de Angular Github. Consulte <a href="https://github.com/angular/angular/blob/master/CONTRIBUTING.md">Contribuir a Angular</a> para obtener informaci&oacute;n sobre las pautas de env&iacute;o.
ja: Angular Githubリポジトリで<a href="https://github.com/angular/angular/pulls">プルリクエスト</a>を作成して、Angularドキュメントに貢献してください。提出ガイドラインについては<a href="https://github.com/angular/angular/blob/master/CONTRIBUTING.md">、Angular</a>への貢献をご覧ください。
ko: Angular Github 저장소에서 <a href="https://github.com/angular/angular/pulls">풀 요청</a> 을 작성하여 Angular 문서에 기여하십시오 . 제출 지침에 대한 정보는 <a href="https://github.com/angular/angular/blob/master/CONTRIBUTING.md">Angular</a> 에 기여를 참조하십시오 .
ru: Внесите свой вклад в документы Angular, создавая <a href="https://github.com/angular/angular/pulls">запросы</a> на извлечение данных в хранилище Angular Github. См. &laquo; <a href="https://github.com/angular/angular/blob/master/CONTRIBUTING.md">Вклад в Angular&raquo;</a> для получения информации о правилах подачи.

source: Control navigation with UI elements
ja: UI要素でナビゲーションをコントロール
ko: UI 요소로 탐색 제어
ru: Навигация управления с элементами пользовательского интерфейса

source: Control status CSS classes
es: Estado de control Clases de CSS
ja: 制御ステータス CSS クラス
ko: 상태 CSS 클래스 제어
ru: Статус управления CSS классы

source: Control whether the application can discard unsaved changes.
ja: アプリケーションが保存されていない変更を破棄できるかどうかを制御します。
ko: 응용 프로그램이 저장되지 않은 변경 사항을 삭제할 수 있는지 여부를 제어합니다.
ru: Контроль того,может ли приложение отбрасывать несохраненные изменения.

source: Controller function
es: Función del controlador
ja: コントローラ機能
ko: 컨트롤러 기능
ru: функция контроллера

source: Controller lifecycle hook methods <code>$<a href="upgrade">onInit</a>()</code>, <code>$onDestroy()</code>, and <code>$<a href="upgrade">onChanges</a>()</code> are another convenient feature that AngularJS 1.5 introduces. They all have nearly exact <a href="lifecycle-hooks">equivalents in Angular</a>, so organizing component lifecycle logic around them will ease the eventual Angular upgrade process.
es: Los m&eacute;todos de conexi&oacute;n del ciclo de vida del controlador <code>$<a href="upgrade">onInit</a>()</code> , <code>$onDestroy()</code> y <code>$<a href="upgrade">onChanges</a>()</code> son otra caracter&iacute;stica conveniente que presenta AngularJS 1.5. Todos tienen <a href="lifecycle-hooks">equivalentes</a> casi exactos en Angular , por lo que organizar la l&oacute;gica del ciclo de vida de los componentes a su alrededor facilitar&aacute; el eventual proceso de actualizaci&oacute;n Angular.
ja: コントローラのライフサイクルフックメソッド <code>$<a href="upgrade">onInit</a>()</code> 、 <code>$onDestroy()</code> 、および <code>$<a href="upgrade">onChanges</a>()</code> は、AngularJS 1.5で導入されたもう1つの便利な機能です。それらはすべて<a href="lifecycle-hooks">、Angular</a>でほぼ正確に同等のものを持っているので、それらの周りのコンポーネントライフサイクルロジックを整理すると、最終的なAngularアップグレードプロセスが容易になります。
ko: 컨트롤러 라이프 사이클 후크 메소드 <code>$<a href="upgrade">onInit</a>()</code> , <code>$onDestroy()</code> 및 <code>$<a href="upgrade">onChanges</a>()</code> 는 AngularJS 1.5에 도입 된 또 다른 편리한 기능입니다. 그것들은 모두 <a href="lifecycle-hooks">Angular와</a> 거의 똑같은 것을 가지고 있으므로, 그것들을 중심으로 컴포넌트 라이프 사이클 로직을 구성하면 결국 Angular 업그레이드 프로세스가 쉬워 질 것입니다.
ru: Методы ловушки жизненного цикла контроллера <code>$<a href="upgrade">onInit</a>()</code> , <code>$onDestroy()</code> и <code>$<a href="upgrade">onChanges</a>()</code> - еще одна удобная функция, которую представляет AngularJS 1.5. Все они имеют почти точные <a href="lifecycle-hooks">эквиваленты в Angular</a> , поэтому организация логики жизненного цикла компонентов вокруг них облегчит возможный процесс обновления Angular.

source: Controller lifecycle hook methods <code>$onInit()</code>, <code>$onDestroy()</code>, and <code>$onChanges()</code> are another convenient feature that AngularJS 1.5 introduces. They all have nearly exact <a href="lifecycle-hooks">equivalents in Angular</a>, so organizing component lifecycle logic around them will ease the eventual Angular upgrade process.
ja: コントローラーのライフサイクルフックメソッド <code>$onInit()</code> 、 <code>$onDestroy()</code> 、および <code>$onChanges()</code> は、AngularJS1.5で導入されたもう1つの便利な機能です。それらはすべて<a href="lifecycle-hooks">Angular</a>でほぼ正確に同等であるため、コンポーネントのライフサイクルロジックをそれらの周りに編成すると、最終的なAngularのアップグレードプロセスが容易になります。
ko: 컨트롤러 수명주기 후크 메서드 <code>$onInit()</code> , <code>$onDestroy()</code> 및 <code>$onChanges()</code> 는 AngularJS 1.5가 도입 한 또 다른 편리한 기능입니다. 그것들은 모두 <a href="lifecycle-hooks">Angular에서</a> 거의 똑같은 기능을 가지고 있으므로 구성 요소 수명주기 논리를 구성하면 최종 Angular 업그레이드 프로세스가 쉬워집니다.
ru: Методы перехвата жизненного цикла контроллера <code>$onInit()</code> , <code>$onDestroy()</code> и <code>$onChanges()</code> - еще одна удобная функция, которую представляет AngularJS 1.5. Все они имеют почти точные <a href="lifecycle-hooks">эквиваленты в Angular</a> , поэтому организация логики жизненного цикла компонентов вокруг них упростит конечный процесс обновления Angular.

source: Controller registration
es: Registro del controlador
ja: コントローラ登録
ko: 컨트롤러 등록
ru: Регистрация контроллера

source: Controller to be injected into tests, that allows for mocking and flushing of requests.
es: Controlador para ser inyectado en las pruebas,que permite burlarse y tirar de las solicitudes.
ja: リクエストのモックやフラッシングを可能にするテストに注入するコントローラ。
ko: 테스트에 주입되는 컨트롤러로 요청을 조롱하고 플러시 할 수 있습니다.
ru: Контроллер для впрыскивания в тесты,что позволяет издеваться и промывать запросы.

source: Controlling the <em>Submit</em> button's enabled state by binding to <code><a href="../api/forms/ngform">NgForm</a></code> validity.
es: Controlar el estado habilitado del bot&oacute;n <em>Enviar</em> vinculando a la validez de <code><a href="../api/forms/ngform">NgForm</a></code> .
ja: <code><a href="../api/forms/ngform">NgForm</a></code> の有効性にバインドすることにより、<em>送信</em>ボタンの有効状態を制御します。
ko: <code><a href="../api/forms/ngform">NgForm</a></code> 유효성 에 바인딩 하여 <em>제출</em> 버튼의 활성화 상태 제어
ru: Управление включенным состоянием кнопки <em>Submit</em> путем привязки к валидности <code><a href="../api/forms/ngform">NgForm</a></code>

source: Controlling the <strong>Submit</strong> button's enabled state by binding to <code><a href="../api/forms/ngform">NgForm</a></code> validity.
ja: <code><a href="../api/forms/ngform">NgForm</a></code> の有効性にバインドすることにより、[<strong>送信</strong>]ボタンの有効状態を制御します。
ko: <code><a href="../api/forms/ngform">NgForm</a></code> 유효성 에 바인딩 하여 <strong>제출</strong> 버튼의 활성화 상태를 제어합니다 .
ru: Управление включенным состоянием кнопки &laquo; <strong>Отправить</strong> &raquo; путем привязки к действительности <code><a href="../api/forms/ngform">NgForm</a></code> .

source: Controls the type check for linting.
es: Controla el tipo de comprobación de las pelusas.
ja: リンティングのタイプチェックを制御します。
ko: 보푸라기 유형 확인을 제어합니다.
ru: Контролирует проверку типа для вязки.

source: Convert that method to use <code><a href="../api/common/http/httpclient">HttpClient</a></code> as follows:
es: Convierta ese m&eacute;todo para usar <code><a href="../api/common/http/httpclient">HttpClient</a></code> de la siguiente manera:
ja: 次のように、 <code><a href="../api/common/http/httpclient">HttpClient</a></code> を使用するようにそのメソッドを変換します。
ko: 다음과 같이 <code><a href="../api/common/http/httpclient">HttpClient</a></code> 를 사용하도록 해당 메소드를 변환하십시오 .
ru: Преобразуйте этот метод для использования <code><a href="../api/common/http/httpclient">HttpClient</a></code> следующим образом:

source: Convert the phone detail component template into Angular syntax as follows:
es: Convierta la plantilla del componente de detalles del teléfono en sintaxis angular de la siguiente manera:
ja: 電話詳細コンポーネントのテンプレートを以下のようにAngularの構文に変換します。
ko: 전화기 세부 사항 컴포넌트 템플리트를 다음과 같이 각도 구문으로 변환하십시오.
ru: Преобразование шаблона детали телефона в Угловой синтаксис выполняется следующим образом:

source: Converting existing code for async operations into observables
es: Convertir el código existente para las operaciones de asincronía en observables
ja: 非同期操作のための既存のコードを観測値に変換する
ko: 비동기 작업에 대한 기존 코드를 관찰 가능으로 변환
ru: Преобразование существующего кода для операций асинхронизации в наблюдаемые объекты

source: Converts a <code><a href="params">Params</a></code> instance to a <code><a href="parammap">ParamMap</a></code>.
es: Convierte un <code><a href="params">Params</a></code> de instancia a un <code><a href="parammap">ParamMap</a></code> .
ja: <code><a href="params">Params</a></code> インスタンスを <code><a href="parammap">ParamMap</a></code> に変換します。
ko: <code><a href="params">Params</a></code> 인스턴스를 <code><a href="parammap">ParamMap</a></code> 로 변환합니다 .
ru: Преобразует экземпляр <code><a href="params">Params</a></code> в <code><a href="parammap">ParamMap</a></code> .

source: Converts a <code><a href="router/params">Params</a></code> instance to a <code><a href="router/parammap">ParamMap</a></code>.
es: Convierte un <code><a href="router/params">Params</a></code> de instancia a un <code><a href="router/parammap">ParamMap</a></code> .
ja: <code><a href="router/params">Params</a></code> インスタンスを <code><a href="router/parammap">ParamMap</a></code> に変換します。
ko: <code><a href="router/params">Params</a></code> 인스턴스를 <code><a href="router/parammap">ParamMap</a></code> 로 변환합니다 .
ru: Преобразует экземпляр <code><a href="router/params">Params</a></code> в <code><a href="router/parammap">ParamMap</a></code> .

source: Converts a <code><a href="urltree">UrlTree</a></code> into a url
es: Convierte un <code><a href="urltree">UrlTree</a></code> en una url
ja: <code><a href="urltree">UrlTree</a></code> をURLに変換します
ko: <code><a href="urltree">UrlTree</a></code> 를 URL로 변환
ru: Преобразует <code><a href="urltree">UrlTree</a></code> в URL

source: Converts a JavaScript object into a JSON string. This is useful for debugging.
es: Convierte un objeto JavaScript en una cadena JSON.Esto es útil para la depuración.
ja: JavaScriptオブジェクトをJSON文字列に変換します。これはデバッグに便利です。
ko: JavaScript 객체를 JSON 문자열로 변환합니다. 이것은 디버깅에 유용합니다.
ru: Преобразует объект JavaScript в строку JSON.Это полезно для отладки.

source: Converts a value into its JSON-format representation. Useful for debugging.
es: Convierte un valor en su representación en formato JSON.Es útil para la depuración.
ja: 値を JSON 形式の表現に変換します。デバッグに便利です。
ko: 값을 JSON 형식 표현으로 변환합니다. 디버깅에 유용합니다.
ru: Преобразует значение в его JSON-формат представления.Полезно для отладки.

source: Converts the string to lowercase.
es: Convierte la cuerda en minúsculas.
ja: 文字列を小文字に変換します。
ko: 문자열을 소문자로 변환합니다.
ru: Преобразует строку в нижний регистр.

source: Cookie name default is <code>XSRF-TOKEN</code>.
es: El nombre predeterminado de la cookie es <code>XSRF-TOKEN</code> .
ja: Cookie名のデフォルトは <code>XSRF-TOKEN</code> です。
ko: 쿠키 이름 기본값은 <code>XSRF-TOKEN</code> 입니다.
ru: Имя <code>XSRF-TOKEN</code> умолчанию - XSRF-TOKEN .

source: Copy <em>everything</em> within the output folder (<code>dist/</code> by default) to a folder on the server.
es: Copie <em>todo</em> dentro de la carpeta de salida ( <code>dist/</code> por defecto) a una carpeta en el servidor.
ja: 出力フォルダー（デフォルトでは <code>dist/</code> ）内の<em>すべてを</em>サーバー上のフォルダーにコピーします。
ko: 복사 <em>모든</em> 출력 폴더 (내 <code>dist/</code> 서버의 폴더에 기본적으로).
ru: Скопируйте <em>все</em> содержимое выходной папки ( по умолчанию <code>dist/</code> ) в папку на сервере.

source: Copy <em>everything</em> within the output folder (<code>dist/project-name/</code> by default) to a folder on the server.
ja: 出力フォルダー（デフォルトでは <code>dist/project-name/</code> ）内の<em>すべてを</em>サーバー上のフォルダーにコピーします。
ko: 복사 <em>모든</em> 출력 폴더 (내 <code>dist/project-name/</code> 서버의 폴더에 기본적으로).
ru: Скопируйте <em>все</em> содержимое выходной папки ( по умолчанию <code>dist/project-name/</code> ) в папку на сервере.

source: Copy files from the starter Angular app into the folder containing the <code>.csproj</code> file. Include the files in the Visual Studio project as follows:
es: Copie los archivos de la aplicaci&oacute;n angular inicial en la carpeta que contiene el archivo <code>.csproj</code> . Incluya los archivos en el proyecto de Visual Studio de la siguiente manera:
ja: スターターAngularアプリから <code>.csproj</code> ファイルを含むフォルダーにファイルをコピーします。次のように、Visual Studioプロジェクトにファイルを含めます。
ko: 스타터 Angular 앱의 파일을 <code>.csproj</code> 파일이 포함 된 폴더로 복사 하십시오. 다음과 같이 Visual Studio 프로젝트에 파일을 포함하십시오.
ru: Скопируйте файлы из начального приложения Angular в папку, содержащую файл <code>.csproj</code> . Включите файлы в проект Visual Studio следующим образом:

source: Copy the <code>hero-detail</code> folder, the <code>hero.ts</code>, <code>hero.service.ts</code>, and <code>mock-heroes.ts</code> files into the <code>heroes</code> subfolder.
es: Copie la carpeta de <code>hero-detail</code> del h&eacute;roe , los <code>hero.ts</code> , <code>hero.service.ts</code> y <code>mock-heroes.ts</code> en la subcarpeta de <code>heroes</code> .
ja: <code>hero-detail</code> フォルダー、 <code>hero.ts</code> 、 <code>hero.service.ts</code> 、および <code>mock-heroes.ts</code> ファイルを <code>heroes</code> サブフォルダーにコピーします。
ko: 복사 <code>hero-detail</code> 폴더에서 <code>hero.ts</code> , <code>hero.service.ts</code> 및 <code>mock-heroes.ts</code> 에 파일을 <code>heroes</code> 하위 폴더.
ru: Скопируйте <code>hero-detail</code> папку, в <code>hero.ts</code> , <code>hero.service.ts</code> и <code>mock-heroes.ts</code> файлы в <code>heroes</code> вложенный.

source: Copy the <code>message.service.ts</code> into the <code>src/app</code> folder.
es: Copie el <code>message.service.ts</code> en la carpeta <code>src/app</code> .
ja: <code>message.service.ts</code> を <code>src/app</code> フォルダーにコピーします。
ko: <code>message.service.ts</code> 를 <code>src/app</code> 폴더에 복사하십시오 .
ru: Скопируйте <code>message.service.ts</code> в папку <code>src/app</code> .

source: Copy the body and make your change in the copy.
ja: 本文をコピーしてお釣りがくるようにしましょう。
ko: 본문을 복사하고 사본에서 변경하십시오.
ru: Скопируйте тело и внесите изменения в копию.

source: Copy the contents of the <code>heroes/heroes.component.css</code> from the live example into the <code>hero-list.component.css</code> file.
es: Copie el contenido de <code>heroes/heroes.component.css</code> del ejemplo en vivo en el archivo <code>hero-list.component.css</code> .
ja: <code>heroes/heroes.component.css</code> の内容を実際の例から <code>hero-list.component.css</code> ファイルにコピーします。
ko: 라이브 예제 의 <code>heroes/heroes.component.css</code> 컨텐츠를 <code>hero-list.component.css</code> 파일 로 복사 하십시오.
ru: Скопируйте содержимое <code>heroes/heroes.component.css</code> из живого примера в файл <code>hero-list.component.css</code> .

source: Copy the contents of the <code>heroes/heroes.component.html</code> from the <span name="toh-pt4">"Services" tutorial</span> into the <code>hero-list.component.html</code> template.
es: Copie el contenido de <code>heroes/heroes.component.html</code> del <span name="toh-pt4">tutorial "Servicios"</span> en la plantilla <code>hero-list.component.html</code> .
ja: 内容をコピー <code>heroes/heroes.component.html</code> から<span name="toh-pt4">「サービス」チュートリアル</span>への <code>hero-list.component.html</code> テンプレート。
ko: 의 내용을 복사 <code>heroes/heroes.component.html</code> 으로부터 <span name="toh-pt4">"서비스"튜토리얼</span> 에 <code>hero-list.component.html</code> 템플릿입니다.
ru: Скопируйте содержимое <code>heroes/heroes.component.html</code> из учебника <span name="toh-pt4">&laquo;Службы&raquo;</span> в шаблон <code>hero-list.component.html</code> .

source: Copy the contents of the <code>heroes/heroes.component.ts</code> from the live example into the <code>hero-list.component.ts</code> file.
es: Copie el contenido de <code>heroes/heroes.component.ts</code> del ejemplo en vivo en el archivo <code>hero-list.component.ts</code> .
ja: <code>heroes/heroes.component.ts</code> の内容を実際の例から <code>hero-list.component.ts</code> ファイルにコピーします。
ko: 라이브 예제 의 <code>heroes/heroes.component.ts</code> 컨텐츠를 <code>hero-list.component.ts</code> 파일 로 복사 하십시오.
ru: Скопируйте содержимое <code>heroes/heroes.component.ts</code> из живого примера в файл <code>hero-list.component.ts</code> .
