Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/angular/angular.*.006.xlf
Languages: es, ja, ko, ru, zh_cn

source: Configures <a href="npm-packages">npm package dependencies</a> that are available to all projects in the workspace. See <a href="https://docs.npmjs.com/files/package.json">npm documentation</a> for the specific format and contents of this file.
es: Configura <a href="npm-packages">las dependencias del paquete npm</a> que est&aacute;n disponibles para todos los proyectos en el espacio de trabajo. Consulte la <a href="https://docs.npmjs.com/files/package.json">documentaci&oacute;n de npm</a> para ver el formato espec&iacute;fico y el contenido de este archivo.
ja: ワークスペース内のすべてのプロジェクトで使用可能な<a href="npm-packages">npmパッケージの依存関係</a>を構成します。このファイルの特定の形式と内容については、<a href="https://docs.npmjs.com/files/package.json">npmのドキュメント</a>を参照してください。
ko: 작업 공간의 모든 프로젝트에서 사용 가능한 <a href="npm-packages">npm 패키지 종속성</a> 을 구성 합니다. 이 파일의 특정 형식과 내용은 <a href="https://docs.npmjs.com/files/package.json">npm 설명서</a> 를 참조하십시오 .
ru: Настраивает <a href="npm-packages">зависимости пакета npm</a> , доступные для всех проектов в рабочей области. См. <a href="https://docs.npmjs.com/files/package.json">Документацию npm</a> для конкретного формата и содержимого этого файла.

source: Configures <a href="npm-packages">npm package dependencies</a> that are required for this library.
es: Configura <a href="npm-packages">las dependencias del paquete npm</a> que son necesarias para esta biblioteca.
ja: このライブラリに必要な<a href="npm-packages">npmパッケージの依存関係</a>を構成します。
ko: 이 라이브러리에 필요한 <a href="npm-packages">npm 패키지 종속성</a> 을 구성 합니다.
ru: Настраивает <a href="npm-packages">зависимости пакета npm</a> , необходимые для этой библиотеки.

source: Configures <code>HttpClientTestingBackend</code> as the <code><a href="../httpbackend">HttpBackend</a></code> used by <code><a href="../httpclient">HttpClient</a></code>.
es: Configura <code>HttpClientTestingBackend</code> como el <code><a href="../httpbackend">HttpBackend</a></code> utilizado por <code><a href="../httpclient">HttpClient</a></code> .
ja: <code>HttpClientTestingBackend</code> 使用する <code><a href="../httpbackend">HttpBackend</a></code> としてHttpClientTestingBackendを構成し <code><a href="../httpclient">HttpClient</a></code> 。
ko: 를 구성 <code>HttpClientTestingBackend</code> 는 AS <code><a href="../httpbackend">HttpBackend</a></code> 에서 사용 <code><a href="../httpclient">HttpClient</a></code> 를 .
ru: Настраивает <code>HttpClientTestingBackend</code> как <code><a href="../httpbackend">HttpBackend</a></code> , используемый <code><a href="../httpclient">HttpClient</a></code> .

source: Configures <code>HttpClientTestingBackend</code> as the <code><a href="httpbackend">HttpBackend</a></code> used by <code><a href="httpclient">HttpClient</a></code>.
es: Configura <code>HttpClientTestingBackend</code> como el <code><a href="httpbackend">HttpBackend</a></code> utilizado por <code><a href="httpclient">HttpClient</a></code> .
ja: <code>HttpClientTestingBackend</code> 使用する <code><a href="httpbackend">HttpBackend</a></code> としてHttpClientTestingBackendを構成し <code><a href="httpclient">HttpClient</a></code> 。
ko: 를 구성 <code>HttpClientTestingBackend</code> 는 AS <code><a href="httpbackend">HttpBackend</a></code> 에서 사용 <code><a href="httpclient">HttpClient</a></code> 를 .
ru: Настраивает <code>HttpClientTestingBackend</code> как <code><a href="httpbackend">HttpBackend</a></code> , используемый <code><a href="httpclient">HttpClient</a></code> .

source: Configures XSRF protection support for outgoing requests.
es: Configura el soporte de protección XSRF para las solicitudes salientes.
ja: 送信要求に対する XSRF 保護サポートを設定します。
ko: 발신 요청에 대한 XSRF 보호 지원을 구성합니다.
ru: Настраивает поддержку защиты XSRF для исходящих запросов.

source: Configures a browser-based app to transition from a server-rendered app, if one is present on the page.
es: Configura una aplicación basada en el navegador para la transición de una aplicación renderizada por el servidor,si está presente en la página.
ja: ブラウザベースのアプリがページ上に存在する場合に、サーバーレンダリングされたアプリから移行するように設定します。
ko: 서버 기반 앱에서 페이지로 전환 된 경우 브라우저 기반 앱을 전환하도록 구성합니다.
ru: Настраивает приложение на основе браузера для перехода с приложения на сервер,если оно присутствует на странице.

source: Configures a preloading strategy. One of <code><a href="preloadallmodules">PreloadAllModules</a></code> or <code><a href="nopreloading">NoPreloading</a></code> (the default).
es: Configura una estrategia de precarga. Uno de <code><a href="preloadallmodules">PreloadAllModules</a></code> o <code><a href="nopreloading">NoPreloading</a></code> (el valor predeterminado).
ja: プリロード戦略を構成します。一つ <code><a href="preloadallmodules">PreloadAllModules</a></code> または <code><a href="nopreloading">NoPreloading</a></code> （デフォルト）。
ko: 사전로드 전략을 구성합니다. <code><a href="preloadallmodules">PreloadAllModules</a></code> 또는 <code><a href="nopreloading">NoPreloading</a></code> 중 하나입니다 (기본값).
ru: Настраивает стратегию предварительной загрузки. Один из <code><a href="preloadallmodules">PreloadAllModules</a></code> или <code><a href="nopreloading">NoPreloading</a></code> (по умолчанию).

source: Configures and initializes environment for unit testing and provides methods for creating components and services in unit tests.
es: Configura e inicializa el entorno para las pruebas de la unidad y proporciona métodos para crear componentes y servicios en las pruebas de la unidad.
ja: ユニットテスト用の環境を設定・初期化し、ユニットテストにおけるコンポーネントやサービスの作成方法を提供します。
ko: 단위 테스트를위한 환경을 구성하고 초기화하고 단위 테스트에서 구성 요소 및 서비스를 작성하는 방법을 제공합니다.
ru: Конфигурирует и инициализирует среду для модульного тестирования и предоставляет методы для создания компонентов и сервисов в модульных тестах.

source: Configures if the scroll position needs to be restored when navigating back.
es: Configura si la posición de desplazamiento debe ser restaurada al navegar de vuelta.
ja: 戻るときにスクロール位置を復元する必要があるかどうかを設定します。
ko: 다시 탐색 할 때 스크롤 위치를 복원해야하는지 여부를 구성합니다.
ru: Настраивается,если положение прокрутки необходимо восстановить при обратном перемещении.

source: Configures routes for the application. Supports static, parameterized, redirect, and wildcard routes. Also supports custom route data and resolve.
es: Configura las rutas de la aplicación.Soporta rutas estáticas,parametrizadas,redireccionadas y comodines.También soporta datos de rutas personalizadas y resolución.
ja: アプリケーションのルートを構成します。スタティックルート、パラメータ化ルート、リダイレクトルート、ワイルドカードルートをサポートします。また、カスタムルートデータと解決もサポートしています。
ko: 응용 프로그램의 경로를 구성합니다. 정적, 매개 변수화, 리디렉션 및 와일드 카드 경로를 지원합니다. 사용자 지정 경로 데이터 및 해결도 지원합니다.
ru: Настраивает маршруты для приложения.Поддерживает статические,параметризованные,перенаправленные и подстановочные маршруты.Также поддерживает пользовательские данные и разрешение маршрутов.

source: Configures sharing of target browsers and Node.js versions among various front-end tools. See <a href="https://github.com/browserslist/browserslist">Browserslist on GitHub</a> for more information.
es: Configura el uso compartido de los navegadores de destino y las versiones de Node.js entre varias herramientas de front-end. Consulte la lista de <a href="https://github.com/browserslist/browserslist">navegadores en GitHub</a> para obtener m&aacute;s informaci&oacute;n.
ja: さまざまなフロントエンドツール間でのターゲットブラウザーとNode.jsバージョンの共有を構成します。詳細については<a href="https://github.com/browserslist/browserslist">、GitHubのBrowserslistを</a>参照してください。
ko: 다양한 프런트 엔드 도구간에 대상 브라우저와 Node.js 버전의 공유를 구성합니다. 자세한 내용 <a href="https://github.com/browserslist/browserslist">은 GitHub의 브라우저 목록을</a> 참조하십시오 .
ru: Настраивает совместное использование целевых браузеров и версий Node.js между различными интерфейсными инструментами. См. <a href="https://github.com/browserslist/browserslist">Список браузеров на GitHub</a> для получения дополнительной информации.

source: Configures the <a href="../../../guide/glossary#injector">dependency injector</a> for <code><a href="httpclient">HttpClient</a></code> with supporting services for JSONP. Without this module, Jsonp requests reach the backend with method JSONP, where they are rejected.
es: Configura el <a href="../../../guide/glossary#injector">inyector de dependencia</a> para <code><a href="httpclient">HttpClient</a></code> con servicios de soporte para JSONP. Sin este m&oacute;dulo, las solicitudes Jsonp llegan al backend con el m&eacute;todo JSONP, donde son rechazadas.
ja: JSONPのサポートサービスを <code><a href="httpclient">HttpClient</a></code> して、HttpClientの<a href="../../../guide/glossary#injector">依存関係インジェクター</a>を構成します。このモジュールがない場合、JsonpリクエストはJSONPメソッドでバックエンドに到達し、そこで拒否されます。
ko: JSONP 지원 서비스로 <code><a href="httpclient">HttpClient</a></code> 에 대한 <a href="../../../guide/glossary#injector">종속성 인젝터</a> 를 구성합니다 . 이 모듈이 없으면 Jsonp 요청은 JSONP 메소드로 백엔드에 도달하여 거부됩니다.
ru: Настраивает <a href="../../../guide/glossary#injector">инжектор зависимостей</a> для <code><a href="httpclient">HttpClient</a></code> с поддержкой служб для JSONP. Без этого модуля запросы Jsonp достигают серверной части с методом JSONP, где они отклоняются.

source: Configures the <a href="../../../guide/glossary#injector">dependency injector</a> for <code><a href="httpclient">HttpClient</a></code> with supporting services for XSRF. Automatically imported by <code><a href="httpclientmodule">HttpClientModule</a></code>.
es: Configura el <a href="../../../guide/glossary#injector">inyector de dependencia</a> para <code><a href="httpclient">HttpClient</a></code> con servicios de soporte para XSRF. Importado autom&aacute;ticamente por <code><a href="httpclientmodule">HttpClientModule</a></code> .
ja: XSRFのサポートサービスを <code><a href="httpclient">HttpClient</a></code> してHttpClientの<a href="../../../guide/glossary#injector">依存関係インジェクター</a>を構成します。 <code><a href="httpclientmodule">HttpClientModule</a></code> によって自動的にインポートされます。
ko: XSRF에 대한 지원 서비스를 사용 하여 <code><a href="httpclient">HttpClient</a></code> 에 대한 <a href="../../../guide/glossary#injector">종속성 인젝터</a> 를 구성합니다 . <code><a href="httpclientmodule">HttpClientModule</a></code> 에서 자동으로 가져 옵니다 .
ru: Настраивает <a href="../../../guide/glossary#injector">инжектор зависимостей</a> для <code><a href="httpclient">HttpClient</a></code> с поддержкой служб для XSRF. Автоматически импортируется <code><a href="httpclientmodule">HttpClientModule</a></code> .

source: Configures the <a href="../../guide/glossary#injector">dependency injector</a> for <code><a href="http/httpclient">HttpClient</a></code> with supporting services for JSONP. Without this module, Jsonp requests reach the backend with method JSONP, where they are rejected.
es: Configura el <a href="../../guide/glossary#injector">inyector de dependencia</a> para <code><a href="http/httpclient">HttpClient</a></code> con servicios de soporte para JSONP. Sin este m&oacute;dulo, las solicitudes Jsonp llegan al backend con el m&eacute;todo JSONP, donde son rechazadas.
ja: JSONPのサポートサービスを <code><a href="http/httpclient">HttpClient</a></code> して、HttpClientの<a href="../../guide/glossary#injector">依存関係インジェクター</a>を構成します。このモジュールがない場合、JsonpリクエストはJSONPメソッドでバックエンドに到達し、そこで拒否されます。
ko: JSONP 지원 서비스로 <code><a href="http/httpclient">HttpClient</a></code> 에 대한 <a href="../../guide/glossary#injector">종속성 인젝터</a> 를 구성합니다 . 이 모듈이 없으면 Jsonp 요청은 JSONP 메소드로 백엔드에 도달하여 거부됩니다.
ru: Настраивает <a href="../../guide/glossary#injector">инжектор зависимостей</a> для <code><a href="http/httpclient">HttpClient</a></code> с поддержкой служб для JSONP. Без этого модуля запросы Jsonp достигают серверной части с методом JSONP, где они отклоняются.

source: Configures the <a href="../../guide/glossary#injector">dependency injector</a> for <code><a href="http/httpclient">HttpClient</a></code> with supporting services for XSRF. Automatically imported by <code><a href="http/httpclientmodule">HttpClientModule</a></code>.
es: Configura el <a href="../../guide/glossary#injector">inyector de dependencia</a> para <code><a href="http/httpclient">HttpClient</a></code> con servicios de soporte para XSRF. Importado autom&aacute;ticamente por <code><a href="http/httpclientmodule">HttpClientModule</a></code> .
ja: XSRFのサポートサービスを <code><a href="http/httpclient">HttpClient</a></code> してHttpClientの<a href="../../guide/glossary#injector">依存関係インジェクター</a>を構成します。 <code><a href="http/httpclientmodule">HttpClientModule</a></code> によって自動的にインポートされます。
ko: XSRF에 대한 지원 서비스를 사용 하여 <code><a href="http/httpclient">HttpClient</a></code> 에 대한 <a href="../../guide/glossary#injector">종속성 인젝터</a> 를 구성합니다 . <code><a href="http/httpclientmodule">HttpClientModule</a></code> 에서 자동으로 가져 옵니다 .
ru: Настраивает <a href="../../guide/glossary#injector">инжектор зависимостей</a> для <code><a href="http/httpclient">HttpClient</a></code> с поддержкой служб для XSRF. Автоматически импортируется <code><a href="http/httpclientmodule">HttpClientModule</a></code> .

source: Configures the <a href="../../guide/glossary#injector">injector</a> of this directive or component with a <a href="../../guide/glossary#di-token">token</a> that maps to a <a href="../../guide/glossary#provider">provider</a> of a dependency.
es: Configura el <a href="../../guide/glossary#injector">inyector</a> de esta directiva o componente con un <a href="../../guide/glossary#di-token">token</a> que se asigna a un <a href="../../guide/glossary#provider">proveedor</a> de una dependencia.
ja: このディレクティブまたはコンポーネントの<a href="../../guide/glossary#injector">インジェクター</a>を、依存関係の<a href="../../guide/glossary#provider">プロバイダー</a>にマップする<a href="../../guide/glossary#di-token">トークン</a>で構成します。
ko: 이 지시자 또는 컴포넌트 의 <a href="../../guide/glossary#injector">인젝터</a> 를 종속성 <a href="../../guide/glossary#provider">제공자</a> 에 맵핑 하는 <a href="../../guide/glossary#di-token">토큰으로</a> 구성 합니다.
ru: Настраивает <a href="../../guide/glossary#injector">инжектор</a> этой директивы или компонента с помощью <a href="../../guide/glossary#di-token">токена,</a> который сопоставляется с <a href="../../guide/glossary#provider">поставщиком</a> зависимости.

source: Configures the <code><a href="core/injector">Injector</a></code> to return a value by invoking a <code><a href="core/factorysansprovider#useFactory">useFactory</a></code> function.
es: Configura el <code><a href="core/injector">Injector</a></code> para devolver un valor invocando una funci&oacute;n <code><a href="core/factorysansprovider#useFactory">useFactory</a></code> .
ja: <code><a href="core/factorysansprovider#useFactory">useFactory</a></code> 関数を呼び出して値を返すように <code><a href="core/injector">Injector</a></code> を構成します。
ko: <code><a href="core/factorysansprovider#useFactory">useFactory</a></code> 함수 를 호출하여 값을 리턴 하도록 <code><a href="core/injector">Injector</a></code> 를 구성합니다 .
ru: Настраивает <code><a href="core/injector">Injector</a></code> для возврата значения, вызывая функцию <code><a href="core/factorysansprovider#useFactory">useFactory</a></code> .

source: Configures the <code><a href="core/injector">Injector</a></code> to return a value by invoking a <code>useClass</code> function. Base for <code><a href="core/classprovider">ClassProvider</a></code> decorator.
es: Configura el <code><a href="core/injector">Injector</a></code> para devolver un valor invocando una funci&oacute;n <code>useClass</code> . Base para decorador <code><a href="core/classprovider">ClassProvider</a></code> .
ja: <code>useClass</code> 関数を呼び出して値を返すように <code><a href="core/injector">Injector</a></code> を構成します。 <code><a href="core/classprovider">ClassProvider</a></code> デコレータのベース。
ko: <code>useClass</code> 함수 를 호출하여 값을 리턴 하도록 <code><a href="core/injector">Injector</a></code> 를 구성합니다 . <code><a href="core/classprovider">ClassProvider</a></code> 데코레이터의 기본입니다 .
ru: Настраивает <code><a href="core/injector">Injector</a></code> для возврата значения, вызывая функцию <code>useClass</code> . База для декоратора <code><a href="core/classprovider">ClassProvider</a></code> .

source: Configures the <code><a href="core/injector">Injector</a></code> to return a value by invoking a <code>useFactory</code> function.
ja: <code>useFactory</code> 関数を呼び出して値を返すように <code><a href="core/injector">Injector</a></code> を構成します。
ko: <code>useFactory</code> 함수 를 호출하여 값을 반환 하도록 <code><a href="core/injector">Injector</a></code> 를 구성합니다 .
ru: Настраивает <code><a href="core/injector">Injector</a></code> для возврата значения путем вызова функции <code>useFactory</code> .

source: Configures the <code><a href="core/injector">Injector</a></code> to return a value for a token.
es: Configura el <code><a href="core/injector">Injector</a></code> para devolver un valor para un token.
ja: トークンの値を返すように <code><a href="core/injector">Injector</a></code> を構成します。
ko: 토큰 값을 반환 하도록 <code><a href="core/injector">Injector</a></code> 를 구성합니다 .
ru: Конфигурирует <code><a href="core/injector">Injector</a></code> для возврата значения токена.

source: Configures the <code><a href="core/injector">Injector</a></code> to return a value for a token. Base for <code><a href="core/valueprovider">ValueProvider</a></code> decorator.
es: Configura el <code><a href="core/injector">Injector</a></code> para devolver un valor para un token. Base para el decorador <code><a href="core/valueprovider">ValueProvider</a></code> .
ja: トークンの値を返すように <code><a href="core/injector">Injector</a></code> を構成します。 <code><a href="core/valueprovider">ValueProvider</a></code> デコレータのベース。
ko: 토큰 값을 반환 하도록 <code><a href="core/injector">Injector</a></code> 를 구성합니다 . <code><a href="core/valueprovider">ValueProvider</a></code> 데코레이터의 기본입니다 .
ru: Конфигурирует <code><a href="core/injector">Injector</a></code> для возврата значения токена. База для декоратора <code><a href="core/valueprovider">ValueProvider</a></code> .

source: Configures the <code><a href="core/injector">Injector</a></code> to return a value of another <code><a href="core/existingsansprovider#useExisting">useExisting</a></code> token.
es: Configura el <code><a href="core/injector">Injector</a></code> para devolver un valor de otro <code><a href="core/existingsansprovider#useExisting">useExisting</a></code> token.
ja: 別の <code><a href="core/existingsansprovider#useExisting">useExisting</a></code> トークンの値を返すように <code><a href="core/injector">Injector</a></code> を構成します。
ko: 다른 <code><a href="core/existingsansprovider#useExisting">useExisting</a></code> 토큰 의 값을 반환 하도록 <code><a href="core/injector">Injector</a></code> 를 구성합니다 .
ru: Настраивает <code><a href="core/injector">Injector</a></code> для возврата значения другого токена <code><a href="core/existingsansprovider#useExisting">useExisting</a></code> .

source: Configures the <code><a href="core/injector">Injector</a></code> to return a value of another <code>useExisting</code> token.
ja: 別の <code>useExisting</code> トークンの値を返すように <code><a href="core/injector">Injector</a></code> を構成します。
ko: 다른 <code>useExisting</code> 토큰 의 값을 반환 하도록 <code><a href="core/injector">Injector</a></code> 를 구성합니다 .
ru: Настраивает <code><a href="core/injector">Injector</a></code> для возврата значения другого токена <code>useExisting</code> .

source: Configures the <code><a href="core/injector">Injector</a></code> to return an instance of <code><a href="core/type">Type</a></code> when `Type' is used as the token.
es: Configura el <code><a href="core/injector">Injector</a></code> para devolver una instancia de <code><a href="core/type">Type</a></code> cuando se usa 'Tipo' como token.
ja: 「Type」がトークンとして使用されている場合に、 <code><a href="core/type">Type</a></code> のインスタンスを返すように <code><a href="core/injector">Injector</a></code> を構成します。
ko: `Type '이 토큰으로 사용될 때 <code><a href="core/injector">Injector</a></code> 가 <code><a href="core/type">Type</a></code> 인스턴스를 리턴하도록 구성합니다 .
ru: Настраивает <code><a href="core/injector">Injector</a></code> для возврата экземпляра <code><a href="core/type">Type</a></code> , когда `Type 'используется в качестве токена.

source: Configures the <code><a href="core/injector">Injector</a></code> to return an instance of <code>useClass</code> for a token.
es: Configura el <code><a href="core/injector">Injector</a></code> para devolver una instancia de <code>useClass</code> para un token.
ja: トークンの <code>useClass</code> のインスタンスを返すように <code><a href="core/injector">Injector</a></code> を構成します。
ko: 토큰에 대해 <code>useClass</code> 인스턴스를 리턴 하도록 <code><a href="core/injector">Injector</a></code> 를 구성합니다 .
ru: Настраивает <code><a href="core/injector">Injector</a></code> для возврата экземпляра <code>useClass</code> для токена.

source: Configures the <code><a href="core/injector">Injector</a></code> to return an instance of <code>useClass</code> for a token. Base for <code><a href="core/staticclassprovider">StaticClassProvider</a></code> decorator.
es: Configura el <code><a href="core/injector">Injector</a></code> para devolver una instancia de <code>useClass</code> para un token. Base para decorador <code><a href="core/staticclassprovider">StaticClassProvider</a></code> .
ja: トークンの <code>useClass</code> のインスタンスを返すように <code><a href="core/injector">Injector</a></code> を構成します。 <code><a href="core/staticclassprovider">StaticClassProvider</a></code> デコレータのベース。
ko: 토큰에 대해 <code>useClass</code> 인스턴스를 리턴 하도록 <code><a href="core/injector">Injector</a></code> 를 구성합니다 . <code><a href="core/staticclassprovider">StaticClassProvider</a></code> 데코레이터의 기본입니다 .
ru: Настраивает <code><a href="core/injector">Injector</a></code> для возврата экземпляра <code>useClass</code> для токена. База для <code><a href="core/staticclassprovider">StaticClassProvider</a></code> декоратор.

source: Configures the <code><a href="core/injector">Injector</a></code> to return an instance of a token.
es: Configura el <code><a href="core/injector">Injector</a></code> para devolver una instancia de un token.
ja: トークンのインスタンスを返すように <code><a href="core/injector">Injector</a></code> を構成します。
ko: 토큰 인스턴스를 반환 하도록 <code><a href="core/injector">Injector</a></code> 를 구성합니다 .
ru: Настраивает <code><a href="core/injector">Injector</a></code> для возврата экземпляра токена.

source: Configures the <code><a href="injector">Injector</a></code> to return a value by invoking a <code><a href="factorysansprovider#useFactory">useFactory</a></code> function.
es: Configura el <code><a href="injector">Injector</a></code> para devolver un valor invocando una funci&oacute;n <code><a href="factorysansprovider#useFactory">useFactory</a></code> .
ja: <code><a href="factorysansprovider#useFactory">useFactory</a></code> 関数を呼び出して値を返すように <code><a href="injector">Injector</a></code> を構成します。
ko: <code><a href="factorysansprovider#useFactory">useFactory</a></code> 함수 를 호출하여 값을 리턴 하도록 <code><a href="injector">Injector</a></code> 를 구성합니다 .
ru: Настраивает <code><a href="injector">Injector</a></code> для возврата значения, вызывая функцию <code><a href="factorysansprovider#useFactory">useFactory</a></code> .

source: Configures the <code><a href="injector">Injector</a></code> to return a value by invoking a <code>useClass</code> function. Base for <code><a href="classprovider">ClassProvider</a></code> decorator.
es: Configura el <code><a href="injector">Injector</a></code> para devolver un valor invocando una funci&oacute;n <code>useClass</code> . Base para decorador <code><a href="classprovider">ClassProvider</a></code> .
ja: <code>useClass</code> 関数を呼び出して値を返すように <code><a href="injector">Injector</a></code> を構成します。 <code><a href="classprovider">ClassProvider</a></code> デコレータのベース。
ko: <code>useClass</code> 함수 를 호출하여 값을 리턴 하도록 <code><a href="injector">Injector</a></code> 를 구성합니다 . <code><a href="classprovider">ClassProvider</a></code> 데코레이터의 기본입니다 .
ru: Настраивает <code><a href="injector">Injector</a></code> для возврата значения, вызывая функцию <code>useClass</code> . База для декоратора <code><a href="classprovider">ClassProvider</a></code> .
