Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/angular/angular.*.006.xlf
Languages: es, ja, ko, ru, zh_cn

source: Component lifecycle hooks overview
es: Resumen de los ganchos del ciclo de vida de los componentes
ja: コンポーネントライフサイクルフックの概要
ko: 구성 요소 수명주기 후크 개요
ru: Обзор крючков жизненного цикла компонентов

source: Component marble tests
es: Pruebas de componentes de mármol
ja: コンポーネントマーブルテスト
ko: 구성 요소 대리석 테스트
ru: Испытания компонентов из мрамора

source: Component metadata
es: Metadatos de los componentes
ja: コンポーネントのメタデータ
ko: 구성 요소 메타 데이터
ru: Метаданные компонентов

source: Component or directive instance for which the host element should be retrieved.
ja: ホスト要素を取得するためのコンポーネントまたはディレクティブのインスタンス。
ko: 호스트 요소를 검색해야하는 구성 요소 또는 지시문 인스턴스입니다.
ru: Элемент или директивный экземпляр,для которого должен быть получен элемент хоста.

source: Component outputs are dispatched as HTML <a href="https://developer.mozilla.org/en-US/docs/Web/API/CustomEvent">Custom Events</a>, with the name of the custom event matching the output name. For example, for a component with <code>@<a href="../api/core/output">Output</a>() valueChanged = new <a href="../api/core/eventemitter">EventEmitter</a>()</code>, the corresponding custom element will dispatch events with the name "valueChanged", and the emitted data will be stored on the event&rsquo;s <code>detail</code> property. If you provide an alias, that value is used; for example, <code>@<a href="../api/core/output">Output</a>('myClick') clicks = new <a href="../api/core/eventemitter">EventEmitter</a>&lt;string&gt;();</code> results in dispatch events with the name "myClick".
es: Las salidas de componentes se env&iacute;an como <a href="https://developer.mozilla.org/en-US/docs/Web/API/CustomEvent">eventos personalizados</a> HTML , con el nombre del evento personalizado que coincide con el nombre de salida. Por ejemplo, para un componente con <code>@<a href="../api/core/output">Output</a>() valueChanged = new <a href="../api/core/eventemitter">EventEmitter</a>()</code> , el elemento personalizado correspondiente enviar&aacute; eventos con el nombre "valueChanged", y los datos emitidos se almacenar&aacute;n en la propiedad de <code>detail</code> del evento . Si proporciona un alias, se utiliza ese valor; por ejemplo, <code>@<a href="../api/core/output">Output</a>('myClick') clicks = new <a href="../api/core/eventemitter">EventEmitter</a>&lt;string&gt;();</code> da como resultado eventos de env&iacute;o con el nombre "myClick".
ja: コンポーネントの出力は、カスタムイベントの名前が出力名と一致するHTML <a href="https://developer.mozilla.org/en-US/docs/Web/API/CustomEvent">カスタムイベント</a>としてディスパッチされます。たとえば、 <code>@<a href="../api/core/output">Output</a>() valueChanged = new <a href="../api/core/eventemitter">EventEmitter</a>()</code> コンポーネントの場合、対応するカスタム要素は「valueChanged」という名前のイベントをディスパッチし、発行されたデータはイベントの <code>detail</code> プロパティに格納されます。エイリアスを指定すると、その値が使用されます。たとえば、 <code>@<a href="../api/core/output">Output</a>('myClick') clicks = new <a href="../api/core/eventemitter">EventEmitter</a>&lt;string&gt;();</code> 「myClick」という名前のディスパッチイベントが発生します。
ko: 컴포넌트 출력은 HTML <a href="https://developer.mozilla.org/en-US/docs/Web/API/CustomEvent">사용자 정의 이벤트</a> 로 발송되며 사용자 정의 이벤트 의 이름은 출력 이름과 일치합니다. 예를 들어, <code>@<a href="../api/core/output">Output</a>() valueChanged = new <a href="../api/core/eventemitter">EventEmitter</a>()</code> 인 구성 요소의 경우 해당 사용자 정의 요소는 이름이 "valueChanged"인 이벤트를 전달하고 생성 된 데이터는 이벤트의 <code>detail</code> 특성 에 저장됩니다 . 별명을 제공하면 해당 값이 사용됩니다. 예를 들어, <code>@<a href="../api/core/output">Output</a>('myClick') clicks = new <a href="../api/core/eventemitter">EventEmitter</a>&lt;string&gt;();</code> 이름이 "myClick"인 디스패치 이벤트가 발생합니다.
ru: Выходные данные компонента отправляются как <a href="https://developer.mozilla.org/en-US/docs/Web/API/CustomEvent">пользовательские события</a> HTML , а имя пользовательского события совпадает с именем вывода. Например, для компонента с <code>@<a href="../api/core/output">Output</a>() valueChanged = new <a href="../api/core/eventemitter">EventEmitter</a>()</code> соответствующий пользовательский элемент будет отправлять события с именем &laquo;valueChanged&raquo;, а отправленные данные будут сохраняться в свойстве <code>detail</code> события . Если вы предоставляете псевдоним, это значение используется; например, <code>@<a href="../api/core/output">Output</a>('myClick') clicks = new <a href="../api/core/eventemitter">EventEmitter</a>&lt;string&gt;();</code> приводит к отправке событий с именем &laquo;myClick&raquo;.

source: Component selectors
es: Los selectores de componentes
ja: コンポーネントセレクタ
ko: 구성 요소 선택기
ru: Селекторы компонентов

source: Component styles
ja: コンポーネントスタイル
ko: 구성 요소 스타일
ru: Стили компонентов

source: Component styles have a few special <em>selectors</em> from the world of shadow DOM style scoping (described in the <a href="https://www.w3.org/TR/css-scoping-1">CSS Scoping Module Level 1</a> page on the <a href="https://www.w3.org">W3C</a> site). The following sections describe these selectors.
es: Los estilos de componentes tienen algunos <em>selectores</em> especiales del mundo del alcance de estilo DOM de sombra (descrito en la p&aacute;gina <a href="https://www.w3.org/TR/css-scoping-1">Nivel 1 del M&oacute;dulo de alcance CSS</a> en el sitio <a href="https://www.w3.org">W3C</a> ). Las siguientes secciones describen estos selectores.
ja: コンポーネントスタイルには、シャドウDOMスタイルスコーピングの世界からのいくつかの特別な<em>セレクター</em>があります（<a href="https://www.w3.org">W3C</a>サイトの<a href="https://www.w3.org/TR/css-scoping-1">CSS</a>スコーピングモジュールレベル1ページで説明）。次のセクションでは、これらのセレクターについて説明します。
ko: 컴포넌트 스타일에는 섀도우 DOM 스타일 범위의 세계에서 몇 가지 특별한 <em>선택기가</em> 있습니다 ( <a href="https://www.w3.org">W3C</a> 사이트 의 <a href="https://www.w3.org/TR/css-scoping-1">CSS 범위 지정 모듈 레벨 1</a> 페이지에 설명되어 있음 ). 다음 섹션에서는 이러한 선택기에 대해 설명합니다.
ru: У стилей компонентов есть несколько специальных <em>селекторов</em> из мира теневого DOM-стиля (описано на странице <a href="https://www.w3.org/TR/css-scoping-1">CSS Scoping Module Level 1</a> на сайте <a href="https://www.w3.org">W3C</a> ). В следующих разделах описаны эти селекторы.

source: Component styles normally apply only to the HTML in the component's own template.
es: Los estilos de los componentes normalmente se aplican sólo al HTML en la propia plantilla del componente.
ja: コンポーネントスタイルは通常、コンポーネント自身のテンプレート内のHTMLにのみ適用されます。
ko: 컴포넌트 스타일은 일반적으로 컴포넌트 자체 템플릿의 HTML에만 적용됩니다.
ru: Стили компонентов обычно применяются только к HTML в собственном шаблоне компонента.

source: Component templates are not always fixed. An application may need to load new components at runtime.
es: Las plantillas de los componentes no siempre son fijas.Es posible que una aplicación necesite cargar nuevos componentes en tiempo de ejecución.
ja: コンポーネントテンプレートは常に固定されているわけではありません。アプリケーションは、実行時に新しいコンポーネントをロードする必要があるかもしれません。
ko: 구성 요소 템플릿이 항상 고정되는 것은 아닙니다. 응용 프로그램은 런타임에 새 구성 요소를로드해야 할 수도 있습니다.
ru: Шаблоны компонентов не всегда фиксированы.Приложению может потребоваться загрузка новых компонентов во время выполнения.

source: Component templates often have nested components, whose templates may contain more components.
es: Las plantillas de los componentes a menudo tienen componentes anidados,cuyas plantillas pueden contener más componentes.
ja: コンポーネントテンプレートは入れ子になっていることが多く、そのテンプレートにはさらに多くのコンポーネントが含まれていることがあります。
ko: 구성 요소 템플릿에는 종종 중첩 된 구성 요소가 있으며, 그 구성 요소에는 더 많은 구성 요소가 포함될 수 있습니다.
ru: Шаблоны компонентов часто имеют вложенные компоненты,в шаблонах которых может содержаться больше компонентов.

source: Component testing scenarios
ja: コンポーネントテストのシナリオ
ko: 구성 요소 테스트 시나리오
ru: Сценарии тестирования компонентов

source: Component to <a href="../changedetectorref#markForCheck">mark for check</a>.
ja: <a href="../changedetectorref#markForCheck">チェック用</a>にマークするコンポーネント。
ko: <a href="../changedetectorref#markForCheck">확인 표시 할</a> 구성 요소 입니다.
ru: Компонент, который нужно <a href="../changedetectorref#markForCheck">отметить для проверки</a> .

source: Component with a dependency
es: Componente con una dependencia
ja: 依存関係を持つコンポーネント
ko: 종속성이있는 구성 요소
ru: Компонент с зависимостью

source: Component with async service
es: Componente con servicio de sincronización
ja: 非同期サービスを持つコンポーネント
ko: 비동기 서비스가있는 구성 요소
ru: Компонент с асинхронным обслуживанием

source: Component with external files
es: Componente con archivos externos
ja: 外部ファイルを持つコンポーネント
ko: 외부 파일이있는 구성 요소
ru: Компонент с внешними файлами

source: Component with inputs and outputs
es: Componente con entradas y salidas
ja: 入力と出力を持つコンポーネント
ko: 입출력 구성 요소
ru: Компонент с входами и выходами

source: Component-less route: grouping routes without a component
es: Ruta sin componentes:agrupación de rutas sin un componente
ja: コンポーネントレスルート:コンポーネントのないルートをグループ化する
ko: 구성 요소가없는 경로 : 구성 요소가없는 경로 그룹화
ru: Маршрут без компонентов:группировка маршрутов без компонентов

source: Componentless Routes
es: Rutas sin componentes
ja: コンポーネントレスルート
ko: 구성 요소가없는 경로
ru: Бескомпонентные маршруты

source: Components and the DOM
es: Los componentes y el DOM
ja: コンポーネントとDOM
ko: 컴포넌트와 DOM
ru: Компоненты и DOM

source: Components are directives, and the <code>providers</code> option is inherited from <code>@<a href="../api/core/directive">Directive</a>()</code>. You can also configure providers for directives and pipes at the same level as the component.
es: Los componentes son directivas, y la opci&oacute;n de <code>providers</code> se hereda de <code>@<a href="../api/core/directive">Directive</a>()</code> . Tambi&eacute;n puede configurar proveedores para directivas y canalizaciones en el mismo nivel que el componente.
ja: コンポーネントはディレクティブであり、 <code>providers</code> オプションがから継承さ <code>@<a href="../api/core/directive">Directive</a>()</code> 。ディレクティブとパイプのプロバイダーをコンポーネントと同じレベルで構成することもできます。
ko: 구성 요소는 지시문이며 <code>providers</code> 옵션은 <code>@<a href="../api/core/directive">Directive</a>()</code> 에서 상속됩니다 . 구성 요소와 동일한 레벨에서 지시문 및 파이프의 제공자를 구성 할 수도 있습니다.
ru: Компоненты являются директивами, а опция <code>providers</code> унаследована от <code>@<a href="../api/core/directive">Directive</a>()</code> . Вы также можете настроить провайдеров для директив и каналов на том же уровне, что и компонент.

source: Components are normally marked as dirty (in need of rerendering) when inputs have changed or events have fired in the view. Call this method to ensure that a component is checked even if these triggers have not occured.
es: Los componentes normalmente se marcan como sucios (con necesidad de ser reproducidos)cuando las entradas han cambiado o los eventos se han disparado en la vista.Llama a este método para asegurarte de que un componente se comprueba incluso si estos disparos no se han producido.
ja: 通常、入力が変更されたり、ビュー内でイベントが発生したりすると、コンポーネントはダーティ(再レンダリングが必要)としてマークされます。このメソッドを呼び出して、これらのトリガーが発生していなくてもコンポーネントがチェックされるようにします。
ko: 입력이 변경되거나보기에서 이벤트가 발생하면 구성 요소는 일반적으로 더러워진 상태 (다시 렌더링해야 함)로 표시됩니다. 이러한 트리거가 발생하지 않은 경우에도 구성 요소를 확인하려면이 메소드를 호출하십시오.
ru: Компоненты обычно отмечаются как "грязные" (требующие переотправки),когда входы изменились или события появились на экране.Вызовите этот метод,чтобы убедиться,что компонент проверен,даже если эти триггеры не произошли.

source: Components are the main building block for Angular applications. Each component consists of:
ja: コンポーネントはAngularアプリケーションの主な構成要素です。各コンポーネントは以下のように構成されています。
ko: 구성 요소는 Angular 응용 프로그램의 주요 구성 요소입니다. 각 구성 요소는 다음으로 구성됩니다.
ru: Компоненты являются основным строительным блоком для угловых применений.Каждый компонент состоит из:

source: Components are the most basic UI building block of an Angular app. An Angular app contains a tree of Angular components.
es: Los componentes son el bloque de construcción más básico de una aplicación angular.Una aplicación Angular contiene un árbol de componentes Angulares.
ja: コンポーネントはAngularアプリの最も基本的なUIの構成要素です。AngularアプリにはAngularコンポーネントのツリーが含まれています。
ko: 구성 요소는 Angular 앱의 가장 기본적인 UI 빌딩 블록입니다. Angular 앱에는 Angular 구성 요소 트리가 포함되어 있습니다.
ru: Компоненты являются наиболее базовым строительным блоком пользовательского интерфейса приложения "Угол".Угловое приложение содержит дерево Угловых компонентов.

source: Components are used in your templates, as in the following example:
es: Los componentes se utilizan en sus plantillas,como en el siguiente ejemplo:
ja: コンポーネントは、以下の例のようにテンプレート内で使用されます。
ko: 다음 예제와 같이 구성 요소가 템플릿에 사용됩니다.
ru: Компоненты используются в ваших шаблонах,как в следующем примере:

source: Components as elements
es: Los componentes como elementos
ja: 要素としてのコンポーネント
ko: 구성 요소
ru: Компоненты как элементы

source: Components define <em>views</em>, which are sets of screen elements that Angular can choose among and modify according to your program logic and data.
es: Los componentes definen <em>vistas</em> , que son conjuntos de elementos de pantalla que Angular puede elegir y modificar de acuerdo con la l&oacute;gica y los datos de su programa.
ja: コンポーネントは<em>ビューを</em>定義します。<em>ビューは</em>、Angularがプログラムロジックとデータに応じて選択および変更できる画面要素のセットです。
ko: 구성 요소 정의 <em>뷰</em> 각도가 프로그램 로직과 데이터에 따라 중 하나를 선택하고 수정할 수있는 화면 요소의 집합입니다.
ru: Компоненты определяют <em>представления</em> , которые представляют собой наборы элементов экрана, которые Angular может выбирать и изменять в соответствии с логикой и данными вашей программы.

source: Components in external modules continue to receive the instance provided by their injectors.
es: Los componentes de los módulos externos siguen recibiendo la instancia proporcionada por sus inyectores.
ja: 外部モジュールのコンポーネントは、インジェクタによって提供されたインスタンスを受け取り続けます。
ko: 외부 모듈의 구성 요소는 인젝터가 제공 한 인스턴스를 계속받습니다.
ru: Компоненты во внешних модулях продолжают получать экземпляр,предоставленный их инжекторами.

source: Components in route definitions are also <em>entry components</em>. A route definition refers to a component by its <em>type</em>. The router ignores a routed component's selector, if it even has one, and loads the component dynamically into a <code><a href="../api/router/routeroutlet">RouterOutlet</a></code>.
es: Los componentes en las definiciones de ruta tambi&eacute;n son <em>componentes de entrada</em> . Una definici&oacute;n de ruta se refiere a un componente por su <em>tipo</em> . El enrutador ignora el selector de un componente enrutado, incluso si tiene uno, y carga el componente din&aacute;micamente en un <code><a href="../api/router/routeroutlet">RouterOutlet</a></code> .
ja: ルート定義のコンポーネントも<em>エントリコンポーネント</em>です。ルート定義は、<em>タイプ</em>によってコンポーネントを参照します。ルーターは、ルーティングされたコンポーネントのセレクターがあればそれを無視し、コンポーネントを動的に <code><a href="../api/router/routeroutlet">RouterOutlet</a></code> にロードします。
ko: 경로 정의의 <em>구성 요소</em> 도 <em>입력 구성 요소</em> 입니다. 경로 정의는 <em>유형별</em> 로 구성 요소를 나타냅니다 . 라우터는 라우팅 된 구성 요소의 선택 <code><a href="../api/router/routeroutlet">RouterOutlet</a></code> 있는 경우이를 무시하고 구성 요소를 동적으로 RouterOutlet에 로드합니다 .
ru: Компоненты в определениях маршрута также являются <em>компонентами входа</em> . Определение маршрута относится к компоненту по его <em>типу</em> . Маршрутизатор игнорирует селектор маршрутизируемого компонента, если он есть, и динамически загружает компонент в <code><a href="../api/router/routeroutlet">RouterOutlet</a></code> .

source: Components often have service dependencies.
es: Los componentes suelen tener dependencias de servicios.
ja: コンポーネントにはサービス依存性があることが多いです。
ko: 구성 요소에는 종종 서비스 종속성이 있습니다.
ru: Компоненты часто имеют зависимость от сервиса.

source: Components should expose their interactions through inputs for providing context, and outputs for communicating events to other components.
es: Los componentes deben exponer sus interacciones a través de los insumos para proporcionar un contexto,y los productos para comunicar los acontecimientos a otros componentes.
ja: コンポーネントは、コンテキストを提供するための入力と、イベントを他のコンポーネントに伝達するための出力を通じて、相互作用を公開する必要があります。
ko: 컴포넌트는 컨텍스트를 제공하기위한 입력과 이벤트를 다른 컴포넌트와 통신하기위한 출력을 통해 상호 작용을 노출해야합니다.
ru: Компоненты должны демонстрировать свое взаимодействие через вводимые ресурсы для обеспечения контекста,а также результаты для сообщения о событиях другим компонентам.

source: Components shouldn't fetch or save data directly and they certainly shouldn't knowingly present fake data. They should focus on presenting data and delegate data access to a service.
es: Los componentes no deben buscar o guardar datos directamente y ciertamente no deben presentar datos falsos a sabiendas.Deben centrarse en la presentación de datos y delegar el acceso a los datos a un servicio.
ja: コンポーネントはデータを直接取得したり保存したりしてはいけませんし、故意に偽のデータを提示してはいけません。彼らはデータを提示することに集中し、データアクセスをサービスに委ねるべきです。
ko: 구성 요소는 데이터를 직접 가져 오거나 저장해서는 안되며 의도적으로 가짜 데이터를 나타내서는 안됩니다. 이들은 데이터 제시에 중점을두고 서비스에 대한 데이터 액세스 권한을 위임해야합니다.
ru: Компоненты не должны извлекать или сохранять данные напрямую и,конечно же,они не должны сознательно представлять поддельные данные.Они должны сосредоточиться на представлении данных и делегировании доступа к данным службе.

source: Components that are only loaded dynamically by the router or by bootstrapping. Such <a href="ngmodule-faq#q-entry-component-defined">entry components</a> can never be selected in another component's template. While there's no harm in exporting them, there's also no benefit.
es: Componentes que el router solo carga din&aacute;micamente o mediante bootstrapping. Tales <a href="ngmodule-faq#q-entry-component-defined">componentes de entrada</a> nunca se pueden seleccionar en la plantilla de otro componente. Si bien no hay da&ntilde;o en exportarlos, tampoco hay beneficio.
ja: ルーターまたはブートストラップによって動的にのみ読み込まれるコンポーネント。このような<a href="ngmodule-faq#q-entry-component-defined">エントリコンポーネント</a>は、別のコンポーネントのテンプレートでは選択できません。それらをエクスポートしても害はありませんが、メリットもありません。
ko: 라우터 또는 부트 스트랩을 통해서만 동적으로로드되는 구성 요소. 이러한 <a href="ngmodule-faq#q-entry-component-defined">입력 구성 요소</a> 는 다른 구성 요소의 템플리트에서 선택할 수 없습니다. 수출에 해를 끼치지는 않지만 이점도 없습니다.
ru: Компоненты, которые загружаются только динамически маршрутизатором или при начальной загрузке. Такие <a href="ngmodule-faq#q-entry-component-defined">входные компоненты</a> никогда не могут быть выбраны в шаблоне другого компонента. Хотя их экспорт не приносит вреда, он также не приносит никакой пользы.

source: Components use <em>services</em>, which provide specific functionality not directly related to views. Service providers can be <em>injected</em> into components as <em>dependencies</em>, making your code modular, reusable, and efficient.
es: Los componentes utilizan <em>servicios</em> , que proporcionan una funcionalidad espec&iacute;fica que no est&aacute; directamente relacionada con las vistas. Los proveedores de servicios pueden <em>inyectarse</em> en los componentes como <em>dependencias</em> , haciendo que su c&oacute;digo sea modular, reutilizable y eficiente.
ja: コンポーネントは、ビューに直接関連しない特定の機能を提供する<em>サービスを</em>使用します。サービスプロバイダーは、<em>依存関係</em>としてコンポーネントに<em>注入</em>でき、コードをモジュール化し、再利用可能で効率的なものにします。<em></em>
ko: 컴포넌트는 <em>서비스</em> 와 직접 관련이없는 특정 기능을 제공 하는 <em>서비스를</em> 사용 <em>합니다</em> . 서비스 공급자는 <em>종속성</em> 으로 구성 요소에 <em>삽입</em> 되어 코드를 모듈화하고 재사용 가능하며 효율적으로 만들 수 있습니다.<em></em>
ru: Компоненты используют <em>сервисы</em> , которые предоставляют определенные функции, не связанные напрямую с представлениями. Поставщики услуг могут <em>вводиться</em> в компоненты как <em>зависимости</em> , что делает ваш код модульным, многократно используемым и эффективным.

source: Components with <code>RouterLink</code>
es: Componentes con <code>RouterLink</code>
ja: <code>RouterLink</code> を備えたコンポーネント
ko: <code>RouterLink</code> 가 포함 된 구성 요소
ru: Компоненты с <code>RouterLink</code>

source: Components&mdash;directives with a template.
es: Componentes: directivas con una plantilla.
ja: コンポーネント-テンプレート付きのディレクティブ。
ko: 컴포넌트 &mdash; 템플릿이있는 지시어.
ru: Компоненты - директивы с шаблоном.

source: Components, directives, and pipes must belong to <em>exactly</em> one module. The compiler emits an error if you try to declare the same class in more than one module. Be careful not to re-declare a class that is imported directly or indirectly from another module.
es: Los componentes, directivas y tuber&iacute;as deben pertenecer <em>exactamente a</em> un m&oacute;dulo. El compilador emite un error si intenta declarar la misma clase en m&aacute;s de un m&oacute;dulo. Tenga cuidado de no volver a declarar una clase importada directa o indirectamente desde otro m&oacute;dulo.
ja: コンポーネント、ディレクティブ、およびパイプは、<em>正確に</em> 1つのモジュールに属している必要があります。複数のモジュールで同じクラスを宣言しようとすると、コンパイラーはエラーを出します。別のモジュールから直接または間接的にインポートされたクラスを再宣言しないように注意してください。
ko: 구성 요소, 지시문 및 파이프는 <em>정확히</em> 하나의 모듈에 속해야 합니다. 둘 이상의 모듈에서 동일한 클래스를 선언하려고하면 컴파일러에서 오류가 발생합니다. 다른 모듈에서 직접 또는 간접적으로 가져온 클래스를 다시 선언하지 않도록주의하십시오.
ru: Компоненты, директивы и трубы должны принадлежать <em>ровно</em> одному модулю. Компилятор выдает ошибку, если вы пытаетесь объявить один и тот же класс более чем в одном модуле. Будьте осторожны, чтобы не объявлять класс, импортированный прямо или косвенно из другого модуля.

source: Compose dynamic form contents
ja: 動的フォームの内容を構成する
ko: 동적 양식 내용 작성
ru: Составьте динамическое содержание формы

source: Compose form groups
ja: フォームグループを構成する
ko: 양식 그룹 작성
ru: Составлять группы форм

source: Compose multiple async validators into a single function that returns the union of the individual error objects for the provided control.
es: Componer múltiples validadores asíncronos en una sola función que devuelva la unión de los objetos de error individuales para el control proporcionado.
ja: 複数の非同期バリデータを1つの関数にまとめて、提供されたコントロールの個々のエラーオブジェクトの和を返すようにします。
ko: 여러 개의 비동기 유효성 검사기를 하나의 함수로 구성하여 제공된 컨트롤에 대한 개별 오류 개체의 합집합을 반환합니다.
ru: Составьте несколько асинхронных валидаторов в единую функцию,которая возвращает объединение отдельных объектов ошибок для предусмотренного управления.

source: Compose multiple validators into a single function that returns the union of the individual error maps for the provided control.
es: Componer varios validadores en una sola función que devuelva la unión de los mapas de error individuales para el control proporcionado.
ja: 複数のバリデータを1つの関数にまとめて、提供されたコントロールの個々のエラーマップの和を返すようにします。
ko: 제공된 유효성 검사에 대한 개별 오류 맵의 합집합을 반환하는 여러 개의 유효성 검사기를 단일 함수로 구성합니다.
ru: Составьте несколько валидаторов в единую функцию,которая возвращает объединение отдельных карт ошибок для предусмотренного управления.

source: Composing multiple streams
es: Composición de múltiples corrientes
ja: 複数のストリームを構成する
ko: 여러 스트림 작성
ru: Составление нескольких потоков

source: Comprehensive demonstration of Angular's template syntax. For more information, see <a href="template-syntax">Template reference variables</a>.
ja: Angularのテンプレート構文の包括的なデモンストレーション。詳細については、<a href="template-syntax">テンプレート参照変数を</a>参照してください。
ko: Angular의 템플릿 구문에 대한 포괄적 인 데모. 자세한 내용은 <a href="template-syntax">템플릿 참조 변수를 참조하십시오</a> .
ru: Комплексная демонстрация синтаксиса шаблонов Angular. Дополнительные сведения см. В разделе &laquo; <a href="template-syntax">Справочные переменные шаблона&raquo;</a> .

source: Compute a difference between the previous state and the new <code>object</code> state.
es: Calcule una diferencia entre el estado anterior y el nuevo estado del <code>object</code> .
ja: 以前の状態と新しい <code>object</code> 状態の違いを計算します。
ko: 이전 상태와 새 <code>object</code> 상태 간의 차이를 계산합니다 .
ru: Вычислить разницу между предыдущим состоянием и новым состоянием <code>object</code> .

source: Computer notation for exponential value (n times a power of 10). Example: 1.2E3
es: Notación informática para el valor exponencial (n veces una potencia de 10).Ejemplo:1.2E3
ja: 指数値(10の1乗のn倍)のコンピュータ表記法。例:1.2E3
ko: 지수 값에 대한 컴퓨터 표기법 (n 곱하기 10의 거듭 제곱). 예 : 1.2E3
ru: Компьютерная нотация для экспоненциального значения (n умноженного на 10).Пример:1.2E3

source: Concatenate modules with Rollup before bundling them with Webpack.
ja: モジュールをWebpackでバンドルする前に、Rollupでモジュールを連結します。
ko: 모듈을 Webpack과 번들링하기 전에 Rollup과 연결하십시오.
ru: Сконцентрируйте модули с Rollup,прежде чем объединять их с Webpack.
