Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/angular/angular.*.006.xlf
Languages: es, ja, ko, ru, zh_cn

source: Consolidated setup
es: Configuración consolidada
ja: 連結設定
ko: 통합 설정
ru: Консолидированная настройка

source: Constants for the categories of parameters that can be defined for animations.
es: Constantes para las categorías de parámetros que pueden ser definidos para las animaciones.
ja: アニメーションに定義できるパラメータのカテゴリの定数です。
ko: 애니메이션에 정의 할 수있는 매개 변수 범주의 상수입니다.
ru: Константы для категорий параметров,которые могут быть определены для анимации.

source: Constants in API documentation to find more built-in tokens.
es: Constantes en la documentación del API para encontrar más tokens incorporados.
ja: API ドキュメントにある定数で、より多くの組み込みトークンを見つけることができます。
ko: 더 많은 내장 토큰을 찾기위한 API 문서의 상수.
ru: Константы в документации по API,чтобы найти больше встроенных токенов.

source: Construct a new <code><a href="formcontrol">FormControl</a></code> with the given state, validators and options.
es: Construya un nuevo <code><a href="formcontrol">FormControl</a></code> con el estado, validadores y opciones dados.
ja: 指定された状態、バリデーター、およびオプションで新しい <code><a href="formcontrol">FormControl</a></code> を構築します。
ko: 지정된 상태, 검증 자 및 옵션 으로 새로운 <code><a href="formcontrol">FormControl</a></code> 을 구축합니다 .
ru: <code><a href="formcontrol">FormControl</a></code> новый FormControl с заданным состоянием, валидаторами и опциями.

source: Construct a new <code><a href="formgroup">FormGroup</a></code> instance.
es: Construya una nueva instancia de <code><a href="formgroup">FormGroup</a></code> .
ja: 新しい <code><a href="formgroup">FormGroup</a></code> インスタンスを構築します。
ko: 새 <code><a href="formgroup">FormGroup</a></code> 인스턴스를 구성하십시오.
ru: <code><a href="formgroup">FormGroup</a></code> новый экземпляр FormGroup .

source: Construct a new <code><a href="httpresponse">HttpResponse</a></code>.
es: Construya una nueva <code><a href="httpresponse">HttpResponse</a></code> .
ja: 新しい <code><a href="httpresponse">HttpResponse</a></code> を構築します。
ko: 새로운 <code><a href="httpresponse">HttpResponse</a></code> 를 구축합니다 .
ru: Построить новый <code><a href="httpresponse">HttpResponse</a></code> .

source: Constructor or variable initialization?
es: ¿Constructor o inicialización de variables?
ja: コンストラクタか変数の初期化か?
ko: 생성자 또는 변수 초기화?
ru: Конструктор или инициализация переменных?

source: Constructors should do little more than initialize variables. This rule makes the component safe to construct under test without fear that it will do something dramatic like talk to the server. That's why you call the <code>HeroService</code> from within the <code>ngOnInit</code> rather than the constructor.
es: Los constructores deber&iacute;an hacer poco m&aacute;s que inicializar variables. Esta regla hace que el componente sea seguro de construir bajo prueba sin temor a que haga algo dram&aacute;tico como hablar con el servidor. Es por eso que llamas al <code>HeroService</code> desde <code>ngOnInit</code> en lugar del constructor.
ja: コンストラクターは、変数を初期化するだけです。このルールにより、サーバーとの会話のような劇的なことを行うことを恐れずに、テスト下でコンポーネントを安全に構築できます。これが、 <code>ngOnInit</code> ではなくngOnInit内から <code>HeroService</code> を呼び出す理由です。
ko: 생성자는 변수를 초기화하는 것 이상을 수행해야합니다. 이 규칙은 구성 요소가 서버와 대화하는 것과 같은 극적인 작업을 수행 할 것이라는 두려움없이 테스트중인 구성 요소를 안전하게 구성 할 수있게합니다. 당신이 부르는 이유 <code>HeroService</code> 을 내에서 <code>ngOnInit</code> 가 아닌 생성자입니다.
ru: Конструкторы должны делать немного больше, чем инициализировать переменные. Это правило делает компонент безопасным для создания тестируемого компонента, не опасаясь, что он сделает что-то драматическое, например, разговор с сервером. Вот почему вы вызываете <code>HeroService</code> изнутри <code>ngOnInit</code> , а не из конструктора.

source: Constructs a <code>DELETE</code> request that interprets the body as a <code>Blob</code> and returns the full <code>HTTPResponse</code>.
es: Construye una solicitud <code>DELETE</code> que interpreta el cuerpo como un <code>Blob</code> y devuelve la <code>HTTPResponse</code> completa .
ja: 構築 <code>DELETE</code> 解釈として身体その要求 <code>Blob</code> 、完全な戻り <code>HTTPResponse</code> はに。
ko: 본문을 <code>Blob</code> 으로 해석 하고 전체 <code>HTTPResponse</code> 를 리턴 하는 <code>DELETE</code> 요청을 구성합니다 .
ru: Создает запрос <code>DELETE</code> , который интерпретирует тело как <code>Blob</code> объект и возвращает полный <code>HTTPResponse</code> .

source: Constructs a <code>DELETE</code> request that interprets the body as a <code>Blob</code> and returns the full event stream.
es: Construye una solicitud <code>DELETE</code> que interpreta el cuerpo como un <code>Blob</code> y devuelve la secuencia completa del evento.
ja: 構築 <code>DELETE</code> として身体を解釈要求 <code>Blob</code> と完全イベントストリームを返しています。
ko: 본문을 <code>Blob</code> 으로 해석 하고 전체 이벤트 스트림을 반환 하는 <code>DELETE</code> 요청을 구성 합니다.
ru: Создает запрос <code>DELETE</code> , который интерпретирует тело как <code>Blob</code> объект и возвращает полный поток событий.

source: Constructs a <code>DELETE</code> request that interprets the body as a <code>Blob</code> and returns the response as a <code>Blob</code>.
es: Construye una solicitud <code>DELETE</code> que interpreta el cuerpo como un <code>Blob</code> y devuelve la respuesta como un <code>Blob</code> .
ja: 構築 <code>DELETE</code> として身体を解釈要求 <code>Blob</code> ととしての応答を返し <code>Blob</code> 。
ko: 본문을 <code>Blob</code> 으로 해석 하고 응답을 <code>Blob</code> 으로 반환 하는 <code>DELETE</code> 요청을 구성합니다 .
ru: Создает запрос <code>DELETE</code> , который интерпретирует тело как <code>Blob</code> и возвращает ответ как <code>Blob</code> .

source: Constructs a <code>DELETE</code> request that interprets the body as a JSON object and returns the full <code>HTTPResponse</code>.
es: Construye una solicitud <code>DELETE</code> que interpreta el cuerpo como un objeto JSON y devuelve la <code>HTTPResponse</code> completa .
ja: 構築 <code>DELETE</code> 要求をそのJSONオブジェクトとして解釈体と完全戻り <code>HTTPResponse</code> は。
ko: 본문을 JSON 객체로 해석하고 전체 <code>HTTPResponse</code> 를 반환 하는 <code>DELETE</code> 요청을 구성합니다 .
ru: Создает запрос <code>DELETE</code> , который интерпретирует тело как объект JSON и возвращает полный <code>HTTPResponse</code> .

source: Constructs a <code>DELETE</code> request that interprets the body as a JSON object and returns the full event stream.
es: Construye una solicitud <code>DELETE</code> que interpreta el cuerpo como un objeto JSON y devuelve la secuencia completa del evento.
ja: 構築 <code>DELETE</code> JSONオブジェクトとして本体を解釈し、完全なイベント・ストリームを返す要求を。
ko: 본문을 JSON 객체로 해석하고 전체 이벤트 스트림을 반환 하는 <code>DELETE</code> 요청을 구성합니다.
ru: Создает запрос <code>DELETE</code> , который интерпретирует тело как объект JSON и возвращает полный поток событий.

source: Constructs a <code>DELETE</code> request that interprets the body as a JSON object and returns the response body as a JSON object.
es: Construye una solicitud <code>DELETE</code> que interpreta el cuerpo como un objeto JSON y devuelve el cuerpo de la respuesta como un objeto JSON.
ja: 構築 <code>DELETE</code> JSONオブジェクトとして本体を解釈し、JSONオブジェクトとしてレスポンスボディを返す要求を。
ko: 본문을 JSON 객체로 해석하고 응답 본문을 JSON 객체로 반환 하는 <code>DELETE</code> 요청을 구성합니다.
ru: Создает запрос <code>DELETE</code> , который интерпретирует тело как объект JSON и возвращает тело ответа как объект JSON.

source: Constructs a <code>DELETE</code> request that interprets the body as a text stream and returns the full <code>HTTPResponse</code>.
es: Construye una solicitud <code>DELETE</code> que interpreta el cuerpo como una secuencia de texto y devuelve la <code>HTTPResponse</code> completa .
ja: 構築 <code>DELETE</code> 解釈テキストストリームとして本体は、完全返すことを要求 <code>HTTPResponse</code> はに。
ko: 본문을 텍스트 스트림으로 해석하고 전체 <code>HTTPResponse</code> 를 리턴 하는 <code>DELETE</code> 요청을 구성합니다 .
ru: Создает запрос <code>DELETE</code> , который интерпретирует тело как текстовый поток и возвращает полный <code>HTTPResponse</code> .

source: Constructs a <code>DELETE</code> request that interprets the body as a text string and returns a string.
es: Construye una solicitud <code>DELETE</code> que interpreta el cuerpo como una cadena de texto y devuelve una cadena.
ja: 構築 <code>DELETE</code> テキスト文字列として体を解釈し、文字列を返す要求を。
ko: 본문을 텍스트 문자열로 해석하고 문자열을 반환 하는 <code>DELETE</code> 요청을 구성합니다.
ru: Создает запрос <code>DELETE</code> , который интерпретирует тело как текстовую строку и возвращает строку.

source: Constructs a <code>DELETE</code> request that interprets the body as a text string and returns the full event stream.
es: Construye una solicitud <code>DELETE</code> que interpreta el cuerpo como una cadena de texto y devuelve la secuencia completa del evento.
ja: 構築 <code>DELETE</code> テキスト文字列として体を解釈し、完全なイベントストリームを返す要求を。
ko: 본문을 텍스트 문자열로 해석하고 전체 이벤트 스트림을 반환 하는 <code>DELETE</code> 요청을 구성합니다.
ru: Создает запрос <code>DELETE</code> , который интерпретирует тело как текстовую строку и возвращает полный поток событий.

source: Constructs a <code>DELETE</code> request that interprets the body as an <code>ArrayBuffer</code> and returns the full <code>HTTPResponse</code>.
es: Construye una solicitud <code>DELETE</code> que interpreta el cuerpo como un <code>ArrayBuffer</code> y devuelve la <code>HTTPResponse</code> completa .
ja: 構築 <code>DELETE</code> 解釈として身体その要求 <code>ArrayBuffer</code> は、完全な戻り <code>HTTPResponse</code> はに。
ko: 본문을 <code>ArrayBuffer</code> 로 해석 하여 전체 <code>HTTPResponse</code> 를 반환 하는 <code>DELETE</code> 요청을 구성합니다 .
ru: Создает запрос <code>DELETE</code> , который интерпретирует тело как <code>ArrayBuffer</code> и возвращает полный <code>HTTPResponse</code> .

source: Constructs a <code>DELETE</code> request that interprets the body as an <code>ArrayBuffer</code> and returns the full event stream.
es: Construye una solicitud <code>DELETE</code> que interpreta el cuerpo como un <code>ArrayBuffer</code> y devuelve la secuencia completa del evento.
ja: 構築 <code>DELETE</code> として身体を解釈要求 <code>ArrayBuffer</code> フルイベントストリームを返しています。
ko: 본문을 <code>ArrayBuffer</code> 로 해석 하여 전체 이벤트 스트림을 반환 하는 <code>DELETE</code> 요청을 구성 합니다.
ru: Создает запрос <code>DELETE</code> , который интерпретирует тело как <code>ArrayBuffer</code> и возвращает полный поток событий.

source: Constructs a <code>DELETE</code> request that interprets the body as an <code>ArrayBuffer</code> and returns the response as an <code>ArrayBuffer</code>.
es: Construye una solicitud <code>DELETE</code> que interpreta el cuerpo como un <code>ArrayBuffer</code> y devuelve la respuesta como un <code>ArrayBuffer</code> .
ja: 構築 <code>DELETE</code> として身体を解釈要求 <code>ArrayBuffer</code> やとしての応答を返し <code>ArrayBuffer</code> を。
ko: 본문을 <code>ArrayBuffer</code> 로서 해석해 , 응답을 <code>ArrayBuffer</code> 로서 돌려주는 <code>DELETE</code> 요구를 구축합니다 .
ru: Создает запрос <code>DELETE</code> , который интерпретирует тело как <code>ArrayBuffer</code> и возвращает ответ как <code>ArrayBuffer</code> .

source: Constructs a <code>DELETE</code> request the interprets the body as a JSON object and returns the full <code>HTTPResponse</code>.
es: Construye una solicitud <code>DELETE</code> , interpreta el cuerpo como un objeto JSON y devuelve la <code>HTTPResponse</code> completa .
ja: 構築 <code>DELETE</code> JSONオブジェクトを返すフルとして要求を解釈体を <code>HTTPResponse</code> は。
ko: 본문을 JSON 객체로 해석하여 전체 <code>HTTPResponse</code> 를 반환 하는 <code>DELETE</code> 요청을 구성합니다 .
ru: Создает запрос <code>DELETE</code> , интерпретирует тело как объект JSON и возвращает полный <code>HTTPResponse</code> .

source: Constructs a <code>DELETE</code>request that interprets the body as a JSON object and returns the full event stream.
es: Construye una solicitud <code>DELETE</code> que interpreta el cuerpo como un objeto JSON y devuelve la secuencia completa del evento.
ja: 構築 <code>DELETE</code> JSONオブジェクトとして本体を解釈し、完全なイベント・ストリームを返す要求を。
ko: 본문을 JSON 객체로 해석하고 전체 이벤트 스트림을 반환 하는 <code>DELETE</code> 요청을 구성합니다.
ru: Создает запрос <code>DELETE</code> , который интерпретирует тело как объект JSON и возвращает полный поток событий.

source: Constructs a <code>GET</code> request that interprets the body as a <code>Blob</code> and returns the full <code>HTTPResponse</code>.
es: Construye una solicitud <code>GET</code> que interpreta el cuerpo como un <code>Blob</code> y devuelve la <code>HTTPResponse</code> completa .
ja: 構築 <code>GET</code> の解釈として体という要求 <code>Blob</code> 、完全返し <code>HTTPResponse</code> はを。
ko: 본문을 <code>Blob</code> 으로 해석 하고 전체 <code>HTTPResponse</code> 를 반환 하는 <code>GET</code> 요청을 구성합니다 .
ru: Создает запрос <code>GET</code> , который интерпретирует тело как <code>Blob</code> и возвращает полный <code>HTTPResponse</code> .

source: Constructs a <code>GET</code> request that interprets the body as a <code>Blob</code> and returns the full event stream.
es: Construye una solicitud <code>GET</code> que interpreta el cuerpo como un <code>Blob</code> y devuelve la secuencia completa del evento.
ja: 構築 <code>GET</code> のような身体を解釈し、要求 <code>Blob</code> と完全なイベントストリームを返します。
ko: 본문을 <code>Blob</code> 으로 해석 하고 전체 이벤트 스트림을 반환 하는 <code>GET</code> 요청을 구성 합니다.
ru: Создает запрос <code>GET</code> , который интерпретирует тело как <code>Blob</code> объект и возвращает полный поток событий.

source: Constructs a <code>GET</code> request that interprets the body as a <code>Blob</code> and returns the response as a <code>Blob</code>.
es: Construye una solicitud <code>GET</code> que interpreta el cuerpo como un <code>Blob</code> y devuelve la respuesta como un <code>Blob</code> .
ja: 構築 <code>GET</code> のように体を解釈し、要求 <code>Blob</code> ととしての応答を返し <code>Blob</code> 。
ko: 본문을 <code>Blob</code> 으로 해석 하고 응답을 <code>Blob</code> 으로 반환 하는 <code>GET</code> 요청을 구성합니다 .
ru: Создает запрос <code>GET</code> , который интерпретирует тело как <code>Blob</code> и возвращает ответ как <code>Blob</code> .

source: Constructs a <code>GET</code> request that interprets the body as a JSON object and returns the full <code>HTTPResponse</code>.
es: Construye una solicitud <code>GET</code> que interpreta el cuerpo como un objeto JSON y devuelve la <code>HTTPResponse</code> completa .
ja: 構築し <code>GET</code> リクエストをそのJSONオブジェクトとして解釈体と完全戻り <code>HTTPResponse</code> は。
ko: 본문을 JSON 객체로 해석하고 전체 <code>HTTPResponse</code> 를 반환 하는 <code>GET</code> 요청을 구성합니다 .
ru: Создает запрос <code>GET</code> , который интерпретирует тело как объект JSON и возвращает полный <code>HTTPResponse</code> .

source: Constructs a <code>GET</code> request that interprets the body as a JSON object and returns the full event stream.
es: Construye una solicitud <code>GET</code> que interpreta el cuerpo como un objeto JSON y devuelve la secuencia completa del evento.
ja: 構築し <code>GET</code> JSONオブジェクトとして本体を解釈し、完全なイベント・ストリームを返す要求を。
ko: 본문을 JSON 객체로 해석하고 전체 이벤트 스트림을 반환 하는 <code>GET</code> 요청을 구성합니다.
ru: Создает запрос <code>GET</code> , который интерпретирует тело как объект JSON и возвращает полный поток событий.

source: Constructs a <code>GET</code> request that interprets the body as a JSON object and returns the response body as a JSON object.
es: Construye una solicitud <code>GET</code> que interpreta el cuerpo como un objeto JSON y devuelve el cuerpo de la respuesta como un objeto JSON.
ja: 構築し <code>GET</code> リクエストをそのJSONオブジェクトとしてJSONオブジェクトを返す応答ボディとして解釈体。
ko: 본문을 JSON 객체로 해석하고 응답 본문을 JSON 객체로 반환 하는 <code>GET</code> 요청을 구성합니다.
ru: Создает запрос <code>GET</code> , который интерпретирует тело как объект JSON и возвращает тело ответа как объект JSON.

source: Constructs a <code>GET</code> request that interprets the body as a JSON object and returns the response body in a given type.
es: Construye una solicitud <code>GET</code> que interpreta el cuerpo como un objeto JSON y devuelve el cuerpo de la respuesta en un tipo dado.
ja: 構築し <code>GET</code> JSONオブジェクトとして本体を解釈し、指定されたタイプに応答ボディを返す要求を。
ko: 본문을 JSON 객체로 해석하고 지정된 형식으로 응답 본문을 반환 하는 <code>GET</code> 요청을 구성합니다.
ru: Создает запрос <code>GET</code> , который интерпретирует тело как объект JSON и возвращает тело ответа в заданном типе.

source: Constructs a <code>GET</code> request that interprets the body as a text stream and returns the full <code>HTTPResponse</code>.
es: Construye una solicitud <code>GET</code> que interpreta el cuerpo como una secuencia de texto y devuelve la <code>HTTPResponse</code> completa .
ja: 構築 <code>GET</code> の解釈テキストストリームとして体が、フル返す要求 <code>HTTPResponse</code> はを。
ko: 본문을 텍스트 스트림으로 해석하고 전체 <code>HTTPResponse</code> 를 리턴 하는 <code>GET</code> 요청을 구성합니다 .
ru: Создает запрос <code>GET</code> , который интерпретирует тело как текстовый поток и возвращает полный <code>HTTPResponse</code> .

source: Constructs a <code>GET</code> request that interprets the body as a text string and returns the full event stream.
es: Construye una solicitud <code>GET</code> que interpreta el cuerpo como una cadena de texto y devuelve la secuencia completa del evento.
ja: 構築 <code>GET</code> のテキスト文字列として体を解釈し、完全なイベントストリームを返す要求を。
ko: 본문을 텍스트 문자열로 해석하고 전체 이벤트 스트림을 반환 하는 <code>GET</code> 요청을 구성합니다.
ru: Создает запрос <code>GET</code> , который интерпретирует тело как текстовую строку и возвращает полный поток событий.

source: Constructs a <code>GET</code> request that interprets the body as a text string and returns the response as a string value.
es: Construye una solicitud <code>GET</code> que interpreta el cuerpo como una cadena de texto y devuelve la respuesta como un valor de cadena.
ja: 構築 <code>GET</code> のテキスト文字列として体を解釈し、文字列値としてレスポンスを返すリクエストを。
ko: 본문을 텍스트 문자열로 해석하고 응답을 문자열 값으로 반환 하는 <code>GET</code> 요청을 구성합니다.
ru: Создает запрос <code>GET</code> , который интерпретирует тело как текстовую строку и возвращает ответ как строковое значение.

source: Constructs a <code>GET</code> request that interprets the body as an <code>ArrayBuffer</code> and returns the full <code>HTTPResponse</code>.
es: Construye una solicitud <code>GET</code> que interpreta el cuerpo como un <code>ArrayBuffer</code> y devuelve la <code>HTTPResponse</code> completa .
ja: 構築 <code>GET</code> の解釈として本体その要求 <code>ArrayBuffer</code> は、完全な戻り <code>HTTPResponse</code> はに。
ko: 본문을 <code>ArrayBuffer</code> 로 해석 하고 전체 <code>HTTPResponse</code> 를 반환 하는 <code>GET</code> 요청을 구성합니다 .
ru: Создает запрос <code>GET</code> , который интерпретирует тело как <code>ArrayBuffer</code> и возвращает полный <code>HTTPResponse</code> .

source: Constructs a <code>GET</code> request that interprets the body as an <code>ArrayBuffer</code> and returns the full event stream.
es: Construye una solicitud <code>GET</code> que interpreta el cuerpo como un <code>ArrayBuffer</code> y devuelve la secuencia completa del evento.
ja: 構築 <code>GET</code> のように体を解釈し、要求 <code>ArrayBuffer</code> フルイベントストリームを返しています。
ko: 본문을 <code>ArrayBuffer</code> 로 해석 하고 전체 이벤트 스트림을 반환 하는 <code>GET</code> 요청을 구성 합니다.
ru: Создает запрос <code>GET</code> , который интерпретирует тело как <code>ArrayBuffer</code> и возвращает полный поток событий.

source: Constructs a <code>GET</code> request that interprets the body as an <code>ArrayBuffer</code> and returns the response in an <code>ArrayBuffer</code>.
es: Construye una solicitud <code>GET</code> que interpreta el cuerpo como un <code>ArrayBuffer</code> y devuelve la respuesta en un <code>ArrayBuffer</code> .
ja: 構築し <code>GET</code> リクエストをそのとして解釈体 <code>ArrayBuffer</code> 戻るに応答 <code>ArrayBuffer</code> 。
ko: 본문을 <code>ArrayBuffer</code> 로 해석하고 ArrayBuffer 에 응답을 반환 하는 <code>GET</code> 요청을 <code>ArrayBuffer</code> 합니다.
ru: Создает запрос <code>GET</code> , который интерпретирует тело как <code>ArrayBuffer</code> и возвращает ответ в <code>ArrayBuffer</code> .

source: Constructs a <code>HEAD</code> request that interprets the body as a <code>Blob</code> and returns the full <code>HTTPResponse</code>.
es: Construye una solicitud <code>HEAD</code> que interpreta el cuerpo como un <code>Blob</code> y devuelve la <code>HTTPResponse</code> completa .
ja: 構築 <code>HEAD</code> の解釈として本体その要求 <code>Blob</code> 、完全な戻り <code>HTTPResponse</code> はに。
ko: 본문을 <code>Blob</code> 으로 해석 하고 전체 <code>HTTPResponse</code> 를 리턴 하는 <code>HEAD</code> 요청을 구성합니다 .
ru: Создает запрос <code>HEAD</code> , который интерпретирует тело как <code>Blob</code> и возвращает полный <code>HTTPResponse</code> .

source: Constructs a <code>HEAD</code> request that interprets the body as a <code>Blob</code> and returns the full event stream.
es: Construye una solicitud <code>HEAD</code> que interpreta el cuerpo como un <code>Blob</code> y devuelve la secuencia completa del evento.
ja: 構築 <code>HEAD</code> のように本体を解釈し、要求 <code>Blob</code> と完全イベントストリームを返しています。
ko: 본문을 <code>Blob</code> 으로 해석 하고 전체 이벤트 스트림을 반환 하는 <code>HEAD</code> 요청을 구성 합니다.
ru: Создает запрос <code>HEAD</code> , который интерпретирует тело как <code>Blob</code> объект и возвращает полный поток событий.

source: Constructs a <code>HEAD</code> request that interprets the body as a <code>Blob</code> and returns the response as a <code>Blob</code>.
es: Construye una solicitud <code>HEAD</code> que interpreta el cuerpo como un <code>Blob</code> y devuelve la respuesta como un <code>Blob</code> .
ja: 構築 <code>HEAD</code> のように本体を解釈し、要求 <code>Blob</code> ととしての応答を返し <code>Blob</code> 。
ko: 본문을 <code>Blob</code> 으로 해석 하고 응답을 <code>Blob</code> 으로 반환 하는 <code>HEAD</code> 요청을 구성합니다 .
ru: Создает запрос <code>HEAD</code> , который интерпретирует тело как <code>Blob</code> и возвращает ответ как <code>Blob</code> .

source: Constructs a <code>HEAD</code> request that interprets the body as a JSON object and returns the full <code>HTTPResponse</code>.
es: Construye una solicitud <code>HEAD</code> que interpreta el cuerpo como un objeto JSON y devuelve la <code>HTTPResponse</code> completa .
ja: 構築 <code>HEAD</code> の要求をそのJSONオブジェクトとして解釈体と完全戻り <code>HTTPResponse</code> は。
ko: 본문을 JSON 객체로 해석하고 전체 <code>HTTPResponse</code> 를 반환 하는 <code>HEAD</code> 요청을 구성합니다 .
ru: Создает запрос <code>HEAD</code> , который интерпретирует тело как объект JSON и возвращает полный <code>HTTPResponse</code> .

source: Constructs a <code>HEAD</code> request that interprets the body as a JSON object and returns the full HTTP event stream.
es: Construye una solicitud <code>HEAD</code> que interpreta el cuerpo como un objeto JSON y devuelve la secuencia completa de eventos HTTP.
ja: 構築 <code>HEAD</code> の JSONオブジェクトとして本体を解釈し、完全なHTTPイベントストリームを返す要求を。
ko: 본문을 JSON 객체로 해석하고 전체 HTTP 이벤트 스트림을 반환 하는 <code>HEAD</code> 요청을 구성합니다.
ru: Создает запрос <code>HEAD</code> , который интерпретирует тело как объект JSON и возвращает полный поток событий HTTP.

source: Constructs a <code>HEAD</code> request that interprets the body as a JSON object and returns the full event stream.
es: Construye una solicitud <code>HEAD</code> que interpreta el cuerpo como un objeto JSON y devuelve la secuencia completa del evento.
ja: 構築 <code>HEAD</code> の JSONオブジェクトとして本体を解釈し、完全なイベント・ストリームを返す要求を。
ko: 본문을 JSON 객체로 해석하고 전체 이벤트 스트림을 반환 하는 <code>HEAD</code> 요청을 구성합니다.
ru: Создает запрос <code>HEAD</code> , который интерпретирует тело как объект JSON и возвращает полный поток событий.

source: Constructs a <code>HEAD</code> request that interprets the body as a JSON object and returns the response body as a JSON object.
es: Construye una solicitud <code>HEAD</code> que interpreta el cuerpo como un objeto JSON y devuelve el cuerpo de la respuesta como un objeto JSON.
ja: 構築 <code>HEAD</code> の JSONオブジェクトとして本体を解釈し、JSONオブジェクトとしてレスポンスボディを返す要求を。
ko: 본문을 JSON 객체로 해석하고 응답 본문을 JSON 객체로 반환 하는 <code>HEAD</code> 요청을 구성합니다.
ru: Создает запрос <code>HEAD</code> , который интерпретирует тело как объект JSON и возвращает тело ответа как объект JSON.

source: Constructs a <code>HEAD</code> request that interprets the body as a JSON object and returns the response in a given type.
es: Construye una solicitud <code>HEAD</code> que interpreta el cuerpo como un objeto JSON y devuelve la respuesta en un tipo dado.
ja: 構築 <code>HEAD</code> の JSONオブジェクトとして本体を解釈し、指定されたタイプで応答を返す要求を。
ko: 본문을 JSON 객체로 해석하고 지정된 유형으로 응답을 반환 하는 <code>HEAD</code> 요청을 구성합니다.
ru: Создает запрос <code>HEAD</code> , который интерпретирует тело как объект JSON и возвращает ответ в заданном типе.
