Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/angular/angular.*.006.xlf
Languages: es, ja, ko, ru, zh_cn

source: Constructs a <code>PUT</code> request that interprets the body as a text string and returns the full event stream.
es: Construye una solicitud <code>PUT</code> que interpreta el cuerpo como una cadena de texto y devuelve la secuencia completa del evento.
ja: 構築 <code>PUT</code> のテキスト文字列として体を解釈し、完全なイベントストリームを返す要求を。
ko: 본문을 텍스트 문자열로 해석하고 전체 이벤트 스트림을 반환 하는 <code>PUT</code> 요청을 구성합니다.
ru: Создает запрос <code>PUT</code> , который интерпретирует тело как текстовую строку и возвращает полный поток событий.

source: Constructs a <code>PUT</code> request that interprets the body as a text string and returns the response as a string value.
es: Construye una solicitud <code>PUT</code> que interpreta el cuerpo como una cadena de texto y devuelve la respuesta como un valor de cadena.
ja: 構築 <code>PUT</code> のテキスト文字列として本体を解釈し、文字列値として応答を返す要求を。
ko: 본문을 텍스트 문자열로 해석하고 응답을 문자열 값으로 반환 하는 <code>PUT</code> 요청을 구성합니다.
ru: Создает запрос <code>PUT</code> , который интерпретирует тело как текстовую строку и возвращает ответ как строковое значение.

source: Constructs a <code>PUT</code> request that interprets the body as an <code>ArrayBuffer</code> and returns an observable of the full HTTP response.
es: Construye una solicitud <code>PUT</code> que interpreta el cuerpo como un <code>ArrayBuffer</code> y devuelve un observable de la respuesta HTTP completa.
ja: 構築 <code>PUT</code> のように体を解釈し、要求 <code>ArrayBuffer</code> 、フルHTTP応答の観察を返すを。
ko: 본문을 <code>ArrayBuffer</code> 로 해석 하고 전체 HTTP 응답의 관찰 가능을 반환 하는 <code>PUT</code> 요청을 구성합니다 .
ru: Создает запрос <code>PUT</code> , который интерпретирует тело как <code>ArrayBuffer</code> и возвращает наблюдаемый полный HTTP-ответ.

source: Constructs a <code>PUT</code> request that interprets the body as an <code>ArrayBuffer</code> and returns the full event stream.
es: Construye una solicitud <code>PUT</code> que interpreta el cuerpo como un <code>ArrayBuffer</code> y devuelve la secuencia completa del evento.
ja: 構築 <code>PUT</code> のように体を解釈し、要求 <code>ArrayBuffer</code> フルイベントストリームを返しています。
ko: 본문을 <code>ArrayBuffer</code> 로 해석 하고 전체 이벤트 스트림을 반환 하는 <code>PUT</code> 요청을 구성 합니다.
ru: Создает запрос <code>PUT</code> , который интерпретирует тело как <code>ArrayBuffer</code> и возвращает полный поток событий.

source: Constructs a <code>PUT</code> request that interprets the body as an <code>ArrayBuffer</code> and returns the response as an <code>ArrayBuffer</code>.
es: Construye una solicitud <code>PUT</code> que interpreta el cuerpo como un <code>ArrayBuffer</code> y devuelve la respuesta como un <code>ArrayBuffer</code> .
ja: 構築 <code>PUT</code> のように体を解釈し、要求 <code>ArrayBuffer</code> やとしての応答を返し <code>ArrayBuffer</code> を。
ko: 본문을 <code>ArrayBuffer</code> 로 해석 하고 응답을 <code>ArrayBuffer</code> 로 반환 하는 <code>PUT</code> 요청을 구성 합니다.
ru: Создает запрос <code>PUT</code> , который интерпретирует тело как <code>ArrayBuffer</code> и возвращает ответ как <code>ArrayBuffer</code> .

source: Constructs a <code>PUT</code> request that interprets the body as an instance of the requested type and returns an observable of the requested type.
ja: ボディをリクエストされたタイプのインスタンスとして解釈し、リクエストされたタイプのオブザーバブルを返す <code>PUT</code> リクエストを構築します。
ko: 본문을 요청 된 유형의 인스턴스로 해석하고 요청 된 유형의 관찰 가능 항목을 반환 하는 <code>PUT</code> 요청을 구성합니다.
ru: Создает запрос <code>PUT</code> , который интерпретирует тело как экземпляр запрошенного типа и возвращает наблюдаемое запрошенного типа.

source: Constructs a <code>PUT</code> request that interprets the body as an instance of the requested type and returns the full HTTP response.
ja: 本体を要求されたタイプのインスタンスとして解釈し、完全なHTTP応答を返す <code>PUT</code> 要求を構築します。
ko: 본문을 요청 된 유형의 인스턴스로 해석하고 전체 HTTP 응답을 반환 하는 <code>PUT</code> 요청을 생성합니다.
ru: Создает запрос <code>PUT</code> , который интерпретирует тело как экземпляр запрошенного типа и возвращает полный ответ HTTP.

source: Constructs a DELETE request that interprets the body as a JSON object and returns the response in a given type.
es: Construye una petición de BORRAR que interpreta el cuerpo como un objeto JSON y devuelve la respuesta en un tipo determinado.
ja: ボディを JSON オブジェクトとして解釈し、指定された型でレスポンスを返す DELETE リクエストを構築します。
ko: 본문을 JSON 객체로 해석하고 지정된 유형으로 응답을 반환하는 DELETE 요청을 구성합니다.
ru: Создает запрос DELETE,интерпретирующий тело как JSON-объект и возвращающий ответ заданного типа.

source: Constructs a POST request that interprets the body as a JSON object and returns the full event stream.
es: Construye una petición POST que interpreta el cuerpo como un objeto JSON y devuelve el flujo de eventos completo.
ja: ボディをJSONオブジェクトとして解釈し、完全なイベントストリームを返すPOSTリクエストを構築します。
ko: 본문을 JSON 객체로 해석하고 전체 이벤트 스트림을 반환하는 POST 요청을 구성합니다.
ru: Построение POST запроса,интерпретирующего тело как JSON объект и возвращающего полный поток событий.

source: Constructs a POST request that interprets the body as an <code>ArrayBuffer</code> and returns the full <code>HTTPresponse</code>.
es: Construye una solicitud POST que interpreta el cuerpo como un <code>ArrayBuffer</code> y devuelve la <code>HTTPresponse</code> completa .
ja: 本文を <code>ArrayBuffer</code> として解釈し、完全な <code>HTTPresponse</code> を返すPOSTリクエストを作成します。
ko: 본문을 <code>ArrayBuffer</code> 로 해석 하여 전체 <code>HTTPresponse</code> 를 리턴 하는 POST 요청을 구성 합니다.
ru: Создает POST-запрос, который интерпретирует тело как <code>ArrayBuffer</code> и возвращает полный <code>HTTPresponse</code> .

source: Constructs a new <code><a href="formarray">FormArray</a></code> from the given array of configurations, validators and options.
es: Construye un nuevo <code><a href="formarray">FormArray</a></code> a partir de la matriz dada de configuraciones, validadores y opciones.
ja: <code><a href="formarray">FormArray</a></code> れた構成、バリデータ、オプションの配列から新しいFormArrayを構築します。
ko: 지정된 구성, 검증 자 및 옵션의 배열로부터 새로운 <code><a href="formarray">FormArray</a></code> 를 구축합니다 .
ru: Создает новый <code><a href="formarray">FormArray</a></code> из заданного массива конфигураций, валидаторов и опций.

source: Constructs a new HTTP header object with the given values.
es: Construye un nuevo objeto de cabecera HTTP con los valores dados.
ja: 与えられた値で新しいHTTPヘッダオブジェクトを構築します。
ko: 지정된 값으로 새로운 HTTP 헤더 객체를 구축합니다.
ru: Создает новый объект заголовка HTTP с заданными значениями.

source: Constructs a request that interprets the body as a <code>Blob</code> and returns the full event stream.
es: Construye una solicitud que interpreta el cuerpo como un <code>Blob</code> y devuelve la secuencia completa del evento.
ja: ボディを <code>Blob</code> として解釈し、完全なイベントストリームを返すリクエストを作成します。
ko: 본문을 <code>Blob</code> 으로 해석 하고 전체 이벤트 스트림을 반환 하는 요청을 구성 합니다.
ru: Создает запрос, который интерпретирует тело как <code>Blob</code> объект и возвращает полный поток событий.

source: Constructs a request that interprets the body as a blob and returns the response as a blob.
es: Construye una petición que interpreta el cuerpo como una mancha y devuelve la respuesta como una mancha.
ja: ボディを blob として解釈し、レスポンスを blob として返すリクエストを構築します。
ko: 본문을 Blob으로 해석하고 응답을 Blob으로 반환하는 요청을 구성합니다.
ru: Конструирует запрос,интерпретирующий тело как капля и возвращающий ответ как капля.

source: Constructs a request that interprets the body as a text string and returns a string value.
es: Construye una petición que interpreta el cuerpo como una cadena de texto y devuelve un valor de cadena.
ja: ボディをテキスト文字列として解釈し、文字列の値を返すリクエストを構築します。
ko: 본문을 텍스트 문자열로 해석하고 문자열 값을 반환하는 요청을 구성합니다.
ru: Строит запрос,интерпретирующий тело как текстовую строку и возвращающий строковое значение.

source: Constructs a request that interprets the body as an <code>ArrayBuffer</code> and returns the response in an <code>ArrayBuffer</code>.
es: Construye una solicitud que interpreta el cuerpo como un <code>ArrayBuffer</code> y devuelve la respuesta en un <code>ArrayBuffer</code> .
ja: 要求を構築したものと解釈体 <code>ArrayBuffer</code> 戻るに応答 <code>ArrayBuffer</code> 。
ko: 요청을 구축한다는 등의 해석 몸 <code>ArrayBuffer</code> 과 다시 표시에 응답 <code>ArrayBuffer</code> .
ru: Создает запрос, который интерпретирует тело как <code>ArrayBuffer</code> и возвращает ответ в <code>ArrayBuffer</code> .

source: Constructs a request that interprets the body as an <code>ArrayBuffer</code> and returns the the full event stream.
es: Construye una solicitud que interpreta el cuerpo como un <code>ArrayBuffer</code> y devuelve la secuencia completa del evento.
ja: 本文を <code>ArrayBuffer</code> として解釈し、完全なイベントストリームを返すリクエストを作成します。
ko: 본문을 <code>ArrayBuffer</code> 로 해석 하고 전체 이벤트 스트림을 반환 하는 요청을 구성 합니다.
ru: Создает запрос, который интерпретирует тело как <code>ArrayBuffer</code> и возвращает полный поток событий.

source: Constructs a request where response type and requested observable are not known statically.
es: Construye una solicitud en la que no se conoce estáticamente el tipo de respuesta y la observancia solicitada.
ja: レスポンスタイプとリクエストされたオブザーバブルが静的に知られていない場合に、リクエストを構築します。
ko: 응답 유형과 요청 된 관찰 가능 항목을 정적으로 알 수없는 요청을 구성합니다.
ru: Строит запрос,в котором тип ответа и запрос,наблюдаемый статически,не известны.

source: Constructs a request which interprets the body as a <code>Blob</code> and returns the full <code>HTTPResponse</code>.
es: Construye una solicitud que interpreta el cuerpo como un <code>Blob</code> y devuelve la <code>HTTPResponse</code> completa .
ja: 本文を <code>Blob</code> として解釈し、完全な <code>HTTPResponse</code> を返すリクエストを作成します。
ko: 본문을 <code>Blob</code> 으로 해석 하고 전체 <code>HTTPResponse</code> 를 반환 하는 요청을 구성합니다 .
ru: Создает запрос, который интерпретирует тело как <code>Blob</code> и возвращает полный <code>HTTPResponse</code> .

source: Constructs a request which interprets the body as a JSON object and returns the full <code>HTTPResponse</code> as a JSON object.
es: Construye una solicitud que interpreta el cuerpo como un objeto JSON y devuelve la <code>HTTPResponse</code> completa como un objeto JSON.
ja: 本文をJSONオブジェクトとして解釈し、完全な <code>HTTPResponse</code> をJSONオブジェクトとして返すリクエストを作成します。
ko: 본문을 JSON 객체로 해석하고 전체 <code>HTTPResponse</code> 를 JSON 객체로 반환하는 요청을 구성 합니다.
ru: Создает запрос, который интерпретирует тело как объект JSON и возвращает полный <code>HTTPResponse</code> как объект JSON.

source: Constructs a request which interprets the body as a JSON object and returns the full <code>HTTPResponse</code> with the response body in the requested type.
es: Construye una solicitud que interpreta el cuerpo como un objeto JSON y devuelve la respuesta <code>HTTPResponse</code> completa con el cuerpo de respuesta en el tipo solicitado.
ja: ボディをJSONオブジェクトとして解釈するリクエストを <code>HTTPResponse</code> し、リクエストされたタイプのレスポンスボディとともに完全なHTTPResponseを返します。
ko: 본문을 JSON 객체로 해석 하고 요청 된 유형의 응답 본문이 포함 된 전체 <code>HTTPResponse</code> 를 반환 하는 요청을 구성합니다.
ru: Создает запрос, который интерпретирует тело как объект JSON и возвращает полный <code>HTTPResponse</code> с телом ответа в запрошенном типе.

source: Constructs a request which interprets the body as a JSON object and returns the full <code>HTTPResponse</code>.
es: Construye una solicitud que interpreta el cuerpo como un objeto JSON y devuelve la <code>HTTPResponse</code> completa .
ja: 本文をJSONオブジェクトとして解釈し、完全な <code>HTTPResponse</code> を返すリクエストを作成します。
ko: 본문을 JSON 객체로 해석하고 전체 <code>HTTPResponse</code> 를 반환하는 요청을 구성합니다 .
ru: Создает запрос, который интерпретирует тело как объект JSON и возвращает полный <code>HTTPResponse</code> .

source: Constructs a request which interprets the body as a JSON object and returns the full event stream.
es: Construye una petición que interpreta el cuerpo como un objeto JSON y devuelve el flujo de eventos completo.
ja: ボディを JSON オブジェクトとして解釈し、完全なイベントストリームを返すリクエストを構築します。
ko: 본문을 JSON 객체로 해석하고 전체 이벤트 스트림을 반환하는 요청을 구성합니다.
ru: Создает запрос,который интерпретирует тело как JSON-объект и возвращает полный поток событий.

source: Constructs a request which interprets the body as a JSON object with the response body of the requested type.
es: Construye una petición que interpreta el cuerpo como un objeto JSON con el cuerpo de respuesta del tipo solicitado.
ja: リクエストのボディを JSON オブジェクトとして解釈し、リクエストされた型のレスポンスボディを持つリクエストを構築します。
ko: 요청 된 유형의 응답 본문을 사용하여 본문을 JSON 객체로 해석하는 요청을 구성합니다.
ru: Строит запрос,интерпретирующий тело как JSON-объект с телом ответа запрашиваемого типа.

source: Constructs a request which interprets the body as a text stream and returns the full <code>HTTPResponse</code>.
es: Construye una solicitud que interpreta el cuerpo como una secuencia de texto y devuelve la <code>HTTPResponse</code> completa .
ja: 本文をテキストストリームとして解釈し、完全な <code>HTTPResponse</code> を返すリクエストを作成します。
ko: 본문을 텍스트 스트림으로 해석하고 전체 <code>HTTPResponse</code> 를 리턴하는 요청을 구성합니다 .
ru: Создает запрос, который интерпретирует тело как текстовый поток и возвращает полный <code>HTTPResponse</code> .

source: Constructs a request which interprets the body as a text string and returns the full event stream.
es: Construye una petición que interpreta el cuerpo como una cadena de texto y devuelve el flujo de eventos completo.
ja: ボディをテキスト文字列として解釈し、完全なイベントストリームを返すリクエストを構築します。
ko: 본문을 텍스트 문자열로 해석하고 전체 이벤트 스트림을 반환하는 요청을 구성합니다.
ru: Строит запрос,который интерпретирует тело как текстовую строку и возвращает полный поток событий.

source: Constructs a request which interprets the body as an <code>ArrayBuffer</code> and returns the full <code>HTTPResponse</code>.
es: Construye una solicitud que interpreta el cuerpo como un <code>ArrayBuffer</code> y devuelve la <code>HTTPResponse</code> completa .
ja: 本文を <code>ArrayBuffer</code> として解釈し、完全な <code>HTTPResponse</code> を返すリクエストを作成します。
ko: 본문을 <code>ArrayBuffer</code> 로 해석 하고 전체 <code>HTTPResponse</code> 를 반환 하는 요청을 구성합니다 .
ru: Создает запрос, который интерпретирует тело как <code>ArrayBuffer</code> и возвращает полный <code>HTTPResponse</code> .

source: Constructs an <code>OPTIONS</code> request that interprets the body as a <code>Blob</code> and returns the full <code>HTTPResponse</code>.
es: Construye una solicitud <code>OPTIONS</code> que interpreta el cuerpo como un <code>Blob</code> y devuelve la <code>HTTPResponse</code> completa .
ja: 構築 <code>OPTIONS</code> ように、その解釈に体を要求 <code>Blob</code> を返す完全 <code>HTTPResponse</code> は。
ko: 본문을 <code>Blob</code> 으로 해석 하고 전체 <code>HTTPResponse</code> 를 리턴 하는 <code>OPTIONS</code> 요청을 구성합니다 .
ru: Создает запрос <code>OPTIONS</code> , который интерпретирует тело как <code>Blob</code> объект и возвращает полный <code>HTTPResponse</code> .

source: Constructs an <code>OPTIONS</code> request that interprets the body as a <code>Blob</code> and returns the full event stream.
es: Construye una solicitud de <code>OPTIONS</code> que interpreta el cuerpo como un <code>Blob</code> y devuelve la secuencia completa del evento.
ja: 構築 <code>OPTIONS</code> ように、その解釈に体を要求 <code>Blob</code> フルイベントストリームを返します。
ko: 본문을 <code>Blob</code> 으로 해석 하고 전체 이벤트 스트림을 반환 하는 <code>OPTIONS</code> 요청을 구성 합니다.
ru: Создает запрос <code>OPTIONS</code> , который интерпретирует тело как <code>Blob</code> объект и возвращает полный поток событий.

source: Constructs an <code>OPTIONS</code> request that interprets the body as a <code>Blob</code> and returns the response as a <code>Blob</code>.
es: Construye una solicitud de <code>OPTIONS</code> que interpreta el cuerpo como un <code>Blob</code> y devuelve la respuesta como un <code>Blob</code> .
ja: 構築 <code>OPTIONS</code> ように、その解釈に体を要求 <code>Blob</code> を返すような応答 <code>Blob</code> 。
ko: 본문을 <code>Blob</code> 으로 해석 하고 응답을 <code>Blob</code> 으로 반환 하는 <code>OPTIONS</code> 요청을 구성합니다 .
ru: Создает запрос <code>OPTIONS</code> , который интерпретирует тело как <code>Blob</code> и возвращает ответ как <code>Blob</code> .

source: Constructs an <code>OPTIONS</code> request that interprets the body as a JSON object and returns the full <code>HTTPResponse</code>.
es: Construye una solicitud <code>OPTIONS</code> que interpreta el cuerpo como un objeto JSON y devuelve la <code>HTTPResponse</code> completa .
ja: 構築物は、 <code>OPTIONS</code> は、 JSONオブジェクトと完全戻るように、その解釈に体を要求 <code>HTTPResponse</code> は。
ko: 본문을 JSON 객체로 해석하고 전체 <code>HTTPResponse</code> 를 반환 하는 <code>OPTIONS</code> 요청을 구성합니다 .
ru: Создает запрос <code>OPTIONS</code> , который интерпретирует тело как объект JSON и возвращает полный <code>HTTPResponse</code> .

source: Constructs an <code>OPTIONS</code> request that interprets the body as a JSON object and returns the full event stream.
es: Construye una solicitud <code>OPTIONS</code> que interpreta el cuerpo como un objeto JSON y devuelve la secuencia completa del evento.
ja: 構築物は、 <code>OPTIONS</code> は、 JSONオブジェクトを返す完全なイベント・ストリームとして、その解釈に身体を要求します。
ko: 본문을 JSON 객체로 해석하고 전체 이벤트 스트림을 반환 하는 <code>OPTIONS</code> 요청을 구성합니다.
ru: Создает запрос <code>OPTIONS</code> , который интерпретирует тело как объект JSON и возвращает полный поток событий.

source: Constructs an <code>OPTIONS</code> request that interprets the body as a JSON object and returns the response body as a JSON object.
es: Construye una solicitud <code>OPTIONS</code> que interpreta el cuerpo como un objeto JSON y devuelve el cuerpo de la respuesta como un objeto JSON.
ja: 構築 <code>OPTIONS</code> は JSONオブジェクトとしてその解釈に身体を要求し、JSONオブジェクトとしてレスポンスボディを返します。
ko: 본문을 JSON 객체로 해석하고 응답 본문을 JSON 객체로 반환 하는 <code>OPTIONS</code> 요청을 구성합니다.
ru: Создает запрос <code>OPTIONS</code> , который интерпретирует тело как объект JSON и возвращает тело ответа как объект JSON.

source: Constructs an <code>OPTIONS</code> request that interprets the body as a JSON object and returns the response in a given type.
es: Construye una solicitud de <code>OPTIONS</code> que interpreta el cuerpo como un objeto JSON y devuelve la respuesta en un tipo dado.
ja: 構築物は、 <code>OPTIONS</code> は、 JSONオブジェクトと戻り、所与のタイプの応答として、その解釈に身体を要求します。
ko: 본문을 JSON 객체로 해석하고 지정된 유형으로 응답을 반환 하는 <code>OPTIONS</code> 요청을 구성합니다.
ru: Создает запрос <code>OPTIONS</code> , который интерпретирует тело как объект JSON и возвращает ответ в заданном типе.

source: Constructs an <code>OPTIONS</code> request that interprets the body as a text string and returns a string value.
es: Construye una solicitud <code>OPTIONS</code> que interpreta el cuerpo como una cadena de texto y devuelve un valor de cadena.
ja: 構築 <code>OPTIONS</code> 、テキスト文字列を返す文字列値として、その解釈に身体を要求します。
ko: 본문을 텍스트 문자열로 해석하고 문자열 값을 반환 하는 <code>OPTIONS</code> 요청을 구성합니다.
ru: Создает запрос <code>OPTIONS</code> , который интерпретирует тело как текстовую строку и возвращает строковое значение.

source: Constructs an <code>OPTIONS</code> request that interprets the body as a text string and returns the full event stream.
es: Construye una solicitud de <code>OPTIONS</code> que interpreta el cuerpo como una cadena de texto y devuelve la secuencia completa del evento.
ja: 構築 <code>OPTIONS</code> は、テキスト文字列を返す完全なイベントストリームとしてその解釈に体を要求します。
ko: 본문을 텍스트 문자열로 해석하고 전체 이벤트 스트림을 반환 하는 <code>OPTIONS</code> 요청을 구성합니다.
ru: Создает запрос <code>OPTIONS</code> , который интерпретирует тело как текстовую строку и возвращает полный поток событий.

source: Constructs an <code>OPTIONS</code> request that interprets the body as an <code>ArrayBuffer</code> and returns the full HTTP response.
es: Construye una solicitud <code>OPTIONS</code> que interpreta el cuerpo como un <code>ArrayBuffer</code> y devuelve la respuesta HTTP completa.
ja: 構築 <code>OPTIONS</code> ように、その解釈に体を要求 <code>ArrayBuffer</code> 、フルHTTPレスポンスを返します。
ko: 본문을 <code>ArrayBuffer</code> 로 해석 하고 전체 HTTP 응답을 반환 하는 <code>OPTIONS</code> 요청을 구성합니다 .
ru: Создает запрос <code>OPTIONS</code> , который интерпретирует тело как <code>ArrayBuffer</code> и возвращает полный HTTP-ответ.

source: Constructs an <code>OPTIONS</code> request that interprets the body as an <code>ArrayBuffer</code> and returns the full event stream.
es: Construye una solicitud de <code>OPTIONS</code> que interpreta el cuerpo como un <code>ArrayBuffer</code> y devuelve la secuencia completa del evento.
ja: 構築 <code>OPTIONS</code> ように、その解釈に体を要求 <code>ArrayBuffer</code> 戻る完全なイベントストリーム。
ko: 본문을 <code>ArrayBuffer</code> 로 해석 하고 전체 이벤트 스트림을 반환 하는 <code>OPTIONS</code> 요청을 구성 합니다.
ru: Создает запрос <code>OPTIONS</code> , который интерпретирует тело как <code>ArrayBuffer</code> и возвращает полный поток событий.

source: Constructs an <code>OPTIONS</code> request that interprets the body as an <code>ArrayBuffer</code> and returns the response as an <code>ArrayBuffer</code>.
es: Construye una solicitud de <code>OPTIONS</code> que interpreta el cuerpo como un <code>ArrayBuffer</code> y devuelve la respuesta como un <code>ArrayBuffer</code> .
ja: 構築 <code>OPTIONS</code> ように、その解釈に体を要求 <code>ArrayBuffer</code> 戻るよう応答 <code>ArrayBuffer</code> 。
ko: 본문을 <code>ArrayBuffer</code> 로 해석 하고 응답을 <code>ArrayBuffer</code> 로 반환 하는 <code>OPTIONS</code> 요청을 구성합니다 .
ru: Создает запрос <code>OPTIONS</code> , который интерпретирует тело как <code>ArrayBuffer</code> и возвращает ответ как <code>ArrayBuffer</code> .

source: Constructs an <code>OPTIONS</code> request that interprets the body as text stream and returns the full <code>HTTPResponse</code>.
es: Construye una solicitud <code>OPTIONS</code> que interpreta el cuerpo como secuencia de texto y devuelve la <code>HTTPResponse</code> completa .
ja: 構築物は、 <code>OPTIONS</code> は、テキストストリームとして解釈体と完全復帰要求 <code>HTTPResponse</code> はに。
ko: 본문을 텍스트 스트림으로 해석하고 전체 <code>HTTPResponse</code> 를 리턴 하는 <code>OPTIONS</code> 요청을 구성합니다 .
ru: Создает запрос <code>OPTIONS</code> , который интерпретирует тело как текстовый поток и возвращает полный <code>HTTPResponse</code> .
