Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/angular/angular.*.006.xlf
Languages: es, ja, ko, ru, zh_cn

source: Code snippet markup is not supported in JSON files because comments are forbidden in JSON files. See <a href="docs-style-guide#json-files">below</a> for details and workarounds.
es: El marcado de fragmentos de c&oacute;digo no es compatible con los archivos JSON porque los comentarios est&aacute;n prohibidos en los archivos JSON. Vea a <a href="docs-style-guide#json-files">continuaci&oacute;n los</a> detalles y soluciones alternativas.
ja: JSONファイルではコメントが禁止されているため、JSONファイルではコードスニペットマークアップはサポートされていません。参照してください<a href="docs-style-guide#json-files">以下の</a>詳細と回避策のために。
ko: 주석은 JSON 파일에서 금지되므로 JSON 코드에서는 코드 조각 마크 업이 지원되지 않습니다. 자세한 내용과 해결 방법 은 <a href="docs-style-guide#json-files">아래</a> 를 참조하십시오 .
ru: Разметка фрагмента кода не поддерживается в файлах JSON, так как комментарии в файлах JSON запрещены. Смотрите <a href="docs-style-guide#json-files">ниже</a> подробности и обходные пути.

source: Code snippets
es: Fragmentos de código
ja: コードスニペット
ko: 코드 스 니펫
ru: Отрывки кода

source: Code snippets and code samples
es: Fragmentos de código y muestras de código
ja: コードスニペットとコードサンプル
ko: 코드 스 니펫 및 코드 샘플
ru: Фрагменты кода и примеры кода

source: Code tabs display code much like <em>code examples</em> do. The added advantage is that they can display multiple code samples within a tabbed interface. Each tab is displayed using <em>code pane</em>.
es: Las pesta&ntilde;as de c&oacute;digo muestran el c&oacute;digo al igual <em>que los ejemplos de c&oacute;digo</em> . La ventaja adicional es que pueden mostrar m&uacute;ltiples muestras de c&oacute;digo dentro de una interfaz con pesta&ntilde;as. Cada pesta&ntilde;a se muestra usando el <em>panel de c&oacute;digo</em> .
ja: コードタブには、<em>コード例と</em>同じように<em>コードが</em>表示されます。追加の利点は、タブ付きインターフェイス内で複数のコードサンプルを表示できることです。各タブは、<em>コードペイン</em>を使用して表示されます。
ko: 코드 탭에는 코드 <em>예제</em> 와 매우 유사한 <em>코드가</em> 표시됩니다 . 추가 된 이점은 탭 인터페이스 내에서 여러 코드 샘플을 표시 할 수 있다는 것입니다. 각 탭은 <em>코드 창을</em> 사용하여 표시됩니다 .
ru: Вкладки кода отображают код так же, как <em>примеры кода</em> . Дополнительным преимуществом является то, что они могут отображать несколько примеров кода в интерфейсе с вкладками. Каждая вкладка отображается с использованием <em>панели кода</em> .

source: Code that defines how to render a component's <a href="glossary#view">view</a>.
ja: コンポーネントの<a href="glossary#view">ビュー</a>をレンダリングする方法を定義するコード。
ko: 구성 요소의 <a href="glossary#view">뷰</a> 를 렌더링하는 방법을 정의하는 코드입니다 .
ru: Код , который определяет , как для визуализации компоненты <a href="glossary#view">вида</a> .

source: Code that defines the transformation logic for a named schematic.
es: Código que define la lógica de transformación para un esquema nombrado.
ja: 名前付き回路図の変換ロジックを定義するコード。
ko: 명명 된 회로도의 변환 논리를 정의하는 코드입니다.
ru: Код,определяющий логику преобразования для именованной схемы.

source: Code-example attributes
es: Atributos del código de ejemplo
ja: コード例の属性
ko: 코드 예제 속성
ru: атрибуты кода-примера

source: Code-pane attributes
es: Atributos del panel de código
ja: コードペイン属性
ko: 코드 창 속성
ru: атрибуты кода

source: Code-tabs attributes
es: Atributos de los códigos
ja: コードタブ属性
ko: 코드 탭 속성
ru: Атрибуты кодовых закладок

source: Collection contents
es: Contenido de la colección
ja: コレクション内容
ko: 수집 내용
ru: Содержимое коллекции

source: CollectionChangeRecord has been removed from <code>@angular/core</code>.
ja: CollectionChangeRecordは <code>@angular/core</code> から削除されました。
ko: <code>@angular/core</code> 에서 CollectionChangeRecord가 제거되었습니다 .
ru: CollectionChangeRecord удален из <code>@angular/core</code> .

source: Combination of NgModuleFactory and ComponentFactorys.
es: Combinación de NgModuleFactory y ComponentFactorys.
ja: NgModuleFactoryとComponentFactorysの組み合わせ。
ko: NgModuleFactory와 ComponentFactory의 조합.
ru: Комбинация NgModuleFactory и ComponentFactorys.

source: Combining fragments
es: Combinando fragmentos
ja: フラグメントの組み合わせ
ko: 조각 결합
ru: Объединение фрагментов

source: Combining wildcard and void states
es: Combinando los estados de comodín y vacío
ja: ワイルドカード状態とボイド状態の組み合わせ
ko: 와일드 카드 및 빈 상태 결합
ru: Сочетание спецсимволов и пустых состояний

source: Command Overview
es: Resumen del comando
ja: コマンドの概要
ko: 명령 개요
ru: Обзор команд

source: Command syntax is shown as follows:
es: La sintaxis de los comandos se muestra como sigue:
ja: コマンドの構文を以下に示します。
ko: 명령 구문은 다음과 같습니다.
ru: Синтаксис команд показан следующим образом:

source: Commands that create or operate on apps and libraries (such as <code>add</code> and <code>generate</code>) must be executed from within a workspace folder.
es: Los comandos que crean u operan en aplicaciones y bibliotecas (como <code>add</code> y <code>generate</code> ) deben ejecutarse desde una carpeta de espacio de trabajo.
ja: アプリやライブラリを作成または操作するコマンド（ <code>add</code> や <code>generate</code> など）は、ワークスペースフォルダー内から実行する必要があります。
ko: 앱 및 라이브러리에서 작성하거나 작동하는 명령 (예 : <code>add</code> 및 <code>generate</code> )은 작업 공간 폴더에서 실행해야합니다.
ru: Команды, которые создают приложения или библиотеки или работают с ними (например, <code>add</code> и <code>generate</code> ), должны выполняться из папки рабочей области.

source: Commands to pass to <a href="router#createUrlTree">Router#createUrlTree</a>.
ja: <a href="router#createUrlTree">Router＃createUrlTree</a>に渡すコマンド。
ko: <a href="router#createUrlTree">Router # createUrlTree</a> 에 전달할 명령 입니다.
ru: Команды для передачи <a href="router#createUrlTree">маршрутизатору # createUrlTree</a> .

source: Commit your changes and push.
es: Comprométete con tus cambios y empuja.
ja: 変更をコミットしてプッシュします。
ko: 변경 사항을 적용하고 푸시하십시오.
ru: Сделайте ваши изменения и надавите.

source: Common form foundation classes
ja: 共通フォームの基礎クラス
ko: 일반적인 양식 기초 수업
ru: Фундаментальные классы общей формы

source: Common foundation
es: Cimiento común
ja: 共通基盤
ko: 공통 기초
ru: Общий фундамент

source: Common operators
es: Operadores comunes
ja: 一般的な演算子
ko: 일반적인 연산자
ru: Общие операторы

source: Communicating with backend services using HTTP
ja: HTTP を使用したバックエンドサービスとの通信
ko: HTTP를 사용하여 백엔드 서비스와 통신
ru: Взаимодействие со службами бэкэнда с помощью HTTP

source: Compare to <a href="glossary#aot">ahead-of-time (AOT) compilation</a>.
es: Compare con la <a href="glossary#aot">compilaci&oacute;n anticipada (AOT)</a> .
ja: <a href="glossary#aot">事前（AOT）コンパイルと</a>比較してください。
ko: <a href="glossary#aot">AOT (미리보기) 컴파일과</a> 비교하십시오 .
ru: Сравните с <a href="glossary#aot">опережающей (AOT) компиляцией</a> .

source: Compare to <a href="glossary#custom-element">custom element</a>.
es: Comparar con <a href="glossary#custom-element">elemento personalizado</a> .
ja: <a href="glossary#custom-element">カスタム要素と</a>比較してください。
ko: <a href="glossary#custom-element">사용자 정의 요소와</a> 비교하십시오 .
ru: Сравните с <a href="glossary#custom-element">пользовательским элементом</a> .

source: Compare to <a href="glossary#ngmodule">NgModule</a>.
es: Compare con <a href="glossary#ngmodule">NgModule</a> .
ja: <a href="glossary#ngmodule">NgModuleと</a>比較してください。
ko: <a href="glossary#ngmodule">NgModule과</a> 비교하십시오 .
ru: Сравните с <a href="glossary#ngmodule">NgModule</a> .

source: Compare using the form builder to creating the instances manually.
es: Compare el uso del constructor de formularios con la creación de las instancias manualmente.
ja: フォームビルダーを使用して手動でインスタンスを作成する場合と比較してみましょう。
ko: 양식 작성기를 사용하여 인스턴스를 수동으로 작성하는 것을 비교하십시오.
ru: Сравните использование конструктора форм с созданием экземпляров вручную.

source: Compare with the less preferred <code><a href="../api/core/directive#host">host</a></code> metadata alternative.
es: Compare con la alternativa de metadatos de <code><a href="../api/core/directive#host">host</a></code> menos preferida .
ja: 優先度の低い <code><a href="../api/core/directive#host">host</a></code> メタデータの代替と比較してください。
ko: 덜 선호되는 <code><a href="../api/core/directive#host">host</a></code> 메타 데이터 대안 과 비교하십시오 .
ru: Сравните с менее предпочтительной альтернативой метаданных <code><a href="../api/core/directive#host">host</a></code> .

source: Compare with the less preferred <code>host</code> metadata alternative.
ja: あまり好ましくない <code>host</code> メタデータの代替案と比較してください。
ko: 덜 선호되는 <code>host</code> 메타 데이터 대안 과 비교하십시오 .
ru: Сравните с менее предпочтительной альтернативой метаданных <code>host</code> .

source: Comparing dates inside fakeAsync()
es: Comparando las fechas dentro de fakeAsync()
ja: fakeAsync()内での日付の比較
ko: fakeAsync () 내부의 날짜 비교
ru: Сравнение дат внутри поддельнойAsync()

source: Compatibility note: The primary goal of the backward compatibility promise is to ensure that changes in the core framework and tooling don't break the existing ecosystem of components and applications and don't put undue upgrade/migration burden on Angular application and component authors.
es: Nota de compatibilidad:El objetivo principal de la promesa de compatibilidad retroactiva es asegurar que los cambios en el marco básico y en las herramientas no rompan el ecosistema existente de componentes y aplicaciones y no supongan una carga excesiva de actualización/migración para los autores de las aplicaciones y componentes Angular.
ja: 互換性に関する注意:後方互換性の約束の第一の目的は、コアフレームワークやツールの変更がコンポーネントやアプリケーションの既存のエコシステムを壊さず、Angularアプリケーションやコンポーネントの作者に過度なアップグレードや移行の負担をかけないようにすることです。
ko: 호환성 참고 사항 : 이전 버전과의 호환성 약속의 주요 목표는 핵심 프레임 워크 및 툴링의 변경으로 인해 기존 구성 요소 및 응용 프로그램 에코 시스템이 손상되지 않으며 Angular 응용 프로그램 및 구성 요소 작성자에게 과도한 업그레이드 / 마이그레이션 부담이 발생하지 않도록하는 것입니다.
ru: Примечание по совместимости:Основной целью обещания обратной совместимости является обеспечение того,чтобы изменения в основном фреймворке и инструментах не нарушили существующую экосистему компонентов и приложений и не наложили чрезмерную нагрузку по обновлению/перемещению на разработчиков угловых приложений и компонентов.

source: Compilation phases
es: Fases de compilación
ja: コンパイルフェーズ
ko: 컴파일 단계
ru: Этапы компиляции

source: Compile components with a <code>templateUrl</code> for the test's NgModule. It is necessary to call this function as fetching urls is asynchronous.
es: Compile componentes con <code>templateUrl</code> para el NgModule de la prueba. Es necesario llamar a esta funci&oacute;n ya que buscar URL es as&iacute;ncrono.
ja: テストのNgModuleの <code>templateUrl</code> を使用してコンポーネントをコンパイルします。URLのフェッチは非同期であるため、この関数を呼び出す必要があります。
ko: 테스트의 NgModule에 대한 <code>templateUrl</code> 을 사용하여 컴포넌트를 컴파일 하십시오. URL 가져 오기가 비동기이므로이 함수를 호출해야합니다.
ru: Компилируйте компоненты с помощью <code>templateUrl</code> для теста NgModule. Эту функцию необходимо вызывать, поскольку выборка URL-адресов выполняется асинхронно.

source: Compile the testing module asynchronously after you've finished configuring it. You <strong>must</strong> call this method if <em>any</em> of the testing module components have a <code>templateUrl</code> or <code><a href="../api/core/component#styleUrls">styleUrls</a></code> because fetching component template and style files is necessarily asynchronous. See <a href="testing#compile-components">above</a>.
es: Compile el m&oacute;dulo de prueba de forma as&iacute;ncrona una vez que haya terminado de configurarlo. Usted <strong>debe</strong> llamar a este m&eacute;todo si <em>cualquiera</em> de los componentes del m&oacute;dulo de prueba tienen una <code>templateUrl</code> o <code><a href="../api/core/component#styleUrls">styleUrls</a></code> porque ir a buscar los archivos de plantilla y el estilo de componentes es necesariamente as&iacute;ncrona. Ver <a href="testing#compile-components">m&aacute;s arriba</a> .
ja: 構成が完了したら、テストモジュールを非同期でコンパイルします。あなたは<strong>しなければならない</strong>場合は、このメソッドを呼び出す<em>任意の</em>テストモジュールコンポーネントのが持っている <code>templateUrl</code> または <code><a href="../api/core/component#styleUrls">styleUrls</a></code> をコンポーネントテンプレートとスタイルファイルを取得することは、必ずしも非同期であるため。<a href="testing#compile-components">上記を</a>参照してください。
ko: 테스트 모듈 구성을 마친 후에 테스트 모듈을 비동기 적으로 컴파일하십시오. 당신은 <strong>있어야합니다</strong> 경우이 메소드를 호출 <em>모든</em> 테스트 모듈의 구성 요소는이 <code>templateUrl</code> 또는 <code><a href="../api/core/component#styleUrls">styleUrls</a></code> 을 구성 요소 템플릿과 스타일 파일을 가져 오는 것은 반드시 비동기이기 때문이다. <a href="testing#compile-components">위를</a> 참조하십시오 .
ru: Скомпилируйте модуль тестирования асинхронно после того, как вы закончили его настройку. Вы <strong>должны</strong> вызвать этот метод , если <em>какие - либо</em> из компонентов тестирования модуля имеет <code>templateUrl</code> или <code><a href="../api/core/component#styleUrls">styleUrls</a></code> , поскольку извлечение компонентов шаблон и стиль файлов обязательно асинхронное. Смотри <a href="testing#compile-components">выше</a> .

source: Compile the testing module asynchronously after you've finished configuring it. You <strong>must</strong> call this method if <em>any</em> of the testing module components have a <code>templateUrl</code> or <code>styleUrls</code> because fetching component template and style files is necessarily asynchronous. See <a href="testing-components-scenarios#compile-components">above</a>.
ja: 構成が完了したら、テストモジュールを非同期でコンパイルします。あなたは<strong>しなければならない</strong>場合は、このメソッドを呼び出す<em>任意の</em>テストモジュールコンポーネントのが持っている <code>templateUrl</code> または <code>styleUrls</code> をコンポーネントテンプレートとスタイルファイルを取得することは、必ずしも非同期であるため。<a href="testing-components-scenarios#compile-components">上記を</a>参照してください。
ko: 구성을 마친 후 테스트 모듈을 비동기 적으로 컴파일합니다. 당신은 <strong>있어야합니다</strong> 경우이 메소드를 호출 <em>모든</em> 테스트 모듈의 구성 요소는이 <code>templateUrl</code> 또는 <code>styleUrls</code> 을 구성 요소 템플릿과 스타일 파일을 가져 오는 것은 반드시 비동기이기 때문이다. <a href="testing-components-scenarios#compile-components">위를</a> 참조하십시오 .
ru: После завершения настройки скомпилируйте тестовый модуль асинхронно. Вы <strong>должны</strong> вызвать этот метод, если <em>какой-либо</em> из компонентов <code>styleUrls</code> модуля имеет <code>templateUrl</code> или styleUrls, потому что выборка шаблонов компонентов и файлов стилей обязательно асинхронна. См. <a href="testing-components-scenarios#compile-components">Выше</a> .

source: Compiles an Angular app into an output directory named dist/ at the given output path. Must be executed from within a workspace directory.
es: Compila una aplicación Angular en un directorio de salida llamado dist/en la ruta de salida dada.Debe ser ejecutada desde un directorio del espacio de trabajo.
ja: Angularアプリを指定された出力パスのdist/という名前の出力ディレクトリにコンパイルします。ワークスペースディレクトリ内から実行する必要があります。
ko: 주어진 출력 경로에서 Angular 앱을 dist /라는 출력 디렉토리로 컴파일합니다. 작업 공간 디렉토리 내에서 실행해야합니다.
ru: Компилирует приложение Angular в выходной каталог с именем dist/по заданному выходному пути.Должно выполняться из директории рабочей области.

source: Compiles the application with the <a href="glossary#jit">JIT compiler</a> and <a href="bootstrapping">bootstraps</a> the application's main module (<code>AppModule</code>) to run in the browser. The JIT compiler is a reasonable choice during the development of most projects and it's the only viable choice for a sample running in a <em>live-coding</em> environment such as Stackblitz. Alternative <a href="aot-compiler">compilation</a>, <a href="build">build</a>, and <a href="deployment">deployment</a> options are available.
es: Compila la aplicaci&oacute;n con el <a href="glossary#jit">compilador JIT</a> y <a href="bootstrapping">sin ayuda de nadie</a> m&oacute;dulo principal de la aplicaci&oacute;n ( <code>AppModule</code> ) para ejecutar en el navegador. El compilador JIT es una opci&oacute;n razonable durante el desarrollo de la mayor&iacute;a de los proyectos y es la &uacute;nica opci&oacute;n viable para una muestra que se ejecuta en un entorno de <em>codificaci&oacute;n</em> en <em>vivo</em> como Stackblitz. Hay opciones alternativas de <a href="aot-compiler">compilaci&oacute;n</a> , <a href="build">compilaci&oacute;n</a> e <a href="deployment">implementaci&oacute;n</a> disponibles.
ja: 使用してアプリケーションをコンパイルし<a href="glossary#jit">JITコンパイラ</a>および<a href="bootstrapping">ブートストラップ</a>アプリケーションのメインモジュール（ <code>AppModule</code> ブラウザで実行するために）。JITコンパイラーは、ほとんどのプロジェクトの開発中に妥当な選択であり、Stackblitzなどの<em>ライブコーディング</em>環境で実行されているサンプルの唯一の実行可能な選択です。代替の<a href="aot-compiler">コンパイル</a>、<a href="build">ビルド</a>、および<a href="deployment">配置</a>オプションが利用可能です。
ko: 와 응용 프로그램 컴파일 <a href="glossary#jit">JIT 컴파일러</a> 및 <a href="bootstrapping">부트 스트랩</a> 응용 프로그램의 주 모듈 ( <code>AppModule</code> 는 ) 브라우저에서 실행할 수 있습니다. JIT 컴파일러는 대부분의 프로젝트를 개발하는 동안 합리적인 선택이며 Stackblitz와 같은 <em>라이브 코딩</em> 환경 에서 실행되는 샘플에 유일하게 실행 가능한 선택입니다 . 대체 <a href="aot-compiler">컴파일</a> , <a href="build">빌드</a> 및 <a href="deployment">배포</a> 옵션을 사용할 수 있습니다.
ru: Компилирует приложение с помощью <a href="glossary#jit">JIT-компилятора</a> и <a href="bootstrapping">загружает</a> основной модуль приложения ( <code>AppModule</code> ) для запуска в браузере. JIT-компилятор является разумным выбором при разработке большинства проектов и является единственным жизнеспособным выбором для образца, работающего в среде <em>живого программирования,</em> такой как Stackblitz. Доступны альтернативные варианты <a href="aot-compiler">компиляции</a> , <a href="build">сборки</a> и <a href="deployment">развертывания</a> .

source: Compiles the given NgModule and all of its components
es: Compila el módulo NgModule dado y todos sus componentes
ja: 与えられたNgModuleとそのすべてのコンポーネントをコンパイルします。
ko: 주어진 NgModule과 모든 컴포넌트를 컴파일
ru: Собирает данный NgModule и все его компоненты.

source: Compiles the given NgModule and all of its components. All templates of the components listed in <code>entryComponents</code> have to be inlined.
es: Compila el NgModule dado y todos sus componentes. Todas las plantillas de los componentes enumerados en <code>entryComponents</code> deben estar en l&iacute;nea.
ja: 指定されたNgModuleとそのすべてのコンポーネントをコンパイルします。 <code>entryComponents</code> にリストされているコンポーネントのすべてのテンプレートをインライン化する必要があります。
ko: 주어진 NgModule과 모든 구성 요소를 컴파일합니다. <code>entryComponents</code> 에 나열된 구성 요소의 모든 템플릿은 인라인되어야합니다.
ru: Компилирует данный NgModule и все его компоненты. Все шаблоны компонентов, перечисленных в <code>entryComponents</code> , должны быть встроены.

source: Completed Tour of Heroes example application. For more information, see <a href="tutorial">Tour of Heroes app and tutorial</a>.
ja: Tour ofHeroesサンプルアプリケーションを完了しました。詳細については、<a href="tutorial">Tour ofHeroesアプリとチュートリアルを</a>参照してください。
ko: Tour of Heroes 예제 애플리케이션을 완료했습니다. 자세한 내용은 <a href="tutorial">Tour of Heroes 앱 및 자습서를</a> 참조하십시오 .
ru: Завершенный пример приложения Tour of Heroes. Для получения дополнительной информации см. <a href="tutorial">Приложение и руководство Tour of Heroes</a> .

source: Completions lists
es: Listas de terminación
ja: 完成品リスト
ko: 완료 목록
ru: Списки завершения

source: Complex animation Sequences
es: Secuencias de animación complejas
ja: 複雑なアニメーションのシーケンス
ko: 복잡한 애니메이션 시퀀스
ru: Сложные анимационные последовательности

source: Complex animation sequences
es: Secuencias complejas de animación
ja: 複雑なアニメーションシーケンス
ko: 복잡한 애니메이션 시퀀스
ru: Сложные анимационные последовательности

source: Complex animations can have many things happening at once. But what if you want to create an animation involving several animations happening one after the other? Earlier we used <a href="../api/animations/group"><code>group()</code></a> to run multiple animations all at the same time, in parallel.
es: Las animaciones complejas pueden tener muchas cosas sucediendo a la vez. Pero, &iquest;qu&eacute; sucede si desea crear una animaci&oacute;n que involucre varias animaciones que sucedan una tras otra? Anteriormente utilizamos <a href="../api/animations/group"> <code>group()</code> </a> para ejecutar m&uacute;ltiples animaciones, todo al mismo tiempo, en paralelo.
ja: 複雑なアニメーションでは、一度に多くのことが発生する可能性があります。しかし、次々に発生するいくつかのアニメーションを含むアニメーションを作成したい場合はどうでしょうか？以前は、<a href="../api/animations/group"> <code>group()</code> </a>を使用して、同時に複数のアニメーションを同時に実行していました。
ko: 복잡한 애니메이션은 한 번에 많은 일이 일어날 수 있습니다. 그러나 여러 애니메이션이 차례로 발생하는 애니메이션을 만들려면 어떻게해야합니까? 이전에는 <a href="../api/animations/group"> <code>group()</code> </a> 을 사용 하여 동시에 여러 애니메이션을 동시에 실행했습니다.
ru: Сложные анимации могут иметь много вещей, происходящих одновременно. Но что, если вы хотите создать анимацию, включающую несколько анимаций, происходящих одна за другой? Ранее мы использовали <a href="../api/animations/group"> <code>group()</code> </a> для одновременного запуска нескольких анимаций.

source: Complex configuration values
es: Valores de configuración complejos
ja: 複雑な構成値
ko: 복잡한 구성 값
ru: Сложные значения конфигурации

source: Component (B) is the parent of another component (C) that defines its own, even <em>more specialized</em> provider for <code>CarService</code>.
es: El componente (B) es el padre de otro componente (C) que define su propio proveedor , a&uacute;n <em>m&aacute;s especializado</em> , para <code>CarService</code> .
ja: コンポーネント（B）は別のコンポーネント（C）の親であり、 <code>CarService</code> の独自の、<em>さらに特化した</em>プロバイダーを定義します。
ko: 컴포넌트 (B)는 <code>CarService</code> 에 대한 <em>보다 전문화 된</em> 자체 제공자를 정의하는 다른 컴포넌트 (C)의 상위입니다 .
ru: Компонент (B) является родителем другого компонента (C), который определяет своего собственного, даже <em>более специализированного</em> поставщика для <code>CarService</code> .

source: Component DOM testing
es: Prueba de DOM de componentes
ja: コンポーネント DOM テスト
ko: 컴포넌트 DOM 테스트
ru: Тестирование компонентов DOM

source: Component Interaction
es: Interacción de los componentes
ja: コンポーネントの相互作用
ko: 구성 요소 상호 작용
ru: Взаимодействие компонентов

source: Component Styles
es: Estilos de componentes
ja: コンポーネントスタイル
ko: 구성 요소 스타일
ru: Стили компонентов

source: Component Test Basics
es: Fundamentos de la prueba de componentes
ja: コンポーネントテストの基本
ko: 구성 요소 테스트 기본 사항
ru: Основы тестирования компонентов

source: Component Test Scenarios
es: Escenarios de pruebas de componentes
ja: コンポーネントテストシナリオ
ko: 구성 요소 테스트 시나리오
ru: Сценарии тестирования компонентов

source: Component binding
es: La unión de los componentes
ja: コンポーネントバインディング
ko: 컴포넌트 바인딩
ru: Связывание компонентов

source: Component class
es: Clase de componente
ja: コンポーネントクラス
ko: 컴포넌트 클래스
ru: Класс компонента

source: Component class testing
es: Prueba de clase de componentes
ja: コンポーネントクラスのテスト
ko: 컴포넌트 클래스 테스트
ru: Проверка класса компонентов

source: Component class testing should be kept very clean and simple. It should test only a single unit. At first glance, you should be able to understand what the test is testing.
ja: コンポーネントクラスのテストは、非常にクリーンでシンプルに保たれるべきです。それは単一のユニットのみをテストするべきです。一見すると、テストが何をテストしているのか理解できるはずです。
ko: 구성 요소 클래스 테스트는 매우 깨끗하고 간단해야합니다. 단일 단위 만 테스트해야합니다. 언뜻보기에 테스트가 무엇을 테스트하는지 이해할 수 있어야합니다.
ru: Тестирование класса компонентов должно быть очень чистым и простым.Тестирование должно проводиться только с одной единицей.На первый взгляд,вы должны понимать,что такое тест.

source: Component configuration
es: Configuración de los componentes
ja: コンポーネント構成
ko: 구성 요소 구성
ru: Конфигурация компонентов

source: Component custom prefix
es: Prefijo personalizado del componente
ja: コンポーネントのカスタムプレフィックス
ko: 구성 요소 사용자 정의 접두사
ru: Пользовательский префикс компонента

source: Component decorator
es: Decorador de componentes
ja: コンポーネントデコレータ
ko: 구성 요소 데코레이터
ru: Декоратор компонентов

source: Component directives <strong>should not</strong> use the following attributes:
es: Las directivas de componentes <strong>no deben</strong> usar los siguientes atributos:
ja: コンポーネントディレクティブ<strong>では</strong>、次の属性を使用し<strong>ないでください</strong>。
ko: 구성 요소 지시문 <strong>은</strong> 다음 속성을 사용 <strong>하지 않아야</strong> 합니다.
ru: Директивы компонентов <strong>не должны</strong> использовать следующие атрибуты:

source: Component directives may also use the following attributes:
es: Las directivas de los componentes también pueden utilizar los siguientes atributos:
ja: コンポーネントディレクティブは、以下の属性を使用することもできます。
ko: 구성 요소 지시문은 다음 속성도 사용할 수 있습니다.
ru: Директивы по компонентам могут также использовать следующие атрибуты:

source: Component inside a test host
es: Componente dentro de un huésped de prueba
ja: テストホスト内のコンポーネント
ko: 테스트 호스트 내부의 구성 요소
ru: Компонент внутри тестового хоста

source: Component interaction
ja: コンポーネントの相互作用
ko: 구성 요소 상호 작용
ru: Взаимодействие компонентов
