Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/angular/angular.*.006.xlf
Languages: es, ja, ko, ru, zh_cn

source: Check out this full animation <a href="http://animationsftw.in/#/">demo</a> with accompanying <a href="https://www.youtube.com/watch?v=JhNo3Wvj6UQ&amp;feature=youtu.be&amp;t=2h47m53s">presentation</a>, shown at the AngularConnect conference in November 2017.
es: Echa un vistazo a esta <a href="http://animationsftw.in/#/">demostraci&oacute;n de</a> animaci&oacute;n completa con la <a href="https://www.youtube.com/watch?v=JhNo3Wvj6UQ&amp;feature=youtu.be&amp;t=2h47m53s">presentaci&oacute;n</a> adjunta , que se muestra en la conferencia AngularConnect en noviembre de 2017.
ja: 2017年11月に開催されるAngularConnectカンファレンスで<a href="https://www.youtube.com/watch?v=JhNo3Wvj6UQ&amp;feature=youtu.be&amp;t=2h47m53s">発表</a>された、このアニメーションの<a href="http://animationsftw.in/#/">デモ</a>全体と付随するプレゼンテーションをご覧ください。
ko: 2017 년 11 월 AngularConnect 컨퍼런스에서 <a href="https://www.youtube.com/watch?v=JhNo3Wvj6UQ&amp;feature=youtu.be&amp;t=2h47m53s">발표</a> 된 프레젠테이션 과 함께이 전체 애니메이션 <a href="http://animationsftw.in/#/">데모</a> 를 확인하십시오 .
ru: Ознакомьтесь с полной <a href="http://animationsftw.in/#/">демонстрацией</a> анимации с сопровождающей <a href="https://www.youtube.com/watch?v=JhNo3Wvj6UQ&amp;feature=youtu.be&amp;t=2h47m53s">презентацией</a> , показанной на конференции AngularConnect в ноябре 2017 года.

source: Check self and check parent injector if needed
es: Revise a sí mismo y revise el inyector de los padres si es necesario.
ja: 自己点検を行い、必要に応じて親インジェクターを点検します。
ko: 자가 점검 및 필요한 경우 부모 인젝터 점검
ru: Проверьте себя и при необходимости проверьте родительский инжектор

source: Check that imported libraries have been marked side-effect-free. If your app imports from shared libraries that are meant to be free from side effects, add "sideEffects": false to their <code>package.json</code>. This will ensure that the libraries will be properly tree-shaken if they are imported but not directly referenced. See more details in the original issue <a href="https://github.com/angular/angular-cli/issues/16799#issuecomment-580912090">here</a>.
ja: インポートされたライブラリが副作用なしとしてマークされていることを確認します。アプリが副作用のないことを目的とした共有ライブラリからインポートする場合は、 <code>package.json</code> に「sideEffects」：falseを追加します。これにより、ライブラリがインポートされたが直接参照されていない場合に、ライブラリが適切にツリーシェイクされます。詳細については、元の号の<a href="https://github.com/angular/angular-cli/issues/16799#issuecomment-580912090">こちらをご覧ください</a>。
ko: 가져온 라이브러리가 부작용이없는 것으로 표시되었는지 확인하십시오. 앱이 부작용이없는 공유 라이브러리에서 가져 오는 경우 <code>package.json</code> 에 "sideEffects": false를 추가하십시오 . 이렇게하면 라이브러리를 가져 왔지만 직접 참조하지 않는 경우 라이브러리가 제대로 트리 셰이 킹됩니다. <a href="https://github.com/angular/angular-cli/issues/16799#issuecomment-580912090">여기</a> 에서 원본 호에 대한 자세한 내용을 참조 하십시오 .
ru: Убедитесь, что импортированные библиотеки отмечены как свободные от побочных эффектов. Если ваше приложение импортирует из общих библиотек, которые не должны иметь побочных эффектов, добавьте &laquo;sideEffects&raquo;: false в их <code>package.json</code> . Это гарантирует, что библиотеки будут правильно встряхивать дерево, если они импортированы, но на них нет прямых ссылок. Подробнее читайте в исходном выпуске <a href="https://github.com/angular/angular-cli/issues/16799#issuecomment-580912090">здесь</a> .

source: Check the <strong>Offline box</strong>.
es: Marque la <strong>casilla Fuera de l&iacute;nea</strong> .
ja: [ <strong>オフライン]</strong>チェック<strong>ボックスを</strong>オンにし<strong>ます</strong>。
ko: 체크 <strong>오프라인 상자를</strong> .
ru: Установите <strong>флажок Оффлайн</strong> .

source: Check whether the new value is the first value assigned.
es: Comprueba si el nuevo valor es el primer valor asignado.
ja: 新しい値が最初に割り当てられた値であるかどうかを確認します。
ko: 새 값이 할당 된 첫 번째 값인지 확인하십시오.
ru: Проверьте,является ли новое значение первым назначенным значением.

source: Check whether there is an enabled control with the given name in the group.
es: Comprueba si hay un control habilitado con el nombre dado en el grupo.
ja: グループ内に指定された名前で有効なコントロールがあるかどうかを確認します。
ko: 그룹에 주어진 이름으로 사용 가능한 제어가 있는지 확인하십시오.
ru: Проверьте,есть ли в группе включенный элемент управления с заданным именем.

source: Check whether users can access a route.
ja: ユーザーがルートにアクセスできるかどうかを確認します。
ko: 사용자가 경로에 액세스 할 수 있는지 확인하십시오.
ru: Проверьте,могут ли пользователи получить доступ к маршруту.

source: Checking for updates
es: Buscando actualizaciones
ja: 更新をチェックする
ko: 업데이트 확인
ru: Проверка обновлений

source: Checking of <code>*<a href="../api/common/ngforof">ngFor</a></code>
ja: <code>*<a href="../api/common/ngforof">ngFor</a></code> <a href="../api/common/ngforof">ngForの</a>チェック
ko: <code>*<a href="../api/common/ngforof">ngFor</a></code> <a href="../api/common/ngforof">ngFor</a> 확인
ru: Проверка <code>*<a href="../api/common/ngforof">ngFor</a></code>

source: Checking your version of Angular
es: Comprobando su versión de Angular
ja: Angularのバージョンを確認する
ko: Angular 버전 확인
ru: Проверяя вашу версию Angular

source: Checks for existence of a given header.
es: Comprueba la existencia de un determinado encabezamiento.
ja: 指定されたヘッダが存在するかどうかをチェックします。
ko: 주어진 헤더가 있는지 확인합니다.
ru: Проверяет на существование данного заголовка.

source: Checks that there currently is a platform which contains the given token as a provider.
es: Comprueba que actualmente existe una plataforma que contiene el testigo dado como proveedor.
ja: 指定されたトークンをプロバイダとして含むプラットフォームが現在存在するかどうかをチェックします。
ko: 제공된 토큰을 공급자로 포함하는 플랫폼이 현재 있는지 확인합니다.
ru: Проверяет,что в настоящее время существует платформа,которая содержит данный токен в качестве провайдера.

source: Checks that there is currently a platform that contains the given token as a provider.
ja: 指定されたトークンをプロバイダとして含むプラットフォームが現在存在するかどうかをチェックします。
ko: 현재 제공된 토큰을 공급자로 포함하는 플랫폼이 있는지 확인합니다.
ru: Проверяет,что в настоящее время существует платформа,которая содержит данный токен в качестве провайдера.

source: Checks the change detector and its children, and throws if any changes are detected.
es: Comprueba el detector de cambios y sus hijos,y tira si se detecta algún cambio.
ja: 変更検出器とその子プロセスをチェックし、変更が検出された場合はスローします。
ko: 변경 감지기와 해당 하위를 확인하고 변경이 감지되면 발생합니다.
ru: Проверяет детектор изменений и его детей и бросает при обнаружении изменений.

source: Checks this view and its children. Use in combination with <a href="changedetectorref#detach">detach</a> to implement local change detection checks.
es: Comprueba esta vista y sus elementos secundarios. &Uacute;selo en combinaci&oacute;n con <a href="changedetectorref#detach">separar</a> para implementar comprobaciones de detecci&oacute;n de cambio local.
ja: このビューとその子をチェックします。<a href="changedetectorref#detach">detach</a>と組み合わせて使用​​して、ローカル変更検出チェックを実装します。
ko: 이 뷰와 그 아이를 확인합니다. 로컬 변경 감지 점검을 구현하려면 <a href="changedetectorref#detach">detach</a> 와 함께 사용하십시오 .
ru: Проверяет эту точку зрения и ее детей. Используйте в сочетании с <a href="changedetectorref#detach">отсоединением</a> для осуществления локальных проверок обнаружения изменений.

source: Checks whether the two strings are equal
es: Comprueba si las dos cuerdas son iguales
ja: 2 つの文字列が等しいかどうかをチェックします。
ko: 두 문자열이 같은지 확인
ru: Проверяет,равны ли эти две струны

source: Child <code>ModuleInjector</code>s are created when lazy loading other <code>@NgModules</code>.
es: Los <code>ModuleInjector</code> se crean cuando la carga diferida de otros <code>@NgModules</code> .
ja: 子 <code>ModuleInjector</code> は、他の <code>@NgModules</code> 遅延ロードするときに作成されます。
ko: 자식 <code>ModuleInjector</code> 는 다른 <code>@NgModules</code> 를 게으르게로드 할 때 생성됩니다 .
ru: Дочерние <code>ModuleInjector</code> создаются при <code>@NgModules</code> загрузке других @NgModules .

source: Child interfaces
es: Interfaces de niños
ja: 子インターフェース
ko: 자식 인터페이스
ru: Детские интерфейсы

source: Child modules and component injectors are independent of each other, and create their own separate instances of the provided services. When Angular destroys an NgModule or component instance, it also destroys that injector and that injector's service instances.
es: Los módulos infantiles y los inyectores de componentes son independientes entre sí y crean sus propias instancias separadas de los servicios prestados.Cuando Angular destruye un NgModulo o instancia de componente,también destruye ese inyector y las instancias de servicio de ese inyector.
ja: 子モジュールとコンポーネントインジェクターは互いに独立しており、提供されるサービスのインスタンスを独自に作成します。AngularがNgModuleやコンポーネントのインスタンスを破棄すると、そのインジェクタとそのインジェクタのサービスインスタンスも破棄されます。
ko: 하위 모듈과 구성 요소 인젝터는 서로 독립적이며 제공된 서비스의 자체 인스턴스를 만듭니다. Angular는 NgModule 또는 구성 요소 인스턴스를 파괴하면 해당 인젝터와 해당 인젝터의 서비스 인스턴스도 파괴합니다.
ru: Детские модули и компонентные инъекторы независимы друг от друга и создают свои собственные отдельные экземпляры предоставляемых услуг.Когда Angular уничтожает экземпляр NgModule или компонента,он также уничтожает этот инжектор и экземпляры обслуживания этого инжектора.

source: Child route configuration
es: Configuración de la ruta del niño
ja: 子ルートの設定
ko: 자식 경로 구성
ru: Детская конфигурация маршрута

source: Child routes (the <em>Crisis Center</em> has its own routes).
es: Rutas para ni&ntilde;os (el <em>Centro de crisis</em> tiene sus propias rutas).
ja: 子ルート（<em>危機センターに</em>は独自のルートがあります）。
ko: 어린이 경로 ( <em>Crisis Center</em> 에는 자체 경로가 있음).
ru: Детские маршруты (у <em>Кризисного центра</em> есть свои маршруты).

source: Child routing component
es: Componente de enrutamiento de niños
ja: 子ルーティングコンポーネント
ko: 하위 라우팅 구성 요소
ru: Детский компонент маршрутизации

source: Chinese Simplified
es: Chino simplificado
ja: 簡体字
ko: 중국어 (간체
ru: китайский упрощённый

source: Chinese Traditional
es: Tradicional chino
ja: 中国の伝統的な
ko: 중국 전통
ru: китайская традиция

source: Chinese Traditional Hong Kong
es: Hong Kong tradicional chino
ja: 中国の伝統的な香港
ko: 중국 전통 홍콩
ru: традиционный китайский Гонконг

source: Choose a CSS selector for the component.
ja: コンポーネントのCSSセレクタを選択します。
ko: 구성 요소에 대한 CSS 선택기를 선택합니다.
ru: Выберите селектор CSS для компонента.

source: Choose one pattern or the other and follow that pattern consistently.
es: Elija un patrón o el otro y siga ese patrón de manera consistente.
ja: どちらかのパターンを選択して、そのパターンに一貫して従ってください。
ko: 하나의 패턴을 선택하고 다른 패턴을 일관되게 따르십시오.
ru: Выберите один или другой образец и следуйте ему последовательно.

source: Choosing a compiler
es: Eligiendo un compilador
ja: コンパイラの選択
ko: 컴파일러 선택
ru: Выбор компилятора

source: Choosing a routing strategy
ja: ルーティング戦略の選択
ko: 라우팅 전략 선택
ru: Выбор стратегии маршрутизации

source: Choosing a strategy begins with understanding the strengths and weaknesses of the options presented. Low-level API and form model access, predictability, mutability, straightforward validation and testing strategies, and scalability are all important considerations in choosing the infrastructure you use to build your forms in Angular. Template-driven forms are similar to patterns in AngularJS, but they have limitations given the criteria of many modern, large-scale Angular apps. Reactive forms minimize these limitations. Reactive forms integrate with reactive patterns already present in other areas of the Angular architecture, and complement those requirements well.
es: La elección de una estrategia comienza con la comprensión de los puntos fuertes y débiles de las opciones presentadas.El bajo nivel de acceso a la API y al modelo de formulario,la previsibilidad,la mutabilidad,la validación directa y las estrategias de prueba,y la escalabilidad son consideraciones importantes para elegir la infraestructura que se utiliza para construir los formularios en Angular.Los formularios basados en plantillas son similares a los patrones en AngularJS,pero tienen limitaciones dados los criterios de muchas aplicaciones Angular modernas y de gran escala.Las formas reactivas minimizan estas limitaciones.Las formas reactivas se integran con los patrones reactivos ya presentes en otras áreas de la arquitectura de Angular,y complementan bien esos requerimientos.
ja: 戦略の選択は、提示されたオプションの長所と短所を理解することから始まります。低レベルのAPIやフォームモデルへのアクセス、予測可能性、変異性、簡単な検証とテスト戦略、スケーラビリティは、Angularでフォームを構築するために使用するインフラストラクチャを選択する際に重要な考慮事項です。テンプレート駆動型のフォームはAngularJSのパターンに似ていますが、多くの大規模な最新のAngularアプリの基準を考えると限界があります。リアクティブフォームはこれらの制限を最小限に抑えます。リアクティブなフォームはAngularアーキテクチャの他の領域にすでに存在するリアクティブなパターンと統合し、それらの要件をうまく補完します。
ko: 전략 선택은 제시된 옵션의 강점과 약점을 이해하는 것으로 시작합니다. 낮은 수준의 API 및 양식 모델 액세스, 예측 가능성, 변경 가능성, 간단한 유효성 검사 및 테스트 전략 및 확장 성은 모두 Angular에서 양식을 작성하는 데 사용하는 인프라를 선택할 때 고려해야 할 중요한 사항입니다. 템플릿 기반 양식은 AngularJS의 패턴과 유사하지만 많은 현대적인 대규모 Angular 앱의 기준에 따라 제한이 있습니다. 반응성 양식은 이러한 제한을 최소화합니다. 반응성 양식은 Angular 아키텍처의 다른 영역에 이미 존재하는 반응성 패턴과 통합되며 이러한 요구 사항을 잘 보완합니다.
ru: Выбор стратегии начинается с понимания сильных и слабых сторон представленных вариантов.Низкоуровневый API и доступ к моделям форм,предсказуемость,изменчивость,простая проверка и тестирование стратегий,а также масштабируемость-все это важные соображения при выборе инфраструктуры,которую вы используете для построения форм в программе Angular.Формы на основе шаблонов похожи на шаблоны в AngularJS,но они имеют ограничения,обусловленные критериями многих современных крупномасштабных приложений Angular.Реактивные формы минимизируют эти ограничения.Реактивные формы интегрируются с реактивными шаблонами,уже присутствующими в других областях Угловой архитектуры,и хорошо дополняют эти требования.

source: Choosing an approach
ja: アプローチの選択
ko: 접근 방식 선택
ru: Выбор подхода

source: Chrome, Firefox, Edge, Safari, Android, IE 10+
ko: 크롬, 파이어 폭스, 엣지, 사파리, 안드로이드, IE 10+
ru: Хром,Файрфокс,Эдж,Сафари,Андроид,IE 10+

source: Chrome, Firefox, Edge, Safari, Android, IE 11
ru: Хром,Файрфокс,Эдж,Сафари,Андроид,IE 11.

source: Class binding
es: La clase vinculante...
ja: クラスバインディング
ko: 클래스 바인딩
ru: Классный переплет

source: Class binding syntax resembles property binding, but instead of an element property between brackets, start with the prefix <code>class</code>, optionally followed by a dot (<code>.</code>) and the name of a CSS class: <code>[class.class-name]</code>.
es: La sintaxis de enlace de clase se asemeja al enlace de propiedad, pero en lugar de una propiedad de elemento entre par&eacute;ntesis, comience con la <code>class</code> prefijo , opcionalmente seguida por un punto ( <code>.</code> ) Y el nombre de una clase CSS: <code>[class.class-name]</code> .
ja: クラスバインディング構文はプロパティバインディングに似ていますが、大括弧で囲まれた要素プロパティの代わりに、接頭辞 <code>class</code> で始まり、オプションでドット（ <code>.</code> ）とCSSクラスの名前が続きます： <code>[class.class-name]</code> 。
ko: 클래스 바인딩 구문은 속성 바인딩과 비슷하지만 대괄호 사이의 요소 속성 대신 접두사 <code>class</code> 로 시작하고 선택적으로 점 ( <code>.</code> )과 CSS 클래스 <code>[class.class-name]</code> 합니다.
ru: Синтаксис привязки классов напоминает привязку свойства, но вместо свойства элемента в скобках начинайте с префиксного <code>class</code> , за которым, возможно, следует точка ( <code>.</code> ) И имя класса CSS: <code>[class.class-name]</code> .

source: Class decorators
es: Decoradores de la clase
ja: クラスデコレーター
ko: 클래스 데코레이터
ru: Класс декораторы

source: Class field decorators for directives and components
es: Decoradores de campo de clase para directivas y componentes
ja: ディレクティブとコンポーネントのためのクラスフィールドデコレータ
ko: 지시문 및 구성 요소를위한 클래스 필드 데코레이터
ru: Полевые декораторы класса для директив и компонентов

source: Class if false
es: La clase si es falsa
ja: falseの場合のクラス
ko: 거짓 인 경우 클래스
ru: Класс если ложь

source: Class if true
es: La clase si es verdad
ja: クラスが真の場合
ko: 참인 경우
ru: Класс,если верно

source: Class implementations
es: Implementación de la clase
ja: クラスの実装
ko: 클래스 구현
ru: Классовые внедрения

source: Class interface
es: Interfaz de la clase
ja: クラスインタフェース
ko: 클래스 인터페이스
ru: Интерфейс класса

source: Class names and selectors are local to the component and don't collide with classes and selectors used elsewhere in the application.
es: Los nombres de las clases y selectores son locales al componente y no colisionan con las clases y selectores utilizados en otras partes de la aplicación.
ja: クラス名とセレクタはコンポーネントのローカルなものであり、アプリケーションの他の場所で使用されているクラスやセレクタと衝突することはありません。
ko: 클래스 이름과 선택기는 구성 요소에 로컬이며 응용 프로그램의 다른 곳에서 사용되는 클래스 및 선택기와 충돌하지 않습니다.
ru: Имена классов и селекторы локальны для компонента и не сталкиваются с классами и селекторами,используемыми в других местах приложения.

source: Class providers with dependencies
es: Proveedores de clase con dependencias
ja: 依存関係を持つクラスプロバイダ
ko: 종속성이있는 클래스 제공자
ru: Класс провайдеров с зависимостями

source: Class providers: <code>useClass</code>
es: Proveedores de clase: <code>useClass</code>
ja: クラスプロバイダー： <code>useClass</code>
ko: 클래스 제공자 : <code>useClass</code>
ru: Класс провайдеров: <code>useClass</code>

source: Class to instantiate for the <code>token</code>.
es: Clase para instanciar para el <code>token</code> .
ja: <code>token</code> をインスタンス化するクラス。
ko: <code>token</code> 을 인스턴스화하는 클래스 입니다.
ru: Класс для создания экземпляра для <code>token</code> .

source: Cleaning up on instance destruction
ja: インスタンス破壊の片付け
ko: 인스턴스 파괴시 정리
ru: Очистка при уничтожении экземпляров

source: Cleanup just before Angular destroys the directive or component. Unsubscribe Observables and detach event handlers to avoid memory leaks. See details in <a href="lifecycle-hooks#ondestroy">Cleaning up on instance destruction</a> in this document.
ja: Angularがディレクティブまたはコンポーネントを破棄する直前のクリーンアップ。メモリリークを回避するために、Observablesのサブスクライブを解除し、イベントハンドラーをデタッチします。このドキュメントの<a href="lifecycle-hooks#ondestroy">インスタンス破壊のクリーンアップの</a>詳細を参照してください。
ko: Angular가 지시문 또는 구성 요소를 파괴하기 직전에 정리하십시오. Observable을 구독 취소하고 이벤트 핸들러를 분리하여 메모리 누수를 방지하십시오. 이 문서의 <a href="lifecycle-hooks#ondestroy">인스턴스 폐기 정리</a> 에서 자세한 내용을 참조하십시오 .
ru: Очистка непосредственно перед тем, как Angular уничтожит директиву или компонент. Отмените подписку на Observables и отсоедините обработчики событий, чтобы избежать утечек памяти. См. Подробности в разделе &laquo; <a href="lifecycle-hooks#ondestroy">Очистка при уничтожении экземпляра&raquo;</a> в этом документе.

source: Cleanup just before Angular destroys the directive/component. Unsubscribe Observables and detach event handlers to avoid memory leaks.
es: La limpieza justo antes de que Angular destruya la directiva/componente.Anula la suscripción de Observables y separa los manejadores de eventos para evitar fugas de memoria.
ja: Angularがディレクティブ/コンポーネントを破棄する直前にクリーンアップする。メモリリークを避けるためにObservablesのアンサブスクライブとイベントハンドラのデタッチを行います。
ko: Angular가 지시문 / 구성 요소를 파괴하기 직전에 정리하십시오. 메모리 누수를 피하기 위해 Observable을 구독 취소하고 이벤트 핸들러를 분리하십시오.
ru: Очистка непосредственно перед тем,как Angular уничтожит директиву/компонент.Откажитесь от подписки Observables и отсоедините обработчики событий,чтобы избежать утечки памяти.

source: Clearing secondary routes
es: Despejar las rutas secundarias
ja: 二次ルートのクリア
ko: 보조 경로 지우기
ru: Очистка вторичных маршрутов

source: Clearing the request body
es: Despejar el cuerpo de la solicitud
ja: リクエストボディのクリア
ko: 요청 본문 지우기
ru: Очистка органа запроса

source: Clearing the request body in a clone
ja: クローンでのリクエストボディのクリア
ko: 복제본에서 요청 본문 지우기
ru: Очистка тела запроса в клоне

source: Clearly, some values benefit from a bit of editing. You may notice that you desire many of the same transformations repeatedly, both within and across many applications. You can almost think of them as styles. In fact, you might like to apply them in your HTML templates as you do styles.
es: Claramente,algunos valores se benefician de un poco de edición.Puedes notar que deseas muchas de las mismas transformaciones repetidamente,tanto dentro como a través de muchas aplicaciones.Casi puedes pensar en ellas como estilos.De hecho,puede que quieras aplicarlas en tus plantillas HTML como haces con los estilos.
ja: 明らかに、いくつかの値は少し編集することで利益を得ることができます。多くのアプリケーションの中で、あるいは複数のアプリケーション間で、同じ変換を繰り返し行いたいことに気づくかもしれません。それらはほとんどスタイルと考えることができます。実際、スタイルと同じようにHTMLテンプレートにも適用したいと思うかもしれません。
ko: 분명히 일부 값은 약간의 편집을 통해 이익을 얻습니다. 여러 응용 프로그램 내에서 또는 여러 응용 프로그램간에 동일한 변환을 반복해서 반복해야한다는 것을 알 수 있습니다. 거의 스타일로 생각할 수 있습니다. 실제로 스타일을 적용 할 때 HTML 템플릿에 적용 할 수 있습니다.
ru: Очевидно,что некоторые ценности выигрывают от небольшого редактирования.Вы можете заметить,что вы хотите многократно использовать одни и те же преобразования,как внутри,так и между различными приложениями.Вы можете почти думать о них как о стилях.На самом деле,вы,возможно,захотите применить их в ваших HTML шаблонах,как вы делаете стили.

source: Clears all caches.
es: Despeja todos los escondites.
ja: すべてのキャッシュをクリアします。
ko: 모든 캐시를 지 웁니다.
ru: Очищает все кэши.

source: Clears out the shared fake async zone for a test. To be called in a global <code>beforeEach</code>.
es: Borra la zona as&iacute;ncrona falsa compartida para una prueba. Ser llamado en un global <code>beforeEach</code> .
ja: テスト用に共有された偽の非同期ゾーンをクリアします。グローバル <code>beforeEach</code> で呼び出されます。
ko: 테스트를 위해 공유 가짜 비동기 영역을 지 웁니다. 글로벌 <code>beforeEach</code> 에서 호출됩니다 .
ru: Удаляет общую ложную асинхронную зону для теста. Быть вызванным в глобальном <code>beforeEach</code> .

source: Clears the cache for the given component/ngModule.
es: Despeja la memoria caché para el componente/módulo dado.
ja: 指定したコンポーネント/ngModuleのキャッシュをクリアします。
ko: 주어진 component / ngModule에 대한 캐시를 지 웁니다.
ru: Очищает кэш для данного компонента/нг-модуля.

source: Click "Buy" to add the product to the cart.
es: Haga clic en "Comprar" para añadir el producto a la cesta.
ja: 購入」をクリックしてカートに追加してください。
ko: "구매"를 클릭하여 카트에 제품을 추가하십시오.
ru: Нажмите "Купить",чтобы добавить продукт в корзину.

source: Click "Checkout" to see the cart.
es: Haga clic en "Checkout" para ver el carrito.
ja: お会計」をクリックするとカートが表示されます。
ko: 장바구니를 보려면 "체크 아웃"을 클릭하십시오.
ru: Нажмите "Оформить заказ",чтобы увидеть корзину.

source: Click OK to close the dialog.
es: Haz clic en Aceptar para cerrar el diálogo.
ja: OKをクリックしてダイアログを閉じます。
ko: 대화 상자를 닫으려면 확인을 클릭하십시오.
ru: Нажмите OK,чтобы закрыть диалог.

source: Click inside the name box, then click outside it.
es: Haz clic dentro del cuadro de nombre y luego fuera de él.
ja: ネームボックスの内側をクリックし、外側をクリックします。
ko: 이름 상자 내부를 클릭 한 다음 외부를 클릭하십시오.
ru: Щелкните внутри поля с названием,затем щелкните снаружи.

source: Click inside the name box, then click outside it. The control has now been visited, and the element has the <code>ng-touched</code> class instead of the <code>ng-untouched</code> class.
ja: 名前ボックスの内側をクリックしてから、外側をクリックします。コントロールは今訪問してきた、と要素があり <code>ng-touched</code> 代わりのクラス <code>ng-untouched</code> クラスを。
ko: 이름 상자 안쪽을 클릭 한 다음 바깥 쪽을 클릭합니다. 이 컨트롤은 이제 방문하고 있으며, 요소는이 <code>ng-touched</code> 대신 클래스 <code>ng-untouched</code> 클래스를.
ru: Щелкните внутри поля имени, затем щелкните за его пределами. Теперь элемент управления посещен, и элемент имеет класс <code>ng-touched</code> вместо класса <code>ng-untouched</code> .

source: Click links on the page and the browser navigates to a new page.
es: Haga clic en los enlaces de la página y el navegador navegará a una nueva página.
ja: ページ内のリンクをクリックすると、ブラウザは新しいページに移動します。
ko: 페이지에서 링크를 클릭하면 브라우저가 새 페이지로 이동합니다.
ru: Щелкните по ссылкам на странице и браузер перейдет на новую страницу.

source: Click links on the page, and the browser navigates to a new page.
es: Haga clic en los enlaces de la página,y el navegador navegará a una nueva página.
ja: ページ上のリンクをクリックすると、ブラウザは新しいページに移動します。
ko: 페이지에서 링크를 클릭하면 브라우저가 새 페이지로 이동합니다.
ru: Щелкните по ссылкам на странице,и браузер перейдет на новую страницу.

source: Click on "My Store" to go to the product list page.
es: Haga clic en "Mi tienda" para ir a la página de la lista de productos.
ja: マイストア」をクリックすると商品一覧ページに移動します。
ko: "내 상점"을 클릭하여 제품 목록 페이지로 이동하십시오.
ru: Нажмите на "Мой магазин",чтобы перейти на страницу со списком товаров.

source: Click on "My Store" to go to the product list view.
ja: マイストア」をクリックすると、商品一覧表示に移動します。
ko: "내 상점"을 클릭하여 제품 목록보기로 이동하십시오.
ru: Нажмите на "Мой магазин",чтобы перейти к просмотру списка товаров.

source: Click on a product name to display its details.
es: Haga clic en el nombre de un producto para mostrar sus detalles.
ja: 商品名をクリックすると詳細が表示されます。
ko: 세부 사항을 표시하려면 제품 이름을 클릭하십시오.
ru: Нажмите на название продукта,чтобы отобразить его подробности.
