Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/angular/angular.*.006.xlf
Languages: es, ja, ko, ru, zh_cn

source: Extensibility through NgModule imports is a primary goal of the NgModule system. Merging NgModule providers into the application injector makes it easy for a module library to enrich the entire application with new services. By adding the <code><a href="../api/common/http/httpclientmodule">HttpClientModule</a></code> once, every application component can make HTTP requests.
zh_cn: 通过NgModule导入实现可扩展性是NgModule系统的主要目标。将NgModule提供程序合并到应用程序注入程序中，模块库就可以轻松地通过新服务丰富整个应用程序。通过一次添加 <code><a href="../api/common/http/httpclientmodule">HttpClientModule</a></code> ，每个应用程序组件都可以发出HTTP请求。

source: External and global style files
zh_cn: 外部和全局风格文件

source: Extract all licenses in a separate file.
zh_cn: 将所有许可证提取到一个单独的文件中。

source: Extract css from global styles into css files instead of js ones.
zh_cn: 从全局样式中提取css到css文件,而不是js文件。

source: Extract templates and styles to their own files
zh_cn: 将模板和样式提取到自己的文件中

source: Extract the <code>id</code> from the route
zh_cn: 从路线中提取 <code>id</code>

source: Extract the <code>id</code> route parameter
zh_cn: 提取 <code>id</code> 路由参数

source: Extracting localizable text into a file that you can send out to be translated.
zh_cn: 将可本地化的文本提取到一个文件中,你可以发送出去进行翻译。

source: Extracts i18n messages from source code.
zh_cn: 从源码中提取i18n信息。

source: Extracts the part of the URL that should be handled by the router. The rest of the URL will remain untouched.
zh_cn: 提取URL中应该由路由器处理的部分。URL的其余部分将保持不变。

source: Facilitate web crawlers (SEO)
zh_cn: 方便网络爬虫(SEO)。

source: Facilitate web crawlers through <a href="https://static.googleusercontent.com/media/www.google.com/en//webmasters/docs/search-engine-optimization-starter-guide.pdf">search engine optimization (SEO)</a>
zh_cn: 通过<a href="https://static.googleusercontent.com/media/www.google.com/en//webmasters/docs/search-engine-optimization-starter-guide.pdf">搜索引擎优化（SEO）</a>促进网络爬虫

source: Factory function which can return an instance of an object represented by a key.
zh_cn: 工厂函数,可以返回一个由键代表的对象的实例。

source: Factory functions must be exported, named functions. The AOT compiler does not support lambda expressions ("arrow functions") for factory functions.
zh_cn: 工厂函数必须导出,命名为函数。AOT编译器不支持工厂函数的lambda表达式("箭头函数")。

source: Factory method that returns an instance of the $locationShim
zh_cn: 返回$locationShim实例的工厂方法。

source: Factory providers
zh_cn: 工厂供应商

source: Factory providers: <code><a href="../api/core/factorysansprovider#useFactory">useFactory</a></code>
zh_cn: 工厂提供者： <code><a href="../api/core/factorysansprovider#useFactory">useFactory</a></code>

source: Factory used to create new strategies for each NgElement instance.
zh_cn: 用于为每个NgElement实例创建新策略的工厂。

source: Failed requests can be retried easily.
zh_cn: 失败的请求可以轻松重试。

source: Fallback configuration examples
zh_cn: 回调配置示例

source: Feature (for routing)
zh_cn: 特征(用于路由)

source: Feature Module
zh_cn: 功能模块

source: Feature Modules
zh_cn: 功能模块

source: Feature area routes rarely (if ever) cross with routes of other features.
zh_cn: 特征区路线很少(如果有的话)与其他特征的路线交叉。

source: Feature modules
zh_cn: 功能模块

source: Feature modules are NgModules for the purpose of organizing code.
zh_cn: 功能模块是NgModules,目的是为了组织代码。

source: Feature modules are modules you create around specific application business domains, user workflows, and utility collections. They support your app by containing a particular feature, such as routes, services, widgets, etc. To conceptualize what a feature module might be in your app, consider that if you would put the files related to a certain functionality, like a search, in one folder, that the contents of that folder would be a feature module that you might call your <code>SearchModule</code>. It would contain all of the components, routing, and templates that would make up the search functionality.
zh_cn: 功能模块是您围绕特定的应用程序业务域，用户工作流和实用程序集合创建的模块。它们通过包含特定功能（例如路线，服务，小部件等）来支持您的应用。为概念化应用中可能包含的功能模块，请考虑是否要将与某些功能（如搜索）相关的文件放入其中，在一个文件夹中，该文件夹的内容将是一个功能模块，您可以将其称为 <code>SearchModule</code> 。它包含构成搜索功能的所有组件，路由和模板。

source: Feature modules vs. root modules
zh_cn: 功能模块与根模块

source: Feature, AppModule
zh_cn: 功能,AppModule

source: Features and APIs that were deprecated in v6 or earlier are candidates for removal in version 9 or any later major version. For information about Angular's deprecation and removal practices, see <a href="releases#deprecation-practices">Angular Release Practices</a>.
zh_cn: 在v6或更早版本中不推荐使用的功能和API是在版本9或任何更高版本的主要版本中删除的候选项。有关Angular弃用和删除实践的信息，请参阅<a href="releases#deprecation-practices">Angular发布实践</a>。

source: Feel free to unsubscribe anyway. It is harmless and never a bad practice.
zh_cn: 反正随时可以退订。这是无伤大雅的,绝不是什么坏做法。

source: Fetch data before navigating
zh_cn: 在导航前获取数据

source: Field type
zh_cn: 字段类型

source: File Name
zh_cn: 文件名

source: File Names
zh_cn: 文件名

source: File structure conventions
zh_cn: 文件结构惯例

source: File templates and snippets
zh_cn: 文件模板和片段

source: Files at the top level of <code>src/</code> support testing and running your application. Subfolders contain the application source and application-specific configuration.
zh_cn: <code>src/</code> 顶级文件支持测试和运行您的应用程序。子文件夹包含应用程序源和特定于应用程序的配置。

source: Files in that folder, such as <code>src/style-paths/_variables.scss</code>, can be imported from anywhere in your project without the need for a relative path:
zh_cn: 该文件夹中的文件，例如 <code>src/style-paths/_variables.scss</code> ，可以从项目中的任何位置导入，而无需相对路径：

source: Files inside <code>src/</code> "belong" to your app. Add new Typescript, HTML and CSS files inside the <code>src/</code> directory, most of them inside <code>src/app</code>, unless told to do otherwise.
zh_cn: <code>src/</code> 文件&ldquo;属于&rdquo;您的应用程序。除非另有说明，否则在 <code>src/</code> 目录中添加新的Typescript，HTML和CSS文件，其中大多数都在 <code>src/app</code> 中。

source: Files outside <code>src/</code> concern building, deploying, and testing your app. They include configuration files and external dependencies.
zh_cn: <code>src/</code> 之外的文件涉及构建，部署和测试您的应用程序。它们包括配置文件和外部依赖项。

source: Files to exclude from linting.
zh_cn: 要从绒毛中排除的文件。

source: Files to include in linting.
zh_cn: 纳入绒毛的文件。

source: Filter animation example
zh_cn: 过滤器动画示例

source: Filtering and especially sorting are expensive operations. The user experience can degrade severely for even moderate-sized lists when Angular calls these pipe methods many times per second. <code>filter</code> and <code>orderBy</code> have often been abused in AngularJS apps, leading to complaints that Angular itself is slow. That charge is fair in the indirect sense that AngularJS prepared this performance trap by offering <code>filter</code> and <code>orderBy</code> in the first place.
zh_cn: 过滤，尤其是分类是昂贵的操作。当Angular每秒多次调用这些管道方法时，即使是中等大小的列表，用户体验也会严重恶化。 <code>filter</code> 和 <code>orderBy</code> 通常在AngularJS应用中被滥用，导致人们抱怨Angular本身运行缓慢。AngularJS 首先通过提供 <code>filter</code> 和 <code>orderBy</code> 来准备此性能陷阱，这在间接意义上是公平的。

source: Filtering request URLs
zh_cn: 过滤请求URL

source: Filtering streams
zh_cn: 过滤流

source: Final ad banner
zh_cn: 最后的广告横幅

source: Final code review
zh_cn: 最后守则审查

source: Final setup and tests
zh_cn: 最后的设置和测试

source: Final thoughts
zh_cn: 最后的想法

source: Finally, bootstrap the <code>AppModule</code> in <code>app/main.ts</code>. This file has been configured as the application entrypoint in <code>systemjs.config.js</code>, so it is already being loaded by the browser.
zh_cn: 最后，自举 <code>AppModule</code> 在 <code>app/main.ts</code> 。该文件已被配置为 <code>systemjs.config.js</code> 中的应用程序入口点，因此浏览器已经在加载它。

source: Finally, display an instance of the form in the <code>AppComponent</code> shell.
zh_cn: 最后，在 <code>AppComponent</code> shell中显示表单的实例。

source: Finally, from <code>index.html</code>, remove all references to AngularJS scripts and jQuery. When you're done, this is what it should look like:
zh_cn: 最后，从 <code>index.html</code> 删除对AngularJS脚本和jQuery的所有引用。完成后，它应该是这样的：

source: Finally, kick off the whole process, by bootstraping your top level Angular <code><a href="../../core/ngmodule">NgModule</a></code>.
zh_cn: 最后，通过引导顶级Angular <code><a href="../../core/ngmodule">NgModule</a></code> 来启动整个过程。

source: Finally, revisit both of the component tests when you switch to the Angular router. For the details component, provide a mock of Angular <code><a href="../api/router/activatedroute">ActivatedRoute</a></code> object instead of using the AngularJS <code>$routeParams</code>.
zh_cn: 最后，当您切换到Angular路由器时，请重新访问两个组件测试。对于详细信息组件，请提供Angular <code><a href="../api/router/activatedroute">ActivatedRoute</a></code> 对象的模拟，而不是使用AngularJS <code>$routeParams</code> 。

source: Finally, the rule factory must return a rule.
zh_cn: 最后,规则工厂必须返回一个规则。

source: Finally, the server returns the rendered page to the client.
zh_cn: 最后,服务器将渲染后的页面返回给客户端。

source: Finally, update the product list component to receive output from the product alerts component.
zh_cn: 最后,更新产品列表组件以接收产品警报组件的输出。

source: Finally, you can apply the RouterLinkActive directive to an ancestor of a RouterLink.
zh_cn: 最后,你可以将RouterLinkActive指令应用到RouterLink的祖先。

source: Finally, you can bind to a specific class name. Angular adds the class when the template expression evaluates to truthy. It removes the class when the expression is falsy.
zh_cn: 最后,你可以绑定到一个特定的类名。当模板表达式评估为truthy时,Angular会添加该类。当表达式为falsy时,它会删除该类。

source: Finally, you should add some npm scripts in <code>package.json</code> to compile the TypeScript files to JavaScript (based on the <code>tsconfig.json</code> configuration file):
zh_cn: 最后，您应该在 <code>package.json</code> 中添加一些npm脚本，以将TypeScript文件编译为JavaScript（基于 <code>tsconfig.json</code> 配置文件）：

source: Find a parent by its class interface
zh_cn: 通过类的接口找到父类

source: Find a parent component of known type
zh_cn: 找到一个已知类型的父组件

source: Find a parent in a tree with <code>@SkipSelf()</code>
zh_cn: 使用 <code>@SkipSelf()</code> 在树中找到父母

source: Find out more in the <a href="../guide/animations">animations guide</a>.
zh_cn: 在<a href="../guide/animations">动画指南中</a>找到更多信息。

source: Find out more in the <a href="../guide/forms-overview">Forms Overview</a>.
zh_cn: 在&ldquo; <a href="../guide/forms-overview">表单概述&rdquo;中</a>找到更多信息。

source: Find providers by name
zh_cn: 按名称查找供应商

source: Find testability of a node in the Tree
zh_cn: 找出树中节点的可测试性。

source: Find the <a href="https://developers.google.com/web/tools/chrome-devtools/network-performance/reference#throttling">Network Throttling</a> dropdown on the far right of the menu bar.
zh_cn: 在菜单栏的最右侧找到&ldquo; <a href="https://developers.google.com/web/tools/chrome-devtools/network-performance/reference#throttling">网络限制&rdquo;</a>下拉列表。

source: Find the <code>&lt;input&gt;</code> tag for <em>Name</em> and update it like this:
zh_cn: 找到&ldquo; <em>名称&rdquo;</em>的 <code>&lt;input&gt;</code> 标记，并像这样更新它：<em></em>

source: Find the <code>getHeroes</code> method and replace it with the following code (shown side-by-side with the previous version for comparison)
zh_cn: 找到 <code>getHeroes</code> 方法并将其替换为以下代码（与以前的版本并排显示以进行比较）

source: Find the header for your page. For example, a guide page that describes an Angular feature is probably a child of the <code>Fundamentals</code> header.
zh_cn: 查找页面的标题。例如，描述Angular功能的指南页面可能是 <code>Fundamentals</code> 标头的子级。

source: Find the way back
zh_cn: 找到回去的路

source: Find this example in <span name="dependency-injection-in-action">live code</span> and confirm that the three <code>HeroBioComponent</code> instances have their own cached hero data.
zh_cn: 在<span name="dependency-injection-in-action">实时代码中</span>找到此示例，并确认三个 <code>HeroBioComponent</code> 实例具有自己的缓存英雄数据。

source: Finding the current version of Angular
zh_cn: 寻找当前版本的Angular

source: Finds one or more inner elements within the current element that is being animated within a sequence. Use with <code><a href="animate">animate</a>()</code>.
zh_cn: 在序列中正在动画的当前元素中找到一个或多个内部元素。与 <code><a href="animate">animate</a>()</code> 一起使用。

source: Finds one or more inner elements within the current element that is being animated within a sequence. Use with <code><a href="animations/animate">animate</a>()</code>.
zh_cn: 在序列中正在动画的当前元素中找到一个或多个内部元素。与 <code><a href="animations/animate">animate</a>()</code> 一起使用。

source: Fine tune control
zh_cn: 微调控制

source: Firebase hosting
zh_cn: Firebase主机

source: First ensure that the service to be downgraded is provided in an <code><a href="../../core/ngmodule">NgModule</a></code> that will be part of the upgrade application. For example, let's assume we have defined <code>HeroesService</code>
zh_cn: 首先确保要降级的服务在 <code><a href="../../core/ngmodule">NgModule</a></code> 中提供中将作为升级应用程序的一部分。例如，假设我们定义了 <code>HeroesService</code>

source: First import the <code><a href="../api/platform-browser/animations/browseranimationsmodule">BrowserAnimationsModule</a></code> and add it to the <code>imports</code> array:
zh_cn: 首先导入 <code><a href="../api/platform-browser/animations/browseranimationsmodule">BrowserAnimationsModule</a></code> 并将其添加到 <code>imports</code> 数组：

source: First string for comparison
zh_cn: 第一个比较用的字符串

source: First we must create a directive that will wrap the validator function. We provide it as the validator using the <code><a href="../api/forms/ng_validators">NG_VALIDATORS</a></code> token. If you are not sure why, or you do not fully understand the syntax, revisit the previous <a href="form-validation#adding-to-template-driven-forms">section</a>.
zh_cn: 首先，我们必须创建一个包装验证器函数的指令。我们使用 <code><a href="../api/forms/ng_validators">NG_VALIDATORS</a></code> 令牌将其提供为验证器。如果不确定为什么，或者不完全了解语法，请重新阅读上一<a href="form-validation#adding-to-template-driven-forms">节</a>。

source: First we retrieve the child controls by calling the <code><a href="../api/forms/formgroup">FormGroup</a></code>'s <a href="../api/forms/abstractcontrol#get">get</a> method. Then we simply compare the values of the <code>name</code> and <code>alterEgo</code> controls.
zh_cn: 首先，我们通过调用 <code><a href="../api/forms/formgroup">FormGroup</a></code> 的<a href="../api/forms/abstractcontrol#get">get</a>方法来检索子控件。然后，我们只需比较 <code>name</code> 和 <code>alterEgo</code> 控件。

source: First you extend the router import statement to include the <code><a href="../api/router/activatedroute">ActivatedRoute</a></code> service symbol:
zh_cn: 首先，您扩展路由器导入语句以包括 <code><a href="../api/router/activatedroute">ActivatedRoute</a></code> 服务符号：

source: First you surround that fragment in the source file with a named <em>docregion</em> as described <a href="docs-style-guide#source-code-markup">below</a>. Then you reference that <em>docregion</em> in the <code>region</code> attribute of the <code>&lt;code-example&gt;</code> like this
zh_cn: 首先，您在源文件中将该片段用一个命名的<em>docregion围绕</em>，<a href="docs-style-guide#source-code-markup">如下所述</a>。然后，在 <code>&lt;code-example&gt;</code> 的 <code>region</code> 属性中引用该<em>docregion</em>像这样

source: First, <code>AppRoutingModule</code> imports <code><a href="../api/router/routermodule">RouterModule</a></code> and <code><a href="../api/router/routes">Routes</a></code> so the app can have routing functionality. The next import, <code>HeroesComponent</code>, will give the Router somewhere to go once you configure the routes.
zh_cn: 首先， <code>AppRoutingModule</code> 导入 <code><a href="../api/router/routermodule">RouterModule</a></code> 和 <code><a href="../api/router/routes">Routes</a></code> ,以便该应用程序可以具有路由功能。下一次导入 <code>HeroesComponent</code> 配置路由后， HeroesComponent将使Router 处在某个位置。

source: First, be sure to import <code><a href="../api/core/output">Output</a></code> and <code><a href="../api/core/eventemitter">EventEmitter</a></code> in the child component class:
zh_cn: 首先，请确保导入 <code><a href="../api/core/output">Output</a></code> 和 <code><a href="../api/core/eventemitter">EventEmitter</a></code> 在子组件类中：

source: First, create an <code>AnimalService</code> with an <code>emoji</code> property of 🐳 (whale):
zh_cn: 首先，使用 <code>emoji</code> 创建 <code>AnimalService</code> 的🐳（鲸鱼）特性：

source: First, ensure that <code>src/index.html</code> is set as the start page. Right-click <code>index.html</code> in Solution Explorer and select option <code>Set As Start Page</code>.
zh_cn: 首先，确保将 <code>src/index.html</code> 设置为起始页。在解决方案资源管理器中右键单击 <code>index.html</code> ，然后选择选项 <code>Set As Start Page</code> 。

source: First, import the schematics definitions you will need. The Schematics framework offers many utility functions to create and use rules when running a schematic.
zh_cn: 首先,导入您需要的原理图定义。Schematics框架提供了许多实用功能,用于在运行原理图时创建和使用规则。

source: First, it sets the <code>currentAdIndex</code> by taking whatever it currently is plus one, dividing that by the length of the <code>AdItem</code> array, and using the <em>remainder</em> as the new <code>currentAdIndex</code> value. Then, it uses that value to select an <code>adItem</code> from the array.
zh_cn: 第一，它设置 <code>currentAdIndex</code> 通过采取任何它目前是加一，除以由所述的长度 <code>AdItem</code> 阵列，以及使用该<em>剩余</em>作为新 <code>currentAdIndex</code> 值。然后，它使用该值从数组中选择一个 <code>adItem</code> 。

source: First, remove the <code>ng-app</code> attribute from <code>index.html</code>. Then import <code><a href="../api/upgrade/static/upgrademodule">UpgradeModule</a></code> in the <code>AppModule</code>, and override its <code>ngDoBootstrap</code> method:
zh_cn: 首先，从 <code>index.html</code> 删除 <code>ng-app</code> 属性。然后在 <code>AppModule</code> 中导入 <code><a href="../api/upgrade/static/upgrademodule">UpgradeModule</a></code> ，并覆盖其 <code>ngDoBootstrap</code> 方法：

source: First, use the child's selector, here <code>&lt;app-item-detail&gt;</code>, as a directive within the parent component template. Then, use <a href="template-syntax#property-binding">property binding</a> to bind the property in the child to the property of the parent.
zh_cn: 首先，使用孩子的选择器（这里 <code>&lt;app-item-detail&gt;</code> ）作为父组件模板中的指令。然后，使用<a href="template-syntax#property-binding">属性绑定</a>将子级中的到父级中的属性。

source: First, you have to import references to the <code><a href="../api/core/viewchild">ViewChild</a></code> decorator and the <code><a href="../api/core/afterviewinit">AfterViewInit</a></code> lifecycle hook.
zh_cn: 首先，您必须导入对 <code><a href="../api/core/viewchild">ViewChild</a></code> 装饰器和 <code><a href="../api/core/afterviewinit">AfterViewInit</a></code> 的引用生命周期挂钩。

source: First, you'll set up the checkout form model. The form model is the source of truth for the status of the form and is defined in the component class.
zh_cn: 首先,你要设置结账表单模型。表单模型是表单状态的真实来源,定义在组件类中。

source: Fixes linting errors (may overwrite linted files).
zh_cn: 修复掉毛错误(可能会覆盖掉毛的文件)。

source: Fixture for debugging and testing a component.
zh_cn: 用于调试和测试组件的夹具。

source: Flag to prevent building an app shell.
zh_cn: 防止构建应用程序外壳的标志。

source: Flags for renderer-specific style modifiers.
zh_cn: 渲染器特定样式修改器的标志。

source: Flags for style variations to remove, if set. ???
zh_cn: 样式变化的标志,如果设置的话,要删除。???

source: Flags for style variations. No flags are set by default.
zh_cn: 样式变化的标志。默认情况下没有设置任何标志。

source: Floating images
zh_cn: 浮动图像

source: Floating within a subsection
zh_cn: 在一个小节内浮动

source: Flush any pending microtasks.
zh_cn: 清空所有待处理的微型任务。

source: Focus on the <code>overrideComponent</code> method.
zh_cn: 专注于 <code>overrideComponent</code> 方法。

source: Focus on the binding syntax: <code>[(<a href="../api/forms/ngmodel">ngModel</a>)]="..."</code>.
zh_cn: 关注绑定语法： <code>[(<a href="../api/forms/ngmodel">ngModel</a>)]="..."</code> 。

source: Focus on the component's template.
zh_cn: 关注组件的模板。

source: Focus on the constructor parameters.
zh_cn: 关注构造函数参数。

source: Focus on the following three TypeScript (<code>.ts</code>) files in the <strong><code>/src</code></strong> folder.
zh_cn: 专注于<strong> <code>/src</code> 中</strong>的以下三个TypeScript（ <code>.ts</code> ）文件<strong></strong>文件夹中。

source: Focus on the spy.
zh_cn: 专注于间谍。

source: Focus on the template:
zh_cn: 专注于模板。

source: Foldable syntax
zh_cn: 可折叠式语法

source: Follow the AngularJS Style Guide
zh_cn: 遵循AngularJS风格指南

source: Follow the instructions in <a href="setup-local">Local Environment Setup</a> to create a starter Angular app using the CLI command <a href="cli/new"><code>ng new</code></a>.
zh_cn: 按照<a href="setup-local">本地环境设置中</a>的说明使用CLI命令<a href="cli/new"> <code>ng new</code> </a>创建Starter Angular应用。

source: Follow the prompts to select the <code>Firebase</code> project you are creating for hosting.
zh_cn: 按照提示选择要创建的 <code>Firebase</code> 项目以进行托管。

source: Follow these steps:
zh_cn: 遵循这些步骤。

source: Follow this convention when you write similar modules with configurable service providers.
zh_cn: 当你用可配置的服务提供者来编写类似的模块时,请遵循这个惯例。

source: Following is all the code discussed in this page.
zh_cn: 以下是本页面讨论的所有代码。

source: Following the same pattern as with the <code>FlowerService</code>, inject the <code>AnimalService</code> in the <code>AppComponent</code> class:
zh_cn: 按照相同的图案与 <code>FlowerService</code> ，注入 <code>AnimalService</code> 在 <code>AppComponent</code> 类：

source: For <a href="glossary#universal">Universal</a>, you can reduce the code rendered in the HTML page by setting styles optimization to <code>true</code> and styles source maps to <code>false</code>.
zh_cn: 对于<a href="glossary#universal">Universal</a>，您可以通过将样式优化设置为 <code>true</code> 并将样式源映射设置为 <code>false</code> 来减少HTML页面中呈现的代码。。

source: For <code>en-US</code>, 'M/d/yy, h:mm a'<code>(Example:</code>6/15/15, 9:03 AM`)
zh_cn: 对于 <code>en-US</code> ，&ldquo; M / d / yy，h：mm a&rdquo; <code>(Example:</code> 6/15 / 15，9：03 AM）

source: For <code>en-US</code>, <code>'EEEE, MMMM d, y, h:mm:ss <a href="../router/routerlinkwithhref">a</a> zzzz'</code> (Example: <code><a href="weekday#Monday">Monday</a>, June 15, 2015 at 9:03:01 AM GMT+01:00</code>)
zh_cn: 对于 <code>en-US</code> ， <code>'EEEE, MMMM d, y, h:mm:ss <a href="../router/routerlinkwithhref">a</a> zzzz'</code> （示例： <code><a href="weekday#Monday">Monday</a>, June 15, 2015 at 9:03:01 AM GMT+01:00</code> <a href="weekday#Monday">星期一</a>，格林尼治标准时间+01：00）

source: For <code>en-US</code>, <code>'MMM d, y, h:mm:ss <a href="../router/routerlinkwithhref">a</a>'</code> (Example: <code>Jun 15, 2015, 9:03:01 AM</code>)
zh_cn: 对于 <code>en-US</code> ， <code>'MMM d, y, h:mm:ss <a href="../router/routerlinkwithhref">a</a>'</code> （例如： <code>Jun 15, 2015, 9:03:01 AM</code> ）

source: For <code>en-US</code>, <code>'MMMM d, y, h:mm:ss <a href="../router/routerlinkwithhref">a</a> z'</code> (Example: <code>June 15, 2015 at 9:03:01 AM GMT+1</code>)
zh_cn: 对于 <code>en-US</code> ， <code>'MMMM d, y, h:mm:ss <a href="../router/routerlinkwithhref">a</a> z'</code> （例如： <code>June 15, 2015 at 9:03:01 AM GMT+1</code> ）

source: For AOT compilation, include the <code>--aot</code> option with the <code>ng build</code> or <code>ng serve</code> command:
zh_cn: 对于AOT编译，请在 <code>ng build</code> 或 <code>ng serve</code> 命令中包括 <code>--aot</code> 选项：

source: For a <code><a href="formarray">FormArray</a></code>, the values of enabled controls as an array.
zh_cn: 对于 <code><a href="formarray">FormArray</a></code> ，启用控件的值作为一个数组。

source: For a <code><a href="formcontrol">FormControl</a></code>, the current value.
zh_cn: 对于 <code><a href="formcontrol">FormControl</a></code> ，当前值。

source: For a complete list of locales supported by Angular, see <a href="https://github.com/angular/angular/tree/master/packages/common/locales">the Angular repository</a>.
zh_cn: 有关Angular支持的语言环境的完整列表，请参见<a href="https://github.com/angular/angular/tree/master/packages/common/locales">Angular存储库</a>。

source: For a demonstration of the syntax and code snippets in this section, see the <span name="binding-syntax">binding syntax example</span>.
zh_cn: 有关本节中语法和代码段的演示，请参见<span name="binding-syntax">绑定语法示例</span>。

source: For a demonstration of the syntax and code snippets in this section, see the <span name="template-reference-variables">template reference variables example</span>.
zh_cn: 有关本节中语法和代码段的演示，请参见<span name="template-reference-variables">模板参考变量示例</span>。
