Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/angular/angular.*.006.xlf
Languages: es, ja, ko, ru, zh_cn

source: Create the component that controls the form.
es: Crear el componente que controla la forma.
ja: フォームを制御するコンポーネントを作成します。
ko: 양식을 제어하는 ​​구성 요소를 작성하십시오.
ru: Создайте компонент,управляющий формой.

source: Create the directive class file in a terminal window with the CLI command <a href="cli/generate"><code>ng generate directive</code></a>.
es: Cree el archivo de clase de directiva en una ventana de terminal con el comando CLI <a href="cli/generate"> <code>ng generate directive</code> </a> .
ja: CLIコマンド<a href="cli/generate"> <code>ng generate directive</code> を</a>使用して、ターミナルウィンドウでディレクティブクラスファイルを作成します。
ko: CLI 명령 <a href="cli/generate"> <code>ng generate directive</code> </a> 하여 지시문 클래스 파일을 터미널 창에 작성하십시오 .
ru: Создайте файл класса директивы в окне терминала с помощью команды CLI <a href="cli/generate"> <code>ng generate directive</code> </a> .

source: Create the feature module with the CLI, using the <code>--route</code> flag.
es: Cree el m&oacute;dulo de caracter&iacute;sticas con la CLI, utilizando el indicador <code>--route</code> .
ja: <code>--route</code> フラグを使用して、CLIで機能モジュールを作成します。
ko: <code>--route</code> 플래그를 사용하여 CLI로 기능 모듈을 작성하십시오 .
ru: Создайте функциональный модуль с CLI, используя флаг <code>--route</code> .

source: Create the feature module&rsquo;s component.
es: Cree el componente del m&oacute;dulo de caracter&iacute;sticas.
ja: 機能モジュールのコンポーネントを作成します。
ko: 기능 모듈의 구성 요소를 작성하십시오.
ru: Создайте компонент функционального модуля.

source: Create the heroes component
es: Crear el componente de héroes
ja: ヒーローコンポーネントを作成する
ko: 영웅 구성 요소 만들기
ru: Создать компонент героев

source: Create the initial Bazel configuration files by running the following command:
es: Crea los archivos de configuración inicial de Bazel ejecutando el siguiente comando:
ja: 以下のコマンドを実行して、Bazelの初期設定ファイルを作成します。
ko: 다음 명령을 실행하여 초기 Bazel 구성 파일을 작성하십시오.
ru: Создайте исходные файлы конфигурации Bazel,выполнив следующую команду:

source: Create the main file <code>index.ts</code> and add the source code for your schematic factory function.
ja: メインファイル <code>index.ts</code> を作成し、回路図ファクトリ関数のソースコードを追加します。
ko: 주 파일 <code>index.ts</code> 를 만들고 회로도 팩토리 기능에 대한 소스 코드를 추가합니다.
ru: Создайте главный файл <code>index.ts</code> и добавьте исходный код для функции фабрики схемы.

source: Create the main file, <code>index.ts</code> and add the source code for your schematic factory function.
es: Cree el archivo principal, <code>index.ts</code> y agregue el c&oacute;digo fuente para su funci&oacute;n esquem&aacute;tica de f&aacute;brica.
ja: メインファイル <code>index.ts</code> を作成し、回路図ファクトリ関数のソースコードを追加します。
ko: 기본 파일 인 <code>index.ts</code> 를 작성하고 회로도 팩토리 기능에 대한 소스 코드를 추가하십시오.
ru: Создайте основной файл <code>index.ts</code> и добавьте исходный код для функции фабрики схемы.

source: Create the main file, <code>index.ts</code>.
es: Cree el archivo principal, <code>index.ts</code> .
ja: メインファイル <code>index.ts</code> を作成します。
ko: 기본 파일 인 <code>index.ts</code> 를 작성하십시오 .
ru: Создайте основной файл <code>index.ts</code> .

source: Create the sample project
ja: サンプルプロジェクトの作成
ko: 샘플 프로젝트 만들기
ru: Создать образец проекта

source: Create the shopping cart service
es: Crear el servicio de carrito de compras
ja: ショッピングカートサービスの作成
ko: 쇼핑 카트 서비스 생성
ru: Создать службу корзины

source: Create the translation files
es: Crear los archivos de traducción
ja: 翻訳ファイルの作成
ko: 번역 파일 만들기
ru: Создать файлы перевода

source: Create trace scope.
es: Crear el alcance del rastreo.
ja: トレーススコープを作成します。
ko: 추적 범위를 작성하십시오.
ru: Создайте область прослеживания.

source: Create visual feedback for states
ja: 状態を視覚的にフィードバックする
ko: 상태에 대한 시각적 피드백 만들기
ru: Создать визуальную обратную связь для состояний

source: Create your custom renderer using <code><a href="rendererfactory2">RendererFactory2</a></code>.
es: Crea tu renderizador personalizado usando <code><a href="rendererfactory2">RendererFactory2</a></code> .
ja: <code><a href="rendererfactory2">RendererFactory2</a></code> を使用してカスタムレンダラーを作成します。
ko: <code><a href="rendererfactory2">RendererFactory2</a></code> 를 사용하여 커스텀 렌더러를 만듭니다 .
ru: Создайте свой собственный рендер с помощью <code><a href="rendererfactory2">RendererFactory2</a></code> .

source: Creates a <a href="http://hammerjs.github.io/api/#hammer.manager">HammerJS Manager</a> and attaches it to a given HTML element.
es: Crea un <a href="http://hammerjs.github.io/api/#hammer.manager">HammerJS Manager</a> y lo adjunta a un elemento HTML dado.
ja: <a href="http://hammerjs.github.io/api/#hammer.manager">HammerJSマネージャー</a>を作成し、指定されたHTML要素に添付します。
ko: <a href="http://hammerjs.github.io/api/#hammer.manager">HammerJS Manager를</a> 생성하여 지정된 HTML 요소에 연결합니다.
ru: Создает <a href="http://hammerjs.github.io/api/#hammer.manager">HammerJS Manager</a> и присоединяет его к данному элементу HTML.

source: Creates a <a href="https://hammerjs.github.io/api/#hammer.manager">HammerJS Manager</a> and attaches it to a given HTML element.
ru: Создает <a href="https://hammerjs.github.io/api/#hammer.manager">HammerJS Manager</a> и прикрепляет его к заданному элементу HTML.

source: Creates a <code><a href="formcontrol">FormControl</a></code> instance from a domain model and binds it to a form control element.
es: Crea una instancia de <code><a href="formcontrol">FormControl</a></code> a partir de un modelo de dominio y la vincula a un elemento de control de formulario.
ja: ドメインモデルから <code><a href="formcontrol">FormControl</a></code> インスタンスを作成し、それをフォームコントロール要素にバインドします。
ko: 도메인 모델로부터 <code><a href="formcontrol">FormControl</a></code> 인스턴스를 작성해, 폼 컨트롤 요소에 바인드합니다.
ru: Создает экземпляр <code><a href="formcontrol">FormControl</a></code> из модели домена и связывает его с элементом управления формой.

source: Creates a <code><a href="forms/formcontrol">FormControl</a></code> instance from a domain model and binds it to a form control element.
es: Crea una instancia de <code><a href="forms/formcontrol">FormControl</a></code> a partir de un modelo de dominio y la vincula a un elemento de control de formulario.
ja: ドメインモデルから <code><a href="forms/formcontrol">FormControl</a></code> インスタンスを作成し、それをフォームコントロール要素にバインドします。
ko: 도메인 모델로부터 <code><a href="forms/formcontrol">FormControl</a></code> 인스턴스를 작성해, 폼 컨트롤 요소에 바인드합니다.
ru: Создает экземпляр <code><a href="forms/formcontrol">FormControl</a></code> из модели домена и связывает его с элементом управления формой.

source: Creates a child injector from previously resolved providers.
es: Crea un inyector para niños a partir de proveedores previamente resueltos.
ja: 以前に解決したプロバイダから子インジェクタを作成します。
ko: 이전에 확인 된 공급자로부터 자식 인젝터를 만듭니다.
ru: Создает детский инъектор из ранее разрешенных провайдеров.

source: Creates a custom element class based on an Angular component.
es: Crea una clase de elemento personalizado basado en un componente angular.
ja: Angularコンポーネントをベースにカスタム要素クラスを作成します。
ko: 각도 구성 요소를 기반으로 사용자 정의 요소 클래스를 작성합니다.
ru: Создает пользовательский класс элементов на основе Углового компонента.

source: Creates a directory <code>src/app/hero-detail</code>.
es: Crea un directorio <code>src/app/hero-detail</code> .
ja: ディレクトリ <code>src/app/hero-detail</code> を作成します。
ko: <code>src/app/hero-detail</code> 디렉토리를 만듭니다 .
ru: Создает каталог <code>src/app/hero-detail</code> .

source: Creates a factory for a platform
es: Crea una fábrica para una plataforma
ja: プラットフォームの工場を作成します。
ko: 플랫폼의 팩토리를 작성합니다
ru: Создает фабрику для платформы

source: Creates a factory for a platform. Can be used to provide or override <code>Providers</code> specific to your applciation's runtime needs, such as <code><a href="core/platform_initializer">PLATFORM_INITIALIZER</a></code> and <code><a href="core/platform_id">PLATFORM_ID</a></code>.
ja: プラットフォームのファクトリを作成します。 <code><a href="core/platform_initializer">PLATFORM_INITIALIZER</a></code> や <code><a href="core/platform_id">PLATFORM_ID</a></code> など、アプリケーションのランタイムニーズに固有の <code>Providers</code> を提供またはオーバーライドするために使用できます。
ko: 플랫폼을위한 팩토리를 만듭니다. 애플리케이션의 런타임 요구 사항 (예 : <code><a href="core/platform_initializer">PLATFORM_INITIALIZER</a></code> 및 <code><a href="core/platform_id">PLATFORM_ID</a></code> )에 특정한 <code>Providers</code> 를 제공하거나 재정의하는 데 사용할 수 있습니다 .
ru: Создает фабрику для платформы. Может использоваться для предоставления или переопределения <code>Providers</code> специфичных для требований среды выполнения вашего приложения, таких как <code><a href="core/platform_initializer">PLATFORM_INITIALIZER</a></code> и <code><a href="core/platform_id">PLATFORM_ID</a></code> .

source: Creates a factory for a platform. Can be used to provide or override <code>Providers</code> specific to your applciation's runtime needs, such as <code><a href="platform_initializer">PLATFORM_INITIALIZER</a></code> and <code><a href="platform_id">PLATFORM_ID</a></code>.
ja: プラットフォームのファクトリを作成します。 <code><a href="platform_initializer">PLATFORM_INITIALIZER</a></code> や <code><a href="platform_id">PLATFORM_ID</a></code> など、アプリケーションのランタイムニーズに固有の <code>Providers</code> を提供またはオーバーライドするために使用できます。
ko: 플랫폼을위한 팩토리를 만듭니다. 애플리케이션의 런타임 요구 사항 (예 : <code><a href="platform_initializer">PLATFORM_INITIALIZER</a></code> 및 <code><a href="platform_id">PLATFORM_ID</a></code> )에 특정한 <code>Providers</code> 를 제공하거나 재정의하는 데 사용할 수 있습니다 .
ru: Создает фабрику для платформы. Может использоваться для предоставления или переопределения <code>Providers</code> специфичных для требований среды выполнения вашего приложения, таких как <code><a href="platform_initializer">PLATFORM_INITIALIZER</a></code> и <code><a href="platform_id">PLATFORM_ID</a></code> .

source: Creates a link to a different view based on a route instruction consisting of a route path, required and optional parameters, query parameters, and a fragment. To navigate to a root route, use the <code>/</code> prefix; for a child route, use the <code>./</code>prefix; for a sibling or parent, use the <code>../</code> prefix.
es: Crea un enlace a una vista diferente basada en una instrucci&oacute;n de ruta que consta de una ruta de ruta, par&aacute;metros obligatorios y opcionales, par&aacute;metros de consulta y un fragmento. Para navegar a una ruta ra&iacute;z, use el prefijo <code>/</code> ; para una ruta secundaria, use el prefijo <code>./</code> ; para un hermano o padre, use el prefijo <code>../</code> .
ja: ルートパス、必須パラメーターとオプションパラメーター、クエリパラメーター、およびフラグメントで構成されるルート命令に基づいて、別のビューへのリンクを作成します。ルートルートに移動するには、 <code>/</code> プレフィックスを使用します。子ルートの場合は、。 <code>./</code> プレフィックスを使用します。兄弟または親の場合は、接頭辞 <code>../</code> を使用します。
ko: 경로 경로, 필수 및 선택적 매개 변수, 쿼리 매개 변수 및 조각으로 구성된 경로 명령을 기반으로 다른보기에 대한 링크를 만듭니다. 루트 경로로 이동하려면 <code>/</code> 접두사를 사용하십시오 . 하위 경로의 경우 <code>./</code> 접두사를 사용하십시오 . 형제 또는 부모의 경우 <code>../</code> 접두사를 사용하십시오 .
ru: Создает ссылку на другое представление на основе инструкции маршрута, состоящей из пути маршрута, обязательных и необязательных параметров, параметров запроса и фрагмента. Чтобы перейти к корневому маршруту, используйте префикс <code>/</code> ; для дочернего маршрута используйте префикс <code>./</code> ; для родного брата или родителя используйте префикс <code>../</code> .

source: Creates a local variable <code>movieplayer</code> that provides access to the <code>video</code> element instance in data-binding and event-binding expressions in the current template.
es: Crea un <code>movieplayer</code> variable local que proporciona acceso a la instancia del elemento de <code>video</code> en expresiones de enlace de datos y eventos en la plantilla actual.
ja: 現在のテンプレートのデータバインディングおよびイベントバインディング式の <code>video</code> 要素インスタンスへのアクセスを提供するローカル変数 <code>movieplayer</code> を作成します。
ko: 현재 템플릿의 데이터 바인딩 및 이벤트 바인딩 식에서 <code>video</code> 요소 인스턴스에 대한 액세스를 제공 하는 로컬 변수 <code>movieplayer</code> 를 만듭니다 .
ru: Создает локальную переменную <code>movieplayer</code> , который обеспечивает доступ к <code>video</code> экземпляра элемента в привязки данных и событий связывания выражений в текущем шаблоне.

source: Creates a module with all the router directives and a provider registering routes, without creating a new Router service. When registering for submodules and lazy-loaded submodules, create the NgModule as follows:
ja: ルータサービスを新規に作成せずに、すべてのルータディレクティブとプロバイダがルートを登録するモジュールを作成します。サブモジュールや遅延負荷のあるサブモジュールを登録する場合は、以下のようにNgModuleを作成します。
ko: 새 라우터 서비스를 만들지 않고 모든 라우터 지시문과 경로를 등록하는 공급자가있는 모듈을 만듭니다. 하위 모듈 및 지연로드 된 하위 모듈을 등록 할 때 다음과 같이 NgModule을 만듭니다.
ru: Создает модуль со всеми директивами маршрутизатора и регистрацией маршрутов провайдером,без создания нового сервиса маршрутизатора.При регистрации субмодулей и ленивых субмодулей создайте NgModule следующим образом:

source: Creates a module with all the router directives and a provider registering routes.
es: Crea un módulo con todas las directivas del router y un proveedor que registra las rutas.
ja: すべてのルータのディレクティブとプロバイダがルートを登録するモジュールを作成します。
ko: 모든 라우터 지시문과 공급자가 경로를 등록하여 모듈을 만듭니다.
ru: Создает модуль со всеми директивами маршрутизатора и регистрацией маршрутов провайдером.

source: Creates a named animation trigger, containing a list of <code><a href="../common/upgrade/%24locationshim#state">state()</a></code> and <code><a href="transition">transition</a>()</code> entries to be evaluated when the expression bound to the trigger changes.
es: Crea un activador de animaci&oacute;n con nombre, que contiene una lista de entradas de <code><a href="../common/upgrade/%24locationshim#state">state()</a></code> y <code><a href="transition">transition</a>()</code> que se evaluar&aacute;n cuando cambie la expresi&oacute;n vinculada al activador.
ja: トリガーにバインドされた式が変更されたときに評価される <code><a href="../common/upgrade/%24locationshim#state">state()</a></code> および <code><a href="transition">transition</a>()</code> エントリーのリストを含む、名前付きのアニメーショントリガーを作成します。
ko: 트리거에 바인딩 된 표현식이 변경 될 때 평가할 <code><a href="../common/upgrade/%24locationshim#state">state()</a></code> 및 <code><a href="transition">transition</a>()</code> 항목 목록이 포함 된 명명 된 애니메이션 트리거를 만듭니다 .
ru: Создает именованный анимационный триггер, содержащий список записей <code><a href="../common/upgrade/%24locationshim#state">state()</a></code> и <code><a href="transition">transition</a>()</code> которые должны оцениваться при изменении выражения, связанного с триггером.

source: Creates a named animation trigger, containing a list of <code><a href="animations/state">state</a>()</code> and <code><a href="animations/transition">transition</a>()</code> entries to be evaluated when the expression bound to the trigger changes.
ja: トリガーにバインドされた式が変更されたときに評価される <code><a href="animations/state">state</a>()</code> および <code><a href="animations/transition">transition</a>()</code> エントリのリストを含む、名前付きアニメーショントリガーを作成します。

source: Creates a named animation trigger, containing a list of <code><a href="common/upgrade/%24locationshim#state">state()</a></code> and <code><a href="animations/transition">transition</a>()</code> entries to be evaluated when the expression bound to the trigger changes.
es: Crea un activador de animaci&oacute;n con nombre, que contiene una lista de entradas de <code><a href="common/upgrade/%24locationshim#state">state()</a></code> y <code><a href="animations/transition">transition</a>()</code> que se evaluar&aacute;n cuando cambie la expresi&oacute;n vinculada al activador.
ja: トリガーにバインドされた式が変更されたときに評価される <code><a href="common/upgrade/%24locationshim#state">state()</a></code> および <code><a href="animations/transition">transition</a>()</code> エントリーのリストを含む、名前付きのアニメーショントリガーを作成します。

source: Creates a named animation trigger, containing a list of <code><a href="state">state</a>()</code> and <code><a href="transition">transition</a>()</code> entries to be evaluated when the expression bound to the trigger changes.
ja: トリガーにバインドされた式が変更されたときに評価される <code><a href="state">state</a>()</code> および <code><a href="transition">transition</a>()</code> エントリのリストを含む、名前付きアニメーショントリガーを作成します。

source: Creates a named set of CSS styles that should be applied on successful transition to a given state. The state can then be referenced by name within other animation functions.
es: Crea un conjunto de estilos CSS que deben aplicarse en la transición exitosa a un estado determinado.El estado puede entonces ser referenciado por nombre dentro de otras funciones de animación.
ja: 指定された状態への移行に成功した際に適用されるべき CSS スタイルの名前付きセットを作成します。この状態は、他のアニメーション関数内で名前を付けて参照することができます。

source: Creates a new <code><a href="formarray">FormArray</a></code> instance.
es: Crea una nueva instancia de <code><a href="formarray">FormArray</a></code> .
ja: 新しい <code><a href="formarray">FormArray</a></code> インスタンスを作成します。

source: Creates a new <code><a href="formcontrol">FormControl</a></code> instance.
es: Crea una nueva instancia de <code><a href="formcontrol">FormControl</a></code> .
ja: 新しい <code><a href="formcontrol">FormControl</a></code> インスタンスを作成します。

source: Creates a new <code><a href="formgroup">FormGroup</a></code> instance.
es: Crea una nueva instancia de <code><a href="formgroup">FormGroup</a></code> .
ja: 新しい <code><a href="formgroup">FormGroup</a></code> インスタンスを作成します。

source: Creates a new <code>Array</code> or <code>String</code> containing a subset (slice) of the elements.
es: Crea una nueva <code>Array</code> o <code>String</code> contiene un subconjunto (corte) de los elementos.
ja: 要素のサブセット（スライス）を含む新しい <code>Array</code> または <code>String</code> を作成します。

source: Creates a new component.
es: Crea un nuevo componente.
ja: 新しいコンポーネントを作成します。

source: Creates a new generic NgModule definition in the given or default project.
es: Crea una nueva definición genérica de NgModule en el proyecto dado o por defecto.
ja: 指定したプロジェクトまたはデフォルトのプロジェクトに新しい汎用NgModule定義を作成します。

source: Creates a new generic class definition in the given or default project.
es: Crea una nueva definición de clase genérica en el proyecto dado o por defecto.
ja: 指定したプロジェクトまたはデフォルトのプロジェクトに新しい汎用クラス定義を作成します。

source: Creates a new generic component definition in the given or default project.
es: Crea una nueva definición de componente genérico en el proyecto dado o por defecto.
ja: 指定されたプロジェクトまたはデフォルトのプロジェクトに新しい汎用コンポーネント定義を作成します。

source: Creates a new generic directive definition in the given or default project.
es: Crea una nueva definición de directiva genérica en el proyecto dado o por defecto.
ja: 与えられたプロジェクトやデフォルトのプロジェクトに新しい汎用ディレクティブの定義を作成します。

source: Creates a new generic interface definition in the given or default project.
es: Crea una nueva definición de interfaz genérica en el proyecto dado o por defecto.
ja: 指定されたプロジェクトまたはデフォルトのプロジェクトに新しい汎用インターフェース定義を作成します。

source: Creates a new generic library project in the current workspace.
es: Crea un nuevo proyecto de biblioteca genérica en el espacio de trabajo actual.
ja: 現在のワークスペースに新しいジェネリック・ライブラリ・プロジェクトを作成します。

source: Creates a new generic pipe definition in the given or default project.
es: Crea una nueva definición genérica de tubería en el proyecto dado o por defecto.
ja: 指定されたプロジェクトまたはデフォルトのプロジェクトに新しい汎用パイプ定義を作成します。

source: Declaring directives
zh_cn: 宣布指令

source: Decodes an encoded URL parameter or query-string key.
zh_cn: 解码一个已编码的URL参数或查询字符串键。

source: Decodes an encoded URL parameter or query-string value.
zh_cn: 解码一个编码的URL参数或查询字符串值。

source: Decodes the hash from the provided string
zh_cn: 从提供的字符串中解码哈希值

source: Decodes the path from the provided string
zh_cn: 根据提供的字符串对路径进行解码

source: Decodes the search objects from the provided string
zh_cn: 根据提供的字符串对搜索对象进行解码

source: Decorate <code>input</code> and <code>output</code> properties
zh_cn: 装饰 <code>input</code> 和 <code>output</code> 属性

source: Decorated and data-bound class members must be public.
zh_cn: 装饰和数据绑定的类成员必须是公共的。

source: Decorated component class members must be public. You cannot make an <code>@<a href="../api/core/input">Input</a>()</code> property private or protected.
zh_cn: 装饰的组件类成员必须是公共的。您不能将 <code>@<a href="../api/core/input">Input</a>()</code> 属性设为私有或受保护。

source: Decorator that declares a DOM event to listen for, and provides a handler method to run when that event occurs.
zh_cn: 装饰器,它声明了一个DOM事件的监听,并提供了一个在该事件发生时运行的处理方法。

source: Decorator that marks a DOM property as a host-binding property and supplies configuration metadata. Angular automatically checks host property bindings during change detection, and if a binding changes it updates the host element of the directive.
zh_cn: 装饰器,将一个DOM属性标记为主机绑定属性,并提供配置元数据。Angular在变化检测过程中会自动检查host属性绑定,如果绑定发生变化,就会更新指令的host元素。

source: Decorator that marks a class as an Angular component and provides configuration metadata that determines how the component should be processed, instantiated, and used at runtime.
zh_cn: 装饰器,将一个类标记为Angular组件,并提供配置元数据,决定组件在运行时应如何处理、实例化和使用。

source: Decorator that marks a class as an Angular directive. You can define your own directives to attach custom behavior to elements in the DOM.
zh_cn: 装饰器,将一个类标记为Angular指令。你可以定义自己的指令,将自定义行为附加到DOM中的元素。

source: Decorator that marks a class as an NgModule and supplies configuration metadata.
zh_cn: 标记一个类为NgModule并提供配置元数据的装饰器。

source: Decorator that marks a class as available to be provided and injected as a dependency.
zh_cn: 装饰器,将一个类标记为可提供并作为依赖关系注入。

source: Decorator that marks a class as pipe and supplies configuration metadata.
zh_cn: 标记一个类为管道并提供配置元数据的装饰器。

source: Decorator that marks a class field as an input property and supplies configuration metadata. The input property is bound to a DOM property in the template. During change detection, Angular automatically updates the data property with the DOM property's value.
zh_cn: 装饰器,将一个类字段标记为输入属性,并提供配置元数据。输入属性被绑定到模板中的DOM属性。在变化检测时,Angular会自动用DOM属性的值更新数据属性。

source: Decorator that marks a class field as an output property and supplies configuration metadata. The DOM property bound to the output property is automatically updated during change detection.
zh_cn: 装饰器,将类字段标记为输出属性,并提供配置元数据。在检测变化的过程中,绑定到输出属性的DOM属性会自动更新。

source: Decorators are functions that modify JavaScript classes. Angular defines a number of decorators that attach specific kinds of metadata to classes, so that the system knows what those classes mean and how they should work.
zh_cn: 装饰器是修改JavaScript类的函数。Angular定义了许多装饰器,这些装饰器将特定种类的元数据附加到类中,以便系统知道这些类的含义以及它们应该如何工作。

source: Decreases the number of pending request
zh_cn: 减少待处理请求的数量

source: Default <a href="https://palantir.github.io/tslint/">TSLint</a> configuration for projects in the workspace.
zh_cn: 工作空间中项目的默认<a href="https://palantir.github.io/tslint/">TSLint</a>配置。

source: Default <a href="https://www.typescriptlang.org/">TypeScript</a> configuration for projects in the workspace.
zh_cn: 工作空间中项目的默认<a href="https://www.typescriptlang.org/">TypeScript</a>配置。

source: Default Architect builders and targets
zh_cn: 默认的建筑设计师和目标

source: Default architect configuration
zh_cn: 默认架构配置

source: Default is currently false.
zh_cn: 目前默认为false。

source: Default size-budget type and threshholds for all or parts of your app. You can configure the builder to report a warning or an error when the output reaches or exceeds a threshold size. See <a href="build#configure-size-budgets">Configure size budgets</a>. (Not available in <code>test</code> section.)
zh_cn: 应用程序全部或部分的默认大小预算类型和阈值。您可以将构建器配置为在输出达到或超过阈值大小时报告警告或错误。请参阅<a href="build#configure-size-budgets">配置大小预算</a>。（在 <code>test</code> 部分中不可用。）

source: Default: 'registerWhenStable'
zh_cn: 默认:'registerWhenStable'

source: Default: true
zh_cn: 默认:true

source: DefaultUrlSerializer uses parentheses to serialize secondary segments (e.g., popup:compose), the colon syntax to specify the outlet, and the ';parameter=value' syntax (e.g., open=true) to specify route specific parameters.
zh_cn: DefaultUrlSerializer使用括号来序列化二级段(例如,popup:compose),使用冒号语法来指定出口,使用';parameter=value'语法(例如,open=true)来指定特定路由参数。

source: Defaults to <code>prefetch</code>.
zh_cn: 默认为 <code>prefetch</code> 。

source: Defaults to the value <code>installMode</code> is set to.
zh_cn: 默认值为 <code>installMode</code> 设置为。
