Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/angular/angular.*.006.xlf
Languages: es, ja, ko, ru, zh_cn

source: CLI configuration defaults for all projects in the workspace, including configuration options for build, serve, and test tools that the CLI uses, such as <a href="https://palantir.github.io/tslint/">TSLint</a>, <a href="https://karma-runner.github.io/">Karma</a>, and <a href="http://www.protractortest.org/">Protractor</a>. For details, see <a href="workspace-config">Angular Workspace Configuration</a>.
es: La configuraci&oacute;n predeterminada de la CLI para todos los proyectos en el espacio de trabajo, incluidas las opciones de configuraci&oacute;n para las herramientas de compilaci&oacute;n, servicio y prueba que utiliza la CLI, como <a href="https://palantir.github.io/tslint/">TSLint</a> , <a href="https://karma-runner.github.io/">Karma</a> y <a href="http://www.protractortest.org/">Protractor</a> . Para obtener m&aacute;s detalles, consulte <a href="workspace-config">Configuraci&oacute;n de espacio de trabajo angular</a> .
ja: <a href="https://palantir.github.io/tslint/">TSLint</a>、<a href="https://karma-runner.github.io/">Karma</a>、<a href="http://www.protractortest.org/">Protractor</a>など、CLIが使用するビルド、サーブ、およびテストツールの構成オプションを含む、ワークスペース内のすべてのプロジェクトのCLI構成のデフォルト。詳細については、<a href="workspace-config">Angular Workspace Configurationを</a>参照してください。
ko: CLI가 사용하는 빌드, 제공 및 테스트 도구 (예 : <a href="https://palantir.github.io/tslint/">TSLint</a> , <a href="https://karma-runner.github.io/">Karma</a> 및 <a href="http://www.protractortest.org/">Protractor)에</a> 대한 구성 옵션을 포함하여 작업 공간의 모든 프로젝트에 대한 CLI 구성 기본값입니다 . 세부 사항은 <a href="workspace-config">각도 작업 공간 구성을</a> 참조하십시오 .
ru: Параметры конфигурации CLI по умолчанию для всех проектов в рабочей области, включая параметры конфигурации для инструментов сборки, обслуживания и тестирования, которые использует CLI, такие как <a href="https://palantir.github.io/tslint/">TSLint</a> , <a href="https://karma-runner.github.io/">Karma</a> и <a href="http://www.protractortest.org/">Protractor</a> . Для получения дополнительной информации см. <a href="workspace-config">Конфигурация углового рабочего пространства</a> .

source: CLI-generated tests
es: Las pruebas generadas por el CLI
ja: CLI生成テスト
ko: CLI 생성 테스트
ru: сгенерированные CLI тесты

source: CSS @imports
es: CSS @importes
ru: CSS @импорты

source: CSS classes applied
es: Las clases de CSS aplicadas
ja: 適用されるCSSクラス
ko: CSS 클래스 적용
ru: применяемые классы CSS

source: CSS grid layout support in Autoprefixer, which was previously on by default, is off by default in Angular 8 and higher.
es: El soporte de diseño de cuadrículas CSS en el Autoprefixer,que antes estaba activado por defecto,está desactivado por defecto en Angular 8 y superior.
ja: これまでデフォルトでオンになっていたAutoprefixerのCSSグリッドレイアウトサポートが、Angular 8以降ではデフォルトでオフになっています。
ko: 이전에 기본적으로 설정되어 있던 Autoprefixer의 CSS 그리드 레이아웃 지원은 Angular 8 이상에서 기본적으로 해제되어 있습니다.
ru: Поддержка раскладки сетки CSS в Автопрефиксере,которая ранее была включена по умолчанию,отключена по умолчанию в Угловой 8 и выше.

source: Caching HTTP requests
ja: HTTP リクエストのキャッシュ
ko: HTTP 요청 캐싱
ru: Кэширование HTTP-запросов

source: Caching an application is like installing a native application. The application is cached as one unit, and all files update together.
es: El almacenamiento en caché de una aplicación es como instalar una aplicación nativa.La aplicación se almacena en caché como una unidad,y todos los archivos se actualizan juntos.
ja: アプリケーションのキャッシュは、ネイティブアプリケーションをインストールするようなものです。アプリケーションは一つのユニットとしてキャッシュされ、すべてのファイルが一緒に更新されます。
ko: 응용 프로그램 캐싱은 기본 응용 프로그램 설치와 같습니다. 응용 프로그램은 하나의 단위로 캐시되며 모든 파일이 함께 업데이트됩니다.
ru: Кэширование приложения подобно установке родного приложения.Приложение кэшируется как единое целое,и все файлы обновляются вместе.

source: Caching behavior; for example, <code>If-Modified-Since</code>
es: Comportamiento de almacenamiento en cach&eacute;; por ejemplo, <code>If-Modified-Since</code>
ja: キャッシュ動作; たとえば、 <code>If-Modified-Since</code>
ko: 캐싱 동작; 예를 들어 <code>If-Modified-Since</code>
ru: Кеширование поведения; например, <code>If-Modified-Since</code>

source: Caching layers in between the origin server and the end user could serve stale content.
es: Las capas de almacenamiento en caché entre el servidor de origen y el usuario final podrían servir contenido rancio.
ja: オリジンサーバーとエンドユーザーの間にあるキャッシュ層は、陳腐なコンテンツを提供する可能性があります。
ko: 오리진 서버와 최종 사용자 사이에 계층을 캐시하면 오래된 컨텐츠를 제공 할 수 있습니다.
ru: Уровни кэширования между исходным сервером и конечным пользователем могут обслуживать несвежее содержимое.

source: Call <code><a href="../api/core/testing/testbed">TestBed</a></code> methods <em>within</em> a <code>beforeEach()</code> to ensure a fresh start before each individual test.
es: Llamada <code><a href="../api/core/testing/testbed">TestBed</a></code> m&eacute;todos <em>dentro de</em> un <code>beforeEach()</code> para garantizar un nuevo comienzo antes de cada prueba individual.
ja: コールは、 <code><a href="../api/core/testing/testbed">TestBed</a></code> のメソッド<em>内で</em> <code>beforeEach()</code> 個々のテストの前に新たなスタートを確実にするために。
ko: <code>beforeEach()</code> <em>내</em> 에서 <code><a href="../api/core/testing/testbed">TestBed</a></code> 메소드를 호출 하여 각 개별 테스트 전에 새로 시작하십시오.<em></em>
ru: Вызов <code><a href="../api/core/testing/testbed">TestBed</a></code> методы <em>внутри</em> в <code>beforeEach()</code> , чтобы обеспечить новый старт перед каждым отдельным испытанием.

source: Call <code>configureTestingModule</code> to refine the testing module configuration for a particular set of tests by adding and removing imports, declarations (of components, directives, and pipes), and providers.
es: Llame a <code>configureTestingModule</code> para refinar la configuraci&oacute;n del m&oacute;dulo de prueba para un conjunto particular de pruebas agregando y eliminando importaciones, declaraciones (de componentes, directivas y tuber&iacute;as) y proveedores.
ja: <code>configureTestingModule</code> を呼び出して、インポート、（コンポーネント、ディレクティブ、パイプの）宣言、およびプロバイダーを追加および削除して、特定のテストセットのテストモジュール構成を調整します。
ko: <code>configureTestingModule</code> 요소, 지시문 및 파이프의 가져 오기, 선언 및 제공자를 추가 및 제거하여 특정 테스트 세트에 대한 테스트 모듈 구성 을 세분화하려면 configureTestingModule 을 호출하십시오 .
ru: Вызовите <code>configureTestingModule</code> , чтобы уточнить конфигурацию модуля тестирования для определенного набора тестов, добавив и удалив импорт, объявления (компонентов, директив и каналов) и поставщиков.

source: Call <code>request.flush()</code> with an error message, as seen in the following example.
es: Llame a <code>request.flush()</code> con un mensaje de error, como se ve en el siguiente ejemplo.
ja: 次の例に示すように、エラーメッセージを指定して <code>request.flush()</code> を呼び出します。
ko: 다음 예제와 같이 <code>request.flush()</code> 를 오류 메시지와 함께 호출하십시오 .
ru: Вызовите <code>request.flush()</code> с сообщением об ошибке, как показано в следующем примере.

source: Call it in <code>ngOnInit()</code>
es: Ll&aacute;malo en <code>ngOnInit()</code>
ja: <code>ngOnInit()</code> で呼び出す
ko: <code>ngOnInit()</code> 에서 호출
ru: Вызовите это в <code>ngOnInit()</code>

source: Call it to initialize the component (it calls <code>ngOnInit</code>) and after your test code, change the component's data bound property values. Angular can't see that you've changed <code>personComponent.name</code> and won't update the <code>name</code> binding until you call <code>detectChanges</code>.
es: Ll&aacute;melo para inicializar el componente (llama a <code>ngOnInit</code> ) y despu&eacute;s de su c&oacute;digo de prueba, cambie los valores de propiedad vinculados a datos del componente. Angular no puede ver que ha cambiado <code>personComponent.name</code> y no actualizar&aacute; el enlace de <code>name</code> hasta que llame a <code>detectChanges</code> .
ja: これを呼び出してコンポーネントを初期化し（ <code>ngOnInit</code> を呼び出します）、テストコードの後で、コンポーネントのデータバインドプロパティ値を変更します。Angularは <code>personComponent.name</code> を変更したことを認識できず、 <code>detectChanges</code> を呼び出すまで <code>name</code> バインディングを更新しません。
ko: 컴포넌트를 초기화하고 ( <code>ngOnInit</code> 호출 ) 테스트 코드 후에 컴포넌트의 데이터 바인딩 된 속성 값을 변경하십시오. 각도는 변경 한 것을 볼 수 <code>personComponent.name</code> 을 하고, 업데이트되지 않습니다 <code>name</code> 이 호출 할 때까지 바인딩 <code>detectChanges</code> 을 .
ru: Вызовите его, чтобы инициализировать компонент (он вызывает <code>ngOnInit</code> ), и после своего тестового кода измените значения свойства компонента, связанные с данными. Angular не может видеть, что вы изменили <code>personComponent.name</code> , и не будет обновлять привязку <code>name</code> пока вы не <code>detectChanges</code> .

source: Call within an animation <code><a href="sequence">sequence</a>()</code>, <code><a href="group">group()</a></code>, or <code><a href="transition">transition</a>()</code> call to specify an animation step that applies given style data to the parent animation for a given amount of time.
es: Llame dentro de una <code><a href="sequence">sequence</a>()</code> animaci&oacute;n () , <code><a href="group">group()</a></code> o llamada de <code><a href="transition">transition</a>()</code> para especificar un paso de animaci&oacute;n que aplique datos de estilo dados a la animaci&oacute;n principal durante un per&iacute;odo de tiempo determinado.
ja: アニメーション <code><a href="sequence">sequence</a>()</code> 、 <code><a href="group">group()</a></code> 、または <code><a href="transition">transition</a>()</code> 呼び出し内で呼び出して、指定された時間の間、指定されたスタイルデータを親アニメーションに適用するアニメーションステップを指定します。
ko: 애니메이션 <code><a href="sequence">sequence</a>()</code> , <code><a href="group">group()</a></code> 또는 <code><a href="transition">transition</a>()</code> 호출 내에서 지정된 스타일 데이터를 주어진 시간 동안 부모 애니메이션에 적용하는 애니메이션 단계를 지정하기 위해 호출합니다.
ru: Вызвать в вызове <code><a href="sequence">sequence</a>()</code> , <code><a href="group">group()</a></code> или <code><a href="transition">transition</a>()</code> анимации, чтобы указать шаг анимации, который применяет данные данного стиля к родительской анимации в течение заданного промежутка времени.

source: Callback that is invoked when the event is triggered.
ja: イベントがトリガーされたときに呼び出されるコールバック。
ko: 이벤트가 트리거 될 때 호출되는 콜백입니다.
ru: Обратный вызов,который вызывается при срабатывании события.

source: Callbacks can serve as a debugging tool, for example in conjunction with <code>console.warn()</code> to view the application's progress in a browser's Developer JavaScript Console. The following code snippet creates console log output for our original example, a button with the two states of <code>open</code> and <code>closed</code>.
es: Las devoluciones de llamada pueden servir como una herramienta de depuraci&oacute;n, por ejemplo, en combinaci&oacute;n con <code>console.warn()</code> para ver el progreso de la aplicaci&oacute;n en la Consola JavaScript de desarrollador de un navegador. El siguiente fragmento de c&oacute;digo crea la salida del registro de la consola para nuestro ejemplo original, un bot&oacute;n con los dos estados de <code>open</code> y <code>closed</code> .
ja: コールバックは、たとえば <code>console.warn()</code> と組み合わせて、ブラウザーの開発者JavaScriptコンソールでアプリケーションの進行状況を表示するデバッグツールとして機能できます。次のコードスニペットは、元の例のコンソールログ出力、 <code>open</code> と <code>closed</code> の 2つの状態を持つボタンを作成します。
ko: 콜백은 예를 들어 <code>console.warn()</code> 과 함께 디버깅 도구 로 사용되어 브라우저의 개발자 JavaScript 콘솔에서 응용 프로그램의 진행 상황을 볼 수 있습니다. 다음 코드 스 니펫은 원래 예제에 대한 콘솔 로그 출력 (두 가지 상태가 <code>open</code> 및 <code>closed</code> 인 버튼)을 작성합니다 .
ru: Обратные вызовы могут служить инструментом отладки, например, в сочетании с <code>console.warn()</code> для просмотра прогресса приложения в консоли JavaScript разработчика браузера. Следующий фрагмент кода создает вывод журнала консоли для нашего исходного примера - кнопку с двумя состояниями: <code>open</code> и <code>closed</code> .

source: Callbacks can serve as a debugging tool, for example in conjunction with <code>console.warn()</code> to view the application's progress in a browser's Developer JavaScript Console. The following code snippet creates console log output for the original example, a button with the two states of <code>open</code> and <code>closed</code>.
ja: コールバックは、たとえば <code>console.warn()</code> と組み合わせてデバッグツールとして機能し、ブラウザーのDeveloper JavaScriptConsoleでアプリケーションの進行状況を表示できます。次のコードスニペットは、元の例のコンソールログ出力（ <code>open</code> と <code>closed</code> いる状態の2つのボタン）を作成します。
ko: 콜백은 브라우저의 개발자 자바 스크립트 콘솔에서 애플리케이션의 진행 상황을보기 위해 <code>console.warn()</code> 과 함께 디버깅 도구 역할을 할 수 있습니다 . 다음 코드 스 니펫은 원래 예제에 대한 콘솔 로그 출력 ( <code>open</code> 및 <code>closed</code> 의 두 가지 상태가있는 버튼)을 생성합니다 .
ru: Обратные вызовы могут служить инструментом отладки, например, в сочетании с <code>console.warn()</code> для просмотра хода выполнения приложения в консоли разработчика JavaScript в браузере. Следующий фрагмент кода создает вывод журнала консоли для исходного примера, кнопку с двумя состояниями: <code>open</code> и <code>closed</code> .

source: Called <em>just before</em> Angular destroys the directive/component.
es: Llamado <em>justo antes de que</em> Angular destruya la directiva / componente.
ja: Angularがディレクティブ/コンポーネントを破棄する<em>直前に</em>呼び出されます。
ko: Angular가 지시문 / 구성 요소를 파괴 <em>하기 직전에</em> 호출 됩니다.
ru: Вызывается <em>непосредственно перед тем, как</em> Angular уничтожит директиву / компонент.

source: Called <em>once</em> after the first <code>ngAfterContentChecked()</code>.
es: Llamado <em>una vez</em> despu&eacute;s del primer <code>ngAfterContentChecked()</code> .
ja: 最初の <code>ngAfterContentChecked()</code> の後で1 <em>回</em>呼び出されます。
ko: 첫 번째 <code>ngAfterContentChecked()</code> 이후 <em>한 번</em> 호출 됩니다.
ru: Вызывается <em>один раз</em> после первого <code>ngAfterContentChecked()</code> .

source: Called <em>once</em> after the first <code>ngDoCheck()</code>.
es: Llamado <em>una vez</em> despu&eacute;s del primer <code>ngDoCheck()</code> .
ja: 最初の <code>ngDoCheck()</code> の後で1 <em>回</em>呼び出されます。
ko: 첫 번째 <code>ngDoCheck()</code> 이후 <em>한 번</em> 호출 됩니다.
ru: Вызывается <em>один раз</em> после первого <code>ngDoCheck()</code> .

source: Called <em>once</em>, after the <em>first</em><code>ngOnChanges()</code>.
es: Llamado <em>una vez</em> , despu&eacute;s de los <em>primeros </em> <code>ngOnChanges()</code> .
ja: <em>最初の</em> <code>ngOnChanges()</code> の後で<em>1 </em><em>回</em>呼び出されます。<em></em>
ko: <em>첫 번째 </em> <code>ngOnChanges()</code> 다음에 <em>한 번</em> 호출 됩니다.<em></em>
ru: Вызывается <em>один раз</em> , после <em>первого </em> <code>ngOnChanges()</code> .

source: Called after <code>ngAfterContentInit()</code> and every subsequent <code>ngDoCheck()</code>.
ja: 後に呼び出され <code>ngAfterContentInit()</code> と後続のすべての <code>ngDoCheck()</code> 。
ko: <code>ngAfterContentInit()</code> 및 모든 후속 <code>ngDoCheck()</code> 이후에 호출 됩니다.
ru: Вызывается после <code>ngAfterContentInit()</code> и каждого последующего <code>ngDoCheck()</code> .

source: Called after <code>ngAfterContentInit</code> when the component's views and child views / the view that a directive is in has been initialized.
es: Se <code>ngAfterContentInit</code> despu&eacute;s de ngAfterContentInit cuando se inicializan las vistas del componente y las vistas secundarias / la vista en la que se encuentra una directiva.
ja: コンポーネントのビューと子ビュー/ディレクティブが含まれるビューが初期化されたときに <code>ngAfterContentInit</code> の後に呼び出されます。
ko: 구성 요소의 뷰와 자식 뷰 / 지시문이있는 뷰가 초기화되면 <code>ngAfterContentInit</code> 이후에 호출 됩니다.
ru: Вызывается после <code>ngAfterContentInit</code> , когда инициализируются представления компонента и дочерние представления / представление, в котором находится директива.

source: Called after <code>ngOnInit</code> when the component's or directive's content has been initialized.
es: Se llama despu&eacute;s de <code>ngOnInit</code> cuando el contenido del componente o la directiva se ha inicializado.
ja: コンポーネントまたはディレクティブのコンテンツが初期化されたときに <code>ngOnInit</code> の後に呼び出されます。
ko: 구성 요소 또는 지시문의 내용이 초기화 될 때 <code>ngOnInit</code> 이후에 호출 됩니다.
ru: Вызывается после <code>ngOnInit</code> , когда содержимое компонента или директивы было инициализировано.

source: Called after every change to input properties and before processing content or child views.
es: Llamado después de cada cambio en las propiedades de entrada y antes de procesar el contenido o las vistas de los niños.
ja: 入力プロパティを変更した後、コンテンツや子ビューを処理する前に呼び出されます。
ko: 입력 속성을 변경할 때마다 그리고 내용 또는 자식 뷰를 처리하기 전에 호출됩니다.
ru: Вызывается после каждого изменения свойств ввода и перед обработкой контента или дочерних представлений.

source: Called after every check of the component's or directive's content.
es: Llamado después de cada comprobación del contenido del componente o de la directiva.
ja: コンポーネントやディレクティブの内容をチェックするたびに呼び出されます。
ko: 구성 요소 또는 지시문의 내용을 확인할 때마다 호출됩니다.
ru: Вызывается после каждой проверки содержимого компонента или директивы.

source: Called after every check of the component's views and child views / the view that a directive is in.
es: Llamado después de cada comprobación de los puntos de vista del componente y de los niños/el punto de vista en el que se encuentra una directiva.
ja: コンポーネントのビューと子ビュー/ディレクティブが存在するビューをチェックした後に呼び出されます。
ko: 컴포넌트의 뷰와 자식 뷰 / 지시문이있는 뷰를 점검 할 때마다 호출됩니다.
ru: Вызывается после каждой проверки представлений компонента и дочерних представлений/представлений,в которых находится директива.

source: Called after the <code><a href="../api/forms/ngform#ngAfterViewInit">ngAfterViewInit()</a></code> and every subsequent <code>ngAfterContentChecked()</code>.
es: Llamado despu&eacute;s de <code><a href="../api/forms/ngform#ngAfterViewInit">ngAfterViewInit()</a></code> y cada <code>ngAfterContentChecked()</code> posterior .
ja: 後に呼び出され <code><a href="../api/forms/ngform#ngAfterViewInit">ngAfterViewInit()</a></code> と後続のすべての <code>ngAfterContentChecked()</code> 。
ko: 애프터 호출 <code><a href="../api/forms/ngform#ngAfterViewInit">ngAfterViewInit()</a></code> 및 이후의 모든 <code>ngAfterContentChecked()</code> .
ru: Вызывается после <code><a href="../api/forms/ngform#ngAfterViewInit">ngAfterViewInit()</a></code> и каждого последующего <code>ngAfterContentChecked()</code> .

source: Called after the <code><a href="../api/router/routerlinkactive#ngAfterContentInit">ngAfterContentInit()</a></code> and every subsequent <code>ngDoCheck()</code>.
es: Llamado despu&eacute;s de <code><a href="../api/router/routerlinkactive#ngAfterContentInit">ngAfterContentInit()</a></code> y cada <code>ngDoCheck()</code> posterior .
ja: 後に呼び出され <code><a href="../api/router/routerlinkactive#ngAfterContentInit">ngAfterContentInit()</a></code> と後続のすべての <code>ngDoCheck()</code> 。
ko: 애프터 호출 <code><a href="../api/router/routerlinkactive#ngAfterContentInit">ngAfterContentInit()</a></code> 및 이후의 모든 <code>ngDoCheck()</code> .
ru: Вызывается после <code><a href="../api/router/routerlinkactive#ngAfterContentInit">ngAfterContentInit()</a></code> и каждого последующего <code>ngDoCheck()</code> .

source: Called after the <code>ngAfterViewInit()</code> and every subsequent <code>ngAfterContentChecked()</code>.
ja: 後に呼び出され <code>ngAfterViewInit()</code> と後続のすべての <code>ngAfterContentChecked()</code> 。
ko: 애프터 호출 <code>ngAfterViewInit()</code> 및 이후의 모든 <code>ngAfterContentChecked()</code> .
ru: Вызывается после <code>ngAfterViewInit()</code> и каждого последующего <code>ngAfterContentChecked()</code> .

source: Called after the constructor, initializing input properties, and the first call to <code>ngOnChanges</code>.
es: Llamado despu&eacute;s del constructor, inicializando las propiedades de entrada y la primera llamada a <code>ngOnChanges</code> .
ja: コンストラクター、入力プロパティの初期化、および <code>ngOnChanges</code> の最初の呼び出しの後に呼び出されます。
ko: 생성자 뒤에서 입력 속성을 초기화하고 <code>ngOnChanges</code> 에 대한 첫 번째 호출을 호출합니다 .
ru: Вызывается после конструктора, инициализации входных свойств и первого вызова <code>ngOnChanges</code> .

source: Called before <code>ngOnInit()</code> and whenever one or more data-bound input properties change.
es: Llamado antes de <code>ngOnInit()</code> y cada vez que cambian una o m&aacute;s propiedades de entrada enlazadas a datos.
ja: <code>ngOnInit()</code> の前、および1つ以上のデータバインド入力プロパティが変更されるたびに呼び出されます。
ko: <code>ngOnInit()</code> 전에 호출 되고 하나 이상의 데이터 바인딩 된 입력 속성이 변경 될 때마다 호출 됩니다.
ru: Вызывается перед <code>ngOnInit()</code> и всякий раз, когда изменяется одно или несколько связанных с данными входных свойств.

source: Called before any other lifecycle hook. Use it to inject dependencies, but avoid any serious work here.
es: Llamado antes que cualquier otro gancho del ciclo de vida.Úsalo para inyectar dependencias,pero evita cualquier trabajo serio aquí.
ja: 他のライフサイクルフックの前に呼び出されます。依存関係を注入するために使用しますが、ここでの深刻な作業は避けてください。
ko: 다른 라이프 사이클 후크 전에 호출됩니다. 의존성을 주입하는 데 사용하지만 심각한 작업은 피하십시오.
ru: Вызывается перед любым другим крюком на протяжении жизненного цикла.Используйте его для впрыскивания зависимостей,но избегайте любой серьезной работы здесь.

source: Called during every change detection run, immediately after <code>ngOnChanges()</code> and <code>ngOnInit()</code>.
es: Se llama durante cada ejecuci&oacute;n de detecci&oacute;n de cambio, inmediatamente despu&eacute;s de <code>ngOnChanges()</code> y <code>ngOnInit()</code> .
ja: <code>ngOnChanges()</code> および <code>ngOnInit()</code> の直後に、すべての変更検出の実行中に呼び出されます。
ko: 모든 변경 감지 실행 중에 <code>ngOnChanges()</code> 및 <code>ngOnInit()</code> 직후에 호출됩니다 .
ru: Вызывается во время каждого запуска обнаружения изменений, сразу после <code>ngOnChanges()</code> и <code>ngOnInit()</code> .

source: Called every time that the input properties of a component or a directive are checked. Use it to extend change detection by performing a custom check.
es: Llamado cada vez que se comprueban las propiedades de entrada de un componente o una directiva.Se usa para extender la detección de cambios realizando una comprobación personalizada.
ja: コンポーネントやディレクティブの入力プロパティがチェックされるたびに呼び出されます。カスタムチェックを行うことで変更検出を拡張するために使用します。
ko: 구성 요소 또는 지시문의 입력 특성을 확인할 때마다 호출됩니다. 사용자 정의 점검을 수행하여 변경 감지를 확장하려면이를 사용하십시오.
ru: Вызывается каждый раз при проверке входных свойств компонента или директивы.Используется для расширения возможности обнаружения изменений путем выполнения пользовательской проверки.

source: Called immediately after <code>ngOnChanges()</code> on every change detection run, and immediately after <code>ngOnInit()</code> on the first run.
ja: 直後に呼び出され <code>ngOnChanges()</code> すべての変更検出の実行上、および直後 <code>ngOnInit()</code> 最初の実行で。
ko: 후 즉시 호출 <code>ngOnChanges()</code> 모든 변경 감지 실행에, 그리고 직후 <code>ngOnInit()</code> 첫 번째 실행에.
ru: Вызывается сразу после <code>ngOnChanges()</code> при каждом запуске обнаружения изменений и сразу после <code>ngOnInit()</code> при первом запуске.

source: Called immediately before Angular destroys the directive or component.
ja: Angular がディレクティブやコンポーネントを破棄する直前に呼び出されます。
ko: Angular가 지시문 또는 구성 요소를 파괴하기 직전에 호출됩니다.
ru: Вызывается непосредственно перед уничтожением директивы или компонента Angular.

source: Called once, after the first <code>ngOnChanges()</code>.
ja: 最初の <code>ngOnChanges()</code> の後に1回呼び出されます。
ko: 첫 번째 <code>ngOnChanges()</code> 이후에 한 번 호출 됩니다.
ru: Вызывается один раз после первого <code>ngOnChanges()</code> .

source: Called once, before the instance is destroyed.
es: Llamado una vez,antes de que la instancia sea destruida.
ja: インスタンスが破棄される前に一度だけ呼び出されます。
ko: 인스턴스가 파괴되기 전에 한 번 호출됩니다.
ru: Звонили один раз,пока экземпляр не был уничтожен.
