Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/angular/angular.*.006.xlf
Languages: es, ja, ko, ru, zh_cn

source: Errors that occur within the service worker will be logged here.
zh_cn: 在服务工作者内部发生的错误将被记录在这里。

source: Evaluation of a template expression should have no visible side effects. The expression language itself, or the way you write template expressions, helps to a certain extent; you can't assign a value to anything in a property binding expression nor use the increment and decrement operators.
zh_cn: 模板表达式的评估应该没有明显的副作用。表达式语言本身,或者说你写模板表达式的方式在一定程度上有帮助,你不能在属性绑定表达式中给任何东西赋值,也不能使用增量和减量运算符。

source: Even a small form such as this one can produce a mess of tortured conditional setup and CSS element selection.
zh_cn: 即使是像这样的小表单,也会产生一团折磨人的条件设置和CSS元素选择。

source: Even accounting for these differences you can still have dependency injection interoperability. <code><a href="../api/upgrade/static">upgrade/static</a></code> resolves the differences and makes everything work seamlessly:
zh_cn: 即使考虑了这些差异，您仍然可以具有依赖项注入互操作性。 <code><a href="../api/upgrade/static">upgrade/static</a></code> 解决了差异，并使所有工作无缝进行：

source: Even across a fast reliable network, round-trip delays can introduce significant latency when loading the application. Using a service worker to reduce dependency on the network can significantly improve the user experience.
zh_cn: 即使在快速可靠的网络中,加载应用时的往返延迟也会带来明显的延迟。使用服务工作者来减少对网络的依赖,可以显著改善用户体验。

source: Even though the components declared by <code>SharedModule</code> might not bind with <code>[(<a href="../api/forms/ngmodel">ngModel</a>)]</code> and there may be no need for <code>SharedModule</code> to import <code><a href="../api/forms/formsmodule">FormsModule</a></code>, <code>SharedModule</code> can still export <code><a href="../api/forms/formsmodule">FormsModule</a></code> without listing it among its <code>imports</code>. This way, you can give other modules access to <code><a href="../api/forms/formsmodule">FormsModule</a></code> without having to import it directly into the <code>@<a href="../api/core/ngmodule">NgModule</a></code> decorator.
zh_cn: 即使 <code>SharedModule</code> 声明的组件可能未与 <code>[(<a href="../api/forms/ngmodel">ngModel</a>)]</code> 绑定，并且可能不需要 <code>SharedModule</code> 导入 <code><a href="../api/forms/formsmodule">FormsModule</a></code> ， <code>SharedModule</code> 仍可以导出 <code><a href="../api/forms/formsmodule">FormsModule</a></code> 而不在其 <code>imports</code> 列出它。这样，您可以授予其他模块对 <code><a href="../api/forms/formsmodule">FormsModule</a></code> 的访问权限，而不必直接将其导入到 <code>@<a href="../api/core/ngmodule">NgModule</a></code> 装饰器中。

source: Even thought the component is instantiated in AngularJS, it will be using Angular syntax. This has to be done, this way because we must follow Angular components do not declare how the attributes should be interpreted.
zh_cn: 即使以为组件是在AngularJS中实例化的,它也会使用Angular语法。这是必须要做的,这样做是因为我们必须遵循Angular组件没有声明的属性应该如何解释。

source: Event and property
zh_cn: 活动和财产

source: Event binding
zh_cn: 事件绑定

source: Event binding <code>( )</code>
zh_cn: 事件绑定 <code>( )</code>

source: Event binding <code>(event)</code>
zh_cn: 事件绑定 <code>(event)</code>

source: Event binding allows you to listen for certain events such as keystrokes, mouse movements, clicks, and touches. For an example demonstrating all of the points in this section, see the <span name="event-binding">event binding example</span>.
zh_cn: 通过事件绑定，您可以侦听某些事件，例如按键，鼠标移动，点击和触摸。有关演示本节中所有要点的示例，请参见<span name="event-binding">事件绑定示例</span>。

source: Event emitter for producing the <code>ngModelChange</code> event after the view model updates.
zh_cn: 更新视图模型后，用于产生 <code>ngModelChange</code> 事件的事件发射器。

source: Event emitter for the "ngSubmit" event
zh_cn: ngSubmit "事件的事件发射器。

source: Event: <code>&lt;comp (close)="doSomething()"&gt;</code>
zh_cn: 事件： <code>&lt;comp (close)="doSomething()"&gt;</code>

source: Events API
zh_cn: 活动API

source: Eventually you'll get them from a remote data server. For now, you'll create some <em>mock heroes</em> and pretend they came from the server.
zh_cn: 最终，您将从远程数据服务器获得它们。现在，您将创建一些<em>模拟英雄，</em>并假装它们来自服务器。

source: Every Angular app has a <em>root module</em>, conventionally named <code>AppModule</code>, which provides the bootstrap mechanism that launches the application. An app typically contains many functional modules.
zh_cn: 每个Angular应用程序都有一个<em>根模块</em>，通常称为 <code>AppModule</code> ，它提供启动应用程序的引导机制。一个应用程序通常包含许多功能模块。

source: Every Angular app has at least one NgModule class, <a href="bootstrapping">the <em>root module</em></a>, which is conventionally named <code>AppModule</code> and resides in a file named <code>app.module.ts</code>. You launch your app by <em>bootstrapping</em> the root NgModule.
zh_cn: 每个Angular应用程序都有至少一个NgModule类，<a href="bootstrapping">即<em>根模块</em></a>，该类通常名为 <code>AppModule</code> ,并且驻留在名为 <code>app.module.ts</code> 的文件中。通过<em>引导</em>根NgModule 启动应用<em>程序</em>。

source: Every Angular app has at least one module, the root module. You <a href="bootstrapping">bootstrap</a> that module to launch the application.
zh_cn: 每个Angular应用都有至少一个模块，即根模块。您<a href="bootstrapping">引导</a>该模块以启动应用程序。

source: Every Angular application has a root module. By convention, the class is called <code>AppModule</code> and resides in a file named <code>app.module.ts</code>.
zh_cn: 每个Angular应用程序都有一个根模块。按照惯例，该类称为 <code>AppModule</code> ,并且驻留在名为 <code>app.module.ts</code> 的文件中。

source: Every Angular application has at least one component, the <em>root component</em> that connects a component hierarchy with the page document object model (DOM). Each component defines a class that contains application data and logic, and is associated with an HTML <em>template</em> that defines a view to be displayed in a target environment.
zh_cn: 每个Angular应用程序都有至少一个组件，该<em>根组件</em>将组件层次结构与页面文档对象模型（DOM）连接起来。每个组件都定义一个包含应用程序数据和逻辑的类，并且与一个HTML <em>模板</em>相关联，该HTML <em>模板</em>定义了要在目标环境中显示的视图。

source: Every app is different. Developers have various levels of experience and comfort with the available choices. Some suggestions and guidelines appear to have wide appeal.
zh_cn: 每个应用程序都是不同的。开发者对现有的选择有不同程度的经验和舒适度。一些建议和准则似乎具有广泛的吸引力。

source: Every application starts out with what seems like a simple task: get data, transform them, and show them to users. Getting data could be as simple as creating a local variable or as complex as streaming data over a WebSocket.
zh_cn: 每个应用程序都是以看似简单的任务开始的:获取数据,转换数据,并将其显示给用户。获取数据可以像创建一个本地变量一样简单,也可以像通过WebSocket流式传输数据一样复杂。

source: Every component must be declared in <em>exactly one</em><a href="../guide/ngmodules">NgModule</a>.
zh_cn: 每个组件都必须在<em>一个</em><a href="../guide/ngmodules">NgModule中</a>声明。

source: Every guide document must have a title.
zh_cn: 每一份指导性文件都必须有一个标题。

source: Every guide page file is stored in the <code>content/guide</code> directory. Although the <a href="docs-style-guide#navigation">side navigation</a> panel displays as a hierarchy, the directory is flat with no sub-folders. The flat folder approach allows us to shuffle the apparent navigation structure without moving page files or redirecting old page URLs.
zh_cn: 每个指南页面文件都存储在 <code>content/guide</code> 目录中。尽管<a href="docs-style-guide#navigation">侧面导航</a>面板显示为层次结构，但目录是平坦的，没有子文件夹。平面文件夹方法使我们能够在不移动页面文件或重定向旧页面URL的情况下改组明显的导航结构。

source: Every node in the route tree is an <code><a href="activatedroute">ActivatedRoute</a></code> instance that knows about the "consumed" URL segments, the extracted parameters, and the resolved data. Use the <code><a href="activatedroute">ActivatedRoute</a></code> properties to traverse the tree from any node.
zh_cn: 路由树中的每个节点都是 <code><a href="activatedroute">ActivatedRoute</a></code> 实例，该实例了解&ldquo;消耗的&rdquo; URL段，提取的参数和解析的数据。使用 <code><a href="activatedroute">ActivatedRoute</a></code> 属性可以从任何节点遍历树。

source: Every progress event triggers change detection, so only turn them on if you truly intend to report progress in the UI.
zh_cn: 每个进度事件都会触发变化检测,所以只有当你真正打算在用户界面中报告进度时,才会打开它们。

source: Every public member of a <strong>source</strong> directive is automatically available for binding. You don't have to do anything special to access a directive member in a template expression or statement.
zh_cn: <strong>Source</strong>指令的每个公共成员都可以自动进行绑定。您无需执行任何特殊操作即可访问模板表达式或语句中的指令成员。

source: Every section header tag is also an anchor point. Another guide page could add a link to this section by writing:
zh_cn: 每一个版块的头部标签也是一个锚点。另一个引导页可以写上本节的链接。

source: Every time the user opens or refreshes the application, the Angular service worker checks for updates to the app by looking for updates to the <code>ngsw.json</code> manifest. If an update is found, it is downloaded and cached automatically, and will be served the next time the application is loaded.
zh_cn: 每次用户打开或刷新应用程序时，Angular服务工作人员都会通过查找 <code>ngsw.json</code> 清单的更新来检查应用程序的更新。如果找到更新，则会自动下载并缓存该更新，并将在下次加载应用程序时将其提供。

source: Every time the user types in the textbox, the binding calls <code><a href="../api/common/upgrade/%24locationshim#search">search()</a></code> with the textbox value, a "search term". The <code>searchTerms</code> becomes an <code>Observable</code> emitting a steady stream of search terms.
zh_cn: 每次用户在文本框中键入内容时，绑定都会使用文本框值（即&ldquo;搜索字词&rdquo; <code><a href="../api/common/upgrade/%24locationshim#search">search()</a></code> 调用search（）。所述 <code>searchTerms</code> 成为 <code>Observable</code> 发光搜索项的稳定流。

source: Every time the value of a form control changes, Angular runs validation and generates either a list of validation errors, which results in an INVALID status, or null, which results in a VALID status.
zh_cn: 每当表单控件的值发生变化时,Angular都会运行验证,并生成验证错误列表,结果是invalid状态,或者是null,结果是valid状态。

source: Every view that matches is rendered.
zh_cn: 每一个匹配的视图都会呈现。

source: Everything <em>outside</em> the <code><a href="../api/common/ngforof">ngFor</a></code> string stays with the host element (the <code>&lt;div&gt;</code>) as it moves inside the <code>&lt;ng-template&gt;</code>. In this example, the <code>[<a href="../api/common/ngclass">ngClass</a>]="<a href="../api/common/ngforofcontext#odd">odd</a>"</code> stays on the <code>&lt;div&gt;</code>.
zh_cn: <code><a href="../api/common/ngforof">ngFor</a></code> 字符串<em>之外</em>的所有内容都随宿主元素（ <code>&lt;div&gt;</code> ）一起在 <code>&lt;ng-template&gt;</code> 内部移动。在此示例中， <code>[<a href="../api/common/ngclass">ngClass</a>]="<a href="../api/common/ngforofcontext#odd">odd</a>"</code> <a href="../api/common/ngclass">ngClass</a> ] =&ldquo; <a href="../api/common/ngforofcontext#odd">奇数</a> &rdquo;保留在 <code>&lt;div&gt;</code> 上。

source: Everything DOM and browser related, especially the pieces that help render into the DOM. This package also includes the <code><a href="../api/core/platformref#bootstrapModuleFactory">bootstrapModuleFactory()</a></code> method for bootstrapping applications for production builds that pre-compile with <a href="aot-compiler">AOT</a>.
zh_cn: 所有与DOM和浏览器相关的内容，尤其是有助于渲染到DOM中的部分。该软件包还包括 <code><a href="../api/core/platformref#bootstrapModuleFactory">bootstrapModuleFactory()</a></code> 方法，用于引导应用程序生成用于使用<a href="aot-compiler">AOT</a>预编译的生产版本。

source: Everything seems fine while you move about <em>within</em> the app. But you'll see the problem right away if you refresh the browser or paste a link to an app page (called a "deep link") into the browser address bar.
zh_cn: 在应用<em>内</em>移动时，一切似乎都很好。但是，如果刷新浏览器或将指向应用程序页面的链接（称为&ldquo;深层链接&rdquo;）粘贴到浏览器地址栏中，则会立即看到问题。

source: Everything that happens in the application runs inside the Angular zone. This is true whether the event originated in AngularJS or Angular code. The zone triggers Angular change detection after every event.
zh_cn: 应用程序中发生的所有事情都在Angular区域内运行。无论事件源于AngularJS还是Angular代码,都是如此。该区域在每个事件发生后都会触发Angular变化检测。

source: Examine the <code>src/app/app.component.ts</code> file which defines two nested <em>#docregions</em>.
zh_cn: 检查 <code>src/app/app.component.ts</code> 文件，该文件定义了两个嵌套的<em>#docregions</em>。

source: Examine the body and attempt to infer an appropriate MIME type for it.
zh_cn: 检查主体,并尝试推断出适合它的MIME类型。

source: Example 1: an <code>&lt;input&gt;</code>
zh_cn: 示例1： <code>&lt;input&gt;</code>

source: Example 2
zh_cn: 例二

source: Example 2: a disabled button
zh_cn: 例2:禁用按钮

source: Example URLs:
zh_cn: URL示例:

source: Example Value
zh_cn: 示例值

source: Example app structure
zh_cn: 应用结构示例

source: Example as TypeScript Decorator
zh_cn: 作为TypeScript装饰器的例子

source: Example of bad code
zh_cn: 错误代码的例子

source: Example patterns:
zh_cn: 示例模式:

source: Example: A Popup Service
zh_cn: 例子:弹出式服务

source: Examples are given in <code>en-US</code> locale.
zh_cn: 示例在 <code>en-US</code> 语言环境中给出。

source: Examples of such scoped <code>HeroService</code> singletons appear throughout the accompanying sample code, including <code>HeroBiosComponent</code>, <code>HeroOfTheMonthComponent</code>, and <code>HeroesBaseComponent</code>. Each of these components has its own <code>HeroService</code> instance managing its own independent collection of heroes.
zh_cn: 这种范围限定的 <code>HeroService</code> 单例的示例出现在随附的示例代码中，包括 <code>HeroBiosComponent</code> ， <code>HeroOfTheMonthComponent</code> 和 <code>HeroesBaseComponent</code> 。这些组件中的每一个都有其自己的 <code>HeroService</code> 实例，该实例管理自己的独立英雄集合。

source: Executes a queried inner animation element within an animation sequence.
zh_cn: 在一个动画序列中执行一个查询到的内部动画元素。

source: Executes the <code>fn</code> function synchronously in Angular's parent zone and returns value returned by the function.
zh_cn: 在Angular的父区域中同步执行 <code>fn</code> 函数，并返回该函数返回的值。

source: Executes the <code>fn</code> function synchronously within the Angular zone and returns value returned by the function.
zh_cn: 在Angular区域内同步执行 <code>fn</code> 函数，并返回该函数返回的值。

source: Executes the <code>fn</code> function synchronously within the Angular zone as a task and returns value returned by the function.
zh_cn: 作为任务在Angular区域中同步执行 <code>fn</code> 函数，并返回该函数返回的值。

source: Existing <code>token</code> to return. (Equivalent to <code>injector.get(<a href="existingsansprovider#useExisting">useExisting</a>)</code>)
zh_cn: 现有 <code>token</code> 返回。（等效于 <code>injector.get(<a href="existingsansprovider#useExisting">useExisting</a>)</code> （useExisting））

source: Expect that a single request has been made which matches the given URL, and return its mock.
zh_cn: 期待一个与给定URL相匹配的请求被发出,并返回它的mock。

source: Expect that a single request has been made which matches the given condition, and return its mock.
zh_cn: 期待有一个符合给定条件的请求被提出,并返回其mock。

source: Expect that a single request has been made which matches the given parameters, and return its mock.
zh_cn: 期待一个与给定参数相匹配的请求被发出,并返回它的mock。

source: Expect that a single request has been made which matches the given predicate function, and return its mock.
zh_cn: 期待有一个与给定的谓词函数相匹配的请求被提出,并返回其mock。

source: Expect that no requests have been made which match the given URL.
zh_cn: 预计没有符合给定URL的请求。

source: Expect that no requests have been made which match the given condition.
zh_cn: 预计没有符合给定条件的请求被提出。

source: Expect that no requests have been made which match the given parameters.
zh_cn: 预计没有符合给定参数的请求。

source: Expect that no requests have been made which match the given predicate function.
zh_cn: 预计没有符合给定谓词函数的请求。

source: Expecting and answering requests
zh_cn: 期待和答复请求

source: Experienced developers agree that components should be cheap and safe to construct.
zh_cn: 有经验的开发者都认为,组件的构造应该是廉价和安全的。

source: Experiment with these possibilities at your leisure.
zh_cn: 闲暇时可以尝试这些可能性。

source: Explore Angular's inventory of built-in pipes in the <a href="api?type=pipe">API Reference</a>. Try writing a custom pipe and perhaps contributing it to the community.
zh_cn: 在<a href="api?type=pipe">API参考中</a>探索Angular的内置管道清单。尝试编写自定义管道，并可能将其贡献给社区。

source: Explore the options and combinations on your own.
zh_cn: 自己探索选择和组合。

source: Exponential backoff
zh_cn: 指数后退

source: Exponential backoff is a technique in which you retry an API after failure, making the time in between retries longer after each consecutive failure, with a maximum number of retries after which the request is considered to have failed. This can be quite complex to implement with promises and other methods of tracking AJAX calls. With observables, it is very easy:
zh_cn: 指数回退是一种在失败后重试API的技术,在每次连续失败后,使重试之间的时间变长,有最大的重试次数,之后就认为请求失败。如果使用承诺和其他跟踪AJAX调用的方法,这可能是相当复杂的实现。有了observables,这就非常容易了。

source: Export <a href="bootstrapping#the-declarations-array">declarable</a> classes that components in <em>other</em> NgModules are able to reference in their templates. These are your <em>public</em> classes. If you don't export a declarable class, it stays <em>private</em>, visible only to other components declared in this NgModule.
zh_cn: 出口<a href="bootstrapping#the-declarations-array">申报的</a>类别，在组件<em>等</em> NgModules能够在他们的模板来引用。这些是您的<em>公开</em>课。如果不导出可声明的类，则该类将保持<em>私有状态</em>，仅对该NgModule中声明的其他组件可见。

source: Export it from the file where you wrote it.
zh_cn: 从你写的文件中导出它。

source: Exported declarations are the module's <em>public API</em>. A component in another module can <a href="ngmodule-faq#q-template-reference">use</a><em>this</em> module's <code>UserComponent</code> if it imports this module and this module exports <code>UserComponent</code>.
zh_cn: 导出的声明是模块的<em>公共API</em>。在另一个模块中的组件可以<a href="ngmodule-faq#q-template-reference">使用</a><em>此</em>模块的 <code>UserComponent</code> 如果进口该模块和该模块的出口 <code>UserComponent</code> 。

source: Exports <code><a href="../browsermodule">BrowserModule</a></code> with additional <a href="../../../guide/glossary#provider">dependency-injection providers</a> for use with animations. See <a href="../../../guide/animations">Animations</a>.
zh_cn: 导出带有附加<a href="../../../guide/glossary#provider">依赖项注入提供程序的</a> <code><a href="../browsermodule">BrowserModule</a></code> 以与动画一起使用。请参阅<a href="../../../guide/animations">动画</a>。

source: Exports <code><a href="browsermodule">BrowserModule</a></code> with additional <a href="../../guide/glossary#provider">dependency-injection providers</a> for use with animations. See <a href="../../guide/animations">Animations</a>.
zh_cn: 导出带有附加<a href="../../guide/glossary#provider">依赖项注入提供程序的</a> <code><a href="browsermodule">BrowserModule</a></code> 以与动画一起使用。请参阅<a href="../../guide/animations">动画</a>。

source: Exports a constant named <code>slideInAnimation</code> set to an animation trigger named <em><code>routeAnimation</code></em>;
zh_cn: 出口命名常量 <code>slideInAnimation</code> 一套名为动画触发<em> <code>routeAnimation</code> </em> ;

source: Exports all the basic Angular directives and pipes, such as <code><a href="common/ngif">NgIf</a></code>, <code><a href="common/ngforof">NgForOf</a></code>, <code><a href="common/decimalpipe">DecimalPipe</a></code>, and so on. Re-exported by <code><a href="platform-browser/browsermodule">BrowserModule</a></code>, which is included automatically in the root <code>AppModule</code> when you create a new app with the CLI <code>new</code> command.
zh_cn: 导出所有基本的Angular指令和管道，例如 <code><a href="common/ngif">NgIf</a></code> ， <code><a href="common/ngforof">NgForOf</a></code> ， <code><a href="common/decimalpipe">DecimalPipe</a></code> 等。由 <code><a href="platform-browser/browsermodule">BrowserModule</a></code> 重新导出，当您使用CLI <code>new</code> 命令创建新应用时，它会自动包含在根 <code>AppModule</code> 中。

source: Exports all the basic Angular directives and pipes, such as <code><a href="ngif">NgIf</a></code>, <code><a href="ngforof">NgForOf</a></code>, <code><a href="decimalpipe">DecimalPipe</a></code>, and so on. Re-exported by <code><a href="../platform-browser/browsermodule">BrowserModule</a></code>, which is included automatically in the root <code>AppModule</code> when you create a new app with the CLI <code>new</code> command.
zh_cn: 导出所有基本的Angular指令和管道，例如 <code><a href="ngif">NgIf</a></code> ， <code><a href="ngforof">NgForOf</a></code> ， <code><a href="decimalpipe">DecimalPipe</a></code> 等。由 <code><a href="../platform-browser/browsermodule">BrowserModule</a></code> 重新导出，当您使用CLI <code>new</code> 命令创建新应用时，它会自动包含在根 <code>AppModule</code> 中。

source: Exports required infrastructure for all Angular apps. Included by default in all Angular apps created with the CLI <code>new</code> command. Re-exports <code><a href="../common/commonmodule">CommonModule</a></code> and <code><a href="../core/applicationmodule">ApplicationModule</a></code>, making their exports and providers available to all apps.
zh_cn: 导出所有Angular应用程序所需的基础架构。默认情况下，包含在使用CLI <code>new</code> 命令创建的所有Angular应用程序中。重新导出 <code><a href="../common/commonmodule">CommonModule</a></code> 和 <code><a href="../core/applicationmodule">ApplicationModule</a></code> ，使其导出和提供程序可用于所有应用程序。

source: Exports required infrastructure for all Angular apps. Included by default in all Angular apps created with the CLI <code>new</code> command. Re-exports <code><a href="common/commonmodule">CommonModule</a></code> and <code><a href="core/applicationmodule">ApplicationModule</a></code>, making their exports and providers available to all apps.
zh_cn: 导出所有Angular应用程序所需的基础架构。默认情况下，包含在使用CLI <code>new</code> 命令创建的所有Angular应用程序中。重新导出 <code><a href="common/commonmodule">CommonModule</a></code> 和 <code><a href="core/applicationmodule">ApplicationModule</a></code> ，使其导出和提供程序可用于所有应用程序。

source: Exports the required infrastructure and directives for reactive forms, making them available for import by NgModules that import this module.
zh_cn: 导出反应式表单所需的基础架构和指令,使其可以被导入该模块的NgModules导入。

source: Exports the required providers and directives for template-driven forms, making them available for import by NgModules that import this module.
zh_cn: 导出模板驱动的表单所需的提供者和指令,让导入该模块的NgModules可以导入它们。

source: Expression binding
zh_cn: 表达式结合

source: Expression context
zh_cn: 表达式上下文

source: Expression form not supported
zh_cn: 不支持表达形式

source: Expression guidelines
zh_cn: 表达准则

source: Expression syntax limitations
zh_cn: 表达式语法限制

source: Expression: <code>&lt;comp [name]="username"&gt;</code>
zh_cn: 表达式： <code>&lt;comp [name]="username"&gt;</code>

source: Expressions should finish quickly or the user experience may drag, especially on slower devices. Consider caching values when their computation is expensive.
zh_cn: 表达式应该快速完成,否则用户体验可能会拖沓,尤其是在较慢的设备上。当值的计算很昂贵时,可以考虑缓存值。

source: Extend the <code>AuthGuard</code> to protect when navigating between the <code>admin</code> routes. Open <code>auth.guard.ts</code> and add the <code><a href="../api/router/canactivatechild">CanActivateChild</a></code> interface to the imported tokens from the router package.
zh_cn: 扩展 <code>AuthGuard</code> 以在 <code>admin</code> 路由之间导航时进行保护。打开 <code>auth.guard.ts</code> 并将 <code><a href="../api/router/canactivatechild">CanActivateChild</a></code> 接口添加到从路由器软件包中导入的令牌中。

source: Extend this base class to implement custom rendering. By default, Angular renders a template into DOM. You can use custom rendering to intercept rendering calls, or to render to something other than DOM.
zh_cn: 扩展这个基类来实现自定义渲染。默认情况下,Angular会将模板渲染到DOM中。你可以使用自定义渲染来拦截渲染调用,或者渲染到DOM以外的地方。

source: Extended interactions between a data service and the <code><a href="../api/common/http/httpclient">HttpClient</a></code> can be complex and difficult to mock with spies.
zh_cn: 数据服务和 <code><a href="../api/common/http/httpclient">HttpClient</a></code> 之间的扩展交互可能很复杂，很难用间谍程序模拟。

source: Extends <a href="https://rxjs.dev/api/index/class/Subject">RxJS <code>Subject</code></a> for Angular by adding the <code><a href="eventemitter#emit">emit()</a></code> method.
zh_cn: 通过添加<a href="https://rxjs.dev/api/index/class/Subject">generate <code>Subject</code> </a> <code><a href="eventemitter#emit">emit()</a></code> 方法来扩展Angular的RxJS 主题。
