Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/angular/angular.*.006.xlf
Languages: es, ja, ko, ru, zh_cn

source: Constructs an <code>Observable</code> that, when subscribed, causes a request with the special method <code>JSONP</code> to be dispatched via the interceptor pipeline. The <a href="https://en.wikipedia.org/wiki/JSONP">JSONP pattern</a> works around limitations of certain API endpoints that don't support newer, and preferable <a href="https://developer.mozilla.org/en-US/docs/Web/HTTP/CORS">CORS</a> protocol. JSONP treats the endpoint API as a JavaScript file and tricks the browser to process the requests even if the API endpoint is not located on the same domain (origin) as the client-side application making the request. The endpoint API must support JSONP callback for JSONP requests to work. The resource API returns the JSON response wrapped in a callback function. You can pass the callback function name as one of the query parameters. Note that JSONP requests can only be used with <code>GET</code> requests.
es: Construye un <code>Observable</code> que, cuando se suscribe, hace que se env&iacute;e una solicitud con el m&eacute;todo especial <code>JSONP</code> a trav&eacute;s de la tuber&iacute;a del interceptor. El <a href="https://en.wikipedia.org/wiki/JSONP">patr&oacute;n JSONP</a> funciona alrededor de las limitaciones de ciertos puntos finales API que no admiten <a href="https://developer.mozilla.org/en-US/docs/Web/HTTP/CORS">CORS</a> m&aacute;s nuevos y preferiblesprotocolo. JSONP trata la API de punto final como un archivo JavaScript y enga&ntilde;a al navegador para procesar las solicitudes incluso si el punto final de API no se encuentra en el mismo dominio (origen) que la aplicaci&oacute;n del lado del cliente que realiza la solicitud. La API de punto final debe admitir la devoluci&oacute;n de llamada JSONP para que funcionen las solicitudes JSONP. La API de recursos devuelve la respuesta JSON envuelta en una funci&oacute;n de devoluci&oacute;n de llamada. Puede pasar el nombre de la funci&oacute;n de devoluci&oacute;n de llamada como uno de los par&aacute;metros de consulta. Tenga en cuenta que las solicitudes JSONP solo se pueden usar con solicitudes <code>GET</code> .
ja: サブスクライブすると、特別なメソッド <code>JSONP</code> を持つリクエストがインターセプターパイプライン経由でディスパッチされる <code>Observable</code> を構築します。<a href="https://en.wikipedia.org/wiki/JSONP">JSONPパターンは</a>、より新しい、そして好ましくはサポートしていない特定のAPIエンドポイントの制限を回避します<a href="https://developer.mozilla.org/en-US/docs/Web/HTTP/CORS">CORSを</a>プロトコル。 JSONPは、エンドポイントAPIをJavaScriptファイルとして扱い、APIエンドポイントがリクエストを行うクライアント側アプリケーションと同じドメイン（オリジン）にない場合でも、ブラウザーをだましてリクエストを処理させます。エンドポイントAPIは、JSONPリクエストが機能するためにJSONPコールバックをサポートする必要があります。リソースAPIは、コールバック関数にラップされたJSON応答を返します。コールバック関数名をクエリパラメータの1つとして渡すことができます。 JSONPリクエストは <code>GET</code> リクエストでのみ使用できることに注意してください。
ko: 구독 할 때 인터셉터 파이프 라인을 통해 특수 메소드 <code>JSONP</code> 가있는 요청을 전달 하는 <code>Observable</code> 을 구성합니다 . <a href="https://en.wikipedia.org/wiki/JSONP">JSONP 패턴은</a> 새로운 지원하지 않는 특정 API 엔드 포인트의 제한 사항 및 바람직 주위 작동 <a href="https://developer.mozilla.org/en-US/docs/Web/HTTP/CORS">CORS를</a>실험 계획안. JSONP는 엔드 포인트 API를 JavaScript 파일로 취급하고 API 엔드 포인트가 요청을 작성하는 클라이언트 측 애플리케이션과 동일한 도메인 (원본)에없는 경우에도 브라우저가 요청을 처리하도록 속입니다. 엔드 포인트 API는 JSONP 요청이 작동하도록 JSONP 콜백을 지원해야합니다. 리소스 API는 콜백 함수로 래핑 된 JSON 응답을 반환합니다. 콜백 함수 이름을 쿼리 매개 변수 중 하나로 전달할 수 있습니다. JSONP 요청은 <code>GET</code> 요청 에만 사용할 수 있습니다 .
ru: Создает <code>Observable</code> , который при подписке вызывает отправку запроса с помощью специального метода <code>JSONP</code> через конвейер перехватчика. <a href="https://en.wikipedia.org/wiki/JSONP">Модель JSONP</a> работает вокруг ограничения определенных конечных точек API , которые не поддерживают более новые и предпочтительные <a href="https://developer.mozilla.org/en-US/docs/Web/HTTP/CORS">CORS</a>протокол. JSONP рассматривает API конечной точки как файл JavaScript и обманывает браузер для обработки запросов, даже если конечная точка API не находится в том же домене (источнике), что и клиентское приложение, выполняющее запрос. API конечной точки должен поддерживать обратный вызов JSONP, чтобы запросы JSONP работали. API ресурса возвращает ответ JSON, заключенный в функцию обратного вызова. Вы можете передать имя функции обратного вызова в качестве одного из параметров запроса. Обратите внимание, что запросы JSONP могут использоваться только с запросами <code>GET</code> .

source: Constructs an <code>Observable</code> that, when subscribed, causes the configured <code>OPTIONS</code> request to execute on the server. This method allows the client to determine the supported HTTP methods and other capabilites of an endpoint, without implying a resource action. See the individual overloads for details on the return type.
es: Construye un <code>Observable</code> que, cuando se suscribe, hace que la solicitud de <code>OPTIONS</code> configurada se ejecute en el servidor. Este m&eacute;todo permite al cliente determinar los m&eacute;todos HTTP admitidos y otras capacidades de un punto final, sin implicar una acci&oacute;n de recursos. Consulte las sobrecargas individuales para obtener detalles sobre el tipo de retorno.
ja: サブスクライブされると、構成された <code>OPTIONS</code> リクエストをサーバーで実行する <code>Observable</code> を構築します。このメソッドにより、クライアントは、リソースアクションを示唆することなく、サポートされているHTTPメソッドおよびエンドポイントの他の機能を決定できます。戻り値の型の詳細については、個々のオーバーロードを参照してください。
ko: 구독 할 때 구성된 <code>OPTIONS</code> 요청이 서버에서 실행 되도록 하는 <code>Observable</code> 을 구성 합니다. 이 메소드를 사용하면 클라이언트는 자원 조치를 암시하지 않고 지원되는 HTTP 메소드 및 엔드 포인트의 기타 기능을 판별 할 수 있습니다. 반환 유형에 대한 자세한 내용은 개별 과부하를 참조하십시오.
ru: Создает <code>Observable</code> , который при подписке вызывает выполнение настроенного запроса <code>OPTIONS</code> на сервере. Этот метод позволяет клиенту определять поддерживаемые методы HTTP и другие возможности конечной точки, не предполагая действия ресурса. Посмотрите отдельные перегрузки для деталей о типе возврата.

source: Constructs an observable for a generic HTTP request that, when subscribed, fires the request through the chain of registered interceptors and on to the server.
es: Construye un observable para una petición HTTP genérica que,al suscribirse,dispara la petición a través de la cadena de interceptores registrados y hacia el servidor.
ja: 一般的な HTTP リクエスト用のオブザーバブルを構築します。
ko: 구독 할 때 등록 된 인터셉터 체인을 통해 서버로 요청을 발생시키는 일반 HTTP 요청에 대한 Observable을 구성합니다.
ru: Создает наблюдаемый для общего HTTP-запроса,который,при подписке,запускает запрос по цепочке зарегистрированных перехватчиков и на сервер.

source: Constructs an observable that, when subscribed, causes the configured <code>DELETE</code> request to execute on the server. See the individual overloads for details on the return type.
es: Construye un observable que, cuando se suscribe, hace que la solicitud <code>DELETE</code> configurada se ejecute en el servidor. Consulte las sobrecargas individuales para obtener detalles sobre el tipo de retorno.
ja: サブスクライブされると、構成された <code>DELETE</code> 要求をサーバーで実行するオブザーバブルを構築します。戻り値の型の詳細については、個々のオーバーロードを参照してください。
ko: 구독하면 구성된 <code>DELETE</code> 요청이 서버에서 실행 되도록하는 Observable을 구성 합니다. 반환 유형에 대한 자세한 내용은 개별 과부하를 참조하십시오.
ru: Создает наблюдаемое, которое при подписке вызывает выполнение настроенного запроса <code>DELETE</code> на сервере. Посмотрите отдельные перегрузки для деталей о типе возврата.

source: Constructs an observable that, when subscribed, causes the configured <code>GET</code> request to execute on the server. See the individual overloads for details on the return type.
es: Construye un observable que, cuando se suscribe, hace que la solicitud <code>GET</code> configurada se ejecute en el servidor. Consulte las sobrecargas individuales para obtener detalles sobre el tipo de retorno.
ja: サブスクライブすると、構成された <code>GET</code> リクエストをサーバーで実行するオブザーバブルを構築します。戻り値の型の詳細については、個々のオーバーロードを参照してください。
ko: 구독하면 구성된 <code>GET</code> 요청이 서버에서 실행 되도록하는 Observable을 구성 합니다. 반환 유형에 대한 자세한 내용은 개별 과부하를 참조하십시오.
ru: Создает наблюдаемое, которое при подписке вызывает выполнение настроенного запроса <code>GET</code> на сервере. Посмотрите отдельные перегрузки для деталей о типе возврата.

source: Constructs an observable that, when subscribed, causes the configured <code>HEAD</code> request to execute on the server. The <code>HEAD</code> method returns meta information about the resource without transferring the resource itself. See the individual overloads for details on the return type.
es: Construye un observable que, cuando se suscribe, hace que la solicitud <code>HEAD</code> configurada se ejecute en el servidor. El m&eacute;todo <code>HEAD</code> devuelve metainformaci&oacute;n sobre el recurso sin transferir el recurso en s&iacute;. Consulte las sobrecargas individuales para obtener detalles sobre el tipo de retorno.
ja: サブスクライブされると、構成された <code>HEAD</code> リクエストをサーバーで実行するオブザーバブルを構築します。 <code>HEAD</code> のメソッドは、リソース自体を転送することなく、リソースに関するメタ情報を返します。戻り値の型の詳細については、個々のオーバーロードを参照してください。
ko: 구독 할 때 구성된 <code>HEAD</code> 요청이 서버에서 실행 되도록하는 Observable을 구성 합니다. <code>HEAD</code> 의 방법은 자원 자체를 전송하지 않고 자원에 대한 메타 정보를 반환합니다. 반환 유형에 대한 자세한 내용은 개별 과부하를 참조하십시오.
ru: Создает наблюдаемое, которое при подписке вызывает выполнение настроенного запроса <code>HEAD</code> на сервере. Метод <code>HEAD</code> возвращает метаинформацию о ресурсе без передачи самого ресурса. Посмотрите отдельные перегрузки для деталей о типе возврата.

source: Constructs an observable that, when subscribed, causes the configured <code>PATCH</code> request to execute on the server. See the individual overloads for details on the return type.
es: Construye un observable que, cuando se suscribe, hace que la solicitud <code>PATCH</code> configurada se ejecute en el servidor. Consulte las sobrecargas individuales para obtener detalles sobre el tipo de retorno.
ja: サブスクライブされると、構成された <code>PATCH</code> リクエストをサーバーで実行するオブザーバブルを構築します。戻り値の型の詳細については、個々のオーバーロードを参照してください。
ko: 구독하면 구성된 <code>PATCH</code> 요청이 서버에서 실행 되도록하는 Observable을 구성 합니다. 반환 유형에 대한 자세한 내용은 개별 과부하를 참조하십시오.
ru: Создает наблюдаемое, которое при подписке вызывает выполнение настроенного запроса <code>PATCH</code> на сервере. Посмотрите отдельные перегрузки для деталей о типе возврата.

source: Constructs an observable that, when subscribed, causes the configured <code>POST</code> request to execute on the server. The server responds with the location of the replaced resource. See the individual overloads for details on the return type.
es: Construye un observable que, cuando se suscribe, hace que la solicitud <code>POST</code> configurada se ejecute en el servidor. El servidor responde con la ubicaci&oacute;n del recurso reemplazado. Consulte las sobrecargas individuales para obtener detalles sobre el tipo de retorno.
ja: サブスクライブされると、構成された <code>POST</code> 要求をサーバーで実行するオブザーバブルを構築します。サーバーは、置き換えられたリソースの場所で応答します。戻り値の型の詳細については、個々のオーバーロードを参照してください。
ko: 구독하면 구성된 <code>POST</code> 요청이 서버에서 실행 되도록하는 Observable을 구성 합니다. 서버는 교체 된 리소스의 위치로 응답합니다. 반환 유형에 대한 자세한 내용은 개별 과부하를 참조하십시오.
ru: Создает наблюдаемое, которое при подписке вызывает выполнение настроенного запроса <code>POST</code> на сервере. Сервер отвечает местоположением замененного ресурса. Посмотрите отдельные перегрузки для деталей о типе возврата.

source: Constructs an observable that, when subscribed, causes the configured <code>PUT</code> request to execute on the server. The <code>PUT</code> method replaces an existing resource with a new set of values. See the individual overloads for details on the return type.
es: Construye un observable que, cuando se suscribe, hace que la solicitud <code>PUT</code> configurada se ejecute en el servidor. El m&eacute;todo <code>PUT</code> reemplaza un recurso existente con un nuevo conjunto de valores. Consulte las sobrecargas individuales para obtener detalles sobre el tipo de retorno.
ja: サブスクライブすると、構成された <code>PUT</code> リクエストをサーバーで実行するオブザーバブルを構築します。 <code>PUT</code> の方法は、新しい値のセットを持つ既存のリソースを置き換えます。戻り値の型の詳細については、個々のオーバーロードを参照してください。
ko: 구독하면 구성된 <code>PUT</code> 요청이 서버에서 실행 되도록하는 Observable을 구성 합니다. <code>PUT</code> 에 있어서 값의 새로운 세트와 함께 기존 자원을 대체한다. 반환 유형에 대한 자세한 내용은 개별 과부하를 참조하십시오.
ru: Создает наблюдаемое, которое при подписке вызывает выполнение настроенного запроса <code>PUT</code> на сервере. Метод <code>PUT</code> заменяет существующий ресурс новым набором значений. Посмотрите отдельные перегрузки для деталей о типе возврата.

source: Consuming controls in a grouping
es: Consumir controles en una agrupación
ja: コントロールをグループ化して消費する
ko: 그룹화 컨트롤 사용
ru: Потребление контроля в группировке

source: Contains a re-usable animation. See <code><a href="animation">animation</a>()</code>
es: Contiene una animaci&oacute;n reutilizable. Ver <code><a href="animation">animation</a>()</code>
ja: 再利用可能なアニメーションが含まれています。 <code><a href="animation">animation</a>()</code> 見る（）
ko: 재사용 가능한 애니메이션을 포함합니다. <code><a href="animation">animation</a>()</code> 보기 ()
ru: Содержит многоразовую анимацию. Посмотреть <code><a href="animation">animation</a>()</code>

source: Contains a set of CSS property-value pairs into a named style. See <code><a href="style">style</a>()</code>
es: Contiene un conjunto de pares de valores de propiedad CSS en un estilo con nombre. Ver <code><a href="style">style</a>()</code>
ja: 名前付きスタイルにCSSプロパティと値のペアのセットが含まれています。 <code><a href="style">style</a>()</code> 見る（）
ko: 명명 된 스타일로 CSS 속성-값 쌍 세트를 포함합니다. <code><a href="style">style</a>()</code> 보기 ()
ru: Содержит набор пар свойство-значение CSS в именованный стиль. Посмотреть <code><a href="style">style</a>()</code>

source: Contains a set of animation steps. See <code><a href="group">group()</a></code>
es: Contiene un conjunto de pasos de animaci&oacute;n. Ver <code><a href="group">group()</a></code>
ja: アニメーションステップのセットが含まれています。 <code><a href="group">group()</a></code> を参照してください
ko: 애니메이션 단계 세트를 포함합니다. <code><a href="group">group()</a></code> 참조
ru: Содержит набор шагов анимации. Посмотреть <code><a href="group">group()</a></code>

source: Contains a set of animation steps. See <code><a href="keyframes">keyframes</a>()</code>
es: Contiene un conjunto de pasos de animaci&oacute;n. Ver <code><a href="keyframes">keyframes</a>()</code>
ja: アニメーションステップのセットが含まれています。 <code><a href="keyframes">keyframes</a>()</code> 見る（）
ko: 애니메이션 단계 세트를 포함합니다. <code><a href="keyframes">keyframes</a>()</code> 보기 ()
ru: Содержит набор шагов анимации. Посмотреть <code><a href="keyframes">keyframes</a>()</code>

source: Contains a set of animation steps. See <code><a href="sequence">sequence</a>()</code>
es: Contiene un conjunto de pasos de animaci&oacute;n. Ver <code><a href="sequence">sequence</a>()</code>
ja: アニメーションステップのセットが含まれています。 <code><a href="sequence">sequence</a>()</code> （）を参照してください
ko: 애니메이션 단계 세트를 포함합니다. <code><a href="sequence">sequence</a>()</code> () 참조
ru: Содержит набор шагов анимации. Смотрите <code><a href="sequence">sequence</a>()</code>

source: Contains all the <a href="router#child-routing-component">child routes</a> activated under the current route.
es: Contiene todas las <a href="router#child-routing-component">rutas secundarias</a> activadas bajo la ruta actual.
ja: 現在のルートでアクティブ化されたすべての<a href="router#child-routing-component">子ルート</a>が含まれます。
ko: 현재 <a href="router#child-routing-component">경로에서</a> 활성화 된 모든 자식 경로를 포함 합니다.
ru: Содержит все <a href="router#child-routing-component">дочерние маршруты,</a> активированные под текущим маршрутом.

source: Contains all the <a href="router-tutorial-toh#child-routing-component">child routes</a> activated under the current route.
ja: 現在のルートでアクティブ化されているすべての<a href="router-tutorial-toh#child-routing-component">子ルート</a>が含まれます。
ko: 현재 <a href="router-tutorial-toh#child-routing-component">경로에서</a> 활성화 된 모든 하위 경로를 포함 합니다.
ru: Содержит все <a href="router-tutorial-toh#child-routing-component">дочерние маршруты,</a> активированные в текущем маршруте.

source: Contains an animation step. See <code><a href="animate">animate</a>()</code>
es: Contiene un paso de animaci&oacute;n. Ver <code><a href="animate">animate</a>()</code>
ja: アニメーションステップが含まれています。 <code><a href="animate">animate</a>()</code> （）を参照
ko: 애니메이션 단계를 포함합니다. <code><a href="animate">animate</a>()</code> 보기 ()
ru: Содержит шаг анимации. Смотрите <code><a href="animate">animate</a>()</code>

source: Contains an animation trigger. Instantiated and returned by the <code><a href="animations/trigger">trigger</a>()</code> function.
es: Contiene un activador de animaci&oacute;n. Instanciado y devuelto por la funci&oacute;n <code><a href="animations/trigger">trigger</a>()</code> .
ja: アニメーショントリガーが含まれています。 <code><a href="animations/trigger">trigger</a>()</code> 関数によってインスタンス化されて返されます。
ko: 애니메이션 트리거를 포함합니다. <code><a href="animations/trigger">trigger</a>()</code> 함수에 의해 인스턴스화되고 반환됩니다 .
ru: Содержит анимационный триггер. Создается и возвращается функцией <code><a href="animations/trigger">trigger</a>()</code> .

source: Contains an animation trigger. Instantiated and returned by the <code><a href="trigger">trigger</a>()</code> function.
es: Contiene un activador de animaci&oacute;n. Instanciado y devuelto por la funci&oacute;n <code><a href="trigger">trigger</a>()</code> .
ja: アニメーショントリガーが含まれています。 <code><a href="trigger">trigger</a>()</code> 関数によってインスタンス化されて返されます。
ko: 애니메이션 트리거를 포함합니다. <code><a href="trigger">trigger</a>()</code> 함수에 의해 인스턴스화되고 반환됩니다 .
ru: Содержит анимационный триггер. Создается и возвращается функцией <code><a href="trigger">trigger</a>()</code> .

source: Contains animation parameters for a re-usable animation. See <code><a href="useanimation">useAnimation</a>()</code>
es: Contiene par&aacute;metros de animaci&oacute;n para una animaci&oacute;n reutilizable. Ver <code><a href="useanimation">useAnimation</a>()</code>
ja: 再利用可能なアニメーションのアニメーションパラメータが含まれています。 <code><a href="useanimation">useAnimation</a>()</code> （）を参照してください
ko: 재사용 가능한 애니메이션에 대한 애니메이션 매개 변수를 포함합니다. <code><a href="useanimation">useAnimation</a>()</code> () 참조
ru: Содержит параметры анимации для многократного использования анимации. Смотрите <code><a href="useanimation">useAnimation</a>()</code>

source: Contains build configuration options for particular target environments. By default there is an unnamed standard development environment and a production ("prod") environment. You can define additional target environment configurations.
es: Contiene opciones de configuración de construcción para entornos de destino concretos.Por defecto hay un entorno de desarrollo estándar sin nombre y un entorno de producción ("prod").Puede definir configuraciones adicionales del entorno de destino.
ja: 特定のターゲット環境用のビルド設定オプションが含まれています。デフォルトでは、名前のない標準の開発環境と本番環境(「prod」)があります。追加のターゲット環境設定を定義することができます。
ko: 특정 대상 환경에 대한 빌드 구성 옵션이 포함되어 있습니다. 기본적으로 명명되지 않은 표준 개발 환경과 프로덕션 ( "prod") 환경이 있습니다. 추가 대상 환경 구성을 정의 할 수 있습니다.
ru: Содержит параметры конфигурации сборки для конкретных целевых сред.По умолчанию существует неназванная стандартная среда разработки и производственная ("укороченная")среда.Можно определить дополнительные конфигурации целевого окружения.

source: Contains child-animation query data. See <code><a href="query">query</a>()</code>
es: Contiene datos de consulta de animaci&oacute;n infantil. Ver <code><a href="query">query</a>()</code>
ja: 子アニメーションのクエリデータが含まれています。 <code><a href="query">query</a>()</code> （）を参照してください
ko: 자식 애니메이션 쿼리 데이터를 포함합니다. <code><a href="query">query</a>()</code> () 참조
ru: Содержит данные запроса дочерней анимации. Посмотреть <code><a href="query">query</a>()</code>

source: Contains data for staggering an animation sequence. See <code><a href="stagger">stagger</a>()</code>
es: Contiene datos para escalonar una secuencia de animaci&oacute;n. Ver <code><a href="stagger">stagger</a>()</code>
ja: アニメーションシーケンスをずらすためのデータが含まれています。 <code><a href="stagger">stagger</a>()</code> （）を参照
ko: 애니메이션 시퀀스를 엇갈리게하기위한 데이터를 포함합니다. 스 <code><a href="stagger">stagger</a>()</code> 참조 ()
ru: Содержит данные для ошеломления последовательности анимации. Смотри <code><a href="stagger">stagger</a>()</code>

source: Contains data to use in executing child animations returned by a query. See <code><a href="animatechild">animateChild</a>()</code>
es: Contiene datos para usar en la ejecuci&oacute;n de animaciones secundarias devueltas por una consulta. Ver <code><a href="animatechild">animateChild</a>()</code>
ja: クエリによって返された子アニメーションの実行に使用するデータが含まれています。 <code><a href="animatechild">animateChild</a>()</code> （）を参照してください
ko: 쿼리에서 반환 된 자식 애니메이션을 실행하는 데 사용할 데이터를 포함합니다. <code><a href="animatechild">animateChild</a>()</code> () 참조
ru: Содержит данные для использования при выполнении дочерних анимаций, возвращаемых запросом. Смотрите <code><a href="animatechild">animateChild</a>()</code>

source: Contains image and other asset files to be copied as-is when you build your application.
es: Contiene archivos de imagen y otros archivos de activos para ser copiados tal cual cuando construya su aplicación.
ja: アプリケーションを構築する際にそのままコピーされる画像やその他のアセットファイルが含まれています。
ko: 애플리케이션을 빌드 할 때 그대로 복사 할 이미지 및 기타 자산 파일을 포함합니다.
ru: Содержит файлы образов и других активов,которые необходимо скопировать при сборке приложения.

source: Contains the component files in which your application logic and data are defined. See details <a href="file-structure#app-src">below</a>.
es: Contiene los archivos componentes en los que se definen la l&oacute;gica y los datos de su aplicaci&oacute;n. Ver detalles a <a href="file-structure#app-src">continuaci&oacute;n</a> .
ja: アプリケーションのロジックとデータが定義されているコンポーネントファイルが含まれています。詳細は<a href="file-structure#app-src">以下を</a>ご覧ください。
ko: 응용 프로그램 논리 및 데이터가 정의 된 구성 요소 파일을 포함합니다. 세부 사항을 참조하십시오 <a href="file-structure#app-src">아래를</a> .
ru: Содержит файлы компонентов, в которых определены логика и данные вашего приложения. Подробности смотрите <a href="file-structure#app-src">ниже</a> .

source: Contains the first <code><a href="../api/router/activatedroute">ActivatedRoute</a></code> in the list of this route's child routes.
es: Contiene la primera ruta <code><a href="../api/router/activatedroute">ActivatedRoute</a></code> en la lista de rutas secundarias de esta ruta.
ja: このルートの子ルートのリストの最初の <code><a href="../api/router/activatedroute">ActivatedRoute</a></code> を含みます。
ko: 이 경로의 자식 경로 목록에서 첫 번째 <code><a href="../api/router/activatedroute">ActivatedRoute</a></code> 를 포함합니다 .
ru: Содержит первый <code><a href="../api/router/activatedroute">ActivatedRoute</a></code> в списке дочерних маршрутов этого маршрута.

source: Contains the information about a route associated with a component loaded in an outlet at a particular moment in time. ActivatedRouteSnapshot can also be used to traverse the router state tree.
es: Contiene la información sobre una ruta asociada a un componente cargado en una salida en un momento determinado.ActivatedRouteSnapshot también se puede utilizar para atravesar el árbol de estado del enrutador.
ja: 特定の瞬間にアウトレットにロードされたコンポーネントに関連付けられたルートに関する情報を含みます。ActivatedRouteSnapshot は、ルータのステートツリーをたどるためにも使用できます。
ko: 특정 시점에 콘센트에로드 된 구성 요소와 연관된 경로에 대한 정보를 포함합니다. ActivatedRouteSnapshot을 사용하여 라우터 상태 트리를 통과 할 수도 있습니다.
ru: Содержит информацию о маршруте,связанном с компонентом,загруженным в розетку в определенный момент времени.ActivatedRouteSnapshot также может быть использован для прохождения по дереву состояния маршрутизатора.

source: Contains the version of Angular to use for the documentation. If not provided, the command uses your current Angular core version.
es: Contiene la versión de Angular para usar en la documentación.Si no se proporciona,el comando utiliza su versión actual del núcleo de Angular.
ja: ドキュメントに使用する Angular のバージョンを指定します。省略した場合は、現在の Angular コアのバージョンを使用します。
ko: 설명서에 사용할 Angular 버전이 들어 있습니다. 제공되지 않은 경우 명령은 현재 Angular 코어 버전을 사용합니다.
ru: Содержит версию Angular для использования в документации.Если она не предоставлена,команда использует текущую версию Angular core.
