Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/angular/angular.*.006.xlf
Languages: es, ja, ko, ru, zh_cn

source: Click on the "Checkout" button to see the updated cart. (Remember that changing the app causes the preview to refresh, which empties the cart.)
es: Haga clic en el botón "Checkout" para ver el carrito actualizado.(Recuerda que al cambiar la aplicación se refresca la vista previa,lo que vacía el carrito).
ja: チェックアウト」ボタンをクリックすると、更新されたカートが表示されます。(アプリを変更するとプレビューが更新され、カートが空になることを覚えておいてください)
ko: "체크 아웃"버튼을 클릭하여 업데이트 된 카트를보십시오. 앱을 변경하면 미리보기가 새로 고쳐지고 장바구니가 비워집니다.
ru: Нажмите на кнопку "Оформить заказ",чтобы увидеть обновленную корзину.(Помните,что изменение приложения приводит к обновлению предварительного просмотра,что приводит к опустошению корзины).

source: Click on the Orders or Customers button. If you see a chunk appear, everything is wired up properly and the feature module is being lazy loaded. A chunk should appear for Orders and for Customers but will only appear once for each.
es: Haga clic en el botón Pedidos o Clientes.Si ves aparecer un trozo,todo está bien cableado y el módulo de características está siendo cargado de forma perezosa.Un trozo debería aparecer para los pedidos y los clientes,pero sólo aparecerá una vez para cada uno.
ja: OrdersまたはCustomersボタンをクリックします。チャンクが表示される場合は、すべてが適切に配線されており、機能モジュールが遅延ロードされていることを示しています。チャンクは Orders と Customers に表示されるはずですが、表示されるのはそれぞれ一度だけです。
ko: 주문 또는 고객 버튼을 클릭하십시오. 청크가 표시되면 모든 것이 올바르게 연결되고 기능 모듈이 지연로드되고있는 것입니다. 주문과 고객에 대한 청크가 나타나야하지만 각 청크는 한 번만 나타납니다.
ru: Нажмите на кнопку "Заказы" или "Клиенты".Если вы видите,что появляется фрагмент,все правильно подключено и функциональный модуль лениво загружается.Фрагмент должен появиться для Заказов и для Клиентов,но появится только один раз для каждого из них.

source: Click on the link to navigate to the shipping prices.
es: Haga clic en el enlace para navegar a los precios de envío.
ja: リンクをクリックすると送料が表示されます。
ko: 운송 가격으로 이동하려면 링크를 클릭하십시오.
ru: Нажмите на ссылку,чтобы перейти к стоимости доставки.

source: Click the "Buy" button to add the product to the stored list of items in the cart and display a confirmation message.
ja: 購入」ボタンをクリックすると、カート内の保存されている商品リストに追加され、確認メッセージが表示されます。
ko: "구매"버튼을 클릭하여 장바구니에 저장된 품목 목록에 제품을 추가하고 확인 메시지를 표시합니다.
ru: Нажмите кнопку "Купить",чтобы добавить продукт в сохраненный список товаров в корзине и отобразить подтверждающее сообщение.

source: Click the "Buy" button. The product is added to the stored list of items in the cart, and a message is displayed.
es: Haz clic en el botón "Comprar".El producto se agrega a la lista de artículos almacenados en el carrito y aparece un mensaje.
ja: 購入」ボタンをクリックします。カートに保存されている商品リストに商品が追加され、メッセージが表示されます。
ko: "구매"버튼을 클릭하십시오. 장바구니에 저장된 항목 목록에 제품이 추가되고 메시지가 표시됩니다.
ru: Нажмите кнопку "Купить".Продукт будет добавлен в сохраненный список товаров в корзине,и на экране появится соответствующее сообщение.

source: Click the "Checkout" button to see the updated cart. Remember that changing the app causes the preview to refresh, which empties the cart.
ja: チェックアウト」ボタンをクリックすると、更新されたカートが表示されます。アプリを変更するとプレビューが更新され、カートが空になることを覚えておいてください。
ko: 업데이트 된 카트를 보려면 "체크 아웃"버튼을 클릭하십시오. 앱을 변경하면 미리보기가 새로 고침되어 장바구니가 비워집니다.
ru: Нажмите кнопку "Оформить заказ",чтобы увидеть обновленную корзину.Помните,что изменение приложения приводит к обновлению предварительного просмотра,что опустошает корзину.

source: Click the <code>Refresh</code> icon in Solution Explorer.
es: Haga clic en el icono <code>Refresh</code> en el Explorador de soluciones.
ja: ソリューションエクスプローラーで[ <code>Refresh</code> ]アイコンをクリックします。
ko: 솔루션 탐색기에서 <code>Refresh</code> 아이콘을 클릭하십시오 .
ru: Нажмите значок <code>Refresh</code> в обозревателе решений.

source: Click the <code>Show <a href="visual-studio-2015">All</a> Files</code> button in Solution Explorer to reveal all of the hidden files in the project.
es: Haga clic en el bot&oacute;n <code>Show <a href="visual-studio-2015">All</a> Files</code> en el Explorador de soluciones para revelar todos los archivos ocultos en el proyecto.
ja: クリックして <code>Show <a href="visual-studio-2015">All</a> Files</code> プロジェクトに隠されたファイルのすべてを明らかにするソリューションエクスプローラでボタンを。
ko: 솔루션 탐색기에서 <code>Show <a href="visual-studio-2015">All</a> Files</code> 파일 표시 버튼을 클릭하여 프로젝트의 모든 숨겨진 파일을 표시하십시오.
ru: Нажмите кнопку <code>Show <a href="visual-studio-2015">All</a> Files</code> в обозревателе решений, чтобы открыть все скрытые файлы в проекте.

source: Click the <em>Edit</em> button to switch the display back to the editable form.
ja: [<em>編集</em>]ボタンをクリックして、表示を編集可能なフォームに戻します。
ko: <em>편집</em> 버튼을 클릭하여 디스플레이를 편집 가능한 형식으로 다시 전환합니다.
ru: Нажмите кнопку &laquo; <em>Изменить&raquo;</em> , чтобы вернуться к редактируемой форме.

source: Click the <em>Heroes</em> link and look at the URL again.
es: Haz clic en el enlace <em>H&eacute;roes</em> y mira la URL nuevamente.
ja: <em>Heroes</em>リンクをクリックして、もう一度URLを確認します。
ko: <em>영웅</em> 링크를 클릭하고 URL을 다시 확인하십시오.
ru: Нажмите на ссылку &laquo; <em>Герои&raquo;</em> и снова посмотрите на URL.

source: Click the <strong>DEBUG</strong> button; it opens a new browser tab and re-runs the tests.
es: Haga clic en el bot&oacute;n <strong>DEPURAR</strong> ; abre una nueva pesta&ntilde;a del navegador y vuelve a ejecutar las pruebas.
ja: <strong>デバッグ</strong>ボタンをクリックします。新しいブラウザタブが開き、テストが再実行されます。
ko: <strong>DEBUG</strong> 버튼을 클릭하십시오 . 새 브라우저 탭이 열리고 테스트가 다시 실행됩니다.
ru: Нажмите кнопку <strong>DEBUG</strong> ; он открывает новую вкладку браузера и повторно запускает тесты.

source: Click the browser back button or the "Heroes" link to activate a dialog.
ja: ブラウザの戻るボタンをクリックするか、「Heroes」リンクをクリックするとダイアログが表示されます。
ko: 브라우저 뒤로 버튼 또는 "영웅"링크를 클릭하여 대화 상자를 활성화합니다.
ru: Нажмите кнопку "Назад" браузера или ссылку "Герои",чтобы активировать диалог.

source: Click the browser's back and forward buttons and the browser navigates backward and forward through the history of pages you've seen.
es: Haz clic en los botones de retroceso y avance del navegador y el navegador navegará hacia atrás y adelante a través del historial de las páginas que has visto.
ja: ブラウザの戻るボタンと進むボタンをクリックすると、ブラウザは見たことのあるページの履歴を前後に移動します。
ko: 브라우저의 뒤로 및 앞으로 버튼을 클릭하면 브라우저가 표시된 페이지 기록을 앞뒤로 탐색합니다.
ru: Нажмите кнопки браузера "Назад" и "Вперед",и браузер будет осуществлять навигацию по истории просмотренных страниц.

source: Click the browser's back and forward buttons, and the browser navigates backward and forward through the history of pages you've seen.
es: Haz clic en los botones de retroceso y avance del navegador,y el navegador navegará hacia atrás y adelante a través del historial de las páginas que has visto.
ja: ブラウザの「戻る」「進む」ボタンをクリックすると、見たページの履歴からブラウザが前後に移動します。
ko: 브라우저의 뒤로 및 앞으로 버튼을 클릭하면 브라우저가 표시된 페이지 기록을 앞뒤로 탐색합니다.
ru: Нажмите кнопки браузера "Назад" и "Вперед",и браузер будет перемещаться назад и вперед по истории просмотренных страниц.

source: Click the element
es: Haga clic en el elemento
ja: 要素をクリックします。
ko: 요소를 클릭하십시오
ru: щёлкнуть на элементе

source: Click the link. The address bar updates to <code>/heroes</code> and the list of heroes appears.
es: Haz clic en el enlace. La barra de direcciones se actualiza a <code>/heroes</code> y aparece la lista de h&eacute;roes.
ja: リンクをクリックします。アドレスバーが <code>/heroes</code> に更新され、ヒーローのリストが表示されます。
ko: 링크를 클릭하십시오. 주소 표시 줄이 <code>/heroes</code> 로 업데이트되고 영웅 목록이 나타납니다.
ru: Нажмите на ссылку. Адресная строка обновляется до <code>/heroes</code> и появляется список героев.

source: Clicking a button triggers emission of a <code>true</code> or <code>false</code>, the boolean <em>payload</em>.
es: Al hacer clic en un bot&oacute;n se dispara la emisi&oacute;n de un <code>true</code> o <code>false</code> , la <em>carga &uacute;til</em> booleana .
ja: ボタンをクリックすると、ブール<em>ペイロード</em>である <code>true</code> または <code>false</code> の発行がトリガーされます。<em></em>
ko: 버튼을 클릭하면 부울 <em>페이로드 인 </em> <code>true</code> 또는 <code>false</code> 의 방출이 트리거됩니다 .<em></em>
ru: Нажатие на кнопку запускает выдачу значения <code>true</code> или <code>false</code> , булевой <em>полезной нагрузки</em> .

source: Clicking a button, an anchor, or an arbitrary HTML element is a common test task.
es: Hacer clic en un botón,un ancla o un elemento HTML arbitrario es una tarea de prueba común.
ja: ボタンやアンカー、任意のHTML要素をクリックすることは、一般的なテスト作業です。
ko: 버튼, 앵커 또는 임의의 HTML 요소를 클릭하는 것이 일반적인 테스트 작업입니다.
ru: Нажатие кнопки,якоря или произвольного HTML-элемента является обычной тестовой задачей.

source: Clicking a hero item now does nothing. You'll <a href="toh-pt5#heroes-component-links">fix that shortly</a> after you enable routing to the <code>HeroDetailComponent</code>.
es: Hacer clic en un elemento de h&eacute;roe ahora no hace nada. Lo <a href="toh-pt5#heroes-component-links">solucionar&aacute; poco</a> despu&eacute;s de habilitar el enrutamiento al <code>HeroDetailComponent</code> .
ja: ヒーローアイテムをクリックしても何も起こりません。 <code>HeroDetailComponent</code> へのルーティングを有効に<a href="toh-pt5#heroes-component-links">した直後</a>に修正します。
ko: 영웅 아이템을 클릭해도 아무 효과가 없습니다. 당신은 것 <a href="toh-pt5#heroes-component-links">곧 그 문제를 해결</a> 하면 라우팅 사용하도록 설정 한 후에 <code>HeroDetailComponent</code> .
ru: Нажатие на предмет героя теперь ничего не делает. Вы <a href="toh-pt5#heroes-component-links">исправите это вскоре</a> после включения маршрутизации к <code>HeroDetailComponent</code> .

source: Clicking a hero on the Heroes page does nothing.
es: Hacer clic en un héroe en la página de Héroes no hace nada.
ja: ヒーローページのヒーローをクリックしても何もしません。
ko: 영웅 페이지에서 영웅을 클릭하면 아무 효과가 없습니다.
ru: Нажатие на героя на странице Героев ничего не делает.

source: Clicking links on the page to navigate to a new view.
ja: ページ上のリンクをクリックすると、新しいビューに移動します。
ko: 페이지에서 링크를 클릭하여 새보기로 이동합니다.
ru: Нажатие на ссылки на странице для перехода к новому виду.

source: Clicking the "Back" button returns you to the Dashboard. Links at the top take you to either of the main views. If you click "Heroes," the app displays the "Heroes" master list view.
es: Al hacer clic en el botón "Atrás" se regresa al Tablero.Los enlaces en la parte superior te llevan a cualquiera de las vistas principales.Si haces clic en "Héroes",la aplicación muestra la vista de la lista maestra de "Héroes".
ja: 戻る」ボタンをクリックするとダッシュボードに戻ります。上部にあるリンクをクリックすると、どちらかのメインビューに移動できます。Heroes」をクリックすると、「Heroes」マスターリストビューが表示されます。
ko: "뒤로"버튼을 클릭하면 대시 보드로 돌아갑니다. 상단의 링크를 통해 기본보기 중 하나를 볼 수 있습니다. "영웅"을 클릭하면 앱에 "영웅"마스터 목록보기가 표시됩니다.
ru: Нажатие кнопки "Назад" возвращает вас на Приборную панель.Ссылки в верхней части приведут вас к любому из основных видов.При нажатии кнопки "Герои" приложение выводит на экран основной список "Герои".

source: Clicking the "send" or "cancel" buttons <em>does</em> clear the popup view. To see how, look at the <code>closePopup()</code> method again:
es: Al hacer clic en el bot&oacute;n "Cancelar" "Enviar" o <em>lo hace</em> claro la vista emergente. Para ver c&oacute;mo, mira de nuevo el m&eacute;todo <code>closePopup()</code> :
ja: 「送信」または「キャンセル」ボタンをクリックすると、ポップアップビュー<em>が</em>クリアされます。方法を確認するには、 <code>closePopup()</code> メソッドをもう一度見てください。
ko: 은 "전송"또는 "취소"버튼을 클릭하면 <em>않는</em> 팝업보기를 취소합니다. 방법을 보려면 <code>closePopup()</code> 메소드를 다시 살펴보십시오 .
ru: Нажатие кнопки &laquo;отправить&raquo; или кнопки &laquo;ОТМЕНА&raquo; <em>делает</em> расчистить вид всплывающего. Чтобы увидеть, как, посмотрите на метод <code>closePopup()</code> раз:

source: Clicking the "send" or "cancel" buttons clears the popup view. The <code>closePopup()</code> function navigates imperatively with the <code><a href="../api/router/router#navigate">Router.navigate()</a></code> method, passing in a <a href="router-tutorial-toh#link-parameters-array">link parameters array</a>.
ja: 「送信」または「キャンセル」ボタンをクリックすると、ポップアップビューがクリアされます。 <code>closePopup()</code> 関数は、命令的でナビゲート <code><a href="../api/router/router#navigate">Router.navigate()</a></code> に渡して、メソッド<a href="router-tutorial-toh#link-parameters-array">リンクパラメータアレイ</a>。
ko: "보내기"또는 "취소"버튼을 클릭하면 팝업보기가 지워집니다. <code>closePopup()</code> 함수는 불가피으로 탐색 <code><a href="../api/router/router#navigate">Router.navigate()</a></code> (A)에 전달하는 방법 <a href="router-tutorial-toh#link-parameters-array">링크 파라미터 어레이</a> .
ru: При нажатии кнопки &laquo;отправить&raquo; или &laquo;отменить&raquo; всплывающее окно очищается. Функция <code>closePopup()</code> выполняет императивную навигацию с помощью <code><a href="../api/router/router#navigate">Router.navigate()</a></code> , передавая <a href="router-tutorial-toh#link-parameters-array">массив параметров ссылки</a> .

source: Clicking the <strong>Toggle Format</strong> button alternates the date format between <strong>04/15/1988</strong> and <strong>Friday, April 15, 1988</strong> as shown in Figure 1.
ja: クリックする<strong>トグルフォーマット</strong>間の日付形式交互ボタン<strong>1988年4月15日</strong>および<strong>1988年4月15日（金曜日）を</strong>図1に示すように。
ko: 딸깍 <strong>토글 형식</strong> 사이의 날짜 형식 번갈아 버튼 <strong>1988년 4월 15일</strong> 및 <strong>1988년 4월 15일 (금요일)을</strong> 그림 1과 같이.
ru: Щелчок <strong>Формат Переключить</strong> кнопку чередуется формат даты между <strong>04/15/1988</strong> и в <strong>пятницу, 15 апреля 1988 года</strong> , как показано на рисунке 1.

source: Clicking the anchor should trigger the <code>onClick()</code> method, which sets the stub's telltale <code>navigatedTo</code> property. Tests inspect <code>navigatedTo</code> to confirm that clicking the anchor set the expected route definition.
es: Al hacer clic en el delimitador, se activar&aacute; el m&eacute;todo <code>onClick()</code> , que establece la propiedad indicadora del stub <code>navigatedTo</code> . Las pruebas inspeccionan <code>navigatedTo</code> para confirmar que al hacer clic en el ancla se establece la definici&oacute;n de ruta esperada.
ja: アンカーをクリックすると、 <code>onClick()</code> メソッドがトリガーされ、スタブのtelltale <code>navigatedTo</code> プロパティが設定されます。テストでは、 <code>navigatedTo</code> を検査して、アンカーをクリックすると、予想されるルート定義が設定されたことを確認します。
ko: 앵커를 클릭하면 <code>onClick()</code> 메서드 가 트리거 되어 스텁의 telltale <code>navigatedTo</code> 속성 이 설정 됩니다. 앵커를 클릭하면 예상 경로 정의가 설정되었는지 확인 하기 위해 <code>navigatedTo</code> 를 테스트 합니다.
ru: Нажатие на якорь должно вызвать метод <code>onClick()</code> , который устанавливает свойство заглушки заглушки <code>navigatedTo</code> . Тесты проверяют <code>navigatedTo</code> , чтобы подтвердить, что нажатие на якорь устанавливает ожидаемое определение маршрута.

source: Clicking the anchor should trigger the <code>onClick()</code> method, which sets the stub's telltale <code>navigatedTo</code> property. Tests inspect <code>navigatedTo</code> to confirm that clicking the anchor sets the expected route definition.
ja: アンカーをクリックすると、 <code>onClick()</code> メソッドがトリガーされ、スタブの明確な <code>navigatedTo</code> プロパティが設定されます。テストは <code>navigatedTo</code> を検査して、アンカーをクリックすると予想されるルート定義が設定されることを確認します。
ko: 앵커를 클릭하면 스텁의 telltale <code>navigatedTo</code> 속성 을 설정하는 <code>onClick()</code> 메서드 가 트리거되어야합니다 . 테스트에서 <code>navigatedTo</code> 를 검사 하여 앵커를 클릭하면 예상 경로 정의가 설정되는지 확인합니다.
ru: Щелчок по привязке должен запускать метод <code>onClick()</code> , который устанавливает контрольное свойство <code>navigatedTo</code> заглушки . Тесты inspect <code>navigatedTo</code> , чтобы подтвердить, что щелчок по привязке устанавливает ожидаемое определение маршрута.

source: Clicking the browser's back and forward buttons to navigate backward and forward through the browser history.
ja: ブラウザの戻るボタンと進むボタンをクリックすると、ブラウザの履歴を前後に移動することができます。
ko: 브라우저의 뒤로 및 앞으로 버튼을 클릭하여 브라우저 기록을 앞뒤로 탐색합니다.
ru: Нажатие на кнопки браузера "Назад" и "Вперед" для навигации по истории браузера.

source: Clicking the buttons updates the <code>AppComponent.fontSizePx</code> via the two-way binding. The revised <code>AppComponent.fontSizePx</code> value flows through to the <em>style</em> binding, making the displayed text bigger or smaller.
es: Al hacer clic en los botones, se actualiza <code>AppComponent.fontSizePx</code> a trav&eacute;s del enlace bidireccional. El valor revisado de <code>AppComponent.fontSizePx</code> fluye a trav&eacute;s del enlace de <em>estilo</em> , haciendo que el texto mostrado sea m&aacute;s grande o m&aacute;s peque&ntilde;o.
ja: ボタンをクリックすると、双方向バインディングを介して <code>AppComponent.fontSizePx</code> が更新されます。改訂された <code>AppComponent.fontSizePx</code> 値は<em>スタイル</em>バインディングに流れ、表示されるテキストを大きくまたは小さくします。
ko: 버튼을 클릭하면 양방향 바인딩을 통해 <code>AppComponent.fontSizePx</code> 가 업데이트됩니다 . 수정 된 <code>AppComponent.fontSizePx</code> 값은 <em>스타일</em> 바인딩으로 전달되어 표시된 텍스트를 더 크게 또는 더 작게 만듭니다.
ru: Нажатие на кнопки обновляет <code>AppComponent.fontSizePx</code> через двустороннюю привязку. Пересмотренное значение <code>AppComponent.fontSizePx</code> проходит через привязку <em>стиля</em> , делая отображаемый текст больше или меньше.

source: Clicking the buttons updates the <code>AppComponent.fontSizePx</code>. The revised <code>AppComponent.fontSizePx</code> value updates the style binding, which makes the displayed text bigger or smaller.
ja: ボタンをクリックすると、 <code>AppComponent.fontSizePx</code> が更新されます。改訂された <code>AppComponent.fontSizePx</code> 値は、スタイルバインディングを更新し、表示されるテキストを拡大または縮小します。
ko: 버튼을 클릭하면 <code>AppComponent.fontSizePx</code> 가 업데이트 됩니다 . 수정 된 <code>AppComponent.fontSizePx</code> 값은 스타일 바인딩을 업데이트하여 표시되는 텍스트를 더 크게 또는 더 작게 만듭니다.
ru: При нажатии кнопок обновляется <code>AppComponent.fontSizePx</code> . Пересмотренный <code>AppComponent.fontSizePx</code> значение обновляет стиль связывания, что делает отображение текста больше или меньше.

source: Clicking the first link opens the code sample on StackBlitz in a new browser tab.
es: Al hacer clic en el primer enlace se abre la muestra de código en StackBlitz en una nueva pestaña del navegador.
ja: 最初のリンクをクリックすると、StackBlitzのコードサンプルが新しいブラウザタブで開きます。
ko: 첫 번째 링크를 클릭하면 새 브라우저 탭에서 StackBlitz의 코드 샘플이 열립니다.
ru: Нажатие на первую ссылку открывает пример кода на StackBlitz в новой вкладке браузера.

source: Clicking the hero should raise a <code>selected</code> event that the host component (<code>DashboardComponent</code> presumably) can hear:
es: Al hacer clic en el h&eacute;roe deber&iacute;a aparecer un evento <code>selected</code> que el componente host ( presumiblemente, <code>DashboardComponent</code> ) puede escuchar:
ja: ヒーローをクリックすると、ホストコンポーネント（おそらく <code>DashboardComponent</code> ）が聞くことができる <code>selected</code> イベントが発生します。
ko: 영웅을 클릭하면 호스트 구성 요소 ( <code>DashboardComponent</code> 구성 요소 )가들을 수 있는 <code>selected</code> 이벤트가 발생합니다 .
ru: Щелчок по герою должен вызвать <code>selected</code> событие, которое может услышать компонент узла ( предположительно, <code>DashboardComponent</code> ):

source: Client-server interaction
es: Interacción cliente-servidor
ja: クライアントとサーバーの相互作用
ko: 클라이언트-서버 상호 작용
ru: Взаимодействие клиент-сервер

source: Clone the request object, using its <code>clone()</code> method.
ja: <code>clone()</code> メソッドを使用して、リクエストオブジェクトのクローンを作成します。
ko: <code>clone()</code> 메서드를 사용하여 요청 객체를 복제합니다 .
ru: Клонируйте объект запроса, используя его метод <code>clone()</code> .

source: Clone the resulting value so that it has a new identity.
ja: 結果の値をクローン化して、新しい ID を持つようにします。
ko: 결과 값을 복제하여 새 ID를 갖습니다.
ru: Клонируй полученное значение так,чтобы оно имело новую идентичность.

source: Close the application tab, but not the window. This should also close the Developer Tools.
es: Cierra la pestaña de la aplicación,pero no la ventana.Esto también debería cerrar las herramientas de desarrollo.
ja: ウィンドウではなく、アプリケーションタブを閉じます。これにより、Developer Toolsも閉じられるはずです。
ko: 응용 프로그램 탭을 닫고 창은 닫지 마십시오. 개발자 도구도 닫아야합니다.
ru: Закройте вкладку приложения,но не окно.Это также должно закрыть Инструменты разработчика.

source: Closest replacement in <code>@angular/common/<a href="../api/common/http">http</a>/testing</code>
es: Reemplazo m&aacute;s cercano en <code>@angular/common/<a href="../api/common/http">http</a>/testing</code>
ja: <code>@angular/common/<a href="../api/common/http">http</a>/testing</code> <a href="../api/common/http">http</a> / testingで最も近い置換
ko: <code>@angular/common/<a href="../api/common/http">http</a>/testing</code> <a href="../api/common/http">http</a> / testing 에서 가장 가까운 대체
ru: Ближайшая замена в <code>@angular/common/<a href="../api/common/http">http</a>/testing</code>

source: Closest replacement in <code>@angular/common/<a href="../api/common/http">http</a></code>
es: Reemplazo m&aacute;s cercano en <code>@angular/common/<a href="../api/common/http">http</a></code>
ja: <code>@angular/common/<a href="../api/common/http">http</a></code> <a href="../api/common/http">httpで</a>最も近い置換
ko: <code>@angular/common/<a href="../api/common/http">http</a></code> <a href="../api/common/http">http</a> 에서 가장 가까운 대체
ru: Ближайшая замена в <code>@angular/common/<a href="../api/common/http">http</a></code>

source: Code Tabs
es: Pestañas de código
ja: コードタブ
ko: 코드 탭
ru: Вкладки кода

source: Code associated with a component that defines how to render the component's <a href="glossary#view">view</a>.
es: C&oacute;digo asociado con un componente que define c&oacute;mo representar la <a href="glossary#view">vista</a> del componente .
ja: コンポーネントの<a href="glossary#view">ビューの</a>レンダリング方法を定義するコンポーネントに関連付けられたコード。
ko: 구성 요소의 <a href="glossary#view">보기</a> 를 렌더링하는 방법을 정의하는 구성 요소와 연관된 코드 입니다.
ru: Код , связанный с компонентом , который определяет , как сделать компонент <a href="glossary#view">вида</a> .

source: Code coverage enforcement
es: Aplicación de la cobertura del código
ja: コードカバレッジの実施
ko: 코드 적용 범위 시행
ru: Обеспечение соблюдения Кодекса

source: Code example
es: Ejemplo de código
ja: コード例
ko: 코드 예
ru: Пример кода

source: Code folding
es: Plegado de códigos
ja: コードの折り返し
ko: 코드 접기
ru: Складывание кода

source: Code review
es: Revisión del código
ja: コードレビュー
ko: 코드 검토
ru: Обзор Кодекса

source: Code samples are located in sub-folders of the <code>content/examples</code> directory of the <code>angular/angular</code> repository. An example folder name should be the same as the guide page it supports.
es: Los ejemplos de c&oacute;digo se encuentran en subcarpetas del directorio de <code>content/examples</code> del repositorio <code>angular/angular</code> . Un nombre de carpeta de ejemplo debe ser el mismo que el de la p&aacute;gina de gu&iacute;a que admite.
ja: コードサンプルは、 <code>angular/angular</code> リポジトリの <code>content/examples</code> ディレクトリのサブフォルダーにあります。サンプルのフォルダ名は、サポートされているガイドページと同じにする必要があります。
ko: 코드 샘플은 <code>angular/angular</code> 저장소 의 <code>content/examples</code> 디렉토리의 하위 폴더에 있습니다. 폴더 이름의 예는 지원하는 가이드 페이지와 같아야합니다.
ru: Образцы кода расположены в папках , вложенных в <code>content/examples</code> каталога <code>angular/angular</code> хранилища. Имя папки примера должно совпадать с поддерживаемой страницей руководства.

source: Code snippet from a file
es: Fragmento de código de un archivo
ja: ファイルからのコードスニペット
ko: 파일의 코드 스 니펫
ru: Фрагмент кода из файла

source: Code snippet markup is always in the form of a comment. Here's the default <em>docregion</em> markup for a TypeScript or JavaScript file:
es: El marcado del fragmento de c&oacute;digo siempre tiene la forma de un comentario. Aqu&iacute; est&aacute; el marcado de <em>docregion</em> predeterminado para un archivo TypeScript o JavaScript:
ja: コードスニペットマークアップは常にコメントの形式です。TypeScriptまたはJavaScriptファイルのデフォルトの<em>docregion</em>マークアップは<em>次のとおり</em>です。
ko: 코드 스 니펫 마크 업은 항상 주석 형태입니다. TypeScript 또는 JavaScript 파일 의 기본 <em>docregion</em> 마크 업은 다음과 같습니다 .
ru: Разметка фрагмента кода всегда находится в форме комментария. Вот разметка <em>docregion</em> по умолчанию для файла TypeScript или JavaScript:

source: Code snippet markup is not supported for JSON files because comments are forbidden in JSON files.
es: El marcado de fragmentos de código no es compatible con los archivos JSON porque los comentarios están prohibidos en los archivos JSON.
ja: JSONファイルではコメントが禁止されているため、コードスニペットのマークアップはサポートされていません。
ko: 주석은 JSON 파일에서 금지되므로 JSON 파일에는 코드 스 니펫 마크 업이 지원되지 않습니다.
ru: Разметка фрагментов кода не поддерживается для JSON-файлов,так как комментарии запрещены в JSON-файлах.
