Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/angular/angular.*.006.xlf
Languages: es, ja, ko, ru, zh_cn

source: Constructs a <code>HEAD</code> request that interprets the body as a text string and returns the full event stream.
es: Construye una solicitud <code>HEAD</code> que interpreta el cuerpo como una cadena de texto y devuelve la secuencia completa del evento.
ja: 構築 <code>HEAD</code> のテキスト文字列として体を解釈し、完全なイベントストリームを返す要求を。
ko: 본문을 텍스트 문자열로 해석하고 전체 이벤트 스트림을 반환 하는 <code>HEAD</code> 요청을 구성합니다.
ru: Создает запрос <code>HEAD</code> , который интерпретирует тело как текстовую строку и возвращает полный поток событий.

source: Constructs a <code>HEAD</code> request that interprets the body as a text string and returns the response as a string value.
es: Construye una solicitud <code>HEAD</code> que interpreta el cuerpo como una cadena de texto y devuelve la respuesta como un valor de cadena.
ja: 構築 <code>HEAD</code> のテキスト文字列として本体を解釈し、文字列値として応答を返す要求を。
ko: 본문을 텍스트 문자열로 해석하고 응답을 문자열 값으로 반환 하는 <code>HEAD</code> 요청을 구성합니다.
ru: Создает запрос <code>HEAD</code> , который интерпретирует тело как текстовую строку и возвращает ответ как строковое значение.

source: Constructs a <code>HEAD</code> request that interprets the body as an <code>ArrayBuffer</code> and returns the full HTTP response.
es: Construye una solicitud <code>HEAD</code> que interpreta el cuerpo como un <code>ArrayBuffer</code> y devuelve la respuesta HTTP completa.
ja: 構築 <code>HEAD</code> のように本体を解釈し、要求 <code>ArrayBuffer</code> 、フルHTTP応答を返信します。
ko: 본문을 <code>ArrayBuffer</code> 로 해석 하고 전체 HTTP 응답을 반환 하는 <code>HEAD</code> 요청을 구성합니다 .
ru: Создает запрос <code>HEAD</code> , который интерпретирует тело как <code>ArrayBuffer</code> и возвращает полный HTTP-ответ.

source: Constructs a <code>HEAD</code> request that interprets the body as an <code>ArrayBuffer</code> and returns the full event stream.
es: Construye una solicitud <code>HEAD</code> que interpreta el cuerpo como un <code>ArrayBuffer</code> y devuelve la secuencia completa del evento.
ja: 構築 <code>HEAD</code> のように本体を解釈し、要求 <code>ArrayBuffer</code> フルイベントストリームを返しています。
ko: 본문을 <code>ArrayBuffer</code> 로 해석 하고 전체 이벤트 스트림을 반환 하는 <code>HEAD</code> 요청을 구성 합니다.
ru: Создает запрос <code>HEAD</code> , который интерпретирует тело как <code>ArrayBuffer</code> и возвращает полный поток событий.

source: Constructs a <code>HEAD</code> request that interprets the body as an <code>ArrayBuffer</code> and returns the response as an <code>ArrayBuffer</code>.
es: Construye una solicitud <code>HEAD</code> que interpreta el cuerpo como un <code>ArrayBuffer</code> y devuelve la respuesta como un <code>ArrayBuffer</code> .
ja: 構築 <code>HEAD</code> のように本体を解釈し、要求 <code>ArrayBuffer</code> やとしての応答を返し <code>ArrayBuffer</code> を。
ko: 본문을 <code>ArrayBuffer</code> 로 해석 하고 응답을 <code>ArrayBuffer</code> 로 리턴 하는 <code>HEAD</code> 요청을 구성 합니다.
ru: Создает запрос <code>HEAD</code> , который интерпретирует тело как <code>ArrayBuffer</code> и возвращает ответ как <code>ArrayBuffer</code> .

source: Constructs a <code>HEAD</code> request that interprets the body as text stream and returns the full <code>HTTPResponse</code>.
es: Construye una solicitud <code>HEAD</code> que interpreta el cuerpo como una secuencia de texto y devuelve la <code>HTTPResponse</code> completa .
ja: 構築 <code>HEAD</code> の要求をそのテキストストリームとして解釈体戻るフル <code>HTTPResponse</code> は。
ko: 본문을 텍스트 스트림으로 해석하고 전체 <code>HTTPResponse</code> 를 리턴 하는 <code>HEAD</code> 요청을 구성합니다 .
ru: Создает запрос <code>HEAD</code> , который интерпретирует тело как текстовый поток и возвращает полный <code>HTTPResponse</code> .

source: Constructs a <code>JSONP</code> request for the given URL and name of the callback parameter.
es: Construye una solicitud <code>JSONP</code> para la URL dada y el nombre del par&aacute;metro de devoluci&oacute;n de llamada.
ja: 構築 <code>JSONP</code> のコールバックパラメータの指定されたURLと名前の要求を。
ko: 구축 <code>JSONP</code> 의 콜백 매개 변수의 특정 URL에 대한 요청 및 이름입니다.
ru: Создает запрос <code>JSONP</code> для заданного URL-адреса и имени параметра обратного вызова.

source: Constructs a <code>PATCH</code> request that interprets the body as a <code>Blob</code> and returns the full <code>HTTPResponse</code>.
es: Construye una solicitud <code>PATCH</code> que interpreta el cuerpo como un <code>Blob</code> y devuelve la <code>HTTPResponse</code> completa .
ja: 構築 <code>PATCH</code> の解釈として本体その要求 <code>Blob</code> 、完全な戻り <code>HTTPResponse</code> はに。
ko: 본문을 <code>Blob</code> 으로 해석 하고 전체 <code>HTTPResponse</code> 를 리턴 하는 <code>PATCH</code> 요청을 구성합니다 .
ru: Создает запрос <code>PATCH</code> , который интерпретирует тело как <code>Blob</code> и возвращает полный <code>HTTPResponse</code> .

source: Constructs a <code>PATCH</code> request that interprets the body as a <code>Blob</code> and returns the full event stream.
es: Construye una solicitud <code>PATCH</code> que interpreta el cuerpo como un <code>Blob</code> y devuelve la secuencia completa del evento.
ja: 構築 <code>PATCH</code> として本体を解釈し、要求 <code>Blob</code> と完全イベントストリームを返しています。
ko: 본문을 <code>Blob</code> 으로 해석 하고 전체 이벤트 스트림을 반환 하는 <code>PATCH</code> 요청을 구성 합니다.
ru: Создает запрос <code>PATCH</code> , который интерпретирует тело как <code>Blob</code> объект и возвращает полный поток событий.

source: Constructs a <code>PATCH</code> request that interprets the body as a <code>Blob</code> and returns the response as a <code>Blob</code>.
es: Construye una solicitud <code>PATCH</code> que interpreta el cuerpo como un <code>Blob</code> y devuelve la respuesta como un <code>Blob</code> .
ja: 構築 <code>PATCH</code> として本体を解釈し、要求 <code>Blob</code> ととしての応答を返し <code>Blob</code> 。
ko: 본문을 <code>Blob</code> 으로 해석 하고 응답을 <code>Blob</code> 으로 반환 하는 <code>PATCH</code> 요청을 구성합니다 .
ru: Создает запрос <code>PATCH</code> , который интерпретирует тело как <code>Blob</code> и возвращает ответ как <code>Blob</code> .

source: Constructs a <code>PATCH</code> request that interprets the body as a JSON object and returns the full <code>HTTPResponse</code>.
es: Construye una solicitud <code>PATCH</code> que interpreta el cuerpo como un objeto JSON y devuelve la <code>HTTPResponse</code> completa .
ja: 構築 <code>PATCH</code> の要求をそのJSONオブジェクトとして解釈体と完全戻り <code>HTTPResponse</code> は。
ko: 본문을 JSON 객체로 해석하고 전체 <code>HTTPResponse</code> 를 반환 하는 <code>PATCH</code> 요청을 구성합니다 .
ru: Создает запрос <code>PATCH</code> , который интерпретирует тело как объект JSON и возвращает полный <code>HTTPResponse</code> .

source: Constructs a <code>PATCH</code> request that interprets the body as a JSON object and returns the full event stream.
es: Construye una solicitud <code>PATCH</code> que interpreta el cuerpo como un objeto JSON y devuelve la secuencia completa del evento.
ja: 構築 <code>PATCH</code> の JSONオブジェクトとして本体を解釈し、完全なイベント・ストリームを返す要求を。
ko: 본문을 JSON 객체로 해석하고 전체 이벤트 스트림을 반환 하는 <code>PATCH</code> 요청을 구성합니다.
ru: Создает запрос <code>PATCH</code> , который интерпретирует тело как объект JSON и возвращает полный поток событий.

source: Constructs a <code>PATCH</code> request that interprets the body as a JSON object and returns the response body as a JSON object.
es: Construye una solicitud <code>PATCH</code> que interpreta el cuerpo como un objeto JSON y devuelve el cuerpo de la respuesta como un objeto JSON.
ja: 構築 <code>PATCH</code> の JSONオブジェクトとして本体を解釈し、JSONオブジェクトとしてレスポンスボディを返す要求を。
ko: 본문을 JSON 객체로 해석하고 응답 본문을 JSON 객체로 반환 하는 <code>PATCH</code> 요청을 구성합니다.
ru: Создает запрос <code>PATCH</code> , который интерпретирует тело как объект JSON и возвращает тело ответа как объект JSON.

source: Constructs a <code>PATCH</code> request that interprets the body as a JSON object and returns the response in a given type.
es: Construye una solicitud <code>PATCH</code> que interpreta el cuerpo como un objeto JSON y devuelve la respuesta en un tipo dado.
ja: 構築 <code>PATCH</code> の JSONオブジェクトとして本体を解釈し、指定されたタイプで応答を返す要求を。
ko: 본문을 JSON 객체로 해석하고 지정된 유형으로 응답을 반환 하는 <code>PATCH</code> 요청을 구성합니다.
ru: Создает запрос <code>PATCH</code> , который интерпретирует тело как объект JSON и возвращает ответ в заданном типе.

source: Constructs a <code>PATCH</code> request that interprets the body as a text stream and returns the full <code>HTTPResponse</code>.
es: Construye una solicitud <code>PATCH</code> que interpreta el cuerpo como una secuencia de texto y devuelve la <code>HTTPResponse</code> completa .
ja: 構築 <code>PATCH</code> の要求をその解釈テキストストリームとリターンフルなどの身体 <code>HTTPResponse</code> は。
ko: 본문을 텍스트 스트림으로 해석하고 전체 <code>HTTPResponse</code> 를 리턴 하는 <code>PATCH</code> 요청을 구성합니다 .
ru: Создает запрос <code>PATCH</code> , который интерпретирует тело как текстовый поток и возвращает полный <code>HTTPResponse</code> .

source: Constructs a <code>PATCH</code> request that interprets the body as a text string and returns the full event stream.
es: Construye una solicitud <code>PATCH</code> que interpreta el cuerpo como una cadena de texto y devuelve la secuencia completa del evento.
ja: 構築 <code>PATCH</code> のテキスト文字列として体を解釈し、完全なイベントストリームを返す要求を。
ko: 본문을 텍스트 문자열로 해석하고 전체 이벤트 스트림을 반환 하는 <code>PATCH</code> 요청을 구성합니다.
ru: Создает запрос <code>PATCH</code> , который интерпретирует тело как текстовую строку и возвращает полный поток событий.

source: Constructs a <code>PATCH</code> request that interprets the body as a text string and returns the response as a string value.
ja: 構築 <code>PATCH</code> のテキスト文字列として本体を解釈し、文字列値として応答を返す要求を。
ko: 본문을 텍스트 문자열로 해석하고 응답을 문자열 값으로 반환 하는 <code>PATCH</code> 요청을 구성합니다.
ru: Создает запрос <code>PATCH</code> , который интерпретирует тело как текстовую строку и возвращает ответ как строковое значение.

source: Constructs a <code>PATCH</code> request that interprets the body as an <code>ArrayBuffer</code> and returns the full <code>HTTPResponse</code>.
es: Construye una solicitud <code>PATCH</code> que interpreta el cuerpo como un <code>ArrayBuffer</code> y devuelve la <code>HTTPResponse</code> completa .
ja: 構築 <code>PATCH</code> の解釈として本体その要求 <code>ArrayBuffer</code> は、完全な戻り <code>HTTPResponse</code> はに。
ko: 본문을 <code>ArrayBuffer</code> 로 해석 하고 전체 <code>HTTPResponse</code> 를 반환 하는 <code>PATCH</code> 요청을 구성합니다 .
ru: Создает запрос <code>PATCH</code> , который интерпретирует тело как <code>ArrayBuffer</code> и возвращает полный <code>HTTPResponse</code> .

source: Constructs a <code>PATCH</code> request that interprets the body as an <code>ArrayBuffer</code> and returns the response as an <code>ArrayBuffer</code>.
es: Construye una solicitud <code>PATCH</code> que interpreta el cuerpo como un <code>ArrayBuffer</code> y devuelve la respuesta como un <code>ArrayBuffer</code> .
ja: 構築 <code>PATCH</code> として本体を解釈し、要求 <code>ArrayBuffer</code> やとしての応答を返し <code>ArrayBuffer</code> を。
ko: 본문을 <code>ArrayBuffer</code> 로 해석 하고 응답을 <code>ArrayBuffer</code> 로 리턴 하는 <code>PATCH</code> 요청을 구성 합니다.
ru: Создает запрос <code>PATCH</code> , который интерпретирует тело как <code>ArrayBuffer</code> и возвращает ответ как <code>ArrayBuffer</code> .

source: Constructs a <code>PATCH</code> request that interprets the body as an <code>ArrayBuffer</code> and returns the the full event stream.
es: Construye una solicitud <code>PATCH</code> que interpreta el cuerpo como un <code>ArrayBuffer</code> y devuelve la secuencia completa del evento.
ja: 構築 <code>PATCH</code> の要求と解釈体 <code>ArrayBuffer</code> 戻る完全なイベントストリームを。
ko: 본문을 <code>ArrayBuffer</code> 로 해석 하여 전체 이벤트 스트림을 반환 하는 <code>PATCH</code> 요청을 구성 합니다.
ru: Создает запрос <code>PATCH</code> , который интерпретирует тело как <code>ArrayBuffer</code> и возвращает полный поток событий.

source: Constructs a <code>PATCH</code> request that interprets the body as as a text string and returns the response as a string value.
es: Construye una solicitud <code>PATCH</code> que interpreta el cuerpo como una cadena de texto y devuelve la respuesta como un valor de cadena.
ja: 構築 <code>PATCH</code> のテキスト文字列などのように身体を解釈し、文字列値として応答を返す要求を。
ko: 본문을 텍스트 문자열로 해석하고 응답을 문자열 값으로 반환 하는 <code>PATCH</code> 요청을 구성합니다.
ru: Создает запрос <code>PATCH</code> , который интерпретирует тело как текстовую строку и возвращает ответ как строковое значение.

source: Constructs a <code>POST</code> request that interprets the body as a <code>Blob</code> and returns the full <code>HTTPResponse</code>.
es: Construye una solicitud <code>POST</code> que interpreta el cuerpo como un <code>Blob</code> y devuelve la <code>HTTPResponse</code> completa .
ja: 構築 <code>POST</code> のリクエストを、そのような解釈体 <code>Blob</code> と完全戻り <code>HTTPResponse</code> は。
ko: 본문을 <code>Blob</code> 으로 해석 하고 전체 <code>HTTPResponse</code> 를 반환 하는 <code>POST</code> 요청을 구성합니다 .
ru: Создает <code>POST</code> - запрос, который интерпретирует тело как <code>Blob</code> объект и возвращает полный <code>HTTPResponse</code> .

source: Constructs a <code>POST</code> request that interprets the body as a <code>Blob</code> and returns the response as a <code>Blob</code>.
es: Construye una solicitud <code>POST</code> que interpreta el cuerpo como un <code>Blob</code> y devuelve la respuesta como un <code>Blob</code> .
ja: 構築 <code>POST</code> のリクエストを、そのような解釈体 <code>Blob</code> を返すとして応答 <code>Blob</code> 。
ko: 본문을 <code>Blob</code> 으로 해석 하고 응답을 <code>Blob</code> 으로 반환 하는 <code>POST</code> 요청을 구성합니다 .
ru: Создает запрос <code>POST</code> , который интерпретирует тело как <code>Blob</code> и возвращает ответ как <code>Blob</code> .

source: Constructs a <code>POST</code> request that interprets the body as a <code>Blob</code> and returns the response in an observable of the full event stream.
es: Construye una solicitud <code>POST</code> que interpreta el cuerpo como un <code>Blob</code> y devuelve la respuesta en un observable de la secuencia completa del evento.
ja: 構築 <code>POST</code> のように体を解釈し、要求 <code>Blob</code> と完全イベントストリームの観察に応答を返しています。
ko: 본문을 <code>Blob</code> 으로 해석 하고 전체 이벤트 스트림의 관찰 가능에 응답을 반환 하는 <code>POST</code> 요청을 구성 합니다.
ru: Создает запрос <code>POST</code> , который интерпретирует тело как <code>Blob</code> объект и возвращает ответ в виде наблюдаемого полного потока событий.

source: Constructs a <code>POST</code> request that interprets the body as a JSON object and returns an observable of the response.
es: Construye una solicitud <code>POST</code> que interpreta el cuerpo como un objeto JSON y devuelve una respuesta observable.
ja: 構築 <code>POST</code> の JSONオブジェクトとして本体を解釈し、応答の観察を返す要求を。
ko: 본문을 JSON 객체로 해석하고 관찰 가능한 응답을 반환 하는 <code>POST</code> 요청을 구성합니다 .
ru: Создает запрос <code>POST</code> , который интерпретирует тело как объект JSON и возвращает наблюдаемую часть ответа.

source: Constructs a <code>POST</code> request that interprets the body as a JSON object and returns the full <code>HTTPResponse</code>.
es: Construye una solicitud <code>POST</code> que interpreta el cuerpo como un objeto JSON y devuelve la <code>HTTPResponse</code> completa .
ja: 構築 <code>POST</code> のリクエストをそのJSONオブジェクトとして解釈体と完全戻り <code>HTTPResponse</code> は。
ko: 본문을 JSON 객체로 해석하고 전체 <code>HTTPResponse</code> 를 반환 하는 <code>POST</code> 요청을 구성합니다 .
ru: Создает запрос <code>POST</code> , который интерпретирует тело как объект JSON и возвращает полный <code>HTTPResponse</code> .

source: Constructs a <code>POST</code> request that interprets the body as a JSON object and returns the response body as a JSON object.
es: Construye una solicitud <code>POST</code> que interpreta el cuerpo como un objeto JSON y devuelve el cuerpo de la respuesta como un objeto JSON.
ja: 構築物 <code>POST</code> リクエストそのJSONオブジェクトとしてJSONオブジェクトを返す応答ボディとして解釈体。
ko: 본문을 JSON 객체로 해석하고 응답 본문을 JSON 객체로 반환 하는 <code>POST</code> 요청을 구성합니다.
ru: Создает запрос <code>POST</code> , который интерпретирует тело как объект JSON и возвращает тело ответа как объект JSON.

source: Constructs a <code>POST</code> request that interprets the body as a text stream and returns the full <code>HTTPResponse</code>.
es: Construye una solicitud <code>POST</code> que interpreta el cuerpo como una secuencia de texto y devuelve la <code>HTTPResponse</code> completa .
ja: 構築 <code>POST</code> のリクエストをそのテキストストリームとして解釈体を、完全戻り <code>HTTPResponse</code> は。
ko: 본문을 텍스트 스트림으로 해석하고 전체 <code>HTTPResponse</code> 를 리턴 하는 <code>POST</code> 요청을 구성합니다 .
ru: Создает запрос <code>POST</code> , который интерпретирует тело как текстовый поток и возвращает полный <code>HTTPResponse</code> .

source: Constructs a <code>POST</code> request that interprets the body as a text string and returns the full event stream.
es: Construye una solicitud <code>POST</code> que interpreta el cuerpo como una cadena de texto y devuelve la secuencia completa del evento.
ja: 構築 <code>POST</code> のテキスト文字列として体を解釈し、完全なイベントストリームを返す要求を。
ko: 본문을 텍스트 문자열로 해석하고 전체 이벤트 스트림을 반환 하는 <code>POST</code> 요청을 구성합니다.
ru: Создает запрос <code>POST</code> , который интерпретирует тело как текстовую строку и возвращает полный поток событий.

source: Constructs a <code>POST</code> request that interprets the body as a text string and returns the response as a string value.
es: Construye una solicitud <code>POST</code> que interpreta el cuerpo como una cadena de texto y devuelve la respuesta como un valor de cadena.
ja: 構築 <code>POST</code> のテキスト文字列として本体を解釈し、文字列値として応答を返す要求を。
ko: 본문을 텍스트 문자열로 해석하고 응답을 문자열 값으로 반환 하는 <code>POST</code> 요청을 구성합니다.
ru: Создает запрос <code>POST</code> , который интерпретирует тело как текстовую строку и возвращает ответ как строковое значение.

source: Constructs a <code>POST</code> request that interprets the body as an <code>ArrayBuffer</code> and returns an <code>ArrayBuffer</code>.
ja: 構築 <code>POST</code> のリクエストを、そのような解釈体 <code>ArrayBuffer</code> 戻る <code>ArrayBuffer</code> 。
ko: 구축 <code>POST</code> 의 요구를한다는 등의 해석 몸 <code>ArrayBuffer</code> 과 다시 표시 <code>ArrayBuffer</code> .
ru: Создает запрос <code>POST</code> , который интерпретирует тело как <code>ArrayBuffer</code> и возвращает <code>ArrayBuffer</code> .

source: Constructs a <code>POST</code> request that interprets the body as an <code>ArrayBuffer</code> and returns the full event stream.
es: Construye una solicitud <code>POST</code> que interpreta el cuerpo como un <code>ArrayBuffer</code> y devuelve la secuencia completa del evento.
ja: 構築 <code>POST</code> のリクエストを、そのような解釈体 <code>ArrayBuffer</code> 戻る完全なイベントストリーム。
ko: 본문을 <code>ArrayBuffer</code> 로 해석 하여 전체 이벤트 스트림을 반환 하는 <code>POST</code> 요청을 구성 합니다.
ru: Создает запрос <code>POST</code> , который интерпретирует тело как <code>ArrayBuffer</code> и возвращает полный поток событий.

source: Constructs a <code>POST</code> request that interprets the body as an as an <code>ArrayBuffer</code> and returns an <code>ArrayBuffer</code>.
es: Construye una solicitud <code>POST</code> que interpreta el cuerpo como un <code>ArrayBuffer</code> y devuelve un <code>ArrayBuffer</code> .
ja: 構築 <code>POST</code> のリクエストをその解釈と同様に本体 <code>ArrayBuffer</code> 戻る <code>ArrayBuffer</code> 。
ko: 구축 <code>POST</code> 의 요청을 그 해석로로 몸 <code>ArrayBuffer</code> 과 다시 표시 <code>ArrayBuffer</code> .
ru: Создает <code>POST</code> - запрос, который интерпретирует тело как <code>ArrayBuffer</code> и возвращает <code>ArrayBuffer</code> .

source: Constructs a <code>PUT</code> request that interprets the body as a <code>Blob</code> and returns the full HTTP response.
es: Construye una solicitud <code>PUT</code> que interpreta el cuerpo como un <code>Blob</code> y devuelve la respuesta HTTP completa.
ja: 構築 <code>PUT</code> のように体を解釈し、要求 <code>Blob</code> と完全なHTTP応答を返信します。
ko: 본문을 <code>Blob</code> 으로 해석 하고 전체 HTTP 응답을 반환 하는 <code>PUT</code> 요청을 구성합니다 .
ru: Создает запрос <code>PUT</code> , который интерпретирует тело как <code>Blob</code> объект и возвращает полный HTTP-ответ.

source: Constructs a <code>PUT</code> request that interprets the body as a <code>Blob</code> and returns the full event stream.
es: Construye una solicitud <code>PUT</code> que interpreta el cuerpo como un <code>Blob</code> y devuelve la secuencia completa del evento.
ja: 構築 <code>PUT</code> のように体を解釈し、要求 <code>Blob</code> と完全イベントストリームを返しています。
ko: 본문을 <code>Blob</code> 으로 해석 하고 전체 이벤트 스트림을 반환 하는 <code>PUT</code> 요청을 구성 합니다.
ru: Создает запрос <code>PUT</code> , который интерпретирует тело как <code>Blob</code> объект и возвращает полный поток событий.

source: Constructs a <code>PUT</code> request that interprets the body as a <code>Blob</code> and returns the response as a <code>Blob</code>.
es: Construye una solicitud <code>PUT</code> que interpreta el cuerpo como un <code>Blob</code> y devuelve la respuesta como un <code>Blob</code> .
ja: 構築 <code>PUT</code> のように体を解釈し、要求 <code>Blob</code> ととしての応答を返し <code>Blob</code> 。
ko: 본문을 <code>Blob</code> 으로 해석 하고 응답을 <code>Blob</code> 으로 반환 하는 <code>PUT</code> 요청을 구성합니다 .
ru: Создает запрос <code>PUT</code> , который интерпретирует тело как <code>Blob</code> и возвращает ответ как <code>Blob</code> .

source: Constructs a <code>PUT</code> request that interprets the body as a JSON object and returns an observable of JSON object.
ja: 構築 <code>PUT</code> のJSONオブジェクトとして本体を解釈し、JSONオブジェクトの観察を返す要求を。
ko: 본문을 JSON 개체로 해석하고 관찰 가능한 JSON 개체를 반환 하는 <code>PUT</code> 요청을 생성합니다.
ru: Создает запрос <code>PUT</code> , который интерпретирует тело как объект JSON и возвращает наблюдаемый объект JSON.

source: Constructs a <code>PUT</code> request that interprets the body as a JSON object and returns an observable of the response.
es: Construye una solicitud <code>PUT</code> que interpreta el cuerpo como un objeto JSON y devuelve un observable de la respuesta.
ja: 構築 <code>PUT</code> の JSONオブジェクトとして本体を解釈し、応答の観察を返す要求を。
ko: 본문을 JSON 객체로 해석하고 응답을 관찰 할 수 있는 <code>PUT</code> 요청을 구성합니다 .
ru: Создает запрос <code>PUT</code> , который интерпретирует тело как объект JSON и возвращает наблюдаемую часть ответа.

source: Constructs a <code>PUT</code> request that interprets the body as a JSON object and returns the full HTTP response.
es: Construye una solicitud <code>PUT</code> que interpreta el cuerpo como un objeto JSON y devuelve la respuesta HTTP completa.
ja: 構築 <code>PUT</code> の JSONオブジェクトとして本体を解釈し、完全なHTTP応答を返信要求を。
ko: 본문을 JSON 객체로 해석하고 전체 HTTP 응답을 반환 하는 <code>PUT</code> 요청을 구성합니다 .
ru: Создает запрос <code>PUT</code> , который интерпретирует тело как объект JSON и возвращает полный HTTP-ответ.

source: Constructs a <code>PUT</code> request that interprets the body as a JSON object and returns the full event stream.
es: Construye una solicitud <code>PUT</code> que interpreta el cuerpo como un objeto JSON y devuelve la secuencia completa del evento.
ja: 構築 <code>PUT</code> の JSONオブジェクトとして本体を解釈し、完全なイベント・ストリームを返す要求を。
ko: 본문을 JSON 객체로 해석하고 전체 이벤트 스트림을 반환 하는 <code>PUT</code> 요청을 구성합니다.
ru: Создает запрос <code>PUT</code> , который интерпретирует тело как объект JSON и возвращает полный поток событий.

source: Constructs a <code>PUT</code> request that interprets the body as a JSON object and returns the response body as a JSON object.
es: Construye una solicitud <code>PUT</code> que interpreta el cuerpo como un objeto JSON y devuelve el cuerpo de la respuesta como un objeto JSON.
ja: 構築 <code>PUT</code> の JSONオブジェクトとして本体を解釈し、JSONオブジェクトとしてレスポンスボディを返す要求を。
ko: 본문을 JSON 객체로 해석하고 응답 본문을 JSON 객체로 반환 하는 <code>PUT</code> 요청을 구성합니다.
ru: Создает запрос <code>PUT</code> , который интерпретирует тело как объект JSON и возвращает тело ответа как объект JSON.

source: Constructs a <code>PUT</code> request that interprets the body as a text stream and returns the full HTTP response.
es: Construye una solicitud <code>PUT</code> que interpreta el cuerpo como una secuencia de texto y devuelve la respuesta HTTP completa.
ja: 構築 <code>PUT</code> のテキスト・ストリームとして本体を解釈し、完全なHTTP応答を返信要求を。
ko: 본문을 텍스트 스트림으로 해석하고 전체 HTTP 응답을 리턴 하는 <code>PUT</code> 요청을 구성합니다 .
ru: Создает запрос <code>PUT</code> , который интерпретирует тело как текстовый поток и возвращает полный HTTP-ответ.
