Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/angular/angular.*.006.xlf
Languages: es, ja, ko, ru, zh_cn

source: For more information on injector hierarchy and scoping, see <a href="providers">Providers</a> and the <a href="dependency-injection">DI Guide</a>.
zh_cn: 有关注入器层次结构和作用域的更多信息，请参阅<a href="providers">提供者</a>和<a href="dependency-injection">DI指南</a>。

source: For more information on modules, see <a href="ngmodules">NgModules</a>.
zh_cn: 有关模块的更多信息，请参见<a href="ngmodules">NgModules</a>。

source: For more information on modules, see the <a href="architecture#modules">Modules</a> section of the <a href="architecture">Architecture Overview</a>.
zh_cn: 有关模块的更多信息，请参见《<a href="architecture">体系结构概述》</a>的&ldquo; <a href="architecture#modules">模块&rdquo;</a>部分。

source: For more information on property binding, see the <a href="template-syntax#property-binding">Property binding</a> section of the <a href="template-syntax">Template Syntax</a> page.
zh_cn: 有关属性绑定的更多信息，请参见&ldquo; <a href="template-syntax">模板语法&rdquo;</a>页面的&ldquo; <a href="template-syntax#property-binding">属性绑定&rdquo;</a>部分。

source: For more information on routing, see the <a href="router#router-link">RouterLink binding</a> section of the <a href="router">Routing &amp; Navigation</a> page.
zh_cn: 有关路由的更多信息，请参见&ldquo; <a href="router">路由和导航&rdquo;</a>页面的<a href="router#router-link">RouterLink绑定</a>部分。

source: For more information on style binding, see the <a href="template-syntax#style-binding">Style binding</a> section of the <a href="template-syntax">Template Syntax</a> page.
zh_cn: 有关样式绑定的更多信息，请参见&ldquo; <a href="template-syntax">模板语法&rdquo;</a>页面的&ldquo; <a href="template-syntax#style-binding">样式绑定&rdquo;</a>部分。

source: For more information on the <code><a href="../api/common/ngstyle">ngStyle</a></code> directive, see <a href="template-syntax#ngStyle">NgStyle</a> section of the <a href="template-syntax">Template Syntax</a> page.
zh_cn: 有关 <code><a href="../api/common/ngstyle">ngStyle</a></code> 指令的更多信息，请参见&ldquo; <a href="template-syntax">模板语法&rdquo;</a>页面的<a href="template-syntax#ngStyle">NgStyle</a>部分。

source: For more information on the acceptable range for each of these numbers and other details see your native internationalization library.
zh_cn: 有关这些数字的可接受范围的更多信息以及其他细节,请参见您的本地国际化库。

source: For more information on two-way binding with <code><a href="../api/forms/ngmodel">ngModel</a></code>, see the <a href="template-syntax#ngModel">NgModel&mdash;Two-way binding to form elements with <code>[(ngModel)]</code></a> section of the <a href="template-syntax">Template Syntax</a> page.
zh_cn: 有关使用 <code><a href="../api/forms/ngmodel">ngModel</a></code> 进行双向绑定的更多信息，请参见<a href="template-syntax#ngModel">NgModel-使用 <code>[(ngModel)]</code> </a> &ldquo; <a href="template-syntax">模板语法&rdquo;</a>页面的[（ngModel）]部分进行双向绑定以形成元素。

source: For more information see <a href="workspace-config">Workspace Configuration</a>.
zh_cn: 有关更多信息，请参见<a href="workspace-config">工作区配置</a>。

source: For more information see the <a href="router#activated-route">Router guide</a>.
zh_cn: 有关更多信息，请参阅<a href="router#activated-route">路由器指南</a>。

source: For more information see the <a href="template-syntax#other-bindings">Attribute, class, and style bindings</a> section of the <a href="template-syntax">Template Syntax</a> page.
zh_cn: 有关更多信息，请参见&ldquo; <a href="template-syntax">模板语法&rdquo;</a>页面的&ldquo; <a href="template-syntax#other-bindings">属性，类和样式绑定&rdquo;</a>部分。

source: For more information see the <a href="template-syntax#property-binding">Property binding</a> section of the <a href="template-syntax">Template Syntax</a> page.
zh_cn: 有关更多信息，请参见&ldquo; <a href="template-syntax">模板语法&rdquo;</a>页面的&ldquo; <a href="template-syntax#property-binding">属性绑定&rdquo;</a>部分。

source: For more information, refer to <a href="styleguide#file-tree">this folder and file structure example.</a>
zh_cn: 有关更多信息，请参考<a href="styleguide#file-tree">此文件夹和文件结构示例。</a>

source: For more information, see <a href="../guide/browser-support">Browser Support</a>.
zh_cn: 有关更多信息，请参见<a href="../guide/browser-support">浏览器支持</a>。
