Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/angular/angular.*.006.xlf
Languages: es, ja, ko, ru, zh_cn

source: For a demonstration of the syntax and code snippets in this section, see the <span name="two-way-binding">two-way binding example</span>.
zh_cn: 有关本节中语法和代码段的演示，请参见<span name="two-way-binding">双向绑定示例</span>。

source: For a disabled <code><a href="formgroup">FormGroup</a></code>, the values of all controls as an object with a key-value pair for each member of the group.
zh_cn: 对于禁用的 <code><a href="formgroup">FormGroup</a></code> ，所有控件的值均作为对象，并具有组中每个成员的键值对。

source: For a list of DOM events, see: <a href="https://developer.mozilla.org/en-US/docs/Web/Events">https://developer.mozilla.org/en-US/docs/Web/Events</a>.
zh_cn: 有关DOM事件的列表，请参见：<a href="https://developer.mozilla.org/en-US/docs/Web/Events">https</a> : //developer.mozilla.org/en-US/docs/Web/Events。

source: For a more detailed discussion of the differences and their implications, see <a href="../../../guide/upgrade-performance">Upgrading for Performance</a>.
zh_cn: 有关差异及其影响的详细讨论，请参见<a href="../../../guide/upgrade-performance">性能升级</a>。

source: For a more detailed discussion of these concepts, see <a href="architecture-components">Introduction to components</a>.
zh_cn: 有关这些概念的详细讨论，请参阅<a href="architecture-components">组件简介</a>。

source: For a more detailed discussion, see <a href="architecture-modules">Introduction to modules</a>.
zh_cn: 有关更详细的讨论，请参阅<a href="architecture-modules">模块简介</a>。

source: For a more detailed discussion, see <a href="architecture-services">Introduction to services and DI</a>.
zh_cn: 有关更详细的讨论，请参见<a href="architecture-services">服务和DI简介</a>。

source: For a more detailed discussion, see <a href="router">Routing and navigation</a>.
zh_cn: 有关更详细的讨论，请参见&ldquo; <a href="router">路由和导航&rdquo;</a>。

source: For a more detailed look at different techniques and concepts surrounding SSR, please check out this <a href="https://developers.google.com/web/updates/2019/02/rendering-on-the-web">article</a>.
zh_cn: 要详细了解围绕SSR的不同技术和概念，请查看<a href="https://developers.google.com/web/updates/2019/02/rendering-on-the-web">本文</a>。

source: For a more strikingly visual effect, hide the data entry area and display something else.
zh_cn: 为了达到更醒目的视觉效果,可以将数据录入区隐藏起来,显示其他的东西。

source: For a multi-project workspace, application-specific end-to-end tests are in the project root, under <code>projects/project-name/e2e/</code>.
zh_cn: 对于多项目工作区，特定于应用程序的端到端测试位于项目根目录中的 <code>projects/project-name/e2e/</code> 。

source: For a newly created Angular application, the default <code>browserslist</code> looks like this:
zh_cn: 对于新创建的Angular应用程序，默认 <code>browserslist</code> 如下所示：

source: For a sample app using the app-wide singleton service that this page describes, see the showcasing all the documented features of NgModules.
zh_cn: 关于使用本页面所描述的全应用范围单例服务的示例应用,请参见展示NgModules的所有文档功能。

source: For a server that supports a cookie-based XSRF protection system, use directly to configure XSRF protection with the correct cookie and header names.
zh_cn: 对于支持基于cookie的XSRF保护系统的服务器,直接使用正确的cookie和头名来配置XSRF保护。

source: For a service, instead of using <code><a href="../api/router/routermodule#forRoot">forRoot()</a></code>, specify <code><a href="../api/core/injectable#providedIn">providedIn</a>: 'root'</code> on the service's <code>@<a href="../api/core/injectable">Injectable</a>()</code> decorator, which makes the service automatically available to the whole application and thus singleton by default.
zh_cn: 对于服务，而不是使用， <code><a href="../api/router/routermodule#forRoot">forRoot()</a></code> ，指定 <code><a href="../api/core/injectable#providedIn">providedIn</a>: 'root'</code> 上的服务的 <code>@<a href="../api/core/injectable">Injectable</a>()</code> 装饰，这使得在默认情况下自动提供给整个应用程序，因此单服务。

source: For a single-application workspace, the <code>src/</code> subfolder of the workspace contains the source files (application logic, data, and assets) for the root application. For a multi-project workspace, additional projects in the <code>projects/</code> folder contain a <code>project-name/src/</code> subfolder with the same structure.
zh_cn: 对于单应用程序工作空间，工作空间的 <code>src/</code> 子文件夹包含根应用程序的源文件（应用程序逻辑，数据和资产）。对于多项目工作区， <code>projects/</code> 文件夹中的其他项目包含具有相同结构的 <code>project-name/src/</code> 子文件夹。

source: For a use case in which <code>TestBed.get()</code> does not work, see the <a href="testing#component-override"><em>Override component providers</em></a> section that explains when and why you must get the service from the component's injector instead.
zh_cn: 对于 <code>TestBed.get()</code> 无法使用的用例，请参见&ldquo; <a href="testing#component-override"><em>重写组件提供者&rdquo;</em></a>部分，该部分说明了何时以及为什么必须从组件的注入器获取服务。

source: For a working app showcasing the resolution modifiers that this section covers, see the <span name="resolution-modifiers">resolution modifiers example</span>.
zh_cn: 有关展示本节介绍的分辨率修改器的有效应用程序，请参见<span name="resolution-modifiers">分辨率修改器示例</span>。

source: For accessibility, always set the <code>alt</code> attribute with a meaningful description of the image.
zh_cn: 为了实现可访问性，请始终为 <code>alt</code> 属性设置有意义的图像描述。

source: For additional guidelines and instructions on preparing an application for AOT compilation, see <a href="https://medium.com/sparkles-blog/angular-writing-aot-friendly-applications-7b64c8afbe3f">Angular: Writing AOT-friendly applications</a>.
zh_cn: 有关准备AOT编译应用程序的其他准则和说明，请参阅<a href="https://medium.com/sparkles-blog/angular-writing-aot-friendly-applications-7b64c8afbe3f">Angular：编写AOT友好的应用程序</a>。

source: For additional recommendations and examples, see:
zh_cn: 关于其他建议和实例,见:

source: For an enabled <code><a href="formgroup">FormGroup</a></code>, the values of enabled controls as an object with a key-value pair for each member of the group.
zh_cn: 对于已启用的 <code><a href="formgroup">FormGroup</a></code> ，已启用控件的值作为对象，具有组中每个成员的键值对。

source: For an example app showcasing all the techniques that NgModules related pages cover, see the live example. For explanations on the individual techniques, visit the relevant NgModule pages under the NgModules section.
zh_cn: 要想了解NgModules相关页面所涵盖的所有技术,请看实时示例。关于各个技术的解释,请访问NgModule部分下的相关NgModule页面。

source: For an existing application, you have to manually add the <code><a href="../api/router/routermodule">RouterModule</a></code> and defining a <code>&lt;<a href="../api/router/routeroutlet">router-outlet</a>&gt;</code> within your application.
zh_cn: 对于现有应用程序，您必须手动添加 <code><a href="../api/router/routermodule">RouterModule</a></code> 并在应用程序内定义 <code>&lt;<a href="../api/router/routeroutlet">router-outlet</a>&gt;</code> 。

source: For an extended example, see <a href="../../guide/dependency-injection-in-action#optional">"Dependency Injection Guide"</a>.
zh_cn: 有关扩展的示例，请参见<a href="../../guide/dependency-injection-in-action#optional">&ldquo;依赖关系注入指南&rdquo;</a>。

source: For an in-depth introduction to issues and techniques for designing accessible applications, see the <a href="https://developers.google.com/web/fundamentals/accessibility/#what_is_accessibility">Accessibility</a> section of the Google's <a href="https://developers.google.com/web/fundamentals/">Web Fundamentals</a>.
zh_cn: 有关设计可访问应用程序的问题和技术的深入介绍，请参阅Google <a href="https://developers.google.com/web/fundamentals/">网络基础知识</a>的<a href="https://developers.google.com/web/fundamentals/accessibility/#what_is_accessibility">可访问性</a>部分。

source: For any dependency that you need in your app, you must register a provider with the app's injector, so that the injector can use the provider to create new instances. For a service, the provider is typically the service class itself.
zh_cn: 对于您在应用程序中需要的任何依赖,您必须向应用程序的注入器注册一个提供者,这样注入器就可以使用提供者来创建新的实例。对于一个服务来说,提供者通常是服务类本身。

source: For applications that do not use the Angular service worker, refreshing now would display Chrome's Internet disconnected page that says "There is no Internet connection".
zh_cn: 对于不使用Angular服务工的应用,现在刷新会显示Chrome的Internet断开页面,显示 "没有Internet连接"。

source: For applications that use a module loader, TypeScript imports and exports (which are really ECMAScript 2015 imports and exports) can be used to organize code into modules.
zh_cn: 对于使用模块加载器的应用程序,可以使用TypeScript导入和导出(其实就是ECMAScript 2015导入和导出)将代码组织成模块。

source: For apps that run in the browser, import <code><a href="../api/platform-browser/browsermodule">BrowserModule</a></code> in the root <code>AppModule</code> because it provides services that are essential to launch and run a browser app. <code><a href="../api/platform-browser/browsermodule">BrowserModule</a></code>&rsquo;s providers are for the whole app so it should only be in the root module, not in feature modules. Feature modules only need the common directives in <code><a href="../api/common/commonmodule">CommonModule</a></code>; they don&rsquo;t need to re-install app-wide providers.
zh_cn: 对于在浏览器中运行的应用程序，请在根 <code>AppModule</code> 中导入 <code><a href="../api/platform-browser/browsermodule">BrowserModule</a></code> ，因为它提供了启动和运行浏览器应用程序所必需的服务。 <code><a href="../api/platform-browser/browsermodule">BrowserModule</a></code> 的提供程序适用于整个应用程序，因此应仅位于根模块中，而不能位于功能模块中。功能模块仅需要 <code><a href="../api/common/commonmodule">CommonModule</a></code> 中的通用指令；他们不需要重新安装应用程序范围的提供程序。

source: For apps that use routing
zh_cn: 对于使用路由的应用程序

source: For block code snippets, we generally prefer to display code with the Angular documentation <em>code-example</em> component represented by the <code>&lt;code-example&gt;</code> tag. The <code>&lt;code-example&gt;</code> tag has a <code>header</code> attribute that you use to identify the file that the example comes from. The header should be used whenever possible to establish the context of the example. See <a href="docs-style-guide#code-snippets-and-code-samples">Code snippets and code examples</a> for more details.
zh_cn: 对于块代码段，我们通常更喜欢使用 <code>&lt;code-example&gt;</code> 标签表示的Angular文档<em>代码示例</em>组件来显示代码。所述 <code>&lt;code-example&gt;</code> 标签具有 <code>header</code> 您用来标识该例子来自文件属性。只要有可能，就可以使用标题来建立示例的上下文。有关更多详细信息，请参见<a href="docs-style-guide#code-snippets-and-code-samples">代码段和代码示例</a>。

source: For cases where this is unavoidable, use the built-in Angular sanitization functions. Sanitize untrusted values with the <a href="../api/platform-browser/domsanitizer#sanitize">DomSanitizer.sanitize</a> method and the appropriate <code><a href="../api/core/securitycontext">SecurityContext</a></code>. That function also accepts values that were marked as trusted using the <code>bypassSecurityTrust</code>... functions, and will not sanitize them, as <a href="security#bypass-security-apis">described below</a>.
zh_cn: 对于不可避免的情况，请使用内置的Angular清理功能。使用<a href="../api/platform-browser/domsanitizer#sanitize">DomSanitizer.sanitize</a>方法和适当的 <code><a href="../api/core/securitycontext">SecurityContext</a></code> 清理不受信任的值。该函数还接受使用 <code>bypassSecurityTrust</code> ...函数标记为受信任的值，并且不会对其进行清理，如下<a href="security#bypass-security-apis">所述</a>。

source: For comparison, the demo shows both methods. One button adds the popup using the dynamic-loading method, and the other uses the custom element. You can see that the result is the same; only the preparation is different.
zh_cn: 为了便于比较,演示展示了两种方法。一个按钮使用动态加载方法添加弹出窗口,另一个使用自定义元素。你可以看到,结果是一样的,只是准备工作不同。

source: For context, consider setting a <em>single</em> style value with <a href="template-syntax#style-binding">style binding</a>, without <code><a href="../api/common/ngstyle">NgStyle</a></code>.
zh_cn: 对于上下文，请考虑使用<a href="template-syntax#style-binding">样式绑定</a>设置<em>单个</em>样式值，而不使用 <code><a href="../api/common/ngstyle">NgStyle</a></code> 。

source: For custom classes or interfaces used in components or service, check whether they depend on additional classes or interfaces that also need to be migrated.
zh_cn: 对于在组件或服务中使用的自定义类或接口,检查它们是否依赖于也需要迁移的其他类或接口。

source: For data or logic that isn't associated with a specific view, and that you want to share across components, you create a <em>service</em> class. A service class definition is immediately preceded by the <code>@<a href="../api/core/injectable">Injectable</a>()</code> decorator. The decorator provides the metadata that allows other providers to be <strong>injected</strong> as dependencies into your class.
zh_cn: 对于与特定视图无关的数据或逻辑，并且要在组件之间共享，请创建<em>服务</em>类。服务类定义之前紧跟 <code>@<a href="../api/core/injectable">Injectable</a>()</code> 装饰器。装饰器提供了允许其他服务提供者进行元数据<strong>注入</strong>的依赖到你的类。

source: For detailed information and guidance on updating your application, see the interactive <a href="https://update.angular.io/">Angular Update Guide</a>.
zh_cn: 有关更新应用程序的详细信息和指南，请参见交互式<a href="https://update.angular.io/">Angular Update Guide</a>。

source: For detailed usage information, see the <a href="../../guide/router">Routing Guide</a>.
zh_cn: 有关详细的使用信息，请参阅《<a href="../../guide/router">路由指南》</a>。

source: For details about <code>tsconfig.json</code>, see the official <a href="http://www.typescriptlang.org/docs/handbook/tsconfig-json.html">TypeScript wiki</a>.
zh_cn: 有关 <code>tsconfig.json</code> 的详细信息，请参见官方<a href="http://www.typescriptlang.org/docs/handbook/tsconfig-json.html">TypeScript Wiki</a>。

source: For details about changes between versions, and information about updating from previous releases, see the Releases tab on GitHub: <a href="https://github.com/angular/angular-cli/releases">https://github.com/angular/angular-cli/releases</a>
zh_cn: 有关版本之间的更改的详细信息以及有关从先前发行版进行更新的信息，请参阅GitHub上的&ldquo;发行版&rdquo;选项卡：<a href="https://github.com/angular/angular-cli/releases">https</a> : //github.com/angular/angular-cli/releases

source: For details of these data structure and syntax, see the <a href="https://github.com/angular/angular-cli/blob/master/packages/angular_devkit/schematics/README.md">Schematics README</a>.
zh_cn: 有关这些数据结构和语法的详细信息，请参见&ldquo; <a href="https://github.com/angular/angular-cli/blob/master/packages/angular_devkit/schematics/README.md">原理图自述文件&rdquo;</a>。

source: For each aspect of style, the following table explains where to find the primary guidelines and what this Angular Documentation Style Guide offers.
zh_cn: 对于样式的每一个方面,下表解释了在哪里可以找到主要的指南以及本Angular文档样式指南提供的内容。

source: For each component listed here, Angular creates a <code><a href="componentfactory">ComponentFactory</a></code> and stores it in the <code><a href="componentfactoryresolver">ComponentFactoryResolver</a></code>.
zh_cn: 对于此处列出的每个组件，Angular都会创建一个 <code><a href="componentfactory">ComponentFactory</a></code> 并将其存储在 <code><a href="componentfactoryresolver">ComponentFactoryResolver</a></code> 中。

source: For each match:
zh_cn: 对于每场比赛:

source: For each of these elements, use <code><a href="../api/animations/style">style</a>()</code> to set the same initial style for the element. Make it invisible and use <code>transform</code> to move it out of position so that it can slide into place.
zh_cn: 对于每个这些元素，请使用 <code><a href="../api/animations/style">style</a>()</code> 为该元素设置相同的初始样式。使它不可见，并使用 <code>transform</code> 将其移出位置，以便其滑入到位。

source: For each translation source file, there must be at least one language translation file for the resulting translation.
zh_cn: 对于每个翻译源文件,必须至少有一个语言翻译文件,用于最终的翻译。

source: For elements entering or leaving a page (inserted or removed from the DOM), you can make the animations conditional. For example, use <code>*<a href="../api/common/ngif">ngIf</a></code> with the animation trigger in the HTML template.
zh_cn: 对于进入或离开页面（从DOM插入或从DOM中删除）的元素，可以使动画有条件。例如，将 <code>*<a href="../api/common/ngif">ngIf</a></code> 与HTML模板中的动画触发器一起使用。

source: For event binding, define the name of the target event within parenthesis and specify a template statement, in quotes, to the right of the equals. Angular then sets up an event handler for the target event. When the event is raised, the handler executes the template statement.
zh_cn: 对于事件绑定,在括号内定义目标事件的名称,并在等号的右边用引号指定一个模板语句。然后Angular为目标事件设置一个事件处理程序。当事件被引发时,处理程序会执行模板语句。

source: For event handling:
zh_cn: 用于事件处理。

source: For every Angular component you write, you may define not only an HTML template, but also the CSS styles that go with that template, specifying any selectors, rules, and media queries that you need.
zh_cn: 对于你编写的每一个Angular组件,你不仅可以定义一个HTML模板,还可以定义与该模板相匹配的CSS样式,指定任何你需要的选择器、规则和媒体查询。

source: For example,
zh_cn: 例如:

source: For example, <a href="https://github.com/angular/angular-cli/tree/master/packages/angular_devkit/build_angular/src/browser">BrowserBuilder</a> runs a <a href="https://webpack.js.org/">webpack</a> build for a browser target and <a href="https://github.com/angular/angular-cli/tree/master/packages/angular_devkit/build_angular/src/karma">KarmaBuilder</a> starts the Karma server and runs a webpack build for unit tests.
zh_cn: 例如，<a href="https://github.com/angular/angular-cli/tree/master/packages/angular_devkit/build_angular/src/browser">BrowserBuilder</a>为浏览器目标运行<a href="https://webpack.js.org/">webpack</a>构建，而<a href="https://github.com/angular/angular-cli/tree/master/packages/angular_devkit/build_angular/src/karma">KarmaBuilder</a>启动Karma服务器并为单元测试运行webpack构建。

source: For example, <code>HeroListComponent</code> has a <code>heroes</code> property that holds an array of heroes. Its <code>selectHero()</code> method sets a <code>selectedHero</code> property when the user clicks to choose a hero from that list. The component acquires the heroes from a service, which is a TypeScript <a href="http://www.typescriptlang.org/docs/handbook/classes.html#parameter-properties">parameter property</a> on the constructor. The service is provided to the component through the dependency injection system.
zh_cn: 例如， <code>HeroListComponent</code> 有一个 <code>heroes</code> 属性，该属性包含一个英雄数组。当用户单击以从列表中选择英雄时，其 <code>selectHero()</code> 方法将设置 <code>selectedHero</code> 属性。该组件从服务获取英雄，该服务是构造函数上的TypeScript <a href="http://www.typescriptlang.org/docs/handbook/classes.html#parameter-properties">参数属性</a>。该服务通过依赖项注入系统提供给组件。

source: For example, Angular can inject <code>HeroListComponent</code> with both the <code>HeroService</code> provided in <code>HeroComponent</code> and the <code>UserService</code> provided in <code>AppModule</code>.
zh_cn: 例如，角可以注入 <code>HeroListComponent</code> 同时与 <code>HeroService</code> 中提供 <code>HeroComponent</code> 和 <code>UserService</code> 中提供 <code>AppModule</code> 。

source: For example, a built-in builder for linting is defined in the package <code>@angular-devkit/build_angular:tslint</code>, which uses the <a href="https://palantir.github.io/tslint/">TSLint</a> tool to perform linting, with a configuration specified in a <code>tslint.json</code> file.
zh_cn: 例如，在 <code>@angular-devkit/build_angular:tslint</code> 包中定义了用于插入的内置生成器，该包使用<a href="https://palantir.github.io/tslint/">TSLint</a>工具执行插入，并在 <code>tslint.json</code> 文件中指定了配置。

source: For example, a transition of <code>open =&gt; *</code> applies when the element's state changes from open to anything else.
zh_cn: 例如，当元素的状态从open变为其他状态时，将应用 <code>open =&gt; *</code> 的过渡。

source: For example, an editing component that needs a private copy of a caching service should register the service with the component. Then each new instance of the component gets its own cached service instance. The changes that editor makes in its service don't touch the instances elsewhere in the application.
zh_cn: 例如,一个需要缓存服务私有副本的编辑组件应该向组件注册服务。然后组件的每个新实例都会得到自己的缓存服务实例。编辑器在它的服务中所做的改变不会触及应用程序中其他地方的实例。

source: For example, consider the following component:
zh_cn: 例如,考虑以下组件。

source: For example, consider the following function:
zh_cn: 例如,考虑以下函数。

source: For example, consider the following route configuration where the parent route has two children.
zh_cn: 例如,如果父路由有两个子路由,则考虑以下路由配置。

source: For example, for the default <code>en-US</code> locale, the code <code>USD</code> can be represented by the narrow symbol <code>$</code> or the wide symbol <code>US$</code>.
zh_cn: 例如，对于默认 <code>en-US</code> 语言环境，代码 <code>USD</code> 可以由窄符号 <code>$</code> 或宽符号 <code>US$</code> 。

source: For example, for the following <code><a href="formgroup">FormGroup</a></code>:
zh_cn: 例如，对于以下 <code><a href="formgroup">FormGroup</a></code> ：

source: For example, here is a template for the Tutorial's <code>HeroListComponent</code>.
zh_cn: 例如，这是教程的 <code>HeroListComponent</code> 的模板。

source: For example, if a library uses the <code>public_api.ts</code> file as the library index of the module, the <code>tsconfig.json</code><code>files</code> field would be <code>["public_api.ts"]</code>. The <code>flatModuleOutFile</code> options could then be set to (for example) <code>"index.js"</code>, which produces <code>index.d.ts</code> and <code>index.metadata.json</code> files. The <code>module</code> field of the library's <code>package.json</code> would be <code>"index.js"</code> and the <code>typings</code> field would be <code>"index.d.ts"</code>.
zh_cn: 例如，如果一个库使用 <code>public_api.ts</code> 文件作为模块的库索引，则 <code>tsconfig.json</code> <code>files</code> 字段将为 <code>["public_api.ts"]</code> 。然后可以将 <code>flatModuleOutFile</code> 选项设置为（例如） <code>"index.js"</code> ，这将生成 <code>index.d.ts</code> 和 <code>index.metadata.json</code> 文件。该 <code>module</code> 库的领域 <code>package.json</code> 将 <code>"index.js"</code> 和 <code>typings</code> 领域将是 <code>"index.d.ts"</code> 。

source: For example, if the French version of your application is served from <a href="https://example.com/fr/">https://example.com/fr/</a>, configure the build for the French version as follows.
zh_cn: 例如，如果您的应用程序的法语版本是从<a href="https://example.com/fr/">https://example.com/fr/</a>提供的，请按以下方式配置法语版本的构建。

source: For example, if you need the optional <a href="http://caniuse.com/#feat=web-animation">web animations polyfill</a>, you could install it with <code>npm</code>, using the following command (or the <code>yarn</code> equivalent):
zh_cn: 例如，如果需要可选的<a href="http://caniuse.com/#feat=web-animation">Web动画polyfill</a>，则可以使用以下命令（或等效的 <code>yarn</code> ）与 <code>npm</code> 一起安装：

source: For example, imagine a hero detail AngularJS component directive with one input and one output:
zh_cn: 例如,想象一个英雄细节AngularJS组件指令有一个输入和一个输出。

source: For example, import Angular's <code><a href="../api/core/component">Component</a></code> decorator from the <code>@angular/core</code> library like this.
zh_cn: 例如，像这样从 <code>@angular/core</code> 库导入Angular的 <code><a href="../api/core/component">Component</a></code> 装饰器。

source: For example, in the following <code>SelfComponent</code>, notice the injected <code>LeafService</code> in the constructor.
zh_cn: 例如，在以下 <code>SelfComponent</code> 中，请注意在构造函数中注入的 <code>LeafService</code> 。

source: For example, instead of creating a custom element for a new variety of button, you can create a component that uses an attribute selector with a native <code>&lt;button&gt;</code> element. This most commonly applies to <code>&lt;button&gt;</code> and <code>&lt;<a href="../api/router/routerlinkwithhref">a</a>&gt;</code>, but can be used with many other types of element.
zh_cn: 例如，您可以创建将属性选择器与本机 <code>&lt;button&gt;</code> 元素一起使用的组件，而不是为各种新按钮创建自定义元素。这最通常适用于 <code>&lt;button&gt;</code> 和 <code>&lt;<a href="../api/router/routerlinkwithhref">a</a>&gt;</code> ，但可与许多其他类型的元件一起使用。

source: For example, it is <em>OK</em> to use a downgraded service in an upgraded component that is only used from a downgraded Angular component provided by the same Angular module as the injectable, but it is <em>not OK</em> to use it in an AngularJS component that may be used independently of Angular or use it in a downgraded Angular component from a different module.
zh_cn: 例如，它是<em>行</em>中的升级组件仅从一个习惯用降级服务降级由相同的角模块作为注射提供角度成分，但它是<em>不正常</em>使用它在AngularJS部件可以使用的独立于Angular或在其他模块的降级Angular组件中使用。
