Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/angular/angular.*.006.xlf
Languages: es, ja, ko, ru, zh_cn

source: By default, the target is <code>es2015</code>, which is supported only in modern browsers. You can configure the target to <code>es5</code> to specifically support legacy browsers. <a href="deployment#differential-loading">Differential loading</a> is also provided by the Angular CLI to support modern, and legacy browsers with separate bundles.
es: De forma predeterminada, el objetivo es <code>es2015</code> , que solo se admite en los navegadores modernos. Puede configurar el destino en <code>es5</code> para admitir espec&iacute;ficamente los navegadores heredados. La CLI angular tambi&eacute;n proporciona <a href="deployment#differential-loading">carga diferencial</a> para admitir navegadores modernos y heredados con paquetes separados.
ja: デフォルトでは、ターゲットは <code>es2015</code> で、最新のブラウザーでのみサポートされています。ターゲットを <code>es5</code> に設定して、レガシーブラウザを特別にサポートできます。Angular CLIは、個別のバンドルで最新のブラウザーとレガシーブラウザーをサポートするために、<a href="deployment#differential-loading">差分ロード</a>も提供します。
ko: 기본적으로 대상은 <code>es2015</code> 이며 최신 브라우저에서만 지원됩니다. 레거시 브라우저를 특별히 지원 하도록 대상을 <code>es5</code> 로 구성 할 수 있습니다 . Angular CLI는 <a href="deployment#differential-loading">차등 로딩</a> 을 제공하여 별도의 번들로 최신 브라우저 및 기존 브라우저를 지원합니다.
ru: По умолчанию целью является <code>es2015</code> , которая поддерживается только в современных браузерах. Вы можете настроить цель на <code>es5</code> , чтобы специально поддерживать устаревшие браузеры. Angular CLI также обеспечивает <a href="deployment#differential-loading">дифференциальную загрузку</a> для поддержки современных и устаревших браузеров с отдельными пакетами.

source: By default, the target is <code>es2015</code>. If you are targeting <code>es5</code>, you still have newer type declarations due to the list of declaration files included:
es: Por defecto, el objetivo es <code>es2015</code> . Si est&aacute; apuntando a <code>es5</code> , todav&iacute;a tiene declaraciones de tipo m&aacute;s nuevas debido a la lista de archivos de declaraci&oacute;n incluida:
ja: デフォルトでは、ターゲットは <code>es2015</code> です。 <code>es5</code> をターゲットにしている場合は、宣言ファイルのリストが含まれているため、まだ新しい型宣言があります。
ko: 기본적으로 대상은 <code>es2015</code> 입니다. <code>es5</code> 를 대상 으로하는 경우 포함 된 선언 파일 목록으로 인해 최신 유형 선언이 계속 있습니다.
ru: По умолчанию целью является <code>es2015</code> . Если вы нацелены на <code>es5</code> , у вас все еще есть новые объявления типов из-за включенного списка файлов объявлений:

source: By default, these criteria are:
es: Por defecto,estos criterios son:
ja: デフォルトでは、これらの基準は
ko: 기본적으로 이러한 기준은 다음과 같습니다.
ru: По умолчанию эти критерии

source: By default, this command creates the following:
ja: デフォルトでは、このコマンドは以下のように作成します。
ko: 기본적으로이 명령은 다음을 생성합니다.
ru: По умолчанию эта команда создает следующее:

source: By default, this feature is disabled. To enable it, set a global flag before importing <code>zone-testing</code>.
es: Por defecto, esta funci&oacute;n est&aacute; deshabilitada. Para habilitarlo, establezca un indicador global antes de importar <code>zone-testing</code> .
ja: デフォルトでは、この機能は無効になっています。これを有効にするには、 <code>zone-testing</code> をインポートする前にグローバルフラグを設定します。
ko: 기본적으로이 기능은 비활성화되어 있습니다. 이를 활성화하려면 <code>zone-testing</code> 을 가져 오기 전에 글로벌 플래그를 설정하십시오 .
ru: По умолчанию эта функция отключена. Чтобы включить его, установите глобальный флаг перед импортом <code>zone-testing</code> .

source: By default, this is true, unless a user calls <code><a href="enableprodmode">enableProdMode</a></code> before calling this.
es: Por defecto, esto es cierto, a menos que un usuario llame a <code><a href="enableprodmode">enableProdMode</a></code> antes de llamar a esto.
ja: ユーザーが <code><a href="enableprodmode">enableProdMode</a></code> を呼び出す前にenableProdModeを呼び出さない限り、デフォルトでこれはtrue です。
ko: 사용자가 이것을 호출하기 전에 <code><a href="enableprodmode">enableProdMode</a></code> 를 호출 하지 않으면 기본적으로 이것은 참 입니다.
ru: По умолчанию это верно, если пользователь не вызывает <code><a href="enableprodmode">enableProdMode</a></code> перед вызовом этого.

source: By default, throws an error when zero items are found. Set the <code><a href="animationqueryoptions#optional">optional</a></code> flag to ignore this error. For example:
es: Por defecto, arroja un error cuando se encuentran cero elementos. Establezca la bandera <code><a href="animationqueryoptions#optional">optional</a></code> para ignorar este error. Por ejemplo:
ja: デフォルトでは、アイテムが見つからない場合にエラーをスローします。このエラーを無視するには、 <code><a href="animationqueryoptions#optional">optional</a></code> フラグを設定します。例えば：
ko: 기본적으로 항목이 0이면 오류가 발생합니다. 이 오류를 무시 하려면 <code><a href="animationqueryoptions#optional">optional</a></code> 플래그를 설정하십시오 . 예를 들면 다음과 같습니다.
ru: По умолчанию выдает ошибку при обнаружении нуля предметов. Установите <code><a href="animationqueryoptions#optional">optional</a></code> флаг, чтобы игнорировать эту ошибку. Например:

source: By default, throws an error when zero items are found. Set the <code>optional</code> flag to ignore this error. For example:
ja: デフォルトでは、アイテムがゼロの場合にエラーをスローします。このエラーを無視するには、 <code>optional</code> フラグを設定します。例えば：
ko: 기본적으로 항목이 없으면 오류가 발생합니다. 이 오류를 무시 하려면 <code>optional</code> 플래그를 설정하십시오 . 예를 들면 :
ru: По умолчанию выдает ошибку при обнаружении нуля элементов. Установите <code>optional</code> флаг, чтобы игнорировать эту ошибку. Например:

source: By default, when a translation is missing, the build succeeds but generates a warning such as <code>Missing translation for <a href="../api/common/http/httperrorresponse#message">message</a> "foo"</code>. You can configure the level of warning that is generated by the Angular compiler:
es: De forma predeterminada, cuando falta una traducci&oacute;n, la compilaci&oacute;n se realiza correctamente pero genera una advertencia como <code>Missing translation for <a href="../api/common/http/httperrorresponse#message">message</a> "foo"</code> . Puede configurar el nivel de advertencia que genera el compilador angular:
ja: デフォルトでは、翻訳が見つからない場合、ビルドは成功しますが <code>Missing translation for <a href="../api/common/http/httperrorresponse#message">message</a> "foo"</code> などの警告が生成されます。Angularコンパイラーによって生成される警告のレベルを構成できます。
ko: 기본적으로 번역이 누락되면 빌드는 성공하지만 <code>Missing translation for <a href="../api/common/http/httperrorresponse#message">message</a> "foo"</code> <a href="../api/common/http/httperrorresponse#message">메시지에</a> 대한 번역 누락 과 같은 경고가 생성됩니다 . Angular 컴파일러가 생성하는 경고 레벨을 구성 할 수 있습니다.
ru: По умолчанию, если перевод отсутствует, сборка завершается успешно, но выдает предупреждение, например &laquo; <code>Missing translation for <a href="../api/common/http/httperrorresponse#message">message</a> "foo"</code> . Вы можете настроить уровень предупреждения, генерируемого компилятором Angular:

source: By default, when you use this pattern, you will see a deprecation warning once in dev mode. You can choose to silence this warning by providing a config for <code><a href="../api/forms/reactiveformsmodule">ReactiveFormsModule</a></code> at import time:
ja: デフォルトでは、このパターンを使用すると、開発モードで非推奨の警告が1回表示されます。インポート時に <code><a href="../api/forms/reactiveformsmodule">ReactiveFormsModule</a></code> の構成を提供することにより、この警告を消音することを選択できます。
ko: 기본적으로이 패턴을 사용하면 개발 모드에서 사용 중단 경고가 한 번 표시됩니다. 가져올 때 <code><a href="../api/forms/reactiveformsmodule">ReactiveFormsModule</a></code> 에 대한 구성을 제공하여이 경고를 무시하도록 선택할 수 있습니다 .
ru: По умолчанию, когда вы используете этот шаблон, вы увидите предупреждение об устаревании один раз в режиме разработки. Вы можете отключить это предупреждение, указав конфигурацию для <code><a href="../api/forms/reactiveformsmodule">ReactiveFormsModule</a></code> во время импорта:

source: By default, when you use this pattern, you will see a deprecation warning once in dev mode. You can choose to silence this warning by providing a config for <code><a href="reactiveformsmodule">ReactiveFormsModule</a></code> at import time:
es: Por defecto, cuando usa este patr&oacute;n, ver&aacute; una advertencia de desaprobaci&oacute;n una vez en modo dev. Puede optar por silenciar esta advertencia proporcionando una configuraci&oacute;n para <code><a href="reactiveformsmodule">ReactiveFormsModule</a></code> en el momento de la importaci&oacute;n:
ja: デフォルトでは、このパターンを使用すると、開発モードで非推奨の警告が一度表示されます。インポート時に <code><a href="reactiveformsmodule">ReactiveFormsModule</a></code> の構成を提供することで、この警告を止めるように選択できます。
ko: 기본적으로이 패턴을 사용하면 dev 모드에서 사용 중단 경고가 한 번 표시됩니다. 가져올 때 <code><a href="reactiveformsmodule">ReactiveFormsModule</a></code> 에 대한 구성을 제공하여이 경고를 끄도록 선택할 수 있습니다 .
ru: По умолчанию, когда вы используете этот шаблон, вы увидите предупреждение об устаревании один раз в режиме разработки. Вы можете отключить это предупреждение, предоставив конфигурацию для <code><a href="reactiveformsmodule">ReactiveFormsModule</a></code> во время импорта:

source: By default, writes output to a folder named dist/ in the current project.
es: Por defecto,escribe la salida en una carpeta llamada dist/en el proyecto actual.
ja: デフォルトでは、現在のプロジェクト内のdist/という名前のフォルダに出力を書き込みます。
ko: 기본적으로 현재 프로젝트에서 dist /라는 폴더에 출력을 씁니다.
ru: По умолчанию выводится в папку с именем dist/в текущем проекте.

source: By following a few guidelines, you can use property binding in a way that helps you minimize bugs and keep your code readable.
ja: いくつかのガイドラインに従うことで、プロパティバインディングを使用してバグを最小限に抑え、コードを読みやすくすることができます。
ko: 몇 가지 지침을 따르면 버그를 최소화하고 코드를 읽기 쉽게 유지하는 데 도움이되는 방식으로 속성 바인딩을 사용할 수 있습니다.
ru: Следуя нескольким рекомендациям,вы можете использовать привязку свойств таким образом,что это поможет вам минимизировать ошибки и сохранить ваш код читаемым.

source: By injecting the <code><a href="../api/router/activatedroute">ActivatedRoute</a></code>, you are configuring the component to use a <em>service</em>. The <a href="https://angular.io/start/start/start-data">Managing Data</a> page covers services in more detail.
ja: <code><a href="../api/router/activatedroute">ActivatedRoute</a></code> を挿入することにより、<em>サービス</em>を使用するようにコンポーネントを構成します。[<a href="https://angular.io/start/start/start-data">データ</a>の管理]ページでは、サービスについて詳しく説明しています。
ko: <code><a href="../api/router/activatedroute">ActivatedRoute</a></code> 를 삽입하면 <em>서비스</em> 를 사용하도록 구성 요소를 구성하는 것 입니다. <a href="https://angular.io/start/start/start-data">관리 데이터</a> 페이지는 더 자세히 서비스를 포함한다.
ru: Внедряя <code><a href="../api/router/activatedroute">ActivatedRoute</a></code> , вы настраиваете компонент для использования <em>службы</em> . На странице &laquo; <a href="https://angular.io/start/start/start-data">Управление данными&raquo;</a> услуги рассматриваются более подробно.

source: By pasting a "deep link" URL into the browser address bar that identifies the hero to display.
es: Pegando una URL de "enlace profundo" en la barra de direcciones del navegador que identifica al héroe a mostrar.
ja: ブラウザのアドレスバーに「ディープリンク」のURLを貼り付けることで、表示するヒーローを特定します。
ko: "딥 링크"URL을 브라우저 주소 표시 줄에 붙여 표시 할 영웅을 식별합니다.
ru: Вставляя URL "глубокой ссылки" в адресную строку браузера,которая идентифицирует героя для отображения.

source: By providing <code>VillainsService</code> in the <code>VillainsListComponent</code> metadata and nowhere else, the service becomes available only in the <code>VillainsListComponent</code> and its sub-component tree.
es: Al proporcionar <code>VillainsService</code> en los metadatos <code>VillainsListComponent</code> y en ning&uacute;n otro lugar, el servicio solo est&aacute; disponible en <code>VillainsListComponent</code> y su &aacute;rbol de subcomponentes.
ja: <code>VillainsListComponent</code> メタデータで <code>VillainsService</code> を提供するだけで、サービスは <code>VillainsListComponent</code> とそのサブコンポーネントツリーでのみ使用可能になります。
ko: 제공함으로써 <code>VillainsService</code> 을 에 <code>VillainsListComponent</code> 의 메타 데이터 및 어느 곳에서도 서비스가 가능한 단지가된다 <code>VillainsListComponent</code> 및 하위 구성 요소 트리.
ru: Предоставляя <code>VillainsService</code> в метаданных <code>VillainsListComponent</code> и нигде больше, служба становится доступной только в <code>VillainsListComponent</code> и в его дереве подкомпонентов.

source: By re-exporting <code><a href="../api/common/commonmodule">CommonModule</a></code> and <code><a href="../api/forms/formsmodule">FormsModule</a></code>, any other module that imports this <code>SharedModule</code>, gets access to directives like <code><a href="../api/common/ngif">NgIf</a></code> and <code>NgFor</code> from <code><a href="../api/common/commonmodule">CommonModule</a></code> and can bind to component properties with <code>[(<a href="../api/forms/ngmodel">ngModel</a>)]</code>, a directive in the <code><a href="../api/forms/formsmodule">FormsModule</a></code>.
es: Al reexportar <code><a href="../api/common/commonmodule">CommonModule</a></code> y <code><a href="../api/forms/formsmodule">FormsModule</a></code> , cualquier otro m&oacute;dulo que importe este <code>SharedModule</code> , obtiene acceso a directivas como <code><a href="../api/common/ngif">NgIf</a></code> y <code>NgFor</code> de <code><a href="../api/common/commonmodule">CommonModule</a></code> y puede vincularse a las propiedades del componente con <code>[(<a href="../api/forms/ngmodel">ngModel</a>)]</code> , una directiva en <code><a href="../api/forms/formsmodule">FormsModule</a></code> .
ja: 再エクスポートして <code><a href="../api/common/commonmodule">CommonModule</a></code> と <code><a href="../api/forms/formsmodule">FormsModule</a></code> 輸入このすなわち、他のモジュール <code>SharedModule</code> 、等ディレクティブへのアクセスを取得 <code><a href="../api/common/ngif">NgIf</a></code> と <code>NgFor</code> をより <code><a href="../api/common/commonmodule">CommonModule</a></code> とを有する成分の特性と結合することができる <code>[(<a href="../api/forms/ngmodel">ngModel</a>)]</code> 、で指令 <code><a href="../api/forms/formsmodule">FormsModule</a></code> 。
ko: 다시 보내어 <code><a href="../api/common/commonmodule">CommonModule</a></code> 및 <code><a href="../api/forms/formsmodule">FormsModule</a></code> 수입이 임의의 다른 모듈 <code>SharedModule</code> 이 같은 지시 액세스 얻는다 <code><a href="../api/common/ngif">NgIf</a></code> 및 <code>NgFor</code> 를 으로부터 <code><a href="../api/common/commonmodule">CommonModule</a></code> 과 함께 컴포넌트 속성에 바인딩 할 수 <code>[(<a href="../api/forms/ngmodel">ngModel</a>)]</code> 상기에서 지시 <code><a href="../api/forms/formsmodule">FormsModule</a></code> .
ru: По реэкспортирующей <code><a href="../api/common/commonmodule">CommonModule</a></code> и <code><a href="../api/forms/formsmodule">FormsModule</a></code> , любой другой модуль , который импортирует этот <code>SharedModule</code> , получает доступ к директивам как <code><a href="../api/common/ngif">NgIf</a></code> и <code>NgFor</code> от <code><a href="../api/common/commonmodule">CommonModule</a></code> и может связываться свойств компонентов с <code>[(<a href="../api/forms/ngmodel">ngModel</a>)]</code> директива в <code><a href="../api/forms/formsmodule">FormsModule</a></code> .

source: By setting <code>styles</code> or <code><a href="../api/core/component#styleUrls">styleUrls</a></code> metadata.
es: Al establecer <code>styles</code> o metadatos <code><a href="../api/core/component#styleUrls">styleUrls</a></code> .
ja: <code>styles</code> または <code><a href="../api/core/component#styleUrls">styleUrls</a></code> メタデータを設定する。
ko: <code>styles</code> 또는 <code><a href="../api/core/component#styleUrls">styleUrls</a></code> 메타 데이터 를 설정 합니다 .
ru: Устанавливая <code>styles</code> или метаданные <code><a href="../api/core/component#styleUrls">styleUrls</a></code> .

source: By setting <code>styles</code> or <code>styleUrls</code> metadata.
ja: <code>styles</code> または <code>styleUrls</code> メタデータを設定する。
ko: <code>styles</code> 또는 <code>styleUrls</code> 메타 데이터 를 설정 합니다 .
ru: Установив <code>styles</code> или метаданные <code>styleUrls</code> .

source: By supplying an object in the same shape, you satisfy the expectations of <code>items</code> when Angular evaluates the expression <code>currentItems</code>.
ja: 同じ形状のオブジェクトを提供することで、Angularが式 <code>currentItems</code> を評価するときに <code>items</code> の期待に応えます。
ko: 동일한 모양의 객체를 제공 하면 Angular가 <code>currentItems</code> 표현식을 평가할 때 <code>items</code> 의 기대치를 충족합니다 .
ru: Предоставляя объект той же формы, вы удовлетворяете ожидания <code>items</code> когда Angular оценивает выражение <code>currentItems</code> .

source: By the end of this tutorial you will be able to do the following:
es: Al final de este tutorial podrás hacer lo siguiente:
ja: このチュートリアルが終わる頃には、以下のことができるようになります。
ko: 이 학습서를 마치면 다음을 수행 할 수 있습니다.
ru: К концу этого урока вы сможете сделать следующее:

source: By transcluding or projecting content from the other framework. ngUpgrade bridges the related concepts of AngularJS transclusion and Angular content projection together.
es: Al transcluir o proyectar el contenido del otro marco.ngUpgrade une los conceptos relacionados de transclusión de AngularJS y proyección de contenido Angular.
ja: ngUpgradeは、AngularJSのトランスクルージョンとAngularコンテンツのプロジェクションという関連概念の橋渡しをしています。
ko: 다른 프레임 워크에서 컨텐츠를 변환하거나 투사합니다. ngUpgrade는 AngularJS transclusion 및 Angular 컨텐츠 프로젝션의 관련 개념을 함께 연결합니다.
ru: Включая или проецируя контент из другой структуры.ngUpgrade объединяет соответствующие концепции трансключения AngularJS и проецирования углового контента вместе.

source: By using a component from the other framework: An AngularJS template using an Angular component, or an Angular template using an AngularJS component.
es: Utilizando un componente del otro marco:Una plantilla de AngularJS usando un componente de Angular,o una plantilla de Angular usando un componente de AngularJS.
ja: 他のフレームワークのコンポーネントを使うことで Angularコンポーネントを使ったAngularJSテンプレート、またはAngularJSコンポーネントを使ったAngularテンプレート。
ko: 다른 프레임 워크의 컴포넌트를 사용하여 : Angular 컴포넌트를 사용하는 AngularJS 템플리트 또는 AngularJS 컴포넌트를 사용하는 Angular 템플리트.
ru: Используя компонент из другого каркаса:Шаблон AngularJS,использующий компонент Angular,или шаблон AngularJS,использующий компонент AngularJS.

source: By using the In-memory Web API, you won't have to set up a server to learn about <code><a href="../api/common/http/httpclient">HttpClient</a></code>.
es: Al utilizar la API web en memoria, no tendr&aacute; que configurar un servidor para obtener informaci&oacute;n sobre <code><a href="../api/common/http/httpclient">HttpClient</a></code> .
ja: インメモリWeb APIを使用すると、 <code><a href="../api/common/http/httpclient">HttpClient</a></code> について学習するためにサーバーを設定する必要がなくなります。
ko: 인 메모리 웹 API를 사용하면 <code><a href="../api/common/http/httpclient">HttpClient</a></code> 에 대해 배우기 위해 서버를 설정할 필요가 없습니다 .
ru: Используя веб-API в памяти, вам не нужно будет настраивать сервер для изучения <code><a href="../api/common/http/httpclient">HttpClient</a></code> .

source: Bypass security and trust the given value to be a safe resource URL, i.e. a location that may be used to load executable code from, like <code>&lt;script src&gt;</code>, or <code>&lt;iframe src&gt;</code>.
es: Omita la seguridad y conf&iacute;e en que el valor dado sea un URL de recurso seguro, es decir, una ubicaci&oacute;n que se puede usar para cargar c&oacute;digo ejecutable, como <code>&lt;script src&gt;</code> o <code>&lt;iframe src&gt;</code> .
ja: セキュリティをバイパスし、指定された値を安全なリソースURL、つまり <code>&lt;script src&gt;</code> や <code>&lt;iframe src&gt;</code> などの実行可能コードをロードするために使用できる場所であると信頼します。
ko: 보안을 무시하고 주어진 값을 안전한 리소스 URL, 즉 <code>&lt;script src&gt;</code> 또는 <code>&lt;iframe src&gt;</code> 와 같은 실행 코드를로드하는 데 사용할 수있는 위치로 신뢰하십시오 .
ru: Обходите защиту и доверяйте заданному значению безопасный URL-адрес ресурса, т. Е. Место, которое можно использовать для загрузки исполняемого кода, например, <code>&lt;script src&gt;</code> или <code>&lt;iframe src&gt;</code> .

source: Bypass security and trust the given value to be a safe style URL, i.e. a value that can be used in hyperlinks or <code>&lt;img src&gt;</code>.
es: Omita la seguridad y conf&iacute;e en que el valor dado sea un URL de estilo seguro, es decir, un valor que se puede usar en hiperv&iacute;nculos o <code>&lt;img src&gt;</code> .
ja: セキュリティをバイパスし、指定された値を安全なスタイルのURL、つまりハイパーリンクまたは <code>&lt;img src&gt;</code> で使用できる値であると信頼します。
ko: 보안을 무시하고 주어진 값을 안전한 스타일 URL, 즉 하이퍼 링크 또는 <code>&lt;img src&gt;</code> 에서 사용할 수있는 값으로 신뢰하십시오 .
ru: Обходите безопасность и доверяйте заданному значению URL-адресу безопасного стиля, то есть значению, которое можно использовать в гиперссылках или <code>&lt;img src&gt;</code> .

source: Bypass security and trust the given value to be safe HTML. Only use this when the bound HTML is unsafe (e.g. contains <code>&lt;script&gt;</code> tags) and the code should be executed. The sanitizer will leave safe HTML intact, so in most situations this method should not be used.
es: Omita la seguridad y conf&iacute;e en el valor dado para que sea HTML seguro. Solo use esto cuando el HTML enlazado no sea seguro (por ejemplo, contiene etiquetas <code>&lt;script&gt;</code> ) y el c&oacute;digo debe ejecutarse. El desinfectante dejar&aacute; el HTML seguro intacto, por lo que en la mayor&iacute;a de las situaciones este m&eacute;todo no debe usarse.
ja: セキュリティをバイパスし、指定された値を安全なHTMLとして信頼します。これは、バインドされたHTMLが安全でなく（たとえば、 <code>&lt;script&gt;</code> タグが含まれている）、コードを実行する必要がある場合にのみ使用してください。消毒剤は安全なHTMLをそのまま残しますので、ほとんどの状況でこの方法は使用すべきではありません。
ko: 보안을 우회하고 주어진 값을 안전한 HTML로 신뢰하십시오. 바인딩 된 HTML이 안전하지 않은 경우에만 (예 : <code>&lt;script&gt;</code> 태그 포함) 코드를 실행해야합니다. 소독제는 안전한 HTML을 그대로 유지하므로 대부분의 경우이 방법을 사용해서는 안됩니다.
ru: Обходите безопасность и доверяйте заданному значению как безопасному HTML. Используйте его только тогда, когда связанный HTML -код небезопасен (например, содержит теги <code>&lt;script&gt;</code> ) и код должен быть выполнен. Дезинфицирующее средство оставит безопасный HTML без изменений, поэтому в большинстве случаев этот метод не следует использовать.

source: Bypass security and trust the given value to be safe JavaScript.
es: Evita la seguridad y confía en que el valor dado sea JavaScript seguro.
ja: セキュリティをバイパスして、与えられた値を安全なJavaScriptに信頼します。
ko: 보안을 우회하고 주어진 값을 안전한 JavaScript로 신뢰하십시오.
ru: Обходите безопасность и доверьтесь заданному значению,чтобы быть безопасным JavaScript.

source: Bypass security and trust the given value to be safe style value (CSS).
es: Evita la seguridad y confía en que el valor dado sea el valor de estilo seguro (CSS).
ja: セキュリティをバイパスして、与えられた値を安全なスタイル値(CSS)として信頼します。
ko: 보안을 우회하고 주어진 값을 안전한 스타일 값 (CSS)으로 신뢰하십시오.
ru: Обходите безопасность и доверяйте заданному значению,чтобы быть безопасным значением стиля (CSS).

source: Bypass the proxy
es: Evita el proxy...
ja: プロキシのバイパス
ko: 프록시 우회
ru: Обходить прокси-сервер

source: Bypassing the service worker
es: Pasando por alto al trabajador del servicio
ja: サービスワーカーの迂回
ko: 서비스 작업자 우회
ru: В обход работника сервисной службы

source: CLDR and Angular base their identifiers on <a href="http://www.rfc-editor.org/rfc/bcp/bcp47.txt">BCP47 tags</a>.
ja: CLDRとAngularは、<a href="http://www.rfc-editor.org/rfc/bcp/bcp47.txt">BCP47タグ</a>に基づいて識別子を作成します。
ko: CLDR 및 Angular는 <a href="http://www.rfc-editor.org/rfc/bcp/bcp47.txt">BCP47 태그에</a> 식별자를 기반으로합니다 .
ru: CLDR и Angular основывают свои идентификаторы на <a href="http://www.rfc-editor.org/rfc/bcp/bcp47.txt">тегах BCP47</a> .

source: CLDR and Angular base their identifiers on <a href="https://www.rfc-editor.org/rfc/bcp/bcp47.txt">BCP47 tags</a>.
ru: CLDR и Angular основывают свои идентификаторы на <a href="https://www.rfc-editor.org/rfc/bcp/bcp47.txt">тегах BCP47</a> .

source: CLDR website
es: Sitio web de la CLDR
ja: CLDRウェブサイト
ko: CLDR 웹 사이트
ru: веб-сайт CLDR

source: CLI Overview and Command Reference
es: Visión general del CLI y referencia de comandos
ja: CLIの概要とコマンドリファレンス
ko: CLI 개요 및 명령 참조
ru: Обзор CLI и справочник команд

source: CLI builders
es: Los constructores del CLI
ja: CLI ビルダー
ko: CLI 빌더
ru: строители КЛИ

source: CLI command-language syntax
es: La sintaxis del lenguaje de comandos del CLI
ja: CLIコマンド言語構文
ko: CLI 명령 언어 구문
ru: синтаксис командного языка CLI
