Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/angular/angular.*.006.xlf
Languages: es, ja, ko, ru, zh_cn

source: Create a file named <code>builders.json</code> file that looks like this.
es: Cree un archivo llamado archivo <code>builders.json</code> que tenga este aspecto.
ja: 次のような <code>builders.json</code> という名前のファイルを作成します。
ko: 다음과 같은 <code>builders.json</code> 파일이라는 파일을 작성하십시오 .
ru: Создайте файл с именем <code>builders.json</code> , который выглядит следующим образом.

source: Create a form array with array-level validators
es: Crear una matriz de formularios con validadores de nivel de matriz
ja: 配列レベルのバリデータでフォーム配列を作成する
ko: 배열 수준 유효성 검사기를 사용하여 양식 배열 만들기
ru: Создание массива форм с валидаторами уровня массива

source: Create a form component
es: Crear un componente del formulario
ja: フォームコンポーネントの作成
ko: 양식 구성 요소 작성
ru: Создать элемент формы

source: Create a form group with 2 controls
es: Crear un grupo de formularios con 2 controles
ja: 2つのコントロールを持つフォームグループを作成
ko: 2 개의 컨트롤로 양식 그룹 만들기
ru: Создать группу форм с 2 элементами управления

source: Create a form group with a group-level validator
es: Crear un grupo de formularios con un validador de nivel de grupo
ja: グループレベルのバリデータでフォームグループを作成する
ko: 그룹 수준 유효성 검사기를 사용하여 양식 그룹 만들기
ru: Создать группу форм с валидатором на уровне группы

source: Create a form object model
ja: フォームオブジェクトモデルの作成
ko: 양식 개체 모델 만들기
ru: Создать объектную модель формы

source: Create a function to retrieve the heroes from the service.
es: Crear una función para recuperar a los héroes del servicio.
ja: サービスからヒーローを取得する機能を作成します。
ko: 서비스에서 영웅을 검색하는 함수를 작성하십시오.
ru: Создайте функцию для получения героев со службы.

source: Create a localization folder
es: Crear una carpeta de localización
ja: ローカライズフォルダの作成
ko: 현지화 폴더 만들기
ru: Создать папку локализации

source: Create a method to retrieve the heroes from the service.
ja: サービスからヒーローを取得するためのメソッドを作成します。
ko: 서비스에서 Hero를 검색하는 메서드를 만듭니다.
ru: Создать метод извлечения героев из службы.

source: Create a nested group.
ja: 入れ子になったグループを作成します。
ko: 중첩 된 그룹을 만듭니다.
ru: Создайте вложенную группу.

source: Create a new <code><a href="httpheaderresponse">HttpHeaderResponse</a></code> with the given parameters.
es: Cree un nuevo <code><a href="httpheaderresponse">HttpHeaderResponse</a></code> con los par&aacute;metros dados.
ja: 指定されたパラメーターで新しい <code><a href="httpheaderresponse">HttpHeaderResponse</a></code> を作成します。
ko: 주어진 매개 변수 로 새로운 <code><a href="httpheaderresponse">HttpHeaderResponse</a></code> 를 작성하십시오 .
ru: Создайте новый <code><a href="httpheaderresponse">HttpHeaderResponse</a></code> с заданными параметрами.

source: Create a new <code><a href="upgradecomponent">UpgradeComponent</a></code> instance. You should not normally need to do this. Instead you should derive a new class from this one and call the super constructor from the base class.
es: Cree una nueva instancia de <code><a href="upgradecomponent">UpgradeComponent</a></code> . Normalmente no deber&iacute;a necesitar hacer esto. En su lugar, debe derivar una nueva clase de esta y llamar al superconstructor desde la clase base.
ja: 新しい <code><a href="upgradecomponent">UpgradeComponent</a></code> インスタンスを作成します。通常、これを行う必要はありません。代わりに、このクラスから新しいクラスを派生させ、基本クラスからスーパーコンストラクターを呼び出す必要があります。
ko: 새 <code><a href="upgradecomponent">UpgradeComponent</a></code> 인스턴스를 작성하십시오 . 일반적으로이 작업을 수행 할 필요는 없습니다. 대신이 클래스에서 새 클래스를 파생시키고 기본 클래스에서 수퍼 생성자를 호출해야합니다.
ru: Создайте новый экземпляр <code><a href="upgradecomponent">UpgradeComponent</a></code> . Вы не должны обычно делать это. Вместо этого вы должны извлечь новый класс из этого и вызвать супер конструктор из базового класса.

source: Create a new Angular CLI workspace using the <a href="https://angular.io/start/cli/new"><code>ng new</code></a> command:
es: Cree un nuevo espacio de trabajo de CLI angular con el comando <a href="https://angular.io/start/cli/new"> <code>ng new</code> </a> :
ja: <a href="https://angular.io/start/cli/new"> <code>ng new</code> </a>コマンドを使用して、新しいAngular CLIワークスペースを作成します。
ko: <a href="https://angular.io/start/cli/new"> <code>ng new</code> </a> 명령을 사용하여 새 Angular CLI 작업 공간을 작성하십시오 .
ru: Создайте новое рабочее пространство Angular CLI с помощью команды <a href="https://angular.io/start/cli/new"> <code>ng new</code> </a> :

source: Create a new Angular project, <em>angular-router-sample</em>.
ja: 新しいAngularプロジェクト<em>angular-router-sampleを</em>作成します。
ko: 새 Angular 프로젝트 <em>angular-router-sample을</em> 만듭니다.
ru: Создайте новый проект Angular, <em>angular-router-sample</em> .

source: Create a new Injector which is configure using <code><a href="staticprovider">StaticProvider</a></code>s.
es: Cree un nuevo inyector que se configure con <code><a href="staticprovider">StaticProvider</a></code> s.
ja: <code><a href="staticprovider">StaticProvider</a></code> を使用して設定される新しいインジェクターを作成します。
ko: <code><a href="staticprovider">StaticProvider</a></code> 를 사용하여 구성되는 새 인젝터를 작성하십시오 .
ru: Создайте новый инжектор, который настраивается с использованием <code><a href="staticprovider">StaticProvider</a></code> s.

source: Create a new file, <code>&lt;component-name&gt;.component.ts</code>.
ja: 新しいファイル <code>&lt;component-name&gt;.component.ts</code> を作成します。
ko: 새 파일 <code>&lt;component-name&gt;.component.ts</code> 를 작성하십시오 .
ru: Создайте новый файл <code>&lt;component-name&gt;.component.ts</code> .

source: Create a new file, <code>tsconfig-es5.spec.json</code> next to <code>tsconfig.spec.json</code> with the following content.
es: Cree un nuevo archivo, <code>tsconfig-es5.spec.json</code> junto a <code>tsconfig.spec.json</code> con el siguiente contenido.
ja: <code>tsconfig-es5.spec.json</code> 横に新しいファイルtsconfig-es5.spec.jsonを <code>tsconfig.spec.json</code> し、次の内容を含めます。
ko: 다음 내용 으로 <code>tsconfig.spec.json</code> 옆에 새 파일 <code>tsconfig-es5.spec.json</code> 을 작성하십시오 .
ru: Создайте новый файл <code>tsconfig-es5.spec.json</code> рядом с <code>tsconfig.spec.json</code> со следующим содержимым.

source: Create a new product alerts component.
es: Crear un nuevo componente de alertas de productos.
ja: 新しい製品アラートコンポーネントを作成します。
ko: 새 제품 경고 구성 요소를 작성하십시오.
ru: Создайте новый компонент оповещения о продукте.

source: Create a new project
es: Crear un nuevo proyecto
ja: 新規プロジェクトの作成
ko: 새로운 프로젝트 만들기
ru: Создать новый проект

source: Create a new project named <code>angular-forms</code>:
es: Cree un nuevo proyecto llamado <code>angular-forms</code> :
ja: <code>angular-forms</code> という名前の新しいプロジェクトを作成します。
ko: <code>angular-forms</code> 라는 새 프로젝트를 만듭니다 .
ru: Создайте новый проект с именем <code>angular-forms</code> :

source: Create a new project, giving it any name you like.
es: Crea un nuevo proyecto,dándole el nombre que quieras.
ja: 新しいプロジェクトを作成し、好きな名前を付けてください。
ko: 새 프로젝트를 만들어 원하는 이름을 지정하십시오.
ru: Создайте новый проект,дайте ему любое имя,которое вам понравится.

source: Create a new workspace and an initial application
es: Crear un nuevo espacio de trabajo y una aplicación inicial
ja: 新しいワークスペースと初期アプリケーションの作成
ko: 새 작업 공간 및 초기 애플리케이션 작성
ru: Создайте новое рабочее пространство и первоначальное приложение.

source: Create a new workspace and initial app project.
es: Crear un nuevo espacio de trabajo y un proyecto inicial de aplicación.
ja: 新しいワークスペースを作成し、アプリの初期プロジェクトを作成します。
ko: 새 작업 공간 및 초기 앱 프로젝트를 작성하십시오.
ru: Создайте новое рабочее пространство и начальный проект приложения.

source: Create a property in the component class named <code>profileForm</code> and set the property to a new form group instance. To initialize the form group, provide the constructor with an object of named keys mapped to their control.
es: Cree una propiedad en la clase de componente denominada <code>profileForm</code> y establezca la propiedad en una nueva instancia de grupo de formularios. Para inicializar el grupo de formularios, proporcione al constructor un objeto de claves con nombre asignado a su control.
ja: <code>profileForm</code> という名前のコンポーネントクラスにプロパティを作成し、そのプロパティを新しいフォームグループインスタンスに設定します。フォームグループを初期化するには、コントロールにマップされた名前付きキーのオブジェクトをコンストラクターに提供します。
ko: <code>profileForm</code> 이라는 컴포넌트 클래스 에서 특성을 작성하고 새 양식 그룹 인스턴스로 특성을 설정하십시오. 양식 그룹을 초기화하려면 생성자에게 컨트롤에 매핑 된 명명 된 키의 개체를 제공하십시오.
ru: Создайте свойство в классе компонента с именем <code>profileForm</code> и установите для свойства новый экземпляр группы форм. Чтобы инициализировать группу форм, предоставьте конструктору объект именованных ключей, сопоставленный их элементу управления.

source: Create a resolver service. With the CLI, the command to generate a service is as follows:
ja: リゾルバサービスを作成します。CLIでは、サービスを生成するコマンドは以下のようになります。
ko: 해석기 서비스를 작성하십시오. CLI에서 서비스를 생성하는 명령은 다음과 같습니다.
ru: Создайте службу резольвера.При использовании CLI команда создания службы выглядит следующим образом:

source: Create a routable component for AngularJS content
es: Crear un componente de ruta para el contenido de AngularJS
ja: AngularJSコンテンツ用のルーティングコンポーネントを作成する
ko: AngularJS 컨텐츠를위한 라우팅 가능한 컴포넌트 생성
ru: Создать компонент маршрутизации для содержания AngularJS

source: Create a sample application
ja: サンプルアプリケーションの作成
ko: 샘플 애플리케이션 만들기
ru: Создать образец заявки

source: Create a second component, <em>heroes-list</em>.
ja: 2番目のコンポーネントである<em>heroes-listを</em>作成します。
ko: 두 번째 구성 요소 인 <em>heroes-list를</em> 만듭니다 .
ru: Создайте второй компонент, <em>список героев</em> .

source: Create a service for your guard:
ja: ガードのためのサービスを作りましょう。
ko: 경비원을위한 서비스 생성 :
ru: Создайте службу для вашей охраны:

source: Create a service that lazy loads and bootstraps your AngularJS app.
es: Crea un servicio que cargue y arranque tu aplicación AngularJS.
ja: AngularJSアプリをレイジーロードしてブートストラップするサービスを作成します。
ko: 게으른 AngularJS 앱을로드 및 부트 스트랩하는 서비스를 만듭니다.
ru: Создайте сервис,который лениво загружает и загружает ваше приложение AngularJS.

source: Create a service to lazy load AngularJS
es: Crear un servicio para carga perezosa AngularJS
ja: AngularJSを遅延ロードするサービスを作成する
ko: AngularJS를 지연로드하는 서비스 작성
ru: Создать сервис для ленивой нагрузки Угловой JS

source: Create a shared <a href="guide/glossary#service">service</a> to assemble the heroes.
ja: ヒーローを集めるための共有<a href="guide/glossary#service">サービス</a>を作成します。
ko: 영웅을 모으는 공유 <a href="guide/glossary#service">서비스</a> 를 만듭니다 .
ru: Создайте общий <a href="guide/glossary#service">сервис</a> для сборки героев.

source: Create a shared service to assemble the heroes.
es: Crear un servicio compartido para reunir a los héroes.
ja: 英雄を組み立てるための共有サービスを作成します。
ko: 영웅을 모으는 공유 서비스를 만듭니다.
ru: Создать общую службу для сбора героев.

source: Create a static method <code><a href="../api/router/routermodule#forRoot">forRoot()</a></code> on the module.
es: Cree un m&eacute;todo est&aacute;tico <code><a href="../api/router/routermodule#forRoot">forRoot()</a></code> en el m&oacute;dulo.
ja: モジュールに静的メソッド <code><a href="../api/router/routermodule#forRoot">forRoot()</a></code> を作成します。
ko: 모듈 에서 정적 메소드 <code><a href="../api/router/routermodule#forRoot">forRoot()</a></code> 를 작성하십시오 .
ru: Создайте статический метод <code><a href="../api/router/routermodule#forRoot">forRoot()</a></code> в модуле.

source: Create a static method <code>forRoot()</code> on the module.
ja: モジュールに静的メソッド <code>forRoot()</code> を作成します。
ko: 모듈에 대한 정적 메서드 <code>forRoot()</code> 를 만듭니다 .
ru: Создайте статический метод <code>forRoot()</code> в модуле.

source: Create a template with the initial form layout.
es: Crear una plantilla con la disposición inicial del formulario.
ja: 初期フォームのレイアウトでテンプレートを作成します。
ko: 초기 양식 레이아웃으로 템플릿을 만듭니다.
ru: Создайте шаблон с первоначальной формой.

source: Create a translation file for each language
ja: 各言語の翻訳ファイルを作成
ko: 각 언어에 대한 번역 파일 생성
ru: Создайте файл перевода для каждого языка

source: Create a translation file: Use the Angular CLI <code>xi18n</code> command to extract the marked text into an industry-standard translation source file.
es: Cree un archivo de traducci&oacute;n: utilice el comando CLI angular <code>xi18n</code> para extraer el texto marcado en un archivo fuente de traducci&oacute;n est&aacute;ndar de la industria.
ja: 翻訳ファイルを作成します <code>xi18n</code> コマンドを使用して、マークされたテキストを業界標準の翻訳ソースファイルに抽出します。
ko: 번역 파일 작성 : Angular CLI <code>xi18n</code> 명령을 사용하여 표시된 텍스트를 산업 표준 번역 소스 파일로 추출하십시오.
ru: Создайте файл перевода: используйте команду Angular CLI <code>xi18n</code> , чтобы извлечь выделенный текст в стандартный исходный файл перевода.

source: Create a translation source file
es: Crear un archivo fuente de traducción
ja: 翻訳ソースファイルの作成
ko: 번역 소스 파일 만들기
ru: Создать исходный файл перевода

source: Create a workspace and initial application
ja: ワークスペースの作成と初期アプリケーション
ko: 작업 영역 및 초기 응용 프로그램 만들기
ru: Создать рабочее пространство и первоначальное приложение

source: Create an <a href="deployment#configuring-serve-for-es5">ES5 serve configuration</a> as explained above, and configuration an ES5 configuration for the E2E target.
es: Cree una <a href="deployment#configuring-serve-for-es5">configuraci&oacute;n de servicio ES5</a> como se explic&oacute; anteriormente, y configure una configuraci&oacute;n ES5 para el objetivo E2E.
ja: 上記の説明に従って<a href="deployment#configuring-serve-for-es5">ES5サーバー構成</a>を作成し、E2EターゲットのES5構成を構成します。
ko: 위에서 설명한 <a href="deployment#configuring-serve-for-es5">ES5 서브 구성</a> 을 작성 하고 E2E 대상에 대한 ES5 구성을 구성하십시오.
ru: Создайте <a href="deployment#configuring-serve-for-es5">конфигурацию подачи ES5,</a> как описано выше, и настройте конфигурацию ES5 для цели E2E.

source: Create an <code>AppRouting</code> module in the <code>/app</code> folder to contain the routing configuration.
es: Cree un m&oacute;dulo <code>AppRouting</code> en la carpeta <code>/app</code> para contener la configuraci&oacute;n de enrutamiento.
ja: <code>/app</code> フォルダーに <code>AppRouting</code> モジュールを作成して、ルーティング構成を含めます。
ko: 라우팅 구성을 포함하도록 <code>/app</code> 폴더 에 <code>AppRouting</code> 모듈을 만듭니다 .
ru: Создайте модуль <code>AppRouting</code> в папке <code>/app</code> для хранения конфигурации маршрутизации.

source: Create an <code>addNewItem()</code> method in the same component class:
ja: 同じコンポーネントクラスに <code>addNewItem()</code> メソッドを作成します。
ko: 동일한 구성 요소 클래스에 <code>addNewItem()</code> 메서드를 만듭니다 .
ru: Создайте метод <code>addNewItem()</code> в том же классе компонента:

source: Create an <code>animations.ts</code> file in the root <code>src/app/</code> folder. The contents look like this:
es: Cree un archivo <code>animations.ts</code> en la carpeta ra&iacute;z <code>src/app/</code> . El contenido se ve as&iacute;:
ja: ルートの <code>src/app/</code> フォルダーに <code>animations.ts</code> ファイルを作成します。内容は次のようになります。
ko: 루트 <code>src/app/</code> 폴더에 <code>animations.ts</code> 파일을 작성하십시오 . 내용은 다음과 같습니다.
ru: Создайте файл <code>animations.ts</code> в корневой папке <code>src/app/</code> . Содержание выглядит так:

source: Create an Angular project. If you don't have a project, you can create one using <code>ng new &lt;project-name&gt;</code>, where <code>&lt;project-name&gt;</code> is the name of your Angular application.
ja: Angularプロジェクトを作成します。プロジェクトがない場合は、 <code>ng new &lt;project-name&gt;</code> を使用してプロジェクトを作成できます。ここで、 <code>&lt;project-name&gt;</code> はAngularアプリケーションの名前です。
ko: Angular 프로젝트를 만듭니다. 프로젝트가없는 경우 <code>ng new &lt;project-name&gt;</code> 을 사용하여 만들 수 있습니다 . 여기서 <code>&lt;project-name&gt;</code> 은 Angular 응용 프로그램의 이름입니다.
ru: Создайте проект Angular. Если у вас нет проекта, вы можете создать его, используя <code>ng new &lt;project-name&gt;</code> , где <code>&lt;project-name&gt;</code> - это имя вашего приложения Angular.

source: Create an adaptable user interface for all of your target locales that takes into consideration the differences in spacing for different languages. For details, see <a href="https://marketfinder.thinkwithgoogle.com/intl/en_us/guide/how-to-approach-i18n/#overview">How to approach internationalization</a>.
ja: 異なる言語の間隔の違いを考慮して、すべてのターゲットロケールに適応可能なユーザーインターフェイスを作成します。詳細については、<a href="https://marketfinder.thinkwithgoogle.com/intl/en_us/guide/how-to-approach-i18n/#overview">国際化への取り組み方を</a>ご覧ください。
ko: 다른 언어의 간격 차이를 고려하여 모든 대상 로케일에 대해 적응 가능한 사용자 인터페이스를 만듭니다. 자세한 내용은 <a href="https://marketfinder.thinkwithgoogle.com/intl/en_us/guide/how-to-approach-i18n/#overview">국제화 접근 방법을</a> 참조하십시오 .
ru: Создайте адаптируемый пользовательский интерфейс для всех ваших целевых языков, учитывающий различия в интервалах для разных языков. Подробнее см. <a href="https://marketfinder.thinkwithgoogle.com/intl/en_us/guide/how-to-approach-i18n/#overview">Как приблизиться к интернационализации</a> .

source: Create an array of form controls
es: Crear una serie de controles de forma
ja: フォームコントロールの配列を作成する
ko: 폼 컨트롤 배열 만들기
ru: Создать массив форм управления

source: Create an initial HTML form template
es: Crear una plantilla inicial de formulario HTML
ja: 初期HTMLフォームのテンプレートを作成する
ko: 초기 HTML 양식 템플릿 만들기
ru: Создать шаблон начальной HTML-формы

source: Create an injectable service class
es: Crear una clase de servicio de inyectables
ja: 注入可能なサービスクラスを作成する
ko: 주사 가능한 서비스 클래스 만들기
ru: Создать класс инъекционного обслуживания

source: Create an injection token for an instance of the ambient type.
es: Crear una ficha de inyección para un ejemplo del tipo de ambiente.
ja: アンビエントタイプのインスタンスのインジェクショントークンを作成します。
ko: 주변 유형의 인스턴스에 대한 주입 토큰을 만듭니다.
ru: Создайте инъекционный токен для примера типа окружающей среды.

source: Create an instance by invoking the <code>new</code> operator and supplying additional arguments. This form is a short form of <code><a href="typeprovider">TypeProvider</a></code>;
es: Cree una instancia invocando al <code>new</code> operador y proporcionando argumentos adicionales. Este formulario es una forma corta de <code><a href="typeprovider">TypeProvider</a></code> ;
ja: <code>new</code> 演算子を呼び出し、追加の引数を指定して、インスタンスを作成します。このフォームは <code><a href="typeprovider">TypeProvider</a></code> の短縮形です。
ko: <code>new</code> 연산자 를 호출하고 추가 인수를 제공 하여 인스턴스를 작성하십시오 . 이 형식은 짧은 형식의 <code><a href="typeprovider">TypeProvider</a></code> 입니다 .
ru: Создайте экземпляр, вызвав <code>new</code> оператор и предоставив дополнительные аргументы. Эта форма является краткой формой <code><a href="typeprovider">TypeProvider</a></code> ;

source: Create an instance of a component of type <code>T</code> based on the current <code><a href="../api/core/testing/testbed">TestBed</a></code> configuration. After calling <code>compileComponent</code>, the <code><a href="../api/core/testing/testbed">TestBed</a></code> configuration is frozen for the duration of the current spec.
es: Cree una instancia de un componente de tipo <code>T</code> seg&uacute;n la configuraci&oacute;n actual de <code><a href="../api/core/testing/testbed">TestBed</a></code> . Despu&eacute;s de llamar a <code>compileComponent</code> , la configuraci&oacute;n de <code><a href="../api/core/testing/testbed">TestBed</a></code> se congela mientras dure la especificaci&oacute;n actual.
ja: 現在の <code><a href="../api/core/testing/testbed">TestBed</a></code> 構成に基づいて、タイプ <code>T</code> のコンポーネントのインスタンスを作成します。 <code>compileComponent</code> を呼び出した後、 <code><a href="../api/core/testing/testbed">TestBed</a></code> 構成は現在の仕様の期間中フリーズされます。
ko: 현재 <code><a href="../api/core/testing/testbed">TestBed</a></code> 구성을 기반으로 <code>T</code> 유형의 컴포넌트 인스턴스를 작성하십시오 . 호출 한 후 <code>compileComponent</code> 을 의 <code><a href="../api/core/testing/testbed">TestBed</a></code> 구성은 현재 사양의 기간 동안 동결된다.
ru: Создайте экземпляр компонента типа <code>T</code> на основе текущей конфигурации <code><a href="../api/core/testing/testbed">TestBed</a></code> . После вызова <code>compileComponent</code> , то <code><a href="../api/core/testing/testbed">TestBed</a></code> конфигурация замораживается на время текущей спецификации.

source: Create and register an injectable service
es: Crear y registrar un servicio de inyectables
ja: 注入可能なサービスを作成して登録する
ko: 주사 서비스 생성 및 등록
ru: Создание и регистрация инъекционного сервиса

source: Create corresponding translation providers for the JIT compiler.
es: Crear los correspondientes proveedores de traducción para el compilador JIT.
ja: JITコンパイラに対応する翻訳プロバイダを作成します。
ko: JIT 컴파일러에 해당하는 변환 제공자를 작성하십시오.
ru: Создайте соответствующие провайдеры перевода для компилятора JIT.

source: Create custom pipes to encapsulate transformations that are not provided with the built-in pipes. You can then use your custom pipe in template expressions, the same way you use built-in pipes&mdash;to transform input values to output values for display.
ja: カスタムパイプを作成して、組み込みパイプで提供されていない変換をカプセル化します。次に、組み込みパイプを使用するのと同じ方法で、テンプレート式でカスタムパイプを使用して、入力値を表示用の出力値に変換できます。
ko: 기본 제공 파이프와 함께 제공되지 않는 변환을 캡슐화하는 사용자 지정 파이프를 만듭니다. 그런 다음 기본 제공 파이프를 사용하는 것과 동일한 방식으로 템플릿 표현식에서 사용자 지정 파이프를 사용하여 입력 값을 표시 할 출력 값으로 변환 할 수 있습니다.
ru: Создавайте настраиваемые каналы для инкапсуляции преобразований, которые не предусмотрены встроенными каналами. Затем вы можете использовать свой настраиваемый канал в выражениях шаблона так же, как вы используете встроенные каналы - для преобразования входных значений в выходные значения для отображения.

source: Create custom validators and input elements.
es: Crear validadores y elementos de entrada personalizados.
ja: カスタムバリデータと入力要素を作成します。
ko: 사용자 정의 유효성 검사기 및 입력 요소를 만듭니다.
ru: Создавайте пользовательские валидаторы и элементы ввода.

source: Create mock heroes
es: Crear héroes de broma
ja: モックヒーローの作成
ko: 모의 영웅 만들기
ru: Создавайте героев-издевателей

source: Create reusable animations.
es: Crear animaciones reutilizables.
ja: 再利用可能なアニメーションを作成します。
ko: 재사용 가능한 애니메이션을 만듭니다.
ru: Создавайте многоразовые анимации.

source: Create source control commits for updates and migrations.
ja: 更新と移行のためのソース管理コミットを作成します。
ko: 업데이트 및 마이그레이션을위한 소스 제어 커밋을 만듭니다.
ru: Создавайте коммиты управления исходным кодом для обновлений и миграций.

source: Create the <code>Hero</code> model class.
es: Crea la clase modelo <code>Hero</code> .
ja: <code>Hero</code> モデルクラスを作成します。
ko: <code>Hero</code> 모델 클래스를 만듭니다 .
ru: Создайте класс модели <code>Hero</code> .

source: Create the <code>HeroService</code>
es: Crea el <code>HeroService</code>
ja: <code>HeroService</code> を作成する
ko: <code>HeroService</code> 만들기
ru: Создать <code>HeroService</code>

source: Create the <code>MessageService</code>
es: Crear el servicio de <code>MessageService</code>
ja: <code>MessageService</code> を作成する
ko: <code>MessageService</code> 를 작성하십시오
ru: Создать <code>MessageService</code>

source: Create the <code>PageNotFoundComponent</code> to display when users visit invalid URLs.
es: Cree el <code>PageNotFoundComponent</code> para mostrar cuando los usuarios visiten URL no v&aacute;lidas.
ja: ユーザーが無効なURLにアクセスしたときに表示する <code>PageNotFoundComponent</code> を作成します。
ko: 사용자가 유효하지 않은 URL을 방문 할 때 표시 할 <code>PageNotFoundComponent</code> 를 작성하십시오 .
ru: Создайте <code>PageNotFoundComponent</code> для отображения, когда пользователи посещают недействительные URL-адреса.

source: Create the <em>Routing Module</em>
es: Crear el <em>m&oacute;dulo de enrutamiento</em>
ja: <em>ルーティングモジュールを</em>作成する<em></em>
ko: <em>라우팅 모듈</em> 생성<em></em>
ru: Создать <em>модуль маршрутизации</em>

source: Create the ASP.NET 4.x project in the usual way as follows:
es: Crear el proyecto ASP.NET 4.x de la forma habitual,de la siguiente manera:
ja: ASP.NET 4.xプロジェクトを通常の方法で以下のように作成します。
ko: 다음과 같이 일반적인 방식으로 ASP.NET 4.x 프로젝트를 만듭니다.
ru: Создайте проект ASP.NET 4.x обычным способом следующим образом:

source: Create the Hero model class
es: Crear la clase de modelo de Héroe
ja: ヒーローモデルクラスの作成
ko: Hero 모델 클래스 만들기
ru: Создать модельный класс "Герой

source: Create the cart page
es: Crear la página del carrito
ja: カートページを作成する
ko: 장바구니 페이지 작성
ru: Создать страницу корзины

source: Create the cart view
ja: カートビューを作成する
ko: 카트보기 만들기
ru: Создать вид корзины

source: Create the cart view in two steps:
ja: 2つのステップでカートビューを作成します。
ko: 두 단계로 카트보기를 만듭니다.
ru: Создайте вид корзины в два этапа:

source: Create the checkout form
es: Crear el formulario de compra
ja: チェックアウトフォームの作成
ko: 결제 양식 작성
ru: Создать форму оформления заказа
