Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/angular/angular.*.006.xlf
Languages: es, ja, ko, ru, zh_cn

source: Configures the <code><a href="injector">Injector</a></code> to return a value by invoking a <code>useFactory</code> function.
ja: <code>useFactory</code> 関数を呼び出して値を返すように <code><a href="injector">Injector</a></code> を構成します。
ko: <code>useFactory</code> 함수 를 호출하여 값을 반환 하도록 <code><a href="injector">Injector</a></code> 를 구성합니다 .
ru: Настраивает <code><a href="injector">Injector</a></code> для возврата значения путем вызова функции <code>useFactory</code> .

source: Configures the <code><a href="injector">Injector</a></code> to return a value for a token.
es: Configura el <code><a href="injector">Injector</a></code> para devolver un valor para un token.
ja: トークンの値を返すように <code><a href="injector">Injector</a></code> を構成します。
ko: 토큰 값을 반환 하도록 <code><a href="injector">Injector</a></code> 를 구성합니다 .
ru: Конфигурирует <code><a href="injector">Injector</a></code> для возврата значения токена.

source: Configures the <code><a href="injector">Injector</a></code> to return a value for a token. Base for <code><a href="valueprovider">ValueProvider</a></code> decorator.
es: Configura el <code><a href="injector">Injector</a></code> para devolver un valor para un token. Base para el decorador <code><a href="valueprovider">ValueProvider</a></code> .
ja: トークンの値を返すように <code><a href="injector">Injector</a></code> を構成します。 <code><a href="valueprovider">ValueProvider</a></code> デコレータのベース。
ko: 토큰 값을 반환 하도록 <code><a href="injector">Injector</a></code> 를 구성합니다 . <code><a href="valueprovider">ValueProvider</a></code> 데코레이터의 기본입니다 .
ru: Конфигурирует <code><a href="injector">Injector</a></code> для возврата значения токена. База для декоратора <code><a href="valueprovider">ValueProvider</a></code> .

source: Configures the <code><a href="injector">Injector</a></code> to return a value of another <code><a href="existingsansprovider#useExisting">useExisting</a></code> token.
es: Configura el <code><a href="injector">Injector</a></code> para devolver un valor de otro <code><a href="existingsansprovider#useExisting">useExisting</a></code> token.
ja: 別の <code><a href="existingsansprovider#useExisting">useExisting</a></code> トークンの値を返すように <code><a href="injector">Injector</a></code> を構成します。
ko: 다른 <code><a href="existingsansprovider#useExisting">useExisting</a></code> 토큰 의 값을 반환 하도록 <code><a href="injector">Injector</a></code> 를 구성합니다 .
ru: Настраивает <code><a href="injector">Injector</a></code> для возврата значения другого токена <code><a href="existingsansprovider#useExisting">useExisting</a></code> .

source: Configures the <code><a href="injector">Injector</a></code> to return a value of another <code>useExisting</code> token.
ja: 別の <code>useExisting</code> トークンの値を返すように <code><a href="injector">Injector</a></code> を構成します。
ko: 다른 <code>useExisting</code> 토큰 의 값을 반환 하도록 <code><a href="injector">Injector</a></code> 를 구성합니다 .
ru: Настраивает <code><a href="injector">Injector</a></code> для возврата значения другого токена <code>useExisting</code> .

source: Configures the <code><a href="injector">Injector</a></code> to return an instance of <code><a href="type">Type</a></code> when `Type' is used as the token.
es: Configura el <code><a href="injector">Injector</a></code> para devolver una instancia de <code><a href="type">Type</a></code> cuando se usa 'Tipo' como token.
ja: 「Type」がトークンとして使用されている場合に、 <code><a href="type">Type</a></code> のインスタンスを返すように <code><a href="injector">Injector</a></code> を構成します。
ko: `Type '이 토큰으로 사용될 때 <code><a href="injector">Injector</a></code> 가 <code><a href="type">Type</a></code> 인스턴스를 리턴하도록 구성합니다 .
ru: Настраивает <code><a href="injector">Injector</a></code> для возврата экземпляра <code><a href="type">Type</a></code> , когда `Type 'используется в качестве токена.

source: Configures the <code><a href="injector">Injector</a></code> to return an instance of <code>useClass</code> for a token.
es: Configura el <code><a href="injector">Injector</a></code> para devolver una instancia de <code>useClass</code> para un token.
ja: トークンの <code>useClass</code> のインスタンスを返すように <code><a href="injector">Injector</a></code> を構成します。
ko: 토큰에 대해 <code>useClass</code> 인스턴스를 리턴 하도록 <code><a href="injector">Injector</a></code> 를 구성합니다 .
ru: Настраивает <code><a href="injector">Injector</a></code> для возврата экземпляра <code>useClass</code> для токена.

source: Configures the <code><a href="injector">Injector</a></code> to return an instance of <code>useClass</code> for a token. Base for <code><a href="staticclassprovider">StaticClassProvider</a></code> decorator.
es: Configura el <code><a href="injector">Injector</a></code> para devolver una instancia de <code>useClass</code> para un token. Base para decorador <code><a href="staticclassprovider">StaticClassProvider</a></code> .
ja: トークンの <code>useClass</code> のインスタンスを返すように <code><a href="injector">Injector</a></code> を構成します。 <code><a href="staticclassprovider">StaticClassProvider</a></code> デコレータのベース。
ko: 토큰에 대해 <code>useClass</code> 인스턴스를 리턴 하도록 <code><a href="injector">Injector</a></code> 를 구성합니다 . <code><a href="staticclassprovider">StaticClassProvider</a></code> 데코레이터의 기본입니다 .
ru: Настраивает <code><a href="injector">Injector</a></code> для возврата экземпляра <code>useClass</code> для токена. База для <code><a href="staticclassprovider">StaticClassProvider</a></code> декоратор.

source: Configures the <code><a href="injector">Injector</a></code> to return an instance of a token.
es: Configura el <code><a href="injector">Injector</a></code> para devolver una instancia de un token.
ja: トークンのインスタンスを返すように <code><a href="injector">Injector</a></code> を構成します。
ko: 토큰 인스턴스를 반환 하도록 <code><a href="injector">Injector</a></code> 를 구성합니다 .
ru: Настраивает <code><a href="injector">Injector</a></code> для возврата экземпляра токена.

source: Configures the URL codec for encoding and decoding URLs. Default is the <code>AngularJSCodec</code>
es: Configura el c&oacute;dec de URL para codificar y decodificar URL. El valor predeterminado es <code>AngularJSCodec</code>
ja: URLをエンコードおよびデコードするためのURLコーデックを構成します。デフォルトは <code>AngularJSCodec</code> です
ko: URL 인코딩 및 디코딩을위한 URL 코덱을 구성합니다. 기본값은 <code>AngularJSCodec</code> 입니다.
ru: Настраивает кодек URL для кодирования и декодирования URL. По умолчанию используется <code>AngularJSCodec</code>

source: Configures the base href when used in client-side rendered applications
es: Configura la base href cuando se usa en aplicaciones renderizadas del lado del cliente
ja: クライアントサイドのレンダリングアプリケーションで使用する際のベースとなる href を設定します。
ko: 클라이언트 측 렌더링 된 애플리케이션에서 사용될 때 기본 href를 구성합니다.
ru: Настраивает базовый href при использовании в клиентских приложениях.

source: Configures the base href when used in server-side rendered applications
es: Configura la base href cuando se usa en aplicaciones renderizadas del lado del servidor
ja: サーバーサイドのレンダリングアプリケーションで使用する際のベースとなる href を設定します。
ko: 서버 측 렌더링 된 애플리케이션에서 사용될 때 기본 href를 구성합니다.
ru: Настраивает базовый href,когда используется в приложениях на стороне сервера.

source: Configures the gathering of Angular CLI usage metrics. See <a href="https://angular.io/cli/usage-analytics-gathering">https://angular.io/cli/usage-analytics-gathering</a>.
ja: AngularCLI使用状況メトリックの収集を構成します。<a href="https://angular.io/cli/usage-analytics-gathering">https://angular.io/cli/usage-analytics-gatheringを</a>参照してください。
ko: Angular CLI 사용량 메트릭 수집을 구성합니다. <a href="https://angular.io/cli/usage-analytics-gathering">https://angular.io/cli/usage-analytics-gathering을</a> 참조 하십시오 .
ru: Настраивает сбор показателей использования Angular CLI. См. <a href="https://angular.io/cli/usage-analytics-gathering">Https://angular.io/cli/usage-analytics-gathering</a> .

source: Configures the gathering of Angular CLI usage metrics. See <a href="https://v8.angular.io/cli/usage-analytics-gathering">https://v8.angular.io/cli/usage-analytics-gathering</a>.
es: Configura la recopilaci&oacute;n de m&eacute;tricas de uso de CLI angular. Ver <a href="https://v8.angular.io/cli/usage-analytics-gathering">https://v8.angular.io/cli/usage-analytics-gathering</a> .
ja: Angular CLI使用状況メトリックの収集を構成します。<a href="https://v8.angular.io/cli/usage-analytics-gathering">https://v8.angular.io/cli/usage-analytics-gatheringを</a>参照してください。
ko: Angular CLI 사용 메트릭 수집을 구성합니다. <a href="https://v8.angular.io/cli/usage-analytics-gathering">https://v8.angular.io/cli/usage-analytics-gathering을</a> 참조 하십시오 .
ru: Настраивает сбор метрик использования Angular CLI. Смотрите <a href="https://v8.angular.io/cli/usage-analytics-gathering">https://v8.angular.io/cli/usage-analytics-gathering</a> .

source: Configures the generation of the application's HTML index.
es: Configura la generación del índice HTML de la aplicación.
ja: アプリケーションのHTMLインデックスの生成を設定します。
ko: 응용 프로그램의 HTML 색인 생성을 구성합니다.
ru: Настраивает генерацию HTML индекса приложения.

source: Configures the hash prefix used in the URL when using the <code><a href="../hashlocationstrategy">HashLocationStrategy</a></code>
es: Configura el prefijo hash utilizado en la URL cuando se usa <code><a href="../hashlocationstrategy">HashLocationStrategy</a></code>
ja: <code><a href="../hashlocationstrategy">HashLocationStrategy</a></code> を使用するときにURLで使用されるハッシュプレフィックスを構成します
ko: <code><a href="../hashlocationstrategy">HashLocationStrategy</a></code> 를 사용할 때 URL에 사용되는 해시 접두사를 구성합니다.
ru: Настраивает префикс хеша, используемый в URL при использовании <code><a href="../hashlocationstrategy">HashLocationStrategy</a></code>

source: Configures the queries that will be injected into the directive.
es: Configura las consultas que serán inyectadas en la directiva.
ja: ディレクティブに注入されるクエリを設定します。
ko: 지시문에 삽입 될 쿼리를 구성합니다.
ru: Настраивает запросы,которые будут введены в директиву.

source: Configures the root injector for an app with providers of <code>@angular/core</code> dependencies that <code><a href="applicationref">ApplicationRef</a></code> needs to bootstrap components.
es: Configura el inyector ra&iacute;z para una aplicaci&oacute;n con proveedores de dependencias <code>@angular/core</code> que <code><a href="applicationref">ApplicationRef</a></code> necesita para arrancar componentes.
ja: <code><a href="applicationref">ApplicationRef</a></code> がコンポーネントをブートストラップするために必要な <code>@angular/core</code> 依存関係のプロバイダーを持つアプリのルートインジェクターを構成します。
ko: <code><a href="applicationref">ApplicationRef</a></code> 가 구성 요소를 부트 스트랩하는 데 필요한 <code>@angular/core</code> 종속성 공급자가있는 앱의 루트 인젝터를 구성합니다.
ru: Настраивает корневой инжектор для приложения с поставщиками зависимостей <code>@angular/core</code> которые необходимы <code><a href="applicationref">ApplicationRef</a></code> для начальной загрузки компонентов.

source: Configures the root injector for an app with providers of <code>@angular/core</code> dependencies that <code><a href="core/applicationref">ApplicationRef</a></code> needs to bootstrap components.
es: Configura el inyector ra&iacute;z para una aplicaci&oacute;n con proveedores de dependencias <code>@angular/core</code> que <code><a href="core/applicationref">ApplicationRef</a></code> necesita para arrancar componentes.
ja: <code><a href="core/applicationref">ApplicationRef</a></code> がコンポーネントをブートストラップするために必要な <code>@angular/core</code> 依存関係のプロバイダーを持つアプリのルートインジェクターを構成します。
ko: <code><a href="core/applicationref">ApplicationRef</a></code> 가 구성 요소를 부트 스트랩하는 데 필요한 <code>@angular/core</code> 종속성 공급자가있는 앱의 루트 인젝터를 구성합니다.
ru: Настраивает корневой инжектор для приложения с поставщиками зависимостей <code>@angular/core</code> которые необходимы <code><a href="core/applicationref">ApplicationRef</a></code> для начальной загрузки компонентов.

source: Configures the scroll offset the router will use when scrolling to an element.
es: Configura el desplazamiento de desplazamiento que el router utilizará cuando se desplace a un elemento.
ja: ルータが要素にスクロールするときに使用するスクロールオフセットを設定します。
ko: 요소로 스크롤 할 때 라우터가 사용할 스크롤 오프셋을 구성합니다.
ru: Настраивает смещение прокрутки,которое будет использоваться маршрутизатором при прокрутке к элементу.

source: Configures the top offset used when scrolling to an anchor.
es: Configura el desplazamiento superior que se utiliza al desplazarse a un ancla.
ja: アンカーへのスクロール時に使用するトップオフセットを設定します。
ko: 앵커로 스크롤 할 때 사용되는 상단 오프셋을 구성합니다.
ru: Настраивает верхнее смещение,используемое при прокрутке к якорю.

source: Configures whether the location upgrade module should use the <code><a href="../hashlocationstrategy">HashLocationStrategy</a></code> or the <code><a href="../pathlocationstrategy">PathLocationStrategy</a></code>
es: Configura si el m&oacute;dulo de actualizaci&oacute;n de ubicaci&oacute;n debe usar <code><a href="../hashlocationstrategy">HashLocationStrategy</a></code> o <code><a href="../pathlocationstrategy">PathLocationStrategy</a></code>
ja: 場所のアップグレードモジュールを使用する必要があるかどうかを設定します <code><a href="../hashlocationstrategy">HashLocationStrategy</a></code> か <code><a href="../pathlocationstrategy">PathLocationStrategy</a></code> を
ko: 위치 업그레이드 모듈을 사용할지 여부를 구성 <code><a href="../hashlocationstrategy">HashLocationStrategy</a></code> 또는 <code><a href="../pathlocationstrategy">PathLocationStrategy</a></code> 을
ru: Настраивает, должен ли модуль обновления местоположения использовать <code><a href="../hashlocationstrategy">HashLocationStrategy</a></code> или <code><a href="../pathlocationstrategy">PathLocationStrategy</a></code>

source: Configures your project to use web workers, if it isn't already.
ja: ウェブワーカーを使用するようにプロジェクトを設定します。
ko: 웹 작업자를 사용하도록 프로젝트를 구성합니다 (아직 그렇지 않은 경우).
ru: Настраивает ваш проект на использование веб-работников,если это еще не так.

source: Configuring AOT compilation
es: Configurando la compilación de AOT
ja: AOTコンパイルの設定
ko: AOT 컴파일 구성
ru: Настройка компиляции AOT

source: Configuring CLI schematics
es: Configurando los esquemas del CLI
ja: CLIの回路図の設定
ko: CLI 회로도 구성
ru: Настройка схем CLI

source: Configuring CommonJS dependencies
ja: CommonJSの依存関係を設定する
ko: CommonJS 종속성 구성
ru: Настройка зависимостей CommonJS

source: Configuring HTTP URL parameters
ja: HTTP URL パラメータの設定
ko: HTTP URL 매개 변수 구성
ru: Настройка параметров HTTP URL

source: Configuring application environments
es: Configurar los entornos de la aplicación
ja: アプリケーション環境の設定
ko: 응용 프로그램 환경 구성
ru: Настройка прикладных сред

source: Configuring browser compatibility
es: Configuración de la compatibilidad del navegador
ja: ブラウザの互換性を設定する
ko: 브라우저 호환성 구성
ru: Настройка совместимости с браузером

source: Configuring builder targets
es: Configurar los objetivos del constructor
ja: ビルダーターゲットの設定
ko: 빌더 대상 구성
ru: Настройка целей застройщика

source: Configuring custom cookie/header names
es: Configuración de nombres personalizados de cookies/cabezas
ja: カスタムクッキー/ヘッダー名の設定
ko: 사용자 정의 쿠키 / 헤더 이름 구성
ru: Настройка пользовательских имен куки/заголовков куки

source: Configuring differential loading
es: Configurando la carga diferencial
ja: 差動荷重の設定
ko: 차등 로딩 구성
ru: Настройка дифференциальной нагрузки

source: Configuring serve for ES5
es: Configurando el servicio para el ES5
ja: ES5のサーブを設定する
ko: ES5에 대한 서브 구성
ru: Настройка служит для ES5

source: Configuring servers for hosting multiple locales is outside the scope of this guide. For details on how to deploy apps to a remote server, see <a href="deployment">Deployment</a>.
ja: 複数のロケールをホストするようにサーバーを構成することは、このガイドの範囲外です。リモートサーバにアプリケーションを展開する方法の詳細については、を参照<a href="deployment">の展開を</a>。
ko: 여러 로캘을 호스팅하기위한 서버 구성은이 가이드의 범위를 벗어납니다. 원격 서버에 앱을 배포하는 방법에 대한 자세한 내용은 <a href="deployment">배포를</a> 참조하십시오 .
ru: Настройка серверов для размещения нескольких локалей выходит за рамки этого руководства. Подробные сведения о развертывании приложений на удаленном сервере см . В разделе &laquo; <a href="deployment">Развертывание&raquo;</a> .

source: Configuring size budgets
es: Configurar los presupuestos de tamaño
ja: サイズ予算の設定
ko: 규모 예산 구성
ru: Настройка бюджетов на размер

source: Configuring the child component
ja: 子コンポーネントの設定
ko: 하위 구성 요소 구성
ru: Настройка детского компонента

source: Configuring the child's template
ja: 子のテンプレートを設定する
ko: 자녀의 템플릿 구성
ru: Настройка шаблона ребенка

source: Configuring the e2e command
es: Configurando el comando e2e
ja: e2eコマンドの設定
ko: e2e 명령 구성
ru: Настройка команды e2e

source: Configuring the parent component
ja: 親コンポーネントの設定
ko: 상위 구성 요소 구성
ru: Настройка родительского компонента

source: Configuring the parent's template
ja: 親のテンプレートを設定する
ko: 부모의 템플릿 구성
ru: Настройка родительского шаблона

source: Configuring the request
es: Configurando la solicitud
ja: リクエストの設定
ko: 요청 구성
ru: Настройка запроса

source: Configuring the test command
es: Configurando el comando de prueba
ja: テストコマンドの設定
ko: 테스트 명령 구성
ru: Настройка тестовой команды

source: Confirm it&rsquo;s working
es: Confirma que est&aacute; funcionando
ja: 機能していることを確認する
ko: 작동하는지 확인
ru: Подтвердите, что это работает

source: Confirm this for yourself by temporarily removing the <code>subscribe()</code>, clicking "Dashboard", then clicking "Heroes". You'll see the full list of heroes again.
es: Confirma esto por ti mismo eliminando temporalmente la <code>subscribe()</code> , haciendo clic en "Panel" y luego en "H&eacute;roes". Ver&aacute;s la lista completa de h&eacute;roes nuevamente.
ja: <code>subscribe()</code> を一時的に削除し、「ダッシュボード」をクリックしてから、「ヒーロー」をクリックして、これを自分で確認します。ヒーローの完全なリストが再び表示されます。
ko: <code>subscribe()</code> 를 일시적으로 제거하고 "Dashboard"를 클릭 한 다음 "Heroes"를 클릭하여 이를 직접 확인하십시오 . 영웅 전체 목록을 다시 볼 수 있습니다.
ru: Подтвердите это для себя, временно удалив <code>subscribe()</code> , нажав &laquo;Панель инструментов&raquo;, затем нажав &laquo;Герои&raquo;. Вы снова увидите полный список героев.

source: Congratulations! You have a complete online store application with a product catalog, a shopping cart, and a checkout function.
es: ¡Felicidades! Tienes una aplicación completa de la tienda en línea con un catálogo de productos,un carrito de compras y una función de pago.
ja: おめでとうございます。あなたは、商品カタログ、ショッピングカート、チェックアウト機能を備えた完全なオンラインストアアプリケーションを持っています。
ko: 축하합니다! 제품 카탈로그, 장바구니 및 체크 아웃 기능이있는 완전한 온라인 상점 응용 프로그램이 있습니다.
ru: Поздравляем! У вас есть полная заявка в интернет-магазине с каталогом товаров,корзиной для покупок и функцией оформления заказа.

source: Congratulations! You have an online store application with a product catalog and shopping cart. You also have the ability to look up and display shipping prices.
es: ¡Felicidades! Tienes una aplicación de tienda online con un catálogo de productos y un carrito de compras.También tienes la capacidad de buscar y mostrar los precios de envío.
ja: おめでとうございます。あなたは、商品カタログとショッピングカートを備えたオンラインストアアプリケーションを持っています。また、送料を調べて表示する機能もあります。
ko: 축하합니다! 제품 카탈로그와 장바구니가있는 온라인 상점 응용 프로그램이 있습니다. 운송 가격을 조회하고 표시 할 수도 있습니다.
ru: Поздравляем! У вас есть заявка в интернет-магазине с каталогом товаров и корзиной.У вас также есть возможность просмотреть и отобразить цены на доставку.

source: Congratulations! You have an online store application with a product catalog and shopping cart. You can also look up and display shipping prices.
ja: おめでとうございます。商品カタログとショッピングカートのあるオンラインストアアプリができました。また、送料を調べて表示することもできます。
ko: 축하합니다! 제품 카탈로그와 장바구니가있는 온라인 스토어 애플리케이션이 있습니다. 배송비를 조회하고 표시 할 수도 있습니다.
ru: Поздравляем! У вас есть заявка в интернет-магазине с каталогом товаров и корзиной.Вы также можете посмотреть и отобразить цены на доставку.

source: Congratulations! You have integrated routing into your online store.
es: ¡Felicidades! Ha integrado el enrutamiento en su tienda online.
ja: おめでとうございます。オンラインストアにルーティングが統合されましたね。
ko: 축하합니다! 온라인 상점에 라우팅을 통합했습니다.
ru: Поздравляем! Вы интегрировали маршрутизацию в ваш интернет-магазин.

source: Congratulations! You're running a hybrid application! The existing AngularJS code works as before <em>and</em> you're ready to start adding Angular code.
es: &iexcl;Felicidades! Est&aacute;s ejecutando una aplicaci&oacute;n h&iacute;brida! El c&oacute;digo AngularJS existente funciona como antes <em>y</em> est&aacute; listo para comenzar a agregar c&oacute;digo Angular.
ja: おめでとう！ハイブリッドアプリケーションを実行しています。既存のAngularJSコードは以前<em>と</em>同様に機能し、Angularコードを追加する準備が整いました。
ko: 축하합니다! 하이브리드 애플리케이션을 실행 중입니다! 기존 AngularJS 코드는 이전 <em>과 동일하게</em> 작동하며 Angular 코드 추가를 시작할 준비가되었습니다.
ru: Поздравляем! Вы запускаете гибридное приложение! Существующий код AngularJS работает как прежде, <em>и</em> вы готовы начать добавление кода Angular.

source: Congratulations! You've completed your first Angular app!
es: ¡Felicidades! ¡Has completado tu primera aplicación de Angular!
ja: おめでとうございます。初めてのAngularアプリが完成しましたね!
ko: 축하합니다! 첫 Angular 앱을 완료했습니다!
ru: Поздравляем! Ты закончил свое первое приложение "Угловой"!

source: Connect your CLI to your Firebase account and initialize the connection to your project using <code>firebase login</code> and <code>firebase init</code>.
es: Conecte su CLI a su cuenta de Firebase e inicialice la conexi&oacute;n a su proyecto usando el <code>firebase login</code> <code>firebase init</code> y Firebase init .
ja: CLIをFirebaseアカウントに接続し、 <code>firebase login</code> と <code>firebase init</code> を使用してプロジェクトへの接続を初期化します。
ko: Firebase 계정에 CLI를 연결하고 <code>firebase login</code> 및 <code>firebase init</code> 를 사용하여 프로젝트 연결을 초기화하십시오 .
ru: Подключите ваш CLI к вашей учетной записи Firebase и инициализируйте соединение с вашим проектом, используя <code>firebase login</code> и <code>firebase init</code> .

source: Consider a <code><a href="../api/common/titlecasepipe">TitleCasePipe</a></code> that capitalizes the first letter of each word. Here's a naive implementation with a regular expression.
es: Considere un <code><a href="../api/common/titlecasepipe">TitleCasePipe</a></code> que capitaliza la primera letra de cada palabra. Aqu&iacute; hay una implementaci&oacute;n ingenua con una expresi&oacute;n regular.
ja: 各単語の最初の文字を大文字にする <code><a href="../api/common/titlecasepipe">TitleCasePipe</a></code> について考えます。正規表現を使用した単純な実装を次に示します。
ko: 각 단어의 첫 글자를 대문자로 하는 <code><a href="../api/common/titlecasepipe">TitleCasePipe</a></code> 를 고려하십시오 . 다음은 정규 표현식을 사용한 순진한 구현입니다.
ru: Рассмотрим <code><a href="../api/common/titlecasepipe">TitleCasePipe</a></code> , которая заглавная первая буква каждого слова. Вот наивная реализация с регулярным выражением.

source: Consider a <code><a href="../api/common/titlecasepipe">TitleCasePipe</a></code> that capitalizes the first letter of each word. Here's an implementation with a regular expression.
ja: 各単語の最初の文字を大文字にする <code><a href="../api/common/titlecasepipe">TitleCasePipe</a></code> について考えてみます。正規表現を使用した実装を次に示します。
ko: 각 단어의 첫 글자를 대문자로 표시 하는 <code><a href="../api/common/titlecasepipe">TitleCasePipe</a></code> 를 고려하십시오 . 다음은 정규 표현식을 사용한 구현입니다.
ru: Рассмотрим <code><a href="../api/common/titlecasepipe">TitleCasePipe</a></code> , в котором первая буква каждого слова пишется с заглавной буквы. Вот реализация с регулярным выражением.
