Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/angular/angular.*.006.xlf
Languages: es, ja, ko, ru, zh_cn

source: Calls method <code>readRainbow</code> when a click event is triggered on this button element (or its children) and passes in the event object.
es: Llama al m&eacute;todo <code>readRainbow</code> cuando se activa un evento de clic en este elemento de bot&oacute;n (o sus elementos secundarios ) y pasa al objeto de evento.
ja: このボタン要素（またはその子）でクリックイベントがトリガーされたときにメソッド <code>readRainbow</code> を呼び出し、イベントオブジェクトに渡します。
ko: 이 버튼 요소 (또는 그 자식)에서 click 이벤트가 트리거되고 이벤트 객체를 <code>readRainbow</code> 때 readRainbow 메서드를 호출 합니다.
ru: Вызывает метод <code>readRainbow</code> , когда событие нажатия вызывается для этого элемента кнопки (или его дочерних элементов) и передается в объект события.

source: Calls the <code><a href="../api/animations/animatechild">animateChild</a>()</code> method on the new view to run its child animations after the main animation completes.
es: Llama al m&eacute;todo <code><a href="../api/animations/animatechild">animateChild</a>()</code> en la nueva vista para ejecutar sus animaciones secundarias una vez que se completa la animaci&oacute;n principal.
ja: 新しいビューで <code><a href="../api/animations/animatechild">animateChild</a>()</code> メソッドを呼び出して、メインアニメーションの完了後に子アニメーションを実行します。
ko: 기본 애니메이션이 완료된 후 새보기 에서 <code><a href="../api/animations/animatechild">animateChild</a>()</code> 메서드를 호출하여 자식 애니메이션을 실행합니다.
ru: Вызывает метод <code><a href="../api/animations/animatechild">animateChild</a>()</code> в новом представлении для запуска его дочерних анимаций после завершения основной анимации.

source: Can I re-export classes and modules?
es: ¿Puedo reexportar las clases y los módulos?
ja: クラスやモジュールを再インポートすることはできますか?
ko: 클래스와 모듈을 다시 내보낼 수 있습니까?
ru: Могу ли я реэкспортировать классы и модули?

source: Can be used to instruct the template compiler to produce <code>.metadata.json</code> files for distribution with an <code>npm</code> package while avoiding the production of <code>.ngfactory.js</code> and <code>.ngstyle.js</code> files that cannot be distributed to <code>npm</code>.
es: Se puede utilizar para indicar al compilador de plantillas que produzca archivos <code>.metadata.json</code> para su distribuci&oacute;n con un paquete <code>npm</code> , evitando la producci&oacute;n de archivos <code>.ngfactory.js</code> y <code>.ngstyle.js</code> que no se pueden distribuir a <code>npm</code> .
ja: 生成するためのテンプレートコンパイラに指示するために使用することができます <code>.metadata.json</code> と配布用のファイル <code>npm</code> の生産回避しながらパッケージを <code>.ngfactory.js</code> と <code>.ngstyle.js</code> に配布することができないファイル <code>npm</code> 。
ko: 생산 템플릿 컴파일러를 지시하는 데 사용할 수 있습니다 <code>.metadata.json</code> 로 배포 파일을 <code>npm</code> 생산 피하면서 패키지 <code>.ngfactory.js</code> 및 <code>.ngstyle.js</code> 에 배포 할 수 없습니다 파일 <code>npm</code> .
ru: Может использоваться для указания компилятору шаблона создавать файлы <code>.metadata.json</code> для распространения с пакетом <code>npm</code> , избегая при этом <code>.ngstyle.js</code> файлов <code>.ngfactory.js</code> и .ngstyle.js, которые нельзя распространять в <code>npm</code> .

source: Can be used to wrap inject() calls.
es: Puede ser usado para envolver llamadas de inyección.
ja: inject()の呼び出しをラップするために使用することができます。
ko: inject () 호출을 래핑하는 데 사용할 수 있습니다.
ru: Может использоваться для обёртывания вызовов инъекций.

source: Can be used together with other parameter decorators that modify how dependency injection operates.
es: Puede utilizarse junto con otros decoradores de parámetros que modifican el funcionamiento de la inyección de dependencia.
ja: 依存性インジェクションの動作を変更する他のパラメータデコレータと一緒に使用することができます。
ko: 의존성 주입 작동 방식을 수정하는 다른 매개 변수 데코레이터와 함께 사용할 수 있습니다.
ru: Может использоваться вместе с другими декораторами параметров,которые изменяют работу инжекции зависимостей.

source: Can change a tax return without affecting a return in another component.
es: Puede cambiar una declaración de impuestos sin afectar a una declaración en otro componente.
ja: 他のコンポーネントの申告書に影響を与えずに申告書を変更することができます。
ko: 다른 구성 요소의 수익에 영향을 미치지 않으면 서 세금 보고서를 변경할 수 있습니다.
ru: Может изменять налоговую декларацию,не влияя на возврат в другом компоненте.

source: Can contain <em>host views</em> (created by instantiating a component with the <code>createComponent()</code> method), and <em>embedded views</em> (created by instantiating a <code><a href="templateref">TemplateRef</a></code> with the <code>createEmbeddedView()</code> method).
es: Puede contener <em>vistas de host</em> (creadas creando instancias de un componente con el m&eacute;todo <code>createComponent()</code> ) y <em>vistas incrustadas</em> (creadas creando instancias de <code><a href="templateref">TemplateRef</a></code> con el m&eacute;todo <code>createEmbeddedView()</code> ).
ja: <em>ホストビュー</em>（ <code>createComponent()</code> メソッドを使用してコンポーネントをインスタンス化することによって作成される）、および<em>埋め込みビュー</em>（ <code>createEmbeddedView()</code> メソッドを使用して <code><a href="templateref">TemplateRef</a></code> をインスタンス化することによって作成される）を含めることができます。
ko: 포함될 수 <em>호스트 뷰</em> (와 컴포넌트 인스턴스에 의해 생성 <code>createComponent()</code> 방법), 및 <em>매립 뷰</em> (a 인스턴스화 생성 <code><a href="templateref">TemplateRef</a></code> 을 으로 <code>createEmbeddedView()</code> 메소드).
ru: Может содержать представления <em>хоста</em> (созданные путем создания экземпляра компонента с помощью <code>createComponent()</code> ) и <em>встроенные представления</em> (созданные путем создания экземпляра <code><a href="templateref">TemplateRef</a></code> с помощью <code>createEmbeddedView()</code> ).

source: Can the user actually select the hero displayed by <code>DashboardHeroComponent</code>?
es: &iquest;Puede el usuario seleccionar realmente el h&eacute;roe que muestra <code>DashboardHeroComponent</code> ?
ja: ユーザーは、 <code>DashboardHeroComponent</code> によって表示されたヒーローを実際に選択できますか？
ko: 사용자는 실제로 <code>DashboardHeroComponent</code> 에 의해 표시되는 영웅을 선택할 수 있습니까 ?
ru: Может ли пользователь фактически выбрать героя, отображаемого <code>DashboardHeroComponent</code> ?

source: CanLoad blocks preload
es: CanLoad bloquea la precarga
ja: CanLoad ブロックプリロード
ko: CanLoad 블록 예압
ru: Предварительная нагрузка CanLoad блоков

source: Cancel and save
es: Cancelar y guardar
ja: キャンセルして保存
ko: 취소하고 저장
ru: Отменить и сохранить

source: Cancel ongoing AJAX requests if their results will be invalidated by the updated results.
es: Cancelar las solicitudes AJAX en curso si sus resultados serán invalidados por los resultados actualizados.
ja: 更新された結果によって結果が無効になる場合、進行中のAJAXリクエストをキャンセルします。
ko: 업데이트 된 결과로 결과가 무효화되는 경우 진행중인 AJAX 요청을 취소하십시오.
ru: Отменить текущие AJAX-запросы,если их результаты будут признаны недействительными по обновленным результатам.

source: Cannot assign to template variables
es: No puede asignar a las variables de la plantilla
ja: テンプレート変数に代入できない
ko: 템플릿 변수에 할당 할 수 없습니다
ru: Невозможно присвоить переменным шаблона

source: Capture a state change between any states:
es: Capturar un cambio de estado entre cualquier estado:
ja: 任意の状態間の状態変化をキャプチャします。
ko: 모든 상태 간의 상태 변경을 캡처하십시오.
ru: Зафиксируйте изменение состояния между любыми состояниями:

source: Capture the current value and validation status of a form.
es: Captura el valor actual y el estado de validación de un formulario.
ja: フォームの現在の値と検証状況をキャプチャします。
ko: 양식의 현재 값 및 유효성 검증 상태를 캡처하십시오.
ru: Зафиксируйте текущее значение и статус проверки формы.

source: Care should be taken that if an <code>ngAcceptInputType_</code> override is present for a given input, then the setter should be able to handle any values of the overridden type.
ja: ケア場合に取るべき <code>ngAcceptInputType_</code> のオーバーライドが所与の入力のために存在し、次いで、セッターがオーバーライドタイプの任意の値を処理することができなければなりません。
ko: 주어진 입력에 대해 <code>ngAcceptInputType_</code> 재정의가 존재 하는 경우 setter가 재정의 된 유형의 모든 값을 처리 할 수 ​​있도록주의해야합니다.
ru: Следует позаботиться о том, чтобы если для данного ввода присутствует переопределение <code>ngAcceptInputType_</code> , то установщик должен иметь возможность обрабатывать любые значения переопределенного типа.

source: Case study: Building a custom progress bar
es: Estudio de caso:Construir una barra de progreso personalizada
ja: ケーススタディ。カスタムプログレスバーの構築
ko: 사례 연구 : 사용자 정의 진행률 표시 줄 작성
ru: Случай:Построение индивидуальной шкалы прогресса

source: Catch-all state change for when an element is inserted into the page and the destination state is unknown:
es: Cambio de estado de captura para cuando un elemento se inserta en la página y se desconoce el estado de destino:
ja: ページ内に要素が挿入されていて、遷移先の状態が不明な場合のキャッチオール状態変更。
ko: 요소가 페이지에 삽입되고 대상 상태를 알 수없는 경우의 모든 상태 변경 :
ru: Поймать-все состояние меняется,когда элемент вставлен в страницу и состояние назначения неизвестно:

source: Certain NgModules, such as <code><a href="../api/platform-browser/browsermodule">BrowserModule</a></code>, implement such a guard. Here is a custom constructor for an NgModule called <code>GreetingModule</code>.
es: Ciertos NgModules, como <code><a href="../api/platform-browser/browsermodule">BrowserModule</a></code> , implementan tal protecci&oacute;n. Aqu&iacute; hay un constructor personalizado para un NgModule llamado <code>GreetingModule</code> .
ja: <code><a href="../api/platform-browser/browsermodule">BrowserModule</a></code> などの特定のNgModuleは、このようなガードを実装しています。以下は、 <code>GreetingModule</code> と呼ばれるNgModuleのカスタムコンストラクタです。
ko: <code><a href="../api/platform-browser/browsermodule">BrowserModule</a></code> 과 같은 특정 NgModules는 이러한 보호를 구현합니다. 다음은 <code>GreetingModule</code> 이라는 NgModule의 사용자 정의 생성자입니다 .
ru: Некоторые NgModules, такие как <code><a href="../api/platform-browser/browsermodule">BrowserModule</a></code> , реализуют такую защиту . Вот пользовательский конструктор для NgModule с именем <code>GreetingModule</code> .

source: Certain services, such as the <code><a href="../api/router/router">Router</a></code>, only work when you register them in the application root injector.
es: Ciertos servicios, como el <code><a href="../api/router/router">Router</a></code> , solo funcionan cuando los registra en el inyector ra&iacute;z de la aplicaci&oacute;n.
ja: <code><a href="../api/router/router">Router</a></code> などの特定のサービスは、アプリケーションルートインジェクターに登録した場合にのみ機能します。
ko: <code><a href="../api/router/router">Router</a></code> 와 같은 특정 서비스 는 응용 프로그램 루트 인젝터에 서비스 를 등록 할 때만 작동합니다.
ru: Некоторые службы, такие как <code><a href="../api/router/router">Router</a></code> , работают только при регистрации их в корневом инжекторе приложения.

source: Chaining RxJS operators
es: Encadenando a los operadores de RxJS
ja: RxJS 演算子のチェーン化
ko: 연결 RxJS 연산자
ru: Цепи операторов RxJS

source: Chaining expressions with <code>;</code> or <code>,</code>
es: Encadenando expresiones con <code>;</code> o <code>,</code>
ja: 式を <code>;</code> でチェーンする または <code>,</code>
ko: 와 표현을 체인 <code>;</code> 또는 <code>,</code>
ru: Цепные выражения с <code>;</code> или <code>,</code>

source: Chaining pipes
es: Encadenar las tuberías
ja: パイプの連結
ko: 체인 파이프
ru: Цепные трубы

source: Change Detection
es: Detección de cambios
ja: 変化検出
ko: 변화 감지
ru: Обнаружение изменений

source: Change Detection with <code><a href="../api/upgrade/static/downgrademodule">downgradeModule</a>()</code>
es: Detecci&oacute;n de cambios con <code><a href="../api/upgrade/static/downgrademodule">downgradeModule</a>()</code>
ja: <code><a href="../api/upgrade/static/downgrademodule">downgradeModule</a>()</code> 変更検出（）
ko: <code><a href="../api/upgrade/static/downgrademodule">downgradeModule</a>()</code> ()로 변경 감지
ru: Обнаружение изменений с помощью <code><a href="../api/upgrade/static/downgrademodule">downgradeModule</a>()</code>

source: Change an input value with <em>dispatchEvent()</em>
es: Cambiar un valor de entrada con <em>dispatchEvent ()</em>
ja: <em>dispatchEvent（）を使用</em>して入力値を変更する<em></em>
ko: <em>dispatchEvent ()를</em> 사용하여 입력 값 변경<em></em>
ru: Измените входное значение с <em>dispatchEvent ()</em>

source: Change detection begins.
es: Comienza la detección de cambios.
ja: 変更検出を開始します。
ko: 변경 감지가 시작됩니다.
ru: Начинается обнаружение изменений.

source: Change detection completes.
es: La detección de cambios se ha completado.
ja: 変更検出が完了しました。
ko: 변경 감지가 완료되었습니다.
ru: Обнаружение изменений завершено.

source: Change detection usage
ja: 変更検出の使用法
ko: 변경 감지 사용
ru: Использование для обнаружения изменений

source: Change propagation
es: Propagación del cambio
ja: 変更伝播
ko: 전파 변경
ru: Распространение изменений

source: Change root relative URLs in stylesheets to include base HREF and deploy URL. Use only for compatibility and transition. The behavior of this option is non-standard and will be removed in the next major release.
es: Cambiar las URLs relativas de la raíz en las hojas de estilo para incluir la HREF base y desplegar la URL.Usar sólo para la compatibilidad y la transición.El comportamiento de esta opción no es estándar y se eliminará en la próxima versión principal.
ja: スタイルシートのルート相対URLを変更して、ベースのHREFとデプロイURLを含むようにします。互換性と移行のためだけに使用してください。このオプションの動作は非標準であり、次のメジャーリリースで削除されます。
ko: 기본 HREF 및 배치 URL을 포함하도록 스타일 시트에서 루트 상대 URL을 변경하십시오. 호환성과 전환에만 사용하십시오. 이 옵션의 동작은 비표준이며 다음 주요 릴리스에서 제거 될 예정입니다.
ru: Измените корневые относительные URL в таблицах стилей,чтобы включить базовую HREF и развернуть URL.Используется только для совместимости и перехода.Поведение этого параметра нестандартное и будет удалено в следующем основном выпуске.

source: Change the <code>admin</code> path in the <code>admin-routing.module.ts</code> from <code>'admin'</code> to an empty string, <code>''</code>, the empty path.
ja: 変更 <code>admin</code> におけるパス <code>admin-routing.module.ts</code> から <code>'admin'</code> 、空の文字列に <code>''</code> 、空のパスを。
ko: <code>admin-routing.module.ts</code> 의 <code>admin</code> 경로 를 <code>'admin'</code> 에서 빈 문자열 인 <code>''</code> , 빈 경로로 변경하십시오.
ru: Измените путь <code>admin</code> в <code>admin-routing.module.ts</code> с <code>'admin'</code> на пустую строку <code>''</code> , пустой путь.

source: Change the <code>admin</code><strong>path</strong> in the <code>admin-routing.module.ts</code> from <code>'admin'</code> to an empty string, <code>''</code>, the <em>empty path</em>.
es: Cambie la <strong>ruta</strong> del <code>admin</code> istrador en <code>admin-routing.module.ts</code> de <code>'admin'</code> a una cadena vac&iacute;a <code>''</code> , la <em>ruta vac&iacute;a</em> .<strong></strong><em></em>
ja: 変更 <code>admin</code> <strong>パス</strong>で <code>admin-routing.module.ts</code> から <code>'admin'</code> 、空の文字列に <code>''</code> 、<em>空のパスを</em>。
ko: 변경 <code>admin</code> <strong>경로</strong> 에서 <code>admin-routing.module.ts</code> 에서 <code>'admin'</code> , 빈 문자열로 <code>''</code> 는 <em>빈 경로를</em> .
ru: Измените <strong>путь </strong> <code>admin</code> в <code>admin-routing.module.ts</code> с <code>'admin'</code> на пустую строку, <code>''</code> , <em>пустой путь</em> .<strong></strong><em></em>

source: Change the <code>crisis-center</code> path in the <code>CrisisCenterRoutingModule</code> to an empty string.
es: Cambie la ruta del <code>crisis-center</code> en <code>CrisisCenterRoutingModule</code> a una cadena vac&iacute;a.
ja: <code>CrisisCenterRoutingModule</code> の <code>crisis-center</code> パスを空の文字列に変更します。
ko: <code>CrisisCenterRoutingModule</code> 의 <code>crisis-center</code> 경로를 빈 문자열로 변경하십시오 .
ru: Измените путь <code>crisis-center</code> в <code>CrisisCenterRoutingModule</code> на пустую строку.

source: Change the <code>selector</code> to <code>app-hero-list</code>.
es: Cambie el <code>selector</code> a <code>app-hero-list</code> .
ja: <code>selector</code> を <code>app-hero-list</code> に変更します。
ko: <code>selector</code> 를 <code>app-hero-list</code> 로 변경하십시오 .
ru: Измените <code>selector</code> на <code>app-hero-list</code> .

source: Change the application title
es: Cambiar el título de la solicitud
ja: アプリケーションのタイトルを変更する
ko: 신청서 제목 변경
ru: Изменить название заявки

source: Change the component class name to <code>HeroListComponent</code>.
es: Cambie el nombre de la clase de componente a <code>HeroListComponent</code> .
ja: コンポーネントクラス名を <code>HeroListComponent</code> に変更します。
ko: 컴포넌트 클래스 이름을 <code>HeroListComponent</code> 로 변경하십시오 .
ru: Измените имя класса компонента на <code>HeroListComponent</code> .

source: Change the history state object when called with one parameter and return <code>$location</code>. The state object is later passed to <code>pushState</code> or <code>replaceState</code>.
es: Cambie el objeto de estado del historial cuando se lo llame con un par&aacute;metro y devuelva <code>$location</code> . El objeto de estado luego se pasa a <code>pushState</code> o <code>replaceState</code> .
ja: 1つのパラメーターで呼び出されたときに履歴状態オブジェクトを変更し、 <code>$location</code> を返します。状態オブジェクトは後で <code>pushState</code> または <code>replaceState</code> に渡されます。
ko: 하나의 매개 변수로 호출 될 때 히스토리 상태 오브젝트를 변경하고 <code>$location</code> 리턴하십시오 . 상태 객체는 나중에 <code>pushState</code> 또는 <code>replaceState</code> 로 전달됩니다 .
ru: Измените объект состояния истории при вызове с одним параметром и верните <code>$location</code> . Позже объект состояния передается в <code>pushState</code> или <code>replaceState</code> .

source: Change the name of the property to something non-numeric.
es: Cambiar el nombre de la propiedad a algo no numérico.
ja: プロパティの名前を数値以外のものに変更します。
ko: 속성 이름을 숫자가 아닌 다른 이름으로 변경하십시오.
ru: Поменяйте название собственности на что-то нецифровое.

source: Change the source language file format
ja: ソース言語のファイル形式を変更する
ko: 소스 언어 파일 형식 변경
ru: Изменение формата файла на исходном языке

source: Change the source language file location
ja: ソース言語ファイルの場所を変更する
ko: 소스 언어 파일 위치 변경
ru: Изменить местоположение файла с исходным языком

source: Change the source language file name
ja: ソース言語ファイル名の変更
ko: 소스 언어 파일 이름 변경
ru: Изменить имя файла на исходном языке

source: Change the text <code>Welcome to {{title}}!</code> to <code>Bienvenue &agrave; {{title}}!</code>.
es: Cambiar el texto &iexcl; <code>Welcome to {{title}}!</code> a <code>Bienvenue &agrave; {{title}}!</code> .
ja: <code>Welcome to {{title}}!</code> というテキストを変更します。 <code>Bienvenue &agrave; {{title}}!</code> 。
ko: 텍스트 변경 <code>Welcome to {{title}}!</code> <code>Bienvenue &agrave; {{title}}!</code> 에 Bienvenue에! .
ru: Изменить текст <code>Welcome to {{title}}!</code> на <code>Bienvenue &agrave; {{title}}!</code> ,

source: Changes and Deprecations in Version 11
ja: バージョン 11 の変更点と非推奨事項
ko: 버전 11의 변경 및 사용 중단
ru: Изменения и сокращения в версии 11

source: Changes can be observed by subscribing to the changes <code>Observable</code>.
es: Los cambios se pueden observar suscribi&eacute;ndose a los cambios <code>Observable</code> .
ja: <code>Observable</code> の変更をサブスクライブすることで、変更を監視できます。
ko: <code>Observable</code> 변경 사항을 구독하면 변경 사항을 확인할 수 있습니다 .
ru: Изменения можно наблюдать, подписавшись на <code>Observable</code> изменения .

source: Changes the browser's URL to a normalized version of a given URL, and pushes a new item onto the platform's history.
es: Cambia la URL del navegador a una versión normalizada de una URL dada,y empuja un nuevo elemento en el historial de la plataforma.
ja: ブラウザのURLを指定されたURLの正規化されたバージョンに変更し、新しいアイテムをプラットフォームの履歴にプッシュします。
ko: 브라우저의 URL을 지정된 URL의 정규화 된 버전으로 변경하고 새 항목을 플랫폼 기록으로 푸시합니다.
ru: Изменяет URL браузера на нормализованную версию заданного URL и выталкивает новый элемент в историю платформы.

source: Changes the browser's URL to a normalized version of the given URL, and replaces the top item on the platform's history stack.
es: Cambia la URL del navegador a una versión normalizada de la URL dada,y reemplaza el elemento superior de la pila de historia de la plataforma.
ja: ブラウザの URL を指定された URL の正規化されたバージョンに変更し、プラットフォームの履歴スタックの最上位項目を置き換えます。
ko: 브라우저의 URL을 지정된 URL의 정규화 된 버전으로 변경하고 플랫폼 히스토리 스택의 최상위 항목을 바꿉니다.
ru: Изменяет URL браузера на нормализованную версию данного URL и заменяет верхний элемент в стеке истории платформы.

source: Changes to <code>$location</code> during the current <code>$digest</code> will replace the current history record, instead of adding a new one.
es: Los cambios en <code>$location</code> durante el <code>$digest</code> actual reemplazar&aacute;n el registro del historial actual, en lugar de agregar uno nuevo.
ja: 現在の <code>$digest</code> 中に <code>$location</code> 変更すると、新しい履歴レコードが追加される代わりに、現在の履歴レコードが置き換えられます。
ko: 현재 <code>$digest</code> 동안 <code>$location</code> 변경 하면 새 기록 레코드를 추가하는 대신 현재 기록 레코드가 바뀝니다 .
ru: Изменения в <code>$location</code> во время текущего <code>$digest</code> заменят текущую историю, вместо добавления новой.

source: Changes to styles elsewhere in the application don't affect the component's styles.
es: Los cambios en los estilos de otras partes de la aplicación no afectan a los estilos del componente.
ja: アプリケーションの他の場所でスタイルを変更しても、コンポーネントのスタイルには影響しません。
ko: 응용 프로그램의 다른 곳에서 스타일을 변경해도 구성 요소의 스타일에는 영향을 미치지 않습니다.
ru: Изменения стилей в других местах применения не влияют на стили компонентов.

source: Changes you may see
ja: あなたが見ることができる変更
ko: 볼 수있는 변경 사항
ru: Изменения,которые вы можете увидеть

source: Changing /heroes to /superheroes
es: Cambiando de /héroes a /superhéroes
ja: ヒーローを/superheroesに変更する
ko: / heroes를 / superheroes로 변경
ru: Замена /героев на/супергероев

source: Changing <code>/heroes</code> to <code>/superheroes</code>
ja: <code>/heroes</code> を <code>/superheroes</code> に変更する
ko: <code>/heroes</code> 를 <code>/superheroes</code> 로 변경
ru: Замена <code>/heroes</code> на <code>/superheroes</code>

source: Changing the observable to be multicasting could look something like this:
es: Cambiar lo observable a ser multidifusión podría parecerse a algo como esto:
ja: 観測可能なものをマルチキャストに変更すると、次のようになります。
ko: Observable을 멀티 캐스팅으로 변경하면 다음과 같이 보일 수 있습니다.
ru: Изменение наблюдаемого на многократную трансляцию может выглядеть примерно так:

source: Changing your app's location
es: Cambiar la ubicación de tu aplicación
ja: アプリの位置情報を変更する
ko: 앱 위치 변경
ru: Изменение местоположения вашего приложения

source: Cheat Sheet
es: Hoja de Trampas
ja: チートシート
ko: 컨닝 지
ru: Шпаргалка

source: Cheat sheet
es: Hoja de trucos...
ja: チートシート
ko: 컨닝 지
ru: Шпаргалка

source: Check all internal dependencies.
es: Comprueba todas las dependencias internas.
ja: すべての内部依存関係をチェックします。
ko: 모든 내부 종속성을 확인하십시오.
ru: Проверьте все внутренние зависимости.

source: Check out <a href="https://github.com/angular-buch/angular-cli-ghpages">angular-cli-ghpages</a>, a full featured package that does all this for you and has extra functionality.
es: Echa un vistazo a <a href="https://github.com/angular-buch/angular-cli-ghpages">angular-cli-ghpages</a> , un paquete con todas las funciones que hace todo esto por ti y tiene una funcionalidad adicional.
ja: <a href="https://github.com/angular-buch/angular-cli-ghpages">angular-cli-ghpagesを</a>チェックしてください。これは、これをすべて行い、追加の機能を備えたフル機能のパッケージです。
ko: <a href="https://github.com/angular-buch/angular-cli-ghpages">angular-cli-ghpages를</a> 확인하십시오 . 모든 기능을 갖춘 패키지로 추가 기능이 있습니다.
ru: Проверьте <a href="https://github.com/angular-buch/angular-cli-ghpages">angular-cli-ghpages</a> , полнофункциональный пакет, который делает все это для вас и имеет дополнительную функциональность.

source: Check out the <a href="glossary">Glossary</a> to understand Angular-specific terms and usage.
ja: <a href="glossary">用語集</a>をチェックして、Angular固有の用語と使用法を理解してください。
ko: Angular 관련 용어 및 사용법을 이해 하려면 <a href="glossary">용어집</a> 을 확인하십시오 .
ru: Ознакомьтесь с <a href="glossary">Глоссарием,</a> чтобы понять термины и способы использования Angular.
