Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/angular/angular.*.006.xlf
Languages: es, ja, ko, ru, zh_cn

source: Consider a <code>setCurrentClasses()</code> component method that sets a component property, <code>currentClasses</code>, with an object that adds or removes three classes based on the <code>true</code>/<code>false</code> state of three other component properties. Each key of the object is a CSS class name; its value is <code>true</code> if the class should be added, <code>false</code> if it should be removed.
es: Considere un m&eacute;todo de componente <code>setCurrentClasses()</code> que establece una propiedad de componente, <code>currentClasses</code> , con un objeto que agrega o elimina tres clases en funci&oacute;n del estado <code>true</code> / <code>false</code> de otras tres propiedades del componente. Cada clave del objeto es un nombre de clase CSS; su valor es <code>true</code> si se debe agregar la clase, <code>false</code> si se debe eliminar.
ja: 他の3つのコンポーネントプロパティの <code>true</code> / <code>false</code> 状態に基づいて3つのクラスを追加または削除するオブジェクトを使用して、コンポーネントプロパティ <code>currentClasses</code> を設定する <code>setCurrentClasses()</code> コンポーネントメソッドについて考えてみます。オブジェクトの各キーはCSSクラス名です。クラスを追加する必要が <code>true</code> 場合はその値はtrue、削除する必要がある場合は <code>false</code> です。
ko: 고려 <code>setCurrentClasses()</code> 성분에있어서 그런 세트 컴포넌트 속성 <code>currentClasses</code> 추가 또는에 기초하여 세 개의 클래스 제거 목적으로, <code>true</code> / <code>false</code> 다른 세 요소의 상태 특성. 객체의 각 키는 CSS 클래스 이름입니다. 클래스를 추가해야하는 경우 해당 값은 <code>true</code> 이고 제거해야하는 경우 <code>false</code> 입니다.
ru: Рассмотрим метод компонента <code>setCurrentClasses()</code> который устанавливает свойство компонента <code>currentClasses</code> с помощью объекта, который добавляет или удаляет три класса на основе состояния <code>true</code> / <code>false</code> трех других свойств компонента. Каждый ключ объекта является именем класса CSS; его значение равно <code>true</code> , если класс должен быть добавлен, и <code>false</code> , если его следует удалить.

source: Consider a Car component that depends on several services. Suppose you configured the root injector (marked as A) with <em>generic</em> providers for <code>CarService</code>, <code>EngineService</code> and <code>TiresService</code>.
es: Considere un componente de autom&oacute;vil que depende de varios servicios. Suponga que configur&oacute; el inyector ra&iacute;z (marcado como A) con proveedores <em>gen&eacute;ricos</em> para <code>CarService</code> , <code>EngineService</code> y <code>TiresService</code> .
ja: いくつかのサービスに依存するCarコンポーネントを考えてみましょう。ルートインジェクター（Aとマークされている）を <code>CarService</code> 、 <code>EngineService</code> 、 <code>TiresService</code> の<em>汎用</em>プロバイダーで構成したとします。
ko: 여러 서비스에 의존하는 Car 구성 요소를 고려하십시오. <code>CarService</code> , <code>EngineService</code> 및 <code>TiresService</code> 의<em>일반</em> 제공자 로 루트 인젝터 (A로 표시)를 구성 했다고 가정하십시오 .
ru: Рассмотрим автомобильный компонент, который зависит от нескольких услуг. Предположим , вы настроили корневой инжектор (маркированную как) с <em>родовыми</em> провайдеров <code>CarService</code> , <code>EngineService</code> и <code>TiresService</code> .

source: Consider a simple app with only an <code>AppComponent</code> and a <code>ChildComponent</code>. The most basic rendered view would look like nested HTML elements such as the following:
es: Considere una aplicaci&oacute;n simple con solo un <code>AppComponent</code> y un <code>ChildComponent</code> . La vista renderizada m&aacute;s b&aacute;sica se ver&iacute;a como elementos HTML anidados como los siguientes:
ja: のみとシンプルなアプリを検討 <code>AppComponent</code> と <code>ChildComponent</code> を。最も基本的なレンダリングビューは、次のようなネストされたHTML要素のようになります。
ko: 유일 간단한 응용 프로그램을 고려 <code>AppComponent</code> 과 <code>ChildComponent</code> 을 . 가장 기본적인 렌더링 뷰는 다음과 같은 중첩 HTML 요소처럼 보입니다.
ru: Рассмотрим простое приложение только с <code>AppComponent</code> и <code>ChildComponent</code> . Самый базовый представленный вид будет выглядеть как вложенные элементы HTML, например:

source: Consider adding component tests such as this one:
es: Considere la posibilidad de añadir pruebas de componentes como ésta:
ja: このようなコンポーネントテストを追加することを検討してください。
ko: 다음과 같은 구성 요소 테스트를 추가하십시오.
ru: Рассмотрим возможность добавления компонентных тестов,подобных этому:

source: Consider an <code>ItemDetailComponent</code> that presents item information and responds to user actions. Although the <code>ItemDetailComponent</code> has a delete button, it doesn't contain the functionality to delete the hero. It can only raise an event reporting the user's delete request.
ja: アイテム情報を提示し、ユーザーアクションに応答する <code>ItemDetailComponent</code> について考えてみます。が <code>ItemDetailComponent</code> は削除ボタンがあり、それがヒーローを削除するための機能が含まれていません。ユーザーの削除リクエストを報告するイベントのみを発生させることができます。
ko: 항목 정보를 제공하고 사용자 작업에 응답 하는 <code>ItemDetailComponent</code> 를 고려하십시오 . <code>ItemDetailComponent</code> 에 삭제 버튼이 있지만 Hero를 삭제하는 기능은 포함되어 있지 않습니다. 사용자의 삭제 요청을보고하는 이벤트 만 발생시킬 수 있습니다.
ru: Рассмотрим <code>ItemDetailComponent</code> , который представляет информацию об элементе и реагирует на действия пользователя. Хотя <code>ItemDetailComponent</code> имеет кнопку удаления, он не содержит функции удаления героя. Он может только вызвать событие, сообщающее о запросе пользователя на удаление.

source: Consider an <code>ItemDetailComponent</code> that presents item information and responds to user actions. Although the <code>ItemDetailComponent</code> has a delete button, it doesn't know how to delete the hero. It can only raise an event reporting the user's delete request.
es: Considere un <code>ItemDetailComponent</code> que presenta informaci&oacute;n del elemento y responde a las acciones del usuario. Aunque el <code>ItemDetailComponent</code> tiene un bot&oacute;n de eliminaci&oacute;n, no sabe c&oacute;mo eliminar al h&eacute;roe. Solo puede generar un evento que informe la solicitud de eliminaci&oacute;n del usuario.
ja: アイテム情報を提示し、ユーザーのアクションに応答する <code>ItemDetailComponent</code> について考えます。が <code>ItemDetailComponent</code> は削除ボタンがあり、それがヒーローを削除する方法を知りません。ユーザーの削除リクエストを報告するイベントのみを発生させることができます。
ko: 항목 정보를 제공하고 사용자 조치에 응답 하는 <code>ItemDetailComponent</code> 를 고려하십시오 . <code>ItemDetailComponent</code> 에는 삭제 버튼이 있지만 영웅을 삭제하는 방법을 모릅니다. 사용자의 삭제 요청을보고하는 이벤트 만 발생시킬 수 있습니다.
ru: Рассмотрим <code>ItemDetailComponent</code> , который представляет информацию об элементе и реагирует на действия пользователя. Хотя <code>ItemDetailComponent</code> имеет кнопку удаления, он не знает, как удалить героя. Он может вызвать только событие, сообщающее о запросе пользователя на удаление.

source: Consider creating a "barrel" file that gathers all the interceptor providers into an <code>httpInterceptorProviders</code> array, starting with this first one, the <code>NoopInterceptor</code>.
es: Considere crear un archivo "barril" que re&uacute;na a todos los proveedores de interceptores en una matriz <code>httpInterceptorProviders</code> , comenzando con este primero, el <code>NoopInterceptor</code> .
ja: 最初の1つである <code>NoopInterceptor</code> から始めて、すべてのインターセプタープロバイダーを <code>httpInterceptorProviders</code> 配列に収集する「バレル」ファイルの作成を検討してください。
ko: 에 집결 모든 인터셉터 제공하는 "통"파일 생성을 고려 <code>httpInterceptorProviders</code> 배열이 첫 번째의 시작으로 <code>NoopInterceptor</code> 을 .
ru: Подумайте о создании &laquo;бочкового&raquo; файла, который собирает всех поставщиков перехватчиков в массив <code>httpInterceptorProviders</code> , начиная с первого, <code>NoopInterceptor</code> .

source: Consider giving each feature module its own route configuration file. It may seem like overkill early when the feature routes are simple. But routes have a tendency to grow more complex and consistency in patterns pays off over time.
es: Considere la posibilidad de dar a cada módulo de características su propio archivo de configuración de ruta.Puede parecer exagerado al principio cuando las rutas de las características son simples.Pero las rutas tienden a ser más complejas y la consistencia de los patrones se paga con el tiempo.
ja: 各機能モジュールに独自のルート設定ファイルを与えることを検討してください。機能モジュールのルートが単純な場合、初期の段階ではやりすぎのように思えるかもしれません。しかし、ルートはより複雑になる傾向があり、パターンの一貫性は時間の経過とともに効果を発揮します。
ko: 각 기능 모듈에 고유 한 경로 구성 파일을 제공하십시오. 피처 라우트가 단순하면 초기에 과도하게 보일 수 있습니다. 그러나 경로는 점점 더 복잡 해지는 경향이 있으며 패턴의 일관성은 시간이 지남에 따라 보상합니다.
ru: Рассмотрим возможность предоставления каждому функциональному модулю собственного файла конфигурации маршрута.Это может показаться излишеством,когда маршруты функции просты.Но маршруты имеют тенденцию к усложнению и последовательность в шаблонах окупается с течением времени.

source: Consider giving each feature module its own route configuration file. Though the feature routes are currently minimal, routes have a tendency to grow more complex even in small apps.
ja: 各機能モジュールに独自のルート設定ファイルを与えることを検討してください。現在、機能のルートは最小限に抑えられていますが、小規模なアプリでもルートは複雑化する傾向にあります。
ko: 각 기능 모듈에 고유 한 경로 구성 파일을 제공하는 것을 고려하십시오. 기능 경로는 현재 최소 수준이지만 작은 앱에서도 경로가 더 복잡 해지는 경향이 있습니다.
ru: Рассмотрим возможность предоставления каждому функциональному модулю собственного файла конфигурации маршрута.Несмотря на то,что маршруты функции в настоящее время минимальны,маршруты имеют тенденцию к усложнению даже в маленьких приложениях.

source: Consider how Angular bootstraps the app with the following in <code>main.ts</code>:
es: Considere c&oacute;mo Angular inicia la aplicaci&oacute;n con lo siguiente en <code>main.ts</code> :
ja: Angularがアプリを <code>main.ts</code> で次のようにブートストラップする方法を検討してください：
ko: <code>main.ts</code> 에서 Angular가 앱을 어떻게 부트 스트랩하는지 생각하십시오 .
ru: Рассмотрим, как Angular загружает приложение со следующим в <code>main.ts</code> :

source: Consider how you provide services to client applications.
ja: クライアントアプリケーションにどのようにサービスを提供しているかを考えてみましょう。
ko: 클라이언트 애플리케이션에 서비스를 제공하는 방법을 고려하십시오.
ru: Рассмотрим,как вы предоставляете услуги клиентским приложениям.

source: Consider placing such helpers in a <code>testing</code> folder sibling to the <code>app</code> folder. This sample puts <code>ActivatedRouteStub</code> in <code>testing/activated-route-stub.ts</code>.
es: Considere colocar tales ayudantes en una carpeta de <code>testing</code> similar a la carpeta de la <code>app</code> . Este ejemplo pone <code>ActivatedRouteStub</code> en <code>testing/activated-route-stub.ts</code> .
ja: そのようなヘルパーを <code>app</code> フォルダーの兄弟の <code>testing</code> フォルダーに配置することを検討してください。このサンプルは、 <code>ActivatedRouteStub</code> を <code>testing/activated-route-stub.ts</code> ます。
ko: 이러한 도우미를 <code>app</code> 폴더 의 <code>testing</code> 폴더 형제 에 배치 하는 것이 좋습니다. 이 샘플은 <code>ActivatedRouteStub</code> 을 <code>testing/activated-route-stub.ts</code> 에 넣습니다 .
ru: Подумайте о том, чтобы поместить таких помощников в папку <code>testing</code> которая находится в папке <code>app</code> . Этот образец помещает <code>ActivatedRouteStub</code> в <code>testing/activated-route-stub.ts</code> .

source: Consider the <a href="https://developer.mozilla.org/en-US/docs/Web/Accessibility/ARIA">ARIA</a> and <a href="https://developer.mozilla.org/en-US/docs/Web/SVG">SVG</a>. They are purely attributes, don't correspond to element properties, and don't set element properties. In these cases, there are no property targets to bind to.
es: Considere el <a href="https://developer.mozilla.org/en-US/docs/Web/Accessibility/ARIA">ARIA</a> y <a href="https://developer.mozilla.org/en-US/docs/Web/SVG">SVG</a> . Son puramente atributos, no corresponden a las propiedades del elemento y no establecen las propiedades del elemento. En estos casos, no hay objetivos de propiedad a los que vincularse.
ja: <a href="https://developer.mozilla.org/en-US/docs/Web/Accessibility/ARIA">ARIA</a>と<a href="https://developer.mozilla.org/en-US/docs/Web/SVG">SVGを</a>検討してください。これらは純粋に属性であり、要素のプロパティに対応せず、要素のプロパティを設定しません。これらの場合、バインドするプロパティターゲットはありません。
ko: <a href="https://developer.mozilla.org/en-US/docs/Web/Accessibility/ARIA">ARIA</a> 와 <a href="https://developer.mozilla.org/en-US/docs/Web/SVG">SVG를</a> 고려하십시오 . 그것들은 순전히 속성이며 요소 속성에 해당하지 않으며 요소 속성을 설정하지 않습니다. 이 경우 바인딩 할 속성 대상이 없습니다.
ru: Рассмотрим <a href="https://developer.mozilla.org/en-US/docs/Web/Accessibility/ARIA">ARIA</a> и <a href="https://developer.mozilla.org/en-US/docs/Web/SVG">SVG</a> . Они являются чисто атрибутами, не соответствуют свойствам элемента и не устанавливают свойства элемента. В этих случаях нет целевых объектов свойств для привязки.

source: Consider the <code>forbiddenNameValidator</code> function from previous <a href="form-validation#reactive-component-class">examples</a> in this guide. Here's what the definition of that function looks like:
es: Considere la funci&oacute;n <code>forbiddenNameValidator</code> de <a href="form-validation#reactive-component-class">ejemplos</a> anteriores en esta gu&iacute;a. As&iacute; es como se ve la definici&oacute;n de esa funci&oacute;n:
ja: このガイドの前の<a href="form-validation#reactive-component-class">例の</a> <code>forbiddenNameValidator</code> 関数を検討してください。その関数の定義は次のようになります。
ko: 이 안내서의 이전 <a href="form-validation#reactive-component-class">예제</a> 에서 <code>forbiddenNameValidator</code> 함수를 고려하십시오 . 해당 함수의 정의는 다음과 같습니다.
ru: Рассмотрим функцию <code>forbiddenNameValidator</code> из предыдущих <a href="form-validation#reactive-component-class">примеров</a> в этом руководстве. Вот как выглядит определение этой функции:

source: Consider the <code>forbiddenNameValidator</code> function from previous <a href="form-validation#reactive-component-class">reactive-form examples</a>. Here's what the definition of that function looks like.
ja: 以前の<a href="form-validation#reactive-component-class">リアクティブフォームの例</a>の <code>forbiddenNameValidator</code> 関数について考えてみます。その関数の定義は次のようになります。
ko: 이전 <a href="form-validation#reactive-component-class">반응 양식 예제</a> 의 <code>forbiddenNameValidator</code> 함수를 고려하십시오 . 그 함수의 정의는 다음과 같습니다.
ru: Рассмотрим функцию <code>forbiddenNameValidator</code> из предыдущих <a href="form-validation#reactive-component-class">примеров реактивной формы</a> . Вот как выглядит определение этой функции.

source: Consider the first parameter:
es: Considere el primer parámetro:
ja: 最初のパラメータを考えてみましょう。
ko: 첫 번째 매개 변수를 고려하십시오.
ru: Рассмотрим первый параметр:

source: Consider the following <code>LoggingInterceptor</code>, which captures the time of the request, the time of the response, and logs the outcome with the elapsed time with the injected <code>MessageService</code>.
es: Considere el siguiente <code>LoggingInterceptor</code> , que captura el tiempo de la solicitud, el tiempo de la respuesta y registra el resultado con el tiempo transcurrido con el <code>MessageService</code> inyectado .
ja: 次の <code>LoggingInterceptor</code> について考えてみましょう。LoggingInterceptorは、リクエストの時間とレスポンスの時間をキャプチャし、注入された <code>MessageService</code> で経過時間を記録します。
ko: 요청 시간, 응답 시간을 캡처하고 주입 된 <code>MessageService</code> 를 사용하여 경과 시간으로 결과를 기록 하는 다음 <code>LoggingInterceptor</code> 를 고려하십시오 .
ru: Рассмотрим следующий <code>LoggingInterceptor</code> , который фиксирует время запроса, время ответа и регистрирует результат с <code>MessageService</code> временем с введенной службой MessageService .

source: Consider the following component decorator:
es: Considere el siguiente componente decorador:
ja: 以下のコンポーネントデコレータを考えてみましょう。
ko: 다음 컴포넌트 데코레이터를 고려하십시오.
ru: Рассмотрим следующий компонент декоратора:

source: Consider the following component definition:
es: Considere la siguiente definición de componentes:
ja: 以下のコンポーネント定義を考えてみましょう。
ko: 다음 구성 요소 정의를 고려하십시오.
ru: Рассмотрим следующее определение компонента:

source: Consider the following directive:
ja: 次のような指令を考えてみてください。
ko: 다음 지시문을 고려하십시오.
ru: Рассмотрим следующую директиву:

source: Consider the following example that uses <code>*<a href="../api/common/ngforof">ngFor</a></code>.
ja: <code>*<a href="../api/common/ngforof">ngFor</a></code> を使用する次の例について考えてみます。
ko: <code>*<a href="../api/common/ngforof">ngFor</a></code> 를 사용하는 다음 예제를 고려하십시오 .
ru: Рассмотрим следующий пример, в котором используется <code>*<a href="../api/common/ngforof">ngFor</a></code> .

source: Consider the following example:
es: Considere el siguiente ejemplo:
ja: 次のような例を考えてみてください。
ko: 다음 예제를 고려하십시오.
ru: Рассмотрим следующий пример:

source: Consider the following hierarchy:
ja: 次のような階層を考えてみましょう。
ko: 다음 계층을 고려하십시오.
ru: Рассмотрим следующую иерархию:

source: Consider the following module from an imaginary app:
es: Considere el siguiente módulo de una aplicación imaginaria:
ja: 架空のアプリから次のモジュールを考えてみましょう。
ko: 가상의 앱에서 다음 모듈을 고려하십시오.
ru: Рассмотрим следующий модуль из воображаемого приложения:

source: Consider the following route configuration: <code>[{ path: 'user/:name', component: UserCmp }]</code>. When linking to this <code>user/:name</code> route, you use the <code><a href="routerlink">RouterLink</a></code> directive.
es: Considere la siguiente configuraci&oacute;n de ruta: <code>[{ path: 'user/:name', component: UserCmp }]</code> . Cuando se vincula a esta ruta de <code>user/:name</code> , utiliza la directiva <code><a href="routerlink">RouterLink</a></code> .
ja: 次のルート構成を検討してください： <code>[{ path: 'user/:name', component: UserCmp }]</code> 。この <code>user/:name</code> ルートにリンクするときは、 <code><a href="routerlink">RouterLink</a></code> ディレクティブを使用します。
ko: 다음 경로 구성을 고려하십시오. <code>[{ path: 'user/:name', component: UserCmp }]</code> . 이 <code>user/:name</code> 라우트에 링크 할 때 <code><a href="routerlink">RouterLink</a></code> 지시문 을 사용하십시오 .
ru: Рассмотрим следующую конфигурацию маршрута: <code>[{ path: 'user/:name', component: UserCmp }]</code> . При ссылке на этот маршрут <code>user/:name</code> вы используете директиву <code><a href="routerlink">RouterLink</a></code> .

source: Consider the following router link that navigates from the root of the application down to the Dragon Crisis:
ja: アプリケーションのルートからドラゴンクライシスまでをナビゲートする以下のルーターリンクを考えてみましょう。
ko: 애플리케이션의 루트에서 Dragon Crisis로 이동하는 다음 라우터 링크를 고려하십시오.
ru: Рассмотрим следующую ссылку маршрутизатора,которая переходит от корня приложения к кризису дракона:

source: Consider the following template, which lets a user enter a search term to find an npm package by name. When the user enters a name in a search-box, the <code>PackageSearchComponent</code> sends a search request for a package with that name to the npm web API.
ja: 次のテンプレートについて考えてみます。このテンプレートでは、ユーザーが検索語を入力して、名前でnpmパッケージを見つけることができます。ユーザーが検索ボックスに名前を入力すると、 <code>PackageSearchComponent</code> はその名前のパッケージの検索要求をnpm WebAPIに送信します。
ko: 사용자가 검색 용어를 입력하여 이름으로 npm 패키지를 찾을 수있는 다음 템플릿을 고려하십시오. 사용자가 검색 상자에 이름을 입력하면 <code>PackageSearchComponent</code> 는 해당 이름의 패키지에 대한 검색 요청을 npm 웹 API로 보냅니다.
ru: Рассмотрим следующий шаблон, который позволяет пользователю ввести поисковый запрос, чтобы найти пакет npm по имени. Когда пользователь вводит имя в поле поиска, <code>PackageSearchComponent</code> отправляет поисковый запрос пакета с таким именем в веб-API npm.

source: Consider the following template:
es: Considere la siguiente plantilla:
ja: 以下のようなテンプレートを考えてみてください。
ko: 다음 템플릿을 고려하십시오.
ru: Рассмотрим следующий шаблон:

source: Consider the next example, with a <code>nullItem</code>.
es: Considere el siguiente ejemplo, con un <code>nullItem</code> .
ja: <code>nullItem</code> を使用した次の例を考えてみます。
ko: <code>nullItem</code> 과 함께 다음 예제를 고려하십시오 .
ru: Рассмотрим следующий пример с <code>nullItem</code> .

source: Consider this <code>LightswitchComponent</code> which toggles a light on and off (represented by an on-screen message) when the user clicks the button.
es: Considere este <code>LightswitchComponent</code> que enciende y apaga una luz (representada por un mensaje en pantalla) cuando el usuario hace clic en el bot&oacute;n.
ja: ユーザーがボタンをクリックしたときにライトをオン/オフ（画面上のメッセージで表される）に切り替えるこの <code>LightswitchComponent</code> について考えてみます。
ko: 사용자가 버튼을 클릭 할 때 조명을 켜거나 끄는 (화면 메시지로 표시) 이 <code>LightswitchComponent</code> 를 고려하십시오 .
ru: Рассмотрим этот <code>LightswitchComponent</code> , который включает и выключает свет (представленный на экране сообщением), когда пользователь нажимает кнопку.

source: Consider this example of a child/parent relationship:
es: Considere este ejemplo de una relación niño/padre:
ja: この親子関係の例を考えてみましょう。
ko: 자녀 / 부모 관계에 대한 다음 예를 고려하십시오.
ru: Рассмотрим этот пример отношений между ребенком и родителем:

source: Consider this example:
es: Considere este ejemplo:
ja: この例を考えてみましょう。
ko: 이 예제를 고려하십시오.
ru: Рассмотрим этот пример:

source: Consider this translation to French:
es: Considere esta traducción al francés:
ja: このフランス語への翻訳を考えてみましょう。
ko: 프랑스어로이 번역을 고려하십시오 :
ru: Рассмотрим этот перевод на французский:

source: Consider this variation on the <a href="lifecycle-hooks#afterview">previous <em>AfterView</em></a> example. This time, instead of including the child view within the template, it imports the content from the <code>AfterContentComponent</code>'s parent. Here's the parent's template:
es: Considere esta variaci&oacute;n en el ejemplo <a href="lifecycle-hooks#afterview">anterior de <em>AfterView</em></a> . Esta vez, en lugar de incluir la vista secundaria dentro de la plantilla, importa el contenido del elemento <code>AfterContentComponent</code> de AfterContentComponent . Aqu&iacute; est&aacute; la plantilla de los padres:
ja: <a href="lifecycle-hooks#afterview">前の<em>AfterViewの</em></a>例のこのバリエーションを検討してください。今回は、テンプレートに子ビューを含める代わりに、 <code>AfterContentComponent</code> の親からコンテンツをインポートします。親のテンプレートは次のとおりです。
ko: <a href="lifecycle-hooks#afterview">이전 <em>AfterView</em></a> 예제 에서이 변형을 고려하십시오 . 이번에는 템플릿 내에 자식 뷰를 포함시키는 대신 <code>AfterContentComponent</code> 의 부모 에서 컨텐트를 가져옵니다 . 부모의 템플릿은 다음과 같습니다.
ru: Рассмотрим этот вариант в <a href="lifecycle-hooks#afterview">предыдущем<em></em></a> примере <em>AfterView</em> . На этот раз вместо включения дочернего представления в шаблон он импортирует содержимое из родительского <code>AfterContentComponent</code> . Вот шаблон родителя:

source: Consider this variation on the <a href="lifecycle-hooks#afterview">previous <em>AfterView</em></a> example. This time, instead of including the child view within the template, it imports the content from the <code>AfterContentComponent</code>'s parent. The following is the parent's template.
ja: <a href="lifecycle-hooks#afterview">前の<em>AfterViewの</em></a>例でこのバリエーションを検討してください。今回は、テンプレート内に子ビューを含める代わりに、 <code>AfterContentComponent</code> の親からコンテンツをインポートします。以下は、親のテンプレートです。
ko: <a href="lifecycle-hooks#afterview">이전 <em>AfterView</em></a> 예제 에서이 변형을 고려하십시오 . 이번에는 템플릿 내에 자식 뷰를 포함하는 대신 <code>AfterContentComponent</code> 의 부모 에서 콘텐츠를 가져옵니다 . 다음은 부모의 템플릿입니다.
ru: Рассмотрим этот вариант в <a href="lifecycle-hooks#afterview">предыдущем<em></em></a> примере <em>AfterView</em> . На этот раз вместо включения дочернего представления в шаблон он импортирует содержимое из родительского <code>AfterContentComponent</code> . Ниже приведен родительский шаблон.

source: Consider writing a more capable version of this stub class with the <a href="testing#marble-testing"><em>marble testing library</em></a>.
es: Considere escribir una versi&oacute;n m&aacute;s capaz de esta clase de c&oacute;digo auxiliar con la <a href="testing#marble-testing"><em>biblioteca de pruebas de m&aacute;rmol</em></a> .
ja: <a href="testing#marble-testing"><em>大理石のテストライブラリを使用</em></a>して、このスタブクラスのより機能的なバージョンを作成することを検討してください。
ko: <a href="testing#marble-testing"><em>대리석 테스트 라이브러리를</em></a> 사용하여이 스텁 클래스의 더 유능한 버전을 작성해보십시오 .
ru: Подумайте над тем, чтобы написать более функциональную версию этого класса заглушки с <a href="testing#marble-testing"><em>библиотекой тестирования мрамора</em></a> .

source: Consider writing a more capable version of this stub class with the <a href="testing-components-scenarios#marble-testing"><em>marble testing library</em></a>.
ja: <a href="testing-components-scenarios#marble-testing"><em>大理石のテストライブラリを使用</em></a>して、このスタブクラスのより高性能なバージョンを作成することを検討してください。
ko: <a href="testing-components-scenarios#marble-testing"><em>marble 테스트 라이브러리를</em></a> 사용하여이 스텁 클래스의 더 유능한 버전을 작성하는 것을 고려하십시오 .
ru: Подумайте о написании более функциональной версии этого класса-заглушки с <a href="testing-components-scenarios#marble-testing"><em>библиотекой тестирования мрамора</em></a> .
