Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/angular/angular.*.006.xlf
Languages: es, ja, ko, ru, zh_cn

source: By default, an Angular app always has at least one entry component, the root component, <code>AppComponent</code>. Its purpose is to serve as a point of entry into the app, that is, you bootstrap it to launch the app.
es: Por defecto, una aplicaci&oacute;n angular siempre tiene al menos un componente de entrada, el componente ra&iacute;z, <code>AppComponent</code> . Su prop&oacute;sito es servir como punto de entrada a la aplicaci&oacute;n, es decir, arrancarlo para iniciar la aplicaci&oacute;n.
ja: デフォルトでは、Angularアプリには常に少なくとも1つのエントリコンポーネント、ルートコンポーネント、 <code>AppComponent</code> があります。その目的は、アプリへのエントリポイントとして機能することです。つまり、アプリを起動するためにアプリをブートストラップします。
ko: 기본적으로 Angular 앱에는 항상 하나 이상의 입력 구성 요소 인 루트 구성 요소 인 <code>AppComponent</code> 가 있습니다. 이 앱의 목적은 앱 시작 지점으로 사용되는 것입니다. 즉, 앱을 시작하기 위해 앱을 부트 스트랩합니다.
ru: По умолчанию приложение Angular всегда имеет хотя бы один компонент ввода, корневой компонент <code>AppComponent</code> . Его цель - служить точкой входа в приложение, то есть вы загружаете его для запуска приложения.

source: By default, an interceptor sends this header on all mutating requests (such as POST) to relative URLs, but not on GET/HEAD requests or on requests with an absolute URL.
es: Por defecto,un interceptor envía este encabezado en todas las solicitudes mutantes (como POST)a URLs relativas,pero no en las solicitudes GET/HEAD o en las solicitudes con un URL absoluto.
ja: デフォルトでは、インターセプターは、相対 URL に対するすべてのミューティングリクエスト (POST など)に対してこのヘッダを送信しますが、GET/HEAD リクエストや絶対 URL を持つリクエストに対しては送信しません。
ko: 인터셉터는 기본적으로 모든 변경 요청 (예 : POST)에서이 URL을 상대 URL로 보내지 만 GET / HEAD 요청이나 절대 URL이있는 요청에서는 보내지 않습니다.
ru: По умолчанию,перехватчик посылает этот заголовок на все мутирующие запросы (такие как POST)на относительные URL,но не на GET/HEAD запросы или на запросы с абсолютным URL.

source: By default, if the control has children, all children are enabled.
es: Por defecto,si el control tiene hijos,todos los hijos están habilitados.
ja: デフォルトでは、コントロールに子がある場合、すべての子が有効になります。
ko: 기본적으로 컨트롤에 자식이 있으면 모든 자식이 활성화됩니다.
ru: По умолчанию,если у элемента управления есть дети,все дети включены.

source: By default, it also updates the value and validity of its ancestors.
es: Por defecto,también actualiza el valor y la validez de sus ancestros.
ja: デフォルトでは、その先祖の値と有効性も更新されます。
ko: 기본적으로 조상의 가치와 유효성도 업데이트합니다.
ru: По умолчанию он также обновляет значение и достоверность своих предков.

source: By default, legacy browsers such as IE 9-11 are ignored, and the compilation target is ES2015. As a result, this produces two builds, and differential loading is enabled. If you ignore browsers without ES2015 support, a single build is produced. To see the build result for differential loading based on different configurations, refer to the table below.
es: Por defecto,los navegadores heredados como el IE 9-11 son ignorados,y el objetivo de la compilación es ES2015.Como resultado,esto produce dos compilaciones,y se habilita la carga diferencial.Si ignoras los navegadores sin soporte para ES2015,se produce una sola compilación.Para ver el resultado de la compilación para la carga diferencial basada en diferentes configuraciones,consulte la siguiente tabla.
ja: デフォルトでは、IE 9-11などのレガシーブラウザは無視され、コンパイル対象はES2015となっています。その結果、2つのビルドが生成され、差分読み込みが有効になります。ES2015 をサポートしていないブラウザを無視すると、1 つのビルドが生成されます。異なる構成に基づく差分読み込みのビルド結果を確認するには、以下の表を参照してください。
ko: 기본적으로 IE 9-11과 같은 레거시 브라우저는 무시되며 컴파일 대상은 ES2015입니다. 결과적으로 두 가지 빌드가 생성되고 차등 로딩이 활성화됩니다. ES2015 지원이없는 브라우저를 무시하면 단일 빌드가 생성됩니다. 다른 구성에 따른 차등 로딩의 빌드 결과를 보려면 아래 표를 참조하십시오.
ru: По умолчанию старые браузеры,такие как IE 9-11,игнорируются,а целью компиляции является ES2015.В результате получается две сборки,и включается дифференциальная загрузка.Если игнорировать браузеры без поддержки ES2015,то получается одна сборка.Результат сборки для дифференциальной загрузки на основе различных конфигураций можно посмотреть в таблице ниже.

source: By default, pipes are defined as <em>pure</em> so that Angular executes the pipe only when it detects a <em>pure change</em> to the input value. A pure change is either a change to a primitive input value (such as <code>String</code>, <code>Number</code>, <code>Boolean</code>, or <code>Symbol</code>), or a changed object reference (such as <code>Date</code>, <code>Array</code>, <code>Function</code>, or <code>Object</code>).
ja: デフォルトでは、パイプは<em>純粋</em>として定義されているため、Angularは入力値の<em>純粋な変更</em>を検出した場合にのみパイプを実行します。純粋な変更とは、プリミティブ入力値（ <code>String</code> 、 <code>Number</code> 、 <code>Boolean</code> 、 <code>Symbol</code> など）または変更されたオブジェクト参照（ <code>Date</code> 、 <code>Array</code> 、 <code>Function</code> 、 <code>Object</code> など）の変更です。
ko: 기본적으로 파이프는 <em>순수</em> 로 정의되어 Angular 는 입력 값 의 <em>순수 변경</em> 을 감지 할 때만 파이프를 실행합니다 . 순수한 변경은 기본 입력 값 (예 : <code>String</code> , <code>Number</code> , <code>Boolean</code> , <code>Symbol</code> ) 또는 변경된 객체 참조 (예 : <code>Date</code> , <code>Array</code> , <code>Function</code> , <code>Object</code> )의 변경입니다.
ru: По умолчанию каналы определены как <em>чистые,</em> поэтому Angular выполняет канал только тогда, когда обнаруживает <em>чистое изменение</em> входного значения. Чистое изменение - это либо изменение примитивного входного значения (такого как <code>String</code> , <code>Number</code> , <code>Boolean</code> или <code>Symbol</code> ), либо измененная ссылка на объект (например, <code>Date</code> , <code>Array</code> , <code>Function</code> или <code>Object</code> ).

source: By default, the <code>spawn()</code> method outputs everything to the process standard output and error. To make it easier to test and debug, we can forward the output to the CLI Builder logger instead. This also allows the builder itself to be executed in a separate process, even if the standard output and error are deactivated (as in an <a href="https://electronjs.org/">Electron app</a>).
es: Por defecto, el m&eacute;todo <code>spawn()</code> env&iacute;a todo a la salida est&aacute;ndar de proceso y error. Para facilitar la prueba y la depuraci&oacute;n, podemos reenviar la salida al registrador de CLI Builder. Esto tambi&eacute;n permite que el propio constructor se ejecute en un proceso separado, incluso si la salida est&aacute;ndar y el error est&aacute;n desactivados (como en una <a href="https://electronjs.org/">aplicaci&oacute;n Electron</a> ).
ja: デフォルトでは、 <code>spawn()</code> メソッドはすべてをプロセスの標準出力とエラーに出力します。テストとデバッグを簡単にするために、代わりに出力をCLIビルダーロガーに転送できます。これにより、標準出力とエラーが無効化されている場合でも（<a href="https://electronjs.org/">Electronアプリの場合など</a>）、ビルダー自体を別のプロセスで実行することもできます。
ko: 기본적으로 <code>spawn()</code> 메소드는 모든 것을 프로세스 표준 출력 및 오류로 출력합니다. 테스트 및 디버깅을보다 쉽게하기 위해 출력을 CLI Builder 로거로 전달할 수 있습니다. 이를 통해 표준 출력 및 오류가 비활성화 된 경우에도 ( <a href="https://electronjs.org/">Electron app</a> 에서와 같이) 빌더 자체가 별도의 프로세스에서 실행될 수 있습니다 .
ru: По умолчанию метод <code>spawn()</code> выводит все на стандартный вывод процесса и выдает ошибку. Чтобы упростить тестирование и отладку, мы можем вместо этого перенаправить вывод в регистратор CLI Builder. Это также позволяет самому сборщику выполняться в отдельном процессе, даже если стандартный вывод и ошибка деактивированы (как в <a href="https://electronjs.org/">приложении Electron</a> ).

source: By default, the <code>xi18n</code> command generates a translation file named <code>messages.xlf</code> in the <a href="https://en.wikipedia.org/wiki/XLIFF">XML Localization Interchange File Format (XLIFF, version 1.2)</a>.
es: De manera predeterminada, el comando <code>xi18n</code> genera un archivo de traducci&oacute;n llamado <code>messages.xlf</code> en el <a href="https://en.wikipedia.org/wiki/XLIFF">formato de archivo de intercambio de localizaci&oacute;n XML (XLIFF, versi&oacute;n 1.2)</a> .
ja: デフォルトでは、 <code>xi18n</code> のコマンドは、名前の翻訳ファイルを生成 <code>messages.xlf</code> で<a href="https://en.wikipedia.org/wiki/XLIFF">XMLローカリゼーション交換ファイル形式（XLIFF、バージョン1.2） </a>。
ko: 기본적으로 <code>xi18n</code> 명령라는 이름의 번역 파일 생성 <code>messages.xlf</code> 을 에 <a href="https://en.wikipedia.org/wiki/XLIFF">XML 현지화 교환 파일 형식 (XLIFF, 버전 1.2)</a> .
ru: По умолчанию команда <code>xi18n</code> создает файл перевода с именем <code>messages.xlf</code> в <a href="https://en.wikipedia.org/wiki/XLIFF">формате файла обмена локализацией XML (XLIFF, версия 1.2)</a> .

source: By default, the AOT compiler removes whitespace characters as follows:
es: Por defecto,el compilador AOT elimina los caracteres de los espacios en blanco de la siguiente manera:
ja: デフォルトでは、AOT コンパイラは以下のように空白文字を削除します。
ko: 기본적으로 AOT 컴파일러는 다음과 같이 공백 문자를 제거합니다.
ru: По умолчанию компилятор AOT удаляет символы пробела следующим образом:

source: By default, the Angular CLI command <a href="cli/generate"><code>ng generate component</code></a> generates components with a template file. You can override that with:
es: Por defecto, el comando Angular CLI <a href="cli/generate"> <code>ng generate component</code> </a> genera componentes con un archivo de plantilla. Puede anular eso con:
ja: デフォルトでは、Angular CLIコマンド<a href="cli/generate"> <code>ng generate component</code> </a>はテンプレートファイルを使用してコンポーネントを生成します。あなたはそれでそれを上書きすることができます：
ko: 기본적으로 Angular CLI 명령 <a href="cli/generate"> <code>ng generate component</code> </a> 는 템플릿 파일을 사용하여 컴포넌트를 생성합니다. 다음을 사용하여이를 무시할 수 있습니다.
ru: По умолчанию команда Angular CLI <a href="cli/generate"> <code>ng generate component</code> </a> создает компоненты с файлом шаблона. Вы можете изменить это с помощью:

source: By default, the Angular CLI command <a href="cli/generate"><code>ng generate service</code></a> registers a provider with the root injector for your service by including provider metadata in the <code>@<a href="../api/core/injectable">Injectable</a>()</code> decorator. The tutorial uses this method to register the provider of HeroService class definition.
es: Por defecto, el comando Angular CLI <a href="cli/generate"> <code>ng generate service</code> </a> registra un proveedor con el inyector ra&iacute;z para su servicio al incluir los metadatos del proveedor en el decorador <code>@<a href="../api/core/injectable">Injectable</a>()</code> . El tutorial utiliza este m&eacute;todo para registrar el proveedor de la definici&oacute;n de clase HeroService.
ja: デフォルトでは、Angular CLIコマンド<a href="cli/generate"> <code>ng generate service</code> </a>は、プロバイダーのメタデータを <code>@<a href="../api/core/injectable">Injectable</a>()</code> デコレーターに含めることにより、プロバイダーをサービスのルートインジェクターに登録します。チュートリアルでは、このメソッドを使用して、HeroServiceクラス定義のプロバイダーを登録します。
ko: 기본적으로 Angular CLI 명령 <a href="cli/generate"> <code>ng generate service</code> </a> 는 <code>@<a href="../api/core/injectable">Injectable</a>()</code> 데코레이터 에 공급자 메타 데이터를 포함시켜 서비스의 루트 인젝터에 공급자를 등록합니다 . 튜토리얼에서는이 메소드를 사용하여 HeroService 클래스 정의 제공자를 등록합니다.
ru: По умолчанию команда Angular CLI <a href="cli/generate"> <code>ng generate service</code> </a> регистрирует поставщика с корневым инжектором для вашей службы, включая метаданные поставщика в декораторе <code>@<a href="../api/core/injectable">Injectable</a>()</code> . Учебное пособие использует этот метод для регистрации поставщика определения класса HeroService.

source: By default, the Angular CLI command <code>ng generate service</code> registers a provider with the <em>root injector</em> for your service by including provider metadata, that is <code><a href="../api/core/injectable#providedIn">providedIn</a>: 'root'</code> in the <code>@<a href="../api/core/injectable">Injectable</a>()</code> decorator.
es: Por defecto, el comando Angular CLI <code>ng generate service</code> registra un proveedor con el <em>inyector ra&iacute;z</em> para su servicio al incluir metadatos del proveedor, que se <code><a href="../api/core/injectable#providedIn">providedIn</a>: 'root'</code> en el decorador <code>@<a href="../api/core/injectable">Injectable</a>()</code> .
ja: デフォルトでは、角度CLIコマンドは <code>ng generate service</code> とプロバイダ登録<em>ルートインジェクタ</em>であるプロバイダのメタデータを含むことにより、あなたのサービスのための <code><a href="../api/core/injectable#providedIn">providedIn</a>: 'root'</code> 中 <code>@<a href="../api/core/injectable">Injectable</a>()</code> デコレータを。
ko: 기본적으로 Angular CLI 명령 <code>ng generate service</code> 는 제공자 메타 데이터 <code>@<a href="../api/core/injectable">Injectable</a>()</code> @ <a href="../api/core/injectable">Injectable</a> () 데코레이터 에서 <code><a href="../api/core/injectable#providedIn">providedIn</a>: 'root'</code> : 'root') 를 포함하여 서비스에 대한 <em>루트 인젝터</em> 에 제공자를 등록합니다 .
ru: По умолчанию команда Angular CLI <code>ng generate service</code> регистрирует провайдера с <em>корневым инжектором</em> для вашей службы, включая метаданные провайдера, которые <code><a href="../api/core/injectable#providedIn">providedIn</a>: 'root'</code> в декораторе <code>@<a href="../api/core/injectable">Injectable</a>()</code> .

source: By default, the Angular CLI command <code>ng generate service</code> registers a provider with the <em>root injector</em> for your service by including provider metadata, that is <code>providedIn: 'root'</code> in the <code>@<a href="../api/core/injectable">Injectable</a>()</code> decorator.
ja: デフォルトでは、AngularCLIコマンド <code>ng generate service</code> serviceは、プロバイダーメタデータを含めることにより、プロバイダーをサービスの<em>ルートインジェクターに</em>登録します。プロバイダーメタデータは、 <code>@<a href="../api/core/injectable">Injectable</a>()</code> <a href="../api/core/injectable">Injectable</a>（）デコレーターの <code>providedIn: 'root'</code> で提供されます。
ko: 기본적으로 Angular CLI 명령 <code>ng generate service</code> 는 공급자 메타 데이터를 <code>@<a href="../api/core/injectable">Injectable</a>()</code> <a href="../api/core/injectable">Injectable</a> () 데코레이터 에 <code>providedIn: 'root'</code> 로 포함하여 서비스 의 <em>루트 인젝터</em> 에 공급자를 등록합니다 .
ru: По умолчанию команда Angular CLI <code>ng generate service</code> регистрирует поставщика с <em>корневым инжектором</em> для вашей службы, включая метаданные поставщика, которые <code>providedIn: 'root'</code> в декораторе <code>@<a href="../api/core/injectable">Injectable</a>()</code> .

source: By default, the CLI command <code>ng new my-app</code> creates a workspace folder named "my-app" and generates a new application skeleton in a <code>src/</code> folder at the top level of the workspace. A newly generated application contains source files for a root module, with a root component and template.
es: De manera predeterminada, el comando CLI <code>ng new my-app</code> crea una carpeta de espacio de trabajo llamada "my-app" y genera un nuevo esqueleto de aplicaci&oacute;n en una carpeta <code>src/</code> en el nivel superior del espacio de trabajo. Una aplicaci&oacute;n reci&eacute;n generada contiene archivos fuente para un m&oacute;dulo ra&iacute;z, con un componente ra&iacute;z y una plantilla.
ja: デフォルトでは、CLIコマンド <code>ng new my-app</code> は「my-app」という名前のワークスペースフォルダーを作成し、ワークスペースの最上位レベルの <code>src/</code> フォルダーに新しいアプリケーションスケルトンを生成します。新しく生成されたアプリケーションには、ルートコンポーネントとテンプレートを含む、ルートモジュールのソースファイルが含まれています。
ko: 기본적으로 CLI 명령 <code>ng new my-app</code> 는 "my-app"라는 작업 공간 폴더를 작성하고 작업 공간 의 최상위 레벨 에있는 <code>src/</code> 폴더에 새로운 애플리케이션 스켈레톤을 생성합니다 . 새로 생성 된 응용 프로그램에는 루트 구성 요소 및 템플릿과 함께 루트 모듈의 소스 파일이 포함됩니다.
ru: По умолчанию команда CLI <code>ng new my-app</code> создает папку рабочей области с именем &laquo;my-app&raquo; и создает новый скелет приложения в папке <code>src/</code> на верхнем уровне рабочей области. Вновь созданное приложение содержит исходные файлы для корневого модуля, с корневым компонентом и шаблоном.

source: By default, the change detector assumes that the object instance identifies the node in the iterable. When this function is supplied, the directive uses the result of calling this function to identify the item node, rather than the identity of the object itself.
es: Por defecto,el detector de cambios asume que la instancia del objeto identifica el nodo en el iterable.Cuando se suministra esta función,la directiva usa el resultado de la llamada a esta función para identificar el nodo del objeto,en lugar de la identidad del propio objeto.
ja: デフォルトでは、変更検出器は、オブジェクトのインスタンスがイテレート可能なノードを識別することを前提としています。この関数が与えられると、この関数を呼び出した結果を使って、オブジェクト自体の識別ではなく、 アイテムのノードを識別します。
ko: 기본적으로 변경 감지기는 객체 인스턴스가 반복 가능한 노드를 식별한다고 가정합니다. 이 함수가 제공되면 지시문은이 함수를 호출 한 결과를 사용하여 오브젝트 자체의 ID가 아닌 항목 노드를 식별합니다.
ru: По умолчанию детектор изменений предполагает,что экземпляр объекта идентифицирует узел в итерабеле.При поставке этой функции директива использует результат вызова этой функции для идентификации узла объекта,а не идентификацию самого объекта.

source: By default, the command creates a file named <code>messages.xlf</code> in your project's root directory.
es: Por defecto, el comando crea un archivo llamado <code>messages.xlf</code> en el directorio ra&iacute;z de su proyecto.
ja: デフォルトでは、コマンドはプロジェクトのルートディレクトリに <code>messages.xlf</code> という名前のファイルを作成します。
ko: 기본적으로이 명령은 프로젝트의 루트 디렉토리에 <code>messages.xlf</code> 라는 파일을 만듭니다 .
ru: По умолчанию команда создает файл с именем <code>messages.xlf</code> в корневом каталоге вашего проекта.

source: By default, the compiler replaces decorators with a static field in the class, which allows advanced tree-shakers like <a href="https://github.com/google/closure-compiler">Closure compiler</a> to remove unused classes.
es: Por defecto, el compilador reemplaza a los decoradores con un campo est&aacute;tico en la clase, lo que permite que los sacudidores de &aacute;rboles avanzados como el <a href="https://github.com/google/closure-compiler">compilador Closure</a> eliminen las clases no utilizadas.
ja: デフォルトでは、コンパイラーはデコレーターをクラスの静的フィールドに置き換えます。これにより、<a href="https://github.com/google/closure-compiler">クロージャーコンパイラーの</a>ような高度なツリーシェーカーが未使用のクラスを削除できます。
ko: 기본적으로 컴파일러는 데코레이터를 클래스의 정적 필드로 바꾸므로 <a href="https://github.com/google/closure-compiler">Closure 컴파일러</a> 와 같은 고급 트리 셰이커는 사용하지 않는 클래스를 제거 할 수 있습니다.
ru: По умолчанию компилятор заменяет декораторы статическим полем в классе, что позволяет продвинутым создателям деревьев, таким как <a href="https://github.com/google/closure-compiler">компилятор Closure,</a> удалять неиспользуемые классы.

source: By default, the directive constructs the new URL using the given query parameters. The example generates the link: <code>/user/bob?debug=true#education</code>.
ja: デフォルトでは、ディレクティブは指定されたクエリパラメータを使用して新しいURLを作成します。この例では、リンク <code>/user/bob?debug=true#education</code> を生成します。
ko: 기본적으로 지시문은 주어진 쿼리 매개 변수를 사용하여 새 URL을 구성합니다. 이 예에서는 <code>/user/bob?debug=true#education</code> 링크를 생성합니다 .
ru: По умолчанию директива создает новый URL-адрес с использованием заданных параметров запроса. В примере создается ссылка: <code>/user/bob?debug=true#education</code> .

source: By default, the files for a new initial app (with the same name as the workspace) are placed in the <code>src/</code> subfolder. Corresponding end-to-end tests are placed in the <code>e2e/</code> subfolder.
es: De manera predeterminada, los archivos para una nueva aplicaci&oacute;n inicial (con el mismo nombre que el espacio de trabajo) se colocan en la <code>src/</code> subcarpeta. Las pruebas correspondientes de extremo a extremo se colocan en la <code>e2e/</code> subcarpeta.
ja: デフォルトでは、新しい初期アプリのファイル（ワークスペースと同じ名前）は <code>src/</code> サブフォルダーに配置されます。対応するエンドツーエンドのテストは、 <code>e2e/</code> サブフォルダーに配置されます。
ko: 기본적으로 새 초기 앱 (작업 공간과 이름이 같은)의 <code>src/</code> 은 src / 하위 폴더에 있습니다. 해당 엔드 투 엔드 테스트는 <code>e2e/</code> 하위 폴더에 배치됩니다 .
ru: По умолчанию файлы для нового исходного приложения (с тем же именем, что и у рабочей области) помещаются в подпапку <code>src/</code> . Соответствующие <code>e2e/</code> тесты помещаются в подпапку e2e / .

source: By default, the files for a new initial application (with the same name as the workspace) are placed in the <code>src/</code> subfolder. Corresponding end-to-end tests are placed in the <code>e2e/</code> subfolder.
ja: デフォルトでは、新しい初期アプリケーション（ワークスペースと同じ名前）のファイルは <code>src/</code> サブフォルダーに配置されます。対応するエンドツーエンドのテストは、 <code>e2e/</code> サブフォルダーに配置されます。
ko: 기본적으로 새 초기 응용 프로그램의 파일 (작업 영역과 동일한 이름)은 <code>src/</code> 하위 폴더에 배치됩니다 . 해당하는 end-to-end 테스트는 <code>e2e/</code> 하위 폴더에 저장됩니다.
ru: По умолчанию файлы для нового начального приложения (с тем же именем, что и рабочая область) помещаются в подпапку <code>src/</code> . Соответствующие <code>e2e/</code> тесты помещаются в подпапку e2e / .

source: By default, the injector throws an error when it can't find a requested provider. The <code>@<a href="../api/core/optional">Optional</a>()</code> decorator means not finding the service is OK. The injector returns <code>null</code>, the <code>parentModule</code> parameter is null, and the constructor concludes uneventfully.
es: Por defecto, el inyector arroja un error cuando no puede encontrar un proveedor solicitado. El decorador <code>@<a href="../api/core/optional">Optional</a>()</code> significa que no encontrar el servicio est&aacute; bien. El inyector devuelve <code>null</code> , el par&aacute;metro <code>parentModule</code> es nulo y el constructor concluye sin incidentes.
ja: デフォルトでは、要求されたプロバイダーが見つからない場合、インジェクターはエラーをスローします。 <code>@<a href="../api/core/optional">Optional</a>()</code> デコレータ手段は、サービスを見つけることではないOKです。インジェクターは <code>null</code> を返し、 <code>parentModule</code> パラメーターはnullであり、コンストラクターは問題なく終了します。
ko: 기본적으로 인젝터는 요청 된 제공자를 찾을 수 없으면 오류를 발생시킵니다. <code>@<a href="../api/core/optional">Optional</a>()</code> 서비스를 찾지 못하는 장식 수단은 OK입니다. 인젝터는 <code>null</code> 을 반환 하고 <code>parentModule</code> 매개 변수는 null이며 생성자는 이벤트없이 종료됩니다.
ru: По умолчанию инжектор выдает ошибку, когда не может найти запрошенный поставщик. В <code>@<a href="../api/core/optional">Optional</a>()</code> декоратор средства не находя службы в порядке. Инжектор возвращает значение <code>null</code> , параметр <code>parentModule</code> имеет значение NULL, и конструктор завершается без происшествий.

source: By default, the router checks URL elements from the left to see if the URL matches a given path, and stops when there is a match. For example, '/team/11/user' matches 'team/:id'.
es: Por defecto,el router comprueba los elementos de la URL desde la izquierda para ver si la URL coincide con una ruta determinada,y se detiene cuando hay una coincidencia.Por ejemplo,'/equipo/11/usuario' coincide con 'equipo/:id'.
ja: デフォルトでは、ルータは左からURLの要素をチェックして、URLが指定されたパスにマッチするかどうかを確認し、マッチするものがあれば停止します。例えば、'/team/11/user' は 'team/:id' にマッチします。
ko: 기본적으로 라우터는 왼쪽에서 URL 요소를 확인하여 URL이 지정된 경로와 일치하는지 확인하고 일치하는 항목이 있으면 중지합니다. 예를 들어, '/ team / 11 / user'는 'team / : id'와 일치합니다.
ru: По умолчанию маршрутизатор проверяет элементы URL слева,чтобы увидеть,соответствует ли URL заданному пути,и останавливается,когда есть совпадение.Например,'/team/11/user' соответствует 'team/:id'.

source: By default, the router re-uses a component instance when it re-navigates to the same component type without visiting a different component first. The route parameters could change each time.
ja: デフォルトでは、ルータは、最初に別のコンポーネントを訪問せずに同じコンポーネントタイプに再ナビゲートするときに、コンポーネントのインスタンスを再利用します。ルートパラメータはその都度変更される可能性があります。
ko: 기본적으로 라우터는 다른 구성 요소를 먼저 방문하지 않고 동일한 구성 요소 유형으로 다시 이동할 때 구성 요소 인스턴스를 다시 사용합니다. 경로 매개 변수는 매번 변경 될 수 있습니다.
ru: По умолчанию маршрутизатор повторно использует экземпляр компонента,когда он повторно переходит на один и тот же тип компонента,не посещая сначала другой компонент.Параметры маршрута могут меняться каждый раз.
