Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/angular/angular.*.006.xlf
Languages: es, ja, ko, ru, zh_cn

source: Called when a <code><a href="routeroutlet">RouterOutlet</a></code> directive is destroyed. We need to keep the context as the outlet could be destroyed inside a NgIf and might be re-created later.
es: Se llama cuando se destruye una directiva <code><a href="routeroutlet">RouterOutlet</a></code> . Necesitamos mantener el contexto ya que la salida podr&iacute;a destruirse dentro de un NgIf y podr&iacute;a volver a crearse m&aacute;s tarde.
ja: <code><a href="routeroutlet">RouterOutlet</a></code> ディレクティブが破棄されたときに呼び出されます。アウトレットはNgIf内で破棄され、後で再作成される可能性があるため、コンテキストを維持する必要があります。
ko: <code><a href="routeroutlet">RouterOutlet</a></code> 지시어가 소멸 될 때 호출됩니다 . 콘센트가 NgIf 내부에서 파괴되어 나중에 다시 생성 될 수 있으므로 컨텍스트를 유지해야합니다.
ru: Вызывается, когда директива <code><a href="routeroutlet">RouterOutlet</a></code> уничтожена. Нам нужно сохранить контекст, так как выход может быть разрушен внутри NgIf и может быть создан позже.

source: Called when a <code><a href="routeroutlet">RouterOutlet</a></code> directive is instantiated
es: Se llama cuando se instancia una directiva <code><a href="routeroutlet">RouterOutlet</a></code>
ja: <code><a href="routeroutlet">RouterOutlet</a></code> ディレクティブがインスタンス化されるときに呼び出されます
ko: <code><a href="routeroutlet">RouterOutlet</a></code> 지시문이 인스턴스화 될 때 호출됩니다.
ru: Вызывается, когда <code><a href="routeroutlet">RouterOutlet</a></code> директива RouterOutlet

source: Called when the <code><a href="routereusestrategy">RouteReuseStrategy</a></code> instructs to detach the subtree
es: Se llama cuando <code><a href="routereusestrategy">RouteReuseStrategy</a></code> le indica que separe el sub&aacute;rbol
ja: <code><a href="routereusestrategy">RouteReuseStrategy</a></code> がサブツリーの分離を指示するときに呼び出されます
ko: <code><a href="routereusestrategy">RouteReuseStrategy</a></code> 가 하위 트리 분리를 지시 할 때 호출됩니다.
ru: Вызывается, когда <code><a href="routereusestrategy">RouteReuseStrategy</a></code> дает указание отсоединить поддерево.

source: Called when the <code><a href="routereusestrategy">RouteReuseStrategy</a></code> instructs to re-attach a previously detached subtree
es: Se <code><a href="routereusestrategy">RouteReuseStrategy</a></code> cuando RouteReuseStrategy le indica que vuelva a adjuntar un sub&aacute;rbol previamente desconectado
ja: <code><a href="routereusestrategy">RouteReuseStrategy</a></code> が以前に切り離されたサブツリーを再接続するように指示したときに呼び出されます
ko: <code><a href="routereusestrategy">RouteReuseStrategy</a></code> 가 이전에 분리 된 하위 트리를 다시 연결하도록 지시 할 때 호출됩니다.
ru: Вызывается, когда <code><a href="routereusestrategy">RouteReuseStrategy</a></code> дает указание повторно присоединить ранее отсоединенное поддерево.

source: Called when the corresponding route is deactivated during navigation. Because the component get destroyed, all children outlet are destroyed.
es: Se llama cuando la ruta correspondiente se desactiva durante la navegación.Debido a que el componente se destruye,todas las salidas de los niños se destruyen.
ja: ナビゲーション中に対応するルートが無効化された場合に呼び出されます。コンポーネントが破壊されるため、すべての子アウトレットが破壊されます。
ko: 탐색 중에 해당 경로가 비활성화되면 호출됩니다. 구성품이 파손되므로 모든 어린이 콘센트가 파손됩니다.
ru: Вызывается при отключении соответствующего маршрута во время навигации.Поскольку компонент разрушается,все детские выходы разрушаются.

source: Calling <a href="../api/core/testing/tick">tick()</a> simulates the passage of time until all pending asynchronous activities finish. In this case, it waits for the error handler's <code>setTimeout()</code>.
ja: <a href="../api/core/testing/tick">tick（）を</a>呼び出すと、保留中のすべての非同期アクティビティが終了するまでの時間の経過がシミュレートされます。この場合、エラーハンドラの <code>setTimeout()</code> を待ちます。
ko: <a href="../api/core/testing/tick">tick ()</a> 호출 은 보류중인 모든 비동기 활동이 완료 될 때까지의 시간 경과를 시뮬레이션합니다. 이 경우 오류 처리기의 <code>setTimeout()</code> 기다립니다 .
ru: Вызов функции <a href="../api/core/testing/tick">tick ()</a> имитирует время, пока не завершатся все ожидающие асинхронные действия. В этом случае он ожидает <code>setTimeout()</code> обработчика ошибок .

source: Calling <code><a href="../api/animations/query">query</a>(predicate: <a href="../api/core/predicate">Predicate</a>&lt;<a href="../api/core/debugelement">DebugElement</a>&gt;)</code> returns the first <code><a href="../api/core/debugelement">DebugElement</a></code> that matches the <a href="testing#query-predicate">predicate</a> at any depth in the subtree.
es: La <code><a href="../api/animations/query">query</a>(predicate: <a href="../api/core/predicate">Predicate</a>&lt;<a href="../api/core/debugelement">DebugElement</a>&gt;)</code> llamada (predicado: Predicate &lt; DebugElement &gt;) devuelve el primer <code><a href="../api/core/debugelement">DebugElement</a></code> que coincide con el <a href="testing#query-predicate">predicado</a> a cualquier profundidad en el sub&aacute;rbol.
ja: 呼び出す <code><a href="../api/animations/query">query</a>(predicate: <a href="../api/core/predicate">Predicate</a>&lt;<a href="../api/core/debugelement">DebugElement</a>&gt;)</code> 最初に返し <code><a href="../api/core/debugelement">DebugElement</a></code> 一致する<a href="testing#query-predicate">述語を</a>サブツリー内の任意の深さでは。
ko: 호출 <code><a href="../api/animations/query">query</a>(predicate: <a href="../api/core/predicate">Predicate</a>&lt;<a href="../api/core/debugelement">DebugElement</a>&gt;)</code> 는 하위 트리의 깊이에있는 <a href="testing#query-predicate">조건 자</a> 와 일치하는 첫 번째 <code><a href="../api/core/debugelement">DebugElement</a></code> 를 반환합니다 .
ru: Вызывающий <code><a href="../api/animations/query">query</a>(predicate: <a href="../api/core/predicate">Predicate</a>&lt;<a href="../api/core/debugelement">DebugElement</a>&gt;)</code> возвращает первый <code><a href="../api/core/debugelement">DebugElement</a></code> который соответствует <a href="testing#query-predicate">предикату</a> на любой глубине в поддереве.

source: Calling <code><a href="../api/animations/query">query</a>(predicate: <a href="../api/core/predicate">Predicate</a>&lt;<a href="../api/core/debugelement">DebugElement</a>&gt;)</code> returns the first <code><a href="../api/core/debugelement">DebugElement</a></code> that matches the <a href="testing-utility-apis#query-predicate">predicate</a> at any depth in the subtree.
ja: 呼び出す <code><a href="../api/animations/query">query</a>(predicate: <a href="../api/core/predicate">Predicate</a>&lt;<a href="../api/core/debugelement">DebugElement</a>&gt;)</code> 最初に返し <code><a href="../api/core/debugelement">DebugElement</a></code> 一致する<a href="testing-utility-apis#query-predicate">述語を</a>サブツリー内の任意の深さでは。
ko: <code><a href="../api/animations/query">query</a>(predicate: <a href="../api/core/predicate">Predicate</a>&lt;<a href="../api/core/debugelement">DebugElement</a>&gt;)</code> 호출 하면 하위 트리의 모든 깊이에서 <a href="testing-utility-apis#query-predicate">조건 자</a> 와 일치하는 첫 번째 <code><a href="../api/core/debugelement">DebugElement</a></code> 가 반환 됩니다.
ru: Вызывающий <code><a href="../api/animations/query">query</a>(predicate: <a href="../api/core/predicate">Predicate</a>&lt;<a href="../api/core/debugelement">DebugElement</a>&gt;)</code> возвращает первый <code><a href="../api/core/debugelement">DebugElement</a></code> , который соответствует <a href="testing-utility-apis#query-predicate">предикату</a> на любой глубине в поддереве.

source: Calling <code><a href="../api/core/applicationref#tick">tick()</a></code> simulates the passage of time until all pending asynchronous activities finish. In this case, it waits for the error handler's <code>setTimeout()</code>.
es: Llamar a <code><a href="../api/core/applicationref#tick">tick()</a></code> simula el paso del tiempo hasta que finalicen todas las actividades asincr&oacute;nicas pendientes. En este caso, espera el <code>setTimeout()</code> del controlador de errores .
ja: <code><a href="../api/core/applicationref#tick">tick()</a></code> の呼び出しは、保留中のすべての非同期アクティビティが完了するまでの時間の経過をシミュレートします。この場合、エラーハンドラーの <code>setTimeout()</code> を待ちます。
ko: <code><a href="../api/core/applicationref#tick">tick()</a></code> 호출 은 보류중인 모든 비동기 활동이 완료 될 때까지 시간 경과를 시뮬레이션합니다. 이 경우 오류 처리기의 <code>setTimeout()</code> 기다립니다 .
ru: Вызов <code><a href="../api/core/applicationref#tick">tick()</a></code> имитирует течение времени до завершения всех ожидающих асинхронных действий. В этом случае он ожидает <code>setTimeout()</code> обработчика ошибок .

source: Calling <code><a href="nggetcomponent">getComponent</a></code> on <code>&lt;child-comp&gt;</code> will return the instance of <code>ChildComponent</code> associated with this DOM element.
ja: <code>&lt;child-comp&gt;</code> で <code><a href="nggetcomponent">getComponent</a></code> を呼び出すと、このDOM要素に関連付けられた <code>ChildComponent</code> のインスタンスが返されます。
ko: <code>&lt;child-comp&gt;</code> 에서 <code><a href="nggetcomponent">getComponent</a></code> 를 호출 하면이 DOM 요소와 관련된 <code>ChildComponent</code> 인스턴스가 반환됩니다 .
ru: Вызов <code><a href="nggetcomponent">getComponent</a></code> для <code>&lt;child-comp&gt;</code> вернет экземпляр <code>ChildComponent</code> , связанный с этим элементом DOM.

source: Calling <code><a href="nggetdirectives">getDirectives</a></code> on <code>&lt;button&gt;</code> will return an array with an instance of the <code>MyButton</code> directive that is associated with the DOM element.
ja: <code>&lt;button&gt;</code> で <code><a href="nggetdirectives">getDirectives</a></code> を呼び出すと、DOM要素に関連付けられている <code>MyButton</code> ディレクティブのインスタンスを含む配列が返されます。
ko: <code>&lt;button&gt;</code> 에서 <code><a href="nggetdirectives">getDirectives</a></code> 를 호출 하면 DOM 요소와 관련된 <code>MyButton</code> 지시문 의 인스턴스가있는 배열이 반환됩니다 .
ru: Вызов <code><a href="nggetdirectives">getDirectives</a></code> для <code>&lt;button&gt;</code> вернет массив с экземпляром директивы <code>MyButton</code> , связанной с элементом DOM.

source: Calling <code><a href="nggetdirectives">getDirectives</a></code> on <code>&lt;my-comp&gt;</code> will return an empty array.
ja: <code>&lt;my-comp&gt;</code> で <code><a href="nggetdirectives">getDirectives</a></code> を呼び出すと、空の配列が返されます。
ko: <code>&lt;my-comp&gt;</code> 에서 <code><a href="nggetdirectives">getDirectives</a></code> 를 호출 하면 빈 배열이 반환됩니다.
ru: Вызов <code><a href="nggetdirectives">getDirectives</a></code> для <code>&lt;my-comp&gt;</code> вернет пустой массив.

source: Calling <code><a href="nggetlisteners">getListeners</a></code> on <code>&lt;div&gt;</code> will return an object that looks as follows:
ja: <code>&lt;div&gt;</code> で <code><a href="nggetlisteners">getListeners</a></code> を呼び出すと、次のようなオブジェクトが返されます。
ko: <code>&lt;div&gt;</code> 에서 <code><a href="nggetlisteners">getListeners</a></code> 를 호출 하면 다음과 같은 객체가 반환됩니다.
ru: Вызов <code><a href="nggetlisteners">getListeners</a></code> на <code>&lt;div&gt;</code> вернет объект, который выглядит следующим образом:

source: Calling <code>activateUpdate()</code> without reloading the page could break lazy-loading in a currently running app, especially if the lazy-loaded chunks use filenames with hashes, which change every version. Therefore, it is recommended to reload the page once the promise returned by <code>activateUpdate()</code> is resolved.
ja: ページを再読み込みせずに <code>activateUpdate()</code> を呼び出すと、現在実行中のアプリで遅延読み込みが中断される可能性があります。特に、遅延読み込みされたチャンクがすべてのバージョンを変更するハッシュ付きのファイル名を使用している場合はそうです。したがって、 <code>activateUpdate()</code> によって返されたpromiseが解決されたら、ページをリロードすることをお勧めします。
ko: 페이지를 다시로드하지 않고 <code>activateUpdate()</code> 를 호출 하면 현재 실행중인 앱에서 지연로드가 중단 될 수 있습니다. 특히 지연로드 된 청크가 모든 버전을 변경하는 해시가있는 파일 이름을 사용하는 경우 더욱 그렇습니다. 따라서 <code>activateUpdate()</code> 반환 한 promise 가 해결 되면 페이지를 다시로드하는 것이 좋습니다 .
ru: Вызов <code>activateUpdate()</code> без перезагрузки страницы может нарушить ленивую загрузку в запущенном в данный момент приложении, особенно если лениво загруженные фрагменты используют имена файлов с хешами, которые меняют каждую версию. Поэтому рекомендуется перезагрузить страницу после выполнения обещания, возвращаемого функцией <code>activateUpdate()</code> .

source: Calling <code>compileComponents()</code>
es: Llamar a <code>compileComponents()</code>
ja: <code>compileComponents()</code> の呼び出し
ko: <code>compileComponents()</code> 호출
ru: Вызов <code>compileComponents()</code>

source: Calling <code>compileComponents()</code> closes the current <code><a href="../api/core/testing/testbed">TestBed</a></code> instance to further configuration. You cannot call any more <code><a href="../api/core/testing/testbed">TestBed</a></code> configuration methods, not <code>configureTestingModule()</code> nor any of the <code>override...</code> methods. The <code><a href="../api/core/testing/testbed">TestBed</a></code> throws an error if you try.
es: Llamar a <code>compileComponents()</code> cierra la instancia actual de <code><a href="../api/core/testing/testbed">TestBed</a></code> para una configuraci&oacute;n adicional. No puede invocar m&aacute;s m&eacute;todos de configuraci&oacute;n de <code><a href="../api/core/testing/testbed">TestBed</a></code> , ni <code>configureTestingModule()</code> ni ninguno de los m&eacute;todos de <code>override...</code> El <code><a href="../api/core/testing/testbed">TestBed</a></code> genera un error si se intenta.
ja: <code>compileComponents()</code> を呼び出すと、現在の <code><a href="../api/core/testing/testbed">TestBed</a></code> インスタンスが閉じて、さらに構成が行われます。これ以上 <code><a href="../api/core/testing/testbed">TestBed</a></code> 構成メソッドを呼び出すことはできません。configureTestingModule <code>configureTestingModule()</code> や <code>override...</code> メソッドを呼び出すことはできません。 <code><a href="../api/core/testing/testbed">TestBed</a></code> あなたがしようとした場合、エラーがスローされます。
ko: <code>compileComponents()</code> 호출 하면 추가 구성을 위해 현재 <code><a href="../api/core/testing/testbed">TestBed</a></code> 인스턴스 가 닫힙니다 . <code>configureTestingModule()</code> 또는 <code>override...</code> 메소드가 아닌 더 이상 <code><a href="../api/core/testing/testbed">TestBed</a></code> 구성 메소드를 호출 할 수 없습니다 . <code><a href="../api/core/testing/testbed">TestBed</a></code> 당신이하려고하면 오류가 발생합니다.
ru: Вызов <code>compileComponents()</code> закрывает текущий экземпляр <code><a href="../api/core/testing/testbed">TestBed</a></code> для дальнейшей настройки. Вы не можете назвать какую - либо более <code><a href="../api/core/testing/testbed">TestBed</a></code> методы конфигурации, не <code>configureTestingModule()</code> , ни один из <code>override...</code> методы. <code><a href="../api/core/testing/testbed">TestBed</a></code> выдает ошибку , если вы попытаетесь.

source: Calling <code>overrideProvider</code> before initializing the TestBed will now throw an error. See <a href="https://github.com/angular/angular/pull/38717">PR 38717</a>.
ja: TestBedを初期化する前に <code>overrideProvider</code> を呼び出すと、エラーがスローされるようになりました。<a href="https://github.com/angular/angular/pull/38717">PR38717を</a>参照してください。
ko: TestBed를 초기화하기 전에 <code>overrideProvider</code> 를 호출 하면 이제 오류가 발생합니다. <a href="https://github.com/angular/angular/pull/38717">PR 38717을</a> 참조하십시오 .
ru: Вызов <code>overrideProvider</code> перед инициализацией TestBed теперь вызовет ошибку. См. <a href="https://github.com/angular/angular/pull/38717">PR 38717</a> .

source: Calling <code>queryAll(predicate: <a href="../api/core/predicate">Predicate</a>&lt;<a href="../api/core/debugelement">DebugElement</a>&gt;)</code> returns all <code>DebugElements</code> that matches the <a href="testing#query-predicate">predicate</a> at any depth in subtree.
es: Llamar a <code>queryAll(predicate: <a href="../api/core/predicate">Predicate</a>&lt;<a href="../api/core/debugelement">DebugElement</a>&gt;)</code> devuelve todos los <code>DebugElements</code> que coinciden con el <a href="testing#query-predicate">predicado</a> a cualquier profundidad en el sub&aacute;rbol.
ja: 呼び出し <code>queryAll(predicate: <a href="../api/core/predicate">Predicate</a>&lt;<a href="../api/core/debugelement">DebugElement</a>&gt;)</code> すべて返し <code>DebugElements</code> 一致する<a href="testing#query-predicate">述語を</a>サブツリー内の任意の深さでは。
ko: <code>queryAll(predicate: <a href="../api/core/predicate">Predicate</a>&lt;<a href="../api/core/debugelement">DebugElement</a>&gt;)</code> 호출 하면 하위 트리의 모든 깊이에서 <a href="testing#query-predicate">조건 자</a> 와 일치하는 모든 <code>DebugElements</code> 를 반환합니다 .
ru: Вызов <code>queryAll(predicate: <a href="../api/core/predicate">Predicate</a>&lt;<a href="../api/core/debugelement">DebugElement</a>&gt;)</code> возвращает все <code>DebugElements</code> , которые соответствуют <a href="testing#query-predicate">предикату</a> на любой глубине в поддереве.

source: Calling <code>queryAll(predicate: <a href="../api/core/predicate">Predicate</a>&lt;<a href="../api/core/debugelement">DebugElement</a>&gt;)</code> returns all <code>DebugElements</code> that matches the <a href="testing-utility-apis#query-predicate">predicate</a> at any depth in subtree.
ja: 呼び出し <code>queryAll(predicate: <a href="../api/core/predicate">Predicate</a>&lt;<a href="../api/core/debugelement">DebugElement</a>&gt;)</code> すべて返し <code>DebugElements</code> 一致する<a href="testing-utility-apis#query-predicate">述語を</a>サブツリー内の任意の深さでは。
ko: <code>queryAll(predicate: <a href="../api/core/predicate">Predicate</a>&lt;<a href="../api/core/debugelement">DebugElement</a>&gt;)</code> 호출 하면 하위 트리의 모든 깊이에서 <a href="testing-utility-apis#query-predicate">조건 자</a> 와 일치하는 모든 <code>DebugElements</code> 가 반환됩니다 .
ru: Вызов <code>queryAll(predicate: <a href="../api/core/predicate">Predicate</a>&lt;<a href="../api/core/debugelement">DebugElement</a>&gt;)</code> возвращает все <code>DebugElements</code> , которые соответствуют <a href="testing-utility-apis#query-predicate">предикату</a> на любой глубине в поддереве.

source: Calling <code>setErrors</code> also updates the validity of the parent control.
es: Llamar a <code>setErrors</code> tambi&eacute;n actualiza la validez del control primario.
ja: <code>setErrors</code> を呼び出すと、親コントロールの有効性も更新されます。
ko: <code>setErrors</code> 를 호출 하면 부모 컨트롤의 유효성도 업데이트됩니다.
ru: Вызов <code>setErrors</code> также обновляет достоверность родительского элемента управления.

source: Calling <code>subscribe(...)</code> triggers execution of the observable and causes <code><a href="../api/common/http/httpclient">HttpClient</a></code> to compose and send the HTTP request to the server.
es: Llamar a <code>subscribe(...)</code> desencadena la ejecuci&oacute;n del observable y hace que <code><a href="../api/common/http/httpclient">HttpClient</a></code> redacte y env&iacute;e la solicitud HTTP al servidor.
ja: <code>subscribe(...)</code> を呼び出すと、オブザーバブルの実行がトリガーされ、 <code><a href="../api/common/http/httpclient">HttpClient</a></code> がHTTPリクエストを作成してサーバーに送信します。
ko: <code>subscribe(...)</code> 호출 하면 Observable의 실행이 트리거되고 <code><a href="../api/common/http/httpclient">HttpClient</a></code> 가 HTTP 요청을 작성하여 서버로 보냅니다.
ru: Вызов <code>subscribe(...)</code> запускает выполнение наблюдаемого и заставляет <code><a href="../api/common/http/httpclient">HttpClient</a></code> создавать и отправлять HTTP-запрос на сервер.

source: Calling any of the <code>bypassSecurityTrust...</code> APIs disables Angular's built-in sanitization for the value passed in. Carefully check and audit all values and code paths going into this call. Make sure any user data is appropriately escaped for this security context. For more detail, see the <a href="http://g.co/ng/security">Security Guide</a>.
es: Llamar a cualquiera de las API de <code>bypassSecurityTrust...</code> deshabilita la desinfecci&oacute;n integrada de Angular para el valor pasado. Verifique y audite cuidadosamente todos los valores y rutas de c&oacute;digo que entran en esta llamada. Aseg&uacute;rese de que todos los datos de usuario se hayan escapado adecuadamente para este contexto de seguridad. Para m&aacute;s detalles, consulte la <a href="http://g.co/ng/security">Gu&iacute;a de seguridad</a> .
ja: <code>bypassSecurityTrust...</code> APIのいずれかを呼び出すと、渡された値に対するAngularの組み込みのサニタイズが無効になります。この呼び出しに入るすべての値とコードパスを慎重に確認および監査してください。このセキュリティコンテキストでユーザーデータが適切にエスケープされていることを確認してください。詳細については、 『<a href="http://g.co/ng/security">セキュリティガイド』を</a>参照してください。
ko: <code>bypassSecurityTrust...</code> API 중 하나를 호출하면 전달 된 값에 대해 Angular의 내장 된 살균 기능이 비활성화됩니다.이 호출에 들어가는 모든 값과 코드 경로를 신중하게 확인하고 감사하십시오. 이 보안 컨텍스트에 대해 사용자 데이터가 적절하게 이스케이프되었는지 확인하십시오. 자세한 내용은 <a href="http://g.co/ng/security">보안 안내서를</a> 참조하십시오 .
ru: Вызов любого из API-интерфейсов <code>bypassSecurityTrust...</code> отключает встроенную очистку Angular для переданного значения. Тщательно проверяйте и проверяйте все значения и пути кода, входящие в этот вызов. Убедитесь, что любые пользовательские данные надлежащим образом экранированы для этого контекста безопасности. Для получения более подробной информации см. <a href="http://g.co/ng/security">Руководство</a> по безопасности .

source: Calling any of the <code>bypassSecurityTrust...</code> APIs disables Angular's built-in sanitization for the value passed in. Carefully check and audit all values and code paths going into this call. Make sure any user data is appropriately escaped for this security context. For more detail, see the <a href="https://g.co/ng/security">Security Guide</a>.
ru: Вызов любого из API <code>bypassSecurityTrust...</code> отключает встроенную в Angular очистку переданного значения. Тщательно проверяйте и проверяйте все значения и пути кода, входящие в этот вызов. Убедитесь, что все пользовательские данные экранированы соответствующим образом для этого контекста безопасности. Подробнее см. <a href="https://g.co/ng/security">Руководство</a> по безопасности .

source: Calling the function on <code>&lt;my-app&gt;</code> will return the <code>MyApp</code> instance.
ja: <code>&lt;my-app&gt;</code> で関数を呼び出すと、 <code>MyApp</code> インスタンスが返されます。
ko: <code>&lt;my-app&gt;</code> 에서 함수를 호출하면 <code>MyApp</code> 인스턴스 가 반환됩니다 .
ru: Вызов функции в <code>&lt;my-app&gt;</code> вернет экземпляр <code>MyApp</code> .

source: Callouts are meant to grab the user's attention. They are not for casual asides. Please use them sparingly.
es: Las llamadas están destinadas a captar la atención del usuario.No son para los asistentes ocasionales.Por favor,úselas con moderación.
ja: 吹き出しはユーザーの注意を引くためのものです。彼らはカジュアルな余談のためのものではありません。控えめに使用してください。
ko: 설명 선은 사용자의주의를 끌기위한 것입니다. 그것들은 캐주얼 한 것이 아닙니다. 드물게 사용하십시오.
ru: Вызовы должны привлечь внимание пользователя.Они не для случайных целей.Пожалуйста,используйте их экономно.

source: Callouts use the same <em>urgency levels</em> that alerts do.
es: Las llamadas utilizan los mismos <em>niveles de urgencia</em> que las alertas.
ja: コールアウトは、アラートと同じ<em>緊急度レベル</em>を使用します。
ko: 설명 선 은 알림 과 동일한 <em>긴급 수준</em> 을 사용합니다 .
ru: Выноски используют те же <em>уровни срочности,</em> что и предупреждения.

source: Callouts, like alerts, are meant to draw attention to important points. Use a callout when you want a riveting header and multi-line content.
es: Las llamadas,como las alertas,tienen como objetivo llamar la atención sobre puntos importantes.Usa una llamada cuando quieras un encabezado fascinante y un contenido multilínea.
ja: 吹き出しは、アラートのように、重要なポイントに注目してもらうためのものです。リベットのようなヘッダーと複数行のコンテンツが必要な場合は、吹き出しを使用します。
ko: 경고와 같은 문구는 중요한 사항에주의를 기울 이도록 고안되었습니다. 리벳 팅 헤더 및 여러 줄 내용을 원할 때 설명 선을 사용하십시오.
ru: Вызовы,как и предупреждения,призваны привлечь внимание к важным моментам.Используйте Callout (Вызов),когда вам нужен захватывающий заголовок и многострочный контент.

source: Calls <code><a href="../api/animations/animatechild">animateChild</a>()</code> on the view that is leaving, to run its child animations.
es: Llama a <code><a href="../api/animations/animatechild">animateChild</a>()</code> en la vista que se va, para ejecutar sus animaciones secundarias.
ja: 終了するビューで <code><a href="../api/animations/animatechild">animateChild</a>()</code> を呼び出して、子アニメーションを実行します。
ko: 떠나는 뷰에서 <code><a href="../api/animations/animatechild">animateChild</a>()</code> 를 호출 하여 자식 애니메이션을 실행합니다.
ru: Вызывает <code><a href="../api/animations/animatechild">animateChild</a>()</code> для уходящего представления, чтобы запустить его дочерние анимации.
