Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/angular/angular.*.006.xlf
Languages: es, ja, ko, ru, zh_cn

source: Define <code><a href="../api/router/routermodule#forRoot">forRoot()</a></code> and <code><a href="../api/router/routermodule#forChild">forChild()</a></code> methods in the module.
zh_cn: 在模块中定义 <code><a href="../api/router/routermodule#forRoot">forRoot()</a></code> 和 <code><a href="../api/router/routermodule#forChild">forChild()</a></code> 方法。

source: Define Routes
zh_cn: 定义路线

source: Define a <code>shippingCosts</code> property.
zh_cn: 定义一个 <code>shippingCosts</code> 属性。

source: Define a Wildcard route
zh_cn: 定义通配符途径

source: Define a cart service
zh_cn: 定义一个购物车服务

source: Define a container element for the directive, and specify the switch expression to match against as an attribute:
zh_cn: 为指令定义一个容器元素,并指定要匹配的开关表达式作为属性。

source: Define a generation rule
zh_cn: 定义一个生成规则

source: Define a link using the <code><a href="../api/router/routerlink">RouterLink</a></code> directive. The <code><a href="../api/router/routerlink">routerLink</a></code> defines how the user navigates to the route (or URL) declaratively in the component template.
zh_cn: 使用 <code><a href="../api/router/routerlink">RouterLink</a></code> 指令定义链接。所述 <code><a href="../api/router/routerlink">routerLink</a></code> 定义如何在用户导航到声明在分量模板的路径（或URL）。

source: Define a method to dynamically insert an alias control into the alias's form array. The <code><a href="../api/forms/formarray#push">FormArray.push()</a></code> method inserts the control as a new item in the array.
zh_cn: 定义一种方法，以将别名控件动态插入到别名的表单数组中。所述 <code><a href="../api/forms/formarray#push">FormArray.push()</a></code> 方法插入控制为所述阵列中的新项目。

source: Define a template reference variable on the (enhanced) form element.
zh_cn: 在(增强型)表单元素上定义一个模板参考变量。

source: Define an animation trigger in the <code>animations</code> section of <code>@<a href="../core/component">Component</a></code> metadata. In the template, reference the trigger by name and bind it to a trigger expression that evaluates to a defined animation state, using the following format:
zh_cn: 在 <code>@<a href="../core/component">Component</a></code> <a href="../core/component">组件</a>元数据的 <code>animations</code> 部分中定义动画触发器。在模板中，按名称引用触发器，并将其绑定到触发器表达式，该表达式使用以下格式评估为定义的动画状态：

source: Define application-wide providers by specifying <code><a href="../api/core/injectable#providedIn">providedIn</a>: 'root'</code> on its <code>@<a href="../api/core/injectable">Injectable</a>()</code> decorator (in the case of services) or at <code><a href="../api/core/injectiontoken">InjectionToken</a></code> construction (in the case where tokens are provided). Providers that are created this way automatically are made available to the entire application and don't need to be listed in any module.
zh_cn: 通过指定定义应用程序范围内提供商 <code><a href="../api/core/injectable#providedIn">providedIn</a>: 'root'</code> 在其 <code>@<a href="../api/core/injectable">Injectable</a>()</code> 装饰（在服务的情况下）或在 <code><a href="../api/core/injectiontoken">InjectionToken</a></code> 结构（在壳体中提供的令牌的位置）。通过这种方式自动创建的提供程序可用于整个应用程序，无需在任何模块中列出。

source: Define dependencies with providers
zh_cn: 与提供者一起定义依赖关系

source: Define methods to add items to the cart, return cart items, and clear the cart items:
zh_cn: 定义添加物品到购物车、退回购物车物品和清除购物车物品的方法。

source: Define the <code>addToCart()</code> method, which adds the current product to the cart.
zh_cn: 定义 <code>addToCart()</code> 方法，该方法将当前产品添加到购物车。

source: Define the <code>heroesUrl</code> of the form <code>:base/:collectionName</code> with the address of the heroes resource on the server. Here <code>base</code> is the resource to which requests are made, and <code>collectionName</code> is the heroes data object in the <code>in-memory-data-service.ts</code>.
zh_cn: 用服务器上heroes资源的地址定义 <code>:base/:collectionName</code> 形式的 <code>heroesUrl</code> 。这里 <code>base</code> 是发出请求的资源， <code>collectionName</code> 是 <code>in-memory-data-service.ts</code> 中的heroes数据对象。

source: Define the <code>items</code> property to store the products in the cart.
zh_cn: 定义 <code>items</code> 属性以将产品存储在购物车中。

source: Define the <code>product</code> property and inject the <code><a href="../api/router/activatedroute">ActivatedRoute</a></code> into the constructor.
zh_cn: 定义 <code>product</code> 属性，然后将 <code><a href="../api/router/activatedroute">ActivatedRoute</a></code> 注入构造函数。

source: Define the animation.
zh_cn: 定义动画。

source: Define the checkout form model
zh_cn: 定义结账表单模型

source: Define the crossorigin attribute setting of elements that provide CORS support.
zh_cn: 定义提供CORS支持的元素的跨源属性设置。

source: Define the get() method
zh_cn: 定义get()方法

source: Define the output filename cache-busting hashing mode.
zh_cn: 定义输出文件名缓存破坏哈希模式。

source: Define the rule
zh_cn: 界定规则

source: Define the shipping page
zh_cn: 定义运输页面

source: Define the view for the new product alert component.
zh_cn: 定义新产品警报组件的视图。

source: Define unique custom ids
zh_cn: 定义独特的自定义ID

source: Define what the router should do if it receives a navigation request to the current URL. Default is <code>ignore</code>, which causes the router ignores the navigation. This can disable features such as a "refresh" button. Use this option to configure the behavior when navigating to the current URL. Default is 'ignore'.
zh_cn: 定义路由器在收到对当前URL的导航请求时应采取的措施。默认值为 <code>ignore</code> ，这将导致路由器忽略导航。这可以禁用诸如&ldquo;刷新&rdquo;按钮之类的功能。使用此选项来配置导航到当前URL时的行为。默认值为&ldquo;忽略&rdquo;。

source: Define your size boundaries in the CLI configuration file, <code>angular.json</code>, in a <code>budgets</code> section for each <a href="build#app-environments">configured environment</a>.
zh_cn: 在CLI配置文件 <code>angular.json</code> 的每个<a href="build#app-environments">配置环境</a>的 <code>budgets</code> 部分中定义尺寸边界。

source: Defines <code>AppModule</code>, the <a href="bootstrapping">root module</a> that tells Angular how to assemble the application. When initially created, it declares only the <code>AppComponent</code>. Over time, you add more components to declare.
zh_cn: 定义 <code>AppModule</code> ，它是告诉Angular如何组装应用程序的<a href="bootstrapping">根模块</a>。最初创建时，它仅声明 <code>AppComponent</code> 。随着时间的推移，您将添加更多要声明的组件。

source: Defines CSS styles to be stored on a renderer instance.
zh_cn: 定义要存储在渲染器实例上的CSS样式。

source: Defines a list of animation steps to be run in parallel.
zh_cn: 定义要并行运行的动画步骤列表。

source: Defines a list of animation steps to be run sequentially, one by one.
zh_cn: 定义一个动画步骤的列表,按顺序一个一个地运行。

source: Defines a matcher for requests based on URL, method, or both.
zh_cn: 定义一个基于URL、方法或两者的请求匹配器。

source: Defines a module that contains components, directives, pipes, and providers.
zh_cn: 定义一个包含组件、指令、管道和提供者的模块。

source: Defines a schema that allows an NgModule to contain the following:
zh_cn: 定义了一个允许NgModule包含以下内容的模式。

source: Defines a schema that allows any property on any element.
zh_cn: 定义一个模式,允许任何元素上的任何属性。

source: Defines a scroll position manager. Implemented by <code>BrowserViewportScroller</code>.
zh_cn: 定义滚动位置管理器。由 <code>BrowserViewportScroller</code> 实现。

source: Defines a set of animation styles, associating each style with an optional <code><a href="animations/animationstylemetadata#offset">offset</a></code> value.
zh_cn: 定义一组动画样式，将每个样式与可选的 <code><a href="animations/animationstylemetadata#offset">offset</a></code> 值相关联。

source: Defines a set of animation styles, associating each style with an optional <code><a href="animationstylemetadata#offset">offset</a></code> value.
zh_cn: 定义一组动画样式，将每个样式与可选的 <code><a href="animationstylemetadata#offset">offset</a></code> 值相关联。

source: Defines a unit test for the root <code>AppComponent</code>.
zh_cn: 为根 <code>AppComponent</code> 定义一个单元测试。

source: Defines an animation step that combines styling information with timing information.
zh_cn: 定义一个结合了造型信息和时间信息的动画步骤。

source: Defines an array of Routes, each mapping a URL path to a component.
zh_cn: 定义一个Routes数组,每个Routes将一个URL路径映射到一个组件。

source: Defines an interface that acts as a bridge between the Angular forms API and a native element in the DOM.
zh_cn: 定义了一个接口,作为Angular表单API和DOM中本地元素之间的桥梁。

source: Defines arbitrary developer-defined data to be stored on a renderer instance. This is useful for renderers that delegate to other renderers.
zh_cn: 定义了开发人员定义的任意数据,以存储在渲染器实例上。这对于委托给其他渲染器的渲染器非常有用。

source: Defines how the router merges parameters, data, and resolved data from parent to child routes. By default ('emptyOnly'), inherits parent parameters only for path-less or component-less routes. Set to 'always' to enable unconditional inheritance of parent parameters.
zh_cn: 定义路由器如何将参数、数据和解析数据从父路由合并到子路由。默认情况下('emptyOnly'),只继承无路径或无组件路由的父参数。设置为'always',可以无条件地继承父级参数。

source: Defines how the router should navigate to a component based on a URL pattern. Most routes consist of a path and a component type.
zh_cn: 定义路由器如何根据URL模式导航到一个组件。大多数路由由一个路径和一个组件类型组成。

source: Defines infrastructure for dependency injection (DI), internationalization (i18n), and various testing and debugging facilities.
zh_cn: 定义了依赖注入(DI)、国际化(i18n)以及各种测试和调试设施的基础设施。

source: Defines one <em>transition</em> when switching back and forth from the <code>heroes</code> and <code>hero</code> routes to ease the component in from the left of the screen as it enters the application view (<code>:enter</code>), the other to animate the component to the right as it leaves the application view (<code>:leave</code>).
zh_cn: 在从 <code>heroes</code> 和 <code>hero</code> 路线来回切换时定义一个<em>过渡</em>，以使组件在进入应用程序视图（ <code>:enter</code> ）时从屏幕的左侧轻松移动，另一种<em>过渡是</em>在组件离开应用程序时向右侧进行动画处理查看（ <code>:leave</code> ）。

source: Defines one or more CSS styles to use in animations. Controls the visual appearance of HTML elements during animations. Uses object syntax.
zh_cn: 定义一个或多个CSS样式,用于动画中。在动画中控制HTML元素的视觉外观。使用对象语法。

source: Defines routes.
zh_cn: 定义路线。

source: Defines template and style encapsulation options available for Component's <a href="component"><code>Component</code></a>.
zh_cn: 定义可用于Component的<a href="component"> <code>Component</code> 的</a>模板和样式封装选项。

source: Defines template and style encapsulation options available for Component's <a href="core/component"><code>Component</code></a>.
zh_cn: 定义可用于Component的<a href="core/component"> <code>Component</code> 的</a>模板和样式封装选项。

source: Defines the <code><a href="router/route">Route</a></code> object that maps a URL path to a component, and the <code><a href="router/routeroutlet">RouterOutlet</a></code> directive that you use to place a routed view in a template, as well as a complete API for configuring, querying, and controlling the router state.
zh_cn: 定义将URL路径映射到组件的 <code><a href="router/route">Route</a></code> 对象，以及用于在模板中放置路由视图的 <code><a href="router/routeroutlet">RouterOutlet</a></code> 指令，以及用于配置，查询和控制路由器状态的完整API。

source: Defines the HTML template associated with the root <code>AppComponent</code>.
zh_cn: 定义与根 <code>AppComponent</code> 关联的HTML模板。

source: Defines the ServiceWorker registration strategy, which determines when it will be registered with the browser.
zh_cn: 定义ServiceWorker注册策略,该策略决定了它何时会被浏览器注册。

source: Defines the animation sequence between two named states. Uses array syntax.
zh_cn: 定义两个命名状态之间的动画序列。使用数组语法。

source: Defines the base CSS stylesheet for the root <code>AppComponent</code>.
zh_cn: 为根 <code>AppComponent</code> 定义基本CSS样式表。

source: Defines the build environment.
zh_cn: 定义构建环境。

source: Defines the class infrastructure for components, view hierarchies, change detection, rendering, and event handling.
zh_cn: 定义了组件、视图层次结构、变化检测、渲染和事件处理的类基础设施。

source: Defines the decorators that supply metadata and context for Angular constructs.
zh_cn: 定义了为Angular构造供给元数据和上下文的装饰器。

source: Defines the logic for the app's root component, named <code>AppComponent</code>. The view associated with this root component becomes the root of the <a href="glossary#view-hierarchy">view hierarchy</a> as you add components and services to your application.
zh_cn: 为名为 <code>AppComponent</code> 的应用程序的根组件定义逻辑。当您向应用程序中添加组件和服务时，与此根组件关联的视图将成为<a href="glossary#view-hierarchy">视图层次结构</a>的根。

source: Defines the map of errors returned from failed validation checks.
zh_cn: 定义从失败的验证检查中返回的错误地图。

source: Defines the name that can be used in the template to assign this directive to a variable.
zh_cn: 定义在模板中可用于将此指令分配给变量的名称。

source: Defines the root module, named <code>AppModule</code>, that tells Angular how to assemble the application. Initially declares only the <code>AppComponent</code>. As you add more components to the app, they must be declared here.
zh_cn: 定义名为 <code>AppModule</code> 的根模块，该模块告诉Angular如何组装应用程序。最初仅声明 <code>AppComponent</code> 。当您向应用程序添加更多组件时，必须在此处声明它们。

source: Defines the same <code>AppComponent</code> as the one in the QuickStart playground. It is the <strong>root</strong> component of what will become a tree of nested components as the application evolves.
zh_cn: 定义与QuickStart游乐场中相同的 <code>AppComponent</code> 。它是随着应用程序的发展而变成嵌套组件树的<strong>根</strong>组件。

source: Defines the set of injectable objects that are visible to its view DOM children. See <a href="component#injecting-a-class-with-a-view-provider">example</a>.
zh_cn: 定义对其视图DOM子对象可见的可注入对象的集合。参见<a href="component#injecting-a-class-with-a-view-provider">示例</a>。

source: Defines two transitions. A single trigger can define multiple states and transitions.
zh_cn: 定义两个转换。一个触发器可以定义多个状态和转换。

source: Defines when guards and resolvers will be run. One of
zh_cn: 定义何时运行防护和解析器。其中的

source: Defines when the router updates the browser URL. By default ('deferred'), update after successful navigation. Set to 'eager' if prefer to update the URL at the beginning of navigation. Updating the URL early allows you to handle a failure of navigation by showing an error message with the URL that failed.
zh_cn: 定义路由器更新浏览器URL的时间。默认情况下('deferred'),在导航成功后更新。如果喜欢在导航开始时更新URL,则设置为'急切'。提前更新URL可以让您通过显示失败的URL的错误信息来处理导航失败。

source: Defining animations and attaching them to the HTML template
zh_cn: 定义动画并将其附加到HTML模板中。

source: Defining input options with a schema and interfaces
zh_cn: 用模式和接口定义输入选项。

source: Defining observers
zh_cn: 观察员的定义

source: Defining offsets for keyframes is optional. If you omit them, evenly spaced offsets are automatically assigned. For example, three keyframes without predefined offsets receive offsets of 0, 0.5, and 1. Specifying an offset of 0.8 for the middle transition in the above example might look like this.
zh_cn: 定义关键帧的偏移量是可选的。如果您省略它们,则会自动分配均匀的偏移量。例如,没有预定义偏移量的三个关键帧分别获得0、0.5和1的偏移量。在上面的例子中,为中间的过渡指定0.8的偏移量可能是这样的。

source: Defining providers
zh_cn: 界定提供者

source: Defining rules and actions
zh_cn: 确定规则和行动

source: Defining typings for runtime-global libraries
zh_cn: 定义运行时-全局库的类型学

source: Definition of builder input options.
zh_cn: 建设者输入选项的定义。

source: Delayed change detection is intentional and useful. It gives the tester an opportunity to inspect and change the state of the component <em>before Angular initiates data binding and calls <a href="lifecycle-hooks">lifecycle hooks</a></em>.
zh_cn: 延迟更改检测是有意且有用的。它使测试人员有机会<em>在Angular启动数据绑定和调用<a href="lifecycle-hooks">生命周期挂钩</a></em><em>之前</em>检查和更改组件的状态。

source: Delegate complex component logic to services
zh_cn: 将复杂的组件逻辑委托给服务

source: Delete <code>hero details</code> from <code>HeroesComponent</code>
zh_cn: 从 <code>HeroesComponent</code> 删除 <code>hero details</code>

source: Delete <code>non-essential</code> files (optional)
zh_cn: 删除 <code>non-essential</code> 文件（可选）

source: Delete a hero
zh_cn: 删除一个英雄

source: Delete the <code>&lt;app-hero-detail&gt;</code> component at the bottom of the template.
zh_cn: 删除模板底部的 <code>&lt;app-hero-detail&gt;</code> 组件。

source: Delete the <code>HEROES</code> import, because you won't need that anymore. Import the <code>HeroService</code> instead.
zh_cn: 删除 <code>HEROES</code> 导入，因为您将不再需要它。而是导入 <code>HeroService</code> 。

source: Delete the <code>app.component.html</code> file. It is not needed for this example.
zh_cn: 删除 <code>app.component.html</code> 文件。此示例不需要。

source: Delete the output path before building.
zh_cn: 建设前删除输出路径。

source: Deletes values for a given header in a clone of the original instance.
zh_cn: 在原始实例的克隆中删除给定头的值。

source: Deleting an item updates the model, and depending on your code, triggers other changes including queries and saving to a remote server. These changes propagate through the system and ultimately display in this and other views.
zh_cn: 删除一个项目会更新模型,并根据你的代码,触发其他变化,包括查询和保存到远程服务器。这些更改会在系统中传播,并最终显示在本视图和其他视图中。

source: Deliver an arbitrary <code><a href="../httpevent">HttpEvent</a></code> (such as a progress event) on the response stream for this request.
zh_cn: 在响应流上为此请求传递一个任意的 <code><a href="../httpevent">HttpEvent</a></code> （例如progress事件）。

source: Demonstrates a combination of a component and a directive each with its own hooks.
zh_cn: 展示组件和指令的组合,每个组件都有自己的钩子。

source: Demonstrates every lifecycle hook. Each hook method writes to the on-screen log.
zh_cn: 演示每个生命周期的钩子。每个钩子方法都会写入屏幕日志。

source: Dependencies are services or objects that a class needs to perform its function. DI is a coding pattern in which a class asks for dependencies from external sources rather than creating them itself.
zh_cn: 依赖关系是一个类在执行其功能时需要的服务或对象。DI是一种编码模式,在这种模式下,一个类从外部来源索取依赖关系,而不是自己创建它们。

source: Dependencies can also be marked as optional:
zh_cn: 依赖关系也可以被标记为可选的。

source: Dependencies can be registered at any level in the component hierarchy. When a component requests a dependency, Angular starts with that component's injector and walks up the injector tree until it finds the first suitable provider. Angular throws an error if it can't find the dependency during that walk.
zh_cn: 依赖关系可以在组件层次结构中的任何级别注册。当一个组件请求一个依赖关系时,Angular会从该组件的注入器开始,并沿着注入器树向上走,直到找到第一个合适的提供者。如果在行走过程中找不到依赖关系,Angular会抛出一个错误。

source: Dependencies provided by the root injector can be injected into <em>any</em> component <em>anywhere</em> in the application. In some cases, you might want to restrict service availability to a particular region of the application. For instance, you might want to let users explicitly opt in to use a service, rather than letting the root injector provide it automatically.
zh_cn: 根注入器提供的依赖项可以注入到应用程序中<em>任何</em><em>位置的</em><em>任何</em>组件中。在某些情况下，您可能希望将服务可用性限制为应用程序的特定区域。例如，您可能希望让用户明确选择使用服务，而不是让根注入器自动提供服务。

source: Dependencies whose providers are listed here become available for injection into any component, directive, pipe or service that is a child of this injector. The NgModule used for bootstrapping uses the root injector, and can provide dependencies to any part of the app.
zh_cn: 这里列出的提供者的依赖关系可以被注入到任何组件、指令、管道或服务中,这些组件、指令、管道或服务都是这个注入器的子节点。用于bootstrapping的NgModule使用根注入器,并且可以为应用程序的任何部分提供依赖关系。

source: Dependencies. See <a href="https://docs.npmjs.com/files/package.json">https://docs.npmjs.com/files/package.json</a>.
zh_cn: 依赖关系。请参阅<a href="https://docs.npmjs.com/files/package.json">https://docs.npmjs.com/files/package.json</a>。

source: Dependency Injection
zh_cn: 依赖性注入

source: Dependency Injection Guide
zh_cn: 依赖注入指南

source: Dependency Injection in Action
zh_cn: 依赖注入在行动

source: Dependency Injection in Angular
zh_cn: 在Angular中注入依赖关系

source: Dependency Providers
zh_cn: 抚养人供应商

source: Dependency injection
zh_cn: 依赖性注入

source: Dependency injection (DI)
zh_cn: 依赖性注入(DI)

source: Dependency injection (DI), is an important application design pattern. Angular has its own DI framework, which is typically used in the design of Angular applications to increase their efficiency and modularity.
zh_cn: 依赖注入(DI),是一种重要的应用设计模式。Angular有自己的DI框架,通常在Angular应用的设计中使用,以提高其效率和模块化程度。

source: Dependency injection configuration
zh_cn: 依赖注入配置

source: Dependency injection is front and center in both AngularJS and Angular, but there are some key differences between the two frameworks in how it actually works.
zh_cn: 依赖注入在AngularJS和Angular中都是最重要的,但两个框架在实际工作中存在一些关键的差异。

source: Dependency injection tokens
zh_cn: 依赖性注入令牌

source: Dependency injection tokens are always strings
zh_cn: 依赖注入标记总是字符串

source: Dependency objects can be simple values like dates, numbers and strings, or shapeless objects like arrays and functions.
zh_cn: 依赖对象可以是简单的值,如日期、数字和字符串,也可以是无形状的对象,如数组和函数。

source: Dependency on a reflect-metadata polyfill in JIT mode
zh_cn: 依赖于JIT模式下的反射-元数据多重填充。

source: Dependent values should not change during a single turn of the event loop. If an idempotent expression returns a string or a number, it returns the same string or number when called twice in a row. If the expression returns an object, including an <code>array</code>, it returns the same object <em>reference</em> when called twice in a row.
zh_cn: 在事件循环的单个循环中，从属值不应更改。如果幂等表达式返回字符串或数字，则当连续调用两次时，它将返回相同的字符串或数字。如果表达式返回一个对象（包括一个 <code>array</code> ，则在连续两次调用该表达式时，它将返回相同的对象<em>引用</em>。

source: Depending on the <code><a href="locationstrategy">LocationStrategy</a></code> used, <code><a href="location">Location</a></code> persists to the URL's path or the URL's hash segment.
zh_cn: 根据所使用的 <code><a href="locationstrategy">LocationStrategy</a></code> ， <code><a href="location">Location</a></code> 保留到URL的路径或URL的哈希段。

source: Deploy to GitHub pages
zh_cn: 部署到GitHub页面

source: Deploy your application with <code>firebase deploy</code>, because the command <code>firebase init</code> has created a <code>firebase.json</code> file that tells Firebase how to serve your app.
zh_cn: 使用 <code>firebase deploy</code> 部署应用程序，因为命令 <code>firebase init</code> 已创建了 <code>firebase.json</code> 文件，该文件告诉Firebase如何为您的应用程序提供服务。

source: Deployment to
zh_cn: 部署到

source: Deprecated APIs
zh_cn: 废弃的API

source: Deprecated APIs and Features
zh_cn: 废弃的API和功能

source: Deprecated features
zh_cn: 废弃的功能

source: Deprecation announced
zh_cn: 宣布停止使用

source: Deprecation practices
zh_cn: 废弃的做法

source: Describes how the <code><a href="core/injector">Injector</a></code> should be configured as static (that is, without reflection).
zh_cn: 描述应如何将 <code><a href="core/injector">Injector</a></code> 配置为静态（即无反射）。

source: Describes how the <code><a href="core/injector">Injector</a></code> should be configured.
zh_cn: 描述应该如何配置 <code><a href="core/injector">Injector</a></code> 。

source: Describes how the <code><a href="injector">Injector</a></code> should be configured as static (that is, without reflection).
zh_cn: 描述应如何将 <code><a href="injector">Injector</a></code> 配置为静态（即无反射）。

source: Describes how the <code><a href="injector">Injector</a></code> should be configured.
zh_cn: 描述应该如何配置 <code><a href="injector">Injector</a></code> 。

source: Designing a class with dependency injection makes the class easier to test. Listing dependencies as constructor parameters may be all you need to test application parts effectively.
zh_cn: 设计一个具有依赖注入的类,可以使类更容易测试。将依赖关系列为构造参数可能是你有效测试应用部分所需要的全部。

source: Despite inner animations being disabled, a parent animation can <code><a href="query">query</a>()</code> for inner elements located in disabled areas of the template and still animate them if needed. This is also the case for when a sub animation is queried by a parent and then later animated using <code><a href="animatechild">animateChild</a>()</code>.
zh_cn: 尽管禁用了内部动画，但是父动画可以 <code><a href="query">query</a>()</code> 以获取位于模板的禁用区域中的内部元素，并在需要时仍对其进行动画处理。当父级查询子动画然后再使用 <code><a href="animatechild">animateChild</a>()</code> 对其进行动画处理时，也是如此。

source: Destroy the Angular platform and all Angular applications on the page.
zh_cn: 销毁页面上的Angular平台和所有Angular应用。

source: Destroy the existing platform.
zh_cn: 摧毁现有平台。

source: Destroys a view attached to this container
zh_cn: 销毁连接到这个容器的视图

source: Destroys all views in this container.
zh_cn: 销毁此容器中的所有视图。

source: Destroys the animation, after invoking the <code><a href="animationplayer#beforeDestroy">beforeDestroy</a>()</code> callback. Calls the <code>onDestroy()</code> callback when destruction is completed.
zh_cn: 调用 <code><a href="animationplayer#beforeDestroy">beforeDestroy</a>()</code> 回调后，销毁动画。销毁完成时调用 <code>onDestroy()</code> 回调。

source: Destroys the component instance and all of the data structures associated with it.
zh_cn: 销毁组件实例和与之相关的所有数据结构。
