Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/angular/angular.*.006.xlf
Languages: es, ja, ko, ru, zh_cn

source: Destroys the module instance and all of the data structures associated with it.
zh_cn: 销毁模块实例和与之相关的所有数据结构。

source: Destroys this view and all of the data structures associated with it.
zh_cn: 销毁此视图以及与之相关的所有数据结构。

source: Destructured variable or constant not supported
zh_cn: 不支持结构化变量或常量

source: Detach change detector to limit how often check occurs
zh_cn: 拆卸零钱检测器,以限制检查的频率。

source: Detached views are not checked during change detection runs until they are re-attached, even if they are marked as dirty.
zh_cn: 脱离的视图在变更检测运行期间不会被检查,直到它们被重新连接,即使它们被标记为脏。

source: Detaches a view from dirty checking again.
zh_cn: 再从脏检查中分离出一个观点。

source: Detaches a view from this container without destroying it. Use along with <code><a href="../forms/formarray#insert">insert()</a></code> to move a view within the current container.
zh_cn: 从该容器分离视图而不破坏它。与 <code><a href="../forms/formarray#insert">insert()</a></code> 一起使用可在当前容器内移动视图。

source: Detaches this view from the change-detection tree. A detached view is not checked until it is reattached. Use in combination with <code><a href="testing/componentfixture#detectChanges">detectChanges()</a></code> to implement local change detection checks.
zh_cn: 从更改检测树中分离该视图。重新连接分离视图之前，不对其进行检查。与 <code><a href="testing/componentfixture#detectChanges">detectChanges()</a></code> 结合使用可实现本地更改检测检查。

source: Detect and act upon changes that Angular can't or won't detect on its own.
zh_cn: 检测并执行Angular无法或不愿自行检测的变化。

source: Detect and act upon changes to input property values with the <code>ngOnChanges()</code> method of the <code><a href="../api/core/onchanges">OnChanges</a></code> lifecycle hook interface.
zh_cn: 使用 <code><a href="../api/core/onchanges">OnChanges</a></code> 生命周期挂钩接口的 <code>ngOnChanges()</code> 方法检测输入属性值的更改并采取措施。

source: Detecting that an error occurred is one thing. Interpreting that error and composing a user-friendly response is a bit more involved.
zh_cn: 检测到错误发生是一回事。解释该错误并写出一个用户友好的响应是比较复杂的。

source: Detecting when an animation is disabled
zh_cn: 检测动画何时被禁用

source: Determines if a route should be reused
zh_cn: 确定途径是否应该被重复使用。

source: Determines if this route (and its subtree) should be detached to be reused later
zh_cn: 确定这个途径(和它的子树)是否应该被分离出来,以便以后重新使用。

source: Determines if this route (and its subtree) should be reattached
zh_cn: 确定是否要重新连接该路由(及其子树)。

source: Determines when the router updates the browser URL. By default (<code>"deferred"</code>), updates the browser URL after navigation has finished. Set to <code>'eager'</code> to update the browser URL at the beginning of navigation. You can choose to update early so that, if navigation fails, you can show an error message with the URL that failed.
zh_cn: 确定路由器何时更新浏览器URL。默认情况下（ <code>"deferred"</code> ），在导航完成后更新浏览器URL。设置为 <code>'eager'</code> 以在导航开始时更新浏览器URL。您可以选择早期更新，这样，如果导航失败，则可以显示带有失败URL的错误消息。

source: Determines which injectors will provide the injectable, by either associating it with an @NgModule or other <code><a href="injectortype">InjectorType</a></code>, or by specifying that this injectable should be provided in the 'root' injector, which will be the application-level injector in most apps.
zh_cn: 通过将其与@NgModule或其他 <code><a href="injectortype">InjectorType</a></code> 关联，或通过指定应在&ldquo;根&rdquo;注入器中提供此注入物来确定哪些注入器将提供可注入物，在大多数应用程序中它将是应用程序级注入器。

source: Dev server target to run tests against.
zh_cn: 开发服务器目标来运行测试。

source: Developer Tools
zh_cn: 开发者工具

source: Developer-defined state that can be passed to any navigation. Access this value through the <code>Navigation.extras</code> object returned from <code>router.getCurrentNavigation()</code> while a navigation is executing.
zh_cn: 开发人员定义的状态，可以传递给任何导航。在执行 <code>Navigation.extras</code> 通过从 <code>router.getCurrentNavigation()</code> 返回的Navigation.extras对象访问此值。

source: Developing forms requires design skills (which are out of scope for this page), as well as framework support for <em>two-way data binding, change tracking, validation, and error handling</em>, which you'll learn about on this page.
zh_cn: 开发表单需要设计技巧（不在本页面范围之内），以及对<em>双向数据绑定，更改跟踪，验证和错误处理的</em>框架支持，您将在此页面上学习这些知识。

source: Developing schematics for libraries
zh_cn: 为图书馆开发原理图

source: Dictionary of objects associated with template local variables (e.g. <code>#foo</code>), keyed by the local variable name.
zh_cn: 与模板局部变量（例如 <code>#foo</code> ）关联的对象的字典，以局部变量名称作为关键字。

source: Differences with <code><a href="upgrademodule">UpgradeModule</a></code>
zh_cn: <code><a href="upgrademodule">UpgradeModule</a></code> 的差异

source: Different classes can provide the same service. For example, the following code tells the injector to return a <code>BetterLogger</code> instance when the component asks for a logger using the <code>Logger</code> token.
zh_cn: 不同的类可以提供相同的服务。例如，以下代码告诉组件在组件使用 <code>Logger</code> 令牌请求记录器时，注入程序返回 <code>BetterLogger</code> 实例。

source: Different file types have different comment syntax so adjust accordingly.
zh_cn: 不同的文件类型有不同的注释语法,所以要相应调整。

source: Different languages have different pluralization rules and grammatical constructions that add complexity to the translation task. You can use regular expressions with the <code>plural</code> and <code>select</code> clauses to provide patterns that aid translation in these cases.
zh_cn: 不同的语言具有不同的复数规则和语法构造，这增加了翻译任务的复杂性。您可以将正则表达式与 <code>plural</code> 和 <code>select</code> 子句一起使用，以提供有助于在这些情况下进行翻译的模式。

source: Differential Loading
zh_cn: 差分加载

source: Differential Loading (Two builds w/Conditional Polyfills
zh_cn: 差分加载(两个构建/有条件的多晶硅填充物)。

source: Differential builds
zh_cn: 差异化建设

source: Differential loading can be explicitly disabled if it causes unexpected issues or you need to target ES5 specifically for legacy browser support.
zh_cn: 如果造成意外的问题,或者您需要专门针对ES5对传统浏览器的支持,可以明确地禁用差分加载。

source: Differential loading is a strategy where the CLI builds two separate bundles as part of your deployed application.
zh_cn: 差别加载是一种策略,在这种策略中,CLI构建了两个独立的捆绑包,作为您部署的应用程序的一部分。

source: Differential loading is currently only supported when using <code>es2015</code> as a compilation <code><a href="../api/router/routerlinkwithhref#target">target</a></code>. When used with targets higher than <code>es2015</code>, a warning is emitted during build time.
zh_cn: 当前仅在将 <code>es2015</code> 用作编译 <code><a href="../api/router/routerlinkwithhref#target">target</a></code> 时才支持差异加载。与高于 <code>es2015</code> 的目标一起使用时，在构建期间会发出警告。

source: Differential loading is supported by default with version 8 and later of the Angular CLI. For each application project in your workspace, you can configure how builds are produced based on the <code>browserslist</code> and <code>tsconfig.json</code> files in your application project.
zh_cn: 默认情况下，Angular CLI版本8和更高版本支持差异加载。对于工作空间中的每个应用程序项目，您可以根据应用程序项目中的 <code>browserslist</code> 和 <code>tsconfig.json</code> 文件配置生成构建的方式。

source: Direct use of the DOM APIs and explicit sanitization calls
zh_cn: 直接使用DOM APIs和明确的净化调用。

source: Directive and component change detection and lifecycle hooks
zh_cn: 指令和组件变化检测和生命周期钩子

source: Directive and component instances have a lifecycle as Angular creates, updates, and destroys them. Developers can tap into key moments in that lifecycle by implementing one or more of the <em>lifecycle hook</em> interfaces in the Angular <code>core</code> library.
zh_cn: 指令实例和组件实例具有生命周期，因为Angular创建，更新和销毁它们。通过在Angular <code>core</code> 库中实现一个或多个<em>生命周期挂钩</em>接口，开发人员可以利用该生命周期中的关键时刻。

source: Directive automatically applied to Angular form controls that sets CSS classes based on control status.
zh_cn: 自动应用于Angular表单控件的指令,根据控件状态设置CSS类。

source: Directive automatically applied to Angular form groups that sets CSS classes based on control status (valid/invalid/dirty/etc).
zh_cn: 自动应用于Angular表单组的指令,根据控件状态(有效/无效/脏/等)设置CSS类。

source: Directive classes, like component classes, can implement <a href="../../guide/lifecycle-hooks">life-cycle hooks</a> to influence their configuration and behavior.
zh_cn: 指令类（如组件类）可以实现<a href="../../guide/lifecycle-hooks">生命周期挂钩，</a>以影响其配置和行为。

source: Directive configuration
zh_cn: 指令配置

source: Directive custom prefix
zh_cn: 指令自定义前缀

source: Directive selectors
zh_cn: 指令选择器

source: Directive spelling
zh_cn: 指导性拼写

source: Directives and binding markup in a component's template modify views based on program data and logic.
zh_cn: 组件模板中的指令和绑定标记根据程序数据和逻辑修改视图。

source: Directives are <a href="../../guide/glossary#declarable">declarables</a>. They must be declared by an NgModule in order to be usable in an app.
zh_cn: 指令是<a href="../../guide/glossary#declarable">declarables</a>。它们必须由NgModule声明才能在应用程序中使用。

source: Directives have lifecycle hooks too. A <code>SpyDirective</code> can log when the element it spies upon is created or destroyed using the <code>ngOnInit</code> and <code>ngOnDestroy</code> hooks.
zh_cn: 指令也有生命周期挂钩。甲 <code>SpyDirective</code> 当元件它在间谍创建或使用破坏可以登录 <code>ngOnInit</code> 和 <code>ngOnDestroy</code> 钩。

source: Directives overview
zh_cn: 指令概述

source: Directives that behave like <code>*<a href="../api/common/ngif">ngIf</a></code> can declare that they want the same treatment by including a static member marker that is a signal to the template compiler to treat them like <code>*<a href="../api/common/ngif">ngIf</a></code>. This static member for <code>*<a href="../api/common/ngif">ngIf</a></code> is:
zh_cn: 行为类似于 <code>*<a href="../api/common/ngif">ngIf</a></code> 的伪指令可以通过包含一个静态成员标记来声明它们希望得到相同的处理，这是向模板编译器发出将其视为 <code>*<a href="../api/common/ngif">ngIf</a></code> 的信号。 <code>*<a href="../api/common/ngif">ngIf</a></code> 的此静态成员为：

source: Directives typically raise custom events with an Angular <a href="../api/core/eventemitter">EventEmitter</a>. The directive creates an <code><a href="../api/core/eventemitter">EventEmitter</a></code> and exposes it as a property. The directive calls <code>EventEmitter.emit(payload)</code> to fire an event, passing in a message payload, which can be anything. Parent directives listen for the event by binding to this property and accessing the payload through the <code>$event</code> object.
zh_cn: 指令通常使用Angular <a href="../api/core/eventemitter">EventEmitter</a>引发自定义事件。该指令创建一个 <code><a href="../api/core/eventemitter">EventEmitter</a></code> 并将其公开为属性。该指令调用 <code>EventEmitter.emit(payload)</code> 触发事件，传递消息有效载荷，可以是任何东西。父指令通过绑定到该属性并通过 <code>$event</code> 对象访问有效负载来监听事件。

source: Directly enables or disables all usage analytics for the user, or prompts the user to set the status interactively, or sets the default status for the project.
zh_cn: 直接启用或禁用用户的所有使用分析,或提示用户交互设置状态,或设置项目的默认状态。

source: Disable Angular's development mode, which turns off assertions and other checks within the framework.
zh_cn: 禁用Angular的开发模式,关闭框架内的断言和其他检查。

source: Disable animations application-wide
zh_cn: 在整个应用程序中禁用动画

source: Disable checking of a binding expression by surrounding the expression in a call to the <a href="template-syntax"><code>$any()</code> cast pseudo-function</a>. The compiler treats it as a cast to the <code>any</code> type just like in TypeScript when a <code>&lt;any&gt;</code> or <code>as any</code> cast is used.
zh_cn: 通过在对<a href="template-syntax"> <code>$any()</code> cast伪函数</a>的调用中包含该表达式来禁用对绑定表达式的检查。编译器将其作为流延到 <code>any</code> 类型就像在打字稿当 <code>&lt;any&gt;</code> 或 <code>as any</code> 铸造被使用。

source: Disable the default XSRF protection.
zh_cn: 禁用默认的XSRF保护。

source: Disable the form&rsquo;s <em>Submit</em> button until the form is valid.
zh_cn: 禁用表单的&ldquo; <em>提交&rdquo;</em>按钮，直到表单有效为止。

source: Disabled controls are exempt from validation checks and are not included in the aggregate value of their ancestor controls.
zh_cn: 被禁用的控件可免于验证检查,并且不包括在其祖先控件的总价值中。

source: Disables Angular tools.
zh_cn: 禁用Angular工具。

source: Disables automatic scroll restoration provided by the browser. See also <a href="https://developers.google.com/web/updates/2015/09/history-api-scroll-restoration">window.history.scrollRestoration info</a>.
zh_cn: 禁用浏览器提供的自动滚动恢复。另请参见<a href="https://developers.google.com/web/updates/2015/09/history-api-scroll-restoration">window.history.scrollRestoration信息</a>。

source: Disables the control. This means the control is exempt from validation checks and excluded from the aggregate value of any parent. Its status is <code>DISABLED</code>.
zh_cn: 禁用控件。这意味着该控件免于进行验证检查，并从任何父级的合计值中排除。其状态为 <code>DISABLED</code> 。

source: Disabling Animations
zh_cn: 禁用动画

source: Disabling all animations
zh_cn: 禁用所有动画

source: Disabling an animation on an HTML element
zh_cn: 禁用HTML元素的动画

source: Disabling type checking using <code>$any()</code>
zh_cn: 使用 <code>$any()</code> 禁用类型检查

source: Disallow <code>local-part</code> (the part before the <code>@</code> symbol) to begin or end with a period (<code>.</code>).
zh_cn: 禁止 <code>local-part</code> （ <code>@</code> 符号前面的部分）以句点（ <code>.</code> ）开头或结尾。

source: Disallow <code>local-part</code> to be longer than 64 characters.
zh_cn: 不允许 <code>local-part</code> 超过64个字符。

source: Disallow the whole address to be longer than 254 characters.
zh_cn: 不允许整个地址超过254个字符。

source: Discard all remaining periodic tasks.
zh_cn: 丢弃所有剩余的定期任务。

source: Disclaimer: The dates are offered as general guidance and may be adjusted by us when necessary to ensure delivery of a high-quality platform.
zh_cn: 免责声明:提供的日期为一般指导,我们可能会在必要时进行调整,以确保交付一个高质量的平台。

source: Display a Heroes List
zh_cn: 显示英雄列表

source: Display additional details about internal operations during execution.
zh_cn: 显示执行过程中内部操作的其他细节。

source: Display the cart items
zh_cn: 显示购物车的项目

source: Display the cart items.
zh_cn: 显示购物车的项目。

source: Display the current status of <code>profileForm</code> using interpolation.
zh_cn: 使用插值显示 <code>profileForm</code> 的当前状态。

source: Display the message from <code>HeroService</code>
zh_cn: 显示 <code>HeroService</code> 的消息

source: Display the new product alert component as a child of the product list.
zh_cn: 将新产品警报组件作为产品列表的子组件显示。

source: Display validation errors to users and enable/disable form controls.
zh_cn: 向用户显示验证错误并启用/禁用表单控件。

source: Displayed text is sometimes supplied as the value of an attribute, rather than the content of tag. For example, if your template has an image with a <code>title</code> attribute, the text value of the <code>title</code> attribute needs to be translated.
zh_cn: 显示的文本有时作为属性的值而不是标签的内容提供。例如，如果你的模板有一个图像 <code>title</code> 属性的文本值 <code>title</code> 属性需要翻译。

source: Displaying Data
zh_cn: 显示数据

source: Displaying a code fragment
zh_cn: 显示代码片段

source: Displaying a form control value
zh_cn: 显示表单控制值

source: Displaying dates, number, percentages, and currencies in a local format.
zh_cn: 以本地格式显示日期、数字、百分比和货币。

source: Displaying form status
zh_cn: 显示表格状态

source: Displaying heroes
zh_cn: 展示英雄

source: Displaying multiple routes in named outlets
zh_cn: 在指定的网点中显示多个途径

source: Displaying the component
zh_cn: 显示组件

source: Displaying the first page quickly can be critical for user engagement. <a href="https://www.thinkwithgoogle.com/marketing-resources/data-measurement/mobile-page-speed-new-industry-benchmarks/">53 percent of mobile site visits are abandoned</a> if pages take longer than 3 seconds to load. Your app may have to launch faster to engage these users before they decide to do something else.
zh_cn: 快速显示首页对于用户参与至关重要。如果网页加载时间超过3秒，<a href="https://www.thinkwithgoogle.com/marketing-resources/data-measurement/mobile-page-speed-new-industry-benchmarks/">将放弃53％的移动网站访问</a>。您的应用可能必须启动得更快，才能吸引这些用户，然后他们才决定做其他事情。

source: Displays DOM sub-trees that match the switch expression value, or failing that, DOM sub-trees that match the switch expression's pluralization category.
zh_cn: 显示与开关表达式值相匹配的DOM子树,如果没有,则显示与开关表达式的复数类别相匹配的DOM子树。

source: Displays a message that the product has been added to the cart
zh_cn: 显示产品已添加到购物车的信息。

source: Displays the application component for the active URL. Manages navigation from one component to the next.
zh_cn: 显示活动URL的应用组件。管理从一个组件到下一个组件的导航。

source: Displays the collection in the order specified by the expression. In this example, the movie title orders the <code>movieList</code>.
zh_cn: 以表达式指定的顺序显示集合。在此示例中，电影标题对 <code>movieList</code> 进行排序。

source: Dispose of running hybrid AngularJS / Angular application.
zh_cn: 处置运行混合型AngularJS/Angular应用。

source: Disposes of the router.
zh_cn: 处置路由器。

source: Dive deeper into the capabilities and advanced feature of the Angular DI system in the following pages:
zh_cn: 在下面的页面中深入了解Angular DI系统的功能和高级特性。

source: Do <em>not</em> declare the following:
zh_cn: 不要<em>不</em>声明如下：

source: Do <em>not</em> reference the <code>userServiceStub</code> object that's provided to the testing module in the body of your test. <strong>It does not work!</strong> The <code>userService</code> instance injected into the component is a completely <em>different</em> object, a clone of the provided <code>userServiceStub</code>.
zh_cn: 千万<em>不能</em>引用 <code>userServiceStub</code> 多数民众赞成提供给测试模块在测试的体对象。<strong>这是行不通的！</strong>注入到组件中的 <code>userService</code> 实例是一个完全<em>不同的</em>对象，是提供的 <code>userServiceStub</code> 的副本。

source: Do a change detection run to make sure there are no pending changes. Throws an exceptions if there are.
zh_cn: 进行一次变更检测,以确保没有待定的变更。如果有,则抛出一个异常。

source: Do a change detection run to make sure there were no changes.
zh_cn: 做一个变化检测运行,以确保没有变化。

source: Do not create a node that is both a <em>header</em> and an <em>item</em> node. That is, do not specify the <code>url</code> property of a <em>header</em> node.
zh_cn: 不要创建既是<em>标题</em>节点又是<em>项目</em>节点的节点。也就是说，请勿指定<em>标头</em>节点的 <code>url</code> 属性。<em></em>

source: Do not depend on this.
zh_cn: 不要依赖这个。

source: Do not import <code><a href="../api/platform-browser/browsermodule">BrowserModule</a></code> in any other module. <em>Feature modules</em> and <em>lazy-loaded modules</em> should import <code><a href="../api/common/commonmodule">CommonModule</a></code> instead. They need the common directives. They don't need to re-install the app-wide providers.
zh_cn: 不要在任何其他模块中导入 <code><a href="../api/platform-browser/browsermodule">BrowserModule</a></code> 。<em>功能模块</em>和<em>延迟加载的模块</em>应改为导入 <code><a href="../api/common/commonmodule">CommonModule</a></code> 。他们需要通用指令。他们不需要重新安装应用程序范围的提供程序。

source: Do not re-configure <code><a href="../api/core/testing/testbed">TestBed</a></code> after calling <code>createComponent</code>.
zh_cn: 调用 <code>createComponent</code> 后不要重新配置 <code><a href="../api/core/testing/testbed">TestBed</a></code> 。

source: Do not re-configure the <code><a href="../api/core/testing/testbed">TestBed</a></code> after calling <code>compileComponents()</code>.
zh_cn: 调用 <code>compileComponents()</code> 之后，请勿重新配置 <code><a href="../api/core/testing/testbed">TestBed</a></code> 。

source: Do not refer to ambient types in metadata expressions.
zh_cn: 不要在元数据表达式中引用环境类型。

source: Do not retry <strong>authentication</strong> requests, since these should only be initiated by user action. We don't want to lock out user accounts with repeated login requests that the user has not initiated.
zh_cn: 不要重试<strong>身份验证</strong>请求，因为这些请求只能由用户操作启动。我们不希望因用户尚未发起的重复登录请求而锁定用户帐户。

source: Do not use <code><a href="createangularjstestingmodule">createAngularJSTestingModule</a></code> in the same spec as <code><a href="createangulartestingmodule">createAngularTestingModule</a></code>.
zh_cn: 不要在与 <code><a href="createangularjstestingmodule">createAngularJSTestingModule</a></code> 相同的规范中使用 <code><a href="createangulartestingmodule">createAngularTestingModule</a></code> 。

source: Do not use <code><a href="createangulartestingmodule">createAngularTestingModule</a></code> in the same spec as <code><a href="createangularjstestingmodule">createAngularJSTestingModule</a></code>.
zh_cn: 不要在与 <code><a href="createangulartestingmodule">createAngularTestingModule</a></code> 相同的规范中使用 <code><a href="createangularjstestingmodule">createAngularJSTestingModule</a></code> 。

source: Do not use the real path when resolving modules.
zh_cn: 解析模块时不要使用真实路径。

source: Do not use this in a production server environment. Use pre-compiled <a href="../core/ngmodulefactory"><code>NgModuleFactory</code></a> with <a href="rendermodulefactory"><code>renderModuleFactory</code></a> instead.
zh_cn: 不要在生产服务器环境中使用它。而是将预编译的<a href="../core/ngmodulefactory"> <code>NgModuleFactory</code> </a>与<a href="rendermodulefactory"> <code>renderModuleFactory</code> </a>一起使用。

source: Do this only in the beginning to avoid accidentally deleting your own tests and git setup!
zh_cn: 只有在开始的时候才这样做,以避免不小心删除自己的测试和git设置!

source: Do this with the <code><a href="../api/service-worker/swupdate#checkForUpdate">checkForUpdate()</a></code> method:
zh_cn: 使用 <code><a href="../api/service-worker/swupdate#checkForUpdate">checkForUpdate()</a></code> 方法执行此操作：

source: Do you need a <code>Routing Module</code>?
zh_cn: 您是否需要一个 <code>Routing Module</code> ？

source: Doc generation and tooling
zh_cn: 文件生成和工具

source: Documentation for using Bazel for frontend projects is linked from <a href="https://docs.bazel.build/versions/master/bazel-and-javascript.html">https://docs.bazel.build/versions/master/bazel-and-javascript.html</a>.
zh_cn: 从<a href="https://docs.bazel.build/versions/master/bazel-and-javascript.html">https://docs.bazel.build/versions/master/bazel-and-javascript.html</a>链接了将Bazel用于前端项目的文档。

source: Does <strong>not</strong> declare components.
zh_cn: 难道<strong>不</strong>声明组件。

source: Does NOT alter text nodes inside HTML tags such as <code>&lt;pre&gt;</code> or <code>&lt;<a href="../forms/defaultvalueaccessor">textarea</a>&gt;</code>, where whitespace characters are significant.
zh_cn: 请勿更改HTML标记内的文本节点，例如 <code>&lt;pre&gt;</code> 或 <code>&lt;<a href="../forms/defaultvalueaccessor">textarea</a>&gt;</code> ，其中空格字符很重要。

source: Does not retrieve elements or directives that are in other components' templates, since a component's template is always a black box to its ancestors.
zh_cn: 不检索其他组件模板中的元素或指令,因为一个组件的模板对其祖先来说总是一个黑盒子。

source: Does not support configuration.
zh_cn: 不支持配置。

source: Does not support parent-child relationship selectors.
zh_cn: 不支持父子关系选择器。

source: Doing so adds clarity to the code. But it's not technically necessary. Although <code>AlexComponent</code> has a <code>name</code> property, as required by its <code>Base</code> class, its class signature doesn't mention <code>Parent</code>.
zh_cn: 这样做可以使代码更加清晰。但这在技术上不是必需的。尽管 <code>AlexComponent</code> 具有其 <code>Base</code> 类要求的 <code>name</code> 属性，但其类签名未提及 <code>Parent</code> 。

source: Doing this could break lazy-loading into currently running apps, especially if the lazy-loaded chunks use filenames with hashes, which change every version.
zh_cn: 这样做可能会破坏当前正在运行的应用程序的懒加载,特别是如果懒加载的块使用带有哈希的文件名,而哈希的文件名每个版本都会改变。

source: DomSanitizer helps preventing Cross Site Scripting Security bugs (XSS) by sanitizing values to be safe to use in the different DOM contexts.
zh_cn: DomSanitizer有助于防止跨站点脚本安全漏洞(XSS),通过对值进行消毒,使其在不同的DOM上下文中安全使用。

source: Domain feature modules are typically imported exactly once by a larger feature module.
zh_cn: 领域功能模块一般由一个较大的功能模块精确导入一次。

source: Domain feature modules consist mostly of declarations. Only the top component is exported.
zh_cn: 领域功能模块主要由声明组成。只有顶部组件被导出。

source: Domain feature modules deliver a user experience dedicated to a particular application domain like editing a customer or placing an order.
zh_cn: 领域功能模块提供专门针对特定应用领域的用户体验,如编辑客户或下订单。

source: Domain feature modules rarely have providers. When they do, the lifetime of the provided services should be the same as the lifetime of the module.
zh_cn: 领域功能模块很少有提供者。如果有的话,所提供的服务的寿命应该与模块的寿命相同。

source: Domain feature modules.
zh_cn: 域功能模块。

source: Domain-specific libraries
zh_cn: 特定领域图书馆

source: Don&rsquo;t send a request if the value stays the same (rapidly hit a character, then backspace, for instance).
zh_cn: 如果值保持不变（例如，先击中一个字符，然后按退格键），则不要发送请求。

source: Don't ascend to ancestors of the node requesting injection.
zh_cn: 不要上升到请求注入的节点的祖先。
