Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/angular/angular.*.006.xlf
Languages: es, ja, ko, ru, zh_cn

source: For example, server-side applications can't reference browser-only global objects such as <code>window</code>, <code><a href="../api/platform-server/platformconfig#document">document</a></code>, <code>navigator</code>, or <code>location</code>.
zh_cn: 例如，服务器端应用程序不能引用仅浏览器的全局对象，例如 <code>window</code> ， <code><a href="../api/platform-server/platformconfig#document">document</a></code> ， <code>navigator</code> 或 <code>location</code> 。

source: For example, suppose <code>HeroService</code> must hide <em>secret</em> heroes from normal users. Only authorized users should see secret heroes.
zh_cn: 例如，假设 <code>HeroService</code> 必须向普通用户隐藏<em>秘密</em>英雄。只有授权用户才能看到秘密英雄。

source: For example, suppose you have a library named <code>d3</code>:
zh_cn: 例如，假设您有一个名为 <code>d3</code> 的库：

source: For example, suppose you want the code base to have a minimum of 80% code coverage. To enable this, open the <a href="https://karma-runner.github.io">Karma</a> test platform configuration file, <code>karma.conf.js</code>, and add the following in the <code>coverageIstanbulReporter:</code> key.
zh_cn: 例如，假设您希望代码库的代码覆盖率至少为80％。为此，请打开<a href="https://karma-runner.github.io">Karma</a>测试平台配置文件 <code>karma.conf.js</code> ，然后在 <code>coverageIstanbulReporter:</code> 键中添加以下内容。

source: For example, suppose you want to update the Angular Material library.
zh_cn: 例如,假设你想更新Angular Material库。

source: For example, the "serve" target for a newly generated app has a predefined alternate configuration named "production".
zh_cn: 例如,新生成的应用程序的 "服务 "目标有一个预定义的备用配置,名为 "生产"。

source: For example, the <a href="https://material.angular.io/guide/schematics"><code>@angular/material</code></a> schematic tells the <code>add</code> command to install and set up Angular Material and theming, and register new starter components that can be created with <code>ng generate</code>. You can look at this one as an example and model for your own add schematic.
zh_cn: 例如，<a href="https://material.angular.io/guide/schematics"> <code>@angular/material</code> </a>示意图告诉 <code>add</code> 命令安装和设置Angular Material和主题化，并注册可以使用 <code>ng generate</code> 创建的新的入门组件。您可以将此示例作为示例，并为自己的添加原理图建模。

source: For example, the Architect builder invoked by the <code>ng build</code> command to compile a project uses a particular build tool, and has a default configuration whose values can be overridden on the command line. The <code>build</code> target also defines an alternate configuration for a "production" build, that can be invoked with the <code>--prod</code> flag on the <code>build</code> command.
zh_cn: 例如，由 <code>ng build</code> 命令调用的Architect构建器使用特定的构建工具来编译项目，并且具有默认配置，其值可以在命令行上覆盖。的 <code>build</code> 目标还定义了&ldquo;生产&rdquo;的构建，可以与被调用的备用配置 <code>--prod</code> 所述标志 <code>build</code> 指令。

source: For example, the collector can evaluate the expression <code>1 + 2 + 3 + 4</code> and replace it with the result, <code>10</code>. This process is called <em>folding</em>. An expression that can be reduced in this manner is <em>foldable</em>.
zh_cn: 例如，收集器可以计算表达式 <code>1 + 2 + 3 + 4</code> 并将其替换为结果 <code>10</code> 。这个过程称为<em>折叠</em>。可以这种方式还原的表达式是<em>可折叠的</em>。

source: For example, the component might render first on the server as part of a strategy to make the application launch faster on poorly connected devices. The server-side renderer might not support the full HTML element API. If it doesn't support <code>querySelector</code>, the previous test could fail.
zh_cn: 例如，作为使应用程序在连接不良的设备上更快启动的策略的一部分，组件可能首先在服务器上呈现。服务器端渲染器可能不支持完整的HTML元素API。如果它不支持 <code>querySelector</code> ，则先前的测试可能会失败。

source: For example, the default asset paths can be represented in more detail using the following objects.
zh_cn: 例如,可以使用以下对象更详细地表示默认资产路径。

source: For example, the following CLI command generates a <code>BannerComponent</code> in the <code>app/banner</code> folder (with inline template and styles):
zh_cn: 例如，以下CLI命令在 <code>app/banner</code> 文件夹（带有内联模板和样式）中生成 <code>BannerComponent</code> ：

source: For example, the following command automatically deploys a project to Firebase.
zh_cn: 例如,以下命令会自动将一个项目部署到Firebase。

source: For example, the following command generates an NgModule that can use routing.
zh_cn: 例如,下面的命令会生成一个可以使用路由的NgModule。

source: For example, the string "1s 100ms ease-out" specifies a duration of 1000 milliseconds, and delay of 100 ms, and the "ease-out" easing style, which decelerates near the end of the duration.
zh_cn: 例如,字符串 "1s 100ms eas-out "指定持续时间为1000毫秒,延迟时间为100毫秒,采用 "ease-out "的缓和方式,在持续时间接近尾声时减速。

source: For example, the string <code>3d12h</code> will cache content for up to three and a half days.
zh_cn: 例如，字符串 <code>3d12h</code> 将最多缓存三天半的内容。

source: For example, the string <code>5s30u</code> will translate to five seconds and 30 milliseconds of network timeout.
zh_cn: 例如，字符串 <code>5s30u</code> 将转换为5秒钟和30毫秒的网络超时。

source: For example, to create an observable equivalent to the <code>of(1, 2, 3)</code> above, you could do something like this:
zh_cn: 例如，要创建与上述 <code>of(1, 2, 3)</code> 等效的可观察对象，可以执行以下操作：

source: For example, to get a <code>name</code> control nested within a <code>person</code> sub-group:
zh_cn: 例如，要获得嵌套在 <code>person</code> 子组中的 <code>name</code> 控件，请执行以下操作：

source: For example, to use the <a href="https://getbootstrap.com/docs/4.0/getting-started/introduction/">Bootstrap 4</a> library, first install the library and its dependencies using the npm package manager:
zh_cn: 例如，要使用<a href="https://getbootstrap.com/docs/4.0/getting-started/introduction/">Bootstrap 4</a>库，请首先使用npm软件包管理器安装该库及其依赖项：

source: For example, when binding a URL in an <code>&lt;<a href="../router/routerlinkwithhref">a</a> [href]="someValue"&gt;</code> hyperlink, <code>someValue</code> will be sanitized so that an attacker cannot inject e.g. a <code>javascript:</code> URL that would execute code on the website.
zh_cn: 例如，在一个结合一个URL时 <code>&lt;<a href="../router/routerlinkwithhref">a</a> [href]="someValue"&gt;</code> 超链接， <code>someValue</code> 中将这样消毒，攻击者不能注入例如 <code>javascript:</code> 将在网站上执行的代码的URL。

source: For example, when bootstrapping an application, you can register many initializers using the same token.
zh_cn: 例如,当引导一个应用程序时,你可以使用同一个标记注册许多初始化器。

source: For example, you can create a new <code>HeroListComponent</code> with a mock service that you can manipulate under test.
zh_cn: 例如，您可以创建一个带有模拟服务的新 <code>HeroListComponent</code> ，您可以在测试下对其进行操作。

source: For example, you can use the following built-in tokens as hooks into the framework&rsquo;s bootstrapping and initialization process. A provider object can associate any of these injection tokens with one or more callback functions that take app-specific initialization actions.
zh_cn: 例如，您可以使用以下内置标记作为挂钩到框架的引导和初始化过程。提供者对象可以将这些注入令牌中的任何一个与一个或多个采取特定于应用程序的初始化操作的回调函数相关联。

source: For example, you cannot write something like this:
zh_cn: 例如,你不能写这样的东西。

source: For example, you could have an expression that invoked a property or method that had side effects. The expression could call something like <code>getFoo()</code> where only you know what <code>getFoo()</code> does. If <code>getFoo()</code> changes something and you happen to be binding to that something, Angular may or may not display the changed value. Angular may detect the change and throw a warning error. As a best practice, stick to properties and to methods that return values and avoid side effects.
zh_cn: 例如，您可能有一个表达式，该表达式调用了具有副作用的属性或方法。该表达式可以调用类似 <code>getFoo()</code> 的方法，只有您知道 <code>getFoo()</code> 的作用。如果 <code>getFoo()</code> 更改了某个内容，而您恰巧绑定到该内容，则Angular可能会或可能不会显示更改后的值。Angular可能会检测到更改并抛出警告错误。最佳做法是坚持使用属性和返回值并避免副作用的方法。

source: For example, you may have defined a class and used it as an injection token in a providers array but neglected to export that class.
zh_cn: 例如,您可能已经定义了一个类,并将其用作提供者数组中的注入令牌,但忽略了导出该类。

source: For example, you may have set a providers <code><a href="../api/core/factorysansprovider#useFactory">useFactory</a></code> property to a locally defined function that you neglected to export.
zh_cn: 例如，您可能已将提供程序 <code><a href="../api/core/factorysansprovider#useFactory">useFactory</a></code> 属性设置为忽略导出的本地定义函数。

source: For example, you might decide to cache certain requests and responses to improve performance. You can delegate caching to an interceptor without disturbing your existing data services.
zh_cn: 例如,您可能决定缓存某些请求和响应以提高性能。您可以将缓存委托给拦截器,而不会干扰您现有的数据服务。

source: For example, you might have an Angular service called <code>Heroes</code>:
zh_cn: 例如，您可能有一个名为 <code>Heroes</code> 的Angular服务：

source: For example:
zh_cn: 例如:

source: For filtering flying heroes, consider an <em>impure pipe</em>.
zh_cn: 为了过滤飞行英雄，请考虑使用<em>不纯净的烟斗</em>。

source: For full details of these and other tools, see the <a href="https://material.angular.io/cdk/a11y/overview">Angular CDK accessibility overview</a>.
zh_cn: 有关这些工具和其他工具的完整详细信息，请参见<a href="https://material.angular.io/cdk/a11y/overview">Angular CDK可访问性概述</a>。

source: For further details, see <a href="../guide/workspace-config">Workspace Configuration</a>.
zh_cn: 有关更多详细信息，请参见<a href="../guide/workspace-config">工作区配置</a>。

source: For help with individual commands, use the <code>--help</code> or <code>-h</code> option with the command.
zh_cn: 要获得有关单个命令的帮助，请在命令中使用 <code>--help</code> 或 <code>-h</code> 选项。

source: For hypothetical examples such as illustrations of configuration options in a JSON file, you should still use The <code>&lt;code-example&gt;</code> tag with the <code>header</code> attribute to identify the context.
zh_cn: 对于诸如JSON文件中的配置选项之类的假设示例，您仍应将 <code>&lt;code-example&gt;</code> 标记与 <code>header</code> 属性一起使用以标识上下文。

source: For information about CSRF at the Open Web Application Security Project (OWASP), see <a href="https://www.owasp.org/index.php/Cross-Site_Request_Forgery_%28CSRF%29">Cross-Site Request Forgery (CSRF)</a> and <a href="https://www.owasp.org/index.php/CSRF_Prevention_Cheat_Sheet">Cross-Site Request Forgery (CSRF) Prevention Cheat Sheet</a>. The Stanford University paper <a href="https://seclab.stanford.edu/websec/csrf/csrf.pdf">Robust Defenses for Cross-Site Request Forgery</a> is a rich source of detail.
zh_cn: 有关开放Web应用程序安全项目（OWASP）上CSRF的信息，请参阅<a href="https://www.owasp.org/index.php/Cross-Site_Request_Forgery_%28CSRF%29">跨站点请求伪造（CSRF）</a>和<a href="https://www.owasp.org/index.php/CSRF_Prevention_Cheat_Sheet">跨站点请求伪造（CSRF）预防备忘单</a>。斯坦福大学的论文<a href="https://seclab.stanford.edu/websec/csrf/csrf.pdf">《跨站点请求伪造的鲁棒防御》提供</a>了大量详细信息。

source: For information about how the Angular CLI handles packages see the following guides:
zh_cn: 关于Angular CLI如何处理包的信息,请参见以下指南。

source: For information about our versioning policy and practices&mdash;including support and deprecation practices, as well as the release schedule&mdash;see <a href="releases">Angular versioning and releases</a>.
zh_cn: 有关我们的版本控制政策和实践（包括支持和弃用实践以及发布计划）的信息，请参阅<a href="releases">Angular版本和发布</a>。

source: For instance <code>['/team', teamId, 'user', userName, {details: true}]</code> means that we want to generate a link to <code>/team/11/user/bob;details=true</code>.
zh_cn: 例如 <code>['/team', teamId, 'user', userName, {details: true}]</code> 意味着我们要生成到 <code>/team/11/user/bob;details=true</code> 的链接。

source: For instance, <code><a href="forwardref">forwardRef</a></code> is used when the <code>token</code> which we need to refer to for the purposes of DI is declared, but not yet defined. It is also used when the <code>token</code> which we use when creating a query is not yet defined.
zh_cn: 例如，当声明需要为DI引用的 <code>token</code> 但尚未定义该令牌时，将使用 <code><a href="forwardref">forwardRef</a></code> 。当尚未创建创建查询时使用的 <code>token</code> 时，也可以使用它。

source: For instance, <code><a href="hashlocationstrategy">HashLocationStrategy</a></code> produces URLs like <code><a href="http://example.com#/foo">http://example.com#/foo</a></code>, and <code><a href="pathlocationstrategy">PathLocationStrategy</a></code> produces <code><a href="http://example.com/foo">http://example.com/foo</a></code> as an equivalent URL.
zh_cn: 例如， <code><a href="hashlocationstrategy">HashLocationStrategy</a></code> 产生类似 <code><a href="http://example.com#/foo">http://example.com#/foo</a></code> 的 URL ，而 <code><a href="pathlocationstrategy">PathLocationStrategy</a></code> 产生 <code><a href="http://example.com/foo">http://example.com/foo</a></code> 作为等效URL。

source: For instance, if the current url is <code>/user/(box//aux:team)</code>.
zh_cn: 例如，如果当前网址是 <code>/user/(box//aux:team)</code> 。

source: For instance, if you call <code>location.go('/foo')</code>, the browser's URL will become <code>example.com#/foo</code>.
zh_cn: 例如，如果您调用 <code>location.go('/foo')</code> ，则浏览器的URL将变为 <code>example.com#/foo</code> 。

source: For instance, if you provide an <code><a href="app_base_href">APP_BASE_HREF</a></code> of <code>'/my/app'</code> and call <code>location.go('/foo')</code>, the browser's URL will become <code>example.com/my/app/foo</code>.
zh_cn: 举例来说，如果你提供了一个 <code><a href="app_base_href">APP_BASE_HREF</a></code> 的 <code>'/my/app'</code> 和呼叫 <code>location.go('/foo')</code> ，浏览器的网址将成为 <code>example.com/my/app/foo</code> 。

source: For instance, in the phone detail component spec, you can use ES2015 features like arrow functions and block-scoped variables and benefit from the type definitions of the AngularJS services you're consuming:
zh_cn: 例如,在手机细节组件规范中,你可以使用ES2015的功能,如箭头函数和块范围变量,并从你所消费的AngularJS服务的类型定义中获益。

source: For instance, suppose you have an observable that makes an API request and maps to the response from the server. If the server returns an error or the value doesn&rsquo;t exist, an error is produced. If you catch this error and supply a default value, your stream continues to process values rather than erroring out.
zh_cn: 例如，假设您有一个可观察的对象，它发出一个API请求并映射到服务器的响应。如果服务器返回错误或该值不存在，则会产生错误。如果发现此错误并提供默认值，则流将继续处理值而不是出错。

source: For instance, to install typings for <code>jasmine</code> you run <code>npm install @types/jasmine --save-dev</code>.
zh_cn: 例如，要安装 <code>jasmine</code> <code>npm install @types/jasmine --save-dev</code> 请运行npm install @ types / jasmine --save-dev。

source: For loading the details of a single phone into the phone detail component.
zh_cn: 用于将单个手机的详细信息加载到手机详细信息组件中。

source: For loading the list of all phones into the phone list component.
zh_cn: 用于将所有电话的列表加载到电话列表组件中。

source: For localization, you can use the <a href="cli">Angular CLI</a> to generate most of the boilerplate necessary to create files for translators, and to publish your app in multiple languages. After you have set up your app to use i18n, the CLI can help you with the following steps:
zh_cn: 对于本地化，您可以使用<a href="cli">Angular CLI</a>生成为翻译器创建文件并以多种语言发布应用程序所需的大部分样板。设置好应用程序以使用i18n后，CLI可以帮助您完成以下步骤：

source: For more about how the <code>ng <a href="../api/forms/ngmodel#update">update</a></code> command works, see <a href="https://github.com/angular/angular-cli/blob/master/docs/specifications/update.md">Update Command</a>.
zh_cn: 有关 <code>ng <a href="../api/forms/ngmodel#update">update</a></code> 命令如何工作的更多信息，请参见<a href="https://github.com/angular/angular-cli/blob/master/docs/specifications/update.md">Update Command</a>。

source: For more detail on how these work, see the previous sections on <a href="template-syntax#input">Input</a> and <a href="template-syntax#output">Output</a>. To see it in action, see the <span name="inputs-outputs">Inputs and Outputs Example</span>.
zh_cn: 有关这些工作原理的更多详细信息，请参见前面关于<a href="template-syntax#input">Input</a>和<a href="template-syntax#output">Output的部分</a>。要查看它的实际效果，请参见<span name="inputs-outputs">Inputs and Outputs示例</span>。

source: For more detail, including how to build your own custom directives, see <a href="attribute-directives">Attribute Directives</a> and <a href="structural-directives">Structural Directives</a>.
zh_cn: 有关更多详细信息（包括如何构建自己的自定义指令），请参见<a href="attribute-directives">属性指令</a>和<a href="structural-directives">结构指令</a>。

source: For more detailed information on services, see the <a href="../tutorial/toh-pt4">Services</a> chapter of the <a href="tutorial">Tour of Heroes tutorial</a>.
zh_cn: 有关服务的更多详细信息，请参阅《<a href="tutorial">英雄</a>之旅》教程的&ldquo; <a href="../tutorial/toh-pt4">服务&rdquo;</a>一章。

source: For more detailed information, see the <a href="dependency-injection">Dependency Injection</a> section.
zh_cn: 有关更多详细信息，请参见&ldquo; <a href="dependency-injection">依赖关系注入&rdquo;</a>部分。

source: For more details about how to create scripts to generate an app in multiple languages and how to set up Apache 2 and NGINX to serve them from different subdirectories, read <a href="https://dev.to/angular/deploying-an-i18n-angular-app-with-angular-cli-2fb9">this tutorial by Philippe Martin</a>.
zh_cn: 有关如何创建脚本以使用多种语言生成应用程序以及如何设置Apache 2和NGINX以从不同子目录为它们提供服务的更多详细信息，请阅读<a href="https://dev.to/angular/deploying-an-i18n-angular-app-with-angular-cli-2fb9">Philippe Martin的本教程</a>。

source: For more details of what these look like and how to create them, see:
zh_cn: 更多关于这些东西的样子和如何创建它们的细节,请看。

source: For more details on how a library project is structured you can refer the <a href="file-structure#library-project-files">Library Project Files</a>
zh_cn: 有关库项目的结构的更多详细信息，您可以参考<a href="file-structure#library-project-files">库项目文件</a>

source: For more details on how to use <code><a href="downgrademodule">downgradeModule</a>()</code> see <a href="../../../guide/upgrade-performance">Upgrading for Performance</a>.
zh_cn: 有关如何使用 <code><a href="downgrademodule">downgradeModule</a>()</code> 的更多详细信息，请参见<a href="../../../guide/upgrade-performance">性能提升</a>。

source: For more details, see the <a href="../../guide/dependency-injection">"Dependency Injection Guide"</a>.
zh_cn: 有关更多详细信息，请参见<a href="../../guide/dependency-injection">&ldquo;依赖项注入指南&rdquo;</a>。

source: For more details, see the <a href="https://developer.mozilla.org/en-US/docs/Web/API/HTMLTableCellElement">MDN HTMLTableCellElement</a> documentation.
zh_cn: 有关更多详细信息，请参见<a href="https://developer.mozilla.org/en-US/docs/Web/API/HTMLTableCellElement">MDN HTMLTableCellElement</a>文档。

source: For more in-depth information on the implementation, see the <a href="https://github.com/angular/angular/blob/master/packages/language-service/src/types.ts">Angular Language Service API</a>.
zh_cn: 有关实现的更多详细信息，请参阅<a href="https://github.com/angular/angular/blob/master/packages/language-service/src/types.ts">Angular Language Service API</a>。

source: For more information about Angular browser support, see <a href="browser-support">Browser Support</a>.
zh_cn: 有关Angular浏览器支持的更多信息，请参见<a href="browser-support">浏览器支持</a>。

source: For more information about Unicode locale identifiers, see the <a href="http://cldr.unicode.org/core-spec#Unicode_Language_and_Locale_Identifiers">CLDR core spec</a>.
zh_cn: 有关Unicode语言环境标识符的更多信息，请参阅<a href="http://cldr.unicode.org/core-spec#Unicode_Language_and_Locale_Identifiers">CLDR核心规范</a>。

source: For more information about browser support, see the <a href="https://developers.google.com/web/fundamentals/primers/service-workers/#browser_support">browser support</a> section of <a href="https://developers.google.com/web/fundamentals/primers/service-workers/">Service Workers: an Introduction</a>, Jake Archibald's <a href="https://jakearchibald.github.io/isserviceworkerready/">Is Serviceworker ready?</a>, and <a href="http://caniuse.com/#feat=serviceworkers">Can I Use</a>.
zh_cn: 有关浏览器支持的更多信息，请参见<a href="https://developers.google.com/web/fundamentals/primers/service-workers/">Service Workers：Introduction</a>的<a href="https://developers.google.com/web/fundamentals/primers/service-workers/#browser_support">浏览器支持</a>部分，Jake Archibald的<a href="https://jakearchibald.github.io/isserviceworkerready/">《 Serviceworker准备好了吗？</a>，<a href="http://caniuse.com/#feat=serviceworkers">我可以使用</a>。

source: For more information about components and how they interact with templates, see <a href="guide/architecture-components">Introduction to Components</a>.
zh_cn: 有关组件以及它们如何与模板交互的更多信息，请参见<a href="guide/architecture-components">《组件简介》</a>。

source: For more information about how Google handles security issues, see <a href="https://www.google.com/about/appsecurity/">Google's security philosophy</a>.
zh_cn: 有关Google如何处理安全问题的更多信息，请参阅<a href="https://www.google.com/about/appsecurity/">Google的安全理念</a>。

source: For more information about polyfills, see <a href="https://www.webcomponents.org/polyfills">polyfill documentation</a>.
zh_cn: 有关polyfill的更多信息，请参见<a href="https://www.webcomponents.org/polyfills">polyfill文档</a>。

source: For more information about rules and utility methods, see <a href="https://github.com/angular/angular-cli/tree/master/packages/angular_devkit/schematics#provided-rules">Provided Rules</a>.
zh_cn: 有关规则和实用程序方法的更多信息，请参见<a href="https://github.com/angular/angular-cli/tree/master/packages/angular_devkit/schematics#provided-rules">提供的规则</a>。

source: For more information about service workers in general, see <a href="https://developers.google.com/web/fundamentals/primers/service-workers/">Service Workers: an Introduction</a>.
zh_cn: 有关一般服务人员的更多信息，请参阅《<a href="https://developers.google.com/web/fundamentals/primers/service-workers/">服务人员：简介》</a>。

source: For more information about template input variables, see <a href="structural-directives#template-input-variable">Structural Directives</a>.
zh_cn: 有关模板输入变量的更多信息，请参见《<a href="structural-directives#template-input-variable">结构指令》</a>。

source: For more information about the Angular files generated by <code>ng new</code>, see <a href="file-structure">Workspace and Project File Structure</a>.
zh_cn: 有关 <code>ng new</code> 生成的Angular文件的更多信息，请参见<a href="file-structure">工作区和项目文件结构</a>。

source: For more information about the attacks and mitigations described below, see <a href="https://www.owasp.org/index.php/Category:OWASP_Guide_Project">OWASP Guide Project</a>.
zh_cn: 有关下面描述的攻击和缓解措施的更多信息，请参见《<a href="https://www.owasp.org/index.php/Category:OWASP_Guide_Project">OWASP指南项目》</a>。

source: For more information about the full capabilities of Angular's template syntax, see <a href="guide/template-syntax">Template Syntax</a>.
zh_cn: 有关Angular模板语法的全部功能的更多信息，请参见<a href="guide/template-syntax">模板语法</a>。

source: For more information about using <code>@angular/common/<a href="../api/common/http">http</a></code>, see the <a href="http">HttpClient guide</a>.
zh_cn: 有关使用 <code>@angular/common/<a href="../api/common/http">http</a></code> 更多信息，请参见<a href="http">HttpClient指南</a>。

source: For more information on <code><a href="../api/common/ngif">NgIf</a></code> and <code><a href="../api/common/ngif#ngIfElse">ngIfElse</a></code>, see the <a href="../api/common/ngif">API documentation about NgIf</a>.
zh_cn: 有关 <code><a href="../api/common/ngif">NgIf</a></code> 和 <code><a href="../api/common/ngif#ngIfElse">ngIfElse</a></code> 的更多信息，请参阅<a href="../api/common/ngif">有关NgIf</a>的API文档。

source: For more information on <code>ngOnInit()</code>, see <a href="../guide/lifecycle-hooks">Lifecycle hooks</a>.
zh_cn: 有关 <code>ngOnInit()</code> 的更多信息，请参见<a href="../guide/lifecycle-hooks">生命周期挂钩</a>。

source: For more information on Angular dependency injection, see the <a href="dependency-injection-providers">DI Providers</a> and <a href="dependency-injection-in-action">DI in Action</a> guides.
zh_cn: 有关Angular依赖项注入的更多信息，请参见<a href="dependency-injection-providers">DI提供程序</a>和<a href="dependency-injection-in-action">Action</a>指南中的DI。

source: For more information on JavaScript modules, see <a href="https://hacks.mozilla.org/2015/08/es6-in-depth-modules/">JavaScript/ECMAScript modules</a>.
zh_cn: 有关JavaScript模块的更多信息，请参见<a href="https://hacks.mozilla.org/2015/08/es6-in-depth-modules/">JavaScript / ECMAScript模块</a>。

source: For more information on NgModules, see:
zh_cn: 关于NgModules的更多信息,请参见。
