Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/angular/angular.*.006.xlf
Languages: es, ja, ko, ru, zh_cn

source: Don't bother re-exporting pure service modules. Pure service modules don't export <a href="bootstrapping#the-declarations-array">declarable</a> classes that another NgModule could use. For example, there's no point in re-exporting <code><a href="../api/common/http/httpclientmodule">HttpClientModule</a></code> because it doesn't export anything. Its only purpose is to add http service providers to the application as a whole.
zh_cn: 不要麻烦重新导出纯服务模块。纯服务模块不出口<a href="bootstrapping#the-declarations-array">申报</a>类，另一个NgModule可以使用。例如，重新导出 <code><a href="../api/common/http/httpclientmodule">HttpClientModule</a></code> 没有意义，因为它不导出任何内容。其唯一目的是将http服务提供者整体添加到应用程序中。

source: Don't declare the following:
zh_cn: 不要申报以下内容。

source: Don't do that here. If the <code><a href="../api/router/route#pathMatch">pathMatch</a></code> value were <code>'prefix'</code>, <em>every</em> URL would match <code>''</code>.
zh_cn: 不要在这里做。如果 <code><a href="../api/router/route#pathMatch">pathMatch</a></code> 值为 <code>'prefix'</code> ，则<em>每个</em> URL都将匹配 <code>''</code> 。

source: Don't eagerly import something from a lazy-loaded module
zh_cn: 不要急于从一个懒惰加载的模块中导入一些东西

source: Don't export the following:
zh_cn: 不要输出以下内容。

source: Don't fetch data in a component constructor. You shouldn't worry that a new component will try to contact a remote server when created under test or before you decide to display it. Constructors should do no more than set the initial local variables to simple values.
zh_cn: 不要在组件构造函数中获取数据。你不应该担心一个新的组件在测试中创建时或在你决定显示它之前会试图联系远程服务器。构造函数应该做的只是将初始的本地变量设置为简单的值。

source: Don't forget the asterisk (*) in front of <code><a href="../api/common/ngforof">ngFor</a></code>. It's a critical part of the syntax.
zh_cn: 不要忘记 <code><a href="../api/common/ngforof">ngFor</a></code> 前面的星号（*）。这是语法的关键部分。

source: Don't forget the asterisk (*) in front of <code><a href="../api/common/ngif">ngIf</a></code>. It's a critical part of the syntax.
zh_cn: 不要忘记 <code><a href="../api/common/ngif">ngIf</a></code> 前面的星号（*）。这是语法的关键部分。

source: Don't forget the asterisk (<code>*</code>) in front of <code><a href="../api/common/ngif">ngIf</a></code>. For more information on the asterisk, see the <a href="structural-directives#the-asterisk--prefix">asterisk (*) prefix</a> section of <a href="structural-directives">Structural Directives</a>.
zh_cn: 不要忘了 <code><a href="../api/common/ngif">ngIf</a></code> 前面的星号（ <code>*</code> ）。有关星号的更多信息，请参见《<a href="structural-directives">结构指令》中</a>的<a href="structural-directives#the-asterisk--prefix">星号（*）前缀</a>部分。

source: Don't forget the leading asterisk (*) in <code>*<a href="../api/common/ngforof">ngFor</a></code>. It is an essential part of the syntax. For more information, see the <a href="template-syntax#ngFor">Template Syntax</a> page.
zh_cn: 不要忘记 <code>*<a href="../api/common/ngforof">ngFor</a></code> 中的前导星号（*）。它是语法的重要组成部分。有关更多信息，请参见<a href="template-syntax#ngFor">模板语法</a>页面。

source: Don't forget the leading asterisk (*) in <code>*<a href="../api/common/ngif">ngIf</a></code>. It is an essential part of the syntax. Read more about <code><a href="../api/common/ngif">ngIf</a></code> and <code>*</code> in the <a href="template-syntax#ngIf">ngIf section</a> of the <a href="template-syntax">Template Syntax</a> page.
zh_cn: 不要忘记 <code>*<a href="../api/common/ngif">ngIf</a></code> 中的前导星号（*）。它是语法的重要组成部分。在<a href="template-syntax">模板语法</a>页面的<a href="template-syntax#ngIf">ngIf部分</a>中阅读有关 <code><a href="../api/common/ngif">ngIf</a></code> 和 <code>*</code> 的更多信息。

source: Don't prefix <code>output</code> properties
zh_cn: 不要为 <code>output</code> 属性添加前缀

source: Don't provide any template or style encapsulation.
zh_cn: 不要提供任何模板或样式封装。

source: Don't verify connected clients are part of allowed hosts.
zh_cn: 不要验证连接的客户端是否属于允许的主机。

source: Down the road, you can inject a data service to get and save real data or perhaps expose these properties as inputs and outputs (see <a href="template-syntax#inputs-outputs">Input and output properties</a> on the <a href="template-syntax">Template Syntax</a> page) for binding to a parent component. This is not a concern now and these future changes won't affect the form.
zh_cn: 在将来，您可以注入数据服务以获取和保存实际数据，或者可以将这些属性作为输入和输出（请参见&ldquo; <a href="template-syntax">模板语法&rdquo;</a>页面上的<a href="template-syntax#inputs-outputs">输入和输出属性</a>）公开以绑定到父组件。现在不必担心，这些将来的更改不会影响表格。

source: Downgrading multiple modules
zh_cn: 将多个模块降级

source: Download and install the latest <a href="https://www.microsoft.com/en-us/download/details.aspx?id=48593">TypeScript for Visual Studio 2015</a>,
zh_cn: 下载并安装<a href="https://www.microsoft.com/en-us/download/details.aspx?id=48593">适用于Visual Studio 2015</a>的最新TypeScript，

source: Download only
zh_cn: 仅下载

source: Download the library schematics project for a completed example of the steps below.
zh_cn: 下载库原理图项目,以完成以下步骤的示例。

source: Driver state
zh_cn: 司机状态

source: Duplicate the <code>&lt;<a href="i18n">source</a>/&gt;</code> tag, rename it <code><a href="../api/router/routerlinkwithhref#target">target</a></code>, and then replace its content with the French greeting. If you were working with a more complex translation, you could use the information and context provided by the source, description, and meaning elements to guide your selection of the appropriate French translation.
zh_cn: 复制 <code>&lt;<a href="i18n">source</a>/&gt;</code> 标记，将其重命名为 <code><a href="../api/router/routerlinkwithhref#target">target</a></code> ，然后将其内容替换为法语问候语。如果您要处理更复杂的翻译，则可以使用源，描述和含义元素提供的信息和上下文来指导您选择适当的法语翻译。

source: Duration and delay are expressed as a number and optional time unit, such as "1s" or "10ms" for one second and 10 milliseconds, respectively. The default unit is milliseconds.
zh_cn: 持续时间和延迟用数字和可选的时间单位表示,如 "1s "或 "10ms "分别表示1秒和10毫秒。默认单位是毫秒。

source: During TypeScript conversion no changes are strictly necessary. But it may be a good idea to convert the unit test code into TypeScript as well.
zh_cn: 在TypeScript转换过程中,严格来说不需要任何改变。但是将单元测试代码转换为TypeScript可能是一个好主意。

source: During TypeScript conversion, there is nothing to do to keep E2E tests working. But when you change the bootstrap to that of a Hybrid app, you must make a few changes.
zh_cn: 在TypeScript转换过程中,没有什么可以做的,以保持E2E测试的工作。但是当你把bootstrap改成Hybrid应用的时候,你必须做一些改变。

source: During a transition, a new view is inserted directly after the old one and both elements appear on screen at the same time. To prevent this, apply additional styling to the host view, and to the removed and inserted child views. The host view must use relative positioning, and the child views must use absolute positioning. Adding styling to the views animates the containers in place, without the DOM moving things around.
zh_cn: 在过渡期间,新的视图直接插入到旧的视图之后,两个元素同时出现在屏幕上。为了防止这种情况发生,请对主视图以及被删除和插入的子视图应用附加样式。主视图必须使用相对定位,而子视图必须使用绝对定位。在视图中添加样式会使容器在原地产生动画,而不会让DOM移动东西。

source: During change detection, the <code>ngOnChanges</code> lifecycle hook is called on the <code><a href="../api/forms/ngmodel">NgModel</a></code> directive instance because the value of one of its inputs has changed.
zh_cn: 在更改检测期间，由于 <code>ngOnChanges</code> 指令实例之一的输入值已更改，因此会在 <code><a href="../api/forms/ngmodel">NgModel</a></code> 指令实例上调用ngOnChanges生命周期挂钩。

source: During checkout, the app will prompt the user for a name and address. So that you can gather that information later, set the <code>checkoutForm</code> property with a form model containing <code>name</code> and <code>address</code> fields, using the <code><a href="../api/forms/formbuilder">FormBuilder</a>#<a href="../api/animations/group">group</a>()</code> method.
zh_cn: 结帐期间，应用程序将提示用户输入名称和地址。为了可以在以后收集该信息，请使用 <code><a href="../api/forms/formbuilder">FormBuilder</a>#<a href="../api/animations/group">group</a>()</code> ＃<a href="../api/animations/group">group</a>（）方法为包含 <code>name</code> 和 <code>address</code> 字段的表单模型设置 <code>checkoutForm</code> 属性。

source: During development, you typically use the <code>ng serve</code> command to build, watch, and serve the application from local memory, using <a href="https://webpack.js.org/guides/development/#webpack-dev-server">webpack-dev-server</a>. When you are ready to deploy, however, you must use the <code>ng build</code> command to build the app and deploy the build artifacts elsewhere.
zh_cn: 在开发过程中，通常使用 <code>ng serve</code> 命令通过<a href="https://webpack.js.org/guides/development/#webpack-dev-server">webpack-dev-server</a>从本地内存构建，监视和服务应用程序。但是，在准备好部署时，必须使用 <code>ng build</code> 命令来构建应用程序并将构建工件部署到其他位置。

source: During each navigation, the <code><a href="../api/router/router">Router</a></code> emits navigation events through the <code><a href="../api/router/router#events">Router.events</a></code> property. These events range from when the navigation starts and ends to many points in between. The full list of navigation events is displayed in the table below.
zh_cn: 在每次导航期间， <code><a href="../api/router/router">Router</a></code> 通过 <code><a href="../api/router/router#events">Router.events</a></code> 属性发出导航事件。这些事件的范围从导航开始和结束的时间到中间的许多时间。导航事件的完整列表显示在下表中。

source: During the process you'll learn how to apply the steps outlined in the <a href="upgrade#preparation">preparation guide</a>. You'll align the application with Angular and also start writing in TypeScript.
zh_cn: 在此过程中，您将学习如何应用<a href="upgrade#preparation">准备指南中</a>概述的步骤。您将使该应用程序与Angular对齐，并开始使用TypeScript进行编写。

source: Dynamic Component Loader
zh_cn: 动态组件加载器

source: Dynamic Components
zh_cn: 动态组件

source: Dynamic Forms
zh_cn: 动态表格

source: Dynamic Forms Guide
zh_cn: 动态表格指南

source: Dynamic Template
zh_cn: 动态模板

source: Dynamic component loading
zh_cn: 动态组件加载

source: Dynamic component loading is not common in most apps beyond the router. If you need to dynamically load components, you must add these components to the <code>entryComponents</code> list yourself.
zh_cn: 动态组件加载在路由器以外的大多数应用中并不常见。如果需要动态加载组件，则必须将这些组件自己添加到 <code>entryComponents</code> 列表中。

source: Dynamic controls using form arrays
zh_cn: 使用表单数组的动态控件

source: E, EE &amp; EEE
zh_cn: E，EE和EEE

source: E2E Tests
zh_cn: E2E测试

source: E2E test that all children were instantiated and displayed as expected:
zh_cn: E2E测试所有的孩子都被实例化,并按预期显示。

source: E2E tests are difficult to write and perform poorly compared to unit tests. They break easily, often due to changes or misbehavior far removed from the site of breakage.
zh_cn: 与单元测试相比,E2E测试很难编写,而且性能很差。它们很容易被破坏,通常是由于远离破坏地点的变化或行为不当。

source: E2E tests are great for high-level validation of the entire system. But they can't give you the comprehensive test coverage that you'd expect from unit tests.
zh_cn: E2E测试对于整个系统的高级验证是非常好的。但它们不能给你提供全面的测试覆盖率,而你期望从单元测试中获得。

source: E2E tests can't easily reveal how your components behave when things go wrong, such as missing or bad data, lost connectivity, and remote service failures.
zh_cn: E2E测试不能轻易地揭示你的组件在出错时的表现,比如数据丢失或坏掉、连接丢失和远程服务故障。

source: E2E tests for apps that update a database, send an invoice, or charge a credit card require special tricks and back-doors to prevent accidental corruption of remote resources. It can even be hard to navigate to the component you want to test.
zh_cn: 更新数据库、发送发票或信用卡收费的应用程序的E2E测试需要特殊的技巧和后门来防止远程资源的意外损坏。甚至很难导航到你要测试的组件。

source: E2E tests of input property setter with empty and non-empty names:
zh_cn: E2E测试输入属性设置器的空名和非空名。

source: EEE (Sun)
zh_cn: EEE(太阳)

source: EEEE (Sunday)
zh_cn: EEEE(星期日)

source: ES Target
zh_cn: ES目标

source: ES5 Browserslist Result
zh_cn: ES5浏览器列表结果

source: Each <code><a href="../api/core/debugelement">DebugElement</a></code> exposes a dependency injector with the specific instance of the directive attached to that element.
zh_cn: 每个 <code><a href="../api/core/debugelement">DebugElement</a></code> 公开一个依赖项注入器，该注入器具有附加到该元素的指令的特定实例。

source: Each <code><a href="../api/router/activatedroute">ActivatedRoute</a></code> in the <code><a href="../api/router/routerstate">RouterState</a></code> provides methods to traverse up and down the route tree to get information from parent, child and sibling routes.
zh_cn: <code><a href="../api/router/routerstate">RouterState</a></code> 中的每个 <code><a href="../api/router/activatedroute">ActivatedRoute</a></code> 提供了遍历路由树以从父，子和同级路由获取信息的方法。

source: Each <code><a href="../api/router/route">Route</a></code> maps a URL <code>path</code> to a component. There are <em>no leading slashes</em> in the <em>path</em>. The router parses and builds the final URL for you, allowing you to use both relative and absolute paths when navigating between application views.
zh_cn: 每个 <code><a href="../api/router/route">Route</a></code> 将URL <code>path</code> 映射到组件。有<em>没有前导斜杠</em>的<em>路径</em>。路由器将为您解析并构建最终URL，从而允许您在应用程序视图之间导航时使用相对路径和绝对路径。

source: Each <code>@<a href="ngmodule">NgModule</a></code> provides an own <code><a href="compiler">Compiler</a></code> to its injector, that will use the directives/pipes of the ng module for compilation of components.
zh_cn: 每个 <code>@<a href="ngmodule">NgModule</a></code> 提供了一个自己的 <code><a href="compiler">Compiler</a></code> 到其喷射器，将使用该指令的纳克模块/管材部件的编译。

source: Each <code>HeroBioComponent</code> can edit a single hero's biography. <code>HeroBioComponent</code> relies on <code>HeroCacheService</code> to fetch, cache, and perform other persistence operations on that hero.
zh_cn: 每个 <code>HeroBioComponent</code> 都可以编辑一个英雄的传记。 <code>HeroBioComponent</code> 依靠 <code>HeroCacheService</code> 对该英雄进行获取，缓存和执行其他持久性操作。

source: Each <code>build</code> target configuration can include an <code>assets</code> array that lists files or folders you want to copy as-is when building your project. By default, the <code>src/assets/</code> folder and <code>src/favicon.ico</code> are copied over.
zh_cn: 每个 <code>build</code> 目标配置都可以包括 <code>assets</code> 阵列，该资产阵列列出了在构建项目时要原样复制的文件或文件夹。默认情况下，将复制 <code>src/assets/</code> 文件夹和 <code>src/favicon.ico</code> 。

source: Each DOM element on the page is owned exactly by one framework. Whichever framework instantiated the element is the owner. Each framework only updates/interacts with its own DOM elements and ignores others.
zh_cn: 页面上的每个DOM元素都由一个框架精确地拥有。不管是哪个框架实例化的元素都是所有者。每个框架只更新/交互自己的DOM元素,而忽略其他元素。

source: Each additional app that you create with <code>ng generate application</code> has a corresponding end-to-end test project, with its own configuration section. When you create a library project with <code>ng generate library</code>, the library project is also added to the <code>projects</code> section.
zh_cn: 您使用 <code>ng generate application</code> 创建的每个其他应用程序都有一个对应的端到端测试项目，带有自己的配置部分。使用 <code>ng generate library</code> 创建库项目时，库项目也会添加到&ldquo; <code>projects</code> 部分。

source: Each area has its own area root component.
zh_cn: 每个区域都有自己的区域根组件。

source: Each area root component has its own router outlet and child routes.
zh_cn: 每个区域根组件都有自己的路由器出口和子路由。

source: Each asset group specifies both a group of resources and a policy that governs them. This policy determines when the resources are fetched and what happens when changes are detected.
zh_cn: 每个资产组都指定了一组资源和管理它们的策略。该政策决定何时获取资源以及检测到变化时的情况。

source: Each binding gets its own pipe instance.
zh_cn: 每个绑定都会得到自己的管道实例。

source: Each bootstrapped component is the base of its own tree of components. Inserting a bootstrapped component usually triggers a cascade of component creations that fill out that tree.
zh_cn: 每个引导组件都是它自己的组件树的基础。插入一个引导组件通常会触发一连串的组件创建,以填充该树。

source: Each budget entry is a JSON object with the following properties:
zh_cn: 每个预算条目都是一个JSON对象,具有以下属性:

source: Each component has a <em>host view</em>, and can have additional <em>embedded views</em>. An embedded view in component A is the host view of component B, which can in turn have embedded view. This means that there is a <a href="glossary#view-hierarchy">view hierarchy</a> for each component, of which that component's host view is the root.
zh_cn: 每个组件都有一个<em>宿主视图</em>，并且可以具有其他<em>嵌入式视图</em>。组件A中的嵌入式视图是组件B的宿主视图，而宿主B又可以具有嵌入式视图。这意味着每个组件都有一个<a href="glossary#view-hierarchy">视图层次结构</a>，该组件的宿主视图是其中的根。

source: Each component, service, and filter is in its own source file, as per the <a href="https://github.com/johnpapa/angular-styleguide/blob/master/a1/README.md#single-responsibility">Rule of 1</a>.
zh_cn: 根据<a href="https://github.com/johnpapa/angular-styleguide/blob/master/a1/README.md#single-responsibility">规则1</a>，每个组件，服务和过滤器都在其自己的源文件中。

source: Each control is explicitly created in the component class by creating a <code><a href="../api/forms/formcontrol">FormControl</a></code> instance manually or with <code><a href="../api/forms/formbuilder">FormBuilder</a></code>.
zh_cn: 通过手动或使用 <code><a href="../api/forms/formbuilder">FormBuilder</a></code> 创建一个 <code><a href="../api/forms/formcontrol">FormControl</a></code> 实例，可以在组件类中显式创建每个控件。

source: Each definition translates to a <a href="../api/router/route">Route</a> object which has two things: a <code>path</code>, the URL path segment for this route; and a <code>component</code>, the component associated with this route.
zh_cn: 每个定义都转换为<a href="../api/router/route">Route</a>对象，该对象具有两件事： <code>path</code> ，该路由的URL路径段；和一个 <code>component</code> ，与该路线关联的组件。

source: Each downgraded component/injectable needs to be explicitly associated with a downgraded module. See <code><a href="downgradecomponent">downgradeComponent</a>()</code> and <code><a href="downgradeinjectable">downgradeInjectable</a>()</code> for more details.
zh_cn: 每个降级的组件/注射剂都需要与降级的模块明确关联。有关更多详细信息，请参见 <code><a href="downgradecomponent">downgradeComponent</a>()</code> 和 <code><a href="downgradeinjectable">downgradeInjectable</a>()</code> 。

source: Each feature area resides in its own folder.
zh_cn: 每个功能区都驻扎在自己的文件夹中。

source: Each feature has its own Angular feature module.
zh_cn: 每个功能都有自己的Angular功能模块。

source: Each guideline describes either a good or bad practice, and all have a consistent presentation.
zh_cn: 每条准则都描述了一种好的或坏的做法,并且都有一致的表述。

source: Each hero in the heroes list should have a delete button.
zh_cn: 英雄列表中的每个英雄都应该有一个删除按钮。

source: Each input element has a <code>name</code> property that is required by Angular forms to register the control with the form.
zh_cn: 每个输入元素都有一个 <code>name</code> 属性，Angular表单需要使用该属性来将控件注册到表单。

source: Each input element has an <code>id</code> property that is used by the <code>label</code> element's <code>for</code> attribute to match the label to its input control.
zh_cn: 每个输入元素都有一个 <code>id</code> 属性， <code>label</code> 元素的 <code>for</code> 属性使用该属性将标签与其输入控件进行匹配。

source: Each interface has a single hook method whose name is the interface name prefixed with <code>ng</code>. For example, the <code><a href="../api/core/oninit">OnInit</a></code> interface has a hook method named <code>ngOnInit()</code> that Angular calls shortly after creating the component:
zh_cn: 每个接口都有一个钩子方法，其名称是以 <code>ng</code> 为前缀的接口名称。例如， <code><a href="../api/core/oninit">OnInit</a></code> 接口具有一个名为 <code>ngOnInit()</code> 的钩子方法，Angular在创建组件后不久会调用该方法：

source: Each interface has a single hook method whose name is the interface name prefixed with <code>ng</code>. For example, the <code><a href="../api/core/oninit">OnInit</a></code> interface has a hook method named <code>ngOnInit</code>.
zh_cn: 每个接口都有一个钩子方法，其名称是以 <code>ng</code> 为前缀的接口名称。例如， <code><a href="../api/core/oninit">OnInit</a></code> 接口具有一个名为 <code>ngOnInit</code> 的钩子方法。

source: Each named configuration can have defaults for any of the options that apply to the various <a href="glossary#target">builder targets</a>, such as <code>build</code>, <code>serve</code>, and <code>test</code>. The <a href="cli">Angular CLI</a><code>build</code>, <code>serve</code>, and <code>test</code> commands can then replace files with appropriate versions for your intended target environment.
zh_cn: 每个命名配置都可以具有适用于各种<a href="glossary#target">构建器目标的</a>任何选项的默认值，例如 <code>build</code> ， <code>serve</code> 和 <code>test</code> 。然后，<a href="cli">Angular CLI的</a> <code>build</code> ， <code>serve</code> 和 <code>test</code> 命令可以将文件替换为适合您目标目标环境的版本。

source: Each named schematic in the collection has the following main parts.
zh_cn: 集合中每个命名的原理图主要有以下几个部分。

source: Each nested <code>&lt;div&gt;</code> can present a custom message for one of the possible validation errors. There are messages for <code>required</code>, <code><a href="../api/forms/minlengthvalidator">minlength</a></code>, and <code>forbiddenName</code>.
zh_cn: 每个嵌套的 <code>&lt;div&gt;</code> 都可以针对一种可能的验证错误显示自定义消息。有针对 <code>required</code> ， <code><a href="../api/forms/minlengthvalidator">minlength</a></code> 和 <code>forbiddenName</code> 的消息。

source: Each of these subjects is introduced in more detail in the following pages.
zh_cn: 以下几页将更详细地介绍这些主题中的每一个。

source: Each operator works as follows:
zh_cn: 每个操作员的工作原理如下:

source: Each option associates key with a type, description, and optional alias. The type defines the shape of the value you expect, and the description is displayed when the user requests usage help for your schematic.
zh_cn: 每个选项将键与类型、描述和可选的别名关联起来。类型定义了你所期望的值的形状,而描述则是在用户为你的原理图请求使用帮助时显示的。

source: Each outlet can have a unique name, determined by the optional <code>name</code> attribute. The name cannot be set or changed dynamically. If not set, default value is "primary".
zh_cn: 每个插座可以具有唯一的名称，该 <code>name</code> 由可选的name属性确定。该名称不能动态设置或更改。如果未设置，则默认值为&ldquo;主要&rdquo;。

source: Each override method takes a <code><a href="../api/core/testing/metadataoverride">MetadataOverride</a>&lt;T&gt;</code> where <code>T</code> is the kind of metadata appropriate to the method, that is, the parameter of an <code>@<a href="../api/core/ngmodule">NgModule</a></code>, <code>@<a href="../api/core/component">Component</a></code>, <code>@<a href="../api/core/directive">Directive</a></code>, or <code>@<a href="../api/core/pipe">Pipe</a></code>.
zh_cn: 每个重写方法都采用 <code><a href="../api/core/testing/metadataoverride">MetadataOverride</a>&lt;T&gt;</code> ，其中 <code>T</code> 是适合该方法的元数据类型，即 <code>@<a href="../api/core/ngmodule">NgModule</a></code> ， <code>@<a href="../api/core/component">Component</a></code> ， <code>@<a href="../api/core/directive">Directive</a></code> 或 <code>@<a href="../api/core/pipe">Pipe</a></code> 。

source: Each pipe instance caches its own URL and data.
zh_cn: 每个管道实例都会缓存自己的URL和数据。

source: Each pipe instance only calls the server once.
zh_cn: 每个管道实例只调用服务器一次。

source: Each product in the list displays the same way, one after another on the page. To iterate over the predefined list of products, put the <code>*<a href="api/common/ngforof">ngFor</a></code> directive on a <code>&lt;div&gt;</code>, as follows:
zh_cn: 列表中的每种产品以相同的方式显示，页面上依次显示。要遍历预定义的产品列表，请将 <code>*<a href="api/common/ngforof">ngFor</a></code> 指令放在 <code>&lt;div&gt;</code> 上，如下所示：

source: Each product now has a "Share" button:
zh_cn: 现在每个产品都有一个 "分享 "按钮。

source: Each request results in the appropriate view for the requested route. The <code><a href="../api/platform-server/rendermodulefactory">renderModuleFactory</a>()</code> function renders the view within the <code>&lt;app&gt;</code> tag of the template, creating a finished HTML page for the client.
zh_cn: 每个请求都会为请求的路线生成适当的视图。所述 <code><a href="../api/platform-server/rendermodulefactory">renderModuleFactory</a>()</code> 函数呈现内的视图 <code>&lt;app&gt;</code> 在模板的标记，从而为所述客户端的最终HTML页面。

source: Each routing module augments the route configuration <em>in the order of import</em>. If you list <code>AppRoutingModule</code> first, the wildcard route will be registered <em>before</em> the hero routes. The wildcard route&mdash;which matches <em>every</em> URL&mdash;will intercept the attempt to navigate to a hero route.
zh_cn: 每个路由模块都<em>按导入顺序</em>扩充路由配置。如果您首先列出 <code>AppRoutingModule</code> ，则通配符路由将在英雄路由<em>之前</em>注册。与<em>每个</em> URL 匹配的通配符路由将拦截尝试导航到英雄路由的尝试。

source: Each schematic runs in a context, represented by a <code>SchematicContext</code> object.
zh_cn: 每个逻辑示意图都在由 <code>SchematicContext</code> 对象表示的上下文中运行。
