Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/angular/angular.*.006.xlf
Languages: es, ja, ko, ru, zh_cn

source: But the test's asynchronous nature is revealed by the call to <code>fixture.whenStable()</code>, which breaks the linear flow of control.
ko: 그러나 테스트의 비동기 특성은 <code>fixture.whenStable()</code> 호출하여 제어의 선형 흐름을 깨뜨리는 것으로 밝혀졌습니다 .
ru: Но асинхронный характер теста раскрывается вызовом <code>fixture.whenStable()</code> , который нарушает линейный поток управления.

source: But there's plenty of template complexity even in this simple form.
ko: 그러나이 간단한 형식으로도 템플릿 복잡성이 많이 있습니다.
ru: Но даже в таком простом виде сложность шаблона достаточно велика.

source: But when using them from AngularJS templates, you must use kebab-case:
ko: 그러나 AngularJS 템플릿에서 사용할 때는 kebab-case를 사용해야합니다.
ru: Но при использовании их из шаблонов AngularJS необходимо использовать кебаб-кейс:

source: But you can also start adding <em>type annotations</em> to get even more out of TypeScript's type system. For instance, you can annotate the checkmark filter so that it explicitly expects booleans as arguments. This makes it clearer what the filter is supposed to do.
ko: 그러나 TypeScript 유형 시스템을 최대한 활용하기 위해 <em>유형 주석</em> 추가를 시작할 수도 있습니다. 예를 들어, 체크 표시 필터에 주석을 달아 부울을 인수로 명시 적으로 기대할 수 있습니다. 이것은 필터가 무엇을해야 하는지를보다 명확하게합니다.
ru: Но вы также можете начать добавлять <em>аннотации типов,</em> чтобы получить еще больше от системы типов TypeScript. Например, вы можете аннотировать фильтр галочек, чтобы он явно ожидал логические значения в качестве аргументов. Это делает более понятным, что фильтр должен делать.

source: By adding <code>&lt;live-example&gt;</code> to the page you generate links that run sample code in the Stackblitz live coding environment and download that code to the reader's file system.
ko: 추가함으로써 <code>&lt;live-example&gt;</code> 페이지로 당신은 Stackblitz에서 샘플 코드를 실행 링크 라이브 코딩 환경과 다운로드를 생성하는 독자의 파일 시스템에 코드입니다.
ru: Добавляя <code>&lt;live-example&gt;</code> на страницу, вы генерируете ссылки, которые запускают пример кода в среде реального программирования Stackblitz и загружают этот код в файловую систему читателя.

source: By clicking a hero in the dashboard.
ko: 대시 보드에서 영웅을 클릭합니다.
ru: Щелкнув по герою на приборной панели.

source: By clicking a hero in the heroes list.
ko: 영웅 목록에서 영웅을 클릭합니다.
ru: Нажав на героя в списке героев.

source: By clicking the browser's back button, you can go back to the hero list or dashboard view, depending upon which sent you to the detail view.
ko: 브라우저의 뒤로 버튼을 클릭하면 상세보기로 보낸 메시지에 따라 영웅 목록 또는 대시 보드보기로 돌아갈 수 있습니다.
ru: Нажав на кнопку "Назад" браузера,вы можете вернуться к списку героев или просмотру панели инструментов,в зависимости от того,какой из них отправил вас в детальный просмотр.

source: By compiling your application using the <code>ngc</code> command-line tool, you can bootstrap directly to a module factory, so you don't need to include the Angular compiler in your JavaScript bundle.
ko: <code>ngc</code> 명령 줄 도구를 사용하여 응용 프로그램을 컴파일 하면 모듈 팩토리에 직접 부트 스트랩 할 수 있으므로 JavaScript 번들에 Angular 컴파일러를 포함시킬 필요가 없습니다.
ru: <code>ngc</code> ваше приложение с помощью инструмента командной строки ngc , вы можете загрузить непосредственно на фабрику модулей, поэтому вам не нужно включать компилятор Angular в ваш пакет JavaScript.

source: By contrast, Angular registers <code>AppComponent</code> providers with the <code>AppComponent</code>'s own injector. <code>AppComponent</code> services are available only to that component and its component tree. They have component scope.
ko: 반대로 Angular 는 <code>AppComponent</code> 자체 인젝터에 <code>AppComponent</code> 제공자를 등록 합니다. <code>AppComponent</code> 서비스는 해당 컴포넌트 및 해당 컴포넌트 트리에서만 사용할 수 있습니다. 구성 요소 범위가 있습니다.
ru: Напротив, угловые регистры <code>AppComponent</code> поставщиков с <code>AppComponent</code> собственного инжектором &laquo;s. <code>AppComponent</code> доступны только для этого компонента и его дерева компонентов. У них есть компонентный охват.

source: By convention, HTML attributes use lowercase names (<code>tabindex</code>), while properties use camelCase names (<code>tabIndex</code>).
ko: 일반적으로 HTML 속성은 소문자 이름 ( <code>tabindex</code> )을 사용하고 속성은 camelCase 이름 ( <code>tabIndex</code> )을 사용합니다.
ru: По соглашению атрибуты HTML используют строчные имена ( <code>tabindex</code> ), а свойства используют имена camelCase ( <code>tabIndex</code> ).

source: By convention, the module class name is <code>AppRoutingModule</code> and it belongs in the <code>app-routing.module.ts</code> in the <code>src/app</code> folder.
es: Por convenci&oacute;n, el nombre de la clase del m&oacute;dulo es <code>AppRoutingModule</code> y pertenece a <code>app-routing.module.ts</code> en la carpeta <code>src/app</code> .
ja: 慣例により、モジュールクラス名は <code>AppRoutingModule</code> であり、 <code>src/app</code> フォルダの <code>app-routing.module.ts</code> に属しています。
ko: 일반적으로 모듈 클래스 이름은 <code>AppRoutingModule</code> 이며 <code>src/app</code> 폴더 의 <code>app-routing.module.ts</code> 에 속합니다 .
ru: По соглашению, имя класса модуля - <code>AppRoutingModule</code> , и оно находится в <code>app-routing.module.ts</code> в папке <code>src/app</code> .

source: By default <code><a href="../api/core/testing/fakeasync">fakeAsync</a>()</code> supports the following <code>macroTasks</code>.
es: Por defecto, <code><a href="../api/core/testing/fakeasync">fakeAsync</a>()</code> admite las siguientes <code>macroTasks</code> .
ja: デフォルトでは、 <code><a href="../api/core/testing/fakeasync">fakeAsync</a>()</code> は次の <code>macroTasks</code> をサポートしています。
ko: 기본적으로 <code><a href="../api/core/testing/fakeasync">fakeAsync</a>()</code> 는 다음 <code>macroTasks</code> 를 지원합니다 .
ru: По умолчанию <code><a href="../api/core/testing/fakeasync">fakeAsync</a>()</code> поддерживает следующие <code>macroTasks</code> .

source: By default no files are replaced. You can add file replacements for specific build targets. For example:
es: Por defecto no se reemplazan los archivos.Puede agregar reemplazos de archivos para objetivos de construcción específicos.Por ejemplo:
ja: デフォルトでは、ファイルは置き換えられません。特定のビルドターゲットに対してファイルの置き換えを追加することができます。例えば、以下のようになります。
ko: 기본적으로 파일은 교체되지 않습니다. 특정 빌드 대상에 대한 파일 교체를 추가 할 수 있습니다. 예를 들면 다음과 같습니다.
ru: По умолчанию файлы не заменяются.Вы можете добавлять замены файлов для конкретных целей сборки.Например:

source: By default the <code>.ts</code> file supplied in the <code>files</code> field is assumed to be the library index. If more than one <code>.ts</code> file is specified, <code>libraryIndex</code> is used to select the file to use. If more than one <code>.ts</code> file is supplied without a <code>libraryIndex</code>, an error is produced.
es: Por defecto, se <code>.ts</code> archivo .ts suministrado en el campo de <code>files</code> es el &iacute;ndice de la biblioteca. Si se especifica m&aacute;s de un archivo <code>.ts</code> , <code>libraryIndex</code> se usa para seleccionar el archivo a usar. Si m&aacute;s de un <code>.ts</code> archivo se suministra sin <code>libraryIndex</code> , se produce un error.
ja: デフォルトでは、 <code>files</code> フィールドで指定された <code>.ts</code> ファイルがライブラリインデックスであると見なされます。複数の <code>.ts</code> ファイルを指定した場合、 <code>libraryIndex</code> を使用して、使用するファイルを選択します。複数の場合は <code>.ts</code> ファイルをせずに供給されている <code>libraryIndex</code> 、エラーが生成されます。
ko: 기본적으로 <code>files</code> 필드에 제공된 <code>.ts</code> 파일 은 라이브러리 색인으로 간주됩니다. 하나 이상의 <code>.ts</code> 파일이 지정되면 <code>libraryIndex</code> 를 사용하여 사용할 파일을 선택합니다. <code>libraryIndex</code> 없이 둘 이상의 <code>.ts</code> 파일이 제공 되면 오류가 발생합니다.
ru: По умолчанию файл <code>.ts</code> ,указанный в поле <code>files</code> , считается индексом библиотеки. Если указано более одного <code>.ts</code> файла, <code>libraryIndex</code> используется для выбора файла для использования. Если несколько файлов <code>.ts</code> предоставлено без <code>libraryIndex</code> , выдается ошибка.

source: By default, <code><a href="../api/core/testing/fakeasync">fakeAsync</a>()</code> supports the following macro tasks.
ja: デフォルトでは、 <code><a href="../api/core/testing/fakeasync">fakeAsync</a>()</code> は次のマクロタスクをサポートします。
ko: 기본적으로 <code><a href="../api/core/testing/fakeasync">fakeAsync</a>()</code> 는 다음 매크로 작업을 지원합니다.
ru: По умолчанию <code><a href="../api/core/testing/fakeasync">fakeAsync</a>()</code> поддерживает следующие макро-задачи.

source: By default, <code>@<a href="../api/core/contentchildren">ContentChildren</a></code> queries will only search direct child nodes in the DOM hierarchy (previously, they would search any nesting level in the DOM as long as another directive wasn't matched above it). See further <a href="ivy-compatibility-examples#content-children-descendants">details</a>.
ja: デフォルトでは、 <code>@<a href="../api/core/contentchildren">ContentChildren</a></code> クエリは、DOM階層内の直接の子ノードのみを検索します（以前は、別のディレクティブがその上で一致しない限り、DOM内のネストレベルを検索していました）。詳細を<a href="ivy-compatibility-examples#content-children-descendants">参照してください</a>。
ko: 기본적으로 <code>@<a href="../api/core/contentchildren">ContentChildren</a></code> 쿼리는 DOM 계층 구조에서 직접 자식 노드 만 검색합니다 (이전에는 다른 지시문이 그 위에 일치하지 않는 한 DOM에서 중첩 수준을 검색했습니다). 자세한 내용을 참조 <a href="ivy-compatibility-examples#content-children-descendants">하십시오</a> .
ru: По умолчанию запросы <code>@<a href="../api/core/contentchildren">ContentChildren</a></code> будут искать только прямые дочерние узлы в иерархии DOM (ранее они выполняли поиск на любом уровне вложенности в DOM, если над ним не совпадала другая директива). См. Дальнейшие <a href="ivy-compatibility-examples#content-children-descendants">подробности</a> .

source: By default, <code>ng new</code> creates an initial skeleton application at the root level of the workspace, along with its end-to-end tests. The skeleton is for a simple Welcome application that is ready to run and easy to modify. The root-level application has the same name as the workspace, and the source files reside in the <code>src/</code> subfolder of the workspace.
es: Por defecto, <code>ng new</code> crea una aplicaci&oacute;n esqueleto inicial en el nivel ra&iacute;z del espacio de trabajo, junto con sus pruebas de extremo a extremo. El esqueleto es para una aplicaci&oacute;n de bienvenida simple que est&aacute; lista para ejecutarse y es f&aacute;cil de modificar. La aplicaci&oacute;n de nivel ra&iacute;z tiene el mismo nombre que el espacio de trabajo, y los archivos de origen residen en la <code>src/</code> subcarpeta del espacio de trabajo.
ja: デフォルトでは、 <code>ng new</code> は、エンドツーエンドのテストとともに、ワークスペースのルートレベルに初期スケルトンアプリケーションを作成します。スケルトンは、実行の準備ができており、簡単に変更できる単純なWelcomeアプリケーション用です。ルートレベルのアプリケーションの名前はワークスペースと同じで、ソースファイルはワークスペースの <code>src/</code> サブフォルダーにあります。
ko: 기본적으로 <code>ng new</code> 는 엔드 투 엔드 테스트와 함께 작업 영역의 루트 수준에서 초기 골격 응용 프로그램을 만듭니다. 스켈레톤은 실행할 준비가되어 있고 쉽게 수정할 수있는 간단한 시작 응용 프로그램을위한 것입니다. 루트 수준 응용 프로그램은 작업 공간과 이름이 동일하며 소스 파일 은 작업 공간 의 <code>src/</code> 하위 폴더에 있습니다.
ru: По умолчанию <code>ng new</code> создает начальное каркасное приложение на корневом уровне рабочего пространства вместе с его сквозными тестами. Скелет предназначен для простого приложения Welcome, готового к запуску и легко модифицируемого. Приложение корневого уровня имеет то же имя, что и рабочее пространство, а исходные файлы находятся в <code>src/</code> рабочего пространства.

source: By default, Angular always starts at the current <code><a href="../api/core/injector">Injector</a></code> and keeps searching all the way up. Modifiers allow you to change the starting (self) or ending location.
es: Por defecto, Angular siempre comienza en el <code><a href="../api/core/injector">Injector</a></code> actual y sigue buscando hasta arriba. Los modificadores le permiten cambiar la ubicaci&oacute;n inicial (auto) o final.
ja: デフォルトでは、Angularは常に現在の <code><a href="../api/core/injector">Injector</a></code> から始まり、ずっと上に向かって検索を続けます。修飾子を使用すると、開始（自己）または終了の場所を変更できます。
ko: 기본적으로 Angular는 항상 현재 <code><a href="../api/core/injector">Injector</a></code> 에서 시작하여 계속 검색합니다. 수정자를 사용하면 시작 (자체) 또는 끝 위치를 변경할 수 있습니다.
ru: По умолчанию Angular всегда начинается с текущего <code><a href="../api/core/injector">Injector</a></code> и продолжает поиск до самого конца. Модификаторы позволяют изменить начальное (само) или конечное местоположение.

source: By default, Angular change detection will also run on the component for every AngularJS <code>$digest</code> cycle. If you wish to only have change detection run when the inputs change, you can set <code>propagateDigest</code> to <code>false</code> when calling <code><a href="../api/upgrade/static/downgradecomponent">downgradeComponent</a>()</code>.
ja: デフォルトでは、Angular変更検出はAngularJS <code>$digest</code> サイクルごとにコンポーネントで実行されます。入力が変更されたときにのみ変更検出を実行する場合は、 <code><a href="../api/upgrade/static/downgradecomponent">downgradeComponent</a>()</code> （）を呼び出すときに <code>propagateDigest</code> を <code>false</code> に設定できます。
ko: 기본적으로 Angular 변경 감지는 모든 AngularJS <code>$digest</code> 주기 의 구성 요소에서도 실행됩니다 . 입력이 변경 될 때만 변경 감지를 실행하려면 <code><a href="../api/upgrade/static/downgradecomponent">downgradeComponent</a>()</code> ()를 호출 할 때 <code>propagateDigest</code> 를 <code>false</code> 로 설정할 수 있습니다 .
ru: По умолчанию обнаружение изменений Angular также запускается в компоненте для каждого цикла <code>$digest</code> AngularJS $ . Если вы хотите, чтобы обнаружение изменений запускалось только при изменении входных данных, вы можете установить для <code>propagateDigest</code> значение <code>false</code> при вызове <code><a href="../api/upgrade/static/downgradecomponent">downgradeComponent</a>()</code> .

source: By default, Angular only contains locale data for <code>en-US</code>. If you set the value of <code><a href="../api/core/locale_id">LOCALE_ID</a></code> to another locale, you must import locale data for that new locale. The CLI imports the locale data for you when you use the parameter <code>--configuration</code> with <code>ng serve</code> and <code>ng build</code>.
es: De forma predeterminada, Angular solo contiene datos locales para <code>en-US</code> . Si establece el valor de <code><a href="../api/core/locale_id">LOCALE_ID</a></code> en otra configuraci&oacute;n regional, debe importar los datos de la configuraci&oacute;n regional para esa nueva configuraci&oacute;n regional. La CLI importa los datos locales para usted cuando utiliza el par&aacute;metro <code>--configuration</code> con <code>ng serve</code> y <code>ng build</code> .
ja: デフォルトでは、Angularには <code>en-US</code> のロケールデータのみが含まれています。 <code><a href="../api/core/locale_id">LOCALE_ID</a></code> の値を別のロケールに設定する場合は、その新しいロケールのロケールデータをインポートする必要があります。 <code>ng serve</code> および <code>ng build</code> でパラメーター <code>--configuration</code> を使用すると、CLIはロケールデータをインポートします。
ko: 기본적으로 Angular에는 <code>en-US</code> 에 대한 로캘 데이터 만 포함됩니다 . <code><a href="../api/core/locale_id">LOCALE_ID</a></code> 값 을 다른 로케일로 설정 한 경우 해당 새 로케일에 대한 로케일 데이터를 가져와야합니다. <code>ng serve</code> 및 <code>ng build</code> 와 함께 <code>--configuration</code> 매개 변수를 사용하면 CLI에서 로캘 데이터를 가져옵니다 .
ru: По умолчанию Angular содержит только данные локали для <code>en-US</code> . Если вы установите значение <code><a href="../api/core/locale_id">LOCALE_ID</a></code> для другой локали, вы должны импортировать данные локали для этой новой локали. CLI импортирует данные локали для вас, когда вы используете параметр <code>--configuration</code> с <code>ng serve</code> и <code>ng build</code> .

source: By default, Angular uses the locale <code>en-US</code>, which is English as spoken in the United States of America.
es: De forma predeterminada, Angular usa la configuraci&oacute;n regional <code>en-US</code> , que es el ingl&eacute;s tal como se habla en los Estados Unidos de Am&eacute;rica.
ja: デフォルトでは、Angularはロケール <code>en-US</code> を使用します。これは、アメリカ合衆国で話されている英語です。
ko: 기본적으로 Angular는 <code>en-US</code> 에서 사용되는 영어 인 로케일 en-US 를 사용합니다.
ru: По умолчанию Angular использует язык <code>en-US</code> , который является английским, как говорят в Соединенных Штатах Америки.

source: By default, NgModules are eagerly loaded, which means that as soon as the app loads, so do all the NgModules, whether or not they are immediately necessary. For large apps with lots of routes, consider lazy loading&mdash;a design pattern that loads NgModules as needed. Lazy loading helps keep initial bundle sizes smaller, which in turn helps decrease load times.
es: De forma predeterminada, los NgModules se cargan con entusiasmo, lo que significa que tan pronto como se carga la aplicaci&oacute;n, tambi&eacute;n lo hacen todos los NgModules, sean o no necesarios de inmediato. Para aplicaciones grandes con muchas rutas, considere la carga diferida, un patr&oacute;n de dise&ntilde;o que carga NgModules seg&uacute;n sea necesario. La carga diferida ayuda a mantener los tama&ntilde;os de paquete iniciales m&aacute;s peque&ntilde;os, lo que a su vez ayuda a disminuir los tiempos de carga.
ja: デフォルトでは、NgModuleは積極的に読み込まれます。つまり、アプリが読み込まれるとすぐに、NgModuleがすぐに必要かどうかに関係なく、すべてのNgModuleが読み込まれます。多数のルートを持つ大規模なアプリの場合は、遅延読み込み（必要に応じてNgModuleを読み込む設計パターン）を検討してください。遅延読み込みは、初期バンドルサイズを小さく保つのに役立ちます。これにより、読み込み時間が短縮されます。
ko: 기본적으로 NgModules는 열성적으로로드됩니다. 즉, 앱이로드되는 즉시 모든 NgModules가 즉시 필요한지 여부에 관계없이 모든 NgModules도 수행됩니다. 경로가 많은 대형 앱의 경우 필요에 따라 NgModules를로드하는 디자인 패턴 인 지연로드를 고려하십시오. 지연 로딩은 초기 번들 크기를 작게 유지하여로드 시간을 줄이는 데 도움이됩니다.
ru: По умолчанию NgModules загружаются с нетерпением, а это означает, что, как только приложение загружается, так же поступают все NgModules, независимо от того, нужны ли они немедленно. Для больших приложений с большим количеством маршрутов рассмотрите ленивую загрузку - шаблон проектирования, который загружает NgModules по мере необходимости. Ленивая загрузка помогает уменьшить начальные размеры пакета, что, в свою очередь, помогает сократить время загрузки.

source: By default, a <code>production</code> configuration is defined, and the <code>ng build</code> command has <code>--prod</code> option that builds using this configuration. The <code>production</code> configuration sets defaults that optimize the app in a number of ways, such as bundling files, minimizing excess whitespace, removing comments and dead code, and rewriting code to use short, cryptic names ("minification").
es: De manera predeterminada, se define una configuraci&oacute;n de <code>production</code> y el comando <code>ng build</code> tiene la opci&oacute;n <code>--prod</code> que se compila utilizando esta configuraci&oacute;n. La configuraci&oacute;n de <code>production</code> establece valores predeterminados que optimizan la aplicaci&oacute;n de varias maneras, como agrupar archivos, minimizar el espacio en blanco en exceso, eliminar comentarios y c&oacute;digo muerto y reescribir el c&oacute;digo para usar nombres cortos y cr&iacute;pticos ("minificaci&oacute;n").
ja: デフォルトでは、 <code>production</code> 設定が定義されており、 <code>ng build</code> コマンドには、この設定を使用してビルドする <code>--prod</code> オプションがあります。 <code>production</code> など、ファイルをバンドルする余分な空白を最小限に抑え、コメントやデッドコードの除去、および使用の短い、不可解な名前（「縮小」）にコードを書き換えるなど多くの方法でアプリを最適化する設定セットのデフォルト。
ko: 기본적으로 <code>production</code> 구성이 정의되고 <code>ng build</code> 명령에는 이 구성을 사용하여 빌드하는 <code>--prod</code> 옵션이 있습니다. <code>production</code> 등의 파일을 번들 여분의 공백을 최소화 의견과 죽은 코드 제거, 사용의 짧은 비밀 이름 ( "축소를")에 코드를 재 작성 등의 방법으로, 다수의 응용 프로그램을 최적화 구성 집합 기본 설정됩니다.
ru: По умолчанию определяется <code>production</code> конфигурация, а в команде <code>ng build</code> есть опция <code>--prod</code> , которая строится с использованием этой конфигурации. В <code>production</code> наборов конфигурации по умолчанию , которые оптимизируют приложение в ряде способов, такие как связывание файлов, сводя к минимуму избыточных пробелов, удаление комментариев и мертвый кода и переписыванию коды использовать короткий, загадочные имена ( &laquo;минификацию&raquo;).

source: By default, a live example link opens a Stackblitz in a separate browser tab. You can embed the Stackblitz within the guide page itself by adding the <code>embedded</code> attribute.
es: Por defecto, un enlace de ejemplo en vivo abre un Stackblitz en una pesta&ntilde;a separada del navegador. Puede incrustar el Stackblitz dentro de la p&aacute;gina de la gu&iacute;a agregando el atributo <code>embedded</code> .
ja: デフォルトでは、ライブサンプルリンクは別のブラウザータブでStackblitzを開きます。 <code>embedded</code> 属性を追加することで、ガイドページ自体にStackblitzを埋め込むことができます。
ko: 기본적으로 라이브 예제 링크는 별도의 브라우저 탭에서 Stackblitz를 엽니 다. 포함 <code>embedded</code> 속성 을 추가하여 가이드 페이지 내에 Stackblitz를 포함시킬 수 있습니다 .
ru: По умолчанию ссылка на пример в реальном времени открывает Stackblitz на отдельной вкладке браузера. Вы можете встроить Stackblitz в саму страницу руководства, добавив <code>embedded</code> атрибут.

source: By default, all validators are run after every form value change. With synchronous validators, this will not likely have a noticeable impact on application performance. However, it's common for async validators to perform some kind of HTTP request to validate the control. Dispatching an HTTP request after every keystroke could put a strain on the backend API, and should be avoided if possible.
es: Por defecto,todos los validadores se ejecutan después de cada cambio de valor de la forma.Con los validadores síncronos,es probable que esto no tenga un impacto notable en el rendimiento de la aplicación.Sin embargo,es común que los validadores asíncronos realicen algún tipo de solicitud HTTP para validar el control.Enviar una solicitud HTTP después de cada pulsación de tecla podría suponer una carga para la API del backend,y debería evitarse en la medida de lo posible.
ja: デフォルトでは、すべてのバリデータはフォームの値が変更されるたびに実行されます。同期バリデータの場合、アプリケーションのパフォーマンスに大きな影響を与えることはないでしょう。しかし、非同期バリデータでは、コントロールを検証するために何らかの HTTP リクエストを実行するのが一般的です。キー操作のたびに HTTP リクエストをディスパッチすることはバックエンド API に負担をかける可能性があるので、可能であれば避けるべきです。
ko: 기본적으로 모든 유효성 검사기는 폼 값이 변경 될 때마다 실행됩니다. 동기 유효성 검사기를 사용하면 응용 프로그램 성능에 눈에 띄는 영향을 미치지 않을 것입니다. 그러나 비동기 유효성 검사기가 컨트롤의 유효성을 검사하기 위해 일종의 HTTP 요청을 수행하는 것이 일반적입니다. 모든 키 입력 후 HTTP 요청을 전달하면 백엔드 API에 부담이 생길 수 있으므로 가능하면 피해야합니다.
ru: По умолчанию все валидаторы запускаются после каждого изменения значения формы.С синхронными валидаторами это вряд ли окажет заметное влияние на производительность приложения.Однако,обычно асинхронные валидаторы выполняют некий HTTP-запрос для проверки управления.Отправка HTTP-запроса после каждого нажатия клавиши может создать нагрузку на API бэкэнда,и этого следует избегать,если это возможно.

source: By default, all validators run after every form value change. With synchronous validators, this does not normally have a noticeable impact on application performance. Async validators, however, commonly perform some kind of HTTP request to validate the control. Dispatching an HTTP request after every keystroke could put a strain on the backend API, and should be avoided if possible.
ja: デフォルトでは、すべてのバリデータはフォームの値が変更されるたびに実行されます。同期バリデータの場合、通常はアプリケーションのパフォーマンスに目立った影響はありません。しかし、非同期バリデータでは、コントロールを検証するために何らかの HTTP リクエストを実行するのが一般的です。キー操作のたびに HTTP リクエストを送信することはバックエンド API に負担をかける可能性があるので、可能であれば避けたほうがよいでしょう。
ko: 기본적으로 모든 유효성 검사기는 양식 값이 변경 될 때마다 실행됩니다. 동기식 유효성 검사기를 사용하면 일반적으로 애플리케이션 성능에 눈에 띄는 영향을 미치지 않습니다. 그러나 비동기 유효성 검사기는 일반적으로 제어 유효성을 검사하기 위해 일종의 HTTP 요청을 수행합니다. 모든 키 입력 후 HTTP 요청을 전달하면 백엔드 API에 부담을 줄 수 있으므로 가능하면 피해야합니다.
ru: По умолчанию,все валидаторы запускаются после каждого изменения значения формы.При использовании синхронных валидаторов это,как правило,не оказывает заметного влияния на производительность приложения.Async валидаторы,однако,обычно выполняют своего рода HTTP-запрос на подтверждение контроля.Отправка HTTP-запроса после каждого нажатия клавиши может создать нагрузку на API бэкэнда,и этого следует избегать,если это возможно.
