Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/angular/angular.*.006.xlf
Languages: es, ja, ko, ru, zh_cn

source: Each script tag has a <code>type="module"</code> or <code>nomodule</code> attribute. Browsers with native support for ES modules only load the scripts with the <code>module</code> type attribute and ignore scripts with the <code>nomodule</code> attribute. Legacy browsers only load the scripts with the <code>nomodule</code> attribute, and ignore the script tags with the <code>module</code> type that load ES modules.
zh_cn: 每个脚本标签都有一个 <code>type="module"</code> 或 <code>nomodule</code> 属性。具有ES模块本机支持的浏览器仅加载具有 <code>module</code> 类型属性的脚本，而忽略具有 <code>nomodule</code> 属性的脚本。旧版浏览器仅加载具有 <code>nomodule</code> 属性的脚本，而忽略加载ES模块的 <code>module</code> 类型的脚本标签。

source: Each secondary outlet has its own navigation, independent of the navigation driving the primary outlet. Changing a current route that displays in the primary outlet has no effect on the popup outlet. That's why the popup stays visible as you navigate among the crises and heroes.
zh_cn: 每个辅助出口都有自己的导航,独立于驱动主出口的导航。更改主出口中显示的当前路线对弹出式出口没有影响。这就是为什么当你在危机和英雄之间导航时,弹出式会一直可见。

source: Each section of the configuration file is described below.
zh_cn: 下面将对配置文件的每个部分进行描述。

source: Each spy's birth and death marks the birth and death of the attached hero <code>&lt;div&gt;</code> with an entry in the <em>Hook Log</em> as seen here:
zh_cn: 每个间谍的出生和死亡都标志着附加英雄 <code>&lt;div&gt;</code> 的出生和死亡，在<em>钩子日志中</em>有一个条目，如下所示：

source: Each string in the array defines some CSS for this component.
zh_cn: 数组中的每个字符串都为这个组件定义了一些CSS。

source: Each switch-case statement contains an in-line HTML template or template reference that defines the subtree to be selected if the value of the match expression matches the value of the switch expression.
zh_cn: 每个switch-case语句都包含一个内嵌的HTML模板或模板引用,如果匹配表达式的值与switch表达式的值相匹配,则定义了要选择的子树。

source: Each target object specifies the <code>builder</code> for that target, which is the npm package for the tool that Architect runs. In addition, each target has an <code>options</code> section that configures default options for the target, and a <code>configurations</code> section that names and specifies alternative configurations for the target. See the example in <a href="workspace-config#build-target">Build target</a> below.
zh_cn: 每个目标对象都为该目标指定了 <code>builder</code> ，该构建器是Architect运行的工具的npm软件包。此外，每个目标都有一个用于配置目标默认选项的 <code>options</code> 部分，以及一个用于命名和指定目标替代配置的 <code>configurations</code> 部分。请参阅下面的<a href="workspace-config#build-target">构建目标</a>中的示例。

source: Each tax return component has the following characteristics:
zh_cn: 每个报税部分都有以下特点:

source: Each time a new alias instance is added, the new form array instance is provided its control based on the index. This allows you to track each individual control when calculating the status and value of the root control.
zh_cn: 每次添加新的别名实例时,新的表单数组实例都会根据索引提供其控件。这样,在计算根控件的状态和值时,就可以跟踪每个单独的控件。

source: Each time an animation is triggered in Angular, the parent animation always get priority and child animations are blocked. In order for a child animation to run, the parent animation must query each of the elements containing child animations and then allow the animations to run using the <a href="../api/animations/animatechild"><code>animateChild()</code></a> function.
zh_cn: 每次在Angular中触发动画时，父动画总是获得优先级，子动画将被阻止。为了运行子动画，父动画必须查询包含子动画的每个元素，然后允许使用<a href="../api/animations/animatechild"> <code>animateChild()</code> </a>函数运行动画。

source: Each time an animation is triggered in Angular, the parent animation has priority and any child animations are blocked. In order for a child animation to run, the parent animation must query each of the elements containing child animations, and run them using this function.
zh_cn: 每次在Angular中触发动画时,父动画具有优先权,任何子动画都会被屏蔽。为了让子动画运行,父动画必须查询每个包含子动画的元素,并使用此函数运行它们。

source: Each time items are added, the opacity fade-in animation runs, and each removed item is faded out. When either of these animations occur, the stagger effect is applied after each item's animation is started.
zh_cn: 每次添加物品时,不透明度淡入动画会运行,而每个移除的物品则会淡出。当上述任何一种动画发生时,在每个项目的动画开始后,都会应用交错效果。

source: Earlier component tests configured the testing module with a few <code>declarations</code> like this:
zh_cn: 早期的组件测试使用以下一些 <code>declarations</code> 配置了测试模块：

source: Edit a hero's name in the hero detail view. As you type, the hero name updates the heading at the top of the page. But when you click the "go back button", the changes are lost.
zh_cn: 在英雄详情视图中编辑英雄的名字。当你输入时,英雄的名字会更新页面顶部的标题。但当你点击 "返回按钮 "时,更改就会丢失。

source: Edit the <code>HeroSearchComponent</code> class
zh_cn: 编辑 <code>HeroSearchComponent</code> 类

source: Edit the <code>collection.json</code> file to define the initial schema for your collection.
zh_cn: 编辑 <code>collection.json</code> 文件以定义您的集合的初始架构。

source: Edit the <code>schematics/collection.json</code> file to point to the new schematic subfolder, and include a pointer to a schema file that will specify inputs for the new schematic.
zh_cn: 编辑 <code>schematics/collection.json</code> 文件以指向新的原理图子文件夹，并包括指向架构文件的指针，该文件将为新原理图指定输入。

source: Edit the <code>tsconfig.schematics.json</code> file to add the following content.
zh_cn: 编辑 <code>tsconfig.schematics.json</code> 文件以添加以下内容。

source: Edit the generated translation file: Translate the extracted text into the target language.
zh_cn: 编辑生成的翻译文件。将提取的文本翻译成目标语言。

source: Edit the hero
zh_cn: 编辑英雄

source: Editing the Bazel configuration may prevent you opting out of Bazel. Custom behaviors driven by Bazel won't be available in other Builders.
zh_cn: 编辑Bazel配置可能会阻止你选择退出Bazel。由Bazel驱动的自定义行为将无法在其他Builders中使用。

source: Either way, the <code>@<a href="../api/core/input">Input</a></code> decorator tells Angular that this property is <em>public</em> and available for binding by a parent component. Without <code>@<a href="../api/core/input">Input</a></code>, Angular refuses to bind to the property.
zh_cn: 无论哪种方式， <code>@<a href="../api/core/input">Input</a></code> 装饰器都会告诉Angular此属性是<em>公共的，</em>并且可以由父组件绑定。没有 <code>@<a href="../api/core/input">Input</a></code> ，Angular拒绝绑定到该属性。

source: Element event Component event Directive event
zh_cn: 元素事件 组件事件 指令事件

source: Element events may be the more common targets, but Angular looks first to see if the name matches an event property of a known directive, as it does in the following example:
zh_cn: 元素事件可能是更常见的目标,但Angular首先会查看名称是否与已知指令的事件属性相匹配,就像下面的例子一样。

source: Element properties may be the more common targets, but Angular looks first to see if the name is a property of a known directive, as it is in the following example:
zh_cn: 元素属性可能是比较常见的目标,但Angular会先看名字是否是已知指令的属性,就像下面的例子。

source: Element properties named with dash case (<code>-</code>). Dash case is the naming convention for custom elements.
zh_cn: 以破折号（ <code>-</code> ）命名的元素属性。破折号大小写是自定义元素的命名约定。

source: Element property Component property Directive property
zh_cn: 元素属性 组件属性 指令属性

source: Elements within the <code>[<a href="ngswitch">NgSwitch</a>]</code> statement but outside of any <code><a href="ngswitchcase">NgSwitchCase</a></code> or <code><a href="ngswitchdefault">ngSwitchDefault</a></code> directive are preserved at the location.
zh_cn: 在内的元素 <code>[<a href="ngswitch">NgSwitch</a>]</code> 任何声明，但外界 <code><a href="ngswitchcase">NgSwitchCase</a></code> 或 <code><a href="ngswitchdefault">ngSwitchDefault</a></code> 指令在该位置将被保留。

source: Embedded live example
zh_cn: 嵌入式直播示例

source: Embedding the route parameter token, <code>:id</code>, in the route definition path is a good choice for this scenario because the <code>id</code> is <em>required</em> by the <code>HeroDetailComponent</code> and because the value <code>15</code> in the path clearly distinguishes the route to "Magneta" from a route for some other hero.
zh_cn: 嵌入的路线参数标记， <code>:id</code> ，在路由定义路径是此方案中一个不错的选择，因为 <code>id</code> 是<em>需要</em>由 <code>HeroDetailComponent</code> 因为值 <code>15</code> 的路径清楚一些的路线区别于&ldquo;的Magneta&rdquo;路线其他英雄。

source: Emits an <code><a href="updateactivatedevent">UpdateActivatedEvent</a></code> event whenever the app has been updated to a new version.
zh_cn: 每当应用程序已更新到新版本时，都会发出 <code><a href="updateactivatedevent">UpdateActivatedEvent</a></code> 事件。

source: Emits an <code><a href="updateavailableevent">UpdateAvailableEvent</a></code> event whenever a new app version is available.
zh_cn: 只要有新的应用程序版本可用，就发出 <code><a href="updateavailableevent">UpdateAvailableEvent</a></code> 事件。

source: Emits an event containing a given value.
zh_cn: 发出包含给定值的事件。

source: Emits an event when the form submission has been triggered.
zh_cn: 当表单提交被触发时,发出一个事件。

source: Emits the currently active <a href="https://developer.mozilla.org/en-US/docs/Web/API/PushSubscription">PushSubscription</a> associated to the Service Worker registration or <code>null</code> if there is no subscription.
zh_cn: <a href="https://developer.mozilla.org/en-US/docs/Web/API/PushSubscription">退出</a>与服务工作者注册关联的当前活动的PushSubscription；如果没有订阅，则为 <code>null</code> 。

source: Emits the payloads of the received push notification messages as well as the action the user interacted with. If no action was used the <code>action</code> property contains an empty string <code>''</code>.
zh_cn: 发出接收到的推送通知消息的有效负载以及用户与之交互的操作。如果未使用动作，则 <code>action</code> 属性包含一个空字符串 <code>''</code> 。

source: Emits the payloads of the received push notification messages.
zh_cn: 发送收到的推送通知消息的有效载荷。

source: Empties out the async validator list.
zh_cn: 清空异步验证器列表。

source: Empties out the sync validator list.
zh_cn: 清空同步验证器列表。

source: Empty Path
zh_cn: 空路

source: Empty-path route configurations can be used to instantiate components that do not 'consume' any URL segments.
zh_cn: 空路径路由配置可用于实例化不 "消耗 "任何URL段的组件。

source: Empty-path routes can have children. In the following example, when navigating to <code>/team/11/user/jim</code>, the router instantiates the wrapper component with the user component in it.
zh_cn: 空路路线可以有孩子。在以下示例中，当导航到 <code>/team/11/user/jim</code> 时，路由器会实例化带有用户组件的包装器组件。

source: Emulate <code><a href="viewencapsulation#Native">Native</a></code> scoping of styles by adding an attribute containing surrogate id to the Host Element and pre-processing the style rules provided via <a href="component#styles">styles</a> or <a href="component#styleUrls">styleUrls</a>, and adding the new Host Element attribute to all selectors.
zh_cn: 模仿 <code><a href="viewencapsulation#Native">Native</a></code> 加入含有替代ID到主机的属性作用域的风格元素和预处理通过提供的样式规则<a href="component#styles">的样式</a>或<a href="component#styleUrls">styleUrls</a>，并添加新的Host元素属性的所有选择。

source: Enable HTTP services
zh_cn: 启用HTTP服务

source: Enable HttpClient for app
zh_cn: 为应用程序启用HttpClient

source: Enable HttpClient for cart service
zh_cn: 为购物车服务启用HttpClient。

source: Enable access to CLI usage data
zh_cn: 允许访问CLI使用数据

source: Enable and define the file watching poll time period in milliseconds.
zh_cn: 启用并定义文件监视轮询时间段,单位为毫秒。

source: Enable code coverage reports
zh_cn: 启用代码覆盖率报告

source: Enable hot module replacement.
zh_cn: 启用热模块更换。

source: Enable runtime production mode
zh_cn: 启用运行时生产模式

source: Enable the <code>dead</code> or <code>IE</code> browsers in the <code>browserslist</code> config file by removing the <code>not</code> keyword in front of them.
zh_cn: 启用 <code>dead</code> 或 <code>IE</code> 在浏览器 <code>browserslist</code> 通过删除配置文件 <code>not</code> 在他们面前的关键字。

source: Enable users to select a hero from a master list and edit that hero in the details view.
zh_cn: 使用户能够从主列表中选择一个英雄,并在详情视图中编辑该英雄。

source: Enabled Angular debug tools that are accessible via your browser's developer console.
zh_cn: 启用了Angular调试工具,可以通过浏览器的开发者控制台访问。

source: Enables '@angular-devkit/build-optimizer' optimizations when using the 'aot' option.
zh_cn: 当使用'aot'选项时,启用'@angular-devkit/build-optimizer'优化。

source: Enables a bug fix that corrects relative link resolution in components with empty paths.
zh_cn: 启用了一个错误修复功能,该功能可纠正空路径组件中的相对链接解析。

source: Enables a bug fix that corrects relative link resolution in components with empty paths. Example:
zh_cn: 启用一个错误修复,以纠正组件中空路径的相对链接解析。例如

source: Enables conditionally loaded ES2015 polyfills.
zh_cn: 启用有条件加载的ES2015 polyfills。

source: Enables optimization of the build output.
zh_cn: 能够优化构建输出。

source: Enables service worker build support in the CLI.
zh_cn: 在CLI中启用服务人员构建支持。

source: Enables the <code><a href="common/location">Location</a></code> service to read route state from the browser's URL. Angular provides two strategies: <code><a href="common/hashlocationstrategy">HashLocationStrategy</a></code> and <code><a href="common/pathlocationstrategy">PathLocationStrategy</a></code>.
zh_cn: 使 <code><a href="common/location">Location</a></code> 服务能够从浏览器的URL读取路线状态。Angular提供了两种策略： <code><a href="common/hashlocationstrategy">HashLocationStrategy</a></code> 和 <code><a href="common/pathlocationstrategy">PathLocationStrategy</a></code> 。

source: Enables the <code><a href="location">Location</a></code> service to read route state from the browser's URL. Angular provides two strategies: <code><a href="hashlocationstrategy">HashLocationStrategy</a></code> and <code><a href="pathlocationstrategy">PathLocationStrategy</a></code>.
zh_cn: 使 <code><a href="location">Location</a></code> 服务能够从浏览器的URL读取路线状态。Angular提供了两种策略： <code><a href="hashlocationstrategy">HashLocationStrategy</a></code> 和 <code><a href="pathlocationstrategy">PathLocationStrategy</a></code> 。

source: Enables the control. This means the control is included in validation checks and the aggregate value of its parent. Its status recalculates based on its value and its validators.
zh_cn: 启用该控件。这意味着该控件被包含在验证检查和其父体的总价值中。它的状态会根据其值和验证器重新计算。

source: Enables the use of subresource integrity validation.
zh_cn: 启用子资源完整性验证的使用。

source: Enabling polyfills with CLI projects
zh_cn: 启用CLI项目的多重填充

source: Encapsulates a child animation, that can be run explicitly when the parent is run. Instantiated and returned by the <code><a href="animatechild">animateChild</a></code> function.
zh_cn: 封装子动画，可以在运行父动画时显式运行它。由 <code><a href="animatechild">animateChild</a></code> 函数实例化并返回。

source: Encapsulates a child animation, that can be run explicitly when the parent is run. Instantiated and returned by the <code><a href="animations/animatechild">animateChild</a></code> function.
zh_cn: 封装子动画，可以在运行父动画时显式运行它。由 <code><a href="animations/animatechild">animateChild</a></code> 函数实例化并返回。

source: Encapsulates a keyframes sequence. Instantiated and returned by the <code><a href="animations/keyframes">keyframes</a>()</code> function.
zh_cn: 封装关键帧序列。由 <code><a href="animations/keyframes">keyframes</a>()</code> 函数实例化并返回。

source: Encapsulates a keyframes sequence. Instantiated and returned by the <code><a href="keyframes">keyframes</a>()</code> function.
zh_cn: 封装关键帧序列。由 <code><a href="keyframes">keyframes</a>()</code> 函数实例化并返回。

source: Encapsulates a reusable animation, which is a collection of individual animation steps. Instantiated and returned by the <code><a href="animation">animation</a>()</code> function, and passed to the <code><a href="useanimation">useAnimation</a>()</code> function.
zh_cn: 封装可重复使用的动画，该动画是各个动画步骤的集合。由 <code><a href="animation">animation</a>()</code> 函数实例化并返回，并传递给 <code><a href="useanimation">useAnimation</a>()</code> 函数。

source: Encapsulates a reusable animation, which is a collection of individual animation steps. Instantiated and returned by the <code><a href="animations/animation">animation</a>()</code> function, and passed to the <code><a href="animations/useanimation">useAnimation</a>()</code> function.
zh_cn: 封装可重复使用的动画，该动画是各个动画步骤的集合。由 <code><a href="animations/animation">animation</a>()</code> 函数实例化并返回，并传递给 <code><a href="animations/useanimation">useAnimation</a>()</code> 函数。

source: Encapsulates a reusable animation. Instantiated and returned by the <code><a href="animations/useanimation">useAnimation</a>()</code> function.
zh_cn: 封装可重用的动画。由 <code><a href="animations/useanimation">useAnimation</a>()</code> 函数实例化并返回。

source: Encapsulates a reusable animation. Instantiated and returned by the <code><a href="useanimation">useAnimation</a>()</code> function.
zh_cn: 封装可重用的动画。由 <code><a href="useanimation">useAnimation</a>()</code> 函数实例化并返回。

source: Encapsulates an animation group. Instantiated and returned by the <code><a href="animations/group">group()</a></code> function.
zh_cn: 封装动画组。由 <code><a href="animations/group">group()</a></code> 函数实例化并返回。

source: Encapsulates an animation group. Instantiated and returned by the <code><a href="group">group()</a></code> function.
zh_cn: 封装动画组。由 <code><a href="group">group()</a></code> 函数实例化并返回。

source: Encapsulates an animation query. Instantiated and returned by the <code><a href="animations/query">query</a>()</code> function.
zh_cn: 封装动画查询。由 <code><a href="animations/query">query</a>()</code> 函数实例化并返回。

source: Encapsulates an animation query. Instantiated and returned by the <code><a href="query">query</a>()</code> function.
zh_cn: 封装动画查询。由 <code><a href="query">query</a>()</code> 函数实例化并返回。

source: Encapsulates an animation sequence. Instantiated and returned by the <code><a href="animations/sequence">sequence</a>()</code> function.
zh_cn: 封装动画序列。由 <code><a href="animations/sequence">sequence</a>()</code> 函数实例化并返回。

source: Encapsulates an animation sequence. Instantiated and returned by the <code><a href="sequence">sequence</a>()</code> function.
zh_cn: 封装动画序列。由 <code><a href="sequence">sequence</a>()</code> 函数实例化并返回。

source: Encapsulates an animation state by associating a state name with a set of CSS styles. Instantiated and returned by the <code><a href="../common/upgrade/%24locationshim#state">state()</a></code> function.
zh_cn: 通过将状态名称与一组CSS样式相关联来封装动画状态。由 <code><a href="../common/upgrade/%24locationshim#state">state()</a></code> 函数实例化并返回。

source: Encapsulates an animation state by associating a state name with a set of CSS styles. Instantiated and returned by the <code><a href="common/upgrade/%24locationshim#state">state()</a></code> function.
zh_cn: 通过将状态名称与一组CSS样式相关联来封装动画状态。由 <code><a href="common/upgrade/%24locationshim#state">state()</a></code> 函数实例化并返回。

source: Encapsulates an animation step. Instantiated and returned by the <code><a href="animate">animate</a>()</code> function.
zh_cn: 封装动画步骤。由 <code><a href="animate">animate</a>()</code> 函数实例化并返回。

source: Encapsulates an animation step. Instantiated and returned by the <code><a href="animations/animate">animate</a>()</code> function.
zh_cn: 封装动画步骤。由 <code><a href="animations/animate">animate</a>()</code> 函数实例化并返回。

source: Encapsulates an animation style. Instantiated and returned by the <code><a href="animations/style">style</a>()</code> function.
zh_cn: 封装动画样式。由 <code><a href="animations/style">style</a>()</code> 函数实例化并返回。

source: Encapsulates an animation style. Instantiated and returned by the <code><a href="style">style</a>()</code> function.
zh_cn: 封装动画样式。由 <code><a href="style">style</a>()</code> 函数实例化并返回。

source: Encapsulates an animation transition. Instantiated and returned by the <code><a href="animations/transition">transition</a>()</code> function.
zh_cn: 封装动画过渡。由 <code><a href="animations/transition">transition</a>()</code> 函数实例化并返回。

source: Encapsulates an animation transition. Instantiated and returned by the <code><a href="transition">transition</a>()</code> function.
zh_cn: 封装动画过渡。由 <code><a href="transition">transition</a>()</code> 函数实例化并返回。

source: Encapsulates animation query options. Passed to the <code><a href="animations/query">query</a>()</code> function.
zh_cn: 封装动画查询选项。传递给 <code><a href="animations/query">query</a>()</code> 函数。

source: Encapsulates animation query options. Passed to the <code><a href="query">query</a>()</code> function.
zh_cn: 封装动画查询选项。传递给 <code><a href="query">query</a>()</code> 函数。

source: Encapsulates parameters for staggering the start times of a set of animation steps. Instantiated and returned by the <code><a href="animations/stagger">stagger</a>()</code> function.
zh_cn: 封装参数，以错开一组动画步骤的开始时间。由 <code><a href="animations/stagger">stagger</a>()</code> 函数实例化并返回。

source: Encapsulates parameters for staggering the start times of a set of animation steps. Instantiated and returned by the <code><a href="stagger">stagger</a>()</code> function.
zh_cn: 封装参数，以错开一组动画步骤的开始时间。由 <code><a href="stagger">stagger</a>()</code> 函数实例化并返回。

source: Encodes a key name for a URL parameter or query-string.
zh_cn: 编码一个URL参数或查询字符串的键名。

source: Encodes the hash from the provided string
zh_cn: 对提供的字符串进行哈希编码

source: Encodes the path from the provided string
zh_cn: 从提供的字符串编码路径

source: Encodes the search string from the provided string or object
zh_cn: 从提供的字符串或对象编码搜索字符串

source: Encodes the value of a URL parameter or query-string.
zh_cn: 编码一个URL参数或查询字符串的值。

source: End-to-End Tests
zh_cn: 端到端测试

source: End-to-end test files
zh_cn: 端到端测试文件

source: Ends a async time range operation. [range] is the return value from [wtfStartTimeRange] Async ranges only work if WTF has been enabled.
zh_cn: 结束一个异步时间范围操作。范围]是[wtfStartTimeRange]的返回值,只有在启用了WTF的情况下,异步范围才会生效。

source: Ends the animation, invoking the <code>onDone()</code> callback.
zh_cn: 结束动画，并调用 <code>onDone()</code> 回调。

source: Ensure that you are not already in an Angular workspace folder. For example, if you have previously created the Getting Started workspace, change to the parent of that folder.
zh_cn: 确保你不是已经在Angular工作区文件夹中。例如,如果你之前已经创建了Getting Started工作空间,请改成该文件夹的父文件夹。

source: Enter a URL in the address bar and the browser navigates to a corresponding page.
zh_cn: 在地址栏中输入一个URL,浏览器就会导航到相应的页面。

source: Enter a URL in the address bar, and the browser navigates to a corresponding page.
zh_cn: 在地址栏中输入一个URL,浏览器就会导航到相应的页面。

source: Enter a name and click <em>New Hero</em> again. The app displays a <em>Name is required</em> error message. You don't want error messages when you create a new (empty) hero. Why are you getting one now?
zh_cn: 输入名称，然后再次单击&ldquo; <em>新英雄&rdquo;</em>。该应用程序显示&ldquo; <em>名称为必填&rdquo;</em>错误消息。创建新的（空）英雄时，您不需要错误消息。为什么现在要买一个？

source: Entry Components
zh_cn: 参赛组件

source: Entry and exit transitions:
zh_cn: 进入和退出的过渡。

source: Entry point exports
zh_cn: 入境点出口

source: Entry points
zh_cn: 入境点

source: Enumerates the set of data-bound input properties for a directive
zh_cn: 枚举指令的数据绑定输入属性集。

source: Enumerates the set of event-bound output properties.
zh_cn: 枚举事件绑定的输出属性集。

source: Erase the name.
zh_cn: 擦掉这个名字。

source: Error checking
zh_cn: 错误检查

source: Error handling
zh_cn: 错误处理

source: Error handling (and specifically recovering from an error) is covered in more detail in a later section.
zh_cn: 错误处理(特别是从错误中恢复)将在后面的章节中详细介绍。

source: Error inspection, interpretation, and resolution is something you want to do in the <em>service</em>, not in the <em>component</em>.
zh_cn: 错误检查，解释和解决是您要在<em>服务</em>中而不是<em>组件中</em>要做的事情。

source: Error: throw an error. If you are using AOT compilation, the build will fail. If you are using JIT compilation, the app will fail to load.
zh_cn: 错误:抛出一个错误。如果你使用的是AOT编译,构建将失败。如果你使用的是JIT编译,应用程序将无法加载。

source: Error: throw if you have missing translations.
zh_cn: 错误:如果你有缺失的翻译,就扔。

source: Errors are never okay, even when the status code is in the 2xx success range.
zh_cn: 即使状态码在2xx成功范围内,出错也是绝对不会有事的。

source: Errors during the build process could result in updated resources without <code>ngsw.json</code> being updated. The reverse could also happen resulting in an updated <code>ngsw.json</code> without updated resources.
zh_cn: 生成过程中的错误可能会导致资源更新，而不更新 <code>ngsw.json</code> 。相反的情况也可能发生，导致更新的 <code>ngsw.json</code> 没有更新的资源。

source: Errors in AOT compilation commonly occur because of metadata that does not conform to the compiler's requirements (as described more fully below). For help in understanding and resolving these problems, see <a href="aot-metadata-errors">AOT Metadata Errors</a>.
zh_cn: AOT编译中的错误通常是由于元数据不符合编译器的要求而发生的（如下文更详细描述）。为帮助您理解和解决这些问题，请参阅<a href="aot-metadata-errors">AOT元数据错误</a>。
