Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/angular/angular.*.006.xlf
Languages: es, ja, ko, ru, zh_cn

source: Conceptually, you can imagine the Angular service worker as a forward cache or a CDN edge that is installed in the end user's web browser. The service worker's job is to satisfy requests made by the Angular app for resources or data from a local cache, without needing to wait for the network. Like any cache, it has rules for how content is expired and updated.
es: Conceptualmente,se puede imaginar al trabajador de servicio de Angular como un caché de avance o un borde CDN que se instala en el navegador web del usuario final.El trabajo del trabajador de servicio es satisfacer las solicitudes de recursos o datos de la aplicación Angular desde un caché local,sin necesidad de esperar a la red.Como cualquier caché,tiene reglas sobre cómo se caduca y se actualiza el contenido.
ja: 概念的には、AngularのサービスワーカーはフォワードキャッシュやエンドユーザーのウェブブラウザにインストールされるCDNエッジのようなものだと想像できます。サービスワーカーの仕事は、ネットワークを待たずにローカルキャッシュからリソースやデータを求めるAngularアプリのリクエストを満たすことです。他のキャッシュと同様に、コンテンツの期限切れや更新のルールがあります。
ko: 개념적으로 Angular 서비스 워커는 최종 사용자의 웹 브라우저에 설치된 포워드 캐시 또는 CDN 에지라고 생각할 수 있습니다. 서비스 워커의 임무는 네트워크를 기다릴 필요없이 로컬 캐시의 리소스 또는 데이터에 대한 Angular 앱의 요청을 충족시키는 것입니다. 캐시와 마찬가지로 콘텐츠 만료 및 업데이트 방법에 대한 규칙이 있습니다.
ru: Концептуально,вы можете представить сотрудника службы Angular в виде кэша вперед или края CDN,который устанавливается в веб-браузере конечного пользователя.Задача работника службы заключается в удовлетворении запросов,сделанных приложением Angular на ресурсы или данные из локального кэша,без необходимости ждать сеть.Как и в любом кэше,в нем есть правила того,как просрочено и обновлено содержимое.

source: Concrete injectors implement this interface.
es: Los inyectores de hormigón implementan esta interfaz.
ja: コンクリートインジェクタは、このインターフェースを実装しています。
ko: 콘크리트 인젝터는이 인터페이스를 구현합니다.
ru: Бетонные инжекторы реализуют этот интерфейс.

source: Concrete injectors implement this interface. Injectors are configured with <a href="../guide/glossary#provider">providers</a> that associate dependencies of various types with <a href="../guide/glossary#di-token">injection tokens</a>.
ja: コンクリートインジェクターはこのインターフェースを実装します。インジェクターは、さまざまなタイプの依存関係を<a href="../guide/glossary#di-token">インジェクショントークンに</a>関連付ける<a href="../guide/glossary#provider">プロバイダー</a>で構成されます。
ko: 콘크리트 인젝터는이 인터페이스를 구현합니다. 인젝터는 다양한 유형의 종속성을 <a href="../guide/glossary#di-token">인젝션 토큰</a> 과 연결하는 <a href="../guide/glossary#provider">공급자</a> 로 구성됩니다 .
ru: Конкретные форсунки реализуют этот интерфейс. Инжекторы настроены с <a href="../guide/glossary#provider">поставщиками,</a> которые связывают зависимости различных типов с <a href="../guide/glossary#di-token">токенами внедрения</a> .

source: Conditional display with NgIf
es: Pantalla condicional con NgIf
ja: NgIfによる条件付き表示
ko: NgIf를 사용한 조건부 디스플레이
ru: Условный дисплей с NgIf

source: Conditional operator
es: Operador condicional
ja: 条件付き演算子
ko: 조건부 연산자
ru: Условный оператор

source: Conditionally swaps the contents of the div by selecting one of the embedded templates based on the current value of <code>conditionExpression</code>.
es: Intercambia condicionalmente el contenido del div seleccionando una de las plantillas incrustadas en funci&oacute;n del valor actual de <code>conditionExpression</code> .
ja: conditionExpressionの現在の値に基づいて埋め込みテンプレートの1つを選択することにより、divのコンテンツを条件付きで交換し <code>conditionExpression</code> 。
ko: 조건부의 현재 값에 기초하여 상기 내장 템플릿 중 하나를 선택하여 DIV의 내용을 교체하는 <code>conditionExpression</code> 를 .
ru: Условно меняет содержимое div, выбирая один из встроенных шаблонов на основе текущего значения <code>conditionExpression</code> .

source: Config object passed to initialize the platform.
es: Configurar el objeto pasado para inicializar la plataforma.
ja: プラットフォームを初期化するために渡されるコンフィグオブジェクト。
ko: 플랫폼을 초기화하기 위해 구성 객체가 전달되었습니다.
ru: Объект Config передается для инициализации платформы.

source: Configuration defaults for Architect builder targets for this project.
es: La configuración por defecto de los objetivos del arquitecto constructor para este proyecto.
ja: このプロジェクトのアーキテクトビルダーターゲットの設定のデフォルト値です。
ko: 이 프로젝트의 Architect 빌더 대상에 대한 구성 기본값입니다.
ru: Конфигурация по умолчанию для целей строителя Architect для данного проекта.

source: Configuration file used by <a href="https://github.com/ng-packagr/ng-packagr">ng-packagr</a> for building your library.
es: Archivo de configuraci&oacute;n utilizado por <a href="https://github.com/ng-packagr/ng-packagr">ng-packagr</a> para construir su biblioteca.
ja: ライブラリを構築するために<a href="https://github.com/ng-packagr/ng-packagr">ng-packagr</a>によって使用される設定ファイル。
ko: 라이브러리를 빌드하기 위해 <a href="https://github.com/ng-packagr/ng-packagr">ng-packagr</a> 에서 사용하는 구성 파일 .
ru: Файл конфигурации, используемый <a href="https://github.com/ng-packagr/ng-packagr">ng-packagr</a> для сборки вашей библиотеки.

source: Configuration files
ja: 設定ファイル
ko: 구성 파일
ru: Конфигурационные файлы

source: Configuration for SystemJsNgModuleLoader. token.
es: Configuración para el SystemJsNgModuleLoader.token.
ja: SystemJsNgModuleLoaderの設定。
ko: SystemJsNgModuleLoader에 대한 구성 토큰.
ru: Конфигурация для SystemJsNgModuleLoader.token.

source: Configuration for code editors. See <a href="https://editorconfig.org/">EditorConfig</a>.
es: Configuraci&oacute;n para editores de c&oacute;digo. Ver <a href="https://editorconfig.org/">EditorConfig</a> .
ja: コードエディターの構成。<a href="https://editorconfig.org/">EditorConfigを</a>参照してください。
ko: 코드 편집기 구성 <a href="https://editorconfig.org/">EditorConfig를</a> 참조하십시오 .
ru: Конфигурация для редакторов кода. Смотрите <a href="https://editorconfig.org/">EditorConfig</a> .

source: Configuration inheritance with extends
es: La herencia de la configuración con las extensiones
ja: extendsによるコンフィギュレーションの継承
ko: 확장을 통한 구성 상속
ru: Наследование конфигурации с расширениями

source: Configuration options determine how the control propagates changes and emits events after updates and validity checks are applied.
es: Las opciones de configuración determinan la forma en que el control propaga los cambios y emite eventos después de que se aplican las actualizaciones y las comprobaciones de validez.
ja: 設定オプションは、更新と有効性チェックが適用された後に、コントロールがどのように変更を伝播し、イベントを放出するかを決定します。
ko: 구성 옵션은 업데이트 및 유효성 검사가 적용된 후 컨트롤이 변경 사항을 전파하고 이벤트를 생성하는 방법을 결정합니다.
ru: Опции конфигурации определяют,как элемент управления распространяет изменения и испускает события после обновления и проверки достоверности.

source: Configuration options for LocationUpgrade.
es: Opciones de configuración para LocationUpgrade.
ja: LocationUpgrade の設定オプション。
ko: LocationUpgrade의 구성 옵션.
ru: Параметры конфигурации для LocationUpgrade.

source: Configuration options object for the <code><a href="formgroup">FormGroup</a></code>. The object can have two shapes:
es: Objeto de opciones de configuraci&oacute;n para <code><a href="formgroup">FormGroup</a></code> . El objeto puede tener dos formas:
ja: <code><a href="formgroup">FormGroup</a></code> の構成オプションオブジェクト。オブジェクトには次の2つの形状があります。
ko: <code><a href="formgroup">FormGroup</a></code> 의 구성 옵션 객체 . 객체는 두 가지 모양을 가질 수 있습니다.
ru: Объект настроек конфигурации для <code><a href="formgroup">FormGroup</a></code> . Объект может иметь две формы:

source: Configuration options that determine how the control emits events after marking is applied.
es: Opciones de configuración que determinan la forma en que el control emite los eventos después de que se aplica la marcación.
ja: マーキングが適用された後にコントロールがどのようにイベントを放出するかを決定する設定オプションです。
ko: 마킹이 적용된 후 컨트롤에서 이벤트를 발생시키는 방법을 결정하는 구성 옵션.
ru: Опции конфигурации,которые определяют,как управление излучает события после нанесения маркировки.

source: Configuration options that determine how the control propagates changes and emits events after marking is applied.
es: Opciones de configuración que determinan la forma en que el control propaga los cambios y emite eventos después de que se aplica el marcado.
ja: マーキングが適用された後にコントロールがどのように変更を伝播し、イベントを放出するかを決定する設定オプションです。
ko: 표시가 적용된 후 컨트롤이 변경 사항을 전파하고 이벤트를 내보내는 방법을 결정하는 구성 옵션.
ru: Опции конфигурации,которые определяют,как элемент управления распространяет изменения и испускает события после нанесения маркировки.

source: Configuration options that determine how the control propagates changes and emits events after the control is disabled.
es: Opciones de configuración que determinan la forma en que el control propaga los cambios y emite eventos después de que el control se desactiva.
ja: コントロールが無効化された後に、コントロールがどのように変更を伝播し、イベントを放出するかを決定する設定オプションです。
ko: 컨트롤이 비활성화 된 후 컨트롤이 변경 사항을 전파하고 이벤트를 내보내는 방법을 결정하는 구성 옵션.
ru: Параметры конфигурации,которые определяют,как элемент управления распространяет изменения и излучает события после того,как элемент управления отключен.

source: Configuration options that determine how the control propagates changes and emits events after the marking is applied.
es: Opciones de configuración que determinan la forma en que el control propaga los cambios y emite eventos después de que se aplica el marcado.
ja: マーキングが適用された後にコントロールがどのように変更を伝播し、イベントを放出するかを決定する設定オプションです。
ko: 표시가 적용된 후 컨트롤이 변경 사항을 전파하고 이벤트를 내보내는 방법을 결정하는 구성 옵션.
ru: Опции конфигурации,которые определяют,как элемент управления распространяет изменения и излучает события после нанесения маркировки.

source: Configuration options that determine how the control propagates changes and emits events after the value changes.
es: Opciones de configuración que determinan la forma en que el control propaga los cambios y emite eventos después de que el valor cambia.
ja: 値が変化した後にコントロールがどのように変化を伝播し、イベントを放出するかを決定する設定オプションです。
ko: 컨트롤이 변경 사항을 전파하고 값이 변경된 후 이벤트를 내보내는 방법을 결정하는 구성 옵션.
ru: Опции конфигурации,которые определяют,как элемент управления распространяет изменения и испускает события после изменения значения.

source: Configuration options that determine how the control propagates changes and emits events after the value changes. The configuration options are passed to the <a href="abstractcontrol#updateValueAndValidity">updateValueAndValidity</a> method.
es: Opciones de configuraci&oacute;n que determinan c&oacute;mo el control propaga los cambios y emite eventos despu&eacute;s de que cambie el valor. Las opciones de configuraci&oacute;n se pasan al m&eacute;todo <a href="abstractcontrol#updateValueAndValidity">updateValueAndValidity</a> .
ja: コントロールが変更を伝播し、値が変更された後にイベントを発行する方法を決定する構成オプション。設定オプションは<a href="abstractcontrol#updateValueAndValidity">updateValueAndValidity</a>メソッドに渡されます。
ko: 컨트롤이 변경 사항을 전파하고 값이 변경된 후 이벤트를 내보내는 방법을 결정하는 구성 옵션. 구성 옵션은 <a href="abstractcontrol#updateValueAndValidity">updateValueAndValidity</a> 메소드 로 전달됩니다 .
ru: Параметры конфигурации, которые определяют, как элемент управления распространяет изменения и генерирует события после изменения значения. Параметры конфигурации передаются в метод <a href="abstractcontrol#updateValueAndValidity">updateValueAndValidity</a> .

source: Configuration options that determine how the control propagates changes and emits events after the value is patched.
es: Opciones de configuración que determinan la forma en que el control propaga los cambios y emite eventos después de que el valor es parcheado.
ja: 値がパッチされた後にコントロールがどのように変更を伝播し、イベントを放出するかを決定する設定オプションです。
ko: 값이 패치 된 후 컨트롤이 변경 사항을 전파하고 이벤트를 내보내는 방법을 결정하는 구성 옵션.
ru: Опции конфигурации,которые определяют,как управление распространяет изменения и испускает события после исправления значения.

source: Configuration options that determine how the control propagates changes and emits events events after marking is applied.
es: Opciones de configuración que determinan la forma en que el control propaga los cambios y emite eventos eventos después de que se aplica el marcado.
ja: マーキングが適用された後にコントロールがどのように変更を伝播し、イベントイベントを放出するかを決定する設定オプションです。
ko: 표시가 적용된 후 컨트롤이 변경 사항을 전파하고 이벤트 이벤트를 생성하는 방법을 결정하는 구성 옵션.
ru: Опции конфигурации,которые определяют,как элемент управления распространяет изменения и испускает события после нанесения маркировки.

source: Configuration options that determine how the control propagates changes and emits events when the group is reset.
es: Opciones de configuración que determinan cómo el control propaga los cambios y emite eventos cuando se reinicia el grupo.
ja: グループがリセットされたときにコントロールがどのように変更を伝播し、イベントを放出するかを決定する構成オプションです。
ko: 그룹이 재설정 될 때 제어가 변경 사항을 전파하고 이벤트를 생성하는 방법을 결정하는 구성 옵션.
ru: Опции конфигурации,которые определяют,как элемент управления распространяет изменения и излучает события при сбросе группы.

source: Configuration options that determine how the control propagates changes and emits events when the value changes. The configuration options are passed to the <a href="abstractcontrol#updateValueAndValidity">updateValueAndValidity</a> method.
es: Opciones de configuraci&oacute;n que determinan c&oacute;mo el control propaga los cambios y emite eventos cuando cambia el valor. Las opciones de configuraci&oacute;n se pasan al m&eacute;todo <a href="abstractcontrol#updateValueAndValidity">updateValueAndValidity</a> .
ja: コントロールが変更を伝播し、値が変更されたときにイベントを発行する方法を決定する構成オプション。設定オプションは<a href="abstractcontrol#updateValueAndValidity">updateValueAndValidity</a>メソッドに渡されます。
ko: 컨트롤이 변경 사항을 전파하고 값이 변경 될 때 이벤트를 생성하는 방법을 결정하는 구성 옵션. 구성 옵션은 <a href="abstractcontrol#updateValueAndValidity">updateValueAndValidity</a> 메소드 로 전달됩니다 .
ru: Параметры конфигурации, которые определяют, как элемент управления распространяет изменения и генерирует события при изменении значения. Параметры конфигурации передаются в метод <a href="abstractcontrol#updateValueAndValidity">updateValueAndValidity</a> .

source: Configure CLI for CI testing in Chrome
es: Configurar CLI para la prueba de CI en Chrome
ja: ChromeでCIテスト用のCLIを設定する
ko: Chrome에서 CI 테스트를위한 CLI 구성
ru: Настройте CLI для тестирования КИ в хромированном режиме

source: Configure IIS rewrite rules
es: Configurar las reglas de reescritura del IIS
ja: IIS の書き換えルールを設定する
ko: IIS 다시 쓰기 규칙 구성
ru: Настройте правила переписывания IIS

source: Configure Visual Studio to use the global external web tools instead of the tools that ship with Visual Studio:
es: Configura Visual Studio para usar las herramientas globales de la web externa en lugar de las herramientas que se envían con Visual Studio:
ja: Visual Studio に付属のツールではなく、グローバルな外部 Web ツールを使用するように Visual Studio を設定します。
ko: Visual Studio와 함께 제공되는 도구 대신 전역 외부 웹 도구를 사용하도록 Visual Studio를 구성하십시오.
ru: Настройте Visual Studio на использование глобальных внешних веб-инструментов вместо инструментов,поставляемых с Visual Studio:

source: Configure XSRF protection.
es: Configurar la protección XSRF.
ja: XSRF保護を設定します。
ko: XSRF 보호를 구성하십시오.
ru: Настройте защиту XSRF.

source: Configure a custom route matcher for AngularJS routes
es: Configurar un buscador de rutas personalizado para las rutas de AngularJS
ja: AngularJSのルート用にカスタムルートマッチャーを設定する
ko: AngularJS 경로에 대한 사용자 정의 경로 매처 구성
ru: Настройка пользовательского матчера маршрутов для маршрутов AngularJS

source: Configure an injector with a service provider
es: Configurar un inyector con un proveedor de servicios
ja: サービスプロバイダでインジェクタを設定する
ko: 서비스 제공 업체와 인젝터 구성
ru: Настройте инжектор с поставщиком услуг.

source: Configure environment-specific defaults
es: Configurar los valores por defecto específicos del entorno
ja: 環境固有のデフォルトを設定する
ko: 환경 별 기본값 구성
ru: Настройка параметров по умолчанию для конкретной окружающей среды

source: Configure options that control how the control propagates changes and emits events when marked as untouched
es: Configurar las opciones que controlan cómo el control propaga los cambios y emite eventos cuando está marcado como intacto
ja: 手を加えていないとマークされている場合に、コントロールがどのように変更を伝播し、イベントを放出するかを制御するオプションを設定します。
ko: 제어되지 않은 것으로 표시 될 때 제어가 변경 사항을 전파하고 이벤트를 생성하는 방법을 제어하는 ​​옵션 구성
ru: Настройка опций,контролирующих,как элемент управления распространяет изменения и испускает события,когда он помечен как нетронутый.

source: Configure options that determine how the control propagates changes and emits events after the value changes
es: Configurar las opciones que determinan cómo el control propaga los cambios y emite eventos después de que el valor cambie
ja: 値が変化した後にコントロールがどのように変化を伝播し、イベントを放出するかを決定するオプションを構成します。
ko: 값 변경 후 컨트롤이 변경 사항을 전파하고 이벤트를 생성하는 방법을 결정하는 옵션 구성
ru: Настройте опции,которые определяют,как элемент управления распространяет изменения и испускает события после изменения значения.

source: Configure project for Circle CI
es: Configurar el proyecto para el Círculo CI
ja: サークルCIのプロジェクト設定
ko: Circle CI에 대한 프로젝트 구성
ru: Проект настройки для Circle CI

source: Configure project for Travis CI
es: Configurar el proyecto para Travis CI
ja: Travis CIのためのプロジェクトの設定
ko: Travis CI에 대한 프로젝트 구성
ru: Настройка проекта для Travis CI

source: Configure target-specific file replacements
es: Configurar los reemplazos de archivos específicos del objetivo
ja: ターゲット固有のファイル置換を設定する
ko: 대상별 파일 교체 구성
ru: Настройка замены файлов,предназначенных для конкретных целей

source: Configure the Angular Router to defer loading of all other modules (and their associated code), either by <a href="router#preloading">waiting until the app has launched</a> or by <a href="router#asynchronous-routing"><em>lazy loading</em></a> them on demand.
es: Configure el enrutador angular para diferir la carga de todos los dem&aacute;s m&oacute;dulos (y su c&oacute;digo asociado), ya sea <a href="router#preloading">esperando hasta que se inicie la aplicaci&oacute;n</a> o <a href="router#asynchronous-routing"><em>cargando de forma diferida</em></a> a pedido.
ja: <a href="router#preloading">アプリが起動するまで待機する</a>か、必要に応じてそれらを<a href="router#asynchronous-routing"><em>遅延読み込み</em></a>することにより、他のすべてのモジュール（および関連するコード）の読み込みを延期するようにAngularルーターを構成します。
ko: <a href="router#preloading">앱이 시작될 때까지 기다리</a> 거나 요청시 <a href="router#asynchronous-routing"><em>느리게로드</em></a> 하여 다른 모든 모듈 (및 관련 코드)의로드를 지연하도록 Angular Router를 구성하십시오 .
ru: Сконфигурируйте Angular Router, чтобы отложить загрузку всех других модулей (и связанного с ними кода), либо <a href="router#preloading">дождавшись запуска приложения,</a> либо <a href="router#asynchronous-routing"><em>отложенной загрузкой</em></a> их по требованию.

source: Configure the Angular Router to defer loading of all other modules (and their associated code), either by <a href="router-tutorial-toh#preloading">waiting until the app has launched</a> or by <a href="router#lazy-loading"><em>lazy loading</em></a> them on demand.
ja: <a href="router-tutorial-toh#preloading">アプリが起動するまで待つ</a>か、オンデマンドで<a href="router#lazy-loading"><em>遅延読み込み</em></a>することにより、他のすべてのモジュール（および関連するコード）の読み込みを延期するようにAngularルーターを構成します。
ko: <a href="router-tutorial-toh#preloading">앱이 시작될 때까지 기다리</a> 거나 요청시 <a href="router#lazy-loading"><em>지연로드</em></a> 하여 다른 모든 모듈 (및 관련 코드)의로드를 지연하도록 Angular Router를 구성합니다 .
ru: Настройте Angular Router так, чтобы отложить загрузку всех других модулей (и связанного с ними кода), либо <a href="router-tutorial-toh#preloading">дождавшись запуска приложения,</a> либо <a href="router#lazy-loading"><em>отложив</em></a> их <em>загрузку</em> по запросу.

source: Configure the class so that you have an observable, <code>heroes$</code>, a <code>selectedId</code> to hold the <code>id</code> number of the hero, and the heroes in the <code>ngOnInit()</code>, add the following code to get the <code>id</code> of the selected hero. This code snippet assumes that you have a heroes list, a hero service, a function to get your heroes, and the HTML to render your list and details, just as in the Tour of Heroes example.
ja: observable、 <code>heroes$</code> 、ヒーローの <code>id</code> 番号を保持する <code>selectedId</code> 、および <code>ngOnInit()</code> のヒーローが含まれるようにクラスを構成し、次のコードを追加して、選択したヒーローの <code>id</code> を取得します。このコードスニペットは、Tour of Heroesの例のように、ヒーローリスト、ヒーローサービス、ヒーローを取得する関数、リストと詳細をレンダリングするHTMLがあることを前提としています。
ko: Observable <code>heroes$</code> , hero 의 <code>id</code> 번호 를 보유 하는 <code>selectedId</code> 및 <code>ngOnInit()</code> 의 heroes 를 갖도록 클래스를 구성하고 다음 코드를 추가 하여 선택한 영웅 의 <code>id</code> 를 가져옵니다 . 이 코드 스 니펫은 Tour of Heroes 예제에서와 같이 Heroes 목록, Hero 서비스, Hero를 가져 오는 함수, 목록 및 세부 정보를 렌더링하는 HTML이 있다고 가정합니다.
ru: Настройте класс так, чтобы у вас был наблюдаемый, <code>heroes$</code> , <code>selectedId</code> для хранения номера <code>id</code> героя и героев в <code>ngOnInit()</code> , добавьте следующий код, чтобы получить <code>id</code> выбранного героя. Этот фрагмент кода предполагает, что у вас есть список героев, служба героев, функция для получения ваших героев и HTML-код для отображения вашего списка и деталей, как в примере Tour of Heroes.

source: Configure the component to use the cart service.
ja: カートサービスを使用するコンポーネントを構成します。
ko: 카트 서비스를 사용하도록 구성 요소를 구성합니다.
ru: Настройте компонент для использования службы тележки.

source: Configure the control to update on a blur event
es: Configurar el control para que se actualice en un evento de borrosidad
ja: ブラーイベントで更新するコントロールを設定します。
ko: 블러 이벤트를 업데이트하도록 컨트롤 구성
ru: Настройте элемент управления на обновление при размытии события.

source: Configure the control to update on a submit event
es: Configurar el control para que se actualice en un evento de envío
ja: 送信イベントで更新するコントロールを構成する
ko: 제출 이벤트에서 업데이트하도록 제어 구성
ru: Настройте элемент управления на обновление информации о событии отправки.

source: Configure the new schematic
es: Configurar el nuevo esquema
ja: 新しい回路図の設定
ko: 새로운 회로도 구성
ru: Настройте новую схему

source: Configure the router module with <code><a href="../api/router/routermodule#forRoot">RouterModule.forRoot()</a></code>.
es: Configure el m&oacute;dulo del enrutador con <code><a href="../api/router/routermodule#forRoot">RouterModule.forRoot()</a></code> .
ja: <code><a href="../api/router/routermodule#forRoot">RouterModule.forRoot()</a></code> を使用してルーターモジュールを構成します。
ko: <code><a href="../api/router/routermodule#forRoot">RouterModule.forRoot()</a></code> 라우터 모듈을 구성하십시오 .
ru: Настройте модуль маршрутизатора с помощью <code><a href="../api/router/routermodule#forRoot">RouterModule.forRoot()</a></code> .

source: Configure the routes.
es: Configura las rutas.
ja: ルートを設定します。
ko: 경로를 구성하십시오.
ru: Настройте маршруты.

source: Configure the server to redirect requests for missing files to <code>index.html</code>. Learn more about server-side redirects <a href="deployment#fallback">below</a>.
es: Configure el servidor para redirigir las solicitudes de archivos faltantes a <code>index.html</code> . Obtenga m&aacute;s informaci&oacute;n sobre las redirecciones del lado del servidor a <a href="deployment#fallback">continuaci&oacute;n</a> .
ja: 欠落ファイルのリクエストを <code>index.html</code> にリダイレクトするようにサーバーを構成します。<a href="deployment#fallback">以下の</a>サーバー側リダイレクトの詳細をご覧ください。
ko: 누락 된 파일에 대한 요청을 <code>index.html</code> 로 리디렉션하도록 서버를 구성하십시오 . <a href="deployment#fallback">아래에서</a> 서버 측 리디렉션에 대해 자세히 알아보십시오 .
ru: Настройте сервер для перенаправления запросов на отсутствующие файлы в <code>index.html</code> . Узнайте больше о перенаправлениях на стороне сервера <a href="deployment#fallback">ниже</a> .
