Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/angular/angular.*.006.xlf
Languages: es, ja, ko, ru, zh_cn

source: Copy the files and folders from <code>app/heroes</code> into the new <code>crisis-center</code> folder.
es: Copie los archivos y carpetas de la <code>app/heroes</code> en la nueva carpeta del <code>crisis-center</code> .
ja: ファイルとフォルダーを <code>app/heroes</code> から新しい <code>crisis-center</code> フォルダーにコピーします。
ko: <code>app/heroes</code> 의 파일과 폴더를 새로운 <code>crisis-center</code> 폴더로 복사하십시오.
ru: Скопируйте файлы и папки из <code>app/heroes</code> в новую папку <code>crisis-center</code> .

source: Copy this <code><a href="httpheaderresponse">HttpHeaderResponse</a></code>, overriding its contents with the given parameter hash.
es: Copie este <code><a href="httpheaderresponse">HttpHeaderResponse</a></code> , anulando su contenido con el par&aacute;metro hash dado.
ja: この <code><a href="httpheaderresponse">HttpHeaderResponse</a></code> をコピーし、指定されたパラメータハッシュでコンテンツを上書きします。
ko: 이 <code><a href="httpheaderresponse">HttpHeaderResponse</a></code> 를 복사 하여 지정된 매개 변수 해시로 해당 컨텐츠를 대체하십시오.
ru: Скопируйте этот <code><a href="httpheaderresponse">HttpHeaderResponse</a></code> , переопределив его содержимое хэшем заданного параметра.

source: Core AngularJS services Importing this <code><a href="../../core/ngmodule">NgModule</a></code> will add providers for the core <a href="https://docs.angularjs.org/api/ng/service">AngularJS services</a> to the root injector.
es: Servicios centrales de AngularJS La importaci&oacute;n de este <code><a href="../../core/ngmodule">NgModule</a></code> agregar&aacute; proveedores para los <a href="https://docs.angularjs.org/api/ng/service">servicios</a> centrales de AngularJS al inyector ra&iacute;z.
ja: コアAngularJSサービスこの <code><a href="../../core/ngmodule">NgModule</a></code> をインポートすると、コア<a href="https://docs.angularjs.org/api/ng/service">AngularJSサービスの</a>プロバイダーがルートインジェクターに追加されます。
ko: 이 가져 오기 코어 AngularJS와 서비스 <code><a href="../../core/ngmodule">NgModule</a></code> 는 핵심에 대한 공급자를 추가합니다 <a href="https://docs.angularjs.org/api/ng/service">AngularJS와 서비스</a> 루트 인젝터에.
ru: Основные сервисы AngularJS При <code><a href="../../core/ngmodule">NgModule</a></code> этого NgModule в корневой инжектор будут добавлены поставщики основных <a href="https://docs.angularjs.org/api/ng/service">сервисов AngularJS</a> .

source: Correspondingly, when you upgrade an AngularJS component and use it from Angular, all the bindings defined for the component directive's <code><a href="../api/service-worker/swregistrationoptions#scope">scope</a></code> (or <code>bindToController</code>) will be hooked into Angular change detection. They will be treated as regular Angular inputs. Their values will be written to the upgraded component's scope (or controller) when they change.
es: En consecuencia, cuando actualiza un componente AngularJS y lo usa desde Angular, todos los enlaces definidos para el <code><a href="../api/service-worker/swregistrationoptions#scope">scope</a></code> la directiva del componente (o <code>bindToController</code> ) se conectar&aacute;n a la detecci&oacute;n de cambio angular. Ser&aacute;n tratados como entradas angulares regulares. Sus valores se escribir&aacute;n en el alcance (o controlador) del componente actualizado cuando cambien.
ja: 同様に、AngularJSコンポーネントをアップグレードしてAngularから使用すると、コンポーネントディレクティブの <code><a href="../api/service-worker/swregistrationoptions#scope">scope</a></code> （または <code>bindToController</code> ）に定義されているすべてのバインディングがAngular変更検出にフックされます。それらは通常のAngular入力として扱われます。それらの値が変更されると、アップグレードされたコンポーネントのスコープ（またはコントローラー）に書き込まれます。
ko: 이에 따라 AngularJS 구성 요소를 업그레이드하고 Angular에서 사용하면 구성 요소 지시문 <code><a href="../api/service-worker/swregistrationoptions#scope">scope</a></code> (또는 <code>bindToController</code> )에 대해 정의 된 모든 바인딩이 Angular 변경 감지에 연결됩니다. 그것들은 규칙적인 각도 입력으로 취급 될 것입니다. 값이 변경되면 업그레이드 된 구성 요소의 범위 (또는 컨트롤러)에 해당 값이 기록됩니다.
ru: Соответственно, при обновлении AngularJS компонент и использовать его с угловатого, все переплетами Для компонента директивы <code><a href="../api/service-worker/swregistrationoptions#scope">scope</a></code> (или <code>bindToController</code> ) будет зацепиться в обнаружение изменений углового. Они будут рассматриваться как обычные угловые входы. Их значения будут записаны в область действия обновленного компонента (или контроллер) при их изменении.

source: Correspondingly, when you upgrade an AngularJS component and use it from Angular, all the bindings defined for the component directive's <code>scope</code> (or <code>bindToController</code>) will be hooked into Angular change detection. They will be treated as regular Angular inputs. Their values will be written to the upgraded component's scope (or controller) when they change.
ja: 同様に、AngularJSコンポーネントをアップグレードしてAngularから使用すると、コンポーネントディレクティブの <code>scope</code> （または <code>bindToController</code> ）に定義されているすべてのバインディングがAngular変更検出にフックされます。それらは通常のAngular入力として扱われます。それらの値は、変更されると、アップグレードされたコンポーネントのスコープ（またはコントローラー）に書き込まれます。
ko: 이에 따라 AngularJS 구성 요소를 업그레이드하고 Angular에서 사용하면 구성 요소 지시문의 <code>scope</code> (또는 <code>bindToController</code> )에 대해 정의 된 모든 바인딩이 Angular 변경 감지에 연결됩니다. 일반 각도 입력으로 처리됩니다. 해당 값은 변경 될 때 업그레이드 된 구성 요소의 범위 (또는 컨트롤러)에 기록됩니다.
ru: Соответственно, при обновлении AngularJS компонент и использовать его с угловатого, все переплетами Для компонента директивы <code>scope</code> (или <code>bindToController</code> ) будет зацепиться в обнаружение изменений углового. Они будут рассматриваться как обычные входные данные Angular. Их значения будут записаны в область действия (или контроллер) обновленного компонента при изменении.

source: Could not resolve type
es: No se pudo resolver el tipo
ja: タイプを解決できませんでした
ko: 유형을 확인할 수 없습니다
ru: Не смог решить тип

source: Create <code>HeroSearchComponent</code>
es: Crear <code>HeroSearchComponent</code>
ja: <code>HeroSearchComponent</code> を作成する
ko: <code>HeroSearchComponent</code> 생성
ru: Создать <code>HeroSearchComponent</code>

source: Create <code>MessagesComponent</code>
es: Crear <code>MessagesComponent</code>
ja: <code>MessagesComponent</code> を作成する
ko: <code>MessagesComponent</code> 작성
ru: Создать <code>MessagesComponent</code>

source: Create Angular <a href="guide/glossary#component">components</a> to display hero details and show an array of heroes.
ja: Angular<a href="guide/glossary#component">コンポーネント</a>を作成して、ヒーローの詳細を表示し、ヒーローの配列を表示します。
ko: Angular <a href="guide/glossary#component">구성 요소</a> 를 만들어 영웅 세부 정보를 표시하고 영웅 배열을 표시합니다.
ru: Создавайте <a href="guide/glossary#component">компоненты</a> Angular, чтобы отображать детали героев и отображать массив героев.

source: Create Angular components to display hero details and show an array of heroes.
es: Crear componentes angulares para mostrar los detalles del héroe y mostrar una serie de héroes.
ja: Angularコンポーネントを作成して、ヒーローの詳細を表示したり、ヒーローの配列を表示したりします。
ko: 영웅 세부 정보를 표시하고 일련의 영웅을 표시하는 각도 구성 요소를 만듭니다.
ru: Создайте Угловые компоненты для отображения деталей героя и отображения массива героев.

source: Create a "top component" that acts as the root for all of the module's components. Add the custom <code><a href="../api/common/http/httpbackend">HttpBackend</a></code> provider to the top component's <code>providers</code> list rather than the module's <code>providers</code>. Recall that Angular creates a child injector for each component instance and populates the injector with the component's own providers.
es: Cree un "componente superior" que act&uacute;e como la ra&iacute;z de todos los componentes del m&oacute;dulo. Agregue el proveedor <code><a href="../api/common/http/httpbackend">HttpBackend</a></code> personalizado a la lista de <code>providers</code> del componente superior en lugar de los <code>providers</code> del m&oacute;dulo . Recuerde que Angular crea un inyector secundario para cada instancia de componente y llena el inyector con los propios proveedores del componente.
ja: モジュールのすべてのコンポーネントのルートとして機能する「トップコンポーネント」を作成します。カスタム <code><a href="../api/common/http/httpbackend">HttpBackend</a></code> プロバイダーを、モジュールの <code>providers</code> ではなく、最上位のコンポーネントの <code>providers</code> リストに追加します。Angularが各コンポーネントインスタンスの子インジェクターを作成し、インジェクターにコンポーネント独自のプロバイダーを設定することを思い出してください。
ko: 모든 모듈 구성 요소의 루트 역할을하는 "최상위 구성 요소"를 작성하십시오. 사용자 정의 <code><a href="../api/common/http/httpbackend">HttpBackend</a></code> 제공자를 모듈 <code>providers</code> 아닌 최상위 컴포넌트의 <code>providers</code> 목록에 추가하십시오 . Angular는 각 구성 요소 인스턴스에 대해 하위 인젝터를 만들고 인젝터를 구성 요소의 자체 공급자로 채 웁니다.
ru: Создайте &laquo;верхний компонент&raquo;, который действует как корень для всех компонентов модуля. Добавьте пользовательские <code><a href="../api/common/http/httpbackend">HttpBackend</a></code> поставщика к началу компоненты <code>providers</code> списку , а не модуль <code>providers</code> . Напомним, что Angular создает дочерний инжектор для каждого экземпляра компонента и заполняет инжектор собственными поставщиками компонента.

source: Create a <code><a href="../api/forms/formgroup">FormGroup</a></code> instance.
ja: <code><a href="../api/forms/formgroup">FormGroup</a></code> インスタンスを作成します。
ko: <code><a href="../api/forms/formgroup">FormGroup</a></code> 인스턴스를 만듭니다 .
ru: Создайте экземпляр <code><a href="../api/forms/formgroup">FormGroup</a></code> .

source: Create a <code><a href="keyvaluediffer">KeyValueDiffer</a></code>.
es: Cree un <code><a href="keyvaluediffer">KeyValueDiffer</a></code> .
ja: <code><a href="keyvaluediffer">KeyValueDiffer</a></code> を作成します。
ko: <code><a href="keyvaluediffer">KeyValueDiffer</a></code> 를 작성하십시오 .
ru: Создайте <code><a href="keyvaluediffer">KeyValueDiffer</a></code> .

source: Create a <code><a href="platform-browser/statekey">StateKey</a>&lt;T&gt;</code> that can be used to store value of type T with <code><a href="platform-browser/transferstate">TransferState</a></code>.
es: Cree una <code><a href="platform-browser/statekey">StateKey</a>&lt;T&gt;</code> que se pueda usar para almacenar el valor de tipo T con <code><a href="platform-browser/transferstate">TransferState</a></code> .
ja: <code><a href="platform-browser/transferstate">TransferState</a></code> で T型の値を格納するために使用できる <code><a href="platform-browser/statekey">StateKey</a>&lt;T&gt;</code> を作成します。
ko: <code><a href="platform-browser/transferstate">TransferState</a></code> 를 사용하여 T 유형의 값을 저장하는 데 사용할 수 있는 <code><a href="platform-browser/statekey">StateKey</a>&lt;T&gt;</code> 를 작성하십시오 .
ru: Создайте <code><a href="platform-browser/statekey">StateKey</a>&lt;T&gt;</code> который можно использовать для хранения значения типа T с <code><a href="platform-browser/transferstate">TransferState</a></code> .

source: Create a <code><a href="statekey">StateKey</a>&lt;T&gt;</code> that can be used to store value of type T with <code><a href="transferstate">TransferState</a></code>.
es: Cree una <code><a href="statekey">StateKey</a>&lt;T&gt;</code> que se pueda usar para almacenar el valor de tipo T con <code><a href="transferstate">TransferState</a></code> .
ja: <code><a href="transferstate">TransferState</a></code> で T型の値を格納するために使用できる <code><a href="statekey">StateKey</a>&lt;T&gt;</code> を作成します。
ko: <code><a href="transferstate">TransferState</a></code> 를 사용하여 T 유형의 값을 저장하는 데 사용할 수 있는 <code><a href="statekey">StateKey</a>&lt;T&gt;</code> 를 작성하십시오 .
ru: Создайте <code><a href="statekey">StateKey</a>&lt;T&gt;</code> который можно использовать для хранения значения типа T с <code><a href="transferstate">TransferState</a></code> .

source: Create a <code>Hero</code> class in its own file in the <code>src/app</code> folder. Give it <code>id</code> and <code>name</code> properties.
es: Cree una clase <code>Hero</code> en su propio archivo en la carpeta <code>src/app</code> . Dale <code>id</code> y propiedades de <code>name</code> .
ja: <code>src/app</code> フォルダーの独自のファイルに <code>Hero</code> クラスを作成します。それ付け <code>id</code> と <code>name</code> のプロパティを。
ko: <code>src/app</code> 폴더 에 자체 파일로 <code>Hero</code> 클래스를 만듭니다 . 그것을 부여 <code>id</code> 와 <code>name</code> 속성을.
ru: Создайте класс <code>Hero</code> в своем собственном файле в папке <code>src/app</code> . Дайте ему <code>id</code> и <code>name</code> свойства.

source: Create a <code>Hero</code> interface in its own file in the <code>src/app</code> folder. Give it <code>id</code> and <code>name</code> properties.
ja: <code>src/app</code> フォルダー内の独自のファイルに <code>Hero</code> インターフェイスを作成します。それ付け <code>id</code> と <code>name</code> のプロパティを。
ko: <code>src/app</code> 폴더 의 자체 파일에 <code>Hero</code> 인터페이스를 만듭니다 . <code>id</code> 와 <code>name</code> 속성을 제공하십시오 .
ru: Создайте интерфейс <code>Hero</code> в собственном файле в папке <code>src/app</code> . Дайте ему свойства <code>id</code> и <code>name</code> .

source: Create a <code>HeroSearchComponent</code> with the CLI.
es: Cree un <code>HeroSearchComponent</code> con la CLI.
ja: CLIを <code>HeroSearchComponent</code> してHeroSearchComponentを作成します。
ko: CLI를 사용 하여 <code>HeroSearchComponent</code> 를 작성하십시오 .
ru: Создайте <code>HeroSearchComponent</code> с помощью CLI.

source: Create a <code>HeroesModule</code> with routing in the heroes folder and register it with the root <code>AppModule</code>. This is where you'll be implementing the <em>hero management</em>.
es: Crea un <code>HeroesModule</code> con enrutamiento en la carpeta de h&eacute;roes y reg&iacute;stralo con el <code>AppModule</code> ra&iacute;z . Aqu&iacute; es donde implementar&aacute; la <em>gesti&oacute;n de h&eacute;roes</em> .
ja: heroesフォルダーにルーティングされた <code>HeroesModule</code> を作成し、ルート <code>AppModule</code> に登録します。これは、<em>ヒーロー管理を</em>実装する場所です。
ko: heroes 폴더에 라우팅이 있는 <code>HeroesModule</code> 을 생성 하고 루트 <code>AppModule</code> 에 등록하십시오 . 이곳에서 <em>영웅 관리를</em> 구현할 수 있습니다 .
ru: Создайте <code>HeroesModule</code> с маршрутизацией в папке heroes и зарегистрируйте его в корневом <code>AppModule</code> . Здесь вы будете осуществлять управление <em>героями</em> .

source: Create a <code>crisis-center</code> subfolder in the <code>src/app</code> folder.
es: Cree una subcarpeta de <code>crisis-center</code> en la carpeta <code>src/app</code> .
ja: <code>src/app</code> フォルダーに <code>crisis-center</code> サブフォルダーを作成します。
ko: <code>src/app</code> 폴더 에 <code>crisis-center</code> 하위 폴더를 작성하십시오 .
ru: Создайте подпапку <code>crisis-center</code> в папке <code>src/app</code> .

source: Create a <code>files/</code> folder inside the <code>schematics/my-service/</code> folder.
es: Cree una carpeta <code>files/</code> dentro de la carpeta <code>schematics/my-service/</code> .
ja: Schematics <code>schematics/my-service/</code> フォルダー内に <code>files/</code> フォルダーを作成します。
ko: <code>schematics/my-service/</code> 폴더 안에 <code>files/</code> 폴더를 만듭니다 .
ru: Создайте <code>files/</code> папку в папке <code>schematics/my-service/</code> .

source: Create a <code>schema.json</code> file and define the available options for the schematic.
es: Cree un archivo <code>schema.json</code> y defina las opciones disponibles para el esquema.
ja: <code>schema.json</code> ファイルを作成し、回路図で使用可能なオプションを定義します。
ko: <code>schema.json</code> 파일을 작성하고 회로도 에 사용 가능한 옵션을 정의하십시오.
ru: Создайте файл <code>schema.json</code> и определите доступные параметры для схемы.

source: Create a <code>schema.ts</code> file and define an interface that stores the values of the options defined in the <code>schema.json</code> file.
es: Cree un archivo <code>schema.ts</code> y defina una interfaz que almacene los valores de las opciones definidas en el archivo <code>schema.json</code> .
ja: 作成 <code>schema.ts</code> ファイルとで定義されたオプションの格納値は、そのインタフェース定義 <code>schema.json</code> のファイルを。
ko: <code>schema.ts</code> 파일을 작성 하고 <code>schema.json</code> 파일에 정의 된 옵션 값을 저장하는 인터페이스를 정의 하십시오.
ru: Создайте файл <code>schema.ts</code> и определите интерфейс, в котором хранятся значения параметров, определенных в файле <code>schema.json</code> .

source: Create a <code>typings.d.ts</code> file in your <code>src/</code> folder. This file is automatically included as global type definition.
es: Cree un archivo <code>typings.d.ts</code> en su carpeta <code>src/</code> . Este archivo se incluye autom&aacute;ticamente como definici&oacute;n de tipo global.
ja: <code>src/</code> フォルダーに <code>typings.d.ts</code> ファイルを作成します。このファイルは、グローバルタイプ定義として自動的に含まれます。
ko: <code>src/</code> 폴더 에 <code>typings.d.ts</code> 파일을 만듭니다 . 이 파일은 전역 유형 정의로 자동 포함됩니다.
ru: Создайте файл <code>typings.d.ts</code> в вашей папке <code>src/</code> . Этот файл автоматически включается как определение глобального типа.

source: Create a Hero class
es: Crear una clase de Héroe
ja: ヒーロークラスを作る
ko: 영웅 클래스 만들기
ru: Создать класс Героя

source: Create a Hero interface
ja: ヒーローインターフェイスを作成する
ko: Hero 인터페이스 만들기
ru: Создать интерфейс Героя

source: Create a cart component and configure routing to the new component. At this point, the cart view has only default text.
ja: カートコンポーネントを作成し、新しいコンポーネントへのルーティングを設定します。この時点では、カートビューにはデフォルトのテキストしかありません。
ko: 카트 구성 요소를 만들고 새 구성 요소에 대한 라우팅을 구성합니다. 이 시점에서 장바구니보기에는 기본 텍스트 만 있습니다.
ru: Создайте компонент корзины и настройте маршрутизацию к новому компоненту.На данный момент в корзине отображается только текст по умолчанию.

source: Create a cart component and set up routing to the new component. At this point, the cart page will only have default text.
es: Crear un componente de carro y establecer el camino hacia el nuevo componente.En este momento,la página del carro sólo tendrá texto por defecto.
ja: カートコンポーネントを作成し、新しいコンポーネントへのルーティングを設定します。この時点では、カートページにはデフォルトのテキストのみが表示されます。
ko: 장바구니 구성 요소를 작성하고 새 구성 요소에 대한 라우팅을 설정하십시오. 이 시점에서 장바구니 페이지에는 기본 텍스트 만 있습니다.
ru: Создайте компонент корзины и настройте маршрутизацию к новому компоненту.На этом этапе страница корзины будет содержать только текст по умолчанию.

source: Create a component to render AngularJS content
es: Crear un componente para renderizar el contenido de AngularJS
ja: AngularJSのコンテンツをレンダリングするためのコンポーネントを作成する
ko: AngularJS 컨텐츠를 렌더링하기위한 컴포넌트 생성
ru: Создайте компонент для отображения содержимого AngularJS

source: Create a component using the new keyword.
ja: 新しいキーワードを使ってコンポーネントを作成します。
ko: new 키워드를 사용하여 구성 요소를 만듭니다.
ru: Создайте компонент,используя новое ключевое слово.

source: Create a component, <em>crisis-list</em>.
ja: コンポーネント、<em>危機リストを</em>作成します。
ko: 구성 요소, <em>위기 목록을</em> 만듭니다 .
ru: Создайте компонент, <em>кризис-лист</em> .

source: Create a custom <code><a href="../api/router/route#matcher">matcher</a></code> function for AngularJS-specific URLs and configure the Angular <code><a href="../api/router/router">Router</a></code> with the custom matcher for AngularJS routes.
es: Cree una funci&oacute;n de <code><a href="../api/router/route#matcher">matcher</a></code> personalizada para URL espec&iacute;ficas de AngularJS y configure el <code><a href="../api/router/router">Router</a></code> angular con la coincidencia personalizada para rutas de AngularJS.
ja: AngularJS固有のURLのカスタム <code><a href="../api/router/route#matcher">matcher</a></code> 関数を作成し、AngularJSルートのカスタムマッチャーを使用してAngular <code><a href="../api/router/router">Router</a></code> を構成します。
ko: AngularJS 특정 URL에 대한 사용자 정의 <code><a href="../api/router/route#matcher">matcher</a></code> 기능을 작성하고 AngularJS 경로에 대한 사용자 정의 매처를 사용하여 Angular <code><a href="../api/router/router">Router</a></code> 를 구성하십시오 .
ru: Создайте пользовательскую функцию <code><a href="../api/router/route#matcher">matcher</a></code> для URL-адресов, специфичных для AngularJS, и настройте Angular <code><a href="../api/router/router">Router</a></code> с настраиваемым сопоставителем для маршрутов AngularJS.

source: Create a custom <code>matcher</code> function for AngularJS-specific URLs and configure the Angular <code><a href="../api/router/router">Router</a></code> with the custom matcher for AngularJS routes.
ja: AngularJS固有のURLのカスタム <code>matcher</code> 関数を作成し、AngularJSルートのカスタムマッチャーを使用してAngular <code><a href="../api/router/router">Router</a></code> を構成します。
ko: AngularJS 특정 URL에 대한 사용자 지정 <code>matcher</code> 함수를 만들고 AngularJS 경로에 대한 사용자 지정 매처를 사용하여 Angular <code><a href="../api/router/router">Router</a></code> 를 구성합니다 .
ru: Создайте настраиваемую функцию <code>matcher</code> для URL-адресов, специфичных для AngularJS, и настройте <code><a href="../api/router/router">Router</a></code> Angular с настраиваемым сопоставлением для маршрутов AngularJS.

source: Create a dynamic form template
ja: ダイナミックフォームのテンプレートを作成する
ko: 동적 양식 서식 파일 만들기
ru: Создать шаблон динамической формы

source: Create a factory function that returns that instance.
es: Crear una función de fábrica que devuelva esa instancia.
ja: そのインスタンスを返すファクトリ関数を作成します。
ko: 해당 인스턴스를 반환하는 팩토리 함수를 만듭니다.
ru: Создайте фабричную функцию,которая возвращает этот экземпляр.

source: Create a feature component
ja: フィーチャーコンポーネントの作成
ko: 기능 구성 요소 만들기
ru: Создать функциональный компонент

source: Create a feature module with routing
es: Crear un módulo de características con enrutamiento
ja: ルーティング機能を持つフィーチャモジュールを作成する
ko: 라우팅 기능 모듈 만들기
ru: Создать функциональный модуль с маршрутизацией

source: Create a file <code>proxy.conf.json</code> in your project's <code>src/</code> folder.
es: Cree un archivo <code>proxy.conf.json</code> en la carpeta <code>src/</code> de su proyecto .
ja: プロジェクトの <code>src/</code> フォルダーにファイル <code>proxy.conf.json</code> を作成します。
ko: 프로젝트의 <code>src/</code> 폴더에 <code>proxy.conf.json</code> 파일을 만듭니다 .
ru: Создайте файл <code>proxy.conf.json</code> в папке <code>src/</code> вашего проекта .

source: Create a file called <code>mock-heroes.ts</code> in the <code>src/app/</code> folder. Define a <code>HEROES</code> constant as an array of ten heroes and export it. The file should look like this.
es: Cree un archivo llamado <code>mock-heroes.ts</code> en la carpeta <code>src/app/</code> . Defina una constante <code>HEROES</code> como un conjunto de diez h&eacute;roes y exp&oacute;rtela. El archivo deber&iacute;a verse as&iacute;.
ja: ファイルを作成 <code>mock-heroes.ts</code> 中 <code>src/app/</code> フォルダを。 <code>HEROES</code> 定数を10人のヒーローの配列として定義し、エクスポートします。ファイルは次のようになります。
ko: <code>src/app/</code> 폴더 에 <code>mock-heroes.ts</code> 라는 파일을 만듭니다 . <code>HEROES</code> 상수를 10 명의 영웅 배열로 정의 하고 내 보냅니다. 파일은 다음과 같아야합니다.
ru: Создайте файл с именем <code>mock-heroes.ts</code> в папке <code>src/app/</code> . Определите константу <code>HEROES</code> как массив из десяти героев и экспортируйте ее. Файл должен выглядеть следующим образом.

source: Create a file named <code>__name@dasherize__.service.ts.template</code> that defines a template you can use for generating files. This template will generate a service that already has Angular's <code><a href="../api/common/http/httpclient">HttpClient</a></code> injected into its constructor.
es: Cree un archivo llamado <code>__name@dasherize__.service.ts.template</code> que defina una plantilla que pueda usar para generar archivos. Esta plantilla generar&aacute; un servicio que ya tiene inyectado <code><a href="../api/common/http/httpclient">HttpClient</a></code> de Angular en su constructor.
ja: ファイルの生成に使用できるテンプレートを定義する <code>__name@dasherize__.service.ts.template</code> という名前のファイルを作成します。このテンプレートは、Angularの <code><a href="../api/common/http/httpclient">HttpClient</a></code> がコンストラクターに挿入されたサービスを生成します。
ko: 파일 생성에 사용할 수있는 템플릿을 정의하는 <code>__name@dasherize__.service.ts.template</code> 이라는 파일을 만듭니다 . 이 템플릿은 이미 Angular의 <code><a href="../api/common/http/httpclient">HttpClient</a></code> 가 생성자에 삽입 된 서비스를 생성합니다 .
ru: Создайте файл с именем <code>__name@dasherize__.service.ts.template</code> , который определяет шаблон, который вы можете использовать для генерации файлов. Этот шаблон сгенерирует сервис, в который уже встроен <code><a href="../api/common/http/httpclient">HttpClient</a></code> Angular в его конструктор.
