Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/css/css.*.017.xlf
Languages: es, ko, zh_cn

source: What we are doing here when defining all four lines, is defining the area by specifying the lines that enclose that area.
es: Lo que estamos haciendo aquí al definir las cuatro líneas,es definir el área especificando las líneas que encierran esa área.
ko: 4 개의 라인을 모두 정의 할 때 여기서하고있는 것은 해당 영역을 둘러싸는 라인을 지정하여 영역을 정의하는 것입니다.
zh_cn: 我们在这里定义这四条线的时候,是通过指定包围这个区域的线来定义区域。

source: What we need is a way to remove the width if <code>display: grid</code> is supported. This is exactly the situation feature queries solve. We can set the <code>width</code> back to <code>auto</code> if grid is supported.
ko: <code>display: grid</code> 가 지원되는 경우 너비를 제거하는 방법이 필요합니다 . 이것은 정확히 상황 기능 쿼리가 해결하는 것입니다. 그리드가 지원되는 경우 <code>width</code> 다시 <code>auto</code> 설정할 수 있습니다 .
zh_cn: 我们需要的是一种在 <code>display: grid</code> 支持的情况下删除宽度的方法。这正是功能查询解决的情况。如果支持网格，我们可以将 <code>width</code> 设置回 <code>auto</code> 。

source: When <code>calc()</code> is used for controlling text size, be sure that one of the values includes a <a href="length#Relative_length_units">relative length unit</a>, for example:
es: Cuando <code>calc()</code> se usa para controlar el tama&ntilde;o del texto, aseg&uacute;rese de que uno de los valores incluya una <a href="length#Relative_length_units">unidad de longitud relativa</a> , por ejemplo:
ko: 경우 <code>calc()</code> 제어하는 문자 크기에 사용되는, 확인 된 값 중 하나가 포함 할 <a href="length#Relative_length_units">상대적인 길이 단위</a> , 예를 들어 :
zh_cn: 使用 <code>calc()</code> 控制文本大小时，请确保其中一个值包含<a href="length#Relative_length_units">相对长度单位</a>，例如：

source: When <code>calc()</code> is used where an <a href="integer"><code>&lt;integer&gt;</code></a> is expected, the value will be rounded to the nearest integer. For example:
ko: 경우 <code>calc()</code> 여기서 사용되는 <a href="integer"> <code>&lt;integer&gt;</code> </a> 예상 값은 가장 가까운 정수로 반올림 될 것이다. 예를 들면 :
zh_cn: 当 <code>calc()</code> 被用于其中的<a href="integer"> <code>&lt;integer&gt;</code> </a>预计，该值将被舍入到最接近的整数。例如：

source: When <code>grid-column-end</code> is omitted, if <code>grid-column-start</code> is a <a href="custom-ident"><code>&lt;custom-ident&gt;</code></a>, <code>grid-column-end</code> is set to that <code>&lt;custom-ident&gt;</code>; otherwise, it is set to <code>auto</code>.
es: Cuando se omite <code>grid-column-end</code> , si <code>grid-column-start</code> es un <a href="custom-ident"> <code>&lt;custom-ident&gt;</code> </a> , <code>grid-column-end</code> se establece en ese <code>&lt;custom-ident&gt;</code> ; de lo contrario, se establece en <code>auto</code> m&aacute;tico .
ko: 경우 <code>grid-column-end</code> 생략되면, <code>grid-column-start</code> A는 <a href="custom-ident"> <code>&lt;custom-ident&gt;</code> </a> , <code>grid-column-end</code> 값으로 설정된다 <code>&lt;custom-ident&gt;</code> ; 그렇지 않으면 <code>auto</code> 로 설정됩니다 .
zh_cn: 当省略 <code>grid-column-end</code> 时，如果 <code>grid-column-start</code> 是<a href="custom-ident"> <code>&lt;custom-ident&gt;</code> </a>，则 <code>grid-column-end</code> 设置为该 <code>&lt;custom-ident&gt;</code> ；否则，将其设置为 <code>auto</code> 。

source: When <code>grid-column-start</code> is omitted, if <code>grid-row-start</code> is a <code>&lt;custom-ident&gt;</code>, all four longhands are set to that value. Otherwise, it is set to <code>auto</code>.
es: Cuando se omite <code>grid-column-start</code> , si <code>grid-row-start</code> es un <code>&lt;custom-ident&gt;</code> , las cuatro longhands se establecen en ese valor. De lo contrario, se establece en <code>auto</code> m&aacute;tico .
ko: 경우 <code>grid-column-start</code> 생략 될 경우, <code>grid-row-start</code> A는 <code>&lt;custom-ident&gt;</code> , 네 longhands 그 값으로 설정된다. 그렇지 않으면 <code>auto</code> 로 설정됩니다 .
zh_cn: 当省略 <code>grid-column-start</code> 时，如果 <code>grid-row-start</code> 是 <code>&lt;custom-ident&gt;</code> ，则所有四个正手设置为该值。否则，将其设置为 <code>auto</code> 。

source: When <code>grid-row-end</code> is omitted, if <code>grid-row-start</code> is a <code>&lt;custom-ident&gt;</code>, <code>grid-row-end</code> is set to that <code>&lt;custom-ident&gt;</code>; otherwise, it is set to <code>auto</code>.
es: Cuando se omite <code>grid-row-end</code> , si <code>grid-row-start</code> es un <code>&lt;custom-ident&gt;</code> , <code>grid-row-end</code> se establece en ese <code>&lt;custom-ident&gt;</code> ; de lo contrario, se establece en <code>auto</code> m&aacute;tico .
ko: 경우 <code>grid-row-end</code> 생략 될 경우, <code>grid-row-start</code> A는 <code>&lt;custom-ident&gt;</code> , <code>grid-row-end</code> 값으로 설정된다 <code>&lt;custom-ident&gt;</code> ; 그렇지 않으면 <code>auto</code> 로 설정됩니다 .
zh_cn: 当省略 <code>grid-row-end</code> 时，如果 <code>grid-row-start</code> 是 <code>&lt;custom-ident&gt;</code> ，则将 <code>grid-row-end</code> 设置为该 <code>&lt;custom-ident&gt;</code> ；否则，将其设置为 <code>auto</code> 。

source: When <code>lighter</code> or <code>bolder</code> is specified, the below chart shows how the absolute font weight of the element is determined.
ko: 경우 <code>lighter</code> 또는 <code>bolder</code> 지정되면 차트 보여주는 아래의 요소의 절대 폰트 중량을 결정하는 방법.
zh_cn: 当指定 <code>lighter</code> 或 <code>bolder</code> ，下图显示了如何确定元素的绝对字体粗细。

source: When <code>lighter</code> or <code>bolder</code> is specified, the following chart shows how the absolute font weight of the element is determined:
es: Cuando se especifica <code>bolder</code> <code>lighter</code> o m&aacute;s audaz , la siguiente tabla muestra c&oacute;mo se determina el peso absoluto de la fuente del elemento:
ko: 경우 <code>lighter</code> 또는 <code>bolder</code> 지정되면, 다음의 차트에 도시 한 소자의 절대 폰트 중량을 측정하는 방법 :
zh_cn: 当指定 <code>lighter</code> 或 <code>bolder</code> ，下表显示如何确定元素的绝对字体粗细：

source: When <code>max()</code> is used for controlling text size, make sure the text is always large enough to read. A suggestion is to use the <a href="https://developer.mozilla.org/en-US/docs/Web/CSS/min"><code>min()</code></a> function nested within a <code>max()</code> that has as its second value a <a href="length#Relative_length_units">relative length unit</a> that is always large enough to read. For example:
ko: 때 <code>max()</code> 텍스트 크기를 제어하는 데 사용되며, 반드시 텍스트가 항상 읽을 수있는 충분한 지 확인. 두 번째 값 <a href="length#Relative_length_units">으로</a> 항상 읽을 수있을만큼 큰 상대 길이 단위 를 갖는 <code>max()</code> 내에 중첩 된 <a href="https://developer.mozilla.org/en-US/docs/Web/CSS/min"> <code>min()</code> </a> 함수 를 사용 하는 것이 좋습니다. 예를 들면 :
zh_cn: 当使用 <code>max()</code> 控制文本大小时，请确保文本始终足够大以至于可以阅读。建议使用嵌套在 <code>max()</code> 中的<a href="https://developer.mozilla.org/en-US/docs/Web/CSS/min"> <code>min()</code> </a>函数，该函数的第二个值是<a href="length#Relative_length_units">相对长度单位</a>，该长度始终足够大以至于可以读取。例如：

source: When <code>min()</code> is used for controlling text size, make sure the text is always large enough to read. A suggestion is to use the min() function nested within a <a href="https://developer.mozilla.org/en-US/docs/Web/CSS/max"><code>max()</code></a> that has as its second value a <a href="length#Relative_length_units">relative length unit</a> that is always large enough to read. For example:
es: Cuando se usa <code>min()</code> para controlar el tama&ntilde;o del texto, aseg&uacute;rese de que el texto siempre sea lo suficientemente grande como para leerlo. Una sugerencia es utilizar la funci&oacute;n min () anidada dentro de un <a href="https://developer.mozilla.org/en-US/docs/Web/CSS/max"> <code>max()</code> </a> que tiene como segundo valor una <a href="length#Relative_length_units">unidad de longitud relativa</a> que siempre es lo suficientemente grande como para leer. Por ejemplo:
ko: 시 <code>min()</code> 텍스트 크기를 제어하는 데 사용되며, 반드시 텍스트가 항상 읽을 수있는 충분한 지 확인. <a href="https://developer.mozilla.org/en-US/docs/Web/CSS/max"> <code>max()</code> </a> 내에 중첩 된 min () 함수를 두 번째 값으로 사용하여 항상 읽을 수 있는 <a href="length#Relative_length_units">상대 길이 단위를 사용</a> 하는 것이 좋습니다. 예를 들면 다음과 같습니다.
zh_cn: 当 <code>min()</code> 用于控制文本大小时，请确保文本始终足够大以供阅读。建议使用嵌套在<a href="https://developer.mozilla.org/en-US/docs/Web/CSS/max"> <code>max()</code> </a>中的min（）函数，该函数的第二个值是<a href="length#Relative_length_units">相对长度单位</a>，该长度始终足够大以至于可以读取。例如：

source: When <code>position</code> is set to <code>absolute</code> or <code>fixed</code>, the <code>bottom</code> property specifies the distance between the element's bottom edge and the bottom edge of its containing block.
es: Cuando la <code>position</code> se establece en <code>absolute</code> o <code>fixed</code> , la propiedad <code>bottom</code> especifica la distancia entre el borde inferior del elemento y el borde inferior de su bloque contenedor.
ko: 되면 <code>position</code> 에 설정된 <code>absolute</code> 또는 <code>fixed</code> 의 <code>bottom</code> 속성은 요소의 하부 가장자리와 용기 블럭의 하단 사이의 거리를 지정한다.
zh_cn: 当 <code>position</code> 设置为 <code>absolute</code> 或 <code>fixed</code> 时， <code>bottom</code> 属性指定元素的底边与其包含块的底边之间的距离。

source: When <code>position</code> is set to <code>absolute</code> or <code>fixed</code>, the <code>left</code> property specifies the distance between the element's left edge and the left edge of its containing block. (The containing block is the ancestor to which the element is relatively positioned.)
es: Cuando la <code>position</code> se establece en <code>absolute</code> o <code>fixed</code> , la propiedad <code>left</code> especifica la distancia entre el borde izquierdo del elemento y el borde izquierdo de su bloque contenedor. (El bloque contenedor es el antepasado respecto del cual el elemento est&aacute; relativamente posicionado).
ko: 되면 <code>position</code> 에 설정된 <code>absolute</code> 또는 <code>fixed</code> 의 <code>left</code> 속성은 요소의 왼쪽 가장자리와 용기 블럭의 좌측 가장자리 사이의 거리를 지정한다. 포함 블록은 요소가 상대적으로 배치 된 조상입니다.
zh_cn: 当 <code>position</code> 设置为 <code>absolute</code> 或 <code>fixed</code> 时， <code>left</code> 属性指定元素的左边缘与其包含块的左边缘之间的距离。（包含块是元素相对定位到的祖先。）

source: When <code>position</code> is set to <code>absolute</code> or <code>fixed</code>, the <code>right</code> property specifies the distance between the element's right edge and the right edge of its containing block.
es: Cuando la <code>position</code> se establece en <code>absolute</code> o <code>fixed</code> , la propiedad <code>right</code> especifica la distancia entre el borde derecho del elemento y el borde derecho de su bloque contenedor.
ko: 되면 <code>position</code> 에 설정된 <code>absolute</code> 또는 <code>fixed</code> 의 <code>right</code> 속성은 요소의 오른쪽 가장자리와 용기 블럭의 오른쪽 가장자리 사이의 거리를 지정한다.
zh_cn: 当 <code>position</code> 设置为 <code>absolute</code> 或 <code>fixed</code> 时， <code>right</code> 属性指定元素的右边缘与其包含块的右边缘之间的距离。

source: When <code>position</code> is set to <code>absolute</code> or <code>fixed</code>, the <code>top</code> property specifies the distance between the element's top edge and the top edge of its containing block.
ko: 되면 <code>position</code> 에 설정된 <code>absolute</code> 또는 <code>fixed</code> 의 <code>top</code> 속성은 요소의 상부 가장자리와 용기 블럭의 상부 가장자리 사이의 거리를 지정한다.
zh_cn: 当 <code>position</code> 设置为 <code>absolute</code> 或 <code>fixed</code> 时， <code>top</code> 属性指定元素的顶部边缘与其包含块的顶部边缘之间的距离。

source: When <code>position</code> is set to <code>absolute</code> or <code>fixed</code>, the <code>top</code> property specifies the distance between the element's top edge and the top edge of its containing block. (Containing block needs to have property <code>position: relative</code>)
es: Cuando la <code>position</code> se establece en <code>absolute</code> o <code>fixed</code> , la propiedad <code>top</code> especifica la distancia entre el borde superior del elemento y el borde superior de su bloque contenedor. (El bloque que contiene debe tener una <code>position: relative</code> propiedad : relativa )
ko: 되면 <code>position</code> 에 설정된 <code>absolute</code> 또는 <code>fixed</code> 의 <code>top</code> 속성은 요소의 상부 가장자리와 용기 블럭의 상부 가장자리 사이의 거리를 지정한다. (포함하는 블록에는 속성 <code>position: relative</code> 가 있어야합니다 : relative )
zh_cn: 当 <code>position</code> 设置为 <code>absolute</code> 或 <code>fixed</code> 时， <code>top</code> 属性指定元素的顶部边缘与其包含块的顶部边缘之间的距离。（包含块需要具有属性 <code>position: relative</code> ）

source: When <code>position</code> is set to <code>relative</code>, the <code>bottom</code> property specifies the distance the element's bottom edge is moved above its normal position.
es: Cuando la <code>position</code> se establece en <code>relative</code> , la propiedad <code>bottom</code> especifica la distancia que el borde inferior del elemento se mueve por encima de su posici&oacute;n normal.
ko: 시 <code>position</code> 로 설정되어 <code>relative</code> 의 <code>bottom</code> 속성은 요소의 하부 가장자리가 정규 위치 위로 이동되는 거리를 지정한다.
zh_cn: 当 <code>position</code> 设置为 <code>relative</code> 时， <code>bottom</code> 属性指定元素的底边在其正常位置上方移动的距离。

source: When <code>position</code> is set to <code>relative</code>, the <code>left</code> property specifies the distance the element's left edge is moved to the right from its normal position.
es: Cuando la <code>position</code> se establece en <code>relative</code> , la propiedad <code>left</code> especifica la distancia a la que el borde izquierdo del elemento se mueve hacia la derecha desde su posici&oacute;n normal.
ko: 시 <code>position</code> 로 설정되어 <code>relative</code> 의 <code>left</code> 속성은 요소의 왼쪽 에지가 정상 위치에서 오른쪽으로 이동되는 거리를 지정한다.
zh_cn: 当 <code>position</code> 设置为 <code>relative</code> 时， <code>left</code> 属性指定元素的左边缘从其正常位置向右移动的距离。

source: When <code>position</code> is set to <code>relative</code>, the <code>right</code> property specifies the distance the element's right edge is moved to the left from its normal position.
es: Cuando la <code>position</code> se establece en <code>relative</code> , la propiedad <code>right</code> especifica la distancia a la que el borde derecho del elemento se mueve hacia la izquierda desde su posici&oacute;n normal.
ko: 시 <code>position</code> 로 설정되어 <code>relative</code> 의 <code>right</code> 속성은 요소의 오른쪽 가장자리가 정상 위치에서 왼쪽으로 이동하는 거리를 지정한다.
zh_cn: 当 <code>position</code> 设置为 <code>relative</code> 时， <code>right</code> 属性指定元素的右边缘从其正常位置向左移动的距离。

source: When <code>position</code> is set to <code>relative</code>, the <code>top</code> property specifies the distance the element's top edge is moved below its normal position.
es: Cuando la <code>position</code> se establece en <code>relative</code> , la propiedad <code>top</code> especifica la distancia a la que se mueve el borde superior del elemento por debajo de su posici&oacute;n normal.
ko: 시 <code>position</code> 로 설정되어 <code>relative</code> 의 <code>top</code> 속성은 요소의 상부 가장자리가 정상 위치보다 이동 거리를 지정한다.
zh_cn: 当 <code>position</code> 设置为 <code>relative</code> 时， <code>top</code> 属性指定元素的上边缘在其正常位置以下移动的距离。

source: When <code>position</code> is set to <code>static</code>, the <code>bottom</code> property has <em>no effect</em>.
es: Cuando la <code>position</code> se establece en <code>static</code> , la propiedad <code>bottom</code> <em>no</em> tiene <em>ning&uacute;n efecto</em> .
ko: 시 <code>position</code> 로 설정되어 <code>static</code> 의 <code>bottom</code> 속성이없는 <em>효과</em> .
zh_cn: 当 <code>position</code> 设置为 <code>static</code> 时， <code>bottom</code> 属性<em>无效</em>。

source: When <code>position</code> is set to <code>static</code>, the <code>left</code> property has <em>no effect</em>.
es: Cuando la <code>position</code> se establece en <code>static</code> , la propiedad <code>left</code> <em>no</em> tiene <em>ning&uacute;n efecto</em> .
ko: 되면 <code>position</code> 에 설정된 <code>static</code> 상기 <code>left</code> 속성이없는 <em>효과</em> .
zh_cn: 当 <code>position</code> 设置为 <code>static</code> 时， <code>left</code> 属性<em>无效</em>。

source: When <code>position</code> is set to <code>static</code>, the <code>right</code> property has <em>no effect</em>.
es: Cuando la <code>position</code> se establece en <code>static</code> , la propiedad <code>right</code> <em>no</em> tiene <em>efecto</em> .
ko: 시 <code>position</code> 로 설정된 <code>static</code> 의 <code>right</code> 속성이없는 <em>효과</em> .
zh_cn: 当 <code>position</code> 设置为 <code>static</code> 时， <code>right</code> 属性<em>无效</em>。

source: When <code>position</code> is set to <code>static</code>, the <code>top</code> property has <em>no effect</em>.
es: Cuando la <code>position</code> se establece en <code>static</code> , la propiedad <code>top</code> <em>no</em> tiene <em>ning&uacute;n efecto</em> .
ko: 되면 <code>position</code> 에 설정된 <code>static</code> 상기 <code>top</code> 속성이없는 <em>효과</em> .
zh_cn: 当 <code>position</code> 设置为 <code>static</code> 时， <code>top</code> 属性<em>无效</em>。

source: When <code>position</code> is set to <code>sticky</code>, the <code>bottom</code> property behaves like its <code>position</code> is <code>relative</code> when the element is inside the viewport, and like its <code>position</code> is <code>fixed</code> when it is outside.
es: Cuando <code>position</code> se establece en <code>sticky</code> , los <code>bottom</code> se comporta propiedad como su <code>position</code> es <code>relative</code> cuando el elemento est&aacute; dentro de la ventana, y como su <code>position</code> se <code>fixed</code> cuando est&aacute; fuera.
ko: 시 <code>position</code> 로 설정 <code>sticky</code> 의 <code>bottom</code> 그 같은 특성 거동한다 <code>position</code> 인 <code>relative</code> 요소가 뷰포트 내부에있을 때, 그와 같은 <code>position</code> 되어 <code>fixed</code> 이 밖에있을 때.
zh_cn: 当 <code>position</code> 设置为 <code>sticky</code> 时， <code>bottom</code> 属性的行为就像当元素在视口内部时其 <code>position</code> 是 <code>relative</code> 的，而在其外部时则其 <code>position</code> 是 <code>fixed</code> 。

source: When <code>position</code> is set to <code>sticky</code>, the <code>bottom</code> property is used to compute the sticky-constraint rectangle.
ko: 때 <code>position</code> 설정되어 <code>sticky</code> 는 <code>bottom</code> 속성은 끈적-제약 사각형을 계산하는 데 사용됩니다.
zh_cn: 当 <code>position</code> 设置为 <code>sticky</code> 时， <code>bottom</code> 属性用于计算sticky-constraint矩形。

source: When <code>position</code> is set to <code>sticky</code>, the <code>left</code> property behaves like its <code>position</code> is <code>relative</code> when the element is inside the viewport, and like its <code>position</code> is <code>fixed</code> when it is outside.
es: Cuando <code>position</code> se establece en <code>sticky</code> , los <code>left</code> comporta propiedad como su <code>position</code> es <code>relative</code> cuando el elemento est&aacute; dentro de la ventana, y como su <code>position</code> se <code>fixed</code> cuando est&aacute; fuera.
ko: 시 <code>position</code> 로 설정 <code>sticky</code> 의 <code>left</code> 의 속성 등 행동한다 <code>position</code> 인 <code>relative</code> 요소가 뷰포트 내부에있을 때, 그와 같은 <code>position</code> 되어 <code>fixed</code> 이 밖에있을 때.
zh_cn: 当 <code>position</code> 设置为 <code>sticky</code> 时， <code>left</code> 属性的行为类似于元素在视口内部时其 <code>position</code> 是 <code>relative</code> 当元素位于视口外部时则其 <code>position</code> 是 <code>fixed</code> 。

source: When <code>position</code> is set to <code>sticky</code>, the <code>left</code> property is used to compute the sticky-constraint rectangle.
ko: 때 <code>position</code> 설정되어 <code>sticky</code> 의 <code>left</code> 속성은 끈적-제약 사각형을 계산하는 데 사용됩니다.
zh_cn: 当 <code>position</code> 设置为 <code>sticky</code> 时， <code>left</code> 属性用于计算sticky-constraint矩形。

source: When <code>position</code> is set to <code>sticky</code>, the <code>right</code> property behaves like its <code>position</code> is <code>relative</code> when the element is inside the viewport, and like its <code>position</code> is <code>fixed</code> when it is outside.
es: Cuando <code>position</code> se establece en <code>sticky</code> , las <code>right</code> comporta propiedad como su <code>position</code> es <code>relative</code> cuando el elemento est&aacute; dentro de la ventana, y como su <code>position</code> se <code>fixed</code> cuando est&aacute; fuera.
ko: 시 <code>position</code> 로 설정 <code>sticky</code> 의 <code>right</code> 그와 같은 속성 행동한다 <code>position</code> 인 <code>relative</code> 요소가 뷰포트 내부에있을 때, 그와 같은 <code>position</code> 되어 <code>fixed</code> 이 밖에있을 때.
zh_cn: 当 <code>position</code> 设置为 <code>sticky</code> 时， <code>right</code> 属性的行为就像当元素在视口内部时其 <code>position</code> 是 <code>relative</code> ，而在元素位于视口外部时则其 <code>position</code> 是 <code>fixed</code> 。

source: When <code>position</code> is set to <code>sticky</code>, the <code>right</code> property is used to compute the sticky-constraint rectangle.
ko: 때 <code>position</code> 설정되어 <code>sticky</code> 는 <code>right</code> 속성은 끈적-제약 사각형을 계산하는 데 사용됩니다.
zh_cn: 当 <code>position</code> 设置为 <code>sticky</code> 时， <code>right</code> 属性用于计算sticky-constraint矩形。

source: When <code>position</code> is set to <code>sticky</code>, the <code>top</code> property behaves like its <code>position</code> is <code>relative</code> when the element is inside the viewport, and like its <code>position</code> is <code>fixed</code> when it is outside.
es: Cuando <code>position</code> se establece en <code>sticky</code> , las <code>top</code> comporta propiedad como su <code>position</code> es <code>relative</code> cuando el elemento est&aacute; dentro de la ventana, y como su <code>position</code> se <code>fixed</code> cuando est&aacute; fuera.
ko: 시 <code>position</code> 로 설정 <code>sticky</code> 의 <code>top</code> 그 같은 특성 거동한다 <code>position</code> 인 <code>relative</code> 요소가 뷰포트 내부에있을 때, 그와 같은 <code>position</code> 되어 <code>fixed</code> 이 밖에있을 때.
zh_cn: 当 <code>position</code> 设置为 <code>sticky</code> 时， <code>top</code> 属性的行为类似于元素在视口内部时其 <code>position</code> 是 <code>relative</code> 的，并且就像其 <code>position</code> 在外部时是 <code>fixed</code> 。

source: When <code>position</code> is set to <code>sticky</code>, the <code>top</code> property is used to compute the sticky-constraint rectangle.
ko: 때 <code>position</code> 설정되어 <code>sticky</code> 는 <code>top</code> 속성은 끈적-제약 사각형을 계산하는 데 사용됩니다.
zh_cn: 当 <code>position</code> 设置为 <code>sticky</code> 时， <code>top</code> 属性用于计算sticky-constraint矩形。

source: When <strong>four</strong> positions are specified, they create slices measured from the <strong>top</strong>, <strong>right</strong>, <strong>bottom</strong>, and <strong>left</strong> in that order (clockwise).
es: Cuando se especifican <strong>cuatro</strong> posiciones, crean cortes medidos desde la <strong>parte superior</strong> , <strong>derecha</strong> , <strong>inferior</strong> e <strong>izquierda</strong> en ese orden (en sentido horario).
ko: 때는 <strong>네 개의</strong> 위치가 지정되며, 그들로부터 측정 슬라이스 생성 <strong>상단</strong> , <strong>우측</strong> , <strong>하단</strong> 그리고 <strong>좌</strong> 순서 (시계 방향)이다.
zh_cn: 当指定了<strong>四个</strong>位置时，它们创建从<strong>上</strong>，<strong>右</strong>，<strong>下</strong>和<strong>左</strong>按该顺序（顺时针）测量的切片。

source: When <strong>four</strong> values are specified, the colors apply to the <strong>top</strong>, <strong>right</strong>, <strong>bottom</strong>, and <strong>left</strong> in that order (clockwise).
es: Cuando se especifican <strong>cuatro</strong> valores, los colores se aplican a la <strong>parte superior</strong> , <strong>derecha</strong> , <strong>inferior</strong> e <strong>izquierda</strong> en ese orden (en sentido horario).
ko: 때 <strong>네 개의</strong> 값을 지정, 색상이 적용 <strong>상단</strong> , <strong>우측</strong> , <strong>하단</strong> 과 <strong>왼쪽</strong> 의 순서 (시계 방향)에서.
zh_cn: 当<strong>4个</strong>指定值，颜色适用于<strong>顶部</strong>，<strong>右</strong>，<strong>底部</strong>和<strong>左侧</strong>的顺序（顺时针方向）这一点。

source: When <strong>four</strong> values are specified, the margins apply to the <strong>top</strong>, <strong>right</strong>, <strong>bottom</strong>, and <strong>left</strong> in that order (clockwise).
es: Cuando se especifican <strong>cuatro</strong> valores, los m&aacute;rgenes se aplican a la <strong>parte superior</strong> , <strong>derecha</strong> , <strong>inferior</strong> e <strong>izquierda</strong> en ese orden (en sentido horario).
ko: 때는 <strong>네 개의</strong> 값이 지정되고, 마진은 적용 <strong>위쪽</strong> , <strong>오른쪽</strong> , <strong>하단</strong> 그리고 <strong>좌</strong> 순서 (시계 방향)이다.
zh_cn: 当指定了<strong>四个</strong>值时，边距将按该顺序（顺时针）应用于<strong>top</strong>，<strong>right</strong>，<strong>bottom</strong>和<strong>left</strong>。
