Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/css/css.*.017.xlf
Languages: es, ko, zh_cn

source: Web App Manifest<br/><small>The definition of 'display-mode' in that specification.</small>
es: Manifiesto de aplicaci&oacute;n web <br/><small>La definici&oacute;n de 'modo de visualizaci&oacute;n' en esa especificaci&oacute;n.</small>
ko: Web App Manifest <br/><small>해당 사양에서 '디스플레이 모드'의 정의.</small>
zh_cn: Web App清单<br/><small>该规范中&ldquo;显示模式&rdquo;的定义。</small>

source: Web Open File Format
es: Formato de archivo abierto en la web
ko: 웹 열기 파일 형식
zh_cn: 网络开放文件格式

source: Web Open File Format 2
es: Formato de archivo abierto en la web 2
ko: 웹 열기 파일 형식 2
zh_cn: 网络开放文件格式2

source: Web Open Font Format
ko: 웹 오픈 글꼴 형식
zh_cn: 网络开放字体格式

source: Web Open Font Format 2
ko: 웹 오픈 글꼴 형식 2
zh_cn: 网络开放字体格式2

source: Web Video Tracks Format (WebVTT)
es: Formato de Pistas de Vídeo en la Web (WebVTT)
ko: 웹 비디오 트랙 형식 (WebVTT)
zh_cn: 网络视频轨迹格式(WebVTT)

source: Web components
es: Componentes de la web
ko: 웹 컴포넌트
zh_cn: 网络组件

source: Web font analysis tools
es: Herramientas de análisis de fuentes web
ko: 웹 글꼴 분석 도구
zh_cn: 网络字体分析工具

source: Web fonts are subject to the same domain restriction (font files must be on the same domain as the page using them), unless <a href="https://developer.mozilla.org/en-US/docs/HTTP_access_control">HTTP access controls</a> are used to relax this restriction.
es: Las fuentes web est&aacute;n sujetas a la misma restricci&oacute;n de dominio (los archivos de fuente deben estar en el mismo dominio que la p&aacute;gina que los usa), a menos que se usen <a href="https://developer.mozilla.org/en-US/docs/HTTP_access_control">controles de acceso HTTP</a> para relajar esta restricci&oacute;n.
ko: <a href="https://developer.mozilla.org/en-US/docs/HTTP_access_control">HTTP 액세스 제어</a> 를 사용하여이 제한을 완화 하지 않는 한 웹 글꼴에는 동일한 도메인 제한이 적용됩니다 (글꼴 파일은이를 사용하는 페이지와 동일한 도메인에 있어야 함) .
zh_cn: Web字体受相同的域限制（字体文件必须与使用它们的页面位于相同的域中），除非使用<a href="https://developer.mozilla.org/en-US/docs/HTTP_access_control">HTTP访问控件</a>来放宽此限制。

source: Web forms &mdash; Working with user data
ko: 웹 양식 &mdash; 사용자 데이터 작업
zh_cn: Web表单&mdash;使用用户数据

source: Web forms &mdash; working with user data
ko: 웹 양식 &mdash; 사용자 데이터 작업
zh_cn: Web表单-使用用户数据

source: WebAIM: Color Contrast Checker
es: WebAIM:Comprobador de Contraste de Color
ko: WebAIM : 색상 대비 검사기
zh_cn: WebAIM:色彩对比度检查器

source: WebKit <a href="https://bugs.webkit.org/show_bug.cgi?id=64583">bug 64583</a>: "WIP: Add CSS property to control printing of backgrounds for individual elements"
ko: WebKit <a href="https://bugs.webkit.org/show_bug.cgi?id=64583">버그 64583</a> : "WIP : 개별 요소에 대한 배경 인쇄를 제어하기 위해 CSS 속성 추가"
zh_cn: WebKit<a href="https://bugs.webkit.org/show_bug.cgi?id=64583">错误64583</a>：&ldquo; WIP：添加CSS属性以控制单个元素的背景打印&rdquo;

source: WebKit Blog <a href="https://webkit.org/blog/5610/more-responsive-tapping-on-ios/">More Responsive Tapping on iOS</a>
es: Blog de WebKit <a href="https://webkit.org/blog/5610/more-responsive-tapping-on-ios/">Tapping m&aacute;s receptivo en iOS</a>
ko: <a href="https://webkit.org/blog/5610/more-responsive-tapping-on-ios/">iOS에서</a> WebKit 블로그 더 반응적인 태핑
zh_cn: WebKit Blog <a href="https://webkit.org/blog/5610/more-responsive-tapping-on-ios/">在iOS上的响应更加灵敏</a>

source: WebKit CSS Extensions
es: Extensiones CSS de WebKit
ko: WebKit CSS 확장
zh_cn: WebKit CSS扩展

source: WebKit CSS extensions
ko: WebKit CSS 확장
zh_cn: WebKit CSS扩展

source: WebKit blog on <a href="https://webkit.org/blog/363/styling-scrollbars/">Styling Scrollbars</a>
ko: <a href="https://webkit.org/blog/363/styling-scrollbars/">스타일링 스크롤바</a> 에 대한 WebKit 블로그
zh_cn: <a href="https://webkit.org/blog/363/styling-scrollbars/">样式滚动条</a>上的WebKit博客

source: WebKit bug 175497
ko: WebKit 버그 175497

source: WebKit-based browsers originally implemented an older draft of CSS3 <code>background-size</code> in which an omitted second value is treated as duplicating the first value; this draft does not include the <code>contain</code> or <code>cover</code> keywords.
es: Los navegadores basados ​​en WebKit originalmente implementaron un borrador anterior de <code>background-size</code> CSS3 en el que un segundo valor omitido se trata como duplicaci&oacute;n del primer valor; Este borrador no incluye las palabras clave <code>contain</code> o <code>cover</code> .
ko: WebKit 기반 브라우저는 원래 생략 된 두 번째 값이 첫 번째 값을 복제하는 것으로 간주되는 CSS3 <code>background-size</code> 의 이전 초안을 구현했습니다 . 이 초안에는 <code>contain</code> 또는 <code>cover</code> 키워드 가 포함되어 있지 않습니다 .
zh_cn: 基于WebKit的浏览器最初实现了CSS3 <code>background-size</code> 的较早草案，其中忽略的第二个值被视为与第一个值重复；本草稿不包含 <code>contain</code> 或 <code>cover</code> 关键字。

source: WebKit/Blink compatible browsers like Chrome, Opera and Safari (indicated by the <code>-webkit</code> prefix) support a non-standard pseudo-class <code>::-webkit-file-upload-button</code> which serves the same purpose.
ko: Chrome, Opera 및 Safari ( <code>-webkit</code> 접두사로 표시)와 같은 WebKit / Blink 호환 브라우저 는 동일한 목적을 제공하는 비표준 의사 클래스 <code>::-webkit-file-upload-button</code> 을 지원합니다.
zh_cn: 与WebKit / Blink兼容的浏览器，例如Chrome，Opera和Safari（以 <code>-webkit</code> 前缀表示）支持非标准的伪类 <code>::-webkit-file-upload-button</code> ，该按钮具有相同的作用。

source: WebVTT: The Web Video Text Tracks Format<br/><small>The definition of '::cue' in that specification.</small>
es: WebVTT: El formato de pistas de texto de video web <br/><small>La definici&oacute;n de ':: cue' en esa especificaci&oacute;n.</small>
ko: WebVTT : 웹 비디오 텍스트 트랙 형식 <br/><small>해당 사양에서 ':: cue'의 정의.</small>
zh_cn: WebVTT：Web视频文本轨道格式<br/><small>该规范中&ldquo; :: cue&rdquo;的定义。</small>

source: WebVTT: The Web Video Text Tracks Format<br/><small>The definition of 'the <code>::cue-region</code> pseudo-element' in that specification.</small>
ko: WebVTT : 웹 비디오 텍스트 트랙 형식 <small>해당 사양에서 ' </small><small> <code>::cue-region</code> </small><small> 의사 요소' </small><br/><small>의 정의 .</small>
zh_cn: WebVTT：Web视频文本轨道格式<br/><small>该规范中&ldquo; <code>::cue-region</code> 伪元素&rdquo;的定义。</small>

source: WebView 65 stopped creating layout objects for elements inside an <code>&lt;iframe&gt;</code> with <code>display:none</code> applied.
ko: 웹보기 (65)는 내부 요소 레이아웃 객체를 생성하는 정지 <code>&lt;iframe&gt;</code> 해당 함께 <code>display:none</code> 인가되지.
zh_cn: WebView 65停止为 <code>&lt;iframe&gt;</code> 中的元素创建具有 <code>display:none</code> 的元素的布局对象。

source: WebView accepts alternate synonyms to its values: <code>padding</code>, <code>border</code>, and <code>content</code>.
ko: WebView는 <code>padding</code> , <code>border</code> 및 <code>content</code> 값에 대한 대체 동의어를 허용 합니다 .
zh_cn: WebView接受其值的替代同义词： <code>padding</code> ， <code>border</code> 和 <code>content</code> 。

source: WebView does not print backgrounds of the <a href="https://developer.mozilla.org/docs/Web/HTML/Element/body"><code>&lt;body&gt;</code></a> element. If this property is set to <code>exact</code> for the <code>&lt;body&gt;</code> element, it will apply only to its descendants.
ko: WebView는 <a href="https://developer.mozilla.org/docs/Web/HTML/Element/body"> <code>&lt;body&gt;</code> </a> 요소의 배경을 인쇄하지 않습니다 . 이 속성이 <code>&lt;body&gt;</code> 요소에 대해 <code>exact</code> 하도록 설정 되면 해당 하위 항목에만 적용됩니다.
zh_cn: WebView不会打印<a href="https://developer.mozilla.org/docs/Web/HTML/Element/body"> <code>&lt;body&gt;</code> </a>元素的背景。如果将此属性设置为与 <code>&lt;body&gt;</code> 元素 <code>exact</code> ，则它将仅应用于其后代。

source: WebView supports the <code>collapse</code> value only on <a href="https://developer.mozilla.org/docs/Web/HTML/Element/tr"><code>&lt;tr&gt;</code></a>, <a href="https://developer.mozilla.org/docs/Web/HTML/Element/thead"><code>&lt;thead&gt;</code></a>, <a href="https://developer.mozilla.org/docs/Web/HTML/Element/tbody"><code>&lt;tbody&gt;</code></a>, and <a href="https://developer.mozilla.org/docs/Web/HTML/Element/tfoot"><code>&lt;tfoot&gt;</code></a>, but not on <a href="https://developer.mozilla.org/docs/Web/HTML/Element/col"><code>&lt;col&gt;</code></a> and <a href="https://developer.mozilla.org/docs/Web/HTML/Element/colgroup"><code>&lt;colgroup&gt;</code></a> elements.
ko: WebView는 <a href="https://developer.mozilla.org/docs/Web/HTML/Element/tr"> <code>&lt;tr&gt;</code> </a> , <a href="https://developer.mozilla.org/docs/Web/HTML/Element/thead"> <code>&lt;thead&gt;</code> </a> , <a href="https://developer.mozilla.org/docs/Web/HTML/Element/tbody"> <code>&lt;tbody&gt;</code> </a> 및 <a href="https://developer.mozilla.org/docs/Web/HTML/Element/tfoot"> <code>&lt;tfoot&gt;</code> </a> 에서만 <code>collapse</code> 값을 지원 하지만 <a href="https://developer.mozilla.org/docs/Web/HTML/Element/col"> <code>&lt;col&gt;</code> </a> 및 <a href="https://developer.mozilla.org/docs/Web/HTML/Element/colgroup"> <code>&lt;colgroup&gt;</code> </a> 요소 에서는 지원하지 않습니다 .
zh_cn: WebView仅在<a href="https://developer.mozilla.org/docs/Web/HTML/Element/tr"> <code>&lt;tr&gt;</code> </a>，<a href="https://developer.mozilla.org/docs/Web/HTML/Element/thead"> <code>&lt;thead&gt;</code> </a>，<a href="https://developer.mozilla.org/docs/Web/HTML/Element/tbody"> <code>&lt;tbody&gt;</code> </a>和<a href="https://developer.mozilla.org/docs/Web/HTML/Element/tfoot"> <code>&lt;tfoot&gt;</code> </a>上支持 <code>collapse</code> 值，但在<a href="https://developer.mozilla.org/docs/Web/HTML/Element/col"> <code>&lt;col&gt;</code> </a>和<a href="https://developer.mozilla.org/docs/Web/HTML/Element/colgroup"> <code>&lt;colgroup&gt;</code> </a>元素上不支持折叠值。

source: WebView treats <code>auto</code> as <code>optimizeSpeed</code>.
ko: WebView는 <code>auto</code> 를 <code>optimizeSpeed</code> 로 취급합니다 .
zh_cn: WebView将 <code>auto</code> 视为 <code>optimizeSpeed</code> 。

source: WebView treats <code>visibility: collapse</code> like <code>hidden</code>, leaving a white gap.
ko: WebView는 <code>visibility: collapse</code> 처리 합니다. 축소 는 <code>hidden</code> 으로 흰색 틈을 남깁니다.
zh_cn: WebView对待 <code>visibility: collapse</code> 像 <code>hidden</code> 一样塌陷，留下空白。

source: Webkit accepts alternate synonyms to its values: <code>padding</code>, <code>border</code>, and <code>content</code>.
ko: Webkit은 <code>padding</code> , <code>border</code> 및 <code>content</code> 값에 대한 대체 동의어를 허용 합니다 .
zh_cn: Webkit接受其值的替代同义词： <code>padding</code> ， <code>border</code> 和 <code>content</code> 。

source: Webkit also supports the prefixed version of this property, and in that case, in addition to the current keywords, the alternative synonyms are: <code>padding</code>, <code>border</code>, and <code>content</code>.
es: Webkit tambi&eacute;n admite la versi&oacute;n prefijada de esta propiedad y, en ese caso, adem&aacute;s de las palabras clave actuales, los sin&oacute;nimos alternativos son: <code>padding</code> , <code>border</code> y <code>content</code> .
ko: 또한 Webkit은이 속성의 접두사 버전을 지원하며,이 경우 현재 키워드 외에 대체 동의어는 <code>padding</code> , <code>border</code> 및 <code>content</code> 입니다.
zh_cn: Webkit还支持此属性的前缀版本，在这种情况下，除了当前的关键字之外，其他同义词还包括： <code>padding</code> ， <code>border</code> 和 <code>content</code> 。

source: Webview 79 adds internal support only for mapped values
ko: Webview 79는 매핑 된 값에 대해서만 내부 지원을 추가합니다.
zh_cn: Webview 79增加了仅对映射值的内部支持。

source: Weight (represented by the <code>wght</code> tag) defines the design axis of how thin or thick (light or heavy, in typical typographic terms) the strokes of the letterforms can be. For a long time in CSS there has existed the ability to specify this via the <a href="../font-weight"><code>font-weight</code></a> property, which takes numeric values ranging from 100 to 900 in increments of 100, and keywords like <code>normal</code> or <code>bold</code>, which are simply aliases for their corresponding numeric values (400 and 700 in this case). These are still applied when dealing with non-variable or variable fonts, but with variable ones, any number from 1 to 1000 is now valid.
ko: 두께 ( <code>wght</code> 태그로 표시)는 문자 양식의 획이 얼마나 얇거나 두껍게 (일반적인 타이포그래피 용어로 가볍거나 무거움) 디자인 축을 정의합니다. 오랫동안 CSS에서는 100에서 900까지의 숫자 값을 100 씩 증가 시키는 <a href="../font-weight"> <code>font-weight</code> </a> 속성과 해당 숫자의 별칭 인 <code>normal</code> 또는 <code>bold</code> 와 같은 키워드 를 통해이를 지정할 수있는 기능이있었습니다. 값 (이 경우 400 및 700). 비가 변 또는 가변 글꼴을 다룰 때도 여전히 적용되지만 가변 글꼴을 사용하면 이제 1에서 1000까지의 모든 숫자가 유효합니다.
zh_cn: 重量（由 <code>wght</code> 标记表示）定义了字母形状的笔划可以多薄或多厚（在典型的印刷术语中为轻或重）的设计轴。长期以来，CSS中一直存在通过<a href="../font-weight"> <code>font-weight</code> </a>属性指定此功能的能力，该属性采用100到900之间的数字值（以100为增量），以及 <code>normal</code> 或 <code>bold</code> 等关键字，它们只是其对应数字的别名值（在这种情况下为400和700）。在处理非可变字体或可变字体时，这些变量仍然适用，但是对于可变字体，现在从1到1000的任何数字都有效。

source: Weight (represented by the <code>wght</code> tag) defines the design axis of how thin or thick (light or heavy, in typical typographic terms) the strokes of the letterforms can be. For a long time in CSS there has existed the ability to specify this via the <a href="../font-weight"><code>font-weight</code></a> property, which takes numeric values ranging from 100 to 900 in increments of 100, and keywords like <code>normal</code> or <code>bold</code>, which are were simply aliases for their corresponding numeric values (400 and 700 in this case). These are still applied when dealing with non-variable or variable fonts, but with variable ones, any number from 1 to 1000 is now valid.
es: El peso (representado por la etiqueta <code>wght</code> ) define el eje de dise&ntilde;o de qu&eacute; tan delgadas o gruesas (ligeras o pesadas, en t&eacute;rminos tipogr&aacute;ficos t&iacute;picos) pueden ser los trazos de las formas de las letras. Durante mucho tiempo en CSS ha existido la capacidad de especificar esto a trav&eacute;s de la propiedad <a href="../font-weight"> <code>font-weight</code> </a> , que toma valores num&eacute;ricos que van de 100 a 900 en incrementos de 100, y palabras clave como <code>normal</code> o <code>bold</code> , que son simplemente alias para sus correspondientes valores num&eacute;ricos (400 y 700 en este caso). Todav&iacute;a se aplican cuando se trata de fuentes no variables o variables, pero con las variables, cualquier n&uacute;mero del 1 al 1000 ahora es v&aacute;lido.
ko: 가중치 ( <code>wght</code> 태그로 표시)는 글자체의 획이 얇거나 두껍거나 (일반적인 활자체 용어로 가볍거나 무거움) 디자인 축을 정의합니다. CSS에서 오랜 시간 동안을 통해이 지정하는 기능이 존재 해왔다 <a href="../font-weight"> <code>font-weight</code> </a> 와 같은 숫자 (100)의 단위로 100에서 900까지의 값 및 키워드 소요 재산, <code>normal</code> 또는 <code>bold</code> 자신의 대응에 대해 단순히 별명이었다있다, 숫자 값 (이 경우 400 및 700). 이러한 변수는 가변 또는 가변 글꼴을 처리 할 때 여전히 적용되지만 가변 글꼴을 사용하면 1에서 1000 사이의 숫자가 유효합니다.
zh_cn: 重量（由 <code>wght</code> 标签表示）定义了字母形状的笔划可以多薄或多厚（在典型的印刷术语中为轻或重）的设计轴。长期以来，CSS中一直存在通过<a href="../font-weight"> <code>font-weight</code> </a>属性指定此功能的能力，该属性接受从100到900的数字值（以100为增量）以及诸如 <code>normal</code> 或 <code>bold</code> 之类的关键字，它们只是其对应名称的别名数值（在这种情况下为400和700）。在处理非可变或可变字体时，这些变量仍然适用，但是对于可变字体，从1到1000的任何数字现在都有效。

source: Weight (wght)
es: Peso (wght)
ko: 무게 (wght)
zh_cn: 重量(wght)

source: What Happens with Invalid Variables?
es: ¿Qué sucede con las variables inválidas?
ko: 유효하지 않은 변수는 어떻게됩니까?
zh_cn: 无效变量是怎么回事?

source: What I Learned In One Weekend With CSS Shapes
es: Lo que aprendí en un fin de semana con las formas CSS
ko: CSS 모양으로 한 주말에 배운 것
zh_cn: 我在一个周末学到的CSS形状知识

source: What about the old values of display?
ko: 디스플레이의 오래된 가치는 어떻습니까?
zh_cn: 旧的显示值呢?

source: What can be considered strange is that DIV #2 (z-index: 2) is above DIV #4 (z-index: 10), despite their z-index values. The reason is that they do not belong to the same stacking context. DIV #4 belongs to the stacking context created by DIV #3, and as explained previously DIV #3 (and all its content) is under DIV #2.
ko: 이상하다고 생각할 수있는 것은 DIV # 2 (z-index : 2)가 z-index 값에도 불구하고 DIV # 4 (z-index : 10)보다 높다는 것입니다. 그 이유는 동일한 스택 컨텍스트에 속하지 않기 때문입니다. DIV # 4는 DIV # 3에 의해 생성 된 스택 컨텍스트에 속하며 이전에 설명했듯이 DIV # 3 (및 모든 콘텐츠)은 DIV # 2 아래에 있습니다.
zh_cn: 奇怪的是,DIV #2(z-index:2)高于DIV #4(z-index:10),尽管它们的z-index值是一样的。原因是它们不属于同一个堆叠上下文。DIV #4属于DIV #3创建的堆叠上下文,如前所述,DIV #3(及其所有内容)在DIV #2之下。

source: What can&rsquo;t we do with auto-placement (yet)?
es: &iquest;Qu&eacute; no podemos hacer con la colocaci&oacute;n autom&aacute;tica (todav&iacute;a)?
ko: 자동 배치 (아직)로 할 수없는 것은 무엇입니까?
zh_cn: 自动放置我们还不能做什么？

source: What does the specification define?
es: ¿Qué define la especificación?
ko: 사양은 무엇을 정의합니까?
zh_cn: 规范定义了什么?

source: What does this mean for designing with grid layout in practice?
es: ¿Qué significa esto para el diseño con cuadrícula en la práctica?
ko: 실제로 그리드 레이아웃으로 디자인 할 때 이것이 무엇을 의미합니까?
zh_cn: 这对于实践中的网格布局设计有什么意义呢?

source: What grid and flexbox demonstrate, however, is that an element has both an <strong>outer</strong> and an <strong>inner</strong> display type. The outer display type describes whether the element is block-level or inline-level. The inner display type describes how the children of that box behave.
ko: 그러나 그리드와 플렉스 박스가 보여주는 것은 요소에 <strong>외부</strong> 및 <strong>내부</strong> 표시 유형 이 모두 있다는 것 입니다. 외부 표시 유형은 요소가 블록 수준인지 인라인 수준인지를 설명합니다. 내부 표시 유형은 해당 상자의 자식이 작동하는 방식을 설명합니다.
zh_cn: 但是，grid和flexbox演示的是元素同时具有<strong>外部</strong>和<strong>内部</strong>显示类型。外部显示类型描述元素是块级还是内联级。内部显示类型描述该框的子级的行为。

source: What happens when an item overflows the column it is in and what happens when there is too much columned content to fit a container.
es: Qué sucede cuando un artículo desborda la columna en la que se encuentra y qué sucede cuando hay demasiado contenido en la columna para que quepa en un contenedor.
ko: 항목이 열에 넘칠 때 발생하는 일과 컨테이너에 맞지 않는 열이 많은 내용이있을 때 발생하는 일.
zh_cn: 当一个项目溢出它所在的列时,会发生什么,当有太多的列式内容无法容纳一个容器时,会发生什么。

source: What happens when we change the value of the display property?
ko: 디스플레이 속성의 값을 변경하면 어떻게됩니까?
zh_cn: 当我们改变显示属性的值时会发生什么?

source: What happens with invalid variables?
ko: 유효하지 않은 변수는 어떻게됩니까?
zh_cn: 无效变量会怎样?

source: What if I need to debug it?
ko: 디버그해야하는 경우 어떻게합니까?
zh_cn: 如果我需要调试呢?

source: What if I need to disable it?
ko: 비활성화해야하는 경우 어떻게합니까?
zh_cn: 如果我需要禁用它呢?

source: What is a grid?
es: ¿Qué es una cuadrícula?
ko: 그리드 란?
zh_cn: 什么是网格?

source: What is a viewport?
es: ¿Qué es un mirador?
ko: 뷰포트 란 무엇입니까?
zh_cn: 什么是视口?

source: What is an accessible name? | The Paciello Group
es: ¿Qué es un nombre accesible? | El Grupo Paciello
ko: 접근 가능한 이름은 무엇입니까? | Paciello 그룹
zh_cn: 什么是无障碍名称?| 帕吉洛集团

source: What is overflow?
es: ¿Qué es el desbordamiento?
ko: 오버 플로우 란 무엇입니까?
zh_cn: 什么是溢出?

source: What is worth noting is that the <code>margin-box</code> will clip the shape, therefore shapes created in reference to other shapes which extend past the margin box will have the shape clipped to the margin box. We will see this in the following examples of basic shapes.
es: Lo que vale la pena se&ntilde;alar es que el <code>margin-box</code> recortar&aacute; la forma, por lo tanto, las formas creadas en referencia a otras formas que se extiendan m&aacute;s all&aacute; del cuadro de margen tendr&aacute;n la forma recortada en el cuadro de margen. Veremos esto en los siguientes ejemplos de formas b&aacute;sicas.
ko: 주목할 가치가있는 것은 <code>margin-box</code> 가 모양을 자르기 때문에 여백 상자를지나 확장되는 다른 모양과 관련하여 생성 된 모양은 모양이 여백 상자에 잘립니다. 다음 기본 도형 예제에서이를 확인할 수 있습니다.
zh_cn: 值得注意的是， <code>margin-box</code> 将剪切形状，因此，参照其他形状延伸超出边距框的形状创建的形状将被剪切到边距框。我们将在以下基本形状示例中看到这一点。

source: What it looks like
es: Lo que parece
ko: 어떻게 생겼는지
zh_cn: 它看起来像什么

source: What really matters here is the class "moved"; let's take a look at what it does. First, the <code><a href="perspective">perspective()</a></code> function positions the viewer relative to the plane that lies where z=0 (in essence, the surface of the screen). A value of <code>500px</code> means the user is 500 pixels "in front of" the imagery located at z=0.
es: Lo que realmente importa aqu&iacute; es la clase "movida"; Echemos un vistazo a lo que hace. Primero, la funci&oacute;n <code><a href="perspective">perspective()</a></code> posiciona al espectador en relaci&oacute;n con el plano que se encuentra donde z = 0 (en esencia, la superficie de la pantalla). Un valor de 500 <code>500px</code> significa que el usuario est&aacute; 500 p&iacute;xeles "delante de" las im&aacute;genes ubicadas en z = 0.
ko: 여기서 중요한 것은 "움직 인"클래스입니다. 그것이 무엇을하는지 보자. 먼저 <code><a href="perspective">perspective()</a></code> 함수는 z = 0 (실질적으로 화면 표면)에있는 평면을 기준으로 뷰어를 배치합니다. <code>500px</code> 값은 사용자가 z = 0에있는 이미지 앞에 "500 픽셀"이라는 것을 의미합니다.
zh_cn: 这里真正重要的是&ldquo;感动&rdquo;的阶级。让我们看看它的作用。首先， <code><a href="perspective">perspective()</a></code> 函数将查看器相对于z = 0所在的平面（实质上是屏幕表面）定位。 <code>500px</code> 的值表示用户位于位于z = 0的图像&ldquo;前面&rdquo;的500个像素。

source: What sets the base size of the item?
es: ¿Qué establece el tamaño de la base del artículo?
ko: 항목의 기본 크기는 어떻게 설정됩니까?
zh_cn: 项目的基本尺寸是怎么设定的?

source: What should I do if I used the old Firefox implementation?
ko: 이전 Firefox 구현을 사용한 경우 어떻게해야합니까?
zh_cn: 如果我使用旧的Firefox实现,应该怎么办?

source: What this demonstrates, is that if you are switching the direction of your text, either for entire pages or for parts of pages, and are using lines: you may want to name your lines, if you do not want the layout to completely switch direction. For some things, for example, where a grid contains text content, this switching may be exactly what you want. For other usage it may not.
es: Lo que esto demuestra,es que si se cambia la dirección del texto,ya sea para páginas enteras o para partes de páginas,y se utilizan líneas:es posible que se quiera nombrar las líneas,si no se quiere que la disposición cambie completamente de dirección.Para algunas cosas,por ejemplo,cuando una cuadrícula contiene contenido de texto,este cambio puede ser exactamente lo que usted quiere.Para otros usos puede no serlo.
ko: 이 방법은 전체 페이지 또는 일부 페이지에서 텍스트 방향을 전환하고 라인을 사용하는 경우 레이아웃을 완전히 전환하지 않으려는 경우 라인 이름을 지정할 수 있습니다. . 예를 들어 격자에 텍스트 내용이 포함 된 경우에는이 전환이 원하는 것일 수 있습니다. 다른 용도로는 그렇지 않을 수 있습니다.
zh_cn: 这表明,如果你要切换文本的方向,无论是整个页面还是页面的一部分,并且使用线条:如果你不希望布局完全切换方向,你可能需要为你的线条命名。对于某些事情,例如,在一个网格包含文本内容的地方,这种切换可能正是你想要的。对于其他用途来说,可能就不是了。

source: What this selector matches is defined in <a href="https://html.spec.whatwg.org/multipage/semantics-other.html#selector-default">HTML Standard &sect;4.16.3 Pseudo-classes</a> &mdash; it may match the <a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/button"><code>&lt;button&gt;</code></a>, <code><a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/input/checkbox">&lt;input type="checkbox"&gt;</a></code>, <code><a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/input/radio">&lt;input type="radio"&gt;</a></code>, and <a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/option"><code>&lt;option&gt;</code></a> elements:
ko: 이 선택자가 일치하는 것은 <a href="https://html.spec.whatwg.org/multipage/semantics-other.html#selector-default">HTML 표준 &sect;4.16.3 의사 클래스에</a> 정의되어 있습니다. <a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/button"> <code>&lt;button&gt;</code> </a> , <code><a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/input/checkbox">&lt;input type="checkbox"&gt;</a></code> , <code><a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/input/radio">&lt;input type="radio"&gt;</a></code> 및 <a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/option"> <code>&lt;option&gt;</code> </a> 요소 와 일치 할 수 있습니다 .
zh_cn: 此选择器匹配的内容在<a href="https://html.spec.whatwg.org/multipage/semantics-other.html#selector-default">HTML标准&sect;4.16.3伪类中</a>定义-它可以匹配<a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/button"> <code>&lt;button&gt;</code> </a>， <code><a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/input/checkbox">&lt;input type="checkbox"&gt;</a></code> ， <code><a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/input/radio">&lt;input type="radio"&gt;</a></code> 和<a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/option"> <code>&lt;option&gt;</code> </a>元素：
