Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/css/css.*.017.xlf
Languages: es, ko, zh_cn

source: Use this <strong>CSS reference</strong> to browse an <a href="#Keyword_index">alphabetical index</a> of all the standard <a href="https://developer.mozilla.org/en-US/docs/Web/CSS">CSS</a> properties, <a href="pseudo-classes">pseudo-classes</a>, <a href="pseudo-elements">pseudo-elements</a>, <a href="css_types">data types</a>, and <a href="at-rule">at-rules</a>. You can also browse a list of all the CSS <a href="#Selectors">selectors organized by type</a> and a list of <a href="#Concepts">key CSS concepts</a>. Also included is a brief <a href="#DOM-CSS_CSSOM">DOM-CSS / CSSOM reference</a>.
zh_cn: 使用此<strong>CSS参考</strong>来浏览所有标准<a href="https://developer.mozilla.org/en-US/docs/Web/CSS">CSS</a>属性，<a href="pseudo-classes">伪类</a>，<a href="pseudo-elements">伪元素</a>，<a href="css_types">数据类型</a>和<a href="at-rule">规则</a>的<a href="#Keyword_index">字母索引</a>。您还可以浏览<a href="#Selectors">按类型组织</a>的所有CSS 选择器的列表以及<a href="#Concepts">关键CSS概念</a>的列表。还包括一个简短的<a href="#DOM-CSS_CSSOM">DOM-CSS / CSSOM参考</a>。

source: Use this property with caution &mdash; setting <code>scrollbar-width</code> to <code>thin</code> or <code>none</code> can make content hard or impossible to scroll if the author does not provide an alternative scrolling mechanism. While swiping gestures or mouse wheels can enable scrolling on such content, some devices have no scroll alternative.
zh_cn: 请谨慎使用此属性-如果作者未提供替代的滚动机制，则将 <code>scrollbar-width</code> 设置为 <code>thin</code> 或 <code>none</code> 设置将使内容难以滚动或无法滚动。尽管滑动手势或鼠标滚轮可以在此类内容上滚动，但某些设备没有其他滚动选项。

source: Used alongside an alignment keyword. If the chosen keyword means that the item overflows the alignment container causing data loss, the item is instead aligned as if the alignment mode were <code>start</code>.
zh_cn: 与alignment关键字一起使用。如果选择的关键字意味着项目溢出对齐容器而导致数据丢失，则将对齐该项目，就好像对齐模式为 <code>start</code> 一样。

source: Used alongside an alignment keyword. Regardless of the relative sizes of the item and alignment container and whether overflow which causes data loss might happen, the given alignment value is honored.
zh_cn: 与对齐关键字一起使用。不管项目和对齐容器的相对大小,也不管是否会发生溢出而导致数据丢失的情况,给定的对齐值都会被尊重。

source: Used alongside an alignment keyword. Regardless of the relative sizes of the item and alignment container, and regardless of whether overflow which causes data loss might happen, the given alignment value is honored.
zh_cn: 与对齐关键字一起使用。不管项目和对齐容器的相对大小,也不管是否会发生溢出而导致数据丢失,给定的对齐值都会被尊重。

source: Used in the determination of the height of the viewport when the document is first displayed.
zh_cn: 用于确定文档首次显示时视口的高度。

source: Used in the determination of the width of the viewport when the document is first displayed.
zh_cn: 用于确定文档首次显示时视口的宽度。

source: Used the <code>-moz-background-clip: padding | border</code> syntax.
zh_cn: 使用 <code>-moz-background-clip: padding | border</code> 语法。

source: Used to access the Windows 10 custom accent color that you can set on the start menu, taskbar, title bars, etc.
zh_cn: 用于访问可以在开始菜单、任务栏、标题栏等处设置的Windows 10自定义重音色。

source: Used to access the color of text placed over the Windows 10 custom accent color in the start menu, taskbar, title bars, etc.
zh_cn: 用于访问放置在开始菜单、任务栏、标题栏等Windows 10自定义重音颜色上的文本颜色。

source: Used to represent "sign-value" numbering systems, such as Roman numerals, which rather than reuse digits in different positions to obtain different values, define additional digits for larger values. The value of a number in such a system can be found out by adding the digits in the number.
zh_cn: 用来表示 "符号值 "的数字系统,如罗马数字,它不是在不同的位置重复使用数字来获得不同的值,而是为较大的值定义额外的数字。在这种系统中,一个数字的值可以通过将数字中的数字相加来求出。

source: Used value
zh_cn: 二手价值

source: Useful fallback techniques
zh_cn: 有用的后备技术

source: Useless selectors can be written using this pseudo-class. For example, <code>:not(*)</code> matches any element which is not an element, so the rule will never be applied.
zh_cn: 可以使用此伪类编写无用的选择器。例如， <code>:not(*)</code> 匹配不是元素的任何元素，因此该规则将永远不会应用。

source: Useless selectors can be written using this pseudo-class. For example, <code>:not(*)</code> matches any element which is not an element, which is obviously nonsense, so the accompanying rule will never be applied.
zh_cn: 可以使用此伪类编写无用的选择器。例如， <code>:not(*)</code> 匹配不是元素的任何元素，这显然是无稽之谈，因此永远不会应用附带的规则。

source: User agents are allowed to ignore this property.
zh_cn: 用户代理可以忽略这个属性。
