Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/css/css.*.017.xlf
Languages: es, ko, zh_cn

source: You can do this with both the shorthand <a href="../background"><code>background</code></a> property and the individual properties thereof except for <a href="../background-color"><code>background-color</code></a>. That is, the following background properties can be specified as a list, one per background: <a href="../background"><code>background</code></a>, <a href="../background-attachment"><code>background-attachment</code></a>, <a href="../background-clip"><code>background-clip</code></a>, <a href="../background-image"><code>background-image</code></a>, <a href="../background-origin"><code>background-origin</code></a>, <a href="../background-position"><code>background-position</code></a>, <a href="../background-repeat"><code>background-repeat</code></a>, <a href="../background-size"><code>background-size</code></a>.
es: Puede hacer esto tanto con la propiedad de <a href="../background"> <code>background</code> </a> abreviado como con las propiedades individuales de la misma, excepto para <a href="../background-color"> <code>background-color</code> </a> . Esto es, las siguientes propiedades de fondo se pueden especificar como una lista, uno por el fondo: <a href="../background"> <code>background</code> </a> , <a href="../background-attachment"> <code>background-attachment</code> </a> , <a href="../background-clip"> <code>background-clip</code> </a> , <a href="../background-image"> <code>background-image</code> </a> , <a href="../background-origin"> <code>background-origin</code> </a> , <a href="../background-position"> <code>background-position</code> </a> , <a href="../background-repeat"> <code>background-repeat</code> </a> , <a href="../background-size"> <code>background-size</code> </a> .
ko: 당신은 속기 모두이 작업을 수행 할 수있는 <a href="../background"> <code>background</code> </a> 재산과 그 이외 개별 속성 <a href="../background-color"> <code>background-color</code> </a> . 즉, <a href="../background"> <code>background</code> </a> , <a href="../background-attachment"> <code>background-attachment</code> </a> , <a href="../background-clip"> <code>background-clip</code> </a> , <a href="../background-image"> <code>background-image</code> </a> , <a href="../background-origin"> <code>background-origin</code> </a> , <a href="../background-position"> <code>background-position</code> </a> , <a href="../background-repeat"> <code>background-repeat</code> </a> , <a href="../background-size"> <code>background-size</code> </a> 와 같이 배경 별로 하나씩 배경 속성을 목록으로 지정할 수 있습니다 .
zh_cn: 您可以同时使用速记<a href="../background"> <code>background</code> </a>属性及其各个属性（<a href="../background-color"> <code>background-color</code> </a>除外）来执行此操作。也就是说，可以将以下背景属性指定为一个列表，每个背景一个：<a href="../background"> <code>background</code> </a>，<a href="../background-attachment"> <code>background-attachment</code> </a>，<a href="../background-clip"> <code>background-clip</code> </a>，<a href="../background-image"> <code>background-image</code> </a>，<a href="../background-origin"> <code>background-origin</code> </a>，<a href="../background-position"> <code>background-position</code> </a>，<a href="../background-repeat"> <code>background-repeat</code> </a>，<a href="../background-size"> <code>background-size</code> </a>。

source: You can even make the gradient run diagonally, from corner to corner.
es: Incluso puedes hacer que el gradiente corra diagonalmente,de esquina a esquina.
ko: 그라디언트를 모서리에서 대각선으로 실행할 수도 있습니다.
zh_cn: 你甚至可以让梯度从一个角到另一个角斜着运行。

source: You can even stack gradients with other gradients. As long as the top gradients aren't entirely opaque, the gradients below will still be visible.
es: Incluso puedes apilar los gradientes con otros gradientes.Mientras los gradientes de arriba no sean totalmente opacos,los de abajo seguirán siendo visibles.
ko: 다른 그라디언트로 그라디언트를 쌓을 수도 있습니다. 상단 그라디언트가 완전히 불투명하지 않은 한 아래 그라디언트는 계속 표시됩니다.
zh_cn: 你甚至可以将梯度与其他梯度堆叠在一起。只要顶部的渐变不是完全不透明的,下面的渐变仍然是可见的。

source: You can experiment directly in these live examples, to see how changing the gradient will change the path of your shape.
es: Puedes experimentar directamente en estos ejemplos en vivo,para ver cómo el cambio del gradiente cambiará la trayectoria de tu forma.
ko: 이 라이브 예제에서 직접 실험하여 그라디언트를 변경하면 모양의 경로가 어떻게 변경되는지 확인할 수 있습니다.
zh_cn: 你可以直接在这些实战例子中进行实验,看看改变梯度会如何改变形状的路径。

source: You can explicitly specify the initial value by using the <a href="initial"><code>initial</code></a> keyword.
ko: <a href="initial"> <code>initial</code> </a> 키워드 를 사용하여 초기 값을 명시 적으로 지정할 수 있습니다 .
zh_cn: 您可以使用<a href="initial"> <code>initial</code> </a>关键字显式指定初始值。

source: You can find a number of other variable fonts examples at our <a href="css_fonts/variable_fonts_guide">Variable fonts guide</a>, <a href="https://v-fonts.com/">v-fonts.com</a>, and <a href="https://www.axis-praxis.org/">axis-praxis.org</a>.
ko: <a href="css_fonts/variable_fonts_guide">Variable fonts guide</a> , <a href="https://v-fonts.com/">v-fonts.com</a> 및 <a href="https://www.axis-praxis.org/">axis-praxis.org</a> 에서 다른 다양한 가변 글꼴 예제를 찾을 수 있습니다 .
zh_cn: 您可以在我们找到了其他一些可变字体的例子<a href="css_fonts/variable_fonts_guide">变字体指导</a>，<a href="https://v-fonts.com/">v-fonts.com</a>和<a href="https://www.axis-praxis.org/">axis-praxis.org</a>。

source: You can find a number of variable fonts examples at <a href="https://v-fonts.com/">v-fonts.com</a> and <a href="https://www.axis-praxis.org/">axis-praxis.org</a>; see also our <a href="css_fonts/variable_fonts_guide">Variable fonts guide</a> for more information and usage information.
es: Puede encontrar varios ejemplos de fuentes variables en <a href="https://v-fonts.com/">v-fonts.com</a> y <a href="https://www.axis-praxis.org/">axis-praxis.org</a> ; Consulte tambi&eacute;n nuestra <a href="css_fonts/variable_fonts_guide">gu&iacute;a de fuentes variables</a> para obtener m&aacute;s informaci&oacute;n e informaci&oacute;n de uso.
ko: <a href="https://v-fonts.com/">v-fonts.com</a> 및 <a href="https://www.axis-praxis.org/">axis-praxis.org</a> 에서 다양한 가변 글꼴 예제를 찾을 수 있습니다 . 참조 또한 우리의 <a href="css_fonts/variable_fonts_guide">가변 글꼴을 안내</a> 자세한 내용 및 사용 정보.
zh_cn: 您可以在<a href="https://v-fonts.com/">v-fonts.com</a>和<a href="https://www.axis-praxis.org/">axis-praxis.org上</a>找到许多可变字体示例。另请参阅我们的<a href="css_fonts/variable_fonts_guide">可变字体指南</a>以获取更多信息和使用信息。

source: You can find more information about border colors in <a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Applying_color#Borders">Borders</a> in <a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Applying_color">Applying color to HTML elements using CSS</a>.
es: Puede encontrar m&aacute;s informaci&oacute;n sobre los colores de los <a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Applying_color#Borders">bordes</a> en Bordes en <a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Applying_color">Aplicaci&oacute;n de color a elementos HTML mediante CSS</a> .
ko: <a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Applying_color">CSS를 사용하여 HTML 요소에 색상 적용의 </a><a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Applying_color#Borders">테두리</a> 에서 테두리 색상에 대한 자세한 정보를 찾을 수 있습니다 .
zh_cn: 您可以在<a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Applying_color">使用CSS将颜色应用于HTML元素的&ldquo; </a><a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Applying_color#Borders">边框&rdquo;</a>中找到有关边框颜色的更多信息。

source: You can find the full source code at <a href="https://github.com/mdn/learning-area/blob/master/html/forms/pseudo-classes/readonly-confirmation.html">readonly-confirmation.html</a>; this renders like so:
ko: <a href="https://github.com/mdn/learning-area/blob/master/html/forms/pseudo-classes/readonly-confirmation.html">readonly-confirmation.html</a> 에서 전체 소스 코드를 찾을 수 있습니다 . 이것은 다음과 같이 렌더링됩니다.
zh_cn: 您可以在<a href="https://github.com/mdn/learning-area/blob/master/html/forms/pseudo-classes/readonly-confirmation.html">readonly-confirmation.html上</a>找到完整的源代码。如下所示：

source: You can get additional control over animations &mdash; as well as useful information about them &mdash; by making use of animation events. These events, represented by the <a href="https://developer.mozilla.org/en-US/docs/Web/API/AnimationEvent"><code>AnimationEvent</code></a> object, can be used to detect when animations start, finish, and begin a new iteration. Each event includes the time at which it occurred as well as the name of the animation that triggered the event.
es: Puede obtener un control adicional sobre las animaciones, as&iacute; como informaci&oacute;n &uacute;til sobre ellas, haciendo uso de eventos de animaci&oacute;n. Estos eventos, representados por el objeto <a href="https://developer.mozilla.org/en-US/docs/Web/API/AnimationEvent"> <code>AnimationEvent</code> </a> , se pueden usar para detectar cu&aacute;ndo las animaciones comienzan, finalizan y comienzan una nueva iteraci&oacute;n. Cada evento incluye la hora en que ocurri&oacute;, as&iacute; como el nombre de la animaci&oacute;n que activ&oacute; el evento.
ko: 애니메이션 이벤트를 사용하여 애니메이션에 대한 유용한 정보뿐만 아니라 애니메이션을 추가로 제어 할 수 있습니다. <a href="https://developer.mozilla.org/en-US/docs/Web/API/AnimationEvent"> <code>AnimationEvent</code> </a> 객체로 표시되는 이러한 이벤트는 애니메이션이 언제 시작, 완료 및 새로운 반복을 시작하는지 감지하는 데 사용될 수 있습니다. 각 이벤트에는 이벤트가 발생한 시간과 이벤트를 트리거 한 애니메이션 이름이 포함됩니다.
zh_cn: 您可以通过使用动画事件来获得对动画的附加控制以及有关动画的有用信息。这些由<a href="https://developer.mozilla.org/en-US/docs/Web/API/AnimationEvent"> <code>AnimationEvent</code> </a>对象表示的事件可用于检测动画何时开始，结束和开始新的迭代。每个事件都包括事件发生的时间以及触发事件的动画的名称。

source: You can however control the size of these rows with the property <code>grid-auto-rows</code>. To cause all created rows to be 100 pixels tall for example you would use:
es: Sin embargo, puede controlar el tama&ntilde;o de estas filas con la propiedad <code>grid-auto-rows</code> . Para que todas las filas creadas tengan 100 p&iacute;xeles de alto, por ejemplo, usar&iacute;a:
ko: 그러나 <code>grid-auto-rows</code> 속성을 사용하여 이러한 행의 크기를 제어 할 수 있습니다 . 예를 들어 생성 된 모든 행의 높이를 100 픽셀로 만들려면 다음을 사용하십시오.
zh_cn: 但是，您可以使用属性 <code>grid-auto-rows</code> 来控制这些行的大小。例如，要使所有创建的行的高度为100像素，您可以使用：

source: You can immediately see an issue &mdash; no effort is made to clear the floating beyond the bottom of the article.
ko: 즉시 문제를 볼 수 있습니다. 기사 하단을 넘어선 플로팅을 지우려고 노력하지 않습니다.
zh_cn: 您可以立即看到一个问题-不会进行任何工作以清除超出文章底部的范围。

source: You can learn more about programmatically using media queries in <a href="media_queries/testing_media_queries">Testing media queries</a>.
es: Puede obtener m&aacute;s informaci&oacute;n sobre el uso program&aacute;tico de consultas de medios en <a href="media_queries/testing_media_queries">Prueba de consultas de medios</a> .
ko: 미디어 쿼리 <a href="media_queries/testing_media_queries">테스트</a> 에서 미디어 쿼리를 프로그래밍 방식으로 사용하는 방법에 대해 자세히 알아볼 수 있습니다 .
zh_cn: 您可以在&ldquo; <a href="media_queries/testing_media_queries">测试媒体查询&rdquo;中</a>了解有关以编程方式使用媒体查询的更多信息。

source: You can list the keyframe percentages in any order; they will be handled in the order they should occur.
es: Puede enumerar los porcentajes de los fotogramas clave en cualquier orden;se manejarán en el orden en que deben ocurrir.
ko: 키 프레임 백분율을 임의의 순서로 나열 할 수 있습니다. 그들은 발생 순서대로 처리됩니다.
zh_cn: 您可以按照任何顺序列出关键帧百分比;它们将按照它们应该出现的顺序进行处理。

source: You can of course define both rows and columns as a subgrid, as in the example below. This means that your subgrid is tied in both dimensions to the number of tracks on the parent.
ko: 물론 아래 예에서와 같이 행과 열을 모두 하위 표로 정의 할 수 있습니다. 이것은 서브 그리드가 부모의 트랙 수에 두 차원에서 연결되어 있음을 의미합니다.
zh_cn: 当然,您可以将行和列都定义为子网格,如下图所示。这意味着您的子网格在两个维度上都与父网格上的轨道数挂钩。

source: You can only specify a single value if it is valid for both <code>align-content</code> and <code>justify-content</code>
es: Solo puede especificar un valor &uacute;nico si es v&aacute;lido tanto para <code>align-content</code> como para <code>justify-content</code>
ko: <code>align-content</code> 및 <code>justify-content</code> 모두에 유효한 경우 단일 값만 지정할 수 있습니다
zh_cn: 如果只能对 <code>align-content</code> 和 <code>justify-content</code> 都有效，则只能指定一个值

source: You can optionally include additional keyframes that describe intermediate steps between the start and end of the animation.
es: Puede incluir opcionalmente fotogramas clave adicionales que describan los pasos intermedios entre el inicio y el final de la animación.
ko: 애니메이션의 시작과 끝 사이의 중간 단계를 설명하는 추가 키 프레임을 선택적으로 포함 할 수 있습니다.
zh_cn: 您可以选择包含额外的关键帧,描述动画开始和结束之间的中间步骤。

source: You can pass additional arguments via the CSS paint() function. In this example, we passed two arguments: whether the background-image on a group of list items is filled or just has a stroke outline, and the width of that outline:
ko: CSS paint () 함수를 통해 추가 인수를 전달할 수 있습니다. 이 예제에서는 두 개의 인수를 전달했습니다. 목록 항목 그룹의 배경 이미지가 채워져 있는지 아니면 획 윤곽선 만 있는지 여부와 해당 윤곽선의 너비입니다.
zh_cn: 你可以通过CSS paint()函数传递额外的参数。在这个例子中,我们传递了两个参数:一组列表项上的背景图片是填充还是只有一个描边轮廓,以及该轮廓的宽度。

source: You can place items into a precise location on the grid using line numbers, names or by targeting an area of the grid. Grid also contains an algorithm to control the placement of items not given an explicit position on the grid.
es: Puede colocar los artículos en un lugar preciso de la cuadrícula utilizando números de línea,nombres o apuntando a una zona de la cuadrícula.La cuadrícula también contiene un algoritmo para controlar la colocación de los elementos que no tienen una posición explícita en la cuadrícula.
ko: 줄 번호, 이름을 사용하거나 그리드 영역을 대상으로 그리드의 정확한 위치에 항목을 배치 할 수 있습니다. 그리드에는 그리드에서 명시적인 위치를 지정하지 않은 항목의 배치를 제어하는 ​​알고리즘도 포함되어 있습니다.
zh_cn: 你可以使用线号、名称或目标网格的某个区域将项目放置到网格的精确位置。网格还包含一个算法来控制网格上没有明确位置的项目的放置。

source: You can play around with the values in this live example below and see how that changes the order. Also, try changing <code>flex-direction</code> to <code>row-reverse</code> and see what happens &mdash; the start line is switched so the ordering begins from the opposite side.
es: Puede jugar con los valores en este ejemplo en vivo a continuaci&oacute;n y ver c&oacute;mo eso cambia el orden. Adem&aacute;s, intente cambiar <code>flex-direction</code> hacia <code>row-reverse</code> y vea qu&eacute; sucede: la l&iacute;nea de inicio se cambia para que el pedido comience desde el lado opuesto.
ko: 아래 라이브 예에서 값을 가지고 놀면서 순서가 어떻게 바뀌는 지 볼 수 있습니다. 또한 <code>flex-direction</code> 을 <code>row-reverse</code> 로 변경 하고 어떤 일이 발생하는지 확인하십시오. 시작 라인이 전환되어 순서가 반대쪽에서 시작됩니다.
zh_cn: 您可以在下面的此实时示例中使用这些值，并查看如何更改顺序。另外，尝试将 <code>flex-direction</code> 更改为 <code>row-reverse</code> ，看看会发生什么&mdash;切换了起始行，以便从另一侧开始排序。

source: You can play with the alignment, aligning the item to the start with <code>flex-start</code> or end with <code>flex-end</code>.
es: Puedes jugar con la alineaci&oacute;n, alineando el elemento al inicio con <code>flex-start</code> o al final con <code>flex-end</code> .
ko: <code>flex-start</code> 로 시작 하거나 <code>flex-end</code> 로 끝나 도록 항목을 정렬하여 정렬을 재생할 수 있습니다 .
zh_cn: 您可以进行对齐，将项目以 <code>flex-start</code> 开头或以 <code>flex-end</code> 结尾。

source: You can play with this here: <a href="http://jsfiddle.net/9h261pzo/291/">http://jsfiddle.net/9h261pzo/291/</a>
es: Puedes jugar con esto aqu&iacute;: <a href="http://jsfiddle.net/9h261pzo/291/">http://jsfiddle.net/9h261pzo/291/</a>
ko: 당신은 여기에서 이것을 재생할 수 있습니다 : <a href="http://jsfiddle.net/9h261pzo/291/">http://jsfiddle.net/9h261pzo/291/</a>
zh_cn: 您可以在这里玩：<a href="http://jsfiddle.net/9h261pzo/291/">http</a> : //jsfiddle.net/9h261pzo/291/

source: You can polyfill <code>:focus-visible</code> using <a href="https://github.com/WICG/focus-visible">focus-visible.js</a>.
es: Puede polyfill <code>:focus-visible</code> usando <a href="https://github.com/WICG/focus-visible">focus-visible.js</a> .
ko: <a href="https://github.com/WICG/focus-visible">focus-visible.js를</a> 사용하여 <code>:focus-visible</code> 을 polyfill 할 수 있습니다 .
zh_cn: 您可以使用<a href="https://github.com/WICG/focus-visible">focus-visible.js来polyfill </a> <code>:focus-visible</code> 。

source: You can position the center of the gradient with keyterms, percentage, or absolute lengths, length and percentage values repeating if only one is present, otherwise in the order of position from the left and position from the top.
ko: 키워드, 백분율 또는 절대 길이, 길이 및 백분율 값 (하나만있는 경우 반복)을 사용하여 그라디언트의 중심을 배치 할 수 있습니다.
zh_cn: 你可以用keyterms、百分比或绝对长度来定位渐变的中心,如果只有一个,则长度和百分比值重复,否则按照从左到右和从上到下的顺序定位。

source: You can provide more than two arguments, if you have multiple constraints to apply.
es: Puede proporcionar más de dos argumentos,si tiene múltiples restricciones que aplicar.
ko: 적용 할 제약 조건이 여러 개인 경우 세 개 이상의 인수를 제공 할 수 있습니다.
zh_cn: 如果你有多个约束条件要应用,你可以提供两个以上的参数。

source: You can read more about margin collapsing in our article <a href="../css_box_model/mastering_margin_collapsing">Mastering Margin Collapsing</a>.
es: Puede leer m&aacute;s sobre el colapso de m&aacute;rgenes en nuestro art&iacute;culo <a href="../css_box_model/mastering_margin_collapsing">Mastering Margin Colapso</a> .
ko: 마진 축소 <a href="../css_box_model/mastering_margin_collapsing">마스터 링</a> 기사에서 여백 축소에 대해 자세히 읽을 수 있습니다 .
zh_cn: 您可以在我们的文章<a href="../css_box_model/mastering_margin_collapsing">Mastering Margin Collapsing中</a>阅读更多关于保证金崩溃的信息。

source: You can read more about the relationship between flexbox and the Writing Modes specification in a later article, however the following description should help explain why we do not talk about left and right and top and bottom when we describe the direction that our flex items flow in.
es: Puedes leer más sobre la relación entre el flexbox y la especificación de los modos de escritura en un artículo posterior,sin embargo la siguiente descripción debería ayudar a explicar por qué no hablamos de izquierda y derecha y de arriba y abajo cuando describimos la dirección en la que fluyen nuestros artículos flex.
ko: 다음 기사에서 flexbox와 Writing Modes 사양의 관계에 대한 자세한 내용을 읽을 수 있지만 다음 설명은 Flex 항목의 흐름 방향을 설명 할 때 왼쪽 및 오른쪽 및 위쪽 및 아래쪽에 대해 이야기하지 않는 이유를 설명하는 데 도움이됩니다. .
zh_cn: 你可以在后面的文章中阅读更多关于flexbox和写作模式规范之间的关系,但是下面的描述应该有助于解释为什么我们在描述flex项目的流动方向时,不谈论左右和上下。

source: You can read more about the relationship between flexbox and the Writing Modes specification in a later article; however, the following description should help explain why we do not talk about left and right and top and bottom when we describe the direction that our flex items flow in.
ko: 이후 기사에서 flexbox와 Writing Modes 사양 간의 관계에 대해 자세히 알아볼 수 있습니다. 그러나 다음 설명은 flex 항목이 유입되는 방향을 설명 할 때 왼쪽과 오른쪽, 위쪽과 아래쪽에 대해 이야기하지 않는 이유를 설명하는 데 도움이됩니다.
zh_cn: 你可以在后面的文章中阅读更多关于flexbox和写作模式规范之间的关系;但是,下面的描述应该有助于解释为什么我们在描述flex项目的流动方向时,不谈论左右和上下。

source: You can read more about this feature in <a href="https://www.smashingmagazine.com/2020/03/setting-height-width-images-important-again/">Setting Height And Width On Images Is Important Again</a>.
ko: 이 기능에 대한 자세한 내용은 <a href="https://www.smashingmagazine.com/2020/03/setting-height-width-images-important-again/">이미지의 높이 및 너비 설정</a> 이 다시 중요 합니다.
zh_cn: 您可以在&ldquo;<a href="https://www.smashingmagazine.com/2020/03/setting-height-width-images-important-again/">在图像上设置高度和宽度很重要&rdquo;中</a>阅读有关此功能的更多信息。

source: You can see from the live example below that in order to create gaps that do not also create a gap at the edges of the container, we need to use negative margins on the flex container itself. Any border on the flex container is then moved to a second wrapper in order that the negative margin can pull the items up to that wrapper element.
es: En el ejemplo vivo que se presenta a continuación se puede ver que para crear huecos que no creen también un hueco en los bordes del contenedor,tenemos que utilizar márgenes negativos en el propio contenedor flexible.Cualquier borde del contenedor flexible se traslada a un segundo envoltorio para que el margen negativo pueda arrastrar los artículos hasta ese elemento del envoltorio.
ko: 아래 라이브 예제에서 컨테이너 가장자리에 간격을 만들지 않는 간격을 만들려면 플렉스 컨테이너 자체에 음수 여백을 사용해야합니다. 그런 다음 플렉스 컨테이너의 테두리는 두 번째 래퍼로 이동하여 음의 여백이 해당 래퍼 요소로 항목을 당길 수 있습니다.
zh_cn: 从下面的实战示例中可以看出,为了在容器边缘不产生间隙,我们需要在flex容器本身使用负边距。然后,flex容器上的任何边框都会被移动到第二个包装器上,以便负边距可以将物品拉到该包装器元素上。

source: You can see how the item is aligned by using the <a href="https://developer.mozilla.org/en-US/docs/Tools/Page_Inspector/How_to/Examine_grid_layouts">Firefox Grid Highlighter</a>:
es: Puede ver c&oacute;mo se alinea el elemento utilizando el <a href="https://developer.mozilla.org/en-US/docs/Tools/Page_Inspector/How_to/Examine_grid_layouts">resaltador de cuadr&iacute;cula de Firefox</a> :
ko: <a href="https://developer.mozilla.org/en-US/docs/Tools/Page_Inspector/How_to/Examine_grid_layouts">Firefox Grid Highlighter를</a> 사용하여 항목이 어떻게 정렬되는지 확인할 수 있습니다 .
zh_cn: 您可以使用<a href="https://developer.mozilla.org/en-US/docs/Tools/Page_Inspector/How_to/Examine_grid_layouts">Firefox Grid Highlighter</a>查看项目的对齐方式：

source: You can see how this then leaves gaps in the grid, as for the auto-placed items if grid comes across an item that doesn&rsquo;t fit into a track, it will move to the next row until it finds a space the item can fit in.
es: Puede ver c&oacute;mo esto deja huecos en la cuadr&iacute;cula, en cuanto a los elementos colocados autom&aacute;ticamente si la cuadr&iacute;cula se encuentra con un elemento que no cabe en una pista, se mover&aacute; a la siguiente fila hasta que encuentre un espacio en el que el elemento pueda encajar en.
ko: 그리드에 트랙에 맞지 않는 항목을 가로 질러 놓으면 자동 배치 된 항목과 같이 그리드에 간격이 남는 방법을 볼 수 있습니다. 항목이 들어갈 수있는 공간을 찾을 때까지 다음 행으로 이동합니다. 에.
zh_cn: 您会看到它如何在网格中留下空隙，至于自动放置的项目，如果网格遇到的项目不适合轨道，它将移动到下一行，直到找到该项目可以容纳的空间在。

source: You can see in the live example below how this looks. Try editing the items or adding additional items in order to test the initial behavior of flexbox.
es: Puedes ver en el ejemplo en vivo de abajo cómo se ve esto.Intenta editar los elementos o añadir elementos adicionales para probar el comportamiento inicial del flexbox.
ko: 아래의 실제 예에서 이것이 어떻게 보이는지 확인할 수 있습니다. flexbox의 초기 동작을 테스트하려면 항목을 편집하거나 추가 항목을 추가하십시오.
zh_cn: 你可以在下面的实战例子中看到它的样子。尝试编辑项目或添加额外的项目,以测试flexbox的初始行为。

source: You can see that DIV #2 (z-index: 2) is above DIV #3 (z-index: 1), because they both belong to the same stacking context (the root one), so z-index values rule how elements are stacked.
ko: DIV # 2 (z-index : 2)가 DIV # 3 (z-index : 1)보다 위에 있다는 것을 알 수 있습니다. 둘 다 동일한 스택 컨텍스트 (루트 컨텍스트)에 속하기 때문입니다. 쌓입니다.
zh_cn: 你可以看到DIV #2(z-index:2)高于DIV #3(z-index:1),因为它们都属于同一个堆叠上下文(根目录),所以z-index值决定了元素的堆叠方式。

source: You can see that the item is taking the area from grid column line 2 to 4, and starting after line 1. Then it is offset in that area using the top and left properties. However, it has been taken out of flow as is usual for absolutely positioned items and so the auto-placement rules now place items into the same space. The item also doesn&rsquo;t cause the additional row to be created to span to row line 3.
ko: 항목이 그리드 열 라인 2에서 4까지의 영역을 취하고 라인 1 이후부터 시작하는 것을 볼 수 있습니다. 그런 다음 top 및 left 속성을 사용하여 해당 영역에서 오프셋됩니다. 그러나 절대적으로 배치 된 항목의 경우 평소와 같이 흐름에서 벗어나므로 이제 자동 배치 규칙이 항목을 동일한 공간에 배치합니다. 또한 항목으로 인해 행 3에 걸쳐 추가 행이 생성되지 않습니다.
zh_cn: 您可以看到该项目将区域从网格列第2行移至第4行，并从第1行开始。然后使用top和left属性在该区域中将其偏移。但是，它已像绝对放置物品一样从流程中删除，因此自动放置规则现在将物品放置在同一空间中。该项目也不会导致额外的行被创建到第3行。
