Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/css/css.*.017.xlf
Languages: es, ko, zh_cn

source: Using this property with a value different than <code>0</code> and <code>none</code> creates a new <a href="css_positioning/understanding_z_index/the_stacking_context">stacking context</a>. Also, in that case, the object will act as a containing block for <code>position</code><code>: fixed</code> elements that it contains.
es: El uso de esta propiedad con un valor diferente a <code>0</code> y <code>none</code> crea un nuevo <a href="css_positioning/understanding_z_index/the_stacking_context">contexto de apilamiento</a> . Adem&aacute;s, en ese caso, el objeto actuar&aacute; como un bloque contenedor para la <code>position</code> <code>: fixed</code> elementos fijos que contiene.
ko: 보다 큰 값의 다른 특성이 사용 <code>0</code> 및 <code>none</code> 신규 작성하지 <a href="css_positioning/understanding_z_index/the_stacking_context">적층 컨텍스트</a> . 또한이 경우 객체는 <code>position</code> <code>: fixed</code> 요소 의 포함 블록으로 작동 합니다.
zh_cn: 使用这个属性比不同的值 <code>0</code> 和 <code>none</code> 创建一个新的<a href="css_positioning/understanding_z_index/the_stacking_context">堆叠内容</a>。同样，在这种情况下，对象将充当 <code>position</code> 的包含块 <code>: fixed</code> 它包含的固定元素。

source: Using transitions to make JavaScript functionality smooth
es: Usar las transiciones para hacer la funcionalidad de JavaScript sin problemas
ko: 전환 기능을 사용하여 JavaScript 기능을 원활하게 만들기
zh_cn: 使用转场来使JavaScript功能流畅

source: Using transitions when highlighting menus
es: Usar las transiciones al resaltar los menús
ko: 메뉴를 강조 할 때 영상 효과 사용
zh_cn: 在突出显示菜单时使用转场

source: Using two angles
es: Usando dos ángulos
ko: 두 각도 사용
zh_cn: 使用两个角度

source: Using vertical media queries
es: Usando consultas de medios verticales
ko: 수직 미디어 쿼리 사용
zh_cn: 使用垂直媒体查询

source: Valid <code>&lt;display-box&gt;</code> values:
ko: 유효한 <code>&lt;display-box&gt;</code> 값 :
zh_cn: 有效的 <code>&lt;display-box&gt;</code> 值：

source: Valid <code>&lt;display-inside&gt;</code> values:
ko: 유효한 <code>&lt;display-inside&gt;</code> 값 :
zh_cn: 有效的 <code>&lt;display-inside&gt;</code> 值：

source: Valid <code>&lt;display-internal&gt;</code> values:
ko: 유효한 <code>&lt;display-internal&gt;</code> 값 :
zh_cn: 有效的 <code>&lt;display-internal&gt;</code> 值：

source: Valid <code>&lt;display-legacy&gt;</code> values:
ko: 유효한 <code>&lt;display-legacy&gt;</code> 값 :
zh_cn: 有效的 <code>&lt;display-legacy&gt;</code> 值：

source: Valid <code>&lt;display-outside&gt;</code> values:
ko: 유효한 <code>&lt;display-outside&gt;</code> 값 :
zh_cn: 有效的 <code>&lt;display-outside&gt;</code> 值：

source: Valid and invalid charset declarations
ko: 유효하고 잘못된 문자 집합 선언
zh_cn: 有效和无效的字符集声明

source: Valid dimensions
ko: 유효한 치수
zh_cn: 有效尺寸

source: Valid family names
es: Nombres de familia válidos
ko: 유효한 가족 이름
zh_cn: 有效姓氏

source: Valid frequency values
es: Valores de frecuencia válidos
ko: 유효한 빈도 값
zh_cn: 有效频率值

source: Valid identifiers
es: Identificadores válidos
ko: 유효한 식별자
zh_cn: 有效标识符

source: Valid images
es: Imágenes válidas
ko: 유효한 이미지
zh_cn: 有效图像

source: Valid integers
es: Enteros válidos
ko: 유효한 정수
zh_cn: 有效的整数

source: Valid keyframe lists
es: Listas de fotogramas clave válidas
ko: 유효한 키 프레임 목록
zh_cn: 有效的关键框架清单

source: Valid numbers
es: Números válidos
ko: 유효한 숫자
zh_cn: 有效数字

source: Valid percentage values
ko: 유효한 백분율 값
zh_cn: 有效的百分比值

source: Valid percentages
ko: 유효한 비율
zh_cn: 有效百分比

source: Valid positions
es: Posiciones válidas
ko: 유효한 위치
zh_cn: 有效职位

source: Valid resolutions
es: Resoluciones válidas
ko: 유효한 해상도
zh_cn: 有效决议

source: Valid times
es: Tiempos válidos
ko: 유효한 시간
zh_cn: 有效时间

source: Validity and values
es: Validez y valores
ko: 유효성과 가치
zh_cn: 有效性和价值

source: Value definition syntax
es: Sintaxis de definición de valores
ko: 값 정의 구문
zh_cn: 价值定义语法

source: Value not found in DB!
es: ¡El valor no se encuentra en la base de datos!
ko: DB에서 값을 찾을 수 없습니다!
zh_cn: DB中找不到值!

source: Value of <a href="display"><code>display</code></a>
es: Valor de <a href="display"> <code>display</code> </a>
ko: <a href="display"> <code>display</code> </a> 가치
zh_cn: <a href="display"> <code>display</code> </a>价值

source: Value of <a href="float"><code>float</code></a>
es: Valor de <a href="float"> <code>float</code> </a>
ko: <a href="float"> <code>float</code> </a> 값
zh_cn: <a href="float"> <code>float</code> </a>价值

source: Value of <a href="position"><code>position</code></a>
es: Valor de la <a href="position"> <code>position</code> </a>
ko: <a href="position"> <code>position</code> </a> 가치
zh_cn: <a href="position"> <code>position</code> </a>价值

source: Value of the <a href="-ms-content-zoom-limit-max"><code>-ms-content-zoom-limit-max</code></a> property.
es: Valor de la <a href="-ms-content-zoom-limit-max"> <code>-ms-content-zoom-limit-max</code> </a> .
ko: 의 값 <a href="-ms-content-zoom-limit-max"> <code>-ms-content-zoom-limit-max</code> </a> 속성입니다.
zh_cn: 在价值<a href="-ms-content-zoom-limit-max"> <code>-ms-content-zoom-limit-max</code> </a>性能。

source: Value of the <a href="-ms-content-zoom-limit-min"><code>-ms-content-zoom-limit-min</code></a> property.
es: Valor de la <a href="-ms-content-zoom-limit-min"> <code>-ms-content-zoom-limit-min</code> </a> .
ko: 의 값 <a href="-ms-content-zoom-limit-min"> <code>-ms-content-zoom-limit-min</code> </a> 속성입니다.
zh_cn: 在价值<a href="-ms-content-zoom-limit-min"> <code>-ms-content-zoom-limit-min</code> </a>财产。

source: Value of the <a href="-ms-content-zoom-snap-points"><code>-ms-content-zoom-snap-points</code></a> property.
es: Valor de la <a href="-ms-content-zoom-snap-points"> <code>-ms-content-zoom-snap-points</code> </a> .
ko: 의 값 <a href="-ms-content-zoom-snap-points"> <code>-ms-content-zoom-snap-points</code> </a> 속성입니다.
zh_cn: 在价值<a href="-ms-content-zoom-snap-points"> <code>-ms-content-zoom-snap-points</code> </a>属性。

source: Value of the <a href="-ms-content-zoom-snap-type"><code>-ms-content-zoom-snap-type</code></a> property.
es: Valor de la <a href="-ms-content-zoom-snap-type"> <code>-ms-content-zoom-snap-type</code> </a> .
ko: 의 값 <a href="-ms-content-zoom-snap-type"> <code>-ms-content-zoom-snap-type</code> </a> 속성입니다.
zh_cn: 在价值<a href="-ms-content-zoom-snap-type"> <code>-ms-content-zoom-snap-type</code> </a>物业。

source: Value: any integer (0 is the default)
es: Valor:cualquier número entero (0 es el valor por defecto)
ko: 값 : 임의의 정수 (0이 기본값 임)
zh_cn: 值:任何整数(默认为0)。

source: Values &amp; Units
es: Valores y Unidades
ko: 값 및 단위
zh_cn: 值和单位

source: Values are separated by commas to indicate that they are alternatives. The browser will select the first font in the list that is installed or that can be downloaded using a <a href="@font-face"><code>@font-face</code></a> at-rule.
es: Los valores est&aacute;n separados por comas para indicar que son alternativas. El navegador seleccionar&aacute; la primera fuente de la lista que est&eacute; instalada o que se pueda descargar usando una <a href="@font-face"> <code>@font-face</code> </a> at-rule.
ko: 값은 대체 항목임을 나타 내기 위해 쉼표로 구분됩니다. 브라우저는 목록에서 설치되거나 <a href="@font-face"> <code>@font-face</code> </a> at-rule을 사용하여 다운로드 할 수있는 첫 번째 글꼴을 선택합니다 .
zh_cn: 值之间用逗号分隔，表示它们是替代项。浏览器将在列表中选择已安装或可以使用<a href="@font-face"> <code>@font-face</code> </a>规则下载的第一个字体。

source: Values for inline elements
es: Valores de los elementos en línea
ko: 인라인 요소의 값
zh_cn: 内联元素的数值

source: Values for table cells
es: Los valores de las celdas de la tabla
ko: 테이블 셀의 값
zh_cn: 表格单元格的数值

source: Values for this property correspond to the <a href="padding-top"><code>padding-top</code></a> and <a href="padding-bottom"><code>padding-bottom</code></a>, or <a href="padding-right"><code>padding-right</code></a>, and <a href="padding-left"><code>padding-left</code></a> property depending on the values defined for <a href="writing-mode"><code>writing-mode</code></a>, <a href="direction"><code>direction</code></a>, and <a href="text-orientation"><code>text-orientation</code></a>.
ko: 이 속성 의 값은 <a href="writing-mode"> <code>writing-mode</code> </a> , <a href="direction"> <code>direction</code> </a> , <a href="text-orientation"> <code>text-orientation</code> 에</a> 대해 정의 된 값에 따라 <a href="padding-top"> <code>padding-top</code> </a> 및 <a href="padding-bottom"> <code>padding-bottom</code> </a> 또는 <a href="padding-right"> <code>padding-right</code> </a> 및 <a href="padding-left"> <code>padding-left</code> </a> 속성에 해당합니다 .
zh_cn: 此属性的值对应于<a href="padding-top"> <code>padding-top</code> </a>和<a href="padding-bottom"> <code>padding-bottom</code> </a>或<a href="padding-right"> <code>padding-right</code> </a>和<a href="padding-left"> <code>padding-left</code> </a>属性，具体取决于为<a href="writing-mode"> <code>writing-mode</code> </a>，<a href="direction"> <code>direction</code> </a>和<a href="text-orientation"> <code>text-orientation</code> </a>定义的值。

source: Values in JavaScript
es: Valores en JavaScript
ko: JavaScript의 값
zh_cn: JavaScript中的值

source: Values of <code>background-clip</code> longhand
es: Los valores de <code>background-clip</code> escritura a mano
ko: <code>background-clip</code> longhand의 값
zh_cn: 值 <code>background-clip</code> 速记

source: Values of <code>background-origin</code> longhand
es: Valores de <code>background-origin</code> largo
ko: <code>background-origin</code> longhand의 값
zh_cn: 值 <code>background-origin</code> 速记

source: Values of <code>background-size</code> longhand
es: Valores de <code>background-size</code> de fondo longhand
ko: <code>background-size</code> longhand의 값
zh_cn: 值 <code>background-size</code> 手写

source: Values of <code>writing-mode</code>
es: Valores del <code>writing-mode</code>
ko: <code>writing-mode</code> 가치
zh_cn: <code>writing-mode</code> 价值

source: Values: <code>auto</code> (default) | <code>flex-start</code> | <code>flex-end</code> | <code>center</code> | <code>baseline</code> | <code>stretch</code>
es: Valores: <code>auto</code> (predeterminado) | <code>flex-start</code> | <code>flex-end</code> | <code>center</code> | <code>baseline</code> | <code>stretch</code>
ko: 값 : <code>auto</code> (기본값) | <code>flex-start</code> | <code>flex-end</code> | <code>center</code> | <code>baseline</code> | <code>stretch</code>
zh_cn: 值： <code>auto</code> （默认）| <code>flex-start</code> | <code>flex-end</code> | <code>center</code> | <code>baseline</code> | <code>stretch</code>

source: Values: <code>flex-start</code> (default) | <code>flex-end</code> | <code>center</code> | <code>space-between</code> | <code>space-around</code>
es: Valores: <code>flex-start</code> (predeterminado) | <code>flex-end</code> | <code>center</code> | <code>space-between</code> | <code>space-around</code>
ko: 값 : <code>flex-start</code> (기본값) | <code>flex-end</code> | <code>center</code> | <code>space-between</code> | <code>space-around</code>
zh_cn: 值： <code>flex-start</code> （默认）| <code>flex-end</code> | <code>center</code> | <code>space-between</code> | <code>space-around</code>

source: Values: <code>flex-start</code> | <code>flex-end</code> | <code>center</code> | <code>baseline</code> | <code>stretch</code> (default)
es: Valores: <code>flex-start</code> | <code>flex-end</code> | <code>center</code> | <code>baseline</code> | <code>stretch</code> (predeterminado)
ko: 값 : <code>flex-start</code> | <code>flex-end</code> | <code>center</code> | <code>baseline</code> | <code>stretch</code> (기본값)
zh_cn: 值： <code>flex-start</code> | <code>flex-end</code> | <code>center</code> | <code>baseline</code> | <code>stretch</code> （默认）

source: Values: <code>flex-start</code> | <code>flex-end</code> | <code>center</code> | <code>space-between</code> | <code>space-around</code> | <code>stretch</code> (default)
es: Valores: <code>flex-start</code> | <code>flex-end</code> | <code>center</code> | <code>space-between</code> | <code>space-around</code> | <code>stretch</code> (predeterminado)
ko: 값 : <code>flex-start</code> | <code>flex-end</code> | <code>center</code> | <code>space-between</code> | <code>space-around</code> | <code>stretch</code> (기본값)
zh_cn: 值： <code>flex-start</code> | <code>flex-end</code> | <code>center</code> | <code>space-between</code> | <code>space-around</code> | <code>stretch</code> （默认）

source: Values: <code>flex</code> | <code>inline-flex</code>
es: Valores: <code>flex</code> | <code>inline-flex</code>
ko: 값 : <code>flex</code> | <code>inline-flex</code>
zh_cn: 值： <code>flex</code> | <code>inline-flex</code>

source: Values: <code>nowrap</code> (default) | <code>wrap</code> | <code>wrap-reverse</code>
es: Valores: <code>nowrap</code> (predeterminado) | <code>wrap</code> | <code>wrap-reverse</code>
ko: 값 : <code>nowrap</code> (기본값) | <code>wrap</code> | <code>wrap-reverse</code>
zh_cn: 值： <code>nowrap</code> （默认）| <code>wrap</code> | <code>wrap-reverse</code>

source: Values: <code>row</code> (default) | <code>nowrap</code>
es: Valores: <code>row</code> (predeterminado) | <code>nowrap</code>
ko: 값 : <code>row</code> (기본값) | <code>nowrap</code>
zh_cn: 值： <code>row</code> （默认）| <code>nowrap</code>

source: Values: <code>row</code> (default) | <code>row-reverse</code> | <code>column</code> | <code>column-reverse</code>
es: Valores: <code>row</code> (predeterminado) | <code>row-reverse</code> | <code>column</code> a | <code>column-reverse</code>
ko: 값 : <code>row</code> (기본값) | <code>row-reverse</code> | <code>column</code> | <code>column-reverse</code>
zh_cn: 值： <code>row</code> （默认）| <code>row-reverse</code> | <code>column</code> | <code>column-reverse</code>

source: Values: See the <a href="../flex"><code>flex</code></a> reference for values and default
es: Valores: consulte la referencia <a href="../flex"> <code>flex</code> ible</a> para valores y valores predeterminados
ko: 값 : 값 및 기본값 은 <a href="../flex"> <code>flex</code> </a> 참조를 참조 하십시오
zh_cn: 值：有关值和默认值，请参见<a href="../flex"> <code>flex</code> </a>参考。

source: Values: See the <a href="../flex-basis"><code>flex-basis</code></a> reference (the default is<code> auto</code>)
es: Valores: consulte la referencia de <a href="../flex-basis"> <code>flex-basis</code> </a> (el valor predeterminado es <code> auto</code> m&aacute;tico )
ko: 값 : <a href="../flex-basis"> <code>flex-basis</code> </a> 참조 참조 (기본값은 <code> auto</code> )
zh_cn: 值：请参阅<a href="../flex-basis"> <code>flex-basis</code> </a>参考（默认值为 <code> auto</code> ）。

source: Variable Fonts: what they are, and how they differ
es: Fuentes variables:qué son y en qué se diferencian
ko: 변수 글꼴 : 그 의미와 차이점
zh_cn: 可变字体:它们是什么,它们有什么不同?

source: Variable font axes come in two types: <strong>registered</strong> and <strong>custom</strong>.
es: Los ejes de fuente variable vienen en dos tipos: <strong>registrados</strong> y <strong>personalizados</strong> .
ko: 가변 글꼴 축은 <strong>registered</strong> 및 <strong>custom</strong> 두 가지 유형으로 제공됩니다 .
zh_cn: 可变字体轴有两种类型：<strong>registered</strong>和<strong>custom</strong>。

source: Variable font support can be checked with CSS Feature Queries (see <a href="../@supports"><code>@supports</code></a>), so it's possible to use variable fonts in production and scope the CSS calling the variable fonts inside a feature query block.
es: El soporte de fuentes variables se puede verificar con las consultas de caracter&iacute;sticas CSS (consulte <a href="../@supports"> <code>@supports</code> </a> ), por lo que es posible usar fuentes variables en producci&oacute;n y abarcar el CSS que llama a las fuentes variables dentro de un bloque de consulta de caracter&iacute;sticas.
ko: 변수 글꼴 지원은 CSS 기능 쿼리 ( <a href="../@supports"> <code>@supports</code> </a> 참조 ) 로 확인할 수 있으므로 프로덕션에서 변수 글꼴을 사용하고 기능 쿼리 블록 내에서 변수 글꼴을 호출하는 CSS의 범위를 지정할 수 있습니다.
zh_cn: 可以使用CSS Feature Queries（请参阅<a href="../@supports"> <code>@supports</code> </a>）检查可变字体的支持，因此可以在生产环境中使用可变字体，并在CSS范围内调用功能查询块中的可变字体。

source: Variable fonts
es: Fuentes variables
ko: 변수 글꼴
zh_cn: 可变字体

source: Variable fonts can offer a fine control over the degree to which an oblique face is slanted. You can select this using the <code>&lt;angle&gt;</code> modifier for the <code>oblique</code> keyword.
es: Las fuentes variables pueden ofrecer un control preciso sobre el grado de inclinaci&oacute;n de una cara oblicua. Puede seleccionar esto usando el modificador <code>&lt;angle&gt;</code> para la palabra clave <code>oblique</code> .
ko: 가변 글꼴은 비스듬한면이 기울어지는 정도를 미세하게 제어 할 수 있습니다. <code>oblique</code> 키워드에 대해 <code>&lt;angle&gt;</code> 수정자를 사용하여이를 선택할 수 있습니다 .
zh_cn: 可变字体可以很好地控制倾斜面的倾斜程度。可以使用选择此 <code>&lt;angle&gt;</code> 改性剂为 <code>oblique</code> 关键字。

source: Variable fonts examples
es: Ejemplos de fuentes variables
ko: 변수 글꼴 예
zh_cn: 可变字体实例

source: Variable fonts guide
es: Fuentes de guía variable
ko: 가변 글꼴 안내서
zh_cn: 可变引导字体

source: Varies from one browser to another
es: Varía de un navegador a otro
ko: 브라우저마다 다릅니다
zh_cn: 因浏览器而异

source: Various coordinate models can be used to describe an HTML element's size and shape, as well as any transformations applied to it. The most common is the <a href="https://en.wikipedia.org/wiki/Cartesian_coordinate_system">Cartesian coordinate system</a>, although <a href="https://en.wikipedia.org/wiki/Homogeneous_coordinates">homogeneous coordinates</a> are also sometimes used.
es: Se pueden usar varios modelos de coordenadas para describir el tama&ntilde;o y la forma de un elemento HTML, as&iacute; como cualquier transformaci&oacute;n que se le aplique. El m&aacute;s com&uacute;n es el <a href="https://en.wikipedia.org/wiki/Cartesian_coordinate_system">sistema de coordenadas cartesianas</a> , aunque a veces tambi&eacute;n se utilizan <a href="https://en.wikipedia.org/wiki/Homogeneous_coordinates">coordenadas homog&eacute;neas</a> .
ko: 다양한 좌표 모델을 사용하여 HTML 요소의 크기와 모양 및 적용된 변형을 설명 할 수 있습니다. <a href="https://en.wikipedia.org/wiki/Homogeneous_coordinates">동종 좌표</a> 도 사용 되기는하지만 가장 일반적인 것은 <a href="https://en.wikipedia.org/wiki/Cartesian_coordinate_system">직교 좌표계</a> 입니다.
zh_cn: 各种坐标模型可用于描述HTML元素的大小和形状，以及应用于它的任何转换。最常见的是<a href="https://en.wikipedia.org/wiki/Cartesian_coordinate_system">笛卡尔坐标系</a>，尽管有时也使用<a href="https://en.wikipedia.org/wiki/Homogeneous_coordinates">齐次坐标</a>。

source: Various operating systems do support such preferences and user agents are likely to rely on the settings provided by the operating system.
ko: 다양한 운영 체제가 이러한 기본 설정을 지원하며 사용자 에이전트는 운영 체제에서 제공하는 설정에 의존 할 가능성이 높습니다.
zh_cn: 各种操作系统确实支持这种偏好,用户代理很可能依赖操作系统提供的设置。

source: Varying stroke widths
ko: 다양한 획 너비
zh_cn: 不同的行程宽度

source: Varying the stroke color
ko: 획 색상 변경
zh_cn: 改变笔触颜色

source: Varying thickness
ko: 다양한 두께
zh_cn: 厚度不一

source: Vector plus angle value
es: Vector más valor de ángulo
ko: 벡터 더하기 각도 값
zh_cn: 矢量加角度值

source: Vertical alignment
es: Alineación vertical
ko: 수직 정렬
zh_cn: 纵向对准

source: Vertical margins between two floated elements on the other hand will not collapse. When applied to floating elements, the <a href="box_model">margin edge</a> of the bottom element is moved below the <a href="box_model">margin edge</a> of all relevant floats. This affects the position of later floats, since later floats cannot be positioned higher than earlier ones.
es: Los m&aacute;rgenes verticales entre dos elementos flotantes, por otro lado, no colapsar&aacute;n. Cuando se aplica a elementos flotantes, el <a href="box_model">borde</a> del margen del elemento inferior se mueve debajo del <a href="box_model">borde</a> del margen de todos los flotadores relevantes. Esto afecta la posici&oacute;n de los flotadores posteriores, ya que los flotadores posteriores no pueden colocarse m&aacute;s altos que los anteriores.
ko: 반면에 두 개의 부동 요소 사이의 수직 여백은 축소되지 않습니다. 플로팅 소자에 적용될 때, <a href="box_model">마진 모서리</a> 최하 요소의 아래에는 이동 <a href="box_model">마진 모서리</a> 관련된 모든 플로트. 이후 수레는 이전 수레보다 높게 위치 할 수 없으므로 이후 수레의 위치에 영향을줍니다.
zh_cn: 另一方面，两个浮动元素之间的垂直边距不会崩溃。当应用于浮动元素时，底部元素的<a href="box_model">边沿边缘</a>将移动到所有相关浮动元素的<a href="box_model">边沿边缘</a>之下。这会影响后面的浮动对象的位置，因为后面的浮动对象不能位于比之前的浮动对象更高的位置。

source: Vertical margins between two floated elements on the other hand will not collapse. When applied to floating elements, the margin edge of the bottom element is moved below the margin edge of all relevant floats. This affects the position of later floats, since later floats cannot be positioned higher than earlier ones.
ko: 반면에 플로팅 된 두 요소 사이의 수직 여백은 축소되지 않습니다. 플로팅 요소에 적용하면 하단 요소의 여백 가장자리가 모든 관련 플로트의 여백 가장자리 아래로 이동합니다. 이것은 나중 수레가 이전 수레보다 높게 위치 할 수 없기 때문에 나중 수레의 위치에 영향을줍니다.
zh_cn: 另一方面,两个浮动元素之间的垂直边距不会折叠。当应用于浮动元素时,底部元素的边距边缘会被移动到所有相关浮动元素的边距边缘之下。这将影响后面浮动元素的位置,因为后面的浮动元素的位置不能高于前面的浮动元素。

source: Vertical to horizontal translation, as described in <a href="#Remarks">Remarks</a>, will take place when appropriate.
es: La traducci&oacute;n vertical a horizontal, como se describe en <a href="#Remarks">Comentarios</a> , se llevar&aacute; a cabo cuando sea apropiado.
ko: 설명에 <a href="#Remarks">설명 된</a> 대로 수직에서 수평으로의 변환 이 필요할 때 수행됩니다.
zh_cn: 如<a href="#Remarks">备注所述</a>，将进行垂直到水平的平移。

source: Vertical-Align: All You Need To Know
es: Alineación vertical:Todo lo que necesitas saber
ko: 수직 정렬 : 알아야 할 모든 것
zh_cn: 垂直对准:您需要知道的所有事情

source: Vertically stacked fractions.
es: Fracciones apiladas verticalmente.
ko: 세로로 쌓인 분수.
zh_cn: 垂直叠加的分数。

source: Via script
ko: 스크립트를 통해
zh_cn: 通过脚本

source: Via stylesheet
ko: 스타일 시트를 통해
zh_cn: 通过样式表

source: Video tutorial: <em><a href="http://gridbyexample.com/video/grid-template-areas/">Grid Template Areas</a></em>
es: Video tutorial: <em><a href="http://gridbyexample.com/video/grid-template-areas/">&Aacute;reas de plantilla de cuadr&iacute;cula</a></em>
ko: 비디오 튜토리얼 : <em><a href="http://gridbyexample.com/video/grid-template-areas/">그리드 템플릿 영역</a></em>
zh_cn: 视频教程：<em><a href="http://gridbyexample.com/video/grid-template-areas/">网格模板区域</a></em>

source: Video tutorial: <em><a href="http://gridbyexample.com/video/series-auto-placement-order/">Introducing Grid auto-placement and order</a></em>
es: Video tutorial: <em><a href="http://gridbyexample.com/video/series-auto-placement-order/">Introducci&oacute;n a la colocaci&oacute;n y el orden autom&aacute;ticos de Grid</a></em>
ko: 비디오 자습서 : <em><a href="http://gridbyexample.com/video/series-auto-placement-order/">그리드 자동 배치 및 순서 소개</a></em>
zh_cn: 视频教程：<em><a href="http://gridbyexample.com/video/series-auto-placement-order/">介绍网格自动放置和排序</a></em>

source: Video tutorial: <em><a href="http://gridbyexample.com/video/series-define-a-grid/">Defining a Grid</a></em>
es: Video tutorial: <em><a href="http://gridbyexample.com/video/series-define-a-grid/">Definici&oacute;n de una cuadr&iacute;cula</a></em>
ko: 비디오 자습서 : <em><a href="http://gridbyexample.com/video/series-define-a-grid/">그리드 정의</a></em>
zh_cn: 视频教程：<em><a href="http://gridbyexample.com/video/series-define-a-grid/">定义网格</a></em>

source: Video tutorial: <em><a href="http://gridbyexample.com/video/series-line-based-placement/">Line-based placement</a></em>
es: Video tutorial: <em><a href="http://gridbyexample.com/video/series-line-based-placement/">colocaci&oacute;n basada en l&iacute;neas</a></em>
ko: 비디오 자습서 : <em><a href="http://gridbyexample.com/video/series-line-based-placement/">라인 기반 배치</a></em>
zh_cn: 视频教程：<em><a href="http://gridbyexample.com/video/series-line-based-placement/">基于行的放置</a></em>

source: Video tutorial: <em><a href="http://gridbyexample.com/video/series-minmax/">Introducing minmax()</a></em>
es: Video tutorial: <em><a href="http://gridbyexample.com/video/series-minmax/">Presentaci&oacute;n de minmax ()</a></em>
ko: 비디오 자습서 : <em><a href="http://gridbyexample.com/video/series-minmax/">minmax () 소개</a></em>
zh_cn: 视频教程：<em><a href="http://gridbyexample.com/video/series-minmax/">minmax（）简介</a></em>

source: Video tutorial: Coding a Dark Mode for your Website
ko: 비디오 자습서 : 웹 사이트를위한 다크 모드 코딩
zh_cn: 视频教程。为你的网站编码一个黑暗模式
