Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/css/css.*.017.xlf
Languages: es, ko, zh_cn

source: You can use the <a href="../grid-area"><code>grid-area</code></a> property to specify all four lines of a grid area as one value. When people first encounter this, they are often surprised that the values do not follow the same order as the shorthand for margin &ndash; which runs clockwise: top, right, bottom, left.
es: Puede usar la propiedad de <a href="../grid-area"> <code>grid-area</code> </a> para especificar las cuatro l&iacute;neas de un &aacute;rea de cuadr&iacute;cula como un valor. Cuando las personas se encuentran por primera vez con esto, a menudo se sorprenden de que los valores no sigan el mismo orden que la abreviatura de margen, que se ejecuta en sentido horario: arriba, derecha, abajo, izquierda.
ko: <a href="../grid-area"> <code>grid-area</code> </a> 속성을 사용하여 그리드 영역의 네 줄을 모두 하나의 값으로 지정할 수 있습니다 . 사람들이이 문제를 처음 접했을 때, 값이 위쪽, 오른쪽, 아래쪽, 왼쪽과 같이 시계 방향으로 실행되는 여백의 단축과 동일한 순서를 따르지 않는 경우가 종종 있습니다.
zh_cn: 您可以使用<a href="../grid-area"> <code>grid-area</code> </a>属性将网格区域的所有四行指定为一个值。当人们第一次遇到这种情况时，他们常常会惊讶地发现值没有遵循与保证金速记相同的顺序&ndash;顺时针运行：上，右，下，左。

source: You can use the <code>-ms-wrap-through</code> property to control the effect of exclusions; for instance, to cause one content block to wrap around an exclusion element and another to intersect the same exclusion element.
es: Puede usar la <code>-ms-wrap-through</code> para controlar el efecto de las exclusiones; por ejemplo, para hacer que un bloque de contenido se ajuste alrededor de un elemento de exclusi&oacute;n y otro se cruce con el mismo elemento de exclusi&oacute;n.
ko: <code>-ms-wrap-through</code> 속성을 사용하여 제외 효과를 제어 할 수 있습니다 . 예를 들어, 하나의 콘텐츠 블록이 제외 요소를 둘러싸고 다른 콘텐츠 블록이 동일한 제외 요소와 교차하도록합니다.
zh_cn: 您可以使用 <code>-ms-wrap-through</code> 属性来控制排除的效果。例如，导致一个内容块环绕一个排除元素，而另一个内容块与同一排除元素相交。

source: You can use the <code>:checked</code> pseudo-class to build an image gallery with full-size images that show only when the user clicks on a thumbnail. See <a href="https://developer.mozilla.org/@api/deki/files/6268/=css-checked-gallery.zip">this demo</a> for a possible cue.
es: Puede usar la pseudoclase <code>:checked</code> para crear una galer&iacute;a de im&aacute;genes con im&aacute;genes de tama&ntilde;o completo que se muestran solo cuando el usuario hace clic en una miniatura. Vea <a href="https://developer.mozilla.org/@api/deki/files/6268/=css-checked-gallery.zip">esta demostraci&oacute;n</a> para una posible se&ntilde;al.
ko: <code>:checked</code> 의사 클래스를 사용하여 사용자가 축소판을 클릭 할 때만 표시되는 전체 크기 이미지로 이미지 갤러리를 빌드 할 수 있습니다 . 가능한 단서에 대해서는 <a href="https://developer.mozilla.org/@api/deki/files/6268/=css-checked-gallery.zip">이 데모</a> 를 참조하십시오 .
zh_cn: 您可以使用 <code>:checked</code> 伪类来构建包含全尺寸图像的图像库，这些图像仅在用户单击缩略图时显示。请参阅<a href="https://developer.mozilla.org/@api/deki/files/6268/=css-checked-gallery.zip">此演示</a>以获得可能的提示。

source: You can use the <code>:hover</code> pseudo-class to build an image gallery with full-size images that show only when the mouse moves over a thumbnail. See <a href="https://developer.mozilla.org/@api/deki/files/6247/=css-gallery.zip">this demo</a> for a possible cue.
es: Puede usar la <code>:hover</code> para crear una galer&iacute;a de im&aacute;genes con im&aacute;genes de tama&ntilde;o completo que se muestren solo cuando el mouse se mueva sobre una miniatura. Vea <a href="https://developer.mozilla.org/@api/deki/files/6247/=css-gallery.zip">esta demostraci&oacute;n</a> para una posible se&ntilde;al.
ko: <code>:hover</code> 의사 클래스를 사용하여 마우스가 축소판 위로 움직일 때만 표시되는 전체 크기 이미지로 이미지 갤러리를 만들 수 있습니다 . 가능한 단서에 대해서는 <a href="https://developer.mozilla.org/@api/deki/files/6247/=css-gallery.zip">이 데모</a> 를 참조하십시오 .
zh_cn: 您可以使用 <code>:hover</code> 伪类来构建包含全尺寸图像的图像库，该图像仅在鼠标移至缩略图上方时显示。请参阅<a href="https://developer.mozilla.org/@api/deki/files/6247/=css-gallery.zip">此演示</a>以获得可能的提示。

source: You can use the <code>:target</code> pseudo-class to create a lightbox without using any JavaScript. This technique relies on the ability of anchor links to point to elements that are initially hidden on the page. Once targeted, the CSS changes their <code>display</code> so that they are shown.
es: Puede usar la <code>:target</code> para crear una caja de luz sin usar JavaScript. Esta t&eacute;cnica se basa en la capacidad de los enlaces de anclaje para se&ntilde;alar elementos que inicialmente est&aacute;n ocultos en la p&aacute;gina. Una vez dirigido, el CSS cambia su <code>display</code> para que se muestren.
ko: 당신은 사용할 수 있습니다 <code>:target</code> 자바 스크립트를 사용하지 않고 라이트 박스를 만들 의사 클래스를. 이 기술은 앵커 링크가 페이지에 처음 숨겨져있는 요소를 가리키는 기능에 의존합니다. 대상이되면 CSS는 <code>display</code> 되도록 표시를 변경합니다 .
zh_cn: 您可以使用 <code>:target</code> 伪类创建灯箱，而无需使用任何JavaScript。此技术依赖于锚点链接指向最初隐藏在页面上的元素的能力。一旦成为目标，CSS就会更改其 <code>display</code> 以便显示它们。

source: You can use the <code><a href="https://developer.mozilla.org/en-US/docs/Web/Events/transitionend">transitionend</a></code> event to detect that an animation has finished running. This is a <a href="https://developer.mozilla.org/en-US/docs/Web/API/TransitionEvent"><code>TransitionEvent</code></a> object, which has two added properties beyond a typical <a href="https://developer.mozilla.org/en-US/docs/Web/API/Event"><code>Event</code></a> object:
es: Puede usar el evento de <code><a href="https://developer.mozilla.org/en-US/docs/Web/Events/transitionend">transitionend</a></code> para detectar que una animaci&oacute;n ha terminado de ejecutarse. Este es un objeto <a href="https://developer.mozilla.org/en-US/docs/Web/API/TransitionEvent"> <code>TransitionEvent</code> </a> , que tiene dos propiedades agregadas m&aacute;s all&aacute; de un objeto <a href="https://developer.mozilla.org/en-US/docs/Web/API/Event"> <code>Event</code> </a> t&iacute;pico :
ko: <code><a href="https://developer.mozilla.org/en-US/docs/Web/Events/transitionend">transitionend</a></code> 이벤트를 사용하여 애니메이션 실행이 완료되었음을 감지 할 수 있습니다 . 이것은 <a href="https://developer.mozilla.org/en-US/docs/Web/API/TransitionEvent"> <code>TransitionEvent</code> </a> 객체이며 일반적인 <a href="https://developer.mozilla.org/en-US/docs/Web/API/Event"> <code>Event</code> </a> 객체 외에 두 가지 속성이 추가되었습니다 .
zh_cn: 您可以使用 <code><a href="https://developer.mozilla.org/en-US/docs/Web/Events/transitionend">transitionend</a></code> 事件来检测动画是否已完成运行。这是一个<a href="https://developer.mozilla.org/en-US/docs/Web/API/TransitionEvent"> <code>TransitionEvent</code> </a>对象，除了典型的<a href="https://developer.mozilla.org/en-US/docs/Web/API/Event"> <code>Event</code> </a>对象之外，还具有两个附加的属性：

source: You can use the <code>columns</code>shorthand to set <code>column-count</code> and <code>column-width</code>. If you set a length unit, this will be used for <code>column-width</code>, set an integer and it will be used for <code>column-count</code>. You can set both, separating the two values with a space.
es: Puede utilizar las <code>columns</code> de la taquigraf&iacute;a al conjunto de <code>column-count</code> y <code>column-width</code> . Si establece una unidad de longitud, se usar&aacute; para <code>column-width</code> de columna , establezca un n&uacute;mero entero y se usar&aacute; para <code>column-count</code> . Puede establecer ambos, separando los dos valores con un espacio.
ko: <code>columns</code> 속기를 사용하여 <code>column-count</code> 및 <code>column-width</code> 를 설정할 수 있습니다 . 길이 단위를 설정하면 <code>column-width</code> 에 사용되고 정수를 설정하고 <code>column-count</code> 에 사용 됩니다. 두 값을 공백으로 구분하여 둘 다 설정할 수 있습니다.
zh_cn: 您可以使用 <code>columns</code> 简写形式设置 <code>column-count</code> 和 <code>column-width</code> 。如果设置长度单位，则此单位将用于 <code>column-width</code> ，设置整数，并将其用于 <code>column-count</code> 。您可以设置两者，并用空格分隔两个值。

source: You can use the <code>resize</code> property to make any element resizable. In the example below, a resizable <a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/div"><code>&lt;div&gt;</code></a> contains a resizable paragraph (<a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/p"><code>&lt;p&gt;</code></a> element).
es: Puede usar la propiedad de cambio de <code>resize</code> para hacer que cualquier elemento sea redimensionable. En el ejemplo a continuaci&oacute;n, un <a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/div"> <code>&lt;div&gt;</code> </a> redimensionable contiene un p&aacute;rrafo redimensionable ( elemento <a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/p"> <code>&lt;p&gt;</code> </a> ).
ko: 당신은 사용할 수있는 <code>resize</code> 모든 요소의 크기를 조정할 수 있도록 속성을. 아래 예에서 크기 조정 가능한 <a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/div"> <code>&lt;div&gt;</code> </a> 에는 크기 조정 가능한 단락 ( <a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/p"> <code>&lt;p&gt;</code> </a> 요소)이 포함되어 있습니다 .
zh_cn: 您可以使用 <code>resize</code> 属性来调整任何元素的大小。在下面的示例中，可调整大小的<a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/div"> <code>&lt;div&gt;</code> </a>包含可调整大小的段落（<a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/p"> <code>&lt;p&gt;</code> </a>元素）。

source: You can use the Box Alignment properties across both layout methods, so using flexbox as a fallback for grid layout can work very well.
es: Puede utilizar las propiedades de alineación de cajas en ambos métodos de diseño,por lo que el uso de flexbox como alternativa para el diseño de la cuadrícula puede funcionar muy bien.
ko: 두 레이아웃 방법 모두에서 Box Alignment 속성을 사용할 수 있으므로 flexbox를 그리드 레이아웃의 폴백으로 사용하면 매우 효과적입니다.
zh_cn: 你可以在两种布局方法中使用方框对齐属性,所以使用flexbox作为网格布局的后备,可以很好地发挥作用。

source: You can use the following pseudo elements to customize various parts of the scrollbar for webkit browsers:
ko: 다음 의사 요소를 사용하여 웹킷 브라우저에 대한 스크롤 막대의 다양한 부분을 사용자 정의 할 수 있습니다.
zh_cn: 您可以使用以下伪元素为webkit浏览器定制滚动条的各个部分。

source: You can use this syntax in the exact same way as the <a href="../grid-template"><code>grid-template</code></a> shorthand, just be aware than when doing so you will reset the other values set by the property.
es: Puede usar esta sintaxis exactamente de la misma manera que la taquigraf&iacute;a de <a href="../grid-template"> <code>grid-template</code> </a> , solo tenga en cuenta que al hacerlo restablecer&aacute; los otros valores establecidos por la propiedad.
ko: 이 구문은 <a href="../grid-template"> <code>grid-template</code> </a> 속기 와 정확히 같은 방식으로 사용할 수 있습니다. 이렇게하면 속성에서 설정 한 다른 값을 재설정 할 수 있습니다.
zh_cn: 您可以按照与<a href="../grid-template"> <code>grid-template</code> </a>速记完全相同的方式使用此语法，只是要注意，这样做时将重置属性设置的其他值。

source: You can't change all CSS properties with <code>@page</code>. You can only change the margins, orphans, widows, and page breaks of the document. Attempts to change any other CSS properties will be ignored.
ko: <code>@page</code> 로 모든 CSS 속성을 변경할 수는 없습니다 . 문서의 여백, 고아, 과부 및 페이지 나누기 만 변경할 수 있습니다. 다른 CSS 속성을 변경하려는 시도는 무시됩니다.
zh_cn: 您不能使用 <code>@page</code> 更改所有CSS属性。您只能更改文档的页边距，孤儿，寡妇和分页符。尝试更改任何其他CSS属性将被忽略。

source: You could add a label or icon to the left as easily as we popped the button onto the right. I have added a label, and other than some styling for background colour I didn&rsquo;t need to change the layout. The stretchy input field now has a little less space to play with but it uses the space left after the two items are accounted for.
es: Puede agregar una etiqueta o &iacute;cono a la izquierda tan f&aacute;cilmente como colocamos el bot&oacute;n a la derecha. He agregado una etiqueta, y aparte de algunos estilos para el color de fondo, no necesitaba cambiar el dise&ntilde;o. El campo de entrada el&aacute;stico ahora tiene un poco menos de espacio para jugar, pero usa el espacio restante despu&eacute;s de que se tienen en cuenta los dos elementos.
ko: 버튼을 오른쪽에 올려 놓은 것처럼 레이블이나 아이콘을 왼쪽에 쉽게 추가 할 수 있습니다. 레이블을 추가했으며 배경색에 대한 스타일 이외의 레이아웃을 변경할 필요가 없었습니다. 신축성있는 입력 필드는 이제 플레이 할 공간이 조금 줄어들지 만 두 항목을 고려한 후 남은 공간을 사용합니다.
zh_cn: 您可以在左侧添加标签或图标，就像我们将按钮弹出到右侧一样容易。我添加了一个标签，除了背景颜色的某些样式外，我不需要更改布局。可伸缩输入字段现在可以使用的空间要少一些，但是它使用了考虑了两项后剩下的空间。

source: You could also allow both sides to grow and shrink in proportion. If you set both sides to <code>flex: 1</code>, they will grow and shrink from a <a href="../flex-basis"><code>flex-basis</code></a> of 0, so you will end up with two equal-sized columns. You could either take the content as a guide and set both to <code>flex: auto</code>, in which case they would grow and shrink from the size of the content or any size applied directly to the flex items such as a width on the image.
es: Tambi&eacute;n podr&iacute;a permitir que ambos lados crezcan y se reduzcan en proporci&oacute;n. Si configura ambos lados para <code>flex: 1</code> , crecer&aacute;n y se reducir&aacute;n a partir de una <a href="../flex-basis"> <code>flex-basis</code> </a> de 0, por lo que terminar&aacute; con dos columnas de igual tama&ntilde;o. Puede tomar el contenido como una gu&iacute;a y configurar ambos para <code>flex: auto</code> , en cuyo caso crecer&iacute;an y reducir&iacute;an el tama&ntilde;o del contenido o cualquier tama&ntilde;o aplicado directamente a los elementos flex, como un ancho en la imagen.
ko: 또한 양쪽이 비례하여 커지거나 줄어들 수 있습니다. 양쪽을 <code>flex: 1</code> 로 설정하면 0 의 <a href="../flex-basis"> <code>flex-basis</code> </a> 에서 커지거나 줄어들 기 때문에 두 개의 동일한 크기의 열이 생깁니다. 컨텐츠를 가이드로 사용하고 <code>flex: auto</code> 설정 하면 컨텐츠의 크기 또는 이미지의 너비와 같은 플렉스 항목에 직접 적용되는 모든 크기에서 커지거나 줄어들 수 있습니다.
zh_cn: 您还可以允许双方按比例增长和收缩。如果将两边都设置为 <code>flex: 1</code> ，则它们将从<a href="../flex-basis"> <code>flex-basis</code> </a>为0开始增长和收缩，因此最终将得到两个相等大小的列。您既可以将内容作为指导，也可以将二者都设置为 <code>flex: auto</code> ，在这种情况下，它们会根据内容的大小或直接应用于flex项目的任何大小（例如图像的宽度）而增长和缩小。

source: You could also give each side different <a href="../flex-grow"><code>flex-grow</code></a> factors, for example setting the side with the image to <code>flex: 1</code> and the content side to <code>flex: 3</code>. This will mean they use a <code>flex-basis</code> of <code>0</code> but distribute that space at different rates according to the <code>flex-grow</code> factor you have assigned. The flex properties we use to do this are described in detail in the guide <a href="controlling_ratios_of_flex_items_along_the_main_ax">Controlling ratios of flex items along the main axis</a>.
es: Tambi&eacute;n puede dar a cada lado diferentes factores de <a href="../flex-grow"> <code>flex-grow</code> </a> , por ejemplo, configurar el lado con la imagen para <code>flex: 1</code> y el lado de contenido para <code>flex: 3</code> . Esto significar&aacute; que usan una <code>flex-basis</code> de <code>0</code> pero distribuyen ese espacio a diferentes velocidades de acuerdo con el factor de <code>flex-grow</code> que haya asignado. Las propiedades de flexi&oacute;n que utilizamos para hacer esto se describen en detalle en la gu&iacute;a <a href="controlling_ratios_of_flex_items_along_the_main_ax">Controlar las relaciones de los elementos de flexi&oacute;n a lo largo del eje principal</a> .
ko: 예를 들어 이미지가있는면을 <code>flex: 1</code> 로 설정하고 콘텐츠면을 <code>flex: 3</code> 설정하는 등 각면에 다른 <a href="../flex-grow"> <code>flex-grow</code> </a> factor를 부여 할 수 있습니다 . 이는 이들이 <code>0</code> 의 <code>flex-basis</code> 을 사용 하지만 할당 한 <code>flex-grow</code> 계수 에 따라 다른 속도로 해당 공간을 분배 함을 의미합니다 . 이를 위해 사용하는 플렉스 속성 <a href="controlling_ratios_of_flex_items_along_the_main_ax">은 주축을 따라 플렉스 아이템의 비율 제어</a> 가이드에 자세히 설명되어 있습니다.
zh_cn: 您还可以为每侧提供不同的<a href="../flex-grow"> <code>flex-grow</code> </a>因子，例如，将图像一侧设置为 <code>flex: 1</code> ，将内容一侧设置为 <code>flex: 3</code> 。这意味着他们使用的 <code>flex-basis</code> 为 <code>0</code> ,但根据您分配的 <code>flex-grow</code> 因子以不同的速率分配该空间。我们用来控制挠曲特性的挠曲特性在《<a href="controlling_ratios_of_flex_items_along_the_main_ax">控制沿着主轴的挠曲项的比率</a>》指南中有详细描述。

source: You could also try removing the background image completely, thus using the gradient purely to create the shape and not displaying it on the page at all.
es: También podrías intentar eliminar la imagen de fondo por completo,usando así el gradiente sólo para crear la forma y no mostrarla en la página en absoluto.
ko: 배경 이미지를 완전히 제거하여 그라디언트를 사용하여 모양을 만들고 페이지에 전혀 표시하지 않을 수도 있습니다.
zh_cn: 你也可以尝试完全去掉背景图片,从而纯粹使用渐变来创建形状,完全不在页面上显示。

source: You could for example float an item left, which would cause the text to wrap round the right and bottom of the item in a rectangular fashion. If you then apply a circle shape, the text would then wrap round the line of the circle.
es: Podrías por ejemplo hacer flotar un artículo hacia la izquierda,lo que haría que el texto se envolviera alrededor de la derecha y la parte inferior del artículo de forma rectangular.Si entonces aplicas la forma de un círculo,el texto se enrollaría alrededor de la línea del círculo.
ko: 예를 들어 항목을 왼쪽으로 띄우면 텍스트가 항목의 오른쪽과 아래쪽을 사각형으로 감싸게됩니다. 그런 다음 원 모양을 적용하면 텍스트가 원의 선을 감싸게됩니다.
zh_cn: 例如,您可以将一个项目向左浮动,这将导致文本以矩形方式绕过项目的右侧和底部。如果你再应用一个圆圈的形状,文字就会绕着圆圈的线条走。

source: You could instead set <code>align-items</code> to <code>flex-start</code> in order to make the items line up at the start of the flex container, <code>flex-end</code> to align them to the end, or <code>center</code> to align them in the centre. Try this in the live example &mdash; I have given the flex container a height in order that you can see how the items can be moved around inside the container. See what happens if you set the value of align-items to:
es: En su lugar, puede configurar <code>align-items</code> en <code>flex-start</code> para hacer que los elementos se alineen al comienzo del contenedor <code>flex-end</code> para alinearlos al final o <code>center</code> para alinearlos en el centro. Pruebe esto en el ejemplo en vivo: le he dado una altura al contenedor flexible para que pueda ver c&oacute;mo se pueden mover los art&iacute;culos dentro del contenedor. Vea lo que sucede si establece el valor de align-items en:
ko: 대신 플렉스 컨테이너의 시작 <code>flex-start</code> 에 <code>align-items</code> 을 정렬하기 위해 정렬 항목 을 플렉스 시작으로 설정하고, <code>flex-end</code> 정렬하려면 플렉스 엔드 를, <code>center</code> 에 정렬하려면 가운데 를 정렬 할 수 있습니다. 실제 예제에서 시도해보십시오. 항목을 컨테이너 내부에서 어떻게 이동할 수 있는지 확인하기 위해 flex 컨테이너에 높이를 지정했습니다. 정렬 항목의 값을 다음과 같이 설정하면 어떻게되는지 확인하십시오.
zh_cn: 您可以改为将 <code>align-items</code> 设置为 <code>flex-start</code> ，以使项目在flex容器的开始处对齐， <code>flex-end</code> 使其对齐到末尾，或 <code>center</code> 以将它们居中对齐。在实际示例中尝试一下&ndash;我给flex容器指定了一个高度，以便您可以查看如何在容器内部移动项目。看看将align-items的值设置为以下值会发生什么：

source: You could say that <code>flex-shrink</code> works in pretty much the same way as <code>flex-grow</code>. However there are two reasons why it isn&rsquo;t <em>quite</em> the same.
es: Se podr&iacute;a decir que <code>flex-shrink</code> funciona de la misma manera que <code>flex-grow</code> . Sin embargo, hay dos razones por las que no es <em>absolutamente</em> la misma.
ko: <code>flex-shrink</code> 는 <code>flex-grow</code> 와 거의 같은 방식으로 작동 한다고 말할 수 있습니다 . 그러나 그것이 <em>완전히 다른</em> 두 가지 이유가 있습니다.
zh_cn: 您可以说 <code>flex-shrink</code> 的工作方式与 <code>flex-grow</code> 几乎相同。然而，有两个原因，它不是<em>很</em>一样。

source: You detect the beginning of a transition using <code><a href="https://developer.mozilla.org/en-US/docs/Web/Events/transitionrun">transitionrun</a></code> (fires before any delay) and <code><a href="https://developer.mozilla.org/en-US/docs/Web/Events/transitionstart">transitionstart</a></code> (fires after any delay), in the same kind of fashion:
es: Detecta el comienzo de una transici&oacute;n usando <code><a href="https://developer.mozilla.org/en-US/docs/Web/Events/transitionrun">transitionrun</a></code> (dispara antes de cualquier demora) y <code><a href="https://developer.mozilla.org/en-US/docs/Web/Events/transitionstart">transitionstart</a></code> (dispara despu&eacute;s de cualquier demora), de la misma manera:
ko: 동일한 방식으로 <code><a href="https://developer.mozilla.org/en-US/docs/Web/Events/transitionstart">transitionstart</a></code> ( 지연 전에 발생) 및 transitionstart (지연 후에 발생 )를 사용하여 <code><a href="https://developer.mozilla.org/en-US/docs/Web/Events/transitionrun">transitionrun</a></code> 시작을 감지합니다 .
zh_cn: 您可以使用 <code><a href="https://developer.mozilla.org/en-US/docs/Web/Events/transitionrun">transitionrun</a></code> （在任何延迟之前触发）和 <code><a href="https://developer.mozilla.org/en-US/docs/Web/Events/transitionstart">transitionstart</a></code> （在任何延迟之后触发）来检测转换的开始，其方式相同：

source: You do need something to float, but that could be some generated content as in the below example. I am floating generated content and using a larger star image to shape my content without displaying any image on the page.
es: Necesitas algo para flotar,pero eso podría ser algún contenido generado como en el siguiente ejemplo.Estoy flotando el contenido generado y usando una imagen de una estrella más grande para dar forma a mi contenido sin mostrar ninguna imagen en la página.
ko: 떠 다니는 것이 필요하지만 아래 예와 같이 생성 된 내용 일 수 있습니다. 생성 된 컨텐츠를 플로팅하고 더 큰 별표 이미지를 사용하여 페이지에 이미지를 표시하지 않고 컨텐츠를 형성합니다.
zh_cn: 你确实需要一些东西来浮动,但这可能是一些生成的内容,就像下面的例子。我正在浮动生成的内容,并使用一个更大的星形图像来塑造我的内容,而不在页面上显示任何图像。

source: You don't have to leave your color stops at their default positions. To fine-tune their locations, you can give each one a percentage or absolute length value. If you specify the location as a percentage, <code>0%</code> represents the starting point, while <code>100%</code> represents the ending point; however, you can use values outside that range if necessary to get the effect you want. If you leave a location unspecified, the position of that particular color stop will be automatically calculated for you.
es: No tiene que dejar sus paradas de color en sus posiciones predeterminadas. Para ajustar sus ubicaciones, puede dar a cada una un valor de porcentaje o longitud absoluta. Si especifica la ubicaci&oacute;n como un porcentaje, <code>0%</code> representa el punto inicial, mientras que <code>100%</code> representa el punto final; sin embargo, puede usar valores fuera de ese rango si es necesario para obtener el efecto que desea. Si deja una ubicaci&oacute;n sin especificar, la posici&oacute;n de esa parada de color en particular se calcular&aacute; autom&aacute;ticamente para usted.
ko: 색상 정지 점을 기본 위치에 두지 않아도됩니다. 위치를 미세 조정하기 위해 각 위치에 백분율 또는 절대 길이 값을 제공 할 수 있습니다. 위치를 백분율로 지정하면 <code>0%</code> 는 시작점을 나타내고 <code>100%</code> 는 끝점을 나타냅니다. 그러나 원하는 효과를 얻기 위해 필요한 경우 해당 범위 밖의 값을 사용할 수 있습니다. 위치를 지정하지 않으면 특정 색상 정지 점의 위치가 자동으로 계산됩니다.
zh_cn: 您不必将色标停留在默认位置。要微调其位置，可以为每个位置指定一个百分比或绝对长度值。如果将位置指定为百分比，则 <code>0%</code> 代表起点，而 <code>100%</code> 代表终点；但是，如果需要，可以使用该范围之外的值以获得所需的效果。如果您未指定位置，则将自动为您计算该特定色标的位置。

source: You don't have to leave your color stops at their default positions. To fine-tune their locations, you can give each one zero, one, or two percentage or, for radial and linear gradients, absolute length values. If you specify the location as a percentage, <code>0%</code> represents the starting point, while <code>100%</code> represents the ending point; however, you can use values outside that range if necessary to get the effect you want. If you leave a location unspecified, the position of that particular color stop will be automatically calculated for you, with the first color stop being at <code>0%</code> and the last color stop being at <code>100%</code>, and any other color stops being half way between their adjacent color stops.
ko: 색상 정지를 기본 위치에 두지 않아도됩니다. 위치를 미세 조정하려면 각각 0, 1 또는 2 백분율을 제공하거나 방사형 및 선형 그래디언트의 경우 절대 길이 값을 제공 할 수 있습니다. 위치를 백분율로 지정하면 <code>0%</code> 는 시작점을 나타내고 <code>100%</code> 는 끝점을 나타냅니다. 그러나 원하는 효과를 얻기 위해 필요한 경우 해당 범위 밖의 값을 사용할 수 있습니다. 위치를 지정하지 않은 상태로두면 해당 특정 색상 중지의 위치가 자동으로 계산됩니다. 첫 번째 색상 중지는 <code>0%</code> 이고 마지막 색상 중지는 <code>100%</code> 이며 다른 모든 색상은 중간에 중지됩니다. 인접한 색상 중지.
zh_cn: 您不必将色标停留在默认位置。要微调它们的位置，您可以给每个值一个零，一个或两个百分比，或者对于径向和线性渐变，给定绝对长度值。如果将位置指定为百分比，则 <code>0%</code> 代表起点，而 <code>100%</code> 代表终点；但是，如果需要，可以使用该范围之外的值来获得所需的效果。如果您未指定位置，则会自动为您计算该特定色标的位置，第一个色标为 <code>0%</code> ，最后一个色标为 <code>100%</code> ，其他任何色标介于两者之间相邻的颜色停止。
