Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/css/css.*.017.xlf
Languages: es, ko, zh_cn

source: Zones 5-8 are <a id="edge-regions" name="edge-regions">edge regions</a>. These are <a href="mask-border-repeat">repeated, scaled, or otherwise modified</a> in the final border image to match the dimensions of the element.
es: Las zonas 5-8 son <a id="edge-regions" name="edge-regions">regiones de borde</a> . Estos se <a href="mask-border-repeat">repiten, escalan o modifican de otro modo</a> en la imagen del borde final para que coincida con las dimensiones del elemento.
ko: 영역 5-8은 <a id="edge-regions" name="edge-regions">가장자리 영역</a> 입니다. 이들은 요소의 치수와 일치하도록 최종 테두리 이미지에서 <a href="mask-border-repeat">반복, 크기 조정 또는 수정</a> 됩니다.

source: Zones 5-8 are <span id="edge-regions">edge regions</span>. These are <a href="border-image-repeat">repeated, scaled, or otherwise modified</a> in the final border image to match the dimensions of the element.
es: Las zonas 5-8 son <span id="edge-regions">regiones de borde</span> . Estos se <a href="border-image-repeat">repiten, escalan o modifican de otro modo</a> en la imagen del borde final para que coincida con las dimensiones del elemento.
ko: 영역 5-8은 <span id="edge-regions">가장자리 영역</span> 입니다. 이들은 요소의 치수와 일치하도록 최종 테두리 이미지에서 <a href="border-image-repeat">반복, 크기 조정 또는 수정</a> 됩니다.

source: Zoom cursors (<code>zoom-in</code> and <code>zoom-out</code>)
es: Cursores de <code>zoom-in</code> ( acercar y <code>zoom-out</code> )
ko: 줌 커서 ( <code>zoom-in</code> 및 <code>zoom-out</code> )

source: Zoom factor. <code>100%</code> is equivalent to <code>normal</code>. Values larger than <code>100%</code> zoom in. Values smaller than <code>100%</code> zoom out.
es: Factor de zoom <code>100%</code> es equivalente a lo <code>normal</code> . Los valores superiores al <code>100%</code> se acercan. Los valores inferiores al <code>100%</code> se reducen.
ko: 줌 계수. <code>100%</code> 는 <code>normal</code> 과 같습니다 . <code>100%</code> 보다 큰 값은 확대됩니다. <code>100%</code> 보다 작은 값은 축소됩니다.

source: Zoom factor. Equivalent to the corresponding percentage (<code>1.0</code> = <code>100%</code> = <code>normal</code>). Values larger than <code>1.0</code> zoom in. Values smaller than <code>1.0</code> zoom out.
es: Factor de zoom Equivalente al porcentaje correspondiente ( <code>1.0</code> = <code>100%</code> = <code>normal</code> ). Los valores mayores que <code>1.0</code> acercan. Los valores menores que <code>1.0</code> alejan.
ko: 줌 계수. 해당 백분율과 동일합니다 ( <code>1.0</code> = <code>100%</code> = <code>normal</code> ). <code>1.0</code> 보다 큰 값은 확대합니다. <code>1.0</code> 보다 작은 값은 축소됩니다.

source: [1] As of Firefox 63, this feature is behind a feature preference setting. In about:config, set <code>layout.css.overflow.moz-scrollbars.enabled</code> to <code>true</code>
es: [1] A partir de Firefox 63, esta caracter&iacute;stica est&aacute; detr&aacute;s de una configuraci&oacute;n de preferencia de caracter&iacute;sticas. En about: config, establezca <code>layout.css.overflow.moz-scrollbars.enabled</code> en <code>true</code>
ko: [1] Firefox 63부터이 기능은 기능 환경 설정 뒤에 있습니다. about : config에서 <code>layout.css.overflow.moz-scrollbars.enabled</code> 를 <code>true</code> 로 설정하십시오.

source: a <a href="box-shadow#Interpolation">shadow list</a>
es: una <a href="box-shadow#Interpolation">lista de sombras</a>
ko: <a href="box-shadow#Interpolation">그림자 목록</a>

source: a <a href="color_value#Interpolation">color</a>
es: un <a href="color_value#Interpolation">color</a>
ko: <a href="color_value#Interpolation">색상</a>

source: a <a href="custom-ident"><code>&lt;custom-ident&gt;</code></a> naming a CSS property.
es: un <a href="custom-ident"> <code>&lt;custom-ident&gt;</code> </a> nombrando una propiedad CSS.
ko: CSS 속성의 이름을 <a href="custom-ident"> <code>&lt;custom-ident&gt;</code> </a> 하는 &lt;custom-ident&gt;

source: a <a href="filter#Interpolation">filter function list</a>
es: una <a href="filter#Interpolation">lista de funciones de filtro</a>
ko: <a href="filter#Interpolation">필터 기능 목록</a>

source: a <a href="font-stretch#Interpolation">font stretch</a>
es: un <a href="font-stretch#Interpolation">tramo de fuente</a>
ko: <a href="font-stretch#Interpolation">글꼴 스트레치</a>

source: a <a href="font-weight#Interpolation">font weight</a>
es: un <a href="font-weight#Interpolation">peso de fuente</a>
ko: <a href="font-weight#Interpolation">폰트 무게</a>

source: a <a href="http://en.wikipedia.org/wiki/Unicode">Unicode</a> character (in the format of a backslash, <code>\</code>, followed by one to six hexadecimal digits, representing its Unicode code point)
es: un car&aacute;cter <a href="http://en.wikipedia.org/wiki/Unicode">Unicode</a> (en el formato de una barra invertida, <code>\</code> , seguido de uno a seis d&iacute;gitos hexadecimales, que representan su punto de c&oacute;digo Unicode)
ko: <a href="http://en.wikipedia.org/wiki/Unicode">유니 코드</a> 문자 (백 슬래시의 형식은 <code>\</code> , 1 내지 6 개의 16 진수로, 다음의 유니 코드 코드 포인트를 나타냄)

source: a <a href="length#Interpolation">length</a>
es: una <a href="length#Interpolation">longitud</a>
ko: <a href="length#Interpolation">길이</a>

source: a <a href="length#Interpolation">length</a>, <a href="percentage#Interpolation">percentage</a> or calc();
es: una <a href="length#Interpolation">longitud</a> , <a href="percentage#Interpolation">porcentaje</a> o calc ();
ko: <a href="length#Interpolation">길이</a> , <a href="percentage#Interpolation">백분율</a> 또는 CALC ();

source: a <a href="number"><code>&lt;number&gt;</code></a> and it is interpreted as <code><a href="#&lt;'flex-grow'&gt;">&lt;flex-grow&gt;</a></code>.
ko: <a href="number"> <code>&lt;number&gt;</code> </a> 과 같이 해석됩니다 <code><a href="#&lt;'flex-grow'&gt;">&lt;flex-grow&gt;</a></code> .

source: a <a href="number"><code>&lt;number&gt;</code></a> for <code><a href="#&lt;'flex-grow'&gt;">&lt;flex-grow&gt;</a></code>.
ko: <a href="number"> <code>&lt;number&gt;</code> </a> 에 대한 <code><a href="#&lt;'flex-grow'&gt;">&lt;flex-grow&gt;</a></code> .

source: a <a href="number"><code>&lt;number&gt;</code></a> for <code><a href="#&lt;'flex-grow'&gt;">&lt;flex-shrink&gt;</a></code>.
ko: <a href="number"> <code>&lt;number&gt;</code> </a> 에 대한 <code><a href="#&lt;'flex-grow'&gt;">&lt;flex-shrink&gt;</a></code> .

source: a <a href="number"><code>&lt;number&gt;</code></a>: then it is interpreted as <code><a href="#&lt;'flex-shrink'&gt;">&lt;flex-shrink&gt;</a></code>.
ko: a <a href="number"> <code>&lt;number&gt;</code> </a> : 그러면 <code><a href="#&lt;'flex-shrink'&gt;">&lt;flex-shrink&gt;</a></code> 로 해석됩니다 .

source: a <a href="number#Interpolation">number</a>
es: un <a href="number#Interpolation">numero</a>
ko: <a href="number#Interpolation">수</a>

source: a <a href="position_value#Interpolation">position</a>
es: una <a href="position_value#Interpolation">posici&oacute;n</a>
ko: <a href="position_value#Interpolation">위치</a>

source: a <a href="shape#Interpolation">rectangle</a>
es: un <a href="shape#Interpolation">rect&aacute;ngulo</a>
ko: <a href="shape#Interpolation">직사각형</a>

source: a <a href="visibility#Interpolation">visibility</a>
es: una <a href="visibility#Interpolation">visibilidad</a>
ko: <a href="visibility#Interpolation">가시성</a>

source: a <code>&lt;number&gt;</code>: In this case it is interpreted as <code>flex: &lt;number&gt; 1 0</code>; the <code><a href="#&lt;'flex-shrink'&gt;">&lt;flex-shrink&gt;</a></code> value is assumed to be 1 and the <code><a href="#&lt;'flex-basis'&gt;">&lt;flex-basis&gt;</a></code> value is assumed to be <code>0</code>.
ko: a <code>&lt;number&gt;</code> :이 경우 <code>flex: &lt;number&gt; 1 0</code> ; <code><a href="#&lt;'flex-shrink'&gt;">&lt;flex-shrink&gt;</a></code> 값이 1과 것으로 가정 <code><a href="#&lt;'flex-basis'&gt;">&lt;flex-basis&gt;</a></code> 값으로 가정된다 <code>0</code> .

source: a <code><a href="#&lt;custom-ident&gt;">&lt;custom-ident&gt;</a></code> value
es: un <code><a href="#&lt;custom-ident&gt;">&lt;custom-ident&gt;</a></code> valor
ko: <code><a href="#&lt;custom-ident&gt;">&lt;custom-ident&gt;</a></code> 값

source: a <code><a href="#&lt;length&gt;">&lt;length&gt;</a></code>
es: una <code><a href="#&lt;length&gt;">&lt;length&gt;</a></code>
ko: <code><a href="#&lt;length&gt;">&lt;length&gt;</a></code>

source: a <code><a href="#&lt;length&gt;">&lt;length&gt;</a></code> or a <code><a href="#&lt;percentage&gt;">&lt;percentage&gt;</a></code>.
ko: <code><a href="#&lt;length&gt;">&lt;length&gt;</a></code> 또는 <code><a href="#&lt;percentage&gt;">&lt;percentage&gt;</a></code> .

source: a <code><a href="#&lt;length&gt;">&lt;length&gt;</a></code> or a <code><a href="#&lt;percentage&gt;">&lt;percentage&gt;</a></code>. This may optionally be followed by one of the following keywords: <code><a href="#border-box">border-box</a></code>, <code><a href="#content-box">content-box</a></code>.
es: una <code><a href="#&lt;length&gt;">&lt;length&gt;</a></code> o un <code><a href="#&lt;percentage&gt;">&lt;percentage&gt;</a></code> . Opcionalmente, puede seguir una de las siguientes palabras clave: <code><a href="#border-box">border-box</a></code> , <code><a href="#content-box">content-box</a></code> .
ko: <code><a href="#&lt;length&gt;">&lt;length&gt;</a></code> 또는 <code><a href="#&lt;percentage&gt;">&lt;percentage&gt;</a></code> . 선택적으로 <code><a href="#border-box">border-box</a></code> , <code><a href="#content-box">content-box</a></code> 키워드 중 하나가 올 수 있습니다 .

source: a <code><a href="#&lt;length&gt;">&lt;length&gt;</a></code>.
ko: <code><a href="#&lt;length&gt;">&lt;length&gt;</a></code> .

source: a <code><a href="#&lt;number&gt;">&lt;number&gt;</a></code>
es: un <code><a href="#&lt;number&gt;">&lt;number&gt;</a></code>
ko: <code><a href="#&lt;number&gt;">&lt;number&gt;</a></code>

source: a <code><a href="#&lt;percentage&gt;">&lt;percentage&gt;</a></code>
es: un <code><a href="#&lt;percentage&gt;">&lt;percentage&gt;</a></code>
ko: <code><a href="#&lt;percentage&gt;">&lt;percentage&gt;</a></code>

source: a <code><a href="#&lt;string&gt;">&lt;string&gt;</a></code> value
es: un valor <code><a href="#&lt;string&gt;">&lt;string&gt;</a></code>
ko: <code><a href="#&lt;string&gt;">&lt;string&gt;</a></code> 값

source: a <code><a href="#&lt;string&gt;">&lt;string&gt;</a></code>.
es: una <code><a href="#&lt;string&gt;">&lt;string&gt;</a></code> .
ko: <code><a href="#&lt;string&gt;">&lt;string&gt;</a></code> .

source: a <code><a href="#symbols()">symbols()</a></code> value
es: un valor de <code><a href="#symbols()">symbols()</a></code>
ko: <code><a href="#symbols()">symbols()</a></code> 값

source: a color plus three absolute lengths
es: un color más tres longitudes absolutas
ko: 색과 세 개의 절대 길이

source: a community-curated list of Flexbox browser bugs and workarounds
ko: 커뮤니티에서 선별 한 Flexbox 브라우저 버그 및 해결 방법 목록

source: a community-curated list of flexbox browser bugs and workarounds
es: una lista de errores del navegador flexbox y de soluciones provisionales creada por la comunidad
ko: 커뮤니티가 관리하는 flexbox 브라우저 버그 및 해결 방법 목록

source: a footer
es: un pie de página
ko: 바닥 글

source: a header
es: un encabezado
ko: 헤더

source: a hyphen (<code>-</code>),
es: un gui&oacute;n ( <code>-</code> ),
ko: 하이픈 ( <code>-</code> )

source: a list, each item consisting of two keywords representing the origin and two offsets from that origin, each given as an absolute length (if given a <a href="length"><code>&lt;length&gt;</code></a>), otherwise as a percentage
es: una lista, cada elemento que consta de dos palabras clave que representan el origen y dos compensaciones de ese origen, cada una dada como una longitud absoluta (si se le da una <a href="length"> <code>&lt;length&gt;</code> </a> ), de lo contrario como un porcentaje
ko: 각 항목은 원점을 나타내는 두 개의 키워드와 해당 원점의 두 개의 오프셋으로 구성되며, 각각의 길이는 절대 길이로 지정됩니다 ( <a href="length"> <code>&lt;length&gt;</code> </a> 가 지정된 경우) 인 경우), 그렇지 않은 경우 백분율

source: a list, each item consisting of two keywords, one per dimension
es: una lista,cada elemento consta de dos palabras clave,una por dimensión
ko: 각 항목은 차원 당 하나씩 두 개의 키워드로 구성됩니다.

source: a percentage or <code>auto</code> or the absolute length
es: un porcentaje o <code>auto</code> o la longitud absoluta
ko: 백분율 또는 <code>auto</code> 또는 절대 길이

source: Unlike the <a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/p"><code>&lt;p&gt;</code></a> element's box, Web developers cannot control the style of the two anonymous boxes. Inheritable properties take the value from the <a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/div"><code>&lt;div&gt;</code></a>'s property value, like <a href="color"><code>color</code></a> to define the color of the text, and set the others to the <code>initial</code> value. For example, they won't have a specific <a href="background-color"><code>background-color</code></a>, it is always transparent, the<code> initial</code> value for that property, and thus the background of the <code>&lt;div&gt;</code> is visible. A specific background color can be applied to the <code>&lt;p&gt;</code> box. Similarly, the two anonymous boxes always use the same color for their text.
zh_cn: 与<a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/p"> <code>&lt;p&gt;</code> </a>元素的框不同，Web开发人员无法控制两个匿名框的样式。可继承属性从<a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/div"> <code>&lt;div&gt;</code> </a>的属性值中获取值，例如<a href="color"> <code>color</code> </a>来定义文本的颜色，并将其他设置为 <code>initial</code> 值。例如，它们将没有特定的<a href="background-color"> <code>background-color</code> </a>，它始终是透明的，该属性的 <code> initial</code> 值，因此 <code>&lt;div&gt;</code> 的背景是可见的。可以将特定的背景色应用于 <code>&lt;p&gt;</code> 框。同样，两个匿名框的文本始终使用相同的颜色。

source: Unlike the <code>dir</code> attribute in HTML, the <code>direction</code> property is not inherited from table columns into table cells, since CSS inheritance follows the document tree, and table cells are inside of rows but not inside of columns.
zh_cn: 不同于 <code>dir</code> 中的HTML属性，则 <code>direction</code> 属性不会从表中的列继承到表格单元格，因为CSS继承如下文档树，和表格单元格是行内而不是里面列。

source: Until Firefox 10, handling of <code>text-overflow</code> on blocks with inline overflow on both horizontal sides was incorrect. Before Firefox 10, if only one value was specified (such as <code>text-overflow: ellipsis;</code>), text was ellipsed on both sides of the block, instead of only the end edge based on the block's text direction.
zh_cn: 在Firefox 10之前的版本中，在水平两侧都带有内联溢出的块上的 <code>text-overflow</code> 处理是不正确的。在Firefox 10之前，如果仅指定一个值（例如 <code>text-overflow: ellipsis;</code> ），则文本将在块的两侧被省略，而不是仅基于块的文本方向的末端。

source: Until Firefox 25, <code>page-break-inside</code><code>: avoid</code> did not work with the height of a block.
zh_cn: 在Firefox 25之前， <code>page-break-inside</code> <code>: avoid</code> 在一个块的高度上不起作用。

source: Until Firefox 47, SVGs without viewport were not sliced correctly (<a href="https://bugzil.la/619500">bug 619500</a>).
zh_cn: 在Firefox 47之前，未正确切片没有视口的<a href="https://bugzil.la/619500">SVG</a>（错误619500）。

source: Until Firefox 57, an issue persisted for SVGs without viewport when <a href="https://wiki.mozilla.org/Electrolysis">e10s</a> was disabled (<a href="https://bugzil.la/1290782">bug 1290782</a>).
zh_cn: 在Firefox 57之前，禁用<a href="https://bugzil.la/1290782">e10</a>时，没有视口的<a href="https://wiki.mozilla.org/Electrolysis">SVG</a>仍然存在问题（错误1290782）。

source: Until Firefox 61, flex items that are sized according to their content are sized using <a href="https://drafts.csswg.org/css-sizing-3/#column-sizing"><code>fit-content</code>, not <code>max-content</code></a>.
zh_cn: 在Firefox 61之前，将使用<a href="https://drafts.csswg.org/css-sizing-3/#column-sizing"> <code>fit-content</code> 而不是 <code>max-content</code> </a>来调整根据其内容大小调整的flex项目。

source: Until Firefox 61, flex items that are sized according to their content are sized using <a href="https://drafts.csswg.org/css-sizing-3/#column-sizing">fit-content, not max-content</a>.
zh_cn: 在Firefox 61之前，将使用<a href="https://drafts.csswg.org/css-sizing-3/#column-sizing">fit-content而不是max-content</a>来调整根据内容大小调整的flex项目。

source: Until Internet Explorer 8, <code>inline-block</code> is only for natural inline elements.
zh_cn: 在Internet Explorer 8之前， <code>inline-block</code> 仅适用于自然内联元素。

source: Until the CSSWG publishes their own draft, the specification can only be found in its <a href="https://wicg.github.io/overscroll-behavior/">WICG Github Repository</a>.
zh_cn: 在CSSWG发布自己的草案之前，只能在其<a href="https://wicg.github.io/overscroll-behavior/">WICG Github存储库中</a>找到该规范。

source: Until version 15, only decimal numbers display.
zh_cn: 在15版之前,只显示十进制数字。

source: Up to Internet Explorer 7, descendants of <code>hidden</code> elements will still be invisible even if they have <code>visibility</code> set to <code>visible</code>.
zh_cn: 在Internet Explorer 7之前，即使 <code>hidden</code> 元素的后代将可见 <code>visibility</code> 设置为 <code>visible</code> ,它们也仍然是不可见的。

source: Update to latest syntax definitions.
zh_cn: 更新为最新的语法定义。

source: Updates some properties to be independent of the directionality of the text.
zh_cn: 更新一些属性,使其与文本的方向性无关。

source: Updating existing CSS to use the <code>speech</code> media type should be as simple as replacing <code>aural</code> with <code>speech</code>.
zh_cn: 更新现有CSS以使用 <code>speech</code> 媒体类型应该就像用 <code>speech</code> 替换 <code>aural</code> 一样简单。

source: Uppercase ASCII letters
zh_cn: 大写ASCII字母

source: Uppercase roman numerals
zh_cn: 大写罗马数字

source: Usage notes
zh_cn: 使用说明

source: Usage with integers
zh_cn: 整数的用法

source: Use "regular" scrolling, where the content immediately ceases to scroll when you remove your finger from the touchscreen.
zh_cn: 使用 "常规 "滚动,当您将手指从触摸屏上移开时,内容立即停止滚动。

source: Use <a href="@supports"><code>@supports</code></a> to apply styles that depend on browser support for various CSS technologies.
zh_cn: 使用<a href="@supports"> <code>@supports</code> </a>来应用依赖于各种CSS技术的浏览器支持的样式。

source: Use <a href="clear"><code>clear</code></a> to force an item to move below a floated element.
zh_cn: 使用<a href="clear"> <code>clear</code> </a>强制项目移至浮动元素下方。

source: Use <a href="inherit"><code>inherit</code></a> to make an element's property the same as its parent.
zh_cn: 使用<a href="inherit"> <code>inherit</code> </a>使元素的属性与其父元素相同。

source: Use <a href="initial"><code>initial</code></a> to set a property to its initial value.
zh_cn: 使用<a href="initial"> <code>initial</code> </a>将属性设置为其初始值。

source: Use <a href="revert"><code>revert</code></a> to reset a property to the value established by the user-agent stylesheet (or by user styles, if any exist).
zh_cn: 使用<a href="revert"> <code>revert</code> </a>将属性重置为由用户代理样式表（或如果存在的话，由用户样式）建立的值。

source: Use <a href="unset"><code>unset</code></a> to set a property to its inherited value if it inherits, or to its initial value if not.
zh_cn: 如果未继承，请使用<a href="unset"> <code>unset</code> </a>将属性设置为其继承的值，否则将其设置为初始值。

source: Use <code><a href="overflow-x"><code>overflow-x</code></a>: hidden</code> and <code><a href="overflow-y"><code>overflow-y</code></a>: scroll</code>, or <code>overflow: scroll hidden</code> instead.
zh_cn: 请使用 <code><a href="overflow-x"><code>overflow-x</code></a>: hidden</code> 并使用 <code><a href="overflow-y"><code>overflow-y</code></a>: scroll</code> ，或使用 <code>overflow: scroll hidden</code> 。

source: Use <code><a href="overflow-x"><code>overflow-x</code></a>: scroll</code> and <code><a href="overflow-y"><code>overflow-y</code></a>: hidden</code>, or <code>overflow: hidden scroll</code> instead.
zh_cn: 请使用 <code><a href="overflow-x"><code>overflow-x</code></a>: scroll</code> 和 <code><a href="overflow-y"><code>overflow-y</code></a>: hidden</code> ，或使用 <code>overflow: hidden scroll</code> 。

source: Use <code>meter</code> instead.
zh_cn: 请改用 <code>meter</code> 。

source: Use <code>overflow: clip</code> instead.
zh_cn: 使用 <code>overflow: clip</code> 代替。

source: Use <code>overflow: hidden</code> instead.
zh_cn: 使用 <code>overflow: hidden</code> 。

source: Use <code>textarea</code> instead.
zh_cn: 请改用 <code>textarea</code> 。

source: Use JavaScript and clear the animation being used when the <code>animationiteration</code> event fires.
zh_cn: 使用JavaScript并在 <code>animationiteration</code> 事件触发时清除正在使用的动画。

source: Use a minimum value of <code>1.5</code> for <code>line-height</code> for main paragraph content. This will help people experiencing low vision conditions, as well as people with cognitive concerns such as Dyslexia. If the page is zoomed to increase the text size, using a unitless value ensures that the line height will scale proportionately.
zh_cn: 使用的最小值 <code>1.5</code> 的 <code>line-height</code> 为主要内容的段落。这将帮助经历视力低下的人以及患有阅读障碍等认知问题的人。如果缩放页面以增加文本大小，则使用无单位值可确保行高将按比例缩放。

source: Use cases for auto-placement
zh_cn: 自动投放的使用案例

source: Use cases for order
zh_cn: 订单的使用案例

source: Use in a media query
zh_cn: 在媒体查询中使用

source: Use in calc()
zh_cn: 在calc()中使用

source: Use momentum-based scrolling, where the content continues to scroll for a while after finishing the scroll gesture and removing your finger from the touchscreen. The speed and duration of the continued scrolling is proportional to how vigorous the scroll gesture was. Also creates a new stacking context.
zh_cn: 使用基于动量的滚动,即在完成滚动手势并将手指从触摸屏上移开后,内容会继续滚动一段时间。继续滚动的速度和持续时间与滚动手势的力度成正比。还可以创建一个新的堆叠上下文。

source: Use more specific rules. By indicating one or more elements before the element you're selecting, the rule becomes more specific and gets higher priority:
zh_cn: 使用更具体的规则。通过在你要选择的元素前标明一个或多个元素,规则会变得更具体,优先级也会更高。

source: Use of the <code>order</code> property has exactly the same implications for accessibility as changing the direction with <code>flex-direction</code>. Using <code>order</code> changes the order in which items are painted, and the order in which they appear visually. It does not change the sequential navigation order of the items. Therefore if a user is tabbing between the items, they could find themselves jumping around your layout in a very confusing way.
zh_cn: 使用 <code>order</code> 属性对于可访问性具有与使用 <code>flex-direction</code> 更改方向完全相同的含义。使用 <code>order</code> 更改项目的绘制顺序和外观。它不会更改项目的顺序导航顺序。因此，如果用户在项目之间切换，他们可能会发现自己以非常混乱的方式在布局中跳跃。

source: Use the <code>fill-available</code> inline size or <code>fill-available</code> block size, as appropriate to the writing mode.
zh_cn: 使用 <code>fill-available</code> 在线尺寸或 <code>fill-available</code> 块大小，以适于书写模式。

source: Use the character encoding defined by the referring document: the <code>charset</code> attribute of the <a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/link"><code>&lt;link&gt;</code></a> element. This method is obsoleted in HTML5 and must not be used.
zh_cn: 使用引用文档定义的字符编码：<a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/link"> <code>&lt;link&gt;</code> </a>元素的 <code>charset</code> 属性。此方法在HTML5中已作废，不得使用。

source: Use the default line break rule.
zh_cn: 使用默认的换行规则。

source: Use this <strong>CSS reference</strong> to browse an <a href="#Keyword_index">alphabetical index</a> of all of the standard <a href="https://developer.mozilla.org/en-US/docs/Web/CSS">CSS</a> properties, <a href="pseudo-classes">pseudo-classes</a>, <a href="pseudo-elements">pseudo-elements</a>, <a href="css_types">data types</a>, <a href="css_functionals">functional notations</a> and <a href="at-rule">at-rules</a>. You can also browse <a href="#Concepts">key CSS concepts</a> and a list of <a href="#Selectors">selectors organized by type</a>. Also included is a brief <a href="#DOM-CSS_CSSOM">DOM-CSS / CSSOM reference</a>.
zh_cn: 使用此<strong>CSS参考</strong>来浏览所有标准<a href="https://developer.mozilla.org/en-US/docs/Web/CSS">CSS</a>属性，<a href="pseudo-classes">伪类</a>，<a href="pseudo-elements">伪元素</a>，<a href="css_types">数据类型</a>，<a href="css_functionals">功能符号</a>和<a href="at-rule">规则</a>的<a href="#Keyword_index">字母索引</a>。您还可以浏览<a href="#Concepts">CSS的关键概念</a>以及<a href="#Selectors">按type</a>排列的选择器列表。还包括一个简短的<a href="#DOM-CSS_CSSOM">DOM-CSS / CSSOM参考</a>。
