Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/css/css.*.017.xlf
Languages: es, ko, zh_cn

source: We have already seen how the <code>fr</code> unit works to assign a proportion of available space in the grid container to our grid tracks. The <code>fr</code> unit, when combined with the <a href="https://developer.mozilla.org/en-US/docs/Web/CSS/minmax"><code>minmax()</code></a> function can give us very similar behavior to the <code>flex</code> properties in flexbox while still enabling the creation of a layout in two dimensions.
es: Ya hemos visto c&oacute;mo funciona la unidad <code>fr</code> para asignar una proporci&oacute;n de espacio disponible en el contenedor de cuadr&iacute;cula a nuestras pistas de cuadr&iacute;cula. La unidad <code>fr</code> , cuando se combina con la funci&oacute;n <a href="https://developer.mozilla.org/en-US/docs/Web/CSS/minmax"> <code>minmax()</code> </a> , puede darnos un comportamiento muy similar a las propiedades de <code>flex</code> en flexbox mientras permite la creaci&oacute;n de un dise&ntilde;o en dos dimensiones.
ko: 우리는 <code>fr</code> 컨테이너가 그리드 컨테이너에서 사용 가능한 공간의 비율을 그리드 트랙에 할당하는 방법을 이미 보았습니다 . <code>fr</code> 부는 함께 결합 될 때 <a href="https://developer.mozilla.org/en-US/docs/Web/CSS/minmax"> <code>minmax()</code> </a> 함수는 우리에게 매우 유사한 동작을 제공 할 수 <code>flex</code> 여전히 두 차원 레이아웃의 생성을 가능하게하는 동안의 특성 인 flexbox.
zh_cn: 我们已经了解了 <code>fr</code> 单元如何将网格容器中的一部分可用空间分配给网格轨迹。当与<a href="https://developer.mozilla.org/en-US/docs/Web/CSS/minmax"> <code>minmax()</code> </a>函数结合使用时， <code>fr</code> 单位可以为我们提供与flexbox中的 <code>flex</code> 属性非常相似的行为，同时仍然可以在二维中创建布局。

source: We have completely filled our grid with areas in this example, leaving no white space. However you can leave grid cells empty with this method of layout. To leave a cell empty use the full stop character, '<code>.</code>'. If I want to only display the footer directly under the main content I would need to leave the three cells underneath the sidebar empty.
es: En este ejemplo, hemos llenado completamente nuestra cuadr&iacute;cula con &aacute;reas, sin dejar espacios en blanco. Sin embargo, puede dejar celdas de cuadr&iacute;cula vac&iacute;as con este m&eacute;todo de dise&ntilde;o. Para dejar una celda vac&iacute;a, use el car&aacute;cter de punto final, ' <code>.</code> '. Si solo quiero mostrar el pie de p&aacute;gina directamente debajo del contenido principal, necesitar&iacute;a dejar las tres celdas debajo de la barra lateral vac&iacute;as.
ko: 이 예에서는 그리드를 영역으로 완전히 채웠으며 공백은 남기지 않았습니다. 그러나이 레이아웃 방법으로 그리드 셀을 비워 둘 수 있습니다. 셀을 비워 두려면 완전 정지 문자 '를 사용하십시오 <code>.</code> '. 기본 내용 바로 아래에 바닥 글 만 표시하려면 세로 막대 아래에있는 세 개의 셀을 비워 두어야합니다.
zh_cn: 在此示例中，我们用区域完全填充了网格，不留空白。但是，您可以使用这种布局方法将网格单元留空。要将单元格留空，请使用句号' <code>.</code> '。如果我只想直接在主要内容下显示页脚，则需要将侧边栏下方的三个单元格留空。

source: We have negative free space when the natural size of the items adds up to larger than the available space in the flex container. If I have a 500 pixel-wide container like the one above, but the three flex items are each 200 pixels wide, the total space I need will be 600 pixels, so I have 100 pixels of negative free space. This could be removed from the items in order to make them fit the container.
es: Tenemos un espacio libre negativo cuando el tamaño natural de los artículos es mayor que el espacio disponible en el contenedor flexible.Si tengo un contenedor de 500 píxeles de ancho como el de arriba,pero los tres artículos flex son cada uno de 200 píxeles de ancho,el espacio total que necesito será de 600 píxeles,así que tengo 100 píxeles de espacio libre negativo.Esto podría ser eliminado de los artículos para que encajen en el contenedor.
ko: 항목의 자연 크기가 플렉스 컨테이너에서 사용 가능한 공간보다 더 커지면 음의 여유 공간이 있습니다. 위와 같은 500 픽셀 너비의 컨테이너가 있지만 세 개의 플렉스 항목의 너비가 각각 200 픽셀 인 경우 필요한 총 공간은 600 픽셀이므로 100 픽셀의 네거티브 여유 공간이 있습니다. 용기에 맞게 물품을 제거 할 수 있습니다.
zh_cn: 当项目的自然尺寸加起来大于弹性容器的可用空间时,我们就有了负的可用空间。如果我有一个500像素宽的容器,如上图所示,但三个弹性项的宽度各为200像素,我需要的总空间为600像素,所以我有100像素的负自由空间。这可以从项目中删除,以使它们适合容器。

source: We have quite a lot of code here to position each item. It should come as no surprise to know there is a <a href="https://developer.mozilla.org/en-US/docs/Glossary/shorthand_properties">shorthand</a>. The <a href="../grid-column-start"><code>grid-column-start</code></a> and <a href="../grid-column-end"><code>grid-column-end</code></a> properties can be combined into <a href="../grid-column"><code>grid-column</code></a>, <a href="../grid-row-start"><code>grid-row-start</code></a> and <a href="../grid-row-end"><code>grid-row-end</code></a> into <a href="../grid-row"><code>grid-row</code></a>.
es: Tenemos bastante c&oacute;digo aqu&iacute; para colocar cada elemento. No deber&iacute;a sorprendernos saber que hay una <a href="https://developer.mozilla.org/en-US/docs/Glossary/shorthand_properties">taquigraf&iacute;a</a> . Las propiedades <a href="../grid-column-start"> <code>grid-column-start</code> </a> y <a href="../grid-column-end"> <code>grid-column-end</code> </a> pueden combinarse en <a href="../grid-column"> <code>grid-column</code> </a> , <a href="../grid-row-start"> <code>grid-row-start</code> </a> y <a href="../grid-row-end"> <code>grid-row-end</code> </a> en <a href="../grid-row"> <code>grid-row</code> </a> .
ko: 여기에는 각 항목을 배치하기위한 많은 코드가 있습니다. <a href="https://developer.mozilla.org/en-US/docs/Glossary/shorthand_properties">속기</a> 가 있음을 아는 것은 놀라운 일이 아닙니다 . <a href="../grid-column-start"> <code>grid-column-start</code> </a> 및 <a href="../grid-column-end"> <code>grid-column-end</code> </a> 성질에 결합 될 수 <a href="../grid-column"> <code>grid-column</code> </a> , <a href="../grid-row-start"> <code>grid-row-start</code> </a> 및 <a href="../grid-row-end"> <code>grid-row-end</code> </a> 에 <a href="../grid-row"> <code>grid-row</code> </a> .
zh_cn: 我们这里有很多代码可以放置每个项目。知道有<a href="https://developer.mozilla.org/en-US/docs/Glossary/shorthand_properties">速记</a>不足为奇。可以将<a href="../grid-column-start"> <code>grid-column-start</code> </a>和<a href="../grid-column-end"> <code>grid-column-end</code> </a>属性组合为<a href="../grid-column"> <code>grid-column</code> </a>，<a href="../grid-row-start"> <code>grid-row-start</code> </a>和<a href="../grid-row-end"> <code>grid-row-end</code> 组合</a>为<a href="../grid-row"> <code>grid-row</code> </a>。

source: We have seen how named lines create a named area, and this also works in reverse. Named template areas create named lines that you can use to place your items. If we take the layout created in the guide to Grid Template Areas, we can use the lines created by our areas to see how this works.
es: Hemos visto cómo las líneas con nombre crean un área con nombre,y esto también funciona a la inversa.Las áreas de plantilla con nombre crean líneas con nombre que puedes usar para colocar tus artículos.Si tomamos el diseño creado en la guía de Áreas de Plantilla de Cuadrícula,podemos usar las líneas creadas por nuestras áreas para ver cómo funciona esto.
ko: 우리는 명명 된 선이 명명 된 영역을 만드는 방법을 보았으며, 이는 반대로 작동합니다. 명명 된 템플릿 영역은 항목을 배치하는 데 사용할 수있는 명명 된 선을 만듭니다. 그리드 템플릿 영역 가이드에서 만든 레이아웃을 가져 오면 해당 영역에서 만든 선을 사용하여 이것이 어떻게 작동하는지 확인할 수 있습니다.
zh_cn: 我们已经看到了命名线是如何创建命名区域的,这也是反过来的。命名的模板区域创建了命名的线条,您可以使用这些线条来放置您的项目。如果我们把在网格模板区域指南中创建的布局,我们可以使用我们的区域创建的线条来看看这是如何工作的。

source: We have told it by way of the <code>contain</code> property that each article is independent.
ko: <code>contain</code> 속성을 통해 각 기사가 독립적 이라고 말했습니다 .
zh_cn: 我们通过 <code>contain</code> 属性的方式告诉它，每篇文章都是独立的。

source: We have typically used <a href="https://developer.mozilla.org/en-US/docs/Learn/CSS/CSS_layout/Floats">floats</a> to create multiple column layouts. If you have floated an item, which is also a grid item in a supporting browser, the float will no longer apply to the item. The fact is that <em>a grid item takes precedence.</em> In the example below, I have a simple media object. In a non-supporting browser, I use <a href="../float"><code>float</code></a>, however I have also defined the container as a grid container, in order to use the alignment properties that are implemented in CSS Grids.
es: Por lo general, hemos utilizado <a href="https://developer.mozilla.org/en-US/docs/Learn/CSS/CSS_layout/Floats">flotantes</a> para crear dise&ntilde;os de columnas m&uacute;ltiples. Si ha colocado un elemento flotante, que tambi&eacute;n es un elemento de cuadr&iacute;cula en un navegador compatible, el elemento flotante ya no se aplicar&aacute; al elemento. El hecho es que <em>un elemento de cuadr&iacute;cula tiene prioridad. </em>En el siguiente ejemplo, tengo un objeto multimedia simple. En un navegador no compatible, uso <a href="../float"> <code>float</code> </a> , sin embargo, tambi&eacute;n he definido el contenedor como un contenedor de cuadr&iacute;cula, para poder usar las propiedades de alineaci&oacute;n que se implementan en las cuadr&iacute;culas CSS.
ko: 우리는 일반적으로 <a href="https://developer.mozilla.org/en-US/docs/Learn/CSS/CSS_layout/Floats">float</a> 를 사용하여 여러 열 레이아웃을 만들었습니다. 지원 브라우저에서 그리드 항목 인 항목을 부동 한 경우 부동은 더 이상 항목에 적용되지 않습니다. 사실 <em>그리드 항목이 우선합니다. </em>아래 예제에는 간단한 미디어 개체가 있습니다. 지원되지 않는 브라우저에서는 <a href="../float"> <code>float</code> 을</a> 사용 하지만 CSS 그리드에 구현 된 정렬 속성을 사용하기 위해 컨테이너를 그리드 컨테이너로 정의했습니다.
zh_cn: 我们通常使用<a href="https://developer.mozilla.org/en-US/docs/Learn/CSS/CSS_layout/Floats">浮点数</a>创建多个列布局。如果浮动了某个项目（在支持的浏览器中也是网格项目），则浮动将不再适用于该项目。事实是，<em>网格项具有优先权。</em>在下面的示例中，我有一个简单的媒体对象。在不支持的浏览器中，我使用<a href="../float"> <code>float</code> </a>，但是我也将容器定义为网格容器，以便使用在CSS Grids中实现的对齐属性。

source: We might want to be able to display our box with the image the other way around. To do this, we redefine the grid to put the <code>1fr</code> track last, and simply flip the values in <a href="../grid-template-areas"><code>grid-template-areas</code></a>.
es: Es posible que queramos mostrar nuestra caja con la imagen al rev&eacute;s. Para hacer esto, redefinimos la cuadr&iacute;cula para colocar la pista <code>1fr</code> en &uacute;ltimo lugar, y simplemente volteamos los valores en <a href="../grid-template-areas"> <code>grid-template-areas</code> </a> .
ko: 다른 방법으로 이미지와 함께 상자를 표시하고 싶을 수도 있습니다. 이를 위해 그리드를 재정 의하여 <code>1fr</code> 트랙을 마지막에 배치하고 값을 <a href="../grid-template-areas"> <code>grid-template-areas</code> </a> 에서 뒤집습니다 .
zh_cn: 我们可能希望能够以其他方式显示带有图像的框。为此，我们重新定义网格以将 <code>1fr</code> 轨道放在最后，然后简单地翻转<a href="../grid-template-areas"> <code>grid-template-areas</code> 中</a>的值。

source: We now have the ability to create a grid with a flexible number of flexible tracks, but see items laid out on the grid aligned by rows and columns at the same time.
es: Ahora tenemos la posibilidad de crear una cuadrícula con un número flexible de pistas flexibles,pero ver los elementos dispuestos en la cuadrícula alineados por filas y columnas al mismo tiempo.
ko: 이제 유연한 트랙 수로 그리드를 만들 수 있지만 동시에 행과 열로 정렬 된 그리드에 배치 된 항목을 볼 수 있습니다.
zh_cn: 我们现在能够创建一个具有灵活数量的灵活轨道的网格,但同时看到在网格上按行和列排列的项目。

source: We see this pattern everywhere, used for comments, and anywhere we need to display images and descriptions. With flexbox we can allow the part of the media object containing the image to take its sizing information from the image, and then the body of the media object flexes to take up the remaining space.
es: Vemos este patrón en todas partes,usado para los comentarios,y en cualquier lugar donde necesitemos mostrar imágenes y descripciones.Con el flexbox podemos permitir que la parte del objeto multimedia que contiene la imagen tome su información de tamaño de la imagen,y luego el cuerpo del objeto multimedia se flexiona para ocupar el espacio restante.
ko: 이 패턴은 어디에서나 주석에 사용되며 이미지와 설명을 표시해야하는 모든 곳에서 볼 수 있습니다. flexbox를 사용하면 이미지를 포함하는 미디어 객체의 일부가 이미지에서 사이징 정보를 가져온 다음 미디어 객체의 본문이 구부러져 남은 공간을 차지할 수 있습니다.
zh_cn: 我们随处可见这种模式,用于注释,以及任何需要显示图片和描述的地方。通过flexbox,我们可以让包含图片的媒体对象的部分从图片中获取其尺寸信息,然后媒体对象的主体弯曲,以占据剩余的空间。

source: We set the <code>&lt;span&gt;</code>s to <code>position: relative</code> so that we can position the generated content relative to them. We then absolutely position different generated content depending on whether the form's data is valid or invalid &mdash; a green check or a red cross, respectively. To add a bit of extra urgency to the invalid data, we've also given the inputs a thick red border when invalid.
ko: 우리는 설정 <code>&lt;span&gt;</code> 에이야 <code>position: relative</code> 그래서 우리가 그들에게 생성 된 컨텐츠 상대를 배치 할 수있다. 그런 다음 양식의 데이터가 유효한지 유효하지 않은지 (각각 녹색 확인 또는 적십자)에 따라 생성 된 다른 콘텐츠를 절대적으로 배치합니다. 유효하지 않은 데이터에 약간의 긴급 성을 추가하기 위해 유효하지 않은 경우 입력에 두꺼운 빨간색 테두리를 지정했습니다.
zh_cn: 我们将 <code>&lt;span&gt;</code> 设置为 <code>position: relative</code> 这样我们就可以相对于它们定位生成的内容。然后，我们根据表单数据是有效还是无效来绝对定位不同的生成内容-分别为绿色对勾或红色十字。为了给无效数据增加一些额外的紧急性，我们还为输入提供了无效时的粗红色边框。

source: We start mobile first, and all we want for the narrowest screens is for the items to remain in source order, and all span right across the grid.
es: Empezamos primero con el móvil,y todo lo que queremos para las pantallas más estrechas es que los objetos permanezcan en el orden de origen,y que se extiendan a lo largo de la cuadrícula.
ko: 모바일을 먼저 시작하고 가장 좁은 화면에서 원하는 것은 항목이 소스 순서대로 유지되고 그리드 전체에 걸쳐있는 것입니다.
zh_cn: 我们先从移动端入手,对于最窄的屏幕来说,我们希望的是项目保持源码顺序,并且都能直接跨过网格。

source: We start with creating the CSS for the animation. This animation will last for 3 seconds, be called &ldquo;slidein&rdquo;, repeat 3 times, and alternate direction each time. In the <a href="../@keyframes"><code>@keyframes</code></a>, the width and margin-left are manipulated to make the element slide across the screen.
es: Comenzamos con la creaci&oacute;n de CSS para la animaci&oacute;n. Esta animaci&oacute;n durar&aacute; 3 segundos, se llamar&aacute; "slidein", se repetir&aacute; 3 veces y se alternar&aacute; la direcci&oacute;n cada vez. En <a href="../@keyframes"> <code>@keyframes</code> </a> , el ancho y el margen izquierdo se manipulan para hacer que el elemento se deslice por la pantalla.
ko: 우리는 애니메이션을위한 CSS를 만드는 것으로 시작합니다. 이 애니메이션은 3 초 동안 지속되며, "슬라이드 인"이라고하며, 3 번 반복되며 매번 다른 방향으로 바뀝니다. 에서 <a href="../@keyframes"> <code>@keyframes</code> </a> , 폭과 여백에서 왼쪽으로 화면을 가로 질러 요소 슬라이드를 만들기 위해 조작된다.
zh_cn: 我们从为动画创建CSS开始。该动画将持续3秒钟，称为&ldquo; slidein&rdquo;，重复3次，并每次改变方向。在<a href="../@keyframes"> <code>@keyframes</code> 中</a>，对width和left-margin进行操作以使元素在屏幕上滑动。

source: We take a deeper look at creating shapes from images in the <a href="shapes_from_images">Shapes from Images</a> guide.
es: Echamos un vistazo m&aacute;s profundo a la creaci&oacute;n de formas a partir de im&aacute;genes en la gu&iacute;a <a href="shapes_from_images">Formas a partir de im&aacute;genes</a> .
ko: 이미지에서 <a href="shapes_from_images">모양</a> 가이드의 이미지에서 모양을 만드는 방법을 자세히 살펴 봅니다 .
zh_cn: 在&ldquo;图像中的<a href="shapes_from_images">形状&rdquo;</a>指南中，我们将更深入地研究如何从图像中创建形状。

source: We will also discover how auto margins can be used for alignment in flexbox.
es: También descubriremos cómo se pueden usar los márgenes automáticos para la alineación en la caja flexible.
ko: 또한 flexbox에서 자동 여백을 사용하여 정렬하는 방법에 대해서도 알아 봅니다.
zh_cn: 我们还将发现如何在flexbox中使用自动边距进行对齐。

source: We will be exploring line based placement in full detail in a later article. The following example demonstrates doing this in a simple way. When placing an item, we target the line &ndash; rather than the track.
es: Exploraremos la ubicaci&oacute;n basada en l&iacute;neas con todo detalle en un art&iacute;culo posterior. El siguiente ejemplo demuestra hacer esto de una manera simple. Al colocar un elemento, apuntamos a la l&iacute;nea, en lugar de a la pista.
ko: 이후 기사에서 라인 기반 배치에 대해 자세히 살펴볼 것입니다. 다음 예제는이를 간단한 방법으로 보여줍니다. 아이템을 배치 할 때 트랙이 아닌 라인을 대상으로합니다.
zh_cn: 在后面的文章中，我们将详细探讨基于行的放置。下面的示例演示了一种简单的方法。放置物品时，我们将目标对准线而不是轨道。

source: We will revisit the other functionality offered by this shorthand later in these guides when we take a look at auto placement and the grid-auto-flow property.
es: Volveremos a revisar la otra funcionalidad ofrecida por esta taquigrafía más adelante en estas guías cuando echemos un vistazo a la autocolocación y a la propiedad de flujo automático de la cuadrícula.
ko: 자동 배치 및 grid-auto-flow 속성을 살펴볼 때이 안내서의 뒷부분에서이 속기에서 제공하는 다른 기능을 다시 살펴 보겠습니다.
zh_cn: 我们将在稍后的这些指南中重新审视这个速记提供的其他功能,当我们查看自动放置和网格-自动流属性时。

source: We will take a brief look at these properties in this overview, and you can gain a fuller understanding in the guide <a href="controlling_ratios_of_flex_items_along_the_main_ax">Controlling Ratios of Flex Items on the Main Axis</a>.
es: Analizaremos brevemente estas propiedades en esta descripci&oacute;n general, y puede obtener una comprensi&oacute;n m&aacute;s completa en la gu&iacute;a <a href="controlling_ratios_of_flex_items_along_the_main_ax">Controlar las proporciones de los elementos flexibles en el eje principal</a> .
ko: 이 개요에서 이러한 속성을 간략하게 살펴보면 <a href="controlling_ratios_of_flex_items_along_the_main_ax">Main Axis에서 Flex 항목의 비율 제어</a> 가이드를 자세히 이해할 수 있습니다 .
zh_cn: 在本概述中，我们将简要介绍这些属性，您可以在<a href="controlling_ratios_of_flex_items_along_the_main_ax">控制主轴上的弹性项目的比率</a>指南中获得更全面的了解。

source: We would like to provide finer grained control (than just <code>auto</code> and <code>none</code>) in HTML for which parts of an element will cause it to "catch" mouse events, and when. To help us in deciding how <code>pointer-events</code> should be further extended for HTML, if you have any particular things that you would like to be able to do with this property, then please add them to the Use Cases section of <a href="https://wiki.mozilla.org/SVG:pointer-events">this wiki page</a> (don't worry about keeping it tidy).
es: Nos gustar&iacute;a proporcionar un control m&aacute;s fino (que solo <code>auto</code> m&aacute;tico y <code>none</code> ) en HTML para qu&eacute; partes de un elemento har&aacute;n que "atrape" los eventos del mouse y cu&aacute;ndo. Para ayudarnos a decidir c&oacute;mo <code>pointer-events</code> deben extenderse a&uacute;n m&aacute;s para HTML, si tiene algo en particular que le gustar&iacute;a poder hacer con esta propiedad, agr&eacute;guelos a la secci&oacute;n Casos de uso de <a href="https://wiki.mozilla.org/SVG:pointer-events">esta p&aacute;gina wiki</a> (don No te preocupes por mantenerlo ordenado).
ko: 우리는 요소의 어느 부분이 마우스 이벤트를 "포획"하게하는 HTML에서 <code>auto</code> 및 <code>none</code> 보다 세밀한 제어를 제공하려고합니다 . 방법을 결정하는 우리를 돕기 위해 <code>pointer-events</code> 더 당신이 부동산으로 할 수 있도록하고 싶습니다 것을 특별한 일이있는 경우, 다음의 사용 사례 섹션에 추가하십시오, HTML 연장해야 <a href="https://wiki.mozilla.org/SVG:pointer-events">이 위키 페이지</a> (돈 깔끔하게 유지하는 것에 대해 걱정하지 마십시오).
zh_cn: 我们希望在HTML中提供更细粒度的控件（不仅仅是 <code>auto</code> 和 <code>none</code> ），因为元素的哪些部分会导致元素&ldquo;捕获&rdquo;鼠标事件以及何时触发。为了帮助我们确定如何进一步扩展HTML的 <code>pointer-events</code> ，如果您希望对此属性进行任何特殊处理，请将其添加<a href="https://wiki.mozilla.org/SVG:pointer-events">到此Wiki页面</a>的&ldquo;用例&rdquo;部分（不要不必担心保持整洁）。

source: We would like to provide finer grained control (than just <code>auto</code> and <code>none</code>) in HTML for which parts of an element will cause it to "catch" pointer events, and when. To help us in deciding how <code>pointer-events</code> should be further extended for HTML, if you have any particular things that you would like to be able to do with this property, then please add them to the Use Cases section of <a href="https://wiki.mozilla.org/SVG:pointer-events">this wiki page</a> (don't worry about keeping it tidy).
ko: 우리는 요소의 일부가 포인터 이벤트를 "캐치"하게 만드는 HTML에서 보다 세밀한 제어 ( <code>auto</code> 및 <code>none</code> 보다)를 제공하고 싶습니다 . HTML에 대해 <code>pointer-events</code> 를 추가로 확장 하는 방법을 결정하는 데 도움 이되도록이 속성으로 수행 할 수있는 특정 작업 <a href="https://wiki.mozilla.org/SVG:pointer-events">이있는 경우이 위키 페이지</a> 의 사용 사례 섹션에 추가 하십시오 (don 깔끔하게 유지하는 것에 대해 걱정하지 마십시오).
zh_cn: 我们想在HTML中提供更细粒度的控件（不仅仅是 <code>auto</code> 和 <code>none</code> ），因为元素的哪些部分会导致元素&ldquo;捕获&rdquo;指针事件以及何时。为了帮助我们确定如何进一步扩展HTML的 <code>pointer-events</code> ，如果您希望对此属性进行任何特殊处理，请将其添加<a href="https://wiki.mozilla.org/SVG:pointer-events">到此Wiki页面</a>的&ldquo;用例&rdquo;部分（不要不必担心保持整洁）。

source: We&rsquo;ll use JavaScript code to listen for all three possible animation events. This code configures our event listeners; we call it when the document is first loaded in order to set things up.
es: Usaremos el c&oacute;digo JavaScript para escuchar los tres posibles eventos de animaci&oacute;n. Este c&oacute;digo configura nuestros oyentes de eventos; lo llamamos cuando el documento se carga por primera vez para configurar las cosas.
ko: JavaScript 코드를 사용하여 가능한 세 가지 애니메이션 이벤트를 모두 듣습니다. 이 코드는 이벤트 리스너를 구성합니다. 설정을 위해 문서가 처음로드 될 때 호출합니다.
zh_cn: 我们将使用JavaScript代码来侦听所有三个可能的动画事件。这段代码配置了我们的事件监听器。我们在首次加载文档时将其命名以进行设置。

source: We&rsquo;ve already seen in these guides that grid gives us power to re-order the content of our page in various ways. We can use the <a href="../order"><code>order</code></a> property, which will change how items auto-place. We can use <code>grid-auto-flow: dense</code> which will take items visually out of DOM order. We can also position items using line-based placement of grid template areas, without considering their location in the source.
es: Ya hemos visto en estas gu&iacute;as que la cuadr&iacute;cula nos da el poder de reordenar el contenido de nuestra p&aacute;gina de varias maneras. Podemos usar la propiedad de <a href="../order"> <code>order</code> </a> , que cambiar&aacute; la forma en que los art&iacute;culos se colocan autom&aacute;ticamente. Podemos usar <code>grid-auto-flow: dense</code> que sacar&aacute; los elementos visualmente del orden DOM. Tambi&eacute;n podemos colocar elementos mediante la colocaci&oacute;n basada en l&iacute;neas de &aacute;reas de plantilla de cuadr&iacute;cula, sin considerar su ubicaci&oacute;n en el origen.
ko: 우리는이 안내서에서 그리드가 페이지의 내용을 다양한 방식으로 재정렬 할 수있는 힘을 제공한다는 것을 이미 알고 있습니다. <a href="../order"> <code>order</code> </a> 속성을 사용하면 항목이 자동 배치되는 방식이 변경됩니다. 우리는 항목을 시각적으로 DOM 순서에서 벗어나게 하는 <code>grid-auto-flow: dense</code> 를 사용할 수 있습니다. 또한 소스에서의 위치를 ​​고려하지 않고 그리드 템플릿 영역의 선 기반 배치를 사용하여 항목을 배치 할 수도 있습니다.
zh_cn: 我们已经在这些指南中看到，网格使我们能够以各种方式对页面内容进行重新排序。我们可以使用<a href="../order"> <code>order</code> </a>属性，它将更改项目的自动放置方式。我们可以使用 <code>grid-auto-flow: dense</code> ，它将使项目在视觉上脱离DOM顺序。我们还可以使用基于行的网格模板区域放置来定位项目，而无需考虑它们在源中的位置。

source: We'll apply it to this HTML:
es: Lo aplicaremos a este HTML:
ko: 이 HTML에 적용하겠습니다 :
zh_cn: 我们将把它应用到这个HTML中。

source: We'll modify the sliding text example to output some information about each animation event when it occurs, so we can get a look at how they work.
es: Modificaremos el ejemplo de texto deslizante para obtener información sobre cada evento de animación cuando ocurra,para poder ver cómo funcionan.
ko: 슬라이딩 텍스트 예제를 수정하여 각 애니메이션 이벤트가 발생할 때 각각의 정보를 출력하여 작동 방식을 확인할 수 있습니다.
zh_cn: 我们将修改滑动文本示例,当每个动画事件发生时,输出一些信息,这样我们就可以了解它们的工作原理。

source: We'll start by introducing linear gradients, then introduce features that are supported in all gradient types using linear gradients as the example, then move on to radial, conic and repeating gradients
ko: 선형 그래디언트를 도입 한 다음 선형 그래디언트를 예로 사용하여 모든 그래디언트 유형에서 지원되는 기능을 소개 한 다음 방사형, 원추형 및 반복 그래디언트로 이동합니다.
zh_cn: 我们先介绍线性梯度,然后以线性梯度为例,介绍所有梯度类型都支持的特性,然后再介绍径向、圆锥和重复梯度。

source: We've included <a href="padding"><code>padding</code></a> and <a href="background-color"><code>background-color</code></a> on the containers and their children, so that it is easier to see the effect the display values are having.
ko: 우리는 포함 시켰습니다 <a href="padding"> <code>padding</code> </a> 과 <a href="background-color"> <code>background-color</code> </a> 은 표시 값이 발생하는 효과를 볼하는 것이 더 쉽습니다 그래서, 용기와 자녀에 있습니다.
zh_cn: 我们在容器及其子容器中添加了<a href="padding"> <code>padding</code> </a>和<a href="background-color"> <code>background-color</code> </a>，以便更轻松地查看显示值的效果。

source: We've included a custom property in the selector block defining a boxColor. Custom properties are accessible to the PaintWorklet.
ko: boxColor를 정의하는 선택기 블록에 사용자 지정 속성을 포함했습니다. 사용자 지정 속성은 PaintWorklet에 액세스 할 수 있습니다.
zh_cn: 我们在选择器块中加入了一个自定义属性,定义了一个boxColor。自定义属性可以被PaintWorklet访问。
