Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/css/css.*.017.xlf
Languages: es, ko, zh_cn

source: When zoomed in, both FIrefox and Chrome report the new CSS pixel size for <code>innerWidth</code> and <code>clientWidth</code>. The values returned for the <code>outerWidth</code> and <code>outerHeight</code> depend on the browser: Firefox reports the new value in CSS pixels, but Chrome returns the length in the default pixel size. When zoomed in you may get:
es: Cuando se acerca, tanto FIrefox como Chrome informan el nuevo tama&ntilde;o de p&iacute;xel CSS para <code>innerWidth</code> y <code>clientWidth</code> . Los valores que se devuelven para el <code>outerWidth</code> y <code>outerHeight</code> dependen del navegador: Firefox informa el nuevo valor en p&iacute;xeles CSS, pero Chrome devuelve la longitud en el tama&ntilde;o de p&iacute;xel predeterminado. Cuando se acerca puede obtener:
ko: 확대하면 FIrefox와 Chrome은 <code>innerWidth</code> 및 <code>clientWidth</code> 에 대한 새로운 CSS 픽셀 크기를보고합니다 . <code>outerWidth</code> 및 <code>outerHeight</code> 에 대해 반환되는 값 은 브라우저에 따라 다릅니다. Firefox는 CSS 픽셀로 새 값을보고하지만 Chrome은 기본 픽셀 크기로 길이를 반환합니다. 확대하면 다음을 얻을 수 있습니다.
zh_cn: 放大后，FIrefox和Chrome都会报告 <code>innerWidth</code> 和 <code>clientWidth</code> 的新CSS像素大小。返回的 <code>outerWidth</code> 和 <code>outerHeight</code> 取决于浏览器：Firefox以CSS像素报告新值，但Chrome以默认像素大小返回长度。放大时，您可能会得到：

source: Whenever possible, Web authors should instead use the <a href="font-variant"><code>font-variant</code></a> shorthand property or an associated longhand property such as <a href="font-variant-ligatures"><code>font-variant-ligatures</code></a>, <a href="font-variant-caps"><code>font-variant-caps</code></a>, <a href="font-variant-east-asian"><code>font-variant-east-asian</code></a>, <a href="font-variant-alternates"><code>font-variant-alternates</code></a>, <a href="font-variant-numeric"><code>font-variant-numeric</code></a> or <a href="font-variant-position"><code>font-variant-position</code></a>.
ko: 가능할 때마다 웹 작성자는 <a href="font-variant"> <code>font-variant</code> </a> 속기 속성 또는 <a href="font-variant-ligatures"> <code>font-variant-ligatures</code> </a> , <a href="font-variant-caps"> <code>font-variant-caps</code> </a> , <a href="font-variant-east-asian"> <code>font-variant-east-asian</code> </a> , <a href="font-variant-alternates"> <code>font-variant-alternates</code> </a> , <a href="font-variant-numeric"> <code>font-variant-numeric</code> </a> 와 같은 관련 긴 속성을 대신 사용해야합니다. -숫자 또는 <a href="font-variant-position"> <code>font-variant-position</code> </a> .
zh_cn: Web作者应尽可能使用<a href="font-variant"> <code>font-variant</code> </a>速记属性或相关的longhand属性，例如<a href="font-variant-ligatures"> <code>font-variant-ligatures</code> </a>，<a href="font-variant-caps"> <code>font-variant-caps</code> </a>，<a href="font-variant-east-asian"> <code>font-variant-east-asian</code> </a>，<a href="font-variant-alternates"> <code>font-variant-alternates</code> </a>，<a href="font-variant-numeric"> <code>font-variant-numeric</code> </a>或<a href="font-variant-position"> <code>font-variant-position</code> </a>。

source: Where a <code>&lt;frequency-percentage&gt;</code> is specified as an allowable type, this means that the percentage resolves to a frequency and therefore can be used in a <code><a href="calc">calc()</a></code> expression.
ko: 여기서 <code>&lt;frequency-percentage&gt;</code> 허용 가능한 형태로 지정하고, 비율 해결하는 주파수에 따라서는 (A)에 사용될 수 있음이 수단 <code><a href="calc">calc()</a></code> 식.
zh_cn: 将 <code>&lt;frequency-percentage&gt;</code> 指定为允许的类型时，这意味着该百分比解析为频率，因此可以在 <code><a href="calc">calc()</a></code> 表达式中使用。

source: Where a <code>&lt;length-percentage&gt;</code> is specified as an allowable type, this means that the percentage resolves to a length and therefore can be used in a <a href="https://developer.mozilla.org/en-US/docs/Web/CSS/calc"><code>calc()</code></a> expression. Therefore, all of the following values are acceptable for <a href="width"><code>width</code></a>:
ko: 여기서 <code>&lt;length-percentage&gt;</code> 허용 가능한 형태로 지정하고, 비율 해결하는 길이에 따라서는 (A)에 사용될 수 있음이 수단 <a href="https://developer.mozilla.org/en-US/docs/Web/CSS/calc"> <code>calc()</code> </a> 식. 따라서 다음 값은 모두 <a href="width"> <code>width</code> </a> .
zh_cn: 将 <code>&lt;length-percentage&gt;</code> 指定为允许的类型时，这意味着该百分比解析为长度，因此可以在<a href="https://developer.mozilla.org/en-US/docs/Web/CSS/calc"> <code>calc()</code> </a>表达式中使用。因此，<a href="width"> <code>width</code> </a>的以下所有值均可接受：

source: Where a <code>&lt;time-percentage&gt;</code> is specified as an allowable type, this means that the percentage resolves to a time and therefore can be used in a <a href="calc()"><code>calc()</code></a> expression.
ko: 여기서 <code>&lt;time-percentage&gt;</code> 허용 가능한 형태로 지정하고, 비율 해결하는 시간에 따라서는 (A)에 사용될 수 있음이 수단 <a href="calc()"> <code>calc()</code> </a> 식.
zh_cn: 将 <code>&lt;time-percentage&gt;</code> 指定为允许的类型时，这意味着该百分比会解析为时间，因此可以在<a href="calc()"> <code>calc()</code> </a>表达式中使用。

source: Where a distance unit, also known as a length, is allowed as a value for a property, this is described as the <a href="length"><code>&lt;length&gt;</code></a> type. There are two types of lengths in CSS: relative and absolute.
ko: 길이라고도하는 거리 단위가 속성 값으로 허용되는 경우이를 <a href="length"> <code>&lt;length&gt;</code> </a> 유형이라고합니다. CSS에는 상대적 길이와 절대 길이의 두 가지 유형이 있습니다.
zh_cn: 如果允许将距离单位（也称为长度）作为属性的值，则将其描述为<a href="length"> <code>&lt;length&gt;</code> </a>类型。CSS中的长度有两种：相对长度和绝对长度。

source: Where an <code>&lt;angle-percentage&gt;</code> is specified as an allowable type, this means that the percentage resolves to an angle and therefore can be used in a <a href="calc()"><code>calc()</code></a> expression.
ko: 여기서 <code>&lt;angle-percentage&gt;</code> 허용 가능한 형태로 지정하고, 비율 각도로 해석 따라서는에 사용될 수 있음이 수단 <a href="calc()"> <code>calc()</code> </a> 식.
zh_cn: 将 <code>&lt;angle-percentage&gt;</code> 指定为允许的类型时，这意味着该百分比解析为一个角度，因此可以在<a href="calc()"> <code>calc()</code> </a>表达式中使用。

source: Where the <code>flex-grow</code> property deals with adding space in the main axis, the <code>flex-shrink</code> property controls how it is taken away. If we do not have enough space in the container to lay out our items and <code>flex-shrink</code> is set to a positive integer the item can become smaller than the <code>flex-basis</code>. As with <code>flex-grow</code> different values can be assigned in order to cause one item to shrink faster than others &mdash; an item with a higher value set for <code>flex-shrink</code> will shrink faster than its siblings that have lower values.
es: Cuando la propiedad <code>flex-grow</code> trata de agregar espacio en el eje principal, la propiedad <code>flex-shrink</code> controla c&oacute;mo se quita. Si no tenemos suficiente espacio en el contenedor para colocar nuestros art&iacute;culos y <code>flex-shrink</code> se establece en un n&uacute;mero entero positivo, el art&iacute;culo puede volverse m&aacute;s peque&ntilde;o que la <code>flex-basis</code> . Al igual que con <code>flex-grow</code> , se pueden asignar diferentes valores para hacer que un elemento se reduzca m&aacute;s r&aacute;pido que otros: un elemento con un valor m&aacute;s alto establecido para <code>flex-shrink</code> se reducir&aacute; m&aacute;s r&aacute;pido que sus hermanos que tienen valores m&aacute;s bajos.
ko: 어디 <code>flex-grow</code> 주축에 공간을 추가로 부동산 거래의 <code>flex-shrink</code> 이 날라 방법 속성을 제어합니다. 컨테이너에 아이템을 배치 할 공간이 충분하지 않고 <code>flex-shrink</code> 가 양의 정수로 설정되어 있으면 아이템이 <code>flex-basis</code> 보다 작아 질 수 있습니다 . <code>flex-grow</code> 와 마찬가지로 하나의 항목이 다른 항목보다 빠르게 축소되도록 다른 값을 지정할 수 있습니다. <code>flex-shrink</code> 에 대해 더 높은 값을 설정 한 항목은 값 이 낮은 형제보다 빠르게 축소 됩니다.
zh_cn: 当 <code>flex-grow</code> 与主轴线增加空间的房地产交易中， <code>flex-shrink</code> 属性控制它是如何带走。如果容器中没有足够的空间来布置商品，并且 <code>flex-shrink</code> 设置为正整数，则商品可能会比 <code>flex-basis</code> 小。与 <code>flex-grow</code> 一样，可以分配不同的值以使一个项目比其他项目更快地收缩-为 <code>flex-shrink</code> 设置较高的值的项目将比其具有较低值的同级项目更快地收缩。

source: Whether a given page is "left" or "right" is determined by the major writing direction of the document. For example, if the first page has a major writing direction of left-to-right then it will be a <a href=":right"><code>:right</code></a> page; if it has a major writing direction of right-to-left then it will be a <code>:left</code> page.
es: La direcci&oacute;n principal de escritura del documento determina si una p&aacute;gina determinada es "izquierda" o "derecha". Por ejemplo, si la primera p&aacute;gina tiene una direcci&oacute;n de escritura importante de izquierda a derecha, entonces ser&aacute; <a href=":right"> <code>:right</code> </a> p&aacute;gina derecha ; si tiene una direcci&oacute;n de escritura importante de derecha a izquierda, ser&aacute; una p&aacute;gina <code>:left</code> .
ko: 주어진 페이지가 "왼쪽"인지 "오른쪽"인지는 문서의 주요 글쓰기 방향에 의해 결정됩니다. 예를 들어, 첫 페이지의 주요 글쓰기 방향이 왼쪽에서 오른쪽 인 경우 <a href=":right"> <code>:right</code> </a> 페이지가됩니다. 오른쪽에서 왼쪽으로 글쓰기 방향이 큰 경우 <code>:left</code> 페이지가됩니다.
zh_cn: 给定页面是&ldquo;左&rdquo;还是&ldquo;右&rdquo;取决于文档的主要书写方向。例如，如果第一页的主要书写方向是从左到右，则它将是<a href=":right"> <code>:right</code> </a>页；如果主要写作方向是从右到左，那么它将是 <code>:left</code> 页面。

source: Whether a given page is "left" or "right" is determined by the major writing direction of the document. For example, if the first page has a major writing direction of left-to-right then it will be a <code>:right</code> page; if it has a major writing direction of right-to-left then it will be a <a href=":left"><code>:left</code></a> page.
es: La direcci&oacute;n principal de escritura del documento determina si una p&aacute;gina determinada es "izquierda" o "derecha". Por ejemplo, si la primera p&aacute;gina tiene una direcci&oacute;n de escritura importante de izquierda a derecha, entonces ser&aacute; <code>:right</code> p&aacute;gina derecha ; si tiene una direcci&oacute;n de escritura importante de derecha a izquierda, ser&aacute; una p&aacute;gina <a href=":left"> <code>:left</code> </a> .
ko: 주어진 페이지가 "왼쪽"인지 "오른쪽"인지는 문서의 주요 글쓰기 방향에 의해 결정됩니다. 예를 들어, 첫 페이지의 주요 글쓰기 방향이 왼쪽에서 오른쪽 인 경우 <code>:right</code> 페이지가됩니다. 오른쪽에서 왼쪽으로 글쓰기 방향이 큰 경우 <a href=":left"> <code>:left</code> </a> 페이지가됩니다.
zh_cn: 给定页面是&ldquo;左&rdquo;还是&ldquo;右&rdquo;取决于文档的主要书写方向。例如，如果第一页的主要书写方向是从左到右，则它将是 <code>:right</code> 页；如果主要写作方向是从右到左，那么它将是<a href=":left"> <code>:left</code> </a>页面。

source: Whether the box establishes a local stacking context.
es: Si la caja establece un contexto de apilamiento local.
ko: 상자가 로컬 스태킹 컨텍스트를 설정하는지 여부
zh_cn: 盒子是否建立了本地的堆积上下文。

source: Whether you are in continuous media on the web or in a Paged Media format such as print or EPUB, understanding how content overflows is useful when dealing with any layout method. By understanding how overflow works in normal flow, you should find it easier to understand the implications of overflow content in layout methods such as grid and flexbox.
es: Ya sea en medios continuos en la web o en un formato de medios paginados como la impresión o EPUB,comprender cómo se desborda el contenido es útil cuando se trata de cualquier método de presentación.Al comprender cómo funciona el desbordamiento en el flujo normal,debería ser más fácil entender las implicaciones del contenido desbordado en los métodos de diseño como la cuadrícula y el flexbox.
ko: 웹에서 연속 미디어를 사용하든 인쇄 또는 EPUB와 같은 페이지 미디어 형식을 사용하든 모든 레이아웃 방법을 처리 할 때 컨텐츠 오버플로 방법을 이해하는 것이 좋습니다. 일반적인 흐름에서 오버플로가 작동하는 방식을 이해하면 그리드 및 flexbox와 같은 레이아웃 방법에서 오버플로 내용의 의미를 더 쉽게 이해할 수 있습니다.
zh_cn: 无论你是在网络上的连续媒体中,还是在印刷品或EPUB等Paged Media格式中,了解内容如何溢出在处理任何布局方法时都是有用的。通过了解溢出在正常流程中是如何工作的,你应该会发现更容易理解溢出内容在网格和flexbox等布局方法中的影响。

source: Whether you use flexbox or CSS Grid to lay out a list of card components, these layout methods only work on direct children of the flex or grid component. This means that if you have variable amounts of content, the card will stretch to the height of the grid area or flex container. Any content inside uses regular block layout, meaning that on a card with less content the footer will rise up to the bottom of the content rather than stick to the bottom of the card.
es: Tanto si se utiliza el Flexbox como la Grilla CSS para diseñar una lista de componentes de la tarjeta,estos métodos de diseño sólo funcionan en los hijos directos del componente flex o de la grilla.Esto significa que si tienes cantidades variables de contenido,la tarjeta se estirará hasta la altura del área de la cuadrícula o del contenedor flex.Todo el contenido del interior utiliza una disposición de bloques regulares,lo que significa que en una tarjeta con menos contenido el pie de página se elevará hasta el fondo del contenido en lugar de pegarse al fondo de la tarjeta.
ko: flexbox 또는 CSS Grid를 사용하여 카드 구성 요소 목록을 레이아웃하든 관계없이 이러한 레이아웃 방법은 flex 또는 grid 구성 요소의 직계 하위에서만 작동합니다. 즉, 컨텐츠의 양이 가변적이면 카드가 그리드 영역이나 플렉스 컨테이너의 높이까지 늘어납니다. 내부의 모든 내용은 규칙적인 블록 레이아웃을 사용합니다. 즉, 내용이 적은 카드에서는 바닥 글이 카드의 아래쪽에 고정되지 않고 내용의 아래쪽으로 올라갑니다.
zh_cn: 无论你是使用flexbox还是CSS Grid来布局卡片组件列表,这些布局方法都只适用于flex或网格组件的直接子代。这意味着,如果你的内容数量可变,卡片将拉伸到网格区域或flex容器的高度。里面的任何内容都使用常规的块状布局,这意味着在内容较少的卡片上,页脚会上升到内容的底部,而不是粘在卡片的底部。

source: Which CSS entities participate in the cascade
es: ¿Qué entidades del CSS participan en la cascada
ko: 캐스케이드에 참여하는 CSS 엔티티
zh_cn: 哪些CSS实体参与级联

source: Which CSS properties can be transitioned?
es: ¿Qué propiedades del CSS pueden ser transcritas?
ko: 어떤 CSS 속성을 전환 할 수 있습니까?
zh_cn: 哪些CSS属性可以过渡?

source: Which for English, in left-to-right means the order is:
es: Lo que para el inglés,de izquierda a derecha significa que el orden es:
ko: 영어의 경우 왼쪽에서 오른쪽으로 순서는 다음과 같습니다.
zh_cn: 这对于英语来说,从左到右的意思是,顺序是。

source: Which leads to:
es: Lo que lleva a:
ko: 어느 것이
zh_cn: 这就导致。

source: Which of the links will change color if you define a new color for the <code>&lt;a&gt;</code> element &mdash; for example <code>a { color: red; }</code>?
ko: <code>&lt;a&gt;</code> 요소에 대해 새 색상을 정의하면 색상이 변경되는 링크 ( 예 <code>a { color: red; }</code> ?
zh_cn: 如果您为 <code>&lt;a&gt;</code> 元素定义新颜色（例如 <code>a { color: red; }</code> ？

source: Which syntax should you use now?
ko: 지금 어떤 구문을 사용해야합니까?
zh_cn: 你现在应该使用哪种语法?

source: Which will produce lists like this:
es: Lo que producirá listas como esta:
ko: 다음과 같은 목록이 생성됩니다.
zh_cn: 这将产生这样的列表。

source: While I&rsquo;ve spent some time in this guide going through potential issues and fallbacks, flexbox is very much ready for you to be using in production work. This guide will help you in those cases where you do come across an issue or have the requirement to support older browsers.
es: Si bien pas&eacute; alg&uacute;n tiempo en esta gu&iacute;a analizando posibles problemas y fallas, flexbox est&aacute; muy listo para que lo use en el trabajo de producci&oacute;n. Esta gu&iacute;a lo ayudar&aacute; en aquellos casos en los que encuentre un problema o tenga el requisito de admitir navegadores antiguos.
ko: 이 가이드에서 잠재적 인 문제와 단점을 극복하는 데 시간을 보냈지 만 flexbox는 프로덕션 작업에 사용할 준비가되어 있습니다. 이 가이드는 문제가 발생하거나 이전 브라우저를 지원해야하는 경우에 도움이됩니다.
zh_cn: 尽管我在本指南中花了一些时间来解决潜在的问题和后备问题，但是flexbox非常适合您在生产工作中使用。本指南将在遇到问题或需要支持较旧的浏览器的情况下为您提供帮助。

source: While certain languages will use a particular writing mode or text direction, we can also use these properties for creative effect, such as running a heading vertically.
es: Mientras que ciertos idiomas utilizarán un modo de escritura o una dirección de texto en particular,también podemos utilizar estas propiedades para un efecto creativo,como la ejecución de un encabezamiento en forma vertical.
ko: 특정 언어는 특정 쓰기 모드 또는 텍스트 방향을 사용하지만 제목을 세로로 돌리는 등 창의적인 효과를 위해 이러한 속성을 사용할 수도 있습니다.
zh_cn: 虽然某些语言会使用特定的写作模式或文本方向,但我们也可以使用这些属性来实现创造性的效果,例如垂直运行一个标题。

source: While exploring the above patterns you have hopefully started to see how you can think through the best way to use flexbox to achieve the result that you want. Quite often you have more than one choice. Mix items that cannot stretch with those that can, use the content to inform the size, or allow flexbox to share out space in proportion. It&rsquo;s up to you.
es: Al explorar los patrones anteriores, es de esperar que haya comenzado a ver c&oacute;mo puede pensar en la mejor manera de usar flexbox para lograr el resultado que desea. Muy a menudo tienes m&aacute;s de una opci&oacute;n. Mezcle elementos que no se puedan estirar con los que s&iacute; pueden, use el contenido para informar el tama&ntilde;o o permita que flexbox comparta el espacio en proporci&oacute;n. Tu decides.
ko: 위의 패턴을 살펴보면서 원하는 결과를 얻기 위해 flexbox를 사용하는 가장 좋은 방법을 통해 생각할 수있는 방법을 찾기 시작했습니다. 종종 하나 이상의 선택이 있습니다. 확장 할 수없는 항목을 혼합하거나, 내용을 사용하여 크기를 알리거나, flexbox가 공간을 비례 적으로 공유하도록 허용하십시오. 그것은 당신에게 달려 있습니다.
zh_cn: 在探索以上模式时，您希望已经开始了解如何使用Flexbox最佳方法来实现所需的结果。通常，您有多种选择。将无法拉伸的项目与可以拉伸的项目混合在一起，使用内容来告知尺寸，或者允许flexbox按比例分配空间。由你决定。

source: While flexbox is a one dimensional model, it is possible to cause our flex items to wrap onto multiple lines. In doing so, you should consider each line as a new flex container. Any space distribution will happen across that line, without reference to the lines either side.
es: Mientras que la caja flexible es un modelo unidimensional,es posible hacer que nuestros artículos flexibles se envuelvan en múltiples líneas.Al hacerlo,debería considerar cada línea como un nuevo contenedor flexible.Cualquier distribución del espacio ocurrirá a través de esa línea,sin referencia a las líneas de cada lado.
ko: flexbox는 1 차원 모델이지만 flex 항목을 여러 줄로 감쌀 수 있습니다. 그렇게 할 때 각 라인을 새로운 플렉스 컨테이너로 고려해야합니다. 공간 분배는 라인 양쪽을 참조하지 않고 해당 라인을 가로 질러 발생합니다.
zh_cn: 虽然flexbox是一个一维模型,但也可以使我们的flex项目包覆到多条线上。在这样做的时候,你应该把每一条线都看作是一个新的弹性容器。任何空间分布都会发生在这条线上,而不需要参考两边的线。

source: While it is usually subtle, defined in the specification is one reason why <code>flex-shrink</code> isn&rsquo;t quite the same for negative space as <code>flex-grow</code> is for positive space:
es: Si bien suele ser sutil, definido en la especificaci&oacute;n es una de las razones por las cuales <code>flex-shrink</code> no es lo mismo para el espacio negativo que <code>flex-grow</code> es para el espacio positivo:
ko: 그것이 일반적으로 미묘하지만, 사양에 정의 된 이유 는 <code>flex-grow</code> 가 양의 공간에 대한 것과 같이 음의 공간에 대해 <code>flex-shrink</code> 가 완전히 동일하지 않은 이유 중 하나입니다 .
zh_cn: 尽管它通常很微妙，但在规范中定义的原因是负空间的 <code>flex-shrink</code> 与正空间的 <code>flex-grow</code> 不太相同的原因之一：

source: While more common in script typefaces, in the below example they are used to create arrows:
es: Si bien son más comunes en los tipos de letra de los guiones,en el siguiente ejemplo se utilizan para crear flechas:
ko: 스크립트 서체에서 더 일반적이지만 아래 예에서는 화살표를 만드는 데 사용됩니다.
zh_cn: 虽然在脚本字体中比较常见,但在下面的例子中,它们是用来创建箭头的。

source: While none of these features individually will render a site useless due to their absence, each of them in turn can make a site easier to use and more memorable for its attention to detail.
es: Si bien ninguna de estas características individualmente hará que un sitio sea inútil debido a su ausencia,cada una de ellas a su vez puede hacer que un sitio sea más fácil de usar y más memorable por su atención a los detalles.
ko: 이러한 기능 중 어느 것도 부재로 인해 사이트를 쓸모 없게 만들지 않지만, 각각의 기능은 사이트를보다 사용하기 쉽고 세부 사항에 대한 관심으로 기억하기 쉽게 만듭니다.
zh_cn: 虽然这些功能中没有一个单独的功能会因为它们的缺失而使网站失去作用,但它们中的每一个又都能使网站更容易使用,并因其对细节的关注而更令人难忘。

source: While part of the<em>CSS Logical Properties</em> specification, it does not define <em>logical</em> offsets. It defines <em>physical</em> offsets, regardless of the element's writing mode, directionality, and text orientation.
ko: <em>CSS 논리적 속성</em> 사양 의 일부이지만 <em>논리적</em> 오프셋을 정의하지 않습니다 . 요소의 쓰기 모드, 방향 및 텍스트 방향에 관계없이 <em>물리적</em> 오프셋을 정의 합니다.
zh_cn: 虽然属于<em>CSS逻辑属性</em>规范的一部分，但它没有定义<em>逻辑</em>偏移量。它定义了<em>物理</em>偏移量，而与元素的书写模式，方向性和文本方向无关。

source: While preserving its intrinsic proportions, the image is rendered at the largest size contained within, or covering, the background positioning area. If the image has no intrinsic proportions, then it's rendered at the size of the background positioning area.
es: Conservando sus proporciones intrínsecas,la imagen se presenta en el mayor tamaño que contiene,o que cubre,el área de posicionamiento del fondo.Si la imagen no tiene proporciones intrínsecas,entonces se renderiza al tamaño del área de posicionamiento del fondo.
ko: 본질적인 비율을 유지하면서 이미지는 배경 위치 영역 내에 포함되거나이를 덮는 가장 큰 크기로 렌더링됩니다. 이미지에 고유 한 비율이 없으면 배경 위치 영역의 크기로 렌더링됩니다.
zh_cn: 在保留其固有比例的同时,以背景定位区域所包含的最大尺寸渲染图像,或覆盖背景定位区域。如果图像没有固有比例,则以背景定位区域的大小渲染。

source: While the CSS property is parsed and accepted, it does not have any effect.
es: Aunque la propiedad CSS es analizada y aceptada,no tiene ningún efecto.
ko: CSS 속성은 구문 분석되고 적용되지만 아무런 영향을 미치지 않습니다.
zh_cn: 虽然CSS属性被解析和接受,但并没有任何效果。

source: While the declarations contained in most at-rules &mdash; such as those in <a href="@media"><code>@media</code></a>, <a href="@document"><code>@document</code></a>, or <a href="@supports"><code>@supports</code></a> &mdash; participate in the cascade, declarations contained in <a href="@keyframes"><code>@keyframes</code></a> don't. As with <code>@font-face</code>, only the at-rule as a whole is selected via the cascade algorithm.
es: Mientras que las declaraciones contenidas en la mayor&iacute;a de las reglas at, como las de <a href="@media"> <code>@media</code> </a> , <a href="@document"> <code>@document</code> </a> o <a href="@supports"> <code>@supports</code> </a> , participan en la cascada, las declaraciones contenidas en <a href="@keyframes"> <code>@keyframes</code> </a> no. Al igual que con <code>@font-face</code> , solo se selecciona la regla at en su conjunto a trav&eacute;s del algoritmo en cascada.
ko: 등의 것과 같은 - 대부분의-규칙에서의 선언이 포함되어 있지만 <a href="@media"> <code>@media</code> </a> , <a href="@document"> <code>@document</code> </a> , 또는 <a href="@supports"> <code>@supports</code> </a> - 캐스케이드에 참여 선언에 포함 된 <a href="@keyframes"> <code>@keyframes</code> </a> 하지 않습니다. <code>@font-face</code> 와 마찬가지로 캐스케이드 알고리즘을 통해 at-rule 만 전체적으로 선택됩니다.
zh_cn: 虽然声明中包含的大多数在规则-如在<a href="@media"> <code>@media</code> </a>，<a href="@document"> <code>@document</code> </a>，或<a href="@supports"> <code>@supports</code> </a> -参与级联，声明包含在<a href="@keyframes"> <code>@keyframes</code> </a>没有。与 <code>@font-face</code> ，通过级联算法仅选择整个规则。

source: While the property is recognized, values applied to it don't have any effect.
es: Si bien la propiedad es reconocida,los valores aplicados a ella no tienen ningún efecto.
ko: 속성이 인식되는 동안 적용된 값은 영향을 미치지 않습니다.
zh_cn: 虽然该属性得到了认可,但应用于它的价值却没有任何影响。

source: While the symbols specified in the symbols descriptor is used for constructing marker representation by most algorithms, some systems such as 'additive' rely on <em>additive tuples</em> described in this descriptor. Each additive tuple consists of a counter symbol and a non negative integer weight. The additive tuples must be specified in the descending order of their weights.
es: Mientras que la mayor&iacute;a de los algoritmos utilizan los s&iacute;mbolos especificados en el descriptor de s&iacute;mbolos para construir la representaci&oacute;n de marcadores, algunos sistemas como 'aditivo' se basan en <em>tuplas de aditivo</em> descritas en este descriptor. Cada tupla aditiva consiste en un s&iacute;mbolo de contador y un peso entero no negativo. Las tuplas aditivas deben especificarse en el orden descendente de sus pesos.
ko: 심볼 디스크립터에 지정된 심볼은 대부분의 알고리즘으로 마커 표현을 구성하는 데 사용되지만 'additive'와 같은 일부 시스템 은이 디스크립터에 설명 된 <em>추가 튜플에</em> 의존합니다 . 각 추가 튜플은 카운터 기호와 음이 아닌 정수 가중치로 구성됩니다. 추가 튜플은 가중치의 내림차순으로 지정해야합니다.
zh_cn: 尽管大多数算法使用符号描述符中指定的符号来构造标记表示，但某些系统（如&ldquo;加性&rdquo;）依赖于此描述符中描述的<em>加性元组</em>。每个加法元组均包含一个计数器符号和一个非负整数权重。附加元组必须按其权重降序指定。
