Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/css/css.*.017.xlf
Languages: es, ko, zh_cn

source: When <strong>four</strong> values are specified, the outsets apply to the <strong>top</strong>, <strong>right</strong>, <strong>bottom</strong>, and <strong>left</strong> in that order (clockwise).
es: Cuando se especifican <strong>cuatro</strong> valores, los l&iacute;mites se aplican a la <strong>parte superior</strong> , <strong>derecha</strong> , <strong>inferior</strong> e <strong>izquierda</strong> en ese orden (en sentido horario).
ko: 때는 <strong>네 개의</strong> 값이 지정은 굽기위한이 적용 <strong>위쪽</strong> , <strong>오른쪽</strong> , <strong>하단</strong> 그리고 <strong>좌</strong> 순서 (시계 방향)이다.
zh_cn: 如果指定了<strong>四个</strong>值，则开始位置将按该顺序（顺时针）应用于<strong>top</strong>，<strong>right</strong>，<strong>bottom</strong>和<strong>left</strong>。

source: When <strong>four</strong> values are specified, the paddings apply to the <strong>top</strong>, <strong>right</strong>, <strong>bottom</strong>, and <strong>left</strong> in that order (clockwise).
es: Cuando se especifican <strong>cuatro</strong> valores, los rellenos se aplican a la <strong>parte superior</strong> , <strong>derecha</strong> , <strong>inferior</strong> e <strong>izquierda</strong> en ese orden (en sentido horario).
ko: 때는 <strong>네 개의</strong> 값이 지정되고 상기 가스켓에는 적용 <strong>위쪽</strong> , <strong>오른쪽</strong> , <strong>하단</strong> 그리고 <strong>좌</strong> 순서 (시계 방향)이다.
zh_cn: 如果指定了<strong>四个</strong>值，则填充将按该顺序（顺时针）应用于<strong>top</strong>，<strong>right</strong>，<strong>bottom</strong>和<strong>left</strong>。

source: When <strong>four</strong> values are specified, the styles apply to the <strong>top</strong>, <strong>right</strong>, <strong>bottom</strong>, and <strong>left</strong> in that order (clockwise).
es: Cuando se especifican <strong>cuatro</strong> valores, los estilos se aplican a la <strong>parte superior</strong> , <strong>derecha</strong> , <strong>inferior</strong> e <strong>izquierda</strong> en ese orden (en sentido horario).
ko: 때 <strong>네 개의</strong> 값을 지정, 스타일이 적용 <strong>상단</strong> , <strong>우측</strong> , <strong>하단</strong> 과 <strong>왼쪽</strong> 의 순서 (시계 방향)에서.
zh_cn: 当<strong>4个</strong>指定值，样式应用到<strong>顶部</strong>，<strong>右</strong>，<strong>底部</strong>和<strong>左侧</strong>的顺序（顺时针方向）这一点。

source: When <strong>four</strong> values are specified, the widths apply to the <strong>top</strong>, <strong>right</strong>, <strong>bottom</strong>, and <strong>left</strong> in that order (clockwise).
es: Cuando se especifican <strong>cuatro</strong> valores, los anchos se aplican a la <strong>parte superior</strong> , <strong>derecha</strong> , <strong>inferior</strong> e <strong>izquierda</strong> en ese orden (en sentido horario).
ko: 때는 <strong>네 개의</strong> 값이 지정되고, 폭이 적용 <strong>위쪽</strong> , <strong>오른쪽</strong> , <strong>하단</strong> 그리고 <strong>좌</strong> 순서 (시계 방향)이다.
zh_cn: 如果指定了<strong>四个</strong>值，则宽度按该顺序（顺时针）应用于<strong>top</strong>，<strong>right</strong>，<strong>bottom</strong>和<strong>left</strong>。

source: When <strong>one</strong> position is specified, it creates all four slices at the same distance from their respective sides.
es: Cuando se especifica <strong>una</strong> posici&oacute;n, crea los cuatro sectores a la misma distancia de sus respectivos lados.
ko: 경우 <strong>하나</strong> 의 위치를 지정하고, 그 각각의면으로부터 같은 거리에 네 개의 슬라이스를 생성한다.
zh_cn: 当<strong>一个</strong>被指定的位置，它在从它们各自的两侧是相同的距离创建所有四片。

source: When <strong>one</strong> value is specified, it applies the same behavior on <strong>all four sides</strong>.
es: Cuando se especifica <strong>un</strong> valor, aplica el mismo comportamiento en <strong>los cuatro lados</strong> .
ko: <strong>하나의</strong> 값을 지정 하면 <strong>모든 네면</strong> 에 동일한 동작이 적용됩니다 .
zh_cn: 当<strong>一个</strong>指定的值，它适用于同一行为<strong>四面</strong>。

source: When <strong>one</strong> value is specified, it applies the same color to <strong>all four sides</strong>.
es: Cuando se especifica <strong>un</strong> valor, aplica el mismo color a <strong>los cuatro lados</strong> .
ko: 경우 <strong>하나</strong> 의 값을 지정하고, 그것은 동일한 컬러 적용 <strong>사방을</strong> .
zh_cn: 当<strong>一个</strong>指定的值，它适用相同的颜色，以<strong>四面</strong>。

source: When <strong>one</strong> value is specified, it applies the same margin to <strong>all four sides</strong>.
es: Cuando se especifica <strong>un</strong> valor, aplica el mismo margen a <strong>los cuatro lados</strong> .
ko: <strong>하나의</strong> 값을 지정 하면 <strong>4 개의 모든면에</strong> 동일한 여백이 적용됩니다 .
zh_cn: 当<strong>一个</strong>指定的值，它适用同样的保证金<strong>四面</strong>。

source: When <strong>one</strong> value is specified, it applies the same outset to <strong>all four sides</strong>.
es: Cuando se especifica <strong>un</strong> valor, aplica el mismo comienzo a <strong>los cuatro lados</strong> .
ko: 때 <strong>하나 개의</strong> 값을 지정, 그것은 동일한 처음 적용 <strong>네면을</strong> .
zh_cn: 当<strong>一个</strong>指定的值，它适用同样的一开始就<strong>四面</strong>。

source: When <strong>one</strong> value is specified, it applies the same padding to <strong>all four sides</strong>.
es: Cuando se especifica <strong>un</strong> valor, aplica el mismo relleno a <strong>los cuatro lados</strong> .
ko: <strong>하나의</strong> 값을 지정 하면 <strong>4 개의 모든면에</strong> 동일한 패딩이 적용됩니다 .
zh_cn: 当<strong>一个</strong>指定的值，它适用同样的填充，以<strong>四面</strong>。

source: When <strong>one</strong> value is specified, it applies the same style to <strong>all four sides</strong>.
es: Cuando se especifica <strong>un</strong> valor, aplica el mismo estilo a <strong>los cuatro lados</strong> .
ko: <strong>하나의</strong> 값을 지정 하면 <strong>4 개의 모든면에</strong> 동일한 스타일이 적용됩니다 .
zh_cn: 当<strong>一个</strong>指定的值，它适用同样的风格，<strong>四面</strong>。

source: When <strong>one</strong> value is specified, it applies the same width to <strong>all four sides</strong>.
es: Cuando se especifica <strong>un</strong> valor, aplica el mismo ancho a <strong>los cuatro lados</strong> .
ko: <strong>하나의</strong> 값을 지정 하면 <strong>4 개의 모든면에</strong> 동일한 너비가 적용됩니다 .
zh_cn: 当<strong>一个</strong>指定的值，它适用相同的宽度，以<strong>四面</strong>。

source: When <strong>one</strong><code>&lt;length&gt;</code> value is specified, it defines both the horizontal and vertical spacings between cells.
es: Cuando <strong>uno </strong> <code>&lt;length&gt;</code> se especifica valor, se define tanto las distancias horizontal y vertical entre las c&eacute;lulas.
ko: 경우 <strong>하나 </strong> <code>&lt;length&gt;</code> 값이 지정되고, 그 두 셀 간의 수평 및 수직 간격을 정의한다.
zh_cn: 当<strong>一个</strong> <code>&lt;length&gt;</code> 指定的值，它定义两个小区之间的水平和垂直间隔。

source: When <strong>three</strong> positions are specified, the first value creates a slice measured from the <strong>top</strong>, the second creates slices measured from the <strong>left and right</strong>, the third creates a slice measured from the <strong>bottom</strong>.
es: Cuando se especifican <strong>tres</strong> posiciones, el primer valor crea un segmento medido desde la <strong>parte superior</strong> , el segundo crea sectores medidos desde la <strong>izquierda y la derecha</strong> , el tercero crea un sector medido desde la <strong>parte inferior</strong> .
ko: 경우 <strong>세</strong> 위치가 지정되며, 상기 제 값으로부터 측정 슬라이스 생성 <strong>탑을</strong> , 두 번째는 슬라이스에서 측정 생성 <strong>왼쪽 및 오른쪽</strong> , 세번째는 슬라이스에서 측정 생성 <strong>바닥</strong> .
zh_cn: 当<strong>3点</strong>被指定的位置，所述第一值创建一个从测量的切片<strong>顶部</strong>，所述第二创建从所测量的片<strong>左右</strong>，第三创建从所述测得的切片<strong>底部</strong>。

source: When <strong>three</strong> values are specified, the first color applies to the <strong>top</strong>, the second to the <strong>left and right</strong>, the third to the <strong>bottom</strong>.
es: Cuando se especifican <strong>tres</strong> valores, el primer color se aplica a la <strong>parte superior</strong> , el segundo a la <strong>izquierda y a la derecha</strong> , el tercero a la <strong>parte inferior</strong> .
ko: 경우 <strong>세 개의</strong> 값이 지정되어, 제 1 색이 적용 <strong>상단</strong> 의 두 번째 <strong>좌우</strong> 받는 세 번째 <strong>바닥</strong> .
zh_cn: 当<strong>3个</strong>被指定的值，所述第一颜色适用于<strong>顶部</strong>，第二至<strong>左边和右边</strong>，第三至<strong>底部</strong>。

source: When <strong>three</strong> values are specified, the first margin applies to the <strong>top</strong>, the second to the <strong>left and right</strong>, the third to the <strong>bottom</strong>.
es: Cuando se especifican <strong>tres</strong> valores, el primer margen se aplica a la <strong>parte superior</strong> , el segundo a la <strong>izquierda y a la derecha</strong> , el tercero a la <strong>parte inferior</strong> .
ko: 경우 <strong>세</strong> 값을 지정, 제 마진이 적용되는 <strong>상단</strong> 의 두 번째 <strong>좌우</strong> 받는 세 번째 <strong>바닥</strong> .
zh_cn: 当<strong>3个</strong>被指定的值时，第一余量适用于<strong>顶部</strong>，第二至<strong>左边和右边</strong>，第三至<strong>底部</strong>。

source: When <strong>three</strong> values are specified, the first margin applies to the <strong>top</strong>, the second to the <strong>right and left</strong>, the third to the <strong>bottom</strong>.
ko: 경우 <strong>세</strong> 값을 지정, 제 마진이 적용되는 <strong>상단</strong> 의 두 번째 <strong>오른쪽 및 왼쪽</strong> 받는 제, <strong>저부</strong> .
zh_cn: 如果指定了<strong>三个</strong>值，则第一个边距适用于<strong>顶部</strong>，第二个边距适用于<strong>右侧和左侧</strong>，第三个边距适用于<strong>底部</strong>。

source: When <strong>three</strong> values are specified, the first outset applies to the <strong>top</strong>, the second to the <strong>left and right</strong>, the third to the <strong>bottom</strong>.
es: Cuando se especifican <strong>tres</strong> valores, el primer comienzo se aplica a la <strong>parte superior</strong> , el segundo a la <strong>izquierda y a la derecha</strong> , el tercero a la <strong>parte inferior</strong> .
ko: 경우 <strong>세</strong> 값을 지정, 제 초기에는 적용 <strong>상단</strong> 의 두 번째 <strong>좌우</strong> 받는 세 번째 <strong>바닥</strong> .
zh_cn: 当指定了<strong>三个</strong>值时，第一个起始值适用于<strong>顶部</strong>，第二个起始值适用于<strong>左侧和右侧</strong>，第三个起始值适用于<strong>底部</strong>。

source: When <strong>three</strong> values are specified, the first padding applies to the <strong>top</strong>, the second to the <strong>left and right</strong>, the third to the <strong>bottom</strong>.
es: Cuando se especifican <strong>tres</strong> valores, el primer relleno se aplica a la <strong>parte superior</strong> , el segundo a la <strong>izquierda y a la derecha</strong> , el tercero a la <strong>parte inferior</strong> .
ko: 경우 <strong>세</strong> 값을 지정, 제 패딩이 적용 <strong>상단</strong> 의 두 번째 <strong>좌우</strong> 받는 세 번째 <strong>바닥</strong> .
zh_cn: 当<strong>3个</strong>被指定的值，所述第一填充适用于<strong>顶部</strong>，第二至<strong>左边和右边</strong>，第三至<strong>底部</strong>。

source: When <strong>three</strong> values are specified, the first padding applies to the <strong>top</strong>, the second to the <strong>right and left</strong>, the third to the <strong>bottom</strong>.
ko: 경우 <strong>세</strong> 값을 지정, 제 패딩이 적용 <strong>상단</strong> 의 두 번째 <strong>오른쪽 및 왼쪽</strong> 받는 제, <strong>저부</strong> .
zh_cn: 如果指定了<strong>三个</strong>值，则第一个填充应用于<strong>顶部</strong>，第二个填充应用于<strong>右侧和左侧</strong>，第三个填充应用于<strong>底部</strong>。

source: When <strong>three</strong> values are specified, the first style applies to the <strong>top</strong>, the second to the <strong>left and right</strong>, the third to the <strong>bottom</strong>.
es: Cuando se especifican <strong>tres</strong> valores, el primer estilo se aplica a la <strong>parte superior</strong> , el segundo a la <strong>izquierda y a la derecha</strong> , el tercero a la <strong>parte inferior</strong> .
ko: 경우 <strong>세</strong> 값을 지정, 제 스타일이 적용 <strong>상단</strong> 의 두 번째 <strong>좌우</strong> 받는 세 번째 <strong>바닥</strong> .
zh_cn: 如果指定了<strong>三个</strong>值，则第一种样式将应用于<strong>顶部</strong>，第二种样式将应用于<strong>左侧和右侧</strong>，第三个样式将应用于<strong>底部</strong>。

source: When <strong>three</strong> values are specified, the first width applies to the <strong>top</strong>, the second to the <strong>left and right</strong>, the third to the <strong>bottom</strong>.
es: Cuando se especifican <strong>tres</strong> valores, el primer ancho se aplica a la <strong>parte superior</strong> , el segundo a la <strong>izquierda y a la derecha</strong> , el tercero a la <strong>parte inferior</strong> .
ko: 경우 <strong>세</strong> 값을 지정 상기 제 1 폭은 적용 <strong>상단</strong> 의 두 번째 <strong>좌우</strong> 받는 세 번째 <strong>바닥</strong> .
zh_cn: 当<strong>3个</strong>被指定的值，所述第一宽度适用于<strong>顶部</strong>，第二至<strong>左边和右边</strong>，第三至<strong>底部</strong>。

source: When <strong>two</strong> positions are specified, the first value creates slices measured from the <strong>top and bottom</strong>, the second creates slices measured from the <strong>left and right</strong>.
es: Cuando se especifican <strong>dos</strong> posiciones, el primer valor crea sectores medidos desde <strong>arriba y abajo</strong> , el segundo crea sectores medidos desde la <strong>izquierda y la derecha</strong> .
ko: 경우 <strong>두</strong> 위치가 지정되며, 상기 제 값은 슬라이스에서 측정 생성 <strong>상하를</strong> 제는 슬라이스에서 측정 생성 <strong>좌우를</strong> .
zh_cn: 当<strong>2点</strong>被指定的位置，所述第一值创建一个从测量的层<strong>的顶部和底部</strong>，所述第二创建从所测量的片<strong>左右</strong>。

source: When <strong>two</strong> values are specified, the first applies to the <strong>top and bottom</strong>, the second to the <strong>left and right</strong>.
es: Cuando se especifican <strong>dos</strong> valores, el primero se aplica a la <strong>parte superior e inferior</strong> , el segundo a la <strong>izquierda y a la derecha</strong> .
ko: 경우 <strong>두</strong> 값이 지정된 상기 우선 적용되는 <strong>상부 및 하부</strong> 의 두 번째 <strong>좌우</strong> .
zh_cn: 当<strong>2个</strong>指定值时，所述第一应用到所述<strong>顶部和底部</strong>，所述第二至<strong>左边和右边</strong>。

source: When <strong>two</strong> values are specified, the first color applies to the <strong>top and bottom</strong>, the second to the <strong>left and right</strong>.
es: Cuando se especifican <strong>dos</strong> valores, el primer color se aplica a la <strong>parte superior e inferior</strong> , el segundo a la <strong>izquierda y a la derecha</strong> .
ko: 경우 <strong>두</strong> 값이 지정되어, 제 1 색이 적용되는 <strong>상부 및 하부</strong> 의 두 번째 <strong>좌우</strong> .
zh_cn: 当<strong>2个</strong>指定值时，所述第一颜色适用于<strong>顶部和底部</strong>，所述第二至<strong>左边和右边</strong>。

source: When <strong>two</strong> values are specified, the first margin applies to the <strong>top and bottom</strong>, the second to the <strong>left and right</strong>.
es: Cuando se especifican <strong>dos</strong> valores, el primer margen se aplica a la <strong>parte superior e inferior</strong> , el segundo a la <strong>izquierda y a la derecha</strong> .
ko: 경우 <strong>두</strong> 값이 지정되며, 상기 제 마진이 적용되는 <strong>상부 및 하부</strong> 의 두 번째 <strong>좌우</strong> .
zh_cn: 当<strong>2个</strong>指定值时，第一余量适用于<strong>顶部和底部</strong>，所述第二至<strong>左边和右边</strong>。

source: When <strong>two</strong> values are specified, the first outset applies to the <strong>top and bottom</strong>, the second to the <strong>left and right</strong>.
es: Cuando se especifican <strong>dos</strong> valores, el primer comienzo se aplica a la <strong>parte superior e inferior</strong> , el segundo a la <strong>izquierda y a la derecha</strong> .
ko: 경우 <strong>두</strong> 값이 지정되며, 상기 제 초기에는 적용 <strong>상부 및 하부</strong> 의 두 번째 <strong>좌우</strong> .
zh_cn: 当指定<strong>两个</strong>值时，第一个起始值适用于<strong>顶部和底部</strong>，第二个起始值适用于<strong>左侧和右侧</strong>。

source: When <strong>two</strong> values are specified, the first padding applies to the <strong>top and bottom</strong>, the second to the <strong>left and right</strong>.
es: Cuando se especifican <strong>dos</strong> valores, el primer relleno se aplica a la <strong>parte superior e inferior</strong> , el segundo a la <strong>izquierda y a la derecha</strong> .
ko: 경우 <strong>두</strong> 값이 지정되며, 상기 제 패딩이 적용되는 <strong>상부 및 하부</strong> 의 두 번째 <strong>좌우</strong> .
zh_cn: 当<strong>2倍</strong>指定的值，所述第一填充适用于<strong>顶部和底部</strong>，所述第二至<strong>左边和右边</strong>。

source: When <strong>two</strong> values are specified, the first style applies to the <strong>top and bottom</strong>, the second to the <strong>left and right</strong>.
es: Cuando se especifican <strong>dos</strong> valores, el primer estilo se aplica a la <strong>parte superior e inferior</strong> , el segundo a la <strong>izquierda y a la derecha</strong> .
ko: 경우 <strong>두</strong> 값이 지정되며, 상기 제 스타일이 적용되는 <strong>상부 및 하부</strong> 의 두 번째 <strong>좌우</strong> .
zh_cn: 当<strong>2个</strong>指定值时，第一个样式应用到<strong>顶部和底部</strong>，第二至<strong>左，右</strong>。

source: When <strong>two</strong> values are specified, the first width applies to the <strong>top and bottom</strong>, the second to the <strong>left and right</strong>.
es: Cuando se especifican <strong>dos</strong> valores, el primer ancho se aplica a la <strong>parte superior e inferior</strong> , el segundo a la <strong>izquierda y a la derecha</strong> .
ko: 경우 <strong>두</strong> 값이 지정되는 상기 제 1 폭이 적용되는 <strong>상부 및 하부</strong> 의 두 번째 <strong>좌우</strong> .
zh_cn: 当<strong>2倍</strong>指定的值，所述第一宽度适用于<strong>顶部和底部</strong>，所述第二至<strong>左边和右边</strong>。

source: When <strong>two</strong><code>&lt;length&gt;</code> values are specified, the first value defines the horizontal spacing between cells (i.e., the space between cells in adjacent <em>columns</em>), and the second value defines the vertical spacing between cells (i.e., the space between cells in adjacent <em>rows</em>).
es: Cuando se especifican <strong>dos</strong> valores de <code>&lt;length&gt;</code> , el primer valor define el espacio horizontal entre celdas (es decir, el espacio entre celdas en <em>columnas</em> adyacentes ), y el segundo valor define el espacio vertical entre celdas (es decir, el espacio entre celdas en <em>filas</em> adyacentes )
ko: 경우 <strong>두 </strong> <code>&lt;length&gt;</code> 값이 지정되며, 상기 제 값은 셀 (즉, 인접하는 셀 사이의 공간 사이의 수평 간격을 정의 <em>열</em> )이고, 두번째 값은 셀 사이의 수직 간격 (정의 즉, 인접하는 셀 사이의 공간 <em>행</em> ).
zh_cn: 当指定<strong>两个</strong> <code>&lt;length&gt;</code> 值时，第一个值定义单元格之间的水平间距（即，相邻<em>列中的</em>单元格之间的空间），第二个值定义单元格之间的垂直间距（即，相邻<em>行中的</em>单元格之间的空间））。

source: When a URL points at a specific piece of a document, it can be difficult for the user to notice. Find out how you can use some simple CSS to draw attention to the target of a URL and improve the user's experience.
es: Cuando un URL apunta a una parte específica de un documento,puede ser difícil que el usuario lo note.Averigüe cómo puede utilizar un simple CSS para llamar la atención sobre el objetivo de una URL y mejorar la experiencia del usuario.
ko: URL이 특정 문서를 가리키면 사용자가 알아 채기가 어려울 수 있습니다. 간단한 CSS를 사용하여 URL 대상에주의를 기울이고 사용자 경험을 향상시키는 방법을 알아보십시오.
zh_cn: 当一个URL指向文档中的某个特定片段时,用户可能很难注意到。了解如何使用一些简单的CSS来吸引用户对URL目标的注意,并改善用户的体验。

source: When a coordinate value is outside the [-1, 1] range, the element grows along that dimension; when inside, it shrinks. If it is negative, the result a <a href="https://en.wikipedia.org/wiki/Point_reflection">point reflection</a> in that dimension. A value of 1 has no effect.
es: Cuando un valor de coordenadas est&aacute; fuera del rango [-1, 1], el elemento crece a lo largo de esa dimensi&oacute;n; cuando est&aacute; adentro, se encoge. Si es negativo, el resultado es un <a href="https://en.wikipedia.org/wiki/Point_reflection">punto de reflexi&oacute;n</a> en esa dimensi&oacute;n. Un valor de 1 no tiene efecto.
ko: 좌표 값이 [-1, 1] 범위를 벗어나면 요소가 해당 치수를 따라 커집니다. 안에 있으면 수축합니다. 음수 인 경우 결과는 해당 차원에서 <a href="https://en.wikipedia.org/wiki/Point_reflection">점 반사</a> 입니다. 값 1은 영향을 미치지 않습니다.
zh_cn: 当坐标值超出[-1，1]范围时，元素沿该尺寸增长；在里面时，它会收缩。如果为负，则结果在该维度上为<a href="https://en.wikipedia.org/wiki/Point_reflection">点反射</a>。值为1无效。

source: When a dimension is specified, rule 1 applies that dimension from the SVG to the rendered background unless specifically overridden by the CSS. When an intrinsic ratio is also specified, that's used to determine the other dimension.
es: Cuando se especifica una dimensión,la regla 1 aplica esa dimensión desde el SVG al fondo renderizado a menos que sea específicamente anulada por el CSS.Cuando también se especifica una relación intrínseca,se utiliza para determinar la otra dimensión.
ko: 차원이 지정되면 규칙 1은 CSS에서 특별히 재정의하지 않는 한 SVG에서 렌더링 된 배경으로 해당 차원을 적용합니다. 고유 비율도 지정하면 다른 차원을 결정하는 데 사용됩니다.
zh_cn: 当指定了一个维度时,规则1会将SVG中的那个维度应用到渲染的背景中,除非被CSS特别覆盖。如果还指定了一个内在比率,则用于确定其他维度。

source: When a gesture is started, the browser intersects the <code>touch-action</code> values of the touched element and all its ancestors up to the one that implements the gesture (in other words, the first containing scrolling element). This means that in practice, <code>touch-action</code> is typically applied only to individual elements which have some custom behavior, without needing to specify <code>touch-action</code> explicitly on any of that element's descendants. After a gesture has started, changes to <strong>touch-action</strong> values will not have any impact on the behavior of the current gesture.
es: Cuando se inicia un gesto, el navegador cruza los valores de <code>touch-action</code> del elemento tocado y todos sus antepasados ​​hasta el que implementa el gesto (en otras palabras, el primer elemento de desplazamiento que contiene). Esto significa que, en la pr&aacute;ctica, <code>touch-action</code> generalmente se aplica solo a elementos individuales que tienen un comportamiento personalizado, sin necesidad de especificar <code>touch-action</code> expl&iacute;citamente en ninguno de los descendientes de ese elemento. Despu&eacute;s de que un gesto ha comenzado, los cambios en <strong>los</strong> valores de <strong>acci&oacute;n t&aacute;ctil</strong> no tendr&aacute;n ning&uacute;n impacto en el comportamiento del gesto actual.
ko: 제스처가 시작되면 브라우저 는 터치 된 요소와 모든 조상 의 <code>touch-action</code> 값을 제스처를 구현하는 것 (즉, 첫 번째 포함 스크롤 요소)까지 교차시킵니다 . 따라서 실제로 <code>touch-action</code> 은 일반적으로 해당 요소의 하위 항목에 대해 <code>touch-action</code> 명시 적으로 지정할 필요없이 일부 사용자 지정 동작이있는 개별 요소에만 적용됩니다 . 제스처가 시작된 후 <strong>터치 동작</strong> 값을 변경해도 현재 제스처의 동작에 영향을 미치지 않습니다.
zh_cn: 当手势开始时，浏览器将被触摸元素及其所有祖先的 <code>touch-action</code> 值相交，直到实现该手势的元素（换句话说，第一个包含滚动元素）。这意味着实际上， <code>touch-action</code> 通常仅应用于具有某些自定义行为的单个元素，而无需在该元素的任何后代中明确指定 <code>touch-action</code> 。手势开始后，更改<strong>触摸动作</strong>值将不会对当前手势的行为产生任何影响。

source: When a gesture is started, the browser intersects the <code>touch-action</code> values of the touched element and its ancestors, up to the one that implements the gesture (in other words, the first containing scrolling element). This means that in practice, <code>touch-action</code> is typically applied only to top-level elements which have some custom behavior, without needing to specify <code>touch-action</code> explicitly on any of that element's descendants.
ko: 제스처가 시작되면 브라우저 는 제스처를 구현하는 요소 (즉, 스크롤링 요소를 포함하는 첫 번째 요소)까지 터치 된 요소 및 해당 조상 의 <code>touch-action</code> 값과 교차합니다 . 즉, 실제로 <code>touch-action</code> 은 일반적으로 해당 요소의 하위 항목에 대해 명시 적으로 <code>touch-action</code> 을 지정할 필요없이 일부 사용자 지정 동작이있는 최상위 요소에만 적용됩니다 .
zh_cn: 当开始手势时，浏览器将被触摸元素及其祖先的 <code>touch-action</code> 值相交，直到实现该手势的元素（换句话说，第一个包含滚动元素）。这意味着实际上， <code>touch-action</code> 通常仅应用于具有某些自定义行为的顶级元素，而无需在该元素的任何后代中明确指定 <code>touch-action</code> 。

source: When a given font includes capital letter glyphs of multiple different sizes, this property selects the most appropriate ones. If petite capital glyphs are not available, they are rendered using small capital glyphs. If these are not present, the browser synthesizes them from the uppercase glyphs.
es: Cuando una fuente dada incluye glifos en mayúsculas de múltiples tamaños diferentes,esta propiedad selecciona los más apropiados.Si no se dispone de glifos en mayúsculas pequeñas,se renderizan utilizando glifos en mayúsculas pequeñas.Si no están presentes,el navegador los sintetiza a partir de los glifos en mayúscula.
ko: 지정된 글꼴에 여러 크기의 대문자 글리프가 포함 된 경우이 속성은 가장 적합한 글꼴을 선택합니다. 작은 대문자 글리프를 사용할 수없는 경우 작은 대문자 글리프를 사용하여 렌더링됩니다. 이들이 없으면 브라우저는 대문자 글리프에서이를 합성합니다.
zh_cn: 当给定字体包括多个不同大小的大写字母字形时,该属性会选择最合适的字形。如果没有小写字母字形,则使用小写字母字形呈现。如果这些字形不存在,浏览器会从大写字母字形中合成它们。
