Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/css/css.*.017.xlf
Languages: es, ko, zh_cn

source: When there is more content than can fit into a container, an overflow situation occurs. Understanding how overflow behaves is important in dealing with any element with a constrained size in CSS. This guide explains how overflow works when working with normal flow.
es: Cuando hay más contenido del que puede caber en un contenedor,se produce una situación de desbordamiento.Entender cómo se comporta el desbordamiento es importante para tratar con cualquier elemento con un tamaño limitado en CSS.Esta guía explica cómo funciona el desbordamiento cuando se trabaja con flujo normal.
ko: 컨테이너에 넣을 수있는 것보다 많은 내용이 있으면 오버플로 상황이 발생합니다. CSS에서 크기가 제한된 요소를 처리 할 때는 오버플로 동작을 이해하는 것이 중요합니다. 이 안내서는 정상 흐름으로 작업 할 때 오버플로가 작동하는 방식을 설명합니다.
zh_cn: 当有更多的内容可以容纳到一个容器中时,就会出现溢出的情况。理解溢出的行为方式对于处理CSS中任何尺寸受限的元素是很重要的。本指南解释了在使用正常流程时,溢出是如何工作的。

source: When things don&rsquo;t work as expected
es: Cuando las cosas no funcionan como se esperaba
ko: 상황이 예상대로 작동하지 않을 때
zh_cn: 当事情没有按预期进行时

source: When this property is unspecified, the same characteristics of the <code>visiblePainted</code> value apply to SVG content.
es: Cuando esta propiedad no se especifica, las mismas caracter&iacute;sticas del valor <code>visiblePainted</code> se aplican al contenido SVG.
ko: 이 속성을 지정하지 않으면 <code>visiblePainted</code> 값 과 동일한 특성이 SVG 내용에 적용됩니다.
zh_cn: 当未指定此属性时， <code>visiblePainted</code> 值的相同特征将应用于SVG内容。

source: When to use the box values
es: Cuándo usar los valores de la caja
ko: 상자 값을 사용하는 경우
zh_cn: 何时使用方框值

source: When used as laid out box size for <a href="width"><code>width</code></a>, <a href="height"><code>height</code></a>, <a href="min-width"><code>min-width</code></a>, <a href="min-height"><code>min-height</code></a>, <a href="max-width"><code>max-width</code></a> and <a href="max-height"><code>max-height</code></a> the maximum and minimum sizes refer to the content size.
ko: <a href="width"> <code>width</code> </a> , <a href="height"> <code>height</code> </a> , <a href="min-width"> <code>min-width</code> </a> , <a href="min-height"> <code>min-height</code> </a> , <a href="max-width"> <code>max-width</code> </a> 및 <a href="max-height"> <code>max-height</code> </a> 의 레이아웃 상자 크기로 사용되는 경우 최대 및 최소 크기는 콘텐츠 크기를 나타냅니다.
zh_cn: 当用作<a href="width"> <code>width</code> </a>，<a href="height"> <code>height</code> </a>，<a href="min-width"> <code>min-width</code> </a>，<a href="min-height"> <code>min-height</code> </a>，<a href="max-width"> <code>max-width</code> </a>和<a href="max-height"> <code>max-height</code> </a>的布局框大小时，最大和最小大小指的是内容大小。

source: When using <code>font-variation-settings</code> it is important to note that axis names are case-sensitive. The registered axis names must be in lower case, and custom axes must be in upper case. For example:
es: Cuando se utiliza <code>font-variation-settings</code> , es importante tener en cuenta que los nombres de eje distinguen entre may&uacute;sculas y min&uacute;sculas. Los nombres de los ejes registrados deben estar en min&uacute;sculas y los ejes personalizados deben estar en may&uacute;sculas. Por ejemplo:
ko: 사용하는 경우 <code>font-variation-settings</code> 이 축 이름은 대소 문자를 구분하는 것이 중요하다. 등록 된 축 이름은 소문자 여야하고 사용자 지정 축은 대문자 여야합니다. 예를 들면 다음과 같습니다.
zh_cn: 使用 <code>font-variation-settings</code> ，请务必注意，轴名称区分大小写。注册的轴名称必须小写，自定义轴必须大写。例如：

source: When using <code>min()</code> to set a maximum font size, ensure that the font can still be scaled at least 200% for readability (without assistive technology like a zoom function).
ko: 사용시 <code>min()</code> , 최대 폰트 크기를 설정하는 폰트 정지 (줌 기능과 같은 보조 기술없이) 가독성 적어도 200 %로 축소 될 수 있도록한다.
zh_cn: 使用 <code>min()</code> 设置最大字体大小时，请确保仍可以将字体缩放至少200％，以提高可读性（不使用诸如缩放功能之类的辅助技术）。

source: When using <code>scrollbar-color</code> property with specific color values, authors should ensure the specified colors have enough contrast between them. For keyword values, UAs should ensure the colors they use have enough contrast. See <a href="https://www.w3.org/TR/WCAG20-TECHS/G183.html">Techniques for WCAG 2.0: G183: Using a contrast ratio of 3:1</a>.
ko: 특정 색상 값과 함께 <code>scrollbar-color</code> 속성을 사용할 때 작성자는 지정된 색상 사이에 충분한 대비가 있는지 확인해야합니다. 키워드 값의 경우 UA는 사용하는 색상의 대비가 충분한 지 확인해야합니다. <a href="https://www.w3.org/TR/WCAG20-TECHS/G183.html">WCAG 2.0 기술 : G183 : 3 : 1의 명암비 사용을</a> 참조하십시오 .
zh_cn: 当使用具有特定颜色值的 <code>scrollbar-color</code> 属性时，作者应确保指定的颜色之间具有足够的对比度。对于关键字值，UA应确保它们使用的颜色具有足够的对比度。请参阅<a href="https://www.w3.org/TR/WCAG20-TECHS/G183.html">WCAG 2.0技术：G183：使用3：1的对比度</a>。

source: When using CSS Grid you can name lines on your grid and then position items based on those names rather than the line number. The line names on the parent grid are passed into the subgrid, and you can place items using them. In the below example I have named lines on the parent <code>col-start</code> and <code>col-end</code> and then used those to place the subitem.
ko: CSS 그리드를 사용할 때 그리드에서 라인 이름을 지정한 다음 라인 번호가 아닌 해당 이름을 기준으로 항목을 배치 할 수 있습니다. 상위 그리드의 라인 이름은 서브 그리드로 전달되며이를 사용하여 항목을 배치 할 수 있습니다. 아래 예에서는 부모 <code>col-start</code> 및 <code>col-end</code> 에 줄 이름을 지정한 다음 하위 항목을 배치하는 데 사용했습니다.
zh_cn: 使用CSS Grid时，您可以在网格上命名行，然后根据这些名称而不是行号来定位项目。父网格上的行名称将传递到子网格中，您可以使用它们来放置项目。在下面的示例中，我在父项 <code>col-start</code> 和 <code>col-end</code> 上命名了行，然后使用它们放置了子项。

source: When using an angle, <code>0deg</code> creates a vertical gradient running bottom to top, <code>90deg</code> creates a horizontal gradient running left to right, and so on in a clockwise direction. Negative angles run in the counterclockwise direction.
es: Cuando se usa un &aacute;ngulo, <code>0deg</code> crea un gradiente vertical que se extiende de abajo hacia arriba, <code>90deg</code> crea un gradiente horizontal que se extiende de izquierda a derecha, y as&iacute; sucesivamente en el sentido de las agujas del reloj. Los &aacute;ngulos negativos corren en sentido antihorario.
ko: 각도를 사용하는 경우, <code>0deg</code> 가기 하단 실행 수직 그라디언트 생성 <code>90deg</code> 등 시계 방향으로 왼쪽에서 오른쪽으로 수평 실행 구배를 생성한다. 음의 각도는 반 시계 방향으로 진행됩니다.
zh_cn: 使用角度时， <code>0deg</code> 会创建从下到上的垂直渐变， <code>90deg</code> 会创建从左到右的水平渐变，依此类推。负角沿逆时针方向延伸。

source: When using an image with no intrinsic dimensions but an intrinsic ratio, things work similarly.
es: Cuando se utiliza una imagen sin dimensiones intrínsecas pero con una proporción intrínseca,las cosas funcionan de manera similar.
ko: 고유 치수가없고 고유 비율을 가진 이미지를 사용할 때 사물도 비슷하게 작동합니다.
zh_cn: 当使用一个没有内在尺寸但有内在比例的图像时,情况也是如此。

source: When using both properties together you may get fewer columns than specified in the value for <code>column-count</code>.
es: Al usar ambas propiedades juntas, puede obtener menos columnas de las especificadas en el valor de <code>column-count</code> .
ko: 두 속성을 함께 사용하면 <code>column-count</code> 값에 지정된 것보다 적은 수의 열을 얻을 수 있습니다 .
zh_cn: 同时使用这两个属性时，您获得的列可能少于 <code>column-count</code> 的值中指定的列。

source: When using one or two unitless values, flex-basis changes from auto to 0. More information can be found in the draft for the <a href="https://drafts.csswg.org/css-flexbox/#flex-common">Flexible Box Layout Module.</a>
es: Cuando se usan uno o dos valores sin unidades, la base flexible cambia de autom&aacute;tico a 0. Se puede encontrar m&aacute;s informaci&oacute;n en el borrador del <a href="https://drafts.csswg.org/css-flexbox/#flex-common">M&oacute;dulo de dise&ntilde;o de caja flexible.</a>
ko: 하나 또는 두 개의 단위가없는 값을 사용하는 경우 플렉스 기준이 자동에서 0으로 변경됩니다. 자세한 내용은 <a href="https://drafts.csswg.org/css-flexbox/#flex-common">플렉시블 박스 레이아웃 모듈</a> 초안에서 찾을 수 있습니다 .
zh_cn: 当使用一个或两个无单位值时，伸缩基础将从自动更改为0。更多信息可在&ldquo; <a href="https://drafts.csswg.org/css-flexbox/#flex-common">柔性箱布局模块&rdquo;</a>的草稿中找到。

source: When using scrollbar-color property with specific color values, authors should ensure the specified colors have enough contrast between them. For keyword values, UAs should ensure the colors they use have enough contrast. See <a href="https://www.w3.org/TR/WCAG20-TECHS/G183.html">Techniques for WCAG 2.0: G183: Using a contrast ratio of 3:1</a>.
es: Al usar la propiedad de color de la barra de desplazamiento con valores de color espec&iacute;ficos, los autores deben asegurarse de que los colores especificados tengan suficiente contraste entre ellos. Para los valores de palabras clave, los UA deben garantizar que los colores que usan tengan suficiente contraste. Consulte <a href="https://www.w3.org/TR/WCAG20-TECHS/G183.html">T&eacute;cnicas para WCAG 2.0: G183: Uso de una relaci&oacute;n de contraste de 3: 1</a> .
ko: 특정 색상 값과 함께 스크롤 막대 색상 속성을 사용하는 경우 작성자는 지정된 색상이 충분한 대비를 갖도록해야합니다. 키워드 값의 경우 UA는 사용하는 색상의 대비가 충분한 지 확인해야합니다. <a href="https://www.w3.org/TR/WCAG20-TECHS/G183.html">WCAG 2.0 기술 : G183 : 3 : 1의 명암비 사용을</a> 참조하십시오 .
zh_cn: 当使用具有特定颜色值的scrollbar-color属性时，作者应确保指定的颜色之间具有足够的对比度。对于关键字值，UA应确保它们使用的颜色具有足够的对比度。请参阅<a href="https://www.w3.org/TR/WCAG20-TECHS/G183.html">WCAG 2.0技术：G183：使用3：1的对比度</a>。

source: When using the <code>viewport-fit</code> descriptor, one must keep in mind that not all device displays are rectangular, and should therefore make use of the <a href="../env">safe area inset variables</a>.
ko: <code>viewport-fit</code> 설명자를 사용할 때 모든 기기 디스플레이가 직사각형이 아니므로 <a href="../env">안전 영역 삽입 변수를</a> 사용해야한다는 점을 명심해야 합니다 .
zh_cn: 使用 <code>viewport-fit</code> 描述符时，必须记住，并非所有设备的显示都是矩形的，因此应使用<a href="../env">安全区域插入变量</a>。

source: When using the box alignment properties you will align content on one of two axes &mdash; the inline (or main) axis, and the block (or cross) axis. The inline axis is the axis along which words in a sentence flow in the writing mode being used &mdash; for English, for example, the inline axis is horizontal. The block axis is the axis along which blocks, such as paragraph elements, are laid out and it runs across the Inline axis.
es: Al usar las propiedades de alineaci&oacute;n de cajas, alinear&aacute; el contenido en uno de los dos ejes: el eje en l&iacute;nea (o principal) y el eje de bloque (o cruz). El eje en l&iacute;nea es el eje a lo largo del cual las palabras en una oraci&oacute;n fluyen en el modo de escritura que se est&aacute; utilizando; en ingl&eacute;s, por ejemplo, el eje en l&iacute;nea es horizontal. El eje del bloque es el eje a lo largo del cual se presentan los bloques, como los elementos de p&aacute;rrafo, y se ejecuta a trav&eacute;s del eje en l&iacute;nea.
ko: 상자 정렬 속성을 사용하면 인라인 (또는 주) 축과 블록 (또는 십자) 축 중 하나의 축에 내용이 정렬됩니다. 인라인 축은 쓰기 모드에서 문장 흐름의 단어가 따라가는 축입니다. 예를 들어 영어의 경우 인라인 축은 수평입니다. 블록 축은 단락 요소와 같은 블록이 배치되고 인라인 축을 가로 지르는 축입니다.
zh_cn: 使用框对齐属性时，将在两个轴之一（内联（或主轴）轴和块（或交叉）轴）上对齐内容。内联轴是在使用写作模式的句子中单词沿其流动的轴，例如对于英语，内联轴是水平的。块轴是放置诸如段落元素之类的块并沿Inline轴延伸的轴。

source: When viewing CSS property value syntax in a CSS specification or the MDN property page, allowable keywords will be listed in the following form. The following values are the pre-defined keyword values allowed for <a href="float"><code>float</code></a>.
ko: CSS 사양 또는 MDN 속성 페이지에서 CSS 속성 값 구문을 볼 때 허용 가능한 키워드는 다음 형식으로 나열됩니다. 다음 값은 <a href="float"> <code>float</code> 에</a> 허용되는 사전 정의 된 키워드 값 입니다.
zh_cn: 在CSS规范或MDN属性页中查看CSS属性值语法时，将以以下形式列出允许的关键字。以下值是<a href="float"> <code>float</code> </a>允许的预定义关键字值。

source: When we describe flexbox as being one dimensional we are describing the fact that flexbox deals with layout in one dimension at a time &mdash; either as a row or as a column. This can be contrasted with the two-dimensional model of <a href="../css_grid_layout">CSS Grid Layout</a>, which controls columns and rows together.
es: Cuando describimos flexbox como unidimensional, estamos describiendo el hecho de que flexbox trata con el dise&ntilde;o en una dimensi&oacute;n a la vez, ya sea como una fila o como una columna. Esto se puede contrastar con el modelo bidimensional de <a href="../css_grid_layout">CSS Grid Layout</a> , que controla las columnas y las filas juntas.
ko: 우리는 flexbox를 1 차원으로 설명 할 때 flexbox가 한 번에 한 차원에서 행 또는 열로 레이아웃을 처리한다는 사실을 설명합니다. 이것은 열과 행을 함께 제어하는 <a href="../css_grid_layout">CSS 그리드 레이아웃</a> 의 2 차원 모델과 대조 될 수 있습니다 .
zh_cn: 当我们将flexbox描述为一维时，我们所描述的事实是flexbox一次处理一个维度中的布局-无论是行还是列。这可以与<a href="../css_grid_layout">CSS Grid Layout</a>的二维模型形成对照，后者可以同时控制列和行。

source: When we have a set of items that we want to display horizontally, we may well end up with additional space. We need to decide what to do with that space, and have a couple of options. We either display the space outside of the items &mdash; therefore spacing them out with white space between or around them &mdash; or we absorb the extra space inside the items and therefore need a method of allowing the items to grow and take up this space.
es: Cuando tenemos un conjunto de elementos que queremos mostrar horizontalmente, podemos terminar con espacio adicional. Necesitamos decidir qu&eacute; hacer con ese espacio y tener un par de opciones. O mostramos el espacio fuera de los elementos, por lo tanto, los separamos con un espacio en blanco entre ellos o alrededor de ellos, o absorbemos el espacio adicional dentro de los elementos y, por lo tanto, necesitamos un m&eacute;todo para permitir que los elementos crezcan y ocupen este espacio.
ko: 가로로 표시하려는 항목 세트가 있으면 추가 공간이 생길 수 있습니다. 우리는 그 공간으로 무엇을해야할지 결정해야하며 몇 가지 옵션이 있습니다. 우리는 아이템 바깥 공간을 표시하여 아이템들 사이 또는 그 주변에 공백을 두어 간격을 두거나 아이템 안의 여분의 공간을 흡수하므로 아이템이이 공간을 확장하고 차지할 수있는 방법이 필요합니다.
zh_cn: 当我们有一组要水平显示的项目时，最终可能会有更多空间。我们需要决定如何处理该空间，并有两个选择。我们要么显示项目外部的空间（因此将它们之间或周围的空白隔开），要么吸收项目内部的多余空间，因此需要一种允许项目增长并占用该空间的方法。

source: When we specify our grid area using the <code>grid-area</code> property we first define both start lines <code>block-start</code> and <code>inline-start</code>, then both end lines <code>block-end</code> and <code>inline-end</code>. This seems unusual at first as we are used to the physical properties of top, right, bottom and left but makes more sense if you start to think of websites as being multi-directional in writing mode.
es: Cuando especificamos nuestra &aacute;rea de cuadr&iacute;cula utilizando la propiedad de <code>grid-area</code> , primero definimos las l&iacute;neas de inicio <code>block-start</code> y <code>inline-start</code> , luego las dos l&iacute;neas de finalizaci&oacute;n <code>block-end</code> y <code>inline-end</code> . Esto parece inusual al principio ya que estamos acostumbrados a las propiedades f&iacute;sicas de arriba, derecha, abajo e izquierda, pero tiene m&aacute;s sentido si comienzas a pensar que los sitios web son multidireccionales en el modo de escritura.
ko: <code>grid-area</code> 속성을 사용하여 그리드 영역을 지정하면 먼저 start line <code>block-start</code> 와 <code>inline-start</code> 를 정의한 다음 end line 모두 end <code>block-end</code> 와 <code>inline-end</code> 를 정의 합니다. 맨 처음, 오른쪽, 아래쪽 및 왼쪽의 물리적 속성에 익숙하기 때문에 처음에는 이례적인 것처럼 보이지만 웹 사이트를 쓰기 모드에서 다중 방향으로 생각하기 시작하면 더 의미가 있습니다.
zh_cn: 当我们使用 <code>grid-area</code> 属性指定网格区域时，我们首先定义了start line <code>block-start</code> 和 <code>inline-start</code> ，然后定义了end line <code>block-end</code> 和 <code>inline-end</code> 。乍一看，这似乎很不寻常，因为我们习惯了顶部，右侧，底部和左侧的物理属性，但是如果您开始认为网站在写作模式下是多方向的，那就更有意义了。

source: When working with a site in a writing mode other than a horizontal, top to bottom one, or when using writing modes for creative reasons, being able to relate to the flow of the content makes a lot of sense.
es: Cuando se trabaja con un sitio en un modo de escritura que no sea horizontal,de arriba a abajo,o cuando se utilizan modos de escritura por razones creativas,tener la posibilidad de relacionarse con el flujo del contenido tiene mucho sentido.
ko: 가로, 위에서 아래가 아닌 쓰기 모드로 사이트를 작업하거나 독창적 인 이유로 쓰기 모드를 사용하는 경우 콘텐츠의 흐름과 관련이있을 수 있습니다.
zh_cn: 当以横向的、从上到下的写作模式以外的写作模式来处理网站时,或者出于创作的需要而使用写作模式时,能够联系到内容的流程是非常有意义的。

source: When working with flexbox you need to think in terms of two axes &mdash; the main axis and the cross axis. The main axis is defined by the <a href="../flex-direction"><code>flex-direction</code></a> property, and the cross axis runs perpendicular to it. Everything we do with flexbox refers back to these axes, so it is worth understanding how they work from the outset.
es: Al trabajar con flexbox, debe pensar en t&eacute;rminos de dos ejes: el eje principal y el eje transversal. El eje principal est&aacute; definido por la propiedad de <a href="../flex-direction"> <code>flex-direction</code> </a> , y el eje transversal corre perpendicular a &eacute;l. Todo lo que hacemos con flexbox se refiere a estos ejes, por lo que vale la pena entender c&oacute;mo funcionan desde el principio.
ko: flexbox로 작업 할 때는 주축과 횡축의 두 축을 고려해야합니다. 주축은 <a href="../flex-direction"> <code>flex-direction</code> </a> 속성에 의해 정의되며 횡축은 수직으로 실행됩니다. 우리가 flexbox로하는 모든 것은 이러한 축을 참조하므로 처음부터 어떻게 작동하는지 이해할 가치가 있습니다.
zh_cn: 使用flexbox时，您需要考虑两个轴-主轴和交叉轴。主轴由<a href="../flex-direction"> <code>flex-direction</code> </a>属性定义，而横轴垂直于其延伸。我们对flexbox所做的一切都涉及这些轴，因此值得一开始就了解它们的工作方式。

source: When working with grid layout you have two axes available to align things against &ndash; the <em>block axis</em> and the <em>inline axis</em>. The block axis is the axis upon which blocks are laid out in block layout. If you have two paragraphs on your page they display one below the other, so it is this direction we describe as the block axis.
es: Al trabajar con el dise&ntilde;o de cuadr&iacute;cula, tiene dos ejes disponibles para alinear las cosas: el <em>eje</em> del <em>bloque</em> y el <em>eje en l&iacute;nea</em> . El eje del bloque es el eje sobre el cual se colocan los bloques en el dise&ntilde;o del bloque. Si tiene dos p&aacute;rrafos en su p&aacute;gina, se muestran uno debajo del otro, por lo que es en esta direcci&oacute;n que describimos como el eje del bloque.
ko: 그리드 레이아웃으로 작업 할 때 <em>블록 축</em> 과 <em>인라인 축</em> 에 대해 두 개의 축을 정렬 할 수 있습니다 . 블록 축은 블록 레이아웃에서 블록이 배치되는 축입니다. 페이지에 두 개의 단락이있는 경우 한 단락이 다른 단락 아래에 표시되므로이 방향이 블록 축입니다.
zh_cn: 使用网格布局时，有两个轴可用于对齐东西- <em>块轴</em>和<em>内联轴</em>。块轴是按块布局在其上布置块的轴。如果页面上有两个段落，它们将在另一个段落的下方显示，因此我们将此方向称为块轴。

source: When wrapping flex items, the need to space them out is likely to arise. At the current time we do not have any implementations of the gap properties from the <a href="https://www.w3.org/TR/css-align-3/">Box Alignment module</a> for Flexbox. In the future we will be able to simply use <code>row-gap</code> and <code>column-gap</code> for flexbox as we do for CSS Grid. At the current time you will need to use margins to achieve this.
es: Al envolver art&iacute;culos flexibles, es probable que surja la necesidad de espaciarlos. En este momento no tenemos implementaciones de las propiedades de espacio del <a href="https://www.w3.org/TR/css-align-3/">m&oacute;dulo Box Alignment</a> para Flexbox. En el futuro, podremos simplemente usar <code>row-gap</code> y <code>column-gap</code> para flexbox como lo hacemos para CSS Grid. En este momento necesitar&aacute; usar m&aacute;rgenes para lograr esto.
ko: 플렉스 품목을 포장 할 때 공간을 확보해야 할 가능성이 있습니다. 현재 Flexbox 용 <a href="https://www.w3.org/TR/css-align-3/">Box Alignment 모듈</a> 의 gap 속성 구현이 없습니다 . 앞으로 CSS 그리드 에서처럼 Flexbox에 <code>row-gap</code> 및 <code>column-gap</code> 간격 을 간단히 사용할 수있게됩니다 . 현재는이를 달성하기 위해 마진을 사용해야합니다.
zh_cn: 包装弹性物品时，可能需要将它们隔开。目前，我们没有Flexbox 的&ldquo; <a href="https://www.w3.org/TR/css-align-3/">框对齐&rdquo;模块</a>中的间隙属性的任何实现。将来，我们将能够像对CSS Grid一样简单地对flexbox 使用 <code>row-gap</code> 和 <code>column-gap</code> 。目前，您将需要使用边距来实现此目的。

source: When you add <code>display: grid</code> to a grid container, only the direct children become grid items and can then be placed on the grid that you have created. The children of these items display in normal flow.
ko: <code>display: grid</code> 를 그리드 컨테이너에 추가 하면 직계 하위 항목 만 그리드 항목이되고 생성 한 그리드에 배치 될 수 있습니다. 이러한 항목의 자식은 정상적인 흐름으로 표시됩니다.
zh_cn: 在将 <code>display: grid</code> 添加到网格容器时，只有直接子级才成为网格项，然后可以放置在您创建的网格上。这些项目的子级以正常流程显示。

source: When you customize scrollbars, consider they have enough contrast and that their hit area is large enough for people who use touch input.
ko: 스크롤바를 사용자 정의 할 때 대비가 충분하고 히트 영역이 터치 입력을 사용하는 사람들에게 충분히 큰지 고려하십시오.
zh_cn: 当你定制滚动条时,要考虑它们有足够的对比度,并且它们的点击区域要足够大,以方便使用触摸输入的人。

source: When you do anything to remove, or shift an item from where it would be placed in normal flow, you can expect to need to do some managing of the content and the content around it to prevent overlaps. Whether that involves clearing floats, or ensuring that an element with <code>position: absolute</code> does not sit on top of some other content. For this reason methods which remove elements from being in-flow should be used with understanding of the effect that they have.
es: Cuando hace algo para eliminar o cambiar un elemento desde donde se colocar&iacute;a en el flujo normal, puede esperar tener que administrar el contenido y el contenido a su alrededor para evitar superposiciones. Ya sea que eso implique despejar flotadores o garantizar que un elemento con <code>position: absolute</code> no se asiente sobre otro contenido. Por esta raz&oacute;n, los m&eacute;todos que eliminan elementos de estar en flujo deben usarse con la comprensi&oacute;n del efecto que tienen.
ko: 정상적인 흐름으로 배치 할 위치에서 항목을 제거하거나 이동하는 경우 내용이 겹치지 않도록 내용과 내용을 일부 관리해야 할 수 있습니다. 플로트를 지우거나 <code>position: absolute</code> 가 있는 요소를 다른 콘텐츠 위에 두지 않는지 여부 이러한 이유로 유입되는 요소를 제거하는 방법은 그 효과를 이해하면서 사용해야합니다.
zh_cn: 当您进行任何操作以从正常流程中将其删除或将其移出时，您可能需要对内容及其周围的内容进行一些管理，以防止重叠。无论是清除浮点数，还是确保具有 <code>position: absolute</code> 的元素都不会位于其他内容之上。因此，应在了解其影响的情况下使用从流入中除去元素的方法。

source: When you set an item to <code>display: none</code> in order to hide it, the item is removed from the formatting structure of the page. What this means in practice is that counters ignore it, and things like transitions do not run. Using <code>visibility: hidden</code> keeps the box in the formatting structure which is useful in that it still behaves as if it were part of the layout even though the user can&rsquo;t see it.
es: Cuando configura un elemento para <code>display: none</code> para ocultarlo, el elemento se elimina de la estructura de formato de la p&aacute;gina. Lo que esto significa en la pr&aacute;ctica es que los contadores lo ignoran y cosas como las transiciones no se ejecutan. Uso de la <code>visibility: hidden</code> mantiene el cuadro en la estructura de formato, lo cual es &uacute;til porque todav&iacute;a se comporta como si fuera parte del dise&ntilde;o, aunque el usuario no pueda verlo.
ko: 숨길 항목을 <code>display: none</code> 하도록 설정하면 없음 : 페이지의 서식 구조에서 항목이 제거됩니다. 이것이 실제로 의미하는 것은 카운터가이를 무시하고 전환과 같은 것은 실행되지 않는다는 것입니다. <code>visibility: hidden</code> 사용 : 숨김 은 상자를 서식 구조로 유지하여 사용자가 볼 수 없어도 여전히 레이아웃의 일부인 것처럼 동작한다는 점에서 유용합니다.
zh_cn: 当您设置要 <code>display: none</code> 的项目：无以隐藏它时，该项目将从页面的格式结构中删除。实际上，这意味着计数器会忽略它，并且诸如转换之类的事情不会运行。使用 <code>visibility: hidden</code> 将框保留在格式结构中，这很有用，因为即使用户看不到它，它的行为也仍然像布局的一部分一样。

source: When you specify an invalid <code>cubic-bezier</code> curve, CSS ignores the whole property.
es: Cuando especifica una curva de <code>cubic-bezier</code> no v&aacute;lida , CSS ignora toda la propiedad.
ko: 잘못된 <code>cubic-bezier</code> 곡선 을 지정하면 CSS는 전체 속성을 무시합니다.
zh_cn: 当您指定无效的 <code>cubic-bezier</code> 曲线时，CSS会忽略整个属性。

source: When you've got a container with some inline children and you want to put a margin between each child but not have it interfere with the spacing at the end of the row, you might do something like this:
ko: 인라인 자식이있는 컨테이너가 있고 각 자식 사이에 여백을두고 싶지만 행 끝의 간격을 방해하지 않도록하려면 다음과 같이 할 수 있습니다.
zh_cn: 当你有一个带内联子代的容器,你想在每个子代之间留出一个边距,但又不影响行末的间距,你可以这样做。
