Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/css/css.*.017.xlf
Languages: es, ko, zh_cn

source: With the <code>flex-grow</code> property set to a positive integer, flex items can grow along the main axis from their <code>flex-basis</code>. This will cause the item to stretch and take up any available space on that axis, or a proportion of the available space if other items are allowed to grow too.
es: Con la propiedad <code>flex-grow</code> establecida en un n&uacute;mero entero positivo, los elementos flex pueden crecer a lo largo del eje principal desde su <code>flex-basis</code> . Esto har&aacute; que el elemento se estire y ocupe cualquier espacio disponible en ese eje, o una proporci&oacute;n del espacio disponible si otros elementos tambi&eacute;n pueden crecer.
ko: 로 <code>flex-grow</code> 양의 정수에 특성 세트, 플렉스 항목은 자신의 주요 축으로 성장할 수있는 <code>flex-basis</code> . 그러면 항목이 해당 축에서 사용 가능한 공간을 늘리거나 차지하거나 다른 항목도 커질 수있는 경우 사용 가능한 공간의 비율을 차지하게됩니다.
zh_cn: 将 <code>flex-grow</code> 属性设置为正整数后，flex项可以从其 <code>flex-basis</code> 沿主轴增长。这将导致该项目拉伸并占用该轴上的任何可用空间，如果允许其他项目也增长，则将占可用空间的一部分。

source: With the block and inline axis able to change direction, the logical values for the alignment properties start to make more sense.
es: Con el bloque y el eje en línea capaces de cambiar de dirección,los valores lógicos de las propiedades de alineación empiezan a tener más sentido.
ko: 블록과 인라인 축이 방향을 변경할 수 있으므로 정렬 속성의 논리적 값이 더 이해되기 시작합니다.
zh_cn: 块和内联轴能够改变方向,对齐属性的逻辑值开始变得更加合理。

source: With the preference set to <code>false</code>, the property still works with SVGs via <code>chrome://</code> or <code>resource://</code> URLs
es: Con la preferencia establecida en <code>false</code> , la propiedad a&uacute;n funciona con SVG a trav&eacute;s de <code>chrome://</code> o <code>resource://</code> URLs
ko: 환경 설정을 <code>false</code> 로 설정하면 이 속성은 <code>chrome://</code> 또는 <code>resource://</code> URL을 통해 SVG와 계속 작동 합니다.
zh_cn: 在首选项设置为 <code>false</code> 的情况下，该属性仍可通过 <code>chrome://</code> 或 <code>resource://</code> URL 与SVG一起使用

source: With this implementation, the hint content is available even if information is entered into the input field, and the input appears free of preexisting input when the page is loaded. Most screen reading technology will use <code>aria-describedby</code> to read the hint after the input's label text is announced, and the person using the screen reader can mute it if they find the extra information unnecessary.
es: Con esta implementaci&oacute;n, el contenido de la sugerencia est&aacute; disponible incluso si se ingresa informaci&oacute;n en el campo de entrada, y la entrada aparece libre de entrada preexistente cuando se carga la p&aacute;gina. La mayor&iacute;a de la tecnolog&iacute;a de lectura de pantalla utilizar&aacute; <code>aria-describedby</code> para leer la pista despu&eacute;s de que se anuncie el texto de la etiqueta de entrada, y la persona que usa el lector de pantalla puede silenciarlo si encuentra que la informaci&oacute;n adicional es innecesaria.
ko: 이 구현으로 정보가 입력 필드에 입력 되더라도 힌트 컨텐츠를 사용할 수 있으며 페이지가로드 될 때 입력에 기존 입력이없는 것으로 나타납니다. 대부분의 화면 읽기 기술은 입력의 레이블 텍스트가 발표 된 후 힌트를 읽는 데 <code>aria-describedby</code> 사용하며, 화면 판독기를 사용하는 사람은 추가 정보가 필요하지 않은 경우이를 숨길 수 있습니다.
zh_cn: 使用此实现，即使在输入字段中输入了信息，提示内容仍然可用，并且在加载页面时，该输入看起来没有预先存在的输入。在宣布输入标签的文本后，大多数屏幕阅读技术都将使用 <code>aria-describedby</code> 来读取提示，并且使用屏幕阅读器的人可以在不需要额外信息的情况下将其静音。

source: With this notation, it is possible to describe, and therefore compose, most common transformations: rotations, scaling, or skewing. (In fact, all transformations that are linear functions can be described.) Composite transformations are effectively applied in order from right to left.
es: Con esta notación es posible describir,y por lo tanto componer,las transformaciones más comunes:rotaciones,escaladas o desviaciones.(De hecho,se pueden describir todas las transformaciones que son funciones lineales.)Las transformaciones compuestas se aplican efectivamente en orden de derecha a izquierda.
ko: 이 표기법을 사용하면 가장 일반적인 변형 (회전, 크기 조정 또는 기울이기)을 설명하고 구성 할 수 있습니다. (사실 선형 함수 인 모든 변환에 대해 설명 할 수 있습니다.) 복합 변환은 오른쪽에서 왼쪽으로 효과적으로 적용됩니다.
zh_cn: 使用这种符号,可以描述,因此可以组成最常见的变换:旋转、缩放或倾斜。(事实上,所有线性函数的变换都可以被描述。)复合变换实际上是按照从右到左的顺序进行的。

source: With two values:
es: Con dos valores:
ko: 두 가지 값으로
zh_cn: 有两个数值:

source: Within a stacking context, child elements are stacked according to the same rules previously explained. Importantly, the <code>z-index</code> values of its child stacking contexts only have meaning in this parent. Stacking contexts are treated atomically as a single unit in the parent stacking context.
ko: 스택 컨텍스트 내에서 하위 요소는 이전에 설명한 것과 동일한 규칙에 따라 스택됩니다. 중요한 것은 하위 스택 컨텍스트 의 <code>z-index</code> 값이이 상위 항목에서만 의미가 있다는 것입니다. 스택 컨텍스트는 상위 스택 컨텍스트에서 단일 단위로 원자 적으로 처리됩니다.
zh_cn: 在堆叠上下文中，子元素将根据先前解释的相同规则进行堆叠。重要的是，其子堆栈上下文的 <code>z-index</code> 值仅在此父对象中具有含义。在父堆栈上下文中，堆栈上下文在原子上被视为一个单元。

source: Within a stacking context, child elements are stacked according to the same rules previously explained. Importantly, the z-index values of its child stacking contexts only have meaning in this parent. Stacking contexts are treated atomically as a single unit in the parent stacking context.
es: Dentro de un contexto de apilamiento,los elementos infantiles se apilan según las mismas reglas explicadas anteriormente.Es importante que los valores del índice z de sus contextos de apilamiento hijo sólo tengan significado en este padre.Los contextos de apilamiento se tratan atómicamente como una sola unidad en el contexto de apilamiento padre.
ko: 스태킹 컨텍스트 내에서 하위 요소는 앞에서 설명한 것과 동일한 규칙에 따라 누적됩니다. 중요하게, 자식 스택 컨텍스트의 z- 색인 값은이 부모에서만 의미가 있습니다. 스택 컨텍스트는 상위 스택 컨텍스트에서 원자 단위로 단일 단위로 처리됩니다.
zh_cn: 在一个堆叠上下文中,子元素按照前面解释的相同规则进行堆叠。重要的是,它的子堆叠上下文的z-index值只有在这个父堆叠上下文中才有意义。堆叠上下文在父堆叠上下文中被原子化地视为一个单一单元。

source: Without changing the origin
es: Sin cambiar el origen
ko: 원점을 변경하지 않고
zh_cn: 在不改变原点的情况下

source: Word breaks should not be used for Chinese/Japanese/Korean (CJK) text. Non-CJK text behavior is the same as for <code>normal</code>.
es: Los saltos de palabras no deben usarse para texto en chino / japon&eacute;s / coreano (CJK). El comportamiento del texto que no es CJK es el mismo que para el <code>normal</code> .
ko: 중국어 / 일본어 / 한국어 (CJK) 텍스트에는 단어 나누기를 사용하면 안됩니다. CJK 이외의 텍스트 동작은 <code>normal</code> 과 동일 합니다.
zh_cn: 中文/日文/韩文（CJK）文字不应使用分词。非CJK文本行为与 <code>normal</code> 相同。

source: Words are broken for line-wrapping only where characters inside the word suggest line break opportunities. See <a href="#Suggesting_line_break_opportunities">Suggesting line break opportunities</a> below for details.
es: Las palabras se separan para el ajuste de l&iacute;nea solo cuando los caracteres dentro de la palabra sugieren oportunidades de salto de l&iacute;nea. Consulte <a href="#Suggesting_line_break_opportunities">Sugerir oportunidades de salto de l&iacute;nea a</a> continuaci&oacute;n para obtener m&aacute;s detalles.
ko: 단어 내의 문자가 줄 바꿈 기회를 제안하는 경우에만 줄 바꿈을 위해 단어가 분리됩니다. 자세한 내용은 아래 <a href="#Suggesting_line_break_opportunities">줄 바꿈 기회 제안</a> 을 참조하십시오.
zh_cn: 仅当单词中的字符暗示换行符时，单词才会换行。有关详细信息，请参见下面的<a href="#Suggesting_line_break_opportunities">建议换行机会</a>。

source: Words are not broken at line breaks, even if characters inside the words suggest line break points. Lines will only wrap at whitespace.
es: Las palabras no se rompen en los saltos de línea,incluso si los caracteres dentro de las palabras sugieren puntos de salto de línea.Las líneas sólo se envuelven en los espacios en blanco.
ko: 단어 안의 문자가 줄 바꿈 지점을 제안하더라도 줄 바꿈에서 단어는 끊어지지 않습니다. 줄은 공백에서만 줄 바꿈됩니다.
zh_cn: 字词不会在换行处断行,即使字词内的字符提示换行点。只有在空白处才会换行。

source: Working Draft
es: Borrador de trabajo
ko: 작업 초안
zh_cn: 工作草案

source: Working from a <code>flex-basis</code> of <code>0</code> this means that the available space is distributed as follows. We need to add up the flex grow factors, then divide the total amount of positive free space in the flex container by that number, which in this case is 4. We then share out the space according to the individual values &mdash; the first item gets one part, the second one part, the third two parts. This means that the third item is twice the size of the first and second items.
es: Trabajar desde una <code>flex-basis</code> de <code>0</code> significa que el espacio disponible se distribuye de la siguiente manera. Necesitamos sumar los factores de crecimiento flexible, luego dividir la cantidad total de espacio libre positivo en el contenedor flexible por ese n&uacute;mero, que en este caso es 4. Luego compartimos el espacio de acuerdo con los valores individuales: el primer elemento se obtiene una parte, la segunda parte, las terceras dos partes. Esto significa que el tercer elemento es dos veces el tama&ntilde;o del primer y segundo elemento.
ko: A로부터 근무 <code>flex-basis</code> 의 <code>0</code> 이 수단의 사용 가능한 공간은 다음과 같이 분산된다. 플렉스 성장 인자를 더한 다음 플렉스 컨테이너에있는 양의 빈 공간의 총량을이 숫자로 나눕니다 (이 경우 4). 그런 다음 개별 값에 따라 공간을 공유합니다. 한 부분, 두 번째 부분, 세 번째 두 부분. 이는 세 번째 항목이 첫 번째 및 두 번째 항목 크기의 두 배임을 의미합니다.
zh_cn: 从工作 <code>flex-basis</code> 的 <code>0</code> ，这意味着可用空间分布如下。我们需要加总flex增长因子，然后将flex容器中的正可用空间总量除以该数字（在本例中为4）。然后，根据各个值共享空间-第一项得到一部分，第二部分，第三部分。这意味着第三项的大小是第一项和第二项的两倍。

source: Working with gradients
ko: 그라디언트 작업
zh_cn: 梯度工作

source: Working with older browsers
es: Trabajando con navegadores antiguos
ko: 이전 브라우저로 작업
zh_cn: 使用旧版浏览器

source: Wrapping and flex-direction
es: Envoltura y flex-dirección
ko: 랩핑 및 플렉스 방향
zh_cn: 缠绕和弯曲方向

source: Wrapping works as you might expect when combined with <code>flex-direction</code>. If <code>flex-direction</code> is set to <code>row-reverse</code> then the items will start from the end edge of the container and lay themselves out in reverse ordered lines.
es: El ajuste funciona como es de esperar cuando se combina con <code>flex-direction</code> . Si <code>flex-direction</code> se establece en <code>row-reverse</code> entonces los art&iacute;culos comenzar&aacute;n desde el borde final del contenedor y se colocar&aacute;n en l&iacute;neas ordenadas en reversa.
ko: <code>flex-direction</code> 과 함께 사용하면 랩핑이 예상대로 작동합니다 . 경우 <code>flex-direction</code> 으로 설정되어 <code>row-reverse</code> 다음 항목은 컨테이너의 끝 가장자리에서 시작 역 명령 라인에 자신을 배치합니다.
zh_cn: 与 <code>flex-direction</code> 结合使用时，包装可以按预期工作。如果 <code>flex-direction</code> 设置为 <code>row-reverse</code> ,则项目将从容器的末端开始，并以相反的顺序排列它们自己。

source: Writing Modes
es: Modos de escritura
ko: 쓰기 모드
zh_cn: 写作模式

source: Writing Modes are more than just left to right and right to left text, and the <code>writing-mode</code> property helps us display text running in other directions. The <a href="../writing-mode"><code>writing-mode</code></a> property can have values of:
es: Los modos de escritura son m&aacute;s que solo texto de izquierda a derecha y de derecha a izquierda, y la propiedad del <code>writing-mode</code> nos ayuda a mostrar el texto que se ejecuta en otras direcciones. La propiedad del <a href="../writing-mode"> <code>writing-mode</code> </a> puede tener valores de:
ko: 쓰기 모드는 텍스트를 왼쪽에서 오른쪽으로, 오른쪽에서 왼쪽을 넘어서서 <code>writing-mode</code> 속성을 사용하면 다른 방향으로 실행중인 텍스트를 표시 할 수 있습니다. <a href="../writing-mode"> <code>writing-mode</code> </a> 속성의 값을 가질 수 있습니다 :
zh_cn: 书写模式不只是从左到右和从右到左的文本，而且 <code>writing-mode</code> 属性可帮助我们显示在其他方向上运行的文本。该<a href="../writing-mode"> <code>writing-mode</code> </a>属性可以具有的值：

source: Writing modes in grid layouts
es: Modos de escritura en diseños de cuadrícula
ko: 그리드 레이아웃의 쓰기 모드
zh_cn: 网格布局的书写模式

source: XBL Reference: Binding Attachment and Detachment
es: Referencia XBL:Acoplamiento y desacoplamiento
ko: XBL 참조 : 바인딩 첨부 및 분리
zh_cn: XBL参考资料。捆绑式附件和分离式附件

source: XBL is deprecated and being removed. See <a href="https://bugzil.la/1397874">bug 1397874</a>.
es: XBL est&aacute; en desuso y se est&aacute; eliminando. Ver <a href="https://bugzil.la/1397874">error 1397874</a> .
ko: XBL은 더 이상 사용되지 않으며 제거됩니다. <a href="https://bugzil.la/1397874">버그 1397874를</a> 참조하십시오 .
zh_cn: XBL已弃用并被删除。看到<a href="https://bugzil.la/1397874">错误1397874</a>。

source: XPath feature
es: Característica de XPath
ko: XPath 기능
zh_cn: XPath特性

source: XUL <a href="image"><code>&lt;image&gt;</code></a> elements and <a href=":-moz-tree-image"><code>:-moz-tree-image</code></a>, <a href=":-moz-tree-twisty"><code>:-moz-tree-twisty</code></a>, and <a href="https://developer.mozilla.org/en-US/docs/Web/CSS/:-moz-tree-checkbox"><code>:-moz-tree-checkbox</code></a> pseudo-elements. <strong>Note:</strong><code>-moz-image-region</code> only works with <a href="image"><code>&lt;image&gt;</code></a> elements where the icon is specified using <a href="list-style-image"><code>list-style-image</code></a>. It will not work with XUL <code>&lt;image src="url" /&gt;</code>.
es: XUL <a href="image"> <code>&lt;image&gt;</code> </a> elementos y <a href=":-moz-tree-image"> <code>:-moz-tree-image</code> </a> , <a href=":-moz-tree-twisty"> <code>:-moz-tree-twisty</code> </a> , y <a href="https://developer.mozilla.org/en-US/docs/Web/CSS/:-moz-tree-checkbox"> <code>:-moz-tree-checkbox</code> </a> pseudo-elementos. <strong>Nota: </strong> <code>-moz-image-region</code> solo funciona con elementos <a href="image"> <code>&lt;image&gt;</code> </a> donde el icono se especifica usando <a href="list-style-image"> <code>list-style-image</code> </a> . No funcionar&aacute; con XUL <code>&lt;image src="url" /&gt;</code> .
ko: XUL <a href="image"> <code>&lt;image&gt;</code> </a> 요소 및 <a href=":-moz-tree-image"> <code>:-moz-tree-image</code> </a> , <a href=":-moz-tree-twisty"> <code>:-moz-tree-twisty</code> </a> 및 <a href="https://developer.mozilla.org/en-US/docs/Web/CSS/:-moz-tree-checkbox"> <code>:-moz-tree-checkbox</code> </a> 의사 요소. <strong>참고 : </strong> <code>-moz-image-region</code> 은 <a href="list-style-image"> <code>list-style-image</code> 를</a> 사용하여 아이콘이 지정된 <a href="image"> <code>&lt;image&gt;</code> </a> 요소 에서만 작동 합니다 . XUL <code>&lt;image src="url" /&gt;</code> 에서는 작동하지 않습니다 .
zh_cn: XUL <a href="image"> <code>&lt;image&gt;</code> </a>元素和<a href=":-moz-tree-image"> <code>:-moz-tree-image</code> </a>，<a href=":-moz-tree-twisty"> <code>:-moz-tree-twisty</code> </a>和<a href="https://developer.mozilla.org/en-US/docs/Web/CSS/:-moz-tree-checkbox"> <code>:-moz-tree-checkbox</code> </a>伪元素。<strong>注意：</strong> <code>-moz-image-region</code> 仅适用于使用<a href="list-style-image"> <code>list-style-image</code> </a>指定图标的<a href="image"> <code>&lt;image&gt;</code> </a>元素。它不适用于XUL <code>&lt;image src="url" /&gt;</code> 。

source: XUL <a href="image"><code>&lt;image&gt;</code></a> elements and <a href="https://developer.mozilla.org/en-US/docs/Web/CSS/:-moz-tree-image"><code>:-moz-tree-image</code></a>, <a href="https://developer.mozilla.org/en-US/docs/Web/CSS/:-moz-tree-twisty"><code>:-moz-tree-twisty</code></a>, and <a href="https://developer.mozilla.org/en-US/docs/Web/CSS/:-moz-tree-checkbox"><code>:-moz-tree-checkbox</code></a> pseudo-elements. <strong>Note:</strong><code>-moz-image-region</code> only works with <a href="image"><code>&lt;image&gt;</code></a> elements where the icon is specified using <a href="list-style-image"><code>list-style-image</code></a>. It will not work with XUL <code>&lt;image src="url" /&gt;</code>.
ko: XUL <a href="image"> <code>&lt;image&gt;</code> </a> 요소 및 <a href="https://developer.mozilla.org/en-US/docs/Web/CSS/:-moz-tree-image"> <code>:-moz-tree-image</code> </a> , <a href="https://developer.mozilla.org/en-US/docs/Web/CSS/:-moz-tree-twisty"> <code>:-moz-tree-twisty</code> </a> 및 <a href="https://developer.mozilla.org/en-US/docs/Web/CSS/:-moz-tree-checkbox"> <code>:-moz-tree-checkbox</code> </a> 의사 요소. <strong>참고 : </strong> <code>-moz-image-region</code> 은 아이콘이 <a href="list-style-image"> <code>list-style-image</code> 를</a> 사용하여 지정된 <a href="image"> <code>&lt;image&gt;</code> </a> 요소 에서만 작동 합니다 . XUL <code>&lt;image src="url" /&gt;</code> 에서는 작동하지 않습니다 .
zh_cn: XUL <a href="image"> <code>&lt;image&gt;</code> </a>元素和<a href="https://developer.mozilla.org/en-US/docs/Web/CSS/:-moz-tree-image"> <code>:-moz-tree-image</code> </a>，<a href="https://developer.mozilla.org/en-US/docs/Web/CSS/:-moz-tree-twisty"> <code>:-moz-tree-twisty</code> </a>和<a href="https://developer.mozilla.org/en-US/docs/Web/CSS/:-moz-tree-checkbox"> <code>:-moz-tree-checkbox</code> </a>伪元素。<strong>注意：</strong> <code>-moz-image-region</code> 仅适用于使用<a href="list-style-image"> <code>list-style-image</code> </a>指定图标的<a href="image"> <code>&lt;image&gt;</code> </a>元素。它不适用于XUL <code>&lt;image src="url" /&gt;</code> 。

source: XUL Tutorial: Introduction to XBL
es: Tutorial de XUL:Introducción al XBL
ko: XUL 튜토리얼 : XBL 소개
zh_cn: XUL教程。XBL简介

source: You (or others) use inline styles on elements themselves. This is considered very bad practice.
es: Usted (u otros)utilizan estilos en línea en los elementos mismos.Esto se considera una muy mala práctica.
ko: 당신 (또는 다른 사람들)은 요소 자체에 인라인 스타일을 사용합니다. 이것은 매우 나쁜 습관으로 간주됩니다.
zh_cn: 你(或其他人)对元素本身使用内联样式。这被认为是非常糟糕的做法。

source: You can "nest" grids by making a grid item a grid container. These grids however are independent of the parent grid and of each other, meaning that they do not take their track sizing from the parent grid. This makes it difficult to line nested grid items up with the main grid.
ko: 그리드 항목을 그리드 컨테이너로 만들어 그리드를 "중첩"할 수 있습니다. 그러나 이러한 그리드는 상위 그리드 및 서로 독립적이므로 상위 그리드에서 트랙 크기를 조정하지 않습니다. 이로 인해 중첩 된 그리드 항목을 주 그리드와 정렬하기가 어렵습니다.
zh_cn: 你可以通过将一个网格项作为网格容器来 "嵌套 "网格。但是这些网格是独立于父网格和相互独立的,这意味着它们不从父网格中获取轨道尺寸。这使得嵌套的网格项难以与主网格对齐。

source: You can (and often need to) combine <code>min()</code> and <code>max()</code> values, or use <code>max()</code> within a <code>clamp()</code> or <code>calc()</code> function.
ko: <code>min()</code> 및 <code>max()</code> 값을 결합 하거나 <code>clamp()</code> 또는 <code>calc()</code> 함수 내에서 <code>max()</code> 사용할 수 있습니다.
zh_cn: 您可以（并且经常需要）组合 <code>min()</code> 和 <code>max()</code> 值，或者在 <code>clamp()</code> 或 <code>calc()</code> 函数中使用 <code>max()</code> 。

source: You can (and often need to) combine <code>min()</code> and <code>max()</code> values, or use <code>min()</code> within a <code>clamp()</code> or <code>calc()</code> function.
ko: <code>min()</code> 및 <code>max()</code> 값을 결합 하거나 <code>clamp()</code> 또는 <code>calc()</code> 함수 내에서 <code>min()</code> 사용할 수 있습니다.
zh_cn: 您可以（并且经常需要）组合 <code>min()</code> 和 <code>max()</code> 值，或者在 <code>clamp()</code> 或 <code>calc()</code> 函数中使用 <code>min()</code> 。

source: You can <a href="https://fullscreen-requestfullscreen-demo.glitch.me/">see this example in action</a> or <a href="https://glitch.com/edit/#!/fullscreen-requestfullscreen-demo">view or remix the code</a> on <a href="http://glitch.com/">Glitch</a>.
es: Puede <a href="https://fullscreen-requestfullscreen-demo.glitch.me/">ver este ejemplo en acci&oacute;n</a> o <a href="https://glitch.com/edit/#!/fullscreen-requestfullscreen-demo">ver o mezclar el c&oacute;digo</a> en <a href="http://glitch.com/">Glitch</a> .
ko: <a href="https://fullscreen-requestfullscreen-demo.glitch.me/">이 예제를 실제로</a> 보거나 <a href="http://glitch.com/">Glitch </a><a href="https://glitch.com/edit/#!/fullscreen-requestfullscreen-demo">의 코드</a> 를 보거나 리믹스 할 수 있습니다 .
zh_cn: 您可以<a href="https://fullscreen-requestfullscreen-demo.glitch.me/">在行动中看到这个例子</a>和<a href="https://glitch.com/edit/#!/fullscreen-requestfullscreen-demo">观点或混音代码</a>的<a href="http://glitch.com/">毛刺</a>。

source: You can <a href="https://mdn.mozillademos.org/files/8179/box-decoration-break-inline.html">try the two inline examples above</a> in your browser.
es: Puede <a href="https://mdn.mozillademos.org/files/8179/box-decoration-break-inline.html">probar los dos ejemplos</a> en l&iacute;nea anteriores en su navegador.
ko: 브라우저에서 <a href="https://mdn.mozillademos.org/files/8179/box-decoration-break-inline.html">위의 두 가지 인라인 예제를 시도</a> 할 수 있습니다 .
zh_cn: 您可以在浏览器中<a href="https://mdn.mozillademos.org/files/8179/box-decoration-break-inline.html">尝试上面的两个内联示例</a>。

source: You can <a href="https://mdn.mozillademos.org/files/8187/box-decoration-break-block.html">try the block examples above</a> in your browser.
es: Puede <a href="https://mdn.mozillademos.org/files/8187/box-decoration-break-block.html">probar los ejemplos de bloque anteriores</a> en su navegador.
ko: 브라우저에서 <a href="https://mdn.mozillademos.org/files/8187/box-decoration-break-block.html">위의 블록 예제를 시도</a> 할 수 있습니다 .
zh_cn: 您可以在浏览器中<a href="https://mdn.mozillademos.org/files/8187/box-decoration-break-block.html">尝试上面的代码块示例</a>。

source: You can add the various Box Values after your Basic Shape definition. Therefore the default behaviour is as if you have defined.
es: Puedes añadir los diferentes valores de caja después de tu definición de forma básica.Por lo tanto,el comportamiento por defecto es como si lo hubieras definido.
ko: 기본 도형 정의 후에 다양한 상자 값을 추가 할 수 있습니다. 따라서 기본 동작은 정의한 것처럼입니다.
zh_cn: 您可以在您的基本形状定义之后添加各种框值。因此,默认的行为与您定义的一样。

source: You can adjust how the replaced element's object's intrinsic size (that is, its natural size) is adjusted to fit within the element's box using the <a href="object-fit"><code>object-fit</code></a> property.
es: Puede ajustar c&oacute;mo se ajusta el tama&ntilde;o intr&iacute;nseco del objeto del elemento reemplazado (es decir, su tama&ntilde;o natural) para que se ajuste dentro del cuadro del elemento utilizando la propiedad de <a href="object-fit"> <code>object-fit</code> </a> del objeto .
ko: <a href="object-fit"> <code>object-fit</code> </a> 속성을 사용하여 교체 된 요소의 객체의 고유 크기 (즉, 자연 크기)를 요소 상자에 맞추는 방법을 조정할 수 있습니다.
zh_cn: 您可以使用<a href="object-fit"> <code>object-fit</code> </a>属性调整如何将替换后的元素的对象的固有大小（即其自然大小）调整为适合元素的框内。

source: You can also add the Box Value that you wish to use as a reference box. In the example below change the reference box from <code>margin-box</code> to <code>border-box</code>, <code>padding-box</code> or <code>content-box</code> to see how the reference box used as the starting point before offsets are calculated changes.
es: Tambi&eacute;n puede agregar el valor del cuadro que desea utilizar como cuadro de referencia. En el ejemplo siguiente cambio el cuadro de referencia de <code>margin-box</code> a <code>border-box</code> , <code>padding-box</code> o <code>content-box</code> para ver c&oacute;mo el cuadro de referencia utilizado como punto de partida antes de desplazamientos se calcula cambios.
ko: 참조 상자로 사용할 상자 값을 추가 할 수도 있습니다. 아래 예에서 참조 상자를 <code>margin-box</code> 에서 <code>border-box</code> , <code>padding-box</code> 또는 <code>content-box</code> 로 변경하여 오프셋 이전의 시작점으로 사용 된 참조 상자가 어떻게 변경되는지 계산하십시오.
zh_cn: 您还可以添加希望用作参考框的&ldquo;框值&rdquo;。在下面的示例中，将参考框从 <code>margin-box</code> 更改为 <code>border-box</code> ， <code>padding-box</code> 或 <code>content-box</code> 以查看如何在计算偏移量之前将参考框用作起点。
