Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/css/css.*.017.xlf
Languages: es, ko, zh_cn

source: We can also use values for this property that you may be familiar with from flexbox; the space distribution values of <code>space-between</code>, <code>space-around</code> and <code>space-evenly</code>. If we update <a href="../align-content"><code>align-content</code></a> to <code>space-between</code>, you can see how the elements on our grid space out:
es: Tambi&eacute;n podemos usar valores para esta propiedad con los que pueda estar familiarizado desde flexbox; los valores de distribuci&oacute;n espacio de <code>space-between</code> , <code>space-around</code> y <code>space-evenly</code> . Si actualizamos <a href="../align-content"> <code>align-content</code> </a> a <code>space-between</code> , puede ver c&oacute;mo se espacian los elementos en nuestra cuadr&iacute;cula:
ko: flexbox에서 익숙한이 속성 값을 사용할 수도 있습니다. 의 공간 분포 값 <code>space-between</code> , <code>space-around</code> 및 <code>space-evenly</code> . <a href="../align-content"> <code>align-content</code> </a> 를 <code>space-between</code> 으로 업데이트 하면 그리드의 요소가 어떻게 공간을 차지하는지 확인할 수 있습니다.
zh_cn: 我们还可以使用您可能在flexbox中熟悉的该属性的值； <code>space-between</code> ， <code>space-around</code> 和 <code>space-evenly</code> 空间的空间分布值。如果<a href="../align-content"> <code>align-content</code> </a>更新为 <code>space-between</code> ，则可以看到网格上的元素如何间隔：

source: We can control the order in which items stack up by using the <code>z-index</code> property - just like positioned items. If we give <code>box2</code> a lower <code>z-index</code> than <code>box1</code> it will display below <code>box1</code> in the stack.
es: Podemos controlar el orden en que los elementos se apilan utilizando la propiedad del <code>z-index</code> , al igual que los elementos posicionados. Si le damos a <code>box2</code> un <code>z-index</code> menor que <code>box1</code> , se mostrar&aacute; debajo de <code>box1</code> en la pila.
ko: 위치가 지정된 항목과 마찬가지로 <code>z-index</code> 속성 을 사용하여 항목이 쌓이는 순서를 제어 할 수 있습니다. 우리 주면 <code>box2</code> 하부 <code>z-index</code> 보다 <code>box1</code> 그 아래에 표시 될 <code>box1</code> 스택이다.
zh_cn: 我们可以使用 <code>z-index</code> 属性来控制项目堆叠的顺序-就像定位的项目一样。如果我们给 <code>box2</code> 的 <code>z-index</code> 值比 <code>box1</code> 低，它将显示在堆栈中 <code>box1</code> 的下方。

source: We can create a similar effect to flexbox, while still keeping the content arranged in strict rows and columns, by creating our track listing using repeat notation and the <code>auto-fill</code> and <code>auto-fit</code> properties.
es: Podemos crear un efecto similar al FlexBox, mientras se mantiene el contenido dispuestos en filas y columnas estrictas, mediante la creaci&oacute;n de nuestra lista de canciones usando la notaci&oacute;n de repetici&oacute;n y de la <code>auto-fill</code> y <code>auto-fit</code> propiedades.
ko: 반복 표기법과 <code>auto-fill</code> 및 <code>auto-fit</code> 속성을 사용하여 트랙 목록을 작성하여 내용을 엄격한 행과 열로 정렬하면서 flexbox와 비슷한 효과를 만들 수 있습니다 .
zh_cn: 通过使用重复符号以及 <code>auto-fill</code> 和 <code>auto-fit</code> 属性来创建曲目列表，我们可以创建与flexbox类似的效果，同时仍将内容按严格的行和列排列。

source: We can create inline flex containers. If you create a flex container using the single value of <code>inline-flex</code> you will have an inline-level box with flex children. The children behave in the same way as the flex children of a block-level container. The only thing that has changed is that the parent is now an inline-level box. It therefore behaves like other inline-level things, and doesn't take up the full width (or size in the inline dimension) that a block-level box does. This means that some following text could come up alongside the flex container.
ko: 인라인 플렉스 컨테이너를 만들 수 있습니다. <code>inline-flex</code> 의 단일 값을 사용하여 플렉스 컨테이너를 만들면 flex 자식이있는 인라인 수준 상자가 생깁니다. 자식은 블록 수준 컨테이너의 flex 자식과 같은 방식으로 동작합니다. 변경된 유일한 것은 부모가 이제 인라인 수준 상자라는 것입니다. 따라서 다른 인라인 수준의 것과 같이 작동하며 블록 수준 상자가 수행하는 전체 너비 (또는 인라인 차원의 크기)를 차지하지 않습니다. 이것은 일부 다음 텍스트가 플렉스 컨테이너와 함께 나타날 수 있음을 의미합니다.
zh_cn: 我们可以创建内联Flex容器。如果使用 <code>inline-flex</code> 的单个值创建flex容器，则将有一个带有flex子级的inline-level框。子级的行为与块级容器的flex子级相同。唯一发生变化的是父级现在是一个内联级别的框。因此，它的行为类似于其他内联级别的东西，并且不像块级盒子那样占用整个宽度（或内联维度的大小）。这意味着可以在flex容器旁边出现一些后续文本。

source: We can look at a list of links and explore how the universal values work. The live example below allows you to play with the CSS and see what happens when you make changes. Playing with code really is the best way to get to grips with HTML and CSS.
ko: 링크 목록을보고 보편적 가치가 작동하는 방식을 탐색 할 수 있습니다. 아래의 라이브 예제를 통해 CSS를 사용하여 변경하면 어떤 일이 발생하는지 확인할 수 있습니다. 코드를 가지고 노는 것이 HTML과 CSS를 이해하는 가장 좋은 방법입니다.
zh_cn: 我们可以看一下链接列表,探讨一下通用值是如何工作的。下面的实战示例可以让你玩玩CSS,看看当你做出改变时会发生什么。玩代码确实是掌握HTML和CSS的最好方法。

source: We can see the same thing happening with columns. The container will need to have a height in order that the items will start wrapping and creating new columns, and items will stretch taller to fill each column completely.
es: Podemos ver que lo mismo ocurre con las columnas.El contenedor deberá tener una altura para que los artículos empiecen a envolverse y a crear nuevas columnas,y los artículos se estirarán más para llenar completamente cada columna.
ko: 우리는 열과 같은 일을 볼 수 있습니다. 항목이 줄 바꿈 및 새 열 만들기를 시작하려면 컨테이너의 높이가 필요하며 각 열을 완전히 채우려면 항목이 더 커집니다.
zh_cn: 我们可以看到同样的事情发生在列上。容器需要有一个高度,这样物品才会开始包裹并创建新的列,物品会被拉伸得更高,以完全填满每个列。

source: We can style text or images in the <a href="content"><code>content</code></a> property almost any way we want.
es: Podemos dise&ntilde;ar texto o im&aacute;genes en la propiedad de <a href="content"> <code>content</code> </a> forma que queramos.
ko: 거의 원하는 방식으로 <a href="content"> <code>content</code> </a> 속성 에서 텍스트 또는 이미지의 스타일을 지정할 수 있습니다 .
zh_cn: 我们几乎可以通过任何方式在<a href="content"> <code>content</code> </a>属性中设置文本或图像的样式。

source: We can take things a step further and define each area with a single property &ndash; <a href="../grid-area"><code>grid-area</code></a>. The order of the values for grid-area are as follows.
es: Podemos llevar las cosas un paso m&aacute;s all&aacute; y definir cada &aacute;rea con una sola propiedad: <a href="../grid-area"> <code>grid-area</code> </a> . El orden de los valores para el &aacute;rea de cuadr&iacute;cula es el siguiente.
ko: 한 걸음 더 나아가서 단일 속성 인 <a href="../grid-area"> <code>grid-area</code> 로</a> 각 영역을 정의 할 수 있습니다 . 그리드 영역의 값 순서는 다음과 같습니다.
zh_cn: 我们可以更进一步，并使用单个属性（<a href="../grid-area"> <code>grid-area</code> </a>定义每个区域。网格区域的值的顺序如下。

source: We can then redefine that layout inside media queries to go to our two columns layout, and perhaps take it to a three column layout if the available space is even wider. Note that for the wide layout I keep my nine column track grid, I redefine where items are placed using <code>grid-template-areas</code>.
es: Luego podemos redefinir ese dise&ntilde;o dentro de las consultas de medios para ir a nuestro dise&ntilde;o de dos columnas, y quiz&aacute;s llevarlo a un dise&ntilde;o de tres columnas si el espacio disponible es a&uacute;n m&aacute;s amplio. Tenga en cuenta que para el dise&ntilde;o ancho mantengo mi cuadr&iacute;cula de seguimiento de nueve columnas, redefinir&eacute; d&oacute;nde se colocan los elementos utilizando <code>grid-template-areas</code> .
ko: 그런 다음 미디어 쿼리 내에서 해당 레이아웃을 재정 의하여 두 개의 열 레이아웃으로 이동하고 사용 가능한 공간이 더 넓은 경우 3 열 레이아웃으로 가져올 수 있습니다. 넓은 레이아웃의 경우 9 개의 열 트랙 그리드를 유지하면서 <code>grid-template-areas</code> 를 사용하여 항목이 배치되는 위치를 재정의 합니다 .
zh_cn: 然后，我们可以在媒体查询中重新定义该布局，以转到两列布局，如果可用空间更大，则可以将其变为三列布局。请注意，对于宽布局，我保留了九列轨迹网格，我使用 <code>grid-template-areas</code> 重新定义了放置项目的位置。

source: We can then use that framework to layout our page. For example, to create a three column layout with a header and footer, I might have the following markup.
es: Podemos usar ese marco para diseñar nuestra página.Por ejemplo,para crear un diseño de tres columnas con un encabezado y un pie de página,podría tener el siguiente marcado.
ko: 그런 다음 해당 프레임 워크를 사용하여 페이지를 레이아웃 할 수 있습니다. 예를 들어 머리글과 바닥 글이 포함 된 3 개의 열 레이아웃을 만들려면 다음과 같은 마크 업이있을 수 있습니다.
zh_cn: 然后,我们可以使用该框架来布局我们的页面。例如,要创建一个带页眉和页脚的三列布局,我可以使用以下标记。

source: We can use line-based placement to control where these items sit on the grid. I would like the first item to start on the far left of the grid and span a single column track. It should also start on the first row line, at the top of the grid and span to the fourth row line.
es: Podemos usar la colocación en línea para controlar dónde se asientan estos elementos en la cuadrícula.Me gustaría que el primer elemento comenzara en el extremo izquierdo de la cuadrícula y abarcara una sola pista de columna.También debería comenzar en la primera línea de la fila,en la parte superior de la cuadrícula y extenderse hasta la cuarta línea de la fila.
ko: 라인 기반 배치를 사용하여 이러한 항목이 그리드에서 배치되는 위치를 제어 할 수 있습니다. 첫 번째 항목이 그리드의 가장 왼쪽에서 시작하여 단일 열 트랙에 걸쳐 있기를 원합니다. 또한 그리드 상단의 첫 번째 행 줄에서 시작하여 네 번째 행 줄에 걸쳐 있어야합니다.
zh_cn: 我们可以使用基于行的位置来控制这些项目在网格中的位置。我希望第一个项目从网格的最左边开始,跨过一列轨道。它也应该从第一行开始,在网格的顶部,并跨越到第四行。

source: We can use other values to control how the items align:
es: Podemos usar otros valores para controlar cómo se alinean los elementos:
ko: 항목을 정렬하는 방법을 제어하기 위해 다른 값을 사용할 수 있습니다.
zh_cn: 我们可以使用其他值来控制项目的排列方式。

source: We create a <em>grid container</em> by declaring <code>display: grid</code> or <code>display: inline-grid</code> on an element. As soon as we do this all <em>direct children</em> of that element will become <em>grid items</em>.
es: Creamos un <em>contenedor de cuadr&iacute;cula</em> declarando <code>display: grid</code> o <code>display: inline-grid</code> en un elemento. Tan pronto como hagamos esto, todos <em>los hijos directos</em> de ese elemento se convertir&aacute;n en <em>elementos de la cuadr&iacute;cula</em> .
ko: 요소에 <code>display: grid</code> 또는 <code>display: inline-grid</code> 를 선언 하여 <em>그리드 컨테이너</em> 를 만듭니다 . 이 작업을 수행하자마자 해당 요소의 모든 <em>직계 자식</em> 이 <em>모눈 항목이</em> 됩니다.<em></em><em></em>
zh_cn: 我们通过在元素上声明 <code>display: grid</code> 或 <code>display: inline-grid</code> 来创建<em>网格容器</em>。一旦执行此操作，该元素的所有<em>直接子代</em>将变为<em>网格项</em>。<em></em><em></em>

source: We create a <em>grid container</em> by declaring <code>display: grid</code> or <code>display: inline-grid</code> on an element. As soon as we do this, all <em>direct children</em> of that element become <em>grid items</em>.
ko: 요소에 <code>display: grid</code> 또는 <code>display: inline-grid</code> 를 선언 하여 <em>그리드 컨테이너</em> 를 만듭니다 . 이렇게 하면 해당 요소의 모든 <em>직계 자식</em> 이 <em>그리드 항목이</em> 됩니다.<em></em><em></em>
zh_cn: 我们通过在元素上声明 <code>display: grid</code> 或 <code>display: inline-grid</code> 来创建<em>网格容器</em>。一旦执行此操作，该元素的所有<em>直接子代</em>都将成为<em>网格项</em>。<em></em><em></em>

source: We create a simple HTML containing a single <a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/div"><code>&lt;div&gt;</code></a> element, including an ampersand, that we want to style with a different font. To make it obvious, we will use a sans-serif font, <em>Helvetica</em>, for the text, and a serif font, <em>Times New Roman</em>, for the ampersand.
es: Creamos un HTML simple que contiene un &uacute;nico elemento <a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/div"> <code>&lt;div&gt;</code> </a> , incluido un ampersand, que queremos dise&ntilde;ar con una fuente diferente. Para hacerlo m&aacute;s obvio, usaremos una fuente sans-serif, <em>Helvetica</em> , para el texto, y una fuente serif, <em>Times New Roman</em> , para el ampersand.
ko: 앰퍼샌드를 포함하여 하나의 <a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/div"> <code>&lt;div&gt;</code> </a> 요소를 포함 하는 간단한 HTML을 만들어 다른 글꼴로 스타일을 지정하려고합니다. 분명히하기 위해 텍스트 에는 산세 리프 글꼴 인 <em>Helvetica</em> 를 사용하고 앰퍼샌드 에는 세리프 글꼴 인 <em>Times New Roman</em> 을 사용합니다.
zh_cn: 我们创建了一个简单的HTML，其中包含一个<a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/div"> <code>&lt;div&gt;</code> </a>元素（包括一个＆符号），我们希望使用其他字体设置样式。为了使其更明显，我们将在文本中使用Sans-serif字体<em>Helvetica</em>，在＆符中使用衬线字体<em>Timess New Roman</em>。

source: We define rows and columns on our grid with the <a href="../grid-template-columns"><code>grid-template-columns</code></a> and <a href="../grid-template-rows"><code>grid-template-rows</code></a> properties. These define grid tracks. A <em>grid track</em> is the space between any two lines on the grid. In the below image you can see a track highlighted &ndash; this is the first row track in our grid.
es: Definimos filas y columnas en nuestra cuadr&iacute;cula con las propiedades de <a href="../grid-template-columns"> <code>grid-template-columns</code> </a> y <a href="../grid-template-rows"> <code>grid-template-rows</code> </a> . Estos definen pistas de cuadr&iacute;cula. Una <em>pista de cuadr&iacute;cula</em> es el espacio entre dos l&iacute;neas cualquiera de la cuadr&iacute;cula. En la imagen a continuaci&oacute;n, puede ver una pista resaltada: esta es la pista de la primera fila de nuestra cuadr&iacute;cula.
ko: <a href="../grid-template-columns"> <code>grid-template-columns</code> </a> 및 <a href="../grid-template-rows"> <code>grid-template-rows</code> </a> 속성으로 그리드의 행과 열을 정의 합니다. 이것들은 그리드 트랙을 정의합니다. <em>그리드 트랙은</em> 그리드에 두 라인 사이의 공간입니다. 아래 이미지에서 강조 표시된 트랙을 볼 수 있습니다. 이것은 그리드의 첫 번째 행 트랙입니다.
zh_cn: 我们使用<a href="../grid-template-columns"> <code>grid-template-columns</code> </a>和<a href="../grid-template-rows"> <code>grid-template-rows</code> </a>属性在网格上定义行和列。这些定义了网格轨迹。甲<em>网格轨道</em>是在网格上的任何两行之间的空间。在下图中，您可以看到一个突出显示的轨道-这是网格中的第一行轨道。

source: We don&rsquo;t have a <code>justify-items</code> or <code>justify-self</code> property available to us on the main axis as our items are treated as a group on that axis. However it is possible to do some individual alignment in order to separate an item or a group of items from others by using auto margins along with flexbox.
es: No tenemos una propiedad <code>justify-items</code> o <code>justify-self</code> disponible para nosotros en el eje principal, ya que nuestros art&iacute;culos se tratan como un grupo en ese eje. Sin embargo, es posible hacer una alineaci&oacute;n individual para separar un elemento o un grupo de elementos de otros utilizando m&aacute;rgenes autom&aacute;ticos junto con flexbox.
ko: 항목이 해당 축의 그룹으로 취급되므로 기본 축에 사용할 수 있는 <code>justify-items</code> 또는 <code>justify-self</code> 속성이 없습니다. 그러나 flexbox와 함께 자동 여백을 사용하여 항목 또는 항목 그룹을 다른 항목과 분리하기 위해 개별 정렬을 수행 할 수 있습니다.
zh_cn: 由于主轴上的项目被视为一个组，因此在主轴上没有可用的&ldquo; <code>justify-items</code> &rdquo;或&ldquo; <code>justify-self</code> &rdquo;属性。但是，可以通过使用自动边距和flexbox进行一些单独的对齐，以将一个项目或一组项目与其他项目分开。

source: We don&rsquo;t need to define where our areas are with <code>grid-template-areas</code> as our named lines have created an area for us.
es: No necesitamos definir d&oacute;nde est&aacute;n nuestras &aacute;reas con las &aacute;reas <code>grid-template-areas</code> ya que nuestras l&iacute;neas con nombre nos han creado un &aacute;rea.
ko: 명명 된 선이 영역을 만들었 으므로 <code>grid-template-areas</code> 영역이있는 영역을 정의 할 필요가 없습니다 .
zh_cn: 我们不需要使用 <code>grid-template-areas</code> 来定义我们的区域，因为我们的命名线已经为我们创建了一个区域。

source: We encounter physical properties frequently when building websites, and while the grid placement and alignment properties and values respect writing modes, there are things you may want to do with Grid that force you to use physical properties and values. In the guide to <a href="box_alignment_in_css_grid_layout">Box alignment and grids</a>, I demonstrated how auto margins work in a grid area. Using an auto margin to push one item away from the others is a common flexbox trick too, however this also ties the layout to the physical space.
es: Encontramos propiedades f&iacute;sicas con frecuencia al crear sitios web, y aunque las propiedades y los valores de colocaci&oacute;n y alineaci&oacute;n de la cuadr&iacute;cula respetan los modos de escritura, hay cosas que puede hacer con Grid que lo obligan a usar propiedades y valores f&iacute;sicos. En la gu&iacute;a de <a href="box_alignment_in_css_grid_layout">alineaci&oacute;n de cuadros y cuadr&iacute;culas</a> , demostr&eacute; c&oacute;mo funcionan los m&aacute;rgenes autom&aacute;ticos en un &aacute;rea de cuadr&iacute;cula. Usar un margen autom&aacute;tico para alejar un elemento de los otros tambi&eacute;n es un truco com&uacute;n de flexbox, sin embargo, esto tambi&eacute;n vincula el dise&ntilde;o al espacio f&iacute;sico.
ko: 웹 사이트를 구축 할 때 물리적 속성이 자주 발생하고 그리드 배치 및 정렬 속성과 값이 쓰기 모드를 존중하지만 Grid와 관련하여 물리적 속성과 값을 사용해야하는 작업이있을 수 있습니다. <a href="box_alignment_in_css_grid_layout">Box alignment and grids</a> 가이드 에서 그리드 영역에서 자동 여백이 작동하는 방법을 설명했습니다. 자동 여백을 사용하여 한 항목을 다른 항목에서 밀어내는 것도 일반적인 flexbox 트릭이지만 레이아웃도 물리적 공간에 연결합니다.
zh_cn: 在构建网站时，我们经常遇到物理属性，尽管网格放置和对齐属性和值遵循书写模式，但是您可能要对Grid进行某些操作，从而迫使您使用物理属性和值。在&ldquo; <a href="box_alignment_in_css_grid_layout">框对齐和栅格</a> &rdquo;指南中，我演示了自动边距在栅格区域中的工作方式。使用自动边距将一个项目推离另一个项目也是一种常见的flexbox技巧，但是这也将布局与物理空间联系在一起。

source: We encountered the first in the example above. Using <code>contain: content</code> turns on <code>layout</code> and <code>paint</code> containment. The specification describes this value as being "reasonably safe to apply widely". It does not apply <code>size</code> containment, so you would not be at risk of a box ending up zero-sized due to a reliance on the size of its children.
ko: 위의 예에서 첫 번째를 만났습니다. <code>contain: content</code> 사용하면 <code>layout</code> 및 <code>paint</code> 포함 이 설정됩니다 . 사양에서는이 값을 "넓게 적용하기에 합리적으로 안전"하다고 설명합니다. <code>size</code> 적용하지 않으므로 자식의 크기에 의존하기 때문에 상자 크기가 0이 될 위험이 없습니다.
zh_cn: 在上面的示例中，我们遇到了第一个。使用&ldquo; <code>contain: content</code> 将启用 <code>layout</code> 和 <code>paint</code> 包含。规范将该值描述为&ldquo;合理安全地广泛应用&rdquo;。它不应用 <code>size</code> 限制，因此，由于依赖于其子项的大小，因此您不会面临以零号结尾的盒子的风险。

source: We first set the <a href="color"><code>color</code></a> of the <a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/body"><code>&lt;body&gt;</code></a> to green.
es: Primero establecemos el <a href="color"> <code>color</code> </a> del <a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/body"> <code>&lt;body&gt;</code> </a> en verde.
ko: 우리는 먼저 설정 <a href="color"> <code>color</code> </a> 의 <a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/body"> <code>&lt;body&gt;</code> </a> 녹색으로.
zh_cn: 我们首先设置<a href="color"> <code>color</code> </a>的的<a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/body"> <code>&lt;body&gt;</code> </a>绿色。

source: We generally think of width and height media queries as being relative the width and height of the browser window. They are actually relative to the viewport, which is the window in the main document, but is the intrinsic size of the element's parent in a nested browsing context like objects, iframes and SVG. In CSS, we also have length units based on the viewport size. A <code>vh</code> unit is 1% of the layout viewport's height. Similarly, <code>vw</code> unit is 1% of layout viewport's width.
es: Generalmente pensamos que las consultas de medios de ancho y alto son relativas al ancho y alto de la ventana del navegador. En realidad, son relativos a la ventana gr&aacute;fica, que es la ventana en el documento principal, pero es el tama&ntilde;o intr&iacute;nseco del elemento primario en un contexto de navegaci&oacute;n anidado como objetos, iframes y SVG. En CSS, tambi&eacute;n tenemos unidades de longitud basadas en el tama&ntilde;o de la ventana gr&aacute;fica. Una unidad <code>vh</code> es el 1% de la altura de la ventana gr&aacute;fica de dise&ntilde;o. Del mismo modo, la unidad <code>vw</code> es el 1% del ancho de la ventana gr&aacute;fica de dise&ntilde;o.
ko: 일반적으로 너비 및 높이 미디어 쿼리는 브라우저 창의 너비 및 높이와 관련이 있다고 생각합니다. 그것들은 실제로 메인 문서의 창인 뷰포트에 상대적이지만 객체, iframe 및 SVG와 같은 중첩 된 브라우징 컨텍스트에서 요소의 부모의 본질적인 크기입니다. CSS에는 뷰포트 크기에 따른 길이 단위도 있습니다. <code>vh</code> 유닛이 배치 뷰포트의 높이의 1 %이다. 마찬가지로, <code>vw</code> 단위는 배치 뷰포트 너비의 1 %입니다.
zh_cn: 通常，我们将宽度和高度媒体查询视为相对于浏览器窗口的宽度和高度。它们实际上是相对于视口的，视口是主文档中的窗口，但是是嵌套的浏览上下文（如对象，iframe和SVG）中元素父级的固有大小。在CSS中，我们还有基于视口大小的长度单位。甲 <code>vh</code> 单元是布局视口的高度的1％。同样， <code>vw</code> 单位是布局视口宽度的1％。

source: We give the image area a grid area name of <code>img</code> and the text area <code>content</code>, then we can lay those out using the <code>grid-template-areas</code> property.
es: Le damos al &aacute;rea de la imagen un nombre de &aacute;rea de cuadr&iacute;cula de <code>img</code> y el <code>content</code> &aacute;rea de texto , luego podemos dise&ntilde;arlos usando la propiedad de <code>grid-template-areas</code> .
ko: 이미지 영역에 그리드 영역 이름 <code>img</code> 및 텍스트 영역 <code>content</code> 를 지정하고 <code>grid-template-areas</code> 속성을 사용하여 이미지 영역 을 배치 할 수 있습니다 .
zh_cn: 我们给图像区域一个 <code>img</code> 的网格区域名称和一个文本区域的 <code>content</code> ，然后我们可以使用 <code>grid-template-areas</code> 属性进行布局。

source: We got the 800 x 533 measurement when we zoomed in using the keyboard. When we zoomed in with the keyboard, the header and footer stayed flush against the top and bottom of the window. But what if we had pinched-zoomed on a tablet? What if a dynamic keyboard pops open on a phone?
es: Obtuvimos la medida de 800 x 533 cuando hicimos un zoom con el teclado.Cuando hicimos el zoom con el teclado,el encabezado y el pie de página quedaron al ras de la parte superior e inferior de la ventana.¿Pero qué pasaría si hubiéramos hecho un zoom pellizcado en una tableta? ¿Y si un teclado dinámico se abre en un teléfono?
ko: 키보드를 사용하여 확대했을 때 800 x 533 측정 값을 얻었습니다. 키보드를 사용하여 확대하면 머리글과 바닥 글이 창 위쪽과 아래쪽에 닿지 않게 유지되었습니다. 하지만 태블릿에 집어 넣었다면 어떨까요? 휴대 전화에서 다이나믹 키보드가 열리면 어떻게 되나요?
zh_cn: 当我们使用键盘放大时,我们得到了800 x 533的测量结果。当我们用键盘放大时,页眉和页脚与窗口的顶部和底部保持齐平。但是,如果我们在平板电脑上进行了捏合缩放呢?如果在手机上弹开动态键盘呢?

source: We have a problem however, caused by the <code>width</code> property we used on our floated items to make them display as three columns. This is now interpreted by grid as being the width of the column track, not the width of the container as it is for the float.
ko: 그러나 부동 항목에 사용 된 <code>width</code> 속성으로 인해 세 개의 열로 표시되도록하는 데 문제가 있습니다. 이것은 이제 그리드에 의해 플로트에 대한 컨테이너의 너비가 아니라 열 트랙의 너비로 해석됩니다.
zh_cn: 但是，我们有一个问题，这是因为我们在浮动项目上使用的 <code>width</code> 属性使它们显示为三列。现在，网格将其解释为列轨道的宽度，而不是浮子的容器宽度。

source: We have already seen how <code>circle()</code> creates a circular shape. An <code>ellipse()</code> is essentially a squashed circle. If none of these simple shapes do the trick you can create a <code>polygon()</code> and make the shape as complex as you want.
es: Ya hemos visto c&oacute;mo <code>circle()</code> crea una forma circular. Una <code>ellipse()</code> es esencialmente un c&iacute;rculo aplastado. Si ninguna de estas formas simples funciona, puede crear un <code>polygon()</code> y hacer que la forma sea tan compleja como desee.
ko: 우리는 이미 <code>circle()</code> 이 원형을 만드는 방법을 보았습니다 . <code>ellipse()</code> 본질적으로 찌그러 원이다. 이 간단한 모양 중 아무것도 트릭을 수행하지 않으면 <code>polygon()</code> 을 만들고 원하는 모양을 복잡하게 만들 수 있습니다 .
zh_cn: 我们已经了解了 <code>circle()</code> 如何创建圆形。一个 <code>ellipse()</code> 基本上是一个压扁的圆。如果没有这些简单的形状可以解决问题，则可以创建一个 <code>polygon()</code> 并根据需要使形状复杂。
