Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/css/css.*.017.xlf
Languages: es, ko, zh_cn

source: You don't have to limit yourself to two colors&mdash;you may use as many as you like! By default, colors are evenly spaced along the gradient.
es: No tiene que limitarse a dos colores, &iexcl;puede usar tantos como desee! Por defecto, los colores est&aacute;n espaciados uniformemente a lo largo del gradiente.
ko: 자신을 두 가지 색상으로 제한 할 필요는 없습니다. 원하는만큼 사용할 수 있습니다! 기본적으로 색상은 그라디언트를 따라 균등하게 배치됩니다.
zh_cn: 您不必将自己限制为两种颜色，您可以随意使用任意多种颜色！默认情况下，颜色沿渐变均匀间隔。

source: You don't! The feature is enabled by default in supporting browsers. In most cases anchored scrolling is exactly what you want &mdash; content jumping is a poor experience for anyone.
ko: 당신은하지 않습니다! 이 기능은 지원되는 브라우저에서 기본적으로 활성화됩니다. 대부분의 경우 고정 된 스크롤은 원하는 것입니다. 콘텐츠 점프는 누구에게나 좋지 않은 경험입니다.
zh_cn: 你不！在支持的浏览器中，默认情况下启用此功能。在大多数情况下，锚定滚动正是您想要的-内容跳转对任何人来说都是糟糕的体验。

source: You find this <a href="https://mdn.github.io/css-examples/min-max-clamp/">example live on GitHub</a>, if you want to play around with it.
ko: 이 <a href="https://mdn.github.io/css-examples/min-max-clamp/">예제</a> 를 가지고 놀고 싶다면 GitHub 에서 라이브로 찾을 수 있습니다.
zh_cn: 如果您想使用该<a href="https://mdn.github.io/css-examples/min-max-clamp/">示例，可以在GitHub上</a>找到该示例。

source: You first need to specify on the embedding element the properties whose values you wish to expose to the embedded SVG, using the <code>-moz-context-properties</code> property. For example:
es: Primero debe especificar en el elemento de incrustaci&oacute;n las propiedades cuyos valores desea exponer al SVG incrustado, utilizando la <code>-moz-context-properties</code> . Por ejemplo:
ko: 먼저 <code>-moz-context-properties</code> 속성을 사용하여 값을 포함 SVG에 노출 할 속성을 포함 요소에 지정해야 합니다. 예를 들면 다음과 같습니다.
zh_cn: 首先，您需要使用 <code>-moz-context-properties</code> 属性在embedding元素上指定要向嵌入式SVG公开其值的属性。例如：

source: You have a global CSS file that sets visual aspects of your site globally.
es: Tienes un archivo CSS global que establece los aspectos visuales de tu sitio globalmente.
ko: 사이트의 시각적 측면을 전역 적으로 설정하는 전역 CSS 파일이 있습니다.
zh_cn: 你有一个全局性的CSS文件,可以在全球范围内设置你网站的视觉方面。

source: You have already encountered the <a href="../grid-area"><code>grid-area</code></a> property. This is the property that can take as a value all four of the lines used to position a grid area.
es: Ya ha encontrado la propiedad de <a href="../grid-area"> <code>grid-area</code> </a> . Esta es la propiedad que puede tomar como valor las cuatro l&iacute;neas utilizadas para colocar un &aacute;rea de cuadr&iacute;cula.
ko: <a href="../grid-area"> <code>grid-area</code> </a> 속성 이 이미 발생 했습니다. 그리드 영역을 배치하는 데 사용되는 4 개의 선을 모두 값으로 사용할 수있는 속성입니다.
zh_cn: 您已经遇到了<a href="../grid-area"> <code>grid-area</code> </a>属性。该属性可以将用于放置网格区域的所有四条线作为值。

source: You may also find that some variable fonts come split into two files: one for uprights and all their variations, and one containing the italic variations. This is sometimes done to reduce the overall file size in cases where the italics aren't needed or used. In all cases, it is still possible to link them with a common <a href="../font-family"><code>font-family</code></a> name so you can call them using the same <code>font-family</code> and appropriate <a href="../font-style"><code>font-style</code></a>.
es: Tambi&eacute;n puede encontrar que algunas fuentes variables se dividen en dos archivos: uno para los montantes y todas sus variaciones, y otro que contiene las variaciones en cursiva. Esto a veces se hace para reducir el tama&ntilde;o general del archivo en casos donde las cursivas no son necesarias o utilizadas. En todos los casos, todav&iacute;a es posible vincularlos con un nombre de <a href="../font-family"> <code>font-family</code> </a> com&uacute;n para que pueda llamarlos utilizando la misma <code>font-family</code> <a href="../font-style"> <code>font-style</code> </a> apropiado .
ko: 일부 가변 글꼴은 두 개의 파일로 나뉘어져 있습니다. 하나는 똑바로 사용하고 다른 하나는 이탤릭 변형을 포함합니다. 기울임 꼴이 필요하지 않거나 사용되지 않는 경우 전체 파일 크기를 줄이기 위해 때때로 수행됩니다. 모든 경우에 공통 <a href="../font-family"> <code>font-family</code> </a> 이름 과 연결할 수 있으므로 동일한 <code>font-family</code> 과 적절한 <a href="../font-style"> <code>font-style</code> </a> 사용하여 호출 할 수 있습니다 .
zh_cn: 您可能还会发现一些可变字体分为两个文件：一个用于竖立字体及其所有变体，另一个包含斜体变体。在不需要或不使用斜体的情况下，有时这样做是为了减小文件的整体大小。在所有情况下，仍然可以使用通用的<a href="../font-family"> <code>font-family</code> </a>名称来链接它们，因此您可以使用相同的 <code>font-family</code> 和适当的<a href="../font-style"> <code>font-style</code> </a>对其进行调用。

source: You may combine any number of functions to manipulate the rendering. The following example enhances the contrast and brightness of the image.
es: Puede combinar cualquier número de funciones para manipular la representación.El siguiente ejemplo mejora el contraste y el brillo de la imagen.
ko: 렌더링을 조작하기 위해 여러 기능을 결합 할 수 있습니다. 다음 예제는 이미지의 대비와 밝기를 향상시킵니다.
zh_cn: 您可以结合任何数量的功能来操作渲染。下面的例子可以增强图像的对比度和亮度。

source: You may combine any number of functions to manipulate the rendering. The following example enhances the contrast and brightness of the image:
ko: 여러 기능을 결합하여 렌더링을 조작 할 수 있습니다. 다음 예제는 이미지의 대비와 밝기를 향상시킵니다.
zh_cn: 您可以结合任何数量的功能来操作渲染。下面的例子可以增强图像的对比度和亮度。

source: You may need to test support for more than one property in your feature query. To do so, you can include a list of features to test for, separated by <code>and</code> keywords:
ko: 기능 쿼리에서 둘 이상의 속성에 대한 지원을 테스트해야 할 수 있습니다. 이렇게하려면, 당신은에 의해 분리를 테스트하는 기능의 목록을 포함 할 수 <code>and</code> 키워드 :
zh_cn: 您可能需要在功能查询中测试对多个属性的支持。为此，您可以包含要测试的功能列表，以 <code>and</code> 关键字分隔：

source: You may specify multiple delays, which is useful when transitioning multiple properties. Each delay will be applied to the corresponding property as specified by the <a href="transition-property"><code>transition-property</code></a> property, which acts as a master list. If there are fewer delays specified than in the master list, the list of delay values will be repeated until there are enough. If there are more delays, the list of delay values will be truncated to match the number of properties. In both cases, the CSS declaration remains valid.
es: Puede especificar m&uacute;ltiples demoras, lo cual es &uacute;til al realizar la transici&oacute;n de varias propiedades. Cada retraso se aplicar&aacute; a la propiedad correspondiente seg&uacute;n lo especificado por la <a href="transition-property"> <code>transition-property</code> </a> propiedad de transici&oacute;n , que act&uacute;a como una lista maestra. Si se especifican menos demoras que en la lista maestra, la lista de valores de demora se repetir&aacute; hasta que haya suficientes. Si hay m&aacute;s demoras, la lista de valores de demoras se truncar&aacute; para que coincida con el n&uacute;mero de propiedades. En ambos casos, la declaraci&oacute;n CSS sigue siendo v&aacute;lida.
ko: 여러 속성을 전환 할 때 유용한 여러 지연을 지정할 수 있습니다. 각 지연은 <a href="transition-property"> <code>transition-property</code> </a> 속성 속성에 지정된대로 해당 속성에 적용되며 마스터 속성으로 사용됩니다. 마스터 목록에 지정된 것보다 지연이 적 으면 지연 값 목록이 충분할 때까지 반복됩니다. 지연이 더 있으면 지연 값 목록이 속성 수와 일치하도록 잘립니다. 두 경우 모두 CSS 선언은 유효합니다.
zh_cn: 您可以指定多个延迟，这在转换多个属性时很有用。每个延迟都将应用于由<a href="transition-property"> <code>transition-property</code> </a>属性指定的相应属性，该属性用作主列表。如果指定的延迟少于主列表中的延迟，则将重复延迟值列表，直到有足够的延迟为止。如果有更多的延迟，则延迟值列表将被截断以匹配属性的数量。在这两种情况下，CSS声明仍然有效。

source: You may specify multiple durations; each duration will be applied to the corresponding property as specified by the <a href="transition-property"><code>transition-property</code></a> property, which acts as a master list. If there are fewer durations specified than in the master list, the user agent repeat the list of durations. If there are more durations, the list is simply truncated to the right size. In both case the CSS declaration stays valid.
es: Puede especificar m&uacute;ltiples duraciones; cada duraci&oacute;n se aplicar&aacute; a la propiedad correspondiente seg&uacute;n lo especificado por la <a href="transition-property"> <code>transition-property</code> </a> propiedad de transici&oacute;n , que act&uacute;a como una lista maestra. Si se especifican menos duraciones que en la lista maestra, el agente de usuario repite la lista de duraciones. Si hay m&aacute;s duraciones, la lista simplemente se trunca al tama&ntilde;o correcto. En ambos casos, la declaraci&oacute;n CSS sigue siendo v&aacute;lida.
ko: 여러 기간을 지정할 수 있습니다. 각 지속 기간은 <a href="transition-property"> <code>transition-property</code> </a> 속성에 의해 지정된 해당 속성에 적용되며 마스터 속성으로 사용됩니다. 마스터 목록에 지정된 기간보다 적은 기간이 지정된 경우 사용자 에이전트는 기간 목록을 반복합니다. 지속 시간이 더 있으면 목록이 올바른 크기로 잘립니다. 두 경우 모두 CSS 선언은 유효합니다.
zh_cn: 您可以指定多个持续时间；每个持续时间将应用于<a href="transition-property"> <code>transition-property</code> </a>属性指定的相应属性，该属性用作主列表。如果指定的持续时间少于主列表中的持续时间，则用户代理将重复该持续时间列表。如果持续时间更长，则该列表将被截断为正确的大小。在这两种情况下，CSS声明均保持有效。

source: You may specify multiple timing functions; each one will be applied to the corresponding property as specified by the <a href="transition-property"><code>transition-property</code></a> property, which acts as a <code>transition-property</code> list. If there are fewer timing functions specified than in the <code>transition-property</code> list, the user agent must calculate which value is used by repeating the list of values until there is one for each transition property. If there are more timing functions, the list is simply truncated to the right size. In both cases, the CSS declaration stays valid.
ko: 여러 타이밍 기능을 지정할 수 있습니다. 각각 은 <code>transition-property</code> 목록 으로 작동 하는 <a href="transition-property"> <code>transition-property</code> </a> 속성에 지정된대로 해당 속성에 적용됩니다 . <code>transition-property</code> 목록 에 지정된 것보다 더 적은 타이밍 함수가 지정된 경우 사용자 에이전트는 각 전환 속성에 대해 하나가있을 때까지 값 목록을 반복하여 사용되는 값을 계산해야합니다. 더 많은 타이밍 함수가있는 경우 목록이 올바른 크기로 잘립니다. 두 경우 모두 CSS 선언이 유효합니다.
zh_cn: 您可以指定多个计时功能。每个属性将应用到由<a href="transition-property"> <code>transition-property</code> </a>属性指定的相应属性，该属性用作 <code>transition-property</code> 列表。如果指定的计时功能少于 <code>transition-property</code> 列表中的计时功能，则用户代理必须通过重复值列表直到每个过渡属性都包含一个值，来计算使用哪个值。如果还有更多计时功能，则该列表将被截断为正确的大小。在这两种情况下，CSS声明均保持有效。

source: You may specify multiple timing functions; each one will be applied to the corresponding property as specified by the <a href="transition-property"><code>transition-property</code></a> property, which acts as a master list. If there are fewer functions specified than in the master list, missing values are set to the initial value (<code>ease</code>). If there are more timing functions, the list is simply truncated to the right size. In both cases, the CSS declaration stays valid.
es: Puede especificar m&uacute;ltiples funciones de temporizaci&oacute;n; cada uno se aplicar&aacute; a la propiedad correspondiente seg&uacute;n lo especificado por la <a href="transition-property"> <code>transition-property</code> </a> propiedad de transici&oacute;n , que act&uacute;a como una lista maestra. Si hay menos funciones especificadas que en la lista maestra, los valores faltantes se establecen en el valor inicial ( <code>ease</code> ). Si hay m&aacute;s funciones de temporizaci&oacute;n, la lista simplemente se trunca al tama&ntilde;o correcto. En ambos casos, la declaraci&oacute;n CSS sigue siendo v&aacute;lida.
ko: 여러 타이밍 기능을 지정할 수 있습니다. 각 속성은 <a href="transition-property"> <code>transition-property</code> </a> 속성 속성에 지정된대로 해당 속성에 적용되며 마스터 속성으로 사용됩니다. 마스터 목록에 지정된 것보다 적은 수의 기능이 지정된 경우 결 측값이 초기 값 ( <code>ease</code> )으로 설정됩니다. 타이밍 기능이 더 있으면 목록이 올바른 크기로 잘립니다. 두 경우 모두 CSS 선언은 유효합니다.

source: You may want to give a line more than one name, perhaps it denotes the sidebar-end and the main-start for example. To do this add the names inside the square brackets with whitespace between them <code>[sidebar-end main-start]</code>. You can then refer to that line by either of the names.
es: Es posible que desee dar a una l&iacute;nea m&aacute;s de un nombre, tal vez denota el extremo de la barra lateral y el inicio principal, por ejemplo. Para hacer esto, agregue los nombres dentro de los corchetes con espacios en blanco entre ellos <code>[sidebar-end main-start]</code> . Luego puede referirse a esa l&iacute;nea por cualquiera de los nombres.
ko: 예를 들어 사이드 바 끝과 메인 시작을 나타내는 이름을 여러 줄로 지정할 수 있습니다. 이렇게하려면 대괄호 안에 이름을 추가하고 그 사이에 공백이 있습니다 <code>[sidebar-end main-start]</code> . 그런 다음 이름 중 하나를 사용하여 해당 행을 참조 할 수 있습니다.

source: You may well find the Firefox Shape Inspector very useful here to create your polygon shape. The screenshot below shows the shape highlighted in the tool.
es: El inspector de formas de Firefox puede ser muy útil para crear tu forma de polígono.La siguiente captura de pantalla muestra la forma resaltada en la herramienta.
ko: Firefox Shape Inspector는 다각형 모양을 만드는 데 매우 유용합니다. 아래 스크린 샷은 도구에서 강조 표시된 모양을 보여줍니다.

source: You might have a design, perhaps a card that will display a news item. The heading of the news item is the key thing to highlight and would be the element that a user might jump to if they were tabbing between headings to find content they wanted to read. The card also has a date; the finished design we want to create is something like this.
es: Puede tener un diseño,tal vez una tarjeta que muestre una noticia.El encabezado de la noticia es lo más importante a destacar y sería el elemento al que un usuario podría saltar si estuviera pasando de un encabezado a otro para encontrar el contenido que quiere leer.La tarjeta también tiene una fecha;el diseño final que queremos crear es algo así.
ko: 뉴스 항목을 표시 할 디자인, 아마도 카드가있을 수 있습니다. 뉴스 항목의 제목은 강조해야 할 핵심 사항이며 사용자가 원하는 내용을 찾기 위해 제목 사이를 이동하는 경우 바로 이동할 수있는 요소입니다. 이 카드에는 날짜도 있습니다. 우리가 만들고자하는 완성 된 디자인은 다음과 같습니다.

source: You might notice that we have been talking about having a specific font file for every weight and style (i.e. bold and italic and bold italic), rather than relying upon the browser to synthesize them. The reason for this is that most typefaces have very specific designs for bolder weights and italics that often include completely different characters (lower-case 'a' and 'g' are often quite different in italics, for example). In order to most accurately reflect the typeface design and avoid differences between browsers and how they may or may not synthesize the different styles, it's more accurate to load the specific font files where needed when using a non-variable font.
es: Notarán que hemos estado hablando de tener un archivo de fuente específico para cada peso y estilo (es decir,negrita y cursiva y negrita y cursiva),en lugar de confiar en el navegador para sintetizarlos.La razón de esto es que la mayoría de los tipos de letra tienen diseños muy específicos para los pesos más atrevidos y las cursivas que a menudo incluyen caracteres completamente diferentes (la "a" y la "g" minúsculas suelen ser bastante diferentes en cursiva,por ejemplo).Para reflejar con mayor precisión el diseño del tipo de letra y evitar las diferencias entre los navegadores y cómo pueden o no sintetizar los diferentes estilos,es más preciso cargar los archivos de fuentes específicas donde sea necesario cuando se utiliza una fuente no variable.
ko: 브라우저를 사용하여 합성하기보다는 모든 무게와 스타일 (예 : 굵게 및 기울임 꼴 및 굵은 기울임 꼴)에 대해 특정 글꼴 파일을 사용하는 것에 대해 이야기하고있는 것을 알 수 있습니다. 그 이유는 대부분의 서체가 종종 완전히 다른 문자를 포함하는 대담한 가중치와 이탤릭체에 대해 매우 구체적인 디자인을 가지고 있기 때문입니다 (예를 들어 소문자 'a'와 'g'는 이탤릭체에서 종종 크게 다릅니다). 서체 디자인을 가장 정확하게 반영하고 브라우저 간의 차이점과 서로 다른 스타일을 합성하거나 합성하지 않는 방식을 피하려면 가변 글꼴을 사용할 때 필요한 곳에 특정 글꼴 파일을로드하는 것이 더 정확합니다.

source: You might use this feature to render your buttons slightly larger if the user is on a touch-screen device, to make them more finger-friendly.
es: Puede utilizar esta función para agrandar ligeramente los botones si el usuario está en un dispositivo de pantalla táctil,para que sean más fáciles de usar con los dedos.
ko: 사용자가 터치 스크린 장치를 사용하는 경우이 기능을 사용하면 버튼을 약간 더 크게 만들어 손가락을보다 친숙하게 만들 수 있습니다.

source: You must specify a threshold with at least one of <code>top</code>, <code>right</code>, <code>bottom</code>, or <code>left</code> for sticky positioning to behave as expected. Otherwise, it will be indistinguishable from relative positioning.
es: Debe especificar un umbral con al menos uno de <code>top</code> , <code>right</code> , <code>bottom</code> o <code>left</code> para que la posici&oacute;n fija se comporte como se espera. De lo contrario, ser&aacute; indistinguible del posicionamiento relativo.
ko: 고정 위치가 예상대로 작동하려면 <code>top</code> , <code>right</code> , <code>bottom</code> 또는 <code>left</code> 중 하나 이상으로 임계 값을 지정해야합니다 . 그렇지 않으면 상대 위치와 구별 할 수 없습니다.

source: You should always include at least one generic family name in a <code>font-family</code> list, since there's no guarantee that any given font is available. This lets the browser select an acceptable fallback font when necessary.
ko: 특정 글꼴을 사용할 수 있다는 보장이 없으므로 항상 <code>font-family</code> 목록 에 하나 이상의 일반 제품군 이름을 포함해야 합니다. 이렇게하면 브라우저가 필요한 경우 허용 가능한 대체 글꼴을 선택할 수 있습니다.

source: You should always include at least one generic family name in a font-family list, since there's no guarantee that any given font is available. This lets the browser select an acceptable fallback font when necessary.
es: Siempre debe incluir al menos un apellido genérico en una lista de fuentes,ya que no hay garantía de que una fuente determinada esté disponible.Esto permite al navegador seleccionar una fuente alternativa aceptable cuando sea necesario.
ko: 주어진 글꼴을 사용할 수 있다는 보장이 없으므로 글꼴 모음 목록에 하나 이상의 일반 패밀리 이름을 항상 포함해야합니다. 이를 통해 브라우저는 필요한 경우 허용되는 대체 글꼴을 선택할 수 있습니다.

source: You will find more examples of <code>transition-property</code> included in the main <a href="css_transitions/using_css_transitions">CSS transitions</a> article.
ko: 기본 <a href="css_transitions/using_css_transitions">CSS 전환</a> 기사에 포함 된 <code>transition-property</code> 의 더 많은 예를 찾을 수 있습니다 .

source: You will very rarely see the <code>flex-grow</code>, <code>flex-shrink</code>, and <code>flex-basis</code> properties used individually; instead they are combined into the <a href="../flex"><code>flex</code></a> shorthand. The <code>flex</code> shorthand allows you to set the three values in this order &mdash; <code>flex-grow</code>, <code>flex-shrink</code>, <code>flex-basis</code>.
es: Va muy raramente ver el <code>flex-grow</code> , <code>flex-shrink</code> y <code>flex-basis</code> propiedades utilizado de forma individual; en cambio, se combinan en la taquigraf&iacute;a <a href="../flex"> <code>flex</code> ible</a> . La abreviatura de <code>flex</code> le permite establecer los tres valores en este orden: <code>flex-grow</code> , <code>flex-shrink</code> , <code>flex-basis</code> .
ko: <code>flex-grow</code> , <code>flex-shrink</code> 및 <code>flex-basis</code> 속성이 개별적 으로 사용되는 경우는 거의 없습니다 . 대신에 <a href="../flex"> <code>flex</code> </a> 속기 로 결합됩니다 . <code>flex</code> - 속기는이 순서대로 세 가지 값을 설정할 수 있습니다 <code>flex-grow</code> , <code>flex-shrink</code> , <code>flex-basis</code> .

source: You'll note the <code>innerWidth</code> and <code>outerWidth</code> are the same, but the <code>outerHeight</code> is 100px taller than the <code>innerHeight</code>. This is because the <code>outerHeight</code> includes the browser chrome: measurements were taken on a browser with an addres bar and bookmarks bar totalling 100px in height, but no chrome on the left or right of the window. The area within the <code>innerHeight</code> and <code>innerWidth</code> is generally considered the <em>layout viewport</em>. The browser chrome is not considered part of the viewport.
es: Se habr&aacute; dado cuenta el <code>innerWidth</code> y <code>outerWidth</code> son los mismos, pero el <code>outerHeight</code> es 100px alto que el <code>innerHeight</code> . Esto se debe a que la <code>outerHeight</code> incluye el cromo del navegador: las mediciones se tomaron en un navegador con una barra de direcciones y una barra de marcadores con un total de 100 px de altura, pero sin cromo a la izquierda o derecha de la ventana. El &aacute;rea dentro de <code>innerHeight</code> e <code>innerWidth</code> generalmente se considera la <em>ventana </em>gr&aacute;fica de <em>dise&ntilde;o</em> . El navegador Chrome no se considera parte de la ventana gr&aacute;fica.
ko: 당신은 알게 될 것이다 <code>innerWidth</code> 을 하고 <code>outerWidth</code> 은 동일하지만, <code>outerHeight</code> 이 댄 100 픽셀 키가 크다 <code>innerHeight</code> . 이는 <code>outerHeight</code> 에 브라우저 크롬이 포함되어 있기 때문입니다 . 측정 값은 총 막대가 100 픽셀 인 즐겨 찾기 막대와 책갈피 막대가있는 브라우저에서 수행되었지만 창의 왼쪽이나 오른쪽에는 크롬이 없습니다. <code>innerHeight</code> 및 <code>innerWidth</code> 내의 영역 은 일반적으로 <em>배치 뷰포트로</em> 간주됩니다 . 브라우저 크롬은 뷰포트의 일부로 간주되지 않습니다.

source: You'll see that when filling the <code>style</code> element with content, we select all slotted elements (<code>::slotted(*)</code>) and give them a different font and color. This allows them to stand out better next to the slots that haven't been successfully filled.
es: Ver&aacute; que al llenar el elemento de <code>style</code> con contenido, seleccionamos todos los elementos ranurados ( <code>::slotted(*)</code> ) y les damos una fuente y color diferentes. Esto les permite destacarse mejor junto a las ranuras que no se han llenado con &eacute;xito.
ko: <code>style</code> 요소를 내용으로 채울 때 모든 슬롯 요소 ( <code>::slotted(*)</code> )를 선택하고 다른 글꼴과 색상을 제공한다는 것을 알 수 있습니다. 이를 통해 성공적으로 채워지지 않은 슬롯 옆에 더 잘 보이게 할 수 있습니다.

source: Your global CSS file that sets visual aspects of your site globally may be overwritten by inline styles defined directly on individual elements. Both inline styles and !important are considered very bad practice, but sometimes you need the latter to override the former.
ko: 사이트의 시각적 측면을 전역 적으로 설정하는 전역 CSS 파일은 개별 요소에 직접 정의 된 인라인 스타일로 덮어 쓸 수 있습니다. 인라인 스타일과! important는 모두 매우 나쁜 습관으로 간주되지만 때로는 전자를 재정의하기 위해 후자가 필요합니다.

source: Zebra stripes
es: Rayas de cebra
ko: 얼룩말 줄무늬

source: Zero or more <a href="url"><code>&lt;url&gt;</code></a>s or <a href="string"><code>&lt;string&gt;</code></a>s specifying the image sources, with optional image fragment identifiers.
ko: 선택적 이미지 조각 식별자와 함께 이미지 소스를 지정하는 0 개 이상의 <a href="url"> <code>&lt;url&gt;</code> </a> 또는 <a href="string"> <code>&lt;string&gt;</code> </a> .

source: Zone 9 is the <a id="middle-region" name="middle-region">middle region</a>. It is discarded by default, but is used like a background image if the keyword <code>fill</code> is set.
es: La zona 9 es la <a id="middle-region" name="middle-region">regi&oacute;n media</a> . Se descarta de manera predeterminada, pero se usa como una imagen de fondo si se establece el <code>fill</code> la palabra clave .
ko: 영역 9는 <a id="middle-region" name="middle-region">중간 영역</a> 입니다. 기본적으로 삭제되지만 키워드 <code>fill</code> 가 설정된 경우 배경 이미지처럼 사용 됩니다.

source: Zone 9 is the <span id="middle-region">middle region</span>. It is discarded by default, but is used like a background image if the keyword <code>fill</code> is set.
es: La zona 9 es la <span id="middle-region">regi&oacute;n media</span> . Se descarta de manera predeterminada, pero se usa como una imagen de fondo si se establece el <code>fill</code> la palabra clave .
ko: 영역 9는 <span id="middle-region">중간 영역</span> 입니다. 기본적으로 삭제되지만 키워드 <code>fill</code> 가 설정된 경우 배경 이미지처럼 사용 됩니다.

source: Zones 1-4 are <a id="corner-regions" name="corner-regions">corner regions</a>. Each one is used a single time to form the corners of the final border image.
es: Las zonas 1-4 son <a id="corner-regions" name="corner-regions">regiones de esquina</a> . Cada uno se usa una sola vez para formar las esquinas de la imagen del borde final.
ko: 영역 1-4는 <a id="corner-regions" name="corner-regions">코너 영역</a> 입니다. 각각은 최종 테두리 이미지의 모서리를 형성하기 위해 한 번 사용됩니다.

source: Zones 1-4 are <span id="corner-regions">corner regions</span>. Each one is used a single time to form the corners of the final border image.
es: Las zonas 1-4 son <span id="corner-regions">regiones de esquina</span> . Cada uno se usa una sola vez para formar las esquinas de la imagen del borde final.
ko: 영역 1-4는 <span id="corner-regions">코너 영역</span> 입니다. 각각은 최종 테두리 이미지의 모서리를 형성하기 위해 한 번 사용됩니다.
