Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/css/css.*.017.xlf
Languages: es, ko, zh_cn

source: User must explicitly enable this feature.
es: El usuario debe habilitar explícitamente esta función.
ko: 사용자는이 기능을 명시 적으로 활성화해야합니다.
zh_cn: 用户必须明确启用此功能。

source: User origin
es: Origen del usuario
ko: 사용자 출처
zh_cn: 用户来源

source: User preferences
ko: 사용자 환경 설정
zh_cn: 用户偏好

source: User stylesheets
es: Hojas de estilo del usuario
ko: 사용자 스타일 시트
zh_cn: 用户样式表

source: User's preference for text color of active links. Should be used with the default document background color.
es: La preferencia del usuario por el color del texto de los enlaces activos.Debe utilizarse con el color de fondo del documento por defecto.
ko: 활성 링크의 텍스트 색상에 대한 사용자 기본 설정. 기본 문서 배경색과 함께 사용해야합니다.
zh_cn: 用户对活动链接的文本颜色的偏好。应与默认的文档背景色一起使用。

source: User's preference for the document background color.
es: La preferencia del usuario por el color de fondo del documento.
ko: 문서 배경색에 대한 사용자 기본 설정.
zh_cn: 用户对文档背景颜色的偏好。

source: User's preference for the text color of unvisited links. Should be used with the default document background color.
es: La preferencia del usuario por el color del texto de los enlaces no visitados.Debe utilizarse con el color de fondo del documento por defecto.
ko: 방문하지 않은 링크의 텍스트 색상에 대한 사용자의 기본 설정. 기본 문서 배경색과 함께 사용해야합니다.
zh_cn: 用户对未访问链接的文本颜色的偏好。应与默认的文档背景色一起使用。

source: User's preference for the text color of visited links. Should be used with the default document background color.
es: La preferencia del usuario por el color del texto de los enlaces visitados.Debe utilizarse con el color de fondo del documento por defecto.
ko: 방문한 링크의 텍스트 색상에 대한 사용자 기본 설정. 기본 문서 배경색과 함께 사용해야합니다.
zh_cn: 用户对访问链接的文本颜色的偏好。应与默认的文档背景色一起使用。

source: User's preference for the text color.
es: La preferencia del usuario por el color del texto.
ko: 텍스트 색상에 대한 사용자 기본 설정.
zh_cn: 用户对文字颜色的偏好。

source: User-agent origin
es: Origen del usuario-agente
ko: 사용자 에이전트 출처
zh_cn: 用户-代理起源

source: User-agent stylesheets
es: Hojas de estilo de usuario-agente
ko: 사용자 에이전트 스타일 시트
zh_cn: 用户-代理样式表

source: Uses <code>&lt;custom-ident&gt;</code> instead of a finite list of keywords. Defines which values are excluded for <a href="list-style-type"><code>list-style-type</code></a> and <a href="@counter-style"><code>@counter-style</code></a>.
es: Utiliza <code>&lt;custom-ident&gt;</code> en lugar de una lista finita de palabras clave. Define qu&eacute; valores se excluyen para <a href="list-style-type"> <code>list-style-type</code> </a> y <a href="@counter-style"> <code>@counter-style</code> </a> .
ko: 용도 <code>&lt;custom-ident&gt;</code> 대신 키워드의 유한 목록. <a href="list-style-type"> <code>list-style-type</code> </a> 및 <a href="@counter-style"> <code>@counter-style</code> </a> 대해 제외되는 값을 정의합니다 .
zh_cn: 使用 <code>&lt;custom-ident&gt;</code> 而不是关键字的有限列表。定义为<a href="list-style-type"> <code>list-style-type</code> </a>和<a href="@counter-style"> <code>@counter-style</code> </a>排除哪些值。

source: Uses a non-standard name.
es: Usa un nombre no estándar.
ko: 비표준 이름을 사용합니다.
zh_cn: 使用非标准名称。

source: Uses the <a href="css_box_model/introduction_to_the_css_box_model#border-area">border box</a> as the reference box.
es: Utiliza el <a href="css_box_model/introduction_to_the_css_box_model#border-area">cuadro de borde</a> como el cuadro de referencia.
ko: <a href="css_box_model/introduction_to_the_css_box_model#border-area">테두리 상자</a> 를 참조 상자로 사용합니다 .
zh_cn: 使用<a href="css_box_model/introduction_to_the_css_box_model#border-area">边框</a>作为参考框。

source: Uses the <a href="css_box_model/introduction_to_the_css_box_model#content-area">content box</a> as the reference box.
es: Utiliza el <a href="css_box_model/introduction_to_the_css_box_model#content-area">cuadro de contenido</a> como el cuadro de referencia.
ko: <a href="css_box_model/introduction_to_the_css_box_model#content-area">내용 상자</a> 를 참조 상자로 사용합니다 .
zh_cn: 使用<a href="css_box_model/introduction_to_the_css_box_model#content-area">内容框</a>作为参考框。

source: Uses the <a href="css_box_model/introduction_to_the_css_box_model#margin-area">margin box</a> as the reference box.
es: Utiliza el <a href="css_box_model/introduction_to_the_css_box_model#margin-area">cuadro de margen</a> como el cuadro de referencia.
ko: <a href="css_box_model/introduction_to_the_css_box_model#margin-area">여백 상자</a> 를 참조 상자로 사용합니다 .
zh_cn: 将<a href="css_box_model/introduction_to_the_css_box_model#margin-area">边距框</a>用作参考框。

source: Uses the <a href="css_box_model/introduction_to_the_css_box_model#padding-area">padding box</a> as the reference box.
es: Utiliza el <a href="css_box_model/introduction_to_the_css_box_model#padding-area">cuadro de relleno</a> como el cuadro de referencia.
ko: <a href="css_box_model/introduction_to_the_css_box_model#padding-area">패딩 상자</a> 를 참조 상자로 사용합니다 .
zh_cn: 使用<a href="css_box_model/introduction_to_the_css_box_model#padding-area">填充框</a>作为参考框。

source: Uses the <a href="css_shapes/from_box_values#border-box">border box</a> as the reference box.
ko: <a href="css_shapes/from_box_values#border-box">테두리 상자</a> 를 참조 상자로 사용합니다 .
zh_cn: 使用<a href="css_shapes/from_box_values#border-box">边框</a>作为参考框。

source: Uses the <a href="css_shapes/from_box_values#content-box">content box</a> as the reference box.
ko: <a href="css_shapes/from_box_values#content-box">컨텐츠 상자</a> 를 참조 상자로 사용합니다 .
zh_cn: 使用<a href="css_shapes/from_box_values#content-box">内容框</a>作为参考框。

source: Uses the <a href="css_shapes/from_box_values#margin-box">margin box</a> as the reference box.
ko: <a href="css_shapes/from_box_values#margin-box">여백 상자</a> 를 참조 상자로 사용합니다 .
zh_cn: 使用<a href="css_shapes/from_box_values#margin-box">边距框</a>作为参考框。

source: Uses the <a href="css_shapes/from_box_values#padding-box">padding box</a> as the reference box.
ko: <a href="css_shapes/from_box_values#padding-box">패딩 상자</a> 를 참조 상자로 사용합니다 .
zh_cn: 使用<a href="css_shapes/from_box_values#padding-box">填充框</a>作为参考框。

source: Uses the <code>fit-content</code> formula with the available space replaced by the specified argument, i.e. <code>min(max-content, max(min-content, <var>argument</var>))</code>.
ko: 사용 가능한 공간이 지정된 인수로 대체 된 <code>fit-content</code> 공식을 사용합니다 . 즉, <code>min(max-content, max(min-content, <var>argument</var>))</code> .
zh_cn: 使用 <code>fit-content</code> 公式，将可用空间替换为指定的参数，即 <code>min(max-content, max(min-content, <var>argument</var>))</code> 。

source: Uses the fit-content formula with the available space replaced by the specified argument, i.e. <code>min(max-content, max(min-content, &lt;length-percentage&gt;))</code>.
ko: 사용 가능한 공간이 지정된 인수로 대체 된 fit-content 공식을 사용합니다. 즉, <code>min(max-content, max(min-content, &lt;length-percentage&gt;))</code> .
zh_cn: 使用fit-content公式，将可用空间替换为指定的参数，即 <code>min(max-content, max(min-content, &lt;length-percentage&gt;))</code> 。

source: Uses the fit-content formula with the available space replaced by the specified argument, i.e. min(max-content, max(min-content, )).
ko: 지정된 인수, 즉 min (max-content, max (min-content,))로 대체 된 사용 가능한 공간과 함께 fit-content 공식을 사용합니다.
zh_cn: 使用fit-content公式,用指定的参数替换可用空间,即min(max-content,max(min-content,))。

source: Uses the nearest SVG viewport as reference box. If a <code><a href="https://developer.mozilla.org/en-US/docs/Web/SVG/Attribute/viewBox">viewBox</a></code> attribute is specified for the element creating the SVG viewport, the reference box is positioned at the origin of the coordinate system established by the <code>viewBox</code> attribute and the dimension of the reference box is set to the width and height values of the <code>viewBox</code> attribute.
es: Utiliza la ventana gr&aacute;fica SVG m&aacute;s cercana como cuadro de referencia. Si se especifica un atributo <code><a href="https://developer.mozilla.org/en-US/docs/Web/SVG/Attribute/viewBox">viewBox</a></code> para el elemento que crea la ventana gr&aacute;fica SVG, el cuadro de referencia se coloca en el origen del sistema de coordenadas establecido por el atributo <code>viewBox</code> y la dimensi&oacute;n del cuadro de referencia se establece en los valores de ancho y alto del atributo <code>viewBox</code> .
ko: 가장 가까운 SVG 뷰포트를 참조 상자로 사용합니다. 경우 <code><a href="https://developer.mozilla.org/en-US/docs/Web/SVG/Attribute/viewBox">viewBox</a></code> 속성이 SVG 뷰포트를 생성 요소에 대해 지정된, 기준 상자에 의해 설정된 좌표 시스템의 원점에 위치 <code>viewBox</code> 의 너비와 높이 값으로 설정된 속성과 기준 상자의 치수 <code>viewBox</code> 속성 .
zh_cn: 使用最近的SVG视口作为参考框。如果为创建SVG视口的元素指定了 <code><a href="https://developer.mozilla.org/en-US/docs/Web/SVG/Attribute/viewBox">viewBox</a></code> 属性，则参考框位于由 <code>viewBox</code> 属性建立的坐标系的原点，并且参考框的尺寸设置为 <code>viewBox</code> 属性的宽度和高度值。

source: Uses the nearest SVG viewport as the reference box. If a <code><a href="https://developer.mozilla.org/en-US/docs/Web/SVG/Attribute/viewBox">viewBox</a></code> attribute is specified for the element creating the SVG viewport, the reference box is positioned at the origin of the coordinate system established by the <code>viewBox</code> attribute and the dimension of the size of the reference box is set to the width and height values of the <code>viewBox</code> attribute.
es: Utiliza la ventana gr&aacute;fica SVG m&aacute;s cercana como el cuadro de referencia. Si se especifica un atributo <code><a href="https://developer.mozilla.org/en-US/docs/Web/SVG/Attribute/viewBox">viewBox</a></code> para el elemento que crea la ventana gr&aacute;fica SVG, el cuadro de referencia se coloca en el origen del sistema de coordenadas establecido por el atributo <code>viewBox</code> y la dimensi&oacute;n del tama&ntilde;o del cuadro de referencia se establece en los valores de ancho y alto de la <code>viewBox</code> atributo.
ko: 가장 가까운 SVG 뷰포트를 참조 상자로 사용합니다. 경우 <code><a href="https://developer.mozilla.org/en-US/docs/Web/SVG/Attribute/viewBox">viewBox</a></code> 속성이 SVG 뷰포트를 생성 요소에 대해 지정된, 기준 상자에 의해 설정된 좌표 시스템의 원점에 위치 <code>viewBox</code> 폭과 높이의 값으로 설정된 속성과 기준 상자의 크기의 치수 <code>viewBox</code> 속성.
zh_cn: 使用最近的SVG视口作为参考框。如果为创建SVG视口的元素指定了 <code><a href="https://developer.mozilla.org/en-US/docs/Web/SVG/Attribute/viewBox">viewBox</a></code> 属性，则参考框位于由 <code>viewBox</code> 属性建立的坐标系的原点，并且参考框尺寸的尺寸设置为的宽度和高度值。在 <code>viewBox</code> 属性。

source: Uses the non-standard name: <code>-apple-system</code>
es: Utiliza el nombre no est&aacute;ndar: <code>-apple-system</code>
ko: 비표준 이름을 사용합니다. <code>-apple-system</code>
zh_cn: 使用非标准名称： <code>-apple-system</code>

source: Uses the non-standard name: <code>-moz-available</code>
es: Utiliza el nombre no est&aacute;ndar: <code>-moz-available</code>
ko: 비표준 이름을 사용합니다. <code>-moz-available</code>
zh_cn: 使用非标准名称： <code>-moz-available</code>

source: Uses the non-standard name: <code>-moz-background-inline-policy</code>
es: Utiliza el nombre no est&aacute;ndar: <code>-moz-background-inline-policy</code>
ko: 비표준 이름을 사용합니다. <code>-moz-background-inline-policy</code>
zh_cn: 使用非标准名称： <code>-moz-background-inline-policy</code>

source: Uses the non-standard name: <code>-moz-border-end-color</code>
es: Utiliza el nombre no est&aacute;ndar: <code>-moz-border-end-color</code>
ko: 비표준 이름을 사용합니다. <code>-moz-border-end-color</code>
zh_cn: 使用非标准名称： <code>-moz-border-end-color</code>

source: Uses the non-standard name: <code>-moz-border-end-style</code>
es: Utiliza el nombre no est&aacute;ndar: <code>-moz-border-end-style</code>
ko: 비표준 이름을 사용합니다. <code>-moz-border-end-style</code>
zh_cn: 使用非标准名称： <code>-moz-border-end-style</code>

source: Uses the non-standard name: <code>-moz-border-end-width</code>
es: Utiliza el nombre no est&aacute;ndar: <code>-moz-border-end-width</code>
ko: 비표준 이름을 사용합니다. <code>-moz-border-end-width</code>
zh_cn: 使用非标准名称： <code>-moz-border-end-width</code>

source: Uses the non-standard name: <code>-moz-border-radius-bottomleft</code>
es: Utiliza el nombre no est&aacute;ndar: <code>-moz-border-radius-bottomleft</code>
ko: 비표준 이름을 사용합니다. <code>-moz-border-radius-bottomleft</code>
zh_cn: 使用非标准名称： <code>-moz-border-radius-bottomleft</code>

source: Uses the non-standard name: <code>-moz-border-radius-bottomright</code>
es: Utiliza el nombre no est&aacute;ndar: <code>-moz-border-radius-bottomright</code>
ko: 비표준 이름을 사용합니다. <code>-moz-border-radius-bottomright</code>
zh_cn: 使用非标准名称： <code>-moz-border-radius-bottomright</code>

source: Uses the non-standard name: <code>-moz-border-radius-topleft</code>
es: Utiliza el nombre no est&aacute;ndar: <code>-moz-border-radius-topleft</code>
ko: 비표준 이름을 사용합니다. <code>-moz-border-radius-topleft</code>
zh_cn: 使用非标准名称： <code>-moz-border-radius-topleft</code>

source: Uses the non-standard name: <code>-moz-border-radius-topright</code>
es: Utiliza el nombre no est&aacute;ndar: <code>-moz-border-radius-topright</code>
ko: 비표준 이름을 사용합니다. <code>-moz-border-radius-topright</code>
zh_cn: 使用非标准名称： <code>-moz-border-radius-topright</code>

source: Uses the non-standard name: <code>-moz-border-start-color</code>
es: Utiliza el nombre no est&aacute;ndar: <code>-moz-border-start-color</code>
ko: 비표준 이름을 사용합니다. <code>-moz-border-start-color</code>
zh_cn: 使用非标准名称： <code>-moz-border-start-color</code>

source: Uses the non-standard name: <code>-moz-border-start-style</code>
es: Utiliza el nombre no est&aacute;ndar: <code>-moz-border-start-style</code>
ko: 비표준 이름을 사용합니다. <code>-moz-border-start-style</code>
zh_cn: 使用非标准名称： <code>-moz-border-start-style</code>

source: Uses the non-standard name: <code>-moz-hidden-unscrollable</code>
ko: 비표준 이름 사용 : <code>-moz-hidden-unscrollable</code>
zh_cn: 使用非标准名称： <code>-moz-hidden-unscrollable</code>

source: Uses the non-standard name: <code>-moz-margin-end</code>
es: Utiliza el nombre no est&aacute;ndar: <code>-moz-margin-end</code>
ko: 비표준 이름을 사용합니다. <code>-moz-margin-end</code>
zh_cn: 使用非标准名称： <code>-moz-margin-end</code>

source: Uses the non-standard name: <code>-moz-margin-start</code>
es: Utiliza el nombre no est&aacute;ndar: <code>-moz-margin-start</code>
ko: 비표준 이름을 사용합니다. <code>-moz-margin-start</code>
zh_cn: 使用非标准名称： <code>-moz-margin-start</code>

source: Uses the non-standard name: <code>-moz-osx-font-smoothing</code>
ko: 비표준 이름 사용 : <code>-moz-osx-font-smoothing</code>
zh_cn: 使用非标准名称： <code>-moz-osx-font-smoothing</code>

source: Uses the non-standard name: <code>-moz-padding-end</code>
es: Utiliza el nombre no est&aacute;ndar: <code>-moz-padding-end</code>
ko: 비표준 이름을 사용합니다. <code>-moz-padding-end</code>
zh_cn: 使用非标准名称： <code>-moz-padding-end</code>

source: Uses the non-standard name: <code>-moz-padding-start</code>
es: Utiliza el nombre no est&aacute;ndar: <code>-moz-padding-start</code>
ko: 비표준 이름을 사용합니다. <code>-moz-padding-start</code>
zh_cn: 使用非标准名称： <code>-moz-padding-start</code>

source: Uses the non-standard name: <code>-ms-flex-positive</code>
es: Utiliza el nombre no est&aacute;ndar: <code>-ms-flex-positive</code>
ko: 비표준 이름을 사용합니다. <code>-ms-flex-positive</code>
zh_cn: 使用非标准名称： <code>-ms-flex-positive</code>

source: Uses the non-standard name: <code>-ms-flexbox</code>
es: Utiliza el nombre no est&aacute;ndar: <code>-ms-flexbox</code>
ko: 비표준 이름을 사용합니다. <code>-ms-flexbox</code>
zh_cn: 使用非标准名称： <code>-ms-flexbox</code>

source: Uses the non-standard name: <code>-ms-grid-columns</code>
es: Utiliza el nombre no est&aacute;ndar: <code>-ms-grid-columns</code>
ko: 비표준 이름을 사용합니다. <code>-ms-grid-columns</code>
zh_cn: 使用非标准名称： <code>-ms-grid-columns</code>

source: Uses the non-standard name: <code>-ms-grid-rows</code>
es: Utiliza el nombre no est&aacute;ndar: <code>-ms-grid-rows</code>
ko: 비표준 이름을 사용합니다. <code>-ms-grid-rows</code>
zh_cn: 使用非标准名称： <code>-ms-grid-rows</code>

source: Uses the non-standard name: <code>-ms-inline-flexbox</code>
es: Utiliza el nombre no est&aacute;ndar: <code>-ms-inline-flexbox</code>
ko: 비표준 이름을 사용합니다. <code>-ms-inline-flexbox</code>
zh_cn: 使用非标准名称： <code>-ms-inline-flexbox</code>

source: Uses the non-standard name: <code>-ms-text-combine-horizontal</code>
es: Utiliza el nombre no est&aacute;ndar: <code>-ms-text-combine-horizontal</code>
ko: 비표준 이름을 사용합니다. <code>-ms-text-combine-horizontal</code>
zh_cn: 使用非标准名称： <code>-ms-text-combine-horizontal</code>

source: Uses the non-standard name: <code>-webkit-fill-available</code>
es: Utiliza el nombre no est&aacute;ndar: <code>-webkit-fill-available</code>
ko: 비표준 이름을 사용합니다. <code>-webkit-fill-available</code>
zh_cn: 使用非标准名称： <code>-webkit-fill-available</code>

source: Uses the non-standard name: <code>-webkit-font-smoothing</code>
ko: 비표준 이름 사용 : <code>-webkit-font-smoothing</code>
zh_cn: 使用非标准名称： <code>-webkit-font-smoothing</code>

source: Uses the non-standard name: <code>-webkit-margin-end</code>
es: Utiliza el nombre no est&aacute;ndar: <code>-webkit-margin-end</code>
ko: 비표준 이름을 사용합니다. <code>-webkit-margin-end</code>
zh_cn: 使用非标准名称： <code>-webkit-margin-end</code>

source: Uses the non-standard name: <code>-webkit-margin-start</code>
es: Utiliza el nombre no est&aacute;ndar: <code>-webkit-margin-start</code>
ko: 비표준 이름을 사용합니다. <code>-webkit-margin-start</code>
zh_cn: 使用非标准名称： <code>-webkit-margin-start</code>

source: Uses the non-standard name: <code>-webkit-optimize-contrast</code>
es: Utiliza el nombre no est&aacute;ndar: <code>-webkit-optimize-contrast</code>
ko: 비표준 이름을 사용합니다. <code>-webkit-optimize-contrast</code>
zh_cn: 使用非标准名称： <code>-webkit-optimize-contrast</code>

source: Uses the non-standard name: <code>-webkit-padding-end</code>
es: Utiliza el nombre no est&aacute;ndar: <code>-webkit-padding-end</code>
ko: 비표준 이름을 사용합니다. <code>-webkit-padding-end</code>
zh_cn: 使用非标准名称： <code>-webkit-padding-end</code>

source: Uses the non-standard name: <code>-webkit-padding-start</code>
es: Utiliza el nombre no est&aacute;ndar: <code>-webkit-padding-start</code>
ko: 비표준 이름을 사용합니다. <code>-webkit-padding-start</code>
zh_cn: 使用非标准名称： <code>-webkit-padding-start</code>

source: Uses the non-standard name: <code>-webkit-print-color-adjust</code>
ko: 비표준 이름 사용 : <code>-webkit-print-color-adjust</code>
zh_cn: 使用非标准名称： <code>-webkit-print-color-adjust</code>

source: Uses the non-standard name: <code>-webkit-text-combine</code>
es: Utiliza el nombre no est&aacute;ndar: <code>-webkit-text-combine</code>
ko: 비표준 이름을 사용합니다. <code>-webkit-text-combine</code>
zh_cn: 使用非标准名称： <code>-webkit-text-combine</code>

source: Uses the non-standard name: <code>:-moz-any()</code>
ko: 비표준 이름 사용 : <code>:-moz-any()</code>
zh_cn: 使用非标准名称：： <code>:-moz-any()</code>

source: Uses the non-standard name: <code>:-moz-focusring</code>
ko: 비표준 이름 사용 : <code>:-moz-focusring</code>
zh_cn: 使用非标准名称：： <code>:-moz-focusring</code>

source: Uses the non-standard name: <code>:-moz-full-screen</code>
es: Utiliza el nombre no est&aacute;ndar <code>:-moz-full-screen</code>
ko: 비표준 이름을 사용합니다 : <code>:-moz-full-screen</code>
zh_cn: 使用非标准名称：： <code>:-moz-full-screen</code>

source: Uses the non-standard name: <code>:-moz-only-whitespace</code>
es: Utiliza el nombre no est&aacute;ndar <code>:-moz-only-whitespace</code>
ko: 비표준 이름을 사용합니다 : <code>:-moz-only-whitespace</code>
zh_cn: 使用非标准名称：： <code>:-moz-only-whitespace</code>

source: Uses the non-standard name: <code>:-moz-placeholder</code>
es: Utiliza el nombre no est&aacute;ndar <code>:-moz-placeholder</code>
ko: 비표준 이름을 사용합니다 : <code>:-moz-placeholder</code>
zh_cn: 使用非标准名称：： <code>:-moz-placeholder</code>

source: Uses the non-standard name: <code>:-ms-input-placeholder</code>
es: Utiliza el nombre no est&aacute;ndar <code>:-ms-input-placeholder</code>
ko: 비표준 이름을 사용합니다. <code>:-ms-input-placeholder</code>
zh_cn: 使用非标准名称：： <code>:-ms-input-placeholder</code>

source: Uses the non-standard name: <code>:-webkit-any()</code>
ko: 비표준 이름 사용 : <code>:-webkit-any()</code>
zh_cn: 使用非标准名称：： <code>:-webkit-any()</code>

source: Uses the non-standard name: <code>:-webkit-full-screen</code>
es: Utiliza el nombre no est&aacute;ndar <code>:-webkit-full-screen</code>
ko: 비표준 이름을 사용합니다 : <code>:-webkit-full-screen</code>
zh_cn: 使用非标准名称：： <code>:-webkit-full-screen</code>

source: Uses the non-standard name: <code>::-webkit-file-upload-button</code>
ko: 비표준 이름 사용 : <code>::-webkit-file-upload-button</code>
zh_cn: 使用非标准名称 <code>::-webkit-file-upload-button</code>

source: Uses the non-standard name: <code>:after</code>
es: Utiliza el nombre no est&aacute;ndar <code>:after</code>
ko: 비표준 이름을 사용합니다 : <code>:after</code>
zh_cn: 使用非标准名称 <code>:after</code>

source: Uses the non-standard name: <code>:before</code>
es: Utiliza el nombre no est&aacute;ndar <code>:before</code>
ko: 비표준 이름을 사용합니다 : <code>:before</code>
zh_cn: 使用非标准名称 <code>:before</code>

source: Uses the non-standard name: <code>:first-letter</code>
es: Utiliza el nombre no est&aacute;ndar <code>:first-letter</code>
ko: 비표준 이름을 사용합니다 : <code>:first-letter</code>
zh_cn: 使用非标准名称 <code>:first-letter</code>

source: Uses the non-standard name: <code>:first-line</code>
es: Utiliza el nombre no est&aacute;ndar <code>:first-line</code>
ko: 비표준 이름을 사용합니다 : <code>:first-line</code>
zh_cn: 使用非标准名称 <code>:first-line</code>

source: Uses the non-standard name: <code>:matches()</code>
ko: 비표준 이름 사용 : <code>:matches()</code>
zh_cn: 使用非标准名称 <code>:matches()</code>

source: Uses the non-standard name: <code>constant</code>
es: Utiliza el nombre no est&aacute;ndar: <code>constant</code> e
ko: 비표준 이름을 사용합니다 : <code>constant</code>
zh_cn: 使用非标准名称： <code>constant</code>

source: Uses the non-standard name: <code>device-pixel-ratio</code>
es: Utiliza el nombre no est&aacute;ndar: <code>device-pixel-ratio</code>
ko: 비표준 이름을 사용합니다 : <code>device-pixel-ratio</code>
zh_cn: 使用非标准名称： <code>device-pixel-ratio</code>

source: Uses the non-standard name: <code>element</code>
es: Utiliza el nombre no est&aacute;ndar: <code>element</code> o
ko: 비표준 이름을 사용합니다 : <code>element</code>
zh_cn: 使用非标准名称： <code>element</code>

source: Uses the non-standard name: <code>grid-column-gap</code>
ko: 비표준 이름 사용 : <code>grid-column-gap</code>
zh_cn: 使用非标准名称： <code>grid-column-gap</code>

source: Uses the non-standard name: <code>grid-gap</code>
es: Utiliza el nombre no est&aacute;ndar: <code>grid-gap</code>
ko: 비표준 이름을 사용합니다 : <code>grid-gap</code>
zh_cn: 使用非标准名称： <code>grid-gap</code>

source: Uses the non-standard name: <code>grid-row-gap</code>
es: Utiliza el nombre no est&aacute;ndar: <code>grid-row-gap</code>
ko: 비표준 이름을 사용합니다 : <code>grid-row-gap</code>
zh_cn: 使用非标准名称： <code>grid-row-gap</code>

source: Uses the non-standard name: <code>intrinsic</code>
es: Utiliza el nombre no est&aacute;ndar: <code>intrinsic</code>
ko: 비표준 이름을 사용합니다. <code>intrinsic</code>
zh_cn: 使用非标准名称： <code>intrinsic</code>

source: Uses the non-standard name: <code>min-intrinsic</code>
es: Utiliza el nombre no est&aacute;ndar: <code>min-intrinsic</code>
ko: 비표준 이름 인 <code>min-intrinsic</code> 을 사용합니다.
zh_cn: 使用非标准名称： <code>min-intrinsic</code>

source: Uses the non-standard name: <code>motion-distance</code>
es: Utiliza el nombre no est&aacute;ndar: <code>motion-distance</code>
ko: 비표준 이름을 사용합니다 : <code>motion-distance</code>
zh_cn: 使用非标准名称： <code>motion-distance</code>

source: Uses the non-standard name: <code>motion-path</code>
es: Utiliza el nombre no est&aacute;ndar: <code>motion-path</code>
ko: 비표준 이름을 사용합니다 : <code>motion-path</code>
zh_cn: 使用非标准名称： <code>motion-path</code>

source: Uses the non-standard name: <code>motion-rotation</code>
ko: 비표준 이름 사용 : <code>motion-rotation</code>
zh_cn: 使用非标准名称： <code>motion-rotation</code>

source: Uses the non-standard name: <code>motion</code>
es: Utiliza el nombre no est&aacute;ndar: <code>motion</code>
ko: 비표준 이름을 사용합니다 : <code>motion</code>
zh_cn: 使用非标准名称： <code>motion</code>

source: Uses the non-standard name: <code>offset-block-end</code>
es: Utiliza el nombre no est&aacute;ndar: <code>offset-block-end</code>
ko: 비표준 이름을 사용합니다. <code>offset-block-end</code>
zh_cn: 使用非标准名称： <code>offset-block-end</code>

source: Uses the non-standard name: <code>offset-block-start</code>
es: Utiliza el nombre no est&aacute;ndar: <code>offset-block-start</code>
ko: 비표준 이름을 사용합니다. <code>offset-block-start</code>
zh_cn: 使用非标准名称： <code>offset-block-start</code>
