Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/css/css.*.017.xlf
Languages: es, ko, zh_cn

source: When creating a shape, the reference box is defined by each property that uses <code>&lt;basic-shape&gt;</code> values. The coordinate system for the shape has its origin at the top-left corner of the reference box, with the x-axis running to the right and the y-axis running downwards. All the lengths expressed in percentages are resolved from the used dimensions of the reference box.
es: Al crear una forma, el cuadro de referencia se define por cada propiedad que utiliza valores <code>&lt;basic-shape&gt;</code> . El sistema de coordenadas para la forma tiene su origen en la esquina superior izquierda del cuadro de referencia, con el eje x corriendo hacia la derecha y el eje y corriendo hacia abajo. Todas las longitudes expresadas en porcentajes se resuelven a partir de las dimensiones utilizadas del cuadro de referencia.
ko: 셰이프를 만들 때 참조 상자는 <code>&lt;basic-shape&gt;</code> 값 을 사용하는 각 속성으로 정의됩니다 . 모양의 좌표계는 참조 상자의 왼쪽 상단에 원점이 있으며 x 축은 오른쪽으로, y 축은 아래쪽으로 이동합니다. 백분율로 표현 된 모든 길이는 참조 상자의 사용 된 치수에서 확인됩니다.
zh_cn: 创建形状时，参考框由使用 <code>&lt;basic-shape&gt;</code> 值的每个属性定义。形状的坐标系的原点位于参考框的左上角，x轴向右，y轴向下。所有以百分比表示的长度都从参考框的使用尺寸中解析出来。

source: When creating our example grid we specifically defined our column tracks with the <a href="../grid-template-columns"><code>grid-template-columns</code></a> property, but the grid also created rows on its own. These rows are part of the implicit grid. Whereas the explicit grid consists of any rows and columns defined with <a href="../grid-template-columns"><code>grid-template-columns</code></a> or <a href="../grid-template-rows"><code>grid-template-rows</code></a>.
es: Al crear nuestra cuadr&iacute;cula de ejemplo, definimos espec&iacute;ficamente nuestras pistas de columna con la propiedad <a href="../grid-template-columns"> <code>grid-template-columns</code> </a> , pero la cuadr&iacute;cula tambi&eacute;n cre&oacute; filas por s&iacute; misma. Estas filas son parte de la cuadr&iacute;cula impl&iacute;cita. Mientras que la grilla expl&iacute;cita consiste en cualquier fila y columna definida con <a href="../grid-template-columns"> <code>grid-template-columns</code> </a> o <a href="../grid-template-rows"> <code>grid-template-rows</code> </a> .
ko: 예제 그리드를 만들 때 <a href="../grid-template-columns"> <code>grid-template-columns</code> </a> 속성을 사용하여 열 트랙을 구체적으로 정의 했지만 그리드도 자체적으로 행을 만들었습니다. 이 행은 암시 적 그리드의 일부입니다. 명시 적 그리드는 <a href="../grid-template-columns"> <code>grid-template-columns</code> </a> 또는 <a href="../grid-template-rows"> <code>grid-template-rows</code> 로</a> 정의 된 행과 열로 구성됩니다 .
zh_cn: 在创建示例网格时，我们使用<a href="../grid-template-columns"> <code>grid-template-columns</code> </a>属性专门定义了列轨迹，但是网格也自行创建了行。这些行是隐式网格的一部分。而显式网格由使用<a href="../grid-template-columns"> <code>grid-template-columns</code> </a>或<a href="../grid-template-rows"> <code>grid-template-rows</code> </a>定义的任何行和列组成。

source: When dealing with multiple-line flex containers however you need to understand that the wrapping is re-done <em>after</em> collapsing. So the browser needs to re-do the wrapping behaviour to account for the new space that the collapsed item has left in the inline direction.
es: Sin embargo, cuando se trata de contenedores flexibles de varias l&iacute;neas, debe comprender que el ajuste se vuelve a realizar <em>despu&eacute;s del</em> colapso. Por lo tanto, el navegador debe volver a realizar el comportamiento de ajuste para tener en cuenta el nuevo espacio que el elemento contra&iacute;do ha dejado en la direcci&oacute;n en l&iacute;nea.
ko: 그러나 여러 줄로 된 플렉스 용기를 다룰 때는 접은 <em>후에</em> 포장이 다시 완료된다는 것을 이해해야합니다 . 따라서 접힌 항목이 인라인 방향으로 남은 새 공간을 설명하기 위해 브라우저는 줄 바꿈 동작을 다시 수행해야합니다.
zh_cn: 但是，在处理多行flex容器时，您需要了解折叠<em>后</em>要重新包装。因此，浏览器需要重新执行包装行为，以解决折叠项在嵌入式方向上留下的新空间。

source: When defining custom counter styles, the <code>negative</code> descriptor lets you alter the representations of negative counter values, by providing a way to specify symbols to be appended or prepended to the counter representation when the value is negative.
es: Al definir estilos de contador personalizados, el descriptor <code>negative</code> permite alterar las representaciones de los valores de los contadores negativos, al proporcionar una forma de especificar s&iacute;mbolos que se agregar&aacute;n o anexar&aacute;n a la representaci&oacute;n del contador cuando el valor sea negativo.
ko: 사용자 정의 카운터 스타일을 정의 할 때 <code>negative</code> 설명자를 사용하면 값이 음수 일 때 카운터 표현에 추가되거나 추가 될 기호를 지정하는 방법을 제공하여 음수 카운터 값의 표현을 변경할 수 있습니다.
zh_cn: 定义自定义计数器样式时，使用 <code>negative</code> 描述符可以通过提供一种方法来指定负计数器值的表示形式，该方法可以指定负值时要在计数器表示形式之后附加或添加的符号。

source: When defining custom counter styles, the <code>range</code> descriptor lets the author specify a range of counter values over which the style is applied. If a counter value is outside the specified range, then the fallback style will be used to construct the representation of that marker.
ko: 사용자 정의 카운터 스타일을 정의 할 때 <code>range</code> 설명자를 통해 작성자는 스타일이 적용되는 카운터 값의 범위를 지정할 수 있습니다. 카운터 값이 지정된 범위를 벗어나면 해당 마커의 표현을 구성하는 데 대체 스타일이 사용됩니다.
zh_cn: 在定义自定义计数器样式时， <code>range</code> 描述符使作者可以指定在其上应用样式的计数器值范围。如果计数器值超出指定范围，则将使用后备样式来构造该标记的表示形式。

source: When defining custom counter styles, the <code>range</code> descriptor lets the author specify a range of counter values over which the style is applied. If a counter value is outside the specified range, then the fallback style will be used to construct the representation of that marker. Value of the range descriptor can be either auto or a comma separated list of lower and upper bounds specified as integers.
es: Al definir estilos de contador personalizados, el descriptor de <code>range</code> permite al autor especificar un rango de valores de contador sobre los que se aplica el estilo. Si un valor de contador est&aacute; fuera del rango especificado, el estilo alternativo se usar&aacute; para construir la representaci&oacute;n de ese marcador. El valor del descriptor de rango puede ser autom&aacute;tico o una lista separada por comas de los l&iacute;mites inferior y superior especificados como enteros.
ko: 사용자 정의 카운터 스타일을 정의 할 때 <code>range</code> 설명자는 작성자가 스타일이 적용되는 카운터 값의 범위를 지정할 수 있도록합니다. 카운터 값이 지정된 범위를 벗어나면 해당 마커의 표현을 구성하는 데 폴백 스타일이 사용됩니다. 범위 설명 자의 값은 자동 또는 정수로 지정된 하한 및 상한의 쉼표로 구분 된 목록 일 수 있습니다.
zh_cn: 在定义自定义计数器样式时， <code>range</code> 描述符使作者可以指定在其上应用样式的计数器值范围。如果计数器值超出指定范围，则将使用后备样式来构造该标记的表示形式。范围描述符的值可以是自动的，也可以是用逗号分隔的以整数形式指定的上下限列表。

source: When defining the grid, I name my lines inside square brackets. Those names can be anything you like. I have defined a name for the start and end of the container, both for rows and columns. Then defined the centre block of the grid as <code>content-start</code> and <code>content-end</code> again, both for columns and rows although you do not need to name all of the lines on your grid. You might choose to name just some key lines for your layout.
ko: 그리드를 정의 할 때 대괄호 안에 선 이름을 지정합니다. 이러한 이름은 원하는대로 지정할 수 있습니다. 행과 열 모두에 대해 컨테이너의 시작과 끝 이름을 정의했습니다. 그런 다음 그리드의 모든 행에 이름을 지정할 필요는 없지만 열과 행 모두에 대해 그리드의 중앙 블록을 <code>content-start</code> 및 <code>content-end</code> 로 다시 정의했습니다 . 레이아웃에 대한 일부 키 라인의 이름을 지정할 수도 있습니다.
zh_cn: 定义网格时，我在方括号内命名线条。这些名称可以是您喜欢的任何名称。我已经为行和列的容器的开头和结尾定义了一个名称。然后，尽管不需要命名网格上的所有行，也可以将列和行的网格中心块再次定义为 <code>content-start</code> 和 <code>content-end</code> 。您可以选择只为布局指定一些关键行。

source: When defining the grid, I name my lines inside square brackets. Those names can be anything you like. I have defined a name for the start and end up the container, both for rows and columns. Then defined the centre block of the grid as <code>content-start</code> and <code>content-end</code> again, both for columns and rows although you do not need to name all of the lines on your grid. You might choose to name just some key lines for your layout.
es: Al definir la cuadr&iacute;cula, nombro mis l&iacute;neas entre corchetes. Esos nombres pueden ser lo que quieras. He definido un nombre para el inicio y el final del contenedor, tanto para filas como para columnas. Luego defini&oacute; el bloque central de la cuadr&iacute;cula como <code>content-start</code> y <code>content-end</code> de nuevo, tanto para columnas como para filas, aunque no es necesario que nombre todas las l&iacute;neas de la cuadr&iacute;cula. Puede elegir nombrar solo algunas l&iacute;neas clave para su dise&ntilde;o.
ko: 그리드를 정의 할 때 대괄호 안에 선 이름을 지정합니다. 그 이름은 당신이 좋아하는 것이 될 수 있습니다. 컨테이너의 시작과 끝 이름을 행과 열 모두에 대해 정의했습니다. 그런 다음 그리드의 모든 블록의 이름을 지정할 필요는 없지만 열과 행 모두에 대해 그리드의 중심 블록을 <code>content-start</code> 및 <code>content-end</code> 다시 정의하십시오. 레이아웃의 일부 키 라인 이름 만 지정할 수도 있습니다.
zh_cn: 在定义网格时，我在方括号内命名线条。这些名称可以是您喜欢的任何名称。我为行和列定义了容器的开始和结束的名称。然后，尽管不需要命名网格上的所有行，但将网格的中心块再次定义为列和行的 <code>content-start</code> 和 <code>content-end</code> 。您可以选择只为布局指定一些关键行。

source: When describing Reference Boxes I explained that the margin-box will clip the shape. You can see this by moving the centre of our circle towards the content by setting the position to 60%. The centre of the circle is now nearer the content and the circle extends past the margin-box. This means that the extension becomes clipped and squared off.
es: Al describir las cajas de referencia expliqué que la caja de margen recortará la forma.Puedes ver esto moviendo el centro de nuestro círculo hacia el contenido fijando la posición al 60%.El centro del círculo está ahora más cerca del contenido y el círculo se extiende más allá de la caja de margen.Esto significa que la extensión se recortará y se cuadrará.
ko: 참조 상자를 설명 할 때 여백 상자가 모양을자를 것이라고 설명했습니다. 위치를 60 %로 설정하여 원의 중심을 콘텐츠를 향해 이동하면이를 확인할 수 있습니다. 원의 중심이 이제 내용에 가까워지고 원이 여백 상자를지나 연장됩니다. 이것은 확장이 잘리고 제곱 된 것을 의미합니다.
zh_cn: 在描述参考框时,我解释了margin-box会夹住形状。你可以通过将位置设置为60%,将圆圈的中心向内容方向移动来看到这一点。现在,圆的中心更接近内容,并且圆延伸过了 margin-box。这意味着,延伸变得剪裁和方块化。

source: When doing this, define the names for your areas outside of any media queries. That way the content area would always be called <code>main</code> no matter where on the grid it is placed.
es: Al hacer esto, defina los nombres para sus &aacute;reas fuera de cualquier consulta de medios. De esa manera, el &aacute;rea de contenido siempre se llamar&iacute;a <code>main</code> sin importar en qu&eacute; parte de la cuadr&iacute;cula se coloque.
ko: 이 작업을 수행 할 때 미디어 쿼리 외부의 영역 이름을 정의하십시오. 이렇게 하면 그리드의 위치에 상관없이 컨텐츠 영역을 항상 <code>main</code> 이라고 합니다.
zh_cn: 这样做时，请在任何媒体查询之外定义您所在区域的名称。这样，无论将内容区域放置在网格的哪个位置，都将始终将其称为 <code>main</code> 区域。

source: When drawing 3D graphics, or using a third dimension to layer objects from front to back, the <em>z-coordinate</em> is also used. This specifies the distance away from the viewer if positive and toward the viewer if negative.
es: Al dibujar gr&aacute;ficos 3D, o usar una tercera dimensi&oacute;n para superponer objetos de adelante hacia atr&aacute;s, tambi&eacute;n se usa la <em>coordenada z</em> . Esto especifica la distancia desde el espectador si es positivo y hacia el espectador si es negativo.
ko: 3D 그래픽을 그리거나 3 차원을 사용하여 객체를 앞뒤로 레이어링 할 때 <em>z 좌표</em> 도 사용됩니다. 양수인 경우 뷰어에서 멀어지고 음수 인 경우 뷰어를 향한 거리를 지정합니다.
zh_cn: 在绘制3D图形时，或使用三维尺寸从正面到背面对对象进行分层时，也将使用<em>z坐标</em>。如果为正，则指定远离观察者的距离；如果为负，则指定朝观察者的距离。

source: When form fields are too small, placeholder text can get cropped in an undesirable way. You can use the <a href="text-overflow"><code>text-overflow</code></a> property to alter the way overflowing text is displayed.
ko: 양식 필드가 너무 작 으면 자리 표시 자 텍스트가 바람직하지 않은 방식으로 잘릴 수 있습니다. <a href="text-overflow"> <code>text-overflow</code> </a> 속성을 사용하여 넘치는 텍스트가 표시되는 방식을 변경할 수 있습니다 .
zh_cn: 如果表单字段太小，占位符文本可能会以不希望的方式被裁剪。您可以使用<a href="text-overflow"> <code>text-overflow</code> </a>属性更改溢出文本的显示方式。

source: When in the normal flow, in a block formatting context, boxes are laid vertically one after the other out.
es: En el flujo normal,en un contexto de formato de bloque,las cajas se colocan verticalmente una tras otra hacia fuera.
ko: 정상적인 흐름에있을 때, 블록 형식화 상황에서 상자는 차례로 세로로 배치됩니다.
zh_cn: 当在正常的流程中,在块状格式化的背景下,方框是一个接一个垂直铺设出来的。

source: When in the normal flow, in an inline formatting context, boxes are laid horizontally one after the other out.
es: En el flujo normal,en un contexto de formato en línea,las cajas se colocan horizontalmente una tras otra hacia fuera.
ko: 일반 흐름에있을 때 인라인 서식 컨텍스트에서 상자는 가로로 하나씩 배치됩니다.
zh_cn: 当在正常的流程中,在内联格式化的背景下,方框是一个接一个水平铺设出来的。

source: When including a length value, if the length is <code>0</code>, the unit identifier is not required. Otherwise, the unit identifier is required, is case insensitive, and must come immediately after the numeric part of the value, with no space in-between.
ko: 길이 값을 포함 할 때 길이가 <code>0</code> 이면 단위 식별자가 필요하지 않습니다. 그렇지 않으면 단위 식별자가 필요하고 대소 문자를 구분하지 않으며 값의 숫자 부분 바로 뒤에 와야하며 사이에 공백이 없어야합니다.
zh_cn: 当包含长度值时，如果长度为 <code>0</code> ，则不需要单位标识符。否则，将需要单位标识符，该标识符不区分大小写，并且必须紧跟在值的数字部分之后，且中间不能有空格。

source: When laying out a document, the browser's rendering engine represents each element as a rectangular box according to the standard <strong>CSS basic box model</strong>. CSS determines the size, position, and properties (color, background, border size, etc.) of these boxes.
es: Al dise&ntilde;ar un documento, el motor de representaci&oacute;n del navegador representa cada elemento como un cuadro rectangular de acuerdo con el <strong>modelo de cuadro b&aacute;sico CSS</strong> est&aacute;ndar . CSS determina el tama&ntilde;o, la posici&oacute;n y las propiedades (color, fondo, tama&ntilde;o del borde, etc.) de estos cuadros.
ko: 문서를 배치 할 때 브라우저의 렌더링 엔진은 표준 <strong>CSS 기본 상자 모델</strong> 에 따라 각 요소를 직사각형 상자로 나타냅니다 . CSS는 이러한 상자의 크기, 위치 및 속성 (색상, 배경, 테두리 크기 등)을 결정합니다.
zh_cn: 布局文档时，浏览器的渲染引擎根据标准<strong>CSS基本框模型</strong>将每个元素表示为一个矩形框。CSS确定这些框的大小，位置和属性（颜色，背景，边框大小等）。

source: When more than one shadow is given, shadows are applied front-to-back, with the first-specified shadow on top.
es: Cuando se da más de una sombra,las sombras se aplican de adelante hacia atrás,con la primera sombra especificada en la parte superior.
ko: 하나 이상의 그림자가 주어지면, 그림자는 앞뒤로 적용되며, 가장 먼저 지정된 그림자가 맨 위에옵니다.
zh_cn: 当给出多个影子时,影子从前到后应用,第一个指定的影子在上面。

source: When multiple elements have been placed into full-screen mode, the backdrop is drawn immediately beneath the frontmost such element, and on top of the older full-screen elements.
es: Cuando se han colocado múltiples elementos en modo de pantalla completa,el fondo se dibuja inmediatamente debajo del elemento más frontal,y encima de los elementos más antiguos de pantalla completa.
ko: 여러 요소를 전체 화면 모드로 설정 한 경우 배경은 해당 요소의 맨 앞과 이전의 전체 화면 요소 바로 위에 그려집니다.
zh_cn: 当多个元素被放置到全屏模式时,背景会紧贴在最前面的元素下面,并在旧的全屏元素上面绘制。

source: When naming the lines, I mentioned that you can name these anything you like. The name is a <a href="https://drafts.csswg.org/css-values-4/#custom-idents">custom ident</a>, an author-defined name. When choosing the name you need to avoid words that might appear in the specification and be confusing - such as <code>span</code>. Idents are not quoted.
es: Al nombrar las l&iacute;neas, mencion&eacute; que puedes nombrarlas como quieras. El nombre es una <a href="https://drafts.csswg.org/css-values-4/#custom-idents">identificaci&oacute;n personalizada</a> , un nombre definido por el autor. Al elegir el nombre, debe evitar las palabras que puedan aparecer en la especificaci&oacute;n y que sean confusas, como por ejemplo, <code>span</code> . Los ideales no se citan.
ko: 선의 이름을 지정할 때 원하는 이름을 지정할 수 있다고 언급했습니다. 이름은 저자 정의 이름 인 <a href="https://drafts.csswg.org/css-values-4/#custom-idents">사용자 정의 ID</a> 입니다. 이름을 선택할 때는 사양에 나타날 수 있고 <code>span</code> 과 같이 혼동 될 수있는 단어를 피해야 합니다 . 식별자는 인용되지 않습니다.
zh_cn: 在命名行时，我提到您可以根据自己的喜好命名。该名称是一个<a href="https://drafts.csswg.org/css-values-4/#custom-idents">自定义ident</a>，即作者定义的名称。选择名称时，您需要避免在规范中可能出现且容易混淆的单词-例如 <code>span</code> 。没有引用标识。

source: When negative margins are involved, the size of the collapsed margin is the sum of the largest positive margin and the smallest (most negative) negative margin.
es: Cuando se trata de márgenes negativos,el tamaño del margen colapsado es la suma del margen positivo más grande y el margen negativo más pequeño (más negativo).
ko: 음수 여백이 포함 된 경우 축소 된 마진의 크기는 최대 양수 마진과 최소 (가장 음수) 음수 마진의 합입니다.
zh_cn: 当涉及负边距时,塌边距的大小为最大的正边距与最小(最负)的负边距之和。

source: When no <code>z-index</code> property is specified, elements are rendered on the default rendering layer 0 (zero).
ko: <code>z-index</code> 속성이 지정 되지 않은 경우 요소는 기본 렌더링 레이어 0 (영)에서 렌더링됩니다.
zh_cn: 如果未指定 <code>z-index</code> 属性，则在默认渲染层0（零）上渲染元素。

source: When no intrinsic ratio or dimensions are specified by the source image, rule 4 takes effect, and the image is rendered to fill the background area.
es: Cuando la imagen de origen no especifica ninguna relación o dimensión intrínseca,se aplica la regla 4 y la imagen se renderiza para llenar el área de fondo.
ko: 소스 이미지에서 고유 비율 또는 크기를 지정하지 않으면 규칙 4가 적용되고 이미지가 배경 영역을 채우도록 렌더링됩니다.
zh_cn: 当源图像没有指定固有比例或尺寸时,规则4生效,图像被渲染为填充背景区域。

source: When no value for a <strong>non-inherited property</strong> has been specified on an element, the element gets the <a href="initial_value">initial value</a> of that property (as specified in the property's summary).
es: Cuando no se ha especificado ning&uacute;n valor para una <strong>propiedad no heredada</strong> en un elemento, el elemento obtiene el <a href="initial_value">valor inicial</a> de esa propiedad (como se especifica en el resumen de la propiedad).
ko: <strong>상속되지 않은 속성</strong> 값 이 요소에 지정 <strong>되지 않은</strong> 경우 요소는 속성 요약에 지정된대로 해당 속성 의 <a href="initial_value">초기 값</a> 을 가져옵니다 .
zh_cn: 如果未在元素上指定<strong>非继承属性</strong>的<a href="initial_value">值</a>，则该元素将获取该属性的初始值（如属性摘要中所指定）。

source: When no value for an <strong>inherited property</strong> has been specified on an element, the element gets the <a href="computed_value">computed value</a> of that property on its parent element. Only the root element of the document gets the <a href="initial_value">initial value</a> given in the property's summary.
es: Cuando no se ha especificado ning&uacute;n valor para una <strong>propiedad heredada</strong> en un elemento, el elemento obtiene el <a href="computed_value">valor calculado</a> de esa propiedad en su elemento padre. Solo el elemento ra&iacute;z del documento obtiene el <a href="initial_value">valor inicial</a> dado en el resumen de la propiedad.
ko: <strong>상속 된 속성</strong> 값 이 요소에 지정되지 않은 경우 요소는 부모 요소에서 해당 속성 의 <a href="computed_value">계산 된 값</a> 을 가져옵니다 . 문서의 루트 요소 만 속성 요약에 지정된 <a href="initial_value">초기 값을</a> 가져옵니다 .
zh_cn: 在元素上未指定任何<strong>继承属性的</strong>值时，该元素将在其父元素上获取该属性的<a href="computed_value">计算值</a>。只有文档的根元素会获得属性摘要中给出的<a href="initial_value">初始值</a>。

source: When one value is specified, that one is painted first, followed by the other two in their default order relative to one another. When two values are specified, they will be painted in the order they are specified in, followed by the unspecified one.
es: Cuando se especifica un valor,ese se pinta primero,seguido de los otros dos en su orden por defecto relativo al otro.Cuando se especifican dos valores,se pintan en el orden en que se especifican,seguidos por el no especificado.
ko: 하나의 값이 지정되면 그 값이 먼저 칠 해지고 다른 두 값이 기본 순서대로 서로 칠해집니다. 두 개의 값이 지정되면 지정된 순서대로 페인트 된 다음 지정되지 않은 값이 그립니다.
zh_cn: 当指定一个值时,先画该值,然后按默认的相对顺序画其他两个值。当指定两个值时,将按指定的顺序绘制,然后是未指定的那个值。

source: When optical sizing is used, small text sizes are often rendered with thicker strokes and larger serifs, whereas larger text is often rendered more delicately with more contrast between thicker and thinner strokes.
ko: 광학 크기 조정을 사용하는 경우 작은 텍스트 크기는 종종 더 두꺼운 획과 더 큰 세리프로 렌더링되는 반면, 큰 텍스트는 더 두꺼운 획과 더 얇은 획 사이의 대비를 더 많이 사용하여 더 섬세하게 렌더링되는 경우가 많습니다.
zh_cn: 在使用光学尺码时,小尺寸的文字往往用较粗的笔画和较大的衬线来呈现,而大尺寸的文字往往用较粗和较细的笔画对比来呈现,更加细腻。

source: When printing a page, the browser might want to replace light-colored text on a dark background with dark text on a white background.
es: Al imprimir una página,el navegador puede querer reemplazar el texto de color claro sobre un fondo oscuro con el texto oscuro sobre un fondo blanco.
ko: 페이지를 인쇄 할 때 브라우저는 어두운 배경의 밝은 색 텍스트를 흰색 배경의 어두운 텍스트로 바꾸려고 할 수 있습니다.
zh_cn: 打印页面时,浏览器可能希望将深色背景的浅色文本替换为白色背景的深色文本。

source: When properties are left out of some keyframes
es: Cuando las propiedades se dejan fuera de algunos fotogramas clave
ko: 속성이 일부 키 프레임에서 제외 된 경우
zh_cn: 当某些关键帧的属性被遗漏时。

source: When property value lists are of different lengths
es: Cuando las listas de valor de las propiedades son de diferente longitud
ko: 특성 값 목록의 길이가 다른 경우
zh_cn: 当属性值列表的长度不同时

source: When range is specified as integers, the value <code>infinite</code> can be used to denote infinity. If <em>infinite</em> is specified as the first value in a range, then it is interpreted as negative infinity. If used as upper bound, it is taken as positive infinity.
es: Cuando el rango se especifica como enteros, el valor <code>infinite</code> se puede usar para denotar infinito. Si se especifica <em>infinito</em> como el primer valor en un rango, entonces se interpreta como infinito negativo. Si se usa como l&iacute;mite superior, se toma como infinito positivo.
ko: 범위가 정수로 지정되면 <code>infinite</code> 값을 사용하여 무한을 나타낼 수 있습니다. <em>무한대</em> 가 범위의 첫 번째 값으로 지정 되면 음의 무한대로 해석됩니다. 상한으로 사용되면 양의 무한대로 간주됩니다.
zh_cn: 如果将range指定为整数，则值 <code>infinite</code> 可用于表示无穷大。如果将<em>无限</em>指定为范围内的第一个值，则将其解释为负无限。如果用作上限，则将其视为正无穷大。

source: When rendering text, the list of OpenType axis names is passed to the text layout engine to enable or disable font features. Each setting is always a <a href="../string"><code>&lt;string&gt;</code></a> of 4 ASCII characters, followed by a <a href="../number"><code>&lt;number&gt;</code></a> indicating the axis value. If the <code>&lt;string&gt;</code> has more or fewer characters or contains characters outside the U+20 - U+7E codepoint range, the whole property is invalid. The <code>&lt;number&gt;</code> can be fractional or negative.
es: Al representar texto, la lista de nombres de eje OpenType se pasa al motor de dise&ntilde;o de texto para habilitar o deshabilitar las caracter&iacute;sticas de fuente. Cada configuraci&oacute;n es siempre una <a href="../string"> <code>&lt;string&gt;</code> </a> de 4 caracteres ASCII, seguida de un <a href="../number"> <code>&lt;number&gt;</code> </a> indica el valor del eje. Si la <code>&lt;string&gt;</code> tiene m&aacute;s o menos caracteres o contiene caracteres fuera del rango de puntos de c&oacute;digo U + 20 - U + 7E, toda la propiedad no es v&aacute;lida. El <code>&lt;number&gt;</code> puede ser fraccionario o negativo.
ko: 텍스트를 렌더링 할 때 OpenType 축 이름 목록이 텍스트 레이아웃 엔진으로 전달되어 글꼴 기능을 활성화 또는 비활성화합니다. 각 설정은 항상 4 개의 ASCII 문자로 구성된 <a href="../string"> <code>&lt;string&gt;</code> </a> 이며 축 값을 나타내는 <a href="../number"> <code>&lt;number&gt;</code> </a> 입니다. 는 IF <code>&lt;string&gt;</code> 많거나 적은 문자가 또는 U + (20) 이외의 문자가 포함 - U + 7E 코드 포인트 범위, 전체 재산이 잘못되었습니다. <code>&lt;number&gt;</code> 분수 또는 음수 일 수있다.
zh_cn: 呈现文本时，OpenType轴名称列表将传递到文本布局引擎以启用或禁用字体功能。每个设置始终是4个ASCII字符的<a href="../string"> <code>&lt;string&gt;</code> </a>，后跟<a href="../number"> <code>&lt;number&gt;</code> </a>指示轴值。如果 <code>&lt;string&gt;</code> 具有更多或更少的字符或包含U + 20-U + 7E代码点范围之外的字符，则整个属性无效。所述 <code>&lt;number&gt;</code> 可以是分数或负。
