Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/css/css.*.017.xlf
Languages: es, ko, zh_cn

source: When a keyframe is defined multiple times
es: Cuando un fotograma clave se define varias veces
ko: 키 프레임이 여러 번 정의 된 경우
zh_cn: 当一个关键帧被多次定义时

source: When a nested box is assigned a different writing mode to its parent, then an inline level box will display as if it has <code>display: inline-block</code>.
es: Cuando a un cuadro anidado se le asigna un modo de escritura diferente a su elemento primario, aparecer&aacute; un cuadro de nivel en l&iacute;nea como si tuviera <code>display: inline-block</code> .
ko: 중첩 된 상자에 상위에 다른 쓰기 모드가 할당되면 인라인 레벨 상자가 다음과 같이 <code>display: inline-block</code> .
zh_cn: 当嵌套框为其父级分配了不同的书写模式时，内联级别框将显示为好像具有 <code>display: inline-block</code> 。

source: When a non-<code>auto</code><code>flex-basis</code> is specified, Internet Explorer 10 and 11 always uses a <code>content-box</code> box model to calculate the size of a flex item, even if <a href="http://developer.mozilla.org/docs/Web/CSS/box-sizing"><code>box-sizing: border-box</code></a> is applied to the element. See <a href="https://github.com/philipwalton/flexbugs#7-flex-basis-doesnt-account-for-box-sizingborder-box">Flexbug #7</a> for more info.
es: Cuando se especifica <code>flex-basis</code> no <code>auto</code> m&aacute;tica , Internet Explorer 10 y 11 siempre usan un modelo de <code>content-box</code> cuadro de contenido para calcular el tama&ntilde;o de un elemento flexible, incluso si se aplica el tama&ntilde;o de <a href="http://developer.mozilla.org/docs/Web/CSS/box-sizing"> <code>box-sizing: border-box</code> </a> al elemento. Ver <a href="https://github.com/philipwalton/flexbugs#7-flex-basis-doesnt-account-for-box-sizingborder-box">Flexbug # 7</a> para m&aacute;s informaci&oacute;n.
ko: 비 <code>auto</code> <code>flex-basis</code> 을 지정하면 Internet Explorer 10 및 11은 <a href="http://developer.mozilla.org/docs/Web/CSS/box-sizing"> <code>box-sizing: border-box</code> </a> 가 요소에 적용 되더라도 항상 <code>content-box</code> 상자 모델을 사용하여 플렉스 항목의 크기를 계산합니다 . 자세한 내용은 <a href="https://github.com/philipwalton/flexbugs#7-flex-basis-doesnt-account-for-box-sizingborder-box">Flexbug # 7</a> 을 참조하십시오.
zh_cn: 当指定了非 <code>auto</code> <code>flex-basis</code> ，即使将<a href="http://developer.mozilla.org/docs/Web/CSS/box-sizing"> <code>box-sizing: border-box</code> </a>应用于元素，Internet Explorer 10和11也会始终使用 <code>content-box</code> 框框模型来计算伸缩项的大小。有关更多信息，请参见<a href="https://github.com/philipwalton/flexbugs#7-flex-basis-doesnt-account-for-box-sizingborder-box">Flexbug＃7</a>。

source: When a non-<code>auto</code><code>flex-basis</code> is specified, Internet Explorer 10 and 11 always uses a <code>content-box</code> box model to calculate the size of a flex item, even if <a href="https://developer.mozilla.org/docs/Web/CSS/box-sizing"><code>box-sizing: border-box</code></a> is applied to the element. See <a href="https://github.com/philipwalton/flexbugs#7-flex-basis-doesnt-account-for-box-sizingborder-box">Flexbug #7</a> for more info.
ko: 비 <code>auto</code> <code>flex-basis</code> 이 지정되면 Internet Explorer 10 및 11은 항상 <code>content-box</code> 상자 모델을 사용하여 플렉스 항목의 크기를 계산합니다. <a href="https://developer.mozilla.org/docs/Web/CSS/box-sizing"> <code>box-sizing: border-box</code> </a> 가 요소에 적용 되더라도 . 자세한 내용은 <a href="https://github.com/philipwalton/flexbugs#7-flex-basis-doesnt-account-for-box-sizingborder-box">Flexbug # 7</a> 을 참조하십시오.
zh_cn: 当指定了非 <code>auto</code> <code>flex-basis</code> ，即使将<a href="https://developer.mozilla.org/docs/Web/CSS/box-sizing"> <code>box-sizing: border-box</code> </a>应用于元素，Internet Explorer 10和11也会始终使用 <code>content-box</code> 框框模型来计算伸缩项的大小。有关更多信息，请参见<a href="https://github.com/philipwalton/flexbugs#7-flex-basis-doesnt-account-for-box-sizingborder-box">Flexbug＃7</a>。

source: When a single <code>filter</code> property has two or more functions it's results will be different from when two or more <code>filter</code> properties are separately applied with the same functions.
ko: 단일 <code>filter</code> 속성에 두 개 이상의 기능이있는 경우 두 개 이상의 <code>filter</code> 속성이 동일한 기능으로 개별적으로 적용될 때와 결과가 다릅니다 .
zh_cn: 当单个 <code>filter</code> 属性具有两个或多个函数时，其结果将与将两个或多个 <code>filter</code> 属性分别应用于相同的函数时的结果不同。

source: When a spanner is introduced, it breaks the flow of columns and columns restart after the spanner, effectively creating a new set of column boxes. The content does not jump over a spanning element.
es: Cuando se introduce una llave,se rompe el flujo de columnas y las columnas se reinician después de la llave,creando efectivamente un nuevo conjunto de cajas de columnas.El contenido no salta por encima de un elemento de la llave.
ko: 스패너가 도입되면 스패너가 열의 흐름을 중단하고 스패너 이후에 열이 다시 시작되어 새로운 열 상자 집합을 효과적으로 만듭니다. 내용이 스패닝 요소 위로 이동하지 않습니다.
zh_cn: 当引入一个跨接元素时,它打破了列的流动,列在跨接元素后重新开始,实际上是建立了一组新的列框。内容不会跳过跨栏元素。

source: When a target is touched and held on iOS, Safari displays a callout information about the link. This property allows disabling that behavior.
es: Cuando se toca y se mantiene un objetivo en el iOS,Safari muestra una información de llamada sobre el enlace.Esta propiedad permite deshabilitar ese comportamiento.
ko: iOS에서 대상을 터치하고 유지하면 Safari에 링크에 대한 설명 선 정보가 표시됩니다. 이 속성은 해당 동작을 비활성화 할 수 있습니다.
zh_cn: 当在iOS上触摸并按住目标时,Safari会显示链接的callout信息。此属性允许禁用该行为。

source: When a user agent (such as your browser) lays out a document, it generates a box for every element. Each box is divided into four areas:
es: Cuando un agente de usuario (como su navegador)presenta un documento,genera una caja para cada elemento.Cada caja se divide en cuatro áreas:
ko: 사용자 에이전트 (예 : 브라우저)가 문서를 배치 할 때 모든 요소에 대한 상자를 생성합니다. 각 상자는 네 영역으로 나뉩니다.
zh_cn: 当用户代理(比如你的浏览器)排版文档时,它会为每个元素生成一个方框。每个方框分为四个区域。

source: When a user pans or scrolls and then lifts his or her contact (for instance, a finger), the content can continue to move with inertia. Snap-points can change the animation that runs when the user lifts his or her finger so that you can adjust where the content will stop. By placing snap-points, you can make it easy for your users to manipulate your content and make it stop at convenient or key places.
es: Cuando un usuario se desplaza y luego levanta su contacto (por ejemplo,un dedo),el contenido puede seguir moviéndose con inercia.Los snap-points pueden cambiar la animación que se ejecuta cuando el usuario levanta el dedo para que puedas ajustar dónde se detendrá el contenido.Al colocar puntos de referencia,puede facilitar a los usuarios la manipulación del contenido y hacer que se detenga en lugares convenientes o clave.
ko: 사용자가 이동 또는 스크롤 한 다음 접촉 (예 : 손가락)을 들어 올리면 내용이 관성으로 계속 이동할 수 있습니다. 스냅 포인트는 사용자가 손가락을 들어 올릴 때 실행되는 애니메이션을 변경하여 내용이 멈출 위치를 조정할 수 있습니다. 스냅 포인트를 배치하면 사용자가 컨텐츠를 쉽게 조작하고 편리하거나 중요한 장소에서 멈출 수 있습니다.
zh_cn: 当用户平移或滚动,然后抬起他或她的接触点(例如手指)时,内容可以随着惯性继续移动。卡点可以改变用户抬起手指时运行的动画,这样你就可以调整内容的停止位置。通过放置快照点,你可以让你的用户很容易地操作你的内容,并使其在方便或关键的地方停止。

source: When aligning items on the block axis you will use the properties that begin <code>align-</code>:
es: Al alinear elementos en el eje del bloque, utilizar&aacute; las propiedades que comienzan a <code>align-</code> :
ko: 블록 축에서 항목을 정렬 할 때 <code>align-</code> : 시작하는 속성을 사용합니다 .
zh_cn: 在块轴上对齐项目时，将使用以 <code>align-</code> 开头的属性：

source: When aligning items on the inline axis you will use the properties which begin with <code>justify-</code>:
es: Al alinear elementos en el eje en l&iacute;nea, usar&aacute; las propiedades que comienzan con <code>justify-</code> :
ko: 인라인 축에서 항목을 정렬 할 때 <code>justify-</code> :로 시작하는 속성을 사용합니다 .
zh_cn: 当对齐内联轴上的项目时，将使用以 <code>justify-</code> 开头的属性：

source: When all margins are negative, the size of the collapsed margin is the smallest (most negative) margin. This applies to both adjacent elements and nested elements.
es: Cuando todos los márgenes son negativos,el tamaño del margen colapsado es el más pequeño (más negativo).Esto se aplica tanto a los elementos adyacentes como a los elementos anidados.
ko: 모든 여백이 음수이면 축소 된 여백의 크기는 가장 작은 (가장 음수) 여백입니다. 이것은 인접한 요소와 중첩 된 요소 모두에 적용됩니다.
zh_cn: 当所有的边距都是负数时,折叠边距的大小是最小的(最负数)边距。这适用于相邻元素和嵌套元素。

source: When all of the first four arguments are supplied they represent the top, right, bottom and left offsets from the reference box inward that define the positions of the edges of the inset rectangle. These arguments follow the syntax of the margin shorthand, that let you set all four insets with one, two or four values.
es: Cuando se suministran los cuatro primeros argumentos,representan los desplazamientos superior,derecho,inferior e izquierdo del cuadro de referencia hacia adentro que definen las posiciones de los bordes del rectángulo inserto.Estos argumentos siguen la sintaxis de la taquigrafía de los márgenes,que permiten establecer los cuatro recuadros con uno,dos o cuatro valores.
ko: 처음 네 개의 인수가 모두 제공되면 인수는 참조 상자에서 안쪽, 위쪽, 오른쪽, 아래쪽 및 왼쪽 오프셋을 나타냅니다. 여기에서 삽입 된 사각형의 가장자리 위치를 정의합니다. 이 인수는 여백 속기 구문을 따르므로 네 개의 삽입을 모두 하나, 둘 또는 네 개의 값으로 설정할 수 있습니다.
zh_cn: 当前四个参数都被提供时,它们代表了从参考框向内的上、右、下、左的偏移量,这些偏移量定义了镶边矩形边缘的位置。这些参数遵循 margin shorthand 的语法,让你用一个、两个或四个值来设置所有四个镶边。

source: When altering the indentation of lists, make sure to set both the padding and margin.
es: Cuando altere la sangría de las listas,asegúrese de establecer tanto el relleno como el margen.
ko: 목록 들여 쓰기를 변경할 때 패딩과 여백을 모두 설정해야합니다.
zh_cn: 在改变列表的缩进时,一定要同时设置padding和margin。

source: When an <code>important</code> rule is used on a style declaration, this declaration overrides any other declarations. Although technically <code>!important</code> has nothing to do with specificity, it interacts directly with it. Using <code>!important,</code> however, is <strong>bad practice</strong> and should be avoided because it makes debugging more difficult by breaking the natural <a href="cascade">cascading</a> in your stylesheets. When two conflicting declarations with the <code>!important</code> rule are applied to the same element, the declaration with a greater specificity will be applied.
es: Cuando se usa una regla <code>important</code> e en una declaraci&oacute;n de estilo, esta declaraci&oacute;n anula cualquier otra declaraci&oacute;n. Aunque t&eacute;cnicamente <code>!important</code> no tiene nada que ver con la especificidad, interact&uacute;a directamente con &eacute;l. Sin embargo, usar <code>!important,</code> es una <strong>mala pr&aacute;ctica</strong> y debe evitarse porque dificulta la depuraci&oacute;n al romper la <a href="cascade">cascada</a> natural en las hojas de estilo. Cuando dos declaraciones en conflicto con la regla <code>!important</code> se aplican al mismo elemento, se aplicar&aacute; la declaraci&oacute;n con mayor especificidad.
ko: 때 <code>important</code> 규칙이 스타일 선언에 사용되는,이 선언은 다른 선언을 무시합니다. 기술적으로 <code>!important</code> 특정 성과는 관련이 없지만 직접적으로 상호 작용합니다. 그러나 <code>!important,</code> 사용하는 것은 <strong>나쁜 습관</strong> 이며 스타일 시트에서 자연적인 <a href="cascade">계단식</a> 을 끊어 디버깅을 더 어렵게하므로 피해야 합니다. <code>!important</code> 규칙 과 충돌하는 두 선언 이 동일한 요소에 적용되면 더 큰 고유성을 가진 선언이 적용됩니다.
zh_cn: 在样式声明上使用 <code>important</code> 规则时，此声明将覆盖其他任何声明。尽管从技术上讲， <code>!important</code> 与特异性无关，但它直接与它相互作用。但是，使用 <code>!important,</code> 是<strong>不好的做法</strong>，应避免使用它，因为它会破坏样式表中的自然<a href="cascade">级联</a>，从而使调试更加困难。当两个具有 <code>!important</code> 规则的冲突声明应用于同一元素时，将应用具有更大特异性的声明。

source: When an element generates one or more boxes, one of them is the <strong>principal box</strong>, which contains its descendant boxes and generated content in the box tree, and is also the box involved in any positioning scheme.
ko: 요소가 하나 이상의 상자를 생성 할 때, 그 중 하나는입니다 <strong>기본 박스</strong> 어떤 위치 계획에 포함 된 상자를 그 자손 상자와 상자 트리에서 생성 된 내용을 포함하고, 또한,.
zh_cn: 当一个元素生成一个或多个框时，其中一个就是<strong>主体框</strong>，该<strong>主体框</strong>包含其后代框和框树中生成的内容，并且也是任何定位方案中涉及的框。

source: When an element has a border that is larger than a single CSS pixel, each line of pixels uses the next color specified in this property, from the outside in. This eliminates the need for nested boxes. If the border is wider than the number of specified colors, the remaining part of the border is the innermost color specified.
es: Cuando un elemento tiene un borde que es más grande que un solo píxel CSS,cada línea de píxeles utiliza el siguiente color especificado en esta propiedad,de afuera hacia adentro.Esto elimina la necesidad de cajas anidadas.Si el borde es más ancho que el número de colores especificados,la parte restante del borde es el color más interno especificado.
ko: 요소에 단일 CSS 픽셀보다 큰 테두리가있는 경우 각 픽셀 행은 외부에서이 속성에 지정된 다음 색상을 사용합니다. 이렇게하면 중첩 된 상자가 필요하지 않습니다. 테두리가 지정된 색상 수보다 넓은 경우 테두리의 나머지 부분이 가장 안쪽에 지정된 색상입니다.
zh_cn: 当一个元素的边框大于一个CSS像素时,每一行像素都会使用此属性中指定的下一个颜色,从外到内。这样就不需要嵌套框了。如果边框的宽度超过了指定的颜色数量,那么边框的剩余部分就是指定的最里面的颜色。

source: When an element has a parent set to <code>display: grid</code> it is <em>blockified</em>, as defined in the <a href="https://drafts.csswg.org/css-display-3/#blockify">CSS display specification</a>. In the case of our item set to <code>inline-block</code>, this is why <code>display: inline-block</code> no longer applied.
es: Cuando un elemento tiene un conjunto primario para <code>display: grid</code> se <em>bloquea</em> , como se define en la <a href="https://drafts.csswg.org/css-display-3/#blockify">especificaci&oacute;n de visualizaci&oacute;n CSS</a> . En el caso de nuestro art&iacute;culo configurado <code>inline-block</code> en l&iacute;nea , esta es la raz&oacute;n por la cual <code>display: inline-block</code> ya no se aplica.
ko: 요소가 부모 설정 한 경우 <code>display: grid</code> 것이된다 <em>blockified</em> 에 정의로서, <a href="https://drafts.csswg.org/css-display-3/#blockify">CSS 표시 사양</a> . 항목이 <code>inline-block</code> 으로 설정된 경우 , <code>display: inline-block</code> 더 이상 적용되지 않는 이유 입니다.
zh_cn: 当元素的父级集 <code>display: grid</code> 时，将按照<a href="https://drafts.csswg.org/css-display-3/#blockify">CSS display规范</a>中的定义对其进行<em>阻止</em>。在我们的项目设置为 <code>inline-block</code> 的情况下，这就是为什么 <code>display: inline-block</code> 不再适用。

source: When an intrinsic ratio is specified, but no dimensions, rule 4 is applied -- except that rule 2 also applies. The image is therefore rendered just like for the <code>contain</code> case.
es: Cuando se especifica una relaci&oacute;n intr&iacute;nseca, pero sin dimensiones, se aplica la regla 4, excepto que tambi&eacute;n se aplica la regla 2. Por lo tanto, la imagen se representa como para el caso de <code>contain</code> .
ko: 고유 비율이 지정되었지만 차원이없는 경우 규칙 2가 적용되는 것을 제외하고 규칙 4가 적용됩니다. 따라서 이미지는 <code>contain</code> 사례 와 같이 렌더링됩니다 .
zh_cn: 如果指定了固有比率，但未指定尺寸，则将应用规则4 －除了规则2也适用。因此，就像 <code>contain</code> 容器一样，渲染图像。

source: When animated, a point's abscissa and ordinate values are interpolated independently. However, because the speed of the interpolation is determined by a single <a href="https://developer.mozilla.org/en-US/docs/Web/CSS/single-transition-timing-function">timing function</a> for both coordinates, the point will move in a straight line.
es: Cuando se anima, la abscisa de un punto y los valores de ordenada se interpolan de forma independiente. Sin embargo, debido a que la velocidad de la interpolaci&oacute;n est&aacute; determinada por una &uacute;nica <a href="https://developer.mozilla.org/en-US/docs/Web/CSS/single-transition-timing-function">funci&oacute;n de sincronizaci&oacute;n</a> para ambas coordenadas, el punto se mover&aacute; en l&iacute;nea recta.
ko: 애니메이션 될 때 점의 가로 좌표 및 세로 좌표 값은 독립적으로 보간됩니다. 그러나 보간 속도는 두 좌표 의 단일 <a href="https://developer.mozilla.org/en-US/docs/Web/CSS/single-transition-timing-function">타이밍 함수</a> 에 의해 결정 되므로 점이 직선으로 이동합니다.
zh_cn: 设置动画时，将独立插入点的横坐标和纵坐标值。但是，由于插值的速度由两个坐标的单个<a href="https://developer.mozilla.org/en-US/docs/Web/CSS/single-transition-timing-function">定时函数</a>确定，因此该点将沿直线移动。

source: When animated, values of the <code>&lt;alpha-value&gt;</code> CSS data type are interpolated as real, floating-point numbers. The speed of the interpolation is determined by the <a href="https://developer.mozilla.org/en-US/docs/Web/CSS/single-transition-timing-function">timing function</a> associated with the animation.
ko: 애니메이션 할 때 <code>&lt;alpha-value&gt;</code> CSS 데이터 유형의 값 은 실제 부동 소수점 숫자로 보간됩니다. 보간 속도 는 애니메이션과 관련된 <a href="https://developer.mozilla.org/en-US/docs/Web/CSS/single-transition-timing-function">타이밍 기능에</a> 의해 결정됩니다 .
zh_cn: 设置为动画时，会将 <code>&lt;alpha-value&gt;</code> CSS数据类型的值作为真实的浮点数进行插值。插值的速度由与动画关联的<a href="https://developer.mozilla.org/en-US/docs/Web/CSS/single-transition-timing-function">计时功能</a>确定。

source: When animated, values of the <code>&lt;integer&gt;</code> data type are interpolated using discrete, whole steps. The calculation is done as if they were real, floating-point numbers; the discrete value is obtained using the <a href="http://en.wikipedia.org/wiki/Floor_function">floor function</a>. The speed of the interpolation is determined by the <a href="https://developer.mozilla.org/en-US/docs/Web/CSS/single-transition-timing-function">timing function</a> associated with the animation.
es: Cuando se anima, los valores del tipo de datos <code>&lt;integer&gt;</code> se interpolan mediante pasos discretos y completos. El c&aacute;lculo se realiza como si fueran n&uacute;meros reales de coma flotante; El valor discreto se obtiene utilizando la <a href="http://en.wikipedia.org/wiki/Floor_function">funci&oacute;n de piso</a> . La velocidad de la interpolaci&oacute;n est&aacute; determinada por la <a href="https://developer.mozilla.org/en-US/docs/Web/CSS/single-transition-timing-function">funci&oacute;n de temporizaci&oacute;n</a> asociada con la animaci&oacute;n.
ko: 애니메이션화 될 때 <code>&lt;integer&gt;</code> 데이터 유형 의 값은 불연속 전체 단계를 사용하여 보간됩니다. 마치 실제 부동 소수점 숫자 인 것처럼 계산이 수행됩니다. 이산 값은 <a href="http://en.wikipedia.org/wiki/Floor_function">바닥 함수</a> 를 사용하여 얻습니다 . 보간 속도 는 애니메이션과 관련된 <a href="https://developer.mozilla.org/en-US/docs/Web/CSS/single-transition-timing-function">타이밍 기능에</a> 의해 결정됩니다 .
zh_cn: 设置为动画后，将使用不连续的完整步骤对 <code>&lt;integer&gt;</code> 数据类型的值进行插值。就像它们是真实的浮点数一样进行计算；使用<a href="http://en.wikipedia.org/wiki/Floor_function">底函数</a>获得离散值。插值的速度由与动画关联的<a href="https://developer.mozilla.org/en-US/docs/Web/CSS/single-transition-timing-function">计时功能</a>确定。

source: When animated, values of the <code>&lt;integer&gt;</code> data type are interpolated using discrete, whole steps. The calculation is done as if they were real, floating-point numbers; the discrete value is obtained using the <a href="http://en.wikipedia.org/wiki/Floor_function">floor function</a>. The speed of the interpolation is determined by the <a href="timing-function">timing function</a> associated with the animation.
ko: 애니메이션 할 때 <code>&lt;integer&gt;</code> 데이터 유형 의 값은 불연속적인 전체 단계를 사용하여 보간됩니다. 계산은 마치 실제 부동 소수점 숫자 인 것처럼 수행됩니다. 이산 값은 <a href="http://en.wikipedia.org/wiki/Floor_function">floor 함수</a> 를 사용하여 얻습니다 . 보간 속도 는 애니메이션과 관련된 <a href="timing-function">타이밍 기능에</a> 의해 결정됩니다 .
zh_cn: 设置为动画后，将使用不连续的完整步骤对 <code>&lt;integer&gt;</code> 数据类型的值进行插值。就像它们是真实的浮点数一样进行计算；使用<a href="http://en.wikipedia.org/wiki/Floor_function">底函数</a>获得离散值。插值的速度由与动画关联的<a href="timing-function">计时功能</a>确定。

source: When animated, values of the <code>&lt;length&gt;</code> data type are interpolated as real, floating-point numbers. The interpolation happens on the calculated value. The speed of the interpolation is determined by the <a href="https://developer.mozilla.org/en-US/docs/Web/CSS/single-transition-timing-function">timing function</a> associated with the animation.
es: Cuando se animan, los valores del tipo de datos <code>&lt;length&gt;</code> se interpolan como n&uacute;meros reales de coma flotante. La interpolaci&oacute;n ocurre en el valor calculado. La velocidad de la interpolaci&oacute;n est&aacute; determinada por la <a href="https://developer.mozilla.org/en-US/docs/Web/CSS/single-transition-timing-function">funci&oacute;n de temporizaci&oacute;n</a> asociada con la animaci&oacute;n.
ko: 애니메이션을 적용 할 때 <code>&lt;length&gt;</code> 데이터 형식 의 값은 실수 부동 소수점 숫자로 보간됩니다. 보간은 계산 된 값에서 발생합니다. 보간 속도 는 애니메이션과 관련된 <a href="https://developer.mozilla.org/en-US/docs/Web/CSS/single-transition-timing-function">타이밍 기능에</a> 의해 결정됩니다 .
zh_cn: 设置为动画时，会将 <code>&lt;length&gt;</code> 数据类型的值作为真实的浮点数进行插值。插值发生在计算值上。插值的速度由与动画关联的<a href="https://developer.mozilla.org/en-US/docs/Web/CSS/single-transition-timing-function">计时功能</a>确定。

source: When animated, values of the <code>&lt;number&gt;</code> CSS data type are interpolated as real, floating-point numbers. The speed of the interpolation is determined by the <a href="https://developer.mozilla.org/en-US/docs/Web/CSS/single-transition-timing-function">timing function</a> associated with the animation.
es: Cuando se animan, los valores del tipo de datos CSS <code>&lt;number&gt;</code> se interpolan como n&uacute;meros reales de coma flotante. La velocidad de la interpolaci&oacute;n est&aacute; determinada por la <a href="https://developer.mozilla.org/en-US/docs/Web/CSS/single-transition-timing-function">funci&oacute;n de temporizaci&oacute;n</a> asociada con la animaci&oacute;n.
ko: 애니메이션을 적용 할 때 <code>&lt;number&gt;</code> CSS 데이터 유형의 값은 실제 부동 소수점 숫자로 보간됩니다. 보간 속도 는 애니메이션과 관련된 <a href="https://developer.mozilla.org/en-US/docs/Web/CSS/single-transition-timing-function">타이밍 기능에</a> 의해 결정됩니다 .
zh_cn: 设置为动画时，会将 <code>&lt;number&gt;</code> CSS数据类型的值插入为真实的浮点数。插值的速度由与动画关联的<a href="https://developer.mozilla.org/en-US/docs/Web/CSS/single-transition-timing-function">计时功能</a>确定。

source: When animated, values of the <code>&lt;percentage&gt;</code> data type are interpolated as real, floating-point numbers. The speed of the interpolation is determined by the <a href="https://developer.mozilla.org/en-US/docs/Web/CSS/single-transition-timing-function">timing function</a> associated with the animation.
es: Cuando se anima, los valores del tipo de datos <code>&lt;percentage&gt;</code> se interpolan como n&uacute;meros reales de coma flotante. La velocidad de la interpolaci&oacute;n est&aacute; determinada por la <a href="https://developer.mozilla.org/en-US/docs/Web/CSS/single-transition-timing-function">funci&oacute;n de temporizaci&oacute;n</a> asociada con la animaci&oacute;n.
ko: 애니메이션을 적용 할 때 <code>&lt;percentage&gt;</code> 데이터 형식 의 값은 실수 부동 소수점 숫자로 보간됩니다. 보간 속도 는 애니메이션과 관련된 <a href="https://developer.mozilla.org/en-US/docs/Web/CSS/single-transition-timing-function">타이밍 기능에</a> 의해 결정됩니다 .
zh_cn: 设置为动画时，会将 <code>&lt;percentage&gt;</code> 数据类型的值作为真实的浮点数进行插值。插值的速度由与动画关联的<a href="https://developer.mozilla.org/en-US/docs/Web/CSS/single-transition-timing-function">计时功能</a>确定。

source: When animated, values of the <code>&lt;shape&gt;</code> data type are interpolated over their <code>top</code>, <code>right</code>, <code>bottom</code>, and <code>left</code> components, each treated as a real, floating-point number. The speed of the interpolation is determined by the <a href="https://developer.mozilla.org/en-US/docs/Web/CSS/single-transition-timing-function">timing function</a> associated with the animation.
es: Cuando se anima, los valores del tipo de datos <code>&lt;shape&gt;</code> se interpolan sobre sus componentes <code>top</code> , <code>right</code> , <code>bottom</code> e <code>left</code> , cada uno tratado como un n&uacute;mero real de coma flotante. La velocidad de la interpolaci&oacute;n est&aacute; determinada por la <a href="https://developer.mozilla.org/en-US/docs/Web/CSS/single-transition-timing-function">funci&oacute;n de temporizaci&oacute;n</a> asociada con la animaci&oacute;n.
ko: 애니메이션을 적용 할 때 <code>&lt;shape&gt;</code> 데이터 형식 의 값은 <code>top</code> , <code>right</code> , <code>bottom</code> 및 <code>left</code> 구성 요소에 보간되며 각각 실제 부동 소수점 숫자로 처리됩니다. 보간 속도 는 애니메이션과 관련된 <a href="https://developer.mozilla.org/en-US/docs/Web/CSS/single-transition-timing-function">타이밍 기능에</a> 의해 결정됩니다 .
zh_cn: 设置为动画时， <code>&lt;shape&gt;</code> 数据类型的值将插值在其 <code>top</code> ， <code>right</code> ， <code>bottom</code> 和 <code>left</code> 分量上，每个分量均被视为一个实浮点数。插值的速度由与动画关联的<a href="https://developer.mozilla.org/en-US/docs/Web/CSS/single-transition-timing-function">计时功能</a>确定。
