Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/css/css.*.017.xlf
Languages: es, ko, zh_cn

source: Uses the non-standard name: <code>offset-inline-end</code>
es: Utiliza el nombre no est&aacute;ndar: <code>offset-inline-end</code>
ko: 비표준 이름을 사용합니다. <code>offset-inline-end</code>
zh_cn: 使用非标准名称： <code>offset-inline-end</code>

source: Uses the non-standard name: <code>offset-inline-start</code>
es: Utiliza el nombre no est&aacute;ndar: <code>offset-inline-start</code>
ko: 비표준 이름을 사용합니다. <code>offset-inline-start</code>
zh_cn: 使用非标准名称： <code>offset-inline-start</code>

source: Uses the non-standard name: <code>offset-inline</code>
ko: 비표준 이름 사용 : <code>offset-inline</code>
zh_cn: 使用非标准名称： <code>offset-inline</code>

source: Uses the non-standard name: <code>offset-rotation</code>
ko: 비표준 이름 사용 : <code>offset-rotation</code>
zh_cn: 使用非标准名称： <code>offset-rotation</code>

source: Uses the non-standard name: <code>scroll-snap-margin-bottom</code>
ko: 비표준 이름 사용 : <code>scroll-snap-margin-bottom</code>
zh_cn: 使用非标准名称： <code>scroll-snap-margin-bottom</code>

source: Uses the non-standard name: <code>scroll-snap-margin-left</code>
ko: 비표준 이름 사용 : <code>scroll-snap-margin-left</code>
zh_cn: 使用非标准名称： <code>scroll-snap-margin-left</code>

source: Uses the non-standard name: <code>scroll-snap-margin-right</code>
ko: 비표준 이름 사용 : <code>scroll-snap-margin-right</code>
zh_cn: 使用非标准名称： <code>scroll-snap-margin-right</code>

source: Uses the non-standard name: <code>scroll-snap-margin-top</code>
ko: 비표준 이름 사용 : <code>scroll-snap-margin-top</code>
zh_cn: 使用非标准名称： <code>scroll-snap-margin-top</code>

source: Uses the non-standard name: <code>scroll-snap-margin</code>
ko: 비표준 이름 사용 : <code>scroll-snap-margin</code>
zh_cn: 使用非标准名称： <code>scroll-snap-margin</code>

source: Uses the non-standard name: <code>text-combine-horizontal</code>
es: Utiliza el nombre no est&aacute;ndar: <code>text-combine-horizontal</code>
ko: 비표준 이름을 사용합니다 : <code>text-combine-horizontal</code>
zh_cn: 使用非标准名称： <code>text-combine-horizontal</code>

source: Uses the non-standard name: <code>text-decoration-width</code>
ko: 비표준 이름 사용 : <code>text-decoration-width</code>
zh_cn: 使用非标准名称： <code>text-decoration-width</code>

source: Uses the non-standard name: <code>vm</code>
es: Utiliza el nombre no est&aacute;ndar: <code>vm</code>
ko: 비표준 이름 인 <code>vm</code> 을 사용합니다.
zh_cn: 使用非标准名称： <code>vm</code>

source: Uses the non-standard name: <code>word-wrap</code>
es: Utiliza el nombre no est&aacute;ndar: <code>word-wrap</code>
ko: 비표준 이름 인 <code>word-wrap</code> 을 사용합니다.
zh_cn: 使用非标准名称： <code>word-wrap</code>

source: Uses the object bounding box as the reference box.
es: Utiliza el cuadro delimitador de objetos como cuadro de referencia.
ko: 객체 경계 상자를 참조 상자로 사용합니다.
zh_cn: 使用对象的边界框作为参考框。

source: Uses the stroke bounding box as the reference box.
es: Utiliza el cuadro delimitador de trazos como cuadro de referencia.
ko: 획 경계 상자를 참조 상자로 사용합니다.
zh_cn: 使用描边框作为参考框。

source: Using "auto" and one specific length
es: Usando "auto" y una longitud específica
ko: "자동"과 하나의 특정 길이 사용
zh_cn: 使用 "自动 "和一个特定的长度

source: Using <a href="https://developer.mozilla.org/en-US/docs/Web/CSS">CSS</a><a href="@property"><code>@property</code></a><a href="at-rule">at-rule</a>:
ko: 사용 <a href="https://developer.mozilla.org/en-US/docs/Web/CSS">CSS의 </a><a href="@property"> <code>@property</code> 을</a><a href="at-rule"> 에서 규칙</a> :
zh_cn: 使用<a href="https://developer.mozilla.org/en-US/docs/Web/CSS">CSS </a><a href="@property"> <code>@property</code> </a><a href="at-rule">规则</a>：

source: Using <a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript">JavaScript</a><a href="https://developer.mozilla.org/en-US/docs/Web/API/CSS/registerProperty"><code>CSS.registerProperty</code></a>:
ko: <a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript">JavaScript </a><a href="https://developer.mozilla.org/en-US/docs/Web/API/CSS/registerProperty"> <code>CSS.registerProperty</code> </a> 사용 :
zh_cn: 使用<a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript">JavaScript </a><a href="https://developer.mozilla.org/en-US/docs/Web/API/CSS/registerProperty"> <code>CSS.registerProperty</code> </a>：

source: Using <code>:is()</code>, though, it's much easier:
es: Sin embargo, usar <code>:is()</code> es mucho m&aacute;s f&aacute;cil:
ko: 그러나 <code>:is()</code> 사용하면 훨씬 쉽습니다.
zh_cn: 但是，使用 <code>:is()</code> 则容易得多：

source: Using <code>column-count</code> and <code>column-width</code> together
es: Utilizando <code>column-count</code> y <code>column-width</code> junto
ko: 사용 <code>column-count</code> 와 <code>column-width</code> 함께를
zh_cn: 使用 <code>column-count</code> 和 <code>column-width</code> 一起

source: Using <code>contain: style</code> would ensure that the <a href="counter-increment"><code>counter-increment</code></a> and <a href="counter-set"><code>counter-set</code></a> properties created new counters scoped to that subtree only.
ko: 사용 <code>contain: style</code> 수 있도록 할 <a href="counter-increment"> <code>counter-increment</code> </a> 및 <a href="counter-set"> <code>counter-set</code> </a> 속성이 하위 트리에만 범위 새 카운터를 만들었습니다.
zh_cn: 使用 <code>contain: style</code> 将确保<a href="counter-increment"> <code>counter-increment</code> </a>和<a href="counter-set"> <code>counter-set</code> </a>属性创建仅限于该子树的新计数器。

source: Using <code>display: flow-root</code>
es: Usando <code>display: flow-root</code>
ko: <code>display: flow-root</code> 사용 : flow-root
zh_cn: 使用 <code>display: flow-root</code>

source: Using <code>display: flow-root</code> (or <code>display: flow-root list-item</code>) on the containing block will create a new
ko: 사용 <code>display: flow-root</code> (또는 <code>display: flow-root list-item</code> ) 포함하는 블록은 새로운 생성됩니다
zh_cn: 在包含块上使用 <code>display: flow-root</code> （或 <code>display: flow-root list-item</code> ）将创建一个新的

source: Using <code>flex: auto</code> is the same as using <code>flex: 1 1 auto</code>; everything is as with <code>flex:initial</code> but in this case the items can grow and fill the container as well as shrink if required.
es: Usar <code>flex: auto</code> es lo mismo que usar <code>flex: 1 1 auto</code> ; todo es como con <code>flex:initial</code> pero en este caso los art&iacute;culos pueden crecer y llenar el contenedor, as&iacute; como encogerse si es necesario.
ko: 사용 <code>flex: auto</code> 사용하는 것과 같습니다 <code>flex: 1 1 auto</code> ; 모든 것은 <code>flex:initial</code> 과 동일 하지만이 경우 아이템은 컨테이너를 늘리고 채우고 필요한 경우 축소 할 수 있습니다.
zh_cn: 使用 <code>flex: auto</code> 与使用 <code>flex: 1 1 auto</code> ；一切都与 <code>flex:initial</code> 相同,但是在这种情况下，项目可以增长并填充容器，并在需要时收缩。

source: Using <code>flex: none</code> will create fully inflexible flex items. It is as if you wrote <code>flex: 0 0 auto</code>. The items cannot grow or shrink but will be laid out using flexbox with a <code>flex-basis</code> of <code>auto</code>.
es: Uso de <code>flex: none</code> crear&aacute; elementos flex totalmente inflexibles. Es como si escribieras <code>flex: 0 0 auto</code> . Los art&iacute;culos no pueden crecer ni encogerse, pero se distribuir&aacute;n usando flexbox con una <code>flex-basis</code> de <code>auto</code> .
ko: <code>flex: none</code> 사용 : none 은 완전히 융통성이없는 flex 아이템을 생성합니다. <code>flex: 0 0 auto</code> 를 쓴 것과 같습니다 . 항목은 확장 또는 축소하지만 함께 인 flexbox을 사용하여 배치됩니다 수 없습니다 <code>flex-basis</code> 의 <code>auto</code> .
zh_cn: 使用 <code>flex: none</code> 将创建完全不灵活的flex项目。就像您编写了 <code>flex: 0 0 auto</code> 。该项目无法放大或缩小，但将使用Flexbox将与铺设了 <code>flex-basis</code> 的 <code>auto</code> 。

source: Using <code>grid-template-areas</code> for UI elements
es: Usar <code>grid-template-areas</code> de plantilla de cuadr&iacute;cula para elementos de la interfaz de usuario
ko: UI 요소에 <code>grid-template-areas</code> 사용
zh_cn: 对UI元素使用 <code>grid-template-areas</code>

source: Using <code>mandatory</code> gives a very consistent experience &mdash; you know that the browser will always snap to each defined point. This means you can be confident that something you expect to be at the top of the screen will be when scrolling finishes. However, it can cause problems if the content is larger than you expect &mdash; users may find themselves in the frustrating position of never being able to scroll and view a certain point in the content. Therefore, use of mandatory should be carefully considered and only used in situations where you know how much content is on the screen at any one time.
ko: 사용 <code>mandatory</code> 매우 일관된 경험을 제공 - 브라우저는 항상 정의 된 각 지점에 스냅 것이라는 점을 알고있다. 즉, 스크롤이 끝날 때 화면 상단에있을 것으로 예상되는 항목이있을 것이라고 확신 할 수 있습니다. 그러나 콘텐츠가 예상보다 크면 문제가 발생할 수 있습니다. 사용자는 콘텐츠의 특정 지점을 스크롤하거나 볼 수없는 실망스러운 위치에있을 수 있습니다. 따라서 필수 사용은 신중하게 고려해야하며 한 번에 화면에 얼마나 많은 콘텐츠가 표시되는지 알고있는 상황에서만 사용해야합니다.
zh_cn: 使用 <code>mandatory</code> 将提供非常一致的体验-您知道浏览器将始终捕捉到每个定义的点。这意味着您可以确信，滚动完成后，您期望出现在屏幕顶部的内容将会出现。但是，如果内容超出您的预期，则可能会导致问题-用户可能会感到沮丧，无法滚动和查看内容中的特定点。因此，应该仔细考虑使用强制性命令，并且仅在您一次知道屏幕上有多少内容的情况下使用强制性命令。

source: Using <code>min-</code> and <code>max-</code> we might test for a width between two values like so:
es: Usando <code>min-</code> y <code>max-</code> podr&iacute;amos probar un ancho entre dos valores as&iacute;:
ko: <code>min-</code> 및 <code>max-</code> 사용하여 다음 과 같이 두 값 사이의 너비를 테스트 할 수 있습니다.
zh_cn: 使用 <code>min-</code> 和 <code>max-</code> 可以测试两个值之间的宽度，如下所示：

source: Using <code>not()</code> around a media feature negates that feature in the query. For example, <code>not(hover)</code> would match if the device had no hover capability:
es: El uso de <code>not()</code> alrededor de una caracter&iacute;stica de medios niega esa caracter&iacute;stica en la consulta. Por ejemplo, <code>not(hover)</code> coincidir&iacute;a si el dispositivo no tuviera capacidad de hover:
ko: 미디어 기능 주위에 <code>not()</code> 사용 하면 쿼리에서 해당 기능이 무효화됩니다. 예를 들어, 장치에 호버 기능이없는 경우 <code>not(hover)</code> 는 일치합니다.
zh_cn: 在媒体功能周围使用 <code>not()</code> 会否定查询中的该功能。例如，如果设备没有悬停功能，则 <code>not(hover)</code> 将匹配：

source: Using <code>opacity</code> with a value other than <code>1</code> places the element in a new <a href="css_positioning/understanding_z_index/the_stacking_context">stacking context</a>.
ko: <code>1</code> 이 아닌 값으로 <code>opacity</code> 를 사용 하면 요소가 새 <a href="css_positioning/understanding_z_index/the_stacking_context">스택 컨텍스트에 배치</a> 됩니다.
zh_cn: 使用 <code>opacity</code> 为 <code>1</code> 以外的值可将元素放置在新的<a href="css_positioning/understanding_z_index/the_stacking_context">堆叠上下文中</a>。

source: Using <code>opacity</code> with a value other than <code>1</code> places the element in a new <a href="understanding_z-index/the_stacking_context">stacking context</a>.
es: El uso de la <code>opacity</code> con un valor distinto de <code>1</code> coloca el elemento en un nuevo <a href="understanding_z-index/the_stacking_context">contexto de apilamiento</a> .
ko: <code>1</code> 이외의 값으로 <code>opacity</code> 를 사용 하면 요소를 새 <a href="understanding_z-index/the_stacking_context">스태킹 컨텍스트에 배치</a> 합니다.
zh_cn: 使用 <code>opacity</code> 等于 <code>1</code> 的不透明度将元素放置在新的<a href="understanding_z-index/the_stacking_context">堆栈上下文中</a>。

source: Using <code>position: fixed</code> also removes the item from flow, however the offsets are based on the viewport rather than the containing block.
es: La <code>position: fixed</code> uso : fijo tambi&eacute;n elimina el elemento del flujo, sin embargo, los desplazamientos se basan en la ventana gr&aacute;fica en lugar del bloque contenedor.
ko: <code>position: fixed</code> 사용 하면 항목을 흐름에서 제거하지만 오프셋은 포함 블록이 아닌 뷰포트를 기준으로합니다.
zh_cn: 使用 <code>position: fixed</code> 也可以从流中删除该项目，但是偏移基于视口而不是包含块。

source: Using <code>z-index</code> appears extremely easy: a single property, assigned a single integer number, with an easy-to-understand behaviour. However, when <code>z-index</code> is applied to complex hierarchies of HTML elements, its behaviour can be hard to understand or predict. This is due to complex stacking rules. In fact a dedicated section has been reserved in the CSS specification <a href="http://www.w3.org/TR/CSS21/zindex.html">CSS-2.1 Appendix E</a> to explain these rules better.
es: Usar <code>z-index</code> parece extremadamente f&aacute;cil: una sola propiedad, asignada a un solo n&uacute;mero entero, con un comportamiento f&aacute;cil de entender. Sin embargo, cuando <code>z-index</code> se aplica a jerarqu&iacute;as complejas de elementos HTML, su comportamiento puede ser dif&iacute;cil de entender o predecir. Esto se debe a las complejas reglas de apilamiento. De hecho, se ha reservado una secci&oacute;n dedicada en la especificaci&oacute;n <a href="http://www.w3.org/TR/CSS21/zindex.html">CSS CSS-2.1 Ap&eacute;ndice E</a> para explicar mejor estas reglas.
ko: <code>z-index</code> 사용하면 이해하기 쉬운 단일 정수 번호가 지정된 단일 속성이 매우 쉽습니다. 그러나 <code>z-index</code> 를 HTML 요소의 복잡한 계층 구조에 적용하면 동작을 이해하거나 예측하기가 어려울 수 있습니다. 이는 복잡한 스태킹 규칙 때문입니다. 실제로 이러한 규칙을 더 잘 설명하기 위해 CSS 사양 <a href="http://www.w3.org/TR/CSS21/zindex.html">CSS-2.1 부록 E</a> 에 전용 섹션이 예약되어 있습니다.
zh_cn: 使用 <code>z-index</code> 看起来非常容易：为单个属性分配一个整数，并具有易于理解的行为。但是，将 <code>z-index</code> 应用于HTML元素的复杂层次结构时，其行为可能难以理解或预测。这是由于复杂的堆叠规则。实际上，CSS规范<a href="http://www.w3.org/TR/CSS21/zindex.html">CSS-2.1附录E中</a>已经保留了专门的部分，以更好地解释这些规则。

source: Using @media queries
ko: @media 쿼리 사용
zh_cn: 使用@媒体查询

source: Using @styleset in a @font-feature-values rule
ko: @ font-feature-values ​​규칙에서 @styleset 사용
zh_cn: 在@font-feature-values规则中使用@styleset。

source: Using CSS Counters
es: Usando contadores CSS
ko: CSS 카운터 사용
zh_cn: 使用CSS计数器

source: Using CSS Transforms
es: El uso de las transformaciones del CSS
ko: CSS 변환 사용
zh_cn: 使用CSS变换

source: Using CSS animations
es: Usando animaciones CSS
ko: CSS 애니메이션 사용
zh_cn: 使用CSS动画

source: Using CSS counters
es: Usando contadores CSS
ko: CSS 카운터 사용
zh_cn: 使用CSS计数器

source: Using CSS custom properties
ko: CSS 사용자 정의 속성 사용
zh_cn: 使用CSS自定义属性

source: Using CSS custom properties (variables)
ko: CSS 사용자 정의 속성 (변수) 사용
zh_cn: 使用CSS自定义属性(变量

source: Using CSS feature detection for implementation
es: Usar la detección de características de CSS para la implementación
ko: 구현을 위해 CSS 기능 감지 사용
zh_cn: 使用CSS特征检测来实现

source: Using CSS generated content
ko: CSS 생성 콘텐츠 사용
zh_cn: 使用CSS生成内容

source: Using CSS gradients
es: Usando gradientes CSS
ko: CSS 그라디언트 사용
zh_cn: 使用CSS渐变

source: Using CSS transforms
es: Usando las transformaciones del CSS
ko: CSS 변환 사용
zh_cn: 使用CSS转换

source: Using CSS transitions
es: Usando transiciones CSS
ko: CSS 전환 사용
zh_cn: 使用CSS过渡

source: Using CSS variables
es: Usando variables CSS
ko: CSS 변수 사용
zh_cn: 使用CSS变量

source: Using CSS with replaced elements
es: Usando CSS con elementos reemplazados
ko: 대체 된 요소와 함께 CSS 사용
zh_cn: 使用CSS替换元素

source: Using Danish glyphs
ko: 덴마크 글리프 사용
zh_cn: 使用丹麦文字形

source: Using Feature Queries in CSS
ko: CSS에서 기능 쿼리 사용
zh_cn: 在CSS中使用特征查询

source: Using Generated Content as the floated item
es: Usando el Contenido Generado como el elemento flotante
ko: 플로팅 된 항목으로 생성 된 컨텐츠 사용
zh_cn: 使用生成的内容作为浮动项目

source: Using JavaScript you can make the effect of moving the ball to a certain position happen:
es: Usando JavaScript puedes hacer que el efecto de mover la pelota a una cierta posición ocurra:
ko: JavaScript를 사용하면 공을 특정 위치로 이동시키는 효과를 얻을 수 있습니다.
zh_cn: 使用JavaScript可以让球移动到某个位置的效果发生。

source: Using Media Queries for Accessibility
es: Uso de las consultas de los medios de comunicación para la accesibilidad
ko: 접근성을 위해 미디어 쿼리 사용
zh_cn: 使用媒体查询实现可访问性

source: Using URL values for the <code>cursor</code> property
es: Usar valores de URL para la propiedad del <code>cursor</code>
ko: <code>cursor</code> 속성에 URL 값 사용
zh_cn: 使用URL值作为 <code>cursor</code> 属性

source: Using URL values for the cursor property
es: Usando los valores de URL para la propiedad del cursor
ko: 커서 속성에 URL 값 사용
zh_cn: 为游标属性使用URL值

source: Using a <code><a href="#string">&lt;string&gt;</a></code> value only, in which case the other value defaults to <code><a href="#right">right</a></code>.
es: Usando un valor <code><a href="#string">&lt;string&gt;</a></code> solamente, en cuyo caso el otro valor predeterminado es el <code><a href="#right">right</a></code> .
ko: <code><a href="#string">&lt;string&gt;</a></code> 값만 사용하는 경우 다른 값의 기본값은 <code><a href="#right">right</a></code> 입니다.
zh_cn: 仅使用 <code><a href="#string">&lt;string&gt;</a></code> 值，在这种情况下，其他值默认为 <code><a href="#right">right</a></code> 。

source: Using a <code>display</code> value of <code>none</code> on an element will remove it from the <a href="https://developer.mozilla.org/en-US/docs/Learn/Accessibility/What_is_accessibility#Accessibility_APIs">accessibility tree</a>. This will cause the element and all its descendant elements to no longer be announced by screen reading technology.
es: El uso de un valor de <code>display</code> de <code>none</code> en un elemento lo eliminar&aacute; del <a href="https://developer.mozilla.org/en-US/docs/Learn/Accessibility/What_is_accessibility#Accessibility_APIs">&aacute;rbol de accesibilidad</a> . Esto har&aacute; que el elemento y todos sus elementos descendientes ya no sean anunciados por la tecnolog&iacute;a de lectura de pantalla.
ko: 사용하여 <code>display</code> 의 값 <code>none</code> 요소에하면에서 제거됩니다 <a href="https://developer.mozilla.org/en-US/docs/Learn/Accessibility/What_is_accessibility#Accessibility_APIs">접근성 나무</a> . 이로 인해 요소와 모든 하위 요소가 더 이상 화면 읽기 기술로 발표되지 않습니다.
zh_cn: 在元素上使用 <code>display</code> 值 <code>none</code> 会将其从<a href="https://developer.mozilla.org/en-US/docs/Learn/Accessibility/What_is_accessibility#Accessibility_APIs">可访问性树中</a>删除。这将导致该元素及其所有后代元素不再通过屏幕阅读技术宣布。

source: Using a <code>visibility</code> value of <code>hidden</code> on an element will remove it from the <a href="https://developer.mozilla.org/en-US/docs/Learn/Accessibility/What_is_accessibility#Accessibility_APIs">accessibility tree</a>. This will cause the element and all its descendant elements to no longer be announced by screen reading technology.
es: El uso de un valor de <code>visibility</code> de <code>hidden</code> en un elemento lo eliminar&aacute; del <a href="https://developer.mozilla.org/en-US/docs/Learn/Accessibility/What_is_accessibility#Accessibility_APIs">&aacute;rbol de accesibilidad</a> . Esto har&aacute; que el elemento y todos sus elementos descendientes ya no sean anunciados por la tecnolog&iacute;a de lectura de pantalla.
ko: 요소 에 <code>hidden</code> <code>visibility</code> 값을 사용 하면 <a href="https://developer.mozilla.org/en-US/docs/Learn/Accessibility/What_is_accessibility#Accessibility_APIs">접근성 트리</a> 에서 요소가 제거됩니다 . 이로 인해 요소와 모든 하위 요소가 더 이상 화면 읽기 기술로 발표되지 않습니다.
zh_cn: 在元素上使用 <code>hidden</code> 的 <code>visibility</code> 值会将其从<a href="https://developer.mozilla.org/en-US/docs/Learn/Accessibility/What_is_accessibility#Accessibility_APIs">可访问性树中</a>删除。这将导致该元素及其所有后代元素不再通过屏幕阅读技术宣布。

source: Using a custom property set on :root
ko: : root에 설정된 사용자 정의 속성 사용
zh_cn: 在:root上使用自定义属性设置

source: Using a different font for a single character
ko: 단일 문자에 다른 글꼴 사용
zh_cn: 对单个字符使用不同的字体

source: Using a keyword (such as <code>blue</code> or <code>transparent</code>)
es: Usar una palabra clave (como <code>blue</code> o <code>transparent</code> e )
ko: 키워드 사용 (예 : <code>blue</code> 또는 <code>transparent</code> )
zh_cn: 使用关键字（例如 <code>blue</code> 或 <code>transparent</code> ）

source: Using a single <code>none</code>, <code>strict</code>, or <code>content</code> keyword.
ko: 단일 사용하지 않는 <code>none</code> , <code>strict</code> , 또는 <code>content</code> 키워드를.
zh_cn: 使用单个 <code>none</code> ， <code>strict</code> 或 <code>content</code> 关键字。

source: Using a single axis translation
es: Usando una traslación de un solo eje
ko: 단일 축 변환 사용
zh_cn: 使用单轴转换

source: Using a single x-angle
es: Usando un solo ángulo X
ko: 단일 x 각도 사용
zh_cn: 使用单个X角

source: Using a single-axis translation
es: Usando una traducción de un solo eje
ko: 단일 축 변환 사용
zh_cn: 使用单轴平移

source: Using a value of <code>auto</code> will display the content with no scrollbars if the content fits inside the box. If it doesn&rsquo;t fit then scrollbars will be added. Comparing the next example with the example for <code>overflow: scroll</code> you should see <code>overflow scroll</code> has horizontal and vertical scrollbars when it only needs vertical scrolling. The <code>auto</code> example below only adds the scrollbar in the direct we need to scroll.
es: El uso de un valor de <code>auto</code> mostrar&aacute; el contenido sin barras de desplazamiento si el contenido cabe dentro del cuadro. Si no encaja, se agregar&aacute;n barras de desplazamiento. Comparando el siguiente ejemplo con el ejemplo de <code>overflow: scroll</code> deber&iacute;a ver que el <code>overflow scroll</code> tiene barras de desplazamiento horizontales y verticales cuando solo necesita desplazamiento vertical. El siguiente ejemplo <code>auto</code> m&aacute;tico solo agrega la barra de desplazamiento en el directo que necesitamos para desplazarnos.
ko: <code>auto</code> 값을 사용 하면 내용이 상자 안에 들어가면 스크롤 막대가없는 내용이 표시됩니다. 맞지 않으면 스크롤바가 추가됩니다. 대한 예제 다음 예제를 비교 <code>overflow: scroll</code> 당신이 볼 수 <code>overflow scroll</code> 단지 수직 스크롤을 필요로 할 때 수평 및 수직 스크롤이있다. 아래 의 <code>auto</code> 예는 스크롤해야 할 바로 위에 스크롤 막대를 추가합니다.
zh_cn: 如果内容适合该框，则使用 <code>auto</code> 值将显示内容而没有滚动条。如果不合适，则会添加滚动条。将下一个示例与 <code>overflow: scroll</code> 示例进行比较：滚动时，您只需要在垂直滚动时看到 <code>overflow scroll</code> 具有水平和垂直滚动条即可。下面的 <code>auto</code> 示例仅在我们需要滚动的直接位置添加滚动条。

source: Using a value of <code>justify-content</code> other than <code>normal</code> or <code>stretch</code> will cause column boxes to display at the <a href="../column-width"><code>column-width</code></a> specified on the multicol container, and the remaining space distributed according to the value of justify-content.
es: El uso de un valor de <code>justify-content</code> de justificaci&oacute;n que no sea <code>normal</code> o <code>stretch</code> har&aacute; que los cuadros de columna se muestren en el <a href="../column-width"> <code>column-width</code> </a> especificado en el contenedor multicol, y el espacio restante se distribuir&aacute; de acuerdo con el valor del contenido de justificaci&oacute;n.
ko: <code>normal</code> 또는 <code>stretch</code> 이외 의 <code>justify-content</code> 값을 사용 하면 열 상자가 멀티 콜 컨테이너에 지정된 <a href="../column-width"> <code>column-width</code> </a> 로 표시되고 나머지 공간은 justify-content 값에 따라 분산됩니다.
zh_cn: 使用除 <code>normal</code> 或 <code>stretch</code> 以外的 <code>justify-content</code> 值将导致列框以multicol容器上指定的<a href="../column-width"> <code>column-width</code> </a>显示，并且剩余空间根据justify-content的值进行分配。

source: Using a value of <code>scroll</code> contains the content in its box and add scrollbars to enable viewing it. Scrollbars will be added even if the content fits in the box.
es: El uso de un valor de <code>scroll</code> contiene el contenido en su cuadro y agrega barras de desplazamiento para permitir verlo. Se agregar&aacute;n barras de desplazamiento incluso si el contenido cabe en el cuadro.
ko: <code>scroll</code> 값을 사용하면 상자에 내용이 포함되고 스크롤 막대를 추가하여 볼 수 있습니다. 내용이 상자에 들어가더라도 스크롤 막대가 추가됩니다.
zh_cn: 使用 <code>scroll</code> 值可在其框中包含内容，并添加滚动条以启用查看功能。即使内容适合框中，也会添加滚动条。

source: Using a variable font: @font-face changes
es: Usando una fuente variable:@font-face cambia
ko: 변수 글꼴 사용 : @ font-face changes
zh_cn: 使用可变字体。@font-face改变

source: Using a width value only, in which case the height defaults to <code><a href="#auto">auto</a></code><a href="#auto">.</a>
es: Usando solo un valor de ancho, en cuyo caso la altura por defecto es <code><a href="#auto">auto</a></code> <a href="#auto"> .</a>
ko: 너비 값만 사용하는 경우 높이는 기본적으로 <code><a href="#auto">auto</a></code> <a href="#auto"> 입니다.</a>
zh_cn: 仅使用宽度值，在这种情况下，高度默认为 <code><a href="#auto">auto</a></code> <a href="#auto">。</a>

source: Using alpha mask mode
ko: 알파 마스크 모드 사용
zh_cn: 使用alpha遮罩模式

source: Using angles
es: Usando ángulos
ko: 각도 사용
zh_cn: 使用角度

source: Using animation events
es: Usando eventos de animación
ko: 애니메이션 이벤트 사용
zh_cn: 使用动画事件

source: Using animation shorthand
es: Usando la taquigrafía de la animación
ko: 애니메이션 속기 사용
zh_cn: 使用动画速记
