Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/css/css.*.017.xlf
Languages: es, ko, zh_cn

source: Using any four-value shorthand such as margin, padding, or border will currently use the physical versions, so if following the flow of the document is important, use the longhand properties for the time being.
es: El uso de cualquier taquigrafía de cuatro valores,como margen,acolchado o borde,utilizará actualmente las versiones físicas,por lo que si seguir el flujo del documento es importante,utilice las propiedades de la mano larga por el momento.
ko: 여백, 패딩 또는 테두리와 같은 4 값 숏 숏을 사용하면 현재 실제 버전이 사용되므로 문서의 흐름을 따르는 것이 중요하다면 당분간 Long 속성을 사용하십시오.
zh_cn: 使用任何四值速记,如margin、padding或border,当前都会使用物理版本,所以如果遵循文档的流程是很重要的,请暂时使用长手属性。

source: Using auto margins for main axis alignment
es: Usando márgenes automáticos para la alineación del eje principal
ko: 주축 정렬에 자동 여백 사용
zh_cn: 主轴对齐时使用自动边距

source: Using auto to reduce rendering cost of long pages
ko: 자동을 사용하여 긴 페이지의 렌더링 비용 절감
zh_cn: 使用自动减少长页面的渲染成本

source: Using background images to style links based on whether they've been visited will no longer work, since only colors can be used to style visited links.
es: El uso de imágenes de fondo para estilizar los enlaces en base a si han sido visitados ya no funcionará,ya que sólo se pueden usar colores para estilizar los enlaces visitados.
ko: 방문한 링크의 스타일을 지정하기 위해 색상 만 사용할 수 있으므로 배경 이미지를 사용하여 방문 여부에 따라 링크의 스타일을 지정할 수 없습니다.
zh_cn: 使用背景图片来根据是否被访问来设置链接的样式将不再有效,因为只有颜色可以用来设置被访问的链接的样式。

source: Using both a keyword value and a <code><a href="#string">&lt;string&gt;</a></code> value.
es: Usando un valor de palabra clave y un valor <code><a href="#string">&lt;string&gt;</a></code> .
ko: 키워드 값과 <code><a href="#string">&lt;string&gt;</a></code> 값을 모두 사용합니다 .
zh_cn: 同时使用关键字值和 <code><a href="#string">&lt;string&gt;</a></code> 值。

source: Using both a width and a height value, in which case the first sets the width and the second sets the height. Each value can be a <a href="length"><code>&lt;length&gt;</code></a>, a <a href="percentage"><code>&lt;percentage&gt;</code></a>, or <code><a href="#auto">auto</a></code>.
es: Usando un valor de ancho y alto, en cuyo caso el primero establece el ancho y el segundo establece la altura. Cada valor puede ser una <a href="length"> <code>&lt;length&gt;</code> </a> , un <a href="percentage"> <code>&lt;percentage&gt;</code> </a> o <code><a href="#auto">auto</a></code> .
ko: 너비와 높이 값을 모두 사용하면 첫 번째는 너비를 설정하고 두 번째는 높이를 설정합니다. 각 값은 <a href="length"> <code>&lt;length&gt;</code> </a> , <a href="percentage"> <code>&lt;percentage&gt;</code> </a> 또는 <code><a href="#auto">auto</a></code> 일 수 있습니다.
zh_cn: 同时使用width和height值，在这种情况下，第一个设置宽度，第二个设置高度。每个值可以是<a href="length"> <code>&lt;length&gt;</code> </a>，<a href="percentage"> <code>&lt;percentage&gt;</code> </a>或 <code><a href="#auto">auto</a></code> 。

source: Using box values is a simple way to create shapes, however this is by nature only going to work with very simple shapes that can be defined using the well-supported <code>border-radius</code> property. The examples shown above show one such use case. You can create a circular shape using border-radius and then curve text around it.
es: El uso de valores de cuadro es una forma simple de crear formas, sin embargo, esto, por naturaleza, solo funcionar&aacute; con formas muy simples que se pueden definir utilizando la propiedad de <code>border-radius</code> bien soportada . Los ejemplos que se muestran arriba muestran uno de estos casos de uso. Puede crear una forma circular utilizando el radio del borde y luego curvar el texto a su alrededor.
ko: 상자 값을 사용하면 셰이프를 만드는 간단한 방법이지만 기본적으로 잘 지원되는 <code>border-radius</code> 속성을 사용하여 정의 할 수있는 매우 간단한 셰이프 만 사용할 수 있습니다 . 위의 예는 그러한 사용 사례를 보여줍니다. 테두리 반경을 사용하여 원형을 만든 다음 주위에 텍스트를 구부릴 수 있습니다.
zh_cn: 使用框值是创建形状的简单方法，但是，从本质上讲，这仅适用于可以使用良好支持的 <code>border-radius</code> 属性定义的非常简单的形状。上面显示的示例显示了一个这样的用例。您可以使用边框半径创建圆形，然后在其周围弯曲文本。

source: Using columns
es: Usando columnas
ko: 열 사용
zh_cn: 使用列

source: Using conic gradients
ko: 원추형 그라디언트 사용
zh_cn: 使用锥形梯度

source: Using contain or cover
es: Usar contener o cubrir
ko: 포함 또는 덮개 사용
zh_cn: 使用包含或覆盖

source: Using counters
es: Usando contadores
ko: 카운터 사용
zh_cn: 使用计数器

source: Using device orientation with 3D Transforms
ko: 3D 변환에 장치 방향 사용
zh_cn: 使用3D变换的设备方向

source: Using deviceorientation with 3D Transforms
es: Usando la orientación de los dispositivos con las transformaciones 3D
ko: 3D 변환과 함께 장치 방향 사용
zh_cn: 使用3D变换的设备方向

source: Using feature queries
es: Usando consultas de características
ko: 기능 쿼리 사용
zh_cn: 使用特征查询

source: Using fit-content for box sizing
ko: 상자 크기 조정에 맞는 콘텐츠 사용
zh_cn: 使用fit-content来确定盒子的尺寸

source: Using gradients
es: Usando gradientes
ko: 그라디언트 사용
zh_cn: 使用梯度

source: Using hidden to manually manage visibility.
ko: 숨김을 사용하여 가시성을 수동으로 관리합니다.
zh_cn: 使用隐藏来手动管理可见性。

source: Using image-set() to provide alternative background-image options
ko: image-set ()을 사용하여 대체 배경 이미지 옵션 제공
zh_cn: 使用image-set()提供其他背景图片选项

source: Using images in HTML
ko: HTML에서 이미지 사용
zh_cn: 在HTML中使用图片

source: Using images with generated content
es: Usando imágenes con contenido generado
ko: 컨텐츠가 생성 된 이미지 사용
zh_cn: 使用图片与生成的内容

source: Using initial to reset color for an element
ko: 이니셜을 사용하여 요소의 색상 재설정
zh_cn: 使用initial来重置元素的颜色

source: Using linear gradients
es: Usando gradientes lineales
ko: 선형 그라디언트 사용
zh_cn: 使用线性梯度

source: Using max-content for box sizing
ko: 상자 크기 조정에 최대 콘텐츠 사용
zh_cn: 使用max-content来确定盒子的大小

source: Using media queries
es: Usando las consultas de los medios de comunicación
ko: 미디어 쿼리 사용
zh_cn: 使用媒体查询

source: Using min-content for box sizing
ko: 상자 크기 조정에 최소 콘텐츠 사용
zh_cn: 使用最小内容来确定盒子大小

source: Using min-device-aspect-ratio
ko: min-device-aspect-ratio 사용
zh_cn: 使用最小设备长宽比。

source: Using mix-blend-mode with HTML
ko: HTML과 함께 혼합 혼합 모드 사용
zh_cn: 使用HTML的mix-blend模式

source: Using mix-blend-mode with SVG
ko: SVG와 혼합 혼합 모드 사용
zh_cn: 在SVG中使用mix-blend模式。

source: Using more specific rules. By indicating one or more elements before the element you're selecting the rule becomes more specific and gets higher priority:
es: Usando reglas más específicas.Al indicar uno o más elementos antes del elemento que está seleccionando,la regla se vuelve más específica y tiene mayor prioridad:
ko: 보다 구체적인 규칙 사용 규칙을 선택하는 요소 앞에 하나 이상의 요소를 표시하면 규칙이 더 구체적이되고 우선 순위가 높아집니다.
zh_cn: 使用更具体的规则。通过在你要选择的元素前标明一个或多个元素,规则就会变得更加具体,并获得更高的优先级。

source: Using more than two colors
es: Usando más de dos colores
ko: 두 가지 이상의 색상 사용
zh_cn: 使用两种以上的颜色

source: Using multiple backgrounds
es: Usando múltiples fondos
ko: 여러 배경 사용
zh_cn: 使用多种背景

source: Using multiple writing modes
ko: 여러 쓰기 모드 사용
zh_cn: 使用多种书写模式

source: Using offset-distance in an animation
ko: 애니메이션에서 오프셋 거리 사용
zh_cn: 在动画中使用偏移距离

source: Using one or more of the <code>size</code>, <code>layout</code>, <code>style</code>, and <code>paint</code> keywords in any order.
ko: 순서에 상관없이 <code>size</code> , <code>layout</code> , <code>style</code> 및 <code>paint</code> 키워드 중 하나 이상을 사용합니다 .
zh_cn: 以任意顺序使用 <code>size</code> ， <code>layout</code> ， <code>style</code> 和 <code>paint</code> 关键字中的一个或多个。

source: Using outline to set a focus style
ko: 윤곽선을 사용하여 초점 스타일 설정
zh_cn: 使用大纲来设置焦点风格

source: Using radial gradients
es: Usando gradientes radiales
ko: 방사형 그래디언트 사용
zh_cn: 使用径向梯度

source: Using repeating gradients
es: Usando gradientes de repetición
ko: 반복 그라디언트 사용
zh_cn: 使用重复的梯度

source: Using resize with arbitrary elements
es: Usando el redimensionamiento con elementos arbitrarios
ko: 임의의 요소와 함께 크기 조정 사용
zh_cn: 使用任意元素调整大小

source: Using scroll-snap-align
ko: scroll-snap-align 사용
zh_cn: 使用滚动-滑动-对齐

source: Using scroll-snap-type
ko: scroll-snap-type 사용
zh_cn: 使用卷轴式

source: Using subgrids
ko: 서브 그리드 사용
zh_cn: 使用子网

source: Using the :target pseudo-class in selectors
es: Usando la pseudo-clase :target en selectores
ko: 선택기에서 : target 의사 클래스 사용
zh_cn: 在选择器中使用:目标伪类。

source: Using the <a href="../display"><code>display</code></a> property's <code>flex</code> value causes an element to generate a block-level flex container box. The <code>inline-flex</code> value causes an element to generate an inline-level flex container box.
es: El uso del valor <code>flex</code> ible de la propiedad de <a href="../display"> <code>display</code> </a> hace que un elemento genere una caja de contenedor flexible a nivel de bloque. El valor de <code>inline-flex</code> hace que un elemento genere una caja de contenedor flexible de nivel en l&iacute;nea.
ko: 은 Using <a href="../display"> <code>display</code> </a> 속성의 <code>flex</code> 값은 블록 레벨 플렉스 컨테이너 박스를 생성하는 요소를 야기한다. <code>inline-flex</code> 값 인라인 레벨 플렉스 컨테이너 박스를 생성하는 요소를 야기한다.
zh_cn: 使用<a href="../display"> <code>display</code> </a>属性的 <code>flex</code> 值会使元素生成一个块级的flex容器框。该 <code>inline-flex</code> 值导致的元件，以产生一个行内柔性容器箱。

source: Using the <a href="https://en.wikipedia.org/wiki/HSL_and_HSV">HSL cylindrical-coordinate</a> system (via the <code>hsl()</code> and <code>hsla()</code> functional notations)
es: Uso del sistema de <a href="https://en.wikipedia.org/wiki/HSL_and_HSV">coordenadas cil&iacute;ndricas HSL</a> (a trav&eacute;s de las <code>hsl()</code> y <code>hsla()</code> )
ko: 은 Using <a href="https://en.wikipedia.org/wiki/HSL_and_HSV">HSL 원통 좌표</a> (비아 시스템 <code>hsl()</code> 와 <code>hsla()</code> 기능 표기)
zh_cn: 使用<a href="https://en.wikipedia.org/wiki/HSL_and_HSV">HSL圆柱坐标</a>系（通过 <code>hsl()</code> 和 <code>hsla()</code> 功能符号）

source: Using the <a href="https://en.wikipedia.org/wiki/RGB_color_model#Geometric_representation">RGB cubic-coordinate</a> system (via the #-hexadecimal or the <code>rgb()</code> and <code>rgba()</code> functional notations)
es: Uso del sistema de <a href="https://en.wikipedia.org/wiki/RGB_color_model#Geometric_representation">coordenadas c&uacute;bicas RGB</a> (a trav&eacute;s de las notaciones funcionales # -hexadecimal o <code>rgb()</code> y <code>rgba()</code> )
ko: 은 Using <a href="https://en.wikipedia.org/wiki/RGB_color_model#Geometric_representation">RGB 입방정 좌표</a> (# 개를 -hexadecimal 또는 시스템을 통해 <code>rgb()</code> 와 <code>rgba()</code> 기능성 표기법)
zh_cn: 使用<a href="https://en.wikipedia.org/wiki/RGB_color_model#Geometric_representation">RGB三次坐标</a>系（通过＃十六进制或 <code>rgb()</code> 和 <code>rgba()</code> 功能符号）

source: Using the <code><a href="var()">var()</a></code> function, you can define multiple <strong>fallback values</strong> when the given variable is not yet defined; this can be useful when working with <a href="https://developer.mozilla.org/en-US/docs/Web/Web_Components/Using_custom_elements">Custom Elements</a> and <a href="https://developer.mozilla.org/en-US/docs/Web/Web_Components/Using_shadow_DOM">Shadow DOM</a>.
es: Usando la funci&oacute;n <code><a href="var()">var()</a></code> , puede definir m&uacute;ltiples <strong>valores de reserva</strong> cuando la variable dada a&uacute;n no est&aacute; definida; Esto puede ser &uacute;til cuando se trabaja con <a href="https://developer.mozilla.org/en-US/docs/Web/Web_Components/Using_custom_elements">Custom Elements</a> y <a href="https://developer.mozilla.org/en-US/docs/Web/Web_Components/Using_shadow_DOM">Shadow DOM</a> .
ko: <code><a href="var()">var()</a></code> 함수를 사용하면 지정된 변수가 아직 정의되지 않은 경우 여러 <strong>폴백 값을</strong> 정의 할 수 있습니다 . 이것은 <a href="https://developer.mozilla.org/en-US/docs/Web/Web_Components/Using_custom_elements">Custom Elements</a> 및 <a href="https://developer.mozilla.org/en-US/docs/Web/Web_Components/Using_shadow_DOM">Shadow DOM으로</a> 작업 할 때 유용 할 수 있습니다 .
zh_cn: 使用 <code><a href="var()">var()</a></code> 函数，可以在尚未定义给定变量的情况下定义多个<strong>后备值</strong>；这在使用&ldquo; <a href="https://developer.mozilla.org/en-US/docs/Web/Web_Components/Using_custom_elements">自定义元素&rdquo;</a>和&ldquo; <a href="https://developer.mozilla.org/en-US/docs/Web/Web_Components/Using_shadow_DOM">Shadow DOM&rdquo;</a>时很有用。

source: Using the <code>flex-direction</code> property with values of <code>row-reverse</code> or <code>column-reverse</code> will create a disconnect between the visual presentation of content and DOM order. This will adversely affect users experiencing low vision navigating with the aid of assistive technology such as a screen reader. If the visual (CSS) order is important, then screen reader users will not have access to the correct reading order.
es: El uso de la propiedad de <code>flex-direction</code> con valores de <code>row-reverse</code> de fila o reverso de <code>column-reverse</code> crear&aacute; una desconexi&oacute;n entre la presentaci&oacute;n visual del contenido y el orden DOM. Esto afectar&aacute; negativamente a los usuarios que experimentan navegaci&oacute;n de baja visi&oacute;n con la ayuda de tecnolog&iacute;a de asistencia, como un lector de pantalla. Si el orden visual (CSS) es importante, los usuarios de lectores de pantalla no tendr&aacute;n acceso al orden de lectura correcto.
ko: <code>flex-direction</code> 속성을 <code>row-reverse</code> 또는 <code>column-reverse</code> 값과 함께 사용하면 컨텐츠의 시각적 표현과 DOM 순서 사이에 연결이 끊어집니다. 이는 화면 판독기와 같은 보조 기술을 사용하여 시력이 낮은 탐색을 경험하는 사용자에게 부정적인 영향을 미칩니다. 비주얼 (CSS) 순서가 중요하면 스크린 리더 사용자는 올바른 읽기 순서에 액세스 할 수 없습니다.
zh_cn: 将 <code>flex-direction</code> 属性与 <code>row-reverse</code> 或 <code>column-reverse</code> 的值一起使用将在内容的可视表示与DOM顺序之间造成断开。借助于屏幕阅读器等辅助技术，这将不利地影响正在经历低视力导航的用户。如果视觉（CSS）顺序很重要，则屏幕阅读器用户将无权访问正确的阅读顺序。

source: Using the <code>order</code> property will create a disconnect between the visual presentation of content and DOM order. This will adversely affect users experiencing low vision navigating with the aid of assistive technology such as a screen reader. If the visual (css) order is important, then screen reader users will not have access to the correct reading order.
es: El uso de la propiedad de <code>order</code> crear&aacute; una desconexi&oacute;n entre la presentaci&oacute;n visual del contenido y el orden DOM. Esto afectar&aacute; negativamente a los usuarios que experimentan navegaci&oacute;n de baja visi&oacute;n con la ayuda de tecnolog&iacute;a de asistencia, como un lector de pantalla. Si el orden visual (css) es importante, los usuarios del lector de pantalla no tendr&aacute;n acceso al orden de lectura correcto.
ko: 은 Using <code>order</code> 특성은 내용과 DOM 순서의 시각적 표현 사이의 분리를 생성합니다. 이는 화면 판독기와 같은 보조 기술을 사용하여 시력이 낮은 탐색을 경험하는 사용자에게 부정적인 영향을 미칩니다. 시각적 (css) 순서가 중요한 경우 화면 판독기 사용자는 올바른 읽기 순서에 액세스 할 수 없습니다.
zh_cn: 使用 <code>order</code> 属性将在内容的可视表示和DOM顺序之间造成脱节。借助于屏幕阅读器等辅助技术，这将不利地影响正在经历低视力导航的用户。如果视觉（css）顺序很重要，则屏幕阅读器用户将无权访问正确的阅读顺序。

source: Using the <code>span</code> keyword
es: Usando la palabra clave <code>span</code>
ko: 은 Using <code>span</code> 키워드를
zh_cn: 使用 <code>span</code> 关键字

source: Using the CSS Painting API
ko: CSS Painting API 사용
zh_cn: 使用CSS绘画API

source: Using the X axis for an example, let's say we have an image that is 300px wide and we are using it in a container that is 100px wide, with background-size set to auto:
ko: 예를 들어 X 축을 사용하여 너비가 300px 인 이미지가 있고 배경 크기가 auto로 설정된 100px 너비의 컨테이너에서 사용한다고 가정 해 보겠습니다.
zh_cn: 以X轴为例,假设我们有一张300px宽的图片,我们在一个100px宽的容器中使用它,背景尺寸设置为自动。

source: Using the keyword values <code><a href="#contain">contain</a></code> or <code><a href="#cover">cover</a></code>.
es: El uso de los valores de palabras clave <code><a href="#contain">contain</a></code> o <code><a href="#cover">cover</a></code> .
ko: 키워드 값을 <code><a href="#contain">contain</a></code> 하거나 <code><a href="#cover">cover</a></code> 합니다.
zh_cn: 使用关键字值 <code><a href="#contain">contain</a></code> 或 <code><a href="#cover">cover</a></code> 。

source: Using the keyword values <code><a href="#start">start</a></code>, <code><a href="#end">end</a></code>, <code><a href="#left">left</a></code>, <code><a href="#right">right</a></code>, <code><a href="#center">center</a></code>, <code><a href="#justify">justify</a></code>, <code><a href="#justify-all">justify-all</a></code>, or <code><a href="#match-parent">match-parent</a></code>.
es: El uso de los valores de palabras clave <code><a href="#start">start</a></code> , <code><a href="#end">end</a></code> , <code><a href="#left">left</a></code> , <code><a href="#right">right</a></code> , <code><a href="#center">center</a></code> , <code><a href="#justify">justify</a></code> , <code><a href="#justify-all">justify-all</a></code> o <code><a href="#match-parent">match-parent</a></code> .
ko: 키워드 값 <code><a href="#start">start</a></code> , <code><a href="#end">end</a></code> , <code><a href="#left">left</a></code> , <code><a href="#right">right</a></code> , <code><a href="#center">center</a></code> , <code><a href="#justify">justify</a></code> , <code><a href="#justify-all">justify-all</a></code> 또는 <code><a href="#match-parent">match-parent</a></code> 를 사용하십시오 .
zh_cn: 使用关键字值 <code><a href="#start">start</a></code> ， <code><a href="#end">end</a></code> ， <code><a href="#left">left</a></code> ， <code><a href="#right">right</a></code> ， <code><a href="#center">center</a></code> ， <code><a href="#justify">justify</a></code> ， <code><a href="#justify-all">justify-all</a></code> 或 <code><a href="#match-parent">match-parent</a></code> 。

source: Using the next keyword
ko: 다음 키워드 사용
zh_cn: 使用下一个关键词

source: Using the same example, I am setting <a href="../justify-content"><code>justify-content</code></a> to <code>space-around</code>. This once again causes tracks which span more than one column track to gain extra space:
es: Usando el mismo ejemplo, estoy configurando <a href="../justify-content"> <code>justify-content</code> </a> a <code>space-around</code> . Una vez m&aacute;s, esto hace que las pistas que abarcan m&aacute;s de una columna de columna ganen espacio adicional:
ko: 동일한 예제를 사용하여 <a href="../justify-content"> <code>justify-content</code> </a> 를 <code>space-around</code> 로 설정 합니다. 이로 인해 하나 이상의 열 트랙에 걸쳐있는 트랙이 추가 공간을 확보하게됩니다.
zh_cn: 使用相同的例子，我设置<a href="../justify-content"> <code>justify-content</code> </a>到 <code>space-around</code> 。这再次导致跨越一个以上列轨道的轨道获得额外的空间：

source: Using the same length, order and keyterm values as the <a href="background-position">background-position</a> property, the position defines center of the gradient. If omitted, the default value is <code>center</code>, meaing the gradient will be centered, .
ko: <a href="background-position">background-position</a> 속성 과 동일한 길이, 순서 및 키워드 값을 사용 하여 위치는 그라데이션의 중심을 정의합니다. 생략하면 기본값은 <code>center</code> 이며 그래디언트가 중앙에 위치합니다.
zh_cn: 使用与<a href="background-position">background-position</a>属性相同的长度，顺序和关键术语值，该位置定义渐变的中心。如果省略，则默认值为 <code>center</code> ，表示渐变将居中。

source: Using the same rules as we use for the margin shorthand you can set more than one offset at once. If there is only one value, it applies to all sides. If there are two values, the top and bottom offsets are set to the first value and the right and left offsets are set to the second. If there are three values, the top is set to the first value, the left and right are set to the second, and the bottom is set to the third. If there are four values, they apply to the top, right, bottom, and left, respectively. So, the above rules could also be described as:
es: Usando las mismas reglas que usamos para la taquigrafía de los márgenes se puede establecer más de un desplazamiento a la vez.Si sólo hay un valor,se aplica a todos los lados.Si hay dos valores,los desplazamientos superiores e inferiores se fijan en el primer valor y los desplazamientos a la derecha y a la izquierda en el segundo.Si hay tres valores,la parte superior se fija en el primer valor,la izquierda y la derecha en el segundo,y la parte inferior en el tercero.Si hay cuatro valores,se aplican a la parte superior,derecha,inferior e izquierda,respectivamente.Por lo tanto,las reglas anteriores también podrían describirse como:
ko: 마진 단축에 사용하는 것과 동일한 규칙을 사용하여 한 번에 둘 이상의 오프셋을 설정할 수 있습니다. 값이 하나만 있으면 모든면에 적용됩니다. 두 개의 값이 있으면 위쪽 및 아래쪽 오프셋이 첫 번째 값으로 설정되고 오른쪽 및 왼쪽 오프셋이 두 번째 값으로 설정됩니다. 세 개의 값이 있으면 위쪽이 첫 번째 값으로 설정되고 왼쪽과 오른쪽이 두 번째로 설정되고 아래쪽이 세 번째로 설정됩니다. 네 개의 값이있는 경우 각각 위, 오른쪽, 아래쪽 및 왼쪽에 적용됩니다. 따라서 위의 규칙은 다음과 같이 설명 할 수도 있습니다.
zh_cn: 使用与我们使用的margin shorthand相同的规则,你可以同时设置多个偏移量。如果只有一个值,它适用于所有的边。如果有两个值,顶部和底部偏移量被设置为第一个值,左右偏移量被设置为第二个值。如果有三个值,则顶部设置为第一个值,左右设置为第二个值,底部设置为第三个值。如果有四个值,则分别适用于上、右、下、左。所以,上述规则也可以描述为。

source: Using the same rules as we use for the margin shorthand, you can set more than one offset at once. If there is only one value, it applies to all sides. If there are two values, the top and bottom offsets are set to the first value and the right and left offsets are set to the second. If there are three values, the top is set to the first value, the left and right are set to the second, and the bottom is set to the third. If there are four values, they apply to the top, right, bottom, and left, respectively. So, the above rules could also be described as:
ko: 여백 속기에서 사용하는 것과 동일한 규칙을 사용하여 한 번에 둘 이상의 오프셋을 설정할 수 있습니다. 값이 하나뿐이면 모든면에 적용됩니다. 두 개의 값이있는 경우 상단 및 하단 오프셋은 첫 번째 값으로 설정되고 오른쪽 및 왼쪽 오프셋은 두 번째 값으로 설정됩니다. 값이 세 개인 경우 상단은 첫 번째 값으로 설정되고 왼쪽과 오른쪽은 두 번째 값으로 설정되고 하단은 세 번째 값으로 설정됩니다. 4 개의 값이있는 경우 각각 위쪽, 오른쪽, 아래쪽 및 왼쪽에 적용됩니다. 따라서 위의 규칙은 다음과 같이 설명 할 수도 있습니다.
zh_cn: 使用与我们使用的margin shorthand相同的规则,你可以同时设置多个偏移量。如果只有一个值,它适用于所有的边。如果有两个值,顶部和底部偏移量设置为第一个值,左右偏移量设置为第二个值。如果有三个值,则顶部设置为第一个值,左右设置为第二个值,底部设置为第三个值。如果有四个值,则分别适用于上、右、下、左。所以,上述规则也可以描述为。

source: Using the value <code>inset()</code> wraps text around a rectangular shape however you are able to add offset values, thus pulling the line boxes of any wrapping content closer to the object than would otherwise happen.
es: El uso del valor <code>inset()</code> envuelve el texto alrededor de una forma rectangular; sin embargo, puede agregar valores de desplazamiento, colocando as&iacute; los cuadros de l&iacute;nea de cualquier contenido de ajuste m&aacute;s cerca del objeto de lo que suceder&iacute;a de otra manera.
ko: <code>inset()</code> 값을 사용하면 텍스트가 직사각형 모양으로 둘러싸지만 오프셋 값을 추가 할 수 있으므로 줄 바꿈 내용의 줄 상자가 다른 방식으로 개체에 더 가깝게 당겨집니다.
zh_cn: 使用值 <code>inset()</code> 可以将文本环绕在矩形上，但是您可以添加偏移值，从而将任何包装内容的线框拉到与对象接近的位置。

source: Using the variable:
es: Usando la variable:
ko: 변수 사용하기 :
zh_cn: 使用变量。

source: Using the viewport meta tag to control layout on mobile browsers
es: Usar la metaetiqueta del puerto de visualización para controlar el diseño en los navegadores móviles
ko: 모바일 브라우저에서 뷰포트 메타 태그를 사용하여 레이아웃 제어
zh_cn: 使用视口元标签来控制移动浏览器的布局。

source: Using the whole font
ko: 전체 글꼴 사용
zh_cn: 使用整个字体

source: Using this method we do not need to specify anything at all on the individual grid items, everything happens on our grid container. We can see the layout described as the value of the <a href="../grid-template-areas"><code>grid-template-areas</code></a> property.
es: Al usar este m&eacute;todo, no necesitamos especificar nada en los elementos de la cuadr&iacute;cula individual, todo sucede en nuestro contenedor de cuadr&iacute;cula. Podemos ver el dise&ntilde;o descrito como el valor de la propiedad <a href="../grid-template-areas"> <code>grid-template-areas</code> </a> .
ko: 이 방법을 사용하면 개별 그리드 항목에 아무것도 지정하지 않아도됩니다. 모든 것은 그리드 컨테이너에서 발생합니다. <a href="../grid-template-areas"> <code>grid-template-areas</code> </a> 속성 의 값으로 설명 된 레이아웃을 볼 수 있습니다 .
zh_cn: 使用这种方法，我们根本不需要在单个网格项上指定任何内容，而是在网格容器上进行所有操作。我们可以将布局描述为<a href="../grid-template-areas"> <code>grid-template-areas</code> </a>属性的值。

source: Using this property with a value different than <code>0</code> and <code>none</code> creates a new <a href="css_positioning/understanding_z_index/the_stacking_context">stacking context</a>. Also, in that case, the object will act as a containing block for <code>position: fixed</code> elements that it contains.
ko: 보다 큰 값의 다른 특성이 사용 <code>0</code> 및 <code>none</code> 신규 작성하지 <a href="css_positioning/understanding_z_index/the_stacking_context">적층 컨텍스트</a> . 또한이 경우 개체는 포함 <code>position: fixed</code> 요소에 대한 포함 블록 역할을합니다 .
zh_cn: 使用这个属性比不同的值 <code>0</code> 和 <code>none</code> 创建一个新的<a href="css_positioning/understanding_z_index/the_stacking_context">堆叠内容</a>。同样，在这种情况下，对象将充当 <code>position: fixed</code> 的包含块：它包含的固定元素。
