Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/css/css.*.017.xlf
Languages: es, ko, zh_cn

source: Video tutorial:<em> <a href="http://gridbyexample.com/video/grid-template-shorthand/">Grid Template shorthand</a></em>
es: Video tutorial: <em><a href="http://gridbyexample.com/video/grid-template-shorthand/">taquigraf&iacute;a de plantilla de cuadr&iacute;cula</a></em><em> </em>
ko: 비디오 자습서 : <em><a href="http://gridbyexample.com/video/grid-template-shorthand/">그리드 템플릿 속기</a></em><em> </em>
zh_cn: 视频教程：<em><a href="http://gridbyexample.com/video/grid-template-shorthand/">网格模板速记</a></em><em> </em>

source: View on JSFiddle
es: Vista de JSFiddle
ko: JSFiddle에서보기
zh_cn: 查看 JSFiddle

source: View the live example
es: Vea el ejemplo en vivo
ko: 라이브 예보기
zh_cn: 查看现场示例

source: Viewport concepts
es: Conceptos de Viewport
ko: 뷰포트 개념
zh_cn: 视口概念

source: Viewport sizes are mutable
es: Los tamaños de los puertos de visión son mutables
ko: 뷰포트 크기는 변경 가능
zh_cn: 视口尺寸是可以改变的

source: Viewport-percentage lengths
es: Longitudes porcentuales de los puertos de observación
ko: 뷰포트 백분율 길이
zh_cn: 视口百分比长度

source: Viewport-percentage lengths define the <code>&lt;length&gt;</code> value relative to the size of the <a href="https://developer.mozilla.org/en-US/docs/Glossary/viewport">viewport</a>, i.e., the visible portion of the document. Viewport lengths are invalid in <a href="@page"><code>@page</code></a> declaration blocks.
es: Las longitudes de porcentaje de la vista definen el valor de <code>&lt;length&gt;</code> relativo al tama&ntilde;o de la <a href="https://developer.mozilla.org/en-US/docs/Glossary/viewport">vista</a> , es decir, la parte visible del documento. Las longitudes de las <a href="@page"> <code>@page</code> </a> no son v&aacute;lidas en los bloques de declaraci&oacute;n @page .
ko: 뷰포트 백분율 길이 는 <a href="https://developer.mozilla.org/en-US/docs/Glossary/viewport">뷰포트</a> 의 크기 , 즉 문서의 보이는 부분에 상대적인 <code>&lt;length&gt;</code> 값을 정의합니다 . <a href="@page"> <code>@page</code> </a> 선언 블록 에서 뷰포트 길이가 유효하지 않습니다 .
zh_cn: 视口百分比长度定义相对于<a href="https://developer.mozilla.org/en-US/docs/Glossary/viewport">视口</a>大小（即文档的可见部分）的 <code>&lt;length&gt;</code> 值。视口长度在<a href="@page"> <code>@page</code> </a>声明块中无效。

source: Viewport-percentage lengths invalid in <code>@page</code>
es: Las longitudes de porcentaje de ventana <code>@page</code> no son v&aacute;lidas en @page
ko: <code>@page</code> 에서 유효하지 않은 뷰포트 백분율 길이
zh_cn: <code>@page</code> 中的视口百分比长度无效

source: Visibility values are interpolable between <em>visible</em> and <em>not-visible</em>. One of the start or ending values must therefore be <code>visible</code> or no interpolation can happen. The value is interpolated as a discrete step, where values of the timing function between <code>0</code> and <code>1</code> map to <code>visible</code> and other values of the timing function (which occur only at the start/end of the transition or as a result of <code>cubic-bezier()</code> functions with y values outside of [0, 1]) map to the closer endpoint.
es: Los valores de visibilidad son interpolables entre <em>visible</em> y <em>no visible</em> . Por lo tanto, uno de los valores iniciales o finales debe ser <code>visible</code> o no puede ocurrir ninguna interpolaci&oacute;n. El valor se interpola como un paso discreto, donde los valores de la funci&oacute;n de temporizaci&oacute;n entre <code>0</code> y <code>1</code> se asignan a valores <code>visible</code> s y otros de la funci&oacute;n de temporizaci&oacute;n (que ocurren solo al inicio / final de la transici&oacute;n o como resultado de <code>cubic-bezier()</code> funciona con valores y fuera de [0, 1]) correlacionar con el punto final m&aacute;s cercano.
ko: 가시성 값은 <em>visible</em> 과 <em>not </em><em>visible</em> 사이에서 보간 할 <em>수 </em><em>있습니다</em> . 따라서 시작 또는 끝 값 중 하나가 <code>visible</code> 거나 보간이 발생하지 않아야합니다 . 값은 이산 단계로 보간되는 경우의 타이밍 함수의 값을 <code>0</code> 과 <code>1</code> 로지도 <code>visible</code> 만이 전환의 시작 / 종료 또는 결과로서 발생하는 타이밍 기능과 다른 값 ( <code>cubic-bezier()</code> 가 [0, 1] 이외의 y 값을 가진 함수는 더 가까운 끝점에 매핑됩니다.
zh_cn: 能见度值之间倍频细<em>可见</em>和<em>不可见的</em>。因此，起始值或结束值之一必须是 <code>visible</code> 否则插值将不会发生。将该值作为离散步进行插值，其中介于 <code>0</code> 和 <code>1</code> 之间的计时函数的值映射到该计时函数的 <code>visible</code> 值和其他值（它们仅在过渡的开始/结束或 <code>cubic-bezier()</code> y值在[0，1]之外的函数）映射到更近的端点。

source: Visual Formatting Model
es: Modelo de formato visual
ko: 비주얼 포맷팅 모델
zh_cn: 视觉格式化模型

source: Visual Guide to CSS3 Flexbox: Flexbox Playground |
es: Guía visual de CSS3 Flexbox:Flexbox Playground |
ko: CSS3 Flexbox 비주얼 가이드 : Flexbox Playground |
zh_cn: CSS3 Flexbox可视化指南。Flexbox Playground

source: Visual Presentation: Understanding SC 1.4.8 | Understanding WCAG 2.0
es: Presentación visual:Comprensión de SC 1.4.8 | Comprensión de WCAG 2.0
ko: 비주얼 프리젠 테이션 : SC 이해 1.4.8 | WCAG 2.0 이해
zh_cn: 视觉呈现。了解SC 1.4.8|了解WCAG 2.0。

source: Visual Viewport API
es: API de Visual Viewport
ko: 비주얼 뷰포트 API
zh_cn: 视觉视口API

source: Visual formatting model
es: Modelo de formato visual
ko: 비주얼 포맷 모델
zh_cn: 可视化格式化模型

source: Visual not logical re-ordering
es: Reordenamiento visual no lógico
ko: 시각적 비논리적 재정렬
zh_cn: 视觉上而非逻辑上的重新排序

source: Visually layering elements
ko: 시각적 레이어링 요소
zh_cn: 视觉上的分层元素

source: Visually the date appears above the heading, in the source. However, if the card was read out by a screen reader I would prefer that the title was announced first and then the publication date. We can make this so using the <code>order</code> property.
es: Visualmente, la fecha aparece sobre el encabezado, en la fuente. Sin embargo, si un lector de pantalla leyera la tarjeta, preferir&iacute;a que se anunciara primero el t&iacute;tulo y luego la fecha de publicaci&oacute;n. Podemos hacer esto usando la propiedad de <code>order</code> .
ko: 시각적으로 날짜가 소스의 제목 위에 나타납니다. 그러나 스크린 리더가 카드를 읽은 경우 제목을 먼저 발표 한 다음 발행 날짜를 선호합니다. <code>order</code> 속성을 사용하여이를 만들 수 있습니다 .
zh_cn: 直观地，日期显示在源中标题上方。但是，如果卡是由屏幕阅读器读出的，则我希望标题先公布，然后再公布日期。我们可以使用 <code>order</code> 属性来做到这一点。

source: Visually, the markers are <em>outside</em> the content area of the <code>&lt;ul&gt;</code>, but that's not the important part here. What's key is that the markers are placed outside the "principal box" of the <code>&lt;li&gt;</code> elements, not the <code>&lt;ul&gt;</code>. They're sort of like appendages to the list items, hanging outside the content-area of the <code>&lt;li&gt;</code> but still attached to the <code>&lt;li&gt;</code>.
es: Visualmente, los marcadores est&aacute;n <em>fuera</em> del &aacute;rea de contenido de <code>&lt;ul&gt;</code> , pero esa no es la parte importante aqu&iacute;. La clave es que los marcadores se colocan fuera del "cuadro principal" de los elementos <code>&lt;li&gt;</code> , no de <code>&lt;ul&gt;</code> . Son como ap&eacute;ndices de los elementos de la lista, colgando fuera del &aacute;rea de contenido del <code>&lt;li&gt;</code> pero a&uacute;n unidos al <code>&lt;li&gt;</code> .
ko: 시각적으로 마커는 <code>&lt;ul&gt;</code> 의 콘텐츠 영역 <em>밖에</em> 있지만 여기서 중요한 부분은 아닙니다. 핵심은 마커가 <code>&lt;ul&gt;</code> 이 아니라 <code>&lt;li&gt;</code> 요소 의 "주체 상자"외부에 배치된다는 것 입니다. 그들은의 내용 영역 외부에 매달려 정렬 목록 항목에 부속 등있어 <code>&lt;li&gt;</code> 여전히 부착 <code>&lt;li&gt;</code> .
zh_cn: 在视觉上，标记<em>位于</em> <code>&lt;ul&gt;</code> 的内容区域<em>之外</em>，但这不是这里的重要部分。关键是将标记放置在 <code>&lt;li&gt;</code> 元素的&ldquo;主框&rdquo;之外，而不是 <code>&lt;ul&gt;</code> 。它们有点像列表项的附件，挂在 <code>&lt;li&gt;</code> 的内容区域之外，但仍附加到 <code>&lt;li&gt;</code> 。

source: VoiceOver and list-style-type: none &ndash; Unfettered Thoughts
es: VoiceOver y tipo de estilo de lista: ninguno - Pensamientos sin restricciones
ko: VoiceOver 및 목록 스타일 유형 : 없음 &ndash; 틀린 생각
zh_cn: VoiceOver和列表样式类型：无-不受约束的想法

source: W3C Github issue queue
es: W3C Github issue tail
ko: W3C Github 이슈 큐
zh_cn: W3C Github问题尾巴

source: W3C Specifications:
es: Especificaciones del W3C:
ko: W3C 사양 :
zh_cn: W3C规范。

source: W3C Understanding WCAG 2.1
es: W3C Comprensión de WCAG 2.1
ko: W3C WCAG 2.1 이해
zh_cn: W3C 了解 WCAG 2.1

source: WCAG criterion 2.1.1 (Keyboard) has been in place for a long time to advise on basic keyboard accessibility, and this should include scrolling of content areas. And introduced in WCAG 2.1, criterion 2.5.5 (Target Size) advises that touch targets should be at least 44px in width and height (although the problem is compounded on high-resolution screens; thorough testing is advised).
ko: WCAG 기준 2.1.1 (키보드)은 기본 키보드 접근성에 대해 조언하기 위해 오랫동안 적용되어 왔으며 여기에는 콘텐츠 영역 스크롤이 포함되어야합니다. WCAG 2.1에 도입 된 기준 2.5.5 (대상 크기)는 터치 대상의 너비와 높이가 44px 이상이어야한다고 조언합니다 (고해상도 화면에서는 문제가 더 복잡하지만 철저한 테스트가 권장 됨).
zh_cn: WCAG标准2.1.1(键盘)已经存在了很长时间,就基本的键盘无障碍性提出建议,这应该包括内容区域的滚动。WCAG 2.1中引入的标准2.5.5(目标尺寸)建议触摸目标的宽度和高度至少应为44px(尽管在高分辨率屏幕上问题更加复杂;建议进行全面测试)。

source: WHATWG HTML GitHub issues
ko: WHATWG HTML GitHub 문제
zh_cn: WHATWG HTML GitHub问题

source: WOFF 2
ko: 오프 2

source: WOFF File Format 1.0<br/><small>The definition of 'WOFF font format' in that specification.</small>
es: WOFF File Format 1.0 <br/><small>La definici&oacute;n de 'formato de fuente WOFF' en esa especificaci&oacute;n.</small>
ko: WOFF 파일 형식 1.0 <br/><small>해당 사양에서 'WOFF 글꼴 형식'의 정의.</small>
zh_cn: WOFF文件格式1.0 <br/><small>该规范中&ldquo; WOFF字体格式&rdquo;的定义。</small>

source: WOFF File Format 2.0<br/><small>The definition of 'WOFF2 font format' in that specification.</small>
es: WOFF File Format 2.0 <br/><small>La definici&oacute;n de 'formato de fuente WOFF2' en esa especificaci&oacute;n.</small>
ko: WOFF 파일 형식 2.0 <br/><small>해당 사양에서 'WOFF2 글꼴 형식'의 정의.</small>
zh_cn: WOFF文件格式2.0 <br/><small>该规范中&ldquo; WOFF2字体格式&rdquo;的定义。</small>

source: Wakamai Fondue
es: Fondue Wakamai
ko: 와카 마이 폰듀
zh_cn: 若舞火锅

source: We added a margin the size of the widest box-shadow to ensure the shadow doesn't overlap adjacent elements or go beyond the border of the containing box. A box-shadow does not impact <a href="css_box_model">box model</a> dimensions.
ko: 그림자가 인접한 요소와 겹치거나 포함하는 상자의 테두리를 벗어나지 않도록 가장 넓은 상자 그림자 크기의 여백을 추가했습니다. 상자 그림자는 <a href="css_box_model">상자 모델</a> 치수에 영향을주지 않습니다 .
zh_cn: 我们添加了一个最宽的框阴影大小的边距，以确保阴影不与相邻元素重叠或超出包含框的边界。盒子阴影不会影响<a href="css_box_model">盒子模型的</a>尺寸。

source: We also provide a checkbox allowing you to toggle between this, and <code>transform-style: flat</code>. In this alternative state, the cube faces are all flattened onto the plane of their parent, and you might not be able to see them at all, depending on the browser you are using.
ko: 이것과 <code>transform-style: flat</code> 사이를 전환 할 수있는 확인란도 제공합니다 . 이 대체 상태에서 큐브면은 모두 부모의 평면에 평평 해지며 사용중인 브라우저에 따라 전혀 볼 수 없을 수도 있습니다.
zh_cn: 我们还提供了一个复选框，允许您在此 <code>transform-style: flat</code> 和transform-style：flat之间切换。在这种替代状态下，多维数据集的所有面都被平展到其父级的平面上，根据所使用的浏览器，您可能根本看不到它们。

source: We also wanted to get rid of the standard overscroll effects when the contacts are scrolled to the top or bottom (e.g. Chrome on Android refreshes the page when you scroll past the top boundary). This can be prevented by setting <code>overscroll-behavior: none</code> on the <a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/body"><code>&lt;body&gt;</code></a> element:
es: Tambi&eacute;n quer&iacute;amos deshacernos de los efectos de desplazamiento est&aacute;ndar cuando los contactos se desplazan hacia arriba o hacia abajo (por ejemplo, Chrome en Android actualiza la p&aacute;gina cuando se desplaza m&aacute;s all&aacute; del l&iacute;mite superior). Esto puede evitarse configurando <code>overscroll-behavior: none</code> en el elemento <a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/body"> <code>&lt;body&gt;</code> </a> :
ko: 또한 연락처가 상단 또는 하단으로 스크롤 될 때 표준 오버 스크롤 효과를 제거하고 싶었습니다 (예 : Android의 Chrome에서 상단 경계를 지나서 스크롤하면 페이지가 새로 고침 됨). <a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/body"> <code>&lt;body&gt;</code> </a> 요소 에서 <code>overscroll-behavior: none</code> 을 설정하면이를 방지 할 수 있습니다 .
zh_cn: 当联系人滚动到顶部或底部时，我们还希望摆脱标准的过度滚动效果（例如，当您滚动到顶部边界之外时，Android上的Chrome会刷新页面）。可以通过设置 <code>overscroll-behavior: none</code> <a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/body"> <code>&lt;body&gt;</code> </a>元素上的none来防止这种情况：

source: We are able to align the content inside grid areas, and the grid tracks themselves on these two axes.
es: Somos capaces de alinear el contenido dentro de las áreas de la cuadrícula,y la cuadrícula se rastrea a sí misma en estos dos ejes.
ko: 그리드 영역 안에 내용을 정렬 할 수 있으며 그리드는이 두 축에서 자체적으로 추적됩니다.
zh_cn: 我们能够将网格区域内的内容对齐,网格在这两个轴上自行跟踪。

source: We are going to create a grid with a flexible number of flexible columns. I want them never to become smaller than 200 pixels, and then to share any available remaining space equally &ndash; so we always get equal width column tracks. We achieve this with the <code>minmax()</code> function in our repeat notation for track sizing.
es: Vamos a crear una cuadr&iacute;cula con un n&uacute;mero flexible de columnas flexibles. Quiero que nunca sean m&aacute;s peque&ntilde;os que 200 p&iacute;xeles, y que luego compartan cualquier espacio restante disponible por igual, para que siempre obtengamos pistas de columna de igual ancho. Logramos esto con la funci&oacute;n <code>minmax()</code> en nuestra notaci&oacute;n de repetici&oacute;n para dimensionamiento de pistas.
ko: 유연한 개수의 유연한 열이있는 그리드를 만들겠습니다. 나는 그들이 200 픽셀보다 작아지지 않도록하고 사용 가능한 남은 공간을 동일하게 공유하기를 원합니다. 따라서 항상 동일한 너비의 열 트랙을 얻습니다. 트랙 크기 조정을위한 반복 표기법으로 <code>minmax()</code> 함수를 사용하여이를 달성합니다 .
zh_cn: 我们将创建一个具有灵活数量的灵活列的网格。我希望它们永远不会小于200像素，然后平等地共享任何可用的剩余空间-因此我们总是获得等宽的列轨道。我们通过在重复符号中使用 <code>minmax()</code> 函数来实现此目的，以实现轨道大小调整。

source: We are making use of cross-axis alignment in the most simple flex example. If we add <code>display: flex</code> to a container, the child items all become flex items arranged in a row. They will all stretch to be as tall as the tallest item, as that item is defining the height of the items on the cross axis. If your flex container has a height set, then the items will stretch to that height, regardless of how much content is in the item.
es: Estamos haciendo uso de la alineaci&oacute;n de ejes cruzados en el ejemplo flexible m&aacute;s simple. Si agregamos <code>display: flex</code> a un contenedor, todos los elementos secundarios se convierten en elementos flexibles dispuestos en una fila. Todos se estirar&aacute;n para ser tan altos como el elemento m&aacute;s alto, ya que ese elemento define la altura de los elementos en el eje transversal. Si su contenedor flexible tiene una altura establecida, los elementos se estirar&aacute;n a esa altura, independientemente de cu&aacute;nto contenido haya en el elemento.
ko: 가장 간단한 플렉스 예제에서 교차 축 정렬을 사용하고 있습니다. 컨테이너 에 <code>display: flex</code> 를 추가 하면 자식 항목이 모두 한 줄로 배열 된 flex 항목이됩니다. 그것들은 십자선에서 아이템의 높이를 정의하기 때문에 모두 가장 높은 아이템만큼 키가 커집니다. 플렉스 컨테이너의 높이가 설정되어 있으면 항목의 내용량에 관계없이 항목이 해당 높이로 늘어납니다.
zh_cn: 在最简单的flex示例中，我们正在使用横​​轴对齐。如果我们向容器添加 <code>display: flex</code> ，则所有子项都将变成排成一行的flex项。它们都将拉伸成与最高的项目一样高，因为该项目在横轴上定义了项目的高度。如果您的flex容器设置了高度，那么无论项目中有多少内容，项目都会拉伸到该高度。

source: We are once again going to make this a responsive layout, this time however using named lines. Every breakpoint will use a 12-column grid, however the number of tracks that items will span changes depending on the size of the screen.
es: Una vez más vamos a hacer que este diseño responda,esta vez sin embargo usando líneas de nombre.Cada punto de interrupción utilizará una cuadrícula de 12 columnas,sin embargo el número de pistas que los elementos abarcarán cambia dependiendo del tamaño de la pantalla.
ko: 우리는 다시 한번 이것을 반응 형 레이아웃으로 만들려고하지만 이번에는 명명 된 라인을 사용합니다. 모든 중단 점은 12 열 그리드를 사용하지만 화면의 크기에 따라 항목에 걸쳐있는 트랙의 수가 변경됩니다.
zh_cn: 我们将再次将其打造成一个响应式布局,不过这次使用的是命名线。每一个断点都将使用12列网格,但是项目跨越的轨道数量会根据屏幕的大小而改变。

source: We are working in English, a left-to-right language. Our block-start is the top row line of the grid container, block-end the final row line of the container. Our inline-start is the left-hand column line as inline-start is always the point from which text would be written in the current writing mode, inline-end is the final column line of our grid.
es: Estamos trabajando en inglés,un idioma de izquierda a derecha.Nuestro bloque de inicio es la línea de la fila superior del contenedor de la rejilla,el bloque de fin de la línea de la fila final del contenedor.Nuestro inline-start es la línea de columna de la izquierda ya que inline-start es siempre el punto desde el que se escribiría el texto en el modo de escritura actual,inline-end es la línea de columna final de nuestra cuadrícula.
ko: 우리는 왼쪽에서 오른쪽 언어 인 영어로 일하고 있습니다. 우리의 블록 시작은 그리드 컨테이너의 맨 윗줄이며 컨테이너의 마지막 줄입니다. 인라인 시작은 항상 현재 쓰기 모드에서 텍스트가 쓰여지는 지점이므로 인라인 시작은 왼쪽 열입니다. 인라인 끝은 그리드의 마지막 열입니다.
zh_cn: 我们的工作语言是英语,从左到右。我们的block-start是网格容器的最上面一行,block-end是容器的最后一行。我们的inline-start是左手边的列行,因为inline-start总是在当前的写作模式下会从这个点开始写文字,inline-end是我们网格的最终列行。

source: We are working with a <code>flex-basis</code> equal to the content size so the available space to distribute is subtracted from the total available space (the width of the flex container), and the leftover space is then shared out equally among each item. Our bigger item ends up bigger because it started from a bigger size, even though it has the same amount of spare space assigned to it as the others:
es: Estamos trabajando con una <code>flex-basis</code> igual al tama&ntilde;o del contenido, de modo que el espacio disponible para distribuir se resta del espacio disponible total (el ancho del contenedor flexible), y el espacio sobrante se reparte equitativamente entre cada elemento. Nuestro art&iacute;culo m&aacute;s grande termina m&aacute;s grande porque comenz&oacute; desde un tama&ntilde;o m&aacute;s grande, a pesar de que tiene la misma cantidad de espacio libre asignado que los dem&aacute;s:
ko: 우리는 작업하는 <code>flex-basis</code> 배포 할 수있는 사용 가능한 공간이 총 사용 가능한 공간 (플렉스 컨테이너의 폭)에서 제외되기 때문에 컨텐츠 크기와 동일하고, 남은 공간은 다음 각 항목에 균등하게 밖으로 공유됩니다. 우리의 더 큰 품목은 다른 것과 같은 양의 여유 공간이 할당되어 있어도 더 큰 크기로 시작했기 때문에 더 커집니다.
zh_cn: 我们正在使用等于内容大小的 <code>flex-basis</code> ，以便从总可用空间（flex容器的宽度）中减去要分配的可用空间，然后将剩余的空间平均分配给每个项目。我们更大的项目最终会变得更大，因为它是从更大的尺寸开始的，即使它分配的剩余空间与其他项目相同：

source: We call these keywords and properties <em>physical</em> because they relate to the screen you are looking at. Left is always left, no matter what direction your text is running.
es: Llamamos a estas palabras clave y propiedades <em>f&iacute;sicas</em> porque se relacionan con la pantalla que est&aacute; viendo. La izquierda siempre se deja, sin importar en qu&eacute; direcci&oacute;n se est&eacute; ejecutando el texto.
ko: 이러한 키워드와 속성 은보고있는 화면과 관련이 있으므로 <em>물리적</em> 이라고합니다. 텍스트의 방향에 관계없이 왼쪽은 항상 왼쪽입니다.
zh_cn: 我们将这些关键字和属性称为<em>物理</em>属性，因为它们与您正在查看的屏幕相关。无论文本沿什么方向运行，&ldquo;左&rdquo;总是左。

source: We can also count backwards from the block and inline end of the grid, for English that would be the right hand column line and final row line. These lines can be addressed as <code>-1</code>, and you can count back from there &ndash; so the penultimate line is <code>-2</code>. It is worth noting that the final line is the final line of the <em>explicit grid</em>, the grid defined by <code>grid-template-columns</code> and <code>grid-template-rows</code>, and does not take into account any rows or columns added in the <em>implicit grid</em> outside of that.
es: Tambi&eacute;n podemos contar hacia atr&aacute;s desde el bloque y el extremo en l&iacute;nea de la cuadr&iacute;cula, para el ingl&eacute;s esa ser&iacute;a la l&iacute;nea de columna derecha y la l&iacute;nea de fila final. Estas l&iacute;neas se pueden direccionar como <code>-1</code> , y puede contar desde all&iacute;, por lo que la pen&uacute;ltima l&iacute;nea es <code>-2</code> . Vale la pena se&ntilde;alar que la l&iacute;nea final es la l&iacute;nea final de la <em>cuadr&iacute;cula expl&iacute;cita</em> , la cuadr&iacute;cula definida por <code>grid-template-columns</code> y <code>grid-template-rows</code> , y no tiene en cuenta ninguna fila o columna agregada en la <em>cuadr&iacute;cula impl&iacute;cita</em> fuera de ese.
ko: 오른쪽 열 줄과 마지막 행 줄인 영어의 경우 그리드의 블록과 인라인 끝에서 뒤로 계산할 수도 있습니다. 이 줄은 <code>-1</code> 로 주소를 지정할 수 있으며 , 그 줄부터 다시 계산할 수 있습니다 . 따라서 두 번째 줄은 <code>-2</code> 입니다. 마지막 줄은 <em>명시 적 그리드</em> 의 마지막 라인 , <code>grid-template-columns</code> 및 <code>grid-template-rows</code> 에 의해 정의 된 그리드 이며 , 외부의 <em>암시 적 그리드에</em> 추가 된 행이나 열은 고려하지 않습니다. 그.
zh_cn: 我们还可以从网格的块和行内末尾开始倒数，对于英语，这将是右侧的列线和最后的行线。这些行的地址为 <code>-1</code> ，您可以从那里倒数&ndash;因此倒数第二行是 <code>-2</code> 。值得注意的是，最后一行是<em>显式网格</em>的最后一行，<em>显式网格</em>是由 <code>grid-template-columns</code> 和 <code>grid-template-rows</code> 定义的网格，并且不考虑在<em>隐式网格</em>之外添加的任何行或列。那。

source: We can also define an area by giving it a name and then specify the location of that area in the value of the <a href="../grid-template-areas"><code>grid-template-areas</code></a> property. You can choose what you would like to name your area. For example, if I wish to create the layout shown below I can identify four main areas.
es: Tambi&eacute;n podemos definir un &aacute;rea d&aacute;ndole un nombre y luego especificar la ubicaci&oacute;n de esa &aacute;rea en el valor de la propiedad <a href="../grid-template-areas"> <code>grid-template-areas</code> </a> . Puede elegir el nombre que desea para su &aacute;rea. Por ejemplo, si deseo crear el dise&ntilde;o que se muestra a continuaci&oacute;n, puedo identificar cuatro &aacute;reas principales.
ko: 이름을 지정하여 영역을 정의한 다음 <a href="../grid-template-areas"> <code>grid-template-areas</code> </a> 속성 값으로 해당 영역의 위치를 ​​지정할 수도 있습니다 . 당신은 당신이 당신의 지역의 이름을 지정할 것을 선택할 수 있습니다. 예를 들어 아래 표시된 레이아웃을 만들려면 네 가지 주요 영역을 식별 할 수 있습니다.
zh_cn: 我们还可以通过给它命名来定义一个区域，然后在<a href="../grid-template-areas"> <code>grid-template-areas</code> </a>属性的值中指定该区域的位置。您可以选择要命名的区域。例如，如果我要创建如下所示的布局，则可以确定四个主要区域。

source: We can also support keyboard users with this technique, by adding a <code>tabindex</code> of <code>0</code> to make each <code>span</code> keyboard focusable, and using a CSS <code>:focus</code> selector. This shows how flexible <code>::before</code> and <code>::after</code> can be, though for the most accessible experience a semantic disclosure widget created in some other way (such as with <a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/details">details and summary</a> elements) is likely to be more appropriate.
ko: 우리는 또한 추가하여,이 기술로 키보드 사용자를 지원할 수 <code>tabindex</code> 의 <code>0</code> 을 각각 만들 <code>span</code> 키보드 포커스를, 그리고 CSS 사용하여 <code>:focus</code> 선택합니다. 이것은 <code>::before</code> 와 <code>::after</code> 가 얼마나 유연 할 수 있는지 보여 주지만 , 가장 접근하기 쉬운 경험을 위해서는 ( <a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/details">세부 사항 및 요약</a> 요소 와 같은) 다른 방식으로 생성 된 의미 론적 공개 위젯 이 더 적절할 수 있습니다.
zh_cn: 我们还可以通过以下方法支持键盘用户：添加 <code>tabindex</code> 为 <code>0</code> ,以使每个 <code>span</code> 键盘都可聚焦，并使用CSS <code>:focus</code> 选择器。这显示了 <code>::before</code> 和 <code>::after</code> 的灵活性，尽管对于大多数可访问的体验而言，以其他方式（例如，使用<a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/details">详细信息和摘要</a>元素）创建的语义公开窗口小部件可能更合适。
