Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/css/css.*.017.xlf
Languages: es, ko, zh_cn

source: You can also ask grid to auto-place items by column. Using the property <a href="../grid-auto-flow"><code>grid-auto-flow</code></a> with a value of <code>column</code>. In this case grid will add items in rows that you have defined using <a href="../grid-template-rows"><code>grid-template-rows</code></a>. When it fills up a column it will move onto the next explicit column, or create a new column track in the implicit grid. As with implicit row tracks, these column tracks will be auto sized. You can control the size of implicit column tracks with <a href="../grid-auto-columns"><code>grid-auto-columns</code></a>, this works in the same way as <a href="../grid-auto-rows"><code>grid-auto-rows</code></a>.
es: Tambi&eacute;n puede pedirle a la cuadr&iacute;cula que coloque autom&aacute;ticamente los elementos por columna. Usando la propiedad <a href="../grid-auto-flow"> <code>grid-auto-flow</code> </a> con un valor de <code>column</code> a . En este caso, la cuadr&iacute;cula agregar&aacute; elementos en las filas que haya definido utilizando <a href="../grid-template-rows"> <code>grid-template-rows</code> </a> . Cuando llena una columna, se mover&aacute; a la siguiente columna expl&iacute;cita o crear&aacute; una nueva pista de columna en la cuadr&iacute;cula impl&iacute;cita. Al igual que con las pistas de fila impl&iacute;citas, estas pistas de columna se dimensionar&aacute;n autom&aacute;ticamente. Puede controlar el tama&ntilde;o de las pistas de columna impl&iacute;citas con <a href="../grid-auto-columns"> <code>grid-auto-columns</code> </a> , esto funciona de la misma manera que <a href="../grid-auto-rows"> <code>grid-auto-rows</code> </a> .
ko: 그리드를 사용하여 항목을 열별로 자동 배치하도록 요청할 수도 있습니다. 속성 사용 <a href="../grid-auto-flow"> <code>grid-auto-flow</code> </a> 의 값이 <code>column</code> . 이 경우 grid는 <a href="../grid-template-rows"> <code>grid-template-rows</code> 를</a> 사용하여 정의한 행에 항목을 추가합니다 . 열을 채우면 다음 명시 적 열로 이동하거나 암시 적 그리드에 새 열 트랙을 만듭니다. 암시 적 행 트랙과 마찬가지로이 열 트랙의 크기는 자동으로 조정됩니다. <a href="../grid-auto-columns"> <code>grid-auto-columns</code> </a> 로 암시 적 열 트랙의 크기를 제어 할 수 있습니다. 이는 <a href="../grid-auto-rows"> <code>grid-auto-rows</code> </a> 와 같은 방식으로 작동 합니다 .
zh_cn: 您也可以要求网格按列自动放置项目。使用值为 <code>column</code> 的属性<a href="../grid-auto-flow"> <code>grid-auto-flow</code> </a>。在这种情况下，网格将在使用<a href="../grid-template-rows"> <code>grid-template-rows</code> </a>定义的行中添加项目。当它填充一列时，它将移至下一个显式列，或在隐式网格中创建一个新的列轨迹。与隐式行轨道一样，这些列轨道将自动调整大小。您可以使用<a href="../grid-auto-columns"> <code>grid-auto-columns</code> </a>控制隐式列轨道的大小，其工作方式与<a href="../grid-auto-rows"> <code>grid-auto-rows</code> 相同</a>。

source: You can also define a set size for tracks created in the implicit grid with the <a href="../grid-auto-rows"><code>grid-auto-rows</code></a> and <a href="../grid-auto-columns"><code>grid-auto-columns</code></a> properties.
es: Tambi&eacute;n puede definir un tama&ntilde;o establecido para las pistas creadas en la cuadr&iacute;cula impl&iacute;cita con las propiedades <a href="../grid-auto-rows"> <code>grid-auto-rows</code> </a> y <a href="../grid-auto-columns"> <code>grid-auto-columns</code> </a> .
ko: <a href="../grid-auto-rows"> <code>grid-auto-rows</code> </a> 및 <a href="../grid-auto-columns"> <code>grid-auto-columns</code> </a> 속성 을 사용하여 암시 적 그리드에서 생성 된 트랙의 설정 크기를 정의 할 수도 있습니다.
zh_cn: 您还可以使用<a href="../grid-auto-rows"> <code>grid-auto-rows</code> </a>和<a href="../grid-auto-columns"> <code>grid-auto-columns</code> </a>属性为在隐式网格中创建的轨道定义设置大小。

source: You can also pass in a track listing, this will repeat. The following track listing will create an initial implicit row track as 100 pixels and a second as <code>200px</code>. This will continue for as long as content is added to the implicit grid.
es: Tambi&eacute;n puede pasar una lista de pistas, esto se repetir&aacute;. La siguiente lista de pistas crear&aacute; una pista de fila impl&iacute;cita inicial como 100 p&iacute;xeles y una segunda como <code>200px</code> p&iacute;xeles . Esto continuar&aacute; mientras se agregue contenido a la cuadr&iacute;cula impl&iacute;cita.
ko: 당신은 또한 트랙 목록을 전달할 수 있습니다, 이것은 반복됩니다. 다음 트랙 목록은 초기 암시 적 행 트랙을 100 픽셀로 만들고 초를 <code>200px</code> 로 만듭니다. 내용이 암시 적 그리드에 추가되는 한 계속됩니다.
zh_cn: 您也可以传递曲目列表，此过程将重复。以下轨道清单将创建一个初始的隐式行轨道为100像素，第二个隐式行轨道为 <code>200px</code> 。只要将内容添加到隐式网格中，此操作就会持续​​进行。

source: You can also pass in the keywords <code>mandatory</code>, or <code>proximity</code>. The <code>mandatory</code> keyword tells the browser whether the content <em>has</em> to snap to a certain point, no matter where the scroll is. The <code>proximity</code> keyword means that it may snap to the point, but does not have to.
ko: <code>mandatory</code> 또는 <code>proximity</code> 키워드를 전달할 수도 있습니다 . <code>mandatory</code> 키워드는 내용이 있는지 브라우저 알 수 <em>있다</em> 스크롤이 위치에 상관없이, 특정 지점에 스냅 없음을. <code>proximity</code> 키워드 수단은이 점에 스냅 할 수 있지만하지 않습니다.
zh_cn: 您还可以输入关键字&ldquo; <code>mandatory</code> &rdquo;或&ldquo; <code>proximity</code> 。该 <code>mandatory</code> 关键字告诉的内容是否浏览器<em>具有</em>捕捉到某一点时，无论身在何处的滚动。该 <code>proximity</code> 关键字的手段，它可以捕捉到一点，但不必。

source: You can also set the CSS Level 2 (Revision 1) values of <code>font-variant</code>, (that is, <code>normal</code> or <code>small-caps</code>), by using the <a href="font"><code>font</code></a> shorthand.
ko: <code>font-variant</code> (즉, <code>normal</code> 또는 <code>small-caps</code> ) 의 CSS Level 2 (Revision 1) 값을 <a href="font"> <code>font</code> </a> 속기 를 사용하여 설정할 수도 있습니다 .
zh_cn: 你还可以设置CSS 2级（修订版1）的值 <code>font-variant</code> ，（即， <code>normal</code> 或 <code>small-caps</code> ），通过使用<a href="font"> <code>font</code> </a>的简写。

source: You can also specify both the horizontal and vertical sizes of the image, like this:
es: También puede especificar tanto el tamaño horizontal como el vertical de la imagen,así:
ko: 다음과 같이 이미지의 가로 및 세로 크기를 모두 지정할 수도 있습니다.
zh_cn: 你也可以指定图像的水平和垂直尺寸,像这样。

source: You can also specify line names on the subgrid. This is achieved by adding a list of line names enclosed in square brackets after the <code>subgrid</code> keyword. If you have four lines in your subgrid, to name them all you could use the syntax <code>grid-template-columns: subgrid [line1] [line2] [line3] [line4]</code>
ko: 하위 표에서 줄 이름을 지정할 수도 있습니다. 이는 <code>subgrid</code> 키워드 뒤에 대괄호로 묶인 행 이름 목록을 추가하여 수행됩니다 . 하위 표에 네 줄이있는 경우 모두 이름을 지정하려면 <code>grid-template-columns: subgrid [line1] [line2] [line3] [line4]</code> 구문을 사용할 수 있습니다 . subgrid [line1] [line2] [line3] [line4]
zh_cn: 您也可以在子网格上指定行名。这是通过在 <code>subgrid</code> 关键字之后添加方括号内的行名称列表来实现的。如果您的子网格中有四行，则要全部命名，可以使用语法 <code>grid-template-columns: subgrid [line1] [line2] [line3] [line4]</code>

source: You can also target multiple devices. For instance, this <code>@media</code> rule uses two media queries to target both screen and print devices:
es: Tambi&eacute;n puede apuntar a m&uacute;ltiples dispositivos. Por ejemplo, esta regla <code>@media</code> usa dos consultas de medios para apuntar a dispositivos de pantalla e impresi&oacute;n:
ko: 여러 기기를 타겟팅 할 수도 있습니다. 예를 <code>@media</code> 규칙은 두 가지 미디어 쿼리를 사용하여 화면 및 인쇄 장치를 모두 대상으로합니다.
zh_cn: 您还可以定位多个设备。例如，此 <code>@media</code> 规则使用两个媒体查询来同时定位屏幕和打印设备：

source: You can also try changing the <code>writing-mode</code> from <code>horizontal-tb</code> to <code>vertical-rl</code>. Again, notice how the margins stay in the same place for the first box, but switch around to follow the text direction in the second.
es: Tambi&eacute;n puede intentar cambiar el <code>writing-mode</code> de escritura de <code>horizontal-tb</code> a <code>vertical-rl</code> . Nuevamente, observe c&oacute;mo los m&aacute;rgenes permanecen en el mismo lugar para el primer cuadro, pero cambie para seguir la direcci&oacute;n del texto en el segundo.
ko: <code>writing-mode</code> 를 <code>horizontal-tb</code> 에서 <code>vertical-rl</code> 로 변경할 수도 있습니다 . 다시 말하지만, 첫 번째 상자에서 여백이 같은 위치에 어떻게 유지되는지 확인하지만 두 번째 텍스트 방향을 따르도록 전환하십시오.
zh_cn: 您也可以尝试将 <code>writing-mode</code> 从 <code>horizontal-tb</code> 更改为 <code>vertical-rl</code> 。同样，请注意第一个框的边距如何保持在同一位置，但在第二个框内切换以遵循文本方向。

source: You can also try changing the <code>writing-mode</code> from <code>horizontal-tb</code> to <code>vertical-rl</code>. Again, notice how the padding stays in the same place for the first box, but switches around to follow the text direction in the second.
es: Tambi&eacute;n puede intentar cambiar el <code>writing-mode</code> de escritura de <code>horizontal-tb</code> a <code>vertical-rl</code> . Nuevamente, observe c&oacute;mo el relleno permanece en el mismo lugar para el primer cuadro, pero cambia para seguir la direcci&oacute;n del texto en el segundo.
ko: <code>writing-mode</code> 를 <code>horizontal-tb</code> 에서 <code>vertical-rl</code> 로 변경할 수도 있습니다 . 다시 말하지만, 첫 번째 상자에서 패딩이 같은 위치에 유지되지만 두 번째 텍스트 방향을 따르도록 전환됩니다.
zh_cn: 您也可以尝试将 <code>writing-mode</code> 从 <code>horizontal-tb</code> 更改为 <code>vertical-rl</code> 。再次注意，填充对于第一个框如何保持在相同的位置，但是在第二个框中却按照文本方向切换。

source: You can also use <code>calc()</code> with <a href="css_variables">CSS variables</a>. Consider the following code:
es: Tambi&eacute;n puede usar <code>calc()</code> con <a href="css_variables">variables CSS</a> . Considere el siguiente c&oacute;digo:
ko: <a href="css_variables">CSS 변수</a> 와 함께 <code>calc()</code> 를 사용할 수도 있습니다 . 다음 코드를 고려하십시오.
zh_cn: 您还可以将 <code>calc()</code> 与<a href="css_variables">CSS变量一起使用</a>。考虑以下代码：

source: You can also use <code>or</code>, if one property out of a selection could match to enable the CSS you want to use:
ko: 당신은 또한 사용할 수 있습니다 <code>or</code> 선택 중 하나 개의 속성이 사용하려는 CSS를 가능하게 일치 할 수 있다면 :
zh_cn: 如果选择中的一个属性可以匹配以启用要使用的CSS，也可以使用 <code>or</code> ，

source: You can also use multiple column layout as your legacy browser plan, as the <code>column-*</code> properties do not apply when applied to a grid container.
es: Tambi&eacute;n puede usar el dise&ntilde;o de varias columnas como su plan de navegador heredado, ya que las propiedades <code>column-*</code> no se aplican cuando se aplican a un contenedor de cuadr&iacute;cula.
ko: 그리드 컨테이너에 적용 할 때는 <code>column-*</code> 속성이 적용되지 않으므로 여러 열 레이아웃을 레거시 브라우저 계획으로 사용할 수도 있습니다 .
zh_cn: 您还可以将多列布局用作旧版浏览器计划，因为 <code>column-*</code> 属性在应用于网格容器时不适用。

source: You can also use negative values with order, which can be quite useful. If you want to make one item display first, and leave the order of all other items unchanged, you can give that item an order of <code>-1</code>. As this is lower than 0 the item will always be displayed first.
es: Tambi&eacute;n puede usar valores negativos con orden, lo que puede ser bastante &uacute;til. Si desea que primero se muestre un elemento y no se modifique el orden de todos los dem&aacute;s elementos, puede darle a ese elemento un orden de <code>-1</code> . Como es inferior a 0, el elemento siempre se mostrar&aacute; primero.
ko: 음수 값을 순서와 함께 사용할 수도있어 매우 유용 할 수 있습니다. 하나의 항목을 먼저 표시하고 다른 모든 항목의 순서를 변경하지 않으려면 해당 항목에 <code>-1</code> 의 순서를 지정할 수 있습니다 . 이 값이 0보다 작 으면 항목이 항상 먼저 표시됩니다.
zh_cn: 您还可以按顺序使用负值，这很有用。如果要首先显示一个项目，并保持所有其他项目的顺序不变，则可以将该项目的顺序设为 <code>-1</code> 。由于该值小于0，因此始终会首先显示该项目。

source: You can also use the <code>span</code> keyword here. My next item will be placed from the 7th line named <code>col-start</code> and span 3 lines.
es: Tambi&eacute;n puede usar la palabra clave <code>span</code> aqu&iacute;. Mi pr&oacute;ximo art&iacute;culo se colocar&aacute; desde la 7ma l&iacute;nea llamada <code>col-start</code> y abarcar&aacute; 3 l&iacute;neas.
ko: 여기서 <code>span</code> 키워드를 사용할 수도 있습니다 . 다음 항목은 <code>col-start</code> 라는 일곱 번째 줄에서 3 줄로 배치됩니다.
zh_cn: 您也可以在此处使用 <code>span</code> 关键字。我的下一个项目将从名为 <code>col-start</code> 的第7行开始，并跨越3行。

source: You can also use the <code>span</code> keyword in the value of <code>grid-row-start</code>/<code>grid-row-end</code> and <code>grid-column-start/grid-column-end</code>. The following two examples will create the same grid area. In the first we set the start row line, then the end line we explain that we want to span 3 lines. The area will start at line 1 and span 3 lines to line 4.
es: Tambi&eacute;n puede usar la palabra clave <code>span</code> en el valor de <code>grid-row-start</code> / <code>grid-row-end</code> y <code>grid-column-start/grid-column-end</code> . Los siguientes dos ejemplos crear&aacute;n la misma &aacute;rea de cuadr&iacute;cula. En el primero establecemos la l&iacute;nea de la fila inicial, luego en la l&iacute;nea final explicamos que queremos abarcar 3 l&iacute;neas. El &aacute;rea comenzar&aacute; en la l&iacute;nea 1 y abarcar&aacute; 3 l&iacute;neas hasta la l&iacute;nea 4.
ko: <code>grid-row-start</code> / <code>grid-row-end</code> 및 <code>grid-column-start/grid-column-end</code> 값에 <code>span</code> 키워드를 사용할 수도 있습니다 . 다음 두 예제는 동일한 그리드 영역을 만듭니다. 처음에는 시작 행 줄을 설정 한 다음 끝 줄을 세 줄로 확장한다고 설명합니다. 이 영역은 라인 1에서 시작하여 라인 3에서 라인 4까지 확장됩니다.
zh_cn: 您还可以在 <code>grid-row-start</code> / <code>grid-row-end</code> 和 <code>grid-column-start/grid-column-end</code> 的值中使用 <code>span</code> 关键字。以下两个示例将创建相同的网格区域。首先，我们设置开始行线，然后设置结束线，我们要跨越3条线。该区域将从第1行开始，跨3行到第4行。

source: You can also use the value <code>space-between</code> to take all the spare space after the items have been laid out, and share it out evenly between the items so there will be an equal amount of space between each item. To cause an equal amount of space on the right and left of each item use the value <code>space-around</code>. With <code>space-around</code>, items have a half-size space on either end. Or, to cause items to have equal space around them use the value <code>space-evenly</code>. With <code>space-evenly</code>, items have a full-size space on either end.
es: Tambi&eacute;n puede usar el valor <code>space-between</code> para tomar todo el espacio libre despu&eacute;s de que los elementos se hayan distribuido, y compartirlo de manera uniforme entre los elementos para que haya una cantidad igual de espacio entre cada elemento. Para causar la misma cantidad de espacio a la derecha y a la izquierda de cada elemento, use el valor <code>space-around</code> . Con <code>space-around</code> , los elementos tienen un espacio de tama&ntilde;o medio en cada extremo. O, para hacer que los elementos tengan el mismo espacio a su alrededor, use el <code>space-evenly</code> valor de manera uniforme . Con <code>space-evenly</code> , los art&iacute;culos tienen un espacio de tama&ntilde;o completo en cada extremo.
ko: 또한 값 사용할 수있는 <code>space-between</code> 각 항목 사이의 간격이 동일있을 수 있도록 항목이 배치 된 후 모든 여분의 공간을 차지하기를, 그리고 항목 사이에 균등을 공유 할 수 있습니다. 각 항목의 오른쪽과 왼쪽에 같은 양의 공간이 생기려면 <code>space-around</code> 값을 사용하십시오 . <code>space-around</code> 를 사용하면 항목의 양쪽 끝에 절반 크기의 공간이 있습니다. 또는 항목 주위에 동일한 공간을 두려면 <code>space-evenly</code> 값을 사용하십시오 . 으로 <code>space-evenly</code> , 항목은 양쪽 끝에서 전체 크기의 공간이있다.
zh_cn: 您还可以使用 <code>space-between</code> 的值来分配物料后的所有备用空间，并在各个物料之间平均分配，以便每个物料之间有相等的空间。要在每个项目的左右两侧留出相等的空间，请使用 <code>space-around</code> 值。使用 <code>space-around</code> 时，项目的两端都有一半大小的空间。或者，要使项目周围具有相等的空间，请 <code>space-evenly</code> 使用值space。如果使用 <code>space-evenly</code> ，则项目的两端都有全尺寸空间。

source: You can alter the alignment of the replaced element's content object within the element's box using the <a href="object-position"><code>object-position</code></a> property.
es: Puede alterar la alineaci&oacute;n del objeto de contenido del elemento reemplazado dentro del cuadro del elemento utilizando la propiedad de <a href="object-position"> <code>object-position</code> </a> del objeto .
ko: <a href="object-position"> <code>object-position</code> </a> 속성을 사용하여 요소 상자 내에서 교체 된 요소의 내용 개체 정렬을 변경할 수 있습니다 .
zh_cn: 您可以使用<a href="object-position"> <code>object-position</code> </a>属性在元素框内更改替换元素的内容对象的对齐方式。

source: You can apply <strong>multiple backgrounds</strong> to elements. These are layered atop one another with the first background you provide on top and the last background listed in the back. Only the last background can include a background color.
es: Puede aplicar <strong>m&uacute;ltiples fondos</strong> a los elementos. Estos se superponen entre s&iacute; con el primer fondo que proporcione en la parte superior y el &uacute;ltimo fondo en la parte posterior. Solo el &uacute;ltimo fondo puede incluir un color de fondo.
ko: 요소에 <strong>여러 배경</strong> 을 적용 <strong>할</strong> 수 있습니다 . 이들은 맨 위에 제공 한 첫 번째 배경과 뒷면에 나열된 마지막 배경으로 서로 겹쳐 있습니다. 마지막 배경 만 배경색을 포함 할 수 있습니다.
zh_cn: 您可以将<strong>多个背景</strong>应用于元素。这些背景相互叠放，您提供的第一个背景位于顶部，背面提供了最后一个背景。只有最后的背景可以包括背景颜色。

source: You can assign some or all of the lines in your grid a name when you define your grid with the <code>grid-template-rows</code> and <code>grid-template-columns</code> properties. To demonstrate I&rsquo;ll use the simple layout created in the guide on line-based placement. This time I&rsquo;ll create the grid using named lines.
es: Puede asignar un nombre a algunas o todas las l&iacute;neas de su cuadr&iacute;cula cuando defina su cuadr&iacute;cula con las propiedades de <code>grid-template-rows</code> y <code>grid-template-columns</code> . Para demostrarlo, usar&eacute; el dise&ntilde;o simple creado en la gu&iacute;a sobre colocaci&oacute;n basada en l&iacute;neas. Esta vez crear&eacute; la cuadr&iacute;cula usando l&iacute;neas con nombre.
ko: <code>grid-template-rows</code> 및 <code>grid-template-columns</code> 속성으로 그리드를 정의 할 때 그리드의 일부 또는 모든 선에 이름을 지정할 수 있습니다. 시연을 위해 선 기반 배치 가이드에서 만든 간단한 레이아웃을 사용하겠습니다. 이번에는 명명 된 선을 사용하여 그리드를 만듭니다.
zh_cn: 使用 <code>grid-template-rows</code> 和 <code>grid-template-columns</code> 属性定义网格时，可以为网格中的部分或全部行分配名称。为了演示，我将使用基于行的放置指南中创建的简单布局。这次，我将使用命名线创建网格。

source: You can change the gap by using any length unit as the value of <code>column-gap</code>. In the example below, the <code>column-gap</code> is set to 40px.
es: Puede cambiar el espacio usando cualquier unidad de longitud como el valor del <code>column-gap</code> . En el ejemplo a continuaci&oacute;n, el <code>column-gap</code> se establece en 40px.
ko: 길이 단위를 <code>column-gap</code> 값으로 사용하여 간격을 변경할 수 있습니다 . 아래 예에서 <code>column-gap</code> 은 40px로 설정되어 있습니다.
zh_cn: 您可以通过使用任何长度单位作为 <code>column-gap</code> 的值来更改间隙。在下面的示例中， <code>column-gap</code> 设置为40px。

source: You can check whether disabling scroll anchoring fixes the issue in Firefox by changing <code>layout.css.scroll-anchoring.enabled</code> to <code>false</code> in <code>about:config</code>.
ko: <code>about:config</code> 에서 <code>layout.css.scroll-anchoring.enabled</code> 를 <code>false</code> 로 변경하여 스크롤 고정을 비활성화하면 Firefox에서 문제가 해결되는지 확인할 수 있습니다 .
zh_cn: 您可以通过在 <code>about:config</code> 中将 <code>layout.css.scroll-anchoring.enabled</code> 更改为 <code>false</code> 来检查禁用滚动锚点是否解决了Firefox中的问题。

source: You can combine the two properties <code>flex-direction</code> and <code>flex-wrap</code> into the <a href="../flex-flow"><code>flex-flow</code></a> shorthand. The first value specified is <code>flex-direction</code> and the second value is <code>flex-wrap</code>.
es: Puede combinar las dos propiedades <code>flex-direction</code> y <code>flex-wrap</code> en la abreviatura de <a href="../flex-flow"> <code>flex-flow</code> </a> . El primer valor especificado es <code>flex-direction</code> y el segundo valor es <code>flex-wrap</code> .
ko: 당신은 두 가지 속성을 결합 할 수 있습니다 <code>flex-direction</code> 및 <code>flex-wrap</code> 로 <a href="../flex-flow"> <code>flex-flow</code> </a> 속기. 지정된 첫 번째 값은 <code>flex-direction</code> 이고 두 번째 값은 <code>flex-wrap</code> 입니다.
zh_cn: 您可以将 <code>flex-direction</code> 和 <code>flex-wrap</code> 这两个属性组合为<a href="../flex-flow"> <code>flex-flow</code> 的</a>简写形式。指定的第一个值是 <code>flex-direction</code> ，第二个值是 <code>flex-wrap</code> 。

source: You can control inheritance for all properties at once using the <a href="all"><code>all</code></a> shorthand property, which applies its value to all properties. For example:
es: Se puede controlar la herencia de todas las propiedades a la vez utilizando la <a href="all"> <code>all</code> </a> propiedad abreviada, que se aplica a su valor de todas las propiedades. Por ejemplo:
ko: <a href="all"> <code>all</code> </a> 속기 속성을 사용하여 모든 속성에 대한 상속을 한 번에 제어 할 수 있습니다.이 속성은 모든 속성에 값을 적용합니다. 예를 들면 다음과 같습니다.
zh_cn: 您可以使用<a href="all"> <code>all</code> </a>速记属性一次控制所有属性的继承，该继承将其值应用于所有属性。例如：

source: You can control the individual components of the transition with the following sub-properties:
es: Puede controlar los componentes individuales de la transición con las siguientes sub-propiedades:
ko: 다음 하위 속성을 사용하여 전환의 개별 구성 요소를 제어 할 수 있습니다.
zh_cn: 您可以使用以下子属性控制过渡的各个组件。

source: You can create a grid with fixed track sizes &ndash; using pixels for example. This sets the grid to the specified pixel which fits to the layout you desire. You can also create a grid using flexible sizes with percentages or with the new <code>fr</code> unit designed for this purpose.
es: Puede crear una cuadr&iacute;cula con tama&ntilde;os de pista fijos, utilizando p&iacute;xeles, por ejemplo. Esto establece la cuadr&iacute;cula en el p&iacute;xel especificado que se ajusta al dise&ntilde;o que desea. Tambi&eacute;n puede crear una cuadr&iacute;cula utilizando tama&ntilde;os flexibles con porcentajes o con la nueva unidad <code>fr</code> dise&ntilde;ada para este prop&oacute;sito.
ko: 픽셀을 사용하여 고정 된 트랙 크기의 격자를 만들 수 있습니다. 이것은 원하는 레이아웃에 맞는 지정된 픽셀로 그리드를 설정합니다. 또한 백분율이있는 유연한 크기 또는 이 용도로 설계된 새로운 <code>fr</code> 단위를 사용하여 격자를 만들 수도 있습니다 .
zh_cn: 您可以创建具有固定轨道尺寸的网格，例如使用像素。这会将网格设置为适合您所需布局的指定像素。您也可以使用具有百分比的灵活尺寸或为此目的设计的新 <code>fr</code> 单位来创建网格。

source: You can create some interesting effects however with just this simple technique. In my final example of this section, I have floated two elements left and right, giving each a border-radius of 100% in the direction closest to the text.
es: Sin embargo,puedes crear algunos efectos interesantes con esta simple técnica.En mi último ejemplo de esta sección,he flotado dos elementos a la izquierda y a la derecha,dando a cada uno un radio de borde del 100% en la dirección más cercana al texto.
ko: 이 간단한 기술만으로도 흥미로운 효과를 만들 수 있습니다. 이 섹션의 마지막 예에서는 왼쪽과 오른쪽에 두 개의 요소를 띄웠으며 각 텍스트에 가장 가까운 방향으로 테두리 반경을 100 %로 지정했습니다.
zh_cn: 然而,你可以用这个简单的技术创造一些有趣的效果。在本节的最后一个例子中,我将两个元素左右浮动,在最靠近文本的方向上给每个元素一个100%的边界半径。

source: You can define an explicit grid with grid layout but the specification also deals with the content added outside of a declared grid, which adds additional rows and columns when needed. Features such as adding &ldquo;as many columns that will fit into a container&rdquo; are included.
es: Puede definir una cuadr&iacute;cula expl&iacute;cita con dise&ntilde;o de cuadr&iacute;cula, pero la especificaci&oacute;n tambi&eacute;n se ocupa del contenido agregado fuera de una cuadr&iacute;cula declarada, que agrega filas y columnas adicionales cuando es necesario. Se incluyen caracter&iacute;sticas como agregar "tantas columnas que quepan en un contenedor".
ko: 그리드 레이아웃으로 명시 적 그리드를 정의 할 수 있지만 사양에서는 선언 된 그리드 외부에 추가 된 내용도 처리하므로 필요할 때 추가 행과 열이 추가됩니다. "컨테이너에 맞는 많은 열"추가와 같은 기능이 포함되어 있습니다.
zh_cn: 您可以使用网格布局定义显式网格，但是规范还处理在声明的网格外部添加的内容，并在需要时添加其他行和列。包括诸如添加&ldquo;尽可能多的列以适合容器&rdquo;的功能。

source: You can define an explicit grid with grid layout. The Grid Layout specification is flexible enough to add additional rows and columns when needed. Features such as adding &ldquo;as many columns that will fit into a container&rdquo; are included.
ko: 그리드 레이아웃으로 명시 적 그리드를 정의 할 수 있습니다. 그리드 레이아웃 사양은 필요할 때 행과 열을 추가 할 수있을만큼 유연합니다. "컨테이너에 들어갈만큼 많은 열"을 추가하는 것과 같은 기능이 포함됩니다.
zh_cn: 您可以使用网格布局定义显式网格。网格布局规范足够灵活，可以在需要时添加其他行和列。包括诸如添加&ldquo;可容纳在容器中的尽可能多的列&rdquo;之类的功能。

source: You can disable the glow using the following CSS, or completely override it to alter the appearance of invalid fields:
es: Puedes deshabilitar el brillo usando el siguiente CSS,o anularlo completamente para alterar la apariencia de los campos inválidos:
ko: 다음 CSS를 사용하여 글로우를 비활성화하거나 완전히 무시하여 유효하지 않은 필드의 모양을 변경할 수 있습니다.
zh_cn: 你可以使用下面的CSS禁用发光,或者完全覆盖它来改变无效字段的外观。
