Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/css/css.*.017.xlf
Languages: es, ko, zh_cn

source: You can see that the item is taking the area from grid row line 2 to 4, and starting after line 1. Then it is offset in that area using the top and left properties. However, it has been taken out of flow as is usually for absolutely positioned items and so the auto-placement rules now place items into the same space. The item also doesn&rsquo;t cause the additional row to be created to span to row line 3.
es: Puede ver que el elemento toma el &aacute;rea de la fila 2 a 4 de la l&iacute;nea de la cuadr&iacute;cula, y comienza despu&eacute;s de la l&iacute;nea 1. Luego se desplaza en esa &aacute;rea utilizando las propiedades superior e izquierda. Sin embargo, se ha retirado del flujo como suele ser para los art&iacute;culos posicionados absolutamente, por lo que las reglas de colocaci&oacute;n autom&aacute;tica ahora colocan los art&iacute;culos en el mismo espacio. El elemento tampoco hace que se cree la fila adicional para abarcar la l&iacute;nea de fila 3.
ko: 항목이 그리드 행 2 행에서 4 행으로 영역을 가져오고 1 행 이후부터 시작하는 것을 볼 수 있습니다. 그런 다음 상단 및 왼쪽 특성을 사용하여 해당 영역에서 오프셋됩니다. 그러나 일반적으로 위치가 지정된 항목의 경우와 같이 흐름에서 벗어 났으므로 자동 배치 규칙은 이제 항목을 동일한 공간에 배치합니다. 이 항목으로 인해 추가 행이 작성되어 행 3 행으로 확장되지는 않습니다.
zh_cn: 您可以看到该项目正在将区域从网格行2移到4，并从第1行开始。然后使用top和left属性在该区域中将其偏移。但是，它已像通常用于绝对定位的项目一样被淘汰，因此自动放置规则现在将项目放置在同一空间中。该项目也不会导致额外的行被创建到第3行。

source: You can see the background colour of the following paragraph running underneath, it is only the line boxes of that paragraph that have been shortened to cause the effect of wrapping content around the float. The box of our paragraph is still displaying according to the rules of normal flow. This is why, to make space around a floated item, you must add a margin to the item, in order to push the line boxes away from it. You cannot apply anything to the following in-flow content to achieve that.
es: Se puede ver el color de fondo del siguiente párrafo corriendo por debajo,son sólo las cajas de líneas de ese párrafo las que se han acortado para causar el efecto de envolver el contenido alrededor de la carroza.La caja de nuestro párrafo sigue mostrándose según las reglas del flujo normal.Por eso,para hacer espacio alrededor de un artículo flotante,se debe añadir un margen al artículo,para alejar las cajas de líneas de él.No se puede aplicar nada al siguiente contenido de flujo para lograr eso.
ko: 아래 단락의 배경색이 아래에서 실행되는 것을 볼 수 있습니다. 플로트 주위에 내용을 감싸는 효과를 유발하기 위해 단축 된 단락의 선 상자입니다. 우리 단락의 상자는 여전히 정상적인 흐름 규칙에 따라 표시됩니다. 따라서 플로팅 된 항목 주위에 공간을 확보하려면 항목에 여백을 추가하여 행 상자를 멀어 지도록해야합니다. 이를 달성하기 위해 다음 유입 컨텐츠에 아무것도 적용 할 수 없습니다.
zh_cn: 你可以看到下面一段的背景色在下面运行,只是该段的行框被缩短了,造成了包裹内容的浮动效果。我们段落的方框还是按照正常的流程规则来显示的。这就是为什么,要在浮动项周围留出空间,就必须给该项添加一个边距,以便将行框推离它。你不能对下面的in-flow内容应用任何东西来实现。

source: You can see the effect of <code>animation-fill-mode</code> in the following example. It demonstrates how, for an animation that runs for an infinite time, you can cause it to remain in its final state rather than reverting to the original state (which is the default).
es: Puede ver el efecto del <code>animation-fill-mode</code> de animaci&oacute;n en el siguiente ejemplo. Demuestra c&oacute;mo, para una animaci&oacute;n que se ejecuta durante un tiempo infinito, puede hacer que permanezca en su estado final en lugar de volver al estado original (que es el predeterminado).
ko: 다음 예제에서 <code>animation-fill-mode</code> 의 효과를 볼 수 있습니다 . 무한 시간 동안 실행되는 애니메이션의 경우 원래 상태 (기본값)로 되 돌리지 않고 최종 상태를 유지하는 방법을 보여줍니다.
zh_cn: 在下面的示例中，您可以看到 <code>animation-fill-mode</code> 的效果。它演示了如何对无限长的动画运行，使其动画保持其最终状态，而不是恢复为原始状态（默认状态）。

source: You can see the effect of <code>scroll-margin</code> by scrolling to a point partway between two of the "pages" of the example's content. The value specified for <code>scroll-margin</code> determines how much of the page that's primarily outside the snapport should remain visible.
ko: 예제 콘텐츠의 두 "페이지"사이의 중간 지점으로 스크롤하여 스크롤 <code>scroll-margin</code> 의 효과를 확인할 수 있습니다 . <code>scroll-margin</code> 에 지정된 값은 주로 snapport 외부에있는 페이지가 표시되어야하는 정도를 결정합니다.
zh_cn: 通过滚动到示例内容的两个&ldquo;页面&rdquo;之间的某个点，可以看到 <code>scroll-margin</code> 的效果。为 <code>scroll-margin</code> 指定的值确定主要在快照端口之外的页面中应保持可见的数量。

source: You can see the layout taking shape in the value of <a href="../grid-template-areas"><code>grid-template-areas</code></a>. The <code>header</code> spans over two column tracks, as does the <code>nav</code>. In the third row track we have the <code>sidebar</code> alongside the <code>content</code>. In the fourth row track I have chosen to place my <code>ad</code> content &ndash; so it appears under the sidebar, then the <code>footer</code> next to it under the content. I&rsquo;m using a flexbox on the navigation to display it in a row spaced out.
es: Puede ver el dise&ntilde;o tomando forma en el valor de <a href="../grid-template-areas"> <code>grid-template-areas</code> </a> de cuadr&iacute;cula . El <code>header</code> extiende sobre dos pistas de columna, al igual que la <code>nav</code> egaci&oacute;n . En la pista de la tercera fila tenemos la <code>sidebar</code> junto al <code>content</code> . En la pista de la cuarta fila, he elegido colocar el contenido de mi <code>ad</code> , por lo que aparece debajo de la barra lateral, luego el <code>footer</code> lado debajo del contenido. Estoy usando un flexbox en la navegaci&oacute;n para mostrarlo en una fila espaciada.
ko: <a href="../grid-template-areas"> <code>grid-template-areas</code> </a> 값에서 레이아웃이 모양을 취하는 것을 볼 수 있습니다 . <code>header</code> 두 칼럼에 걸쳐있는 트랙은 같은 않는 <code>nav</code> . 세 번째 행 트랙 에는 <code>content</code> 와 함께 <code>sidebar</code> 있습니다 . 네 번째 행 트랙에서 <code>ad</code> 콘텐츠 를 배치하기로 선택했습니다. 따라서 사이드 바 아래에 표시되고 그 아래에 <code>footer</code> 이 표시됩니다. 탐색에서 flexbox를 사용하여 행 간격으로 표시합니다.
zh_cn: 您可以在<a href="../grid-template-areas"> <code>grid-template-areas</code> </a>的值中看到布局正在成形。所述 <code>header</code> 在两个柱轨道跨度，一样的 <code>nav</code> 。在第三行轨道中， <code>content</code> 旁边有 <code>sidebar</code> 。在第四行的轨道中，我选择放置 <code>ad</code> 内容-使其显示在侧边栏下方，然后显示在内容下方的 <code>footer</code> 。我在导航上使用了一个flexbox，以隔开的行显示它。

source: You can see the named lines in the image, note that some lines have two names - for example <code>sd-end</code> and <code>main-start</code> refer to the same column line.
es: Puede ver las l&iacute;neas con nombre en la imagen, tenga en cuenta que algunas l&iacute;neas tienen dos nombres; por ejemplo, <code>sd-end</code> y <code>main-start</code> se refieren a la misma l&iacute;nea de columna.
ko: 이미지에서 이름이 지정된 줄을 볼 수 있습니다. 일부 줄에는 두 개의 이름이 있습니다. 예를 들어 <code>sd-end</code> 와 <code>main-start</code> 는 동일한 열 줄을 나타냅니다.
zh_cn: 您可以在图像中看到已命名的行，请注意，有些行具有两个名称-例如 <code>sd-end</code> 和 <code>main-start</code> 引用同一列行。

source: You can see the same example as used for <a href="../align-items"><code>align-items</code></a>, below. This time we are applying the <a href="../justify-self"><code>justify-self</code></a> property.
es: Puede ver el mismo ejemplo que se usa para <a href="../align-items"> <code>align-items</code> </a> , a continuaci&oacute;n. Esta vez estamos aplicando la propiedad <a href="../justify-self"> <code>justify-self</code> </a> .
ko: 아래의 <a href="../align-items"> <code>align-items</code> 에</a> 사용 된 것과 동일한 예제를 볼 수 있습니다 . 이번에는 <a href="../justify-self"> <code>justify-self</code> </a> 속성을 적용합니다 .
zh_cn: 您可以在下面看到与<a href="../align-items"> <code>align-items</code> </a>相同的示例。这次，我们将应用<a href="../justify-self"> <code>justify-self</code> </a>属性。

source: You can see the threshold in action if we use a gradient as the image on which to define our shape. In the example below, if you change the threshold the path that the shape takes changes based on the level of opacity you have selected.
es: Se puede ver el umbral en acción si usamos un gradiente como la imagen en la que se define nuestra forma.En el siguiente ejemplo,si cambiamos el umbral,el camino que toma la forma cambia según el nivel de opacidad que hayamos seleccionado.
ko: 모양을 정의 할 이미지로 그라디언트를 사용하면 임계 값이 작동하는 것을 볼 수 있습니다. 아래 예에서 임계 값을 변경하면 선택한 불투명도 수준에 따라 모양이 취하는 경로가 변경됩니다.
zh_cn: 如果我们使用梯度作为图像来定义我们的形状,你可以看到阈值的作用。在下面的例子中,如果你改变了阈值,形状所走的路径就会根据你选择的不透明度水平而改变。

source: You can see this <code>min-content</code> flooring happen in the below example, where the <code>flex-basis</code> is resolving to the size of the content. If you change the width on the flex container &mdash; increasing it to 700px for example &mdash; and then reduce the flex item width, you can see that the first two items will wrap, however they will never become smaller than that <code>min-content</code> size. As the box gets smaller space is then just removed from the third item.
es: Puede ver que este piso de <code>min-content</code> ocurre en el ejemplo a continuaci&oacute;n, donde la <code>flex-basis</code> est&aacute; resolviendo al tama&ntilde;o del contenido. Si cambia el ancho del contenedor flexible (aument&aacute;ndolo a 700 px por ejemplo) y luego reduce el ancho del elemento flexible, puede ver que los dos primeros elementos se ajustar&aacute;n, sin embargo, nunca ser&aacute;n m&aacute;s peque&ntilde;os que ese tama&ntilde;o de <code>min-content</code> . A medida que el cuadro se hace m&aacute;s peque&ntilde;o, el espacio se elimina del tercer elemento.
ko: <code>flex-basis</code> 가 컨텐츠의 크기로 해석 되는 아래 예 에서이 <code>min-content</code> 바닥이 발생하는 것을 볼 수 있습니다 . 플렉스 컨테이너의 너비를 변경하여 (예를 들어 700px로 늘린 후) 플렉스 항목 너비를 줄이면 처음 두 항목이 줄 바꿈되는 것을 볼 수 있지만 해당 <code>min-content</code> 크기 보다 작지는 않습니다 . 상자가 작아지면 세 번째 항목에서 제거됩니다.
zh_cn: 您可以在下面的示例中看到 <code>min-content</code> 情况，其中 <code>flex-basis</code> 解析为内容的大小。如果您更改flex容器的宽度（例如，将其增加到700px），然后减小flex项的宽度，则可以看到前两个项将自动换行，但是它们永远不会小于 <code>min-content</code> 大小。随着盒子变小，然后从第三项中删除。

source: You can see this in the example below. The parent grid has a gap of 20px for rows and columns. The subgrid has <code>row-gap</code> set to <code>0</code>.
ko: 아래 예에서이를 확인할 수 있습니다. 상위 그리드에는 행과 열에 대해 20px의 간격이 있습니다. 하위 표에는 <code>0</code> 으로 설정된 <code>row-gap</code> 있습니다.
zh_cn: 您可以在下面的示例中看到这一点。父网格的行和列间距为20px。子网格的 <code>row-gap</code> 设置为 <code>0</code> 。

source: You can specify a different <code>&lt;repeat-style&gt;</code> for each mask image, separated by commas:
es: Puede especificar un <code>&lt;repeat-style&gt;</code> para cada imagen de m&aacute;scara, separado por comas:
ko: 각 마스크 이미지마다 다른 <code>&lt;repeat-style&gt;</code> 을 쉼표로 구분하여 지정할 수 있습니다 .
zh_cn: 您可以为每个蒙版图像指定一个不同的 <code>&lt;repeat-style&gt;</code> ，以逗号分隔：

source: You can style visited links, but there are limits to which styles you can use. Only the following styles can be applied to visited links:
es: Puedes dar estilo a los enlaces visitados,pero hay límites en cuanto a los estilos que puedes usar.Sólo se pueden aplicar los siguientes estilos a los enlaces visitados:
ko: 방문한 링크의 스타일을 지정할 수 있지만 사용할 수있는 스타일에는 제한이 있습니다. 방문한 링크에는 다음 스타일 만 적용 할 수 있습니다.
zh_cn: 你可以对访问过的链接进行样式设计,但对你可以使用的样式有限制。只有以下几种样式可以应用于访问过的链接。

source: You can switch them to display in the block direction for the language of your document by selecting <code>flex-direction: column</code>. Then <code>flex-start</code> will then be where the top of your first paragraph of text would start.
es: Puede cambiarlos para que se muestren en la direcci&oacute;n del bloque para el idioma de su documento seleccionando <code>flex-direction: column</code> . Luego <code>flex-start</code> ser&aacute; donde comenzar&aacute; la parte superior de su primer p&aacute;rrafo de texto.
ko: <code>flex-direction: column</code> 을 선택하여 문서 언어의 블록 방향으로 표시되도록 전환 할 수 있습니다 . 그런 다음 <code>flex-start</code> 는 텍스트의 첫 단락 상단이 시작되는 위치입니다.
zh_cn: 通过选择 <code>flex-direction: column</code> 可以将它们切换为在文档语言的阻止方向上显示。然后， <code>flex-start</code> 将是您第一段文本的开头的位置。

source: You can take a look at the code of this example below. Change the size of the container or nested element and the nested element always remains centered.
es: Puedes echar un vistazo al código de este ejemplo a continuación.Cambie el tamaño del contenedor o elemento anidado y el elemento anidado siempre permanece centrado.
ko: 아래 예제 코드를 살펴볼 수 있습니다. 컨테이너 또는 중첩 요소의 크기를 변경하면 중첩 요소는 항상 중앙에 유지됩니다.
zh_cn: 你可以看看下面这个例子的代码。改变容器或嵌套元素的大小,嵌套元素始终保持居中。

source: You can test for support of logical properties and values using feature queries. For example you could set a <a href="../width"><code>width</code></a>, test for <a href="../inline-size"><code>inline-size</code></a> and, if it is supported, set the <code>width</code> to <code>auto</code> and the <code>inline-size</code> to the original <code>width</code> value.
es: Puede probar el soporte de propiedades l&oacute;gicas y valores mediante consultas de caracter&iacute;sticas. Por ejemplo, puede establecer un <a href="../width"> <code>width</code> </a> , probar el <a href="../inline-size"> <code>inline-size</code> </a> en l&iacute;nea y, si es compatible, establecer el <code>width</code> en <code>auto</code> m&aacute;tico y el <code>inline-size</code> en l&iacute;nea en el valor de <code>width</code> original .
ko: 기능 쿼리를 사용하여 논리적 속성 및 값 지원을 테스트 할 수 있습니다. 예를 들어 <a href="../width"> <code>width</code> 를</a> 설정하고 <a href="../inline-size"> <code>inline-size</code> </a> 테스트하고 지원되는 경우 <code>width</code> 를 <code>auto</code> 로 설정 하고 <code>inline-size</code> 를 원래 <code>width</code> 값으로 설정할 수 있습니다.
zh_cn: 您可以使用功能查询测试对逻辑属性和值的支持。例如，您可以设置<a href="../width"> <code>width</code> </a>，测试<a href="../inline-size"> <code>inline-size</code> </a>，如果支持，则将 <code>width</code> 设置为 <code>auto</code> ，将 <code>inline-size</code> 设置为原始 <code>width</code> 值。

source: You can test the fallback behaviour by removing <code>display: flex</code> from the wrapper.
es: Puede probar el comportamiento alternativo eliminando <code>display: flex</code> del contenedor.
ko: 랩퍼에서 <code>display: flex</code> 를 제거하여 폴백 동작을 테스트 할 수 있습니다 .
zh_cn: 您可以通过从包装器中删除 <code>display: flex</code> 来测试后备行为。

source: You can therefore change this in order that your shape uses the different parts of the box model, for example to use the border.
es: Por lo tanto,puede cambiar esto para que su forma utilice las diferentes partes del modelo de la caja,por ejemplo para utilizar el borde.
ko: 따라서 모양이 상자 모델의 다른 부분 (예 : 테두리 사용)을 사용하도록이를 변경할 수 있습니다.
zh_cn: 因此,您可以改变这一点,以便您的形状使用盒子模型的不同部分,例如使用边界。

source: You can try it below:
ko: 아래에서 시도해 볼 수 있습니다.
zh_cn: 你可以在下面试试。

source: You can try this out in the example below, which has a flex container with <code>flex-direction: column</code> yet otherwise is exactly the same as the previous example.
es: Puede probar esto en el ejemplo a continuaci&oacute;n, que tiene un contenedor <code>flex-direction: column</code> pero de lo contrario es exactamente el mismo que el ejemplo anterior.
ko: <code>flex-direction: column</code> 이있는 flex 컨테이너가 있지만 아래의 예제 에서이 작업을 시도 할 수 있지만 그렇지 않으면 이전 예제와 정확히 동일합니다.
zh_cn: 您可以在下面的示例中尝试该示例，该示例具有一个带有 <code>flex-direction: column</code> 的flex容器，但与前面的示例完全相同。

source: You can try this out in the live example below. Change <code>writing-mode</code> from <code>vertical-rl</code> to <code>horizontal-tb</code> on <code>.box</code> to see how the different properties change the layout.
es: Puedes probar esto en el ejemplo en vivo a continuaci&oacute;n. Cambie <code>writing-mode</code> de escritura de <code>vertical-rl</code> a <code>horizontal-tb</code> en <code>.box</code> para ver c&oacute;mo las diferentes propiedades cambian el dise&ntilde;o.
ko: 아래 라이브 예제에서 시도해 볼 수 있습니다. 변경 <code>writing-mode</code> 에서 <code>vertical-rl</code> 에 <code>horizontal-tb</code> 에 <code>.box</code> 는 서로 다른 속성이 레이아웃을 변경하는 방법을 볼 수 있습니다.
zh_cn: 您可以在下面的实时示例中进行尝试。 <code>writing-mode</code> <code>.box</code> 上的Writing -mode从 <code>vertical-rl</code> 更改为 <code>horizontal-tb</code> ，以查看不同属性如何更改布局。

source: You can try this out in the live example below. Change <code>writing-mode</code> from <code>vertical-rl</code> to <code>horizontal-tb</code> on <code>.grid</code> to see how the different properties change the layout.
ko: 아래 라이브 예제에서 이것을 시도해 볼 수 있습니다. 변경 <code>writing-mode</code> 에서 <code>vertical-rl</code> 에 <code>horizontal-tb</code> 에 <code>.grid</code> 는 서로 다른 속성이 레이아웃을 변경하는 방법을 볼 수 있습니다.
zh_cn: 您可以在下面的实时示例中进行尝试。 <code>writing-mode</code> <code>.grid</code> 上的Writing -mode从 <code>vertical-rl</code> 更改为 <code>horizontal-tb</code> ，以查看不同的属性如何更改布局。

source: You can use <a href="../@supports">feature queries</a> to detect flexbox support:
es: Puede usar <a href="../@supports">consultas de funciones</a> para detectar la compatibilidad con flexbox:
ko: <a href="../@supports">기능 쿼리</a> 를 사용하여 flexbox 지원을 감지 할 수 있습니다 .
zh_cn: 您可以使用<a href="../@supports">功能查询</a>来检测flexbox支持：

source: You can use <a href="../color_value#System_Colors">system color keywords</a> with any property <em>other</em> than those listed above, to ensure that the rest of the page integrates with the restricted color palette available in forced colors mode.
ko: 위에 나열된 속성 <em>이외의</em> 속성과 함께 <a href="../color_value#System_Colors">시스템 색상 키워드</a> 를 사용 하여 페이지의 나머지 부분이 강제 색상 모드에서 사용 가능한 제한된 색상 팔레트와 통합되도록 할 수 있습니다.<em></em>
zh_cn: 您可以使用<a href="../color_value#System_Colors">系统颜色的关键字</a>与任何财产<em>其它</em>上面列出的那些，以确保页面整合了与强制的色彩模式中提供的有限的调色板休息。

source: You can use <a href="https://developer.mozilla.org/en-US/docs/Web/CSS/minmax"><code>minmax()</code></a> in your value for <a href="../grid-auto-rows"><code>grid-auto-rows</code></a> enabling the creation of rows that are a minimum size but then grow to fit content if it is taller.
es: Puede usar <a href="https://developer.mozilla.org/en-US/docs/Web/CSS/minmax"> <code>minmax()</code> </a> en su valor para <a href="../grid-auto-rows"> <code>grid-auto-rows</code> </a> permite la creaci&oacute;n de filas que son de un tama&ntilde;o m&iacute;nimo pero luego crecen para ajustarse al contenido si es m&aacute;s alto.
ko: <a href="../grid-auto-rows"> <code>grid-auto-rows</code> </a> 값에 <a href="https://developer.mozilla.org/en-US/docs/Web/CSS/minmax"> <code>minmax()</code> </a> 를 사용 하면 최소 크기이지만 행이 더 커지면 내용에 맞게 늘어날 수 있습니다.
zh_cn: 您可以在<a href="../grid-auto-rows"> <code>grid-auto-rows</code> </a>值中使用<a href="https://developer.mozilla.org/en-US/docs/Web/CSS/minmax"> <code>minmax()</code> </a>，以创建最小尺寸的行，但是如果行更高，则可以增长以适合内容。

source: You can use <code>font-stretch</code> to select a condensed or expanded face from such fonts. If the font you are using does not offer condensed or expanded faces, this property has no effect.
es: Puede usar <code>font-stretch</code> para seleccionar una cara condensada o expandida de dichas fuentes. Si la fuente que est&aacute; utilizando no ofrece caras condensadas o expandidas, esta propiedad no tiene efecto.
ko: <code>font-stretch</code> 를 사용하여 해당 글꼴 에서 압축되거나 확대 된 얼굴을 선택할 수 있습니다 . 사용중인 글꼴이 압축되거나 확장 된면을 제공하지 않으면이 속성이 적용되지 않습니다.
zh_cn: 您可以使用 <code>font-stretch</code> 从此类字体中选择压缩或扩展的面孔。如果您使用的字体不提供缩略或扩展的字体，则此属性无效。

source: You can use <code>or</code> to test for a match among more than one feature, resolving to <code>true</code> if any of the features are true. For example, the following query tests for devices that have a monochrome display or hover capability:
es: Puede usar <code>or</code> para probar una coincidencia entre m&aacute;s de una caracter&iacute;stica, resolviendo a <code>true</code> si alguna de las caracter&iacute;sticas es verdadera. Por ejemplo, la siguiente consulta prueba los dispositivos que tienen una pantalla monocrom&aacute;tica o capacidad de desplazamiento:
ko: 당신은 사용할 수 있습니다 <code>or</code> 를 해결하는 하나 개 이상의 기능 중 일치하는 시험에 <code>true</code> 특징 중 하나에 해당하면. 예를 들어 다음 쿼리는 단색 디스플레이 또는 호버 기능이있는 장치를 테스트합니다.
zh_cn: 您可以使用 <code>or</code> 在多于一个功能测试匹配，解决到 <code>true</code> 如有的特点是真实的。例如，以下查询测试具有单色显示或悬停功能的设备：

source: You can use a comma-separated list to apply styles when the user's device matches any one of various media types, features, or states. For instance, the following rule will apply its styles if the user's device has either a minimum height of 680px <em>or</em> is a screen device in portrait mode:
es: Puede usar una lista separada por comas para aplicar estilos cuando el dispositivo del usuario coincida con cualquiera de los diversos tipos, caracter&iacute;sticas o estados de medios. Por ejemplo, la siguiente regla aplicar&aacute; sus estilos si el dispositivo del usuario tiene una altura m&iacute;nima de 680 px <em>o</em> es un dispositivo de pantalla en modo vertical:
ko: 쉼표로 구분 된 목록을 사용하여 사용자의 장치가 다양한 미디어 유형, 기능 또는 상태 중 하나와 일치 할 때 스타일을 적용 할 수 있습니다. 예를 들어 다음 규칙은 사용자 기기의 최소 높이가 680px <em>이거나</em> 세로 모드의 스크린 기기 인 경우 스타일을 적용 합니다.
zh_cn: 当用户的设备与各种媒体类型，功能或状态中的任何一种匹配时，可以使用逗号分隔的列表来应用样式。例如，如果用户设备的最低高度为680px <em>或</em>为纵向模式的屏幕设备，则以下规则将应用其样式：

source: You can use different units for each value in your expression, if you wish. You may also use parentheses to establish computation order when needed.
ko: 원하는 경우 표현식의 각 값에 대해 다른 단위를 사용할 수 있습니다. 필요할 때 계산 순서를 설정하기 위해 괄호를 사용할 수도 있습니다.
zh_cn: 如果你愿意,你可以对表达式中的每个值使用不同的单位。必要时,你也可以使用括号来确定计算顺序。

source: You can use different units for each value in your expression. You may also use parentheses to establish computation order when needed.
es: Puedes usar diferentes unidades para cada valor de tu expresión.También puedes usar paréntesis para establecer el orden de cálculo cuando sea necesario.
ko: 식의 각 값마다 다른 단위를 사용할 수 있습니다. 필요할 때 괄호를 사용하여 계산 순서를 설정할 수도 있습니다.
zh_cn: 你可以对表达式中的每个值使用不同的单位。在需要时,你也可以使用括号来确定计算顺序。

source: You can use different units for each value in your expressions, and different units in any math function making up any of the arguments.
es: Puedes usar diferentes unidades para cada valor en tus expresiones,y diferentes unidades en cualquier función matemática que componga cualquiera de los argumentos.
ko: 식의 각 값마다 다른 단위를 사용할 수 있으며, 인수를 구성하는 모든 수학 함수의 다른 단위를 사용할 수 있습니다.
zh_cn: 你可以在表达式中对每个值使用不同的单位,在任何数学函数中对任何参数使用不同的单位。

source: You can use only one pseudo-element in a selector. It must appear after the simple selectors in the statement.
es: Sólo puedes usar un pseudo-elemento en un selector.Debe aparecer después de los selectores simples en la declaración.
ko: 선택기에는 하나의 유사 요소 만 사용할 수 있습니다. 명령문에서 단순 선택기 뒤에 표시되어야합니다.
zh_cn: 你只能在一个选择器中使用一个伪元素。它必须出现在语句中的简单选择符之后。

source: You can use placement properties while still taking advantage of auto-placement. In this next example I have added to the layout by setting odd items to span two tracks both for rows and columns. I do this with the <a href="../grid-column-end"><code>grid-column-end</code></a> and <a href="../grid-row-end"><code>grid-row-end</code></a> properties and setting the value of this to <code>span 2</code>. What this means is that the start line of the item will be set by auto-placement, and the end line will span two tracks.
es: Puede usar las propiedades de ubicaci&oacute;n sin dejar de aprovechar la ubicaci&oacute;n autom&aacute;tica. En el siguiente ejemplo, he agregado al dise&ntilde;o configurando elementos impares para abarcar dos pistas, tanto para filas como para columnas. Hago esto con las propiedades <a href="../grid-column-end"> <code>grid-column-end</code> </a> y <a href="../grid-row-end"> <code>grid-row-end</code> </a> y establezco el valor de esto para <code>span 2</code> . Lo que esto significa es que la l&iacute;nea de inicio del art&iacute;culo se establecer&aacute; mediante la colocaci&oacute;n autom&aacute;tica, y la l&iacute;nea final abarcar&aacute; dos pistas.
ko: 자동 게재 위치를 계속 활용하면서 게재 위치 속성을 사용할 수 있습니다. 이 다음 예제에서는 홀수 항목을 설정하여 행과 열 모두에 대해 두 트랙에 걸쳐 있도록 레이아웃에 추가했습니다. I는 함께 이렇게 <a href="../grid-column-end"> <code>grid-column-end</code> </a> 와 <a href="../grid-row-end"> <code>grid-row-end</code> </a> 속성과이 값을 설정 <code>span 2</code> . 이것은 항목의 시작 줄이 자동 배치에 의해 설정되고 끝 줄이 두 트랙에 걸쳐 있음을 의미합니다.
zh_cn: 您可以在仍然利用自动放置功能的同时使用放置属性。在下一个示例中，我通过设置奇数项以跨越行和列的两个轨道来添加布局。我使用<a href="../grid-column-end"> <code>grid-column-end</code> </a>和<a href="../grid-row-end"> <code>grid-row-end</code> </a>属性，并将其值设置为 <code>span 2</code> 。这意味着该项目的起始行将通过自动放置来设置，而结束行将跨越两条轨道。
