Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/css/css.*.017.xlf
Languages: es, ko, zh_cn

source: When rendering text, the list of OpenType feature tag value is passed to the text layout engine to enable or disable font features. The tag is always a <a href="string"><code>&lt;string&gt;</code></a> of 4 ASCII characters. If it has more or less characters or contains characters outside the U+20 - U+7E codepoint range, the whole property is invalid.
es: Al representar texto, la lista del valor de la etiqueta de funci&oacute;n OpenType se pasa al motor de dise&ntilde;o de texto para habilitar o deshabilitar las funciones de fuente. La etiqueta siempre es una <a href="string"> <code>&lt;string&gt;</code> </a> de 4 caracteres ASCII. Si tiene m&aacute;s o menos caracteres o contiene caracteres fuera del rango de puntos de c&oacute;digo U + 20 - U + 7E, toda la propiedad no es v&aacute;lida.
ko: 텍스트를 렌더링 할 때 OpenType 기능 태그 값 목록이 텍스트 레이아웃 엔진에 전달되어 글꼴 기능을 활성화 또는 비활성화합니다. 태그는 항상 4 개의 ASCII 문자로 구성된 <a href="string"> <code>&lt;string&gt;</code> </a> 입니다. U + 20-U + 7E 코드 포인트 범위를 벗어나는 문자를 포함하거나 문자를 포함하는 경우 전체 특성이 유효하지 않습니다.
zh_cn: 呈现文本时，OpenType功能标签值的列表将传递到文本布局引擎以启用或禁用字体功能。标记始终是4个ASCII字符的<a href="string"> <code>&lt;string&gt;</code> </a>。如果它具有或多或少的字符或包含U + 20-U + 7E代码点范围之外的字符，则整个属性无效。

source: When rendering text, the list of OpenType feature tag value is passed to the text layout engine to enable or disable font features. The tag is always a <a href="string"><code>&lt;string&gt;</code></a> of 4 ASCII characters. If it has more or less characters, or if it contains characters outside the <code>U+20</code> &ndash; <code>U+7E</code> codepoint range, the whole property is invalid.
ko: 텍스트를 렌더링 할 때 OpenType 기능 태그 값 목록이 텍스트 레이아웃 엔진에 전달되어 글꼴 기능을 활성화하거나 비활성화합니다. 태그는 항상 4 ASCII 문자의 <a href="string"> <code>&lt;string&gt;</code> </a> 입니다. 문자가 더 많거나 적거나 <code>U+20</code> &ndash; <code>U+7E</code> 코드 포인트 범위를 벗어난 문자가 포함 된 경우 전체 속성이 유효하지 않습니다.
zh_cn: 呈现文本时，OpenType功能标签值的列表将传递到文本布局引擎以启用或禁用字体功能。标记始终是4个ASCII字符的<a href="string"> <code>&lt;string&gt;</code> </a>。如果它包含更多或更少的字符，或者包含 <code>U+20</code> &ndash; <code>U+7E</code> 代码点范围之外的字符，则整个属性无效。

source: When rendering text, the list of variable font axis names is passed to the text layout engine to enable or disable font features. Each setting is always one or more pairs comprised of a <a href="string"><code>&lt;string&gt;</code></a> of 4 ASCII characters followed by a <a href="number"><code>&lt;number&gt;</code></a> indicating the axis value to set. If the <code>&lt;string&gt;</code> has more or fewer characters or contains characters outside the U+20 - U+7E codepoint range, the whole property is invalid. The <code>&lt;number&gt;</code> can be fractional or negative, depending on the value range available in your font, as defined by the font designer.
es: Al representar texto, la lista de nombres de eje de fuente variable se pasa al motor de dise&ntilde;o de texto para habilitar o deshabilitar las caracter&iacute;sticas de fuente. Cada configuraci&oacute;n es siempre uno o m&aacute;s pares compuestos por una <a href="string"> <code>&lt;string&gt;</code> </a> de 4 caracteres ASCII seguidos de un <a href="number"> <code>&lt;number&gt;</code> </a> indica el valor del eje a configurar. Si la <code>&lt;string&gt;</code> tiene m&aacute;s o menos caracteres o contiene caracteres fuera del rango de puntos de c&oacute;digo U + 20 - U + 7E, toda la propiedad no es v&aacute;lida. El <code>&lt;number&gt;</code> puede ser fraccionario o negativo, dependiendo del rango de valores disponible en su fuente, seg&uacute;n lo definido por el dise&ntilde;ador de fuentes.
ko: 텍스트를 렌더링 할 때 가변 글꼴 축 이름 목록이 텍스트 레이아웃 엔진으로 전달되어 글꼴 기능을 활성화 또는 비활성화합니다. 각 설정은 항상 4 개의 ASCII 문자 로 구성된 <a href="string"> <code>&lt;string&gt;</code> </a> 과 설정 될 축 값을 나타내는 <a href="number"> <code>&lt;number&gt;</code> 로</a> 구성되는 하나 이상의 쌍 입니다. 는 IF <code>&lt;string&gt;</code> 많거나 적은 문자가 또는 U + (20) 이외의 문자가 포함 - U + 7E 코드 포인트 범위, 전체 재산이 잘못되었습니다. <code>&lt;number&gt;</code> 폰트 설계자에 의해 정의 된 폰트의 가능한 값의 범위에 따라 부분 또는 음수 일 수있다.
zh_cn: 呈现文本时，可变字体轴名称的列表将传递到文本布局引擎，以启用或禁用字体功能。每个设置始终是一对或多对，由4个ASCII字符的<a href="string"> <code>&lt;string&gt;</code> </a>和后面的<a href="number"> <code>&lt;number&gt;</code> 组成,</a>表示要设置的轴值。如果 <code>&lt;string&gt;</code> 具有更多或更少的字符或包含U + 20-U + 7E代码点范围之外的字符，则整个属性无效。所述 <code>&lt;number&gt;</code> 可以是分数或负，这取决于在字体中可用的值的范围，由字体设计所限定。

source: When rendering text, the list of variable font axis names is passed to the text layout engine to enable or disable font features. Each setting is always one or more pairs consisting of a <a href="string"><code>&lt;string&gt;</code></a> of 4 ASCII characters followed by a <a href="number"><code>&lt;number&gt;</code></a> indicating the axis value to set. If the <code>&lt;string&gt;</code> has more or fewer characters or contains characters outside the U+20 - U+7E codepoint range, the whole property is invalid. The <code>&lt;number&gt;</code> can be fractional or negative, depending on the value range available in your font, as defined by the font designer.
ko: 텍스트를 렌더링 할 때 가변 글꼴 축 이름 목록이 텍스트 레이아웃 엔진에 전달되어 글꼴 기능을 활성화하거나 비활성화합니다. 각 설정은 항상 4 개의 ASCII 문자 로 구성된 <a href="string"> <code>&lt;string&gt;</code> </a> 과 설정할 축 값을 나타내는 <a href="number"> <code>&lt;number&gt;</code> </a> 로 구성된 하나 이상의 쌍 입니다. 는 IF <code>&lt;string&gt;</code> 많거나 적은 문자가 또는 U + (20) 이외의 문자가 포함 - U + 7E 코드 포인트 범위, 전체 재산이 잘못되었습니다. <code>&lt;number&gt;</code> 폰트 설계자에 의해 정의 된 폰트의 가능한 값의 범위에 따라 부분 또는 음수 일 수있다.
zh_cn: 呈现文本时，可变字体轴名称的列表将传递到文本布局引擎，以启用或禁用字体功能。每个设置始终是一对或多对，由4个ASCII字符的<a href="string"> <code>&lt;string&gt;</code> </a>和后面的<a href="number"> <code>&lt;number&gt;</code> 组成,</a>表示要设置的轴值。如果 <code>&lt;string&gt;</code> 具有更多或更少的字符或包含U + 20-U + 7E代码点范围之外的字符，则整个属性无效。所述 <code>&lt;number&gt;</code> 可以是分数或负，这取决于在字体中可用的值的范围，由字体设计所限定。

source: When scaling the image up, the nearest-neighbor algorithm must be used, so that the image appears to be composed of large pixels. When scaling down, this is the same as <code>auto</code>.
es: Al escalar la imagen, se debe usar el algoritmo de vecino m&aacute;s cercano, para que la imagen parezca estar compuesta de p&iacute;xeles grandes. Al reducir, esto es lo mismo que <code>auto</code> .
ko: 이미지를 확대 할 때 가장 가까운 이웃 알고리즘을 사용해야 이미지가 큰 픽셀로 구성됩니다. 축소 할 때 <code>auto</code> 와 동일합니다 .
zh_cn: 在放大图像时，必须使用最近邻居算法，以便图像看起来由大像素组成。缩小时，这与 <code>auto</code> 相同。

source: When setting multiple line-decoration properties at once, it may be more convenient to use the <a href="text-decoration"><code>text-decoration</code></a> shorthand property instead.
es: Al establecer varias propiedades de decoraci&oacute;n de l&iacute;nea a la vez, puede ser m&aacute;s conveniente utilizar la propiedad de taquigraf&iacute;a de <a href="text-decoration"> <code>text-decoration</code> </a> .
ko: 한 번에 여러 줄 장식 속성을 설정하는 경우 <a href="text-decoration"> <code>text-decoration</code> </a> 속기 속성을 대신 사용하는 것이 더 편리 할 수 ​​있습니다 .
zh_cn: 一次设置多个行装饰属性时，改用<a href="text-decoration"> <code>text-decoration</code> </a>速记属性可能更方便。

source: When setting up an explicit grid or defining the sizing for automatically created rows or columns we may want to give tracks a minimum size, but also ensure they expand to fit any content that is added. For example, I may want my rows to never collapse smaller than 100 pixels, but if my content stretches to 300 pixels in height, then I would like the row to stretch to that height.
es: Al establecer una cuadrícula explícita o definir el tamaño de las filas o columnas creadas automáticamente,es posible que queramos dar a las pistas un tamaño mínimo,pero también asegurarnos de que se amplíen para que se ajusten a cualquier contenido que se añada.Por ejemplo,puede que quiera que mis filas nunca se colapsen por debajo de los 100 píxeles,pero si mi contenido se extiende hasta los 300 píxeles de altura,entonces me gustaría que la fila se estirara hasta esa altura.
ko: 명시 적 그리드를 설정하거나 자동으로 생성 된 행 또는 열의 크기를 정의 할 때 트랙에 최소 크기를 부여하고 추가 된 내용에 맞게 확장되도록해야합니다. 예를 들어 행을 100 픽셀보다 작게 축소하지 않으려는 경우 내용의 높이가 300 픽셀로 늘어 나면 행을 해당 높이로 늘리기를 원합니다.
zh_cn: 在设置显式网格或定义自动创建的行或列的大小时,我们可能希望给轨迹一个最小的尺寸,但同时也要确保它们能扩展以适应任何添加的内容。例如,我可能希望我的行永远不会缩小到小于100像素,但如果我的内容延伸到300像素的高度,那么我希望行能延伸到这个高度。

source: When several keyframes are appropriate, it chooses the latest defined in the most important document, but never combined all together.
es: Cuando varios fotogramas clave son apropiados,elige el último definido en el documento más importante,pero nunca combinado todo junto.
ko: 여러 키 프레임이 적절한 경우 가장 중요한 문서에 정의 된 최신 항목을 선택하지만 모두 함께 결합하지는 않습니다.
zh_cn: 当几个关键帧合适时,它会选择最重要的文档中最新定义的关键帧,但绝不会把所有的关键帧组合在一起。

source: When specifying the location of a pixel in a graphics context (just like when specifying coordinate systems in <a href="https://en.wikipedia.org/wiki/algebra">algebra</a>), its position is defined relative to a fixed point in the context. This fixed point is called the <a href="https://en.wikipedia.org/wiki/Origin_(mathematics)">origin</a>. The position is specified as the number of pixels offset from the origin along each dimension of the context.
es: Al especificar la ubicaci&oacute;n de un p&iacute;xel en un contexto gr&aacute;fico (al igual que al especificar sistemas de coordenadas en <a href="https://en.wikipedia.org/wiki/algebra">&aacute;lgebra</a> ), su posici&oacute;n se define en relaci&oacute;n con un punto fijo en el contexto. Este punto fijo se llama <a href="https://en.wikipedia.org/wiki/Origin_(mathematics)">origen</a> . La posici&oacute;n se especifica como el n&uacute;mero de p&iacute;xeles desplazados desde el origen a lo largo de cada dimensi&oacute;n del contexto.
ko: <a href="https://en.wikipedia.org/wiki/algebra">대수로</a> 좌표계를 지정할 때와 같이 그래픽 컨텍스트에서 픽셀의 위치를 ​​지정할 때 해당 위치는 컨텍스트의 고정 점을 기준으로 정의됩니다. 이 고정 점을 <a href="https://en.wikipedia.org/wiki/Origin_(mathematics)">원점</a> 이라고합니다 . 위치는 컨텍스트의 각 차원을 따라 원점에서 오프셋 된 픽셀 수로 지정됩니다.
zh_cn: 当指定像素在图形上下文中的位置时（就像在<a href="https://en.wikipedia.org/wiki/algebra">代数中</a>指定坐标系时一样），其位置是相对于上下文中的固定点定义的。这个固定点称为<a href="https://en.wikipedia.org/wiki/Origin_(mathematics)">原点</a>。位置指定为沿上下文的每个维度从原点偏移的像素数。

source: When specifying the size of an item, the <a href="https://drafts.csswg.org/css-logical/">Logical Properties and Values</a> specification gives you the ability to indicate sizing as it relates to the flow of text (inline and block) rather than physical sizing which relates to the physical dimensions of horizontal and vertical (e.g. left and right). While these flow relative mappings may well become the default for many of us, in a design you may well use both physical and logical sizing. You might want some features to always relate to the physical dimensions whatever the writing mode.
es: Al especificar el tama&ntilde;o de un elemento, la especificaci&oacute;n de <a href="https://drafts.csswg.org/css-logical/">Propiedades y valores l&oacute;gicos</a> le brinda la capacidad de indicar el tama&ntilde;o en relaci&oacute;n con el flujo de texto (en l&iacute;nea y en bloque) en lugar del tama&ntilde;o f&iacute;sico que se relaciona con las dimensiones f&iacute;sicas de horizontal y vertical (p. Ej. izquierda y derecha). Si bien estas asignaciones relativas de flujo pueden convertirse en el valor predeterminado para muchos de nosotros, en un dise&ntilde;o puede usar tanto el tama&ntilde;o f&iacute;sico como el l&oacute;gico. Es posible que desee que algunas caracter&iacute;sticas siempre se relacionen con las dimensiones f&iacute;sicas, independientemente del modo de escritura.
ko: 항목의 크기를 지정할 때 <a href="https://drafts.csswg.org/css-logical/">논리적 특성 및 값</a> 스펙은 수평 및 수직의 물리적 치수 (예 : 왼쪽과 오른쪽). 이러한 흐름 상대 매핑은 많은 사람들에게 기본이 될 수 있지만 디자인에서는 물리적 크기와 논리적 크기를 모두 사용할 수 있습니다. 쓰기 모드에 관계없이 일부 피처가 항상 실제 치수와 관련되도록 할 수 있습니다.
zh_cn: 当指定项目的大小时，<a href="https://drafts.csswg.org/css-logical/">逻辑属性和值</a>规范使您能够指示尺寸，因为它与文本流（行内和块）有关，而不是与水平和垂直的物理尺寸有关的物理尺寸（例如左和右）。尽管这些流相对映射很可能成为我们许多人的默认映射，但在设计中，您可能会同时使用物理和逻辑大小。无论书写方式如何，您可能希望某些功能始终与物理尺寸有关。

source: When taking an item out of flow with positioning, you will need to manage the possibility of content overlapping. Out of flow essentially means that the other elements on your page no longer know that element exists so will not respond to it.
es: Cuando se saca un artículo de la circulación con posicionamiento,hay que gestionar la posibilidad de que el contenido se superponga.Fuera de flujo significa esencialmente que los otros elementos de su página ya no saben que ese elemento existe,por lo que no responderán a él.
ko: 포지셔닝을 사용하여 항목을 흐름에서 벗어날 때는 내용이 겹칠 가능성을 관리해야합니다. 흐름이 없으면 본질적으로 페이지의 다른 요소가 해당 요소가 존재한다는 것을 더 이상 알지 못하므로 응답하지 않습니다.
zh_cn: 当用定位把一个项目带出流程时,你需要管理内容重叠的可能性。出流本质上意味着你页面上的其他元素不再知道该元素的存在,所以不会对其做出响应。

source: When the <a href="../../z-index"><code>z-index</code></a> property is not specified on any element, elements are stacked in the following order (from bottom to top):
ko: 때 <a href="../../z-index"> <code>z-index</code> </a> 속성은 임의의 요소에 지정되어 있지 않은 요소는 (아래에서 위로)는 다음의 순서로 적층되어있다 :
zh_cn: 如果未在任何元素上指定<a href="../../z-index"> <code>z-index</code> </a>属性，则将按照以下顺序（从下到上）堆叠元素：

source: When the <a href="range"><code>range</code></a> descriptor is specified for a counter style, the fallback style will be used to represent values that fall outside the range.
es: Cuando se especifica el descriptor de <a href="range"> <code>range</code> </a> para un estilo de contador, el estilo de reserva se utilizar&aacute; para representar valores que quedan fuera del rango.
ko: 때 <a href="range"> <code>range</code> </a> 기술자 카운터 스타일 지정, 대체 스타일의 범위를 벗어나는 값을 표시하는 데 사용됩니다.
zh_cn: 当为计数器样式指定<a href="range"> <code>range</code> </a>描述符时，后备样式将用于表示超出范围的值。

source: When the <code>-ms-wrap-flow</code> property's computed value is <code>auto</code>, the element does not become an exclusion element unless its float property's computed value is not <code>none</code>. In that case, the element contributes its border box to its containing block's wrapping context and content flows around it according to the <a href="clear"><code>clear</code></a> property. For more information about the impact of an exclusion element on content flow, see the <a href="https://drafts.csswg.org/css-exclusions-1/#terms">Terminology</a> section of the CSS Exclusions Module Level 1 specification.
es: Cuando el valor calculado de la propiedad <code>-ms-wrap-flow</code> es <code>auto</code> m&aacute;tico , el elemento no se convierte en un elemento de exclusi&oacute;n a menos que el valor calculado de su propiedad flotante no sea <code>none</code> . En ese caso, el elemento contribuye con su cuadro de borde al contexto de ajuste del bloque que lo contiene y el contenido fluye a su alrededor de acuerdo con la propiedad <a href="clear"> <code>clear</code> </a> . Para obtener m&aacute;s informaci&oacute;n sobre el impacto de un elemento de exclusi&oacute;n en el flujo de contenido, consulte la secci&oacute;n <a href="https://drafts.csswg.org/css-exclusions-1/#terms">Terminolog&iacute;a</a> de la especificaci&oacute;n de Nivel 1 del M&oacute;dulo de Exclusiones CSS.
ko: 때 <code>-ms-wrap-flow</code> 특성의 계산 된 값이 <code>auto</code> 의 유동 특성의 계산 된 값이 아닌하지 않는 한 요소는 배제 요소가되지 않는 <code>none</code> . 이 경우 요소는 테두리 상자를 포함하는 블록의 래핑 컨텍스트에 기여하고 <a href="clear"> <code>clear</code> </a> 속성 에 따라 그 주위에 내용이 흐릅니다 . 제외 요소가 컨텐츠 흐름에 미치는 영향에 대한 자세한 내용은 CSS 제외 모듈 수준 1 사양 의 <a href="https://drafts.csswg.org/css-exclusions-1/#terms">용어</a> 섹션을 참조하십시오 .
zh_cn: 当 <code>-ms-wrap-flow</code> 属性的计算值为 <code>auto</code> 时，除非该元素的float属性的计算值不为 <code>none</code> ,否则该元素不会成为排除元素。在这种情况下，元素会将其边框框添加到其包含块的包装上下文中，并且内容将根据<a href="clear"> <code>clear</code> </a>属性围绕其流动。有关排除元素对内容流的影响的更多信息，请参阅CSS排除模块第1级规范的&ldquo; <a href="https://drafts.csswg.org/css-exclusions-1/#terms">术语&rdquo;</a>部分。

source: When the <code>fixed</code><a href="https://developer.mozilla.org/en-US/docs/Web/CSS/@counter-style/system"><code>system</code></a> is used and there are not enough symbols to cover all the list items, the fallback style will be used for the rest of the list items.
es: Cuando se utiliza el <a href="https://developer.mozilla.org/en-US/docs/Web/CSS/@counter-style/system"> <code>system</code> </a> <code>fixed</code> y no hay suficientes s&iacute;mbolos para cubrir todos los elementos de la lista, el estilo alternativo se utilizar&aacute; para el resto de los elementos de la lista.
ko: 때 <code>fixed</code> <a href="https://developer.mozilla.org/en-US/docs/Web/CSS/@counter-style/system"> <code>system</code> </a> 사용하는 모든 목록 항목을 포함 할 수있는 충분한 문자가없는되어, 대체 스타일 목록 항목의 나머지 부분에 사용됩니다.
zh_cn: 当使用 <code>fixed</code> <a href="https://developer.mozilla.org/en-US/docs/Web/CSS/@counter-style/system"> <code>system</code> </a>并且没有足够的符号覆盖所有列表项时，后备样式将用于其余列表项。

source: When the <code>system</code> descriptor is <code>cyclic</code>, <code>numeric</code>, <code>alphabetic</code>, <code>symbolic</code>, or <code>fixed</code>, use the <a href="symbols"><code>symbols</code></a> descriptor instead of <code>additive-symbols</code>.
es: Cuando el descriptor del <code>system</code> es <code>cyclic</code> , <code>numeric</code> , <code>alphabetic</code> , <code>symbolic</code> o <code>fixed</code> , use el descriptor de <a href="symbols"> <code>symbols</code> </a> lugar de <code>additive-symbols</code> .
ko: 때 <code>system</code> 기술자는 <code>cyclic</code> , <code>numeric</code> , <code>alphabetic</code> , <code>symbolic</code> , 또는 <code>fixed</code> , 사용 <a href="symbols"> <code>symbols</code> </a> 대신라는 표현 <code>additive-symbols</code> .
zh_cn: 当 <code>system</code> 描述符是 <code>cyclic</code> ， <code>numeric</code> ， <code>alphabetic</code> ， <code>symbolic</code> 或 <code>fixed</code> ，请使用<a href="symbols"> <code>symbols</code> </a>描述符代替 <code>additive-symbols</code> 。

source: When the <code>x-offset</code>, <code>y-offset</code>, and <code>blur</code> are all zero, the box shadow will be a solid-colored outline of equal-size on all sides. The shadows are drawn back to front, so the first shadow sits on top of subsequent shadows. When the <code>border-radius</code> is set to 0, as is the default, the corners of the shadow will be, well, corners. Had we put in a <code>border-radius</code> of any other value, the corners would have been rounded.
ko: 때 <code>x-offset</code> , <code>y-offset</code> , 및 <code>blur</code> 모든 제로 박스 그림자 모든면에서 동일 크기의 고체 착색 윤곽 것입니다. 그림자는 뒤에서 앞으로 그려 지므로 첫 번째 그림자는 후속 그림자 위에 놓입니다. 때 <code>border-radius</code> 0으로 설정되어, 같은 기본이다, 그림자의 모서리는, 음, 모서리 될 것입니다. 다른 값의 <code>border-radius</code> 을 넣으면 모서리가 둥글게됩니다.
zh_cn: 当 <code>x-offset</code> ， <code>y-offset</code> 和 <code>blur</code> 都为零时，框阴影将是在所有面上均等大小的纯色轮廓。阴影是从背面绘制的，因此第一个阴影位于后续阴影的顶部。当 <code>border-radius</code> 设置为0时（默认设置），阴影的角将是角。如果我们输入任何其他值的 <code>border-radius</code> ，则角将被倒圆。

source: When the HTML <code><a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/wbr">&lt;wbr&gt;</a></code> element leads to a line break, no hyphen is added.
ko: HTML <code><a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/wbr">&lt;wbr&gt;</a></code> 요소가 줄 바꿈으로 이어질 때 하이픈이 추가되지 않습니다.
zh_cn: 当HTML <code><a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/wbr">&lt;wbr&gt;</a></code> 元素导致换行符时，不添加连字符。

source: When the browser encounters an invalid <code>var()</code> substitution, the initial or inherited value of the property is used.
es: Cuando el navegador encuentra una sustituci&oacute;n <code>var()</code> no v&aacute;lida , se utiliza el valor inicial o heredado de la propiedad.
ko: 브라우저에 잘못된 <code>var()</code> 대체가 있으면 속성의 초기 또는 상속 된 값이 사용됩니다.
zh_cn: 当浏览器遇到无效的 <code>var()</code> 替换时，将使用属性的初始值或继承的值。

source: When the document <em>is</em> in full-screen mode, the following CSS applies instead, setting the background color to a pale shade of red.
es: Cuando el documento <em>est&aacute;</em> en modo de pantalla completa, se aplica el siguiente CSS, estableciendo el color de fondo en un tono rojo p&aacute;lido.
ko: 문서 <em>가</em> 전체 화면 모드 인 경우 다음 CSS가 대신 적용되어 배경색을 옅은 빨간색으로 설정합니다.
zh_cn: 当文档<em>是</em>在全屏模式下，下面的CSS应用，而不是，设置背景颜色为红色的苍白阴影。

source: When the usage of these alternate glyphs is activated, if one character in the run doesn't have such a typographically-enhanced glyph, the whole set of characters of the run is rendered using a fallback method, synthesizing these glyphs.
es: Cuando se activa el uso de estos glifos alternativos,si un personaje de la tirada no tiene ese glifo tipografiado,todo el conjunto de caracteres de la tirada se renderiza utilizando un método alternativo,sintetizando estos glifos.
ko: 이러한 대체 글리프의 사용이 활성화 될 때 런의 한 문자에 인쇄 상으로 강화 된 글리프가없는 경우 런의 전체 문자 세트가 폴백 방법을 사용하여 렌더링되어 글리프를 합성합니다.
zh_cn: 当这些备用字形的使用被激活时,如果运行中的一个字符没有这样的排版增强字形,则运行中的整组字符将使用回退方法,合成这些字形。

source: When the user hovers over the box, the cursor will change to display the 16x16 px section of the sprite image, starting at x=32 and y=64.
ko: 사용자가 상자 위로 마우스를 가져 가면 x = 32 및 y = 64에서 시작하는 스프라이트 이미지의 16x16 픽셀 섹션을 표시하도록 커서가 변경됩니다.
zh_cn: 当用户将鼠标悬停在方框上时,光标将变为显示精灵图像的16x16 px部分,从x=32和y=64开始。

source: When the visual <a href="https://developer.mozilla.org/en-US/docs/Glossary/viewport">viewport</a> of this element's scroll container is scrolled, it may "pass over" possible snap positions.
ko: 이 요소의 스크롤 컨테이너의 시각적 <a href="https://developer.mozilla.org/en-US/docs/Glossary/viewport">뷰포트</a> 를 스크롤하면 가능한 스냅 위치를 "지나갈"수 있습니다.
zh_cn: 滚动此元素的滚动容器的可视<a href="https://developer.mozilla.org/en-US/docs/Glossary/viewport">视口</a>时，它可能&ldquo;越过&rdquo;可能的捕捉位置。

source: When the visual <a href="https://developer.mozilla.org/en-US/docs/Glossary/viewport">viewport</a> of this scroll container is scrolled horizontally, it must ignore snap points.
es: Cuando la <a href="https://developer.mozilla.org/en-US/docs/Glossary/viewport">ventana</a> visual de este contenedor de desplazamiento se desplaza horizontalmente, debe ignorar los puntos de ajuste.
ko: 이 스크롤 컨테이너 의 시각적 <a href="https://developer.mozilla.org/en-US/docs/Glossary/viewport">뷰포트</a> 를 가로로 스크롤하면 스냅 점을 무시해야합니다.
zh_cn: 当此滚动容器的可视<a href="https://developer.mozilla.org/en-US/docs/Glossary/viewport">视口</a>水平滚动时，它必须忽略捕捉点。

source: When the visual <a href="https://developer.mozilla.org/en-US/docs/Glossary/viewport">viewport</a> of this scroll container is scrolled vertically, it must ignore snap points.
es: Cuando la <a href="https://developer.mozilla.org/en-US/docs/Glossary/viewport">ventana</a> visual de este contenedor de desplazamiento se desplaza verticalmente, debe ignorar los puntos de ajuste.
ko: 이 스크롤 컨테이너 의 시각적 <a href="https://developer.mozilla.org/en-US/docs/Glossary/viewport">뷰포트</a> 를 세로로 스크롤하면 스냅 점을 무시해야합니다.
zh_cn: 垂直滚动此滚动容器的可视<a href="https://developer.mozilla.org/en-US/docs/Glossary/viewport">视口</a>时，它必须忽略捕捉点。

source: When the visual <a href="https://developer.mozilla.org/en-US/docs/Glossary/viewport">viewport</a> of this scroll container is scrolled, it may "pass over" possible snap positions.
es: Cuando se desplaza la <a href="https://developer.mozilla.org/en-US/docs/Glossary/viewport">ventana</a> visual de este contenedor de desplazamiento, puede "pasar" por posibles posiciones de ajuste.
ko: 이 스크롤 컨테이너 의 시각적 <a href="https://developer.mozilla.org/en-US/docs/Glossary/viewport">뷰포트</a> 를 스크롤하면 가능한 스냅 위치를 "통과"할 수 있습니다.
zh_cn: 滚动此滚动容器的可视<a href="https://developer.mozilla.org/en-US/docs/Glossary/viewport">视口</a>时，它可能&ldquo;越过&rdquo;可能的捕捉位置。

source: When the visual <a href="https://developer.mozilla.org/en-US/docs/Glossary/viewport">viewport</a> of this scroll container is scrolled, it must ignore snap points.
es: Cuando se desplaza la <a href="https://developer.mozilla.org/en-US/docs/Glossary/viewport">vista</a> visual de este contenedor de desplazamiento, debe ignorar los puntos de ajuste.
ko: 이 스크롤 컨테이너 의 시각적 <a href="https://developer.mozilla.org/en-US/docs/Glossary/viewport">뷰포트</a> 를 스크롤하면 스냅 점을 무시해야합니다.
zh_cn: 滚动此滚动容器的可视<a href="https://developer.mozilla.org/en-US/docs/Glossary/viewport">视口</a>时，它必须忽略捕捉点。
