Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/css/css.*.017.xlf
Languages: es, ko, zh_cn

source: While this may all seem a little confusing, the rule to remember is that unless you do something to change it, flex items lay themselves out in the direction that words are laid out in the language of your document along the inline, row axis. <code>flex-start</code> will be where the start of a sentence of text would begin.
es: Si bien todo esto puede parecer un poco confuso, la regla para recordar es que, a menos que haga algo para cambiarlo, los elementos flexibles se colocan en la direcci&oacute;n en que las palabras se presentan en el idioma de su documento a lo largo del eje de fila en l&iacute;nea. <code>flex-start</code> ser&aacute; donde comenzar&iacute;a el inicio de una oraci&oacute;n de texto.
ko: 이 모든 것이 약간 혼란스러워 보일 수 있지만, 기억해야 할 규칙은 변경하려는 것이 없으면 문서의 언어로 인라인 행 축을 따라 단어가 배치되는 방향으로 플렉스 항목을 배치한다는 것입니다. <code>flex-start</code> 는 텍스트 문장의 시작이 시작되는 곳입니다.
zh_cn: 尽管这看起来似乎有些令人困惑，但要记住的规则是，除非您进行某些更改，否则flex项会按照沿行内，行轴以文档语言排列单词的方向进行布局。 <code>flex-start</code> 将是文本句子开头的开始位置。

source: While this was originally done to compensate for the ink and paper printing process (very thin lines at small sizes often didn&rsquo;t print, giving the letterforms a broken appearance), it translates well to digital displays when compensating for screen quality and physical size rendering.
es: Si bien esto se hizo originalmente para compensar el proceso de impresi&oacute;n de tinta y papel (las l&iacute;neas muy delgadas en tama&ntilde;os peque&ntilde;os a menudo no se imprim&iacute;an, dando a las formas de letras un aspecto roto), se traduce bien en pantallas digitales cuando se compensa la calidad de la pantalla y el tama&ntilde;o f&iacute;sico. .
ko: 원래는 잉크 및 용지 인쇄 프로세스를 보완하기 위해 수행되었지만 (작은 크기의 매우 얇은 선은 종종 인쇄되지 않아 서체에 끊어진 모양이 생김) 화면 품질 및 물리적 크기 렌더링을 보정 할 때 디지털 디스플레이로 잘 변환됩니다. .
zh_cn: 虽然这样做最初是为了补偿墨水和纸张的打印过程（小尺寸的细线经常无法打印，从而使字母形的外观破损），但在补偿屏幕质量和物理尺寸渲染时，它可以很好地转换为数字显示。

source: While you can choose any name, if you append <code>-start</code> and <code>-end</code> to the lines around an area, as I have in the example above, grid will create you a named area of the main name used. Taking the above example, I have <code>content-start</code> and <code>content-end</code> both for rows and for columns. This means I get a grid area named <code>content</code>, and could place something in that area should I wish to.
es: Mientras que usted puede elegir cualquier nombre, si append <code>-start</code> y <code>-end</code> de las l&iacute;neas alrededor de un &aacute;rea, como lo he hecho en el ejemplo anterior, la rejilla que va a crear una zona llamada del nombre principal que se utiliza. Tomando el ejemplo anterior, tengo <code>content-start</code> y <code>content-end</code> tanto para filas como para columnas. Esto significa que obtengo un &aacute;rea de cuadr&iacute;cula llamada <code>content</code> , y podr&iacute;a colocar algo en esa &aacute;rea si lo deseo.
ko: 이름을 선택할 수는 있지만 , 위의 예에서와 같이 영역 주위의 행에 <code>-start</code> 및 <code>-end</code> 를 추가하면 표에서 사용 된 기본 이름의 명명 된 영역이 생성됩니다. 위의 예를 살펴보면 행과 열 모두에 대해 <code>content-end</code> <code>content-start</code> 과 내용 끝 이 있습니다. 이것은 <code>content</code> 라는 그리드 영역을 얻었으며 원하는 영역에 무언가를 배치 할 수 있음을 의미 합니다.
zh_cn: 尽管可以选择任何名称，但是，如我在上面的示例中那样，如果将 <code>-start</code> 和 <code>-end</code> 附加到区域周围的行中，则grid将为您创建使用的主要名称的命名区域。以上面的示例为例，我对行和列都有 <code>content-start</code> 和 <code>content-end</code> 。这意味着我得到了一个名为 <code>content</code> 的网格区域，并且可以在该区域中放置一些东西。

source: While you can generally create any name you want, including using emojis, the identifier can't be <code>none</code>, <code>unset</code>, <code>initial</code>, or <code>inherit</code>, start with a digit or two dashes, and generally you don't want it to be any other pre-defined CSS keyword. See the <a href="custom-ident"><code>&lt;custom-ident&gt;</code></a> and <a href="string"><code>&lt;string&gt;</code></a> reference pages for more details.
ko: 일반적으로 그림 이모티콘 사용을 포함하여 원하는 이름을 만들 수 있지만 식별자는 <code>none</code> , <code>unset</code> , <code>initial</code> 또는 <code>inherit</code> 일 수 없으며 숫자 또는 두 개의 대시로 시작할 수 없으며 일반적으로 다른 사전이되는 것을 원하지 않습니다. 정의 된 CSS 키워드. 자세한 내용은 <a href="custom-ident"> <code>&lt;custom-ident&gt;</code> </a> 및 <a href="string"> <code>&lt;string&gt;</code> </a> 참조 페이지를 참조하십시오.
zh_cn: 虽然通常可以创建所需的任何名称，包括使用表情符号，但标识符不能为 <code>none</code> ， <code>unset</code> ， <code>initial</code> 或 <code>inherit</code> ，以数字或两个破折号开头，并且通常您不希望其为其他任何定义的CSS关键字。有关更多详细信息，请参见<a href="custom-ident"> <code>&lt;custom-ident&gt;</code> </a>和<a href="string"> <code>&lt;string&gt;</code> </a>参考页。

source: While you can mix and match different angle units, don't. It makes CSS hard to read.
ko: 다른 각도 단위를 혼합하고 일치시킬 수 있지만 그렇게하지 마십시오. 그것은 CSS를 읽기 어렵게 만듭니다.
zh_cn: 虽然你可以混合和匹配不同的角度单位,但不要。它使CSS难以阅读。

source: White space is allowed, but optional inside the parentheses. (But see notes regarding whitespace within pages for <code>min()</code>, <code>max()</code> and <code>clamp()</code> functions.)
ko: 공백은 허용되지만 괄호 안에는 선택 사항입니다. (그러나 <code>min()</code> , <code>max()</code> 및 <code>clamp()</code> 함수에 대한 페이지 내의 공백에 대한 참고 사항을 참조하십시오 .)
zh_cn: 允许使用空格，但括号内是空白。（但是请参见有关页面内空白的 <code>min()</code> ， <code>max()</code> 和 <code>clamp()</code> 函数的注释。）

source: Why are there two versions of scroll snap?
ko: 두 가지 버전의 스크롤 스냅이있는 이유는 무엇입니까?
zh_cn: 为什么有两个版本的卷轴扣?

source: Why choose flexbox?
es: ¿Por qué elegir la caja flexible?
ko: 왜 flexbox를 선택해야합니까?
zh_cn: 为什么选择flexbox?

source: Why do we need logical properties?
es: ¿Por qué necesitamos propiedades lógicas?
ko: 논리적 속성이 필요한 이유는 무엇입니까?
zh_cn: 为什么我们需要逻辑属性?

source: Why is it called a "conic" gradient? If the color stops are much lighter on one side than the other, it can look like a cone from above.
ko: "원추형"그래디언트라고하는 이유는 무엇입니까? 색상 멈춤이 한쪽이 다른 쪽보다 훨씬 밝다면 위에서 보면 원뿔처럼 보일 수 있습니다.
zh_cn: 为什么叫 "圆锥体 "渐变?如果颜色停在一边比另一边浅得多,从上面看就会像一个圆锥体。

source: Why you would use them?
es: ¿Por qué las usaría?
ko: 왜 그것들을 사용하겠습니까?
zh_cn: 为什么你会使用它们?

source: Why? Because the <code>animationstart</code> event fires as soon as the animation starts, and in our case, that happens before our code runs. So we&rsquo;ll start the animation ourselves by setting the class of the element to the style that gets animated after the fact.
es: &iquest;Por qu&eacute;? Debido a que el evento <code>animationstart</code> se dispara tan pronto como comienza la animaci&oacute;n, y en nuestro caso, eso sucede antes de que se ejecute nuestro c&oacute;digo. As&iacute; que comenzaremos la animaci&oacute;n nosotros mismos estableciendo la clase del elemento al estilo que se anima despu&eacute;s del hecho.
ko: 왜? 때문에 <code>animationstart</code> 의 우리의 코드가 실행되기 전에 발생 즉시 애니메이션을 시작으로, 우리의 경우 이벤트가 발생합니다. 따라서 요소의 클래스를 사실 후에 애니메이션이 적용되는 스타일로 설정하여 애니메이션을 직접 시작할 것입니다.
zh_cn: 为什么？因为 <code>animationstart</code> 事件会在动画开始时立即触发，在我们的情况下，这是在代码运行之前发生的。因此，我们将通过将元素的类设置为在事实发生后得到动画处理的样式来自己启动动画。

source: Width (represented by the <code>wdth</code> tag) defines the design axis of how narrow or wide (condensed or extended, in typographic terms) the letterforms can be. This is typically set in CSS using the <a href="../font-stretch"><code>font-stretch</code></a> property, with values expressed as a percentage above or below &lsquo;normal&rsquo; (100%), any number greater than 0 is technically valid&mdash;though it is far more likely that the range would fall closer to the 100% mark, such as 75%-125%. If a number value supplied is outside the range encoded in the font, the browser should render the font at the closest value allowed.
es: El ancho (representado por la etiqueta <code>wdth</code> ) define el eje de dise&ntilde;o de cu&aacute;n estrechas o anchas (condensadas o extendidas, en t&eacute;rminos tipogr&aacute;ficos) pueden ser las formas de las letras. Esto normalmente se establece en CSS utilizando la propiedad <a href="../font-stretch"> <code>font-stretch</code> </a> , con valores expresados ​​como un porcentaje por encima o por debajo de 'normal' (100%), cualquier n&uacute;mero mayor que 0 es t&eacute;cnicamente v&aacute;lido, aunque es mucho m&aacute;s probable que el rango caiga m&aacute;s cerca de la marca del 100%, como 75% -125%. Si un valor num&eacute;rico proporcionado est&aacute; fuera del rango codificado en la fuente, el navegador debe representar la fuente en el valor m&aacute;s cercano permitido.
ko: 너비 ( <code>wdth</code> 태그로 표시)는 글자 모양이 얼마나 좁거나 넓은 지 (인쇄 용어로 요약 또는 축소 )의 디자인 축을 정의합니다. 이는 일반적으로 <a href="../font-stretch"> <code>font-stretch</code> </a> 속성을 사용하여 CSS에서 설정되며 , 값이 '정상'(100 %)보다 높거나 낮은 백분율로 표시되며, 0보다 큰 숫자는 기술적으로 유효합니다. 75 % -125 %와 같은 100 % 표시에 더 가깝습니다. 제공된 숫자 값이 글꼴로 인코딩 된 범위를 벗어난 경우 브라우저는 허용 된 가장 가까운 값으로 글꼴을 렌더링해야합니다.
zh_cn: 宽度（由 <code>wdth</code> 标记表示）定义了字母形状可以有多窄或宽（以印刷术语表示，是压缩还是扩展）的设计轴。通常在CSS中使用<a href="../font-stretch"> <code>font-stretch</code> </a>属性设置此值，其值表示为高于或低于&ldquo;正常&rdquo;（100％）的百分比，任何大于0的数字在技术上都是有效的-尽管范围可能会下降接近100％的标记，例如75％-125％。如果提供的数字值超出字体编码的范围，则浏览器应以允许的最接近值呈现字体。

source: Width and height example
es: Ejemplo de anchura y altura
ko: 폭과 높이 예
zh_cn: 宽度和高度示例

source: Width and margin-left
es: Anchura y margen izquierdo
ko: 너비와 여백 왼쪽
zh_cn: 宽度和margin-left

source: Width of the rendering surface of the output device
es: El ancho de la superficie de representación del dispositivo de salida
ko: 출력 장치의 렌더링 표면 너비
zh_cn: 输出设备的渲染面的宽度。

source: Width of the viewport
es: El ancho de la entrada de la vista
ko: 뷰포트의 너비
zh_cn: 视口宽度

source: Width of the viewport including width of scrollbar
ko: 스크롤바의 너비를 포함한 뷰포트의 너비
zh_cn: 视口的宽度,包括滚动条的宽度。

source: Width-to-height aspect ratio of the output device
es: La relación de aspecto de ancho y alto del dispositivo de salida
ko: 출력 장치의 가로 세로 비율
zh_cn: 输出设备的宽高比。

source: Width-to-height aspect ratio of the viewport
es: La relación de aspecto de ancho y alto del puerto de visión
ko: 뷰포트의 가로 세로 비율
zh_cn: 视口的高宽比。

source: Will be ignored in browsers which don't support <code>:unsupported</code> even if they support <code>:valid</code>.
ko: <code>:valid</code> 를 <code>:unsupported</code> 하더라도 : unsupported를 지원하지 않는 브라우저에서는 무시됩니다 .
zh_cn: 在不支持 <code>:unsupported</code> 的浏览器中将被忽略，即使它们支持 <code>:valid</code> 。

source: Will display the content in two columns (if you're using a multi-column compliant browser):
es: Mostrará el contenido en dos columnas (si utiliza un navegador compatible con varias columnas):
ko: 다중 열 호환 브라우저를 사용하는 경우 내용을 두 열로 표시합니다.
zh_cn: 将以两列方式显示内容(如果你使用的是多列兼容的浏览器)。

source: Will still parse correctly and match <code>:valid</code> even in browsers which don't support <code>:unsupported</code>, whereas:
ko: <code>:unsupported</code> 를 지원하지 않는 브라우저에서도 올바르게 구문 분석되고 <code>:valid</code> 와 일치 합니다 .
zh_cn: 即使在不支持 <code>:unsupported</code> 的浏览器中，仍然可以正确解析并匹配 <code>:valid</code> ，而：

source: Window background. Should be used with the <code>WindowText</code> foreground color.
es: Fondo de ventana Debe usarse con el color de primer plano <code>WindowText</code> .
ko: 창 배경. <code>WindowText</code> 전경색 과 함께 사용해야합니다 .
zh_cn: 窗口背景。应该与 <code>WindowText</code> 前景色一起使用。

source: Window frame.
es: Marco de la ventana.
ko: 창틀.
zh_cn: 窗框。

source: Windows High Contrast Mode
es: Modo de alto contraste de Windows
ko: Windows 고 대비 모드
zh_cn: 窗口高对比度模式

source: With <code>display: flow-root;</code> on the <code>div</code>, everything inside that container participates in the block formatting context of that container, and floats will not poke out of the bottom of the element.
es: Con <code>display: flow-root;</code> en el <code>div</code> , todo lo que est&aacute; dentro de ese contenedor participa en el contexto de formato de bloque de ese contenedor, y los flotantes no se asoman desde la parte inferior del elemento.
ko: 와 <code>display: flow-root;</code> 온 <code>div</code> , 해당 컨테이너의 해당 컨테이너의 컨텍스트를 포맷 블록에 참여하고, 수레 내부의 모든 요소의 하단 밖으로 찌르지 않을 것이다.
zh_cn: 带 <code>display: flow-root;</code> 在 <code>div</code> 上，该容器内的所有内容都将参与该容器的块格式化上下文，并且float不会从该元素的底部戳出。

source: With <code>display: flow-root</code> on the <a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/div"><code>&lt;div&gt;</code></a>, everything inside that container participates in the block formatting context of that container, and floats will not poke out of the bottom of the element.
ko: 함께 <code>display: flow-root</code> 상의 <a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/div"> <code>&lt;div&gt;</code> </a> 모든 용기의 내부 해당 컨테이너의 문맥 포맷 블록에 참여하고, 플로트는 소자의 바닥 밖으로 찌르지 것이다.
zh_cn: 在<a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/div"> <code>&lt;div&gt;</code> </a>上使用 <code>display: flow-root</code> ，该容器内的所有内容都将参与该容器的块格式化上下文，并且浮点数不会从该元素的底部戳出。

source: With CSS you can make it smooth without any extra effort. Simply add a transition to the element and any change will happen smoothly:
es: Con el CSS puedes hacerlo suave sin ningún esfuerzo extra.Simplemente añade una transición al elemento y cualquier cambio se realizará sin problemas:
ko: CSS를 사용하면 별도의 노력 없이도 매끄럽게 만들 수 있습니다. 요소에 전환을 추가하기 만하면 모든 변경 사항이 자연스럽게 발생합니다.
zh_cn: 通过CSS,你可以不费吹灰之力就能让它变得顺畅。只需为元素添加一个过渡,任何变化都会顺利发生。

source: With a <em>fixed positioned element</em>, the containing block is the viewport. The position of the element is absolute within the viewport. Scrolling does not change the position of the element.
es: Con un <em>elemento posicionado fijo</em> , el bloque contenedor es la ventana gr&aacute;fica. La posici&oacute;n del elemento es absoluta dentro de la ventana gr&aacute;fica. El desplazamiento no cambia la posici&oacute;n del elemento.
ko: A의 <em>고정 위치 요소</em> , 용기 블럭 뷰포트이다. 요소의 위치는 뷰포트 내에서 절대적입니다. 스크롤해도 요소의 위치는 바뀌지 않습니다.
zh_cn: 对于<em>固定位置的元素</em>，包含的块是视口。元素的位置在视口中是绝对的。滚动不会更改元素的位置。

source: With a function, use the following:
es: Con una función,utilice lo siguiente:
ko: 함수와 함께 다음을 사용하십시오.
zh_cn: 有了函数,就可以使用以下方法。

source: With a grid area as the parent
es: Con un área cuadriculada como padre
ko: 모눈 영역을 부모로 사용
zh_cn: 以网格区域为母体

source: With a solid document you can begin to add your layout, it is likely you will be using <a href="../media_queries">media queries</a> to create additional columns and make changes for different screen sizes and devices. Grid can be really very useful here, elements deprioritized in the mobile source order can be moved into a sidebar in a desktop layout, for example. The key here is to keep testing, a very simple test is to <em>tab around the document</em>. Does that order still make sense? Check that you do not end up leaping from the top to the bottom of the layout in a peculiar way. If so that would be a sign that you need to address something about the layout.
es: Con un documento s&oacute;lido puede comenzar a agregar su dise&ntilde;o, es probable que use <a href="../media_queries">consultas de medios</a> para crear columnas adicionales y realizar cambios para diferentes tama&ntilde;os de pantalla y dispositivos. La cuadr&iacute;cula puede ser realmente muy &uacute;til aqu&iacute;, los elementos des priorizados en el orden de la fuente m&oacute;vil se pueden mover a una barra lateral en un dise&ntilde;o de escritorio, por ejemplo. La clave aqu&iacute; es seguir probando, una prueba muy simple es <em>tabular alrededor del documento</em> . &iquest;Ese orden todav&iacute;a tiene sentido? Comprueba que no termines saltando de arriba a abajo del dise&ntilde;o de una manera peculiar. Si es as&iacute;, ser&iacute;a una se&ntilde;al de que necesita abordar algo sobre el dise&ntilde;o.
ko: 견고한 문서를 사용하면 레이아웃을 추가 할 수 있습니다. <a href="../media_queries">미디어 쿼리</a> 를 사용하여 추가 열을 만들고 다양한 화면 크기와 장치를 변경할 수 있습니다. 그리드는 여기서 매우 유용 할 수 있습니다. 예를 들어 모바일 소스 순서에서 우선 순위가 지정된 요소는 데스크톱 레이아웃에서 사이드 바로 이동할 수 있습니다. 여기서 핵심은 테스트를 계속하는 것입니다. 매우 간단한 테스트는 <em>문서</em> 를 <em>탭하는 것</em> 입니다. 그 순서는 여전히 타당합니까? 독특한 방식으로 레이아웃의 상단에서 하단으로 튀어 나오지 않는지 확인하십시오. 그렇다면 레이아웃에 대해 설명해야한다는 신호일 것입니다.
zh_cn: 使用可靠的文档，您可以开始添加布局，很可能您将使用<a href="../media_queries">媒体查询</a>来创建其他列并针对不同的屏幕尺寸和设备进行更改。网格在这里确实非常有用，例如，可以将移动源顺序中优先处理的元素移至桌面布局的侧边栏中。这里的关键是保持测试，一个非常简单的测试是<em>在文档中使用Tab键</em>。该命令仍然有意义吗？检查您是否最终不会以特殊的方式从布局的顶部跳到底部。如果是这样，则表明您需要解决有关布局的问题。

source: With a variable font, all of those permutations can be contained in a single file. That file would be larger than a single font, but in most cases smaller or about the same size as the 4 you might load for body copy. The advantage in choosing the variable font is that you have access to the entire range of weights, widths, and styles available, rather than being constrained to only the few that you previously would have loaded separately.
es: Con una fuente variable,todas esas permutaciones pueden estar contenidas en un solo archivo.Ese archivo sería más grande que una sola fuente,pero en la mayoría de los casos más pequeño o aproximadamente del mismo tamaño que los 4 que se podrían cargar para el cuerpo de la copia.La ventaja de elegir la fuente variable es que tienes acceso a todo el rango de pesos,anchos y estilos disponibles,en lugar de estar restringido a los pocos que anteriormente habrías cargado por separado.
ko: 가변 글꼴을 사용하면 모든 순열을 단일 파일에 포함시킬 수 있습니다. 이 파일은 단일 글꼴보다 크지 만 대부분의 경우 본문에로드 할 수있는 4보다 작거나 거의 같은 크기입니다. 가변 글꼴을 선택할 때 얻을 수있는 장점은 이전에 별도로로드 한 소수에만 제한되지 않고 사용 가능한 모든 가중치, 너비 및 스타일에 액세스 할 수 있다는 것입니다.
zh_cn: 使用可变字体,所有这些变化都可以包含在一个文件中。这个文件会比单一字体大,但在大多数情况下,会比你可能为正文拷贝加载的4个字体要小或差不多大。选择可变字体的好处是,您可以使用所有可用的重量、宽度和样式的范围,而不是仅仅局限于您以前单独加载的几种字体。

source: With all the flex tools at your disposal you will find that most tasks can be achieved, although it might take a little bit of experimentation at first.
es: Con todas las herramientas de flexión a su disposición encontrará que la mayoría de las tareas se pueden lograr,aunque al principio podría requerir un poco de experimentación.
ko: 모든 플렉스 도구를 마음대로 사용하면 처음에는 약간의 실험이 필요할 수 있지만 대부분의 작업을 수행 할 수 있습니다.
zh_cn: 有了所有的柔性工具,你会发现大部分的任务都可以实现,虽然一开始可能需要一点点的尝试。

source: With borders, the width, color, and style can be simplified into one declaration. For example, the following CSS ...
es: Con los bordes,el ancho,el color y el estilo pueden ser simplificados en una sola declaración.Por ejemplo,el siguiente CSS ...
ko: 테두리를 사용하면 너비, 색상 및 스타일을 하나의 선언으로 단순화 할 수 있습니다. 예를 들어 다음 CSS는 ...
zh_cn: 有了边框,宽度、颜色和样式可以简化为一个声明。例如,下面的CSS...

source: With each repetition, the positions of the color stops are shifted by a multiple of the dimensions of the basic radial gradient (the distance between the last color stop and the first). Thus, the position of each ending color stop coincides with a starting color stop; if the color values are different, this will result in a sharp visual transition, which can be mitigated by repeating the first color as the last color.
ko: 반복 할 때마다 색상 정지 점의 위치가 기본 방사형 그래디언트 치수의 배수만큼 이동합니다 (마지막 색상 정지 점과 첫 번째 색상 정지 점 사이의 거리). 따라서 각 종료 색상 중지의 위치는 시작 색상 중지와 일치합니다. 색상 값이 다른 경우 첫 번째 색상을 마지막 색상으로 반복하여 완화 할 수있는 선명한 시각적 전환이 발생합니다.
zh_cn: 每重复一次,颜色停止点的位置都会以基本径向梯度(最后一个颜色停止点和第一个颜色停止点之间的距离)的尺寸的倍数移动。因此,每个结束颜色停顿的位置与起始颜色停顿的位置相吻合;如果颜色值不同,会导致视觉上的急剧过渡,可以通过重复第一个颜色作为最后一个颜色来缓解。

source: With each repetition, the positions of the color stops are shifted by a multiple of the dimensions of the basic radial gradient (the distance between the last color stop and the first). Thus, the position of each ending color stop coincides with a starting color stop; if the color values are different, this will result in a sharp visual transition.
es: Con cada repetición,las posiciones de las paradas de color se desplazan por un múltiplo de las dimensiones del gradiente radial básico (la distancia entre la última parada de color y la primera).Por lo tanto,la posición de cada parada de color final coincide con una parada de color inicial;si los valores de color son diferentes,esto resultará en una transición visual aguda.
ko: 각 반복마다 색상 정지 점의 위치는 기본 방사형 그래디언트의 치수 (마지막 색상 정지 점과 첫 번째 색상 점 사이의 거리)의 배수로 이동합니다. 따라서, 각 종료 색 정지의 위치는 시작 색 정지와 일치합니다. 색상 값이 다르면 시각적으로 선명하게 전환됩니다.
zh_cn: 每重复一次,颜色停止点的位置会以基本径向梯度(最后一个颜色停止点和第一个颜色停止点之间的距离)的倍数移动。因此,每个结束颜色停止点的位置与起始颜色停止点相吻合;如果颜色值不同,这将导致一个清晰的视觉过渡。

source: With each repetition, the positions of the color stops are shifted by a multiple of the length of the basic linear gradient (the distance between the last color stop and the first). Thus, the position of each ending color stop coincides with a starting color stop; if the color values are different, this will result in a sharp visual transition.
es: Con cada repetición,las posiciones de las paradas de color se desplazan por un múltiplo de la longitud del gradiente lineal básico (la distancia entre la última parada de color y la primera).Por lo tanto,la posición de cada parada de color final coincide con una parada de color inicial;si los valores de color son diferentes,esto resultará en una transición visual aguda.
ko: 반복 할 때마다 색상 정지 점의 위치는 기본 선형 그래디언트 길이의 배수 (마지막 색상 정지 점과 첫 번째 색상 점 사이의 거리)만큼 이동합니다. 따라서, 각 종료 색 정지의 위치는 시작 색 정지와 일치합니다. 색상 값이 다르면 시각적으로 선명하게 전환됩니다.
zh_cn: 每重复一次,颜色停止点的位置会以基本线性梯度长度(最后一个颜色停止点和第一个颜色停止点之间的距离)的倍数移动。因此,每个结束颜色停止点的位置与起始颜色停止点相吻合;如果颜色值不同,这将导致一个清晰的视觉过渡。

source: With help from:
es: Con la ayuda de:
ko: 도움을 받아 :
zh_cn: 在以下方面的帮助下:

source: With one value:
es: Con un valor:
ko: 하나의 값으로
zh_cn: 有一个值。

source: With regard to flex items, if an item was floated or cleared and then becomes a flex item due to the parent having <code>display: flex</code> applied, the floating and clearing will no longer happen, and the item will not be taken out of normal flow in the way that floats are. If you have used the <a href="../vertical-align"><code>vertical-align</code></a> property, as used with <code>inline-block</code> or table layout for alignment, this will no longer affect the item and you can use the alignment properties of flexbox instead.
es: Con respecto a los elementos flexibles, si un elemento fue flotante o despejado y luego se convierte en un elemento flexible debido a que el padre tiene <code>display: flex</code> aplicado, la flotaci&oacute;n y la eliminaci&oacute;n ya no suceder&aacute;n, y el elemento no se sacar&aacute; del flujo normal en como son los flotadores. Si ha utilizado la propiedad de <a href="../vertical-align"> <code>vertical-align</code> </a> , como se usa con el dise&ntilde;o de <code>inline-block</code> o de tabla para la alineaci&oacute;n, esto ya no afectar&aacute; al elemento y puede usar las propiedades de alineaci&oacute;n de flexbox.
ko: 플렉스 아이템과 관련하여, 아이템이 플로팅되거나 클리어 된 다음 부모가 <code>display: flex</code> 가지고 있기 때문에 플렉스 아이템이되는 경우 : 플렉스 적용, 플로팅 및 클리어링은 더 이상 발생하지 않으며 아이템은 정상적인 흐름에서 벗어나지 않습니다. 수레가있는 방식. <a href="../vertical-align"> <code>vertical-align</code> </a> <code>inline-block</code> 또는 테이블 레이아웃에서 사용되는 세로 정렬 속성을 사용한 경우 이는 더 이상 항목에 영향을 미치지 않으며 대신 flexbox의 정렬 속성을 사용할 수 있습니다.
zh_cn: 对于弹性物料，如果某个物料被浮动或清除，然后由于其父级具有 <code>display: flex</code> 而变为弹性物料，则浮动和清除将不再发生，并且不会从正常流程中取出该物料漂浮的方式。如果您已将<a href="../vertical-align"> <code>vertical-align</code> </a>属性（如与 <code>inline-block</code> 或表格布局一起用于对齐）一起使用，则这将不再影响该项目，而可以使用flexbox的对齐属性。

source: With the <a href="../grid-area"><code>grid-area</code></a> property I can assign each of these areas a name. This will not yet create any layout, but we now have named areas to use in a layout.
es: Con la propiedad de <a href="../grid-area"> <code>grid-area</code> </a> puedo asignar un nombre a cada una de estas &aacute;reas. Esto a&uacute;n no crear&aacute; ning&uacute;n dise&ntilde;o, pero ahora tenemos &aacute;reas con nombre para usar en un dise&ntilde;o.
ko: <a href="../grid-area"> <code>grid-area</code> </a> 속성을 사용하여 각 영역에 이름을 지정할 수 있습니다. 아직 레이아웃을 만들지는 않지만 이제 레이아웃에 사용할 명명 된 영역이 있습니다.
zh_cn: 使用<a href="../grid-area"> <code>grid-area</code> </a>属性，我可以为每个区域分配一个名称。这将不会创建任何布局，但是现在我们已经命名了要在布局中使用的区域。
