Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/css/css.*.017.xlf
Languages: es, ko, zh_cn

source: When animating between one <code>&lt;basic-shape&gt;</code> and a second, the rules below are applied. The values in the shape functions interpolate as a simple list. The list values interpolate as <a href="length"><code>&lt;length&gt;</code></a>, <a href="percentage"><code>&lt;percentage&gt;</code></a>, or <a href="calc"><code>calc()</code></a> where possible. If list values are not one of those types but are identical (such as finding <code>nonzero</code> in the same list position in both lists), those values do interpolate.
es: Al animar entre una <code>&lt;basic-shape&gt;</code> y un segundo, se aplican las siguientes reglas. Los valores en las funciones de forma se interpolan como una lista simple. Los valores de la lista se interpolan como <a href="length"> <code>&lt;length&gt;</code> </a> , <a href="percentage"> <code>&lt;percentage&gt;</code> </a> o <a href="calc"> <code>calc()</code> </a> siempre que sea posible. Si los valores de lista no son uno de esos tipos pero son id&eacute;nticos (como encontrar un valor <code>nonzero</code> de cero en la misma posici&oacute;n de lista en ambas listas), esos valores se interpolan.
ko: 하나의 <code>&lt;basic-shape&gt;</code> 과 두 번째 기본 애니메이션 사이에 애니메이션을 적용 할 때 아래 규칙이 적용됩니다. 모양 함수의 값은 간단한 목록으로 보간됩니다. 목록 값은 가능한 경우 <a href="length"> <code>&lt;length&gt;</code> </a> , <a href="percentage"> <code>&lt;percentage&gt;</code> </a> 또는 <a href="calc"> <code>calc()</code> </a> 로 보간됩니다 . 목록 값이 해당 유형 중 하나가 아니지만 동일한 경우 (예 : 두 목록에서 동일한 목록 위치에서 <code>nonzero</code> 을 찾는 경우 ) 해당 값이 보간됩니다.
zh_cn: 在一个 <code>&lt;basic-shape&gt;</code> 和一秒钟之间进行动画时，将应用以下规则。形状函数中的值作为简单列表插入。列表值在可能的情况下以<a href="length"> <code>&lt;length&gt;</code> </a>，<a href="percentage"> <code>&lt;percentage&gt;</code> </a>或<a href="calc"> <code>calc()</code> </a>进行插值。如果列表值不是这些类型之一，而是相同的（例如，在两个列表的相同列表位置中找到 <code>nonzero</code> 值），则这些值会进行插值。

source: When animating between one <code>&lt;basic-shape&gt;</code> and another, the rules below are applied. The values in the shape functions interpolate as a simple list. The list values interpolate as <a href="length"><code>&lt;length&gt;</code></a>, <a href="percentage"><code>&lt;percentage&gt;</code></a>, or <a href="calc()"><code>calc()</code></a> where possible. If list values are not one of those types but are identical (such as finding <code>nonzero</code> in the same list position in both lists), those values do interpolate.
es: Al animar entre una <code>&lt;basic-shape&gt;</code> y otra, se aplican las siguientes reglas. Los valores en las funciones de forma se interpolan como una lista simple. Los valores de la lista se interpolan como <a href="length"> <code>&lt;length&gt;</code> </a> , <a href="percentage"> <code>&lt;percentage&gt;</code> </a> o <a href="calc()"> <code>calc()</code> </a> siempre que sea posible. Si los valores de lista no son uno de esos tipos pero son id&eacute;nticos (como encontrar un valor <code>nonzero</code> de cero en la misma posici&oacute;n de lista en ambas listas), esos valores se interpolan.
ko: 하나의 <code>&lt;basic-shape&gt;</code> 와 다른 &lt;기본 형태&gt; 사이에 애니메이션을 적용 할 때 아래 규칙이 적용됩니다. 모양 함수의 값은 간단한 목록으로 보간됩니다. 목록 값은 가능한 경우 <a href="length"> <code>&lt;length&gt;</code> </a> , <a href="percentage"> <code>&lt;percentage&gt;</code> </a> 또는 <a href="calc()"> <code>calc()</code> </a> 로 보간됩니다 . 목록 값이 해당 유형 중 하나가 아니지만 동일한 경우 (예 : 두 목록에서 동일한 목록 위치에서 <code>nonzero</code> 을 찾는 경우 ) 해당 값이 보간됩니다.
zh_cn: 在一个 <code>&lt;basic-shape&gt;</code> 和另一个&lt;basic-shape&gt;之间进行动画设置时，将应用以下规则。形状函数中的值作为简单列表插入。列表值在可能的情况下以<a href="length"> <code>&lt;length&gt;</code> </a>，<a href="percentage"> <code>&lt;percentage&gt;</code> </a>或<a href="calc()"> <code>calc()</code> </a>进行插值。如果列表值不是这些类型之一，而是相同的（例如，在两个列表的相同列表位置中找到 <code>nonzero</code> 值），则这些值会进行插值。

source: When animating between one <code>&lt;basic-shape&gt;</code> and another, the rules below are applied. The values in the shape functions interpolate as a simple list. The list values interpolate as <a href="length"><code>&lt;length&gt;</code></a>, <a href="percentage"><code>&lt;percentage&gt;</code></a>, or <a href="calc()"><code>calc()</code></a> where possible. If list values are not one of those types but are identical, those values do interpolate.
ko: <code>&lt;basic-shape&gt;</code> 하나 와 다른 것 사이에 애니메이션을 적용 할 때 아래 규칙이 적용됩니다. 모양 함수의 값은 간단한 목록으로 보간됩니다. 목록 값은 가능한 경우 <a href="length"> <code>&lt;length&gt;</code> </a> , <a href="percentage"> <code>&lt;percentage&gt;</code> </a> 또는 <a href="calc()"> <code>calc()</code> </a> 로 보간됩니다 . 목록 값이 이러한 유형 중 하나가 아니지만 동일한 경우 해당 값이 보간됩니다.
zh_cn: 在一个 <code>&lt;basic-shape&gt;</code> 和另一个&lt;basic-shape&gt;之间进行动画设置时，将应用以下规则。形状函数中的值作为简单列表插入。列表值在可能的情况下以<a href="length"> <code>&lt;length&gt;</code> </a>，<a href="percentage"> <code>&lt;percentage&gt;</code> </a>或<a href="calc()"> <code>calc()</code> </a>进行插值。如果列表值不是这些类型之一，但相同，那么这些值会进行插值。

source: When appearing outside a <code>minmax()</code> notation, it implies an automatic minimum (i.e. <code>minmax(auto, &lt;flex&gt;)</code>).
es: Cuando aparece fuera de una notaci&oacute;n <code>minmax()</code> , implica un m&iacute;nimo autom&aacute;tico (es decir, <code>minmax(auto, &lt;flex&gt;)</code> ).
ko: <code>minmax()</code> 표기법 외부에 나타날 때는 자동 최소값을 의미합니다 (예 : <code>minmax(auto, &lt;flex&gt;)</code> ).
zh_cn: 当出现在 <code>minmax()</code> 表示法之外时，表示自动最小值（即 <code>minmax(auto, &lt;flex&gt;)</code> ）。

source: When applied to a table cell, specifies the alignment character around which the cell's contents will align.
es: Cuando se aplica a una celda de una tabla,especifica el carácter de alineación alrededor del cual se alineará el contenido de la celda.
ko: 표 셀에 적용될 때 셀 내용이 정렬 될 정렬 문자를 지정합니다.
zh_cn: 当应用于表格单元格时,指定单元格的内容将围绕其对齐的对齐字符。

source: When applied to anchor elements, the truncating can happen in the middle of the text, not necessarily at the end.
ko: 앵커 요소에 적용하면 텍스트 중간에서 잘림이 발생할 수 있으며 반드시 끝이 아닐 수도 있습니다.
zh_cn: 当应用于锚元素时,截断可以发生在文本的中间,而不一定是在最后。

source: When applied to non-floating blocks, it moves the <a href="box_model">border edge</a> of the element down until it is below the <a href="box_model">margin edge</a> of all relevant floats. The non-floated block's vertical margin collapses.
es: Cuando se aplica a bloques no flotantes, mueve el <a href="box_model">borde</a> del borde del elemento hacia abajo hasta que est&eacute; debajo del <a href="box_model">borde</a> del margen de todos los flotadores relevantes. El margen vertical del bloque no flotante se derrumba.
ko: 플로팅이 아닌 블록에 적용되면 모든 관련 플로트 의 <a href="box_model">여백 가장자리</a> 아래가 될 때까지 요소 의 <a href="box_model">테두리 가장자리</a> 가 아래로 이동합니다 . 비 부동 블록의 수직 여백이 축소됩니다.
zh_cn: 当应用于非浮动块时，它将元素的<a href="box_model">边界边缘</a>向下移动，直到其位于所有相关浮动对象的<a href="box_model">边缘边缘</a>以下。非浮动块的垂直边距折叠。

source: When applied to non-floating blocks, it moves the <a href="css_box_model/introduction_to_the_css_box_model#border-area">border edge</a> of the element down until it is below the <a href="css_box_model/introduction_to_the_css_box_model#margin-area">margin edge</a> of all relevant floats. The non-floated block's top margin collapses.
ko: 플로팅이 아닌 블록에 적용하면 모든 관련 플로트 의 <a href="css_box_model/introduction_to_the_css_box_model#margin-area">여백 가장자리</a> 아래에있을 때까지 요소 의 <a href="css_box_model/introduction_to_the_css_box_model#border-area">테두리 가장자리</a> 를 아래로 이동합니다 . 부동 블록의 상단 여백이 무너집니다.
zh_cn: 当应用于非浮动块时，它将元素的<a href="css_box_model/introduction_to_the_css_box_model#border-area">边界边缘</a>向下移动，直到其位于所有相关浮动对象的<a href="css_box_model/introduction_to_the_css_box_model#margin-area">边缘边缘</a>以下。非浮动块的顶部边距折叠。

source: When both <a href="left"><code>left</code></a> and <code>right</code> are defined, if not prevented from doing so by other properties, the element will stretch to satisfy both. If the element cannot stretch to satisfy both -- for example, if a <code>width</code> is declared -- the position of the element is<em> over-constrained</em>. When this is the case, the <code>left</code> value has precedence when the container is left-to-right; the <code>right</code> value has precedence when the container is right-to-left.
ko: 양쪽 경우 <a href="left"> <code>left</code> </a> 과 <code>right</code> 의 다른 특성에 의해 그렇게하는 것을 방지하지 않으면, 정의 된 상기 요소를 모두 만족하도록 신장된다. 예를 들어 <code>width</code> 가 선언 된 경우 와 같이 요소가 두 가지를 모두 충족하도록 늘일 수없는 경우 요소 의 위치가 <em>과도하게 제한</em> 됩니다. 이 경우 컨테이너가 왼쪽에서 오른쪽 일 때 <code>left</code> 값이 우선합니다. <code>right</code> 컨테이너가 오른쪽에서 왼쪽 인 경우는 우선 순위 값을 갖는다.
zh_cn: 当同时定义了<a href="left"> <code>left</code> </a>和 <code>right</code> 时，如果不受其他属性的限制，则该元素将拉伸以同时满足这两个条件。如果元素不能同时满足两个条件（例如，声明了 <code>width</code> ），则元素的位置会受到<em>过度约束</em>。在这种情况下，当容器从左到右时， <code>left</code> 值优先。当容器从右到左时， <code>right</code> 值优先。

source: When both <a href="left"><code>left</code></a> and <code>right</code> are defined, the position of the element is<em> overspecified</em>. When this is the case, the <code>left</code> value has precedence when the container is left-to-right (thus, the computed value of <code>right</code> is set to <code>-left</code>); the <code>right</code> value has precedence when the container is right-to-left (thus, the computed value of <code>left</code> is set to <code>-right</code>).
es: Cuando se definen tanto la <a href="left"> <code>left</code> </a> como la <code>right</code> , la posici&oacute;n del elemento se <em>especifica en exceso</em> . Cuando este es el caso, el valor <code>left</code> tiene prioridad cuando el contenedor est&aacute; de izquierda a derecha (por lo tanto, el valor calculado de la <code>right</code> se establece en <code>-left</code> ); el valor <code>right</code> tiene prioridad cuando el contenedor es de derecha a izquierda (por lo tanto, el valor calculado de <code>left</code> se establece en <code>-right</code> ).
ko: 양쪽 경우 <a href="left"> <code>left</code> </a> 과 <code>right</code> 정의되고, 소자의 위치가된다 <em>overspecified</em> . 이러한 경우가되면, <code>left</code> 값은 용기가 왼쪽에서 오른쪽 (즉, 계산 된 값의 우선 순위가 <code>right</code> 설정된다 <code>-left</code> ); <code>right</code> 컨테이너 (즉, 계산 된 값 중 오른쪽에서 왼쪽 인 경우는 우선 순위 값을 가지고 <code>left</code> 설정된다 <code>-right</code> ).
zh_cn: 如果同时定义了<a href="left"> <code>left</code> </a>和 <code>right</code> ，则元素的位置会被<em>过度指定</em>。当在这种情况下， <code>left</code> 值具有当容器被左到右（因此，的计算值优先 <code>right</code> 设定为 <code>-left</code> ）; 的 <code>right</code> 值具有优先级时，所述容器是从右到左（因此，的计算值 <code>left</code> 被设置为 <code>-right</code> ）。

source: When both <a href="top"><code>top</code></a> and <code>bottom</code> are specified, <code>position</code> is set to <code>absolute</code> or <code>fixed</code>, <em>and</em><a href="height"><code>height</code></a> is unspecified (either <code>auto</code> or <code>100%</code>) both the <code>top</code> and <code>bottom</code> distances are respected. In all other situations, if <a href="height"><code>height</code></a> is constrained in any way or <code>position</code> is set to <code>relative</code>, the <code>top</code> property takes precedence and the <code>bottom</code> property is ignored.
ko: 두 경우 <a href="top"> <code>top</code> </a> 과 <code>bottom</code> 지정되어, <code>position</code> 에 설정되어 <code>absolute</code> 또는 <code>fixed</code> , <em>및 </em><a href="height"> <code>height</code> </a> 지정 (하나 인 <code>auto</code> 또는 <code>100%</code> )를 모두 <code>top</code> 및 <code>bottom</code> 거리를 존중한다. 다른 모든 상황에서 <a href="height"> <code>height</code> </a> 가 어떤 식 으로든 제한되거나 <code>position</code> 가 <code>relative</code> 로 설정된 경우 <code>top</code> 속성이 우선하고 <code>bottom</code> 속성은 무시됩니다.
zh_cn: 当同时指定了<a href="top"> <code>top</code> </a>和 <code>bottom</code> 时， <code>position</code> 设置为 <code>absolute</code> 或 <code>fixed</code> ，<em>而</em><a href="height"> <code>height</code> </a>未指定（ <code>auto</code> 或 <code>100%</code> ）时，将同时考虑到 <code>top</code> 和 <code>bottom</code> 的距离。在所有其他情况下，如果以任何方式限制<a href="height"> <code>height</code> </a>或将 <code>position</code> 设置为 <code>relative</code> ，则 <code>top</code> 属性优先，而 <code>bottom</code> 属性则被忽略。

source: When both <a href="top"><code>top</code></a> and <code>bottom</code> are specified, <em>and</em><a href="height"><code>height</code></a> is unspecified or either <code>auto</code> or <code>100%</code>, both the <code>top</code> and <code>bottom</code> distances are respected. In all other situations, if <a href="height"><code>height</code></a> is constrained in any way, the <code>top</code> property takes precedence and the <code>bottom</code> property is ignored.
es: Cuando se especifican tanto la <a href="top"> <code>top</code> </a> como la <code>bottom</code> , <em>y la </em><a href="height"> <code>height</code> </a> no se especifica o es <code>auto</code> m&aacute;tica o <code>100%</code> , se respetan las distancias <code>top</code> e <code>bottom</code> . En todas las dem&aacute;s situaciones, si la <a href="height"> <code>height</code> </a> est&aacute; restringida de alguna manera, la propiedad <code>top</code> tiene prioridad y la propiedad <code>bottom</code> se ignora.
ko: 두 경우 <a href="top"> <code>top</code> </a> 과 <code>bottom</code> 지정되어 <em>및 </em><a href="height"> <code>height</code> </a> 지정되지 않거나 중 하나 인 <code>auto</code> 또는 <code>100%</code> 양쪽, <code>top</code> 과 <code>bottom</code> 거리가 존중된다. 다른 모든 상황에서 <a href="height"> <code>height</code> </a> 가 어떤 식 으로든 제한되면 <code>top</code> 속성이 우선하고 <code>bottom</code> 속성은 무시됩니다.
zh_cn: 如果同时指定了<a href="top"> <code>top</code> </a>和 <code>bottom</code> ，<em>并且</em><a href="height"> <code>height</code> </a>未指定，或者为 <code>auto</code> 或 <code>100%</code> ，则将同时考虑到 <code>top</code> 和 <code>bottom</code> 的距离。在所有其他情况下，如果以任何方式限制<a href="height"> <code>height</code> </a>，则 <code>top</code> 属性优先，而 <code>bottom</code> 属性则被忽略。

source: When both <code>left</code> and <a href="right"><code>right</code></a> are defined, and width constraints don't prevent it, the element will stretch to satisfy both. If the element cannot stretch to satisfy both, the position of the element is <em>overspecified</em>. When this is the case, the <code>left</code> value has precedence when the container is left-to-right; the <code>right</code> value has precedence when the container is right-to-left.
ko: 모두가 때 <code>left</code> 과 <a href="right"> <code>right</code> </a> 정의하고 있으며, 폭 제약을 방해하지 않는, 요소 모두를 만족시키기 위해 스트레칭합니다. 요소가 두 가지를 모두 충족하도록 늘일 수없는 경우 요소의 위치가 <em>과도하게 지정</em> 됩니다. 이 경우 컨테이너가 왼쪽에서 오른쪽 일 때 <code>left</code> 값이 우선합니다. <code>right</code> 컨테이너가 오른쪽에서 왼쪽 인 경우는 우선 순위 값을 갖는다.
zh_cn: 如果同时定义了 <code>left</code> 和<a href="right"> <code>right</code> </a>，并且宽度限制未阻止它，则元素将拉伸以同时满足这两个条件。如果元素无法拉伸以同时满足这两个条件，则元素的位置被<em>过度指定</em>。在这种情况下，当容器从左到右时， <code>left</code> 值优先。当容器从右到左时， <code>right</code> 值优先。

source: When both <code>left</code> and <a href="right"><code>right</code></a> are defined, the position of the element is<em> overspecified</em>. When this is the case, the <code>left</code> value has precedence when the container is left-to-right (thus, the computed value of <code>right</code> is set to <code>-left</code>); the <code>right</code> value has precedence when the container is right-to-left (thus, the computed value of <code>left</code> is set to <code>-right</code>).
es: Cuando se definen tanto la <code>left</code> como la <a href="right"> <code>right</code> </a> , la posici&oacute;n del elemento se <em>especifica en exceso</em> . Cuando este es el caso, el valor <code>left</code> tiene prioridad cuando el contenedor est&aacute; de izquierda a derecha (por lo tanto, el valor calculado de la <code>right</code> se establece en <code>-left</code> ); el valor <code>right</code> tiene prioridad cuando el contenedor es de derecha a izquierda (por lo tanto, el valor calculado de <code>left</code> se establece en <code>-right</code> ).
ko: 양쪽 경우 <code>left</code> 과 <a href="right"> <code>right</code> </a> 정의되고, 소자의 위치가된다 <em>overspecified</em> . 이러한 경우가되면, <code>left</code> 값은 용기가 왼쪽에서 오른쪽 (즉, 계산 된 값의 우선 순위가 <code>right</code> 설정된다 <code>-left</code> ); <code>right</code> 컨테이너 (즉, 계산 된 값 중 오른쪽에서 왼쪽 인 경우는 우선 순위 값을 가지고 <code>left</code> 설정된다 <code>-right</code> ).
zh_cn: 如果同时定义了 <code>left</code> 和<a href="right"> <code>right</code> </a>，则元素的位置会被<em>过度指定</em>。当在这种情况下， <code>left</code> 值具有当容器被左到右（因此，的计算值优先 <code>right</code> 设定为 <code>-left</code> ）;的 <code>right</code> 值具有优先级时，所述容器是从右到左（因此，的计算值 <code>left</code> 被设置为 <code>-right</code> ）。

source: When both <code>left</code> and <code>right</code> are declared, the element will stretch to meet both, unless other constraints prevent it from doing so. If the element will not stretch or shrink to meet meet both. When the position of the element is<em> overspecified</em>, the precende is based on the container's direction: The <code>left</code> will take precendence if the container's direction is left-to-right. The <code>right</code> will take precedence if the container's direction is right-to-left.
ko: 모두가되면 <code>left</code> 과 <code>right</code> 선언, 요소는 다른 제약 조건이 그렇게되는 것을 방지하지 않는 한, 모두를 충족하기 위해 스트레칭합니다. 요소가 늘어나거나 줄어들지 않으면 둘 다 충족됩니다. 요소의 위치가되면 <em>overspecified</em> 상기 precende은 컨테이너의 방향에 기초 다음 <code>left</code> 컨테이너의 방향이 왼쪽에서 오른쪽의 경우 precendence 걸릴 것이다. <code>right</code> 컨테이너의 방향이 오른쪽에서 왼쪽 인 경우 우선합니다.
zh_cn: 当同时声明了 <code>left</code> 和 <code>right</code> 时，该元素将拉伸以同时满足这两个条件，除非其他约束阻止它这样做。如果元素不会拉伸或收缩，则不能同时满足。当元素的位置被<em>过度指定时</em>，优先级将基于容器的方向：如果容器的方向是从左到右，则 <code>left</code> 将优先。在 <code>right</code> 如果容器的方向是从右到左将优先考虑。

source: When both <code>top</code> and <a href="bottom"><code>bottom</code></a> are specified, <code>position</code> is set to <code>absolute</code> or <code>fixed</code>, <em>and</em><a href="height"><code>height</code></a> is unspecified (either <code>auto</code> or <code>100%</code>) both the <code>top</code> and <code>bottom</code> distances are respected. In all other situations, if <a href="height"><code>height</code></a> is constrained in any way or <code>position</code> is set to <code>relative</code>, the <code>top</code> property takes precedence and the <code>bottom</code> property is ignored.
ko: 두 경우 <code>top</code> 과 <a href="bottom"> <code>bottom</code> </a> 지정되어, <code>position</code> 에 설정되어 <code>absolute</code> 또는 <code>fixed</code> , <em>및 </em><a href="height"> <code>height</code> </a> 지정 (하나 인 <code>auto</code> 또는 <code>100%</code> )를 모두 <code>top</code> 및 <code>bottom</code> 거리를 존중한다. 다른 모든 상황에서 <a href="height"> <code>height</code> </a> 가 어떤 식 으로든 제한되거나 <code>position</code> 가 <code>relative</code> 로 설정된 경우 <code>top</code> 속성이 우선하고 <code>bottom</code> 속성은 무시됩니다.
zh_cn: 当同时指定了 <code>top</code> 和<a href="bottom"> <code>bottom</code> 时</a>， <code>position</code> 设置为 <code>absolute</code> 或 <code>fixed</code> ，<em>而</em><a href="height"> <code>height</code> </a>未指定（ <code>auto</code> 或 <code>100%</code> ）时，将同时考虑到 <code>top</code> 和 <code>bottom</code> 的距离。在所有其他情况下，如果以任何方式限制<a href="height"> <code>height</code> </a>或将 <code>position</code> 设置为 <code>relative</code> ，则 <code>top</code> 属性优先，而 <code>bottom</code> 属性则被忽略。

source: When both <code>top</code> and <a href="bottom"><code>bottom</code></a> are specified, <em>and</em><a href="height"><code>height</code></a> is unspecified or either <code>auto</code> or <code>100%</code>, both the <code>top</code> and <code>bottom</code> distances are respected. In all other situations, if <a href="height"><code>height</code></a> is constrained in any way, the <code>top</code> property takes precedence and the <code>bottom</code> property is ignored.
es: Cuando se especifican tanto la <code>top</code> como la <a href="bottom"> <code>bottom</code> </a> , <em>y la </em><a href="height"> <code>height</code> </a> no se especifica o es <code>auto</code> m&aacute;tica o <code>100%</code> , se respetan las distancias <code>top</code> e <code>bottom</code> . En todas las dem&aacute;s situaciones, si la <a href="height"> <code>height</code> </a> est&aacute; restringida de alguna manera, la propiedad <code>top</code> tiene prioridad y la propiedad <code>bottom</code> se ignora.
ko: 두 경우 <code>top</code> 과 <a href="bottom"> <code>bottom</code> </a> 지정되어 <em>및 </em><a href="height"> <code>height</code> </a> 지정되지 않거나 중 하나 인 <code>auto</code> 또는 <code>100%</code> 양쪽, <code>top</code> 과 <code>bottom</code> 거리가 존중된다. 다른 모든 상황에서 <a href="height"> <code>height</code> </a> 가 어떤 식 으로든 제한되면 <code>top</code> 속성이 우선하고 <code>bottom</code> 속성은 무시됩니다.
zh_cn: 如果同时指定了 <code>top</code> 和<a href="bottom"> <code>bottom</code> </a>，<em>并且</em><a href="height"> <code>height</code> </a>未指定，或者为 <code>auto</code> 或 <code>100%</code> ，则将同时考虑到 <code>top</code> 和 <code>bottom</code> 的距离。在所有其他情况下，如果以任何方式限制<a href="height"> <code>height</code> </a>，则 <code>top</code> 属性优先，而 <code>bottom</code> 属性则被忽略。

source: When both quoted and unquoted user defined text values are permitted, the specification will list <code>&lt;custom-ident&gt; | &lt;string&gt;</code>, meaning quotes are optional, such as is the case with animation names:
ko: 인용 및 인용되지 않은 사용자 정의 텍스트 값이 모두 허용되면 사양에 <code>&lt;custom-ident&gt; | &lt;string&gt;</code> , 애니메이션 이름의 경우처럼 따옴표가 선택 사항임을 의미합니다.
zh_cn: 当允许使用引号和未引号的用户定义文本值时，规范将列出 <code>&lt;custom-ident&gt; | &lt;string&gt;</code> ，这意味着引号是可选的，例如动画名称的情况：

source: When browsers don't understand a CSS property or value, they ignore it. So we could start enhancing our layout by using CSS Grid. Browsers that do not support grid will ignore the <code>grid</code> value of the <code>display</code> property. Once a floated item becomes a grid item, the float is removed &mdash; something you can read more about in <a href="https://developer.mozilla.org/en-US/docs/Learn/CSS/CSS_layout/Supporting_Older_Browsers">Supporting Older Browsers</a>. Therefore the grid version should just overwrite the floated one.
ko: 브라우저가 CSS 속성이나 값을 이해하지 못하면 무시합니다. 따라서 CSS Grid를 사용하여 레이아웃을 향상시킬 수 있습니다. 그리드를 지원하지 않는 브라우저 는 <code>display</code> 속성 의 <code>grid</code> 값을 무시합니다 . 부동 항목이 그리드 항목이되면 부동 항목이 제거됩니다 . 자세한 내용은 <a href="https://developer.mozilla.org/en-US/docs/Learn/CSS/CSS_layout/Supporting_Older_Browsers">이전 브라우저 지원</a> 에서 확인할 수 있습니다 . 따라서 그리드 버전은 플로팅 된 버전을 덮어 써야합니다.
zh_cn: 当浏览器不了解CSS属性或值时，它们将忽略它。因此，我们可以开始使用CSS Grid来增强布局。不支持网格的浏览器将忽略 <code>display</code> 属性的 <code>grid</code> 值。一旦浮动项目变成网格项目，浮动项目就会被删除-您可以在<a href="https://developer.mozilla.org/en-US/docs/Learn/CSS/CSS_layout/Supporting_Older_Browsers">支持较旧的浏览器中</a>了解更多信息。因此，网格版本应仅覆盖浮动版本。

source: When can I use SVG Fonts?
es: ¿Cuándo puedo usar las fuentes del SVG?
ko: SVG 글꼴을 언제 사용할 수 있습니까?
zh_cn: 什么时候可以使用SVG字体?

source: When can I use WOFF?
es: ¿Cuándo puedo usar WOFF?
ko: 언제 WOFF를 사용할 수 있습니까?
zh_cn: 什么时候可以使用WOFF?

source: When cells are collapsed, the <a href="border-style"><code>border-style</code></a> value of <code>inset</code> behaves like <code>groove</code>, and <code>outset</code> behaves like <code>ridge</code>.
es: Cuando las celdas se contraen, el valor de <a href="border-style"> <code>border-style</code> </a> del <code>inset</code> comporta como un <code>groove</code> , y el <code>outset</code> comporta como un <code>ridge</code> .
ko: 세포가 축소되면, <a href="border-style"> <code>border-style</code> </a> 의 값이 <code>inset</code> 같은 동작합니다 <code>groove</code> 및 <code>outset</code> 처럼 동작합니다 <code>ridge</code> .
zh_cn: 当单元折叠时， <code>inset</code> 的<a href="border-style"> <code>border-style</code> </a>值的行为类似于 <code>groove</code> ，而 <code>outset</code> 的行为类似于 <code>ridge</code> 。

source: When cells are separated, the distance between cells is defined by the <a href="border-spacing"><code>border-spacing</code></a> property.
es: Cuando las celdas se separan, la distancia entre celdas se define mediante la propiedad de <a href="border-spacing"> <code>border-spacing</code> </a> .
ko: 셀이 분리되면 셀 간 거리는 <a href="border-spacing"> <code>border-spacing</code> </a> 속성으로 정의됩니다 .
zh_cn: 分隔单元格时，单元格之间的距离由<a href="border-spacing"> <code>border-spacing</code> </a>属性定义。
