Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/love/love.*.006.xlf
Languages: es, ja, ko, zh_cn

source: The pixel density inside the window might be greater (or smaller) than the "size" of the window. For example on a retina screen in Mac OS X with the <code>highdpi</code><a href="love.window.setmode">window flag</a> enabled, the window may take up the same physical size as an 800x600 window, but the area inside the window uses 1600x1200 pixels. <code>love.window.toPixels(800)</code> would return <code>1600</code> in that case.
es: La densidad de p&iacute;xeles dentro de la ventana puede ser mayor (o menor) que el "tama&ntilde;o" de la ventana. Por ejemplo, en una pantalla retina en Mac OS X con el <code>highdpi</code> <a href="love.window.setmode">ventana </a>highdpi habilitado, la ventana puede ocupar el mismo tama&ntilde;o f&iacute;sico que una ventana de 800x600, pero el &aacute;rea dentro de la ventana utiliza 1600x1200 p&iacute;xeles. <code>love.window.toPixels(800)</code> devolver&iacute;a <code>1600</code> en ese caso.
zh_cn: 窗口内的像素密度可能大于（或小于）窗口的&ldquo;大小&rdquo;。例如，在Mac OS X的视网膜屏幕上启用了 <code>highdpi</code> <a href="love.window.setmode">窗口标志的情况下</a>，该窗口可能会占用与800x600窗口相同的物理尺寸，但是窗口内部的区域使用1600x1200像素。在这种情况下， <code>love.window.toPixels(800)</code> 将返回 <code>1600</code> 。

source: The pixel effect code.
es: El código del efecto de los píxeles.
zh_cn: 像素效果代码。

source: The pixel grid is actually offset to the center of each pixel. So to get clean pixels drawn use 0.5 + integer increments.
es: La cuadrícula de píxeles está en realidad desplazada al centro de cada píxel.Así que para obtener píxeles limpios dibujados usa 0.5+incrementos de enteros.
zh_cn: 像素网格实际上是偏移到每个像素的中心。所以要想得到干净的像素绘制,使用0.5+整数增量。

source: The pixel scale factor associated with the window.
es: El factor de escala de píxeles asociado a la ventana.
zh_cn: 与窗口相关的像素比例因子。

source: The pixel shader code, or a filename pointing to a file with the code.
es: El código del sombreador de píxeles,o un nombre de archivo que apunta a un archivo con el código.
zh_cn: 像素着色器代码,或者指向包含该代码的文件的文件名。

source: The pixel shader or vertex shader code, or a filename pointing to a file with the code.
es: El código del sombreador de píxeles o del sombreador de vértices,o un nombre de archivo que apunta a un archivo con el código.
zh_cn: 像素着色器或顶点着色器代码,或指向包含该代码的文件的文件名。

source: The pixelcode and vertexcode arguments can be in any order.
es: Los argumentos del código de píxeles y del código de vértices pueden estar en cualquier orden.
zh_cn: pixelcode和vertexcode参数可以按任意顺序排列。

source: The platform-specific full path of the directory containing the filepath.
es: La ruta completa específica de la plataforma del directorio que contiene la ruta de archivo.
zh_cn: 包含文件路径的目录的平台专用完整路径。

source: The point on the body must given in local coordinates. Use <a href="body-getlinearvelocityfromworldpoint">Body:getLinearVelocityFromWorldPoint</a> to specify this with world coordinates.
es: El punto del cuerpo debe expresarse en coordenadas locales. Use <a href="body-getlinearvelocityfromworldpoint">Body: getLinearVelocityFromWorldPoint</a> para especificar esto con coordenadas mundiales.
zh_cn: 身体上的点必须以局部坐标给出。使用<a href="body-getlinearvelocityfromworldpoint">Body：getLinearVelocityFromWorldPoint</a>来指定世界坐标。

source: The point on the body must given in world coordinates. Use <a href="body-getlinearvelocityfromlocalpoint">Body:getLinearVelocityFromLocalPoint</a> to specify this with local coordinates.
es: El punto del cuerpo debe expresarse en coordenadas mundiales. Use <a href="body-getlinearvelocityfromlocalpoint">Body: getLinearVelocityFromLocalPoint</a> para especificar esto con coordenadas locales.
zh_cn: 身体上的点必须以世界坐标给出。使用<a href="body-getlinearvelocityfromlocalpoint">Body：getLinearVelocityFromLocalPoint</a>可以使用本地坐标进行指定。

source: The position along the x-axis of the touch-press inside the window, in pixels.
es: La posición a lo largo del eje X de la prensa de contacto dentro de la ventana,en píxeles.
zh_cn: 窗口内沿X轴的触控位置,单位为像素。

source: The position along the y-axis of the touch-press inside the window, in pixels.
es: La posición a lo largo del eje Y de la prensa de contacto dentro de la ventana,en píxeles.
zh_cn: 窗口内的触摸按钮沿y轴的位置,单位为像素。

source: The position of first point on the x-axis.
es: La posición del primer punto en el eje X.
zh_cn: X轴上第一个点的位置。

source: The position of first point on the y-axis.
es: La posición del primer punto en el eje Y.
zh_cn: Y轴上第一个点的位置。

source: The position of second point on the x-axis.
es: La posición del segundo punto en el eje X.
zh_cn: 第二点在X轴上的位置。

source: The position of second point on the y-axis.
es: La posición del segundo punto en el eje Y.
zh_cn: 第二点在Y轴上的位置。

source: The position of the bottom left corner along x-axis.
es: La posición de la esquina inferior izquierda a lo largo del eje X.
zh_cn: 左下角沿X轴的位置。

source: The position of the bottom left corner along y-axis.
es: La posición de la esquina inferior izquierda a lo largo del eje Y.
zh_cn: 左下角沿y轴的位置。

source: The position of the bottom right corner along x-axis.
es: La posición de la esquina inferior derecha a lo largo del eje X.
zh_cn: 沿X轴右下角的位置。

source: The position of the bottom right corner along y-axis.
es: La posición de la esquina inferior derecha a lo largo del eje Y.
zh_cn: 沿y轴右下角的位置。

source: The position of the center along x-axis.
es: La posición del centro a lo largo del eje X.
zh_cn: 中心沿X轴的位置。

source: The position of the center along y-axis.
es: La posición del centro a lo largo del eje Y.
zh_cn: 中心沿y轴的位置。

source: The position of the first point on the x-axis.
es: La posición del primer punto en el eje X.
zh_cn: X轴上第一个点的位置。

source: The position of the first point on the y-axis.
es: La posición del primer punto en el eje Y.
zh_cn: Y轴上第一个点的位置。

source: The position of the first vertex of the control polygon on the x-axis.
es: La posición del primer vértice del polígono de control en el eje X.
zh_cn: 控制多边形的第一个顶点在X轴上的位置。

source: The position of the first vertex of the control polygon on the y-axis.
es: La posición del primer vértice del polígono de control en el eje Y.
zh_cn: 控制多边形的第一个顶点在Y轴上的位置。

source: The position of the first vertex of the polygon on the x-axis.
es: La posición del primer vértice del polígono en el eje X.
zh_cn: 多边形的第一个顶点在X轴上的位置。

source: The position of the first vertex of the polygon on the y-axis.
es: La posición del primer vértice del polígono en el eje Y.
zh_cn: 多边形的第一个顶点在Y轴上的位置。

source: The position of the intersection on the ray as a number from 0 to 1 (or even higher if the ray length was changed with the return value).
es: La posición de la intersección en el rayo como un número de 0 a 1 (o incluso mayor si la longitud del rayo se cambió con el valor de retorno).
zh_cn: 交叉点在射线上的位置,从0到1的数字(如果射线长度随返回值改变,则更高)。

source: The position of the mouse along the x-axis.
es: La posición del ratón a lo largo del eje X.
zh_cn: 鼠标在X轴上的位置。

source: The position of the mouse along the y-axis.
es: La posición del ratón a lo largo del eje Y.
zh_cn: 鼠标在Y轴上的位置。

source: The position of the new text (x-axis).
es: La posición del nuevo texto (eje x).
zh_cn: 新文本的位置(X轴)。

source: The position of the new text (y-axis).
es: La posición del nuevo texto (eje y).
zh_cn: 新文本的位置(y轴)。

source: The position of the new text on the x-axis.
es: La posición del nuevo texto en el eje X.
zh_cn: 新文本在X轴上的位置。

source: The position of the new text on the y-axis.
es: La posición del nuevo texto en el eje Y.
zh_cn: 新文本在Y轴上的位置。

source: The position of the pixel on the x-axis.
es: La posición del píxel en el eje X.
zh_cn: 像素在X轴上的位置。

source: The position of the pixel on the y-axis.
es: La posición del píxel en el eje Y.
zh_cn: 像素在Y轴上的位置。

source: The position of the sample (0 means first sample).
es: La posición de la muestra (0 significa primera muestra).
zh_cn: 样品的位置(0表示第一个样品)。

source: The position of the second vertex of the control polygon on the x-axis.
es: La posición del segundo vértice del polígono de control en el eje X.
zh_cn: 控制多边形的第二个顶点在X轴上的位置。

source: The position of the second vertex of the control polygon on the y-axis.
es: La posición del segundo vértice del polígono de control en el eje Y.
zh_cn: 控制多边形的第二个顶点在Y轴上的位置。

source: The position of the second vertex of the polygon on the x-axis.
es: La posición del segundo vértice del polígono en el eje X.
zh_cn: 多边形的第二个顶点在X轴上的位置。

source: The position of the second vertex of the polygon on the y-axis.
es: La posición del segundo vértice del polígono en el eje Y.
zh_cn: 多边形的第二个顶点在Y轴上的位置。

source: The position of the text (x-axis).
es: La posición del texto (eje x).
zh_cn: 文本的位置(x轴)。

source: The position of the text (y-axis).
es: La posición del texto (eje y).
zh_cn: 文本的位置(y轴)。

source: The position of the text on the x-axis.
es: La posición del texto en el eje X.
zh_cn: 文本在X轴上的位置。

source: The position of the text on the y-axis.
es: La posición del texto en el eje Y.
zh_cn: 文本在Y轴上的位置。

source: The position of the third vertex of the control polygon on the x-axis.
es: La posición del tercer vértice del polígono de control en el eje X.
zh_cn: 控制多边形的第三个顶点在X轴上的位置。

source: The position of the third vertex of the control polygon on the y-axis.
es: La posición del tercer vértice del polígono de control en el eje Y.
zh_cn: 控制多边形的第三个顶点在Y轴上的位置。

source: The position of the third vertex of the polygon on the x-axis.
es: La posición del tercer vértice del polígono en el eje X.
zh_cn: 多边形的第三个顶点在X轴上的位置。

source: The position of the third vertex of the polygon on the y-axis.
es: La posición del tercer vértice del polígono en el eje Y.
zh_cn: 多边形的第三个顶点在Y轴上的位置。

source: The position of the top left corner along x-axis.
es: La posición de la esquina superior izquierda a lo largo del eje X.
zh_cn: 左上角沿X轴的位置。

source: The position of the top left corner along y-axis.
es: La posición de la esquina superior izquierda a lo largo del eje Y.
zh_cn: 左上角沿y轴的位置。

source: The position of the top right corner along x-axis.
es: La posición de la esquina superior derecha a lo largo del eje X.
zh_cn: 沿X轴的右上角位置。

source: The position of the top right corner along y-axis.
es: La posición de la esquina superior derecha a lo largo del eje Y.
zh_cn: 右上角沿y轴的位置。

source: The position of the vertex on the x-axis.
es: La posición del vértice en el eje X.
zh_cn: 顶点在X轴上的位置。

source: The position of the vertex on the y-axis.
es: La posición del vértice en el eje Y.
zh_cn: 顶点在Y轴上的位置。

source: The position of third point on the x-axis.
es: La posición del tercer punto en el eje X.
zh_cn: 第三点在X轴上的位置。

source: The position of third point on the y-axis.
es: La posición del tercer punto en el eje Y.
zh_cn: 第三点在y轴上的位置。

source: The position of top-left corner along the x-axis.
es: La posición de la esquina superior izquierda a lo largo del eje X.
zh_cn: 左上角沿X轴的位置。

source: The position of top-left corner along the y-axis.
es: La posición de la esquina superior izquierda a lo largo del eje Y.
zh_cn: 左上角沿y轴的位置。

source: The position on the input line where the intersection happened as a factor of the line length.
es: La posición en la línea de entrada donde se produjo la intersección como factor de la longitud de la línea.
zh_cn: 输入线上发生交集的位置,作为线长的系数。

source: The position on the x-axis.
es: La posición en el eje X.
zh_cn: X轴上的位置。

source: The position on the y-axis.
es: La posición en el eje Y.
zh_cn: Y轴上的位置。

source: The position to draw the object (x-axis).
es: La posición para dibujar el objeto (eje x).
zh_cn: 绘制对象的位置(X轴)。

source: The position to draw the object (y-axis).
es: La posición para dibujar el objeto (eje y).
zh_cn: 绘制对象的位置(Y轴)。

source: The position to seek to
es: La posición de buscar
zh_cn: 寻求的立场

source: The position to seek to.
es: La posición para buscar.
zh_cn: 位,以谋求。

source: The pre-transformed position of the vertex. Used as the <code>vertex_position</code> argument to the <a href="love.graphics.newshader#Vertex_Shader_Function">vertex shader position</a> function. The third and fourth components of the vector are normally (0, 1).
es: La posici&oacute;n pretransformada del v&eacute;rtice. Se utiliza como argumento <code>vertex_position</code> para la funci&oacute;n de <a href="love.graphics.newshader#Vertex_Shader_Function">posici&oacute;n del sombreador de v&eacute;rtices</a> . Los componentes tercero y cuarto del vector son normalmente (0, 1).
zh_cn: 顶点的预变换位置。用作<a href="love.graphics.newshader#Vertex_Shader_Function">顶点着色器位置</a>函数的 <code>vertex_position</code> 参数。向量的第三和第四分量通常为（0，1）。

source: The pressure of the touch-press. Most touch screens aren't pressure sensitive, in which case the pressure will be 1.
es: La presión de la prensa de tacto.La mayoría de las pantallas táctiles no son sensibles a la presión,en cuyo caso la presión será 1.
zh_cn: 触摸按压的压力。大多数触摸屏对压力不敏感,在这种情况下,压力将是1。

source: The primary responsibility for the love.graphics module is the drawing of lines, shapes, text, <a href="image">Images</a> and other <a href="drawable">Drawable</a> objects onto the screen. Its secondary responsibilities include loading external files (including <a href="image">Images</a> and <a href="font">Fonts</a>) into memory, creating specialized objects (such as <a href="particlesystem">ParticleSystems</a> or <a href="canvas">Canvases</a>) and managing screen geometry.
es: La responsabilidad principal del m&oacute;dulo love.graphics es el dibujo de l&iacute;neas, formas, texto, <a href="image">im&aacute;genes</a> y otros objetos <a href="drawable">dibujables</a> en la pantalla. Sus responsabilidades secundarias incluyen cargar archivos externos (incluidas <a href="image">im&aacute;genes</a> y <a href="font">fuentes</a> ) en la memoria, crear objetos especializados (como <a href="particlesystem">ParticleSystems</a> o <a href="canvas">Canvases</a> ) y administrar la geometr&iacute;a de la pantalla.
zh_cn: love.graphics模块的主要职责是在屏幕上绘制线条，形状，文本，<a href="image">图像</a>和其他<a href="drawable">Drawable</a>对象。它的次要职责包括将外部文件（包括<a href="image">Images</a>和<a href="font">Fonts</a>）加载到内存中，创建专门的对象（例如<a href="particlesystem">ParticleSystems</a>或<a href="canvas">Canvases</a>）以及管理屏幕几何形状。

source: The printscreen key on an American layout.
es: La llave de la pantalla de impresión en un diseño americano.
zh_cn: 美式布局上的指纹屏键。

source: The program exit status to use when closing the application.
es: El estado de salida del programa para usar al cerrar la aplicación.
zh_cn: 关闭应用程序时要使用的程序退出状态。

source: The pseudo-random integer number.
es: El número entero pseudo-aleatorio.
zh_cn: 伪随机整数。

source: The pseudo-random number.
es: El número pseudo-aleatorio.
zh_cn: 伪随机数。

source: The pulley joint simulates a pulley with an optional block and tackle. If the ratio parameter has a value different from one, then the simulated rope extends faster on one side than the other. In a pulley joint the total length of the simulated rope is the constant
es: La articulación de la polea simula una polea con un bloque y aparejo opcional.Si el parámetro de relación tiene un valor diferente de uno,entonces la cuerda simulada se extiende más rápido en un lado que en el otro.En una junta de polea la longitud total de la cuerda simulada es la constante
zh_cn: 滑轮接头模拟一个带可选滑块和滑轮的滑轮。如果比率参数的值与1不同,那么模拟绳的一侧延伸速度就会比另一侧快。在滑轮接头中,模拟绳索的总长度为常数。

source: The pulley ratio of the joint.
es: La relación de la polea de la articulación.
zh_cn: 接头的滑轮比。

source: The purpose of a Quad is to use a fraction of an image to draw objects, as opposed to drawing entire image. It is most useful for sprite sheets and atlases: in a sprite atlas, multiple sprites reside in same image, quad is used to draw a specific sprite from that image; in animated sprites with all frames residing in the same image, quad is used to draw specific frame from the animation.
es: El propósito de un Quad es utilizar una fracción de una imagen para dibujar objetos,a diferencia de dibujar una imagen completa.Es más útil para hojas de sprites y atlas:en un atlas de sprites,múltiples sprites residen en la misma imagen,el quad se usa para dibujar un sprite específico de esa imagen;en sprites animados con todos los marcos residiendo en la misma imagen,el quad se usa para dibujar un marco específico de la animación.
zh_cn: 四边形的目的是使用图像的一小部分来绘制对象,而不是绘制整个图像。它对精灵图谱和精灵表最有用:在精灵图谱中,多个精灵驻留在同一图像中,quad用于从该图像中绘制特定的精灵;在动画精灵中,所有帧都驻留在同一图像中,quad用于从动画中绘制特定帧。

source: The quad to draw on screen.
es: El cuaderno para dibujar en la pantalla.
zh_cn: 四方来在屏幕上画。

source: The quad used on the image of the batch.
es: El cuadrante usado en la imagen del lote.
zh_cn: 批的图像上使用的四。

source: The quit event is a signal for the event handler to close L&Ouml;VE. It's possible to abort the exit process with the <a href="love.quit">love.quit</a> callback.
es: El evento de salida es una se&ntilde;al para que el controlador de eventos cierre L&Ouml;VE. Es posible abortar el proceso de salida con la <a href="love.quit">devoluci&oacute;n de</a> llamada love.quit .
zh_cn: quit事件是事件处理程序关闭L&Ouml;VE的信号。可以使用<a href="love.quit">love.quit</a>回调中止退出过程。

source: The radius of the circle
es: El radio del círculo
zh_cn: 圆的半径

source: The radius of the circle.
es: El radio del círculo.
zh_cn: 圆的半径。

source: The radius of the ellipse along the x-axis (half the ellipse's width.)
es: El radio de la elipse a lo largo del eje x (la mitad del ancho de la elipse).
zh_cn: 椭圆沿X轴的半径(椭圆宽度的一半)。

source: The radius of the ellipse along the y-axis (half the ellipse's height.)
es: El radio de la elipse a lo largo del eje Y (la mitad de la altura de la elipse).
zh_cn: 椭圆沿y轴的半径(椭圆高度的一半)。

source: The radius of the shape.
es: El radio de la forma.
zh_cn: 形状的半径。

source: The rasterizer.
es: El rasterizador.
zh_cn: 该光栅化器。

source: The ratio of the joint.
es: La proporción de la articulación.
zh_cn: 合的比例。

source: The raw (un-compressed) string to compress.
es: La cuerda cruda (no comprimida)para comprimir.
zh_cn: 要压缩的原始(未压缩)字符串。

source: The raw ImageData to encode.
es: Los datos de imagen en bruto para codificar.
zh_cn: 要编码的原始ImageData。

source: The raw data.
es: Los datos en bruto.
zh_cn: 原始数据。

source: The raw un-transformed position of the current vertex.
es: La posición cruda no transformada del vértice actual.
zh_cn: 当前顶点未变换的原始位置。

source: The ray can be controlled with the return value. A positive value sets a new ray length where 1 is the default value. A value of 0 terminates the ray. If the callback function returns -1, the intersection gets ignored as if it didn't happen.
es: El rayo puede ser controlado con el valor de retorno.Un valor positivo establece una nueva longitud de rayo donde 1 es el valor por defecto.Un valor de 0 termina el rayo.Si la función de retorno devuelve -1,la intersección se ignora como si no hubiera ocurrido.
zh_cn: 可以用返回值控制射线的长度。正值设置一个新的射线长度,其中1是默认值。值为0则终止该射线。如果回调函数返回-1,交点将被忽略,就像没有发生一样。

source: The ray starts on the first point of the input line and goes towards the second point of the line. The fifth argument is the maximum distance the ray is going to travel as a scale factor of the input line length.
es: El rayo comienza en el primer punto de la línea de entrada y va hacia el segundo punto de la línea.El quinto argumento es la máxima distancia que la semirrecta va a recorrer como factor de escala de la longitud de la línea de entrada.
zh_cn: 射线从输入线的第一点开始,向第二点前进。第五个参数是射线要走的最大距离,作为输入线长度的比例系数。

source: The ray starts on the first point of the input line and goes towards the second point of the line. The fourth argument is the maximum distance the ray is going to travel as a scale factor of the input line length.
es: El rayo comienza en el primer punto de la línea de entrada y va hacia el segundo punto de la línea.El cuarto argumento es la máxima distancia que la semirrecta va a recorrer como factor de escala de la longitud de la línea de entrada.
zh_cn: 射线从输入线的第一点开始,向第二点前进。第四个参数是射线要走的最大距离,作为输入线长度的比例系数。

source: The reaction torque on the second body.
es: El par de reacción en el segundo cuerpo.
zh_cn: 第二体上的反作用力矩。

source: The red channel of the color to clear the screen to.
es: El canal rojo del color para despejar la pantalla.
zh_cn: 色的红色通道进行清屏,以。

source: The red channel of the converted color in gamma sRGB space.
es: El canal rojo del color convertido en el espacio gamma sRGB.
zh_cn: 伽玛sRGB空间中转换后的红色通道。

source: The red channel of the converted color in linear RGB space.
es: El canal rojo del color convertido en el espacio lineal RGB.
zh_cn: 线性RGB空间中转换颜色的红色通道。

source: The red channel of the linear RGB color to convert.
es: El canal rojo del color RGB lineal a convertir.
zh_cn: 要转换的线性RGB颜色的红色通道。

source: The red channel of the sRGB color to convert.
es: El canal rojo del color sRGB a convertir.
zh_cn: 要转换的sRGB颜色的红色通道。

source: The red color component.
es: El componente de color rojo.
zh_cn: 红色的颜色分量。

source: The red component (0-255).
es: El componente rojo (0-255).
zh_cn: 红色分量(0-255)。

source: The red component of the vertex color.
es: El componente rojo del color del vértice.
zh_cn: 顶点颜色的红色分量。

source: The red component of the vertex's color.
es: El componente rojo del color del vértice.
zh_cn: 顶点颜色的红色分量。

source: The reference angle between body1 and body2, in radians.
es: El ángulo de referencia entre el cuerpo1 y el cuerpo2,en radianes.
zh_cn: 车体1和车体2之间的参考角,弧度。

source: The reference distance.
es: La distancia de referencia.
zh_cn: 参考距离。

source: The reference height, the height of the <a href="image">Image</a>. (Must be greater than 0.)
es: La altura de referencia, la altura de la <a href="image">imagen</a> . (Debe ser mayor que 0.)
zh_cn: 参考高度，即<a href="image">Image</a>的高度。（必须大于0。）

source: The reference width, the width of the <a href="image">Image</a>. (Must be greater than 0.)
es: El ancho de referencia, el ancho de la <a href="image">imagen</a> . (Debe ser mayor que 0.)
zh_cn: 参考宽度，即<a href="image">Image</a>的宽度。（必须大于0。）

source: The refresh rate of the screen's current display mode, in Hz. May be 0 if the value can't be determined. Added in <a href="https://love2d.org/wiki/0.9.2">0.9.2</a>.
es: La frecuencia de actualizaci&oacute;n del modo de visualizaci&oacute;n actual de la pantalla, en Hz. Puede ser 0 si no se puede determinar el valor. Agregado en <a href="https://love2d.org/wiki/0.9.2">0.9.2</a> .
zh_cn: 屏幕当前显示模式的刷新率，以Hz为单位。如果无法确定该值，则可以为0。在<a href="https://love2d.org/wiki/0.9.2">0.9.2中</a>添加。

source: The regular single- and two-channel formats (<code>r8</code> and <code>rg8</code>), as well as the <code>srgb</code> format, are supported on desktop graphics cards capable of OpenGL 3+ / DirectX 10+ (nvidia GeForce 8000 series and up, ATI/AMD HD 2000 series and up, and the Intel HD 2000 and up), and mobile GPUs capable of OpenGL ES 3.
es: Los formatos habituales de uno y dos canales ( <code>r8</code> y <code>rg8</code> ), as&iacute; como el formato <code>srgb</code> , son compatibles con tarjetas gr&aacute;ficas de escritorio compatibles con OpenGL 3+ / DirectX 10+ (nvidia GeForce 8000 series y posteriores, ATI / AMD HD 2000 series y posteriores, e Intel HD 2000 y posteriores) y GPU m&oacute;viles compatibles con OpenGL ES 3.
zh_cn: 支持OpenGL 3+ / DirectX 10+的台式机图形卡（NVIDIA GeForce 8000系列及更高版本，ATI / AMD HD 2000）支持常规的单通道和两通道格式（ <code>r8</code> 和 <code>rg8</code> ）以及 <code>srgb</code> 格式。系列及更高版本，以及Intel HD 2000及更高版本），以及支持OpenGL ES 3的移动GPU。

source: The repeat factor.
es: El factor de repetición.
zh_cn: 重复系数;

source: The reported position of the mouse is not updated while relative mode is enabled, even when relative mouse <a href="love.mousemoved">motion events</a> are generated.
es: La posici&oacute;n informada del mouse no se actualiza mientras el modo relativo est&aacute; habilitado, incluso cuando se generan <a href="love.mousemoved">eventos de movimiento</a> relativo del mouse .
zh_cn: 启用相对模式时，即使已生成相对鼠标<a href="love.mousemoved">移动事件</a>，也不会更新报告的鼠标位置。
