Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/love/love.*.006.xlf
Languages: es, ja, ko, zh_cn

source: The x position of the point.
es: La posición x del punto.
zh_cn: 该点的X位置。

source: The x position of the second anchor point (local space body 2).
es: La posición x del segundo punto de anclaje (cuerpo espacial local 2).
zh_cn: 第二锚点(局部空间体2)的x位置。

source: The x position of the second anchor point.
es: La posición x del segundo punto de anclaje.
zh_cn: 第二锚点的x位置。

source: The x position of the second point.
es: La posición x del segundo punto.
zh_cn: 第二点的x位置。

source: The x position of the starting point of the ray.
es: La posición x del punto de inicio del rayo.
zh_cn: 射线起始点的X位置。

source: The x position of the third point.
es: La posición x del tercer punto.
zh_cn: 第三点的x位置。

source: The x position of the top-left point.
es: La posición X del punto superior izquierdo.
zh_cn: 左上角点的x位置。

source: The x position to apply the force.
es: La posición x para aplicar la fuerza.
zh_cn: 施力的X位置。

source: The x position to apply the impulse.
es: La posición x para aplicar el impulso.
zh_cn: 应用冲量的X位置。

source: The x position to measure velocity.
es: La posición x para medir la velocidad.
zh_cn: 测量速度的X位置。

source: The x position.
es: La posición X.
zh_cn: X的位置。

source: The x postition of the center of mass.
es: La posición X del centro de masa.
zh_cn: 质量中心的x姿态。

source: The x value of the surface normal vector of the shape edge.
es: El valor x del vector normal de la superficie del borde de la forma.
zh_cn: 形状边缘的表面法向量的x值。

source: The x-axis coordinate of the world-space axis vector.
es: La coordenada del eje X del vector del eje mundial-espacial.
zh_cn: 世界-空间轴向量的x轴坐标。

source: The x-axis movement of the touch inside the window, in pixels.
es: El movimiento del eje X del tacto dentro de la ventana,en píxeles.
zh_cn: 窗口内触摸的X轴移动,单位为像素。

source: The x-axis movement of the touch press inside the window, in pixels. This should always be zero.
es: El movimiento del eje X del tacto se presiona dentro de la ventana,en píxeles.Esto siempre debería ser cero.
zh_cn: 窗口内触摸按钮的X轴移动,单位为像素。该值应始终为零。

source: The x-axis of the left thumbstick.
es: El eje X del pulgar izquierdo.
zh_cn: 左手拇指杆的X轴。

source: The x-axis of the right thumbstick.
es: El eje X del pulgar derecho.
zh_cn: 右拇指杆的X轴。

source: The x-axis of the top-left corner of the area within the Canvas to capture.
es: El eje X de la esquina superior izquierda del área dentro del lienzo a capturar.
zh_cn: 捕捉Canvas内左上角区域的X轴。

source: The x-axis of the top-left corner of the area within the Image to reload.
es: El eje X de la esquina superior izquierda del área dentro de la Imagen para recargar.
zh_cn: 要重新加载的图像内的左上角区域的X轴。

source: The x-axis of the top-left corner of the area within the ImageData to apply the function to.
es: El eje X de la esquina superior izquierda del área dentro de los Datos de Imagen para aplicar la función.
zh_cn: ImageData中要应用函数的左上角区域的x轴。

source: The x-axis position of the touch inside the window, in pixels.
es: La posición del eje X del tacto dentro de la ventana,en píxeles.
zh_cn: 窗口内触摸的X轴位置,单位为像素。

source: The x-axis position of the touch press inside the window, in pixels.
es: La posición del eje X de la prensa táctil dentro de la ventana,en píxeles.
zh_cn: 窗口内触控按钮的X轴位置,单位为像素。

source: The x-axis radius of each round corner. Cannot be greater than half the rectangle's width.
es: El radio del eje X de cada esquina redonda.No puede ser mayor que la mitad del ancho del rectángulo.
zh_cn: 每个圆角的X轴半径。不能大于矩形宽度的一半。

source: The x-axis value of a coordinate in density-independent units to convert to pixels.
es: El valor del eje x de una coordenada en unidades independientes de la densidad para convertirla en píxeles.
zh_cn: 坐标的X轴值,以密度无关的单位转换为像素。

source: The x-axis value of a coordinate in pixels.
es: El valor del eje x de una coordenada en píxeles.
zh_cn: 坐标的X轴值,单位为像素。

source: The x-component of the anchor on Body 1.
es: El componente X del ancla del Cuerpo 1.
zh_cn: 体1上锚的X分量。

source: The x-component of the anchor on Body 2.
es: El componente X del ancla del Cuerpo 2.
zh_cn: 体2上锚的X分量。

source: The x-component of the center of mass in local coordinates.
es: El componente X del centro de masa en coordenadas locales.
zh_cn: 局部坐标中质心的x分量。

source: The x-component of the center point of the circle.
es: El componente X del punto central del círculo.
zh_cn: 圆的中心点的x分量。

source: The x-component of the first endpoint.
es: El componente X del primer punto final.
zh_cn: 第一个端点的x分量。

source: The x-component of the first vertex, bottom-left.
es: El componente X del primer vértice,abajo a la izquierda.
zh_cn: 第一顶点的x分量,左下角。

source: The x-component of the first vertex.
es: El componente X del primer vértice.
zh_cn: 第一个顶点的x分量。

source: The x-component of the force.
es: El componente X de la fuerza.
zh_cn: 力的x分量。

source: The x-component of the fourth vertex, bottom-right.
es: El componente X del cuarto vértice,abajo a la derecha.
zh_cn: 第四顶点的x分量,右下角。

source: The x-component of the new center point of the circle.
es: El componente X del nuevo punto central del círculo.
zh_cn: 圆的新中心点的x分量。

source: The x-component of the point.
es: El componente X del punto.
zh_cn: 点的x分量。

source: The x-component of the second endpoint.
es: El componente X del segundo punto final.
zh_cn: 第二端点的x分量。

source: The x-component of the second vertex, top-left.
es: El componente X del segundo vértice,arriba a la izquierda.
zh_cn: 第二顶点的x分量,左上角。

source: The x-component of the second vertex.
es: El componente X del segundo vértice.
zh_cn: 第二个顶点的x分量。

source: The x-component of the surface normal.
es: El componente X de la superficie es normal.
zh_cn: 表面法线的x分量。

source: The x-component of the target.
es: El componente X del objetivo.
zh_cn: 目标的X分量。

source: The x-component of the third vertex, top-right.
es: El componente X del tercer vértice,arriba a la derecha.
zh_cn: 第三顶点的x分量,右上角。

source: The x-component of the top-left point of the box.
es: El componente X del punto superior izquierdo de la caja.
zh_cn: 盒子左上角的x分量。

source: The x-component of the velocity vector
es: El componente x del vector de velocidad
zh_cn: 速度矢量的x分量。

source: The x-component of the velocity vector.
es: El componente X del vector de velocidad.
zh_cn: 速度矢量的x分量。

source: The x-component of the vertex, or nil if <a href="chainshape-setnextvertex">ChainShape:setNextVertex</a> hasn't been called.
es: El componente x del v&eacute;rtice, o nil si no se ha llamado a <a href="chainshape-setnextvertex">ChainShape: setNextVertex</a> .
zh_cn: 顶点的x分量；如果未调用<a href="chainshape-setnextvertex">ChainShape：setNextVertex，则为</a> nil 。

source: The x-component of the vertex, or nil if <a href="chainshape-setpreviousvertex">ChainShape:setPreviousVertex</a> hasn't been called.
es: El componente x del v&eacute;rtice, o nil si no se ha llamado a <a href="chainshape-setpreviousvertex">ChainShape: setPreviousVertex</a> .
zh_cn: 顶点的x分量；如果未调用<a href="chainshape-setpreviousvertex">ChainShape：setPreviousVertex，则为</a> nil 。

source: The x-component of the vertex, or nil if <a href="edgeshape-setnextvertex">EdgeShape:setNextVertex</a> hasn't been called.
es: El componente x del v&eacute;rtice, o nil si no se ha llamado a <a href="edgeshape-setnextvertex">EdgeShape: setNextVertex</a> .
zh_cn: 顶点的x分量；如果尚未调用<a href="edgeshape-setnextvertex">EdgeShape：setNextVertex，则为</a> nil 。

source: The x-component of the vertex, or nil if <a href="edgeshape-setpreviousvertex">EdgeShape:setPreviousVertex</a> hasn't been called.
es: El componente x del v&eacute;rtice, o nulo si no se ha llamado a <a href="edgeshape-setpreviousvertex">EdgeShape: setPreviousVertex</a> .
zh_cn: 顶点的x分量；如果尚未调用<a href="edgeshape-setpreviousvertex">EdgeShape：setPreviousVertex，则为</a> nil 。

source: The x-component of the vertex.
es: El componente X del vértice.
zh_cn: 顶点的x分量。

source: The x-coordinate in the ImageData of the cursor's hot spot.
es: La coordenada x en los datos de imagen del punto caliente del cursor.
zh_cn: 光标热点在ImageData中的X坐标。

source: The x-coordinate in the image of the cursor's hot spot.
es: La coordenada x en la imagen del punto caliente del cursor.
zh_cn: 光标热点图像中的X坐标。

source: The x-coordinate of the first point.
es: La coordenada X del primer punto.
zh_cn: 第一个点的X坐标。

source: The x-coordinate of the point.
es: La coordenada X del punto.
zh_cn: 该点的X坐标。

source: The x-coordinate of the second point.
es: La coordenada X del segundo punto.
zh_cn: 第二点的X坐标。

source: The x-coordinate of the upper left corner of the rectangle to intersect with the existing scissor rectangle.
es: La coordenada X de la esquina superior izquierda del rectángulo para intersectar con el rectángulo de tijera existente.
zh_cn: 矩形的左上角与现有的剪刀形矩形相交的X坐标。

source: The x-coordinate of the window's position in its current display. Added in <a href="https://love2d.org/wiki/0.9.2">0.9.2</a>.
es: La coordenada x de la posici&oacute;n de la ventana en su visualizaci&oacute;n actual. Agregado en <a href="https://love2d.org/wiki/0.9.2">0.9.2</a> .
zh_cn: 窗口当前显示位置的x坐标。在<a href="https://love2d.org/wiki/0.9.2">0.9.2中</a>添加。

source: The x-coordinate of the window's position in the specified display. Added in <a href="https://love2d.org/wiki/0.9.2">0.9.2</a>.
es: La coordenada x de la posici&oacute;n de la ventana en la pantalla especificada. Agregado en <a href="https://love2d.org/wiki/0.9.2">0.9.2</a> .
zh_cn: 指定显示中窗口位置的x坐标。在<a href="https://love2d.org/wiki/0.9.2">0.9.2中</a>添加。

source: The x-coordinate of the window's position.
es: La coordenada X de la posición de la ventana.
zh_cn: 窗口位置的X坐标。

source: The y component of force to apply to the center of mass.
es: El componente y de la fuerza que se aplica al centro de la masa.
zh_cn: 施加在质心上的力的y分量。

source: The y component of force to apply.
es: El componente y de la fuerza a aplicar.
zh_cn: 施力的Y分量。

source: The y component of gravity.
es: El componente y de la gravedad.
zh_cn: 重力的y分量。

source: The y component of the impulse applied to the center of mass.
es: El componente y del impulso aplicado al centro de la masa.
zh_cn: 施加在质心上的冲量的y分量。

source: The y component of the impulse.
es: El componente y del impulso.
zh_cn: 冲量的y分量。

source: The y component of the new origin with respect to the old origin.
es: El componente y del nuevo origen con respecto al antiguo.
zh_cn: 新原点相对于旧原点的y分量。

source: The y component of the normal vector of the edge where the ray hit the shape.
es: El componente "y" del vector normal del borde donde el rayo golpeó la forma.
zh_cn: 射线击中形状的边缘的法向量的y分量。

source: The y component of the normal vector.
es: El componente y del vector normal.
zh_cn: 法向量的y分量。

source: The y component of the target linear offset, relative to the first Body.
es: El componente y del desplazamiento lineal del objetivo,relativo al primer Cuerpo.
zh_cn: 目标线性偏移量的y分量,相对于第一个主体。

source: The y component of the velocity vector.
es: La componente y del vector de velocidad.
zh_cn: 速度矢量的y分量。

source: The y component of velocity at point (x,y).
es: El componente y de la velocidad en el punto (x,y).
zh_cn: 在(x,y)点的速度的y分量。

source: The y coordinate of the anchor point.
es: La coordenada y del punto de anclaje.
zh_cn: 锚点的Y坐标。

source: The y coordinate of the axis unit vector.
es: La coordenada y del vector de la unidad del eje.
zh_cn: 轴单位向量的Y坐标。

source: The y coordinate of the axis vector.
es: La coordenada y del vector del eje.
zh_cn: 轴向量的Y坐标。

source: The y coordinate of the center of mass.
es: La coordenada y del centro de masa.
zh_cn: 质量中心的Y坐标。

source: The y coordinate of the contact point.
es: La coordenada y del punto de contacto.
zh_cn: 接触点的Y坐标。

source: The y coordinate of the first anchor point.
es: La coordenada y del primer punto de anclaje.
zh_cn: 第一个锚点的Y坐标。

source: The y coordinate of the first anchor.
es: La coordenada y del primer ancla.
zh_cn: 第一个锚点的Y坐标。

source: The y coordinate of the first body's ground anchor.
es: La coordenada y del anclaje en tierra del primer cuerpo.
zh_cn: 第一个体的地锚的y坐标。

source: The y coordinate of the first contact point.
es: La coordenada y del primer punto de contacto.
zh_cn: 第一个接触点的Y坐标。

source: The y coordinate of the particle image's draw offset.
es: La coordenada y de la imagen de la partícula dibuja un desplazamiento.
zh_cn: 绘制偏移量的Y坐标。

source: The y coordinate of the pulley joint anchor in the first body.
es: La coordenada "y" de la articulación de la polea se ancla en el primer cuerpo.
zh_cn: 第一主体中滑轮接头锚的y坐标。

source: The y coordinate of the pulley joint anchor in the second body.
es: La coordenada "y" de la articulación de la polea se ancla en el segundo cuerpo.
zh_cn: 第二主体中滑轮接头锚的y坐标。

source: The y coordinate of the rotation offset.
es: La coordenada y del desplazamiento de la rotación.
zh_cn: 旋转偏移量的Y坐标。

source: The y coordinate of the second anchor point.
es: La coordenada y del segundo punto de anclaje.
zh_cn: 第二个锚点的y坐标。

source: The y coordinate of the second anchor.
es: La coordenada y del segundo ancla.
zh_cn: 第二个锚点的Y坐标。

source: The y coordinate of the second body's ground anchor.
es: La coordenada y del anclaje en tierra del segundo cuerpo.
zh_cn: 第二个体的地锚的y坐标。

source: The y coordinate of the second contact point.
es: La coordenada y del segundo punto de contacto.
zh_cn: 第二接触点的y坐标。

source: The y offset of the circle.
es: El desplazamiento y del círculo.
zh_cn: 圆的Y偏移量。

source: The y position in local coordinates.
es: La posición y en coordenadas locales.
zh_cn: 本地坐标的Y位置。

source: The y position in world coordinates.
es: La posición y en coordenadas mundiales.
zh_cn: 世界坐标中的Y位置。

source: The y position of the anchor point (world space).
es: La posición y del punto de anclaje (espacio mundial).
zh_cn: 锚点的y位置(世界空间)。

source: The y position of the anchor point.
es: La posición y del punto de anclaje.
zh_cn: 锚点的Y位置。

source: The y position of the axis unit vector.
es: La posición y del vector de la unidad del eje.
zh_cn: 轴单位向量的Y位置。

source: The y position of the body.
es: La posición "y" del cuerpo.
zh_cn: 身体的y位。

source: The y position of the bottom-right point.
es: La posición y del punto inferior derecho.
zh_cn: 右下角点的y位置。

source: The y position of the center of mass.
es: La posición y del centro de masa.
zh_cn: 质量中心的y位置。

source: The y position of the circle in local coordinates.
es: La posición y del círculo en coordenadas locales.
zh_cn: 圓的Y位置,以局部座標表示。

source: The y position of the circle in world coordinates.
es: La posición y del círculo en las coordenadas del mundo.
zh_cn: 圓的世界座標Y位置。

source: The y position of the circle.
es: La posición y del círculo.
zh_cn: 圆的y位置。

source: The y position of the connecting point.
es: La posición y del punto de conexión.
zh_cn: 连接点的Y位置。

source: The y position of the end point of the ray.
es: La posición y del punto final del rayo.
zh_cn: 射线端点的Y位置。

source: The y position of the first anchor point (local space body 1).
es: La posición y del primer punto de anclaje (cuerpo espacial local 1).
zh_cn: 第一个锚点(局部空间体1)的y位置。

source: The y position of the first anchor point.
es: La posición y del primer punto de anclaje.
zh_cn: 第一个锚点的Y位置。

source: The y position of the first point.
es: La posición y del primer punto.
zh_cn: 第一个点的y位置。

source: The y position of the input line end point.
es: La posición y del punto final de la línea de entrada.
zh_cn: 输入线端点的Y位置。

source: The y position of the input line starting point.
es: La posición y del punto de partida de la línea de entrada.
zh_cn: 输入线起点的Y位置。

source: The y position of the intersection point.
es: La posición y del punto de intersección.
zh_cn: 交叉点的Y位置。

source: The y position of the listener.
es: La posición y del oyente.
zh_cn: 倾听者的Y位置。

source: The y position of the point.
es: La posición y del punto.
zh_cn: 该点的Y位置。

source: The y position of the second anchor point (local space body 2).
es: La posición y del segundo punto de anclaje (cuerpo espacial local 2).
zh_cn: 第二锚点(局部空间体2)的y位置。

source: The y position of the second anchor point.
es: La posición y del segundo punto de anclaje.
zh_cn: 第二个锚点的y位置。

source: The y position of the second point.
es: La posición y del segundo punto.
zh_cn: 第二点的y位置。

source: The y position of the starting point of the ray.
es: La posición y del punto de inicio del rayo.
zh_cn: 射线起始点的Y位置。

source: The y position of the third point.
es: La posición y del tercer punto.
zh_cn: 第三点的y位置。

source: The y position of the top-left point.
es: La posición y del punto superior izquierdo.
zh_cn: 左上角点的y位置。

source: The y position to apply the force.
es: La posición y para aplicar la fuerza.
zh_cn: 施力的Y位置。

source: The y position to apply the impulse.
es: La posición y para aplicar el impulso.
zh_cn: 应用冲量的Y位置。

source: The y position to measure velocity.
es: La posición y para medir la velocidad.
zh_cn: 测量速度的Y位置。

source: The y position.
es: La posición Y.
zh_cn: y的位置。

source: The y postition of the center of mass.
es: La posición del centro de masa.
zh_cn: 质心的y位。

source: The y value of the surface normal vector of the shape edge.
es: El valor y del vector normal de la superficie del borde de la forma.
zh_cn: 形状边缘的表面法向量的y值。

source: The y-axis coordinate of the world-space axis vector.
es: La coordenada del eje y del vector del eje mundial-espacial.
zh_cn: 世界-空间轴向量的y轴坐标。

source: The y-axis movement of the touch inside the window, in pixels.
es: El movimiento del eje Y del tacto dentro de la ventana,en píxeles.
zh_cn: 窗口内触摸的Y轴移动,单位为像素。

source: The y-axis movement of the touch press inside the window, in pixels. This should always be zero.
es: El movimiento del eje Y del toque de prensa dentro de la ventana,en píxeles.Esto siempre debería ser cero.
zh_cn: 窗口内触摸按钮的Y轴移动,单位为像素。该值应始终为零。

source: The y-axis of the left thumbstick.
es: El eje Y del pulgar izquierdo.
zh_cn: 左手拇指杆的Y轴。

source: The y-axis of the right thumbstick.
es: El eje Y del pulgar derecho.
zh_cn: 右拇指杆的Y轴。

source: The y-axis of the top-left corner of the area within the Canvas to capture.
es: El eje Y de la esquina superior izquierda del área dentro del lienzo a capturar.
zh_cn: 捕捉Canvas内左上角区域的y轴。

source: The y-axis of the top-left corner of the area within the Image to reload.
es: El eje Y de la esquina superior izquierda del área dentro de la Imagen para recargar.
zh_cn: 画面左上角区域的y轴要重新加载。

source: The y-axis of the top-left corner of the area within the ImageData to apply the function to.
es: El eje Y de la esquina superior izquierda del área dentro de los Datos de Imagen para aplicar la función.
zh_cn: ImageData中要应用函数的左上角区域的y轴。

source: The y-axis position of the touch inside the window, in pixels.
es: La posición del eje Y del tacto dentro de la ventana,en píxeles.
zh_cn: 窗口内触摸的Y轴位置,单位为像素。

source: The y-axis position of the touch press inside the window, in pixels.
es: La posición del eje Y de la prensa táctil dentro de la ventana,en píxeles.
zh_cn: 窗口内触控按钮的Y轴位置,单位为像素。

source: The y-axis radius of each round corner. Cannot be greater than half the rectangle's height.
es: El radio del eje Y de cada esquina redonda.No puede ser mayor que la mitad de la altura del rectángulo.
zh_cn: 每个圆角的Y轴半径。不能大于矩形高度的一半。

source: The y-axis value of a coordinate in density-independent units to convert to pixels.
es: El valor del eje Y de una coordenada en unidades independientes de la densidad para convertirla en píxeles.
zh_cn: 坐标的Y轴值,以密度无关的单位转换为像素。

source: The y-axis value of a coordinate in pixels.
es: El valor del eje Y de una coordenada en píxeles.
zh_cn: 坐标的Y轴值,单位为像素。

source: The y-component of the anchor on Body 1.
es: El componente Y del ancla del Cuerpo 1.
zh_cn: 体1上锚的y分量。

source: The y-component of the anchor on Body 2.
es: El componente Y del ancla del Cuerpo 2.
zh_cn: 体2上锚的y分量。

source: The y-component of the center of mass in local coordinates.
es: El componente Y del centro de masa en coordenadas locales.
zh_cn: 局部坐标中质心的y分量。

source: The y-component of the center point of the circle.
es: El componente "y" del punto central del círculo.
zh_cn: 圆的中心点的y分量。

source: The y-component of the first endpoint.
es: El componente Y del primer punto final.
zh_cn: 第一个端点的y分量。

source: The y-component of the first vertex, bottom-left.
es: El componente Y del primer vértice,abajo a la izquierda.
zh_cn: 第一个顶点的y分量,左下角。

source: The y-component of the first vertex.
es: El componente Y del primer vértice.
zh_cn: 第一个顶点的y分量。

source: The y-component of the force.
es: El componente Y de la fuerza.
zh_cn: 力的y分量。

source: The y-component of the fourth vertex, bottom-right.
es: El componente Y del cuarto vértice,abajo a la derecha.
zh_cn: 第四顶点的y分量,右下角。

source: The y-component of the new center point of the circle.
es: El componente Y del nuevo punto central del círculo.
zh_cn: 圆的新中心点的y分量。

source: The y-component of the point.
es: El componente "y" del punto.
zh_cn: 点的y分量。

source: The y-component of the second endpoint.
es: El componente Y del segundo punto final.
zh_cn: 第二端点的y分量。

source: The y-component of the second vertex, top-left.
es: El componente Y del segundo vértice,arriba a la izquierda.
zh_cn: 第二顶点的y分量,左上角。

source: The y-component of the second vertex.
es: El componente Y del segundo vértice.
zh_cn: 第二个顶点的y分量。

source: The y-component of the surface normal.
es: El componente Y de la superficie es normal.
zh_cn: 表面法线的y分量。

source: The y-component of the target.
es: El componente Y del objetivo.
zh_cn: 目标的Y分量。

source: The y-component of the third vertex, top-right.
es: El componente Y del tercer vértice,arriba a la derecha.
zh_cn: 第三顶点的y分量,右上角。

source: The y-component of the top-left point of the box.
es: El componente "y" del punto superior izquierdo de la caja.
zh_cn: 盒子左上角的y分量。

source: The y-component of the velocity vector
es: El componente "y" del vector de velocidad
zh_cn: 速度矢量的y分量。

source: The y-component of the velocity vector.
es: El componente "y" del vector de velocidad.
zh_cn: 速度矢量的y分量。

source: The y-component of the vertex, or nil if <a href="chainshape-setnextvertex">ChainShape:setNextVertex</a> hasn't been called.
es: El componente y del v&eacute;rtice, o nulo si no se ha llamado a <a href="chainshape-setnextvertex">ChainShape: setNextVertex</a> .
zh_cn: 顶点的y分量；如果尚未调用<a href="chainshape-setnextvertex">ChainShape：setNextVertex，则为</a> nil 。

source: The y-component of the vertex, or nil if <a href="chainshape-setpreviousvertex">ChainShape:setPreviousVertex</a> hasn't been called.
es: El componente y del v&eacute;rtice, o nil si no se ha llamado a <a href="chainshape-setpreviousvertex">ChainShape: setPreviousVertex</a> .
zh_cn: 顶点的y分量；如果尚未调用<a href="chainshape-setpreviousvertex">ChainShape：setPreviousVertex，则为</a> nil 。

source: The y-component of the vertex, or nil if <a href="edgeshape-setnextvertex">EdgeShape:setNextVertex</a> hasn't been called.
es: El componente y del v&eacute;rtice, o nil si no se ha llamado a <a href="edgeshape-setnextvertex">EdgeShape: setNextVertex</a> .
zh_cn: 顶点的y分量；如果尚未调用<a href="edgeshape-setnextvertex">EdgeShape：setNextVertex，则为</a> nil 。

source: The y-component of the vertex, or nil if <a href="edgeshape-setpreviousvertex">EdgeShape:setPreviousVertex</a> hasn't been called.
es: El componente y del v&eacute;rtice, o nulo si no se ha llamado a <a href="edgeshape-setpreviousvertex">EdgeShape: setPreviousVertex</a> .
zh_cn: 顶点的y分量；如果尚未调用<a href="edgeshape-setpreviousvertex">EdgeShape：setPreviousVertex，则为</a> nil 。

source: The y-component of the vertex.
es: El componente Y del vértice.
zh_cn: 顶点的y分量。

source: The y-coordinate in the ImageData of the cursor's hot spot.
es: La coordenada y en los datos de imagen del punto caliente del cursor.
zh_cn: 光标热点在ImageData中的Y坐标。

source: The y-coordinate in the image of the cursor's hot spot.
es: La coordenada y en la imagen del punto caliente del cursor.
zh_cn: 光标热点图像中的y坐标。

source: The y-coordinate of the first point.
es: La coordenada "y" del primer punto.
zh_cn: 第一个点的y坐标。

source: The y-coordinate of the point.
es: La coordenada "y" del punto.
zh_cn: 该点的Y坐标。

source: The y-coordinate of the second point.
es: La coordenada "y" del segundo punto.
zh_cn: 第二点的y坐标。
