Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/love/love.*.006.xlf
Languages: es, ja, ko, zh_cn

source: The maximum length of the second rope segment.
es: La longitud máxima del segundo segmento de la cuerda.
zh_cn: 第二个绳段的最大长度。

source: The maximum life of the particles (in seconds).
es: La vida máxima de las partículas (en segundos).
zh_cn: 粒子的最大寿命(秒);

source: The maximum life of the particles (seconds).
es: La vida máxima de las partículas (segundos).
zh_cn: 粒子的最大寿命(秒);

source: The maximum linear speed of the particles.
es: La máxima velocidad lineal de las partículas.
zh_cn: 粒子的最大线速度。

source: The maximum motor force, in Nm.
es: La máxima fuerza motriz,en Nm.
zh_cn: 最大电机力,单位为Nm。

source: The maximum motor force, usually in N.
es: La máxima fuerza motriz,normalmente en N.
zh_cn: 最大电机力,通常以N为单位。

source: The maximum number of antialiasing samples for a <a href="love.graphics.newcanvas">Canvas</a>.
es: El n&uacute;mero m&aacute;ximo de muestras de suavizado de un <a href="love.graphics.newcanvas">lienzo</a> .
zh_cn: <a href="love.graphics.newcanvas">Canvas</a>的最大抗锯齿样本数。

source: The maximum number of channels allowed.
es: El máximo número de canales permitidos.
zh_cn: 允许的最大通道数。

source: The maximum number of particles.
es: El número máximo de partículas.
zh_cn: 颗粒的最大数量。

source: The maximum number of peers allowed.
es: El máximo número de compañeros permitido.
zh_cn: 允许的最大数量的同行。

source: The maximum number of simultaneously active canvases (via <a href="love.graphics.setcanvas">love.graphics.setCanvas</a>.)
es: El n&uacute;mero m&aacute;ximo de lienzos activos simult&aacute;neamente (a trav&eacute;s de <a href="love.graphics.setcanvas">love.graphics.setCanvas</a> .)
zh_cn: 同时激活的画布的最大数量（通过<a href="love.graphics.setcanvas">love.graphics.setCanvas</a>。）

source: The maximum number of sprites that the SpriteBatch can contain at any given time.
es: El máximo número de sprites que el SpriteBatch puede contener en un momento dado.
zh_cn: SpriteBatch在任何时候可以包含的精灵的最大数量。

source: The maximum number of sprites the batch can hold.
es: El número máximo de sprites que el lote puede contener.
zh_cn: 该批次可容纳的最大精灵数量。

source: The maximum possible value it should return.
es: El máximo valor posible que debería devolver.
zh_cn: 它应该返回的最大可能值。

source: The maximum size (1.0 being normal size).
es: El tamaño máximo (1.0 siendo el tamaño normal).
zh_cn: 最大尺寸(1.0为正常尺寸)。

source: The maximum size in bytes of the file's buffer.
es: El tamaño máximo en bytes del buffer del archivo.
zh_cn: 文件缓冲区的最大大小,以字节为单位。

source: The maximum size of <a href="love.graphics.points">points</a>.
es: El tama&ntilde;o m&aacute;ximo de <a href="love.graphics.points">puntos</a> .
zh_cn: 最大<a href="love.graphics.points">点数</a>。

source: The maximum spawn distance from the emitter along the x-axis for uniform distribution, or the standard deviation along the x-axis for normal distribution.
es: La máxima distancia de desove del emisor a lo largo del eje x para una distribución uniforme,o la desviación estándar a lo largo del eje x para una distribución normal.
zh_cn: 均匀分布时,沿x轴的最大产卵距离;正态分布时,沿x轴的标准偏差。

source: The maximum spawn distance from the emitter along the y-axis for uniform distribution, or the standard deviation along the y-axis for normal distribution.
es: La máxima distancia de desove del emisor a lo largo del eje y para una distribución uniforme,o la desviación estándar a lo largo del eje y para una distribución normal.
zh_cn: 均匀分布时沿y轴的最大产卵距离,或正态分布时沿y轴的标准偏差。

source: The maximum spin (radians per second).
es: El giro máximo (radianes por segundo).
zh_cn: 最大自旋(每秒弧度)。

source: The maximum torque of the joint motor in newton meters.
es: El par máximo del motor conjunto en metros de newton.
zh_cn: 联合电机的最大扭矩,单位为牛顿米。

source: The maximum volume.
es: El volumen máximo.
zh_cn: 最大体积。

source: The maximum width in pixels of each line that
es: El ancho máximo en píxeles de cada línea que
zh_cn: 每条线的最大宽度,以像素为单位

source: The maximum width in pixels of the text before it gets automatically wrapped to a new line.
es: El ancho máximo en píxeles del texto antes de que se envuelva automáticamente en una nueva línea.
zh_cn: 文本被自动包装到新行之前的最大宽度,以像素为单位。

source: The maximum width of the wrapped text.
es: El ancho máximo del texto envuelto.
zh_cn: 包裹文字的最大宽度。

source: The maximum width or height of <a href="image">Images</a> and <a href="canvas">Canvases</a>.
es: El ancho o alto m&aacute;ximo de <a href="image">im&aacute;genes</a> y <a href="canvas">lienzos</a> .
zh_cn: <a href="image">图片</a>和<a href="canvas">画布</a>的最大宽度或高度。

source: The mean of the distribution.
es: La media de la distribución.
zh_cn: 分布的平均值。

source: The media select key on an American layout.
es: La tecla de selección de medios en un diseño americano.
zh_cn: 美式布局的媒体选择键。

source: The method to use when decoding the contents.
es: El método a utilizar para decodificar el contenido.
zh_cn: 解码内容时使用的方法。

source: The minimum acceleration along the x axis.
es: La aceleración mínima a lo largo del eje x.
zh_cn: 沿X轴的最小加速度。

source: The minimum acceleration along the y axis.
es: La aceleración mínima a lo largo del eje y.
zh_cn: 沿y轴的最小加速度。

source: The minimum acceleration.
es: La aceleración mínima.
zh_cn: 最小加速度;

source: The minimum amount of linear damping applied to particles.
es: La cantidad mínima de amortiguación lineal aplicada a las partículas.
zh_cn: 适用于颗粒的最小线性阻尼量。

source: The minimum gravity.
es: La gravedad mínima.
zh_cn: 最低重力;

source: The minimum height of the window, if it's resizable.
es: La altura mínima de la ventana,si es redimensionable.
zh_cn: 窗口的最小高度,如果它是可调整大小的。

source: The minimum height of the window, if it's resizable. Cannot be less than 1.
es: La altura mínima de la ventana,si es redimensionable.No puede ser menos de 1.
zh_cn: 窗口的最小高度,如果它是可调整大小的。不能小于1。

source: The minimum initial angle (radians).
es: El ángulo inicial mínimo (radianes).
zh_cn: 最小初始角度(弧度);

source: The minimum life of the particles (in seconds).
es: La vida mínima de las partículas (en segundos).
zh_cn: 粒子的最低寿命(秒);

source: The minimum life of the particles (seconds).
es: La vida mínima de las partículas (segundos).
zh_cn: 粒子的最低寿命(秒);

source: The minimum linear speed of the particles.
es: La velocidad lineal mínima de las partículas.
zh_cn: 粒子的最小线速度。

source: The minimum possible value it should return.
es: El valor mínimo posible que debe devolver.
zh_cn: 它应该返回的最小值。

source: The minimum size (1.0 being normal size).
es: El tamaño mínimo (1.0 siendo el tamaño normal).
zh_cn: 最小尺寸(1.0为正常尺寸);

source: The minimum spin (radians per second).
es: El giro mínimo (radianes por segundo).
zh_cn: 最小自旋(每秒弧度);

source: The minimum volume.
es: El volumen mínimo.
zh_cn: 最小体积;

source: The minimum width of the window, if it's resizable.
es: El ancho mínimo de la ventana,si es redimensionable.
zh_cn: 窗口的最小宽度,如果它是可调整大小的。

source: The minimum width of the window, if it's resizable. Cannot be less than 1.
es: El ancho mínimo de la ventana,si es redimensionable.No puede ser menor de 1.
zh_cn: 窗口的最小宽度,如果它是可调整大小的。不能小于1。

source: The minor version of L&Ouml;VE, i.e. 9 for version 0.9.1.
es: La versi&oacute;n secundaria de L&Ouml;VE, es decir, 9 para la versi&oacute;n 0.9.1.
zh_cn: L&Ouml;VE的次要版本，即0.9.1的9。

source: The minus key on an American layout.
es: La tecla menos en un diseño americano.
zh_cn: 美式布局上的减号键。

source: The mode this file has been opened with.
es: El modo con el que se ha abierto este archivo.
zh_cn: 这个文件被打开的模式。

source: The mode to open the file in.
es: El modo de abrir el archivo en.
zh_cn: 打开文件的模式。

source: The mode to use when drawing the Mesh.
es: El modo a usar cuando se dibuja la malla.
zh_cn: 绘制网格时要使用的模式。

source: The mode to use when the ParticleSystem adds new particles.
es: El modo a utilizar cuando el Sistema de Partículas añade nuevas partículas.
zh_cn: 粒子系统添加新粒子时要使用的模式。

source: The mode used when drawing the Mesh.
es: El modo usado cuando se dibuja la malla.
zh_cn: 绘制网格时使用的模式。

source: The mode used when the ParticleSystem adds new particles.
es: El modo utilizado cuando el Sistema de Partículas añade nuevas partículas.
zh_cn: 粒子系统添加新粒子时使用的模式。

source: The motor speed, radians per second.
es: La velocidad del motor,radianes por segundo.
zh_cn: 电机速度,弧度/秒。

source: The motor speed, usually in meters per second.
es: La velocidad del motor,normalmente en metros por segundo.
zh_cn: 电机速度,通常以米/秒为单位。

source: The mouse position on the x-axis.
es: La posición del ratón en el eje X.
zh_cn: 鼠标在X轴上的位置。

source: The mouse position on the y-axis.
es: La posición del ratón en el eje Y.
zh_cn: 鼠标在Y轴上的位置。

source: The mute key on an American layout.
es: La tecla de silencio en un diseño americano.
zh_cn: 美式布局的静音键。

source: The name
es: El nombre
zh_cn: 名称

source: The name (and path) of the file
es: El nombre (y la ruta)del archivo
zh_cn: 文件的名称(和路径)。

source: The name (and path) of the file.
es: El nombre (y la ruta)del archivo.
zh_cn: 文件的名称(和路径)。

source: The name of the File to use as source.
es: El nombre del archivo a usar como fuente.
zh_cn: 用作源文件的名称。

source: The name of the Lua file to use as the source.
es: El nombre del archivo Lua para usar como fuente.
zh_cn: 作为源文件的Lua文件的名称。

source: The name of the application binary, typically <code>love</code>.
es: El nombre de la aplicaci&oacute;n binaria, por lo general <code>love</code> .
zh_cn: 应用程序二进制文件的名称，通常为 <code>love</code> 。

source: The name of the channel you want to create or retrieve.
es: El nombre del canal que quieres crear o recuperar.
zh_cn: 您要创建或检索的通道名称。

source: The name of the color extern variable to send to in the shader.
es: El nombre de la variable externa de color a enviar en el sombreador.
zh_cn: 要在着色器中发送的颜色外部变量的名称。

source: The name of the event.
es: El nombre del evento.
zh_cn: 活动的名称。

source: The name of the extern variable.
es: El nombre de la variable externa.
zh_cn: 外部变量的名称。

source: The name of the file the FileData represents.
es: El nombre del archivo que representa el FileData.
zh_cn: FileData代表的文件名。

source: The name of the file.
es: El nombre del archivo.
zh_cn: 文件的名称。

source: The name of the graphics card vendor, e.g. "Intel Inc".
es: El nombre del proveedor de la tarjeta gráfica,por ejemplo,"Intel Inc".
zh_cn: 图形卡供应商的名称,例如 "英特尔公司"。

source: The name of the graphics card, e.g. "Intel HD Graphics 3000 OpenGL Engine".
es: El nombre de la tarjeta gráfica,por ejemplo,"Intel HD Graphics 3000 OpenGL Engine".
zh_cn: 显卡的名称,如 "Intel HD Graphics 3000 OpenGL Engine"。

source: The name of the joystick.
es: El nombre del joystick.
zh_cn: 操纵杆的名称。

source: The name of the message.
es: El nombre del mensaje.
zh_cn: 信息的名称。

source: The name of the renderer, e.g. "OpenGL" or "OpenGL ES".
es: El nombre del renderizador,por ejemplo "OpenGL" o "OpenGL ES".
zh_cn: 渲染器的名称,例如 "OpenGL "或 "OpenGL ES"。

source: The name of the specified display.
es: El nombre de la pantalla especificada.
zh_cn: 指定显示器的名称。

source: The name of the thread to return.
es: El nombre del hilo a devolver.
zh_cn: 要返回的线程名称。

source: The name of the thread.
es: El nombre del hilo.
zh_cn: 线程的名称。

source: The name of the type to check for.
es: El nombre del tipo que hay que comprobar.
zh_cn: 要检查的类型名称。

source: The name of the vertex attribute to attach.
es: El nombre del atributo de vértice a adjuntar.
zh_cn: 要附加的顶点属性的名称。

source: The name of the vertex attribute to enable or disable.
es: El nombre del atributo de vértice a activar o desactivar.
zh_cn: 要启用或禁用的顶点属性的名称。

source: The new Channel object.
es: El nuevo objeto del Canal.
zh_cn: 新的Channel对象。

source: The new CompressedImageData object.
es: El nuevo objeto CompressedImageData.
zh_cn: 新的CompressedImageData对象。

source: The new Cursor object.
es: El nuevo objeto Cursor.
zh_cn: 新的Cursor对象。

source: The new File object, or nil if an error occurred.
es: El nuevo objeto Archivo,o nulo si se produce un error.
zh_cn: 新的文件对象,如果发生错误,则为nil。

source: The new File object.
es: El nuevo objeto File.
zh_cn: 新的文件对象。

source: The new FileData, or <a href="nil">nil</a> if an error occurred.
es: El nuevo FileData, o <a href="nil">nulo</a> si ocurri&oacute; un error.
zh_cn: 新的FileData；如果发生错误，则返回<a href="nil">nil</a>。

source: The new FrictionJoint.
es: El nuevo FrictionJoint.
zh_cn: 新的FrictionJoint。

source: The new Image or Canvas to use for the sprites in the batch.
es: La nueva imagen o lienzo a utilizar para los sprites del lote.
zh_cn: 新的图像或画布用于该批次的精灵。

source: The new Image to use for the sprites.
es: La nueva imagen para usar para los sprites.
zh_cn: 用来制作精灵的新图片。

source: The new ImageData made from the Canvas' contents.
es: Los nuevos ImageData hechos a partir del contenido del lienzo.
zh_cn: 由Canvas内容制作的新ImageData。

source: The new ImageData made from the Canvas' image.
es: Los nuevos ImageData hechos a partir de la imagen del lienzo.
zh_cn: 由Canvas的图像制作的新ImageData。

source: The new ImageData object.
es: El nuevo objeto ImageData.
zh_cn: 新的ImageData对象。

source: The new MotorJoint.
es: El nuevo MotorJoint.
zh_cn: 新的MotorJoint。

source: The new Quad.
es: El nuevo Quad.
zh_cn: 新的四。

source: The new Random Number Generator object.
es: El nuevo objeto Generador de Números Aleatorios.
zh_cn: 新的随机数生成器对象。

source: The new RopeJoint.
es: El nuevo RopeJoint.
zh_cn: 新的RopeJoint。

source: The new SpriteBatch.
es: El nuevo SpriteBatch.
zh_cn: 新的SpriteBatch。

source: The new WeldJoint.
es: El nuevo WeldJoint.
zh_cn: 新的WeldJoint。

source: The new WheelJoint.
es: El nuevo WheelJoint.
zh_cn: 新的WheelJoint。

source: The new angular damping.
es: El nuevo amortiguamiento angular.
zh_cn: 新的角阻尼。

source: The new angular velocity, in radians per second
es: La nueva velocidad angular,en radianes por segundo
zh_cn: 新的角速度,以弧度/秒为单位。

source: The new axis value.
es: El nuevo valor del eje.
zh_cn: 新的轴值。

source: The new blank ImageData object. Each pixel's color values, (including the alpha values!) will be set to zero.
es: El nuevo objeto en blanco de ImageData.Los valores de color de cada píxel,(¡incluyendo los valores alfa!)se pondrán a cero.
zh_cn: 新的空白ImageData对象。每个像素的颜色值,(包括alpha值!)将被设置为零。

source: The new damping ratio.
es: La nueva relación de amortiguación.
zh_cn: 新的阻尼比。

source: The new density of the Shape.
es: La nueva densidad de la forma.
zh_cn: 形的新密度。

source: The new distance joint.
es: La nueva junta de distancia.
zh_cn: 新的距离接头。

source: The new distance model.
es: El nuevo modelo de distancia.
zh_cn: 新的距离模式。

source: The new doppler scale factor. The scale must be greater than 0.
es: El nuevo factor de escala doppler.La escala debe ser mayor que 0.
zh_cn: 新的多普勒比例系数。刻度必须大于0。

source: The new drawable Text object.
es: El nuevo objeto de Texto dibujable.
zh_cn: 新的可绘制文本对象。

source: The new fixture.
es: El nuevo accesorio.
zh_cn: 新夹具。

source: The new font to use with this Text object.
es: La nueva fuente a utilizar con este objeto Texto.
zh_cn: 与此Text对象一起使用的新字体。

source: The new font.
es: La nueva fuente.
zh_cn: 新字体。

source: The new frequency in hertz.
es: La nueva frecuencia en hertzios.
zh_cn: 新的频率,以赫兹为单位。

source: The new gear joint.
es: El nuevo engranaje.
zh_cn: 新的齿轮接头。

source: The new gravity scale factor.
es: El nuevo factor de escala de gravedad.
zh_cn: 新的重力秤系数。

source: The new hat direction.
es: La nueva dirección del sombrero.
zh_cn: 新的帽子方向。

source: The new height, in pixels.
es: La nueva altura,en píxeles.
zh_cn: 新高度,以像素为单位。

source: The new identical copy of this ParticleSystem.
es: La nueva copia idéntica de este sistema de partículas.
zh_cn: 这个ParticleSystem的新的相同副本。

source: The new identical copy of this Source.
es: La nueva copia idéntica de esta Fuente.
zh_cn: 本源的新相同副本。

source: The new identity that will be used as write directory.
es: La nueva identidad que será usada como directorio de escritura.
zh_cn: 将作为写目录使用的新身份。

source: The new length of the rope in the joint.
es: La nueva longitud de la cuerda en la articulación.
zh_cn: 绳索在接头处的新长度。

source: The new line height.
es: La nueva altura de la línea.
zh_cn: 新的线高。

source: The new linear damping
es: La nueva amortiguación lineal
zh_cn: 新的线性阻尼

source: The new maximum attenuation distance.
es: La nueva distancia máxima de atenuación.
zh_cn: 新的最大衰减距离。

source: The new maximum distance.
es: La nueva distancia máxima.
zh_cn: 新的最大距离。

source: The new maximum length of the first segment.
es: La nueva longitud máxima del primer segmento.
zh_cn: 第一段的新的最大长度。

source: The new maximum length of the second segment.
es: La nueva longitud máxima del segundo segmento.
zh_cn: 第二段的新的最大长度。

source: The new maximum number of sprites the batch can hold.
es: El nuevo número máximo de sprites que el lote puede contener.
zh_cn: 新的一批精灵可以容纳的最大数量。

source: The new maximum torque for the joint motor in newton meters.
es: El nuevo par máximo para el motor conjunto en metros de newton.
zh_cn: 新的关节电机最大扭矩,单位为牛顿米。

source: The new mesh.
es: La nueva malla.
zh_cn: 新网。

source: The new moment of inertia, in kilograms * pixel squared.
es: El nuevo momento de inercia,en kilogramos*píxel al cuadrado.
zh_cn: 新的惯性矩,单位是公斤*像素平方。

source: The new mouse joint.
es: La nueva articulación del ratón.
zh_cn: 新的鼠标关节。

source: The new path the archive will be mounted to.
es: El nuevo camino en el que se montará el archivo.
zh_cn: 存档将被挂载到的新路径。

source: The new pixel effect.
es: El nuevo efecto de los píxeles.
zh_cn: 新的像素效果。

source: The new point size.
es: El nuevo tamaño del punto.
zh_cn: 新点大小。

source: The new point style.
es: El nuevo estilo de punto.
zh_cn: 新点式。

source: The new position of the mouse along the x-axis.
es: La nueva posición del ratón a lo largo del eje X.
zh_cn: 鼠标在X轴上的新位置。

source: The new position of the mouse along the y-axis.
es: La nueva posición del ratón a lo largo del eje Y.
zh_cn: 鼠标在Y轴上的新位置。

source: The new prismatic joint.
es: La nueva articulación prismática.
zh_cn: 新的棱柱形接头。

source: The new pulley joint.
es: La nueva articulación de la polea.
zh_cn: 新的滑轮接头。

source: The new pulley ratio of the joint.
es: La nueva relación de la polea de la articulación.
zh_cn: 合的新滑轮比。

source: The new ratio of the joint.
es: La nueva relación de la articulación.
zh_cn: 合的新比。

source: The new reference attenuation distance. If the current <a href="distancemodel">DistanceModel</a> is clamped, this is the minimum attenuation distance.
es: La nueva distancia de atenuaci&oacute;n de referencia. Si el modelo de <a href="distancemodel">distancia</a> actual est&aacute; sujeto, esta es la distancia de atenuaci&oacute;n m&iacute;nima.
zh_cn: 新的参考衰减距离。如果当前的<a href="distancemodel">DistanceModel</a>被钳制，则这是最小衰减距离。

source: The new reference distance.
es: La nueva distancia de referencia.
zh_cn: 新的参考距离。

source: The new render target.
es: El nuevo objetivo de renderizado.
zh_cn: 新的渲染目标。

source: The new revolute joint.
es: La nueva junta revolutiva.
zh_cn: 新的旋转接头。

source: The new rolloff factor.
es: El nuevo factor de despegue.
zh_cn: 新的轧制系数。

source: The new shader.
es: El nuevo sombreador.
zh_cn: 新的着色器。

source: The new shape.
es: La nueva forma.
zh_cn: 新的形状。

source: The new speed for the joint motor in radians per second.
es: La nueva velocidad del motor conjunto en radianes por segundo.
zh_cn: 联合电机的新速度,单位是弧度/秒。

source: The new state of the RandomGenerator object, represented as a string. This should originate from a previous call to <a href="randomgenerator-getstate">RandomGenerator:getState</a>.
es: El nuevo estado del objeto RandomGenerator, representado como una cadena. Esto deber&iacute;a originarse en una llamada anterior a <a href="randomgenerator-getstate">RandomGenerator: getState</a> .
zh_cn: RandomGenerator对象的新状态，以字符串表示。这应该源自对<a href="randomgenerator-getstate">RandomGenerator：getState</a>的先前调用。

source: The new stencil value to use for pixels if the "replace" stencil action is used. Has no effect with other stencil actions. Must be between 0 and 255.
es: El nuevo valor de la plantilla a utilizar para los píxeles si se utiliza la acción de "reemplazar" la plantilla.No tiene ningún efecto con otras acciones de la plantilla.Debe estar entre 0 y 255.
zh_cn: 如果使用 "replace "钢网动作,对像素使用的新钢网值。对其他钢网操作没有影响。必须在0和255之间。

source: The new string of text to use.
es: La nueva cadena de texto a utilizar.
zh_cn: 要使用的新文本字符串。

source: The new target.
es: El nuevo objetivo.
zh_cn: 新的目标。

source: The new text to hold in the system's clipboard.
es: El nuevo texto para mantener en el portapapeles del sistema.
zh_cn: 新的文字要保存在系统的剪贴板中。

source: The new type.
es: El nuevo tipo.
zh_cn: 新类型。

source: The new value for the first component of the attribute.
es: El nuevo valor del primer componente del atributo.
zh_cn: 属性的第一个分量的新值。

source: The new value for the second component of the attribute.
es: El nuevo valor del segundo componente del atributo.
zh_cn: 属性的第二个分量的新值。

source: The new width, in pixels.
es: El nuevo ancho,en píxeles.
zh_cn: 新的宽度,以像素为单位。

source: The new window caption.
es: El nuevo pie de foto de la ventana.
zh_cn: 新的窗口标题。

source: The new window title.
es: El nuevo título de la ventana.
zh_cn: 新窗口的标题。

source: The newly connected Joystick object.
es: El objeto Joystick recién conectado.
zh_cn: 新连接的Joystick对象。

source: The nine key
es: La llave nueve
zh_cn: 九大关键

source: The noise value in the range of [0, 1].
es: El valor de ruido en el rango de [0,1].
zh_cn: 噪声值在[0,1]范围内。

source: The non-U.S. backslash scancode.
es: El código de barras invertido no estadounidense.
zh_cn: 非美国的反斜杠扫描码。

source: The non-U.S. hash scancode.
es: El código de hachís no estadounidense.
zh_cn: 非美国的哈希扫描码。

source: The normalized sample (range -1.0 to 1.0).
es: La muestra normalizada (rango -1.0 a 1.0).
zh_cn: 归一化样本(范围-1.0至1.0)。

source: The now-disconnected Joystick object.
es: El ahora desconectado objeto Joystick.
zh_cn: 现在断开的Joystick对象。

source: The number includes the threads reported if technologies such as Intel's <a href="http://en.wikipedia.org/wiki/Hyper-threading">Hyper-threading</a> are enabled. For example, on a 4-core CPU with Hyper-threading, this function will return 8.
es: El n&uacute;mero incluye los subprocesos informados si las tecnolog&iacute;as como <a href="http://en.wikipedia.org/wiki/Hyper-threading">Hyper-threading de</a> Intel est&aacute;n habilitadas. Por ejemplo, en una CPU de 4 n&uacute;cleos con Hyper-threading, esta funci&oacute;n devolver&aacute; 8.
zh_cn: 如果启用了英特尔<a href="http://en.wikipedia.org/wiki/Hyper-threading">超线程</a>等技术，则数字包括报告的线程。例如，在具有超线程的4核CPU上，此函数将返回8。

source: The number of <a href="canvas">Canvas</a> objects currently loaded.
es: El n&uacute;mero de objetos <a href="canvas">Canvas</a> cargados actualmente.
zh_cn: 当前加载的<a href="canvas">Canvas</a>对象数。

source: The number of <a href="font">Font</a> objects currently loaded.
es: El n&uacute;mero de objetos <a href="font">Font</a> cargados actualmente.
zh_cn: 当前加载的<a href="font">Font</a>对象的数量。

source: The number of <a href="image">Image</a> objects currently loaded.
es: El n&uacute;mero de objetos de <a href="image">imagen</a> cargados actualmente.
zh_cn: 当前加载的<a href="image">Image</a>对象的数量。

source: The number of CPU cores.
es: El número de núcleos de la CPU.
zh_cn: CPU核心的数量。

source: The number of FSAA samples.
es: El número de muestras de la FSAA.
zh_cn: FSAA样本的数量;

source: The number of MSAA samples.
es: El número de muestras de MSAA.
zh_cn: MSAA样本的数量;

source: The number of antialiasing samples used (0 if MSAA is disabled).
es: El número de muestras de antialiasing utilizadas (0 si la MSAA está desactivada).
zh_cn: 使用的抗锯齿样本数(如果禁用MSAA则为0)。

source: The number of antialiasing samples used by the canvas when drawing to it.
es: El número de muestras de antialiasing utilizadas por el lienzo al dibujar en él.
zh_cn: 画布在绘制到画布时使用的抗锯齿样本的数量。

source: The number of antialiasing samples.
es: El número de muestras de antialiasing.
zh_cn: 抗锯齿样本的数量。

source: The number of axes available
es: El número de ejes disponibles
zh_cn: 可用的轴数

source: The number of axes available.
es: El número de ejes disponibles.
zh_cn: 可用的轴数。

source: The number of balls available
es: El número de bolas disponibles
zh_cn: 可用球的数量

source: The number of bodies in the world.
es: El número de cuerpos en el mundo.
zh_cn: 世界上的身体数量。
