Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/love/love.*.006.xlf
Languages: es, ja, ko, zh_cn

source: Support for BC4 and BC5 compressed images. Use <a href="love.graphics.getcompressedimageformats">love.graphics.getCompressedImageFormats</a> instead.
ja: BC4およびBC5圧縮イメージのサポート。代わりに<a href="love.graphics.getcompressedimageformats">love.graphics.getCompressedImageFormats</a>を使用してください。
ko: BC4 및 BC5 압축 이미지를 지원합니다. 대신 <a href="love.graphics.getcompressedimageformats">love.graphics.getCompressedImageFormats</a> 를 사용하십시오 .

source: Support for DXT compressed images (see <a href="compressedformat">CompressedFormat</a>.) Use <a href="love.graphics.getcompressedimageformats">love.graphics.getCompressedImageFormats</a> instead.
ja: DXT圧縮画像のサポート（<a href="compressedformat">CompressedFormatを</a>参照）。代わりに<a href="love.graphics.getcompressedimageformats">love.graphics.getCompressedImageFormats</a>を使用してください。
ko: DXT 압축 이미지 지원 ( <a href="compressedformat">CompressedFormat</a> 참조 ) 대신 <a href="love.graphics.getcompressedimageformats">love.graphics.getCompressedImageFormats</a> 를 사용하십시오 .

source: Support for HDR <a href="canvas">Canvases</a>. Use <a href="love.graphics.getcanvasformats">love.graphics.getCanvasFormats</a> instead.
ja: HDR <a href="canvas">Canvasesの</a>サポート。代わりに<a href="love.graphics.getcanvasformats">love.graphics.getCanvasFormats</a>を使用してください。
ko: HDR <a href="canvas">캔버스</a> 지원 . 대신 <a href="love.graphics.getcanvasformats">love.graphics.getCanvasFormats</a> 를 사용하십시오 .

source: Support for Mipmaps.
ja: ミップマップをサポート。
ko: 밉맵 지원.

source: Support for gamma-correct rendering with the <code>srgb</code> window flag in <a href="love.window.setmode">love.window.setMode</a>, and the "srgb" <a href="textureformat">TextureFormat</a> for <a href="love.graphics.newcanvas">Canvases</a> and <a href="love.graphics.newimage">Images</a>.
ja: ガンマ正しいとレンダリングのサポート <code>srgb</code> で窓フラグ<a href="love.window.setmode">love.window.setMode</a>、および「sRGBの」<a href="textureformat">TextureFormat</a>のための<a href="love.graphics.newcanvas">キャンバス</a>と<a href="love.graphics.newimage">イメージ</a>。
ko: 와 감마 - 올바른 렌더링을위한 지원 <code>srgb</code> 에서 윈도우 플래그 <a href="love.window.setmode">love.window.setMode</a> 하고 "(sRGB)의" <a href="textureformat">TextureFormat</a> 에 대한 <a href="love.graphics.newcanvas">캔버스</a> 와 <a href="love.graphics.newimage">이미지</a> .

source: Support for simultaneous rendering to at least 4 <a href="canvas">canvases</a> at once, with <a href="love.graphics.setcanvas">love.graphics.setCanvas</a>. Use <a href="love.graphics.getsystemlimits">love.graphics.getSystemLimits</a> instead.
ja: <a href="love.graphics.setcanvas">love.graphics.setCanvasを使用</a>して、一度に少なくとも4つの<a href="canvas">キャンバス</a>への同時レンダリングをサポートします。代わりに<a href="love.graphics.getsystemlimits">love.graphics.getSystemLimits</a>を使用してください。
ko: <a href="love.graphics.setcanvas">love.graphics.setCanvas를 사용</a> 하여 한 번 에 최소 4 개의 <a href="canvas">캔버스</a> 에 동시 렌더링을 지원합니다 . 대신 <a href="love.graphics.getsystemlimits">love.graphics.getSystemLimits</a> 를 사용하십시오 .

source: Support for textures with non-power-of-two sizes. See <a href="https://love2d.org/wiki/PO2_Syndrome">PO2 Syndrome</a>.
ja: 2の累乗ではないサイズのテクスチャのサポート。<a href="https://love2d.org/wiki/PO2_Syndrome">PO2症候群を</a>参照してください。
ko: 2의 제곱이 아닌 텍스처를 지원합니다. <a href="https://love2d.org/wiki/PO2_Syndrome">PO2 증후군을</a> 참조하십시오 .

source: Support for the subtractive <a href="blendmode">blend mode</a>.
ja: 減算<a href="blendmode">ブレンドモードの</a>サポート。
ko: 빼기 <a href="blendmode">블렌드 모드</a> 지원 .

source: Symbolic link.
ja: シンボリックリンク。
ko: 심볼릭 링크.

source: System Information
ja: システム情報
ko: 시스템 정보

source: System request key
ja: システム要求キー
ko: 시스템 요청 키

source: TRUE: results in searching source before searching save directory; FALSE: results in searching game save directory before searching source directory<a href="love.filesystem.mount">mounted</a> archives.
ja: TRUE：保存ディレクトリを検索する前にソースを検索します。FALSE：ソースディレクトリに<a href="love.filesystem.mount">マウントされた</a>アーカイブを検索する前に、ゲームの保存ディレクトリを検索します。
ko: TRUE : 저장 디렉토리를 검색하기 전에 소스를 검색합니다. FALSE : 소스 디렉토리 <a href="love.filesystem.mount">마운트</a> 아카이브를 검색하기 전에 게임 저장 디렉토리를 검색합니다 .

source: Tab key
ja: タブキー
ko: 탭 키

source: Table containing a list of Sources to play.
ja: 再生するソースのリストを含むテーブル。
ko: 재생할 소스 목록이 포함 된 테이블입니다.

source: Table with the window properties:
ja: ウィンドウのプロパティを表にしたものです。
ko: 창 속성이있는 테이블 :

source: Targa image format.
ja: タルガの画像形式。
ko: 타르가 이미지 형식.

source: Tells the default <a href="love.run">love.run</a> to exit and restart the game without relaunching the executable.
ja: 実行ファイルを再起動せずにゲームを終了して再起動するようにデフォルトの<a href="love.run">love.runに指示</a>します。
ko: 실행 파일을 다시 시작하지 않고 게임을 종료했다가 다시 시작 하도록 기본 <a href="love.run">love.run에 지시</a> 합니다.

source: Texel(tex, uv)
ja: テクセル(tex,uv)
ko: 텍셀 (tex, uv)

source: Text alignment.
ja: テキストの配置。
ko: 텍스트 정렬.

source: Text input is now handled separately via <a href="love.textinput">love.textinput</a>.
ja: テキスト入力は、<a href="love.textinput">love.textinput</a>を介して個別に処理されるようになりました。
ko: 이제 텍스트 입력은 <a href="love.textinput">love.textinput을</a> 통해 개별적으로 처리됩니다 .

source: Text input is now handled separately via love.textinput..
ja: テキスト入力は、LOVE.TEXTINPUT...を介して個別に処理されるようになりました。
ko: 텍스트 입력은 이제 love.textinput.을 통해 개별적으로 처리됩니다.

source: Text may appear blurry if it's rendered at non-integer pixel locations.
ja: 整数でないピクセル位置でレンダリングされた場合、テキストがぼやけて見えることがある。
ko: 정수가 아닌 픽셀 위치에서 렌더링되는 경우 텍스트가 흐릿하게 나타날 수 있습니다. ㅇㅇㅇ ㅇㅇㅇ ㅇㅇㅇ ㅇㅇㅇ ㅇㅇㅇ ㅇㅇㅇ ㅇㅇㅇ ㅇㅇㅇ ㅇㅇㅇ ㅇㅇㅇ ㅇㅇㅇ ㅇㅇㅇ ㅇㅇㅇ ㅇㅇㅇ ㅇㅇㅇ ㅇㅇㅇ ㅇㅇㅇ ㅇㅇㅇ ㅇㅇㅇ ㅇㅇㅇ ㅇㅇㅇ ㅇㅇㅇ ㅇㅇㅇ ㅇㅇㅇ ㅇㅇㅇ ㅇㅇㅇ ㅇㅇㅇ ㅇㅇㅇ ㅇㅇㅇ ㅇㅇㅇ ㅇㅇㅇ ㅇㅇㅇ ㅇㅇㅇ ㅇㅇㅇ ㅇㅇㅇ ㅇㅇㅇ ㅇㅇㅇ ㅇㅇㅇ ㅇㅇㅇ ㅇㅇㅇ ㅇㅇㅇ ㅇㅇㅇ ㅇㅇㅇ ㅇㅇㅇ ㅇㅇㅇ ㅇㅇㅇ ㅇㅇㅇ ㅇㅇㅇ ㅇㅇㅇ ㅇㅇㅇ ㅇㅇㅇ ㅇㅇㅇ ㅇㅇㅇ ㅇㅇㅇ ㅇㅇㅇ ㅇㅇㅇ ㅇㅇㅇ ㅇㅇㅇ ㅇㅇㅇ

source: Text rectangle height.
ja: テキストの矩形の高さ。
ko: 텍스트 직사각형 높이.

source: Text rectangle width.
ja: テキストの矩形の幅。
ko: 텍스트 직사각형 너비.

source: Text rectangle x position.
ja: テキストの矩形 x 位置。
ko: 텍스트 사각형 x 위치.

source: Text rectangle y position.
ja: テキスト矩形の y 位置。
ko: 텍스트 사각형 y 위치.

source: Texture (<a href="image">Image</a> or <a href="canvas">Canvas</a>) to send to the uniform variable.
ja: ユニフォーム変数に送信するテクスチャ（<a href="image">画像</a>または<a href="canvas">キャンバス</a>）。
ko: 균일 한 변수로 보낼 텍스처 ( <a href="image">이미지</a> 또는 <a href="canvas">캔버스</a> )

source: Texture (Fran&ccedil;ais)
ja: テクスチャ（Fran&ccedil;ais）
ko: 텍스처 (Fran&ccedil;ais)

source: Th AC Stop key on an American layout.
ja: アメリカのレイアウトのACストップキー。
ko: 미국식 배치의 AC 정지 키.

source: The "alphamultiply" constant does not affect the "multiply" <a href="blendmode">BlendMode</a>. Similarly, the "screen" <a href="blendmode">BlendMode</a>'s math is only correct if the "premultiplied" alpha mode is used and the alpha of drawn objects has already been multiplied with its RGB values previously (possibly inside a shader).
ja: 「alphamultiply」定数は「multiply」<a href="blendmode">BlendModeに</a>は影響しません。同様に、「画面」の<a href="blendmode">BlendMode</a>の計算は、「事前乗算」アルファモードが使用され、描画オブジェクトのアルファがそのRGB値ですでに（おそらくシェーダー内に）乗算されている場合にのみ正しいです。
ko: "alphamultiply"상수는 "multiply" <a href="blendmode">BlendMode에</a> 영향을 미치지 않습니다 . 마찬가지로 "스크린" <a href="blendmode">BlendMode</a> 의 수학은 "미리 곱한"알파 모드를 사용하고 그려진 객체의 알파에 이미 RGB 값을 곱한 경우 (셰이더 안에있을 경우)에만 정확합니다.

source: The "image" CursorType is not a valid argument. Use <a href="love.mouse.newcursor">love.mouse.newCursor</a> to create a hardware cursor using a custom image.
ja: 「画像」のCursorTypeは有効な引数ではありません。使用<a href="love.mouse.newcursor">love.mouse.newCursor</a>カスタムイメージを使用してハードウェアカーソルを作成します。
ko: "image"CursorType은 유효한 인수가 아닙니다. <a href="love.mouse.newcursor">love.mouse.newCursor</a> 를 사용하여 사용자 정의 이미지를 사용하여 하드웨어 커서를 작성 하십시오 .

source: The "premultiplied" constant should generally be used when drawing a <a href="canvas">Canvas</a> to the screen, because the RGB values of the Canvas' texture had previously been multiplied by its alpha values when drawing content to the Canvas itself.
ja: Canvas自体にコンテンツを描画するときにCanvasのテクスチャのRGB値がそのアルファ値で以前に乗算されていたため、「プリマルチプライ」定数は通常、<a href="canvas">Canvas</a>を画面に描画するときに使用する必要があります。
ko: <a href="canvas">Canvas</a> 에 텍스처를 그릴 때 Canvas 의 RGB 값에 알파 값을 곱한 적이 있기 때문에 "premultiplied"상수는 일반적으로 Canvas 를 화면에 그릴 때 사용해야 합니다.

source: The '0' key on an American layout.
ja: アメリカのレイアウトの'0'キー。
ko: 미국식 레이아웃의 '0'키.

source: The '1' key on an American layout.
ja: アメリカのレイアウトの「1」キー。
ko: 미국식 레이아웃의 '1'키.

source: The '2' key on an American layout.
ja: アメリカのレイアウトの'2'キー。
ko: 미국식 레이아웃의 '2'키.

source: The '3' key on an American layout.
ja: アメリカのレイアウトの「3」キー。
ko: 미국식 레이아웃의 '3'키.

source: The '4' key on an American layout.
ja: アメリカのレイアウトの'4'キー。
ko: 미국식 레이아웃의 '4'키.

source: The '5' key on an American layout.
ja: アメリカのレイアウトの'5'キー。
ko: 미국식 레이아웃의 '5'키.

source: The '6' key on an American layout.
ja: アメリカのレイアウトの'6'キー。
ko: 미국식 레이아웃의 '6'키.

source: The '7' key on an American layout.
ja: アメリカのレイアウトの'7'キー。
ko: 미국식 레이아웃의 '7'키.

source: The '8' key on an American layout.
ja: アメリカのレイアウトの'8'キー。
ko: 미국식 레이아웃의 '8'키.

source: The '9' key on an American layout.
ja: アメリカのレイアウトの'9'キー。
ko: 미국식 레이아웃의 '9'키.

source: The 'A' key on an American layout.
ja: アメリカのレイアウトの'A'キー。
ko: 미국식 레이아웃의 'A'키.

source: The 'B' key on an American layout.
ja: アメリカのレイアウトの「B」キー。
ko: 미국식 레이아웃의 'B'키.

source: The 'C' key on an American layout.
ja: アメリカのレイアウトの'C'キー。
ko: 미국식 레이아웃의 'C'키.

source: The 'D' key on an American layout.
ja: アメリカのレイアウトの'D'キー。
ko: 미국식 레이아웃의 'D'키.

source: The 'E' key on an American layout.
ja: アメリカのレイアウトの'E'キー。
ko: 미국식 레이아웃의 'E'키.

source: The 'F' key on an American layout.
ja: アメリカのレイアウトの'F'キー。
ko: 미국식 레이아웃의 'F'키.

source: The 'G' key on an American layout.
ja: アメリカのレイアウトの「G」キー。
ko: 미국식 레이아웃의 'G'키.

source: The 'H' key on an American layout.
ja: アメリカのレイアウトの'H'キー。
ko: 미국식 레이아웃의 'H'키.

source: The 'I' key on an American layout.
ja: アメリカのレイアウトの「I」キー。
ko: 미국식 레이아웃의 'I'키.

source: The 'J' key on an American layout.
ja: アメリカのレイアウトにある「J」キー。
ko: 미국식 레이아웃의 'J'키.

source: The 'K' key on an American layout.
ja: アメリカのレイアウトの'K'キー。
ko: 미국식 레이아웃의 'K'키.

source: The 'L' key on an American layout.
ja: アメリカのレイアウトの'L'キー。
ko: 미국식 레이아웃의 'L'키.

source: The 'M' key on an American layout.
ja: アメリカのレイアウトの'M'キー。
ko: 미국식 레이아웃의 'M'키.

source: The 'N' key on an American layout.
ja: アメリカのレイアウトの'N'キー。
ko: 미국식 레이아웃의 'N'키입니다.

source: The 'O' key on an American layout.
ja: アメリカのレイアウトの'O'キー。
ko: 미국식 레이아웃의 'O'키.

source: The 'P' key on an American layout.
ja: アメリカのレイアウトの'P'キー。
ko: 미국식 레이아웃의 'P'키.

source: The 'Q' key on an American layout.
ja: アメリカのレイアウトにある「Q」キー。
ko: 미국식 레이아웃의 'Q'키.

source: The 'R' key on an American layout.
ja: アメリカのレイアウトの'R'キー。
ko: 미국식 레이아웃의 'R'키입니다.

source: The 'S' key on an American layout.
ja: アメリカのレイアウトの'S'キー。
ko: 미국식 레이아웃의 'S'키.

source: The 'T' key on an American layout.
ja: アメリカのレイアウトの'T'キー。
ko: 미국식 레이아웃의 'T'키.

source: The 'U' key on an American layout.
ja: アメリカのレイアウトの'U'キー。
ko: 미국식 레이아웃의 'U'키.

source: The 'V' key on an American layout.
ja: アメリカのレイアウトの'V'キー。
ko: 미국식 레이아웃의 'V'키.

source: The 'W' key on an American layout.
ja: アメリカのレイアウトの「W」キー。
ko: 미국식 레이아웃의 'W'키.

source: The 'WWW' key on an American layout.
ja: アメリカのレイアウトで「wwww」ｷﾀ━━━━━━(ﾟ∀ﾟ)━━━━━━!
ko: 미국식 레이아웃의 'WWW'키.

source: The 'X' key on an American layout.
ja: アメリカのレイアウトの「X」キー。
ko: 미국식 레이아웃의 'X'키.

source: The 'Y' key on an American layout.
ja: アメリカのレイアウトの'Y'キー。
ko: 미국식 레이아웃의 'Y'키.

source: The 'Z' key on an American layout.
ja: アメリカのレイアウトの'Z'キー。
ko: 미국식 레이아웃의 'Z'키.

source: The 'again' key on an American layout.
ja: アメリカのレイアウトにある「もう一度」キー。
ko: 미국식 레이아웃의 '다시'키.

source: The 'app1' scancode.
ja: 'app1' のスキャンコード。
ko: 'app1'스캔 코드.

source: The 'app2' scancode.
ja: 'app2'スキャンコード。
ko: 'app2'스캔 코드.

source: The 'backspace' key on an American layout.
ja: アメリカのレイアウトの「バックスペース」キー。
ko: 미국식 레이아웃의 '백 스페이스'키

source: The 'cancel' key on an American layout.
ja: アメリカのレイアウトの「キャンセル」キー。
ko: 미국식 레이아웃의 '취소'키.

source: The 'clear' key on an American layout.
ja: アメリカのレイアウトにある「クリア」キー。
ko: 미국 레이아웃의 '클리어'키.

source: The 'clearagain' key on an American layout.
ja: アメリカのレイアウトの「クリアゲイン」キー。
ko: 미국 레이아웃의 'clearagain'키.

source: The 'computer' key on an American layout.
ja: アメリカのレイアウトにある「コンピューター」キー。
ko: 미국식 레이아웃의 '컴퓨터'키.

source: The 'copy' key on an American layout.
ja: アメリカのレイアウトにある「コピー」キー。
ko: 미국식 레이아웃의 '복사'키.

source: The 'crsel' key on an American layout.
ja: アメリカのレイアウトの'crsel'キー。
ko: 미국식 레이아웃의 'crsel'키.

source: The 'cut' key on an American layout.
ja: アメリカのレイアウトの「カット」キー。
ko: 미국식 레이아웃의 '잘라 내기'키.

source: The 'escape' key on an American layout.
ja: アメリカのレイアウトの「エスケープ」キー。
ko: 미국식 레이아웃의 '탈출'키.

source: The 'execute' key on an American layout.
ja: アメリカのレイアウトの'execute'キー。
ko: 미국식 레이아웃의 '실행'키.

source: The 'exsel' key on an American layout.
ja: アメリカのレイアウトにある「エクセル」キー。
ko: 미국식 레이아웃의 '엑셀'키.

source: The 'find' key on an American layout.
ja: アメリカのレイアウトにある「FIND」キー。
ko: 미국식 레이아웃의 '찾기'키.

source: The 'help' key on an American layout.
ja: アメリカのレイアウトの「ヘルプ」キー。
ko: 미국식 레이아웃의 '도움말'키.

source: The 'menu' key on an American layout.
ja: アメリカのレイアウトの「menu」キー。
ko: 미국식 레이아웃의 '메뉴'키.

source: The 'oper' key on an American layout.
ja: アメリカのレイアウトにある「オペル」キー。
ko: 미국식 레이아웃의 '오퍼'키.

source: The 'out' key on an American layout.
ja: アメリカのレイアウトの「アウト」キー。
ko: 미국식 레이아웃의 'out'키.

source: The 'paste' key on an American layout.
ja: アメリカのレイアウトの「貼り付け」キー。
ko: 미국식 레이아웃의 '붙여 넣기'키.

source: The 'prior' key on an American layout.
ja: アメリカのレイアウトの「先行」キー。
ko: 미국 레이아웃의 '우선'키입니다.

source: The 'return' / 'enter' key on an American layout.
ja: アメリカのレイアウトの'return'/'enter'キー。
ko: 미국식 레이아웃에서 'return'/ 'enter'키.

source: The 'return2' key on an American layout.
ja: アメリカのレイアウトの'return2'キー。
ko: 미국식 레이아웃의 'return2'키.

source: The 'select' key on an American layout.
ja: アメリカのレイアウトの'select'キー。
ko: 미국식 레이아웃의 'select'키.

source: The 'separator' key on an American layout.
ja: アメリカのレイアウトの「セパレーター」キー。
ko: 미국식 레이아웃의 '구분자'키.

source: The 'stop' key on an American layout.
ja: アメリカのレイアウトの「ストップ」キー。
ko: 미국식 레이아웃의 '중지'키.

source: The 'tab' key on an American layout.
ja: アメリカのレイアウトの「タブ」キー。
ko: 미국식 레이아웃의 '탭'키.

source: The 'undo' key on an American layout.
ja: アメリカのレイアウトの「元に戻す」キー。
ko: 미국식 레이아웃의 '실행 취소'키.

source: The 1-based index of the first unread byte in the Data.
ja: Dataの最初の未読バイトの1ベースのインデックス。
ko: 데이터에서 읽지 않은 첫 번째 바이트의 1부터 시작하는 인덱스입니다.

source: The 10th function key
ja: 第10回目のファンクションキー
ko: 10 번째 기능 키

source: The 10x10 pixels per block variant of the ASTC format. RGBA data at 1.28 bits per pixel.
ja: ASTCフォーマットの1ブロックあたり10x10ピクセルのバリアント。1ピクセルあたり1.28ビットのRGBAデータ。
ko: ASTC 형식의 블록 변형 당 10x10 픽셀. 픽셀 당 1.28 비트의 RGBA 데이터.

source: The 10x5 pixels per block variant of the ASTC format. RGBA data at 2.56 bits per pixel.
ja: ASTCフォーマットの10x5ピクセル/ブロックのバリアント。1ピクセルあたり2.56ビットのRGBAデータ。
ko: ASTC 형식의 블록 변형 당 10x5 픽셀. 픽셀 당 2.56 비트의 RGBA 데이터.

source: The 10x6 pixels per block variant of the ASTC format. RGBA data at 2.13 bits per pixel.
ja: ASTCフォーマットの1ブロックあたり10x6ピクセルのバリアント。1ピクセルあたり2.13ビットのRGBAデータ。
ko: ASTC 형식의 블록 변형 당 10x6 픽셀. 픽셀 당 2.13 비트의 RGBA 데이터.

source: The 10x8 pixels per block variant of the ASTC format. RGBA data at 1.6 bits per pixel.
ja: ASTCフォーマットの10x8ピクセル/ブロックのバリアント。1ピクセルあたり1.6ビットのRGBAデータ。
ko: ASTC 형식의 블록 변형 당 10x8 픽셀. 픽셀 당 1.6 비트의 RGBA 데이터.

source: The 11th function key
ja: 第11回目のファンクションキー
ko: 제 11 기능 키

source: The 12th function key
ja: 第12回目のファンクションキー
ko: 12 번째 기능 키

source: The 12x10 pixels per block variant of the ASTC format. RGBA data at 1.07 bits per pixel.
ja: ASTCフォーマットの1ブロックあたり12x10ピクセルのバリアント。1ピクセルあたり1.07ビットのRGBAデータ。
ko: ASTC 형식의 블록 변형 당 12x10 픽셀. 픽셀 당 1.07 비트의 RGBA 데이터.

source: The 12x12 pixels per block variant of the ASTC format. RGBA data at 0.89 bits per pixel.
ja: ASTCフォーマットの1ブロックあたり12x12ピクセルのバリアント。1ピクセルあたり0.89ビットのRGBAデータ。
ko: ASTC 형식의 블록 변형 당 12x12 픽셀. 픽셀 당 0.89 비트의 RGBA 데이터.

source: The 13th function key
ja: 第13回目のファンクションキー
ko: 제 13 기능 키

source: The 14th function key
ja: 第14回ファンクションキー
ko: 14 번째 기능 키

source: The 15th function key
ja: 第15回目のファンクションキー
ko: 15 번째 기능 키

source: The 16 bpp RGB and RGBA formats use half as much VRAM as the 32 bpp RGBA formats, but they have significantly lower quality.
ja: 16bpp RGBやRGBAフォーマットは、32bpp RGBAフォーマットの半分のVRAMを使用しているが、品質はかなり劣る。
ko: 16bpp RGB 및 RGBA 형식은 32bpp RGBA 형식의 절반만큼 VRAM을 사용하지만 품질이 크게 떨어집니다.

source: The 16-bit stipple pattern.
ja: 16ビットのスティプルパターン。
ko: 16 비트 점각 패턴.

source: The 16th function key
ja: 第16回目のファンクションキー
ko: 16 번째 기능 키

source: The 17th function key
ja: 第17回ファンクションキー
ko: 제 17 기능 키

source: The 18th function key
ja: 18番目のファンクションキー
ko: 18 번째 기능 키

source: The 1st function key
ja: 第1ファンクションキー
ko: 첫 번째 기능 키

source: The 1st international key on an American layout. Used on Asian keyboards.
ja: アメリカのレイアウトでは1番目の国際キー。アジアのキーボードで使用される。
ko: 미국 레이아웃의 첫 번째 국제 키. 아시아 키보드에서 사용됩니다.

source: The 2 bit per pixel RGB variant of the PVRTC1 format. Stores RGB data at 2 bits per pixel. Textures compressed with PVRTC1 formats must be square and power-of-two sized.
ja: PVRTC1 フォーマットの 1 ピ ク セルあたり 2 ビ ッ ト の RGB バ リ ア ン ト 。RGB データを 1 ピクセルあたり 2 ビットで格納します。PVRTC1 フォーマットで圧縮されたテクスチャは、正方形でパワーオブツーサイズでなければなりません。
ko: PVRTC1 형식의 픽셀 당 2 비트 RGB 변형입니다. RGB 데이터를 픽셀 당 2 비트로 저장합니다. PVRTC1 형식으로 압축 된 텍스처는 정사각형과 2의 거듭 제곱이어야합니다.

source: The 2 bit per pixel RGBA variant of the PVRTC1 format.
ja: PVRTC1フォーマットの2ビット/ピクセルRGBAバリアント。
ko: PVRTC1 형식의 픽셀 당 2 비트 RGBA 변형입니다.

source: The 2nd function key
ja: 第2ファンクションキー
ko: 두 번째 기능 키

source: The 2nd international key on an American layout.
ja: アメリカのレイアウトの国際キー第2弾。
ko: 미국 레이아웃의 두 번째 국제 키.

source: The 3rd function key
ja: 第3のファンクションキー
ko: 세 번째 기능 키

source: The 3rd international key on an American layout. Yen.
ja: アメリカンレイアウトの国際キー第3弾。円。
ko: 미국식 배치의 3 번째 국제 키. 엔.

source: The 4 bit per pixel RGB variant of the PVRTC1 format. Stores RGB data at 4 bits per pixel.
ja: PVRTC1 フォーマットの 4 ビッ ト/ピクセル RGB バリアント。RGBデータを1ピクセルあたり4ビットで格納します。
ko: PVRTC1 형식의 픽셀 당 4 비트 RGB 변형입니다. RGB 데이터를 픽셀 당 4 비트로 저장합니다.

source: The 4 bit per pixel RGBA variant of the PVRTC1 format.
ja: PVRTC1フォーマットの4ビット/ピクセルRGBAバリアント。
ko: PVRTC1 형식의 픽셀 당 4 비트 RGBA 변형입니다.

source: The 4th function key
ja: 第4のファンクションキー
ko: 네 번째 기능 키

source: The 4th international key on an American layout.
ja: アメリカのレイアウトの国際キー第4弾。
ko: 미국식 배치의 네 번째 국제 키.

source: The 4x4 pixels per block variant of the ASTC format. RGBA data at 8 bits per pixel.
ja: ASTCフォーマットの1ブロックあたり4x4ピクセルのバリアント。1ピクセルあたり8ビットのRGBAデータ。
ko: ASTC 형식의 블록 변형 당 4x4 픽셀. 픽셀 당 8 비트의 RGBA 데이터.

source: The 5th function key
ja: 第5回目のファンクションキー
ko: 다섯 번째 기능 키

source: The 5th international key on an American layout.
ja: アメリカのレイアウトの国際キー第5弾。
ko: 미국식 배치의 다섯 번째 국제 키.

source: The 5x4 pixels per block variant of the ASTC format. RGBA data at 6.4 bits per pixel.
ja: 5x4ピクセル/ブロックのASTCフォーマットのバリアント。1ピクセルあたり6.4ビットのRGBAデータ。
ko: ASTC 형식의 블록 변형 당 5x4 픽셀. 픽셀 당 6.4 비트의 RGBA 데이터.

source: The 5x5 pixels per block variant of the ASTC format. RGBA data at 5.12 bits per pixel.
ja: ASTCフォーマットの5x5ピクセル/ブロックのバリアント。1ピクセルあたり5.12ビットのRGBAデータ。
ko: ASTC 형식의 블록 변형 당 5x5 픽셀. 픽셀 당 5.12 비트의 RGBA 데이터.

source: The 6th function key
ja: 第6回目のファンクションキー
ko: 여섯 번째 기능 키

source: The 6th international key on an American layout.
ja: アメリカのレイアウトの国際キー第6弾。
ko: 미국식 배치의 6 번째 국제 키.

source: The 6x5 pixels per block variant of the ASTC format. RGBA data at 4.27 bits per pixel.
ja: ASTCフォーマットの6x5ピクセル/ブロックのバリアント。1ピクセルあたり4.27ビットのRGBAデータ。
ko: ASTC 형식의 블록 변형 당 6x5 픽셀. 픽셀 당 4.27 비트의 RGBA 데이터.

source: The 6x6 pixels per block variant of the ASTC format. RGBA data at 3.56 bits per pixel.
ja: ASTCフォーマットの6x6ピクセル/ブロックのバリアント。1ピクセルあたり3.56ビットのRGBAデータ。
ko: ASTC 형식의 블록 변형 당 6x6 픽셀. 픽셀 당 3.56 비트의 RGBA 데이터.

source: The 7th function key
ja: 第7回目のファンクションキー
ko: 일곱 번째 기능 키

source: The 7th international key on an American layout.
ja: アメリカのレイアウトの国際キー第7弾。
ko: 미국식 배치의 7 번째 국제 키.

source: The 8th function key
ja: 第8回目のファンクションキー
ko: 제 8 기능 키

source: The 8th international key on an American layout.
ja: アメリカのレイアウトで8番目の国際キー。
ko: 미국식 배치의 8 번째 국제 키.

source: The 8x5 pixels per block variant of the ASTC format. RGBA data at 3.2 bits per pixel.
ja: ASTCフォーマットの8x5ピクセル/ブロックのバリアント。1ピクセルあたり3.2ビットのRGBAデータ。
ko: ASTC 형식의 블록 변형 당 8x5 픽셀. 픽셀 당 3.2 비트의 RGBA 데이터.

source: The 8x6 pixels per block variant of the ASTC format. RGBA data at 2.67 bits per pixel.
ja: ASTCフォーマットの8x6ピクセル/ブロックのバリアント。1ピクセルあたり2.67ビットのRGBAデータ。
ko: ASTC 형식의 블록 변형 당 8x6 픽셀. 픽셀 당 2.67 비트의 RGBA 데이터.

source: The 8x8 pixels per block variant of the ASTC format. RGBA data at 2 bits per pixel.
ja: ASTCフォーマットの1ブロックあたり8x8ピクセルのバリアント。1ピクセルあたり2ビットのRGBAデータ。
ko: ASTC 형식의 블록 변형 당 8x8 픽셀. 픽셀 당 2 비트의 RGBA 데이터.

source: The 9th function key
ja: 第9回目のファンクションキー
ko: 제 9 기능 키

source: The 9th international key on an American layout.
ja: アメリカのレイアウトで9番目の国際キー。
ko: 미국식 배치의 9 번째 국제 키.

source: The <a href="enet.peer"> peer's</a> current round trip time in milliseconds.
ja: <a href="enet.peer">ピアの</a>ミリ秒単位の現在の往復時間。
ko: <a href="enet.peer">피어의</a> 밀리 초 현재의 왕복 시간.

source: The <a href="enet.peer"> peer's</a> current state. It can be any of the following:
ja: <a href="enet.peer">ピアの</a>現在の状態。次のいずれかになります。
ko: <a href="enet.peer">피어의</a> 현재 상태입니다. 다음 중 하나 일 수 있습니다.

source: The <a href="enet.peer"> peer's</a> last round trip time computation in milliseconds.
ja: <a href="enet.peer">ピアの</a>ミリ秒単位の最後のラウンドトリップ時間計算。
ko: <a href="enet.peer">피어의</a> 밀리 초 마지막 라운드 트립 시간 계산.

source: The <a href="file">File</a> object containing the Ogg Theora video.
ja: <a href="file">ファイル</a>のOgg Theoraのビデオを含むオブジェクト。
ko: Ogg Theora 비디오가 포함 된 <a href="file">File</a> 객체입니다.

source: The <a href="font-getdpiscale">DPI scale factor</a> of the font.
ja: フォントの<a href="font-getdpiscale">DPIスケール係数</a>。
ko: 글꼴 의 <a href="font-getdpiscale">DPI 배율</a> 입니다.

source: The <a href="image">Image</a> or <a href="canvas">Canvas</a> to use for the sprites.
ja: <a href="image">画像</a>または<a href="canvas">キャンバスは</a>、スプライトに使用します。
ko: <a href="image">이미지</a> 또는 <a href="canvas">캔버스</a> 스프라이트에 사용할.

source: The <a href="image">Image</a> or <a href="canvas">Canvas</a> to use when drawing the Mesh. May be nil to use no texture.
ja: <a href="image">画像</a>や<a href="canvas">キャンバス</a>メッシュを描画するときに使用します。テクスチャを使用しない場合は、nilになります。
ko: <a href="image">이미지</a> 또는 <a href="canvas">캔버스</a> 메쉬를 그릴 때 사용합니다. 텍스처를 사용하지 않을 수 있습니다.

source: The <a href="image">Image</a> or <a href="canvas">Canvas</a> used for the particles.
ja: <a href="image">画像</a>または<a href="canvas">キャンバスは</a>、粒子のために使用しました。
ko: 입자에 사용 된 <a href="image">이미지</a> 또는 <a href="canvas">캔버스</a> 입니다.

source: The <a href="joystick-getguid">GUID</a> value to get the mapping string for.
ja: マッピング文字列を取得するための<a href="joystick-getguid">GUID</a>値。
ko: <a href="joystick-getguid">GUID</a> 값의 매핑 문자열을 얻을 수 있습니다.

source: The <a href="love.graphics">love.graphics</a> and <a href="love.window">love.window</a> modules have several restrictions and therefore can only be used in the main thread.
ja: <a href="love.graphics">love.graphics</a>と<a href="love.window">love.window</a>モジュールは、いくつかの制限があり、したがって、メインスレッドだけで使用することができます。
ko: <a href="love.graphics">love.graphics</a> 및 <a href="love.window">love.window</a> 모듈은 몇 가지 제한이 때문에 단지 메인 스레드에서 사용할 수 있습니다.

source: The <a href="love.graphics">love.graphics</a> module has several functions and function variants which accept Transform objects.
ja: <a href="love.graphics">love.graphicsの</a>モジュールは、オブジェクトを変換受け入れるいくつかの機能と機能のバリアントを持っています。
ko: <a href="love.graphics">love.graphics의</a> 모듈은 객체를 변환 받아 여러 기능과 기능 변종이있다.
