Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/love/love.*.006.xlf
Languages: es, ja, ko, zh_cn

source: The y-coordinate of the upper left corner of the rectangle to intersect with the existing scissor rectangle.
es: La coordenada y de la esquina superior izquierda del rectángulo para intersectar con el rectángulo de tijera existente.
zh_cn: 矩形的左上角与现有剪刀型矩形相交的Y坐标。

source: The y-coordinate of the window's position in its current display. Added in <a href="https://love2d.org/wiki/0.9.2">0.9.2</a>.
es: La coordenada y de la posici&oacute;n de la ventana en su visualizaci&oacute;n actual. Agregado en <a href="https://love2d.org/wiki/0.9.2">0.9.2</a> .
zh_cn: 窗口在其当前显示中的位置的y坐标。在<a href="https://love2d.org/wiki/0.9.2">0.9.2中</a>添加。

source: The y-coordinate of the window's position in the specified display. Added in <a href="https://love2d.org/wiki/0.9.2">0.9.2</a>.
es: La coordenada y de la posici&oacute;n de la ventana en la pantalla especificada. Agregado en <a href="https://love2d.org/wiki/0.9.2">0.9.2</a> .
zh_cn: 指定显示中窗口位置的y坐标。在<a href="https://love2d.org/wiki/0.9.2">0.9.2中</a>添加。

source: The y-coordinate of the window's position.
es: La coordenada "y" de la posición de la ventana.
zh_cn: 窗口位置的Y坐标。

source: The z position of the listener.
es: La posición z del oyente.
zh_cn: 听筒的Z位置。

source: The zero key
es: La tecla cero
zh_cn: 零键

source: The zlib format is DEFLATE-compressed data with a small bit of header data. Compresses relatively slowly and decompresses moderately quickly, and has a decent compression ratio.
es: El formato zlib es DEFLATE-datos comprimidos con un poco de datos de cabecera.Se comprime relativamente despacio y se descomprime moderadamente rápido,y tiene un ratio de compresión decente.
zh_cn: zlib格式是DEFLATE压缩的数据,有一小部分头数据。压缩速度相对较慢,解压速度适中,压缩比也不错。

source: There are <a href="http://www.noisemachine.com/talk1/">many</a><a href="http://libnoise.sourceforge.net/noisegen/">webpages</a> which discuss Perlin and Simplex noise in detail.
es: Hay <a href="http://www.noisemachine.com/talk1/">muchas </a><a href="http://libnoise.sourceforge.net/noisegen/">p&aacute;ginas web</a> que tratan en detalle el ruido Perlin y Simplex.
zh_cn: 有<a href="http://www.noisemachine.com/talk1/">许多</a><a href="http://libnoise.sourceforge.net/noisegen/">网页</a>详细讨论了Perlin和Simplex噪声。

source: There are several built-in variables L&Ouml;VE provides in vertex and pixel shaders. All built-in variables are read-only unless otherwise specified.
es: Hay varias variables integradas que proporciona L&Ouml;VE en los sombreadores de v&eacute;rtices y p&iacute;xeles. Todas las variables integradas son de solo lectura a menos que se especifique lo contrario.
zh_cn: L&Ouml;VE在顶点和像素着色器中提供了多个内置变量。除非另有说明，否则所有内置变量均为只读。

source: There are three types of bodies.
es: Hay tres tipos de cuerpos.
zh_cn: 有三种类型的身体。

source: There are two methods to check for body collisions:
es: Hay dos métodos para comprobar si hay colisiones de cuerpos:
zh_cn: 检查身体碰撞的方法有两种。

source: There can be up to 16 categories. Categories and masks are encoded as the bits of a 16-bit integer.
es: Puede haber hasta 16 categorías.Las categorías y las máscaras se codifican como los bits de un entero de 16 bits.
zh_cn: 最多可以有16个类别。类别和掩码以16位整数的位数编码。

source: There is a bug in <a href="https://love2d.org/wiki/0.10.2">0.10.2</a> which causes position of the anchor points (x1, y1, x2, y2) in global coordinates instead of local (more <a href="https://bitbucket.org/rude/love/issues/1232/in-lovephysicsnewweldjoint-position-of-the">https://bitbucket.org/rude/love/issues/1232/in-lovephysicsnewweldjoint-position-of-the</a>).
es: Hay un error en <a href="https://love2d.org/wiki/0.10.2">0.10.2</a> que causa la posici&oacute;n de los puntos de anclaje (x1, y1, x2, y2) en coordenadas globales en lugar de locales (m&aacute;s <a href="https://bitbucket.org/rude/love/issues/1232/in-lovephysicsnewweldjoint-position-of-the">https://bitbucket.org/rude/love/issues/1232/in- lovephysicsnewweldjoint-position-of-the</a> ).
zh_cn: <a href="https://love2d.org/wiki/0.10.2">0.10.2中</a>存在一个错误，该错误会导致锚点（x1，y1，x2，y2）在全局坐标而不是局部坐标中的位置（更多<a href="https://bitbucket.org/rude/love/issues/1232/in-lovephysicsnewweldjoint-position-of-the">https://bitbucket.org/rude/love/issues/1232/in- lovephysicsnewweldjoint-of-the</a>）。

source: There is a bug in <a href="https://love2d.org/wiki/0.8.0">0.8.0</a> where the normal vector returned by this function gets scaled by <a href="love.physics.getmeter">love.physics.getMeter</a>.
es: Hay un error en <a href="https://love2d.org/wiki/0.8.0">0.8.0</a> donde el vector normal devuelto por esta funci&oacute;n es escalado por <a href="love.physics.getmeter">love.physics.getMeter</a> .
zh_cn: <a href="https://love2d.org/wiki/0.8.0">0.8.0</a>中存在一个错误，此函数返回的法向矢量由<a href="love.physics.getmeter">love.physics.getMeter</a>缩放。

source: There is a bug in L&Ouml;VE <a href="https://love2d.org/wiki/0.8.0">0.8.0</a> where the normal vector passed to the callback function gets scaled by <a href="love.physics.getmeter">love.physics.getMeter</a>.
es: Hay un error en L&Ouml;VE <a href="https://love2d.org/wiki/0.8.0">0.8.0</a> donde el vector normal pasado a la funci&oacute;n de devoluci&oacute;n de llamada es escalado por <a href="love.physics.getmeter">love.physics.getMeter</a> .
zh_cn: 爱里的错误<a href="https://love2d.org/wiki/0.8.0">0.8.0</a>，其中传递给回调函数法向量得到由缩放<a href="love.physics.getmeter">love.physics.getMeter</a>。

source: There is a bug in version 0.8.0 where the cooridnates of the anchors are divided by the number from <a href="love.physics.getmeter">love.physics.getMeter</a>. As a workaround, multiply your anchor coordinates with that number and it should work like expected.
es: Hay un error en la versi&oacute;n 0.8.0 donde los cooridnatos de las anclas se dividen por el n&uacute;mero de <a href="love.physics.getmeter">love.physics.getMeter</a> . Como soluci&oacute;n alternativa, multiplique sus coordenadas de anclaje con ese n&uacute;mero y deber&iacute;a funcionar como se esperaba.
zh_cn: 有一个在0.8.0版中的错误，其中的锚杆的cooridnates通过从数除以<a href="love.physics.getmeter">love.physics.getMeter</a>。解决方法是，将锚坐标乘以该数字，它应能按预期工作。

source: There is a bug in version <a href="https://love2d.org/wiki/0.10.2">0.10.2</a> which causes Shader:send to ignore the last argument when sending arrays. A simple workaround is to add an extra dummy argument when sending multiple values to a uniform array.
es: Hay un error en la versi&oacute;n <a href="https://love2d.org/wiki/0.10.2">0.10.2</a> que hace que Shader: send ignore el &uacute;ltimo argumento al enviar matrices. Una soluci&oacute;n alternativa sencilla es agregar un argumento ficticio adicional al enviar varios valores a una matriz uniforme.
zh_cn: <a href="https://love2d.org/wiki/0.10.2">0.10.2</a>版中存在一个错误，该错误会导致Shader：send在发送数组时忽略最后一个参数。一个简单的解决方法是在将多个值发送到统一数组时添加一个额外的哑元参数。

source: There is an <a href="http://feedback.wildfiregames.com/report/opengl/feature/GL_MAX_TEXTURE_SIZE">online database</a> which has collected info about the max image size for various systems.
es: Existe una <a href="http://feedback.wildfiregames.com/report/opengl/feature/GL_MAX_TEXTURE_SIZE">base de datos en l&iacute;nea</a> que ha recopilado informaci&oacute;n sobre el tama&ntilde;o m&aacute;ximo de imagen para varios sistemas.
zh_cn: 有一个<a href="http://feedback.wildfiregames.com/report/opengl/feature/GL_MAX_TEXTURE_SIZE">在线数据库</a>收集了有关各种系统的最大图像大小的信息。

source: There's a bug in <a href="https://love2d.org/wiki/0.8.0">0.8.0</a> preventing this function from working
es: Hay un error en <a href="https://love2d.org/wiki/0.8.0">0.8.0 que</a> impide que esta funci&oacute;n funcione
zh_cn: <a href="https://love2d.org/wiki/0.8.0">0.8.0中</a>存在一个错误，导致该功能无法正常工作

source: There's a bug in <a href="https://love2d.org/wiki/0.8.0">0.8.0</a> preventing this function from working.
es: Hay un error en <a href="https://love2d.org/wiki/0.8.0">0.8.0 que</a> impide que esta funci&oacute;n funcione.
zh_cn: <a href="https://love2d.org/wiki/0.8.0">0.8.0中</a>存在一个错误，导致该功能无法正常工作。

source: Therefore the Canvas' pixel colors will have
es: Por lo tanto,los colores de los píxeles del lienzo tendrán
zh_cn: 因此Canvas的像素颜色将有

source: These built-in shader variables are not supported in earlier versions.
es: Estas variables de sombreado incorporadas no están soportadas en las versiones anteriores.
zh_cn: 这些内置的着色器变量在早期版本中不支持。

source: These flags are not supported in earlier versions.
es: Estas banderas no son compatibles con las versiones anteriores.
zh_cn: 在早期版本中不支持这些标志。

source: These functions have parentheses in odd places. This is because the
es: Estas funciones tienen paréntesis en lugares impares.Esto se debe a que el
zh_cn: 这些函数的括号都在奇数位置。这是因为

source: These variants are not supported in earlier versions.
es: Estas variantes no son compatibles con las versiones anteriores.
zh_cn: 在早期版本中不支持这些变体。

source: Third event argument.
es: Argumento del tercer evento.
zh_cn: 第三事件论证。

source: Third-party modules
es: Módulos de terceros
zh_cn: 第三方模块

source: This behaviour is not supported in earlier versions.
es: Este comportamiento no está respaldado en las versiones anteriores.
zh_cn: 此行为在早期版本中不支持。

source: This behaviour is not supported in that and later versions.
es: Este comportamiento no está respaldado en esa y otras versiones posteriores.
zh_cn: 该版本及以后的版本不支持这种行为。

source: This bluescreens if there is a syntax error in the loaded file. If you want to continue your game if the file is not valid (for example if you expect it to be written by users), you can protect the calling of the chunk with <b>pcall</b>:
es: Esto se muestra en pantalla azul si hay un error de sintaxis en el archivo cargado. Si desea continuar su juego si el archivo no es v&aacute;lido (por ejemplo, si espera que lo escriban los usuarios), puede proteger la llamada del fragmento con <b>pcall</b> :
zh_cn: 如果加载的文件中存在语法错误，则此屏幕会蓝屏。如果您想在文件无效的情况下继续游戏（例如，如果您希望它由用户编写），则可以使用<b>pcall</b>保护调用块：

source: This callback is also triggered after <a href="love.load">love.load</a> for every Joystick which was already connected when the game started up.
es: Esta devoluci&oacute;n de llamada tambi&eacute;n se activa despu&eacute;s de <a href="love.load">love.load</a> para cada Joystick que ya estaba conectado cuando se inici&oacute; el juego.
zh_cn: 在游戏启动时已连接的每个游戏杆在<a href="love.load">love.load</a>之后也会触发此回调。

source: This callback is not supported in earlier versions.
es: Esta devolución de llamada no está soportada en las versiones anteriores.
zh_cn: 此回调在早期版本中不支持。

source: This callback is not supported in that and later versions.
es: Esta devolución de llamada no está soportada en esa y otras versiones posteriores.
zh_cn: 该版本及以后的版本不支持此回调。

source: This can be used to determine whether a file is inside the save directory or the game's source .love.
es: Esto puede ser usado para determinar si un archivo está dentro del directorio de guardado o de la fuente del juego .love.
zh_cn: 这可以用来判断一个文件是在保存目录内还是在游戏的源码.love内。

source: This can help prevent unwanted collisions when a flat shape slides along the edge and moves over to the new shape.
es: Esto puede ayudar a prevenir colisiones indeseadas cuando una forma plana se desliza a lo largo del borde y se mueve hacia la nueva forma.
zh_cn: 当平面形状沿边缘滑动并移动到新形状时,这可以帮助防止不必要的碰撞。

source: This change lasts until <a href="love.draw">love.draw</a>() exits or else a <a href="love.graphics.pop">love.graphics.pop</a> reverts to a previous <a href="love.graphics.push">love.graphics.push</a>.
es: Este cambio dura hasta que sale <a href="love.draw">love.draw</a> () o de lo contrario un <a href="love.graphics.pop">love.graphics.pop</a> vuelve a un <a href="love.graphics.push">love.graphics.push</a> anterior .
zh_cn: 此更改将持续到<a href="love.draw">love.draw</a>（）退出，否则<a href="love.graphics.pop">love.graphics.pop</a>会恢复为先前的<a href="love.graphics.push">love.graphics.push</a>。

source: This constant has been renamed from <b>normal</b>
es: Esta constante ha sido renombrada de <b>normal</b>
zh_cn: 该常量已从<b>正常名称</b>重命名<b></b>

source: This constant has been renamed to <b>exclusive</b>
es: Esta constante ha sido renombrada a <b>exclusiva</b>
zh_cn: 此常量已重命名为<b>Exclusive</b>

source: This does <b>not</b> change the position of the Source, but lets the application know how it has to calculate the doppler effect.
es: Esto <b>no</b> cambia la posici&oacute;n de la Fuente, pero permite que la aplicaci&oacute;n sepa c&oacute;mo debe calcular el efecto Doppler.
zh_cn: 这并<b>不会</b>改变源的位置，但让应用程序知道它如何计算多普勒效应。

source: This enum is not supported in earlier or later versions.
es: Esta enumeración no es compatible con las versiones anteriores o posteriores.
zh_cn: 此枚举在早期或以后的版本中不支持。

source: This enum is not supported in earlier versions.
es: Esta lista no es compatible con las versiones anteriores.
zh_cn: 此枚举在早期版本中不支持。

source: This enum is not supported in that and later versions.
es: Esta enumeración no está respaldada en esa y otras versiones posteriores.
zh_cn: 该版本及以后的版本不支持该枚举。

source: This example demonstrates how an absolute source is affected by the position of the listener.
es: Este ejemplo demuestra cómo una fuente absoluta se ve afectada por la posición del oyente.
zh_cn: 这个例子展示了绝对源是如何受到监听者位置的影响。

source: This example is not supported in earlier versions.
es: Este ejemplo no es compatible con las versiones anteriores.
zh_cn: 早期版本不支持本例。

source: This example randomly draws a bunch of red lines from the top left corner of the screen to the bottom.
es: Este ejemplo dibuja aleatoriamente un montón de líneas rojas desde la esquina superior izquierda de la pantalla hasta la parte inferior.
zh_cn: 这个例子从屏幕的左上角到底部随机画了一堆红线。

source: This example shows how the return value of <strong>love.quit</strong> can be used to stop the closing of the game.
es: Este ejemplo muestra c&oacute;mo se puede utilizar el valor de retorno de <strong>love.quit</strong> para detener el cierre del juego.
zh_cn: 本示例说明<strong>love.quit</strong>的返回值如何用于停止游戏的结束。

source: This example shows how to give the coordinates explicitly and how to pass a table argument.
es: Este ejemplo muestra cómo dar las coordenadas explícitamente y cómo pasar un argumento de tabla.
zh_cn: 这个例子展示了如何显式地给出坐标以及如何传递表参数。

source: This example shows how to rotate a static scene around a given point. Since the rotation is always around the origin, translating the center of the screen to the origin and back around the rotate operation makes the effective rotation point be the center of the screen. This is demonstrated by drawing a rectangle that shows the rotation and a point that is right in the center and thus does not move when the scene rotates. Note that the drawing commands have coordinates that depend solely on the screen size.
es: Este ejemplo muestra cómo rotar una escena estática alrededor de un punto determinado.Dado que la rotación es siempre alrededor del origen,trasladar el centro de la pantalla al origen y de vuelta alrededor de la operación de rotación hace que el punto de rotación efectivo sea el centro de la pantalla.Esto se demuestra dibujando un rectángulo que muestra la rotación y un punto que está justo en el centro y por lo tanto no se mueve cuando la escena rota.Note que los comandos de dibujo tienen coordenadas que dependen únicamente del tamaño de la pantalla.
zh_cn: 这个例子展示了如何围绕一个给定的点旋转一个静态场景。由于旋转总是围绕着原点进行,所以将屏幕中心转换到原点,然后再围绕旋转操作,使得有效的旋转点是屏幕的中心。通过绘制一个显示旋转的矩形和一个正处于中心的点来证明这一点,因此当场景旋转时不会移动。注意,绘图命令的坐标完全取决于屏幕大小。

source: This example will create a burst of particles when the spacebar is pressed. You can use the <a href="https://love2d.org/wiki/File:Love-game-logo-256x256.png">l&ouml;ve logo</a> as an example image.
es: Este ejemplo crear&aacute; una explosi&oacute;n de part&iacute;culas cuando se presione la barra espaciadora. Puede utilizar el <a href="https://love2d.org/wiki/File:Love-game-logo-256x256.png">logotipo de l&ouml;ve</a> como imagen de ejemplo.
zh_cn: 当按下空格键时，此示例将创建粒子爆发。您可以将<a href="https://love2d.org/wiki/File:Love-game-logo-256x256.png">l&ouml;ve徽标</a>用作示例图像。

source: This fixture will <b>NOT</b> collide with the fixtures that are in the selected categories if the other fixture also has a category of this fixture selected.
es: Este aparato <b>NO</b> chocar&aacute; con los aparatos que est&aacute;n en las categor&iacute;as seleccionadas si el otro aparato tambi&eacute;n tiene una categor&iacute;a de este aparato seleccionada.
zh_cn: 如果另一个灯具也选择了该灯具的类别，则该灯具将<b>不会</b>与所选类别中的灯具发生碰撞。

source: This flag determines the name of the save directory for your game. Note that you can only specify the name, not the location where it will be created:
es: Esta bandera determina el nombre del directorio de guardado de tu juego.Ten en cuenta que sólo puedes especificar el nombre,no la ubicación donde se creará:
zh_cn: 这个标志决定了你的游戏的保存目录的名称。注意,你只能指定名称,而不能指定创建目录的位置。

source: This flag has been replaced by the gammacorrect flag.
es: Esta bandera ha sido reemplazada por la bandera gammacorrecta.
zh_cn: 该标志已被gammacorrect标志所取代。

source: This flag has been replaced by the window.msaa flag.
es: Esta bandera ha sido reemplazada por la bandera de la ventana.msaa.
zh_cn: 该标志已被window.msaa标志所取代。

source: This flag is not supported in earlier or later versions.
es: Esta bandera no está soportada en las versiones anteriores o posteriores.
zh_cn: 此标志在早期或以后的版本中不支持。

source: This flag is not supported in earlier versions.
es: Esta bandera no está soportada en las versiones anteriores.
zh_cn: 在早期版本中不支持该标志。

source: This function accounts for newlines correctly (i.e. '\n').
es: Esta función da cuenta de las nuevas líneas correctamente (es decir,'\n').
zh_cn: 该函数正确地计算了新行(即"\n")。

source: This function can be slow if it is called every frame, such as from <a href="love.update">love.update</a> or <a href="love.draw">love.draw</a>.
es: Esta funci&oacute;n puede ser lenta si se llama a todos los fotogramas, como desde <a href="love.update">love.update</a> o <a href="love.draw">love.draw</a> .
zh_cn: 如果在每个帧（例如，从<a href="love.update">love.update</a>或<a href="love.draw">love.draw中</a>）调用此函数，它的速度可能会很慢。

source: This function can be slow if it is called repeatedly, such as from <a href="love.update">love.update</a> or <a href="love.draw">love.draw</a>. Create multiple Text objects with different Fonts if you need to rapidly switch fonts.
es: Esta funci&oacute;n puede ser lenta si se llama repetidamente, como desde <a href="love.update">love.update</a> o <a href="love.draw">love.draw</a> . Cree varios objetos de texto con diferentes fuentes si necesita cambiar r&aacute;pidamente de fuente.
zh_cn: 如果反复调用此函数（例如从<a href="love.update">love.update</a>或<a href="love.draw">love.draw）</a>，则该函数可能会很慢。如果需要快速切换字体，请创建多个具有不同字体的Text对象。

source: This function can be slow if it is called repeatedly, such as from <a href="love.update">love.update</a> or <a href="love.draw">love.draw</a>. If you need to use a specific resource often, create it once and store it somewhere it can be reused!
es: Esta funci&oacute;n puede ser lenta si se llama repetidamente, como desde <a href="love.update">love.update</a> o <a href="love.draw">love.draw</a> . Si necesita usar un recurso espec&iacute;fico con frecuencia, cr&eacute;elo una vez y gu&aacute;rdelo en alg&uacute;n lugar donde pueda reutilizarse.
zh_cn: 如果反复调用此函数（例如从<a href="love.update">love.update</a>或<a href="love.draw">love.draw）</a>，则该函数可能会很慢。如果您需要经常使用特定资源，请创建一次并将其存储在可以重用的位置！

source: This function can be used to move objects along paths or tween parameters. However it should not be used to render the curve, see <a href="beziercurve-render">BezierCurve:render</a> for that purpose.
es: Esta funci&oacute;n se puede utilizar para mover objetos a lo largo de rutas o par&aacute;metros de interpolaci&oacute;n. Sin embargo, no debe usarse para renderizar la curva, consulte <a href="beziercurve-render">BezierCurve: render</a> para ese prop&oacute;sito.
zh_cn: 此功能可用于沿路径或补间参数移动对象。但是，不应将其用于渲染曲线，为此请参见<a href="beziercurve-render">BezierCurve：render</a>。

source: This function can be used to rotate sprites moving along a curve in the direction of the movement and compute the direction perpendicular to the curve at some parameter t.
es: Esta función puede utilizarse para rotar los sprites que se mueven a lo largo de una curva en la dirección del movimiento y calcular la dirección perpendicular a la curva en algún parámetro t.
zh_cn: 这个函数可以用来旋转沿曲线运动的精灵,并计算在某个参数t处垂直于曲线的方向。

source: This function can be very slow: it can cause the CPU to wait for the GPU to finish all the work currently in its queue, which can be a whole frame's worth (or more.)
es: Esta función puede ser muy lenta:puede hacer que la CPU espere a que la GPU termine todo el trabajo que está en su cola,que puede ser el valor de un cuadro entero (o más).
zh_cn: 这个功能可能会非常慢:它可能会导致CPU等待GPU完成当前在其队列中的所有工作,这可能是一整帧的价值(或更多)。

source: This function cannot wake up the body.
es: Esta función no puede despertar al cuerpo.
zh_cn: 这个功能不能唤醒身体。

source: This function causes the entire thread to pause for the duration of the sleep. Graphics will not draw, input events will not trigger, code will not run, and the window will be unresponsive if you use this as "wait()" in the main thread. Use love.update or a Timer library for that instead.
es: Esta función hace que todo el hilo se detenga mientras dure el sueño.Los gráficos no se dibujarán,los eventos de entrada no se dispararán,el código no se ejecutará,y la ventana no responderá si se usa esto como "wait()" en el hilo principal.Usa love.update o una librería Timer para eso.
zh_cn: 这个函数会使整个线程在睡眠期间暂停。如果你在主线程中使用这个函数作为 "wait()",图形将无法绘制,输入事件将无法触发,代码将无法运行,窗口将无响应。使用 love.update 或 Timer 库来代替。

source: This function converts coordinates from pixels to the size users are expecting them to display at onscreen. <a href="love.window.topixels">love.window.toPixels</a> does the opposite. The <code>highdpi</code> window flag must be enabled to use the full pixel density of a Retina screen on Mac OS X and iOS. The flag currently does nothing on Windows and Linux, and on Android it is effectively always enabled.
es: Esta funci&oacute;n convierte las coordenadas de p&iacute;xeles al tama&ntilde;o que los usuarios esperan que se muestren en la pantalla. <a href="love.window.topixels">love.window.toPixels</a> hace lo contrario. El <code>highdpi</code> ventana de alta resoluci&oacute;n debe estar habilitado para usar la densidad de p&iacute;xeles completa de una pantalla Retina en Mac OS X e iOS. Actualmente, la bandera no hace nada en Windows y Linux, y en Android siempre est&aacute; habilitada.
zh_cn: 此功能可将坐标从像素转换为用户期望它们在屏幕上显示的大小。<a href="love.window.topixels">love.window.toPixels</a>则相反。该 <code>highdpi</code> 窗口标志必须能够使用在Mac OS X和iOS视网膜屏幕的全像素密度。该标志当前在Windows和Linux上不起作用，而在Android上始终有效。

source: This function creates a new World with the given size, no gravity and sleeping turned on.
es: Esta función crea un nuevo mundo con el tamaño dado,sin gravedad y con el sueño encendido.
zh_cn: 这个函数可以创建一个新的世界,给定的大小,没有重力,开启睡眠。

source: This function does not apply retroactively to loaded images.
es: Esta función no se aplica retroactivamente a las imágenes cargadas.
zh_cn: 此功能不溯及既往地适用于已加载的图像。

source: This function does not detect mouse wheel scrolling; you must use the <a href="love.wheelmoved">love.wheelmoved</a> (or <a href="love.mousepressed">love.mousepressed</a> in version <a href="https://love2d.org/wiki/0.9.2">0.9.2</a> and older) callback for that.
es: Esta funci&oacute;n no detecta el desplazamiento de la rueda del mouse; debe usar la devoluci&oacute;n de llamada <a href="love.wheelmoved">love.wheelmoved</a> (o <a href="love.mousepressed">love.mousepressed</a> en la versi&oacute;n <a href="https://love2d.org/wiki/0.9.2">0.9.2</a> y anteriores) para eso.
zh_cn: 此功能不检测鼠标滚轮滚动；您必须<a href="love.wheelmoved">为此</a>使用love.wheelmoved（或在<a href="https://love2d.org/wiki/0.9.2">0.9.2</a>及<a href="love.mousepressed">更高</a>版本中为love.mousepressed）回调。
