Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/love/love.*.006.xlf
Languages: es, ja, ko, zh_cn

source: The reported position of the mouse may not be updated while relative mode is enabled, even when relative mouse <a href="love.mousemoved">motion events</a> are generated.
es: Es posible que la posici&oacute;n informada del mouse no se actualice mientras el modo relativo est&aacute; habilitado, incluso cuando se generan <a href="love.mousemoved">eventos de movimiento</a> relativo del mouse .
zh_cn: 启用相对模式时，即使已生成相对鼠标<a href="love.mousemoved">移动事件</a>，也可能不会更新报告的鼠标位置。

source: The requested <a href="enet.host"> host</a>.
es: El <a href="enet.host">anfitri&oacute;n</a> solicitado .
zh_cn: 请求的<a href="enet.host">主机</a>。

source: The response speed.
es: La velocidad de respuesta.
zh_cn: 响应速度。

source: The restitution between the two shapes.
es: La restitución entre las dos formas.
zh_cn: 两种形状之间的还原。

source: The restitution of the shape.
es: La restitución de la forma.
zh_cn: 形状的恢复。

source: The restitution of this Shape.
es: La restitución de esta forma.
zh_cn: 本形的归还。

source: The return value might be constant if only integer arguments are used. Avoid solely passing in integers, to get varying return values.
es: El valor de retorno podría ser constante si sólo se utilizan argumentos enteros.Evite pasar únicamente números enteros,para obtener valores de retorno variables.
zh_cn: 如果只使用整数参数,返回值可能是常数。避免只传入整数,以获得不同的返回值。

source: The return value of this function is always zero or negative, with a negative value indicating overlap between the two shapes.
es: El valor de retorno de esta función es siempre cero o negativo,con un valor negativo que indica la superposición entre las dos formas.
zh_cn: 该函数的返回值始终为零或负值,负值表示两个形状的重叠。

source: The returned <code>id</code>s range from 1 to the set <a href="spritebatch-setbuffersize">buffer size</a>. If the buffer size is exceeded the returned <code>id</code> will default to 0 and the sprite won't be drawn.
es: Los <code>id</code> devueltos van desde 1 hasta el <a href="spritebatch-setbuffersize">tama&ntilde;o de b&uacute;fer</a> establecido . Si se excede el tama&ntilde;o del b&uacute;fer, la <code>id</code> entificaci&oacute;n devuelta se establecer&aacute; por defecto en 0 y no se dibujar&aacute; el objeto.
zh_cn: 返回的 <code>id</code> 的范围是1到设置的<a href="spritebatch-setbuffersize">缓冲区大小</a>。如果超出缓冲区大小，则返回的 <code>id</code> 将默认为0，并且不会绘制精灵。

source: The returned number depends on the system running the code. It is safe to assume it will never be less than 1024 and will almost always be 2048 or greater.
es: El número devuelto depende del sistema que ejecuta el código.Es seguro asumir que nunca será menos de 1024 y casi siempre será 2048 o más.
zh_cn: 返回的数字取决于运行代码的系统。可以肯定的是,它永远不会小于1024,几乎总是2048或更大。

source: The revision version of L&Ouml;VE, i.e. 1 for version 0.9.1.
es: La versi&oacute;n de revisi&oacute;n de L&Ouml;VE, es decir, 1 para la versi&oacute;n 0.9.1.
zh_cn: L&Ouml;VE的修订版本，即0.9.1的1。

source: The right GUI (command / windows / super) key on an American layout.
es: La tecla correcta GUI (command/windows/super)en un diseño americano.
zh_cn: 美式布局上的右GUI(命令/窗口/超级)键。

source: The right alt / option key on an American layout.
es: La tecla derecha de alt/opción en un diseño americano.
zh_cn: 美式布局上的右alt/选项键。

source: The right and bottom edges of the object are shifted at an angle defined by the shearing factors.
es: Los bordes derecho e inferior del objeto se desplazan en un ángulo definido por los factores de cizallamiento.
zh_cn: 物体的右侧和底部边缘以剪切系数定义的角度移动。

source: The right control key on an American layout.
es: La tecla de control correcta en un diseño americano.
zh_cn: 美式布局的右侧控制键。

source: The right shift key on an American layout.
es: La tecla shift derecha en un diseño americano.
zh_cn: 美式布局的右移键。

source: The right-arrow key on an American layout.
es: La tecla de la flecha derecha en un diseño americano.
zh_cn: 美式布局上的右箭头键。

source: The right-bracket key on an American layout.
es: La llave del soporte derecho en un diseño americano.
zh_cn: 美式布局的右括号键。

source: The rolloff factor.
es: El factor de despegue.
zh_cn: 滚动系数。

source: The root folder of the .love archive (or source directory)
es: La carpeta raíz del archivo .love (o directorio de origen)
zh_cn: .love档案的根目录(或源目录)。

source: The root folder of the game's
es: La carpeta raíz del juego
zh_cn: 游戏的根文件夹。

source: The rotational inertia is how hard is it to make the body spin. It is set with the 4th argument to <a href="body-setmass">Body:setMass</a>, or automatically with <a href="body-setmassfromshapes">Body:setMassFromShapes</a>.
es: La inercia rotacional es lo dif&iacute;cil que es hacer girar el cuerpo. Se establece con el cuarto argumento en <a href="body-setmass">Body: setMass</a> , o autom&aacute;ticamente con <a href="body-setmassfromshapes">Body: setMassFromShapes</a> .
zh_cn: 旋转惯性使身体旋转起来有多困难。可以使用<a href="body-setmass">Body：setMass</a>的第4个参数进行设置，也可以使用<a href="body-setmassfromshapes">Body：setMassFromShapes</a>自动进行设置。

source: The rotational inertia of the body.
es: La inercia rotacional del cuerpo.
zh_cn: 身体的旋转惯性。

source: The rotational inertia, in kilograms per squared meter.
es: La inercia rotacional,en kilogramos por metro cuadrado.
zh_cn: 旋转惯性,单位为公斤/平方米。

source: The rotational inertia.
es: La inercia rotacional.
zh_cn: 的旋转惯性。

source: The rotational inertial of the body.
es: La inercia rotacional del cuerpo.
zh_cn: 体的旋转惯性。

source: The sRGB format should only be used when doing gamma-correct rendering, which is an advanced topic and it's easy to get color-spaces mixed up. If you're not sure whether you need this, you might want to avoid it. Read more about gamma-correct rendering <a href="http://http.developer.nvidia.com/GPUGems3/gpugems3_ch24.html">here</a>, <a href="http://filmicgames.com/archives/299">here</a>, and <a href="http://renderwonk.com/blog/index.php/archive/adventures-with-gamma-correct-rendering/">here</a>.
es: El formato sRGB solo debe usarse cuando se realiza una representaci&oacute;n con correcci&oacute;n gamma, que es un tema avanzado y es f&aacute;cil mezclar los espacios de color. Si no est&aacute; seguro de si lo necesita, es posible que desee evitarlo. Lea m&aacute;s sobre el renderizado con correcci&oacute;n de gamma <a href="http://http.developer.nvidia.com/GPUGems3/gpugems3_ch24.html">aqu&iacute;</a> , <a href="http://filmicgames.com/archives/299">aqu&iacute;</a> y <a href="http://renderwonk.com/blog/index.php/archive/adventures-with-gamma-correct-rendering/">aqu&iacute;</a> .
zh_cn: sRGB格式仅在进行伽玛校正渲染时才应使用，这是一个高级主题，很容易使色彩空间混淆。如果不确定是否需要此功能，则可以避免使用它。<a href="http://http.developer.nvidia.com/GPUGems3/gpugems3_ch24.html">在此处</a>，<a href="http://filmicgames.com/archives/299">此处</a>和<a href="http://renderwonk.com/blog/index.php/archive/adventures-with-gamma-correct-rendering/">此处</a>了解有关伽玛校正渲染的更多信息。

source: The same as <code>normal</code>, but the texture is
es: Igual que de <code>normal</code> , pero la textura es
zh_cn: 和 <code>normal</code> 的一样，但是纹理是

source: The same as <code>rgba8</code>, but the Canvas is
es: Lo mismo que <code>rgba8</code> , pero el Canvas es
zh_cn: 与 <code>rgba8</code> 相同，但是Canvas是

source: The scale factor as an integer.
es: El factor de escala como un entero.
zh_cn: 比例系数为整数。

source: The scaling in the direction of the x-axis.
es: La escalada en la dirección del eje X.
zh_cn: X轴方向的缩放。

source: The scaling in the direction of the y-axis. If omitted, it defaults to same as parameter sx.
es: La escalada en la dirección del eje Y.Si se omite,es igual al parámetro sx.
zh_cn: Y轴方向上的缩放比例,如果省略,默认与参数sx相同。如果省略,默认与参数sx相同。

source: The scancode corresponding to the given key, or "unknown" if the given key has no known physical representation on the current system.
es: El código de barras correspondiente a la clave dada,o "desconocido" si la clave dada no tiene representación física conocida en el sistema actual.
zh_cn: 对应于给定钥匙的扫描码,如果给定钥匙在当前系统中没有已知的物理表示,则为 "未知"。

source: The scancode representing the pressed key.
es: El código de escaneado que representa la tecla pulsada.
zh_cn: 代表按下的键的扫描码。

source: The scancode representing the released key.
es: El código de escaneado que representa la llave liberada.
zh_cn: 代表释放钥匙的扫描码。

source: The scancode to get the key from.
es: El código de escaneo para obtener la llave.
zh_cn: 要获取钥匙的扫描码。

source: The scissor limits the drawing area to a specified rectangle. This affects all graphics calls, including <a href="love.graphics.clear">love.graphics.clear</a>.
es: La tijera limita el &aacute;rea de dibujo a un rect&aacute;ngulo espec&iacute;fico. Esto afecta a todas las llamadas de gr&aacute;ficos, incluido <a href="love.graphics.clear">love.graphics.clear</a> .
zh_cn: 剪刀将绘图区域限制为指定的矩形。这会影响所有图形调用，包括<a href="love.graphics.clear">love.graphics.clear</a>。

source: The scroll-lock key on an American layout.
es: La tecla de bloqueo de desplazamiento en un diseño americano.
zh_cn: 美式布局上的卷锁键。

source: The second Body.
es: El segundo cuerpo.
zh_cn: 第二体。

source: The second Fixture.
es: El segundo aparato.
zh_cn: 第二个夹具。

source: The second Quad to use.
es: El segundo Quad a usar.
zh_cn: 第二个要用的四合院。

source: The second body to attach to the joint.
es: El segundo cuerpo que se une a la articulación.
zh_cn: 第二种体例连接到关节上。

source: The second body to connect with a Revolute Joint.
es: El segundo cuerpo que se conecta con una Junta Revolutiva.
zh_cn: 第二种体例是用Revolute接头连接。

source: The second body to connect with a prismatic joint.
es: El segundo cuerpo que se conecta con una articulación prismática.
zh_cn: 第二种体例与棱形接头连接。

source: The second body to connect with a pulley joint.
es: El segundo cuerpo que se conecta con una articulación de polea.
zh_cn: 第二主体与滑轮接头连接。

source: The second body.
es: El segundo cuerpo.
zh_cn: 第二体。

source: The second category selected by the mask.
es: La segunda categoría seleccionada por la máscara.
zh_cn: 面具选择的第二类。

source: The second category.
es: La segunda categoría.
zh_cn: 第二类:

source: The second connected Joint.
es: El segundo conectaba la articulación.
zh_cn: 第二个连接接头。

source: The second fixture.
es: El segundo accesorio.
zh_cn: 第二个固定装置。

source: The second joint to connect with a gear joint.
es: La segunda junta para conectar con una junta de engranaje.
zh_cn: 第二个接头要与齿轮接头连接。

source: The second render target.
es: El segundo objetivo de renderizado.
zh_cn: 第二个渲染目标。

source: The second size.
es: El segundo tamaño.
zh_cn: 第二种尺寸。

source: The second value of the 2-dimensional vector used to generate the noise value.
es: El segundo valor del vector bidimensional utilizado para generar el valor del ruido.
zh_cn: 用于生成噪声值的二维向量的第二个值。

source: The second value of the 3-dimensional vector used to generate the noise value.
es: El segundo valor del vector tridimensional utilizado para generar el valor del ruido.
zh_cn: 用于生成噪声值的三维向量的第二个值。

source: The second value of the 4-dimensional vector used to generate the noise value.
es: El segundo valor del vector cuatridimensional utilizado para generar el valor del ruido.
zh_cn: 用于生成噪声值的4维向量的第二个值。

source: The seed is split into two numbers due to Lua's use of <a href="http://en.wikipedia.org/wiki/Double-precision_floating-point_format">doubles</a> for all number values - doubles can't accurately represent integer values above 2^53, but the seed can be an integer value up to 2^64.
es: La semilla se divide en dos n&uacute;meros debido al uso que hace Lua de <a href="http://en.wikipedia.org/wiki/Double-precision_floating-point_format">dobles</a> para todos los valores num&eacute;ricos; los dobles no pueden representar con precisi&oacute;n valores enteros por encima de 2 ^ 53, pero la semilla puede ser un valor entero de hasta 2 ^ 64.
zh_cn: 由于Lua 对所有数值使用<a href="http://en.wikipedia.org/wiki/Double-precision_floating-point_format">双精度</a>数，因此种子被分为两个数-双精度数不能准确表示2 ^ 53以上的整数，但种子可以是2 ^ 64以下的整数。

source: The seed is split into two numbers due to Lua's use of <a href="http://en.wikipedia.org/wiki/Double-precision_floating-point_format">doubles</a> for all number values - doubles can't accurately represent integer values above 2^53, but the seed value is an integer number in the range of [0, 2^64 - 1].
es: La semilla se divide en dos n&uacute;meros debido al uso de <a href="http://en.wikipedia.org/wiki/Double-precision_floating-point_format">dobles</a> de Lua para todos los valores num&eacute;ricos: los dobles no pueden representar con precisi&oacute;n valores enteros por encima de 2 ^ 53, pero el valor de semilla es un n&uacute;mero entero en el rango de [0, 2 ^ 64 - 1].
zh_cn: 由于Lua 对所有数值使用<a href="http://en.wikipedia.org/wiki/Double-precision_floating-point_format">双精度</a>数，因此种子被分为两个数字-双精度数不能准确表示2 ^ 53以上的整数，但是种子值是[0，2 ^ 64- 1]。

source: The semicolon key on an American layout.
es: La tecla de punto y coma en un diseño americano.
zh_cn: 美式布局上的分号键。

source: The sensor status.
es: El estado de los sensores.
zh_cn: 传感器状态。

source: The separation between the two shapes.
es: La separación entre las dos formas.
zh_cn: 两种形状之间的分离。

source: The sequence of glyphs in the ImageData.
es: La secuencia de glifos en el ImageData.
zh_cn: ImageData中的字形序列。

source: The seven key
es: Las siete claves
zh_cn: 七大关键

source: The shape density.
es: La densidad de la forma.
zh_cn: 形状密度。

source: The shape rotation.
es: La rotación de la forma.
zh_cn: 形状旋转。

source: The shape to be copied to the fixture.
es: La forma que se copiará en el aparato.
zh_cn: 要复制到夹具上的形状。

source: The shear factor on the x-axis.
es: El factor de cizallamiento en el eje X.
zh_cn: X轴上的剪切系数。

source: The shear factor on the y-axis.
es: El factor de cizallamiento en el eje Y.
zh_cn: y轴上的剪切系数。

source: The signed single-channel variant of the EAC format. Same as above but pixel values in the texture are in the range of [-1, 1] instead of [0, 1] in shaders.
es: La variante firmada de un solo canal del formato EAC.Igual que el anterior,pero los valores de los píxeles en la textura están en el rango de [-1,1]en lugar de [0,1]en los sombreadores.
zh_cn: EAC格式的签名单通道变体,与上述相同,但纹理中的像素值在着色器中的范围是[-1,1]而不是[0,1]。和上面一样,但纹理中的像素值是在[-1,1]的范围内,而不是在着色器中的[0,1]。

source: The signed two-channel variant of the EAC format.
es: La variante de dos canales firmados del formato EAC.
zh_cn: EAC格式的签名双通道变体。

source: The signed variant of the BC4 format. Same as above but pixel values in the texture are in the range of [-1, 1] instead of [0, 1] in shaders.
es: La variante firmada del formato BC4.Igual que el anterior,pero los valores de los píxeles en la textura están en el rango de [-1,1]en lugar de [0,1]en los sombreadores.
zh_cn: BC4格式的签名变体,与上述相同,但纹理中的像素值是在[-1,1]的范围内,而不是在着色器中的[0,1]。和上面一样,但纹理中的像素值是在[-1,1]的范围内,而不是在着色器中的[0,1]。

source: The signed variant of the BC5 format.
es: La variante firmada del formato BC5.
zh_cn: BC5格式的签字变体。

source: The signed variant of the BC6H format. Stores RGB data in the range of [-65504, +65504].
es: La variante firmada del formato BC6H.Almacena datos RGB en el rango de [-65504,+65504].
zh_cn: BC6H格式的符号变体。将RGB数据存储在[-65504,+65504]的范围内。

source: The single-channel variant of the EAC format. Stores just the red channel, at 4 bits per pixel.
es: La variante de un solo canal del formato EAC.Almacena sólo el canal rojo,a 4 bits por píxel.
zh_cn: EAC格式的单通道变体。只存储红色通道,每像素4位。

source: The six key
es: Las seis claves
zh_cn: 六大关键

source: The size in bytes of the file, or nil on failure.
es: El tamaño en bytes del archivo,o cero en caso de fallo.
zh_cn: 文件的大小,以字节为单位,如果失败则为零。

source: The size of 1 meter in pixels.
es: El tamaño de 1 metro en píxeles.
zh_cn: 1米的大小,以像素为单位。

source: The size of each decoded chunk, in bytes.
es: El tamaño de cada trozo decodificado,en bytes.
zh_cn: 每个解码块的大小,以字节为单位。

source: The size of the Data in bytes.
es: El tamaño de los datos en bytes.
zh_cn: 数据的大小,单位为字节。

source: The size of the font in pixels.
es: El tamaño de la fuente en píxeles.
zh_cn: 字体的大小,单位为像素。

source: The size of the font.
es: El tamaño de la fuente.
zh_cn: 字体的大小。

source: The sizes of points are not affected by <a href="love.graphics.scale">love.graphics.scale</a> &ndash; they're always in pixels.
es: Los tama&ntilde;os de los puntos no se ven afectados por <a href="love.graphics.scale">love.graphics.scale</a> ; siempre est&aacute;n en p&iacute;xeles.
zh_cn: 点的大小不受<a href="love.graphics.scale">love.graphics.scale的</a>影响&ndash;它们始终以像素为单位。

source: The sleeping status of the body.
es: El estado de sueño del cuerpo.
zh_cn: 身体的睡眠状态。

source: The smallest x position in the world.
es: La posición X más pequeña del mundo.
zh_cn: 世界上最小的x位。

source: The smallest y position in the world.
es: La posición y más pequeña del mundo.
zh_cn: 世界上最小的y位。

source: The sound data will be decoded to the memory in a raw format. It is recommended to create only short sounds like effects, as a 3 minute song uses 30 MB of memory this way.
es: Los datos de sonido se decodificarán en la memoria en un formato crudo.Se recomienda crear sólo sonidos cortos como efectos,ya que una canción de 3 minutos utiliza 30 MB de memoria de esta manera.
zh_cn: 声音数据将以原始格式解码到内存中。建议只创建短的声音,如效果,因为一首3分钟的歌曲使用30 MB的内存,这种方式。

source: The source on which to pause the playback
es: La fuente en la que detener la reproducción
zh_cn: 暂停播放的源

source: The source on which to resume the playback.
es: La fuente en la que reanudar la reproducción.
zh_cn: 恢复播放的源。

source: The source to rewind.
es: La fuente para rebobinar.
zh_cn: 源头要倒腾。

source: The spacebar on an American layout.
es: La barra espacial en un diseño americano.
zh_cn: 美式布局上的空格键。

source: The speed of the joint motor in radians per second.
es: La velocidad del motor conjunto en radianes por segundo.
zh_cn: 联合电机的速度,单位是弧度/秒。

source: The spread of the emitter (radians).
es: La propagación del emisor (radianes).
zh_cn: 发射器的分布(弧度);

source: The start cursor of the selected candidate text.
es: El cursor de inicio del texto del candidato seleccionado.
zh_cn: 候选文本的起始光标。

source: The starting point along the curve. Must be between 0 and 1.
es: El punto de partida a lo largo de la curva.Debe estar entre 0 y 1.
zh_cn: 曲线的起始点。必须在0和1之间。

source: The static status of the body.
es: El estado estático del cuerpo.
zh_cn: 体的静态状态。

source: The status of the joint motor.
es: El estado del motor conjunto.
zh_cn: 联合电机的状态。

source: The stencil value of a pixel will be bitwise-inverted for each object that touches the pixel. If a stencil value of 0 is inverted it will become 255.
es: El valor de la plantilla de un píxel se invertirá en bits para cada objeto que toque el píxel.Si se invierte el valor del patrón de 0,se convertirá en 255.
zh_cn: 一个像素的模板值将对每个接触该像素的对象进行位宽反转。如果钢网值为0,则会被反转为255。

source: The stencil value of a pixel will be decremented by 1 for each object that touches the pixel. If the stencil value of 0 is decremented it will be set to 255.
es: El valor de la plantilla de un píxel se reducirá en 1 por cada objeto que toque el píxel.Si el valor de la plantilla de 0 se disminuye,se fijará en 255.
zh_cn: 每接触一个像素的对象,该像素的钢网值就会减少1。如果钢网值为0,则会被设置为255。

source: The stencil value of a pixel will be decremented by 1 for each object that touches the pixel. If the stencil value reaches 0 it will stay at 0.
es: El valor de la plantilla de un píxel se reducirá en 1 por cada objeto que toque el píxel.Si el valor de la plantilla llega a 0,se mantendrá en 0.
zh_cn: 每接触一个像素的对象,该像素的钢网值就会减少1。如果钢网值达到0,它将保持在0。

source: The stencil value of a pixel will be incremented by 1 for each object that touches the pixel. If a stencil value of 255 is incremented it will be set to 0.
es: El valor de la plantilla de un píxel se incrementará en 1 por cada objeto que toque el píxel.Si se incrementa el valor del patrón de 255,se pondrá a 0.
zh_cn: 每接触一个像素的对象,该像素的钢网值就会增加1。如果钢网值为255,则会被设置为0。

source: The stencil value of a pixel will be incremented by 1 for each object that touches the pixel. If the stencil value reaches 255 it will stay at 255.
es: El valor de la plantilla de un píxel se incrementará en 1 por cada objeto que toque el píxel.Si el valor del esténcil llega a 255,se mantendrá en 255.
zh_cn: 每接触一个像素的对象,该像素的钢网值就会增加1。如果钢网值达到255,它将保持在255。

source: The stencil value of a pixel will be replaced by the value specified in <a href="love.graphics.stencil">love.graphics.stencil</a>, if any object touches the pixel.
es: El valor de la plantilla de un p&iacute;xel ser&aacute; reemplazado por el valor especificado en <a href="love.graphics.stencil">love.graphics.stencil</a> , si alg&uacute;n objeto toca el p&iacute;xel.
zh_cn: 如果有任何物体触摸像素，则该像素的模板值将替换为<a href="love.graphics.stencil">love.graphics.stencil中</a>指定的值。

source: The stencil value of the pixel must <b>not</b> be equal to the <a href="love.graphics.setstenciltest">supplied value</a>.
es: El valor de la plantilla del p&iacute;xel <b>no</b> debe ser igual al <a href="love.graphics.setstenciltest">valor proporcionado</a> .
zh_cn: 像素的模板值<b>不得</b>等于<a href="love.graphics.setstenciltest">提供的值</a>。

source: The stencil value of the pixel must be equal to the <a href="love.graphics.setstenciltest">supplied value</a>.
es: El valor de la plantilla del p&iacute;xel debe ser igual al <a href="love.graphics.setstenciltest">valor proporcionado</a> .
zh_cn: 像素的模板值必须等于<a href="love.graphics.setstenciltest">提供的值</a>。

source: The stencil value of the pixel must be greater than or equal to the <a href="love.graphics.setstenciltest">supplied value</a>.
es: El valor de la plantilla del p&iacute;xel debe ser mayor o igual que el <a href="love.graphics.setstenciltest">valor proporcionado</a> .
zh_cn: 像素的模板值必须大于或等于<a href="love.graphics.setstenciltest">提供的值</a>。

source: The stencil value of the pixel must be greater than the <a href="love.graphics.setstenciltest">supplied value</a>.
es: El valor de la plantilla del p&iacute;xel debe ser mayor que el <a href="love.graphics.setstenciltest">valor proporcionado</a> .
zh_cn: 像素的模板值必须大于<a href="love.graphics.setstenciltest">提供的值</a>。

source: The stencil value of the pixel must be less than or equal to the <a href="love.graphics.setstenciltest">supplied value</a>.
es: El valor de la plantilla del p&iacute;xel debe ser menor o igual que el <a href="love.graphics.setstenciltest">valor proporcionado</a> .
zh_cn: 像素的模板值必须小于或等于<a href="love.graphics.setstenciltest">提供的值</a>。

source: The stencil value of the pixel must be less than the <a href="love.graphics.setstenciltest">supplied value</a>.
es: El valor de la plantilla del p&iacute;xel debe ser menor que el <a href="love.graphics.setstenciltest">valor proporcionado</a> .
zh_cn: 像素的模板值必须小于<a href="love.graphics.setstenciltest">提供的值</a>。

source: The string data to append to the file.
es: Los datos de la cadena que se adjuntarán al archivo.
zh_cn: 要附加到文件中的字符串数据。

source: The string data to write to the file.
es: Los datos de la cadena a escribir en el archivo.
zh_cn: 要写入文件的字符串数据。

source: The string data to write.
es: Los datos de la cadena a escribir.
zh_cn: 要写入的字符串数据。

source: The styles in which lines are drawn.
es: Los estilos en los que se dibujan las líneas.
zh_cn: 绘制线条的样式。

source: The superclass of all L&Ouml;VE types.
es: La superclase de todos los tipos L&Ouml;VE.
zh_cn: 所有L&Ouml;VE类型的超类。

source: The superclass of all data.
es: La superclase de todos los datos.
zh_cn: 所有数据的超类。

source: The supported maximum number of MSAA samples varies depending on the system. Use <a href="love.graphics.getsystemlimits">love.graphics.getSystemLimits</a> to check.
es: El n&uacute;mero m&aacute;ximo admitido de muestras de MSAA var&iacute;a seg&uacute;n el sistema. Utilice <a href="love.graphics.getsystemlimits">love.graphics.getSystemLimits</a> para comprobarlo.
zh_cn: 支持的最大MSAA样本数取决于系统。使用<a href="love.graphics.getsystemlimits">love.graphics.getSystemLimits</a>进行检查。

source: The sysreq key on an American layout.
es: La tecla sysreq en un diseño americano.
zh_cn: 美式布局的sysreq键。

source: The system power scancode.
es: El escaneado de la energía del sistema.
zh_cn: 系统电源扫描码。

source: The system sleep scancode.
es: El sistema de escaneado del sueño.
zh_cn: 系统睡眠扫描码。
