Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/love/love.*.006.xlf
Languages: es, ja, ko, zh_cn

source: The baseline of the Font in pixels.
ja: フォントのベースラインをピクセル単位で指定します。
ko: 폰트의베이스 라인 (픽셀 단위).

source: The basic state of the power supply.
ja: 電源の基本的な状態です。
ko: 전원 공급 장치의 기본 상태입니다.

source: The basic state of the system's power supply.
ja: システムの電源の基本的な状態です。
ko: 시스템 전원 공급 장치의 기본 상태입니다.

source: The blend mode to use.
ja: 使用するブレンドモード。
ko: 사용할 블렌드 모드.

source: The blue channel of the color to clear the screen to.
ja: 画面をクリアする色の青チャンネルにします。
ko: 화면을 지우는 색상의 파란색 채널.

source: The blue channel of the converted color in gamma sRGB space.
ja: ガンマsRGB空間で変換された色の青チャンネル。
ko: 감마 sRGB 공간에서 변환 된 색상의 파란색 채널입니다.

source: The blue channel of the converted color in linear RGB space.
ja: リニアRGB空間で変換された色の青チャンネル。
ko: 선형 RGB 공간에서 변환 된 색상의 파란색 채널입니다.

source: The blue channel of the linear RGB color to convert.
ja: 変換するリニアRGBカラーの青チャンネル。
ko: 변환 할 선형 RGB 색상의 파란색 채널입니다.

source: The blue channel of the sRGB color to convert.
ja: 変換するsRGBカラーの青チャンネル。
ko: 변환 할 sRGB 색상의 파란색 채널입니다.

source: The blue color component.
ja: 青色の成分です。
ko: 파란색 구성 요소입니다.

source: The blue component (0-1).
ja: 青色成分(0-1)です。
ko: 파란색 구성 요소 (0-1)입니다.

source: The blue component (0-255).
ja: 青色成分(0~255)です。
ko: 파란색 구성 요소 (0-255)

source: The blue component of the vertex color.
ja: 頂点の色の青色成分。
ko: 꼭짓점 색상의 파란색 구성 요소입니다.

source: The blue component of the vertex's color.
ja: 頂点の色の青色成分。
ko: 꼭짓점 색상의 파란색 구성 요소입니다.

source: The body sleep status.
ja: 身体の睡眠状態。
ko: 신체 수면 상태.

source: The body the shape is attached to.
ja: 形状が取り付けられている本体。
ko: 모양이 붙어있는 몸.

source: The body to attach the shape to.
ja: 形をつけるための本体。
ko: 몸에 모양을 붙입니다.

source: The body to attach to the mouse.
ja: マウスに装着する本体。
ko: 마우스에 부착 할 본체입니다.

source: The body type.
ja: ボディタイプです。
ko: 체형.

source: The body which gets the fixture attached.
ja: 固定具を取り付ける本体。
ko: 픽스쳐를 장착 한 본체.

source: The body will wake up if another body collides with it, if a joint or contact attached to it is destroyed, or if <a href="body-wakeup">Body:wakeUp</a> is called.
ja: 別のボディが衝突したり、それに接続されているジョイントやコンタクトが破壊されたり、<a href="body-wakeup">Body：wakeUp</a>が呼び出されたりすると、ボディがウェイクアップします。
ko: 다른 바디가 충돌 할 경우, 바디에 연결된 조인트 또는 접점이 파손되거나 <a href="body-wakeup">Body : wakeUp</a> 이 호출 되면 바디 가 깨어납니다 .

source: The brightness-down scancode.
ja: 明るさダウンのスキャンコード。
ko: 밝기 감소 스캔 코드.

source: The brightness-up scancode.
ja: 明るさアップのスキャンコード。
ko: 밝기 업 스캔 코드.

source: The buffer mode to use.
ja: 使用するバッファモード。
ko: 사용할 버퍼 모드입니다.

source: The buffer size.
ja: バッファサイズ。
ko: 버퍼 크기

source: The bullet status of the body.
ja: 本体の弾の状態。
ko: 시체의 총알 상태입니다.

source: The button index that was pressed. 1 is the primary mouse button, 2 is the secondary mouse button and 3 is the middle button. Further buttons are mouse dependent.
ja: 押されたボタンのインデックス。1はマウスのプライマリボタン、2はマウスのセカンダリボタン、3は真ん中のボタンです。それ以上のボタンはマウスに依存します。
ko: 누른 버튼 인덱스입니다. 1은 기본 마우스 버튼, 2는 보조 마우스 버튼, 3은 가운데 버튼입니다. 추가 버튼은 마우스에 따라 다릅니다.

source: The button index that was released. 1 is the primary mouse button, 2 is the secondary mouse button and 3 is the middle button. Further buttons are mouse dependent.
ja: リリースされたボタンインデックス。1がマウスのプライマリボタン、2がマウスのセカンダリボタン、3がミドルボタンです。それ以上のボタンはマウスに依存します。
ko: 해제 된 버튼 인덱스입니다. 1은 기본 마우스 버튼, 2는 보조 마우스 버튼, 3은 가운데 버튼입니다. 추가 버튼은 마우스에 따라 다릅니다.

source: The button number.
ja: ボタンの番号です。
ko: 버튼 번호.

source: The button to be checked
ja: チェックするボタン
ko: 확인할 버튼

source: The button to check.
ja: チェックするボタンです。
ko: 확인할 버튼입니다.

source: The byte string to copy.
ja: コピーするバイト文字列。
ko: 복사 할 바이트 문자열입니다.

source: The calculator key on an American layout.
ja: アメリカのレイアウトの電卓キー。
ko: 미국식 레이아웃의 계산기 키.

source: The candidate text is not the final text that the user will eventually choose. Use <a href="love.textinput">love.textinput</a> for that.
ja: 候補テキストは、ユーザーが最終的に選択する最終的なテキストではありません。そのためには<a href="love.textinput">love.textinput</a>を使用します。
ko: 후보 텍스트는 사용자가 최종적으로 선택할 최종 텍스트가 아닙니다. <a href="love.textinput">그것을</a> 위해 love.textinput 을 사용하십시오 .

source: The capslock key on an American layout.
ja: アメリカのレイアウトのキャップロックキー。
ko: 미국식 배치의 Capslock 키.

source: The categories as an integer from 0 to 65535.
ja: カテゴリは0から65535までの整数である。
ko: 범주는 0에서 65535 사이의 정수입니다.

source: The channel to send the packet on. Defaults to 0.
ja: パケットを送信するチャネル。デフォルトは 0 です。
ko: 패킷을 보낼 채널입니다. 기본값은 0입니다.

source: The channel to send the packet on. Optional. Defaults to 0.
ja: パケットを送信するチャネル。オプション。デフォルトは 0 です。
ko: 패킷을 보낼 채널입니다. 선택 과목. 기본값은 0입니다.

source: The character code of the glyph.
ja: グリフの文字コード。
ko: 글리프의 문자 코드입니다.

source: The child as an EdgeShape.
ja: EdgeShapeとしての子。
ko: EdgeShape로서의 아이

source: The child index of the first fixture's shape.
ja: 最初のフィクスチャの形状の子インデックス。
ko: 첫 번째 조명기 모양의 자식 인덱스입니다.

source: The child index of the second fixture's shape.
ja: 第2のフィクスチャの形状の子インデックス。
ko: 두 번째 조명기 모양의 자식 인덱스입니다.

source: The childIndex parameter is used to specify which child of a parent shape, such as a ChainShape, will be ray casted. For ChainShapes, the index of 1 is the first edge on the chain. Ray casting a parent shape will only test the child specified so if you want to test every shape of the parent, you must loop through all of its children.
ja: childIndexパラメータは、ChainShapeなどの親シェイプのどの子シェイプがレイキャストされるかを指定するために使用されます。ChainShapesの場合、1のインデックスはチェーンの最初のエッジになります。親シェイプのレイキャストは指定された子シェイプのみをテストするので、親シェイプのすべてのシェイプをテストしたい場合は、すべての子シェイプをループしなければなりません。
ko: childIndex 매개 변수는 ChainShape와 같은 부모 모양의 자식을 캐스트하는 데 사용됩니다. ChainShapes의 경우 인덱스 1은 체인의 첫 번째 모서리입니다. 부모 모양을 광선으로 캐스팅하면 지정된 자식 만 테스트하므로 부모의 모든 모양을 테스트하려면 모든 자식을 반복해야합니다.

source: The codename of the current version, i.e. "Baby Inspector" for version 0.9.1.
ja: 現在のバージョンのコードネーム、つまりバージョン0.9.1の場合は "Baby Inspector"。
ko: 현재 버전의 코드 이름입니다 (예 : 버전 0.9.1의 "Baby Inspector").

source: The color mask determines whether individual components of the colors of drawn objects will affect the color of the screen. They affect <a href="love.graphics.clear">love.graphics.clear</a> and <a href="canvas-clear">Canvas:clear</a> as well.
ja: カラーマスクは、描画されたオブジェクトの色の個々のコンポーネントが画面の色に影響を与えるかどうかを決定します。それらは<a href="love.graphics.clear">love.graphics.clear</a>と<a href="canvas-clear">Canvas：clear</a>にも影響します。
ko: 색상 마스크는 그려진 객체 색상의 개별 구성 요소가 화면 색상에 영향을 미치는지 여부를 결정합니다. <a href="love.graphics.clear">love.graphics.clear</a> 및 <a href="canvas-clear">Canvas : clear</a> 에도 영향을줍니다 .

source: The color mode to use.
ja: 使用するカラーモード。
ko: 사용할 컬러 모드.

source: The color of the pixel.
ja: ピクセルの色。
ko: 픽셀의 색입니다.

source: The color of the vertex, sprite, or text character if a <a href="mesh">Mesh</a>, <a href="spritebatch">SpriteBatch</a>, or <a href="text">Text</a> object with per-vertex colors is drawn, or in L&Ouml;VE <a href="https://love2d.org/wiki/0.9.2">0.9.2</a> and older the global color set with <a href="love.graphics.setcolor">love.graphics.setColor</a>. It does not have <a href="love.graphics.isgammacorrect">gamma-correction</a> applied.
ja: 頂点、スプライト、またはテキスト文字の色ならば<a href="mesh">メッシュ</a>、<a href="spritebatch">SpriteBatch</a>、または<a href="text">テキストの</a>頂点ごとの色を持つオブジェクトを描画する、または恋に<a href="https://love2d.org/wiki/0.9.2">0.9.2</a>およびそれ以前のグローバル色セット<a href="love.graphics.setcolor">love.graphics.setColor</a>。<a href="love.graphics.isgammacorrect">ガンマ補正は</a>適用されていません。
ko: 정점 별 색상이있는 <a href="mesh">Mesh</a> , <a href="spritebatch">SpriteBatch</a> 또는 <a href="text">Text</a> 객체가 그려지는 경우 정점, 스프라이트 또는 텍스트 문자의 색상 또는 <a href="love.graphics.setcolor">L&Ouml;VE </a><a href="https://love2d.org/wiki/0.9.2">0.9.2</a> 이상에서 love.graphics.setColor로 설정된 전체 색상 . <a href="love.graphics.isgammacorrect">감마 보정이</a> 적용 되지 않습니다 .

source: The color set by <a href="love.graphics.setcolor">love.graphics.setColor</a> will be combined (multiplied) with the colors of the text, when drawing the Text object.
ja: <a href="love.graphics.setcolor">love.graphics.setColorで</a>設定された色は、Textオブジェクトを描画するときに、テキストの色と結合（乗算）されます。
ko: <a href="love.graphics.setcolor">love.graphics.setColor에</a> 의해 설정된 색상은 Text 객체를 그릴 때 텍스트 색상과 결합 (곱셈)됩니다.

source: The color set by <a href="love.graphics.setcolor">love.graphics.setColor</a> will be combined (multiplied) with the colors of the text.
ja: <a href="love.graphics.setcolor">love.graphics.setColorで</a>設定された色は、テキストの色と結合（乗算）されます。
ko: <a href="love.graphics.setcolor">love.graphics.setColor로</a> 설정 한 색상이 텍스트 색상과 결합 (곱셈)됩니다.

source: The colors of what's drawn completely replace what was on the screen, with no additional blending. The <a href="blendalphamode">BlendAlphaMode</a> specified in <a href="love.graphics.setblendmode">love.graphics.setBlendMode</a> still affects what happens.
ja: 描画されたものの色は、画面上にあったものを完全に置き換え、追加のブレンドはありません。<a href="blendalphamode">BlendAlphaMode</a>で指定<a href="love.graphics.setblendmode">love.graphics.setBlendModeは</a>まだ何が起こるかに影響します。
ko: 그려진 내용의 색상은 추가 혼합없이 화면에 표시된 내용을 완전히 대체합니다. <a href="blendalphamode">BlendAlphaMode</a> 에 지정된 <a href="love.graphics.setblendmode">love.graphics.setBlendMode는</a> 여전히 무슨 영향을 미칩니다.

source: The colors passed into <a href="love.graphics.setcolor">love.graphics.setColor</a>, <a href="love.graphics.clear">love.graphics.clear</a>, and <a href="shader-sendcolor">Shader:sendColor</a> will automatically be <a href="love.math.gammatolinear">converted</a> from sRGB to linear RGB.
ja: <a href="love.graphics.setcolor">love.graphics.setColor</a>、<a href="love.graphics.clear">love.graphics.clear</a>、および<a href="shader-sendcolor">Shader：sendColorに</a>渡される色は、sRGBからリニアRGBに自動的に<a href="love.math.gammatolinear">変換さ</a>れます。
ko: <a href="love.graphics.setcolor">love.graphics.setColor</a> , <a href="love.graphics.clear">love.graphics.clear</a> 및 <a href="shader-sendcolor">Shader : sendColor에</a> 전달 된 색상 은 sRGB에서 선형 RGB <a href="love.math.gammatolinear">로</a> 자동 변환 됩니다.

source: The colors set in <a href="spritebatch">SpriteBatches</a>, <a href="love.graphics.print">text with per-character colors</a>, <a href="particlesystem">ParticleSystems</a>, <a href="love.graphics.points">points with per-point colors</a>, standard <a href="mesh">Meshes</a>, and <a href="love.graphics.newmesh">custom Meshes</a> which use the "VertexColor" attribute name will automatically be converted from sRGB to linear RGB when those objects are drawn.
ja: <a href="spritebatch">SpriteBatches</a>で設定された<a href="love.graphics.print">色</a>、文字ごとの色のテキスト、<a href="particlesystem">ParticleSystems</a>、<a href="love.graphics.points">点ごとの色のポイント</a>、標準<a href="mesh">メッシュ</a>、および「VertexColor」属性名を使用する<a href="love.graphics.newmesh">カスタムメッシュ</a>は、これらのオブジェクトが描画されるときに、sRGBから線形RGBに自動的に変換されます。
ko: 설정 색상 <a href="spritebatch">SpriteBatches는</a> , <a href="love.graphics.print">문자 별 색상 텍스트</a> , <a href="particlesystem">ParticleSystems</a> , <a href="love.graphics.points">당 포인트 색 점</a> , 표준 <a href="mesh">메쉬</a> 및 <a href="love.graphics.newmesh">사용자 정의 메쉬</a> 자동으로 RGB 선형의 sRGB로 변환 될 것 "VertexColor"속성 이름을 사용하는 객체가 그려 때 .

source: The combined transform and projection matrices. Used as the <code>transform_projection</code> argument to the <a href="love.graphics.newshader#Vertex_Shader_Function">vertex shader position</a> function.
ja: 変換マトリックスと投影マトリックスの組み合わせ。<a href="love.graphics.newshader#Vertex_Shader_Function">頂点シェーダー位置</a>関数の <code>transform_projection</code> 引数として使用されます。
ko: 결합 된 변환 및 투영 행렬. <a href="love.graphics.newshader#Vertex_Shader_Function">꼭짓점 셰이더 위치</a> 함수에 대한 <code>transform_projection</code> 인수로 사용됩니다 .

source: The comma key on an American layout.
ja: アメリカのレイアウトのコンマキー。
ko: 미국식 레이아웃의 쉼표 키.

source: The comparison mode used when sampling from this texture in a shader, or nil if setDepthSampleMode has not been called on this Texture.
ja: シェーダでこのテクスチャからサンプリングするときに使用する比較モード、またはこのテクスチャで setDepthSampleMode が呼び出されていない場合は nil。
ko: 셰이더에서이 텍스처를 샘플링 할 때 사용되는 비교 모드입니다.이 텍스처에서 setDepthSampleMode가 호출되지 않은 경우 nil입니다.

source: The comparison mode used when sampling from this texture in a shader.
ja: シェーダでこのテクスチャからサンプリングするときに使用する比較モード。
ko: 셰이더에서이 텍스처를 샘플링 할 때 사용되는 비교 모드입니다.

source: The compressed data to decompress.
ja: 解凍する圧縮データです。
ko: 압축 해제 할 압축 데이터입니다.

source: The contact friction.
ja: 接触摩擦です。
ko: 접촉 마찰.

source: The contact restitution.
ja: 連絡先の返還。
ko: 접촉 회복.

source: The contents of the file in memory represented as a string.
ja: メモリ上のファイルの内容を文字列で表します。
ko: 메모리에있는 파일의 내용은 문자열로 표시됩니다.

source: The contents of the file.
ja: ファイルの内容です。
ko: 파일의 내용

source: The contents of the message or nil if the timeout expired.
ja: メッセージの内容、またはタイムアウトが切れた場合はnil。
ko: 메시지의 내용 또는 시간 초과가 만료 된 경우 nil입니다.

source: The contents of the message or nil when no message in message box.
ja: メッセージの内容、またはメッセージボックスにメッセージがない場合はnil。
ko: 메시지 내용 또는 메시지 상자에 메시지가 없으면 nil.

source: The contents of the message.
ja: メッセージの内容です。
ko: 메시지 내용

source: The contents of the packet, it must be a <a href="string">string</a>.
ja: パケットの内容。<a href="string">文字列</a>でなければなりません。
ko: 패킷의 내용은 <a href="string">문자열</a> 이어야 합니다 .

source: The contents of the read bytes
ja: 読み込んだバイトの内容
ko: 읽은 바이트의 내용

source: The contents of the read bytes.
ja: 読み込んだバイトの内容です。
ko: 읽은 바이트의 내용입니다.

source: The converted number, in density-independent units.
ja: 密度に依存しない単位で変換された数。
ko: 밀도 독립적 단위로 변환 된 숫자입니다.

source: The converted number, in pixels.
ja: 変換された数値をピクセル単位で表示します。
ko: 변환 된 숫자 (픽셀)입니다.

source: The converted x-axis value of the coordinate, in density-independent units.
ja: 座標のx軸変換値を密度に依存しない単位で表したもの。
ko: 밀도 독립적 인 단위로 변환 된 좌표의 x 축 값입니다.

source: The converted x-axis value of the coordinate, in pixels.
ja: 座標のx軸変換された値をピクセル単位で表します。
ko: 좌표의 변환 된 x 축 값 (픽셀)입니다.

source: The converted y-axis value of the coordinate, in density-independent units.
ja: 座標のy軸変換値を密度に依存しない単位で表したもの。
ko: 밀도 독립적 인 단위로 변환 된 좌표의 y 축 값입니다.

source: The converted y-axis value of the coordinate, in pixels.
ja: 座標のy軸変換された値をピクセル単位で表します。
ko: 좌표의 변환 된 y 축 값 (픽셀)입니다.

source: The copy of this Transform.
ja: このTransformのコピー。
ko: 이 Transform의 복사본입니다.

source: The corresponding send calls would be
ja: 対応する送信コールは次のようになります。
ko: 해당 발신 통화는

source: The corresponding sendColor call would be
ja: 対応する sendColor 呼び出しは次のようになります。
ko: 해당 sendColor 호출은

source: The cubemap face index, array index, or depth layer for <a href="texturetype">cubemap, array, or volume</a> type Canvases, respectively. This argument is ignored for regular 2D canvases.
ja: <a href="texturetype">キューブマップ、配列、またはボリューム</a>タイプのキャンバスのそれぞれのキューブマップ面インデックス、配列インデックス、または深度レイヤー。この引数は、通常の2Dキャンバスでは無視されます。
ko: 큐브 <a href="texturetype">맵, 어레이 또는 볼륨</a> 유형 캔버스 각각에 대한 큐브 맵 페이스 인덱스, 어레이 인덱스 또는 깊이 레이어 . 일반 2D 캔버스에서는이 인수가 무시됩니다.

source: The currency sub-unit key on an American layout.
ja: アメリカのレイアウトの通貨サブユニットキー。
ko: 미국식 레이아웃의 통화 하위 단위 키.

source: The currency unit key on an American layout.
ja: アメリカのレイアウトの通貨単位キー。
ko: 미국식 레이아웃의 통화 단위 키.

source: The current FPS.
ja: 今のFPS。
ko: 현재 FPS

source: The current Font, or nil if none is set.
ja: カ レ ン ト フ ォ ン ト 。
ko: 현재의 폰트. 설정되어 있지 않은 경우는 nil

source: The current Font. Automatically creates and sets the default font, if none is set yet.
ja: 現在のフォント。デフォルトのフォントが設定されていない場合は、自動的に作成して設定します。
ko: 현재 글꼴 기본 글꼴이 아직 설정되어 있지 않으면 자동으로 만들고 기본 글꼴을 설정합니다.

source: The current PixelEffect.
ja: 現在のPixelEffect。
ko: 현재 PixelEffect입니다.

source: The current batch will be automatically flushed by <a href="love.graphics">love.graphics</a> state changes (except for the transform stack and the current <a href="love.graphics.setcolor">color</a>), as well as <a href="shader-send">Shader:send</a> and methods on <a href="texture">Textures</a> which change their state. Using a different Image in consecutive <a href="love.graphics.draw">love.graphics.draw</a> calls will also flush the current batch.
ja: 現在のバッチは、<a href="love.graphics">love.graphicsの</a>状態の変更（変換スタックと現在の<a href="love.graphics.setcolor">色</a>を除く）、および状態を変更する<a href="texture">テクスチャの</a><a href="shader-send">Shader：send</a>とメソッドによって自動的にフラッシュされます。連続した<a href="love.graphics.draw">love.graphics.draw</a>呼び出しで別の画像を使用すると、現在のバッチもフラッシュされます。
ko: 현재 배치는 <a href="love.graphics">love.graphics</a> 상태 변경 (트랜스 폼 스택 및 현재 <a href="love.graphics.setcolor">색상</a> 제외) 과 상태를 변경하는 <a href="texture">텍스처의 </a><a href="shader-send">Shader : send</a> 및 메서드에 의해 자동으로 플러시됩니다 . 연속적인 <a href="love.graphics.draw">love.graphics.draw</a> 호출 에서 다른 이미지를 사용 하면 현재 배치도 플러시됩니다.

source: The current blend alpha mode &ndash; it determines how the alpha of drawn objects affects blending.
ja: 現在のブレンドアルファモード&ndash;描画オブジェクトのアルファがブレンドにどのように影響するかを決定します。
ko: 현재 블렌드 알파 모드 &ndash; 그린 오브젝트의 알파가 블렌딩에 미치는 영향을 결정합니다.

source: The current blend mode.
ja: 現在のブレンドモード。
ko: 현재 블렌드 모드.

source: The current buffer mode of the file.
ja: ファイルの現在のバッファモード。
ko: 파일의 현재 버퍼 모드

source: The current color mode.
ja: 現在のカラーモード。
ko: 현재 색상 모드

source: The current cursor, or nil if no cursor is set.
ja: 現在のカーソル、カーソルが設定されていない場合はnil。
ko: 현재 커서 또는 커서가 설정되어 있지 않으면 nil입니다.

source: The current depth of the transform and state love.graphics stack.
ja: トランスフォームとステートの現在の深さ love.graphics stack。
ko: 변환 및 상태 love.graphics 스택의 현재 깊이입니다.

source: The current distance model. The default is 'inverseclamped'.
ja: 現在の距離モデル。デフォルトは 'inverseclamped' です。
ko: 현재 거리 모델. 기본값은 'inverseclamped'입니다.

source: The current doppler scale factor.
ja: 現在のドップラースケールファクター。
ko: 현재 도플러 스케일 팩터.

source: The current line height.
ja: 現在のラインの高さ。
ko: 현재 줄 높이입니다.

source: The current line style.
ja: 現在のラインスタイル。
ko: 현재 선 스타일.

source: The current line width.
ja: 現在の線幅。
ko: 현재 줄 너비

source: The current master volume
ja: 現在のマスターボリューム
ko: 현재 마스터 볼륨

source: The current maximum attenuation distance.
ja: 現在の最大減衰距離。
ko: 현재 최대 감쇠 거리.

source: The current motor force, in Nm.
ja: 現在のモーター力、単位はNmです。
ko: Nm 단위의 현재 모터 힘.

source: The current motor force, usually in N.
ja: 現在のモーター力、通常はN単位。
ko: 일반적으로 N의 현재 모터 힘.

source: The current number of live particles.
ja: 現在の生きている粒子の数。
ko: 라이브 입자의 현재 수

source: The current number of simultaneously playing sources.
ja: 同時に再生されるソースの現在の数。
ko: 동시 재생 소스의 현재 수

source: The current operating system. <code>"OS X"</code>, <code>"Windows"</code>, <code>"Linux"</code>, <code>"Android"</code> or <code>"iOS"</code>.
ja: 現在のオペレーティングシステム。 <code>"OS X"</code> 、 <code>"Windows"</code> 、 <code>"Linux"</code> 、 <code>"Android"</code> または <code>"iOS"</code> 。
ko: 현재 운영 체제 <code>"OS X"</code> , <code>"Windows"</code> , <code>"Linux"</code> , <code>"Android"</code> 또는 <code>"iOS"</code> 입니다.

source: The current point size.
ja: 現在のポイントサイズ。
ko: 현재 포인트 크기

source: The current point style.
ja: 現在のポイントスタイル。
ko: 현재 포인트 스타일.

source: The current position
ja: 現在の位置
ko: 현재 위치

source: The current position.
ja: 現在のポジションです。
ko: 현재 위치입니다.

source: The current reference attenuation distance. If the current <a href="distancemodel">DistanceModel</a> is clamped, this is the minimum distance before the Source is no longer attenuated.
ja: 現在の参照減衰距離。現在の<a href="distancemodel">DistanceModel</a>がクランプされている場合、これはSourceが減衰されなくなるまでの最小距離です。
ko: 현재 기준 감쇠 거리. 현재 <a href="distancemodel">DistanceModel</a> 이 고정 된 경우 소스가 더 이상 감쇠되지 않는 최소 거리입니다.

source: The current state of the RandomGenerator object, represented as a string.
ja: 文字列で表されるRandomGeneratorオブジェクトの現在の状態。
ko: RandomGenerator 객체의 현재 상태이며 문자열로 표시됩니다.

source: The current state of the random number generator, represented as a string.
ja: 乱数発生器の現在の状態を文字列で表します。
ko: 문자열로 표시되는 난수 생성기의 현재 상태입니다.

source: The current thread.
ja: 現在のスレッド。
ko: 현재 스레드

source: The current window caption.
ja: 現在のウィンドウのキャプション。
ko: 현재 창 캡션입니다.

source: The current window title.
ja: 現在のウィンドウのタイトル。
ko: 현재 창 제목입니다.

source: The current working directory.
ja: 現在の作業ディレクトリ。
ko: 현재 작업 디렉토리

source: The currently active Shader, or <a href="nil">nil</a> if none is set.
ja: 現在アクティブなシェーダー、または何も設定されていない場合は<a href="nil">nil</a>。
ko: 현재 활성화 된 셰이더 . 설정되어 있지 않은 경우는 <a href="nil">nil</a>

source: The currently playing position of the <a href="source">Source</a>.
ja: <a href="source">Source</a>の現在の再生位置。
ko: <a href="source">소스</a> 의 현재 재생 위치입니다 .

source: The cursor is using a custom image.
ja: カーソルはカスタム画像を使用しています。
ko: 커서가 사용자 정의 이미지를 사용하고 있습니다.

source: The damping ratio.
ja: ダンピング比です。
ko: 댐핑 비율.

source: The data is base64-encoded.
ja: データはbase64エンコードされています。
ko: 데이터는 base64로 인코딩됩니다.

source: The data is unencoded.
ja: データはエンコードされていない。
ko: 데이터가 인코딩되지 않았습니다.

source: The data previously set, or nil if none.
ja: 以前に設定されたデータ、または設定されていない場合はnil。
ko: 이전에 설정 한 데이터. 존재하지 않는 경우는 nil

source: The data to load into the ImageData (RGBA bytes, left to right and top to bottom).
ja: ImageDataに読み込むデータ(RGBAバイト、左から右、上から下)。
ko: ImageData에로드 할 데이터 (RGBA 바이트, 왼쪽에서 오른쪽으로, 위에서 아래로)

source: The data to queue. The SoundData's sample rate, bit depth, and channel count must match the Source's.
ja: キューに入れるデータ。サウンドデータのサンプルレート、ビット深度、チャンネル数は、ソースのものと一致していなければなりません。
ko: 대기열에 넣을 데이터입니다. SoundData의 샘플 속도, 비트 심도 및 채널 수는 소스와 일치해야합니다.

source: The data to send.
ja: 送信するデータです。
ko: 전송할 데이터입니다.

source: The data to use as source.
ja: ソースとして使用するデータです。
ko: 소스로 사용할 데이터입니다.

source: The decimal separator key on an American layout.
ja: アメリカのレイアウトの10進数セパレータキー。
ko: 미국식 레이아웃의 소수점 구분 기호 키입니다.

source: The default "alphamultiply" alpha mode should normally be preferred except when drawing content with pre-multiplied alpha. If content is drawn to a <a href="canvas">Canvas</a> using the "alphamultiply" mode, the Canvas texture will have pre-multiplied alpha afterwards, so the "premultiplied" alpha mode should generally be used when drawing a Canvas to the screen.
ja: 事前に乗算されたアルファでコンテンツを描画する場合を除いて、デフォルトの「alphamultiply」アルファモードが通常推奨されます。コンテンツが「alphamultiply」モードを使用して<a href="canvas">Canvasに</a>描画される場合、Canvasテクスチャは後で事前に乗算されたアルファを持つため、Canvasを画面に描画するときに「事前乗算」アルファモードが一般的に使用されます。
ko: 미리 곱셈 된 알파로 내용을 그릴 때를 제외하고는 기본적으로 "알파 곱셈"알파 모드가 선호됩니다. "알파 곱하기"모드를 사용하여 내용을 <a href="canvas">Canvas</a> 로 그린 경우 이후에 Canvas 텍스처에 알파가 미리 곱셈되어 있으므로 캔버스를 화면에 그릴 때 일반적으로 "미리 곱하기"알파 모드를 사용해야합니다.

source: The default Canvas format - usually an alias for the <code>rgba8</code> format, or the <code>srgb</code> format if <a href="love.graphics.isgammacorrect">gamma-correct rendering</a> is enabled in L&Ouml;VE <a href="https://love2d.org/wiki/0.10.0">0.10.0</a> and newer.
ja: デフォルトのキャンバスの形式-通常のエイリアス <code>rgba8</code> 形式、または <code>srgb</code> フォーマットがあれば<a href="love.graphics.isgammacorrect">、&gamma;-正しいレンダリングは</a>愛で有効になっている<a href="https://love2d.org/wiki/0.10.0">0.10.0</a>以降。
ko: 기본 캔버스 형식-일반적으로 <code>rgba8</code> 형식 의 별칭 또는 <code>srgb</code> <a href="https://love2d.org/wiki/0.10.0">0.10.0</a> 이상 에서 <a href="love.graphics.isgammacorrect">감마 보정 렌더링</a> 이 활성화 된 경우 srgb 형식 입니다.

source: The default function for <a href="https://love2d.org/wiki/0.10.0">0.10.0</a>, <a href="https://love2d.org/wiki/0.10.1">0.10.1</a>, and <a href="https://love2d.org/wiki/0.10.2">0.10.2</a>, used if you don't supply your own.
ja: デフォルトの機能<a href="https://love2d.org/wiki/0.10.0">0.10.0</a>、<a href="https://love2d.org/wiki/0.10.1">0.10.1</a>、及び<a href="https://love2d.org/wiki/0.10.2">0.10.2</a>あなた自身を提供しない場合に使用されます、。
ko: <a href="https://love2d.org/wiki/0.10.0">0.10.0</a> , <a href="https://love2d.org/wiki/0.10.1">0.10.1</a> 및 <a href="https://love2d.org/wiki/0.10.2">0.10.2</a> 의 기본 기능은 사용자가 직접 제공하지 않은 경우에 사용됩니다.

source: The default function for <a href="https://love2d.org/wiki/0.7.0">0.7.0</a>, <a href="https://love2d.org/wiki/0.7.1">0.7.1</a> and <a href="https://love2d.org/wiki/0.7.2">0.7.2</a>, used if you don't supply your own.
ja: デフォルトの機能<a href="https://love2d.org/wiki/0.7.0">0.7.0</a>、<a href="https://love2d.org/wiki/0.7.1">0.7.1</a>および<a href="https://love2d.org/wiki/0.7.2">0.7.2</a>あなたがあなた自身を提供しない場合に使用されます、。
ko: <a href="https://love2d.org/wiki/0.7.0">0.7.0</a> , <a href="https://love2d.org/wiki/0.7.1">0.7.1</a> 및 <a href="https://love2d.org/wiki/0.7.2">0.7.2</a> 의 기본 기능은 사용자가 직접 제공하지 않은 경우에 사용됩니다.

source: The default function for <a href="https://love2d.org/wiki/0.8.0">0.8.0</a>, used if you don't supply your own.
ja: 独自の関数を指定しない場合に使用される<a href="https://love2d.org/wiki/0.8.0">0.8.0</a>のデフォルト関数。
ko: <a href="https://love2d.org/wiki/0.8.0">0.8.0</a> 의 기본 기능은 사용자가 직접 제공하지 않은 경우에 사용됩니다.
