Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/love/love.*.006.xlf
Languages: es, ja, ko, zh_cn

source: The <a href="love.graphics">love.graphics</a>, <a href="love.window">love.window</a>, <a href="love.joystick">love.joystick</a>, <a href="love.keyboard">love.keyboard</a>, <a href="love.mouse">love.mouse</a>, and <a href="love.touch">love.touch</a> modules have several restrictions and therefore can only be used in the main thread.
ja: <a href="love.graphics">love.graphics</a>、<a href="love.window">love.window</a>、<a href="love.joystick">love.joystick</a>、<a href="love.keyboard">love.keyboard</a>、<a href="love.mouse">love.mouse</a>、および<a href="love.touch">love.touch</a>モジュールは、いくつかの制限があり、したがって、メインスレッドだけで使用することができます。
ko: <a href="love.graphics">love.graphics</a> , <a href="love.window">love.window</a> , <a href="love.joystick">love.joystick</a> , <a href="love.keyboard">love.keyboard</a> , <a href="love.mouse">love.mouse</a> 및 <a href="love.touch">love.touch</a> 모듈은 몇 가지 제한이 때문에 단지 메인 스레드에서 사용할 수 있습니다.

source: The <a href="love.graphics.setstenciltest">love.graphics.setStencilTest</a> wiki page includes more examples.
ja: <a href="love.graphics.setstenciltest">love.graphics.setStencilTest</a> wikiページには、より多くの例が含まれています。
ko: <a href="love.graphics.setstenciltest">love.graphics.setStencilTest</a> 위키 페이지에 더 많은 예제가 포함되어 있습니다.

source: The <a href="love.graphics.stencil">love.graphics.stencil</a> wiki page includes more examples.
ja: <a href="love.graphics.stencil">love.graphics.stencilの</a> wikiページには、より多くの例が含まれています。
ko: <a href="love.graphics.stencil">love.graphics.stencil의</a> 위키 페이지에 더 많은 예제가 포함되어 있습니다.

source: The <a href="love.window.frompixels">love.window.fromPixels</a> and <a href="love.window.topixels">love.window.toPixels</a> functions can also be used to convert between units.
ja: <a href="love.window.frompixels">love.window.fromPixels</a>と<a href="love.window.topixels">love.window.toPixels</a>機能は、ユニット間で変換するために使用することができます。
ko: <a href="love.window.frompixels">love.window.fromPixels</a> 및 <a href="love.window.topixels">love.window.toPixels</a> 기능도 단위 사이의 변환을 할 수 있습니다.

source: The <a href="source">source</a> on which to stop the playback.
ja: <a href="source">ソース</a>には、再生を停止します。
ko: <a href="source">소스</a> 의 재생을 정지합니다.

source: The <a href="texture-getdpiscale">DPI scale factor</a> of the Canvas, used when drawing to the Canvas as well as when drawing the Canvas to the screen.
ja: キャンバスに描画するとき、およびキャンバスを画面に描画するときに使用される、キャンバスの<a href="texture-getdpiscale">DPIスケール係数</a>。
ko: 캔버스에 그릴 때뿐만 아니라 화면에 캔버스를 그릴 때 사용되는 캔버스 의 <a href="texture-getdpiscale">DPI 배율</a> 입니다.

source: The <a href="utf8">utf8</a> library can be used to operate on UTF-8 encoded unicode text (such as the text argument given in this function.)
ja: <a href="utf8">UTF8の</a>ライブラリは、UTF-8でエンコードされたUnicodeテキストを操作するために使用することができる（この機能で指定されたテキストの引数として。）
ko: <a href="utf8">UTF8의</a> 라이브러리는 UTF-8 인코딩 유니 코드 텍스트를 조작 할 수있다 (예를 들면,이 함수에 주어진 텍스트 인수).

source: The <code>*</code> operator creates a new Transform object, so it is not recommended to use it heavily in per-frame code.
ja: <code>*</code> フレーム毎のコードに多額のそれを使用することは推奨されませんので、オペレータは、新しいTransformオブジェクトを作成します。
ko: <code>*</code> 이 당 프레임 코드에 집중적으로 사용하는 것은 권장하지 않습니다 때문에 운영자는 새로운 Transform 객체를 생성합니다.

source: The <code>RenderTargetSetup</code> parameters can either be a <a href="canvas">Canvas</a> object, or a table in the following format: <code>{canvas, mipmap=#, layer=#, face=#}</code>
ja: <code>RenderTargetSetup</code> のパラメータのいずれかとすることができる<a href="canvas">キャンバス</a>オブジェクト、または次の形式のテーブル： <code>{canvas, mipmap=#, layer=#, face=#}</code>
ko: <code>RenderTargetSetup</code> 의 파라미터 중 하나가 될 수 <a href="canvas">캔버스</a> 객체, 또는 다음과 같은 형식의 테이블 : <code>{canvas, mipmap=#, layer=#, face=#}</code>

source: The <code>Texel</code> shader function can be used to sample from all types of textures in a shader. <code>Texel</code> is recommended instead of <code>texture2D</code>, <code>textureCube</code> etc., because the latter do not work across all versions of GLSL supported by L&Ouml;VE, whereas Texel does (GLSL 3 removed <code>texture2D</code> and added a generic <code>texture</code> function).
ja: <code>Texel</code> シェーダ機能は、シェーダーでテクスチャのすべてのタイプのサンプルに使用することができます。 <code>texture2D</code> 、 <code>textureCube</code> などの代わりに <code>Texel</code> をお勧めします。後者は、L&Ouml;VEでサポートされているGLSLのすべてのバージョンで機能するわけではありませんが、Texelは機能します（GLSL 3は <code>texture2D</code> を削除し、汎用 <code>texture</code> 関数を追加しました）。
ko: <code>Texel</code> 쉐이더 함수는 쉐이더 텍스쳐의 모든 유형의 샘플을 사용할 수있다. <code>Texel</code> 은 <code>texture2D</code> , <code>textureCube</code> 등 대신 권장됩니다 . 후자는 L&Ouml;VE 에서 지원하는 GLSL의 모든 버전에서 작동하지 않는 반면 Texel은 작동합니다 (GLSL 3는 <code>texture2D</code> 를 제거 하고 일반 <code>texture</code> 함수를 추가했습니다 ).

source: The <code>clampzero</code> mode is not available on most mobile devices, and will fall back to the <code>clamp</code> mode when it's unsupported. Check the <code>clampzero</code><a href="graphicsfeature">GraphicsFeature</a> constant by calling <a href="love.graphics.getsupported">love.graphics.getSupported</a>.
ja: <code>clampzero</code> のモードは、ほとんどのモバイルデバイスでは使用できません、とにフォールバックします <code>clamp</code> 、それはサポートされていないのですときのモード。チェック <code>clampzero</code> の<a href="graphicsfeature">GraphicsFeatureの</a>呼び出すことにより、定数を<a href="love.graphics.getsupported">love.graphics.getSupportedを</a>。
ko: <code>clampzero</code> 의 모드는 대부분의 모바일 기기에서 사용할 수 없습니다, 다시에 떨어질 것이다 <code>clamp</code> 가 지원되지 않는 때 모드. 체크 <code>clampzero</code> 의<a href="graphicsfeature">GraphicsFeature의</a> 호출에 의해 상수를 <a href="love.graphics.getsupported">love.graphics.getSupported을</a> .

source: The <code>highdpi</code> window flag must be enabled to use the full pixel density of a Retina screen on Mac OS X and iOS. The flag currently does nothing on Windows and Linux, and on Android it is effectively always enabled.
ja: <code>highdpi</code> ウィンドウフラグは、Mac OS XとiOSでのRetina画面のフルピクセル密度を使用するために有効にする必要があります。このフラグは現在、WindowsとLinuxでは何もせず、Androidでは常に有効になっています。
ko: <code>highdpi</code> 의 윈도우 플래그는 맥 OS X와 iOS에서 망막 화면의 전체 픽셀 밀도를 사용하도록 설정해야합니다. 이 플래그는 현재 Windows 및 Linux에서 아무 작업도 수행하지 않으며 Android에서는 항상 항상 활성화됩니다.

source: The <code>love.conf</code> function takes one argument: a table filled with all the default values which you can overwrite to your liking. If you want to change the default window size, for instance, do:
ja: <code>love.conf</code> 関数は引数を1つ取ります。好みに応じて上書きできるすべてのデフォルト値が入ったテーブルです。たとえば、デフォルトのウィンドウサイズを変更する場合は、次のようにします。
ko: <code>love.conf</code> 의 당신이 원하는대로 덮어 쓸 수있는 모든 기본 값으로 채워진 테이블 : 함수는 하나 개의 인수를합니다. 예를 들어 기본 창 크기를 변경하려면 다음을 수행하십시오.

source: The <code>t.window</code> table was named <code>t.screen</code> in versions prior to <a href="https://love2d.org/wiki/0.9.0">0.9.0</a>. The <code>t.screen</code> table doesn't exist in love.conf in 0.9.0, and the <code>t.window</code> table doesn't exist in love.conf in 0.8.0. This means <b>love.conf</b> will fail to execute (therefore it will fall back to default values) if care is not taken to use the correct table for the L&Ouml;VE version being used.
ja: <a href="https://love2d.org/wiki/0.9.0">0.9.0</a>より前のバージョンでは、 <code>t.window</code> テーブルは <code>t.screen</code> という名前でした。 <code>t.screen</code> の表には、0.9.0でlove.confに存在しない、と <code>t.window</code> のテーブルには、0.8.0でlove.confには存在しません。つまり、使用されているL&Ouml;VEバージョンの正しいテーブルを使用するように注意しないと、<b>love.conf</b>は実行に失敗します（したがって、デフォルト値にフォールバックします）。<b></b>
ko: <code>t.window</code> 의 테이블이 선정됐다 <code>t.screen</code> 이전 버전에서 <a href="https://love2d.org/wiki/0.9.0">0.9.0</a> . <code>t.screen</code> 의 표 0.9.0에 love.conf에 존재하지 않으며, <code>t.window</code> 의 표 0.8.0에 love.conf에 존재하지 않습니다. 이는 사용 <b>중인 L&Ouml;VE</b> 버전에 대해 올바른 테이블을 사용하지 않으면 <b>love.conf</b> 가 실행에 실패하므로 기본값으로 돌아갑니다.

source: The <code>varying</code> keyword can be used to set a value in the vertex shader and have it interpolated in between vertices and passed down to the pixel shader.
ja: <code>varying</code> キーワードは、頂点シェーダの値を設定するために使用することができ、それは頂点間で補間し、ピクセルシェーダーに渡さました。
ko: <code>varying</code> 키워드는 정점 셰이더에 값을 설정하는 데 사용할 수 있으며 정점 사이에서 보간 픽셀 셰이더에 전해져왔다.

source: The <strong>Shape</strong>'s position is relative to the position of the <a href="body">Body</a> it has been attached to.
ja: <strong>図形</strong>の位置は、位置を基準と<a href="body">ボディ</a>、それが接続されています。
ko: <strong>모양</strong> 의 위치의 위치를 기준으로 <a href="body">본체</a> 가 부착되어있다.

source: The <strong>Variant</strong> type is not a real lua type, but instead indicates what lua values L&Ouml;VE can store internally. It is used in <a href="love.thread">love.thread</a> and <a href="love.event">love.event</a>. Indeed, as it is a "virtual" type, it has no specific representation in lua, and no methods.
ja: <strong>バリアントの</strong>タイプは、実際のluaタイプではなく、Luaの値は愛が内部的に保存することができるものを示しています。<a href="love.thread">love.thread</a>と<a href="love.event">love.eventで</a>使用されます。実際、これは「仮想」タイプであるため、luaでの特定の表現やメソッドはありません。
ko: <strong>변형의</strong> 유형은 실제 루아 형식이 아닙니다, 대신에 루아 값은 사랑이 내부적으로 저장할 수있는 것을 나타냅니다. <a href="love.thread">love.thread</a> 및 <a href="love.event">love.event</a> 에서 사용됩니다 . 실제로 "가상"유형이므로 lua에서 특정 표현이없고 메서드도 없습니다.

source: The <strong>value</strong> type is used to indicate, that all of Lua's types can be used in a certain place (e.g.: as arguments).
ja: <strong>値の</strong>型は、Luaのの種類のすべてがある場所（：引数として、例えば）で使用できることを示すために使用されます。
ko: <strong>값</strong> (: 인수로 예를 들면) 유형은 루아의 모든 유형이 특정 장소에서 사용할 수있는 것을 나타 내기 위해 사용된다.

source: The A key
ja: Aのキー
ko: A 키

source: The AC Back key on an American layout.
ja: アメリカのレイアウトのACバックキー。
ko: 미국식 레이아웃의 AC Back 키.

source: The AC Bookmarks key on an American layout.
ja: アメリカンなレイアウトのACブックマークキー。
ko: 미국식 레이아웃의 AC 책갈피 키

source: The AC Forward key on an American layout.
ja: アメリカのレイアウトのACフォワードキー。
ko: 미국식 레이아웃의 AC Forward 키.

source: The AC Home key on an American layout.
ja: アメリカのレイアウトのACホームキー。
ko: 미국식 레이아웃의 AC 홈 키.

source: The AC Refresh key on an American layout.
ja: アメリカのレイアウトのACリフレッシュキー。
ko: 미국식 레이아웃의 AC Refresh 키.

source: The AC Search key on an American layout.
ja: アメリカのレイアウトのAC検索キー。
ko: 미국식 레이아웃의 AC 검색 키.

source: The Array Texture to draw.
ja: 描画する配列テクスチャ。
ko: 그릴 배열 텍스처입니다.

source: The B key
ja: Bキー
ko: B 키

source: The BC4 and BC5 formats are supported on systems with DirectX 10 / OpenGL 3-capable desktop hardware and drivers. The BC6H and BC7 formats are only supported on desktop systems with DirectX 11 / OpenGL 4-capable hardware and very recent drivers. Mac OS X does not support BC6H or BC7 at all currently.
ja: BC4とBC5フォーマットは、DirectX 10/OpenGL 3対応のデスクトップハードウェアとドライバを搭載したシステムでサポートされています。BC6HとBC7フォーマットは、DirectX 11/OpenGL 4対応のハードウェアとごく最近のドライバを搭載したデスクトップシステムでのみサポートされています。Mac OS Xは現在、BC6HとBC7を全くサポートしていません。
ko: BC4 및 BC5 형식은 DirectX 10 / OpenGL 3 가능 데스크톱 하드웨어 및 드라이버가있는 시스템에서 지원됩니다. BC6H 및 BC7 형식은 DirectX 11 / OpenGL 4 가능 하드웨어 및 최신 드라이버가있는 데스크탑 시스템에서만 지원됩니다. Mac OS X은 현재 BC6H 또는 BC7을 전혀 지원하지 않습니다.

source: The BC4 and BC5 formats are supported on systems with DirectX 10 / OpenGL 3-capable desktop hardware and drivers. The BC6H and BC7 formats are only supported on desktop systems with DirectX 11 / OpenGL 4-capable hardware and very recent drivers. macOS does not support BC6H or BC7 at all currently.
ja: BC4 と BC5 フォーマットは、DirectX 10/OpenGL 3 対応のデスクトップハードウェアとドライバを搭載したシステムでサポートされています。BC6HとBC7フォーマットは、DirectX 11/OpenGL 4対応のハードウェアとごく最近のドライバを搭載したデスクトップシステムでのみサポートされています。
ko: BC4 및 BC5 형식은 DirectX 10 / OpenGL 3 지원 데스크탑 하드웨어 및 드라이버가있는 시스템에서 지원됩니다. BC6H 및 BC7 형식은 DirectX 11 / OpenGL 4 지원 하드웨어와 최신 드라이버가있는 데스크톱 시스템에서만 지원됩니다. macOS는 현재 BC6H 또는 BC7을 전혀 지원하지 않습니다.

source: The BC4 format (also known as 3Dc+ or ATI1.) Stores just the red channel, at 4 bits per pixel.
ja: BC4 フォーマット(3Dc+または ATI1 としても知られています)は、1 ピクセルあたり 4 ビットの赤チャンネルだけを格納します。
ko: BC4 형식 (3Dc + 또는 ATI1이라고도 함)은 픽셀 당 4 비트로 빨간색 채널 만 저장합니다.

source: The BC5 format (also known as 3Dc or ATI2.) Stores red and green channels at 8 bits per pixel.
ja: BC5 フォーマット(3Dc または ATI2 としても知られています)は、1 ピクセルあたり 8 ビットの赤と緑のチャンネルを格納します。
ko: BC5 형식 (3Dc 또는 ATI2라고도 함)은 픽셀 당 8 비트로 빨강 및 녹색 채널을 저장합니다.

source: The BC6H format. Stores <a href="http://en.wikipedia.org/wiki/Half-precision_floating-point_format">half-precision</a> floating-point RGB data in the range of [0, 65504] at 8 bits per pixel. Suitable for HDR images on desktop systems.
ja: BC6Hフォーマット。格納<a href="http://en.wikipedia.org/wiki/Half-precision_floating-point_format">半精度</a>ピクセルあたり8ビットで[0、65504]の範囲の浮動小数点RGBデータ。デスクトップシステムのHDR画像に適しています。
ko: BC6H 형식 상점 <a href="http://en.wikipedia.org/wiki/Half-precision_floating-point_format">반 정밀도</a> 픽셀 당 8 비트의 [0, 65,504]의 범위의 부동 소수점 RGB 데이터를 포함한다. 데스크탑 시스템의 HDR 이미지에 적합합니다.

source: The BC6H format. Stores <a href="https://en.wikipedia.org/wiki/Half-precision_floating-point_format">half-precision</a> floating-point RGB data in the range of [0, 65504] at 8 bits per pixel. Suitable for HDR images on desktop systems.
ja: BC6Hフォーマット。格納<a href="https://en.wikipedia.org/wiki/Half-precision_floating-point_format">半精度</a>ピクセルあたり8ビットで[0、65504]の範囲の浮動小数点RGBデータ。デスクトップシステムのHDR画像に適しています。
ko: BC6H 형식입니다. 상점 <a href="https://en.wikipedia.org/wiki/Half-precision_floating-point_format">반 정밀도</a> 픽셀 당 8 비트의 [0, 65,504]의 범위의 부동 소수점 RGB 데이터를 포함한다. 데스크탑 시스템의 HDR 이미지에 적합합니다.

source: The BC7 format (also known as BPTC.) Stores RGB or RGBA data at 8 bits per pixel.
ja: BC7フォーマット(BPTCとも呼ばれる)は、1ピクセルあたり8ビットのRGBまたはRGBAデータを格納します。
ko: BC7 형식 (BPTC라고도 함)은 RGB 또는 RGBA 데이터를 픽셀 당 8 비트로 저장합니다.

source: The Body to attach the Shape to.
ja: シェイプを取り付けるボディ。
ko: 쉐이프를 부착 할 바디입니다.

source: The C key
ja: Cキー
ko: C 키

source: The Canvas has mipmaps, and all mipmap levels will automatically be recomputed when switching away from the Canvas with <a href="love.graphics.setcanvas">love.graphics.setCanvas</a>.
ja: Canvasにはミップマップがあり、<a href="love.graphics.setcanvas">love.graphics.setCanvasを使用</a>してCanvasから切り替えると、すべてのミップマップレベルが自動的に再計算されます。
ko: 캔버스에는 밉맵이 있으며, 모든 밉맵 레벨은 <a href="love.graphics.setcanvas">love.graphics.setCanvas</a> 를 사용하여 캔버스에서 전환 할 때 자동으로 다시 계산됩니다 .

source: The Canvas has mipmaps. <a href="love.graphics.setcanvas">love.graphics.setCanvas</a> can be used to render to a specific mipmap level, or <a href="canvas-generatemipmaps">Canvas:generateMipmaps</a> can (re-)compute all mipmap levels based on the base level.
ja: キャンバスにはミップマップがあります。<a href="love.graphics.setcanvas">love.graphics.setCanvas</a>を使用して特定のミップマップレベルにレンダリングするか、<a href="canvas-generatemipmaps">Canvas：generateMipmaps</a>を使用して基本レベルに基づいてすべてのミップマップレベルを（再）計算できます。
ko: Canvas에는 밉맵이 있습니다. <a href="love.graphics.setcanvas">love.graphics.setCanvas</a> 를 사용하여 특정 밉맵 수준으로 렌더링하거나 <a href="canvas-generatemipmaps">Canvas : generateMipmaps</a> 가 기본 수준을 기반으로 모든 밉맵 수준을 (재) 계산할 수 있습니다.

source: The Canvas has no mipmaps.
ja: Canvasにはミップマップがありません。
ko: Canvas에는 밉맵이 없습니다.

source: The Canvas must be <a href="love.graphics.newcanvas">created</a> with mipmaps set to a <a href="mipmapmode">MipmapMode</a> other than "none" for this function to work. It should only be called while the Canvas is not the active render target.
ja: この関数を機能させるには、<a href="mipmapmode">mipmapを</a>「none」以外のMipmapModeに設定してCanvasを<a href="love.graphics.newcanvas">作成</a>する必要があります。Canvasがアクティブなレンダーターゲットではない場合にのみ呼び出す必要があります。
ko: 캔버스는해야 <a href="love.graphics.newcanvas">생성</a> A를 설정 밉맵과 <a href="mipmapmode">MipmapMode</a> 일에이 기능에 대한 "없음"이외. Canvas가 활성 렌더링 대상이 아닌 경우에만 호출해야합니다.

source: The Canvas set by <a href="love.graphics.setcanvas">setCanvas</a>. Returns nil if drawing to the real screen.
ja: <a href="love.graphics.setcanvas">setCanvas</a>によって設定されたCanvas。実際の画面に描画する場合はnilを返します。
ko: <a href="love.graphics.setcanvas">setCanvas에</a> 의해 설정된 캔버스입니다 . 실제 화면에 그리면 nil을 반환합니다.

source: The Canvas to render to.
ja: レンダリング先のキャンバス。
ko: 렌더링 할 Canvas입니다.

source: The Canvas to use for this active render target.
ja: このアクティブなレンダー ターゲットに使用するキャンバス。
ko: 이 활성 렌더 대상에 사용할 Canvas입니다.

source: The Channel object associated with the name.
ja: 名前に関連付けられたチャンネルオブジェクト。
ko: 이름과 관련된 Channel 객체입니다.

source: The Channel to <a href="channel-push">push</a> the generated <a href="imagedata">ImageData</a> to.
ja: 生成された<a href="imagedata">ImageData</a>を<a href="channel-push">プッシュ</a>するチャネル。
ko: 생성 된 <a href="imagedata">ImageData</a> 를 <a href="channel-push">푸시</a> 할 채널 입니다.

source: The Cursor object representing the system cursor type.
ja: システムカーソルタイプを表すカーソルオブジェクト。
ko: 시스템 커서 유형을 나타내는 Cursor 객체입니다.

source: The Cursor object to use as the current mouse cursor.
ja: 現在のマウスカーソルとして使用するカーソルオブジェクト。
ko: 현재 마우스 커서로 사용할 Cursor 객체입니다.

source: The D key
ja: Dキー
ko: D 키

source: The DPI scale factor of the Font.
ja: フォントのDPIスケールファクタ。
ko: 글꼴의 DPI 배율입니다.

source: The DPI scale factor of the Texture.
ja: テクスチャの DPI スケール ファクター。
ko: 텍스처의 DPI 배율입니다.

source: The DPI scale factor of the video.
ja: ビデオのDPIスケールファクタ。
ko: 비디오의 DPI 배율입니다.

source: The DPI scale factor represents relative pixel density. A DPI scale factor of 2 means the font's glyphs have twice the pixel density in each dimension (4 times as many pixels in the same area) compared to a font with a DPI scale factor of 1.
ja: DPI スケールファクタは相対的なピクセル密度を表します。DPI ス ケール係数が 2 の場合は、DPI ス ケール係数が 1 のフォントと比較して、フォントのグリフの各次元におけるピクセル密度が 2 倍 (同一領域内のピクセル数が 4 倍)であることを意味します。
ko: DPI 배율은 상대적 픽셀 밀도를 나타냅니다. DPI 배율 계수 2는 DPI 배율 계수가 1 인 글꼴에 비해 글꼴의 글리프가 각 차원에서 픽셀 밀도가 두 배 (동일 영역의 픽셀 수 4 배)가 두 배임을 의미합니다.

source: The DPI scale factor represents relative pixel density. A DPI scale factor of 2 means the texture has twice the pixel density in each dimension (4 times as many pixels in the same area) compared to a texture with a DPI scale factor of 1.
ja: DPI スケール ファクターは、相対的なピクセル密度を表します。DPI スケール ファクターが 2 の場合、DPI スケール ファクターが 1 のテクスチャと比較して、テクスチャの各次元のピクセル密度が 2 倍(同じ領域のピクセル数が 4 倍)になることを意味します。
ko: DPI 배율은 상대적 픽셀 밀도를 나타냅니다. DPI 스케일 팩터 2는 텍스처가 DPI 스케일 팩터가 1 인 텍스처에 비해 각 차원에서 픽셀 밀도가 두 배 (동일 영역에서 픽셀 수의 4 배) 두 배임을 의미합니다.

source: The DPI scale factor represents relative pixel density. The pixel density inside the window might be greater (or smaller) than the "size" of the window. For example on a retina screen in Mac OS X with the <code>highdpi</code><a href="love.window.setmode">window flag</a> enabled, the window may take up the same physical size as an 800x600 window, but the area inside the window uses 1600x1200 pixels. <code>love.graphics.getDPIScale()</code> would return <code>2</code> in that case.
ja: DPIスケール係数は、相対的なピクセル密度を表します。ウィンドウ内のピクセル密度は、ウィンドウの「サイズ」よりも大きい（または小さい）場合があります。たとえば、 <code>highdpi</code> <a href="love.window.setmode">ウィンドウフラグが</a>有効になっているMac OS XのRetina画面では、ウィンドウは800x600ウィンドウと同じ物理サイズを占める場合がありますが、ウィンドウ内の領域は1600x1200ピクセルを使用します。その場合、 <code>love.graphics.getDPIScale()</code> は <code>2</code> を返します。
ko: DPI 배율은 상대적 픽셀 밀도를 나타냅니다. 창 내부의 픽셀 밀도는 창의 "크기"보다 크거나 작을 수 있습니다. 예를 들어, <code>highdpi</code> <a href="love.window.setmode">창 플래그가</a> 활성화 된 Mac OS X의 레티 나 화면에서 창은 800x600 창과 동일한 물리적 크기를 차지할 수 있지만 창 내부 영역은 1600x1200 픽셀을 사용합니다. <code>love.graphics.getDPIScale()</code> 은 <code>2</code> 를 반환 합니다.

source: The DPI scale to use when drawing the array image and calling <a href="texture-getwidth">getWidth</a>/<a href="texture-getheight">getHeight</a>.
ja: 配列画像を描画して<a href="texture-getwidth">getWidth</a> / <a href="texture-getheight">getHeight</a>を呼び出すときに使用するDPIスケール。
ko: 배열 이미지를 그리고 <a href="texture-getwidth">getWidth</a> / <a href="texture-getheight">getHeight를</a> 호출 할 때 사용할 DPI 배율 입니다.

source: The DXT1 format. RGB data at 4 bits per pixel (compared to 32 bits for <a href="imagedata">ImageData</a> and regular <a href="image">Images</a>.) Suitable for fully opaque images on desktop systems.
ja: DXT1フォーマット。ピクセルあたり4ビットのRGBデータ（<a href="imagedata">ImageData</a>および通常の<a href="image">画像の</a> 32ビットと比較）。デスクトップシステムの完全に不透明な画像に適しています。
ko: DXT1 형식 픽셀 당 4 비트의 RGB 데이터 ( <a href="imagedata">ImageData</a> 및 일반 <a href="image">이미지의 경우</a> 32 비트와 비교 ) 데스크탑 시스템에서 완전히 불투명 한 이미지에 적합합니다.

source: The DXT3 format. RGBA data at 8 bits per pixel. Smooth variations in opacity do not mix well with this format.
ja: DXT3フォーマット。1ピクセルあたり8ビットのRGBAデータ。滑らかな不透明度の変化は、このフォーマットではうまく調和しません。
ko: DXT3 형식 픽셀 당 8 비트의 RGBA 데이터. 불투명도의 부드러운 변형은이 형식과 잘 혼합되지 않습니다.

source: The DXT5 format. RGBA data at 8 bits per pixel. Recommended for images with varying opacity on desktop systems.
ja: DXT5フォーマット。1ピクセルあたり8ビットのRGBAデータ。デスクトップシステムでの不透明度の異なる画像におすすめです。
ko: DXT5 형식 픽셀 당 8 비트의 RGBA 데이터. 데스크탑 시스템에서 다양한 불투명도를 가진 이미지에 권장됩니다.

source: The Data object in memory to mount.
ja: マウントするメモリ内のDataオブジェクト。
ko: 탑재 할 메모리의 데이터 개체입니다.

source: The Data object to append to the file.
ja: ファイルに追加するデータオブジェクト。
ko: 파일에 추가 할 Data 객체입니다.

source: The Data object to reference.
ja: 参照するデータオブジェクト。
ko: 참조 할 데이터 개체입니다.

source: The Data object to write to the file.
ja: ファイルに書き込むデータオブジェクト。
ko: 파일에 쓸 Data 객체입니다.

source: The Data object to write.
ja: 書き込むデータオブジェクトです。
ko: 쓸 Data 객체입니다.

source: The Decoder to create a Source from.
ja: ソースを作成するデコーダ。
ko: 소스를 생성 할 디코더입니다.

source: The E key
ja: Eキー
ko: E 키

source: The ETC1 format. RGB data at 4 bits per pixel. Suitable for fully opaque images on older Android devices.
ja: ETC1フォーマット。1ピクセルあたり4ビットのRGBデータ。古いAndroid端末での完全不透明画像に適しています。
ko: ETC1 형식 픽셀 당 4 비트의 RGB 데이터. 구형 Android 기기에서 완전히 불투명 한 이미지에 적합합니다.

source: The ETC2 and EAC formats are supported by newer (OpenGL ES 3-capable) iOS and Android devices.
ja: ETC2およびEACフォーマットは、より新しい(OpenGL ES 3-capable)iOSおよびAndroidデバイスでサポートされています。
ko: ETC2 및 EAC 형식은 최신 (OpenGL ES 3 지원) iOS 및 Android 장치에서 지원됩니다.

source: The ETC2 and EAC formats are supported by the iPhone 5s and newer, all OpenGL ES 3-capable Android devices, and OpenGL 4.3-capable desktop GPUs.
ja: ETC2およびEACフォーマットは、iPhone 5s以降、すべてのOpenGL ES 3対応のAndroidデバイス、およびOpenGL 4.3対応のデスクトップGPUでサポートされています。
ko: ETC2 및 EAC 형식은 iPhone 5s 이상, 모든 OpenGL ES 3 지원 Android 장치 및 OpenGL 4.3 지원 데스크톱 GPU에서 지원됩니다.

source: The F key
ja: Fキー
ko: F 키

source: The F1 key on an American layout.
ja: アメリカのレイアウトにあるF1キー。
ko: 미국식 레이아웃의 F1 키

source: The F10 key on an American layout.
ja: アメリカのレイアウトのF10キー。
ko: 미국식 배치의 F10 키.

source: The F11 key on an American layout.
ja: アメリカのレイアウトのF11キー。
ko: 미국식 배치의 F11 키.

source: The F12 key on an American layout.
ja: アメリカのレイアウトのF12キー。
ko: 미국식 배치의 F12 키.

source: The F13 key on an American layout.
ja: アメリカのレイアウトのF13キー。
ko: 미국식 배치의 F13 키.

source: The F14 key on an American layout.
ja: アメリカのレイアウトのF14キー。
ko: 미국식 배치의 F14 키.

source: The F15 key on an American layout.
ja: アメリカのレイアウトのF15キー。
ko: 미국식 배치의 F15 키.

source: The F16 key on an American layout.
ja: アメリカのレイアウトのF16キー。
ko: 미국식 배치의 F16 키.

source: The F17 key on an American layout.
ja: アメリカのレイアウトのF17キー。
ko: 미국식 배치의 F17 키.

source: The F18 key on an American layout.
ja: アメリカのレイアウトのF18キー。
ko: 미국식 배치의 F18 키.

source: The F19 key on an American layout.
ja: アメリカのレイアウトのF19キー。
ko: 미국식 배치의 F19 키.

source: The F2 key on an American layout.
ja: アメリカのレイアウトのF2キー。
ko: 미국식 배치의 F2 키.

source: The F20 key on an American layout.
ja: アメリカのレイアウトのF20キー。
ko: 미국식 배치의 F20 키.

source: The F21 key on an American layout.
ja: アメリカのレイアウトのF21キー。
ko: 미국식 배치의 F21 키.

source: The F22 key on an American layout.
ja: アメリカのレイアウトのF22キー。
ko: 미국식 배치의 F22 키.

source: The F23 key on an American layout.
ja: アメリカのレイアウトのF23キー。
ko: 미국식 배치의 F23 키.

source: The F24 key on an American layout.
ja: アメリカのレイアウトのF24キー。
ko: 미국식 배치의 F24 키.

source: The F3 key on an American layout.
ja: アメリカのレイアウトのF3キー。
ko: 미국식 레이아웃의 F3 키.

source: The F4 key on an American layout.
ja: アメリカのレイアウトのF4キー。
ko: 미국식 배치의 F4 키.

source: The F5 key on an American layout.
ja: アメリカのレイアウトのF5キー。
ko: 미국식 배치의 F5 키.

source: The F6 key on an American layout.
ja: アメリカのレイアウトのF6キー。
ko: 미국식 배치의 F6 키.

source: The F7 key on an American layout.
ja: アメリカのレイアウトのF7キー。
ko: 미국식 배치의 F7 키.

source: The F8 key on an American layout.
ja: アメリカのレイアウトのF8キー。
ko: 미국식 배치의 F8 키.

source: The F9 key on an American layout.
ja: アメリカのレイアウトのF9キー。
ko: 미국식 배치의 F9 키.

source: The FileData containing the Lua code to use as the source.
ja: ソースとして使用するLuaコードを含むFileData。
ko: 소스로 사용할 Lua 코드가 포함 된 FileData입니다.

source: The FileData object in memory to mount.
ja: マウントするメモリ内のFileDataオブジェクト。
ko: 탑재 할 메모리의 FileData 개체입니다.

source: The FileData of the font file.
ja: フォントファイルのFileData。
ko: 글꼴 파일의 FileData입니다.
