Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/love/love.*.006.xlf
Languages: es, ja, ko, zh_cn

source: This function does not work correctly in <a href="https://love2d.org/wiki/0.8.0">0.8.0</a> and may terminate L&Ouml;VE without errors.
es: Esta funci&oacute;n no funciona correctamente en <a href="https://love2d.org/wiki/0.8.0">0.8.0</a> y puede terminar L&Ouml;VE sin errores.
zh_cn: 该功能在<a href="https://love2d.org/wiki/0.8.0">0.8.0</a>中无法正常工作，并且可能会终止L&Ouml;VE而不会出错。

source: This function does not work in 0.8.0, but has been fixed in version 0.9.0. Use the following snippet to circumvent this in 0.8.0;
es: Esta función no funciona en la versión 0.8.0,pero ha sido corregida en la versión 0.9.0.Use el siguiente fragmento para evitar esto en 0.8.0;
zh_cn: 这个功能在0.8.0中无法使用,但在0.9.0版本中已被修正。在0.8.0中使用下面的代码来规避这个问题。

source: This function does nothing on mobile devices and other systems which use OpenGL ES 2.
es: Esta función no hace nada en los dispositivos móviles y otros sistemas que utilizan OpenGL ES 2.
zh_cn: 该功能在移动设备和其他使用OpenGL ES 2的系统上没有任何作用。

source: This function effectively replaces the contents of the screen or active Canvas with garbage. Most <a href="blendmode">BlendModes</a>, including the default "alpha" blend mode, blend what's drawn with the contents of the screen - which would cause unexpected glitches if this function is used inappropriately.
es: Esta funci&oacute;n reemplaza efectivamente el contenido de la pantalla o Canvas activo con basura. La mayor&iacute;a de los <a href="blendmode">BlendModes</a> , incluido el modo de mezcla "alfa" predeterminado, combinan lo que se dibuja con el contenido de la pantalla, lo que causar&iacute;a fallas inesperadas si esta funci&oacute;n se usa de manera inapropiada.
zh_cn: 此功能有效地用垃圾替换屏幕或活动Canvas的内容。大多数<a href="blendmode">BlendMode</a>（包括默认的&ldquo; alpha&rdquo;混合模式）会将绘制的内容与屏幕内容混合在一起-如果不正确使用此功能，将导致意外故障。

source: This function gets passed one argument, the fixture, and should return a boolean. The search will continue if it is true or stop if it is false.
es: Esta función se pasa un argumento,el accesorio,y debería devolver un booleano.La búsqueda continuará si es verdadera o se detendrá si es falsa.
zh_cn: 这个函数得到一个参数,即夹具,并且应该返回一个布尔值。如果为真,将继续搜索,如果为假,则停止搜索。

source: This function has a variable number of return values. It can be used in a nested fashion with <a href="love.graphics.polygon">love.graphics.polygon</a>.
es: Esta funci&oacute;n tiene un n&uacute;mero variable de valores devueltos. Se puede utilizar de forma anidada con <a href="love.graphics.polygon">love.graphics.polygon</a> .
zh_cn: 此函数具有可变数量的返回值。它可以与<a href="love.graphics.polygon">love.graphics.polygon</a>嵌套使用。

source: This function has been renamed from <a href="love.window.iscreated">love.window.isCreated</a>.
es: Esta funci&oacute;n ha sido renombrada de <a href="love.window.iscreated">love.window.isCreated</a> .
zh_cn: 此函数已从<a href="love.window.iscreated">love.window.isCreated</a>重命名。

source: This function has been renamed to <a href="love.window.isopen">love.window.isOpen</a>.
es: Esta funci&oacute;n ha sido renombrada a <a href="love.window.isopen">love.window.isOpen</a> .
zh_cn: 此功能已重命名为<a href="love.window.isopen">love.window.isOpen</a>。

source: This function has no effect if the window isn't <a href="love.window.setmode">resizable</a>, since it essentially programmatically presses the window's "maximize" button.
es: Esta funci&oacute;n no tiene ning&uacute;n efecto si la ventana no es <a href="love.window.setmode">redimensionable</a> , ya que esencialmente presiona program&aacute;ticamente el bot&oacute;n "maximizar" de la ventana.
zh_cn: 如果窗口不可<a href="love.window.setmode">调整大小</a>，则此功能无效，因为它实际上是通过编程方式按下窗口的&ldquo;最大化&rdquo;按钮。

source: This function is a higher order function. It takes another function as a parameter, and calls it once for each pixel in the ImageData.
es: Esta función es una función de orden superior.Toma otra función como parámetro,y la llama una vez por cada píxel de los Datos de Imagen.
zh_cn: 这个函数是一个高阶函数。它以另一个函数为参数,对ImageData中的每个像素调用一次。

source: This function is always used to prepare for a corresponding <a href="love.graphics.pop">pop</a> operation later. It stores the current coordinate transformation state into the transformation stack and keeps it active. Later changes to the transformation can be undone by using the pop operation, which returns the coordinate transform to the state it was in before calling push.
es: Esta funci&oacute;n siempre se utiliza para prepararse para una operaci&oacute;n <a href="love.graphics.pop">emergente</a> correspondiente m&aacute;s adelante. Almacena el estado de transformaci&oacute;n de coordenadas actual en la pila de transformaci&oacute;n y lo mantiene activo. Los cambios posteriores a la transformaci&oacute;n se pueden deshacer mediante la operaci&oacute;n pop, que devuelve la transformaci&oacute;n de coordenadas al estado en el que estaba antes de llamar a push.
zh_cn: 此功能始终用于为以后的相应<a href="love.graphics.pop">弹出</a>操作做准备。它将当前坐标转换状态存储到转换堆栈中并保持活动状态。以后可以使用pop操作撤消对变换的更改，该操作将坐标变换返回到调用push之前的状态。

source: This function is always used to reverse a previous <a href="love.graphics.push">push</a> operation. It returns the current transformation state to what it was before the last preceding push.
es: Esta funci&oacute;n siempre se utiliza para invertir una operaci&oacute;n de <a href="love.graphics.push">empuje</a> anterior . Devuelve el estado de transformaci&oacute;n actual al que ten&iacute;a antes del &uacute;ltimo impulso anterior.
zh_cn: 此功能始终用于撤消上一个<a href="love.graphics.push">推入</a>操作。它将当前转换状态返回到上一个上一推送之前的状态。

source: This function is always used to reverse any previous calls to <a href="love.graphics.rotate">love.graphics.rotate</a>, <a href="love.graphics.scale">love.graphics.scale</a>, <a href="love.graphics.shear">love.graphics.shear</a> or <a href="love.graphics.translate">love.graphics.translate</a>. It returns the current transformation state to its defaults.
es: Esta funci&oacute;n siempre se usa para revertir cualquier llamada anterior a <a href="love.graphics.rotate">love.graphics.rotate</a> , <a href="love.graphics.scale">love.graphics.scale</a> , <a href="love.graphics.shear">love.graphics.shear</a> o <a href="love.graphics.translate">love.graphics.translate</a> . Devuelve el estado de transformaci&oacute;n actual a sus valores predeterminados.
zh_cn: 此功能始终用于撤消以前对<a href="love.graphics.rotate">love.graphics.rotate</a>，<a href="love.graphics.scale">love.graphics.scale</a>，<a href="love.graphics.shear">love.graphics.shear</a>或<a href="love.graphics.translate">love.graphics.translate的</a>任何调用。它将当前转换状态恢复为其默认值。

source: This function is called automatically before <a href="love.draw">love.draw</a> in the default <a href="love.run">love.run</a> function. See the example in <a href="love.run">love.run</a> for a typical use of this function.
es: Esta funci&oacute;n se llama autom&aacute;ticamente antes de <a href="love.draw">love.draw</a> en la funci&oacute;n predeterminada <a href="love.run">love.run</a> . Vea el ejemplo en <a href="love.run">love.run</a> para un uso t&iacute;pico de esta funci&oacute;n.
zh_cn: 在默认的<a href="love.run">love.run</a>函数中，在<a href="love.draw">love.draw</a>之前会自动调用此函数。有关此功能的典型用法，请参见<a href="love.run">love.run中</a>的示例。

source: This function is called exactly once at the beginning of the game.
es: Esta función se llama exactamente una vez al principio del juego.
zh_cn: 这个函数在游戏开始时正好被调用一次。

source: This function is not supported in earlier or later versions.
es: Esta función no está soportada en las versiones anteriores o posteriores.
zh_cn: 此功能在早期或以后的版本中不支持。

source: This function is not supported in earlier versions.
es: Esta función no está soportada en las versiones anteriores.
zh_cn: 在早期版本中不支持此功能。

source: This function is not supported in that and later versions.
es: Esta función no está soportada en esa y otras versiones posteriores.
zh_cn: 该版本及以后的版本不支持此功能。

source: This function is not supported in that and later versions. Use <a href="love.graphics.polygon">love.graphics.polygon</a> instead.
es: Esta funci&oacute;n no es compatible con esa y versiones posteriores. Utilice <a href="love.graphics.polygon">love.graphics.polygon</a> en su lugar.
zh_cn: 该版本和更高版本不支持此功能。请改用<a href="love.graphics.polygon">love.graphics.polygon</a>。

source: This function is not supported in that and later versions. Use <a href="love.graphics.polygon">love.graphics.polygon</a> instead..
es: Esta funci&oacute;n no es compatible con esa y versiones posteriores. Utilice <a href="love.graphics.polygon">love.graphics.polygon</a> en su lugar ...
zh_cn: 该版本和更高版本不支持此功能。使用<a href="love.graphics.polygon">love.graphics.polygon</a>代替。

source: This function is not supported in that version.
es: Esta función no está soportada en esa versión.
zh_cn: 该版本不支持此功能。

source: This function is used when writing your own <a href="love.run">love.run</a> function. It presents all the results of your drawing operations on the screen. See the example in <a href="love.run">love.run</a> for a typical use of this function.
es: Esta funci&oacute;n se utiliza al escribir su propia funci&oacute;n <a href="love.run">love.run</a> . Presenta todos los resultados de sus operaciones de dibujo en la pantalla. Vea el ejemplo en <a href="love.run">love.run</a> para un uso t&iacute;pico de esta funci&oacute;n.
zh_cn: 编写自己的<a href="love.run">love.run</a>函数时使用此函数。它在屏幕上显示所有绘图操作的结果。有关此功能的典型用法，请参见<a href="love.run">love.run中</a>的示例。

source: This function may have up to 16 return values, since it returns two values for each vertex in the polygon. In other words, it can return the coordinates of up to 8 points.
es: Esta función puede tener hasta 16 valores de retorno,ya que devuelve dos valores por cada vértice del polígono.En otras palabras,puede devolver las coordenadas de hasta 8 puntos.
zh_cn: 这个函数最多可以有16个返回值,因为它为多边形的每个顶点返回两个值。换句话说,它最多可以返回8个点的坐标。

source: This function returns the coordinates of a unit vector that points from the first shape to the second.
es: Esta función devuelve las coordenadas de un vector unitario que apunta de la primera forma a la segunda.
zh_cn: 这个函数返回从第一个形状指向第二个形状的单位向量的坐标。

source: This function returns the currently set horizontal and vertical <a href="wrapmode">wrapping modes</a> for the Canvas.
es: Esta funci&oacute;n devuelve los <a href="wrapmode">modos de envoltura</a> horizontal y vertical configurados actualmente para el lienzo.
zh_cn: 此函数返回画布当前设置的水平和垂直<a href="wrapmode">包装模式</a>。

source: This function returns the currently set horizontal and vertical <a href="wrapmode">wrapping modes</a> for the image.
es: Esta funci&oacute;n devuelve los <a href="wrapmode">modos de envoltura</a> horizontal y vertical establecidos actualmente para la imagen.
zh_cn: 此功能返回图像的当前设置的水平和垂直<a href="wrapmode">环绕模式</a>。

source: This function returns the directory containing the given
es: Esta función devuelve el directorio que contiene el
zh_cn: 这个函数返回包含给定的

source: This function samples the B&eacute;zier curve using recursive subdivision. You can control the recursion depth using the depth parameter.
es: Esta funci&oacute;n muestra la curva de B&eacute;zier mediante la subdivisi&oacute;n recursiva. Puede controlar la profundidad de recursividad utilizando el par&aacute;metro de profundidad.
zh_cn: 此函数使用递归细分对B&eacute;zier曲线进行采样。您可以使用depth参数控制递归深度。

source: This function sets the way an Image is repeated when it is drawn with a <a href="quad"> Quad</a> that is larger than the image's extent. An image may be clamped or set to repeat in both horizontal and vertical directions. Clamped images appear only once, but repeated ones repeat as many times as there is room in the Quad.
es: Esta funci&oacute;n establece la forma en que se repite una imagen cuando se dibuja con un <a href="quad">Quad</a> que es m&aacute;s grande que la extensi&oacute;n de la imagen. Una imagen puede sujetarse o configurarse para que se repita tanto en direcci&oacute;n horizontal como vertical. Las im&aacute;genes fijadas aparecen solo una vez, pero las repetidas se repiten tantas veces como haya espacio en el Quad.
zh_cn: 此功能设置当使用大于图像范围的<a href="quad">四边形</a>绘制图像时重复图像的方式。图像可能会被钳制或设置为在水平和垂直方向上重复。夹紧的图像仅出现一次，但是重复的图像重复的次数与Quad中的空间相同。

source: This function sets the way the edges of a Canvas are treated if it is scaled or rotated. If the WrapMode is set to 'clamp', the edge will not be interpolated. If set to 'repeat', the edge will be interpolated with the pixels on the opposing side of the framebuffer.
es: Esta función establece la forma en que se tratan los bordes de un lienzo si se escala o se rota.Si el WrapMode está configurado como "pinza",el borde no será interpolado.Si está configurado en 'repeat',el borde se interpolará con los píxeles del lado opuesto del framebuffer.
zh_cn: 该函数设置Canvas的边缘在被缩放或旋转时的处理方式。如果WrapMode设置为 "clip",则不会对边缘进行插值。如果设置为 "重复",则边缘将与帧缓冲区相反一侧的像素进行插值。

source: Sets the volume limits of the source. The limits have to be numbers from 0 to 1.
ja: ソースの音量制限を設定します。制限値は0から1までの数字でなければなりません。
ko: 소스의 음량 제한을 설정합니다. 제한은 0에서 1 사이의 숫자 여야합니다.

source: Sets the window caption.
ja: ウィンドウのキャプションを設定します。
ko: 창 캡션을 설정합니다.

source: Sets the window icon until the game is quit. Not all operating systems support very large icon images.
ja: ゲームが終了するまでのウィンドウアイコンを設定します。すべてのオペレーティングシステムが非常に大きなアイコン画像をサポートしているわけではありません。
ko: 게임이 종료 될 때까지 창 아이콘을 설정합니다. 모든 운영 체제가 매우 큰 아이콘 이미지를 지원하는 것은 아닙니다.

source: Sets the window icon.
ja: ウィンドウのアイコンを設定します。
ko: 창 아이콘을 설정합니다.

source: Sets the window title.
ja: ウィンドウのタイトルを設定します。
ko: 창 제목을 설정합니다.

source: Sets the window's dimensions. If these flags are set to 0 L&Ouml;VE automatically uses the user's desktop dimensions.
ja: ウィンドウの寸法を設定します。これらのフラグが0に設定されている場合、L&Ouml;VEは自動的にユーザーのデスクトップの寸法を使用します。
ko: 창의 치수를 설정합니다. 이 플래그가 0으로 설정되면 L&Ouml;VE는 자동으로 사용자의 데스크탑 크기를 사용합니다.

source: Sets the wrapping properties of a Canvas.
ja: キャンバスのラッピングプロパティを設定します。
ko: 캔버스의 래핑 속성을 설정합니다.

source: Sets the wrapping properties of a Framebuffer.
ja: フレームバッファのラッピングプロパティを設定します。
ko: Framebuffer의 래핑 속성을 설정합니다.

source: Sets the wrapping properties of a Texture.
ja: テクスチャのラッピング プロパティを設定します。
ko: 텍스처의 래핑 속성을 설정합니다.

source: Sets the wrapping properties of an Image.
ja: 画像のラッピングプロパティを設定します。
ko: 이미지의 줄 바꿈 속성을 설정합니다.

source: Sets the write directory for your game.
ja: ゲームの書き込みディレクトリを設定します。
ko: 게임의 쓰기 디렉토리를 설정합니다.

source: Sets the write directory for your game. Note that you can only set the name of the folder to store your files in, not the location.
ja: ゲームの書き込みディレクトリを設定します。ファイルを保存するフォルダの名前を設定するだけで、場所は設定できないことに注意してください。
ko: 게임의 쓰기 디렉토리를 설정합니다. 위치가 아닌 파일을 저장할 폴더 이름 만 설정할 수 있습니다.

source: Sets vertical synchronization mode.
ja: 垂直同期モードを設定します。
ko: 수직 동기화 모드를 설정합니다.

source: Sets whether <a href="love.graphics.setfrontfacewinding">back-facing</a> triangles in a <a href="mesh">Mesh</a> are culled.
ja: <a href="mesh">メッシュ</a>内の<a href="love.graphics.setfrontfacewinding">後ろ向きの</a>三角形をカリングするかどうかを設定します。
ko: <a href="mesh">메시의 </a><a href="love.graphics.setfrontfacewinding">뒷면</a> 삼각형을 컬링 할지 여부를 설정합니다 .

source: Sets whether L&Ouml;VE displays warnings when using deprecated functionality.
ja: 非推奨の機能を使用するときにL&Ouml;VEが警告を表示するかどうかを設定します。
ko: 더 이상 사용되지 않는 기능을 사용할 때 L&Ouml;VE가 경고를 표시할지 여부를 설정합니다.

source: Sets whether L&Ouml;VE displays warnings when using deprecated functionality. It is disabled by default in <a href="love.filesystem.isfused">fused mode</a>, and enabled by default otherwise.
ja: 非推奨の機能を使用するときにL&Ouml;VEが警告を表示するかどうかを設定します。<a href="love.filesystem.isfused">融合モード</a>ではデフォルトで無効になり、それ以外の場合はデフォルトで有効になります。
ko: 더 이상 사용되지 않는 기능을 사용할 때 L&Ouml;VE가 경고를 표시할지 여부를 설정합니다. 통합 <a href="love.filesystem.isfused">모드</a> 에서는 기본적으로 비활성화되고 그렇지 않으면 기본적으로 활성화됩니다.

source: Sets whether background audio / music from other apps should play while L&Ouml;VE is open. See <a href="love.system.hasbackgroundmusic">love.system.hasBackgroundMusic</a> for more details.
ja: L&Ouml;VEが開いているときに他のアプリのバックグラウンドオーディオ/音楽を再生するかどうかを設定します。詳細については、<a href="love.system.hasbackgroundmusic">love.system.hasBackgroundMusic</a>を参照してください。
ko: L&Ouml;VE가 열려있는 동안 다른 앱의 배경 오디오 / 음악을 재생할지 여부를 설정합니다. 자세한 내용은 <a href="love.system.hasbackgroundmusic">love.system.hasBackgroundMusic</a> 을 참조하십시오.

source: Sets whether files are saved in external storage (true) or internal storage (false) on Android.
ja: Androidでファイルを外部ストレージに保存するか(true)、内部ストレージに保存するか(false)を設定します。
ko: 파일이 Android의 외부 저장소 (true) 또는 내부 저장소 (false)에 저장되는지 여부를 설정합니다.

source: Sets whether love.filesystem follows symbolic links.
ja: love.filesystemがシンボリックリンクに従うかどうかを設定します。
ko: love.filesystem이 기호 링크를 따를 지 여부를 설정합니다.

source: Sets whether love.filesystem follows symbolic links. It is enabled by default in version <a href="https://love2d.org/wiki/0.10.0">0.10.0</a> and newer, and disabled by default in <a href="https://love2d.org/wiki/0.9.2">0.9.2</a>.
ja: love.filesystemがシンボリックリンクをたどるかどうかを設定します。バージョン<a href="https://love2d.org/wiki/0.10.0">0.10.0</a>以降ではデフォルトで有効になっており、<a href="https://love2d.org/wiki/0.9.2">0.9.2</a>ではデフォルトで無効になっています。
ko: love.filesystem이 기호 링크를 따를 지 여부를 설정합니다. 버전 <a href="https://love2d.org/wiki/0.10.0">0.10.0</a> 이상에서는 기본적으로 사용되며 <a href="https://love2d.org/wiki/0.9.2">0.9.2</a> 에서는 기본적으로 사용되지 않습니다 .

source: Sets whether particle angles and rotations are relative to their velocities.
ja: 粒子の角度と回転を速度に対する相対的なものにするかどうかを設定します。
ko: 입자 각도와 회전이 속도를 기준으로하는지 여부를 설정합니다.

source: Sets whether particle angles and rotations are relative to their velocities. If enabled, particles are aligned to the angle of their velocities and rotate relative to that angle.
ja: 粒子の角度と回転を速度に対して相対的に行うかどうかを設定します。有効にすると、パーティクルはその速度の角度に合わせて整列し、その角度に対して相対的に回転します。
ko: 입자 각도와 회전이 속도를 기준으로하는지 여부를 설정합니다. 활성화하면 파티클이 속도 각도에 맞춰 정렬되고 해당 각도를 기준으로 회전합니다.

source: Sets whether per-vertex colors are used instead of the constant color when drawing the Mesh (constant color being <a href="love.graphics.setcolor">love.graphics.setColor</a>.)
ja: メッシュを描画するときに、一定の色の代わりに頂点ごとの色を使用するかどうかを設定します（一定の色は<a href="love.graphics.setcolor">love.graphics.setColor</a>です）。
ko: 메쉬를 그릴 때 일정한 색상 대신 정점 별 색상을 사용할지 여부를 설정합니다 (일관된 색상은 <a href="love.graphics.setcolor">love.graphics.setColor)</a> .

source: Sets whether per-vertex colors are used instead of the constant color when drawing the Mesh.
ja: メッシュを描画する際に、定数色の代わりにバーテックス毎の色を使用するかどうかを設定します。
ko: 메쉬를 그릴 때 정색 대신 정점 별 색을 사용할지 여부를 설정합니다.

source: Sets whether relative mode is enabled for the mouse.
ja: マウスの相対モードを有効にするかどうかを設定します。
ko: 마우스에 상대 모드를 사용할지 여부를 설정합니다.

source: Sets whether the <a href="source">Source</a>'s position, velocity, direction, and cone angles are relative to the listener, or absolute.
ja: かどうかを設定し<a href="source">、ソース</a>の位置、速度、方向、及び円錐角はリスナー、または絶対に対するものです。
ko: 여부를 설정 <a href="source">소스</a> 의 위치, 속도, 방향, 및 콘 각은 청취자 또는 절대에 상대적이다.

source: Sets whether the Source should loop.
ja: ソースをループするかどうかを設定します。
ko: 소스를 반복할지 여부를 설정합니다.

source: Sets whether the Source's position and direction are relative to the listener.
ja: ソースの位置と方向がリスナーに対して相対的であるかどうかを設定します。
ko: 소스의 위치와 방향이 리스너를 기준으로할지 여부를 설정합니다.

source: Sets whether the body is active in the world.
ja: 体が世界で活躍しているかどうかを設定します。
ko: 신체가 세계에서 활성화되어 있는지 여부를 설정합니다.

source: Sets whether the connected Bodies should collide with each other.
ja: 接続されたBodyが互いに衝突するかどうかを設定します。
ko: 연결된 바디가 서로 충돌해야하는지 여부를 설정합니다.

source: Sets whether the device accelerometer on iOS and Android should be exposed as a 3-axis <a href="joystick">Joystick</a>. Disabling the accelerometer when it's not used may reduce CPU usage.
ja: iOSおよびAndroidのデバイスの加速度計を3軸<a href="joystick">ジョイスティック</a>として公開するかどうかを設定します。使用されていないときに加速度計を無効にすると、CPU使用率が低下する可能性があります。
ko: iOS 및 Android의 장치 가속도계를 3 축 <a href="joystick">조이스틱</a> 으로 노출해야하는지 여부를 설정합니다 . 가속도계를 사용하지 않을 때 비활성화하면 CPU 사용량이 줄어들 수 있습니다.

source: Sets whether the display is allowed to sleep while the program is running.
ja: プログラムの実行中に表示をスリープ状態にするかどうかを設定します。
ko: 프로그램이 실행되는 동안 디스플레이의 절전 모드 허용 여부를 설정합니다.

source: Sets whether the fixture should act as a sensor.
ja: フィクスチャがセンサーとして動作するかどうかを設定します。
ko: 고정구가 센서로 작동해야하는지 여부를 설정합니다.

source: Sets whether the system should mix the audio with the system's audio.
ja: システムのオーディオをシステムのオーディオとミックスするかどうかを設定します。
ko: 시스템이 오디오와 시스템의 오디오를 믹싱해야하는지 여부를 설정합니다.

source: Sets whether this shape should act as a sensor.
ja: この形状がセンサーとして動作するかどうかを設定します。
ko: 이 모양이 센서로 작동해야하는지 여부를 설정합니다.

source: Sets whether this shape should act as a sensor. Set the shape as a sensor if you want to be notified when collision between shapes occur, but don't want a physical response (for instance, maybe you want enemies to appear when the player "touches" a certain point).
ja: このシェイプをセンサーとして動作させるかどうかを設定します。シェイプ間の衝突が発生したときに通知を受けたいが、物理的な反応はしたくない場合(例えば、プレイヤーが特定のポイントに「タッチ」したときに敵が現れるようにしたい場合など)、このシェイプをセンサーとして設定します。
ko: 이 모양이 센서로 작동해야하는지 여부를 설정합니다. 모양 사이의 충돌이 발생했을 때 알림을 받고 싶지만 물리적 반응을 원하지 않는 경우 (예를 들어 플레이어가 특정 지점을 "만질 때"원수를 표시하려는 경우) 모양을 센서로 설정하십시오.

source: Sets whether triangles with clockwise- or counterclockwise-ordered vertices are considered front-facing.
ja: 時計回りまたは反時計回りの順序の頂点を持つ三角形を表向きとみなすかどうかを設定します。
ko: 시계 방향 또는 시계 반대 방향으로 정렬 된 정점이있는 삼각형을 앞쪽으로 간주할지 여부를 설정합니다.

source: Sets whether wireframe lines will be used when drawing.
ja: 描画時にワイヤーフレーム線を使用するかどうかを設定します。
ko: 그릴 때 와이어 프레임 선을 사용할지 여부를 설정합니다.

source: Sets which categories this fixture should <b>NOT</b> collide with.
ja: このフィクスチャが衝突してはなら<b>ない</b>カテゴリを設定します。
ko: 이 조명기가 충돌 <b>하지 않아야</b> 하는 카테고리를 설정합니다 .

source: Sets which categories this shape should <b>NOT</b> collide with.
ja: この図形が衝突してはなら<b>ない</b>カテゴリを設定します。
ko: 이 셰이프가 충돌 <b>하지 않아야</b> 하는 범주를 설정합니다 .

source: Sets which categories this shape should <b>NOT</b> collide with. With this function, you can exclude certain shape categories from collisions with this shape. The categories passed as parameters will be excluded from collisions - all others included.
ja: この図形が衝突してはなら<b>ない</b>カテゴリを設定します。この機能を使用すると、特定の形状カテゴリをこの形状との衝突から除外できます。パラメータとして渡されたカテゴリは衝突から除外されます-他のすべてが含まれます。
ko: 이 셰이프가 충돌 <b>하지 않아야</b> 하는 범주를 설정합니다 . 이 기능을 사용하면 특정 셰이프 범주를이 셰이프와의 충돌에서 제외 할 수 있습니다. 매개 변수로 전달 된 카테고리는 충돌에서 제외됩니다 (다른 모든 것 포함).

source: Setting a new length for the rope updates the maximum length values of the joint.
ja: ロープに新しい長さを設定すると、ジョイントの最大長の値が更新されます。
ko: 로프의 새 길이를 설정하면 조인트의 최대 길이 값이 업데이트됩니다.

source: Setting a position only works for mono sources. WAV files are always loaded as stereo, OGG works fine.
ja: ポジションの設定はモノラルソースでのみ動作します。WAVファイルは常にステレオで読み込まれますが、OGGは正常に動作します。
ko: 위치 설정은 모노 소스에서만 작동합니다. WAV 파일은 항상 스테레오로로드되며 OGG는 정상적으로 작동합니다.

source: Setting next and previous ChainShape vertices can help prevent unwanted collisions when a flat shape slides along the edge and moves over to the new shape.
ja: 次と前のChainShapeの頂点を設定することで、フラットシェイプがエッジに沿ってスライドして新しいシェイプに移動する際に、不要な衝突を防ぐことができます。
ko: 다음 및 이전 ChainShape 정점을 설정하면 평면 모양이 가장자리를 따라 미끄러 져 새 모양으로 이동할 때 원하지 않는 충돌을 방지 할 수 있습니다.

source: Setting next and previous EdgeShape vertices can help prevent unwanted collisions when a flat shape slides along the edge and moves over to the new shape.
ja: 次のエッジシェイプと前のエッジシェイプの頂点を設定することで、フラットシェイプがエッジに沿ってスライドして新しいシェイプに移動する際に、不要な衝突を防ぐことができます。
ko: 다음 및 이전 EdgeShape 정점을 설정하면 평면 모양이 가장자리를 따라 미끄러 져 새 모양으로 이동할 때 원하지 않는 충돌을 방지 할 수 있습니다.

source: Setting the game folder name
ja: ゲームフォルダ名の設定
ko: 게임 폴더 이름 설정

source: Setting the mass properties this way always results in a realistic (or at least good-looking) simulation, so using it is highly recommended.
ja: このように質量特性を設定すると、常にリアルな(あるいは少なくとも見栄えの良い)シミュレーションになりますので、使用することを強くお勧めします。
ko: 이 방법으로 질량 특성을 설정하면 항상 사실적인 (또는 최소한보기에 좋은) 시뮬레이션이 발생하므로이를 사용하는 것이 좋습니다.

source: Setting unused modules to false is encouraged when you release your game. It reduces startup time slightly (especially if the joystick module is disabled) and reduces memory usage (slightly).
ja: ゲームをリリースする際には、未使用のモジュールを false に設定することをお勧めします。これにより、起動時間がわずかに短縮され(特にジョイスティックモジュールが無効になっている場合)、メモリ使用量が(わずかに)減少します。
ko: 게임을 출시 할 때 사용하지 않는 모듈을 false로 설정하는 것이 좋습니다. 시작 시간이 약간 줄어들고 (특히 조이스틱 모듈이 비활성화 된 경우) 메모리 사용량이 약간 줄어 듭니다.

source: Setting which to search first
ja: 最初に検索する設定
ko: 먼저 검색 할 설정
