Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/love/love.*.006.xlf
Languages: es, ja, ko, zh_cn

source: The value to use when comparing with the stencil value of each pixel. Must be between 0 and 255.
es: El valor a utilizar cuando se compara con el valor de la plantilla de cada píxel.Debe estar entre 0 y 255.
zh_cn: 与每个像素的钢网值进行比较时使用的值。必须在0和255之间。

source: The value used when comparing with the stencil value of each pixel.
es: El valor usado cuando se compara con el valor de la plantilla de cada píxel.
zh_cn: 与每个像素的模板值比较时使用的值。

source: The values are returned in the same order as the vertex attributes in the Mesh's <a href="mesh-getvertexformat">vertex format</a>. A standard Mesh that wasn't <a href="love.graphics.newmesh">created</a> with a custom vertex format will return two position numbers, two texture coordinate numbers, and four color components: x, y, u, v, r, g, b, a.
es: Los valores se devuelven en el mismo orden que los atributos de v&eacute;rtice en el <a href="mesh-getvertexformat">formato de v&eacute;rtice de</a> la malla . Una malla est&aacute;ndar que no se <a href="love.graphics.newmesh">cre&oacute;</a> con un formato de v&eacute;rtice personalizado devolver&aacute; dos n&uacute;meros de posici&oacute;n, dos n&uacute;meros de coordenadas de textura y cuatro componentes de color: x, y, u, v, r, g, b, a.
zh_cn: 值以与网格的<a href="mesh-getvertexformat">顶点格式中</a>的顶点属性相同的顺序返回。未使用自定义顶点格式<a href="love.graphics.newmesh">创建的</a>标准网格将返回两个位置编号，两个纹理坐标编号以及四个颜色分量：x，y，u，v，r，g，b，a。

source: The values in each vertex table are in the same order as the vertex attributes in the Mesh's <a href="mesh-getvertexformat">vertex format</a>. A standard Mesh that wasn't <a href="love.graphics.newmesh">created</a> with a custom vertex format will use two position numbers, two texture coordinate numbers, and four color components per vertex: x, y, u, v, r, g, b, a.
es: Los valores de cada tabla de v&eacute;rtices est&aacute;n en el mismo orden que los atributos de v&eacute;rtice en el <a href="mesh-getvertexformat">formato de v&eacute;rtice de</a> la malla . Una malla est&aacute;ndar que no se <a href="love.graphics.newmesh">cre&oacute;</a> con un formato de v&eacute;rtice personalizado usar&aacute; dos n&uacute;meros de posici&oacute;n, dos n&uacute;meros de coordenadas de textura y cuatro componentes de color por v&eacute;rtice: x, y, u, v, r, g, b, a.
zh_cn: 每个顶点表中的值与Mesh <a href="mesh-getvertexformat">顶点格式中</a>的顶点属性的顺序相同。未使用自定义顶点格式<a href="love.graphics.newmesh">创建的</a>标准网格将使用两个位置编号，两个纹理坐标编号以及每个顶点四个颜色分量：x，y，u，v，r，g，b，a。

source: The values in each vertex table are in the same order as the vertex attributes in the specified vertex format. If no value is supplied for a specific vertex attribute component, it will be set to a default value of 0 if its <a href="https://love2d.org/w/index.php?title=AttributeDataType&amp;action=edit&amp;redlink=1">data type</a> is "float", or 255 if its data type is "byte".
es: Los valores de cada tabla de v&eacute;rtices est&aacute;n en el mismo orden que los atributos de v&eacute;rtice en el formato de v&eacute;rtice especificado. Si no se proporciona ning&uacute;n valor para un componente de atributo de v&eacute;rtice espec&iacute;fico, se establecer&aacute; en un valor predeterminado de 0 si su <a href="https://love2d.org/w/index.php?title=AttributeDataType&amp;action=edit&amp;redlink=1">tipo de datos</a> es "float", o 255 si su tipo de datos es "byte".
zh_cn: 每个顶点表中的值与指定顶点格式中的顶点属性的顺序相同。如果没有为特定的顶点属性组件提供任何值，则如果其<a href="https://love2d.org/w/index.php?title=AttributeDataType&amp;action=edit&amp;redlink=1">数据类型</a>为&ldquo; float&rdquo;，则将其设置为默认值0；如果其数据类型为&ldquo; byte&rdquo; ，则将其设置为默认值255。

source: The vector x component in local coordinates.
es: El componente del vector x en coordenadas locales.
zh_cn: 局部坐标中的向量x分量。

source: The vector x component in world coordinates.
es: El componente del vector x en las coordenadas mundiales.
zh_cn: 世界坐标中的向量x分量。

source: The vector y component in local coordinates.
es: El componente vectorial y en coordenadas locales.
zh_cn: 局部坐标中的矢量y分量。

source: The vector y component in world coordinates.
es: El componente vectorial y en coordenadas mundiales.
zh_cn: 世界坐标中的Y向量分量。

source: The version of the renderer with some extra driver-dependent version info, e.g. "2.1 INTEL-8.10.44".
es: La versión del renderizador con alguna información adicional de la versión dependiente del controlador,por ejemplo,"2.1 INTEL-8.10.44".
zh_cn: 渲染器的版本,包含一些额外的驱动相关版本信息,例如 "2.1 INTEL-8.10.44"。

source: The vertex format of the Mesh, which is a table containing tables for each vertex attribute the Mesh was created with, in the form of <code>{attribute, ...}</code>.
es: El formato de v&eacute;rtice de la malla, que es una tabla que contiene tablas para cada atributo de v&eacute;rtice con el que se cre&oacute; la malla, en forma de <code>{attribute, ...}</code> .
zh_cn: Mesh的顶点格式，该表是一个表格，其中包含用于创建Mesh的每个顶点属性的表格，形式为 <code>{attribute, ...}</code> 。

source: The vertex map allows you to re-order or reuse vertices when drawing without changing the actual vertex parameters or duplicating vertices. It is especially useful when combined with different <a href="meshdrawmode">Mesh Draw Modes</a>.
es: El mapa de v&eacute;rtices le permite reordenar o reutilizar los v&eacute;rtices al dibujar sin cambiar los par&aacute;metros reales de los v&eacute;rtices o duplicarlos. Es especialmente &uacute;til cuando se combina con diferentes <a href="meshdrawmode">modos de dibujo de malla</a> .
zh_cn: 顶点贴图允许您在绘制时重新排序或重用顶点，而无需更改实际的顶点参数或复制顶点。与不同的<a href="meshdrawmode">网格绘制模式</a>结合使用时，此功能特别有用。

source: The vertex map can also be used to make the draw mode reuse vertices, for example if the Mesh has 4 vertices and is using the "triangles" draw mode, the vertex map could be set to {1, 2, 3, 1, 3, 4} to draw 2 triangles using only 4 vertices, effectively drawing a quad using triangles.
es: El mapa de vértices también puede usarse para hacer que el modo de dibujar reutilice los vértices,por ejemplo si la Malla tiene 4 vértices y está usando el modo de dibujar "triángulos",el mapa de vértices podría fijarse en {1,2,3,1,3,4}para dibujar 2 triángulos usando sólo 4 vértices,dibujando efectivamente un cuadrilátero usando triángulos.
zh_cn: 顶点图也可以用来使绘制模式重用顶点,例如,如果Mesh有4个顶点,并且使用的是 "三角形 "绘制模式,那么可以将顶点图设置为{1,2,3,1,3,4},只使用4个顶点绘制2个三角形,有效地使用三角形绘制一个四边形。

source: The vertex shader code, or a filename pointing to a file with the code.
es: El código del sombreador de vértices,o un nombre de archivo que apunta a un archivo con el código.
zh_cn: 顶点着色器代码,或指向包含该代码的文件的文件名。

source: The vertical component of the texture coordinate.
es: El componente vertical de la coordenada de la textura.
zh_cn: 纹理坐标的垂直分量。

source: The vertical component of the texture coordinate. Texture coordinates are normally in the range of [0, 1], but can be greater or less (see <a href="wrapmode">WrapMode</a>).
es: El componente vertical de la coordenada de textura. Las coordenadas de textura est&aacute;n normalmente en el rango de [0, 1], pero pueden ser mayores o menores (ver <a href="wrapmode">WrapMode</a> ).
zh_cn: 纹理坐标的垂直分量。纹理坐标通常在[0，1]范围内，但可以更大或更小（请参见<a href="wrapmode">WrapMode</a>）。

source: The vertical component of the texture coordinate. Texture coordinates are normally in the range of [0, 1], but can be greater or less (see <a href="wrapmode">WrapMode</a>.)
es: El componente vertical de la coordenada de textura. Las coordenadas de textura est&aacute;n normalmente en el rango de [0, 1], pero pueden ser mayores o menores (ver <a href="wrapmode">WrapMode</a> ).
zh_cn: 纹理坐标的垂直分量。纹理坐标通常在[0，1]范围内，但可以更大或更小（请参见<a href="wrapmode">WrapMode）</a>。

source: The vertices are drawn as unconnected points (see <a href="love.graphics.setpointsize">love.graphics.setPointSize</a>.)
es: Los v&eacute;rtices se dibujan como puntos no conectados (consulte <a href="love.graphics.setpointsize">love.graphics.setPointSize</a> ).
zh_cn: 顶点被绘制为未连接的点（请参见<a href="love.graphics.setpointsize">love.graphics.setPointSize</a>。）

source: The vertices create a "fan" shape with the first vertex acting as the hub point. Can be easily used to draw simple convex polygons.
es: Los vértices crean una forma de "abanico" con el primer vértice actuando como el punto central.Se puede usar fácilmente para dibujar polígonos convexos simples.
zh_cn: 顶点创建一个 "扇形 "形状,第一个顶点作为中心点。可以很容易地用于绘制简单的凸多边形。

source: The vertices create a series of connected triangles using vertices 1, 2, 3, then 3, 2, 4 (note the order), then 3, 4, 5, and so on.
es: Los vértices crean una serie de triángulos conectados usando los vértices 1,2,3,luego 3,2,4 (fíjese en el orden),luego 3,4,5,y así sucesivamente.
zh_cn: 用顶点1,2,3,然后是3,2,4(注意顺序),然后是3,4,5,以此类推,顶点创建了一系列连接的三角形。

source: The vertices create unconnected triangles.
es: Los vértices crean triángulos inconexos.
zh_cn: 顶点创建不相连的三角形。

source: The vertices of the control polygon as a table in the form of <code>{x1, y1, x2, y2, x3, y3, ...}</code>.
es: Los v&eacute;rtices del pol&iacute;gono de control como una tabla en forma de <code>{x1, y1, x2, y2, x3, y3, ...}</code> .
zh_cn: 作为表格的控制多边形的顶点，形式为 <code>{x1, y1, x2, y2, x3, y3, ...}</code> 。

source: The vertices of the polygon as a table in the form of <code>{x1, y1, x2, y2, x3, y3, ...}</code>.
es: Los v&eacute;rtices del pol&iacute;gono como una tabla en forma de <code>{x1, y1, x2, y2, x3, y3, ...}</code> .
zh_cn: 多边形的顶点，其形式为 <code>{x1, y1, x2, y2, x3, y3, ...}</code> 。

source: The vertices of the polygon as a table.
es: Los vértices del polígono como una tabla.
zh_cn: 多边形的顶点为一个表。

source: The vertices of the polygon.
es: Los vértices del polígono.
zh_cn: 多边形的顶点。

source: The very first call to this function may take more time than expected because SDL's Haptic / Force Feedback subsystem needs to be initialized.
es: La primera llamada a esta función puede llevar más tiempo del esperado porque el subsistema de retroalimentación háptica/fuerza de SDL necesita ser inicializado.
zh_cn: 由于SDL的触觉/力反馈子系统需要初始化,因此第一次调用该函数可能需要比预期更多的时间。

source: The virtual axis to be checked.
es: El eje virtual que hay que comprobar.
zh_cn: 要检查的虚拟轴。

source: The virtual gamepad axis to bind.
es: El eje del panel de juego virtual para unir.
zh_cn: 要绑定的虚拟游戏手柄轴。

source: The virtual gamepad axis to get the binding for.
es: El eje de la alfombra virtual para conseguir la encuadernación.
zh_cn: 要获取绑定的虚拟游戏手柄轴。

source: The virtual gamepad axis.
es: El eje del panel de juego virtual.
zh_cn: 虚拟游戏手柄轴。

source: The virtual gamepad button to bind.
es: El botón del gamepad virtual para atar.
zh_cn: 虚拟游戏手柄按钮进行绑定。

source: The virtual gamepad button to get the binding for.
es: El botón de la alfombrilla de juego virtual para conseguir la encuadernación.
zh_cn: 虚拟游戏手柄按钮,以获得绑定为。

source: The virtual gamepad button.
es: El botón del panel de juego virtual.
zh_cn: 虚拟游戏手柄按钮。

source: The virtual gamepad buttons and axes are designed around the Xbox 360 controller layout.
es: Los botones y ejes del gamepad virtual están diseñados en torno a la disposición del controlador de Xbox 360.
zh_cn: 虚拟游戏手柄的按钮和轴是围绕Xbox 360控制器布局设计的。

source: The volume down key on an American layout.
es: La tecla de bajar el volumen en un diseño americano.
zh_cn: 美式布局的音量下键。

source: The volume for a Source, where 1.0 is normal volume. Volume cannot be raised above 1.0.
es: El volumen de una Fuente,donde 1.0 es el volumen normal.El volumen no puede ser aumentado por encima de 1.0.
zh_cn: 源的体积,其中1.0为正常体积。体积不能超过1.0。

source: The volume of the Source, where 1.0 is normal volume.
es: El volumen de la Fuente,donde 1,0 es el volumen normal.
zh_cn: 源的体积,其中1.0为正常体积。

source: The volume up key on an American layout.
es: La tecla de subir el volumen en un diseño americano.
zh_cn: 美式布局上的音量上调键。

source: The width and height of the screen (or canvas) currently being rendered to, stored in the x and y components of the variable. The z and w components are used internally by L&Ouml;VE. You can convert it to a vec2 with <code>love_ScreenSize.xy</code> or <code>vec2(love_ScreenSize)</code>.
es: El ancho y alto de la pantalla (o lienzo) que se est&aacute; renderizando actualmente, almacenado en los componentes xey de la variable. L&Ouml;VE utiliza internamente los componentes zyw. Puede convertirlo en vec2 con <code>love_ScreenSize.xy</code> o <code>vec2(love_ScreenSize)</code> .
zh_cn: 当前渲染到的屏幕（或画布）的宽度和高度，存储在变量的x和y分量中。Z和w组件由L&Ouml;VE内部使用。您可以使用 <code>love_ScreenSize.xy</code> 或 <code>vec2(love_ScreenSize)</code> 将其转换为vec2。

source: The width of a specific mipmap level of the CompressedImageData.
es: El ancho de un nivel específico del mipmap de los Datos de Imagen Comprimida.
zh_cn: CompressedImageData的特定mipmap级别的宽度。

source: The width of the <a href="imagedata">ImageData</a> in pixels.
es: El ancho de <a href="imagedata">ImageData</a> en p&iacute;xeles.
zh_cn: <a href="imagedata">ImageData</a>的宽度（以像素为单位）。

source: The width of the Canvas, in pixels.
es: El ancho del lienzo,en píxeles.
zh_cn: 画布的宽度,单位为像素。

source: The width of the CompressedImageData.
es: El ancho de los Datos de Imagen Comprimida.
zh_cn: CompressedImageData的宽度。

source: The width of the Image, in pixels.
es: El ancho de la imagen,en píxeles.
zh_cn: 图像的宽度,单位为像素。

source: The width of the ImageData.
es: El ancho de los ImageData.
zh_cn: ImageData的宽度。

source: The width of the Quad in the <a href="image">Image</a>. (Must be greater than 0.)
es: El ancho del Quad en la <a href="image">imagen</a> . (Debe ser mayor que 0.)
zh_cn: <a href="image">图片中</a>四边形的宽度。（必须大于0。）

source: The width of the Video.
es: El ancho del video.
zh_cn: 视频的宽度。

source: The width of the area within the Canvas to capture.
es: El ancho del área dentro del lienzo a capturar.
zh_cn: 要捕捉的Canvas中的区域宽度。

source: The width of the area within the Image to reload.
es: El ancho del área dentro de la imagen a recargar.
zh_cn: 要重新加载的图像区域的宽度。

source: The width of the area within the ImageData to apply the function to.
es: El ancho del área dentro de los Datos de Imagen para aplicar la función.
zh_cn: ImageData中要应用函数的区域的宽度。

source: The width of the box.
es: El ancho de la caja.
zh_cn: 盒子的宽度。

source: The width of the desktop.
es: El ancho del escritorio.
zh_cn: 桌面的宽度。

source: The width of the line.
es: El ancho de la línea.
zh_cn: 线的宽度。

source: The width of the rectangle to intersect with the existing scissor rectangle.
es: El ancho del rectángulo para intersectar con el rectángulo de tijera existente.
zh_cn: 与现有剪刀型矩形相交的矩形宽度。

source: The width of the rectangle.
es: El ancho del rectángulo.
zh_cn: 矩形的宽度。

source: The width of the sub-string (before scaling and other transformations).
es: El ancho de la subcadena (antes de la escalada y otras transformaciones).
zh_cn: 子串的宽度(在缩放和其他转换之前)。

source: The width of the text. If multiple sub-strings have been added with <a href="text-add">Text:add</a>, the width of the last sub-string is returned.
es: El ancho del texto. Si se han agregado varias subcadenas con <a href="text-add">Text: add</a> , se devuelve el ancho de la &uacute;ltima subcadena.
zh_cn: 文字的宽度。如果使用<a href="text-add">Text：add</a>添加了多个子字符串，则返回最后一个子字符串的宽度。

source: The width of the viewport.
es: El ancho del mirador.
zh_cn: 视口的宽度。

source: The width of the window.
es: El ancho de la ventana.
zh_cn: 窗口的宽度。

source: The window can be maximized if it is not fullscreen and is resizable, and either the user has pressed the window's Maximize button or <a href="love.window.maximize">love.window.maximize</a> has been called.
es: La ventana se puede maximizar si no es de pantalla completa y se puede cambiar de tama&ntilde;o, y el usuario ha presionado el bot&oacute;n Maximizar de la ventana o se ha llamado <a href="love.window.maximize">love.window.maximize</a> .
zh_cn: 如果该窗口不是全屏且可调整大小，则可以最大化该窗口，并且用户按下了窗口的&ldquo;最大化&rdquo;按钮或<a href="love.window.maximize">调用了love.window.maximize</a>。

source: The window icon image.
es: La imagen del icono de la ventana.
zh_cn: 窗口图标形象。

source: The window icon imagedata, or nil if no icon has been set with <a href="love.window.seticon">love.window.setIcon</a>.
es: El icono de la ventana imagedata, o nil si no se ha configurado ning&uacute;n icono con <a href="love.window.seticon">love.window.setIcon</a> .
zh_cn: 窗口图标图像数据，如果没有使用<a href="love.window.seticon">love.window.setIcon</a>设置图标，则为nil。

source: The window icon.
es: El icono de la ventana.
zh_cn: 窗口图标。

source: The window is considered visible if it's not minimized and the program isn't hidden.
es: La ventana se considera visible si no se minimiza y el programa no se oculta.
zh_cn: 如果窗口没有最小化,程序也没有被隐藏,则视为可见。

source: The window position is in the coordinate space of the display it is currently in.
es: La posición de la ventana está en el espacio de coordenadas de la pantalla en la que se encuentra actualmente.
zh_cn: 窗口的位置是在它当前所处的显示坐标空间。

source: The window position is in the coordinate space of the specified display.
es: La posición de la ventana está en el espacio de coordenadas de la pantalla especificada.
zh_cn: 窗口位置在指定显示的坐标空间内。

source: The world position of the impact can be calculated by multiplying the line vector with the third return value and adding it to the line starting point.
es: La posición mundial del impacto puede ser calculada multiplicando el vector de la línea con el tercer valor de retorno y sumándolo al punto de partida de la línea.
zh_cn: 冲击的世界位置可以用第三个返回值乘以线矢量,再加到线起点上计算。

source: The world scale is the number of pixels per meter. Try to keep your shape sizes less than 10 times this scale.
es: La escala mundial es el número de píxeles por metro.Intenta mantener el tamaño de tus formas a menos de 10 veces esta escala.
zh_cn: 世界比例尺是指每米的像素数。尽量让你的形状尺寸小于这个比例的10倍。

source: The world the body lives in.
es: El mundo en el que vive el cuerpo.
zh_cn: 身体所处的世界。

source: The world to create the body in.
es: El mundo en el que crear el cuerpo.
zh_cn: 界来创造身体在。

source: The x and y coordinates of additional points.
es: Las coordenadas x e y de puntos adicionales.
zh_cn: 附加点的x和y坐标。

source: The x component of force to apply to the center of mass.
es: El componente x de la fuerza a aplicar al centro de la masa.
zh_cn: 施加在质心上的力的x分量。

source: The x component of force to apply.
es: El componente x de la fuerza a aplicar.
zh_cn: 要施加的力的x分量。

source: The x component of gravity.
es: El componente x de la gravedad.
zh_cn: 重力的x分量。

source: The x component of the impulse applied to the center of mass.
es: El componente x del impulso aplicado al centro de la masa.
zh_cn: 应用于质心的冲量的x分量。

source: The x component of the impulse.
es: El componente x del impulso.
zh_cn: 冲量的x分量。

source: The x component of the new origin with respect to the old origin.
es: El componente x del nuevo origen con respecto al antiguo origen.
zh_cn: 新原点相对于旧原点的x分量。

source: The x component of the normal vector of the edge where the ray hit the shape.
es: La componente x del vector normal del borde donde el rayo golpeó la forma.
zh_cn: 射线击中形状的边缘的法向量的x分量。

source: The x component of the normal vector.
es: El componente x del vector normal.
zh_cn: 法向量的x分量。

source: The x component of the target linear offset, relative to the first Body.
es: El componente x del desplazamiento lineal del objetivo,relativo al primer Cuerpo.
zh_cn: 目标线性偏移量的x分量,相对于第一主体。

source: The x component of the velocity vector.
es: La componente x del vector de velocidad.
zh_cn: 速度矢量的x分量。

source: The x component of velocity at point (x,y).
es: El componente x de la velocidad en el punto (x,y).
zh_cn: 在(x,y)点的速度x分量。

source: The x coordinate of the anchor point.
es: La coordenada x del punto de anclaje.
zh_cn: 锚点的X坐标。

source: The x coordinate of the axis unit vector.
es: La coordenada x del vector de la unidad del eje.
zh_cn: 轴单位向量的X坐标。

source: The x coordinate of the axis vector.
es: La coordenada x del vector del eje.
zh_cn: 轴向量的X坐标。

source: The x coordinate of the center of mass.
es: La coordenada x del centro de masa.
zh_cn: 质量中心的X坐标。

source: The x coordinate of the contact point.
es: La coordenada x del punto de contacto.
zh_cn: 接触点的X坐标。

source: The x coordinate of the first anchor point.
es: La coordenada x del primer punto de anclaje.
zh_cn: 第一个锚点的x坐标。

source: The x coordinate of the first anchor.
es: La coordenada x del primer ancla.
zh_cn: 第一个锚点的X坐标。

source: The x coordinate of the first body's ground anchor.
es: La coordenada x del anclaje en tierra del primer cuerpo.
zh_cn: 第一个体的地锚的x坐标。

source: The x coordinate of the first contact point.
es: La coordenada x del primer punto de contacto.
zh_cn: 第一个接触点的X坐标。

source: The x coordinate of the particle image's draw offset.
es: La coordenada x de la imagen de la partícula dibuja un desplazamiento.
zh_cn: 粒子图像的绘制偏移量的x坐标。

source: The x coordinate of the pulley joint anchor in the first body.
es: La coordenada x de la articulación de la polea se ancla en el primer cuerpo.
zh_cn: 第一主体中滑轮接头锚的x坐标。

source: The x coordinate of the pulley joint anchor in the second body.
es: La coordenada x de la articulación de la polea se ancla en el segundo cuerpo.
zh_cn: 第二主体中滑轮接头锚的x坐标。

source: The x coordinate of the rotation offset.
es: La coordenada x del desplazamiento de la rotación.
zh_cn: 旋转偏移量的X坐标。

source: The x coordinate of the second anchor point.
es: La coordenada x del segundo punto de anclaje.
zh_cn: 第二锚点的x坐标。

source: The x coordinate of the second anchor.
es: La coordenada x del segundo anclaje.
zh_cn: 第二个锚点的x坐标。

source: The x coordinate of the second body's ground anchor.
es: La coordenada x del anclaje en tierra del segundo cuerpo.
zh_cn: 第二体的地锚的x坐标。

source: The x coordinate of the second contact point.
es: La coordenada x del segundo punto de contacto.
zh_cn: 第二接触点的x坐标。

source: The x offset of the circle.
es: El desplazamiento x del círculo.
zh_cn: 圆的X偏移量。

source: The x position in local coordinates.
es: La posición x en coordenadas locales.
zh_cn: 当地坐标中的X位置。

source: The x position in world coordinates.
es: La posición x en las coordenadas mundiales.
zh_cn: 世界坐标中的X位置。

source: The x position of the anchor point (world space).
es: La posición x del punto de anclaje (espacio mundial).
zh_cn: 锚点的X位置(世界空间)。

source: The x position of the anchor point.
es: La posición x del punto de anclaje.
zh_cn: 锚点的X位置。

source: The x position of the axis unit vector.
es: La posición x del vector de la unidad del eje.
zh_cn: 轴单位向量的X位置。

source: The x position of the body.
es: La posición X del cuerpo.
zh_cn: 体的X位。

source: The x position of the bottom-right point.
es: La posición X del punto inferior derecho.
zh_cn: 右下角点的x位置。

source: The x position of the center of mass.
es: La posición x del centro de masa.
zh_cn: 质量中心的X位置。

source: The x position of the circle in local coordinates.
es: La posición x del círculo en coordenadas locales.
zh_cn: 圆圈在局部坐标中的X位置。

source: The x position of the circle in world coordinates.
es: La posición x del círculo en las coordenadas mundiales.
zh_cn: 圆形在世界坐标中的X位置。

source: The x position of the circle.
es: La posición x del círculo.
zh_cn: 圆的X位置。

source: The x position of the connecting point.
es: La posición x del punto de conexión.
zh_cn: 连接点的x位置。

source: The x position of the end point of the ray.
es: La posición X del punto final del rayo.
zh_cn: 射线端点的X位置。

source: The x position of the first anchor point (local space body 1).
es: La posición x del primer punto de anclaje (cuerpo espacial local 1).
zh_cn: 第一个锚点(局部空间体1)的x位置。

source: The x position of the first anchor point.
es: La posición x del primer punto de anclaje.
zh_cn: 第一个锚点的X位置。

source: The x position of the first point.
es: La posición x del primer punto.
zh_cn: 第一个点的x位置。

source: The x position of the input line end point.
es: La posición x del punto final de la línea de entrada.
zh_cn: 输入线端点的X位置。

source: The x position of the input line starting point.
es: La posición x del punto de partida de la línea de entrada.
zh_cn: 输入线起点的X位置。

source: The x position of the intersection point.
es: La posición x del punto de intersección.
zh_cn: 交点的X位置。

source: The x position of the listener.
es: La posición X del oyente.
zh_cn: 倾听者的X位置。
