Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/love/love.*.006.xlf
Languages: es, ja, ko, zh_cn

source: Several articles have been written about
ja: について書かれた記事がいくつかあります。
ko: 몇 가지 기사가 작성되었습니다

source: Several same-size 2D textures organized into a single object. Similar to a texture atlas / sprite sheet, but avoids sprite bleeding and other issues.
ja: 複数の同サイズの2Dテクスチャを1つのオブジェクトにまとめたもの。テクスチャアトラス/スプライトシートに似ていますが、スプライトのブリードなどの問題を回避しています。
ko: 여러 개의 동일한 크기의 2D 텍스처가 단일 개체로 구성됩니다. 텍스처 아틀라스 / 스프라이트 시트와 유사하지만 스프라이트 번짐 및 기타 문제를 방지합니다.

source: Shader Language
ja: シェーダ言語
ko: 쉐이더 언어

source: Shader Variables
ja: シェーダ変数
ko: 셰이더 변수

source: Shader effect.
ja: シェーダー効果。
ko: 쉐이더 효과.

source: Shaders are not programmed in Lua, but by using a special shader language &ndash; GLSL, with a few aliases and a different entry point for convenience &ndash; instead. GLSL has very similar syntax to C. None of the aliases L&Ouml;VE provides are mandatory, but using <code>Texel</code> instead of <code>texture2D</code> is recommended since <code>Texel</code> works in all glsl versions, whereas <code>texture2D</code> does not work in GLSL 3.
ja: シェーダーはLuaでプログラムされていませんが、代わりに特別なシェーダー言語（GLSL）を使用して、いくつかのエイリアスと異なるエントリポイントを使用しています。GLSLの構文はCと非常に似ています。L&Ouml;VEが提供するエイリアスは必須ではありませんが、 <code>Texel</code> はすべてのglslバージョンで機能するのに対し、 <code>texture2D</code> はGLSL 3では機能しないため、 <code>texture2D</code> の代わりに <code>Texel</code> を使用することをお勧めします。
ko: 셰이더는 Lua에서 프로그래밍되지 않고 대신 특수 셰이더 언어 인 GLSL을 사용하여 몇 개의 별칭과 편의를 위해 다른 진입 점을 사용합니다. GLSL은 C와 매우 유사한 구문을 가지고 있습니다. <code>texture2D</code> 가 제공하는 별칭은 필수 사항이 아니지만 <code>Texel</code> 은 모든 glsl 버전에서 작동하는 반면 <code>texture2D</code> 는 GLSL 3에서 작동하지 않으므로 texture2D 대신 <code>Texel</code> 을 사용하는 것이 좋습니다 .

source: Shaders are not programmed in Lua, but by using a special shader language instead. The shader language is basically <a href="http://www.opengl.org/sdk/docs/manglsl/">GLSL 1.20</a> (<a href="http://www.opengl.org/registry/doc/GLSLangSpec.Full.1.20.8.pdf">specs</a>) with a few aliases added for existing types:
ja: シェーダーはLuaでプログラムされていませんが、代わりに特別なシェーダー言語を使用しています。シェーダー言語は基本的に<a href="http://www.opengl.org/sdk/docs/manglsl/">GLSL 1.20</a>（<a href="http://www.opengl.org/registry/doc/GLSLangSpec.Full.1.20.8.pdf">specs</a>）で、既存のタイプにいくつかのエイリアスが追加されています。
ko: 셰이더는 Lua로 프로그래밍 된 것이 아니라 특수 셰이더 언어를 대신 사용하여 프로그래밍됩니다. 셰이더 언어는 기본적으로 <a href="http://www.opengl.org/sdk/docs/manglsl/">GLSL 1.20</a> ( <a href="http://www.opengl.org/registry/doc/GLSLangSpec.Full.1.20.8.pdf">specs</a> )이며 기존 유형에 대해 몇 가지 별칭이 추가되었습니다.

source: Shaders are small programs which are run on the graphics card when drawing. Vertex shaders are run once for each vertex (for example, an image has 4 vertices - one at each corner. A <a href="mesh">Mesh</a> might have many more.) Pixel shaders are run once for each pixel on the screen which the drawn object touches. Pixel shader code is executed after all the object's vertices have been processed by the vertex shader.
ja: シェーダーは、描画時にグラフィックカードで実行される小さなプログラムです。頂点シェーダーは、頂点ごとに1回実行されます（たとえば、イメージには4つの頂点があります（各コーナーに1つ）。<a href="mesh">メッシュに</a>はさらに多くの頂点がある場合があります）。ピクセルシェーダーは、描画されたオブジェクトが接触する画面上のピクセルごとに1回実行されます。ピクセルシェーダーコードは、オブジェクトのすべての頂点が頂点シェーダーによって処理された後に実行されます。
ko: 셰이더는 그릴 때 그래픽 카드에서 실행되는 작은 프로그램입니다. 정점 셰이더는 각 정점에 대해 한 번씩 실행됩니다 (예 : 이미지에는 각 모서리에 하나씩 4 개의 정점이 있습니다. <a href="mesh">메시</a> 에는 더 많은 정점 이있을 수 있습니다.) 픽셀 셰이더는 그려진 개체가 터치하는 화면의 각 픽셀에 대해 한 번씩 실행됩니다. 픽셀 셰이더 코드는 모든 개체의 정점이 정점 셰이더에 의해 처리 된 후에 실행됩니다.

source: Shaders are small programs which are run on the video card when drawing. Vertex shaders are run once for each vertex (for example, an image has 4 vertices - one at each corner. A <a href="mesh">Mesh</a> might have many more.) Pixel shaders are run once for each pixel on the screen which the drawn object touches. Pixel shader code is executed after all the object's vertices have been processed by the vertex shader.
ja: シェーダーは、描画時にビデオカード上で実行される小さなプログラムです。頂点シェーダーは頂点ごとに1回実行されます（たとえば、画像には4つの頂点があり、各コーナーに1つあります。<a href="mesh">メッシュに</a>はさらに多くの頂点がある場合があります）。ピクセルシェーダーは、描画オブジェクトが接触する画面上のピクセルごとに1回実行されます。ピクセルシェーダーコードは、オブジェクトのすべての頂点が頂点シェーダーによって処理された後に実行されます。
ko: 셰이더는 그릴 때 비디오 카드에서 실행되는 작은 프로그램입니다. 정점 셰이더는 각 정점마다 한 번씩 실행됩니다 (예 : 이미지에는 각 꼭지점에 하나씩 4 개의 정점이 있습니다. <a href="mesh">메쉬</a> 에는 더 많은 것이있을 수 있습니다). 픽셀 셰이더는 그려진 객체가 닿는 화면의 각 픽셀마다 한 번씩 실행됩니다. 픽셀 쉐이더 코드는 모든 객체의 정점이 버텍스 쉐이더에 의해 처리 된 후에 실행됩니다.

source: Shear factor (x-axis).
ja: せん断係数(x軸)。
ko: 전단 계수 (x 축).

source: Shear factor (y-axis).
ja: せん断係数(Y軸)。
ko: 전단 계수 (y- 축).

source: Shearing / skew factor (x-axis).
ja: 剪断/スキュー係数(x軸)。
ko: 전단 / 스큐 계수 (x- 축).

source: Shearing / skew factor (y-axis).
ja: 剪断/スキュー係数(y軸)。
ko: 전단 / 비뚤어 짐 계수 (y 축).

source: Shearing / skew factor on the x-axis.
ja: x軸の剪断/スキュー係数。
ko: x 축의 전단 / 뒤틀림 계수.

source: Shearing / skew factor on the y-axis.
ja: y軸の剪断/スキュー係数。
ko: y 축의 전단 / 뒤틀림 계수.

source: Shearing factor (x-axis).
ja: せん断係数(x軸)。
ko: 전단 계수 (x- 축).

source: Shearing factor (y-axis).
ja: せん断係数(Y軸)。
ko: 전단 계수 (y- 축).

source: Shears the coordinate system.
ja: 座標系を剪断します。
ko: 좌표계를 깎습니다.

source: Shorthand for creating rectanglar <a href="polygonshape">PolygonShapes</a>.
ja: 長方形の<a href="polygonshape">PolygonShapes</a>を作成するための省略形。
ko: <a href="polygonshape">직선 PolygonShapes</a> 작성을위한 축약 .

source: Shorthand for creating rectangluar <a href="polygonshape">PolygonShapes</a>.
ja: 長方形の<a href="polygonshape">PolygonShapes</a>を作成するための省略形。
ko: <a href="polygonshape">직선 PolygonShapes</a> 작성을위한 축약 .

source: Shorthand for creating rectangluar <strong>PolygonShapes</strong>.
ja: 長方形の<strong>PolygonShapes</strong>を作成するための<strong>省略形</strong>。
ko: <strong>직선 PolygonShapes</strong> 작성을위한 축약 .

source: Shorthand for creating rectangular <a href="polygonshape">PolygonShapes</a>.
ja: 長方形の<a href="polygonshape">PolygonShapes</a>を作成するための省略形。
ko: 직사각형 <a href="polygonshape">PolygonShapes</a> 를 만드는 약어 입니다.

source: Shorthand for creating rectangular <strong>PolygonShapes</strong>.
ja: 長方形の<strong>PolygonShapes</strong>を作成するための<strong>省略形</strong>。
ko: 직사각형 <strong>PolygonShapes</strong> 를 만드는 <strong>약어</strong> 입니다.

source: Show the resolution of the monitor the window is currently in
ja: ウィンドウが現在表示されているモニターの解像度を表示します。
ko: 창이 현재있는 모니터의 해상도 표시

source: Simple Example
ja: 簡単な例
ko: 간단한 예

source: Simultaneously stops all given <a href="source">Sources</a>.
ja: 指定されたすべての<a href="source">ソースを</a>同時に停止します。
ko: 주어진 모든 <a href="source">소스를</a> 동시에 중지합니다 .

source: Since <a href="https://love2d.org/wiki/0.8.0">0.8.0</a>, event names are no longer abbreviated.
ja: <a href="https://love2d.org/wiki/0.8.0">0.8.0</a>以降、イベント名は省略されなくなりました。
ko: <a href="https://love2d.org/wiki/0.8.0">0.8.0</a> 이후로 , 이벤트 이름은 더 이상 축약되지 않습니다.

source: Since <a href="https://love2d.org/wiki/11.0">11.0</a>, L&Ouml;VE does fully support non-blocking TCP connections on Windows
ja: <a href="https://love2d.org/wiki/11.0">11.0</a>以降、L&Ouml;VEはWindowsでノンブロッキングTCP接続を完全にサポートします
ko: 이후 <a href="https://love2d.org/wiki/11.0">11.0</a> , 사랑은 완전히 Windows에서 TCP 연결을 비 차단 지원하지 않습니다

source: Since <a href="https://love2d.org/wiki/11.0">11.0</a>, this function returns width and height in DPI-scaled units rather than pixels.
ja: <a href="https://love2d.org/wiki/11.0">11.0</a>以降、この関数は幅と高さをピクセルではなくDPIスケールの単位で返します。
ko: <a href="https://love2d.org/wiki/11.0">11.0</a> 이후이 함수는 픽셀이 아닌 DPI 스케일 단위로 너비와 높이를 반환합니다.

source: Since L&Ouml;VE <a href="https://love2d.org/wiki/11.3">11.3</a>, <a href="data-getffipointer">Data:getFFIPointer</a> is a preferred alternative because it can work with new 64-bit architectures.
ja: 愛以来<a href="https://love2d.org/wiki/11.3">11.3</a>、<a href="data-getffipointer">データ：getFFIPointerは、</a>それが新しい64ビットアーキテクチャで動作することができるため好ましい代替です。
ko: 사랑 때문에 <a href="https://love2d.org/wiki/11.3">11.3</a> , <a href="data-getffipointer">데이터 : getFFIPointer는</a> 이 새로운 64 비트 아키텍처로 작업 할 수 있기 때문에 선호하는 대안이다.

source: Since this function enqueues a screenshot capture rather than executing it immediately, it can be called from an input callback or <a href="love.update">love.update</a> and it will still capture all of what's drawn to the screen in that frame.
ja: この関数は、スクリーンショットキャプチャをすぐに実行するのではなくキューに入れるため、入力コールバックまたは<a href="love.update">love.update</a>から呼び出すことができ、そのフレームで画面に描画されたものをすべてキャプチャします。
ko: 이 함수는 스크린 샷 캡처를 즉시 실행하지 않고 대기열에 추가하기 때문에 입력 콜백 또는 <a href="love.update">love.update</a> 에서 호출 할 수 있으며 해당 프레임의 화면에 그려지는 모든 것을 캡처합니다.

source: Single quote key
ja: シングルクォートキー
ko: 작은 따옴표 키

source: Single-channel (red component) format (8 bpp).
ja: シングルチャンネル(赤成分)フォーマット(8bpp)。
ko: 단일 채널 (빨간색 구성 요소) 형식 (8bpp).

source: Sixth event argument.
ja: 第六事象の議論。
ko: 여섯 번째 이벤트 인수.

source: Size in bytes of the data to send. If nil, as many bytes as the specified uniform uses will be copied.
ja: 送信するデータのサイズをバイト単位で指定します。nil の場合、指定されたユニフォームの使用量と同じだけのバイト数がコピーされます。
ko: 전송할 데이터의 크기 (바이트)입니다. nil이면 지정된 uniform 사용만큼의 바이트가 복사됩니다.

source: Slash key
ja: スラッシュキー
ko: 슬래시 키

source: Slashed circle or crossbones.
ja: スライスされた円や十字架。
ko: 슬래시 원 또는 이미지.

source: Small wait cursor with an arrow pointer.
ja: 矢印ポインタを持つ小さな待ちカーソル。
ko: 화살표 포인터가있는 작은 대기 커서.

source: Smooth points are notoriously buggy on a lot of graphics drivers. Use "rough" <a href="pointstyle">point style</a> for increased consistency between different drivers.
ja: 滑らかなポイントは、多くのグラフィックスドライバーで悪名高いです。異なるドライバー間の一貫性を高めるには、「ラフ」<a href="pointstyle">ポイントスタイル</a>を使用します。
ko: 많은 그래픽 드라이버에서 매끄러운 점은 악명 높았습니다. 다른 드라이버 간의 일관성을 높이려면 "거친" <a href="pointstyle">포인트 스타일</a> 을 사용하십시오 .

source: Smooth scrolling
ja: スムーズなスクロール
ko: 부드러운 스크롤

source: Smooth variations in opacity do not mix well with this format. DXT1 or DXT5 is generally better in every situation.
ja: 滑らかな不透明度のバリエーションは、このフォーマットとは相性が良くありません。DXT1とDXT5のどちらが一般的にはどのような状況でも良いでしょう。
ko: 불투명도의 부드러운 변화는이 형식과 잘 어울리지 않습니다. DXT1 또는 DXT5는 일반적으로 모든 상황에서 더 좋습니다.

source: Snap the mouse to the horizontal center of the screen while maintaining the coordinate along the y-axis by using <a href="love.mouse.gety">love.mouse.getY</a>.
ja: <a href="love.mouse.gety">love.mouse.getY</a>を使用して、y軸に沿った座標を維持しながら、画面の水平方向の中心にマウスをスナップします。
ko: <a href="love.mouse.gety">love.mouse.getY</a> 를 사용하여 y 축을 따라 좌표를 유지하면서 마우스를 화면의 수평 중앙에 맞 춥니 다 .

source: Some Canvas formats have higher system requirements than the default format. Use <a href="love.graphics.getcanvasformats">love.graphics.getCanvasFormats</a> to check for support.
ja: 一部のCanvasフォーマットには、デフォルトフォーマットよりも高いシステム要件があります。使用<a href="love.graphics.getcanvasformats">love.graphics.getCanvasFormatsは、</a>サポートのためにチェックします。
ko: 일부 캔버스 형식은 기본 형식보다 시스템 요구 사항이 더 높습니다. <a href="love.graphics.getcanvasformats">love.graphics.getCanvasFormats</a> 를 사용 하여 지원 여부 를 확인하십시오.

source: Some Linux distribution may not ship with SDL 2.0.6 or later, in which case this function will returns 0 for all the three values.
ja: Linuxディストリビューションによっては、SDL 2.0.6以降を搭載していない場合があります。
ko: 일부 Linux 배포판은 SDL 2.0.6 이상과 함께 제공되지 않을 수 있습니다.이 경우이 함수는 세 값 모두에 대해 0을 반환합니다.

source: Some interesting places to go from here:
ja: ここから行くと面白いところもあります。
ko: 여기 몇 가지 흥미로운 장소가 있습니다.

source: Some older or low-end systems don't always support all graphics features.
ja: 古いシステムやローエンドシステムの中には、すべてのグラフィック機能をサポートしているとは限らないものもあります。
ko: 일부 구형 또는 저가형 시스템은 모든 그래픽 기능을 항상 지원하지는 않습니다.

source: Something completely different like a device.
ja: デバイスのように全く違うもの。
ko: 장치처럼 완전히 다른 것.

source: Sometimes known as <a href="http://pcgamingwiki.com/wiki/Borderless_fullscreen_windowed">borderless fullscreen windowed</a> mode. A borderless screen-sized window is created which sits on top of all desktop UI elements. The window is automatically resized to match the dimensions of the desktop, and its size cannot be changed.
ja: <a href="http://pcgamingwiki.com/wiki/Borderless_fullscreen_windowed">ボーダーレスフルスクリーンウィンドウ</a>モードと呼ばれることもあります。すべてのデスクトップUI要素の上に配置されるボーダーレスの画面サイズのウィンドウが作成されます。ウィンドウはデスクトップのサイズに合わせて自動的にサイズ変更され、サイズは変更できません。
ko: <a href="http://pcgamingwiki.com/wiki/Borderless_fullscreen_windowed">경계선없는 전체 화면 창</a> 모드 라고도 합니다. 모든 데스크탑 UI 요소 위에있는 경계선없는 화면 크기의 창이 작성됩니다. 창의 크기는 데스크탑의 크기에 맞게 자동으로 조정되며 크기는 변경할 수 없습니다.

source: Sort table to ensure it is in order
ja: テーブルをソートして順番を確認します。
ko: 순서대로 정렬 테이블 정렬

source: Source ImageData from which to copy.
ja: コピー元の画像データ。
ko: 복사 할 원본 ImageData입니다.

source: Source height.
ja: ソースの高さ。
ko: 소스 높이.

source: Source top-left position on x-axis.
ja: X軸上の左上の位置をソースとします。
ko: x 축에서 왼쪽 상단 소스.

source: Source top-left position on y-axis.
ja: y軸上の左上の位置をソースとします。
ko: y 축에서 왼쪽 상단 소스.

source: Source width.
ja: ソースの幅。
ko: 소스 너비.

source: Sources do not get attenuated.
ja: ソースが減衰することはありません。
ko: 소스가 감쇠되지 않습니다.

source: Space key
ja: スペースキー
ko: 스페이스 키

source: Spawn a bunch of particles
ja: パーティクルの束を生成
ko: 파티클 무리 생성

source: Specifies the <a href="fullscreentype">type of fullscreen</a> mode to use (<code>exclusive</code> or <code>desktop</code>). Generally the <code>desktop</code> is recommended, as it is less restrictive than <code>exclusive</code> mode on some operating systems. (Note: In <a href="https://love2d.org/wiki/0.9.2">0.9.2</a> and earlier, use <code>normal</code> instead of <code>exclusive</code>.)
ja: 使用する<a href="fullscreentype">全画面</a>モードのタイプを指定します（ <code>exclusive</code> または <code>desktop</code> ）。一部のオペレーティングシステムでは、 <code>desktop</code> が <code>exclusive</code> モードよりも制限が少ないため、通常はデスクトップが推奨されます。（注：<a href="https://love2d.org/wiki/0.9.2">0.9.2</a>以前では、 <code>exclusive</code> なく <code>normal</code> を使用してください。）
ko: 사용할 <a href="fullscreentype">전체 화면</a> 모드 유형을 지정합니다 ( <code>exclusive</code> 또는 <code>desktop</code> ). 일반적으로 <code>desktop</code> 은 일부 운영 체제에서 <code>exclusive</code> 모드 보다 덜 제한적이기 때문에 권장 됩니다. (참고 :에서 <a href="https://love2d.org/wiki/0.9.2">0.9.2</a> 및 이전 버전 사용 <code>normal</code> 대신 <code>exclusive</code> .)

source: Specifies the interval in milliseconds that pings are sent to the other end of the connection (defaults to 500).
ja: 接続の相手側にpingを送信する間隔をミリ秒単位で指定します (既定値は500)。
ko: 연결의 다른 쪽 끝으로 핑이 전송되는 간격을 밀리 초 단위로 지정합니다 (기본값은 500).

source: Specifies whether the two bodies should collide with each other.
ja: 2つの体を衝突させるかどうかを指定します。
ko: 두 바디가 서로 충돌해야하는지 여부를 지정합니다.

source: SpriteBatches do not support removing individual sprites. One can do a pseudo removal (instead of clearing and re-adding everything) by:
ja: SpriteBatches は個々のスプライトの削除には対応していません。擬似的に削除することができます(すべてをクリアして追加し直す代わりに)。
ko: SpriteBatches는 개별 스프라이트 제거를 지원하지 않습니다. 다음을 수행하여 의사 제거 (모든 것을 지우고 다시 추가하는 대신) 할 수 있습니다.

source: SpriteBatches now automatically grow when necessary.
ja: スプライトバッチが必要に応じて自動的に成長するようになりました。
ko: SpriteBatch는 이제 필요할 때 자동으로 커집니다.

source: Squish a rectangle
ja: 四角いものをつぶす
ko: 직사각형을 찌르십시오

source: Standard deviation of the distribution.
ja: 分布の標準偏差。
ko: 분포의 표준 편차.

source: Standard exclusive-fullscreen mode. Changes the display mode (actual resolution) of the monitor.
ja: 標準の排他的フルスクリーンモードです。モニターの表示モード(実際の解像度)を変更します。
ko: 표준 독점 전체 화면 모드. 모니터의 디스플레이 모드 (실제 해상도)를 변경합니다.

source: Start button.
ja: スタートボタン。
ko: 시작 버튼.

source: Start color, alpha component (0-255).
ja: 開始色、アルファ成分(0-255)。
ko: 시작 색상, 알파 구성 요소 (0-255).

source: Start color, blue component (0-255).
ja: スタートカラー、青色コンポーネント(0-255)。
ko: 시작 색상, 파란색 구성 요소 (0-255).

source: Start color, green component (0-255).
ja: スタートカラー、緑のコンポーネント(0-255)。
ko: 시작 색상, 녹색 구성 요소 (0-255).

source: Start color, red component (0-255).
ja: スタートカラー、赤色成分(0~255)。
ko: 시작 색상, 빨간색 구성 요소 (0-255).

source: Starting position in bytes to queue.
ja: キューの開始位置をバイト単位で指定します。
ko: 대기열에 넣을 시작 위치 (바이트)입니다.

source: Starting position of safe area (x-axis).
ja: 安全エリアの開始位置(x軸)。
ko: 안전 영역 (x 축)의 시작 위치.

source: Starting position of safe area (y-axis).
ja: 安全エリアの開始位置(Y軸)。
ko: 안전 영역 (Y 축)의 시작 위치.

source: Starting with version <a href="https://love2d.org/wiki/11.0">11.0</a>, a stencil buffer must be set or requested in <a href="love.graphics.setcanvas">love.graphics.setCanvas</a> when using stencils with a Canvas. <code>love.graphics.setCanvas{canvas, stencil=true}</code> is an easy way to use an automatically provided temporary stencil buffer in that case.
ja: バージョン<a href="https://love2d.org/wiki/11.0">11.0</a>以降、Canvasでステンシルを使用する場合は、<a href="love.graphics.setcanvas">love.graphics.setCanvasで</a>ステンシルバッファーを設定または要求する必要があります。 <code>love.graphics.setCanvas{canvas, stencil=true}</code> は、その場合に自動的に提供される一時的なステンシルバッファーを使用する簡単な方法です。
ko: 버전 <a href="https://love2d.org/wiki/11.0">11.0</a> 부터는 캔버스와 함께 스텐실을 사용할 때 <a href="love.graphics.setcanvas">love.graphics.setCanvas</a> 에서 스텐실 버퍼를 설정하거나 요청해야합니다 . <code>love.graphics.setCanvas{canvas, stencil=true}</code> 는이 경우 자동으로 제공되는 임시 스텐실 버퍼를 사용하는 쉬운 방법입니다.

source: Starts and stops the joint motor.
ja: ジョイントモータの起動・停止を行います。
ko: 조인트 모터를 시작 및 정지합니다.

source: Starts or stops the joint motor.
ja: ジョイントモータを起動または停止します。
ko: 조인트 모터를 시작 또는 중지합니다.

source: Starts playing multiple Sources simultaneously.
ja: 複数のソースの同時再生を開始します。
ko: 동시에 여러 소스 재생을 시작합니다.

source: Starts playing the Source.
ja: ソースの再生を開始します。
ko: 소스 재생을 시작합니다.

source: Starts playing the Video.
ja: ビデオの再生を開始します。
ko: 비디오 재생을 시작합니다.

source: Starts playing the Video. In order for the video to appear onscreen it must be drawn with <a href="love.graphics.draw">love.graphics.draw</a>.
ja: ビデオの再生を開始します。ビデオを画面に表示するには、<a href="love.graphics.draw">love.graphics.draw</a>で描画する必要があります。
ko: 비디오 재생을 시작합니다. 비디오가 화면에 나타나게하려면 <a href="love.graphics.draw">love.graphics.draw</a> 로 그려야 합니다.

source: Starts the particle emitter.
ja: パーティクルエミッタを起動します。
ko: 파티클 이미 터를 시작합니다.

source: Starts the thread.
ja: スレッドを立ち上げます。
ko: 스레드를 시작합니다.

source: Static Sources will use significantly less memory and take much less time to be created if <strong>Source:clone</strong> is used to create them instead of <a href="love.audio.newsource">love.audio.newSource</a>, so this method should be preferred when making multiple Sources which play the same sound.
ja: スタティックソースは、<a href="love.audio.newsource">love.audio.newSourceの</a>代わりに<strong>Source：clone</strong>を使用して作成すると、メモリ使用量が大幅に少なくなり、作成にかかる時間が大幅に短縮されるため、同じサウンドを再生する複数のソースを作成する場合は、この方法をお勧めします。
ko: 정적 소스는 <a href="love.audio.newsource">love.audio.newSource</a> 대신 <strong>Source : clone</strong> 을 사용하여 생성하는 경우 메모리를 상당히 적게 사용하고 생성하는 데 훨씬 적은 시간 이 걸리므로 동일한 사운드를 재생하는 여러 소스를 만들 때이 방법을 사용하는 것이 좋습니다.

source: Static bodies always have a mass of 0.
ja: 静的な体は常に0の質量を持っています。
ko: 정적 바디의 질량은 항상 0입니다.

source: Static bodies do not move, have a infinite mass, and can be used for level boundaries.
ja: 静的なボディは動かず、無限の質量を持ち、レベル境界に使用することができます。
ko: 스태틱 바디는 움직이지 않으며, 질량이 무한하며, 레벨 경계에 사용될 수 있습니다.

source: Static bodies do not move.
ja: 静的な体は動かない。
ko: 정적 몸체는 움직이지 않습니다.

source: Stencil values are integers within the range of [0, 255].
ja: ステンシル値は[0,255]の範囲内の整数です。
ko: 스텐실 값은 [0, 255] 범위 내의 정수입니다.

source: Stop + Rewind
ja: 停止+巻き戻し
ko: 정지 + 되감기

source: Stops a Source.
ja: ソースを停止します。
ko: 소스를 중지합니다.

source: Stops a source.
ja: ソースを停止します。
ko: 소스를 중지합니다.

source: Stops currently played <a href="source">sources</a>.
ja: 現在再生中の<a href="source">ソースを</a>停止します。
ko: 현재 재생중인 <a href="source">소스를</a> 중지 합니다 .

source: Stops recording audio from this device.
ja: このデバイスからのオーディオ録音を停止します。
ko: 이 장치에서 오디오 녹음을 중지합니다.

source: Stops recording audio from this device. Any sound data currently in the device's buffer will be returned.
ja: このデバイスからのオーディオ録音を停止します。現在デバイスのバッファにあるすべてのサウンドデータが返却されます。
ko: 이 장치에서 오디오 녹음을 중지합니다. 현재 장치의 버퍼에있는 모든 사운드 데이터가 반환됩니다.

source: Stops the particle emitter, resetting the lifetime counter.
ja: パーティクル エミッターを停止し、ライフタイム カウンターをリセットします。
ko: 파티클 이미 터를 중지하고 수명 카운터를 재설정합니다.

source: Store image positions in a buffer, and draw it in one call.
ja: 画像の位置をバッファに格納し、1回の呼び出しで描画します。
ko: 이미지 위치를 버퍼에 저장하고 한 번의 호출로 그립니다.

source: Stores <a href="https://en.wikipedia.org/wiki/Half-precision_floating-point_format">half-precision</a> floating point RGB data. Suitable for HDR images on desktop systems.
ja: 店舗<a href="https://en.wikipedia.org/wiki/Half-precision_floating-point_format">半精度</a>ポイントRGBデータを浮動。デスクトップシステムのHDR画像に適しています。
ko: 상점은 <a href="https://en.wikipedia.org/wiki/Half-precision_floating-point_format">반 정밀도</a> 점 RGB 데이터를 부동. 데스크탑 시스템의 HDR 이미지에 적합합니다.

source: Stores just the red channel.
ja: 赤いチャンネルだけを保存します。
ko: 빨간색 채널 만 저장합니다.

source: Stores red and green channels.
ja: 赤と緑のチャンネルを格納します。
ko: 빨간색 및 녹색 채널을 저장합니다.

source: Stream the sound; decode it gradually.
ja: 音を流して、徐々にデコードしていきます。
ko: 소리를 스트리밍; 점차적으로 해독하십시오.

source: Streaming or static source.
ja: ストリーミングまたはスタティックソース。
ko: 스트리밍 또는 정적 소스.

source: Strength of the left vibration motor on the Joystick. Must be in the range of [0, 1].
ja: ジョイスティックの左振動モーターの強さを指定します。0,1]の範囲内でなければなりません。
ko: 조이스틱에서 왼쪽 진동 모터의 강도. [0, 1] 범위에 있어야합니다.

source: Strength of the right vibration motor on the Joystick. Must be in the range of [0, 1].
ja: ジョイスティックの右の振動モーターの強さ。0,1]の範囲内でなければなりません。
ko: 조이스틱에 적합한 진동 모터의 강도. [0, 1] 범위에 있어야합니다.

source: String containing font glyphs.
ja: フォントグリフを含む文字列。
ko: 글꼴 글리프가 포함 된 문자열입니다.

source: String represents arrays of characters. Lua is 8-bit clean: strings can contain any 8-bit character, including embedded zeros ('\0') (see <a href="http://www.lua.org/manual/5.1/manual.html#2.1">&sect;2.1</a>).
ja: 文字列は文字の配列を表します。Luaは8ビットのクリーンです。文字列には、埋め込まれたゼロ（ '\ 0'）を含むあらゆる8ビット文字を含めることができます（<a href="http://www.lua.org/manual/5.1/manual.html#2.1">&sect;2.1を</a>参照）。
ko: 문자열은 문자 배열을 나타냅니다. Lua는 8 비트입니다. 문자열에는 포함 된 0 ( '\ 0')을 포함하여 8 비트 문자를 포함 할 수 있습니다 ( <a href="http://www.lua.org/manual/5.1/manual.html#2.1">&sect;2.1</a> 참조 ).

source: String represents arrays of characters. Lua is 8-bit clean: strings can contain any 8-bit character, including embedded zeros ('\0') (see <a href="https://www.lua.org/manual/5.1/manual.html#2.1">&sect;2.1</a>).
ja: 文字列は文字の配列を表します。Luaは8ビットクリーンです。文字列には、埋め込みゼロ（ '\ 0'）を含む任意の8ビット文字を含めることができます（<a href="https://www.lua.org/manual/5.1/manual.html#2.1">&sect;2.1を</a>参照）。
ko: 문자열은 문자 배열을 나타냅니다. Lua는 8 비트 깨끗합니다. 문자열은 포함 된 0 ( '\ 0')을 포함하여 8 비트 문자를 포함 할 수 있습니다 ( <a href="https://www.lua.org/manual/5.1/manual.html#2.1">&sect;2.1</a> 참조 ).

source: String to hash.
ja: ハッシュする文字列。
ko: 해시 할 문자열입니다.

source: Subtractive blend mode.
ja: 減算ブレンドモード。
ko: 빼기 혼합 모드.

source: Suitable for fully opaque images on desktop systems.
ja: デスクトップシステムの完全不透明画像に適しています。
ko: 데스크탑 시스템에서 완전히 불투명 한 이미지에 적합합니다.

source: Suitable for fully opaque images on newer mobile devices
ja: 新しいモバイルデバイスでの完全不透明画像に適しています。
ko: 최신 모바일 장치에서 완전히 불투명 한 이미지에 적합

source: Suitable for fully opaque images on older Android devices.
ja: 古いAndroid端末での完全不透明画像に適しています。
ko: 구형 Android 기기에서 완전히 불투명 한 이미지에 적합합니다.

source: Super classe pour les objets pouvant &ecirc;tre dessin&eacute;s (drawable) qui repr&eacute;sente une texture.
ko: 수퍼 클래스 뿌르 레 오브제 푸방 &ecirc;tre dessin&eacute;s (드로어 블) qui repr&eacute;sente une 텍스처.

source: Superclass for all things that can be drawn on screen.
ja: 画面に描けるものならなんでもスーパークラス。
ko: 화면에 그릴 수있는 모든 것을위한 수퍼 클래스.

source: Superclass for all things that can be drawn on screen. This is an abstract type that can't be created directly.
ja: 画面上に描けるものすべてのスーパークラス。直接作成できない抽象型です。
ko: 화면에 그릴 수있는 모든 것을위한 수퍼 클래스. 이것은 직접 만들 수없는 추상 유형입니다.

source: Superclass for drawable objects which represent a texture.
ja: テクスチャを表現する描画可能なオブジェクトのためのスーパークラスです。
ko: 텍스처를 나타내는 드로어 블 객체의 수퍼 클래스입니다.

source: Superclass for drawable objects which represent a texture. All Textures can be drawn with <a href="quad">Quads</a>. This is an abstract type that can't be created directly.
ja: テクスチャを表す描画可能なオブジェクトのスーパークラス。すべてのテクスチャは<a href="quad">クワッド</a>で描画できます。これは直接作成できない抽象型です。
ko: 텍스처를 나타내는 드로어 블 객체의 수퍼 클래스입니다. 모든 텍스처는 <a href="quad">쿼드</a> 로 그릴 수 있습니다 . 이것은 직접 만들 수없는 추상 유형입니다.

source: Support for <a href="canvas">Canvas</a>.
ja: <a href="canvas">Canvasの</a>サポート。
ko: <a href="canvas">Canvas</a> 지원 .

source: Support for <a href="pixeleffect">PixelEffects</a>.
ja: <a href="pixeleffect">PixelEffectsの</a>サポート。
ko: <a href="pixeleffect">PixelEffects</a> 지원 .

source: Support for <a href="shader">Shaders</a>.
ja: <a href="shader">シェーダーの</a>サポート。
ko: <a href="shader">쉐이더</a> 지원 .
