Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/love/love.*.006.xlf
Languages: es, ja, ko, zh_cn

source: The system-dependent max value for the feature.
es: El valor máximo de la característica que depende del sistema.
zh_cn: 该功能的系统相关最大值。

source: The table filled with vertex information tables for each vertex as follows:
es: La tabla se llenó con tablas de información de vértices para cada vértice como sigue:
zh_cn: 充满顶点信息的表格,每个顶点的信息表如下。

source: The table filled with vertex information tables for each vertex, in the form of <code>{vertex, ...}</code> where each vertex is a table in the form of <code>{attributecomponent, ...}</code>.
es: La tabla se llen&oacute; con tablas de informaci&oacute;n de v&eacute;rtice para cada v&eacute;rtice, en forma de <code>{vertex, ...}</code> donde cada v&eacute;rtice es una tabla en forma de <code>{attributecomponent, ...}</code> .
zh_cn: 该表以 <code>{vertex, ...}</code> 的形式填充了每个顶点的顶点信息表，其中每个顶点都是 <code>{attributecomponent, ...}</code> 形式的表。

source: The table indices are in the same order as the vertex attributes in the Mesh's <a href="mesh-getvertexformat">vertex format</a>. A standard Mesh that wasn't <a href="love.graphics.newmesh">created</a> with a custom vertex format will use two position numbers, two texture coordinate numbers, and four color components per vertex: x, y, u, v, r, g, b, a.
es: Los &iacute;ndices de la tabla est&aacute;n en el mismo orden que los atributos de v&eacute;rtice en el <a href="mesh-getvertexformat">formato de v&eacute;rtice de</a> la malla . Una malla est&aacute;ndar que no se <a href="love.graphics.newmesh">cre&oacute;</a> con un formato de v&eacute;rtice personalizado usar&aacute; dos n&uacute;meros de posici&oacute;n, dos n&uacute;meros de coordenadas de textura y cuatro componentes de color por v&eacute;rtice: x, y, u, v, r, g, b, a.
zh_cn: 表索引的顺序与Mesh <a href="mesh-getvertexformat">顶点格式中</a>的顶点属性相同。未使用自定义顶点格式<a href="love.graphics.newmesh">创建的</a>标准网格将使用两个位置编号，两个纹理坐标编号以及每个顶点四个颜色分量：x，y，u，v，r，g，b，a。

source: The target angular offset in radians: the second body's angle minus the first body's angle.
es: El desplazamiento angular del objetivo en radianes:el ángulo del segundo cuerpo menos el ángulo del primer cuerpo.
zh_cn: 目标角偏移量,单位是弧度:第二体的角度减去第一体的角度。

source: The text currently held in the system's clipboard.
es: El texto que actualmente se encuentra en el portapapeles del sistema.
zh_cn: 系统剪贴板中当前保存的文字。

source: The text inside the message box.
es: El texto dentro del buzón de mensajes.
zh_cn: 信息框内的文字。

source: The text that will be wrapped.
es: El texto que será envuelto.
zh_cn: 将被包装的文字。

source: The text that would be wrapped.
es: El texto que sería envuelto.
zh_cn: 会被包裹的文字。

source: The text to add to the object.
es: El texto a añadir al objeto.
zh_cn: 要添加到对象的文字。

source: The text to draw.
es: El texto a dibujar.
zh_cn: 要画的文字。

source: The texture (<a href="image">Image</a> or <a href="canvas">Canvas</a>) to use.
es: La textura ( <a href="image">imagen</a> o <a href="canvas">lienzo</a> ) que se utilizar&aacute;.
zh_cn: 要使用的纹理（<a href="image">Image</a>或<a href="canvas">Canvas</a>）。

source: The texture coordinate of the vertex. The third and fourth components of the vector are normally (0, 1). <a href="mesh">Meshes</a> allow for custom texture coordinates.
es: La coordenada de textura del v&eacute;rtice. Los componentes tercero y cuarto del vector son normalmente (0, 1). <a href="mesh">Las mallas</a> permiten coordenadas de textura personalizadas.
zh_cn: 顶点的纹理坐标。向量的第三和第四分量通常为（0，1）。<a href="mesh">网格</a>允许自定义纹理坐标。

source: The texture of the image or canvas being drawn.
es: La textura de la imagen o el lienzo que se está dibujando.
zh_cn: 正在绘制的图像或画布的纹理。

source: The third parameter is the mass, in kilograms.
es: El tercer parámetro es la masa,en kilogramos.
zh_cn: 第三个参数是质量,单位是公斤。

source: The third value of the 3-dimensional vector used to generate the noise value.
es: El tercer valor del vector tridimensional utilizado para generar el valor del ruido.
zh_cn: 用于生成噪声值的三维向量的第三个值。

source: The third value of the 4-dimensional vector used to generate the noise value.
es: El tercer valor del vector cuatridimensional utilizado para generar el valor del ruido.
zh_cn: 用于生成噪声值的四维向量的第三个值。

source: The thousands-separator key on an American layout.
es: La llave de los miles de separadores en un diseño americano.
zh_cn: 美式布局上的千人分隔键。

source: The thread which produced the error.
es: El hilo que produjo el error.
zh_cn: 产生错误的线程。

source: The thread with that name.
es: El hilo con ese nombre.
zh_cn: 那个名字的线。

source: The three key
es: Las tres claves
zh_cn: 三个关键

source: The time (in seconds) to advance the physics simulation.
es: El tiempo (en segundos)para avanzar en la simulación de la física.
zh_cn: 推进物理模拟的时间(以秒为单位)。

source: The time (seconds) since last frame.
es: El tiempo (segundos)desde el último cuadro.
zh_cn: 距离上一帧的时间(秒)。

source: The time in seconds since the beginning of the Video.
es: El tiempo en segundos desde el comienzo del video.
zh_cn: 视频开始后的时间,以秒为单位。

source: The time in seconds.
es: El tiempo en segundos.
zh_cn: 时间以秒为单位。

source: The time of impact, or nil if no impact.
es: El tiempo de impacto,o nulo si no hay impacto.
zh_cn: 撞击的时间,如果没有撞击,则为零;

source: The time passed (in seconds).
es: El tiempo pasó (en segundos).
zh_cn: 经过的时间(秒)。

source: The time passed in seconds.
es: El tiempo pasó en segundos.
zh_cn: 时间以秒为单位过去。

source: The time unit for the return value.
es: La unidad de tiempo para el valor de retorno.
zh_cn: 返回值的时间单位。

source: The title of the message box.
es: El título del buzón de mensajes.
zh_cn: 消息框的标题。

source: The top-left corner along the x-axis.
es: La esquina superior izquierda a lo largo del eje X.
zh_cn: 沿X轴的左上角。

source: The top-left position in the <a href="image">Image</a> along the x-axis.
es: La posici&oacute;n superior izquierda en la <a href="image">imagen a lo</a> largo del eje x.
zh_cn: <a href="image">图像</a>在x轴上的左上角位置。

source: The top-left position in the <a href="image">Image</a> along the y-axis.
es: La posici&oacute;n superior izquierda en la <a href="image">imagen a lo</a> largo del eje y.
zh_cn: <a href="image">图像</a>中y轴的左上角位置。

source: The top-right corner along the y-axis.
es: La esquina superior derecha a lo largo del eje Y.
zh_cn: 沿y轴的右上角。

source: The torque on the motor in newton meters.
es: El par del motor en metros de newton.
zh_cn: 电机的扭矩,单位为牛顿米。

source: The torque to apply.
es: El par de torsión a aplicar.
zh_cn: 要施加的扭矩。

source: The total number of bytes received.
es: El número total de bytes recibidos.
zh_cn: 收到的总字节数。

source: The total number of bytes sent.
es: El número total de bytes enviados.
zh_cn: 发送的总字节数。

source: The total number of vertices in the mesh.
es: El número total de vértices en la malla.
zh_cn: 网格中顶点的总数。

source: The total number of vertices the Mesh will use.
es: El número total de vértices que la Malla usará.
zh_cn: 网格将使用的顶点总数。

source: The total number of vertices the Mesh will use. Each vertex is initialized to <code>{0,0, 0,0, 255,255,255,255}</code>.
es: El n&uacute;mero total de v&eacute;rtices que usar&aacute; la malla. Cada v&eacute;rtice se inicializa en <code>{0,0, 0,0, 255,255,255,255}</code> .
zh_cn: 网格将使用的顶点总数。每个顶点都初始化为 <code>{0,0, 0,0, 255,255,255,255}</code> 。

source: The transformation matrix affected by <a href="love.graphics.translate">love.graphics.translate</a> and friends combined with the orthographic projection matrix.
es: La matriz de transformaci&oacute;n afectada por <a href="love.graphics.translate">love.graphics.translate</a> y friends combinada con la matriz de proyecci&oacute;n ortogr&aacute;fica.
zh_cn: 受<a href="love.graphics.translate">love.graphics.translate</a>和friends 影响的变换矩阵与正交投影矩阵结合在一起。

source: The transformation matrix affected by <a href="love.graphics.translate">love.graphics.translate</a> and friends.
es: La matriz de transformaci&oacute;n afectada por <a href="love.graphics.translate">love.graphics.translate</a> y friends.
zh_cn: 转换矩阵受<a href="love.graphics.translate">love.graphics.translate</a>和好友的影响。

source: The transformation stack (<a href="love.graphics.translate">love.graphics.translate</a>, <a href="love.graphics.rotate">love.graphics.rotate</a>, etc.)
es: La pila de transformaci&oacute;n ( <a href="love.graphics.translate">love.graphics.translate</a> , <a href="love.graphics.rotate">love.graphics.rotate</a> , etc.)
zh_cn: 转换堆栈（<a href="love.graphics.translate">love.graphics.translate</a>，<a href="love.graphics.rotate">love.graphics.rotate</a>等）

source: The transformed x position of the first point.
es: La posición x transformada del primer punto.
zh_cn: 第一个点的变换X位置。

source: The transformed x position of the second point.
es: La posición x transformada del segundo punto.
zh_cn: 第二点的变换X位置。

source: The transformed y position of the first point.
es: La posición y transformada del primer punto.
zh_cn: 第一个点的变换后的y位置。

source: The transformed y position of the second point.
es: La posición y transformada del segundo punto.
zh_cn: 第二点的变换后的y位置。

source: The translation of the joint in meters.
es: La traducción de la articulación en metros.
zh_cn: 连接处的翻译,单位为米。

source: The translation of the shape on the x-axis.
es: La traducción de la forma en el eje X.
zh_cn: 形状在X轴上的平移。

source: The translation of the shape on the y-axis.
es: La traducción de la forma en el eje Y.
zh_cn: 形状在Y轴上的平移。

source: The translation relative to the x-axis.
es: La traducción relativa al eje X.
zh_cn: 相对于X轴的平移。

source: The translation relative to the y-axis.
es: La traducción relativa al eje Y.
zh_cn: 相对于y轴的平移。

source: The translation speed of the joint in meters per second.
es: La velocidad de traducción de la articulación en metros por segundo.
zh_cn: 接头的转换速度,单位为米/秒。

source: The two key
es: Las dos claves
zh_cn: 两个关键

source: The two-channel variant of the EAC format. Stores red and green channels at 8 bits per pixel.
es: La variante de dos canales del formato EAC.Almacena los canales rojo y verde a 8 bits por píxel.
zh_cn: EAC格式的双通道变体。以每像素8位存储红绿通道。

source: The type as a string.
es: El tipo como una cuerda.
zh_cn: 类型为字符串。

source: The type of arc to draw.
es: El tipo de arco a dibujar.
zh_cn: 要画的弧线类型。

source: The type of comparison that is made for each pixel. Will be "always" if stencil testing is disabled.
es: El tipo de comparación que se hace para cada píxel.Será "siempre" si se desactiva la prueba de la plantilla.
zh_cn: 对每个像素进行比较的类型。如果禁用钢网测试,则为 "总是"。

source: The type of comparison to make for each pixel.
es: El tipo de comparación a hacer para cada píxel.
zh_cn: 对每个像素进行比较的类型。

source: The type of distribution for new particles.
es: El tipo de distribución de las nuevas partículas.
zh_cn: 新粒子的分布类型。

source: The type of event.
es: El tipo de evento.
zh_cn: 事件的类型;

source: The type of fullscreen mode to use.
es: El tipo de modo de pantalla completa a utilizar.
zh_cn: 使用全屏模式的类型。

source: The type of fullscreen mode used.
es: El tipo de modo de pantalla completa utilizado.
zh_cn: 使用的全屏模式的类型。

source: The type of fullscreen to use. This defaults to "normal" in <a href="https://love2d.org/wiki/0.9.2">0.9.2</a> and older.
es: El tipo de pantalla completa que se utilizar&aacute;. Este valor predeterminado es "normal" en <a href="https://love2d.org/wiki/0.9.2">0.9.2</a> y versiones anteriores.
zh_cn: 要使用的全屏类型。在<a href="https://love2d.org/wiki/0.9.2">0.9.2</a>和更早版本中，默认为&ldquo;正常&rdquo; 。

source: The type of input the virtual gamepad axis is bound to.
es: El tipo de entrada a la que está vinculado el eje del panel de juego virtual.
zh_cn: 虚拟游戏手柄轴所绑定的输入类型。

source: The type of input the virtual gamepad button is bound to.
es: El tipo de entrada a la que está vinculado el botón del panel de juego virtual.
zh_cn: 虚拟游戏手柄按钮所绑定的输入类型。

source: The type of input to bind the virtual gamepad axis to.
es: El tipo de entrada para enlazar el eje del panel de juego virtual.
zh_cn: 绑定虚拟游戏手柄轴的输入类型。

source: The type of input to bind the virtual gamepad button to.
es: El tipo de entrada a la que se ata el botón del panel de juego virtual.
zh_cn: 绑定虚拟游戏手柄按钮的输入类型。

source: The type of stack to push (e.g. just transformation state, or all love.graphics state).
es: El tipo de pila a empujar (por ejemplo,sólo el estado de transformación,o todo el estado de love.graphics).
zh_cn: 要推送的堆栈类型(比如只是变换状态,或者所有的爱.图形状态)。

source: The type of system cursor to get.
es: El tipo de cursor del sistema a conseguir.
zh_cn: 要获取的系统光标类型。

source: The type of the Cursor.
es: El tipo de Cursor.
zh_cn: 游标的类型。

source: The type of the Shape.
es: El tipo de la forma.
zh_cn: 形状的类型。

source: The type of the body.
es: El tipo de cuerpo.
zh_cn: 体的类型。

source: The type of the message box.
es: El tipo de buzón de mensajes.
zh_cn: 信息框的类型。

source: The type of the source.
es: El tipo de la fuente.
zh_cn: 来源的类型;

source: The type of unit for the return value.
es: El tipo de unidad para el valor de retorno.
zh_cn: 返回值的单位类型。

source: The type table implements associative arrays, that is, arrays that can be indexed not only with <a href="number">numbers</a>, but with any value (except <a href="nil">nil</a>). Tables can be heterogeneous; that is, they can contain values of all types (except <a href="nil">nil</a>). Tables are the sole data structuring mechanism in Lua; they can be used to represent ordinary arrays, symbol tables, sets, records, graphs, trees, etc. To represent records, Lua uses the field name as an index. The language supports this representation by providing a.name as syntactic sugar for a["name"]. There are several convenient ways to create tables in Lua (see <a href="http://www.lua.org/manual/5.1/manual.html#2.5.7">&sect;2.5.7</a>).
es: La tabla de tipos implementa matrices asociativas, es decir, matrices que pueden indexarse ​​no solo con <a href="number">n&uacute;meros</a> , sino con cualquier valor (excepto <a href="nil">nil</a> ). Las tablas pueden ser heterog&eacute;neas; es decir, pueden contener valores de todos los tipos (excepto <a href="nil">nil</a> ). Las tablas son el &uacute;nico mecanismo de estructuraci&oacute;n de datos en Lua; se pueden usar para representar matrices ordinarias, tablas de s&iacute;mbolos, conjuntos, registros, gr&aacute;ficos, &aacute;rboles, etc. Para representar registros, Lua usa el nombre del campo como &iacute;ndice. El lenguaje apoya esta representaci&oacute;n proporcionando a.name como az&uacute;car sint&aacute;ctico para un ["nombre"]. Hay varias formas convenientes de crear tablas en Lua (consulte <a href="http://www.lua.org/manual/5.1/manual.html#2.5.7">&sect;2.5.7</a> ).
zh_cn: 类型表实现关联数组，即，不仅可以用<a href="number">数字</a>索引，而且可以用任何值（<a href="nil">nil</a>除外）建立索引的数组。表可以是异构的；也就是说，它们可以包含所有类型的值（<a href="nil">nil</a>除外）。表是Lua中唯一的数据结构机制。它们可以用于表示普通数组，符号表，集合，记录，图形，树等。为了表示记录，Lua使用字段名称作为索引。该语言通过提供a.name作为a [&ldquo; name&rdquo;]的语法糖来支持这种表示。有几种在Lua中创建表的便捷方法（请参见<a href="http://www.lua.org/manual/5.1/manual.html#2.5.7">&sect;2.5.7</a>）。

source: The types of a <a href="body">Body</a>.
es: Los tipos de <a href="body">cuerpo</a> .
zh_cn: <a href="body">身体</a>的类型。

source: The types of a <strong>Body</strong>.
es: Los tipos de <strong>cuerpo</strong> .
zh_cn: <strong>身体</strong>的类型。

source: The u texture coordinate of the vertex. Texture coordinates are normally in the range of [0, 1], but can be greater or less (see <a href="wrapmode">WrapMode</a>.)
es: La coordenada de textura u del v&eacute;rtice. Las coordenadas de textura est&aacute;n normalmente en el rango de [0, 1], pero pueden ser mayores o menores (ver <a href="wrapmode">WrapMode</a> ).
zh_cn: 顶点的u纹理坐标。纹理坐标通常在[0，1]范围内，但可以更大或更小（请参见<a href="wrapmode">WrapMode）</a>。

source: The u texture coordinate. Texture coordinates are normally in the range of [0, 1], but can be greater or less (see <a href="wrapmode">WrapMode</a>.)
es: La coordenada de textura u. Las coordenadas de textura est&aacute;n normalmente en el rango de [0, 1], pero pueden ser mayores o menores (ver <a href="wrapmode">WrapMode</a> ).
zh_cn: u纹理坐标。纹理坐标通常在[0，1]范围内，但可以更大或更小（请参见<a href="wrapmode">WrapMode）</a>。

source: The unicode number of the key pressed.
es: El número de unicode de la tecla pulsada.
zh_cn: 按下的键的unicode号码。

source: The unit of the position value.
es: La unidad del valor de la posición.
zh_cn: 位置值的单位。

source: The units of <a href="love.graphics.getwidth">love.graphics.getWidth</a>, <a href="love.graphics.getheight">love.graphics.getHeight</a>, <a href="love.mouse.getposition">love.mouse.getPosition</a>, mouse events, <a href="love.touch.getposition">love.touch.getPosition</a>, and touch events are always in terms of pixels.
es: Las unidades de <a href="love.graphics.getwidth">love.graphics.getWidth</a> , <a href="love.graphics.getheight">love.graphics.getHeight</a> , <a href="love.mouse.getposition">love.mouse.getPosition</a> , eventos del mouse, <a href="love.touch.getposition">love.touch.getPosition</a> y eventos t&aacute;ctiles son siempre en t&eacute;rminos de p&iacute;xeles.
zh_cn: 的单位<a href="love.graphics.getwidth">love.graphics.getWidth</a>，<a href="love.graphics.getheight">love.graphics.getHeight</a>，<a href="love.mouse.getposition">love.mouse.getPosition</a>，鼠标事件，<a href="love.touch.getposition">love.touch.getPosition</a>和触摸事件总是在像素方面。

source: The unofficial Android and iOS ports of L&Ouml;VE 0.9.2 reported touch positions as normalized values in the range of [0, 1], whereas this API reports positions in pixels.
es: Los puertos no oficiales de Android e iOS de L&Ouml;VE 0.9.2 informaron posiciones t&aacute;ctiles como valores normalizados en el rango de [0, 1], mientras que esta API informa posiciones en p&iacute;xeles.
zh_cn: L&Ouml;VE0.9.2的非官方Android和iOS端口将触摸位置报告为[0，1]范围内的归一化值，而此API报告的位置是以像素为单位。

source: The unofficial Android and iOS ports of L&Ouml;VE 0.9.2 reported touch-press positions as normalized values in the range of [0, 1], whereas this API reports positions in pixels.
es: Los puertos no oficiales de Android e iOS de L&Ouml;VE 0.9.2 informaron posiciones de pulsaci&oacute;n t&aacute;ctil como valores normalizados en el rango de [0, 1], mientras que esta API informa posiciones en p&iacute;xeles.
zh_cn: L&Ouml;VE0.9.2的非官方Android和iOS端口将触摸按键位置报告为[0，1]范围内的归一化值，而此API报告的像素位置为像素。

source: The unopened File object representing the file that was dropped.
es: El objeto Archivo sin abrir que representa el archivo que fue abandonado.
zh_cn: 未打开的文件对象,代表被删除的文件。

source: The up-arrow key on an American layout.
es: La tecla de flecha arriba en un diseño americano.
zh_cn: 美式布局上的上箭头键。

source: The upper limit, in radians.
es: El límite superior,en radianes.
zh_cn: 上限,以弧度为单位。

source: The upper limit, usually in meters.
es: El límite superior,normalmente en metros.
zh_cn: 上限,通常以米为单位。

source: The utf8.char function does not work correctly in <a href="https://love2d.org/wiki/0.9.2">0.9.2</a>; However, it is not an issue since <a href="https://love2d.org/wiki/0.10.0">0.10.0</a>
es: La funci&oacute;n utf8.char no funciona correctamente en <a href="https://love2d.org/wiki/0.9.2">0.9.2</a> ; Sin embargo, no es un problema desde <a href="https://love2d.org/wiki/0.10.0">0.10.0</a>
zh_cn: utf8.char函数在<a href="https://love2d.org/wiki/0.9.2">0.9.2</a>中无法正常工作；但是，从<a href="https://love2d.org/wiki/0.10.0">0.10.0开始</a>这不是问题

source: The v texture coordinate of the vertex. Texture coordinates are normally in the range of [0, 1], but can be greater or less (see <a href="wrapmode">WrapMode</a>.)
es: La coordenada de textura v del v&eacute;rtice. Las coordenadas de textura est&aacute;n normalmente en el rango de [0, 1], pero pueden ser mayores o menores (ver <a href="wrapmode">WrapMode</a> ).
zh_cn: 顶点的v纹理坐标。纹理坐标通常在[0，1]范围内，但可以更大或更小（请参见<a href="wrapmode">WrapMode）</a>。

source: The v texture coordinate. Texture coordinates are normally in the range of [0, 1], but can be greater or less (see <a href="wrapmode">WrapMode</a>.)
es: La coordenada de textura v. Las coordenadas de textura est&aacute;n normalmente en el rango de [0, 1], pero pueden ser mayores o menores (ver <a href="wrapmode">WrapMode</a> ).
zh_cn: v纹理坐标。纹理坐标通常在[0，1]范围内，但可以更大或更小（请参见<a href="wrapmode">WrapMode）</a>。

source: The value for the <b>multicanvas</b> system limit will generally be either 1, 4, or 8.
es: El valor para el l&iacute;mite del sistema <b>multicanas</b> generalmente ser&aacute; 1, 4 u 8.
zh_cn: 多<b>画布</b>系统限制的值通常为1、4或8。

source: The value of a color channel in linear RGB space to convert.
es: El valor de un canal de color en el espacio lineal RGB a convertir.
zh_cn: 线性RGB空间中要转换的颜色通道的值。

source: The value of a color channel in sRGB space to convert.
es: El valor de un canal de color en el espacio sRGB a convertir.
zh_cn: sRGB空间中要转换的颜色通道的值。

source: The value of the angular damping.
es: El valor de la amortiguación angular.
zh_cn: 角阻尼的值。

source: The value of the color channel in gamma sRGB space.
es: El valor del canal de color en el espacio gamma sRGB.
zh_cn: 伽玛sRGB空间中颜色通道的值。

source: The value of the color channel in linear RGB space.
es: El valor del canal de color en el espacio lineal RGB.
zh_cn: 线性RGB空间的颜色通道的值。

source: The value of the first component of the attribute.
es: El valor del primer componente del atributo.
zh_cn: 属性的第一个分量的值。

source: The value of the linear damping.
es: El valor de la amortiguación lineal.
zh_cn: 线性阻尼的值。

source: The value of the message can be a boolean, string, number or a L&Ouml;VE userdata. It returns nil if there's no message in the queue.
es: El valor del mensaje puede ser un booleano, una cadena, un n&uacute;mero o datos de usuario L&Ouml;VE. Devuelve nil si no hay ning&uacute;n mensaje en la cola.
zh_cn: 消息的值可以是布尔值，字符串，数字或L&Ouml;VE用户数据。如果队列中没有消息，则返回nil。

source: The value of the message can be a boolean, string, number, L&Ouml;VE userdata, or a simple <a href="flat_table">flat table</a>. Foreign userdata (Lua's files, LuaSocket, ENet, ...), functions, and tables inside tables are not supported.
es: El valor del mensaje puede ser un booleano, una cadena, un n&uacute;mero, datos de usuario L&Ouml;VE o una simple <a href="flat_table">tabla plana</a> . No se admiten datos de usuario externos (archivos de Lua, LuaSocket, ENet, ...), funciones y tablas dentro de tablas.
zh_cn: 消息的值可以是布尔值，字符串，数字，LOVE用户数据或简单的<a href="flat_table">平面表</a>。不支持外部用户数据（Lua的文件，LuaSocket，ENet等），函数和表中的表。

source: The value of the message can be a boolean, string, number, L&Ouml;VE userdata, or a simple flat table. Foreign userdata (Lua's files, LuaSocket, ENet, ...), functions, and tables inside tables are not supported.
es: El valor del mensaje puede ser un booleano, una cadena, un n&uacute;mero, datos de usuario L&Ouml;VE o una tabla plana simple. No se admiten datos de usuario externos (archivos de Lua, LuaSocket, ENet, ...), funciones y tablas dentro de tablas.
zh_cn: 消息的值可以是布尔值，字符串，数字，L&Ouml;VE用户数据或简单的平面表。不支持外部用户数据（Lua的文件，LuaSocket，ENet等），函数和表中的表。

source: The value of the message can be a boolean, string, number, L&Ouml;VE userdata, or a simple flat table. It returns nil if there are no messages in the queue.
es: El valor del mensaje puede ser un booleano, una cadena, un n&uacute;mero, datos de usuario L&Ouml;VE o una simple tabla plana. Devuelve nil si no hay mensajes en la cola.
zh_cn: 消息的值可以是布尔值，字符串，数字，L&Ouml;VE用户数据或简单的平面表。如果队列中没有消息，则返回nil。

source: The value of the message can be a boolean, string, number, L&Ouml;VE userdata, or a simple flat table. It waits until a message is in the queue then returns the message value.
es: El valor del mensaje puede ser un booleano, una cadena, un n&uacute;mero, datos de usuario L&Ouml;VE o una simple tabla plana. Espera hasta que haya un mensaje en la cola y luego devuelve el valor del mensaje.
zh_cn: 消息的值可以是布尔值，字符串，数字，L&Ouml;VE用户数据或简单的平面表。它等待直到消息在队列中，然后返回消息值。

source: The value of the second component of the attribute.
es: El valor del segundo componente del atributo.
zh_cn: 属性的第二个分量的值。

source: The value of the state string does not depend on the current operating system.
es: El valor de la cadena de estado no depende del sistema operativo actual.
zh_cn: 状态字符串的值不取决于当前的操作系统。
