Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/love/love.*.006.xlf
Languages: es, ja, ko, zh_cn

source: The number of buttons available
es: El número de botones disponibles
zh_cn: 可用的按钮数量

source: The number of buttons available.
es: El número de botones disponibles.
zh_cn: 可用的按钮数量。

source: The number of bytes to read
es: El número de bytes a leer
zh_cn: 读取的字节数

source: The number of channels to allocate. It should be the same as the channel count on the server. Defaults to 1.
es: El número de canales a asignar.Debe ser el mismo que el número de canales en el servidor.Por defecto es 1.
zh_cn: 要分配的通道数。它应该与服务器上的通道数相同。默认值为1。

source: The number of children.
es: El número de niños.
zh_cn: 孩子的数量;

source: The number of components in the variable (e.g. 2 for a vec2 or mat2.)
es: El número de componentes de la variable (por ejemplo,2 para un vec2 o mat2.)
zh_cn: 变量中的分量数(如2为vec2或mat2。

source: The number of connected joysticks.
es: El número de joysticks conectados.
zh_cn: 连接操纵杆的数量。

source: The number of contacts in the world.
es: El número de contactos en el mundo.
zh_cn: 世界上的联系人数量。

source: The number of control points.
es: El número de puntos de control.
zh_cn: 控制点的数量。

source: The number of currently connected displays.
es: El número de pantallas actualmente conectadas.
zh_cn: 当前连接的显示器的数量。

source: The number of draw calls made so far during the current frame.
es: El número de llamadas de sorteo realizadas hasta ahora durante el marco actual.
zh_cn: 在当前帧中,到目前为止的抽签次数。

source: The number of elements in the array if the variable is an array, or 1 if not.
es: El número de elementos en la matriz si la variable es una matriz,o 1 si no.
zh_cn: 如果变量是一个数组,则数组中的元素数,如果不是,则为1。

source: The number of joints in the world.
es: El número de articulaciones en el mundo.
zh_cn: 世界上的关节数。

source: The number of joysticks available
es: El número de joysticks disponibles
zh_cn: 可用的操纵杆数量

source: The number of lines that the wrapped text will have.
es: El número de líneas que tendrá el texto envuelto.
zh_cn: 包裹文字的行数。

source: The number of messages in the queue.
es: El número de mensajes en la cola.
zh_cn: 队列中的信息数量。

source: The number of mipmap levels stored in the CompressedImageData.
es: El número de niveles de mipmap almacenados en los Datos de Imagen Comprimida.
zh_cn: 存储在CompressedImageData中的mipmap级别的数量。

source: The number of multisample antialiasing samples used by the canvas when drawing to it.
es: El número de muestras de antialiasing de múltiples muestras utilizadas por el lienzo al dibujar en él.
zh_cn: 画布绘制时使用的多样本抗锯齿样本的数量。

source: The number of samples to use with multi-sampled antialiasing.
es: El número de muestras a utilizar con el antialiasing de muestras múltiples.
zh_cn: 使用多采样抗锯齿的采样数量。

source: The number of segments used for drawing the arc.
es: El número de segmentos utilizados para dibujar el arco.
zh_cn: 用于绘制弧线的段数。

source: The number of segments used for drawing the circle. Note: The default variable for the segments parameter varies between different versions of L&Ouml;VE.
es: El n&uacute;mero de segmentos usados ​​para dibujar el c&iacute;rculo. Nota: La variable predeterminada para el par&aacute;metro de segmentos var&iacute;a entre las diferentes versiones de L&Ouml;VE.
zh_cn: 用于绘制圆的线段数。注意：segments参数的默认变量在L&Ouml;VE的不同版本之间有所不同。

source: The number of segments used for drawing the ellipse.
es: El número de segmentos utilizados para dibujar la elipse.
zh_cn: 用于绘制椭圆的段数。

source: The number of segments used for drawing the round corners. A default amount will be chosen if no number is given.
es: El número de segmentos utilizados para dibujar las esquinas redondas.Se elegirá una cantidad por defecto si no se da ningún número.
zh_cn: 用于绘制圆角的段数。如果没有给出数字,将选择默认的数量。

source: The number of sprites currently in the batch.
es: El número de sprites que hay actualmente en el lote.
zh_cn: 当前该批精灵的数量。

source: The number of times the active <a href="canvas">Canvas</a> has been switched so far during the current frame.
es: El n&uacute;mero de veces que se ha cambiado el <a href="canvas">Canvas</a> activo hasta ahora durante el fotograma actual.
zh_cn: 到目前为止，在当前帧中活动<a href="canvas">画布</a>已切换的次数。

source: The number of times the active <a href="shader">Shader</a> has been changed so far during the current frame.
es: La cantidad de veces que se ha cambiado el <a href="shader">Shader</a> activo hasta ahora durante el marco actual.
zh_cn: 到目前为止，在当前帧中活动<a href="shader">着色器</a>已更改的次数。

source: The number of vertices in the control polygon determines the degree of the curve, e.g. three vertices define a quadratic (degree 2) B&eacute;zier curve, four vertices define a cubic (degree 3) B&eacute;zier curve, etc.
es: El n&uacute;mero de v&eacute;rtices en el pol&iacute;gono de control determina el grado de la curva, por ejemplo, tres v&eacute;rtices definen una curva B&eacute;zier cuadr&aacute;tica (grado 2), cuatro v&eacute;rtices definen una curva B&eacute;zier c&uacute;bica (grado 3), etc.
zh_cn: 控制多边形中的顶点数量决定了曲线的程度，例如，三个顶点定义了二次（度2）贝塞尔曲线，四个顶点定义了三次（度3）贝塞尔曲线，等等。

source: The number of vertices.
es: El número de vértices.
zh_cn: 顶点的数量。

source: The number used to generate the noise value.
es: El número usado para generar el valor del ruido.
zh_cn: 用于产生噪声值的数字。

source: The numlock / clear key on an American layout.
es: La tecla numlock/clear en un diseño americano.
zh_cn: 美式布局的numlock/clear键。

source: The numpad addition key
es: La tecla de adición del teclado numérico
zh_cn: 小数点加法键

source: The numpad comma key
es: La tecla de coma del teclado numérico
zh_cn: 号角逗号键

source: The numpad decimal point key
es: La tecla de punto decimal del teclado numérico
zh_cn: numpad小数点键

source: The numpad division key
es: La tecla de división del teclado numérico
zh_cn: 小数点除法键

source: The numpad eight key
es: La tecla ocho del teclado numérico
zh_cn: 八号数字键

source: The numpad enter key
es: La tecla de entrada del teclado numérico
zh_cn: 手写板回车键

source: The numpad equals key
es: El teclado numérico es igual a la tecla
zh_cn: 小数点等于键

source: The numpad five key
es: La tecla numeral cinco
zh_cn: 五号键

source: The numpad four key
es: La tecla cuatro del teclado numérico
zh_cn: 數字鍵盤四鍵

source: The numpad multiplication key
es: La tecla de multiplicación del teclado numérico
zh_cn: 小数点乘法键

source: The numpad nine key
es: La tecla numeral nueve
zh_cn: 九号拨号键

source: The numpad one key
es: La tecla numeral uno
zh_cn: 數字鍵盤一鍵

source: The numpad seven key
es: La tecla numeral siete
zh_cn: 七号拨号键

source: The numpad six key
es: La tecla numeral seis
zh_cn: 6个数字键

source: The numpad substraction key
es: La tecla de sustracción del teclado numérico
zh_cn: 小数点减法键

source: The numpad three key
es: La tecla numeral tres
zh_cn: 数字键盘三键

source: The numpad two key
es: La tecla numeral dos
zh_cn: 數字鍵盤的兩個鍵

source: The numpad zero key
es: La tecla cero del teclado numérico
zh_cn: 零号键

source: The object data will always change between draws.
es: Los datos del objeto siempre cambiarán entre sorteos.
zh_cn: 对象数据在绘制之间总是会发生变化。

source: The object will not be modified after initial sprites or vertices are added.
es: El objeto no se modificará después de que se añadan los sprites o vértices iniciales.
zh_cn: 在添加初始精灵或顶点后,对象将不会被修改。

source: The object's data will change repeatedly during its lifetime.
es: Los datos del objeto cambiarán repetidamente durante su vida.
zh_cn: 对象的数据在其生命周期内会反复变化。

source: The offset along the x-axis.
es: El desplazamiento a lo largo del eje X.
zh_cn: 沿X轴的偏移量。

source: The offset along the y-axis.
es: El desplazamiento a lo largo del eje Y.
zh_cn: 沿Y轴的偏移量。

source: The one key
es: La única llave
zh_cn: 一个关键

source: The orientation of the new text in radians.
es: La orientación del nuevo texto en radianes.
zh_cn: 新文本的方向,以弧度为单位;

source: The orientation of the text in radians.
es: La orientación del texto en radianes.
zh_cn: 文本的方向,单位是弧度。

source: The original CompressedData used to create the Image, if the image is compressed.
es: Los datos comprimidos originales usados para crear la imagen,si la imagen está comprimida.
zh_cn: 如果图像被压缩,则用于创建图像的原始CompressedData。

source: The original ImageData used to create the Image, if the image is not compressed.
es: Los datos de la imagen original usados para crear la imagen,si la imagen no está comprimida.
zh_cn: 如果图像没有被压缩,则用于创建图像的原始ImageData。

source: The orthographic projection matrix.
es: La matriz de proyección ortográfica.
zh_cn: 正交投影矩阵。

source: The outer angle from the Source's direction, in radians. The Source will play at a volume between the normal and outer volumes, if the listener is in between the cones defined by the inner and outer angles.
es: El ángulo exterior de la dirección de la Fuente,en radianes.La Fuente se reproducirá a un volumen entre los volúmenes normal y exterior,si el oyente se encuentra entre los conos definidos por los ángulos interior y exterior.
zh_cn: 与音源方向的外角,以弧度为单位。如果听众位于由内角和外角定义的锥体之间,音源将以介于正常音量和外音量之间的音量播放。

source: The page-down key on an American layout.
es: La tecla de página abajo en un diseño americano.
zh_cn: 美式布局的翻页键。

source: The page-up key on an American layout.
es: La tecla de paginación en un diseño americano.
zh_cn: 美式布局的翻页键。

source: The parent body.
es: El cuerpo de los padres.
zh_cn: 母体。

source: The particle system has to be created using <a href="love.graphics.newparticlesystem">love.graphics.newParticleSystem</a>. Just like any other <a href="drawable">Drawable</a> it can be drawn to the screen using <a href="love.graphics.draw">love.graphics.draw</a>. You also have to <a href="particlesystem-update">update</a> it in the <a href="love.update">update callback</a> to see any changes in the particles emitted.
es: El sistema de part&iacute;culas debe crearse utilizando <a href="love.graphics.newparticlesystem">love.graphics.newParticleSystem</a> . Al igual que cualquier otro <a href="drawable">Drawable,</a> se puede dibujar en la pantalla usando <a href="love.graphics.draw">love.graphics.draw</a> . Tambi&eacute;n debe <a href="particlesystem-update">actualizarlo</a> en la <a href="love.update">devoluci&oacute;n</a> de llamada de actualizaci&oacute;n para ver cualquier cambio en las part&iacute;culas emitidas.
zh_cn: 必须使用<a href="love.graphics.newparticlesystem">love.graphics.newParticleSystem</a>创建粒子系统。与其他任何<a href="drawable">Drawable一样</a>，可以使用<a href="love.graphics.draw">love.graphics.draw</a>将其绘制到屏幕上。您也可以<a href="particlesystem-update">更新</a>它的<a href="love.update">更新回调</a>看到发出的粒子的任何变化。

source: The particle system won't create any particles unless you call <a href="particlesystem-setparticlelifetime">setParticleLifetime</a> and <a href="particlesystem-setemissionrate">setEmissionRate</a>.
es: El sistema de part&iacute;culas no crear&aacute; part&iacute;culas a menos que llame a <a href="particlesystem-setparticlelifetime">setParticleLifetime</a> y <a href="particlesystem-setemissionrate">setEmissionRate</a> .
zh_cn: 除非您调用<a href="particlesystem-setparticlelifetime">setParticleLifetime</a>和<a href="particlesystem-setemissionrate">setEmissionRate，</a>否则粒子系统不会创建任何粒子。

source: The passed function draws to the stencil instead of the screen, creating an image with transparent and opaque pixels. While active, it is used to test where pixels will be drawn or discarded. Image contents do not directly affect the stencil, but see below for a workaround.
es: La función de paso dibuja en la plantilla en lugar de la pantalla,creando una imagen con píxeles transparentes y opacos.Mientras está activa,se usa para probar dónde se dibujarán o descartarán los píxeles.El contenido de la imagen no afecta directamente a la plantilla,pero véase a continuación para una solución alternativa.
zh_cn: 传递的函数绘制到钢网而不是屏幕上,创建一个透明和不透明像素的图像。当激活时,它用于测试像素被绘制或丢弃的位置。图像内容不会直接影响到钢网,但请看下面的变通方法。

source: The passed function is called with six parameters for each pixel in turn. The parameters are numbers that represent the x and y coordinates of the pixel and its red, green, blue and alpha values. The function should return the new red, green, blue, and alpha values for that pixel.
es: La función de paso se llama con seis parámetros para cada píxel en turno.Los parámetros son números que representan las coordenadas x e y del píxel y sus valores rojo,verde,azul y alfa.La función debe devolver los nuevos valores rojo,verde,azul y alfa de ese píxel.
zh_cn: 传递的函数依次为每个像素调用六个参数。参数是代表像素的x、y坐标及其红、绿、蓝和alpha值的数字。该函数应返回该像素的新的红、绿、蓝和alpha值。

source: The path and name of the file with the font.
es: La ruta y el nombre del archivo con la fuente.
zh_cn: 带有字体的文件的路径和名称。

source: The path and name to a file.
es: La ruta y el nombre de un archivo.
zh_cn: 文件的路径和名称。

source: The path of the application data directory
es: La ruta del directorio de datos de la aplicación
zh_cn: 应用程序数据目录的路径

source: The path of the user's directory
es: La ruta del directorio del usuario
zh_cn: 用户目录的路径

source: The path to a potential directory.
es: La ruta a un directorio potencial.
zh_cn: 潜在目录的路径。

source: The path to a potential file or directory.
es: La ruta de un posible archivo o directorio.
zh_cn: 潜在文件或目录的路径。

source: The path to a potential file.
es: El camino a un archivo potencial.
zh_cn: 潜在文件的路径。

source: The paths are relative to the game's source and save directories, as well as any paths mounted with <a href="love.filesystem.mount">love.filesystem.mount</a>.
es: Las rutas son relativas a los directorios de origen y guardado del juego, as&iacute; como a las rutas montadas con <a href="love.filesystem.mount">love.filesystem.mount</a> .
zh_cn: 这些路径相对于游戏的源目录和保存目录，以及与<a href="love.filesystem.mount">love.filesystem.mount</a>挂接的任何路径。

source: The paths string given to this function is a sequence of path templates separated by semicolons. The argument passed to
es: La cadena de caminos dada a esta función es una secuencia de plantillas de caminos separadas por punto y coma.El argumento pasado a
zh_cn: 给予该函数的路径字符串是由分号分隔的路径模板序列。传递给

source: The paths string returned by this function is a sequence of path templates separated by semicolons. The argument passed to
es: La cadena de caminos devuelta por esta función es una secuencia de plantillas de caminos separadas por punto y coma.El argumento pasado a
zh_cn: 该函数返回的路径字符串是由分号分隔的路径模板序列。传递给

source: The paths that the
es: Los caminos que el
zh_cn: 的路径。

source: The pattern is repeated to complete the line. Using the repeat will stretch the pattern and multiplies each 1 and 0. For example if three 1s are consecutively placed they are stretched to six if the repeat is 2. The maximum repeat is 255, and the minimum repeat is 1.
es: El patrón se repite para completar la línea.Usando la repetición se estirará el patrón y se multiplicará cada 1 y 0.Por ejemplo,si se colocan tres 1 consecutivamente se estirarán hasta seis si la repetición es 2.La máxima repetición es 255,y la mínima es 1.
zh_cn: 重复的图案可以完成这一行。使用重复将拉伸图案,并将每个1和0相乘。 例如,如果连续放置三个1,如果重复是2,则将被拉伸为6。 最大重复是255,最小重复是1。

source: The pause key on an American layout.
es: La tecla de pausa en un diseño americano.
zh_cn: 美式布局的暂停键。

source: The period key on an American layout.
es: La clave del período en un diseño americano.
zh_cn: 美国布局的时期关键。

source: The physical locations for the bound gamepad axes and buttons should correspond as closely as possible to the layout of a standard Xbox 360 controller.
es: La ubicación física de los ejes y botones del gamepad debe corresponderse en la medida de lo posible con la disposición de un controlador Xbox 360 estándar.
zh_cn: 绑定的游戏手柄轴和按钮的物理位置应尽可能地与标准Xbox 360控制器的布局相对应。

source: The physical locations for the virtual gamepad axes and buttons correspond as closely as possible to the layout of a standard Xbox 360 controller.
es: Las ubicaciones físicas de los ejes y botones del gamepad virtual se corresponden en la medida de lo posible con la disposición de un controlador Xbox 360 estándar.
zh_cn: 虚拟游戏手柄轴和按钮的物理位置尽可能地与标准Xbox 360控制器的布局相对应。

source: The physical locations of the virtual gamepad axes for a <a href="joystick">Joystick</a> correspond as closely as possible to the layout of the axes on a standard Xbox 360 controller.
es: Las ubicaciones f&iacute;sicas de los ejes del gamepad virtual para un <a href="joystick">Joystick</a> corresponden lo m&aacute;s cerca posible al dise&ntilde;o de los ejes en un controlador Xbox 360 est&aacute;ndar.
zh_cn: <a href="joystick">游戏杆</a>的虚拟游戏手柄轴的物理位置与标准Xbox 360控制器上的轴布局尽可能接近。

source: The physical locations of the virtual gamepad buttons for a <a href="joystick">Joystick</a> correspond as closely as possible to the layout of the buttons on a standard Xbox 360 controller.
es: Las ubicaciones f&iacute;sicas de los botones del gamepad virtual para un <a href="joystick">Joystick se</a> corresponden lo m&aacute;s cerca posible con el dise&ntilde;o de los botones en un controlador Xbox 360 est&aacute;ndar.
zh_cn: <a href="joystick">游戏杆</a>的虚拟游戏手柄按钮的物理位置尽可能与标准Xbox 360控制器上的按钮的布局相对应。

source: The physics module also imposes maximum values for the rope segments. If the parameters exceed these values, the maximum values are set instead of the requested values.
es: El módulo de física también impone valores máximos para los segmentos de cuerda.Si los parámetros superan estos valores,se fijan los valores máximos en lugar de los valores solicitados.
zh_cn: 物理模块还对绳段施加最大值。如果参数超过这些值,就会设置最大值,而不是要求的值。

source: The pitch, where 1.0 is normal.
es: El tono,donde 1.0 es normal.
zh_cn: 的间距,其中1.0为正常。

source: The pixel colors of what's drawn are added to the pixel colors already on the screen. The alpha of the screen is not modified.
es: Los colores de los píxeles de lo que se dibuja se añaden a los colores de los píxeles que ya están en la pantalla.El alfa de la pantalla no se modifica.
zh_cn: 绘制的像素颜色会添加到屏幕上已有的像素颜色中。画面的alpha不会被修改。

source: The pixel colors of what's drawn are compared to the existing pixel colors, and the larger of the two values for each color component is used. Only works when the "premultiplied" <a href="blendalphamode">BlendAlphaMode</a> is used in <a href="love.graphics.setblendmode">love.graphics.setBlendMode</a>.
es: Los colores de p&iacute;xeles de lo que se dibuja se comparan con los colores de p&iacute;xeles existentes y se utiliza el mayor de los dos valores para cada componente de color. S&oacute;lo funciona cuando el "premultiplicado" <a href="blendalphamode">BlendAlphaMode</a> se utiliza en <a href="love.graphics.setblendmode">love.graphics.setBlendMode</a> .
zh_cn: 将绘制的像素颜色与现有像素颜色进行比较，并使用每个颜色分量的两个值中的较大者。仅在<a href="blendalphamode">love.graphics.setBlendMode</a>中使用&ldquo;预乘&rdquo; BlendAlphaMode时<a href="love.graphics.setblendmode">有效</a>。

source: The pixel colors of what's drawn are compared to the existing pixel colors, and the smaller of the two values for each color component is used. Only works when the "premultiplied" <a href="blendalphamode">BlendAlphaMode</a> is used in <a href="love.graphics.setblendmode">love.graphics.setBlendMode</a>.
es: Los colores de p&iacute;xeles de lo que se dibuja se comparan con los colores de p&iacute;xeles existentes y se usa el menor de los dos valores para cada componente de color. S&oacute;lo funciona cuando el "premultiplicado" <a href="blendalphamode">BlendAlphaMode</a> se utiliza en <a href="love.graphics.setblendmode">love.graphics.setBlendMode</a> .
zh_cn: 将绘制的像素颜色与现有像素颜色进行比较，并使用每个颜色分量的两个值中较小的一个。仅在<a href="blendalphamode">love.graphics.setBlendMode</a>中使用&ldquo;预乘&rdquo; BlendAlphaMode时<a href="love.graphics.setblendmode">有效</a>。

source: The pixel colors of what's drawn are multiplied with the pixel colors already on the screen (darkening them). The alpha of drawn objects is multiplied with the alpha of the screen rather than determining how much the colors on the screen are affected, even when the "alphamultiply" <a href="blendalphamode">BlendAlphaMode</a> is used.
es: Los colores de p&iacute;xeles de lo que se dibuja se multiplican por los colores de p&iacute;xeles que ya est&aacute;n en la pantalla (oscureci&eacute;ndolos). El alfa de los objetos dibujados se multiplica por el alfa de la pantalla en lugar de determinar cu&aacute;nto se ven afectados los colores en la pantalla, incluso cuando se utiliza el BlendAlphaMode " <a href="blendalphamode">alphamultiply</a> " .
zh_cn: 绘制的像素颜色与屏幕上已经存在的像素颜色相乘（变暗）。即使使用&ldquo; alphamultiply&rdquo; <a href="blendalphamode">BlendAlphaMode</a>，绘制对象的Alpha值也要与屏幕的Alpha值相乘，而不是确定屏幕上的颜色会受到多少影响。

source: The pixel colors of what's drawn are subtracted from the pixel colors already on the screen. The alpha of the screen is not modified.
es: Los colores de los píxeles de lo que se dibuja se restan de los colores de los píxeles que ya están en la pantalla.El alfa de la pantalla no se modifica.
zh_cn: 绘制的像素颜色会从屏幕上已有的像素颜色中减去。画面的alpha不会被修改。

source: The pixel density inside the window might be greater (or smaller) than the "size" of the window. For example on a retina screen in Mac OS X with the <code>highdpi</code><a href="love.window.setmode">window flag</a> enabled, the window may take up the same physical size as an 800x600 window, but the area inside the window uses 1600x1200 pixels. <code>love.window.fromPixels(1600)</code> would return <code>800</code> in that case.
es: La densidad de p&iacute;xeles dentro de la ventana puede ser mayor (o menor) que el "tama&ntilde;o" de la ventana. Por ejemplo, en una pantalla retina en Mac OS X con el <code>highdpi</code> <a href="love.window.setmode">ventana </a>highdpi habilitado, la ventana puede ocupar el mismo tama&ntilde;o f&iacute;sico que una ventana de 800x600, pero el &aacute;rea dentro de la ventana utiliza 1600x1200 p&iacute;xeles. <code>love.window.fromPixels(1600)</code> devolver&iacute;a <code>800</code> en ese caso.
zh_cn: 窗口内的像素密度可能大于（或小于）窗口的&ldquo;大小&rdquo;。例如，在Mac OS X的视网膜屏幕上启用了 <code>highdpi</code> <a href="love.window.setmode">窗口标志的情况下</a>，该窗口可能会占用与800x600窗口相同的物理尺寸，但是窗口内部的区域使用1600x1200像素。在这种情况下， <code>love.window.fromPixels(1600)</code> 将返回 <code>800</code> 。

source: The pixel density inside the window might be greater (or smaller) than the "size" of the window. For example on a retina screen in Mac OS X with the <code>highdpi</code><a href="love.window.setmode">window flag</a> enabled, the window may take up the same physical size as an 800x600 window, but the area inside the window uses 1600x1200 pixels. <code>love.window.getPixelScale()</code> would return <code>2.0</code> in that case.
es: La densidad de p&iacute;xeles dentro de la ventana puede ser mayor (o menor) que el "tama&ntilde;o" de la ventana. Por ejemplo, en una pantalla retina en Mac OS X con el <code>highdpi</code> <a href="love.window.setmode">ventana </a>highdpi habilitado, la ventana puede ocupar el mismo tama&ntilde;o f&iacute;sico que una ventana de 800x600, pero el &aacute;rea dentro de la ventana utiliza 1600x1200 p&iacute;xeles. <code>love.window.getPixelScale()</code> devolver&iacute;a <code>2.0</code> en ese caso.
zh_cn: 窗口内的像素密度可能大于（或小于）窗口的&ldquo;大小&rdquo;。例如，在启用了 <code>highdpi</code> <a href="love.window.setmode">窗口标志的</a> Mac OS X的视网膜屏幕上，该窗口可能会占用与800x600窗口相同的物理尺寸，但是该窗口内部的区域使用1600x1200像素。在这种情况下， <code>love.window.getPixelScale()</code> 将返回 <code>2.0</code> 。
