Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/love/love.*.006.xlf
Languages: es, ja, ko, zh_cn

source: The default function for <a href="https://love2d.org/wiki/0.9.0">0.9.0</a>, <a href="https://love2d.org/wiki/0.9.1">0.9.1</a>, and <a href="https://love2d.org/wiki/0.9.2">0.9.2</a>, used if you don't supply your own.
ja: デフォルトの機能<a href="https://love2d.org/wiki/0.9.0">0.9.0</a>、<a href="https://love2d.org/wiki/0.9.1">0.9.1</a>、および<a href="https://love2d.org/wiki/0.9.2">0.9.2</a>あなたがあなた自身を提供しない場合に使用されます、。
ko: <a href="https://love2d.org/wiki/0.9.0">0.9.0</a> , <a href="https://love2d.org/wiki/0.9.1">0.9.1</a> 및 <a href="https://love2d.org/wiki/0.9.2">0.9.2</a> 의 기본 기능은 사용자가 직접 제공하지 않은 경우에 사용됩니다.

source: The default function for <a href="https://love2d.org/wiki/11.0">11.0</a>, used if you don't supply your own.
ja: <a href="https://love2d.org/wiki/11.0">11.0</a>のデフォルト関数で、独自の関数を提供しない場合に使用されます。
ko: <a href="https://love2d.org/wiki/11.0">11.0</a> 의 기본 함수로 , 직접 제공하지 않는 경우 사용됩니다.

source: The default function used if you don't supply your own.
ja: 自分で指定しない場合に使用されるデフォルトの関数です。
ko: 직접 제공하지 않은 경우 사용되는 기본 기능입니다.

source: The default method is efficient, but a body moving very quickly may sometimes jump over another body without producing a collision. A body that is set as a bullet will use CCD. This is less efficient, but is guaranteed not to jump when moving quickly.
ja: デフォルトでは効率的な方法ですが、非常に速く動く体は、衝突を起こさずに他の体を飛び越えてしまうことがあります。弾丸に設定されているボディはCCDを使用します。これは効率的ではありませんが、素早く動いているときにはジャンプしないことが保証されています。
ko: 기본 방법은 효율적이지만 매우 빠르게 움직이는 바디는 충돌없이 다른 바디 위로 건너 뛸 수 있습니다. 글 머리 기호로 설정된 본문은 CCD를 사용합니다. 이것은 비효율적이지만 빠르게 움직일 때 점프하지 않도록 보장합니다.

source: The default paths string is <code>"?.lua;?/init.lua"</code>, which makes <code>require("cool")</code> try to load <code>cool.lua</code> and then try <code>cool/init.lua</code> if cool.lua doesn't exist.
ja: デフォルトのパス文字列がある <code>"?.lua;?/init.lua"</code> 、作るにはどの <code>require("cool")</code> 負荷にしようと <code>cool.lua</code> てみ当時と <code>cool/init.lua</code> cool.luaが存在しない場合。
ko: 기본 경로 문자열은 <code>"?.lua;?/init.lua"</code> . <code>require("cool")</code> 은 <code>cool.lua</code> 를로드 한 다음 cool.init가없는 경우 <code>cool/init.lua</code> 를 시도 합니다.

source: The default paths string is <code>"??"</code>, which makes <code>require("cool")</code> try to load <code>cool.dll</code>, or <code>cool.so</code> depending on the platform.
ja: デフォルトのパス文字列は <code>"??"</code> 、作るにはどの <code>require("cool")</code> ロードしよう <code>cool.dll</code> 、または <code>cool.so</code> プラットフォームに依存。
ko: 기본 경로 문자열은 <code>"??"</code> 입니다., 차종 어떤 <code>require("cool")</code> 로드하려고 <code>cool.dll</code> , 또는 <code>cool.so</code> 플랫폼에 따라.

source: The default release mode error handler also outputs a message to the player informing them to contact the author using the values
ja: デフォルトのリリースモードのエラーハンドラは、以下の値を使用して作者に連絡することをプレイヤーに通知するメッセージも出力します。
ko: 기본 릴리스 모드 오류 처리기는 또한 값을 사용하여 작성자에게 연락하라는 메시지를 플레이어에 출력합니다.

source: The default scale for new worlds is 30 pixels per meter.
ja: 新しい世界のデフォルトのスケールは、1メートルあたり30ピクセルです。
ko: 새로운 세계의 기본 배율은 미터당 30 픽셀입니다.

source: The default seed used in version 11.x is the following low/high pair: 0xCBBF7A44, 0x0139408D.
ja: バージョン11.xで使用されているデフォルトシードは、以下のLow/Highペアです。0xCBBF7A44、0x0139408Dです。
ko: 버전 11.x에서 사용되는 기본 시드는 0xCBBF7A44, 0x0139408D의 낮음 / 높음 쌍입니다.

source: The default texture format: 8 bits per channel (32 bpp) RGBA. Color channel values range from 0-255 (0-1 in shaders.)
ja: デフォルトのテクスチャフォーマット。チャンネルあたり8ビット(32 bpp)RGBA。カラーチャンネルの値の範囲は0~255(シェーダでは0~1)です。
ko: 기본 텍스처 형식 : 채널당 8 비트 (32bpp) RGBA. 색상 채널 값의 범위는 0-255입니다 (쉐이더에서 0-1).

source: The degree of variation (0 meaning no variation and 1 meaning full variation between start and end).
ja: 変動の度合い(0は変動なし、1は開始から終了までの変動が完全にあることを意味する)。
ko: 변화의 정도 (0은 변화가 없음을 의미하고 1은 시작과 끝 사이의 전체 변화를 의미)

source: The density of the Shape.
ja: シェイプの密度。
ko: 모양의 밀도.

source: The density of the fixture.
ja: 什器の密度。
ko: 고정물의 밀도.

source: The depth of the volume Texture.
ja: ボリュームの深さ テクスチャ。
ko: 볼륨 텍스처의 깊이입니다.

source: The derivative curve.
ja: 派生曲線です。
ko: 미분 곡선.

source: The descent of the Font in pixels.
ja: ピクセル単位でのフォントの降下。
ko: 폰트의 하강 (픽셀)입니다.

source: The desired <a href="enet.peer"> peer</a> structure.
ja: 目的の<a href="enet.peer">ピア</a>構造。
ko: 원하는 <a href="enet.peer">피어</a> 구조.

source: The desired height of the Canvas.
ja: キャンバスの希望の高さ。
ko: 캔버스의 원하는 높이입니다.

source: The desired height of the framebuffer.
ja: フレームバッファの高さを指定します。
ko: 프레임 버퍼의 원하는 높이입니다.

source: The desired number of multisample antialiasing (MSAA) samples used when drawing to the Canvas.
ja: キャンバスに描画する際に使用するマルチサンプル・アンチエイリアシング(MSAA)サンプルの希望数。
ko: Canvas로 그릴 때 사용되는 MSAA (Multisample Antialiasing) 샘플 수

source: The desired texture format of the Canvas.
ja: キャンバスの希望するテクスチャフォーマット。
ko: 캔버스의 원하는 텍스처 형식입니다.

source: The desired width of the Canvas.
ja: キャンバスの希望する幅。
ko: 캔버스의 원하는 너비입니다.

source: The desired width of the framebuffer.
ja: フレームバッファの希望する幅。
ko: 프레임 버퍼의 원하는 너비입니다.

source: The different distance models.
ja: 距離感の違うモデル。
ko: 다른 거리 모델.

source: The different modes you can open a <a href="file">File</a> in.
ja: <a href="file">ファイル</a>を開くことができるさまざまなモード。
ko: <a href="file">파일</a> 을 열 수있는 다른 모드

source: The different modes you can open a <strong>File</strong> in.
ja: <strong>ファイル</strong>を開くことができるさまざまなモード。
ko: <strong>파일</strong> 을 열 수있는 다른 모드

source: The different types of <a href="shape">Shapes</a>, as returned by <a href="shape-gettype">Shape:getType</a>.
ja: <a href="shape-gettype">Shape：getType</a>によって返される<a href="shape">Shapes</a>のさまざまなタイプ。
ko: 의 서로 다른 유형의 <a href="shape">모양은</a> , 같은 의해 반환 된 <a href="shape-gettype">모양 : getType로</a> .

source: The different types of <strong>Shapes</strong>, as returned by <a href="shape-gettype">Shape:getType</a>.
ja: <a href="shape-gettype">Shape：getType</a>によって返される<strong>Shapes</strong>のさまざまなタイプ。
ko: 의 서로 다른 유형의 <strong>모양은</strong> , 같은 의해 반환 된 <a href="shape-gettype">모양 : getType로</a> .

source: The different types of effects supported by <a href="love.audio.seteffect">love.audio.setEffect</a>.
ja: <a href="love.audio.seteffect">love.audio.setEffectで</a>サポートされているさまざまな種類のエフェクト。
ko: <a href="love.audio.seteffect">love.audio.setEffect에서</a> 지원하는 다양한 유형의 효과 .

source: The different types of waveforms that can be used with the <b>ringmodulator</b><a href="effecttype">EffectType</a>.
ja: <b>リング</b><a href="effecttype">モジュレーターEffectTypeで</a>使用できるさまざまなタイプの波形。
ko: <b>Ringmodulator </b><a href="effecttype">EffectType</a> 과 함께 사용할 수있는 다양한 유형의 파형 .

source: The dimensions of the scissor is unaffected by graphical transformations (translate, scale, ...).
ja: シザーの寸法は、グラフィカルな変換(translate,scale,...)の影響を受けません。
ko: 가위의 크기는 그래픽 변환 (번역, 스케일 등)의 영향을받지 않습니다.

source: The direction of the emitter (radians).
ja: エミッタの方向(ラジアン)。
ko: 이미 터의 방향 (라디안).

source: The direction of the hat, if the virtual gamepad axis is bound to a hat. nil otherwise.
ja: 仮想ゲームパッドの軸が帽子にバインドされている場合は帽子の方向。
ko: 가상 게임 패드 축이 모자에 묶인 경우 모자의 방향입니다. 그렇지 않으면 nil.

source: The direction of the hat, if the virtual gamepad axis will be bound to a hat. nil otherwise.
ja: 仮想ゲームパッドの軸が帽子にバインドされている場合は帽子の方向を指定します。
ko: 가상 게임 패드 축이 모자에 바인딩되는 경우 모자의 방향입니다. 그렇지 않으면 nil.

source: The direction of the hat, if the virtual gamepad button is bound to a hat. nil otherwise.
ja: 仮想ゲームパッドボタンが帽子にバインドされている場合は、帽子の方向を指定します。
ko: 가상 게임 패드 버튼이 모자에 묶인 경우 모자의 방향입니다. 그렇지 않으면 nil.

source: The direction of the hat, if the virtual gamepad button will be bound to a hat. nil otherwise.
ja: 仮想ゲームパッドボタンが帽子にバインドされる場合、帽子の方向を指定します。
ko: 가상 게임 패드 버튼이 모자에 묶인 경우 모자의 방향입니다. 그렇지 않으면 nil.

source: The direction of the particles (in radians).
ja: 粒子の方向(ラジアン単位)。
ko: 입자의 방향 (라디안)입니다.

source: The direction the hat is pushed
ja: 帽子を押す方向
ko: 모자가 밀리는 방향

source: The direction the hat is pushed.
ja: 帽子を押す方向。
ko: 모자가 밀린 방향.

source: The directory must be empty before removal or else it will fail. Simply remove all files and folders in the directory beforehand.
ja: 削除する前にディレクトリを空にしておかないと失敗します。ディレクトリ内のすべてのファイルとフォルダを事前に削除するだけです。
ko: 제거하기 전에 디렉토리가 비어 있어야합니다. 그렇지 않으면 실패합니다. 미리 디렉토리의 모든 파일과 폴더를 제거하면됩니다.

source: The directory to create.
ja: 作成するディレクトリ。
ko: 작성할 디렉토리입니다.

source: The directory.
ja: ディレクトリです。
ko: 디렉토리.

source: The display height.
ja: 表示の高さです。
ko: 디스플레이 높이.

source: The display switch scancode.
ja: 表示スイッチのスキャンコードです。
ko: 디스플레이 스위치 스캔 코드.

source: The display width.
ja: 表示幅です。
ko: 표시 폭입니다.

source: The distance of the two points.
ja: 2点の距離。
ko: 두 점의 거리.

source: The down-arrow key on an American layout.
ja: アメリカのレイアウトのダウンアローキー。
ko: 미국식 레이아웃의 아래쪽 화살표 키.

source: The drawing color set with <a href="love.graphics.setcolor">love.graphics.setColor</a> or the per-vertex <a href="mesh">Mesh</a> color.
ja: <a href="love.graphics.setcolor">love.graphics.setColor</a>または頂点ごとの<a href="mesh">メッシュ</a>カラーで設定された描画色。
ko: <a href="love.graphics.setcolor">love.graphics.setColor</a> 또는 버텍스 당 <a href="mesh">메쉬</a> 색상으로 설정된 드로잉 색상입니다 .

source: The drawing color set with <a href="love.graphics.setcolor">love.graphics.setColor</a>.
ja: <a href="love.graphics.setcolor">love.graphics.setColorで</a>設定した描画色。
ko: <a href="love.graphics.setcolor">love.graphics.setColor로</a> 설정된 그리기 색상입니다 .

source: The duration of the Source, or -1 if it cannot be determined.
ja: ソースの持続時間、または決定できない場合は-1。
ko: 소스의 지속 시간 또는 확인할 수없는 경우 -1

source: The duration of the sound data in seconds.
ja: サウンドデータの持続時間を秒単位で表示しています。
ko: 사운드 데이터의 지속 시간 (초)입니다.

source: The duration of the sound file in seconds, or -1 if it cannot be determined.
ja: サウンドファイルの持続時間を秒単位で指定します。
ko: 사운드 파일의 지속 시간 (초) 또는 확인할 수없는 경우 -1

source: The duration of the vibration in seconds. A negative value means infinite duration.
ja: 振動の持続時間を秒単位で表します。負の値は無限の持続時間を意味します。
ko: 진동 지속 시간 (초)입니다. 음수 값은 무한 기간을 의미합니다.

source: The duration to vibrate for. If called on an iOS device, it will always vibrate for 0.5 seconds due to limitations in the iOS system APIs.
ja: 振動させる時間を指定します。iOSデバイスで呼び出された場合、iOSシステムAPIの制限のため、常に0.5秒間振動します。
ko: 진동 시간. iOS 기기에서 호출하면 iOS 시스템 API의 제한으로 인해 항상 0.5 초 동안 진동합니다.

source: The dynamic status of the body.
ja: ダイナミックな状態になっています。
ko: 신체의 동적 상태.

source: The effect must have been previously defined using <a href="love.audio.seteffect">love.audio.setEffect</a>.
ja: 効果は、<a href="love.audio.seteffect">love.audio.setEffect</a>を使用して事前に定義されている必要があります。
ko: 효과는 <a href="love.audio.seteffect">love.audio.setEffect를</a> 사용하여 이전에 정의되어 있어야합니다 .

source: The effect of the segment argument
ja: セグメント引数の効果
ko: 세그먼트 인수의 효과

source: The effect of the state string does not depend on the current operating system.
ja: 状態文字列の効果は、現在のオペレーティングシステムに依存しません。
ko: 상태 문자열의 효과는 현재 운영 체제에 의존하지 않습니다.

source: The eight key
ja: 8つのキー
ko: 여덟 키

source: The eighth size.
ja: 8分の1サイズ。
ko: 여덟 번째 크기입니다.

source: The eject scancode.
ja: イジェクトスキャンコードです。
ko: 꺼내기 스캔 코드.

source: The encoded data to decode into a font.
ja: フォントにデコードするためのエンコードデータです。
ko: 글꼴로 디코딩 할 인코딩 된 데이터입니다.

source: The encoded data to load into the ImageData.
ja: ImageDataにロードするエンコードされたデータ。
ko: ImageData로로드 할 인코딩 된 데이터입니다.

source: The encoded file data to decode into image data.
ja: 画像データにデコードするためのエンコードされたファイルデータ。
ko: 이미지 데이터로 디코딩 할 인코딩 된 파일 데이터입니다.

source: The encoded image as a new FileData object.
ja: 新しいFileDataオブジェクトとしてエンコードされた画像。
ko: 새 FileData 객체로 인코딩 된 이미지입니다.

source: The encoded image data.
ja: 符号化された画像データ。
ko: 인코딩 된 이미지 데이터.

source: The end key on an American layout.
ja: アメリカのレイアウトのエンドキー。
ko: 미국식 레이아웃의 끝 키.

source: The end of the segment to render. Must be between 0 and 1.
ja: レンダリングするセグメントの終わりです。0 から 1 の間でなければなりません。
ko: 렌더링 할 세그먼트의 끝입니다. 0과 1 사이 여야합니다.

source: The end of the segment. Must be between 0 and 1.
ja: セグメントの終わりです。0 から 1 の間でなければなりません。
ko: 세그먼트의 끝 0과 1 사이 여야합니다.

source: The ends of the line segments beveled in an angle so that they join seamlessly.
ja: 線分の端は、それらがシームレスに結合するように斜めに面取りされています。
ko: 선분의 끝은 비스듬히 기울어 져서 원활하게 연결됩니다.

source: The equals key on an American layout.
ja: アメリカのレイアウトのイコールキー。
ko: 미국식 레이아웃의 equals 키

source: The error handler, used to display error messages.
ja: エラーメッセージを表示するために使用されるエラーハンドラ。
ko: 오류 메시지를 표시하는 데 사용되는 오류 처리기입니다.

source: The error message if file could not be opened.
ja: ファイルを開くことができなかった場合のエラーメッセージ。
ko: 파일을 열 수없는 경우 오류 메시지가 표시됩니다.

source: The error message on failure.
ja: 失敗時のエラーメッセージです。
ko: 실패시 오류 메시지.

source: The error message, or nil if the Thread has not caused an error.
ja: エラーメッセージ、またはスレッドがエラーを発生させていない場合はnil。
ko: 오류 메시지 또는 스레드가 오류를 유발하지 않은 경우 nil입니다.

source: The error message.
ja: エラーメッセージが出ています。
ko: 오류 메시지

source: The error string if an error occurred.
ja: エラーが発生した場合のエラー文字列。
ko: 오류가 발생한 경우 오류 문자열

source: The error string, if an error occurred and the file could not be flushed.
ja: エラーが発生し、ファイルをフラッシュできなかった場合のエラー文字列。
ko: 오류가 발생하여 파일을 플러시 할 수없는 경우 오류 문자열입니다.

source: The error string, if an error occurred.
ja: エラーが発生した場合のエラー文字列。
ko: 오류가 발생한 경우 오류 문자열

source: The error string, if the buffer mode could not be set and an error occurred.
ja: バッファモードを設定できず、エラーが発生した場合のエラー文字列。
ko: 버퍼 모드를 설정할 수없고 오류가 발생한 경우 오류 문자열입니다.

source: The estimated total size in bytes of video memory used by all loaded <a href="image">Images</a>, <a href="canvas">Canvases</a>, and <a href="font">Fonts</a>.
ja: ロードされたすべての<a href="image">Images</a>、<a href="canvas">Canvases</a>、および<a href="font">Fonts</a>によって使用されるビデオメモリの推定合計サイズ（バイト単位）。
ko: 로드 된 모든 <a href="image">이미지</a> , <a href="canvas">캔버스</a> 및 <a href="font">글꼴</a> 에서 사용하는 비디오 메모리의 예상 총 크기 (바이트)입니다 .

source: The existing Data object to copy.
ja: コピーする既存のDataオブジェクト。
ko: 복사 할 기존 데이터 개체입니다.

source: The expected usage of the Mesh. The specified usage mode affects the Mesh's memory usage and performance.
ja: Meshの予想される使用方法。指定された使用モードは、Meshのメモリ使用量とパフォーマンスに影響を与えます。
ko: 메시의 예상 사용법. 지정된 사용 모드는 메시의 메모리 사용 및 성능에 영향을줍니다.

source: The expected usage of the SpriteBatch. The specified usage mode affects the SpriteBatch's memory usage and performance.
ja: SpriteBatch の使用量を指定します。指定された使用モードは、SpriteBatchのメモリ使用量やパフォーマンスに影響を与えます。
ko: SpriteBatch의 예상 사용법입니다. 지정된 사용 모드는 SpriteBatch의 메모리 사용 및 성능에 영향을줍니다.

source: The extension of the file the FileData represents.
ja: FileDataが表すファイルの拡張子です。
ko: FileData가 나타내는 파일의 확장자입니다.

source: The file contents
ja: ファイルの内容
ko: 파일 내용

source: The file contents.
ja: ファイルの内容です。
ko: 파일 내용.

source: The file name of the file to load.
ja: 読み込むファイルのファイル名です。
ko: 로드 할 파일의 파일 이름입니다.

source: The file or directory path to check.
ja: チェックするファイルまたはディレクトリのパス。
ko: 확인할 파일 또는 디렉토리 경로입니다.

source: The file or directory to remove.
ja: 削除するファイルまたはディレクトリ。
ko: 제거 할 파일 또는 디렉토리입니다.

source: The file path to the Ogg Theora video file (or <a href="videostream">VideoStream</a>).
ja: Ogg Theoraビデオファイル（または<a href="videostream">VideoStream</a>）へのファイルパス。
ko: Ogg Theora 비디오 파일 (또는 <a href="videostream">VideoStream</a> ) 의 파일 경로 입니다.

source: The file path to the Ogg Theora video file.
ja: Ogg Theora ビデオファイルのファイルパスです。
ko: Ogg Theora 비디오 파일의 파일 경로입니다.

source: The file size in bytes.
ja: ファイルサイズをバイト単位で指定します。
ko: 파일 크기 (바이트)입니다.

source: The file size.
ja: ファイルサイズです。
ko: 파일 크기

source: The file to use as source.
ja: ソースとして使用するファイル。
ko: 소스로 사용할 파일입니다.

source: The file with encoded sound data.
ja: エンコードされた音声データが入ったファイル。
ko: 인코딩 된 사운드 데이터가있는 파일입니다.

source: The file's last modification time in seconds since the unix epoch, or nil if it can't be determined.
ja: ファイルの最終更新時刻を unix エポックからの秒単位で指定します。
ko: unix epoch 이후 파일의 마지막 수정 시간 (초) 또는 확인할 수없는 경우 nil입니다.

source: The filename of the File.
ja: ファイルのファイル名です。
ko: 파일의 파일 이름

source: The filename of the compressed image file.
ja: 圧縮画像ファイルのファイル名。
ko: 압축 된 이미지 파일의 파일 이름입니다.

source: The filename of the file with encoded sound data.
ja: エンコードされた音声データが入っているファイルのファイル名。
ko: 인코딩 된 사운드 데이터가있는 파일의 파일 이름입니다.

source: The filename of the file.
ja: ファイルのファイル名です。
ko: 파일의 파일 이름

source: The filename of the image file.
ja: 画像ファイルのファイル名。
ko: 이미지 파일의 파일 이름입니다.

source: The filename of the potentially compressed image file.
ja: 圧縮される可能性のある画像ファイルのファイル名。
ko: 잠재적으로 압축 된 이미지 파일의 파일 이름입니다.

source: The filename of video stream
ja: ビデオストリームのファイル名
ko: 비디오 스트림의 파일 이름

source: The filename to load the mappings string from.
ja: マッピング文字列を読み込むファイル名。
ko: 매핑 문자열을로드 할 파일 이름입니다.

source: The filename to save the mappings string to.
ja: マッピング文字列を保存するファイル名。
ko: 매핑 문자열을 저장할 파일 이름입니다.

source: The filename to save the screenshot to. The encoded image type is determined based on the extension of the filename, and must be one of the <a href="imageencodeformat">ImageFormats</a>.
ja: スクリーンショットを保存するファイル名。エンコードされた画像タイプは、ファイル名の拡張子に基づいて決定され、<a href="imageencodeformat">ImageFormatsの</a>1つである必要があります。
ko: 스크린 샷을 저장할 파일 이름입니다. 인코딩 된 이미지 유형은 파일 이름의 확장자에 따라 결정되며 <a href="imageencodeformat">ImageFormats</a> 중 하나 여야합니다 .

source: The filename to write the file to. If nil, no file will be written but the FileData will still be returned.
ja: ファイルを書き込むファイル名。nil の場合、ファイルは書き込まれませんが、FileData は返されます。
ko: 파일을 쓸 파일 이름입니다. nil 인 경우 파일이 작성되지 않지만 FileData는 계속 리턴됩니다.

source: The filepath to a cubemap image file (or a <a href="file">File</a>, <a href="filedata">FileData</a>, or <a href="imagedata">ImageData</a>).
ja: キューブマップイメージファイル（または<a href="file">File</a>、<a href="filedata">FileData</a>、または<a href="imagedata">ImageData</a>）へのファイルパス。
ko: 큐브 맵 이미지 파일 (또는 <a href="file">File</a> , <a href="filedata">FileData</a> 또는 <a href="imagedata">ImageData</a> )에 대한 파일 경로 입니다.

source: The filepath to get the directory of.
ja: のディレクトリを取得するファイルパス。
ko: 디렉토리를 가져올 파일 경로입니다.

source: The filepath to the BMFont file.
ja: BMFontファイルのファイルパス。
ko: BMFont 파일의 파일 경로입니다.

source: The filepath to the BMFont or TrueType font file.
ja: BMFont または TrueType フォントファイルへのファイルパス。
ko: BMFont 또는 TrueType 글꼴 파일의 파일 경로입니다.

source: The filepath to the BMFont's image file. If this argument is omitted, the path specified inside the BMFont file will be used.
ja: BMFontの画像ファイルへのファイルパス。この引数が省略された場合は、BMFontファイル内で指定されたパスが使用されます。
ko: BMFont의 이미지 파일에 대한 파일 경로입니다. 이 인수를 생략하면 BMFont 파일에 지정된 경로가 사용됩니다.

source: The filepath to the TrueType font file.
ja: TrueType フォントファイルへのファイルパス。
ko: 트루 타입 글꼴 파일의 파일 경로입니다.

source: The filepath to the audio file.
ja: オーディオファイルのファイルパス。
ko: 오디오 파일의 파일 경로입니다.
