Repository: Yuniorcr/runebook
Catalog: xlf/docs/*/love/love.*.006.xlf
Languages: es, ja, ko, zh_cn

source: The FileData to create a Source from.
ja: ソースを作成するFileData。
ko: 소스를 생성 할 FileData입니다.

source: The Font object to use.
ja: 使用するフォントオブジェクト。
ko: 사용할 Font 객체입니다.

source: The FontData.
ja: FontDataを使用しています。
ko: FontData.

source: The G key
ja: Gキーの
ko: G 키

source: The GlyphData.
ja: GlyphDataです。
ko: GlyphData.

source: The H key
ja: Hキー
ko: H 키

source: The HDR / floating point formats are most useful when combined with pixel shaders. Effects such as tonemapped HDR with bloom can be accomplished, or the canvas can be used to store arbitrary non-color data such as positions which can then be used in a custom shader.
ja: HDR/浮動小数点フォーマットは、ピクセルシェーダと組み合わせると最も便利です。また、キャンバスを使用して、カスタムシェーダで使用できる位置などの任意の非カラーデータを保存することもできます。
ko: HDR / 부동 소수점 형식은 픽셀 셰이더와 결합 할 때 가장 유용합니다. 블룸이있는 톤맵 HDR과 같은 효과를 얻거나 캔버스를 사용하여 위치와 같은 임의의 비 색상 데이터를 저장하여 사용자 지정 셰이더에 사용할 수 있습니다.

source: The HDR format is most useful when combined with pixel shaders. Effects such as tonemapped HDR with bloom can be accomplished, or the canvas can be used to store arbitrary non-color data such as positions which are then interpreted and used in a shader, as long as you draw the right things to the canvas.
ja: HDR フォーマットは、ピクセルシェーダと組み合わせると最も便利です。また、キャンバスに正しいものを描画する限り、位置などの任意の非カラーデータを保存するためにキャンバスを使用することができ、それらを解釈してシェーダで使用することができます。
ko: HDR 형식은 픽셀 쉐이더와 결합 할 때 가장 유용합니다. 블룸이있는 톤맵 HDR과 같은 효과를 얻거나 캔버스를 사용하여 캔버스에 올바른 것을 그리는 한 위치와 같은 임의의 비 색상 데이터를 저장하여 쉐이더에서 해석하고 사용할 수 있습니다.

source: The I key
ja: I キー
ko: I 키

source: The Image or Canvas to texture the Mesh with when drawing, or nil if none is set.
ja: 描画時にメッシュをテクスチャする画像またはキャンバス、設定されていない場合はnilを指定します。
ko: 그릴 때 메쉬를 텍스처링 할 이미지 또는 캔버스, 또는 설정되지 않은 경우 nil.

source: The Image or Canvas to texture the Mesh with when drawing.
ja: 描画時にメッシュをテクスチャするイメージまたはキャンバス。
ko: 그릴 때 메쉬를 텍스처링 할 이미지 또는 캔버스입니다.

source: The Image or Canvas used by the SpriteBatch.
ja: SpriteBatch が使用する画像またはキャンバス。
ko: SpriteBatch에서 사용하는 이미지 또는 캔버스입니다.

source: The Image to texture the Mesh with when drawing.
ja: 描画時にメッシュをテクスチャするためのイメージ。
ko: 그릴 때 메쉬를 텍스처링 할 이미지입니다.

source: The Image to use for the sprites.
ja: スプライトに使用する画像.
ko: 스프라이트에 사용할 이미지입니다.

source: The Image used to texture the Mesh when drawing. May be nil if no Image is being used with the Mesh.
ja: 描画時にメッシュのテクスチャに使用される画像。MeshでImageが使用されていない場合はnilにすることができます。
ko: 그릴 때 메쉬를 텍스처링하는 데 사용되는 이미지입니다. 메쉬에 이미지가 사용되지 않으면 nil 일 수 있습니다.

source: The ImageData object to create the font from.
ja: フォントを作成するImageDataオブジェクト。
ko: 글꼴을 만들 ImageData 객체입니다.

source: The ImageData to use for the new Cursor.
ja: 新しいカーソルに使用するImageData。
ko: 새 커서에 사용할 ImageData입니다.

source: The J key
ja: Jキー
ko: J 키

source: The Joystick type's OS-dependent unique identifier.
ja: ジョイスティックタイプのOSに依存した一意の識別子。
ko: 조이스틱 유형의 OS 종속 고유 식별자입니다.

source: The Joystick's unique identifier. Remains the same as long as the game is running.
ja: ジョイスティックのユニークな識別子。ゲームが実行されている間は同じままです。
ko: 조이스틱의 고유 식별자입니다. 게임이 실행되는 한 동일하게 유지됩니다.

source: The K key
ja: Kキーの
ko: K 키

source: The L key
ja: Lキー
ko: L 키

source: The LZ4 compression format. Compresses and decompresses very quickly, but the compression ratio is not the best. LZ4-HC is used when compression level 9 is specified. Some benchmarks are available <a href="https://github.com/Cyan4973/lz4#user-content-benchmarks">here</a>.
ja: LZ4圧縮形式。非常に高速に圧縮および解凍しますが、圧縮率は最適ではありません。LZ4-HCは、圧縮レベル9が指定されている場合に使用されます。いくつかのベンチマークは<a href="https://github.com/Cyan4973/lz4#user-content-benchmarks">ここから</a>入手できます。
ko: LZ4 압축 형식 압축 및 압축 해제는 매우 빠르지 만 압축 비율이 최고는 아닙니다. 압축 수준 9를 지정하면 LZ4-HC가 사용됩니다. <a href="https://github.com/Cyan4973/lz4#user-content-benchmarks">여기에서</a> 일부 벤치 마크를 사용할 수 있습니다 .

source: The LineJoin style.
ja: LineJoinスタイルです。
ko: LineJoin 스타일.

source: The LineJoin to use.
ja: 使用するLineJoin。
ko: 사용할 LineJoin입니다.

source: The LineStyle to use.
ja: 使用するLineStyle。
ko: 사용할 LineStyle입니다.

source: The LineStyle to use. Line styles include <code>smooth</code> and <code>rough</code>.
ja: 使用するLineStyle。ラインスタイルには、 <code>smooth</code> と <code>rough</code> ます。
ko: 사용할 LineStyle입니다. 선 스타일은 다음과 같습니다 <code>smooth</code> 하고 <code>rough</code> .

source: The Lua value associated with the Body.
ja: Bodyに関連付けられたLuaの値。
ko: 본문과 관련된 Lua 값입니다.

source: The Lua value associated with the Joint.
ja: ジョイントに関連付けられたLuaの値。
ko: 관절과 관련된 루아 값입니다.

source: The Lua value associated with the fixture.
ja: フィクスチャに関連付けられたLua値。
ko: 조명기와 관련된 Lua 값.

source: The Lua value to associate with the Body.
ja: ボディに関連付けるLuaの値。
ko: 본문과 연결할 Lua 값입니다.

source: The Lua value to associate with the Joint.
ja: ジョイントに関連付けるLuaの値。
ko: 관절과 연결할 Lua 값입니다.

source: The Lua value to associate with the fixture.
ja: フィクスチャに関連付けるLua値。
ko: 조명기와 연관시킬 Lua 값.

source: The M key
ja: Mキーの
ko: M 키

source: The Mail key on an American layout.
ja: アメリカのレイアウトのメールキー。
ko: 미국식 레이아웃의 메일 키.

source: The Mesh face culling mode in use (whether to render everything, cull back-facing triangles, or cull front-facing triangles).
ja: 使用中のメッシュ面のカリングモード(すべてをレンダリングするか、後ろ向きの三角形をカリングするか、前向きの三角形をカリングするか)。
ko: 사용중인 메시면 컬링 모드 (모든 렌더링, 후면 삼각형 컬링 또는 전면 삼각형 컬링).

source: The Mesh face culling mode to use (whether to render everything, cull back-facing triangles, or cull front-facing triangles).
ja: 使用するメッシュ面のカリングモード(すべてをレンダリングするか、裏向きの三角形をカリングするか、表向きの三角形をカリングするか)。
ko: 사용할 메시면 컬링 모드 (모든 렌더링, 후면 삼각형 컬링 또는 전면 삼각형 컬링).

source: The Mesh to get the vertex attribute from.
ja: 頂点属性を取得するメッシュ。
ko: 꼭짓점 속성을 가져올 메시입니다.

source: The N key
ja: Nキーの
ko: N 키

source: The O key
ja: Oキー
ko: O 키

source: The OS-dependent <a href="joystick-getguid">GUID</a> for the type of Joystick the binding will affect.
ja: バインディングが影響するジョイスティックのタイプのOS依存の<a href="joystick-getguid">GUID</a>。
ko: 바인딩에 영향을주는 조이스틱 유형에 대한 OS 종속 <a href="joystick-getguid">GUID</a> .

source: The P key
ja: Pキーの
ko: P 키

source: The PVR1 formats are supported by all iOS devices, as well as the small number of Android devices which have PowerVR GPUs.
ja: PVR1フォーマットは、PowerVR GPUを搭載した少数のAndroidデバイスだけでなく、すべてのiOSデバイスでサポートされています。
ko: PVR1 형식은 모든 iOS 장치와 PowerVR GPU가있는 소수의 Android 장치에서 지원됩니다.

source: The PVR1 formats are supported by iOS devices, as well as Android devices with PowerVR GPUs.
ja: PVR1のフォーマットは、iOSデバイスのほか、PowerVR GPUを搭載したAndroidデバイスにも対応しています。
ko: PVR1 형식은 iOS 장치와 PowerVR GPU가있는 Android 장치에서 지원됩니다.

source: The Q key
ja: Qキー
ko: Q 키

source: The Quad to add.
ja: 追加するクアッド。
ko: 추가 할 쿼드.

source: The Quad to draw on screen.
ja: 画面に描くクアッド。
ko: 화면에 그릴 쿼드.

source: The Quad used on the image of the batch.
ja: バッチの画像に使用しているクアッド。
ko: 배치 이미지에 사용 된 쿼드입니다.

source: The R key
ja: Rキー
ko: R 키

source: The RGB values of what's drawn are <b>not</b> multiplied by the alpha values of those colors during blending. For most blend modes to work correctly with this alpha mode, the colors of a drawn object need to have had their RGB values multiplied by their alpha values at some point previously ("premultiplied alpha").
ja: 描画されたもののRGB値は、ブレンド中にそれらの色のアルファ値で乗算され<b>ません</b>。ほとんどのブレンドモードがこのアルファモードで正しく機能するためには、描画されるオブジェクトの色のRGB値に、ある時点でのアルファ値が乗算されている必要があります（「事前乗算されたアルファ」）。
ko: 그린 내용의 RGB 값에는 혼합 중 해당 색상의 알파 값이 곱해 <b>지지 않습니다</b> . 대부분의 블렌드 모드가이 알파 모드에서 올바르게 작동하려면 그려진 객체의 색상에 RGB 값에 이전 시점의 알파 값 ( "사전 멀티플라이 알파")이 곱해 져야합니다.

source: The RGB values of what's drawn are multiplied by the alpha values of those colors during blending. This is the default alpha mode.
ja: 描画された色のRGB値は、ブレンド中にそれらの色のアルファ値と掛け合わされます。これがデフォルトのアルファモードです。
ko: 그린 내용의 RGB 값에 블렌딩 중 해당 색상의 알파 값이 곱해집니다. 이것이 기본 알파 모드입니다.

source: The RGB variant of the ETC2 format. RGB data at 4 bits per pixel. Suitable for fully opaque images on newer mobile devices.
ja: ETC2 フォーマットの RGB バリアント。1ピクセルあたり4ビットのRGBデータ。新しいモバイルデバイスでの完全な不透明画像に適しています。
ko: ETC2 형식의 RGB 변형입니다. 픽셀 당 4 비트의 RGB 데이터. 최신 모바일 장치에서 완전히 불투명 한 이미지에 적합합니다.

source: The RGBA variant of the ETC2 format where pixels are either fully transparent or fully opaque. RGBA data at 4 bits per pixel.
ja: ETC2フォーマットのRGBAバリアントで、ピクセルが完全に透過または完全に不透明のどちらかになります。1ピクセルあたり4ビットのRGBAデータ。
ko: 픽셀이 완전히 투명하거나 완전히 불투명 한 ETC2 형식의 RGBA 변형입니다. 픽셀 당 4 비트의 RGBA 데이터.

source: The RGBA variant of the ETC2 format. RGBA data at 8 bits per pixel. Recommended for images with varying opacity on newer mobile devices.
ja: ETC2フォーマットのRGBAバリアント。1ピクセルあたり8ビットのRGBAデータ。新しいモバイルデバイスでの不透明度の異なる画像に推奨されます。
ko: ETC2 형식의 RGBA 변형입니다. 픽셀 당 8 비트의 RGBA 데이터. 최신 휴대 기기에서 불투명도가 다양한 이미지에 권장됩니다.

source: The Rasterizer containing the font.
ja: フォントを含むラスタライザ。
ko: 글꼴이 포함 된 래스터 라이저

source: The RopeJoint enforces a maximum distance between two points on two bodies. It has no other effect.
ja: RopeJointは、2つの体の2点間の最大距離を強制します。それ以外の効果はありません。
ko: RopeJoint는 두 바디의 두 점 사이에 최대 거리를 적용합니다. 다른 효과는 없습니다.

source: The S key
ja: Sキーの
ko: S 키

source: The Shape is a <a href="chainshape">ChainShape</a>.
ja: シェイプは<a href="chainshape">ChainShape</a>です。
ko: 모양은 <a href="chainshape">ChainShape</a> 입니다.

source: The Shape is a <a href="circleshape">CircleShape</a>.
ja: シェイプは<a href="circleshape">CircleShape</a>です。
ko: 모양은 <a href="circleshape">CircleShape</a> 입니다.

source: The Shape is a <a href="edgeshape">EdgeShape</a>.
ja: 形状は<a href="edgeshape">EdgeShape</a>です。
ko: 모양은 <a href="edgeshape">EdgeShape</a> 입니다.

source: The Shape is a <a href="polygonshape">PolygonShape</a>.
ja: 形状は<a href="polygonshape">PolygonShape</a>です。
ko: 모양은 <a href="polygonshape">PolygonShape</a> 입니다.

source: The SoundData to create a Source from.
ja: ソースを作成するSoundDataを元にしています。
ko: 소스를 생성 할 SoundData입니다.

source: The Source controls (play/pause/etc) act according to the following state table.
ja: ソースコントロール(再生/一時停止/その他)は、以下の状態表に従って動作します。
ko: 소스 컨트롤 (재생 / 일시 정지 등)은 다음 상태 테이블에 따라 작동합니다.

source: The Source controls (play/pause/stop) act according to the following state table.
ja: ソースコントロール(再生/一時停止/停止)は、以下の状態表に従って動作します。
ko: 소스 컨트롤 (재생 / 일시 중지 / 중지)은 다음 상태 표에 따라 작동합니다.

source: The Source to play.
ja: 遊ぶためのソース。
ko: 재생할 소스입니다.

source: The Source's volume when the listener is outside both the inner and outer cone angles.
ja: リスナーが内円錐角と外円錐角の両方の外側にいるときのソースの音量。
ko: 리스너가 내부 및 외부 원뿔 각도 둘 다 밖에있을 때 소스의 볼륨입니다.

source: The T key
ja: Tキー
ko: T 키

source: The Texture height used by the Quad.
ja: クワッドが使用するテクスチャの高さ。
ko: 쿼드에서 사용하는 텍스처 높이입니다.

source: The Texture width used by the Quad.
ja: Quad が使用するテクスチャの幅。
ko: 쿼드에서 사용하는 텍스처 폭입니다.

source: The Transform object the method was called on. Allows easily chaining Transform methods.
ja: メソッドが呼び出されたTransformオブジェクト。Transformメソッドを簡単に連結することができます。
ko: 메서드가 호출 된 Transform 개체입니다. Transform 메서드를 쉽게 연결할 수 있습니다.

source: The Transform object to apply to the current graphics coordinate transform.
ja: 現在のグラフィックス座標変換に適用する変換オブジェクト。
ko: 현재 그래픽 좌표 변환에 적용 할 Transform 개체입니다.

source: The Transform object to replace the current graphics coordinate transform with.
ja: 現在のグラフィックス座標変換を置き換えるTransformオブジェクト。
ko: 현재 그래픽 좌표 변환을 대체 할 Transform 개체입니다.

source: The U key
ja: Uキー
ko: U 키

source: The URL to open. Must be formatted as a proper URL.
ja: 開くURLです。適切なURLとしてフォーマットされている必要があります。
ko: 열 URL입니다. 올바른 URL로 형식화해야합니다.

source: The USB product ID of the joystick.
ja: ジョイスティックのUSBプロダクトIDです。
ko: 조이스틱의 USB 제품 ID입니다.

source: The USB vendor ID of the joystick.
ja: ジョイスティックのUSBベンダーIDです。
ko: 조이스틱의 USB 공급 업체 ID입니다.

source: The UTF-8 encoded unicode candidate text.
ja: UTF-8でエンコードされたユニコード候補テキスト。
ko: UTF-8로 인코딩 된 유니 코드 후보 텍스트입니다.

source: The UTF-8 encoded unicode text.
ja: UTF-8でエンコードされたユニコードテキスト。
ko: UTF-8로 인코딩 된 유니 코드 텍스트

source: The V key
ja: Vキー
ko: V 키

source: The VideoStream used for decoding and controlling the video.
ja: 動画のデコードと制御に使用される VideoStream。
ko: 비디오를 디코딩하고 제어하는 ​​데 사용되는 VideoStream입니다.

source: The W key
ja: Wキーの
ko: W 키

source: The X key
ja: Xキー
ko: X 키

source: The X part of the direction vector.
ja: 方向ベクトルのX部分。
ko: 방향 벡터의 X 부분입니다.

source: The X part of the velocity vector.
ja: 速度ベクトルのX部分。
ko: 속도 벡터의 X 부분입니다.

source: The X position of the Source.
ja: ソースのXの位置。
ko: 소스의 X 위치

source: The X position of the listener.
ja: リスナーのXの位置。
ko: 리스너의 X 위치입니다.

source: The X velocity of the listener.
ja: リスナーのX速度。
ko: 리스너의 X 속도입니다.

source: The Xbox 360 controller on Mac OS X only has support for vibration if a <a href="https://github.com/d235j/360Controller/releases">modified version</a> of the Tattiebogle driver is used.
ja: Mac OS XのXbox 360コントローラーは、Tattiebogleドライバーの<a href="https://github.com/d235j/360Controller/releases">変更されたバージョン</a>が使用されている場合にのみ振動をサポートします。
ko: Mac OS X의 Xbox 360 컨트롤러는 <a href="https://github.com/d235j/360Controller/releases">수정 된 버전</a> 의 Tattiebogle 드라이버를 사용하는 경우 진동 만 지원합니다 .

source: The Y key
ja: Yキー
ko: Y 키

source: The Y part of the direction vector.
ja: 方向ベクトルのY部分。
ko: 방향 벡터의 Y 부분입니다.

source: The Y part of the velocity vector.
ja: 速度ベクトルのY部分。
ko: 속도 벡터의 Y 부분입니다.

source: The Y position of the Source.
ja: ソースのY位置。
ko: 소스의 Y 위치

source: The Y position of the listener.
ja: リスナーのY位置。
ko: 리스너의 Y 위치입니다.

source: The Y velocity of the listener.
ja: リスナーのY速度。
ko: 청취자의 Y 속도입니다.

source: The Z key
ja: Zキー
ko: Z 키

source: The Z part of the direction vector.
ja: 方向ベクトルのZ部分。
ko: 방향 벡터의 Z 부분입니다.

source: The Z part of the velocity vector.
ja: 速度ベクトルのZ部分。
ko: 속도 벡터의 Z 부분입니다.

source: The Z position of the Source.
ja: ソースのZ位置。
ko: 소스의 Z 위치

source: The Z position of the listener.
ja: リスナーのZ位置。
ko: 리스너의 Z 위치입니다.

source: The Z velocity of the listener.
ja: リスナーのZ速度。
ko: 청취자의 Z 속도입니다.

source: The absolute path to the save directory.
ja: 保存先ディレクトリの絶対パス。
ko: 저장 디렉토리의 절대 경로입니다.

source: The address to connect to in the format "ip:port".
ja: 接続先のアドレスを「ip:port」の形式で指定します。
ko: "ip : port"형식으로 연결할 주소입니다.

source: The advantage of using a MouseJoint instead of just changing a body position directly is that collisions and reactions to other joints are handled by the physics engine.
ja: ボディの位置を直接変更するのではなく、MouseJointを使用する利点は、衝突や他のジョイントへの反応が物理エンジンによって処理されることです。
ko: 신체 위치를 직접 변경하는 대신 MouseJoint를 사용하면 물리 엔진이 다른 관절에 대한 충돌 및 반응을 처리 할 수 ​​있다는 이점이 있습니다.

source: The alignment of the text.
ja: テキストの整列。
ko: 텍스트의 정렬

source: The alignment.
ja: 整列している。
ko: 정렬.

source: The alpha channel of the color to clear the screen to.
ja: 画面をクリアする色のアルファチャンネルを指定します。
ko: 화면을 지우는 색상의 알파 채널입니다.

source: The alpha color component.
ja: アルファ色の成分です。
ko: 알파 색상 구성 요소입니다.

source: The alpha component (0-1).
ja: α成分(0-1)を表します。
ko: 알파 성분 (0-1)입니다.

source: The alpha component (0-255).
ja: α成分(0〜255)である。
ko: 알파 성분 (0-255)

source: The alpha component of the vertex color.
ja: 頂点の色のアルファ成分。
ko: 꼭짓점 색상의 알파 구성 요소입니다.

source: The alpha component of the vertex's color.
ja: 頂点の色のアルファ成分。
ko: 꼭짓점 색상의 알파 구성 요소입니다.

source: The alt-erase key on an American layout.
ja: アメリカのレイアウトのalt-eraseキー。
ko: 미국식 레이아웃의 Alt-Ease 키

source: The amount moved along the x-axis since the last time love.mousemoved was called.
ja: 前回 love.mousemoved が呼び出されてから、x軸に沿って移動した量。
ko: 마지막으로 love.mousemoved가 호출 된 이후 x 축을 따라 이동 한 양입니다.

source: The amount moved along the y-axis since the last time love.mousemoved was called.
ja: 前回 love.mousemoved が呼び出されてから、y軸に沿って移動した量。
ko: 마지막으로 love.mousemoved가 호출 된 이후로 y 축을 따라 이동했습니다.

source: The amount of air absorption applied to the Source.
ja: ソースに適用される空気の吸収量。
ko: 소스에 적용된 공기 흡수량입니다.

source: The amount of air absorption applied to the Source. Must be between 0 and 10.
ja: ソースに適用される空気吸収量。0から10の間でなければなりません。
ko: 소스에 적용된 공기 흡수량입니다. 0에서 10 사이 여야합니다.

source: The amount of alpha.
ja: αの量です。
ko: 알파의 양입니다.

source: The amount of alpha. The alpha value will be applied to all subsequent draw operations, even the drawing of an image.
ja: アルファの量です。アルファ値は、画像の描画であっても、その後のすべての描画操作に適用されます。
ko: 알파의 양입니다. 알파 값은 모든 후속 그리기 작업, 이미지 그리기에도 적용됩니다.

source: The amount of blue.
ja: ブルーの量です。
ko: 파란색의 양입니다.

source: The amount of green.
ja: 緑の量です。
ko: 녹색의 양.

source: The amount of particles per second.
ja: 1秒あたりの粒子の量です。
ko: 초당 입자의 양입니다.

source: The amount of particles to emit. The number of emitted particles will be truncated if the particle system's max <a href="particlesystem-getbuffersize">buffer size</a> is reached.
ja: 放出するパーティクルの量。パーティクルシステムの最大<a href="particlesystem-getbuffersize">バッファサイズ</a>に達した場合、放出されるパーティクルの数は切り捨てられます。
ko: 방출 할 입자의 양입니다. 파티클 시스템의 최대 <a href="particlesystem-getbuffersize">버퍼 크기</a> 에 도달 하면 방출 된 파티클 수가 잘립니다 .

source: The amount of pressure being applied. Most touch screens aren't pressure sensitive, in which case the pressure will be 1.
ja: 適用される圧力の量。ほとんどのタッチスクリーンは感圧式ではありません。
ko: 가해지는 압력의 양. 대부분의 터치 스크린은 압력에 민감하지 않으며,이 경우 압력은 1입니다.

source: The amount of red.
ja: 赤の量です。
ko: 빨강의 양.

source: The amount of spread (radians).
ja: 拡散量(ラジアン)です。
ko: 확산 량 (라디안).

source: The amount of time before repeating the key (in seconds)
ja: キーを繰り返すまでの時間(秒)
ko: 키를 반복하기 전의 시간 (초)

source: The amount of time before repeating the key (in seconds). 0 disables key repeat.
ja: キーをリピートするまでの時間(秒)を設定します。0 はキーリピートを無効にします。
ko: 키를 반복하기 전의 시간 (초)입니다. 0은 키 반복을 비활성화합니다.

source: The amount of time between repeats (in seconds)
ja: 繰り返しの間の時間(秒単位
ko: 반복 간격 (초)

source: The amount of variation (0 meaning no variation and 1 meaning full variation between start and end).
ja: 変動量(0は変動なし、1は変動開始から終了までの変動量の完全な変動を意味する)。
ko: 변동량 (0은 변동이 없음을 의미하고 1은 시작과 끝의 전체 변동을 의미 함)입니다.

source: The amount to rotate the coordinate system in radians.
ja: 座標系をラジアン単位で回転させる量。
ko: 좌표계를 라디안 단위로 회전시키는 양입니다.

source: The angle at which the arc begins.
ja: 円弧が始まる角度。
ko: 호가 시작되는 각도.

source: The angle at which the arc terminates.
ja: 円弧が終了する角度。
ko: 호가 끝나는 각도.

source: The angle in radians of the emission area.
ja: 放出領域の角度をラジアンで表したものです。
ko: 방사 영역의 라디안 각도입니다.

source: The angle in radians.
ja: ラジアン単位の角度です。
ko: 라디안 각도입니다.

source: The angle is measured in <a href="http://en.wikipedia.org/wiki/Radian">radians</a>. If you need to transform it from degrees, use <a href="http://www.lua.org/manual/5.1/manual.html#pdf-math.rad">math.rad</a>.
ja: 角度は<a href="http://en.wikipedia.org/wiki/Radian">ラジアン</a>で測定されます。度から変換する必要がある場合は、<a href="http://www.lua.org/manual/5.1/manual.html#pdf-math.rad">math.radを</a>使用してください。
ko: 각도는 <a href="http://en.wikipedia.org/wiki/Radian">라디안 단위</a> 로 측정됩니다 . 도에서 변환해야하는 경우 <a href="http://www.lua.org/manual/5.1/manual.html#pdf-math.rad">math.rad를</a> 사용 하십시오 .

source: The angle is measured in <a href="http://en.wikipedia.org/wiki/Radian">radians</a>. If you need to transform it to degrees, use <a href="http://www.lua.org/manual/5.1/manual.html#pdf-math.deg">math.deg</a>.
ja: 角度は<a href="http://en.wikipedia.org/wiki/Radian">ラジアン</a>で測定されます。度に変換する必要がある場合は、<a href="http://www.lua.org/manual/5.1/manual.html#pdf-math.deg">math.degを</a>使用してください。
ko: 각도는 <a href="http://en.wikipedia.org/wiki/Radian">라디안 단위</a> 로 측정됩니다 . 도 단위로 변환해야하는 경우 <a href="http://www.lua.org/manual/5.1/manual.html#pdf-math.deg">math.deg를</a> 사용 하십시오 .

source: The angle is measured in <a href="https://en.wikipedia.org/wiki/Radian">radians</a>. If you need to transform it from degrees, use <a href="https://www.lua.org/manual/5.1/manual.html#pdf-math.rad">math.rad</a>.
ja: 角度は<a href="https://en.wikipedia.org/wiki/Radian">ラジアン</a>で測定されます。度から変換する必要がある場合は、<a href="https://www.lua.org/manual/5.1/manual.html#pdf-math.rad">math.radを</a>使用してください。
ko: 각도는 <a href="https://en.wikipedia.org/wiki/Radian">라디안 단위</a> 로 측정됩니다 . 각도에서 변환해야하는 경우 <a href="https://www.lua.org/manual/5.1/manual.html#pdf-math.rad">math.rad를</a> 사용 하십시오 .

source: The angle is measured in <a href="https://en.wikipedia.org/wiki/Radian">radians</a>. If you need to transform it to degrees, use <a href="https://www.lua.org/manual/5.1/manual.html#pdf-math.deg">math.deg</a>.
ja: 角度は<a href="https://en.wikipedia.org/wiki/Radian">ラジアン</a>で測定されます。度に変換する必要がある場合は、<a href="https://www.lua.org/manual/5.1/manual.html#pdf-math.deg">math.degを</a>使用してください。
ko: 각도는 <a href="https://en.wikipedia.org/wiki/Radian">라디안 단위</a> 로 측정됩니다 . 각도로 변환해야하는 경우 <a href="https://www.lua.org/manual/5.1/manual.html#pdf-math.deg">math.deg를</a> 사용 하십시오 .

source: The angular damping is the
ja: 角ダンピングは
ko: 각도 감쇠는

source: The angular velocity in radians/second.
ja: ラジアン/秒単位の角速度。
ko: 라디안 / 초 단위의 각속도.

source: The angular velocity is the
ja: 角速度は
ko: 각속도는

source: The apostrophe key on an American layout.
ja: アメリカのレイアウトのアポストロフィーキー。
ko: 미국식 레이아웃의 아포스트로피 키.

source: The application key on an American layout. Windows contextual menu, compose key.
ja: アメリカのレイアウトのアプリケーションキー。Windowsのコンテキストメニュー、作曲キー。
ko: 미국식 레이아웃의 응용 프로그램 키 Windows 상황에 맞는 메뉴, 작성 키.

source: The arc circle's two end-points are connected to each other.
ja: アークサークルの2つの端点は、互いに接続されています。
ko: 원호의 두 끝 점이 서로 연결되어 있습니다.

source: The arc circle's two end-points are unconnected when the arc is drawn as a line. Behaves like the "closed" arc type when the arc is drawn in filled mode.
ja: 円弧が線として描かれているとき、円弧の2つの端点は連結されていません。円弧が塗りつぶしモードで描かれているときは、「閉じた」円弧タイプのように振る舞います。
ko: 호가 선으로 그려 질 때 호 원의 두 끝점은 연결되지 않습니다. 채워진 모드에서 호를 그릴 때 "닫힌"호 유형처럼 동작합니다.

source: The arc is drawn counter clockwise if the starting angle is numerically bigger than the final angle. The arc is drawn clockwise if the final angle is numerically bigger than the starting angle.
ja: 開始角度が最終角度よりも数値的に大きい場合、円弧は反時計回りに描かれます。最終的な角度が開始角度よりも数値的に大きい場合、円弧は時計回りに描かれます。
ko: 시작 각도가 최종 각도보다 숫자가 크면 호는 시계 반대 방향으로 그려집니다. 최종 각도가 시작 각도보다 숫자 적으로 크면 호가 시계 방향으로 그려집니다.

source: The arc is drawn like a slice of pie, with the arc circle connected to the center at its end-points.
ja: 円弧はパイのスライスのように描かれており、その端点で円弧の円が中心に接続されています。
ko: 호는 파이 조각처럼 그려지며 호 원은 끝점의 중심에 연결됩니다.

source: The arguments are in the same order as the vertex attributes in the Mesh's <a href="mesh-getvertexformat">vertex format</a>. A standard Mesh that wasn't <a href="love.graphics.newmesh">created</a> with a custom vertex format will use two position numbers, two texture coordinate numbers, and four color components per vertex: x, y, u, v, r, g, b, a.
ja: 引数は、メッシュの<a href="mesh-getvertexformat">頂点フォーマット</a>の頂点属性と同じ順序です。カスタム頂点フォーマットで<a href="love.graphics.newmesh">作成され</a>なかった標準メッシュは、2つの位置番号、2つのテクスチャ座標番号、および頂点ごとに4つのカラーコンポーネント（x、y、u、v、r、g、b、a）を使用します。
ko: 인수는 메쉬의 <a href="mesh-getvertexformat">정점 형식</a> 에서 정점 속성과 순서가 같습니다 . 커스텀 버텍스 형식으로 <a href="love.graphics.newmesh">생성</a> 되지 않은 표준 메쉬는 두 개의 위치 번호, 두 개의 텍스처 좌표 숫자 및 버텍스 당 네 가지 색상 구성 요소 (x, y, u, v, r, g, b, a)를 사용합니다.

source: The ascent of the Font in pixels.
ja: ピクセル単位でのフォントの上昇。
ko: 폰트의 픽셀 단위의 상승입니다.

source: The audio Source used for audio playback, or nil if the video has no audio.
ja: オーディオ再生に使用されるオーディオソース、またはビデオにオーディオがない場合は nil。
ko: 오디오 재생에 사용되는 오디오 소스이거나 비디오에 오디오가 없으면 nil입니다.

source: The audio Source used for audio playback, or nil to disable audio synchronization.
ja: オーディオ再生に使用されるオーディオソース、またはオーディオ同期を無効にするには nil を指定します。
ko: 오디오 재생에 사용되는 오디오 소스 또는 오디오 동기화를 비활성화하려면 nil.

source: The audio is decoded in chunks when needed.
ja: 音声は必要に応じてチャンク単位でデコードされます。
ko: 오디오는 필요할 때 청크 단위로 디코딩됩니다.

source: The audio must be <a href="source-queue">manually queued</a> by the user.
ja: オーディオは、ユーザーが<a href="source-queue">手動でキューに入れる</a>必要があります。
ko: 오디오는 사용자 가 <a href="source-queue">수동으로 대기열</a> 에 넣어야합니다 .

source: The audio mute key on an American layout.
ja: アメリカのレイアウトのオーディオミュートキー。
ko: 미국식 레이아웃의 오디오 음소거 키.

source: The audio next track key on an American layout.
ja: アメリカのレイアウトのオーディオネクストトラックキー。
ko: 미국식 레이아웃의 오디오 다음 트랙 키.

source: The audio play key on an American layout.
ja: アメリカンなレイアウトのオーディオプレイキー。
ko: 미국식 레이아웃의 오디오 재생 키.

source: The audio previous track key on an American layout.
ja: アメリカのレイアウトのオーディオ前のトラックキー。
ko: 미국식 레이아웃의 오디오 이전 트랙 키.

source: The audio stop key on an American layout.
ja: アメリカンなレイアウトのオーディオストップキー。
ko: 미국식 레이아웃의 오디오 정지 키.

source: The average delta time over the last second.
ja: 秒間の平均デルタタイム。
ko: 마지막 1 초 동안의 평균 델타 시간.

source: The axis number.
ja: 軸番号です。
ko: 축 번호.

source: The axis to be checked
ja: チェックする軸
ko: 점검 할 축

source: The back-tick / grave key on an American layout.
ja: アメリカのレイアウトのバックティック/グレイブキー。
ko: 미국식 배치의 백틱 / 묘목 키.

source: The backslash key on an American layout.
ja: アメリカのレイアウトのバックスラッシュキー。
ko: 미국식 레이아웃의 백 슬래시 키

source: The ball to be checked
ja: チェックするボール
ko: 확인할 공

source: The base type of the variable.
ja: 変数の基底型。
ko: 변수의 기본 유형입니다.
